{
  "doi": "10.1145/3544548.3580791",
  "title": "Don’t Look at the Data! How Differential Privacy Reconfigures the Practices of Data Science",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Across academia, government, and industry, data stewards are facing increasing pressure to make datasets more openly accessible for researchers while also protecting the privacy of data subjects. Differential privacy (DP) is one promising way to offer privacy along with open access, but further inquiry is needed into the tensions between DP and data science. In this study, we conduct interviews with 19 data practitioners who are non-experts in DP as they use a DP data analysis prototype to release privacy-preserving statistics about sensitive data, in order to understand perceptions, challenges, and opportunities around using DP. We find that while DP is promising for providing wider access to sensitive datasets, it also introduces challenges into every stage of the data science workflow. We identify ethics and governance questions that arise when socializing data scientists around new privacy constraints and offer suggestions to better integrate DP and data science.",
  "tags": [
    "data practitioners",
    "privacy",
    "data analysis",
    "open access",
    "utility"
  ],
  "authors": [
    {
      "name": "Jayshree Sarathy",
      "institution": "John A. Paulson School of Engineering and Applied Sciences, Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782773",
      "orcid": "0000-0001-5852-5182"
    },
    {
      "name": "Sophia Song",
      "institution": "UC Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780057",
      "orcid": "0000-0001-8163-2023"
    },
    {
      "name": "Audrey Haque",
      "institution": "John A. Paulson School of Engineering and Applied Sciences, Graduate School of Design, Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780071",
      "orcid": "0000-0002-8584-1524"
    },
    {
      "name": "Tania Schlatter",
      "institution": "Institute for Quantitative Social Science, Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82758610157",
      "orcid": "0000-0001-6857-659X"
    },
    {
      "name": "Salil Vadhan",
      "institution": "John A. Paulson School of Engineering and Applied Sciences, Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100534484",
      "orcid": "0000-0002-4059-4072"
    }
  ],
  "references": [
    {
      "text": "John Abowd, Robert Ashmead, Ryan Cumings-Menon, Simson Garfinkel, Micah Heineck, Christine Heiss, Robert Johns, Daniel Kifer, Philip Leclerc, Ashwin Machanavajjhala, Brett Moran, William Sexton, Matthew Spence, and Pavel Zhuravlev. 2022. The 2020 Census Disclosure Avoidance System TopDown Algorithm. Harvard Data Science Review Special Issue 2 (jun 24 2022), 42 – 79. https://hdsr.mitpress.mit.edu/pub/7evz361i.",
      "doi": ""
    },
    {
      "text": "John M Abowd. 2018. The US Census Bureau adopts differential privacy. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. Association for Computing Machinery, New York, NY, USA, 2867–2867.",
      "doi": "10.1145/3219819.3226070"
    },
    {
      "text": "Nitin Agrawal, Reuben Binns, Max Van Kleek, Kim Laine, and Nigel Shadbolt. 2021. Exploring design and governance challenges in the development of privacy-preserving computation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3411764.3445677"
    },
    {
      "text": "Micah Altman, Aloni Cohen, Kobbi Nissim, and Alexandra Wood. 2021. What a hybrid legal-technical analysis teaches us about privacy regulation: The case of singling out. BUJ Sci. & Tech. L. 27(2021), 1.",
      "doi": ""
    },
    {
      "text": "Borja Balle, Gilles Barthe, and Marco Gaboardi. 2018. Privacy amplification by subsampling: Tight analyses via couplings and divergences. Advances in Neural Information Processing Systems 31 (2018), 1–9.",
      "doi": ""
    },
    {
      "text": "Solon Barocas and Danah Boyd. 2017. Engaging the ethics of data science in practice. Commun. ACM 60, 11 (2017), 23–25.",
      "doi": "10.1145/3144172"
    },
    {
      "text": "danah boyd and Jayshree Sarathy. 2022. Differential Perspectives: Epistemic Disconnects Surrounding the US Census Bureau’s Use of Differential Privacy. Harvard Data Science Review Special Issue 2 (2022), 172–187.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2021. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative research in psychology 18, 3 (2021), 328–352.",
      "doi": ""
    },
    {
      "text": "Mihai Budiu, Pratiksha Thaker, Parikshit Gopalan, Udi Wieder, and Matei Zaharia. 2022. Overlook: Differentially Private Exploratory Visualization for Big Data. Journal of Privacy and Confidentiality 12, 1 (2022), 1–33.",
      "doi": ""
    },
    {
      "text": "Brooke Bullek, Stephanie Garboski, Darakhshan J Mir, and Evan M Peck. 2017. Towards understanding differential privacy: When do people trust randomized response technique?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3833–3837.",
      "doi": "10.1145/3025453.3025698"
    },
    {
      "text": "Mark Bun, Jörg Drechsler, Marco Gaboardi, Audra McMillan, and Jayshree Sarathy. 2022. Controlling Privacy Loss in Sampling Schemes: An Analysis of Stratified and Cluster Sampling. In 3rd Symposium on Foundations of Responsible Computing (FORC 2022). Schloss Dagstuhl-Leibniz-Zentrum für Informatik, Germany, 1–24.",
      "doi": ""
    },
    {
      "text": "Sylvia M Burwell, Steven VanRoekel, Todd Park, and Dominic J Mancini. 2013. Open data policy—managing information as an asset. Executive Office of the President 13 (2013), 13.",
      "doi": ""
    },
    {
      "text": "Merce Crosas. 2011. The dataverse network®: an open-source application for sharing, discovering and preserving data.",
      "doi": ""
    },
    {
      "text": "Rachel Cummings, Gabriel Kaptchuk, and Elissa M Redmiles. 2021. \" I need a better description\": An Investigation Into User Expectations For Differential Privacy. In Proceedings of the 2021 ACM SIGSAC Conference on Computer and Communications Security. Association for Computing Machinery, New York, NY, USA, 3037–3052.",
      "doi": "10.1145/3460120.3485252"
    },
    {
      "text": "Tamraparni Dasu and Theodore Johnson. 2003. Exploratory data mining and data cleaning. John Wiley & Sons, Hoboken, NJ.",
      "doi": "10.5555/861869"
    },
    {
      "text": "Jörg Drechsler. 2022. Differential Privacy for Government Agencies—Are We There Yet?J. Amer. Statist. Assoc. just-accepted (2022), 1–24.",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork, Vitaly Feldman, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Aaron Roth. 2015. The reusable holdout: Preserving validity in adaptive data analysis. Science 349, 6248 (2015), 636–638.",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork, Nitin Kohli, and Deirdre Mulligan. 2019. Differential privacy in practice: Expose your epsilons!Journal of Privacy and Confidentiality 9, 2 (2019), 1–22.",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork and Jing Lei. 2009. Differential privacy and robust statistics. In Proceedings of the forty-first annual ACM symposium on Theory of computing. Association for Computing Machinery, New York, NY, USA, 371–380.",
      "doi": "10.1145/1536414.1536466"
    },
    {
      "text": "Cynthia Dwork, Frank McSherry, Kobbi Nissim, and Adam Smith. 2006. Calibrating noise to sensitivity in private data analysis. In Theory of cryptography conference. Springer, Berlin, Heidelberg, 265–284.",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork, Aaron Roth, 2014. The algorithmic foundations of differential privacy. Foundations and Trends® in Theoretical Computer Science 9, 3–4(2014), 211–407.",
      "doi": ""
    },
    {
      "text": "Cynthia Dwork, Adam Smith, Thomas Steinke, and Jonathan Ullman. 2017. Exposed! a survey of attacks on private data. Annual Review of Statistics and Its Application 4 (2017), 61–84.",
      "doi": ""
    },
    {
      "text": "Úlfar Erlingsson, Vasyl Pihur, and Aleksandra Korolova. 2014. Rappor: Randomized aggregatable privacy-preserving ordinal response. In Proceedings of the 2014 ACM SIGSAC conference on computer and communications security. Association for Computing Machinery, New York, NY, USA, 1054–1067.",
      "doi": "10.1145/2660267.2660348"
    },
    {
      "text": "Ilker Etikan, Sulaiman Abubakar Musa, Rukayya Sunusi Alkassim, 2016. Comparison of convenience sampling and purposive sampling. American journal of theoretical and applied statistics 5, 1 (2016), 1–4.",
      "doi": ""
    },
    {
      "text": "Marco Gaboardi, Michael Hay, and Salil Vadhan. 2020. A programming framework for OpenDP.",
      "doi": ""
    },
    {
      "text": "Marco Gaboardi, James Honaker, Gary King, Jack Murtagh, Kobbi Nissim, Jonathan Ullman, and Salil Vadhan. 2016. Psi: a private data sharing interface. (2016).",
      "doi": ""
    },
    {
      "text": "Gonzalo Munilla Garrido, Xiaoyuan Liu, Florian Matthes, and Dawn Song. 2022. Lessons Learned: Surveying the Practicality of Differential Privacy in the Industry. Proceedings of Privacy Enhancing Technologies Symposium To Appear (2022), n/a.",
      "doi": ""
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé Iii, and Kate Crawford. 2021. Datasheets for datasets. Commun. ACM 64, 12 (2021), 86–92.",
      "doi": "10.1145/3458723"
    },
    {
      "text": "Sergiu Gherghina and Alexia Katsanidou. 2013. Data availability in political science journals. European Political Science 12 (2013), 333–349.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2016. Apple’s’ differential privacy’is about collecting your data—but not your data.(2016). URL www. wired. com/2016/06/apples-differential-privacy-collecting-data.",
      "doi": ""
    },
    {
      "text": "Keith Grint and Steve Woolgar. 1997. The Machine at Work: Technology, Work and Organization. John Wiley & Sons, Hoboken,NJ.",
      "doi": ""
    },
    {
      "text": "Philip Guo. 2013. Data science workflow: Overview and challenges.",
      "doi": ""
    },
    {
      "text": "Seda Gürses and Jose M Del Alamo. 2016. Privacy engineering: Shaping an emerging field of research and practice. IEEE Security & Privacy 14, 2 (2016), 40–46.",
      "doi": "10.1109/MSP.2016.37"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 17–24.",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Peter Kairouz, Sewoong Oh, and Pramod Viswanath. 2015. The composition theorem for differential privacy. In International conference on machine learning(Lille, France). JMLR.org, N/A, 1376–1385.",
      "doi": ""
    },
    {
      "text": "Gary King. 2007. An introduction to the dataverse network as an infrastructure for data sharing., 173–199 pages.",
      "doi": ""
    },
    {
      "text": "Clayton Lewis and John Rieman. 1993. Task-centered user interface design: a practical introduction.",
      "doi": ""
    },
    {
      "text": "Ashwin Machanavajjhala, Daniel Kifer, John Abowd, Johannes Gehrke, and Lars Vilhuber. 2008. Privacy: Theory meets practice on the map. In 2008 IEEE 24th international conference on data engineering. IEEE, Cancun, Mexico, 277–286.",
      "doi": "10.1109/ICDE.2008.4497436"
    },
    {
      "text": "Jack Murtagh, Kathryn Taylor, George Kellaris, and Salil Vadhan. 2018. Usable differential privacy: A case study with PSI. (2018).",
      "doi": ""
    },
    {
      "text": "Jack Murtagh and Salil Vadhan. 2016. The complexity of computing the optimal composition of differential privacy. In Theory of Cryptography Conference. Springer, Berlin, 157–175.",
      "doi": "10.1007/978-3-662-49096-9_7"
    },
    {
      "text": "Priyanka Nanayakkara, Johes Bater, Xi He, Jessica Hullman, and Jennie Rogers. 2022. Visualizing Privacy-Utility Trade-Offs in Differentially Private Data Releases. In Proceedings on Privacy Enhancing Technologies, Vol. 2. Sciendo, Sydney, Australia, 601–618.",
      "doi": ""
    },
    {
      "text": "Arvind Narayanan and Vitaly Shmatikov. 2008. Robust de-anonymization of large sparse datasets. In 2008 IEEE Symposium on Security and Privacy (sp 2008). IEEE Computer Society, USA, 111–125.",
      "doi": "10.1109/SP.2008.33"
    },
    {
      "text": "Joe Near. 2018. Differential privacy at scale: Uber and Berkeley collaboration.",
      "doi": ""
    },
    {
      "text": "Kobbi Nissim, Aaron Bembenek, Alexandra Wood, Mark Bun, Marco Gaboardi, Urs Gasser, David R O’Brien, Thomas Steinke, and Salil Vadhan. 2017. Bridging the gap between computer science and legal approaches to privacy. Harv. JL & Tech. 31(2017), 687.",
      "doi": ""
    },
    {
      "text": "Daniel L Oberski and Frauke Kreuter. 2020. Differential privacy and social science: An urgent puzzle. Harvard Data Science Review: HDSR 2, 1 (2020), 1–21.",
      "doi": ""
    },
    {
      "text": "Lucy Qin, Andrei Lapets, Frederick Jansen, Peter Flockhart, Kinan Bab, Ira Globus-Harris, Shannon Roberts, and Mayank Varia. 2019. From usability to secure computing and back again. In Fifteenth Symposium on Usable Privacy and Security (Santa Clara, CA, USA). USENIX Association, USA, 191–210.",
      "doi": ""
    },
    {
      "text": "Mary Anne Smart, Dhruv Sood, and Kristen Vaccaro. 2022. Understanding Risks of Privacy Theater with Differential Privacy. Proceedings of the ACM on Human-Computer Interaction 6, CSCW2(2022), 1–24.",
      "doi": "10.1145/3555762"
    },
    {
      "text": "John W Tukey 1977. Exploratory data analysis. Vol. 2. Pearson, Reading, MA.",
      "doi": ""
    },
    {
      "text": "Sven Vlaeminck, Lisa-Kristin Herrmann, 2015. Data Policies and Data Archives: A New Paradigm for Academic Publishing in Economic Sciences?. In ELPUB. n/a, n/a, 145–155.",
      "doi": ""
    },
    {
      "text": "Hollie White, Sarah Carrier, Abbey Thompson, Jane Greenberg, and Ryan Scherle. 2008. The Dryad Data Repository: A Singapore Framework Metadata Architecture in a DSpace Environment.. In Dublin core conference. Dublin Core Metadata Initiative, Berlin, Germany, 157–162.",
      "doi": ""
    },
    {
      "text": "Aiping Xiong, Tianhao Wang, Ninghui Li, and Somesh Jha. 2020. Towards effective differential privacy communication for users’ data sharing decision and comprehension. In 2020 IEEE Symposium on Security and Privacy (SP). IEEE Computer Society, USA, 392–410.",
      "doi": ""
    }
  ]
}