{
  "doi": "10.1145/3544548.3581281",
  "title": "Creating Inclusive Voices for the 21st Century: A Non-Binary Text-to-Speech for Conversational Assistants",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "As voice assistant usage continues to grow, their homogeneity becomes even more problematic with the UNESCO report, “I’d Blush if I could” showing that designing only feminine voice assistants encourages negative behavior, both with virtual assistants and with real people [3]. While masculine text-to-speech (TTS) voices exist, ones that cover the full range of gender presentations, such as non-binary or gender-ambiguous voices are largely missing. In this paper, we present a method of creating a non-binary TTS voice and an example voice, Sam, created with input from the non-binary and transgender communities. We have open-sourced the resulting voice, along with the process and data used to create it. Finally, we present results from a large-scale survey showing that non-binary individuals are more likely to prefer a non-binary voice assistant compared to cisgendered individuals and discuss differences across age and gender.",
  "tags": [
    "text-to-speech",
    "voice assistants",
    "gender",
    "voice user interfaces."
  ],
  "authors": [
    {
      "name": "Andreea Danielescu",
      "institution": "Accenture Labs, United States",
      "img": "/do/10.1145/contrib-81444607832/rel-imgonly/81444607832.png",
      "acmid": "81444607832",
      "orcid": "0000-0001-7460-2467"
    },
    {
      "name": "Sharone A Horowit-Hendler",
      "institution": "Institute of Reading Development, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781439",
      "orcid": "0000-0003-1586-818X"
    },
    {
      "name": "Alexandria Pabst",
      "institution": "Accenture Labs, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782094",
      "orcid": "0000-0002-5130-5109"
    },
    {
      "name": "Kenneth Michael Stewart",
      "institution": "Accenture Labs, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81539996656",
      "orcid": "0000-0002-7719-5796"
    },
    {
      "name": "Eric M Gallo",
      "institution": "Accenture Labs, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233313",
      "orcid": "0000-0001-9086-3480"
    },
    {
      "name": "Matthew Peter Aylett",
      "institution": "CereProc Ltd., United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613795",
      "orcid": "0000-0001-7057-0525"
    }
  ],
  "references": [
    {
      "text": "2018. 5 Ways Voice Assistance is reshaping consumer behavior - think with google. https://www.thinkwithgoogle.com/consumer-insights/voice-assistance-consumer-experience/",
      "doi": ""
    },
    {
      "text": "2018. Meet Pegg, a gender-neutral robot assistant. https://www.pri.org/stories/2018-03-28/meet-pegg-gender-neutral-robot-assistant",
      "doi": ""
    },
    {
      "text": "2019. I’d blush if I could:closing gender divides in digital skills through education. https://en.unesco.org/events/id-blush-if-i-couldclosing-gender-divides-digital-skills-through-education",
      "doi": ""
    },
    {
      "text": "2022. GenderLess Voice. https://www.genderlessvoice.com/",
      "doi": ""
    },
    {
      "text": "2022. The Hippocratic License. https://firstdonoharm.dev/",
      "doi": ""
    },
    {
      "text": "Mark Webster Oct 27, Mark Webster, Words by Mark Webster Mark Webster is Director of Product at Adobe, Words by Mark Webster, Mark Webster is Director of Product at Adobe, Kim Pimmel, Dan Silveira, and Linn Vizard. 2020. Voice Technology’s role in our rapidly changing world: Adobe XD ideas. https://xd.adobe.com/ideas/principles/emerging-technology/voice-technologys-role-in-rapidly-changing-world/",
      "doi": ""
    },
    {
      "text": "Alex A Ahmed. 2018. Trans competent interaction design: a qualitative study on voice, identity, and technology. Interacting with Computers 30, 1 (2018), 53–71.",
      "doi": ""
    },
    {
      "text": "Charles Arthur. 2013. Why the default settings on your device should be right first time. https://www.theguardian.com/technology/2013/dec/01/default-settings-change-phones-computers",
      "doi": ""
    },
    {
      "text": "R. J. Baken and Robert F. Orlikoff. 2010. Clinical measurement of speech and voice. Delmar Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Rollin Brant. 1990. Assessing proportionality in the proportional odds model for ordinal logistic regression. Biometrics (1990), 1171–1178.",
      "doi": ""
    },
    {
      "text": "Deborah Cameron and Don Kulick. 2010. Language and sexuality. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Cristobal.baeza. 2020. The degendering of voice assistants. https://www.bbva.com/en/the-degendering-of-voice-assistants/",
      "doi": ""
    },
    {
      "text": "Cercas A Curry. 2020. Conversational Assistants and Gender Stereotypes: Public Perceptions and Desiderata for Voice Personas. Proceedings of the Second Workshop on Gender Bias in Natural Language Processing (2020), 72–78.",
      "doi": ""
    },
    {
      "text": "Andreea Danielescu. 2020. Eschewing Gender Stereotypes in Voice Assistants to Promote Inclusion. CUI ’20: Proceedings of the 2nd Conference on Conversational User Interfaces, 1–3. https://doi.org/10.1145/3405755.3406151",
      "doi": "10.1145/3405755.3406151"
    },
    {
      "text": "Andreea Danielescu and Gwen Christian. 2018. A Bot is Not a Polyglot: Designing Personalities for Multi-Lingual Conversational Agents. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, 1–9. https://doi.org/10.1145/3170427.3174366",
      "doi": "10.1145/3170427.3174366"
    },
    {
      "text": "Shelagh Davies and Joshua M. Goldberg. 2006. Clinical aspects of transgender speech feminization and masculinization. International Journal of Transgenderism 9, 3-4 (2006), 167–196. https://doi.org/10.1300/j485v09n03_08",
      "doi": ""
    },
    {
      "text": "Sonia Elks. 2019. Alexa, are you male or female? ’sexist’ virtual assistants go gender-neutral. https://www.reuters.com/article/us-global-tech-women/alexa-are-you-male-or-female-sexist-virtual-assistants-go-gender-neutral-idUSKBN1QS25B",
      "doi": ""
    },
    {
      "text": "AW Geiger and N Garf. 2019. About one-in-five U.S. adults know someone who goes by a gender-neutral pronoun.",
      "doi": ""
    },
    {
      "text": "Marylou Pausewang Gelfer and Kevin J. Schofield. 2000. Comparison of acoustic and perceptual measures of voice in male-to-female transsexuals perceived as female versus those perceived as male. Journal of Voice 14, 1 (2000), 22–33. https://doi.org/10.1016/s0892-1997(00)80092-2",
      "doi": ""
    },
    {
      "text": "Brandon Griggs. 2011. Why computer voices are mostly female | CNN business. https://www.cnn.com/2011/10/21/tech/innovation/female-computer-voices/index.html",
      "doi": ""
    },
    {
      "text": "Adrienne Hancock, Lindsey Colton, and Fiacre Douglas. 2014. Intonation and gender perception: Applications for transgender speakers. Journal of Voice 28, 2 (2014), 203–209. https://doi.org/10.1016/j.jvoice.2013.08.009",
      "doi": ""
    },
    {
      "text": "Charles Hannon. 2016. GENDER AND STATUS IN VOICE USER INTERFACES. Interactions (Jun 2016). https://interactions.acm.org/archive/view/may-june-2016/gender-and-status-in-voice-user-interfaces",
      "doi": ""
    },
    {
      "text": "Maxwell Hope and Evan Bradley. 2019. Vocal pitch and intonation characteristics of those who are gender non-binary.",
      "doi": ""
    },
    {
      "text": "Maxwell Hope and Jason Lilley. 2020. Cues for perception of gender in synthetic voices and the role of Identity. Interspeech 2020 (2020). https://doi.org/10.21437/interspeech.2020-2657",
      "doi": ""
    },
    {
      "text": "Sharone Horowit-Hendler. 2017. Navigating a Binary World When You’re Not: Gender Presentation of Non-Binary Individuals.",
      "doi": ""
    },
    {
      "text": "Samantha Jaroszewski, Danielle Lottridge, Oliver L Haimson, and Katie Quehl. 2018. \" Genderfluid\" or\" Attack Helicopter\" Responsible HCI Research Practice with Non-binary Gender Variation in Online Communities. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3173574.3173881"
    },
    {
      "text": "Keith Johnson. 2006. Resonance in an exemplar-based lexicon: The emergence of social identity and phonology. Journal of Phonetics 34, 4 (2006), 485–499. https://doi.org/10.1016/j.wocn.2005.08.004",
      "doi": ""
    },
    {
      "text": "Keith Johnson and Matthias J. Sjerps. 2021. Speaker normalization in speech perception. The Handbook of Speech Perception(2021), 145–176. https://doi.org/10.1002/9781119184096.ch6",
      "doi": ""
    },
    {
      "text": "Jeffrey M. Jones. 2021. LGBT identification rises to 5.6estimate. https://news.gallup.com/poll/329708/lgbt-identification-rises-latest-estimate.aspx",
      "doi": ""
    },
    {
      "text": "Stina Hasse Jørgensen. 2021. The generation of a [multi’vocal] voice. Seismograf/DMT (6 April 2021). https://doi.org/10.48233/SEISMOGRAF2612",
      "doi": ""
    },
    {
      "text": "Anna Kai Jørgensen. 2016. SPEAKING (OF) GENDER: A sociolinguistic exploration of voice and transgender identity. Ph. D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Don Kulick. 1999. Transgender and language: A review of the literature and suggestions for the future. GLQ: A Journal of Lesbian and Gay Studies 5, 4 (1999), 605–622. https://doi.org/10.1215/10642684-5-4-605",
      "doi": ""
    },
    {
      "text": "L Kunze. 2019. How to deprogram homicidal sex robots.",
      "doi": ""
    },
    {
      "text": "Russell V. Lenth. 2022. emmeans: Estimated Marginal Means, aka Least-Squares Means. https://CRAN.R-project.org/package=emmeans R package version 1.8.1-1.",
      "doi": ""
    },
    {
      "text": "Calvin A. Liang, Sean A. Munson, and Julie A. Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Transactions on Computer-Human Interaction 28 (4 2021). Issue 2. https://doi.org/10.1145/3443686",
      "doi": "10.1145/3443686"
    },
    {
      "text": "National Public Media. 2022.. https://www.nationalpublicmedia.com/insights/reports/smart-audio-report/",
      "doi": ""
    },
    {
      "text": "Matthew Mills and Gillie Stoneham. 2017. The Voice Book for trans and non-binary people a practical guide to creating and sustaining authentic voice and Communication. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Wade J. Mitchell, Chin-Chang Ho, Himalaya Patel, and Karl F. MacDorman. 2011. Does social desirability bias favor humans? explicit–implicit evaluations of synthesized speech support a new HCI model of impression management. Computers in Human Behavior 27, 1 (2011), 402–412. https://doi.org/10.1016/j.chb.2010.09.002",
      "doi": "10.1016/j.chb.2010.09.002"
    },
    {
      "text": "John W. Mullennix, Keith A. Johnson, Meral Topcu—Durgun, and Lynn M. Farnsworth. 1995. The Perceptual Representation of Voice gender. The Journal of the Acoustical Society of America 98, 6 (1995), 3080–3095. https://doi.org/10.1121/1.413832",
      "doi": ""
    },
    {
      "text": "Clifford Nass. 2010. Man who lied to his laptop: The new research on human relationships. Portfolio Penguin.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R. Tauber. 1994. Computers are social actors. Conference companion on Human factors in computing systems - CHI ’94 (1994). https://doi.org/10.1145/259963.260288",
      "doi": "10.1145/259963.260288"
    },
    {
      "text": "Clifford Ivar Nass and Scott Brave. 2007. Wired for speech: How voice activates and advances the human-computer relationship. MIT.",
      "doi": ""
    },
    {
      "text": "Jillian J.M. O’Connor and Pat Barclay. 2017. The influence of voice pitch on perceptions of trustworthiness across social contexts. Evolution and Human Behavior 38, 4 (2017), 506–512. https://doi.org/10.1016/j.evolhumbehav.2017.03.001",
      "doi": ""
    },
    {
      "text": "Matthew Panzarino. 2021. Apple adds two brand new Siri Voices and will no longer default to a female or male voice in IOS. https://techcrunch.com/2021/03/31/apple-adds-two-siri-voices/",
      "doi": ""
    },
    {
      "text": "James W. Pennebaker. 2013. The secret life of pronouns: What our words say about us. Bloomsbury Press.",
      "doi": ""
    },
    {
      "text": "Guilherme Colucci Pereira and Maria Cecilia Calani Baranauskas. 2018. Codesigning emancipatory systems: a study on mobile applications and lesbian, gay, bisexual, and transgender (LGBT) issues. Journal on Interactive Systems 9, 3 (2018).",
      "doi": ""
    },
    {
      "text": "Cyril R. Pernet and Pascal Belin. 2012. The role of pitch and timbre in voice gender categorization. Frontiers in Psychology 3 (2012). https://doi.org/10.3389/fpsyg.2012.00023",
      "doi": ""
    },
    {
      "text": "Victoria Petrock. 2019. US Voice assistant users 2019. https://www.emarketer.com/content/us-voice-assistant-users-2019",
      "doi": ""
    },
    {
      "text": "Harris Poll. 2017..",
      "doi": ""
    },
    {
      "text": "Blaise Potard, Matthew P Aylett, David A Baude, and Petr Motlicek. 2016. Idlak Tangle: An Open Source Kaldi Based Parametric Speech Synthesiser Based on DNN.. In INTERSPEECH. 2293–2297.",
      "doi": ""
    },
    {
      "text": "Cami Rincón, Os Keyes, and Corinne Cath. 2021. Speaking from experience. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–27. https://doi.org/10.1145/3449206",
      "doi": "10.1145/3449206"
    },
    {
      "text": "Morgan Klaus Scheuerman, Aaron Jiang, Katta Spiel, and Jed R Brubaker. 2021. Revisiting gendered web forms: An evaluation of gender inputs with (non-) binary people. In Proceedings of the 2021 CHI conference on human factors in computing systems. 1–18.",
      "doi": "10.1145/3411764.3445742"
    },
    {
      "text": "Katie Seaborn, Norihisa P. Miyake, Peter Pennefather, and Mihoko Otake-Matsuura. 2021. Voice in human-agent interaction: A survey. Comput. Surveys 54 (7 2021), 1–43. Issue 4. https://doi.org/10.1145/3386867",
      "doi": "10.1145/3386867"
    },
    {
      "text": "Treavian Simmons. 2018. Gender isn’t a Haircut: How representation of nonbinary people of color requires more than white androgyny. https://www.colorbloq.org/article/gender-isnt-a-haircut-how-representation-of-nonbinary-people-of-color-requires-more-than-white-androgyny",
      "doi": ""
    },
    {
      "text": "Verena G. Skuk and Stefan R. Schweinberger. 2014. Influences of fundamental frequency, formant frequencies, aperiodicity, and spectrum level on the perception of voice gender. Journal of Speech, Language, and Hearing Research 57, 1 (2014), 285–296. https://doi.org/10.1044/1092-4388(2013/12-0314)",
      "doi": ""
    },
    {
      "text": "Katta Spiel. 2021. ” Why are they all obsessed with Gender?”—(Non) binary Navigations through Technological Infrastructures. In Designing Interactive Systems Conference 2021. 478–494.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Os Keyes, and Pınar Barlas. 2019. Patching gender: Non-binary utopias in HCI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290607.3310425"
    },
    {
      "text": "Denny L Starks, Tawanna Dillahunt, and Oliver L Haimson. 2019. Designing technology to support safety for transgender women & non-binary people of color. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion. 289–294.",
      "doi": "10.1145/3301019.3323898"
    },
    {
      "text": "Jennifer Anne Stevens. 1990. From masculine to feminine and all points in between: A practical guide for transvestites, cross-dressers, transgenderists, transsexuals, or those who choose to develop a more feminine image... and for all others who are interested, concerned, or curious. Different Path Press.",
      "doi": ""
    },
    {
      "text": "Yolande Strengers and Jenny Kennedy. 2021. The Smart Wife: Why Siri, Alexa, and Other Smart Home Devices Need a Feminist Reboot. MIT Press. 1–320 pages.",
      "doi": ""
    },
    {
      "text": "Selina Jeanne Sutton. 2020. Gender ambiguous, not genderless. Proceedings of the 2nd Conference on Conversational User Interfaces (2020). https://doi.org/10.1145/3405755.3406123",
      "doi": "10.1145/3405755.3406123"
    },
    {
      "text": "Deborah Tannen. 1993. You just don’t understand: Women and men in conversation. Lychnos.",
      "doi": ""
    },
    {
      "text": "Suzanne Tolmeijer, Naim Zierau, Andreas Janson, Jalil Sebastian Wahdatehagh, Jan Marco Leimeister, and Abraham Bernstein. 2021. Female by default? – exploring the effect of voice assistant gender and pitch on trait and trust attribution. Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (2021). https://doi.org/10.1145/3411763.3451623",
      "doi": "10.1145/3411763.3451623"
    },
    {
      "text": "Ilaria Torre and Laurence White. 2021. Trust in Vocal Human–Robot Interaction: Implications for Robot Voice Design. Springer Singapore, Singapore, 299–316. https://doi.org/10.1007/978-981-15-6627-1_16",
      "doi": ""
    },
    {
      "text": "John Van Borsel, Joke Janssens, and Marc De Bodt. 2009. Breathiness as a feminine voice characteristic: A perceptual approach. Journal of Voice 23, 3 (2009), 291–294. https://doi.org/10.1016/j.jvoice.2007.08.002",
      "doi": ""
    },
    {
      "text": "W. N. Venables and B. D. Ripley. 2002. Modern Applied Statistics with S(fourth ed.). Springer, New York. https://www.stats.ox.ac.uk/pub/MASS4/ ISBN 0-387-95457-0.",
      "doi": ""
    },
    {
      "text": "Veronica Vera. 1997. Miss Vera’s Finishing School for boys who want to be girls: Tips, tales, and teachings from the Dean of the world’s first Crossdressing Academy. Doubleday.",
      "doi": ""
    },
    {
      "text": "voicebot.ai. 2021.. https://www.voice2shop.com/wp-content/uploads/2020/11/executive-summary-smart-speaker-consumer-adoption-report-2020.pdf",
      "doi": ""
    },
    {
      "text": "Virginia I. Wolfe, David L. Ratusnik, Furman H. Smith, and Gretajo Northrop. 1990. Intonation and fundamental frequency in male-to-female transsexuals. Journal of Speech and Hearing Disorders 55, 1 (1990), 43–50. https://doi.org/10.1044/jshd.5501.43",
      "doi": ""
    },
    {
      "text": "Lal Zimman. 2013. Hegemonic masculinity and the variability of gay-sounding speech. Journal of Language and Sexuality 2, 1 (2013), 1–39. https://doi.org/10.1075/jls.2.1.01zim",
      "doi": ""
    },
    {
      "text": "Lal Zimman, Jenny Davis, and Joshua Raclaw. 2014. Queer excursions: Retheorizing binaries in language, gender, and sexuality. Oxford University Press.",
      "doi": ""
    }
  ]
}