{
  "doi": "10.1145/3544548.3581241",
  "title": "Passenger Perceptions, Information Preferences, and Usability of Crowding Visualizations on Public Displays in Transit Stations and Vehicles",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Large crowds in public transit stations and vehicles introduce obstacles for wayfinding, hygiene, and physical distancing. Public displays that currently provide on-site transit information could also provide critical crowdedness information. Therefore, we examined people’s crowd perceptions and information preferences before and during the pandemic, and designs for visualizing crowdedness to passengers. We first report survey results with public transit users (n = 303), including the usability results of three crowdedness visualization concepts. Then, we present two animated crowd simulations on public displays that we evaluated in a field study (n = 44). We found that passengers react very positively to crowding information, especially before boarding a vehicle. Visualizing the exact physical spaces occupied on transit vehicles was most useful for avoiding crowded areas. However, visualizing the overall fullness of vehicles was the easiest to understand. We discuss design implications for communicating crowding information to support decision-making and promote a sense of safety.",
  "tags": [
    "crowding",
    "public transit",
    "covid-19",
    "public displays",
    "visualization"
  ],
  "authors": [
    {
      "name": "Leah Zhang-Kennedy",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659046421",
      "orcid": "0000-0002-0756-0022"
    },
    {
      "name": "Saira Aziz",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783435",
      "orcid": "0000-0002-3597-4951"
    },
    {
      "name": "Oluwafunminitemi (Temi) Oluwadare",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783674",
      "orcid": "0000-0001-9843-6117"
    },
    {
      "name": "Lyndon Pan",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782661",
      "orcid": "0000-0001-9578-8889"
    },
    {
      "name": "Zeyu Wu",
      "institution": "Cheriton School of Computer Science, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780679",
      "orcid": "0000-0001-6062-7313"
    },
    {
      "name": "Sydney E.C. Lamorea",
      "institution": "University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660480622",
      "orcid": "0000-0003-1425-6894"
    },
    {
      "name": "Soda Li",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778590",
      "orcid": "0000-0002-9055-1185"
    },
    {
      "name": "Michael Sun",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782684",
      "orcid": "0000-0002-7392-2343"
    },
    {
      "name": "Ville Mäkelä",
      "institution": "Stratford School of Interaction Design and Business, University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758718057",
      "orcid": "0000-0001-6095-2570"
    }
  ],
  "references": [
    {
      "text": "Florian Alt, Stefan Schneegaß, Albrecht Schmidt, Jörg Müller, and Nemanja Memarovic. 2012. How to Evaluate Public Displays. In Proceedings of the 2012 International Symposium on Pervasive Displays (Porto, Portugal) (PerDis ’12). Association for Computing Machinery, New York, NY, USA, Article 17, 6 pages. https://doi.org/10.1145/2307798.2307815",
      "doi": "10.1145/2307798.2307815"
    },
    {
      "text": "Monica Anderson. 2016. Who relies on public transit in the U.S.Retrieved August 2022 from https://www.pewresearch.org/fact-tank/2016/04/07/who-relies-on-public-transit-in-the-u-s/",
      "doi": ""
    },
    {
      "text": "Matthias Baldauf and Martin Tomitsch. 2020. Pervasive Displays for Public Transport: An Overview of Ubiquitous Interactive Passenger Services. In Proceedings of the 9TH ACM International Symposium on Pervasive Displays (Manchester, United Kingdom) (PerDis ’20). Association for Computing Machinery, New York, NY, USA, 37–45. https://doi.org/10.1145/3393712.3395335",
      "doi": "10.1145/3393712.3395335"
    },
    {
      "text": "Prateek Bansal, Roselinde Kessels, Rico Krueger, and Daniel J Graham. 2022. Preferences for using the London Underground during the COVID-19 pandemic. Transportation Research Part A: Policy and Practice 160 (2022), 45–60.",
      "doi": ""
    },
    {
      "text": "Paul Basnak, Ricardo Giesen, and Juan Carlos Muñoz. 2022. Estimation of crowding factors for public transport during the COVID-19 pandemic in Santiago, Chile. Transportation Research Part A: Policy and Practice 159 (2022), 140–156.",
      "doi": ""
    },
    {
      "text": "Marco Batarce, Juan Carlos Muñoz, JDD Ortúzar, Sebastian Raveau, Carlos Mojica, and Ramiro Alberto Ríos Flores. 2015. Evaluation of Passenger Comfort in Bus Rapid Transit Systems. Technical Report IDB-TN-770. Inter-American Development Bank, Infrastructure and Environment Sector, Transport Division.",
      "doi": ""
    },
    {
      "text": "Brian Caulfield and Margaret O’Mahony. 2009. A stated preference analysis of real-time public transit stop information. Journal of Public Transportation 12, 3 (2009), 1.",
      "doi": ""
    },
    {
      "text": "Chao Chen, Tao Feng, and Xiaoning Gu. 2022. Role of latent factors and public policies in travel decisions under COVID-19 pandemic: Findings of a hybrid choice model. Sustainable cities and society 78 (2022), 103601.",
      "doi": ""
    },
    {
      "text": "Shin-Hyung Cho and Ho-Chul Park. 2021. Exploring the behaviour change of crowding impedance on public transit due to COVID-19 pandemic: before and after comparison. Transportation Letters 13, 5-6 (2021), 367–374.",
      "doi": ""
    },
    {
      "text": "Donatella Darsena, Giacinto Gelli, Ivan Iudice, and Francesco Verde. 2022. Sensing Technologies for Crowd Management, Adaptation, and Information Dissemination in Public Transportation Systems: A Review. IEEE SENSORS JOURNAL(2022).",
      "doi": ""
    },
    {
      "text": "Paul Davidsson, Banafsheh Hajinasab, Johan Holmgren, Åse Jevinger, and Jan A Persson. 2016. The fourth wave of digitalization and public transport: Opportunities and challenges. Sustainability 8, 12 (2016), 1248.",
      "doi": ""
    },
    {
      "text": "Pete Donohue. 2012. All aboard–the last car! MTA studies show more room in rear. Retrieved November 2022 from https://www.nydailynews.com/news/aboard-car-mta-studies-show-room-rear-article-1.1002321?localLinksEnabled=false",
      "doi": ""
    },
    {
      "text": "Scott Doorley, Sarah Holcomb, Perry Klebahn, Kathryn Segovia, and Jeremy Utley. 2018. Design Thinking Bootleg. Retrieved July 2022 from https://dschool.stanford.edu/resources/design-thinking-bootleg",
      "doi": ""
    },
    {
      "text": "Sarah Dryhurst, Claudia R Schneider, John Kerr, Alexandra LJ Freeman, Gabriel Recchia, Anne Marthe Van Der Bles, David Spiegelhalter, and Sander Van Der Linden. 2020. Risk perceptions of COVID-19 around the world. Journal of Risk Research 23, 7-8 (2020), 994–1006.",
      "doi": ""
    },
    {
      "text": "M Fazio, M Le Pira, G Inturri, and M Ignaccolo. 2020. Bus Rapid Transit vs. Metro. Monitoring on-board comfort of competing transit services via sensors. In 2020 forum on integrated and sustainable transportation systems (FISTS). IEEE, 292–297.",
      "doi": ""
    },
    {
      "text": "Brian Ferris, Kari Watkins, and Alan Borning. 2010. OneBusAway: Results from Providing Real-Time Arrival Information for Public Transit. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1807–1816. https://doi.org/10.1145/1753326.1753597",
      "doi": "10.1145/1753326.1753597"
    },
    {
      "text": "Shaunacy Ferro. 2014. Ingenious Signs Ensure You Always Get A Seat On The Train. Retrieved July 2022 from https://www.fastcompany.com/3033147/these-ingenious-signs-ensure-you-always-get-a-seat-on-the-train",
      "doi": ""
    },
    {
      "text": "Marcus Foth, Ronald Schroeter, and Jimmy Ti. 2013. Opportunities of public transport experience enhancements with mobile services and urban screens. International Journal of Ambient Computing and Intelligence (IJACI) 5, 1(2013), 1–18.",
      "doi": ""
    },
    {
      "text": "Peter Fröhlich, Alexandra Millonig, Anna-Katharina Frison, Sandra Trösterer, and Matthias Baldauf. 2018. User Interfaces for Public Transport Vehicles: Future Opportunities and Challenges. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 50–55.",
      "doi": ""
    },
    {
      "text": "Qian Fu, Ronghui Liu, and Stephane Hess. 2012. A review on transit assignment modelling approaches to congested networks: a new perspective. Procedia-Social and Behavioral Sciences 54 (2012), 1145–1155.",
      "doi": ""
    },
    {
      "text": "Grand River Transit. 2022. ION station and train features. Retrieved November 2022 from https://www.grt.ca/en/about-grt/ion-station-and-train-features.aspx",
      "doi": ""
    },
    {
      "text": "Yuval Hadas, Avi Tillman, Dmitry Tsadikovich, and Almog Ozalvo. 2022. Assessing public transport passenger attitudes towards a dynamic fare model based on in-vehicle crowdedness levels and additional waiting time. International Journal of Transportation Science and Technology (2022).",
      "doi": ""
    },
    {
      "text": "Si-Jun He and Jin-Yi Zhi. 2022. Study on Occupancy Behaviors of Passengers in the Subway Cabin: An Observation in Chengdu, China. Journal of Advanced Transportation 2022 (2022), 1–16.",
      "doi": ""
    },
    {
      "text": "Elina Hildén, Kaisa Väänänen, and Simo Syrman. 2018. Modeling bus travel experience to guide the design of digital services for the bus context. In Proceedings of the 22nd International Academic Mindtrek Conference. 143–152.",
      "doi": "10.1145/3275116.3275120"
    },
    {
      "text": "Linda Hirsch, Yanhong Li, Hendrik Geiger, and Andreas Butz. 2021. Safe-to-Touch: Tracking Touched Areas in Public Transport. In Human-Computer Interaction – INTERACT 2021, Carmelo Ardito, Rosa Lanzilotti, Alessio Malizia, Helen Petrie, Antonio Piccinno, Giuseppe Desolda, and Kori Inkpen (Eds.). Springer International Publishing, Cham, 486–489.",
      "doi": "10.1007/978-3-030-85607-6_63"
    },
    {
      "text": "Stephan Hörold, Cindy Mayas, and Heidi Krömker. 2015. Interactive displays in public transport–Challenges and Expectations. Procedia Manufacturing 3(2015), 2808–2815.",
      "doi": ""
    },
    {
      "text": "Elaine M Huang, Anna Koster, and Jan Borchers. 2008. Overcoming assumptions and uncovering practices: When does the public really look at public displays?. In International Conference on Pervasive Computing. Springer, 228–243.",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Eric Jaffe. 2012. How to Find the Least Crowded Subway Car. Retrieved November 2022 from https://www.bloomberg.com/news/articles/2012-01-31/how-to-find-the-least-crowded-subway-car",
      "doi": ""
    },
    {
      "text": "JWeg Ventures LLC. 2019. Exit Strategy NYC. Retrieved November 2022 from https://apps.apple.com/us/app/exit-strategy-nyc-subway-map/id320946370",
      "doi": ""
    },
    {
      "text": "Hyunmi Kim, Sohee Kwon, Seung Kook Wu, and Keemin Sohn. 2014. Why do passengers choose a specific car of a metro train during the morning peak hours?Transportation research part A: policy and practice 61 (2014), 249–258.",
      "doi": ""
    },
    {
      "text": "Jisun Kim, John Prestona, and Kirsten Revella. 2018. Exploring the effect of occupancy information on passengers’ behaviour change to relieve train crowding. World Conference on Transport Research Society 00, 000–00(2018), 1–19.",
      "doi": ""
    },
    {
      "text": "Kyung Min Kim, Sung-Pil Hong, Suk-Joon Ko, and Dowon Kim. 2015. Does crowding affect the path choice of metro passengers?Transportation Research: Policy and Practice 77 (2015), 292–304.",
      "doi": ""
    },
    {
      "text": "Adele Krusche, Laura Wilde, Daniela Ghio, Cora Morrissey, Alex Froom, and Daniel Chick. 2022. Developing public transport messaging to provide crowding information during COVID-19: Application of the COM-B model and behaviour change wheel. Transportation research interdisciplinary perspectives 13 (2022), 100564.",
      "doi": ""
    },
    {
      "text": "Darren Anando Leone, Handry Novianto, Ruben Setiawan, Timothy Gilbert, and Novita Hanafiah. 2021. A Survey: Crowds Detection Method on Public Transportation. In 2021 1st International Conference on Computer Science and Artificial Intelligence (ICCSAI), Vol. 1. IEEE, 258–262.",
      "doi": ""
    },
    {
      "text": "Nor Diana Mohd Mahudin, Tom Cox, and Amanda Griffiths. 2012. Measuring rail passenger crowding: Scale development and psychometric properties. Transportation research part F: Traffic psychology and behaviour 15, 1(2012), 38–51.",
      "doi": ""
    },
    {
      "text": "Ville Mäkelä, Tomi Heimonen, Matti Luhtala, and Markku Turunen. 2014. Information Wall: Evaluation of a Gesture-Controlled Public Display. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia(Melbourne, Victoria, Australia) (MUM ’14). Association for Computing Machinery, New York, NY, USA, 228–231. https://doi.org/10.1145/2677972.2677998",
      "doi": "10.1145/2677972.2677998"
    },
    {
      "text": "Ville Mäkelä, Mohamed Khamis, Lukas Mecke, Jobin James, Markku Turunen, and Florian Alt. 2018. Pocket Transfers: Interaction Techniques for Transferring Content from Situated Displays to Mobile Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173709",
      "doi": "10.1145/3173574.3173709"
    },
    {
      "text": "Ville Mäkelä, Sumita Sharma, Jaakko Hakulinen, Tomi Heimonen, and Markku Turunen. 2017. Challenges in Public Display Deployments: A Taxonomy of External Factors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3426–3475. https://doi.org/10.1145/3025453.3025798",
      "doi": "10.1145/3025453.3025798"
    },
    {
      "text": "Ville Mäkelä, Jonas Winter, Jasmin Schwab, Michael Koch, and Florian Alt. 2022. Pandemic Displays: Considering Hygiene on Public Touchscreens in the Post-Pandemic Era. In CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 284, 12 pages. https://doi.org/10.1145/3491102.3501937",
      "doi": "10.1145/3491102.3501937"
    },
    {
      "text": "Sk Md Mashrur, Brenden Lavoie, Kaili Wang, Patrick Loa, and Khandker Nurul Habib. 2022. Joint Model of Transit Usage Frequency and In-Vehicle Safety Perception During the COVID-19 Pandemic. Transportation Research Record(2022), 1–21.",
      "doi": ""
    },
    {
      "text": "Mass Transit. 2020. AC Transit now offering real-time onboard crowding information. Retrieved November 2022 from https://www.masstransitmag.com/technology/miscellaneous/press-release/21161493/ac-transit-ac-transit-now-offering-realtime-onboard-crowding-information",
      "doi": ""
    },
    {
      "text": "Achanta V Meghana, Vedant Sarode, Dhananjay Tambade, Abhidnya Marathe, and Nadir Charniya. 2020. Automated crowd management in bus transport service. In International Conference on Electronics and Sustainable Communication Systems (ICESC). IEEE, 104–109.",
      "doi": ""
    },
    {
      "text": "Nemanja Memarovic, Sarah Clinch, and Florian Alt. 2015. Understanding display blindness in future display deployments. In Proceedings of the 4th international symposium on pervasive displays. 7–14.",
      "doi": "10.1145/2757710.2757719"
    },
    {
      "text": "Jörg Müller, Dennis Wilmsmann, Juliane Exeler, Markus Buzeck, Albrecht Schmidt, Tim Jay, and Antonio Krüger. 2009. Display blindness: The effect of expectations on attention towards digital signage. In International conference on pervasive computing. Springer, 1–8.",
      "doi": "10.1007/978-3-642-01516-8_1"
    },
    {
      "text": "Hafiz Suliman Munawar, Sara Imran Khan, Zakria Qadir, Abbas Z. Kouzani, and M A Parvez Mahmud. 2021. Insight into the Impact of COVID-19 on Australian Transportation Sector: An Economic and Community-Based Perspective. Sustainability 13, 3 (2021). https://doi.org/10.3390/su13031276",
      "doi": ""
    },
    {
      "text": "Juan Carlos Muñoz, Jaime Soza-Parra, Arturo Didier, and Constanza Silva. 2018. Alleviating a subway bottleneck through a platform gate. Transportation Research Part A: Policy and Practice 116 (2018), 446–455.",
      "doi": ""
    },
    {
      "text": "Jarno Ojala, Hannu Korhonen, Jari Laaksonen, Ville Mäkelä, Toni Pakkanen, Antti Järvi, Kaisa Väänänen, and Roope Raisamo. 2015. Developing Novel Services for the Railway Station Area through Experience-Driven Design.IxD&A 25(2015), 73–84.",
      "doi": ""
    },
    {
      "text": "Clifford N Opurum. 2012. Automated Fare Collection System & Urban Public Transportation: An Economic & Management Approach to Urban Transit Systems. Trafford Publishing.",
      "doi": ""
    },
    {
      "text": "Callum Parker, Marius Hoggenmueller, and Martin Tomitsch. 2018. Design Strategies for Overcoming Failures on Public Interactive Displays. In Proceedings of the 7th ACM International Symposium on Pervasive Displays (Munich, Germany) (PerDis ’18). Association for Computing Machinery, New York, NY, USA, Article 2, 7 pages. https://doi.org/10.1145/3205873.3205889",
      "doi": "10.1145/3205873.3205889"
    },
    {
      "text": "Callum Parker and Martin Tomitsch. 2017. Bridging the interaction gulf: understanding the factors that drive public interactive display usage. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. 482–486.",
      "doi": "10.1145/3152771.3156162"
    },
    {
      "text": "Callum Parker, Martin Tomitsch, Nigel Davies, Nina Valkanova, and Judy Kay. 2020. Foundations for Designing Public Interactive Displays That Provide Value to Users. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376532",
      "doi": "10.1145/3313831.3376532"
    },
    {
      "text": "Callum Parker, Martin Tomitsch, and Judy Kay. 2018. Does the Public Still Look at Public Displays? A Field Observation of Public Displays in the Wild. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2, Article 73 (jul 2018), 24 pages. https://doi.org/10.1145/3214276",
      "doi": "10.1145/3214276"
    },
    {
      "text": "Soumela Peftitsi, Erik Jenelius, and Oded Cats. 2021. Evaluating crowding in individual train cars using a dynamic transit assignment model. Transportmetrica: Transport Dynamics 9, 1 (2021), 693–711.",
      "doi": ""
    },
    {
      "text": "Ivano Pinna, Bruno Dalla Chiara, and F Deflorio. 2010. Automatic passenger counting and vehicle load monitoring. Ingegneria Ferroviaria 65, 2 (2010), 101–138.",
      "doi": ""
    },
    {
      "text": "C Pownall, M Prior, and J Segal. 2008. What rail passengers will do to get a seat. In European Transport Conference 2008; Proceedings.",
      "doi": ""
    },
    {
      "text": "Yi Qi, Jinli Liu, Tao Tao, and Qun Zhao. 2021. Impacts of COVID-19 on public transit ridership. International Journal of Transportation Science and Technology (2021). https://doi.org/10.1016/j.ijtst.2021.11.003",
      "doi": ""
    },
    {
      "text": "Sanmay Shelat, Oded Cats, and Sander van Cranenburgh. 2021. Avoiding the Crowd: Traveller Behaviour in Public Transport in the Age of COVID-19. arXiv preprint arXiv:2104.10973(2021).",
      "doi": ""
    },
    {
      "text": "Xianghao Shen, Shumin Feng, Zhenning Li, and Baoyu Hu. 2016. Analysis of bus passenger comfort perception based on passenger load factor and in-vehicle time. SpringerPlus 5, 1 (2016), 1–10.",
      "doi": ""
    },
    {
      "text": "Jyotsna Singh. 2021. Departure time change to avoid crowd in trains: A stated choice experiment study in the Netherlands in a pandemic context (Master’s thesis). Master’s thesis. Delft University of Technology, Delft, Netherlands.",
      "doi": ""
    },
    {
      "text": "Keemin Sohn. 2013. Optimizing train-stop positions along a platform to distribute the passenger load more evenly across individual cars. IEEE Transactions on Intelligent Transportation Systems 14, 2(2013), 994–1002.",
      "doi": "10.1109/TITS.2013.2252166"
    },
    {
      "text": "Eric Tholomé. 2022. Navigate new normals with Google Maps. Retrieved August 2022 from https://blog.google/products/maps/new-normals-with-google-maps/",
      "doi": ""
    },
    {
      "text": "Kirrilly Thompson, Lily Hirsch, Simone Mueller Loose, Vinathe Sharma-Brymer, Sophia Rainbird, Kirsteen Titchener, Matthew Thomas, and Drew Dawson. 2012. Riding a mile in their shoes: Understanding Australian metropolitan rail passenger perceptions and experiences of crowdedness using mixed-methods research. Road & Transport Research: A Journal of Australian and New Zealand Research and Practice 21, 2 (2012), 46–59.",
      "doi": ""
    },
    {
      "text": "Alejandro Tirachini, David A Hensher, and John M Rose. 2013. Crowding in public transport systems: Effects on users, operation and implications for the estimation of demand. Transportation Research: Policy and Practice 53 (2013), 36–52.",
      "doi": ""
    },
    {
      "text": "Transportation Research Board of the National Academies. 2014. Transit Capacity and Quality of Service Manual, 3rd ed.Technical Report TCRP Project A-15, 165. Federal Transit Administration.",
      "doi": ""
    },
    {
      "text": "Arun Ulahannan and Stewart Birrell. 2022. Designing better public transport: understanding mode choice preferences following the COVID-19 pandemic. Sustainability 14, 10 (2022), 5952.",
      "doi": ""
    },
    {
      "text": "Pengfei Wang, Xuewu Chen, Yue Zheng, Long Cheng, Yinhai Wang, and Da Lei. 2021. Providing real-time bus crowding information for passengers: a novel policy to promote high-frequency transit performance. Transportation Research Part A: Policy and Practice 148 (2021), 316–329.",
      "doi": ""
    },
    {
      "text": "Mark Wardman and Gerard Whelan. 2011. Twenty years of rail crowding valuation studies: evidence and lessons from British experience. Transport reviews 31, 3 (2011), 379–398.",
      "doi": ""
    },
    {
      "text": "Michał Wielechowski, Katarzyna Czech, and Łukasz Grzęda. 2020. Decline in Mobility: Public Transport in Poland in the time of the COVID-19 Pandemic. Economies 8, 4 (2020). https://doi.org/10.3390/economies8040078",
      "doi": ""
    },
    {
      "text": "Xin-yue Xu, Jun Liu, Hai-ying Li, and Man Jiang. 2016. Capacity-oriented passenger flow control under uncertain demand: Algorithm development and real-world case study. Transportation Research: Logistics and Transportation Review 87 (2016), 130–148.",
      "doi": ""
    },
    {
      "text": "Yizhou Zhang, Erik Jenelius, and Karl Kottenhoff. 2017. Impact of real-time crowding information: a Stockholm metro pilot study. Public Transport 9, 3 (2017), 483–499.",
      "doi": ""
    }
  ]
}