{
  "doi": "10.1145/3544548.3581199",
  "title": "Dying, Death, and the Afterlife in Human-Computer Interaction. A Scoping Review.",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "Dying is a universal experience that entails uncertainty, loss, and termination. Often, people face death unprepared and miss out on opportunities to shape their final stage of life as well as their afterlife. To better understand how thanato-technology can support the dying and the bereaved, we performed a scoping review on the current state-of-art in Human Computer Interaction. Following the PRISMA-ScR procedure, we gathered and analyzed 107 relevant papers. We categorized theoretical and conceptual contributions into three overarching themes: digital remains, remembrance, and coping. We further highlight 18 practices, such as curation, honoring and letting go. We show that technology can help to capture the identity of the deceased, to validate the life lived, and to come to terms with death. However, available approaches focus more on the bereaved than on the dying. In addition, potentially important aspects of dying (e.g., balancing involvement and autonomy, spiritual meaning-making) remain largely unexplored.",
  "authors": [
    {
      "name": "Ruben Albers",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660578722",
      "orcid": "0000-0002-3190-1595"
    },
    {
      "name": "Shadan Sadeghian",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659467739",
      "orcid": "0000-0002-8590-656X"
    },
    {
      "name": "Matthias Laschke",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472655523",
      "orcid": "0000-0003-2714-4293"
    },
    {
      "name": "Marc Hassenzahl",
      "institution": "Ubiquitous Design / Experience & Interaction, University of Siegen, Germany",
      "img": "/do/10.1145/contrib-81452610719/rel-imgonly/hassenzahl.jpg",
      "acmid": "81452610719",
      "orcid": "0000-0001-9798-1762"
    }
  ],
  "references": [
    {
      "text": "M. Corr Donna A. Corr Charles. 2013. Culture, Socialization, and Dying. Routledge, New York, Chapter 1, 3–8. https://doi.org/10.4324/9780203767306.ch1",
      "doi": ""
    },
    {
      "text": "Muhammad Aurangzeb Ahmad. 2016. After Death: Big Data and the Promise of Resurrection by Proxy. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 397–408. https://doi.org/10.1145/2851581.2892591",
      "doi": "10.1145/2851581.2892591"
    },
    {
      "text": "Alessandra B. S. Almeida, Rafael Dueire Lins, and Gabriel de F. Pereira e Silva. 2011. Thanatos: Automatically Retrieving Information from Death Certificates in Brazil. In Proceedings of the 2011 Workshop on Historical Document Imaging and Processing (Beijing, China, USA) (HIP ’11). Association for Computing Machinery, New York, NY, USA, 146–153. https://doi.org/10.1145/2037342.2037367",
      "doi": "10.1145/2037342.2037367"
    },
    {
      "text": "Nazanin Andalibi. 2017. Self-Disclosure and Response Behaviors in Socially Stigmatized Contexts on Social Media: The Case of Miscarriage. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 248–253. https://doi.org/10.1145/3027063.3027137",
      "doi": "10.1145/3027063.3027137"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173732",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi, Gabriela Marcu, Tim Moesgen, Rebecca Mullin, and Andrea Forte. 2018. Not Alone: Designing for Self-Disclosure and Social Support Exchange After Pregnancy Loss. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188473",
      "doi": "10.1145/3170427.3188473"
    },
    {
      "text": "Grace Ataguba. 2018. Towards an Evaluation of Mobile Life Logging Technologies and Storytelling in Socio-Personal Grieving Spaces. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers (Singapore, Singapore) (UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 5–8. https://doi.org/10.1145/3267305.3267651",
      "doi": "10.1145/3267305.3267651"
    },
    {
      "text": "Anna N. Baglione, Maxine M. Girard, Meagan Price, James Clawson, and Patrick C. Shih. 2018. Modern Bereavement: A Model for Complicated Grief in the Digital Age. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173990",
      "doi": "10.1145/3173574.3173990"
    },
    {
      "text": "Richard Banks, David Kirk, and Abigail Sellen. 2012. A Design Perspective on Three Technology Heirlooms. Human–Computer Interaction 27, 1-2 (2012), 63–91. https://doi.org/10.1080/07370024.2012.656042 arXiv:https://www.tandfonline.com/doi/pdf/10.1080/07370024.2012.656042",
      "doi": ""
    },
    {
      "text": "Janne Mascha Beuthel and Verena Fuchsberger. 2022. Exploring Bodily Heirlooms: Material Ways to Prolong Closeness Beyond Death. In Creativity and Cognition (Venice, Italy) (C&C ’22). Association for Computing Machinery, New York, NY, USA, 135–145. https://doi.org/10.1145/3527927.3532788",
      "doi": "10.1145/3527927.3532788"
    },
    {
      "text": "Jed Brubaker, Funda Kivran-Swaine, Lee Taber, and Gillian Hayes. 2021. Grief-Stricken in a Crowd: The Language of Bereavement and Distress in Social Media. Proceedings of the International AAAI Conference on Web and Social Media 6, 1 (Aug. 2021), 42–49. https://ojs.aaai.org/index.php/ICWSM/article/view/14256",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker. 2014. The Afterlife of Digital Identity. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 343–346. https://doi.org/10.1145/2559206.2559964",
      "doi": "10.1145/2559206.2559964"
    },
    {
      "text": "Jed R. Brubaker and Vanessa Callison-Burch. 2016. Legacy Contact: Designing and Implementing Post-Mortem Stewardship at Facebook. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2908–2919. https://doi.org/10.1145/2858036.2858254",
      "doi": "10.1145/2858036.2858254"
    },
    {
      "text": "Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a Legacy: Responsibilities and Relationships in the Management of Post-Mortem Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 4157–4166. https://doi.org/10.1145/2556288.2557059",
      "doi": "10.1145/2556288.2557059"
    },
    {
      "text": "Jed R. Brubaker and Gillian R. Hayes. 2011. \"We Will Never Forget You [Online]\": An Empirical Investigation of Post-Mortem Myspace Comments. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (Hangzhou, China) (CSCW ’11). Association for Computing Machinery, New York, NY, USA, 123–132. https://doi.org/10.1145/1958824.1958843",
      "doi": "10.1145/1958824.1958843"
    },
    {
      "text": "Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3 (2013), 152–163. https://doi.org/10.1080/01972243.2013.777300 arXiv:https://doi.org/10.1080/01972243.2013.777300",
      "doi": "10.1080/01972243.2013.777300"
    },
    {
      "text": "Jed R. Brubaker, Gillian R. Hayes, and Melissa Mazmanian. 2019. Orienting to Networked Grief: Situated Perspectives of Communal Mourning on Facebook. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 27 (nov 2019), 19 pages. https://doi.org/10.1145/3359129",
      "doi": "10.1145/3359129"
    },
    {
      "text": "Stephen M. Campbell. 2020. Well-Being and the Good Death. Ethical Theory and Moral Practice 23, 3 (01 Aug 2020), 607–623. https://doi.org/10.1007/s10677-020-10101-3",
      "doi": ""
    },
    {
      "text": "Maurizio Caon. 2018. Designing Systems in the Digital Immortality Era. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 237–241. https://doi.org/10.1145/3197391.3205442",
      "doi": "10.1145/3197391.3205442"
    },
    {
      "text": "Brian Carroll and Katie Landry. 2010. Logging On and Letting Out: Using Online Social Networks to Grieve and to Mourn. Bulletin of Science, Technology & Society 30, 5 (2010), 341–349. https://doi.org/10.1177/0270467610380006 arXiv:https://doi.org/10.1177/0270467610380006",
      "doi": ""
    },
    {
      "text": "Marcus Carter, Martin Gibbs, and Greg Wadley. 2013. Death and Dying in DayZ. In Proceedings of The 9th Australasian Conference on Interactive Entertainment: Matters of Life and Death (Melbourne, Australia) (IE ’13). Association for Computing Machinery, New York, NY, USA, Article 22, 6 pages. https://doi.org/10.1145/2513002.2513013",
      "doi": "10.1145/2513002.2513013"
    },
    {
      "text": "Charu Chaudhari, Anjanakshi Prakash, A. M. Tsaasan, Jed R. Brubaker, and Theresa Jean Tanenbaum. 2016. Penseive Box: Themes for Digital Memorialization Practices. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 398–403. https://doi.org/10.1145/2839462.2856552",
      "doi": "10.1145/2839462.2856552"
    },
    {
      "text": "Janet X. Chen, Francesco Vitale, and Joanna McGrenere. 2021. What Happens After Death? Using a Design Workbook to Understand User Expectations for Preparing Their Data. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 169, 13 pages. https://doi.org/10.1145/3411764.3445359",
      "doi": "10.1145/3411764.3445359"
    },
    {
      "text": "Harvey Max Chochinov, Thomas Hack, Susan McClement, Linda Kristjanson, and Mike Harlos. 2002. Dignity in the terminally ill: a developing empirical model. Social Science & Medicine 54, 3 (2002), 433–443. https://doi.org/10.1016/S0277-9536(01)00084-3",
      "doi": ""
    },
    {
      "text": "Charles A. Corr. 1992. A Task-Based Approach to Coping with Dying. OMEGA - Journal of Death and Dying 24, 2 (1992), 81–94. https://doi.org/10.2190/CNNF-CX1P-BFXU-GGN4 arXiv:https://doi.org/10.2190/CNNF-CX1P-BFXU-GGN4",
      "doi": ""
    },
    {
      "text": "Ketelem Lemos de Campos, Thais Justi, Cristiano Maciel, and Vinicius Carvalho Pereira. 2017. Digital Memorials: A Proposal for Data Management beyond Life. In Proceedings of the XVI Brazilian Symposium on Human Factors in Computing Systems (Joinville, Brazil) (IHC 2017). Association for Computing Machinery, New York, NY, USA, Article 23, 10 pages. https://doi.org/10.1145/3160504.3160551",
      "doi": "10.1145/3160504.3160551"
    },
    {
      "text": "Thaís Justi de Toledo, Cristiano Maciel, Luã Marcelo Muriana, Patrícia Cristiane de Souza, and Vinicius Carvalho Pereira. 2019. Identity and Volition in Facebook Digital Memorials and the Challenges of Anticipating Interaction. In Proceedings of the 18th Brazilian Symposium on Human Factors in Computing Systems (Vitória, Espírito Santo, Brazil) (IHC ’19). Association for Computing Machinery, New York, NY, USA, Article 31, 11 pages. https://doi.org/10.1145/3357155.3358454",
      "doi": "10.1145/3357155.3358454"
    },
    {
      "text": "Brian de Vries and Judy Rutherford. 2004. Memorializing Loved Ones on the World Wide Web. OMEGA - Journal of Death and Dying 49, 1 (2004), 5–26. https://doi.org/10.2190/DR46-RU57-UY6P-NEWM arXiv:https://doi.org/10.2190/DR46-RU57-UY6P-NEWM",
      "doi": ""
    },
    {
      "text": "Kenneth J. Doka. 1996. Coping with Life-Threatening Illness: A Task Model. OMEGA - Journal of Death and Dying 32, 2 (1996), 111–122. https://doi.org/10.2190/0WEH-QUBG-67VG-YKJK arXiv:https://doi.org/10.2190/0WEH-QUBG-67VG-YKJK",
      "doi": ""
    },
    {
      "text": "Kenneth J. Doka. 2006. Fulfillment as Sanders’ Sixth Phase of Bereavement: The Unfinished Work of Catherine Sanders. OMEGA - Journal of Death and Dying 52, 2 (2006), 143–151. https://doi.org/10.2190/5BC9-035Q-HG1H-PALG arXiv:https://doi.org/10.2190/5BC9-035Q-HG1H-PALG",
      "doi": ""
    },
    {
      "text": "Sally A. Dominick, A. Blair Irvine, Natasha Beauchamp, John R. Seeley, Susan Nolen-Hoeksema, Kenneth J. Doka, and George A. Bonanno. 2010. An Internet Tool to Normalize Grief. OMEGA - Journal of Death and Dying 60, 1 (2010), 71–87. https://doi.org/10.2190/OM.60.1.d arXiv:https://doi.org/10.2190/OM.60.1.d",
      "doi": ""
    },
    {
      "text": "Lydia M.D. Dugdale. 2015. Dying in the Twenty-First Century: Toward a New Ethical Framework for the Art of Dying Well. The MIT Press, Cambridge, MA. https://doi.org/10.7551/mitpress/9780262029124.001.0001",
      "doi": ""
    },
    {
      "text": "Psy D Elaine Kasket MA. 2012. Continuing bonds in the age of social networking: Facebook as a modern-day medium. Bereavement Care 31, 2 (2012), 62–69. https://doi.org/10.1080/02682621.2012.710493 arXiv:https://doi.org/10.1080/02682621.2012.710493",
      "doi": ""
    },
    {
      "text": "Sara Eriksson and Preben Hansen. 2017. HeartBeats: A Speculative Proposal For Ritualization of Digital Objects. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17 Companion). Association for Computing Machinery, New York, NY, USA, 218–222. https://doi.org/10.1145/3064857.3079149",
      "doi": "10.1145/3064857.3079149"
    },
    {
      "text": "Robert Douglas Ferguson, Michael Massimi, Emily Anne Crist, and Karyn Anne Moffatt. 2014. Craving, Creating, and Constructing Comfort: Insights and Opportunities for Technology in Hospice. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work &; Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1479–1490. https://doi.org/10.1145/2531602.2531631",
      "doi": "10.1145/2531602.2531631"
    },
    {
      "text": "Pin Sym Foong. 2008. Designing Technology for Sensitive Contexts: Supporting End-of-Life Decision Making. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (Cairns, Australia) (OZCHI ’08). Association for Computing Machinery, New York, NY, USA, 172–179. https://doi.org/10.1145/1517744.1517801",
      "doi": "10.1145/1517744.1517801"
    },
    {
      "text": "Katie Z. Gach and Jed R. Brubaker. 2020. Experiences of Trust in Postmortem Profile Management. Trans. Soc. Comput. 3, 1, Article 2 (feb 2020), 26 pages. https://doi.org/10.1145/3365525",
      "doi": "10.1145/3365525"
    },
    {
      "text": "Katie Z. Gach and Jed R. Brubaker. 2021. Getting Your Facebook Affairs in Order: User Expectations in Post-Mortem Profile Management. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 174 (apr 2021), 29 pages. https://doi.org/10.1145/3449248",
      "doi": "10.1145/3449248"
    },
    {
      "text": "Vinícius Ferreira Galvão and Cristiano Maciel. 2017. The Acceptability of Digital Immortality: Today’s Human is Tomorrow’s Avatar. In Proceedings of the XVI Brazilian Symposium on Human Factors in Computing Systems (Joinville, Brazil) (IHC 2017). Association for Computing Machinery, New York, NY, USA, Article 66, 4 pages. https://doi.org/10.1145/3160504.3160580",
      "doi": "10.1145/3160504.3160580"
    },
    {
      "text": "Emily Getty, Jessica Cobb, Meryl Gabeler, Christine Nelson, Ellis Weng, and Jeffrey Hancock. 2011. I Said Your Name in an Empty Room: Grieving and Continuing Bonds on Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 997–1000. https://doi.org/10.1145/1978942.1979091",
      "doi": "10.1145/1978942.1979091"
    },
    {
      "text": "Barney G. Glaser and Anselm L. Strauss. 1965. Awareness of dying.AldineTransaction, New Brunswick, NJ, US.",
      "doi": ""
    },
    {
      "text": "Stine Gotved. 2015. Privacy with public access: digital memorials on quick response codes. Information, Communication & Society 18, 3 (2015), 269–280. https://doi.org/10.1080/1369118X.2014.989250 arXiv:https://doi.org/10.1080/1369118X.2014.989250",
      "doi": ""
    },
    {
      "text": "Connor Graham, Michael Arnold, Tamara Kohn, and Martin R. Gibbs. 2015. Gravesites and websites: a comparison of memorialisation. Visual Studies 30, 1 (2015), 37–53. https://doi.org/10.1080/1472586X.2015.996395 arXiv:https://doi.org/10.1080/1472586X.2015.996395",
      "doi": ""
    },
    {
      "text": "Rebecca Gulotta, David B. Gerritsen, Aisling Kelliher, and Jodi Forlizzi. 2016. Engaging with Death Online: An Analysis of Systems That Support Legacy-Making, Bereavement, and Remembrance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 736–748. https://doi.org/10.1145/2901790.2901802",
      "doi": "10.1145/2901790.2901802"
    },
    {
      "text": "Rebecca Gulotta, Aisling Kelliher, and Jodi Forlizzi. 2017. Digital Systems and the Experience of Legacy. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 663–674. https://doi.org/10.1145/3064663.3064731",
      "doi": "10.1145/3064663.3064731"
    },
    {
      "text": "Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the Age of the Internet: Reflections on How Interactive Systems Shape How We Are Remembered. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 975–984. https://doi.org/10.1145/2598510.2598579",
      "doi": "10.1145/2598510.2598579"
    },
    {
      "text": "Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste. 2013. Digital Artifacts as Legacy: Exploring the Lifespan and Value of Digital Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1813–1822. https://doi.org/10.1145/2470654.2466240",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Rebecca Gulotta, Alex Sciuto, Aisling Kelliher, and Jodi Forlizzi. 2015. Curatorial Agents: How Systems Shape Our Understanding of Personal and Familial Digital Information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3453–3462. https://doi.org/10.1145/2702123.2702297",
      "doi": "10.1145/2702123.2702297"
    },
    {
      "text": "Jonna Häkkilä, Ashley Colley, and Matilda Kalving. 2019. Designing an Interactive Gravestone Display. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (Palermo, Italy) (PerDis ’19). Association for Computing Machinery, New York, NY, USA, Article 4, 7 pages. https://doi.org/10.1145/3321335.3324952",
      "doi": "10.1145/3321335.3324952"
    },
    {
      "text": "Jack Holt, James Nicholson, and Jan David Smeddinck. 2021. From Personal Data to Digital Legacy: Exploring Conflicts in the Sharing, Security and Privacy of Post-Mortem Data. In Proceedings of the Web Conference 2021(Ljubljana, Slovenia) (WWW ’21). Association for Computing Machinery, New York, NY, USA, 2745–2756. https://doi.org/10.1145/3442381.3450030",
      "doi": "10.1145/3442381.3450030"
    },
    {
      "text": "Sue Jamison-Powell, Pam Briggs, Shaun Lawson, Conor Linehan, Karen Windle, and Harriet Gross. 2016. \"PS. I Love You\": Understanding the Impact of Posthumous Digital Messages. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2920–2932. https://doi.org/10.1145/2858036.2858504",
      "doi": "10.1145/2858036.2858504"
    },
    {
      "text": "Victor Kaptelinin. 2016. Making the Case for an Existential Perspective in HCI Research on Mortality and Death. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 352–364. https://doi.org/10.1145/2851581.2892585",
      "doi": "10.1145/2851581.2892585"
    },
    {
      "text": "Victor Kaptelinin. 2018. Technology and the Givens of Existence: Toward an Existential Inquiry Framework in HCI Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173844",
      "doi": "10.1145/3173574.3173844"
    },
    {
      "text": "Allan Kellehear. 2007. A Social History of Dying. Cambridge University Press, Cambridge. https://doi.org/10.1017/CBO9780511481352",
      "doi": ""
    },
    {
      "text": "Hope Kerkhoff, Collin Pfender, and Sheng Jiang. 2018. Black Box, a Concept Design: Grief Work and the Digitized Self. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 832–837. https://doi.org/10.1145/3240167.3240280",
      "doi": "10.1145/3240167.3240280"
    },
    {
      "text": "David Kirk and Richard Banks. 2008. On the Design of Technology Heirlooms. In Proceedings of the 2008 Workshop on Social Interaction and Mundane Technologies(SIMTech ’08). Lancaster University, Cambridge, 1–4.",
      "doi": ""
    },
    {
      "text": "David S. Kirk and Abigail Sellen. 2010. On Human Remains: Values and Practice in the Home Archiving of Cherished Objects. ACM Trans. Comput.-Hum. Interact. 17, 3, Article 10 (jul 2010), 43 pages. https://doi.org/10.1145/1806923.1806924",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Dennis Klass, Phyllis Silverman, and Steven Nickman. 1996. Continuing Bonds - New Understandings of Grief. Taylor & Francis, New York. https://doi.org/10.4324/9781315800790",
      "doi": ""
    },
    {
      "text": "Tamara Kohn, Michael Arnold, Martin Gibbs, James Meese, and Bjørn Nansen. 2018. Death and Digital Media. Routledge, London. https://doi.org/10.4324/9781315688749",
      "doi": ""
    },
    {
      "text": "Elisabeth Kübler-Ross. 1969. On death and dying.Collier Books/Macmillan Publishing Co, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Elisabeth Kübler-Ross and David Kessler. 2005. On grief and grieving. Simon & Schuster, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Seyeon Lee, Hyunyoung Oh, Chung-Kon Shi, and Young Yim Doh. 2020. Life Review Using a Life Metaphoric Game to Promote Intergenerational Communication. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 98 (oct 2020), 21 pages. https://doi.org/10.1145/3415169",
      "doi": "10.1145/3415169"
    },
    {
      "text": "Jessa Lingel. 2013. The Digital Remains: Social Media and Practices of Online Grief. The Information Society 29, 3 (2013), 190–195. https://doi.org/10.1080/01972243.2013.777311 arXiv:https://doi.org/10.1080/01972243.2013.777311",
      "doi": "10.1080/01972243.2013.777311"
    },
    {
      "text": "Jiamou Liu, Luqi Li, and Kyle Russell. 2017. What Becomes of the Broken Hearted? An Agent-Based Approach to Self-Evaluation, Interpersonal Loss, and Suicide Ideation. In Proceedings of the 16th Conference on Autonomous Agents and MultiAgent Systems (São Paulo, Brazil) (AAMAS ’17). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 436–445.",
      "doi": ""
    },
    {
      "text": "Yanping Liu and Gertina J. van Schalkwyk. 2019. Death preparation of Chinese rural elders. Death Studies 43, 4 (2019), 270–279. https://doi.org/10.1080/07481187.2018.1458760 arXiv:https://doi.org/10.1080/07481187.2018.1458760PMID: 29757095.",
      "doi": ""
    },
    {
      "text": "Michael E. Locasto, Michael Massimi, and Peter J. DePasquale. 2011. Security and Privacy Considerations in Digital Death. In Proceedings of the 2011 New Security Paradigms Workshop (Marin County, California, USA) (NSPW ’11). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2073276.2073278",
      "doi": "10.1145/2073276.2073278"
    },
    {
      "text": "Mark Lochrie and Paul Coulton. 2011. Rest in Pixels. In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (Tampere, Finland) (MindTrek ’11). Association for Computing Machinery, New York, NY, USA, 197–200. https://doi.org/10.1145/2181037.2181070",
      "doi": "10.1145/2181037.2181070"
    },
    {
      "text": "Caitlin Lustig, Artie Konrad, and Jed R. Brubaker. 2022. Designing for the Bittersweet: Improving Sensitive Experiences with Recommender Systems. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 16, 18 pages. https://doi.org/10.1145/3491102.3502049",
      "doi": "10.1145/3491102.3502049"
    },
    {
      "text": "Cristiano Maciel. 2011. Issues of the Social Web Interaction Project Faced with Afterlife Digital Legacy. In Proceedings of the 10th Brazilian Symposium on Human Factors in Computing Systems and the 5th Latin American Conference on Human-Computer Interaction (Porto de Galinhas, Pernambuco, Brazil) (IHC+CLIHC ’11). Brazilian Computer Society, Porto Alegre, BRA, 3–12.",
      "doi": "10.5555/2254436.2254441"
    },
    {
      "text": "Cristiano Maciel and Vinicius Pereira. 2013. Social Network Users’ Religiosity and the Design of Post Mortem Aspects. In Human-Computer Interaction – INTERACT 2013, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson, and Marco Winckler (Eds.). Vol. 8119. Springer Berlin Heidelberg, Berlin, Heidelberg, 640–657. https://doi.org/10.1007/978-3-642-40477-1_43",
      "doi": ""
    },
    {
      "text": "Cristiano Maciel and Vinicius Pereira. 2015. Post-mortem Digital Legacy: Possibilities in HCI. In Human-Computer Interaction: Users and Contexts, Masaaki\" Kurosu (Ed.). Springer International Publishing, 339–349. https://doi.org/10.1007/978-3-319-21006-3_33",
      "doi": ""
    },
    {
      "text": "Bethany Ann Mackey, Paul A. Bremner, and Manuel Giuliani. 2020. Immersive Control of a Robot Surrogate for Users in Palliative Care. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction (Cambridge, United Kingdom) (HRI ’20). Association for Computing Machinery, New York, NY, USA, 585–587. https://doi.org/10.1145/3371382.3377445",
      "doi": "10.1145/3371382.3377445"
    },
    {
      "text": "Alice Marwick and Nicole B. Ellison. 2012. “There Isn’t Wifi in Heaven!” Negotiating Visibility on Facebook Memorial Pages. Journal of Broadcasting & Electronic Media 56, 3 (2012), 378–400. https://doi.org/10.1080/08838151.2012.705197 arXiv:https://doi.org/10.1080/08838151.2012.705197",
      "doi": ""
    },
    {
      "text": "Michael Massimi. 2013. Exploring Remembrance and Social Support Behavior in an Online Bereavement Support Group. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1169–1180. https://doi.org/10.1145/2441776.2441908",
      "doi": "10.1145/2441776.2441908"
    },
    {
      "text": "Michael Massimi and Ronald M. Baecker. 2011. Dealing with Death in Design: Developing Systems for the Bereaved. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 1001–1010. https://doi.org/10.1145/1978942.1979092",
      "doi": "10.1145/1978942.1979092"
    },
    {
      "text": "Michael Massimi and Andrea Charise. 2009. Dying, Death, and Mortality: Towards Thanatosensitivity in HCI. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems (Boston, MA, USA) (CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 2459–2468. https://doi.org/10.1145/1520340.1520349",
      "doi": "10.1145/1520340.1520349"
    },
    {
      "text": "Michael Massimi, Jill P. Dimond, and Christopher A. Le Dantec. 2012. Finding a New Normal: The Role of Technology in Life Disruptions. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 719–728. https://doi.org/10.1145/2145204.2145314",
      "doi": "10.1145/2145204.2145314"
    },
    {
      "text": "Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of Life and Death: Locating the End of Life in Lifespan-Oriented Hci Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 987–996. https://doi.org/10.1145/1978942.1979090",
      "doi": "10.1145/1978942.1979090"
    },
    {
      "text": "Rhonda McEwen and Kathleen Scheaffer. 2013. Virtual Mourning and Memory Construction on Facebook: Here Are the Terms of Use. In Proceedings of the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information Boundaries (Montreal, Quebec, Canada) (ASIST ’13). American Society for Information Science, USA, Article 54, 10 pages.",
      "doi": ""
    },
    {
      "text": "Emily A. Meier, Jarred V. Gallegos, Lori P. Montross Thomas, Colin A. Depp, Scott A. Irwin, and Dilip V. Jeste. 2016. Defining a Good Death (Successful Dying): Literature Review and a Call for Research and Public Dialogue. The American Journal of Geriatric Psychiatry 24, 4 (01 Apr 2016), 261–271. https://doi.org/10.1016/j.jagp.2016.01.135",
      "doi": ""
    },
    {
      "text": "Mira Menzfeld. 2018. Anthropology of Dying. Springer VS Wiesbaden, Wiesbaden. https://doi.org/10.1007/978-3-658-19826-8",
      "doi": ""
    },
    {
      "text": "Stephan Micklitz, Martin Ortlieb, and Jessica Staddon. 2013. \"I hereby leave my email to...\": Data Usage Control and the Digital Estate. 2013 IEEE Security and Privacy Workshops(2013), 42–44.",
      "doi": "10.1109/SPW.2013.28"
    },
    {
      "text": "David Moher, Alessandro Liberati, Jennifer Tetzlaff, Douglas G. Altman, and The PRISMA Group. 2009. Preferred Reporting Items for Systematic Reviews and Meta-Analyses: The PRISMA Statement. PLOS Medicine 6, 7 (07 2009), 1–6. https://doi.org/10.1371/journal.pmed.1000097",
      "doi": ""
    },
    {
      "text": "Wendy Moncur, Jan Bikker, Elaine Kasket, and John Troyer. 2012. From Death to Final Disposition: Roles of Technology in the Post-Mortem Interval. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 531–540. https://doi.org/10.1145/2207676.2207750",
      "doi": "10.1145/2207676.2207750"
    },
    {
      "text": "Wendy Moncur, Miriam Juliu, Elise van den Hoven, and David Kirk. 2015. Story Shell: the participatory design of a bespoke digital memorial. In Proceedings of the 4th Participatory Innovation Conference PIN-C 2015. Hague University of Applied Science, The Hague, Netherlands, 470–477. https://doi.org/10.13140/RG.2.1.2802.4489",
      "doi": ""
    },
    {
      "text": "Wendy Moncur and David Kirk. 2014. An Emergent Framework for Digital Memorials. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 965–974. https://doi.org/10.1145/2598510.2598516",
      "doi": "10.1145/2598510.2598516"
    },
    {
      "text": "Joji Mori, Martin Gibbs, Michael Arnold, Bjorn Nansen, and Tamara Kohn. 2012. Design Considerations for after Death: Comparing the Affordances of Three Online Platforms. In Proceedings of the 24th Australian Computer-Human Interaction Conference (Melbourne, Australia) (OzCHI ’12). Association for Computing Machinery, New York, NY, USA, 395–404. https://doi.org/10.1145/2414536.2414599",
      "doi": "10.1145/2414536.2414599"
    },
    {
      "text": "William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology Heirlooms? Considerations for Passing down and Inheriting Digital Materials. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 337–346. https://doi.org/10.1145/2207676.2207723",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "William Odom, Richard Harper, Abigail Sellen, David Kirk, and Richard Banks. 2010. Passing on & Putting to Rest: Understanding Bereavement in the Context of Interactive Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1831–1840. https://doi.org/10.1145/1753326.1753601",
      "doi": "10.1145/1753326.1753601"
    },
    {
      "text": "William Odom, Daisuke Uriu, David Kirk, Richard Banks, and Ron Wakkary. 2018. Experiences in Designing Technologies for Honoring Deceased Loved Ones. Design Issues 34, 1 (01 2018), 54–66. https://doi.org/10.1162/DESI_a_00476 arXiv:https://direct.mit.edu/desi/article-pdf/34/1/54/1715845/desi_a_00476.pdf",
      "doi": ""
    },
    {
      "text": "Young Chin Park and Tom Pyszczynski. 2016. Cultural universals and differences in dealing with death.Routledge/Taylor & Francis Group, New York, NY, US, 193–213. https://doi.org/10.4324/9781315641393-15",
      "doi": ""
    },
    {
      "text": "Joachim Pfister. 2017. \"This Will Cause a Lot of Work.\": Coping with Transferring Files and Passwords as Part of a Personal Digital Legacy. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1123–1138. https://doi.org/10.1145/2998181.2998262",
      "doi": "10.1145/2998181.2998262"
    },
    {
      "text": "Stacey Pitsillides. 2019. Digital legacy: Designing with things. Death Studies 43, 7 (2019), 426–434. https://doi.org/10.1080/07481187.2018.1541939 arXiv:https://doi.org/10.1080/07481187.2018.1541939PMID: 30628557.",
      "doi": ""
    },
    {
      "text": "Raquel O. Prates, Mary Beth Rosson, and Clarisse S. de Souza. 2015. Making Decisions About Digital Legacy with Google’s Inactive Account Manager. In Human-Computer Interaction – INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 201–209.",
      "doi": "10.1007/978-3-319-22701-6_14"
    },
    {
      "text": "Duncan Reid. 2021. Factors That May Prevent Meaningful Digital Legacy. Association for Computing Machinery, New York, NY, USA, 141–142. https://doi.org/10.1145/3462741.3466670",
      "doi": "10.1145/3462741.3466670"
    },
    {
      "text": "Pamela Roberts and Lourdes A. Vidal. 2000. Perpetual Care in Cyberspace: A Portrait of Memorials on the Web. OMEGA - Journal of Death and Dying 40, 4 (2000), 521–545. https://doi.org/10.2190/3BPT-UYJR-192R-U969 arXiv:https://doi.org/10.2190/3BPT-UYJR-192R-U969",
      "doi": ""
    },
    {
      "text": "Jan Rod, Connor Graham, and Martin Gibbs. 2011. Suicide Effects: Designing for Death. In Proceedings of the 5th International Conference on Communities and Technologies (Brisbane, Australia) (C&T ’11). Association for Computing Machinery, New York, NY, USA, 31–40. https://doi.org/10.1145/2103354.2103359",
      "doi": "10.1145/2103354.2103359"
    },
    {
      "text": "Ian Ruthven. 2012. Grieving Online: The Use of Search Engines in Times of Grief and Bereavement. In Proceedings of the 4th Information Interaction in Context Symposium (Nijmegen, The Netherlands) (IIIX ’12). Association for Computing Machinery, New York, NY, USA, 120–128. https://doi.org/10.1145/2362724.2362747",
      "doi": "10.1145/2362724.2362747"
    },
    {
      "text": "Lars Sandman. 2004. A Good Death: On the value of death and dying. Open University Press.",
      "doi": ""
    },
    {
      "text": "Corina Sas and Alina Coman. 2016. Designing personal grief rituals: An analysis of symbolic objects and actions. Death Studies 40, 9 (2016), 558–569. https://doi.org/10.1080/07481187.2016.1188868 arXiv:https://doi.org/10.1080/07481187.2016.1188868PMID: 27603436.",
      "doi": ""
    },
    {
      "text": "Corina Sas, Shuang Ren, Alina Coman, Sarah Clinch, and Nigel Davies. 2016. Life Review in End of Life Care: A Practitioner’s Perspective. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 2947–2953. https://doi.org/10.1145/2851581.2892491",
      "doi": "10.1145/2851581.2892491"
    },
    {
      "text": "Corina Sas, Steve Whittaker, and John Zimmerman. 2016. Design for Rituals of Letting Go: An Embodiment Perspective on Disposal Practices Informed by Grief Therapy. ACM Trans. Comput.-Hum. Interact. 23, 4, Article 21 (aug 2016), 37 pages. https://doi.org/10.1145/2926714",
      "doi": "10.1145/2926714"
    },
    {
      "text": "Britta Schulte, Philipp Graf, Lena Franzkowiak, and Eva Hornecker. 2020. Hospital Beds, Robot Priests and Huggables: A (Fictional) Review of Commercially Available Care Robots. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society (Tallinn, Estonia) (NordiCHI ’20). Association for Computing Machinery, New York, NY, USA, Article 43, 11 pages. https://doi.org/10.1145/3419249.3420127",
      "doi": "10.1145/3419249.3420127"
    },
    {
      "text": "Wan-Jou She, Panote Siriaraya, Chee Siang Ang, and Holly Gwen Prigerson. 2021. Living Memory Home: Understanding Continuing Bond in the Digital Age through Backstage Grieving. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 546, 14 pages. https://doi.org/10.1145/3411764.3445336",
      "doi": "10.1145/3411764.3445336"
    },
    {
      "text": "C. Estelle Smith, Avleen Kaur, Katie Z. Gach, Loren Terveen, Mary Jo Kreitzer, and Susan O’Conner-Von. 2021. What is Spiritual Support and How Might It Impact the Design of Online Communities?Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 43 (apr 2021), 42 pages. https://doi.org/10.1145/3449117",
      "doi": "10.1145/3449117"
    },
    {
      "text": "CARLA J. SOFKA. 1997. Social support \"internetworks,\" caskets for sale, and more: thanatology and the information superhighway. Death Studies 21, 6 (1997), 553–574. https://doi.org/10.1080/074811897201778 arXiv:https://doi.org/10.1080/074811897201778PMID: 10179827.",
      "doi": ""
    },
    {
      "text": "Andrea Taylor, Jeni Lennox, Alasdair Mort, David Heaney, Sarah-Anne Muñoz, Margaret Currie, Gill Hubbard, Kenny Steele, and Jeremy Keen. 2013. Developing Hospice Care over a Distance in Highland Scotland: A Knowledge Exchange Process. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 397–402. https://doi.org/10.1145/2468356.2468427",
      "doi": "10.1145/2468356.2468427"
    },
    {
      "text": "Lisa Thomas and Pam Briggs. 2014. An Older Adult Perspective on Digital Legacy. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (Helsinki, Finland) (NordiCHI ’14). Association for Computing Machinery, New York, NY, USA, 237–246. https://doi.org/10.1145/2639189.2639485",
      "doi": "10.1145/2639189.2639485"
    },
    {
      "text": "Andrea Tricco, Erin Lillie, Wasifa Zarin, Kelly O’Brien, Heather Colquhoun, Danielle Levac, David Moher, Micah Peters, Tanya Horsley, Laura Weeks, Susanne Hempel, Elie Akl, Christine Chang, Jessie McGowan, Lesley Stewart, Lisa Hartling, Adrian Aldcroft, Michael Wilson, Chantelle Garritty, Simon Lewin, Christina Godfrey, Marilyn Macdonald, Etienne Langlois, Karla Soares-Weiser, Jo Moriarty, Tammy Clifford, Özge Tunçalp, and Sharon Straus. 2018. PRISMA Extension for Scoping Reviews (PRISMA-ScR): Checklist and Explanation. Annals of Internal Medicine 169, 7 (2018), 467–473. https://doi.org/10.7326/M18-0850 arXiv:https://doi.org/10.7326/M18-0850PMID: 30178033.",
      "doi": ""
    },
    {
      "text": "Daisuke Uriu, Noriyasu Obushi, Zendai Kashino, Atsushi Hiyama, and Masahiko Inami. 2021. Floral Tribute Ritual in Virtual Reality: Design and Validation of SenseVase with Virtual Memorial. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 628, 15 pages. https://doi.org/10.1145/3411764.3445216",
      "doi": "10.1145/3411764.3445216"
    },
    {
      "text": "Daisuke Uriu and William Odom. 2016. Designing for Domestic Memorialization and Remembrance: A Field Study of Fenestra in Japan. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5945–5957. https://doi.org/10.1145/2858036.2858069",
      "doi": "10.1145/2858036.2858069"
    },
    {
      "text": "Daisuke Uriu, William Odom, and Hannah Gould. 2018. Understanding Automatic Conveyor-Belt Columbaria: Emerging Sites of Interactive Memorialization in Japan. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 747–752. https://doi.org/10.1145/3196709.3196801",
      "doi": "10.1145/3196709.3196801"
    },
    {
      "text": "Daisuke Uriu, William Odom, Mei-Kei Lai, Sai Taoka, and Masahiko Inami. 2018. SenseCenser: An Interactive Device for Sensing Incense Smoke & Supporting Memorialization Rituals in Japan. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 315–318. https://doi.org/10.1145/3197391.3205394",
      "doi": "10.1145/3197391.3205394"
    },
    {
      "text": "Daisuke Uriu, Takahiro Ogasawara, Naohito Shimizu, and Naohito Okude. 2006. MASTABA: The Household Shrine in the Future Archived Digital Pictures. In ACM SIGGRAPH 2006 Sketches (Boston, Massachusetts) (SIGGRAPH ’06). Association for Computing Machinery, New York, NY, USA, 151–es. https://doi.org/10.1145/1179849.1180038",
      "doi": "10.1145/1179849.1180038"
    },
    {
      "text": "Daisuke Uriu, Kenta Toshima, Minori Manabe, Takeru Yazaki, Takeshi Funatsu, Atsushi Izumihara, Zendai Kashino, Atsushi Hiyama, and Masahiko Inami. 2021. Generating the Presence of Remote Mourners: A Case Study of Funeral Webcasting in Japan. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 629, 14 pages. https://doi.org/10.1145/3411764.3445617",
      "doi": "10.1145/3411764.3445617"
    },
    {
      "text": "Koen Van Turnhout, Elise van den Hoven, Wina Smeenk, Hans Bilsen, Rob Zimmermann, and Simone Waart. 2008. Communicating Commemoration. In Proceedings of the 2008 Workshop on Social Interaction and Mundane Technologies(SIMTech ’08). Lancaster University, Lancaster, 4 pages.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Pamela Wisniewski, Zahra Ashktorab, and Karla Badillo-Urquiola. 2017. Benefits and Drawbacks of Using Social Media to Grieve Following the Loss of Pet. In Proceedings of the 8th International Conference on Social Media & Society (Toronto, ON, Canada) (SMSociety17). Association for Computing Machinery, New York, NY, USA, Article 23, 10 pages. https://doi.org/10.1145/3097286.3097309",
      "doi": "10.1145/3097286.3097309"
    },
    {
      "text": "Jayne Wallace, Kyle Montague, Trevor Duncan, Luís P. Carvalho, Nantia Koulidou, Jamie Mahoney, Kellie Morrissey, Claire Craig, Linnea Iris Groot, Shaun Lawson, Patrick Olivier, Julie Trueman, and Helen Fisher. 2020. ReFind: Design, Lived Experience and Ongoingness in Bereavement. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376531",
      "doi": "10.1145/3313831.3376531"
    },
    {
      "text": "Jayne Wallace, James Thomas, Derek Anderson, and Patrick Olivier. 2018. Mortality as Framed by Ongoingness in Digital Design. Design Issues 34(2018), 95–107.",
      "doi": ""
    },
    {
      "text": "Tony Walter, Rachid Hourizi, Wendy Moncur, and Stacey Pitsillides. 2012. Does the Internet Change How We Die and Mourn? Overview and Analysis. OMEGA - Journal of Death and Dying 64, 4 (2012), 275–302. https://doi.org/10.2190/OM.64.4.a arXiv:https://doi.org/10.2190/OM.64.4.a",
      "doi": ""
    },
    {
      "text": "ANNA-LEILA WILLIAMS. 2006. Perspectives on spirituality at the end of life: A meta-summary. Palliative and Supportive Care 4, 4 (2006), 407–417. https://doi.org/10.1017/S1478951506060500",
      "doi": ""
    },
    {
      "text": "J. William Worden. 2008. Grief counseling and grief therapy: A handbook for the mental health practitioner. Springer Publishing Company, New York, NY, US. https://doi.org/10.1891/9780826134752",
      "doi": ""
    },
    {
      "text": "Xinyuan Xu, Ruben Manrique, and Bernardo Pereira Nunes. 2021. RIP Emojis and Words to Contextualize Mourning on Twitter. In Proceedings of the 32nd ACM Conference on Hypertext and Social Media (Virtual Event, USA) (HT ’21). Association for Computing Machinery, New York, NY, USA, 257–263. https://doi.org/10.1145/3465336.3475100",
      "doi": "10.1145/3465336.3475100"
    },
    {
      "text": "Changyoon Yi, Juhyun Bae, Nakkyu Baek, Jina Jung, Sunwoong Hur, Hyun Jean Lee, and Seung Ah Lee. 2021. ReMember: Using Biosignals to Recall Memories of Companion Animals. Proc. ACM Comput. Graph. Interact. Tech. 4, 2, Article 29 (aug 2021), 7 pages. https://doi.org/10.1145/3465614",
      "doi": "10.1145/3465614"
    },
    {
      "text": "Mehreen Zaman, Sara Espinal-Arango, Ashita Mohapatra, and Alejandro R. Jadad. 2021. What would it take to die well? A systematic review of systematic reviews on the conditions for a good death. The Lancet Healthy Longevity 2, 9 (01 Sep 2021), e593–e600.",
      "doi": ""
    },
    {
      "text": "Steven Y. Zeng, Robert Wu, Khai N. Truong, and Fanny Chevalier. 2020. Evaluating the Gradual Delivery of Knowledge-Focused and Mindset-Focused Messages for Facilitating the Acceptance of COPD. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 160 (dec 2020), 23 pages. https://doi.org/10.1145/3432218",
      "doi": "10.1145/3432218"
    }
  ]
}