{
  "doi": "10.1145/3544548.3581478",
  "title": "“Information-Backward but Sex-Forward”: Navigating Masculinity towards Intimate Wellbeing and Heterosexual Relationships",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "There has been a growing interest in reproductive health and intimate wellbeing in Human-Computer Interaction, increasingly from an ecological perspective. Much of this work is centered around women’s experiences across diverse settings, emphasizing men’s limited engagement and need for greater participation on these topics. Our research responds to this gap by investigating cisgender men’s experiences of cultivating sexual health literacies in an urban Indian context. We leverage media probes to stimulate focus group discussions, using popular media references on men’s fertility to elicit shared reflection. Our findings uncover the role that humor and masculinity play in shaping men’s perceptions of their sexual health and how this influences their sense of agency and participation in heterosexual intimate relationships. We further discuss how technologies might be designed to support men’s participation in these relationships as supportive partners and allies.",
  "tags": [
    "Taboo",
    "Sexual health and wellbeing",
    "Heterosexual relationships",
    "Men",
    "Media probes"
  ],
  "authors": [
    {
      "name": "Anupriya Tuli",
      "institution": "IIIT-Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658628784",
      "orcid": "0000-0001-8838-0391"
    },
    {
      "name": "Azra Ismail",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320224",
      "orcid": "0000-0002-7570-9474"
    },
    {
      "name": "Karthik S Bhat",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659296394",
      "orcid": "0000-0003-0544-6303"
    },
    {
      "name": "Pushpendra Singh",
      "institution": "IIIT-Delhi, India",
      "img": "/do/10.1145/contrib-81309502140/rel-imgonly/psingh.jpg",
      "acmid": "81309502140",
      "orcid": "0000-0003-2152-1027"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Teresa Almeida. 2015. Designing Intimate Wearables to Promote Preventative Health Care Practices. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (UbiComp/ISWC’15 Adjunct). ACM, New York, NY, USA, 659–662.",
      "doi": "10.1145/2800835.2809440"
    },
    {
      "text": "Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care As an Agenda for Change in Women’s Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 2599–2611.",
      "doi": "10.1145/2858036.2858187"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Patrick Olivier, and Madeline Balaam. 2014. Intimate Care: Exploring ETextiles for Teaching Female Pelvic Fitness. In Proceedings of the 2014 Companion Publication on Designing Interactive Systems (Vancouver, BC, Canada) (DIS Companion ’14). Association for Computing Machinery, New York, NY, USA, 5–8.",
      "doi": "10.1145/2598784.2602768"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On Looking at the Vagina through Labella. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1810–1821.",
      "doi": "10.1145/2858036.2858119"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On Looking at the Vagina through Labella. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1810–1821.",
      "doi": "10.1145/2858036.2858119"
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1905–1914.",
      "doi": "10.1145/2702123.2702205"
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2016. “Thanks for Your Interest in Our Facebook Group, but It’s Only for Dads”: Social Roles of Stay-at-Home Dads. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work &; Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1363–1375.",
      "doi": "10.1145/2818048.2819927"
    },
    {
      "text": "Tawfiq Ammari, Sarita Schoenebeck, and Silvia Lindtner. 2017. The Crafting of DIY Fatherhood. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1109–1122.",
      "doi": "10.1145/2998181.2998270"
    },
    {
      "text": "Karen Anne Cochrane, Kristina Mah, Anna Ståhl, Claudia Núñez Pacheco, Madeline Balaam, Naseem Ahmadpour, and Lian Loke. 2022. Body Maps: A Generative Tool for Soma-Based Design. In Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction (Daejeon, Republic of Korea) (TEI ’22). Association for Computing Machinery, New York, NY, USA, Article 38, 14 pages.",
      "doi": ""
    },
    {
      "text": "All India Bakchod. 2015. AIB : Man’s Best Friend. https://www.youtube.com/watch?v=93oxfr6KfpA. Accessed on (2021/2/15).",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 2093–2102.",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Amanda Lazar, and Norman Makoto Su. 2019. (Re-)Framing Menopause Experiences for HCI and Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 115, 13 pages.",
      "doi": "10.1145/3290605.3300345"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Homi K Bhabha. 2012. The location of culture. routledge, Oxfordshire, UK.",
      "doi": ""
    },
    {
      "text": "Homi K Bhabha and Jonathan Rutherford. 2006. Third space. Multitudes 26, 3 (2006), 95–107.",
      "doi": ""
    },
    {
      "text": "Valeria Borsotti and Pernille Bjørn. 2022. Humor and Stereotypes in Computing: An Equity-Focused Approach to Institutional Accountability. Comput. Supported Coop. Work 31, 4 (dec 2022), 771–803. https://doi.org/10.1007/s10606-022-09440-9",
      "doi": "10.1007/s10606-022-09440-9"
    },
    {
      "text": "Braun, V. and Clarke, V.2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Nadia Campo Woytuk, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, and Madeline Balaam. 2020. Touching and Being in Touch with the Menstruating Body. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376471"
    },
    {
      "text": "Darren David Chadwick and Tracey Platt. 2018. Investigating humor in social interaction in people with intellectual disabilities: A systematic review of the literature. Frontiers in psychology 9 (2018), 1745.",
      "doi": ""
    },
    {
      "text": "Marianela Ciolfi Felice, Marie Louise Juul Søndergaard, and Madeline Balaam. 2021. Resisting the Medicalisation of Menopause: Reclaiming the Body through Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 408, 16 pages.",
      "doi": "10.1145/3411764.3445153"
    },
    {
      "text": "Mayara Costa Figueiredo and Yunan Chen. 2021. Health Data in Fertility Care: An Ecological Perspective. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 204, 17 pages.",
      "doi": "10.1145/3411764.3445189"
    },
    {
      "text": "Lorraine Culley, Nicky Hudson, and Frances Rapport. 2007. Using focus groups with minority ethnic communities: Researching infertility in British South Asian communities. Qualitative Health Research 17, 1 (2007), 102–112.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio, Rebecca Michelson, Alexis Hope, Josephine Hoy, Jennifer Roberts, and Kate Krontiris. 2020. \"The Personal is Political\": Hackathons as Feminist Consciousness Raising. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 150 (oct 2020), 23 pages.",
      "doi": "10.1145/3415221"
    },
    {
      "text": "Anna Eaglin and Shaowen Bardzell. 2011. Sex Toys and Designing for Sexual Wellness. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). ACM, New York, NY, USA, 1837–1842.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Nicole B. Lee, Jennifer H. Kang, Elena Agapie, Jessica Schroeder, Laura R. Pina, James Fogarty, Julie A. Kientz, and Sean Munson. 2017. Examining Menstrual Tracking to Inform the Design of Personal Informatics Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 6876–6888.",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": ""
    },
    {
      "text": "Ilker Etikan, Sulaiman Abubakar Musa, and Rukayya Sunusi Alkassim. 2016. Comparison of convenience sampling and purposive sampling. American journal of theoretical and applied statistics 5, 1 (2016), 1–4.",
      "doi": ""
    },
    {
      "text": "Hayley Evans, Udaya Lakshmi, Hue Watson, Azra Ismail, Andrew M. Sherrill, Neha Kumar, and Rosa I. Arriaga. 2020. Understanding the Care Ecologies of Veterans with PTSD. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3313831.3376170"
    },
    {
      "text": "Margaret Flemings, Shanzay Kazmi, Rachel Pak, and Orit Shaer. 2018. Crimson Wave: Shedding Light on Menstrual Health. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’18). ACM, Stockholm, Sweden, 343–348.",
      "doi": "10.1145/3173225.3173292"
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: Speculating Near-Future Menstrual Tracking Through Current Data Practices. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). ACM, New York, NY, USA, 541–552.",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Sarah E. Fox, Amanda Menking, Jordan Eschler, and Uba Backonja. 2020. Multiples Over Models: Interrogating the Past and Collectively Reimagining the Future of Menstrual Sensemaking. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 22 (Sept. 2020), 24 pages.",
      "doi": "10.1145/3397178"
    },
    {
      "text": "Aakash Gautam, Chandani Shrestha, Deborah Tatar, and Steve Harrison. 2018. Social Photo-Elicitation: The Use of Communal Production of Meaning to Hear a Vulnerable Population. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 56 (nov 2018), 20 pages.",
      "doi": "10.1145/3274325"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. Interactions 6, 1 (jan 1999), 21–29.",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "S M Taiabul Haque, Pratyasha Saha, Muhammad Sajidur Rahman, and Syed Ishtiaque Ahmed. 2019. Of Ulti, ’Hajano’, and \"Matachetar Otanetak Datam\": Exploring Local Practices of Exchanging Confidential and Sensitive Information in Urban Bangladesh. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 173 (nov 2019), 22 pages.",
      "doi": ""
    },
    {
      "text": "Karey Helms and Ylva Fernaeus. 2018. Humor in Design Fiction to Suspend Disbelief and Belief. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 801–818.",
      "doi": "10.1145/3240167.3240271"
    },
    {
      "text": "Sarah Homewood. 2018. Designing for the Changing Body: A Feminist Exploration of Self-Tracking Technologies. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). ACM, Montreal QC, Canada, DC11:1–DC11:4.",
      "doi": "10.1145/3170427.3173031"
    },
    {
      "text": "Sarah Homewood. 2018. Reframing design problems within women’s health. In Design as a catalyst for change-DRS International Conference 2018, C Storni, K Leahy, M McMahon, P Lloyd, and E Bohemia (Eds.). Design Research Society, Limerick, Ireland, 507–517.",
      "doi": ""
    },
    {
      "text": "Sarah Homewood. 2019. Inaction As a Design Decision: Reflections on Not Designing Self-Tracking Tools for Menopause. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). ACM, New York, NY, USA, Article alt17, 12 pages.",
      "doi": "10.1145/3290607.3310430"
    },
    {
      "text": "Sarah Homewood, Laurens Boer, and Anna Vallgårda. 2020. Designers in White Coats: Deploying Ovum, a Fertility Tracking Device. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376528"
    },
    {
      "text": "Alexis Hope, Catherine D’Ignazio, Josephine Hoy, Rebecca Michelson, Jennifer Roberts, Kate Krontiris, and Ethan Zuckerman. 2019. Hackathons as Participatory Design: Iterating Feminist Utopias. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300291"
    },
    {
      "text": "Minal Jain and Pradeep Yammiyavar. 2015. Game based learning tool seeking peer support for empowering adolescent girls in rural Assam. In Proceedings of the 14th International Conference on Interaction Design and Children. ACM, New York, NY, USA, 275–278.",
      "doi": "10.1145/2771839.2771895"
    },
    {
      "text": "Jonas Kjeldmand Jensen, Tawfiq Ammari, and Pernille Bjørn. 2019. Into Scandinavia: When Online Fatherhood Reflects Societal Infrastructures. Proc. ACM Hum.-Comput. Interact. 3, GROUP, Article 231 (dec 2019), 21 pages.",
      "doi": "10.1145/3361112"
    },
    {
      "text": "Adam N Joinson, Carina Paine, Tom Buchanan, and Ulf-Dietrich Reips. 2008. Measuring self-disclosure online: Blurring and non-response to sensitive items in web-based surveys. Computers in Human Behavior 24, 5 (2008), 2158–2171.",
      "doi": "10.1016/j.chb.2007.10.005"
    },
    {
      "text": "Gopinaath Kannabiran, Alex A. Ahmed, Matthew Wood, Madeline Balaam, Joshua G. Tanenbaum, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design for Sexual Wellbeing in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). ACM, New York, NY, USA, Article W09, 7 pages.",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI Talks about Sexuality: Discursive Strategies, Blind Spots, and Opportunities for Future Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 695–704.",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Neha Kumar. 2016. Interviewing against the odds. In Innovative methods in media and communication research. Springer, London, UK, 207–220.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Naveena Karusala, Azra Ismail, and Anupriya Tuli. 2020. Taking the Long, Holistic, and Intersectional View to Women’s Wellbeing. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 23 (July 2020), 32 pages.",
      "doi": "10.1145/3397159"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, and Richard Anderson. 2015. Projecting Health: Community-Led Video Education for Maternal Health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (Singapore, Singapore) (ICTD ’15). Association for Computing Machinery, New York, NY, USA, Article 17, 10 pages. https://doi.org/10.1145/2737856.2738023",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 480, 16 pages.",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Xiubo Liang, Jing Zhang, Jiayi Ma, Jiayu Yao, Weijia Lin, Zheliang Zhu, Yingying Ma, Fangtian Ying, Cheng Yao, Leijing Zhou, Preben Hansen, Yijun Zhao, and Guanyun Wang. 2022. Menstrual Monster: A Tangible Interactive Co-Educational Game Designed for Teenagers. In Extended Abstracts of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 247, 7 pages.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2011. HCI as Heterodoxy: Technologies of Identity and the Queering of Interaction with Computers. Interact. Comput. 23, 5 (sep 2011), 430–438.",
      "doi": "10.1016/j.intcom.2011.02.002"
    },
    {
      "text": "Kai Lukoff, Carol Moser, and Sarita Schoenebeck. 2017. Gender Norms and Attitudes about Childcare Activities Presented on Father Blogs. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4966–4971.",
      "doi": "10.1145/3025453.3025767"
    },
    {
      "text": "Deborah Lupton. 2015. Quantified sex: a critical analysis of sexual and reproductive self-tracking using apps. Culture, health & sexuality 17, 4 (2015), 440–453.",
      "doi": ""
    },
    {
      "text": "Juan F. Maestre, Patrycja Zdziarska, Aehong Min, Anna N. Baglione, Chia-Fang Chung, and Patrick C. Shih. 2021. Not Another Medication Adherence App: Critical Reflections on Addressing Public HIV-related Stigma Through Design. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3 (Jan 2021), 262:1–262:28. https://doi.org/10.1145/3434171",
      "doi": "10.1145/3434171"
    },
    {
      "text": "Menstrupedia. 2017. Friendly guide to healthy periods. https://www.menstrupedia.com/. Accessed on (2017/07/19).",
      "doi": ""
    },
    {
      "text": "Mumbai Mirror. 2022. Ask the Sexpert. https://bit.ly/3Ux5rqz. Accessed on (2022/9/18).",
      "doi": ""
    },
    {
      "text": "Durba Mitra. 2020. Indian Sex Life: Sexuality and the Colonial Origins of Modern Social Thought. In Indian Sex Life: Sexuality and the Colonial Origins of Modern Social Thought. Princeton University Press, Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "Saskia SL Mol, Arnoud Arntz, Job FM Metsemakers, Geert-Jan Dinant, Pauline AP Vilters-Van Montfort, and J André Knottnerus. 2005. Symptoms of post-traumatic stress disorder after non-traumatic events: Evidence from an open population study. The British Journal of Psychiatry 186, 6 (2005), 494–499.",
      "doi": ""
    },
    {
      "text": "Maryam Mustafa, Kimia Tuz Zaman, Tallal Ahmad, Amna Batool, Masitah Ghazali, and Nova Ahmed. 2021. Religion and Women’s Intimate Health: Towards an Inclusive Approach to Healthcare. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 232, 13 pages.",
      "doi": "10.1145/3411764.3445605"
    },
    {
      "text": "Netflix. 2018. Lust Stories. https://www.netflix.com/title/80991033. Accessed on (2021/2/15).",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2021. Sexual Health. https://bit.ly/3QeUM0h. Accessed on (2021/2/15).",
      "doi": ""
    },
    {
      "text": "Dilisha Patel, Ann Blandford, Mark Warner, Jill Shawe, and Judith Stephenson. 2019. \"I Feel like Only Half a Man\": Online Forums as a Resource for Finding a \"New Normal\" for Men Experiencing Fertility Issues. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 82 (nov 2019), 20 pages.",
      "doi": "10.1145/3359184"
    },
    {
      "text": "Jessica A. Pater, Lauren E. Reining, Andrew D. Miller, Tammy Toscos, and Elizabeth D. Mynatt. 2019. \"Notjustgirls\": Exploring Male-Related Eating Disordered Content across Social Media Platforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300881"
    },
    {
      "text": "Sharyn Pearce. 2006. Sex and the cinema: What American Pie teaches the young. Sex Education 6, 4 (2006), 367–376.",
      "doi": ""
    },
    {
      "text": "Trevor Perrier, Elizabeth K. Harrington, Keshet Ronen, Daniel Matemo, John Kinuthia, Grace John-Stewart, Richard Anderson, and Jennifer A. Unger. 2018. Male Partner Engagement in Family Planning SMS Conversations at Kenyan Health Clinics. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (Menlo Park and San Jose, CA, USA) (COMPASS ’18). Association for Computing Machinery, New York, NY, USA, Article 3, 11 pages.",
      "doi": "10.1145/3209811.3209857"
    },
    {
      "text": "Ishkiran Rai, Dilisha Patel, and Aneesha Singh. 2022. \"It’s Come around Way Too Quickly!\" Can Technology Help Parents Provide Support during Menarche?. In Designing Interactive Systems Conference (Virtual Event, Australia) (DIS ’22). Association for Computing Machinery, New York, NY, USA, 1743–1757.",
      "doi": "10.1145/3532106.3534568"
    },
    {
      "text": "Afsaneh Razi, Karla Badillo-Urquiola, and Pamela J. Wisniewski. 2020. Let’s Talk about Sext: How Adolescents Seek Support and Advice about Their Online Sexual Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376400"
    },
    {
      "text": "Jennifer A Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5 (2011), 393–400.",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Jane Seymour, Gary Bellamy, Merryn Gott, Sam H Ahmedzai, and David Clark. 2002. Using focus groups to explore older people’s attitudes to end of life care. Ageing & Society 22, 4 (2002), 517–526.",
      "doi": ""
    },
    {
      "text": "Makoto Shiraishi, Yoshihiro Sowa, and Naoki Inafuku. 2023. Long-term survey of sexual well-being after breast reconstruction using the BREAST-Q in the Japanese population. Asian Journal of Surgery 46, 1 (2023), 150–155.",
      "doi": ""
    },
    {
      "text": "Vaishali Sinha. 2017. Ask the Sexpert Movie. https://www.askthesexpertmovie.com/. Accessed on (2021/2/15).",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, and Madeline Balaam. 2021. Designing Menstrual Technologies with Adolescents. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA, Article 260, 14 pages.",
      "doi": "10.1145/3411764.3445471"
    },
    {
      "text": "Marie Louise Juul Søndergaard, Ozgun Kilic Afsar, Marianela Ciolfi Felice, Nadia Campo Woytuk, and Madeline Balaam. 2020. Designing with Intimate Materials and Movements: Making \"Menarche Bits\". In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 587–600.",
      "doi": "10.1145/3357236.3395592"
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the Elephant in the Classroom: Using Culturally Localized Technology To Teach Around Taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 2792–2804.",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "Norman Makoto Su, Amanda Lazar, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Of dolls and men: Anticipating sexual intimacy with robots. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 3(2019), 1–35.",
      "doi": "10.1145/3301422"
    },
    {
      "text": "Giulia Tomasello and Teresa Almeida. 2020. Empowerment and Self-Care. In Crafting Anatomies: Archives, Dialogues, Fabrications, Amanda Briggs-Goode Katherine Townsend, Rhian Solomon (Ed.). London: Bloomsbury Visual Arts, London, United Kingdom, Chapter 9, 171–188.",
      "doi": ""
    },
    {
      "text": "Austin Toombs, Shad Gross, Shaowen Bardzell, and Jeffrey Bardzell. 2017. From Empathy to Care: A Feminist Care Ethics Perspective on Long-Term Researcher–Participant Relations. Interacting with Computers 29, 1 (2017), 45–57.",
      "doi": ""
    },
    {
      "text": "Bonnie Tran and Lee Na Choi. 2018. Menstrual Maze: A Toy Exploring Public Engagement in Menstrual Health Education. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6.",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Neha Kumar, and Pushpendra Singh. 2018. Learning from and with Menstrupedia: Towards Menstrual Health Education in India. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 174 (Nov. 2018), 20 pages.",
      "doi": "10.1145/3274443"
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Pushpendra Singh, and Neha Kumar. 2020. Menstrual (Im)Mobilities and Safe Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3313831.3376653"
    },
    {
      "text": "Anupriya Tuli, Shruti Dalvi, Neha Kumar, and Pushpendra Singh. 2019. “It’s a Girl Thing”: Examining Challenges and Opportunities around Menstrual Health Education in India. ACM Trans. Comput.-Hum. Interact. 26, 5, Article 29 (July 2019), 24 pages.",
      "doi": "10.1145/3325282"
    },
    {
      "text": "Anupriya Tuli, Surbhi Singh, Rikita Narula, Neha Kumar, and Pushpendra Singh. 2022. Rethinking Menstrual Trackers Towards Period-Positive Ecologies. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 283, 20 pages.",
      "doi": "10.1145/3491102.3517662"
    },
    {
      "text": "Amazone Prime Video. 2020. Mirzapur Season-2. https://bit.ly/3k2gzOM. Accessed on (2021/2/15).",
      "doi": ""
    },
    {
      "text": "Matthew Wood, Gavin Wood, and Madeline Balaam. 2015. Talk About Sex: Designing Games to Facilitate Healthy Discussions around Sex. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 795–798.",
      "doi": "10.1145/2793107.2810270"
    },
    {
      "text": "Matthew Wood, Gavin Wood, and Madeline Balaam. 2017. Sex Talk: Designing for Sexual Health with Adolescents. In Proceedings of the 2017 Conference on Interaction Design and Children (Stanford, California, USA) (IDC ’17). Association for Computing Machinery, New York, NY, USA, 137–147.",
      "doi": "10.1145/3078072.3079747"
    },
    {
      "text": "Matthew Wood, Gavin Wood, and Madeline Balaam. 2017. \"They’re Just Tixel Pits, Man\": Disputing the ’Reality’ of Virtual Reality Pornography through the Story Completion Method. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5439–5451.",
      "doi": "10.1145/3025453.3025762"
    },
    {
      "text": "Qingxiao Zheng, Daniela M. Markazi, Yiliu Tang, and Yun Huang. 2021. \"PocketBot Is Like a Knock-On-the-Door!\": Designing a Chatbot to Support Long-Distance Relationships. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 445 (oct 2021), 28 pages.",
      "doi": "10.1145/3479589"
    },
    {
      "text": "John B. Ziegler. 1998. Use of humour in medical teaching. Medical Teacher 20, 4 (Jan 1998), 341–348.",
      "doi": ""
    }
  ]
}