{
  "doi": "10.1145/3544548.3580678",
  "title": "GestureExplorer: Immersive Visualisation and Exploration of Gesture Data",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2023,
  "badges": [],
  "abstract": "This paper presents the design and evaluation of GestureExplorer, an Immersive Analytics tool that supports the interactive exploration, classification and sensemaking with large sets of 3D temporal gesture data. GestureExplorer features 3D skeletal and trajectory visualisations of gestures combined with abstract visualisations of clustered sets of gestures. By leveraging the large immersive space afforded by a Virtual Reality interface our tool allows free navigation and control of viewing perspective for users to gain a better understanding of gestures.  We explored a selection of classification methods to provide an overview of the dataset that was linked to a detailed view of the data that showed different visualisation modalities. We evaluated GestureExplorer with two user studies and collected feedback from participants with diverse visualisation and analytics backgrounds. Our results demonstrated the promising capability of GestureExplorer for providing a useful and engaging experience in exploring and analysing gesture data.",
  "authors": [
    {
      "name": "Ang Li",
      "institution": "Data Visualisation and Immersive Analytics Lab, Monash University, Australia and School of Information Technology and Electrical Engineering, University of Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782833",
      "orcid": "0000-0001-7707-0494"
    },
    {
      "name": "Jiazhou Liu",
      "institution": "Data Visualisation and Immersive Analytics Lab, Monash University, Australia",
      "img": "/do/10.1145/contrib-99660643998/rel-imgonly/selfie1_square.jpg",
      "acmid": "99660643998",
      "orcid": "0000-0003-4541-0233"
    },
    {
      "name": "Maxime Cordeil",
      "institution": "School of Information Technology and Electrical Engineering, The University Of Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488668405",
      "orcid": "0000-0002-9732-4874"
    },
    {
      "name": "Jack Topliss",
      "institution": "School of Product Design, University of Canterbury, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659867719",
      "orcid": "0000-0002-9884-2980"
    },
    {
      "name": "Thammathip Piumsomboon",
      "institution": "School of Product Design, University of Canterbury, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490694758",
      "orcid": "0000-0001-5870-9221"
    },
    {
      "name": "Barrett Ens",
      "institution": "Data Visualisation and Immersive Analytics Lab, Monash University, Australia",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    }
  ],
  "references": [
    {
      "text": "2005. Metric and Nonmetric MDS. Springer New York, New York, NY, 199–225. https://doi.org/10.1007/0-387-28981-X_9",
      "doi": ""
    },
    {
      "text": "2007. Dynamic Time Warping. Springer Berlin Heidelberg, Berlin, Heidelberg, 69–84. https://doi.org/10.1007/978-3-540-74048-3_4",
      "doi": ""
    },
    {
      "text": "Daniel Abadi, Rakesh Agrawal, Anastasia Ailamaki, Magdalena Balazinska, Philip A. Bernstein, Michael J. Carey, Surajit Chaudhuri, Jeffrey Dean, AnHai Doan, Michael J. Franklin, Johannes Gehrke, Laura M. Haas, Alon Y. Halevy, Joseph M. Hellerstein, Yannis E. Ioannidis, H. V. Jagadish, Donald Kossmann, Samuel Madden, Sharad Mehrotra, Tova Milo, Jeffrey F. Naughton, Raghu Ramakrishnan, Volker Markl, Christopher Olston, Beng Chin Ooi, Christopher Ré, Dan Suciu, Michael Stonebraker, Todd Walter, and Jennifer Widom. 2014. The Beckman Report on Database Research. SIGMOD Rec. 43, 3 (2014), 61–70. https://doi.org/10.1145/2694428.2694441",
      "doi": "10.1145/2694428.2694441"
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: Enhancing Movement Training with an Augmented Reality Mirror. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 311–320. https://doi.org/10.1145/2501988.2502045",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "A Aristidou, J Lasenby, Y Chrysanthou, and A Shamir. 2018. Inverse Kinematics Techniques in Computer Graphics: A Survey: Inverse Kinematics Techniques in Computer Graphics. Computer graphics forum 37, 6 (2018), 35–58.",
      "doi": ""
    },
    {
      "text": "David Arthur and Sergei Vassilvitskii. 2007. K-Means++: The Advantages of Careful Seeding. In Proceedings of the Eighteenth Annual ACM-SIAM Symposium on Discrete Algorithms (New Orleans, Louisiana) (SODA ’07). Society for Industrial and Applied Mathematics, USA, 1027–1035.",
      "doi": "10.5555/1283383.1283494"
    },
    {
      "text": "Daniel Ashbrook and Thad Starner. 2010. MAGIC: A Motion Gesture Design Tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 2159–2168. https://doi.org/10.1145/1753326.1753653",
      "doi": "10.1145/1753326.1753653"
    },
    {
      "text": "Donald J. Berndt and James Clifford. 1994. Using Dynamic Time Warping to Find Patterns in Time Series. In Proceedings of the 3rd International Conference on Knowledge Discovery and Data Mining (Seattle, WA) (AAAIWS’94). AAAI Press, 359–370.",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Anke Lehmann, and Raimund Dachselt. 2021. MIRIA: A Mixed Reality Toolkit for the In-Situ Visualization and Analysis of Spatio-Temporal Interaction Data. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 470, 15 pages. https://doi.org/10.1145/3411764.3445651",
      "doi": "10.1145/3411764.3445651"
    },
    {
      "text": "D. Coffey, F. Korsakov, M. Ewert, H. Hagh‐Shenas, L. Thorson, A. Ellingson, D. Nuckley, and D. F. Keefe. 2012. Visualizing Motion Data in Virtual Reality: Understanding the Roles of Animation, Interaction, and Static Presentation. Computer graphics forum 31, 3pt3 (2012), 1215–1224. https://doi.org/10.1111/j.1467-8659.2012.03114.x",
      "doi": "10.1111/j.1467-8659.2012.03114.x"
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Tim Dwyer, Bruce H. Thomas, and Kim Marriott. 2017. ImAxes: Immersive Axes as Embodied Affordances for Interactive Multivariate Data Visualisation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 71–83. https://doi.org/10.1145/3126594.3126613",
      "doi": "10.1145/3126594.3126613"
    },
    {
      "text": "Hai Dang and Daniel Buschek. 2021. GestureMap: Supporting Visual Analytics and Quantitative Analysis of Motion Elicitation Data by Learning 2D Embeddings. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445765",
      "doi": "10.1145/3411764.3445765"
    },
    {
      "text": "Tim Dwyer, Kim Marriott, Tobias Isenberg, Karsten Klein, Nathalie Riche, Falk Schreiber, Wolfgang Stuerzlinger, and Bruce H. Thomas. 2018. Immersive Analytics: An Introduction. Springer International Publishing, Cham, 1–23. https://doi.org/10.1007/978-3-030-01388-2_1",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Fraser Anderson, Tovi Grossman, Michelle Annett, Pourang Irani, and George Fitzmaurice. 2017. Ivy: Exploring Spatially Situated Visual Programming for Authoring and Understanding Intelligent Environments.",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Benjamin Bach, Maxime Cordeil, Ulrich Engelke, Marcos Serrano, Wesley Willett, Arnaud Prouzeau, Christoph Anthes, Wolfgang Büschel, Cody Dunne, Tim Dwyer, Jens Grubert, Jason H. Haga, Nurit Kirshenbaum, Dylan Kobayashi, Tica Lin, Monsurat Olaosebikan, Fabian Pointecker, David Saffo, Nazmus Saquib, Dieter Schmalstieg, Danielle Albers Szafir, Matt Whitlock, and Yalong Yang. 2021. Grand Challenges in Immersive Analytics. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3446866",
      "doi": "10.1145/3411764.3446866"
    },
    {
      "text": "Barrett Ens and Pourang Irani. 2017. Spatial Analytic Interfaces: Spatial User Interfaces for In Situ Visual Analytics. IEEE Comput. Graph. Appl. 37, 2 (mar 2017), 66–79. https://doi.org/10.1109/MCG.2016.38",
      "doi": "10.1109/MCG.2016.38"
    },
    {
      "text": "N. Férey, P. E. Gros, J. Hérisson, and R. Gherbi. 2005. Visual Data Mining of Genomic Databases by Immersive Graph-Based Exploration. In Proceedings of the 3rd International Conference on Computer Graphics and Interactive Techniques in Australasia and South East Asia (Dunedin, New Zealand) (GRAPHITE ’05). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1101389.1101418",
      "doi": "10.1145/1101389.1101418"
    },
    {
      "text": "A. Fonnet and Y. Prié. 2021. Survey of Immersive Analytics. IEEE Transactions on Visualization and Computer Graphics 27, 3(2021), 2101–2122. https://doi.org/10.1109/TVCG.2019.2929033",
      "doi": ""
    },
    {
      "text": "Yuki Fujiwara, Kohei Ichikawa, Haruo Takemura, 2011. A multi-application controller for sage-enabled tiled display wall in wide-area distributed computing environments. Journal of Information Processing Systems 7, 4 (2011), 581–594. https://doi.org/10.3745/JIPS.2011.7.4.581",
      "doi": ""
    },
    {
      "text": "Devamardeep Hayatpur, Haijun Xia, and Daniel Wigdor. 2020. DataHop: Spatial Data Exploration in Virtual Reality. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 818–828. https://doi.org/10.1145/3379337.3415878",
      "doi": "10.1145/3379337.3415878"
    },
    {
      "text": "Dominik Herrmann, Jan Reinhardt, Robert Krueger, Guido Reina, and Thomas Ertl. 2017. Immersive Visual Analytics for Modular Factory Layout Planning.",
      "doi": ""
    },
    {
      "text": "Yueqi Hu, Shuangyuan Wu, Shihong Xia, Jinghua Fu, and Wei Chen. 2010. Motion track: Visualizing variations of human motion data. In 2010 IEEE Pacific Visualization Symposium (PacificVis). 153–160. https://doi.org/10.1109/PACIFICVIS.2010.5429596",
      "doi": ""
    },
    {
      "text": "Jan-Paul Huttner and Susanne Robra-Bissantz. 2017. An Immersive Memory Palace: Supporting the Method of Loci with Virtual Reality.",
      "doi": ""
    },
    {
      "text": "Sujin Jang, Niklas Elmqvist, and Karthik Ramani. 2014. GestureAnalyzer: Visual Analytics for Pattern Analysis of Mid-Air Hand Gestures. In Proceedings of the 2nd ACM Symposium on Spatial User Interaction (Honolulu, Hawaii, USA) (SUI ’14). Association for Computing Machinery, New York, NY, USA, 30–39. https://doi.org/10.1145/2659766.2659772",
      "doi": "10.1145/2659766.2659772"
    },
    {
      "text": "S. Jang, N. Elmqvist, and K. Ramani. 2016. MotionFlow: Visual Abstraction and Aggregation of Sequential Patterns in Human Motion Tracking Data. IEEE Transactions on Visualization and Computer Graphics 22, 1(2016), 21–30. https://doi.org/10.1109/TVCG.2015.2468292",
      "doi": "10.1109/TVCG.2015.2468292"
    },
    {
      "text": "Waldemar Karwowski. 2006. International encyclopedia of ergonomics and human factors. Vol. 1. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Lawrence H. Kim, Daniel S. Drew, Veronika Domova, and Sean Follmer. 2020. User-Defined Swarm Robot Control. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376814",
      "doi": "10.1145/3313831.3376814"
    },
    {
      "text": "Simon Kloiber, Volker Settgast, Christoph Schinko, Martin Weinzerl, Johannes Fritz, Tobias Schreck, and Reinhold Preiner. 2020. Immersive analysis of user motion in VR applications. The Visual computer 36, 10-12 (2020), 1937–1949. https://doi.org/10.1007/s00371-020-01942-1",
      "doi": "10.1007/s00371-020-01942-1"
    },
    {
      "text": "Benjamin Lee, Maxime Cordeil, Arnaud Prouzeau, and Tim Dwyer. 2019. FIESTA: A Free Roaming Collaborative Immersive Analytics System. In Proceedings of the ACM International Conference on Interactive Surfaces and Spaces (Daejeon, Republic of Korea) (ISS ’19). ACM, New York, NY, USA, 335–338. https://doi.org/10.1145/3343055.3360746",
      "doi": "10.1145/3343055.3360746"
    },
    {
      "text": "Jiazhou Liu, Arnaud Prouzeau, Barrett Ens, and Tim Dwyer. 2020. Design and Evaluation of Interactive Small Multiples Data Visualisation in Immersive Spaces. In IEEE Conference on Virtual Reality and 3D User Interfaces (VR)(VR ’20). IEEE, Atlanta, Georgia, USA, 588–597. https://doi.org/10.1109/VR46266.2020.00-23",
      "doi": ""
    },
    {
      "text": "Salvatore T March and Gerald F Smith. 1995. Design and natural science research on information technology. Decision Support Systems 15, 4 (1995), 251–266.",
      "doi": ""
    },
    {
      "text": "Kim Marriott, Jian Chen, Marcel Hlawatsch, Takayuki Itoh, Miguel A. Nacenta, Guido Reina, and Wolfgang Stuerzlinger. 2018. Immersive Analytics: Time to Reconsider the Value of 3D for Information Visualisation. Springer International Publishing, Cham, 25–55. https://doi.org/10.1007/978-3-030-01388-2_2",
      "doi": ""
    },
    {
      "text": "Kim Marriott, Jian Chen, Marcel Hlawatsch, Takayuki Itoh, Miguel A. Nacenta, Guido Reina, and Wolfgang Stuerzlinger. 2018. Immersive Analytics: Time to Reconsider the Value of 3D for Information Visualisation. In Immersive Analytics. Springer International Publishing, Cham, 25–55.",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream Lens: Exploration and Visualization of Large-Scale Generative Design Datasets. Association for Computing Machinery, Paper 369. https://doi.org/10.1145/3173574.3173943",
      "doi": "10.1145/3173574.3173943"
    },
    {
      "text": "Meredith Ringel Morris. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces(Cambridge, Massachusetts, USA) (ITS ’12). Association for Computing Machinery, New York, NY, USA, 95–104. https://doi.org/10.1145/2396636.2396651",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Tamara Munzner. 2015. Why: Task Abstraction. In Visualization Analysis and Design. A K Peters/CRC Press, 43–65.",
      "doi": ""
    },
    {
      "text": "Rhys Newbury, Kadek Ananta Satriadi, Jesse Bolton, Jiazhou Liu, Maxime Cordeil, Arnaud Prouzeau, and Bernhard Jenny. 2021. Embodied gesture interaction for immersive maps. Cartography and Geographic Information Science 48, 5 (2021), 417–431. https://doi.org/10.1080/15230406.2021.1929492 arXiv:https://doi.org/10.1080/15230406.2021.1929492",
      "doi": ""
    },
    {
      "text": "Masaki Oshita. 2019. Motion Volume: Visualization of Human Motion Manifolds. In The 17th International Conference on Virtual-Reality Continuum and Its Applications in Industry (Brisbane, QLD, Australia) (VRCAI ’19). Association for Computing Machinery, New York, NY, USA, Article 7, 7 pages. https://doi.org/10.1145/3359997.3365684",
      "doi": "10.1145/3359997.3365684"
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "François Petitjean, Alain Ketterlin, and Pierre Gançarski. 2011. A global averaging method for dynamic time warping, with applications to clustering. Pattern Recognition 44, 3 (2011), 678–693. https://doi.org/10.1016/j.patcog.2010.09.013",
      "doi": "10.1016/j.patcog.2010.09.013"
    },
    {
      "text": "Arnaud Prouzeau, Anastasia Bezerianos, and Olivier Chapuis. 2016. Towards road traffic management with forecasting on wall displays. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces. ACM, Niagara Falls, Ontario, Canada, 119–128. https://doi.org/10.1145/2992154.2992158",
      "doi": "10.1145/2992154.2992158"
    },
    {
      "text": "Patrick Reipschläger, Frederik Brudy, Raimund Dachselt, Justin Matejka, George Fitzmaurice, and Fraser Anderson. 2022. AvatAR: An Immersive Analysis Environment for Human Motion Data Combining Interactive 3D Avatars and Trajectories. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 23, 15 pages. https://doi.org/10.1145/3491102.3517676",
      "doi": "10.1145/3491102.3517676"
    },
    {
      "text": "Kadek Ananta Satriadi, Barrett Ens, Maxime Cordeil, Tobias Czauderna, and Bernhard Jenny. 2020. Maps Around Me: 3D Multiview Layouts in Immersive Spaces. Proc. ACM Hum.-Comput. Interact. 4, ISS, Article 201 (Nov. 2020), 20 pages. https://doi.org/10.1145/3427329",
      "doi": "10.1145/3427329"
    },
    {
      "text": "Kadek Ananta Satriadi, Barrett Ens, Tobias Czauderna, Maxime Cordeil, and Bernhard Jenny. 2021. Quantitative Data Visualisation on Virtual Globes. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445152",
      "doi": "10.1145/3411764.3445152"
    },
    {
      "text": "Willy Scheibel, Matthias Trapp, and Jürgen Döllner. 2016. Interactive Revision Exploration using Small Multiples of Software Maps.. In VISIGRAPP (2: IVAPP). 133–140.",
      "doi": ""
    },
    {
      "text": "B. Shneiderman. 1996. The eyes have it: a task by data type taxonomy for information visualizations. In Proceedings 1996 IEEE Symposium on Visual Languages. 336–343. https://doi.org/10.1109/VL.1996.545307",
      "doi": ""
    },
    {
      "text": "Romain Tavenard, Johann Faouzi, Gilles Vandewiele, Felix Divo, Guillaume Androz, Chester Holtz, Marie Payne, Roman Yurchak, Marc Rußwurm, Kushal Kolar, and Eli Woods. 2020. Tslearn, A Machine Learning Toolkit for Time Series Data. (2020).",
      "doi": ""
    },
    {
      "text": "Michael E Tipping and Christopher M Bishop. 1999. Probabilistic Principal Component Analysis. Journal of the Royal Statistical Society. Series B, Statistical methodology 61, 3(1999), 611–622.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu. 2019. The Dissimilarity-Consensus Approach to Agreement Analysis in Gesture Elicitation Studies. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300454",
      "doi": "10.1145/3290605.3300454"
    },
    {
      "text": "Santiago Villarreal-Narvaez, Jean Vanderdonckt, Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2020. A Systematic Review of Gesture Elicitation Studies: What Can We Learn from 216 Studies?. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 855–872. https://doi.org/10.1145/3357236.3395511",
      "doi": "10.1145/3357236.3395511"
    },
    {
      "text": "Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the Guessability of Symbolic Input. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA) (CHI EA ’05). Association for Computing Machinery, New York, NY, USA, 1869–1872. https://doi.org/10.1145/1056808.1057043",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-Defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1083–1092. https://doi.org/10.1145/1518701.1518866",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Yidan Zhang, Barrett Ens, Kadek Satriadi, Arnaud Prouzeau, and Sarah Goodwin. 2022. TimeTables: Embodied Exploration of Immersive Spatio-Temporal Data. 599–605. https://doi.org/10.1109/VR51125.2022.00080",
      "doi": ""
    },
    {
      "text": "Arthur Zimek, Erich Schubert, and Hans-Peter Kriegel. 2012. A survey on unsupervised outlier detection in high-dimensional numerical data. Statistical Analysis and Data Mining: The ASA Data Science Journal 5, 5(2012), 363–387. https://doi.org/10.1002/sam.11161 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/sam.11161",
      "doi": "10.1002/sam.11161"
    }
  ]
}