{
  "doi": "10.1145/3544548.3581343",
  "title": "KnitDema: Robotic Textile as Personalized Edema Mobilization Device",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "Hand edema, defined as swelling of the hands caused by excess fluid accumulation, is a pervasive condition affecting a person’s range of motion and functional ability. However, treatment strategies remain limited to time-consuming manual massage by trained therapists, deterring a widely accessible approach. We present KnitDema, a robotic textile device that allows sequential compression from distal to proximal finger phalanges for mobilizing edema. We machine-knit the device and integrate small-scale actuators to envelop granular body locations such as fingers, catering to the shape of the hand. In addition, the device affords customizable compression levels through the enclosed fiber-like actuators. We characterize compression parameters and simulate the shunting of edema through a mock fluid system. Finally, we conduct a case study to evaluate the feasibility of the device, in which five hand edema patients assess KnitDema. Our study provides insights into the opportunities for robotic textiles to support personalized rehabilitation.",
  "tags": [
    "Compression Device",
    "Rehabilitation Device",
    "E-Textile",
    "Robotic Textile",
    "Wearable Computing",
    "Haptics",
    "Hand Edema"
  ],
  "authors": [
    {
      "name": "Jin Hee (Heather) Kim",
      "institution": "Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659763160",
      "orcid": "0000-0002-1562-9835"
    },
    {
      "name": "Joan Stilling",
      "institution": "Rehabilitation Medicine, Weill Cornell Medicine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782036",
      "orcid": "0000-0003-0658-242X"
    },
    {
      "name": "Michael O'Dell",
      "institution": "Rehabilitation Medicine, Weill Cornell Medicine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782887",
      "orcid": "0000-0002-2548-2152"
    },
    {
      "name": "Cindy Hsin-Liu Kao",
      "institution": "Hybrid Body Lab, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779455",
      "orcid": "0000-0003-1316-4170"
    }
  ],
  "references": [
    {
      "text": "Hasan M. Al-Dorzi, Abdulaziz Al-Dawood, Fahad M. Al-Hameed, Karen E.A. Burns, Sangeeta Mehta, Jesna Jose, Sami Alsolamy, Sheryl Ann I. Abdukahil, Lara Y. Afesh, Mohammed S. Alshahrani, Yasser Mandourah, Ghaleb A. Almekhlafi, Mohammed Almaani, Ali Al Bshabshe, Simon Finfer, Zia Arshad, Imran Khalid, Yatin Mehta, Atul Gaur, Hassan Hawa, Hergen Buscher, Hani Lababidi, Abdulsalam Al Aithan, and Yaseen M. Arabi. 2022. The effect of intermittent pneumatic compression on deep-vein thrombosis and ventilation-free days in critically ill patients with heart failure. Scientific Reports 12, 1 (2022), 1–10. https://doi.org/10.1038/s41598-022-12336-9",
      "doi": ""
    },
    {
      "text": "Tariq Osman Andersen. 2019. Large-Scale and Long-Term Co-Design of Digital Health. Interactions 26, 5 (aug 2019), 74–77. https://doi.org/10.1145/3356252",
      "doi": "10.1145/3356252"
    },
    {
      "text": "Kendrick Au. [n. d.]. Hand Swelling after Hand and Wrist Surgery: An Evaluation of its Effects and Assessment of Feasibility of a Double Blinded, Randomized Controlled, Pilot Study: Tranexamic Acid in Hand And Wrist Surgery (THAW) Study. ([n. d.]), 114.",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software 67, 1 (2015), 1–48. https://doi.org/10.18637/jss.v067.i01",
      "doi": ""
    },
    {
      "text": "Alison Bell and Melissa Muller. 2013. Effects of kinesio tape to reduce hand edema in acute stroke. Topics in Stroke Rehabilitation 20, 3 (2013), 283–288. https://doi.org/10.1310/tsr2003-283",
      "doi": ""
    },
    {
      "text": "Susan Boiselle Howard and Sheama Krishnagiri. 2001. The use of manual edema mobilization for the reduction of persistent edema in the upper limb. Journal of Hand Therapy 14, 4 (Oct. 2001), 291–301. https://doi.org/10.1016/S0894-1130(01)80008-9",
      "doi": ""
    },
    {
      "text": "H Gm Boomkamp-Koppen, Jma Ma Visser-Meily, M Wm Post, and A Jh Prevo. 2005. Poststroke hand swelling and oedema: prevalence and relationship with impairment and disability. Clinical Rehabilitation 19, 5 (Aug. 2005), 552–559. https://doi.org/10.1191/0269215505cr846oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Trevor L. Buckner, R. Adam Bilodeau, Sang Yup Kim, and Rebecca Kramer-Bottiglio. 2020. Roboticizing fabric by integrating functional fibers. Proceedings of the National Academy of Sciences 117, 41 (Oct. 2020), 25360–25369. https://doi.org/10.1073/pnas.2006211117",
      "doi": ""
    },
    {
      "text": "Trevor L Buckner and Rebecca Kramer-Bottiglio. 2018. Functional fibers for robotic fabrics. Multifunctional Materials 1, 1 (2018), 012001. https://doi.org/10.1088/2399-7532/aad378",
      "doi": ""
    },
    {
      "text": "Leonardo Cappello, Jan T. Meyer, Kevin C. Galloway, Jeffrey D. Peisner, Rachael Granberry, Diana A. Wagner, Sven Engelhardt, Sabrina Paganoni, and Conor J. Walsh. 2018. Assisting hand function after spinal cord injury with a fabric-based soft robotic glove. Journal of NeuroEngineering and Rehabilitation 15, 1(2018), 1–10. https://doi.org/10.1186/s12984-018-0391-x",
      "doi": ""
    },
    {
      "text": "Femke Cappon, Tingting Wu, Theodore Papaioannou, Xinli Du, Po-Lin Hsu, and Ashraf W Khir. 2021. Mock circulatory loops used for testing cardiac assist devices: A review of computational and experimental models. The International Journal of Artificial Organs 44, 11 (Nov. 2021), 793–806. https://doi.org/10.1177/03913988211045405",
      "doi": ""
    },
    {
      "text": "Mark Carey, Daniel Laird, Keith A Murray, and John R. Stevenson. 2010. Reliability, validity, and clinical usability of a digital goniometer.Work 36 1(2010), 55–66.",
      "doi": ""
    },
    {
      "text": "Rogério Mendonca De Carvalho, Maria Del Carmen, Janerio Perez, and Fausto Miranda. 2012. Assessment of the Intraobserver and Interobserver Reliability of a Communicating Vessels Volumeter to Measure Wrist-Hand Volume. (2012). https://academic.oup.com/ptj/article/92/10/1329/2735174",
      "doi": ""
    },
    {
      "text": "Anthony J. Comerota. 2011. Intermittent pneumatic compression: Physiologic and clinical basis to improve management of venous leg ulcers. Journal of Vascular Surgery 53, 4 (2011), 1121–1129. https://doi.org/10.1016/j.jvs.2010.08.059",
      "doi": ""
    },
    {
      "text": "Paul Cordo, Steven Wolf, Jau Shin Lou, Ross Bogey, Matthew Stevenson, John Hayes, and Elliot Roth. 2013. Treatment of severe hand impairment following stroke by combining assisted movement, muscle vibration, and biofeedback. Journal of Neurologic Physical Therapy 37, 4 (2013), 194–203. https://doi.org/10.1097/NPT.0000000000000023",
      "doi": ""
    },
    {
      "text": "Lieven De Couvreur and Richard Goossens. 2011. Design for (every)one : co-creation as a bridge between universal design and rehabilitation engineering. CoDesign 7, 2 (June 2011), 107–121. https://doi.org/10.1080/15710882.2011.609890",
      "doi": ""
    },
    {
      "text": "Nyree Dunn, Edgar M. Williams, Gina Dolan, and Jane H. Davies. 2021. Intermittent Pneumatic Compression for the Treatment of Lower Limb Lymphedema: A Pilot Trial of Sequencing to Mimic Manual Lymphatic Drainage Versus Traditional Graduated Sequential Compression. Lymphatic Research and Biology 00, 00 (2021), 1–8. https://doi.org/10.1089/lrb.2021.0025",
      "doi": ""
    },
    {
      "text": "Hend M Elmoughni, Ayse Feyza Yilmaz, Kadir Ozlem, Fidan Khalilbayli, Leonardo Cappello, Asli Tuncay Atalay, Gökhan Ince, and Ozgur Atalay. 2021. Machine-Knitted Seamless Pneumatic Actuators for Soft. Actuators 10, 94 (2021), 1–11.",
      "doi": ""
    },
    {
      "text": "Richard B. Ford and Elisa M. Mazzaferro. 2012. Clinical Signs. In Kirk & Bistner’s Handbook of Veterinary Procedures and Emergency Treatment. Elsevier, 381–441. https://doi.org/10.1016/B978-1-4377-0798-4.00003-7",
      "doi": ""
    },
    {
      "text": "Thuy Anh Giang, Alan Wei Guang Ong, Karthikeyan Krishnamurthy, and Kenneth N.K. Fong. 2016. Rehabilitation Interventions for Poststroke Hand Oedema: A Systematic Review. Hong Kong Journal of Occupational Therapy 27 (2016), 7–17. https://doi.org/10.1016/j.hkjot.2016.03.002",
      "doi": ""
    },
    {
      "text": "David W. Gibson and Harry L. Greene. 2010. Edema. In Decision Making in Medicine (Third Edition) (third edition ed.), Stuart B. Mushlin and Harry L. Greene (Eds.). Mosby, Philadelphia, 18–21. https://doi.org/10.1016/B978-0-323-04107-2.50011-9",
      "doi": ""
    },
    {
      "text": "Judy W Griffin, Laurie S Newsome, Susan W Stralka, and Phillip E Wright. 1990. Reduction of Chronic Posttraumatic Hand Edema: A Comparison of High Voltage Pulsed Current, Intermittent Pneumatic Compression, and Placebo Treatments. Physical Therapy 70, 5 (05 1990), 279–286. https://doi.org/10.1093/ptj/70.5.279 arXiv:https://academic.oup.com/ptj/article-pdf/70/5/279/10759288/ptj0279.pdf",
      "doi": ""
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating squeeze sensations using memory alloys. UIST 2017 - Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology(2017), 109–117. https://doi.org/10.1145/3126594.3126598",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Louise Gustafsson, Alexandra Walter, Kylie Bower, Adrienne Slaughter, and Melanie Hoyle. 2014. Single-case design evaluation of compression therapy for edema of the stroke-affected hand. American Journal of Occupational Therapy 68, 2 (2014), 203–211. https://doi.org/10.5014/ajot.2014.009423",
      "doi": ""
    },
    {
      "text": "Min Woo Han and Sung Hoon Ahn. 2017. Blooming Knit Flowers: Loop-Linked Soft Morphing Structures for Soft Robotics. Advanced Materials 29, 13 (2017), 1–6. https://doi.org/10.1002/adma.201606580",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes. 2006. A primer on multilevel modeling. Human Communication Research 32, 4 (2006), 385–410. https://doi.org/10.1111/j.1468-2958.2006.00281.x",
      "doi": ""
    },
    {
      "text": "Liang He, Cheng Xu, Ding Xu, and Ryan Brill. 2015. Pneuhaptic: Delivering haptic cues with a pneumatic armband. ISWC 2015 - Proceedings of the 2015 ACM International Symposium on Wearable Computers (2015), 47–48. https://doi.org/10.1145/2802083.2802091",
      "doi": "10.1145/2802083.2802091"
    },
    {
      "text": "Megan Hofmann, Julie Burke, Jon Pearlman, Goeran Fiedler, Andrea Hess, Jon Schull, Scott E. Hudson, and Jennifer Mankoff. 2016. Clinical and Maker Perspectives on the Design of Assistive Technology with Rapid Prototyping Technologies. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Reno Nevada USA, 251–256. https://doi.org/10.1145/2982142.2982181",
      "doi": "10.1145/2982142.2982181"
    },
    {
      "text": "Megan Hofmann, Kristin Williams, Toni Kaplan, Stephanie Valencia, Gabriella Hann, Scott E. Hudson, Jennifer Mankoff, and Patrick Carrington. 2019. \"Occupational Therapy is Making\": Clinical Rapid Prototyping and Digital Fabrication. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300544",
      "doi": "10.1145/3290605.3300544"
    },
    {
      "text": "Julie Hörmann, Werner Vach, Marcel Jakob, Saskia Seghers, and Franziska Saxer. 2020. Kinesiotaping for postoperative oedema-What is the evidence? A systematic review. BMC Sports Science, Medicine and Rehabilitation 12, 1(2020), 1–14. https://doi.org/10.1186/s13102-020-00162-3",
      "doi": ""
    },
    {
      "text": "Tuck Voon How. 2014. Co-design of cognitive telerehabilitation technologies. MobileHCI 2014 - Proceedings of the 16th ACM International Conference on Human-Computer Interaction with Mobile Devices and Services (2014), 407–408. https://doi.org/10.1145/2628363.2634269",
      "doi": "10.1145/2628363.2634269"
    },
    {
      "text": "Susan B. Howard and Sheama Krishnagiri. 2001. The use of manual edema mobilization for the reduction of persistent edema in the upper limb. Journal of Hand Therapy 14, 4 (2001), 291–301. https://doi.org/10.1016/S0894-1130(01)80008-9",
      "doi": ""
    },
    {
      "text": "Ozgun Kilic Afsar, Ali Shtarbanov, Hila Mor, Ken Nakagaki, Jack Forman, Karen Modrei, Seung Hee Jeong, Klas Hjort, Kristina Höök, and Hiroshi Ishii. 2021. OmniFiber: Integrated Fluidic Fiber Actuators for Weaving Movement Based Interactions into the ‘Fabric of Everyday Life’. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 1010–1026. https://doi.org/10.1145/3472749.3474802",
      "doi": "10.1145/3472749.3474802"
    },
    {
      "text": "Jin Hee (Heather) Kim, Simone White, Melissa Conroy, and Hsin-liu Cindy Kao. 2021. KnitDermis : Fabricating Tactile On-Body Interfaces Through Machine Knitting. 2021 (2021), 1183–1200.",
      "doi": ""
    },
    {
      "text": "Pin-Sung Ku, Kunpeng Huang, and Cindy Hsin-Liu Kao. 2022. Patch-O: Deformable Woven Patches for On-Body Actuation. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 615, 12 pages. https://doi.org/10.1145/3491102.3517633",
      "doi": "10.1145/3491102.3517633"
    },
    {
      "text": "Steven Baron Lao. [n. d.]. Wearable Tactile Pressure Sensing for Compression Garments and Control of Active Compression Devices. ([n. d.]), 64.",
      "doi": ""
    },
    {
      "text": "Erika S Lewis. 2010. Finger circumference measurements: inter- and intra-rater reliability. Hand Therapy 15, 3 (2010), 69–72. https://doi.org/10.1258/ht.2010.010017 arXiv:https://doi.org/10.1258/ht.2010.010017",
      "doi": ""
    },
    {
      "text": "Yiyue Luo, Kui Wu, Andrew Spielberg, Michael Foshey, Daniela Rus, Tomás Palacios, and Wojciech Matusik. 2022. Digital Fabrication of Pneumatic Actuators with Integrated Sensing by Machine Knitting. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 175, 13 pages. https://doi.org/10.1145/3491102.3517577",
      "doi": "10.1145/3491102.3517577"
    },
    {
      "text": "Amanda Mcleod, Sara Nabil, Lee Jones, and Audrey Girouard. 2020. SMAller Aid : Exploring Shape-Changing Assistive Wearables for People with Mobility Impairment. Proceedings of the annual International Symposium on Wearable Computing (ISWC’20)Figure 1(2020), 86–89. https://doi.org/10.1145/3410530.3414418",
      "doi": "10.1145/3410530.3414418"
    },
    {
      "text": "Leanne K Miller, Christina Jerosch-Herold, and Lee Shepstone. 2017. Clinical assessment of hand oedema: A systematic review. Hand Therapy 22, 4 (Dec. 2017), 153–164. https://doi.org/10.1177/1758998317724405",
      "doi": ""
    },
    {
      "text": "Leanne K. Miller, Christina Jerosch-Herold, and Lee Shepstone. 2017. Effectiveness of edema management techniques for subacute hand edema: A systematic review. Journal of Hand Therapy 30, 4 (2017), 432–446. https://doi.org/10.1016/j.jht.2017.05.011",
      "doi": ""
    },
    {
      "text": "Travis J. Miller. 2021. A Magnetized Brace Designed to Elevate the Extremity after Hand Trauma and Surgery. Plastic and Reconstructive Surgery - Global Open 9, 3 (March 2021), e3460. https://doi.org/10.1097/GOX.0000000000003460",
      "doi": ""
    },
    {
      "text": "Takuro Nakao and Kai Kunze. 2020. FingerFlex : Shape Memory Alloy-based Actuation on Fingers for Kinesthetic Haptic Feedback. (2020), 240–244.",
      "doi": ""
    },
    {
      "text": "Pham Huy Nguyen and Wenlong Zhang. 2020. Design and Computational Modeling of Fabric Soft Pneumatic Actuators for Wearable Assistive Devices. Scientific Reports 10, 1 (2020), 1–13. https://doi.org/10.1038/s41598-020-65003-2",
      "doi": ""
    },
    {
      "text": "Ciarán T. O’Neill, Connor M. McCann, Cameron J. Hohimer, Katia Bertoldi, and Conor J. Walsh. 2022. Unfolding Textile-Based Pneumatic Actuators for Wearable Applications. Soft Robotics 9, 1 (2022), 163–172. https://doi.org/10.1089/soro.2020.0064 arXiv:https://doi.org/10.1089/soro.2020.0064PMID: 33481682.",
      "doi": ""
    },
    {
      "text": "Jungwoo Park, Ji Wang Yoo, Hee Won Seo, and Youngkwan Lee. 2017. Electrically controllable twisted-coiled arti fi cial muscle actuators using surface- modi fi ed polyester fi bers. (2017).",
      "doi": ""
    },
    {
      "text": "Christopher J. Payne, Elizabeth Gallardo Hevia, Nathan Phipps, Asli Atalay, Ozgur Atalay, Bo Ri Seo, David J. Mooney, and Conor J. Walsh. 2018. Force Control of Textile-Based Soft Wearable Robots for Mechanotherapy. In 2018 IEEE International Conference on Robotics and Automation (ICRA). IEEE, Brisbane, QLD, 5459–5465. https://doi.org/10.1109/ICRA.2018.8461059",
      "doi": "10.1109/ICRA.2018.8461059"
    },
    {
      "text": "U. Pilch, M. Wozniewski, and A. Szuba. 2009. Influence of compression cycle time and number of sleeve chambers on upper extremity lymphedema volume reduction during intermittent pneumatic compression. Lymphology 42, 1 (2009), 26–35.",
      "doi": ""
    },
    {
      "text": "Victoria W. Priganc and Max A. Ito. 2008. Changes in Edema, Pain, or Range of Motion Following Manual Edema Mobilization: A Single-case Design Study. Journal of Hand Therapy 21, 4 (Oct. 2008), 326–335. https://doi.org/10.1197/j.jht.2008.04.005",
      "doi": ""
    },
    {
      "text": "R Core Team. 2020. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org/",
      "doi": ""
    },
    {
      "text": "David M. Richmand, Thomas F. O’Donnell, and Avigdor Zelikovski. 1985. Sequential Pneumatic Compression for Lymphedema: A Controlled Trial. Archives of Surgery 120, 10 (1985), 1116–1119. https://doi.org/10.1001/archsurg.1985.01390340014002",
      "doi": ""
    },
    {
      "text": "Ellen T. Roche, Markus A. Horvath, Isaac Wamala, Ali Alazmani, Sang Eun Song, William Whyte, Zurab Machaidze, Christopher J. Payne, James C. Weaver, Gregory Fishbein, Joseph Kuebler, Nikolay V. Vasilyev, David J. Mooney, Frank A. Pigula, and Conor J. Walsh. 2017. Soft robotic sleeve supports heart function. Science Translational Medicine 9, 373 (2017), 1–12. https://doi.org/10.1126/scitranslmed.aaf3925",
      "doi": ""
    },
    {
      "text": "Jose Luis Samper-Escudero, Sofia Coloma, Miguel A. Olivares-Mendez, Miguel Angel Sanchez-Uran, and Manuel Ferre. 2021. Assessment of a textile portable exoskeleton for the upper limbs’ flexion. In 2021 IEEE 2nd International Conference on Human-Machine Systems (ICHMS). IEEE, Magdeburg, Germany, 1–6. https://doi.org/10.1109/ICHMS53169.2021.9582447",
      "doi": ""
    },
    {
      "text": "Karin Slegers, Kristel Kouwenberg, Tereza Loučova, and Ramon Daniels. 2020. Makers in Healthcare: The Role of Occupational Therapists in the Design of DIY Assistive Technology. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–11. https://doi.org/10.1145/3313831.3376685",
      "doi": "10.1145/3313831.3376685"
    },
    {
      "text": "Agostino Stilli, Arianna Cremoni, Matteo Bianchi, Alessandro Ridolfi, Filippo Gerii, Federica Vannetti, Helge A. Wurdemann, Benedetto Allotta, and Kaspar Althoefer. 2018. AirExGlove — A novel pneumatic exoskeleton glove for adaptive hand rehabilitation in post-stroke patients. In 2018 IEEE International Conference on Soft Robotics (RoboSoft). IEEE, Livorno, 579–584. https://doi.org/10.1109/ROBOSOFT.2018.8405388",
      "doi": ""
    },
    {
      "text": "George K. Stylios and Taoyu Wan. 2007. Shape memory training for smart fabrics. Transactions of the Institute of Measurement & Control 29, 3-4(2007), 321–336. https://doi.org/10.1177/0142331207069479",
      "doi": ""
    },
    {
      "text": "Etsel Suarez, Juan J. Huaroto, Alberto A. Reymundo, Donal Holland, Conor Walsh, and Emir Vela. 2018. A Soft Pneumatic Fabric-Polymer Actuator for Wearable Biomedical Devices: Proof of Concept for Lymphedema Treatment. In 2018 IEEE International Conference on Robotics and Automation (ICRA). IEEE, Brisbane, QLD, 5452–5458. https://doi.org/10.1109/ICRA.2018.8460790",
      "doi": "10.1109/ICRA.2018.8460790"
    },
    {
      "text": "Ruojia Sun, Ryosuke Onese, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Conference on Designing Interactive Systems (Eindhoven, The Netherlands) (DIS ’20). ACM.",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Andrzej Szuba, Radha Achalu, and Stanley G. Rockson. 2002. Decongestive lymphatic therapy for patients with breast carcinoma-associated lymphedema: A randomized, prospective study of a role for adjunctive intermittent pneumatic compression. Cancer 95, 11 (2002), 2260–2267. https://doi.org/10.1002/cncr.10976",
      "doi": ""
    },
    {
      "text": "Carly M. Thalman, Joshua Hsu, Laura Snyder, and Panagiotis Polygerinos. 2019. Design of a soft ankle-foot orthosis exosuit for foot drop assistance. In 2019 International Conference on Robotics and Automation, ICRA 2019(Proceedings - IEEE International Conference on Robotics and Automation). Institute of Electrical and Electronics Engineers Inc., 8436–8442. https://doi.org/10.1109/ICRA.2019.8794005 Funding Information: ACKNOWLEDGMENTS C.M. Thalman is funded by the National Science Foundation Graduate Research Fellowships Program. The authors would like to thank Caleb Carlson and Kayleigh Gavin for their contributions. The research is partially supported by the Arizona Department of Health Services - New investigator Award (ADHS18-198863). REFERENCES Publisher Copyright: © 2019 IEEE.; 2019 International Conference on Robotics and Automation, ICRA 2019 ; Conference date: 20-05-2019 Through 24-05-2019.",
      "doi": "10.1109/ICRA.2019.8794005"
    },
    {
      "text": "Cati Vaucelle, Leonardo Bonanni, and Hiroshi Ishii. 2009. Design of Haptic Interfaces for Therapy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 467–470. https://doi.org/10.1145/1518701.1518776",
      "doi": "10.1145/1518701.1518776"
    },
    {
      "text": "Wen Wang, Lining Yao, Chin-yi Cheng, Teng Zhang, Hiroshi Atsumi, Luda Wang, Guanyun Wang, Oksana Anilionyte, Helene Steiner, Jifei Ou, Kang Zhou, Chris Wawrousek, Katherine Petrecca, Angela M Belcher, Rohit Karnik, Xuanhe Zhao, Daniel I C Wang, and Hiroshi Ishii. 2017. Harnessing the hygroscopic and biofluorescent behaviors of genetically tractable microbial cells to design biohybrid wearables. May (2017), 1–9.",
      "doi": ""
    },
    {
      "text": "Bodo Winter. 2013. What These Models Are Doing... and Then We’Ll Spend Most of the Time. (2013), 1–42. arxiv:1308.5499http://arxiv.org/pdf/1308.5499.pdf",
      "doi": ""
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic : Natto Cells as Nano actuators for Shape Changing Interfaces. (2015), 1–10.",
      "doi": ""
    },
    {
      "text": "Hong Kai Yap, Phone May Khin, Tze Hui Koh, Yi Sun, Xinquan Liang, Jeong Hoon Lim, and Chen Hua Yeow. 2017. A Fully Fabric-Based Bidirectional Soft Robotic Glove for Assistance and Rehabilitation of Hand Impaired Patients. IEEE Robotics and Automation Letters 2, 3 (2017), 1383–1390. https://doi.org/10.1109/LRA.2017.2669366",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh, Kenya Mejia, Baris Unver, Xizi Wang, Yuan Yao, Akin Campbell, and Brad Holschuh. 2017. SqueezeBands: Mediated social touch using Shape Memory Alloy actuation. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017). https://doi.org/10.1145/3134751",
      "doi": "10.1145/3134751"
    },
    {
      "text": "Hye Ju Yoo, Woongbae Kim, Sang-Yoep Lee, Joonmyeong Choi, Youn Joo Kim, Da Som Koo, Yunja Nam, and Kyu-Jin Cho. 2019. Wearable Lymphedema Massaging Modules: Proof of Concept using Origami-inspired Soft Fabric Pneumatic Actuators. In 2019 IEEE 16th International Conference on Rehabilitation Robotics (ICORR). IEEE, Toronto, ON, Canada, 950–956. https://doi.org/10.1109/ICORR.2019.8779525",
      "doi": "10.1109/ICORR.2019.8779525"
    },
    {
      "text": "Michelle C. Yuen, R. Adam Bilodeau, and Rebecca K. Kramer. 2016. Active Variable Stiffness Fibers for Multifunctional Robotic Fabrics. IEEE Robotics and Automation Letters 1, 2 (2016), 708–715. https://doi.org/10.1109/LRA.2016.2519609",
      "doi": ""
    },
    {
      "text": "Marzanna Zaleska, Waldemar L. Olszewski, and Marek Durlik. 2014. The effectiveness of intermittent pneumatic compression in long-term therapy of lymphedema of lower limbs. Lymphatic Research and Biology 12, 2 (2014), 103–109. https://doi.org/10.1089/lrb.2013.0033",
      "doi": ""
    },
    {
      "text": "Shumi Zhao, Chongyang Ye, Lingxiao Jing, Zidan Gong, Jianxun Liu, Jinchao Chen, Chi Chiu Chan, and Shuangchen Ruan. 2020. Development of a Soft Pneumatic Actuator System Based on Flexible Force Sensor for Lower Limb Compression Therapy. IEEE Sensors Journal 20, 21 (Nov. 2020), 12765–12775. https://doi.org/10.1109/JSEN.2020.3002227",
      "doi": ""
    },
    {
      "text": "Mengjia Zhu, Amirhossein H. Memar, Aakar Gupta, Majed Samad, Priyanshu Agarwal, Sean Keller, and Nick Colonnese. 2020. PneuSleeve: In-fabric Multimodal Actuation and Sensing in a Soft, Compact, and Expressive Haptic Sleeve. To Appear in Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems - CHI ’20(2020), 1–12. https://doi.org/10.1145/3313831.3376333",
      "doi": "10.1145/3313831.3376333"
    },
    {
      "text": "Yinlong Zhu, Weizhuang Gong, Kaimei Chu, Xu Wang, Zhiqiang Hu, and Haijun Su. 2022. A Novel Wearable Soft Glove for Hand Rehabilitation and Assistive Grasping. Sensors (Basel, Switzerland) 22, 16 (2022). https://doi.org/10.3390/s22166294",
      "doi": ""
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2011. Research through Design: Method for Interaction Design Research in HCI. Chi 2011 (2011), 167–189.",
      "doi": ""
    }
  ]
}