{
  "doi": "10.1145/3544548.3581033",
  "title": "\"It’s like With the Pregnancy Tests\": Co-design of Speculative Technology for Public HIV-related Stigma and its Implications for Social Media",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "Public stigma on the Human Immunodeficiency Virus (HIV) affects the physical and psychological wellbeing of those living with the condition in a severe way. There is work around the design of technology for medication adherence and HIV treatment. Yet, there is still a lack of empirical research that investigates how people could cope with stigma more effectively using technology. Thus, we obtained data from co-design workshops conducted remotely from the U.S. with 25 people living with HIV. Our findings foreground key needs and values via the discussion of features and functionality of speculative co-designed technologies that would allow people to leverage key stigma coping strategies. Based on these insights, we forward design implications for social media, which is the most common type of technology that people living with HIV currently use to cope with public stigma.",
  "authors": [
    {
      "name": "Juan F. Maestre",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659233507",
      "orcid": "0000-0002-5403-9387"
    },
    {
      "name": "Daria V. Groves",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780316",
      "orcid": "0000-0003-2052-4517"
    },
    {
      "name": "Megan Furness",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700948",
      "orcid": "0000-0002-7014-9949"
    },
    {
      "name": "Patrick C. Shih",
      "institution": "missing",
      "img": "/do/10.1145/contrib-81430642614/rel-imgonly/shih-patrick-06-2018.jpg",
      "acmid": "81430642614",
      "orcid": "0000-0003-2460-0468"
    }
  ],
  "references": [
    {
      "text": "Angelo A Alonzo and Nancy R Reynolds. 1995. Stigma, HIV and AIDS: An exploration and elaboration of a stigma trajectory. Social science & medicine 41, 3 (1995), 303–315.",
      "doi": ""
    },
    {
      "text": "Mandy M Archibald, Rachel C Ambagtsheer, Mavourneen G Casey, and Michael Lawless. 2019. Using zoom videoconferencing for qualitative data collection: perceptions and experiences of researchers and participants. International journal of qualitative methods 18 (2019), 1609406919874596.",
      "doi": ""
    },
    {
      "text": "James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity 24, 1 (2013), 11–35.",
      "doi": ""
    },
    {
      "text": "Amy R Baugher, Linda Beer, Jennifer L Fagan, Christine L Mattson, Mark Freedman, Jacek Skarbinski, and R Luke Shouse. 2017. Prevalence of internalized HIV-related stigma among HIV-infected adults in care, United States, 2011–2013. AIDS and Behavior 21, 9 (2017), 2600–2608.",
      "doi": ""
    },
    {
      "text": "Courtney Blackwell, Jeremy Birnholtz, and Charles Abbott. 2015. Seeing and being seen: Co-situation and impression formation using Grindr, a location-aware gay dating app. New media & society 17, 7 (2015), 1117–1136.",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-solutionist strategies: Seriously silly design fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4968–4978.",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Walter O Bockting, Michael H Miner, Rebecca E Swinburne Romine, Autumn Hamilton, and Eli Coleman. 2013. Stigma, mental health, and resilience in an online sample of the US transgender population. American journal of public health 103, 5 (2013), 943–951.",
      "doi": ""
    },
    {
      "text": "Elizabeth Bonsignore, Derek Hansen, Anthony Pellicone, June Ahn, Kari Kraus, Steven Shumway, Kathryn Kaczmarek, Jeff Parkin, Jared Cardon, Jeff Sheets, 2016. Traversing transmedia together: Co-designing an educational alternate reality game for teens, with teens. In Proceedings of the The 15th International Conference on Interaction Design and Children. 11–24.",
      "doi": "10.1145/2930674.2930712"
    },
    {
      "text": "Christopher Boyd. 2021. Zuckerberg’s Metaverse, and the possible privacy and security concerns.https://blog.malwarebytes.com/privacy-2/2021/11/zuckerbergs-metaverse-and-the-possible-privacy-and-security-concerns/. Accessed: 2021-11-3.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Ronald S Burt. 2017. Structural holes versus network closure as social capital. Social capital (2017), 31–56.",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Bakita Kasadha, Simone Stumpf, Abigail C Durrant, Shema Tariq, Jo Gibbs, Karen C Lloyd, and Jon Bird. 2020. Trust, identity, privacy, and security considerations for designing a peer data sharing platform between people living with HIV. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–27.",
      "doi": "10.1145/3415244"
    },
    {
      "text": "CDC. 2018. Centers for Disease Control and Prevention. Statistics Overview: Internalized HIV-related Stigma.https://www.cdc.gov/hiv/pdf/statistics/mmp/cdc-hiv-internalized-stigma.pdf. Accessed: 2018-03-20.",
      "doi": ""
    },
    {
      "text": "CDC. 2018. On the Fast-Track to end AIDS by 2030: Focus on location and population. https://www.unaids.org/sites/default/files/media_asset/WAD2015_report_en_part01.pdf. Accessed: 2018-03-20.",
      "doi": ""
    },
    {
      "text": "Brian T Chan and Alexander C Tsai. 2017. Personal contact with HIV-positive persons is associated with reduced HIV-related stigma: cross-sectional analysis of general population surveys from 26 countries in sub-Saharan Africa. Journal of the International AIDS Society 20, 1 (2017), 21395.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, and Munmun De Choudhury. 2016. \" This Post Will Just Get Taken Down\" Characterizing Removed Pro-Eating Disorder Social Media Content. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1157–1162.",
      "doi": "10.1145/2858036.2858248"
    },
    {
      "text": "Caroline Claisse, Bakita Kasadha, Simone Stumpf, and Abigail C Durrant. 2022. Investigating Daily Practices of Self-care to Inform the Design of Supportive Health Technologies for Living and Ageing Well with HIV. In CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3491102.3501970"
    },
    {
      "text": "Patrick W Corrigan. 2014. The stigma of disease and disability: Understanding causes and overcoming injustices.American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Constantinos K Coursaris and Ming Liu. 2009. An analysis of social support exchanges in online HIV/AIDS self-help groups. Computers in Human Behavior 25, 4 (2009), 911–918.",
      "doi": "10.1016/j.chb.2009.03.006"
    },
    {
      "text": "Carl DiSalvo. 2015. Adversarial design. Mit Press.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Batya Friedman and David G Hendry. 2019. Value sensitive design: Shaping technology with moral imagination. Mit Press.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter Kahn, and Alan Borning. 2002. Value sensitive design: Theory and methods. University of Washington technical report 2 (2002), 12.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2009. Stigma: Notes on the management of spoiled identity. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Daniel Grace, Jody Jollimore, Paul MacPherson, Matthew JP Strang, and Darrell HS Tan. 2018. The pre-exposure prophylaxis-stigma paradox: learning from Canada’s first wave of PrEP users. AIDS patient care and STDs 32, 1 (2018), 24–30.",
      "doi": ""
    },
    {
      "text": "Christina Harrington and Tawanna R Dillahunt. 2021. Eliciting tech futures among Black young adults: A case study of remote speculative co-design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445723"
    },
    {
      "text": "Kiersten Hay, L Kwardem, A Welbourn, A Namiba, S Tariq, Lynne Coventry, R Dhairyawan, and Abigail Durrant. 2020. “Support for the supporters”: a qualitative study of the use of WhatsApp by and for mentor mothers with HIV in the UK. AIDS care 32, sup2 (2020), 127–135.",
      "doi": ""
    },
    {
      "text": "HIV.gov. 2021. HIV U.S. Statistics. https://www.hiv.gov/hiv-basics/overview/data-and-trends/statistics. Accessed: 2021-10-25.",
      "doi": ""
    },
    {
      "text": "Jane Im, Sonali Tandon, Eshwar Chandrasekharan, Taylor Denby, and Eric Gilbert. 2020. Synthesized Social Signals: Computationally-Derived Social Signals from Account Histories. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376383"
    },
    {
      "text": "Robert Jungk and Norbert Müllert. 1987. Future Workshops: How to create desirable futures. Inst. for Social Inventions.",
      "doi": ""
    },
    {
      "text": "Apu Kapadia. 2021. Can Facebook’s smart glasses be smart about security and privacy?https://theconversation.com/can-facebooks-smart-glasses-be-smart-about-security-and-privacy-170002. Accessed: 2021-11-1.",
      "doi": ""
    },
    {
      "text": "K Cassie Kresnye, Juan F Maestre, Ben Jelen, Mona Y Alqassim, Maria K Wolters, and Katie A Siek. 2019. Lessons learned from research via private social media groups. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290607.3299055"
    },
    {
      "text": "Klaus Krippendorff. 2018. Content analysis: An introduction to its methodology. Sage publications.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Azra Ismail, Samyukta Sherugar, and Rajesh Chandwani. 2019. Restoration work: Responding to everyday challenges of HIV outreach. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359156"
    },
    {
      "text": "Karen Levy and Solon Barocas. 2017. Designing against discrimination in online markets. Berkeley Tech. LJ 32(2017), 1183.",
      "doi": ""
    },
    {
      "text": "Calvin A Liang, Katie Albertson, Florence Williams, David Inwards-Breland, Sean A Munson, Julie A Kientz, and Kym Ahrens. 2020. Designing an online sex education resource for gender-diverse youth. In Proceedings of the Interaction Design and Children Conference. 108–120.",
      "doi": "10.1145/3392063.3394404"
    },
    {
      "text": "Leslie S Liu, Jina Huh, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2013. Health vlogger-viewer interaction in chronic illness management. In Proceedings of the SIGCHI conference on Human factors in computing systems. 49–58.",
      "doi": "10.1145/2470654.2470663"
    },
    {
      "text": "Bojana Lobe, David Morgan, and Kim A Hoffman. 2020. Qualitative data collection in an era of social distancing. International journal of qualitative methods 19 (2020), 1609406920937875.",
      "doi": ""
    },
    {
      "text": "Bojana Lobe and David L Morgan. 2021. Assessing the effectiveness of video-based interviewing: A systematic comparison of video-conferencing based dyadic interviews and focus groups. International Journal of Social Research Methodology 24, 3(2021), 301–312.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero. 2015. Using affinity diagrams to evaluate interactive prototypes. In IFIP conference on human-computer interaction. Springer, 231–248.",
      "doi": "10.1007/978-3-319-22668-2_19"
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2017. A guide to using asynchronous remote communities (ARC) for researching distributed populations. EAI Endorsed Transactions on Pervasive Health and Technology 3, 11(2017), e4–e4.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie A Siek, and Kay Connelly. 2016. Asynchronous remote communities (ARC) for researching distributed populations.. In PervasiveHealth. 1–8.",
      "doi": ""
    },
    {
      "text": "Juan F Maestre, K Cassie Kresnye, Julia C Dunbar, Ciabhan L Connelly, Katie A Siek, and Patrick C Shih. 2020. Conducting HCI Research with People Living with HIV Remotely: Lessons Learned and Best Practices. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3375202"
    },
    {
      "text": "Juan F Maestre, Haley MacLeod, Ciabhan L Connelly, Julia C Dunbar, Jordan Beck, Katie A Siek, and Patrick C Shih. 2018. Defining through expansion: conducting asynchronous remote communities (arc) research with stigmatized groups. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174131"
    },
    {
      "text": "Juan F Maestre, Patrycja Zdziarska, Aehong Min, Anna N Baglione, Chia-Fang Chung, and Patrick C Shih. 2021. Not another medication adherence app: Critical reflections on addressing public HIV-related stigma through design. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 1–28.",
      "doi": "10.1145/3434171"
    },
    {
      "text": "Gabriela Marcu, Nadia Dowshen, Shuvadittya Saha, Ressa Reneth Sarreal, and Nazanin Andalibi. 2016. TreatYoSelf: Empathy-driven behavioral intervention for marginalized youth living with HIV. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare. ICST, 69–76.",
      "doi": ""
    },
    {
      "text": "Rebecca J Meisenbach. 2010. Stigma management communication: A theory and agenda for applied research on how individuals manage moments of stigmatized identity. Journal of Applied Communication Research 38, 3 (2010), 268–292.",
      "doi": ""
    },
    {
      "text": "Phoenix KH Mo and Neil S Coulson. 2013. Online support group use and psychological health for individuals living with HIV/AIDS. Patient Education and Counseling 93, 3 (2013), 426–432.",
      "doi": ""
    },
    {
      "text": "Sarah Myers West. 2018. Censored, suspended, shadowbanned: User interpretations of content moderation on social media platforms. New Media & Society 20, 11 (2018), 4366–4383.",
      "doi": ""
    },
    {
      "text": "Larissa Vivian Nägele, Merja Ryöppy, and Danielle Wilde. 2018. PDFi: participatory design fiction with vulnerable users. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction. 819–831.",
      "doi": "10.1145/3240167.3240272"
    },
    {
      "text": "Nastad. 2019. Addressing Stigma: A blueprint for improving HIV/STD prevention and care outcomes for Black and Latino Gay Men.https://www.nastad.org. Accessed: 2019-01-12.",
      "doi": ""
    },
    {
      "text": "Meena Natarajan and Tapan Parikh. 2013. Understanding barriers to information access and disclosure for HIV+ women. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. 143–152.",
      "doi": "10.1145/2516604.2516627"
    },
    {
      "text": "Renee Noortman, Britta F Schulte, Paul Marshall, Saskia Bakker, and Anna L Cox. 2019. HawkEye-Deploying a Design Fiction Probe. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300652"
    },
    {
      "text": "Laura Nyblade, Anne Stangl, Ellen Weiss, and Kim Ashburn. 2009. Combating HIV stigma in health care settings: what works?Journal of the international AIDS Society 12, 1 (2009), 15.",
      "doi": ""
    },
    {
      "text": "Jennifer L Peterson. 2009. “You have to be positive.” Social support processes of an online support group for men living with HIV. Communication Studies 60, 5 (2009), 526–541.",
      "doi": ""
    },
    {
      "text": "Jennifer L Peterson. 2010. The challenges of seeking and receiving support for women living with HIV. Health Communication 25, 5 (2010), 470–479.",
      "doi": ""
    },
    {
      "text": "Annu Sible Prabhakar, Lucia Guerra-Reyes, Vanessa M Kleinschmidt, Ben Jelen, Haley MacLeod, Kay Connelly, and Katie A Siek. 2017. Investigating the suitability of the asynchronous, remote, community-based method for pregnant and new mothers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4924–4934.",
      "doi": "10.1145/3025453.3025546"
    },
    {
      "text": "Stephen A Rains. 2014. The implications of stigma and anonymity for self-disclosure in health blogs. Health communication 29, 1 (2014), 23–31.",
      "doi": ""
    },
    {
      "text": "Patricia M Reeves. 2000. Coping in cyberspace: the impact of Internet use on the ability of HIV-positive individuals to deal with their illness. Journal of Health communication 5, sup1 (2000), 47–59.",
      "doi": ""
    },
    {
      "text": "H Jonathon Rendina, Ali J Talan, Jorge Cienfuegos-Szalay, Joseph A Carter, and Ore Shalhav. 2020. Treatment is more than prevention: perceived personal and social benefits of undetectable= untransmittable messaging among sexual minority men living with HIV. AIDS Patient Care and STDs 34, 10 (2020), 444–451.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2021. The coding manual for qualitative researchers. The coding manual for qualitative researchers (2021), 1–440.",
      "doi": ""
    },
    {
      "text": "Gabrielle M Salib, Juan Fernando Maestre, Kenneth B Nimley, Nadia Dowshen, and Gabriela Marcu. 2018. The Role of Reflection and Context in Medication Adherence Tracking for People Living with HIV. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW042.",
      "doi": ""
    },
    {
      "text": "Karolynn Siegel, Howard Lune, and Ilan H Meyer. 1998. Stigma management among gay/bisexual men with HIV/AIDS. Qualitative Sociology 21, 1 (1998), 3–24.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, Claudia Estcourt, Pam Sonnerberg, and Ann Blandford. 2017. Are HIV smartphone apps and online interventions fit for purpose?. In Proceedings of the 2017 international conference on digital health. ACM, 6–15.",
      "doi": "10.1145/3079452.3079469"
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the elephant in the classroom: Using culturally localized technology to teach around taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2792–2804.",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "Tamara Taggart, Mary Elisabeth Grewe, Donaldson F Conserve, Catherine Gliwa, Malika Roman Isler, 2015. Social media and HIV: a systematic review of uses of social media in HIV communication. Journal of medical Internet research 17, 11 (2015), e4387.",
      "doi": ""
    },
    {
      "text": "Alexandra To, Hillary Carey, Geoff Kaufman, and Jessica Hammer. 2021. Reducing Uncertainty and Offering Comfort: Designing Technology for Coping with Interpersonal Racism. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": "10.1145/3411764.3445590"
    },
    {
      "text": "Ashley Marie Walker and Michael A DeVito. 2020. \"More gay fits in better\": Intracommunity Power Dynamics and Harms in Online LGBTQ+ Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376497"
    },
    {
      "text": "Greg Walsh, Alison Druin, Mona Leigh Guha, Elizabeth Foss, Evan Golub, Leshell Hatley, Elizabeth Bonsignore, and Sonia Franckel. 2010. Layered elaboration: a new technique for co-design with children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1237–1240.",
      "doi": "10.1145/1753326.1753512"
    },
    {
      "text": "Greg Walsh, Elizabeth Foss, Jason Yip, and Allison Druin. 2013. FACIT PD: a framework for analysis and creation of intergenerational techniques for participatory design. In proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2893–2902.",
      "doi": "10.1145/2470654.2481400"
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M Angela Sasse, and Ann Blandford. 2018. Privacy Unraveling Around Explicit HIV Status Disclosure Fields in the Online Geosocial Hookup App Grindr. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Mark Warner, Agnieszka Kitkowska, Jo Gibbs, Juan F Maestre, and Ann Blandford. 2020. Evaluating’Prefer not to say’Around Sensitive Disclosures. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": ""
    },
    {
      "text": "Mark Warner, Juan F Maestre, Jo Gibbs, Chia-Fang Chung, and Ann Blandford. 2019. Signal Appropriation of Explicit HIV Status Disclosure Fields in Sex-Social Apps used by Gay and Bisexual Men. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 692.",
      "doi": "10.1145/3290605.3300922"
    },
    {
      "text": "Stacey L Williams and Kristin D Mickelson. 2008. A paradox of support seeking and rejection among the stigmatized. Personal Relationships 15, 4 (2008), 493–509.",
      "doi": ""
    }
  ]
}