{
  "doi": "10.1145/3544548.3581065",
  "title": "ParaGlassMenu: Towards Social-Friendly Subtle Interactions in Conversations",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2023,
  "badges": [],
  "abstract": "Interactions with digital devices during social settings can reduce social engagement and interrupt conversations. To overcome these drawbacks, we designed ParaGlassMenu, a semi-transparent circular menu that can be displayed around a conversation partner’s face on Optical See-Through Head-Mounted Display (OHMD) and interacted subtly using a ring mouse. We evaluated ParaGlassMenu with several alternative approaches (Smartphone, Voice assistant, and Linear OHMD menus) by manipulating Internet-of-Things (IoT) devices in a simulated conversation setting with a digital partner. Results indicated that the ParaGlassMenu offered the best overall performance in balancing social engagement and digital interaction needs in conversations. To validate these findings, we conducted a second study in a realistic conversation scenario involving commodity IoT devices. Results confirmed the utility and social acceptance of the ParaGlassMenu. Based on the results, we discuss implications for designing attention-maintaining subtle interaction techniques on OHMDs.",
  "authors": [
    {
      "name": "Runze Cai",
      "institution": "NUS-HCI Lab, School of Computing, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783563",
      "orcid": "0000-0003-0974-3751"
    },
    {
      "name": "Nuwan Nanayakkarawasam Peru Kandage Janaka",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658676612",
      "orcid": "0000-0003-2983-6808"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "NUS-HCI Lab, National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    },
    {
      "name": "Minghui Sun",
      "institution": "College of Computer Science and Technology, Jilin University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490643717",
      "orcid": "0000-0002-1809-8187"
    }
  ],
  "references": [
    {
      "text": "Evan Ackerman. 2021. Bosch Gets Smartglasses Right With Tiny Eyeball Lasers. https://spectrum.ieee.org/tech-talk/consumer-electronics/gadgets/bosch-ar-smartglasses-tiny-eyeball-lasers Retrieved February 06, 2021.",
      "doi": ""
    },
    {
      "text": "Naresh Kumar Agarwal and Wenqing Lu. 2020. Response to non-response: How people react when their smartphone messages and calls are ignored. Proceedings of the Association for Information Science and Technology 57, 1 (2020), e260.",
      "doi": ""
    },
    {
      "text": "Fouad Alallah, Ali Neshati, Yumiko Sakamoto, Khalad Hasan, Edward Lank, Andrea Bunt, and Pourang Irani. 2018. Performer vs. observer: whose comfort level should we consider when examining the social acceptability of input modalities for head-worn display?. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology(VRST ’18). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3281505.3281541",
      "doi": "10.1145/3281505.3281541"
    },
    {
      "text": "Amr Alanwar, Moustafa Alzantot, Bo-Jhang Ho, Paul Martin, and Mani Srivastava. 2017. SeleCon: Scalable IoT Device Selection and Control Using Hand Gestures. In Proceedings of the Second International Conference on Internet-of-Things Design and Implementation(Pittsburgh, PA, USA) (IoTDI ’17). Association for Computing Machinery, New York, NY, USA, 47–58. https://doi.org/10.1145/3054977.3054981",
      "doi": "10.1145/3054977.3054981"
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2015. Supporting Subtlety with Deceptive Devices and Illusory Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1489–1498. https://doi.org/10.1145/2702123.2702336",
      "doi": "10.1145/2702123.2702336"
    },
    {
      "text": "Michael Argyle and Mark Cook. 1976. Gaze and mutual gaze.(1976).",
      "doi": ""
    },
    {
      "text": "Michael Argyle and Janet Dean. 1965. Eye-contact, distance and affiliation. Sociometry (1965), 289–304.",
      "doi": ""
    },
    {
      "text": "Daniel Ashbrook, Carlos Tejada, Dhwanit Mehta, Anthony Jiminez, Goudam Muralitharam, Sangeeta Gajendra, and Ross Tallents. 2016. Bitey: An Exploration of Tooth Click Gestures for Hands-Free User Interface Control. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 158–169. https://doi.org/10.1145/2935334.2935389",
      "doi": "10.1145/2935334.2935389"
    },
    {
      "text": "Gilles Bailly, Eric Lecolinet, and Laurence Nigay. 2008. Flower Menus: A New Type of Marking Menu with Large Menu Breadth, within Groups and Efficient Expert Mode Memorization. In Proceedings of the Working Conference on Advanced Visual Interfaces (Napoli, Italy) (AVI ’08). Association for Computing Machinery, New York, NY, USA, 15–22. https://doi.org/10.1145/1385569.1385575",
      "doi": "10.1145/1385569.1385575"
    },
    {
      "text": "Gilles Bailly, Eric Lecolinet, and Laurence Nigay. 2016. Visual Menu Techniques. ACM Comput. Surv. 49, 4, Article 60 (dec 2016), 41 pages. https://doi.org/10.1145/3002171",
      "doi": "10.1145/3002171"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. J. Usability Studies 4, 3 (may 2009), 114–123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Ahmet Börütecene, Idil Bostan, Ekin Akyürek, Alpay Sabuncuoglu, Ilker Temuzkusu, Çaglar Genç, Tilbe Göksun, and Oguzhan Özcan. 2018. Through the Glance Mug: A Familiar Artefact to Support Opportunistic Search in Meetings. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 674–683. https://doi.org/10.1145/3173225.3173236",
      "doi": "10.1145/3173225.3173236"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS - A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 7.",
      "doi": ""
    },
    {
      "text": "Marc Brysbaert. 2019. How many words do we read per minute? A review and meta-analysis of reading rate. Journal of Memory and Language 109 (2019), 104047. https://doi.org/10.1016/j.jml.2019.104047",
      "doi": ""
    },
    {
      "text": "J. Callahan, D. Hopkins, M. Weiser, and B. Shneiderman. 1988. An Empirical Comparison of Pie vs. Linear Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Washington, D.C., USA) (CHI ’88). Association for Computing Machinery, New York, NY, USA, 95–100. https://doi.org/10.1145/57167.57182",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "L Mark Carrier, Larry D Rosen, Nancy A Cheever, and Alex F Lim. 2015. Causes, effects, and practicalities of everyday multitasking. Developmental Review 35(2015), 64–78.",
      "doi": ""
    },
    {
      "text": "Isha Chaturvedi, Farshid Hassani Bijarbooneh, Tristan Braud, and Pan Hui. 2019. Peripheral vision: a new killer app for smart glasses. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 625–636. https://doi.org/10.1145/3301275.3302263",
      "doi": "10.1145/3301275.3302263"
    },
    {
      "text": "Varoth Chotpitayasunondh and Karen M. Douglas. 2018. The effects of “phubbing” on social interaction. Journal of Applied Social Psychology 48, 6 (2018), 304–316. https://doi.org/10.1111/jasp.12506 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/jasp.12506.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, and Rebecca Allen. 2005. Toward Subtle Intimate Interfaces for Mobile Devices Using an EMG Controller. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Portland, Oregon, USA) (CHI ’05). Association for Computing Machinery, New York, NY, USA, 481–489. https://doi.org/10.1145/1054972.1055039",
      "doi": "10.1145/1054972.1055039"
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, Elan Pavlov, Rebecca Allen, and Pattie Maes. 2006. Eye-q: Eyeglass Peripheral Display for Subtle Intimate Notifications. In Proceedings of the 8th Conference on Human-Computer Interaction with Mobile Devices and Services(Helsinki, Finland) (MobileHCI ’06). Association for Computing Machinery, New York, NY, USA, 211–218. https://doi.org/10.1145/1152215.1152261",
      "doi": "10.1145/1152215.1152261"
    },
    {
      "text": "Saverio Debernardis, Michele Fiorentino, Michele Gattullo, Giuseppe Monno, and Antonio Emmanuele Uva. 2014. Text Readability in Head-Worn Displays: Color and Style Optimization in Video versus Optical See-Through Devices. IEEE Transactions on Visualization and Computer Graphics 20, 1 (Jan. 2014), 125–139. https://doi.org/10.1109/TVCG.2013.86",
      "doi": "10.1109/TVCG.2013.86"
    },
    {
      "text": "Rajib Dey, Sayma Sultana, Afsaneh Razi, and Pamela J. Wisniewski. 2020. Exploring Smart Home Device Use by Airbnb Hosts. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382900",
      "doi": "10.1145/3334480.3382900"
    },
    {
      "text": "Sarah Diefenbach and Daniel Ullrich. 2019. Disrespectful Technologies: Social Norm Conflicts in Digital Worlds. In Advances in Usability, User Experience and Assistive Technology, Tareq Z. Ahram and Christianne Falcão (Eds.). Springer International Publishing, Cham, 44–56.",
      "doi": ""
    },
    {
      "text": "Jérémie Francone, Gilles Bailly, Eric Lecolinet, Nadine Mandran, and Laurence Nigay. 2010. Wavelet Menus on Handheld Devices: Stacking Metaphor for Novice Mode and Eyes-Free Selection for Expert Mode. In Proceedings of the International Conference on Advanced Visual Interfaces (Roma, Italy) (AVI ’10). Association for Computing Machinery, New York, NY, USA, 173–180. https://doi.org/10.1145/1842993.1843025",
      "doi": "10.1145/1842993.1843025"
    },
    {
      "text": "Koumei Fukahori, Daisuke Sakamoto, and Takeo Igarashi. 2015. Exploring Subtle Foot Plantar-Based Gestures with Sock-Placed Pressure Sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3019–3028. https://doi.org/10.1145/2702123.2702308",
      "doi": "10.1145/2702123.2702308"
    },
    {
      "text": "Google. 2022. Google home - apps on Google Play. https://play.google.com/store/apps/details?id=com.google.android.apps.chromecast.app",
      "doi": ""
    },
    {
      "text": "Google. 2022. Smart Home Device Traits | Actions on Google Smart Home. https://developers.google.com/assistant/smarthome/traits",
      "doi": ""
    },
    {
      "text": "Hall and Edward Twitchell. 1966. The hidden dimension. Vol. 609. Anchor.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9(2006), 904–908. https://doi.org/10.1177/154193120605000909",
      "doi": ""
    },
    {
      "text": "Roy S. Hessels. 2020. How does gaze to faces support face-to-face interaction? A review and perspective. Psychonomic Bulletin & Review 27, 5 (Oct. 2020), 856–881. https://doi.org/10.3758/s13423-020-01715-w",
      "doi": ""
    },
    {
      "text": "Yi-Ta Hsieh, Antti Jylhä, Valeria Orso, Luciano Gamberini, and Giulio Jacucci. 2016. Designing a Willing-to-Use-in-Public Hand Gestural Interaction Technique for Smart Glasses. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4203–4215. https://doi.org/10.1145/2858036.2858436",
      "doi": "10.1145/2858036.2858436"
    },
    {
      "text": "Shamsi T. Iqbal, Jonathan Grudin, and Eric Horvitz. 2011. Peripheral computing during presentations: perspectives on costs and preferences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 891–894. https://doi.org/10.1145/1978942.1979073",
      "doi": "10.1145/1978942.1979073"
    },
    {
      "text": "Yuta Itoh, Tobias Langlotz, Jonathan Sutton, and Alexander Plopski. 2021. Towards Indistinguishable Augmented Reality: A Survey on Optical See-through Head-mounted Displays. Comput. Surveys 54, 6 (July 2021), 120:1–120:36. https://doi.org/10.1145/3453157",
      "doi": "10.1145/3453157"
    },
    {
      "text": "Timo Jakobi, Corinna Ogonowski, Nico Castelli, Gunnar Stevens, and Volker Wulf. 2017. The Catch(Es) with Smart Home: Experiences of a Living Lab Field Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1620–1633. https://doi.org/10.1145/3025453.3025799",
      "doi": "10.1145/3025453.3025799"
    },
    {
      "text": "Nuwan Janaka, Chloe Haigh, Hyeongcheol Kim, Shan Zhang, and Shengdong Zhao. 2022. Paracentral and near-peripheral visualizations: Towards attention-maintaining secondary information presentation on OHMDs during in-person social interactions. (2022), 14. https://doi.org/10.1145/3491102.3502127",
      "doi": "10.1145/3491102.3502127"
    },
    {
      "text": "Rikke Hagensby Jensen, Yolande Strengers, Jesper Kjeldskov, Larissa Nicholls, and Mikael B. Skov. 2018. Designing the Desirable Smart Home: A Study of Household Experiences and Energy Consumption Impacts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173578",
      "doi": "10.1145/3173574.3173578"
    },
    {
      "text": "Steven J. Kerr, Mark D. Rice, Yinquan Teo, Marcus Wan, Yian Ling Cheong, Jamie Ng, Lillian Ng-Thamrin, Thant Thura-Myo, and Dominic Wren. 2011. Wearable Mobile Augmented Reality: Evaluating Outdoor User Experience. In Proceedings of the 10th International Conference on Virtual Reality Continuum and Its Applications in Industry (Hong Kong, China) (VRCAI ’11). Association for Computing Machinery, New York, NY, USA, 209-216. https://doi.org/10.1145/2087756.2087786",
      "doi": "10.1145/2087756.2087786"
    },
    {
      "text": "Paul A. Kirschner and Aryn C. Karpinski. 2010. Facebook® and academic performance. Computers in Human Behavior 26, 6 (2010), 1237–1245. https://doi.org/10.1016/j.chb.2010.03.024",
      "doi": "10.1016/j.chb.2010.03.024"
    },
    {
      "text": "Marion Koelle, Swamy Ananthanarayan, and Susanne Boll. 2020. Social Acceptability in HCI: A Survey of Methods, Measures, and Design Strategies. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–19. https://doi.org/10.1145/3313831.3376162",
      "doi": "10.1145/3313831.3376162"
    },
    {
      "text": "Marion Koelle, Matthias Kranz, and Andreas Möller. 2015. Don’t look at me that way!: Understanding User Attitudes Towards Data Glasses Usage. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, Copenhagen Denmark, 362–372. https://doi.org/10.1145/2785830.2785842",
      "doi": "10.1145/2785830.2785842"
    },
    {
      "text": "Quan Kong, Takuya Maekawa, Taiki Miyanishi, and Takayuki Suyama. 2016. Selecting Home Appliances with Smart Glass Based on Contextual Information. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing(Heidelberg, Germany) (UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 97–108. https://doi.org/10.1145/2971648.2971651",
      "doi": "10.1145/2971648.2971651"
    },
    {
      "text": "Nallapaneni Manoj Kumar, Neeraj Kumar Singh, and V. K. Peddiny. 2018. Wearable Smart Glass: Features, Applications, Current Progress and Challenges. In 2018 Second International Conference on Green Computing and Internet of Things (ICGCIoT). 577–582. https://doi.org/10.1109/ICGCIoT.2018.8753047",
      "doi": ""
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. 1993. The Limits of Expert Performance Using Hierarchic Marking Menus. In Proceedings of the INTERACT ’93 and CHI ’93 Conference on Human Factors in Computing Systems (Amsterdam, The Netherlands) (CHI ’93). Association for Computing Machinery, New York, NY, USA, 482–487. https://doi.org/10.1145/169059.169426",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Recommended Light Levels. 2020. Recommended light levels (illuminance) for outdoor and indoor venues. The Engineering Toolbox. Recommended Light Levels (2020).",
      "doi": ""
    },
    {
      "text": "Richard Li, Jason Wu, and Thad Starner. 2019. TongueBoard: An Oral Interface for Subtle Input. In Proceedings of the 10th Augmented Human International Conference 2019 (Reims, France) (AH2019). Association for Computing Machinery, New York, NY, USA, Article 1, 9 pages. https://doi.org/10.1145/3311823.3311831",
      "doi": "10.1145/3311823.3311831"
    },
    {
      "text": "Ziyang Li and Pei-Luen Patrick Rau. 2021. Talking with an IoT-CA: Effects of the Use of Internet of Things Conversational Agents on Face-to-Face Conversations. Interacting with Computers 33, 3 (10 2021), 238–249. https://doi.org/10.1093/iwc/iwab024 arXiv:https://academic.oup.com/iwc/article-pdf/33/3/238/41062328/iwab024.pdf",
      "doi": ""
    },
    {
      "text": "Irene Lopatovska, Katrina Rink, Ian Knight, Kieran Raines, Kevin Cosenza, Harriet Williams, Perachya Sorsche, David Hirsch, Qi Li, and Adrianna Martinez. 2019. Talk to me: Exploring user interactions with the Amazon Alexa. Journal of Librarianship and Information Science 51, 4 (2019), 984–997. https://doi.org/10.1177/0961000618759414",
      "doi": ""
    },
    {
      "text": "Feiyu Lu, Shakiba Davari, Lee Lisle, Yuan Li, and Doug A. Bowman. 2020. Glanceable AR: Evaluating Information Access Methods for Head-Worn Augmented Reality. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 930–939. https://doi.org/10.1109/VR46266.2020.00113",
      "doi": ""
    },
    {
      "text": "Michal Luria, Guy Hoffman, and Oren Zuckerman. 2017. Comparing social robot, screen and voice interfaces for smart-home control. In Proceedings of the 2017 CHI conference on human factors in computing systems. 580–628. https://doi.org/10.1145/3025453.3025786",
      "doi": "10.1145/3025453.3025786"
    },
    {
      "text": "William G. Lycan. 1977. Conversation, politeness, and interruption. Paper in Linguistics 10, 1-2 (1977), 23–53. https://doi.org/10.1080/08351819709370438",
      "doi": ""
    },
    {
      "text": "Kent Lyons. 2003. Everyday Wearable Computer Use: A Case Study of an Expert User. In Human-Computer Interaction with Mobile Devices and Services(Lecture Notes in Computer Science), Luca Chittaro (Ed.). Springer, Berlin, Heidelberg, 61–75. https://doi.org/10.1007/978-3-540-45233-1_6",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie. 2013. Human-computer interaction: an empirical research perspective (first edition ed.). Morgan Kaufmann is an imprint of Elsevier, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Ville Mäkelä, Johannes Kleine, Maxine Hood, Florian Alt, and Albrecht Schmidt. 2021. Hidden Interaction Techniques: Concealed Information Acquisition and Texting on Smartphones and Wearables. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 248, 14 pages. https://doi.org/10.1145/3411764.3445504",
      "doi": "10.1145/3411764.3445504"
    },
    {
      "text": "Adam M. Mastroianni, Daniel T. Gilbert, Gus Cooney, and Timothy D. Wilson. 2021. Do conversations end when people want them to?Proceedings of the National Academy of Sciences of the United States of America 118, 10 (March 2021), e2011809118. https://doi.org/10.1073/pnas.2011809118",
      "doi": ""
    },
    {
      "text": "Sven Mayer, Lars Lischke, Paweł W. Woźniak, and Niels Henze. 2018. Evaluating the Disruptiveness of Mobile Interactions: A Mixed-Method Approach. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–14. https://doi.org/10.1145/3173574.3173980",
      "doi": "10.1145/3173574.3173980"
    },
    {
      "text": "Gerard McAtamney and Caroline Parker. [n. d.]. An examination of the effects of a wearable display on informal face-to-face communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2006-04-22) (CHI ’06). Association for Computing Machinery, 45–54. https://doi.org/10.1145/1124772.1124780",
      "doi": "10.1145/1124772.1124780"
    },
    {
      "text": "Tien T. Nguyen, Duyen T. Nguyen, Shamsi T. Iqbal, and Eyal Ofek. 2015. The Known Stranger: Supporting Conversations between Strangers with Personalized Topic Suggestions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 555–564. https://doi.org/10.1145/2702123.2702411",
      "doi": "10.1145/2702123.2702411"
    },
    {
      "text": "Donald A. Norman. 2013. The design of everyday things(revised and expanded edition ed.). Basic Books.",
      "doi": ""
    },
    {
      "text": "Eyal Ofek, Shamsi T. Iqbal, and Karin Strauss. [n. d.]. Reducing disruption from subtle information delivery during a conversation: mode and bandwidth investigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2013-04-27) (CHI ’13). Association for Computing Machinery, 3111–3120. https://doi.org/10.1145/2470654.2466425",
      "doi": "10.1145/2470654.2466425"
    },
    {
      "text": "Julius Panero and Martin Zelnik. 1979. Human dimension & interior space: a source book of design reference standards. Watson-Guptill.",
      "doi": ""
    },
    {
      "text": "Harold Pashler. 1994. Dual-task interference in simple tasks: data and theory.Psychological bulletin 116, 2 (1994), 220.",
      "doi": ""
    },
    {
      "text": "Simon T. Perrault, Eric Lecolinet, Yoann Pascal Bourse, Shengdong Zhao, and Yves Guiard. 2015. Physical Loci: Leveraging Spatial, Object and Semantic Memory for Command Selection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 299–308. https://doi.org/10.1145/2702123.2702126",
      "doi": "10.1145/2702123.2702126"
    },
    {
      "text": "Henning Pohl, Andreea Muresan, and Kasper Hornbæk. 2019. Charting Subtle Interaction in the HCI Literature. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300648",
      "doi": "10.1145/3290605.3300648"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Aung Pyae and Tapani N. Joelsson. 2018. Investigating the Usability and User Experiences of Voice User Interface: A Case of Google Home Smart Speaker. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, 127–131. https://doi.org/10.1145/3236112.3236130",
      "doi": "10.1145/3236112.3236130"
    },
    {
      "text": "Mikko J. Rissanen, Samantha Vu, Owen Noel Newton Fernando, Natalie Pang, and Schubert Foo. 2013. Subtle, Natural and Socially Acceptable Interaction Techniques for Ringterfaces — Finger-Ring Shaped User Interfaces. In Distributed, Ambient, and Pervasive Interactions, Norbert Streitz and Constantine Stephanidis (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 52–61.",
      "doi": "10.1007/978-3-642-39351-8_6"
    },
    {
      "text": "Radiah Rivu, Yasmeen Abdrabou, Ken Pfeuffer, Augusto Esteves, Stefanie Meitner, and Florian Alt. 2020. StARe: Gaze-Assisted Face-to-Face Communication in Augmented Reality. In Symposium on Eye Tracking Research and Applications. ACM, Stuttgart Germany, 1–5. https://doi.org/10.1145/3379157.3388930 ZSCC: 0000013.",
      "doi": "10.1145/3379157.3388930"
    },
    {
      "text": "Rufat Rzayev, Susanne Korbely, Milena Maul, Alina Schark, Valentin Schwind, and Niels Henze. 2020. Effects of Position and Alignment of Notifications on AR Glasses during Social Interaction. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3419249.3420095",
      "doi": "10.1145/3419249.3420095"
    },
    {
      "text": "Krystian Samp and Stefan Decker. 2010. Supporting Menu Design with Radial Layouts. In Proceedings of the International Conference on Advanced Visual Interfaces (Roma, Italy) (AVI ’10). Association for Computing Machinery, New York, NY, USA, 155–162. https://doi.org/10.1145/1842993.1843021",
      "doi": "10.1145/1842993.1843021"
    },
    {
      "text": "Shardul Sapkota, Ashwin Ram, and Shengdong Zhao. 2021. Ubiquitous Interactions for Heads-Up Computing: Understanding Users’ Preferences for Subtle Interaction Techniques in Everyday Settings. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction(MobileHCI ’21). Association for Computing Machinery, New York, NY, USA, Article 36, 15 pages. https://doi.org/10.1145/3447526.3472035",
      "doi": "10.1145/3447526.3472035"
    },
    {
      "text": "B. Schilit, N. Adams, and R. Want. 1994. Context-Aware Computing Applications. In 1994 First Workshop on Mobile Computing Systems and Applications. 85–90. https://doi.org/10.1109/WMCSA.1994.16",
      "doi": "10.1109/WMCSA.1994.16"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What’s Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 857–868. https://doi.org/10.1145/3196709.3196772",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Ludwig Sidenmark, Dominic Potts, Bill Bapisch, and Hans Gellersen. 2021. Radi-Eye: Hands-Free Radial Interfaces for 3D Interaction Using Gaze-Activated Head-Crossing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 740, 11 pages. https://doi.org/10.1145/3411764.3445697",
      "doi": "10.1145/3411764.3445697"
    },
    {
      "text": "Norman Makoto Su and Lulu Wang. 2015. From Third to Surveilled Place: The Mobile in Irish Pubs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1659–1668. https://doi.org/10.1145/2702123.2702574",
      "doi": "10.1145/2702123.2702574"
    },
    {
      "text": "Charles Tijus, Javier Barcenilla, Brigitte Cambon de Lavalette, and Jean-Guy Meunier. 2007. The Design, Understanding and Usage of Pictograms. Written Documents in the Workplace (Jan. 2007), 17–31. https://doi.org/10.1163/9789004253254_003",
      "doi": ""
    },
    {
      "text": "Ying-Chao Tung, Chun-Yen Hsu, Han-Yu Wang, Silvia Chyou, Jhe-Wei Lin, Pei-Jung Wu, Andries Valstar, and Mike Y. Chen. 2015. User-Defined Game Input for Smart Glasses in Public Space. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, Seoul, Republic of Korea. https://doi.org/10.1145/2702123.2702214",
      "doi": "10.1145/2702123.2702214"
    },
    {
      "text": "Mariek M.P. Vanden Abeele, Marjolijn L. Antheunis, and Alexander P. Schouten. 2016. The effect of mobile messaging during a conversation on impression formation and interaction quality. Computers in Human Behavior 62 (2016), 562–569. https://doi.org/10.1016/j.chb.2016.04.005",
      "doi": "10.1016/j.chb.2016.04.005"
    },
    {
      "text": "Radu-Daniel Vatavu and Jean Vanderdonckt. 2020. Design Space and Users’ Preferences for Smartglasses Graphical Menus: A Vignette Study. In 19th International Conference on Mobile and Ubiquitous Multimedia (Essen, Germany) (MUM 2020). Association for Computing Machinery, New York, NY, USA, 1–12. https://dl.acm.org/doi/10.1145/3428361.3428467",
      "doi": ""
    },
    {
      "text": "Martin Weigel and Jürgen Steimle. 2017. DeformWear: Deformation Input on Tiny Wearable Devices. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2 (June 2017), 28:1–28:23. https://doi.org/10.1145/3090093",
      "doi": "10.1145/3090093"
    },
    {
      "text": "Kristin Williams, Karyn Moffatt, Denise McCall, and Leah Findlater. 2015. Designing Conversation Cues on a Head-Worn Display to Support Persons with Aphasia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 231–240. https://doi.org/10.1145/2702123.2702484",
      "doi": "10.1145/2702123.2702484"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Shengdong Zhao, Pierre Dragicevic, Mark Chignell, Ravin Balakrishnan, and Patrick Baudisch. 2007. Earpod: Eyes-Free Menu Selection Using Touch Input and Reactive Audio Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 1395–1404. https://doi.org/10.1145/1240624.1240836",
      "doi": "10.1145/1240624.1240836"
    }
  ]
}