{
  "doi": "10.1145/3544548.3580756",
  "title": "Challenges and Opportunities for Interactive Technology to Support Parents of HIV-Positive Children in Ethiopia in the Disclosure Process",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Fearing stigma, parents often hide their children's HIV diagnosis from them, and postpone disclosure, in turn negatively impacting children's well-being. Our work explores whether interactive technology can support disclosure. In the first study, we examine disclosure experiences and the role of interactive technology from the perspective of HIV-positive children and parents. Through Thematic Analysis, we highlight how disclosure is linked with parents’ own experience of HIV, and that disclosure needs to be viewed as a process. On this basis, we contribute an experience prototype that guides parents through an incremental disclosure process using interactive storytelling. In a second study, we evaluate the prototype through interviews with six parents. Leveraging Interpretative Phenomenological Analysis, we show that the prototype has potential to transform how parents understand and approach disclosure. Based on our results, we present further design directions, and discuss the (limitations of the) role that technology can play in this context.",
  "authors": [
    {
      "name": "Alemitu Bezabih",
      "institution": "Department of Computer Science, e-Media Research Lab, KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778252",
      "orcid": "0000-0001-9603-8537"
    },
    {
      "name": "Kathrin Gerling",
      "institution": "Karlsruhe Institute of Technology, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "Workeabeba Abebe",
      "institution": "Pediatrics and Child Health Department, College of Health Sciences, Addis Ababa University, Ethiopia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660237544",
      "orcid": "0000-0003-3224-1899"
    },
    {
      "name": "Vero Vanden Abeele",
      "institution": "Department of Computer Science, e-Media Research Lab, KU Leuven, Belgium",
      "img": "/do/10.1145/contrib-81416596596/rel-imgonly/polaroid_vero_v4.png",
      "acmid": "81416596596",
      "orcid": "0000-0002-3031-9579"
    }
  ],
  "references": [
    {
      "text": "Christie Anne Abel and Thomas D Grace. 2020. Designing dyadic caregiver-child personas for interactive digital media use. In Proceedings of the Interaction Design and Children Conference (IDC ’20), Association for Computing Machinery, New York, NY, USA, 198–204. DOI:https://doi.org/10.1145/3392063.3394391",
      "doi": "10.1145/3392063.3394391"
    },
    {
      "text": "Oluyemisi Aderomilehin, Angella Hanciles-Amu, and Oluwatobi Ohiole Ozoya. 2016. Perspectives and Practice of HIV Disclosure to Children and Adolescents by Health-Care Providers and Caregivers in sub-Saharan Africa: A Systematic Review. Front Public Health 4, (2016), 166. DOI:https://doi.org/10.3389/fpubh.2016.00166",
      "doi": ""
    },
    {
      "text": "Margaret Amankwah-Poku, Delight Abla Klutsey, and Kwaku Oppong Asante. 2021. Disclosure and health-related outcomes among children living with HIV and their caregivers. AIDS Research and Therapy 18, 1 (April 2021), 13. DOI:https://doi.org/10.1186/s12981-021-00337-z",
      "doi": ""
    },
    {
      "text": "N. Ammon, S. Mason, and J. M. Corkery. 2018. Factors impacting antiretroviral therapy adherence among human immunodeficiency virus–positive adolescents in Sub-Saharan Africa: a systematic review. Public Health 157, (April 2018), 20–31. DOI:https://doi.org/10.1016/j.puhe.2017.12.010",
      "doi": ""
    },
    {
      "text": "Ashish Amresh, Madhumita Sinha, Rebecca Birr, and Rahul Salla. 2015. Interactive Cause and Effect Comic-book Storytelling for Improving Nutrition Outcomes in Children. In Proceedings of the 5th International Conference on Digital Health 2015 (DH ’15), Association for Computing Machinery, New York, NY, USA, 9–14. DOI:https://doi.org/10.1145/2750511.2750533",
      "doi": "10.1145/2750511.2750533"
    },
    {
      "text": "Nazanin Andalibi. 2020. Disclosure, Privacy, and Stigma on Social Media: Examining Non-Disclosure of Distressing Experiences. ACM Trans. Comput.-Hum. Interact. 27, 3 (May 2020), 18:1-18:43. DOI:https://doi.org/10.1145/3386600",
      "doi": "10.1145/3386600"
    },
    {
      "text": "Nazanin Andalibi, Margaret E. Morris, and Andrea Forte. 2018. Testing Waters, Sending Clues: Indirect Disclosures of Socially Stigmatized Experiences on Social Media. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 19:1-19:23. DOI:https://doi.org/10.1145/3274288",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17), Association for Computing Machinery, Portland, Oregon, USA, 1485–1500. DOI:https://doi.org/10.1145/2998181.2998243",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Alissa N. Antle. 2008. Child-based personas: need, ability and experience. Cogn Tech Work 10, 2 (April 2008), 155–166. DOI:https://doi.org/10.1007/s10111-007-0071-2",
      "doi": "10.1007/s10111-007-0071-2"
    },
    {
      "text": "Alissa Nicole Antle. 2006. Child-personas: fact or fiction? In Proceedings of the 6th conference on Designing Interactive systems (DIS ’06), Association for Computing Machinery, New York, NY, USA, 22–30. DOI:https://doi.org/10.1145/1142405.1142411",
      "doi": "10.1145/1142405.1142411"
    },
    {
      "text": "S. Ashaba, C. Cooper-Vince, S. Maling, G. Z. Rukundo, D. Akena, and A. C. Tsai. 2018. Internalized HIV stigma, bullying, major depressive disorder, and high-risk suicidality among HIV-positive adolescents in rural Uganda. Global Mental Health 5, (ed 2018). DOI:https://doi.org/10.1017/gmh.2018.15",
      "doi": ""
    },
    {
      "text": "Renée Baillargeon. 1993. The object concept revisited: New direction in the investigation of infants’ physical knowledge. In Visual perception and cognition in infancy. Lawrence Erlbaum Associates, Inc, Hillsdale, NJ, US, 265–315.",
      "doi": ""
    },
    {
      "text": "Kevin Louis Bardosh, Melanie Murray, Antony M. Khaemba, Kirsten Smillie, and Richard Lester. 2017. Operationalizing mHealth to improve patient care: a qualitative implementation science evaluation of the WelTel texting intervention in Canada and Kenya. Globalization and Health 13, 1 (December 2017), 87. DOI:https://doi.org/10.1186/s12992-017-0311-z",
      "doi": ""
    },
    {
      "text": "Pierre Barrouillet. 2015. Theories of cognitive development: From Piaget to today. Developmental Review 38, (December 2015), 1–12. DOI:https://doi.org/10.1016/j.dr.2015.07.004",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), Association for Computing Machinery, New York, NY, USA, 585–594. DOI:https://doi.org/10.1145/2702123.2702234",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Alemitu Mequanint Bezabih, Kathrin Gerling, Workeabeba Abebe, and Vero Vanden Abeele. 2021. Behavioral Theories and Motivational Features Underlying eHealth Interventions for Adolescent Antiretroviral Adherence: Systematic Review. JMIR mHealth and uHealth 9, 12 (December 2021), e25129. DOI:https://doi.org/10.2196/25129",
      "doi": ""
    },
    {
      "text": "Roger Bibace and Mary E. Walsh. 1980. Development of Children's Concepts of Illness. Pediatrics 66, 6 (December 1980), 912–917.",
      "doi": ""
    },
    {
      "text": "C. Blake Helms, Janet M. Turan, Ghislaine Atkins, Mirjam-Colette Kempf, Olivio J. Clay, James L. Raper, Michael J. Mugavero, and Bulent Turan. 2017. Interpersonal Mechanisms Contributing to the Association Between HIV-Related Internalized Stigma and Medication Adherence. AIDS Behav 21, 1 (January 2017), 238–247. DOI:https://doi.org/10.1007/s10461-016-1320-2",
      "doi": ""
    },
    {
      "text": "Arjan E.R. Bos, Herman P. Schaalma, and John B. Pryor. 2008. Reducing AIDS-related stigma in developing countries: The importance of theory- and evidence-based interventions. Psychology, Health & Medicine 13, 4 (August 2008), 450–460. DOI:https://doi.org/10.1080/13548500701687171",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (January 2006), 77–101. DOI:https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Christina Brezing, Maria Ferrara, and Oliver Freudenreich. 2015. The Syndemic Illness of HIV and Trauma: Implications for a Trauma-Informed Model of Care. Psychosomatics 56, 2 (March 2015), 107–118. DOI:https://doi.org/10.1016/j.psym.2014.10.006",
      "doi": ""
    },
    {
      "text": "Regina Edward Bulali, Stephen Matthew Kibusi, and Bonaventura C. T. Mpondo. 2018. Factors Associated with HIV Status Disclosure and Its Effect on Treatment Adherence and Quality of Life among Children 6-17 Years on Antiretroviral Therapy in Southern Highlands Zone, Tanzania: Unmatched Case Control Study. Int J Pediatr 2018, (2018), 8058291. DOI:https://doi.org/10.1155/2018/8058291",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Bakita Kasadha, Simone Stumpf, Abigail C. Durrant, Shema Tariq, Jo Gibbs, Karen C. Lloyd, and Jon Bird. 2020. Trust, Identity, Privacy, and Security Considerations for Designing a Peer Data Sharing Platform Between People Living With HIV. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (October 2020), 173:1-173:27. DOI:https://doi.org/10.1145/3415244",
      "doi": "10.1145/3415244"
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and George Buchanan. 2016. It Feels Like I'm Managing Myself: HIV+ People Tracking Their Personal Health Information. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI ’16), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/2971485.2971542",
      "doi": "10.1145/2971485.2971542"
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and Stephanie Wilson. 2017. The use of online forums by people living with HIV for help in understanding personal health information. International Journal of Medical Informatics 108, (December 2017), 64–70. DOI:https://doi.org/10.1016/j.ijmedinf.2017.10.001",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and Stephanie Wilson. 2019. Designing for Reflection on Shared HIV Health Information. In Proceedings of the 13th Biannual Conference of the Italian SIGCHI Chapter: Designing the next Interaction (CHItaly ’19), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3351995.3352036",
      "doi": "10.1145/3351995.3352036"
    },
    {
      "text": "Susan Carey. 1985. Conceptual change in childhood / Susan Carey. MIT Press, Cambridge, Mass. ;",
      "doi": ""
    },
    {
      "text": "Vanessa Cesário, Paulo Freitas, Diana Pimentel, and Valentina Nisi. 2016. Children's Books: Paper VS Digital, What Do They Prefer? In Proceedings of the The 15th International Conference on Interaction Design and Children (IDC ’16), Association for Computing Machinery, New York, NY, USA, 625–630. DOI:https://doi.org/10.1145/2930674.2936004",
      "doi": "10.1145/2930674.2936004"
    },
    {
      "text": "Angela Chang and Cynthia Breazeal. 2011. TinkRBook: shared reading interfaces for storytelling. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC ’11), Association for Computing Machinery, New York, NY, USA, 145–148. DOI:https://doi.org/10.1145/1999030.1999047",
      "doi": "10.1145/1999030.1999047"
    },
    {
      "text": "Janet X. Chen, Allison McDonald, Yixin Zou, Emily Tseng, Kevin A Roundy, Acar Tamersoy, Florian Schaub, Thomas Ristenpart, and Nicola Dell. 2022. Trauma-Informed Computing: Towards Safer Technology Experiences for All. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–20. DOI:https://doi.org/10.1145/3491102.3517475",
      "doi": "10.1145/3491102.3517475"
    },
    {
      "text": "Mary Bachman DeSilva, Nicole Penwill, Lora Sabin, Allen L. Gifford, Zhong Li, Zhang Fujie, Mu Weiwei, Li Yongzhen, Lu Hongyan, Zeng Xuemei, Yiyao Barnoon, Christopher J. Gill, and Rachael Bonawitz. 2018. We don't dare to tell her … we don't know where to begin: Disclosure experiences and challenges among adolescents living with HIV and their caregivers in China. International Journal of Pediatrics and Adolescent Medicine 5, 1 (March 2018), 5–12. DOI:https://doi.org/10.1016/j.ijpam.2017.11.001",
      "doi": ""
    },
    {
      "text": "Abdul-Razak Doat, Reza Negarandeh, and Marzieh Hasanpour. 2019. Disclosure of HIV Status to Children in Sub-Saharan Africa: A Systematic Review. Medicina (Kaunas) 55, 8 (August 2019), E433. DOI:https://doi.org/10.3390/medicina55080433",
      "doi": ""
    },
    {
      "text": "N. Dowshen, L.M. Kuhns, A. Johnson, B.J. Holoyda, and R. Garofalo. 2012. Improving adherence to antiretroviral therapy for youth living with HIV/AIDS: A pilot study using personalized, interactive, daily text message reminders. Journal of Medical Internet Research 14, 2 (2012), 168–175. DOI:https://doi.org/10.2196/jmir.2015",
      "doi": ""
    },
    {
      "text": "Allison Druin. 2010. The role of children in the design of new technology. Behaviour & Information Technology (November 2010). DOI:https://doi.org/10.1080/01449290110108659",
      "doi": ""
    },
    {
      "text": "M. Dworkin, A. Chakraborty, S. Lee, C. Monahan, L. Hightow-Weidman, R. Garofalo, D. Qato, and A. Jimenez. 2018. A realistic talking human embodied agent mobile phone intervention to promote HIV medication adherence and retention in care in young HIV-positive African American men who have sex with men: Qualitative study. JMIR mHealth and uHealth 6, 7 (2018). DOI:https://doi.org/10.2196/10211",
      "doi": ""
    },
    {
      "text": "Laura Dwyer-Lindgren, Michael A. Cork, Amber Sligar, Krista M. Steuben, Kate F. Wilson, Naomi R. Provost, Benjamin K. Mayala, John D. VanderHeide, Michael L. Collison, Jason B. Hall, Molly H. Biehl, Austin Carter, Tahvi Frank, Dirk Douwes-Schultz, Roy Burstein, Daniel C. Casey, Aniruddha Deshpande, Lucas Earl, Charbel El Bcheraoui, Tamer H. Farag, Nathaniel J. Henry, Damaris Kinyoki, Laurie B. Marczak, Molly R. Nixon, Aaron Osgood-Zimmerman, David Pigott, Robert C. Reiner, Jennifer M. Ross, Lauren E. Schaeffer, David L. Smith, Nicole Davis Weaver, Kirsten E. Wiens, Jeffrey W. Eaton, Jessica E. Justman, Alex Opio, Benn Sartorius, Frank Tanser, Njeri Wabiri, Peter Piot, Christopher J. L. Murray, and Simon I. Hay. 2019. Mapping HIV prevalence in sub-Saharan Africa between 2000 and 2017. Nature 570, 7760 (June 2019), 189–193. DOI:https://doi.org/10.1038/s41586-019-1200-9",
      "doi": ""
    },
    {
      "text": "Eva Eriksson, Gökçe Elif Baykal, and Olof Torgersson. 2022. The Role of Learning Theory in Child-Computer Interaction - A Semi-Systematic Literature Review. In Interaction Design and Children (IDC ’22), Association for Computing Machinery, New York, NY, USA, 50–68. DOI:https://doi.org/10.1145/3501712.3529728",
      "doi": "10.1145/3501712.3529728"
    },
    {
      "text": "Erin M. Fekete, Stacey L. Williams, and Matthew D. Skinta. 2018. Internalised HIV-stigma, loneliness, depressive symptoms and sleep quality in people living with HIV. Psychology & Health 33, 3 (March 2018), 398–415. DOI:https://doi.org/10.1080/08870446.2017.1357816",
      "doi": ""
    },
    {
      "text": "Jessica L. Feuston and Anne Marie Piper. 2019. Everyday Experiences: Small Stories and Mental Illness on Instagram. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3290605.3300495",
      "doi": "10.1145/3290605.3300495"
    },
    {
      "text": "Daniel Fitton and Beth Bell. 2014. Working with Teenagers Within HCI Research: Understanding Teen-Computer Interaction. In Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI 2014 - Sand, Sea and Sky - Holiday HCI (BCS-HCI ’14), BCS, UK, 201–206. DOI:https://doi.org/10.14236/ewic/hci2014.23",
      "doi": ""
    },
    {
      "text": "Jerome T. Galea, Milagros Wong, Maribel Muñoz, Emiliano Valle, Segundo R. Leon, Dayana Díaz Perez, Lenka Kolevic, and Molly Franke. 2018. Barriers and facilitators to antiretroviral therapy adherence among Peruvian adolescents living with HIV: A qualitative study. PLOS ONE 13, 2 (February 2018), e0192791. DOI:https://doi.org/10.1371/journal.pone.0192791",
      "doi": ""
    },
    {
      "text": "Zheng Gao and Patrick C. Shih. 2019. Communities of support: social support exchange in a HIV online forum. In Proceedings of the Seventh International Symposium of Chinese CHI (Chinese CHI ’19), Association for Computing Machinery, New York, NY, USA, 37–43. DOI:https://doi.org/10.1145/3332169.3333576",
      "doi": "10.1145/3332169.3333576"
    },
    {
      "text": "Heléne Gelderblom and Paula Kotzé. 2009. Ten design lessons from the literature on child development and children's use of technology. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC ’09), Association for Computing Machinery, New York, NY, USA, 52–60. DOI:https://doi.org/10.1145/1551788.1551798",
      "doi": "10.1145/1551788.1551798"
    },
    {
      "text": "Hilary Goldhammer, Linda G. Marc, Nicole S. Chavis, Demetrios Psihopaidas, Massah Massaquoi, Sean Cahill, Erin Nortrup, Carol Dawson Rose, Janet Meyers, Kenneth H. Mayer, Stacy M. Cohen, and Alex S. Keuroghlian. 2022. Interventions for addressing trauma among people with HIV: a narrative review. AIDS Care 34, 4 (April 2022), 505–514. DOI:https://doi.org/10.1080/09540121.2021.1984382",
      "doi": ""
    },
    {
      "text": "Eric Gyamfi, Paul Okyere, Acheampong Enoch, and Emmanuel Appiah-Brempong. 2017. Prevalence of, and barriers to the disclosure of HIV status to infected children and adolescents in a district of Ghana. BMC International Health and Human Rights 17, 1 (April 2017), 8. DOI:https://doi.org/10.1186/s12914-017-0114-6",
      "doi": ""
    },
    {
      "text": "Jessica E. Haberer, Angella Musiimenta, Esther C. Atukunda, Nicholas Musinguzi, Monique A. Wyatt, Norma C. Ware, and David R. Bangsberg. 2016. Short message service (SMS) reminders and real-time adherence monitoring improve antiretroviral therapy adherence in rural Uganda. AIDS 30, 8 (May 2016), 1295–1299. DOI:https://doi.org/10.1097/QAD.0000000000001021",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson. 2017. The Social Complexities of Transgender Identity Disclosure on Social Network Sites. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), Association for Computing Machinery, New York, NY, USA, 280–285. DOI:https://doi.org/10.1145/3027063.3027136",
      "doi": "10.1145/3027063.3027136"
    },
    {
      "text": "La Verne Abe Harris and Nicoletta Adamo-Villani. 2009. Effects of Culture on the Pre-Production Design of the HIV Game. In ACM SIGGRAPH ASIA 2009 Educators Program (SIGGRAPH ASIA ’09), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/1666611.1666616",
      "doi": "10.1145/1666611.1666616"
    },
    {
      "text": "Rohan Hazra, George K. Siberry, and Lynne M. Mofenson. 2010. Growing up with HIV: children, adolescents, and young adults with perinatally acquired HIV infection. Annu Rev Med 61, (2010), 169–185. DOI:https://doi.org/10.1146/annurev.med.050108.151127",
      "doi": ""
    },
    {
      "text": "GREGORY M. HEREK. 1999. AIDS and Stigma. American Behavioral Scientist 42, 7 (April 1999), 1106–1116. DOI:https://doi.org/10.1177/0002764299042007004",
      "doi": ""
    },
    {
      "text": "L. Hightow-Weidman, K. Muessig, K. Knudtson, M. Srivatsa, E. Lawrence, S. LeGrand, A. Hotten, and S. Hosek. 2018. A gamified smartphone app to support engagement in care and medication adherence for HIV-positive young men who have sex with men (AllyQuest): Development and pilot study. Journal of Medical Internet Research 20, 4 (2018). DOI:https://doi.org/10.2196/publichealth.8923",
      "doi": ""
    },
    {
      "text": "Ulemba Hirom, Shyama V.S., Pankaj Doke, Sylvan Lobo, Sujit Devkar, and Nikita Pandey. 2017. A Critique on Participatory Design in Developmental Context: A Case Study. In Cross-Cultural Design (Lecture Notes in Computer Science), Springer International Publishing, Cham, 647–658. DOI:https://doi.org/10.1007/978-3-319-57931-3_52",
      "doi": ""
    },
    {
      "text": "Matthew K. Hong, Udaya Lakshmi, Kimberly Do, Sampath Prahalad, Thomas Olson, Rosa I. Arriaga, and Lauren Wilcox. 2020. Using Diaries to Probe the Illness Experiences of Adolescent Patients and Parental Caregivers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–16. DOI:https://doi.org/10.1145/3313831.3376426",
      "doi": "10.1145/3313831.3376426"
    },
    {
      "text": "Matthew K. Hong, Lauren Wilcox, Daniel Machado, Thomas A. Olson, and Stephen F. Simoneaux. 2016. Care Partnerships: Toward Technology to Support Teens’ Participation in Their Health Care. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, New York, NY, USA, 5337–5349. DOI:https://doi.org/10.1145/2858036.2858508",
      "doi": "10.1145/2858036.2858508"
    },
    {
      "text": "Juan Pablo Hourcade. Interaction Design and Children. 116.",
      "doi": ""
    },
    {
      "text": "Joshua Introne, Isabel Munoz, and Bryan Semaan. 2021. The Narrative Tapestry Design Process: Weaving Online Social Support from Stories of Stigma. Proc. ACM Hum.-Comput. Interact. 5, CSCW2 (October 2021), 389:1-389:35. DOI:https://doi.org/10.1145/3479533",
      "doi": "10.1145/3479533"
    },
    {
      "text": "Ole Sejer Iversen, Rachel Charlotte Smith, and Christian Dindler. 2017. Child as Protagonist: Expanding the Role of Children in Participatory Design. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC ’17), Association for Computing Machinery, New York, NY, USA, 27–37. DOI:https://doi.org/10.1145/3078072.3079725",
      "doi": "10.1145/3078072.3079725"
    },
    {
      "text": "Azar Kariminia, Matthew Law, Mary-Ann Davies, Michael Vinikoor, Kara Wools-Kaloustian, Valeriane Leroy, Andrew Edmonds, Catherine McGowan, Rachel Vreeman, Lee Fairlie, Samuel Ayaya, Marcel Yotebieng, Elom Takassi, Jorge Pinto, Adebola Adedimeji, Karen Malateste, Daisy M. Machado, Martina Penazzato, Rohan Hazra, Annette H. Sohn, and IeDEA. 2018. Mortality and losses to follow-up among adolescents living with HIV in the IeDEA global cohort collaboration. J Int AIDS Soc 21, 12 (December 2018), e25215. DOI:https://doi.org/10.1002/jia2.25215",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, David Odhiambo Seeh, Cyrus Mugo, Brandon Guthrie, Megan A Moreno, Grace John-Stewart, Irene Inwani, Richard Anderson, and Keshet Ronen. 2021. “That courage to encourage”: Participation and Aspirations in Chat-based Peer Support for Youth Living with HIV. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, ACM, Yokohama Japan, 1–17. DOI:https://doi.org/10.1145/3411764.3445313",
      "doi": "10.1145/3411764.3445313"
    },
    {
      "text": "Bogyeong Kim, Chaeeun Lee, Jung Huh, and Woohun Lee. 2020. Puppet Book: Digital Storybook with Back-of-Device Puppeteering Interface for Parent and Child. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), Association for Computing Machinery, New York, NY, USA, 1–4. DOI:https://doi.org/10.1145/3334480.3383175",
      "doi": "10.1145/3334480.3383175"
    },
    {
      "text": "Maria H. Kim, Alick C. Mazenga, Xiaoying Yu, Saeed Ahmed, Mary E. Paul, Peter N. Kazembe, and Elaine J. Abrams. 2017. High self-reported non-adherence to antiretroviral therapy amongst adolescents living with HIV in Malawi: barriers and associated factors. Journal of the International AIDS Society 20, 1 (2017), 21437. DOI:https://doi.org/10.7448/IAS.20.1.21437",
      "doi": ""
    },
    {
      "text": "Emmanuel Kimera, Sofie Vindevogel, Didier Reynaert, Kintu Mugenyi Justice, John Rubaihayo, Jessica De Maeyer, Anne-Mie Engelen, Khamisi Musanje, and Johan Bilsen. 2020. Experiences and effects of HIV-related stigma among youth living with HIV/AIDS in Western Uganda: A photovoice study. PLoS ONE 15, 4 (2020), e0232359. DOI:https://doi.org/10.1371/journal.pone.0232359",
      "doi": ""
    },
    {
      "text": "Rachel Kimerling, Karen S. Calhoun, Rex Forehand, Lisa Armistead, and 1999. Traumatic stress in HIV-infected women. AIDS Education and Prevention 11, 4 (August 1999), 321–30.",
      "doi": ""
    },
    {
      "text": "Kira Kretzschmar, Holly Tyroll, Gabriela Pavarini, Arianna Manzini, and Ilina Singh. 2019. Can Your Phone Be Your Therapist? Young People's Ethical Perspectives on the Use of Fully Automated Conversational Agents (Chatbots) in Mental Health Support. Biomed Inform Insights 11, (January 2019), 1178222619829083. DOI:https://doi.org/10.1177/1178222619829083",
      "doi": ""
    },
    {
      "text": "Manya Krishnaswamy, Bori Lee, Chirag Murthy, Hannah Rosenfeld, and Austin S. Lee. 2017. Iyagi: An Immersive Storytelling Tool for Healthy Bedtime Routine. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’17), Association for Computing Machinery, New York, NY, USA, 603–608. DOI:https://doi.org/10.1145/3024969.3025076",
      "doi": "10.1145/3024969.3025076"
    },
    {
      "text": "Neha Kumar, Azra Ismail, Samyukta Sherugar, and Rajesh Chandwani. 2019. Restoration Work: Responding to Everyday Challenges of HIV Outreach. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 54:1-54:26. DOI:https://doi.org/10.1145/3359156",
      "doi": "10.1145/3359156"
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, and Yun Huang. 2020. Designing a Chatbot as a Mediator for Promoting Deep Self-Disclosure to a Real Mental Health Professional. Proc. ACM Hum.-Comput. Interact. 4, CSCW1 (May 2020), 31:1-31:27. DOI:https://doi.org/10.1145/3392836",
      "doi": "10.1145/3392836"
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, Yun Huang, and Wai Fu. 2020. “I Hear You, I Feel You”: Encouraging Deep Self-disclosure through a Chatbot. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376175",
      "doi": "10.1145/3313831.3376175"
    },
    {
      "text": "Sara LeGrand, Kathryn Elizabeth Muessig, Tobias McNulty, Karina Soni, Kelly Knudtson, Alex Lemann, Nkechinyere Nwoko, and Lisa B. Hightow-Weidman. 2016. Epic Allies: Development of a Gaming App to Improve Antiretroviral Therapy Adherence Among Young HIV-Positive Men Who Have Sex With Men. JMIR SERIOUS GAMES 4, 1 (June 2016), E6-U94. DOI:https://doi.org/10.2196/games.5687",
      "doi": ""
    },
    {
      "text": "Sara LeGrand, Susan Reif, Kristen Sullivan, Kate Murray, Morgan L. Barlow, and Kathryn Whetten. 2015. A Review of Recent Literature on Trauma Among Individuals Living with HIV. Curr HIV/AIDS Rep 12, 4 (December 2015), 397–405. DOI:https://doi.org/10.1007/s11904-015-0288-2",
      "doi": ""
    },
    {
      "text": "A. Lesch, L. Swartz, A. Kagee, K. Moodley, Z. Kafaar, L. Myer, and M. Cotton. 2007. Paediatric HIV/AIDS disclosure: towards a developmental and process-oriented approach. AIDS Care 19, 6 (July 2007), 811–816. DOI:https://doi.org/10.1080/09540120601129301",
      "doi": ""
    },
    {
      "text": "Jane Leserman. 2008. Role of Depression, Stress, and Trauma in HIV Disease Progression. Psychosomatic Medicine 70, 5 (June 2008), 539–545. DOI:https://doi.org/10.1097/PSY.0b013e3181777a5f",
      "doi": ""
    },
    {
      "text": "Yuting Liao. 2019. Sharing Personal Health Information on Social Media: Balancing Self-presentation and Privacy. In Proceedings of the 10th International Conference on Social Media and Society (SMSociety ’19), Association for Computing Machinery, New York, NY, USA, 194–204. DOI:https://doi.org/10.1145/3328529.3328560",
      "doi": "10.1145/3328529.3328560"
    },
    {
      "text": "Johan Linder and Mattias Arvola. 2017. IPA in UX Research: Interpretative Phenomenological Analysis in a User Experience Design Practice. In Proceedings of the European Conference on Cognitive Ergonomics 2017 (ECCE 2017), Association for Computing Machinery, New York, NY, USA, 17–24. DOI:https://doi.org/10.1145/3121283.3121299",
      "doi": "10.1145/3121283.3121299"
    },
    {
      "text": "S. Linnemayr, H. Huang, J. Luoto, A. Kambugu, H. Thirumurthy, J.E. Haberer, G. Wagner, and B. Mukasa. 2017. Text messaging for improving antiretroviral therapy adherence: No effects after 1 year in a randomized controlled trial among adolescents and young adults. American Journal of Public Health 107, 12 (2017), 1944–1950. DOI:https://doi.org/10.2105/AJPH.2017.304089",
      "doi": ""
    },
    {
      "text": "David D Luxton. 2020. Ethical implications of conversational agents in global public health. Bull World Health Organ 98, 4 (April 2020), 285–287. DOI:https://doi.org/10.2471/BLT.19.237636",
      "doi": ""
    },
    {
      "text": "Molokwane M and Madiba S. 2021. Truth, Deception, and Coercion; Communication Strategies Used by Caregivers of Children with Perinatally Acquired HIV During the Pre-Disclosure and Post-Disclosure Period in Rural Communities in South Africa. Global pediatric health 8, (May 2021). DOI:https://doi.org/10.1177/2333794X211022269",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Jeff Hancock, and Mor Naaman. 2016. Anonymity, Intimacy and Self-Disclosure in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, New York, NY, USA, 3857–3869. DOI:https://doi.org/10.1145/2858036.2858414",
      "doi": "10.1145/2858036.2858414"
    },
    {
      "text": "Sarah MacCarthy, Uzaib Saya, Clare Samba, Josephine Birungi, Stephen Okoboi, and Sebastian Linnemayr. 2018. “How am I going to live?”: exploring barriers to ART adherence among adolescents and young adults living with HIV in Uganda. BMC Public Health 18, 1 (October 2018), 1158. DOI:https://doi.org/10.1186/s12889-018-6048-7",
      "doi": ""
    },
    {
      "text": "Sphiwe Madiba and Cynthia Diko. 2020. The Consequences of Delaying Telling Children with Perinatal HIV About Their Diagnosis as Perceived by Healthcare Workers in the Eastern Cape; A Qualitative Study. Children (Basel) 7, 12 (December 2020), E289. DOI:https://doi.org/10.3390/children7120289",
      "doi": ""
    },
    {
      "text": "Juan F. Maestre, Elizabeth V. Eikey, Mark Warner, Svetlana Yarosh, Jessica Pater, Maia Jacobs, Gabriela Marcu, and Patrick C. Shih. 2018. Conducting Research with Stigmatized Populations: Practices, Challenges, and Lessons Learned. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’18), Association for Computing Machinery, New York, NY, USA, 385–392. DOI:https://doi.org/10.1145/3272973.3273003",
      "doi": "10.1145/3272973.3273003"
    },
    {
      "text": "Juan F. Maestre, Patrycja Zdziarska, Aehong Min, Anna N. Baglione, Chia-Fang Chung, and Patrick C. Shih. 2021. Not Another Medication Adherence App: Critical Reflections on Addressing Public HIV-related Stigma Through Design. Proc. ACM Hum.-Comput. Interact. 4, CSCW3 (January 2021), 262:1-262:28. DOI:https://doi.org/10.1145/3434171",
      "doi": "10.1145/3434171"
    },
    {
      "text": "P. Mandalazi, C. Bandawe, and E. Umar. 2014. HIV Disclosure: Parental dilemma in informing HIV infected Children about their HIV Status in Malawi. Malawi Med J 26, 4 (December 2014), 101–104.",
      "doi": ""
    },
    {
      "text": "Gabriela Marcu, Anind K. Dey, and Sara Kiesler. 2012. Parent-driven use of wearable cameras for autism support: a field study with families. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp ’12), Association for Computing Machinery, New York, NY, USA, 401–410. DOI:https://doi.org/10.1145/2370216.2370277",
      "doi": "10.1145/2370216.2370277"
    },
    {
      "text": "Gabriela Marcu, Nadia Dowshen, Shuvadittya Saha, Ressa Reneth Sarreal, and Nazanin Andalibi. 2016. TreatYoSelf: empathy-driven behavioral intervention for marginalized youth living with HIV. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth ’16), ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Cancun, Mexico, 69–76.",
      "doi": "10.5555/3021319.3021330"
    },
    {
      "text": "Giulia Martelli, Rosa Antonucci, Alphonsina Mukurasi, Henry Zepherine, and Christiana Nöstlinger. 2019. Adherence to antiretroviral treatment among children and adolescents in Tanzania: Comparison between pill count and viral load outcomes in a rural context of Mwanza region. PLOS ONE 14, 3 (March 2019), e0214014. DOI:https://doi.org/10.1371/journal.pone.0214014",
      "doi": ""
    },
    {
      "text": "Liam Mason, Kathrin Gerling, Patrick Dickinson, Jussi Holopainen, Lisa Jacobs, and Kieran Hicks. 2022. Including the Experiences of Physically Disabled Players in Mainstream Guidelines for Movement-Based Games. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–15. DOI:https://doi.org/10.1145/3491102.3501867",
      "doi": "10.1145/3491102.3501867"
    },
    {
      "text": "Rebecca J. Meisenbach. 2010. Stigma Management Communication: A Theory and Agenda for Applied Research on How Individuals Manage Moments of Stigmatized Identity. Journal of Applied Communication Research 38, 3 (August 2010), 268–292. DOI:https://doi.org/10.1080/00909882.2010.490841",
      "doi": ""
    },
    {
      "text": "Alemitu Mequanint Bezabih, Kathrin Gerling, Workeabeba Abebe, and Vero Vanden Abeele. 2022. The Challenge of (Non-)Disclosure: Exploring the Lived Experience of Ethiopian Adolescents with HIV and Their Attitudes Toward Technology. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–19. DOI:https://doi.org/10.1145/3491102.3502132",
      "doi": "10.1145/3491102.3502132"
    },
    {
      "text": "Massy Mutumba, Victor Musiime, Alexander C. Tsai, Judith Byaruhanga, Francis Kiweewa, José A. Bauermeister, and Rachel C. Snow. 2015. Disclosure of HIV Status to Perinatally Infected Adolescents in Urban Uganda: A Qualitative Study on Timing, Process, and Outcomes. Journal of the Association of Nurses in AIDS Care 26, 4 (July 2015), 472–484. DOI:https://doi.org/10.1016/j.jana.2015.02.001",
      "doi": ""
    },
    {
      "text": "Katherine A. Myant and Joanne M. Williams. 2005. Children's Concepts of Health and Illness: Understanding of Contagious Illnesses, Non-Contagious Illnesses and Injuries. J Health Psychol 10, 6 (December 2005), 805–819. DOI:https://doi.org/10.1177/1359105305057315",
      "doi": ""
    },
    {
      "text": "Robert D. Nachtigall, Gay Becker, Seline Szkupinski Quiroga, and Jeanne M. Tschann. 1998. The disclosure decision: Concerns and issues of parents of children conceived through donor insemination. American Journal of Obstetrics and Gynecology 178, 6 (June 1998), 1165–1170. DOI:https://doi.org/10.1016/S0002-9378(98)70318-7",
      "doi": ""
    },
    {
      "text": "Meena Natarajan and Tapan Parikh. 2013. Understanding barriers to information access and disclosure for HIV+ women. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (ICTD ’13), Association for Computing Machinery, New York, NY, USA, 143–152. DOI:https://doi.org/10.1145/2516604.2516627",
      "doi": "10.1145/2516604.2516627"
    },
    {
      "text": "Paul E. Nevin, Sarah Frey, Lauren Lipira, Meheret Endeshaw, Lisa Niemann, Roxanne P. Kerani, and Deepa Rao. 2018. “You are always hiding. It's the worst way to live.” Exploring Stigma in African Immigrants Living With HIV in a Large Northwest U.S. Metropolitan Area. Journal of the Association of Nurses in AIDS Care 29, 3 (May 2018), 417–425. DOI:https://doi.org/10.1016/j.jana.2017.11.005",
      "doi": ""
    },
    {
      "text": "Vienna R. Nightingale, Tamara G. Sher, Melissa Mattson, Sarah Thilges, and Nathan B. Hansen. 2011. The Effects of Traumatic Stressors and HIV-Related Trauma Symptoms on Health and Health Related Quality of Life. AIDS Behav 15, 8 (November 2011), 1870–1878. DOI:https://doi.org/10.1007/s10461-011-9980-4",
      "doi": ""
    },
    {
      "text": "Candy J. Noltensmeyer and Rebecca J. Meisenbach. 2016. Emerging Patterns of Stigma Management Communication Strategies Among Burn Survivors and Relational Partners. American Behavioral Scientist 60, 11 (October 2016), 1378–1397. DOI:https://doi.org/10.1177/0002764216657384",
      "doi": ""
    },
    {
      "text": "Nikhila Nyapathy and Rosa I. Arriaga. 2019. Tracking and Reporting Asthma Data for Children. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (CSCW ’19), Association for Computing Machinery, New York, NY, USA, 330–334. DOI:https://doi.org/10.1145/3311957.3359480",
      "doi": "10.1145/3311957.3359480"
    },
    {
      "text": "Elisabetta Pegurri, Elke Konings, Bud Crandall, Hiwot Haile-Selassie, Nelia Matinhure, Warren Naamara, and Yibeltal Assefa. 2015. The Missed HIV-Positive Children of Ethiopia. PLoS One 10, 4 (April 2015). DOI:https://doi.org/10.1371/journal.pone.0124041",
      "doi": ""
    },
    {
      "text": "Scott R. Peppet. 2011. Unraveling Privacy: The Personal Prospectus and the Threat of a Full-Disclosure Future. Nw. U. L. Rev. 105, 3 (2011), 1153–1204.",
      "doi": ""
    },
    {
      "text": "Jennifer L. Peterson. 2010. The Challenges of Seeking and Receiving Support for Women Living With HIV. Health Communication 25, 5 (July 2010), 470–479. DOI:https://doi.org/10.1080/10410236.2010.484878",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A. Munson, James Fogarty, and Julie A. Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17), Association for Computing Machinery, New York, NY, USA, 2300–2315. DOI:https://doi.org/10.1145/2998181.2998362",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Annika Pinch, Jeremy Birnholtz, Ashley Kraus, Kathryn Macapagal, and David A. Moskowitz. 2021. “It's not exactly prominent or direct, but it's there”: Understanding Strategies for Sensitive Disclosure Online. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’21), Association for Computing Machinery, New York, NY, USA, 149–152. DOI:https://doi.org/10.1145/3462204.3481740",
      "doi": "10.1145/3462204.3481740"
    },
    {
      "text": "Andrew J. Reid. 2019. Project:Filter - using applied games to engage secondary schoolchildren with public policy. Journal of Virtual Worlds Research 12, 2 (September 2019), 1–20. DOI:https://doi.org/10.4101/jvwr.v12i2.7348",
      "doi": ""
    },
    {
      "text": "Michael V. Relf, Megan Williams, and Julie Barroso. 2015. Voices of Women Facing HIV-Related Stigma in the Deep South. J Psychosoc Nurs Ment Health Serv 53, 12 (December 2015), 38–47. DOI:https://doi.org/10.3928/02793695-20151020-01",
      "doi": ""
    },
    {
      "text": "Gaëlle Sabben, Victor Mudhune, Ken Ondeng'e, Isdorah Odero, Richard Ndivo, Victor Akelo, and Kate Winskell. 2019. A Smartphone Game to Prevent HIV Among Young Africans (Tumaini): Assessing Intervention and Study Acceptability Among Adolescents and Their Parents in a Randomized Controlled Trial. JMIR mHealth and uHealth 7, 5 (2019), e13049. DOI:https://doi.org/10.2196/13049",
      "doi": ""
    },
    {
      "text": "Adellah Sariah, Joan Rugemalila, Magreat Somba, Anna Minja, Margareth Makuchilo, Edith Tarimo, David Urassa, and Helen Siril. 2016. “Experiences with disclosure of HIV-positive status to the infected child”: Perspectives of healthcare providers in Dar es Salaam, Tanzania. BMC Public Health 16, 1 (October 2016), 1083. DOI:https://doi.org/10.1186/s12889-016-3749-7",
      "doi": ""
    },
    {
      "text": "Rebecca Schnall, Hwayoung Cho, Alexander Mangone, Adrienne Pichon, and Haomiao Jia. 2018. Mobile Health Technology for Improving Symptom Management in Low Income Persons Living with HIV. AIDS AND BEHAVIOR 22, 10 (October 2018), 3373–3383. DOI:https://doi.org/10.1007/s10461-017-2014-0",
      "doi": ""
    },
    {
      "text": "Woosuk Seo, Ayse G. Buyuktur, Sung Won Choi, Laura Sedig, and Sun Young Park. 2021. Challenges in the Parent-Child Communication of Health-related Information in Pediatric Cancer Care. Proc. ACM Hum.-Comput. Interact. 5, CSCW1 (April 2021), 110:1-110:24. DOI:https://doi.org/10.1145/3449184",
      "doi": "10.1145/3449184"
    },
    {
      "text": "T. Seppala. 2014. Engadget. Retrieved September 13, 2022 from https://www.engadget.com/2014-12-23-im-positive-hiv-game.html",
      "doi": ""
    },
    {
      "text": "Amanda Sharkey and Noel Sharkey. 2012. Granny and the robots: ethical issues in robot care for the elderly. Ethics Inf Technol 14, 1 (March 2012), 27–40. DOI:https://doi.org/10.1007/s10676-010-9234-6",
      "doi": "10.1007/s10676-010-9234-6"
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, Claudia Estcourt, Pam Sonnenberg, and Ann Blandford. 2017. Are HIV Smartphone Apps and Online Interventions Fit for Purpose? In Proceedings of the 2017 International Conference on Digital Health (DH ’17), Association for Computing Machinery, New York, NY, USA, 6–15. DOI:https://doi.org/10.1145/3079452.3079469",
      "doi": "10.1145/3079452.3079469"
    },
    {
      "text": "Amy L. Slogrove and Annette H. Sohn. 2018. The global epidemiology of adolescents living with HIV: Time for more granular data to improve adolescent health outcomes. Curr Opin HIV AIDS 13, 3 (May 2018), 170–178. DOI:https://doi.org/10.1097/COH.0000000000000449",
      "doi": ""
    },
    {
      "text": "Judith G. Smetana, Nicole Campione-Barr, and Aaron Metzger. 2006. Adolescent Development in Interpersonal and Societal Contexts. Annual Review of Psychology 57, 1 (2006), 255–284. DOI:https://doi.org/10.1146/annurev.psych.57.102904.190124",
      "doi": ""
    },
    {
      "text": "Jonathan A. Smith and Mike Osborn. 2015. Interpretative phenomenological analysis as a useful methodology for research on the lived experience of pain. Br J Pain 9, 1 (February 2015), 41–42. DOI:https://doi.org/10.1177/2049463714541642",
      "doi": ""
    },
    {
      "text": "Jonathan A. Smith and Pnina Shinebourne. 2012. Interpretative phenomenological analysis. In APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological. American Psychological Association, Washington, DC, US, 73–82. DOI:https://doi.org/10.1037/13620-005",
      "doi": ""
    },
    {
      "text": "Mohammad Reza Soleymani, Soheila Hemmati, Hassan Ashrafi-Rizi, and Leila Shahrzadi. 2017. Comparison of the effects of storytelling and creative drama methods on children's awareness about personal hygiene. J Educ Health Promot 6, (October 2017), 82. DOI:https://doi.org/10.4103/jehp.jehp_56_16",
      "doi": ""
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the Elephant in the Classroom: Using Culturally Localized Technology To Teach Around Taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 2792–2804. DOI:https://doi.org/10.1145/3025453.3025958",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "Sarah E. Stutterheim, John B. Pryor, Arjan ER Bos, Robert Hoogendijk, Peter Muris, and Herman P. Schaalma. 2009. HIV-related stigma and psychological distress: the harmful effects of specific stigma manifestations in various social settings. AIDS 23, 17 (November 2009), 2353–2357. DOI:https://doi.org/10.1097/QAD.0b013e3283320dce",
      "doi": ""
    },
    {
      "text": "Danielle Taddeo, Maud Egedy, and Jean-Yves Frappier. 2008. Adherence to treatment in adolescents. Paediatr Child Health 13, 1 (January 2008), 19–24.",
      "doi": ""
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, and Luc Geurts. 2022. Virtual Feed: Design and Evaluation of a Virtual Reality Simulation Addressing the Lived Experience of Breastfeeding. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (CHI ’22), Association for Computing Machinery, New York, NY, USA, 1–17. DOI:https://doi.org/10.1145/3491102.3517620",
      "doi": "10.1145/3491102.3517620"
    },
    {
      "text": "Unity Technologies. Unity Real-Time Development Platform | 3D, 2D VR & AR Engine. Retrieved September 13, 2022 from https://unity.com/",
      "doi": ""
    },
    {
      "text": "Anthony C. Theuninck, Nick Lake, and Stuart Gibson. 2010. HIV-Related Posttraumatic Stress Disorder: Investigating the Traumatic Events. AIDS Patient Care and STDs 24, 8 (August 2010), 485–491. DOI:https://doi.org/10.1089/apc.2009.0231",
      "doi": ""
    },
    {
      "text": "Judith J. Toromo, Edith Apondi, Winstone M. Nyandiko, Mark Omollo, Salim Bakari, Josephine Aluoch, Rami Kantor, J. Dennis Fortenberry, Kara Wools-Kaloustian, Batya Elul, Rachel C. Vreeman, and Leslie A. Enane. 2022. “I have never talked to anyone to free my mind” – challenges surrounding status disclosure to adolescents contribute to their disengagement from HIV care: a qualitative study in western Kenya. BMC Public Health 22, 1 (June 2022), 1122. DOI:https://doi.org/10.1186/s12889-022-13519-9",
      "doi": ""
    },
    {
      "text": "Tammy Toscos, Kay Connelly, and Yvonne Rogers. 2012. Best intentions: health monitoring technology and children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12), Association for Computing Machinery, New York, NY, USA, 1431–1440. DOI:https://doi.org/10.1145/2207676.2208603",
      "doi": "10.1145/2207676.2208603"
    },
    {
      "text": "Piet Tutenel, Stefan Ramaekers, and Ann Heylighen. 2019. Conversations between procedural and situated ethics: Learning from video research with children in a cancer care ward. The Design Journal 22, sup1 (April 2019), 641–654. DOI:https://doi.org/10.1080/14606925.2019.1595444",
      "doi": ""
    },
    {
      "text": "Sveva Valguarnera and Monica Landoni. 2021. Designing Collective Teacher-Children Personas in Preschool: A Methodological Approach. In Interaction Design and Children (IDC ’21), Association for Computing Machinery, New York, NY, USA, 488–492. DOI:https://doi.org/10.1145/3459990.3465186",
      "doi": "10.1145/3459990.3465186"
    },
    {
      "text": "Sveva Valguarnera and Monica Landoni. 2022. ”This book is magical!”: exploring emergent readers’ preferences and wishes for storytelling tools. In Nordic Human-Computer Interaction Conference (NordiCHI ’22), Association for Computing Machinery, New York, NY, USA, 1–9. DOI:https://doi.org/10.1145/3546155.3547274",
      "doi": "10.1145/3546155.3547274"
    },
    {
      "text": "Peter A. Vanable, Michael P. Carey, Donald C. Blair, and Rae A. Littlewood. 2006. Impact of HIV-Related Stigma on Health Behaviors and Psychological Adjustment Among HIV-Positive Men and Women. AIDS Behav 10, 5 (September 2006), 473–482. DOI:https://doi.org/10.1007/s10461-006-9099-1",
      "doi": ""
    },
    {
      "text": "Lara M.E. Vaz, Eugenia Eng, Suzanne Maman, Tomi Tshikandu, and Frieda Behets. 2010. Telling Children They Have HIV: Lessons Learned from Findings of a Qualitative Study in Sub-Saharan Africa. AIDS Patient Care and STDs 24, 4 (April 2010), 247–256. DOI:https://doi.org/10.1089/apc.2009.0217",
      "doi": ""
    },
    {
      "text": "M. E. Walsh and R. Bibace. 1990. Developmentally-based AIDS/HIV education. J Sch Health 60, 6 (August 1990), 256–261.",
      "doi": ""
    },
    {
      "text": "Mary E. Walsh and Roger Bibace. 1991. Children's Conceptions of AIDS: A Developmental Analysis. J Pediatr Psychol 16, 3 (June 1991), 273–285. DOI:https://doi.org/10.1093/jpepsy/16.3.273",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M. Angela Sasse, and Ann Blandford. 2018. Privacy Unraveling Around Explicit HIV Status Disclosure Fields in the Online Geosocial Hookup App Grindr. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018). DOI:https://doi.org/10.1145/3274450",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Mark Warner, Agnieszka Kitkowska, Jo Gibbs, Juan F. Maestre, and Ann Blandford. 2020. Evaluating “Prefer not to say” Around Sensitive Disclosures. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM, Honolulu HI USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376150",
      "doi": "10.1145/3313831.3376150"
    },
    {
      "text": "Mark Warner, Juan F. Maestre, Jo Gibbs, Chia-Fang Chung, and Ann Blandford. 2019. Signal Appropriation of Explicit HIV Status Disclosure Fields in Sex-Social Apps Used by Gay and Bisexual Men. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3290605.3300922",
      "doi": "10.1145/3290605.3300922"
    },
    {
      "text": "H. M. Wellman and S. A. Gelman. 1992. Cognitive development: foundational theories of core domains. Annu Rev Psychol 43, (1992), 337–375. DOI:https://doi.org/10.1146/annurev.ps.43.020192.002005",
      "doi": ""
    },
    {
      "text": "World Bank. Ethiopia | Data. Retrieved December 8, 2022 from https://data.worldbank.org/country/ethiopia?view=chart",
      "doi": ""
    },
    {
      "text": "Maria Wydra, Karen M. O'Brien, and Erica S. Merson. 2012. In Their Own Words: Adopted Persons’ Experiences of Adoption Disclosure and Discussion in Their Families. Journal of Family Social Work 15, 1 (January 2012), 62–77. DOI:https://doi.org/10.1080/10522158.2012.642616",
      "doi": ""
    },
    {
      "text": "Diyi Yang, Zheng Yao, Joseph Seering, and Robert Kraut. 2019. The Channel Matters: Self-disclosure, Reciprocity and Social Support in Online Cancer Support Groups. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–15. DOI:https://doi.org/10.1145/3290605.3300261",
      "doi": "10.1145/3290605.3300261"
    },
    {
      "text": "Krisna Yetti, Linlin Lindayani, and Mei-Chih Huang. 2020. Children HIV disclosure: Should the children know their HIV status prior treatment and what are the information have to be told? Clinical Ethics 15, 3 (September 2020), 162–166. DOI:https://doi.org/10.1177/1477750919897381",
      "doi": ""
    },
    {
      "text": "Angela Zamora, Laura F. Romo, and Terry Kit-fong Au. 2006. Using biology to teach adolescents about STD transmission and self-protective behaviors. Journal of Applied Developmental Psychology 27, 2 (March 2006), 109–124. DOI:https://doi.org/10.1016/j.appdev.2005.12.009",
      "doi": ""
    },
    {
      "text": "UNAIDS data 2020. Retrieved September 13, 2022 from https://www.unaids.org/en/resources/documents/2020/unaids-data",
      "doi": ""
    },
    {
      "text": "Wisepill Technologies. Wisepill Technologies. Retrieved September 1, 2021 from https://www.wisepill.com",
      "doi": ""
    }
  ]
}