{
  "doi": "10.1145/3544548.3580796",
  "title": "Nooks: Social Spaces to Lower Hesitations in Interacting with New People at Work",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2023,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Initiating conversations with new people at work is often intimidating because of uncertainty about their interests. People worry others may reject their attempts to initiate conversation or that others may not enjoy the conversation. We introduce a new system, Nooks, built on Slack, that reduces fear of social evaluation by enabling individuals to initiate any conversation as a nook—a conversation room that identifies its topic, but not its creator. Automatically convening others interested in the nook, Nooks further reduces fears of social evaluation by guaranteeing individuals in advance that others they are about to interact with are interested in the conversation. In a multi-month deployment with participants in a summer research program, Nooks provided participants with non-threatening and inclusive interaction opportunities, and ambient awareness, leading to new interactions online and offline. Our results demonstrate how intentionally designed social spaces can reduce fears of social evaluation and catalyze new workplace connections.",
  "tags": [
    "Prototyping/Implementation",
    "Computer Mediated Communication",
    "Artifact or System",
    "Workplaces"
  ],
  "authors": [
    {
      "name": "Shreya Bali",
      "institution": "Human Computer Interaction, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783533",
      "orcid": "0000-0002-6005-409X"
    },
    {
      "name": "Pranav Khadpe",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659535986",
      "orcid": "0000-0002-2106-4527"
    },
    {
      "name": "Geoff Kaufman",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459698057",
      "orcid": "0000-0002-0123-3792"
    },
    {
      "name": "Chinmay Kulkarni",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556575456",
      "orcid": "0000-0003-4922-6601"
    }
  ],
  "references": [
    {
      "text": "2012. Starting New Online Communities. In Building Successful Online Communities: Evidence-Based Social Design. The MIT Press. https://doi.org/10.7551/mitpress/8472.003.0007 arXiv:https://direct.mit.edu/book/chapter-pdf/194379/9780262298315_caf.pdf",
      "doi": ""
    },
    {
      "text": "Dinislam Abdulgalimov, Reuben Kirkham, James Nicholson, Vasilis Vlachokyriakos, Pam Briggs, and Patrick Olivier. 2020. Designing for employee voice. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376284"
    },
    {
      "text": "Linda Argote and Paul Ingram. 2000. Knowledge transfer: A basis for competitive advantage in firms. Organizational behavior and human decision processes 82, 1 (2000), 150–169.",
      "doi": ""
    },
    {
      "text": "Samuel B Bacharach, Peter A Bamberger, and Dana Vashdi. 2005. Diversity and homophily at work: Supportive relations among white and African-American peers. Academy of Management Journal 48, 4 (2005), 619–644.",
      "doi": ""
    },
    {
      "text": "Robert A Baron. 1996. Interpersonal relations in organizations. Individual differences and behavior in organizations (1996), 334–370.",
      "doi": ""
    },
    {
      "text": "Lindsey A Beck and Margaret S Clark. 2010. Looking a gift horse in the mouth as a defense against increasing intimacy. Journal of Experimental Social Psychology 46, 4 (2010), 676–679.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti and Abigail Sellen. 1993. Design for privacy in ubiquitous computing environments. In Proceedings of the Third European Conference on Computer-Supported Cooperative Work 13–17 September 1993, Milan, Italy ECSCW’93. Springer, 77–92.",
      "doi": ""
    },
    {
      "text": "Michael S Bernstein, Adam Marcus, David R Karger, and Robert C Miller. 2010. Enhancing directed content sharing on the web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 971–980.",
      "doi": "10.1145/1753326.1753470"
    },
    {
      "text": "Mohd Heikal bin Husin and Paula MC Swatman. 2010. Removing the barriers to Enterprise 2.0. In 2010 IEEE international symposium on technology and society. IEEE, 275–283.",
      "doi": ""
    },
    {
      "text": "Sara A Bly, Steve R Harrison, and Susan Irwin. 1993. Media spaces: bringing people together in a video, audio, and computing environment. Commun. ACM 36, 1 (1993), 28–46.",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Erica J Boothby, Gus Cooney, Gillian M Sandstrom, and Margaret S Clark. 2018. The liking gap in conversations: Do people like us more than we think?Psychological science 29, 11 (2018), 1742–1756.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Jonathan J Cadiz, Gina Venolia, Gavin Jancke, and Anoop Gupta. 2002. Designing and deploying an information awareness interface. In Proceedings of the 2002 ACM conference on Computer supported cooperative work. 314–323.",
      "doi": "10.1145/587078.587122"
    },
    {
      "text": "Justin Cheng and Michael Bernstein. 2014. Catalyst: triggering collective action with thresholds. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1211–1221.",
      "doi": "10.1145/2531602.2531635"
    },
    {
      "text": "Dominique T Chlup and Tracy E Collins. 2010. Breaking the ice: using ice-breakers and re-energizers with adult learners. Adult Learning 21, 3-4 (2010), 34–39.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark and Keith Brown. 2006. Context and common ground. Concise Encyclopedia of Philosophy of Language and Linguistics (2006) (2006), 85–87.",
      "doi": ""
    },
    {
      "text": "Nina Cong, Kevin Cheng, Haoqi Zhang, and Ryan Louie. 2021. Collective Narrative: Scaffolding Community Storytelling through Context-Awareness. In Companion Publication of the 2021 Conference on Computer Supported Cooperative Work and Social Computing. 40–43.",
      "doi": "10.1145/3462204.3481747"
    },
    {
      "text": "Alan Cook, John D Cook, Susan J Hepworth, Toby D Wall, and Peter B Warr. 1981. The experience of work: A compendium and review of 249 measures and their use. London; New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Michael J Davern and Robert J Kauffman. 2000. Discovering potential and realizing value from information technology investments. Journal of Management Information Systems 16, 4 (2000), 121–143.",
      "doi": "10.1080/07421222.2000.11518268"
    },
    {
      "text": "Ansgar E Depping, Regan L Mandryk, Colby Johanson, Jason T Bowey, and Shelby C Thomson. 2016. Trust me: social games are better than social icebreakers at building trust. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. 116–129.",
      "doi": "10.1145/2967934.2968097"
    },
    {
      "text": "Joan DiMicco, David R Millen, Werner Geyer, Casey Dugan, Beth Brownholtz, and Michael Muller. 2008. Motivations for social networking at work. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 711–720.",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work. 107–114.",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Paul Dourish and Sara Bly. 1992. Portholes: Supporting awareness in a distributed work group. In Proceedings of the SIGCHI conference on Human factors in computing systems. 541–547.",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Elizabeth W Dunn and Iris Lok. 2022. Can Sociability be Increased?In The Psychology of Sociability. Routledge, 98–115.",
      "doi": ""
    },
    {
      "text": "Jane E Dutton and Emily D Heaphy. 2003. The power of high-quality connections. Positive organizational scholarship: Foundations of a new discipline 3(2003), 263–278.",
      "doi": ""
    },
    {
      "text": "Susan F Ehrlich. 1987. Strategies for encouraging successful adoption of office communication systems. ACM Transactions on Information Systems (TOIS) 5, 4 (1987), 340–357.",
      "doi": "10.1145/42196.42198"
    },
    {
      "text": "Naomi I Eisenberger, Matthew D Lieberman, and Kipling D Williams. 2003. Does rejection hurt? An fMRI study of social exclusion. Science 302, 5643 (2003), 290–292.",
      "doi": ""
    },
    {
      "text": "Achim Elfering, Norbert K Semmer, Volker Schade, Sven Grund, and Norbert Boos. 2002. Supportive colleague, unsupportive supervisor: the role of provider-specific constellations of social support at work in the development of low back pain.Journal of occupational health psychology 7, 2 (2002), 130.",
      "doi": ""
    },
    {
      "text": "Nicholas Epley and Juliana Schroeder. 2014. Mistakenly seeking solitude.Journal of Experimental Psychology: General 143, 5 (2014), 1980.",
      "doi": ""
    },
    {
      "text": "Thomas Erickson, David N Smith, Wendy A Kellogg, Mark Laff, John T Richards, and Erin Bradner. 1999. Socially translucent systems: social proxies, persistent conversation, and the design of “babble”. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 72–79.",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "William M Evan. 1963. Peer-group interaction and organizational socialization: A study of employee turnover. American Sociological Review 28, 3 (1963), 436–440.",
      "doi": ""
    },
    {
      "text": "Geraldine Fitzpatrick, Tim Mansfield, Simon Kaplan, David Arnold, Ted Phelps, and Bill Segall. 1999. Augmenting the workaday world with Elvin. In ECSCW’99. Springer, 431–450.",
      "doi": ""
    },
    {
      "text": "Jennifer M George and Kenneth Bettenhausen. 1990. Understanding prosocial behavior, sales performance, and turnover: A group-level analysis in a service context.Journal of applied psychology 75, 6 (1990), 698.",
      "doi": ""
    },
    {
      "text": "Connie JG Gersick and J Richard Hackman. 1990. Habitual routines in task-performing groups. Organizational behavior and human decision processes 47, 1 (1990), 65–97.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1967. Interaction ritual: Essays on face-to-face interaction.(1967).",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2008. Behavior in public places. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "George O Goodman and Mark J Abel. 1986. Collaboration research in SCL. In Proceedings of the 1986 ACM conference on Computer-supported cooperative work. 246–251.",
      "doi": "10.1145/637069.637099"
    },
    {
      "text": "Saul Greenberg and Michael Rounding. 2001. The notification collage: posting information to public and personal displays. In Proceedings of the SIGCHI conference on Human factors in computing systems. 514–521.",
      "doi": "10.1145/365024.365339"
    },
    {
      "text": "Jonathan Grudin. 1994. Groupware and social dynamics: Eight challenges for developers. Commun. ACM 37, 1 (1994), 92–105.",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Luke Hespanhol, Martin Tomitsch, Oliver Bown, and Miriama Young. 2014. Using embodied audio-visual interaction to promote social encounters around large media façades. In Proceedings of the 2014 conference on Designing interactive systems. 945–954.",
      "doi": "10.1145/2598510.2598568"
    },
    {
      "text": "James M Hudson, Jim Christensen, Wendy A Kellogg, and Thomas Erickson. 2002. \" I’d be overwhelmed, but it’s just one more thing to do\" availability and interruption in research management. In Proceedings of the SIGCHI Conference on Human factors in computing systems. 97–104.",
      "doi": "10.1145/503376.503394"
    },
    {
      "text": "Pradthana Jarusriboonchai, Aris Malapaschas, and Thomas Olsson. 2016. Design and evaluation of a multi-player mobile game for icebreaking activity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4366–4377.",
      "doi": "10.1145/2858036.2858298"
    },
    {
      "text": "Robert L Kahn and Philippe Byosiere. 1992. Stress in organizations.(1992).",
      "doi": ""
    },
    {
      "text": "Ruth Kanfer. 1990. Motivation theory and industrial and organizational psychology. Handbook of industrial and organizational psychology 1, 2 (1990), 75–130.",
      "doi": ""
    },
    {
      "text": "Karrie Karahalios and Judith Donath. 2004. Telemurals: linking remote spaces with social catalysts. In Proceedings of the SIGCHI conference on Human factors in computing systems. 615–622.",
      "doi": "10.1145/985692.985770"
    },
    {
      "text": "Fariba Karimi, Mathieu Génois, Claudia Wagner, Philipp Singer, and Markus Strohmaier. 2018. Homophily influences ranking of minorities in social networks. Scientific reports 8, 1 (2018), 1–12.",
      "doi": ""
    },
    {
      "text": "Reuben Kirkham, Sebastian Mellor, David Green, Jiun-Shian Lin, Karim Ladha, Cassim Ladha, Daniel Jackson, Patrick Olivier, Peter Wright, and Thomas Ploetz. 2013. The break-time barometer: an exploratory system forworkplace break-time social awareness. In Proceedings of the 2013 ACM International joint conference on pervasive and ubiquitous computing. 73–82.",
      "doi": "10.1145/2493432.2493468"
    },
    {
      "text": "Robert Kraut, Carmen Egido, and Jolene Galegher. 1988. Patterns of contact and communication in scientific research collaboration. In Proceedings of the 1988 ACM conference on Computer-supported cooperative work. 1–12.",
      "doi": "10.1145/62266.62267"
    },
    {
      "text": "Sven Laumer, N Sadat Shami, Michael Muller, and Werner Geyer. 2017. The challenge of enterprise social networking (non-) use at work: a case study of how to positively influence employees’ enterprise social networking acceptanc. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 978–994.",
      "doi": "10.1145/2998181.2998309"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Edward J Lawler and Jeongkoo Yoon. 1998. Network structure and emotion in exchange relations. American sociological review(1998), 871–894.",
      "doi": ""
    },
    {
      "text": "Robert Louw and Jabu Mtsweni. 2013. Guiding principles for adopting and promoting Enterprise 2.0 collaboration technologies. In 2013 International Conference on Adaptive Science and Technology. IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Paul Benjamin Lowry, Tom L Roberts, Nicholas C Romano Jr, Paul D Cheney, and Ross T Hightower. 2006. The impact of group size and social presence on small-group communication: Does computer-mediated communication make a difference?Small Group Research 37, 6 (2006), 631–661.",
      "doi": ""
    },
    {
      "text": "Martin Ludvigsen. 2005. Designing for social use in public places–A conceptual framework of social interaction. Proceedings of Designing Pleasuable Products and Interfaces, DPPI 5 (2005), 389–408.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Mary Czerwinski, and Shamsi T Iqbal. 2018. Effects of individual differences in blocking workplace distractions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173666"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email duration, batching and self-interruption: Patterns of email use on productivity and stress. In Proceedings of the 2016 CHI conference on human factors in computing systems. 1717–1728.",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Tam Yeuk-mui May, Marek Korczynski, and Stephen J Frenkel. 2002. Organizational and occupational commitment: Knowledge workers in large corporations. Journal of management Studies 39, 6 (2002), 775–801.",
      "doi": ""
    },
    {
      "text": "J McCarthy. 2002. Using public displays to create conversation opportunities. In Workshop at CSCW.",
      "doi": ""
    },
    {
      "text": "Adela McMurray and Don Scott. 2013. Determinants of organisational climate for academia. Higher Education Research & Development 32, 6 (2013), 960–974.",
      "doi": ""
    },
    {
      "text": "Stanley Milgram, Leonard Bickman, and Lawrence Berkowitz. 1969. Note on the drawing power of crowds of different size.Journal of personality and social psychology 13, 2(1969), 79.",
      "doi": ""
    },
    {
      "text": "Donald B Miller. 1977. How to improve the performance and productivity of the knowledge worker. Organizational Dynamics 5, 3 (1977), 62–80.",
      "doi": ""
    },
    {
      "text": "Matthew K Miller and Regan L Mandryk. 2021. Meeting with Media: Comparing Synchronous Media Sharing and Icebreaker Questions in Initial Interactions via Video Chat. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–26.",
      "doi": ""
    },
    {
      "text": "Robb Mitchell. 2015. Sensing mine, yours, theirs, and ours: interpersonal ubiquitous interactions. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers. 933–938.",
      "doi": "10.1145/2800835.2806203"
    },
    {
      "text": "Robb Mitchell. 2019. Levelling, Nudging, and Easing: Inspirational Design Patterns For Supporting New Encounters. In Proceedings of the 5th International ACM In-Cooperation HCI and UX Conference. 116–127.",
      "doi": "10.1145/3328243.3328258"
    },
    {
      "text": "Robb Mitchell and Thomas Olsson. 2019. Facilitating the first move: Exploring inspirational design patterns for aiding initiation of social encounters. In Proceedings of the 9th International Conference on Communities & Technologies-Transforming Communities. 283–294.",
      "doi": "10.1145/3328320.3328396"
    },
    {
      "text": "Christine Musselin. 2007. Are universities specific organisations. Towards a multiversity(2007), 63–84.",
      "doi": ""
    },
    {
      "text": "Maaz Nasir, Kelly Lyons, Rock Leung, and Ali Moradian. 2013. Cooperative games and their effect on group collaboration. In International Conference on Design Science Research in Information Systems. Springer, 502–510.",
      "doi": "10.1007/978-3-642-38827-9_43"
    },
    {
      "text": "Tien T Nguyen, Duyen T Nguyen, Shamsi T Iqbal, and Eyal Ofek. 2015. The known stranger: Supporting conversations between strangers with personalized topic suggestions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 555–564.",
      "doi": "10.1145/2702123.2702411"
    },
    {
      "text": "Dennis W Organ. 1997. Organizational citizenship behavior: It’s construct clean-up time. Human performance 10, 2 (1997), 85–97.",
      "doi": ""
    },
    {
      "text": "Eric Paulos and Elizabeth Goodman. 2004. The familiar stranger: anxiety, comfort, and play in public places. In Proceedings of the SIGCHI conference on Human factors in computing systems. 223–230.",
      "doi": "10.1145/985692.985721"
    },
    {
      "text": "Lydia Plowman, Yvonne Rogers, and Magnus Ramage. 1995. What are workplace studies for?. In Proceedings of the Fourth European Conference on Computer-Supported Cooperative Work ECSCW’95. Springer, 309–324.",
      "doi": "10.5555/1241958.1241978"
    },
    {
      "text": "Raghuram G Rajan and Julie Wulf. 2006. The flattening firm: Evidence from panel data on the changing nature of corporate hierarchies. The Review of Economics and Statistics 88, 4 (2006), 759–773.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers and Harry Brignull. 2002. Subtle ice-breaking: encouraging socializing and interaction around a large public display. In Workshop on Public, Community. and Situated Displays, Vol. 6. Citeseer.",
      "doi": ""
    },
    {
      "text": "Mark Rouncefield, John A Hughes, Tom Rodden, and Stephen Viller. 1994. Working with “Constant Interruption” CSCW and the Small Office. In Proceedings of the 1994 ACM conference on Computer supported cooperative work. 275–286.",
      "doi": "10.1145/192844.193028"
    },
    {
      "text": "Matthew J Salganik, Peter Sheridan Dodds, and Duncan J Watts. 2006. Experimental study of inequality and unpredictability in an artificial cultural market. science 311, 5762 (2006), 854–856.",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders. 2002. From user-centered to participatory design approaches. In Design and the social sciences. CRC Press, 18–25.",
      "doi": ""
    },
    {
      "text": "Gillian M Sandstrom and Erica J Boothby. 2021. Why do people avoid talking to strangers? A mini meta-analysis of predicted fears and actual experiences talking to a stranger. Self and Identity 20, 1 (2021), 47–71.",
      "doi": ""
    },
    {
      "text": "Juliana Schroeder, Donald Lyons, and Nicholas Epley. 2022. Hello, stranger? Pleasant conversations are preceded by concerns about starting one.Journal of Experimental Psychology: General 151, 5 (2022), 1141.",
      "doi": ""
    },
    {
      "text": "Thomas W Sileo, Mary Anne Prater, John L Luckner, Barbara Rhine, and Harvey A Rude. 1998. Strategies to facilitate preservice teachers’ active involvement in learning. Teacher Education and Special Education 21, 3 (1998), 187–204.",
      "doi": ""
    },
    {
      "text": "Scott S Snibbe and Hayes S Raffle. 2009. Social immersive media: pursuing best practices for multi-user interactive camera/projector exhibits. In Proceedings of the SIGCHI conference on human factors in computing systems. 1447–1456.",
      "doi": "10.1145/1518701.1518920"
    },
    {
      "text": "Shane Drew Soboroff. 2012. Group size and the trust, cohesion, and commitment of group members. Ph. D. Dissertation. The University of Iowa.",
      "doi": ""
    },
    {
      "text": "Paul E Spector. 1997. Job satisfaction: Application, assessment, causes, and consequences. Vol. 3. Sage.",
      "doi": ""
    },
    {
      "text": "Susan Sprecher, Stanislav Treger, Joshua D Wondra, Nicole Hilaire, and Kevin Wallpe. 2013. Taking turns: Reciprocal self-disclosure promotes liking in initial interactions. Journal of Experimental Social Psychology 49, 5 (2013), 860–866.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "J Svennevig. 1999. Getting Acquainted in Conversation: a study of initial interactions. Philadephia. PA: J. Benjamins Publications(1999).",
      "doi": ""
    },
    {
      "text": "Jan Svennevig. 2014. Direct and indirect self-presentation in first conversations. Journal of Language and Social Psychology 33, 3 (2014), 302–327.",
      "doi": ""
    },
    {
      "text": "D Teferra. 2014. Organized Anarchy’: The Enduring Paradigm of University Management.",
      "doi": ""
    },
    {
      "text": "Ambra Trotto and Caroline Hummels. 2013. Engage me, do! Engagement Catalysers to ignite a (design) conversation. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces. 136–145.",
      "doi": "10.1145/2513506.2513521"
    },
    {
      "text": "Franziska Tschan, Norbert K Semmer, and Laurent Inversin. 2004. Work related and“private”social interactions at work. Social Indicators Research 67, 1 (2004), 145–182.",
      "doi": ""
    },
    {
      "text": "Jane Webster and Hayes Ho. 1997. Audience engagement in multimedia presentations. ACM SIGMIS Database: the DATABASE for Advances in Information Systems 28, 2(1997), 63–77.",
      "doi": "10.1145/264701.264706"
    },
    {
      "text": "Etienne Wenger. 2000. Key to knowledge Strategy. Knowledge and communities. Woburn, Butterworth-Heinemann (2000), 3–21.",
      "doi": ""
    },
    {
      "text": "Alex C Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T Iqbal, and Jaime Teevan. 2018. Supporting workplace detachment and reattachment with conversational intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173662"
    },
    {
      "text": "Niels Wouters, John Downs, Mitchell Harrop, Travis Cox, Eduardo Oliveira, Sarah Webber, Frank Vetere, and Andrew Vande Moere. 2016. Uncovering the honeypot effect: How audiences engage with public interactive systems. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 5–16.",
      "doi": "10.1145/2901790.2901796"
    },
    {
      "text": "Susan Yee and Kat S Park. 2005. StudioBRIDGE: using group, location, and event information to bridge online and offline encounters for co-located learning groups. In Proceedings of the SIGCHI conference on Human factors in computing systems. 551–560.",
      "doi": "10.1145/1054972.1055048"
    },
    {
      "text": "Qiang Alex Zhao and John T Stasko. 2000. What’s happening? the community awareness application. In CHI’00 Extended Abstracts on Human Factors in Computing Systems. 253–254.",
      "doi": ""
    },
    {
      "text": "Le Zhou, Jin Park, John D Kammeyer-Mueller, Priti Pradhan Shah, and Elizabeth M Campbell. 2022. Rookies connected: Interpersonal relationships among newcomers, newcomer adjustment processes, and socialization outcomes.Journal of Applied Psychology 107, 3 (2022), 370.",
      "doi": ""
    },
    {
      "text": "Haiyi Zhu, Bowen Yu, Aaron Halfaker, and Loren Terveen. 2018. Value-sensitive algorithm design: Method, case study, and lessons. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–23.",
      "doi": "10.1145/3274463"
    }
  ]
}