{
  "doi": "10.1145/3544548.3581050",
  "title": "What does it mean to cycle in Virtual Reality? Exploring Cycling Fidelity and Control of VR Bicycle Simulators",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Creating highly realistic Virtual Reality (VR) bicycle experiences can be time-consuming and expensive. Moreover, it is unclear what hardware parts are necessary to design a bicycle simulator and whether a bicycle is needed at all. In this paper, we investigated cycling fidelity and control of VR bicycle simulators. For this, we developed and evaluated three cycling simulators: (1) cycling without a bicycle (bikeless), (2) cycling on a fixed (stationary) and (3) moving bicycle (tandem) with four levels of control (no control, steering, pedaling, and steering + pedaling). To evaluate all combinations of fidelity and control, we conducted a controlled experiment (N = 24) in indoor and outdoor settings. We found that the bikeless setup provides the highest feeling of safety, while the tandem leads to the highest realism without increasing motion sickness. Moreover, we discovered that bicycles are not essential for cycling in VR.",
  "authors": [
    {
      "name": "Andrii Matviienko",
      "institution": "Media Technology and Interaction Design, KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-99658734228/rel-imgonly/andrii_2.jpg",
      "acmid": "99658734228",
      "orcid": "0000-0002-6571-0623"
    },
    {
      "name": "Hajris Hoxha",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779875",
      "orcid": "0000-0001-7950-7346"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Telecooperation Lab, Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    }
  ],
  "references": [
    {
      "text": "Shani Batcir, Omri Lubovsky, Yaacov G. Bachner, and Itshak Melzer. 2021. The Effects of Bicycle Simulator Training on Anticipatory and Compensatory Postural Control in Older Adults: Study Protocol for a Single-Blind Randomized Controlled Trial. Frontiers in Neurology 11 (2021), 1869. https://doi.org/10.3389/fneur.2020.614664",
      "doi": ""
    },
    {
      "text": "Shani Batcir, Omri Lubovsky, Yaacov G. Bachner, and Itshak Melzer. 2021. The Effects of Bicycle Simulator Training on Anticipatory and Compensatory Postural Control in Older Adults: Study Protocol for a Single-Blind Randomized Controlled Trial. Frontiers in Neurology 11 (2021). https://doi.org/10.3389/fneur.2020.614664",
      "doi": ""
    },
    {
      "text": "Pauline Bimberg, Tim Weissker, and Alexander Kulik. 2020. On the Usage of the Simulator Sickness Questionnaire for Virtual Reality Research. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). 464–467. https://doi.org/10.1109/VRW50115.2020.00098",
      "doi": ""
    },
    {
      "text": "Martyna Bogacz, Stephane Hess, Chiara Calastri, Charisma F. Choudhury, Alexander Erath, Michael A. B. van Eggermond, Faisal Mushtaq, Mohsen Nazemi, and Muhammad Awais. 2020. Comparison of Cycling Behavior between Keyboard-Controlled and Instrumented Bicycle Experiments in Virtual Reality. Transportation Research Record 2674, 7 (2020), 244–257. https://doi.org/10.1177/0361198120921850",
      "doi": ""
    },
    {
      "text": "Greg Byrd. 2015. Cycling through Cyberspace. Computer 48, 8 (2015), 72–75. https://doi.org/10.1109/MC.2015.220",
      "doi": "10.1109/MC.2015.220"
    },
    {
      "text": "Zekun Cao, Jason Jerald, and Regis Kopper. 2018. Visually-Induced Motion Sickness Reduction via Static and Dynamic Rest Frames. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Reutlingen, 105–112. https://doi.org/10.1109/VR.2018.8446210",
      "doi": ""
    },
    {
      "text": "Polona Caserman, Augusto Garcia-Agundez, Alvar Gámez Zerban, and Stefan Göbel. 2021. Cybersickness in current-generation virtual reality head-mounted displays: systematic review and outlook. Virtual Reality 25, 4 (2021), 1153–1170. https://doi.org/10.1007/s10055-021-00513-6",
      "doi": "10.1007/s10055-021-00513-6"
    },
    {
      "text": "Raphael de Souza e Almeida, Renato Cherullo, Daniel Radetic, Greis Francy M. Silva-Calpa, and Alberto Barbosa Raposo. 2019. Exploring Motor and Sensory Devices in a Bicycle Simulator. In 2019 21st Symposium on Virtual and Augmented Reality (SVR). IEEE, Rio de Janeiro, Brazil, 232–241. https://doi.org/10.1109/SVR.2019.00048",
      "doi": ""
    },
    {
      "text": "L. Dominjon, Anatole Lécuyer, Jean-Marie Burkhardt, Paul Richard, and S. Richir. 2005. Influence of Control/Display Ratio on the Perception of Mass of Manipulated Objects in Virtual Environments. In IEEE International Conference on Virtual Reality. Bonn, Germany, 19–25. https://doi.org/10.1109/VR.2005.1492749",
      "doi": ""
    },
    {
      "text": "Dong-Soo Kwon, Gi-Hun Yang, Chong-Won Lee, Jae-Cheol Shin, Youngjin Park, Byungbo Jung, Doo Yong Lee, Kyungno Lee, Soon-Hung Han, Byoung-Hyun Yoo, Kwang-Yun Wohn, and Jung-Hyun Ahn. 2001. KAIST interactive bicycle simulator. In Proceedings 2001 ICRA. IEEE International Conference on Robotics and Automation, Vol. 3. IEEE, Seoul, South Korea, 2313–2318. https://doi.org/10.1109/ROBOT.2001.932967",
      "doi": ""
    },
    {
      "text": "Natalia Dużmańska, Paweł Strojny, and Agnieszka Strojny. 2018. Can Simulator Sickness Be Avoided? A Review on Temporal Aspects of Simulator Sickness. Frontiers in Psychology 9 (2018), 2132. https://doi.org/10.3389/fpsyg.2018.02132",
      "doi": ""
    },
    {
      "text": "Sarah D’Amour, Jelte E. Bos, and Behrang Keshavarz. 2017. The efficacy of airflow and seat vibration on reducing visually induced motion sickness. Experimental Brain Research 235, 9 (Sept. 2017), 2811–2820. https://doi.org/10.1007/s00221-017-5009-1",
      "doi": ""
    },
    {
      "text": "P. Gamito, Jorge Oliveira, D. Morais, André Baptista, N. Santos, F. Soares, T. Saraiva, and P. Rosa. 2010. Training presence: the importance of virtual reality experience on the \"sense of being there\".Studies in health technology and informatics 154 (2010), 128–33.",
      "doi": ""
    },
    {
      "text": "Germán Gálvez-García, Marion Hay, and Catherine Gabaude. 2015. Alleviating Simulator Sickness with Galvanic Cutaneous Stimulation. Human Factors 57, 4 (2015), 649–657. https://doi.org/10.1177/0018720814554948",
      "doi": ""
    },
    {
      "text": "Ayah Hamad. 2021. Two Wheelistic: Development of a High-Fidelity Virtual Reality Cycling Simulator for Transportation Safety Research. Ph. D. Dissertation. University of Michigan-Dearborn. https://doi.org/10.7302/1035",
      "doi": ""
    },
    {
      "text": "Jake Harrington, Benjamin Williams, and Christopher Headleand. 2019. A Somatic Approach to Combating Cybersickness Utilising Airflow Feedback. Computer Graphics and Visual Computing (CGVC) (2019), 9 pages. https://doi.org/10.2312/CGVC.20191256",
      "doi": ""
    },
    {
      "text": "G. Hernández–Melgarejo, D. A. Flores–Hernández, A. Luviano–Juárez, L. A. Castañeda, I. Chairez, and S. Di Gennaro. 2020. Mechatronic design and implementation of a bicycle virtual reality system. ISA Transactions 97 (Feb. 2020), 336–351. https://doi.org/10.1016/j.isatra.2019.08.002",
      "doi": ""
    },
    {
      "text": "R. Herpers, W. Heiden, M. Kutz, D. Scherfgen, U. Hartmann, J. Bongartz, and O. Schulzyk. 2008. FIVIS Bicycle Simulator: An Immersive Game Platform for Physical Activities. In Proceedings of the 2008 Conference on Future Play: Research, Play, Share (Toronto, Ontario, Canada) (Future Play ’08). Association for Computing Machinery, New York, NY, USA, 244–247. https://doi.org/10.1145/1496984.1497035",
      "doi": "10.1145/1496984.1497035"
    },
    {
      "text": "R. Herpers, W. Heiden, M. Kutz, D. Scherfgen, U. Hartmann, J. Bongartz, and O. Schulzyk. 2008. FIVIS Bicycle Simulator: An Immersive Game Platform for Physical Activities. In Proceedings of the 2008 Conference on Future Play: Research, Play, Share (Toronto, Ontario, Canada) (Future Play ’08). Association for Computing Machinery, New York, NY, USA, 244–247. https://doi.org/10.1145/1496984.1497035",
      "doi": "10.1145/1496984.1497035"
    },
    {
      "text": "Heather Kaths, Andreas Keler, Jakob Kaths, and Fritz Busch. 2019. Analyzing the behavior of bicyclists using a bicycle simulator with a coupled SUMO and DYNA4 simulated environment., 199–205 pages.",
      "doi": ""
    },
    {
      "text": "S. Katsigiannis, R. Willis, and N. Ramzan. 2019. A QoE and Simulator Sickness Evaluation of a Smart-Exercise-Bike Virtual Reality System via User Feedback and Physiological Signals. IEEE Transactions on Consumer Electronics 65, 1 (Feb. 2019), 119–127. https://doi.org/10.1109/TCE.2018.2879065",
      "doi": "10.1109/TCE.2018.2879065"
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203–220. https://doi.org/10.1207/s15327108ijap0303_3",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, Alexander Marquardt, Christina Trepkowski, Robert W. Lindeman, Andre Hinkenjann, Jens Maiero, and Bernhard E. Riecke. 2016. On Your Feet! Enhancing Vection in Leaning-Based Interfaces through Multisensory Stimuli. In Proceedings of the 2016 Symposium on Spatial User Interaction (Tokyo, Japan) (SUI ’16). Association for Computing Machinery, New York, NY, USA, 149–158. https://doi.org/10.1145/2983310.2985759",
      "doi": "10.1145/2983310.2985759"
    },
    {
      "text": "Joseph J. LaViola. 2000. A Discussion of Cybersickness in Virtual Environments. SIGCHI Bull. 32, 1 (Jan. 2000), 47–56. https://doi.org/10.1145/333329.333344",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "Mertens Lieze, Van Cauwenberg Jelle, Deforche Benedicte, Van de Weghe Nico, Matthys Mario, and Delfien Van Dyck. 2020. Using virtual reality to investigate physical environmental factors related to cycling in older adults: A comparison between two methodologies. Journal of Transport & Health 19 (Dec. 2020), 100921. https://doi.org/10.1016/j.jth.2020.100921",
      "doi": ""
    },
    {
      "text": "Kyungmin Lim, Jaesung Lee, Kwanghyun Won, Nupur Kala, and Tammy Lee. 2020. A novel method for VR sickness reduction based on dynamic field of view processing. Virtual Reality (July 2020). https://doi.org/10.1007/s10055-020-00457-3",
      "doi": "10.1007/s10055-020-00457-3"
    },
    {
      "text": "Markus Löchtefeld, Antonio Krüger, and Hans Gellersen. 2016. DeceptiBike: Assessing the Perception of Speed Deception in a Virtual Reality Training Bike System. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 40, 10 pages. https://doi.org/10.1145/2971485.2971513",
      "doi": "10.1145/2971485.2971513"
    },
    {
      "text": "T. Maeda, H. Ando, and M. Sugimoto. 2005. Virtual acceleration with galvanic vestibular stimulation in a virtual reality environment. In IEEE Proceedings. VR 2005. Virtual Reality, 2005.289–290. https://doi.org/10.1109/VR.2005.1492799",
      "doi": ""
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Shadan Sadeghian Borojeni, Yannick Feld, Wilko Heuten, and Susanne Boll. 2018. Augmenting Bicycles and Helmets with Multimodal Warnings for Children. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 15, 13 pages. https://doi.org/10.1145/3229434.3229479",
      "doi": "10.1145/3229434.3229479"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Stephen Brewster, Wilko Heuten, and Susanne Boll. 2019. Comparing Unimodal Lane Keeping Cues for Child Cyclists. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia (Pisa, Italy) (MUM ’19). Association for Computing Machinery, New York, NY, USA, Article 14, 11 pages. https://doi.org/10.1145/3365610.3365632",
      "doi": "10.1145/3365610.3365632"
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2019. NaviBike: Comparing Unimodal Navigation Cues for Child Cyclists. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300850",
      "doi": "10.1145/3290605.3300850"
    },
    {
      "text": "Andrii Matviienko, Damir Mehmedovic, Florian Müller, and Max Mühlhäuser. 2022. \"Baby, You can Ride my Bike\": Exploring Maneuver Indications of Self-Driving Bicycles using a Tandem Simulator(MobileHCI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3546723",
      "doi": "10.1145/3546723"
    },
    {
      "text": "Andrii Matviienko, Florian Müller, Dominik Schön, Paul Seesemann, Sebastian Günther, and Max Mühlhäuser. 2022. BikeAR: Understanding Cyclists’ Crossing Decision-Making at Uncontrolled Intersections Using Augmented Reality. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 366, 15 pages. https://doi.org/10.1145/3491102.3517560",
      "doi": "10.1145/3491102.3517560"
    },
    {
      "text": "Andrii Matviienko, Florian Müller, Marcel Zickler, Lisa Alina Gasche, Julia Abels, Till Steinert, and Max Mühlhäuser. 2022. Reducing Virtual Reality Sickness for Cyclists in VR Bicycle Simulators. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 187, 14 pages. https://doi.org/10.1145/3491102.3501959",
      "doi": "10.1145/3491102.3501959"
    },
    {
      "text": "Miguel Melo, Tânia Rocha, Luís Barbosa, and Maximino Bessa. 2016. Presence in virtual environments: Objective metrics vs. subjective metrics — A pilot study. In 2016 23rd Portuguese Meeting on Computer Graphics and Interaction (EPCGI). IEEE, Guimarães, Portugal, 1–6. https://doi.org/10.1109/EPCGI.2016.7851200",
      "doi": ""
    },
    {
      "text": "Justin Mittelstaedt, Jan Wacker, and Dirk Stelling. 2018. Effects of display type and motion control on cybersickness in a virtual bike simulator. Displays 51(2018), 43–50. https://doi.org/10.1016/j.displa.2018.01.002",
      "doi": ""
    },
    {
      "text": "M. Nazemi, M.A.B. van Eggermond, A. Erath, D. Schaffner, M. Joos, and Kay W. Axhausen. 2021. Studying bicyclists’ perceived level of safety using a bicycle simulator combined with immersive virtual reality. Accident Analysis & Prevention 151 (2021), 105943. https://doi.org/10.1016/j.aap.2020.105943",
      "doi": ""
    },
    {
      "text": "Steve O’Hern, Jennie Oxley, and Mark Stevenson. 2017. Validation of a bicycle simulator for road safety research. Accident Analysis & Prevention 100 (2017), 53–58. https://doi.org/10.1016/j.aap.2017.01.002",
      "doi": ""
    },
    {
      "text": "Andrew Paroz and Leigh Ellen Potter. 2018. Impact of air flow and a hybrid locomotion system on cybersickness. In Proceedings of the 30th Australian Conference on Computer-Human Interaction. ACM, Melbourne Australia, 582–586. https://doi.org/10.1145/3292147.3292229",
      "doi": "10.1145/3292147.3292229"
    },
    {
      "text": "Yi-Hao Peng, Carolyn Yu, Shi-Hong Liu, Chung-Wei Wang, Paul Taele, Neng-Hao Yu, and Mike Y. Chen. 2020. WalkingVibe: Reducing Virtual Reality Sickness and Improving Realism While Walking in VR Using Unobtrusive Head-Mounted Vibrotactile Feedback. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376847",
      "doi": "10.1145/3313831.3376847"
    },
    {
      "text": "Lisa Rebenitsch and Charles Owen. 2016. Review on cybersickness in applications and visual displays. Virtual Reality 20, 2 (2016), 101–125. https://doi.org/10.1007/s10055-016-0285-9",
      "doi": "10.1007/s10055-016-0285-9"
    },
    {
      "text": "Filip Schramka, Stefan Arisona, Michael Joos, and Alexander Erath. 2017. Development of Virtual Reality Cycling Simulator. (2017). https://doi.org/10.3929/ethz-b-000129869",
      "doi": ""
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The Experience of Presence: Factor Analytic Insights. Presence: Teleoperators and Virtual Environments 10, 3 (06 2001), 266–281. https://doi.org/10.1162/105474601300343603",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Robin S. Sharp. 2008. On the Stability and Control of the Bicycle. Applied Mechanics Reviews 61, 6 (10 2008). https://doi.org/10.1115/1.2983014 arXiv:https://asmedigitalcollection.asme.org/appliedmechanicsreviews/article-pdf/61/6/060803/5442322/060803_1.pdf060803.",
      "doi": ""
    },
    {
      "text": "Murad M. Shoman and Hocine Imine. 2021. Bicycle Simulator Improvement and Validation. IEEE Access 9(2021), 55063–55076. https://doi.org/10.1109/ACCESS.2021.3071214",
      "doi": ""
    },
    {
      "text": "Chul Gyu Song, Jong Yun Kim, and Nam Gyun Kim. 2004. A new postural balance control system for rehabilitation training based on virtual cycling. IEEE Transactions on Information Technology in Biomedicine 8, 2(2004), 200–207. https://doi.org/10.1109/TITB.2004.828887",
      "doi": "10.1109/TITB.2004.828887"
    },
    {
      "text": "Kay M. Stanney, Robert S. Kennedy, and Julie M. Drexler. 1997. Cybersickness is Not Simulator Sickness. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 41, 2(1997), 1138–1142. https://doi.org/10.1177/107118139704100292",
      "doi": ""
    },
    {
      "text": "Carlos Sun and Zhu Qing. 2018. Design and Construction of a Virtual Bicycle Simulator for Evaluating Sustainable Facilities Design. Advances in Civil Engineering 2018 (2018). https://doi.org/10.1155/2018/5735820",
      "doi": ""
    },
    {
      "text": "Sung Hwan Jeong, Yong Jun Piao, Woo Suk Chong, Yong Yook Kim, Sang Min Lee, Tae Kyu Kwon, Chul Un Hong, and Nam Gyun Kim. 2005. The Development of a New Training System for Improving Equilibrium Sense Using a Virtual Bicycle Simulator. In 2005 IEEE Engineering in Medicine and Biology 27th Annual Conference. 2567–2570. https://doi.org/10.1109/IEMBS.2005.1616993",
      "doi": ""
    },
    {
      "text": "Léo Terziman, Maud Marchal, Franck Multon, Bruno Arnaldi, and Anatole Lecuyer. 2012. The King-Kong Effects: Improving sensation of walking in VR with visual and tactile vibrations at each step. In 2012 IEEE Symposium on 3D User Interfaces (3DUI). 19–26. https://doi.org/10.1109/3DUI.2012.6184179",
      "doi": ""
    },
    {
      "text": "Daniela Ullmann, Julian Kreimeier, Timo Götzelmann, and Harald Kipke. 2020. BikeVR: A Virtual Reality Bicycle Simulator towards Sustainable Urban Space and Traffic Planning. In Proceedings of the Conference on Mensch Und Computer (Magdeburg, Germany) (MuC ’20). Association for Computing Machinery, New York, NY, USA, 511–514. https://doi.org/10.1145/3404983.3410417",
      "doi": "10.1145/3404983.3410417"
    },
    {
      "text": "Marnix van Gisbergen, Michelle Kovacs, Fabio Campos, Malou van der Heeft, and Valerie Vugts. 2019. What We Don’t Know. The Effect of Realism in Virtual Reality on Experience and Behaviour. Springer International Publishing, Cham, 45–57. https://doi.org/10.1007/978-3-030-06246-0_4",
      "doi": ""
    },
    {
      "text": "Tamara von Sawitzky, Philipp Wintersberger, Andreas Löcken, Anna-Katharina Frison, and Andreas Riener. 2020. Augmentation Concepts with HUDs for Cyclists to Improve Road Safety in Shared Spaces. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3383022",
      "doi": "10.1145/3334480.3383022"
    },
    {
      "text": "Séamas Weech, Jae Moon, and Nikolaus F. Troje. 2018. Influence of bone-conducted vibration on simulator sickness in virtual reality. PLOS ONE 13, 3 (03 2018), 1–21. https://doi.org/10.1371/journal.pone.0194137",
      "doi": ""
    },
    {
      "text": "Séamas Weech and Nikolaus F. Troje. 2017. Vection Latency Is Reduced by Bone-Conducted Vibration and Noisy Galvanic Vestibular Stimulation. Multisensory Research 30, 1 (2017), 65 – 90. https://doi.org/10.1163/22134808-00002545",
      "doi": ""
    },
    {
      "text": "B. E. Westerhof, E. J. H. de Vries, R. Happee, and Arend Schwab. 2020. Evaluation of a Motorcycle Simulator. https://doi.org/10.6084/m9.figshare.11744328.v1",
      "doi": ""
    },
    {
      "text": "Philipp Wintersberger, Andrii Matviienko, Andreas Schweidler, and Florian Michahelles. 2022. Development and Evaluation of a Motion-based VR Bicycle Simulator(MobileHCI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3546745",
      "doi": "10.1145/3546745"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Paweł W. Woźniak, Lex Dekker, Francisco Kiss, Ella Velner, Andrea Kuijt, and Stella F. Donker. 2020. Brotate and Tribike: Designing Smartphone Control for Cycling. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 23, 12 pages. https://doi.org/10.1145/3379503.3405660",
      "doi": "10.1145/3379503.3405660"
    },
    {
      "text": "Tetsuji Yamaguchi, Akira Yamada, Takeshi Fujiwara, Ryoichi Takahashi, Tetsuya Shimada, Yuki Ishida, Koichiro Ueda, and Shigeo Kaneda. 2018. Development of Bicycle Simulator with Tilt Angle Control Tilt Angle. Proceedings - International Computer Software and Applications Conference 2 (2018), 247–252. https://doi.org/10.1109/COMPSAC.2018.10238",
      "doi": ""
    },
    {
      "text": "Hwa Jen Yap, Tan Cee Hau, Zahari Taha, Chang Siow Wee, Sivadas Chanda Sekaran, and Wan Wei Lim. 2018. Design and development of a spatial immersive track cycling simulator. Malaysian Journal of Movement, Health & Exercise 7, 2 (2018). https://doi.org/10.15282/mohe.v7i2.217",
      "doi": ""
    }
  ]
}