{
  "doi": "10.1145/3544548.3581528",
  "title": "Mental Wellbeing at Work: Perspectives of Software Engineers",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Software engineers exhibit higher burnout and suicide rates compared to many other information workers. Consequently, mental wellbeing is a growing concern to technology organizations. To better understand the challenges of supporting mental wellbeing in the context of the work of software engineering, we conducted 14 interviews with software engineers. We examine the different aspects of their lived experiences with mental wellbeing at work, their strategies for managing mental wellbeing, the challenges they face in using these strategies, and recommendations they have for mental wellbeing technologies. We contribute to the HCI literature by discussing how mental wellbeing should be considered within the context of work across individual, team, and organization levels, and highlight the need for integrating mental wellbeing into the technologies employees use at work.",
  "tags": [
    "Empirical study that tells us about people",
    "Interview",
    "Health-wellbeing",
    "Workplaces"
  ],
  "authors": [
    {
      "name": "Novia Wong",
      "institution": "Informatics, University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660641474",
      "orcid": "0000-0003-3226-4636"
    },
    {
      "name": "Victoria Jackson",
      "institution": "Informatics, University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-99660520077/rel-imgonly/biopicchase.png",
      "acmid": "99660520077",
      "orcid": "0000-0002-6326-931X"
    },
    {
      "name": "André Van Der Hoek",
      "institution": "Informatics, University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595059",
      "orcid": "0000-0001-7917-932X"
    },
    {
      "name": "Iftekhar Ahmed",
      "institution": "Informatics, University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-99658635503/rel-imgonly/99658635503.jpg",
      "acmid": "99658635503",
      "orcid": "0000-0001-8221-5352"
    },
    {
      "name": "Stephen M. Schueller",
      "institution": "Psychological Science, University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658749229",
      "orcid": "0000-0002-1003-0399"
    },
    {
      "name": "Madhu Reddy",
      "institution": "Informatics, University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340492349",
      "orcid": "0000-0002-6330-3637"
    }
  ],
  "references": [
    {
      "text": "Daniel A Adler, Emily Tseng, Khatiya C Moon, John Q Young, John M Kane, Emanuel Moss, David C Mohr, and Tanzeem Choudhury. 2022. Burnout and the Quantified Workplace: Tensions around Personal Sensing Interventions for Stress in Resident Physicians. Proceedings of the ACM on Human-Computer Interaction 6 (2022), 1–48. Issue CSCW2. https://doi.org/10.1145/3555531",
      "doi": "10.1145/3555531"
    },
    {
      "text": "Fatema Akbar, Gloria Mark, Ioannis Pavlidis, and Ricardo Gutierrez-Osuna. 2019. An empirical study comparing unobtrusive physiological sensors for stress detection in computer work. Sensors (Switzerland) 19 (9 2019), 3667. Issue 17. https://doi.org/10.3390/s19173766",
      "doi": ""
    },
    {
      "text": "Junade Ali. 2021. 83% of Developers Suffer From Burnout, Haystack Analytics Study Finds. https://www.usehaystack.io/blog/83-of-developers-suffer-from-burnout-haystack-analytics-study-finds",
      "doi": ""
    },
    {
      "text": "Mary Jean Amon, Stephen Mattingly, Aaron Necaise, Gloria Mark, Nitesh Chawla, Anind Dey, and Sidney D’mello. 2022. Flexibility Versus Routineness in Multimodal Health Indicators: A Sensor-based Longitudinal in Situ Study of Information Workers. ACM Transactions on Computing for Healthcare 3 (7 2022), 1–27. Issue 3. https://doi.org/10.1145/3514259",
      "doi": "10.1145/3514259"
    },
    {
      "text": "Apple. 2022. Use Apple Watch to practice mindfulness. https://support.apple.com/guide/watch/practice-mindfulness-apd371dfe3d7/watchos",
      "doi": ""
    },
    {
      "text": "Marcus Ash, Kagonya Awori, Nancy Baym, Mia Bruch, Jenna Butler, Piali Choudhury, Adam Coleman, Scott Counts, Shiraz Cupala, Mary Czerwinski, Ed Doran, Elizabeth Fetterolf, Mar Gonzalez Franco, Kunal Gupta, Aaron Halfaker, Constance Hadler, Brent Hecht, Brian Houck, Kori Inkpen, Shamsi Iqbal, Sonia Jaffe, Erin Knudsen, Stacey Levine, Siân Lindley, Jennifer Neville, Jacki O’Neill, Kate Nowak, Rick Pollak, Victor Poznanski, Sean Rintel, Abigail Sellen, Neha Shah, Siddharth Suri, Jaime Teevan, Adam Troy, Mengtin Wan, and Longqi Yang. 2022. Microsoft New Future of Work Report 2022: A summary of recent research from Microsoft and around the world that can help us create a new and better future of work.Technical Report. Microsoft. https://aka.ms/nfw2022",
      "doi": ""
    },
    {
      "text": "Atlassian. 2022. Agile Retrospectives. https://www.atlassian.com/agile/scrum/retrospectives",
      "doi": ""
    },
    {
      "text": "Arnold B Bakker and Evangelia Demerouti. 2013. The spillover-crossover model. Psychology Press, London, 54–70.",
      "doi": ""
    },
    {
      "text": "Ida Bark, Asbjørn Følstad, and Jan Gulliksen. 2006. Use and Usefulness of HCI Methods: Results from an Exploratory Study among Nordic HCI Practitioners. People and Computers XIX — The Bigger Picture (2006), 201–217. https://doi.org/10.1007/1-84628-249-7_13",
      "doi": ""
    },
    {
      "text": "Arpita Bhattacharya. 2019. Designing to Support Teen Mental Health Using Asynchronous Online Groups. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. ACM, New York, NY, USA, 723–727. https://doi.org/10.1145/3311927.3325352",
      "doi": "10.1145/3311927.3325352"
    },
    {
      "text": "Inger Boivie, Stefan Blomkvist, Jenny Persson, and Carl Åborg. 2003. Addressing users’ health issues in software development – an exploratory study. Behaviour and Information Technology 22, 6 (2003), 411–420. https://doi.org/10.1080/01449290310001624347",
      "doi": ""
    },
    {
      "text": "Toni Bonitto. 2022. An Introduction to Accessibility. https://digital.gov/resources/introduction-accessibility/",
      "doi": ""
    },
    {
      "text": "Judith Borghouts, Elizabeth Eikey, Gloria Mark, Cinthia De Leon, Stephen M Schueller, Margaret Schneider, Nicole Stadnick, Kai Zheng, Dana Mukamel, and Dara H Sorkin. 2021. Barriers to and Facilitators of User Engagement With Digital Mental Health Interventions: Systematic Review. Journal of Medical Internet Research 23 (3 2021), e24387. Issue 3. https://doi.org/10.2196/24387",
      "doi": ""
    },
    {
      "text": "Urie Bronfenbrenner. 1977. Toward an experimental ecology of human development.American Psychologist 32 (7 1977), 513–531. Issue 7. https://doi.org/10.1037/0003-066X.32.7.513",
      "doi": ""
    },
    {
      "text": "Fabio Calefato and Filippo Lanubile. 2016. A Hub-and-Spoke Model for Tool Integration in Distributed Development. In 2016 IEEE 11th International Conference on Global Software Engineering (ICGSE). IEEE, Orange County, CA, USA, 129–133. https://doi.org/10.1109/ICGSE.2016.12",
      "doi": ""
    },
    {
      "text": "Calm. 2022. Calm. https://www.calm.com/",
      "doi": ""
    },
    {
      "text": "Yekta Said Can, Bert Arnrich, and Cem Ersoy. 2019. Stress detection in daily life scenarios using smart phones and wearable sensors: A survey. Journal of Biomedical Informatics 92 (4 2019), 103139. https://doi.org/10.1016/j.jbi.2019.103139",
      "doi": "10.1016/j.jbi.2019.103139"
    },
    {
      "text": "CBS. 2016. These jobs have the highest rate of suicide. https://www.cbsnews.com/news/these-jobs-have-the-highest-rate-of-suicide/",
      "doi": ""
    },
    {
      "text": "R Kevin Chapman. 2022. Mental Health in the Workplace: A Continuing Conversation. In Proceedings of the 2022 ACM SIGUCCS Annual Conference. ACM, New York, NY, USA, 38–38. https://doi.org/10.1145/3501292.3511574",
      "doi": "10.1145/3501292.3511574"
    },
    {
      "text": "Jing Chen, Lu Huang, and Shuangyan Luo. 2019. Relationship between Job Burnout and Emotional Intelligence Based on \"Job Demands-Resources\" Model. In Proceedings of 2019 Annual Meeting on Management Engineering (AMME2019). ACM, New York, NY, USA, 107–114. https://doi.org/10.1145/3377672.3378044",
      "doi": "10.1145/3377672.3378044"
    },
    {
      "text": "Ian Cook. 2021. Who Is Driving the Great Resignation?https://hbr.org/2021/09/who-is-driving-the-great-resignation",
      "doi": ""
    },
    {
      "text": "Cary L. Cooper and Sue Cartwright. 1997. An intervention strategy for workplace stress. Journal of Psychosomatic Research 43 (7 1997), 7–16. Issue 1. https://doi.org/10.1016/S0022-3999(96)00392-3",
      "doi": ""
    },
    {
      "text": "Sandun Dasanayake, Sanja Aaramaa, Jouni Markkula, and Markku Oivo. 2019. Impact of requirements volatility on software architecture: How do software teams keep up with ever-changing requirements?Journal of Software: Evolution and Process 31, 6 (2019), 633–655. https://doi.org/10.48550/arXiv.1904.08164",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2008. Hedonia, eudaimonia, and well-being: an introduction. Journal of Happiness Studies 9 (1 2008), 1–11. Issue 1. https://doi.org/10.1007/s10902-006-9018-1",
      "doi": ""
    },
    {
      "text": "Delphis. 2020. The Mental Health Continuum is a Better Model for Mental Health. https://delphis.org.uk/mental-health/continuum-mental-health/",
      "doi": ""
    },
    {
      "text": "Jeff Elder. 2022. Buzzkill: Tech companies grapple with workers getting high on the job. https://www.sfexaminer.com/archives/buzzkill-tech-companies-grapple-with-workers-getting-high-on-the-job/article_ef1f4294-0651-5e0b-bfd8-7ac8c1bcb843.html",
      "doi": ""
    },
    {
      "text": "Jennifer Elias. 2020. Google tells employees to take Friday off as a ‘collective wellbeing’ holiday during pandemic. CNBC (9 2020). https://www.cnbc.com/2020/09/03/google-tells-employees-to-take-friday-off-for-collective-wellbeing.html",
      "doi": ""
    },
    {
      "text": "Don Samitha Elvitigala, Philipp M. Scholl, Hussel Suriyaarachchi, Vipula Dissanayake, and Suranga Nanayakkara. 2021. StressShoe: A DIY Toolkit for just-in-time Personalised Stress Interventions for Office Workers Performing Sedentary Tasks. In Proceedings of the 23rd International Conference on Mobile Human-Computer Interaction. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3447526.3472023",
      "doi": "10.1145/3447526.3472023"
    },
    {
      "text": "Madeline Endres, Kevin Boehnke, and Westley Weimer. 2022. Hashing It Out: A Survey of Programmers’ Cannabis Usage, Perception, and Motivation. In Proceedings of The 44th International Conference on Software Engineering (ICSE 2022), Vol. 2657. ACM, New York, NY, USA. https://doi.org/10.48550/arXiv.2112.09365",
      "doi": "10.1145/3510003.3510156"
    },
    {
      "text": "Jordan Eschler, Eleanor R Burgess, Madhu Reddy, and David C Mohr. 2020. Emergent Self-Regulation Practices in Technology and Social Media Use of Individuals Living with Depression. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA. https://doi.org/10.1145/3313831.3376773",
      "doi": "10.1145/3313831.3376773"
    },
    {
      "text": "S. L. Ettner and J. G. Grzywacz. 2001. Workers’ perceptions of how jobs affect health: a social ecological perspective.Journal of occupational health psychology 6 (2001), 101–113. Issue 2. https://doi.org/10.1037/1076-8998.6.2.101",
      "doi": ""
    },
    {
      "text": "Marcus J. Fila. 2016. Work Stress: A Review, Analysis, and Extension of the Job Demands-Control (-Support) Model. Ph. D. Dissertation. Western Michigan University, Kalamazoo, MI. 1620.",
      "doi": ""
    },
    {
      "text": "Arlene Fink. 2017. How To Conduct Surveys(6 ed.). SAGE Publications, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Center for Disease Control and Prevention. 2022. About Mental Health. https://www.cdc.gov/mentalhealth/learn/index.htm",
      "doi": ""
    },
    {
      "text": "Denae Ford, Margaret-Anne Storey, Thomas Zimmermann, Christian Bird, Sonia Jaffe, Chandra Maddila, Jenna L Butler, Brian Houck, and Nachiappan Nagappan. 2021. A Tale of Two Cities: Software Developers Working from Home during the COVID-19 Pandemic. ACM Trans. Softw. Eng. Methodol 31 (2021). Issue 2. https://doi.org/10.1145/3487567",
      "doi": "10.1145/3487567"
    },
    {
      "text": "Nicole Forsgren, Margaret-Anne Storey, Chandra Maddila, Thomas Zimmermann, Brian Houck, and Jenna Butler. 2021. The SPACE of Developer Productivity. ACM Queue 19 (3 2021). Issue 1.",
      "doi": ""
    },
    {
      "text": "Michelle Fox. 2022. Employers boost mental wellness benefits amid the Great Resignation. https://www.cnbc.com/2022/05/05/employers-boost-mental-wellness-benefits-amid-the-great-resignation.html",
      "doi": ""
    },
    {
      "text": "Silvana Galderisi, Andreas Heinz, Marianne Kastrup, Julian Beezhold, and Norman Sartorius. 2015. Toward a new definition of mental health. World Psychiatry 14(2015), 231–233. Issue 2. https://doi.org/10.1002/wps.20231",
      "doi": ""
    },
    {
      "text": "Garmin. 2022. What Is the Stress Level Feature on My Garmin Device?https://support.garmin.com",
      "doi": ""
    },
    {
      "text": "Pavlína Wurzel Gonçalves and Alberto Bacchelli. 2022. Interpersonal Conflicts During Code Review Developers’ Experience and Practices. Proceedings of the ACM on Human-Computer Interaction 6 (2022). https://doi.org/10.5281/zenodo.5848794",
      "doi": ""
    },
    {
      "text": "Daniel Graziotin and Fabian Fagerholm. 2019. Happiness and the Productivity of Software Engineers. Apress, Berkeley, CA, 109–124. https://doi.org/10.1007/978-1-4842-4221-6_10",
      "doi": ""
    },
    {
      "text": "Daniel Graziotin, Fabian Fagerholm, Xiaofeng Wang, and Pekka Abrahamsson. 2018. What happens when software developers are (un)happy. Journal of Systems and Software 140 (6 2018), 32–47. https://doi.org/10.1016/j.jss.2018.02.041",
      "doi": ""
    },
    {
      "text": "Daniel Graziotin, Xiaofeng Wang, and Pekka Abrahamsson. 2013. Are Happy Developers more Productive? The Correlation of Affective States of Software Developers and their self-assessed Productivity. In Proceedings of the 14th International Conference on Product-Focused Software Process Improvement (PROFES 2013), J. Heidrich, M. Oivo, and M.T. Jedlitschka A.Baldassarre (Eds.). Springer, Berlin, 50–64.",
      "doi": ""
    },
    {
      "text": "Kelly Greenwood and Julia Anas. 2021. It’s a New Era for Mental Health at Work. https://hbr.org/2021/10/its-a-new-era-for-mental-health-at-work",
      "doi": ""
    },
    {
      "text": "Michaela Greiler, Margaret-Anne Storey, and Abi Noda. 2021. An Actionable Framework for Understanding and Improving Developer Experience. JOURNAL OF TRANSACTION ON SOFTWARE ENGINEERING (2021). https://github.com/get-dx/",
      "doi": ""
    },
    {
      "text": "Christiane Grunloh, Miriam Cabrita, Carina Dantas, and Sofia Ortet. 2022. Opportunities, ethical challenges, and value implications of pervasive sensing technology for supporting older adults in the work environment. Australasian Journal of Information Systems(2022). https://doi.org/10.3127/ajis.v26i0.3133",
      "doi": ""
    },
    {
      "text": "Joseph G. Grzywacz, David M. Almeida, and Daniel A. McDonald. 2002. Work-Family Spillover and Daily Reports of Work and Family Stress in the Adult Labor Force. Family Relations 51 (1 2002), 28–36. Issue 1. https://doi.org/10.1111/j.1741-3729.2002.00028.x",
      "doi": ""
    },
    {
      "text": "Donald W. De Guerre, Merrelyn Emery, Peter Aughton, and Andrew S. Trull. 2008. Structure underlies other organizational determinants of mental health: Recent results confirm early sociotechnical systems research. Systemic Practice and Action Research 21 (10 2008), 359–379. Issue 5. https://doi.org/10.1007/s11213-008-9101-0",
      "doi": ""
    },
    {
      "text": "Jan Alexander Hausser, Andreas Mojzisch, Miriam Niesel, and Stefan SchulzHardt. 2010. Ten years on: A review of recent research on the Job Demand–Control (-Support) model and psychological well-being. Work and Stress (2010). https://doi.org/10.1080/02678371003683747",
      "doi": ""
    },
    {
      "text": "Headspace. 2022. Headspace. https://www.headspace.com/",
      "doi": ""
    },
    {
      "text": "World Health Organization Mental Healthand Substance Use. 2022. World mental health report: Transforming mental health for all - executive summary. Technical Report.",
      "doi": ""
    },
    {
      "text": "Clara E. Hill, Barbara J. Thompson, and Elizabeth Nutt Williams. 1997. A Guide to Conducting Consensual Qualitative Research. The Counseling Psychologist 25 (10 1997), 517–572. Issue 4. https://doi.org/10.1177/0011000097254001",
      "doi": ""
    },
    {
      "text": "Esther Howe, Jina Suh, Mehrab Bin Morshed, Daniel McDuff, Kael Rowan, Javier Hernandez, Marah Ihab Abdin, Gonzalo Ramos, Tracy Tran, and Mary P Czerwinski. 2022. Design of Digital Workplace Stress-Reduction Intervention Systems: Effects of Intervention Type and Timing. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery (ACM), New York, NY, USA, 1–16. https://doi.org/10.1145/3491102.3502027",
      "doi": "10.1145/3491102.3502027"
    },
    {
      "text": "Chioma Iwunze. 2021. Remote Software Developers and Mental Health. https://www.gitkraken.com/blog/remote-software-developers",
      "doi": ""
    },
    {
      "text": "Eunkyung Jo, Austin L. Toombs, Colin M. Gray, and Hwajung Hong. 2020. Understanding Parenting Stress through Co-designed Self-Trackers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376359",
      "doi": "10.1145/3313831.3376359"
    },
    {
      "text": "Brittany Johnson, Thomas Zimmermann, and Christian Bird. 2019. The Effect of Work Environments on Productivity and Satisfaction of Software Engineers. IEEE Transactions on Software Engineering 47 (2019), 736–757. Issue 4. https://doi.org/10.1109/TSE.2019.2903053",
      "doi": ""
    },
    {
      "text": "Eirini Kalliamvakou. 2021. Octoverse Spotlight 2021: The Good Day Project—Personal analytics to make your work days better. https://github.blog/2021-05-25-octoverse-spotlight-good-day-project/",
      "doi": ""
    },
    {
      "text": "Jodi Kantor and Arya Sundaram. 2022. The Rise of the Worker Productivity Score. https://www.nytimes.com/interactive/2022/08/14/business/worker-productivity-tracking.html",
      "doi": ""
    },
    {
      "text": "Dennis L. Kappen and Rita Orji. 2017. Gamified and Persuasive Systems as Behavior Change Agents for Health and Wellness. XRDS 24, 1 (sep 2017), 52–55. https://doi.org/10.1145/3123750",
      "doi": "10.1145/3123750"
    },
    {
      "text": "Robert Karasek and Tores Theorell. 1990. Healthy work : stress, productivity, and the reconstruction of working life. New York: Basic Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Simon Karlsson, Ottilia Olsson, and Maria Normark. 2022. \"I feel like I’ve never really achieved it\": A critical analysis of persuasive design patterns in mindfulness applications. In Nordic Human-Computer Interaction Conference (NordiCHI ’22). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3546155.3546678",
      "doi": "10.1145/3546155.3546678"
    },
    {
      "text": "Harmanpreet Kaur, Alex C Williams, Daniel McDuff, Mary Czerwinski, Jaime Teevan, and Shamsi T Iqbal. 2020. Optimizing for Happiness and Productivity: Modeling Opportune Moments for Transitions and Breaks at Work. CHI’20 (2020). https://doi.org/10.1145/3313831.3376817",
      "doi": "10.1145/3313831.3376817"
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for mental wellness: Understanding expert perspectives and student experiences. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2017-May. Association for Computing Machinery, New York, NY, USA, 629–641. https://doi.org/10.1145/3025453.3025750",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Corey L M Keyes. 2002. The mental health continuum: from languishing to flourishing in life.Journal of health and social behavior 43 (6 2002), 207–22. Issue 2.",
      "doi": ""
    },
    {
      "text": "Corey L M Keyes. 2002. Selecting Outcomes for the Sociology of Mental Health: Issues of Measurement and Dimensionality. Technical Report. 207–222pages. Issue 2.",
      "doi": ""
    },
    {
      "text": "Gail Kinman and Fiona Jones. 2005. Lay representations of workplace stress: What do people really mean when they say they are stressed?Work and Stress 19 (4 2005), 101–120. Issue 2. https://doi.org/10.1080/02678370500144831",
      "doi": ""
    },
    {
      "text": "Rachel Kornfield, Jonah Meyerhoff, Hannah Studd, Ananya Bhattacharjee, Joseph J Williams, Madhu Reddy, and David C Mohr. 2022. Meeting Users Where They Are: User-centered Design of an Automated Text Messaging Tool to Support the Mental Health of Young Adults. In Proc SIGCHI Conf Hum Factor Comput Syst. ACM, New York, NY, USA. https://doi.org/10.1145/3491102.3502046",
      "doi": "10.1145/3491102.3502046"
    },
    {
      "text": "Miikka Kuutila, Mika V. Mäntylä, Maëlick Claes, and Marko Elovainio. 2018. Daily questionnaire to assess self-reported well-being during a software development project. In Proceedings - International Conference on Software Engineering. IEEE Computer Society, New York, NY, USA, 39–43. https://doi.org/10.1145/3194932.3194942",
      "doi": "10.1145/3194932.3194942"
    },
    {
      "text": "Christine Lagorio-Chafkin. 2022. Bumble Gave Nearly Its Entire Staff a Week Off to Combat Burnout. Here’s What It Learned. https://www.inc.com/christine-lagorio-chafkin/bumble-whitney-wolfe-herd-employee-wellness-time-off-burnout.html",
      "doi": ""
    },
    {
      "text": "Juwon Lee, Megan Lam, and Caleb Chiu. 2019. Clara: Design of a New System for Passive Sensing of Depression, Stress and Anxiety in the Workplace. Springer, Cham, 12–28. https://doi.org/10.1007/978-3-030-25872-6_2",
      "doi": ""
    },
    {
      "text": "Megan Leonhardt. 2022. 66% of companies are making changes to better support mental well-being. https://fortune.com/well/2022/06/01/companies-making-changes-to-support-mental-wellbeing/",
      "doi": ""
    },
    {
      "text": "Debra Lerner and Rachel Mosher Henke. 2008. What does research tell us about depression, job performance, and work productivity?Journal of Occupational and Environmental Medicine 50 (2008), 401–410. Issue 4. https://doi.org/10.1097/JOM.0b013e31816bae50",
      "doi": ""
    },
    {
      "text": "Alain Marchand, Pierre Durand, Victor Haines, and Steve Harvey. 2015. The multilevel determinants of workers’ mental health: results from the SALVEO study. Social Psychiatry and Psychiatric Epidemiology 50 (3 2015), 445–459. Issue 3. https://doi.org/10.1007/s00127-014-0932-y",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI ’08. ACM Press, New York, New York, USA, 107. https://doi.org/10.1145/1357054.1357072",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, and Mary Czerwinski. 2018. How blocking distractions affects workplace focus and productivity. In CHI ’18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3123024.3124558",
      "doi": "10.1145/3123024.3124558"
    },
    {
      "text": "Eira May. 2022. The Great Resignation is here. What does that mean for developers?https://stackoverflow.blog/2022/01/10/the-great-resignation-is-here-what-does-that-mean-for-developers/",
      "doi": ""
    },
    {
      "text": "André N Meyer, Earl T Barr, Christian Bird, and Thomas Zimmermann. 2021. Today Was a Good Day: The Daily Life of Software Developers. IEEE Transactions on Software Engineering 47 (2021). Issue 5. https://doi.org/10.1109/TSE.2019.2904957",
      "doi": ""
    },
    {
      "text": "André N Meyer, Laura E Barton, G. Murphy, T. Zimmermann, and Thomas Fritz. 2017. The Work Life of Developers: Activities, Switches and Perceived Productivity. IEEE Transactions on Software Engineering(2017). https://doi.org/10.1109/TSE.2017.2656886",
      "doi": "10.1109/TSE.2017.2656886"
    },
    {
      "text": "Microsoft. 2022. Viva Insights Home. https://docs.microsoft.com/en-us/viva/insights/personal/teams/viva-insights-home",
      "doi": ""
    },
    {
      "text": "Lorna Mitchell. 2021. 5 ways to improve mental health for software developers TechCrunch. https://techcrunch.com/2021/11/11/5-ways-to-improve-mental-health-for-software-developers/",
      "doi": ""
    },
    {
      "text": "Mehrab Bin Morshed, Samruddhi Shreeram Kulkarni, Koustuv Saha, Richard Li, Leah G. Roper, Lama Nachman, Hong Lu, Lucia Mirabella, Sanjeev Srivastava, Kaya de Barbaro, Munmun De Choudhury, Thomas Plötz, and Gregory Abowd. 2022. Food, Mood, Context: Examining College Students’ Eating Context and Mental Well-Being. ACM Transactions on Computing for Healthcare (6 2022). https://doi.org/10.1145/3533390",
      "doi": "10.1145/3533390"
    },
    {
      "text": "Elizabeth L. Murnane, Tara G. Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal informatics in interpersonal contexts: Towards the design of technology that supports the social ecologies of long-term mental health management. Proceedings of the ACM on Human-Computer Interaction 2 (11 2018). Issue CSCW. https://doi.org/10.1145/3274396",
      "doi": "10.1145/3274396"
    },
    {
      "text": "E. C. W. Ng and A. T. Fisher. 2013. Understanding Well-Being in Multi-Levels: A review. Health, Culture and Society 5 (11 2013), 308–323. Issue 1. https://doi.org/10.5195/hcs.2013.142",
      "doi": ""
    },
    {
      "text": "Oracle. 2021. 11 Ways to Prevent Employee Burnout. Technical Report. https://www.oracle.com/a/ocom/docs/11-ways-to-prevent-employee-burnout.pdf",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2020. Stack Overflow Developer Survey 2020. https://insights.stackoverflow.com/survey/2020/?utm_source=social-share&utm_medium=social&utm_campaign=dev-survey-2020#overview",
      "doi": ""
    },
    {
      "text": "Stack Overflow. 2021. Stack Overflow Developer Survey 2021. https://stackoverflow.blog/2021/12/07/new-data-what-developers-look-for-in-future-job-opportunities/",
      "doi": ""
    },
    {
      "text": "Annick Parent-Lamarche and Alain Marchand. 2019. Well-being at work from a multilevel perspective: what is the role of personality traits?International Journal of Workplace Health Management 12 (10 2019), 298–317. Issue 5. https://doi.org/10.1108/IJWHM-05-2019-0066",
      "doi": ""
    },
    {
      "text": "Mind Share Partners. 2021. 2021 Mental Health at Work Report. Technical Report.",
      "doi": ""
    },
    {
      "text": "Adam C Powell, Matthias B Bowman, and Henry T Harbin. 2019. Reimbursement of Apps for Mental Health: Findings From Interviews. In JMIR Ment Health, Vol. 6. https://doi.org/10.2196/14724",
      "doi": ""
    },
    {
      "text": "Meta Quest. 2021. Introducing Horizon Workrooms: Remote Collaboration Reimagined. https://about.fb.com/news/2021/08/introducing-horizon-workrooms-remote-collaboration-reimagined/",
      "doi": ""
    },
    {
      "text": "Rajeev Raizada. 2021. Clinical depression as the sports injury of academia. https://rajraizada.medium.com/clinical-depression-as-the-sports-injury-of-academia-ad1267c396e3",
      "doi": ""
    },
    {
      "text": "Antonia Rich, Amira Aly, Marta E. Cecchinato, Laura Lascau, Magdalen Baker, Rowena Viney, and Anna L. Cox. 2020. Evaluation of a novel intervention to reduce burnout in doctors-in-training using self-care and digital wellbeing strategies: a mixed-methods pilot. BMC Medical Education 20 (12 2020), 294. Issue 1. https://doi.org/10.1186/s12909-020-02160-y",
      "doi": ""
    },
    {
      "text": "Ramon Rico, Cristina Gibson, Miriam Sanchez-Manzanares, and Mark A. Clark. 2020. Team adaptation and the changing nature of work: Lessons from practice, evidence from research, and challenges for the road ahead. Australian Journal of Management 45 (8 2020), 507–526. Issue 3. https://doi.org/10.1177/0312896220918908",
      "doi": ""
    },
    {
      "text": "Carol D. Ryff. 1995. Psychological Well-Being in Adult Life. Current Directions in Psychological Science 4 (8 1995), 99–104. Issue 4. https://doi.org/10.1111/1467-8721.ep10772395",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Ayse E. Bayraktaroglu, Andrew T. Campbell, Nitesh V. Chawla, Munmun De Choudhury, Sidney K. D’Mello, Anind K. Dey, Ge Gao, Julie M. Gregg, Krithika Jagannath, Gloria Mark, Gonzalo J. Martinez, Stephen M. Mattingly, Edward Moskal, Anusha Sirigiri, Aaron Striegel, and Dong Whi Yoo. 2019. Social Media as a Passive Sensor in Longitudinal Studies of Human Behavior and Wellbeing. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299065",
      "doi": "10.1145/3290607.3299065"
    },
    {
      "text": "Koustuv Saha, Sang Chan Kim, Manikanta D. Reddy, Albert J. Carter, Eva Sharma, Oliver L. Haimson, and Munmun De Choudhury. 2019. The Language of LGBTQ+ Minority Stress Experiences on Social Media. Proceedings of the ACM on Human-Computer Interaction 3 (11 2019), 1–22. Issue CSCW. https://doi.org/10.1145/3361108",
      "doi": "10.1145/3361108"
    },
    {
      "text": "Johnny Saldana. 2021. The Coding Manual For Qualitative Researchers (4 ed.). SAGE Publications, London.",
      "doi": ""
    },
    {
      "text": "Samsung. 2022. Measure your stress level with Samsung health. https://www.samsung.com/us/support/answer/ANS00080574/",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Axel Janson, Pavel Karpashevich, Camille Nadal, Chengcheng Qu, Claudia Daudén Roquet, Muhammad Umair, Charles Windlin, Gavin Doherty, Kristina Höök, and Corina Sas. 2019. HCI and Affective Health Taking stock of a decade of studies and charting future research directions. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, New York, USA. https://doi.org/10.1145/3290605.3300475",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "Corina Sas, Kristina Höök, Gavin Doherty, Pedro Sanches, Tim Leufkens, and Joyce Westerink. 2020. Mental wellbeing: Future agenda drawing from design, HCI and big data. In DIS 2020 Companion - Companion Publication of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, Inc, New York, New York, USA, 425–428. https://doi.org/10.1145/3393914.3395920",
      "doi": "10.1145/3393914.3395920"
    },
    {
      "text": "Janice Singer, Timothy Lethbridge, Norman Vinson, and Nicolas Anquetil. 1997. An Examination of Software Engineering Work Practices. 1997 conference of the Centre for Advanced Studies on Collaborative research (CASCON ’97) (1997).",
      "doi": ""
    },
    {
      "text": "Darja Smite, Nils Brede Moe, Eriks Klotins, and Javier Gonzalez-Huerta. 2022. From forced Working-From-Home to voluntary working-from-anywhere: Two revolutions in telework. Journal of Systems and Software 195 (2022). https://doi.org/10.1109/TSE.2017.2656886",
      "doi": "10.1109/TSE.2017.2656886"
    },
    {
      "text": "Darja Smite, Anastasiia Tkalich, Nils Brede Moe, Efi Papatheocharous, Eriks Klotins, and Marte Pettersen Buvik. 2022. Changes in perceived productivity of software engineers during COVID-19 pandemic: The voice of evidence. Journal of Systems and Software 186 (2022), 111197. https://doi.org/10.1016/j.jss.2021.111197",
      "doi": "10.1016/j.jss.2021.111197"
    },
    {
      "text": "Andrew Smith. 2022. A Holistic Approach to the Well-being of Nurses: A combined Effects Approach. Advances in Social Sciences Research Journal 9 (1 2022), 475–484. Issue 1. https://doi.org/10.14738/assrj.91.11650",
      "doi": ""
    },
    {
      "text": "Mauricio Soto, Chris Satterfield, Thomas Fritz, Gail C. Murphy, David C. Shepherd, and Nicholas Kraft. 2021. Observing and predicting knowledge worker stress, focus and awakeness in the wild. International Journal of Human Computer Studies 146 (2 2021). https://doi.org/10.1016/j.ijhcs.2020.102560",
      "doi": ""
    },
    {
      "text": "Garen Staglin. 2021. Prevent employee burnout..or face the great resignation. Forbes (10 2021). https://www.forbes.com/sites/onemind/2021/10/27/prevent-employee-burnout–or-face-the-great-resignation/?sh=34cb1d33cb5b",
      "doi": ""
    },
    {
      "text": "Standuply. 2022. Standuply. https://standuply.com/",
      "doi": ""
    },
    {
      "text": "Walter F Stewart, Judith A Ricci, Elsbeth Chee, Steven R Hahn, and David Morganstein. 2003. Cost of Lost Productive Work Time Among US Workers With Depression. Technical Report. https://jamanetwork.com/",
      "doi": ""
    },
    {
      "text": "Zara Stone. 2022. A mental-health crisis is brewing in Silicon Valley as tech workers complain of sexual issues, burnout, and distress. Some say even the perks can’t make them stay. Business Insider (4 2022).",
      "doi": ""
    },
    {
      "text": "Franziska Tachtler, Reem Talhouk, and Toni Michel. 2021. Unaccompanied migrant youth and mental health technologies: A social-ecological approach to understanding and designing. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3411764.3445470",
      "doi": "10.1145/3411764.3445470"
    },
    {
      "text": "TeamRetro. 2022. TeamRetro. https://www.teamretro.com/",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Madeline Balaam, Jayne Wallace, David Coyle, and Siân Lindley. 2012. Designing wellbeing. In Proceedings of the Designing Interactive Systems Conference on - DIS ’12. ACM Press, New York, New York, USA, 789. https://doi.org/10.1145/2317956.2318075",
      "doi": "10.1145/2317956.2318075"
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Paula Johnson, John McCarthy, Siân Lindley, Peter Wright, Patrick Olivier, and Thomas D. Meyer. 2013. Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2647–2656. https://doi.org/10.1145/2470654.2481366",
      "doi": "10.1145/2470654.2481366"
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Thomas D. Meyer, and Patrick Olivier. 2015. Designing for mental wellbeing: Towards a more holistic approach in the treatment and prevention of mental illness. In ACM International Conference Proceeding Series. Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2783446.2783586",
      "doi": "10.1145/2783446.2783586"
    },
    {
      "text": "Kristy Threlkeld. 2021. Employee Burnout Report: COVID-19’s Impact and 3 Strategies to Curb It. Technical Report. https://www.indeed.com/lead/preventing-employee-burnout-report",
      "doi": ""
    },
    {
      "text": "Valerie Tiberius. 2020. Well-being, philosophical theories of. Springer Netherlands, Dordrecht, 1–4.",
      "doi": ""
    },
    {
      "text": "Gul Tokdemir. 2022. Software professionals during the COVID-19 pandemic in Turkey: Factors affecting their mental well-being and work engagement in the home-based work setting. Journal of Systems and Software 188 (6 2022). https://doi.org/10.1016/j.jss.2022.111286",
      "doi": "10.1016/j.jss.2022.111286"
    },
    {
      "text": "Bianca Trinkenreich, Ricardo Britto, Marco Aurelio Gerosa, and Igor Steinmacher. 2022. An Empirical Investigation on the Challenges Faced by Women in the Software Industry: A Case Study. In Proceedings of the 2022 ACM/IEEE 44th International Conference on Software Engineering: Software Engineering in Society. Association for Computing Machinery, New York, NY, USA, 24–35. https://doi.org/10.1145/3510458.3513018",
      "doi": "10.1145/3510458.3513018"
    },
    {
      "text": "National Research Council (US) and Institute of Medicine (US). 2009. Preventing Mental, Emotional, and Behavioral Disorders Among Young People. National Academies Press, Washington, D.C.https://doi.org/10.17226/12480",
      "doi": ""
    },
    {
      "text": "Sarah B. Watson, Yong Wah Goh, and Sukanlaya Sawang. 2011. Gender Influences on the Work-Related Stress-Coping Process. Journal of Individual Differences 32 (2011), 39–46. Issue 1. https://doi.org/10.1027/1614-0001/a000033",
      "doi": ""
    },
    {
      "text": "Eoin Whelan, Daniel Mcduff, Rob Gleasure, and Jan Vom Brocke. 2018. How Emotion-Sensing Technology Can Reshape the Workplace. Technical Report. MIT Sloan Management Review. 7–10 pages. http://mitsmr.com/2nJUBPC",
      "doi": ""
    },
    {
      "text": "Alex C. Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T. Iqbal, and Jaime Teevan. 2018. Supporting workplace detachment and reattachment with conversational intelligence. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2018-April. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3173574.3173662",
      "doi": "10.1145/3173574.3173662"
    },
    {
      "text": "Jong Min Woo, Won Kim, Tae Yeon Hwang, Kevin D. Frick, Byong Hwi Choi, Yong Jin Seo, Eun Ho Kang, Se Joo Kim, Byong Joo Ham, Jun Seok Lee, and Yu Lee Park. 2011. Impact of depression on work productivity and its improvement after outpatient treatment with antidepressants. Value in Health 14(2011), 475–482. Issue 4. https://doi.org/10.1016/j.jval.2010.11.006",
      "doi": ""
    },
    {
      "text": "One Mind At Work. 2020. MENTAL HEALTH IN THE WORKPLACE 2020: CHRO Insights Series OCTOBER 2020. Technical Report.",
      "doi": ""
    },
    {
      "text": "Hossein Abad Zahra Shakeri, Oliver Karras, Kurt Schneider, Ken Barker, and Mike Bauer. 2018. Task Interruption in Software Development Projects. In Proceedings of the 22nd International Conference on Evaluation and Assessment in Software Engineering 2018. ACM, New York, NY, USA, 122–132. https://doi.org/10.1145/3210459.3210471",
      "doi": "10.1145/3210459.3210471"
    },
    {
      "text": "Åsa Cajander, Marta Larusdottir, Elina Eriksson, and Gerolf Nauwerck. 2015. Contextual Personas as a Method for Understanding Digital Work Environments. In Human Work Interaction Design. Work Analysis and Interaction Design Methods for Pervasive and Smart Workplaces. HWID 2015. IFIP Advances in Information and Communication Technology, Vol. 468. Springer, Cham. https://doi.org/10.1007/978-3-319-27048-7_10",
      "doi": ""
    }
  ]
}