{
  "doi": "10.1145/3544548.3581086",
  "title": "We are the Data: Challenges and Opportunities for Creating Demographically Diverse Anthropographics",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Anthropographics are human-shaped visualizations that aim to emphasize the human importance of datasets and the people behind them. However, current anthropographics tend to employ homogeneous human shapes to encode data about diverse demographic groups. Such anthropographics can obscure important differences between groups and contemporary designs exemplify the lack of inclusive approaches for representing human diversity in visualizations. In response, we explore the creation of demographically diverse anthropographics that communicate the visible diversity of demographically distinct populations. Building on previous anthropographics research, we explore strategies for visualizing datasets about people in ways that explicitly encode diversity—illustrating these approaches with examples in a variety of visual styles. We also critically reflect on strategies for creating diverse anthropographics, identifying social and technical challenges that can result in harmful representations. Finally, we highlight a set of forward-looking research opportunities for advancing the design and understanding of diverse anthropographics.",
  "tags": [
    "marginalized populations",
    "demographic data",
    "diversity",
    "anthropographics"
  ],
  "authors": [
    {
      "name": "Priya Dhawka",
      "institution": "Computer Science, University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783332",
      "orcid": "0000-0002-7334-4950"
    },
    {
      "name": "Helen Ai He",
      "institution": "Computer Science, University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782992",
      "orcid": "0000-0001-8681-2381"
    },
    {
      "name": "Wesley Willett",
      "institution": "University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572817",
      "orcid": "0000-0002-6793-3062"
    }
  ],
  "references": [
    {
      "text": "Ofunne Amaka and Amber Thomas. 2022. The Naked Truth. Available: https://pudding.cool/2021/03/foundation-names/.",
      "doi": ""
    },
    {
      "text": "McKane Andrus, Elena Spitzer, Jeffrey Brown, and Alice Xiang. 2021. What We Can’t Measure, We Can’t Understand: Challenges to Demographic Data Procurement in the Pursuit of Fairness. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 249–260. https://doi.org/10.1145/3442188.3445888",
      "doi": "10.1145/3442188.3445888"
    },
    {
      "text": "Foster Osei Baah, Anne M Teitelman, and Barbara Riegel. 2019. Marginalization: Conceptualizing Patient Vulnerabilities in the Framework of Social Determinants of Health—An integrative Review. Nursing Inquiry 26, 1 (2019), e12268. https://doi.org/10.1111/nin.12268",
      "doi": ""
    },
    {
      "text": "Emily Badger, Claire Cain Miller, Adam Pearce, and Kevin Quealy. 2018. Extensive Data Shows Punishing Reach of Racism for Black Boys. The New York Times. https://www.nytimes.com/interactive/2018/03/19/upshot/race-class-white-and-black-men.html.",
      "doi": ""
    },
    {
      "text": "Dan Barry, Larry Buchanan, Clinton Cargill, Annie Daniel, Alain Delaquérière, Lazaro Gamio, Gabriel Gianordoli, Rich Harris, Barbara Harvey, John Haskins, Jon Huang, Simone Landon, Juliette Love, Grace Maalouf, Alex Leeds Matthews, Farah Mohamed, Steven Moity, Destinée-Charisse Royal, Matt Ruby, and Eden Weingart. 2020. Remembering the 100,000 Lives Lost to Coronavirus in America. The New York Times. https://www.nytimes.com/interactive/2020/05/24/us/us-coronavirus-deaths-100000.html.",
      "doi": ""
    },
    {
      "text": "Fenty Beauty. 2022. Pro Filt’r Soft Matte Longwear Foundation. Available: https://fentybeauty.com/products/pro-filtr-soft-matte-longwear-foundation-100.",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Anshul Vikram Pandey, John Emerson, Margaret Satterthwaite, Oded Nov, and Enrico Bertini. 2017. Showing People Behind Data: Does Anthropomorphizing Visualizations Elicit More Empathy for Human Rights Data?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5462–5474. https://doi.org/10.1145/3025453.3025512",
      "doi": "10.1145/3025453.3025512"
    },
    {
      "text": "Census Bureau. 1997. About the Topic of Race. Retrieved September 9, 2022 from https://www.census.gov/topics/population/race/about.html",
      "doi": ""
    },
    {
      "text": "Matthew Clair and Jeffrey S Denis. 2015. Sociology of Racism. The International Encyclopedia of the Social and Behavioral Sciences 19 (2015), 857–63. https://projects.iq.harvard.edu/files/deib-explorer/files/sociology_of_racism.pdf",
      "doi": ""
    },
    {
      "text": "Eva Clark, Karla Fredricks, Laila Woc-Colburn, Maria Elena Bottazzi, and Jill Weatherhead. 2020. Disproportionate Impact of the COVID-19 Pandemic on Immigrant Communities in the United States. PLoS Neglected Tropical Diseases 14, 7 (2020), e0008484. https://doi.org/10.1371/journal.pntd.0008484",
      "doi": ""
    },
    {
      "text": "United States Equal Employment Opportunity Commission. 1966. EEO-1 Component 1 Data Collection. Retrieved September 9, 2022 from https://eeocdata.org/eeo1",
      "doi": ""
    },
    {
      "text": "Mercy Corps. 2021. Quick Facts: What You Need to Know About the Syria Crisis. Mercy Corps. https://www.mercycorps.org/blog/quick-facts-syria-crisis.",
      "doi": ""
    },
    {
      "text": "Michael Correll. 2019. Ethical Dimensions of Visualization Research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300418",
      "doi": "10.1145/3290605.3300418"
    },
    {
      "text": "Peter Coy. 2022. Why So Many Children of Immigrants Rise to the Top. The New York Times. https://www.nytimes.com/interactive/2022/07/11/opinion/immigrants-success-america.html.",
      "doi": ""
    },
    {
      "text": "Angelica Dass. 2018. Humanae. Available: https://angelicadass.com/photography/humanae/.",
      "doi": ""
    },
    {
      "text": "Department of Justice Canada. 1995. Employment Equity Act. Retrieved September 9, 2022 from https://laws-lois.justice.gc.ca/eng/acts/e-5.401/FullText.html",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F Klein. 2020. 1. The Power Chapter. In Data Feminism. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Marian Dörk, Patrick Feng, Christopher Collins, and Sheelagh Carpendale. 2013. Critical InfoVis: Exploring the Politics of Visualization. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2189–2198. https://doi.org/10.1145/2468356.2468739",
      "doi": "10.1145/2468356.2468739"
    },
    {
      "text": "Benj Edwards. 2022. Adobe Stock begins selling AI-generated artwork. Ars Technica. https://arstechnica.com/information-technology/2022/12/adobe-stock-begins-selling-ai-generated-artwork/.",
      "doi": ""
    },
    {
      "text": "Stanislav Frolov, Tobias Hinz, Federico Raue, Jörn Hees, and Andreas Dengel. 2021. Adversarial text-to-image synthesis: A review. Neural Networks 144(2021), 187–209.",
      "doi": "10.1016/j.neunet.2021.07.019"
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé Iii, and Kate Crawford. 2021. Datasheets for datasets. Commun. ACM 64, 12 (2021), 86–92.",
      "doi": "10.1145/3458723"
    },
    {
      "text": "Peter J Hills and J Michael Pake. 2013. Eye-tracking the Own-Race Bias in Face Recognition: Revealing the Perceptual and Socio-Cognitive Mechanisms. Cognition 129, 3 (2013), 586–597. https://doi.org/10.1016/j.cognition.2013.08.012",
      "doi": ""
    },
    {
      "text": "Aubrey Hirsch. 2022. The Economic Case for Abortion Rights. Vox Media. https://www.vox.com/platform/amp/the-highlight/23182150/abortion-rights-economic-justice.",
      "doi": ""
    },
    {
      "text": "Eli Holder and Cindy Xiong. 2022. Dispersion vs Disparity: Hiding Variability Can Encourage Stereotyping When Visualizing Social Outcomes. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209377",
      "doi": ""
    },
    {
      "text": "Alexander Ivanov, Kurtis Danyluk, Christian Jacob, and Wesley Willett. 2019. A Walk Among the Data. IEEE Computer Graphics and Applications 39, 3 (2019), 19–28. https://doi.org/10.1109/MCG.2019.2898941",
      "doi": "10.1109/MCG.2019.2898941"
    },
    {
      "text": "Nina G Jablonski. 2021. Skin Color and Race. American Journal of Physical Anthropology 175, 2 (2021), 437–447. https://doi.org/10.1002/ajpa.24200",
      "doi": ""
    },
    {
      "text": "Neeta Kantamneni. 2020. The Impact of the COVID-19 Pandemic on Marginalized Populations in the United States: A Research Agenda. Journal of Vocational Behavior 119 (2020), 103439. https://doi.org/10.1016/j.jvb.2020.103439",
      "doi": ""
    },
    {
      "text": "Chris Kirk and Dan Kois. 2013. How Many People Have Been Killed by Guns Since Newtown?Slate. http://www.slate.com/articles/news_and_politics/crime/2012/12/gun_death_tally_every_american_gun_death_since_newtown_sandy_hook_shooting.html.",
      "doi": ""
    },
    {
      "text": "Elsie Lee-Robbins and Eytan Adar. 2022. Affective Learning Objectives for Communicative Visualizations. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209500",
      "doi": ""
    },
    {
      "text": "Calvin A. Liang, Sean A. Munson, and Julie A. Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Trans. Comput.-Hum. Interact. 28, 2, Article 14 (apr 2021), 47 pages. https://doi.org/10.1145/3443686",
      "doi": "10.1145/3443686"
    },
    {
      "text": "Johannes Liem, Charles Perin, and Jo Wood. 2020. Structure and Empathy in Visual Data Storytelling: Evaluating their Influence on Attitude. Computer Graphics Forum 39, 3 (2020), 277–289. https://doi.org/10.1111/cgf.13980",
      "doi": ""
    },
    {
      "text": "Sebastian Linxen, Christian Sturm, Florian Brühlmann, Vincent Cassau, Klaus Opwis, and Katharina Reinecke. 2021. How WEIRD is CHI?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 143, 14 pages. https://doi.org/10.1145/3411764.3445488",
      "doi": "10.1145/3411764.3445488"
    },
    {
      "text": "Shambhavi Mahajan, Bonnie Chen, Alireza Karduni, Yea-Seul Kim, and Emily Wall. 2022. VIBE: A Design Space for VIsual Belief Elicitation in Data Journalism. Computer Graphics Forum 41, 3 (2022), 477–488.",
      "doi": ""
    },
    {
      "text": "Scott McCloud. 1993. Understanding Comics: The Invisible Art. Harper Perennial, New York.",
      "doi": ""
    },
    {
      "text": "Luiz Morais, Yvonne Jansen, Nazareno Andrade, and Pierre Dragicevic. 2020. Showing Data about People: A Design Space of Anthropographics. IEEE Transactions on Visualization and Computer Graphics 28, 3(2020), 1661–1679.",
      "doi": ""
    },
    {
      "text": "Luiz Morais, Yvonne Jansen, Nazareno Andrade, and Pierre Dragicevic. 2021. Can Anthropographics Promote Prosociality? A Review and Large-Sample Study. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 611, 18 pages. https://doi.org/10.1145/3411764.3445637",
      "doi": "10.1145/3411764.3445637"
    },
    {
      "text": "Amanda Oakley. 2022. Fitzpatrick Skin Phototype. Available: https://dermnetnz.org/topics/skin-phototype.",
      "doi": ""
    },
    {
      "text": "Office of Federal Contract Compliance Programs. 1965. Executive Order 11246. Retrieved September 9, 2022 from https://www.dol.gov/agencies/ofccp/executive-order-11246",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Deokgun Park, Steven M Drucker, Roland Fernandez, and Niklas Elmqvist. 2017. Atom: A Grammar for Unit Visualizations. IEEE Transactions on Visualization and Computer Graphics 24, 12(2017), 3032–3043. https://doi.org/10.1109/TVCG.2017.2785807",
      "doi": ""
    },
    {
      "text": "Cale J. Passmore and Regan Mandryk. 2018. An About Face: Diverse Representation in Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (Melbourne, VIC, Australia) (CHI PLAY ’18). Association for Computing Machinery, New York, NY, USA, 365–380. https://doi.org/10.1145/3242671.3242711",
      "doi": "10.1145/3242671.3242711"
    },
    {
      "text": "Evan M. Peck, Sofia E. Ayuso, and Omar El-Etr. 2019. Data is Personal: Attitudes and Perceptions of Data Visualization in Rural Pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300474",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Pew Research Center. 2015. Chapter 1: Race and Multiracial Americans in the U.S. Census. Retrieved September 9, 2022 from https://www.pewresearch.org/social-trends/2015/06/11/chapter-1-race-and-multiracial-americans-in-the-u-s-census/",
      "doi": ""
    },
    {
      "text": "Aditya Ramesh, Prafulla Dhariwal, Alex Nichol, Casey Chu, and Mark Chen. 2022. Hierarchical Text-Conditional Image Generation with CLIP Latents. https://doi.org/10.48550/ARXIV.2204.06125",
      "doi": ""
    },
    {
      "text": "Alexander Robertson, Walid Magdy, and Sharon Goldwater. 2021. Black or White but Never Neutral: How Readers Perceive Identity from Yellow or Skin-Toned Emoji. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 350 (oct 2021), 23 pages. https://doi.org/10.1145/3476091",
      "doi": "10.1145/3476091"
    },
    {
      "text": "Jonathan Schwabish and Alice Feng. 2021. Do No Harm Guide: Applying Equity Awareness in Data Visualization. Urban Institute. https://www. urban. org/research/publication/do-no-harm-guide-applying-equity-awareness-data-visualization.",
      "doi": ""
    },
    {
      "text": "Hannah Schwan, Jonas Arndt, and Marian Dörk. 2022. Disclosure as a critical-feminist design practice for Web-based data stories. First Monday 27, 11 (Nov. 2022). https://doi.org/10.5210/fm.v27i11.12712",
      "doi": ""
    },
    {
      "text": "Yang Shi, Pei Liu, Siji Chen, Mengdi Sun, and Nan Cao. 2022. Supporting Expressive and Faithful Pictorial Visualization Design With Visual Style Transfer. IEEE Transactions on Visualization and Computer Graphics (2022), 1–11. https://doi.org/10.1109/TVCG.2022.3209486",
      "doi": ""
    },
    {
      "text": "Pablo Stanley. 2022. Open Peeps, A Hand-drawn Illustration Library. Available: https://openpeeps.com/.",
      "doi": ""
    },
    {
      "text": "Statistics Canada. 2016. Visible Minority and Population Group Reference Guide, Census of Population, 2016. Retrieved September 9, 2022 from https://www12.statcan.gc.ca/census-recensement/2016/ref/guides/006/98-500-x2016006-eng.cfm",
      "doi": ""
    },
    {
      "text": "Unicode.org. 2022. Full Emoji Modifier Sequences, v14.0. Available: https://unicode.org/emoji/charts/full-emoji-modifiers.html.",
      "doi": ""
    }
  ]
}