{
  "doi": "10.1145/3544548.3581272",
  "title": "“I Want to Be Unique From Other Robots”: Positioning Girls as Co-creators of Social Robots in Culturally-Responsive Computing Education",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2023,
  "badges": [],
  "abstract": "Robot technologies have been introduced to computing education to engage learners. This study introduces the concept of co-creation with a robot agent into culturally-responsive computing (CRC). Co-creation with computer agents has previously focused on creating external artifacts. Our work differs by making the robot agent itself the co-created product. Through participatory design activities, we positioned adolescent girls and an agentic social robot as co-creators of the robot’s identity. Taking a thematic analysis approach, we examined how girls embody the role of creator and co-creator in this space. We identified themes surrounding who has the power to make decisions, what decisions are made, and how to maintain social relationship. Our findings suggest that co-creation with robot technology is a promising implementation vehicle for realizing CRC.",
  "authors": [
    {
      "name": "Yinmiao Li",
      "institution": "School of Education and Social Policy / McCormick School of Engineering, Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783213",
      "orcid": "0000-0001-9570-3961"
    },
    {
      "name": "Jennifer Nwogu",
      "institution": "School of Computing and Information / Learning Research and Development Center, University of Pittsburgh, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660556811",
      "orcid": "0000-0002-9421-0927"
    },
    {
      "name": "Amanda Buddemeyer",
      "institution": "Learning Research & Development Center / School of Computing and Information, University of Pittsburgh, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659850351",
      "orcid": "0000-0002-2277-2402"
    },
    {
      "name": "Jaemarie Solyst",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659510828",
      "orcid": "0000-0002-0549-0454"
    },
    {
      "name": "Jina Lee",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660780867",
      "orcid": "0000-0003-3910-4889"
    },
    {
      "name": "Erin Walker",
      "institution": "School of Computing and Information / Learning Research and Development Center, University of Pittsburgh, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491129",
      "orcid": "0000-0002-0976-9065"
    },
    {
      "name": "Amy Ogan",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583567",
      "orcid": "0000-0003-2671-6149"
    },
    {
      "name": "Angela E.B. Stewart",
      "institution": "Department of Informatics and Networked Systems, Learning Research and Development Center, University of Pittsburgh, United States",
      "img": "/do/10.1145/contrib-99659310904/rel-imgonly/99659310904.jpg",
      "acmid": "99659310904",
      "orcid": "0000-0002-6004-9266"
    }
  ],
  "references": [
    {
      "text": "Francesca Agatolio and Michele Moro. 2016. A workshop to promote Arduino-based robots as Wide Spectrum Learning Support Tools. Robotics in Education (Oct 2016), 113–125. https://doi.org/10.1007/978-3-319-42975-5_11",
      "doi": ""
    },
    {
      "text": "Safinah Ali, Tyler Moroso, and Cynthia Breazeal. 2019. Can children learn creativity from a social robot?Proceedings of the 2019 on Creativity and Cognition (2019), 359–368. https://doi.org/10.1145/3325480.3325499",
      "doi": "10.1145/3325480.3325499"
    },
    {
      "text": "Noreen Izza Arshad, Ahmad Sobri Hashim, Mazeyanti Mohd Ariffin, Nurshazlyn Mohd Aszemi, Hui Min Low, and Azah Anir Norman. 2020. Robots as assistive technology tools to enhance cognitive abilities and foster valuable learning experiences among young children with autism spectrum disorder. IEEE Access 8(2020), 116279–116291. https://doi.org/10.1109/access.2020.3001629",
      "doi": ""
    },
    {
      "text": "Catherine Ashcraft, Elizabeth K. Eger, and Kimberly A. Scott. 2017. Becoming technosocial change agents: Intersectionality and culturally responsive pedagogies as vital resources for increasing girls’ participation in computing. Anthropology & Education Quarterly 48, 3 (2017), 233–251. https://doi.org/10.1111/aeq.12197",
      "doi": ""
    },
    {
      "text": "Tucker Balch, Jay Summet, Doug Blank, Deepak Kumar, Mark Guzdial, Keith O’Hara, Daniel Walker, Monica Sweat, Gaurav Gupta, Stewart Tansley, Jared Jackson, Mansi Gupta, Marwa Nur Muhammad, Shikha Prashad, Natasha Eilbert, and Ashley Gavin. 2008. Designing personal robots for education: Hardware, software, and Curriculum. IEEE Pervasive Computing 7, 2 (2008), 5–9. https://doi.org/10.1109/mprv.2008.29",
      "doi": "10.1109/mprv.2008.29"
    },
    {
      "text": "Amanda Buddemeyer, Jennifer Nwogu, Jaemarie Solyst, Erin Walker, Tara Nkrumah, Amy Ogan, Leshell Hatley, and Angela Stewart. 2022. Unwritten magic: Participatory design of AI Dialogue to empower marginalized voices. Conference on Information Technology for Social Good (2022). https://doi.org/10.1145/3524458.3547119",
      "doi": "10.1145/3524458.3547119"
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. In Proceedings of the 1st Conference on Fairness, Accountability and Transparency(Proceedings of Machine Learning Research, Vol. 81), Sorelle A. Friedler and Christo Wilson (Eds.). PMLR, 77–91. https://proceedings.mlr.press/v81/buolamwini18a.html",
      "doi": ""
    },
    {
      "text": "Chih-Wei Chang, Jih-Hsien Lee, Po-Yao Chao, Chin-Yeh Wang, and Gwo-Dong Chen. 2010. Exploring the Possibility of Using Humanoid Robots as Instructional Tools for Teaching a Second Language in Primary School. Journal of Educational Technology & Society 13, 2 (2010), 13–24. http://www.jstor.org/stable/jeductechsoci.13.2.13",
      "doi": ""
    },
    {
      "text": "Andrew Chiou. 2004. Teaching Technology Using Educational Robotics. Scholarly Inquiry into Science Teaching and Learning Symposium (2004), 9–14.",
      "doi": ""
    },
    {
      "text": "Chih-Yueh Chou, Tak-Wai Chan, and Chi-Jen Lin. 2003. Redefining the learning companion: The past, present, and future of Educational Agents. Computers & Education 40, 3 (2003), 255–269. https://doi.org/10.1016/s0360-1315(02)00130-6",
      "doi": "10.1016/s0360-1315%2802%2900130-6"
    },
    {
      "text": "Ericka Collado. 2017. Robots as Language Learning Tools.Learning Languages 22, 2 (2017), 28–31.",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Chih-Pin Hsiao, Yanna Popova, and Brian Magerko. 2015. An enactive model of creativity for computational collaboration and co-creation. Creativity in the Digital Age(2015), 109–133. https://doi.org/10.1007/978-1-4471-6681-8_7",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Chih-PIn Hsiao, Kunwar Yashraj Singh, Lisa Li, and Brian Magerko. 2016. Empirically studying participatory sense-making in abstract drawing with a co-creative cognitive agent. Proceedings of the 21st International Conference on Intelligent User Interfaces 16, 4 (Oct 2016), 1–25. https://doi.org/10.1145/2856767.2856795",
      "doi": "10.1145/2856767.2856795"
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Data feminism. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry: developing new technologies for children with children. Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit - CHI ’99(1999). https://doi.org/10.1145/302979.303166",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Nikleia Eteokleous and Despo Ktoridou. 2014. Educational Robotics as learning tools within the teaching and learning practice. 2014 IEEE Global Engineering Education Conference (EDUCON) (2014). https://doi.org/10.1109/educon.2014.6826237",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Natalie Garrett, and Nathan Beard. 2020. What do we teach when we teach tech ethics? a syllabi analysis. Proceedings of the 51st ACM Technical Symposium on Computer Science Education (2020), 289–295. https://doi.org/10.1145/3328778.3366825",
      "doi": "10.1145/3328778.3366825"
    },
    {
      "text": "Gerhard Fischer, Elisa Giaccardi, Hal Eden, Masanori Sugimoto, and Yunwen Ye. 2005. Beyond binary choices: Integrating individual and Social Creativity. International Journal of Human-Computer Studies 63, 4-5 (2005), 482–512. https://doi.org/10.1016/j.ijhcs.2005.04.014",
      "doi": "10.1016/j.ijhcs.2005.04.014"
    },
    {
      "text": "Thomas Fuchs and Hanne De Jaegher. 2009. Enactive intersubjectivity: Participatory sense-making and mutual incorporation. Phenomenology and the cognitive sciences 8, 4 (2009), 465–486.",
      "doi": ""
    },
    {
      "text": "Geneva Gay. 2002. Preparing for culturally responsive teaching. Journal of teacher education 53, 2 (2002), 106–116.",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi. 2003. Principles of metadesign: Processes and levels of co-creation in the new design space. University of Plymouth.",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi, Pedro Paredes, Paloma Díaz, and Diego Alvarado. 2012. Embodied narratives. Proceedings of the Designing Interactive Systems Conference on - DIS ’12 (2012). https://doi.org/10.1145/2317956.2317958",
      "doi": "10.1145/2317956.2317958"
    },
    {
      "text": "Elisa Giaccardi, Pedro Paredes, Paloma Díaz, and Diego Alvarado. 2012. Embodied narratives: a performative co-design technique. Proceedings of the Designing Interactive Systems Conference on - DIS ’12 (2012). https://doi.org/10.1145/2317956.2317958",
      "doi": "10.1145/2317956.2317958"
    },
    {
      "text": "Lisa M. Given and Lucia Benaquisto. 2008. Codes and Coding. Sage, 85–88.",
      "doi": ""
    },
    {
      "text": "Patrick Grüneberg. 2020. Culturally Sustainable Social Robotics as an empowerment technology. Frontiers in Artificial Intelligence and Applications (2020), 127–138. https://doi.org/10.3233/faia200908",
      "doi": ""
    },
    {
      "text": "Alla Gubenko, Todd Lubart, and Claude Houssemand. 2022. From social robots to creative humans and back. 13th International Conference on Computational Creativity.",
      "doi": ""
    },
    {
      "text": "Matthew Guzdial and Mark Riedl. 2019. An Interaction Framework for Studying Co-Creative AI. (2019). arXiv:arXiv:1903.09709v1",
      "doi": ""
    },
    {
      "text": "Jeonghye Han, Miheon Jo, Sungju Park, and Sungho Kim. 2005. The educational use of home robots for children. IEEE International Workshop on Robot and Human Interactive Communication (2005), 378–383. https://doi.org/10.1109/roman.2005.1513808",
      "doi": ""
    },
    {
      "text": "Christina N. Harrington, Lauren Wilcox, Kay Connelly, Wendy Rogers, and Jon Sanford. 2018. Designing health and fitness apps with older adults. Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare(2018). https://doi.org/10.1145/3240925.3240929",
      "doi": "10.1145/3240925.3240929"
    },
    {
      "text": "Christina N. Harrington, Lauren Wilcox, Kay Connelly, Wendy Rogers, and Jon Sanford. 2018. Designing health and fitness apps with older adults. Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare(2018), 15–24. https://doi.org/10.1145/3240925.3240929",
      "doi": "10.1145/3240925.3240929"
    },
    {
      "text": "Anthony J. Hirst, Jeffrey Johnson, Marian Petre, Blaine A. Price, and Mike Richards. 2003. What is the Best Programming Environment/language for Teaching Robotics using Lego Mindstorms?Artificial Life and Robotics 7, 3 (2003), 124–131. https://doi.org/10.1007/bf02481160",
      "doi": ""
    },
    {
      "text": "Dorothy Holland, William Lachicotte Jr, Debra Skinner, and Carole Cain. 2001. Identity and Agency in Cultural worlds. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Ryan Blake Jackson and Tom Williams. 2019. On perceived social and moral agency in natural language capable robots. In 2019 HRI workshop on the dark side of human-robot interaction. Jackson, RB, and Williams. 401–410.",
      "doi": ""
    },
    {
      "text": "Juliane Jarke, Gabriela Molina León, Irina Zakharova, Hendrik Heuer, and Ulrike Gerhard. 2021. Beyond participation: A review of co-creation in computing. https://arxiv.org/abs/2111.04524",
      "doi": ""
    },
    {
      "text": "Malte F. Jung, Nik Martelaro, Halsey Hoster, and Clifford Nass. 2014. Participatory Materials: Having a Reflective Conversation with an Artifact in the Making. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 25–34. https://doi.org/10.1145/2598510.2598591",
      "doi": "10.1145/2598510.2598591"
    },
    {
      "text": "Takayuki Kanda, Takayuki Hirano, Daniel Eaton, and Hiroshi Ishiguro. 2004. Interactive Robots as Social Partners and Peer Tutors for Children: A Field Trial. Human–Computer Interaction 19, 1-2 (2004), 61–84. https://doi.org/10.1080/07370024.2004.9667340 arXiv:https://www.tandfonline.com/doi/pdf/10.1080/07370024.2004.9667340",
      "doi": ""
    },
    {
      "text": "Shalini Kantayya. 2020. Coded Bias.",
      "doi": ""
    },
    {
      "text": "Anna Kantosalo, Jukka Mikael Toivanen, Ping Xiao, and Hannu Toivonen. 2014. From isolation to involvement: Adapting Machine Creativity Software to support human-computer co-creation. Proceedings of 5th International Conference on Computational Creativity (Jan 2014).",
      "doi": ""
    },
    {
      "text": "Anna Kantosalo and Hannu Toivonen. 2016. Modes for Creative Human-Computer Collaboration: Alternating and Task-Divided Co-Creativity. In Proceedings of the Seventh International Conference on Computational Creativity, UPMC, Paris, France, June 27 - July 1, 2016, François Pachet, Amílcar Cardoso, Vincent Corruble, and Fiammetta Ghedini (Eds.). Sony CSL Paris, France, 77–84. http://www.computationalcreativity.net/iccc2016/wp-content/uploads/2016/01/Modes-for-Creative-Human-Computer-Collaboration.pdf",
      "doi": ""
    },
    {
      "text": "Michelle E. Kiger and Lara Varpio. 2020. Thematic analysis of qualitative data: Amee Guide no. 131. Medical Teacher 42, 8 (2020), 846–854. https://doi.org/10.1080/0142159x.2020.1755030",
      "doi": ""
    },
    {
      "text": "Ann Y. Kim, Gale M. Sinatra, and Viviane Seyranian. 2018. Developing a STEM Identity Among Young Women: A Social Identity Perspective. Review of Educational Research 88, 4 (2018), 589–625. https://doi.org/10.3102/0034654318779957 arXiv:https://doi.org/10.3102/0034654318779957",
      "doi": ""
    },
    {
      "text": "Jacqueline Kory and Cynthia Breazeal. 2014. Storytelling with robots: Learning companions for preschool children’s language development. The 23rd IEEE International Symposium on Robot and Human Interactive Communication (2014). https://doi.org/10.1109/roman.2014.6926325",
      "doi": ""
    },
    {
      "text": "Gloria Ladson-Billings. 1995. Toward a theory of culturally relevant pedagogy. American educational research journal 32, 3 (1995), 465–491.",
      "doi": ""
    },
    {
      "text": "Matthew V. Law, JiHyun Jeong, Amritansh Kwatra, Malte F. Jung, and Guy Hoffman. 2019. Negotiating the creative space in human-robot collaborative design. Proceedings of the 2019 on Designing Interactive Systems Conference (2019), 645–657. https://doi.org/10.1145/3322276.3322343",
      "doi": "10.1145/3322276.3322343"
    },
    {
      "text": "Iolanda Leite, Andre Pereira, Carlos Martinho, and Ana Paiva. 2008. Are emotional robots more fun to play with?. In RO-MAN 2008 - The 17th IEEE International Symposium on Robot and Human Interactive Communication. 77–82. https://doi.org/10.1109/ROMAN.2008.4600646",
      "doi": ""
    },
    {
      "text": "Janika Leoste and Mati Heidmets. 2019. The impact of educational robots as learning tools on mathematics learning outcomes in basic education. Digital Turn in Schools—Research, Policy, Practice (2019), 203–217. https://doi.org/10.1007/978-981-13-7361-9_14",
      "doi": ""
    },
    {
      "text": "Yuyu Lin, Jiahao Guo, Yang Chen, Cheng Yao, and Fangtian Ying. 2020. It is your turn: Collaborative ideation with a co-creative robot through sketch. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (2020). https://doi.org/10.1145/3313831.3376258",
      "doi": "10.1145/3313831.3376258"
    },
    {
      "text": "Duri Long, Mikhail Jacob, and Brian Magerko. 2019. Designing co-creative AI for public spaces. Proceedings of the 2019 on Creativity and Cognition (Jun 2019), 271–284. https://doi.org/10.1145/3325480.3325504",
      "doi": "10.1145/3325480.3325504"
    },
    {
      "text": "Todd Lubart. 2005. How can computers be partners in the creative process: Classification and commentary on the special issue. International Journal of Human-Computer Studies 63, 4-5 (2005), 365–369. https://doi.org/10.1016/j.ijhcs.2005.04.002",
      "doi": "10.1016/j.ijhcs.2005.04.002"
    },
    {
      "text": "Mary Lou Maher. 2012. Computational and collective creativity: Who’s being creative. In in Proc. 3rd Int. Conf. on Computational Creativity.",
      "doi": ""
    },
    {
      "text": "Allison Master, Sapna Cheryan, and Andrew N. Meltzoff. 2016. Computing whether she belongs: Stereotypes undermine girls’ interest and sense of belonging in computer science.Journal of Educational Psychology 108, 3 (2016), 424–437. https://doi.org/10.1037/edu0000061",
      "doi": ""
    },
    {
      "text": "Omar Mubin, Catherine J. Stevens, Suleman Shahid, Abdullah Al Mahmud, and Jian-Jie Dong. 2013. A Review of the Applicability of Robots in Education. Technology in Education and Learning(2013).",
      "doi": ""
    },
    {
      "text": "Michelle M. Neumann. 2019. Social Robots and Young Children’s early language and literacy learning. Early Childhood Education Journal 48, 2 (2019), 157–170. https://doi.org/10.1007/s10643-019-00997-7",
      "doi": ""
    },
    {
      "text": "Ikujiro Nonaka and Noboru Konno. 1998. The concept of “ba”: Building a Foundation for Knowledge Creation. California Management Review 40, 3 (1998), 40–54. https://doi.org/10.2307/41165942",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Inioluwa Deborah Raji, Morgan Klaus Scheuerman, and Razvan Amironesei. 2021. You can’t sit with us: Exclusionary pedagogy in ai ethics education. Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (2021), 515–525. https://doi.org/10.1145/3442188.3445914",
      "doi": "10.1145/3442188.3445914"
    },
    {
      "text": "Yolanda A. Rankin and Jakita O. Thomas. 2019. Straighten up and Fly Right: Rethinking Intersectionality in HCI Research. Interactions 26, 6 (Oct. 2019), 64–68. https://doi.org/10.1145/3363033",
      "doi": "10.1145/3363033"
    },
    {
      "text": "John Jairo Páez Rodriguez and Enríque González Guerrero. 2017. Human-robot scaffolding: A novel perspective to use robots such as learning tools. In 18th International Conference on Advanced Robotics (ICAR). 426–431. https://doi.org/10.1109/ICAR.2017.8023644",
      "doi": ""
    },
    {
      "text": "Natalie Rusk, Mitchel Resnick, Robbie Berg, and Margaret Pezalla-Granlund. 2007. New pathways into robotics: Strategies for broadening participation. Journal of Science Education and Technology 17, 1 (2007), 59–69. https://doi.org/10.1007/s10956-007-9082-2",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of Design. CoDesign 4, 1 (2008), 5–18. https://doi.org/10.1080/15710880701875068",
      "doi": ""
    },
    {
      "text": "Kimberly Scott, Gregory Aist, and Xiaolong Zhang. 2014. Designing a Culturally Responsive Computing Curriculum for Girls. International Journal of Gender, Science and Technology 6, 2 (Jul. 2014), 264–276. https://genderandset.open.ac.uk/index.php/genderandset/article/view/361",
      "doi": ""
    },
    {
      "text": "Kimberly A Scott, Kimberly M Sheridan, and Kevin Clark. 2015. Culturally responsive computing: A theory revisited. Learning, Media and Technology 40, 4 (2015), 412–436.",
      "doi": ""
    },
    {
      "text": "Danya Marie Serrano Corkin, Adem Ekmekci, and Alice Fisher. 2020. Integrating culture, art, geometry, and coding to enhance computer science motivation among underrepresented minoritized high school students. The Urban Review 52, 5 (2020), 950–969. https://doi.org/10.1007/s11256-020-00586-8",
      "doi": ""
    },
    {
      "text": "Kristian T. Simsarian. 2003. Take it to the next stage: the roles of role playing in the design process. CHI ’03 extended abstracts on Human factors in computing systems - CHI ’03 (2003). https://doi.org/10.1145/765891.766123",
      "doi": "10.1145/765891.766123"
    },
    {
      "text": "Jaemarie Solyst, Tara Nkrumah, Angela Stewart, Amanda Buddemeyer, Erin Walker, and Amy Ogan. 2022. Running an online synchronous culturally responsive computing camp for Middle School Girls. Proceedings of the 27th ACM Conference on on Innovation and Technology in Computer Science Education Vol. 1(2022). https://doi.org/10.1145/3502718.3524747",
      "doi": "10.1145/3502718.3524747"
    },
    {
      "text": "Pieter Jan Stappers and Elizabeth B.-N. Sanders. 2003. Generative tools for context mapping: tuning the tools. Design and Emotion (2003), 77–81. https://doi.org/10.1201/9780203608173-c14",
      "doi": ""
    },
    {
      "text": "Angela E. B. Stewart, Jaemarie Solyst, Amanda Buddemeyer, Leshell Hatley, Sharon Henderson-Singer, Kimberly Scott, Erin Walker, and Amy Ogan. 2021. Explaining Engagement: Learner Behaviors in a Virtual Coding Camp. In Artificial Intelligence in Education: 22nd International Conference, AIED 2021, Utrecht, The Netherlands, June 14–18, 2021, Proceedings, Part II (Utrecht, The Netherlands). Springer-Verlag, Berlin, Heidelberg, 338–343. https://doi.org/10.1007/978-3-030-78270-2_60",
      "doi": "10.1007/978-3-030-78270-2_60"
    },
    {
      "text": "Anselm Leonard Strauss and Juliet Corbin. 2008. Basics of qualitative research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Dag Svanaes and Gry Seland. 2004. Putting the Users Center Stage. Proceedings of the 2004 conference on Human factors in computing systems - CHI ’04 (2004). https://doi.org/10.1145/985692.985753",
      "doi": "10.1145/985692.985753"
    },
    {
      "text": "Aimee van Wynsberghe. 2013. Designing robots for care: Care centered value-sensitive design. Science and Engineering Ethics 19, 2 (Jun 2013), 407–433. https://doi.org/10.1007/s11948-011-9343-6",
      "doi": ""
    },
    {
      "text": "Paul Vogt, Rianne van den Berghe, Mirjam de Haas, Laura Hoffman, Junko Kanero, Ezgi Mamus, Jean-Marc Montanier, Cansu Oranç, Ora Oudgenoeg-Paz, Daniel Hernández García, Fotios Papadopoulos, Thorsten Schodde, Josje Verhagen, Christopher D. Wallbridgell, Bram Willemsen, Jan de Wit, Tony Belpaeme, Tilbe Göksun, Stefan Kopp, Emiel Krahmer, Aylin C. Küntay, Paul Leseman, and Amit Kumar Pandey. 2019. Second Language Tutoring Using Social Robots: A Large-Scale Study. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 497–505. https://doi.org/10.1109/HRI.2019.8673077",
      "doi": ""
    },
    {
      "text": "Greg Walsh, Elizabeth Foss, Jason Yip, and Allison Druin. 2013. FACIT PD: a framework for analysis and creation of intergenerational techniques for participatory design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2013). https://doi.org/10.1145/2470654.2481400",
      "doi": "10.1145/2470654.2481400"
    },
    {
      "text": "Jennifer Wang. 2017. Is the U.S. education system ready for CS for all?Commun. ACM 60, 8 (2017), 26–28. https://doi.org/10.1145/3108928",
      "doi": "10.1145/3108928"
    },
    {
      "text": "Alicia Nicki Washington. 2020. When twice as good isn’t enough: The case for cultural competence in computing. Proceedings of the 51st ACM Technical Symposium on Computer Science Education (2020), 213–219. https://doi.org/10.1145/3328778.3366792",
      "doi": "10.1145/3328778.3366792"
    },
    {
      "text": "Jason Yip, Tamara Clegg, Elizabeth Bonsignore, Helene Gelderblom, Emily Rhodes, and Allison Druin. 2013. Brownies or bags-of-stuff? Domain expertise in cooperative inquiry with children.Proceedings of the 12th International Conference on Interaction Design and Children (2013), 201–210. https://doi.org/10.1145/2485760.2485763",
      "doi": "10.1145/2485760.2485763"
    }
  ]
}