{
  "doi": "10.1145/3544548.3580638",
  "title": "EpoMemory: Multi-state Shape Memory for Programmable Morphing Interfaces",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2023,
  "badges": [],
  "abstract": "Smart shape-changing materials can be adapted to different usages, which have been leveraged for dynamic affordances and on-demand haptic feedback in HCI. However, the applicability of these materials is often bottlenecked by their complex fabrication and the challenge of programming localized and individually addressable responses. In this work, we propose a toolkit for designing and fabricating programmable morphing objects using off-the-shelf epoxies. Our method involves varying the crosslinker to epoxy resin ratio to control morphing temperatures from 40 ℃ to 90 ℃, either across different regions of a shape memory device or across devices. Functional components (e.g., conductive fabric, magnetic particles) are also incorporated with the epoxy for sensing and active reconfiguration. A toolbox of fabrication methods and a primitive design library are introduced to support design ideation and programmable morphing. Finally, we demonstrate application examples, including morphing toys, a shape-changing input device, and an active window shutter.",
  "authors": [
    {
      "name": "Ke Zhong",
      "institution": "Materials Science and Engineering, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239046",
      "orcid": "0000-0001-8962-0043"
    },
    {
      "name": "Adriane Fernandes Minori",
      "institution": "School of Computer Science, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660781633",
      "orcid": "0000-0001-6586-7164"
    },
    {
      "name": "Di Wu",
      "institution": "School of Architecture, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99660778219/rel-imgonly/_____20230430150809.jpg",
      "acmid": "99660778219",
      "orcid": "0000-0001-5667-5240"
    },
    {
      "name": "Humphrey Yang",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261761",
      "orcid": "0000-0002-3424-0972"
    },
    {
      "name": "Mohammad F. Islam",
      "institution": "Materials Science and Engineering, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475177",
      "orcid": "0000-0001-9253-3709"
    },
    {
      "name": "Lining Yao",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    }
  ],
  "references": [
    {
      "text": "2014 Updated safety assessment of Bisphenol A (BPA) for use in food contact applications: 2014. https://www.fda.gov/media/90124/download. Accessed: 2022-09-09.",
      "doi": ""
    },
    {
      "text": "Abdollahi, S., Davis, A., Miller, J.H. and Feinberg, A.W. 2018. Expert-guided optimization for 3D printing of soft and liquid materials. PloS one. 13, 4 (Apr. 2018), e0194890.",
      "doi": ""
    },
    {
      "text": "Alderighi, T., Malomo, L., Giorgi, D., Pietroni, N., Bickel, B. and Cignoni, P. 2018. Metamolds. ACM transactions on graphics. 37, 4 (Aug. 2018), 1–13.",
      "doi": ""
    },
    {
      "text": "Alexander, J., Roudaut, A., Steimle, J., Hornbæk, K., Bruns Alonso, M., Follmer, S. and Merritt, T. 2018. Grand Challenges in Shape-Changing Interface Research. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2018), 1–14.",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "An, B., Tao, Y., Gu, J., Cheng, T., Chen, X., Zhang, X., Zhao, W., Do, Y., Takahashi, S., Wu, H.-Y. and Others 2018. Thermorph: Democratizing 4D printing of self-folding materials and interfaces. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018), 1–12.",
      "doi": "10.1145/3173574.3173834"
    },
    {
      "text": "Deng, D., Yang, Y., Chen, Y., Lan, X. and Tice, J. 2017. Accurately controlled sequential self-folding structures by polystyrene film. Smart materials & structures. 26, 8 (Jul. 2017), 085040.",
      "doi": ""
    },
    {
      "text": "Deshpande, H., Zheng, C., Starrett, C., Seo, J.H. and Kim, J. 2022. Fab4D : An Accessible Hybrid Approach for Programmable Shaping and Shape Changing Artifacts. Sixteenth International Conference on Tangible, Embedded, and Embodied Interaction.",
      "doi": ""
    },
    {
      "text": "EFSA Panel on food contact materials, enzymes, flavourings and processing aids (CEF) 2010. Scientific Opinion on Bisphenol A: evaluation of a study investigating its neurodevelopmental toxicity, review of recent scientific literature on its toxicity and advice on the Danish risk assessment of Bisphenol A. EFSA journal. 8, 9 (Sep. 2010), 1829.",
      "doi": ""
    },
    {
      "text": "Fang, Z., Song, H., Zhang, Y., Jin, B., Wu, J., Zhao, Q. and Xie, T. 2020. Modular 4D Printing via Interfacial Welding of Digital Light-Controllable Dynamic Covalent Polymer Networks. Matter. 2, 5 (May 2020), 1187–1197.",
      "doi": ""
    },
    {
      "text": "Felton, S., Tolley, M., Demaine, E., Rus, D. and Wood, R. 2014. A method for building self-folding machines. Science. 345, 6197 (2014), 644–646.",
      "doi": ""
    },
    {
      "text": "Felton, S.M., Tolley, M.T., Shin, B., Onal, C.D., Demaine, E.D., Rus, D. and Wood, R.J. 2013. Self-folding with shape memory composites. Soft matter. 9, 32 (2013), 7688–7694.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Leithinger, D., Olwal, A., Hogge, A. and Ishii, H. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation. Uist (2013), 2501988–2502032.",
      "doi": ""
    },
    {
      "text": "Gu, J., Breen, D.E., Hu, J., Zhu, L., Tao, Y., Van de Zande, T., Wang, G., Zhang, Y.J. and Yao, L. 2019. Geodesy. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2019).",
      "doi": ""
    },
    {
      "text": "Gu,J., Narayanan, V., Wang, G., Luo, D., Jain, H., Lu, K., Qin, F., Wang, S., McCann, J. and Yao, L. 2020. Inverse Design Tool for Asymmetrical Self-Rising Surfaces with Color Texture. Symposium on Computational Fabrication (New York, NY, USA, Nov. 2020), 1–12.",
      "doi": ""
    },
    {
      "text": "Han, J.-L., Lai, S.-M. and Chiu, Y.T. 2018. Two-way multi-shape memory properties of peroxide crosslinked ethylene vinyl-acetate copolymer (EVA)/polycaprolactone (PCL) blends. Polymers for Advanced Technologies.",
      "doi": ""
    },
    {
      "text": "Hu, W., Lum, G.Z., Mastrangeli, M. and Sitti, M. 2018. Small-scale soft-bodied robot with multimodal locomotion. Nature.",
      "doi": ""
    },
    {
      "text": "Jackson, J.A., Messner, M.C., Dudukovic, N.A., Smith, W.L., Bekker, L., Moran, B., Golobic, A.M., Pascall, A.J., Duoss, E.B., Loh, K.J. and Spadaccini, C.M. 2018. Field responsive mechanical metamaterials. Science Advances.",
      "doi": ""
    },
    {
      "text": "Kan, V., Vargo, E., Machover, N., Ishii, H., Pan, S., Chen, W. and Kakehi, Y. 2017. Organic Primitives: Synthesis and Design of pH-Reactive Materials using Molecular I/O for Sensing, Actuation, and Interaction. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2017), 989–1000.",
      "doi": "10.1145/3025453.3025952"
    },
    {
      "text": "Krekhov, A., Emmerich, K., Bergmann, P., Cmentowski, S. and Krüger, J. 2017. Self-Transforming Controllers for Virtual Reality First Person Shooters. Proceedings of the Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery. 517–529.",
      "doi": ""
    },
    {
      "text": "Lejonklou, M.H., Dunder, L., Bladin, E., Pettersson, V., Rönn, M., Lind, L., Waldén, T.B. and Lind, P.M. 2017. Effects of low-dose developmental bisphenol A exposure on metabolic parameters and gene expression in male and female Fischer 344 rat offspring. Environmental health perspectives. 125, 6 (Jun. 2017), 067018.",
      "doi": ""
    },
    {
      "text": "Levy-Mishali, M., Zoldan, J. and Levenberg, S. 2009. Effect of scaffold stiffness on myoblast differentiation. Tissue engineering. Part A. 15, 4 (Apr. 2009), 935–944.",
      "doi": ""
    },
    {
      "text": "Liu, J.A.-C., Gillen, J.H., Mishra, S.R., Evans, B.A. and Tracy, J.B. 2019. Photothermally and magnetically controlled reconfiguration of polymer composites for soft robotics. Science Advances.",
      "doi": ""
    },
    {
      "text": "Liu, Y., Han, C., Tan, H. and Du, X. 2010. Thermal, mechanical and shape memory properties of shape memory epoxy resin. Materials science & engineering. A, Structural materials: properties, microstructure and processing. 527, 10–11 (Apr. 2010), 2510–2514.",
      "doi": ""
    },
    {
      "text": "Liu, Y., Shaw, B., Dickey, M.D. and Genzer, J. 2017. Sequential self-folding of polymer sheets. Science advances. 3, 3 (Mar. 2017), e1602417.",
      "doi": ""
    },
    {
      "text": "Luo, D., Gu, J., Qin, F., Wang, G. and Yao, L. 2020. E-seed: Shape-Changing Interfaces that Self Drill. Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2020), 45–57.",
      "doi": "10.1145/3379337.3415855"
    },
    {
      "text": "Luo, L., Zhang, F. and Leng, J. 2022. Shape memory epoxy resin and its composites: From materials to applications. Research (Washington, D.C.). 2022, (Mar. 2022), 9767830.",
      "doi": ""
    },
    {
      "text": "Ma, S., Jiang, Z., Wang, M., Zhang, L., Liang, Y., Zhang, Z., Ren, L. and Ren, L. 2021. 4D printing of PLA/PCL shape memory composites with controllable sequential deformation. Bio-Design and Manufacturing. 4, 4 (Dec. 2021), 867–878.",
      "doi": ""
    },
    {
      "text": "Mao, Y., Yu, K., Isakov, M.S., Wu, J., Dunn, M.L. and Jerry Qi, H. 2015. Sequential Self-Folding Structures by 3D Printed Digital Shape Memory Polymers. Scientific reports. 5, (Sep. 2015), 13616.",
      "doi": ""
    },
    {
      "text": "Morphlour: https://dl.acm.org/doi/abs/10.1145/3332165.3347949. Accessed: 2022-04-07.",
      "doi": ""
    },
    {
      "text": "Nakagaki, K., Dementyev, A., Follmer, S., Paradiso, J.A. and Ishii, H. 2016. ChainFORM: A Linear Integrated Modular Hardware System for Shape Changing Interfaces. Proceedings of the 29th Annual Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2016), 87–96.",
      "doi": "10.1145/2984511.2984587"
    },
    {
      "text": "Nakagaki, K., Follmer, S. and Ishii, H. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (New York, NY, USA, Nov. 2015), 333–339.",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Narumi, K., Qin, F., Liu, S., Cheng, H.-Y., Gu, J., Kawahara, Y., Islam, M. and Yao, L. 2019. Self-healing UI: Mechanically and Electrically Self-healing Materials for Sensing and Actuation Interfaces. Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2019), 293–306.",
      "doi": "10.1145/3332165.3347901"
    },
    {
      "text": "Peng, B., Yang, Y. and Cavicchi, K.A. 2020. Sequential shapeshifting 4D printing: programming the pathway of multi-shape transformation by 3D printing stimuli-responsive polymers. Multifunctional Materials. 3, 4 (Dec. 2020), 042002.",
      "doi": ""
    },
    {
      "text": "Prathumrat, P., Tiptipakorn, S. and Rimdusit, S. 2017. Multiple-shape memory polymers from benzoxazine–urethane copolymers. Smart Materials and Structures.",
      "doi": ""
    },
    {
      "text": "Qamar, I.P.S., Groh, R., Holman, D. and Roudaut, A. 2018. HCI meets Material Science: A Literature Review of Morphing Materials for the Design of Shape-Changing Interfaces. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2018), 1–23.",
      "doi": "10.1145/3173574.3173948"
    },
    {
      "text": "Qin, F., Cheng, H.-Y., Sneeringer, R., Vlachostergiou, M., Acharya, S., Liu, H., Majidi, C., Islam, M. and Yao, L. 2021. ExoForm: Shape Memory and Self-Fusing Semi-Rigid Wearables. Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2021), 1–8.",
      "doi": ""
    },
    {
      "text": "Ryu, N., Lee, W., Kim, M.J. and Bianchi, A. 2020. ElaStick: A Handheld Variable Stiffness Display for Rendering Dynamic Haptic Response of Flexible Object. Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2020), 1035–1045.",
      "doi": "10.1145/3379337.3415862"
    },
    {
      "text": "Siddiqui, Z., Smay, J. and Azoug, A. 2022. Highly tunable actuation and mechanical properties of 4D-printed nematic liquid crystal elastomers. Mechanics of materials: an international journal. 170, 104329 (Jul. 2022), 104329.",
      "doi": ""
    },
    {
      "text": "Sun, L., Yang, Y., Chen, Y., Li, J., Luo, D., Liu, H., Yao, L., Tao, Y. and Wang, G. 2021. ShrinCage: 4D Printing Accessories that Self-Adapt. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2021), 1–12.",
      "doi": "10.1145/3411764.3445220"
    },
    {
      "text": "Suzuki, R., Zheng, C., Kakehi, Y., Yeh, T., Do, E.Y.-L., Gross, M.D. and Leithinger, D. 2019. ShapeBots: Shape-changing Swarm Robots. Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2019), 493–505.",
      "doi": "10.1145/3332165.3347911"
    },
    {
      "text": "Tahouni, Y., Cheng, T., Wood, D., Sachse, R., Thierer, R., Bischoff, M. and Menges, A. 2020. Self-shaping Curved Folding: A 4D-printing method for fabrication of self-folding curved crease structures. Symposium on Computational Fabrication (New York, NY, USA, Nov. 2020), 1–11.",
      "doi": "10.1145/3424630.3425416"
    },
    {
      "text": "Tahouni, Y., Krüger, F., Poppinga, S., Wood, D., Pfaff, M., Rühe, J., Speck, T. and Menges, A. 2021. Programming sequential motion steps in 4D-printed hygromorphs by architected mesostructure and differential hygro-responsiveness. Bioinspiration & biomimetics. 16, 5 (Jul. 2021). DOI:https://doi.org/10.1088/1748-3190/ac0c8e.",
      "doi": ""
    },
    {
      "text": "Tahouni, Y., Qamar, I.P.S. and Mueller, S. 2020. NURBSforms: A Modular Shape-Changing Interface for Prototyping Curved Surfaces. Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (New York, NY, USA, Feb. 2020), 403–409.",
      "doi": "10.1145/3374920.3374927"
    },
    {
      "text": "Teoh, J.E.M., Zhao, Y., An, J., Chua, C.K. and Liu, Y. 2017. Multi-stage responsive 4D printed smart structure through varying geometric thickness of shape memory polymer. Smart materials & structures. 26, 12 (Oct. 2017), 125001.",
      "doi": ""
    },
    {
      "text": "Valkeneers, T., Leen, D., Ashbrook, D. and Ramakers, R. 2019. StackMold: Rapid prototyping of functional multi-material objects with selective levels of surface details. Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2019).",
      "doi": "10.1145/3332165.3347915"
    },
    {
      "text": "Wang, G., Qin, F., Liu, H., Tao, Y., Zhang, Y., Zhang, Y.J. and Yao, L. 2020. MorphingCircuit: An Integrated Design, Simulation, and Fabrication Workflow for Self-morphing Electronics. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4 (Dec. 2020), 1–26.",
      "doi": "10.1145/3432232"
    },
    {
      "text": "Wang, G., Tao, Y., Capunaman, O.B., Yang, H. and Yao, L. 2019. A-line: 4D Printing Morphing Linear Composite Structures. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery. 1–12.",
      "doi": ""
    },
    {
      "text": "Wang, G., Yang, H., Yan, Z., Gecer Ulu, N., Tao, Y., Gu, J., Kara, L.B. and Yao, L. 2018. 4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces. Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2018), 623–635.",
      "doi": "10.1145/3242587.3242625"
    },
    {
      "text": "Wang, G., Yao, L., Wang, W., Ou, J., Cheng, C.-Y. and Ishii, H. 2016. xPrint: A Modularized Liquid Printer for Smart Materials Deposition. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2016), 5743–5752.",
      "doi": "10.1145/2858036.2858281"
    },
    {
      "text": "Wei, T.-Y., Tsai, H.-R., Liao, Y.-S., Tsai, C., Chen, Y.-S., Wang, C. and Chen, B.-Y. 2020. ElastiLinks: Force Feedback between VR Controllers with Dynamic Points of Application of Force. Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery. 1023–1034.",
      "doi": ""
    },
    {
      "text": "Yan, W., Rudolph, T., Noechel, U., Gould, O., Behl, M., Kratz, K. and Lendlein, A. 2018. Reversible Actuation of Thermoplastic Multiblock Copolymers with Overlapping Thermal Transitions of Crystalline and Glassy Domains. Macromolecules.",
      "doi": ""
    },
    {
      "text": "Yang, H., Johnson, T., Zhong, K., Patel, D., Olson, G., Majidi, C., Islam, M. and Yao, L. 2022. ReCompFig: Designing dynamically reconfigurable kinematic devices using compliant mechanisms and tensioning cables. CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2022).",
      "doi": "10.1145/3491102.3502065"
    },
    {
      "text": "Yang, H., Luo, D., Qian, K. and Yao, L. 2021. Freeform Fabrication of Fluidic Edible Materials. Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Yang, H., Qian, K., Liu, H., Yu, Y., Gu, J., McGehee, M., Zhang, Y.J. and Yao, L. 2020. SimuLearn: Fast and Accurate Simulator to Support Morphing Materials Design and Workflows. Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (New York, NY, USA, Oct. 2020), 71–84.",
      "doi": "10.1145/3379337.3415867"
    },
    {
      "text": "Yao, L., Ou, J., Cheng, C.-Y., Steiner, H., Wang, W., Wang, G. and Ishii, H. 2015. BioLogic: natto cells as nanoactuators for shape changing interfaces. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 1–10.",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Ze, Q., Kuang, X., Wu, S., Wong, J., Montgomery, S.M., Zhang, R., Kovitz, J.M., Yang, F., Qi, H.J. and Zhao, R. 2020. Magnetic Shape Memory Polymers with Integrated Multifunctional Shape Manipulation. Advanced materials . 32, 4 (Jan. 2020), e1906657.",
      "doi": ""
    },
    {
      "text": "Zehnder, J., Knoop, E., Bächer, M. and Thomaszewski, B. 2017. Metasilicone. ACM transactions on graphics. 36, 6 (Nov. 2017), 1–13.",
      "doi": ""
    },
    {
      "text": "Zoran, A. and Cohen, D. 2018. Digital konditorei. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2018).",
      "doi": ""
    }
  ]
}