{
  "doi": "10.1145/3544548.3581133",
  "title": "CatAlyst: Domain-Extensible Intervention for Preventing Task Procrastination Using Large Generative Models",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2023,
  "badges": [],
  "abstract": "CatAlyst uses generative models to help workers’ progress by influencing their task engagement instead of directly contributing to their task outputs. It prompts distracted workers to resume their tasks by generating a continuation of their work and presenting it as an intervention that is more context-aware than conventional (predetermined) feedback. The prompt can function by drawing their interest and lowering the hurdle for resumption even when the generated continuation is insufficient to substitute their work, while recent human-AI collaboration research aiming at work substitution depends on a stable high accuracy. This frees CatAlyst from domain-specific model-tuning and makes it applicable to various tasks. Our studies involving writing and slide-editing tasks demonstrated CatAlyst’s effectiveness in helping workers swiftly resume tasks with a lowered cognitive load. The results suggest a new form of human-AI collaboration where large generative models publicly available but imperfect for each individual domain can contribute to workers’ digital well-being.",
  "authors": [
    {
      "name": "Riku Arakawa",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365318",
      "orcid": "0000-0001-7868-4754"
    },
    {
      "name": "Hiromu Yakura",
      "institution": "University of Tsukuba, Japan and National Institute of Advanced Industrial Science and Technology (AIST), Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527198",
      "orcid": "0000-0002-2558-735X"
    },
    {
      "name": "Masataka Goto",
      "institution": "National Institute of Advanced Industrial Science and Technology (AIST), Japan",
      "img": "/do/10.1145/contrib-81100017919/rel-imgonly/masatakagoto.jpg",
      "acmid": "81100017919",
      "orcid": "0000-0003-1167-0977"
    }
  ],
  "references": [
    {
      "text": "Alexander Travis Adams, Jean Marcel dos Reis Costa, Malte F. Jung, and Tanzeem Choudhury. 2015. Mindless Computing: Designing Technologies to Subtly Influence Behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, New York, NY, 719–730. https://doi.org/10.1145/2750858.2805843",
      "doi": "10.1145/2750858.2805843"
    },
    {
      "text": "Saleema Amershi, Daniel S. Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi T. Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 3:1–3:13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Lasse F. Wolff Anthony, Benjamin Kanding, and Raghavendra Selvan. 2020. Carbontracker: Tracking and Predicting the Carbon Footprint of Training Deep Learning Models. In Proceedings of the 2020 ICML Workshop on Challenges in Deploying and monitoring Machine Learning Systems. arXiv, Ithaca, NY, 11 pages.",
      "doi": ""
    },
    {
      "text": "Riku Arakawa and Hiromu Yakura. 2020. INWARD: A Computer-Supported Tool for Video-Reflection Improves Efficiency and Effectiveness in Executive Coaching. In Proceeding of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1–13. https://doi.org/10.1145/3313831.3376703",
      "doi": "10.1145/3313831.3376703"
    },
    {
      "text": "Riku Arakawa and Hiromu Yakura. 2021. Mindless Attractor: A False-Positive Resistant Intervention for Drawing Attention Using Auditory Perturbation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 99:1–99:15. https://doi.org/10.1145/3411764.3445339",
      "doi": "10.1145/3411764.3445339"
    },
    {
      "text": "Riku Arakawa and Hiromu Yakura. 2022. AI for human assessment: What do professional assessors need?arXiv abs/2204.08471(2022). https://doi.org/10.48550/arXiv.2204.08471",
      "doi": ""
    },
    {
      "text": "Joel Baer. 2021. Neural Filters: What Photoshop’s Powerful New AI Tools can Do. https://blog.adobe.com/en/publish/2021/01/15/neural-filters-what-photoshop-s-powerful-new-ai-tools-can-do. Last accessed on September 1, 2022.",
      "doi": ""
    },
    {
      "text": "Malikeh Beheshtifar, Hadis Hoseinifar, and Moghadam Nekoie Moghadam. 2011. Effect Procrastination on Work-Related Stress. European Journal of Economics, Finance and Administrative Sciences 38, 38(2011), 59–64.",
      "doi": ""
    },
    {
      "text": "Emily M. Bender, Timnit Gebru, Angelina McMillan-Major, and Shmargaret Shmitchell. 2021. On the Dangers of Stochastic Parrots: Can Language Models Be Too Big?. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. ACM, New York, NY, 610–623. https://doi.org/10.1145/3442188.3445922",
      "doi": "10.1145/3442188.3445922"
    },
    {
      "text": "Daniel E Berlyne. 1960. Conflict, Arousal, and Curiosity. McGraw-Hill, New York, NY.",
      "doi": ""
    },
    {
      "text": "Angela M. Zavaleta Bernuy, Ziwen Han, Hammad Shaikh, Qi Yin Zheng, Lisa-Angelique Lim, Anna N. Rafferty, Andrew Petersen, and Joseph Jay Williams. 2022. How can Email Interventions Increase Students’ Completion of Online Homework? A Case Study Using A/B Comparisons. In Proceedings of the 12th International Learning Analytics and Knowledge Conference. ACM, New York, NY, 107–118. https://doi.org/10.1145/3506860.3506874",
      "doi": "10.1145/3506860.3506874"
    },
    {
      "text": "Angela M. Zavaleta Bernuy, Qi Yin Zheng, Hammad Shaikh, Andrew Petersen, and Joseph Jay Williams. 2021. Investigating the Impact of Online Homework Reminders Using Randomized A/B Comparisons. In Proceedings of the he 52nd ACM Technical Symposium on Computer Science Education. ACM, New York, NY, 921–927. https://doi.org/10.1145/3408877.3432427",
      "doi": "10.1145/3408877.3432427"
    },
    {
      "text": "Petter Bae Brandtzæg and Asbjørn Følstad. 2017. Why People Use Chatbots. In Proceedings of the 4th International Conference on Internet Science, Vol. 10673. Springer, Cham, Switzerland, 377–392. https://doi.org/10.1007/978-3-319-70284-1_30",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS: A ‘Quick and Dirty’ Usability Scale. In Usability Evaluation In Industry, Patrick W. Jordan, B. Thomas, Ian Lyall McClelland, and Bernard Weerdmeester (Eds.). CRC Press, London, UK, 207–212.",
      "doi": ""
    },
    {
      "text": "Tom B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Wu, Clemens Winter, Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. In Proceedings of the 2020 Annual Conference on Neural Information Processing Systems. Curran Associates, Red Hook, NY, 1877–1901.",
      "doi": ""
    },
    {
      "text": "James C. Byers, Alvah C. Bittner, and Susan G. Hill. 1989. Traditional and Raw Task Load Index (TLX) Correlations: Are Paired Comparisons Necessary?. In Proceedings of the 1989 Annual International Industrial Ergonomics and Safety Conference. Taylor & Francis, Philadelphia, PA, 481–485.",
      "doi": ""
    },
    {
      "text": "Mia Xu Chen, Benjamin N. Lee, Gagan Bansal, Yuan Cao, Shuyuan Zhang, Justin Lu, Jackie Tsay, Yinan Wang, Andrew M. Dai, Zhifeng Chen, Timothy Sohn, and Yonghui Wu. 2019. Gmail Smart Compose: Real-Time Assisted Writing. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. ACM, New York, NY, 2287–2295. https://doi.org/10.1145/3292500.3330723",
      "doi": "10.1145/3292500.3330723"
    },
    {
      "text": "Hyunsung Cho, Daeun Choi, Donghwi Kim, Wan Ju Kang, Eun Kyoung Choe, and Sung-Ju Lee. 2021. Reflect, not Regret: Understanding Regretful Smartphone Use with App Feature-Level Analysis. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 456:1–456:36. https://doi.org/10.1145/3479600",
      "doi": "10.1145/3479600"
    },
    {
      "text": "Jaemin Cho, Abhay Zala, and Mohit Bansal. 2022. DALL-Eval: Probing the Reasoning Skills and Social Biases of Text-to-Image Generative Transformers. arXiv 2202.04053(2022), 20 pages.",
      "doi": ""
    },
    {
      "text": "Francesco Cirillo. 2018. The Pomodoro Technique: The Life-Changing Time-Management System. Random House, New York, NY.",
      "doi": ""
    },
    {
      "text": "James Clear. 2015. The Chemistry of Building Better Habits. https://jamesclear.com/chemistry-habits. Last accessed on September 2022.",
      "doi": ""
    },
    {
      "text": "Alexis Conneau, Kartikay Khandelwal, Naman Goyal, Vishrav Chaudhary, Guillaume Wenzek, Francisco Guzmán, Edouard Grave, Myle Ott, Luke Zettlemoyer, and Veselin Stoyanov. 2020. Unsupervised Cross-lingual Representation Learning at Scale. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics. ACL, Stroudsburg, PA, 8440–8451. https://doi.org/10.18653/v1/2020.acl-main.747",
      "doi": ""
    },
    {
      "text": "Hai Dang, Karim Benharrak, Florian Lehmann, and Daniel Buschek. 2022. Beyond Text Generation: Supporting Writers with Continuous Automatic Text Summaries. arXiv 2208.09323(2022), 13 pages. https://doi.org/10.48550/arXiv.2208.09323",
      "doi": ""
    },
    {
      "text": "Roelof Anne Jelle de Vries, Cristina Zaga, Franciszka Bayer, Constance H. C. Drossaert, Khiet P. Truong, and Vanessa Evers. 2017. Experts Get Me Started, Peers Keep Me Going: Comparing Crowd- Versus Expert-Designed Motivational Text Messages for Exercise Behavior Change. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, New York, NY, 155–162. https://doi.org/10.1145/3154862.3154875",
      "doi": "10.1145/3154862.3154875"
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. ACL, Stroudsburg, PA, 4171–4186. https://doi.org/10.18653/v1/n19-1423",
      "doi": ""
    },
    {
      "text": "Berkeley J. Dietvorst, Joseph P. Simmons, and Cade Massey. 2015. Algorithm Aversion: People Erroneously Avoid Algorithms After Seeing Them Err. Journal of Experimental Psychology: General 144, 1 (2015), 114–126. https://doi.org/10.1037/xge0000033",
      "doi": ""
    },
    {
      "text": "B. J. Fogg. 2009. A Behavior Model for Persuasive Design. In Proceedings of the 4th International Conference on Persuasive Technology. ACM, New York, NY, 1–7. https://doi.org/10.1145/1541948.1541999",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Michael D. Frakes and Melissa F. Wasserman. 2016. Procrastination in the Workplace: Evidence from the US Patent Office. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. Advances in Psychology 52 (1988), 139–183. https://doi.org/10.1016/s0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Lauren C. Howe and Jochen I. Menges. 2021. Remote Work Mindsets Predict Emotions and Productivity in Home Office: A Longitudinal Study of Knowledge Workers During the COVID-19 Pandemic. Human–Computer Interaction in press (2021), 1–27. https://doi.org/10.1080/07370024.2021.1987238",
      "doi": ""
    },
    {
      "text": "Ekaterina Jussupow, Izak Benbasat, and Armin Heinzl. 2020. Why Are We Averse Towards Algorithms? A Comprehensive Literature Review on Algorithm Aversion. In Proceedings of the 28th European Conference on Information Systems. AIS, Atlanta, GA, 1–16.",
      "doi": ""
    },
    {
      "text": "Jingoog Kim, Mary Lou Maher, and Safat Siddiqui. 2021. Studying the Impact of AI-based Inspiration on Human Ideation in a Co-Creative Design System. In Proceedings of the 2rd ACM IUI Workshops on Human-AI Co-Creation with Generative Models. CEUR-WS.org, Aachen, Germany, 16 pages.",
      "doi": ""
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S. Bernstein. 2018. Rotating Online Behavior Change Interventions Increases Effectiveness But Also Increases Attrition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 95:1–95:25. https://doi.org/10.1145/3274364",
      "doi": "10.1145/3274364"
    },
    {
      "text": "Clarry H. Lay. 1986. At Last, My Research Article on Procrastination. Journal of Research in Personality 20, 4 (1986), 474–495. https://doi.org/10.1016/0092-6566(86)90127-3",
      "doi": ""
    },
    {
      "text": "Mina Lee, Percy Liang, and Qian Yang. 2022. CoAuthor: Designing a Human-AI Collaborative Writing Dataset for Exploring Language Model Capabilities. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 388:1–388:19. https://doi.org/10.1145/3491102.3502030",
      "doi": "10.1145/3491102.3502030"
    },
    {
      "text": "Florian Lehmann and Daniel Buschek. 2021. Examining Autocompletion as a Basic Concept for Interaction with Generative AI. i-com 19, 3 (2021), 251–264. https://doi.org/10.1515/icom-2020-0025",
      "doi": ""
    },
    {
      "text": "Da-Wei Li, Danqing Huang, Tingting Ma, and Chin-Yew Lin. 2021. Towards Topic-Aware Slide Generation For Academic Papers With Unsupervised Mutual Learning. In Proceedings of the 35th AAAI Conference on Artificial Intelligence. AAAI Press, Palo Alto, CA, 13243–13251.",
      "doi": ""
    },
    {
      "text": "Yuyu Lin, Jiahao Guo, Yang Chen, Cheng Yao, and Fangtian Ying. 2020. It Is Your Turn: Collaborative Ideation With a Co-Creative Robot through Sketch. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1–14. https://doi.org/10.1145/3313831.3376258",
      "doi": "10.1145/3313831.3376258"
    },
    {
      "text": "Erin Chao Ling, Iis Tussyadiah, Aarni Tuomi, Jason Stienmetz, and Athina Ioannou. 2021. Factors Influencing Users’ Adoption and Use of Conversational Agents: A Systematic Review. Psychology & Marketing 38, 7 (2021), 1031–1051. https://doi.org/10.1002/mar.21491",
      "doi": ""
    },
    {
      "text": "Yikun Liu, Yuan Jia, Wei Pan, and Mark S. Pfaff. 2014. Supporting Task Resumption Using Visual Feedback. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work. ACM, New York, NY, 767–777. https://doi.org/10.1145/2531602.2531710",
      "doi": "10.1145/2531602.2531710"
    },
    {
      "text": "Ryan Louie, Andy Coenen, Cheng Zhi Huang, Michael Terry, and Carrie J. Cai. 2020. Novice-AI Music Co-Creation via AI-Steering Tools for Deep Generative Models. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1–13. https://doi.org/10.1145/3313831.3376739",
      "doi": "10.1145/3313831.3376739"
    },
    {
      "text": "Brian Lubars and Chenhao Tan. 2019. Ask Not What AI Can Do, but What AI Should Do: Towards a Framework of Task Delegability. In Proceedings of the 2019 Annual Conference on Neural Information Processing Systems. Curran Associates, Red Hook, NY, 57–67.",
      "doi": ""
    },
    {
      "text": "Norman H. Mackworth. 1948. The Breakdown of Vigilance During Prolonged Visual Search. Quarterly Journal of Experimental Psychology 1, 1 (1948), 6–21. https://doi.org/10.1080/17470214808416738",
      "doi": ""
    },
    {
      "text": "Chandra Shekhar Maddila, Sai Surya Upadrasta, Chetan Bansal, Nachiappan Nagappan, Georgios Gousios, and Arie van Deursen. 2022. Nudge: Accelerating Overdue Pull Requests Towards Completion. ACM Transactions on Software Engineering and Methodology 2011.12468 (2022), 30 pages. https://doi.org/10.1145/3544791",
      "doi": "10.1145/3544791"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The Cost of Interrupted Work: More Speed and Stress. In Proceedings of the 2008 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 107–110. https://doi.org/10.1145/1357054.1357072",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Paul M Mastrangelo, Wendi Everton, and Jeffery A Jolton. 2006. Personal Use of Work Computers: Distraction Versus Destruction. CyberPsychology & Behavior 9, 6 (2006), 730–741.",
      "doi": ""
    },
    {
      "text": "Ninareh Mehrabi, Fred Morstatter, Nripsuta Saxena, Kristina Lerman, and Aram Galstyan. 2021. A Survey on Bias and Fairness in Machine Learning. Comput. Surveys 54, 6 (2021), 115:1–115:35. https://doi.org/10.1145/3457607",
      "doi": "10.1145/3457607"
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model Cards for Model Reporting. In Proceedings of the Conference on Fairness, Accountability, and Transparency. ACM, New York, NY, 220–229. https://doi.org/10.1145/3287560.3287596",
      "doi": "10.1145/3287560.3287596"
    },
    {
      "text": "Peter Nemenyi. 1963. Distribution-Free Multiple Comparisons. Ph.D. Dissertation. Princeton University.",
      "doi": ""
    },
    {
      "text": "Raja Parasuraman. 1979. Memory Load and Event Rate Control Sensitivity Decrements in Sustained Attention. Science 205, 4409 (1979), 924–927.",
      "doi": ""
    },
    {
      "text": "Evandro Morais Peixoto, Ana Celi Pallini, Robert J Vallerand, Sonia Rahimi, and Marcus Vinicius Silva. 2021. The Role of Passion for Studies on Academic Procrastination and Mental Health During the COVID-19 Pandemic. Social Psychology of education 24, 3 (2021), 877–893. https://doi.org/10.1007/s11218-021-09636-9",
      "doi": ""
    },
    {
      "text": "Jason Phang, Thibault Févry, and Samuel R. Bowman. 2018. Sentence Encoders on STILTs: Supplementary Training on Intermediate Labeled-data Tasks. CoRR 1811.01088(2018), 12 pages. https://doi.org/10.48550/arXiv.1811.01088",
      "doi": ""
    },
    {
      "text": "Timothy A Pychyl. 2013. Solving the Procrastination Puzzle: A Concise Guide to Strategies for Change. TarcherPerigee, New York, NY.",
      "doi": ""
    },
    {
      "text": "Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J. Liu. 2020. Exploring the Limits of Transfer Learning with a Unified Text-to-Text Transformer. Journal of Machine Learning Research 21 (2020), 140:1–140:67.",
      "doi": ""
    },
    {
      "text": "Laria Reynolds and Kyle McDonell. 2021. Prompt Programming for Large Language Models: Beyond the Few-Shot Paradigm. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 314:1–314:7. https://doi.org/10.1145/3411763.3451760",
      "doi": "10.1145/3411763.3451760"
    },
    {
      "text": "Joaquin Alfredo Rodriguez, Gabriele Piccoli, and Marcin Bartosiak. 2019. Nudging the Classroom: Designing a Socio-Technical Artifact to Reduce Academic Procrastination. In Proceedings of the 52nd Hawaii International Conference on System Sciences. ScholarSpace, Honolulu, HI, 1–10.",
      "doi": ""
    },
    {
      "text": "Melissa Roemmele and Andrew S. Gordon. 2015. Creative Help: A Story Writing Assistant. In Proceedings of the 8th International Conference on Interactive Digital Storytelling, Vol. 9445. Springer, Cham, Switzerland, 81–92. https://doi.org/10.1007/978-3-319-27036-4_8",
      "doi": ""
    },
    {
      "text": "Robin Rombach, Andreas Blattmann, Dominik Lorenz, Patrick Esser, and Björn Ommer. 2022. High-Resolution Image Synthesis With Latent Diffusion Models. In Proceedings of the 2022 IEEE/CVF Conference on Computer Vision and Pattern Recognition. Computer Vision Foundation (CVF) / IEEE, New York, NY, 10684–10695.",
      "doi": ""
    },
    {
      "text": "C. Douglas Saddler and Laurie A. Sacks. 1993. Multidimensional Perfectionism and Academic Procrastination: Relationships with Depression in University Student. Psychological Reports 73, 3 (1993), 863–871. Issue 1. https://doi.org/10.1177/00332941930733pt123",
      "doi": ""
    },
    {
      "text": "Timo Schick, Jane Dwivedi-Yu, Zhengbao Jiang, Fabio Petroni, Patrick Lewis, Gautier Izacard, Qingfei You, Christoforos Nalmpantis, Edouard Grave, and Sebastian Riedel. 2022. PEER: A Collaborative Language Model. arXiv 2208.11663(2022), 22 pages. https://doi.org/10.48550/arXiv.2208.11663",
      "doi": ""
    },
    {
      "text": "Henri C. Schouwenburg. 1992. Procrastinators and Fear of Failure: An Exploration of Reasons for Procrastination. European Journal of Personality 6, 3 (1992), 225–236. https://doi.org/10.1002/per.2410060305",
      "doi": ""
    },
    {
      "text": "Athar Sefid, Jian Wu, Prasenjit Mitra, and C. Lee Giles. 2019. Automatic Slide Generation for Scientific Papers. In Proceedings of the 3rd International Workshop on Capturing Scientific Knowledge, Vol. 2526. CEUR-WS.org, Aachen, Germany, 11–16.",
      "doi": ""
    },
    {
      "text": "Hanieh Shakeri, Carman Neustaedter, and Steve DiPaola. 2021. SAGA: Collaborative Storytelling with GPT-3. In Companion Publication of the 2021 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, 163–166. https://doi.org/10.1145/3462204.3481771",
      "doi": "10.1145/3462204.3481771"
    },
    {
      "text": "Emily Sheng, Kai-Wei Chang, Premkumar Natarajan, and Nanyun Peng. 2019. The Woman Worked as a Babysitter: On Biases in Language Generation. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing. ACL, Stroudsburg, PA, 3405–3410. https://doi.org/10.18653/v1/D19-1339",
      "doi": ""
    },
    {
      "text": "Nikhil Singh, Guillermo Bernal, Daria Savchenko, and Elena L. Glassman. 2022. Where to Hide a Stolen Elephant: Leaps in Creative Writing with Multimodal Machine Intelligence. ACM Transactions on Computer-Human Interaction in press (2022), 53 pages. https://doi.org/10.1145/3511599",
      "doi": "10.1145/3511599"
    },
    {
      "text": "Konrad Sowa, Aleksandra Przegalinska, and Leon Ciechanowski. 2021. Cobots in Knowledge Work. Journal of Business Research 125 (2021), 135–142. https://doi.org/10.1016/j.jbusres.2020.11.038",
      "doi": ""
    },
    {
      "text": "Aarohi Srivastava 2022. Beyond the Imitation Game: Quantifying and Extrapolating the Capabilities of Language Models. arXiv abs/2206.04615(2022). https://doi.org/10.48550/arXiv.2206.04615",
      "doi": ""
    },
    {
      "text": "Jan Willem Streefkerk, Myra P. van Esch-Bussemakers, and Mark A. Neerincx. 2008. Field Evaluation of a Mobile Location-Based Notification System for Police Officers. In Proceedings of the 10th Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, New York, NY, 101–108. https://doi.org/10.1145/1409240.1409252",
      "doi": "10.1145/1409240.1409252"
    },
    {
      "text": "Emma Strubell, Ananya Ganesh, and Andrew McCallum. 2020. Energy and Policy Considerations for Modern Deep Learning Research. In Proceedings of the 34th AAAI Conference on Artificial Intelligence. AAAI Press, Palo Alto, CA, 13693–13696.",
      "doi": ""
    },
    {
      "text": "Minhyang (Mia) Suh, Emily Youngblom, Michael Terry, and Carrie J. Cai. 2021. AI as Social Glue: Uncovering the Roles of Deep Generative AI During Social Music Composition. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 582:1–582:11. https://doi.org/10.1145/3411764.3445219",
      "doi": "10.1145/3411764.3445219"
    },
    {
      "text": "Richard H. Thaler and Cass R. Sunstein. 2008. Nudge: Improving Decisions About Health, Wealth, and Happiness. Yale University Press, New Haven, CT.",
      "doi": ""
    },
    {
      "text": "Chinchu Thomas and Dinesh Babu Jayagopi. 2017. Predicting Student Engagement in Classrooms Using Facial Behavioral Cues. In Proceedings of the 1st ACM SIGCHI International Workshop on Multimodal Interaction for Education. ACM, New York, NY, 33–40.",
      "doi": "10.1145/3139513.3139514"
    },
    {
      "text": "Bin Wang, Yukun Liu, Jing Qian, and Sharon K. Parker. 2020. Achieving Effective Remote Working During the COVID-19 Pandemic: A Work Design Perspective. Applied Psychology 70, 1 (2020), 16–59. https://doi.org/10.1111/apps.12290",
      "doi": ""
    },
    {
      "text": "Chatchai Wangwiwattana, Sunjoli Aggarwal, and Eric C. Larson. 2021. Writers Gonna Wait: The Effectiveness of Notifications to Initiate Aversive Action in Writing Procrastination. arXiv 2101.10191(2021), 13 pages. https://doi.org/10.48550/arXiv.2101.10191",
      "doi": ""
    },
    {
      "text": "Christopher D. Wickens. 2021. Attention: Theory, Principles, Models and Applications. International Journal of Human-Computer Interaction 37, 5(2021), 403–417. https://doi.org/10.1080/10447318.2021.1874741",
      "doi": ""
    },
    {
      "text": "Hiromu Yakura, Tomoyasu Nakano, and Masataka Goto. 2022. An Automated System Recommending Background Music to Listen to While Working. User Modeling and User-Adapted Interactions 32, 3 (2022), 355–388.",
      "doi": "10.1007/s11257-022-09325-y"
    },
    {
      "text": "Chuan Yan, John Joon Young Chung, Yoon Kiheon, Yotam I. Gingold, Eytan Adar, and Sungsoo Ray Hong. 2022. FlatMagic: Improving Flat Colorization through AI-driven Design for Digital Comic Professionals. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 380:1–380:17. https://doi.org/10.1145/3491102.3502075",
      "doi": "10.1145/3491102.3502075"
    },
    {
      "text": "Daijin Yang, Yanpeng Zhou, Zhiyuan Zhang, Toby Jia-Jun Li, and Ray LC. 2022. AI as an Active Writer: Interaction Strategies with Generated Text in Human-AI Collaborative Fiction Writing. In Proceedings of the 3rd ACM IUI Workshops on Human-AI Co-Creation with Generative Models. CEUR-WS.org, Aachen, Germany, 56–65.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Penstein Rosé, and John Zimmerman. 2020. Re-examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fitting Intelligent Decision Support into Critical, Clinical Decision-Making Processes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 238. https://doi.org/10.1145/3290605.3300468",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna M. Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 279. https://doi.org/10.1145/3290605.3300509",
      "doi": "10.1145/3290605.3300509"
    },
    {
      "text": "Ann Yuan, Andy Coenen, Emily Reif, and Daphne Ippolito. 2022. Wordcraft: Story Writing With Large Language Models. In Proceedings of the 27th International Conference on Intelligent User Interfaces. ACM, New York, NY, 841–852. https://doi.org/10.1145/3490099.3511105",
      "doi": "10.1145/3490099.3511105"
    },
    {
      "text": "Chao Zhang, Cheng Yao, Jiayi Wu, Weijia Lin, Lijuan Liu, Ge Yan, and Fangtian Ying. 2022. StoryDrawer: A Child-AI Collaborative Drawing System to Support Children’s Creative Visual Storytelling. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 311:1–311:15. https://doi.org/10.1145/3491102.3501914",
      "doi": "10.1145/3491102.3501914"
    },
    {
      "text": "Chao Zhang, Zili Zhou, Jiayi Wu, Yajing Hu, Yaping Shao, Jianhui Liu, Yuqi Hu, Fangtian Ying, and Cheng Yao. 2021. Bio Sketchbook: An AI-assisted Sketching Partner for Children’s Biodiversity Observational Learning. In Proceedings of the 20th ACM Interaction Conference on Design and Children, Athens. ACM, New York, NY, 466–470. https://doi.org/10.1145/3459990.3465197",
      "doi": "10.1145/3459990.3465197"
    },
    {
      "text": "Chengbo Zheng, Dakuo Wang, April Yi Wang, and Xiaojuan Ma. 2022. Telling Stories from Computational Notebooks: AI-Assisted Presentation Slides Creation for Presenting Data Science Work. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 53:1–53:20. https://doi.org/10.1145/3491102.3517615",
      "doi": "10.1145/3491102.3517615"
    },
    {
      "text": "Albert Ziegler, Eirini Kalliamvakou, X. Alice Li, Andrew Rice, Devon Rifkin, Shawn Simister, Ganesh Sittampalam, and Edward Aftandilian. 2022. Productivity Assessment of Neural Code Completion. In Proceedings of the 6th ACM SIGPLAN International Symposium on Machine Programming. ACM, New York, NY, 21–29. https://doi.org/10.1145/3520312.3534864",
      "doi": "10.1145/3520312.3534864"
    }
  ]
}