{
  "doi": "10.1145/3544548.3580894",
  "title": "Grab It, While You Can: A VR Gesture Evaluation of a Co-Designed Traditional Narrative by Indigenous People",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "Recent developments in Virtual Reality (VR) applications, such as hand gesture tracking, provide new opportunities to create embodied user experiences. Numerous gesture elicitation studies have been conducted. However, in most instances they lack validation of implemented gestures, as well diversity of participant groups. Our research explores the digitalization of intangible cultural heritage in collaboration with one of the San tribes in Southern Africa. The focus is on particular gestures as embodied interactions of a VR implementation of a traditional San hunting story. In this paper, we present a gesture study, which entails an in-situ elicitation of natural gestures, a co-designed integration, a VR story implementation with grasping and three mid-air gestures, and a user evaluation. Based on our findings, we discuss the anthropological value of gesture implementations determined by an indigenous community, the local usability of a grasping gesture, and in-VR gesture elicitation, as an extension of existing methods.",
  "authors": [
    {
      "name": "Emilie Maria Nybo Arendttorp",
      "institution": "Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238675",
      "orcid": "0000-0002-0184-4550"
    },
    {
      "name": "Heike Winschiers-Theophilus",
      "institution": "Faculty of Computing and Informatics, Namibia University of Sceince and Technology, Namibia",
      "img": "/do/10.1145/contrib-81508688910/rel-imgonly/nustnpportrait.jpg",
      "acmid": "81508688910",
      "orcid": "0000-0002-9752-3398"
    },
    {
      "name": "Kasper Rodil",
      "institution": "Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-81488671893/rel-imgonly/img_2262retouched.jpg",
      "acmid": "81488671893",
      "orcid": "0000-0002-6737-7342"
    },
    {
      "name": "Freja B. K. Johansen",
      "institution": "Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660578610",
      "orcid": "0000-0001-7808-5583"
    },
    {
      "name": "Mads Rosengreen Jørgensen",
      "institution": "Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660782452",
      "orcid": "0000-0003-2730-4568"
    },
    {
      "name": "Thomas K. K. Kjeldsen",
      "institution": "Architecture, Design and Media Technology, Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660578418",
      "orcid": "0000-0001-6775-5705"
    },
    {
      "name": "Samkao Magot",
      "institution": "Donkerbos Community, Namibia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660578829",
      "orcid": "0000-0002-3913-5469"
    }
  ],
  "references": [
    {
      "text": "Alex Adkins, Lorraine Lin, Aline Normoyle, Ryan Canales, Yuting Ye, and Sophie Jörg. 2021. Evaluating Grasping Visualizations and Control Modes in a VR Game. ACM Trans. Appl. Percept. 18, 4, Article 19 (oct 2021), 14 pages. https://doi.org/10.1145/3486582",
      "doi": "10.1145/3486582"
    },
    {
      "text": "Roland Aigner, Daniel Wigdor, Hrvoje Benko, Michael Haller, David Lindbauer, Alexandra Ion, Shengdong Zhao, and JTKV Koh. 2012. Understanding mid-air hand gestures: A study of human preferences in usage of gesture types for hci. Microsoft Research TechReport MSR-TR-2012-111 2 (2012), 30.",
      "doi": ""
    },
    {
      "text": "Coren Apicella, Ara Norenzayan, and Joseph Henrich. 2020. Beyond WEIRD: A review of the last decade and a look ahead to the global laboratory of the future. Evolution and Human Behavior 41, 5 (2020), 319–329. https://doi.org/10.1016/j.evolhumbehav.2020.07.015 Beyond Weird.",
      "doi": ""
    },
    {
      "text": "Emilie Maria Nybo Arendttorp, Kasper Rodil, Heike Winschiers-Theophilus, and Christof Magoath. 2022. Overcoming Legacy Bias: Re-Designing Gesture Interactions in Virtual Reality With a San Community in Namibia. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3491102.3517549",
      "doi": "10.1145/3491102.3517549"
    },
    {
      "text": "Doug A Bowman, Ernst Kruijff, Joseph J LaViola Jr, and Ivan Poupyrev. 2001. An introduction to 3-D user interface design. Presence: Teleoperators & Virtual Environments 10, 1(2001), 96–108.",
      "doi": "10.1162/105474601750182342"
    },
    {
      "text": "Volkert Buchmann, Stephen Violich, Mark Billinghurst, and Andy Cockburn. 2004. FingARtips: Gesture Based Direct Manipulation in Augmented Reality. In Proceedings of the 2nd International Conference on Computer Graphics and Interactive Techniques in Australasia and South East Asia (Singapore) (GRAPHITE ’04). Association for Computing Machinery, New York, NY, USA, 212–221. https://doi.org/10.1145/988834.988871",
      "doi": "10.1145/988834.988871"
    },
    {
      "text": "Edwin Chan, Teddy Seyed, Wolfgang Stuerzlinger, Xing-Dong Yang, and Frank Maurer. 2016. User Elicitation on Single-Hand Microgestures. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3403–3414. https://doi.org/10.1145/2858036.2858589",
      "doi": "10.1145/2858036.2858589"
    },
    {
      "text": "Andreea Danielescu and David Piorkowski. 2022. Iterative Design of Gestures During Elicitation: Understanding the Role of Increased Production. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 558, 14 pages. https://doi.org/10.1145/3491102.3501962",
      "doi": "10.1145/3491102.3501962"
    },
    {
      "text": "Lorin Dole and Wendy Ju. 2019. Face and Ecological Validity in Simulations: Lessons from Search-and-Rescue HRI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290605.3300681",
      "doi": "10.1145/3290605.3300681"
    },
    {
      "text": "Cathy Mengying Fang and Chris Harrison. 2021. Retargeted Self-Haptics for Increased Immersion in VR without Instrumentation. In The 34th Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’21). Association for Computing Machinery, New York, NY, USA, 1109–1121. https://doi.org/10.1145/3472749.3474810",
      "doi": "10.1145/3472749.3474810"
    },
    {
      "text": "Kileni Fernando, Terty Fernandy, Simpson Kapembe, Kamati Isay, and Japeni Hoffeni. 2018. . A Contemporary Expression of the Namibian San Communities’ Past and Present Suferings Staged as an Interactive Digital Life Performance. In Digitisation of Culture: Namibian and International Perspectives. Springer, Singapore, 205–221.In Digitisation of Culture: Namibian and International Perspectives. Springer, Singapore, 205–221. https://link.springer.com/book/10.1007/978-981-10-7697-8",
      "doi": ""
    },
    {
      "text": "Christina Harrington and Tawanna R Dillahunt. 2021. Eliciting Tech Futures Among Black Young Adults: A Case Study of Remote Speculative Co-Design. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 397, 15 pages. https://doi.org/10.1145/3411764.3445723",
      "doi": "10.1145/3411764.3445723"
    },
    {
      "text": "Philip Colin Hindley. 2014. Nominal and imperative iconic gestures used by the Khoisan of North West Botswana to coordinate hunting. African Study Monographs 35, 3/4 (2014), 149–181.",
      "doi": ""
    },
    {
      "text": "Lynn Hoff, Eva Hornecker, and Sven Bertel. 2016. Modifying Gesture Elicitation: Do Kinaesthetic Priming and Increased Production Reduce Legacy Bias?. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 86–91. https://doi.org/10.1145/2839462.2839472",
      "doi": "10.1145/2839462.2839472"
    },
    {
      "text": "Simon Hull. 2013. Doing Grounded Theory. https://doi.org/10.6084/M9.FIGSHARE.1050453",
      "doi": ""
    },
    {
      "text": "IWGIA. 2019. Indigenous World 2019: Namibia - IWGIA - International Work Group for Indigenous Affairs. https://www.iwgia.org/en/namibia/3506-iw2019-namibia?fbclid=IwAR30MLwUYti_RnLCYuQAKVeIhFzKPucUt09-3gNlyyPM16j2KiFd6QTLU2g",
      "doi": ""
    },
    {
      "text": "Freja B. K. Johansen, Thomas K. K. Kjeldsen, Mads Rosengren Jørgensen, Samkao Magot, April Magot, Shorty Kandjengo, Heike Winschiers-Theophilus, Emilie Maria Nybo Arendttorp, and Kasper Rodil. 2022. Hunting with the Ju/’hoansi in the Kalahari: A Co-Created VR Gesture Application. In Adjunct Proceedings of the 2022 Nordic Human-Computer Interaction Conference(Aarhus, Denmark) (NordiCHI ’22). Association for Computing Machinery, New York, NY, USA, Article 32, 2 pages. https://doi.org/10.1145/3547522.3547715",
      "doi": "10.1145/3547522.3547715"
    },
    {
      "text": "Calestous Juma. 2016. Innovation and its enemies: Why people resist new technologies. Oxford University Press, Oxford, NY, United States of America.",
      "doi": ""
    },
    {
      "text": "Peter Kaulbach, Helena Afrikaner, Brit Stichel, and Heike Winschiers-Theophilus. 2021. Crafting Communication Protocols with a San Community in Namibia. In 3rd African Human-Computer Interaction Conference: Inclusiveness and Empowerment(Maputo, Mozambique) (AfriCHI 2021). Association for Computing Machinery, New York, NY, USA, 170–173. https://doi.org/10.1145/3448696.3448747",
      "doi": "10.1145/3448696.3448747"
    },
    {
      "text": "Shaimaa Lazem, Danilo Giglitto, Makuochi Samuel Nkwo, Hafeni Mthoko, Jessica Upani, and Anicia Peters. 2022. Challenges and paradoxes in decolonising HCI: A critical discussion. Computer Supported Cooperative Work (CSCW) 31, 2 (2022), 159–196.",
      "doi": "10.1007/s10606-021-09398-0"
    },
    {
      "text": "Wanhong Lin, Lear Du, Carisa Harris-Adamson, Alan Barr, and David Rempel. 2017. Design of Hand Gestures for Manipulating Objects in Virtual Reality. In Human-Computer Interaction. User Interface Design, Development and Multimodality, Masaaki Kurosu (Ed.). Springer International Publishing, Cham, 584–592.",
      "doi": ""
    },
    {
      "text": "Donovan Maasz, Heike Winschiers-Theophilus, Colin Stanley, Kasper Rodil, and Uriaike Mbinge. 2018. A Digital Indigenous Knowledge Preservation Framework: The 7C Model—Repositioning IK Holders in the Digitization of IK. In Digitisation of Culture: Namibian and International Perspectives, Dharm Singh Jat, Jürgen Sieck, Hippolyte N’Sung-Nza Muyingi, Heike Winschiers-Theophilus, Anicia Peters, and Shawulu Nggada (Eds.). Springer Singapore, Singapore, 29–47. https://doi.org/10.1007/978-981-10-7697-8_3",
      "doi": ""
    },
    {
      "text": "Alexander Masurovsky, Paul Chojecki, Detlef Runde, Mustafa Lafci, David Przewozny, and Michael Gaebler. 2020. Controller-Free Hand Tracking for Grab-and-Place Tasks in Immersive Virtual Reality: Design Elements and Their Empirical Study. Multimodal Technologies and Interaction 4, 4 (2020). https://doi.org/10.3390/mti4040091",
      "doi": ""
    },
    {
      "text": "Venture Media. 2021. The San – Namibia’s Earliest Inahbitabts. https://www.thisisnamibia.com/culture/the-san-namibias-earliest-inahbitabts/",
      "doi": ""
    },
    {
      "text": "Samantha Merritt and Shaowen Bardzell. 2011. Postcolonial Language and Culture Theory for HCI4D. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 1675–1680. https://doi.org/10.1145/1979742.1979827",
      "doi": "10.1145/1979742.1979827"
    },
    {
      "text": "SIYAKHA MGUNI. 2015. Termites of the Gods: San cosmology in southern African rock art. Wits University Press, Johannesburg, South Africa. http://www.jstor.org/stable/10.18772/12015037762",
      "doi": ""
    },
    {
      "text": "Microsoft. 2019. HoloLens 2. https://www.microsoft.com/en-us/hololens Accessed 14 September, 2022.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, MC Schraefel, and Jacob O Wobbrock. 2014. Reducing legacy bias in gesture elicitation studies. interactions 21, 3 (2014), 40–45.",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Sarah Muser. 2015. Gestures in Human-Computer-Interaction. Ludwig-Maximilians-University of Munich, Munich.",
      "doi": ""
    },
    {
      "text": "A.A. Navarro-Newball, I. Moreno, E. Prakash, Ali Arya, Victoria Contreras, Victor Quiceno, Santiago Lozano, Juan Mejìa, and Loaiza Diogo. 2016. Gesture based human motion and game principles to aid understanding of science and cultural practices. Multimed Tools Appl 75(2016), 11699––11722.",
      "doi": "10.1007/s11042-015-2667-5"
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic books, 250 West 57th Street, 15th Floor, New York.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Sven Ouzman. 2008. Cosmology of the African San People. In Encyclopaedia of the History of Science, Technology, and Medicine in Non-Western Cultures, Helaine Selin (Ed.). Springer Netherlands, Dordrecht, 644–650. https://doi.org/10.1007/978-1-4020-4425-0_9707",
      "doi": ""
    },
    {
      "text": "Vik Parthiban, Pattie Maes, Quentin Sellier, Arthur Sluÿters, and Jean Vanderdonckt. 2022. Gestural-Vocal Coordinated Interaction on Large Displays. In Companion of the 2022 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (Sophia Antipolis, France) (EICS ’22 Companion). Association for Computing Machinery, New York, NY, USA, 26–32. https://doi.org/10.1145/3531706.3536457",
      "doi": "10.1145/3531706.3536457"
    },
    {
      "text": "Siyou Pei, Alexander Chen, Jaewook Lee, and Yang Zhang. 2022. Hand Interfaces: Using Hands to Imitate Objects in AR/VR for Expressive Interactions. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 429, 16 pages. https://doi.org/10.1145/3491102.3501898",
      "doi": "10.1145/3491102.3501898"
    },
    {
      "text": "Meta Quest. 2022. Oculus Quest 2: Vores mest avancerede, nye alt-i-et VR-headset | Oculus. https://store.facebook.com/dk/da/quest/products/quest-2/",
      "doi": ""
    },
    {
      "text": "Kasper Rodil, Martin Kamp Larsen, Mikkel Laursen, Tobias Frost Andersen, Weronika Korbutt, and Heike Winschiers-Theophilus. 2020. A Demonstration of an Interactive Virtual Reality Prototype for Exploring the Cultural Heritage of Southern African Rock Art. In 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI ’20). Association for Computing Machinery, New York, NY, USA, Article 26, 5 pages. https://doi.org/10.1145/3406324.3410536",
      "doi": "10.1145/3406324.3410536"
    },
    {
      "text": "Kasper Rodil, Donovan Maasz, and Heike Winschiers-Theophilus. 2020. Moving Virtual Reality out of Its Comfort Zone and Into the African Kalahari Desert Field: Experiences From Technological Co-Exploration With an Indigenous San Community in Namibia. In 26th ACM Symposium on Virtual Reality Software and Technology (Virtual Event, Canada) (VRST ’20). Association for Computing Machinery, New York, NY, USA, Article 5, 10 pages. https://doi.org/10.1145/3385956.3418955",
      "doi": "10.1145/3385956.3418955"
    },
    {
      "text": "Alexander Schäfer, Gerd Reis, and Didier Stricker. 2022. AnyGesture: Arbitrary One-Handed Gestures for Augmented, Virtual, and Mixed Reality Applications. Applied Sciences 12, 4 (2022), 1888.",
      "doi": ""
    },
    {
      "text": "Erik J Schlicht and Paul R Schrater. 2007. Effects of visual uncertainty on grasping movements. Experimental Brain Research 182, 1 (2007), 47–57.",
      "doi": ""
    },
    {
      "text": "Santiago Villarreal-Narvaez, Jean Vanderdonckt, Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2020. A Systematic Review of Gesture Elicitation Studies: What Can We Learn from 216 Studies?. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 855–872. https://doi.org/10.1145/3357236.3395511",
      "doi": "10.1145/3357236.3395511"
    },
    {
      "text": "Panagiotis Vogiatzidakis and Panayiotis Koutsabasis. 2018. Gesture elicitation studies for mid-air interaction: A review. Multimodal Technologies and Interaction 2, 4 (2018), 65.",
      "doi": ""
    },
    {
      "text": "Adam S. Williams, Jason Garcia, Fernando De Zayas, Fidel Hernandez, Julia Sharp, and Francisco R. Ortega. 2020. The Cost of Production in Elicitation Studies and the Legacy Bias-Consensus Trade off. Multimodal Technologies and Interaction 4, 4 (2020). https://doi.org/10.3390/mti4040088",
      "doi": ""
    },
    {
      "text": "Heike Winschiers-Theophilus, Tariq Zaman, and Colin Stanley. 2019. A classification of cultural engagements in community technology design: introducing a transcultural approach. Ai & Society 34, 3 (2019), 419–435.",
      "doi": "10.1007/s00146-017-0739-y"
    },
    {
      "text": "Huiyue Wu, Weizhou Luo, Neng Pan, Shenghuan Nan, Yanyi Deng, Shengqian Fu, and Liuqingqing Yang. 2019. Understanding freehand gestures: a study of freehand gestural interaction for immersive VR shopping applications. Human-centric Computing and Information Sciences 9, 1 (2019), 1–26.",
      "doi": "10.1186/s13673-019-0204-7"
    },
    {
      "text": "Haijun Xia, Michael Glueck, Michelle Annett, Michael Wang, and Daniel Wigdor. 2022. Iteratively Designing Gesture Vocabularies: A Survey and Analysis of Best Practices in the HCI Literature. ACM Trans. Comput.-Hum. Interact. 29, 4, Article 37 (may 2022), 54 pages. https://doi.org/10.1145/3503537",
      "doi": "10.1145/3503537"
    },
    {
      "text": "Run Yu and Doug A Bowman. 2018. Force push: Exploring expressive gesture-to-force mappings for remote object manipulation in virtual reality. Frontiers in ICT 5(2018), 25.",
      "doi": ""
    }
  ]
}