{
  "doi": "10.1145/3544548.3581371",
  "title": "ComLittee: Literature Discovery with Personal Elected Author Committees",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2023,
  "badges": [],
  "abstract": "In order to help scholars understand and follow a research topic, significant research has been devoted to creating systems that help scholars discover relevant papers and authors. Recent approaches have shown the usefulness of highlighting relevant authors while scholars engage in paper discovery. However, these systems do not capture and utilize users’ evolving knowledge of authors. We reflect on the design space and introduce ComLittee, a literature discovery system that supports author-centric exploration. In contrast to paper-centric interaction in prior systems, ComLittee’s author-centric interaction supports curating research threads from individual authors, finding new authors and papers using combined signals from a paper recommender and the curated authors’ authorship graphs, and understanding them in the context of those signals. In a within-subjects experiment that compares to a paper-centric discovery system with author-highlighting, we demonstrate how ComLittee improves author and paper discovery.",
  "authors": [
    {
      "name": "Hyeonsu B Kang",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239236",
      "orcid": "0000-0002-1990-2050"
    },
    {
      "name": "Nouran Soliman",
      "institution": "Computer Science & Artificial Intelligence Laboratory, Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527521",
      "orcid": "0000-0001-8846-2098"
    },
    {
      "name": "Matt Latzke",
      "institution": "Allen Institute for AI, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659893734",
      "orcid": "0000-0002-9984-1277"
    },
    {
      "name": "Joseph Chee Chang",
      "institution": "Semantic Scholar, Allen Institute for Artificial Intelligence, United States",
      "img": "/do/10.1145/contrib-99659020706/rel-imgonly/me.jpeg",
      "acmid": "99659020706",
      "orcid": "0000-0002-0798-4351"
    },
    {
      "name": "Jonathan Bragg",
      "institution": "Allen Institute for Artificial Intelligence, United States",
      "img": "/do/10.1145/contrib-81456631418/rel-imgonly/headshot.jpeg",
      "acmid": "81456631418",
      "orcid": "0000-0001-5460-9047"
    }
  ],
  "references": [
    {
      "text": "Rediet Abebe, Nicole Immorlica, Jon Kleinberg, Brendan Lucier, and Ali Shirali. 2022. On the Effect of Triadic Closure on Network Segregation. In Proceedings of the 23rd ACM Conference on Economics and Computation (Boulder, CO, USA) (EC ’22). Association for Computing Machinery, New York, NY, USA, 249–284. https://doi.org/10.1145/3490486.3538322",
      "doi": "10.1145/3490486.3538322"
    },
    {
      "text": "Saleema Amershi, James Fogarty, and Daniel Weld. 2012. Regroup: Interactive Machine Learning for on-Demand Group Creation in Social Networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/2207676.2207680",
      "doi": "10.1145/2207676.2207680"
    },
    {
      "text": "Aili Asikainen, Gerardo Iñiguez, Javier Ureña-Carrión, Kimmo Kaski, and Mikko Kivelä. 2020. Cumulative effects of triadic closure and homophily in social networks. Science Advances 6, 19 (2020), eaax7310.",
      "doi": ""
    },
    {
      "text": "Lutz Bornmann, Robin Haunschild, and Rüdiger Mutz. 2021. Growth rates of modern science: a latent piecewise growth curve approach to model publication numbers from established and new literature databases. Humanities and Social Sciences Communications 8, 1(2021), 1–15.",
      "doi": ""
    },
    {
      "text": "Ronald S Burt. 2004. Structural holes and good ideas. American journal of sociology 110, 2 (2004), 349–399.",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn, Adam Perer, and Aniket Kittur. 2019. SearchLens: Composing and capturing complex user interests for exploratory search. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 498–509.",
      "doi": "10.1145/3301275.3302321"
    },
    {
      "text": "Duen Horng Chau, Aniket Kittur, Jason I. Hong, and Christos Faloutsos. 2011. Apolo: Interactive Large Graph Sensemaking by Combining Machine Learning and Visualization. In Proceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (San Diego, California, USA) (KDD ’11). Association for Computing Machinery, New York, NY, USA, 739–742. https://doi.org/10.1145/2020408.2020524",
      "doi": "10.1145/2020408.2020524"
    },
    {
      "text": "Kiroong Choe, Seokweon Jung, Seokhyeon Park, Hwajung Hong, and Jinwook Seo. 2021. Papers101: Supporting the discovery process in the literature review workflow for novice researchers. In 2021 IEEE 14th Pacific Visualization Symposium (PacificVis). IEEE, 176–180.",
      "doi": ""
    },
    {
      "text": "Johan SG Chu and James A Evans. 2021. Slowed canonical progress in large fields of science. Proceedings of the National Academy of Sciences 118, 41(2021), e2021636118.",
      "doi": ""
    },
    {
      "text": "Arman Cohan, Sergey Feldman, Iz Beltagy, Doug Downey, and Daniel Weld. 2020. SPECTER: Document-level Representation Learning using Citation-informed Transformers. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics. Association for Computational Linguistics, Online, 2270–2282. https://doi.org/10.18653/v1/2020.acl-main.207",
      "doi": ""
    },
    {
      "text": "Mark S Granovetter. 1973. The strength of weak ties. American journal of sociology 78, 6 (1973), 1360–1380.",
      "doi": ""
    },
    {
      "text": "Ido Guy, Uri Avraham, David Carmel, Sigalit Ur, Michal Jacovi, and Inbal Ronen. 2013. Mining expertise and interests from social media. In Proceedings of the 22nd international conference on World Wide Web. 515–526.",
      "doi": "10.1145/2488388.2488434"
    },
    {
      "text": "Ido Guy and David Carmel. 2011. Social recommender systems. In Proceedings of the 20th international conference companion on World wide web. 283–284.",
      "doi": "10.1145/1963192.1963312"
    },
    {
      "text": "Han L Han, Junhang Yu, Raphael Bournet, Alexandre Ciorascu, Wendy E Mackay, and Michel Beaudouin-Lafon. 2022. Passages: Interacting with Text Across Documents. In CHI Conference on Human Factors in Computing Systems. 1–17.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Andrew Head, Kyle Lo, Dongyeop Kang, Raymond Fok, Sam Skjonsberg, Daniel S. Weld, and Marti A. Hearst. 2021. Augmenting Scientific Papers with Just-in-Time, Position-Sensitive Definitions of Terms and Symbols. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 413.",
      "doi": "10.1145/3411764.3445648"
    },
    {
      "text": "Tom Hope, Ronen Tamari, Daniel Hershcovich, Hyeonsu B Kang, Joel Chan, Aniket Kittur, and Dafna Shahaf. 2022. Scaling Creative Inspiration with Fine-Grained Functional Aspects of Ideas. In CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 12, 15 pages. https://doi.org/10.1145/3491102.3517434",
      "doi": "10.1145/3491102.3517434"
    },
    {
      "text": "Arif E Jinha. 2010. Article 50 million: an estimate of the number of scholarly articles in existence. Learned publishing 23, 3 (2010), 258–263.",
      "doi": ""
    },
    {
      "text": "Hyeonsu B. Kang, Joseph Chee Chang, Yongsung Kim, and Aniket Kittur. 2022. Threddy: An Interactive System for Personalized Thread-based Exploration and Organization of Scientific Literature. In The 35th Annual ACM Symposium on User Interface Software and Technology(UIST ’22). Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Hyeonsu B Kang, Rafal Kocielnik, Andrew Head, Jiangjiang Yang, Matt Latzke, Aniket Kittur, Daniel S Weld, Doug Downey, and Jonathan Bragg. 2022. From Who You Know to What You Read: Augmenting Scientific Recommendations with Implicit Social Networks. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 302, 23 pages. https://doi.org/10.1145/3491102.3517470",
      "doi": "10.1145/3491102.3517470"
    },
    {
      "text": "Hyeonsu B Kang, Sheshera Mysore, Kevin J Huang, Haw-Shiuan Chang, Thorben Prein, Andrew McCallum, Aniket Kittur, and Elsa Olivetti. 2022. Augmenting Scientific Creativity with Retrieval across Knowledge Domains. In Second Workshop on Bridging Human-Computer Interaction and Natural Language Processing at NAACL 2022. arXiv. https://doi.org/10.48550/ARXIV.2206.01328",
      "doi": ""
    },
    {
      "text": "Hyeonsu B. Kang, Xin Qian, Tom Hope, Dafna Shahaf, Joel Chan, and Aniket Kittur. 2022. Augmenting Scientific Creativity with an Analogical Search Engine. ACM Trans. Comput.-Hum. Interact. (mar 2022). https://doi.org/10.1145/3530013 Just Accepted.",
      "doi": "10.1145/3530013"
    },
    {
      "text": "Harmanpreet Kaur, Doug Downey, Amanpreet Singh, Evie Yu-Yen Cheng, Daniel S. Weld, and Jonathan Bragg. 2022. FeedLens: Polymorphic Lenses for Personalizing Exploratory Search over Knowledge Graphs(UIST ’22).",
      "doi": ""
    },
    {
      "text": "Henry Kautz, Bart Selman, and Mehul Shah. 1997. Referral Web: combining social networks and collaborative filtering. Commun. ACM 40, 3 (1997), 63–65.",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Rafal Kocielnik, Saleema Amershi, and Paul N Bennett. 2019. Will you accept an imperfect ai? exploring designs for adjusting end-user expectations of ai systems. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3290605.3300641"
    },
    {
      "text": "Gueorgi Kossinets and Duncan J Watts. 2006. Empirical analysis of an evolving social network. science 311, 5757 (2006), 88–90.",
      "doi": ""
    },
    {
      "text": "Andrew Kuznetsov, Joseph Chee Chang, Nathan Hahn, Napol Rachatasumrit, Bradley Breneisen, Julina Coupland, and Aniket Kittur. 2022. Fuse: In-Situ Sensemaking Support in the Browser. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, Article 34. https://doi.org/10.1145/3526113.3545693",
      "doi": "10.1145/3526113.3545693"
    },
    {
      "text": "Paul F Lazarsfeld, Robert K Merton, 1954. Friendship as a social process: A substantive and methodological analysis. Freedom and control in modern society 18, 1 (1954), 18–66.",
      "doi": ""
    },
    {
      "text": "Howard Levene. 1961. Robust tests for equality of variances. Contributions to probability and statistics. Essays in honor of Harold Hotelling (1961), 279–292.",
      "doi": ""
    },
    {
      "text": "David Liben-Nowell and Jon Kleinberg. 2003. The link prediction problem for social networks. In Proceedings of the twelfth international conference on Information and knowledge management. 556–559.",
      "doi": "10.1145/956863.956972"
    },
    {
      "text": "Michael Xieyang Liu, Aniket Kittur, and Brad A. Myers. 2022. Crystalline: Lowering the Cost for Developers to Collect and Organize Information for Decision Making. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 68, 16 pages. https://doi.org/10.1145/3491102.3501968",
      "doi": "10.1145/3491102.3501968"
    },
    {
      "text": "Michael Xieyang Liu, Andrew Kuznetsov, Yongsung Kim, Joseph Chee Chang, Aniket Kittur, and Brad A. Myers. 2022. Wigglite: Low-Cost Information Collection and Triage. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 32, 16 pages. https://doi.org/10.1145/3526113.3545661",
      "doi": "10.1145/3526113.3545661"
    },
    {
      "text": "John W Mauchly. 1940. Significance test for sphericity of a normal n-variate distribution. The Annals of Mathematical Statistics 11, 2 (1940), 204–209.",
      "doi": ""
    },
    {
      "text": "David W. McDonald and Mark S. Ackerman. 2000. Expertise Recommender: A Flexible Recommendation System and Architecture. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (Philadelphia, Pennsylvania, USA) (CSCW ’00). Association for Computing Machinery, New York, NY, USA, 231–240. https://doi.org/10.1145/358916.358994",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Sheshera Mysore, Mahmood Jasim, Haoru Song, Sarah Akbar, Andre Kenneth Chase Randall, and Narges Mahyar. 2023. How Data Scientists Review the Scholarly Literature. arXiv preprint arXiv:2301.03774(2023).",
      "doi": ""
    },
    {
      "text": "Tien T. Nguyen, Pik-Mai Hui, F. Maxwell Harper, Loren Terveen, and Joseph A. Konstan. 2014. Exploring the Filter Bubble: The Effect of Using Recommender Systems on Content Diversity. In Proceedings of the 23rd International Conference on World Wide Web (Seoul, Korea) (WWW ’14). Association for Computing Machinery, New York, NY, USA, 677–686. https://doi.org/10.1145/2566486.2568012",
      "doi": "10.1145/2566486.2568012"
    },
    {
      "text": "Srishti Palani, Zijian Ding, Stephen MacNeil, and Steven P. Dow. 2021. The \"Active Search\" Hypothesis: How Search Strategies Relate to Creative Learning. In Proceedings of the 2021 Conference on Human Information Interaction and Retrieval (Canberra ACT, Australia) (CHIIR ’21). Association for Computing Machinery, New York, NY, USA, 325–329. https://doi.org/10.1145/3406522.3446046",
      "doi": "10.1145/3406522.3446046"
    },
    {
      "text": "Srishti Palani, Zijian Ding, Austin Nguyen, Andrew Chuang, Stephen MacNeil, and Steven P. Dow. 2021. CoNotate: Suggesting Queries Based on Notes Promotes Knowledge Discovery. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 726, 14 pages.",
      "doi": "10.1145/3411764.3445618"
    },
    {
      "text": "Srishti Palani, Aakanksha Naik, Doug Downey, Amy X Zhang, Jonathan Bragg, and Joseph Chee Chang. 2023. Relatedly: Scaffolding Literature Reviews with Existing Related Work Sections. In Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems(CHI ’23). Association for Computing Machinery, Hamburg, Germany.",
      "doi": "10.1145/3544548.3580841"
    },
    {
      "text": "Srishti Palani, Yingyi Zhou, Sheldon Zhu, and Steven P. Dow. 2022. InterWeave: Presenting Search Suggestions in Context Scaffolds Information Search and Synthesis. In Proceedings of the 35th Annual ACM Symposium on User Interface Software and Technology (Bend, OR, USA) (UIST ’22). Association for Computing Machinery, New York, NY, USA, Article 93, 16 pages. https://doi.org/10.1145/3526113.3545696",
      "doi": "10.1145/3526113.3545696"
    },
    {
      "text": "Peter Pirolli. 2009. An elementary social information foraging model. In Proceedings of the SIGCHI conference on human factors in computing systems. 605–614.",
      "doi": "10.1145/1518701.1518795"
    },
    {
      "text": "Antoine Ponsard, Francisco Escalona, and Tamara Munzner. 2016. PaperQuest: A visualization tool to support literature review. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2264–2271.",
      "doi": "10.1145/2851581.2892334"
    },
    {
      "text": "Jason Portenoy, Marissa Radensky, Jevin D West, Eric Horvitz, Daniel S Weld, and Tom Hope. 2022. Bursting Scientific Filter Bubbles: Boosting Innovation via Novel Author Discovery. Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Napol Rachatasumrit, Jonathan Bragg, Amy X. Zhang, and Daniel S Weld. 2022. CiteRead: Integrating Localized Citation Contexts into Scientific Paper Reading. In 27th International Conference on Intelligent User Interfaces (Helsinki, Finland) (IUI ’22). Association for Computing Machinery, New York, NY, USA, 707–719. https://doi.org/10.1145/3490099.3511162",
      "doi": "10.1145/3490099.3511162"
    },
    {
      "text": "Sherry Ruan, Jacob O. Wobbrock, Kenny Liou, Andrew Ng, and James A. Landay. 2018. Comparing Speech and Keyboard Text Entry for Short Messages in Two Languages on Touchscreen Phones. 1, 4 (2018).",
      "doi": "10.1145/3161187"
    },
    {
      "text": "Andrey Rzhetsky, Jacob G Foster, Ian T Foster, and James A Evans. 2015. Choosing experiments to accelerate collective discovery. Proceedings of the National Academy of Sciences 112, 47(2015), 14569–14574.",
      "doi": ""
    },
    {
      "text": "Pamela Sandstrom. 2001. Scholarly communication as a socioecological system. Scientometrics 50, 3 (2001), 573–605.",
      "doi": ""
    },
    {
      "text": "Shivashankar Subramanian, Daniel King, Doug Downey, and Sergey Feldman. 2021. S2AND: A Benchmark and Evaluation System for Author Name Disambiguation. 2021 ACM/IEEE Joint Conference on Digital Libraries (JCDL) (2021), 170–179.",
      "doi": ""
    },
    {
      "text": "Nicole Sultanum, Christine Murad, and Daniel Wigdor. 2020. Understanding and supporting academic literature review workflows with litsense. In Proceedings of the International Conference on Advanced Visual Interfaces. 1–5.",
      "doi": "10.1145/3399715.3399830"
    },
    {
      "text": "Don R. Swanson. 1986. Undiscovered Public Knowledge. The Library Quarterly 56, 2 (1986), 103–118.",
      "doi": ""
    },
    {
      "text": "Jiliang Tang, Xia Hu, and Huan Liu. 2013. Social recommendation: a review. Social Network Analysis and Mining 3, 4 (2013), 1113–1133.",
      "doi": ""
    },
    {
      "text": "Chun-Hua Tsai and Peter Brusilovsky. 2021. The effects of controllability and explainability in a social recommender system. User Modeling and User-Adapted Interaction 31, 3 (2021), 591–627.",
      "doi": "10.1007/s11257-020-09281-5"
    },
    {
      "text": "R Van Noorden. 2014. Global scientific output doubles every nine years [blog post]. Retrieved from nature. com at http://blogs.nature.com/news/2014/05/global-scientific-output-doubles-every-nine-years.html(2014).",
      "doi": ""
    },
    {
      "text": "Wei Wang, Xiaomei Bai, Feng Xia, Teshome Megersa Bekele, Xiaoyan Su, and Amr Tolba. 2017. From triadic closure to conference closure: The role of academic conferences in promoting scientific collaborations. Scientometrics 113, 1 (2017), 177–193.",
      "doi": "10.1007/s11192-017-2468-x"
    },
    {
      "text": "Yun Wang, Dongyu Liu, Huamin Qu, Qiong Luo, and Xiaojuan Ma. 2016. A guided tour of literature review: Facilitating academic paper reading with narrative visualization. In Proceedings of the 9th International Symposium on Visual Information Communication and Interaction. 17–24.",
      "doi": "10.1145/2968220.2968242"
    },
    {
      "text": "Jen-Her Wu and Shu-Ching Wang. 2005. What drives mobile commerce?: An empirical evaluation of the revised technology acceptance model. Information & management 42, 5 (2005), 719–729.",
      "doi": ""
    },
    {
      "text": "Xiaolong Zhang, Yan Qu, C. Lee Giles, and Piyou Song. 2008. CiteSense: Supporting Sensemaking of Research Literature. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/1357054.1357161",
      "doi": "10.1145/1357054.1357161"
    }
  ]
}