{
  "doi": "10.1145/3544548.3581252",
  "title": "Inform the Uninformed: Improving Online Informed Consent Reading with an AI-Powered Chatbot",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2023,
  "badges": [],
  "abstract": "Informed consent is a core cornerstone of ethics in human subject research. Through the informed consent process, participants learn about the study procedure, benefits, risks, and more to make an informed decision. However, recent studies showed that current practices might lead to uninformed decisions and expose participants to unknown risks, especially in online studies. Without the researcher’s presence and guidance, online participants must read a lengthy form on their own with no answers to their questions. In this paper, we examined the role of an AI-powered chatbot in improving informed consent online. By comparing the chatbot with form-based interaction, we found the chatbot improved consent form reading, promoted participants’ feelings of agency, and closed the power gap between the participant and the researcher. Our exploratory analysis further revealed the altered power dynamic might eventually benefit study response quality. We discussed design implications for creating AI-powered chatbots to offer effective informed consent in broader settings.",
  "authors": [
    {
      "name": "Ziang Xiao",
      "institution": "Computer Science, Johns Hopkins University, United States and Microsoft Research, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659134444",
      "orcid": "0000-0003-3368-0180"
    },
    {
      "name": "Tiffany Wenting Li",
      "institution": "Computer Science, University of Illinois Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659643694",
      "orcid": "0000-0002-0954-5627"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "Computer Science, University of Illinois Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    },
    {
      "name": "Hari Sundaram",
      "institution": "Computer Science, University of Illinois Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100245977",
      "orcid": "0000-0003-3315-6055"
    }
  ],
  "references": [
    {
      "text": "Patricia Agre, Frances A Campbell, Barbara D Goldman, Maria L Boccia, Nancy Kass, Laurence B McCullough, Jon F Merz, Suzanne M Miller, Jim Mintz, Bruce Rapkin, 2003. Improving informed consent: the medium is not the message. IRB: Ethics & Human Research 25, 5 (2003), S11–S19.",
      "doi": ""
    },
    {
      "text": "Emily E Anderson, Susan B Newman, and Alicia K Matthews. 2017. Improving informed consent: Stakeholder views. AJOB empirical bioethics 8, 3 (2017), 178–188.",
      "doi": ""
    },
    {
      "text": "Michela Assale, Erica Barbero, and Federico Cabitza. 2019. Digitizing the Informed Consent: the challenges to design for practices. In 2019 IEEE 32nd International Symposium on Computer-Based Medical Systems (CBMS). IEEE, 609–615.",
      "doi": ""
    },
    {
      "text": "Martina Balestra, Orit Shaer, Johanna Okerlund, Madeleine Ball, and Oded Nov. 2016. The effect of exposure to social annotation on online informed consent beliefs and behavior. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 900–912.",
      "doi": "10.1145/2818048.2820012"
    },
    {
      "text": "Solon Barocas and Helen Nissenbaum. 2014. Big data’s end run around anonymity and consent. Privacy, big data, and the public good: Frameworks for engagement 1 (2014), 44–75.",
      "doi": ""
    },
    {
      "text": "Baylor University. 2016. Are you addicted to social media? Six questions. Science Daily (Oct. 2016).",
      "doi": ""
    },
    {
      "text": "Timothy Bickmore, Dina Utami, Shuo Zhou, Candace Sidner, Lisa Quintiliani, and Michael K Paasche-Orlow. 2015. Automated explanation of research informed consent by virtual agents. In International Conference on Intelligent Virtual Agents. Springer, 260–269.",
      "doi": ""
    },
    {
      "text": "Timothy W Bickmore, Ha Trinh, Stefan Olafsson, Teresa K O’Leary, Reza Asadi, Nathaniel M Rickles, and Ricardo Cruz. 2018. Patient and consumer safety risks when using conversational assistants for medical information: an observational study of Siri, Alexa, and Google Assistant. Journal of medical Internet research 20, 9 (2018), e11510.",
      "doi": ""
    },
    {
      "text": "Else Bjørn, Peter Rossel, and Soren Holm. 1999. Can the written information to research subjects be improved?–an empirical study.Journal of Medical Ethics 25, 3 (1999), 263–267.",
      "doi": ""
    },
    {
      "text": "Su Lin Blodgett, Solon Barocas, Hal Daumé III, and Hanna Wallach. 2020. Language (Technology) is Power: A Critical Survey of “Bias” in NLP. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics. 5454–5476.",
      "doi": ""
    },
    {
      "text": "Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. Advances in neural information processing systems 33 (2020), 1877–1901.",
      "doi": ""
    },
    {
      "text": "Joan Cassell. 1980. Ethical principles for conducting fieldwork. American anthropologist 82, 1 (1980), 28–41.",
      "doi": ""
    },
    {
      "text": "Barrie R Cassileth, Robert V Zupkis, Katherine Sutton-Smith, and Vicki March. 1980. Informed consent—why are its goals imperfectly realized?New England journal of medicine 302, 16 (1980), 896–900.",
      "doi": ""
    },
    {
      "text": "Cindy Chen, Pou-I Lee, Kevin J Pain, Diana Delgado, Curtis L Cole, and Thomas R Campion Jr. 2020. Replacing paper informed consent with electronic informed consent for research in academic medical centers: a scoping review. AMIA Summits on Translational Science Proceedings 2020 (2020), 80.",
      "doi": ""
    },
    {
      "text": "Henian Chen, Patricia Cohen, and Sophie Chen. 2010. How big is a big odds ratio? Interpreting the magnitudes of odds ratios in epidemiological studies. Communications in Statistics—simulation and Computation® 39, 4(2010), 860–864.",
      "doi": ""
    },
    {
      "text": "Shu-Hsin Chen. 2011. Power Relations Between the Researcher and the Researched: An Analysis of Native and Nonnative Ethnographic Interviews. Field methods 23, 2 (May 2011), 119–135.",
      "doi": ""
    },
    {
      "text": "Francesco Colace, Massimo De Santo, Marco Lombardi, Francesco Pascale, Antonio Pietrosanto, and Saverio Lemma. 2018. Chatbot for e-learning: A case of study. International Journal of Mechanical Engineering and Robotics Research 7, 5(2018), 528–533.",
      "doi": ""
    },
    {
      "text": "Cathy A Coyne, Ronghui Xu, Peter Raich, Kathy Plomer, Mark Dignan, Lari B Wenzel, Diane Fairclough, Thomas Habermann, Linda Schnell, Susan Quella, 2003. Randomized, controlled trial of an easy-to-read informed consent statement for clinical trial participation: a study of the Eastern Cooperative Oncology Group. Journal of Clinical Oncology 21, 5 (2003), 836–842.",
      "doi": ""
    },
    {
      "text": "Jorden A Cummings, Jessica M Zagrodney, and T Eugene Day. 2015. Impact of open data policies on consent to participate in human subjects research: Discrepancies between participant action and reported concerns. PLoS One 10, 5 (2015), e0125208.",
      "doi": ""
    },
    {
      "text": "Evelien De Sutter, Drieda Zaçe, Stefania Boccia, Maria Luisa Di Pietro, David Geerts, Pascal Borry, Isabelle Huys, 2020. Implementation of electronic informed consent in biomedical research and stakeholders’ perspectives: systematic review. Journal of medical Internet research 22, 10 (2020), e19129.",
      "doi": ""
    },
    {
      "text": "Marcela G Del Carmen and Steven Joffe. 2005. Informed consent for medical treatment and research: a review. The oncologist 10, 8 (2005), 636–641.",
      "doi": ""
    },
    {
      "text": "David DeVault, Ron Artstein, Grace Benn, Teresa Dey, Ed Fast, Alesia Gainer, Kallirroi Georgila, Jon Gratch, Arno Hartholt, Margaux Lhommet, 2014. SimSensei Kiosk: A virtual human interviewer for healthcare decision support. In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems. 1061–1068.",
      "doi": ""
    },
    {
      "text": "Benjamin D Douglas, Emma L McGorray, and Patrick J Ewell. 2021. Some researchers wear yellow pants, but even fewer participants read consent forms: Exploring and improving consent form reading in human subjects research.Psychological Methods 26, 1 (2021), 61.",
      "doi": ""
    },
    {
      "text": "Graham M Dresden and M Andrew Levitt. 2001. Modifying a standard industry clinical trial consent form improves patient information retention as part of the informed consent process. Academic Emergency Medicine 8, 3 (2001), 246–252.",
      "doi": ""
    },
    {
      "text": "Catherine A Ebbs. 1996. Qualitative research inquiry: Issues of power and ethics. Education 117, 2 (1996), 217–223.",
      "doi": ""
    },
    {
      "text": "Ruth R Faden and Tom L Beauchamp. 1986. A history and theory of informed consent. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Ahmed Fadhil and Silvia Gabrielli. 2017. Addressing challenges in promoting healthy lifestyles: the al-chatbot approach. In Proceedings of the 11th EAI international conference on pervasive computing technologies for healthcare. 261–265.",
      "doi": "10.1145/3154862.3154914"
    },
    {
      "text": "Carlos Miguel Ferreira and Sandro Serpa. 2018. Informed consent in social sciences research: Ethical challenges. Int’l J. Soc. Sci. Stud. 6 (2018), 13.",
      "doi": ""
    },
    {
      "text": "James Flory and Ezekiel Emanuel. 2004. Interventions to improve research participants’ understanding in informed consent for research: a systematic review. Jama 292, 13 (2004), 1593–1601.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1982. The subject and power. Critical inquiry 8, 4 (1982), 777–795.",
      "doi": ""
    },
    {
      "text": "Joel A Friedlander, Greg S Loeben, Patricia K Finnegan, Anita E Puma, Xuemei Zhang, Edwin F De Zoeten, David A Piccoli, and Petar Mamula. 2011. A novel method to enhance informed consent: a prospective and randomised trial of form-based versus electronic assisted informed consent in paediatric endoscopy. Journal of medical ethics 37, 4 (2011), 194–200.",
      "doi": ""
    },
    {
      "text": "Yubin Ge, Ziang Xiao, Jana Diesner, Heng Ji, Karrie Karahalios, and Hari Sundaram. 2022. What should I Ask: A Knowledge-driven Approach for Follow-up Questions Generation in Conversational Surveys. arXiv preprint arXiv:2205.10977(2022).",
      "doi": ""
    },
    {
      "text": "Caitlin Geier, Robyn B Adams, Katharine M Mitchell, and Bree E Holtz. 2021. Informed Consent for Online Research—Is Anybody Reading?: Assessing Comprehension and Individual Differences in Readings of Digital Consent Forms. Journal of Empirical Research on Human Research Ethics 16, 3(2021), 154–164.",
      "doi": ""
    },
    {
      "text": "Lilian Ghandour, Rola Yasmine, and Faysal El-Kak. 2013. Giving consent without getting informed: a cross-cultural issue in research ethics. Journal of Empirical Research on Human Research Ethics 8, 3(2013), 12–21.",
      "doi": ""
    },
    {
      "text": "Graham R Gibbs. 2007. Thematic coding and categorizing. Analyzing qualitative data 703 (2007), 38–56.",
      "doi": ""
    },
    {
      "text": "William Grabe. 2008. Reading in a second language: Moving from theory to practice. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Bradford H Gray, Robert A Cooke, and Arnold S Tannenbaum. 1978. Research Involving Human Subjects: The performance of institutional review boards is assessed in this empirical study.Science 201, 4361 (1978), 1094–1101.",
      "doi": ""
    },
    {
      "text": "Herbert P Grice. 1975. Logic and conversation. In Speech acts. Brill, 41–58.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin and Richard Jacques. 2019. Chatbots, humbots, and the quest for artificial general intelligence. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300439"
    },
    {
      "text": "Scott D Halpern, Jason HT Karlawish, and Jesse A Berlin. 2002. The continuing unethical conduct of underpowered clinical trials. Jama 288, 3 (2002), 358–362.",
      "doi": ""
    },
    {
      "text": "Jeremy D Heider, Jessica L Hartnett, Emmanuel J Perez, and John E Edlund. 2020. Perceptions and understanding of research situations as a function of consent form characteristics and experimenter instructions. Methods in Psychology 2(2020), 100015.",
      "doi": ""
    },
    {
      "text": "Saras Henderson. 2003. Power imbalance between nurses and patients: a potential inhibitor of partnership in care. Journal of clinical nursing 12, 4 (2003), 501–508.",
      "doi": ""
    },
    {
      "text": "Rink Hoekstra, Richard D Morey, Jeffrey N Rouder, and Eric-Jan Wagenmakers. 2014. Robust misinterpretation of confidence intervals. Psychonomic bulletin & review 21, 5 (2014), 1157–1164.",
      "doi": ""
    },
    {
      "text": "Juji. 2020. Juji document for chatbot designers. https://docs.juji.io/. [Online; accessed 14-June-2020].",
      "doi": ""
    },
    {
      "text": "Orit Karnieli-Miller, Roni Strier, and Liat Pessach. 2009. Power relations in qualitative research. Qualitative health research 19, 2 (2009), 279–289.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Gregory L Nelson, and Eric B Hekler. 2016. Researcher-centered design of statistics: Why Bayesian statistics better fit the culture and incentives of HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4521–4532.",
      "doi": "10.1145/2858036.2858465"
    },
    {
      "text": "Soomin Kim, Joonhwan Lee, and Gahgene Gweon. 2019. Comparing data from chatbot and web surveys: Effects of platform and conversational style on survey response quality. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300316"
    },
    {
      "text": "Yujin Kim, Jennifer Dykema, John Stevenson, Penny Black, and D Paul Moberg. 2019. Straightlining: overview of measurement, comparison of indicators, and effects in mail–web mixed-mode surveys. Social Science Computer Review 37, 2 (2019), 214–233.",
      "doi": "10.1177/0894439317752406"
    },
    {
      "text": "Michael M Knepp. 2018. Using questions to improve informed consent form reading behavior in students. Ethics & Behavior 28, 7 (2018), 560–577.",
      "doi": ""
    },
    {
      "text": "V Manoj Kumar, A Keerthana, M Madhumitha, S Valliammai, and V Vinithasri. 2016. Sanative chatbot for health seekers. International Journal Of Engineering And Computer Science 5, 03(2016), 16022–16025.",
      "doi": ""
    },
    {
      "text": "Marlies Kustatscher. 2014. Informed consent in school-based ethnography: Using visual magnets to explore participation, power and research relationships. International Journal of Child, Youth and Family Studies 5, 4.1(2014), 686–701.",
      "doi": ""
    },
    {
      "text": "Christine Lavelle-Jones, Derek J Byrne, Peter Rice, and Alfred Cuschieri. 1993. Factors affecting quality of informed consent.British Medical Journal 306, 6882 (1993), 885–890.",
      "doi": ""
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, Yun Huang, and Wai Fu. 2020. \" I Hear You, I Feel You\": encouraging deep self-disclosure through a chatbot. In Proceedings of the 2020 CHI conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3313831.3376175"
    },
    {
      "text": "James R Lewis. 1991. Psychometric evaluation of an after-scenario questionnaire for computer usability studies: the ASQ. ACM Sigchi Bulletin 23, 1 (1991), 78–81.",
      "doi": "10.1145/122672.122692"
    },
    {
      "text": "Chung-Ying Lin, Anders Broström, Per Nilsen, Mark D Griffiths, and Amir H Pakpour. 2017. Psychometric validation of the Persian Bergen Social Media Addiction Scale using classic test theory and Rasch models. Journal of behavioral addictions 6, 4 (2017), 620–629.",
      "doi": ""
    },
    {
      "text": "Yvonna S Lincoln and Egon G Guba. 1985. Naturalistic inquiry. sage.",
      "doi": ""
    },
    {
      "text": "Richard McElreath. 2015. Statistical rethinking: A Bayesian course with examples in R and Stan. Chapman and Hall/CRC.",
      "doi": ""
    },
    {
      "text": "Narjara Conduru Fernandes Moreira, Camila Pacheco-Pereira, Louanne Keenan, Greta Cummings, and Carlos Flores-Mir. 2016. Informed consent comprehension and recollection in adult dental patients: a systematic review. The Journal of the American Dental Association 147, 8(2016), 605–619.",
      "doi": ""
    },
    {
      "text": "Gary R Morrow. 1980. How readable are subject consent forms?Jama 244, 1 (1980), 56–58.",
      "doi": ""
    },
    {
      "text": "Kenneth Mulligan, Jon A Krosnick, Wendy Smith, Melanie Green, and George Bizer. 2001. Nondifferentiation on attitude rating scales: A test of survey satisficing theory. Unpublished manuscript(2001).",
      "doi": ""
    },
    {
      "text": "Long Ouyang, Jeff Wu, Xu Jiang, Diogo Almeida, Carroll L Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, 2022. Training language models to follow instructions with human feedback. arXiv preprint arXiv:2203.02155(2022).",
      "doi": ""
    },
    {
      "text": "Barton W Palmer, Nicole M Lanouette, and Dilip V Jeste. 2012. Effectiveness of multimedia aids to enhance comprehension during research consent: A systematic review. Irb 34, 6 (2012), 1.",
      "doi": ""
    },
    {
      "text": "Eric R Pedersen, Clayton Neighbors, Judy Tidwell, and Ty W Lostutter. 2011. Do undergraduate student research participants read psychological research consent forms? Examining memory effects, condition effects, and individual differences. Ethics & Behavior 21, 4 (2011), 332–350.",
      "doi": ""
    },
    {
      "text": "Evan K Perrault and Seth P McCullock. 2019. Concise consent forms appreciated—still not comprehended: Applying revised common rule guidelines in online studies. Journal of Empirical Research on Human Research Ethics 14, 4(2019), 299–306.",
      "doi": ""
    },
    {
      "text": "Evan K Perrault and Samantha A Nazione. 2016. Informed consent—uninformed participants: shortcomings of online social science consent forms and recommendations for improvement. Journal of Empirical Research on Human Research Ethics 11, 3(2016), 274–280.",
      "doi": ""
    },
    {
      "text": "Kyle R Ripley, Margaret A Hance, Stacey A Kerr, Lauren E Brewer, and Kyle E Conlon. 2018. Uninformed consent? The effect of participant characteristics and delivery format on informed consent. Ethics & Behavior 28, 7 (2018), 517–543.",
      "doi": ""
    },
    {
      "text": "Michael C Rowbotham, John Astin, Kaitlin Greene, and Steven R Cummings. 2013. Interactive informed consent: randomized comparison with paper consents. PloS one 8, 3 (2013), e58603.",
      "doi": ""
    },
    {
      "text": "Sherry Ruan, Liwei Jiang, Justin Xu, Bryce Joe-Kun Tham, Zhengneng Qiu, Yeshuang Zhu, Elizabeth L Murnane, Emma Brunskill, and James A Landay. 2019. Quizbot: A dialogue-based adaptive learning system for factual knowledge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300587"
    },
    {
      "text": "Peter H Schuck. 1994. Rethinking informed consent. Yale Law Journal (1994), 899–959.",
      "doi": ""
    },
    {
      "text": "Anne Sherlock and Sonya Brownie. 2014. Patients’ recollection and understanding of informed consent: a literature review. ANZ journal of surgery 84, 4 (2014), 207–210.",
      "doi": ""
    },
    {
      "text": "Alan R Tait, Terri Voepel-Lewis, Stanley J Chetcuti, Colleen Brennan-Martinez, and Robert Levine. 2014. Enhancing patient understanding of medical procedures: evaluation of an interactive multimedia program with in-line exercises. International Journal of Medical Informatics 83, 5(2014), 376–384.",
      "doi": ""
    },
    {
      "text": "Ella Tallyn, Hector Fried, Rory Gianni, Amy Isard, and Chris Speed. 2018. The ethnobot: Gathering ethnographies in the age of IoT. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174178"
    },
    {
      "text": "Kar Yan Tam and Shuk Ying Ho. 2005. Web personalization as a persuasion strategy: An elaboration likelihood model perspective. Information systems research 16, 3 (2005), 271–291.",
      "doi": ""
    },
    {
      "text": "Adam Tapal, Ela Oren, Reuven Dar, and Baruch Eitam. 2017. The sense of agency scale: A measure of consciously perceived control over one’s mind, body, and the immediate environment. Frontiers in psychology 8 (2017), 1552.",
      "doi": ""
    },
    {
      "text": "Vasti Torres and Marcia B Baxter Magolda. 2002. The evolving role of the researcher in constructivist longitudinal studies.Journal of College Student Development(2002).",
      "doi": ""
    },
    {
      "text": "Connie K Varnhagen, Matthew Gushta, Jason Daniels, Tara C Peters, Neil Parmar, Danielle Law, Rachel Hirsch, Bonnie Sadler Takach, and Tom Johnson. 2005. How informed is online informed consent?Ethics & Behavior 15, 1 (2005), 37–48.",
      "doi": ""
    },
    {
      "text": "James Walkup and Elinor Bock. 2009. What do prospective research participants want to know? What do they assume they know already?Journal of Empirical Research on Human Research Ethics 4, 2(2009), 59–63.",
      "doi": ""
    },
    {
      "text": "Alex C Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T Iqbal, and Jaime Teevan. 2018. Supporting workplace detachment and reattachment with conversational intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173662"
    },
    {
      "text": "Diane L Wolf. 2018. Situating feminist dilemmas in fieldwork. In Feminist dilemmas in fieldwork. Routledge, 1–55.",
      "doi": ""
    },
    {
      "text": "Ziang Xiao, Q Vera Liao, Michelle X Zhou, Tyrone Grandison, and Yunyao Li. 2023. Powering an AI Chatbot with Expert Sourcing to Support Credible Health Information Access. arXiv preprint arXiv:2301.10710(2023).",
      "doi": ""
    },
    {
      "text": "Ziang Xiao, Michelle X Zhou, Wenxi Chen, Huahai Yang, and Changyan Chi. 2020. If i hear you correctly: Building and evaluating interview chatbots with active listening skills. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376131"
    },
    {
      "text": "Ziang Xiao, Michelle X Zhou, and Wai-Tat Fu. 2019. Who should be my teammates: Using a conversational agent to understand individuals and help teaming. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 437–447.",
      "doi": "10.1145/3301275.3302264"
    },
    {
      "text": "Ziang Xiao, Michelle X Zhou, Q Vera Liao, Gloria Mark, Changyan Chi, Wenxi Chen, and Huahai Yang. 2020. Tell me about yourself: Using an AI-powered chatbot to conduct conversational surveys with open-ended questions. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 3(2020), 1–37.",
      "doi": "10.1145/3381804"
    },
    {
      "text": "T Yan. 2008. Nondifferentiation. Encyclopedia of survey research methods 2 (2008), 520–521.",
      "doi": ""
    },
    {
      "text": "Yizhe Zhang, Siqi Sun, Michel Galley, Yen-Chun Chen, Chris Brockett, Xiang Gao, Jianfeng Gao, Jingjing Liu, and Bill Dolan. 2019. Dialogpt: Large-scale generative pre-training for conversational response generation. arXiv preprint arXiv:1911.00536(2019).",
      "doi": ""
    },
    {
      "text": "Michelle X Zhou, Gloria Mark, Jingyi Li, and Huahai Yang. 2019. Trusting virtual agents: The effect of personality. ACM Transactions on Interactive Intelligent Systems (TiiS) 9, 2-3(2019), 1–36.",
      "doi": "10.1145/3232077"
    },
    {
      "text": "Shuo Zhou, Timothy Bickmore, Michael Paasche-Orlow, and Brian Jack. 2014. Agent-user concordance and satisfaction with a virtual hospital discharge nurse. In International conference on intelligent virtual agents. Springer, 528–541.",
      "doi": ""
    }
  ]
}