{
  "doi": "10.1145/3544548.3580770",
  "title": "Crownboard: A One-Finger Crown-Based Smartwatch Keyboard for Users with Limited Dexterity",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2023,
  "badges": [],
  "abstract": "Mobile text entry is difficult for people with motor impairments due to limited access to smartphones and the need for precise target selection on touchscreens. Text entry on smartwatches, on the other hand, has not been well explored for the population. Crownboard enables people with limited dexterity enter text on a smartwatch using its crown. It uses an alphabetical layout divided into eight zones around the bezel. The zones are scanned either automatically or manually by rotating the crown, then selected by pressing the crown. Crownboard decodes zone sequences into words and displays word suggestions. We validated its design in multiple studies. First, a comparison between manual and automated scanning revealed that manual scanning is faster and more accurate. Second, a comparison between clockwise and shortest-path scanning identified the former to be faster and more accurate. In the final study with representative users, only 30% participants could use the default Qwerty. They were 9% and 23% faster with manual and automated Crownboard, respectively. All participants were able to use both variants of Crownboard.",
  "tags": [
    "text entry",
    "smartwatch",
    "motor impairments",
    "accessibility",
    "virtual keyboard",
    "crown",
    "wristwatch"
  ],
  "authors": [
    {
      "name": "Gulnar Rakhmetulla",
      "institution": "Inclusive Interaction Lab, University of California, Merced, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528098",
      "orcid": "0000-0001-8637-5759"
    },
    {
      "name": "Ahmed Sabbir Arif",
      "institution": "Inclusive Interaction Lab, University of California, Merced, United States",
      "img": "/do/10.1145/contrib-81460652875/rel-imgonly/1632569177136_sq_col_sm.jpg",
      "acmid": "81460652875",
      "orcid": "0000-0002-8384-4764"
    }
  ],
  "references": [
    {
      "text": "2022. Feature phone. https://en.wikipedia.org/w/index.php?title=Feature_phone&oldid=1118162309 Page Version ID: 1118162309.",
      "doi": ""
    },
    {
      "text": "Lorena Anderson. 2020. $3.5 Million Hellman Endowment Expands Future of Research at UC Merced. https://hsri.ucmerced.edu/news/2020/35-million-hellman-endowment-expands-future-research-uc-merced",
      "doi": ""
    },
    {
      "text": "Lisa Anthony, YooJin Kim, and Leah Findlater. 2013. Analyzing User-Generated Youtube Videos to Understand Touchscreen Use by People with Motor Impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1223–1232. https://doi.org/10.1145/2470654.2466158",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Ahmed Sabbir Arif and Ali Mazalek. 2016. A Survey of Text Entry Techniques for Smartwatches. In Human-Computer Interaction. Interaction Platforms and Techniques, Masaaki Kurosu (Ed.). Vol. 9732. Springer International Publishing, Cham, 255–267. https://doi.org/10.1007/978-3-319-39516-6_24 Series Title: Lecture Notes in Computer Science.",
      "doi": "10.1007/978-3-319-39516-6_24"
    },
    {
      "text": "Ahmed Sabbir Arif, Michel Pahud, Ken Hinckley, and Bill Buxton. 2014. Experimental Study of Stroke Shortcuts for a Touchscreen Keyboard with Gesture-Redundant Keys Removed. In Proceedings of Graphics Interface 2014(GI ’14). Canadian Information Processing Society, Toronto, ON, Canada, 43–50. http://dl.acm.org/citation.cfm?id=2619648.2619657 event-place: Montreal, Quebec, Canada.",
      "doi": "10.5555/2619648.2619657"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of Text Entry Performance Metrics. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH). 100–105. https://doi.org/10.1109/TIC-STH.2009.5444533",
      "doi": ""
    },
    {
      "text": "Behrooz Ashtiani and I. Scott MacKenzie. 2010. BlinkWrite2: An Improved Text Entry Method Using Eye Blinks. In Proceedings of the 2010 Symposium on Eye-Tracking Research; Applications (Austin, Texas) (ETRA ’10). Association for Computing Machinery, New York, NY, USA, 339–345. https://doi.org/10.1145/1743666.1743742",
      "doi": "10.1145/1743666.1743742"
    },
    {
      "text": "Melanie Baljko and Andrew Tam. 2006. Indirect Text Entry Using One or Two Keys. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility (Portland, Oregon, USA) (Assets ’06). Association for Computing Machinery, New York, NY, USA, 18–25. https://doi.org/10.1145/1168987.1168992",
      "doi": "10.1145/1168987.1168992"
    },
    {
      "text": "Mohammed Belatar and Franck Poirier. 2008. Text Entry for Mobile Devices and Users with Severe Motor Impairments: Handiglyph, a Primitive Shapes Based Onscreen Keyboard. In Proceedings of the 10th International ACM SIGACCESS Conference on Computers and Accessibility (Halifax, Nova Scotia, Canada) (Assets ’08). Association for Computing Machinery, New York, NY, USA, 209–216. https://doi.org/10.1145/1414471.1414510",
      "doi": "10.1145/1414471.1414510"
    },
    {
      "text": "Ian Carlos Campbell. 2021. Google Remembers Wear OS Long Enough to Add a New Keyboard. https://www.theverge.com/2021/5/6/22423707/google-wear-os-gboard-swipe-type",
      "doi": ""
    },
    {
      "text": "Steven J. Castellucci, I. Scott MacKenzie, Mudit Misra, Laxmi Pandey, and Ahmed Sabbir Arif. 2019. TiltWriter: Design and Evaluation of a No-Touch Tilt-Based Text Entry Method for Handheld Devices. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia(MUM ’19). ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3365610.3365629 Article 7.",
      "doi": "10.1145/3365610.3365629"
    },
    {
      "text": "Karen B. Chen, Anne B. Savage, Amrish O. Chourasia, Douglas A. Wiegmann, and Mary E. Sesto. 2013. Touch screen performance by individuals with and without motor control disabilities. Applied Ergonomics 44, 2 (2013), 297–302. https://doi.org/10.1016/j.apergo.2012.08.004",
      "doi": ""
    },
    {
      "text": "Xiang ’Anthony’ Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: A Text Entry Technique for Ultra-Small Interfaces That Supports Novice to Expert Transitions. In Proceedings of the 27th Annual Acm Symposium on User Interface Software and Technology(UIST ’14). ACM, New York, NY, USA, 615–620. https://doi.org/10.1145/2642918.2647354",
      "doi": "10.1145/2642918.2647354"
    },
    {
      "text": "Gennaro Costagliola, Mattia Rosa, Raffaele D’Arco, Sabato Gregorio, Vittorio Fuccella, and Daniele Lupo. 2019. C-QWERTY: a text entry method for circular smartwatches (S). In DMSVIVA. 51–57. https://doi.org/10.18293/DMSVIVA2019-014",
      "doi": ""
    },
    {
      "text": "Lucy Diep and Gregor Wolbring. 2013. Who Needs to Fit in? Who Gets to Stand out? Communication Technologies Including Brain-Machine Interfaces Revealed from the Perspectives of Special Education School Teachers Through an Ableism Lens. Education Sciences 3, 1 (March 2013), 30–49. https://doi.org/10.3390/educsci3010030 Number: 1 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Sacha N. Duff, Curt B. Irwin, Jennifer L. Skye, Mary E. Sesto, and Douglas A. Wiegmann. 2010. The Effect of Disability and Approach on Touch Screen Performance during a Number Entry Task. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 54, 6(2010), 566–570. https://doi.org/10.1177/154193121005400605 arXiv:https://doi.org/10.1177/154193121005400605",
      "doi": ""
    },
    {
      "text": "Mark D. Dunlop and Andrew Crossan. 2000. Predictive Text Entry Methods for Mobile Phones. Personal Technologies 4, 2 (June 2000), 134–143. https://doi.org/10.1007/BF01324120",
      "doi": ""
    },
    {
      "text": "Mark D. Dunlop, Andreas Komninos, and Naveen Durga. 2014. Towards High Quality Text Entry on Smartwatches. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). Association for Computing Machinery, Toronto, Ontario, Canada, 2365–2370. https://doi.org/10.1145/2559206.2581319",
      "doi": "10.1145/2559206.2581319"
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L. Vu. 2014. Voice Activated Personal Assistant: Acceptability of Use in the Public Space. In Human Interface and the Management of Information. Information and Knowledge in Applications and Services(Lecture Notes in Computer Science), Sakae Yamamoto (Ed.). Springer International Publishing, Cham, 324–334. https://doi.org/10.1007/978-3-319-07863-2_32",
      "doi": "10.1007/978-3-319-07863-2_32"
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L Vu. 2015. Privacy concerns for use of voice activated personal assistant in the public space. International Journal of Human-Computer Interaction 31, 4(2015), 307–335.",
      "doi": ""
    },
    {
      "text": "Christos Efthymiou and M. Halvey. 2016. Evaluating the Social Acceptability of Voice Based Smartwatch Search. In AIRS. https://doi.org/10.1007/978-3-319-48051-0_20",
      "doi": ""
    },
    {
      "text": "Silvia B. Fajardo-Flores, Laura S. Gaytán-Lugo, Pedro C. Santana-Mancilla, and Miguel A. Rodríguez-Ortiz. 2017. Mobile Accessibility for People with Combined Visual and Motor Impairment: A case Study. In Proceedings of the 8th Latin American Conference on Human-Computer Interaction(CLIHC ’17). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3151470.3151476",
      "doi": "10.1145/3151470.3151476"
    },
    {
      "text": "Torsten Felzer, Ian Scott MacKenzie, Philipp Beckerle, and Stephan Rinderknecht. 2010. Qanti: A Software Tool for Quick Ambiguous Non-standard Text Input. In Computers Helping People with Special Needs, Klaus Miesenberger, Joachim Klaus, Wolfgang Zagler, and Arthur Karshmer (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 128–135.",
      "doi": ""
    },
    {
      "text": "Torsten Felzer, I. Scott MacKenzie, and Stephan Rinderknecht. 2012. DualScribe: A Keyboard Replacement for Those with Friedreich’s Ataxia and Related Diseases. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Arthur Karshmer, Petr Penaz, and Wolfgang Zagler (Eds.). Springer, Berlin, Heidelberg, 431–438. https://doi.org/10.1007/978-3-642-31534-3_64",
      "doi": "10.1007/978-3-642-31534-3_64"
    },
    {
      "text": "Torsten Felzer and Rainer Nordmann. 2006. Alternative Text Entry Using Different Input Methods. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility(Assets ’06). Association for Computing Machinery, New York, NY, USA, 10–17. https://doi.org/10.1145/1168987.1168991",
      "doi": "10.1145/1168987.1168991"
    },
    {
      "text": "Torsten Felzer and Stephan Rinderknecht. 2009. 3DScan: An Environment Control System Supporting Persons with Severe Motor Impairments. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, Pennsylvania, USA) (Assets ’09). Association for Computing Machinery, New York, NY, USA, 213–214. https://doi.org/10.1145/1639642.1639681",
      "doi": "10.1145/1639642.1639681"
    },
    {
      "text": "Leah Findlater, Karyn Moffatt, Jon E. Froehlich, Meethu Malu, and Joan Zhang. 2017. Comparing Touchscreen and Mouse Input Performance by People With and Without Upper Body Motor Impairments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6056–6061. https://doi.org/10.1145/3025453.3025603",
      "doi": "10.1145/3025453.3025603"
    },
    {
      "text": "Jun Gong, Zheer Xu, Qifan Guo, Teddy Seyed, Xiang ’Anthony’ Chen, Xiaojun Bi, and Xing-Dong Yang. 2018. WrisText: One-Handed Text Entry on Smartwatch Using Wrist Gestures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 181:1–181:14. https://doi.org/10.1145/3173574.3173755",
      "doi": "10.1145/3173574.3173755"
    },
    {
      "text": "Mitchell Gordon, Tom Ouyang, and Shumin Zhai. 2016. WatchWriter: Tap and Gesture Typing on a Smartwatch Miniature Keyboard with Statistical Decoding. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 3817–3821. https://doi.org/10.1145/2858036.2858242",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2010. Towards Accessible Touch Interfaces. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (Orlando, Florida, USA) (ASSETS ’10). Association for Computing Machinery, New York, NY, USA, 19–26. https://doi.org/10.1145/1878803.1878809",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "Tiago João Vieira Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2010. Assessing Mobile Touch Interfaces for Tetraplegics. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (Lisbon, Portugal) (MobileHCI ’10). Association for Computing Machinery, New York, NY, USA, 31–34. https://doi.org/10.1145/1851600.1851608",
      "doi": "10.1145/1851600.1851608"
    },
    {
      "text": "Aakar Gupta and Ravin Balakrishnan. 2016. DualKey: Miniature Screen Text Entry via Finger Identification. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, San Jose, California, USA, 59–70. https://doi.org/10.1145/2858036.2858052",
      "doi": "10.1145/2858036.2858052"
    },
    {
      "text": "Timo Götzelmann and Pere-Pau Vázquez. 2015. InclineType: An Accelerometer-Based Typing Approach for Smartwatches. In Proceedings of the XVI International Conference on Human Computer Interaction(Interacción ’15). Association for Computing Machinery, Vilanova i la Geltru, Spain, 1–4. https://doi.org/10.1145/2829875.2829929",
      "doi": "10.1145/2829875.2829929"
    },
    {
      "text": "Karin Harbusch and Michael Kühn. 2003. Towards an Adaptive Communication Aid with Text Input from Ambiguous Keyboards. In Proceedings of the Tenth Conference on European Chapter of the Association for Computational Linguistics - Volume 2 (Budapest, Hungary) (EACL ’03). Association for Computational Linguistics, USA, 207–210. https://doi.org/10.3115/1067737.1067786",
      "doi": "10.3115/1067737.1067786"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (Oct. 2006), 904–908. https://doi.org/10.1177/154193120605000909 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology. Vol. 52. Elsevier, Amsterdam, The Netherlands, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Jonggi Hong, Seongkook Heo, Poika Isokoski, and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-Sized Touch Screens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 1233–1236. https://doi.org/10.1145/2702123.2702273",
      "doi": "10.1145/2702123.2702273"
    },
    {
      "text": "Min-Chieh Hsiu, Da-Yuan Huang, Chi An Chen, Yu-Chih Lin, Yi-ping Hung, De-Nian Yang, and Mike Chen. 2016. Forceboard: Using Force as Input Technique on Size-Limited Soft Keyboard. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(MobileHCI ’16). Association for Computing Machinery, Florence, Italy, 599–604. https://doi.org/10.1145/2957265.2961827",
      "doi": "10.1145/2957265.2961827"
    },
    {
      "text": "Apple Inc. 2019. Use Siri on your Apple Watch. https://support.apple.com/en-us/HT205184",
      "doi": ""
    },
    {
      "text": "Curt B. Irwin and Mary E. Sesto. 2012. Performance and touch characteristics of disabled and non-disabled participants during a reciprocal tapping task using touch screen technology. Applied Ergonomics 43, 6 (2012), 1038–1043. https://doi.org/10.1016/j.apergo.2012.03.003",
      "doi": ""
    },
    {
      "text": "Christina L. James and Kelly M. Reischel. 2001. Text Input for Mobile Devices: Comparing Model Prediction to Actual Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’01). Association for Computing Machinery, New York, NY, USA, 365–371. https://doi.org/10.1145/365024.365300",
      "doi": "10.1145/365024.365300"
    },
    {
      "text": "Haiyan Jiang and Dongdong Weng. 2020. HiPad: Text entry for Head-Mounted Displays Using Circular Touchpad. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Atlanta, GA, USA, 692–703. https://doi.org/10.1109/VR46266.2020.1581236395562",
      "doi": ""
    },
    {
      "text": "Yoonhyuk Jung, Seongcheol Kim, and Boreum Choi. 2016. Consumer valuation of the wearables: The case of smartwatches. Computers in Human Behavior 63 (2016), 899 – 905. https://doi.org/10.1016/j.chb.2016.06.040",
      "doi": "10.1016/j.chb.2016.06.040"
    },
    {
      "text": "Tomonari Kamba, Shawn A. Elson, Terry Harpold, Tim Stamper, and Piyawadee Sukaviriya. 1996. Using Small Screen Space More Efficiently. In Proceedings of the SIGCHI conference on Human factors in computing systems common ground - CHI ’96. ACM Press, Vancouver, British Columbia, Canada, 383–390. https://doi.org/10.1145/238386.238582",
      "doi": "10.1145/238386.238582"
    },
    {
      "text": "Jee-Eun Kim, Masahiro Bessho, and Ken Sakamura. 2019. Towards a Smartwatch Application to Assist Students with Disabilities in an IoT-enabled Campus. In 2019 IEEE 1st Global Conference on Life Sciences and Technologies (LifeTech). 243–246. https://doi.org/10.1109/LifeTech.2019.8883995",
      "doi": ""
    },
    {
      "text": "Ki Joon Kim. 2017. Shape and size matter for smartwatches: Effects of screen shape, screen size, and presentation mode in wearable communication. Journal of Computer-Mediated Communication 22, 3 (2017), 124–140.",
      "doi": ""
    },
    {
      "text": "Heidi Koester. 2018. Text Entry Rate for People with Physical Disabilities [infographic]. https://kpronline.com/blog/text-entry-rate-for-people-with-physical-disabilities-infographic/ Section: Computer Accessibility.",
      "doi": ""
    },
    {
      "text": "Andreas Komninos and Mark Dunlop. 2014. Text Input on a Smart Watch. IEEE Pervasive Computing 13, 4 (Oct. 2014), 50–58. https://doi.org/10.1109/MPRV.2014.77",
      "doi": ""
    },
    {
      "text": "Luis A. Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text Entry on Tiny QWERTY Soft Keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 669–678. https://doi.org/10.1145/2702123.2702388",
      "doi": "10.1145/2702123.2702388"
    },
    {
      "text": "S. H. Levine and C. Goodenough-Trepagnier. 1990. Customised Text Entry Devices for Motor-Impaired Users. Applied Ergonomics 21, 1 (March 1990), 55–62. https://doi.org/10.1016/0003-6870(90)90074-8",
      "doi": ""
    },
    {
      "text": "Ning Li, Tuoyang Zhou, Yingwei Zhou, Chen Guo, Deqiang Fu, Xiaoqing Li, and Zijing Guo. 2019. Research on Human-Computer Interaction Mode of Speech Recognition Based on Environment Elements of Command and Control System. In 2019 5th International Conference on Big Data and Information Analytics (BigDIA). 170–175. https://doi.org/10.1109/BigDIA.2019.8802812",
      "doi": ""
    },
    {
      "text": "Yun-Lung Lin, Ming-Chung Chen, Ya-Ping Wu, Yao-Ming Yeh, and Hwa-Pey Wang. 2007. A Flexible On-Screen Keyboard: Dynamically Adapting for Individuals’ Needs. In Universal Access in Human-Computer Interaction. Applications and Services(Lecture Notes in Computer Science), Constantine Stephanidis (Ed.). Springer, Berlin, Heidelberg, 371–379. https://doi.org/10.1007/978-3-540-73283-9_42",
      "doi": ""
    },
    {
      "text": "Yun-Lung Lin, Ting-Fang Wu, Ming-Chung Chen, Yao-Ming Yeh, and Hwa-Pey Wang. 2008. Designing a Scanning On-Screen Keyboard for People with Severe Motor Disabilities. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Joachim Klaus, Wolfgang Zagler, and Arthur Karshmer (Eds.). Springer, Berlin, Heidelberg, 1184–1187. https://doi.org/10.1007/978-3-540-70540-6_178",
      "doi": "10.1007/978-3-540-70540-6_178"
    },
    {
      "text": "Motorola Mobility LLC. 2020. Voice commands – Moto 360 2nd Generation. https://support.motorola.com/us/en/products/wearables/moto-360-2nd-generation/documents/ms106996",
      "doi": ""
    },
    {
      "text": "Simon Lydell. 2015. English Bigram and Letter Pair Frequencies from the Google Corpus Data in JSON Format. https://gist.github.com/lydell/c439049abac2c9226e53",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie. 2009. The One-Key Challenge: Searching for a Fast One-Key Text Entry Method. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility(Pittsburgh, Pennsylvania, USA) (Assets ’09). Association for Computing Machinery, New York, NY, USA, 91–98. https://doi.org/10.1145/1639642.1639660",
      "doi": "10.1145/1639642.1639660"
    },
    {
      "text": "I. Scott MacKenzie. 2013. Human-Computer Interaction: An Empirical Research Perspective (first editioned.). Morgan Kaufmann is an imprint of Elsevier, Amsterdam.",
      "doi": ""
    },
    {
      "text": "I. Scott Mackenzie and Torsten Felzer. 2010. SAK: Scanning Ambiguous Keyboard for Efficient One-Key Text Entry. ACM Trans. Comput.-Hum. Interact. 17, 3 (July 2010), 11:1–11:39. https://doi.org/10.1145/1806923.1806925",
      "doi": "10.1145/1806923.1806925"
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI ’03 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’03). ACM, New York, NY, USA, 754–755. https://doi.org/10.1145/765891.765971",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Meethu Malu, Pramod Chundury, and Leah Findlater. 2018. Exploring Accessible Smartwatch Interactions for People with Upper Body Motor Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174062",
      "doi": "10.1145/3173574.3174062"
    },
    {
      "text": "Meethu Malu, Pramod Chundury, and Leah Findlater. 2019. Motor Accessibility of Smartwatch Touch and Bezel Input. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 563–565. https://doi.org/10.1145/3308561.3354638",
      "doi": "10.1145/3308561.3354638"
    },
    {
      "text": "Kyle Montague, Hugo Nicolau, and Vicki L. Hanson. 2014. Motor-Impaired Touchscreen Interactions in the Wild. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers; Accessibility (Rochester, New York, USA) (ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 123–130. https://doi.org/10.1145/2661334.2661362",
      "doi": "10.1145/2661334.2661362"
    },
    {
      "text": "John T. Morris, W. Mark Sweatman, and Michael L. Jones. 2017. Smartphone Use and Activities by People with Disabilities: User Survey 2016. Journal on Technology & Persons with Disabilities 5 (2017), 50–66.",
      "doi": ""
    },
    {
      "text": "Martez E. Mott, Radu-Daniel Vatavu, Shaun K. Kane, and Jacob O. Wobbrock. 2016. Smart Touch: Improving Touch Accuracy for People with Motor Impairments with Template Matching. Association for Computing Machinery, New York, NY, USA, 1934–1946. https://doi.org/10.1145/2858036.2858390",
      "doi": "10.1145/2858036.2858390"
    },
    {
      "text": "Martez E. Mott and Jacob O. Wobbrock. 2019. Cluster Touch: Improving Touch Accuracy on Smartphones for People with Motor and Situational Impairments. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300257",
      "doi": "10.1145/3290605.3300257"
    },
    {
      "text": "Maia Naftali and Leah Findlater. 2014. Accessibility in Context: Understanding the Truly Mobile Experience of Smartphone Users with Motor Impairments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility (Rochester, New York, USA) (ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 209–216. https://doi.org/10.1145/2661334.2661372",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "Hugo Nicolau, Tiago Guerreiro, Joaquim Jorge, and Daniel Gonçalves. 2014. Mobile Touchscreen User Interfaces: Bridging the Gap Between Motor-Impaired and Able-Bodied Users. Universal Access in the Information Society 13, 3 (Aug. 2014), 303–313. https://doi.org/10.1007/s10209-013-0320-5",
      "doi": "10.1007/s10209-013-0320-5"
    },
    {
      "text": "Peter Norvig. 2012. English Letter Frequency Counts: Mayzner Revisited or ETAOIN SRHLDCU. http://norvig.com/mayzner.html",
      "doi": ""
    },
    {
      "text": "Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: A Diminutive Qwerty Soft Keyboard Using Iterative Zooming for Ultra-Small Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). ACM, New York, NY, USA, 2799–2802. https://doi.org/10.1145/2470654.2481387",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "Laxmi Pandey, Khalad Hasan, and Ahmed Sabbir Arif. 2021. Acceptability of Speech and Silent Speech Input Methods in Private and Public. In Proceedings of the CHI Conference on Human Factors in Computing Systems(CHI ’21). ACM, New York, NY, USA, Yokohama, Japan, 13 pages. https://doi.org/10.1145/3411764.3445430",
      "doi": "10.1145/3411764.3445430"
    },
    {
      "text": "Ondrej Polacek, Zdenek Mikovec, Adam J. Sporka, and Pavel Slavik. 2011. Humsher: A Predictive Keyboard Operated by Humming. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility(ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 75–82. https://doi.org/10.1145/2049536.2049552",
      "doi": "10.1145/2049536.2049552"
    },
    {
      "text": "Ondrej Polacek, Adam J. Sporka, and Pavel Slavik. 2017. Text Input for Motor-Impaired People. Univers. Access Inf. Soc. 16, 1 (March 2017), 51–72. https://doi.org/10.1007/s10209-015-0433-0",
      "doi": "10.1007/s10209-015-0433-0"
    },
    {
      "text": "S. Prabhakar, S. Pankanti, and A.K. Jain. 2003. Biometric Recognition: Security and Privacy Concerns. IEEE Security Privacy 1, 2 (March 2003), 33–42. https://doi.org/10.1109/MSECP.2003.1193209 Conference Name: IEEE Security Privacy.",
      "doi": "10.1109/MSECP.2003.1193209"
    },
    {
      "text": "Vijit Prabhu and Girijesh Prasad. 2011. Designing a virtual keyboard with multi-modal access for people with disabilities. In 2011 World Congress on Information and Communication Technologies. 1133–1138. https://doi.org/10.1109/WICT.2011.6141407",
      "doi": ""
    },
    {
      "text": "Morten Proschowsky, Nette Schultz, and Niels Ebbe Jacobsen. 2006. An Intuitive Text Input Method for Touch Wheels. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 467–470. https://doi.org/10.1145/1124772.1124842",
      "doi": "10.1145/1124772.1124842"
    },
    {
      "text": "Ryan Qin, Suwen Zhu, Yu-Hao Lin, Yu-Jung Ko, and Xiaojun Bi. 2018. Optimal-T9: An Optimized T9-like Keyboard for Small Touchscreen Devices. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces(ISS ’18). Association for Computing Machinery, Tokyo, Japan, 137–146. https://doi.org/10.1145/3279778.3279786",
      "doi": "10.1145/3279778.3279786"
    },
    {
      "text": "Gulnar Rakhmetulla and Ahmed Sabbir Arif. 2020. Senorita: A Chorded Keyboard for Sighted, Low Vision, and Blind Mobile Users. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376576",
      "doi": "10.1145/3313831.3376576"
    },
    {
      "text": "Gulnar Rakhmetulla and Ahmed Sabbir Arif. 2021. SwipeRing: Gesture Typing on Smartwatches Using a Segmented Qwerty Around the Bezel. In Proceedings of the 2021 Graphics Interface Conference(GI ’21). Canadian Information Processing Society, Canada. https://doi.org/10.20380/GI2021.19",
      "doi": ""
    },
    {
      "text": "Zhanna Sarsenbayeva, Vassilis Kostakos, and Jorge Goncalves. 2019. Situationally-Induced Impairments and Disabilities Research. arXiv:1904.06128 [cs] (April 2019). http://arxiv.org/abs/1904.06128 arXiv:1904.06128.",
      "doi": ""
    },
    {
      "text": "Tomoki Shibata, Daniel Afergan, Danielle Kong, Beste F. Yuksel, I. Scott MacKenzie, and Robert J.K. Jacob. 2016. DriftBoard: A Panning-Based Text Entry Technique for Ultra-Small Touchscreens. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(UIST ’16). ACM, New York, NY, USA, 575–582. https://doi.org/10.1145/2984511.2984591",
      "doi": "10.1145/2984511.2984591"
    },
    {
      "text": "Gwanseob Shin and Xinhui Zhu. 2011. User Discomfort, Work Posture and Muscle Activity While Using a Touchscreen in a Desktop Pc Setting. Ergonomics 54, 8 (Aug. 2011), 733–744. https://doi.org/10.1080/00140139.2011.592604 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/00140139.2011.592604.",
      "doi": ""
    },
    {
      "text": "Alexandru-Ionut Siean and Radu-Daniel Vatavu. 2021. Wearable Interactions for Users with Motor Impairments: Systematic Review, Inventory, and Research Implications. In The 23rd International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’21). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3441852.3471212",
      "doi": "10.1145/3441852.3471212"
    },
    {
      "text": "G. S. Snoddy. 1926. Learning and Stability: A Psychophysiological Analysis of a Case of Motor Learning with Clinical Applications. Journal of Applied Psychology 10, 1 (1926), 1–36. https://doi.org/10.1037/h0075814 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Adam J. Sporka, Torsten Felzer, Sri H. Kurniawan, Ondřej Poláček, Paul Haiduk, and I. Scott MacKenzie. 2011. CHANTI: Predictive Text Entry Using Non-Verbal Vocal Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2463–2472. https://doi.org/10.1145/1978942.1979302",
      "doi": "10.1145/1978942.1979302"
    },
    {
      "text": "Alan Stewart. 2020. texting. https://www.britannica.com/technology/text-messaging",
      "doi": ""
    },
    {
      "text": "Kumiko Tanaka-Ishii, Yusuke Inutsuka, and Masato Takeichi. 2002. Entering text with a four-button device. In COLING 2002: The 19th International Conference on Computational Linguistics.",
      "doi": "10.3115/1072228.1072377"
    },
    {
      "text": "Takaki Tojo, Tsuneo Kato, and Seiichi Yamamoto. 2018. BubbleFlick: Investigating Effective Interface for Japanese Text Entry on Smartwatches. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’18). Association for Computing Machinery, Barcelona, Spain, 1–12. https://doi.org/10.1145/3229434.3229455",
      "doi": "10.1145/3229434.3229455"
    },
    {
      "text": "Shari Trewin, Cal Swart, and Donna Pettick. 2013. Physical accessibility of touchscreen smartphones. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. 1–8.",
      "doi": "10.1145/2513383.2513446"
    },
    {
      "text": "Radu-Daniel Vatavu and Ovidiu-Ciprian Ungurean. 2022. Understanding Gesture Input Articulation with Upper-Body Wearables for Users with Upper-Body Motor Impairments. In CHI Conference on Human Factors in Computing Systems(CHI ’22). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3491102.3501964",
      "doi": "10.1145/3491102.3501964"
    },
    {
      "text": "Keith Vertanen, Dylan Gaines, Crystal Fletcher, Alex M. Stanage, Robbie Watling, and Per Ola Kristensson. 2019. VelociWatch: Designing and Evaluating a Virtual Keyboard for the Input of Challenging Text. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300821",
      "doi": "10.1145/3290605.3300821"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: A Technique for Operating Pen-Based Interfaces Using Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). ACM, New York, NY, USA, 657–666. https://doi.org/10.1145/1240624.1240727",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "David J. Ward, Alan F. Blackwell, and David J. C. MacKay. 2002. Dasher: A Gesture-Driven Data Entry Interface for Mobile Computing. Human–Computer Interaction 17, 2-3 (Sept. 2002), 199–228. https://doi.org/10.1080/07370024.2002.9667314 Publisher: Taylor & Francis _eprint: https://www.tandfonline.com/doi/pdf/10.1080/07370024.2002.9667314.",
      "doi": ""
    },
    {
      "text": "Katie E. Yancosek and Dana Howell. 2009. A Narrative Review of Dexterity Assessments. Journal of Hand Therapy 22, 3 (July 2009), 258–270. https://doi.org/10.1016/j.jht.2008.11.004",
      "doi": ""
    },
    {
      "text": "Yeliz Yesilada, Simon Harper, Tianyi Chen, and Shari Trewin. 2010. Small-Device Users Situationally Impaired by Input. Computers in Human Behavior 26, 3 (May 2010), 427–435. https://doi.org/10.1016/j.chb.2009.12.001",
      "doi": "10.1016/j.chb.2009.12.001"
    },
    {
      "text": "Xin Yi, Chun Yu, Weinan Shi, and Yuanchun Shi. 2017. Is It Too Small?: Investigating the Performances and Preferences of Users When Typing on Tiny Qwerty Keyboards. International Journal of Human-Computer Studies 106 (Oct. 2017), 44–62. https://doi.org/10.1016/j.ijhcs.2017.05.001",
      "doi": ""
    },
    {
      "text": "Xin Yi, Chun Yu, Weijie Xu, Xiaojun Bi, and Yuanchun Shi. 2017. COMPASS: Rotational Keyboard on Non-Touch Smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, Denver, Colorado, USA, 705–715. https://doi.org/10.1145/3025453.3025454",
      "doi": "10.1145/3025453.3025454"
    }
  ]
}