{
  "doi": "10.1145/3544548.3581120",
  "title": "Can we crowdsource Tacton similarity perception and metaphor ratings?",
  "published": "2023-04-19",
  "proctitle": "CHI '23: Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2023,
  "badges": [],
  "abstract": "High-fidelity vibration actuators in recent mobile phones allow designers to crowdsource user evaluation of vibrotactile (VT) Tactons. Yet, little work has examined whether online crowdsourcing platforms can provide comparable results to lab studies. To address this question, we conducted two studies with iOS devices in the lab and crowdsourced settings. In Study I, 40 users provided pairwise similarity ratings for 12 VT Tactons that varied in their parameters (e.g., duration). In Study II, 40 new users rated pairwise similarities for 14 Tactons representing different metaphors (e.g., heartbeat). They also rated the Tactons’ match to the metaphors. In both studies, the resulting similarities and perceptual spaces strongly correlated in the lab and crowdsourced settings. Furthermore, 60% of the metaphor ratings were statistically equivalent in the two settings. We discuss the results and outline directions for future work on haptic crowdsourcing.",
  "tags": [
    "Vibrotactile Perception",
    "Crowdsourcing",
    "User Study",
    "Tacton Design",
    "Haptics"
  ],
  "authors": [
    {
      "name": "Dongjae Kwon",
      "institution": "Haptic Assistive Media Laboratory in Artificial Intelligence Graduate School, Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660369647",
      "orcid": "0000-0003-4634-3933"
    },
    {
      "name": "Ramzi Abou Chahine",
      "institution": "School of Computing Science, University of East Anglia, United Kingdom and Department of Computer Science, San Francisco State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660366558",
      "orcid": "0000-0002-5616-9775"
    },
    {
      "name": "Chungman Lim",
      "institution": "Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660372901",
      "orcid": "0000-0002-7857-3322"
    },
    {
      "name": "Hasti Seifi",
      "institution": "School of Computing and Augmented Intelligence, Arizona State University, USA and Department of Computer Science, University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502650318",
      "orcid": "0000-0001-6437-0463"
    },
    {
      "name": "Gunhyuk Park",
      "institution": "Haptic Assistive Media Laboratory, Gwangju Institute of Science and Technology, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488655407",
      "orcid": "0000-0003-2677-5907"
    }
  ],
  "references": [
    {
      "text": "Ramzi Abou Chahine, Dongjae Kwon, Chungman Lim, Gunhyuk Park, and Hasti Seifi. 2022. Vibrotactile Similarity Perception in Crowdsourced and Lab Studies. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 255–263.",
      "doi": ""
    },
    {
      "text": "Muhammad Raheel Afzal, Hosu Lee, Amre Eizad, Chang Han Lee, Min-Kyun Oh, and Jungwon Yoon. 2019. Effects of vibrotactile biofeedback coding schemes on gait symmetry training of individuals with stroke. IEEE Transactions on Neural Systems and Rehabilitation Engineering 27, 8(2019), 1617–1625.",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1(1994), 49–59.",
      "doi": "10.1016/0005-"
    },
    {
      "text": "Lorna M Brown, Stephen A Brewster, and Helen C Purchase. 2006. Multidimensional tactons for non-visual information presentation in mobile devices. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services. 231–238.",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Mark Cartwright and Bryan Pardo. 2013. Social-EQ: Crowdsourcing an Equalization Descriptor Map.. In ISMIR. 395–400.",
      "doi": ""
    },
    {
      "text": "Lou Cohen, Philip Jarvis, and Jim Fowler. 2013. Practical statistics for field biology. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Guy Cohen-Lazry, Nuphar Katzman, Avinoam Borowsky, and Tal Oron-Gilad. 2019. Directional tactile alerts for take-over requests in highly-automated driving. Transportation research part F: traffic psychology and behaviour 65 (2019), 217–226.",
      "doi": ""
    },
    {
      "text": "Marc Demers, Pascal E Fortin, Antoine Weill, Yongjae Yoo, Jeremy R Cooperstock, 2021. Active sampling for efficient subjective evaluation of tactons at scale. In 2021 IEEE World Haptics Conference (WHC). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Valérie Duthoit, Jean-Marc Sieffermann, Éric Enrègle, Camille Michon, and David Blumenthal. 2018. Evaluation and optimization of a vibrotactile signal in an autonomous driving context. Journal of Sensory Studies 33, 1 (2018), e12308.",
      "doi": ""
    },
    {
      "text": "Kyungpyo Hong, Jaebong Lee, and Seungmoon Choi. 2013. Demonstration based vibrotactile pattern authoring. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction. 219–222.",
      "doi": "10.1145/2460625.2460660"
    },
    {
      "text": "Inwook Hwang, Jongman Seo, Myongchan Kim, and Seungmoon Choi. 2013. Vibrotactile perceived intensity for mobile devices as a function of direction, amplitude, and frequency. IEEE Transactions on Haptics 6, 3 (2013), 352–362.",
      "doi": "10.1109/TOH.2013.2"
    },
    {
      "text": "Oliver Beren Kaul, Leonard Hansing, and Michael Rohs. 2019. 3DTactileDraw: a tactile pattern design interface for complex arrangements of actuators. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3290607.3313030"
    },
    {
      "text": "Joseph B Kruskal. 1964. Multidimensional scaling by optimizing goodness of fit to a nonmetric hypothesis. Psychometrika 29, 1 (1964), 1–27.",
      "doi": ""
    },
    {
      "text": "Nils Landin, Joseph M Romano, William McMahan, and Katherine J Kuchenbecker. 2010. Dimensional reduction of high-frequency accelerations for haptic rendering. In International conference on human haptic sensing and touch enabled computer applications. Springer, 79–86.",
      "doi": ""
    },
    {
      "text": "Hojin Lee, Guney Isk Tombak, Gunhyuk Park, and Katherine J Kuchenbecker. 2022. Perceptual Space of Algorithms for Three-to-One Dimensional Reduction of Realistic Vibrations. IEEE Transactions on Haptics(2022).",
      "doi": "10.1109/TOH.2022.3174229"
    },
    {
      "text": "Jaebong Lee and Seungmoon Choi. 2012. Evaluation of vibrotactile pattern design using vibrotactile score. In 2012 IEEE Haptics Symposium (HAPTICS). IEEE, 231–238.",
      "doi": ""
    },
    {
      "text": "Jaebong Lee, Jonghyun Ryu, and Seungmoon Choi. 2009. Vibrotactile score: A score metaphor for designing vibrotactile patterns. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 302–307.",
      "doi": ""
    },
    {
      "text": "Myungho Lee, Gerd Bruder, and Gregory F Welch. 2017. Exploring the effect of vibrotactile feedback through the floor on social presence in an immersive virtual environment. In 2017 IEEE Virtual Reality (VR). IEEE, 105–111.",
      "doi": ""
    },
    {
      "text": "Lofelt. 2015 — 2022. Lofelt Studio. https://developer.lofelt.com/ [Online; accessed 06-September-2022].",
      "doi": ""
    },
    {
      "text": "Joseph Luk, Jerome Pasquero, Shannon Little, Karon MacLean, Vincent Levesque, and Vincent Hayward. 2006. A role for haptics in mobile interaction: initial design using a handheld tactile display prototype. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 171–180.",
      "doi": "10.1145/1124772.1124800"
    },
    {
      "text": "Karon MacLean and Mario Enriquez. 2003. Perceptual design of haptic icons. In Proc. of EuroHaptics. 351–363.",
      "doi": ""
    },
    {
      "text": "Karon E MacLean. 2008. Foundations of transparency in tactile information design. IEEE Transactions on Haptics 1, 2 (2008), 84–95.",
      "doi": "10.1109/TOH.2008.20"
    },
    {
      "text": "Gunhyuk Park and Seungmoon Choi. 2011. Perceptual space of amplitude-modulated vibrotactile stimuli. In 2011 IEEE world haptics conference. IEEE, 59–64.",
      "doi": ""
    },
    {
      "text": "Gunhyuk Park and Seungmoon Choi. 2016. PhysVib: Physically Plausible Vibrotactile Feedback Library to Collisions on a Mobile Device. In International AsiaHaptics conference. Springer, 409–413.",
      "doi": ""
    },
    {
      "text": "Gunhyuk Park and Katherine J Kuchenbecker. 2019. Objective and subjective assessment of algorithms for reducing three-axis vibrations to one-axis vibrations. In 2019 IEEE World Haptics Conference (WHC). IEEE, 467–472.",
      "doi": ""
    },
    {
      "text": "Jerome Pasquero, Joseph Luk, Shannon Little, and Karon MacLean. 2006. Perceptual analysis of haptic icons: an investigation into the validity of cluster sorted mds. In 2006 14th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 437–444.",
      "doi": ""
    },
    {
      "text": "Evan Pezent, Ali Israr, Majed Samad, Shea Robinson, Priyanshu Agarwal, Hrvoje Benko, and Nick Colonnese. 2019. Tasbi: Multisensory squeeze and vibrotactile wrist haptics for augmented and virtual reality. In 2019 IEEE World Haptics Conference (WHC). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Prolific. 2015 — 2022. Prolific, quickly find research participants you can trust. https://www.prolific.co/ [Online; accessed 06-September-2022].",
      "doi": ""
    },
    {
      "text": "Rivu Radiah, Ville Mäkelä, Sarah Prange, Sarah Delgado Rodriguez, Robin Piening, Yumeng Zhou, Kay Köhle, Ken Pfeuffer, Yomna Abdelrahman, Matthias Hoppe, 2021. Remote VR studies: A framework for running virtual reality studies remotely via participant-owned HMDs. ACM Transactions on Computer-Human Interaction (TOCHI) 28, 6(2021), 1–36.",
      "doi": "10.1145/3472617"
    },
    {
      "text": "Khairi Reda, Pratik Nalawade, and Kate Ansah-Koi. 2018. Graphical perception of continuous quantitative maps: the effects of spatial frequency and colormap design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173846"
    },
    {
      "text": "Jonghyun Ryu and Seungmoon Choi. 2008. posVibEditor: Graphical authoring tool of vibrotactile patterns. In 2008 IEEE International Workshop on Haptic Audio visual Environments and Games. IEEE, 120–125.",
      "doi": ""
    },
    {
      "text": "Nasir Saeed, Haewoon Nam, Mian Imtiaz Ul Haq, and Dost Bhatti Muhammad Saqib. 2018. A survey on multidimensional scaling. ACM Computing Surveys (CSUR) 51, 3 (2018), 1–25.",
      "doi": "10.1145/3178155"
    },
    {
      "text": "Oliver S Schneider and Karon E MacLean. 2014. Improvising design with a haptic instrument. In IEEE Haptics Symposium (HAPTICS). IEEE, 327–332.",
      "doi": ""
    },
    {
      "text": "Oliver S Schneider and Karon E MacLean. 2016. Studying design process and example use with Macaron, a web-based vibrotactile effect editor. In 2016 IEEE Haptics Symposium (HAPTICS). IEEE, 52–58.",
      "doi": ""
    },
    {
      "text": "Oliver S Schneider, Hasti Seifi, Salma Kashani, Matthew Chun, and Karon E MacLean. 2016. HapTurk: crowdsourcing affective ratings of vibrotactile icons. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3248–3260.",
      "doi": "10.1145/2858036.2858279"
    },
    {
      "text": "Hasti Seifi, Kailun Zhang, and Karon E MacLean. 2015. VibViz: Organizing, visualizing and navigating vibration libraries. In 2015 IEEE World Haptics Conference (WHC). IEEE, 254–259.",
      "doi": ""
    },
    {
      "text": "Jongman Seo and Seungmoon Choi. 2013. Perceptual analysis of vibrotactile flows on a mobile device. IEEE transactions on haptics 6, 4 (2013), 522–527.",
      "doi": "10.1109/TOH.2013.24"
    },
    {
      "text": "Jongman Seo, Sunung Mun, Jaebong Lee, and Seungmoon Choi. 2018. Substituting motion effects with vibrotactile effects for 4D experiences. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3173574.3174002"
    },
    {
      "text": "David Ternes and Karon E MacLean. 2008. Designing large sets of haptic icons with rhythm. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 199–208.",
      "doi": "10.1007/978-3-540-69057-3_24"
    },
    {
      "text": "Jan BF van Erp, Michiel MA Spapé, 2003. Distilling the underlying dimensions of tactile melodies. In Proceedings of Eurohaptics, Vol. 2003. 111–120.",
      "doi": ""
    },
    {
      "text": "Yasemin Vardar, Christian Wallraven, and Katherine J Kuchenbecker. 2019. Fingertip interaction metrics correlate with visual and haptic perception of real surfaces. In 2019 IEEE World Haptics Conference (WHC). IEEE, 395–400.",
      "doi": ""
    },
    {
      "text": "Yulin Wang, Barbara Millet, and James L Smith. 2016. Designing wearable vibrotactile notifications for information communication. International Journal of Human-Computer Studies 89 (2016), 24–34.",
      "doi": "10.1016/j.ijhcs.2016.01.004"
    },
    {
      "text": "XRDRN. 2015 — 2022. XRDRN, help XR research reach the world. https://www.xrdrn.org/ [Online; accessed 06-September-2022].",
      "doi": ""
    },
    {
      "text": "Yongjae Yoo, Taekbeom Yoo, Jihyun Kong, and Seungmoon Choi. 2015. Emotional responses of tactile icons: Effects of amplitude, frequency, duration, and envelope. In 2015 IEEE World Haptics Conference (WHC). IEEE, 235–240.",
      "doi": ""
    },
    {
      "text": "FW Young and RM Hamer. 1994. Theory and applications of multidimensional scaling. Hillsdale, NJ: Eribaum Associates(1994).",
      "doi": ""
    }
  ]
}