{
  "doi": "10.1145/1978942.1979277",
  "title": "Utility of human-computer interactions: toward a science of preference measurement",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2275-2284",
  "year": 2011,
  "badges": [],
  "abstract": "The success of a computer system depends upon a user choosing it, but the field of Human-Computer Interaction has little ability to predict this user choice. We present a new method that measures user choice, and quantifies it as a measure of utility. Our method has two core features. First, it introduces an economic definition of utility, one that we can operationalize through economic experiments. Second, we employ a novel method of crowdsourcing that enables the collection of thousands of economic judgments from real users.",
  "tags": [
    "crowdsourcing",
    "utility",
    "evaluation",
    "mechanical turk",
    "HCI",
    "economics",
    "user-interface"
  ],
  "authors": [
    {
      "name": "Michael Toomim",
      "institution": "University of Washington & Microsoft Research Asia , Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578147",
      "orcid": "missing"
    },
    {
      "name": "Travis Kriplean",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339510476",
      "orcid": "missing"
    },
    {
      "name": "Claus Pörtner",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655785",
      "orcid": "missing"
    },
    {
      "name": "James Landay",
      "institution": "University of Washington & Microsoft Resesarch , Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Ariely, D. Predictably Irrational: The Hidden Forces That Shape Our Decisions. HarperCollins. 2008.",
      "doi": ""
    },
    {
      "text": "Ben-Bassat, T., Meyer, J., and Tractinsky, N. Economic and Subjective Measures of the Perceived Value of Aesthetics and Usability. in ACM Transactions of Computer-Human Interaction, 13 (2). 2006. 210--234.  ",
      "doi": "10.1145/1165734.1165737"
    },
    {
      "text": "Cooper, S., Khatib, F., Treuille, A., Barbero, J., Lee, J-H., Beenen, M., Leaver-Fay, A., Baker, D., Popovic, Z. &amp;#38; Foldit players. Predicting Protein Structures with a Multiplayer Online Game. Nature 466, 756--760.",
      "doi": ""
    },
    {
      "text": "Greene, W.H. Econometric Analysis. Macmillan. 1990.",
      "doi": ""
    },
    {
      "text": "Grudin, J. Utility and Usability: Research Issues and Development Contexts. Interacting with Computers, 4, (1992) 209--217.",
      "doi": ""
    },
    {
      "text": "Grudin J. and Wang Laboratories. Adapting a Psychophysical Method to Measure Performance and Preference Tradeoffs in Human-Computer Interaction. in Proc. INTERACT (1984). 737--741.",
      "doi": ""
    },
    {
      "text": "Heer, J. and Bostock, M. Crowdsourcing Graphical Perception: Using Mechanical Turk to Assess Visualization Design. in Proc. CHI 2010. (2000).  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Horton, J.J. and Chilton, L. The Labor Economics of Paid Crowdsourcing. in Proc. ACM Electronic Commerce 2010. (2010).  ",
      "doi": "10.1145/1807342.1807376"
    },
    {
      "text": "Ipeirotis, P.G. Analyzing the Amazon Mechanical Turk Marketplace. New York University Report no. CeDER-10-04. 2010.",
      "doi": ""
    },
    {
      "text": "Ipeirotis, P.G. The Explosion of Micro-Crowdsourcing Services. http://behind-the-enemy-lines.blogspot.com/2010/10/explosion-of-micro-crowdsourcing.html.",
      "doi": ""
    },
    {
      "text": "Ipeirotis, P.G. Provost, F. and Wang, J. Quality Management on Amazon Mechanical Turk. In Proceedings of KDD-HCOMP (2010).  ",
      "doi": "10.1145/1837885.1837906"
    },
    {
      "text": "Ipeirotis, P.G. Why People Participate on Mechanical Turk, Now Tabulated. http://behind-the-enemy-lines.blogspot.com/2008/09/why-people-participate-on-mechanical.htm.",
      "doi": ""
    },
    {
      "text": "Kittur, A.; Chi, E. H. ; Suh, B. Crowdsourcing user studies with Mechanical Turk. In Proc. CHI 2008, ACM Press (2008). 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Klein, J.P. Survival Analysis. Springer, 2003.",
      "doi": ""
    },
    {
      "text": "Kohavi, R.. Practical Guide to Controlled Experiments on the Web: Listen to Your Customers not to the HiPPO. in Proc KDD 2007. (2007.  ",
      "doi": "10.1145/1281192.1281295"
    },
    {
      "text": "MacKenzie, S. Fitts' Law as a Research and Design Tool. in Human-Computer Interaction (HCI), 1992 7(1), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Malone, T.W. Heuristics for Designing Enjoyable User Interfaces: Lessons from Computer Games. in CHI 1982. ACM Press (1982).  ",
      "doi": "10.1145/800049.801756"
    },
    {
      "text": "Nielsen, J. Usability Engineering. Morgan Kaufmann, 2001.",
      "doi": ""
    },
    {
      "text": "Ross, J., Irani, L., Silberman, M.S., Zaldivar, A. and Tomlinson, B. Who are the Crowdworkers? Shifting Demographics in Mechanical Turk. alt.chi '10, ACM Press.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Simon, H.A. \"Designing Organizations for an Information-Rich World. in Martin Greenberger,\" Computers, Communication, and the Public Interest, Baltimore, MD: The Johns Hopkins Press (1971).",
      "doi": ""
    },
    {
      "text": "Smith, A. An Inquiry into the Nature and Causes of the Wealth of Nations. London: Methuen and Co., Ltd., ed. Edwin Cannan, 1904.",
      "doi": ""
    },
    {
      "text": "Van Ahn, L. and Dabbish, L. Labeling Images with a Computer Game. in Proc. CHI 2004. ACM Press (2004).  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Varian, H.R. Microeconomic Analysis. Norton, 1984.",
      "doi": ""
    },
    {
      "text": "Wilson, E. Probable Inference, the Law of Succession, and Statistical Inference. Journal of the American Statistical Association. 1927. 22: 209--212..",
      "doi": ""
    }
  ]
}