{
  "doi": "10.1145/1978942.1979325",
  "title": "On the necessity of user-friendly CAPTCHA",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2623-2626",
  "year": 2011,
  "badges": [],
  "abstract": "A \"Completely Automated Public Turing test to tell Computers and Humans Apart\" (CAPTCHA) is a mechanism widely used nowadays for protection of web applications, interfaces, and services from malicious users. A questionnaire-based survey combined with a real usage scenario of a native-language CAPTCHA mechanism was conducted in order to investigate several aspects that affect end-user perceptions related to the quality of CAPTCHA. A total of 210 participants of age between 19 and 64 participated during May and July 2010. The survey results validate the common belief that CAPTCHAs are still difficult for humans to solve. They also provide insights that can be applied to improve users' experience on interacting with CAPTCHA systems.",
  "authors": [
    {
      "name": "Christos A. Fidas",
      "institution": "University of Patras, Patras, Greece",
      "img": "/do/10.1145/contrib-81100070852/rel-imgonly/photo.png",
      "acmid": "81100070852",
      "orcid": "missing"
    },
    {
      "name": "Artemios G. Voyiatzis",
      "institution": "Industrial Systems Institute, Patras, Greece",
      "img": "/do/10.1145/contrib-81100486005/rel-imgonly/artemios-300x300.png",
      "acmid": "81100486005",
      "orcid": "missing"
    },
    {
      "name": "Nikolaos M. Avouris",
      "institution": "University of Patras, Patras, Greece",
      "img": "/do/10.1145/contrib-81100274753/rel-imgonly/nma.jpg",
      "acmid": "81100274753",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. El Ahmad, J. Yan, and L. Marshall. The Robustness of a New CAPTCHA. In Proc. of the Third European Workshop on System Security (EUROSEC '10). ACM, New York, NY, USA, 36--41.  ",
      "doi": "10.1145/1752046.1752052"
    },
    {
      "text": "L. von Ahn, M. Blum, and J. Langford. Telling humans and computers apart automatically. Commun. ACM 47, 2 (February 2004), 56--60.  ",
      "doi": "10.1145/966389.966390"
    },
    {
      "text": "S. Bohr, A. Shome, and J. Simon. Improving auditory CAPTCHA security. ISR Tech. rep., University of Maryland, College Park, MD 2008.",
      "doi": ""
    },
    {
      "text": "R. Chow, P. Goll&amp;#233;, M. Jakobsson, X. Wang, and L. Wang. Making CAPTCHAs clickable. In Proc. of the 9th workshop on Mobile computing systems and applications (HotMobile '08). ACM, New York, NY, USA, 91--94.  ",
      "doi": "10.1145/1411759.1411783"
    },
    {
      "text": "C.J. Hernandez-Castro and A. Ribagorda. Pitfalls in CAPTCHA design and implementation: The Math CAPTCHA, a case study. Computers &amp;#38; Security, 29, 1 (2010), 141--157.",
      "doi": "10.1016/j.cose.2009.06.006"
    },
    {
      "text": "J. Holman, J. Lazar, J. Feng, and J. d'Arcy. Developing Usable CAPTCHAs for Blind Users. In Proc. of the 9th SIGACCESS conference on Computers and Accessibility (Assets '07). ACM, New York, NY, USA, 245--246.  ",
      "doi": "10.1145/1296843.1296894"
    },
    {
      "text": "K.A. Kluever and R. Zanibbi. Balancing usability and security in a video CAPTCHA. In Proc. of the 5th Symposium on Usable Privacy and Security (SOUPS '09). ACM, New York, NY, USA, Article 14 , 11 pages.  ",
      "doi": "10.1145/1572532.1572551"
    },
    {
      "text": "S. Li, S.A.H. Shah, M.A.U. Khan, S.A. Khayam, A.-R. Sadeghi, and R. Schmitz. Breaking e-Banking CAPTCHAs. In Proc. of 26th Annual Computer Security Applications Conference (ACSAC 2010), Austin, Texas, USA, December 6--10, 2010, 171--180.  ",
      "doi": "10.1145/1920261.1920288"
    },
    {
      "text": "M. Motoyama, K. Levchenko, C. Kanich, D. McCoy, G.M. Voelker, and S. Savage. Re: CAPTCHAs-Understanding CAPTCHA-solving services in an economic context. In Proc. of the 19th USENIX Security Symposium, USENIX Association, 435--462. ",
      "doi": "10.5555/1929820.1929858"
    },
    {
      "text": "B. Pinkas and T. Sander. Securing Passwords Against Dictionary Attacks. In Proc. of the 9th ACM conference on Computer and communications security (CCS '02), ACM, New York, NY, USA, 161--170.  ",
      "doi": "10.1145/586110.586133"
    },
    {
      "text": "1J. Tam, J. Simsa, S. Hyde, and L. Von Ahn. Breaking Audio CAPTCHAs. In Proc. of the 22nd Annual Conference on Neural Information Processing Systems 2008, MIT Press, 1625--1632.",
      "doi": ""
    },
    {
      "text": "J. Yan and A.S. El Ahmad. Breaking Visual CAPTCHAs with Na&amp;#239;ve Pattern Recognition Algorithms. In Proc. of. ACSAC 2007. IEEE Computer Society, 279--291.",
      "doi": ""
    },
    {
      "text": "J. Yan and A.S. El Ahmad. The Robustness of CAPTCHAs: A Security Engineering Perspective. Newcastle Univ. Tech. rep. CS-TR-1180, Nov. 2009.",
      "doi": ""
    },
    {
      "text": "J. Yan and A.S. El Ahmad. Usability of CAPTCHAs or usability issues in CAPTCHA design. In Proc. of SOUPS '08. ACM, New York, NY, USA, 44--52..  ",
      "doi": "10.1145/1408664.1408671"
    }
  ]
}