{
  "doi": "10.1145/1978942.1979065",
  "title": "Comet and target ghost: techniques for selecting moving targets",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "839-848",
  "year": 2011,
  "badges": [],
  "abstract": "Numerous applications such as simulations, air traffic control systems, and video surveillance systems are inherently composed of spatial objects that move in a scene. In many instances, users can benefit from tools that allow them to select these targets in real-time, without having to pause the dynamic display. However, selecting moving objects is considerably more difficult and error prone than selecting stationary targets. In this paper, we evaluate the effectiveness of several techniques that assist in selecting moving targets. We present Comet, a technique that enhances targets based on their speed and direction. We also introduce Target Ghost, which allows users to select a static proxy of the target, while leaving the motion uninterrupted. We found a speed benefit for the Comet in a 1D selection task in comparison to other cursor and target enhancements. For 2D selection, Comet outperformed Bubble cursor but only when Target Ghost was not available. We conclude with guidelines for design.",
  "authors": [
    {
      "name": "Khalad Hasan",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/do/10.1145/contrib-81484647407/rel-imgonly/khalad_hasan.jpg",
      "acmid": "81484647407",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R. (2004). Beating Fitts' law: virtual en-hancements for pointing facilitation. Int. J. Hum.-Comput. Stud. 61, 6, 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P. Bederson, B., and Zierlinger, A. Drag-and-Pop and Drag-and-Pick (2003). Techniques for Accessing Remote Screen Content on Touch- and Pen-operated Systems. Proc. of Interact'03, pp. 57--64.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Zotov, A., Cutrell, E., and Hinckley, K. (2008). Starburst: a target expansion algorithm for non-uniform target distributions. Proc. of AVI '08, 129--137.  ",
      "doi": "10.1145/1385569.1385592"
    },
    {
      "text": "Bezerianos, A., Balakrishnan, R. (2005). The Vacuum: Facilitating the manipulation of distant objects. Proc. of CHI'05, 361--370.  ",
      "doi": "10.1145/1054972.1055023"
    },
    {
      "text": "Bezerianos, A., Dragicevic, P., and Balakrishnan, R. 2006. Mnemonic rendering: an image-based approach for exposing hidden changes in dynamic displays. Proc. of UIST '06, 159--168.  ",
      "doi": "10.1145/1166253.1166279"
    },
    {
      "text": "Chapuis, O., Labrune, J., and Pietriga, E. (2009). Dy-naSpot: speed-dependent area cursor. Proc. of CHI '09, 1391--1400.  ",
      "doi": "10.1145/1518701.1518911"
    },
    {
      "text": "Cheng, K., Luo, S., Chen, B., and Chu, H. (2009). SmartPlayer: user-centric video fast-forwarding. Proc. of CHI '09, 789--798.  ",
      "doi": "10.1145/1518701.1518823"
    },
    {
      "text": "Dragicevic, P., Ramos, G., Bibliowitcz, J., Nowrouzezahrai, D., Balakrishnan, R., and Singh, K. (2008). Video browsing by direct manipulation. Proc. of CHI '08, 237--246.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Faure, G., Chapuis, O., and Beaudouin-Lafon, M. (2009). Acquisition of Animated and Pop-Up Targets. Proc. of INTERACT '09, 372--385.  ",
      "doi": "10.1007/978-3-642-03658-3_43"
    },
    {
      "text": "Fitts, P. M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47, 381--39.",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. (2005). The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. Proc. of CHI '05, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Grossman, T., Kong, N., Balakrishnan, R. (2007): Modeling pointing at targets of arbitrary shapes. Proc. of CHI'07, 463--472.  ",
      "doi": "10.1145/1240624.1240700"
    },
    {
      "text": "Hoffmann, E. R., (1991) Capture of Moving Targets: a Modification of Fitts' Law. Ergonomics, 34, 211--220.",
      "doi": ""
    },
    {
      "text": "Ilich, M. V. (2010) Moving Target Selection in Interactive Video, M.Sc. Thesis, University of British Columbia, pp. 110.",
      "doi": ""
    },
    {
      "text": "Jagacinski, R. J., Repperger, D. W., Ward, S. L., and Moran, M. S. (1980). A test of Fitts' law with moving targets. Human Factors, 22(2):225--233.",
      "doi": ""
    },
    {
      "text": "Kabbash, P. and Buxton, W. (1995). The \"Prince\" technique: Fitts' law and selection using area cursors. Proc. of CHI'95, p. 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "MacKenzie, I. S. and Buxton, W. (1992). Extending Fitts' law to two-dimensional tasks. Proc. of CHI '92, 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "McGuffin, M. and Balakrishnan, R. (2002). Acquisition of expanding targets. Proc. of CHI '02, 57--64.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "McGuffin, M. J. and Balakrishnan, R. (2005). Fitts' law and expanding targets: Experimental studies and designs for user interfaces. TOCHI, 12, 4, 388--422.  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "Mould, D. and Gutwin, C. (2004). The effects of feed-back on targeting with multiple moving targets. Proc. of Graphics interface 2004, 25--32. ",
      "doi": "10.5555/1006058.1006062"
    },
    {
      "text": "Tresilian, J. R. &amp;#38; Lonergan, A. (2002) Intercepting moving objects: effect of temporal precision and movement amplitude. Experimental Brain Research, 142, 193--207.",
      "doi": ""
    }
  ]
}