{
  "doi": "10.1145/1978942.1979314",
  "title": "Variation in importance of time-on-task with familiarity with mobile phone models",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2551-2554",
  "year": 2011,
  "badges": [],
  "abstract": "We studied the extent to which time-on-task is correlated with perception of usability for people who are familiar with a phone model and for those who are not. Our controlled experiment, conducted in Japan, correlated subjective usability assessments with time-on-task for expert and novice users on three different mobile phone models. We found that the correlation between perceived usability and time-on-task is stronger when participants are more familiar with the phone model. While not significant when initially inspecting a new phone model, a negative correlation between time-on-task and perceived usability becomes significant with as little as an hour's time doing tasks on the unfamiliar phone. This suggests that designing the UI to make time-on-task as short as possible may not have much effect on the purchase decision, but as experience increases, it may increase the loyalty of existing users.",
  "authors": [
    {
      "name": "Shunsuke Suzuki",
      "institution": "NEC Corporation, Kawasaki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442592637",
      "orcid": "missing"
    },
    {
      "name": "Victoria Bellotti",
      "institution": "Palo Alto Research Center (PARC), Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81100464780/rel-imgonly/bellotti-portrait-small.jpg",
      "acmid": "81100464780",
      "orcid": "missing"
    },
    {
      "name": "Nick Yee",
      "institution": "Palo Alto Research Center (PARC), Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319504922",
      "orcid": "missing"
    },
    {
      "name": "Bonnie E. John",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "Yusuke Nakao",
      "institution": "NEC Corporation, Kawasaki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442599298",
      "orcid": "missing"
    },
    {
      "name": "Toshiyuki Asahi",
      "institution": "NEC Corporation, Ikoma, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100489648",
      "orcid": "missing"
    },
    {
      "name": "Shin'ichi Fukuzumi",
      "institution": "NEC Corporation, Kawasaki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100151013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brooke, J. SUS: A 'quick and dirty' usability scale. In P. W. Jordan, B. Thomas, B. A. Weerdmeester, and I. L. McClelland (Eds.), Usability Evaluation in Industry (pp. 189--194), Taylor &amp;#38; Francis, London, (1996).",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T.P. and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ (1983). ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Fr&amp;#248;kj&amp;#230;r, E., Hertzum, M. and Hornb&amp;#230;k, K. Measuring usability: are effectiveness, efficiency, and satisfaction really correlated? In Proc. CHI 2000, ACM Press (2000), 345--352.  ",
      "doi": "10.1145/332040.332455"
    },
    {
      "text": "Goo Ranking: Ranking of functions used commonly on a mobile phone. (2005), Retrieved September 17th, 2010. http://ranking.goo.ne.jp/ranking/065/mobile_use/.",
      "doi": ""
    },
    {
      "text": "Goo Ranking: Ranking of functions used commonly on a mobile phone besides call and email. (2008), Retrieved September 17th, 2010, http://ranking.goo.ne.jp/ranking/065/cellular_phone_function/.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Burmester, M. and Koller, F. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualit&amp;#228;t. In J. Ziegler and G. Szwillus (Eds.), Mensch &amp;#38; Computer 2003: Interaktion in Bewegung (pp.187--196), B.G. Teubner, Stuttgart, (2003).",
      "doi": ""
    },
    {
      "text": "Hornb&amp;#230;k, K. and Law, E.L. Meta-Analysis of correlations among usability measures. In Proc. CHI 2007, ACM Press (2007), 617--626.  ",
      "doi": "10.1145/1240624.1240722"
    },
    {
      "text": "Karjaluoto, H., Karvonen, J., Kesti, M., Koivum&amp;#228;ki, T., Manninen, M., Pakola, J., Ristola, A. and Salo, J. Factors affecting consumer choice of mobile phones: Two studies from Finland. Journal of Euromarketing 14, 3 (2005), 59--82.",
      "doi": ""
    },
    {
      "text": "My Voice: Functions used commonly on a mobile phone. (2008), Retrieved September 17th, 2010. http://www.myvoice.co.jp/biz/surveys/11601/index.html.",
      "doi": ""
    },
    {
      "text": "Nikkei BP: Which functions used commonly on a mobile phone? (2008), Retrieved September 17th, 2010. http://pc.nikkeibp.co.jp/article/column/20080919/1008086/.",
      "doi": ""
    },
    {
      "text": "Oricon: Functions used mainly on a mobile phone. (2009), Retrieved September 17th, 2010. http://life.oricon.co.jp/64543/full/#rk.",
      "doi": ""
    },
    {
      "text": "Quinn, J. M. and Tran, T. Q. Attractive phones don't have to work better: Independent effects of attractiveness, effectiveness, and efficiency on perceived usability. In Proc. CHI 2010, ACM Press (2010), 353--362.  ",
      "doi": "10.1145/1753326.1753380"
    },
    {
      "text": "Ryu, Y. S. Development of usability questionnaires for electronic mobile products and decision making methods, Doctoral Dissertation, Virginia Polytechnic Institute and State University, Blacksburg, VA, (2005).",
      "doi": ""
    },
    {
      "text": "Ryu, Y. S., Suh, T. and Kim, H. S. Revising the mobile phone usability questionnaire (MPUQ): An item response theory approach. In Proc. Society of Marketing Advances 2008, (2008), 235--236.",
      "doi": ""
    },
    {
      "text": "Sauro, J. and Lewis, J.R. Correlations among prototypical usability metrics: evidence for the construct of usability. In Proc. CHI 2009, ACM Press (2009), 1609--1618.  ",
      "doi": "10.1145/1518701.1518947"
    },
    {
      "text": "Sauro, J. Does better usability increase customer loyalty? Measuring Usability article. Retrieved on September 19th, 2010. http://www.measuringusability.com/usability-loyalty.php.",
      "doi": ""
    },
    {
      "text": "Seebode, J., Schaffer, S., Wechsung, I. and Metze, F. Influence of training on direct and indirect measures for the evaluation of multimodal systems. In Proc. Interspeech 2009, (2009), 300--303.",
      "doi": ""
    },
    {
      "text": "Suzuki, S., Nakao, Y., Asahi, T., Bellotti, V., Yee, N. and Fukuzumi, S. Empirical comparison of task completion time between mobile phone models with matched interaction sequences. In Proc. HCI International 2009, Springer (2009), 114--122.  ",
      "doi": "10.1007/978-3-642-02580-8_13"
    }
  ]
}