{
  "doi": "10.1145/1978942.1979454",
  "title": "Donate for credibility: how contribution incentives can improve credibility",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3435-3438",
  "year": 2011,
  "badges": [],
  "abstract": "This study explores whether certain contribution incentives for online user-generated content can undermine or enhance contributor's credibility. In an online experiment, we found that contributors who are rewarded with donations made in their names are perceived to be more credible than contributors who are financially compensated through revenue-sharing or contribute voluntarily. In addition, disclosing the chosen charity for donation can also impact credibility. Content viewer's self-identification with charity and the congruency between charity and content topic are both factors that may enhance credibility. Our findings lead to practical implications on when and how to use contribution incentives to enhance credibility.",
  "authors": [
    {
      "name": "Gary Hsieh",
      "institution": "Michigan State University, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    }
  ],
  "references": [
    {
      "text": "1. Butler, B. 2001. Membership Size, Communication Activity, and Sustainability: A Resource-Based Model of Online Social Structures. Information Systems Research, 12, 4, 346--362.  ",
      "doi": "10.1287/isre.12.4.346.9703"
    },
    {
      "text": "2. Crano, W. D. 1970. Effect of Sex, Response Order, and Expertise in Conformity: A Dispositional Approach. Sociometry, 33, 239--252.",
      "doi": ""
    },
    {
      "text": "3. Eagly, A. H., Wood, W., & Chaiken, S. 1978. Causal Inferences About Communicators and Their Effect on Opinion Change. Journal of Personality and Social Psychology, 36, 424--435.",
      "doi": ""
    },
    {
      "text": "4. Eisend, M. 2006. Source Credibility Dimensions in Marketing Communication -- A Generalized Solution, Journal of Empirical Generalizations in Marketing, 1, 1--33.",
      "doi": ""
    },
    {
      "text": "5. Flanagin, A. J., & Metzger, M. J. 2000. Perceptions of Internet information credibility. Journalism & Mass Communication Quarterly, 77, 515--540.",
      "doi": ""
    },
    {
      "text": "6. Fogg, B.J., Marshall, J., Laraki, O., et al. 2001. What Makes Web Sites Credible? A Report on a Large Quantitative Study. In Proceedings of SIGCHI, 61--6.  ",
      "doi": "10.1145/365024.365037"
    },
    {
      "text": "7. Fogg, B.J., & Tseng, H. 1999. The Elements of Computer Credibility. In Proceedings of SIGCHI, 80--8.  ",
      "doi": "10.1145/302979.303001"
    },
    {
      "text": "8. Helm, S. & Willach, A. 2009. The Credibility Effect of Paid vs. non-Paid Referrals. In Proceedings of ANZMA.",
      "doi": ""
    },
    {
      "text": "9. Hovland, C., Janis, I., & Kelley, H. 1953. Communication and Persuasion. New Haven, CT: Yale University Press.",
      "doi": ""
    },
    {
      "text": "10. Hsieh, G., Kraut, R.E., & Hudson, S.E. 2010. Why Pay?: Exploring How Financial Incentives are Used for Question & Answer. In Proceedings of SIGCHI,305--31.  ",
      "doi": "10.1145/1753326.1753373"
    },
    {
      "text": "11. Hwang, S. 2010. The Effect of Charitable Giving by Celebrities on the Personal Public Relations. Public Relations Review, 36(3), 313--15.",
      "doi": ""
    },
    {
      "text": "12. Johar, G.V. & Pham, M.T. 1999. Relatedness, Prominence and Constructive Sponsor Identification. Journal of Marketing Research, 36, 299--312.",
      "doi": ""
    },
    {
      "text": "13. Rieh, S.Y., & Danielson, D. 2007. Credibility: A multidisciplinary framework. In B. Cronin (Ed.). Annual review of information science and technology, 41, 307--36.  ",
      "doi": "10.5555/1658843.1658857"
    },
    {
      "text": "14. Rifon, N.J., Choi, S.M., Trimble, C.S., & Li,H. 2004. Congruence Effects in Sponsorship: The Mediating Role of Sponsor Credibility and Consumer Attributions of Sponsor Motives. Journal of Advertising, 33, 29--42.",
      "doi": ""
    },
    {
      "text": "15. Rotter, J.B. & Stein, D.K. 1971. Public Attitudes Toward the Trustworthiness, Competence, and Altruism of Twenty Selected Occupations. Journal of Applied Social Psychology, 1(4), 334--343.",
      "doi": ""
    },
    {
      "text": "16. Ruth, J.A., & Simonin, B.L. 2003. Brought to You by Brand A and Brand B: Investigating Multiple Sponsors Influence On Consumer Attitudes Towards Sponsorship Events. Journal of Advertising, 32 (3), 19--3.",
      "doi": ""
    },
    {
      "text": "17. Simons, H.W., Berkowitz, N.N., Moyer. R.J. 1970. Similarity, Credibility, and Attitude Change: A Review and a Theory. Psychological Bulletin, 73 (1), 1--1.",
      "doi": ""
    },
    {
      "text": "18. Vonk, R. 1999. Impression Formation and Impression Management: Motives, Traits, and Likeability Inferred from Self-Promoting and Self-Deprecating Behavior. Social Cognition, 17, 390--412.",
      "doi": ""
    }
  ]
}