{
  "doi": "10.1145/1978942.1979282",
  "title": "Pairing devices for social interactions: a comparative usability evaluation",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2315-2324",
  "year": 2011,
  "badges": [],
  "abstract": "When users wish to establish wireless radio communication between/among their devices, the channel has to be bootstrapped first. The process of setting up a secure communication channel between two previously unassociated devices is referred to as \"Secure Device Pairing\". The focus of prior research on this topic has mostly been limited to \"personal pairing\" scenarios, whereby a single user controls both the devices. In this paper, we instead consider \"social pairing\" scenarios, whereby two different users establish pairing between their respective devices. We present a comprehensive study to identify methods suitable for social pairing, and comparatively evaluate the usability and security of these methods. Our results identify methods best-suited for users, in terms of efficiency, error-tolerance and of course, usability. Our work provides insights on the applicability and usability of methods for emerging social pairing scenarios, a topic largely ignored so far.",
  "authors": [
    {
      "name": "Ersin Uzun",
      "institution": "Palo Alto Research Center, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81384615017/rel-imgonly/ersin4.jpg",
      "acmid": "81384615017",
      "orcid": "missing"
    },
    {
      "name": "Nitesh Saxena",
      "institution": "New York University, New York, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100341768",
      "orcid": "missing"
    },
    {
      "name": "Arun Kumar",
      "institution": "New York University, New York, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440598828",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "D. Balfanz et al. Talking to strangers: Authentication in ad-hoc wireless networks. In Network and Distributed System Security Symposium (NDSS), 2002.",
      "doi": ""
    },
    {
      "text": "D. Balfanz et al. Network-in-a-box: How to set up a secure wireless network in under a minute. In USENIX Security, pages 207--222, 2004. ",
      "doi": "10.5555/1251375.1251390"
    },
    {
      "text": "V. Boyko, P. MacKenzie, and S. Patel. Provably secure password-authenticated key exchange using diffie-heilman. Eurocrypt, 2000. ",
      "doi": "10.5555/1756169.1756186"
    },
    {
      "text": "J. Cohen et al. Applied multiple regression/correlation analysis for the behavioral sciences. Erlbaum Hillsdale, NJ, 1983.",
      "doi": ""
    },
    {
      "text": "C. M. Ellison and S. Dohrmann. Public-key support for group collaboration. ACM Transactions on Information and System Security (TISSEC), 6(4):547--565, 2003.  ",
      "doi": "10.1145/950191.950195"
    },
    {
      "text": "I. Goldberg. Visual key fingerprint code. http://www.cs.berkeley.edu/iang/visprint.c, 1996.",
      "doi": ""
    },
    {
      "text": "M. Goodrich et al. Loud and clear: Human-verifiable authentication based on audio. In International Conference on Distributed Computing Systems (ICDCS), 2006.  ",
      "doi": "10.1109/ICDCS.2006.52"
    },
    {
      "text": "L. Holmquist et al. Smart-its friends: A technique for users to easily establish connections between smart artifacts. In Ubicomp, 2001. ",
      "doi": "10.5555/647987.741340"
    },
    {
      "text": "S.-J. Hong, K. Y. Tam, and J. Kim. Mobile data service fuels the desire for uniqueness. Communications of the ACM, 49(9), 2006.  ",
      "doi": "10.1145/1151030.1151034"
    },
    {
      "text": "I. Ion et al. Influence of user perception, security needs, and social factors on device pairing method choices. In SOUPS: Symposium on Usable Privacy and Security, 2010.  ",
      "doi": "10.1145/1837110.1837118"
    },
    {
      "text": "R. Kainda, I. Flechais, and A. Roscoe. Two heads are better than one: Security and usability of device associations in group scenarios. In SOUPS: Symposium on Usable Privacy and Security, pages 1--13, 2010.  ",
      "doi": "10.1145/1837110.1837117"
    },
    {
      "text": "R. Kainda, I. Flechais, and A. W. Roscoe. Usability and security of out-of-band channels in secure device pairing protocols. In SOUPS: Symposium on Usable Privacy and Security, 2009.  ",
      "doi": "10.1145/1572532.1572547"
    },
    {
      "text": "H. Kaiser. The application of electronic computers to factor analysis. Educational and psychological measurement, 20(1):141--151, 1960.",
      "doi": ""
    },
    {
      "text": "A. K. Karlson, A. B. Brush, and S. Schechter. Can i borrow your phone?: understanding concerns when sharing mobile phones. In CHI '09: Conference on Human factors in computing systems, 2009.  ",
      "doi": "10.1145/1518701.1518953"
    },
    {
      "text": "T. Kindberg and K. Zhang. Validating and securing spontaneous associations between wireless devices. In Information Security Conference (ISC), pages 44--53, 2003.",
      "doi": ""
    },
    {
      "text": "A. Kobsa, R. Sonawalla, G. Tsudik, E. Uzun, and Y. Wang. Serial hook-ups: A comparative usability study of secure device pairing methods. In SOUPS: Symposium on Usable Privacy and Security, 2009.  ",
      "doi": "10.1145/1572532.1572546"
    },
    {
      "text": "K. Kostiainen and E. Uzun. Framework for comparative usability testing of distributed applications. In Security User Studies: Methodologies and Best Practices Workshop, 2007.",
      "doi": ""
    },
    {
      "text": "A. Kumar et al. Caveat emptor: A comparative study of secure device pairing methods. In IEEE Pervasive Computing and Communications (PerCom), 2009.  ",
      "doi": "10.1109/PERCOM.2009.4912753"
    },
    {
      "text": "S. Laur and K. Nyberg. Efficient mutual data authentication using manually authenticated strings. Conference on Cryptology and Network Security (CANS), 2006.  ",
      "doi": "10.1007/11935070_6"
    },
    {
      "text": "R. Likert. A technique for the measurement of attitudes. Archives of Psychology, 66:68--71, 1932.",
      "doi": ""
    },
    {
      "text": "Y. Liu, A. Rahmati, Y. Huang, H. Jang, L. Zhong, Y. Zhang, and S. Zhang. xshare: supporting impromptu sharing of mobile phones. In MobiSys '09: Conference on Mobile systems, applications, and services, 2009.  ",
      "doi": "10.1145/1555816.1555819"
    },
    {
      "text": "R. Mayrhofer and H. Gellersen. Shake well before use: Authentication based on accelerometer data. Conference on Pervasive Computing (Pervasive), 2007. ",
      "doi": "10.5555/1758156.1758168"
    },
    {
      "text": "R. Mayrhofer and M. Welch. A human-verifiable authentication protocol using visible laser light. In IEEE Conference on Availability, Reliability and Security, 2007.  ",
      "doi": "10.1109/ARES.2007.5"
    },
    {
      "text": "J. M. McCune, A. Perrig, and M. K. Reiter. Seeing-is-believing: Using camera phones for human-verifiable authentication. In IEEE Symposium on Security and Privacy, 2005.  ",
      "doi": "10.1109/SP.2005.19"
    },
    {
      "text": "R. Nithyanand et al. Groupthink: usability of secure group association for wireless devices. In Ubicomp, pages 331--340, 2010.  ",
      "doi": "10.1145/1864349.1864399"
    },
    {
      "text": "S. Pasini and S. Vaudenay. Sas-based authenticated key agreement. In International Conference on Theory and Practice of Public-Key Cryptography (PKC), 2006.  ",
      "doi": "10.1007/11745853_26"
    },
    {
      "text": "A. Perrig and D. Song. Hash visualization: a new technique to improve real-world security. In International Workshop on Cryptographic Techniques and E-Commerce, 1999.",
      "doi": ""
    },
    {
      "text": "R. Prasad and N. Saxena. Efficient device pairing using \"human-comparable\" synchronized audiovisual patterns. In Applied Cryptography and Network Security (ACNS), 2008. ",
      "doi": "10.5555/1788857.1788877"
    },
    {
      "text": "V. Roth et al. Simple and effective defense against evil twin access points. In ACM Conference on Wireless Network Security (WiSec), pages 220--235, 2008.  ",
      "doi": "10.1145/1352533.1352569"
    },
    {
      "text": "N. Saxena et al. Extended abstract: Secure device pairing based on a visual channel. In IEEE Symposium on Security and Privacy, 2006.  ",
      "doi": "10.1109/SP.2006.35"
    },
    {
      "text": "C. Soriente, G. Tsudik, and E. Uzun. Beda: Button-enabled device association. In International Workshop on Security and Privacy in Spontaneous Interaction (IWSSI), 2007.",
      "doi": ""
    },
    {
      "text": "C. Soriente, G. Tsudik, and E. Uzun. Hapadep: Human-assisted pure audio device pairing. In Information Security Conference (ISC), pages 385--400, 2008.  ",
      "doi": "10.1007/978-3-540-85886-7_27"
    },
    {
      "text": "F. Stajano and R. J. Anderson. The resurrecting duckling: Security issues for ad-hoc wireless networks. In Security Protocols Workshop, 1999. ",
      "doi": "10.5555/647217.760118"
    },
    {
      "text": "E. Uzun, K. Karvonen, and N. Asokan. Usability analysis of secure pairing methods. In Financial Cryptography and Data Security, pages 307--324. ",
      "doi": "10.5555/1785594.1785635"
    },
    {
      "text": "S. Vaudenay. Secure communications over insecure channels based on short authenticated strings. In International Cryptology Conference (CRYPTO), 2005.  ",
      "doi": "10.1007/11535218_19"
    }
  ]
}