{
  "doi": "10.1145/1978942.1979011",
  "title": "Usability of car dashboard displays for elder drivers",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "493-502",
  "year": 2011,
  "badges": [],
  "abstract": "The elder population is rising worldwide; in the US, no longer being able to drive is a significant marker of loss of independence. One of the approaches to helping elders drive more safely is to investigate the use of automotive user interface technology, and specifically, to explore the instrument panel (IP) display design to help attract and manage attention and make information easier to interpret. In this paper, we explore the premise that dashboard displays can be better designed to support elder drivers, their information needs, and their cognitive capabilities. We conducted a study to understand which display design features are critically linked to issues of divided attention and driving performance. We found that contrast of size and reduced clutter are instrumental in enhancing driving performance, particularly for the elder population. Surprisingly, our results showed that color elements have a negative effect on driving performance for elders, while color elements and fills slightly improve performance. We conclude with design implications generated from this work.",
  "authors": [
    {
      "name": "SeungJun Kim",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81452593686/rel-imgonly/sjk_profile.jpg",
      "acmid": "81452593686",
      "orcid": "missing"
    },
    {
      "name": "Anind K. Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Joonhwan Lee",
      "institution": "Neowiz Lab, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502746040",
      "orcid": "0000-0002-3115-4024"
    },
    {
      "name": "Jodi Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baldassi, S., &amp;#38; Burr, D. C. \"Pop-out\" of targets modulated in luminance or colour: the eVect of intrinsic and extrinsic uncertainty. Vision Research, 44 (2004), 1227--1233.",
      "doi": ""
    },
    {
      "text": "Baldwin, C. L. Designing in-vehicle technologies for older drivers: Application of sensory-cognitive interaction theory. Theoretical Issues In Ergonomic Science, 3(4) (2002), 307--329.",
      "doi": ""
    },
    {
      "text": "Ball, K. and Owsley, C. Increasing mobility and reducing accidents of older drivers, in K. W. Schaie and M. Pietrucha (eds), Mobility and Transportation in the Elderly (New York: Springer) (2000), 213--250.",
      "doi": ""
    },
    {
      "text": "Ball, K., Owsley, C., Stalvey, B., Roenker, D. L., Sloane, M. E., &amp;#38; Graves, M. Driving avoidance and functional impairment in older drivers. Accident Analysis and Prevention, 30(3) (1998), 313--322.",
      "doi": ""
    },
    {
      "text": "Beck, J. Textural segmentation. In: Organization and Representation in Perception, Beck J, ed. Hillsdale, NJ: Erlbaum (1982), 285--317.",
      "doi": ""
    },
    {
      "text": "Booher, H. R. Relative comprehensibility of pictorial information and printed words in proceduralized instructions. Human Factors, 17 (1975), 266--277.",
      "doi": ""
    },
    {
      "text": "Campbell, J. L., Richman, J. B., Carney, C. and Lee, J. D. In-vehicle display icons and other information elements: Volume I: Guidelines, Federal Highway Administration, 2004.",
      "doi": ""
    },
    {
      "text": "Carney, C., Campbell, J. L. and Mitchell, E. A. In-vehicle display icons and other information elements: Literature review, Federal Highway Administration, 1998.",
      "doi": ""
    },
    {
      "text": "Christ, R. E. Research for evaluating visual display codes: An emphasis on colour coding. In Easterby, R. and Zwaga, H. eds. Information design: The design and evaluation of signs and printed materials, John Wiley &amp;#38; Sons (1984), 209--228.",
      "doi": ""
    },
    {
      "text": "Collia, D., Sharp, J. and Giesbrecht, L. The 2001 national household travel survey: A look into the travel patterns of older Americans. Journal of Safety Research 34 (2003), 461--470.",
      "doi": ""
    },
    {
      "text": "Connor, C. E., Egeth, H. E. and Yantis, S. Visual attention: Bottom-up vs. top-down. Current Biology, 14 (2004), 850--852.",
      "doi": ""
    },
    {
      "text": "Dingus, T. A., Hulse, M. C., Mollenhauer, M. A., Fleischman, R. N., Mcgehee, D. V. and Manakkal, N. Effects of age, system experience, and navigation technique on driving with and Advanced Traveler Information System, Human Factors, 39 (1997), 177--199.",
      "doi": ""
    },
    {
      "text": "Green, P. Visual and Task Demands of Driver Information Systems. The University of Michigan Transportation Research Institute, Technical Report UMTRI-98-16. Ann Arbor, MI, 1998.",
      "doi": ""
    },
    {
      "text": "Hakamies-Blomqvist, L., Siren, A. and Davidse, R. Older drivers - a review. VTI rapport 497A, Swedish National Road and Transport Research Institute, 2004.",
      "doi": ""
    },
    {
      "text": "Ito, T. and Miki, Y. Japan's Safety Guideline on In-Vehicle Display Systems in Proceedings of the Fourth ITS World Congress. VERTIS, 1997.",
      "doi": ""
    },
    {
      "text": "Julesz, B. A brief outline of the textion theory of human vision. Trends in Neuroscience (1984), 41--45.",
      "doi": ""
    },
    {
      "text": "Kim, S. and Dey, A. K. Simulated augmented reality windshield display as a cognitive mapping aid for elder driver navigation. In Proc. CHI 2009, 133--142.  ",
      "doi": "10.1145/1518701.1518724"
    },
    {
      "text": "Kumar, M. and Kim, T. Dynamic speedometer: dashboard redesign to discourage drivers from speeding. Ext. Abstracts CHI 2005, 1573--1576.  ",
      "doi": "10.1145/1056808.1056969"
    },
    {
      "text": "Lee, J., Forlizzi, J., and Hudson, S. E. Studying the effectiveness of MOVE: a contextually optimized in-vehicle navigation system. In Proc. CHI 2005, 571--580.  ",
      "doi": "10.1145/1054972.1055051"
    },
    {
      "text": "Mayer, D. and Laux, L. Evaluating Vehicle Displays for Older Drivers. AAA Foundation for Traffic Safety, 1992.",
      "doi": ""
    },
    {
      "text": "McDougall, S., de Bruijn, O. and Curry, M. Exploring the effects of icon characteristics: Concreteness, complexity and distinctiveness. The J. of Experimental Psychology: Applied, 6(4) (2000), 291--306.",
      "doi": ""
    },
    {
      "text": "McGehee, D. V. New design guidelines aim to reduce driver distraction. Human Factors and Ergonomics Society Bulletin, Vol. 44, No. 10, (2001), 1--3.",
      "doi": ""
    },
    {
      "text": "Monash University Accident Research Centre. (2006). The Elderly and Mobility: A Review of the Literature. Sponsored by Swedish Road Administration (SRA), Report No. 255.",
      "doi": ""
    },
    {
      "text": "Rockwell, T. H. Spare Visual Capacity in Driving - Revisited: New Empirical Results of an Old Idea in Vision in Vehicles II. Amsterdam: Elsevier Science B.V. (North-Holland) (1988), 317--314.",
      "doi": ""
    },
    {
      "text": "Salthouse, T. A., Hancock, H. E., Meinz, E. J. and Hambrick, D. Z. Interrelations of age, visual acuity, and cognitive functioning. J Gerontol Psychol Sci; 51B (1996), 317--330.",
      "doi": ""
    },
    {
      "text": "Somervell, J., McCrickard, D. S., North, C. and Shukla, M. An evaluation of information visualization in attention-limited environments. In Proc. VISSYM 2002. ",
      "doi": "10.5555/509740.509775"
    },
    {
      "text": "Suen, S. L. &amp;#38; Sen, L. Mobility Options for Seniors. In Transportation in an Aging Society: A Decade of Experience. Transportation Research Board (2004), 97--113.",
      "doi": ""
    },
    {
      "text": "Treisman, A. M. and Sato, S. Conjunction search revisited. Journal of Experimental Psychology: Human Perception and Performance, 16 (1990), 451--478.",
      "doi": ""
    },
    {
      "text": "Treisman, A. Selection for perception for selection for action: A reply to Van der Heijden. Visual Cognition, 3 (1996), 353--357.",
      "doi": ""
    },
    {
      "text": "Treisman, A. Feature binding, attention and object perception. Philosophical Transactions of the Royal Society, Series B, 353 (1998), 1295--1306.",
      "doi": ""
    },
    {
      "text": "Tufte, E. Envisioning Information. Cheshire, CT: Graphics Press, 1990. ",
      "doi": "10.5555/78223"
    },
    {
      "text": "University of Michigan Transportation Research Institute. The assessment of older drivers capabilities: A review of the literature. Interim report for the GM/US DOT project entitled: Improvement of Older Driver Safety through Self-Evaluation, Report No. UMTRI-98-24, 1998.",
      "doi": ""
    },
    {
      "text": "VICS Promotion Council, VICS Promotion Council Safety Committee Report on Information Display. (Chapter 2 \"Safety\" Group). Tokyo, Japan: VICS Promotion Council, 1993.",
      "doi": ""
    },
    {
      "text": "Wierwille, W. W., Antin, J. F., Dingus, T. A., and Hulse, M. C. Visual Attentional Demand of an In-Car Navigation Display System in Vision in Vehicles II. Amsterdam: Elsevier Science B.V. (North-Holland) (1988), 307--316.",
      "doi": ""
    },
    {
      "text": "Wierwille, W. W. Visual and manual demands of in-car controls and displays. In B. Peacock and W. Karwowski (Eds.), Automotive Ergonomics. Taylor &amp;#38; Francis: Washington, D.C. (1993), 299--320.",
      "doi": ""
    },
    {
      "text": "Zwaga, H. and Easterby, R. S. Developing effective symbols for public information. In Easterby, R. &amp;#38; Zwaga, H. (eds.). Information design: The design and evaluation of signs and printed material, J. Wiley &amp;#38; Sons (1984), 277--297.",
      "doi": ""
    }
  ]
}