{
  "doi": "10.1145/1978942.1979009",
  "title": "Fast or safe?: how performance objectives determine modality output choices while interacting on the move",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "473-482",
  "year": 2011,
  "badges": [],
  "abstract": "In-car devices that use audio output have been shown to be less distracting than traditional graphical user interfaces, but can be cumbersome and slow to use. In this paper, we report an experiment that demonstrates how these performance characteristics impact whether people will elect to use an audio interface in a multitasking situation. While steering a simulated vehicle, participants had to locate a source of information in a short passage of text. The text was presented either on a visual interface, or using a text-to-speech audio interface. The relative importance of each task was varied. A no-choice/choice paradigm was used in which participants first gained experience with each of the two interfaces, before being given a choice on which interface to use on later trials. The characteristics of the interaction with the interfaces, as measured in the no-choice phase, and the relative importance of each task, had an impact on which output modality was chosen in the choice phase. Participants that prioritized the secondary task tended to select the (faster yet more distracting) visual interface over the audio interface, and as a result had poorer lane keeping performance. This work demonstrates how a user's task objective will influence modality choices with multimodal devices in multitask environments.",
  "tags": [
    "performance trade-offs.",
    "audio interface",
    "driving",
    "strategy selection",
    "multitasking",
    "visual interface"
  ],
  "authors": [
    {
      "name": "Duncan P. Brumby",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81328487836/rel-imgonly/brumby.jpg",
      "acmid": "81328487836",
      "orcid": "missing"
    },
    {
      "name": "Samantha C.E. Davies",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660397764",
      "orcid": "missing"
    },
    {
      "name": "Christian P. Janssen",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100599716/rel-imgonly/logo_site2.jpg",
      "acmid": "81100599716",
      "orcid": "missing"
    },
    {
      "name": "Justin J. Grace",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645849",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brookhuis, K., De Vries, G., & De Waard, D. The effects of mobile telephoning on driving performance. Accident Analysis & Prevention, 23, (1991), 309--316.",
      "doi": ""
    },
    {
      "text": "Brumby, D.P., Salvucci, D.D., & Howes, A. Focus on driving: How cognitive constraints shape the adaptation of strategy when dialing while driving. In Proc. CHI 2009, ACM Press (2009), 1629--1638.  ",
      "doi": "10.1145/1518701.1518950"
    },
    {
      "text": "Brumby, D.P., Del Rosario, N., & Janssen, C.P. When to switch? Understanding how performance trade-offs shape dual-task strategy. In Proc. ICCM 2010, Drexel University (2010), 19--24.",
      "doi": ""
    },
    {
      "text": "Cnossen, F., Meijman, T., & Rothengatter, T. Adaptive strategy changes as a function of task demands: A study of car drivers. Ergonomics, 47, (2004), 218--236.",
      "doi": ""
    },
    {
      "text": "Crowd Science. Social media insights -- twitter. http://www.crowdscience.com/blog/article/social_media_study_twitter_while_driving/, September 4th 2009.",
      "doi": ""
    },
    {
      "text": "Diels, C., Reed, N., and Weaver, L., Drivers' attitudes to distraction and other motorists' behaviour: A focus group and observational study. TRL Limited, Wokingham, UK, 2009.",
      "doi": ""
    },
    {
      "text": "Duggan, G.B. & Payne, S.J. Text skimming: The process and effectiveness of foraging through text under time pressure. Journal of Experimental Psychology: Applied, 15, (2009), 228--242.",
      "doi": ""
    },
    {
      "text": "Gray, W.D. & Boehm-Davis, D.A. Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology: Applied, 6, (2000), 322--335.",
      "doi": ""
    },
    {
      "text": "Hart, S.G. & Staveland, L.E. Development of nasa-tlx (task load index): Results of empirical and theoretical research. Human Mental Workload, 1, (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Hoggan, E., Crossan, A., Brewster, S., & Kaaresoja, T. Audio or tactile feedback: Which modality when? In Proc. CHI 2009, ACM Press (2009), 2253--2256.  ",
      "doi": "10.1145/1518701.1519045"
    },
    {
      "text": "1Horrey, W. & Wickens, C.D. Examining the impact of cell phone conversations on driving using meta-analytic techniques. Human Factors, 48, (2006), 196--205.",
      "doi": ""
    },
    {
      "text": "Horrey, W.J. & Wickens, C.D. Driving and side task performance: The effects of display clutter, separation, and modality. Human Factors, 46, (2004), 611--624.",
      "doi": ""
    },
    {
      "text": "Horrey, W.J. & Lesch, M.F. Driver-initiated distractions: Examining strategic adaptation for in-vehicle task initiation. Accident Analysis and Prevention, 41, (2009), 115--122.",
      "doi": ""
    },
    {
      "text": "Horrey, W.J., Wickens, C.D., & Consalus, K.P. Modeling drivers' visual attention allocation while interacting with in-vehicle technologies. Journal of Experimental Psychology: Applied, 12, (2006), 67--78.",
      "doi": ""
    },
    {
      "text": "Howes, A., Duggan, G.B., Kalidindi, K., Tseng, Y.-C., & Lewis, R.L. Bounded optimality in a cognitive utility learning paradigm. (under review).",
      "doi": ""
    },
    {
      "text": "Iqbal, S.T., Ju, Y.-C., & Horvitz, E. Cars, calls, and cognition: Investigating driving and divided attention. In Proc. CHI 2010, ACM Press. (2010), 1281--1290.  ",
      "doi": "10.1145/1753326.1753518"
    },
    {
      "text": "Janssen, C.P. & Brumby, D.P. Strategic adaptation to performance objectives in a dual-task setting. Cognitive Science, 34, (2010), 1548--1560.",
      "doi": ""
    },
    {
      "text": "Janssen, C.P., Brumby, D.P., Dowell, J., Chater, N., & Howes, A. Identifying optimum performance trade-offs using a cognitively bounded rational analysis model of discretionary task interleaving. Topics in Cognitive Science, 3, (2011), 123--139.",
      "doi": ""
    },
    {
      "text": "Lai, J., Cheng, K., Green, P., & Tsimhoni, O. On the road and on the web?: Comprehension of synthetic and human speech while driving. In Proc. CHI 2001, ACM Press (2001), 206--212.  ",
      "doi": "10.1145/365024.365100"
    },
    {
      "text": "Lee, J.D., Caven, B., Haake, S., & Brown, T.L. Speech-based interaction with in-vehicle computers: The effect of speech-based e-mail on drivers' attention to the roadway. Human Factors, 43, (2001), 631--640.",
      "doi": ""
    },
    {
      "text": "2Li, K.A., Baudisch, P., & Hinckley, K. Blindsight: Eyes-free access to mobile phones. In Proc. CHI 2008, ACM Press (2008), 1389--1398.  ",
      "doi": "10.1145/1357054.1357273"
    },
    {
      "text": "2Liu, Y. Comparative study of the effects of auditory, visual and multimodality displays on drivers' performance in advanced traveller information systems. Ergonomics, 44, (2001), 425--442.",
      "doi": ""
    },
    {
      "text": "MacLean, A., Barnard, P., & Wilson, M. Evaluating the human interface of a data entry system: User choice and performance measures yield different trade-off functions. In P. Johnson & S. Cook (Eds.), People and Computers: Designing the Interface. Cambridge University Press, 1985, 172--185.",
      "doi": ""
    },
    {
      "text": "Reed, M. & Green, P. Comparison of driving performance on-road and in a low-cost simulator using a concurrent telephone dialling task. Ergonomics, 42, (1999), 1015--1037.",
      "doi": ""
    },
    {
      "text": "Salvucci, D.D. Predicting the effects of in-car interface use on driver performance: An integrated model approach. International Journal of Human Computer Studies, 55, (2001), 85--107.",
      "doi": "10.1006/ijhc.2001.0472"
    },
    {
      "text": "Salvucci, D.D. & Beltowska, J. Effects of memory rehearsal on driver performance: Experiment and theoretical account. Human Factors, 50, (2008), 834--44.",
      "doi": ""
    },
    {
      "text": "Salvucci, D.D. & Taatgen, N.A. Threaded cognition: An integrated theory of concurrent multitasking. Psychological Review, 115, (2008), 101--130.",
      "doi": ""
    },
    {
      "text": "Siegler, R.S. & Lemaire, P. Older and younger adults' strategy choices in multiplication: Testing predictions of ascm using the choice/no-choice method. Journal of Experimental Psychology: General, 126, (1997), 71--92.",
      "doi": ""
    },
    {
      "text": "Sodnik, J., Dicke, C., Tomazic, S., & Billinghurst, M. A user study of auditory versus visual interfaces for use while driving. International Journal of Human-Computer Studies, 66, (2008), 318--332.  ",
      "doi": "10.1016/j.ijhcs.2007.11.001"
    },
    {
      "text": "Tucker, S. & Whittaker, S. Time is of the essence: An evaluation of temporal compression algorithms. In Proc. CHI 2006, ACM Press (2006), 329--338.  ",
      "doi": "10.1145/1124772.1124822"
    },
    {
      "text": "3Wallis, G., Chatziastros, A., & Bülthoff, H. An unexpected role for visual feedback in vehicle steering control. Current Biology, 12, (2002), 295--299.",
      "doi": ""
    },
    {
      "text": "3Walsh, M.M. & Anderson, J.R. The strategic nature of changing your mind. Cognitive Psychology, 58, (2009), 416--40.",
      "doi": ""
    },
    {
      "text": "3Wickens, C.D. Multiple resources and performance prediction. Theoretical Issues in Ergonomics Science, 3, (2002), 159--177.",
      "doi": ""
    },
    {
      "text": "Zhao, S., Earpod: Efficient hierarchical eyes-free menu selection. Doctoral dissertation, Department of Computer Science, University of Toronto, 2009. ",
      "doi": "10.5555/1925509"
    },
    {
      "text": "Zhao, S., Dragicevic, P., Chignell, M., Balakrishnan, R., & Baudisch, P. Earpod: Eyes-free menu selection using touch input and reactive audio feedback. In Proc. CHI 2007, ACM Press (2007), 1395--1404..  ",
      "doi": "10.1145/1240624.1240836"
    }
  ]
}