{
  "doi": "10.1145/1978942.1979425",
  "title": "A haptic wristwatch for eyes-free interactions",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3257-3266",
  "year": 2011,
  "badges": [],
  "abstract": "We present a haptic wristwatch prototype that makes it possible to acquire information from a companion mobile device through simple eyes-free gestures. The wristwatch we have built uses a custom-made piezoelectric actuator combined with sensors to create a natural, inconspicuous, gesture-based interface. Feedback is returned to the user in the form of haptic stimuli that are delivered to the wrist. We evaluated the capabilities and limitations of our prototype through two user experiments. One experiment verified that the apparatus could be used as a tactile notification mechanism. The other experiment assessed the feasibility of using a cover-and-hold gesture on the wristwatch to obtain numerical data tactually. Results from the numerosity experiment and feedback from participants prompted us to redesign the cover-and-hold gesture to provide users with additional control over the interaction. We qualitatively evaluated the redesigned interaction by handing the prototype to users so that they could use it in a realistic work environment. Taken together, results from the experiments and the validation process indicate that a wrist accessory can be effectively used to perform discreet, closed-loop, eyes-free interactions with a mobile device.",
  "authors": [
    {
      "name": "Jerome Pasquero",
      "institution": "Research In Motion Limited, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100040803",
      "orcid": "missing"
    },
    {
      "name": "Scott J. Stobbe",
      "institution": "Research In Motion Limited, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655863",
      "orcid": "missing"
    },
    {
      "name": "Noel Stonehouse",
      "institution": "Research In Motion Limited, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657502",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashbrook, D., Lyons, K., and Starner, T. An investigation into round touchscreen wristwatch interaction. In Proc. of MobileHCI '08, ACM Press, 311--314, 2008.  ",
      "doi": "10.1145/1409240.1409276"
    },
    {
      "text": "Baumann, M. A., MacLean, K. E., Hazelton, T. W., McKay A. Emulating Human Attention-Getting Practices with Wearable Haptics. In Proc. of IEEE Haptic Symposium 2001, 149--156, 2010.  ",
      "doi": "10.1109/HAPTIC.2010.5444662"
    },
    {
      "text": "Blask&amp;#243;, G., and Feiner, S. An Interaction System for Watch Computers Using Tactile Guidance and Bidirectional Segmented Strokes. In Proc. of ISWC'04, 120--123, 2004.  ",
      "doi": "10.1109/ISWC.2004.6"
    },
    {
      "text": "Blask&amp;#243;, G., and Feiner. S. Single-Handed Interaction Techniques for Multiple Pressure-Sensitive Strips. In Ext. Abstracts CHI '04, 1461--1464, 2004.  ",
      "doi": "10.1145/985921.986090"
    },
    {
      "text": "Brown, L. M. and Williamson, J. Shake-to-talk: Multimodal Messaging for Interpersonal Communication. In Proc of HAID '07, Springer LNCS, 44--55, 2007. ",
      "doi": "10.5555/1775512.1775521"
    },
    {
      "text": "Chen, H., Santos, J., Graves, M., Kim, K., and Tan, H. Z. Tactor Localization at the Wrist. In Proc. of the 6th International Conference on Haptics: Perception, Devices and Scenarios, M. Ferre, Ed. LNCS, vol. 5024. Springer-Verlag, Berlin, 209--228, 2008.  ",
      "doi": "10.1007/978-3-540-69057-3_25"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. Skinput: Appropriating the Body as an Input Surface. In Proc. of CHI '10, 453--462. 2010.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Hoggan, E. and Brewster, S. New Parameters for Tacton Design. In Ext. Abstracts CHI '07, 2417--2422, 2007.  ",
      "doi": "10.1145/1240866.1241017"
    },
    {
      "text": "Jones, L. A., and Lederman, S. J. Human Hand Function, Oxford University Press, USA, 2006.",
      "doi": ""
    },
    {
      "text": "Kaaresoja, T. and Linjama, J. Perception of Short Tactile Pulses Generated by a Vibration Motor in a Mobile Phone. In Proc. of WHC '05. IEEE CS, 471--472, 2005.  ",
      "doi": "10.1109/WHC.2005.103"
    },
    {
      "text": "Kajastila, R. A. and Lokki, T., A gesture-based and eyes-free control method for mobile devices. In Ext. Abstracts CHI '09, 3559--3564, 2009.  ",
      "doi": "10.1145/1520340.1520534"
    },
    {
      "text": "Kim, J., He, J., Lyons, K., and Starner, T. The Gesture Watch: A Wireless Contact-Free Gesture Based Wrist Interface. In Proc. of ISWC '07, IEEE CS, 15--22, 2007.  ",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "Kratz, S. and Rohs, M. Hoverflow: Exploring around - Device Interaction with IR Distance Sensors. In Proc. of MobileHCI '09, 1--4, 2009.  ",
      "doi": "10.1145/1613858.1613912"
    },
    {
      "text": "Lechelt, E. C. Temporal numerosity discrimination: intermodal comparisons revisited. British Journal of Psychology 1975 Feb;66(1):101--108, 1975.",
      "doi": ""
    },
    {
      "text": "Lee, S. C. and Starner, T., Mobile Gesture Interaction using Wearable Tactile Displays. In Ext. Abstracts CHI '09, 3437--3442, 2009.  ",
      "doi": "10.1145/1520340.1520499"
    },
    {
      "text": "MacLean, K. E., Putting Haptics into the Ambience. IEEE Trans. Haptics, July-Sept. 2(3), 123--135, 2009.  ",
      "doi": "10.1109/TOH.2009.33"
    },
    {
      "text": "Martin, T. L., Time and Time Again: Parallels in the Development of the Watch and the Wearable Computer, In Proc. of ISWC '02, 5--11, 2002. ",
      "doi": "10.5555/862896.881071"
    },
    {
      "text": "Matscheko, M., Ferscha, A., Riener, A., Lehner, M. Tactor Placement in Wrist Worn Wearables, In Proc of ISWC '10, Society Press, 8--15, 2010.",
      "doi": ""
    },
    {
      "text": "Murray-Smith, R., Williamson, J., Hughes, S., and Quaade, T. 2008. Stane: synthesized surfaces for tactile input. In Proc. of CHI '08, 299--302, 2008.  ",
      "doi": "10.1145/1357054.1357257"
    },
    {
      "text": "Ni, T. and Baudisch, P., Disappearing Mobile Devices. In Proc of UIST '09, 101--110, 2009.  ",
      "doi": "10.1145/1622176.1622197"
    },
    {
      "text": "Philippi, T. G., van Erp, J. B., Werkhoven, P. J. Multisensory Temporal Numerosity Judgment. Brain Res. Epub, 1242:116--125, 2008.",
      "doi": ""
    },
    {
      "text": "Ramos, G., Boulos, M., and Balakrishnan, R. Pressure Widgets. In Proc. of CHI '04, 487--494, 2004.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Sherrick, C. E. A scale for rate of tactual vibration. Journal Acoust. Soc. Am., 78 (1), 78--83, 1985.",
      "doi": ""
    },
    {
      "text": "Snibbe, S. S., MacLean, K. E., Shaw, R., Roderick, J., Verplank, W. L., and Scheeff, M. Haptic Techniques for Media Control. In Proc. of UIST '01, 199--208, 2001.  ",
      "doi": "10.1145/502348.502387"
    },
    {
      "text": "Toney, A., Dunne, L., Thomas, B. H., and Ashdown, S. P. A Shoulder Pad Insert Vibrotactile Display. In Proc. ISWC '03, IEEE Computer Society, 35--44, 2003. ",
      "doi": "10.5555/946249.946871"
    },
    {
      "text": "Toney A., Mulley, B., Thomas, B. H., Piekarski, W. Social weight: designing to minimize the social consequences arising from technology use by the mobile professional, Pers Ubiquit Comput, 7: 309--320, 2003.  ",
      "doi": "10.1007/s00779-003-0245-8"
    },
    {
      "text": "Williamson, J., Murray-Smith, R., and Hughes, S. Shoogle: Excitatory Multimodal Interaction on Mobile Devices. In Proc. of CHI '07, 12--24, 2007.  ",
      "doi": "10.1145/1240624.1240642"
    },
    {
      "text": "Wobbrock, J. O. TapSongs: tapping rhythm-based passwords on a single binary sensor. In Proc. of UIST '09, 93--96, 2009.  ",
      "doi": "10.1145/1622176.1622194"
    },
    {
      "text": "Zhao, S., Dragicevic, P., Chignell, M., Balakrishnan, R., and Baudisch, P. Earpod: eyes-free menu selection using touch input and reactive audio feedback. In Proc. of CHI '07, 395--404, 2007.  ",
      "doi": "10.1145/1240624.1240836"
    }
  ]
}