{
  "doi": "10.1145/1978942.1979219",
  "title": "How users associate wireless devices",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1909-1918",
  "year": 2011,
  "badges": [],
  "abstract": "In a wireless world, users can establish connections between devices spontaneously, and unhampered by cables. However, in the absence of cables, what is the natural interaction to connect one device with another? A wide range of device association techniques have been demonstrated, but it has remained an open question what actions users would spontaneously choose for device association. We contribute a study eliciting device association actions from non-technical users without premeditation. Over 700 user-defined actions were collected for 37 different device combinations. We present a classification of user-defined actions, and observations of the users' rationale. Our findings indicate that there is no single most spontaneous action; instead five prominent categories of user-defined actions were found.",
  "authors": [
    {
      "name": "Ming Ki Chong",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442599627",
      "orcid": "missing"
    },
    {
      "name": "Hans Gellersen",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616827",
      "orcid": "0000-0003-2233-2121"
    }
  ],
  "references": [
    {
      "text": "D. Balfanz, D. K. Smetters, P. Stewart, and H. C. Wong. Talking to strangers: Authentication in ad-hoc wireless networks. In Proc. NDSS 2002, 2002.",
      "doi": ""
    },
    {
      "text": "I. Buhan, B. Boom, J. Doumen, P. H. Hartel, and R. N. J. Veldhuis. Secure pairing with biometrics. Int. J. of Security and Networks, 4(1/2):27--42, 2009.  ",
      "doi": "10.1504/IJSN.2009.023424"
    },
    {
      "text": "M. K. Chong and H. Gellersen. Classification of spontaneous device association from a usability perspective. In Proc. IWSSI/SPMU 2010, pages 1--7, 2010.",
      "doi": ""
    },
    {
      "text": "M. K. Chong, G. Marsden, and H. Gellersen. GesturePIN: using discrete gestures for associating mobile devices. In Proc. MobileHCI 2010, pages 261--264. ACM Press, 2010.  ",
      "doi": "10.1145/1851600.1851644"
    },
    {
      "text": "M. Frisch, J. Heydekorn, and R. Dachselt. Investigating multi-touch and pen gestures for diagram editing on interactive surfaces. In Proc. ITS 2009, pages 149--156. ACM Press, 2009.  ",
      "doi": "10.1145/1731903.1731933"
    },
    {
      "text": "K. Hinckley. Synchronous gestures for multiple persons and computers. In Proc. UIST 2003, pages 149--158. ACM Press, 2003.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "K. Hinckley, G. Ramos, F. Guimbretiere, P. Baudisch, and M. Smith. Stitching: pen gestures that span multiple displays. In Proc. AVI 2004, pages 23--31. ACM Press, 2004.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "L. E. Holmquist, F. Mattern, B. Schiele, P. Alahuhta, M. Beigl, and H.-W. Gellersen. Smart-Its Friends: A technique for users to easily establish connections between smart artefacts. In Proc. UbiComp 2001, pages 116--122. Springer-Verlag, 2001. ",
      "doi": "10.5555/647987.741340"
    },
    {
      "text": "I. Ion, M. Langheinrich, P. Kumaraguru, and S. Capkun. Influence of user perception, security needs, and social factors on device pairing method choices. In Proc. SOUPS 2010. ACM Press, 2010.  ",
      "doi": "10.1145/1837110.1837118"
    },
    {
      "text": "R. Kainda, I. Flechais, and A. W. Roscoe. Usability and security of out-of-band channels in secure device pairing protocols. In Proc. SOUPS 2009. ACM Press, 2009.  ",
      "doi": "10.1145/1572532.1572547"
    },
    {
      "text": "R. Kainda, I. Flechais, and A. W. Roscoe. Two heads are better than one: security and usability of device associations in group scenarios. In Proc. SOUPS 2010. ACM Press, 2010.  ",
      "doi": "10.1145/1837110.1837117"
    },
    {
      "text": "T. Kindberg and K. Zhang. Validating and securing spontaneous associations between wireless devices. In Proc. ISC 2003, pages 44--53, 2003.",
      "doi": ""
    },
    {
      "text": "A. Kobsa, R. Sonawalla, G. Tsudik, E. Uzun, and Y. Wang. Serial hook-ups: a comparative usability study of secure device pairing methods. In Proc. SOUPS 2009. ACM Press, 2009.  ",
      "doi": "10.1145/1572532.1572546"
    },
    {
      "text": "C. Kray, D. Nesbitt, J. Dawson, and M. Rohs. User-defined gestures for connecting mobile phones, public displays, and tabletops. In Proc. MobileHCI 2010, pages 239--248. ACM Press, 2010.  ",
      "doi": "10.1145/1851600.1851640"
    },
    {
      "text": "S.-S. Lee, S. Kim, B. Jin, E. Choi, B. Kim, X. Jia, D. Kim, and K.-P. Lee. How users manipulate deformable displays as input devices. In Proc. CHI 2010, pages 1647--1656. ACM Press, 2010.  ",
      "doi": "10.1145/1753326.1753572"
    },
    {
      "text": "R. Mayrhofer and H. Gellersen. Shake well before use: Intuitive and secure pairing of mobile devices. IEEE T. Mobile Comput., 8(6):792--806, 2009.  ",
      "doi": "10.1109/TMC.2009.51"
    },
    {
      "text": "R. Mayrhofer and M. Welch. A human-verifiable authentication protocol using visible laser light. In Proc. ARES 2007, pages 1143--1148. IEEE Computer Society, 2007.  ",
      "doi": "10.1109/ARES.2007.5"
    },
    {
      "text": "J. M. McCune, A. Perrig, and M. K. Reiter. Seeing-Is-Believing: Using camera phones for human-verifiable authentication. In Proc. Symp. on Security and Privacy 2005, pages 110--124. IEEE Computer Society, 2005.  ",
      "doi": "10.1109/SP.2005.19"
    },
    {
      "text": "M. Micire, M. Desai, A. Courtemanche, K. M. Tsui, and H. A. Yanco. Analysis of natural gestures for controlling robot teams on multi-touch tabletop surfaces. In Proc. ITS 2009, pages 41--48, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1731903.1731912"
    },
    {
      "text": "D. G. Park, J. K. Kim, J. B. Sung, J. H. Hwang, C. H. Hyung, and S. W. Kang. TAP: Touch-And-Play. In Proc. CHI 2006, pages 677--680. ACM Press, 2006.  ",
      "doi": "10.1145/1124772.1124873"
    },
    {
      "text": "S. N. Patel, J. S. Pierce, and G. D. Abowd. A gesture-based authentication scheme for untrusted public terminals. In Proc. UIST 2004, pages 157--160. ACM Press, 2004.  ",
      "doi": "10.1145/1029632.1029658"
    },
    {
      "text": "J. Rekimoto. SyncTap: synchronous user operation for spontaneous network connection. Pers. Ubiquit. Comput., 8(2):126--134, 2004.",
      "doi": "10.5555/992039.992047"
    },
    {
      "text": "J. Rekimoto, Y. Ayatsuka, M. Kohno, and H. Oba. Proximal interactions: A direct manipulation technique for wireless networking. In Proc. INTERACT 2003, pages 511--518. IOS Press, 2003.",
      "doi": ""
    },
    {
      "text": "N. Saxena, J.-E. Ekberg, K. Kostiainen, and N. Asokan. Secure device pairing based on a visual channel. In Proc. Symp. on Security and Privacy 2006, pages 306--313. IEEE Computer Society, 2006.  ",
      "doi": "10.1109/SP.2006.35"
    },
    {
      "text": "D. Schmidt, F. Chehimi, E. Rukzio, and H. Gellersen. PhoneTouch: A technique for direct phone interaction on surfaces. In Proc. UIST 2010. ACM Press, 2010.  ",
      "doi": "10.1145/1866029.1866034"
    },
    {
      "text": "F. Stajano and R. Anderson. The resurrecting duckling: Security issues for ad-hoc wireless networks. In Proc. 7th International Workshop on Security Protocols, pages 172--194. Springer-Verlag, 1999. ",
      "doi": "10.5555/647217.760118"
    },
    {
      "text": "E. Uzun, K. Karvonen, and N. Asokan. Usability analysis of secure pairing methods. In Proc. USEC 2007, pages 307--324, 2007. ",
      "doi": "10.5555/1785594.1785635"
    },
    {
      "text": "A. D. Wilson and R. Sarin. BlueTable: Connecting wireless mobile devices on interactive surfaces using vision-based handshaking. In Proc. GI 2007, pages 119--125, 2007.  ",
      "doi": "10.1145/1268517.1268539"
    },
    {
      "text": "J. O. Wobbrock, H. H. Aung, B. Rothrock, and B. A. Myers. Maximizing the guessability of symbolic input. In Ext. Abstracts CHI 2005, pages 1869--1872. ACM Press, 2005.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "J. O. Wobbrock, M. R. Morris, and A. D. Wilson. User-defined gestures for surface computing. In Proc. CHI 2009, pages 1083--1092. ACM Press, 2009.  ",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}