{
  "doi": "10.1145/1978942.1979292",
  "title": "Practices in the creative reuse of e-waste",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2395-2404",
  "year": 2011,
  "badges": [],
  "abstract": "E-waste is a generic term embracing various forms of electric and electronic equipment that is loosely discarded, surplus, obsolete, or broken [27]. When e-waste is improperly discarded as trash, there are predictable negative impacts on the environment and human health. Existing e-waste solutions range from designing for reuse to fabricating with eco-friendly decomposable materials to more radical critiques of current practices surrounding capitalism and consumerism. Complementary to theses efforts, this paper presents an accessible reuse framework that encourages creativity while maintaining personal ownership of e-waste. Through a series of online surveys of existing personal e-waste stockpiling behaviors combined with observational studies of existing reuse practices, we developed a design reuse vocabulary: materials, shapes, and operations to enable wide ranging and creative reuse of obsolete electronics by everyday people. We operationalized this vocabulary and evaluated its legibility and usefulness. As a result, we derived a novel reuse composition framework: reuse as-is, remake, and remanufacture designed to be accessible and to have broader impact in encouraging creative reuse across a wide range of e-waste types beyond those specifically used in our study. We believe these frameworks will be a catalyst for the creative reuse of e-waste.",
  "authors": [
    {
      "name": "Sunyoung Kim",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384595634",
      "orcid": "missing"
    },
    {
      "name": "Eric Paulos",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Alameda County Computer Resource Center, http://www.acccrc.org, 2010 Septempber.",
      "doi": ""
    },
    {
      "text": "Australia Environmental Protection Agency (2005), Household Electrical and Electronic, Waste Benchmark Survey 2005.",
      "doi": ""
    },
    {
      "text": "Blevis. E. (2007), Sustainable interaction design in HCI. In Proc. CHI 2007, ACM Press, 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Alexander, C., Ishikawa, S., Silverstein, M., Max J. I. Fiksdahl-King and Angel, A. (1977) Pattern Language. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Consumer Electronics Association (2008), Market Research Report: Trends in CE Reuse, Recycle and Removal, April 2008.",
      "doi": ""
    },
    {
      "text": "Cooper, T. (2005), Slower Consumption Reflections on Product Life Spans and the \"Throwaway Society\". Journal of Industrial Ecology, 9(1-2): 51--67.",
      "doi": ""
    },
    {
      "text": "Creusen M. E. H & Jan P. L. Schoormans (2005), The Different Roles of Product Appearance in Consumer Choice, Journal of Product Innovation Management 22(1): 63--81.",
      "doi": ""
    },
    {
      "text": "Dourish. P. (2010), HCI and environmental sustainability: the politics of design and the design of politic, In Proc. the 8th ACM Conference on Designing Interactive Systems, 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Fogg, B. J. Grudin, J. Nielsen, J. & Card, S. (2002), Persuasive Technology: Using Computers to Change What We Think and Do, Science & Technology Books. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Gregson, N. Metcalfe, A. & Crewe, L. (2007), Identity mobility and the throwaway society. Environment and Planning D: Society and Space 2007, 25 No. 4:682--700.",
      "doi": ""
    },
    {
      "text": "Heimbuch, J. (2010), Consumers In Emerging Markets Outpace Americans in Buying Electronics, Especially Greener Gadgets, Science & Technology 2010.",
      "doi": ""
    },
    {
      "text": "Horst W. J. Rittel and Melvin M. W. (1973), Dilemmas in a General Theory of Planning. Policy Sciences.",
      "doi": ""
    },
    {
      "text": "Huang, E. M. & Truong, K. N. (2008), SUSTAINABLY OURS-Situated Sustainability for Mobile Phones. Interactions-New York, 2008. 15(2): 16--19.  ",
      "doi": "10.1145/1340961.1340966"
    },
    {
      "text": "Huang, E. M. & Truong, K. N. (2008), Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones. In Proc. CHI 2008, ACM Press, 323--332.  ",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Huh, J., Nam, K. and Sharma, N. (2010) Finding the Lost Treasure: Understanding Reuse of Used Computing Devices, In Proc. CHI 2010, ACM Press, 1875--1878.  ",
      "doi": "10.1145/1753326.1753607"
    },
    {
      "text": "Makezine http://www.makezine.com, 2010 August.",
      "doi": ""
    },
    {
      "text": "Mankoff J. C., Blevis, E., Borning, E., Friedman, B., Fussell, S. R., Hasbrouck, J., Woodruff, A. and Phoebe S. (2007), Environmental sustainability and interaction, Ext. Abstracts CHI 2007, ACM Press, 2121--2124.  ",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Nathan L. P., Blevis E., Friedman B., Hasbrouck J., & Sengers P. (2008), Beyond the hype: sustainability & HCI. Ext. Abstracts CHI 2008, ACM Press, 2273--2276.  ",
      "doi": "10.1145/1358628.1358667"
    },
    {
      "text": "National Safety Council Electronic Product Recovery and Recycling Baseline Report. Washington D.C.",
      "doi": ""
    },
    {
      "text": "Odom W., Pierce J., Stolterman E., and Blevis E. (2009), Understanding why we preserve some things and discard others in the context of interaction design. In Proc. CHI 2009, ACM Press, 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Paulos E., Forth M., Satchell S., Kim Y., Dourish P., and Choi J. (2008), Ubiquitous Sustainability: Citizen Science & Activism. In Proc Ubicomp '08 Workshops.",
      "doi": ""
    },
    {
      "text": "Piper Jaffray Companies, http://www.piperjaffray.com/ 2010 June.",
      "doi": ""
    },
    {
      "text": "Solid Waste District http://www.solidwastedistrict.com 2010 August.",
      "doi": ""
    },
    {
      "text": "Wakkary, R. & Tanenbaum, K. (2009), A sustainable identity in HCI. In Proc. CHI 2009, ACM Press. 365--374.  ",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Wakkary, R. & Maestri, L. (2007), The resourcefulness of everyday design. In Proc. Creativity and Cognition 2007, ACM Press, 163--172.  ",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Widmer, R., Oswald-Krapf H., Sinha-Khetriwal D., et al. (2005), Global perspectives on e-waste. Environmental Impact Assessment Review 2005; 25; 436--45.",
      "doi": ""
    },
    {
      "text": "Wikipedia, http://en.wikipedia.org/wiki/Citizen_science 2010 10.",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Hasbrouck, J. and Augustin, S. (2008), A bright green perspective on sustainable choices, In Proc. CHI 2008, ACM Press, 313--322.  ",
      "doi": "10.1145/1357054.1357109"
    },
    {
      "text": "Verbeek, P. P. (2005), What Things Do - Philosophical Reflections on Technology, Agency, and Design. The Pennsylvania State Press.",
      "doi": ""
    },
    {
      "text": "US Environmental Protection Agency, Municipal Solid Waste Generation Recycling and Disposal in the United States: Facts and Figures for 2007, 2008.",
      "doi": ""
    },
    {
      "text": "US Environmental Protection Agency (2007), Fact sheet: Management of Electronic waste in the US 2007.",
      "doi": ""
    }
  ]
}