{
  "doi": "10.1145/1978942.1979103",
  "title": "Social media ownership: using twitter as a window onto current attitudes and beliefs",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1081-1090",
  "year": 2011,
  "badges": [],
  "abstract": "Social media, by its very nature, introduces questions about ownership. Ownership comes into play most crucially when we investigate how social media is saved or archived; how it is reused; and whether it can be removed or deleted. We investigate these social media ownership issues using a Mechanical Turk survey of Twitter users; the survey uses open-ended questions and statements of belief about realistic Twitter-based scenarios to give us a window onto current attitudes and beliefs. Our findings reveal that respondents take a liberal attitude toward saving and storing the tweets that they encounter. More caution is exercised with republishing the material, and still more with sharing the material among friends and associates. Respondents approach removal of this type of lightweight social media most cautiously. The material's provenance and the respondents' relationship to the material (whether they are the author or subject) has considerable bearing on what they feel they can do with it.",
  "tags": [
    "twitter",
    "reuse",
    "social media",
    "information rights",
    "survey"
  ],
  "authors": [
    {
      "name": "Catherine C. Marshall",
      "institution": "Microsoft Research, Silicon Valley, Mountain View, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100281009",
      "orcid": "missing"
    },
    {
      "name": "Frank M. Shipman",
      "institution": "Texas A&M University, College Station, Texas, USA",
      "img": "/do/10.1145/contrib-81100155993/rel-imgonly/me-2009.jpg",
      "acmid": "81100155993",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. and Grossklags, J. Privacy Attitudes and Privacy Behavior, in J. Camp and S. Lewis (Eds.) The Economics of Information Security, Kluwer, Boston, pp. 165--178.",
      "doi": ""
    },
    {
      "text": "Besmer, A. and Lipford, H. R. Moving Beyond Untagging: Photo Privacy in a Tagged World. Proc. CHI'10, 1563--1572.  ",
      "doi": "10.1145/1753326.1753560"
    },
    {
      "text": "boyd, d., Colder, S., &amp;#38; Lotan, G. Tweet, Tweet, Retweet: Conversational Aspects of Retweeting on Twitter. Proc. of HICSS 2010.  ",
      "doi": "10.1109/HICSS.2010.412"
    },
    {
      "text": "Downs, J., Holbrook, M., Sheng, S., &amp;#38; Cranor, L. Are your participants gaming the system?: Screening Mechanical Turk workers. Proc. of CHI'10. 2399--2402.  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Dourish, P. and Bly, S. Portholes: supporting awareness in a distributed work group. Proc. CHI'92. 541--547.  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Ebner, M. &amp;#38; Schiefner, M. Microblogging - more than fun? Proc. of IADIS Mobile Learning Conference, 2008, 155--159.",
      "doi": ""
    },
    {
      "text": "Galuba, W., Aberer, K., Chakraborty, D., Despotovic, Z., &amp;#38; Kellerer, W. Outtweeting the Twitterers - Predicting Information Cascades in Microblogs. Proc. of Workshop on Online Social Networks, 2010. ",
      "doi": "10.5555/1863190.1863193"
    },
    {
      "text": "Honeycutt, C., &amp;#38; Herring, S. Beyond microblogging: Conversation and collaboration via Twitter. Proc. of the HICSS 2009. IEEE Press.  ",
      "doi": "10.1109/HICSS.2009.89"
    },
    {
      "text": "Huberman, B. A., Romero, D. M. and Wu, F. Social Networks that Matter: Twitter under the Microscope. First Monday, 14, 1, January, 2009.",
      "doi": ""
    },
    {
      "text": "Hughes, A. L. &amp;#38; Palen, L. Twitter adoption and use in mass convergence and emergency events. Int. Journal of Emergency Management. 6 (3/4) 2009, 248--260.",
      "doi": ""
    },
    {
      "text": "Ipeirotis, P. The New Demographics of Mechanical Turk. http://behind-the-enemy-lines.blogspot.com/2010/03/new-demographics-of-mechanical-turk.html.",
      "doi": ""
    },
    {
      "text": "Jakobsson, M. (2009) Experimenting on Mechanical Turk: 5 How Tos. ITWorld, September 3, 2009.",
      "doi": ""
    },
    {
      "text": "Java, A., Song, X., Finin, T. &amp;#38; Tseng, B. Why we twitter: Understanding microblogging usage and communities. Proc. ACM SIGKDD, 2007.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Kittur, A., Chi, E., Suh, B. Crowdsourcing User Studies with Mechanical Turk. Proc. CHI'08. 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Krishnamurthy, B., Gill, P., &amp;#38; Arlitt, M. A Few Chirps about Twitter. Proc. Workshop on Online Social Networks, 2008, 19--24.  ",
      "doi": "10.1145/1397735.1397741"
    },
    {
      "text": "Lessig, L. Remix: Making Art and Commerce Thrive in the Hybrid Economy, Penguin, New York, 2008.",
      "doi": ""
    },
    {
      "text": "Levy, D. \"Fixed or Fluid: Document Stability and New Media.\" Proc. ECHT'94, 1994, 24--31.  ",
      "doi": "10.1145/192757.192760"
    },
    {
      "text": "Marshall, C. C. Rethinking Personal Digital Archiving, Part 1: Four Challenges from the Field. DLib, 14, 3/4.",
      "doi": ""
    },
    {
      "text": "Odom, W., Harper, R., Sellen, A., Kirk, D., Banks, R. Passing on &amp;#38; Putting to Rest: Understanding Bereavement in the Context of Interactive Technologies, Proc. CHI'10, pp 1831--1840.  ",
      "doi": "10.1145/1753326.1753601"
    },
    {
      "text": "Reinhardt, W., Ebner, M., Beham, G., &amp;#38; Costa, C. How People are using Twitter during Conferences. Proc. of EduMedia, 2009, 145--156.",
      "doi": ""
    },
    {
      "text": "Stutzman, F. and Kramer-Duffield, J. Friends Only: Examining a Privacy-Enhancing Behavior in Facebook. Proc. of CHI'10, 1553--1562.  ",
      "doi": "10.1145/1753326.1753559"
    },
    {
      "text": "Zhao, D. &amp;#38; Rosson, M. B. How and why people Twitter: the role that micro-blogging plays in informal communication at work. Proc. of GROUP'09, 243--252.  ",
      "doi": "10.1145/1531674.1531710"
    }
  ]
}