{
  "doi": "10.1145/1978942.1979117",
  "title": "Triggered think-aloud protocol: using eye tracking to improve usability test moderation",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1171-1174",
  "year": 2011,
  "badges": [],
  "abstract": "Usability practitioners often rely on research participants' verbal reports to better understand the user experience. These reports can be collected either during or after task execution, with each approach entailing unique benefits and limitations. This note presents a framework for using eye tracking data to \"trigger\" when and how moderators probe participants for verbal comments during task execution to supplement or elaborate participant-initiated comments. A preliminary case study suggests that this approach affords a level of efficiency and effectiveness difficult to achieve with retrospective verbalization or without the use of eye tracking. The hope is that practitioners will be encouraged to use and refine this method for the benefit of the field.",
  "authors": [
    {
      "name": "Beverly Freeman",
      "institution": "PayPal, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484644621",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ball, L. J., Eger, N., Stevens, R., and Dodd, J. Applying the PEEP method in usability testing. Interfaces, 67, (2006), 15--19.",
      "doi": ""
    },
    {
      "text": "Eger, N., Ball, L., Stevens, R., and Dodd, J. Cueing retrospective verbal reports in usability testing through eye-movement replay. Proc. BCS-CHI 2007, ACM Press (2007), 129--137. ",
      "doi": "10.5555/1531294.1531312"
    },
    {
      "text": "Ericsson K. A. and Simon, H. A. Protocol Analysis: Verbal Reports as Data. MIT Press, Cambridge, MA, USA, 1993.",
      "doi": ""
    },
    {
      "text": "Hyrskykari, A., Ovaska, S., Majaranta, P., R&amp;#228;ih&amp;#228;, K.-J., and Lehtinen, M. Gaze path stimulation in retrospective think-aloud. Journal of Eye Movement Research, 2,4:5 (2008), 1--18.",
      "doi": ""
    },
    {
      "text": "Lewis, C. and Mack, R. Learning to use a text processing system: Evidence from \"thinking aloud\" protocols. Proc. CHI 1982, ACM Press (1982), 387--392.  ",
      "doi": "10.1145/800049.801817"
    },
    {
      "text": "Nielsen, J. Usability Engineering. Morgan Kaufman, San Francisco, CA, USA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Pernice, K. and Nielsen, J. (2009). Eye tracking methodology: How to conduct and evaluate usability studies using eye tracking. http://www.useit.com/eyetracking/methodology/.",
      "doi": ""
    },
    {
      "text": "Retrospective think aloud and eye tracking. (2009). http://www.tobii.com/archive/files/20342/RTA_and_eyetracking_tobii_whitepaper.paper.pdf.aspx.",
      "doi": ""
    },
    {
      "text": "Russo, J. E. A software system for the collection of retrospective protocols prompted by eye fixations. Behavioral Research Methods and Instrumentation, 11, 2 (1979), 177--179.",
      "doi": ""
    },
    {
      "text": "Stevens, R. (2009). Why I'm not in love with eye tracking. http://thinkeyetracking.com/Blog/?p=331.",
      "doi": ""
    }
  ]
}