{
  "doi": "10.1145/1978942.1979268",
  "title": "Representing users in accessibility research",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2235-2238",
  "year": 2011,
  "badges": [],
  "abstract": "The need to study representative users is widely accepted within the human-computer interaction (HCI) community. While exceptions exist, and alternative populations are sometimes studied, virtually any introduction to the process of designing user interfaces will discuss the importance of understanding the intended users as well as the significant impact individual differences can have on how effectively individuals can use various technologies. HCI researchers are expected to provide relevant demographics regarding study participants as well as information about experience using similar technologies. Yet, in the field of accessibility we continue to see studies that do not appropriately include representative users. Highlighting ways to remedy this multifaceted problem, we argue that expectations regarding how accessibility research is conducted and reported must be raised if this field is to have the desired impact with regard to inclusive design, the information technologies studied, and the lives of the individuals being studied.",
  "tags": [
    "disabilities",
    "inclusion",
    "older adults",
    "accessibility",
    "representative users",
    "accessible computing"
  ],
  "authors": [
    {
      "name": "Andrew Sears",
      "institution": "UMBC, Baltimore, Maryland, USA",
      "img": "/do/10.1145/contrib-81100101553/rel-imgonly/andrewsears.jpg",
      "acmid": "81100101553",
      "orcid": "missing"
    },
    {
      "name": "Vicki Hanson",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-81100646151/rel-imgonly/vicki-1-square.jpg",
      "acmid": "81100646151",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bigham, J. and Cavender, A. Evaluating existing audio CAPTCHAs and an interface optimized for non-visual use. In Proc. CHI 2009, ACM Press (2009), 1829--1838.  ",
      "doi": "10.1145/1518701.1518983"
    },
    {
      "text": "Dijkers, M. When the best is the enemy of the good: The nature of research evidence used in systematic reviews and guidelines. Austin, TX: SEDL (2009).",
      "doi": ""
    },
    {
      "text": "Fairweather, P. How older and younger adults differ in their approach to problem solving on a complex website. In Proc. ASSETS 2008, ACM Press (2008), 67--7.  ",
      "doi": "10.1145/1414471.1414485"
    },
    {
      "text": "Ferres, L., Lindgaard, G., and Sumegi, L. Evaluating a tool for improving accessibility to charts and graphs. In Proc. ASSETS 2010, ACM Press (2010), 83--90.  ",
      "doi": "10.1145/1878803.1878820"
    },
    {
      "text": "Gajos, K., Wobbrock, J., and Weld, D. Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. In Proc. CHI 2008, ACM Press (2008), 1257--1266.  ",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Heller, M. Picture and pattern perception in the sighted and the blind: the advantage of the late blind. Perception 18, 3 (1989), 379 -389.",
      "doi": ""
    },
    {
      "text": "Hirano, S., Yeganyan, M., Marcu, G., Nguyen, D., Boyd, L., and Hayes, G. vSked: Evaluation of a system to support classroom activities for children with autism. In Proc. CHI 2010, ACM Press (2010), 1633--1642.  ",
      "doi": "10.1145/1753326.1753569"
    },
    {
      "text": "Huenerfauth, M., Zhao, L., Gu, E., and Allbeck, J. Evaluating American Sign Language generation through the participation of native ASL signers. In Proc. ASSETS 2007, ACM Press (2007), 211--218.  ",
      "doi": "10.1145/1296843.1296879"
    },
    {
      "text": "Petrie, H., Hamilton, F., King, N., and Pavan, P. Remote usability evaluations with disabled people. In Proc CHI '06, ACM Press (2006), 1133--1141.  ",
      "doi": "10.1145/1124772.1124942"
    },
    {
      "text": "Price, K., and Sears, A. The Development and Evaluation of Performance-Based Functional Assessment: A Methodology for the Measurement of Physical Capabilities. ACM Trans. on Access. Comput., 2, 2 (2009), 31 pages.  ",
      "doi": "10.1145/1530064.1530068"
    },
    {
      "text": "1Shinohara, K., and Tenenberg, J. Observing Sara: A Case Study of a Blind Person's Interactions with Technology. In Proc. ASSETS 2007, ACM Press (2007), 171--178.  ",
      "doi": "10.1145/1296843.1296873"
    },
    {
      "text": "Schlosser, R. The role of single-subject experimental designs in evidence-based practice times. FOCUS, 22 (2009), 1--8.",
      "doi": ""
    },
    {
      "text": "Sears, A., Karat, C-M., Oseitutu, K., Karimullah, A., and Feng, J. Productivity, satisfaction, and interaction strategies of individual with spinal cord injuries and traditional users interacting with speech recognition software. Universal Access in the Information Society, 1 (2001), 4--15.",
      "doi": ""
    },
    {
      "text": "Stevens, R., and Edwards, A. An approach to the evaluation of assistive technology. In Proc. ASSETS '96. ACM Press (1996), 64--71.  ",
      "doi": "10.1145/228347.228359"
    },
    {
      "text": "Trewin, S., Laff, M., Hanson, V., and Cavender, A. Exploring Visual and Motor Accessibility in Navigating a Virtual World. ACM Trans. on Access. Comput., 2, 2 (2009), 35 pages.  ",
      "doi": "10.1145/1530064.1530069"
    },
    {
      "text": "Walker, B. and Mauney, L. Universal Design of Auditory Graphs: A Comparison of Sonification Mappings for Visually Impaired and Sighted Listeners. ACM Trans. on Access. Comput. 2, 3, (2010), 16 pages..  ",
      "doi": "10.1145/1714458.1714459"
    }
  ]
}