{
  "doi": "10.1145/1978942.1979416",
  "title": "The reading desk: applying physical interactions to digital documents",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3199-3202",
  "year": 2011,
  "badges": [],
  "abstract": "Reading is increasingly being performed interactively on-screen; for instance, new novels are now routinely released in electronic format for viewing on PCs and mobile devices. Unfortunately, on-screen reading loses many of the natural features of conventional physical media, such as the ability to annotate, slip in bookmarks, turn page corners, and so on. How best should these features be represented electronically? Can computerized representations give benefits that excel the conventional benefits of paper? We describe the design and implementation of a novel reading system that mimics key properties of paper and surpasses them by incorporating digital techniques. A comparative user study evaluating the system confirmed the effectiveness of the features and the value of the system as a whole.",
  "authors": [
    {
      "name": "Jennifer Pearson",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "George Buchanan",
      "institution": "City University, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100456135/rel-imgonly/g5edit.jpg",
      "acmid": "81100456135",
      "orcid": "missing"
    },
    {
      "name": "Harold Thimbleby",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100200743",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1. A. Adler, A. Gujar, B. L. Harrison, K. O'Hara, and A. Sellen. A diary study of work-related reading design implications for digital reading devices. In CHI'98, pages 241--248. ACM, 1998.  ",
      "doi": "10.1145/274644.274679"
    },
    {
      "text": "M. J. Adler and C. Doren. How to Read a Book. The Art of Getting a Liberal Education. Simon and Schuster, 1972.",
      "doi": ""
    },
    {
      "text": "G. Buchanan and J. Pearson. Improving placeholders in digital documents. In ECDL'08, volume 5173 of LNCS, pages 1--12. Springer, 2008.  ",
      "doi": "10.1007/978-3-540-87599-4_1"
    },
    {
      "text": "A. Dix. Designing for appropriation. In HCI'07, pages 27--30. BCS, 2007. ",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "C. C. Marshall and S. Bly. Turning the page of navigation. In JCDL'05, pages 225--234. ACM. 2005.  ",
      "doi": "10.1145/1065385.1065438"
    },
    {
      "text": "K. O'Hara and A. Sellen. A comparison of reading paper and on-line documents. In CHI'97, pages 335--342. ACM, 1997.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "J. Pearson, G. Buchanan, and H. W. Thimbleby. Improving annotations in digital documents. In ECDL, volume 5714 of LNCS, pages 429--432, Springer, 2009. ",
      "doi": "10.5555/1812799.1812863"
    },
    {
      "text": "B. N. Schilit, G. Golovchinsky, and M. N. Price. Beyond paper: supporting active reading with free form digital ink annotations. In CHI '98, pages 249--256, New York, USA, 1998. ACM Press..  ",
      "doi": "10.1145/274644.274680"
    }
  ]
}