{
  "doi": "10.1145/1978942.1979055",
  "title": "Is the media equation a flash in the pan?: the durability and longevity of social responses to computers",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "777-780",
  "year": 2011,
  "badges": [],
  "abstract": "Research on social responses to computers often assesses only first-impression reactions during a single experimental session, providing limited knowledge about the lasting effect of the results. In this work, we assess the lasting strength of social desirability bias effects on an interface designed to track exercise, manipulated to have high or low personalization (text vs. anthropomorphic conversational character). After 40 days of daily interactions by 25 participants, we found that self-reported exercise was more accurate when reported to the character vs. text. We also find that, for both conditions, participants' decision to initiate a session is greater when they have done more exercise. Moreover, we show that this effect significantly increases over time for participants in the character condition, and decreases for participants in the text condition. This study demonstrates that Media Equation effects can grow stronger or weaker over time, depending upon the presentation of the interface.",
  "tags": [
    "self-report",
    "longitudinal studies",
    "media equation"
  ],
  "authors": [
    {
      "name": "Laura M. Pfeifer",
      "institution": "Northeastern University, Boston, Massachusetts, USA",
      "img": "/do/10.1145/contrib-81381591529/rel-imgonly/lauravar-small.jpg",
      "acmid": "81381591529",
      "orcid": "missing"
    },
    {
      "name": "Timothy Bickmore",
      "institution": "Northeastern University, Boston, Massachusetts, USA",
      "img": "/do/10.1145/contrib-81100360895/rel-imgonly/81100360895.jpg",
      "acmid": "81100360895",
      "orcid": "0000-0002-2676-9788"
    }
  ],
  "references": [
    {
      "text": "Bickmore, T., Schulman, D., and Yin, L.: Maintaining Engagement in Long-term Interventions with Relational Agents. International Journal of Applied Artificial Intelligence 24, 6 (2010) 648--666.  ",
      "doi": "10.1080/08839514.2010.492259"
    },
    {
      "text": "Booth-Kewley, S., Larson, G. E., and Miyoshi, D. K.: Social desirability effects on computerized and paper-and pencil-questionnaires. Computers in Human Behavior 23, 1 (2007) 463--477.  ",
      "doi": "10.1016/j.chb.2006.09.002"
    },
    {
      "text": "Cassell, J. and Miller, P.: Is it Self-Administration if the Computer Gives you Encouraging Looks? In F. G. Conrad and M. F. Schober, Eds.: Envisioning the Survey Interview of the Future, John Wiley &amp;#38; Sons, (2007) 161--178.",
      "doi": ""
    },
    {
      "text": "Crowne, D. and Marlowe, D., The approval motive; studies in evaluative dependence, Wiley, (1964).",
      "doi": ""
    },
    {
      "text": "Goffman, E., The presentation of self in everyday life, Harmondsworth, (1978).",
      "doi": ""
    },
    {
      "text": "Hancock, J. T., Toma, C., and Ellison, N.: The truth about lying in online dating profiles. Proceedings of the SIGCHI conference on Human factors in computing systems (2007) 452.  ",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Hoffmann, L., Kr&amp;#228;mer, N., Lam-chi, A., Kopp, S., Ruttkay, Z., Kipp, M., Nijholt, A., and Vilhj&amp;#225;lmsson, H.: Media Equation Revisited: Do Users Show Polite reactions towards an Embodied Agent? In Intelligent Virtual Agents, Volume 5773, Springer Berlin / Heidelberg, (2009) 159--165.  ",
      "doi": "10.1007/978-3-642-04380-2_19"
    },
    {
      "text": "Nass, C., Moon, Y., and Carney, P.: Are People Polite to Computers? Responses to Computer-Based Interviewing Systems. Journal of Applied Social Psychology 29, 5 (1999) 1093--1109.",
      "doi": ""
    },
    {
      "text": "Nass, C., Steuer, J., and Tauber, E.: Computers are social actors. CHI '94: Proceedings of the SIGCHI conference on Human factors in computing systems (1994) 72--78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Newman, J., Des, Turner, C., Gribble, J., Cooley, P., and Paone, D.: The Differential Effects of Face-to-Face and Computer Interview Modes. Am J Public Health 92, 2 (2002) 294--297.",
      "doi": ""
    },
    {
      "text": "R. Development Core Team, R: A Language and Environment for Statistical Computing, (2009).",
      "doi": ""
    },
    {
      "text": "Reeves, B. and Nass, C., The media equation: how people treat computers, television, and new media like real people and places, CSLI Publications, (1996). ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Tourangeau, R., Couper, M., and Steiger, D.: Humanizing self-administered surveys: experiments on social presence in web and IVR surveys. Computers in Human Behavior 19, 1 (2003) 1--24.",
      "doi": ""
    }
  ]
}