{
  "doi": "10.1145/1978942.1979280",
  "title": "Oops, I did it again: mitigating repeated access control errors on facebook",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2295-2304",
  "year": 2011,
  "badges": [],
  "abstract": "We performed a study of Facebook users to examine how they coped with limitations of the Facebook privacy settings interface. Students graduating and joining the workforce create significant problems for all but the most basic privacy settings on social networking websites. We therefore created realistic scenarios exploiting work/play boundaries that required users to specify access control policies that were impossible due to various limitations. We examined whether users were aware of these problems without being prompted, and once given feedback, what their coping strategies were. Overall, we found that simply alerting participants to potential errors was ineffective, but when choices were also presented, participants introduced significantly fewer errors. Based on our findings, we designed a privacy settings interface based on Venn diagrams, which we validated with a usability study. We conclude that this interface may be more effective than the current privacy settings interface.",
  "authors": [
    {
      "name": "Serge Egelman",
      "institution": "National Institute of Standards and Technology, Gaithersburg, Maryland, USA",
      "img": "/do/10.1145/contrib-81315488724/rel-imgonly/me.jpg",
      "acmid": "81315488724",
      "orcid": "missing"
    },
    {
      "name": "Andrew Oates",
      "institution": "Google, Inc., Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484642519",
      "orcid": "missing"
    },
    {
      "name": "Shriram Krishnamurthi",
      "institution": "Brown University, Providence, Rhode Island, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100512233",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Binder, A. Howes, and A. Sutcliffe. The problem of conflicting social spheres: Effects of network structure on experienced tension in social network sites. In CHI '09: Proceedings of the 27th International Conference on Human Factors in Computing Systems, pages 965--974, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1518701.1518849"
    },
    {
      "text": "d. boyd and E. Hargittai. Facebook privacy settings: Who cares? First Monday, 15(8), August 2010.",
      "doi": ""
    },
    {
      "text": "C. A. Brodie, C.-M. Karat, and J. Karat. An empirical study of natural language parsing of privacy policy rules using the SPARCLE policy workbench. In SOUPS '06: Proceedings of the Second Symposium on Usable Privacy and Security, pages 8--19, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1143120.1143123"
    },
    {
      "text": "Computer Research Association. CRA Conference on Grand Research Challenges in Information Security & Assurance, 2003. http://archive.cra.org/reports/trustworthy.computing.pdf.",
      "doi": ""
    },
    {
      "text": "J. DiMicco, D. R. Millen, W. Geyer, C. Dugan, B. Brownholtz, and M. Muller. Motivations for social networking at work. In CSCW '08: Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, pages 711--720, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "J. M. DiMicco and D. R. Millen. Identity Management: Multiple presentations of self in Facebook. In GROUP '07: Proceedings of the 2007 International ACM Conference on Supporting Group Work, pages 383--386, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1316624.1316682"
    },
    {
      "text": "K. Fisler and S. Krishnamurthi. A model of triangulating environments for policy authoring. In SACMAT '10: Proceeding of the 15th ACM Symposium on Access Control Models and Technologies, pages 3--12, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1809842.1809847"
    },
    {
      "text": "K. Fisler, S. Krishnamurthi, L. A. Meyerovich, and M. C. Tschantz. Verification and change-impact analysis of access-control policies. In ICSE '05: Proceedings of the 27th International Conference on Software Engineering, pages 196--205, New York, NY, USA, 2005. ACM.  ",
      "doi": "10.1145/1062455.1062502"
    },
    {
      "text": "R. Gross and A. Acquisti. Information revelation and privacy in online social networks. In WPES '05: Proceedings of the 2005 ACM Workshop on Privacy in the Electronic Society, pages 71--80, New York, NY, USA, 2005. ACM.  ",
      "doi": "10.1145/1102199.1102214"
    },
    {
      "text": "iStrategy Labs. Facebook demographics and statistics report, January 2010. http://www.istrategylabs.com/2010/01/facebook-demographics-and-statistics-re%port-2010--145-growth-in-1-year/.",
      "doi": ""
    },
    {
      "text": "A. N. Joinson. Looking at, looking up or keeping up with people?: motives and use of facebook. In CHI '08: Proceedings of the 26th International Conference on Human Factors in Computing Systems, pages 1027--1036, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "C. Lampe, N. Ellison, and C. Steinfield. A face(book) in the crowd: Social searching vs. social browsing. In CSCW '06: Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work, pages 167--170, New York, NY, USA, 2006. ACM.  ",
      "doi": "10.1145/1180875.1180901"
    },
    {
      "text": "C. Lampe, N. B. Ellison, and C. Steinfield. Changes in use and perception of Facebook. In CSCW '08: Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, pages 721--730, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1460563.1460675"
    },
    {
      "text": "M. M. Skeels and J. Grudin. When social networks cross boundaries: A case study of workplace use of Facebook and LinkedIn. In GROUP '09: Proceedings of the 2009 International ACM Conference on Supporting Group Work, pages 95--104, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "C. Steinfield, J. M. DiMicco, N. B. Ellison, and C. Lampe. Bowling online: social networking and social capital within the organization. In C&T '09: Proceedings of the 4th International Conference on Communities and Technologies, pages 245--254, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1556460.1556496"
    },
    {
      "text": "K. Strater and H. R. Lipford. Strategies and struggles with privacy in an online social networking community. In BCS-HCI '08: Proceedings of the 22nd British HCI Group Annual Conference, pages 111--119, Swinton, UK, UK, 2008. British Computer Society. ",
      "doi": "10.5555/1531514.1531530"
    },
    {
      "text": "F. Stutzman and J. Kramer-Duffield. Friends only: examining a privacy-enhancing behavior in Facebook. In CHI '10: Proceedings of the 28th International Conference on Human Factors in Computing Systems, pages 1553--1562, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1753326.1753559"
    },
    {
      "text": "A. Tootoonchian, K. K. Gollu, S. Saroiu, Y. Ganjali, and A. Wolman. Lockr: social access control for web 2.0. In WOSN '08: Proceedings of the 1st Workshop on Online Social Networks, pages 43--48, New York, NY, USA, 2008. ACM.  ",
      "doi": "10.1145/1397735.1397746"
    },
    {
      "text": "T. Turner, P. Qvarfordt, J. T. Biehl, G. Golovchinsky, and M. Back. Exploring the workplace communication ecology. In CHI '10: Proceedings of the 28th International Conference on Human Factors in Computing Systems, pages 841--850, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1753326.1753449"
    },
    {
      "text": "J. Watson, M. Whitney, and H. R. Lipford. Configuring audience-oriented privacy policies. In SafeConfig '09: Proceedings of the 2nd ACM Workshop on Assurable and Usable Security Configuration, pages 71--78, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1655062.1655076"
    },
    {
      "text": "A. Wu, J. M. DiMicco, and D. R. Millen. Detecting professional versus personal closeness using an enterprise social network site. In CHI '10: Proceedings of the 28th International Conference on Human Factors in Computing Systems, pages 1955--1964, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1753326.1753622"
    },
    {
      "text": "A. L. Young and A. Quan-Haase. Information revelation and internet privacy concerns on social network sites: a case study of Facebook. In C&T '09: Proceedings of the 4th International Conference on Communities and Technologies, pages 265--274, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1556460.1556499"
    }
  ]
}