{
  "doi": "10.1145/1978942.1979034",
  "title": "An actuated physical puppet as an input device for controlling a digital manikin",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "637-646",
  "year": 2011,
  "badges": [],
  "abstract": "We present an actuated handheld puppet system for controlling the posture of a virtual character. Physical puppet devices have been used in the past to intuitively control character posture. In our research, an actuator is added to each joint of such an input device to provide physical feedback to the user. This enhancement offers many benefits. First, the user can upload pre-defined postures to the device to save time. Second, the system is capable of dynamically adjusting joint stiffness to counteract gravity, while allowing control to be maintained with relatively little force. Third, the system supports natural human body behaviors, such as whole-body reaching and joint coupling. This paper describes the user interface and implementation of the proposed technique and reports the results of expert evaluation. We also conducted two user studies to evaluate the effectiveness of our method.",
  "authors": [
    {
      "name": "Wataru Yoshizaki",
      "institution": "NAIST AIST, Nara, and DHRC AIST, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657392",
      "orcid": "missing"
    },
    {
      "name": "Yuta Sugiura",
      "institution": "Keio University, Kanagawa, and JST ERATO, Toyko, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442608773",
      "orcid": "missing"
    },
    {
      "name": "Albert C. Chiou",
      "institution": "JST ERATO, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484648099",
      "orcid": "missing"
    },
    {
      "name": "Sunao Hashimoto",
      "institution": "JST ERATO, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363603235",
      "orcid": "missing"
    },
    {
      "name": "Masahiko Inami",
      "institution": "Keio University, Kanagawa, and JST ERATO, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424140",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo and JST ERATO, TOKYO, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    },
    {
      "name": "Yoshiaki Akazawa",
      "institution": "DHRC AIST, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484643188",
      "orcid": "missing"
    },
    {
      "name": "Katsuaki Kawachi",
      "institution": "DHRC AIST, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100164196",
      "orcid": "missing"
    },
    {
      "name": "Satoshi Kagami",
      "institution": "DHRC AIST, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100481894",
      "orcid": "missing"
    },
    {
      "name": "Masaaki Mochimaru",
      "institution": "DHRC AIST, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593520",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arai, K. Cyber Bunraku. ACM SIGGRAPH 97 Visual Proceedings, (1997).  ",
      "doi": "10.1145/259081.259184"
    },
    {
      "text": "Baxter, B., Scheib, V., Lin, M. C., and Manocha, D. DAB: Interactive Haptic Painting with 3D Virtual Brushes. Proc. SIGGRAPH '01. (2001), 461--468.  ",
      "doi": "10.1145/383259.383313"
    },
    {
      "text": "Chai, J., and Hodgins, J. Performance animation from low-dimensional control signals. ACM Trans. Graph. 24, 3 (July 2005), 686--696.  ",
      "doi": "10.1145/1073204.1073248"
    },
    {
      "text": "Cover, S. A., Ezquerra, N., O'Brien, J., Rowe, R., Gadacz, T., and Palm, E. Interactively Deformable Models for Surgery Simulation. IEEE CG&amp;#38;A, 13, 6. (1993), 68--75.  ",
      "doi": "10.1109/38.252559"
    },
    {
      "text": "De Luca, A. and Panzieri, S. Learning gravity compensation in robots: Rigid arms, elastic joints, flexible links. IJACSP, 7, 5, (1993) 417--433.",
      "doi": ""
    },
    {
      "text": "Dempster, W. T. Space Requirements of the Seated Operator. Technical Report WADC-TR-55-159. Aero-space Medical Research Laboratory, Wright-Patterson Air Force Base, OH, (1955), 105--109.",
      "doi": ""
    },
    {
      "text": "Dontcheva, M., Yngve, G., Popovi&amp;#263;, Z. Layered Acting for Character Animation. Proc. SIGGRAPH 2003, (2003), 409--416.  ",
      "doi": "10.1145/1201775.882285"
    },
    {
      "text": "Duffy, Vincent G. (eds.), Handbook of Digital Human Modeling, CRC Press, FL (2009). ",
      "doi": "10.5555/1523071"
    },
    {
      "text": "Esposito, C., Paley, W. B., and Ong, J. Of mice and monkeys: a specialized input device for virtual body animation. Proc. I3D '95. (1995), 109--114.  ",
      "doi": "10.1145/199404.199424"
    },
    {
      "text": "Feng, T. C., Gunawardane, P., Davis, J., Jiang, B. Motion capture data retrieval using an artist's doll. Proc. ICPR 2008, (2008), 1--4.",
      "doi": ""
    },
    {
      "text": "Gaylean, T. A. and Hughes, J. F. Sculpting: An Interactive Volumetric Modeling Technique. Proc. SIGGRAPH 1991, (1991), 267--274.  ",
      "doi": "10.1145/122718.122747"
    },
    {
      "text": "Grochow, K., Martin, S. L., Hertzmann, A., and Popovi&amp;#263;, Z. Style-based Inverse Kinematics. ACM Trans. Graph. 23, 3 (Aug. 2004), 522--531.  ",
      "doi": "10.1145/1015706.1015755"
    },
    {
      "text": "Hinckley, K. Haptic Issues for Virtual Manipulation, Ph.D. Thesis, University of Virginia, (1997). ",
      "doi": "10.5555/269527"
    },
    {
      "text": "ISO 15536-2:2007(E) Ergonomics Comp. Manikins and Body Templates Part 2: Verification of Functions and Validation of Dimensions for Comp. Manikin Systems.",
      "doi": ""
    },
    {
      "text": "Johnson, M. P., Wilson, A., Blumberg, B., Kline, C., and Bobick, A. Sympathetic Interfaces: Using a Plush Toy to Direct Synthetic Characters. Proc. CHI '99.  ",
      "doi": "10.1145/302979.303028"
    },
    {
      "text": "Knep, B., Hayes, C., Sayre, R., and Williams, T. Dinosaur Input Device. Proc. CHI 1995, (1995), 304--309.  ",
      "doi": "10.1145/223904.223943"
    },
    {
      "text": "Mukai, T., Kuriyama, S. Geostatistical Motion Interpolation. ACM Trans. Graph. 24, 3 (2005), 1062--1070.  ",
      "doi": "10.1145/1073204.1073313"
    },
    {
      "text": "Raffle, H. S., Parkes, A. J., and Ishii, H. Topobo: A Constructive Assembly System with Kinetic Memory. Proc. CHI '04, (2004), 647--654.  ",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Rose, C., Sloan, P., and Cohen, M. Artist-directed in-verse-kinematics using radial basis function interpolation. Computer Graphics Forum, 20, (2001), 239--250.",
      "doi": ""
    },
    {
      "text": "Sekiguchi, D., Inami, M., and Tachi, S. RobotPHONE: RUI for Interpersonal Communication. CHI '01 Extended Abstracts, (2001), 277--278.  ",
      "doi": "10.1145/634067.634231"
    },
    {
      "text": "Shimizu, N., Koizumi, N., Sugimoto, M., Nii, H., Sekiguchi, D., and Inami, M. A Teddy-bear-based Robotic User Interface. CIE 4, 3 (July 2006), 8.  ",
      "doi": "10.1145/1146816.1146830"
    },
    {
      "text": "Tachi, S., Arai, H., and Maeda, T. Development of an Anthropomorphic Tele-existence Slave Robot. Proc. ICAM '89. JSME, (1989), 343--348.",
      "doi": ""
    },
    {
      "text": "Weller, M. P., Do, E. Y., and Gross, M. D. Posey: Instrumenting a Poseable Hub and Strut Construction Toy. Proc. TEI '08, (2008), 39--46.  ",
      "doi": "10.1145/1347390.1347402"
    },
    {
      "text": "Wiley D. J., Hahn J. K. Interpolation Synthesis of Articulated Figure Motion. IEEE CG&amp;#38;A, 17, 6, (1997), 39--45.  ",
      "doi": "10.1109/38.626968"
    }
  ]
}