{
  "doi": "10.1145/1978942.1979427",
  "title": "Tactile feedback can assist vision during mobile interactions",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3277-3280",
  "year": 2011,
  "badges": [],
  "abstract": "We evaluated the use of rich tactile feedback in the task of scrolling through a long list of items. We used a hand-held device having a tactile transducer that could provide sensations with temporal and spatial content. These capabilities were put to use in an interaction metaphor where input and tactile feedback were tightly coupled. We measured time- to-target and error rates, but also measured the time spent by participants to look at the screen. We found a 28% decrease of reliance on vision when tactile feedback was enabled.",
  "authors": [
    {
      "name": "Jerome Pasquero",
      "institution": "Research In Motion Limited, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100040803",
      "orcid": "missing"
    },
    {
      "name": "Vincent Hayward",
      "institution": "UPMC Univ Paris 06, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100323998",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S. A. Brewster and L. M. Brown. Tactons: Structured tactile messages for non-visual information display. In Proc. AUIC'04, pages 15--23, 2004. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "J. L. Burke, M. S. Prewett, A. A. Gray, L. Yang, F. R. B. Stilson, M. D. Coovert, L. R. Elliot, and E. Redden. Comparing the effects of visual-auditory and visual-tactile feedback on user performance: a meta-analysis. In Proc. ICMI '06, pages 108--117, 2006.  ",
      "doi": "10.1145/1180995.1181017"
    },
    {
      "text": "L. Chittaro. Visualizing information on mobile devices. Computer, 39(3):40--45, 2006.  ",
      "doi": "10.1109/MC.2006.109"
    },
    {
      "text": "R. H. Cook. An automatic stall prevention control for supersonic fighter aircraft. Journal of Aircraft, 2(3):171--175, 1965.",
      "doi": ""
    },
    {
      "text": "E. Hoggan, S. A. Brewster, and J. Johnston. Investigating the effectiveness of tactile feedback for mobile touchscreens. In Proc. CHI'08, pages 1573--1582, 2008.  ",
      "doi": "10.1145/1357054.1357300"
    },
    {
      "text": "S. Jones, M. Jones, G. Marsden, D. Patel, and A.Cockburn. An evaluation of integrated zooming and scrolling on small screens. Int. J. Human-Computer Studies, 63(3):271--303, 2005.  ",
      "doi": "10.1016/j.ijhcs.2005.03.005"
    },
    {
      "text": "V. Le Ìvesque, J. Pasquero, V. Hayward, and M. Legault. Display of virtual braille dots by lateral skin deformation: feasibility study. ACM T. Applied Perception, 2(2):132--149, 2005.  ",
      "doi": "10.1145/1060581.1060587"
    },
    {
      "text": "J. Luk, J. Pasquero, S. Little, K. MacLean, V. Levesque, and V. Hayward. A role for haptics in mobile interaction: initial design using a handheld tactile display prototype. In CHI '06, pages 171--180, 2006.  ",
      "doi": "10.1145/1124772.1124800"
    },
    {
      "text": "K. MacLean and M. Enriquez. Perceptual design of haptic icons. In Proc. Eurohaptics, 2003.",
      "doi": ""
    },
    {
      "text": "I. Oakley and S. O'Modhrain. Tilt to scroll: Evaluating a motion based vibrotactile mobile interface. In Proc. WHC '05, pages 40--49, 2005.  ",
      "doi": "10.1109/WHC.2005.138"
    },
    {
      "text": "A. Oulasvirta, S. Tamminen, V. Roto, and J. Kuorelahti. Interaction in 4-second bursts: the fragmented nature of attentional resources in mobile HCI. In Proc. CHI '05, pages 919--928, 2005.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "J. Pasquero, J. Luk, V. Levesque, Q. Wang, V. Hayward, and K. E. MacLean. Haptically enabled handheld information display with distributed tactile transducer. IEEE T. on Multimedia, 9(4):746--753, 2007.  ",
      "doi": "10.1109/TMM.2007.895672"
    },
    {
      "text": "I. Poupyrev, S. Maruyama, and J. Rekimoto. Ambient touch: designing tactile interfaces for handheld devices. In Proc. UIST '02, pages 51--60, 2002.  ",
      "doi": "10.1145/571985.571993"
    }
  ]
}