{
  "doi": "10.1145/1978942.1979336",
  "title": "Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2689-2698",
  "year": 2011,
  "badges": [],
  "abstract": "This paper reviews how empirical research on User Experience (UX) is conducted. It integrates products, dimensions of experience, and methodologies across a systematically selected sample of 51 publications from 2005-2009, reporting a total of 66 empirical studies. Results show a shift in the products and use contexts that are studied, from work towards leisure, from controlled tasks towards open use situations, and from desktop computing towards consumer products and art. Context of use and anticipated use, often named key factors of UX, are rarely researched. Emotions, enjoyment and aesthetics are the most frequently assessed dimensions. The methodologies used are mostly qualitative, and known from traditional usability studies, though constructive methods with unclear validity are being developed and used. Many studies use self-developed questionnaires without providing items or statistical validations. We discuss underexplored research questions and potential improvements of UX research.",
  "tags": [
    "meta-analysis",
    "usability",
    "user experience",
    "ux",
    "review"
  ],
  "authors": [
    {
      "name": "Javier A. Bargas-Avila",
      "institution": "University of Basel, Basel, Switzerland",
      "img": "/do/10.1145/contrib-81327487482/rel-imgonly/javierbargas.jpg",
      "acmid": "81327487482",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "R. Agarwal and E. Karahanna. Time flies when you're having fun: Cognitive absorption and beliefs about information technology usage. MIS Quarterly, 24(4):665--694, 2000.  ",
      "doi": "10.2307/3250951"
    },
    {
      "text": "L. Barkhuus and J. Rode. From Mice to Men--24 years of Evaluation in CHI. Proc. CHI '07, 2007.  ",
      "doi": "10.1145/1240624.2180963"
    },
    {
      "text": "K. Battarbee and I. Koskinen. Co-experience: user experience as interaction. CoDesign, 1(1):5--18, 2005.",
      "doi": ""
    },
    {
      "text": "M. Blythe, J. Reid, P. Wright, and E. Geelhoed. Interdisciplinary criticism: analysing the experience of riot! Behaviour &amp;#38; Information Technology, 25(2):127--139, 2006 *.",
      "doi": ""
    },
    {
      "text": "M. Blythe, J. Robinson, and D. Frohlich. Interaction design and the critics: what to make of the weegie. In Proc. NordiCHI '08, 53--62. ACM, 2008 *.  ",
      "doi": "10.1145/1463160.1463167"
    },
    {
      "text": "J. Coan and J. Allen. Handbook of emotion elicitation and assessment. Oxford University Press, 2007.",
      "doi": ""
    },
    {
      "text": "B. Costello and E. Edmonds. A study in play, pleasure and interaction design. In Proc. DPPI '07, 76--91. ACM, 2007 *.  ",
      "doi": "10.1145/1314161.1314168"
    },
    {
      "text": "B. Costello and E. Edmonds. Directed and emergent play. In Proc. C&amp;#38;C 09, 107--116. ACM, 2009 *.  ",
      "doi": "10.1145/1640233.1640252"
    },
    {
      "text": "M. Csikszentmihalyi. Flow and the Psychology of Discovery and Invention. HarperPerennial, New York, 1997.",
      "doi": ""
    },
    {
      "text": "P. Desmet. Designing Emotions. PhD thesis, Delft University of Technology, 2002.",
      "doi": ""
    },
    {
      "text": "S. Diefenbach and M. Hassenzahl. The Beauty Dilemma: beauty is valued but discounted in product choice. In Proc. CHI 2009, 1419--1426. ACM, 2009 *.  ",
      "doi": "10.1145/1518701.1518916"
    },
    {
      "text": "J. Forlizzi and K. Battarbee. Understanding experience in interactive systems. In Proc. DIS '04, 261--268. ACM, 2004.  ",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "J. Forlizzi and S. Ford. The building blocks of experience: an early framework for interaction designers. In Proc. DIS '00, 419--423. ACM, 2000.  ",
      "doi": "10.1145/347642.347800"
    },
    {
      "text": "W. Gaver, T. Dunne, and E. Pacenti. Cultural probes. Interactions, 6(1):21--29, 1999.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "S. Gilroy, M. Cavazza, and M. Benayoun. Using affective trajectories to describe states of flow in interactive art. In Proc. ACE '09, 165--172. ACM, 2009 *.  ",
      "doi": "10.1145/1690388.1690416"
    },
    {
      "text": "L. Gong. Is happy better than sad even if they are both non-adaptive? Effects of emotional expressions of talking-head interface agents. Int. Journal of Human-Computer Studies, 65(3):183--191, 2007.  ",
      "doi": "10.1016/j.ijhcs.2006.09.005"
    },
    {
      "text": "W. Gray and M. Salzman. Damaged merchandise? A review of experiments that compare usability evaluation methods. Human-Computer Interaction, 13(3):203--261, 1998.  ",
      "doi": "10.1207/s15327051hci1303_2"
    },
    {
      "text": "J. Hartmann, A. De Angeli, and A. Sutcliffe. Framing the user experience: information biases on website quality judgement. In Proc. CHI '08, 855--864. ACM, 2008 *.  ",
      "doi": "10.1145/1357054.1357190"
    },
    {
      "text": "J. Hartmann, A. Sutcliffe, and A. Angeli. Towards a theory of user judgment of aesthetics and user interface quality. ACM TOCHI, 15(4):1--30, 2008 *.  ",
      "doi": "10.1145/1460355.1460357"
    },
    {
      "text": "M. Hassenzahl. The thing and I: understanding the relationship between user and product. In M. Blythe, C. Overbeeke, A. Monk, and P. Wright, editors, Funology: From Usability to Enjoyment, 31--42. Dordrecht: Kluwer, 2003. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "M. Hassenzahl. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction, 19(4):319--349, 2004.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "M. Hassenzahl. User experience (UX): towards an experiential perspective on product quality. In Proc. IHM '08, 11--15. ACM, 2008.  ",
      "doi": "10.1145/1512714.1512717"
    },
    {
      "text": "M. Hassenzahl, A. Beu, and M. Burmester. Engineering joy. IEEE Software, 18(1):70--76, 2001.  ",
      "doi": "10.1109/52.903170"
    },
    {
      "text": "M. Hassenzahl, S. Diefenbach, and A. G&amp;#246;ritz. Needs, affect, and interactive products -- facets of user experience. Interacting with Computers, 22(5):353--362, 2010.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "M. Hassenzahl and A. Monk. The inference of perceived usability from beauty. Human-Computer Interaction, 25(3):235--260, 2010.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl, A. Platz, M. Burmester, and K. Lehner. Hedonic and ergonomic quality aspects determine a software's appeal. In Proc. CHI '00, 201--208. ACM, 2000.  ",
      "doi": "10.1145/332040.332432"
    },
    {
      "text": "M. Hassenzahl and N. Sandweg. From mental effort to perceived usability: transforming experiences into summary assessments. In Proc. CHI '04, 1283--1286. ACM, 2004.  ",
      "doi": "10.1145/985921.986044"
    },
    {
      "text": "M. Hassenzahl, M. Sch&amp;#246;bel, and T. Trautmann. How motivational orientation influences the evaluation and choice of hedonic and pragmatic interactive products: The role of regulatory focus. Interacting with Computers, 20(4--5):473--479, 2008 *.  ",
      "doi": "10.1016/j.intcom.2008.05.001"
    },
    {
      "text": "M. Hassenzahl and N. Tractinsky. User experience -- a research agenda. Behaviour &amp;#38; Information Technology, 25(2):91--97, 2006.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl and D. Ullrich. To do or not to do: Differences in user experience and retrospective judgments depending on the presence or absence of instrumental goals. Interacting with Computers, 19(4):429--437, 2007 *.  ",
      "doi": "10.1016/j.intcom.2007.05.001"
    },
    {
      "text": "J. Heikkinen, T. Olsson, and K. V\\\"a\\\"an\\\"anen-Vainio-Mattila. Expectations for user experience in haptic communication with mobile devices. In Proc. MobileHCI '09. ACM, 2009 *.  ",
      "doi": "10.1145/1613858.1613895"
    },
    {
      "text": "M. Hertzum. Images of Usability. International Journal of Human-Computer Interaction, 26(6):567--600, 2010.",
      "doi": ""
    },
    {
      "text": "K. Hornb&amp;#230;k. Current practice in measuring usability: Challenges to usability studies and research. International Journal of Human-Computer Studies, 64(2):79--102, 2006.  ",
      "doi": "10.1016/j.ijhcs.2005.06.002"
    },
    {
      "text": "K. Hornb&amp;#230;k. Dogmas in the assessment of usability evaluation methods. Behaviour &amp;#38; Information Technology, 29(1):97--111, 2010.  ",
      "doi": "10.1080/01449290801939400"
    },
    {
      "text": "M. Huang. Web performance scale. Information &amp;#38; Management, 42(6):841--852, 2005. ",
      "doi": "10.5555/1090388.1709322"
    },
    {
      "text": "ISO. 9241--210: Ergonomics of human system interaction-Part 210: Human-centred design for interactive systems. International Organization for Standardization, 2008.",
      "doi": ""
    },
    {
      "text": "M. Isomursu, M. T&amp;#228;hti, S. V&amp;#228;in&amp;#228;m&amp;#246;, and K. Kuutti. Experimental evaluation of five methods for collecting emotions in field settings with mobile applications. International Journal of Human-Computer Studies, 65(4):404--418, 2007 *.  ",
      "doi": "10.1016/j.ijhcs.2006.11.007"
    },
    {
      "text": "S. Jackson and H. Marsh. Development and validation of a scale to measure optimal experience: The Flow State Scale. Journal of Sport and Exercise Psychology, 18:17--35, 1996.",
      "doi": ""
    },
    {
      "text": "S. Jacobson and A. Pirinen. Disabled persons as lead users in the domestic environment. In Proc. DPPI '07, 158--167. ACM, 2007 *.  ",
      "doi": "10.1145/1314161.1314175"
    },
    {
      "text": "P. Jordan. Designing pleasurable products: An introduction to the new human factors. CRC, 2002.",
      "doi": ""
    },
    {
      "text": "S. Jumisko-Pyykk&amp;#246;, M. Weitzel, and D. Strohmeier. Designing for user experience: what to expect from mobile 3d tv and video? In Proc. UXTV '08, 183--192. ACM, 2008 *.  ",
      "doi": "10.1145/1453805.1453841"
    },
    {
      "text": "E. Karapanos, J. Zimmerman, J. Forlizzi, and J. Martens. User experience over time: an initial framework. In Proc. CHI '09, 729--738. ACM, 2009 *.  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "E. Karapanos, J. Zimmerman, J. Forlizzi, and J. Martens. Measuring the Dynamics of Remembered Experience Over Time. Interacting with Computers, 22(5):328--335, 2010.  ",
      "doi": "10.1016/j.intcom.2010.04.003"
    },
    {
      "text": "A. Koca, M. Funk, E. Karapanos, A. Rozinat, and N. van der Gaarden. Grasping product pragmatics: a case with internet on tv. In Proc. UXTV '08, 193--202. ACM, 2008 *.  ",
      "doi": "10.1145/1453805.1453842"
    },
    {
      "text": "P. Kourouthanassis, G. Giaglis, and A. Vrechopoulos. Enhancing user experience through pervasive information systems: The case of pervasive retailing. International Journal of Information Management, 27(5):319--335, 2007 *.  ",
      "doi": "10.1016/j.ijinfomgt.2007.04.005"
    },
    {
      "text": "J. Landis and G. Koch. The measurement of observer agreement for categorical data. Biometrics, 33(1):159--174, 1977.",
      "doi": ""
    },
    {
      "text": "P. J. Lang. Behavioral treatment and bio-behavioral assessment: Computer applications. In J. B. Sidowski, J. H. Johnson, and T. A. Williams, editors, Technology in mental health care delivery systems, 119--137. Ablex Publishing, Norwood, NJ, 1980.",
      "doi": ""
    },
    {
      "text": "M. Lankes, S. Riegler, A. Weiss, T. Mirlacher, M. Pirker, and M. Tscheligi. Facial expressions as game input with different emotional feedback conditions. In Proc. ACE '08, 253--256. ACM, 2008 *.  ",
      "doi": "10.1145/1501750.1501809"
    },
    {
      "text": "T. Lavie and N. Tractinsky. Assessing dimensions of perceived visual aesthetics of web sites. International Journal of Human-Computer Studies, 60(3):269--298, 2004.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "E. Law, V. Roto, M. Hassenzahl, A. Vermeeren, and J. Kort. Understanding, scoping and defining user experience: a survey approach. In Proc. CHI '09, 719--728. ACM, 2009.  ",
      "doi": "10.1145/1518701.1518813"
    },
    {
      "text": "E. Law and P. van Schaik. Modelling user experience -- an agenda for research and practice. Interacting with Computers, 22(5):313--322, 2010.  ",
      "doi": "10.1016/j.intcom.2010.04.006"
    },
    {
      "text": "T. Leong, S. Howard, and F. Vetere. Choice: abidcating or exercising? In Proc. CHI '08, 715--724. ACM, 2008 *.  ",
      "doi": "10.1145/1357054.1357168"
    },
    {
      "text": "A. Lucero, T. Lashina, E. Diederiks, and T. Mattelm\\\"aki. How probes inform and influence the design process. In Proc. DPPI '07, 377--391. ACM, 2007 *.  ",
      "doi": "10.1145/1314161.1314195"
    },
    {
      "text": "S. Mahlke. Aesthetic and Symbolic Qualities as Antecedents of Overall Judgements of Interactive Products. People and Computers XX -- Engage, 57--64, 2007.",
      "doi": ""
    },
    {
      "text": "S. Mahlke and M. Th&amp;#252;ring. Studying antecedents of emotional experiences in interactive contexts. In Proc. CHI '07, 915--918. ACM, 2007 *.  ",
      "doi": "10.1145/1240624.1240762"
    },
    {
      "text": "R. Mandryk, K. Inkpen, and T. Calvert. Using psychophysiological techniques to measure user experience with entertainment techno- logies. Behaviour &amp;#38; Information Technology, 25(2):141--158, 2006 *.",
      "doi": ""
    },
    {
      "text": "N. Mathiasen and S. B&amp;#248;dker. Threats or threads: from usable security to secure experience? In Proc. NordiCHI '08, 283--289. ACM, 2008 *.  ",
      "doi": "10.1145/1463160.1463191"
    },
    {
      "text": "E. McAuley. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting. Research Quarterly for Exercise and Sport, 60(1):48--58, 1989.",
      "doi": ""
    },
    {
      "text": "J. McCarthy and P. Wright. Technology as experience. Interactions, 11(5):43, 2004.  ",
      "doi": "10.1145/1015530.1015549"
    },
    {
      "text": "J. McCarthy, P. Wright, J. Wallace, and A. Dearden. The experience of enchantment in human-computer interaction. Personal and Ubiquitous Computing, 10(6):369--378, 2006.",
      "doi": "10.1007/s00779-005-0055-2"
    },
    {
      "text": "D. McKay, S. Cunningham, and K. Thomson. Exploring the user experience through collage. In Proc. CHINZ '06, 109--115. ACM, 2006 *.  ",
      "doi": "10.1145/1152760.1152774"
    },
    {
      "text": "D. Moher, D. Cook, S. Eastwood, I. Olkin, D. Rennie, and D. Stroup. Improving the quality of reports of meta-analyses of randomised controlled trials: the QUOROM statement. The Lancet, 354:1896--1900, 1999.",
      "doi": ""
    },
    {
      "text": "M. Montola, T. Nummenmaa, A. Lucero, M. Boberg, and H. Korhonen. Applying game achievement systems to enhance user experience in a photo sharing service. In Proc. MindTrek '09, 94--97. ACM, 2009 *.  ",
      "doi": "10.1145/1621841.1621859"
    },
    {
      "text": "M. Moshagen and M. Thielsch. Facets of visual aesthetics. Int. Journal of Human-Computer Studies, 68(10):689--709, 2010.  ",
      "doi": "10.1016/j.ijhcs.2010.05.006"
    },
    {
      "text": "M. N&amp;#237; Chonch&amp;#250;ir and J. McCarthy. The enchanting potential of technology: a dialogical case study of enchantment and the internet. Personal and Ubiquitous Computing, 12(5):401--409, 2008 *.  ",
      "doi": "10.1007/s00779-007-0157-0"
    },
    {
      "text": "D. Norman. Emotional design. Citeseer, 2004.",
      "doi": "10.1145/985600.966013"
    },
    {
      "text": "H. O'Brien and E. Toms. What is user engagement? A conceptual framework for defining user engagement with technology. Journal of the American Society for Information Science and Technology, 59(6):938--955, 2008 *. ",
      "doi": ""
    },
    {
      "text": "H. O'Brien and E. Toms. The development and evaluation of a survey to measure user engagement. Journal of the American Society for Information Science and Technology, 61(1):50--69, 2010. ",
      "doi": "10.5555/1672957.1672978"
    },
    {
      "text": "M. Obrist, A. Meschtscherjakov, and M. Tscheligi. User Experience Evaluation in the Mobile Context. Mobile TV: Customizing Content and Experience, 195--204, 2010.",
      "doi": ""
    },
    {
      "text": "Y. Rogers, K. Connelly, L. Tedesco, W. Hazlewood, A. Kurtz, R. Hall, J. Hursey, and T. Toscos. Why it's worth the hassle: the value of in-situ studies when designing Ubicomp. In Proc. UbiComp '07, 336--353. Springer-Verlag, 2007 *. ",
      "doi": "10.5555/1771592.1771612"
    },
    {
      "text": "P. Ross, C. Overbeeke, S. Wensveen, and C. Hummels. A designerly critique on enchantment. Personal and Ubiquitous Computing, 12(5):359--371, 2008 *.  ",
      "doi": "10.1007/s00779-007-0162-3"
    },
    {
      "text": "K. Scherer. What are emotions? And how can they be measured? Social Science Information, 44(4):695, 2005.",
      "doi": ""
    },
    {
      "text": "D. Smith, C. Irby, R. Kimball, and B. Verplank. Designing the Star user interface. Byte, 7(4):242--282, 1982.",
      "doi": ""
    },
    {
      "text": "X. Sun and A. May. The role of spatial contextual factors in mobile personalization at large sports events. Personal and Ubiquitous Computing, 13(4):293--302, 2009 *.  ",
      "doi": "10.1007/s00779-008-0203-6"
    },
    {
      "text": "A. Sutcliffe. Assessing the reliability of heuristic evaluation for website attractiveness and usability. In Proc. HICSS '02, 1838--1847. IEEE Computer Society, 2002. ",
      "doi": "10.5555/820743.821030"
    },
    {
      "text": "D. Swallow, M. Blythe, and P. Wright. Grounding experience: relating theory and method to evaluate the user experience of smartphones. In Proc. EACE '05, 91--98. ACM, 2005 *. ",
      "doi": "10.5555/1124666.1124679"
    },
    {
      "text": "N. Tractinsky, A. Katz, and D. Ikar. What is beautiful is usable. Interacting with Computers, 13(2):127--145, 2000.",
      "doi": ""
    },
    {
      "text": "A. Tuch, J. Bargas-Avila, and K. Opwis. Symmetry and aesthetics in website design: It's a man's business. Computers in Human Behavior, 26(6):1831--1837, 2010.  ",
      "doi": "10.1016/j.chb.2010.07.016"
    },
    {
      "text": "A. Tuch, J. Bargas-Avila, K. Opwis, and F. Wilhelm. Visual complexity of websites: Effects on users' experience, physiology, performance, and memory. International Journal of Human-Computer Studies, 67(9):703--715, 2009.  ",
      "doi": "10.1016/j.ijhcs.2009.04.002"
    },
    {
      "text": "T. Tullis and W. Albert. Measuring The User Experience: collecting, analyzing, and presenting usability metrics. Morgan Kaufmann, 2008. ",
      "doi": "10.5555/1796012"
    },
    {
      "text": "M. Turunen, A. Kallinen, I. S&amp;#224;nchez, et al. Multimodal interaction with speech and physical touch interface in a media center application. In Proc. ACE '09, 19--26. ACM, 2009 *.  ",
      "doi": "10.1145/1690388.1690392"
    },
    {
      "text": "K. V\\\"a\\\"an\\\"anen-Vainio-Mattila and M. W\\\"aljas. Developing an expert evaluation method for user eXperience of cross-platform web services. In MindTrek '09, 162--169. ACM, 2009 *.  ",
      "doi": "10.1145/1621841.1621871"
    },
    {
      "text": "H. V\\\"a\\\"at\\\"aj\\\"a, T. Koponen, and V. Roto. Developing practical tools for user experience evaluation: a case from mobile news journalism. In Proc. ECCE '09, 1--8. ACM, 2009 *. ",
      "doi": "10.5555/1690508.1690539"
    },
    {
      "text": "K. van Boerdonk, R. Tieben, S. Klooster, and E. van den Hoven. Contact through canvas: an entertaining encounter. Personal and Ubiquitous Computing, 13(8):551--567, 2009 *.  ",
      "doi": "10.1007/s00779-009-0240-9"
    },
    {
      "text": "H. Van der Heijden. User acceptance of hedonic information systems. MIS Quarterly, 28(4):695--704, 2004. ",
      "doi": "10.5555/2017236.2017244"
    },
    {
      "text": "P. van Schaik and J. Ling. Modelling user experience with web sites: Usability, hedonic value, beauty and goodness. Interacting with Computers, 20(3):419--432, 2008 *.  ",
      "doi": "10.1016/j.intcom.2008.03.001"
    },
    {
      "text": "P. van Schaik and J. Ling. The role of context in perceptions of the aesthetics of web pages over time. International Journal of Human-Computer Studies, 67(1):79--89, 2009 *.  ",
      "doi": "10.1016/j.ijhcs.2008.09.012"
    },
    {
      "text": "P. van Schaik and J. Ling. An integrated model of interaction experience for information retrieval in a Web-based encyclopaedia. Interacting with Computers, {in press}, 2010.  ",
      "doi": "10.1016/j.intcom.2010.07.002"
    },
    {
      "text": "R. Wakkary and M. Hatala. ec (h) o: Situated Play in a Tangible and Audio Museum Guide. In Proc. DIS '06, page 290. ACM, 2006 *.  ",
      "doi": "10.1145/1142405.1142448"
    },
    {
      "text": "D. Wilfinger, M. Pirker, R. Bernhaupt, and M. Tscheligi. Evaluating and investigating an iTV interaction concept in the field. In Proc. EuroITV '09, 175--178. ACM, 2009 *.  ",
      "doi": "10.1145/1542084.1542119"
    },
    {
      "text": "P. Wright and M. Blythe. User experience research as an inter- discipline: Towards a UX Manifesto. In Proc. BHCI '07, 65--70, 2007.",
      "doi": ""
    },
    {
      "text": "D. Xu, J. Read, G. Sim, B. McManus, and P. Qualter. Children and 'smart' technologies: can children's experiences be interpreted and coded? In Proc. BCS HCI '09, 224--231. British Computer Society, 2009. ",
      "doi": "10.5555/1671011.1671038"
    }
  ]
}