{
  "doi": "10.1145/1978942.1979410",
  "title": "Topika: integrating collaborative sharing with email",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3161-3164",
  "year": 2011,
  "badges": [],
  "abstract": "New enterprise tools (wikis, team spaces, social tags) offer potential benefits for enterprise collaboration, providing shared resources to organize work. However, a vast amount of collaboration still takes place by email. But email is problematic for collaboration because information may be distributed across multiple messages in an overloaded inbox. Email also increases workload as each individual has to manage their own versions of collaborative materials. We present a novel system, Topika that integrates email with collaboration tools. It allows users to continue to use email while also enjoying the benefits of these dedicated tools. When a user composes an email Topika analyzes the message and suggests relevant shared spaces (e.g., wiki pages) within the user's collaboration tools. This allows her to post the email to those spaces. An evaluation of Topika's suggestion algorithm shows that it performs well at accurately suggesting shared spaces.",
  "authors": [
    {
      "name": "Jalal Mahmud",
      "institution": "IBM Research - Almaden , Almaden, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319496986",
      "orcid": "missing"
    },
    {
      "name": "Tara Matthews",
      "institution": "IBM Research - Almaden , Almaden, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Steve Whittaker",
      "institution": "University of California, Santa Cruz, Santa Cruz, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "Tom Moran",
      "institution": "IBM Research - Almaden , Almaden, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594532",
      "orcid": "missing"
    },
    {
      "name": "Tessa Lau",
      "institution": "IBM Research - Almaden , Almaden, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100206193",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "http://www.ibm.com/software/lotus/connections/",
      "doi": ""
    },
    {
      "text": "http://en.wikipedia.org/wiki/Atom_(standard)",
      "doi": ""
    },
    {
      "text": "Balakrishnan, A., Matthews, T., Moran, T.P. Fitting an activity-centric system into an ecology of workplace tools. In Proc. of CHI 2010, pages 787--790.  ",
      "doi": "10.1145/1753326.1753441"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., Smith, I. Taking email to task: The design and evaluation of a task management centered email tool. Proc of CHI '03. 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Dredze, M., Lau, T., Kushmerick, N. Automatically classifying emails into activities. Proc of IUI '06, 70--77.  ",
      "doi": "10.1145/1111449.1111471"
    },
    {
      "text": "Dredze, M., Brooks, T., Carroll, J., Magarick, J., Blitzer, J., Pereira, F, Intelligent email: reply and attachment predictions. Proc of IUI 2008, 70--77.  ",
      "doi": "10.1145/1378773.1378820"
    },
    {
      "text": "Holtzblatt, L.J., Damianos, L.E., Weiss, D. Factors impeding wiki use in the enterprise: A case study. CSCW Workshop 'SCollective Intelligence in Organizations,'? 2010.",
      "doi": "10.1145/1753846.1754208"
    },
    {
      "text": "McDowell, L., Etzioni, O., Halevy, A., Levy, H. Semantic email. Proc. of WWW '04, 244--\"254.  ",
      "doi": "10.1145/988672.988706"
    },
    {
      "text": "Nelson, L., Nairn, R., Chi E.H. Mail2Tag: Efficient targeting of news in an organization. CSCW Workshop 'Collective Intelligence in Organizations,'? 2010.",
      "doi": ""
    },
    {
      "text": "Pazzani, M. J, Representation of electronic mail filtering profiles: A user study. Proc. of IUI '00, 202--206.  ",
      "doi": "10.1145/325737.325843"
    },
    {
      "text": "Salton, G., Wong, A., Yang, C.S. A vector space model for automatic indexing. Comm. of the ACM, 18(11): 613--620, 1975.  ",
      "doi": "10.1145/361219.361220"
    },
    {
      "text": "Segal, R.B., Kephart, J.O. Mailcat: An intelligent assistant for organizing e-mail. Proc. of AAAI '99, 276--282.  ",
      "doi": "10.1145/301136.301209"
    },
    {
      "text": "Tang, John C., James Lin, Jeffrey S. Pierce, Steve Whittaker, and Clemens Drews, 'Recent Shortcuts: Using Recent Interactions to Support Shared Activities', CHI 2007, San Jose, CA, pp. 1263--1272.  ",
      "doi": "10.1145/1240624.1240816"
    },
    {
      "text": "Whittaker, S., Sidner, C. Email overload: Exploring personal information management of email. Proc. of CHI '96, 276--283.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Yarosh, S., Matthews, T., Moran, T., Smith, B. What is an activity? Appropriating an activity-centric system. In Proc of INTERACT 2009, pages 582--595.  ",
      "doi": "10.1007/978-3-642-03658-3_62"
    }
  ]
}