{
  "doi": "10.1145/1978942.1979014",
  "title": "What did i miss?: in-meeting review using multimodal accelerated instant replay (air) conferencing",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "513-522",
  "year": 2011,
  "badges": [],
  "abstract": "People sometimes miss small parts of meetings and need to quickly catch up without disrupting the rest of the meeting. We developed an Accelerated Instant Replay (AIR) Conferencing system for videoconferencing that enables users to catch up on missed content while the meeting is ongoing. AIR can replay parts of the conference using four different modalities: audio, video, conversation transcript, and shared workspace. We performed two studies to evaluate the system. The first study explored the benefit of AIR catch-up during a live meeting. The results showed that when the full videoconference was reviewed (i.e., all four modalities) at an accelerated rate, users were able to correctly recall a similar amount of information as when listening live. To better understand the benefit of full review, a follow-up study more closely examined the benefits of each of the individual modalities. The results show that users (a) preferred using audio along with any other modality to using audio alone, (b) were most confident and performed best when audio was reviewed with all other modalities, (c) compared to audio-only, had better recall of facts and explanations when reviewing audio together with the shared workspace and transcript modalities, respectively, and (d) performed similarly with audio-only and audio with video review.",
  "tags": [
    "shared workspace",
    "cscw",
    "transcript",
    "videoconferencing",
    "review",
    "telepresence",
    "audio",
    "video",
    "meetings",
    "dvr"
  ],
  "authors": [
    {
      "name": "Sasa Junuzovic",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81320490942/rel-imgonly/chelan3.jpg",
      "acmid": "81320490942",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Rajesh Hegde",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660144803",
      "orcid": "missing"
    },
    {
      "name": "Zhengyou Zhang",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659869080",
      "orcid": "missing"
    },
    {
      "name": "John Tang",
      "institution": "Microsoft Research, Mountain View, California, USA",
      "img": "/do/10.1145/contrib-81405592014/rel-imgonly/johntang_v2_cropped.jpg",
      "acmid": "81405592014",
      "orcid": "0000-0003-0603-3877"
    },
    {
      "name": "Christopher Brooks",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100076780",
      "orcid": "0000-0003-0875-0204"
    }
  ],
  "references": [
    {
      "text": "Christel, M. Evaluation and user studies with respect to video summarization and browsing. Symposium on Eletronic Imaging 2006, 17--19.",
      "doi": ""
    },
    {
      "text": "Cutler, R., Rui, Y., Gupta, A., Cadiz, J. J., Tashev, I., He, L. Colburn, A. Zhang, Z., Liu, Z. Silverberg, S. Distributed meetings: A meeting capture and broadcasting system. ACM Multimedia 2002, 503--512.  ",
      "doi": "10.1145/641007.641112"
    },
    {
      "text": "Dietz., P. H., and Yerazunis, W. S. Real-time audio buffering for telephone applications. ACM UIST 2001, 93--94.  ",
      "doi": "10.1145/502348.502383"
    },
    {
      "text": "He, L., Sanocki, E., Gupta, A., and Grudin, J. Auto-summarization of audio-video presentations. ACM Multimedia 1999, 489--498.  ",
      "doi": "10.1145/319463.319691"
    },
    {
      "text": "Inkpen, K., Hegde, R., Junuzovic, S., Brooks, C., Tang, J., and Zhang, Z. AIR Conferencing: Accelerated instant replay for in-meeting multimodal review. ACM Multimedia 2010. 663--666.  ",
      "doi": "10.1145/1873951.1874046"
    },
    {
      "text": "Kazman, R., Al-Halimi, R., Hunt, W., and Mantei, M. Four Paradigms for Indexing Video Conferences. IEEE Multimedia 3,1 (1996), 63--73.  ",
      "doi": "10.1109/93.486705"
    },
    {
      "text": "Meetings in America V: meeting of the minds. https://e-meetings.verizonbusiness.com/global/en/meetingsinamerica/uswhitepaper.php (2003).",
      "doi": ""
    },
    {
      "text": "Money, A. G., and Agius, H. Video summarization: A conceptual framework and survey of the state of the art. Journal of Visual Communication and Image Recognition 19 (2008), 121--143.  ",
      "doi": "10.1016/j.jvcir.2007.04.002"
    },
    {
      "text": "Moran, T., Palen, L., Harrison, S., Chiu, P., Kimber, D., Minneman, S., van Melle, W., and Zellweger, P. I'll get that off the audio: A case study of salvaging multimedia meeting records. ACM CHI 1997, 202--209.  ",
      "doi": "10.1145/258549.258704"
    },
    {
      "text": "Omoigui, N., He, L., Gupta, A., Grudin, J., and Sanocki, E. Time-compression: Systems concerns, usage, and benefits. ACM CHI 1999, 136--143.  ",
      "doi": "10.1145/302979.303017"
    },
    {
      "text": "Orr, D. B. A perspective on the perception of time compressed speech. In P. M. Kjeldergaard, D. L. Horton, & J. J. Jenkins, (Eds.) Perception of Language, 108--119, Merrill, 1971.",
      "doi": ""
    },
    {
      "text": "Ranjan, A., Birnholtz, J. and Balakrishnan, R. Improving Meeting Capture by Applying Television Production Principles with Audio and Motion Detection. ACM CHI 2008, 227--236.  ",
      "doi": "10.1145/1357054.1357095"
    },
    {
      "text": "Tucker, S., and Whittaker, S. Accessing Multimodal Meeting Data: Systems, Problems, and Possibilities. Workshop on Multimodal Interaction and Related Machine Learning Algorithms, 2004.  ",
      "doi": "10.1007/978-3-540-30568-2_1"
    },
    {
      "text": "Tucker, S., Bergman, O., Ramoorthy, A., and Whittaker, S. Catchup: A useful application of time-travel in meetings. ACM CSCW 2010.  ",
      "doi": "10.1145/1718918.1718937"
    },
    {
      "text": "Wildemuth, B., Marchionini, G., Yang, M., Geisler, G., Wilkens, T., Hughes, A., Gruss, R. How fast is too fast? Evaluating fast forward surrogates for digital video. ACM/IEEE-CS Digital Libraries 2003, 221--230. ",
      "doi": "10.5555/827140.827176"
    }
  ]
}