{
  "doi": "10.1145/1978942.1978984",
  "title": "Knowing funny: genre perception and categorization in social video sharing",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "297-306",
  "year": 2011,
  "badges": [],
  "abstract": "Categorization of online videos is often treated as a tag suggestion task; tags can be generated by individuals or by machine classification. In this paper, we suggest categorization can be determined socially, based on people's interactions around media content without recourse to metadata that are intrinsic to the media object itself. This work bridges the gap between the human perception of genre and automatic categorization of genre in classifying online videos. We present findings from two internet surveys and from follow-up interviews where we address how people determine genre classification for videos and how social framing of video content can alter the perception and categorization of that content. From these findings, we train a Naive Bayes classifier to predict genre categories. The trained classifier achieved 82% accuracy using only social action data, without the use of content or media-specific metadata. We conclude with implications on how we categorize and organize media online as well as what our findings mean for designing and building future tools and interaction experiences.",
  "authors": [
    {
      "name": "Jude Yew",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/do/10.1145/contrib-81317490074/rel-imgonly/judeyew4.jpg",
      "acmid": "81317490074",
      "orcid": "missing"
    },
    {
      "name": "David A. Shamma",
      "institution": "Yahoo! Research, Santa Clara, California, USA",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    },
    {
      "name": "Elizabeth F. Churchill",
      "institution": "Yahoo! Research, Santa Clara, California, USA",
      "img": "/do/10.1145/contrib-81100143170/rel-imgonly/elizabethchurchill.jpeg",
      "acmid": "81100143170",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bawarshi, A. The Ecology of Genre. Ecocomposition: theoretical and pedagogical approaches (2001), 69--80.",
      "doi": ""
    },
    {
      "text": "Bowker, G. C., and Star, S. L. Sorting Things Out: Classification and Its Consequences. Inside technology. The MIT Press, October 1999. ",
      "doi": "10.5555/380681"
    },
    {
      "text": "Cesar, P., Geerts, D., and Chorianopoulos, K. Social Interactive Television: Immersive Shared Experiences and Perspectives. Information Science Reference, 2009.",
      "doi": ""
    },
    {
      "text": "Chen, Z., Cao, J., Song, Y., Guo, J., Zhang, Y., and Li, J. Context-oriented web video tag recommendation. In WWW '10: Proceedings of the 19th international conference on World wide web, ACM (New York, NY, USA, 2010), 1079--1080.  ",
      "doi": "10.1145/1772690.1772813"
    },
    {
      "text": "Cooper, M. M. The ecology of writing. College English 48, 4 (1986), 364--375.",
      "doi": ""
    },
    {
      "text": "Crane, R., and Sornette, D. Viral, quality, and junk videos on youtube: Separating content from noise in an information-rich environment. In Proc. of AAAI symposium on Social Information Processing, Menlo Park, CA (2008).",
      "doi": ""
    },
    {
      "text": "Erzberger, C., and Kelle, U. Making inferences in mixed methods: The rules of integration. Handbook of mixed methods in social and behavioral research (2003), 457--488.",
      "doi": ""
    },
    {
      "text": "H&amp;#246;lbling, G., Thalhammer, A., and Kosch, H. Content-based tag generation to enable a tag-based collaborative tv-recommendation system. In EuroITV '10: Proceedings of the 8th international interactive conference on Interactive TV &amp;#38; Video, ACM (New York, NY, USA, 2010), 273--282.  ",
      "doi": "10.1145/1809777.1809832"
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with mechanical turk. In CHI '08: Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM (New York, NY, USA, 2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Krippendorff, K. Content analysis: An introduction to its methodology. Sage Publications, Inc, 2004.",
      "doi": ""
    },
    {
      "text": "Lakoff, G. Women, Fire, and Dangerous Things. University Of Chicago Press, April 1990.",
      "doi": ""
    },
    {
      "text": "Liu, Y., Shamma, D. A., Shafton, P., and Yang, J. Zync: the design of sychnronized video sharing. In DUX 2007: Proceeding of the 3rd conference on Designing for User Experience (Chicago, IL, USA, November 2007).  ",
      "doi": "10.1145/1389908.1389924"
    },
    {
      "text": "Mahajan, D., and Slaney, M. Image classification using the web graph. In Proceedings of the International Conference on Multi-Media, ACM (2010).  ",
      "doi": "10.1145/1873951.1874131"
    },
    {
      "text": "Miller, C. Genre as social action. Quarterly journal of speech 70, 2 (1984), 151--167.",
      "doi": ""
    },
    {
      "text": "Naaman, M., and Nair, R. Zonetag's collaborative tag suggestions: What is this person doing in my phone? IEEE MultiMedia 15, 3 (2008), 34--40.  ",
      "doi": "10.1109/MMUL.2008.69"
    },
    {
      "text": "Roach, M., and Mason, J. Recent trends in video analysis: A taxonomy of video classification problems. In In Proceedings of the International Conference on Internet and Multimedia Systems and Applications, IASTED (2002), 348--354.",
      "doi": ""
    },
    {
      "text": "Salton, G., Wong, A., and Yang, C. S. A vector space model for automatic indexing. Communcations of the ACM 18 (1975), 613--620.  ",
      "doi": "10.1145/361219.361220"
    },
    {
      "text": "Scully, M. Marge be not proud. In The Simpsons, 3F07. FOX, December 1995.",
      "doi": ""
    },
    {
      "text": "Sen, S., Lam, S. K., Rashid, A. M., Cosley, D., Frankowski, D., Osterhouse, J., Harper, F. M., and Riedl, J. tagging, communities, vocabulary, evolution. In CSCW '06: Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, ACM (New York, NY, USA, 2006), 181--190.  ",
      "doi": "10.1145/1180875.1180904"
    },
    {
      "text": "Shamma, D. A., and Liu, Y. Social Interactive Television: Immersive Shared Experiences and Perspectives. Information Science Publishing, Hershey, PA, USA, 2009, ch. Zync with Me: Synchronized Sharing of Video through Instant Messaging, 273--288.",
      "doi": ""
    },
    {
      "text": "Slaney, M., and White, W. Similarity based on rating data. In Proc. of Int. Symposium on Music Information Retrieval, Citeseer (2007).",
      "doi": ""
    },
    {
      "text": "Weinberger, K. Q., Slaney, M., and Van Zwol, R. Resolving tag ambiguity. In MM '08: Proceeding of the 16th ACM international conference on Multimedia, ACM (New York, NY, USA, 2008), 111--120.  ",
      "doi": "10.1145/1459359.1459375"
    },
    {
      "text": "Weisz, J. D., Kiesler, S., Zhang, H., Ren, Y., Kraut, R. E., and Konstan, J. A. Watching together: integrating text chat with video. In CHI '07: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM Press (New York, NY, USA, 2007), 877--886.  ",
      "doi": "10.1145/1240624.1240756"
    },
    {
      "text": "Wesler, H. T., Smith, M., Fisher, D., and Gleave, E. Distilling digital traces: Computational social science approaches to studying the internet. In The Sage handbook of online research methods, N. Fielding, R. M. Lee, and G. Blank, Eds. Sage, London, 2008, 116--140.",
      "doi": ""
    },
    {
      "text": "Whitman, B., and Ellis, D. Automatic record reviews. In ISMIR (2004).",
      "doi": ""
    },
    {
      "text": "Yew, J., and Shamma, D. A. Know your data: Understanding implicit usage versus explicit action in video content classification. In IS&amp;#38;T/SPIE Electronic Imaging (January 2011).",
      "doi": ""
    },
    {
      "text": "Zhang, N., Zhang, Y., and Tang, J. A tag recommendation system for folksonomy. In SWSM '09: Proceeding of the 2nd ACM workshop on Social web search and mining, ACM (New York, NY, USA, 2009), 9--16.  ",
      "doi": "10.1145/1651437.1651440"
    }
  ]
}