{
  "doi": "10.1145/1978942.1979338",
  "title": "Diminishing returns?: revisiting perception of computing performance",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2703-2706",
  "year": 2011,
  "badges": [],
  "abstract": "The computing performance literature offers guidelines and frameworks, but data on the limits of user appreciation for performance are scarce. This paper presents a study of user satisfaction with different levels of computing performance. Thirty-five participants performed common computing tasks such as creating email and Web surfing. They rated computing performance for specific task elements - such as application launching and menu responsiveness - that occurred during those tasks. They repeated the tasks under varying levels of computer performance. Results include user ratings as a function of computing performance for each of the task elements. The results have implications for system designers who create products that must meet user expectations for performance.",
  "authors": [
    {
      "name": "Glen Anderson",
      "institution": "Intel Corporation, Hillsboro, Oregon, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414612167",
      "orcid": "missing"
    },
    {
      "name": "Rina Doherty",
      "institution": "Intel Corporation, Hillsboro, Oregon, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645752",
      "orcid": "missing"
    },
    {
      "name": "Eric Baugh",
      "institution": "Intel Corporation, Hillsboro, Oregon, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336487780",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Miller, R. B. Response time in man-computer conversational transactions. Proc. AFIPS Fall Joint Computer Conf, Vol. 33 (1968), 267--277.  ",
      "doi": "10.1145/1476589.1476628"
    },
    {
      "text": "Shneiderman, B. Response Time and Display Rate in Human Performance with Computers. ACM Computing Surveys, 16, 4 (1984), 265--285.  ",
      "doi": "10.1145/2514.2517"
    },
    {
      "text": "Department of Defense. Design Criteria Standard: Human Engineering; MIL-STD-1472F (1999).",
      "doi": ""
    },
    {
      "text": "Smith, S. L. and Mosier, J. N. Guidelines for Designing User Interface Software. Report ESD-TR-86-278, The MITRE Corporation, Bedford, MA, 1986.",
      "doi": ""
    },
    {
      "text": "Forrester Consulting. eCommerce Web Site Performance Today: An Updated Look At Consumer Reaction To A Poor Online Shopping Experience. A commissioned study conducted by Forrester Consulting on behalf of Akamai Technologies, Inc., August, 2009.",
      "doi": ""
    },
    {
      "text": "Weinberg, S. M. Learning effectiveness: The impact of response time. Presentation at May 1981 Conference, Control Data Corporation, Minneapolis, MN., 1981 (as reported in Shneiderman, B., 1984).",
      "doi": ""
    },
    {
      "text": "Brown, S. W. Time and attention: Review of the literature. In S. Grondin (Ed.), Psychology of time, pp. 111--138. Bingley, U.K.: Emerald Group, 2008.",
      "doi": ""
    },
    {
      "text": "S. C. Seow. Designing and Engineering Time: The Psychology of Time Perception in Software, Addison-Wesley Professional, 2008. ",
      "doi": "10.5555/1377538"
    },
    {
      "text": "Weber, E. H. The sense of touch (H. E. Ross &amp;#38; D. J. Murray, Trans.). London: Academic Press, 1978 (Original work published 1834).",
      "doi": ""
    },
    {
      "text": "Card, S. K., Robertson, G. G., and Mackinlay, J. D. The information visualizer: An information workspace. Proc. CHI '91, 1991, 181--188.  ",
      "doi": "10.1145/108844.108874"
    },
    {
      "text": "J. Dabrowski and E. V. Munson. Is 100 Milliseconds Too Fast? Proc CHI 2001, Extended Abstracts, (2001), 317--318.  ",
      "doi": "10.1145/634067.634255"
    }
  ]
}