{
  "doi": "10.1145/1978942.1978961",
  "title": "Reflexivity in digital anthropology",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "123-132",
  "year": 2011,
  "badges": [],
  "abstract": "There are a variety of forms of ethnography inside and outside HCI each with valid complementary contributions. This paper looks at the practices of digital anthropology and how it contributes to reflexive design in HCI. The paper overviews key aspects its use in HCI, as well as in the anthropological approach. In doing so it relates these practices to participatory design and the socio-technical gap, and the ways ethnography can address them.",
  "tags": [
    "participant-observation",
    "rapport",
    "iterative",
    "ethnography"
  ],
  "authors": [
    {
      "name": "Jennifer A. Rode",
      "institution": "Drexel University, Philadelphia, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100618309",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. 2000. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human-Computer Interaction, 15, p179--203.  ",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Anderson, R. 1994. Representation and Requirements: The Value of Ethnography in System Design. Human-Comp. Interact., 9(2),151--82.  ",
      "doi": "10.1207/s15327051hci0902_1"
    },
    {
      "text": "Bell, G. No More SMS from Jesus: Ubicomp, Religion and Techno-spiritual Practices. Proc. of Ubicomp 05, p141--158.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Bell, G., Blythe, M., and Sengers, P. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Trans. on CHI 12(2), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "B&amp;#246;dker, S.. 2006. When second wave HCI meets third wave challenges. In Proc Nordchi 06, p1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Boelstorff, T. 2008. Coming of Age in Second Life: an Anthropologist Explores the Virtual Human. Princeton, NJ: Princeton UP. ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Bhaskar, R.A., 1975. A Realist Theory of Science, London: Verso.",
      "doi": ""
    },
    {
      "text": "Blomberg, J., Giacomi, J., Mosher, A., &amp;#38; Swenton-Wall, P. 1993. Ethnographic field methods and their relation to design. In D. Schuler &amp;#38; A. Namioka (Eds.), Participatory design: Perspectives on systems design. 123--54. NJ: LAE P.",
      "doi": ""
    },
    {
      "text": "Burawoy, M. 1998. The Extended Case Method. Sociological Theory. 16:1, p4--33.",
      "doi": ""
    },
    {
      "text": "Button, G. 2000. The Ethnographic Tradition and Design. Design Studies, 21, p319--332.",
      "doi": ""
    },
    {
      "text": "1Clifford, C. 1983. On Ethnographic Authority. Representations, 2, p118--146.",
      "doi": ""
    },
    {
      "text": "Clifford, J. 1981. On Ethnographic Surrealism. Comparative Studies in Society and History. 23, p539--64.",
      "doi": ""
    },
    {
      "text": "Clifford, J. and Marcus, G. 1986. Writing Culture: The Poetics and Politics of Ethnography. Berkeley, CA: U. of California P.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., T, Hemmings, and T. Rodden. 2003. The Social Construction of Displays; Cordinate Displays and Ecologically Distributed Networks In K. O'Hara, et al (Eds.) In Public and situated displays: social and interactional aspects of shared. Netherlands: Kluwer. p170--190.",
      "doi": ""
    },
    {
      "text": "Dourish, P. 2007. Responsibilities and implications: further thoughts on ethnography and design. In Proc. DUX '07, p2--16.  ",
      "doi": "10.1145/1389908.1389941"
    },
    {
      "text": "Dourish, P. 2006. Implications for design. In Proc. ACM Conf. Human Factors in Computing Systems CHI' 06, p541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Easthope, A., and Kate McGowan, eds. 2004. A Critical and Cultural Theory Reader. 2nd Edition. London: U of Toronto.",
      "doi": ""
    },
    {
      "text": "Frankenberg, R. 2004. Living Spirit, Living Practice. Durham: Duke.",
      "doi": ""
    },
    {
      "text": "Forsythe, D. E. 1999. It's Just a Matter of Common Sense: Ethnography as Invisible Work. Computer Supported Coop. Work, 8(1--2), 1p 27--145.  ",
      "doi": "10.1023/A%3A1008692231284"
    },
    {
      "text": "Geertz, C. 1988. Works and Lives: The Anthropologist as Author. Stanford, CA: Stanford UP.",
      "doi": ""
    },
    {
      "text": "2Geertz, C. 1973. The Interpretation Of Cultures. New York: Basic.",
      "doi": ""
    },
    {
      "text": "2Greenberg, S. and Buxton, B. (2008) Usability evaluation considered harmful. Proc. CHI' 08, p111--20.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Ito, M, Baumer, S. &amp;#38; et al. (forthcoming). Hanging Out, Messing Around, Geeking Out: Living and Learning with New Media. Cambridge: MIT Press. ",
      "doi": "10.5555/1822783"
    },
    {
      "text": "Kelty, C. 2008. Two Bits: The Cultural Significance of Free Software. Durham NC: Duke UP. ",
      "doi": "10.5555/1481673"
    },
    {
      "text": "Makkreel, R. A. 1993. Dilthey: Philosopher of the Human Studies. Princeton: Princeton University P.",
      "doi": ""
    },
    {
      "text": "Malaby. T 2009 Making Virtual Worlds: Linden Lab and Second Life. Ithaca, NY: Cornell UP.",
      "doi": ""
    },
    {
      "text": "March, W. and Fleuriot, C. 2006. Girls, technology and privacy: \"is my mother listening?\". Proc. CHI' 06, p107--10.  ",
      "doi": "10.1145/1124772.1124790"
    },
    {
      "text": "Marcus, G. and Fischer, M. 1986. Anthropology as Cultural Critique: An Experimental Moment in the Social Sciences. Chicago UP.",
      "doi": ""
    },
    {
      "text": "Masayuki Hamabata, Matthews. 1991. Crested Kimono: Power and Love in the Japanese Business Family. Ithaca, NY: Cornell UP.",
      "doi": ""
    },
    {
      "text": "Miller, D. In preparation The Digital and the Human; A Prospectus for Digital Anthropology.",
      "doi": ""
    },
    {
      "text": "3Miller, D. and Slater, D. 2000. The Internet: An Ethnographic Approach. Oxford: Berg.",
      "doi": ""
    },
    {
      "text": "3Newman, W. 2009. The Status of Ethnography in Systems Design. Panel CHI'09, (Boston, MA). New York: ACM.",
      "doi": ""
    },
    {
      "text": "3Park, J., Blythe, M., Monk, A., and Grayson, D. 2006. Sharable digital TV: relating ethnography to design through un-useless product suggestions. Proc. CHI' 06, p1199--1204.  ",
      "doi": "10.1145/1125451.1125676"
    },
    {
      "text": "Rode, J.. 2008. An Ethnographic Examination of the Relationship of Gender &amp;#38; End-User Programming. PhD Dissertation. ",
      "doi": "10.5555/1467423"
    },
    {
      "text": "Rode, J., M. Stringer, E. Toye, A. Simpson, and A. Blackwell. 2003. Curriculum-Focused Design. Interaction Design and Children 2003, (Preston, UK), 119--26.  ",
      "doi": "10.1145/953536.953553"
    },
    {
      "text": "Salvador, T., Bell G. &amp;#38; Anderson K. 1999. Design ethnography. Design Management Journal 10(4).",
      "doi": ""
    },
    {
      "text": "3Sengers, P., K. Boehner, S. David, and J.J. Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05), O. Bertelsen, N. Bouvin, P.. Krogh, and M. Kyng (Eds.). ACM, NY NY, USA, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "3Taylor, A. S. and Swan, L. 2005. Artful systems in the home. Proc. ACM Conf. Human Factors in Computing Systems CHI' 05, (Portland, OR), 641--650. New York: ACM.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "3Tong, R. P. (1998). Feminist Thought: A More Comprehensive Introduction. Boulder, Westview P.",
      "doi": ""
    },
    {
      "text": "40.Van Maanen, J. 1998. Tales of the Field; On Writing Ethnography. Chicago: Chicago UP.",
      "doi": ""
    },
    {
      "text": "4Wajcman, J. From women and technology to gendered technoscience. Information, Communication, and Society 10, 3 (2007), 287--298.",
      "doi": ""
    },
    {
      "text": "4Williams, A., Anderson, K., and Dourish, P. 2008. Anchored mobilities: mobile technology and transnational migration. In Proc. DIS '08, p323--332.  ",
      "doi": "10.1145/1394445.1394480"
    },
    {
      "text": "4Williams, A. M. and Irani, L. 2010. There's methodology in the madness: toward critical HCI ethnography. Proc. CHI '10 Extended Abstracts, p2725--2734.  ",
      "doi": "10.1145/1753846.1753857"
    },
    {
      "text": "4Woodward, S. 2007. Why Women Wear What they Wear. Oxford: Berg.",
      "doi": ""
    },
    {
      "text": "4Wyche, S. P., Medynskiy, Y., and Grinter, R. E. 2007. Exploring the use of large displays in American megachurches. Proc. CHI' 07, p2771--2776..  ",
      "doi": "10.1145/1240866.1241077"
    }
  ]
}