{
  "doi": "10.1145/1978942.1978971",
  "title": "User-defined motion gestures for mobile interaction",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "197-206",
  "year": 2011,
  "badges": [],
  "abstract": "Modern smartphones contain sophisticated sensors to monitor three-dimensional movement of the device. These sensors permit devices to recognize motion gestures - deliberate movements of the device by end-users to invoke commands. However, little is known about best-practices in motion gesture design for the mobile computing paradigm. To address this issue, we present the results of a guessability study that elicits end-user motion gestures to invoke commands on a smartphone device. We demonstrate that consensus exists among our participants on parameters of movement and on mappings of motion gestures onto commands. We use this consensus to develop a taxonomy for motion gestures and to specify an end-user inspired motion gesture set. We highlight the implications of this work to the design of smartphone applications and hardware. Finally, we argue that our results influence best practices in design for all gestural interfaces.",
  "authors": [
    {
      "name": "Jaime Ruiz",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/do/10.1145/contrib-81341495915/rel-imgonly/jgruiz.jpg",
      "acmid": "81341495915",
      "orcid": "missing"
    },
    {
      "name": "Yang Li",
      "institution": "Google Research, Mountain View, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo, Waterloo, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    }
  ],
  "references": [
    {
      "text": "Android Open Source Project. Google Inc.",
      "doi": ""
    },
    {
      "text": "Etch A Sketch. Ohio Art.",
      "doi": ""
    },
    {
      "text": "Ashbrook, D. and Starner, T. MAGIC: A Motion Gesture Design Tool. Proceedings of CHI '10, ACM (2010) 2159--2168.  ",
      "doi": "10.1145/1753326.1753653"
    },
    {
      "text": "Bartlett, J. F. Rock 'n' Scroll Is Here to Stay. IEEE Comput. Graph. Appl. 20, 3 (2000), 40--45.  ",
      "doi": "10.1109/38.844371"
    },
    {
      "text": "Good, M. D., Whiteside, J. A., Wixon, D. R., and Jones, S. J. Building a user-derived interface. Communications of the ACM 27, 10 (1984), 1032--1043.  ",
      "doi": "10.1145/358274.358284"
    },
    {
      "text": "Harrison, B. L., Fishkin, K. P., Gujar, A., Mochon, C., and Want, R. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. Proceedings of CHI '98, ACM Press/Addison-Wesley Publishing Co. (1998), 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Harrison, C. and Hudson, S. E. Scratch input. Proceedings of UIST '08, (2008), 205.",
      "doi": "10.1145/1449715.1449747"
    },
    {
      "text": "Hartmann, B., Abdulla, L., Mittal, M., and Klemmer, S. R. Authoring sensor-based interactions by demonstration with direct manipulation and pattern recognition. Proceedings of CHI '07, (2007), 145.  ",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Hinckley, K., Pierce, J., Sinclair, M., and Horvitz, E. Sensing techniques for mobile interaction. Proceedings of UIST '00. ACM (2000), 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Hutchins, E., Hollan, J., and Norman, D. Direct Manipulation Interfaces. Human-Computer Interact 1, 4 (1985), 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Jones, E., Alexander, J., Andreou, A., Irani, P., and Subramanian, S. GesText: Accelerometer-based Gestural Text-Entry Systems. Proceedings of CHI '10, (2010).  ",
      "doi": "10.1145/1753326.1753655"
    },
    {
      "text": "Liu, J., Zhong, L., Wickramasuriya, J., and Vasudevan, V. User evaluation of lightweight user authentication with a single tri-axis accelerometer. Proceedings of MobileHCI '09. ACM (2009), 1--10.  ",
      "doi": "10.1145/1613858.1613878"
    },
    {
      "text": "Mignot, C., Valot, C., and Carbonell, N. An experimental study of future \"natural\" multimodal human-computer interaction. Proceddings of INTERACT '93 and CHI '93. (1993), 67--68.  ",
      "doi": "10.1145/259964.260075"
    },
    {
      "text": "Montero, C. S., Alexander, J., Marshall, M. T., and Subramanian, S. Would you do that? Proceedings of MobileHCI '10, (2010), 275.",
      "doi": "10.1145/1851600.1851647"
    },
    {
      "text": "Morris, M. R., Huang, A., Paepcke, A., and Winograd, T. Cooperative gestures. Proceedings of CHI '06, (2006), 1201.",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Morris, M. R., Wobbrock, J. O., and Wilson, A. D. Understanding users' preferences for surface gestures. Proceedings of GI 2010, CIPS (2010), 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Partridge, K., Chatterjee, S., Sazawal, V., Borriello, G., and Want, R. TiltType: accelerometer-supported text entry for very small devices. Proc. UIST '02, ACM (2002), 201--204.  ",
      "doi": "10.1145/571985.572013"
    },
    {
      "text": "Rekimoto, J. Tilting operations for small screen interfaces. Proceedings of UIST '96, ACM (1996), 167--168.  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Rico, J. and Brewster, S. Usable gestures for mobile interfaces: evaluating social acceptability. Proceedings of CHI '10, ACM (2010), 887--896.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Ruiz, J. and Li, Y. DoubleFlip: A Motion Gesture for Mobile Interaction. Proceedings of CHI '11, ACM (2011).  ",
      "doi": "10.1145/1978942.1979341"
    },
    {
      "text": "Schuler, D. Participatory design : principles and practices. L. Erlbaum Associates, Hillsdale N.J., 1993. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Small, D. and Ishii, H. Design of spatially aware graspable displays. CHI '97 extended abstracts, ACM (1997), 367--368.  ",
      "doi": "10.1145/1120212.1120437"
    },
    {
      "text": "Tang, J. Findings from observational studies of collaborative work. International Journal of Man-Machine Studies 34, 2 (1991), 143--160.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "Voida, S., Podlaseck, M., Kjeldsen, R., and Pinhanez, C. A study on the manipulation of 2D objects in a projector/camera-based augmented reality environment. Proceedings of CHI '05, (2005), 611.  ",
      "doi": "10.1145/1054972.1055056"
    },
    {
      "text": "Weberg, L., Brange, T., and Hansson, W. A piece of butter on the PDA display. CHI '01 extended abstracts, ACM (2001), 435--436.  ",
      "doi": "10.1145/634067.634320"
    },
    {
      "text": "Wigdor, D. and Balakrishnan, R. TiltText: using tilt for text input to mobile phones. Proc UIST '03, ACM (2003), 81--90.  ",
      "doi": "10.1145/964696.964705"
    },
    {
      "text": "Wobbrock, J. O., Aung, H. H., Rothrock, B., and Myers, B. A. Maximizing the guessability of symbolic input. CHI '05 extended abstracts, (2005), 1869.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. Proceedings of CHI '09, (2009), 1083.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wu, M., Chia Shen, Ryall, K., Forlines, C., and Balakrishnan, R. Gesture Registration, Relaxation, and Reuse for Multi-Point Direct-Touch Surfaces. Proceedings of TABLETOP '06, 185--192.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    },
    {
      "text": "Yee, K. Peephole displays. Proceedings of CHI '03, ACM (2003), 1--8.  ",
      "doi": "10.1145/642611.642613"
    }
  ]
}