{
  "doi": "10.1145/1978942.1978951",
  "title": "Hands on hitchcock: embodied reference to a moving scene",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "43-52",
  "year": 2011,
  "badges": [],
  "abstract": "In this paper we report on some experiments with a high fidelity media space, t-Room, an immersive system that presents full scale, real-time images of co-participants who are in similar spaces many miles apart. Although being designed to provide a coherent environment for interaction the system introduces a number of incongruities, both in time and space. Drawing on some quasi-naturalistic experiments, where the participants were required to analyse complex data, we consider how the participants manage these incongruities. We conclude by briefly discussing the resources people utilize to produce and recognize conduct in embodied spaces.",
  "authors": [
    {
      "name": "Paul Luff",
      "institution": "King's College, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100229533",
      "orcid": "missing"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Laboratories, Kyoto, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba, Tsukuba, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Christian Heath",
      "institution": "King's College, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100164455",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Broughton, M., et al. Being here: designing for distributed hands-on collaboration in blended interaction spaces. in Proc OZCHI 2009. 73--80.  ",
      "doi": "10.1145/1738826.1738839"
    },
    {
      "text": "Buckingham Shum, S., et al., Memetic: An Infrastructure for Meeting Memory, in Proc of Conf. Design of Cooperative Systems COOP 2006: Carry-le-Rouet, France. 71--85. ",
      "doi": "10.5555/1565058.1565067"
    },
    {
      "text": "Dourish, P., et al., Your Place or Mine? Learning from Long-Term Use of Video Communication. CSCW Journal, 1996. 5(1): p. 33--62.  ",
      "doi": "10.1007/BF00141935"
    },
    {
      "text": "Dourish, P. and V. Bellotti. Awareness and Coordination in Shared Workspaces. in Proc CSCW '92. Toronto: 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Dutton, W. H. and P. W. Jeffreys, eds. World Wide Research: reshaping the Sciences and Humanities. 2010, MIT Press: Cambridge MA. ",
      "doi": "10.5555/1893158"
    },
    {
      "text": "Flor, G. de la., et al., The case of the disappearing ox: seeing through digital images to an analysis of ancient texts, in Proc CHI 2010. Atlanta. 473--482.  ",
      "doi": "10.1145/1753326.1753397"
    },
    {
      "text": "Fraser, M., et al., Remote Collaboration over Video Data: Towards Real-Time e-Social Science. CSCW Journal 2006. 15(4): 257--279.  ",
      "doi": "10.1007/s10606-006-9027-y"
    },
    {
      "text": "Fussell, S. R., et al., Gestures Over Video Streams to Support Remote Collaboration on Physical Tasks. Human Computer Interaction, 2004. 19: 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Garfinkel, H., A Conception of and Experiments with Trust as a Condition of Stable Concerted Actions in Motivation and Social Interaction, O. J. Harvey, Ed. 1963, Ronald Press.",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., et al. Realizing a video environment: EuroPARC\"s RAVE system. in Proc CHI 92. Monterey, CA: 27--35.  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Gaver, W. W., G. Smets, and K. Overbeeke. A Virtual Window on media space. in Proc CHI '95. 1995: 257--264.  ",
      "doi": "10.1145/223904.223937"
    },
    {
      "text": "Goffman, E., Forms of Talk. 1981, Oxford: Blackwell.",
      "doi": ""
    },
    {
      "text": "Goodwin, C., Seeing in Depth. Social Studies of Science, 1995. 25(2): 237--274.",
      "doi": ""
    },
    {
      "text": "Goodwin, C., Pointing as a Situated Practice, in Pointing: Where Language, Culture and Cognition Meet, S. Kita, Editor. 2003, Lawrence Erlbaum: Mahwah, NJ. 217--41.",
      "doi": ""
    },
    {
      "text": "Harrison, S., ed. Media Space 20 + Years of Mediated Life 2009, Springer-Verlag: London. ",
      "doi": "10.5555/1557625"
    },
    {
      "text": "Heath, C. C. and P. Luff. Disembodied Conduct: Communication through Video in a Multi-Media Office Environment. in Proc CHI '91. New Orleans: 99--103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Hindmarsh, J., et al. Fragmented Interaction: Establishing mutual orientation in virtual environments. in Proc CSCW'98. Seattle, WA: 217--226.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Ishii, H. TeamWorkStation: Towards a Seamless Shared Workspace. in Proc CSCW '90. Los Angeles: 13--26.  ",
      "doi": "10.1145/99332.99337"
    },
    {
      "text": "Ishii, H., M. Kobayashi, and J. Grudin. Integration of Inter-Personal Space and Shared Workspace: Clearboard Design and Experiments. in Proc CSCW 92. Toronto: 33--42.  ",
      "doi": "10.1145/143457.143459"
    },
    {
      "text": "Jirotka, M., et al., Collaboration and Trust in Healthcare Innovation: The eDiaMoND Case Study. CSCW Journal, 2005. 14 (4) 369--398.  ",
      "doi": "10.1007/s10606-005-9001-0"
    },
    {
      "text": "Kirk, D., T. Rodden, and A. Crabtree, Ways of the hand, in Proc ECSCW 2005: Paris 1--21. ",
      "doi": "10.5555/1242029.1242030"
    },
    {
      "text": "Kuzuoka, H., et al. GestureMan: A Mobile Robot that Embodies a Remote Instructor's Actions. in Proc of CSCW 2000. Philadelphia PA: 155--162.  ",
      "doi": "10.1145/358916.358986"
    },
    {
      "text": "Luff, P., et al., Fractured ecologies: creating environments for collaboration. HCI Journal, 2003. 18(1-2): 51--84.  ",
      "doi": "10.1207/S15327051HCI1812_3"
    },
    {
      "text": "Luff, P., et al. Handling Documents and Discriminating Objects in Hybrid Spaces in Proc of CHI 2006. Montreal 561--570.  ",
      "doi": "10.1145/1124772.1124858"
    },
    {
      "text": "Mantei, M., et al. Experiences in the Use of a Media Space. in Proc of CHI '91. New Orleans, Louisiana: 203--8.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "Morikawa, O. and T. Maesako. HyperMirror: Toward pleasant-to-use video mediated communication system. in Proc CSCW'98. Seattle, WA: 149--159.  ",
      "doi": "10.1145/289444.289489"
    },
    {
      "text": "Ruhleder, K. and B. Jordan, Co-Constructing Non-Mutual Realities: Delay-Generated Trouble in Distributed Interaction. CSCW Journal, 2001. 10(1): p. 113--138.  ",
      "doi": "10.1023/A%3A1011243905593"
    },
    {
      "text": "Tallis, R., Michelangelo's Finger: An Exploration of Everyday Transcendence 2010, London: Atlantic Books.",
      "doi": ""
    },
    {
      "text": "Tang, J. C. and S. L. Minneman, VideoDraw: A Video Interface for Collaborative Drawing. ACM Transactions on Information Systems, 1991. 9, (2): 170--184.  ",
      "doi": "10.1145/123078.128729"
    },
    {
      "text": "Tutt, D., et al. The Distributed Work of Local Action: Interaction amongst virtually collocated research teams. in Proc of ECSCW 2007: 199--218.",
      "doi": ""
    },
    {
      "text": "Vertegaal, R., et al. GAZE-2: Conveying Eye Contact in Group Video Conferencing Using Eye-Controlled Camera Direction. in Proc. of CHI 2003. Ft. Lauderdale, Florida, USA: 521--528.3.  ",
      "doi": "10.1145/642611.642702"
    }
  ]
}