{
  "doi": "10.1145/1978942.1979025",
  "title": "Identifying social capital in the facebook interface",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "585-588",
  "year": 2011,
  "badges": [],
  "abstract": "A number of studies have identified a robust relationship between the use of social network sites, particularly Facebook, and positive outcomes such as social capital. Social network site use is often measured as a function of use frequency, network size, and a range of subjective opinions about the value of the site. This research extends this understanding by exploring the relationship between the use of particular elements of the site and social capital. Our goal in this research is to identify where, in the interface, perceived social capital is most effectively produced and transmitted. We find that, as hypothesized, public, person-to-person communication is positively associated with perceived social capital. Through the use of a structural equation model, we are able to provide in-depth exploration of the relationship between the interface elements and the outcome, perceived social capital.",
  "tags": [
    "social capital",
    "social networking",
    "privacy",
    "social network sites",
    "facebook",
    "behavioral modeling"
  ],
  "authors": [
    {
      "name": "Christian Yoder",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, N. Carolina, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651849",
      "orcid": "missing"
    },
    {
      "name": "Fred Stutzman",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, N. Carolina, USA",
      "img": "/do/10.1145/contrib-81314495214/rel-imgonly/fred.png",
      "acmid": "81314495214",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ala-Mutka, K. (2010). The Impact of Social Computing on the EU Information Society and Economy. JRC European Commission.",
      "doi": ""
    },
    {
      "text": "Boyd, D. and Ellison, N. B. Social Network Sites: Definition, History, and Scholarship. JCMC 13, 1 (2007).",
      "doi": "10.1111/j.1083-6101.2007.00383.x"
    },
    {
      "text": "Burke, M., Marlow, C., and Lento, T. Social Network Activity and Social Well-Being. Proc. CHI 2010, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753613"
    },
    {
      "text": "Coleman, J. S. Social capital in the creation of human capital. Amer J Soc 94, 1 (1988), 95.",
      "doi": ""
    },
    {
      "text": "Donath, J. and Boyd, D. Public displays of connection. BT Technology Journal 22, 4, (2004). 71--82.  ",
      "doi": "10.1023/B%3ABTTJ.0000047585.06264.cc"
    },
    {
      "text": "Donath, J. Signals in Social Supernets. JCMC 13, 1 (2007).",
      "doi": ""
    },
    {
      "text": "Ellison, N. B., Steinfield, C., and Lampe, C. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. JCMC 12, 4 (2007).",
      "doi": ""
    },
    {
      "text": "Kwon, O. and Wen, Y. An empirical study of the factors affecting social network service use. Computers in Human Behavior 26, 2 (2010). 254--263.  ",
      "doi": "10.1016/j.chb.2009.04.011"
    },
    {
      "text": "Preece, J. and Maloney-Krichmar, D. Online communities: focusing on sociability and usability. In Jacko, J. and Sears, A. (Eds.), Handbook of human-computer interaction. Lawrence Erlbaum Associates, Mahwah, NJ (2003) 596--620. ",
      "doi": "10.5555/772072.772111"
    },
    {
      "text": "Putnam, R. Bowling Alone: The Collapse and Revival of American Community. Simon & Schuster, New York, NY. (2001).  ",
      "doi": "10.1145/358916.361990"
    },
    {
      "text": "Steinfield, C., Ellison, N. B., and Lampe, C. Social capital, self-esteem, and use of online social network sites: A longitudinal analysis. Journal of Applied Developmental Psychology 29. 6 (2008) 434--445.",
      "doi": ""
    },
    {
      "text": "Valenzuela, S., Park, N., and Kee, K. F. Is There Social Capital in a Social Network Site?: Facebook Use and College Students' Life Satisfaction, Trust, and Participation. JCMC 14. 4 (2009) 875--901.",
      "doi": ""
    }
  ]
}