{
  "doi": "10.1145/1978942.1979059",
  "title": "Sensor synaesthesia: touch in motion, and motion in touch",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "801-810",
  "year": 2011,
  "badges": [],
  "abstract": "We explore techniques for hand-held devices that leverage the multimodal combination of touch and motion. Hybrid touch + motion gestures exhibit interaction properties that combine the strengths of multi-touch with those of motion-sensing. This affords touch-enhanced motion gestures, such as one-handed zooming by holding one's thumb on the screen while tilting a device. We also consider the reverse perspective, that of motion-enhanced touch, which uses motion sensors to probe what happens underneath the surface of touch. Touching the screen induces secondary accelerations and angular velocities in the sensors. For example, our prototype uses motion sensors to distinguish gently swiping a finger on the screen from 'Sdrags with a hard onset' - to enable more expressive touch interactions.",
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Hyunyoung Song",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416595880",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bartlett, J.F., Rock 'n' Scroll Is Here to Stay. IEEE Computer Graphics and Applications, 2000(May/June 2000): p. 40--45.  ",
      "doi": "10.1109/38.844371"
    },
    {
      "text": "Boring, S., Baur, D., Butz, A., Gustafson, S., Baudisch, P. Touch Projector: Mobile Interaction Through Video. CHI'10.  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Buxton, W., Lexical and Pragmatic Considerations of Input Structure. Computer Graphics, 1983. 17(1): p. 31--37.  ",
      "doi": "10.1145/988584.988586"
    },
    {
      "text": "Buxton, W. Chunking and Phrasing and the Design of Human-Computer Dialogues. IFIP Information Processing '86. Amsterdam: North Holland Publishers.",
      "doi": ""
    },
    {
      "text": "Card, S., Mackinlay, J., Robertson, G. The Design Space of Input Devices. CHI'90.  ",
      "doi": "10.1145/97243.97263"
    },
    {
      "text": "Chen, N., et al. Navigation Techniques for Dual-Display E-Book Readers. CHI'08.  ",
      "doi": "10.1145/1357054.1357331"
    },
    {
      "text": "Cho, Murray-Smith, &amp;#38; Kim. Multi-Context Photo Browsing on Mobile Devices Based on Tilt Dynamics. Mobile HCI'07.  ",
      "doi": "10.1145/1377999.1378006"
    },
    {
      "text": "Chun Yat Li, F., Dearman, D., Truong, K. Virtual Shelves: Interactions with Orientation-Aware Devices. UIST'09.  ",
      "doi": "10.1145/1622176.1622200"
    },
    {
      "text": "Cohen, P.R., Dalrymple, M., Moran, D.B., Pereira, F.C., Sullivan, J.W. Synergistic use of direct manipulation and natural language. CHI'89.  ",
      "doi": "10.1145/67449.67494"
    },
    {
      "text": "Eslambolchilar, P., Murray-Smith, R. Tilt-Based Automatic Zooming and Scaling in Mobile Devices. Mobile HCI'04.",
      "doi": ""
    },
    {
      "text": "Essl, G., Rohs, M., Kratz, S. Use the Force (or something) - Pressure and Pressure-Like Input for Mobile Music Performance. NIME 2010 Conf. on New Interfaces for Musical Expression.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G., Buxton, W. The Chameleon: spatially aware palmtop computers. CHI'94.  ",
      "doi": "10.1145/259963.260460"
    },
    {
      "text": "Harrison, B.L., Fishkin, K.P., Gujar, A., Mochon, C., Want, R. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. CHI'98.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Harrison, C., Hudson, S. Scratch Input: Creating Large, Inexpensive, Unpowered and Mobile Finger Input Surfaces. UIST'08.  ",
      "doi": "10.1145/1449715.1449747"
    },
    {
      "text": "Harrison, C., Tan, C., Morris, D. Skinput: Appropriating the Body as an Input Surface. CHI'10.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Hassan, N., Rahman, M., Irani, P., Graham, P. Chucking: A One-Handed Document Sharing Technique. INTERACT'09.  ",
      "doi": "10.1007/978-3-642-03658-3_33"
    },
    {
      "text": "Herot, C., Weinzapfel, G., One-Point Touch Input of Vector Information from Computer Displays. Computer Graphics, 1978. 12(3): p. 210--216.  ",
      "doi": "10.1145/965139.807392"
    },
    {
      "text": "Hinckley, K., Pierce, J., Sinclair, M., Horvitz, E. Sensing techniques for mobile interaction. UIST 2000.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Hinckley, K., et al. Manual Deskterity: An Exploration of Simultaneous Pen + Touch Direct Input. CHI 2010 Ext. Abstracts.  ",
      "doi": "10.1145/1753846.1753865"
    },
    {
      "text": "Hudson, S., Harrison, C., Harrison, B., LaMarca, A. Whack Gestures: Inexact and Inattentive Interaction with Mobile Devices. TEI 2010 Conf. Tangible &amp;#38; Embedded Interaction.  ",
      "doi": "10.1145/1709886.1709906"
    },
    {
      "text": "Iwasaki, K., Miyaki, T., Rekimoto, J. Expressive Typing: A New Way to Sense Typing Pressure and Its Applications. CHI'09.  ",
      "doi": "10.1145/1520340.1520668"
    },
    {
      "text": "Joshi, N., Kang, S.B., Zitnik, C.L., Szeliski, R. Image Deblurring using Inertial Measurement Sensors. Proc. SIGGRAPH 2010.  ",
      "doi": "10.1145/1833349.1778767"
    },
    {
      "text": "Kim, K.-E., et al. Hand Grip Pattern Recognition for Mobile User Interfaces. Proceedings of AAAI/IAAI-2006: Innovative Applications of Artificial Intelligence. 2006. ",
      "doi": "10.5555/1597122.1597138"
    },
    {
      "text": "Kratz, S., Ballagas, R. Unravelling Seams: Improving Mobile Gesture Recognition with Visual Feedback Techniques. CHI'09.  ",
      "doi": "10.1145/1518701.1518844"
    },
    {
      "text": "Liao, C., Liu, Q., Liew, B., Wilcox, L. PACER: Fine-Grained Interactive Paper via Camera-Touch Hybrid Gestures on a Cell Phone. CHI'10.  ",
      "doi": "10.1145/1753326.1753696"
    },
    {
      "text": "Mahoney, R., Nonlinear Complementary Filters on the Special Orthogonal Group. IEEE Trans. on Automatic Control, 2008. 53(5): p. 1203--18.",
      "doi": ""
    },
    {
      "text": "Olsen, D.R., Clement, J., Pace, A. Spilling: Expanding Hand-held Interaction to Touch Table Displays. IEEE TableTop '07.",
      "doi": ""
    },
    {
      "text": "Rahman, M., Gustafson, S., Irani, P., Subramanian, S. Tilt Techniques: Investigating the Dexterity of Wrist-Based Input. CHI'09.  ",
      "doi": "10.1145/1518701.1518997"
    },
    {
      "text": "Roudaut, A., Baglioni, M., Lecolinet, E. TimeTilt: Using Sensor-Based Gestures to Travel through Multiple Applications on a Mobile Device. Interact '09.  ",
      "doi": "10.1007/978-3-642-03655-2_90"
    },
    {
      "text": "Schmidt, A., et al. Advanced interaction in context. Handheld and Ubiquitous Computing (HUC'99). ",
      "doi": "10.5555/647985.743849"
    },
    {
      "text": "Schmidt, D., Chehimi, F., Rukzio, E., Gellersen, H. PhoneTouch: A Technique for Direct Phone Interaction on Surfaces. UIST'10.  ",
      "doi": "10.1145/1866029.1866034"
    },
    {
      "text": "Schwarz, J., Hudson, S., Mankoff, J., Wilson, A.D. A framework for robust and flexible handling of inputs with uncertainty. UIST'10.  ",
      "doi": "10.1145/1866029.1866039"
    },
    {
      "text": "Schwesig, C., Poupyrev, I., Mori, E. Gummi: A Bendable Computer. CHI'04.  ",
      "doi": "10.1145/985692.985726"
    },
    {
      "text": "Sellen, A., Kurtenbach, G., Buxton, W., The prevention of mode errors through sensory feedback. Human Computer Interaction, 1992. 7(2): p. 141--164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Taylor, B., Bove Jr., V. Graspables: Grasp-Recognition as a User Interface. CHI'09.  ",
      "doi": "10.1145/1518701.1518842"
    },
    {
      "text": "Wigdor, D., Balakrishnan, R. TiltText: Using tilt for text input to mobile phones. UIST'03.  ",
      "doi": "10.1145/964696.964705"
    }
  ]
}