{
  "doi": "10.1145/1978942.1979323",
  "title": "Exploring implicit memory for painless password recovery",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2615-2618",
  "year": 2011,
  "badges": [],
  "abstract": "Knowledge-based authentication systems generally rely upon users' explicit recollection of passwords, facts, or personal preferences. These systems impose a cognitive burden that often results in forgotten secrets or secrets with poor entropy. We propose an authentication system that instead draws on implicit memory - that is, the unconscious encoding and usage of information. In such a system, a user is initially presented with images of common objects in a casual familiarization task. When the user later authenticates, she is asked to perform a task involving a set of degraded images, some of which are based upon the images in the familiarization task. The prior exposure to those images influences the user's responses in the task, thereby eliciting authentication information. We ran a user study to investigate the plausibility of our system design. Our results suggest that implicit memory has potential as a basis for low-cognitive-overhead, high-stability, knowledge-based authentication.",
  "tags": [
    "password recovery",
    "priming",
    "implicit memory",
    "authentication",
    "security"
  ],
  "authors": [
    {
      "name": "Tamara Denning",
      "institution": "RSA Labs, Cambridge, Massachusetts and University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311486938",
      "orcid": "missing"
    },
    {
      "name": "Kevin Bowers",
      "institution": "RSA Labs, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447596807",
      "orcid": "missing"
    },
    {
      "name": "Marten van Dijk",
      "institution": "RSA Labs, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100449382",
      "orcid": "missing"
    },
    {
      "name": "Ari Juels",
      "institution": "RSA Labs, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100625698",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "C. B. Cave. Very Long-Lasting Priming in Picture Naming. Psychological Science, 8:322--5, 1997.",
      "doi": ""
    },
    {
      "text": "E. Hayashi, R. Dhamija, N. Christin, and A. Perrig. Use Your Illusion: secure authentication usable anywhere. In SOUPS '08, 2008.  ",
      "doi": "10.1145/1408664.1408670"
    },
    {
      "text": "M. Jakobsson, E. Stolterman, S. Wetzel, and L. Yang. Love and authentication. In CHI '08, 2008.  ",
      "doi": "10.1145/1357054.1357087"
    },
    {
      "text": "D. B. Mitchell. Nonconscious Priming After 17 Years: Invulnerable Implicit Memory? Psychological Science, 17:925--9, November 2006.",
      "doi": ""
    },
    {
      "text": "Passfaces Corporation. Passfaces#8482;. http://www.realuser.com/.",
      "doi": ""
    },
    {
      "text": "D. L. Schacter, C. Chiu, and K. N. Ochsner. Implicit Memory: A Selective Review. Annu. Rev. Neurosci., 16:159--82, 1993.",
      "doi": ""
    },
    {
      "text": "S. Schechter, A. J. B. Brush, and S. Egelman. It's No Secret. Measuring the Security and Reliability of Authentication via \"Secret\" Questions. In S&P '09, 2009.  ",
      "doi": "10.1109/SP.2009.11"
    },
    {
      "text": "J. G. Snodgrass and J. Corwin. Perceptual Identification Thresholds for 150 Fragmented Pictures from the Snodgrass and Vanderwart Picture Set. Perceptual and Motor Skills, 67:3--36, 1988.",
      "doi": ""
    },
    {
      "text": "J. G. Snodgrass and M. Vanderwart. A Standardized Set of 260 Pictures: Norms for Name Agreement, Image Agreement, Familiarity, and Visual Complexity. Journal of Experimental Psychology: Human Learning and Memory, 6:174--215, 1980.",
      "doi": ""
    },
    {
      "text": "D. Weinshall and S. Kirkpatrick. Passwords you'll never forget, but can't recall. In CHI '04, 2004.  ",
      "doi": "10.1145/985921.986074"
    },
    {
      "text": "S. Wiedenbeck, J. Waters, J.-C. Birget, A. Brodskiy, and N. Memon. PassPoints: design and longitudinal evaluation of a graphical password system. Int. J. Hum.-Comput. Stud., 63(1-2):102--127, 2005.  ",
      "doi": "10.1016/j.ijhcs.2005.04.010"
    }
  ]
}