{
  "doi": "10.1145/1978942.1979439",
  "title": "CPOE workarounds, boundary objects, and assemblages",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3353-3362",
  "year": 2011,
  "badges": [],
  "abstract": "We conducted an ethnographically based study at a large teaching hospital to examine clinician workarounds engendered by the adoption of a Computerized Prescribe Order Entry (CPOE) system. Specifically, we investigated how adoption of computerized systems may alter medical practice, order management in particular, as manifested through the working-around behavior developed by doctors and nurses to accommodate the changes in their day-to-day work environment. In this paper, we focus on clinicians' workarounds, including those workarounds that gradually disappeared and those that have become routinized. Further, we extend the CSCW concept of boundary object (to \"assemblage\") in order to understand the workarounds created with CPOE system use and the changing nature of clinical practices that are increasingly computerized.",
  "tags": [
    "cpoe",
    "electronic patient records",
    "cscw",
    "assemblage",
    "health informatics",
    "ehr",
    "medical orders",
    "boundary object"
  ],
  "authors": [
    {
      "name": "Xiaomu Zhou",
      "institution": "Rutgers University, New Brunswick, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416595640",
      "orcid": "missing"
    },
    {
      "name": "Mark Ackerman",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/do/10.1145/contrib-81100017207/rel-imgonly/81100017207.jpg",
      "acmid": "81100017207",
      "orcid": "0000-0001-9727-1664"
    },
    {
      "name": "Kai Zheng",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100580587",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. S. and Halverson, C. Organizational Memory as Objects, Processes, and Trajectories, Journal of CSCW, 13, 2(2004), 155--189.",
      "doi": ""
    },
    {
      "text": "Azad, B. and King, N. Enacting computer workaround practices within a medication dispensing system. Eur J Inform Syst. 17, 3(2008), 264--278.",
      "doi": ""
    },
    {
      "text": "Bates, D. W. et al. Effect of computerized physician order entry and a team intervention on prevention of serious medication errors. JAMA, 280,15(1998),1311--6.",
      "doi": ""
    },
    {
      "text": "Berg, M. and Bowker, G. The Multiple Bodies of the Medical Records. Sociological Quarterly, 38, 3(1997), 513--537.",
      "doi": ""
    },
    {
      "text": "Cohen, M. D. et al. Routines and other recurring action patterns of organizations: Ind Corp Change, 5, 3(1996), 653--698.",
      "doi": ""
    },
    {
      "text": "Evans, R. S. et al. A computer-assisted management program for antibiotics and other anti-infective agents. N Engl. J Med., 338, 4(1997), 232--238.",
      "doi": ""
    },
    {
      "text": "Halbesleben, J. R. et al. Work-arounds in health care settings: Literature review and research agenda. Health Care Management Rev., 33, 1(2008), 2--12.",
      "doi": ""
    },
    {
      "text": "Han, Y. Y et al. Unexpected increased mortality after implementation of a commercially sold computerized physician order entry system. Pediatrics, 116, 6(2005), 1506--1512.",
      "doi": ""
    },
    {
      "text": "Kobayashi, M. et al. Work coordination, workflow and workarounds in a medical context. CHI Late Breaking Results. New York, ACM Press (2005), 1561--1564.  ",
      "doi": "10.1145/1056808.1056966"
    },
    {
      "text": "Koppel, R. et al. Role of computerized physician order entry systems in facilitating medication errors. JAMA, 293, 10(2005), 1197--1203.",
      "doi": ""
    },
    {
      "text": "Koppel, R. et al. Workarounds to barcode medication administration systems: Their occurrences, causes, and threats to patient safety. J Am Med Inform Assoc., 15, 4(2008), 408--423.",
      "doi": ""
    },
    {
      "text": "Lee, C. Boundary Negotiating Artifacts. Journal of CSCW, 16, 3(2007), 307--339.  ",
      "doi": "10.1007/s10606-007-9044-5"
    },
    {
      "text": "Lutters, W. G. and Ackerman, M. S. Beyond Boundary Objects. Journal of CSCW, 16, 3(2007), 341--372.  ",
      "doi": "10.1007/s10606-006-9036-x"
    },
    {
      "text": "Morath, J. M. and Tumbull, J. E. To do no harm. San Francisco, Jossey-Bass, 2005.",
      "doi": ""
    },
    {
      "text": "Niazkhani, Z. et al. The impact of computerized provider order entry systems on inpatient clinical workflow: J Am Med Inform Assoc, 16, 4(2009), 539--49.",
      "doi": ""
    },
    {
      "text": "Reckmann, M. H. et al. Does computerized provider order entry reduce prescribing errors for hospital inpatients? JAMIA, 16(2009), 613--623.",
      "doi": ""
    },
    {
      "text": "Schmidt, K. and Bannon, L. Taking CSCW seriously Journal of CSCW, 1, (1-2) (1992), 7--40.",
      "doi": ""
    },
    {
      "text": "Schmidt, K. and Wagner, I. Ordering Systems: Coordinative Practices and Artifacts in Architectural Design and Planning. Journal of CSCW, 13, 5-6(2004), 349--408.  ",
      "doi": "10.5555/1045432.1045434"
    },
    {
      "text": "Star, S. L. and Griesemer, J. R. Institutional Ecology, 'Translations' and Boundary Objects. Social Studies of Science, 19, 3 (1989), 387--420.",
      "doi": ""
    },
    {
      "text": "Strauss, A. et al. Social Organization of Medical Work. Transaction Publishers, 1997.",
      "doi": ""
    },
    {
      "text": "Teich, J. M. et al. Effects of computerized physician order entry on prescribing practices. Arch Intern Med., 160, 18(2000), 2741--2747.",
      "doi": ""
    },
    {
      "text": "van der Sijs, H. et al. Overriding of drug safety alerts in computerized physician order entry. J Am Med Inform Assoc., 13, 2(2006), 138--147.",
      "doi": ""
    },
    {
      "text": "van Ginneken, A. M. The physician's flexible narrative. Methods Inf Med., 35, 2(1996), 98--100.",
      "doi": ""
    },
    {
      "text": "Varpio, L. et al. Working off the record. Acad Med., 8, 10(2006, Suppl), S35--9.",
      "doi": ""
    },
    {
      "text": "Vogelsmeier, A. A. et al. Technology implementation and workarounds in the nursing home. J Am Med Inform Assoc., 15, 1(2008), 114--119.",
      "doi": ""
    },
    {
      "text": "Weingart, S. N. et al. Physicians' decisions to override computerized drug alerts in primary care. Arch Intern Med., 163, 21(2003), 2625--2631.",
      "doi": ""
    },
    {
      "text": "Zhou, X., Ackerman, M. and Zheng, K. I just don't know why it's gone: Maintaining Informal Information Use in Inpatient Care. Proc. of CHI2009, 2061--2070.  ",
      "doi": "10.1145/1518701.1519014"
    },
    {
      "text": "Zhou, X., Ackerman, M. S., and Zheng, K. Computerization and information assembling process. Proc. of ACM IHI 2010, 36--45.  ",
      "doi": "10.1145/1882992.1883000"
    },
    {
      "text": "Zuboff, S. In The Age of the Smart Machine: The Future of Work and Power, Basic Books, 1989.",
      "doi": "10.5555/47303"
    }
  ]
}