{
  "doi": "10.1145/1978942.1979077",
  "title": "\"I lie to myself that i have freedom in my own schedule\": productivity tools and experiences of busyness",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "905-914",
  "year": 2011,
  "badges": [],
  "abstract": "This paper examines the relationship between experiences of busyness in everyday life and the use of productivity tools, including planners, calendars and to-do lists. Field study findings demonstrate that American individuals across a demographic range have internalized a cultural emphasis of busyness as a moral value to construct positive identities as busy individuals. At the same time, they struggle with a sense of conflict around busyness, reflected in real-life experiences of clashing priorities, fantasies of downtime, and struggles with anxiety, guilt, and loss of control. Our findings also point to the ways digital and non-digital productivity tools are embedded in experiences and coping practices around busyness. Grounded in our observations we propose design principles for productivity tools that support users' identities as busy people but also address some of the perils of the American busyness ethic.",
  "tags": [
    "productivity tools",
    "busyness",
    "qualitative field study"
  ],
  "authors": [
    {
      "name": "Gilly Leshed",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350569215",
      "orcid": "0000-0002-2308-2825"
    },
    {
      "name": "Phoebe Sengers",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/do/10.1145/contrib-81100397464/rel-imgonly/ditheredhead.jpg",
      "acmid": "81100397464",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agre, P. 1997. Computation and human experience. Cambridge, UK: Cambridge University Press. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Allen, D. 2001. Getting things done: the art of stress-free productivity. New York: Penguin.",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Dalal, B., Good, N., Flynn, P., Bobrow, D. G., &amp;#38; Ducheneaut, N. 2004. What a to-do: studies of task management towards the design of a personal task list manager. Proc. CHI '04. 735--742.  ",
      "doi": "10.1145/985692.985785"
    },
    {
      "text": "Covey, S. R. 1990. The seven habits of highly effective people. New York: Simon &amp;#38; Schuster.",
      "doi": ""
    },
    {
      "text": "Darrah, C. N., Freeman, J. M., &amp;#38; English-Lueck, J. A. 2007. Busier than ever! why American families can't slow down. Stanford, CA: Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Lee, M. K., Zimmerman, J., &amp;#38; Dey, A. K 2006. Principle of smart home control. Proc. UbiComp '06. 19--34.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Davidoff, S., Zimmerman, J., &amp;#38; Dey, A. K. 2010. How routine learners can support family coordination. Proc. CHI '10. 2461--2470.  ",
      "doi": "10.1145/1753326.1753699"
    },
    {
      "text": "Dunne, A. &amp;#38; Raby, F. 2001. Design Noir. Basel: Birkh&amp;#228;user.",
      "doi": ""
    },
    {
      "text": "Foucault, M. 1988. Technologies of the self. In L. H. Martin, H. Gutman &amp;#38; P. H. Hutton (Eds.), Technologies of the self: A seminar with Michel Foucault (pp. 16--49). Amherst, MA: University of Massachusetts Press.",
      "doi": ""
    },
    {
      "text": "Frissen, V. A. J. 2000. ICTs in the rush hour of life. The Information Society, 16, 65--75.",
      "doi": ""
    },
    {
      "text": "Garfinkel, H. 1967. Studies in ethnomethodology. Englewood Cliffs, NJ: Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Bowers, J., Boucher, A., Law, A., &amp;#38; Pennington, S. 2007. Electronic furniture for the curious home: assessing ludic designs in the field. IJHCI, 22(1-2): 119--152.",
      "doi": ""
    },
    {
      "text": "Giddens, A. 1984. The constitution of society: outline of the theory of structuration. Berkeley, CA: UC Press.",
      "doi": ""
    },
    {
      "text": "Goffman, E. 1959. The presentation of self in everyday life. New York: Doubleday.",
      "doi": ""
    },
    {
      "text": "Gonz&amp;#225;lez, V. M. &amp;#38; Mark, G. 2004. \"Constant, constant, multi-tasking craziness\": managing multiple working spheres. Proc. CHI '04. 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Halln&amp;#228;s, L. &amp;#38; Redstr&amp;#246;m, J. 2001. Slow technology: designing for reflection. Pers. Ubiq. Comp., 5(3), 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Hochschild, A. R. 1997. The time bind: when work becomes home and home becomes work. NY: Metropolitan Books.",
      "doi": ""
    },
    {
      "text": "Honore, C. 2004. In praise of slowness. NY: Harper.",
      "doi": ""
    },
    {
      "text": "Kaye, J., Vertesi, J., Avery, S., Dafoe, A., David, S., Onaga, L., Rosero, I., &amp;#38; Pinch, T. 2006. To have and to hold: exploring the personal archive. Proc. CHI '06. 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "Miller D. &amp;#38; Slater, D. 2000. The Internet: an ethnographic approach. New York: Berg.",
      "doi": ""
    },
    {
      "text": "Neustaedter, C. &amp;#38; Bernheim Brush, A. J. 2006. \"LINC-ing\" the family: the participatory design of an inkable family calendar. Proc. CHI '06. 141--150.  ",
      "doi": "10.1145/1124772.1124796"
    },
    {
      "text": "Neustaedter, C., Brush, A. J., &amp;#38; Greenberg, S. 2009. The calendar is crucial: coordination and awareness through the family calendar. ToCHI, 16(1), 1--48.  ",
      "doi": "10.1145/1502800.1502806"
    },
    {
      "text": "Palen, L. 1999. Social, individual and technological issues for groupware calendar systems. Proc. CHI '99. 17--24.  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Perry, M., O'hara, K., Sellen, A., Brown, B., &amp;#38; Harper, R. 2001. Dealing with mobility: understanding access anytime, anywhere. ToCHI, 8(4), 323--347.  ",
      "doi": "10.1145/504704.504707"
    },
    {
      "text": "Rattenbury, T., Nafus, D., &amp;#38; Anderson, K. 2008. Plastic: a metaphor for integrated technologies. Proc. UbiComp '08. 232--241.  ",
      "doi": "10.1145/1409635.1409667"
    },
    {
      "text": "Robinson, J. P. &amp;#38; Godbey, G. 2005. Busyness as usual. Social Research, 72(2), 407--426.",
      "doi": ""
    },
    {
      "text": "Schor, J. B. 1991. The overworked American: the unexpected decline of leisure. NY: Basic Books.",
      "doi": ""
    },
    {
      "text": "Sengers, P. &amp;#38; Gaver, W. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. Proc. DIS '06. 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Suchman, L. 1987. Plans and situated actions. New York: Cambridge University Press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Swan, L., Taylor, A. S., &amp;#38; Harper, R. 2008. Making place for clutter and other ideas of home. ToCHI, 15(2), 1--24.  ",
      "doi": "10.1145/1375761.1375764"
    },
    {
      "text": "Taylor, A. S. &amp;#38; Swan, L. 2005. Artful systems in the home. Proc. CHI '05. 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Taylor, A. S., Wyche, S. P., &amp;#38; Kaye, J. 2008. Pottering by design. Proc. NordiCHI '08. 363--372.  ",
      "doi": "10.1145/1463160.1463200"
    },
    {
      "text": "Wajcman, J. 2008. Life in the fast lane? Toward a sociology of technology and time. Brit. J. Soc., 59(1), 59--77.",
      "doi": ""
    },
    {
      "text": "Wakkary, R. &amp;#38; Tanenbaum, K. 2009. A sustainable identity: the creativity of an everyday designer. Proc. CHI '09. 365--374.  ",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "Whittaker, S. &amp;#38; Sidner, C. 1996. Email overload. Proc. CHI '96. 276--283.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Zuzanek, J., Beckers, T., &amp;#38; Peters, P. 1998. The 'harried leisure class' revisited: Dutch and Canadian trends in the use of time from the 1970s to the 1990s. Leisure Studies, 17, 1--19.",
      "doi": ""
    }
  ]
}