{
  "doi": "10.1145/1978942.1979332",
  "title": "Antiquarian answers: book restoration as a resource for design",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2665-2668",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As technologies age, they experience wear and degradation, sometimes resulting in loss of functionality. In response, parts are replaced and software is updated. Yet restoration - the process of returning something to a previous condition, often regardless of its instrumental value -\"is a relatively rare practice with computational technologies. The aim of this paper is to enrich HCI design practices by considering the material qualities of restoration. We consider what makes a technology worth restoring and what constitutes the process of restoration by examining data collected from a three-month apprenticeship-based qualitative study of bookbinding. Building on relevant literatures, we offer antiquarian books -\"long-established information technologies - as a lens onto the ways values are enacted through material engagements. We conclude with a discussion of restoration's role in HCI.",
  "tags": [
    "handwork",
    "material",
    "tool",
    "handcraft",
    "books",
    "binding",
    "skill"
  ],
  "authors": [
    {
      "name": "Daniela K. Rosner",
      "institution": "University of California, Berekely, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    },
    {
      "name": "Alex S. Taylor",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100517358/rel-imgonly/alex_taylor_profile.jpg",
      "acmid": "81100517358",
      "orcid": "0000-0001-6311-3967"
    }
  ],
  "references": [
    {
      "text": "Akah, B., Bardzell, S. 2010. Empowering products: personal identity through the act of appropriation. EA from Proc. CHI '10, 4021--4026.  ",
      "doi": "10.1145/1753846.1754096"
    },
    {
      "text": "Aoki. P. M. 2007. Back stage on the front lines: perspectives and performance in the combat information center. In Proc. CHI '07, 717--726.  ",
      "doi": "10.1145/1240624.1240735"
    },
    {
      "text": "Blevis, E. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal and Reuse. In Proc. CHI '07, 503--12.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Bowker, G. 2005. Memory practices in the sciences: MIT Press.",
      "doi": ""
    },
    {
      "text": "Coy, M. 1989. Apprenticeship: From Theory to method and Back Again. New York: State University of New York Press.",
      "doi": ""
    },
    {
      "text": "Goodwin, Charles. 1997. \"The Blackness of Black: Color Categories as Situated Practice\". In Discourse, Tools and Reasonsing: Essays on Situated Cognition. Lauren B. Resnick, et al., eds. 111--140. Berlin, Heidelberg, New York: Springer.",
      "doi": ""
    },
    {
      "text": "Ingold, T. 2006. \"Walking the plank: meditations on a process of skill\". In Defining technological literacy: towards an epistemological framework. J. R. Dakers ed. 65--80. New York: Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Krebs, Christina. 2003. Liberating Culture: Cross-Cultural Perspectives on Museum Curation and Heritage Preservation. London: Routledge.",
      "doi": ""
    },
    {
      "text": "Küchler, S. 1988. Malangan: objects, sacrifice and the production of memory. In Am. Ethnol. 15, 625--37.",
      "doi": ""
    },
    {
      "text": "Morris, W. \"Manifesto of the Society for the Protection of Ancient Buildings\". In: Price, Nicholas Stanley. Historical and philosophical issues in the conservation cultural heritage. Los Angeles: The Getty Conservation Institute, 1996, 319--21.",
      "doi": ""
    },
    {
      "text": "Rosner, D. and Bean, J. 2009. Learning from IKEA hacking: I'm not one to decoupage a tabletop and call it a day. In Proc. CHI '09. ACM Press, 419--422.  ",
      "doi": "10.1145/1518701.1518768"
    },
    {
      "text": "WayBack Machine http://www.archive.org/web/web.php.",
      "doi": ""
    }
  ]
}