{
  "doi": "10.1145/1978942.1979029",
  "title": "ACES: promoting empathy towards aphasia through language distortion emulation software",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "609-618",
  "year": 2011,
  "badges": [],
  "abstract": "Individuals with aphasia, an acquired communication disorder, constantly struggle against a world that does not understand them. This lack of empathy and understanding negatively impacts their quality of life. While aphasic individuals may appear to have lost cognitive functioning, their impairment relates to receptive and expressive language, not to thinking processes. We introduce a novel system and model, Aphasia Characteristics Emulation Software (ACES), enabling users (e.g., caregivers, speech therapists and family) to experience, firsthand, the communication-distorting effects of aphasia. By allowing neurologically typical individuals to \"walk in another's shoes,\" we aim to increase patience, awareness and understanding. ACES was grounded in the communication science and psychological literature, and informed by an initial pilot study. Results from an evaluation of 64 participants indicate that ACES provides a rich experience that increases understanding and empathy for aphasia.",
  "authors": [
    {
      "name": "Joshua Hailpern",
      "institution": "University of Illinois at Urbana Champaign, Urbana Champaign, Illinois, USA",
      "img": "/do/10.1145/contrib-81351599207/rel-imgonly/81351599207.jpg",
      "acmid": "81351599207",
      "orcid": "missing"
    },
    {
      "name": "Marina Danilevsky",
      "institution": "University of Illinois at Urbana Champaign, Urbana Champaign, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472654356",
      "orcid": "missing"
    },
    {
      "name": "Andrew Harris",
      "institution": "University of Illinois at Urbana Champaign, Urbana Champaign, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344491452",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana Champaign, Urbana Champaign, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    },
    {
      "name": "Gary Dell",
      "institution": "University of Illinois at Urbana Champaign, Urbana Champaign, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484649034",
      "orcid": "missing"
    },
    {
      "name": "Julie Hengst",
      "institution": "University of Illinois at Urbana Champaign, Urbana Champaign, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657017",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benson, D. F. Aphasia, Alexia and Agraphia: Clinical Neurology and Neurosurgery Monographs. Churchill Livingstone, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Benson, D. F. The neurology of thinking. Oxford University Press, USA, 1994.",
      "doi": ""
    },
    {
      "text": "Boyd-Graber, J. L. et al. Participatory design with proxies: developing a desktop-PDA system to support people with aphasia. In In Proceedings of the CHI 06 (2006). ACM, Montreal, Canada.  ",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Bruno Martins. JaSpell. http://jaspell.sourceforge.net/.",
      "doi": ""
    },
    {
      "text": "Chapey, R. Language intervention strategies in aphasia and related neurogenic communication disorders. Lippincott Williams &amp;#38; Wilkins, 2001.",
      "doi": ""
    },
    {
      "text": "Czvik, P. S. Assessment of family attitudes toward aphasic patients with severe auditory processing disorders. In Proceedings of Clinical Aphasiology (1977).",
      "doi": ""
    },
    {
      "text": "Daemen, E. et al. Designing a free style, indirect, and interactive storytelling application for people with aphasia. INTERACT 2007, 2010, 221--234. ",
      "doi": "10.5555/1776994.1777022"
    },
    {
      "text": "Devlin, S. and Unthank, G. Helping aphasic people process online information. In Proc. of Assets '06 (2006). ACM, Portland, Oregon, USA New York, NY, USA.  ",
      "doi": "10.1145/1168987.1169027"
    },
    {
      "text": "Doerksen, S. Recreation for Persons with Disabilities (RPM 277). Pennsylvania State University Department of Recreation, Park and Tourism Management, Fall, 2009.",
      "doi": ""
    },
    {
      "text": "Dymond, R. F. A scale for the measurement of empathic ability. Journal of Consulting Psychology, 13(2), 1949, 127--133.",
      "doi": ""
    },
    {
      "text": "Furbacher, E. A. and Wertz, R. T. Simulation of Aphasia by Wives of Aphasic Patients. Clinical aphasiology, 1983, 227.",
      "doi": ""
    },
    {
      "text": "Goodglass, H., Goodglass, Kaplan. Boston Diagnostic Aphasia Examination: Stimulus Cards--Short Form. Lippincott Williams &amp;#38; Wilkins, 2001.",
      "doi": ""
    },
    {
      "text": "H. Goodglass and Kaplan, E. The Assessment of Aphasia and Other Neurological Disorders. Williams and Wilkins, Baltimore, MD, 1983.",
      "doi": ""
    },
    {
      "text": "Hugo Liu, Aingh, Push, and Eslick, Ian. ConceptNet. (http://web.media.mit.edu/~hugo/conceptnet/.",
      "doi": ""
    },
    {
      "text": "Hengst, J. Augmentative and Alternative Communication (SHS 473). University of Illinois Department of Speech and Hearing Science, Spring, 2005.",
      "doi": ""
    },
    {
      "text": "Kitzing, P., Maier, A., and &amp;#197;hlander, V. L. Automatic speech recognition (ASR) and its use as a tool for assessment or therapy of voice, speech, and language disorders. Logopedics Phonatrics Vocology, 34(2), 2009, 91--96.",
      "doi": ""
    },
    {
      "text": "Liechty, J. A. and Heinzekehr, J. B. Caring for Those Without Words: A Perspective on Aphasia. The Journal of Neuroscience Nursing, 39(5), 2007, 316.",
      "doi": ""
    },
    {
      "text": "Sarno, M. T. Acquired aphasia (Third Edition). Academic Press, San Diego, CA, 1998.",
      "doi": ""
    },
    {
      "text": "Martin Porter. Snowball: A language for stemming algorithms. 2010, http://snowball.tartarus.org/.",
      "doi": ""
    },
    {
      "text": "McCall, D. et al. Integrating technology and targeted treatment to improve narrative production in aphasia: A case study. Aphasiology, 23(4), 2009, 438--461.",
      "doi": ""
    },
    {
      "text": "McQuiggan, S. W. and Lester, J. C. Learning empathy: A data-driven framework for modeling empathetic companion agents. In Proceedings of Autonomous Agents and Multiagent Systems (2006). ACM, New York, NY.  ",
      "doi": "10.1145/1160633.1160806"
    },
    {
      "text": "Mehrabian, A. and Epstein, N. A measure of emotional empathy. Journal of personality, 40(4), 1972, 525--543.",
      "doi": ""
    },
    {
      "text": "Moffatt, K. et al. The participatory design of a sound and image enhanced daily planner for people with aphasia. In Proceedings of CHI 04 (2004). ACM, NY.  ",
      "doi": "10.1145/985692.985744"
    },
    {
      "text": "Mullennix, J. and Stern, S. Computer Synthesized Speech Technologies: Tools for Aiding Impairment. Medical Information Science Reference, Hershey, PA, 2010. ",
      "doi": "10.5555/1824074"
    },
    {
      "text": "National Institute on Deafness and Other Communication Disorders. Aphasia. 2010, (http://www.nidcd.nih.gov/health/voice/aphasia.htm.",
      "doi": ""
    },
    {
      "text": "Schwartz, M. F. et al. A case-series test of the interactive two-step model of lexical access: Evidence from picture naming. Journal of Memory and Language, 54(2), 2006, 228--264.",
      "doi": ""
    },
    {
      "text": "Shewan, C. M. and Kertesz, A. Reliability and validity characteristics of the Western Aphasia Battery (WAB). Journal of Speech and Hearing Disorders, 45(3), 1980, 308.",
      "doi": ""
    },
    {
      "text": "Shill, M. A. Motivational factors in aphasia therapy: Research suggestions. Journal of Communication Disorders, 12(6), 1979, 503--517.",
      "doi": ""
    },
    {
      "text": "Stotland, E. Exploratory investigations of empathy. Advances in experimental social psychology, 4, 1969, 271--314.",
      "doi": ""
    },
    {
      "text": "van de Sandt-Koenderman, M., Wiegers, J., and Hardy, P. A computerised communication aid for people with aphasia. Disability &amp;#38; Rehabilitation, 27(9), 2005, 529--533.",
      "doi": ""
    },
    {
      "text": "Weizenbaum, J. Contextual understanding by computers. Communications of the ACM, 10(8), 1967, 480.  ",
      "doi": "10.1145/363534.363545"
    },
    {
      "text": "Zion Software. JBuddy Messenger. (http://www.zionsoftware.com/products/messenger/.",
      "doi": ""
    }
  ]
}