{
  "doi": "10.1145/1978942.1979221",
  "title": "ShadowStory: creative and collaborative digital storytelling inspired by cultural heritage",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1919-1928",
  "year": 2011,
  "badges": [],
  "abstract": "With the fast economic growth and urbanization of many developing countries come concerns that their children now have fewer opportunities to express creativity and develop collaboration skills, or to experience their local cultural heritage. We propose to address these concerns by creating technologies inspired by traditional arts, and allowing children to create and collaborate through playing with them. ShadowStory is our first attempt in this direction, a digital storytelling system inspired by traditional Chinese shadow puppetry. We present the design and implementation of ShadowStory and a 7-day field trial in a primary school. Findings illustrated that ShadowStory promoted creativity, collaboration, and intimacy with traditional culture among children, as well as interleaved children's digital and physical playing experience.",
  "authors": [
    {
      "name": "Fei Lu",
      "institution": "Chinese Academy of Science, Beijing, China",
      "img": "/do/10.1145/contrib-81484645699/rel-imgonly/feilyu-120px.jpg",
      "acmid": "81484645699",
      "orcid": "missing"
    },
    {
      "name": "Feng Tian",
      "institution": "Chinese Academy of Science, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106876",
      "orcid": "0000-0002-6598-419X"
    },
    {
      "name": "Yingying Jiang",
      "institution": "Chinese Academy of Science, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319493799",
      "orcid": "missing"
    },
    {
      "name": "Xiang Cao",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100130420",
      "orcid": "missing"
    },
    {
      "name": "Wencan Luo",
      "institution": "Chinese Academy of Science, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460648823",
      "orcid": "missing"
    },
    {
      "name": "Guang Li",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/do/10.1145/contrib-81484642596/rel-imgonly/photo.png",
      "acmid": "81484642596",
      "orcid": "missing"
    },
    {
      "name": "Xiaolong Zhang",
      "institution": "Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491376",
      "orcid": "missing"
    },
    {
      "name": "Guozhong Dai",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100172122",
      "orcid": "missing"
    },
    {
      "name": "Hongan Wang",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100220294",
      "orcid": "0000-0002-9320-4920"
    }
  ],
  "references": [
    {
      "text": "Amicis, R. D., Girardi, G., Andreolli, M. and Conti, G. Game based technology to enhance the learning of history and cultural heritage. ACE, (2009), 451.  ",
      "doi": "10.1145/1690388.1690499"
    },
    {
      "text": "Barnes, C., Jacobs, D. E., Sanders, J., Goldman, D. B., Rusinkiewicz, S., Finkelstein, A. and Agrawala, M. Video Puppetry: A Performative Interface for Cutout Animation. ACM Transactions on Graphics, 27(5), 124: 1--9.  ",
      "doi": "10.1145/1409060.1409077"
    },
    {
      "text": "Benford, S., Bederson, B. B., Åkesson, K. P., Bayon, V., Druin, A., et al. Designing storytelling technologies to encourage collaboration between young children. CHI, (2000), 556--563.  ",
      "doi": "10.1145/332040.332502"
    },
    {
      "text": "Cao, X., Lindley, S. E., Helmes, J. and Sellen, A. Telling the whole story: Anticipation, inspiration and reputation in a field deployment of TellTable. CSCW, (2010), 251--260.  ",
      "doi": "10.1145/1718918.1718967"
    },
    {
      "text": "Cappelletti, A., Gelmini, G., Pianesi, F., Rossi, F. & Zancanaro, M. Enforcing cooperative storytelling: First studies. ICALT, (2004), 281--285. ",
      "doi": "10.5555/1018423.1019997"
    },
    {
      "text": "Cassell, J. and Ryokai, K. Making space for voice: Technologies to support children's fantasy and storytelling. Personal and Ubiquitous Computing 5, 3 (2001), 169--190.  ",
      "doi": "10.1007/PL00000018"
    },
    {
      "text": "Chinese Shadow Play - Precursor of Modern Cinema. http://traditions.cultural-china.com/en/17Traditions7497.html.",
      "doi": ""
    },
    {
      "text": "Chipman, G., Druin, A., Beer, D., Fails, J. A., Guha, M. L. and Simms, S. A case study of tangible flags: a collaborative technology to enhance field trips. IDC, (2006), 1--8.  ",
      "doi": "10.1145/1139073.1139081"
    },
    {
      "text": "Decortis, F. and Rizzo, A. New active tools for supporting narrative structures. Personal and Ubiquitous Computing 6, 5-6 (2002): 416--429.  ",
      "doi": "10.1007/s007790200046"
    },
    {
      "text": "Fernández, J. M. Multicultural videos: an interactive online museum based on an international artistic video database. CommunicabilityMS, (2008), 23--30.  ",
      "doi": "10.1145/1462039.1462045"
    },
    {
      "text": "Gao, J. Q. Psychology investigation of the generation born in 1990's and 2000's. Journal of Changchun Education Institute, 26, 2 (2010), 48--50.",
      "doi": ""
    },
    {
      "text": "Glos, J. W. and Cassell, J. Rosebud: technological toys for storytelling. CHI, (1997), 359--360.  ",
      "doi": "10.1145/1120212.1120433"
    },
    {
      "text": "Kam M., Kumar A., Jain S., Mathur A. and Canny J. Improving literacy in rural India: Cellphone games in an after-school program. ICTD, (2009), 139--150. ",
      "doi": "10.5555/1812530.1812545"
    },
    {
      "text": "Mandryk, R. L., Inkpen, K. M., Bilezikjian, M., Klemmer, S. R. and Landay, J. A. Supporting children's collaboration across handheld computers. CHI Ext. Abstracts, (2001), 255--256.  ",
      "doi": "10.1145/634067.634219"
    },
    {
      "text": "Parés, N., Carreras, A., Durany, J., Ferrer, J., Freixa, P., Gómez, D., Kruglanski, O., Parés, R., Ribas, J. I., Soler, M. and Sanjurjo, À. Promotion of creative activity in children with severe autism through visuals in an interactive multisensory environment. IDC, (2005), 110--116.  ",
      "doi": "10.1145/1109540.1109555"
    },
    {
      "text": "Parikh, T. S., Javid, P. Sasikumar K., Ghosh, K. and Toyama, K. Mobile phones and paper documents: evaluating a new approach for capturing microfinance data in rural India. CHI, (2006), 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Parikh, T. S. and Lazowska, E. D. Designing an architecture for delivering mobile information services to the rural developing world. WWW, (2006), 791--800.  ",
      "doi": "10.1145/1135777.1135897"
    },
    {
      "text": "Prasad, A., Medhi, I., Toyama, K. and Balakrishnan, R. Exploring the feasibility of video mail for illiterate users. AVI, (2008), 103--110.  ",
      "doi": "10.1145/1385569.1385588"
    },
    {
      "text": "Ryokai, K. and Cassell, J. StoryMat: A play space for collaborative storytelling. CHI, (1999), 272--273.  ",
      "doi": "10.1145/632716.632883"
    },
    {
      "text": "Ryokai, K. and Cassell, J. Computer support for children's collaborative fantasy play and storytelling. CSCL, (1999), 63. ",
      "doi": "10.5555/1150240.1150303"
    },
    {
      "text": "Ryokai, K., Marti, S. and Ishii, H. I/O Brush: Drawing with everyday objects as ink. CHI, (2004), 303--310.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Ruffaldi, E., Evangelista, C., Neri, V., Carrozzino, M. and Bergamasco, M. Design of information landscapes for cultural heritage content. DIMEA, (2008), 113--119.  ",
      "doi": "10.1145/1413634.1413659"
    },
    {
      "text": "Sawyer, R. K. Pretend play as improvisation: Conversation in the preschool classroom. Lawrence Erlbaum Associates Publishers, (1997).",
      "doi": ""
    },
    {
      "text": "Taoufik, I., Kabaili, H. and Kettani, D. Designing an e-government portal accessible to illiterate citizens. ICEGOV, (2007), 327--336.  ",
      "doi": "10.1145/1328057.1328125"
    },
    {
      "text": "The Convention for the Safeguarding of the Intangible Cultural Heritage. (2003). http://www.unesco.org/culture/ich/doc/src/01852-EN.pdf.",
      "doi": ""
    },
    {
      "text": "Tian, F., Lv, F., Wang, J. T., Wang, H. A., Luo, W. C., Kam, M., Setlur, V., Dai, G. Z. and Canny, J. Let's Play Chinese Characters - Mobile Learning Approaches via Culturally Inspired Group Games. CHI, (2010), 1603--1612.  ",
      "doi": "10.1145/1753326.1753565"
    },
    {
      "text": "WiTilt v3.0, sparkfun.com/commerce/product_info.php?products_id=8563.",
      "doi": ""
    }
  ]
}