{
  "doi": "10.1145/1978942.1978974",
  "title": "Speak little and well: recommending conversations in online social streams",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "217-226",
  "year": 2011,
  "badges": [],
  "abstract": "Conversation is a key element in online social streams such as Twitter and Facebook. However, finding interesting conversations to read is often a challenge, due to information overload and differing user preferences. In this work we explored five algorithms that recommend conversations to Twitter users, utilizing thread length, topic and tie-strength as factors. We compared the algorithms through an online user study and gathered feedback from real Twitter users. In particular, we investigated how users' purposes of using Twitter affect user preferences for different types of conversations and the performance of different algorithms. Compared to a random baseline, all algorithms recommended more interesting conversations. Further, tie-strength based algorithms performed significantly better for people who use Twitter for social purposes than for people who use Twitter for informational purpose only.",
  "authors": [
    {
      "name": "Jilin Chen",
      "institution": "University of Minnesota, Minneapolis, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487940",
      "orcid": "0000-0002-0513-7474"
    },
    {
      "name": "Rowan Nairn",
      "institution": "Palo Alto Research Center (PARC), Palo Alto, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416597973",
      "orcid": "missing"
    },
    {
      "name": "Ed Chi",
      "institution": "Palo Alto Research Center (PARC), Palo Alto, USA",
      "img": "/do/10.1145/contrib-81100330316/rel-imgonly/2018-edchi-dsc_3705-2048px.jpg",
      "acmid": "81100330316",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adomavicius, G. and Tuzhilin, A. 2005. Toward the next generation of recommender systems: A survey of the state-of-the-art and possible extensions. IEEE Transactions on Knowledge and Data Engineering, 17(6), 734--749.  ",
      "doi": "10.1109/TKDE.2005.99"
    },
    {
      "text": "Bernstein, M., Suh, B., Hong, L., et al. 2010. Eddi: Interactive topic-based browsing of social status streams. Proc. UIST'10.  ",
      "doi": "10.1145/1866029.1866077"
    },
    {
      "text": "Blei, D.M., Ng, A.Y., and Jordan, M.I. 2003. Latent Dirichlet allocation. Journal of Machine Learning Research 3, 4--5, 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "boyd, d., Golder, S., and Lotan, G. 2010. Tweet tweet retweet: Conversational aspects of retweeting on Twitter. Proc. HICSS '10.  ",
      "doi": "10.1109/HICSS.2010.412"
    },
    {
      "text": "Bryk, A.S., and Raudenbush, S. W. 1992. Hierarchical linear models: Applications and data analysis methods. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Chen, J., Nairn, R., Nelson, L., et al. 2010. Short and tweet: Experiments on recommending content from information streams. Proc. CHI '10.  ",
      "doi": "10.1145/1753326.1753503"
    },
    {
      "text": "Gilbert, E. and Karrahalios, K. 2009. Predicting tie strength with social media. Proc. CHI '09.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Granovetter, M.S. 1973. The strength of weak ties. The American Journal of Sociology, 78(6), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Guzdial, M. and Turns, J. 2000. Effective discussion through a computer-mediated anchored forum. Journal of the Learning Sciences, 9(4), 437--469.",
      "doi": ""
    },
    {
      "text": "Hochberg, Y. and Tamhane, A. C. 1987. Multiple Comparison Procedures. Wiley. ",
      "doi": "10.5555/39892"
    },
    {
      "text": "1Honeycutt, C. and Herring, S.C. 2009. Beyond microblogging: Conversation and collaboration via Twitter. Proc. HICSS '09.  ",
      "doi": "10.1109/HICSS.2009.89"
    },
    {
      "text": "Java, A., Song, X., Finin, T., et al. 2007. Why we twitter: Understanding microblogging usage and communities. Proc. WebKDD '07, 56--65.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Joinson, A.N. 2008. Looking at, looking up or keeping up with people?: Motives on the use of Facebook. Proc CHI '08.  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Kincaid, J. 2010. EdgeRank: The secret sauce that makes Facebook's news feed tick. Retrieved from http://techcrunch.com/2010/04/22/facebook-edgeran.",
      "doi": ""
    },
    {
      "text": "Naaman, M., Boase, J., and Lai, C. 2010. Is it really about me? Message content in social awareness streams. Proc. CSCW '10.  ",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Paek, T., Gamon, M., Counts, S., et al. 2010. Predicting the importance of newsfeed posts and social network friends. Proc. AAAI '10.",
      "doi": ""
    },
    {
      "text": "Ramage, D., Dumais, S., and Liebling, D. 2010. Characterizing microblogs with topic models. Proc. ICWSM '10.",
      "doi": ""
    },
    {
      "text": "Salton, G. and Buckley, C. 1988. Term-weighting approaches in automatic text retrieval. Information Processing and Management, 24(5), 513--523.  ",
      "doi": "10.1016/0306-4573%2888%2990021-0"
    },
    {
      "text": "Zhang, J., Qu, Y., Cody, J., et al. 2010. A case study of micro-blogging in the enterprise: use, value, and related issues. Proc. CHI '10.  ",
      "doi": "10.1145/1753326.1753346"
    },
    {
      "text": "Zhao, D. and Rosson, M. B. 2009. How and why people Twitter: the role that micro-blogging plays in informal communication at work. Proc. GROUP '09..  ",
      "doi": "10.1145/1531674.1531710"
    }
  ]
}