{
  "doi": "10.1145/1978942.1979273",
  "title": "From garments to gardens: negotiating material relationships online and 'by hand'",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2257-2266",
  "year": 2011,
  "badges": [],
  "abstract": "From home improvement to scrapbooking, leisure activities performed \"by hand\" increasingly involve digital tools. In turn, software and devices to support handwork are proliferating. We use data from an observational field study of gardening and knitting to examine relationships to information technology. Handwork experiences of patience, effort, sensation, and cleverness can shift with the introduction of new tools. Our participants' attachment to these experiences made them sensitive to the potential consequences of introducing new tools. Digital tools were sometimes rejected and other times woven into handwork activities. In response, we propose three metaphors for handwork practice - extending, interjecting, and segmenting - as a resource for moving beyond the binary opposition of digital and physical practices.",
  "authors": [
    {
      "name": "Elizabeth Goodman",
      "institution": "University of California, Berekely, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578588",
      "orcid": "missing"
    },
    {
      "name": "Daniela Rosner",
      "institution": "University of California, Berekely, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    }
  ],
  "references": [
    {
      "text": "Adamson, G. 2008. Thinking Through Craft. Oxford: Berg.",
      "doi": ""
    },
    {
      "text": "Armstrong, A. and Hagel, J. 2000. The Real Value of On-line Communities. In Knowledge and Communities. Eds. Lesser E. L., et al. Newton, MA: Butterworth-Heinemann.",
      "doi": ""
    },
    {
      "text": "Bødker, S. 2000. Scenarios in user-centred design - setting the stage for reflection and action. Interacting with Com-puters. 13(1): 61--75.",
      "doi": ""
    },
    {
      "text": "Blanchette, J.-F. A Material History of Bits. (in preparation). Retrieved on January 10, 2011 from http://polaris.gseis.ucla.edu/blanchette/papers/materiality.pdf.  ",
      "doi": "10.1002/asi.21542"
    },
    {
      "text": "Buechley, L. and Hill, B. M. 2010. LilyPad in the wild: how hardware's long tail is supporting new engineering and design communities. In Proc. DIS '10. ACM Press, 199--207.  ",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Crawford, M. B. 2009. Shop Class as Soulcraft: An Inquiry into the Value of Work. London: Penguin Press.",
      "doi": ""
    },
    {
      "text": "Dormer, P. 1997. The language and practical philosophy of craft. In The Culture of Craft, P. Dormer (ed.). Manchester: Manchester UK.",
      "doi": ""
    },
    {
      "text": "Francis M. and Hester R. T. 1990. The Garden as Idea, Place, Action. Pp 7--20 in The Meaning of Gardens. Eds. M. Francis and R. T. Hester. Cambridge, MA: The MIT Press.",
      "doi": ""
    },
    {
      "text": "Greenhalgh, P. 1997. The language and practical philosophy of craft. In The Culture of Craft. Ed. P. Dormer. Manchester, UK: Manchester University Press.",
      "doi": ""
    },
    {
      "text": "Grimes, A. and Harper, R. 2008. Celebratory Technology: New Directions for Food Research in HCI. In Proc. CHI 2008. ACM Press, 467--476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Ingold, T. 2010. The textility of making. Cambridge Journal of Economics. 34(1): 91--102.",
      "doi": ""
    },
    {
      "text": "Johnson, J. S., Hawley, J. 2004. Technology's impact on creative traditions: Pieceful co-existence in quilting. Clothing and Textiles Research Journal, 22(1/2), 69--78.  ",
      "doi": "10.1023/B%3ABTTJ.0000033472.89206.41"
    },
    {
      "text": "Johnson, J. S., Wilson L. E. 2005. \"It Says You Really Care\": Motivational Factors of Contemporary Female Handcrafters. Clothing and Textiles Research Journal.",
      "doi": ""
    },
    {
      "text": "Klemmer, S. R., Hartmann, B. and Takayama, L. 2006. How bodies matter: five themes for interaction design. In Proc. DIS '06. ACM Press, 140--149.  ",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Kitchen, N. R. 2008. Emerging technologies for real-time and integrated agriculture decisions. Computers and Electronics in Agriculture. 61(1): 1--3.  ",
      "doi": "10.1016/j.compag.2007.06.007"
    },
    {
      "text": "Kuznetsov, S. and Paulos, E. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proc. NordiCHI '10. ACM Press, 295--304.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Levine, F. and Heimerl, C. Handmade Nation: The Rise of DIY, Art, Craft, and Design. Princeton, NJ: Princeton Architectural Press, 2008.",
      "doi": ""
    },
    {
      "text": "Lucie-Smith, E. 1983. The story of craft: the craftsman's role in society. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. and Wright, P. 2004. Technology as Experience. Cambridge, MA: MIT Press. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "McCullough, M. 1996. Abstracting Craft: The Practiced Digital Hand. Cambridge, MA: MIT Press. ",
      "doi": "10.5555/524384"
    },
    {
      "text": "Minahan, S., & Cox, J. W. 2007. Stitch' n bitch - Cyberferninism, a third place and the new materiality. Journal of Material Culture, 12(1): 5--21.",
      "doi": ""
    },
    {
      "text": "The National NeedleArts Association. 2007. The State of Specialty NeedleArts 2007: Executive Summary.",
      "doi": ""
    },
    {
      "text": "Pudup, M. B. 2008. It takes a garden: Cultivating citizen-subjects in organized garden projects. Geoforum. 39(3): 1228--1240.",
      "doi": ""
    },
    {
      "text": "Pye, D. The nature and art of workmanship. 1995. London: Herbert Press.",
      "doi": ""
    },
    {
      "text": "Repperger, D. and Phillips, C. 2009. The Human Role in Automation. In Springer Handbook of Automation. Ed. S.Y. Nof. Berlin: Springer-Verlag.",
      "doi": ""
    },
    {
      "text": "Robles, E. and Wiberg, M. Texturing the \"Material Turn\" in Interaction Design. In Proc. TEI '10. ACM Press, 137--144.  ",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Rosner, D. K., Ryokai, K. 2009. Reflections on Craft: Probing the Creative Process of Everyday Knitters. In Proc. C & C '09. ACM Press, 195--204.  ",
      "doi": "10.1145/1640233.1640264"
    },
    {
      "text": "Scheper-Hughes, N. 2003. Anatomy of a Quilt: The Gees' Bend Freedom Quilting Bee. Anthropology Today. 19(4):15--21.",
      "doi": ""
    },
    {
      "text": "Sennett, R. 2008. The Craftsman. New Haven, CT: Yale University Press.",
      "doi": ""
    },
    {
      "text": "Taylor, A., Wyche, S. and Kaye, J. 2008. Pottering by design. In Proc NordiCHI '08. ACM Press, 363--372.  ",
      "doi": "10.1145/1463160.1463200"
    },
    {
      "text": "Torrey, C., Churchill, E., McDonald, D. 2009. Learning How: The Search for Craft Knowledge on the Internet. In Proc. CHI'09. ACM Press, 1371--1381.  ",
      "doi": "10.1145/1518701.1518908"
    },
    {
      "text": "Torrey, C., D. W. McDonald, B. N. Schilit and S. Bly. 2007. How-To Pages: Informal Systems of Expertise Sharing. In Proc. ECSCW '07. Springer, 391--410.",
      "doi": ""
    },
    {
      "text": "Turner-Rahman, G. 2008. Parallel Practices and the Dialectics of Open Creative Production. Journal of Design History. 22(4): 71--386. .",
      "doi": ""
    },
    {
      "text": "Wood, N., Rust, C., and Horne, G. 2009. A Tacit Understanding: The Designer's Role in Capturing and Passing on the Skilled Knowledge of Master Craftsmen. International Journal of Design {Online} 3:3.",
      "doi": ""
    },
    {
      "text": "Wright, P., Wallace, J., and McCarthy, J. 2008. Aesthetics and experience-centred design ACM TOCHI. 15(4): 1--21.  ",
      "doi": "10.1145/1460355.1460360"
    },
    {
      "text": "Zerubavel, E. 1992. Hidden Rhythm. Berkeley, CA: U. of California P.",
      "doi": ""
    }
  ]
}