{
  "doi": "10.1145/1978942.1979181",
  "title": "The effects of task dimensionality, endpoint deviation, throughput calculation, and experiment design on pointing measures and models",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1639-1648",
  "year": 2011,
  "badges": [],
  "abstract": "Fitts' law (1954) characterizes pointing speed-accuracy performance as throughput, whose invariance to target distances (A) and sizes (W) is known. However, it is unknown whether throughput and Fitts' law models in general are invariant to task dimensionality (1-D vs. 2-D), whether univariate (SDx) or bivariate (SDx,y) endpoint deviation is used, whether throughput is calculated using the mean-of-means approach or the slope-inverse approach, or whether Guiard's (2009) Form - Scale experiment design is used instead of fully crossed A-W factors. We empirically investigate the confluence of these issues, finding that Fitts' law is largely invariant across 1-D and 2-D, provided that univariate endpoint deviation (SDx) is used in both, but that for 2-D pointing data, bivariate endpoint deviation (SDx,y) results in better Fitts' law models. Also, the mean-of-means throughput calculation exhibits lower variance across subjects and dimensionalities than the slope-inverse calculation. In light of these and other findings, we offer recommendations for pointing evaluations, especially in 2-D. We also offer an evaluation tool called Fitts Study to facilitate comparisons.",
  "tags": [
    "effective target width",
    "Fittsstudy",
    "endpoint deviation",
    "throughput",
    "dimensionality",
    "Fitt's Law"
  ],
  "authors": [
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    },
    {
      "name": "Kristen Shinohara",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501668",
      "orcid": "0000-0002-1157-6369"
    },
    {
      "name": "Alex Jansen",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470650697",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. (1997). Beyond Fitts' law: Models for trajectory-based HCI tasks. Proc. CHI '97. New York: ACM Press, 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Accot, J. and Zhai, S. (2003). Refining Fitts' law models for bivariate pointing. Proc. CHI '03. New York: ACM Press, 193--200.  ",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "Card, S.K., English, W.K. and Burr, B.J. (1978). Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT. Ergonomics 21 (8), 601--613.",
      "doi": ""
    },
    {
      "text": "Crossman, E.R.F.W. (1957). The speed and accuracy of simple hand movements. In The Nature and Acquisition of Industrial Skills, Crossman and Seymour (eds.). Report to the Joint Committee on Individual Efficiency in Industry.",
      "doi": ""
    },
    {
      "text": "Douglas, S.A., Kirkpatrick, A.E. and MacKenzie, I.S. (1999). Testing pointing device performance and user assessment with the ISO 9241, Part 9 standard. Proc. CHI '99. New York: ACM Press, 215--222.  ",
      "doi": "10.1145/302979.303042"
    },
    {
      "text": "Findlater, L., Jansen, A., Shinohara, K., Dixon, M., Kamb, P., Rakita, J. and Wobbrock, J.O. (2010). Enhanced area cursors: Reducing fine-pointing demands for people with motor impairments. Proc. UIST '10. New York: ACM Press, 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Fitts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. J. Experimental Psychology 47 (6), 381--391.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. and Radford, B.K. (1966). Information capacity of discrete motor responses under different cognitive sets. J. Experimental Psychology 71 (4), 475--482.",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. (2005). A probabilistic approach to modeling two-dimensional pointing. ACM Transactions on Computer-Human Interaction 12 (3), 435--459.  ",
      "doi": "10.1145/1096737.1096741"
    },
    {
      "text": "Grossman, T., Kong, N. and Balakrishnan, R. (2007). Modeling pointing at targets of arbitrary shapes. Proc. CHI '07. New York: ACM Press, 463--472.  ",
      "doi": "10.1145/1240624.1240700"
    },
    {
      "text": "Guiard, Y. (2009). The problem of consistency in the design of Fitts' law experiments: Consider either target distance and width or movement form and scale. Proc. CHI '09. New York: ACM Press, 1809--1818.  ",
      "doi": "10.1145/1518701.1518980"
    },
    {
      "text": "Hancock, P.A. and Newell, K.M. (1985). The movement speed-accuracy relationship in space-time. In Motor Behavior: Programming, Control, and Acquisition, Heuer, Kleinbeck and Schmidt (eds.). New York: Springer-Verlag, 153--188.",
      "doi": ""
    },
    {
      "text": "International Organization for Standardization. (2002). Ergonomic requirements for office work with visual display terminals (VDTs)'\"Requirements for non-keyboard input devices. Ref. No. ISO 9241--9:2000(E).",
      "doi": ""
    },
    {
      "text": "Jagacinski, R.J. and Monk, D.L. (1985). Fitts' law in two dimensions with hand and head movements. J. Motor Behavior 17 (1), 77--95.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. (1992). Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7 (1), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "MacKenzie, I.S. and Buxton, W. (1992). Extending Fitts' law to two-dimensional tasks. Proc. CHI '92. New York: ACM Press, 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "MacKenzie, I.S., Kauppinen, T. and Silfverberg, M. (2001). Accuracy measures for evaluating computer pointing devices. Proc. CHI '01. New York: ACM Press, 9--16.  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "MacKenzie, I.S. and Soukoreff, R.W. (2003). Card, English, and Burr (1978)-25 years later. Extended Abstracts CHI '03. New York: ACM Press, 760--761.  ",
      "doi": "10.1145/765891.765974"
    },
    {
      "text": "MacKenzie, I.S. and Isokoski, P. (2008). Fitts' throughput and the speed-accuracy tradeoff. Proc. CHI '08. New York: ACM Press, 1633--1636.  ",
      "doi": "10.1145/1357054.1357308"
    },
    {
      "text": "Murata, A. (1996). Empirical evaluation of performance models of pointing accuracy and speed with a PC mouse. Int'l J. Human-Computer Interaction 8 (4), 457--469.  ",
      "doi": "10.1080/10447319609526164"
    },
    {
      "text": "Murata, A. (1999). Extending effective target width in Fitts' law to a two-dimensional pointing task. Int'l J. Human-Computer Interaction 11 (2), 137--152.",
      "doi": "10.5555/647944.743788"
    },
    {
      "text": "Schedlbauer, M. (2007). An extensible platform for the interactive exploration of Fitts' law and related movement time models. Extended Abstracts CHI '07. New York: ACM Press, 2633--2638.  ",
      "doi": "10.1145/1240866.1241054"
    },
    {
      "text": "Schmidt, R.A., Zelaznik, H., Hawkins, B., Frank, J.S. and Quinn, J.T. (1979). Motor-output variability: A theory for the accuracy of rapid motor acts. Psychological Review 86 (5), 415--451.",
      "doi": ""
    },
    {
      "text": "Sheikh, I.H. and Hoffmann, E.R. (1994). Effect of target shape on movement time in a Fitts task. Ergonomics 37 (9), 1533--1547.",
      "doi": ""
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. (1995). Generalized Fitts' law model builder. Companion to CHI '95. New York: ACM Press, 113--114.  ",
      "doi": "10.1145/223355.223456"
    },
    {
      "text": "Soukoreff, R.W. and MacKenzie, I.S. (2004). Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. Int'l J. Human-Computer Studies 61 (6), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Welford, A.T. (1968). Fundamentals of Skill. London, England: Methuen.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J.O., Cutrell, E., Harada, S. and MacKenzie, I.S. (2008). An error model for pointing based on Fitts' law. Proc. CHI '08. New York: ACM Press, 1613--1622.  ",
      "doi": "10.1145/1357054.1357306"
    },
    {
      "text": "Wobbrock, J.O., Jansen, A. and Shinohara, K. (2011). Modeling and predicting pointing errors in two dimensions. Proc. CHI '11. New York: ACM Press. To appear.  ",
      "doi": "10.1145/1978942.1979183"
    },
    {
      "text": "Zhai, S. (2004). Characterizing computer input with Fitts' law parameters-the information and non-information aspects of pointing. Int'l J. Human-Computer Studies 61 (6), 791--809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    },
    {
      "text": "Zhai, S., Kong, J. and Ren, X. (2004). Speed-accuracy tradeoff in Fitts' law tasks-on the equivalency of actual and nominal pointing precision. Int'l J. Human-Computer Studies 61 (6), 823--856.  ",
      "doi": "10.1016/j.ijhcs.2004.09.007"
    }
  ]
}