{
  "doi": "10.1145/1978942.1979044",
  "title": "In the shadow of misperception: assistive technology use and social interactions",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "705-714",
  "year": 2011,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Few research studies focus on how the use of assistive technologies is affected by social interaction among people. We present an interview study of 20 individuals to determine how assistive technology use is affected by social and professional contexts and interactions. We found that specific assistive devices sometimes marked their users as having disabilities; that functional access took priority over feeling self-conscious when using assistive technologies; and that two misperceptions pervaded assistive technology use: (1) that assistive devices could functionally eliminate a disability, and (2) that people with disabilities would be helpless without their devices. Our findings provide further evidence that accessibility should be built into mainstream technologies. When this is not feasible, assistive devices should incorporate cutting edge technologies and strive to be designed for social acceptability, a new design approach we propose here.",
  "tags": [
    "stigma",
    "product design",
    "assistive devices",
    "interface design",
    "social interactions",
    "accessibility"
  ],
  "authors": [
    {
      "name": "Kristen Shinohara",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501668",
      "orcid": "0000-0002-1157-6369"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "National Library Service for the Blind and Physically Handicapped. http://www.loc.gov/nls/. September 2010.",
      "doi": ""
    },
    {
      "text": "Bispo, R. and Branco, R. (2008). Designing out stigma: the role of objects in the construction of disabled people's identity. Dare to Desire: 6th Int'l Design &amp;#38; Emotion Conf. Hong Kong.",
      "doi": ""
    },
    {
      "text": "Bispo, R. and Branco, V. (2009). Designing out stigma: the potential of contradictory symbolic imagery. Proc. Include 2009. London.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T. P. and Newell, A. (1983). The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Charlton, J. I. (1998). Nothing about us without us: disability oppression and empowerment. Univ. of California Press, Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "Cook, A. M. and Hussey, S. M. (2002). Assistive Technologies: Principles and Practice. Second Ed. Mosby, Inc., St. Louis, MO.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. and Rochberg-Halton, E. (1981). The meaning of things. Cambridge Univ. Press, NY.",
      "doi": ""
    },
    {
      "text": "Denning, T., Borning, A., Friedman, B., Gill, B. T., Kohno, T. and Maisel, W. H. (2010). Patients, pacemakers, and implantable defibrillators: human values and security for wireless implantable medical devices. Proc. CHI '10. Atlanta, GA, ACM, 917--926.  ",
      "doi": "10.1145/1753326.1753462"
    },
    {
      "text": "Dijksterhuis, A. and Nordgren, L. F. (2006). A theory of unconscious thought. Persp. on Psych. Sci. 1 (2), 95--109.",
      "doi": ""
    },
    {
      "text": "Edwards, A. D. N. (1995). Extra-Ordinary Human-Computer Interaction: Interfaces for Users with Disabilities. Univ. of Cambridge Press, Cambridge. ",
      "doi": "10.5555/215596"
    },
    {
      "text": "Elliott, G. C., Ziegler, H. L., Altman, B. M. and Scott, D. R. (1982). Understanding stigma. Deviant Behavior. 3 (3), 275--300.",
      "doi": ""
    },
    {
      "text": "Fine, M. and Asch, A. (1988). Disability Beyond Stigma: Social Interaction, Discrimination, and Activism. Journal of Social Issues. 44 (1), 3--21.",
      "doi": ""
    },
    {
      "text": "Glaser, B. G. and Strauss, A. L. (1967). The Discovery of Grounded Theory. Aldine Publishing Co, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Goffman, E. (1959). The presentation of self in everyday life. Doubleday, Garden City, NY.",
      "doi": ""
    },
    {
      "text": "Goffman, E. (1963). Stigma; notes on the management of spoiled identity. Prentice-Hall, Englewood Cliffs, NJ.",
      "doi": ""
    },
    {
      "text": "Gray, D. B., Quatrano, L. A. and Lieberman, M. L. (1998). Designing and using assistive technology: the human perspective. P. H. Brookes Pub. Co., Baltimore.",
      "doi": ""
    },
    {
      "text": "Jacobson, S. (2010). Overcoming Stigma Associated with Assistive Devices. 7th Int'l Conf. on Design and Emotion. Chicago, IL.",
      "doi": ""
    },
    {
      "text": "Pape, T. L.-B., Kim, J. and Weiner, B. (2002). The shaping of individual meanings assigned to assistive technology: a review of personal factors. Disability and Rehabilitation. 24 (1/2/3), 5--20.",
      "doi": ""
    },
    {
      "text": "Parette, P. and Scherer, M. (2004). Assistive Technology Use and Stigma. Education and Training in Developmental Disabilities. 39 (3), 217--226.",
      "doi": ""
    },
    {
      "text": "Phillips, B. and Zhao, H. (1993). Predictors of assistive technology abandonment. Assistive technology: the official journal of RESNA. 5 (1), 36--45.",
      "doi": ""
    },
    {
      "text": "Pullin, G. (2009). Design meets disability. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Riemer-Reiss, M. L. and Wacker, R. R. (2000). Factors Associated with Assistive Technology Discontinuance Among Individuals with Disabilities. Journal of Rehabilitation. 66 (3), 44--50.",
      "doi": ""
    },
    {
      "text": "Scherer, M. J. (1993). Living in the state of stuck: how technologies affect the lives of people with disabilities. Brookline Books, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Shinohara, K. and Tenenberg, J. (2009). A blind person's interactions with technology. Comm. ACM. 52 (8), 58--66.  ",
      "doi": "10.1145/1536616.1536636"
    },
    {
      "text": "Strauss, A. L. and Corbin, J. M. (1998). Basics of qualitative research. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    }
  ]
}