{
  "doi": "10.1145/1978942.1979129",
  "title": "Using fast interaction to create intense experiences",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1255-1264",
  "year": 2011,
  "badges": [],
  "abstract": "Several emerging strands of HCI involve connecting physical exercise activity with digital interactive systems to create intense combined experiences, for example pervasive games, GPS based exercise games and 'exertion interfaces'. Many of these systems are mobile, used outside in public, whilst moving quickly through the environment. In this paper, we argue that the combination of moving fast and interacting with a digital system allows us to create a powerfully intense experience for participants, and that key to this is careful attention to the way in which movement is combined with digital content.  We study an interactive art experience in which a person runs whilst listening to poetry. Based on this study and other HCI research, we present a framework for mixing physical and interactive content, based on 3 dimensions, which describe ways that a movement activity may itself create intense experiences, followed by a set of tactics for combining intense movement and interactive content.",
  "authors": [
    {
      "name": "Joe Marshall",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331498971",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ballagas, R., Kuntze, A., and Walz, S.P. Gaming tourism: Lessons from evaluating rexplorer, a pervasive game for tourists. Proc. Pervasive 2008.  ",
      "doi": "10.1007/978-3-540-79576-6_15"
    },
    {
      "text": "Benford, S. Crabtree, A. et al. The frame of the game: blurring the boundary between fiction and reality in mobile experiences. Proc CHI 2006. 427--43.  ",
      "doi": "10.1145/1124772.1124836"
    },
    {
      "text": "Boyd Davis, S., Moar, M., Jacobs, R., Watkins, M., Riddoch, C., and Cooke, K. Ere be dragons: Heartfelt gaming. Digital Creativity 17 (3).",
      "doi": ""
    },
    {
      "text": "Brunnberg, L. The Road Rager: making use of traffic encounters in a mobile multiplayer game. Proc. 3rd Conf. Mobile Ubiquitous Media (2004), 33--3.  ",
      "doi": "10.1145/1052380.1052386"
    },
    {
      "text": "Burnett, G. and Porter, J. Ubiquitous computing within cars: designing controls for non-visual use. Int. Jnl. Human Computer Studies 55(4) (2001), 521--53.  ",
      "doi": "10.1006/ijhc.2001.0482"
    },
    {
      "text": "Csíkszentmihályi, M. \"Flow: The Psychology of Optimal Experience\", Harper and Row (1990.",
      "doi": ""
    },
    {
      "text": "Endomondo (2009), http://www.endomondo.co.",
      "doi": ""
    },
    {
      "text": "Hertz, G. OutRun: perversive games and designing the de-simulation of eight-bit driving, Proc. 5th Conf. Foundations of Digital Games (2010.  ",
      "doi": "10.1145/1822348.1822358"
    },
    {
      "text": "Hockey, J. Knowing the route: Distance runners' mundane knowledge. Sociology of Sport Online 7 (1), (2004), 1--1.",
      "doi": ""
    },
    {
      "text": "Höysniemi, J., Aula, A., Auvinen, P., Hännikäinen, J., and Hämäläinen, P. Shadow boxer: a physically interactive fitness game. Proc. of NordiCHI 200.",
      "doi": ""
    },
    {
      "text": "1Isbister, K., Höök, K. On Being Supple: In Search of Rigor without Rigidity in Meeting New Design and Evaluation Challenges for HCI Practitioners, Proc CHI 200.  ",
      "doi": "10.1145/1518701.1519042"
    },
    {
      "text": "Konami, Dance Dance Revolution. (1998.",
      "doi": ""
    },
    {
      "text": "Liljedahl, M., Lindberg, S., Berg, J. Digiwall: an interactive climbing wall. Proc. ACE 2005, 225--22.  ",
      "doi": "10.1145/1178477.1178513"
    },
    {
      "text": "Linehan, C., Kirman, B., Lawson, S. and Doughty, M. Blowtooth: pervasive gaming in unique and challenging environments. Ext. Abstracts CHI 2010.  ",
      "doi": "10.1145/1753846.1753853"
    },
    {
      "text": "Marshall, J., Rowland, D., Rennick Egglestone, S., Benford, S., Walker, B., McAuley, D. Breath Control of Amusement Rides. Proc CHI 2011.  ",
      "doi": "10.1145/1978942.1978955"
    },
    {
      "text": "Möhlenkamp S, Lehmann N, et al. Running: the risk of coronary events : Prevalence and prognostic relevance of coronary atherosclerosis in marathon runners. European Heart Journal 29(15), (2008) 1800--180.",
      "doi": ""
    },
    {
      "text": "Mopius RealReplay. (2005) http:// mopius.com.",
      "doi": ""
    },
    {
      "text": "Mueller, F., O'Brien, S. and Thorogood, A. Jogging over a distance: supporting a \"jogging together\" experience although being apart. Extended Abstracts CHI 200.",
      "doi": ""
    },
    {
      "text": "Mueller, F., Stevens, G., Thorogood, A., O'Brien, S., and Wulf, V. Sports over a distance. Personal Ubiquitous Comput. 11, 8 (2007), 633--64.  ",
      "doi": "10.1007/s00779-006-0133-0"
    },
    {
      "text": "Nenonen, V., Lindblad, A., Häkkinen, V., Laitinen, T., Jouhtio, M. and Hämäläinen, P. Using heart rate to control an interactive game. Proc. CHI 2007, 853--85.  ",
      "doi": "10.1145/1240624.1240752"
    },
    {
      "text": "2Nintendo, Wii Fit. (2007.",
      "doi": ""
    },
    {
      "text": "2Pettitt, M., Burnett, G., Stevens, A. An extended keystroke level model (KLM) for predicting the visual demand of in-vehicle information systems. Proc CHI 2007 1515--152.  ",
      "doi": "10.1145/1240624.1240852"
    },
    {
      "text": "Reeves, S., Benford, S., O'Malley, C. and Fraser, M. Designing the spectator experience. Proc. CHI 200.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Rico, J and Brewster, S. Usable gestures for mobile interfaces: evaluating social acceptability. Proc. CHI 2010.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Rowland, D., Flintham, M., Oppermann, L., Marshall, J. et al. Ubikequitous computing: designing interactive experiences for cyclists. Proc MobileHCI 2009.  ",
      "doi": "10.1145/1613858.1613886"
    },
    {
      "text": "Scheible, J. Mobile phone programming for multimedia. Proc Multimedia 2007.  ",
      "doi": "10.1145/1291233.1291240"
    },
    {
      "text": "Sengers, P. and Gaver, B. \"Staying open to interpretation: engaging multiple meanings in design and evaluation\". Proc DIS 2006.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Simpson, S.D. and Karageorghis, C.I. The effects of synchronous music on 400-m sprint performance. Journal of Sports Science 24 (2006), 1095--1102.",
      "doi": ""
    },
    {
      "text": "Smith, P. \"Babelogue\", Easter, Arista Records, 1978..",
      "doi": ""
    }
  ]
}