{
  "doi": "10.1145/1978942.1979175",
  "title": "FingerGlass: efficient multiscale interaction on multitouch screens",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1601-1610",
  "year": 2011,
  "badges": [],
  "abstract": "Many tasks in graphical user interfaces require users to interact with elements at various levels of precision. We present FingerGlass, a bimanual technique designed to improve the precision of graphical tasks on multitouch screens. It enables users to quickly navigate to different locations and across multiple scales of a scene using a single hand. The other hand can simultaneously interact with objects in the scene. Unlike traditional pan-zoom interfaces, FingerGlass retains contextual information during the interaction. We evaluated our technique in the context of precise object selection and translation and found that FingerGlass significantly outperforms three state-of-the-art baseline techniques in both objective and subjective measurements: users acquired and translated targets more than 50% faster than with the second-best technique in our experiment.",
  "tags": [
    "navigation",
    "multiscale interaction",
    "bimanual",
    "fat finger problem",
    "touch screens",
    "object translation",
    "precise selection"
  ],
  "authors": [
    {
      "name": "Dominik P. Käser",
      "institution": "University of California, Berkeley; ETH Zürich; Pixar Animation Studios, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81484651737/rel-imgonly/150223_459650353800_569658800_5350646_1160313_n.jpg",
      "acmid": "81484651737",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Mark Pauly",
      "institution": "École Polytechnique Fédérale de Lausanne, Lausanne, Switzerland",
      "img": "/do/10.1145/contrib-81100582775/rel-imgonly/mark.jpg",
      "acmid": "81100582775",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "P.-A. Albinsson and S. Zhai. High precision touch screen interaction. In Proceedings of CHI '03, page 105, 2003.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "C. Appert, O. Chapuis, and E. Pietriga. High-precision magnification lenses. Proc. CHI '10, page 273, 2010.  ",
      "doi": "10.1145/1753326.1753366"
    },
    {
      "text": "P. Baudisch, E. Cutrell, D. Robbins, M. Czerwinski, P. Tandler, B. Bederson, and A. Zierlinger. Drag-and-Pop and Drag-and-Pick. In Proc. INTERACT 03, 2003.",
      "doi": ""
    },
    {
      "text": "B. B. Bederson and J. D. Hollan. Pad++: A zooming graphical interface for exploring alternate interface physics. In Proc. UIST '94, pages 17--26, 1994.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "H. Benko, A.Wilson, and P. Baudisch. Precise selection techniques for multi-touch screens. Proceedings of CHI '06, pages 1263--1272, 2006.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "E. Bier, M. Stone, K. Pier, W. Buxton, and T. DeRose. Toolglass and magic lenses: the see-through interface. In Proceedings of SIGGRAPH '93, page 80, 1993.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "R. Blanch, Y. Guiard, and M. Beaudouin-Lafon. Semantic pointing: improving target acquisition with control-display ratio adaptation. Proc. CHI '04, 2004.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "N. Elmqvist, Y. Riche, N. Henry-Riche, and J.-D. Fekete. Melange: Space folding for visual exploration. IEEE transactions on visualization and computer graphics, 16(3):468--83, 2010.  ",
      "doi": "10.1109/TVCG.2009.86"
    },
    {
      "text": "A. Esenther and K. Ryall. Fluid DTMouse: Better mouse support for touch-based interactions. In Proc. AVI '06, pages 112--115, 2006.  ",
      "doi": "10.1145/1133265.1133289"
    },
    {
      "text": "L. Findlater, A. Jansen, K. Shinohara, M. Dixon, P. Kamb, J. Rakita, and J. O. Wobbrock. Enhanced area cursors: Reducing fine pointing demands for people with motor impairments. In Proc. UIST '10, 2010.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "P. M. Fitts. The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement. Journal of Experimental Psychology, 47:381--391, 1954.",
      "doi": ""
    },
    {
      "text": "C. Forlines and C. Shen. DTLens: Multi-user tabletop spatial data exploration. In Proc. UIST 2005, pages 119--122, 2005.  ",
      "doi": "10.1145/1095034.1095055"
    },
    {
      "text": "C. Forlines, D. Wigdor, C. Shen, and R. Balakrishnan. Direct-touch vs. mouse input for tabletop displays. Proc. CHI '07, page 647, 2007.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "G. W. Furnas. Generalized fisheye views. Proc. CHI '86, 1986.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "G. W. Furnas and B. B. Bederson. Space-scale diagrams: understanding multiscale interfaces. Proc. CHI '95, 1995.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "T. Grossman and R. Balakrishnan. The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. Proc. CHI '05, 2005.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Y. Guiard. Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. Journal of Motor Behavior, pages 486--517, 1987.",
      "doi": ""
    },
    {
      "text": "K. Hinckley, R. Pausch, D. Proffitt, and N. F. Kassell. Two-handed virtual manipulation. ACM TOCHI, 5(3):260--302, Sept. 1998.  ",
      "doi": "10.1145/292834.292849"
    },
    {
      "text": "K. Hornbaek, B. B. Bederson, and C. Plaisant. Navigation Patterns and Usability of Zoomable User Interfaces with and without an Overview. ACM TOCHI, 9(4):362--389, 2002.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "T. Igarashi and K. Hinckley. Speed-dependent Automatic Zooming for Browsing Large Documents. In Proc. UIST '00, pages 139--148, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "A. K. Karlson and B. B. Bederson. Direct Versus Indirect Input Methods for One-Handed Touchscreen Mobile Computing, 2007.",
      "doi": ""
    },
    {
      "text": "K. Kin, T. Miller, B. Bollensdorff, T. DeRose, B. Hartmann, and M. Agrawala. Eden: A professional multitouch tool for constructing virtual organic environments. In Proc. CHI '11, 2011.  ",
      "doi": "10.1145/1978942.1979141"
    },
    {
      "text": "J. D. Mackinlay, G. G. Robertson, and S. K. Card. The perspective wall: detail and context smoothly integrated. In Proc. CHI '91, 1991.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "J. Mankoff, S. E. Hudson, and G. D. Abowd. Interaction techniques for ambiguity resolution in recognition-based interfaces. In Proc. UIST '00, pages 11--20, 2000.  ",
      "doi": "10.1145/354401.354407"
    },
    {
      "text": "T. Moscovich. Contact area interaction with sliding widgets. In Proc. UIST '09, 2009.  ",
      "doi": "10.1145/1622176.1622181"
    },
    {
      "text": "A. Olwal, S. Feiner, and S. Heyman. Rubbing and tapping for precise and rapid selection on touch-screen displays. In Proc. CHI '08, 2008.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "S. Pook, E. Lecolinet, G. Vaysseix, and E. Barillot. Context and Interaction in Zoomable User Interfaces, 2000.  ",
      "doi": "10.1145/345513.345323"
    },
    {
      "text": "R. Potter, L. Weldon, and B. Shneiderman. Improving the accuracy of touch screens: an experimental evaluation of three strategies. Proc. CHI '88, 1988.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "G. Ramos, A. Cockburn, R. Balakrishnan, and M. Beaudouin-Lafon. Pointing lenses: Facilitating stylus input through visual-and motor-space magnification. In Proc. CHI '07, pages 757--766, 2007.  ",
      "doi": "10.1145/1240624.1240741"
    },
    {
      "text": "G. G. Robertson and J. D. Mackinlay. The Document Lens. In Proc. UIST '93, 1993.  ",
      "doi": "10.1145/168642.168652"
    },
    {
      "text": "I. Rosenberg and K. Perlin. The UnMousePad: an interpolating multi-touch force-sensing input pad. In Proc. SIGGRAPH '09, 2009.  ",
      "doi": "10.1145/1576246.1531371"
    },
    {
      "text": "A. Roudaut, S. Huot, and E. Lecolinet. TapTap and MagStick: Improving one-handed target acquisition on small touch-screens. In Proc. AVI '08, 2008.  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "D. Schmidt, M. K. Chong, and G. Hans. IdLenses: Dynamic personal areas on shared surfaces. In Proc. ITS '10, 2010.  ",
      "doi": "10.1145/1936652.1936678"
    },
    {
      "text": "D. Vogel and P. Baudisch. Shift: a technique for operating pen-based interfaces using touch. In Proc. CHI '07, pages 657--666, 2007.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "K. Yatani, K. Partridge, M. Bern, and M.W. Newman. Escape: a target selection technique using visually-cued gestures. Proc. CHI '08, 2008.  ",
      "doi": "10.1145/1357054.1357104"
    }
  ]
}