{
  "doi": "10.1145/1978942.1979067",
  "title": "On the costs of multiple trajectory pointing methods",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "859-862",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Several enhanced pointing techniques aim to reduce the Fitts' law targeting distance by providing multiple target trajectories in the hope that a shorter path is available. However, these techniques introduce a search or decision component to pointing users must examine the alternatives available and decide upon the trajectory to use. We analyse these difficulties, present a methodology for examining them as well as other behaviour issues, and report empirical results of performance with pointer wrapping and Ninja cursors. Results show that offering multiple trajectories incurs a significant search or decision cost, and that users are therefore poor at capitalising on the theoretical benefits of reduced target distance.",
  "authors": [
    {
      "name": "Philip Quinn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351595064",
      "orcid": "missing"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Kari-Jouko Räihä",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100052864/rel-imgonly/aa.jpg",
      "acmid": "81100052864",
      "orcid": "missing"
    },
    {
      "name": "Jérôme Delamarche",
      "institution": "Polytech Paris-Sud, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658002",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blanch, R. and Ortega, M. Rake cursor: improving pointing performance with concurrent input channels. in Proc. CHI'09, ACM, (2009), 1415--1418.  ",
      "doi": "10.1145/1518701.1518914"
    },
    {
      "text": "Card, S. K., Moran, T. P. and Newell, A. The Psychology of HCI. Lawrence Erlbaum Associates, 1983.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and Gutwin, C. A predictive model of human performance with scrolling and hierarchical lists. HCI J. 24, 3 (2009), 273--314.",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The bubble cursor. in Proc. CHI'05, ACM, (2005), 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R. and Beaudouin-Lafon, M. Object pointing: a complement to bitmap pointing in GUIs. in Proc. Graphics Interface'04, (2004), 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Hinckley, K., Guimbretiere, F., Baudisch, P., Sarin, R., Agrawala, M. and Cutrell, E. The Springboard: multiple modes in one spring-loaded control. in Proc. CHI'06, ACM, (2006), 181--190.  ",
      "doi": "10.1145/1124772.1124801"
    },
    {
      "text": "Kobayashi, M. and Igarashi, T. Ninja cursors: using multiple cursors to assist target acquisition on large screens. in Proc. CHI'08, ACM, (2008), 949--958.  ",
      "doi": "10.1145/1357054.1357201"
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. HCI J. 7 (1992), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "R&amp;#228;ih&amp;#228;, K. and &amp;#352;pakov, O. Disambiguating Ninja cursors with eye gaze. in Proc. CHI'09, (2009), 1411--1414.  ",
      "doi": "10.1145/1518701.1518913"
    }
  ]
}