{
  "doi": "10.1145/1978942.1979042",
  "title": "Out there",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "685-694",
  "year": 2011,
  "badges": [],
  "abstract": "\"Out there\" is increasingly becoming a topic of concern in HCI. Thanks to various clarion calls, researchers in the field are turning their attention to technology-mediated activities that are shaped less by Euro-American sensibilities and defined more by how they are culturally and geographically distinct. Fieldwork and ethnography researchers, for instance, are beginning to investigate ICT use at religious and spiritual sites, by the socially excluded and disenfranchised, and by people in developing regions. In this paper, I concentrate on the latter focus on development to reflect on HCI's disciplinary turn \"out there\". Specifically, I take the following three themes as common rhetorical devices in such work: (i) the network, (ii) difference and (iii) complexity. Through examples, I discuss how each of these themes has been mobilised. I then use materials from anthropology, science and technology studies, and to a lesser extent geography and postcolonial studies to complicate and in some cases question the interpretative frames that are being applied. Thus, my hope is that this paper is seen as a thought piece that deepens our thinking around HCI's efforts to look \"out there\" by paying critical attention to what is going on \"in here\".",
  "tags": [
    "ICT4D",
    "ethnography",
    "anthropology",
    "fieldwork",
    "postcolonialism.",
    "networks",
    "development"
  ],
  "authors": [
    {
      "name": "Alex S. Taylor",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100517358/rel-imgonly/alex_taylor_profile.jpg",
      "acmid": "81100517358",
      "orcid": "0000-0001-6311-3967"
    }
  ],
  "references": [
    {
      "text": "Anderson, W. From subjugated knowledge to conjugated subjects: science and globalisation, or postcolonial studies of science? Postcolonial Studies, 12, 4 (2009), 389--400.",
      "doi": ""
    },
    {
      "text": "Anderson, W. and Adams, V. Pramoedya's Chickens: Postcolonial Studies of Technoscience. In E. Hackett, O. Amsterdamska, M. Lynch and J. Wajcman (Eds.), The Handbook of Science and Technology Studies. MIT Press, London, 2007, 181--204.",
      "doi": ""
    },
    {
      "text": "Barad, K. Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning. Duke University, London, 2007.",
      "doi": ""
    },
    {
      "text": "Bardzell, S. Feminist HCI: taking stock and outlining an agenda for design. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Bell, G. No More SMS from Jesus: Ubicomp, Religion and Techno-spiritual Practices. In Proc. Ubicomp '06 (Berlin, 2006). Springer-Verlag, Heidelberg, Germany, 141--158.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Bell, G. Messy Futures: culture, technology and research. Keynote address, CHI '10 (Atlanta, GA, 2010). ACM, New York, NY.  ",
      "doi": "10.1145/1753326.2167157"
    },
    {
      "text": "Bell, G. and Dourish, P. Yesterday's tomorrows: notes on ubiquitous computing's dominant vision. Personal Ubiquitous Computing, 11, 2 (2007), 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Bidwell, N. J., Reitmaier, T., Marsden, G. and Hansen, S. Designing with mobile digital storytelling in rural Africa. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 1593--1602.  ",
      "doi": "10.1145/1753326.1753564"
    },
    {
      "text": "Bødker, S. When second wave HCI meets third wave challenges. In Proc. NordiCHI '06 (Oslo, Norway, 2006). ACM, New York, NY, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Brewer, E., Demmer, M., Ho, M., Honicky, R. J., Pal, J., Plauche, M. and Surana, S. The Challenges of Technology Research for Developing Regions. IEEE Pervasive Computing, 5, 2 (2006), 15--23.  ",
      "doi": "10.1109/MPRV.2006.40"
    },
    {
      "text": "Button, G. and Sharrock, W. The production of order and the order of production: possibilities for distributed organisations, work and technology in the print industry. In Proc. ECSCW '97 (Lancaster, UK, 1997). Kluwer Academic, Dordrecht, NL, 1--16. ",
      "doi": "10.5555/1241980.1241981"
    },
    {
      "text": "Churchill, E., Dray, S., Elliott, A., Larvie, P. and Siegel, D. Addressing challenges in doing international field research. In Proc. CHI EA '10 (Atlanta, GA, 2010). ACM, New York, NY, 3127--3130.  ",
      "doi": "10.1145/1753846.1753932"
    },
    {
      "text": "Dantec, C. A. L. and Edwards, W. K. Designs on dignity: perceptions of technology among the homeless. In Proc. CHI '08 (Florence, Italy, 2008). ACM, New York, NY, 627--636.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Dantec, C. A. L. and Edwards, W. K. The view from the trenches: organization, power, and technology at two nonprofit homeless outreach centers. In Proc. CSCW '08 (San Diego, CA, 2008). ACM, New York, NY, 589--598.  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "de Laet, M. and Mol, A. The Zimbabwe Bush Pump: Mechanics of a Fluid Technology. Social Studies of Science, 30, 2 (2000), 225--263.",
      "doi": ""
    },
    {
      "text": "Douglas, M. Purity and Danger. Routledge, London, 2002.",
      "doi": ""
    },
    {
      "text": "Dourish, P. Implications for design. In Proc. CHI '06 (Montréal, Canada, 2006). ACM, New York, NY, 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Dray, S. M., Siegel, D. A. and Kotzé, P. Indra's Net: HCI in the developing world. Interactions, 10, 2 (2003), 28--37.  ",
      "doi": "10.1145/637848.637860"
    },
    {
      "text": "Gitau, S., Marsden, G. and Donner, J. After access: challenges facing mobile-only internet users in the developing world. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 2603--2606.  ",
      "doi": "10.1145/1753326.1753720"
    },
    {
      "text": "Harper, R., Procter, R., Randall, D. and Rouncefield, M. 'Safety in numbers': calculation and document re-use in knowledge work. In Proc. GROUP '01 (Boulder, CO, 2001). ACM, New York, NY, 242--251.  ",
      "doi": "10.1145/500286.500322"
    },
    {
      "text": "Harrison, P. The Caesura: remarks on Wittgenstein's interruption of theory, or, why practices elude explanation. Geoforum, 33, 4 (2002), 487--503.",
      "doi": ""
    },
    {
      "text": "Harrison, P. \" How shall I say it...?\" Relating the nonrelational. Environment and Planning A, 39, 3 (2007), 590--608.",
      "doi": ""
    },
    {
      "text": "Harrison, S., Tatar, D. and Sengers, P. The three paradigms of HCI. In Proc. alt.chi, CHI '07 (San Jose, CA, 2007). ACM, New York, NY.",
      "doi": ""
    },
    {
      "text": "Heath, C. and Luff, P. Documents and professional practice: \"bad\" organisational reasons for \"good\" clinical records. In Proc. CSCW '96 (Boston, MA, 1996). ACM, New York, NY, 354--363.  ",
      "doi": "10.1145/240080.240342"
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K. and Grinter, R. E. Postcolonial computing: a lens on design and development. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Kam, M., Dray, S., Toyama, K., Marsden, G., Parikh, T. and Cutrell, E. Computing technology in international development: who, what, where, when, why and how? In Proc. CHI EA '10 (Atlanta, GA, 2010). ACM, New York, NY, 3135--3138.  ",
      "doi": "10.1145/1753846.1753935"
    },
    {
      "text": "Latour, B. Visualization and cognition: Drawing things together. In M. Lynch and S. Woolgar (Eds.), Representation in scientific activity. MIT Press, Cambridge, MA, 1990, 19--68.",
      "doi": ""
    },
    {
      "text": "Latour, B. Pandora's Hope: Essays on the Realities of Science Studies. Harvard University Press, Cambridge, MA, 1999.",
      "doi": ""
    },
    {
      "text": "Law, J. After Method: Mess in Social Science Research. Routledge, London, 2004.",
      "doi": ""
    },
    {
      "text": "Law, J. and Hassard, J. Actor Network Theory and After. Blackwell Publishing, London, 1999.",
      "doi": ""
    },
    {
      "text": "Lynch, M. Against reflexivity as an academic virtue and source of privileged knowledge. Theory, Culture & Society, 17, 3 (2000), 26.",
      "doi": ""
    },
    {
      "text": "Marsden, G. UNDER DEVELOPMENT: The six habits of highly effective \"humanitarian\" projects. Interactions, 16, 5 (2009), 36--39.  ",
      "doi": "10.1145/1572626.1572633"
    },
    {
      "text": "Miner, H. (1956). Body Ritual among the Nacirema. American Anthropologist, 58(3), 503--507.",
      "doi": ""
    },
    {
      "text": "Oyugi, C., Nocera, J. A., Dunckley, L. and Dray, S. The challenges for participatory design in the developing world. In Proc. PDC '08 (Bloomington, IN, 2008). Indiana University, 295--296. ",
      "doi": "10.5555/1795234.1795308"
    },
    {
      "text": "Parmar, V., Groeneveld, G., Jalote-Parmar, A. and Keyson, D. Tangible user interface for increasing social interaction among rural women. In Proc. TEI '09 (Cambridge, UK, 2009). ACM, New York, NY, 139--145.  ",
      "doi": "10.1145/1517664.1517699"
    },
    {
      "text": "Riles, A. The Network Inside Out. The University of Michigan Press, Ann Arbor, MI, 2001.",
      "doi": ""
    },
    {
      "text": "Riles, A. The anti-network: Private global governance, legal knowledge, and the legitimacy of the state. American Journal of Comparative Law, 56(2008), 605--630.",
      "doi": ""
    },
    {
      "text": "Sambasivan, N., Cutrell, E., Toyama, K. and Nardi, B. Intermediated technology use in developing communities. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Sambasivan, N., Rangaswamy, N., Cutrell, E. and Nardi, B. Ubicomp4D: infrastructure and interaction for international development--the case of urban indian slums. In Proc. Ubicomp '09 (Orlando, FL, 2009). ACM, New York, NY, 155--164.  ",
      "doi": "10.1145/1620545.1620570"
    },
    {
      "text": "Sawhney, N. Voices beyond walls: the role of digital storytelling for empowering marginalized youth in refugee camps. In Proc. Conference on Interaction Design and Children (Como, Italy, 2009). ACM, New York, NY, 302--305.  ",
      "doi": "10.1145/1551788.1551866"
    },
    {
      "text": "Smyth, T. N., Kumar, S., Medhi, I. and Toyama, K. Where there's a will there's a way: mobile media sharing in urban india. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 753--762.  ",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Strathern, M. Cutting the network. Journal of the Royal Anthropological Institute, 2, 3 (1996), 517--535.",
      "doi": ""
    },
    {
      "text": "Strathern, M. Partial Connections. Rowman & Littlefield Publishers, Oxford, 2004.",
      "doi": ""
    },
    {
      "text": "Suchman, L. Practice-based design of information systems: Notes from the hyperdeveloped world. The Information Society, 18, 2 (2002), 139--144.",
      "doi": ""
    },
    {
      "text": "Suchman, L. A. Human-Machine Reconfigurations: Plans and Situated Actions. Cambridge University Press, Cambridge, 2007. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Taylor, A. S. and Swan, L. Artful systems in the home. In Proc. CHI '05 (Portland, OR, 2005). ACM, New York, NY, 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Taylor, N. and Cheverst, K. Social interaction around a rural community photo display. Int. J. Hum.-Comput. Stud., 67, 12 (2009), 1037--1047.  ",
      "doi": "10.1016/j.ijhcs.2009.07.006"
    },
    {
      "text": "Thrift, N. The place of complexity. Theory, Culture & Society, 16, 3 (1999), 31--69.",
      "doi": ""
    },
    {
      "text": "Tsing, A. The global Situation. Cultural Anthropology, 15, 3 (2000), 327--360.",
      "doi": ""
    },
    {
      "text": "Verran, H. Science and African Logic. University of Chicago Press, London, 2001.",
      "doi": ""
    },
    {
      "text": "Williams, A., Anderson, K. and Dourish, P. Anchored mobilities: mobile technology and transnational migration. In Proc. DIS '08 (Cape Town, South Africa, 2008). ACM, New York, NY, 323--332.  ",
      "doi": "10.1145/1394445.1394480"
    },
    {
      "text": "Winch, P. Understanding a Primitive Society. American Philosophical Quarterly, 1, 4 (1964), 307--324.",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Augustin, S. and Foucault, B. Sabbath day home automation: \"it's like mixing technology and religion\". In Proc. CHI '07 (San Jose, CA, 2007). ACM, New York, NY, 527--536.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Wyche, S. P., Hayes, G. R., Harvel, L. D. and Grinter, R. E. Technology in spiritual formation: an exploratory study of computer mediated religious communications. In Proc. CSCW '06 (Banff, Canada, 2006). ACM, New York, NY, 199--208.  ",
      "doi": "10.1145/1180875.1180908"
    },
    {
      "text": "Wyche, S. P., Magnus, C. M. and Grinter, R. E. Broadening Ubicomp's vision: an exploratory study of charismatic pentecostals and technology use in Brazil. In Proc. Ubicomp '09 (Orlando, FL, 2009). ACM, New York, NY, 145--154.  ",
      "doi": "10.1145/1620545.1620569"
    },
    {
      "text": "Wyche, S. P., Smyth, T. N., Chetty, M., Aoki, P. M. and Grinter, R. E. Deliberate interactions: characterizing technology use in Nairobi, Kenya. In Proc. CHI '10 (Atlanta, GA, 2010). ACM, New York, NY, 2593--2602..  ",
      "doi": "10.1145/1753326.1753719"
    }
  ]
}