{
  "doi": "10.1145/1978942.1979283",
  "title": "Experiencing security in interaction design",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2325-2334",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Security is experienced differently in different contexts. This paper argues that in everyday situations, users base their security decisions on a mix of prior experiences. When approaching security and interaction design from an experience approach, tools that help bring out such relevant experiences for design are needed. This paper reports on how Prompted exploration workshops and Acting out security were developed to target such experiences when iteratively designing a mobile digital signature solution in a participatory design process. We discuss how these tools helped the design process and illustrate how the tangibility of such tools matters. We further demonstrate how the approach grants access to non-trivial insights into people's security experience. We point out how the specific context is essential for exploring the space between experience and expectations, and we illustrate how people activate their collections of security experiences rather than deploying one security strategy in all situations.",
  "tags": [
    "tools",
    "prompted exploration workshops",
    "security",
    "participatory design",
    "acting out security"
  ],
  "authors": [
    {
      "name": "Niels Raabjerg Mathiasen",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385603115",
      "orcid": "missing"
    },
    {
      "name": "Susanne Bødker",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100076676",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A. and Sasse, M. A. Users are not the enemy. CACM 42, 12 (1999) 40--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Braz, C., Seffah, A., &amp;#38; M'Raihi, D.. Designing a Trade-Off Between Usability and Security: A Metrics Based-Model. In Proc. INTERACT 2007, LNCS 4663 (2007), Part II, 114 -- 126. ",
      "doi": "10.5555/1778331.1778344"
    },
    {
      "text": "B&amp;#248;dker, S. When second wave HCI meets third wave challenges. Proc. NordiCHI 2006, ACM (2006), 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "B&amp;#248;dker, S. and Christiansen, E. Scenarios as springboards in design. In Bowker, G., Gasser, L., Star, S.L. &amp;#38; Turner, W. (eds.), Social science research, technical systems and cooperative work. Erlbaum (1997), 217--234.",
      "doi": ""
    },
    {
      "text": "B&amp;#248;dker, S. &amp;#38; Christiansen, E. Designing for ephemerality and prototypicality. Proc. DIS 2004 (2004) 255 - 260.  ",
      "doi": "10.1145/1013115.1013151"
    },
    {
      "text": "B&amp;#248;dker, S. and Klokmose, C.N. (in press). The Human-Artifact Model. Journal of HCI (2011.",
      "doi": ""
    },
    {
      "text": "Dindler, C. and Iversen, O. S. Fictional Inquiry - Design Collaboration in a Shared Narrative Space, Journal of CoDesign 3(4) (2007), 213--234.",
      "doi": ""
    },
    {
      "text": "Ehn, P. and Sj&amp;#246;gren, D. From System Descriptions to Scripts for Action. In {10} (1991) 241--268. ",
      "doi": "10.5555/125470.115550"
    },
    {
      "text": "Engestr&amp;#246;m, Y. and Middleton, D. (Eds.). Cognition and Communication at Work, Cambridge University Press (1996), 130--15.",
      "doi": ""
    },
    {
      "text": "Greenbaum, J. and Kyng M. (eds.). Design at Work: Cooperative Design of Computer Systems, Hillsdale NJ: Lawrence Erlbaum Associates (1991). ",
      "doi": "10.5555/574738"
    },
    {
      "text": "Halskov, K. and Dalsgaard, P. The emergence of ideas: the interplay between sources of inspiration and emerging design concepts. CoDesign: International Journal of CoCreation in Design and the Arts 3(4) (2007), 185 -- 211.",
      "doi": ""
    },
    {
      "text": "Lampson, B. Privacy and security. Usable security: how to get it. CACM 52(11) (2009). 25--27.  ",
      "doi": "10.1145/1592761.1592773"
    },
    {
      "text": "Landau, S. Privacy and security. A multidimensional problem. CACM 51(11) (2008). 25--26.  ",
      "doi": "10.1145/1400214.1400223"
    },
    {
      "text": "Kyng, M. Users and Computers - A Contextual Approach to Design of Computer Artifacts. DAIMI PB-507 (1995).",
      "doi": ""
    },
    {
      "text": "Mathiasen, N. and B&amp;#248;dker, S. Threats or threads: from usable security to secure experience, Proc. NordiCHI 2008, Society for Industrial and Applied Mathematics, (2008). 283--290.  ",
      "doi": "10.1145/1463160.1463191"
    },
    {
      "text": "McCarthy, J. and Wright, P. Technology As Experience. MIT Press (2004). ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "McCarthy, J., and Wright, P. Experience-Centered Design. Designers, Users, and Communities in Dialogue. Morgan &amp;#38; Claypool (2010). ",
      "doi": "10.5555/1855065"
    },
    {
      "text": "Mogensen, P., and Trigg, R. Artifacts as triggers for participatory analysis. In Proc. PDC 1992 (1992), 55--62.",
      "doi": ""
    },
    {
      "text": "Norman, D.. The Way I See It. When security gets in the way. interactions 16(6) (2009), 60--63.  ",
      "doi": "10.1145/1620693.1620708"
    },
    {
      "text": "Ricoeur, P. Time and Narrative, Volume 3. Chicago, University of Chicago Press (1988).",
      "doi": ""
    },
    {
      "text": "Sch&amp;#246;n, D. The reflective practitioner. Temple Smith (1983).",
      "doi": ""
    },
    {
      "text": "Whitten, A and Tygar, D. Why Johnny Can't Encrypt -- A Usability Evaluation of PGP 5.0. In Cranor, L. &amp;#38; Simson, G. (eds). Security and Usability: Designing Secure Systems that People Can Use, O'Reilly (2005), 679--700..",
      "doi": ""
    }
  ]
}