{
  "doi": "10.1145/1978942.1979086",
  "title": "Content and hierarchy in pixel-based methods for reverse engineering interface structure",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "969-978",
  "year": 2011,
  "badges": [],
  "abstract": "The rigidity and fragmentation of GUI toolkits are fundamentally limiting the progress and impact of interaction research. Pixel-based methods offer unique potential for addressing these challenges independent of the implementation of any particular interface or toolkit. This work builds upon Prefab, which enables the modification of existing interfaces. We present new methods for hierarchical models of complex widgets, real-time interpretation of interface content, and real-time interpretation of content and hierarchy throughout an entire interface. We validate our new methods through implementations of four applications: stencil-based tutorials, ephemeral adaptation, interface translation, and end-user interface customization. We demonstrate these enhancements in complex existing applications created from different user interface toolkits running on different operating systems.",
  "authors": [
    {
      "name": "Morgan Dixon",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350581254",
      "orcid": "missing"
    },
    {
      "name": "Daniel Leventhal",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613321",
      "orcid": "missing"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142271",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P., Tan, D.S., Collomb, M., Robbins, D., Hinckley, K., Agrawala, M., Zhao, S. and Ramos, G. Phosphor: Explaining Transitions in the User Interface using Afterglow Effects. UIST 2006. 169--178.  ",
      "doi": "10.1145/1166253.1166280"
    },
    {
      "text": "Bolin, M., Webber, M., Rha, P., Wilson, T. and Miller, R.C. Automation and Customization of Rendered Web Pages. UIST 2005. 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Chang, T.-H., Yeh, T. and Miller, R. C. GUI Testing User Computer Vision. CHI 2010. 1535--1544.  ",
      "doi": "10.1145/1753326.1753555"
    },
    {
      "text": "Dixon, M. and Fogarty, J. Prefab: Implementing Advanced Behaviors Using Pixel-Based Reverse Engineering of Interface Structure. CHI 2010. 1525--1534.  ",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Findlater, L., Moffatt, K., McGrenere, J. and Dawson, J. Ephemeral Adaptation: The Use of Gradual Onset to Improve Menu Selection Performance. CHI 2009. 1655--1664.  ",
      "doi": "10.1145/1518701.1518956"
    },
    {
      "text": "Fujima, J., Lunzer, A., Hornbæk, K. and Tanaka, Y. Clip, Connect, Clone: Combining Applications Elements to Build Custom Interfaces for Information Access. UIST 2004. 175--184.  ",
      "doi": "10.1145/1029632.1029664"
    },
    {
      "text": "Gaeremynck, Y., Bergman, L. D. and Lau, T. A. MORE for Less: Model Recovery from Visual Interfaces for Multi-Device Application Design. IUI 2003. 69--76.  ",
      "doi": "10.1145/604045.604060"
    },
    {
      "text": "Greenberg, S. and Buxton, B. Usability Evaluation Considered Harmful (Some of the Time). CHI 2008. 111--120.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. CHI 2005. 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Hartmann, B., Wu, L., Collins, K. and Klemmer, S. R. Programming by a Sample: Rapidly Creating Web Applications with d.Mix. UIST 2007. 241--250.  ",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Hudson, S. E. Incremental Attribute Evaluation: A Flexible Algorithm for Lazy Update. TOPLAS, 13(3). 315--341.  ",
      "doi": "10.1145/117009.117012"
    },
    {
      "text": "Hudson, S. E., Mankoff, J. and Smith, I. Extensible Input Handling in the subArctic Toolkit. CHI 2005. 381--390.  ",
      "doi": "10.1145/1054972.1055025"
    },
    {
      "text": "Hudson, S. E. and Smith, I. Supporting Dynamic Downloadable Appearances in an Extensible User Interface Toolkit. UIST 1997. 159--168.  ",
      "doi": "10.1145/263407.263539"
    },
    {
      "text": "Hudson, S. E. and Tanaka, K. Providing Visually Rich Resizable Images for User Interface Components. UIST 2000. 227--235.  ",
      "doi": "10.1145/354401.354783"
    },
    {
      "text": "Hurst, A., Hudson, S. E. and Mankoff, J. Automatically Identifying Targets Users Interact with During Real World Tasks. IUI 2010. 11--20.  ",
      "doi": "10.1145/1719970.1719973"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Stencils-Based Tutorials: Design and Evaluation. CHI 2005. 541--550.  ",
      "doi": "10.1145/1054972.1055047"
    },
    {
      "text": "Lin, J., Wong, J., Nichols, J., Cypher, A. and Lau, T.A. End-User Programming of Mashups with Vegemite. IUI 2009. 97--106.  ",
      "doi": "10.1145/1502650.1502667"
    },
    {
      "text": "Little, G., Lau, T. A., Cypher, A., Lin, J., Haber, E. M. and Kandogan, E. Koala: Capture, Share, Automate, Personalize Business Processes on the Web. CHI 2007. 943--946.  ",
      "doi": "10.1145/1240624.1240767"
    },
    {
      "text": "Myers, B. A., Hudson, S. E. and Pausch, R. Past, Present, and Future of User Interface Software Tools. TOCHI, 7(1). 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Nichols, J. and Lau, T. A. Mobilizing by Demonstration: Using Traces to Re-Author Existing Web Sites. IUI 2008. 149--158.  ",
      "doi": "10.1145/1378773.1378793"
    },
    {
      "text": "Olsen, D. R. Evaluating User Interface Systems Research. UIST 2007. 251--258.  ",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Olsen, D. R., Taufer, T. and Fails, J. A. ScreenCrayons: Annotating Anything. UIST 2004. 165--174.  ",
      "doi": "10.1145/1029632.1029663"
    },
    {
      "text": "Potter, R. (1993). Triggers: Guiding Automaton with Pixel to Achieve Data Access. A. Cypher, eds. MIT Press.",
      "doi": ""
    },
    {
      "text": "Rissanen, J. Modeling by Shortest Data Description. Automatica, 14(5). 465--471.  ",
      "doi": "10.1016/0005-1098%2878%2990005-5"
    },
    {
      "text": "St. Amant, R., Lieberman, H., Potter, R. and Zettlemoyer, L. S. Visual Generalization in Programming by Example. 43(3). 107--114.  ",
      "doi": "10.1145/330534.330549"
    },
    {
      "text": "St. Amant, R., Riedl, M. O., Ritter, F. E. and Reifers, A. Image Processing in Cognitive Models with SegMan. HCII 2005.",
      "doi": ""
    },
    {
      "text": "Stuerzlinger, W., Chapuis, O., Phillips, D. and Roussel, N. User Interface Façades: Towards Fully Adaptable User Interfaces. UIST 2006. 309--318.  ",
      "doi": "10.1145/1166253.1166301"
    },
    {
      "text": "Takagi, H., Kawanaka, S., Kobayashi, M., Itoh, T. and Asakawa, C. Social Accessibility: Achieving Accessibility through Collaborative Metadata Authoring. ASSETS 2008. 193--200.  ",
      "doi": "10.1145/1414471.1414507"
    },
    {
      "text": "Tan, D. S., Meyers, B. R. and Czerwinski, M. WinCuts: Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. CHI 2004. 1525--1528.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Wachenfeld, S., Klein, H.-U. and Jiang, X. Recognition of Screen-Rendered Text. ICPR 2006. 1086--1089.  ",
      "doi": "10.1109/ICPR.2006.974"
    },
    {
      "text": "Yeh, T., Chang, T.-H. and Miller, R. C. Sikuli: Using GUI Screenshots for Search and Automation. UIST 2009. 183--192.  ",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "Zettlemoyer, L. S. and St. Amant, R. A Visual Medium for Programmatic Control of Interactive Applications. CHI 1999. 199--206.  ",
      "doi": "10.1145/302979.303039"
    },
    {
      "text": "Zettlemoyer, L. S., St. Amant, R. and Dulberg, M. S. IBOTS: Agent Control Through the User Interface. IUI 1998. 31--37.  ",
      "doi": "10.1145/291080.291087"
    }
  ]
}