{
  "doi": "10.1145/1978942.1979459",
  "title": "F for fake: four studies on how we fall for phish",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3469-3478",
  "year": 2011,
  "badges": [],
  "abstract": "This paper reports findings from a multi-method set of four studies that investigate why we continue to fall for phish. Current security advice suggests poor spelling and grammar in emails can be signs of phish. But a content analysis of a phishing archive indicates that many such emails contain no obvious spelling or grammar mistakes and often use convincing logos and letterheads. An online survey of 224 people finds that although phish are detected approximately 80% of the time, those with logos are significantly harder to detect. A qualitative interview study was undertaken to better understand the strategies used to identify phish. Blind users were selected because it was thought they may be more vulnerable to phishing attacks, however they demonstrated robust strategies for identifying phish based on careful reading of emails. Finally an analysis was undertaken of phish as a literary form. This identifies the main literary device employed as pastiche and draws on critical theory to consider why security based pastiche may be currently very persuasive.",
  "tags": [
    "human factors",
    "visually impaired users",
    "critical theory",
    "phish detection",
    "persuasion"
  ],
  "authors": [
    {
      "name": "Mark Blythe",
      "institution": "University of Northumbria, Newcastle, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100208849",
      "orcid": "missing"
    },
    {
      "name": "Helen Petrie",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022960",
      "orcid": "missing"
    },
    {
      "name": "John A. Clark",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100622318",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anti-Phishing Working Group (APWG). http://antiphishing.org/.",
      "doi": ""
    },
    {
      "text": "Bank Safe Online: Protecting Yourself. http://www.banksafeonline.org.uk/protecting_yourself.html.",
      "doi": ""
    },
    {
      "text": "Bardzell, J. (2009). Interaction criticism and aesthetics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). New York: ACM Press.  ",
      "doi": "10.1145/1518701.1519063"
    },
    {
      "text": "Bell, G., Blythe, M., Gaver, B., Sengers, P. &amp;#38; Wright, P. (2003). Designing culturally situated technologies for the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03) Extended Abstracts. New York: ACM Press.  ",
      "doi": "10.1145/765891.766149"
    },
    {
      "text": "Blythe, M., Reid, J., Wright, P. &amp;#38; Geelhoed, E. (2006). Interdisciplinary Criticism: Analysing The Experience Of Riot! A Location Sensitive Digital Narrative. Behaviour and Information Technology, 25(2), 127--139.",
      "doi": ""
    },
    {
      "text": "Blythe, M., McCarthy, J., Light, A., Bardzell, S., Wright, P., Bardzell, J. &amp;#38; Blackwell, A. (2010). Critical dialogue: interaction, experience and cultural theory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2010). New York: ACM Press.  ",
      "doi": "10.1145/1753846.1754189"
    },
    {
      "text": "Braun, N. (2004). Storytelling and Conversation to Improve the Fun Factor in Software Applications. In M. Blythe, K. Overbeeke, A. F. Monk, &amp;#38; P. C. Wright (Eds.), Funology: From Usability to Enjoyment. Dordecht, NL: Kluwer. ",
      "doi": "10.5555/1139008.1139034"
    },
    {
      "text": "Cohen, J., Cohen, P., West, S. G. and Aiken, L. S. (2003). Applied multiple regression/correlation analysis for the behavioural sciences. Hillsdale, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Dhamija, R., Tygar, D. &amp;#38; Hearst, M. (2006). Why phishing works. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). New York: ACM Press.  ",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Dong, X., Clark, J. A. &amp;#38; Jacob, J. (2008). Modelling user-phishing interaction. Proceedings of Human-System Interaction, May 25--27, 2008, Krak&amp;#243;w, Poland.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Grinter, E., Delgado de la Flor, J. &amp;#38; Joseph, M. (2004). Security in the wild: user strategies for managing security as an everyday, practical problem. Personal and Ubiquitous Computing, 8(6), 391--401.  ",
      "doi": ""
    },
    {
      "text": "Downs, J. S., Holbrook, M. B. &amp;#38; Cranor, L. F. (2006). Decision strategies and susceptibility to phishing. In Proceedings of the Second Symposium on Usable Privacy and Security (Pittsburgh, Pennsylvania, July 12 - 14, 2006) (SOUPS '06). New York: ACM Press.  ",
      "doi": "10.1145/1143120.1143131"
    },
    {
      "text": "Eagleton T. (2003). After theory. London: Penguin Books.",
      "doi": ""
    },
    {
      "text": "Easthope, A. &amp;#38; McGowan, K. (1992). A Critical and Cultural Theory Reader. Milton Keynes: Open University Press.",
      "doi": ""
    },
    {
      "text": "Giani, A. &amp;#38; Thompson, P. (2007). Detecting deception in the context of Web 2.0. In Proceedings of Web 2.0 Security and Privacy 2007. http://w2spconf.com/2007/.",
      "doi": ""
    },
    {
      "text": "HSBC Phishing Scams. http://www.hsbc.com/1/2/online-security/phishing.",
      "doi": ""
    },
    {
      "text": "Jakobsson, M. (2007). The human factor in phishing. In Proceedings of Privacy &amp;#38; Security of Consumer Information '07. http://markus-jakobsson.com/papers/jakobsson-psci07.pdf.",
      "doi": ""
    },
    {
      "text": "Jolliffe, I. T. (1986). Principal Component Analysis. Berlin: Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Keppel, G. &amp;#38; Wickens, T. D. (2004). Design and analysis: a researcher's handbook. Upper Saddle River, NJ: Pearson Prentice-Hall.",
      "doi": ""
    },
    {
      "text": "Kumaraguru, P., Rhee, Y., Acquisti, A., Cranor, L. F., Hong, J. &amp;#38; Nunge, E. (2007). Protecting people from phishing: the design and evaluation of an embedded training email system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). New York: ACM Press.  ",
      "doi": "10.1145/1240624.1240760"
    },
    {
      "text": "Mayring P. (2004). Qualitative Content Analysis in Flickr. In Kardorff, U. &amp;#38; Steinke, E. (Eds.), A Companion to Qualitative Research. London: Sage.",
      "doi": ""
    },
    {
      "text": "MillerSmiles.co.uk 419 scams. http://419.millersmiles.co.uk/.",
      "doi": ""
    },
    {
      "text": "Propp, V. (1968). Morphology of the Folk Tale. Texas: University of Texas Press.",
      "doi": ""
    },
    {
      "text": "Satchell C. (2008) Cultural Theory and Real World Design: Dystopian and Utopian Outcomes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). New York: ACM Press.  ",
      "doi": "10.1145/1357054.1357303"
    },
    {
      "text": "Sheng, S., Holbrook, M., Kumaraguru, P., Cranor, L. F., and Downs, J. 2010. Who falls for phish?: a demographic analysis of phishing susceptibility and effectiveness of interventions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. New York: ACM Press.  ",
      "doi": "10.1145/1753326.1753383"
    },
    {
      "text": "Singh, S., Cabraal, A., Demosthenous, C., Astbrink, G., and Furlong, M. 2007. Password sharing: implications for security design based on social practice. In Proceedings of the Conference on Human Factors in Computing Systems (CHI '07). New York: ACM Press.  ",
      "doi": "10.1145/1240624.1240759"
    },
    {
      "text": "The One Show: Phishing in Your Bank Account? http://www.bbc.co.uk/blogs/theoneshow/consumer/2008/10/30/phishing.html.",
      "doi": ""
    },
    {
      "text": "Wickens, T. D. (2002). Elementary signal detection. New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Wu, M., Miller, R. C. and Garfinkel, S. L. (2006). Do security toolbars actually prevent phishing attacks? In Proceedings of the Conference on Human Factors in Computing Systems. New York: ACM Press.  ",
      "doi": "10.1145/1124772.1124863"
    },
    {
      "text": "Zizek S. (1992). Looking Awry: an introduction to Jacques Lacan through popular culture. Cambridge, MA: October Books.",
      "doi": ""
    }
  ]
}