{
  "doi": "10.1145/1978942.1979038",
  "title": "Using tags to encourage reflection and annotation on data during nomadic inquiry",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "667-670",
  "year": 2011,
  "badges": [],
  "abstract": "Nomadic inquiry may benefit from tagging when used for educational purposes to support reflection and annotation during data collection. To that end we created Zydeco, a mobile system to scaffold learners through the science inquiry process in and out of the classroom, and tested it in a museum with 42 middle school students. Students report that tags encouraged reflection and annotation during data collection, suggesting that tagging can be used to support nomadic inquiry. From this work we present some emerging design recommendations for constructing similar systems.",
  "authors": [
    {
      "name": "Alex Kuhn",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435606732",
      "orcid": "missing"
    },
    {
      "name": "Clara Cahill",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442596041",
      "orcid": "missing"
    },
    {
      "name": "Chris Quintana",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100211248",
      "orcid": "missing"
    },
    {
      "name": "Shannon Schmoll",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81464676647",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Association for the Advancement of Science Benchmarks for Science Literacy. Oxford University Press, New York, 2009.",
      "doi": ""
    },
    {
      "text": "Ames, M. and Naaman, M. Why we tag: motivations for annotation in mobile and online media. In Proc. Human Factors in Computing Systems (2007), 971--980.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Cahill, C., Kuhn, A., Schmoll, S., Pompe, A. and Quintana, C. Zydeco: using mobile and web technologies to support seamless inquiry between museum and school contexts. In Proc. IDC (2010), 174--177.  ",
      "doi": "10.1145/1810543.1810564"
    },
    {
      "text": "Cosley, D., Baxter, J., Lee, S., Alson, B., Nomura, S., Adams, P., Sarabu, C. and Gay, G. A tag in the hand: supporting semantic, social, and spatial navigation in museums. In Proc. Human Factors in Computing Systems (2009), 1953--1962.  ",
      "doi": "10.1145/1518701.1518999"
    },
    {
      "text": "Furnas, G., Fake, C., von Ahn, L., Schachter, J., Golder, S., Fox, K., Davis, M., Marlow, C. and Naaman, M. Why do tagging systems work? In Proc. Human Factors in Computing Systems (2006), 36--39.  ",
      "doi": "10.1145/1125451.1125462"
    },
    {
      "text": "Hsi, S. A study of user experiences mediated by nomadic web content in a museum. Computer Assisted Learning 19, 3 (2003), 308--319.",
      "doi": ""
    },
    {
      "text": "Quintana, C., Reiser, B. J., Davis, E. A., Krajcik, J., Fretz, E., Duncan, R. G., Kyza, E., Edelson, D. and Soloway, E. A Scaffolding Design Framework for Software to Support Science Inquiry. Journal of the Learning Sciences 13, 3 (2004), 337--386.",
      "doi": ""
    },
    {
      "text": "Rogers, Y., Price, S., Randell, C., Fraser, D. S., Weal, M. and Fitzpatrick, G. Ubi-learning integrates indoor and outdoor experiences. Communications of the ACM 48, 1 (January 2005), 55--19.  ",
      "doi": "10.1145/1039539.1039570"
    },
    {
      "text": "Songer, N. B. BioKIDS: An animated conversation on the development of complex reasoning in science. In The Cambridge Handbook of the Learning Sciences, Cambridge University Press, 2006, 355--370.",
      "doi": ""
    },
    {
      "text": "Vavoula, G., Sharples, M., Rudman, P., Meek, J. and Lonsdale, P. Myartspace: Design and evaluation of support for learning with multimedia phones between classrooms and museums. Computers &amp;#38; Education 53, 2 (2009), 286--299.  ",
      "doi": "10.1016/j.compedu.2009.02.007"
    }
  ]
}