{
  "doi": "10.1145/1978942.1979027",
  "title": "Competing online viewpoints and models of chronic illness",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "589-598",
  "year": 2011,
  "badges": [],
  "abstract": "People with chronic health problems use online resources to understand and manage their condition, but many such resources can present competing and confusing viewpoints. We surveyed and interviewed with people experiencing prolonged symptoms after a Lyme disease diagnosis. We explore how competing viewpoints in online content affect participants' understanding of their disease. Our results illustrate how chronically ill people search for information and support, and work to help others over time. Participant identity and beliefs about their illness evolved, and this led many to take on new roles, creating content and advising others who were sick. What we learned about online content creation suggests a need for designs that support this journey and engage with complex issues surrounding online health resources.",
  "tags": [
    "interviews",
    "social media",
    "health",
    "community",
    "search"
  ],
  "authors": [
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Kateryna Kuksenok",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444607441",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    },
    {
      "name": "Jennifer A. Rode",
      "institution": "Drexel University, Philadelphia, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100618309",
      "orcid": "missing"
    },
    {
      "name": "Kelly Waldman",
      "institution": "Duke University, Durham, N. Carolina, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658071",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agency for Healthcare Research and Quality. (1998). U.S. National Medical Expenditure Panel Survey.",
      "doi": ""
    },
    {
      "text": "Baker, L., Wagner, T. H., Singer, S., & Bundorf, M. K. (2003). Use of the Internet and e-mail for health care information: Results from a national survey. JAMA, 289(18):2400--2406.",
      "doi": ""
    },
    {
      "text": "Balka, E., Bjorn, P., Wagner, I. (2008). Steps toward a typology for health informatics. CSCW '08, 515--524.  ",
      "doi": "10.1145/1460563.1460645"
    },
    {
      "text": "Barker, K. K. (2008). Electronic support groups, patient-consumers, and medicalization: The case of contested illness. Journal of Health and Social Behavior 49(March):20--36.",
      "doi": ""
    },
    {
      "text": "Benigeri, M., & Pluye, P. (2003). Shortcomings of health information on the Internet. Health Promotion International, 18(4):381--386.",
      "doi": ""
    },
    {
      "text": "Bessière, K., Pressman, S., Kiesler, S., & Kraut, R. (2010). Effects of Internet use on health and depression: A longitudinal study. Journal of Medical Internet Research, 12(1):e6.",
      "doi": ""
    },
    {
      "text": "Burke, M., Kraut, R., & Williams, D. (2010). Social use of computer-mediated communication by adults on the autism spectrum. CSCW'10, 425--434.  ",
      "doi": "10.1145/1718918.1718991"
    },
    {
      "text": "Cairns, V., & Godwin, J. (2005). Post-Lyme borreliosis syndrome: A meta-analysis of reported symptoms. International Journal of Epidemiology, 34(6):1340--1345.",
      "doi": ""
    },
    {
      "text": "Castells, M. (1997). The Power of Identity (Information age: V. 2). Blackwell Publishers: MA, USA. ",
      "doi": "10.5555/523266"
    },
    {
      "text": "Clark, N. M. (2003). Management of chronic disease by patients. Annual Review of Public Health, 24, 289--313.",
      "doi": ""
    },
    {
      "text": "Cline, R. J., & Haynes, K. M. (2001). Consumer health information seeking on the Internet: The state of the art. Health Education Research, 16(6):671--692.",
      "doi": ""
    },
    {
      "text": "Connecticut Attorney General's Office. (2008). Attorney General's investigation reveals flawed lyme disease guideline process, IDSA agrees to reassess guidelines, install independent arbiter. Press Release. www.ct.gov. Archived by WebCite® at http://webcitation.org/ 5jqlpUauz.",
      "doi": ""
    },
    {
      "text": "Coyle, P. (2001). Lyme disease. Current Neurology and Neuroscience Reports, 2:479--487.",
      "doi": ""
    },
    {
      "text": "Cummings, J., Sproull, L. S., & Kiesler, S. (2002). Beyond hearing: Where real-world and online support meet. Group Dynamics: Theory, Research and Practice, 6(1):78--88.",
      "doi": ""
    },
    {
      "text": "Davidson, K. P., Pennebaker, J. W. (1997). Chapter 16: Virtual Narratives: Illness representations in online support groups. In K. J. Petrie & J. A. Williams, Perceptions of Health and Illness (pp. 463--486). Hartwood Academic Publishers.",
      "doi": ""
    },
    {
      "text": "Eysenbach, G. (2003). The impact of the internet on cancer outcomes. CA: American Cancer Journal for Clinicians, 54:356--371.",
      "doi": ""
    },
    {
      "text": "Eysenbach, G., Powell, J., Kuss, O., & Sa, E. R. (2002). Empirical studies assessing the quality of health information for consumers on the world wide web: A systematic review. JAMA, 287(20):2691--2700.",
      "doi": ""
    },
    {
      "text": "Farnham, S., Cheng, L., Stone, L., Zaner-Godsey, M., Hibbeln, C., Syrjala, K., et al. (2002). Hutchworld: Clinical study of computer-mediated social support for cancer patients and their caregivers. CHI'02, pp. 375--382.  ",
      "doi": "10.1145/503376.503444"
    },
    {
      "text": "Feder, H. M., Johnson, B. J., O'Connell, S., Shapiro, E. D., Steere, A. C., Wormser, G. P., et al. (2007). A critical appraisal of \"Chronic lyme disease\". NEJM, 357:1422--30.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. (2002). Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Fox, S., & Purcell, K. (2010). Chronic disease and the Internet http://www.pewinternet.org/Reports/2010/ ChronicDisease.aspx.",
      "doi": ""
    },
    {
      "text": "Fox, S. (2009). The social life of health information. www.pewinternet.org/Reports/2009/8-The-Social-Life-of-Health-Information.aspx.",
      "doi": ""
    },
    {
      "text": "France, D. (1999). Scientist at work: Allen C. Steere; Lyme expert developed big picture of tiny tick. www.NYTimes.com. Archived by WebCite® at http://www.webcitation.org/5jqHhP0DM.",
      "doi": ""
    },
    {
      "text": "Friedman, B. & Borning, A. (2002). Value sensitive design as a pattern: Examples from informed consent in web browsers and from urban simulation. In DIAC'02, 109--113.",
      "doi": ""
    },
    {
      "text": "Hardy, M. S., & Calhoun, L. G. (1997). Psychological distress and the \"medical student syndrome\" in abnormal psychology students. Teaching of Psychology, 24(3):192--193.",
      "doi": ""
    },
    {
      "text": "Harris Interactive, cited in the New York Times. (2007). Looking for answers. www.NYTimes.com. Archived by WebCite® at http://www.webcitation.org/5YtGjxB24.",
      "doi": ""
    },
    {
      "text": "Hobson-West, P. (2003). Understanding Vaccination Resistance: Moving Beyond Risk. Health, Risk, and Society, 5(3):273--283.",
      "doi": ""
    },
    {
      "text": "Jacobs, D. Internet activism and the democratic emergency in the U.S. (2005). ephemera, 5(1):68--77.",
      "doi": ""
    },
    {
      "text": "Kleinman, A. (1989). The illness narratives: Suffering, healing, and the human condition. New York, NY: Basic Books.",
      "doi": ""
    },
    {
      "text": "Kummervold, P. E., Gammon, D., Bergvik, S., Johnsen, J., Hasvold, T., & Rosenving, J. (2002). Social support in a wired world: Use of online mental health forums in Norway. Nordic Journal of Psychiatry, 56:59--65.",
      "doi": ""
    },
    {
      "text": "McKenna, K. & Bargh, J. A. (1998). Coming out in the age of the Internet: Identity \"demarginalization\" through virtual group participation. Journal of Personality and Social Psych. 75(3):681--694.",
      "doi": ""
    },
    {
      "text": "McManus, R. (2008). Health 2.0 through the eyes of a diabetic - one year later. ReadWriteWeb.com. Archived by WebCite® at http://www.webcitation.org/5jqlzPXLq.",
      "doi": ""
    },
    {
      "text": "Paul, S. A. and Reddy, M. C. (2010). Understanding together: Sensemaking in collaborative information seeking. CSCW'10, pp. 321--330.  ",
      "doi": "10.1145/1718918.1718976"
    },
    {
      "text": "Sewell, W. H. (1992). A Theory of Structure: Duality, Agency, and Transformation. The American Journal of Sociology, 98(1):1--29.",
      "doi": ""
    },
    {
      "text": "Sillence, E., Briggs, P., Fishwick, L., and Harris, P. 2004. Trust and mistrust of online health sites. CHI '04, pp. 663--670.  ",
      "doi": "10.1145/985692.985776"
    },
    {
      "text": "Sood, S. K. (2002). Effective retrieval of Lyme disease information on the web. Clinical Infectious Diseases, 35(4):451--464.",
      "doi": ""
    },
    {
      "text": "Strauss, A. L., & Corbin, J. (1998). Basics of qualitative research: Techniques and procedures for developing grounded theory. Newbury Park, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Verbrugge, L. M., & Patrick, D. L. (1995). Seven chronic conditions: Their impact on U.S. adults' activity levels and use of medical services. American Journal of Pub. Health 85(2):173--182.",
      "doi": ""
    },
    {
      "text": "Weintraub, P. (2008). Cure unknown: Inside the Lyme epidemic. NY: St. Martin's Press.",
      "doi": ""
    },
    {
      "text": "Wilson, T., Hoffmann, P., Somasundaran, S., Kessler, J., Wiebe, J., Choi, Y., et al. (2005). OpinionFinder: A system for subjectivity analysis. HLT/EMNLP'05, Interactive Demonstrations.  ",
      "doi": "10.3115/1225733.1225751"
    }
  ]
}