{
  "doi": "10.1145/1978942.1979448",
  "title": "Dinah: an interface to assist non-programmers with selecting program code causing graphical output",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3397-3400",
  "year": 2011,
  "badges": [],
  "abstract": "The web holds an abundance of source code examples with the potential to become learning resources for any end-user. However, for some end-users these examples may be unusable. An example is unusable if a user cannot select the code in the example that corresponds to their interests. Research suggests that non-programmers struggle to correctly select the code responsible for interesting output functionality. In this paper we present Dinah: an interface to support non-programmers with selecting code causing graphical output. Dinah assists non-programmers by providing concurrency support and in-context affordances for statement replay and temporally based navigation.",
  "tags": [
    "Dinah",
    "selection",
    "looking glass",
    "search",
    "end-user",
    "storytelling alice",
    "navigation",
    "non-programmer",
    "localization"
  ],
  "authors": [
    {
      "name": "Paul Gross",
      "institution": "Washington University in St. Louis, St. Louis, Missouri, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405592507",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Yang",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640887",
      "orcid": "missing"
    },
    {
      "name": "Caitlin Kelleher",
      "institution": "Washington University in St. Louis, St. Louis, Missouri, USA",
      "img": "/do/10.1145/contrib-81100607695/rel-imgonly/ckelleher.jpg",
      "acmid": "81100607695",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Biggerstaff, T.J., Mitbander, B.G., and Webster, D. The concept assignment problem in program understanding. In Proc. ICSE, IEEE (1993), 482--498. ",
      "doi": "10.5555/257572.257679"
    },
    {
      "text": "Brandt, J., Guo, P., Lewenstein, J., Dontcheva, M., and Klemmer, S. Two studies of opportunistic programming: interleaving web foraging, learning, and writing code. In Proc. CHI, ACM (2009), 1589--1598.  ",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "Dorn, B. and Guzdial, M. Graphic designers who program as informal computer science learners. In Proc. ICER, ACM (2006), 127--134.  ",
      "doi": "10.1145/1151588.1151608"
    },
    {
      "text": "Gross, P. and Kelleher, C. Toward transforming freely available source code into usable learning materials for end-users. In Proc. PLATEAU, ACM (2010), In Press.  ",
      "doi": "10.1145/1937117.1937123"
    },
    {
      "text": "Gross, P. and Kelleher, C. Non-programmers identifying functionality in unfamiliar code: strategies and barriers. JVLC 21, 5 (2010), 263--276.  ",
      "doi": "10.1016/j.jvlc.2010.08.002"
    },
    {
      "text": "Gross, P., Herstand, M., Hodges, J., and Kelleher, C. A code reuse interface for non-programmer middle school students. In Proc. IUI, ACM (2010), 219--228.  ",
      "doi": "10.1145/1719970.1720001"
    },
    {
      "text": "Jones, J.A., Harrold, M.J., and Stasko, J. Visualization of test information to assist fault localization. In Proc. ICSE, ACM (2002), 467--477.  ",
      "doi": "10.1145/581339.581397"
    },
    {
      "text": "Ko, A.J. and Myers, B.A. Extracting and answering why and why not questions about Java program output. ACM Trans. on Soft. Eng. and Met. 20, 2 (2010), 1--36.  ",
      "doi": "10.1145/1824760.1824761"
    },
    {
      "text": "Leshed, G., Haber, E., Matthews, T., and Lau, T. CoScripter: automating &amp;#38; sharing how-to knowledge in the enterprise. In Proc. CHI, (2008), 1719--1728.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Lieberman, H. and Fry, C. ZStep 95: A Reversible, Animated, Source Code Stepper. In J. Stasko, ed., Software Visualization: Programming as a Multimedia Experience. MIT Press, Cambridge, MA, 1997.",
      "doi": ""
    },
    {
      "text": "1Marcus, A., Rajlich, V., Buchta, J., Petrenko, M., and Sergeyev, A. Static techniques for concept location in object-oriented code. In Proc. IWPC, (2005), 33--42.  ",
      "doi": "10.1109/WPC.2005.33"
    },
    {
      "text": "Oney, S. and Myers, B. FireCrystal: Understanding interactive behaviors in dynamic web pages. In Proc. VL/HCC, IEEE (2009), 105--108.  ",
      "doi": "10.1109/VLHCC.2009.5295287"
    },
    {
      "text": "Rosson, M.B., Ballin, J., and Rode, J. Who, What, and How: A Survey of Informal and Professional Web Developers. In Proc. VL/HCC, IEEE (2005), 199--206.  ",
      "doi": "10.1109/VLHCC.2005.73"
    },
    {
      "text": "Wilde, N. and Scully, M.C. Software reconnaissance: Mapping program features to code. J. of Soft. Maint.: Research and Practice 7, 1 (1995), 49--62.  ",
      "doi": "10.1002/smr.4360070105"
    }
  ]
}