{
  "doi": "10.1145/1978942.1978983",
  "title": "We want more: human-computer collaboration in mobile social video remixing of music concerts",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "287-296",
  "year": 2011,
  "badges": [],
  "abstract": "Recording and publishing mobile video clips from music concerts is popular. There is a high potential to increase the concert's perceived value when producing video remixes from individual video clips and using them socially. A digital production of a video remix is an interactive process between human and computer. However, it is not clear what the collaboration implications between human and computer are. We present a case study where we compare the processes and products of manual and automatic mobile video remixing. We provide results from the first systematic real world study of the subject. We draw our observations from a user trial where fans recorded mobile video clips during a rock concert. The results reveal issues on heterogeneous interests of the stakeholders, unexpected uses of the raw material, the burden of editing, diverse quality requirements, motivations for remixing, the effect of understanding the logic of automation, and the collaborative use of manual and automatic remixing.",
  "tags": [
    "video",
    "social",
    "music",
    "human factors",
    "mobile",
    "automation"
  ],
  "authors": [
    {
      "name": "Sami Vihavainen",
      "institution": "Helsinki Institute for Information Technology & Aalto University, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447603563",
      "orcid": "missing"
    },
    {
      "name": "Sujeet Mate",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320492694",
      "orcid": "missing"
    },
    {
      "name": "Lassi Seppälä",
      "institution": "Helsinki Institute for Information Technology & Aalto University, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657253",
      "orcid": "missing"
    },
    {
      "name": "Francesco Cricri",
      "institution": "Tampere University of Technology, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658262",
      "orcid": "missing"
    },
    {
      "name": "Igor D.D. Curcio",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100029328",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Engstr&amp;#246;m, A., Esbj&amp;#246;rnsson, M. and Juhlin, O. Mobil collaborative live video mixing. Proc. MobileHCI 2008, (2008), 157--166.  ",
      "doi": "10.1145/1409240.1409258"
    },
    {
      "text": "Engstr&amp;#246;m, A., Esbj&amp;#246;rnsson, M. and Juhlin, O. Nighttime visual media production in club environments. Night and darkness: interaction after dark. Workshop at CHI 2008.  ",
      "doi": "10.1145/1358628.1358973"
    },
    {
      "text": "Foote, J., Cooper, M. and Girgensohn, A. Creating music videos using automatic media analysis. Proc. MM 2002, ACM Press (2002), 560.  ",
      "doi": "10.1145/641007.641119"
    },
    {
      "text": "Girgensohn, A. et al. A semi-automatic approach to home video editing. Proc. UIST 2000, ACM Press (2000), 81--89.  ",
      "doi": "10.1145/354401.354415"
    },
    {
      "text": "Girgensohn, A. et al. Home video editing made easy - balancing automation and user control. Proc. INTERACT 2001, ACM Press (2001), 464--471.",
      "doi": ""
    },
    {
      "text": "Jacucci, G., Oulasvirta, A., Salovaara, A. and Sarvas, R. (2005). Supporting the Shared Experience of Spectators through Mobile Group Media. Proc. GROUP 2005, ACM Press (2005), 207--216.  ",
      "doi": "10.1145/1099203.1099241"
    },
    {
      "text": "Kaltura open source video http://corp.kaltura.com/.",
      "doi": ""
    },
    {
      "text": "Kennedy, L. and Naaman, M. Less talk, more rock: Automated organization of community-contributed collections of concert videos. Proc. WWW 2009, ACM Press (2009), 311--320.  ",
      "doi": "10.1145/1526709.1526752"
    },
    {
      "text": "Kirk, D. et al. Understanding videowork. Proc. CHI 2007, ACM (2007), 61--70.  ",
      "doi": "10.1145/1240624.1240634"
    },
    {
      "text": "Lehmuskallio, A., Sarvas, R., Snapshot Video: Everyday Photographers Taking Short Video-Clips. Proc. NordiCHI 2008, ACM Press (2008).  ",
      "doi": "10.1145/1463160.1463188"
    },
    {
      "text": "Lessig, L. Remix: Making art and commerce thrive in the hybrid economy. Penguin Pr, 2008.",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., Sheridan, T. B. and Wickens, C. D. A model for types and levels of human interaction with automation. IEEE Transactions on Systems, Man and Cybernetics, Part A 30, 3 (2000), 286--297.  ",
      "doi": "10.1109/3468.844354"
    },
    {
      "text": "Sarvas, R., Viikari, M., Pesonen, J. And Nevanlinna, H. MobShare: Controlled and Immediate Sharing of Mobil Images. Proc. MUM 2004. ACM (2004), 724--731.  ",
      "doi": "10.1145/1027527.1027690"
    },
    {
      "text": "Shamma, D. A., Shawn, R., Shafton, P. L., Liu, Y. \"Watch what I watch: using community activity to understand content. Proc. MIR 2007. ACM Press (2007).  ",
      "doi": "10.1145/1290082.1290120"
    },
    {
      "text": "Sheridan, T. Telerobotics, Automation, and Human Supervisory Control. MIT Press, Cambridge, MA. 1992. ",
      "doi": "10.5555/134291"
    },
    {
      "text": "Vihavainen, S., Oulasvirta, A., Sarvas, R.: \"I Can't Lie Anymore - The Implications of Location Automation for Mobile Social Applications. Proc. MobiQuitous 2009, IEEE Press (2009).",
      "doi": ""
    }
  ]
}