{
  "doi": "10.1145/1978942.1979082",
  "title": "Infrastructures for low-cost laptop use in Mexican schools",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "945-954",
  "year": 2011,
  "badges": [],
  "abstract": "In recent years, a number of low-cost laptops have been created for children's education, most notably the XO, developed by One Laptop per Child to embody principles of constructionist learning, and the ClassmatePC, designed by Intel to fit within and improve traditional education. We report on a series of field studies in Mexican elementary schools that deployed the XO or ClassmatePC. Although both devices are promoted as valuable for improving education in developing countries, our studies suggest that creating the social and technical infrastructures needed to sustain school laptop use is far more complex than what technology designers assume.",
  "authors": [
    {
      "name": "Ruy Cervantes",
      "institution": "Univerisity of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371594962",
      "orcid": "missing"
    },
    {
      "name": "Mark Warschauer",
      "institution": "Univerisity of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100356714",
      "orcid": "missing"
    },
    {
      "name": "Bonnie Nardi",
      "institution": "Univerisity of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100150025",
      "orcid": "missing"
    },
    {
      "name": "Nithya Sambasivan",
      "institution": "Univerisity of California, Irvine, Irvine, California, USA",
      "img": "/do/10.1145/contrib-81350582954/rel-imgonly/nithya_coorg.jpg",
      "acmid": "81350582954",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brazilian Ministry of Education plan large deployment with Mandriva Linux on Intel-powered classmate PCs. http://www2.mandriva.com/en/news/?p=145&amp;#38;s=0.",
      "doi": ""
    },
    {
      "text": "Mochila Digital. www.mochiladigitaltelmex.com.mx/.",
      "doi": ""
    },
    {
      "text": "OLPC Mexico. wiki.laptop.org/go/OLPC_Mexico.",
      "doi": ""
    },
    {
      "text": "Plan Ceibal. www.ceibal.edu.uy/.",
      "doi": ""
    },
    {
      "text": "Intel's Vision for Low Cost Netbook Laptops for Children and Schools Worldwide. www.classmatepc.com/vision/.",
      "doi": ""
    },
    {
      "text": "Ames, M. Hacker Learning? The Social Meanings of One Laptop Per Child. 2008.",
      "doi": ""
    },
    {
      "text": "Ananny, M. and Winters, N. Designing for Development: Understanding One Laptop Per Child in its Historical Context. ICTD (2007).",
      "doi": ""
    },
    {
      "text": "Arora, P. Hope-in-the-Wall? A digital promise for free learning. British Journal of Educ. Technology 41, 5 (2010).",
      "doi": ""
    },
    {
      "text": "Bender, W. Radio Open Source interview. 2007. olpctalks.",
      "doi": ""
    },
    {
      "text": "com/walter_bender/bender_radio_open_source.html.",
      "doi": ""
    },
    {
      "text": "Best, M.L. and Kumar, R. Sustainability failures of rural telecenters: Challenges from the sustainable access in rural india (sari) project. ITID 4, 4 (2008).  ",
      "doi": "10.1162/itid.2008.00025"
    },
    {
      "text": "1Bracho, T. Desigualdad educativa. Un tema recurrente. Revista Mexicana de investigaci&amp;#243;n educativa 7, (2002).",
      "doi": ""
    },
    {
      "text": "Giacquinta, J.B., Bauer, J.A., and Levin, J.E. Beyond technology's promise: an examination of children's educa-tional computing at home. Cambridge Univ. Press, 1993. ",
      "doi": "10.5555/562524"
    },
    {
      "text": "Heredia Escorza, Y. and Lozano Rodr&amp;#237;guez, A. El uso de computadoras ClassmatePC en una escuela primaria del estado de Puebla: un estudio descriptivo. 2008.",
      "doi": ""
    },
    {
      "text": "Irani, L., Dourish, P., and Mazmanian, M. Shopping for sharpies in Seattle: mundane infrastructures of transnational design. ICIC (2010).  ",
      "doi": "10.1145/1841853.1841860"
    },
    {
      "text": "Kraemer, K., Dedrick, J., and Sharma, P. One laptop per child: vision vs. reality. Commun. ACM 52, (2009).  ",
      "doi": "10.1145/1516046.1516063"
    },
    {
      "text": "Kumar, A., Tewari, A., Shroff, G., Chittamuru, D., Kam, M., and Canny, J. An exploratory study of unsupervised mobile learning in rural India. CHI (2010).  ",
      "doi": "10.1145/1753326.1753435"
    },
    {
      "text": "LeDantec, C. and Edwards, K. The view from the trenches: organization, power, and technology at two nonprofit homeless outreach centers. CSCW (2008).  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "LeDantec, C. and Edwards, K. Across boundaries of influence and accountability: the multiple scales of public sector information systems. CHI (2010).",
      "doi": ""
    },
    {
      "text": "Lee, C.P., Dourish, P., and Mark, G. The human infrastructure of cyberinfrastructure. CSCW (2006).  ",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Luyt, B. The One Laptop Per Child Project and the nego-tiation of technological meaning. First Monday 13, (2008).",
      "doi": ""
    },
    {
      "text": "2Mu&amp;#241;oz-Izquierdo, C. and Maga&amp;#241;a Rodriguez, R. Un acerca-miento a la eficacia de los Programas del gobierno federal orientados a mejorar la calidad de la educaci&amp;#243;n b&amp;#225;sica. Revista Mexicana de Investigaci&amp;#243;n Educativa 13, (2008).",
      "doi": ""
    },
    {
      "text": "2Nardi, B. and O'Day, V. Information Ecologies: Using Technology with Heart. MIT Press, 2000.  ",
      "doi": "10.1145/337271.337286"
    },
    {
      "text": "N&amp;#228;slund-Hadley, E., Kipp, S., Cruz, J., Ibarrar&amp;#225;n, P., and Steiner-Khamsi, G. OLPC Pre-Pilot Evaluation Report (Haiti). Inter-American Bank Education Division.",
      "doi": ""
    },
    {
      "text": "Pal, J., Patra, R., Nedevschi, S., Plauche, M., and Pawar, U.S. The Case of the Occasionally Cheap Computer. ITID 5, (2009).",
      "doi": ""
    },
    {
      "text": "Papert, S. Mindstorms: Children, computers, and powerful ideas. Basic Books, 1993.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Patel, N., Chittamuru, D., Jain, A., Dave, P., and Parikh, T.S. Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. CHI, (2010).  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Pe&amp;#241;a-Lopez, I. From Laptops to Competences: Bridging the Digital Divide in Education. Revista de Universidad y Sociedad del Conocimiento 7, (2010).",
      "doi": ""
    },
    {
      "text": "Pineda Pineda, I. Compentencias para el desarrollo del trabajo docente en la escuela primaria. Congreso Nacional de Investigaci&amp;#243;n Educativa, (2010).",
      "doi": ""
    },
    {
      "text": "Plan Ceibal. S&amp;#237;ntesis del informe de monitoreo del estado del parque de XO a abril de 2010. http://www.ceibal.org.uy/.",
      "doi": ""
    },
    {
      "text": "Ribes, D. and Finholt, T. Tensions across the scales: planning infrastructure for the long-term. GROUP, (2007).  ",
      "doi": "10.1145/1316624.1316659"
    },
    {
      "text": "3Sambasivan, N., Cutrell, E., Toyama, K., and Nardi, B. Intermediated technology use in developing communities. CHI (2010), 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "3Star, S.L. and Ruhleder, K. Steps toward an ecology of infrastructure: Design and access for large information spaces. In J. Yates and J. Van Maanen, eds., Information technology and organizational transformation: history, rhetoric, and practice. SAGE, 2001.",
      "doi": ""
    },
    {
      "text": "3Vota, W., Derndorfer, C., and Berry, B. One laptop per child overview. 2009. www.olpcnews.com/files. ",
      "doi": "10.5555/1803763"
    },
    {
      "text": "One_Laptop_Per_Child_Overview_2009.pdf.",
      "doi": ""
    },
    {
      "text": "Warschauer, M. Technology and social inclusion: rethinking the digital divide. MIT Press, 2004. ",
      "doi": "10.5555/1036234"
    },
    {
      "text": "Warschauer, M. Laptops And Literacy: Learning in the Wireless Classroom. Teachers College Press, 2006.",
      "doi": ""
    },
    {
      "text": "Warschauer, M. and Ames, M. Can One Laptop per Child Save the World's Poor? Journal of Intl. Affairs, (2010).",
      "doi": ""
    },
    {
      "text": "3Warschauer, M., Cotten, S., and Morgan, A. One Laptop Per Child Birmingham: Case Study of a Radical Experiment. manuscript submitted for publication.",
      "doi": ""
    },
    {
      "text": "3Wyche, S.P., Smyth, T.N., Chetty, M., Aoki, P.M., and Grinter, R.E. Deliberate interactions: characterizing technology use in Nairobi, Kenya. CHI, ACM (2010)..  ",
      "doi": "10.1145/1753326.1753719"
    }
  ]
}