{
  "doi": "10.1145/1978942.1979142",
  "title": "2d touching of 3d stereoscopic objects",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1353-1362",
  "year": 2011,
  "badges": [],
  "abstract": "Recent developments in the area of touch and display technologies have suggested to combine multi-touch systems and stereoscopic visualization. Stereoscopic perception requires each eye to see a slightly different perspective of the same scene, which results in two distinct projections on the display. Thus, if the user wants to select a 3D stereoscopic object in such a setup, the question arises where she would touch the 2D surface to indicate the selection. A user may apply different strategies, for instance touching the midpoint between the two projections, or touching one of them. In this paper we analyze the relation between the 3D positions of stereoscopically rendered objects and the on-surface touch points, where users touch the surface. We performed an experiment in which we determined the positions of the users' touches for objects, which were displayed with positive, negative or zero parallaxes. We found that users tend to touch between the projections for the two eyes with an offset towards the projection for the dominant eye. Our results give implications for the development of future touch-enabled interfaces, which support 3D stereoscopic visualization.",
  "tags": [
    "multi-touch",
    "touch screens",
    "stereoscopic displays"
  ],
  "authors": [
    {
      "name": "Dimitar Valkov",
      "institution": "University of Münster, Münster, Germany",
      "img": "/do/10.1145/contrib-81442616889/rel-imgonly/photo.jpg",
      "acmid": "81442616889",
      "orcid": "missing"
    },
    {
      "name": "Frank Steinicke",
      "institution": "University of Münster, Münster, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    },
    {
      "name": "Gerd Bruder",
      "institution": "University of Münster, Münster, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317491340",
      "orcid": "missing"
    },
    {
      "name": "Klaus Hinrichs",
      "institution": "University of Münster, Münster, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100061158",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AVIGLE - Avionic Digital Service Platform. http://www.avigle.de/.",
      "doi": ""
    },
    {
      "text": "Immersion SAS. http://www.immersion.fr/.",
      "doi": ""
    },
    {
      "text": "iMUTS - Interscopic Multi-Touch Surfaces. http://imuts.uni-muenster.de/.",
      "doi": ""
    },
    {
      "text": "InSTInCT - Touch-based interfaces for Interaction with 3D Content. http://anr-instinct.cap-sciences.net/.",
      "doi": ""
    },
    {
      "text": "H. Benko and S. Feiner. Balloon selection: A multi-finger technique for accurate low-fatigue 3d selection. IEEE Symposium on 3D User Interfaces (3DUI), pages 79--86, 2007.",
      "doi": ""
    },
    {
      "text": "H. Benko, A. D. Wilson, and R. Balakrishnan. Sphere: multi-touch interactions on a spherical display. In ACM Symposium on User Interface Software and Technology (UIST), pages 77--86, 2008.  ",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "H. Benko, A. D. Wilson, and P. Baudisch. Precise selection techniques for multi-touch screens. In ACM Proceedings of Human Factors in Computing Systems (CHI), pages 1263--1272, 2006.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "J.-B. de la Rivi&amp;#232;re, C. Kerv&amp;#233;gant, E. Orvain, and N. Dittlo. Cubtile: a multi-touch cubic interface. In ACM Symposium on Virtual Reality Software and Technology (VRST), pages 69--72, 2008.  ",
      "doi": "10.1145/1450579.1450593"
    },
    {
      "text": "A. Y. Dvorkin, R. V. Kenyon, and E. A. Keshner. Reaching within a dynamic virtual environment. Journal of NeuroEngineering and Rehabilitation, 4(23), 2007.",
      "doi": ""
    },
    {
      "text": "J. Ferwerda. Psychophysics 101: How to run perception experiments in computer graphics. In SIGGRAPH core, 2008.  ",
      "doi": "10.1145/1401132.1401243"
    },
    {
      "text": "L. Geniva, R. Chua, and J. T. Enns. Attention for perception and action: task interference for action planning, but not for online control. Experimental Brain Research, 185(4):709--717, 2008.",
      "doi": ""
    },
    {
      "text": "T. Grossman and D. Wigdor. Going deeper: a taxonomy of 3d on the tabletop. In IEEE TABLETOP '07., pages 137--144, 2007.",
      "doi": ""
    },
    {
      "text": "T. Grossman, D. Wigdor, and R. Balakrishnan. Multi-finger gestural interaction with 3d volumetric displays. In ACM SIGGRAPH '05, pages 931--931, 2005.  ",
      "doi": "10.1145/1186822.1073287"
    },
    {
      "text": "J. Y. Han. Low-cost multi-touch sensing through frustrated total internal reflection. In ACM Symposium on User Interface Software and Technology (UIST), pages 115--118, 2005.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "M. Hancock, S. Carpendale, and A. Cockburn. Shallow-depth 3d interaction: design and evaluation of one-, two- and three-touch techniques. In ACM Proceedings of Human Factors in Computing Systems (CHI), pages 1147--1156, 2007.  ",
      "doi": "10.1145/1240624.1240798"
    },
    {
      "text": "O. Hilliges, S. Izadi, A. D. Wilson, S. Hodges, A. Garcia-Mendoza, and A. Butz. Interactions in the Air: Adding Further Depth to Interactive Tabletops. In ACM Symposium on User Interface Software and Technology (UIST), pages 139--148, 2009.  ",
      "doi": "10.1145/1622176.1622203"
    },
    {
      "text": "C. Holz and P. Baudisch. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In ACM Proceedings of Human Factors in Computing Systems (CHI), pages 1165--1174, 2009.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "G. Liu, R. Chua, and J. T. Enns. Attention for perception and action: task interference for action planning, but not for online control. Experimental Brain Research, 185:709--717, 2008.",
      "doi": ""
    },
    {
      "text": "C. L. MacKenziea, R. G. Marteniuka, C. Dugasa, D. Liskea, and B. Eickmeiera. Three-dimensional movement trajectories in fitts' task: Implications for control. The Quarterly Journal of Experimental Psychology Section A, 39(4):629--647, 1987.",
      "doi": ""
    },
    {
      "text": "A. P. Mapp, H. Ono, and R. Barbeito. What does the dominant eye dominate? a brief and somewhat contentious review. Perception &amp;#38; Psychophysics, 65(2):310--317, 2003.",
      "doi": ""
    },
    {
      "text": "A. Martinet, G. Casiez, and G. Grisoni. The design and evaluation of 3d positioning techniques for multi-touch displays. In IEEE Symposium on 3D User Interfaces (3DUI), 2010.  ",
      "doi": "10.1109/3DUI.2010.5444709"
    },
    {
      "text": "C. M&amp;#252;ller-Tomfelde, J. Sch&amp;#246;ning, J. Hook, T. Bartindale, D. Schmidt, P. Oliver, F. Echtler, N. Motamedi, P. Brandl, and U. Zadow. Building interactive multi-touch surfaces. In C. M&amp;#252;ller-Tomfelde, editor, Tabletops - Horizontal Interactive Displays, Human-Computer Interaction Series, pages 27--49. Springer London, 2010.",
      "doi": ""
    },
    {
      "text": "J. Pierce, A. Forsberg, M. Conway, S. Hong, R. Zeleznik, and M. Mine. Image Plane Interaction Techniques in 3D Immersive Environments. In ACM Interactive 3D Graphics, pages 39--44, 1997.  ",
      "doi": "10.1145/253284.253303"
    },
    {
      "text": "R. L. Potter, L. J. Weldon, and B. Shneiderman. Improving the accuracy of touch screens: an experimental evaluation of three strategies. In ACM Proceedings of Human Factors in Computing Systems (CHI), pages 27--32, 1988.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "J. L. Reisman, P. L. Davidson, and J. Y. Han. A screen-space formulation for 2d and 3d direct manipulation. In ACM Symposium on User Interface Software and Technology (UIST), pages 69--78, 2009.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "D. Schmalstieg, L. M. Encarna&amp;#231;ao, and Z. Szalav&amp;#225;ri. Using transparent props for interaction with the virtual table. In ACM Interactive 3D graphics '99, pages 147--153, 1999.  ",
      "doi": "10.1145/300523.300542"
    },
    {
      "text": "J. Sch&amp;#246;ning, F. Steinicke, D. Valkov, A. Kr&amp;#252;ger, and K. H. Hinrichs. Bimanual interaction with interscopic multi-touch surfaces. In IFIP TC13 Conference on Human-Computer Interaction (INTERACT '09), pages 40--53, 2009.  ",
      "doi": "10.1007/978-3-642-03658-3_8"
    },
    {
      "text": "F. Steinicke, T. Ropinski, G. Bruder, and K. Hinrichs. Interscopic User Interface Concepts for Fish Tank Virtual Reality Systems. In IEEE Proceedings of VR2007, pages 27--34, 2007.",
      "doi": ""
    },
    {
      "text": "D. Valkov, F. Steinicke, G. Bruder, K. Hinrichs, J. Sch&amp;#246;ning, F. Daiber, and A. Kr&amp;#252;ger. Touching floating objects in projection-based virtual reality environments. In Joint Virtual Reality Conference of EuroVR - EGVE - VEC, pages 17--24, 2010.  ",
      "doi": "10.5555/2386062.2386066"
    },
    {
      "text": "A. Viau, A. G. Feldman, B. J. McFadyen, and M. F. Levin. Reaching in reality and virtual reality: a comparison of movement kinematics in healthy subjects and in adults with hemiparesis. Journal of NeuroEngineering and Rehabilitation, 1(11), 2004.",
      "doi": ""
    },
    {
      "text": "C. Ware and K. Lowther. Selection using a one-eyed cursor in a fish tank vr environment. ACM Transactions on Computer-Human Interaction, 4:309--322, 1997.  ",
      "doi": "10.1145/267135.267136"
    },
    {
      "text": "D. Whitney, D. A. Westwood, and M. A. Goodale. The influence of visualmotion on fast reaching movements to a stationary object. Letters to Nature, 423:869--873, 2003.",
      "doi": ""
    },
    {
      "text": "A. D. Wilson, S. Izadi, O. Hilliges, A. Garcia-Mendoza, and D. Kirk. Bringing physics to the surface. In ACM Symposium on User Interface Software and Technology (UIST), pages 67--76, 2008.  ",
      "doi": "10.1145/1449715.1449728"
    }
  ]
}