{
  "doi": "10.1145/1978942.1979450",
  "title": "Normative influences on thoughtful online participation",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3401-3410",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We describe two experiments on whether individual thoughtful effort during online commenting is shaped by situational norms derived from the behavior of social others and the design of the environment, respectively. By measuring the length of participants' comments on a news website, the time taken to write them, and the number of issue-relevant thoughts they contain, we demonstrate that participants conform to high vs. low norms of thoughtfulness manifested through either the apparent behavior of other users or through visual, textual and interactional design features conceptually associated with thoughtfulness. Theoretical and applied insights for designing online participatory environments are discussed.",
  "authors": [
    {
      "name": "Abhay Sukumaran",
      "institution": "Stanford University, Stanford, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416599099",
      "orcid": "missing"
    },
    {
      "name": "Stephanie Vezich",
      "institution": "University of California, Los Angeles, Los Angeles, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656088",
      "orcid": "missing"
    },
    {
      "name": "Melanie McHugh",
      "institution": "Stanford University, Stanford, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484652742",
      "orcid": "missing"
    },
    {
      "name": "Clifford Nass",
      "institution": "Stanford University, Stanford, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153283",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aarts, H. and Dijksterhuis, A., The silence of the library: Environment, situational norm, and social behavior. Journal of Personality and Social Psychology 84, 2 (2003), 18--28.",
      "doi": ""
    },
    {
      "text": "Berger, J., Meredith, M., and Wheeler, S. C., Contextual priming: Where people vote affects how they vote. Proceedings of the National Academy of Sciences 105, 26 (2008), 8846--49.",
      "doi": ""
    },
    {
      "text": "Cacioppo, J. T. and Petty, R. E., \"Social psychological procedures for cognitive response assessment: The thought-listing technique,\" in Cognitive Assessment, T. V. Merluzzi, C. R. Glass, and M. Genest (Eds.), Guilford Press, New York, 1981, 309--342.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Harper, F. M., Konstan, J., and Li, S. X., Social Comparisons and Contributions to Online Communities: A Field Experiment on MovieLens. American Economic Review 100, 4 (2010), 1358--98.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. B., Crafting normative messages to protect the environment. Current Directions in Psychological Science 12, 4 (2003), 105--109.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. B. and Goldstein, N. J., Social influence: Compliance and conformity. Annual Review of Psychology 55 (2004), 591--621.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. B., Reno, R. R., and Kallgren, C. A., A focus theory of normative conduct: Recycling the concept of norms to reduce littering in public places. Journal of Personality and Social Psychology 58, 6 (1990), 1015--26.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. B. and Trost, M. R., \"Social Influence: Social Norms, Conformity, and Compliance,\" in The Handbook of Social Psychology, D. T. Gilbert, Fiske, S. T., Lindzey, G. (Eds.), (1998), Oxford Univ. Pr, 151--192.",
      "doi": ""
    },
    {
      "text": "Dijksterhuis, A. and Bargh, J. A., The perception-behavior expressway: Automatic effects of social perception on social behavior. Advances in Experimental Social Psychology 33 (2001), 1--40.",
      "doi": ""
    },
    {
      "text": "Fleishman, J. A., The effects of decision framing and others' behavior on cooperation in a social dilemma. Journal of Conflict Resolution 32, 1 (1988), 162--180.",
      "doi": ""
    },
    {
      "text": "Goldstein, N. J., Cialdini, R. B., and Griskevicius, V., A room with a viewpoint: Using social norms to motivate environmental conservation in hotels. Journal of Consumer Research 35, 3 (2008), 472--482.",
      "doi": ""
    },
    {
      "text": "Gunawardena, C. N. and Zittle, F. J., Social presence as a predictor of satisfaction within a computer-mediated conferencing environment. American journal of distance education 11, 3 (1997), 8--26.",
      "doi": ""
    },
    {
      "text": "Harrison, S. and Dourish, P. Re-place-ing space: the roles of place and space in collaborative systems. In Proc. ACM CSCW (1996), 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Jenkins, H., Convergence culture: Where old and new media collide. NYU Press, 2006.",
      "doi": ""
    },
    {
      "text": "Kay, A. C., Wheeler, S. C., Bargh, J. A., and Ross, L., Material priming: The influence of mundane physical objects on situational construal and competitive behavioral choice. Organizational Behavior and Human Decision Processes 95, 1 (2004), 83--96.",
      "doi": ""
    },
    {
      "text": "Kiesler, S., Siegel, J., and McGuire, T. W., Social psychological aspects of computer-mediated communication. The American psychologist 39, 10 (1984), 1123--34.",
      "doi": ""
    },
    {
      "text": "Kollock, P. and Smith, M., \"Managing the virtual commons: Cooperation and conflict in computer communities,\" in Computer-Mediated Communication: Linguistic, Social, and Cross-Cultural Perspectives, S. Herring (Ed.), John Benjamins, Amsterdam, 1996, 109--128.",
      "doi": ""
    },
    {
      "text": "Lampe, C. and Resnick, P. Slash (dot) and burn: distributed moderation in a large online conversation space. In Proc CHI 2004, ACM Press (2004), 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Latané, B. and Darley, J. M., Bystander apathy. American Scientist 57, 2 (1969), 244--268.",
      "doi": ""
    },
    {
      "text": "Lerman, K., Social information processing in news aggregation. IEEE Internet Computing 11, 6 (2007), 16--28.  ",
      "doi": "10.1109/MIC.2007.136"
    },
    {
      "text": "Liberman, V., Samuels, S. M., and Ross, L., The name of the game: Predictive power of reputations versus situational labels in determining prisoner's dilemma game moves. Personality and Social Psychology Bulletin 30, 9 (2004), 1175--85.",
      "doi": ""
    },
    {
      "text": "Lindgaard, G., Fernandes, G., Dudek, C., and Brown, J., Attention web designers: You have 50 milliseconds to make a good first impression! Behaviour & Information Technology 25, 2 (2006), 115--126.",
      "doi": ""
    },
    {
      "text": "Maheswaran, D. and Chaiken, S., Promoting systematic processing in low-motivation settings: Effect of incongruent information on processing and judgment. Journal of Personality and Social Psychology 61, 1 (1991), 13--25.",
      "doi": ""
    },
    {
      "text": "Mandel, N. and Johnson, E. J., When Web Pages Influence Choice: Effects of Visual Primes on Experts and Novices. Journal of Consumer Research: An Interdisciplinary Quarterly 29, 2 (2002), 235--245.",
      "doi": ""
    },
    {
      "text": "Mishne, G. and Glance, N. Leave a reply: An analysis of weblog comments. In Third annual workshop on the Weblogging ecosystem: WWW (2006).",
      "doi": ""
    },
    {
      "text": "Nolan, J. M., Schultz, P., Cialdini, R. B., Goldstein, N. J., and Griskevicius, V., Normative social influence is underdetected. Personality and Social Psychology Bulletin 34, 7 (2008), 913--923.",
      "doi": ""
    },
    {
      "text": "Perkins, H. W., The social norms approach to preventing school and college age substance abuse: A handbook for educators, counselors, and clinicians. Jossey-Bass, San Francisco, CA, 2003.",
      "doi": ""
    },
    {
      "text": "Perkins, H. W., Haines, M. P., and Rice, R., Misperceiving the college drinking norm and related problems: a nationwide study of exposure to prevention information, perceived norms and student alcohol misuse. Journal of Studies on Alcohol 66, 4 (2005), 470--478.",
      "doi": ""
    },
    {
      "text": "Postmes, T., Spears, R., and Lea, M., The formation of group norms in computer-mediated communication. Human Communication Research 26, 3 (2000), 341--371.",
      "doi": ""
    },
    {
      "text": "Postmes, T., Spears, R., Sakhel, K., and De Groot, D., Social influence in computer-mediated communication: The effects of anonymity on group behavior. Personality and Social Psychology Bulletin 27, 10 (2001), 1243--54.",
      "doi": ""
    },
    {
      "text": "Robins, D. and Holmes, J., Aesthetics and credibility in web site design. Information Processing & Management 44, 1 (2008), 386--399.  ",
      "doi": "10.1016/j.ipm.2007.02.003"
    },
    {
      "text": "Salganik, M. J., Dodds, P. S., and Watts, D. J., Experimental study of inequality and unpredictability in an artificial cultural market. Science 311, 5762 (2006), 854--856.",
      "doi": ""
    },
    {
      "text": "Sassenberg, K., Common Bond and Common Identity Groups on the Internet: Attachment and Normative Behavior in On-Topic and Off-Topic Chats. Group Dynamics 6, 1 (2002), 27--37.",
      "doi": ""
    },
    {
      "text": "Sassenberg, K. and Boos, M., Attitude change in computer-mediated communication: Effects of anonymity and category norms. Group Processes & Intergroup Relations 6, 4 (2003), 405--422.",
      "doi": ""
    },
    {
      "text": "Sherif, M., A study of some social factors in perception. Archives of Psychology (Columbia University) 187, 1935.",
      "doi": ""
    },
    {
      "text": "Srull, T. K. and Wyer, R. S., Category accessibility and social perception: Some implications for the study of person memory and interpersonal judgments. Journal of Personality and Social Psychology 38, 6 (1980), 841--856.",
      "doi": ""
    },
    {
      "text": "Stapel, D. A. and Koomen, W., When Stereotype Activation Results in (Counter) Stereotypical Judgments: Priming Stereo-type-Relevant Traits and Exemplars. Journal of Experimental Social Psychology 34, (1998), 136--163.",
      "doi": ""
    },
    {
      "text": "Szabo, G. and Huberman, B. A., \"Predicting the popularity of online content,\" in eprint arXiv: 0811.0405 (2008). http://ssrn.com/abstract=1295610.",
      "doi": ""
    },
    {
      "text": "Tractinsky, N., Katz, A. S., and Ikar, D., What is beautiful is usable. Interacting with computers 13, 2 (2000), 127--145.",
      "doi": ""
    },
    {
      "text": "Turner, J. C., Social influence. Wadsworth, 1991.",
      "doi": ""
    },
    {
      "text": "Wellman, B., Haase, A. Q., Witte, J., and Hampton, K., Does the Internet increase, decrease, or supplement social capital?: social networks, participation, and community commitment. American Behavioral Scientist 45, 3 (2001), 436--455.",
      "doi": ""
    }
  ]
}