{
  "doi": "10.1145/1978942.1979256",
  "title": "Telling calls: facilitating mobile phone conversation grounding and management",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2153-2162",
  "year": 2011,
  "badges": [],
  "abstract": "Current cell phone designs are limited by the information a caller can provide to the receiver at the time of a call. As a result callers are handicapped in effectively negotiating interaction commitment from the receiver, and perhaps more importantly, receivers are unable to make informed call handling decisions. To examine the nature of this information gap we 1) developed Telling Calls, a mobile phone application which allows users to provide and receive information such as what the call is about and the circumstances of the caller under which it is being made, and 2) conducted a qualitative field study (36 users) and a quantitative field study (30 users) of Telling Calls use. Together these studies provide insights on how additional caller generated information shared at the time of call handling effectively improves the process of negotiating interaction commitment, and establishing common ground.",
  "tags": [
    "cell phone",
    "response",
    "design",
    "management",
    "outeraction",
    "interruption",
    "availability",
    "communication",
    "grounding"
  ],
  "authors": [
    {
      "name": "Sukeshini A. Grandhi",
      "institution": "RWTH Aachen University, Aachen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131312",
      "orcid": "missing"
    },
    {
      "name": "Richard Schuler",
      "institution": "New Jersey Institute of Technology, Newark, New Jersey, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490166",
      "orcid": "missing"
    },
    {
      "name": "Quentin (Gad) Jones",
      "institution": "New Jersey Institute of Technology, Newark, New Jersey, USA",
      "img": "/do/10.1145/contrib-81100554718/rel-imgonly/aa.jpg",
      "acmid": "81100554718",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Avrahami, D., Gergle, D., Hudson, S. E., & Kiesler, S. (2007). Improving the match between callers and receivers: A study on the effect of contextual information on cell phone interruptions. Behaviour & Information Technology, 26(3), 247--259.  ",
      "doi": "10.1080/01449290500402338"
    },
    {
      "text": "Battestini, A., Setlur, V., and Sohn, T., (2010). A large scale study of text-messaging use. Proceedings of MobileHCI, pp. 229--238.  ",
      "doi": "10.1145/1851600.1851638"
    },
    {
      "text": "Begole, J. B., Matsakis, N. E., and Tang, J. C.: \"Lilsys: Sensing Unavailability\"; Proc. CSCW '04, ACM Press, New York, USA (2004), 511--514.  ",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "Bentley, F. R., & Metcalf, C. J. (2008). Location and activity sharing in everyday mobile communication. Proc. CHI '08 (EA) (pp. 2453--2462). ACM Press.  ",
      "doi": "10.1145/1358628.1358702"
    },
    {
      "text": "Clark, H. H. & Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, R. M. Levine, & S. D. Teasley (Eds.). Perspectives on socially shared cognition (pp. 127--149).",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M., & Larson, R. (1987). Validity and Reliability of the Experience Sampling Method. Journal of Nervous and Mental Disease, 175(9), 526--536.",
      "doi": ""
    },
    {
      "text": "Dabbish, L. A. (2006). Coordinating Initiation and Response in Computer-Mediated Communication. Unpublished PhD Dissertation, Carnegie Mellon University. ",
      "doi": "10.5555/1354268"
    },
    {
      "text": "De Guzman, E. S., Sharmin, M., & Bailey, B. P. (2007). Should I call now? Understanding what context is considered when deciding whether to initiate remote communication via mobile devices. In C. G. Healey & E. Lank (Eds.), Proceedings of Graphics Interface 2007 (GI 2007) (Vol. 143--150).  ",
      "doi": "10.1145/1268517.1268542"
    },
    {
      "text": "Grandhi, S. A., Schuler, R. P., & Jones, Q. (2009). To answer or not to answer: that is the question for cell phone users. CHI '09 (EA). ACM Press.  ",
      "doi": "10.1145/1520340.1520710"
    },
    {
      "text": "Gergle, D., Millen, D. R., Kraut, R. E., & Fussell, S. R. (2004). Persistence Matters: Making the Most of Chat in Tightly-Coupled Work. Proc. CHI'04 (pp. 431--438). ACM Press.  ",
      "doi": "10.1145/985692.985747"
    },
    {
      "text": "Grinter, R. and Eldridge, M. Wan2tlk?: everyday text messaging. Proc. CHI'03 (pp. 441--448). ACM Press.  ",
      "doi": "10.1145/642611.642688"
    },
    {
      "text": "Grudin, J. (1987). Social evaluation of the user interface: Who does the work and who gets the benefit? In H. Bullinger & B. Shackel (Eds.), Proc. INTERACT'87, 2nd IFIP Conference on Human-Computer Interaction (Stuttgart, FRG) (pp. 805--811). Stuttgart, North-Holland, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Ho, J., & S., I. (2005). Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. Proc. CHI'05 (pp. 909--918). ACM Press.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Horvitz, E., P., K., R., S., Apacible, J., & Subramani, M. (2005). Bayesphone: Precomputation of context-sensitive policies for inquiry and action in mobile devices. Proceedings of 10th International Conference (UM 2005) (Vol. 251--260). Berlin: Springer-Verlag.  ",
      "doi": "10.1007/11527886_33"
    },
    {
      "text": "Jones, Q., Grandhi, S., Whittaker, S., Chivakula, K., & Terveen, L. (2004). Putting Systems into Place: A Qualitative Study of Design Requirements for Location-Aware Community Systems. Proc. CSCW 2004. ACM Press.  ",
      "doi": "10.1145/1031607.1031640"
    },
    {
      "text": "Klein, H. K & Myers, M. D. (1999). A Set of Principles for Conducting and Evaluating Interpretive Field Studies in Information Systems. MIS Quarterly, 23(1), 67--95.  ",
      "doi": "10.2307/249410"
    },
    {
      "text": "Ling, R. The Sociolinguistics of SMS: An Analysis of SMS Use by a Random Sample of Norwegians. In Mobile Communications. 2005, 335--349.",
      "doi": "10.5555/1088926"
    },
    {
      "text": "McFarlane, D. C & Latorella, K. A. (2002). The scope and importance of human interruption in human-computer interaction design. Human-Computer Interaction, 17(1), 1--61.  ",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Milewski, A. (2006). Interruption Management and Telephone Call Screening. International Journal of Human Computer Interaction, 20(1), 19--33.",
      "doi": ""
    },
    {
      "text": "Milewski, A. E. and Smith, T. M., Providing Presence Cues to Telephone Users. Proc. CSCW 2000 (pp. 89--96).  ",
      "doi": "10.1145/358916.358978"
    },
    {
      "text": "Nardi, B. A., Whittaker, S., & Bradner, E. (2000). Interaction and outeraction: Instant messaging in action. Proc. CSCW 2002 (pp. 79--88). ACM Press.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Nelson, L., Bly, S., Sokoler, T., (2002). Quiet Calls: Talking Silently on Mobile Phones. Proc. CHI'02: (pp. 174--181).  ",
      "doi": "10.1145/365024.365094"
    },
    {
      "text": "Norman, D. A. (1988). The Psychology of Everyday Things. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Pedersen, E. R. (2001). Calls.Calm: Enabling Caller and Callee to Collaborate. Proc. CHI'01 (EA). ACM Press.  ",
      "doi": "10.1145/634067.634207"
    },
    {
      "text": "Pering, C. (2002). Taming of the ring: context specific social mediation for communication devices. Extended Proceedings of CHI 2002 (pp. 712--713).  ",
      "doi": "10.1145/506443.506560"
    },
    {
      "text": "Pratt, M. G. (2008). Fitting oval pegs into round holes: Tensions in evaluating and publishing qualitative research in top-tier North American journals. Organizational Research Methods, 11(3), 481--509.",
      "doi": ""
    },
    {
      "text": "Schiano, D., Elliott, A., and Bellotti, V. A Look at Tokyo Youth at Leisure: Towards the Design of New Media to Support Leisure Outings. Computer Supported Cooperative Work (CSCW) 16, 1 (2007), 45--73.  ",
      "doi": "10.1007/s10606-007-9046-3"
    },
    {
      "text": "Whittaker, S., Jones, Q., and Terveen, L., Contact management: identifying contacts to support long-term communication, Proc. CSCW 2002.  ",
      "doi": "10.1145/587078.587109"
    },
    {
      "text": "Wiberg, M., & Whittaker, S. (2005). Managing availability: Supporting lightweight negotiations to handle interruptions. ACM Transactions on Computer-Human Interaction (TOCHI), 12(4), 356--387.  ",
      "doi": "10.1145/1121112.1121114"
    },
    {
      "text": "Woodruff, A., and Aoki, P. M., \"How Push-to-Talk Makes Talk Less Pushy.\" Proc. GROUP 2003.  ",
      "doi": "10.1145/958160.958187"
    }
  ]
}