{
  "doi": "10.1145/1978942.1979056",
  "title": "What drives customization?: control or identity?",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "781-790",
  "year": 2011,
  "badges": [],
  "abstract": "Customization - an attribute that lets users take control and make changes to the presentation and functionality of the interface - is becoming a hallmark of today's interactive media devices. What do users experience when they change interface aspects like fonts and colors, skins on mobile phones, speed dial numbers, privacy settings on social networks and different command menus in software? Do they feel in control? Do they see the customized interface as a reflection of who they are? More importantly, is the feeling of being in control a major driver of usage, or does sense of identity - a personal connection with the interface - prove more vital? This paper discusses the psychology of customization, reports an empirical user study designed to explore the relationship between customization, sense of control, and sense of identity, and outlines implications for design of customizable interfaces based on the findings.",
  "authors": [
    {
      "name": "Sampada Marathe",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416600876",
      "orcid": "missing"
    },
    {
      "name": "S. Shyam Sundar",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    }
  ],
  "references": [
    {
      "text": "Ariely, D., &amp;#38; Levav, J. Sequential choice in group settings: Taking the road less traveled and less enjoyed. Journal of Consumer Research 27, 3(2000), 279--290.",
      "doi": ""
    },
    {
      "text": "Ball, A. D., &amp;#38; Tasaki, L. H. The Role and Measurement of Attachment in Consumer Behavior. Journal of Consumer Psychology 1, 2(1992), 155--172.",
      "doi": ""
    },
    {
      "text": "Barkhuus, L., &amp;#38; Dey, A. Is Context-Aware Computing Taking Control away from the User? Three Levels of Interactivity Examined. In Proc. UbiComp2003, ACM Press (2003).",
      "doi": ""
    },
    {
      "text": "Blom, J. Personalization - A taxonomy. Ext. Abstracts CHI 2000, ACM Press (2000), 313--314.  ",
      "doi": "10.1145/633292.633483"
    },
    {
      "text": "Bolin, M., Webber, M., Rha, P., Wilson, T., &amp;#38; Miller, R. C. Automation and Customization of Rendered Web Pages. In Proc. UIST 2005, ACM Press (2005), 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Botti, S., McGill, A. L., &amp;#38; Iyengar, S. S. Preference for control and its effect on evaluation of consumption experience. Advances in Consumer Research, 2003.",
      "doi": ""
    },
    {
      "text": "Bucy, E. P., &amp;#38; Newhagen, J. E. Media access: Social and psychological dimensions of new technology. Mahwah, NJ: Lawrence Elrbaum Associates, 2004.",
      "doi": ""
    },
    {
      "text": "Bunt, A., Conati, C., &amp;#38; McGrenere, J. What role can adaptive support play in an adaptable system? In Proc. IUI 2004, ACM Press (2004), 117--124.  ",
      "doi": "10.1145/964442.964465"
    },
    {
      "text": "Carroll, J., &amp;#38; Rosson, M. B. Paradox of the Active User. In J. Carroll (Ed.), Interfacing Thought: Cognitive Aspects of Human-Computer Interaction (pp. 80--111). Cambridge, MA: MIT Press, 1987. ",
      "doi": "10.5555/28446.28451"
    },
    {
      "text": "Cui, Y., Chipchase, J., &amp;#38; Ichikawa, F. A Cross Culture Study on Phone Carrying and Physical Personalization. In N. Aykin (Ed.), Usability and Internationalization: HCI and Culture (Vol. 4559, pp. 483--492): Springer Berlin / Heidelberg, 2007. ",
      "doi": "10.5555/1769821.1769881"
    },
    {
      "text": "Dix, A. Designing for appropriation. In Proc. BCS HCI Group Conference, 2007. ",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "Dyck, J., Pinelle, D., Brown, B., &amp;#38; Gutwin, C. Learning from games: HCI design innovations in entertainment software. In Proc. Graphics Interface, 2003.",
      "doi": ""
    },
    {
      "text": "Grodal, T. Video games and the pleasures of control. In D. Zillmann &amp;#38; P. Vorderer (Eds.), Media entertainment: The psychology of its appeal (pp. 197--213). Mahwah, NJ: Lawrence Erlbaum Associates, 2000.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. The thing and I: Understanding the relationship between user and product. In M. A. Blythe, A. F. Monk, K. Overbeeke &amp;#38; P. C. Wright (Eds.), Funology: From usability to enjoyment (pp 31--42). Kluwer Academic Publishers. Netherlands, 2003. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "Karapanos, E., Zimmerman, J., Forlizzi, J., &amp;#38; Martens, J.-B. User experience over time: An initial framework. In Proc. CHI 2009. 729--738.  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Kleine, S. S., Kleine III, R. E., &amp;#38; Allen, C. T. How is a possession \"me\" or \"not me\"? Characterizing types and an antecedent of material possession attachment. Journal of Consumer Research 22, 3 (1995), 327--343.",
      "doi": ""
    },
    {
      "text": "Klimmt, C., &amp;#38; Hartmann, T. Effectance, self-efficacy, and the motivation to play video games. In P. Vorderer &amp;#38; J. Bryant (Eds.), Playing video games: Motives, responses, and consequences (pp. 133--145). Mahwah, NJ: Lawrence Erlbaum Associates, 2006.",
      "doi": ""
    },
    {
      "text": "Klug, G. C., &amp;#38; Schell, J. Why people play games: An industry perspective. In P. Vorderer &amp;#38; J. Bryant (Eds.), Playing video games: Motives, responses, and consequences (pp. 91--100). Mahwah, NJ: Lawrence Erlbaum Associates, 2006.",
      "doi": ""
    },
    {
      "text": "Lepper, M. R., &amp;#38; Chabay, R. W. Intrinsic motivation and instruction: Conflicting views on the role of motivational processes in computer-based education. Educational Psychologist 20, 4 (1985), 217--230.",
      "doi": ""
    },
    {
      "text": "Mackay, W. Triggers and barriers to customizing software. In Proc. CHI 1991.  ",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "Madden, M. Four or more: The new demographic: Pew Internet Project, 2010.",
      "doi": ""
    },
    {
      "text": "Madden, M., &amp;#38; Fox, S. Riding the waves of \"Web 2.0\": More than a buzzword, but still not easily defined: Pew Internet Project, 2006.",
      "doi": ""
    },
    {
      "text": "Marathe, S. S. If you build it, they will come - Or will they? Need for uniqueness and need for control as psychological predictors of customization. In Proc. of the Annual Conference of the International Communication Association, ICA (2007).",
      "doi": ""
    },
    {
      "text": "Marathe, S. S. Investigating the psychology of task-based and presentation-based UI customization. Ext. Abstracts, CHI 2009, 3129--3132.  ",
      "doi": "10.1145/1520340.1520444"
    },
    {
      "text": "Marathe, S. S., Sundar, S. S., Bijvank, M. N., van Vugt, H., &amp;#38; Veldhuis, J. Who are these power users anyway? Building a psychological profile. In Proc. of the Annual Conference of the International Communication Association, ICA (2007).",
      "doi": ""
    },
    {
      "text": "McGrenere, J., Baecker, R. M., &amp;#38; Booth, K. S. An Evaluation of a Multiple Interface Design Solution for Bloated Software. In Proc. CHI 2002.  ",
      "doi": "10.1145/503376.503406"
    },
    {
      "text": "Mugge, R., Schoormans, J. &amp;#38; Schifferstein, H. Emotional bonding with personalised products. Journal of Engineering Design 20, 5 (2009), 467--476.",
      "doi": ""
    },
    {
      "text": "Page, S. R., Johnsgard, T. J., Albert, U., &amp;#38; Allen, C. D. (1996). User customization of a word processor. In Proc. CHI 1996, ACM Press (1996).  ",
      "doi": "10.1145/238386.238541"
    },
    {
      "text": "Papacharissi, Z. The presentation of self in virtual life: Characteristics of personal home pages. Journalism and Mass Communication Quarterly 79, 3 (2002), 643--660.",
      "doi": ""
    },
    {
      "text": "Rubin, A. M. Audience activity and media use. Communication Monographs 60, 1 (1993), 98--105.",
      "doi": ""
    },
    {
      "text": "Schau, H. J., &amp;#38; Gilly, M. C. We are what we post? Self-presentation in personal web space. Journal of Consumer Research 30, 3 (2003), 385--404.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B., &amp;#38; Maes, P. Direct manipulation vs. interface agents. Interactions 4, 6 (1997), 42--61.  ",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "Sparks, P., &amp;#38; Shepherd, R. Self-identity and the theory of planned behavior: Assessing the role of identification with \"green consumerism\". Social Psychology Quarterly 55, 1992, 388--399.",
      "doi": ""
    },
    {
      "text": "Stets, J. E., &amp;#38; Burke, P. J. A sociological approach to self and identity. In M. R. Leary &amp;#38; J. P. Tangney (Eds.), Handbook of self and identity (pp. 128--152). New York, NY: The Guilford Press, 2003.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S. Self as source: Agency and customization in interactive media. In E. Konijn, S. Utz, M. Tanis &amp;#38; S. Barnes (Eds.), Mediated interpersonal communication, 2008.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., &amp;#38; Marathe, S. S. Personalization vs. customization: The importance of agency, privacy and power usage. Human Communication Research 36, 2010, 298--322.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., Marathe, S. S., &amp;#38; Kang, H. Beyond tailoring: Customization in health websites. In Proc. of the 95th Annual Convention of the National Communication Association, NCA (2009).",
      "doi": ""
    },
    {
      "text": "Tractinsky, N., &amp;#38; Zmiri, D. Exploring attributes of skins as potential antecedents of emotion in HCI. In P. Fishwick (Ed.), Aesthetic Computing (pp. 405--422): MIT Press, 2006.",
      "doi": ""
    },
    {
      "text": "Venkatesh, V. Determinants of perceived ease of use: Integrating control, intrinsic motivation, and emotion into the technology acceptance model. Information Systems Research 11, 4 (2000), 342--365.  ",
      "doi": "10.1287/isre.11.4.342.11872"
    },
    {
      "text": "Witmer, B. G., &amp;#38; Singer, M. J. Measuring Presence in Virtual Environments: A Presence Questionnaire. Presence 7, 3 (1998), 225--240.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Zimmerman, J. Designing for the self: Making products that help people become the person they desire to be. In Proc. CHI 2009, 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}