{
  "doi": "10.1145/1978942.1979095",
  "title": "Audience behavior around large interactive cylindrical screens",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1021-1030",
  "year": 2011,
  "badges": [],
  "abstract": "Non-planar screens, such as columns, have been a popular means for displaying information for a long time. In con-trast to traditional displays their digital counterparts are mainly flat and rectangular due to current technological constraints. However, we envision bendable displays to be available in the future, which will allow for creating new forms of displays with new properties. In this paper we ex-plore cylindrical displays as a possible form of such novel public displays. We present a prototype and report on a user study, comparing the influence of the display shape on user behavior and user experience between flat and cylindrical displays. The results indicate that people move more in the vicinity of cylindrical displays and that there is no longer a default position when it comes to interaction. As a result, such displays are especially suitable to keep people in motion and to support gesture-like interaction.",
  "authors": [
    {
      "name": "Gilbert Beyer",
      "institution": "University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81484650164/rel-imgonly/gilbertbeyer.jpg",
      "acmid": "81484650164",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "University of Duisburg-Essen, Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    },
    {
      "name": "Jörg Müller",
      "institution": "Deutsche Telekom Laboratories, TU Berlin, Berlin, Germany",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    },
    {
      "name": "Karsten Isakovic",
      "institution": "Fraunhofer FIRST, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100317266",
      "orcid": "missing"
    },
    {
      "name": "Stefan Klose",
      "institution": "Fraunhofer FIRST, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484647505",
      "orcid": "missing"
    },
    {
      "name": "Manuel Schiewe",
      "institution": "Fraunhofer FIRST, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484649928",
      "orcid": "missing"
    },
    {
      "name": "Ivo Haulsen",
      "institution": "Fraunhofer FIRST, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484649853",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benko, H., Wilson, A. D., and Balakrishnan, R. 2008. Sphere: multi-touch interactions on a spherical display. In Proc. UIST '08. ACM, New York, NY, 77--86.  ",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "Benko, H. 2009. Beyond flat surface computing: challenges of depth-aware and curved interfaces. In Proc. ACM Multimedia. MM '09. ACM, New York, NY, 935--944.  ",
      "doi": "10.1145/1631272.1631462"
    },
    {
      "text": "Biehlig, W., Deter, C., Dube, S., Hill, B., Helling, S., Isakovi , K., Klose, S., Schiewe, M. 2004. LaserCave - Some Building Blocks for immersive Screens. VR AR Statustagung, Leipzig.",
      "doi": ""
    },
    {
      "text": "Bly, S. A., Harrison, S. R., and Irwin, S. 1993. Media spaces: bringing people together in a video, audio, and computing en-vironment. Commun. ACM 36, 1 (Jan. 1993), 28--46.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Brignull, H. and Rogers, Y. 2003. Enticing people to interact with large public displays in public spaces. In Proc. INTERACT 03, Z&amp;#252;rich, Switzerland, 17--24.",
      "doi": ""
    },
    {
      "text": "Christian, A. D. and Avery, B. L. Speak Out and Annoy Someone: Experience with Intelligent Kiosks. In Proceeding of CHI 2000, The Hague, Netherlands, 2000.  ",
      "doi": "10.1145/332040.332449"
    },
    {
      "text": "Churchill, E., Nelson, L., Denoue, L., Girgensohn, A. 20030. The Plasma Poster Network: Posting Multimedia Content in Public Places. In Proc. INTERACT 2003, Z&amp;#252;rich, Switzerland.",
      "doi": ""
    },
    {
      "text": "Churchill, E., Nelson, L., Denoue, L. 2003. Multimedia fliers: information sharing with digital community bulletin boards, Communities and technologies, Kluwer, B.V., Deventer, The Netherlands. ",
      "doi": "10.5555/966263.966269"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. 2008. Collaborative inte-raction with volumetric displays. In Proc. CHI '08. ACM, New York, NY, 383--392.  ",
      "doi": "10.1145/1357054.1357118"
    },
    {
      "text": "Grossman, T., Wigdor, D. and Balakrishnan, R. (2004). Multi-Finger Gestural Interaction with 3D Volumetric Displays. In Proc. UIST 2004. pp. 61--70.  ",
      "doi": "10.1145/1029632.1029644"
    },
    {
      "text": "1Hassenzahl, M., Burmester, M., and Koller, F. 2003. AttrakDiff: A questionnaire to measure perceived hedonic and pragmatic quality. In J. Ziegler &amp;#38; G. Szwillus (Eds.), Mensch &amp;#38; Computer 2003. Interaktion in Bewegung, 187--196.",
      "doi": ""
    },
    {
      "text": "Holman, D. and Vertegaal, R. 2008. Organic user interfaces: designing computers in any way, shape, or form. Commun. ACM 51, 6 (Jun. 2008), 48--55.  ",
      "doi": "10.1145/1349026.1349037"
    },
    {
      "text": "Huang, E. M. Koster, A. and Borchers, J. 2008. Overcoming assumptions and uncovering practices: When does the public really look at public displays? In the Proc. Pervasive 2008. Sydney, Australia.  ",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Jacucci, G., Morrison, A., Richard, G.T., Kleimola, J., Peltonen, P., Parisi, L., Laitinen, T. 2010. Worlds of information: designing for engagement at a public multi-touch display. In: Proc. CHI 2010, pp: 2267--2276.  ",
      "doi": "10.1145/1753326.1753669"
    },
    {
      "text": "Krueger, M., Gionfriddo, T., Hinrichsen, K. VIDEOPLACE - an artificial reality. SIGCHI Bull. 16, 4 1985, 35--40.  ",
      "doi": "10.1145/1165385.317463"
    },
    {
      "text": "Landis, J.R., Koch, G.G. 1977. The measurement of observer agreement for categorical data. In Biometrics, 1977, Vol. 33, 159--174.",
      "doi": ""
    },
    {
      "text": "Lee, J. C., Hudson, S. E., and Tse, E. 2008. Foldable interactive displays. In Proc. UIST '08. ACM, New York, NY, 287--290.  ",
      "doi": "10.1145/1449715.1449763"
    },
    {
      "text": "Lin, J., Chen, Y., Ko, J., Kao, H., Chen, W., Tsai, T., Hsu, S., and Hung, Y. 2009. im-Tube: an interactive multi-resolution tubular display. In Proc. ACM Multimedia '09. ACM, New York, 253--260.  ",
      "doi": "10.1145/1631272.1631309"
    },
    {
      "text": "Malik, S., Ranjan, A. and Balakrishnan, R. 2006. Interacting with large displays from a distance with vision-tracked multi-finger gestural input. In Proc. SIGGRAPH '06. NY.  ",
      "doi": "10.1145/1179849.1179856"
    },
    {
      "text": "Manovich, L. 2001. The Language of New Media. Cam-bridge/Mass., MIT Press.",
      "doi": ""
    },
    {
      "text": "2Michelis, D., M&amp;#252;ller, J. 2010. The Audience Funnel: Observations of Gesture Based Interaction with Multiple Large Displays in a City Center. In: International Journal of Human-Computer Interaction.",
      "doi": ""
    },
    {
      "text": "2M&amp;#252;ller, J., Exeler, J., Buzeck, M. and Kr&amp;#252;ger, A. 2009. ReflectiveSigns: Digital Signs that Adapt to Audience Attention. In the Proc. Pervasive 2009, Nara, Japan.  ",
      "doi": "10.1007/978-3-642-01516-8_3"
    },
    {
      "text": "M&amp;#252;ller, J., Wilmsmann, D., Exeler, J., Buzeck, M., Schmidt, A., Jay, T. and Kr&amp;#252;ger, A. 2009. Display Blindness: The effect of Expectations on Attention towards Digital Signage. In the Proc. Pervasive 2009, Nara, Japan.  ",
      "doi": "10.1007/978-3-642-01516-8_1"
    },
    {
      "text": "Peltonen, P., Kurvinen, E., Salovaara, A., Jacucci, G., Ilmonen, T., Evans, J., Oulasvirta, A., and Saarikko, P. 2008. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. In Pro. CHI '08, New York, 2008, 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Pinhanez, C. and Podlaseck, M. 2005. To frame or not to frame: The role and design of frameless displays in ubiquitous applications. In Proc. of Ubiquitous Computing, 340--357.  ",
      "doi": "10.1007/11551201_20"
    },
    {
      "text": "Reitberger, W., Meschtscherjakov, A., Mirlacher, T., Scherndl, T., Huber, H., and Tscheligi, M. 2009. A persuasive interactive mannequin for shop windows. In Proc. Persuasive '09, vol. 350. ACM, New York, NY, 1--8.  ",
      "doi": "10.1145/1541948.1541954"
    },
    {
      "text": "Scott, S. D., Carpendale, M. S. T., and Inkpen, K. M. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proc. CSCW'04, NY, USA. ACM Press, 294--300.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Vogel, D. and Balakrishnan, R.: Interactive public ambient displays: Transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proc. UIST '04, ACM Press, 2004, 137--14.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Wellner, P. 1993. Interacting with paper on the DigitalDesk. Commun. ACM 36, 7 (July 1993), 87--96.  ",
      "doi": "10.1145/159544.159630"
    }
  ]
}