{
  "doi": "10.1145/1978942.1979050",
  "title": "Emotion regulation for frustrating driving contexts",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "749-752",
  "year": 2011,
  "badges": [],
  "abstract": "Driving is a challenging task because of the physical, attentional, and emotional demands. When drivers become frustrated by events their negative emotional state can escalate dangerously. This study examines behavioral and attitudinal effects of cognitively reframing frustrating events. Participants (N = 36) were asked to navigate a challenging driving course that included frustrating events such as long lights and being cut-off. Drivers were randomly assigned to three conditions. After encountering a frustrating event, drivers in a reappraisal-down condition heard voice prompts that reappraised the event in an effort to deflate negative reactions. Drivers in the second group, reappraisal-up, heard voice prompts that brought attention to the negative actions of vehicles and pedestrians. Drivers in a silent condition drove without hearing any voice prompts. Participants in the reappraisal-down condition had better driving behavior and reported less negative emotions than participants in the other conditions.",
  "authors": [
    {
      "name": "Helen Harris",
      "institution": "Stanford University, Stanford, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100116763",
      "orcid": "missing"
    },
    {
      "name": "Clifford Nass",
      "institution": "Stanford University, Stanford, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153283",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baumeister, R.F. and Heatherton, T.F. Self Regulation Failure: An Overview. Psychological Inquiry 7, 1 (1996), 1--15.",
      "doi": ""
    },
    {
      "text": "Galovski, T.E. and Blanchard, E.B. Road Rage: A domain for psychological intervention? Aggression and Violent Behavior 9,2 (2004), 105--127.",
      "doi": ""
    },
    {
      "text": "Gross, J. Antecedent- and Response-Focused Emotion Regulation: Divergent Consequences for Experience, Expression, and Physiology. Journal of Personality and Social Psychology 74, 1 (1998), 224--237.",
      "doi": ""
    },
    {
      "text": "Gross, J. The Emerging Field of Emotion Regulation. An Integrative Review. Review of General Psychology 2,3 (1998), 271--299.",
      "doi": ""
    },
    {
      "text": "Gross, J.J. and Thompson, R.A. Emotion regulation. Conceptual foundations. In J.J. Gross's Handbook of Emotion Regulation, The Guilford Press, (2007), 3--24.",
      "doi": ""
    },
    {
      "text": "Jonsson, I.-M., Zajicek, M., Harris, H. and Nass, C. Thank you, I did not see that: in-car speech based information systems for older adults. Ext. Abstracts CHI 2005, ACM Press, (2005), 1953--1956.  ",
      "doi": "10.1145/1056808.1057065"
    },
    {
      "text": "Nass, C. and Moon, Y. Machines and mindlessness: Social responses to computers. Journal of Social Issues 56, 1 (2000), 81--103.",
      "doi": ""
    },
    {
      "text": "Nass, C. and Brave, S.B. Wired for speech: How voice activates and advances the human-computer relationship. MIT Press, Cambridge, MA, 2005. ",
      "doi": "10.5555/1088925"
    },
    {
      "text": "Nass, C., Jonsson, I.M., Harris, H., Reaves, B., Endo, J., Brave, S. and Takayama, L. Improving Automotive Safety by Pairing Driver Emotion and Car Voice Emotion. In Proc. CHI, ACM Press (2005), 1973--1976.  ",
      "doi": "10.1145/1056808.1057070"
    },
    {
      "text": "Reeves, B. and Nass, C. The Media Equation: How people treat computers, television, and new media like real people and places. Cambridge University Press, New York, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Systems Technology Inc. http://www.stisimdrive.com/, 2010.",
      "doi": ""
    },
    {
      "text": "Wegner, D.M. Ironic processes of mental control. Psychological Review 101, 1 (1994), 34--52..",
      "doi": ""
    }
  ]
}