{
  "doi": "10.1145/1978942.1979078",
  "title": "Homebrew databases: complexities of everyday information management in nonprofit organizations",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "915-924",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Many people manage a complex assortment of digital information in their lives. Volunteer coordinators at nonprofit organizations are no exception; they collectively manage information about millions of volunteers every year. Yet current information management systems are insufficient for their needs. In this paper, we present results of a qualitative study of the information management practices of volunteer coordinators. We identify the resource constraints and the diverse and fluid information needs, stakeholders, and work contexts that motivate their information management strategies. We characterize the assemblages of information systems that volunteer coordinators have created to satisfice their needs as 'homebrew databases.' Finally, we identify additional information management challenges that result from the use of these 'homebrew databases,' highlighting deficiencies in the appropriateness and usability of databases and information management systems, more generally.",
  "tags": [
    "volunteer management.",
    "information management",
    "volunteer coordination",
    "homebrew databases",
    "NPO",
    "nonprofit"
  ],
  "authors": [
    {
      "name": "Amy Voida",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100147309",
      "orcid": "missing"
    },
    {
      "name": "Ellie Harmon",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/do/10.1145/contrib-81328488651/rel-imgonly/me_jtree.jpeg",
      "acmid": "81328488651",
      "orcid": "missing"
    },
    {
      "name": "Ban Al-Ani",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319487517",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barreau, D. and Nardi, B.A. Finding and reminding: File organization from the desktop. ACM SIGCHI Bulletin 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., Smith, I. and Grinter, R.E. Quality versus quantity: E-mail-centric task management and its relation with overload. Human-Computer Interaction 20, 1 (2005), 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Bergman, O., Beyth-Maron, R. and Nachmias, R. The project fragmentation problem in personal information management. Proc. CHI 2006, ACM Press (2006), 271--274.  ",
      "doi": "10.1145/1124772.1124813"
    },
    {
      "text": "Boardman, R. and Sasse, M.A. \"Stuff goes into the computer and doesn't come out\": A cross-tool study of personal information management. Proc. CHI 2004, ACM Press (2004), 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Brudney, J.L. Designing and managing volunteer programs. In R.D. Herman (Ed.), The Jossey-Bass Handbook of Nonprofit Leadership and Management. Jossey-Bass, San Francisco (1994), 279--302.",
      "doi": ""
    },
    {
      "text": "Bureau of Labor Statistics, US Department of Labor. Volunteering in the United States-2009. http://www.bls.gov/news.release/pdf/volun.pdf.",
      "doi": ""
    },
    {
      "text": "Burt, E. and Taylor, J.A. Information and communication technologies: Reshaping voluntary organizations? Nonprofit Management &amp;#38; Leadership 11, 2 (2000), 131--143.",
      "doi": ""
    },
    {
      "text": "Corbin, J. and Strauss, A. Basics of qualitative research: Techniques and procedures for developing grounded theory (3rd ed.) Sage Publications, Los Angeles, 2008.",
      "doi": ""
    },
    {
      "text": "Date, C.J. Database usability. ACM SIGMOD Record 13, 4 (1983), 1.  ",
      "doi": "10.1145/971695.582194"
    },
    {
      "text": "Goecks, J., Voida, A., Voida, S. and Mynatt, E.D. Charitable technologies: Opportunities for collaborative computing in nonprofit fundraising. Proc. CSCW 2008, ACM Press (2008), 689--698.  ",
      "doi": "10.1145/1460563.1460669"
    },
    {
      "text": "Jagadish, H.V., Chapman, A., Elkiss, A., Jayapandian, M., Li, Y., Nandi, A. and Yu, C. Making database systems usable. Proc. SIGMOD 2007, ACM Press (2007), 13--24.  ",
      "doi": "10.1145/1247480.1247483"
    },
    {
      "text": "Kidd, A. The marks are on the knowledge worker. Proc. CHI 1994, ACM Press (1994), 186--191.  ",
      "doi": "10.1145/191666.191740"
    },
    {
      "text": "Le Dantec, C.A. and Edwards, W.K. Across boundaries of influence and accountability: The multiple scales of public sector information systems. Proc. CHI 2010, ACM Press (2010), 113--122.  ",
      "doi": "10.1145/1753326.1753345"
    },
    {
      "text": "Le Dantec, C.A. and Edwards, W.K. The view from the trenches: Organization, power, and technology at two nonprofit homeless outreach centers. Proc. CSCW 2008, ACM Press (2008), 589--598.  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "Mackay, W.E. Is paper safer? The role of paper flight strips in air traffic control. ACM Trans. Computer-Human Interaction 6, 4 (1999), 311--340.  ",
      "doi": "10.1145/331490.331491"
    },
    {
      "text": "McPhail, B., Constantino, T., Bruckmann, D., Barclay, R. and Clement, A. CAVEAT exemplar: Participatory design in a non-profit volunteer organisation. Computer Supported Cooperative Work 7, 3--4 (1998), 223--241.  ",
      "doi": "10.1023/A%3A1008631020266"
    },
    {
      "text": "Merkel, C., Farooq, U., Xiao, L., Ganoe, C., Rosson, M.B. and Carroll, J.M. Managing technology use and learning in nonprofit community organizations: Methodological challenges and opportunities. Proc. CHIMIT 2007, ACM Press (2007), Article 8.  ",
      "doi": "10.1145/1234772.1234783"
    },
    {
      "text": "National Center for Charitable Statistics. National taxonomy of exempt entities. http://nccs.urban.org/ classification/NTEE.cf.",
      "doi": ""
    },
    {
      "text": "Palen, L. Social, individual and technological issues for groupware calendar systems. Proc. CHI 1999, ACM Press (1999), 17--24.  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Sease, R. and McDonald, D.W. Musical fingerprints: Collaboration around home media collections. Proc. GROUP 2009, ACM Press (2009), 331--340.  ",
      "doi": "10.1145/1531674.1531724"
    },
    {
      "text": "Sellen, A.J. and Harper, R.H.R. The myth of the paperless office. MIT Press, Cambridge, MA, 2002. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Shneiderman, B. Improving the human factors aspect of database interactions. ACM Trans. Database Systems 3, 4 (1978), 417--439.  ",
      "doi": "10.1145/320289.320295"
    },
    {
      "text": "Stoll, J., Edwards, W.K. and Mynatt, E.D. Interorganizational coordination and awareness in a nonprofit ecosystem. Proc. CSCW 2010, ACM Press (2010), 51--60.  ",
      "doi": "10.1145/1718918.1718930"
    },
    {
      "text": "Urban Institute. Volunteer management capacity in America's charities and congregations: A briefing report, 2004. http://www.urban.org/publications/410963.html.",
      "doi": ""
    },
    {
      "text": "Whittaker, S. and Sidner, C. Email overload: Exploring personal information management of email. Proc. CHI 1996, ACM Press (1996), 276--283..  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}