{
  "doi": "10.1145/1978942.1979248",
  "title": "User-centred multimodal reminders for assistive living",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2105-2114",
  "year": 2011,
  "badges": [],
  "abstract": "While there has been a lot of research on the usability of reminders and alarms in the work context, the home has been somewhat neglected despite the importance of reminder systems for telecare and assistive living systems. We conducted a comprehensive mixed-methods study into the requirements for useable and acceptable reminders in the home. The study consisted of a questionnaire (N=379), 6 focus groups, and 7 home tour interviews. Our results highlight the need for highly flexible and contextualized multimodal and multi-device reminder solutions that build on existing successful strategies for remembering in and around the home. We suggest that developers of home care reminder systems should design for diversity, context, priorities, autonomy, shared spaces, and optimal care.",
  "authors": [
    {
      "name": "Marilyn Rose McGee-Lennon",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585418",
      "orcid": "missing"
    },
    {
      "name": "Maria Klara Wolters",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81100428841/rel-imgonly/img_3457.jpg",
      "acmid": "81100428841",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "Arking, R. Biology of Aging. Oxford University Press, New York, NY, 3rd edition, 2005.",
      "doi": ""
    },
    {
      "text": "Biem, H. J., Turnell, R. W. and D'Arcy, C. Computer telephony: automated calls for medical care. Clin Invest Med, 26 (2003), 259--268.",
      "doi": ""
    },
    {
      "text": "Clark, J. S. and McGee-Lennon, M. R. A stakeholder-centred exploration of the current barriers to the uptake of home care technology in the UK. Journal of Assistive Technology, In Press (2011).",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Roessler, P., Shelton, B. E., LaMarca, A., Schilit, B., and Bly, S. Technology for Care Networks of Elders. Pervasive Computing 3, 2 (2004), 22--29.  ",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Department of Health. National Service Framework for Older People, London: The Stationery Office (2001).",
      "doi": ""
    },
    {
      "text": "Department of Health. Building Telecare in England. London: The Stationery Office (2005).",
      "doi": ""
    },
    {
      "text": "Deshpande, A. D., Harris-Hayes, M. and Schootman, M. Epidemiology of diabetes and diabetes-related complications. Phys Therapy, 88, 11 (2008), 1254--1264.",
      "doi": ""
    },
    {
      "text": "Garde, S. and Knaup, P. Requirements engineering in health care: the example of chemotherapy planning in pediatric oncology, Requirements Engineering 11 (2006), 265--278.  ",
      "doi": "10.1007/s00766-006-0029-6"
    },
    {
      "text": "House of Lords Science and Technology Committee. Ageing: Scientific aspects. The Stationery Office, London, UK (2005).",
      "doi": ""
    },
    {
      "text": "Intille, S. S. A New Research Challenge: Persuasive Technology to Motivate Healthy Aging. IEEE Trans Inf Technol Biomedicine, 8, 3 (2004), 235--237.  ",
      "doi": "10.1109/TITB.2004.835531"
    },
    {
      "text": "Leonardi, C., Mennecozzi, C., Not, E., Pianesi, F., Zancanaro, M., Gennai, F. and Cristoforetti, A. Knocking on Elders' Door: Investigating the Functional and Emotional Geography of Their Domestic Space. In Proc. CHI 2009, ACM Press (2009), 1703--1712.  ",
      "doi": "10.1145/1518701.1518963"
    },
    {
      "text": "Ludford, P. J., Frankowski, D., Reily, K., Wilms, K., &amp;#38; Terveen, L. Because I carry my cell phone anyway. In Proc. CHI 2006, ACM Press (2006), 889--898.  ",
      "doi": "10.1145/1124772.1124903"
    },
    {
      "text": "Mamykina, L., Miller, A. D., Mynatt, E. D., and Greenblatt, D. Constructing identities through storytelling in diabetes management. In Proc. CHI 2010 ACM Press (2010), 1203--1212.  ",
      "doi": "10.1145/1753326.1753507"
    },
    {
      "text": "McBryan, T. and Gray, P. A Model-Based Approach to Supporting Configuration in Ubiquitous Systems, In Proc. International Conference on Design, Specification and Verification of Interactive Systems, LNCS 5136, Springer (2008), 167--180.  ",
      "doi": "10.1007/978-3-540-70569-7_17"
    },
    {
      "text": "McGee-Lennon, M. R. and Gray, P. Including Stakeholders in the Design of Home Care Systems: Identification and Categorisation of Complex User Requirements. In Proc. INCLUDE (2007).",
      "doi": ""
    },
    {
      "text": "McGee-Lennon, M. R., Wolters, M. and McBryan, T. Auditory Reminders in the Home. In Proc. ICAD 2007.",
      "doi": ""
    },
    {
      "text": "McGee-Lennon, M. R. Requirements engineering for home care technology. In Proc. CHI 2008, ACM Press (2008), 1439--1442.  ",
      "doi": "10.1145/1357054.1357279"
    },
    {
      "text": "McGee-Lennon, M. R., Wolters, M. K. and Brewster, S. Designing Reminders for the Home - The Role of Home Tours. Proc. INCLUDE (2011), In Press.",
      "doi": ""
    },
    {
      "text": "Morris, M., Lundell, J., Dishman, E., and Needham, B.. New Perspectives on Ubiquitous Computing from Ethnographic Study of Elders with Cognitive Decline Proc. UbiComp (2003), 227--242.",
      "doi": ""
    },
    {
      "text": "Mynatt, E. D., Melenhorst, A. S., Fisk, A. D., and Rogers, W. A. Aware technologies for aging in place: understanding user needs and attitudes. IEEE Pervasive Computing (2004), 3, 36--41.  ",
      "doi": "10.1109/MPRV.2004.1316816"
    },
    {
      "text": "Ofcom UK. Digital lifestyles - adults aged 60 and over, Report (2009).",
      "doi": ""
    },
    {
      "text": "Persad, U., Langdon, P. and Clarkson, J. Characterising user capabilities to support inclusive design evaluation. Universal Access in the Information Society, 6, 2 (2007), 119--153.  ",
      "doi": "10.1007/s10209-007-0083-y"
    },
    {
      "text": "Pollack, M. Intelligent Technology for an Aging Population: The Use of AI to Assist Elders with Cognitive Impairment. AI Magazine 26 (2005), 9--24.",
      "doi": ""
    },
    {
      "text": "Ritchie, J. and Lewis, J. Qualitative Research Methods. Sage, London UK, 2003.",
      "doi": ""
    },
    {
      "text": "SENSE for deafblind people UK. A sense of urgency, Report, 2010.",
      "doi": ""
    },
    {
      "text": "Stanton, N., ed. Human factors in alarm design, Taylor and Francis, London UK, 1994. ",
      "doi": "10.5555/212905"
    },
    {
      "text": "S. Waller, P. Langdon, and P. Clarkson. Using disability data to estimate design exclusion. Univ Acc Inf Soc, 9:195--207, 2010.  ",
      "doi": "10.1007/s10209-009-0168-x"
    },
    {
      "text": "Watson, M. and Sanderson, P. Sonification Supports Eyes-Free Respiratory Monitoring and Task Time-Sharing. Human Factors 46(3), 497--517, 2004.",
      "doi": ""
    },
    {
      "text": "Wolters, M. K. and McGee-Lennon, M. R. Designing usable and acceptable reminders for the home. Proc. AAATE, 2010.",
      "doi": ""
    }
  ]
}