{
  "doi": "10.1145/1978942.1979100",
  "title": "Understanding interaction design practices",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1061-1070",
  "year": 2011,
  "badges": [],
  "abstract": "There is an undesirable gap between HCI research aimed at influencing interaction design practice and the practitioners in question. To close this gap, we advocate a theoretical and methodological focus on the day-to-day, lived experience of designers. To date, this type of theory-generative, experientially oriented research has focused on the users of technologies, not the designers. In contrast, we propose that HCI researchers turn their attention to producing theories of interaction design practice that resonate with practitioners themselves. In part one of this paper, we describe the mismatch between HCI research and interaction design practices. Then we present vignettes from an observational study of commercial design practice to illustrate the issues at hand. In part two, we discuss methodological and theoretical changes in research practice that might support the goal of integrating HCI research with interaction design practices. We then discuss current research methods and theories to identify changes that might enlarge our view on practice. In part three, we elaborate on our theoretically minded agenda and a kind of ideal-type theory.",
  "tags": [
    "theory",
    "practice",
    "interaction design"
  ],
  "authors": [
    {
      "name": "Elizabeth Goodman",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578588",
      "orcid": "missing"
    },
    {
      "name": "Erik Stolterman",
      "institution": "Indiana University, Bloomington, Indiana, USA",
      "img": "/do/10.1145/contrib-81100118833/rel-imgonly/interactions_about_06.png",
      "acmid": "81100118833",
      "orcid": "missing"
    },
    {
      "name": "Ron Wakkary",
      "institution": "Simon Fraser University, Surrey, British Columbia, Canada",
      "img": "/do/10.1145/contrib-81100283877/rel-imgonly/img_3637_400x400.jpeg",
      "acmid": "81100283877",
      "orcid": "0000-0003-2073-715X"
    }
  ],
  "references": [
    {
      "text": "Arnowitz, J. and Dykstra-Erickson, E. 2005. CHI and the practitioner dilemma. interactions 12(4), 5--9.  ",
      "doi": "10.1145/1070960.1070964"
    },
    {
      "text": "Bellotti, V. 1988. Implications of current design practice for the use of HCI techniques. In Proc. 4th Conference of the British Computer Society on People and Computers. Cambridge UP, 13--34. ",
      "doi": "10.5555/54675.54677"
    },
    {
      "text": "Bucciarelli, L. 1994. Designing engineers. The MIT Press. ",
      "doi": "10.5555/202737"
    },
    {
      "text": "Carroll, John M. 2009. Human Computer Interaction (HCI). In Interaction Design Encyclopedia. Retrieved on June 6, 2010 from http://www.interaction-design.org/encyclopedia/human_computer_interaction_hci.html.",
      "doi": ""
    },
    {
      "text": "Clemmensen, T. and Leisner, P. 2002. Community knowledge in an emerging online professional community: the interest of theory among Danish usability professionals. IRIS'25.",
      "doi": ""
    },
    {
      "text": "Cross, N. 2006. Designerly ways of knowing. Springer.",
      "doi": ""
    },
    {
      "text": "Day, C. 2000. Effective Leadership and Reflective Practice. Reflective Practice: International and Multidisciplinary Perspectives, 1(1), 113--127.",
      "doi": ""
    },
    {
      "text": "Diggins, T. and Tolmie, P. 2003. The 'adequate' design of ethnographic outputs for practice: some explorations of the characteristics of design resources. Personal Ubiquitous Comput., 7(3-4) 147--158.  ",
      "doi": "10.1007/s00779-003-0226-y"
    },
    {
      "text": "Dow, S., Saponas, T. S., Li, Y., and Landay, J. A. 2006. External representations in ubiquitous computing design and the implications for design tools. Proc DIS '06, ACM Press, 241--250.  ",
      "doi": "10.1145/1142405.1142443"
    },
    {
      "text": "Ehn, P. 1990. Work-Oriented Design of Computer Artifacts. Lawrence Erlbaum Associates. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Fallman, D. 2008. The Interaction Design Research Triangle of Design Practice, Design Studies, and Design Exploration. Design Issues. 24(3) 4--18.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Beaver, J. and Benford, S. 2003. Ambiguity as a resource for design. In Proc CHI'03, ACM Press, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Gaver, W. 2006. The video window: my life with a ludic system. Pers. and Ubiq. Computing. 10(2): 60--65.  ",
      "doi": "10.1007/s00779-005-0002-2"
    },
    {
      "text": "Gaver, W., et al. 2010. The prayer companion: openness and specificity, materiality and spirituality. In Proc. CHI '10. ACM Press, 2055--2064.  ",
      "doi": "10.1145/1753326.1753640"
    },
    {
      "text": "Green, B. 2009. Introduction: Understanding and researching professional practice, in Green, B. (ed). Understanding and researching professional practice. Sense Publishers.",
      "doi": ""
    },
    {
      "text": "Green, T. R. G., Davies, S. P., and Gilmore, D. J. 1996. Delivering Cognitive Psychology to HCI: The Problems of Common Language and of Knowledge Transfer. Interacting with Computers 8(1), 89--111.",
      "doi": ""
    },
    {
      "text": "Greenbaum, J. and Kyng, M. 1991. Design at work: Cooperative Design of Computer Systems. Lawrence Erlbaum Associates. ",
      "doi": "10.5555/574738"
    },
    {
      "text": "Hewett et al. 1996. ACM SIGCHI Curricula for Human-Computer Interaction. Retrieved on September 21, 2010 from http://old.sigchi.org/cdg/cdg2.html.",
      "doi": ""
    },
    {
      "text": "Humphreys, M. &amp;#38; Hyland, T. (2002). Theory, Practice and Performance in Teaching: Professionalism, intuition, and jazz. Educational Studies, 28(1), 5--15.",
      "doi": ""
    },
    {
      "text": "Kelley, D. and Hartfield, B. 1996. The Designer's Stance. In Bringing Design to Software. Ed. Terry Winograd. Addison-Wesley. Retrieved on September 21 from http://hci.stanford.edu/bds/8-kelley.html.  ",
      "doi": "10.1145/229868.230042"
    },
    {
      "text": "Kaptelinin, V. and Nardi, B. A. 2006. Acting with Technology: Activity Theory and Interaction Design. The MIT Press. ",
      "doi": "10.5555/1196435"
    },
    {
      "text": "Kimbell, L. 2009. Beyond design thinking: Design-as-practice and designs-in practice. Paper presented at the CRESC Conference, Manchester, September 2009.",
      "doi": ""
    },
    {
      "text": "Latour, B. 2008. A Cautious Prometheus? A Few Steps Toward a Philosophy of Design. Keynote lecture for the Design History Society. Falmouth, Cornwall.",
      "doi": ""
    },
    {
      "text": "L&amp;#246;wgren, J. and Stolterman, E. 2007. Thoughtful Interaction Design: A Design Perspective on Information Technology. The MIT Press. ",
      "doi": "10.5555/1206469"
    },
    {
      "text": "Mackay, H. and Gillespie, G. 1992. Extending the Social Shaping of Technology Approach: Ideology and Appropriation. Social Studies of Science 22(4), 685--716.",
      "doi": ""
    },
    {
      "text": "Mao, J., et al. 2005. The state of user-centered design practice. Commun. ACM 48(3), 105--109.  ",
      "doi": "10.1145/1047671.1047677"
    },
    {
      "text": "McCarthy, J. and Wright, P. 2007. Technology as Experience. The MIT Press. ",
      "doi": "10.5555/1554627"
    },
    {
      "text": "Moggridge, B. Designing Interactions. 2007. The MIT Press. ",
      "doi": "10.5555/1196347"
    },
    {
      "text": "Moustakas, C.E. 14. Phenomenological research methods. Sage.",
      "doi": ""
    },
    {
      "text": "Nelson, H. G. and Stolterman, E. 2002. The Design Way: Intentional Change in an Unpredictable World : Foundations and Fundamentals of Design Competence. Educational Technology Publications. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Newman, M. W. and Landay, J. A. 2000. Sitemaps, Storyboards, and Specifications: A Sketch of Web Site Design Practice. Proc. DIS 2000. ACM Press, 263--274.  ",
      "doi": "10.1145/347642.347758"
    },
    {
      "text": "Preece, J; Rogers, Y. and Sharp, H. eds. 2002. Interaction Design: Beyond Human-Computer Interaction. John Wiley. ",
      "doi": "10.5555/560143"
    },
    {
      "text": "Risatti, H. 2007. A theory of craft: function and aesthetic expression. UNC Press Books.",
      "doi": ""
    },
    {
      "text": "Rogers, Y. 2004. New Theoretical approaches for Human-Computer Interaction. ARIST. 38, 87--143.",
      "doi": ""
    },
    {
      "text": "Rosson, M. B., Kellogg, W., &amp;#38; Maass, S. 1988. The designer as user: building requirements for design tools from design practice. Commun. ACM, 31(11), 1288--1298.  ",
      "doi": "10.1145/50087.50090"
    },
    {
      "text": "Saffer, D. 2006. Designing for Interaction: Creating Smart Applications and Clever Devices. Peachpit Press. ",
      "doi": "10.5555/1199853"
    },
    {
      "text": "Schatzki, T. R. 2001. Practice theory. In The practice turn in contemporary theory. Theodore R. Schatzki, Karin Knorr Cetina, and Eike von Savigny (eds.), 10--23. Routledge.",
      "doi": ""
    },
    {
      "text": "Sch&amp;#246;n, D. A. 1983. The reflective practitioner: how professionals think in action. Basic Books.",
      "doi": ""
    },
    {
      "text": "Sch&amp;#246;n, D. 1987. Educating the Reflective Practitioner. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Schuler, D. and Namioka, A. 1993. Participatory Design: Principles and Practices. Lawrence Erlbaum Associates. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Sengers, P. and Gaver, B. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proc DIS '06, ACM Press, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Shneiderman, B. 2002. Leonardo's laptop : human needs and the new computing technologies. The MIT Press. ",
      "doi": "10.5555/515240"
    },
    {
      "text": "Stolterman, E. 2008. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design 2(1), 55--65.",
      "doi": ""
    },
    {
      "text": "Suchman, L. 1994. Working relations of technology production and use. Computer Supported Cooperative Work 2(1-2), 21--39.",
      "doi": ""
    },
    {
      "text": "Wakkary, R. 2005. Framing Complexity, Design and Experience: A Reflective Analysis. Digital Creativity. 16(2), 65--78.",
      "doi": ""
    },
    {
      "text": "Wolf, T. V., Rode, J. A., Sussman, J., and Kellogg, W. A. 2006. Dispelling \"design\" as the black art of CHI. In Proc. CHI '06. ACM Press, 521--530.  ",
      "doi": "10.1145/1124772.1124853"
    },
    {
      "text": "Vredenburg, K., Mao, J., Smith, P. W., and Carey, T. 2002. A survey of user-centered design practice. In Proc. CHI '02. ACM Press, 471--478.  ",
      "doi": "10.1145/503376.503460"
    },
    {
      "text": "Zimmerman, J., Forlizzi, J., and Evenson, S. 2007. Research through design as a method for interaction design research in HCI. In Proc CHI '07, ACM Press, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}