{
  "doi": "10.1145/1978942.1979417",
  "title": "ReadN'Karaoke: visualizing prosody in children's books for expressive oral reading",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3203-3206",
  "year": 2011,
  "badges": [],
  "abstract": "We present a method for displaying prosody, the melody of speech, to aid beginning readers with fluent oral reading. We build on proven auditory techniques by manipulating and augmenting text in children's stories. The acoustic properties of a fluent recording are used to construct visualizations of pitch, loudness and length variations in read samples aligned with text. Our initial approach was to directly manipulate text, which was tested on ten children who showed significant increases in pitch modulation with manipulated text but reported difficulty with word recognition. This motivated designing the augmented text renderings, which display prosodic cues layered with text. Manipulated and augmented texts were compared with two beginning readers. Children showed similar prosodic gains with both versions and reported greater satisfaction with augmented pitch cues. Visual prosodic cues show promise for improving reading fluency in early readers and may have applications for disability education and second language learning.",
  "authors": [
    {
      "name": "Rupal Patel",
      "institution": "Northeastern University, Boston, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319498816",
      "orcid": "missing"
    },
    {
      "name": "William Furr",
      "institution": "Northeastern University, Boston, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655028",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blevins, W. Building fluency: Lessons and strategies for reading success. Scholastic Inc. New York, NY, USA, 2001.",
      "doi": ""
    },
    {
      "text": "Boersma, P. & Weenink, D. Praat: doing phonetics by computer, Version 5.1.43. http://www.praat.org/.",
      "doi": ""
    },
    {
      "text": "Bolinger, D. Intonation and its uses: Melody in grammar and discourse, Stanford University Press, Stanford, CA, USA, 1989.",
      "doi": ""
    },
    {
      "text": "Brewster, K. The assessment of prosody. In K. Grundy (Ed.). Linguistics in Clinical Practice. Taylor & Francis, London, UK, 1989.",
      "doi": ""
    },
    {
      "text": "Chafe, W. Merging the simple view of reading with reading theory. Journal of Reading Behavior, 25 (1988), 439--455.",
      "doi": ""
    },
    {
      "text": "Cleveland, W. S. \"Robust Locally Weighted Regression and Smoothing Scatterplots,\" Journal of the American Statistical Association, 74 (1979), 829--836.",
      "doi": ""
    },
    {
      "text": "Cutler A, Dahan, D., and van Donselaar, W. Prosody in the comprehension of language: a literature review. Language and Speech, 40, 2 (1997), 141--201.",
      "doi": ""
    },
    {
      "text": "Ford, S., Forlizzi, J., and Ishizaki, S. Kinetic typography: issues in time-based presentation of text. Ext. Abstracts CHI 1997, ACM Press (1997), 269--270.  ",
      "doi": "10.1145/1120212.1120387"
    },
    {
      "text": "Hudson, R. F., Lane, H. B., & Pullen, P. C. Reading fluency assessment and instruction: what, why, and how? The Reading Teacher, 58, 8 (2005), 702--714.",
      "doi": ""
    },
    {
      "text": "Kuhn M., Stahl S., Fluency: A review of developmental and remedial practices, Journal of Educational Psychology, 95 (2003), 3--21.",
      "doi": ""
    },
    {
      "text": "Lehiste, I. Suprasegmentals. MIT Press, Cambridge, MA, USA, 1970.",
      "doi": ""
    },
    {
      "text": "Levasseur, V. M., Macaruso, P., Palumbo, L. C., Shankweiler, D. Syntactically cued text facilitates oral reading fluency in developing readers. Applied Psycholinguistics, 27 (2006) 423--445.",
      "doi": ""
    },
    {
      "text": "Miller, J. & Schwanenflugel, P. J. Prosody of syntactically complex sentences in the oral reading of young children. Journal of Educational Psychology, 98, 4 (2006), 839--843.",
      "doi": ""
    },
    {
      "text": "National Assessment of Educational Progress (NAEP). Listening to Children Read Aloud: Oral Fluency. 1995. http://nces.ed.gov/pubs95/web/95762.asp.",
      "doi": ""
    },
    {
      "text": "National Institute of Child Health and Human Development. Report of the National Reading Panel. Teaching Children to Read: an Evidence-based Assessment of the Scientific Research Literature on Reading and its Implications for Reading Instruction. NIH Publication No. 00-4769. US Government Printing Office, Washington, D.C., USA, 2000.",
      "doi": ""
    },
    {
      "text": "Omniglot: writing systems and languages of the world. http://www.omniglot.com/index.htm.",
      "doi": ""
    },
    {
      "text": "O'Shea, L. J., Sindelar, P. T. The effects of segmenting written discourse on the reading comprehension of low- and high-performance readers. Reading Research Quarterly, 18 (1983), 458--465.",
      "doi": ""
    },
    {
      "text": "Rasinski, T. V. Effects of repeated reading and listening while reading on reading fluency. Journal of Educational Research, 83 (1990), 147--150.",
      "doi": ""
    },
    {
      "text": "Read Naturally, The Read Naturally Strategy. http://www.readnaturally.com/approach/default.htm.",
      "doi": ""
    },
    {
      "text": "Readers Theater, Readers Theater Scripts and Plays. http://www.teachingheart.net/readerstheater.htm.",
      "doi": ""
    },
    {
      "text": "Rosenberger, T. and MacNeil, R. L. Prosodic font: translating speech into graphics. Ext Abstracts CHI 1999, ACM Press (1999), 252--253.  ",
      "doi": "10.1145/632716.632872"
    },
    {
      "text": "Samuels, S. J. Decoding and automaticity: helping poor readers become automatic at word recognition. The Reading Teacher, 41 (1988), 756--760.",
      "doi": ""
    },
    {
      "text": "Schreiber, P. A. On the acquisition of reading fluency. Journal of Reading Behavior, 7 (1980), 177--186.",
      "doi": ""
    }
  ]
}