{
  "doi": "10.1145/1978942.1979376",
  "title": "Active reading and its discontents: the situations, problems and ideas of readers",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2927-2936",
  "year": 2011,
  "badges": [],
  "abstract": "The increasing popularity of personal reading devices raises the question of how best to support so-called active reading, which involves acts like annotation, note taking, etc. Prior research addressed this question by observing the active reading process, and identifying disparities between computers and paper as a reading medium. We extend this research by 1) investigating the problems that readers experience in their real world tasks, 2) inquiring about their requirements for an ideal reading technology, and 3) updating earlier studies of naturalistic reading behavior, which are several years old now. We present here the results of our investigation, which included a diary study, interviews, and participatory design workshops.",
  "authors": [
    {
      "name": "Craig S. Tashman",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498515",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adler, A., Gujar, A., Harrison, B. L., O'Hara, K. and Sellen, A. A diary study of work-related reading: design implications for digital reading devices CHI, ACM Press, 1998.  ",
      "doi": "10.1145/274644.274679"
    },
    {
      "text": "Askwall, S. Computer supported reading vs. reading text on paper: a comparison of two reading situations. International Journal of Man Machine Studies, 22. 425--439.",
      "doi": ""
    },
    {
      "text": "Costabile, M. F., Patern&amp;#242;, F., Bae, S., Badi, R., Meintanis, K., Moore, J. M., Zacchi, A., Hsieh, H., Marshall, C. C. and Shipman, F. M. Effects of Display Configurations on Document Triage. in Human-Computer Interaction - INTERACT 2005, Springer Berlin / Heidelberg, 2005, 130--143.  ",
      "doi": "10.1007/11555261_14"
    },
    {
      "text": "Dillon, A., Richardson, J. and McKnight, C. Human factors of journal usage and design of electronic texts. Interacting with computers, 1. 183--189.",
      "doi": ""
    },
    {
      "text": "Golovchinsky, G. Reading in the office. Proceeding of the 2008 ACM workshop on Research advances in large digital book repositories, ACM, Napa Valley, CA, USA, 2008.  ",
      "doi": "10.1145/1458412.1458420"
    },
    {
      "text": "Laxer, M. With e-books Still Evolving, Professors Remain Unsure of the Advantages, Northwestern University, Chicago, IL, 2010.",
      "doi": ""
    },
    {
      "text": "Liao, C., Guimbretiere, F., Hinckley, K. and Hollan, J. Papiercraft: A gesture-based command system for interactive paper. ACM Trans. Comput.-Hum. Interact., 14 (4). 1--27.  ",
      "doi": "10.1145/1314683.1314686"
    },
    {
      "text": "Marshall, C. C. Annotation: from paper books to the digital library Proceedings of the second ACM international conference on Digital libraries, ACM, Philadelphia, Pennsylvania, United States, 1997.  ",
      "doi": "10.1145/263690.263806"
    },
    {
      "text": "Marshall, C. C. and Bly, S. Turning the page on navigation Proceedings of the 5th ACM/IEEE-CS joint conference on Digital libraries, ACM, Denver, CO, USA, 2005.  ",
      "doi": "10.1145/1065385.1065438"
    },
    {
      "text": "Marshall, C. C. and Brush, A. J. B. Exploring the relationship between personal and public annotations Proceedings of the 4th ACM/IEEE-CS joint conference on Digital libraries, ACM, Tuscon, AZ, USA, 2004.  ",
      "doi": "10.1145/996350.996432"
    },
    {
      "text": "Marshall, C. C., Price, M. N., Golovchinsky, G. and Schilit, B. N. Designing e-books for legal research Proc. of ACM/IEEE conf. on Digital libraries, ACM, Roanoke, VA, USA, 2001.  ",
      "doi": "10.1145/379437.379445"
    },
    {
      "text": "Microsystems, S. Starfire, 1992.",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Brush, A. J. B. and Meyers, B. R., Reading Revisited: Evaluating the Usability of Digital Display Surfaces for Active Reading Tasks. in Tabletop, (2007), 79--86.",
      "doi": ""
    },
    {
      "text": "Murray, T., Applying Text Comprehension and Active Reading Principles to Adaptive Hyperbooks. in Cognitive Science, (Boston, MA, 2003).",
      "doi": ""
    },
    {
      "text": "Muter, P., Latremouille, S. A., Treunit, W. C. and Beam, P. Extended reading of continuous text on television screens. Human Factors, 24. 501--508.",
      "doi": ""
    },
    {
      "text": "O'Hara, K. Towards a Typology of Reading Goals RXRC Affordances of Paper Project, Rank Xerox Research Center, Cambridge, UK, 1996.",
      "doi": ""
    },
    {
      "text": "O'Hara, K. and Sellen, A. A comparison of reading paper and on-line documents CHI 1997, ACM, 1997.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "O'Hara, K., Smith, F., Newman, W. and Sellen, A. Student readers' use of library documents: implications for library technologies CHI 1998, ACM Press, 1998.  ",
      "doi": "10.1145/274644.274678"
    },
    {
      "text": "Pearson, J., Buchanan, G. and Thimbleby, H. Improving annotations in digital documents European conference on Research and advanced technology for digital libraries, Springer-Verlag, Corfu, Greece, 2009. ",
      "doi": "10.5555/1812799.1812863"
    },
    {
      "text": "Qayyum, M. A. Capturing the online academic reading process. Inf. Process. Manage., 44 (2). 581--595.  ",
      "doi": "10.1016/j.ipm.2007.05.005"
    },
    {
      "text": "Renear, A., DeRose, S., Mylonas, E. and Dam, A. v. An Outline for a Functional Taxonomy of Annotation, Presented at Microsoft Research, Redmond, WA, 1999.",
      "doi": ""
    },
    {
      "text": "Schilit, B.N., Golovchinsky, G. and Price, M. N. Beyond paper: supporting active reading with free form digital ink annotations CHI 1998, ACM, 1998.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Sellen, A. and Harper, R. Paper as an analytic resource for the design of new technologies CHI 1997, ACM, 1997.  ",
      "doi": "10.1145/258549.258780"
    },
    {
      "text": "Tashman, C. and Edwards, W. K., LiquidText: A Flexible, Multitouch Environment to Support Active Reading. in CHI 2011, (Vancouver, Canada, 2011), ACM.  ",
      "doi": "10.1145/1978942.1979430"
    },
    {
      "text": "Wahba, P. E-readers gain traction, spur sales: poll, Reuters, 2010.",
      "doi": ""
    },
    {
      "text": "Wilcox, L. D., Schilit, B. N. and Sawhney, N. Dynomite: a dynamically organized ink and audio notebook Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, Atlanta, GA, United States, 1997.  ",
      "doi": "10.1145/258549.258700"
    },
    {
      "text": "Wolfe, J. L. Effects of annotations on student readers and writers Proceedings of the fifth ACM conference on Digital libraries, ACM, San Antonio, Texas, United States, 2000.  ",
      "doi": "10.1145/336597.336620"
    }
  ]
}