{
  "doi": "10.1145/1978942.1978962",
  "title": "Comparing activity theory with distributed cognition for video analysis: beyond \"kicking the tires\"",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "133-142",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The field of HCI is growing, not only in the variety of application areas or the volume of research conducted, but also in the number of analytical approaches for use in the evaluation and design of interactive systems. However, despite the abundance of theoretical frameworks available, relatively little work has directly compared the application of these frameworks. This paper compares video analysis methods based on two analytic frameworks - activity theory (AT) and distributed cognition (DCog) - by performing an analysis of the same system from each of the two different theoretical perspectives. The results presented here provide a better understanding of how such theoretically informed methods in practice both resemble and differ from one another. Furthermore, this comparison enables specific insights about each of the theories themselves, as well as more general discussion about the role of theory in HCI.",
  "tags": [
    "activity theory",
    "video analysis",
    "methodology evaluation",
    "evaluation methodology",
    "distributed cognition"
  ],
  "authors": [
    {
      "name": "Eric P.S. Baumer",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/do/10.1145/contrib-81311485671/rel-imgonly/dsc_3664-edit-square.png",
      "acmid": "81311485671",
      "orcid": "0000-0001-5338-4421"
    },
    {
      "name": "Bill Tomlinson",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/do/10.1145/contrib-81100457381/rel-imgonly/billatbackbaycropped.jpg",
      "acmid": "81100457381",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bassoli, A., Brewer, J., and Martin, K. In-between theory and practice: dialogues in design and research. CHI '07 Extended Abstracts, (2007), 1691--1696.  ",
      "doi": "10.1145/1240866.1240885"
    },
    {
      "text": "Baumer, E., Tomlinson, B., Yau, M., and Alspaugh, T. Normative Echoes: Use and Manipulation of Player Generated Content by Communities of NPCs. AI in Interactive Digital Entertainment (AIIDE-06) Demonstration Program, AAAI Press (2006).",
      "doi": ""
    },
    {
      "text": "B&amp;#248;dker, S. Applying Activity Theory to Video Analysis: How to Make Sense of Video Data in HCI. In Context and Consciousness: Activity Theory and Human-Computer Interaction. MIT Press, Cambridge, MA, 1996, 147--176. ",
      "doi": "10.5555/223826.223833"
    },
    {
      "text": "B&amp;#248;dker, S. and Andersen, P. B. Complex Mediation. Human-Computer Interaction 20, 4 (2005), 353--402.  ",
      "doi": "10.1207/s15327051hci2004_1"
    },
    {
      "text": "Boehner, K., Vertesi, J., Sengers, P., and Dourish, P. How HCI interprets the probes. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2007), 1077--1086.  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Card, S., Moran, T., and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Decortis, F., Noirfalise, S., and Saudelli, B. Activity theory, cognitive ergonomics and distributed cognition: three views of a transport company. Int. J. Hum.-Comput. Stud. 53, 1 (2000), 5--33.  ",
      "doi": "10.1006/ijhc.2000.0378"
    },
    {
      "text": "Engestr&amp;#246;m, Y. Learning, Working, and Imagining: Twelve Studies in Activity Theory. Orienta-Konsultit Oy, Helsinki, 1990.",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Buxton, B. Usability evaluation considered harmful (some of the time). ACM SIGCHI, ACM (2008), 111--120.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Halverson, C. Inside the Cognitive Workplace: New Technology and Air Traffic Control. 1995.",
      "doi": ""
    },
    {
      "text": "Halverson, C. Activity theory and distributed cognition: or What Does CSCW need to do with theories. Special Issue of Computer Supported Cooperative Work on Activity Theory 11, 1--2 (2002), 243--267.  ",
      "doi": "10.1023/A%3A1015298005381"
    },
    {
      "text": "Hutchins, E. Cognition in the Wild. MIT Press, Cambridge, MA, 1995.",
      "doi": ""
    },
    {
      "text": "Hutchins, E. and Klausen, T. Distributed Cognition in an Airline Cockpit. In Y. Engestr&amp;#246;m and D. Middleton, eds., Cognition and Communication at Work. Cambridge University Press, New York, 1996, 15--34.",
      "doi": ""
    },
    {
      "text": "Hutchins, E. and Palen, L. Constructing Meaning from Space, Gesture, and Speech. In L. B. Resnick, R. S&amp;#228;ljo, C. Pontecorvo and B. Burge, eds., Discourse, Tools, and Reasoning: Essays on Situated Cognition. Springer-Verlag, Berlin, 1997, 24--40.",
      "doi": ""
    },
    {
      "text": "Kaptelinin, V. and Nardi, B. A. Acting with Technology: Activity Theory and Interaction Design. MIT Press, Cambridge, MA, 2006. ",
      "doi": "10.5555/1196435"
    },
    {
      "text": "Kaptelinin, V., Nardi, B., B&amp;#248;dker, S., et al. Post-cognitivist HCI: second-wave theories. CHI '03 extended abstracts on Human factors in computing systems, ACM (2003), 692--693.  ",
      "doi": "10.1145/765891.765933"
    },
    {
      "text": "Leont'ev, A. The problem of activity in psychology. Soviet Psychology 13, 2 (1974), 4--33.",
      "doi": ""
    },
    {
      "text": "Mwanza, D. Towards an Activity-Oriented Design Method for HCI Research and Practice. 2002.",
      "doi": ""
    },
    {
      "text": "Nardi, B. Studying Context: A Comparison of Activity Theory, Situated Action Models, and Distributed Cognition. In Context and Consciousness: Activity Theory and Human-Computer Interaction. MIT Press, Cambridge, MA, 1996. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Nardi, B. A. Coda and Response to Christine Halverson. Special Issue of Computer Supported Cooperative Work on Activity Theory 11, 1-2 (2002), 269--275.  ",
      "doi": "10.1023/A%3A1015293915392"
    },
    {
      "text": "Rogers, Y. New Theoretical Approaches for Human-Computer Interaction. Annual Review of Information Science and Technology (ARIST) 38, (2004), 87--143.",
      "doi": ""
    },
    {
      "text": "Suchman, L. Embodied Practices of Engineering Work. Mind, Culture, and Activity 7, 1-2 (2000), 4--18.",
      "doi": ""
    },
    {
      "text": "Vygotsky, L. Mind and Society. Harvard University Press, Cambridge, MA, 1978.",
      "doi": ""
    },
    {
      "text": "Wolf, C. G., Halverson, C., Kaptelinin, V., and Shepherd, A. From Analysis to Design: Do Different Analytical Methods Make a Difference? Panel at INTERACT '99, (1999).",
      "doi": ""
    }
  ]
}