{
  "doi": "10.1145/1978942.1979133",
  "title": "SandCanvas: a multi-touch art medium inspired by sand animation",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1283-1292",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Sand animation is a performance art technique in which an artist tells stories by creating animated images with sand. Inspired by this medium, we have developed a new multi-touch digital artistic medium named SandCanvas that simplifies the creation of sand animations. SandCanvas also goes beyond traditional sand animation with tools for mixing sand animation with video and replicating recorded free-form hand gestures. In this paper, we analyze common sand animation hand gestures, present SandCanvas's intuitive UI, and describe implementation challenges we encountered. We also present an evaluation with professional and novice artists that shows the importance and unique affordances of this new medium.",
  "tags": [
    "sand animation",
    "table-top computing",
    "creativity",
    "multi-touch art"
  ],
  "authors": [
    {
      "name": "Rubaiat Habib Kazi",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645237",
      "orcid": "missing"
    },
    {
      "name": "Kien Chuan Chua",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484650843",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    },
    {
      "name": "Richard Davis",
      "institution": "Singapore Management University, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81416597118/rel-imgonly/2011-rcdavis-mugshot.jpg",
      "acmid": "81416597118",
      "orcid": "missing"
    },
    {
      "name": "Kok-Lim Low",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143361",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sand Animation: Interview with Cako. http://www.sandanimation.com/page.php?2.",
      "doi": ""
    },
    {
      "text": "(Ed.) CM-T, Tabletops - Horizontal Interactive Displays. Springer, 2010. ",
      "doi": "10.5555/1809767"
    },
    {
      "text": "Bacher, H. P., Dream Worlds: Production Design for Animation. Focal Press, 2007.",
      "doi": ""
    },
    {
      "text": "Barnes, C., et al. Video puppetry: a performative interface for cutout animation. In. ACM SIGGRAPH Asia 2008 papers 2008, ACM (2008), 1--9.  ",
      "doi": "10.1145/1457515.1409077"
    },
    {
      "text": "Bell, N., Y. Yu, and P. J. Mucha. Particle Based Simulation of Granular Materials. SIGGRAPH 2005.  ",
      "doi": "10.1145/1073368.1073379"
    },
    {
      "text": "Besl, P. J. and McKay, N. D. A Method for Registration of 3-D Shapes. IEEE Trans. on Pattern Analysis and Machine Intelligence 1992; 14(2): 239--256.  ",
      "doi": "10.1109/34.121791"
    },
    {
      "text": "Csikszentmihalyi, M., Flow: The Psychology of Optimal Experience. (1st edition). New York: Harper and Row, 1990.",
      "doi": ""
    },
    {
      "text": "Danielson, P.-E. Euclidean distance mapping. Computer Graphics and Image Processing 1980; 14: 227--248.",
      "doi": ""
    },
    {
      "text": "Davis, R. C., Colwell, B., and Landay, J. A. K-sketch: a 'kinetic' sketch pad for novice animators. In. Proceeding of CHI 2008, 413--422.  ",
      "doi": "10.1145/1357054.1357122"
    },
    {
      "text": "Efron, D., Gesture and Environment. New York: King's Crown Press, 1941.",
      "doi": ""
    },
    {
      "text": "1Hancock, M., Cate, T., Carpendale, S., Isenberg, T. Supporting Sandtray Therapy on an Interactive Tabletop. Proceeding of CHI 2010.  ",
      "doi": "10.1145/1753326.1753651"
    },
    {
      "text": "Hinckley, K., et al. Design and Analysis of Delimiters for Selection-action Pen Gesture Phrases in Scriboli. Proceeding of CHI 2005, 451--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Igarashi, T., Moscovich, T., and Hughes, J. F. As-rigid-as-possible shape manipulation. In. ACM SIGGRAPH 2005 Papers, 1134--1141.  ",
      "doi": "10.1145/1186822.1073323"
    },
    {
      "text": "Kenyon, H., Animating under the Camera, in Animation Magazine. 1998.",
      "doi": ""
    },
    {
      "text": "Krueger, M. W., Gionfriddo, T., and Hinrichsen, K. VideoPlace - an artificial reality. SIGCHI Bulletin 1985; 16(4): 35--40.  ",
      "doi": "10.1145/1165385.317463"
    },
    {
      "text": "Lakin, F. A performing medium for working group graphics. Proceedings of the CSCW 1986, 255--266.  ",
      "doi": "10.1145/637069.637105"
    },
    {
      "text": "Levin, G., Audiovisual Software Art: A Partial History, 2009.",
      "doi": ""
    },
    {
      "text": "Levin, G., Painterly Interfaces for Audiovisual Performance, in Media Laboratory, School of Architecture and Planning. 2000, Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Li, X. and J. M. Morshell. Modelling soil: Realtime dynamic models for oil slippage and manipulation. SIGGRAPH 1993.  ",
      "doi": "10.1145/166117.166162"
    },
    {
      "text": "Li, Y., et al. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. Proceedings of CHI 2005, 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "McCullough, M., Abstracting Craft: The practiced Digital Hand. MIT Press, 1998. ",
      "doi": "10.5555/521472"
    },
    {
      "text": "Nelson Chu, W. B., Li-Yi Wei, and Naga Govindaraju. Detail-preserving paint modeling for 3D brushes. Non-Photorealistic Animation and Rendering 2010.  ",
      "doi": "10.1145/1809939.1809943"
    },
    {
      "text": "Onoue, K. and Nishita, T. An Interactive Deformation System for Granular Material. Computer Graphics Forum 2005; 24(1): 51--60.",
      "doi": ""
    },
    {
      "text": "Richard, T., The encyclopedia of Animation Techniques, 1999.",
      "doi": ""
    },
    {
      "text": "Ryokai, K., Marti, S., and Ishii, H. I/O brush: drawing with everyday objects as ink. In. Proc. of CHI 2004, 303--310.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Schneider, J., Kraus, M., and Westermann, Ru. GPU-Based Real Time Discrete Euclidean Distance Transforms with Precise Error Bounds. VISAPP 2009(2009).",
      "doi": ""
    },
    {
      "text": "Snibbe, S. S. and Levin, G. Interactive dynamic abstraction. In. Proc. of the 1st international symp. on Non-photorealistic animation and rendering 2000, ACM (2000), 21--29.  ",
      "doi": "10.1145/340916.340919"
    },
    {
      "text": "Summer, R. W., Brien, J. F. O., and Hodgins, J. K. Animating Sand, Mud and Snow. Eurographics 1999(1999).",
      "doi": ""
    },
    {
      "text": "Ura, M., et al. A Paint Tool for Image Generation of Sand Animation Style. IEICE Tech 2009(2009).",
      "doi": ""
    },
    {
      "text": "Vandoren, P., et al. FluidPaint: an interactive digital painting system using real wet brushes. In. Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces 2009, ACM (2009), 53--56.  ",
      "doi": "10.1145/1731903.1731914"
    },
    {
      "text": "Vandoren, P., et al. IntuPaint: Bridging the Gap between Physical and Digital Painting. IEEE TABLETOP 2008(2008).",
      "doi": ""
    },
    {
      "text": "Wilson, A. D., et al. Bringing Physics to the Surface. ACM UIST 2008(2008), 67--76.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined Gestures for Surface Computing. ACM CHI 2009(2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}