{
  "doi": "10.1145/1978942.1979321",
  "title": "Of passwords and people: measuring the effect of password-composition policies",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2595-2604",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Text-based passwords are the most common mechanism for authenticating humans to computer systems. To prevent users from picking passwords that are too easy for an adversary to guess, system administrators adopt password-composition policies (e.g., requiring passwords to contain symbols and numbers). Unfortunately, little is known about the relationship between password-composition policies and the strength of the resulting passwords, or about the behavior of users (e.g., writing down passwords) in response to different policies. We present a large-scale study that investigates password strength, user behavior, and user sentiment across four password-composition policies. We characterize the predictability of passwords by calculating their entropy, and find that a number of commonly held beliefs about password composition and strength are inaccurate. We correlate our results with user behavior and sentiment to produce several recommendations for password-composition policies that result in strong passwords without unduly burdening users.",
  "tags": [
    "usability",
    "security",
    "policy",
    "passwords"
  ],
  "authors": [
    {
      "name": "Saranga Komanduri",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351608465",
      "orcid": "missing"
    },
    {
      "name": "Richard Shay",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81339527920/rel-imgonly/rich.jpg",
      "acmid": "81339527920",
      "orcid": "missing"
    },
    {
      "name": "Patrick Gage Kelley",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81384615723/rel-imgonly/pgk-8.jpg",
      "acmid": "81384615723",
      "orcid": "missing"
    },
    {
      "name": "Michelle L. Mazurek",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641915",
      "orcid": "missing"
    },
    {
      "name": "Lujo Bauer",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81350570444/rel-imgonly/lujo-5.jpg",
      "acmid": "81350570444",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Christin",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131105",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Serge Egelman",
      "institution": "National Institute of Standards and Technology, Gaithersburg, Maryland, USA",
      "img": "/do/10.1145/contrib-81315488724/rel-imgonly/me.jpg",
      "acmid": "81315488724",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. Adams, M. A. Sasse, and P. Lunt. Making passwords secure and usable. In HCI 97, 1997. ",
      "doi": "10.5555/646684.702633"
    },
    {
      "text": "M. Bishop and D. V. Klein. Improving system security via proactive password checking. Computers &amp;#38; Security, 14(3):233--249, 1995.",
      "doi": "10.1016/0167-4048%2895%2900003-Q"
    },
    {
      "text": "J. Bonneau and S. Preibusch. The password thicket: technical and market failures in human authentication on the web. In Proc. (online) of WEIS'10, June 2010.",
      "doi": ""
    },
    {
      "text": "W. E. Burr, D. F. Dodson, and W. T. Polk. Electronic authentication guideline. Technical report, NIST, 2006. ",
      "doi": "10.5555/2206278"
    },
    {
      "text": "D. Flor&amp;#234;ncio and C. Herley. A large-scale study of web password habits. In Proc. WWW'07, 2007.  ",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "D. Flor&amp;#234;ncio and C. Herley. Where do security policies come from? In Proc. SOUPS '10, 2010.  ",
      "doi": "10.1145/1837110.1837124"
    },
    {
      "text": "P. Inglesant and M. A. Sasse. The true cost of unusable password policies: password use in the wild. In Proc. ACM CHI'10, pages 383--392, 2010.  ",
      "doi": "10.1145/1753326.1753384"
    },
    {
      "text": "B. Ives, K. R. Walsh, and H. Schneider. The domino effect of password reuse. C. ACM, 47(4):75--78, 2004.  ",
      "doi": "10.1145/975817.975820"
    },
    {
      "text": "J. L. Massey. Guessing and entropy. In Proc. IEEE ISIT'94, page 204, 1994.",
      "doi": ""
    },
    {
      "text": "G. Miller. Note on the bias of information estimates. Info. Th. Psych.: Problems and Methods, 1955.",
      "doi": ""
    },
    {
      "text": "L. Paninski. Estimation of entropy and mutual information. Neural Comp., 15(6):1191--1253, 2003.  ",
      "doi": "10.1162/089976603321780272"
    },
    {
      "text": "R. W. Proctor, M.-C. Lien, K.-P. L. Vu, E. E. Schultz, and G. Salvendy. Improving computer security for authentication of users: Influence of proactive password restrictions. Behavior Res. Methods, Instruments, &amp;#38; Computers, 34(2):163--169, 2002.",
      "doi": ""
    },
    {
      "text": "S. Schechter, C. Herley, and M. Mitzenmacher. Popularity is everything: A new approach to protecting passwords from statistical-guessing attacks. In Proc. HotSec'10, 2010. ",
      "doi": "10.5555/1924931.1924935"
    },
    {
      "text": "C. E. Shannon. A mathematical theory of communication. ACM SIGMOBILE Mobile Comp. Comm. Rev., 5(1), 1949.  ",
      "doi": "10.1145/584091.584093"
    },
    {
      "text": "C. E. Shannon. Prediction and entropy of printed english. Bell Systems Tech. J., 30:50--64, 1951.",
      "doi": ""
    },
    {
      "text": "R. Shay and E. Bertino. A comprehensive simulation tool for the analysis of password policies. Int. J. Info. Sec., 8(4):275--289, 2009.  ",
      "doi": "10.1007/s10207-009-0084-3"
    },
    {
      "text": "R. Shay, S. Komanduri, P. Kelley, P. Leon, M. Mazurek, L. Bauer, N. Christin, and L. Cranor. Encountering stronger password requirements: user attitudes and behaviors. In Proc. SOUPS'10, 2010.  ",
      "doi": "10.1145/1837110.1837113"
    },
    {
      "text": "J. M. Stanton, K. R. Stam, P. Mastrangelo, and J. Jolton. Analysis of end user security behaviors. Comp. &amp;#38; Security, 24(2):124--133, 2005.",
      "doi": "10.1016/j.cose.2004.07.001"
    },
    {
      "text": "A. Vance. If your password is 123456, just make it hackme. New York Times, http://www.nytimes.com/2010/01/21/technology/21password.html, January 2010, retrieved September 2010.",
      "doi": ""
    },
    {
      "text": "K.-P. L. Vu, R. W. Proctor, A. Bhargav-Spantzel, B.-L. B. Tai, and J. Cook. Improving password security and memorability to protect personal and organizational information. Int. J. of Human-Comp. Studies, 65(8):744--757, 2007.  ",
      "doi": "10.1016/j.ijhcs.2007.03.007"
    },
    {
      "text": "M. Weir, S. Aggarwal, M. Collins, and H. Stern. Testing metrics for password creation policies by attacking large sets of revealed passwords. In Proceedings of the 17th ACM conference on Computer and communications security, CCS '10, pages 162--175, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1866307.1866327"
    },
    {
      "text": "Y. Zhang, F. Monrose, and M. K. Reiter. The security of modern password expiration: An algorithmic framework and empirical analysis. In Proc. ACM CCS'10, 2010.  ",
      "doi": "10.1145/1866307.1866328"
    },
    {
      "text": "M. Zviran and W. J. Haga. Password security: an empirical study. J. Mgt. Info. Sys., 15(4):161--185, 1999.  ",
      "doi": "10.1080/07421222.1999.11518226"
    }
  ]
}