{
  "doi": "10.1145/1978942.1979296",
  "title": "In the best families: tracking and relationships",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2419-2428",
  "year": 2011,
  "badges": [],
  "abstract": "A growing body of research has been exploring the use of control mechanisms to address the privacy concerns raised by location-tracking technology. We report on a qualitative study of two family groups who used a custom-built tracking application for an extended period of time. Akin to sociological breaching experiments, the study focuses on the interferences between location tracking and relationship management. We analyze the tensions that can arise between affordances of the technology and uses that the contracts between family members legitimize. We describe how, by fostering misperceptions and 'nudging' behaviors, location-tracking technology can generate anxieties and conflicts even in close relationships. We discuss their vulnerability to the overreaching effects of tracking, against which the use of mechanisms such as location-sharing preferences and feedback may not be socially viable.",
  "tags": [
    "location-based technology",
    "family relationships",
    "family contract",
    "privacy",
    "location tracking"
  ],
  "authors": [
    {
      "name": "Clara Mancini",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100207640",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Keerthi Thomas",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443594273",
      "orcid": "missing"
    },
    {
      "name": "Adam N. Joinson",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100339752",
      "orcid": "missing"
    },
    {
      "name": "Blaine A. Price",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100551103",
      "orcid": "missing"
    },
    {
      "name": "Arosha K. Bandara",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/do/10.1145/contrib-81100396043/rel-imgonly/arosha.bandara-2.jpg",
      "acmid": "81100396043",
      "orcid": "missing"
    },
    {
      "name": "Lukasz Jedrzejczyk",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438596511",
      "orcid": "missing"
    },
    {
      "name": "Bashar Nuseibeh",
      "institution": "The Open University, Milton Keynes, United Kingdom and University of Limerick, Limerick, Ireland",
      "img": "/do/10.1145/contrib-81100488632/rel-imgonly/dsc5934s.jpg",
      "acmid": "81100488632",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anthony, D., Henderson, T., Kotz, D. (2010). Privacy in Location-Aware Computing Environments. Proc. IEEE Pervasive Computing, vol. 6, no. 4, pp. 64--72.  ",
      "doi": "10.1109/MPRV.2007.83"
    },
    {
      "text": "Barkhuus, L. and Dey, A. (2003). Location-Based Services for Mobile Telephony: a Study of User's Privacy Concerns. Proc. INTERACT '03. Zurich, Switzerland: IOS Press, pp. 709--712.",
      "doi": ""
    },
    {
      "text": "Barkhuus, L., Brown, B., Bell, M., Sherwood, S., Hall, M. and Chalmers, M. (2008). From awareness to repartee: sharing location within social groups. Proc. CHI'08. Florence, Italy: ACM Press, pp. 497--506.  ",
      "doi": "10.1145/1357054.1357134"
    },
    {
      "text": "Boesen, J., Rode, J. Mancini, C. (2010). The Domestic Panopticon: Location Tracking in Families. Proc. UbiComp '10. Copenhagen, Denmark: ACM Press.  ",
      "doi": "10.1145/1864349.1864382"
    },
    {
      "text": "Brown, B., Taylor, A., Izadi, S., Sellen, A., Kaye, J., and Eardley, R. (2007). Locating family values: A field trial of the whereabouts clock. Proc. UbiComp'07. Innsbruck, Austria: ACM Press, pp. 354--371. ",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "Conesa-Sevilla, J. (2008). Thinking in Animal Signs. The Trumpeter. vol. 24, pp. 116--125.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Smith, I. E., Matthews, T., La Marca, A., Tabert, J., and Powledge, P. (2005). Location Disclosure to Social Relations: Why, When, & What People Want to Share. Proc. CHI'05. Portland, OR: ACM, 2005, pp. 81--90.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Dourish, P. and Palen. L. (2003). Unpacking privacy for a networked world. Proc. CHI'03, Ft. Lauderdale, FL: ACM Press, pp. 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Erickson, T. and Kellogg, W. A. (2000). Social translucence: an approach to designing systems that support social processes. TOCHI, vol. 7, pp. 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Hsieh, G., Tang, K. P., Yong Low, W., Hong, J. I. (2007). Field Deployment of IMBuddy: A Study of Privacy Control and Feedback Mechanisms for Contextual IM. Krumm, J. et al. (Eds.): UbiComp2007, LNCS 4717, pp. 91--108. ",
      "doi": "10.5555/1771592.1771598"
    },
    {
      "text": "Iachello, G., Smith, I., Consolvo, S., Chen, M., Abowd, G. D. (2005). Developing Privacy Guidelines for Social Location Disclosure Applications and Services. Proc. SOUPS'05. Pittsburgh, PA: ACM Press.  ",
      "doi": "10.1145/1073001.1073008"
    },
    {
      "text": "Jedrzejczyk, L., Price, B. A., Bandara, A. K., Nuseibeh, B. (2010). On the impact of real-time feedback on users' behavior in mobile location-sharing applications. Proc. SOUPS '10, pp. 14--16.  ",
      "doi": "10.1145/1837110.1837129"
    },
    {
      "text": "Lederer, S., Mankoff, J. and Dey, A. K. (2003). Who Wants to Know What When? Privacy Preference Determinants in Ubiquitous Computing. Proc. CHI'03. Ft. Lauderdale, FL: ACM Press, pp. 724--725.  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "Mancini, C., Thomas, K., Rogers, Y., Price, B. A., Jedrzejczyk, L., Bandara, A. K., Joinson, A. N., and Nuseibeh, B. (2009). From Spaces to Places: Emerging Contexts in Mobile Privacy. Proc. UbiComp'09, Orlando, FL: ACM, 2009, pp. 1--10.  ",
      "doi": "10.1145/1620545.1620547"
    },
    {
      "text": "Martin, B. (1984). 'Mother Wouldn't Like it': Housework as Magic. Theory, Culture and Society, vol. 2, no. 2, pp.19--36.",
      "doi": ""
    },
    {
      "text": "Petronio, S. (2002). Boundaries of Privacy: Dialectics of Disclosure. Albany, NY: State University of New York Press.",
      "doi": ""
    },
    {
      "text": "Schoeman, F. D. (1992). Privacy and Social Freedom. Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Shami, N. S., Ehrlich, K., Gay, G., Hancock, J. T. (2009). Making sense of strangers' expertise from signals in digital artifacts. Proc. CHI'09. Boston, MA: ACM Press, pp. 69--78.  ",
      "doi": "10.1145/1518701.1518713"
    },
    {
      "text": "Shklovski, I., Vertesi, J., Troshynski, E. and Dourish, P. (2009). The commodification of location: dynamics of power in location-based systems. Proc. UbiComp'09. Orlando, FL: ACM Press, pp. 11--20.  ",
      "doi": "10.1145/1620545.1620548"
    },
    {
      "text": "Stacey, J. (1997). In the Name of the Family: Rethinking Family Values in the Postmodern Age. Beacon Press.",
      "doi": ""
    },
    {
      "text": "Troshynski, E., Lee, C. and Dourish, P. (2008). Accountabilities of presence: reframing location-based systems. Proceedings CHI'08. Florence, Italy: ACM Press.  ",
      "doi": "10.1145/1357054.1357133"
    },
    {
      "text": "Tsai, J. Y., Kelley, P., Drielsma, P., Cranor, L., Hong, J., Sadeh, N. (2009). Who's Viewed You: The Impact of Feedback in a Mobile Location Sharing System. Proc. CHI'09. Boston, MA: ACM Press.  ",
      "doi": "10.1145/1518701.1519005"
    },
    {
      "text": "Vasalou, A., Oostveen, A.-M., and Joinson, A. N. (in review). Location sharing in the family. Paper currently under review.",
      "doi": ""
    },
    {
      "text": "Wagener, D., Lopez, M., Doria, A., Pavlyshak, I., Kostakos, V., Oakley, I., Spiliotopoulos, T. (2010). Hide and Seek: Location Sharing Practices with Social Media. Proc. MobileHCI'10. Lisboa, Portugal: ACM Press.  ",
      "doi": "10.1145/1851600.1851612"
    }
  ]
}