{
  "doi": "10.1145/1978942.1979438",
  "title": "Unpacking exam-room computing: negotiating computer-use in patient-physician interactions",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3343-3352",
  "year": 2011,
  "badges": [],
  "abstract": "The presence of computers - especially desktops - takes significant time and attention away from patients during medical visits. As a result, patients may feel disengaged and disregarded. In this study, we examined the impact of using \"Computer-on-Wheels\" (COWs) in exam-rooms. We found physicians constantly reorienting and resituating exam-room computers to different positions during the three stages of a medical visit: communication-intensive phase, lecturing phase and ordering phase. We refer to this behavior as micro-negotiation of computer-use. Analysis of its usage patterns, as well as physician and patient perceptions, show that micro-negotiations facilitate eye contact expression and encourage patient participation in medical visits. In addition, we identify two tensions and two unintended benefits resulting from micro-negotiations. These findings lead us to consider new modes of negotiation in the exam-room that could alleviate the tensions identified while enabling physicians to continue enjoying micro-negotiation benefits in their work practice.",
  "authors": [
    {
      "name": "Yunan Chen",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131427",
      "orcid": "missing"
    },
    {
      "name": "Victor Ngo",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81458643265",
      "orcid": "missing"
    },
    {
      "name": "Sidney Harrison",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654415",
      "orcid": "missing"
    },
    {
      "name": "Victoria Duong",
      "institution": "University of California, Irvine, Irvine, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654437",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Als, A.B.. The desk-top computer as a magic box: patterns of behaviour connected with the desk-top computer; GPs' and patients' perceptions. Family Practice 14, 1 (1997), 17--23.",
      "doi": ""
    },
    {
      "text": "Bannon, L., Bødker, S. Constructing common information spaces. In Proceedings of ECSCW 1997, Kluwer Academic Publishers, (1997), 81--96. ",
      "doi": "10.5555/1241980.1241986"
    },
    {
      "text": "Bekker, M. M., Olson, J. S., Olson, G. M. Analysis of gestures in face-to-face design teams provides guidance for how to use groupware in design. In Proceedings of the Symposium on Designing Interactive Systems (DIS) 1995, ACM Press (1995),157--166.  ",
      "doi": "10.1145/225434.225452"
    },
    {
      "text": "Bensing, J. M., Roter, D. L., Hulsman, R. L. Communication patterns of primary care physicians in the United States and the Netherlands. Journal of General Internal Medicine 18, 5 (2003), 335--342.",
      "doi": ""
    },
    {
      "text": "Frankel, R., Altschuler, A., George, S., Kinsman, J., Jimison, H., Robertson, N. R., Hsu, J. Effects of exam-room computing on clinician-patient communication: a longitudinal qualitative study. Journal of General Internal Medicine 20, 8 (2005) 677--682.",
      "doi": ""
    },
    {
      "text": "Hall, E. The Hidden Dimension. Anchor Books, New York, NY, USA, 1966.",
      "doi": ""
    },
    {
      "text": "Heath, C., Luff, P. Documents and professional practice: \"bad\" organizational reasons for \"good\" clinical records. In Proceedings of CSCW 1996, ACM Press (1996), 354--363.  ",
      "doi": "10.1145/240080.240342"
    },
    {
      "text": "Glaser, B. G. and Strauss, A. L. 1967. The discovery of grounded theory: Strategies for qualitative research. Aldine de Gruyter, Hawthorne, NY.",
      "doi": ""
    },
    {
      "text": "Luff, P., Heath, C. Mobility in Collaboration. In Proceedings of CSCW 1998, ACM Press (1998), 305--314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "Makoul, G., Curry, R. H., Tang, P. C. The use of electronic medical records: communication patterns in outpatient encounters. Journal of the American Medical Informatics Association 8, 6 (2001), 610--615.",
      "doi": ""
    },
    {
      "text": "Margalit, R. S., Roter, D., Dunevant, M. A., Larson, S., Reis, S. Electronic medical record use and physician-patient communication: an observational study of Israeli primary care encounters. Patient Education and Counseling 61, 1 (2006), 134--134.",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Huang, A., Paepcke, A., Winograd, T. Cooperative gestures: Multi-user gestural interactions for co-located groupware. In Proceedings of CHI 2006, ACM Press (2006) 1201--1210.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Nardi, B. A. Beyond Bandwidth: Dimensions of Connection in Interpersonal Communication. Computer Supported Cooperative Work 14, 2 (2005) 91--130.  ",
      "doi": "10.1007/s10606-004-8127-9"
    },
    {
      "text": "Reddy, M., Dourish, P., and Pratt, W. Coordinating Heterogeneous Work: Information and Representation in Medical Care. In Proceedings of ECSCW 2001, ACM Press (2001), 239--258. ",
      "doi": "10.5555/1241867.1241880"
    },
    {
      "text": "Ridsdale, L., Hudd, S. Computers in the consultation: the patient's view. The British Journal of General Practice 44, 385 (1999), 367--369.",
      "doi": ""
    },
    {
      "text": "Roter, D. L., Frankel, R. M., Hall, J. A., Sluyter, D. The expression of emotion through nonverbal behavior in medical visits. Mechanisms and outcomes. Journal of General Internal Medicine 21, 1 (2006), 28--34.",
      "doi": ""
    },
    {
      "text": "Tang, C. & Carpendale, S. Evaluating the Deployment of a Mobile Technology in a Hospital Ward. In Proceedings of CSCW 2008, ACM Press (2008), 205--214.  ",
      "doi": "10.1145/1460563.1460596"
    },
    {
      "text": "Unruh, K. T., Skeels, M., Civan-Hartzler, A., Pratt, W. Transforming Clinic Environments into Information Workspaces for Patients. In Proceedings of CHI 2010, ACM Press (2010), 183--192.  ",
      "doi": "10.1145/1753326.1753354"
    },
    {
      "text": "Vertegaal, R., Weevers, I., Sohn, C., Cheung, C. GAZE-2: conveying eye contact in group video conferencing using eye-controlled camera direction. In Proceedings of CHI 2003, ACM Press (2003), 521--528.  ",
      "doi": "10.1145/642611.642702"
    },
    {
      "text": "Wilcox, L., Morris, D., Tan, D., Gatewood, J. Designing patient-centric information displays for hospitals. In Proceedings of CHI 2010, ACM Press (2010), 2123--2132.  ",
      "doi": "10.1145/1753326.1753650"
    },
    {
      "text": "Yamashita N., Hirata K., Aoyagi S., Kuzuoka H., Harada Y. Impact of Seating Positions on Group Video Communication. In Proceedings of CSCW 2008, ACM Press (2008), 177--186.  ",
      "doi": "10.1145/1460563.1460591"
    }
  ]
}