{
  "doi": "10.1145/1978942.1979266",
  "title": "When designing usability questionnaires, does it hurt to be positive?",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2215-2224",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "When designing questionnaires there is a tradition of including items with both positive and negative wording to minimize acquiescence and extreme response biases. Two disadvantages of this approach are respondents accidentally agreeing with negative items (mistakes) and researchers forgetting to reverse the scales (miscoding). The original System Usability Scale (SUS) and an all positively worded version were administered in two experiments (n=161 and n=213) across eleven websites. There was no evidence for differences in the response biases between the different versions. A review of 27 SUS datasets found 3 (11%) were miscoded by researchers and 21 out of 158 questionnaires (13%) contained mistakes from users. We found no evidence that the purported advantages of including negative and positive items in usability questionnaires outweigh the disadvantages of mistakes and miscoding. It is recommended that researchers using the standard SUS verify the proper coding of scores and include procedural steps to ensure error-free completion of the SUS by users. Researchers can use the all positive version with confidence because respondents are less likely to make mistakes when responding, researchers are less likely to make errors in coding, and the scores will be similar to the standard SUS.",
  "tags": [
    "acquiescent bias",
    "usability evaluation",
    "system usability scale (sus)",
    "standardized questionnaires",
    "satisfaction measures"
  ],
  "authors": [
    {
      "name": "Jeff Sauro",
      "institution": "Oracle Corporation, Denver, Colorado, USA",
      "img": "/do/10.1145/contrib-81100263219/rel-imgonly/aa.jpg",
      "acmid": "81100263219",
      "orcid": "missing"
    },
    {
      "name": "James R. Lewis",
      "institution": "IBM Software Group, Boca Raton, Florida, USA",
      "img": "/do/10.1145/contrib-81100350474/rel-imgonly/81100350474.jpg",
      "acmid": "81100350474",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anastasi, A. (1982). Psychological testing (5th ed.). New York: Macmillan.",
      "doi": ""
    },
    {
      "text": "Anderson, A. B., Basilevsky, A., &amp;#38; Hum, D. P. J. (1983). Measurement: Theory and techniques. In P. H. Rossi, J. D. Wright, &amp;#38; A. B. Anderson (Eds.), Handbook of Survey Research (pp. 231--187). New York, NY: Academic Press.",
      "doi": ""
    },
    {
      "text": "Bangor, A., Kortum, P. T., &amp;#38; Miller, J. T. (2008). An empirical evaluation of the System Usability Scale. International Journal of Human-Computer Interaction, 6, 574--594.",
      "doi": ""
    },
    {
      "text": "Barnette, J. J. (2000). Effects of stem and Likert response option reversals on survey internal consistency: If you feel the need, there is a better alternative to using those negatively worded stems. Educational and Psychological Measurement, 60(3), 361--370.",
      "doi": ""
    },
    {
      "text": "Borsci, S., Federici, S., &amp;#38; Lauriola, M. (2009). On the dimensionality of the System Usability Scale: A test of alternative measurement models. Cognitive Processes, 10, 193--197.",
      "doi": ""
    },
    {
      "text": "Brooke, J. (1996). SUS: A quick and dirty usability scale. In P.W. Jordan, B. Thomas, B.A. Weerdmeester &amp;#38; I.L. McClelland (Eds.), Usability Evaluation in Industry (pp. 189--194). London, UK: Taylor &amp;#38; Francis.",
      "doi": ""
    },
    {
      "text": "Chin, J. P, Diehl, V. A., &amp;#38; Norman, K. (1988). Development of an instrument measuring user satisfaction of the human-computer interface. In Conference on Human Factors in Computing Systems (pp. 213--218). New York, NY: Association for Computing Machinery.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Finstad, K. (2006). The System Usability Scale and non-native English speakers. Journal of Usability Studies, 1, 185--188.",
      "doi": "10.5555/2835531.2835535"
    },
    {
      "text": "Finstad, K. (2010). Response interpolation and scale sensitivity: Evidence against 5-point scales. Journal of Usability Studies, 5(3), 104--110.",
      "doi": "10.5555/2835434.2835437"
    },
    {
      "text": "Karn, K., Little, A., Nelson, G., Sauro, J. Kirakowski, J., Albert, W. &amp;#38; Norman, K., (2008) Subjective Ratings of Usability: Reliable or Ridiculous? Panel Presentation at the Usability Professionals Association (UPA 2008) Conference Baltimore, MD.",
      "doi": ""
    },
    {
      "text": "Kirakowski, J., &amp;#38; Corbett, M. (1993). SUMI: The Software Usability Measurement Inventory. British Journal of Educational Technology, 24, 210--212.",
      "doi": ""
    },
    {
      "text": "Lewis, J. R. (1995). IBM computer usability satisfaction questionnaires: Psychometric evaluation and instructions for use. International Journal of Human-Computer Interaction, 7, 57--78.  ",
      "doi": "10.1080/10447319509526110"
    },
    {
      "text": "Lewis, J. R. (2002). Psychometric evaluation of the PSSUQ using data from five years of usability studies. International Journal of Human-Computer Interaction, 14(3&amp;#38;4), 463--488.",
      "doi": ""
    },
    {
      "text": "Lewis, J. R (2006). Usability testing. In G. Salvendy (Ed.), Handbook of Human Factors and Ergonomics (3rd ed.) (pp. 1275--1316). New York, NY: John Wiley.",
      "doi": ""
    },
    {
      "text": "Lewis, J. R., &amp;#38; Sauro, J. (2009). The factor structure of the System Usability Scale. In M. Kurosu (Ed.), Human Centered Design, HCII 2009 (pp. 94--103). Berlin, Germany: Springer-Verlag.  ",
      "doi": "10.1007/978-3-642-02806-9_12"
    },
    {
      "text": "Lewis, J. R. (2011). Practical speech user interface design. Boca Raton, FL: Taylor &amp;#38; Francis. ",
      "doi": "10.5555/1965361"
    },
    {
      "text": "Nunnally, J. C. (1978). Psychometric theory (2nd ed.). New York, NY: McGraw-Hill.",
      "doi": ""
    },
    {
      "text": "Molich, R., Kirakowski, J., Sauro, J., &amp;#38; Tullis, T., (2009) Comparative Usability Task Measurement Workshop (CUE-8) at the UPA 2009 Conference in Portland, OR.",
      "doi": ""
    },
    {
      "text": "Pilotte, W. J., &amp;#38; Gable, R. K. (1990). The impact of positive and negative item stems on the validity of a computer anxiety scale. Educational and Psychological Measurement, 50, 603--610.",
      "doi": ""
    },
    {
      "text": "Ramos, L. (1993). The effects of on-hold telephone music on the number of premature disconnections to a statewide protective services abuse hot line. Journal of Music Therapy, 30(2), 119--129.",
      "doi": ""
    },
    {
      "text": "Sauro, J. (2010). That's the worst website ever!: Effects of extreme survey items. www.measuringusability.com/blog/extreme-items.php (last viewed 9/23/2010).",
      "doi": ""
    },
    {
      "text": "Schmitt N., &amp;#38; Stuits, D. (1985) Factors defined by negatively keyed items: The result of careless respondents? Applied Psychological Measurement, 9(4), 367--373.",
      "doi": ""
    },
    {
      "text": "Schriesheim, C. A., &amp;#38; Hill, K. D. (1981). Controlling acquiescence response bias by item reversals: the effect on questionnaire validity. Educational and Psychological Measurement, 41(4), 1101--1114.",
      "doi": ""
    },
    {
      "text": "Spector, P., Van Katwyk, P., Brannick, M., &amp;#38; Chen, P. (1997). When two factors don\"t reflect two constructs: How item characteristics can produce artifactual factors. Journal of Management, 23(5), 659--677.",
      "doi": ""
    },
    {
      "text": "Stewart, T. J., &amp;#38; Frye, A. W. (2004). Investigating the use of negatively-phrased survey items in medical education settings: Common wisdom or common mistake? Academic Medicine, 79(10 Supplement), S1--S3.",
      "doi": ""
    },
    {
      "text": "SPSS. (2003). SPSS for Windows, Rel. 12.0.1. (2003). Chicago, IL: SPSS Inc.",
      "doi": ""
    },
    {
      "text": "Thurstone, L. L. (1928). Attitudes can be measured. American Journal of Sociology, 33, 529--554.",
      "doi": ""
    },
    {
      "text": "Weijters, B., Cabooter, E., &amp;#38; Schillewaert, N. (2010). The effect of rating scale format on response styles: the number of response categories and response category labels. International Journal of Research in Marketing, 27, 236--247.",
      "doi": ""
    },
    {
      "text": "Wong, N., Rindfleisch, A., &amp;#38; Burroughs, J. (2003). Do reverse-worded items confound measures in cross-cultural consumer research? The case of the material values scale. Journal of Consumer Research, 30, 72--91.",
      "doi": ""
    },
    {
      "text": "Zviran, M., Glezer, C., &amp;#38; Avni, I. (2006). User satisfaction from commercial web sites: The effect of design and use. Information &amp;#38; Management. 43, 157--178.  ",
      "doi": "10.5555/1140882.1709390"
    }
  ]
}