{
  "doi": "10.1145/1978942.1979079",
  "title": "How a freeform spatial interface supports simple problem solving tasks",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "925-934",
  "year": 2011,
  "badges": [],
  "abstract": "We developed DataBoard, a freeform spatial interface, to support users in simple problem solving tasks. To develop a deeper understanding of the role of space and the tradeoffs between freeform and structured interaction styles in problem solving tasks, we conducted a controlled user study comparing the DataBoard with a spreadsheet and analyzed video data in detail. Beyond improvements in task performance and memory recall, our observations reveal that freeform interfaces can support users in a variety of ways: representing problems flexibly, developing strategies, executing strategies incrementally, tracking problem state easily, reducing mental computation, and verifying solutions perceptually. The spreadsheet also had advantages, and we discuss the tradeoffs.",
  "tags": [
    "problem solving",
    "spatial interfaces",
    "spreadsheets",
    "freeform interaction"
  ],
  "authors": [
    {
      "name": "Eser Kandogan",
      "institution": "IBM Almaden Research Center, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461646619",
      "orcid": "missing"
    },
    {
      "name": "Juho Kim",
      "institution": "IBM Almaden Research Center, San Jose, California, & Massachusettes Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    },
    {
      "name": "Thomas P. Moran",
      "institution": "IBM Almaden Research Center, San Jose, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594532",
      "orcid": "missing"
    },
    {
      "name": "Pablo Pedemonte",
      "institution": "IBM Argentina, Buenos Aires, Argentina",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Antle, A. N., Droumeva, M. and Ha, D. Thinking with hands: An embodied approach to the analysis of children's interaction with computational objects. In Proc. CHI '09, ACM, 2009, 3961--3966.  ",
      "doi": "10.1145/1520340.1520612"
    },
    {
      "text": "Arias, E., Eden, H., Fischer, G., Gorman, A., and Scharff, E. 2000. Transcending the individual human mind - creating shared understanding through collaborative design. ACM Trans. Comput.-Hum. Interact. 7, 1 (March 2000), 84--113.  ",
      "doi": "10.1145/344949.345015"
    },
    {
      "text": "Agarawala, A. and Balakrishnan, R. 2006. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. In Proc. CHI '06. ACM, 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Bailey, B. P. and J. A. Konstan. Are Informal Tools Better? Comparing DEMAIS, Pencil and Paper, and Authorware for Early Multimedia Design. In Proc. CHI '03, ACM, 2003, 313--320.  ",
      "doi": "10.1145/642611.642666"
    },
    {
      "text": "Burnett, M., Atwood, J., Djang, R., Gottfried, H., Reichwein, J., Yang., S. Forms/3: A First-Order Visual Language to Explore the Boundaries of the Spreadsheet Paradigm, Journal of Functional Programming 11(2), March 2001, 155--206. ",
      "doi": "10.5555/968486.968487"
    },
    {
      "text": "Ekstrom, R. B., French, J. W., Harman, H. H., and Derman D. (1976). Manual for Kit of Factor-Referenced Cognitive Tests. Princeton, NJ: Educational Testing Service.",
      "doi": ""
    },
    {
      "text": "Hailpern, J., Hinterbichler, E., Leppert, C., Cook, D., and Bailey, B. P. 2007. TEAM STORM: Demonstrating an interaction model for working with multiple ideas during creative group work. In Proc. Creativity &amp;#38; Cognition (C&amp;#38;C '07). ACM, 2007, 193--202.  ",
      "doi": "10.1145/1254960.1254987"
    },
    {
      "text": "Hinckley, K., Zhao, S., Sarin, R., Baudisch, P., Cutrell, E., Shilman, M, Tan, D. InkSeine: In Situ search for active note taking, In Proc. CHI '07, ACM, 2007, 251--260.  ",
      "doi": "10.1145/1240624.1240666"
    },
    {
      "text": "Jacob, R. J., Ishii, H., Pangaro, G., and Patten, J. 2002. A tangible interface for organizing information using a grid. In Proc. CHI '02, ACM, 2002, 339--346.  ",
      "doi": "10.1145/503376.503437"
    },
    {
      "text": "Jones, W. P. and Dumais, S. T. 1986. The spatial metaphor for user interfaces: experimental tests of reference by location versus name. ACM Trans. Inf. Syst. 4, 1 (Jan. 1986), 42--63.  ",
      "doi": "10.1145/5401.5405"
    },
    {
      "text": "Kang, H., Bederson, B. B., Suh, B. Capture, Annotate, Browse, Find, Share: Novel Interfaces for Personal Photo Management. Int. J. Hum. Comput. Interaction 23(3): 315--337 (2007).",
      "doi": ""
    },
    {
      "text": "Kirsh, D. The intelligent use of space, Artificial Intelligence, v.73 n.1-2, p.31--68, Feb. 1995.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Kirsh, D. and Maglio, P. On Distinguishing Epistemic from Pragmatic Action. Cognitive Science 18, (1994), 513--549.",
      "doi": ""
    },
    {
      "text": "Lansdale, M. W. Remembering about documents: memory for appearance, format, and location. Ergonomics, 34, 8 (1991), 1161--1178.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. How do People Organize their Desks? Implications for the Design of Office Information Systems. ACM Transactions on Office Information Systems 1, 1 (January 1983), 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Mandler, J. M., Seefmiller, D., Day, J. On the coding of spatial information. Memory &amp;#38; Cognition 5, 1 (1997), 10--16.",
      "doi": ""
    },
    {
      "text": "Millen, D. R., Schriefer, A., Lehder, D. Z., and Dray, S. M. 1997. Mind maps and causal models: using graphical representations of field research data. In CHI '97 Extended Abstracts, ACM, 265--266.  ",
      "doi": "10.1145/1120212.1120384"
    },
    {
      "text": "Moran, T. P., van Melle, W., and Chiu, P. 1998. Spatial interpretation of domain objects integrated into a freeform electronic whiteboard. In Proc. UIST '98. ACM, 1998, 175--184.  ",
      "doi": "10.1145/288392.288600"
    },
    {
      "text": "Naveh-Benjamin, M. Coding of Spatial Location Information: An Automatic Process? Journal of Experimental Psychology: Learning, Memory, and Cognition 13, 4 (1987), 595--605.",
      "doi": ""
    },
    {
      "text": "Norman, D., &amp;#38; Hutchins, E. Computation via direct manipulation. Final Report to Office of Naval Research, Contract No. NOOO14-85-C-0133. University of California, San Diego, 1988.",
      "doi": ""
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D. C., Thiel, D., van Dantzich, M. Data Mountain: Using Spatial Memory for Document Management. In Proc. UIST '98, ACM. 1998, 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Warr, A. and O'Neill, E. Tool Support for Creativity using Externalisations. In Proc. Creativity and Cognition (C &amp;#38; C '07). ACM, 2007, 127--136.  ",
      "doi": "10.1145/1254960.1254979"
    },
    {
      "text": "Zhang, J. The Nature of External Representations in Problem Solving. Cognitive Science 21, 2 (1997), 179--217.",
      "doi": ""
    },
    {
      "text": "Zhang, J. and Norman, D. A. Representations in Distributed Cognitive Tasks. Cognitive Science 18, 1 (1994), 87--122.",
      "doi": ""
    }
  ]
}