{
  "doi": "10.1145/1978942.1978981",
  "title": "Bodily orientations around mobiles: lessons learnt in vanuatu",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "277-286",
  "year": 2011,
  "badges": [],
  "abstract": "Since we started carrying mobiles phones, they have altered the ways in which we orient our bodies in the world. Many of those changes are invisible to us - they have become habits, deeply engrained in our society. To make us more aware of our bodily ways of living with mobiles and open the design space for novel ways of designing mobiles and their interactions, we decided to study one of the last groups of users on earth who had not been exposed to mobiles: the people of Vanuatu. As they had so recently started using mobiles, their use was still in flux: the fragility of the mobile was unusual to them as was the need to move in order to find coverage. They were still getting used to carrying their mobiles and keeping them safe. Their encounters with mobile use exposed the need to consider somaesthetics practices when designing mobiles as they profoundly affect our bodily ways of being in the world.",
  "authors": [
    {
      "name": "Pedro Ferreira",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388596914",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    }
  ],
  "references": [
    {
      "text": "2009 National Census of Population and Housing. Vanuatu National Statistics Office, Port Vila, Vanuatu, 2009.",
      "doi": ""
    },
    {
      "text": "Bødker, S. When second wave HCI meets third wave challenges. NordiCHI '06: Proceedings of the 4th Nordic conference on Human-computer interaction, ACM (2006), 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Chalmers, M. and MacColl, I. Seamful and seamless design in ubiquitous computing. Workshop At the Crossroads: The Interaction of HCI and Systems Issues in UbiComp, (2003).",
      "doi": ""
    },
    {
      "text": "Chalmers, M., Dieberger, A., Höök, K. and Rudström, Å. Social Navigation and Seamful Design. In Japanese Journal of Cognitive Science, Special Issue on Social Navigation, (2004), 171--181.",
      "doi": ""
    },
    {
      "text": "Dourish, P. Where the Action Is: The Foundations of Embodied Interaction (Bradford Books). The MIT Press, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Dourish, P. Implications for design. Proceedings of the SIGCHI conference on Human Factors in computing systems, (2006), 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Höök, K. Transferring Qualities from Horseback Rid-ing to Design. Proceeding of the 2010 Nordic conference on Human factors in computing systems, (2010).  ",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Isbister, K. and Höök, K. On being supple: in search of rigor without rigidity in meeting new design and evaluation challenges for HCI practitioners. CHI '09: Proceedings of the 27th international conference on Human factors in computing systems, ACM (2009), 2233--2242.  ",
      "doi": "10.1145/1518701.1519042"
    },
    {
      "text": "Juhlin, O. and Weilenmann, A. Hunting for fun. Proceedings of the 2008 ACM conference on Computer supported cooperative work, (2008), 57--66.  ",
      "doi": "10.1145/1460563.1460575"
    },
    {
      "text": "Longo, G. O. Body and Technology: Continuity or Discontinuity? In Mediating the Human Body: Technology, Communication, and Fashion. Lawrence Erlbaum & Associates.",
      "doi": ""
    },
    {
      "text": "Löwgren, J. and Stolterman, E. Thoughtful interaction design: A design perspective on information technology. MIT Press, 2007. ",
      "doi": "10.5555/1206469"
    },
    {
      "text": "Matthews, B. and Ross, L. Research Methods: A prac-tical guide for the social sciences. Pearson Education Limited, 2010.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. and Wright, P. Technology as Experience. The MIT Press, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Moen, J. From hand-held to body-worn: embodied experiences of the design and use of a wearable movement-based interaction concept. TEI '07: Proceedings of the 1st international conference on Tangible and embedded interaction, ACM (2007), 251--258.  ",
      "doi": "10.1145/1226969.1227021"
    },
    {
      "text": "Peck, J. G. and Gregory, R. J. A Brief Overview of the Old New Hebrides. Anthropologist 7, 4 (2005), 269--282.",
      "doi": ""
    },
    {
      "text": "Schiphorst, T. soft(n): toward a somaesthetics of touch. CHI '09: Proceedings of the 27th international conference extended abstracts on Human factors in computing systems, ACM (2009), 2427--2438.  ",
      "doi": "10.1145/1520340.1520345"
    },
    {
      "text": "Shklovski, I., Kraut, R., and Cummings, J. Keeping in touch by technology: maintaining friendships after a residential move. CHI '08: Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM (2008), 807--816.  ",
      "doi": "10.1145/1357054.1357182"
    },
    {
      "text": "Shklovski, I. A. and Mainwaring, S. D. Exploring technology adoption and use through the lens of residential mobility. CHI '05: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2005), 621--630.  ",
      "doi": "10.1145/1054972.1055058"
    },
    {
      "text": "Shusterman, R. Body Consciousness: A Philosophy of Mindfulness and Somaesthetics. Cambridge University Press, 2008.",
      "doi": ""
    },
    {
      "text": "Sijapati-Basnett, B. Social and economic impact of introducing telecommunications throughout Vanuatu. Pacific Institute of Public Policy, 2009.",
      "doi": ""
    },
    {
      "text": "Sundström, P. and Höök, K. Hand in hand with the material: designing for suppleness. CHI '10: Proceedings of the 28th international conference on Human factors in computing systems, ACM (2010), 463--472.  ",
      "doi": "10.1145/1753326.1753396"
    },
    {
      "text": "Sundström, P., Ståhl, A., and Höök, K. eMoto: affectively involving both body and mind. CHI '05: CHI '05 extended abstracts on Human factors in computing systems, ACM (2005), 2005--2008.  ",
      "doi": "10.1145/1056808.1057078"
    },
    {
      "text": "Tholander, J. and Johansson, C. Design qualities for whole body interaction - learning from golf, skate-boarding and bodybugging.",
      "doi": ""
    },
    {
      "text": "Troshynski, E., Lee, C., and Dourish, P. Accountabilities of presence: reframing location-based systems. Proceeding of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, (2008), 487--496.  ",
      "doi": "10.1145/1357054.1357133"
    }
  ]
}