{
  "doi": "10.1145/1978942.1979052",
  "title": "Introverted elves & conscientious gnomes: the expression of personality in world of warcraft",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "753-762",
  "year": 2011,
  "badges": [],
  "abstract": "Personality inference can be used for dynamic personalization of content or system customization. In this study, we examined whether and how personality is expressed in Virtual Worlds (VWs). Survey data from 1,040 World of Warcraft players containing demographic and personality variables was paired with their VW behavioral metrics over a four-month period. Many behavioral cues in VWs were found to be related to personality. For example, Extraverts prefer group activities over solo activities. We also found that these behavioral indicators can be used to infer a player's personality.",
  "tags": [
    "personality",
    "virtual worlds",
    "inference",
    "online games",
    "big 5"
  ],
  "authors": [
    {
      "name": "Nick Yee",
      "institution": "PARC, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319504922",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Ducheneaut",
      "institution": "PARC, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81100116901/rel-imgonly/nic_photo.jpg",
      "acmid": "81100116901",
      "orcid": "missing"
    },
    {
      "name": "Les Nelson",
      "institution": "PARC, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100407787",
      "orcid": "missing"
    },
    {
      "name": "Peter Likarish",
      "institution": "University of Iowa, Iowa City, Iowa, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438597735",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Au, W. Linden Suburban Home Owners More Likely To Treat Their Place As Extension of the Real Life Self, Academic Suggests. New World Notes. http://nwn.blogs.com/nwn/2010/04/linden-homes-study.html",
      "doi": ""
    },
    {
      "text": "Back, M., Schukle, S. and Egloff, B. How extraverted is honey.bunny77@hotmail.de? Inferring personality from e-mail addresses. Journal of Research in Personality, 42 (2008), 1116--1122.",
      "doi": ""
    },
    {
      "text": "Back, M., Stopfer, J., Vazire, S., Gaddis, S., Schmukle, S., Egloff, B. and Gosling, S. Facebook profiles reflect actual personality not self-idealization. Psychological Science, 21 (2010), 372--374.",
      "doi": ""
    },
    {
      "text": "Bessiere, K., Seay, A. and Kiesler, S. The Ideal Elf: Identity Exploration in World of Warcraft. CyberPsychology and Behavior, 10 (2007), 530--535.",
      "doi": ""
    },
    {
      "text": "Carroll, J. and Carolin, P. Relationship between game playing and personality. Psychological Reports, 64 (1989), 705--706.",
      "doi": ""
    },
    {
      "text": "Cohen, J. Statistical Power Analysis. Lawrence Erlbaum Associates, 1988.",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N., Wen, M., Yee, N. and Wadley, G. Body and mind: a study of avatar personalization in three virtual worlds. Proceedings of CHI, 1 (2009), 1151--1160.  ",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E. and Moore, R. The life and death of online gaming communities: a look at guilds in World of Warcraft. CHI 2007 Proceedings (2007), 839--848.  ",
      "doi": "10.1145/1240624.1240750"
    },
    {
      "text": "Funder, D. and Sneed, C. Behavioral Manifestations of Personality: An Ecological Approach to Judgmental Accuracy. Journal of Personality and Social Psychology, 64 (1993), 479--490.",
      "doi": ""
    },
    {
      "text": "Gill, A., Oberlander, J. and Austin, E. Rating E-mail Personality at Zero Acquaintance. Personality and Individual Differences, 40 (2006), 497--507.",
      "doi": ""
    },
    {
      "text": "Goldberg, L. A broad-bandwidth, public domain, personality inventory measuring the lower-level facets of several five-factor models. in Mervielde, I., Deary, I., De Fruyt, F. and Ostendorf, F. eds. Personality Psychology in Europe, Tilburg University Press, Tilburg, The Netherlands, 1999, 7--28.",
      "doi": ""
    },
    {
      "text": "Gosling, S., Ko, S., Mannarelli, T. and Morris, M. A Room with a cue: Judgments of personality based on offices and bedrooms. Journal of Personality and Social Psychology, 82 (2002), 379--398.",
      "doi": ""
    },
    {
      "text": "Hancock, J., Toma, C. and Ellison, N. The truth about lying in online dating profiles. Proceedings of CHI 2007, 1 (2007), 449--452.  ",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Harper, F., Frankowski, D., Drenner, S., Ren, Y.Q., Kiesler, S., Terveen, L., Kraut, R. and Riedl, J. Talk Amongst Yourselves: Inviting Users to Participate in Online Conversations. IUI 2007 (2007), 62--71.  ",
      "doi": "10.1145/1216295.1216313"
    },
    {
      "text": "Kenny, D., Horner, C., Kashy, D. and Chu, L. Consensus at zero acquaintance: Replication, behavioral cues, and stability. Journal of Personality and Social Psychology, 62 (1992), 88--97.",
      "doi": ""
    },
    {
      "text": "Mackay, W. Triggers and Barriers to Customizing Software. Proceedings of SIGCHI 1991, 1 (1991), 153--160.  ",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "Mairesse, F. and Walker, M. Automatic Recognition of Personality in Conversation. Proceedings of the Human Language Technology Conference, 1 (2006), 85--88. ",
      "doi": "10.5555/1614049.1614071"
    },
    {
      "text": "Marcus, B., Machilek, F. and Schutz, A. Personality in Cyberspace: Personal Web Sites as Media for Personality Expressions and Impressiosn. Journal of Personality and Social Psychology, 90 (2006), 1014--1031.",
      "doi": ""
    },
    {
      "text": "McNee, S., Riedl, J. and Konstan, J. Making Recommendations Better: An Analytic Model for Human-Recommender Interaction. CHI 2006 (2006), 1103--1108.  ",
      "doi": "10.1145/1125451.1125660"
    },
    {
      "text": "Mehl, M., Gosling, S. and Pennebaker, J. Personality in Its Natural Habitat: Manifestations and Implicit Folk Theories of Personality in Daily Life. Journal of Personality and Social Psychology, 90 (2006), 862--877.",
      "doi": ""
    },
    {
      "text": "Mehl, M. and Pennebaker, J. The Sounds of Social Life: A Psychometric Analysis of Students' Daily Social Environment and Natural Conversations. Journal of Personality and Social Psychology, 84 (2003), 857--870.",
      "doi": ""
    },
    {
      "text": "Nardi, B. and Harris, J. Strangers and Friends: Collaborative Play in World of Warcraft. CSCW 2006 (2006), 149--158.  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Rentfrow, P. and Gosling, S. Message in a Ballad: The Role of Music Preferences in Interpersonal Perception. Psychological Science, 17 (2006), 236--242.",
      "doi": ""
    },
    {
      "text": "Riecken, D. Personalized Views of Personalization. Communications of the ACM, 43 (2000), 26--28.  ",
      "doi": "10.1145/345124.345133"
    },
    {
      "text": "Sherman, R. and Funder, D. Evaluating correlations in studies of personality and behavior: Beyond the number of significant findings to be expected by chance. Journal of Research in Personality, 43 (2009), 1053--1063.",
      "doi": ""
    },
    {
      "text": "Simon, A. Emotional stability pertaining to the game of Dungeons and Dragons. Psychology in the Schools, 24 (1987), 329--332.",
      "doi": ""
    },
    {
      "text": "Turkle, S. Life on the Screen: Identity in the Age of the Internet. New York: Simon and Schuster., 1995. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Vazire, S. and Gosling, S. e-Perceptions: Personality Impressions Based on Personal Websites. Journal of Personality and Social Psychology, 87 (2004), 123--132.",
      "doi": ""
    },
    {
      "text": "Webb, E., Campbell, D., Schwartz, R. and Sechrest, L. Unobtrusive measures: non-reactive research in the social sciences. Rand McNalley, Chicago, 1966.",
      "doi": ""
    },
    {
      "text": "White, P. MMOGData: Charts. 2009 (2008).",
      "doi": ""
    },
    {
      "text": "Williams, D., Yee, N. and Caplan, S. Who plays, how much, and why? Debunking the stereotypical gamer profile. Journal of Computer-Mediated Communication, 13 (2008), 993--1018.",
      "doi": ""
    },
    {
      "text": "Yarkoni, T. Personality in 100,000 Words: A large scale analysis of personality and word use among bloggers. Journal of Research in Personality (in press).",
      "doi": ""
    },
    {
      "text": "Yee, N. The demographics, motivations, and derived experiences of users of massively multi-user online graphical environments. Presence: Teleoperators and Virtual Environments, 15 (2006), 309--329.  ",
      "doi": "10.1162/pres.15.3.309"
    },
    {
      "text": "Yee, N. The \"Impossible\" Romance. The Daedalus Project. http://www.nickyee.com/daedalus/archives/001534.php",
      "doi": ""
    },
    {
      "text": "Yee, N., Harris, H., Jabon, M. and Bailenson, J. The Expression of Personality in Virtual Worlds. Social Psychological &amp;#38; Personality Science (in press).",
      "doi": ""
    }
  ]
}