{
  "doi": "10.1145/1978942.1979141",
  "title": "Eden: a professional multitouch tool for constructing virtual organic environments",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1343-1352",
  "year": 2011,
  "badges": [],
  "abstract": "Set construction is the process of selecting and positioning virtual geometric objects to create a virtual environment used in a computer-animated film. Set construction artists often have a clear mental image of the set composition, but find it tedious to build their intended sets with current mouse and keyboard interfaces. We investigate whether multitouch input can ease the process of set construction. Working with a professional set construction artist at Pixar Animation Studios, we designed and developed Eden, a fully functional multitouch set construction application. In this paper, we describe our design process and how we balanced the advantages and disadvantages of multitouch input to develop usable gestures for set construction. Based on our design process and the user experiences of two set construction artists, we present a general set of lessons we learned regarding the design of a multitouch interface.",
  "authors": [
    {
      "name": "Kenrick Kin",
      "institution": "Pixar Animation Studios, Emeryville, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435604849",
      "orcid": "0000-0002-3956-9793"
    },
    {
      "name": "Tom Miller",
      "institution": "Pixar Animation Studios, Emeryville, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484646812",
      "orcid": "missing"
    },
    {
      "name": "Björn Bollensdorff",
      "institution": "Technische Universität Berlin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421598506",
      "orcid": "missing"
    },
    {
      "name": "Tony DeRose",
      "institution": "Pixar Animation Studios, Emeryville, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493833",
      "orcid": "missing"
    },
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Autodesk Maya. http://www.autodesk.com/.",
      "doi": ""
    },
    {
      "text": "S. Bae, R. Balakrishnan, and K. Singh. ILoveSketch: As-natural-as-possible sketching system for creating 3D curve models. Proc. UIST 2008, pages 151--160, 2008.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "H. Benko, A. Wilson, and P. Baudisch. Precise selection techniques for multi-touch screens. Proc. CHI 2006, pages 1263--1272, 2006.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "E. Bier. Snap-dragging in three dimensions. Symposium on Interactive 3D Graphics, 24:193--204, 1990.  ",
      "doi": "10.1145/91385.91446"
    },
    {
      "text": "P. Brandl, C. Forlines, D. Wigdor, M. Haller, and C. Shen. Combining and measuring the benefits of bimanual pen and direct-touch interaction on horizontal interfaces. Proc. AVI 2008, pages 154--161, 2008.  ",
      "doi": "10.1145/1385569.1385595"
    },
    {
      "text": "R. Bukowski and C. Sequin. Object associations: a simple and practical approach to virtual 3D manipulation. Symposium of Interactive 3D Graphics, pages 131--138, 1995.  ",
      "doi": "10.1145/199404.199427"
    },
    {
      "text": "X. Cao, A. Wilson, R. Balakrishnan, K. Hinckley, and S. Hudson. ShapeTouch: Leveraging contact shape on interactive surfaces. Proc. Tabletop 2008, pages 129--136, 2008.",
      "doi": ""
    },
    {
      "text": "M. Cardinaels, K. Frederix, J. Nulens, D. Van Rijsselbergen, M. Verwaest, and P. Bekaert. A multi-touch 3D set modeler for drama production. Proc. International Broadcasting Convention 2008, pages 330--335, 2008.",
      "doi": ""
    },
    {
      "text": "T. Erickson. The design and long-term use of a personal electronic notebook: a reflective analysis. Proc. CHI 1996, pages 11--18, 1996.  ",
      "doi": "10.1145/238386.238392"
    },
    {
      "text": "C. Forlines, D. Wigdor, C. Shen, and R. Balakrishnan. Direct-touch vs. mouse input for tabletop displays. Proc. CHI 2007, pages 647--656, 2007.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "B. Froehlich, J. Hochstrate, V. Skuk, and A. Huckauf. The GlobeFish and the GlobeMouse: two new six degree of freedom input devices for graphics applications. Proc. CHI 2006, pages 191--199, 2006.  ",
      "doi": "10.1145/1124772.1124802"
    },
    {
      "text": "S. Gabrielli, S. Bellutti, A. Jameson, C. Leonardi, and M. Zancanaro. A single-user tabletop card game system for older persons: General lessons learned from an in-situ study. Proc. Tabletop 2008, pages 85--88, 2008.",
      "doi": ""
    },
    {
      "text": "Y. Guiard. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior, 19(4):486--517, 1987.",
      "doi": ""
    },
    {
      "text": "J. Han. Low-cost multi-touch sensing through frustrated total internal reflection. Proc. UIST 2005, pages 115--118, 2005.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "M. Hancock, S. Carpendale, and A. Cockburn. Shallow-depth 3D interaction: design and evaluation of one-, two- and three-touch techniques. Proc. CHI 2007, pages 1147--1156, 2007.  ",
      "doi": "10.1145/1240624.1240798"
    },
    {
      "text": "S. Houde. Iterative design of an interface for easy 3-D direct manipulation. Proc. CHI 1992, pages 135--142, 1992.  ",
      "doi": "10.1145/142750.142772"
    },
    {
      "text": "D. Kaser, M. Agrawala, and M. Pauly. FingerGlass: Efficient multiscale interaction on multitouch screens. Proc. CHI 2011, 2011.  ",
      "doi": "10.1145/1978942.1979175"
    },
    {
      "text": "K. Kin, M. Agrawala, and T. DeRose. Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation. Proc. GI 2009, pages 119--124, 2009. ",
      "doi": "10.5555/1555880.1555910"
    },
    {
      "text": "M. Kobayashi and T. Igarashi. Boomerang: Suspendable drag-and-drop interactions based on a throw-and-catch metaphor. Proc. UIST 2007, pages 187--190, 2007.  ",
      "doi": "10.1145/1294211.1294243"
    },
    {
      "text": "M. Masliah and P. Milgram. Measuring the allocation of control in a 6 degree-of-freedom docking experiment. Proc. CHI 2000, pages 25--32, 2000.  ",
      "doi": "10.1145/332040.332403"
    },
    {
      "text": "M. Morris, J. Wobbrock, and A. Wilson. Understanding users' preferences for surface gestures. Proc. GI 2010, pages 261--268, 2010. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "T. Moscovich. Contact area interaction with sliding widgets. Proc. UIST 2009, pages 13--22, 2009.  ",
      "doi": "10.1145/1622176.1622181"
    },
    {
      "text": "J. Oh and W. Stuerzlinger. Moving objects with 2D input devices in cad systems and desktop virtual environments. Proc. GI 2005, pages 195--202, 2005. ",
      "doi": "10.5555/1089508.1089541"
    },
    {
      "text": "P. Peltonen, E. Kurvinen, A. Salovaara, G. Jacucci, T. Ilmonen, J. Evans, A. Oulasvirta, and P. Saarikko. It's mine, don't touch!: interactions at a large multi-touch display in a city centre. Proc. CHI 2008, pages 1285--1294, 2008.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "R. L. Potter, L. J. Weldon, and B. Shneiderman. Improving the accuracy of touch screens: an experimental evaluation of three strategies. Proc. CHI 1988, pages 27--32, 1988.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "J. Raskin. The Humane Interface. Addison Wesley, 2000.",
      "doi": ""
    },
    {
      "text": "J. Reisman, P. Davidson, and J. Han. A screen-space formulation for 2D and 3D direct manipulation. Proc. UIST 2009, pages 69--78, 2009.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "A. Sears and B. Shneiderman. High precision touchscreens: design strategies and comparisons with a mouse. International Journal of Man-Machine Studies, 34(4):593--613, 1991.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "M. Shinya and M. Forgue. Laying out objects with geometric and physical constraints. The Visual Computer, 11(4):188--201, 1995.",
      "doi": ""
    },
    {
      "text": "D. Vogel and R. Balakrishnan. Occlusion-aware interfaces. Proc. CHI 2010, pages 263--272, 2010.  ",
      "doi": "10.1145/1753326.1753365"
    },
    {
      "text": "D. Vogel and P. Baudisch. Shift: A technique for operating pen-based interfaces using touch. Proc. CHI 2007, pages 657--666, 2007.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "F. Wang, X. Cao, X. Ren, and P. Irani. Detecting and leveraging finger orientation for interaction with direct-touch surfaces. Proc. UIST 2009, pages 23--32, 2009.  ",
      "doi": "10.1145/1622176.1622182"
    },
    {
      "text": "C. Ware and D. Jessom. Using the Bat: a six-dimensional mouse for object placement. IEEE Computer Graphics &amp;#38; Applications, 8(6):65--70, 1988.  ",
      "doi": "10.1109/38.20319"
    },
    {
      "text": "D. Wigdor, G. Perm, K. Ryall, A. Esenther, and C. Shen. Living with a tabletop: Analysis and observations of long term office use of a multi-touch table. Proc. Tabletop 2007, pages 60--67, 2007.",
      "doi": ""
    },
    {
      "text": "A. Wilson, S. Izadi, O. Hilliges, A. Garcia-Mendoza, and D. Kirk. Bringing physics to the surface. Proc. UIST 2008, pages 67--76, 2008.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "J. Wobbrock, M. Morris, and A. Wilson. User-defined gestures for surface computing. Proc. CHI 2009, pages 1083--1092, 2009.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "J. Wobbrock, A. Wilson, and Y. Li. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. Proc. UIST 2007, pages 159--168, 2007.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "M. Wu and R. Balakrishnan. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. Proc. UIST 2003, pages 193--202, 2003.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "M. Wu, C. Shen, K. Ryall, C. Forlines, and R. Balakrishnan. Gesture registration, relaxation, and reuse for multi-point direct-touch surfaces. Proc. Tabletop 2006, pages 185--192, 2006.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    },
    {
      "text": "K. Xu, J. Stewart, and E. Flume. Constraint-based automatic placement for scene composition. Proc. GI 2002, pages 25--34, 2002.",
      "doi": ""
    },
    {
      "text": "R. Yeh, C. Liao, S. Klemmer, F. Guimbretire, B. Lee, B. Kakaradov, J. Stamberger, and A. Paepcke. ButterflyNet: a mobile capture and access system for field biology research. Proc. CHI 2006, pages 571--580, 2006.  ",
      "doi": "10.1145/1124772.1124859"
    },
    {
      "text": "R. Zeleznik, K. Herndon, and J. Hughes. Sketch: an interface for sketching 3D scenes. Proc. SIGGRAPH 1996, pages 163--170, 1996.  ",
      "doi": "10.1145/237170.237238"
    },
    {
      "text": "T. Zimmerman, J. Lanier, C. Blanchard, S. Bryson, and Y. Harvill. A hand gesture interface device. Proc. CHI 1987, pages 189--192, 1987.  ",
      "doi": "10.1145/29933.275628"
    }
  ]
}