{
  "doi": "10.1145/1978942.1979153",
  "title": "Adapting usability testing for oral, rural users",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1437-1440",
  "year": 2011,
  "badges": [],
  "abstract": "Traditional usability methods are of limited use when evaluating systems designed for distant, diverse populations. In this paper, we describe a study conducted in two Ghanaian villages that evaluated an audio computer designed for people living in oral cultures. Informed by ICTD and orality-grounded HCID, we modified existing usability testing practices and we reflect on the utility of these adaptations. We found that conducting a culturally appropriate study often meant forgoing more traditional approaches in favor of flexible, opportunistic methods. We acknowledge the challenges of adapting traditional usability methods for oral, rural users. However, we found that by implementing strategic modifications led by local staff, our study produced valuable, actionable results.",
  "tags": [
    "standards",
    "usability testing",
    "illiteracy",
    "ictd",
    "audio technology",
    "user-centered design",
    "methodologies",
    "oral cultures"
  ],
  "authors": [
    {
      "name": "Trina Gorman",
      "institution": "Literacy Bridge, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640438",
      "orcid": "missing"
    },
    {
      "name": "Emma Rose",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81328490167/rel-imgonly/emmarose_bio.jpg",
      "acmid": "81328490167",
      "orcid": "missing"
    },
    {
      "name": "Judith Yaaqoubi",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655779",
      "orcid": "missing"
    },
    {
      "name": "Andrew Bayor",
      "institution": "Literacy Bridge, Dafiama, Ghana",
      "img": "/do/10.1145/contrib-81484656384/rel-imgonly/wednesday-students-19.jpg",
      "acmid": "81484656384",
      "orcid": "missing"
    },
    {
      "name": "Beth Kolko",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100467325",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Putnam, C., et al., \"Adapting User-Centered Design Methods to Design for Diverse Populations,\" Information Technologies & International Development, vol. 5, 2009.",
      "doi": ""
    },
    {
      "text": "Dumas, J. and Redish, G., A Practical Guide to Usability Testing. Exeter, UK: Intellect, Ltd., 1999. ",
      "doi": "10.5555/600280"
    },
    {
      "text": "Barnum, C., Usability Testing and Research. NewYork: Longman, 2002. ",
      "doi": "10.5555/559526"
    },
    {
      "text": "Winschiers, H., Fendler, J., \"Assumptions Considered Harmful,\" in Usability and Internationalization, ed Berlin: Springer, 2007, pp. 452--261. ",
      "doi": "10.5555/1769821.1769877"
    },
    {
      "text": "Sherwani, J., et al., \"Orality-Grounded HCID: Understanding the Oral User,\" Information Technologies and International Development, vol. 5, pp. 37--49, Dec 16 2009.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Sagar, A., and Toyama, K., \"Text-free user interfaces for illiterate and semiliterate users,\" Information Technologies and International Development, vol. 4, pp. 37--50, 2007.  ",
      "doi": "10.1162/itid.2007.4.1.37"
    },
    {
      "text": "Sambasivan, N., et al., \"Intermediated technology use in developing communities,\" Proceedings of the 28th international conference on Human factors in computing systems, pp. 2583--2592, 2010.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Medhi, I., Prasad, A., and Toyama, K., \"Optimal audio-visual representations for illiterate users of computers,\" Proceedings of the 16th international conference on World Wide Web, p. 882, 2007.  ",
      "doi": "10.1145/1242572.1242690"
    },
    {
      "text": "Medhi, I., Gautama, S., and Toyama, K., \"A comparison of mobile money-transfer uis for non-literate and semi-literate users,\" Proceedings of the 27th international conference on Human factors in computing systems, pp. 1741--1750, 2009.  ",
      "doi": "10.1145/1518701.1518970"
    },
    {
      "text": "Putnam, C., Kolko, B., Rose, E. & Walton, R. (2009)., \"Mobile phone users in Kyrgyzstan: A case study of identifying user needs and requirements,\" in Proceedings of International Professional Communication Conference (IPCC '09), Honolulu, Hawaii, 2009.",
      "doi": ""
    },
    {
      "text": "Kolko, B. E., Wei, C, and J.H. Spyridakis., \"Internet Use in Uzbekistan: Developing a Methodology for Tracking Information Technology Implementation Success,\" Information Technologies and International Development, vol. 1, pp. 1--19, 2003.  ",
      "doi": "10.1162/154475203322981932"
    },
    {
      "text": "Schmidt, C., Gorman, T., Gary, M., Bayor, A. \"Impact of Low-Cost, On-Demand Information Access in a Remote Ghanaian Village.\" Information Technologies and International Development 2010. London.",
      "doi": ""
    }
  ]
}