{
  "doi": "10.1145/1978942.1979291",
  "title": "Second-hand interactions: investigating reacquisition and dispossession practices around domestic objects",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2385-2394",
  "year": 2011,
  "badges": [],
  "abstract": "We present a qualitative study of reacquisition-the acquisition of previously possessed goods-involving in-depth interviews with 18 reacquirers within or nearby Pittsburgh, PA, USA. Based on critiques of sustainable consumption and our findings, we reframe technology consumption as acquisition, possession, dispossession and reacquisition. We present four reacquisition orientations describing our participants' motivations and practices: casual, necessary, critical, and experiential. We then present a range of findings including issues with work, time and effort involved in reacquisition, and values and practices of care and patience associated with invested reacquirers. We conclude with implications for designing technologies to support current reacquisition practices, as well as broader opportunities for HCI and interaction design to incorporate non-mainstream reacquisition practices and values into more mainstream technologies.",
  "authors": [
    {
      "name": "James Pierce",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    },
    {
      "name": "Eric Paulos",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Baudrillard, J. (1968). The system of objects. Verso.",
      "doi": ""
    },
    {
      "text": "Blevis, E. (2007). Sustainable interaction design: invention & disposal, renewal & reuse. Proc. CHI '07.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Blythe, M., Overbeeke, K. Monk, A. & Wright, P. eds. (2004). Funology: from Usability to Enjoyment. Kluwer. ",
      "doi": "10.5555/1139008.1139011"
    },
    {
      "text": "Borgmann, A. (1984). Technology and the character of contemporary life. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Bourdieu, P. (1984). Distinction: A social critique of the judgment of taste. London: Routledge.",
      "doi": ""
    },
    {
      "text": "Buechley et al. (2009). DIY for CHI: methods, communities, and values of reuse. CHI '09 E.A.  ",
      "doi": "10.1145/1520340.1520750"
    },
    {
      "text": "Brynjarsdóttir, H. & Sengers, P. Ubicomp from the Edge of the North Atlantic: Lessons from Fishing Villages in Iceland and Newfoundland. Ubicomp '09 workshop.",
      "doi": ""
    },
    {
      "text": "Cooper, T. (2008). Slower Consumption Reflections on Product Life Spans and the \"Throwaway Society\". Journal of Industrial Ecology, 9(1--2):51--67.",
      "doi": ""
    },
    {
      "text": "Douglas, M. & Isherwood, B. (1979). The world of goods: Towards an anthropology of consumption. Basic books.",
      "doi": ""
    },
    {
      "text": "Fry, T. (2009). Design futuring. Berg.",
      "doi": ""
    },
    {
      "text": "Fry, T. (1994). Remakings. Envirobooks.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Beaver, J.,& Benford, S. (2003).Ambiguity as a resource for design. Proc. CHI '03. 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Glaser, B. & Strauss, A. (1967). Discovery of grounded theory: strategies for qualitative research. Sociology Press.",
      "doi": ""
    },
    {
      "text": "Gregson, N. & Crewe, L. (2003). Second-hand cultures. Berg.",
      "doi": ""
    },
    {
      "text": "Hanks, K., Odom, W., Roedl, D., and Blevis, E. (2008). Sustainable millennials: attitudes towards sustainability and the material effects of interactive technologies. Proc. CHI '08. 333--342.  ",
      "doi": "10.1145/1357054.1357111"
    },
    {
      "text": "Huang & Truong. (2008). Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones. Proc. CHI '08.  ",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Huh, J., Nathan, L. P., Silberman, S., Blevis, E., Tomlinson, B., Sengers, P., & Busse, D. (2010). Examining appropriation, re-use, and maintenance for sustainability. In Ext. Abst. CHI '10. 4457--4460.  ",
      "doi": "10.1145/1753846.1754173"
    },
    {
      "text": "Huh, J., Nam, K., & Sharma, N. 2010. Finding the lost treasure: understanding reuse of used computing devices. In Proc. CHI '10. 1875--187.  ",
      "doi": "10.1145/1753326.1753607"
    },
    {
      "text": "Lastovicka, J. & Fernandez, K. (2005). Three paths to disposition: The movement of meaningful possessions to strangers. Jour. Cons. Research, 31(4):813--823.",
      "doi": ""
    },
    {
      "text": "Lucas, G. (2002). Disposability and Dispossession in the Twentieth Century. Jour. Material Culture, 7(1):5--22.",
      "doi": ""
    },
    {
      "text": "Miles, M. B. & Huberman, A. M. (1994). Qualitative Data Analysis. Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Miller, D, ed. (1998). Material cultures: Why some things matter. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Odom, W., Pierce, J., Stolterman, E., & Blevis, E. (2009). Understanding why we preserve some things and discard others in the context of interaction design. Proc. CHI '09.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "Roux, D. & Kourchia, M. (2006). I am what I wear?: An exploratory study of symbolic meanings associated with secondhand clothing. Advances in cons. research, 33:1--7.",
      "doi": ""
    },
    {
      "text": "Satchell, C. & Dourish, P. Beyond the user: use and non-use in HCI. Proc. OZCHI '09.  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Sengers, P., Boehner, K., David, S., & Kaye, J. (2005). Reflective design. Proc. Critical Computing.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Shove, E. (2003). Comfort, cleanliness & convenience: the social organization of normality. Berg.",
      "doi": ""
    },
    {
      "text": "Thomas, V. M. (2003). Demand and dematerialization impacts of second-hand markets: Reuse or more use? Journal of Industrial Ecology, 7(2): 65--78.",
      "doi": ""
    },
    {
      "text": "Verbeek, P-P. (2005). What things do: philosophical reflections on technology, agency, and design. Penn. Stat.",
      "doi": ""
    },
    {
      "text": "Wakkary & Tanenbaum. (2009). A sustainable identity: the creativity of an everyday designer. Proc. CHI '09.  ",
      "doi": "10.1145/1518701.1518761"
    },
    {
      "text": "3Woodruff et al. (2008). A bright green perspective on sustainable choices. Proc. CHI '08..  ",
      "doi": "10.1145/1357054.1357109"
    }
  ]
}