{
  "doi": "10.1145/1978942.1979390",
  "title": "Materializing the query with facet-streams: a hybrid surface for collaborative search on tabletops",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3013-3022",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We introduce \"Facet-Streams\", a hybrid interactive surface for co-located collaborative product search on a tabletop. Facet-Streams combines techniques of information visualization with tangible and multi-touch interaction to materialize collaborative search on a tabletop. It harnesses the expressive power of facets and Boolean logic without exposing users to complex formal notations. Two user studies reveal how Facet-Streams unifies visual and tangible expressivity with simplicity in interaction, supports different strategies and collaboration styles, and turns product search into a fun and social experience.",
  "authors": [
    {
      "name": "Hans-Christian Jetter",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-81361609796/rel-imgonly/029_hanschristianjetterdr_6307_small.jpg",
      "acmid": "81361609796",
      "orcid": "0000-0001-6502-7114"
    },
    {
      "name": "Jens Gerken",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314482518",
      "orcid": "0000-0002-0634-3931"
    },
    {
      "name": "Michael Zöllner",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436596789",
      "orcid": "missing"
    },
    {
      "name": "Harald Reiterer",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-81100236830/rel-imgonly/reiterer_2021.jpeg",
      "acmid": "81100236830",
      "orcid": "0000-0001-8528-8928"
    },
    {
      "name": "Natasa Milic-Frayling",
      "institution": "Microsoft Research Ltd, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041550",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amershi, S., and Morris, M. R. CoSearch: A system for co-located collaborative web search. In Proc. CHI 2008, ACM (2008), 1647--1656.  ",
      "doi": "10.1145/1357054.1357311"
    },
    {
      "text": "Blackwell, A. and Green, T. Notational Systems -- The Cognitive Dimensions of Notations Framework. In HCI Models, Theories and Frameworks. Morgan Kaufmann, USA, 2003, 103--133.",
      "doi": ""
    },
    {
      "text": "Blackwell, A. F., Stringer, M., Toye, E. F., and Rode, J. A. 2004. Tangible interface for collaborative information retrieval. In CHI 2004 EA. ACM (2004).  ",
      "doi": "10.1145/985921.986093"
    },
    {
      "text": "Borgman, C. L. Why are online catalogs still hard to use? J. Am. Soc. Inf. Sci. 47, 7 (Jul. 1996), 493--503.  ",
      "doi": "10.5555/229068.229072"
    },
    {
      "text": "Dachselt, R., Frisch, M., Weiland, M.: FacetZoom: a continuous multi-scale widget for navigating hierarchical metadata. In Proc. CHI 2008, ACM (2008), 1353--1356.  ",
      "doi": "10.1145/1357054.1357265"
    },
    {
      "text": "Detken, K., Martinez, C., and Schrader, A. The search wall: tangible information searching for children in public libraries. In Proc. TEI 2009. ACM (2009).  ",
      "doi": "10.1145/1517664.1517724"
    },
    {
      "text": "Elmqvist, N., Stasko, J., Tsigas, P. DataMeadow: A Visual Canvas for Analysis of Large-Scale Multivariate Data. Information Visualization 7, 1 (March 2008), 18--33.  ",
      "doi": "10.1145/1391107.1391110"
    },
    {
      "text": "Hansaki, T., Shizuki, B., Misue, K., and Tanaka, J. FindFlow: visual interface for information search based on intermediate results. In Proc. APVIS 2006. ACS (2006), 147--152. ",
      "doi": "10.5555/1151903.1151926"
    },
    {
      "text": "Hartmann, B., Morris, M. R., Benko, H., and Wilson, A. Augmenting interactive tables with mice &amp;#38; keyboards. In Proc. UIST 2009, ACM (2009), 149--152.  ",
      "doi": "10.1145/1622176.1622204"
    },
    {
      "text": "Hearst, M. A. Search User Interfaces. Cambridge University Press, USA, 2009. ",
      "doi": "10.5555/1631268"
    },
    {
      "text": "Heilig, M., Demarmels, M., Rexhausen, S., Huber, S., Runge, O.: Search, explore and navigate - designing a next generation knowledge media workbench. In: Proc. SIDeR 2009, Eindhoven, NL (2009), 40--43.",
      "doi": ""
    },
    {
      "text": "Hornecker, E. and Buur, J. Getting a Grip on Tangible Interaction: A Framework on Physical Space and Social Interaction. In Proc. of CHI 2006. ACM (2006).  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Isenberg, P., and Fisher, D. Collaborative brushing and linking for co-located visual analytics of document collections. In Proc. EuroViz 2009, IEEE (2009).  ",
      "doi": "10.1111/j.1467-8659.2009.01444.x"
    },
    {
      "text": "Jord&amp;#224;, S., Geiger, G., Alonso, M., and Kaltenbrunner, M. The reacTable: exploring the synergy between live music performance and tabletop tangible interfaces. In Proc. TEI 2007. ACM (2007), 139--146.  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Kirk, D., Sellen, A., Taylor, S., Villar, N., and Izadi, S. 2009. Putting the physical into the digital: issues in designing hybrid interactive surfaces. In Proc. HCI UK 2009. BCS (2009), Swinton, UK, 35--44. ",
      "doi": "10.5555/1671011.1671016"
    },
    {
      "text": "Lee, B., Smith, G., Robertson, G. G., Czerwinski, M., Tan, D.: FacetLens: exposing trends and relationships to support sensemaking within faceted datasets. In Proc. CHI 2009, ACM (2009).  ",
      "doi": "10.1145/1518701.1518896"
    },
    {
      "text": "Morris, M. R., Paepcke, A., and Winograd, T. TeamSearch: Comparing techniques for co-present collaborative search of digital media. In Proc. of IEEE Tabletop 2006, IEEE (2006), 97--104.  ",
      "doi": "10.1109/TABLETOP.2006.32"
    },
    {
      "text": "Morris, M. R., Fisher, D. and Wigdor, D. Search on surfaces: Exploring the potential of interactive tabletops for collaborative search tasks. Inf. Processing &amp;#38; Management (2009), Doi:10.1016/j.ipm.2009.10.004.  ",
      "doi": "10.1016/j.ipm.2009.10.004"
    },
    {
      "text": "Morris, M. R., Lombardo, J., and Wigdor, D. WeSearch: Supporting collaborative search and sensemaking on a tabletop display. In Proc. CSCW 2010, ACM (2010), 401--410.  ",
      "doi": "10.1145/1718918.1718987"
    },
    {
      "text": "Morville, P., and Callender, J. Search Patterns - Design for Discovery. O'Reilly Media, USA, 2010. ",
      "doi": "10.5555/1824082"
    },
    {
      "text": "Norman, D. A. The Design of Everyday Things. Basic Books, USA, 2002. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Rogers, Y. and Lindley, S. Collaborating Around Large Interactive Displays: Which Way is Best to Meet? Interacting with Computers, 2004.",
      "doi": ""
    },
    {
      "text": "Ryall, K., Forlines, C., Shen, C., Morris, M. R., and Everitt, K. Experiences with and Observations of Direct-Touch Tabletops. In Proc. TABLETOP 2006. IEEE (2006), 89--96.  ",
      "doi": "10.1109/TABLETOP.2006.12"
    },
    {
      "text": "Shen, C., Lesh, N., Vernier, F., Forlines, C., and Frost, J. Building and sharing digital group histories. In Proc. CSCW 2002, ACM (2002). 324--333.  ",
      "doi": "10.1145/587078.587124"
    },
    {
      "text": "Taylor, S., Izadi, S., Kirk, D., Harper, R., and Garcia-Mendoza, A. Turning the tables: an interactive surface for vjing. In Proc. CHI 2009. ACM (2009).  ",
      "doi": "10.1145/1518701.1518888"
    },
    {
      "text": "Tobiasz, M., Isenberg, P., Carpendale, S.: Lark: Coordinating Co-located Collaboration with Information Visualization. IEEE TVCG 15, 6 (November 2009), 1065--1072.  ",
      "doi": "10.1109/TVCG.2009.162"
    },
    {
      "text": "Ullmer B., Ishii H., and Jacob R. J. K. Tangible Query Interfaces: physically constrained Tokens for manipulating Database Queries. In INTERACT 2003.",
      "doi": ""
    },
    {
      "text": "Young, D. and Shneiderman, B. A graphical filter/flow representation of Boolean queries: a prototype implementation and evaluation. J. Am. Soc. Inf. Sci. 44, 6 (Jul. 1993), 327--339..  ",
      "doi": "10.5555/160921.160924"
    }
  ]
}