{
  "doi": "10.1145/1978942.1979010",
  "title": "Gestural interaction on the steering wheel: reducing the visual demand",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "483-492",
  "year": 2011,
  "badges": [],
  "abstract": "Cars offer an increasing number of infotainment systems as well as comfort functions that can be controlled by the driver. In our research, we investigate new interaction techniques that aim to make it easier to interact with these systems while driving. We suggest utilizing the steering wheel as an additional interaction surface. In this paper, we present two user studies conducted with a working prototype of a multi-touch steering wheel. In the first, we developed a user-defined steering wheel gesture set, and in the second, we applied the identified gestures and compared their application to conventional user interaction with infotainment systems in terms of driver distraction. The main outcome was that driver's visual demand is reduced significantly by using gestural interaction on the multi-touch steering wheel.",
  "authors": [
    {
      "name": "Tanja Döring",
      "institution": "University of Duisburg-Essen, Essen, Germany",
      "img": "/do/10.1145/contrib-81324489053/rel-imgonly/tanja_doering_feb2011.jpg",
      "acmid": "81324489053",
      "orcid": "0000-0001-8648-340X"
    },
    {
      "name": "Dagmar Kern",
      "institution": "University of Duisburg-Essen, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488995",
      "orcid": "missing"
    },
    {
      "name": "Paul Marshall",
      "institution": "University of Warwick, Coventry, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    },
    {
      "name": "Max Pfeiffer",
      "institution": "University of Duisburg-Essen, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460648607",
      "orcid": "missing"
    },
    {
      "name": "Johannes Schöning",
      "institution": "German Research Center for Artificial Intelligence Saarbrücken, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    },
    {
      "name": "Volker Gruhn",
      "institution": "University of Duisburg-Essen, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100633460",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Duisburg-Essen, Essen and University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Bach, K. M., Jæger, M. G., Skov, M. B., Thomassen, N. G. You can touch, but you can't look: interacting with in-vehicle systems. Proc. of CHI '08, ACM, 1139--1148, 2008.  ",
      "doi": "10.1145/1357054.1357233"
    },
    {
      "text": "Ecker, R., Broy, V., Butz, A. and De Luca, A. pieTouch: A Direct Touch Gesture Interface for Interacting with In-Vehicle Information Systems, in Proc. of MobileHCI, ACM, 160--169, 2009.  ",
      "doi": "10.1145/1613858.1613887"
    },
    {
      "text": "Geiser, G. Man Machine Interaction in Vehicles. ATZ 87, 74--77, 1985.",
      "doi": ""
    },
    {
      "text": "González, I. E., Wobbrock, J. O., Chau, D. H., Faulring, A., and Myers, B. A. Eyes on the road, hands on the wheel: thumb-based interaction techniques for input on steering wheels. Proc. of GI '07, 95--102, 2007.  ",
      "doi": "10.1145/1268517.1268535"
    },
    {
      "text": "Green, P. Driver Distraction, Telematics Design, and Workload Managers: Safety Issues and Solutions. Convergence 2004, Detroit, MI, USA, 2004.",
      "doi": ""
    },
    {
      "text": "Han, J. Low-cost multi-touch sensing through frustrated total internal reflection, Proc. of UIST '05, ACM, 115--118, 2005.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Harrison, C. and Hudson, S. E. Providing dynamically changeable physical buttons on a visual display. In Proc. of CHI '09, ACM, 299--308, 2009.  ",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Hoskins, A. H. and El-Gindy, M. Technical Report: Literature Survey on Driving Simulator Validation Studies, International Journal of Heavy Vehicle Systems, Vol. 13, No. 3, 241--252, 2006.",
      "doi": ""
    },
    {
      "text": "Hurtienne, J. and Israel, J. H. Image schemas and their metaphorical extensions: intuitive patterns for tangible interaction. In Proc. of TEI '07. ACM, 127--134, 2007.  ",
      "doi": "10.1145/1226969.1226996"
    },
    {
      "text": "Jacob, R. J., Girouard, A., Hirshfield, L. M., Horn, M. S., Shaer, O., Solovey, E. T., and Zigelbaum, J. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proc. of CHI '08. ACM, 201--210, 2008.  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Kaltenbrunner, M. reacTIVision and TUIO: A Tangible Tabletop Toolkit, Proc. of ITS '09, ACM, 9--16, 2009.  ",
      "doi": "10.1145/1731903.1731906"
    },
    {
      "text": "Kern, D., Schmidt, A., Arnsmann, J., Appelmann, T., Pararasasegaran, N., and Piepiera, B. Writing to your car: handwritten text input while driving. In Proc. of CHI '09 Extended Abstracts. ACM, 4705--4710, 2009.  ",
      "doi": "10.1145/1520340.1520724"
    },
    {
      "text": "Kern, D., Schmidt, A. Design space for driver-based automotive user interfaces. In Proc. of AutomotiveUI '09, ACM, 3--10, 2009.  ",
      "doi": "10.1145/1620509.1620511"
    },
    {
      "text": "Kray, C., Nesbitt, D., Dawson, J., and Rohs, M. User-defined gestures for connecting mobile phones, public displays, and tabletops. In Proc. of MobileHCI '10, ACM, 239--248, 2010.  ",
      "doi": "10.1145/1851600.1851640"
    },
    {
      "text": "Lee, S., Kim, S., Jin, B., Choi, E., Kim, B., Jia, X., Kim, D., and Lee, K. How users manipulate deformable displays as input devices. In Proc. of CHI '10, ACM, 1647--1656, 2010.  ",
      "doi": "10.1145/1753326.1753572"
    },
    {
      "text": "Mattes, S. The lane change task as a tool for driver distraction evaluation. In: Strasser, H., Rausch, H., and Bubb, H. (editors). Quality of Work and Products in Enterprises of the Future. Ergonomia, 2003.",
      "doi": ""
    },
    {
      "text": "Mauney, D., Howarth, J., Wirtanen, A., and Capra, M. Cultural similarities and differences in user-defined gestures for touchscreen user interfaces. In Proc. of CHI Extended Abstracts 2010. ACM, 4015--4020, 2010.  ",
      "doi": "10.1145/1753846.1754095"
    },
    {
      "text": "Norman, D. A. The way I see it: Natural user interfaces are not natural. interactions 17, 3, ACM, 6--10, 2010.  ",
      "doi": "10.1145/1744161.1744163"
    },
    {
      "text": "Pettitt, M. A., Burnett, G. E. and Stevens, A. Defining driver distraction. Proc. of 12th ITS World Congress, San Francisco, USA, ITS America, 2005.",
      "doi": ""
    },
    {
      "text": "Pfeiffer, M., Kern, D., Schöning J., Döring, T., Krüger, A., Schmidt, A. A multi-touch enabled steering wheel: exploring the design space. In Proc. of CHI Extended Abstracts 2010. ACM, 3355--3360, 2010.  ",
      "doi": "10.1145/1753846.1753984"
    },
    {
      "text": "Sandnes, F. E., Huang, Y. P., Huang, Y. M. An Eyes-Free In-car User Interface Interaction Style Based on Visual and Textual Mnemonics, Chording and Speech. In Proc. of MUE '08, 24--26, 2008.  ",
      "doi": "10.1109/MUE.2008.50"
    },
    {
      "text": "Schöning, J., Hook, J., Motamedi, N., Olivier, P., Echtler, F., Brandl, P., Muller, L., Daiber, F., Hilliges, O., Löchtefeld, M., Roth, T., Schmidt, D., von Zadow, U. Building Interactive Multi-touch Surfaces. Journal of Graphics Tools, 2009.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In Proc. of CHI '09. ACM, 1083--1092, 2009.  ",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}