{
  "doi": "10.1145/1978942.1979356",
  "title": "Spatialized sound enhances biomechanically-induced self-motion illusion (vection)",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2799-2802",
  "year": 2011,
  "badges": [],
  "abstract": "The use of vection, the illusion of self-movement, has recently been explored as a novel way to immerse observers in mediated environments through illusory yet compelling self-motion without physically moving. This provides advantages over existing systems that employ costly, cumbersome, and potentially hazardous motion platforms, which are often surprisingly inadequate to provide life-like motion experiences. This study investigates whether spatialized sound rotating around the stationary, blindfolded listener can facilitate biomechanical vection, the illusion of self-rotation induced by stepping along a rotating floor plate. For the first time, integrating simple auditory and biomechanical cues for turning in place evoked convincing circular vection. In an auditory baseline condition, participants experienced only spatialized auditory cues. In a purely biomechanical condition, seated participants stepped along sideways on a rotating plate while listening to mono masking sounds. Scores of the bi-modal condition (binaural+biomechanical cues) exceeded the sum of both single cue conditions, which may imply super-additive or synergistic effects.",
  "tags": [
    "virtual reality",
    "cognitive science",
    "cue-integration",
    "self-motion illusions",
    "self-motion perception",
    "bio-mechanical and auditory circular vection",
    "psychology",
    "human factors"
  ],
  "authors": [
    {
      "name": "Bernhard E. Riecke",
      "institution": "Simon Fraser University, Surrey, British Columbia, Canada",
      "img": "/do/10.1145/contrib-81100113270/rel-imgonly/bernhardriecke-hikingstawamuschief_small.jpg",
      "acmid": "81100113270",
      "orcid": "missing"
    },
    {
      "name": "Daniel Feuereissen",
      "institution": "Simon Fraser University, Surrey, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81365597461",
      "orcid": "missing"
    },
    {
      "name": "John J. Rieser",
      "institution": "Vanderbilt University, Nashville, Tennessee, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100035556",
      "orcid": "missing"
    },
    {
      "name": "Timothy P. McNamara",
      "institution": "Vanderbilt University, Nashville, Tennessee, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316489853",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bles, W. Stepping around: circular vection and Coriolis effects. In J. Long and A. Baddeley, eds., Attention and performance IX. Erlbaum, Hillsdale, NJ, 1981, 47--61.",
      "doi": ""
    },
    {
      "text": "Dichgans, J. and Brandt, T. Visual-Vestibular Interaction: Effects on Self-Motion Perception and Postural Control. In Perception. Springer, 1978, 756 - 804.",
      "doi": ""
    },
    {
      "text": "Dodge, R. Thresholds of rotation. J. Exp. Psychol. 6, 2 (1923), 107--137.",
      "doi": ""
    },
    {
      "text": "Hettinger, L.J. Illusory Self-motion in Virtual Environments. In K.M. Stanney, ed., Handbook of Virtual Environments. Lawrence Erlbaum, 2002, 471--492.",
      "doi": ""
    },
    {
      "text": "Khasnis, A. and Gokula, R.M. Romberg's test. J Postgrad Med 49, 2 (2003), 169--172.",
      "doi": ""
    },
    {
      "text": "Lackner, J.R. Induction of Illusory Self-Rotation and Nystagmus by a Rotating Sound-Field. Aviation Space and Environmental Medicine 48, 2 (1977), 129--131.",
      "doi": ""
    },
    {
      "text": "Riecke, B.E. Cognitive and higher-level contributions to illusory self-motion perception (\"vection\"): does the possibility of actual motion affect vection? Japanese Journal of Psychonomic Science 28, 1 (2009), 135--139.",
      "doi": ""
    },
    {
      "text": "Riecke, B.E. Compelling Self-Motion Through Virtual Environments Without Actual Self-Motion -- Using Self-Motion Illusions (\"Vection\") to Improve User Experience in VR. In Virtual Reality. Intech, 2011, 27 pages (book chapter in print).",
      "doi": ""
    },
    {
      "text": "Riecke, B.E., Feuereissen, D., and Rieser, J.J. Auditory self-motion simulation is facilitated by haptic and vibrational cues suggesting the possibility of actual motion. ACM Trans. Appl. Percept. 6, 3 (2009), 1--22.  ",
      "doi": "10.1145/1577755.1577763"
    },
    {
      "text": "Riecke, B.E., Väljamäe, A., and Schulte-Pelkum, J. Moving sounds enhance the visually-induced self-motion illusion (circular vection) in virtual reality. ACM Trans. Appl. Percept. 6, 2 (2009), 1--27.  ",
      "doi": "10.1145/1498700.1498701"
    },
    {
      "text": "1Väljamäe, A. Auditorily-induced illusory self-motion: A review. Brain Research Reviews 61, 2 (2009), 240--255.",
      "doi": ""
    },
    {
      "text": "Warren, R. and Wertheim, A.H., eds. Perception & Control of Self-Motion. Erlbaum, New Jersey, London, 1990.",
      "doi": ""
    }
  ]
}