{
  "doi": "10.1145/1978942.1979121",
  "title": "Hello, is grandma there? let's read! StoryVisit: family video chat and connected e-books",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1195-1204",
  "year": 2011,
  "badges": [],
  "abstract": "StoryVisit allows children and long-distance adults to experience a sense of togetherness by reading children's story books together over a distance. StoryVisit combines video conferencing and connected books: remote grown-up and child readers can see and hear each other, and can also see and control the same e-book. We report on research with 61 families - over 200 users including parents, children and long-distance readers - who used StoryVisit in their homes with a long-distance reader for at least one reading session. In addition, we report qualitative findings regarding nineteen of the families who participated in telephone interviews and four families who were monitored and interviewed by researchers at home. Results show that connected e-book video chat sessions last about five times as long as the typical video chats reported in previous research on families with young children. Moreover, the addition of an animated character increased session lengths by another 50%. StoryVisit usage peaked for families with three year olds, showing that sustained distance interactions with very young children are possible if communication technologies incorporate joint activities that engage children and adults.",
  "authors": [
    {
      "name": "Hayes Raffle",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100381813",
      "orcid": "missing"
    },
    {
      "name": "Glenda Revelle",
      "institution": "University of Arkansas, Fayetteville, Arkansas, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100571217",
      "orcid": "missing"
    },
    {
      "name": "Koichi Mori",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460649538",
      "orcid": "missing"
    },
    {
      "name": "Rafael Ballagas",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405596165",
      "orcid": "missing"
    },
    {
      "name": "Kyle Buza",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100276537",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Horii",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453611877",
      "orcid": "missing"
    },
    {
      "name": "Joseph Kaye",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81100005698/rel-imgonly/jofish-kaye-1.jpg",
      "acmid": "81100005698",
      "orcid": "0000-0001-7440-3900"
    },
    {
      "name": "Kristin Cook",
      "institution": "Sesame Workshop, New York, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309492921",
      "orcid": "missing"
    },
    {
      "name": "Natalie Freed",
      "institution": "MIT Media Lab, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392595602",
      "orcid": "missing"
    },
    {
      "name": "Janet Go",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435605993",
      "orcid": "missing"
    },
    {
      "name": "Mirjana Spasojevic",
      "institution": "Nokia Research Center, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100130531",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M., Go, J., Kaye, J. 'J.', Spasojevic, M. \"Making love in the network closet: the benefits and work of family videochat.\" Proc. CSCW 2010, 145--154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Ballagas, R., Raffle, H., Go, J., Revelle, G., Kaye, J., Ames, A., Horii, H., Mori, K., and Spasojevic, M. \"Story time for the 21st century.\" IEEE Pervasive Computing, 9:28--36, 2010.  ",
      "doi": "10.1109/MPRV.2010.45"
    },
    {
      "text": "Conlin, J. \"Living Apart for the Paycheck.\" The New York Times, Jan. 4, 2009.",
      "doi": ""
    },
    {
      "text": "Egelman, S., Brush, A.J., & Inkpen, K. Family accounts: A new paradigm for user accounts within the home environment. In Proc. CSCW 2008, 669--678.  ",
      "doi": "10.1145/1460563.1460666"
    },
    {
      "text": "Davies, C., Williams, D. \"The Grandparent Study 2002 Report.\" AARP, 2002.",
      "doi": ""
    },
    {
      "text": "Fisch, S. M., Shulman, J., Ackerman, A., Levin, G. . \"Reading between the pixels: Parent-child interaction while reading online storybooks.\" Early Education and Development, 13(4), 435--451, 2002.",
      "doi": ""
    },
    {
      "text": "Follmer, S. Raffle, H., Go, J., Ballagas, R., Ishii, H. \"Video play: playful interactions in video conferencing for long-distance families with young children.\" Proc. IDC 2010, 49--58.  ",
      "doi": "10.1145/1810543.1810550"
    },
    {
      "text": "Freed, N., Burleson, W., Raffle, H., Ballagas, R., Newman, N. \"User interfaces for tangible characters: can children connect remotely through toy perspectives?\" Proc. IDC 2010, 69--78.  ",
      "doi": "10.1145/1810543.1810552"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B. B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., Roussel. N., Eiderbäck, B. \"Technology probes: inspiring design for and with families.\" Proc. CHI 2003, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Johnson, W., Rickel, J., and Lester, J. \"Animated pedagogical agents: Face-to-face interaction in interactive learning environments.\" Int'l J. of Artificial Intelligence in Education, 11(1):47--78. 2000.",
      "doi": ""
    },
    {
      "text": "Judge, T. K. and Neustaedter, C. Sharing conversation and sharing life: video conferencing in the home. Proc. CHI 2010, 655--658.  ",
      "doi": "10.1145/1753326.1753422"
    },
    {
      "text": "Kerr, B. M., & Mason, J. M. (1994). Awakening literacy through interactive story reading. In F. Lehr & J. Osborn (Eds.), Reading, language, and literacy: Instruction for the twenty-first century, (pp. 133--148). Hillsdale, NJ: Lawrence Erlbaum Associates, Inc.",
      "doi": ""
    },
    {
      "text": "Lester, J. Converse, S., Kahler, S., Barlow, T., Stone, B. & Bhogal, R. \"The persona effect: affective impact of animated pedagogical agents.\" Proc. CHI 1997, 359--366.  ",
      "doi": "10.1145/258549.258797"
    },
    {
      "text": "Raffle, H., Ballagas, R., Revelle, G., Horii, H., Follmer, S., Go, J., Reardon, E., Mori, K., Kaye, J., Spasojevic, M. \"Family Story Play: reading with young children (and Elmo) over a distance.\" Proc. CHI 2010, 1583--1592.  ",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Vutborg R., Kjeldskov J., Vetere F., & Pedell S. \"Family Storytelling for Grandparents & Grandchildren living apart.\" Proc. NordiCHI 2010, 531--540.  ",
      "doi": "10.1145/1868914.1868974"
    },
    {
      "text": "Whitehurst, G. J., Falco, F. L., Lonigan, C. J., Fischel, J. E., DeBaryshe, B. D., et al. (1988). \"Accelerating language development through picture book reading.\" Developmental Psychology, 24(4), 552--559.",
      "doi": ""
    },
    {
      "text": "Whitehurst, G. J., Arnold, D. S., Epstein, J. N., Angell, A. L., Smith, M., & Fischel, J. E. (1994). \"A picture book reading intervention in day-care and home for children from low-income families.\" Developmental Psychology, 30, 679--689.",
      "doi": ""
    },
    {
      "text": "Yarosh, S, Inkpen, K.M., Brush, A.J. \"Video playdate: toward free play across distance.\" Proc. CHI 2010, 1251--1260.  ",
      "doi": "10.1145/1753326.1753514"
    },
    {
      "text": "Yarosh, S. Cuzzort, S. Müller, H., Abowd, G.D. \"Developing a media space for remote synchronous parent-child interaction\" Proc. IDC 2009, 97--105.  ",
      "doi": "10.1145/1551788.1551806"
    },
    {
      "text": "Zevenbergen, A. A. & Whitehurst, G. J. (2003). \"Dialogic reading: A shared picture book reading intervention for preschoolers.\" In van Kleek, Stahl and Bauer (Eds.), On reading books to children: Parents and teachers. Mahwah, NJ: Lawrence Erlbaum Associates, pp. 177--200.",
      "doi": ""
    }
  ]
}