{
  "doi": "10.1145/1978942.1979090",
  "title": "Matters of life and death: locating the end of life in lifespan-oriented hci research",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "987-996",
  "year": 2011,
  "badges": [],
  "abstract": "Examining developmental periods of the human lifespan has been a useful tradition for focusing HCI research (e.g., technologies for children or the elderly). In this paper, we identify the end of life as another period of the human lifespan that merits consideration by technology designers and researchers. This paper maps out current and future research in HCI at the end of life by first describing how this area raises questions concerning materiality and artifacts, social identities, temporality and methodologies. Having provided a description of the richness of this area, we then frame it against HCI traditions and practices in an orientation we term the lifespan-oriented approach. This paper maps early efforts in end of life research, structures and suggests areas for continued work, and situates the end of life among existing areas of HCI research.",
  "authors": [
    {
      "name": "Michael Massimi",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100219924/rel-imgonly/mikemassimi_headshot_round.jpeg",
      "acmid": "81100219924",
      "orcid": "missing"
    },
    {
      "name": "William Odom",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    },
    {
      "name": "Richard Banks",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100462110",
      "orcid": "missing"
    },
    {
      "name": "David Kirk",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    }
  ],
  "references": [
    {
      "text": "Forever Missed. http://www.forevermissed.com/.",
      "doi": ""
    },
    {
      "text": "Ward Funeral Home. http://www.wardfuneralhome.com/.",
      "doi": ""
    },
    {
      "text": "MyWonderfulLife. https://www.mywonderfullife.com/.",
      "doi": ""
    },
    {
      "text": "Entrustet. https://www.entrustet.com/.",
      "doi": ""
    },
    {
      "text": "Legacy Locker. http://legacylocker.com/.",
      "doi": ""
    },
    {
      "text": "TOTeM. http://www.youtotem.com/.",
      "doi": ""
    },
    {
      "text": "ADEC Ethics. http://www.adec.org/about/ethics.cfm.",
      "doi": ""
    },
    {
      "text": "Addington-Hall, J. and McPherson, C. After-Death Interviews with Surrogates/Bereaved Family Members: Some Issues of Validity. Journal of Pain and Symptom Management 22, 3 (2001), 784--790.",
      "doi": ""
    },
    {
      "text": "Anon c. 1450. Ars Moriendi.",
      "doi": ""
    },
    {
      "text": "Baltes, P. B., Reese, H. W., and Lipsitt, L. P. Life-Span Developmental Psychology. Annual Review of Psychology 31, 1 (1980), 65--110.",
      "doi": ""
    },
    {
      "text": "Baltes, P. B., Reese, H. W., and Lipsitt, L. P. Life-Span Developmental Psychology. Annual Review of Psychology 31, 1 (1980), 65--110.",
      "doi": ""
    },
    {
      "text": "Becker, S. A. A study of web usability for older adults seeking online health resources. ACM Trans. Comput.-Hum. Interact. 11, 4 (2004), 387--406.  ",
      "doi": "10.1145/1035575.1035578"
    },
    {
      "text": "Bell, G. No More SMS from Jesus: Ubicomp, Religion and Techno-spiritual Practices. In Proc. UBICOMP. Springer-Verlag, 2006, 141--158.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Benford, S. and Giannachi, G. Performing Mixed Reality. MIT Press, 2010. ",
      "doi": "10.5555/2030028"
    },
    {
      "text": "Birnholtz, J. and Jones-Rounds, M. Independence and interaction: understanding seniors' privacy and awareness needs for aging in place. Proc. CHI, ACM (2010), 143--152.  ",
      "doi": "10.1145/1753326.1753349"
    },
    {
      "text": "Bonanno, G. The Other Side of Sadness: What the New Science of Bereavement Tells Us About Life After Loss. Basic Books, 2009.",
      "doi": ""
    },
    {
      "text": "Bowlby-West, L. The impact of death on the family system. Journal of Family Therapy 5, 3 (1983), 279--294.",
      "doi": ""
    },
    {
      "text": "Brubaker, J. and Vertesi, J. Death and the Social Network. Proc. CHI Workshop on Death and the Digital.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Newell, A., and Moran, T. P. The Psychology of Human-Computer Interaction. L. Erlbaum Associates Inc., 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Carlick, A. and Biley, F. C. Thoughts on the therapeutic use of narrative in the promotion of coping in cancer care. European Journal of Cancer Care 13, 4 (2004), 308--317.",
      "doi": ""
    },
    {
      "text": "Carmien, S. P., Cavallaro, F. I., and Koene, R. A. 'Senior moments': loss and context. Proc. International Workshop on Systems and Networking Support for Health Care and Assisted Living Environments, ACM (2009), 1--4.  ",
      "doi": "10.1145/1579114.1579158"
    },
    {
      "text": "Chung, D. S. and Kim, S. Blogging activity among cancer patients and their companions: Uses, gratifications, and predictors of outcomes. J. Am. Soc. Inf. Sci. Technol. 59, 2 (2008), 297--306.  ",
      "doi": "10.5555/1331268.1331282"
    },
    {
      "text": "Costello, J. Nursing older dying patients: findings from an ethnographic study of death and dying in elderly care wards. J. Advanced Nursing 35, 1 (2001), 59--68.",
      "doi": ""
    },
    {
      "text": "Damianakis, T., Crete-Nishihata, M., Smith, K. L., Baecker, R. M., and Marziali, E. The Psychosocial Impacts of Multimedia Biographies on Persons With Cognitive Impairments. The Gerontologist 50, 1 (2010), 23 -35.",
      "doi": ""
    },
    {
      "text": "Dix, A. Being playful: learning from children. Proc. IDC, ACM (2003), 3--9.  ",
      "doi": "10.1145/953536.953538"
    },
    {
      "text": "Dominick, S. A., Irvine, B. A., Beauchamp, N., et al. An internet tool to normalize grief. Omega 60, 1 (2009), 71--87.",
      "doi": ""
    },
    {
      "text": "Don Murphy, G., Schenkenberg, T., Hunter, J. S., and Battin, M. P. Advance Directives: A Computer Assisted Approach to Assuring Patients' Rights and Compliance with PSDA and JCAHO Standards. HEC Forum 9, 3 (1997), 247--255.",
      "doi": ""
    },
    {
      "text": "Druin, A., ed. The design of children's technology. Morgan Kaufmann Publishers Inc., 1998. ",
      "doi": "10.5555/303430"
    },
    {
      "text": "Finch, J. and Mason, J. Passing On: Kinship and Inheritance in England. Routledge, 2001.",
      "doi": ""
    },
    {
      "text": "Friedman, B. and Nathan, L. P. Multi-lifespan information system design: a research initiative for the hci community. Proc. CHI, ACM (2010), 2243--2246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Gaver, W., Boucher, A., Law, A., et al. Threshold devices: looking out from the home. Proc. CHI, ACM (2008), 1429--1438.  ",
      "doi": "10.1145/1357054.1357278"
    },
    {
      "text": "Gemmell, J., Bell, G., Lueder, R., Drucker, S., and Wong, C. MyLifeBits: Fulfilling the Memex Vision. Proc. of MULTIMEDIA, (2002), 235--238.  ",
      "doi": "10.1145/641007.641053"
    },
    {
      "text": "van Gennep, A. Rites of Passage. Routledge, 2004.",
      "doi": ""
    },
    {
      "text": "Glaser, B. G. and Strauss, A. Awareness of Dying. Aldine Transaction, 1965.",
      "doi": ""
    },
    {
      "text": "Goldberg, S. The Hard Work of Dying. http://www.examiner.com/x-17609-SF-End-of-Life-Issues-Examiner~y2010m6d30-The-Hard-Work-of-Dying.",
      "doi": ""
    },
    {
      "text": "Green, J. W. Beyond the Good Death. University of Pennsylvania Press, 2008.",
      "doi": ""
    },
    {
      "text": "Hallam, E. and Hockey, J. Death, Memory and Material Culture. Berg Publishers, 2001.",
      "doi": ""
    },
    {
      "text": "Halln&amp;#228;s, L. and Redstr&amp;#246;m, J. From use to presence: on the expressions and aesthetics of everyday computational things. TOCHI 9, 2 (2002), 106--124.  ",
      "doi": "10.1145/513665.513668"
    },
    {
      "text": "Howarth, G. Death and Dying: A Sociological Introduction. Polity, 2006.",
      "doi": ""
    },
    {
      "text": "Kafai, Y. B. Minds in Play: Computer Game Design as a Context for Children's Learning. L. Erlbaum Associates Inc., 1995. ",
      "doi": "10.5555/527173"
    },
    {
      "text": "Kera, D., Graham, C., Foong, P. S., Aceti, L., Gibbs, M., and Rouncefield, M. Afterlife &amp;#38; death in the digital age seminar. National Univ of Singapore, 2010.",
      "doi": ""
    },
    {
      "text": "Kosem, J. and Kirk, D. Spomenik: Monument. Proc. CHI Extended Abstracts, ACM, 4477--4480.",
      "doi": ""
    },
    {
      "text": "K&amp;#252;bler-Ross, E. On death and dying. Routledge, London, 1989.",
      "doi": ""
    },
    {
      "text": "K&amp;#252;bler-Ross, E. Death: The Final Stage of Growth. Simon &amp;#38; Schuster, 1997.",
      "doi": ""
    },
    {
      "text": "Lombard, M. and Selverian, M. E. M. Telepresence after death. Presence: Teleoper. Virtual Environ. 17, 3 (2008), 310--325.  ",
      "doi": "10.1162/pres.17.3.310"
    },
    {
      "text": "Massimi, M. and Baecker, R. M. A death in the family: opportunities for designing technologies for the bereaved. Proc. CHI, ACM (2010), 1821--1830.  ",
      "doi": "10.1145/1753326.1753600"
    },
    {
      "text": "Massimi, M. and Charise, A. Dying, death, and mortality: towards thanatosensitivity in HCI. Proc. CHI Extended Abstracts, ACM (2009), 2459--2468.  ",
      "doi": "10.1145/1520340.1520349"
    },
    {
      "text": "Massimi, M., Odom, W., Kirk, D., and Banks, R. HCI at the end of life: understanding death, dying, and the digital. Proc. CHI, ACM (2010), 4477--4480.  ",
      "doi": "10.1145/1753846.1754178"
    },
    {
      "text": "Miller, D. and Parrott, F. Loss and material culture in South London. The Journal of the Royal Anthropological Institute 15, (2009), 502--519.",
      "doi": ""
    },
    {
      "text": "Murphy, S. A. A bereavement intervention for parents following the sudden, violent deaths of their 12-28-year-old children: description and applications to clinical practice. The Canadian Journal of Nursing Research 29, 4 (1997), 51--72.",
      "doi": ""
    },
    {
      "text": "Mynatt, E. D., Adler, A., Ito, M., Linde, C., and O'Day, V. L. Learning from seniors in network communities. Proc. CHI Extended Abstracts, ACM (1999), 47--48.  ",
      "doi": "10.1145/632716.632748"
    },
    {
      "text": "Odom, W., Banks, R., and Kirk, D. Reciprocity, deep storage, and letting go: opportunities for designing interactions with inherited digital materials. interactions 17, 5 (2010), 31--34.  ",
      "doi": "10.1145/1836216.1836224"
    },
    {
      "text": "Odom, W., Harper, R., Sellen, A., Kirk, D., and Banks, R. Passing on &amp;#38; putting to rest: understanding bereavement in the context of interactive technologies. Proc. CHI, ACM (2010), 1831--1840.  ",
      "doi": "10.1145/1753326.1753601"
    },
    {
      "text": "Oliver, R. C., Sturtevant, J. P., Scheetz, J. P., and Fallat, M. E. Beneficial Effects of a Hospital Bereavement Intervention Program after Traumatic Childhood Death. The Journal of Trauma Injury Infection and Critical Care 50, 3 (2001), 440--448.",
      "doi": ""
    },
    {
      "text": "Prigerson, H., Bierhals, A., Kasl, S., et al. Complicated grief as a disorder distinct from bereavement-related depression and anxiety: a replication study. Am J Psychiatry 153, 11 (1996), 1484--1486.",
      "doi": ""
    },
    {
      "text": "Rege, R., Jung, H., Hazelwood, W., Orlov, G., Connelly, K., and Shankar, K. Exploring early evaluation techniques of ambient health promoting devices in home environments of senior citizens living independently. Proc. HealthNet 08, ACM (2008), 1--3.  ",
      "doi": "10.1145/1515747.1515764"
    },
    {
      "text": "Reynolds, K., Henderson, M., Schulman, A., and Hanson, L. C. Needs of the dying in nursing homes. Journal of Palliative Medicine 5, 6 (2002), 895--901.",
      "doi": ""
    },
    {
      "text": "Scholl, S. Death and the Humanities. Bucknell University Press, 1984.",
      "doi": ""
    },
    {
      "text": "Schulman-Green, D., McCorkle, R., and Bradley, E. H. Tailoring traditional interviewing techniques for qualitative research with seriously ill patients about the end-of-life: A primer. Omega 60, 1 (2009), 89--102.",
      "doi": ""
    },
    {
      "text": "Schut, H. and Stroebe, M. S. Interventions to enhance adaptation to bereavement. Journal of Palliative Medicine 8 Suppl 1, (2005), S140--147.",
      "doi": ""
    },
    {
      "text": "Sellen, A. J., Fogg, A., Aitken, M., Hodges, S., Rother, C., and Wood, K. Do life-logging technologies support memory for the past?: an experimental study using sensecam. Proc. CHI, ACM (2007), 81--90.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Stroebe, M. S., Hansson, R. O., Schut, H., and Stroebe, W., eds. Handbook of Bereavement Research and Practice. APA, 2008.",
      "doi": ""
    },
    {
      "text": "Sudnow, D. Passing on: The Social Organization of Dying. Prentice Hall, 1967.",
      "doi": ""
    },
    {
      "text": "Taylor, A. S. and Harper, R. Age-old practices in the 'new world': a study of gift-giving between teenage mobile phone users. Proc. CHI, ACM (2002), 439--446.  ",
      "doi": "10.1145/503376.503455"
    },
    {
      "text": "Uriu, D. and Okude, N. ThanatoFenestra: photographic family altar supporting a ritual to pray for the deceased. Proc. DIS, ACM (2010), 422--425.  ",
      "doi": "10.1145/1858171.1858253"
    },
    {
      "text": "Worden, J. W. Grief Counseling and Grief Therapy. Springer Publishing Co., Inc., 2008.",
      "doi": ""
    },
    {
      "text": "Wortham, J. As Older Users Join Facebook, Network Grapples With Death. The New York Times, 2010. http://www.nytimes.com/2010/07/18/technology/18death.html?_r=1&amp;#38;scp=1&amp;#38;sq=ghosts%20reach%20out&amp;#38;st=cse.",
      "doi": ""
    },
    {
      "text": "Wyche, S. P., Magnus, C. M., and Grinter, R. E. Broadening Ubicomp's vision: an exploratory study of charismatic pentecostals and technology use in Brazil. Proc. UBICOMP, ACM (2009), 145--154.  ",
      "doi": "10.1145/1620545.1620569"
    },
    {
      "text": "Wyeth, P. and Purchase, H. C. Using developmental theories to inform the design of technology for children. Proc. IDC, ACM (2003), 93--100.  ",
      "doi": "10.1145/953536.953550"
    }
  ]
}