{
  "doi": "10.1145/1978942.1979171",
  "title": "Don't drop it!: pick it up and storyboard",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1571-1580",
  "year": 2011,
  "badges": [],
  "abstract": "Storyboards offer designers a way to illustrate a narrative. Their creation can be enabled by tools supporting sketching or widget collections. As designers often incorporate previous ideas, we contribute the notion of blending the reappropriation of artifacts and their design tradeoffs with storyboarding. We present PIC-UP, a storyboarding tool supporting reappropriation, and report on two studies--a long-term investigation with novices and interviews with experts. We discuss how it may support design thinking, tailor to different expertise levels, facilitate reappropriation during storyboarding, and assist with communication.",
  "tags": [
    "design tradeoffs",
    "reappropriation",
    "storyboard"
  ],
  "authors": [
    {
      "name": "Shahtab Wahid",
      "institution": "Virginia Polytechnic Institute and State University (Virginia Tech), Blacksburg, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314495363",
      "orcid": "missing"
    },
    {
      "name": "D. Scott McCrickard",
      "institution": "Virginia Polytechnic Institute and State University (Virginia Tech), Blacksburg, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100006245",
      "orcid": "missing"
    },
    {
      "name": "Joseph DeGol",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656468",
      "orcid": "missing"
    },
    {
      "name": "Nina Elias",
      "institution": "Michigan State University, East Lansing, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484649218",
      "orcid": "missing"
    },
    {
      "name": "Steve Harrison",
      "institution": "Virginia Polytechnic Institute and State University (Virginia Tech), Blacksburg, Virginia, USA",
      "img": "/do/10.1145/contrib-81100010024/rel-imgonly/81100010024.jpg",
      "acmid": "81100010024",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailey, B. P., Konstan, J. A., &amp;#38; Carlis, J. V. DEMAIS: designing multimedia applications with interactive storyboards. In Proc. MULTIMEDIA 2001, (2001), 241--250.  ",
      "doi": "10.1145/500141.500179"
    },
    {
      "text": "Bryan-Kinns, N &amp;#38; Hamilton, F. One for all and all for one?: case studies of using prototypes in commercial projects. In Proc. NordiCHI 2002, ACM Press (2002), 91--100.  ",
      "doi": "10.1145/572020.572032"
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann, San Francisco, CA. 2007. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Carroll, J. M., &amp;#38; Kellogg, W. A. Artifact as theory-nexus: Hermeneutics meets theory-based design. In Proc. CHI 1989, ACM Press (1989), 7--14.  ",
      "doi": "10.1145/67449.67452"
    },
    {
      "text": "Dearden, A. &amp;#38; Finlay, J. Pattern languages in HCI: A critical review. Human-Computer Interaction, 21, 1 (2009), 49--102.",
      "doi": ""
    },
    {
      "text": "Dusink, L. &amp;#38; van Katwijk, J. Reuse Dimensions. In Symposium on Software Reusability, (1995), 137--149.  ",
      "doi": "10.1145/211782.211828"
    },
    {
      "text": "Finch, C. The Art of Walt Disney: From Mickey Mouse to the Magic Kingdom. Harry Abrams, New York. 1973.",
      "doi": ""
    },
    {
      "text": "Hart, J. The Art of the Storyboard: Storyboarding for Film, TV, and Animation. Focal Press. 1998.",
      "doi": ""
    },
    {
      "text": "Herring, S. R., Chang, C., Krantzler, J., &amp;#38; Bailey, B. P. Getting inspired!: understanding how and why examples are used in creative design practice. In Proc. CHI 2009, ACM Press (2009), 87--96.  ",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Hughes, M. A pattern language for user assistance. Interactions, 14, 1 (2007), 27--29.  ",
      "doi": "10.1145/1189976.1189996"
    },
    {
      "text": "1IDEO Method Cards. {S.I.}: IDEO. 2003.",
      "doi": ""
    },
    {
      "text": "Landay, J. A. &amp;#38; Borriello, G. Design Patterns for Ubiquitous Computing. Computer, 36, 8 (2003), 93--95.  ",
      "doi": "10.1109/MC.2003.1220589"
    },
    {
      "text": "Landay, J. A. &amp;#38; Myers, B. A. Interactive sketching for the early stages of user interface design. In Proc. CHI 1995, ACM Press (1995), 4--50.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "Lin, J. &amp;#38; Landay, J. A. Employing patterns and layers for early-stage design and prototyping of cross-device user interfaces. In Proc. CHI 2008, ACM Press (2008), 1313--1322.  ",
      "doi": "10.1145/1357054.1357260"
    },
    {
      "text": "McCrickard, D. S., Chewar, C. M., Somervell, J. P., &amp;#38; Ndiwalana, A. A Model for Notification Systems Evaluation--Assessing User Goals for Multitasking Activity. Transactions on Computer-Human Interaction (TOCHI), 10, 4 (2003), 312--338.  ",
      "doi": "10.1145/966930.966933"
    },
    {
      "text": "Nathan, L., Friedman, B., &amp;#38; Hendry, D. SUSTAINABLY OURS: Information system design as catalyst: human action and environmental sustainability. Interactions, 16, 4 (2009), 6--11.  ",
      "doi": "10.1145/1551986.1551988"
    },
    {
      "text": "Newman, M., Lin, J., Hong, J., &amp;#38; Landay, J. A. DENIM: an informal web site design tool inspired by observations of practice. Human-Computer Interaction, 18, 3 (2003), 259--324.  ",
      "doi": "10.1207/S15327051HCI1803_3"
    },
    {
      "text": "Rosson, M. B. &amp;#38; Carroll, J. M. Usability Engineering: Scenario-Based Development of Human Computer Interaction. Morgan Kaufmann Publishers, San Francisco, CA. 2002. ",
      "doi": "10.5555/501581"
    },
    {
      "text": "Sharp, H., Rogers, Y., &amp;#38; Preece, J. Interaction Design: Beyond Human-Computer Interaction. John Wiley &amp;#38; Sons Ltd., West Sussex, England. 2007. ",
      "doi": "10.5555/1215597"
    },
    {
      "text": "Strauss, A. &amp;#38; Corbin, J. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc., Newbury Park, CA. 1990.",
      "doi": ""
    },
    {
      "text": "2Sutcliffe, A. G. &amp;#38; Carroll, J. M. Designing Claims for Reuse in Interactive Systems Design. International Journal of Human-Computer Studies, 50, 3 (2000), 213--241.  ",
      "doi": "10.1006/ijhc.1999.0245"
    },
    {
      "text": "2Truong, K. N., Hayes, G. R., &amp;#38; Abowd, G. D. Storyboarding: an empirical determination of best practices and effective guidelines. In Proc. DIS 2006, ACM Press (2006), 12--21.  ",
      "doi": "10.1145/1142405.1142410"
    },
    {
      "text": "Wahid, S. Allgood, C. F., Chewar, C. M., &amp;#38; McCrickard, D. S. Entering the Heart of Design: Relationships for Tracing Claim Evolution. In Proc. SEKE 2004, (2004), 167--172.",
      "doi": ""
    },
    {
      "text": "Wahid, S., Branham, S. M., Cairco, L., McCrickard, D. S., &amp;#38; Harrison, S. Picking Up Artifacts: Storyboarding as a Gateway to Reuse. In Proc. INTERACT 2009, Springer-Verlag (2009), 528--541.  ",
      "doi": "10.1007/978-3-642-03658-3_57"
    },
    {
      "text": "Wahid, S., Branham, S. M., McCrickard, D. S., &amp;#38; Harrison, S. Investigating the Relationship Between Imagery and Rationale in Design. In Proc. DIS 2010, ACM Press (2010), 75--84.  ",
      "doi": "10.1145/1858171.1858187"
    },
    {
      "text": "Wania, C. Examining the impact of an information retrieval pattern language on the design of information retrieval interfaces. Ph.D. Dissertation, Drexel University, 2008.",
      "doi": ""
    },
    {
      "text": "Whittaker, S. Things to talk about when talking about things. Human-Computer Interaction, 18, 1 (2003), 149--170.  ",
      "doi": "10.1207/S15327051HCI1812_6"
    },
    {
      "text": "Yahoo! Patterns Library. developer.yahoo.com/ypattern..",
      "doi": ""
    }
  ]
}