{
  "doi": "10.1145/1978942.1979415",
  "title": "Document area identification for extending books without markers",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3189-3198",
  "year": 2011,
  "badges": [],
  "abstract": "We present a method of document area identification that utilizes consecutive characters in the non-reading direction as search keys. We use this method to develop a prototype system called Kappan. It enables service providers and users to create hyperlinks in books without markers. Existing techniques generally require markers to be printed on the page if a hyperlink is to be created. We consider that utilizing the concept of the search index makes markers unnecessary. Kappan associates indexed text areas in a large number of books with supporting digital contents. The indexed text areas, freely defined by service providers or users, are identified by subjecting images of small areas of the printed page to OCR (Optical Character Recognition) and extracting from the text so recognized highly specific and efficient search keys. Traditional text indexing methods must extract long character sequences from the partial image in order to identify the area exactly given the sheer number of book pages. However, considering that the average OCR error rate is more than 20 percent if the partial image is captured by a camera-equipped cellular phone, it is highly probable that many characters would be misrecognized and area identification would thus fail. In contrast, our indexing method can extract area-specific clues using fewer characters that can identify the area exactly even when the partial image is small and the extracted text contains misrecognized characters. An experiment proves that our method can identify the exact area from more than one million areas with the high accuracy rates of 99 percent and 96 percent for OCR error rates of 0 percent and 22 percent, respectively.",
  "tags": [
    "paper media",
    "digital media",
    "cellular phone",
    "document area identification",
    "cross media"
  ],
  "authors": [
    {
      "name": "Akihiro Miyata",
      "institution": "NTT Corporation, Yokosuka, Japan",
      "img": "/do/10.1145/contrib-81384596291/rel-imgonly/20220111_square_miyata.jpg",
      "acmid": "81384596291",
      "orcid": "missing"
    },
    {
      "name": "Ko Fujimura",
      "institution": "NTT Corporation, Yokosuka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100086397",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arai, T., Aust, D., and Hudson, S. E. Paperlink: A technique for hyperlinking from real paper to electronic content export. In Proc. ACM Conference on Human Factors in Computing Systems (1997), 327--334.  ",
      "doi": "10.1145/258549.258782"
    },
    {
      "text": "Billinghurst, M., Kato, H., and Poupyrev, I. The magicbook: A transitional ar interface. Computers and Graphics 25, 5 (2001), 745--753.",
      "doi": ""
    },
    {
      "text": "Data Matrix bar code symbology specification. Iso/iec 16022:2006.",
      "doi": ""
    },
    {
      "text": "Erol, B., Antnez, E., and Hul, J. J. Hotpaper: Multimedia interaction with paper using mobile phones. In Proc. ACM International Conference on Multimedia (2008), 399--408.  ",
      "doi": "10.1145/1459359.1459413"
    },
    {
      "text": "Frakes, B., and Baeza-Yates, R. Information Retrieval: Data Structures and Algorithms. Prentice Hall, 1992. ",
      "doi": "10.5555/129687"
    },
    {
      "text": "Hecht, D. L. Printed embedded data graphical user interfaces. IEEE Computer 34, 3 (2001), 47--55.  ",
      "doi": "10.1109/2.910893"
    },
    {
      "text": "Kendall, M. G. A new measure of rank correlation. Biometrika 30, 1--2 (1938), 81--93.",
      "doi": ""
    },
    {
      "text": "Kise, K., Miki, Y., and Matsumoto, K. Backgrounds as information carriers for printed documents. In Proc. 15th International Conference on Pattern Recognition, vol. 4 (2000), 380--384. ",
      "doi": "10.5555/876868.877803"
    },
    {
      "text": "Lange, B. M., Jones, M. A., and Meyers, J. L. Insight lab: An immersive team environment linking paper, displays, and data. In Proc. The 1998 Conference on Human Factors in Computing Systems (1998), 550--557.  ",
      "doi": "10.1145/274644.274718"
    },
    {
      "text": "Lu, X., and Lu, Z. A publishing framework for digitally augmented paper documents: Towards cross-media information integration. Lecture Notes in Computer Science 4261 (2006), 494--501.  ",
      "doi": "10.1007/11922162_57"
    },
    {
      "text": "Luff, P., Heath, C., Norrie, M., Signer, B., and Herdman, P. Only touching the surface: Creating affinities between digital content and paper. In Proc. The 2004 ACM conference on Computer supported cooperative work (2004), 523--532.  ",
      "doi": "10.1145/1031607.1031695"
    },
    {
      "text": "mecab 0.98. http://mecab.sourceforge.net.",
      "doi": ""
    },
    {
      "text": "Metaio Inc. http://www.metaio.com.",
      "doi": ""
    },
    {
      "text": "Mohan, A., Woo, G., Hiura, S., Smithwick, Q., and Raskar, R. Bokode: Imperceptible visual tags for camera based interaction from a distance. In Proc. International Conference on Computer Graphics and Interactive Techniques (2009), 1--8.  ",
      "doi": "10.1145/1576246.1531404"
    },
    {
      "text": "Nakai, T., Kise, K., and Iwamura, M. Camera based document image retrieval with more time and memory efficient LLAH. In Proc. International Workshop on Camera-Based Document Analysis and Recognition (2007), 21--28.",
      "doi": ""
    },
    {
      "text": "Nakai, T., Kise, K., and Iwamura, M. Real-time retrieval for images of documents in various languages using a web camera. In Proc. International Conference on Document Analysis and Recognition (2009), 146--150.  ",
      "doi": "10.1109/ICDAR.2009.125"
    },
    {
      "text": "QR code 2005 bar code symbology specification. Iso/iec 18004:2006.",
      "doi": ""
    },
    {
      "text": "Ryuji, M., Tatsuya, K., Toshikazu, T., Masashi, K., and Hisao, O. Connecting paper document to digital information using character recognition and word layout analysis. The IEICE transactions on information and systems (Japanese edition) J92-D, 6 (2009), 868--875.",
      "doi": ""
    },
    {
      "text": "Silberman, S. The hot new medium: Paper - how the oldest interface in the book is redrawing the map of the networked world. Wired Magazine, 9.04 (2001), 184--191.",
      "doi": ""
    },
    {
      "text": "tesseract 2.04. http://code.google.com/p/tesseract-ocr.",
      "doi": ""
    }
  ]
}