{
  "doi": "10.1145/1978942.1979378",
  "title": "Exploratory evaluations of a computer game supporting cognitive behavioural therapy for adolescents",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2937-2946",
  "year": 2011,
  "badges": [],
  "abstract": "The need to provide effective mental health treatments for adolescents has been described as a global public health challenge [27]. In this paper we discuss the exploratory evaluations of the first adolescent intervention to fully integrate a computer game implementing Cognitive Behavioural Therapy. Three distinct studies are presented: a detailed evaluation in which therapists independent of the design team used the game with 6 adolescents experiencing clinical anxiety disorders; a study in which a member of the design team used the game with 15 adolescents; and finally a study assessing the acceptability of the game and intervention with 216 practicing therapists. Findings are presented within the context of a framework for the design and evaluation of complex health interventions. The paper provides an in-depth insight into the use of therapeutic games to support adolescent interventions and provides stronger evidence than previously available for both their effectiveness and acceptability to stakeholders.",
  "tags": [
    "adolescent mental health",
    "computer games",
    "complex health interventions",
    "cognitive behavioural therapy",
    "evaluations"
  ],
  "authors": [
    {
      "name": "David Coyle",
      "institution": "University of Cambridge, Cambridge, United Kingdom and Trinity College, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81333488106/rel-imgonly/davidcoyle.jpg",
      "acmid": "81333488106",
      "orcid": "0000-0002-5103-0379"
    },
    {
      "name": "Nicola McGlade",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655537",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    },
    {
      "name": "Gary O'Reilly",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484653076",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abeles, P., Verduyn, C., Robinson, A., Smith, P., Yule, W. &amp;#38; Proudfoot, J. Computerized CBT for adolescent depression and its initial evaluation through an extended case series Behavioral and Cognitive Psychotherapy, 2009. 37 p. 151--165.",
      "doi": ""
    },
    {
      "text": "Barrett, P. M. Treatment of childhood anxiety: Developmental aspects. Clinical Psychology Review, 2000. 20 p. 479--494.",
      "doi": ""
    },
    {
      "text": "Beck, A. The Past and Future of Cognitive Therapy. Psychotherapy Practice and Research, 1997. 6(4) p.276--284.",
      "doi": ""
    },
    {
      "text": "Bickmore, T. &amp;#38; Gruber, A. Relational Agents in Clinical Psychiatry. Harvard Review of Psychiatry, 2010. 18(2).",
      "doi": ""
    },
    {
      "text": "BMA, Child and adolescent mental health - a guide for healthcare professionals. 2006, Board of Science of the British Medical Association: London.",
      "doi": ""
    },
    {
      "text": "Brezinka, V. Treasure Hunt - a serious game to support psychotherapeutic treatment. Stud Health Technol Inform, 2008. 136 p.71--76.",
      "doi": ""
    },
    {
      "text": "Campbell, M., Fitzpatrick, R., Haines, A., Kinmonth, A. L., Sandercock, P. &amp;#38; Tyrer, P. Framework for design and evaluation of complex interventions to improve health. British Medical Journal, 2000. 321 p.694--696.",
      "doi": ""
    },
    {
      "text": "Carr, A. What Works with Children, Adolescents and Adults? A Review of Research on the Effectiveness of Psychotherapy. 2009, London: Routledge.",
      "doi": ""
    },
    {
      "text": "Ceranoglu, T. A. Video Games in Psychotherapy. Review of General Psychology, 2010. 14(2) p.141--146.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., McDonald, D. &amp;#38; Landay, J. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proc ACM CHI'09 2009. p.405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Coyle, D. &amp;#38; Doherty, G. Clinical evaluations and collaborative design: developing new technologies for mental healthcare interventions. In Proc ACM CHI. 2009. p.2051--60.  ",
      "doi": "10.1145/1518701.1519013"
    },
    {
      "text": "Coyle, D., Doherty, G., Matthews, M. &amp;#38; Sharry, J. Computers in Talk-Based Mental Health Interventions. Interacting with Computers, 2007. 19(4) p.545--562.  ",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "Coyle, D., Doherty, G. &amp;#38; Sharry, J. An Evaluation of a Solution Focused Computer Game in Adolescent Interventions. Clin Child Psychology and Psychiatry, 2009. 14(3) p.345--360.",
      "doi": ""
    },
    {
      "text": "Cunningham, M., Wuthrich, V., Rapee, R., Lyneham, H., Schniering, C. &amp;#38; Hudson, J. The Cool Teens CD-ROM for anxiety disorders in adolescents: A pilot case series. European Child &amp;#38; Adolescent Psychiatry, 2009. 18(2) p.125--129.",
      "doi": ""
    },
    {
      "text": "Doherty, G., Coyle, D. &amp;#38; Matthews, M. Design and evaluation guidelines for mental health technologies. Interacting with Computers, 2010. 22(4).  ",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Druin The role of children in the design of new technology. Behaviour and Information Technology, 2002. 21 p.1--25.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. A Behavior Model for Persuasive Design. In Proc Persuasive'09. 2009.  ",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Gentile, D. A., Lynch, P. J., Linder, J. R. &amp;#38; Walsh, D. A. The effects of violent video game habits on adolescent hostility, aggressive behaviors, and school performance. Journal of Adolescence 2004. 27 p. 5--22.",
      "doi": ""
    },
    {
      "text": "Good, J. &amp;#38; Robertson, J. CARSS: A Framework for Learner-Centred Design with Children. International Journal of Artificial Intelligence in Education, 2006 p.381--413. ",
      "doi": "10.5555/1435358.1435362"
    },
    {
      "text": "Gregg, L. &amp;#38; Tarrier, N. Virtual reality in mental health: A review of the literature. Social Psychiatry and Psychiatric Epidemiology, 2007. 42(5) p.343--354.",
      "doi": ""
    },
    {
      "text": "Griffiths, M. D., The Therapeutic Value of Videogames, in Handbook of Computer Game Studies, J. Goldstein &amp;#38; Raessens, J., Eds. 2004, MIT Press: Boston. p.161--173.",
      "doi": ""
    },
    {
      "text": "Khanna, M. S. &amp;#38; Kendall, P. C. Computer-assisted CBT for child anxiety: The coping cat CD-ROM. Cognitive and Behavioral Practice, 2008. 15(2) p.159--165.",
      "doi": ""
    },
    {
      "text": "Markopoulos, P., Read, J., MacFarlane, S. &amp;#38; Hoysniemi, J., eds Evaluating Children's Interactive Products: Principles and Practices for Interaction Designers. Interactive Technologies. 2008, Morgan Kaufmann. ",
      "doi": "10.5555/1386295"
    },
    {
      "text": "Marks, I. M., Cavanagh, K. &amp;#38; Gega, L. Hands-on Help: Computer-aided Psychotherapy. 1st ed. 2007: Psychology Press Ltd.",
      "doi": ""
    },
    {
      "text": "Matthews, M., Doherty, G., Coyle, D. &amp;#38; Sharry, J., Designing mobile applications to support mental health interventions, in Handbook of Research on User Interface Design &amp;#38; Evaluation for Mobile Technology, J. Lumsden, Ed. 2007.",
      "doi": ""
    },
    {
      "text": "NICE, TA97 Computerised cognitive behavioural therapy for depression and anxiety. 2006: London.",
      "doi": ""
    },
    {
      "text": "Patel, V., Flisher, A.J., Hetrick, S. &amp;#38; McGorry, P. Mental health of young people: a global public-health challenge. The Lancet, 2007. 369 p.1302--1313.",
      "doi": ""
    },
    {
      "text": "Randell, R., Wilson, S. &amp;#38; Fitzpatrick, G. Evaluating New Interactions in Health Care: Challenges and Approaches. Int J of Human-Computer Interaction, 2010. 26(5) p.407--413.",
      "doi": ""
    },
    {
      "text": "Shandley, K., Austin, D., Klein, B. &amp;#38; Kyrios, M. An evaluation of 'Reach Out Central': an online game for supporting the mental health of young people. Health Education Research, 2010. 25(4) p.563--574.",
      "doi": ""
    },
    {
      "text": "Simon, G. &amp;#38; Ludman, E. It's time for disruptive innovation in psychotherapy. The Lancet, 2009. 374(9690) p.594--595.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Guzdial, M. &amp;#38; Hay, K. Learner-centered design: the challenge for HCI in the 21st century. Interactions, 1994. 1(2) p.36--48.  ",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "Tones, K. &amp;#38; Tilford, S. Health Promotion: Effectiveness, Efficiency and Equity. 2001, Cheltenham: Nelson Thornes.",
      "doi": ""
    },
    {
      "text": "Wong, W., Shen, C., Nocera, L., Carriazo, E., Tang, F., Bugga, S., Narayanan, H., Wang, H. &amp;#38; Ritterfeld, U. Serious video game effectiveness. In Proc ACE'07. 2007. p.49--55.  ",
      "doi": "10.1145/1255047.1255057"
    },
    {
      "text": "World Health Organisation, The Global Burden of Disease: 2004 update. 2004, WHO Press: Geneva.",
      "doi": ""
    },
    {
      "text": "World Health Organisation Prevalence, severity, and unmet need for treatment of mental disorders. Journal of the American Medical Association, 2004. 291(21).",
      "doi": ""
    }
  ]
}