{
  "doi": "10.1145/1978942.1979201",
  "title": "Pass-them-around: collaborative use of mobile phones for photo sharing",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1787-1796",
  "year": 2011,
  "badges": [],
  "abstract": "In this paper we explore shared collocated interactions with mobile phones. We introduce a phone-based application that allows a small group of collocated people to share photos using the metaphor of passing paper photos around. The prototype encourages people to share their devices and use them interchangeably while discussing photos face-to-face. The prototype supports ad-hoc photo sharing in different contexts by taking into account the spatial arrangement of users around a table, measured with sensors embedded in their mobile phones. Our evaluations show that people are willing to share and connect their mobile phones to engage in collaborative interactions. Participants were able to easily share their collections of photos using our proposed interaction techniques.",
  "authors": [
    {
      "name": "Andrés Lucero",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/do/10.1145/contrib-81314484387/rel-imgonly/81314484387.jpg",
      "acmid": "81314484387",
      "orcid": "missing"
    },
    {
      "name": "Jussi Holopainen",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100371737",
      "orcid": "missing"
    },
    {
      "name": "Tero Jokela",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408600326",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ah Kun L. M. and Marsden, G. Co-present photo sharing on mobile devices. In Proc. MobileHCI '07, ACM Press (2007), 277--284.  ",
      "doi": "10.1145/1377999.1378019"
    },
    {
      "text": "Ames, M., Eckles, D., Naaman, M., Spasojevic, M. and House, N. Requirements for mobile photoware. Personal Ubiquitous Comput. 14, 2 (2010), 95--109.  ",
      "doi": "10.1007/s00779-009-0237-4"
    },
    {
      "text": "Balabanovi, M., Chu, L. L. and Wolff, G. J. Storytelling with digital photographs. In Proc. CHI '00, ACM Press (2000), 564--571.  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Banks, R. and Sellen, A. Shoebox: mixing storage and display of digital images in the home. In Proc. TEI '09, ACM Press (2009), 35--40.  ",
      "doi": "10.1145/1517664.1517678"
    },
    {
      "text": "Belloni, F., Kainulainen, A., Richter, A., Kalliola, K. and Koivunen, V. Multi-Emitter Tracking System for Multi-Antenna Mobile Phones. In ICASSP 2009 Show and Tell (2009).",
      "doi": ""
    },
    {
      "text": "Chalfen, R. Snapshot Versions of Life. Bowling Green State University Press, Bowling Green, Ohio, 1987.",
      "doi": ""
    },
    {
      "text": "Cho, S., Murray-Smith, R. and Kim, Y. Multi-context photo browsing on mobile devices based on tilt dynamics. In Proc. MobileHCI '07, ACM Press (2007), 190--197.  ",
      "doi": "10.1145/1377999.1378006"
    },
    {
      "text": "Clawson, J., Voida, A., Patel, N. and Lyons, K. Mobiphos: a collocated-synchronous mobile photo sharing application. In Proc. MobileHCI '08, ACM Press (2008), 187--195.  ",
      "doi": "10.1145/1409240.1409261"
    },
    {
      "text": "Crabtree, A., Rodden, T. and Mariani, J. Collaborating around collections: informing the continued development of photoware. In Proc. CSCW '04, ACM Press (2004), 396--405.  ",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Frohlich, D., Kuchinsky, A., Pering, C., Don, A. and Ariss, S. Requirements for photoware. In Proc. CSCW '02, ACM Press (2002), 166--175.  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "1Frohlich, D. and Fennell, J. Sound, paper and memorabilia: resources for a simpler digital photography. Personal Ubiquitous Comput. 11, 2 (2007), 107--116.  ",
      "doi": "10.1007/s00779-006-0069-4"
    },
    {
      "text": "Gaver, B., Dunne, T. and Pacenti, E. Design: Cultural probes. interactions 6, 1 (1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Hassenzahl, M. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction 19, 4 (2004), 319--349.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "Hinckley, K. Synchronous gestures for multiple persons and computers. In Proc. UIST '03, ACM Press (2003), 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P. and Smith, M. Stitching: pen gestures that span multiple displays. In Proc. AVI '04, ACM Press (2004), 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Holtzblatt, K., Wendell, J.B. and Wood, S. Rapid Contextual Design. Morgan Kaufmann, 2005.",
      "doi": "10.1145/1066348.1066325"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proc. CHI '97, ACM Press (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Koskinen, I., Kurvinen, E. and Lehtonen, T.-K. Mobile Image. IT Press, 2002.",
      "doi": ""
    },
    {
      "text": "Kray, C., Rohs, M., Hook, J. and Kratz, S. Bridging the gap between the Kodak and the Flickr generations: A novel interaction technique for collocated photo sharing. Int. J. Hum.-Comput. Stud. 67, 12 (2009), 1060--1072.  ",
      "doi": "10.1016/j.ijhcs.2009.09.006"
    },
    {
      "text": "Lindley, S. E. Designing interfaces to afford enjoyable social interactions by collocated groups. In Proc. CHI '05, ACM Press (2005), 1122--1123.  ",
      "doi": "10.1145/1056808.1056842"
    },
    {
      "text": "2Lindley, S. and Monk, A. Designing appropriate affordances for electronic photo sharing media. In Proc. CHI '06, ACM Press (2006), 1031--1036.  ",
      "doi": "10.1145/1125451.1125648"
    },
    {
      "text": "2Lucero, A., Keränen, J. and Jokela, T. Social and spatial interactions: shared co-located mobile phone use. In Proc. CHI EA '10, ACM Press (2010), 3223--3228.  ",
      "doi": "10.1145/1753846.1753962"
    },
    {
      "text": "Lucero, A., Keränen, J. and Korhonen, H. Collaborative use of mobile phones for brainstorming. In Proc. MobileHCI '10, ACM Press (2010), 337--340.  ",
      "doi": "10.1145/1851600.1851659"
    },
    {
      "text": "Mäkelä, A., Giller, V., Tscheligi, M. and Sefelin, R. Joking, storytelling, artsharing, expressing affection: a field trial of how children and their social network communicate with digital images in leisure time. In Proc. CHI '00, ACM Press (2000), 548--555.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "Merrill, D., Kalanithi, J. and Maes, P. Siftables: towards sensor network user interfaces. In Proc. TEI '07, ACM Press (2007), 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Miller, A. D. and Edwards, W. K. Give and take: a study of consumer photo-sharing culture and practice. In Proc. CHI '07, ACM Press (2007), 347--356.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "Nacenta, M., Aliakseyeu, D., Subramanian, S. and Gutwin, C. A comparison of techniques for multi-display reaching. In Proc. CHI '05, ACM Press (2005), 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Nunes, M., Greenberg, S. and Neustaedter, C. Sharing digital photographs in the home through physical mementos, souvenirs, and keepsakes. In Proc. DIS '08, ACM Press (2008), 250--260.  ",
      "doi": "10.1145/1394445.1394472"
    },
    {
      "text": "Rekimoto, J., Ayatsuka, Y. and Kohno, M. SyncTap: an interaction technique for mobile networking. In Proc. MobileHCI '03, Springer LNCS 2795 (2003), 104--115.",
      "doi": ""
    },
    {
      "text": "Stelmaszewska, H., Fields, B. and Blandford, A. The roles of time, place, value and relationships in collocated photo sharing with camera phones. In Proc. British HCI '08, BCS (2008), 141--150. ",
      "doi": "10.5555/1531514.1531534"
    },
    {
      "text": "3Van House, N. A. Collocated photo sharing, story-telling, and the performance of self. Int. J. Hum.-Comput. Stud. 67, 12 (2009), 1073--1086..  ",
      "doi": "10.1016/j.ijhcs.2009.09.003"
    }
  ]
}