{
  "doi": "10.1145/1978942.1979393",
  "title": "The effects of interaction techniques on talk patterns in collaborative peer learning around interactive tables",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3043-3052",
  "year": 2011,
  "badges": [],
  "abstract": "This paper presents the findings of a user study investigating conversational patterns across three conditions of table-based interaction (direct touch interactive table, pantograph interactive table and non-digital table) for different types of educational activities. Findings demonstrate that communication style is significantly affected by interaction techniques. The direct touch technique stimulated conversations based around the topic and pedagogical method. The pantograph technique promoted playfulness and had a higher number of directive utterances between participants, with fewer task-based, group-oriented utterances. The non-digital table promoted reflective forms of task-orientated utterance, encouraged group communication and fostered more equitable participation between members. The findings provide insights into the design of interactive tables to support particular forms of social interaction.",
  "authors": [
    {
      "name": "Izdihar Jamil",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656392",
      "orcid": "missing"
    },
    {
      "name": "Kenton O'Hara",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Mark Perry",
      "institution": "Brunel University, Uxbridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100036324",
      "orcid": "missing"
    },
    {
      "name": "Abhijit Karnik",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81484644010/rel-imgonly/abe4-sq.jpg",
      "acmid": "81484644010",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Aronoff, M. and Rees-Miller, J. The handbook of linguistic. Blackwell Handbooks in Linguistics. Oxford:Blackwell, 2001.",
      "doi": ""
    },
    {
      "text": "Birnholtz, J.P., Grossman, T., Mak, C., and Balakrishnan, R. An exploratory study of input configuration and group process in a negotiation task using a large display. In Proc. of CHI 2007. ACM Press, pp: 91--100.  ",
      "doi": "10.1145/1240624.1240638"
    },
    {
      "text": "Cao, X., Lindley, S.E., Helmes, J., and Sellen, A. Telling the whole story: anticipation, inspiration and reputation in a field deployment of TellTable. In Proc. of CSCW 2010. ACM, pp: 251--260.  ",
      "doi": "10.1145/1718918.1718967"
    },
    {
      "text": "Cohen, E.G. Restructuring the Classroom: Conditions for productive small groups. In Review of Educational Research, 1994. 64(1): pp. 1--35.",
      "doi": ""
    },
    {
      "text": "Eisenberg, A.R. and Garvey, C. Children's use of verbal strategies in resolving conflicts. In Discourse Processes, 1981. 4: pp. 149--170.",
      "doi": ""
    },
    {
      "text": "Engleberg, I. and Wynn, D. Working in Groups. Communication Principles and Strategies. Houghton Mifflin Company, 2000.",
      "doi": ""
    },
    {
      "text": "Fless, J.L. Statistical methods for rates and proportions. New York: John Wiley & Sons, Inc, 1981.",
      "doi": ""
    },
    {
      "text": "Ha, V., Inkpen, K.M., Whalen, T., and Mandryk, R.L. Direct Intentions: The Effects of Input Devices on Collaboration around a Tabletop Display. In Proc. of the HIHS 2006. IEEE Computer Society, pp: 177--184.  ",
      "doi": "10.1109/TABLETOP.2006.10"
    },
    {
      "text": "Han, J.Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. of UIST 2005. ACM, pp: 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Harris, A., Rick, J., Bonnett, V., Yuill, N., Fleck, R., Marshall, P., and Rogers, Y. Around the table: are multiple-touch surfaces better than single-touch for children's collaborative interactions? In Proc. of CSCL 2009, pp: 335--344. ",
      "doi": "10.5555/1600053.1600104"
    },
    {
      "text": "1Hornecker, E., Marshall, P., Dalton, N.S., and Rogers, Y. Collaboration and interference: Awareness with Mice or Touch Input. In Proc. of CSCW 2008. ACM Press, pp: 167--176.  ",
      "doi": "10.1145/1460563.1460589"
    },
    {
      "text": "Kruger, A.C. and Tomasello, M. Transactive discussions with peers and adults. In Developmental Psychology, 1986. 22: pp. 681--685.",
      "doi": ""
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S.D., and Greenberg, S. Roles of Orientation in Tabletop Collaboration: Comprehension, Coordination and Communication. In Proc. of CSCW 2004. ACM Press, pp: 501--537.  ",
      "doi": "10.1007/s10606-004-5062-8"
    },
    {
      "text": "Nacenta, M.A., Aliakseyeu, D., Subramanian, S., and Gutwin, C. A comparison of techniques for multi-display reaching. In Proc. of CHI 2005. ACM, pp: 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Nacenta, M.A., Pinelle, D., Stuckel, D., and Gutwin, C. The effects of interaction technique on coordination in tabletop groupware. In Proc. of GI 2007. ACM Press, pp: 191--198.  ",
      "doi": "10.1145/1268517.1268550"
    },
    {
      "text": "Perlmutter, M., Behrend, S.D., Kuo, F., and Muller, A. Transactive discussions with peers and dults. In Developmental Psychology, 1986. 25: pp. 744--754.",
      "doi": ""
    },
    {
      "text": "Rogers, Y., Lim, Y.-K., Hazlewood, W., and Marshall, P. Equal Opportunities: Do Shareable Interfaces Promote More Group Participation Than Single User Displays? In Human-Computer Interaction, 2009. 24(2): pp. 79--116.",
      "doi": ""
    },
    {
      "text": "Rogoff, B. Apprentinces in thinking: Cognitive development in a Social Context. New York: Simon & Schuster, 1990.",
      "doi": ""
    },
    {
      "text": "Scott, S., Sheelagh, M., Carpendale, T., and Inkpen, K. Territoriality in collaborative tabletop workspaces. In Proc. of CSCW 2004. ACM Press, pp: 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Searle, J.R. Speech Acts. Cambridge University Press, 1969.",
      "doi": ""
    },
    {
      "text": "2Segal, L. Effects of Checklist Interface on Non-Verbal Crew communications 1994. NASA Research Cente.",
      "doi": ""
    },
    {
      "text": "2Teasley, S. The Role of Talk in Children's Peer Collaborations. In Developmental Psychology, 1995. 31(2).",
      "doi": ""
    },
    {
      "text": "Webb, N. Group composition, group interaction and achievement in cooperative small groups. In Journal of Educational Psychology, 1982. 74(4): pp. 475--484.",
      "doi": ""
    },
    {
      "text": "Webb, N. and Palincsar, A. Group processes in the classroom. In D.C. Berliner & R.C Calfee (Eds), Handbook of educational psychology. New York: Simon & Schuster, 1996..",
      "doi": ""
    }
  ]
}