{
  "doi": "10.1145/1978942.1979309",
  "title": "Magic desk: bringing multi-touch surfaces into desktop work",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2511-2520",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Despite the prominence of multi-touch technologies, there has been little work investigating its integration into the desktop environment. Bringing multi-touch into desktop computing would give users an additional input channel to leverage, enriching the current interaction paradigm dominated by a mouse and keyboard. We provide two main contributions in this domain. First, we describe the results from a study we performed, which systematically evaluates the various potential regions within the traditional desktop configuration that could become multi-touch enabled. The study sheds light on good or bad regions for multi-touch, and also the type of input most appropriate for each of these regions. Second, guided by the results from our study, we explore the design space of multi-touch-integrated desktop experiences. A set of new interaction techniques are coherently integrated into a desktop prototype, called Magic Desk, demonstrating potential uses for multi-touch enabled desktop configurations.",
  "authors": [
    {
      "name": "Xiaojun Bi",
      "institution": "Autodesk Research & University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485662",
      "orcid": "0000-0002-9716-7709"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Justin Matejka",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153192",
      "orcid": "missing"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    }
  ],
  "references": [
    {
      "text": "Apple Magic Mouse. http://www.apple.com.",
      "doi": ""
    },
    {
      "text": "Arai, T., Machii, K., Kuzunuki, S. and Shojima, H. (1995). InteractiveDESK: a computer-augmented desk which responds to operations on real objects. ACM CHI Poster 141--142.  ",
      "doi": "10.1145/223355.223470"
    },
    {
      "text": "Block, F., Gellersen, H., and Villar, N. (2010) Touch-Display Keyboards: Transforming Keyboards into Interactive Surfaces. ACM CHI. 1145--1154.  ",
      "doi": "10.1145/1753326.1753498"
    },
    {
      "text": "Bi, X., Balakrishnan, R. (2009) \"Comparing Usage of a Large High-Resolution Display to Single or Dual Desk-top Displays for Daily Work\". ACM CHI. 1005--1014.  ",
      "doi": "10.1145/1518701.1518855"
    },
    {
      "text": "Cotting, D. and Gross, M. (2006) Interactive environ-ment-aware display bubbles. ACM UIST 245--254.  ",
      "doi": "10.1145/1166253.1166291"
    },
    {
      "text": "Dell Latitude XT2 Tablet PC Touch Screen http://www.dell.com/tablet?s=biz&amp;#38;cs=555.",
      "doi": ""
    },
    {
      "text": "Dell SX2210T Multi-Touch Monitor http://support.dell.com/support/edocs/monitors/sx2210t.",
      "doi": ""
    },
    {
      "text": "Dietz, P. and Leigh, D. (2001) DiamondTouch: a multi-user touch technology. ACM UIST. 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Forlines, C, Wigdor, D., Shen, C., and Balakrishnan, R. (2007) Direct-touch vs. Mouse Input for Tabletop Dis-plays. ACM CHI. 647--656.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "Han, J. Y. (2005). Low-cost multi-touch sensing through frustrated total internal reflection. ACM UIST. 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hancock, M. and Booth, K. (2004). Improving menu placement strategies for pen input. Graphics Interface 221--230. ",
      "doi": "10.5555/1006058.1006085"
    },
    {
      "text": "Hartmann, B., Morris, M. R., Benko, H., and Wilson, A. D. (2009). Augmenting interactive tables with mice &amp;#38; keyboards. ACM UIST. 149--152.  ",
      "doi": "10.1145/1622176.1622204"
    },
    {
      "text": "Hedge, A., Anthropometry and Workspace Design, in DEA 325/651. 2002, Cornell.",
      "doi": ""
    },
    {
      "text": "Hinrichs, U., Hancock, M., Collins, C., and Carpendale, S. (2007) Examination of Text-Entry Methods for Tabletop Displays. Tabletop. 105--112.",
      "doi": ""
    },
    {
      "text": "Kane, S. K., Avrahami, D., Wobbrock, J. O., Harrison, B., Rea, A. D., Philipose, M., and LaMarca, A. (2009). Bonfire: a nomadic system for hybrid laptop-tabletop interaction. ACM UIST. 129--138.  ",
      "doi": "10.1145/1622176.1622202"
    },
    {
      "text": "Kin, K., Agrawala, M., and DeRose, T. (2009). Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation. GI. 119--124. ",
      "doi": "10.5555/1555880.1555910"
    },
    {
      "text": "Krueger, M. W., Gionfriddo, T., and Hinrichsen, K. (1985). VIDEOPLACE - an artificial reality. SIGCHI Bull. 35--40.  ",
      "doi": "10.1145/1165385.317463"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Baudel, T., and Buxton, B. (1997). The design of a GUI paradigm based on tablets, two-hands, and transparency. ACM CHI. 35--42.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Leithinger, D. Haller, M. (2007) Improving Menu Interaction for Cluttered Tabletop Setups with User-Drawn Path Menus. IEEE TableTop, 121--128.",
      "doi": ""
    },
    {
      "text": "Matthews, T., Czerwinski, M., Robertson, G., and Tan, D. (2006). Clipping lists and change borders: improving multitasking efficiency with peripheral information design. ACM CHI. 989--998.  ",
      "doi": "10.1145/1124772.1124920"
    },
    {
      "text": "Myers, B. A. (2001). Using handhelds and PCs together. Commun. ACM 44, 11, 34--41.  ",
      "doi": "10.1145/384150.384159"
    },
    {
      "text": "Morris, M. Brush, A. J., and Meyers, B. (2008) A Field Study of Knowledge Workers' Use of Interactive Horizontal Displays. TableTop. 105--112.",
      "doi": ""
    },
    {
      "text": "Moscovich, T. and Hughes, J. F. (2008). Indirect mappings of multi-touch input using one and two hands. ACM CHI. 1275--1284.  ",
      "doi": "10.1145/1357054.1357254"
    },
    {
      "text": "Multi-Touch in Windows 7. microsoft.com/window.",
      "doi": ""
    },
    {
      "text": "Pinhanez, C., Kjeldsen, R., Tang, L., Levas, A., Pod-laseck, M., Sukaviriya, N. and Pingali, G. (2003) Creating touch-screens anywhere with interactive projected displays. ACM MULTIMEDIA. 460--461.  ",
      "doi": "10.1145/957013.957112"
    },
    {
      "text": "Rekimoto, J. (2002) SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. ACM CHI. 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Rekimoto, J. and Saitoh, M. (1999) Augmented surfaces: a spatially continuous work space for hybrid computing environments. ACM CHI. 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Rosenberg, I. and Perlin, K. (2009). The UnMousePad: an interpolating multi-touch force-sensing input pad. SIGGRAPH. 1--9.  ",
      "doi": "10.1145/1576246.1531371"
    },
    {
      "text": "Scott, S. D. (2003) Territory-Based Interaction Techniques for Tabletop Collaboration. ACM UIST Companion. 17--20.",
      "doi": ""
    },
    {
      "text": "Steimle, J., Khalilbeigi, M., and M&amp;#252;hlh&amp;#228;user, M. (2010). Hybrid groups of printed and digital documents on tabletops: a study. ACM CHI EA. 3271--3276.  ",
      "doi": "10.1145/1753846.1753970"
    },
    {
      "text": "Ullmer, B. and Ishii, H. (1997) The metaDESK: Models and prototypes for tangible user interfaces. ACM UIST 223--232.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Villar, N., Izadi, S., Rosenfeld, D., Benko, H., Helmes, J., Westhues, J., Hodges, S., Ofek, E., Butler, A., Cao, X., and Chen, B. (2009). Mouse 2.0: multi-touch meets the mouse. ACM UIST. 33--42.  ",
      "doi": "10.1145/1622176.1622184"
    },
    {
      "text": "Vogel, D. and Balakrishnan, R. (2010). Occlusion-Aware Interfaces. ACM CHI. 263--272.  ",
      "doi": "10.1145/1753326.1753365"
    },
    {
      "text": "Wellner, P. (1993) Interacting with paper on the DigitalDesk. Communications of the ACM, 36 (7), 87--96.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Wigdor, D., Penn, G., Ryall, K., Esenther, A., Shen, C., (2007). Living with a Tabletop: Analysis and Observations of Long Term Office Use of a Multi-Touch Table. TableTop. 60--67.",
      "doi": ""
    },
    {
      "text": "Wigdor, D., Shen, C., Forlines, C., and Balakrishnan, R. (2006). Table-centric interactive spaces for real-time collaboration. AVI. 103--107.  ",
      "doi": "10.1145/1133265.1133286"
    },
    {
      "text": "Wilson, A. D. (2005) PlayAnywhere: a compact interactive tabletop projection-vision system. ACM UIST. 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Wilson, A. D., Izadi, S., Hilliges, O., Garcia-Mendoza, A. and Kirk, D. (2008) Bringing physics to the surface. ACM UIST. 67--76.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. (2003) Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. ACM UIST. 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Yang, X., Mak, E., McCallum, D., Irani, P., Cao, X. Izadi, S. (2010). LensMouse: Augmenting the mouse with an interactive touch display. ACM CHI. 2431--2440.  ",
      "doi": "10.1145/1753326.1753695"
    }
  ]
}