{
  "doi": "10.1145/1978942.1979028",
  "title": "Using interface cues in online health community boards to change impressions and encourage user contribution",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "599-608",
  "year": 2011,
  "badges": [],
  "abstract": "Online health message boards have become popular, as users not only gain information from other users but also share their own experiences. However, as with most venues of user-generated content, there is need to constantly make quality evaluations as one sifts through enormous amounts of content. Can interface cues, conveying (1) pedigree of users posting content and (2) popularity of the posted content, help new users efficiently make credibility assessments? Furthermore, can the assignment of these same cues to their own posts serve to motivate content generation on their part? These questions were investigated in a 2-session between-subjects experiment (N = 99) with a prototype of a message-board that experimentally varied interface cues, and found that popularity indicators are more influential than pedigree indicators for both evaluation of existing content and contribution of new content. Findings also suggest theoretical mechanisms - involving such concepts as perceived authority, bandwagon effects, sense of agency and sense of community - by which cues affect user experience, providing rich implications for designing and deploying interface cues.",
  "tags": [
    "authority cues",
    "health community boards",
    "sense of agency",
    "bandwagon cues",
    "user contribution",
    "heuristics",
    "sense of community"
  ],
  "authors": [
    {
      "name": "Hyang-Sook Kim",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714093",
      "orcid": "missing"
    },
    {
      "name": "S. Shyam Sundar",
      "institution": "The Pennsylvania State University, University Park, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    }
  ],
  "references": [
    {
      "text": "Aronson, E., Wilson, T. D. and Akert, R. M. Social psychology (7th ed.). Upper Saddle River, NJ: Pearson Prentice Hall. 2010.",
      "doi": ""
    },
    {
      "text": "Ajzen, I. and Fishbein, M. Understanding attitudes and predicting social behavior. Englewood Cliffs, NJ: Prentice-Hall. 1980.",
      "doi": ""
    },
    {
      "text": "Alexa.com. http://www.alexa.com.",
      "doi": ""
    },
    {
      "text": "Baxter, L., Egbert, N., and Ho, E. Everyday health communication experiences of college students. Journal of American College Health, 56, 4 (2008), 427--436.",
      "doi": ""
    },
    {
      "text": "Beenen, G., Ling., K., Wang, X., Chang, K., Frakowski, D., Resnick, P. and Kraut, R. E. Using social psychology to motivate contributions to online communities. In Proc. CSCW 2005, ACM Press (2005), 212--221.  ",
      "doi": "10.1145/1031607.1031642"
    },
    {
      "text": "Bishop, J. Increasing participation in online communities: A framework for human - computer interaction. Computers in Human Behavior, 23, (2007), 1881--1893.  ",
      "doi": "10.1016/j.chb.2005.11.004"
    },
    {
      "text": "Chen, S. and Chaiken, S. The Heuristic-Systematic Model in its broader context. In S. Chaiken &amp;#38; Y. Trope (Eds.), Dual-process theories in social psychology, pp. 73--96. New York, NY: The Guilford Press. 1999.",
      "doi": ""
    },
    {
      "text": "Chen, Y. F. Herd behavior in purchasing books online. Computers in Human Behavior, 24, (2007), 1977--1992.  ",
      "doi": "10.1016/j.chb.2007.08.004"
    },
    {
      "text": "Duan, W., Gu, B. and Whinston, A. B. Informational cascades and software adoption on the Internet: An empirical investigation. MIS Quarterly, 33, 1 (2009), 23--48. ",
      "doi": "10.5555/2017410.2017415"
    },
    {
      "text": "Farzan, R., DiMicco, J. M., Millen, D. R., Brownholtz, B., Geyer, W. and Dugan, C. Results from deploying a participation incentive mechanism within the enterprise. In Proc. CHI 2008, ACM Press (2008), 563--572.  ",
      "doi": "10.1145/1357054.1357145"
    },
    {
      "text": "Fiore, A. T., Tiernan, S. L. and Smith, M. A. Observed behavior and perceived value of authors in Usenet newsgroups: Bridging the gap. In Proc. CHI 2002, ACM Press (2002), 323--330.  ",
      "doi": "10.1145/503376.503434"
    },
    {
      "text": "Fogg, B. J. and Tseng, H. The elements of computer credibility. In Proc. Human Factors in Computing Systems, CHI 1990, ACM Press (1999), 80--87.  ",
      "doi": "10.1145/302979.303001"
    },
    {
      "text": "Fox, S. and Jones, S. The social life of health information. http://www.pewinternet.org/Reports/2009/8-The-Social-Life-of-Health-Information.aspx.",
      "doi": ""
    },
    {
      "text": "Hilligoss, B. and Rieh, S. Y. Developing a unifying framework of credibility assessment: Construct, heuristics, and interaction in context. Information Processing and Management, 44, (2008), 1467--1484.  ",
      "doi": "10.1016/j.ipm.2007.10.001"
    },
    {
      "text": "Hu, Y. and Sundar, S. S. Effects of online health sources on credibility and behavioral intentions. Communication Research, 37, (2010), 105--132.",
      "doi": ""
    },
    {
      "text": "Kalyanaraman, S. and Sundar, S. S. The psychological appeal of personalized online content in Web portals: Does customization affect attitudes and behavior? Journal of Communication, 56, (2006), 110--132.",
      "doi": ""
    },
    {
      "text": "Koh, Y. J. and Sundar, S. S. Effects of specialization in computers, web sites, and web agents on e-commerce trust. International Journal of Human-Computer Studies, 68, 12 (2010), 899--912.  ",
      "doi": "10.1016/j.ijhcs.2010.08.002"
    },
    {
      "text": "Lampe, C., Johnston, R. and Resnick, P. Follow the reader: Filtering comments on Slashdot. In Proc. Human Factors in Computing Systems, CHI 2007, ACM Press (2007), 1--10.  ",
      "doi": "10.1145/1240624.1240815"
    },
    {
      "text": "Lin, J. C.-C. Online stickiness: Its antecedents and effect on purchasing intention. Behavior &amp;#38; Information Technology, 26, 6 (2007), 507--516.  ",
      "doi": "10.1080/01449290600740843"
    },
    {
      "text": "Ma, M. and Agarwal, R. Through a class darkly: Information technology design, identity verification, and knowledge contribution in online communities. Information System Research, 18, 1 (2007), 42--67.  ",
      "doi": "10.1287/isre.1070.0113"
    },
    {
      "text": "McCroskey, J. C. and Teven, J. J. Goodwill: A reexamination of the construct and its measurement. Communication Monographs, 66, (1999), 90--103.",
      "doi": ""
    },
    {
      "text": "Metzger, M. J. Making sense of credibility on the Web: Models for evaluating online information and recommendations for future research. Journal of the American Society for Information Science and Technology, 58, 13 (2007), 2078--2091.  ",
      "doi": "10.5555/1315930.1315940"
    },
    {
      "text": "Stavrositu, C. and Sundar, S. S. Psychological empowerment derived from blogging: Is it agency or is it community? In Proc. the International Communication Association, Montreal, Canada, 2008.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S. The MAIN model: A heuristic approach to understanding technology effects on credibility. In M. J. Metzger &amp;#38; A. J. Flanagin (Eds.), Digital media, youth, and credibility, pp. 72--100. Cambridge, MA: The MIT Press 2008.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S. and Nass, C. Conceptualizing sources in online news. Journal of Communication, 51, (2001), 52--72.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., Oeldorf-Hirsch, A. and Xu, Q. The bandwagon effect of collaborative filtering technology. In Proc. CHI 2008, ACM Press (2008), 3453--3458.  ",
      "doi": "10.1145/1358628.1358873"
    },
    {
      "text": "Sundar, S. S., Rice, R. E. and Kim, H. S. Trends in online health information: New conceptualizations for a new medium. In Proc. the International Communication Association, Singapore, 2010.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., Xu, Q. and Oeldorf-Hirsch, A. Authority vs. peer: How interface cues influence users. In Proc. CHI 2009, ACM Press (2009), 4231--4236.  ",
      "doi": "10.1145/1520340.1520645"
    },
    {
      "text": "Surowiecki, J. The wisdom of crowds. Random House, Inc. 2004. ",
      "doi": "10.5555/1095645"
    },
    {
      "text": "Tedjamulia, S. J. J., Olsen, D. R., Dean, D. L. and Albrecht, C. C. Motivating content contributions to online communities: Toward a more comprehensive theory. In Proc. the 38th Annual Hawaii International Conference on System Sciences, (2005).  ",
      "doi": "10.1109/HICSS.2005.444"
    },
    {
      "text": "Wasko, M. M. and Faraj, S. Why should I share? Examining social capital and knowledge contribution in electronic networks of practice. MIS Quarterly, 29, 1 (2005), 35--57. ",
      "doi": "10.5555/2017245.2017249"
    },
    {
      "text": "Wu, F., Wilkinson, D. M. and Huberman, B. A. Feedback loops of attention in peer production. In Proc. Computational Science and Engineering, (2009), 409--415.  ",
      "doi": "10.1109/CSE.2009.430"
    },
    {
      "text": "Zaichkowsky, J. L. Measuring the involvement construct. Journal of Consumer Research, 12, (1985), 341--352.",
      "doi": ""
    }
  ]
}