{
  "doi": "10.1145/1978942.1979384",
  "title": "Tangible bots: interaction with active tangibles in tabletop interfaces",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2975-2984",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present interaction techniques for tangible tabletop interfaces that use active, motorized tangibles, what we call Tangible Bots. Tangible Bots can reflect changes in the digital model and assist users by haptic feedback, by correcting errors, by multi-touch control, and by allowing efficient interaction with multiple tangibles. A first study shows that Tangible Bots are usable for fine-grained manipulation (e.g., rotating tangibles to a particular orientation); for coarse movements, Tangible Bots become useful only when several tangibles are controlled simultaneously. Participants prefer Tangible Bots and find them less taxing than passive, non-motorized tangibles. A second study focuses on usefulness by studying how electronic musicians use Tangible Bots to create music with a tangible tabletop application. We conclude by discussing the further potential of active tangibles, and their relative benefits over passive tangibles and multi-touch.",
  "authors": [
    {
      "name": "Esben Warming Pedersen",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414616559",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Aronson, J. 1994. A pragmatic view of thematic analysis. Qualitative Report 2:1.",
      "doi": ""
    },
    {
      "text": "Brave, S., Ishii, H., and Dahley, A. 1998. Tangible interfaces for remote collaboration and communication. In Proc. CSCW 1998. ACM, New York, 169--178.  ",
      "doi": "10.1145/289444.289491"
    },
    {
      "text": "Bischof, M., Conradi, B., Lachenmaier, P., Linde, K., Meier, M., P&amp;#246;tzl, P., and Andr&amp;#233;, E. 2008. Xenakis: combining tangible interaction with probability-based musical composition. In Proc. TEI 2008. ACM, New York, NY, 121--124.  ",
      "doi": "10.1145/1347390.1347416"
    },
    {
      "text": "Chin, J. P., Diehl, V. A., and Norman, K. L. 1988. Development of an instrument measuring user satisfaction of the human-computer interface. In Proc. CHI 1988. ACM, New York, 213--218.  ",
      "doi": "10.1145/57167.57203"
    },
    {
      "text": "Frei, P., Su, V., Mikhak, B., and Ishii, H. 2000. curlybot: designing a new class of computational toys. In Proc. CHI 2000. ACM, New York, 129--136.  ",
      "doi": "10.1145/332040.332416"
    },
    {
      "text": "Hart and Staveland. Development of NASA-TLX: results of empirial and theoretical research. In Hancock, P. A., Meshkati, P. (Eds.), Human Mental Workload, Elsevier, Amsterdam. 139--183.",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Ullmer, B. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proc. CHI 2007. ACM, New York, NY, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Jord&amp;#224;, S., Geiger, G., Alonso, M., and Kaltenbrunner, M. 2007. The reacTable: exploring the synergy between live music performance and tabletop tangible interfaces. In Proc. TEI 2007. ACM, New York, 139--146.  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Kaltenbrunner, M. and Bencina, R. 2007. reacTIVision: a computer-vision framework for table-based tangible interaction. In Proc. TEI 2007. ACM, New York, 69--74.  ",
      "doi": "10.1145/1226969.1226983"
    },
    {
      "text": "Kato, J., Sakamoto, D., Inami, M., and Igarashi, T. 2009. Multi-touch interface for controlling multiple mobile robots. In Proc. CHI 2009. ACM, New York, NY, 3443--3448.  ",
      "doi": "10.1145/1520340.1520500"
    },
    {
      "text": "Kojima, M., Sugimoto, M., Nakamura, A., Tomita, M., Inami, M., and Nii, H. 2006. Augmented Coliseum: An Augmented Game Environment with Small Vehicles. In Proc. TABLETOP 2007. IEEE Computer Society, Washington, 3--8.  ",
      "doi": "10.1109/TABLETOP.2006.3"
    },
    {
      "text": "Kvale, S. 1996. Interviews: An Introduction to Qualitative Research Interviewing, Sage Publications, Thousand Oaks California.",
      "doi": ""
    },
    {
      "text": "Micire, M., Desai, M., Courtemanche, A., Tsui, K. M., and Yanco, H. A. 2009. Analysis of natural gestures for controlling robot teams on multi-touch tabletop surfaces. In Proc. ITS 2009. ACM, New York, 41--48.  ",
      "doi": "10.1145/1731903.1731912"
    },
    {
      "text": "Pangaro, G., Maynes-Aminzade, D., and Ishii, H. 2002. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proc. UIST 2002 ACM, New York, 181--190.  ",
      "doi": "10.1145/571985.572011"
    },
    {
      "text": "Patten, J. and Ishii, H. 2007. Mechanical constraints as computational constraints in tabletop tangible interfaces. In Proc. CHI 2007. ACM, New York, 809--818.  ",
      "doi": "10.1145/1240624.1240746"
    },
    {
      "text": "Patten, J., Recht, B., and Ishii, H. 2002. Audiopad: a tag-based interface for musical performance. In Proc. NIME 2002. National University of Singapore, Singapore, 1--6. ",
      "doi": "10.5555/1085171.1085175"
    },
    {
      "text": "Pedersen, E. W. and Hornb&amp;#230;k, K. 2009. mixiTUI: a tangible sequencer for electronic live performances. In Proc. TEI 2009. ACM, New York, 223--230.  ",
      "doi": "10.1145/1517664.1517713"
    },
    {
      "text": "Piper, B., Ratti, C., and Ishii, H. 2002. Illuminating clay: a 3-D tangible interface for landscape analysis. In Proc. CHI 2002. ACM. New York, 355--362.  ",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Ressler, S., Antonishek, B., Wang, Q., and Godil, A. 2001. Integrating active tangible devices with a synthetic environment for collaborative engineering. In Proc. Web3D 2001. ACM, New York, 93--100.  ",
      "doi": "10.1145/363361.363383"
    },
    {
      "text": "Richter, J., Thomas, B. H., Sugimoto, M., and Inami, M. 2007. Remote active tangible interactions. In Proc. TEI 200. ACM, New York, 39--42.  ",
      "doi": "10.1145/1226969.1226977"
    },
    {
      "text": "Rosenfeld, D., Zawadzki, M., Sudol, J., and Perlin, K. 2004. Physical Objects as Bidirectional User Interface Elements. IEEE Comput. Graph. Appl. 24, 1 (Jan. 2004), 44--49.  ",
      "doi": "10.1109/MCG.2004.1255808"
    },
    {
      "text": "Sch&amp;#246;ning, J., Brandl, P., Daiber, F., Echtler, F., Hilliges, O., Hook, J., L&amp;#246;chtefeld, M., Motamedi, N., Muller, L., Olivier, P., Roth, T. and Zadow, U. von Sch&amp;#246;ning. 2008. Multi-touch surfaces: A technical guide. In Technical Report TUM-I0833, Technical Reports of the Technical University of Munich, (October 2008).",
      "doi": ""
    },
    {
      "text": "Ullmer, B. and Ishii, H. 2000. Emerging frameworks for tangible user interfaces. In IBM Syst. J. 39, 3-4 (Jul. 2000), 915--931.  ",
      "doi": "10.1147/sj.393.0915"
    },
    {
      "text": "Underkoffler, J. and Ishii, H. 1999. Urp: a luminous-tangible workbench for urban planning and design. In Proc. CHI 1999. ACM, New York, 386--393.  ",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Weiss, M., Schwarz, F., Jakubowski, S., Borchers, J. 2010. Madgets: Actuating Widgets on Interactive Tabletops. In Proc. UIST 2010. ACM, New York.  ",
      "doi": "10.1145/1866029.1866075"
    },
    {
      "text": "Yanco, H. A. and Drury, J. L. Classifying Human-Robot Interaction: An Updated Taxonomy. In Proceedings of the IEEE Conference on Systems, Man and Cybernetics, October 2004.",
      "doi": ""
    }
  ]
}