{
  "doi": "10.1145/1978942.1979195",
  "title": "KronoMiner: using multi-foci navigation for the visual exploration of time-series data",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1737-1746",
  "year": 2011,
  "badges": [],
  "abstract": "The need for pattern discovery in long time-series data led researchers to develop interactive visualization tools and analytical algorithms for gaining insight into the data. Most of the literature on time-series data visualization either focus on a small number of tasks or a specific domain. We propose KronoMiner, a tool that embeds new interaction and visualization techniques as well as analytical capabilities for the visual exploration of time-series data. The interface's design has been iteratively refined based on feedback from expert users. Qualitative evaluation with an expert user not involved in the design process indicates that our prototype is promising for further research.",
  "authors": [
    {
      "name": "Jian Zhao",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81484648585/rel-imgonly/dsc_7313__jian_zhao_portrait_large_.jpg",
      "acmid": "81484648585",
      "orcid": "missing"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "Ontario College of Art & Design University, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "W. Aigner, S. Miksch, W. M&amp;#252;ller, H. Schumann, and C. Tominski. Visualizing time-oriented data-a systematic view. Comput. Graph., 31(3):401--409, June 2007.  ",
      "doi": "10.1016/j.cag.2007.01.030"
    },
    {
      "text": "W. Aigner, S. Miksch, W. M&amp;#252;ller, H. Schumann, and C. Tominski. Visual methods for analyzing time-oriented data. IEEE TVCG, 14(1):47--60, 2008.  ",
      "doi": "10.1109/TVCG.2007.70415"
    },
    {
      "text": "C. Appert and J.-D. Fekete. Orthozoom scroller: 1d multi-scale navigation. In Proc. CHI'06, 21--30, 2006.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "E. A. Bier, M. C. Stone, K. Pier, W. Buxton, and T. D. DeRose. Toolglass and magic lenses: the see-through interface. In SIGGRAPH '93, 73--80, 1993.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "P. Buono, A. Aris, C. Plaisant, A. Khella, and B. Shneiderman. Interactive pattern search in time series. In Proc. of Visualization and Data Analysis, 175--186, 2005.",
      "doi": ""
    },
    {
      "text": "W. Chung, H. Chen, L. G. Chaboya, C. D. O'Toole, and H. Atabakhsh. Evaluating event visualization: a usability study of coplink spatio-temporal visualizer. Int. J. Hum.-Comput. Stud., 62(1):127--157, 2005.  ",
      "doi": "10.1016/j.ijhcs.2004.08.005"
    },
    {
      "text": "P. Dragicevic and S. Huot. Spiraclock: a continuous and non-intrusive display for upcoming events. In Proc. CHI'02, 604--605, 2002.  ",
      "doi": "10.1145/506443.506505"
    },
    {
      "text": "G. M. Draper, Y. Livnat, and R. F. Riesenfeld. A survey of radial methods for information visualization. IEEE TVCG, 15(5):759--776, 2009.  ",
      "doi": "10.1109/TVCG.2009.23"
    },
    {
      "text": "N. Elmqvist, Y. Riche, N. H. Riche, and J.-D. Fekete. Melange: Space folding for visual exploration. IEEE TVCG, 16(3):468--483, 2010.  ",
      "doi": "10.1109/TVCG.2009.86"
    },
    {
      "text": "J. Fails, A. Karlson, L. Shahamat, and B. Shneiderman. A visual interface for multivariate temporal data: Finding patterns of events across multiple histories. Symposium On Visual Analytics Science And Technology, 0:167--174, 2006.",
      "doi": ""
    },
    {
      "text": "P. Fitts and J. Peterson. Information capacity of discrete motor responses. Jrnl of Experimental Psychology, 67:103--112, 1964.",
      "doi": ""
    },
    {
      "text": "J. Gao, Y. Cao, W.-w. Tung, and J. Hu. Multiscale Analysis of Complex Time Series: Integration of Chaos and Random Fractal Theory, and Beyond. Wiley-Interscience, 2007. ",
      "doi": "10.5555/1324789"
    },
    {
      "text": "J. Heer, N. Kong, and M. Agrawala. Sizing the horizon: The effects of chart size and layering on the graphical perception of time series visualizations. In Proc. CHI'09, 2009.  ",
      "doi": "10.1145/1518701.1518897"
    },
    {
      "text": "J. Heer, J. Mackinlay, C. Stolte, and M. Agrawala. Graphical histories for visualization: Supporting analysis, communication, and evaluation. IEEE TVCG, 14:1189--1196, 2008.  ",
      "doi": "10.1109/TVCG.2008.137"
    },
    {
      "text": "H. Hochheiser and B. Shneiderman. Dynamic query tools for time series data sets: timebox widgets for interactive exploration. Information Visualization, 3(1):1--18, 2004.  ",
      "doi": "10.1145/993176.993177"
    },
    {
      "text": "D. Holten. Hierarchical edge bundles: Visualization of adjacency relations in hierarchical data. IEEE Transactions on Visualization and Computer Graphics, 12:741--748, 2006.  ",
      "doi": "10.1109/TVCG.2006.147"
    },
    {
      "text": "W. Javed and N. Elmqvist. Stack zooming for multi-focus interaction in time-series data visualization. In PacificVis'10, 33--40, 2010.",
      "doi": ""
    },
    {
      "text": "W. Javed, B. McDonnel, and N. Elmqvist. Graphical perception of multiple time series. IEEE TVCG, 16(6):927--934, 2010.  ",
      "doi": "10.1109/TVCG.2010.162"
    },
    {
      "text": "E. J. Keogh and M. J. Pazzani. Relevance feedback retrieval of time series data. In SIGIR'99, 183--190, 1999.  ",
      "doi": "10.1145/312624.312676"
    },
    {
      "text": "R. Lopez-hernandez, D. Guilmaine, M. J. Mcguffin, and L. Barford. A layer-oriented interface for visualizing time-series data from oscilloscopes. In PacificVis'10, 41--48, 2010.",
      "doi": ""
    },
    {
      "text": "M. J. McGuffin and I. Jurisica. Interaction techniques for selecting and manipulating subgraphs in network visualizations. IEEE TVCG, 15(6):937--944, 2009.  ",
      "doi": "10.1109/TVCG.2009.151"
    },
    {
      "text": "P. McLachlan, T. Munzner, E. Koutsofios, and S. North. Liverac: interactive visual exploration of system management time-series data. In Proc. CHI'08, 1483--1492, 2008.  ",
      "doi": "10.1145/1357054.1357286"
    },
    {
      "text": "M. D. Meyer, T. Munzner, and H. Pfister. Mizbee: A multiscale synteny browser. IEEE TVCG, 15(6):897--904, 2009.  ",
      "doi": "10.1109/TVCG.2009.167"
    },
    {
      "text": "W. M&amp;#252;ller and H. Schumann. Visualization methods for time-dependant data-an overview. In Proc. of the 2003 Winter Simulation Conference, 737--745, 2003. ",
      "doi": "10.5555/1030818.1030916"
    },
    {
      "text": "C. Plaisant, B. Milash, A. Rose, S. Widoff, and B. Shneiderman. Lifelines: visualizing personal histories. In Proc. CHI'96, 221--227, 1996.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "H. A. Richter, J. A. Brotherton, G. Abowd, and K. N. Truong. A multi-scale timeline slider for stream visualization and control. Technical report, Georgia Institute of Technology, 1999.",
      "doi": ""
    },
    {
      "text": "B. Shneiderman. Direct manipulation: A step beyond programming languages. Computer, 16:57--69, 1983.  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "B. Shneiderman. The eyes have it: A task by data type taxonomy for information visualizations. In VL, 336--343, 1996. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "S. F. Silva and T. Catarci. Visualization of linear time-oriented data: A survey. Proc. of the Int. Conf. on Web Information Systems Engineering, 310, 2000. ",
      "doi": "10.5555/882511.885379"
    },
    {
      "text": "C. Tominski, J. Abello, and H. Schumann. Axes-based visualizations with radial layouts. In SAC'04: Proc. of the Symp. on Applied computing, 1242--1247, 2004.  ",
      "doi": "10.1145/967900.968153"
    },
    {
      "text": "J. W. Tukey. Exploratory Data Analysis. Addison-Wesley, 1977.",
      "doi": ""
    },
    {
      "text": "J. J. Van Wijk. Cluster and calendar based visualization of time series data. In Proc. INFOVIS'99, 4--9, 1999. ",
      "doi": "10.5555/857189.857665"
    },
    {
      "text": "M. Weber, M. Alexa, and W. M&amp;#252;ller. Visualizing time-series on spirals. In Proc. INFOVIS'01, 7, 2001. ",
      "doi": "10.5555/580582.857719"
    }
  ]
}