{
  "doi": "10.1145/1978942.1979257",
  "title": "Deep shot: a framework for migrating tasks across devices using mobile phone cameras",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2163-2172",
  "year": 2011,
  "badges": [],
  "abstract": "A user task often spans multiple heterogeneous devices, e.g., working on a PC in the office and continuing the work on a laptop or a mobile phone while commuting on a shuttle. However, there is a lack of support for users to easily migrate their tasks across devices. To address this problem, we created Deep Shot, a framework for capturing the user's work state that is needed for a task (e.g., the specific part of a webpage being viewed) and resuming it on a different device. In particular, Deep Shot supports two novel and intuitive interaction techniques, deep shooting and deep posting, for pulling and pushing work states, respectively, using a mobile phone camera. In addition, Deep Shot provides a concise API for developers to leverage its services and make their application states migratable. We demonstrated that Deep Shot can be used to support a range of everyday tasks migrating across devices. An evaluation consisting of a series of experiments showed that our framework and techniques are feasible.",
  "tags": [
    "camera",
    "multi-device environment",
    "task migration.",
    "computer vision",
    "mobile interaction"
  ],
  "authors": [
    {
      "name": "Tsung-Hsiang Chang",
      "institution": "MIT CSAIL, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443594559",
      "orcid": "missing"
    },
    {
      "name": "Yang Li",
      "institution": "Google Research, Mountain View, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Bandelloni, R. and PaternF, F. Migratory User Interfaces Able To Adapt To Various Interaction Platforms. International journal of human-computer studies, 2004.",
      "doi": ""
    },
    {
      "text": "Bardram, JE. Activity-Based Computing: Support For Mobility And Collaboration In Ubiquitous Computing. Personal and Ubiquitous Computing, 2005.  ",
      "doi": "10.1007/s00779-004-0335-2"
    },
    {
      "text": "Bardram, JE., Bunde-Pedersen, J., and Soegaard, M. Support For Activity-Based Computing In A Personal Computing Operating System. Proc. CHI '06.  ",
      "doi": "10.1145/1124772.1124805"
    },
    {
      "text": "Bay, H., Tuytelaars, T., and Van Gool, L. SURF: Speeded Up Robust Features. Proc. CVIU, 2008.  ",
      "doi": "10.1016/j.cviu.2007.09.014"
    },
    {
      "text": "Boring, S., Altendorfer, M., Broll, G., and et al. Shoot & Copy: Phonecam-Based Information Transfer From Public Displays Onto Mobile Phones. Proc. Mobility '07.  ",
      "doi": "10.1145/1378063.1378068"
    },
    {
      "text": "Boring, S., Baur, D., Butz, A., and et al. Touch Projector: Mobile Interaction through Video. Proc. CHI '10.  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Dearman, D and Pierce, JS. \"It's On My Other Computer!\": Computing With Multiple Devices. Proc. CHI '08.  ",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Google Chrome to Phone. http://code.google.com/p/chrometophone.",
      "doi": ""
    },
    {
      "text": "Hinckley, K. Synchronous Gestures For Multiple Persons And Computers. Proc. UIST '03.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "10. Hupp, D. and Miller, RC. Smart Bookmarks: Automatic Retroactive Macro Recording On The Web. Proc. UIST '07.  ",
      "doi": "10.1145/1294211.1294226"
    },
    {
      "text": "11. Karlson, A., Iqbal, S., Meyers, and Tang, J. Mobile Taskflow in Context: A Screenshot Study of Smartphone Usage. Proc. CHI '10.  ",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "12. Li, Y., and Landay, J. Activity-based prototyping of ubicomp applications for long-lived, everyday human activities, Proc. CHI'08.  ",
      "doi": "10.1145/1357054.1357259"
    },
    {
      "text": "13. Liao, C., Liu, Q., and et al. Pacer: Fine-grained Interactive Paper via Camera-touch Hybrid Gestures on a Cell Phone. Proc. CHI '10.  ",
      "doi": "10.1145/1753326.1753696"
    },
    {
      "text": "14. Liu, Q., McEvoy, P., and Lai, C.-J. Mobile camera supported document redirection. Proc. MM '06.  ",
      "doi": "10.1145/1180639.1180811"
    },
    {
      "text": "15. Miller, RC and Myers, BA. Synchronizing Clipboards Of Multiple Computers. Proc. UIST '99.  ",
      "doi": "10.1145/320719.322584"
    },
    {
      "text": "16. Pierce, J. and Nichols, J. An Infrastructure For Extending Applications' User Experiences Across Multiple Personal Devices. Proc. UIST '08.  ",
      "doi": "10.1145/1449715.1449733"
    },
    {
      "text": "17. Rekimoto, J. Pick-And-Drop: A Direct Manipulation Technique For Multiple Computer Environments. Proc. UIST '97.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "18. Rekimoto, J and Saitoh, M. Augmented Surfaces: A Spatially Continuous Work Space For Hybrid Computing Environments. Proc. CHI '99.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "19. Schilit, B and Sengupta, U. Device Ensembles. Computer, IEEE Computer Socity, 2004.  ",
      "doi": "10.1109/MC.2004.241"
    },
    {
      "text": "20. Tang, J., Lin, J., and et al. Recent Shortcuts: Using Recent Interactions To Support Shared Activities. Proc. CHI '07.  ",
      "doi": "10.1145/1240624.1240816"
    },
    {
      "text": "21. Tan, DS., Meyers, B., and Czerwinski, M. WinCuts: manipulating arbitrary window regions for more effective use of screen space. Proc. CHI '04.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "22. Want, R, Fishkin, K, and Gujar, A. Bridging Physical And Virtual Worlds With Electronic Tags. Proc. CHI '99..  ",
      "doi": "10.1145/302979.303111"
    }
  ]
}