{
  "doi": "10.1145/1978942.1979199",
  "title": "Automics: souvenir generating photoware for theme parks",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1767-1776",
  "year": 2011,
  "badges": [],
  "abstract": "Automics is a photo-souvenir service which utilises mobile devices to support the capture, sharing and annotation of digital images amongst groups of visitors to theme parks. The prototype service mixes individual and group photo-capture with existing in-park, on-ride photo services, to allow users to create printed photo-stories. Herein we discuss initial fieldwork in theme parks that grounded the design of Automics, our development of the service prototype, and its real-world evaluation with theme park visitors. We relate our findings on user experience of the service to a literature on mobile photoware, finding implications for the design of souvenir services.",
  "authors": [
    {
      "name": "Abigail Durrant",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488179",
      "orcid": "0000-0003-4752-5376"
    },
    {
      "name": "Duncan Rowland",
      "institution": "University of Lincoln, Lincoln, United Kingdom",
      "img": "/do/10.1145/contrib-81311485174/rel-imgonly/duncan.jpg",
      "acmid": "81311485174",
      "orcid": "missing"
    },
    {
      "name": "David S. Kirk",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Steve Benford",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Joel E. Fischer",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81416603014/rel-imgonly/joel.jpg",
      "acmid": "81416603014",
      "orcid": "missing"
    },
    {
      "name": "Derek McAuley",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100478505",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M., Eckles, D., Naaman, M., Spasojevic, M., and House, N. 2010. Requirements for mobile photoware. Personal Ubiquitous Comput. 14, 2, 95--109.  ",
      "doi": "10.1007/s00779-009-0237-4"
    },
    {
      "text": "Brown, B. and Chalmers, M. 2003. Tourism and mobile technology. In Proc. of ECSCW. Kluwer, 335--354. ",
      "doi": "10.5555/1241889.1241907"
    },
    {
      "text": "Counts, S. and Fellheimer, E. 2004. Supporting social presence through lightweight photo sharing on and off the desktop. In Proc. of CHI. ACM, 599--606.  ",
      "doi": "10.1145/985692.985768"
    },
    {
      "text": "Cross, G. S. & Walton, J. K. The Playful Crowd: Pleasure Places in the Twentieth Century. Columbia University Press, 2005.",
      "doi": ""
    },
    {
      "text": "Engström, A., Esbjörnsson, M., and Juhlin, O. 2008. Mobile collaborative live video mixing. In Proc. of MobileHCI . ACM, 157--166.  ",
      "doi": "10.1145/1409240.1409258"
    },
    {
      "text": "Frohlich, D. M. 2004 Audiophotography: Bringing Photos to Life with Sounds. Springer-Verlag New York. ",
      "doi": "10.5555/1210132"
    },
    {
      "text": "Jacucci, G., Oulasvirta, A., and Salovaara, A. 2007. Active construction of experience through mobile media: a field study with implications for recording and sharing. Personal Ubiquitous Comput. 11, 4, 215--234.  ",
      "doi": "10.1007/s00779-006-0084-5"
    },
    {
      "text": "Jones, K. R., and Wills, J. The Invention of the Park: From the Garden of Eden to Disney's Magic Kingdom. Polity Press, 2005.",
      "doi": ""
    },
    {
      "text": "Kirk, D. S., Izadi, S., Sellen, A., Taylor, S., Banks, R., and Hilliges, O. 2010. Opening up the family archive. In Proc. of CSCW. ACM, 261--270.  ",
      "doi": "10.1145/1718918.1718968"
    },
    {
      "text": "Kirk, D., Sellen, A., Rother, C., & Wood, K. 2006. Understanding photowork. In Proc. of CHI. ACM, 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Lindley, S. E., Durrant, A., Kirk, D., and Taylor, A. S. 2009. Editorial: Collocated social practices surrounding photos. Int. J. Hum.-Comput. Stud. 67, 12, 995--1004.  ",
      "doi": "10.1016/j.ijhcs.2009.08.004"
    },
    {
      "text": "Miller, A. D. and Edwards, W. K. 2007. Give and take: a study of consumer photo-sharing culture and practice. In Proc. of CHI. ACM, 347--356.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "Patel, N., Clawson, J., Voida, A., and Lyons, K. 2009. Mobiphos: A study of user engagement with a mobile collocated-synchronous photo sharing application. Int. J. Hum.-Comput. Stud. 67, 12, 1048--1059.  ",
      "doi": "10.1016/j.ijhcs.2009.09.002"
    },
    {
      "text": "Pausch, R., Snoddy, J., Taylor, R., Watson, S., and Haseltine, E. 1996. Disney's Aladdin: first steps toward storytelling in virtual reality, in Proc. SIGGRAPH96, ACM Press (1996), 193--203.  ",
      "doi": "10.1145/237170.237257"
    },
    {
      "text": "Rowland, D., Porter, D., Gibson, M., Walker, K, Underwood, J. et al. 2010. Sequential Art for Science and CHI, Extended Abstracts of CHI 2010, ACM.  ",
      "doi": "10.1145/1753846.1753848"
    },
    {
      "text": "Salovaara, A., Appropriation of a MMS-Based Comic Creator: From System Functionalities to Resources for Action, CHI 2007, 1117--1126, San Jose, 2-7, ACM.  ",
      "doi": "10.1145/1240624.1240794"
    },
    {
      "text": "Salovaara, A., Jacucci, G., Oulasvirta, A., Saari, T., Kanerva, P., Kurvinen, E., and Tiitta, S. 2006. Collective creation and sense-making of mobile media. In Proc. of CHI. ACM, NY, 1211--1220.  ",
      "doi": "10.1145/1124772.1124954"
    },
    {
      "text": "Sarvas, R., Oulasvirta, A., & Jacucci, G. 2005. Building social discourse around mobile photos: a systemic perspective. In Proc. of MobileHCI, ACM, 31--38.  ",
      "doi": "10.1145/1085777.1085783"
    },
    {
      "text": "Schnädelbach H., Rennick Egglestone, S., Reeves, S., Benford, S., Walker, B., Wright, M., Performing Thrill: Designing Telemetry Systems and Spectator Interfaces for Amusement Rides, CHI 2008, Florence, 2008.",
      "doi": ""
    },
    {
      "text": "van Dijck, J. 2007. Mediated Memories in the Digital Age. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Van House, N. A. 2009. Collocated photo sharing, story-telling, and the performance of self. Int. J. Hum.-Comput. Stud. 67, 12, 1073--1086.  ",
      "doi": "10.1016/j.ijhcs.2009.09.003"
    }
  ]
}