{
  "doi": "10.1145/1978942.1979062",
  "title": "The impact on musculoskeletal system during multitouch tablet interactions",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "825-828",
  "year": 2011,
  "badges": [],
  "abstract": "HCI researchers and technologists have heralded multitouch interaction as the technology to drive computing systems into the future. However, as we move towards a world where interaction is based on human body movements that are not well documented or studied, we face a serious and a grave risk of creating technology and systems that may lead to musculoskeletal disorders (MSD's). Designers need to be empowered with objective data on the impact of multitouch interactions on the musculoskeletal system to make informed choices in interaction design. In this paper we present an experiment that documents kinematic (movement) and kinetic measures (EMG) when interacting with a multitouch tablet. Results show that multitouch interaction can induce significant stress that may lead to MSDs and care must be taken when designing multitouch interaction.",
  "authors": [
    {
      "name": "Cecil Lozano",
      "institution": "Arizona State University, Tempe, Arizona, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484648059",
      "orcid": "missing"
    },
    {
      "name": "Devin Jindrich",
      "institution": "Arizona State University, Tempe, Arizona, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484646902",
      "orcid": "missing"
    },
    {
      "name": "Kanav Kahol",
      "institution": "Arizona State University, Tempe, Arizona, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309505689",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "(BLS), B.o.L.S., Reports on survey of occupational injuries and illnesses in 1977--2001. (2002).",
      "doi": ""
    },
    {
      "text": "Buxton, B. Multitouch Systems that I have known and loved. http://www.billbuxton.com/multitouchOverview.html, (2008).",
      "doi": ""
    },
    {
      "text": "Cram, J. and E. Criswell, Introduction to surface electromyography. Second ed. (2010): David Cella. 412.",
      "doi": ""
    },
    {
      "text": "Laursen, B., B. R. Jensen, and A. Ratkevicius, Performance and muscle activity during computer mouse tasks in young and elderly adults. European Journal of Applied Physiology. 84(4), (2001), 329--336.",
      "doi": ""
    },
    {
      "text": "NSR/IOM, N.R.C.a.I.o.M.C., Musculoskeletal disorders and the workplace: low back and upper extremities. (2001), Washington, D.C.: National Academy Press.",
      "doi": ""
    },
    {
      "text": "Oliveira, L. F., et al., Effect of the shoulder position on the biceps brachii EMG in different dumbbell curls. Journal of Sports Science and Medicine. 8(1), (2009), 24--29.",
      "doi": ""
    },
    {
      "text": "Sommerich, C. M., W. S. Marras, and M. Parnianpour, A method for developing biomechanical profiles of hand-intensive tasks. Clinical Biomechanics. 13(4-5), (1998), 261--271.",
      "doi": ""
    }
  ]
}