{
  "doi": "10.1145/1978942.1979258",
  "title": "Eyes-free multitasking: the effect of cognitive load on mobile spatial audio interfaces",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2173-2176",
  "year": 2011,
  "badges": [
    "Best Paper"
  ],
  "abstract": "As mobile devices increase in functionality, users perform more tasks when on the move. Spatial audio interfaces offer a solution for eyes-free interaction. However, such interfaces face a number of challenges when supporting multiple and simultaneous tasks, namely: 1) interference amongst multiple audio streams, and 2) the constraints of cognitive load. We present a comparative study of spatial audio techniques evaluated in a divided- and selective-attention task. A podcast was used for high cognitive load (divided-attention) and classical music for low cognitive load (selective-attention), while interacting with an audio menu. Results showed that spatial audio techniques were preferred when cognitive load was kept low, while a baseline technique using an interruptible single audio stream was significantly less preferred. Conversely, when cognitive load was increased the preferences reversed. Thus, given an appropriate task structure, spatial techniques offer a means of designing effective audio interfaces to support eyes-free mobile multitasking.",
  "authors": [
    {
      "name": "Yolanda Vazquez-Alvarez",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81416606943/rel-imgonly/cv_photo.jpg",
      "acmid": "81416606943",
      "orcid": "missing"
    },
    {
      "name": "Stephen A. Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    }
  ],
  "references": [
    {
      "text": "Schmandt, C., and Mullins, A. AudioStreamer: exploiting simultaneity for listening. In Proc. CHI 1995, ACM Press (1995), 218--219.  ",
      "doi": "10.1145/223355.223533"
    },
    {
      "text": "Walker, A. and Brewster, S. A. Spatial audio in small screen device displays. Personal Technologies 4, 2 (2000), 144--154.",
      "doi": ""
    },
    {
      "text": "Bronkhorst, A. W. The cocktail party phenomenon: a review of research on speech intelligibility in multiple-talker conditions. Acustica 86 (2000), 117--128.",
      "doi": ""
    },
    {
      "text": "Draycott, S. G., and Kline, P. Validation of the AGARD STRES Battery of Performance Tests. Human Factors 38, 2 (1996), 347--361.",
      "doi": ""
    },
    {
      "text": "Marentakis, G. and Brewster, S. A. A comparison of feedback cues for enhancing pointing efficiency in interaction with spatial audio displays. In Proc. MobileHCI 2005, ACM Press (2005), 55--62.  ",
      "doi": "10.1145/1085777.1085787"
    },
    {
      "text": "Shinn-Cunningham, B. G. and Ihlefeld, A. Selective and divided attention: extracting information from simultaneous sound sources. In Proc. ICAD 04, (2004).",
      "doi": ""
    },
    {
      "text": "Best, V., Ihlefeld, A. and Shinn-Cunningham, B. G. The effect of auditory spatial layout in a divided attention task. In Proc. ICAD 05, (2005), 17--22.",
      "doi": ""
    },
    {
      "text": "Vazquez-Alvarez, Y. and Brewster, S. A. Designing Spatial Audio Interfaces to Support Multiple Audio Streams. In Proc. MobileHCI 2010, ACM Press (2010), 253--256.  ",
      "doi": "10.1145/1851600.1851642"
    }
  ]
}