{
  "doi": "10.1145/1978942.1978956",
  "title": "Time characteristics of olfaction in a single breath",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "83-92",
  "year": 2011,
  "badges": [],
  "abstract": "The transmission of olfactory information together with audiovisual information is now attracting much attention. However, the information is difficult to synchronize because of problems of scent lingering in the air and olfactory adaptation. We aimed at minimizing the amount of odorant presented to users in order to mitigate these problems, and developed an olfactory display that is able to present scents precisely. The display uses pulse ejection, whereby scents are emitted for only short periods of time. In this study, we aimed to mitigate the above-mentioned problems and to measure the time characteristics of olfaction in a single breath, which are difficult to measure by conventional methods. As a result, the most effective conditions for using a small amount of odorant in a single breath were revealed. These results are expected to ease the synchronization of olfactory and audiovisual information.",
  "tags": [
    "olfactory information",
    "olfactory display",
    "pulse ejection"
  ],
  "authors": [
    {
      "name": "Daisuke Noguchi",
      "institution": "Keio University, Kohoku-ku, Yokohama, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472646740",
      "orcid": "missing"
    },
    {
      "name": "Sayumi Sugimoto",
      "institution": "Keio University, Kohoku-ku, Yokohama, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472651825",
      "orcid": "missing"
    },
    {
      "name": "Yuichi Bannai",
      "institution": "Canon Inc., Shimomaruko, Ohta-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223984",
      "orcid": "missing"
    },
    {
      "name": "Ken-ichi Okada",
      "institution": "Keio University, Kohoku-ku, Yokohama, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593712",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Reports of the Association for Information and Communications Technology Using Five Senses (in Japanese). Ministry of Posts and Telecommunications in Japan, 2007.",
      "doi": ""
    },
    {
      "text": "A. Tomono, S. Yamamoto, M. Utsunomiya, D. Ikei, Y. Yanagida, and K. Hosaka. The effect which visual media with scent exert on contents understanding (in japanese). Human Interface Symposium 2004, pages 249--254, 2004.",
      "doi": ""
    },
    {
      "text": "K Okada and S Aiba. For realization of the broadcast with olfactory information. Technology Report of The Institute of Image Information and Television Engineers (in Japanese), 27:31--34, 2003.",
      "doi": ""
    },
    {
      "text": "M. Hirose and T. Tanigawa. Wearable olfactory display. Information Communication of Odor (Fragrance Journal Ltd) (in Japanese), pages 60--76, 2007.",
      "doi": ""
    },
    {
      "text": "J. Sato, K. Ohtsu, Y. Bannai, and K. Okada. Effective presentation technique of scent using small ejection quantities of odor. IEEE VR 2009, pages 151--158, 2009.  ",
      "doi": "10.1109/VR.2009.4811015"
    },
    {
      "text": "T. Kawasaki, M. Nakajima, and T. Tonoike. Aroma Science Series 21 6. Fragrance Journal Ltd. (in Japanese). 2003.",
      "doi": ""
    },
    {
      "text": "A term and a commentary of a odor (in japanese). Odor Control Association of Japan, 2003.",
      "doi": ""
    },
    {
      "text": "J. S. Nader. In Am. Ind. Hyg. Assoc. J. 1958.",
      "doi": ""
    },
    {
      "text": "Environmental Agency Air Quality Bureau special pollution section (in Japanese). 1977 sensuality examination investigation papers, 1978.",
      "doi": ""
    },
    {
      "text": "H. F. Woodrow and B. Karpman. A new olfactometeric technique and some results. J. Exp. Psychol., 3:31--447, 1917.",
      "doi": ""
    },
    {
      "text": "G. Ekman, B. Berglund, U. Berglund, and T. Lindvall. Perceived intensity of odor as a function of time of adaptation. Scand. J. Psychol., 8:177--186, 1967.",
      "doi": ""
    },
    {
      "text": "B. Berglund, U. Berglund, and T. Lindvall. Psychophysical scaling of odorous air pollutants. Proceedings of the Fourth International Clean Air Congress, pages 377--380, May 1977.",
      "doi": ""
    },
    {
      "text": "S. W Cain. Perception of odor intensity and the time course of olfactory adaptation. ASHRAE Transactions, 80:53--75, 1974.",
      "doi": ""
    },
    {
      "text": "P. Dalton and C. J. Wysocki. The nature and duration of adaptation following long-term odor exposure. Psychonomic Society, Inc., 58(5):781--792, 1996.",
      "doi": ""
    },
    {
      "text": "J. Kaye. Making scents: aromatic output for hci. Interactions, 11(1):48--61, 2004.  ",
      "doi": "10.1145/962342.964333"
    },
    {
      "text": "D. A. Washburn, L. M. Jones, R. V. Satya, C. A. Bowers, and A. Cortes. Olfactory use in virtual environment training. Modeling and Simulation Magazine, 2(3), 2004.",
      "doi": ""
    },
    {
      "text": "http://www.osmooze.com/osmooze/osmooshop_gb.html.",
      "doi": ""
    },
    {
      "text": "Y. Yanagida, H. Noma, N. Tetsutani, and A. Tomono. An unencumbering, localized olfactory display. In CHI '03 Extended abstracts, pages 988--989, 2003.  ",
      "doi": "10.1145/765891.766109"
    },
    {
      "text": "S. A. Brewster, D. K McGookin, and C. A. Miller. Olfoto: designing a smell-based interaction. In CHI 2006, pages 653--662, 2006.  ",
      "doi": "10.1145/1124772.1124869"
    },
    {
      "text": "G. Ghinea and O. A. Ademoye. olfaction-enhanced multimedia: bad for information recall? In ICME 2009, pages 970--973, 2009. ",
      "doi": "10.5555/1698924.1699162"
    },
    {
      "text": "A. Bodnar, R. Corbett, and D. Nekrasovski. Aroma: Ambient awareness through olfaction in a messaging application. In ICMI '04 Proceedings, pages 183--190, 2004.  ",
      "doi": "10.1145/1027933.1027965"
    },
    {
      "text": "A. Kadowaki, J. Sato, Y. Bannai, and K. Okada. Measurement and modeling of olfactory responses to pulse ejection of odors. Japan Association on Odor Environment, 39(1):36--43, 2008.",
      "doi": ""
    },
    {
      "text": "A. kadowaki, J. Sato, Y. Bannai, and K. Okada. Presentation technique of scent to avoid olfactory adaptation. 17th International Conference on Artificial Reality and Telexistence, pages 97--104, 2007.  ",
      "doi": "10.1109/ICAT.2007.45"
    },
    {
      "text": "N. Nagasawa, Y. Ono, S. Watanabe, and K. Koyama. Basic Technology of Television, easily understandable TV and Bloadcast technology. (Ohmsha, Ltd) (in Japanese). 1998.",
      "doi": ""
    },
    {
      "text": "Odor Simplified Measurement Guidebook (in Japanese). Japan Association on Odor Environment, 2005.",
      "doi": ""
    }
  ]
}