{
  "doi": "10.1145/1978942.1979239",
  "title": "The haptic laser: multi-sensation tactile feedback for at-a-distance physical space perception and interaction",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2047-2050",
  "year": 2011,
  "badges": [],
  "abstract": "We present the Haptic Laser, a system for providing a range of tactile sensations to represent a physical environment at-a-distance. The Haptic Laser is a handheld device that simulates interaction with physical surfaces as a user targets objects of interest (e.g., a light switch, TV, etc). Using simple computer vision techniques for scene analysis and laser range finding for calculating distance, the Haptic Laser extracts information about the physical environment and conveys it haptically through a collection of hardware actuators. Pointing the Haptic Laser around a room, for example, presents the user with information about the presence of objects, transitions, and edges through touch rather than, or in addition to, vision. The Haptic Laser extends current work on haptic touch screens and pens, and is designed to allow for haptic feedback from a distance using multiple feedback channels.",
  "authors": [
    {
      "name": "Francis Iannacci",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484647014",
      "orcid": "missing"
    },
    {
      "name": "Erik Turnquist",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484659002",
      "orcid": "missing"
    },
    {
      "name": "Daniel Avrahami",
      "institution": "Intel Research, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367734",
      "orcid": "missing"
    },
    {
      "name": "Shwetak N. Patel",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100490064/rel-imgonly/81100490064.jpg",
      "acmid": "81100490064",
      "orcid": "0000-0002-6300-4389"
    }
  ],
  "references": [
    {
      "text": "Bergman, R., Nachlieli, H. and Ruckenstein, G. Detection of Textured Areas in Images Using a Disorganization Indicator Based on Component Counts. HP Laboratories Israel, HPL-2005-175(R.1), 2007.",
      "doi": ""
    },
    {
      "text": "Han, Jin Woo. TactileWand: Wand for Blind - Research Work. http://bit.ly/caNAEP.",
      "doi": ""
    },
    {
      "text": "Hemmert, F., Hamann, S., Lowe, M., Wohlauf, A., and Joost, G. Weight-Shifting Mobiles: One-Dimensional Gravitational Displays in Mobile Phones. In Adj. Proc. UIST'09. (2009).",
      "doi": ""
    },
    {
      "text": "Kinsler, L. E., Frey, A. R., Coppens, A. B., and Sanders, J. V. Fundamentals of Acoustics. 4th Edition. John Wiley and Sons, Inc., 2000.",
      "doi": ""
    },
    {
      "text": "Lee, J. C., Dietz, P. H., Leigh, D., Yerazunis, W. S., and Hudson, S. E.. Haptic Pen: A Tactile Feedback Stylus for Touch Displays. In Proc. UIST'04, (2004).  ",
      "doi": "10.1145/1029632.1029682"
    },
    {
      "text": "MiniGuide, http://bit.ly/cIl0r.",
      "doi": ""
    },
    {
      "text": "Myers, B. A., Bhatnagar, R., Nichols, J., Peck, C. H., Kong, D., Miller, R., and Long, A. C. Interacting at a Distance: Measuring the Performance of Laser Pointers and Other Devices. In Proc. of CHI'02, (2002), 33--40.  ",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Olsen, D. R. and Nielsen, T. Laser pointer interaction. In Proc. of CHI'01, (2001), 17--22.  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Patel, S. N. and Abowd, G. D. A 2-Way Laser-Assisted Selection Scheme for Handhelds in a Physical Environment. In Proc. UbiComp'03, 200--207.",
      "doi": ""
    },
    {
      "text": "Poupyrev, I. and Maruyama, S. Tactile Interface for Small Touch Screens. In Proc. UIST'03, ACM Press (2003), 217--220.  ",
      "doi": "10.1145/964696.964721"
    },
    {
      "text": "Wilson, A., and Pham, H. Pointing in Intelligent Environments with the WorldCursor, In Proc. Interact'03.",
      "doi": ""
    },
    {
      "text": "Stetten, G., Klatzky, R., Nichol, B., Galeotti, J., Rockot, K., Zawrotny, K., Weiser, D., Sendgikoski, N., and Horvath, S. Fingersight: Fingertip Visual Haptic Sensing and Control. HAVE'07, 80--83.",
      "doi": ""
    },
    {
      "text": "Farcy, R. and Bellik, Y. Locomotion Assistance for the Blind. In Keates, S., Langdom, P., and Robinson, P., eds.: Universal Access and Assistive Technology, Springer (2002), 277--284.",
      "doi": ""
    },
    {
      "text": "Haptic Torch, http://bit.ly/bDLOML.",
      "doi": ""
    },
    {
      "text": "Yano, H., Miyamoto, Y., and Iwata, H. Haptic Interface for Perceiving Remote Object Using a Laser Range Finder. In Proc. WHC'09, IEEE (2009), 196--201.  ",
      "doi": "10.1109/WHC.2009.4810889"
    }
  ]
}