{
  "doi": "10.1145/1978942.1978999",
  "title": "RemoteTouch: touch-screen-like interaction in the tv viewing environment",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "393-402",
  "year": 2011,
  "badges": [],
  "abstract": "We explored the possibility of touch-screen-like interaction with a remote control in the TV-viewing environment. A shadow representing the user's thumb touches the screen, presses a button, flicks a cover-flow list, and draws a simple stroke, while the thumb stays and moves on and above the touchpad. In order to implement the concept we developed an optical touchpad for tracking the thumb hovering over its surface, and designed a TV application to demonstrate possible new interaction styles. Throughout two iterations of prototyping, we corrected some of our false expectations, and also verified its potential as a viable option for a TV remote control. This paper presents technical issues and requirements for the hover-tracking touchpad and a complete report of our user studies to explore touch-screen-like interaction for the TV.",
  "tags": [
    "remotetouch interaction",
    "tv remote control",
    "tv user interface",
    "hover-tracking touchpad"
  ],
  "authors": [
    {
      "name": "Sangwon Choi",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538513756",
      "orcid": "missing"
    },
    {
      "name": "Jaehyun Han",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484643599",
      "orcid": "missing"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    },
    {
      "name": "Narae Lee",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484644413",
      "orcid": "missing"
    },
    {
      "name": "Woohun Lee",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100384795",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abileah, A. and Green, P. Optical sensors embedded within AMLCD panel: design and applications. ACM SIGGRAPH 2007 Emerging Technologies.  ",
      "doi": "10.1145/1278280.1278309"
    },
    {
      "text": "Cirque - Innovative Touch Solutions. http://www.cirque.com.",
      "doi": ""
    },
    {
      "text": "Douglas, S. A., Kirkpatrick, A. E., and MacKenzie, I. S. Testing pointing device performance and user assessment with the ISO 9241, Part 9 standard. In Proc. CHI 1999, 215--222.  ",
      "doi": "10.1145/302979.303042"
    },
    {
      "text": "Enns, N. R. and MacKenzie, I. S. Touchpad-based remote control devices. In Proc. CHI 1998, 229--230.  ",
      "doi": "10.1145/286498.286717"
    },
    {
      "text": "Ginny J., et al. The challenges of designing a user interface for consumer interactive television, In Proc. Int. Conf. on Consumer Electronics, (1994), 114--115.",
      "doi": ""
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. UIST 2005, 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hodges, S., Izadi, S., Butler, A., Rrustemi, A., and Buxton, B. ThinSight: versatile multi-touch sensing for thin form-factor displays. In Proc. UIST 2007, 259--268.  ",
      "doi": "10.1145/1294211.1294258"
    },
    {
      "text": "Holz, C. and Baudisch, P. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proc. CHI 2010, 581--590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Ishiyama, K., and Yano, S. A study of characteristics of pointing devices for television operation, In Proc. IEEE SMC 2000, 1307--1312.",
      "doi": ""
    },
    {
      "text": "Lekakos, G., Chorianopoulos, K., Spinellis, D. Information systems in the living room: a case study of personalized interactive TV design. In Proc. the 9th Euro. Conf. on Information Systems 2001, 319--329.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. and Jusoh, S. An evaluation of two input devices for remote pointing. In Proc. IFIP Int. Conf. on Eng. for HCI 2001, 235--250. ",
      "doi": "10.5555/645350.650716"
    },
    {
      "text": "MacKenzie, I. S., Kober, H., Smith, D., Jones, T., and Skepner, E. LetterWise: Prefix-based disambiguation for mobile text input. In Proc. UIST 2001, 111--120.  ",
      "doi": "10.1145/502348.502365"
    },
    {
      "text": "MacKenzie, I. S., Sellen, A., and Buxton, W. A. A comparison of input devices in element pointing and dragging tasks. In Proc. CHI 1991, 161--166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W. Phrase sets for evaluating text entry techniques. CHI 2003 Extended Abstracts, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Malik, S., Ranjan, A., and Balakrishnan, R. Interacting with large displays from a distance with vision-tracked multi-finger gestural input. In Proc. UIST 2005, 43--52.  ",
      "doi": "10.1145/1095034.1095042"
    },
    {
      "text": "Matsushita, N. and Rekimoto, J. HoloWall: designing a finger, hand, body, and object sensitive wall. In Proc. UIST 1997, 209--210.  ",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "Myers, B. A., Bhatnagar, R., Nichols, J., Peck, C. H., Kong, D., Miller, R., and Long, A. C. Interacting at a distance: measuring the performance of laser pointers and other devices. In Proc. CHI 2002, 33--40.  ",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Olsen, D. R. and Nielsen, T. Laser pointer interaction. In Proc. CHI 2001, 17--22.  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Panasonic's EZ Touch Remote prototype, Exhibited at CEATEC Japan 2008, Makuhari Messe, Japan.",
      "doi": ""
    },
    {
      "text": "TactaPad - See, Touch, Feel. http://www.tactiva.com/tactapad.html.",
      "doi": ""
    }
  ]
}