{
  "doi": "10.1145/1978942.1979102",
  "title": "\"Voluntweeters\": self-organizing by digital volunteers in times of crisis",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1071-1080",
  "year": 2011,
  "badges": [],
  "abstract": "This empirical study of \"digital volunteers\" in the aftermath of the January 12, 2010 Haiti earthquake describes their behaviors and mechanisms of self-organizing in the information space of a microblogging environment, where collaborators were newly found and distributed across continents. The paper explores the motivations, resources, activities and products of digital volunteers. It describes how seemingly small features of the technical environment offered structure for self-organizing, while considering how the social-technical milieu enabled individual capacities and collective action. Using social theory about self-organizing, the research offers insight about features of coordination within a setting of massive interaction.",
  "authors": [
    {
      "name": "Kate Starbird",
      "institution": "University of Colorado, Boulder, Boulder, Colorado, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456637076",
      "orcid": "missing"
    },
    {
      "name": "Leysia Palen",
      "institution": "University of Colorado, Boulder, Boulder, Colorado, USA",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cavallo, E, Powell, A, & Becerra, O. Estimating the Direct Economic Damage of the Earthquake in Haiti. February 2010. IDB Inter-American Development Bank.",
      "doi": ""
    },
    {
      "text": "Dynes, R. R. Organized Behavior in Disaster. Heath, 1970.",
      "doi": ""
    },
    {
      "text": "Fischer III, H. W. Response to Disaster: Fact Versus Fiction & Perpetuation, 2nd ed. Univ Press of America, NY, 1998.",
      "doi": ""
    },
    {
      "text": "Fritz, C. E. & Mathewson, J. H. Convergence Behavior in Disasters: A Problem in Social Control, Committee on Disaster Studies, National Academy of Sciences, National Research Council, Washington DC, 1957.",
      "doi": ""
    },
    {
      "text": "Guy, M., Earle, P., Ostrum, C., Gruchalla, K. & Horvath, S. Integration and Dissemination of Citizen Reported and Seismically Derived Earthquake Information via Social Network Technologies. Advances in Intelligent Data Analysis IX, Lecture Notes in Computer Science. 6065(2010), 42--53.  ",
      "doi": "10.1007/978-3-642-13062-5_6"
    },
    {
      "text": "Honeycutt, C. & S. C. Herring. Beyond Microblogging: Conversation & Collaboration via Twitter. HICSS 2009, 1--10.  ",
      "doi": "10.1109/HICSS.2009.89"
    },
    {
      "text": "Hughes, A., L. Palen, J. Sutton, S. Liu, & S. Vieweg. \"Site-Seeing\" in Disaster: An Examination of On-Line Social Convergence. Proc. of Information Systems for Crisis Response and Management Conference (ISCRAM) 2008.",
      "doi": ""
    },
    {
      "text": "Kendra, J. M. & Wachtendorf, T. Reconsidering Convergence and Converger: Legitimacy in Response to the World Trade Center Disaster, Terrorism and Disaster: New Threats, New Ideas: Research in Social Problems and Public Policy, 11, (2003), 97--122.",
      "doi": ""
    },
    {
      "text": "Kreps, G. A. & Bosworth, S. L. Organizing, Role Enactment, and Disaster: A Structural Theory. Cranbury, NJ: Associated University Presses, 1994.",
      "doi": ""
    },
    {
      "text": "Liu, S. Iacucci, A. A., & Meier, P. Ushahidi Haiti & Chile: Next Generation Crisis Mapping. American Congress on Surveying and Mapping (ACSM) Bulletin, August 2010.",
      "doi": ""
    },
    {
      "text": "Mendoza, M., B. Poblete & C. Castillo. Twitter Under Crisis: Can we trust what we RT? 1st Workshop on Social Media Analytics. SOMA '10 (Washington, DC, July 25, 2010).  ",
      "doi": "10.1145/1964858.1964869"
    },
    {
      "text": "Messina, C. Twitter Hashtags for Emergency Coordination and Disaster Relief. Oct 22, 2007. Blog in: FactoryCity. http://factoryjoe.com/blog/2007/10/22/twitter-hashtags-for-emergency-coordination-and-disaster-relief.",
      "doi": ""
    },
    {
      "text": "Messina, C. Stowe Boyd Launches Microsyntax.org. May 16, 2009. Blog in: FactoryCity. URL: http://factoryjoe.com/blog/2009/05/26/stowe-boyd-launches-microsyntax-org.",
      "doi": ""
    },
    {
      "text": "New York Times. Haiti Earthquake of 2010. Sept 23, 2010. The New York Times. http://www.nytimes.com/info/haiti-earthquake-2010.",
      "doi": ""
    },
    {
      "text": "Okolloh O. Ushahidi, or 'testimony': Web 2.0 tools for crowdsourcing crisis information. Participatory Learning and Action 59 (2009): 65--70.",
      "doi": ""
    },
    {
      "text": "Palen, L. & Liu, S. B. Citizen Communications in Crisis: Anticipating a Future of ICT-Supported Participation, Proc. of CHI 2007, 727--736.  ",
      "doi": "10.1145/1240624.1240736"
    },
    {
      "text": "Qu, Y., Wu, P. & Wang, X. Online Community Response to Major Disaster: A Case Study of Tianya Forum in the 2008 China Earthquake. In Proc 42nd Hawaii Int'l Conf. on System Sciences, 2009, 1--11.  ",
      "doi": "10.1109/HICSS.2009.330"
    },
    {
      "text": "Starbird, K. & Stamberger, J. Tweak the Tweet: Leveraging Microblogging Proliferation with a Prescriptive Syntax to Support Citizen Reporting. Proc. of Information Systems for Crisis Response and Management (ISCRAM) 2010.",
      "doi": ""
    },
    {
      "text": "Starbird, K., Palen, L., Hughes, A. & Vieweg, S. Chatter on The Red: What Hazards Threat Reveals about the Social Life of Microblogged Information. Proc. of CSCW 2010, 241--250.  ",
      "doi": "10.1145/1718918.1718965"
    },
    {
      "text": "Tierney, K., Lindell, M., & Perry, R. W. Facing the Unexpected: Disaster Preparedness and Response in the United States. John Henry Press, Washington, DC, 2001.",
      "doi": ""
    },
    {
      "text": "Vieweg, S., Hughes, A., Starbird, K., & Palen, L. Micro-Blogging during Two Natural Hazards Events: What Twitter May Contribute to Situational Awareness Proc of CHI 2010, 1079--88.  ",
      "doi": "10.1145/1753326.1753486"
    }
  ]
}