{
  "doi": "10.1145/1978942.1978953",
  "title": "Zoom cameras and movable displays enhance social telepresence",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "63-72",
  "year": 2011,
  "badges": [],
  "abstract": "This paper shows that the augmentation of a remote person's positional movement enhances social telepresence. There are three possible ways of representing a remote person's movement toward the user in visual communication: a) the remote person's movement toward the remote camera, b) the remote camera's zooming in to enlarge the remote person's picture, and c) a forward movement of the display that is displaying the remote person. We conducted an experiment to see the relationship among these three ways and the effects of a remote camera's zooming and a display's movement on social telepresence. In the experiment, we observed that the remote person's movement lowered the reality of conversations, and the remote camera's zooming lowered the visual quality. However, social telepresence was enhanced when both the person's movement and the camera's zooming occurred simultaneously. We also observed that a 6-centimeter movement of the display enhanced social telepresence, whether the remote person moved or not.",
  "tags": [
    "telerobotics",
    "telepresence",
    "videoconferencing"
  ],
  "authors": [
    {
      "name": "Hideyuki Nakanishi",
      "institution": "Osaka University, Suita, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100225472",
      "orcid": "missing"
    },
    {
      "name": "Kei Kato",
      "institution": "Osaka University, Suita, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416595987",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishiguro",
      "institution": "Osaka University, Toyonaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100572813",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bondareva, Y. and Bouwhuis, D. Determinants of Social Presence in Videoconferencing. Proc. AVI 2004 Workshop on Environments for Personalized Information Access, (2004), 1--9.",
      "doi": ""
    },
    {
      "text": "Buxton, W.A.S. Telepresence: Integrating Shared Task and Person Spaces. Proc. Graphics Interface 92, (1992), 123--129. ",
      "doi": "10.5555/155294.155309"
    },
    {
      "text": "de Greef, P. and Ijsselsteijn, W. Social Presence in a Home Tele-Application. CyberPsychology &amp;#38; Behavior, 4(2), (2001), 307--315.",
      "doi": ""
    },
    {
      "text": "Finn, K.E., Sellen, A.J. and Wilbur, S.B. Video-Mediated Communication. Lawrence Erlbaum Associates, (1997). ",
      "doi": "10.5555/548502"
    },
    {
      "text": "Gaver, W.W., Smets, G. and Overbeeke, K. A Virtual Window on Media Space. Proc. CHI 95, (1995), 257--264.  ",
      "doi": "10.1145/223904.223937"
    },
    {
      "text": "Heath, C. and Luff, P. Media Space and Communicative Asymmetries: Preliminary Observations of Video-Mediated Interaction. Human-Computer Interaction, 7(3), (1992), 315--346.  ",
      "doi": "10.1207/s15327051hci0703_3"
    },
    {
      "text": "Isaacs, E.A. and Tang, J.C. What Video Can and Can't Do for Collaboration: a Case Study. Multimedia Systems, 2(2), (1994), 63--73.  ",
      "doi": "10.1007/BF01274181"
    },
    {
      "text": "Ishiguro, H. and Trivedi, M. Integrating a Perceptual Information Infrastructure with Robotic Avatars: A Framework for Tele-Existence. Proc. IROS 99, (1999), 1032--1038.",
      "doi": ""
    },
    {
      "text": "Jouppi, N.P. First Steps Towards Mutually-Immersive Mobile Telepresence. Proc. CSCW 2002, (2002), 354--363.  ",
      "doi": "10.1145/587078.587128"
    },
    {
      "text": "Karahalios, K. and Donath, J. Telemurals: Linking Remote Spaces with Social Catalysts. Proc. CHI 2004, (2004), 615--622.  ",
      "doi": "10.1145/985692.985770"
    },
    {
      "text": "1Kuzuoka, H., Yamazaki, K., Yamazaki, A., Kosaka, J., Suga, Y. and Heath, C. Dual Ecologies of Robot as Communication Media: Thoughts on Coordinating Orientations and Projectability. Proc. CHI 2004, (2004), 183--190.  ",
      "doi": "10.1145/985692.985716"
    },
    {
      "text": "Leigh, J., Rawlings, M., Girado, J., Dawe, G., Fang, R., Verlo, A., Khan, M.A., Cruz, A., Plepys, D., Sandin, D.J. and DeFanti, T.A. AccessBot: an Enabling Technology for Telepresence. Proc. INET 2000, (2000).",
      "doi": ""
    },
    {
      "text": "Miura, T. Behavior Oriented Vision: Functional Field of View and Processing Resources. J.K. O'Regan and A. Levy-Schoen Ed., Eye Movements: From Physiology to Cognition, Elsevier, (1987), 563--572.",
      "doi": ""
    },
    {
      "text": "Morita, T., Mase, K., Hirano, Y. and Kajita, S. Reciprocal Attentive Communication in Remote Meeting with a Humanoid Robot. Proc. ICMI 2007, (2007), 228--235.  ",
      "doi": "10.1145/1322192.1322232"
    },
    {
      "text": "Mueller, F., Agamanolis, S. and Picard, R. Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. Proc. CHI 2003, (2003), 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Nakanishi, H., Murakami, Y., Nogami, D. and Ishiguro, H. Minimum Movement Matters: Impact of Robot-Mounted Cameras on Social Telepresence. Proc. CSCW 2008, (2008), 303--312.  ",
      "doi": "10.1145/1460563.1460614"
    },
    {
      "text": "Nakanishi, H., Murakami, Y. and Kato, K. Movable Cameras Enhance Social Telepresence in Media Spaces. Proc. CHI 2009, (2009), 433--442.  ",
      "doi": "10.1145/1518701.1518771"
    },
    {
      "text": "Nguyen, D.T. and Canny, J. More than Face-to-Face: Empathy Effects of Video Framing. Proc. CHI 2009, (2009), 423--432.  ",
      "doi": "10.1145/1518701.1518770"
    },
    {
      "text": "Paulos, E. and Canny, J. Social Tele-Embodiment: Understanding Presence. Autonomous Robots, 11(1), (2001), 87--95.  ",
      "doi": "10.1023/A%3A1011264330469"
    },
    {
      "text": "Prussog, A., Muhlbach, L. and Bocker, M. Telepresence in Videocommunications. Proc. Annual Meeting of Human Factors and Ergonomics Society, (1994), 25--38.",
      "doi": ""
    },
    {
      "text": "2Roussel, N. Experiences in the Design of the Well, a Group Communication Device for Teleconviviality. Proc. Multimedia 2002, (2002), 146--152.  ",
      "doi": "10.1145/641007.641036"
    },
    {
      "text": "2Roussel, N., Evans, H. and Hansen, H. Proximity as an Interface for Video Communication. IEEE Multimedia, 11(3), (2004), 12--16.  ",
      "doi": "10.1109/MMUL.2004.15"
    },
    {
      "text": "Roussou, M., Trahanias, P., Giannoulis, G., Kamarinos, G., Argyros, A., Tsakiris, D., Georgiadis, P., Burgard, W., Haehnel, D., Cremers, A., Schulz, D., Moors, M., Spirtounias, E., Marianthi, M., Savvaides, V., Reitelman, A., Konstantios, D. and Katselaki, A. Experiences from the Use of a Robotic Avatar in a Museum Setting. Proc. VAST 2001, (2001), 153--160.  ",
      "doi": "10.1145/584993.585017"
    },
    {
      "text": "Vespa, P.M., Miller, C., Hu, X., Nenov, V., Buxey, F. and Martin, N.A. Intensive Care Unit Robotic Telepresence Facilitates Rapid Physician Response to Unstable Patients and Decreased Cost in Neurointensive Care. Surgical Neurology, 67(4), (2006), 331--337.",
      "doi": ""
    },
    {
      "text": "Yamashita, N., Hirata, K., Aoyagi, S., Kuzuoka, H. and Harada, Y. Impact of Seating Positions on Group Video Communication. Proc. CSCW 2008, (2008), 177--186..  ",
      "doi": "10.1145/1460563.1460591"
    }
  ]
}