{
  "doi": "10.1145/1978942.1978985",
  "title": "Real-time nonverbal opinion sharing through mobile phones during sports events",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "307-310",
  "year": 2011,
  "badges": [],
  "abstract": "Even with the rise of the World Wide Web, TV has remained the most pervasive entertainment medium and is nowadays often used together with other media, which allow for active participation. The idea of connecting non-collocated TV viewers via telecommunication technologies, referred to as Social TV, has recently received considerable attention. Such systems typically include set-top boxes for supporting collaboration. In this research we investigate if real-time opinion sharing about TV shows through a nonverbal (non-textual) iconic UI on mobile phones is reasonable. For this purpose we developed a mobile app, made it available to a large number of users through the Android Market, and conducted an uncontrolled user study in the wild during the soccer world cup 2010. The results of the study indicate that TV viewers who used the app had more fun and felt more connected to other viewers. We also show that by monitoring this channel it is possible to collect sentiments relevant to the broadcasted content in real-time. The collected data exemplify that the aggregated sentiments correspond to important moments, and hence can be used to generate a summary of the event.",
  "tags": [
    "social tv",
    "sports",
    "mobile phone",
    "sentiment support"
  ],
  "authors": [
    {
      "name": "Alireza Sahami Shirazi",
      "institution": "University Duisburg-Essen & University of Stuttgart, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442606311",
      "orcid": "missing"
    },
    {
      "name": "Michael Rohs",
      "institution": "Ludwig-Maximilians-Universität & Technische Universität Berlin, Stuttgart-Munich, Germany",
      "img": "/do/10.1145/contrib-81314494694/rel-imgonly/mr-120.jpg",
      "acmid": "81314494694",
      "orcid": "missing"
    },
    {
      "name": "Robert Schleicher",
      "institution": "Technische Universität Berlin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81375613389",
      "orcid": "missing"
    },
    {
      "name": "Sven Kratz",
      "institution": "Ludwig-Maximilians-Universität & Technische Universität Berlin, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602445",
      "orcid": "0000-0002-0068-0793"
    },
    {
      "name": "Alexander Müller",
      "institution": "University of Duisburg Essen, Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484646356",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Duisburg Essen & University of Stuttgart, Essen & Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Baillie, L., Frohlich, P., & Schatz, R. Exploring Social TV. Proc. ITI'07, 215--220.",
      "doi": ""
    },
    {
      "text": "Coppens, T., Trappeniers, L., & Godon, M. AmigoTV: towards a social TV experience. Proc. EuroITV'04.",
      "doi": ""
    },
    {
      "text": "Crispell, D. TV soloists-Statistics on number of television sets owned in households from SRI Consulting Media Futures Program, American Demographics.",
      "doi": ""
    },
    {
      "text": "Diakopoulos, N.A. & Shamma, D.A. Characterizing de-bate performance via aggregated twitter sentiment. Proc. CHI'10, 119.  ",
      "doi": "10.1145/1753326.1753504"
    },
    {
      "text": "Geerts, D. & De Grooff, D. Supporting the social uses of television: sociability heuristics for social TV. Proc. CHI'09, 595--604.  ",
      "doi": "10.1145/1518701.1518793"
    },
    {
      "text": "Geerts, D. Comparing voice chat and text chat in a com-munication tool for interactive television. Proc. Nordi-CHI'06, 464.  ",
      "doi": "10.1145/1182475.1182537"
    },
    {
      "text": "Harboe, G., Massey, N. et al. The uses of social televi-sion. Computers in Entertainment 6, 1 2008, 1--15.  ",
      "doi": "10.1145/1350843.1350851"
    },
    {
      "text": "Harboe, G., Metcalf, C.J. et al. Ambient social tv: draw-ing people into a shared experience. Proc. CHI'08,1--10.  ",
      "doi": "10.1145/1357054.1357056"
    },
    {
      "text": "Huang, E.M., Harboe, G., Tullio, J., et al. Of social tele-vision comes home: a field study of communication choices and practices in tv-based text and voice chat. Proc. CHI'09, 585--594.  ",
      "doi": "10.1145/1518701.1518792"
    },
    {
      "text": "Luyten, K., Thys, K., Huypens, S., & Coninx, K. Tele-buddies: social stitching with interactive television. Proc. CHI'06 extended abstracts, 1054.  ",
      "doi": "10.1145/1125451.1125651"
    },
    {
      "text": "1Miyamori, H., Nakamura, S., et al. Generation of views of TV content using TV viewers' perspectives expressed in live chats on the web. Proc. MM'05, 853--861.  ",
      "doi": "10.1145/1101149.1101336"
    },
    {
      "text": "Oehlberg, L., Ducheneaut, N. Thornton, J. D., Moore, R. J., Nickell, E. Social TV: Designing for distributed, so-ciable television viewing. Proc. EuroITV'06, 25--26.",
      "doi": ""
    },
    {
      "text": "Preece, J. & Shneiderman, B. The Reader-to-Leader Framework: Motivating technology-mediated social par-ticipation. AIS THCI, 1 2009, 13--32.",
      "doi": ""
    },
    {
      "text": "Weisz, J.D., Kiesler, S., et al. Watching together: inte-grating text chat with video. Proc. CHI'07, 877--886..  ",
      "doi": "10.1145/1240624.1240756"
    }
  ]
}