{
  "doi": "10.1145/1978942.1979017",
  "title": "Buzzing to play: lessons learned from an in the wild study of real-time vibrotactile feedback",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "533-542",
  "year": 2011,
  "badges": [],
  "abstract": "Vibrotactile feedback offers much potential for facilitating and accelerating how people learn sensory-motor skills that typically take hundreds of hours to learn, such as learning to play a musical instrument, skiing or swimming. However, there is little evidence of this benefit materializing outside of research lab settings. We describe the findings of an in-the-wild study that explored how to integrate vibrotactile feedback into a real-world teaching setting. The focus of the study was on exploring how children of different ages, learning to play the violin, can use real-time vibrotactile feedback. Many of the findings were unexpected, showing how students and their teachers appropriated the technology in creative ways. We present some 'lessons learned' that are also applicable to other training settings, emphasizing the need to understand how vibrotactile feedback can switch between being foregrounded and backgrounded depending on the demands of the task, the teacher's role in making it work and when feedback is most relevant and useful. Finally, we discuss how vibrotactile feedback can provide a new language for talking about the skill being learned that may also play an instrumental role in enhancing learning.",
  "tags": [
    "in the wild study",
    "vibrotactile feedback",
    "motion capture",
    "violin teaching",
    "sensory-motor learning",
    "children"
  ],
  "authors": [
    {
      "name": "Janet van der Linden",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650091",
      "orcid": "missing"
    },
    {
      "name": "Rose Johnson",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460647986",
      "orcid": "missing"
    },
    {
      "name": "Jon Bird",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100566270",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Erwin Schoonderwaldt",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314494932",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Animazoo IGS-190-M http://www.animazoo.co.",
      "doi": ""
    },
    {
      "text": "Alamri, A., Eid, M., Iglesias, R., Shirmohammadi, S. and El Saddik, A. Haptic virtual rehabilation exercises for poststroke diagnosis. IEEE Trans. Instrumentation and Measurement, 59, (2008), 1876--1884.",
      "doi": ""
    },
    {
      "text": "Bhargava, A., Scott, M., Traylor, R., Chung, R., Mrozek, K., Wolter, J. and Tan, H. Effect of cognitive load on tactor location identification in zero-g. Proc 2005 World Haptics Conference (WHC05): First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (2005) 56--62.  ",
      "doi": "10.1109/WHC.2005.46"
    },
    {
      "text": "Bloomfield, A. and Badler, N. Virtual training via vibrotactile arrays. Presence, 2008, vol. 17, 103--120.  ",
      "doi": "10.1162/pres.17.2.103"
    },
    {
      "text": "Grindlay, G. C. The impact of haptic guidance on musical motor learning, Masters Thesis, Massachusetts Institute of Technology, 2006.",
      "doi": ""
    },
    {
      "text": "Grosshauser, T. and Hermann, T. Augmented Haptics - An Interactive Feedback System for Musicians. Proc. Haptic and Audio Interaction Design, (2009), 100--108.  ",
      "doi": "10.1007/978-3-642-04076-4_11"
    },
    {
      "text": "Hale, K. S. and Stanney, K. M. Deriving haptic design guidelines from human physiological, psychophysical, and neurological foundations. Computer Graphics and Applications. 24(2), (2004) 33--39.  ",
      "doi": "10.1109/MCG.2004.1274059"
    },
    {
      "text": "Hoggan, E. and Brewster, S. A. CrossTrainer: Testing the Use of Multimodal Interfaces in Situ. Proc. CHI 2010, ACM (2010), 333--342.  ",
      "doi": "10.1145/1753326.1753378"
    },
    {
      "text": "Holland, S., Bouwer, A. J., Dalgelish, M., and Hurtig, T. M. Feeling the beat where it counts: fostering multi-limb rhythm skills with the haptic drum kit. Proc. TEI 2010, ACM (2010), 21--28.  ",
      "doi": "10.1145/1709886.1709892"
    },
    {
      "text": "Huang, K., Starner, T., Do, E., Weiberg, G., Kohlsdorf, D., Ahlrichs, C. and Leibrandt, R. Mobile music touch: mobile tactile stimulation for passive learning, Proc. CHI 2010, ACM (2010), 791--800.  ",
      "doi": "10.1145/1753326.1753443"
    },
    {
      "text": "Jambon, F. and Meillon, B. User experience evaluation in the wild. In Proc. CHI 2009, ACM (2009), 4069--4074.  ",
      "doi": "10.1145/1520340.1520619"
    },
    {
      "text": "Karapanos, E., Zimmerman, J. Forlizzi, J. and Martens, J. B. User Experience Over Time: An Initial Framework. Proc. CHI 2009, ACM (2009), 719--738.  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Konczak, J., vander Velden, H. and Jaeger, L. Learning to play the violin: Motor control by freezing, not freeing degrees of freedom. Journal of Motor Behavior, vol. 41, no. 3, (2009) 243--252.",
      "doi": ""
    },
    {
      "text": "Lieberman, J. and Breazeal, C. TIKL: Development of a wearable vibrotactile feedback suit for improved human motor learning, In IEEE Transactions on Robotics, (2007), 919--926.  ",
      "doi": "10.1109/TRO.2007.907481"
    },
    {
      "text": "Ng, K. C., Weyde, T., Larkin, O., Neubarth, K., Koerselman, T. and Ong, B. 3D augmented mirror: a multimodal interface for string instrument learning and teaching with gesture support, Proc. ICMI 2007, ACM, (2007), 339--345.  ",
      "doi": "10.1145/1322192.1322252"
    },
    {
      "text": "Pielot, M. and Boll, S. Tactile Wayfinder: Comparison of Tactile Waypoint Navigation with Commercial pedestrian navigation Systems. Proc Pervasive Computing, LNCS (2010), 76--93.  ",
      "doi": "10.1007/978-3-642-12654-3_5"
    },
    {
      "text": "Precision microdrive motor. http://www.precisionmicrodrives.co.",
      "doi": ""
    },
    {
      "text": "Rogers, Y., Connelly, K., Tedesco, L., Hazlewood, W., Kurtz, A., Hall, B., Hursey, J. and Toscos, T. Why it's worth the hassle: The value of in-situ studies when designing UbiComp. UbiComp 2007 Proceedings, LNCS 4717, Springer-Verlag, (2007) 336--353. ",
      "doi": "10.5555/1771592.1771612"
    },
    {
      "text": "Schoonderwaldt, E. Mechanics and acoustics of violin bowing: Freedom, constraints and control in performance. Ph.D. dissertation, KTH - School Comput. Sci. Commun., Stockholm, Sweden, 2009.",
      "doi": ""
    },
    {
      "text": "Spelmezan, D., Jacobs, M., Hilgers, A. and Borchers, J. Tactile motion instructions for physical activities. In Proc. CHI 2009, ACM (2009), 2243--2252.  ",
      "doi": "10.1145/1518701.1519044"
    },
    {
      "text": "van der Linden, J. Schoonderwalt, E., Bird, J. and Johnson, R. MusicJacket: Combining Motion Capture and Vibrotactile Feedback to Teach Violin Bowing. In IEEE Transactions on Instrumentation and Measurement, 60 (1), 2011 (in press).",
      "doi": ""
    },
    {
      "text": "van der Linden, J., Schoonderwaldt, E. and Bird, J. Towards a real-time system for teaching novices good violin bowing technique. Proc. IEEE HAVE, (2009), 81--86.",
      "doi": ""
    }
  ]
}