{
  "doi": "10.1145/1978942.1979252",
  "title": "Designing eco-feedback systems for everyday life",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2135-2144",
  "year": 2011,
  "badges": [],
  "abstract": "Eco-feedback systems currently frame householders as micro-resource managers, who weigh up the costs and benefits of their consumption, and make autonomous, rational and efficient decisions. Reporting on findings from a qualitative study of three Australian energy and water eco-feedback programs utilising an in-home display (IHD) system, this paper challenges this view. The research finds that householders consume energy and water to carry out everyday practices, such as showering, laundering and cooling, which are mediated by social, cultural, technical and institutional dynamics. The paper proposes an alternative design paradigm for eco-feedback systems premised on the realities of everyday life and identifies several design directions that emerge from this new starting point.",
  "authors": [
    {
      "name": "Yolande A.A. Strengers",
      "institution": "RMIT University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414621385",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. D., Mynatt, E. D. and Rodden, T. (2002). The human experience {of ubiquitous computing}. Pervasive Computing, IEEE, 1(1), 48--57.  ",
      "doi": "10.1109/MPRV.2002.993144"
    },
    {
      "text": "ABS. (2008). Environmental Issues: Energy Use and Conservation (4602.0.55.001). Australian Bureau of Statistics, Canberra, Australia. {http://www.abs.gov.au}.",
      "doi": ""
    },
    {
      "text": "ACF. (2006). The GreenHome guide: Victorian edition. Australian Conservation Foundation (ACF), Melbourne, VIC.",
      "doi": ""
    },
    {
      "text": "Akrich, M. (1992). The de-scription of technical objects. In W. E. Bijker and J. Law. Shaping Technology/ Building Society. MIT Press, Cambridge, Mass. {US}.",
      "doi": ""
    },
    {
      "text": "ATA. (2007). The Solar Experience: PV System Owners' Survey. Alternative Technology Association, Melbourne, VIC.",
      "doi": ""
    },
    {
      "text": "Backlund, S., Gyllensw&amp;#228;rd, M., Gustafsson, A., Hjelm, S. I., Maz&amp;#233;, R. and Redstr&amp;#246;m, J. (2006). STATIC! The aesthetics of energy in everyday things. Proc. DRS Wonderground.",
      "doi": ""
    },
    {
      "text": "Bell, G., Blythe, M., Gaver, B., Sengers, P. and Wright, P. (2003). Designing culturally situated technologies for the home. Proc. CHI 2003, ACM, 1062--1063.  ",
      "doi": "10.1145/765891.766149"
    },
    {
      "text": "Challis, C. (2004). A Literature Review of Secondary and Smart Metering Knowledge in Managed Housing. The Energy Savings Trust, UK.",
      "doi": ""
    },
    {
      "text": "Chappells, H. and Shove, E. (2004). Infrastructures, crises and the orchestration of demand. In D. Southerton, B. Van Vliet and H. Chappells. Sustainable Consumption: the Implications of Changing Infrastructures of Provision. Edward Elgar, Cheltenham, UK, 130--143.",
      "doi": ""
    },
    {
      "text": "Chetty, M., Bernheim-Brush, A. J., Meyers, B. R. and Johns, P. (2009). It's not easy being green: understanding home computer power management. Proc. CHI 2009, ACM, 1033--1042.  ",
      "doi": "10.1145/1518701.1518860"
    },
    {
      "text": "1Chetty, M., Tran, D. and Grinter, R. E. (2008). Getting to green: understanding resource consumption in the home. Proc. UbiComp'08.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Darby, S. (2006). The effectiveness of feedback on energy consumption: A review for DEFRA of the literature on metering, billing and direct displays. Environmental Change Institute, University of Oxford, Oxford {UK}.",
      "doi": ""
    },
    {
      "text": "Darby, S. (2010). Smart metering: what potential for householder engagement? Building Research &amp;#38; Information, 38(5), 442 - 457.",
      "doi": ""
    },
    {
      "text": "Davidson, G. (2008). Down the gurgler: historical influences on Australian domestic water consumption. In P. Troy. Troubled Waters: Confronting the Water Crisis in Australia's Cities. ANU E Press, Canberra, Australia, 37--65.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T., Mankoff, J., Paulos, E. and Fussell, S. (2009). It's not all about \"Green\": energy use in low-income communities. Proc. Proceedings of the 11th international conference on Ubiquitous computing, ACM, 255--264.  ",
      "doi": "10.1145/1620545.1620583"
    },
    {
      "text": "DiSalvo, C., Sengers, P. and Hr&amp;#246;nn, B. (2010). Mapping the landscape of sustainable HCI. Proc. CHI 2010, ACM, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "EcoVision. (2007). EcoVision Solutions Pty Ltd. EcoVision Solutions Pty Ltd, Elanora, QLD. {http://www.ecovisionsolutions.com.au/}.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Findlater, L. and Landay, J. (2010). The design of eco-feedback technology. Proc. CHI 2010, ACM, 1999--20008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Gram-Hanssen, K. (2007). Teenage consumption of cleanliness: how to make it sustainable? Sustainability: Science, Practice &amp;#38; Policy, 3(2), 1--9.",
      "doi": ""
    },
    {
      "text": "Gram-Hanssen, K. (2008). Consuming technologies developing routines. Journal of Cleaner Production, 16(1181--1189.",
      "doi": ""
    },
    {
      "text": "2Gram-Hanssen, K. (2009). Standby consumption in households analyzed with a practice theory approach. Research and Analysis, 14(1), 150--165.",
      "doi": ""
    },
    {
      "text": "2Gustafsson, A. and Gyllensw&amp;#228;rd, M. (2005). The Power-Aware Cord: energy awareness through ambient information display. Proc. CHI 2005, ACM, 1423--1426.  ",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Hand, M., Southerton, D. and Shove, E. (2003). Explaining daily showering: a discussion of policy and practice. Economic &amp;#38; Social Research Council, UK. {http://www.sustainabletechnologies.ac.uk/}.",
      "doi": ""
    },
    {
      "text": "Hargreaves, T., Nye, M. and Burgess, J. (2010). Making energy visible: a qualitative field study of how householders interact with feedback from smart energy monitors. Energy Policy, 38(6111--6119.",
      "doi": ""
    },
    {
      "text": "Harper, P. (2006). Australia's Environment Issues and Trends 2006. Australian Bureau of Statistics, Canberra, Australia.",
      "doi": ""
    },
    {
      "text": "Hirsch, T. and Anderson, K. (2010). Cross currents: water scarcity and sustainable CHI. Proc. CHI 2010, ACM, 2843--2852.  ",
      "doi": "10.1145/1753846.1753871"
    },
    {
      "text": "Intille, S. S. (2002). Designing a home of the future. Pervasive Computing, 1(2), 76--82.  ",
      "doi": "10.1109/MPRV.2002.1012340"
    },
    {
      "text": "Jackson, T. (2005). Motivating Sustainable Consumption: a Review of Evidence on Consumer Behaviour and Behavioural Change. Centre for Environmental Strategy, University of Surrey, a report to the Sustainable Development Research Network, Surrey, UK.",
      "doi": ""
    },
    {
      "text": "Kaufmann, C. (1998). Dirty Linen: Couples and their Laundry. Middlesex University Press, London, UK.",
      "doi": ""
    },
    {
      "text": "OECD. (2002). Towards Sustainable Household Consumption? Trends and Policies in OECD Countries. Organisation of Economic Co-operation and Development (OECD), France.",
      "doi": ""
    },
    {
      "text": "3Pierce, J., Fan, C., Lomas, D., Marcu, G. and Paulos, E. (2010). Some considerations of the (in)effectiveness of residential energy feedback systems. Proc. DIS 2010, ACM, 244--247.  ",
      "doi": "10.1145/1858171.1858215"
    },
    {
      "text": "3Pierce, J., Schiano, D. J. and Paulos, E. (2010). Home, habits, and energy: examining domestic interactions and energy consumption. Proc. CHI 2010, ACM, 1985--1994.  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "3Reckwitz, A. (2002). Toward a theory of social practices: a development in culturalist theorizing. Journal of Social Theory, 5(2), 243--263.",
      "doi": ""
    },
    {
      "text": "Schatzki, T. R. (2002). The Site of the Social: a Philosophical Account of the Constitution of Social Life and Change. The Pennsylvania State University Press, Pennsylvania, USA.",
      "doi": ""
    },
    {
      "text": "Schwartz Cowan, R. (1989). More Work for Mother: the Ironies of Household Technology from the Open Hearth to the Microwave. Free Association Books, London, UK.",
      "doi": ""
    },
    {
      "text": "SEW. (2007). Reference Guide: Eco-Pioneer Trial. South East Water (SEW), Melbourne, VIC.",
      "doi": ""
    },
    {
      "text": "3Shipworth, M. (2000). Motivating Home Energy Action: a Handbook of What Works. Australian Greenhouse Office, Canberra, Australia.",
      "doi": ""
    },
    {
      "text": "3Shove, E. (1997). Revealing the invisible: sociology, energy and the environment. In M. Redclift and G. Woodgate. The International Handbook of Environmental Sociology. Edward Elgar Publishing, Cheltenham, UK.",
      "doi": ""
    },
    {
      "text": "3Shove, E. (2003). Comfort, Cleanliness and Convenience: the Social Organisation of Normality. Berg Publishers, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "40.Sofoulis, Z. (2005). Big water, everyday water: a sociotechnical perspective. Continuum: Journal of Media &amp;#38; Cultural Studies, 19(4), 445--463.",
      "doi": ""
    },
    {
      "text": "4Southerton, D., Chappells, H. and Van Vliet, B. (2004). Sustainable Consumption: the Implications of Changing Infrastructures of Provision. Edward Elgar, Cheltenham, UK.",
      "doi": ""
    },
    {
      "text": "4Strengers, Y. (2008). Smart metering demand management programs: challenging the comfort and cleanliness habitus of households. Proc. OZCHI 2008, ACM, 9--16.  ",
      "doi": "10.1145/1517744.1517747"
    },
    {
      "text": "4Strengers, Y. (2010). Air-conditioning Australian households: a trial of Dynamic Peak Pricing. Energy Policy, 38(11), 7312--7322.",
      "doi": ""
    },
    {
      "text": "4Strengers, Y. (in press). Beyond demand management: co-managing energy and water consumption in Australian households. Policy Studies.",
      "doi": ""
    },
    {
      "text": "4Suchman, L. (1987). Plans and situated actions. The problem of human-machine communication. Cambridge University Press, Cambridge, UK. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "4Suchman, L. (2007). Human-machine reconfigurations: plans and situated actions. Cambridge University Press, Cambridge, UK. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "4Suchman, L., Blomberg, J., Orr, J. E. and Trigg, R. (1999). Reconstructing technologies as social practice American Behavioral Scientist, 43(3), 392--408.",
      "doi": ""
    },
    {
      "text": "4SV. (2009). You have the power. Save energy. Sustainability Victoria, Melbourne, Australia. {http://www.saveenergy.vic.gov.au/}.",
      "doi": ""
    },
    {
      "text": "4Van Vliet, B., Chappells, H. and Shove, E. (2005). Infrastructures of Consumption: Environmental Innovation in the Utilities Industries. Earthscan, London {UK}.",
      "doi": ""
    },
    {
      "text": "50.VictGov. (2009). Save Water Target 155. Victorian Government, Melbourne, Australia. {http://www.target155.vic.gov.au/home}.",
      "doi": ""
    },
    {
      "text": "5Vigarello, G. (1988). Concepts of Cleanliness: Changing Attitudes in France since the Middle Ages. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "5Warde, A. (2005). Consumption and theories of practice. Journal of Consumer Culture, 5(2), 131--153.",
      "doi": ""
    },
    {
      "text": "5Wetherall, B. (2008). Draft Report of the EcoPioneer Pilot Program. South East Water, Melbourne, Australia.",
      "doi": ""
    },
    {
      "text": "5Wilhite, H., Shove, E., Lutzenhiser, L. and Kempton, W. (2000). The legacy of twenty years of energy demand management: we know more about individual behaviour but next to nothing about demand. In E. Jochem, J. Sathaya and D. Bouille. Society, Behaviour and Climate Change Mitigation. Kluwer Academic Publishers, {The Netherlands}, 109--126.",
      "doi": ""
    },
    {
      "text": "5Woodruff, A., Hasbrouck, J. and Augustin, S. (2008). A bright green perspective on sustainable choices. Proc. CHI 2008, ACM, 313--322..  ",
      "doi": "10.1145/1357054.1357109"
    }
  ]
}