{
  "doi": "10.1145/1978942.1979211",
  "title": "Designing from within: humanaquarium",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1855-1864",
  "year": 2011,
  "badges": [],
  "abstract": "We present an experience-based approach to designing a collaborative interactive performance, humanaquarium. Our research explores public interaction with digital technology through the practice-based inquiry of an inter-disciplinary team of interaction designers and musicians. We present a method of designing experience from within, literally situating ourselves within the performance/use space and assuming the roles both of performers and of designers as we develop and refine the humanaquarium project over the course of a year's worth of public performances.",
  "authors": [
    {
      "name": "Robyn Taylor",
      "institution": "University of Alberta, Edmonton, Canada",
      "img": "/do/10.1145/contrib-81500665442/rel-imgonly/florencepic2.jpg",
      "acmid": "81500665442",
      "orcid": "missing"
    },
    {
      "name": "Guy Schofield",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474697023",
      "orcid": "missing"
    },
    {
      "name": "John Shearer",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646422",
      "orcid": "missing"
    },
    {
      "name": "Jayne Wallace",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81318496730/rel-imgonly/jayne_sm.jpg",
      "acmid": "81318496730",
      "orcid": "missing"
    },
    {
      "name": "Peter Wright",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Pierre Boulanger",
      "institution": "University of Alberta, Edmonton, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100433001",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Benford, S., Crabtree, A., Reeves, S., Sheridan, J., Dix, A., Flintham, M. and Drozd, A. The Frame of the Game: Blurring the Boundary between Fiction and Reality in Mobile Experiences. In Proceedings of the SIGCHI conference on Human Factors in computing systems, pages 427--436. ACM New York, NY, USA, 2006.  ",
      "doi": "10.1145/1124772.1124836"
    },
    {
      "text": "Bishop, C. Installation Art a Critical History. London: Tate, 2005.",
      "doi": ""
    },
    {
      "text": "Boehner, K., Sengers, P.,Warner, S. Interfaces with the ineffable: Meeting aesthetic experience on its own terms, ACM Transactions on Computer-Human Interaction (TOCHI), v.15 n.3, p.1--29. 2008.  ",
      "doi": "10.1145/1453152.1453155"
    },
    {
      "text": "Braun, V. and Clarke, V. Using Thematic analysis in Psychology. Qualitative Research in Psychology, 3, 2, 77--101. 2006.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Flow: the psychology of optimal experience. New York: Harper & Row, 1990.",
      "doi": ""
    },
    {
      "text": "Design-Based Research Collective. Design-based research: An emerging paradigm for educational inquiry. Educational Researcher, 32(1), 5--8. 2003.",
      "doi": ""
    },
    {
      "text": "Gaver, W. Cultural commentators: Non-native interpretations as resources for polyphonic assessment, International Journal of Human-Computer Studies, v.65 n.4, p.292--305, April, 200.  ",
      "doi": "10.1016/j.ijhcs.2006.11.014"
    },
    {
      "text": "Gaver, W. The video window: my life with a ludic system. Personal and Ubiquitous Computing, 10(2):60--65, 2006.  ",
      "doi": "10.1007/s00779-005-0002-2"
    },
    {
      "text": "Gaver, W., Boucher, A., Law, A., Pennington, S., Bowers, J., Beaver, J., Humble, J., Kerridge, T., Villar, N. and Wilkie, A. Threshold devices: looking out from the home. 2008.",
      "doi": ""
    },
    {
      "text": "Goffman, E. Presentation of Self in Everyday Life. Doubleday Anchor Books, New York. 1959.",
      "doi": ""
    },
    {
      "text": "1Han, J.Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proc. of UIST'05. pp. 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hook, J., Green, D. and Olivier, P. A short film about VJs: Using documentary film to engage performers in design. Extended Abstracts of the ACM Conference on Human Factors in Computing Systems (CHI'09), 2009.  ",
      "doi": "10.1145/1520340.1520507"
    },
    {
      "text": "Krauss, R. Passages in Modern Sculpture. Cambridge Mass: The MIT Press, 1977.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. and Wright, P. Technology as experience. The MIT Press, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Sheridan, J.G., Bryan-Kinns, N. and Bayliss, A. Encouraging witting participation and performance in digital live art, Proc. of the 21st British CHI Group Annual Conference on HCI. United Kingdom, 2007. ",
      "doi": "10.5555/1531294.1531297"
    },
    {
      "text": "Sheridan, J., Dix, A., Lock, S. and Bayliss, A. Understanding Interaction in Ubiquitous Guerrilla Performances in Playful Arenas. In Proceedings of HCI, pages 3--18. Springer, 2004.",
      "doi": ""
    },
    {
      "text": "Suchman, L.A. Human-Machine Reconfigurations: Plans and Situated Actions, Cambridge University Press, New York, NY, 200. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Taylor, R., Boulanger, P., Olivier, P., Wallace, J. Exploring participatory performance to inform the design of collaborative public interfaces. CHI Extended Abstracts 2009: 3721--37.  ",
      "doi": "10.1145/1520340.1520561"
    },
    {
      "text": "Taylor, R., Schofield, G., Shearer, J., Wallace, J., Boulanger, P., Olivier, P. humanaquarium: A Participatory Performance System. In Proceedings. of the 2010 Conference on New Interfaces for Musical Expression, pp. 440--443, 2010.",
      "doi": ""
    },
    {
      "text": "Wallace, J. Emotionally charged: a Practice-Centred Enquiry of Digital Jewellery and Personal Emotional Significance. PhD thesis, Shefield Hallam University, 2007.",
      "doi": ""
    },
    {
      "text": "Wright, P. and McCarthy, J. Experience-Centered Design: Designers, Users, and Communities in Dialogue. Morgan Claypool, 2010. ",
      "doi": "10.5555/1855065"
    },
    {
      "text": "Wright, P., Wallace, J. and McCarthy, J. Aesthetics and experience-centered design. ACM Transactions on Computer-Human Interaction. 15(3). 2008..  ",
      "doi": "10.1145/1460355.1460360"
    }
  ]
}