{
  "doi": "10.1145/1978942.1979366",
  "title": "Design lessons from the fastest q&a site in the west",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2857-2866",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper analyzes a Question & Answer site for programmers, Stack Overflow, that dramatically improves on the utility and performance of Q&A systems for technical domains. Over 92% of Stack Overflow questions about expert topics are answered - in a median time of 11 minutes. Using a mixed methods approach that combines statistical data analysis with user interviews, we seek to understand this success. We argue that it is not primarily due to an a priori superior technical design, but also to the high visibility and daily involvement of the design team within the community they serve. This model of continued community leadership presents challenges to both CSCW systems research as well as to attempts to apply the Stack Overflow model to other specialized knowledge domains.",
  "tags": [
    "q&a",
    "mixed methods analysis"
  ],
  "authors": [
    {
      "name": "Lena Mamykina",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500656179",
      "orcid": "missing"
    },
    {
      "name": "Bella Manoim",
      "institution": "Bard College, Annandale-on-Hudson, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655316",
      "orcid": "missing"
    },
    {
      "name": "Manas Mittal",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489575",
      "orcid": "missing"
    },
    {
      "name": "George Hripcsak",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100308397",
      "orcid": "missing"
    },
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. S. and Malone, T. W. Answer Garden: a tool for growing organizational memory. Proceedings of the ACM SIGOIS and IEEE CS TC-OA conference on Office information systems, ACM (1990), 31--39.  ",
      "doi": "10.1145/91474.91485"
    },
    {
      "text": "Adamic, L. A., Zhang, J., Bakshy, E., and Ackerman, M. S. Knowledge sharing and yahoo answers: everyone knows something. Proceeding of WWW 2008, ACM (2008), 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Barcellini, F., D&amp;#233;tienne, F., Burkhardt, J., and Sack, W. Thematic coherence and quotation practices in OSS design-oriented online discussions. Proceedings of GROUP 2005, ACM (2005), 177--186.  ",
      "doi": "10.1145/1099203.1099237"
    },
    {
      "text": "Bouguessa, M., Dumoulin, B., and Wang, S. Identifying authoritative actors in question-answering forums: the case of Yahoo! answers. Proceeding of ACM SIGKDD 2008, ACM (2008), 866--874.  ",
      "doi": "10.1145/1401890.1401994"
    },
    {
      "text": "Brandt, J., Dontcheva, M., Weskamp, M., and Klemmer, S. R. Example-centric programming: integrating web search into the development environment. Proceedings of CHI 2010, ACM (2010), 513--522.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Brooks, F. P. The Design of Design: Essays from a Computer Scientist. Addison-Wesley Professional 2010. ",
      "doi": "10.5555/1738960"
    },
    {
      "text": "Corbin, J. and Strauss, A. C. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, Inc, 2007.",
      "doi": ""
    },
    {
      "text": "Dearman, D. and Truong, K. N. Why users of Yahoo! Answers do not answer questions. Proceedings of CHI 2010, ACM (2010), 329--332.  ",
      "doi": "10.1145/1753326.1753376"
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: eight challenges for developers. Communications of the ACM 37, 1 (1994), 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Gy&amp;#246;ngyi, Z., Koutrika, G., Pedersen, J., and Garcia-Molina, H. Questioning Yahoo! Answers. Proceedings of the First Workshop on Question Answering on the Web (at WWW 2008), (2008).",
      "doi": ""
    },
    {
      "text": "Harper, F. M., Moy, D., and Konstan, J. A. Facts or friends?: distinguishing informational and conversational questions in social Q&amp;#38;A sites. Proceedings of CHI 2009, ACM (2009), 759--768.  ",
      "doi": "10.1145/1518701.1518819"
    },
    {
      "text": "Hartmann, B., MacDougall, D., Brandt, J., and Klemmer, S. R. What would other programmers do: suggesting solutions to error messages. Proceedings of CHI 2010, ACM (2010), 1019--1028.  ",
      "doi": "10.1145/1753326.1753478"
    },
    {
      "text": "Horowitz, D. and Kamvar, S. D. The anatomy of a large-scale social search engine. Proceedings of WWW 2010, ACM (2010), 431--440.  ",
      "doi": "10.1145/1772690.1772735"
    },
    {
      "text": "Hsieh, G. and Counts, S. mimir: a market-based real-time question and answer service. Proceedings of CHI 2009, ACM (2009), 769--778.  ",
      "doi": "10.1145/1518701.1518820"
    },
    {
      "text": "Hsieh, G., Kraut, R. E., and Hudson, S. E. Why pay? Exploring how financial incentives are used for question &amp;#38; answer. Proceedings of CHI 2010, ACM (2010), 305--314.  ",
      "doi": "10.1145/1753326.1753373"
    },
    {
      "text": "Kleinberg, J. M. Authoritative sources in a hyperlinked environment. Journal of the ACM 46/5, 1999, 604--632.  ",
      "doi": "10.1145/324133.324140"
    },
    {
      "text": "Konstan, J. A., Miller, B. N., Maltz, D., Herlocker, J. L., Gordon, L. R., and Riedl, J. GroupLens: applying collaborative filtering to Usenet news. Communications of the ACM 40, 1997, 77--87.  ",
      "doi": "10.1145/245108.245126"
    },
    {
      "text": "Kumar, R., Lifshits, Y., and Tomkins, A. Evolution of two-sided markets. Proceedings of the third ACM international conference on Web search and data mining, ACM (2010), 311--320.  ",
      "doi": "10.1145/1718487.1718526"
    },
    {
      "text": "Lampe, C. and Resnick, P. Slash(dot) and burn: distributed moderation in a large online conversation space. Proceedings of CHI 2004, ACM (2004), 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Morris, M. R., Teevan, J., and Panovich, K. What do people ask their social networks, and why?: a survey study of status message q&amp;#38;a behavior. Proceedings of CHI 2010, ACM (2010), 1739--1748.  ",
      "doi": "10.1145/1753326.1753587"
    },
    {
      "text": "Nam, K. K., Ackerman, M. S., and Adamic, L. A. Questions in, knowledge in? A study of Naver's question answering community. Proceedings of CHI 2009, ACM (2009), 779--788.  ",
      "doi": "10.1145/1518701.1518821"
    },
    {
      "text": "Oktay, H., Taylor, B. J., and Jensen, D. D. Causal Discovery in Social Media Using Quasi-Experimental Designs. Proceedings of the ACM/SIGKDD Workshop on Social Media Analytics, (2010).  ",
      "doi": "10.1145/1964858.1964859"
    },
    {
      "text": "Raban, D. R. and Harper, F. M. Motivations for Answering Questions Online Abstract. New Media and Innovative Technologies, (2008).",
      "doi": ""
    },
    {
      "text": "Raymond, E. S. Homesteading the Noosphere. In The Cathedral and the Bazaar. O'Reilly, 1999. ",
      "doi": "10.5555/580808"
    },
    {
      "text": "Rodrigues, E. M. and Milic-Frayling, N. Socializing or knowledge sharing? Characterizing social intent in community question answering. Proceedings of CHI 2009, ACM (2009), 1127--1136.  ",
      "doi": "10.1145/1645953.1646096"
    },
    {
      "text": "Torrey, C., Churchill, E. F., and McDonald, D. W. Learning how: the search for craft knowledge on the internet. Proceedings of CHI 2009, ACM (2009), 1371--1380.  ",
      "doi": "10.1145/1518701.1518908"
    },
    {
      "text": "Zhang, J., Ackerman, M. S., and Adamic, L. Expertise networks in online communities: structure and algorithms. Proceedings of WWW 2007, ACM (2007), 221--230.  ",
      "doi": "10.1145/1242572.1242603"
    }
  ]
}