{
  "doi": "10.1145/1978942.1979359",
  "title": "Prototyping dynamics: sharing multiple designs improves exploration, group rapport, and results",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2807-2816",
  "year": 2011,
  "badges": [],
  "abstract": "Prototypes ground group communication and facilitate decision making. However, overly investing in a single design idea can lead to fixation and impede the collaborative process. Does sharing multiple designs improve collaboration? In a study, participants created advertisements individually and then met with a partner. In the Share Multiple condition, participants designed and shared three ads. In the Share Best condition, participants designed three ads and selected one to share. In the Share One condition, participants designed and shared one ad. Sharing multiple designs improved outcome, exploration, sharing, and group rapport. These participants integrated more of their partner's ideas into their own subsequent designs, explored a more divergent set of ideas, and provided more productive critiques of their partner's designs. Furthermore, their ads were rated more highly and garnered a higher click-through rate when hosted online.",
  "authors": [
    {
      "name": "Steven Dow",
      "institution": "Stanford University, Stanford, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    },
    {
      "name": "Julie Fortuna",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484653377",
      "orcid": "missing"
    },
    {
      "name": "Dan Schwartz",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100404029",
      "orcid": "missing"
    },
    {
      "name": "Beth Altringer",
      "institution": "Harvard University, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656643",
      "orcid": "missing"
    },
    {
      "name": "Daniel Schwartz",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100404056",
      "orcid": "missing"
    },
    {
      "name": "Scott Klemmer",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arkes, H. R. and Blumer, C. The psychology of sunk cost. Organizational Behavior and Human Decision Processes 35, 1 (1985), 124--140.",
      "doi": ""
    },
    {
      "text": "Aron, A., Aron, E. N., and Smollan, D. Inclusion of Other in the Self Scale and the Structure of Interpersonal Closeness. Journal of Personality and Social Psychology 63, 4 (1992), 596--612.",
      "doi": ""
    },
    {
      "text": "Aronson, E., Bridgeman, D., and Geffner, R. Interdependent Interactions and Prosocial Behavior. Journal of Research and Development in Education 12, 1 (1978), 16--27.",
      "doi": ""
    },
    {
      "text": "Ball, L. J. and Ormerod, T. C. Structured and opportunistic processing in design: a critical discussion. International Journal Human-Computer Studies 43, 1 (1995), 131--151.  ",
      "doi": "10.1006/ijhc.1995.1038"
    },
    {
      "text": "Bao, P., Gerber, E., Gergle, D., and Hoffman, D. Momentum: getting and staying on topic during a brainstorm. Proc of conf on Human factors in computing systems, ACM (2010), 1233--1236.  ",
      "doi": "10.1145/1753326.1753511"
    },
    {
      "text": "Ben-David, I., Graham, J. R., and Harvey, C. R. Managerial Overconfidence and Corporate Policies. National Bureau of Economic Research Working Paper Series No. 13711, (2007).",
      "doi": ""
    },
    {
      "text": "Brandt, J., Dontcheva, M., Weskamp, M., and Klemmer, S. R. Example-centric programming: integrating web search into the development environment. Proc of conf on Human factors in computing systems, ACM (2010), 513--522.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Brereton, M., Cannon, M., Mabogunje, A., and Leifer, L. Collaboration in Design Teams: How Social Interaction Shapes the Product. In Analyzing Design Activity. Wiley, 1996.",
      "doi": ""
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann, 2007. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Cross, N. Expertise in design: an overview. Design Studies 25, 5 (2004), 427--441.",
      "doi": ""
    },
    {
      "text": "Curhan, J. R., Elfenbein, H. A., and Xu, H. What Do People Value When They Negotiate? Mapping the Domain of Subjective Value in Negotiation. Journal of Personality and Social Psychology 91, 3 (2006), 493--512.",
      "doi": ""
    },
    {
      "text": "Dannels, D. P. and Martin, K. N. Critiquing Critiques: A Genre Analysis of Feedback Across Novice to Expert Design Studios. Journal of Business and Technical Communication 22, 2 (2008), 135--159.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Lee, M. K., Dey, A. K., and Zimmerman, J. Rapidly Exploring Application Design Through Speed Dating. Proc. of Conf on Ubiquitous Computing, (2007). ",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Diehl, M. and Stroebe, W. Productivity Loss In Brainstorming Groups: Toward the Solution of a Riddle. Journal of Personality and Social Psychology 53, 3 (1987), 497--509.",
      "doi": ""
    },
    {
      "text": "Dow, S. P., Heddleston, K., and Klemmer, S. R. The Efficacy of Prototyping Under Time Constraints. Proceeding of ACM Conf. on Creativity and Cognition, ACM (2009), 165--174.  ",
      "doi": "10.1145/1640233.1640260"
    },
    {
      "text": "Dow, S., Glassco, A., Kass, J., Schwarz, M., Schwartz, D. L., and Klemmer, S. R. Parallel Prototyping Leads to Better Design Results, More Divergence, and Increased Self-Efficacy. Transactions on Computer-Human Interaction 4, (2010).  ",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Dweck, C. Mindset: The New Psychology of Success. Ballantine Books, 2007.",
      "doi": ""
    },
    {
      "text": "Ericsson, K. A. and Smith, J. Toward a General Theory of Expertise: Prospects and Limits. Cambridge University Press, 1991.",
      "doi": ""
    },
    {
      "text": "Fauconnier, G. and Turner, M. The Way We Think: Conceptual Blending and the Mind's Hidden Complexities. Basic Books, 2003.",
      "doi": ""
    },
    {
      "text": "Felps, W., Mitchell, T., and Byington, E. How, When, and Why Bad Apples Spoil the Barrel: Negative Group Members and Dysfunctional Groups. Research in Organizational Behavior 27, (2006), 175--222.",
      "doi": ""
    },
    {
      "text": "Finke, R. A., Ward, T. B., and Smith, S. M. Creative Cognition: Theory, Research, and Applications. The MIT Press, 1996.",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Beaver, J., and Benford, S. Ambiguity as a resource for design. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2003), 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Gerber, E. Prototyping Practice in Context: The Psychological Experience in a High Tech Firm. Journal of Design Studies, (2010).",
      "doi": ""
    },
    {
      "text": "Hampton, J. A. Inheritance of attributes in natural concept conjunctions. Memory & Cognition 15, 1 (1987), 55--71.",
      "doi": ""
    },
    {
      "text": "Hartmann, B., Yu, L., Allison, A., Yang, Y., and Klemmer, S. R. Design as exploration: creating interface alternatives through parallel authoring and runtime tuning. Proc of the conf on User interface software and technology, ACM (2008), 91--100.  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Herzog, S. M. and Hertwig, R. The Wisdom of Many in One Mind. Psychological Science 20, 2 (2009), 231--237.",
      "doi": ""
    },
    {
      "text": "Hyland, F. and Hyland, K. Sugaring the pill: Praise and criticism in written feedback. Journal of Second Language Writing 10, 3 (2001), 185--212.",
      "doi": ""
    },
    {
      "text": "Iyengar, S. S. and Lepper, M. R. When choice is demotivating: can one desire too much of a good thing? Journal of Personality and Social Psychology 79, 6 (2000), 995--1006.",
      "doi": ""
    },
    {
      "text": "Janis, I. L. Groupthink: Psychological Studies of Policy Decisions and Fiascoes. Wadsworth Publishing, 1982.",
      "doi": ""
    },
    {
      "text": "Jansson, D. and Smith, S. Design Fixation. Design Studies 12, 1 (1991), 3--11.",
      "doi": ""
    },
    {
      "text": "Kershaw, T. C. and Ohlsson, S. Multiple causes of difficulty in insight: the case of the nine-dot problem. Journal of Experimental Psychology. Learning, Memory, and Cognition 30, 1 (2004), 3--13.",
      "doi": ""
    },
    {
      "text": "Kohavi, R. and Longbotham, R. Online Experiments: Lessons Learned. Computer 40, 2007, 103--105.  ",
      "doi": "10.1109/MC.2007.328"
    },
    {
      "text": "Kosara, R. Visualization Criticism - The Missing Link Between Information Visualization and Art. Proc of the Conf on Information Visualization, IEEE Computer Society (2007), 631--636.  ",
      "doi": "10.1109/IV.2007.130"
    },
    {
      "text": "Larrick, R. P. Broaden the decision frame to make effective decisions. In Handbook of Principles of Organizational Behavior. Wiley and Sons, 2009.",
      "doi": ""
    },
    {
      "text": "Lee, B., Srivastava, S., Kumar, R., Brafman, R., and Klemmer, S. R. Designing with interactive example galleries. Proc of the conf on Human factors in computing systems, ACM (2010), 2257--2266.  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Leifer, L. Dancing with Ambiguity: design thinking in theory and practice. 2010.",
      "doi": ""
    },
    {
      "text": "Mark, G., Gonzalez, V. M., and Harris, J. No task left behind?: examining the nature of fragmented work. Proc of the conf on Human factors in computing systems, (2005), 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Marsh, R. L., Landau, J. D., and Hicks, J. L. How examples may (and may not) constrain creativity. Memory & Cognition 24, 5 (1996), 669--680.",
      "doi": ""
    },
    {
      "text": "Moran, T. P. and Carroll, J. M. Design Rationale: Concepts, Techniques, and Use. CRC Press, 1996. ",
      "doi": "10.5555/546974"
    },
    {
      "text": "Nickerson, R. S. Confirmation Bias: A Ubiquitous Phenomenon in Many Guises. Review of General Psychology 2, (1998), 175--220.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. and Faber, J. M. Improving System Usability Through Parallel Design. Computer 29, 2 (1996), 29--35.  ",
      "doi": "10.1109/2.485844"
    },
    {
      "text": "Ranganath, R., Jurafsky, D., and McFarland, D. It's not you, it's me: detecting flirting and its misperception in speed-dates. Proc of Conf on Empirical Methods in Natural Language Processing, Association for Computational Linguistics (2009), 334--342. ",
      "doi": "10.5555/1699510.1699554"
    },
    {
      "text": "S. Smith. Constraining effects of examples in a creative generation task. Memory & Cognition 21, (1993), 837--845.",
      "doi": ""
    },
    {
      "text": "Schon, D. A. The Reflective Practitioner: How Professionals Think in Action. Ashgate Publishing, 1995.",
      "doi": ""
    },
    {
      "text": "Schrage, M. Serious Play: How the World's Best Companies Simulate to Innovate. Harvard Business School Press, 1999.",
      "doi": ""
    },
    {
      "text": "Schwartz, B. The Paradox of Choice: Why More Is Less. Ecco, 2004.",
      "doi": ""
    },
    {
      "text": "Schwartz, D. L. The Emergence of Abstract Representations in Dyad Problem Solving. Journal of the Learning Sciences 4, 3 (1995), 321.",
      "doi": ""
    },
    {
      "text": "Stroebe, W. and Diehl, M. Why Groups are less Effective than their Members: On Productivity Losses in Idea-generating Groups. European Review of Social Psychology 5, (1994), 271.",
      "doi": ""
    },
    {
      "text": "Sutton, R. and Hargadon, A. Brainstorming groups in context: effectiveness in a product design firm. Administrative Science Quarterly, (1996).",
      "doi": ""
    },
    {
      "text": "Taylor, D., Berry, P., and Block, C. Does Group Participation When Using Brainstorming Facilitate or Inhibit Creative Thinking? Administrative Science Quarterly 3, 1 (1958), 23--47.",
      "doi": ""
    },
    {
      "text": "Thomke, S. and Nimgade, A. IDEO Product Development. Harvard Business School Case, (2000).",
      "doi": ""
    },
    {
      "text": "Thompson, L., Gentner, D., and Loewenstein, J. Avoiding Missed Opportunities in Managerial Life: Analogical Training More Powerful Than Individual Case Training. Organizational Behavior and Human Decision Processes 82, 1 (2000), 60--75.",
      "doi": ""
    },
    {
      "text": "Tohidi, M., Buxton, W., Baecker, R., and Sellen, A. Getting the right design and the design right. Proceedings of the SIG-CHI conference on Human Factors in computing systems, ACM (2006), 1243--1252.  ",
      "doi": "10.1145/1124772.1124960"
    },
    {
      "text": "Warr, A. and O'Neill, E. Understanding design as a social creative process. Proc of the conf on Creativity & Cognition, ACM (2005), 118--127.  ",
      "doi": "10.1145/1056224.1056242"
    },
    {
      "text": "Wisniewski, E. and Gentner, D. On the combinatorial semantics of noun pairs: {Minor} and major adjustments to meaning. In Understanding word and sentence. Amsterdam: North Holland, 1991, 241--284.",
      "doi": ""
    },
    {
      "text": "Zwicky, F. Discovery, Invention, Research Through the Morphological Approach. MacMillan, 1969.",
      "doi": ""
    }
  ]
}