{
  "doi": "10.1145/1978942.1979245",
  "title": "Exploring reactive access control",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2085-2094",
  "year": 2011,
  "badges": [],
  "abstract": "As users store and share more digital content at home, access control becomes increasingly important. One promising approach for helping non-expert users create accurate access policies is reactive policy creation, in which users can update their policy dynamically in response to access requests that would not otherwise succeed. An earlier study suggested reactive policy creation might be a good fit for file access control at home. To test this, we conducted an experience-sampling study in which participants used a simulated reactive access-control system for a week. Our results bolster the case for reactive policy creation as one mode by which home users specify access-control policy. We found both quantitative and qualitative evidence of dynamic, situational policies that are hard to implement using traditional models but that reactive policy creation can facilitate. While we found some clear disadvantages to the reactive model, they do not seem insurmountable.",
  "authors": [
    {
      "name": "Michelle L. Mazurek",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641915",
      "orcid": "missing"
    },
    {
      "name": "Peter F. Klemperer",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331496548",
      "orcid": "missing"
    },
    {
      "name": "Richard Shay",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81339527920/rel-imgonly/rich.jpg",
      "acmid": "81339527920",
      "orcid": "missing"
    },
    {
      "name": "Hassan Takabi",
      "institution": "University of Pittsburgh, Pittsburgh, Pennsylvania, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339531479",
      "orcid": "missing"
    },
    {
      "name": "Lujo Bauer",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81350570444/rel-imgonly/lujo-5.jpg",
      "acmid": "81350570444",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, Pennsylvania, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    }
  ],
  "references": [
    {
      "text": "M. S. Ackerman. The intellectual challenge of CSCW: the gap between social requirements and technical feasibility. Hum.-Comput. Inter., September 2000.  ",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "S. Ahern, D. Eckles, N. S. Good, S. King, M. Naaman, and R. Nair. Over-exposed? privacy patterns and considerations in online and mobile photo sharing. In Proc. CHI, 2007.  ",
      "doi": "10.1145/1240624.1240683"
    },
    {
      "text": "L. Bauer, L. F. Cranor, M. K. Reiter, and K. Vaniea. Lessons learned from the deployment of a smartphone-based access-control system. In Proc. SOUPS, July 2007.  ",
      "doi": "10.1145/1280680.1280689"
    },
    {
      "text": "A. Brush and K. Inkpen. Yours, mine and ours? Sharing and use of technology in domestic environments. In Proc. UbiComp. 2007. ",
      "doi": "10.5555/1771592.1771599"
    },
    {
      "text": "S. Consolvo, I. E. Smith, T. Matthews, A. LaMarca, J. Tabert, and P. Powledge. Location disclosure to social relations: why, when, &amp;#38; what people want to share. In Proc. CHI, 2005.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "M. Csikszentmihalyi and R. Larson. Validity and reliability of the experience-sampling method. J Nerv Ment Dis, September 1987.",
      "doi": ""
    },
    {
      "text": "S. Egelman, A. Brush, and K. Inkpen. Family accounts: A new paradigm for user accounts within the home environment. In Proc. CSCW, 2008.  ",
      "doi": "10.1145/1460563.1460666"
    },
    {
      "text": "B. W. Lampson. Dynamic protection structures. In Proc. AFIPS, 1969.  ",
      "doi": "10.1145/1478559.1478563"
    },
    {
      "text": "R. A. Maxion and R. W. Reeder. Improving user-interface dependability through mitigation of human error. Int. J. Hum.-Comput. Stud., 63, 2005.  ",
      "doi": "10.1016/j.ijhcs.2005.04.009"
    },
    {
      "text": "M. L. Mazurek, J. P. Arsenault, J. Bresee, N. Gupta, I. Ion, C. Johns, D. Lee, Y. Liang, J. Olsen, B. Salmon, R. Shay, K. Vaniea, L. Bauer, L. F. Cranor, G. R. Ganger, and M. K. Reiter. Access control for home data sharing: Attitudes, needs and practices. In Proc. CHI, 2010.  ",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "J. S. Olson, J. Grudin, and E. Horvitz. A study of preferences for sharing and privacy. In Proc. CHI, 2005.  ",
      "doi": "10.1145/1056808.1057073"
    },
    {
      "text": "D. Povey. Optimistic security: A new access control paradigm. In Proc. NSPW, 2000.  ",
      "doi": "10.1145/335169.335188"
    },
    {
      "text": "M. N. Razavi and L. Iverson. A grounded theory of information sharing behavior in a personal learning space. In Proc. CSCW, 2006.  ",
      "doi": "10.1145/1180875.1180946"
    },
    {
      "text": "L. Richards. Handling Qualitative Data: A Practical Guide. Sage Publications, 2007.",
      "doi": ""
    },
    {
      "text": "L. Richards and J. M. Morse. Readme First for a User's Guide to Qualitative Methods. Sage Publications, 2007.",
      "doi": ""
    },
    {
      "text": "S. Voida, W. K. Edwards, M. W. Newman, R. E. Grinter, and N. Ducheneaut. Share and share alike: exploring the user interface affordances of file sharing. In Proc. CHI, 2006.  ",
      "doi": "10.1145/1124772.1124806"
    }
  ]
}