{
  "doi": "10.1145/1978942.1979189",
  "title": "Publics in practice: ubiquitous computing at a shelter for homeless mothers",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1687-1696",
  "year": 2011,
  "badges": [],
  "abstract": "Today, commodity technologies like mobile phones - once symbols of status and wealth - have become deeply woven into social and economic participation in Western society. Despite the pervasiveness of these technologies, there remain groups who may not have extensive access to them but who are nonetheless deeply affected by their presence in everyday life. In light of this, we designed, built, and deployed a ubiquitous computing system for one such overlooked group: the staff and residents at a shelter for homeless mothers. Our system connects mobile phones, a shared display, and a Web application to help staff and residents stay connected. We report on the adoption and use of this system over the course of a 30 week deployment, discussing the substantial impact our system had on shelter life and the broader implications for such socio-technical systems that sit at the juncture of social action and organizational coordination.",
  "tags": [
    "qualitative methods",
    "homeless",
    "longitudinal study",
    "constructed publics",
    "urban computing"
  ],
  "authors": [
    {
      "name": "Christopher A. Le Dantec",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/do/10.1145/contrib-81367592039/rel-imgonly/le_dantec_-_light_-_small.jpg",
      "acmid": "81367592039",
      "orcid": "0000-0001-8338-4852"
    },
    {
      "name": "Robert G. Farrell",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592510",
      "orcid": "missing"
    },
    {
      "name": "Jim E. Christensen",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100285123",
      "orcid": "missing"
    },
    {
      "name": "Mark Bailey",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, USA",
      "img": "/do/10.1145/contrib-81100645474/rel-imgonly/cdphoto2015acm.jpg",
      "acmid": "81100645474",
      "orcid": "missing"
    },
    {
      "name": "Jason B. Ellis",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332497475",
      "orcid": "missing"
    },
    {
      "name": "Wendy A. Kellogg",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, New York, USA",
      "img": "/do/10.1145/contrib-81100457150/rel-imgonly/81100457150.jpg",
      "acmid": "81100457150",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beegle, D. M. Overcoming the silence of generational poverty. Talking Points, 2003, 11--20.",
      "doi": ""
    },
    {
      "text": "Borning, A., Friedman, B., Davis, J. and Lin, P. Informing public deliberation: Value sensitive design of indicators for a large-scale urban simulation. In Proc. ECSCW 2005, Springer-Verlag, NY, USA, 2005, 449--468. ",
      "doi": "10.5555/1242029.1242052"
    },
    {
      "text": "Bovens, M. and Zourdis, S. From street-level to system-level bureaucracies: How information and communication technology is transforming administrative discretion and constitutional control. Public Administration Review, 62 (2), 2002, 174--184.",
      "doi": ""
    },
    {
      "text": "boyd, d. Feature implications of user choice: The cultural logic of \"Myspace or Facebook?\" interactions, 16 (6), 2009, 33--36.  ",
      "doi": "10.1145/1620693.1620701"
    },
    {
      "text": "Bryant, S. L., Forte, A. and Bruckman, A. Becoming wikipedian: Transformation of participation in a collaborative online encyclopedia. In Proc. GROUP 2005, ACM, New York, NY, USA, 2005, 1--10.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Conley, D. C. Getting it together: Social and institutional obstacles to getting off the streets. Sociological Forum, 11 (1), 1996, 25--40.",
      "doi": ""
    },
    {
      "text": "Dewey, J. The public and its problems. Swallow Press (Henry Holt &amp;#38; Company), Athens, OH, 1927.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Maki, J. and Martin, N. Mapmover: A case study of design-oriented research into collective expression and constructed publics. In Proc. CHI 2007, ACM, New York, NY, USA, 2007, 1249--1252.  ",
      "doi": "10.1145/1240624.1240813"
    },
    {
      "text": "DiSalvo, C. Design and the construction of publics. Design Issues, 25 (1), 2009, 48--63.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Sengers, P. and Brynjarsd'ottir, H.o. Mapping the landscape of sustainable HCI. In Proc. CHI 2010, ACM, New York, NY, USA, 2010, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Ehn, P. Design things: Challenges to design thinking in the tradition of participatory design? In Proc. PDC 2008, ACM, New York, NY, USA, 2008.",
      "doi": "10.5555/1795234.1795248"
    },
    {
      "text": "Grinter, R. E. and Eldridge, M. Wan2tlk?: Everyday text messaging. In Proc. CHI '03, ACM, New York, NY, USA, 2003, 441--448.  ",
      "doi": "10.1145/642611.642688"
    },
    {
      "text": "Harrison, S. and Dourish, P. Re-place-ing space: The roles of place and space in collaborative systems. In Proc. CSCW 1996, ACM, New York, NY, USA, 1996, 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hersberger, J. Are the economically poor information poor? Does the digital divide affect the homeless and access to information? Canadian Journal of Information &amp;#38; Library Sciences, 27 (3), 2002/2003, 45--63.",
      "doi": ""
    },
    {
      "text": "Hersberger, J. A qualitative approach to examining information transfer via social networks among homeless populations. New Review of Information Behaviour Research, 4 (1), 2003, 95--108.",
      "doi": ""
    },
    {
      "text": "Hersberger, J. The homeless and information need and services. Reference and User Services Quarterly, 44 (3), 2005, 199--202.",
      "doi": ""
    },
    {
      "text": "Hirsch, T. Water wars: Designing a civic game about water scarcity. In Proc. DIS 2010, ACM, 2010, 340--343.  ",
      "doi": "10.1145/1858171.1858232"
    },
    {
      "text": "Kling, R. Automated welfare client-tracking and service integration: The political economy of computing. Communications of the ACM, 21 (6), 1978, 484--493.  ",
      "doi": "10.1145/359511.359528"
    },
    {
      "text": "Kvasny, L. and Keil, M. The challenges of redressing the digital divide: A tale of two us cities. Information Systems Journal, 16 (1), 2006, 23--53.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C. A. and Edwards, W. K. The view from the trenches: Organization, power, and technology at two nonprofit homeless outreach center. In Proc. CSCW 2008, ACM, New York, NY, USA, 2008, 589--598.  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "Le Dantec, C. A. and Edwards, W. K. Designs on dignity: Perceptions of technology among the homeless. In Proc. CHI '08, ACM, New York, NY, USA, 2008, 627--636.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Le Dantec, C. A., Christensen, J. E., Bailey, M., Farrell, R. G., Ellis, J. B., Davis, C. M., Kellogg, W. A. and Edwards, W. K. A tale of two publics: Democratizing design at the margins. In Proc. DIS '10, ACM, 2010.  ",
      "doi": "10.1145/1858171.1858174"
    },
    {
      "text": "Le Dantec, C. A. and Edwards, W. K. Across boundaries of influence and accountability: The multiple scales of public sector information systems. In Proc. CHI '10, ACM, New York, NY, USA, 2010, 113--122.  ",
      "doi": "10.1145/1753326.1753345"
    },
    {
      "text": "Marres, N. The issues deserve more credit: Pragmatist contributions to the study of public involvement in controversy. Social Studies of Science, 37 (5), 2007, 759--780.",
      "doi": ""
    },
    {
      "text": "Miles, M. B. and Huberman, A. M. Qualitative data analysis: An expanded sourcebook. London, 1994.",
      "doi": ""
    },
    {
      "text": "Morozov, E. Iran: Downside to the \"Twitter revolution\". Dissent, 56 (4), 2009, 10--14.",
      "doi": ""
    },
    {
      "text": "Pinkett, R. Bridging the digital divide: Sociocultural constructionism and an asset-based approach to community technology and community building. 81st Annual Meeting of the American Educational Research Association (AERA), New Orleans, LA, 2000.",
      "doi": ""
    },
    {
      "text": "Pinkett, R. and O'Bryant, R. Building community, empowerment and self-sufficiency. Information, Communication &amp;#38; Society, 6 (2), 2003, 187--210.",
      "doi": ""
    },
    {
      "text": "Reingold, H. The virtual community: Homesteading on the electronic frontier. Addison-Wesley, 1993. ",
      "doi": "10.5555/541496"
    },
    {
      "text": "Roberson, J. and Nardi, B. Survival needs and social inclusion: Technology use among the homeless. In Proc. CSCW '10, ACM, New York, NY, USA, 2010.  ",
      "doi": "10.1145/1718918.1718993"
    },
    {
      "text": "Snow, D. A. and Anderson, L. Identity work among the homeless: The verbal construction and avowal of personal identities. The American Journal of Sociology, 92 (6), 1987, 1336--1371.",
      "doi": ""
    },
    {
      "text": "Star, S. L. and Bowker, G. C. How to infrastructure. in Lievrouw, L. A. and Livingstone, S. M. eds. The handbook of new media, Sage, London, UK, 2002, 151--162.",
      "doi": ""
    },
    {
      "text": "Strauss, A. and Corbin, J. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage, 1998.",
      "doi": ""
    },
    {
      "text": "Weiser, M., Gold, R. and Brown, J. S. The origins of ubiquitous computing research at PARC in the late 1980s. IBM Systems Journal, 38 (4), 1999, 693--696.  ",
      "doi": "10.1147/sj.384.0693"
    },
    {
      "text": "Woelfer, J. P. and Hendry, D. G. Homeless young people's experiences with information systems: Life and work in a community technology center. In Proc. CHI 2010, ACM, New York, NY, USA, 2010.  ",
      "doi": "10.1145/1753326.1753520"
    }
  ]
}