{
  "doi": "10.1145/1978942.1979437",
  "title": "AnatOnMe: facilitating doctor-patient communication using a projection-based handheld device",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3333-3342",
  "year": 2011,
  "badges": [],
  "abstract": "In this paper, we explore the use of a projection-based handheld device to facilitate in-clinic doctor-patient communication. We present the user-centered design process used to understand the workflow of medical professionals and to identify challenges they currently face in communicating information to patients. Based on the lessons learned, we developed AnatOnMe, a prototype projection-based hand-held system for enhancing information exchange in the current practice of one medical sub-specialty, physical therapy. We then present the results of a controlled experiment to understand the desirability and learning tradeoffs of using AnatOnMe to teach medical concepts on three potential projection surfaces - wall, model, and patient body. Finally, we present results of two expert reviews of the system.",
  "tags": [
    "handheld device",
    "physical therapy",
    "doctor-patient communication",
    "healthcare",
    "pico-projector"
  ],
  "authors": [
    {
      "name": "Tao Ni",
      "institution": "Virginia Tech, Blacksburg, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315490850",
      "orcid": "missing"
    },
    {
      "name": "Amy K. Karlson",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100168208",
      "orcid": "0000-0001-8934-7761"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "Arozullah, A.M. et al. Development and validation of a short-form, rapid estimate of adult literacy in medicine. In Medical Care 5, 11 (2007), 1026--1033.",
      "doi": ""
    },
    {
      "text": "Azuma, R.T. A survey of augmented reality. In Presence: Teleoperators and Virtual Environments 6, 4 (1997), 355--385.",
      "doi": "10.1162/pres.1997.6.4.355"
    },
    {
      "text": "Bickmore, T. et al. Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents. In Proc. CHI '10, ACM Press (2010), 1265--1274.  ",
      "doi": "10.1145/1518701.1518891"
    },
    {
      "text": "Cao, X. et al. Multi-user interaction using handheld projectors. In Proc. UIST '07, ACM Press (2007), 43--52.  ",
      "doi": "10.1145/1294211.1294220"
    },
    {
      "text": "Chase, L. et al. Perceptions of physical therapists toward patient education. In Physical Therapy 73, 11 (1993), 787--795.",
      "doi": ""
    },
    {
      "text": "Choe, E.K. et al. Empathy in healthcare technologies. In Proc. WISH '10, ACM Press (2010), 25--28.",
      "doi": ""
    },
    {
      "text": "Frankel, R. et al, Effects of exam-room computing on clinician-patient communication: a longitudinal qualitative study. In J. Gen. Intern. Med. 20, 8 (2005), 677--682.",
      "doi": ""
    },
    {
      "text": "Gahimer, J.E. et al. Amount of patient education in physical therapy practice and perceived effects. In Physical Therapy 76, 10 (1996), 1089--1096.",
      "doi": ""
    },
    {
      "text": "Hsu, J. et al. Health information technology and physician-patient interactions: impact of computers on communication during outpatient primary care visits. In J. Am. Med. Inform. Assoc.12, 4 (2005), 474--480.",
      "doi": ""
    },
    {
      "text": "Korsch, B. et al. Gaps in doctor-patient communication. In Pediatrics 42, 5 (1968), 855--871.",
      "doi": ""
    },
    {
      "text": "1Laidlaw, T.S. et al. Implementing a communication skills program in medical school: needs assessment and program change. In Medical Education 36, 2 (2002), 115--4.",
      "doi": ""
    },
    {
      "text": "Ludmerer, K.M. Time to heal: American medical education from the turn of the century to the era of managed care. Oxford University Press, 1999.",
      "doi": ""
    },
    {
      "text": "Meichenbaum, D. and Turk, D.C. Facilitating treatment adherence: a practitioner's handbook. Plenum Press, 1987.",
      "doi": ""
    },
    {
      "text": "Mellor, J.P. Realtime camera calibration for enhanced reality visualization. In Proc. CVRMed '95, Springer (1995), 471--475. ",
      "doi": "10.5555/646769.704768"
    },
    {
      "text": "Ong, L. et al. Doctor-patient communication: a review of the literature. In Social Sci. and Med. 40, 7 (1995), 903--918.",
      "doi": ""
    },
    {
      "text": "Raskar, R. et al. Shader lamps: animating real objects with image-based illumination. In Proc. Rendering Techniques '02, Springer (2002), 89--102. ",
      "doi": "10.5555/647653.732300"
    },
    {
      "text": "Raskar, R. et al. iLamps: geometrically aware and self-configuring projectors. In SIGGRAPH '06 Courses, Article 7.  ",
      "doi": "10.1145/1185657.1185802"
    },
    {
      "text": "Rolland, J.P. et al. Towards a novel augmented-reality tool to visualize dynamic 3D anatomy. In Proc. Medicine Meets Virtual Reality '97, IOS Press (1997), 337--348.",
      "doi": ""
    },
    {
      "text": "Sackett, D.L. and Snow, J.C. The magnitude of compliance and non-compliance. In Compliance in Health Care, Johns Hopkins University Press (1979), 11--22.",
      "doi": ""
    },
    {
      "text": "Song, H. et al. MouseLight: bimanual interactions on digital paper using a pen and a spatially-aware mobile projector. In Proc. CHI '10, ACM Press (2010), 2451--2460.  ",
      "doi": "10.1145/1753326.1753697"
    },
    {
      "text": "2Steward, M.A. Effective physician-patient communication and health outcomes: a review. In Canadian Med. Assoc. J. 152, 9 (1995), 1423--1433.",
      "doi": ""
    },
    {
      "text": "2Unruh, K.T. et al. Transforming clinic environments into information workspaces for patients. In Proc. CHI 2010, ACM Press (2010), 183--192.  ",
      "doi": "10.1145/1753326.1753354"
    },
    {
      "text": "Wilcox, L. et al. Designing patient-centric information displays for hospitals. In Proc. CHI '10, ACM Press (2010), 2123--2132.  ",
      "doi": "10.1145/1753326.1753650"
    },
    {
      "text": "Adherence to long-term therapies: evidence for action. World Health Organization, Geneva, Switzerland, 2003.",
      "doi": ""
    }
  ]
}