{
  "doi": "10.1145/1978942.1979215",
  "title": "Predicting the perceived quality of online mathematics contributions from users' reputations",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1885-1888",
  "year": 2011,
  "badges": [],
  "abstract": "There are two perspectives on the role of reputation in collaborative online projects such as Wikipedia or Yahoo! Answers. One, user reputation should be minimized in order to increase the number of contributions from a wide user base. Two, user reputation should be used as a heuristic to identify and promote high quality contributions. The current study examined how offline and online reputations of contributors affect perceived quality in MathOverflow, an online community with 3470 active users. On MathOverflow, users post high-level mathematics questions and answers. Community members also rate the quality of the questions and answers. This study is unique in being able to measure offline reputation of users. Both offline and online reputations were consistently and independently related to the perceived quality of authors' submissions, and there was only a moderate correlation between established offline and newly developed online reputation.",
  "tags": [
    "community question-answering",
    "information quality",
    "online reputation"
  ],
  "authors": [
    {
      "name": "Yla R. Tausczik",
      "institution": "University of Texas at Austin, Austin, Texas, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456636885",
      "orcid": "missing"
    },
    {
      "name": "James W. Pennebaker",
      "institution": "University of Texas at Austin, Austin, Texas, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392619251",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anthony, D., Smith, S. W., and Williamson, T. Reputation and reliability in collective goods: The case of the online encyclopedia Wikipedia. Rationality and Society 21 (2009), 283-\"306.",
      "doi": ""
    },
    {
      "text": "Giles, J. Internet encyclopaedias go head to head. Nature 438 (2005), 900-\"901.",
      "doi": ""
    },
    {
      "text": "Gowers, T., and Nielsen, M. Massively collaborative mathematics. Nature 461 (2009), 879-\"881.",
      "doi": ""
    },
    {
      "text": "Harper, F. M., Raban, D., Rafaeli, S., and Konstan, J. A. Predictors of answer quality in online Q&amp;#38;A sites. In Proc. CHI 2008, ACM Press (2008), 865--874.  ",
      "doi": "10.1145/1357054.1357191"
    },
    {
      "text": "Hossain, L., Wu, A., and Chung, K. K. S. Actor centrality correlates to project based coordination. In Proc. CSCW 2006, ACM Press (2006), 363 - 372.  ",
      "doi": "10.1145/1180875.1180930"
    },
    {
      "text": "Jurczyk, P., and Agichtein, E. Discovering authorities in question answer communities by using link analysis. In Proc. CIKM 2007, ACM Press (2007), 919-\"923.  ",
      "doi": "10.1145/1321440.1321575"
    },
    {
      "text": "Keegan, B., and Gergle, D. Egalitarians at the gate: One-sided gatekeeping practices in social media. In Proc. CSCW 2010, ACM Press (2010), 131-\"134.  ",
      "doi": "10.1145/1718918.1718943"
    },
    {
      "text": "Pennebaker, J. W., Booth, R. J., and Francis, M. E. Linguistic Inquiry and Word Count: LIWC.",
      "doi": ""
    },
    {
      "text": "Shah, C., and Pomerantz, J. Evaluating and predicting answer quality in community QA. In Proc. SIGIR 2010 (2010), 411-\"418.  ",
      "doi": "10.1145/1835449.1835518"
    },
    {
      "text": "Sylvan, E. Predicting influence in an online community of creators. In Proc. CHI 2010, ACM Press (2010), 1913--1916.  ",
      "doi": "10.1145/1753326.1753614"
    },
    {
      "text": "Tausczik, Y. R., and Pennebaker, J. W. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology 29 (2010), 24-\"54.",
      "doi": "10.1177/0261927x09351676"
    },
    {
      "text": "Zhang, J., Ackerman, M. S., and Adamic, L. Expertise networks in online communities: Structure and algorithms. In Proc. WWW 2007, ACM Press (2007), 221-\"230..  ",
      "doi": "10.1145/1242572.1242603"
    }
  ]
}