{
  "doi": "10.1145/1978942.1979146",
  "title": "PhotoCity: training experts at large-scale image acquisition through a competitive game",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1383-1392",
  "year": 2011,
  "badges": [],
  "abstract": "Large-scale, ground-level urban imagery has recently developed as an important element of online mapping tools such as Google's Street View. Such imagery is extremely valuable in a number of potential applications, ranging from augmented reality to 3D modeling, and from urban planning to monitoring city infrastructure. While such imagery is already available from many sources, including Street View and tourist photos on photo-sharing sites, these collections have drawbacks related to high cost, incompleteness, and accuracy. A potential solution is to leverage the community of photographers around the world to collaboratively acquire large-scale image collections. This work explores this approach through PhotoCity, an online game that trains its players to become \"experts\" at taking photos at targeted locations and in great density, for the purposes of creating 3D building models. To evaluate our approach, we ran a competition between two universities that resulted in the submission of over 100,000 photos, many of which were highly relevant for the 3D modeling task at hand. Although the number of players was small, we found that this was compensated for by incentives that drove players to become experts at photo collection, often capturing thousands of useful photos each.",
  "authors": [
    {
      "name": "Kathleen Tuite",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81464676243",
      "orcid": "missing"
    },
    {
      "name": "Noah Snavely",
      "institution": "Cornell University, Ithaca, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100156470",
      "orcid": "missing"
    },
    {
      "name": "Dun-yu Hsiao",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310483265",
      "orcid": "missing"
    },
    {
      "name": "Nadine Tabing",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658147",
      "orcid": "missing"
    },
    {
      "name": "Zoran Popovic",
      "institution": "University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620346",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Google Building Maker. http://sketchup.google.com/3dwh/buildingmaker.html.",
      "doi": ""
    },
    {
      "text": "Google SketchUp. http://sketchup.google.com/.",
      "doi": ""
    },
    {
      "text": "OpenStreetMap. http://www.openstreetmap.org/.",
      "doi": ""
    },
    {
      "text": "Wikimapia. http://www.wikimapia.org/.",
      "doi": ""
    },
    {
      "text": "Wikipedia. http://www.wikipedia.org/.",
      "doi": ""
    },
    {
      "text": "S. Agarwal, N. Snavely, I. Simon, S. M. Seitz, and R. Szeliski. Building Rome in a day. International Conference on Computer Vision, 2009.",
      "doi": ""
    },
    {
      "text": "C. Baber, J. Cross, T. Khaleel, and R. Beale. Location-based photography as sense-making. In BCS-HCI '08: Proceedings of the 22nd British HCI Group Annual Conference on People and Computers, pages 133--140, Swinton, UK, UK, 2008. British Computer Society. ",
      "doi": "10.5555/1531514.1531533"
    },
    {
      "text": "M. Bell, S. Reeves, B. Brown, S. Sherwood, D. MacMillan, J. Ferguson, and M. Chalmers. Eyespy: supporting navigation through play. In CHI '09: Proceedings of the 27th international conference on Human factors in computing systems, pages 123--132, New York, NY, USA, 2009. ACM.  ",
      "doi": "10.1145/1518701.1518723"
    },
    {
      "text": "S. Cooper, F. Khatib, A. Treuille, J. Barbero, J. Lee, M. Beenen, A. Leaver-Fay, D. Baker, Z. Popovic, and F. Players. Predicting protein structures with a multiplayer online game. Nature, 466(7307):756--760, August 2010.",
      "doi": ""
    },
    {
      "text": "D. Crandall, L. Backstrom, D. Huttenlocher, and J. Kleinberg. Mapping the world's photos. In Proc. Int. World Wide Web Conf., 2009.  ",
      "doi": "10.1145/1526709.1526812"
    },
    {
      "text": "P. E. Debevec, C. J. Taylor, and J. Malik. Modeling and rendering architecture from photographs: A hybrid geometry- and image-based approach. In SIGGRAPH Conf. Proc., pages 11--20, 1996.  ",
      "doi": "10.1145/237170.237191"
    },
    {
      "text": "J.-M. Frahm, P. Georgel, D. Gallup, T. Johnson, R. Raguram, C. Wu, Y.-H. Jen, E. Dunn, B. Clipp, S. Lazebnik, and M. Pollefeys. Building Rome on a cloudless day. In Proc. European Conf. on Computer Vision, 2010. ",
      "doi": "10.5555/1888089.1888117"
    },
    {
      "text": "Y. Furukawa and J. Ponce. Accurate camera calibration from multi-view stereo and bundle adjustment. Int. J. Comput. Vision, 84(3):257--268, 2009.  ",
      "doi": "10.1007/s11263-009-0232-2"
    },
    {
      "text": "A. Irschara, C. Zach, and H. Bischof. Towards wiki-based dense city modeling. pages 1--8, oct. 2007.",
      "doi": ""
    },
    {
      "text": "L. Kennedy, M. Naaman, S. Ahern, R. Nair, and T. Rattenbury. How Flickr helps us make sense of the world: Context and content in community-contributed media collections. In Proc. Int. Conf. on Multimedia, 2007.  ",
      "doi": "10.1145/1291233.1291384"
    },
    {
      "text": "L. Nan, A. Sharf, H. Zhang, D. Cohen-Or, and B. Chen. Smartboxes for interactive urban reconstruction. In SIGGRAPH Conf. Proc., 2010.  ",
      "doi": "10.1145/1833349.1778830"
    },
    {
      "text": "T. Quack, B. Leibe, and L. V. Gool. World-scale mining of objects and events from community photo collections. In Proc. Int. Conf. on Content-based Image and Video Retrieval, pages 47--56, 2008.  ",
      "doi": "10.1145/1386352.1386363"
    },
    {
      "text": "B. C. Russell, A. Torralba, K. P. Murphy, and W. T. Freeman. LabelMe: A database and web-based tool for image annotation. Int. J. of Computer Vision, 77(1-3):157--173, 2008.  ",
      "doi": "10.1007/s11263-007-0090-8"
    },
    {
      "text": "I. Simon, N. Snavely, and S. M. Seitz. Scene summarization for online image collections. In Proc. Int. Conf. on Computer Vision, 2007.",
      "doi": ""
    },
    {
      "text": "S. N. Sinha, D. Steedly, R. Szeliski, M. Agrawala, and M. Pollefeys. Interactive 3d architectural modeling from unordered photo collections. In SIGGRAPH Asia Conf. Proc., 2008.  ",
      "doi": "10.1145/1457515.1409112"
    },
    {
      "text": "N. Snavely, S. M. Seitz, and R. Szeliski. Photo tourism: Exploring photo collections in 3d. In SIGGRAPH Conference Proceedings, pages 835--846, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1179352.1141964"
    },
    {
      "text": "K. Tuite, N. Snavely, D. Hsiao, A. M. Smith, and Z. Popovic. Reconstructing the world in 3d: Bringing games with a purpose outdoors. In FDG '10: Proceedings of the 5th International Conference on Foundations of Digital Games, Monterey, CA, USA, 2010. ACM Press.  ",
      "doi": "10.1145/1822348.1822379"
    },
    {
      "text": "N. A. Van House. Flickr and public image-sharing: distant closeness and photo exhibition. In CHI '07: CHI '07 extended abstracts on Human factors in computing systems, pages 2717--2722, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1240866.1241068"
    },
    {
      "text": "L. von Ahn and L. Dabbish. Labeling images with a computer game. In CHI '04: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 319--326, New York, NY, USA, 2004. ACM.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "R. C. Zeleznik, K. P. Herndon, and J. F. Hughes. Sketch: An interface for sketching 3d scenes. In SIGGRAPH Conf. Proc., pages 163--170, 1996.  ",
      "doi": "10.1145/237170.237238"
    }
  ]
}