{
  "doi": "10.1145/1978942.1979263",
  "title": "HyperSource: bridging the gap between source and code-related web sites",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2207-2210",
  "year": 2011,
  "badges": [],
  "abstract": "Programmers frequently use the Web while writing code: they search for libraries, code examples, tutorials, and documentation. This link between code and visited Web pages remains implicit today. Connecting source code and browsing histories might help programmers maintain con-text, reduce the cost of Web page re-retrieval, and enhance understanding when code is shared. This note introduces HyperSource, an IDE augmentation that associates browsing histories with source code edits. HyperSource comprises a browser extension that logs visited pages; an IDE that tracks user activity and maps pages to code edits; a source document model that tracks visited pages at a character level; and a user interface that enables interaction with these histories. We discuss relevance heuristics and privacy issues inherent in this approach. Informal log analyses and user feedback suggest that our annotation model is promising for code editing and might also apply to other document authoring tasks after refinement.",
  "tags": [
    "edit wear",
    "browsing history",
    "code editors"
  ],
  "authors": [
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    },
    {
      "name": "Mark Dhillon",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470655922",
      "orcid": "missing"
    },
    {
      "name": "Matthew K. Chan",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81544033756",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Processing 1.0. http://processing.org/.",
      "doi": ""
    },
    {
      "text": "Brandt, J., Dontcheva, M., Weskamp, M., and Klemmer, S. R. Example-centric programming: integrating web search into the development environment. Proceedings of CHI 2010, ACM (2010), 513--522.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Brandt, J., Guo, P. J., Lewenstein, J., Dontcheva, M., and Klemmer, S. R. Two studies of opportunistic programming: interleaving web foraging, learning, and writing code. Proceedings of CHI 2009, ACM (2009), 1589--1598.  ",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "Goldman, M. and Miller, R. C. Codetrail: Connecting source code and web resources. Journal of Visual Languages &amp;#38; Computing 20, 4 (2009), 223--235.  ",
      "doi": "10.1016/j.jvlc.2009.04.003"
    },
    {
      "text": "Hill, W. C., Hollan, J. D., Wroblewski, D., and McCandless, T. Edit wear and read wear. Proceedings of CHI 1992, ACM (1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Kersten, M. and Murphy, G. C. Mylar: a degree-of-interest model for IDEs. Proceedings of AOSD 2005, ACM (2005), 159--168.  ",
      "doi": "10.1145/1052898.1052912"
    },
    {
      "text": "Li, I., Nichols, J., Lau, T., Drews, C., and Cypher, A. Here's what I did: sharing and reusing web activity with Action-Shot. Proceedings of CHI 2010, ACM (2010), 723--732.  ",
      "doi": "10.1145/1753326.1753432"
    },
    {
      "text": "Pirolli, P. Information foraging theory: adaptive interaction with information. Oxford University Press, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "Stylos, J. and Myers, B. A. Mica: A Web-Search Tool for Finding API Components and Examples. Proceedings of VL/HCC 2006, IEEE Computer Society (2006), 195--202.  ",
      "doi": "10.1109/VLHCC.2006.32"
    },
    {
      "text": "Teevan, J., Adar, E., Jones, R., and Potts, M. A. S. Information re-retrieval: repeat queries in Yahoo's logs. Proceedings of SIGIR 2007, ACM (2007), 151--158.  ",
      "doi": "10.1145/1277741.1277770"
    }
  ]
}