{
  "doi": "10.1145/1978942.1979452",
  "title": "Computers can't give credit: how automatic attribution falls short in an online remixing community",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3421-3430",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "In this paper, we explore the role that attribution plays in shaping user reactions to content reuse, or remixing, in a large user-generated content community. We present two studies using data from the Scratch online community - a social media platform where hundreds of thousands of young people share and remix animations and video games. First, we present a quantitative analysis that examines the effects of a technological design intervention introducing automated attribution of remixes on users' reactions to being remixed. We compare this analysis to a parallel examination of \"manual\" credit-giving. Second, we present a qualitative analysis of twelve in-depth, semi-structured, interviews with Scratch participants on the subject of remixing and attribution. Results from both studies suggest that automatic attribution done by technological systems (i.e., the listing of names of contributors) plays a role that is distinct from, and less valuable than, credit which may superficially involve identical information but takes on new meaning when it is given by a human remixer. We discuss the implications of these findings for the designers of online communities and social media platforms.",
  "tags": [
    "credit-giving",
    "remixing",
    "user-generated content",
    "attribution",
    "online communities"
  ],
  "authors": [
    {
      "name": "Andrés Monroy-Hernández",
      "institution": "Microsoft Research & Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/do/10.1145/contrib-81350567841/rel-imgonly/8598964387_bdf95cfca1_z.jpg",
      "acmid": "81350567841",
      "orcid": "0000-0003-4889-9484"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "Massachusetts Institute of Technology, Cambridge, Massachusetts, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    },
    {
      "name": "Jazmin Gonzalez-Rivero",
      "institution": "Microsoft Research, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656143",
      "orcid": "missing"
    },
    {
      "name": "danah boyd",
      "institution": "Microsoft Research, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100111861",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benkler, Y. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press, Oct. 2007. ",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Brown, G. O. Announcing (and explaining) our new 2.0 licenses. http://creativecommons.org/weblog/entry/4216, May 2004.",
      "doi": ""
    },
    {
      "text": "Charmaz, K. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Sage Publications, London, 2006.",
      "doi": ""
    },
    {
      "text": "Cheliotis, G., and Yew, J. An analysis of the social structure of remix culture. In Proc. C&T 2009 (University Park, PA, USA, 2009), ACM, 165--174.  ",
      "doi": "10.1145/1556460.1556485"
    },
    {
      "text": "Diakopoulos, N., Luther, K., Medynskiy, Y. E., and Essa, I. The evolution of authorship in a remix society. In Proc. HT 2007 (Manchester, UK, 2007), ACM, 133--136.  ",
      "doi": "10.1145/1286240.1286272"
    },
    {
      "text": "Donath, J. Signals in social supernets. Journal of Computer-Mediated Communication 13, 1 (2008), 231--251.",
      "doi": ""
    },
    {
      "text": "Friedman, B. Social judgments and technological innovation: Adolescents' understanding of property, privacy, and electronic information. Computers in Human Behavior 13, 3 (Aug. 1997), 327--351.",
      "doi": ""
    },
    {
      "text": "Hill, B. M. H., Monroy-Hernández, A., and Olson, K. Responses to remixing on a social media sharing website. In Proc. ICWSM 2010 (Washington, D.C., 2010), AAAI, 74--81.",
      "doi": ""
    },
    {
      "text": "Ito, M., Okabe, D., and Matsuda, M. Personal, Portable, Pedestrian: Mobile Phones in Japanese Life. The MIT Press, 2006. ",
      "doi": "10.5555/1212318"
    },
    {
      "text": "Jenkins, H. Convergence Culture: Where Old and New Media Collide. New York University Press, New York, 2006.",
      "doi": ""
    },
    {
      "text": "Lessig, L. Code: And Other Laws of Cyberspace, Version 2.0. Basic Books, Dec. 2006.",
      "doi": "10.5555/1201944"
    },
    {
      "text": "Lessig, L. Remix: Making Art and Commerce Thrive in the Hybrid Economy. Penguin Press HC, The, Oct. 2008.",
      "doi": ""
    },
    {
      "text": "Luther, K., Diakopoulos, N., and Bruckman, A. Edits & credits: exploring integration and attribution in online creative collaboration. In Proc. CHI 2010 (Atlanta, Georgia, USA, 2010), ACM, 2823--2832.  ",
      "doi": "10.1145/1753846.1753869"
    },
    {
      "text": "Manovich, L. Remix and remixability. http://www.manovich.net/DOCS/Remix_modular.doc, 2005.",
      "doi": ""
    },
    {
      "text": "Monroy-Hernández, A., and Resnick, M. Empowering kids to create and share programmable media. interactions 15, 2 (2008), 50--53.  ",
      "doi": "10.1145/1340961.1340974"
    },
    {
      "text": "Olson, K. R., and Shaw, A. 'No fair, copycat!': what children\"s response to plagiarism tells us about their understanding of ideas. Developmental Science (2010).",
      "doi": ""
    },
    {
      "text": "Palfrey, J., and Gasser, U. Born Digital: Understanding the First Generation of Digital Natives. Basic Books, Aug. 2008. ",
      "doi": "10.5555/1481066"
    },
    {
      "text": "Perkel, D. Copy and paste literacy: Literacy practices in the production of a MySpace profile. Informal Learning and Digital Media (2006).",
      "doi": ""
    },
    {
      "text": "Pinch, T. J., and Bijker, W. E. The social construction of facts and artefacts: Or how the sociology of science and the sociology of technology might benefit each other. Social Studies of Science 14, 3 (Aug. 1984), 399--441.",
      "doi": ""
    },
    {
      "text": "Posner, R. A. The little book of plagiarism. Pantheon Books, Jan. 2007.",
      "doi": ""
    },
    {
      "text": "Resnick, M., Maloney, J., Monroy-Hernández, A., Rusk, N., Eastmond, E., Brennan, K., Millner, A., Rosenbaum, E., Silver, J., Silverman, B., and Kafai, Y. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Seneviratne, O., Kagal, L., and Berners-Lee, T. Policy-Aware content reuse on the web. In The Semantic Web - ISWC 2009. 2009, 553--568.  ",
      "doi": "10.1007/978-3-642-04930-9_35"
    },
    {
      "text": "Seneviratne, O., and Monroy-Hernández, A. Remix culture on the web: A survey of content reuse on different User-Generated content websites. In Web Science (Raleigh, NC, Apr. 2010).",
      "doi": ""
    },
    {
      "text": "Shaw, R., and Schmitz, P. Community annotation and remix: a research platform and pilot deployment. In Proc. MM 2006 (Santa Barbara, California, USA, 2006), ACM, 89--98.  ",
      "doi": "10.1145/1178745.1178761"
    },
    {
      "text": "Sinnreich, A., Latonero, M., and Gluck, M. Ethics reconfigured. Information, Communication & Society 12, 8 (2009), 1242.",
      "doi": ""
    },
    {
      "text": "Thom-Santelli, J., Cosley, D. R., and Gay, G. What's mine is mine: territoriality in collaborative authoring. In Proc. CHI 2009 (Boston, MA, USA, 2009), ACM, 1481--1484.  ",
      "doi": "10.1145/1518701.1518925"
    }
  ]
}