{
  "doi": "10.1145/1978942.1979407",
  "title": "CommentSpace: structured support for collaborative visual analysis",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3131-3140",
  "year": 2011,
  "badges": [],
  "abstract": "Collaborative visual analysis tools can enhance sensemaking by facilitating social interpretation and parallelization of effort. These systems enable distributed exploration and evidence gathering, allowing many users to pool their effort as they discuss and analyze the data. We explore how adding lightweight tag and link structure to comments can aid this analysis process. We present CommentSpace, a collaborative system in which analysts comment on visualizations and websites and then use tags and links to organize findings and identify others'\" contributions. In a pair of studies comparing CommentSpace to a system without support for tags and links, we find that a small, fixed vocabulary of tags (question, hypothesis, to-do) and links (evidence-for, evidence-against) helps analysts more consistently and accurately classify evidence and establish common ground. We also find that managing and incentivizing participation is important for analysts to progress from exploratory analysis to deeper analytical tasks. Finally, we demonstrate that tags and links can help teams complete evidence gathering and synthesis tasks and that organizing comments using tags and links improves analytic results.",
  "authors": [
    {
      "name": "Wesley Willett",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572817",
      "orcid": "0000-0002-6793-3062"
    },
    {
      "name": "Jeffrey Heer",
      "institution": "Stanford University, Stanford, California, USA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    },
    {
      "name": "Joseph Hellerstein",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/do/10.1145/contrib-81406597364/rel-imgonly/hellerstein.jpg",
      "acmid": "81406597364",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. D. Balakrishnan, S. R. Fussell, and S. Kiesler. Do visualizations improve synchronous remote collaboration? In ACM CHI, pages 1227--\"1236, 2008.  ",
      "doi": "10.1145/1357054.1357246"
    },
    {
      "text": "Y. Benkler. Coase's penguin, or, linux and the nature of the firm. Yale Law Journal, 112:369, 2002.",
      "doi": ""
    },
    {
      "text": "D. Billman, G. Convertino, J. Shrager, P. Pirolli, and J. Massar. Collaborative intelligence analysis with cache and its effects on information gathering and cognitive bias. In HCI Consortium Workshop, 2006.",
      "doi": ""
    },
    {
      "text": "M. Bloch, S. Carter, J. Corum, A. Cox, and M. Ericson. Jacksons billboard rankings over time (interactive graphic). New York Times interactive graphic, June 2009.",
      "doi": ""
    },
    {
      "text": "What's your college degree worth? Bloomberg Businessweek interactive table, June 2010.",
      "doi": ""
    },
    {
      "text": "J.Carroll, M.Rosson, G.Convertino, and C.Ganoe.Awareness and teamwork in computer-supported collaborations. Interacting with Computers, 18(1):21--\"46, 2006.  ",
      "doi": "10.1016/j.intcom.2005.05.005"
    },
    {
      "text": "E. Chi and T. Mytkowicz. Understanding the efficiency of social tagging systems using information theory. In ACM Hypertext, pages 81--\"88, 2008.  ",
      "doi": "10.1145/1379092.1379110"
    },
    {
      "text": "T. Chklovski, V. Ratnakar, and Y. Gil. User interfaces with semi-formal representations: a study of designing argumentation structures. In ACM IUI, pages 130--\"136, 2005.  ",
      "doi": "10.1145/1040830.1040864"
    },
    {
      "text": "H. Clark and S. Brennan. Grounding in communication. Perspectives on socially shared cognition, 13:127--\"149, 1991.",
      "doi": ""
    },
    {
      "text": "Data360. http://data360.org.",
      "doi": ""
    },
    {
      "text": "N. Diakopoulos, S. Goldenberg, and I. Essa. Videolyzer: quality analysis of online informational video for bloggers and journalists. In ACM CHI, pages 799--\"808, 2009.  ",
      "doi": "10.1145/1518701.1518824"
    },
    {
      "text": "P.DourishandV. Bellotti. Awareness and coordination in shared workspaces. In ACM CSCW, page 114, 1992.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "R.Eccles, T.Kapler, R.Harper, and W.Wright. Stories in GeoTime. Information Visualization, 7(1):3--\"17, 2008.  ",
      "doi": "10.1145/1391107.1391109"
    },
    {
      "text": "D.Gergle, R.Kraut, and S.Fussell. Language efficiency and visual technology: Minimizing collaborative effort with visual information. Journal of Language and Social Psychology, 23(4):491, 2004.",
      "doi": ""
    },
    {
      "text": "S.Golder and B.Huberman. Usage patterns of collaborative tagging systems. Journal of Information Science, 32(2):198, 2006.  ",
      "doi": "10.1177/0165551506062337"
    },
    {
      "text": "Google Public Data Explorer.http://www.google.com/publicdata/.",
      "doi": ""
    },
    {
      "text": "T.Gordon and N.Karacapilidis. The Zeno argument at ion framework. In ACM ICIAL, pages 10--\"18, 1997.  ",
      "doi": "10.1145/261618.261622"
    },
    {
      "text": "J.Heer and M.Agrawala. Design considerations for collaborative visual analytics. Information Visualization, 7(1):49--\"62, 2008.  ",
      "doi": "10.1145/1391107.1391112"
    },
    {
      "text": "J.Heer, F.Viegas, and M.Wattenberg. Voyagers and voyeurs: Supporting asynchronous collaborative visualization. Communications of the ACM, 52(1):87--\"97, 2009.  ",
      "doi": "10.1145/1435417.1435439"
    },
    {
      "text": "N.Kong and M.Agrawala. Perceptual interpretation of ink annotations on line charts. In ACM UIST, pages 233--\"236, 2009.  ",
      "doi": "10.1145/1622176.1622219"
    },
    {
      "text": "K.Luther, S.Counts, K.Stecher, A.Hoff, and P.Johns. Pathfinder:an online collaboration environment for citizen scientists. In ACM CHI, pages 239--\"248, 2009.  ",
      "doi": "10.1145/1518701.1518741"
    },
    {
      "text": "M. McKeon. Harnessing the Web Information Ecosystem with Wiki-based Visualization Dashboards. IEEE TVCG, pages 1081--\"1088, 2009.  ",
      "doi": "10.1109/TVCG.2009.148"
    },
    {
      "text": "I.Mistrik, B.P.Springer, S.J.B.Shum, S.J.B.Shum, A.M.Selvin, A. M. Selvin, M. Sierhuis, M. Sierhuis, J. Conklin, J. Conklin, C. B. Haley, C. B. Haley, B. Nuseibeh, and B. Nuseibeh. Hypermedia support for argumentation-based rationale. In 15 Years on from gIBIS and QOC. In: Rationale Management in Software Engineering (Eds, pages 111--\"132. Springer-Verlag: Berlin, 2006.",
      "doi": ""
    },
    {
      "text": "K. Neuendorf. The content analysis guidebook. Sage Publications, Inc, 2002.",
      "doi": ""
    },
    {
      "text": "A. Perer and B. Shneiderman. Systematic yet flexible discovery: guiding domain experts through exploratory data analysis. In ACM IUI, pages 109--\"118, 2008.  ",
      "doi": "10.1145/1378773.1378788"
    },
    {
      "text": "N. J. Pioch and J. O. Everett. Polestar: collaborative knowledge management and sensemaking tools for intelligence analysts. In ACM CIKM, pages 513--\"521, 2006.  ",
      "doi": "10.1145/1183614.1183688"
    },
    {
      "text": "P. Pirolli. Information foraging theory: Adaptive interaction with information. Oxford University Press, USA, 2007. ",
      "doi": "10.5555/1450927"
    },
    {
      "text": "TIBCO Spotfire Decision Site. http://spotfire.tibco.com.",
      "doi": ""
    },
    {
      "text": "TableauServer.http://tableausoftware.com.",
      "doi": ""
    },
    {
      "text": "J. Thomas and K. Cook. Illuminating the path: The research and development agenda for visual analytics. IEEE Computer Society, 2005.",
      "doi": ""
    },
    {
      "text": "F. Vi&amp;#233;gas, M. Wattenberg, M. McKeon, F. Van Ham, and J. Kriss. Harry potter and the meat-filled freezer: A case study of spontaneous usage of visualization tools. In Proc. HICSS, 2008.  ",
      "doi": "10.1109/HICSS.2008.188"
    },
    {
      "text": "F.Vi&amp;#233;gas, M.Wattenberg, F.VanHam, J.Kriss, and M.McKeon. Manyeyes: a site for visualization at internet scale. IEEE TVCG, 13(6):1121--\"1128, 2007.  ",
      "doi": "10.1109/TVCG.2007.70577"
    },
    {
      "text": "M. Wattenberg, F. Vi&amp;#233;gas, and K. Hollenbach. Visualizing activity on wikipedia with chromograms. Human-Computer Interaction--\"INTERACT 2007, pages 272--\"287, 2007. ",
      "doi": "10.5555/1778331.1778361"
    },
    {
      "text": "W. Wright, D. Schroh, P. Proulx, A. Skaburskis, and B. Cort. The Sandbox for analysis: concepts and methods. In ACM CHI, page 810, 2006.  ",
      "doi": "10.1145/1124772.1124890"
    }
  ]
}