{
  "doi": "10.1145/1978942.1979124",
  "title": "The information flaneur: a fresh look at information seeking",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1215-1224",
  "year": 2011,
  "badges": [],
  "abstract": "We introduce the information flaneur as a new human-centred view on information seeking that is grounded in interdisciplinary research. We use the metaphor of the urban flaneur making sense of a city as an inspiring lens that brings together diverse perspectives. These perspectives shift information seeking towards a more optimistic outlook: the information flaneur represents curious, creative, and critical information seeking. The resulting information-seeking model conceptualizes the interrelated nature between information activities and experiences as a continuum between horizontal exploration and vertical immersion. Motivated by enabling technological trends and inspired by the information flaneur, we present explorability as a new guiding principle for design and raise research challenges regarding the representation of information abstractions and details.",
  "authors": [
    {
      "name": "Marian Dörk",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/do/10.1145/contrib-81414607074/rel-imgonly/fhp_2019_portrait_closeup.jpg",
      "acmid": "81414607074",
      "orcid": "missing"
    },
    {
      "name": "Sheelagh Carpendale",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616781",
      "orcid": "missing"
    },
    {
      "name": "Carey Williamson",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/do/10.1145/contrib-81100170611/rel-imgonly/cwilliamson_81100170611.jpg",
      "acmid": "81100170611",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. Agarwal and E. Karahanna. Time flies when you're having fun: Cognitive absorption and beliefs about information technology usage. MIS quarterly, 24(4):665--694, 2000.  ",
      "doi": "10.2307/3250951"
    },
    {
      "text": "C. Ahlberg and B. Shneiderman. Visual information seeking: Tight coupling of dynamic query filters with starfield displays. Proc. of ACM CHI, pp. 313--317, 1994.  ",
      "doi": "10.1145/191666.191775"
    },
    {
      "text": "S. Auer, C. Bizer, G. Kobilarov, J. Lehmann, R. Cyganiak, and Z. Ives. DBpedia: A nucleus for a web of open data. Proc. of International Semantic Web Conference, 2007. ",
      "doi": "10.1007/978-3-540-76298-0_52"
    },
    {
      "text": "M. Bates. The design of browsing and berrypicking techniques for the online search interface. Online Information Review, 13(5):407--424, 1989.",
      "doi": ""
    },
    {
      "text": "N. Belkin, R. Oddy, and H. Brooks. ASK for information retrieval: Part I. background and theory. Journal of Documentation, 38(2):61--71, 1982.",
      "doi": ""
    },
    {
      "text": "W. Benjamin. Charles Baudelaire: A Lyric Poet in the Era of High Capitalism, chapter The Paris of the Second Empire in Baudelaire: II The Fl&amp;#226;neur, pp. 35--66. NLB, 1973.",
      "doi": ""
    },
    {
      "text": "A. Broder, E. Churchill, M. Hearst, B. Pell, P. Raghavan, and A. Tomkins. Search is dead!: long live search (panel). Proc. of WWW Conference, pp. 1337--1338, 2010.  ",
      "doi": "10.1145/1772690.1772917"
    },
    {
      "text": "S. Card, J. Mackinlay, and B. Shneiderman. Using Vision to Think, chapter 1: Information Visualization, pp. 1--34. Morgan Kaufmann, 1999. ",
      "doi": "10.5555/300679.300680"
    },
    {
      "text": "S. Chang and R. Rice. Browsing: A multidimensional framework. Annual review of information science and technology (ARIST), 28:231--76, 1993.",
      "doi": ""
    },
    {
      "text": "E. Chi, P. Pirolli, K. Chen, and J. Pitkow. Using information scent to model user information needs and actions and the web. Proc. of ACM CHI, pp. 490--497, 2001.  ",
      "doi": "10.1145/365024.365325"
    },
    {
      "text": "A. Cooper and R. Reimann. About Face 2.0: The Essentials of Interaction Design. Wiley, 2003. ",
      "doi": "10.5555/862232"
    },
    {
      "text": "J. Cove and B. Walsh. Online text retrieval via browsing. Information Processing &amp;#38; Management, 24(1):31--37, 1988.  ",
      "doi": "10.1016/0306-4573%2888%2990075-1"
    },
    {
      "text": "M. Cs&amp;#237;kszentmih&amp;#225;lyi. Flow: The psychology of optimal experience. Basic Books, 1997.",
      "doi": ""
    },
    {
      "text": "B. Dervin. An overview of sense-making research: Concepts, methods and results to date. International Communication Association annual meeting, 1983.",
      "doi": ""
    },
    {
      "text": "M. D&amp;#246;rk, S. Carpendale, C. Collins, and C. Williamson. VisGets: Coordinated visualizations for web-based information exploration and discovery. IEEE Transactions on Visualization and Computer Graphics (TVCG), 14(6):1205--1212, Nov/Dec 2008.  ",
      "doi": "10.1109/TVCG.2008.175"
    },
    {
      "text": "M. D&amp;#246;rk, D. Gruen, C. Williamson, and S. Carpendale. A visual backchannel for large-scale events. IEEE TVCG, 16(6):1129--1138, Nov/Dec 2010.  ",
      "doi": "10.1109/TVCG.2010.129"
    },
    {
      "text": "J. English, M. Hearst, R. Sinha, K. Swearingen, and K. Yee. Flexible search and navigation using faceted metadata. Proc. of ACM SIGIR Conference, pp. 11--15, 2002.",
      "doi": ""
    },
    {
      "text": "S. Erdelez. Information encountering: It's more than just bumping into information. Bulletin of the American Society for Information Science, 25(3):25--29, 1999.",
      "doi": ""
    },
    {
      "text": "A. Foster. A nonlinear model of information-seeking behavior. Journal of the American Society for Information Science and Technology, 55(3):228--237, 2004.  ",
      "doi": "10.1002/asi.10359"
    },
    {
      "text": "A. Foster and N. Ford. Serendipity and information seeking: An empirical study. Journal of Documentation, 59(3):321--340, May 2003.",
      "doi": ""
    },
    {
      "text": "C. Fulton. The pleasure principle: the power of positive affect in information seeking. Aslib Proceedings: New Information Perspectives, 61(3):245--261, 2009.",
      "doi": ""
    },
    {
      "text": "M. Gluck. The flaneur and the aesthetic: Appropriation of urban culture in mid-19th-century paris. Theory, Culture &amp;#38; Society, 20(5):53--80, 2003.",
      "doi": ""
    },
    {
      "text": "E. Goldman. Search engine bias and the demise of search engine utopianism. Web Search, 14(III):121--133, 2008.",
      "doi": ""
    },
    {
      "text": "S. Greenberg and B. Buxton. Usability evaluation considered harmful (some of the time). Proc. of ACM CHI, pp. 111--120, 2008.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "J. Guthrie and P. Mosenthal. Literacy as multidimensional: Locating information and reading comprehension. Educational Psychologist, 22(3):279--297, 1987.",
      "doi": ""
    },
    {
      "text": "S. Havre, E. Hetzler, P. Whitney, and L. Nowell. ThemeRiver: Visualizing thematic changes in large document collections. IEEE TVCG, 8(1):9--20, 2002.  ",
      "doi": "10.1109/2945.981848"
    },
    {
      "text": "C. Healey, K. Booth, and J. Enns. High-speed visual estimation using preattentive processing. Transactions on Computer-Human Interaction, 3(2):107--135, 1996.  ",
      "doi": "10.1145/230562.230563"
    },
    {
      "text": "M. Hearst. TileBars: Visualization of term distribution information in full text information access. Proc. of ACM CHI, pp. 59--66, 1995.  ",
      "doi": "10.1145/223904.223912"
    },
    {
      "text": "C. Jenks. Visual Culture, chapter 8 Watching Your Step: The history and practice of the fl&amp;#226;neur, pp. 142--160. Routledge, 1995.",
      "doi": ""
    },
    {
      "text": "J. Kari and J. Hartel. Information and higher things in life: Addressing the pleasurable and the profound in information science. Journal of the American Society for Information Science and Technology, 58(8):1131--1147, 2007.  ",
      "doi": "10.5555/1254866.1254872"
    },
    {
      "text": "T. Kashdan, P. Rose, and F. Fincham. Curiosity and exploration: Facilitating positive subjective experiences and personal growth opportunities. Journal of Personality Assessment, 82(3):291--305, 2004.",
      "doi": ""
    },
    {
      "text": "A. Kerne, E. Koh, S. Smith, A. Webb, and B. Dworaczyk. combinformation: Mixed-initiative composition of image and text surrogates promotes information discovery. TOIS: Transactions on Information Systems, 27(1):5:1--5:45, December 2008.  ",
      "doi": "10.1145/1416950.1416955"
    },
    {
      "text": "R. Khare and T. &amp;#199;elik. Microformats: a pragmatic path to the semantic web. Proc. of WWW Conference, pp. 865--866, 2006.  ",
      "doi": "10.1145/1135777.1135917"
    },
    {
      "text": "R. Klein. Inhibition of return. Trends in Cognitive Sciences, 4(4):138--147, 2000.",
      "doi": ""
    },
    {
      "text": "C. Kuhlthau. Inside the search process: Information seeking from the user's perspective. Journal of the American Society for Information Science, 42(5):361--371, 1991.",
      "doi": ""
    },
    {
      "text": "B. Kules, R. Capra, M. Banta, and T. Sierra. What do exploratory searchers look at in a faceted search interface? Proc. of ACM/IEEE Joint Conference on Digital Libraries, pp. 313--322, 2009.  ",
      "doi": "10.1145/1555400.1555452"
    },
    {
      "text": "B. Kwasnik. A descriptive study of the functional components of browsing. Proc. IFIP TC2/WG2.7 Working Conference on Engineering for Human-Computer Interaction, pp. 191--203, 1992. ",
      "doi": "10.5555/647103.717574"
    },
    {
      "text": "L. Leahu, J. Thom-Santelli, C. Pederson, and P. Sengers. Taming the situationist beast. Proc. of ACM Conference on Designing Interactive Systems,pp. 203--211, 2008.  ",
      "doi": "10.1145/1394445.1394467"
    },
    {
      "text": "G. Marchionini. Exploratory search: From finding to understanding. Communications of the ACM, 49(4):41--46, 2006.  ",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "P. McKenzie. A model of information practices in accounts of everyday-life information seeking. Journal of Documentation, 59(1):19--40, 2003.",
      "doi": ""
    },
    {
      "text": "G. Miller. The Study of Information: Interdisciplinary Messages, chapter Informavores, pp. 111--113. Wiley-Interscience, 1983.",
      "doi": ""
    },
    {
      "text": "J. Nielson. Usability Engineering, chapter 2: What is Usability, pp. 23--48. Morgan Kaufmann, 1993.",
      "doi": ""
    },
    {
      "text": "P. Pirolli and S. Card. Information foraging in information access environments. Proc. of ACM CHI, pp. 51--58, 1995.  ",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Z. Pousman, J. Stasko, and M. Mateas. Casual information visualization: Depictions of data in everyday life. IEEE TVCG, 13(6):1145--1152, Nov/Dec 2007.  ",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "D. Rosenberg. Early modern information overload. Journal of the History of Ideas, 64(1):1--9, 2003.",
      "doi": ""
    },
    {
      "text": "C. Ross. Finding without seeking: the information encounter in the context of reading for pleasure. Information Processing &amp;#38; Management, 35(6):783--799, 1999.  ",
      "doi": "10.1016/S0306-4573%2899%2900026-6"
    },
    {
      "text": "D. Russell, M. Stefik, P. Pirolli, and S. Card. The cost structure of sensemaking. Proc. of ACM CHI, pp. 269--276, 1993.  ",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "R. Savolainen. Everyday life information seeking: approaching information seeking in the context of \"way of life\". Library &amp;#38; Information Science Research, 17(3):259--294, 1995.",
      "doi": ""
    },
    {
      "text": "m. c. schraefel. Building knowledge: What's beyond keyword search? Computer, 42(3):52--59, 2009.  ",
      "doi": "10.1109/MC.2009.69"
    },
    {
      "text": "B. Shneiderman. The eyes have it: A task by data type taxonomy for information visualizations. Proc. IEEE Symposium on Visual Languages, pp. 336--343, 1996. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "A. Smith. Mobile access 2010. Technical report, The Pew Research Center, 2010. http://pewinternet.org/Reports/2010/Mobile-Access-2010.aspx.",
      "doi": ""
    },
    {
      "text": "A. Spoerri. InfoCrystal: A visual tool for information retrieval. Proc. IEEE Conference on Visualization, pp. 150--157, 1993. ",
      "doi": "10.5555/949845.949876"
    },
    {
      "text": "J. Teevan, C. Alvarado, M. Ackerman, and D. Karger. The perfect search engine is not enough: a study of orienteering behavior in directed search. Proc. of ACM CHI, pp. 415--422, 2004.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "E. Toms. Understanding and facilitating the browsing of electronic text. International Journal of Human-Computer Studies, 52(3):423--452, 2000.  ",
      "doi": "10.1006/ijhc.1999.0345"
    },
    {
      "text": "E. Toms. Information interaction: Providing a framework for information architecture. Journal of the American Society for Information Science and Technology, 53(10):855--862, 2002.  ",
      "doi": "10.1002/asi.10094"
    },
    {
      "text": "A. Treisman and G. Gelade. A feature-integration theory of attention. Cognitive psychology, 12(1):97--136, 1980.",
      "doi": ""
    },
    {
      "text": "L. Udsen and A. J&amp;#248;rgensen. The aesthetic turn: unravelling recent aesthetic approaches to human-computer interaction. Digital Creativity, 16(4):205--216, 2005.",
      "doi": ""
    },
    {
      "text": "W3C. HTML5: A vocabulary and associated APIs for HTML and XHTML: Editor's Draft 12 January 2011. http://dev.w3.org/html5/spec/Overview.html.",
      "doi": ""
    },
    {
      "text": "Z. Wang and R. Klein. Searching for inhibition of return in visual search: A review. Vision research, 50(2):220--228, 2010.",
      "doi": ""
    },
    {
      "text": "R. White, B. Kules, S. Drucker, and m. c. schraefel. Supporting exploratory search: Introduction. Communications of the ACM, 49(4):36--39, 2006.  ",
      "doi": "10.1145/1121949.1121978"
    },
    {
      "text": "R. White and R. Roth. Exploratory Search: Beyond the Query-Response Paradigm. Number 3 in Synthesis Lectures on Information Concepts, Retrieval, and Services. Morgan &amp;#38; Claypool Publishers. ",
      "doi": "10.5555/1521589"
    },
    {
      "text": "K. Williamson. Discovered by chance: The role of incidental information acquisition in an ecological model of information use. Library &amp;#38; Information Science Research, 20(1):23--40, 1998.",
      "doi": ""
    },
    {
      "text": "T. Wilson. Information behaviour: An interdisciplinary perspective. Information Processing &amp;#38; Management, 33(4):551--572, 1997.  ",
      "doi": "10.1016/S0306-4573%2897%2900028-9"
    },
    {
      "text": "J. Wolfe. Moving towards solutions to some enduring controversies in visual search. Trends in Cognitive Sciences, 7(2):70--76, 2003.",
      "doi": ""
    },
    {
      "text": "D. Woods. Visual momentum: A concept to improve the cognitive coupling of person and computer. International Journal of Man-Machine Studies, 21(3):229--244, 1984.  ",
      "doi": "10.1016/S0020-7373%2884%2980043-7"
    },
    {
      "text": "K. Yee, K. Swearingen, K. Li, and M. Hearst. Faceted metadata for image search and browsing. Proc. of ACM CHI, pp. 401--408, 2003.  ",
      "doi": "10.1145/642611.642681"
    }
  ]
}