{
  "doi": "10.1145/1978942.1979058",
  "title": "Your noise is my command: sensing gestures using the body as an antenna",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "791-800",
  "year": 2011,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Touch sensing and computer vision have made human-computer interaction possible in environments where keyboards, mice, or other handheld implements are not available or desirable. However, the high cost of instrumenting environments limits the ubiquity of these technologies, particularly in home scenarios where cost constraints dominate installation decisions. Fortunately, home environments frequently offer a signal that is unique to locations and objects within the home: electromagnetic noise. In this work, we use the body as a receiving antenna and leverage this noise for gestural interaction. We demonstrate that it is possible to robustly recognize touched locations on an uninstrumented home wall using no specialized sensors. We conduct a series of experiments to explore the capabilities that this new sensing modality may offer. Specifically, we show robust classification of gestures such as the position of discrete touches around light switches, the particular light switch being touched, which appliances are touched, differentiation between hands, as well as continuous proximity of hand to the switch, among others. We close by discussing opportunities, limitations, and future work.",
  "authors": [
    {
      "name": "Gabe Cohn",
      "institution": "Microsoft Research, University of Washington, Seattle, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470655150",
      "orcid": "missing"
    },
    {
      "name": "Daniel Morris",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81405594249/rel-imgonly/dan_bass_brightened.jpg",
      "acmid": "81405594249",
      "orcid": "missing"
    },
    {
      "name": "Shwetak N. Patel",
      "institution": "Microsoft Research, University of Washington, Seattle, Washington, USA",
      "img": "/do/10.1145/contrib-81100490064/rel-imgonly/81100490064.jpg",
      "acmid": "81100490064",
      "orcid": "0000-0002-6300-4389"
    },
    {
      "name": "Desney S. Tan",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chen, W.T. and Chuang, H.R. Numerical Computation of the EM Coupling between a Circular Loop Antenna and a Full-Scale Human-Body Model. IEEE Trans Microwave theory and Techniques, 46.10 (1998).",
      "doi": ""
    },
    {
      "text": "Cho, N., Yan, L., Bae, J., Yoo, H.J. 60 kb/s-10 Mb/s Adaptive Frequency Hopping Transceiver for Interference-Resilient Body Channel Communication. IEEE Jour Solid-State Circuits, 44.3 (2009).",
      "doi": ""
    },
    {
      "text": "Chuang, H.R. and Chen, W.T. Computer Simulation of the Human-Body Effects on a Circular-Loop-Wire Antenna for Radio-Pager Communications at 152, 280, and 400 MHz. IEEE Trans Vehicular Tech, 36.3 (1997).",
      "doi": ""
    },
    {
      "text": "Cohn, G., Stuntebeck, E., Pandey, J., Otis, B., Abowd, G.D., Patel, S.N. SNUPI: Sensor Nodes Utilizing Powerline Infrastructure. Proc ACM Ubicomp 2010.  ",
      "doi": "10.1145/1864349.1864377"
    },
    {
      "text": "Dietz, P. and Leigh, D. DiamondTouch: A Multi-User Touch Technology. Proc ACM UIST 2001.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Fukumoto, M. and Tonomura, Y. Body Coupled FingeRing: Wireless Wearable Keyboard. Proc ACM CHI 1997.  ",
      "doi": "10.1145/258549.258636"
    },
    {
      "text": "Gabriel, S., Lau, R.W., Gabriel, C. The dielectric properties of biological tissues: II. Measurements in the frequency range 10 Hz to 20 GHz. Phys Med Biol, 41 (1996).",
      "doi": ""
    },
    {
      "text": "Gabriel, S., Lau, R.W., Gabriel, C. The dielectric properties of biological tissues: I. Literature Survey. Phys Med Biol 41 (1996).",
      "doi": ""
    },
    {
      "text": "Gupta, S., Reynolds, M.S., Patel, S.N. ElectriSense: Single-Point Sensing Using EMI for Electrical Event Detection and Classification in the Home. Proc ACM Ubicomp 2010.  ",
      "doi": "10.1145/1864349.1864375"
    },
    {
      "text": "Hall, P.S. and Hoa, Y. Antennas and Propagation for Body Centric Communications. Proc Euro Conf on Antennas and Propagation 2006.",
      "doi": ""
    },
    {
      "text": "1Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P., Witten, I.H. The WEKA Data Mining Software: An Update. SIGKDD Explorations, 11.1 (2009).  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Harrison, C., Tan, D. Morris, D. Skinput: Appropriating the Body as an Input Surface. Proc ACM CHI 2010.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Patel, S.N., Truong, K.N., Abowd, G.D. PowerLine Positioning: A Practical Sub-Room-Level Indoor Location System for Domestic Use. Proc ACM Ubicomp 2006.  ",
      "doi": "10.1007/11853565_26"
    },
    {
      "text": "Patel, S.N., Robertson, T., Kientz, J.A., Reynolds, M.S., Abowd, G.D. At the Flick of a Switch: Detecting and Classifying Unique Electrical Events on the Residential Power Line. Proc ACM Ubicomp 2007. ",
      "doi": "10.5555/1771592.1771608"
    },
    {
      "text": "Patel, S.N., Stuntebeck, E.P., Robertson, T. PL-Tags: Detecting Batteryless Tags through the Power lines in a Building. Proc Pervasive 2009.  ",
      "doi": "10.1007/978-3-642-01516-8_18"
    },
    {
      "text": "Saponas, S., Tan, D., Morris, D., Balakrishnan, R., Turner, J., Landay, J. Enabling Always-Available Input with Muscle-Computer Interfaces. Proc ACM UIST 2009.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Shevade, S.K., Keerthi, S.S., Bhattacharyya, C., Murthy, K.R.K. Improvements to the SMO Algorithm for SVM Regression. IEEE Trans Neural Networks, 11.5 (2000).  ",
      "doi": "10.1109/72.870050"
    },
    {
      "text": "Smith, J.R. Field Mice: Extracting hand geometry from electric field measurements. IBM Systems Journal, 35.3 (1996).  ",
      "doi": "10.1147/sj.353.0587"
    },
    {
      "text": "Smola, A.J. and Schoelkopf, B. A tutorial on support vector regression. Statistics and Computing, 14.3 (2004).  ",
      "doi": "10.1023/B%3ASTCO.0000035301.49549.88"
    },
    {
      "text": "Stuntebeck, E.P., Patel, S.N., Robertson, T., Reynolds, M.S., Abowd, G.D. Wideband power line positioning for indoor localization. Proc ACM Ubicomp 2008.  ",
      "doi": "10.1145/1409635.1409649"
    },
    {
      "text": "2Zimmerman, T., Smith, J., Paradiso, J., Allport, D., Gershenfeld, N. Applying Electric Field Sensing to Human-Computer Interfaces. Proc ACM CHI 1995.  ",
      "doi": "10.1145/223904.223940"
    },
    {
      "text": "2Zimmerman, T.G., Personal Area Networks: Nearfield intrabody communication. IBM Systems Journal, 35.3 (1996)..  ",
      "doi": "10.1147/sj.353.0609"
    }
  ]
}