{
  "doi": "10.1145/1978942.1979408",
  "title": "Supporting collaborative help for individualized use",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3141-3150",
  "year": 2011,
  "badges": [],
  "abstract": "In this paper, we seek to advance the research around utilizing collaborative help for supporting individualized use of technologies. We do this by shedding light on the ways that users of MythTV, a highly flexible open-source software system for home entertainment enthusiasts, collaboratively help one another in maintaining their individualized MythTV systems. By analyzing the MythTV user community's mailing list archive, documentation, and wiki, coupled with user interviews we discuss how the community utilizes configuration artifacts as proxies to easily mobilize and exchange knowledge. While exchanging concrete artifacts such as scripts and configuration files was seen to sometimes increase the efficiency of knowledge transfer, it also presented several challenges. Negotiating the transparency of configuration artifacts, navigating the customization and appropriation gulfs, and aligning usage trajectories all emerged as problematic areas. We discuss design implications that address these challenges. Our findings provide a crucial understanding for how to support users in their individualized use of systems.",
  "authors": [
    {
      "name": "Jina Huh",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659418780",
      "orcid": "missing"
    },
    {
      "name": "Mark W. Newman",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594629",
      "orcid": "0000-0001-7186-1383"
    },
    {
      "name": "Mark S. Ackerman",
      "institution": "University of Michigan, Ann Arbor, Michigan, USA",
      "img": "/do/10.1145/contrib-81100017207/rel-imgonly/81100017207.jpg",
      "acmid": "81100017207",
      "orcid": "0000-0001-9727-1664"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. and C. Halverson. Considering an organization's memory. in CSCW. 1998. 39--48.  ",
      "doi": "10.1145/289444.289461"
    },
    {
      "text": "Ackerman, M. and L. Palen, The Zephyr Help Instance as a CSCW Resource, in Resources, Co-Evolution and Artifacts, M. Ackerman, Halverson, C., Erickson, T., &amp;#38; Kellogg, W., Editor. 2007, Springer: New York. p. 37--57.",
      "doi": ""
    },
    {
      "text": "Ackerman, M. S., Augmenting organizational memory. TOIS, 1998. 16(3): p. 203--224.  ",
      "doi": "10.1145/290159.290160"
    },
    {
      "text": "Alavi, M. and D. Leidner, Review: Knowledge management and knowledge management systems. MISQ, 2001. 25(1): p. 107--136.  ",
      "doi": "10.2307/3250961"
    },
    {
      "text": "Balka, E. and I. Wagner. Making things work. in CSCW. 2006. 229--238.  ",
      "doi": "10.1145/1180875.1180912"
    },
    {
      "text": "Brereton, P. and D. Budgen, Component-based systems. IEEE Computer, 2000. 33(11): p. 54--62.  ",
      "doi": "10.1109/2.881695"
    },
    {
      "text": "Carroll, J. and C. Carrithers, Training wheels in a user interface. CACM, 1984. 27(8): p. 800--806.  ",
      "doi": "10.1145/358198.358218"
    },
    {
      "text": "Fischer, G., A. C. Lemke, T. Mastaglio, and A. I. Morch, The role of critiquing in cooperative problem solving. TOIS, 1991. 9(2): p. 123--151.  ",
      "doi": "10.1145/123078.128727"
    },
    {
      "text": "Halverson, C., T. Erickson, and M. Ackerman. Behind the help desk. in CSCW. 2004. 304--313.  ",
      "doi": "10.1145/1031607.1031657"
    },
    {
      "text": "Kahler, H., Supporting collaborative tailoring, 2001, Roskilde University, Denmark.",
      "doi": ""
    },
    {
      "text": "Kiesler, S., B. Zdaniuk, V. Lundmark, and R. Kraut, Troubles with the internet. HCI, 2000 15(4): p. 323--351.  ",
      "doi": "10.1207/S15327051HCI1504_2"
    },
    {
      "text": "Koch, M. and G. Teege. Support for tailoring CSCW systems. in CSCW. 1999. 146--152.",
      "doi": ""
    },
    {
      "text": "MacLean, A., K. Carter, L. L&amp;#246;vstrand, and T. Moran. User-tailorable systems. in CHI. 1990. 175--182.  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "M&amp;#248;rch, A. and N. Mehandjiev, Tailoring as collaboration. JCSCW, 2000. 9(1): p. 75--100.  ",
      "doi": "10.1023/A%3A1008713826637"
    },
    {
      "text": "M&amp;#248;rch, A., G. Stevens, M. Won, M. Klann, Y. Dittrich, and V. Wulf, Component-based technologies for end-user development. CACM, 2004. 47(9): p. 59--62.  ",
      "doi": "10.1145/1015864.1015890"
    },
    {
      "text": "Nardi, B. A. and J. R. Miller, An ethnographic study of distributed problem solving in spreadsheet development, in CSCW. 1990, p. 197--208.  ",
      "doi": "10.1145/99332.99355"
    },
    {
      "text": "Page, S. R., T. J. Johnsgard, C. Uhl Albert, and D. Allen. User customization of a word processor. in CHI. 1996. 340--346.  ",
      "doi": "10.1145/238386.238541"
    },
    {
      "text": "Poole, E. S., Chetty, M., Morgan, T., Grinter, R. E., and Edwards, W. K. Computer help at home. in CHI. 2009. 739--748.  ",
      "doi": "10.1145/1518701.1518816"
    },
    {
      "text": "Poulin, J., J. Caruso, and D. Hancock, The business case for software reuse. IBM SJ, 1993. 32(4): p. 567--594.  ",
      "doi": "10.1147/sj.324.0567"
    },
    {
      "text": "Rodden, T., A. Crabtree, T. Hemmings, B. Koleva, J. Humble, Kettle, P., Kesson, P, and R. Hansson, Between the dazzle of a new building and its eventual corpse, in DIS. 2004, p. 71--80.  ",
      "doi": "10.1145/1013115.1013127"
    },
    {
      "text": "Roth, C. Viable wikis. in Wikis. 2007. 119--124.  ",
      "doi": "10.1145/1296951.1296964"
    },
    {
      "text": "Singh, V. and M. Twidale. The confusion of crowds: non-dyadic help interactions. in CSCW. 2008. 699--702.  ",
      "doi": "10.1145/1460563.1460670"
    },
    {
      "text": "Singh, V., M. Twidale, and D. Nichols. Users of OSS - How Do They Get Help? in HICSS. 2009. 1--10.",
      "doi": ""
    },
    {
      "text": "Stevens, G., Understanding and Designing Appropriation Infrastructures. 2009, University of Siegen.",
      "doi": ""
    },
    {
      "text": "Stevens, G. and S. Draxler. Appropriation of the Eclipse Ecosystem. in COOP. 2010. 287--308. Springer.",
      "doi": ""
    },
    {
      "text": "Strauss, A., Continual permutations of action. 1993: Aldine de gruyter.",
      "doi": ""
    },
    {
      "text": "Torrey, C., McDonald, D. W., Schilit, B. N. and Bly, S. How-To Pages. in ECSCW. 2007. 391--410.",
      "doi": ""
    },
    {
      "text": "Trigg, R. H. and S. B&amp;#248;dker. From implementation to design. in CSCW. 1994. 45--54.  ",
      "doi": "10.1145/192844.192869"
    },
    {
      "text": "Wulf, V. \"Let's see your search-tool!\" - collaborative use of tailored artifacts in groupware. in GROUP. 1999. 50--60.  ",
      "doi": "10.1145/320297.320303"
    },
    {
      "text": "Wulf, V., V. Pipek, and M. Won, Component-based tailorability: Enabling highly flexible software applications. IJHCS, 2008. 66(1): p. 1--22.  ",
      "doi": "10.1016/j.ijhcs.2007.08.007"
    }
  ]
}