{
  "doi": "10.1145/1978942.1979088",
  "title": "Using predictive human performance models to inspire and support UI design recommendations",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "983-986",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Predictive human performance modeling has traditionally been used to make quantitative comparisons between alternative designs (e.g., task execution time for skilled users) instead of identifying UI problems or making design recommendations. This note investigates how reliably novice modelers can extract design recommendations from their models. Many HCI evaluation methods have been plagued by the \"evaluator effect\" [3], i.e., different people using the same method find different UI problems. Our data and analyses show that predictive human performance modeling is no exception. Novice modelers using CogTool [5] display a 34% Any-Two Agreement in their design recommendations, a result in the upper quartile of evaluator effect studies. However, because these recommendations are grounded in models, they may have more reliable impact on measurable performance than recommendations arising from less formal methods.",
  "authors": [
    {
      "name": "Bonnie E. John",
      "institution": "IBM T. J. Watson Research Center & Carnegie Mellon University, Hawthorne, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brinck, T., Gergle, D., and Wood, S. D. (2002) Designing Websites that Work: Usability for the Web. Morgan Kaufman Publishers, San Francisco, CA. ",
      "doi": "10.5555/384232"
    },
    {
      "text": "Card, S. K., Moran, T. P. and Newell, A. (1983) The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Hertzum, M. and Jacobsen, N. E. (2001), The evaluator effect: A chilling fact about usability evaluation methods, International Journal of Human-Computer Interaction, 13(4), 421--443.",
      "doi": ""
    },
    {
      "text": "John, B. E., (2010) Reducing the variability between novice modelers: Results of a tool for human performance modeling produced through human-centered design. Proceedings of the 19th Annual Conference on Behavior Representation in Modeling and Simulation (BRIMS) (Charleston, SC, March 22-25, 2010).",
      "doi": ""
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D. D., Koedinger, K. (2004) Predictive human performance modeling made easy. Proceedings of CHI 2004 (Vienna, Austria, April 2004) ACM, NY. 455--462.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "Luo, L. &amp;#38; John, B. E. (2005) Predicting task execution time on handheld devices using the Keystroke-Level Model. Extended Abstracts of CHI 2005 (Portland, Oregon, April 2-7, 2005) ACM, NY, 1605--1608.  ",
      "doi": "10.1145/1056808.1056977"
    },
    {
      "text": "Teo, L. &amp;#38; John, B. E. (2008) Towards Predicting User Interaction with CogTool-Explorer. Proceedings of the Human Factors and Ergonomics Society 52nd Annual Meeting (NYC, NY, Sept 22-26, 2008).",
      "doi": ""
    }
  ]
}