{
  "doi": "10.1145/1978942.1979111",
  "title": "MonoTrans2: a new human computation system to support monolingual translation",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1133-1136",
  "year": 2011,
  "badges": [],
  "abstract": "In this paper, we present MonoTrans2, a new user interface to support monolingual translation; that is, translation by people who speak only the source or target language, but not both. Compared to previous systems, MonoTrans2 supports multiple edits in parallel, and shorter tasks with less translation context. In an experiment translating children's books, we show that MonoTrans2 is able to substantially close the gap between machine translation and human bilingual translations. The percentage of sentences rated 5 out of 5 for fluency and adequacy by both bilingual evaluators in our study increased from 10% for Google Translate output to 68% for MonoTrans2.",
  "tags": [
    "crowd-sourcing",
    "translation interface",
    "wisdom of crowds",
    "monolingual",
    "translation",
    "distributed human computation",
    "human computation",
    "machine translation"
  ],
  "authors": [
    {
      "name": "Chang Hu",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567642",
      "orcid": "missing"
    },
    {
      "name": "Benjamin B. Bederson",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/do/10.1145/contrib-81100083927/rel-imgonly/bederson.jpg",
      "acmid": "81100083927",
      "orcid": "missing"
    },
    {
      "name": "Philip Resnik",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329491476",
      "orcid": "missing"
    },
    {
      "name": "Yakov Kronrod",
      "institution": "University of Maryland, College Park, Maryland, USA",
      "img": "/do/10.1145/contrib-81472655190/rel-imgonly/cherrry_blossoms_square.jpg",
      "acmid": "81472655190",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dabbadie, M., Hartley, A., King, M., et al. A hands-on study of the reliability and coherence of evaluation metrics. Workshop at the LREC 2002 Conference, Citeseer (2002), 8.",
      "doi": ""
    },
    {
      "text": "Hu, C., Bederson, B. B., and Resnik, P. Translation by iterative collaboration between monolingual users. Proceedings of Graphics Interface 2010 on Proceedings of Graphics Interface 2010, Canadian Information Processing Society (2010), 39--46. ",
      "doi": "10.5555/1839214.1839223"
    },
    {
      "text": "Morita, D. and Ishida, T. Designing Protocols for Collaborative Translation. In Principles of Practice in Multi-Agent Systems. 2009, 17--32.  ",
      "doi": "10.1007/978-3-642-11161-7_2"
    },
    {
      "text": "Quinn, A. J. and Bederson, B. B. Human Computation: A Survey and Taxonomy of a Growing Field. In Proceedings of SIGCHI 2011, in press.  ",
      "doi": "10.1145/1978942.1979148"
    }
  ]
}