{
  "doi": "10.1145/1978942.1979370",
  "title": "Reuse in the wild: an empirical and ethnographic study of organizational content reuse",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2877-2886",
  "year": 2011,
  "badges": [],
  "abstract": "We present a large-scale study of content reuse networks in a large and highly hierarchical organization. In our study, we combine analysis of a collection of presentations produced by employees with interviews conducted throughout the organization and a survey to study presentation content reuse. Study results show a variety of information needs and behaviors related to content reuse as well as a need for a personalized and socially-integrated networking tool for enabling easy access to previously generated presentation material. In this paper we describe our findings and outline a set of requirements for an effective content reuse facility.",
  "authors": [
    {
      "name": "Yelena Mejova",
      "institution": "University of Iowa, Iowa City, Iowa, USA",
      "img": "/do/10.1145/contrib-81438596595/rel-imgonly/by_black_wall_1square.jpg",
      "acmid": "81438596595",
      "orcid": "missing"
    },
    {
      "name": "Klaar De Schepper",
      "institution": "Columbia University, New York, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484641679",
      "orcid": "missing"
    },
    {
      "name": "Lawrence Bergman",
      "institution": "IBM T.J. Watson Research Center, Hawthorne, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100245096",
      "orcid": "missing"
    },
    {
      "name": "Jie Lu",
      "institution": "IBM T.J. Watson Research Center, Hawthorne, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545981856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Parker, I. Absolute PowerPoint: Can a Software Package Edit our Thoughts? The New Yorker, May 28, 2001.",
      "doi": ""
    },
    {
      "text": "Muller, M., Millen, D. R., and Feinberg, J. Information curators in an enterprise file-sharing service. ECSCW 2009.",
      "doi": ""
    },
    {
      "text": "Jensen, C., Lonsdale, H., Wynn, E., Cao, J., Slater, M., Dietterich, T. G. The Life and Times of Files and Information: A Study of Desktop Provenance. CHI 2010.  ",
      "doi": "10.1145/1753326.1753439"
    },
    {
      "text": "Drucker, S. M., Petshnigg, G., Agrawala, M. Comparing and Managing Multiple Versions of Slide Presentations. UIST 2006.  ",
      "doi": "10.1145/1166253.1166263"
    },
    {
      "text": "S. Brin, J. Davis, H. Garcia-Molina. Copy detection mechanisms for digital documents. SIGMOD 1995.  ",
      "doi": "10.1145/568271.223855"
    },
    {
      "text": "Monge, A. E. Matching Algorithms within a Duplicate Detection System. Bulletin of the Technical Committee on Data Engineering 23, 4. 2000.",
      "doi": ""
    },
    {
      "text": "Yang, H., Callan, J. Near-Duplicate Detection for eRulemaking. Conf on Digital Government Research 89: 78--86, 2005. ",
      "doi": "10.5555/1065226.1065247"
    },
    {
      "text": "Schleimer, S., Wilkerson, D. S., Aiken, A. Winnowing: Local Algorithms for Document Fingerprinting. SIGMOD 2003.  ",
      "doi": "10.1145/872757.872770"
    },
    {
      "text": "Chen, X., Francia, B., Li, M., Mckinnon, B. Shared Information and Program Plagiarism Detection. IEEE Transactions on Information Theory, 50 (7): 1545--1551, 2004.  ",
      "doi": "10.1109/TIT.2004.830793"
    },
    {
      "text": "Cilibrasi, R., and Vitanyi, P. Clustering by compression. IEEE Transactions on Information Theory, 51(4), 1523--1545, 2005.  ",
      "doi": "10.1109/TIT.2005.844059"
    },
    {
      "text": "Broder, A. Z. On the resemblance and containment of documents. Proc. of Compression and Complexity of Sequences, 1997. ",
      "doi": "10.5555/829502.830043"
    },
    {
      "text": "Manber, U. Finding Similar Files in a Large File System. USENIX 1994. ",
      "doi": "10.5555/1267074.1267076"
    },
    {
      "text": "Gionis, A., Indyk, P., Motwani, R. Similarity Search in High Dimensions via Hashing. VLDB 1999. ",
      "doi": "10.5555/645925.671516"
    },
    {
      "text": "Hirschberg, D. S. 1975. A linear space algorithm for computing maximal common subsequences. Comm. of the ACM. 18, 6: 341--343.  ",
      "doi": "10.1145/360825.360861"
    },
    {
      "text": "Levenshtein, V. I. 1966. Binary codes capable of correcting deletions, insertions and reversals. Soviet Physics Doklady.",
      "doi": ""
    },
    {
      "text": "Stang, D., Soule, S. A. Diffusion in Organizations and Social Movements: From Hybrid Corn to Poison Pills. Annual Review of Sociology, 24: 265--290, 1998.",
      "doi": ""
    },
    {
      "text": "Rogers, E. M. Diffusion of Innovations. New York: The Free Press. 1995.",
      "doi": ""
    },
    {
      "text": "Jaccard, P. Distribution de la flore alpine dans le bassin des Dranses et dans quelques r&amp;#233;gions voisines. Bulletin de la Soci&amp;#233;t&amp;#233; Vaudoise des Sciences Naturelles 37: 241--272. 1901.",
      "doi": ""
    },
    {
      "text": "Wen, Z., Lin, C. On the Quality of Inferring Interests From Social Neighbors. KDD 2010.  ",
      "doi": "10.1145/1835804.1835853"
    },
    {
      "text": "Ronen, I., Shahar, E., Ur, S., Uziel, E., Yogev, S., Zwerdling, N., Carmel, D., Guy, I., Har'El, N., Ofek-Koifman, S. Social Networks and Discovery in the Enterprise (SaND). SIGIR 2009.  ",
      "doi": "10.1145/1571941.1572156"
    },
    {
      "text": "Watts, D., Strogatz, S. Collective dynamics of 'small-world' networks, Nature, vol. 393, no. 6684, pp. 440--442, 1998.",
      "doi": ""
    },
    {
      "text": "Kaiser, M. Mean clustering coefficients: the role of isolated nodes and leafs on clustering measures for small-world networks. New J. Phys. 2008.",
      "doi": ""
    },
    {
      "text": "Krebs, V., Holley, J. Building smart communities through network weaving. Appalachian Cntr for Econ Networks, 2006.",
      "doi": ""
    }
  ]
}