{
  "doi": "10.1145/1978942.1979334",
  "title": "Which version is this?: improving the desktop experience within a copy-aware computing ecosystem",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2669-2678",
  "year": 2011,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Computers today make it easy for people to scatter copies and versions of digital items across their file systems, but do little to help people manage the resulting mess. In this paper, we introduce the concept of a copy-aware computing ecosystem, inspired by a vision of computing when systems track and surface copy relationships between files. Based on two deployments of a copy-aware software prototype and in-depth interviews with individuals in collaborative relationships, we present our findings on the origins of copies and the barriers to eliminating them, but offer a promising solution based on the set of files that together represent a user's conceptual view of a document - the versionset. We show that the versionset is viable to infer, and we draw upon user activity logs and feedback on personalized views of versionsets to distill guidelines for the factors that define a versionset. We conclude by enumerating the many PIM user experiences that could be transformed as a result.",
  "tags": [
    "versioning",
    "PIM",
    "copy-aware computing",
    "file management"
  ],
  "authors": [
    {
      "name": "Amy K. Karlson",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100168208",
      "orcid": "0000-0001-8934-7761"
    },
    {
      "name": "Greg Smith",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351602807",
      "orcid": "missing"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, Washington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    }
  ],
  "references": [
    {
      "text": "Agrawal, N., Bolosky, W.J., Douceur, J.R. and Lorch, J.R. A five-year study of file-system metadata. ACM Trans. Storage 3, 3 (2007), 9:1--9:32.  ",
      "doi": "10.1145/1288783.1288788"
    },
    {
      "text": "Bardram, J., Bunde-Pedersen, J. and Soegaard, M. Support for activity-based computing in a personal computing operating system. Proc. CHI '06, ACM Press (2006), 211--220.  ",
      "doi": "10.1145/1124772.1124805"
    },
    {
      "text": "Barreau, D. and Nardi, B.A. 1995. Finding and reminding: file organization from the desktop. ACM SIGCHI Bull. 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R. and Nachmias, R. The user-subjective approach to personal information management. JASIST 54, 9 (2008). 872--878.  ",
      "doi": "10.1002/asi.10283"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R., Nachmias, R., Gradovitch, N. and Whittaker, S. Improved search engines and navigation preference in personal information management. ACM Trans. Inf. Syst. 26, 4 (2008), 1--24.  ",
      "doi": "10.1145/1402256.1402259"
    },
    {
      "text": "Bergman, O., Tucker, S., Beyth-Marom, R., Cutrell, E. and Whittaker, S. It's not that important: demoting personal information of low subjective importance using GrayArea. Proc. CHI 2009, ACM Press (2009), 269--278.  ",
      "doi": "10.1145/1518701.1518745"
    },
    {
      "text": "Boardman, R. and Sasse, M.A. 'SStuff goes into the computer and doesn't come out'?: a cross-tool study of personal information management. Proc. CHI '04, ACM Press (2004), 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Bolosky, W.J., Corbin, S., Goebel, D. and John, R.D. Single Instance Storage in Windows 2000, Proc. USENIX '00, USENIX Association (2000), 2--2. ",
      "doi": "10.5555/1267102.1267104"
    },
    {
      "text": "Bondarenko, O. and Janssen, R. Documents at Hand: Learning from Paper to Improve Digital Technologies. Proc. CHI '05, ACM Press (2005), 121--130.  ",
      "doi": "10.1145/1054972.1054990"
    },
    {
      "text": "Broder, A.Z., Glassman, S.C., Manasse, M.S. and Zweig, G. Syntactic clustering of the Web. Compt. Networks ISDN 29, 8--13 (1997), 1157--1166.  ",
      "doi": "10.1016/S0169-7552%2897%2900031-7"
    },
    {
      "text": "Chau, D., Myers, B. and Faulring, A. What to do when search fails: finding information by association. Proc. CHI '08, ACM Press (2008), 999--1008.  ",
      "doi": "10.1145/1357054.1357208"
    },
    {
      "text": "Cutrell, E., Robbins, D.C., Dumais, S.T. and Sarin, R. Fast, Flexible Filtering with Phlat-Personal Search and Organization Made Easy. Proc. of CHI '06, ACM Press (2006), 261--270.  ",
      "doi": "10.1145/1124772.1124812"
    },
    {
      "text": "Doctorow, C. Copy killers. The Guardian. July 31 2007. Accessed from http://www.guardian.co.uk/technology/2007/jul/31/comment.drm, September 23, 2010.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Edwards, W.K., LaMarca, A. and Salisbury, M. Presto: an experimental architecture for fluid interactive document spaces. ACM TOCHI 6, 2 (1999), 133--161.  ",
      "doi": "10.1145/319091.319099"
    },
    {
      "text": "Gyllstrom, K. and Soules, C. Seeing is retrieving: building information context from what the user sees. Proc. IUI '08, ACM Press (2008), 189--198.  ",
      "doi": "10.1145/1378773.1378798"
    },
    {
      "text": "Henderson, S. Personal document management strategies. Proc. CHINZ 2009, ACM Press (2009), 69--76.  ",
      "doi": "10.1145/1577782.1577795"
    },
    {
      "text": "Jensen, C., Lonsdale, H., Wynn, E., Cao, J., Slater, M. and Dietterich, T.G. The life and times of files and information: a study of desktop provenance. Proc. CHI '10, ACM Press (2010), 767--776.  ",
      "doi": "10.1145/1753326.1753439"
    },
    {
      "text": "Jones. W. Finders, keepers? The present and future perfect in support of personal information management, First Monday 9, 3 (2004).",
      "doi": ""
    },
    {
      "text": "Jones, W., Phuwanartnurak, A.J., Gill, R. and Bruce, H. Don't take my folders away!: organizing personal infor-mation to get things done. Ext. Abstracts CHI 2005, ACM Press (2005), 1505--1508.  ",
      "doi": "10.1145/1056808.1056952"
    },
    {
      "text": "Kaye, J., Vertesi, J., Avery, S., Dafoe, A., David, S., Onaga, L., Rosero, I. and Pinch, T. To have and to hold: exploring the personal archive. Proc. CHI 2006, ACM Press (2006), 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "Neisser, U. Visual search. Scientific American 210, 6 (1964). 94--102.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A. and Sumari, L. Mobile kits and laptop trays: managing multiple devices in mobile information work. Proc. CHI '07, ACM Press (2007), 1127--1136.  ",
      "doi": "10.1145/1240624.1240795"
    },
    {
      "text": "Rattenbury, T. and Canny, J. CAAD: an automatic task support system. Proc. CHI '07, ACM (2007), 687--696.  ",
      "doi": "10.1145/1240624.1240731"
    },
    {
      "text": "Ravasio, P., Schar, S.G. and Krueger, H. In pursuit of desktop evolution: User problems and practices with modern desktop systems. ACM TOCHI 11, 2 (2004), 156--180.  ",
      "doi": "10.1145/1005361.1005363"
    },
    {
      "text": "Shah, S., Soules, C.A., Ganger, G.R. and Noble, B.D. Using provenance to aid in personal file search. Proc. USENIX '07, (2007), 1--14. ",
      "doi": "10.5555/1364385.1364398"
    },
    {
      "text": "Shen, J., Irvine, J., Bao, X., Goodman, M., Kolibaba, S., Tran, A., Carl, F., Kirschner, B., Stumpf, S. and Dietterich, T.G. Detecting and correcting user activity switches: algorithms and interfaces. Proc. IUI '09, ACM Press (2009), 117--126.  ",
      "doi": "10.1145/1502650.1502670"
    },
    {
      "text": "Tang, J. C., Drews, C., Smith, M., Wu, F., Sue, A. and Lau, T. Exploring patterns of social commonality among file directories at work. Proc. CHI '07, ACM (2007), 951--960.  ",
      "doi": "10.1145/1240624.1240769"
    },
    {
      "text": "Teevan, J., Alvarado, C., Ackerman, M.S. and Karger, D.R. The perfect search engine is not enough: a study of orienteering behavior in directed search. Proc. CHI '04, ACM Press (2004), 415--422.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "Voida, S. and Mynatt, E.D. It feels better than filing: everyday work experiences in an activity-based computing system. Proc. CHI '09, ACM Press (2009), 221--230.  ",
      "doi": "10.1145/1518701.1518744"
    }
  ]
}