{
  "doi": "10.1145/1978942.1979160",
  "title": "Freed: a system for creating multiple views of a digital collection during the design process",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1481-1490",
  "year": 2011,
  "badges": [],
  "abstract": "In this paper Freed is presented, a system that enables design students to spatially organize their digital collection, define relations between collection content and reflect on it. The system features a force-based layout that allows to explore spatial organizations, and hence to gain new insights. Its main advantage over existing software, is that it empowers the students to create different views of their digital collection. A view is a spatial organization of a selection of the collection content and its relations. It can e.g. be used for a specific design activity or project phase, for organizing work around a specific topic, or for explaining the perspective of a given student or stakeholder. Feedback of design students working with Freed during their design projects, and results from a workshop as measured by a questionnaire, show positive prospects for adoption of the system during the design process.",
  "tags": [
    "design process",
    "multiple views",
    "force-based layout",
    "reflection",
    "digital collection"
  ],
  "authors": [
    {
      "name": "Philip Mendels",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385598181",
      "orcid": "missing"
    },
    {
      "name": "Joep Frens",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320278",
      "orcid": "missing"
    },
    {
      "name": "Kees Overbeeke",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452609633",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Schön, D. A. The Reflective Practitioner. Basic Books, 1982.",
      "doi": ""
    },
    {
      "text": "Simon, H. A. The Sciences of the Artificial. MIT Press, Cambridge MA, 1969.",
      "doi": "10.5555/237774"
    },
    {
      "text": "Hummels, C. and Frens, J. The reflective transformative design process. Ext. abstracts CHI 2009. ACM press (2009), 2655--2658.  ",
      "doi": "10.1145/1520340.1520376"
    },
    {
      "text": "Hummels, C. and Frens, J. Designing for the unknown: A design process for the future generation of highly interactive systems and products. In Proc. EPDE 2008, 204--209.",
      "doi": ""
    },
    {
      "text": "Keller, I. For Inspiration Only. Doctoral Dissertation. Delft University of Technology, the Netherlands.",
      "doi": ""
    },
    {
      "text": "Martens, J., Parthesius, F., Atasoy, B. Design TeamMate: a platform to support design activities of small teams. In Proc. AVI 2010. ACM(2010), 119--126.  ",
      "doi": "10.1145/1842993.1843015"
    },
    {
      "text": "Sharmin, M., Bailey, B. P., Coats, C., Hamilton, K. Understanding knowledge management practices for early design activity and its implications for reuse. In Proc. CHI 2009, ACM press (2010).  ",
      "doi": "10.1145/1518701.1519064"
    },
    {
      "text": "Swan, L., Tanase, D., Taylor, A. S. Design's processional character. In Proc. DIS 2010, ACM press (2010), 65--74.  ",
      "doi": "10.1145/1858171.1858186"
    },
    {
      "text": "Ben Shneiderman. Creating creativity: user interfaces for supporting innovation. ACM Trans. Comput.-Hum. Interact. 7, 1 (2000), 114--138.  ",
      "doi": "10.1145/344949.345077"
    },
    {
      "text": "http://prezi.com/. Accessed September 2010.",
      "doi": ""
    },
    {
      "text": "Kumar A., Saigal R. Visual understanding environment. In proc. JCDL 2005. ACM Press (2005), 413.  ",
      "doi": "10.1145/1065385.1065517"
    },
    {
      "text": "Heer, J., Boyd, D. Vizster: Visualizing Online Social Networks, Proc. IEEE Symposium on Information Visualization, IEEE Press (2005), 33--40.  ",
      "doi": "10.1109/INFOVIS.2005.39"
    },
    {
      "text": "Pasman, G., Stappers, P. J. ProductWorld, an Interactive Environment for Classifying and Retrieving Product Samples. In Proc. 5th Asian Design Conference.",
      "doi": ""
    },
    {
      "text": "Roberts, J. C. State of the Art: Coordinated & Multiple Views in Exploratory Visualization. In Proc. CMV 2007, 61--71.  ",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "Buckingham Shum, S. J., Selvin, A. M., Sierhuis, M., Conklin, J., Haley, C. B., and Nuseibeh, B. Hypermedia Support for Argumentation-Based Rationale: 15 Years on from gIBIS and QOC. In Rationale Management in Software Engineering. Springer-Verlag (2006), 111--132.",
      "doi": ""
    },
    {
      "text": "Reas, C., Fry, B. Processing: a learning environment for creating interactive Web graphics. In Proc. SIGGRAPH 2003, ACM press (2003).  ",
      "doi": "10.1145/965333.965356"
    }
  ]
}