{
  "doi": "10.1145/1978942.1979104",
  "title": "Fragile online relationship: a first look at unfollow dynamics in twitter",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1091-1100",
  "year": 2011,
  "badges": [],
  "abstract": "We analyze the dynamics of the behavior known as 'unfollow' in Twitter. We collected daily snapshots of the online relationships of 1.2 million Korean-speaking users for 51 days as well as all of their tweets. We found that Twitter users frequently unfollow. We then discover the major factors, including the reciprocity of the relationships, the duration of a relationship, the followees' informativeness, and the overlap of the relationships, which affect the decision to unfollow. We conduct interview with 22 Korean respondents to supplement the quantitative results. They unfollowed those who left many tweets within a short time, created tweets about uninteresting topics, or tweeted about the mundane details of their lives. To the best of our knowledge, this work is the first systematic study of the unfollow behavior in Twitter.",
  "authors": [
    {
      "name": "Haewoon Kwak",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-81452618313/rel-imgonly/haewoon_kwak_informal.jpg",
      "acmid": "81452618313",
      "orcid": "missing"
    },
    {
      "name": "Hyunwoo Chun",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381596802",
      "orcid": "missing"
    },
    {
      "name": "Sue Moon",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339518248",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Foursquare. http://foursquare.com.",
      "doi": ""
    },
    {
      "text": "Foursquare logs in Twitter. http://twitter.com/#search?q=4sq.com.",
      "doi": ""
    },
    {
      "text": "A.-L. Barabási and R. Albert. Emergence of scaling in random networks. Science, 286(5439):509--512, 1999.",
      "doi": ""
    },
    {
      "text": "M. Baum and A. Jamison. The Oprah effect: How soft news helps inattentive citizens vote consistently. The Journal of Politics, 68(4):946--959, 2006.",
      "doi": ""
    },
    {
      "text": "H. R. Bernard, P. Killworth, D. Kronenfeld, and L. Sailer. The problem of informant accuracy: The validity of retrospective data. Ann. Rev. Anthropol., 13:495--517, 1984.",
      "doi": ""
    },
    {
      "text": "R. B. Cairns and B. D. Cairns. Lifelines and Risks: Pathways of Youth in Our Time. Cambridge, 1995.",
      "doi": ""
    },
    {
      "text": "H. Chun, H. Kwak, Y.-H. Eom, Y.-Y. Ahn, S. Moon, and H. Jeong. Comparison of online social relations in volume vs. interaction: A case study of Cyworld. In Proc. IMC, pages 57--70, 2008.  ",
      "doi": "10.1145/1452520.1452528"
    },
    {
      "text": "Economist.com. Primates on Facebook: Even online, the neocortex is the limit, http://goo.gl/IxEsq. The Economist, Feb 2009.",
      "doi": ""
    },
    {
      "text": "N. B. Ellison, C. Steinfield, and C. Lampe. The benefits of Facebook friends: social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication, 12(4):1143--1168, 2007.",
      "doi": ""
    },
    {
      "text": "Y.-H. Eom, C. Jeon, H. Jeong, and B. Kahng. Evolution of weighted scale-free networks in empirical data. Phys. Rev. E, 77(5):056105, 2008.",
      "doi": ""
    },
    {
      "text": "S. A. Golder and S. Yardi. Structural predictors of tie formation in Twitter: Transitivity and mutuality. Proc. SOcialCom, pages 88--95, 2010.  ",
      "doi": "10.1109/SocialCom.2010.22"
    },
    {
      "text": "M. T. Hallinan and R. A. Williams. The stability of students' interraicial friendships. American Sociological Review, 52(5):653--664, 1987.",
      "doi": ""
    },
    {
      "text": "B. Huberman, D. M. Romero, and F. Wu. Social networks that matter: Twitter under the microscope. First Monday, 14(1--5), 2009.",
      "doi": ""
    },
    {
      "text": "A. Java, X. Song, T. Finin, and B. Tseng. Why we twitter: understanding microblogging usage and communities. In Proc. KDD/SNA, pages 56--65, 2007.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "D. B. Kandel. Homophily, selection, and socialization in adolescent friendships. American Journal of Sociology, 84(2):427--436, 1978.",
      "doi": ""
    },
    {
      "text": "G. Kossinets and D. J. Watts. Origins of homophily in an evolving social network. American Journal of Sociology, 115(2):405--450, 2009.",
      "doi": ""
    },
    {
      "text": "R. Kumar, J. Novak, and A. Tomkins. Structure and evolution of online social networks. In Proc. KDD, pages 611--617, 2006.  ",
      "doi": "10.1145/1150402.1150476"
    },
    {
      "text": "H. Kwak, C. Lee, H. Park, and S. Moon. What is Twitter, a social network or a news media? In Proc. WWW, pages 591--600, 2010.  ",
      "doi": "10.1145/1772690.1772751"
    },
    {
      "text": "C. Lampe, N. B. Ellison, and C. Steinfield. Changes in use and perception of Facebook. In Proc. CSCW, pages 721--730, 2008.  ",
      "doi": "10.1145/1460563.1460675"
    },
    {
      "text": "K. Lerman and R. Ghosh. Information contagion: an empirical study of the spread of news on Digg and Twitter social networks. In Proc. ICWSM, 2010.",
      "doi": ""
    },
    {
      "text": "J. Leskovec, J. Kleinberg, and C. Faloutsos. Graphs over time: densification laws, shrinking diameters and possible explanations. In Proc. SIGKDD, pages 177--187, 2005.  ",
      "doi": "10.1145/1081870.1081893"
    },
    {
      "text": "D. Liben-Nowell and J. Kleinberg. The link-prediction problem for social networks. Journal of the American Society for Information Science and Technology, 58(7):1019--1031, 2007.  ",
      "doi": "10.5555/1241540.1241551"
    },
    {
      "text": "D. A. Menchik and X. Tian. Putting Social Context into Text: The Semiotics of E-mail Interaction. American Journal of Sociology, 114(2):332--370, 2008.",
      "doi": ""
    },
    {
      "text": "M. B. Miles and A. M. Huberman. Qualitative Data Analysis: An Expanded Sourcebook. SAGE Publications, 1994.",
      "doi": ""
    },
    {
      "text": "G. Mollenhorst. Networks in contexts: How meeting opportunities affect personal relationships. PhD thesis, University Utrecht, 2009.",
      "doi": ""
    },
    {
      "text": "J.-P. Onnela, J. Saramāki, J. Hyvönen, G. Szabó, D. Lazer, K. Kaski, J. Kertész, and A.-L. Barabási. Structure and tie strengths in mobile communication networks. PNAS, 104(18):7332--7336, 2007.",
      "doi": ""
    },
    {
      "text": "C. Steinfield, N. B. Ellison, and C. Lampe. Social capital, self-esteem, and use of online social network sites: A longitudinal analysis. Journal of Applied Developmental Psychology, 29(6):434--445, 2008.",
      "doi": ""
    },
    {
      "text": "S. T. Tong, B. Van Der Heide, L. Langwell, and J. B. Walther. Too much of a good thing? the relationship between number of friends and interpersonal impressions on facebook. Journal of Computer-Mediated Communication, 13(3):531--549, 2008.",
      "doi": ""
    },
    {
      "text": "Z. Tufekci. Who acquires friends hrough social media and why? \"rich get richer\" versus \"seek and ye shall find\". In Proc. ICWSM, 2010.",
      "doi": ""
    },
    {
      "text": "N. B. Tuma and M. T. Hallinan. The effects of sex, race, and achievement on schoolchildren's friendships. Social Forces, 57(4):1265--1285, 1979.",
      "doi": ""
    },
    {
      "text": "S. Wasserman and K. Faust. Social Network Analysis: Methods and Applications. Cambridge University Press, 1994.",
      "doi": ""
    },
    {
      "text": "J. Weng, E.-P. Lim, J. Jiang, and Q. He. TwitterRank: finding topic-sensitive influential twitterers. In Proc. WSDM, pages 261--270, 2010.  ",
      "doi": "10.1145/1718487.1718520"
    },
    {
      "text": "D. Zhao and M. B. Rosson. How and why people Twitter: the role that micro-blogging plays in informal communication at work. In GROUP, pages 243--252, 2009.  ",
      "doi": "10.1145/1531674.1531710"
    }
  ]
}