{
  "doi": "10.1145/1978942.1979230",
  "title": "The mathematical imagery trainer: from embodied interaction to conceptual learning",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1989-1998",
  "year": 2011,
  "badges": [],
  "abstract": "We introduce an embodied-interaction instructional design, the Mathematical Imagery Trainer (MIT), for helping young students develop grounded understanding of proportional equivalence (e.g., 2/3 = 4/6). Taking advantage of the low-cost availability of hand-motion tracking provided by the Nintendo Wii remote, the MIT applies cognitive-science findings that mathematical concepts are grounded in mental simulation of dynamic imagery, which is acquired through perceiving, planning, and performing actions with the body. We describe our rationale for and implementation of the MIT through a design-based research approach and report on clinical interviews with twenty-two 4th-6th grade students who engaged in problem-solving tasks with the MIT.",
  "authors": [
    {
      "name": "Mark Howison",
      "institution": "Brown University, Providence, Rhode Island, USA",
      "img": "/do/10.1145/contrib-81461659927/rel-imgonly/howison_mark.jpg",
      "acmid": "81461659927",
      "orcid": "missing"
    },
    {
      "name": "Dragan Trninic",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484659349",
      "orcid": "missing"
    },
    {
      "name": "Daniel Reinholz",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658348",
      "orcid": "missing"
    },
    {
      "name": "Dor Abrahamson",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316487922",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrahamson, D. Embodied design: Constructing means for constructing meaning. Educational Studies in Mathematics 70, 1 (2009), 27--47.",
      "doi": ""
    },
    {
      "text": "Alibali, M.W., Bassok, M., Olseth, K.L., et al. Illuminating mental representations through speech and gesture. Psychological Science 10, 4 (1999), 327--333.",
      "doi": ""
    },
    {
      "text": "Antle, A.N., Corness, G., Bakker, S., et al. Designing to support reasoned imagination through embodied metaphor, in Proceeding of the 7th ACM Conference on Creativity and Cognition (Berkeley CA, 2009), 275--284.  ",
      "doi": "10.1145/1640233.1640275"
    },
    {
      "text": "Antle, A.N., Corness, G., and Droumeva, M. What the body knows: Exploring the benefits of embodied metaphors in hybrid physical digital environments. Interacting with Computers 21 (2009), 66--75.  ",
      "doi": "10.1016/j.intcom.2008.10.005"
    },
    {
      "text": "Artigue, M. Learning mathematics in a CAS environment: The genesis of a reflection about instrumentation and the dialectics between technical and conceptual work. International Journal of Computers for Mathematical Learning 7, 3 (2002), 245--274.",
      "doi": ""
    },
    {
      "text": "Bamberger, J. and Schon, D. Learning as reflective conversation with materials. In F. Steier (Ed.), Research and Reflexivity, Sage, London, 1991, 186--209.",
      "doi": ""
    },
    {
      "text": "Barsalou, L.W. Grounded cognition. Annual Review of Psychology 59 (2008), 617--645.",
      "doi": ""
    },
    {
      "text": "Bott, J.N., Crowley, J.G., and LaViola, J.J. Exploring 3D gestural interfaces for music creation in video games. In Proceedings of the 4th international Conference on Foundations of Digital Games (Orlando FL, 2009), 18--25.  ",
      "doi": "10.1145/1536513.1536527"
    },
    {
      "text": "Church, R.B. and Goldin-Meadow, S. The mismatch between gesture and speech as an index of transitional knowledge. Cognition 23 (1986), 43--71.",
      "doi": ""
    },
    {
      "text": "Clinton, K.A. Embodiment in digital worlds: What being a videogame player has to teach us about learning. Paper presented at the Annual Meeting of the American Educational Research Association (San Diego CA, 2004).",
      "doi": ""
    },
    {
      "text": "Collins, A. Towards a design science of education. In Scanlon, E. and O'Shea, T. eds. New directions in educational technology, Springer, Berlin, 1992, 15--22.",
      "doi": ""
    },
    {
      "text": "Confrey, J. The evolution of design studies as methodology. In Sawyer, R.K. ed. The Cambridge handbook of the learning sciences, Cambridge University Press, Cambridge MA, 2005, 135--151.",
      "doi": ""
    },
    {
      "text": "Cress, U., Fischer, U., Moeller, et al. The use of a digital dance mat for training kindergarten children in a magnitude comparison task. In Proceedings of the 9th International Conference of the Learning Sciences (2010), 105--112. ",
      "doi": "10.5555/1854360.1854374"
    },
    {
      "text": "Davis, G.E. Fractions, ratio, and proportional reasoning {Special Issue}. The Journal of Mathematical Behavior 22, 2 (2003).",
      "doi": ""
    },
    {
      "text": "Farber, A. and Parker, L. Discovering Music through Dalcroze Eurhythmics. Music Educators Journal 74, 3 (1987) 43--45.",
      "doi": ""
    },
    {
      "text": "Fuson, K.C. and Abrahamson, D. Understanding ratio and proportion as an example of the Apprehending Zone and Conceptual-Phase problem-solving models. In Campbell, J. ed. Handbook of mathematical cognition, Psychology Press, New York, 2005, 213--234.",
      "doi": ""
    },
    {
      "text": "Goldin-Meadow, S. and Singer, M.A. From children's hands to adults' ears: gesture's role in teaching and learning. Developmental Psychology 39, 3 (2003), 509--520.",
      "doi": ""
    },
    {
      "text": "Hatano, G., Miyake, Y., and Binks, M. Performance of expert abacus operators. Cognition 5, 1 (1977), 57--71.",
      "doi": ""
    },
    {
      "text": "Karmiloff-Smith, A. The child is a theoretician, not an inductivist. Mind &amp;#38; Language 3, 3 (1988), 183--195.",
      "doi": ""
    },
    {
      "text": "Kosslyn, S.M. 2005. Mental images and the brain. Cognitive Neuropsychology 22, 3/4 (2005), 333--347.",
      "doi": ""
    },
    {
      "text": "Lakoff, G. and Nunez, R.E. Where mathematics comes from: How the embodied mind brings mathematics into being. Basic Books, New York, 2000.",
      "doi": ""
    },
    {
      "text": "Lamon, S.J. Rational numbers and proportional reasoning: Toward a theoretical framework for research. In Lester, F.K. ed. Second handbook of research on mathematics teaching and learning, Information Age Publishing, Charlotte NC, 2007, 629--667.",
      "doi": ""
    },
    {
      "text": "Lee, H., Kim, H., Gupta, G., and Mazalek, A. WiiArts: creating collaborative art experience with WiiRemote interaction. In Proceedings of the 2nd International Conference on Tangible and Embedded Interaction (Bonn, Germany, 2008), 33--36.  ",
      "doi": "10.1145/1347390.1347400"
    },
    {
      "text": "Lee, J.C. Hacking the Nintendo Wii Remote. IEEE Pervasive Computing 7, 3 (2008), 39--45.  ",
      "doi": "10.1109/MPRV.2008.53"
    },
    {
      "text": "Marshall, P., Cheng, P.C.-H., and Luckin, R. Tangibles in the balance: a discovery learning task with physical or graphical materials. In Proceedings of the 4th ACM International Conference on Tangible, Embedded, and Embodied Interaction (2010), 153--160.  ",
      "doi": "10.1145/1709886.1709914"
    },
    {
      "text": "Nemirovsky, R., Tierney, C. and Wright, T. Body motion and graphing. Cognition and Instruction 16, 2 (1998), 119--172.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. Cognitive artifacts. In Carroll, J.M. ed. Designing interaction: Psychology at the human-computer interface. Cambridge University Press, New York, 1991, 17--38. ",
      "doi": "10.5555/120352.120354"
    },
    {
      "text": "Papert, S. An exploration in the space of mathematics education. International Journal of Computers for Mathematical Learning 1 (1996), 95--123.",
      "doi": ""
    },
    {
      "text": "Pirie, S.E.B. and Kieren, T. Growth in mathematical understanding: How can we characterize it and how can we represent it? Educational Studies in Mathematics 26 (1994), 165--190.",
      "doi": ""
    },
    {
      "text": "Pratt, D. and Noss, R. Designing for mathematical abstraction. International Journal of Computers for Mathematical Learning 15, 2 (2010), 81--97.",
      "doi": ""
    },
    {
      "text": "Radford, L. Gestures, speech and the sprouting of signs: A semiotic-cultural approach to students' types of generalization. Mathematical Thinking and Learning 5, 1 (2003), 37--70.",
      "doi": ""
    },
    {
      "text": "Roschelle, J., Shechtman, N., Tatar, D., et al. Integration of Technology, Curriculum, and Professional Development for Advancing Middle School Mathematics: Three Large-Scale Studies. American Educational Research Journal 47, 4 (2010), 833--878.",
      "doi": ""
    },
    {
      "text": "Salomon, G., Perkins, D.N., and Globerson, T. Partners in cognition: Extending human intelligences with intelligent technologies. Educational Researcher 20, 3 (1991), 2--9.",
      "doi": ""
    },
    {
      "text": "Saxe, G.B. and Esmonde, I. Studying cognition in flux: a historical treatment of fu in the shifting structure of Oksapmin mathematics. Mind, Culture, and Activity 12, 3--4 (2005), 171--225.",
      "doi": ""
    },
    {
      "text": "Schoenfeld, A. H., Smith, J. P., and Arcavi, A. Learning: The microgenetic analysis of one student's evolving understanding of a complex subject matter domain. In R. Glaser ed. Advances in instructional psychology, Erlbaum, Hillsdale NJ, 1991, 55--175.",
      "doi": ""
    },
    {
      "text": "Schwartz, D.L. Physical Imagery: Kinematic versus Dynamic Models. Cognitive Psychology 38 (1999), 433--464.",
      "doi": ""
    },
    {
      "text": "Schwartz, D.L. and Black, T. Inferences through imagined actions: Knowing by simulated doing. Journal of Experimental Psychology 25, 1 (1999), 116--136.",
      "doi": ""
    },
    {
      "text": "Schwartz, J.L. Can technology help us make the mathematics curriculum intellectually stimulating and socially responsible? International Journal of Computers for Mathematical Learning 4, 2 (1999), 99--119.",
      "doi": ""
    },
    {
      "text": "Shirai, A., Geslin, E., and Richir, S. WiiMedia: motion analysis methods and applications using a consumer video game controller. In Proceedings of the 2007 ACM SIGGRAPH Symposium on Video Games (San Diego CA, 2007), 133--140.  ",
      "doi": "10.1145/1274940.1274966"
    },
    {
      "text": "Stigler, J.W. 'Mental abacus'?: The effect of abacus training on Chinese children's mental calculation. Cognitive Psychology 16, 2 (1984), 145--17.",
      "doi": ""
    },
    {
      "text": "Vergnaud, G. The theory of conceptual fields. In Nunes, T. ed. Giving meaning to mathematical signs: psychological, pedagogical and cultural processes. Human Development {Special Issue} 52 (2009), 83--94.",
      "doi": ""
    },
    {
      "text": "Verillon, P. and Rabardel, P. Cognition and artifacts: A contribution to the study of thought in relation to instrumented activity. European Journal of Psychology of Education 10, 1 (1995), 77--101.",
      "doi": ""
    },
    {
      "text": "Yin, R.K. Case study research: design and methods. Sage, London, 2009.",
      "doi": ""
    }
  ]
}