{
  "doi": "10.1145/1978942.1979379",
  "title": "In the mood: engaging teenagers in psychotherapy using mobile phones",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2947-2956",
  "year": 2011,
  "badges": [],
  "abstract": "Mental illness is a significant and growing problem throughout the world. Many mental health problems have their root in childhood, and early intervention is recommended. Engaging young people in psychotherapeutic activities is challenging, and treatment adherence is often poor. This paper presents a series of studies carried out as part of the development of a mobile and online symptom tracking tool for adolescents with mental health problems. Teenagers use the system to record symptoms on their mobile phones and can view this information in a clinical setting with a therapist. We focus on a clinical pilot of the system with ten users in public mental health clinics. As well as indicating that the mobile diary tool can increase client adherence to therapeutic activities, the study yields insight into the factors influencing the success of the design and informs the design of other systems to be used as adjuncts to therapy.",
  "authors": [
    {
      "name": "Mark Matthews",
      "institution": "Trinity College, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339516407",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Allen, M., J. McGrenere, and B. Purves, The design and field evaluation of PhotoTalk: a digital image communication application for people with aphasia. In Proc. SIGACCESS 2007, ACM Press (2007).  ",
      "doi": "10.1145/1296843.1296876"
    },
    {
      "text": "Bang, M., T. Timpka, H. Eriksson, E. Holm, and C. Nordin. Mobile phone computing for in situ cognitive behavior therapy. In Proceedings of World Congress on Medical Informatics 2007, 2007: Medinfo.",
      "doi": ""
    },
    {
      "text": "Bauer, M., P. Grof, N. Rasgon, T. Glenn, M. Alda, S. Priebe, R. Ricken, and P. Whybrow, Mood Charting and Technology: New Approach to Monitoring Patients with Mood Disorders. Current Psychiatry Reviews 2, 4 (2006), 423--429.",
      "doi": ""
    },
    {
      "text": "Bauer, M., N. Rasgon, P. Grof, L. Gyulai, and T. Glenn, Does the Use of an Automated Tool for Self-Reporting Mood by Patients With Bipolar Disorder Bias the Collected Data? Medscape General Medicine, 2005. 7(21): p. 1--7.",
      "doi": ""
    },
    {
      "text": "Bauer, S., R. Percevic, E. Okon, R. Meerman, and H. Kordy, Use of Text Messaging in the Aftercare of Patients with Bulimia Nervosa. European Eating Disorders Review, 2003. 11: p. 279--290.",
      "doi": ""
    },
    {
      "text": "Bolger, N., A. Davis, and E. Rafaeli, Diary Methods: Capturing Life as it is Lived. Annual Review of Psychology, 2003. 54(1): p. 579--616.",
      "doi": ""
    },
    {
      "text": "Boyd-Graber, J., L., S. Nikolova, S., K. Moffatt, A., K. C. Kin, J. Y. Lee, L. W. Mackey, M. M. Tremaine, and M. M. Klawe, Participatory design with proxies: developing a desktop-PDA system to support people with aphasia. In Proc. CHI 2006, ACM Press (2006), 151--160.  ",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Consolvo, S., K. Everitt, I. Smith, and J.A. Landay, Design requirements for technologies that encourage physical activity. In Proc. CHI 2006, ACM Press (2006), 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Consolvo, S., B. Harrison, I. Smith, M. Chen, K. Everitt, J. Froehlich, and J. Landay, Conducting in situ evaluations for and with ubiquitous computing technologies. International Journal of Human-Computer Interaction, 2007. 22(1): p. 103--118.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., D. McDonald, and J. Landay. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proc. CHI 2009, ACM Press (2009), 405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Feldman Barrett, L. and D. J. Barrett, An introduction to computerized experience sampling in psychology. Soc. Sci. Comput. Rev., 2001. 19: p. 175--85.  ",
      "doi": "10.1177/089443930101900204"
    },
    {
      "text": "Froehlich, J., T. Dillahunt, P. Klasnja, J. Mankoff, S. Consolvo, B. Harrison, and J. A. Landay, UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits. In Proc. CHI 2009, ACM Press (2009), 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Jeong, H. and R. Arriaga. Using an ecological framework to design mobile technologies for pediatric asthma management. In Proc. MobileHCI 2009, ACM.  ",
      "doi": "10.1145/1613858.1613880"
    },
    {
      "text": "Kessler, R., W. Chiu, O. Demler, and E. Walters, Prevalence, severity, and comorbidity of 12-month DSM-IV disorders in the National Comorbidity Survey Replication. Archives of General Psychiatry, 2005. 62(6): p. 617--27.",
      "doi": ""
    },
    {
      "text": "Krishna, S. and S. Boren, Diabetes self-management care via cell phone: a systematic review. Journal of Diabetes Science and Technology, 2008. 2(3):509--517.",
      "doi": ""
    },
    {
      "text": "Leverich, G. S. and R. M. Post, Life charting the course of bipolar disorder. Current Review of Mood and Anxiety Disorders, 1996. 1: p. 48--61.",
      "doi": ""
    },
    {
      "text": "Mamykina, L., A. D. Miller, E. D. Mynatt, and D. Greenblatt, Constructing identities through storytelling in diabetes management. In Proc. CHI 2010, ACM Press (2010), 1203--1212.  ",
      "doi": "10.1145/1753326.1753507"
    },
    {
      "text": "Matthews, M., G. Doherty, J. Sharry, and C. Fitzpatrick, Mobile Phone Mood Charting for Adolescents. British Journal of Guidance and Counselling, 2008. 36(2): 113--129.",
      "doi": ""
    },
    {
      "text": "Mattila, E., J. Parkka, M. Hermersdorf, J. Kaasinen, J. Vainio, K. Samposalo, J. Merilahti, J. Kolari, M. Kulju, R. Lappalainen, and I. Korhonen, Mobile Diary for Wellness Management - Results on Usage and Usability in Two User Studies. IEEE Transactions on Information Technology in Biomedicine, 2008. 12(4): p. 501--512.  ",
      "doi": "10.1109/TITB.2007.908237"
    },
    {
      "text": "McLeod, J., Case studies and practitioner research: Building knowledge through systematic inquiry into individual cases. Counselling and Psychotherapy Research, 2002. 2(4): p. 264--268.",
      "doi": ""
    },
    {
      "text": "Moffatt, K. A., J. McGrenere, B. Purves, and M. M. Klawe, The participatory design of a sound and image enhanced daily planner for people with aphasia. In Proc. CHI 2004, ACM Press (2004), 407--414.  ",
      "doi": "10.1145/985692.985744"
    },
    {
      "text": "Morris, M., Q. Kathawala, T. Leen, E. Gorenstein, F. Guilak, M. Labhard, and W. Deleeuw, Mobile Therapy: Case Study Evaluations of a Cell Phone Application for Emotional Self-Awareness. Journal of Internet Medical Research, 2010. 12(2).",
      "doi": ""
    },
    {
      "text": "Obermayer, J., W. Riley, O. Asif, and J. Jean-Mary, College smoking-cessation using cell phone text messaging. Journal of American College Health, 2004. 53(2): p. 71--78.",
      "doi": ""
    },
    {
      "text": "Offer, D., K. I. Howard, K. A. Schonert, and E. Ostrov, \"To whom do adolescents turn for help? Differences between disturbed and non-disturbed adolescents.\" Journal of the American Academy of Child and Adolescent Psychiatry 1991. 30(4) p. pp. 623--630.",
      "doi": ""
    },
    {
      "text": "Preziosa, A., A. Grassi, A. Gaggioli, and G. Riva, Therapeutic applications of the mobile phone. British Journal of Guidance & Counselling, 2009. 37(3) 313--325.",
      "doi": ""
    },
    {
      "text": "Robinson, S., S. Perkins, S. Bauer, N. Hammond, J. Treasure, and U. Schmidt, Aftercare intervention through text messaging in the treatment of bulimia nervosa - Feasibility pilot. International Journal of Eating Disorders, 2006. 39(8): p. 633--638.",
      "doi": ""
    },
    {
      "text": "Soni, A., The Five Most Costly Conditions, 1996 and 2006: Estimates for the U.S. Civilian Noninstitutionalized Population. Statistical Brief #248. 2009, Agency for Healthcare Research and Quality: Rockville, MD.",
      "doi": ""
    },
    {
      "text": "Stone, A. A., S. Shiffman, J. E. Schwartz, J. E. Broderick, and M. R. Hufford, Patient non-compliance with paper diaries. BMJ, 2002. 324(1): p. 1193--1194.",
      "doi": ""
    },
    {
      "text": "Tsai, C., G. Lee, F. Raab, G. Norman, T. Sohn, W. Griswold, and K. Patrick, Usability and feasibility of PmEB: a mobile phone application for monitoring real time caloric balance. Mobile Networks and Applications, 2007. 12(2): p. 173--184.  ",
      "doi": "10.1007/s11036-007-0014-4"
    },
    {
      "text": "World Health Organization, The global burden of disease: 2004 update. 2008, WHO: Geneva, Switzerland.",
      "doi": ""
    }
  ]
}