{
  "doi": "10.1145/1978942.1979306",
  "title": "Enhancing physicality in touch interaction with programmable friction",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2481-2490",
  "year": 2011,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Touch interactions have refreshed some of the 'glowing enthusiasm' of thirty years ago for direct manipulation interfaces. However, today's touch technologies, whose interactions are supported by graphics, sounds or crude clicks, have a tactile sameness and gaps in usability. We use a Large Area Tactile Pattern Display (LATPaD) to examine design possibilities and outcomes when touch interactions are enhanced with variable surface friction. In a series of four studies, we first confirm that variable friction gives significant performance advantages in low-level targeting activities. We then explore the design space of variable friction interface controls and assess user reactions. Most importantly, we demonstrate that variable friction can have a positive impact on the enjoyment, engagement and sense of realism experienced by users of touch interfaces.",
  "tags": [
    "target acquisition",
    "variable friction",
    "tactile feedback",
    "touch interface",
    "touch interaction",
    "touchscreen",
    "design space",
    "touch screen",
    "programmable friction",
    "Fitts Law",
    "haptics"
  ],
  "authors": [
    {
      "name": "Vincent Levesque",
      "institution": "University of British Columbia, Vancouver, British Columbia, Canada",
      "img": "/do/10.1145/contrib-81100206465/rel-imgonly/dsc05377.jpeg",
      "acmid": "81100206465",
      "orcid": "missing"
    },
    {
      "name": "Louise Oram",
      "institution": "UBC, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658500",
      "orcid": "missing"
    },
    {
      "name": "Karon MacLean",
      "institution": "UBC, Vancouver, British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Nicholas D. Marchuk",
      "institution": "Northwestern University , Evanston, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655822",
      "orcid": "missing"
    },
    {
      "name": "Dan Johnson",
      "institution": "Northwestern University , Evanston, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484648383",
      "orcid": "missing"
    },
    {
      "name": "J. Edward Colgate",
      "institution": "Northwestern University , Evanston, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453634004",
      "orcid": "missing"
    },
    {
      "name": "Michael A. Peshkin",
      "institution": "Northwestern University , Evanston, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100178074",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akamatsu, M. and MacKenzie, I.S. Movement characteristics using mouse with tactile and force feedback. Int. J. of Human-Computer Studies 45, 4 (1996), 483--494.  ",
      "doi": "10.1006/ijhc.1996.0063"
    },
    {
      "text": "Balakrishnan, R. \"Beating\" Fitts' law: virtual enhancements for pointing facilitation. Int. J. of Human-Computer Studies 61, 6 (2004). 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Bau, O., Poupyrev, I., Israr, A., and Harrison, C. TeslaTouch Electrovibration for Touch Surfaces. In Proc. UIST 2010, ACM (2010).  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Benko, H., Wilson, A.D., and Balakrishnan, R. Sphere: Multi-Touch Interactions on a Spherical Display. In Proc. UIST 2008, ACM (2008). 77--86.  ",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "Buxton, W., Hill, R., and Rowley, P. Issues and techniques in touch-sensitive tablet input. In Proc. SIGGRAPH 1985, ACM (1985). 215--224.  ",
      "doi": "10.1145/325334.325239"
    },
    {
      "text": "Cockburn, A. and Brewster, S. Multimodal feedback for the acquisition of small targets. Ergonomics 48, 9 (2005), 1129--1150.",
      "doi": ""
    },
    {
      "text": "Dennerlein, J.T., Martin, D.B., and Hasser, C. Force-feedback improved performance for steering and combined steering-targeting tasks. In Proc. CHI 2000, ACM (2000), 423--429.  ",
      "doi": "10.1145/332040.332469"
    },
    {
      "text": "DiFranco, D.E., Beauregard, G.L., and Srinivasan, M. The effect of auditory cues on the haptic perception of stiffness in virtual environments. In Proc. Haptics Symposium 1997, ASME (1997), 17--22.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. The information capacity of the human motor system in controlling the amplitude of movement. J. of Experimental Psychology 47. 6 (1954), 381--391.",
      "doi": ""
    },
    {
      "text": "Forlines, C. and Balakrishnan, R. Evaluating tactile feedback and direct vs. indirect stylus input in pointing and crossing selection tasks. In Proc. CHI 2008, ACM (2008), 1563--1572.  ",
      "doi": "10.1145/1357054.1357299"
    },
    {
      "text": "Greenberg, S. and Buxton, B. Usability evaluation considered harmful (some of the time). In Proc. CHI 2008, ACM (2008), 111--120.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Hancock, M., Carpendale, S., and Cockburn, A. Shallow-depth 3 interaction: design and evaluation of one-, two- and three-touch techniques. In Proc. CHI 2007, ACM (2007), 1147--1156.  ",
      "doi": "10.1145/1240624.1240798"
    },
    {
      "text": "Hoggan, E., Kaaresoja, T., Laitinen, P., and Brewster, S. Crossmodal congruence: the look, feel and sound of touchscreen widgets. In Proc. IMCI 2008, ACM (2008), 157--164.  ",
      "doi": "10.1145/1452392.1452423"
    },
    {
      "text": "Keyson, D.V. Dynamic cursor gain and tactual feedback in the capture of cursor movements. Ergonomics 40, 12 (1997), 1287--1298.",
      "doi": ""
    },
    {
      "text": "Li, K.A., Baudisch, P., Griswold, W.G., and Hollan, J.D. Tapping and rubbing: exploring new dimensions of tactile feedback with voice coil motors. In Proc. UIST 2008, ACM (2008), 181--190.  ",
      "doi": "10.1145/1449715.1449744"
    },
    {
      "text": "MacLean, K.E. Foundations of Transparency in Tactile Information Design. IEEE Transactions on Haptics 1, 2 (2008), 84--95.  ",
      "doi": "10.1109/TOH.2008.20"
    },
    {
      "text": "Marchuk, N.D., Colgate, J.E., and Peshkin, M.A. Friction measurements on a Large Area TPaD. In Proc. Haptics Symposium 2010, IEEE (2010). 317--320.  ",
      "doi": "10.1109/HAPTIC.2010.5444636"
    },
    {
      "text": "Moscovich, T. Contact area interaction with sliding widgets. In Proc. UIST 2009, ACM (2009), 13--22.  ",
      "doi": "10.1145/1622176.1622181"
    },
    {
      "text": "Norman, D. Emotional Design: Why We Love (or Hate) Everyday Things. Basic Books, NY, NY, USA, 2004.",
      "doi": ""
    },
    {
      "text": "Oakley, I., Brewster, S., and Gray, P. Solving multi-target haptic problems in menu interaction. In Proc. CHI 2001, ACM (2001), 357--358.  ",
      "doi": "10.1145/634067.634278"
    },
    {
      "text": "O'Brien, H.L. and Toms, E.G. The development and evaluation of survey to measure user engagement. Journal of the American Society for Information Science and Technology 61, 1 (2009), 50--69.  ",
      "doi": "10.5555/1672957.1672978"
    },
    {
      "text": "Potter, R.L., Weldon, L.J., and Shneiderman, B. Improving the accuracy of touch screens: an experimental evaluation of three strategies. In Proc. CHI 1988, ACM (1988), 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Poupyrev, I. and Maruyama, S. Tactile interfaces for small touch screens. In Proc. UIST 2003, ACM (2003), 217--220.  ",
      "doi": "10.1145/964696.964721"
    },
    {
      "text": "Poupyrev, I., Okabe, M., and Maruyama, S. Haptic feedback for pen computing: directions and strategies. In Proc. CHI 2004, ACM (2004), 1309--1312.  ",
      "doi": "10.1145/985921.986051"
    },
    {
      "text": "Ramos, G. and Balakrishnan, R. Fluid interaction techniques for the control and annotation of digital video. In Proc. UIST 2003, ACM (2003), 105--114.  ",
      "doi": "10.1145/964696.964708"
    },
    {
      "text": "Rekimoto, J. Organic interaction technologies. Communications of the ACM 51, 6 (2008), 38--44.  ",
      "doi": "10.1145/1349026.1349035"
    },
    {
      "text": "Roudaut, A., Huot, S., and Lecolinet, E. TapTap and MagStick improving one-handed target acquisition on small touch-screens. In Proc. AVI 2008, ACM (2008), 146--153.  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Schiphorst, T., Motamedi, N., and Jaffe, N. Applying an Aesthetic Framework of Touch for Table-Top Interactions. In Proc. TABLETOP 2007. IEEE (2007), 71--74.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Direct Manipulation: A Step Beyond Programming Languages. Computer 16, 8 (1983), 57--69.  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Smyth, T.N. and Kirkpatrick, A.E. A new approach to haptic augmentation of the GUI. In Proc. ICMI 2006, ACM (2006), 372--379.  ",
      "doi": "10.1145/1180995.1181064"
    },
    {
      "text": "Swindells, C., MacLean, K.E., Booth, K.S., and Meitner, M.J. Exploring affective design for physical controls. In Proc. CHI 2007, ACM (2007), 933--942.  ",
      "doi": "10.1145/1240624.1240765"
    },
    {
      "text": "Winfield, L., Glassmire, J., Colgate, J.E., and Peshkin, M. T-PaD Tactile Pattern Display through Variable Friction Reduction. In Proc. World Haptics 2007, IEEE (2007), 421--426.  ",
      "doi": "10.1109/WHC.2007.105"
    }
  ]
}