{
  "doi": "10.1145/1978942.1979152",
  "title": "Designing for emerging rural users: experiences from China",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1433-1436",
  "year": 2011,
  "badges": [],
  "abstract": "As part of IBM's Smarter Planet initiative, we studied information-sharing practices in rural Northern China to understand if and how ICT can help rural residents improve their lives. Interviews and participant observation in two villages showed a profusion of ICT devices, as well as an abundance of face-to-face information exchanges, but a shortage of localized and easily accessible information, and a deep dependence of many rural residents on 'information brokers' such as agricultural extension workers and shop owners. Can ICT support existing practices of information sharing among rural residents, when these practices are largely based on face-to-face encounters and passive reception of information? We argue that in such an environment, ICT should build on existing social habits even if less than ideal, rather than trying to transform them, and we outline a possible way to do so.",
  "tags": [
    "rural china",
    "intermediated technology use",
    "emerging regions"
  ],
  "authors": [
    {
      "name": "Elisa Oreglia",
      "institution": "University of California, Berkeley, Berkeley, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332519616",
      "orcid": "missing"
    },
    {
      "name": "Ying Liu",
      "institution": "IBM Research China, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81375605003",
      "orcid": "missing"
    },
    {
      "name": "Wei Zhao",
      "institution": "IBM Research China, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456631263",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brewer, E. et al. The challenges of technology research for developing regions. IEEE Pervasive Computing 5, 2 (2006), 15--23.  ",
      "doi": "10.1109/MPRV.2006.40"
    },
    {
      "text": "CNNIC. The 26th survey report on the Internet development in China. 15 July 2010.",
      "doi": ""
    },
    {
      "text": "Dearden, A. User-centered design considered harmful. ITID 4, 3 (2008), 7--12.  ",
      "doi": "10.1162/itid.2008.00013"
    },
    {
      "text": "Huang J. et al. Markets, specialization and China's agriculture. Working paper for Food and Agricultural Organisation, Center for Chinese Agricultural Policy, Chinese Academy of Sciences, Beijing, China, 2005.",
      "doi": ""
    },
    {
      "text": "Lang X. et al. Social practices and mobile phone use of young migrant workers. In Proc. MobileHCI2010, ACM Press (2010), 59--62.  ",
      "doi": "10.1145/1851600.1851613"
    },
    {
      "text": "Li, B. Shandong agricultural products exports. International Journal of Business and Management 4, 3 (2009), 62--65.",
      "doi": ""
    },
    {
      "text": "Liu X. et al. Design for China's migrant workers: A case of user research and mobile product concepts development. In Proc. HCD09, Springer-Verlag, Berling, Heidelberg, 482--491.  ",
      "doi": "10.1007/978-3-642-02806-9_56"
    },
    {
      "text": "MIIT. Statistics on fixed phone users by Province as of January 2010. March 8, 2010.",
      "doi": ""
    },
    {
      "text": "Parikh, T. et al. Understanding and designing for intermediated information tasks in India. IEEE Pervasive Computing 5, 2 (2006), 32--39.  ",
      "doi": "10.1109/MPRV.2006.41"
    },
    {
      "text": "Rozelle, S. The nature of China's food economy. Presentation at the Inclusive Business in Agrifood Markets. Beijing, China, March 5--6, 2008.",
      "doi": ""
    },
    {
      "text": "1Sambavisan N. et al. Intermediated technology use in developing communities. In Proc. CHI2010, ACM Press (2010), 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Sherwani J. et al. Orality-grounded HCID: Under-standing the oral user. Information Technologies and International Development 5, 4 (2009), 37--49.",
      "doi": ""
    },
    {
      "text": "Sukumaran, A. et al. Intermediated technology interaction in rural contexts. In Ext Abstracts CHI 2009, ACM Press (2009), 3817--3822.  ",
      "doi": "10.1145/1520340.1520577"
    },
    {
      "text": "Ulrich, P. Poverty reduction through access to information and communication technologies in rural areas. The Electronic Journal on Information Systems in Developing Countries 16, 7 (2004), 1--38.",
      "doi": ""
    },
    {
      "text": "Xia, J. Linking ICTs to rural development: China's rural information policy. Government Information Quarterly 27, 2 (2010), 187--195.",
      "doi": ""
    },
    {
      "text": "Zhang, M. et al. Knowledge, attitude, and home Internet adoption in rural China: A case of Hubei, China Media Research 5, 4 (2009), 1--12.",
      "doi": ""
    },
    {
      "text": "Zhao, J. ICT4D: Internet adoption and usage among rural users in China. Knowledge, Technology & Policy, 21, 1 (2008), 9--18.",
      "doi": ""
    },
    {
      "text": "Zhao, J. Integrating the Internet into farming activities: A study of farmer users in Shandong Province, China. Science Technology & Society 13, 2 (2008), 325--244.",
      "doi": ""
    },
    {
      "text": "Zhong, Y. Information services in rural China: Field surveys and findings. RAP Publication, 2004/03. Bangkok, FAO, 2004.",
      "doi": ""
    }
  ]
}