{
  "doi": "10.1145/1978942.1979421",
  "title": "Privacy dictionary: a linguistic taxonomy of privacy for content analysis",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3227-3236",
  "year": 2011,
  "badges": [],
  "abstract": "Privacy is frequently a key concern relating to technology and central to HCI research, yet it is notoriously difficult to study in a naturalistic way. In this paper we describe and evaluate a dictionary of privacy designed for content analysis, derived using prototype theory and informed by traditional theoretical approaches to privacy. We evaluate our dictionary categories alongside privacy-related categories from an existing content analysis tool, LIWC, using verbal discussions of privacy issues from a variety of technology and non-technology contexts. We find that our privacy dictionary is better able to distinguish between privacy and non-privacy language, and is less context-dependent than LIWC. However, the more general LIWC categories are able to describe a greater amount of variation in our data. We discuss possible improvements to the privacy dictionary and note future work.",
  "authors": [
    {
      "name": "Alastair J. Gill",
      "institution": "University of Surrey, Surrey, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81536540856",
      "orcid": "missing"
    },
    {
      "name": "Asimina Vasalou",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485195",
      "orcid": "missing"
    },
    {
      "name": "Chrysanthi Papoutsi",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655636",
      "orcid": "missing"
    },
    {
      "name": "Adam N. Joinson",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100339752",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Acquisti, A. and Grossklags, J. Privacy attitudes and Privacy behavior: Losses, Gains, and Hyperbolic Discounting. In Camp and Lewis: The Economics of Information Security Kluwer, 2004.",
      "doi": ""
    },
    {
      "text": "Adams, A. and Sasse, M.A. Privacy in multimedia communications: protecting users not just data. In Proceedings of IMH HCI'01, 2001, 49--64.",
      "doi": ""
    },
    {
      "text": "Altman, I. The environment and social behavior. Brooks/Cole, Monterey: CA, 1975.",
      "doi": ""
    },
    {
      "text": "Beach, S., Schulz, R., Downs, J., Matthews, J., Barron, B. and Seelman, K. Disability, Age, and Informational Privacy Attitudes in Quality of Life Technology Applications: Results from a National Web Survey. ACM Trans. Access. Comput., 2, 1 2009, 1--21.  ",
      "doi": "10.1145/1525840.1525846"
    },
    {
      "text": "Boyle, M. and Greenberg, S. The language of privacy: Learning from video media space analysis and design. ACM Trans. Comput.-Hum. Interact., 12, 2 2005), 328--370.  ",
      "doi": "10.1145/1067860.1067868"
    },
    {
      "text": "Christidi, S. and Rosenbaum-Elliott, R. Shared spaces and personal corners in social networking websites: the contracted and the cryptically revealed self. European Advances in Consumer Research, 9 2010).",
      "doi": ""
    },
    {
      "text": "Chung, C. and Pennebaker, J. W. The Psychological Function of Function Words. In: Fiedler (ed.): Social Communication, Psychology Press, 2007.",
      "doi": ""
    },
    {
      "text": "Costello, J. Nursing older dying patients: findings from an ethnographic study of death and dying in elderly care wards. Journal of Advanced Nursing, 35, 1 2001), 59--68.",
      "doi": ""
    },
    {
      "text": "DeCew, J. W. In Pursuit of Privacy: Law, Ethics, and the Rise of Technology. Cornell University Press, Ithaca, NY, 1997.",
      "doi": ""
    },
    {
      "text": "DeCew, J. W. The Priority of Privacy for Medical Information. Social Philosophy and Policy, 17, 2 2000, 213--234.",
      "doi": ""
    },
    {
      "text": "Fehr, B. Prototype Analysis of the Concepts of Love and Commitment. Journal of Personality and Social Psychology, 55, 4 1988, 557--579.",
      "doi": ""
    },
    {
      "text": "Gill, A. J., French, R. M., Gergle, D. and Oberlander, J. The Language of Emotion in Short Blog Texts. ACM, New York, NY, 2008.",
      "doi": "10.1145/1460563.1460612"
    },
    {
      "text": "Hancock, J. T., Curry, L., Goorha, S. and Woodworth, M. T. On lying and being lied to: A linguistic analysis of deception. Discourse Processes, 45 2008, 1--23.",
      "doi": ""
    },
    {
      "text": "Harper, J. and Singleton, S. With a Grain of Salt: What Consumer Privacy Surveys Don't Tell Us. 2001. http://ssrn.com/abstract=299930.",
      "doi": ""
    },
    {
      "text": "Introna, L. D. and Pouloudi, A. Privacy in the information age: Stakeholders, interests and values. Journal of Business Ethics, 22, 1 1999, 27--38.",
      "doi": ""
    },
    {
      "text": "Joinson, A. N. and Paine, C. Self-disclosure, Privacy and the Internet. Oxford University Press, Oxford, 2007.",
      "doi": ""
    },
    {
      "text": "Joinson, A. N. Looking at, looking up or keeping up with people? Motives and use of facebook. In Proceedings of the twenty-sixth annual SIGCHI conference on Human factors in computing systems (Florence, Italy). ACM, 2008.  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Joinson, A. N., Paine, C., Buchanan, T. and Reips, U. D. Measuring self-disclosure online: Blurring and non-response to sensitive items in web-based surveys. Comput Hum Behav, 24, 5 2008, 2158--2171.  ",
      "doi": "10.1016/j.chb.2007.10.005"
    },
    {
      "text": "Labov, W. The boundaries of words and their meaning. In Bailey and Shuy (eds.): New Ways of Analyzing Variation in English. Georgetown University Press, Washington DC, 1973.",
      "doi": ""
    },
    {
      "text": "Leyshon, A., Knights, D. and Burton, D. Delivering Financial Services in the Home. Colchester, EsCUL: UK Data Archive, 2002--2004.",
      "doi": ""
    },
    {
      "text": "Leyshon, A., Signoretta, P., Knights, D., Alferoff, C. and Burton, D. Walking with Moneylenders: The Ecology of the UK Home-collected Credit Industry. Urban Studies, 43, 1 2006, 161--186.",
      "doi": ""
    },
    {
      "text": "Lowe, W. Content analysis and its place in the (methodological) scheme of things Qualitative Methods 2, 1 2004, 25--27.",
      "doi": ""
    },
    {
      "text": "Livingstone, S. and Bober, M. United Kingdom Children Go Online. Colchester, EsCUL: UK Data Archive, 2003--2005.",
      "doi": ""
    },
    {
      "text": "Mazanderani, F. and Brown, I. Making things private: exploring the relational dynamics of privacy. In Proceedings of the Computers, Privacy and Data Protection (Brussels, Belgium), 2010.",
      "doi": ""
    },
    {
      "text": "Mehl, M.R. and Gill, A.J. Computerized Content Analysis. In: Gosling and Johnson (eds.), Advanced Methods for Behavioral Research on the Internet. American Psychological Association Publications, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Murphy, T. and Whitty, N. Risk and Human Rights in UK Prison Governance. British Journal of Criminology, 47, 5 2007, 798--816.",
      "doi": ""
    },
    {
      "text": "Oberlander, J. and Gill, A. J. Language with character: A stratified corpus comparison of individual differences in e-mail communication. Discourse Processes, 43, 2 2006, 239--270.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Dourish, P. Unpacking \"privacy\" for a networked world. In Proceedings of the SIGCHI conference on Human factors in computing systems (Ft. Lauderdale, Florida, USA). ACM, New York, NY, 2003.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Patil, S., Romero, N. and Karat, J. Privacy and HCI: methodologies for studying privacy issues. In Proceedings of the SIGCHI conference on Human factors in computing systems (Montreal, Canada). ACM, New York, NY, 2006.  ",
      "doi": "10.1145/1125451.1125771"
    },
    {
      "text": "Pattenden, R. and Skinns, L. Choice, Privacy and Publicly Funded Legal Advice at Police Stations. The Modern Law Review, 73, 3 2010, 349--370.",
      "doi": ""
    },
    {
      "text": "Pedersen, D. M. Model for types of privacy by privacy functions. Journal of Environmental Psychology, 19, 4 1999, 397--405.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Mehl, M. R. and Niederhoffer, K. G. Psychological Aspects of Natural Language Use: Our Words, Our Selves. Annual Review of Psychology, 54 2003, 547--577.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Francis M.E., Booth R.J. (2001). Linguistic Inquiry and Word Count (LIWC): LIWC2001. Mahwah: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Petronio, S. Boundaries of privacy: Dialectics of disclosure. State University of New York Press, Albany: NY, 2002.",
      "doi": ""
    },
    {
      "text": "Raento, M. and Oulasvirta, A. Designing for privacy and self-presentation in social awareness. Personal and Ubiquitous Computing, 12, 7 2008, 527--542.  ",
      "doi": "10.1007/s00779-008-0200-9"
    },
    {
      "text": "Roen, K., Scourfield, J. and McDermott, E. Cultural Context of Youth Suicide: Identity, Gender and Sexuality. Colchester, EsCUL: UK Data Archive, 2006.",
      "doi": ""
    },
    {
      "text": "Rosch, E. Principles of categorization. Erlbaum, Hillsdale, NJ, 1978.",
      "doi": ""
    },
    {
      "text": "Seymour, J. Technology and Natural Death: a Study of Older People. Colchester, EsCUL: UK Data Archive, 2001--2002.",
      "doi": ""
    },
    {
      "text": "Skinns, L. Co-operation or Contest? Inter-Agency Relationships in Police Custody Areas. Colchester, EsCUL: UK Data Archive, 2007.",
      "doi": ""
    },
    {
      "text": "Solove, D. J. A taxonomy of privacy. University of Pennsylvania Law Review, 154, 3 2006, 477--564.",
      "doi": ""
    },
    {
      "text": "Stutzman, F. and Kramer-Duffield, J. Friends only: examining a privacy-enhancing behavior in facebook. In Proceedings of the 28th international conference on Human factors in computing systems (Atlanta, Georgia, USA). ACM, New York, NY, 2010.  ",
      "doi": "10.1145/1753326.1753559"
    },
    {
      "text": "Tausczik, Y. R. and Pennebaker, J. W. The Psychological Meaning of Words: LIWC and Computerized Text Analysis Methods. Journal of Language and Social Psychology, 29, 1 2010, 24--54.",
      "doi": ""
    },
    {
      "text": "Tavani, H. T. Philosophical theories of privacy: Implications for an adequate online privacy policy. Metaphilosophy, 38, 1 2007, 1--22.",
      "doi": ""
    },
    {
      "text": "Terry, W., Olson, L. G., Wilss, L. and Boulton-Lewis, G. Experience of dying: concerns of dying patients and of carers. Internal Medicine Journal, 6, 3 2006, 338--346.",
      "doi": ""
    },
    {
      "text": "Vasalou, A., Joinson, A., Houghton, D. A prototype analysis of privacy (under review).",
      "doi": ""
    },
    {
      "text": "Westin, A. Privacy and freedom. Athenaeum, New York, 1967.",
      "doi": ""
    },
    {
      "text": "Wittgenstein, L. Philosophical Investigations. Blackwell, Oxford, 2001.",
      "doi": ""
    }
  ]
}