{
  "doi": "10.1145/1978942.1979351",
  "title": "Categorization costs for hierarchical keyboard commands",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2765-2768",
  "year": 2011,
  "badges": [],
  "abstract": "Previous research comparing methods of issuing commands found that selecting a toolbar item is faster than selecting an item from two menus with either a mouse or keyboard shortcut. Over the course of 90 trials, however, the keyboard method showed the most improvement, nearing the toolbar response time. The study presented in this paper compared the response time of the keyboard method across 240 trials when items were drawn from a single versus two menus. Throughout the trials, the 1-menu condition produced selection times that were on average 600 ms to 800 ms faster than the 2-menu condition suggesting users in the 2-menu condition were not able to bypass the menu decision by chunking the 3-key sequence into one cognitive unit. Models are presented to describe performance at various stages of learning. Practical implications are that hierarchical, category-based keyboard commands do not provide a clear advantage to toolbar-based selection and that theory-based evaluation methods may need to reflect this result.",
  "authors": [
    {
      "name": "Craig S. Miller",
      "institution": "DePaul University, Chicago, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100160594",
      "orcid": "missing"
    },
    {
      "name": "Svetlin Denkov",
      "institution": "DePaul University, Chicago, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658691",
      "orcid": "missing"
    },
    {
      "name": "Richard C. Omanson",
      "institution": "User Centric, Oakbrook Terrace, Illinois, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484659095",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S. K. Card, T. P. Moran, and A. Newell. The Psychology of Human-Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum Associates, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "A. Cockburn and C. Gutwin. A model of novice and expert navigation performance in constrained-input interfaces. ACM Transactions on Computer-Human Interaction (TOCHI), 17(3):1--38, 2010.  ",
      "doi": "10.1145/1806923.1806927"
    },
    {
      "text": "A. Cockburn, C. Gutwin, and S. Greenberg. A predictive model of menu performance. In CHI '07: Proceedings of the SIGCHI conference on Human factors in computing systems, pages 627--636, New York, NY, USA, 2007. ACM.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "B. E. John. Cogtool user guide version 1.1. http://cogtool.hcii.cs.cmu.edu/sites/default/files/CogToolUserGuide_1_1%.pdf, 2009. Accessed January 5, 2011.",
      "doi": ""
    },
    {
      "text": "B. E. John and D. E. Kieras. The GOMS family of user interface analysis techniques: comparison and contrast. ACM Trans. Comput.-Hum. Interact., 3(4):320--351, 1996.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "A. H. Jorgensen, B. Laursen, and B. R. Jensen. Using mouse and keyboard under time pressure: preference, strategies, and learning. Behavioral and Brain Sciences, 21:317--319, 2002.",
      "doi": ""
    },
    {
      "text": "J. Karat, J. E. McDonald, and M. Anderson. A comparison of menu selection techniques: Touch panel, mouse and keyboard. International Journal of Man-Machine Studies, 25:73--88, 1986.  ",
      "doi": "10.1016/S0020-7373%2886%2980034-7"
    },
    {
      "text": "D. Lane, H. Napier, R. Batsell, and J. Naman. Predicting the skilled use of hierarchical menus with the keystroke-level model. Human-Computer Interaction, 8(2):185--192, 1993.  ",
      "doi": "10.1207/s15327051hci0802_4"
    },
    {
      "text": "D. M. Lane, H. A. Napier, S. C. Peres, and A. Sandor. Hidden costs of graphical user interfaces: Failure to make the transition from menus and icon toolbars to keyboard shortcuts. International Journal of Human-Computer Interaction, 18:133--144, 2005.",
      "doi": ""
    },
    {
      "text": "R. C. Omanson, C. S. Miller, E. Young, and D. Schwantes. Comparison of mouse and keyboard efficiency. In Human Factors and Ergonomics Society Annual Meeting Proceedings. HFES, Santa Monica, CA, 2010.",
      "doi": ""
    }
  ]
}