{
  "doi": "10.1145/1978942.1979174",
  "title": "Multi-touch document folding: gesture models, fold directions and symmetries",
  "published": "2011-05-07",
  "proctitle": "CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1591-1600",
  "year": 2011,
  "badges": [],
  "abstract": "For document visualization, folding techniques provide a focus-plus-context approach with fairly high legibility on flat sections. To enable richer interaction, we explore the design space of multi-touch document folding. We discuss several design considerations for simple modeless gesturing and compatibility with standard Drag and Pinch gestures. We categorize gesture models along the characteristics of Symmetric/Asymmetric and Serial/Parallel, which yields three gesture models. We built a prototype document workspace application that integrates folding and standard gestures, and a system for testing the gesture models. A user study was conducted to compare the three models and to analyze the factors of fold direction, target symmetry, and target tolerance in user performance when folding a document to a specific shape. Our results indicate that all three factors were significant for task times, and parallelism was greater for symmetric targets.",
  "authors": [
    {
      "name": "Patrick Chiu",
      "institution": "FX Palo Alto Laboratory, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332493077",
      "orcid": "missing"
    },
    {
      "name": "Chunyuan Liao",
      "institution": "FX Palo Alto Laboratory, Palo Alto, California, USA",
      "img": "/do/10.1145/contrib-81408597619/rel-imgonly/liao.jpg",
      "acmid": "81408597619",
      "orcid": "missing"
    },
    {
      "name": "Francine Chen",
      "institution": "FX Palo Alto Laboratory, Palo Alto, California, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100107542",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R., Hinckley, K., Symmetric bimanual interaction. Proc. CHI 2000, pp. 33--40.  ",
      "doi": "10.1145/332040.332404"
    },
    {
      "text": "Beaudouin-Lafon, M. Novel interaction techniques for overlapping windows. Proc. UIST 2001, pp. 153--154.  ",
      "doi": "10.1145/502348.502371"
    },
    {
      "text": "Buxton, W. Myers, B. A study in two-handed input. Proc. CHI 1986, pp. 321--326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Buxton, B. \"Multi-touch systems that I have known and loved\" (ver. Oct. 2009). http://www.billbuxton.com/multitouchOverview.htm.",
      "doi": ""
    },
    {
      "text": "Chang, S. H-H., Stuart, L. and Plimmer, B. Origami Simulator: A multi-touch experience. CHI 2009 Extended Abstracts, pp. 3889--3894.  ",
      "doi": "10.1145/1520340.1520589"
    },
    {
      "text": "Cutler, L.D., Fr&amp;#246;hlich, B., Hanrahan, P. Two-handed direct manipulation on the Responsive Workbench. Proc. I3D 1997, pp. 107--114.  ",
      "doi": "10.1145/253284.253315"
    },
    {
      "text": "Denoue L., Nelson L., Churchill, E.F. A fast, interactive 3D paper-flier metaphor for digital bulletin boards. Proc. UIST 2003, pp. 169--172.  ",
      "doi": "10.1145/964696.964715"
    },
    {
      "text": "Dragicevic, P. Combining crossing-based and paper-based interaction paradigms for dragging and dropping between overlapping windows. Proc. UIST 2004, pp. 193--196.  ",
      "doi": "10.1145/1029632.1029667"
    },
    {
      "text": "Elmqvist, N., Henry, N., Riche, Y., Fekete, J.D. Melange: Space folding for multi-focus interaction. Proc. CHI 2008, pp. 173--176.  ",
      "doi": "10.1145/1357054.1357263"
    },
    {
      "text": "Guiard, Y., Asymmetric division of labor in human skilled bimanual action: the kinematic chain as a model. J. of Motor Behavior, 19 (4): 486--517, 1987.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Proffitt, D., Patten, J., Kassell, N. Cooperative bimanual action. Proc. CHI 1997, pp. 27--34.  ",
      "doi": "10.1145/258549.258571"
    },
    {
      "text": "Hinckley, K., Baudisch, P., Ramos, G., Guimbretiere, F. Design and analysis of delimiters for selection-action pen gesture phrases in Scriboli. Proc. CHI 2005, pp. 451--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Kabbash, P., MacKenzie, I.S., Buxton, W. Human performance using computer input devices in the preferred and non-preferred hands. Proc. CHI 1993, pp. 474--481. ",
      "doi": "10.5555/164632.164974"
    },
    {
      "text": "Kin, K., Agrawala, M., DeRose. T. Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation. Proc. Graphics Interface 2009, pp. 119--124. ",
      "doi": "10.5555/1555880.1555910"
    },
    {
      "text": "Lang, R.J. Computational origami: from flapping birds to space telescopes. Proc. Symp. Computational Geometry 2009, pp. 474--481.  ",
      "doi": "10.1145/1542362.1542363"
    },
    {
      "text": "Mackinlay, J.D., Robertson, G.G., Card, S.K. The Perspective Wall: Detail and context smoothly integrated. Proc. CHI 1991, pp. 173--176.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "O'Gorman, L., Katsuri, R. Document Image Analysis. IEEE Computer Society Press, 1995. ",
      "doi": "10.5555/201573"
    },
    {
      "text": "Reisman, J.L., Davidson, P.L., Han, J.Y. A screen-space formulation for 2D and 3D direct manipulation. Proc. UIST 2009, pp. 69--78.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "Szinger, J. The Foldinator modeler and document generator. Proc. Origami 3 (2002), pp. 129--135.",
      "doi": ""
    },
    {
      "text": "Tashman, C. LiquidText: active reading through multitouch document manipulation. CHI 2010 Doctoral Consortium.  ",
      "doi": "10.1145/1753846.1753895"
    },
    {
      "text": "Wang, L., Sajeev, A.S.M. Roller interface for mobile device applications. Proc. AUIC 2007, pp. 7--13. ",
      "doi": "10.5555/1273714.1273716"
    },
    {
      "text": "Westerman, W. Hand Tracking, Finger Identification, and Chordic Manipulation on a Multi-Touch Surface. PhD Dissertation (1999), U. of Delaware.",
      "doi": ""
    },
    {
      "text": "Wilson, A.D., Izadi, S., Hilliges, O., Garcia-Mendoza, A., Kirk, D. Bringing physics to the surface. Proc. UIST 2008, pp. 67--76.  ",
      "doi": "10.1145/1449715.1449728"
    }
  ]
}