{
  "doi": "10.1145/67449.67469",
  "title": "Responding to :20HUH?”: answering vaguely articulated follow-up questions",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "91-96",
  "year": 1989,
  "badges": [],
  "abstract": "Expert and advice-giving systems produce complex multi-sentential responses to user's queries. Results from analyses of novice/expert dialogues indicate that novices often do not understand an expert's response and rarely ask a well-formulated follow-up question. Thus systems must be able to provide further information in response to vaguely articulated questions. However, current systems cannot clarify misunderstood explanations or elaborate on previous explanations. In this paper we describe an approach to explanation generation that expands a system's explanatory capabilities and enables the production of clarifying or elaborating explanations in response to follow-up questions or indication that the explanation was not understood.",
  "authors": [
    {
      "name": "Johanna D. Moore",
      "institution": "Univ. of California, Los Angeles",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659552809",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Appelt, D. E. Planning Natural Language Utterances to Satisfy Multiple Goals. PhD thesis, Stanford University, 1981. ",
      "doi": "10.5555/910200"
    },
    {
      "text": "Cohen, P. R., and Levesque, H. J. Speech acts and rationality. In Proceedings of the Twenty-Third Annual Meeting of the Association for Computational Linguistics (University of Chicago, Chicago, Illinois, July 8-12 1985), pp. 49-60.  ",
      "doi": "10.3115/981210.981217"
    },
    {
      "text": "Finin, T. W., Joshi, A. K., and Webber, B. L. Natural language interactions with artificial experts. Proceedings of the IEEE 7~, 7 (July 1986).",
      "doi": ""
    },
    {
      "text": "Mann, W. C., and Matthiessen, C. Nigel: A systemic grammar for text generation. Tech. Rep. RR-83-105, USC/Information Sciences Institute, February 1983.",
      "doi": ""
    },
    {
      "text": "McCoy, K. F. Correcting Object-Related Misconceptions. PhD thesis, University of Pennsylvania, December 1985. Published by University of Pennsylvania as Technical P~eport MS-CIS-85-57. ",
      "doi": "10.5555/912419"
    },
    {
      "text": "Moore, J. D., and Paris, C. L. Constructing coherent text using rhetorical relations. In Proceedings of the Tenth Annual Conference of the Cognitive Science Society (Montreal, Quebec, August 17-19 1988).",
      "doi": ""
    },
    {
      "text": "Moore, J. D., and Swartout, W. R. A reactive approach to explanation, 17-21 July 1988. Presented at the Fourth International Workshop on Natural Language Generation.",
      "doi": ""
    },
    {
      "text": "Neches, P~., Swartout, W. R., and Moore, J. D. Enhanced maintenance and explanation of expert systems through explicit models of their development. IEEE Transactions on Software Engineering SE-11, 11 (November 1985).  ",
      "doi": "10.1109/TSE.1985.231882"
    },
    {
      "text": "Paris, C. L. The Use of Explicit User Models in Text Generation: Tailoring to a User's Level of Expertise. PhD thesis, Columbia University, October 1987. ",
      "doi": "10.5555/59843"
    },
    {
      "text": "Pollack, M. E., ttirschberg, J., and Webber, B. L. User participation in the reasoning processes of expert systems. In Proceedings of the Second National Conference ,,,, Artificial Intelligence (Pittsburgh, Pennsylvania, August 18-20 1982).",
      "doi": "10.5555/2876686.2876771"
    },
    {
      "text": "Robinson, j. J. Extending grammars to new domains. Tech. Rep. ISI/RR-83-123, USC/lnformation Sciences Institute, January 1984.",
      "doi": ""
    },
    {
      "text": "Sacerdoti, E. D. A structure for plans and behavior. Tech. l~ep. TN-109, SRI, 1975.",
      "doi": ""
    },
    {
      "text": "Sparck Jones, K. User models and expert systems. Tech. Rep. No. 61, University of Cambridge Computer Laboratory, December 1984.",
      "doi": ""
    },
    {
      "text": "Suchman, L.A. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press, Cambridge, England, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Winograd, T. Language as a Cognitive Process, vol. 1: Syntax. Addison-Wesley Publishing Company, 1983. ",
      "doi": "10.5555/1098647"
    }
  ]
}