{
  "doi": "10.1145/67449.67486",
  "title": "Statemaster: A UIMS based on statecharts for prototyping and target implementation",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "177-182",
  "year": 1989,
  "badges": [],
  "abstract": "Most User Interface Management systems are state based and some use state transition diagrams for dialog specification. Although these diagrams have significant advantages, they suffer from drawbacks that make them impractical for the specification of complex user interfaces. Statecharts are a hierarchical extension of state transition diagrams and are well suited for specification of complex user interface dialogs. Statemaster is a UIMS implemented in C + + that uses statecharts for dialog specification. It has been successfully used both for rapid prototyping and target implementation of user interfaces. This paper describes the use of statecharts for dialog specification and the implementation of Statemaster.",
  "tags": [],
  "authors": [
    {
      "name": "Pierre D. Wellner",
      "institution": "Xerox Corporation, Rochester, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048413",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ad-Cad, Ltd., \"The Languages of STATEMATE,\" internal report, Weizmann Science Park, Rehovot, Israel, 1986.",
      "doi": ""
    },
    {
      "text": "Baecker, Ronald M., and Buxton, William A. S. \"Readings in Human- Computer interaction - A Multidisciplinary Approach.\" Morgan Kaufmann, California (!987) 555-560. ",
      "doi": "10.5555/58076"
    },
    {
      "text": "Betts, Bill, et. al. \"Goals and Objectives for User Interface Software,\" Computer Graphics Vol 21, no 2 (1987) 73- 78.  ",
      "doi": "10.1145/24919.24920"
    },
    {
      "text": "Bigharn, Timothy, et. al. \"The Trillium User Study,\" Xerox Accession No. X8700086 (1987).",
      "doi": ""
    },
    {
      "text": "Goodman, Danny. \"The Complete Hypercard Handbook.\" Bantam Books, New York (1987). ",
      "doi": "10.5555/61924"
    },
    {
      "text": "Gettys, James, \"Problems Implementing Window Systems in Unix,\" Usenix Proceedings, January 1986.",
      "doi": ""
    },
    {
      "text": "Harel, David. \"On the Formal Semantics of Statecharts,\" Proceedings of the 2nd Symp. on Logic in Computer Science (1987).",
      "doi": ""
    },
    {
      "text": "Henderson, Austin. \"The Trillium User Interface Design Environment,\" in Proceedings of SIGCHI '85, ApFil (1986) 221-227.  ",
      "doi": "10.1145/22627.22375"
    },
    {
      "text": "Jacob, Robert J. K. \"A State Transition Diagram Language for Visual Programming,\" IEEE Computer Vol 18, no. 8 (1985) 51-59.",
      "doi": "10.1109/MC.1985.1662976"
    },
    {
      "text": "Waterman, Donald A. \"A Guide to Expert Systems,\" Addison-Wesley Reading, MA (1986). ",
      "doi": "10.5555/4131"
    },
    {
      "text": "Wasserman, Anthony I. \"Extending State Transition Diagrams for the Specification of Human-Computer interaction.\" IEEE Transactions on Software Engineering, 11,8 A u g u s t 1985. 699-713.  ",
      "doi": "10.1109/TSE.1985.232519"
    }
  ]
}