{
  "doi": "10.1145/67449.67505",
  "title": "Transforming text into hypertext for a compact disc encyclopedia",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "293-298",
  "year": 1989,
  "badges": [],
  "abstract": "A hypertext version of a multi-volume engineering encyclopedia on a compact disc is described. The methods for characterizing the explicit and implicit structure of the document, the novel user interface to the compact disc version, and the design and development lessons that apply to any hypertext project involving realistic amounts of text and graphics are discussed.",
  "authors": [
    {
      "name": "Robert J. Glushko",
      "institution": "Search Technology, Inc., Norcross, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351602519",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boff, K.R. The tower of Babel revisited: On crossdisciplinary chokepoints in system design. In W. B. Rouse and K. R. Boff (Eds.), System Design: Behavioral perspectives on designers, tools, and organizations. New York: Elsevier.",
      "doi": ""
    },
    {
      "text": "Boff, K.R., Kauffman, L., and Thomas, J. Handbook of perception and human performance. New York: Wiley, 1986.",
      "doi": ""
    },
    {
      "text": "Boff, K.R., and Lincoln, J.E. (1988). Engineering Data Compendium: Human Perception and Performance. AAMRL, Wright-Patterson AFB, OH.",
      "doi": ""
    },
    {
      "text": "Carr, R. New user interfaces for CD ROM. In S. Lambert and S. Ropiequet (Eds.) CD ROM: The New Papyrus. Redmond, WA: Microsoft Press, 1986, 185-196.",
      "doi": ""
    },
    {
      "text": "Conklin, J. Hypertext: An introduction and survey. Computer, 20(9), (Sept. 1987), 17-41.  ",
      "doi": "10.1109/MC.1987.1663693"
    },
    {
      "text": "Foss, C. Effective browsing in hypertext systems. User-oriented content-based text and image handling. Proceedings of the RIAO Conference, March 21-24, 1988, 83-98.",
      "doi": ""
    },
    {
      "text": "Furnas, G. Generalized fisheye views. In CHI'86 Conference Proceedings (Boston, 1988), 16-23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Glushko, R J, Weaver, M.D., Coonan, T.A., and Lincoln, J.E. (1988). \"Hypertext Engineering\": Practical methods for creating a compact disc encyclopedia. In Proceedings of the ACM Conference on Document Processing Systems, 11- 20.  ",
      "doi": "10.1145/62506.62508"
    },
    {
      "text": "Klein, G., and Brezovic, C. Human performance data needed for training device design decisions. AAMRL-TR-87-010, March 1987.",
      "doi": ""
    },
    {
      "text": "Lincoln, J.E., and Boff, KaR. (1988). Making behavioral data useful for system design applications: Development of the Engineering Data Compendium. Proceedings of the Human Factors Society 32nd Annual Meeting, 1021-1025.",
      "doi": ""
    },
    {
      "text": "Marchionini, G., and Shneiderman, B. Finding facts vs. browsing knowledge in hypertext systems. Computer 21,1 (Jan. 1988), 70-80.  ",
      "doi": "10.1109/2.222119"
    },
    {
      "text": "Oren, T. The architecture of static hypertexts. Hypertext '87 Papers. Proceedings of a conference held at the University of North Carolina, Chapel Hill. November 13-15, 1987, 291-306.  ",
      "doi": "10.1145/317426.317447"
    },
    {
      "text": "Perlman, G., and Moorhead, A. Applying hypertext methods for effective utilization of standards. Proceedings of COMPSTAN' 88 Conference on Computer Standards, IEEE.",
      "doi": ""
    },
    {
      "text": "Raymond, D., and Tompa, F. (1988, July). Hypertext and the new Oxford English Dictionary. Communications of the ACM, 31(7), 871-879.  ",
      "doi": "10.1145/48511.48517"
    },
    {
      "text": "Remde, J., Gomez, L., and Landauer, T. SuperBook: An automatic tool for information exploration -- Hypertext? Hypertext '87 Papers. Proceedings of a conference held at the University of North Carolina, Chapel Hill. November 13-15, 1987, 175-188.  ",
      "doi": "10.1145/317426.317440"
    },
    {
      "text": "Thomas, J. (1983) Psychological issues in the design of data-base query languages, in Designing for human-computer communication (M. Sime and M. Coombs, Eds.). London: Academic Press.",
      "doi": ""
    },
    {
      "text": "Walker, J. Document examiner: Delivery interface for hypertext documents. Hypertext '87 Papers. Proceedings of a conference held at the University of North Carolina, Chapel Hill. November 13-15, 1987, 307-323.  ",
      "doi": "10.1145/317426.317448"
    }
  ]
}