{
  "doi": "10.1145/67449.67511",
  "title": "Planar maps: an interaction paradigm for graphic design",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "313-318",
  "year": 1989,
  "badges": [],
  "abstract": "Compared to traditional media, computer illustration software offers superior editing power at the cost of reduced freedom in the picture construction process. To reduce this discrepancy, we propose an extension to the classical paradigm of 2D layered drawing, the map paradigm, that is conducive to a more natural drawing technique. We present the key concepts on which the new paradigm is based: a) graphical objects, called planar maps, that describe shapes with multiple colors and contours; b) a drawing technique, called map sketching, that allows the iterative construction of arbitrarily complex objects. We also discuss user interface design issues in map based illustration software.",
  "authors": [
    {
      "name": "Patrick Baudelaire",
      "institution": "Digital Equipment Corp., France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100375394",
      "orcid": "missing"
    },
    {
      "name": "Michel Gangnet",
      "institution": "Digital Equipment Corp., France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100393077",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adobe Illustrator User's Manual. Adobe Systems Inc., Palo Alto, 1987.",
      "doi": ""
    },
    {
      "text": "Freehand User's Manual. Aldus Corp., Seattle, 1987.",
      "doi": ""
    },
    {
      "text": "MacDraw Manual. Apple Computer Inc., Cupertino, 1984.",
      "doi": ""
    },
    {
      "text": "P. J. Asente. Editing Graphical Objects Using Procedural Representations. Research Report 87-6, Digital Equipment Western Research Laboratory, Palo Alto, 1987.",
      "doi": ""
    },
    {
      "text": "D. Baroni. Art Graphique Design. Editions du Ch6ne, Pads, 1987.",
      "doi": ""
    },
    {
      "text": "P. Baudelaire. Draw Manual, in Alto User' s Handbook. Technical Report, Xerox Palo Alto Research Center, Palo Alto, 1979.",
      "doi": ""
    },
    {
      "text": "P. Baudelaire. MacMap: Functional Specijications and User Interface. Technical Report, Tangram Inc., Issy-les- Moulineaux, 1986.",
      "doi": ""
    },
    {
      "text": "E. A. Bier and M. C. Stone. Snap-Dragging. ACM Computer Graphics, Vol. 20(4): 233-240, 1986.  ",
      "doi": "10.1145/15886.15912"
    },
    {
      "text": "M. Gangnet and J. C. Herr6. D2: Un 6diteur graphique interactif. In Actes des Journ~es SMgO, EyroUes, Pads, 1985.",
      "doi": ""
    },
    {
      "text": "M. Gangnet, J. C. Herr6, T. Pudet, and J. M. Van Thong. Incremental Computation of Planar Maps. 1989. Submitted for publication.",
      "doi": ""
    },
    {
      "text": "S. Horemis. Optical and Geometrical Patterns and Designs. Dover, New York, 1970.",
      "doi": ""
    },
    {
      "text": "C. P. Homung. Handbook of Designs and Devices. Dover, New York, 1946.",
      "doi": ""
    },
    {
      "text": "D. Michelucci and M. Gangnet. Saisie de plans it partir de trac6s ~ main-lev6e. In Actes de MICAD 84, Hennas, Pads, 1984.",
      "doi": ""
    },
    {
      "text": "G. Nelson. Juno, a constraint-based graphics system. ACM Computer Graphics, Vol. 19(3): 235-243, 1985.  ",
      "doi": ""
    },
    {
      "text": "K. Pier, E. Bier, and M. C. Stone. An Introduction to Gargoyle: An Interactive Illustration Tool. In Proceedings of EP'88, CUP, Cambridge, 1988. ",
      "doi": ""
    },
    {
      "text": "M. C. Stone. How to use Griffin. Internal Memo, Xerox Palo Alto Research Center, Palo Alto, 1980.",
      "doi": ""
    },
    {
      "text": "W. T. Tutte. Graph Theory. Addison-Wesley, Reading, 1984.",
      "doi": ""
    }
  ]
}