{
  "doi": "10.1145/67449.67488",
  "title": "Innovation in user interface development: obstacles and opportunities",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "191-195",
  "year": 1989,
  "badges": [],
  "abstract": "Case studies of two software development organizations suggest that common practices of these organizations pose obstacles to innovation. Although software development organizations have good reasons to be conservative and resist innovation, they recognize the importance of innovations to the competitiveness of their products. But organizations experienced at development of regularly scheduled releases are not well suited to development of innovations. In this research investigators worked with the user interface teams in two organizations while interviewing people throughout the organizations. Both organizations developed prototypes, but only small design changes were prototyped and tested early in development. Innovative changes were evaluated late, when resistance to iteration was great. User interface designs and prototypes were often not shown to users. Mechanisms for coordinating development were another conservative influence. Both organizations successfully overcame these obstacles by departing from established practices.",
  "tags": [],
  "authors": [
    {
      "name": "Steve Poltrock",
      "institution": "Microelectronics & Computer Technology Corporation, Austin, TX",
      "img": "/do/10.1145/contrib-81100102525/rel-imgonly/poltrock_greybkgrd.jpg",
      "acmid": "81100102525",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, T.J. Managing the flow of technology. MIT Press, Cambridge, Mass., 1977.",
      "doi": ""
    },
    {
      "text": "Burgelman, R.A. and Sayles, L.R. lnside corporate innovation: Strategy, structure and managerial skills. The Free Press, New York, 1986.",
      "doi": ""
    },
    {
      "text": "Curtis, B., Krasner, H., and Iscoe, N. A field study of the software design process for large systems. Communications of the A CM, 31, 11 (Nov. 1988), 1268-1287.  ",
      "doi": "10.1145/50087.50089"
    },
    {
      "text": "Gould, J.D. and Lewis, C. Designing for usability--key principles and what designers think. In Proceedings CH1 '83 Conference on Human Factors in Computing Systems (Boston, Dec. 12-15), ACM, New York, 1983, pp. 50-53.  ",
      "doi": "10.1145/800045.801579"
    },
    {
      "text": "Gould, J.D. and Lewis, C. Designing for usability--key principles and what designers think. Communications of the ACM, 28, 3 (Mar. 1985), 300-311.  ",
      "doi": "10.1145/3166.3170"
    },
    {
      "text": "Grudin, J, and Poltrock S.E. User interface design in large corporations: Coordination and communication across disciplines. In Proc. CHI'89 Human Factors in Computing Systems, this volume.  ",
      "doi": "10.1145/67449.67489"
    },
    {
      "text": "Hewett, T.T. and Meadow, C.T. On designing for usability: An application of four key principles. In Proceedings CHI '86 Human Factors in Computing Systems (Boston, April 13-17), ACM, New York, 1986, 247-252.  ",
      "doi": "10.1145/22627.22379"
    },
    {
      "text": "Kimberly, J.R. The organizational context of technological innovation, in D.D. Davis and Associates (Eds.), Managing technological innovation. Jossey-Bass, San Francisco, 1986, pp. 23-43.",
      "doi": ""
    },
    {
      "text": "Moore, W.L. and Tushman, M.L. Managing innovation over the product life cycle, in M.L. Tushman &amp; W.L. Moore (Eds.), Readings in the Management of Innovation. Ballinger, Cambridge, 1982, pp. 131-150.",
      "doi": ""
    },
    {
      "text": "Rosson, M.B., Maass, S., and Kellogg, W.A. The designer as user: Building requirements for design tools from design practice. Communications of the ACM, 31, 11 (Nov. 1988), 1288-1298.  ",
      "doi": "10.1145/50087.50090"
    },
    {
      "text": "Shneiderman, B. Designing the user interface: Strategies for effective human-computer interaction. Addison-Wesley, Reading, Mass., 1987. ",
      "doi": "10.5555/6682"
    }
  ]
}