{
  "doi": "10.1145/67449.67514",
  "title": "The effects of device technology on the usability of advanced telephone functions",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "331-337",
  "year": 1989,
  "badges": [],
  "abstract": "This paper presents a pilot study that addresses the effect that device technology has on the usability of advanced telephone functions. We prototyped telephone systems using three technologies: the current 12-button phone set, the current phone set augmented with speech synthesis, and a phone set augmented with a display and pointing device. The functions that we offered included call routing, call screening, and message retrieval. Experiments showed that a display-based phone was the fastest to use and was preferred; an interface that used voice-prompting was the slowest and least liked. This points out that future work on prompting interfaces will have to address user control and efficiency issues without causing learning/forgetting problems.",
  "authors": [
    {
      "name": "T. L. Roberts",
      "institution": "U S West Advanced Technologies, Englewood, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81405592305",
      "orcid": "missing"
    },
    {
      "name": "G. Engelbeck",
      "institution": "U S West Advanced Technologies, Englewood, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100429025",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Norman, D.A. (1986). Cognitive Engineering. In Norman, Donald A., and Stephen W. Draper (Eds), User Centered System Design, Hillsdale, NJ: Lawrence Erlbaum Associates, 31-61.",
      "doi": ""
    },
    {
      "text": "Root, R.W., &amp; Chow, C. (1987). Multimode Interaction in a Telecommunications Testbed: The Case of Memory Dialing. In G. Salvendy (Ed.), Cognitive Engineering in the Design of Human- Computer Interaction and Expert Systems Amsterdam:Elsevier, 399-406.",
      "doi": ""
    },
    {
      "text": "Wenner, D.L., &amp; Katz, J. (1988, May). Shopping for services. Telephony, 26-30.",
      "doi": ""
    },
    {
      "text": "Whiteside, J.A., Jones, S., Levy, P.S. &amp; Wixon, D. (1985). User Performance with Command, Menu, and Iconic Interfaces. Proc. CHI'85 Human Factors in Computer Systems (San Francisco, April 1985), New York:ACM, 185-191.  ",
      "doi": "10.1145/317456.317490"
    }
  ]
}