{
  "doi": "10.1145/67449.67492",
  "title": "Performance, preference, and visual scan patterns on a menu-based system: implications for interface design",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "217-222",
  "year": 1989,
  "badges": [],
  "abstract": "This study was conducted to provide evidence for the nature of visual search processes with menus, and to derive design principles for menu-based natural language (MBNL) interfaces to databases. The effects of window size, window activity, and query length were investigated. It was found that longer queries were performed faster with single active windows, but multiple active windows were rated as more 'natural'. Query times increased with query length, as did eye fixation frequencies, fixation durations, and dwell times. Errors were most likely to occur on the longest query. Fixation durations also varied with window size. However, visual behavior depended on the area being viewed and on the interaction between window activity and query length. In contrast with previous studies, it was also found that menus were not scanned randomly. However, scanpaths were less deterministic with multiple active windows and became even more unconstrained as query length increased. User interface design recommendations were derived from the findings.",
  "authors": [
    {
      "name": "Jeffrey J. Hendrickson",
      "institution": "Texas Instruments, Incorporated, Dallas, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332503731",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S. K. User perceptual mechanisms in the search of computer command menus. In Proceedings of the Conference on Human Factors in Computer System (Gaithersburg, March 15-17). ACM, New York, 1982, pp. 190-196.  ",
      "doi": "10.1145/800049.801779"
    },
    {
      "text": "Ellis, S. R., &amp; Stark, L. Statistical dependency in scanning. Human Factors 28 (1986), 421-438. ",
      "doi": "10.1177/001872088602800405"
    },
    {
      "text": "Hendrickson, J. J. Natural language human-computer dialogue: Menu-based natural language and visual performance. Doctoral Dissertation, Old Dominion University, 1988.",
      "doi": ""
    },
    {
      "text": "Hendrickson, J. J., &amp; Williams, R.D. The effect of input device on user performance with a menu-based natural language interface (TR-1224). San Diego, Naval Oceans Systems Center, 1988.",
      "doi": ""
    },
    {
      "text": "Lee, E. The optimum number of alternatives to display on an index page in an interactive Telidon database. In D. Phillips (Ed.), Telidon Behavioural Research I. Ottowa, Department of Communications, 1979.",
      "doi": ""
    },
    {
      "text": "MacGregor, J. N., &amp; Lee, E. S. Performance and preference in videotex information retreival: A review of the empirical literature. Behaviour and information Technology 6 (1987), 43-68.",
      "doi": ""
    },
    {
      "text": "MacGregor, J. N., Lee, E. S., &amp; Lam, N. Optimizing the structure of menu indexes: A decision model of menu search. In D. J. Osborne (Ed.), Contemporary ergonomics 1986. London, Taylor &amp; Francis, 1986.",
      "doi": ""
    },
    {
      "text": "Osga, G. A. Menu-based natural language query for naval command and control (TR-1006). San Diego, Naval Oceans Systems Center, 1984.",
      "doi": ""
    },
    {
      "text": "Parton, D., Huffman, K., Prigden, P., Norman, K., &amp; Shneiderman, B. Learning a menu selection tree: Training methods compared. Behaviour and Information Technology 4 (1985), 81-91.",
      "doi": ""
    },
    {
      "text": "Tennant, H. R., Ross, K. M., &amp; Thompson, C. W. Usable natural language interfaces through menu-basexl natural language understanding. In Proceedings of CHI '83 Human Factors in Computing Systems. ACM, New York, 1983, pp. 154-160.  ",
      "doi": "10.1145/800045.801601"
    },
    {
      "text": "Texas Instruments. NaturalLink Toolkit (No. 2240316- 001), 1985a.",
      "doi": ""
    },
    {
      "text": "Texas Instrtunents. NaturalLink Window Manager (No. 2240317-001), 1985b.",
      "doi": ""
    }
  ]
}