{
  "doi": "10.1145/67449.67464",
  "title": "A system for example-based programming",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "63-68",
  "year": 1989,
  "badges": [],
  "abstract": "We present an approach to programming environments that integrates syntax-directed editors with concepts borrowed from software reuse. We call our approach example-based programming, and we define it as programming using examples as visual aids or to fully or partially copy into programs. To implement an example-based programming environment, we augmented a syntax-directed editor with a window for example programs. The example programs, which are easily accessible, can be used as examples of language constructs, thus providing syntactic information through instantiations of templates, or as examples of algorithms or programs. The code in the example window can be viewed, totally or partially copied, or run. We discuss the motivation for example-based programming, describe our system implementing example-based programming in greater depth, and report on the results of an experiment to see how the system is used by programmers.",
  "tags": [],
  "authors": [
    {
      "name": "Lisa Rubin Neal",
      "institution": "Harvard Univ., Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442620233",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Biggerstaff, T. J. and Perlis, A. J. Foreword to Special Issue on Software Reusability. IEEE Transactions on Software Engineering, SE-IO No. 5, September 1984, lap 474-476.",
      "doi": ""
    },
    {
      "text": "Frakes, W.B. and Nejmeh, B.A. Software Reuse through Information Retrieval. In Proceedings of Compcon '87 (Spring), Thirty-second IEEE Computer Society International Conference, February 23-27, 1987, Cathedral Hill Hotel, San Francisco, CA, pp 380- 384.",
      "doi": ""
    },
    {
      "text": "Lang, B. On the Usefulness of Syntax Directed Editors. In Proceedings of IFIP WG2.4 International Workshop on Advanced Programming Environments, Trondheim, Norway, June 16-18, 1986. ",
      "doi": "10.5555/28265.28270"
    },
    {
      "text": "Myers, B. A. Visual Programming, Programming by Example, and Program Visualization: A Taxonomy. In Proceedings of CHI'86 Conference on Human Factors in Computing Systems (Boston, April 13- 17). ACM, Ncw York, 1986.  ",
      "doi": "10.1145/22627.22349"
    },
    {
      "text": "Neal, L. R. Cognition-Sensitive Design and User Modeling for Syntax-Directed Editors. In Procee&amp;'ngs of CHI+GI'87 Conference on Human Factors in Computing Systems and Graphics Interface (Toronto, April 5-9). ACM, New York, 1987, pp. 99-102.  ",
      "doi": "10.1145/29933.30866"
    },
    {
      "text": "Reiss, S.P. GARDEN Tools: Suptx3rt for Graphical Programming. In Proceedings of lFIP WG2.4 International Workshop on Advanced Programming Environments, Trondheim, Norway, June 16-18, 1986. ",
      "doi": "10.5555/28265.28272"
    },
    {
      "text": "Rissland, E.L. Examples and ~ing Systems. In Selfridge, Rissland, and Arbib (eds), Adaptive Control of Ill-Defined Systems, Plenum, 1983.",
      "doi": ""
    },
    {
      "text": "Soloway, E. and Erlich, K. Empirical Studies of Programming Knowledge. IEEE Transactions on Software Engineering, SE-10 No. 5, September 1984, pp 595-609.",
      "doi": "10.1109/TSE.1984.5010283"
    },
    {
      "text": "Tracz, W. Software Reuse: Motivators and Inhibitors. In Proceedings of Compcon '87 (Spring), Thirtysecond IEEE Computer Society international Conference, February 23-27, 1987, Cathedral Hill Hotel, San Francisco, CA, pp 358-363.",
      "doi": ""
    },
    {
      "text": "Teitelbaum, T. and Reps, T. The Cornell Program Synthesizer: A Syntax-Directed Programming Environment. Communications of the ACM, 24, 9 (September 1981), pp 563-573.  ",
      "doi": "10.1145/358746.358755"
    },
    {
      "text": "Waters, R. C. The Programmer's @prentice: A Session with KBEmacs. IEEE Transactions on Software Engineering, SE-11 No. 11, November 1985, pp 1296-1320.  ",
      "doi": "10.1109/TSE.1985.231880"
    },
    {
      "text": "Waters, R. C. Reuse of Cliches in the Knowledge-Based Editor. In Proceedings of IFIP WG2.4 International Workshop on Advanced Programming Environments, Trondheim, Norway, June 16-18, 1986, pp 535-549. ",
      "doi": "10.5555/28265.28296"
    }
  ]
}