{
  "doi": "10.1145/67449.67482",
  "title": "Bat brushes: on the uses of six position and orientation parameters in a paint program",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "155-160",
  "year": 1989,
  "badges": [],
  "abstract": "A geometry is described for converting hand position and orientation into six useful variables for computer input. The application is that of controlling form and color in an experimental computer “paint” program. We find that the most easily controlled parameters of hand placement are x,y and z cartesian coordinates and a twist parameter which approximates the wrist action that occurs when a dial is turned.The two remaining parameters are horizontal and vertical wrist rotations. In order to capture these it is necessary to correct for the rotation about the elbow which naturally occurs when the hand is translated. However, these two parameters are difficult to control independently of hand translations. Computer paint “brushes” are described which allow the real-time control of size, color and position on the screen using the hand parameters described.",
  "authors": [
    {
      "name": "Colin Ware",
      "institution": "Univ. of New Brunswick, New Brunswick, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502733341",
      "orcid": "missing"
    },
    {
      "name": "Curtis Baxter",
      "institution": "Univ. of New Brunswick, New Brunswick, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100207485",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Badler, N.I., Manoochehri, K.H., and Baraff, D. (1984) Multi-Dimensional Input Techniques and Articulated Figure Positioning by Multiple Constraints. Proceedings of 1986 Workshop on Interactive 3D Graphics. F. Crow and S.M. Pizar, Eds, Chapel Hill, NC, October. 151-170.  ",
      "doi": "10.1145/319120.319132"
    },
    {
      "text": "Bolt, R.A., (1984) The Human Interface, Lifetime Learning Publications, Belmont, CA.",
      "doi": ""
    },
    {
      "text": "Bleser, T.W., Sibert, J.L., and McGee, J.P., (1988) Charcoal Sketching: Returning Control to the Artist, ACM Transaction on Graphics, 7, 1, 76-81.  ",
      "doi": "10.1145/42188.42230"
    },
    {
      "text": "Buxton, W, Hill, R., and Rowley, P, (1985) Issues and Techniques in Touch-Sensitive Tablet Input. Computer Graphics, 19, 3, 215-224.  ",
      "doi": "10.1145/325165.325239"
    },
    {
      "text": "Das, B., and Grady, R.M. (1983), The normal working area in the horizontal plane. Ergonomics, 26, 449- 459.",
      "doi": ""
    },
    {
      "text": "Pheasant, S. (1986), Bodyspace: Anthropometry, Ergonomics and Design, Taylor and Francis, Philadelphia,",
      "doi": ""
    },
    {
      "text": "Schmandt, C. (1983), Spatial Input, Display Correspondence in a stereoscopic Computer Graphic Workstation. Computer Graphics, 1, 3, 253-257.  ",
      "doi": "10.1145/800059.801156"
    },
    {
      "text": "Strassman, S, (1986) Hairy Brushes, Computer Graphics, 20, 4, 225-232.  ",
      "doi": "10.1145/15886.15911"
    },
    {
      "text": "Ware, C. and Jessome, D., (1988). Using the Bat: A Six-Dimensional Mouse for Object Placement., IEEE Computer Graphics and Application, (in press; November issue).  ",
      "doi": "10.1109/38.20319"
    }
  ]
}