{
  "doi": "10.1145/67449.67518",
  "title": "Helgon: extending the retrieval by reformulation paradigm",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "357-362",
  "year": 1989,
  "badges": [],
  "abstract": "People who attempt to use a complex information store on a computer encounter a number of problems: They do not know what information exists or how to find information, they get no support in articulating a question, and they are unable to phrase their question in terms that the system understands. Helgon, an intelligent environment that supports limited cooperative problem solving, helps people deal with complex information stores. Helgon supports retrieval and editing by reformulation with multiple specification techniques, and it acquaints the user with the system model of the information store. Within the current Helgon system, a number of different information stores have been implemented. Empirical evaluations have shown that Helgon supports effective communication. In addition, the evaluations have shown interesting extensions for future work.",
  "authors": [
    {
      "name": "Gerhard Fischer",
      "institution": "Univ. of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409592298",
      "orcid": "missing"
    },
    {
      "name": "Helga Nieper-Lemke",
      "institution": "Univ. of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100380715",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S.W. Draper. The Nature of Expertise in UNIX. Proceedings of INTERACT84, IFIP Conference on Human-Computer Interaction, Elsevier Science Publishers, Amsterdam, September, 1984, pp. 182-186.",
      "doi": ""
    },
    {
      "text": "G. Fischer. Cognitive View of Reuse and Redesign. IEEE Software, Special Issue on Reusability 4, 4 (July 1987), 60-72.",
      "doi": ""
    },
    {
      "text": "G. Fischer. Mental Models -- A Computer Scientist's Point of View. In A.A. Turner (Ed.), Mental Models and User-Centered Design, Workshop Report (Breckenridge, CO), Institute of Cognitive Science, University of Colorado, Boulder, CO, Technical Report, No. 88-9, 1988, pp. 15-26.",
      "doi": ""
    },
    {
      "text": "G. Fischer, W. Kintsch. Theories, Methods and Tools for the Design of User-Centered Systems. Department of Computer Science, University of Colorado, Boulder, CO, 1986.",
      "doi": ""
    },
    {
      "text": "P.W. Foltz, W. Kintsch. An Empirical Study of Retrieval by Reformulation on HELGON. In A.A. Turner (Ed.), Mental Models and User-Centered Design, Workshop Report (Breckenridge, CO), Institute of Cognitive Science, University of Colorado, Boulder, CO, Technical Report, No. 88-9, 1988, pp. 9-14.",
      "doi": ""
    },
    {
      "text": "G.W. Furnas, T.K. Landauer, L.M. Gomez, S.T. Dumais. The Vocabulary Problem in Human-System Communication. Communications of the ACM 30, 11 (November 1987), 964-971.  ",
      "doi": "10.1145/32206.32212"
    },
    {
      "text": "F.G. Halasz. Reflections on NoteCards: Seven Issues for the Next Generation of Hypermedia Systems. Communications of the ACM31, 7 (July 1987), 836-852.  ",
      "doi": "10.1145/48511.48514"
    },
    {
      "text": "M.C. Mozer. Inductive Information Retrieval Using Parallel Distributed Computation. ICS Report 8406, Institute for Cognitive Science, University of California, San Diego,La Jolla, CA, June, 1984.",
      "doi": ""
    },
    {
      "text": "H. Nieper-Lemke. TRISTAN, ein generischer Editor fuer gei-ichtete Graphen. In R. Gunzenhaeuser, H.-D. Boecker (Eds.), Prototypen benutzer gerechter Computersysteme, Walter de Gruyter, Berlin - New York, 1988, pp. 243-257.",
      "doi": ""
    },
    {
      "text": "D.A. Norman, D.G. Bobrow. Descriptions: An Intermediate Stage in Memory Retrieval. Cognitive Psychology 11 (1979), 107-123.",
      "doi": ""
    },
    {
      "text": "P.F. Patel-Schneider. Small Can Be Beautiful in Knowledge Representation. AI Technical Report 37, SchlumbergerPalo Alto Research, October, 1984.",
      "doi": ""
    },
    {
      "text": "P.F. Patel-Schneider, R.J. Brachman, H.J. Levesque. ARGON: Knowledge Representation Meets Information Retrieval. Fairchild Technical Report 654, Schlumberger Palo Alto Research, September, 1984.",
      "doi": ""
    },
    {
      "text": "J.H. Walker. Document Examiner: Delivery Interface for Hypertext Documents. Hypertext 87 Papers, University of North Carolina, Chapel Hill, NC, November, 1987, pp. 307-323.  ",
      "doi": "10.1145/317426.317448"
    },
    {
      "text": "B.L. Webber, T.W. Finin. In Response: Next Steps in Natural Language Interaction. InW. Reitman (Ed.), Artificial Intelligence Applications for Business, Ablex Publishing Corporation, Norwood, NJ, 1984, Chap. 12, pp. 211-234.",
      "doi": ""
    },
    {
      "text": "M.D. Williams. What Makes RABBIT Run? International Journal of Man-Machine Studies 21 (1984), 333-352.  ",
      "doi": "10.1016/S0020-7373%2884%2980052-8"
    },
    {
      "text": "M.D. Williams, F.N. Tou, R. Fikes, A. Henderson, T.W. Malone. RABBIT: Cognitive Science in Interface Design. Proceedings of the 4th Annual Conference of the Cognitive Science Society (Ann Arbor, MI), Cognitive Science Society, August, 1982, pp. 82-85.",
      "doi": ""
    },
    {
      "text": "J. Yen, R. Neches, M. DeBellis. Specification by Reformulation: A Paradigm for Building Integrated User Support Environments. Proceedings of AAA1-88, Seventh National Conference on Artificial Intelligence (St. Paul, MN), Morgan Kaufmann Publishers, San Mateo, CA, 1988, pp. 814-818.",
      "doi": ""
    }
  ]
}