{
  "doi": "10.1145/67449.67494",
  "title": "Synergistic use of direct manipulation and natural language",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "227-233",
  "year": 1989,
  "badges": [],
  "abstract": "This paper shows how the integration of natural language with direct manipulation produces a multimodal interface that overcomes limitations of these techniques when used separately. Natural language helps direct manipulation in being able to specify objects and actions by description, while direct manipulation enables users to learn which objects and actions are available in the system. Furthermore, graphical rendering and manipulation of context provides a partial solution to difficult problems of natural language anaphora.",
  "authors": [
    {
      "name": "P. R. Cohen",
      "institution": "SRI International, Menlo Park, CA",
      "img": "/do/10.1145/contrib-81100149852/rel-imgonly/81100149852.jpg",
      "acmid": "81100149852",
      "orcid": "missing"
    },
    {
      "name": "M. Dalrymple",
      "institution": "SRI International, Menlo Park, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493697",
      "orcid": "missing"
    },
    {
      "name": "D. B. Moran",
      "institution": "SRI International, Menlo Park, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100516225",
      "orcid": "missing"
    },
    {
      "name": "F. C. Pereira",
      "institution": "SRI International, Menlo Park, CA",
      "img": "/do/10.1145/contrib-81100147733/rel-imgonly/81100147733.jpg",
      "acmid": "81100147733",
      "orcid": "missing"
    },
    {
      "name": "J. W. Sullivan",
      "institution": "Lockheed Missiles and Space Co, Menlo Park, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81536964456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S. Brennan, M. Friedman, and C. Pollard. A centering approach to pronouns. In Proceedings of the 25th Annual Meeting of the Association for Computational Linguistics, Stanford, California, 1987.  ",
      "doi": "10.3115/981175.981197"
    },
    {
      "text": "E. Charniak. Jack and Janet in search of a theory of knowledge. In Advance Papers of the Third Meeting of the International Joint Conference on Artificial Intelligence, William Kaufman, Inc., Los Altos, California, 1973.",
      "doi": ""
    },
    {
      "text": "K. Church and R. Patil. Coping with syntactic ambiguity or how to put the block in the box on the table. American Journal of Computational Linguistics, 8(3-4):139 - 149, 1982. ",
      "doi": "10.5555/972942.972946"
    },
    {
      "text": "M. Dalrymple. The interpretation of tense and aspect in English. In Proceedings of the 26th Annual Meeting of the Association for Computational Linguistics, Buffalo, New York, 1988.  ",
      "doi": "10.3115/982023.982032"
    },
    {
      "text": "B. J. Grosz. Focusing and description in natural language dialogues, In Elements of Discourse Understanding, Cambridge University Press, 1981.",
      "doi": ""
    },
    {
      "text": "B.J. Grosz, A.K. Joshi, and S. Weinstein. Providing a unified account of definite noun phrases in discourse. In Proceedings of the 21st Annual Meeting of the Association for Computational Linguistics, Cambridge, Massachusetts, 1983.  ",
      "doi": "10.3115/981311.981320"
    },
    {
      "text": "P. J. Hayes. Using a knowledge base to drive an expert system interface with a natural language component. In J. A. Hendler, editor, Expert Systems: The User Interface, pages 153 - 182, Ablex, Norwood, NJ, 1988. ",
      "doi": "10.5555/40529.40537"
    },
    {
      "text": "J. lZ. Hobbs and P. Martin. Local pragmatics. In Proceedings of the Ninth International joint Conference on Artificial Intelligence, Morgan Kaufman Publishers, Los Altos, California, August 1987.",
      "doi": ""
    },
    {
      "text": "J.R. Hobbs. Resolving pronoun reference. Lingua, 44, 1978.",
      "doi": "10.5555/21922.24343"
    },
    {
      "text": "R.A. Gargan Jr., J.W. Sullivan, and S.W. Tyler. Multimodal response planning: an adaptive rule based approach. In CH11988 Proceedings, May 1988.  ",
      "doi": "10.1145/57167.57206"
    },
    {
      "text": "J.G. Neal and S.C. Shapiro. intelligent multi-media interface technology. In Architectures for Intelligent interfaces: Elements and Prototypes, Monterey, CA, March 1988.",
      "doi": ""
    },
    {
      "text": "F.C.N. Pereira. Can drawing be liberated from the Von Neumann style? Proceedings of the 1983 A CM Database Week, A CM, 1983.  ",
      "doi": "10.1145/647004.711880"
    },
    {
      "text": "F.C.N. Pereira. Logic for natural language analysis. SRI Technical Note #275, Artificial Intelligence Center, SRI International, Menlo Park, Calif.",
      "doi": ""
    },
    {
      "text": "It. Reichman. Plain-speaking: A theory and grammar of spontaneous discourse. Ph.D. thesis, Department of Computer Science, Harvard University, 1981.",
      "doi": ""
    },
    {
      "text": "C.L. Sidner. Towards a computational theory of definite anaphora comprehension in English discourse. Technical Report 537, Artificial Intelligence Laboratory, Massachusetts Institute of Technology, 1979. ",
      "doi": "10.5555/889484"
    },
    {
      "text": "H. R. Tennant, K. M. Ross, R. M. Saenz, C. W. Thompson, and J. R. Miller. Menubased natural language understanding. In Proceedings of the 21st Annual Meeting of the Association for Computational Linguistics, pages 151- 158, Cambridge, Massachusetts, June 1983.  ",
      "doi": "10.3115/981311.981341"
    },
    {
      "text": "S.W. Tyler, R.A. Gargan Jr., and J.W. Sullivan. Adaptation and response planning: elements of an intelligent interface architecture. In Third Annual Rocky Mountain Conference Proceedings, June 1988.",
      "doi": ""
    },
    {
      "text": "W. Wahlster. User and discourse models for multimodal communication. In J.W. Sullivan and S.W. Tyler, editors, Architectures for Intelligent Interfaces\" Elements and Prototypes, Addison-Wesley, Palo Alto, CA, 1989.",
      "doi": ""
    },
    {
      "text": "D. Warren and F. Pereira. An efficient easily adaptable system for interpreting natural language queries. American Journal of Computational Linguistics, 8(3):110- 123, 1982. ",
      "doi": "10.5555/972942.972944"
    }
  ]
}