{
  "doi": "10.1145/67449.67485",
  "title": "A programming language basis for user interface",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "171-176",
  "year": 1989,
  "badges": [],
  "abstract": "The Mickey UIMS maps the user interface style and techniques of the Apple Macintosh onto the declarative constructs of Pascal. The relationships between user interfaces and the programming language control the interface generation. This imposes some restrictions on the possible styles of user interfaces but greatly enhances the usability of the UIMS.",
  "authors": [
    {
      "name": "D. R. Olsen",
      "institution": "Brigham Young Univ., Provo, UT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410595121",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Foley, J., Gibbs, C., Kim, W. C. and Kovacevic, S. A Knowledge-based User Interface Management System. CHI'88 Proceedings (May 1988).  ",
      "doi": "10.1145/57167.57178"
    },
    {
      "text": "Jacob, R.J.K. A State Transition Diagram Language for Visual Programming. IEEE Computer. 18, 8 (August 1985).",
      "doi": ""
    },
    {
      "text": "Kasik, D.J. A User interface Management System. Computer Graphics 16, 3 (July 1982).  ",
      "doi": "10.1145/965145.801268"
    },
    {
      "text": "Olsen, D.R. and Dempsey, E.P. SYNGRAPH: A Graphic User Interface Generator. Computer Graphics 17, 3 (July 1983).  ",
      "doi": "10.1145/964967.801131"
    },
    {
      "text": "Olsen, D.R. Push-down Automata for User Interface Management. ACM Transactions on Graphics. 3, 4 (July 1984).  ",
      "doi": "10.1145/3870.3871"
    },
    {
      "text": "Olsen, D.R. MIKE:The Menu Interaction Kontrol Environment. ACM Transactions on Graphics 5,4 (Oct 1986).  ",
      "doi": "10.1145/27623.28868"
    },
    {
      "text": "Olsen, D. R. and Dance, J. R. Macros by Example in a Graphical UIMS. IEEE Computer Graphics and Applications 8, 1 (Jan 1988).  ",
      "doi": "10.1109/38.491"
    },
    {
      "text": "Olsen, D. R. and Halversen, B. W. Interface Usage Measurements in a User Interface Management System. ACM SIGGRAPH Symposium on User Interface Software (Oct 1988).  ",
      "doi": "10.1145/62402.62420"
    },
    {
      "text": "Schmucker, K. J. MacApp: An Application Framework, Byte 11, 8 (Aug 1986).",
      "doi": ""
    }
  ]
}