{
  "doi": "10.1145/67449.67457",
  "title": "Collaboration in KMS, a shared hypermedia system",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "37-42",
  "year": 1989,
  "badges": [],
  "abstract": "This paper describes how we use a hypermedia system (KMS) for our collaborative work. Based on our experience with KMS and our previous research with the ZOG system at Carnegie Mellon University, we believe that a shared-database hypermedia system provides a powerful foundation for collaboration. In this paper, we show how the shared-database capability of KMS, plus particular aspects of its data model, address six of the fundamental issues facing designers of collaborative work systems.",
  "authors": [
    {
      "name": "E. Yoder",
      "institution": "Knowledge Systems Incorporated, Murrysville, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332537065",
      "orcid": "missing"
    },
    {
      "name": "R. Akscyn",
      "institution": "Knowledge Systems Incorporated, Murrysville, PA",
      "img": "/do/10.1145/contrib-81100120280/rel-imgonly/robakscyn.jpg",
      "acmid": "81100120280",
      "orcid": "missing"
    },
    {
      "name": "D. McCracken",
      "institution": "Knowledge Systems Incorporated, Murrysville, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100018231",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akscyn, R., McCracken, D. and Yoder, E. KMS: A Distributed Hypermedia System for Managing Knowledge in Organizations. Commun. ACM, 31(7), July 1988, 820-835.  ",
      "doi": "10.1145/48511.48513"
    },
    {
      "text": "Akscyn, R., Yoder, E., and McCracken, D. The Data Model is the Heart of Interface Design. Proceedings of CHl '88, ACM, Washington D.C., May 1988.  ",
      "doi": "10.1145/57167.57186"
    },
    {
      "text": "Conklin, J. A Survey of Hypertext. IEEE Computer, 20 (9), September 1987, 17-41.  ",
      "doi": "10.1109/MC.1987.1663693"
    },
    {
      "text": "Delisle, N. and Schwartz, M. Contexts--A Partitioning Concept for H~xt. Proceedings of the Conference on Computer-Supported Cooperative Work, Austin, TX, December 1986, 147-152.  ",
      "doi": "10.1145/637069.637088"
    },
    {
      "text": "Engelbart, D.C. Authorship provisions in Augment. In Proceedings of the IEEE COMPCON (San Francisco, CA, Spring). IEEE, NewYork, 1984, 465-472.",
      "doi": ""
    },
    {
      "text": "Garrett, L., Smith, K., and Meyrowitz, N. Intermedia: Issues, Strategies, and Tactics in the Design of a Hygermedia Document System. Proceedings of the Conference on Computer-Supported Cooperative Work, Austin, TX, December 1986, 163-174.  ",
      "doi": "10.1145/637069.637090"
    },
    {
      "text": "Greif, I., and Satin, S. Data Sharing in Group Work. ACM Trans. Office Information Systems, 5(2), 1987, 187-211.  ",
      "doi": "10.1145/27636.27640"
    },
    {
      "text": "Halasz, F. Reflections on NoteCards: Seven Issues for the Next Generation of Hypermedia Systems. Commun. ACM, 31(7), July 1988, 836-852.  ",
      "doi": "10.1145/48511.48514"
    },
    {
      "text": "McCracken, D. and Akscyn, R. Experience with the ZOG Human-Computer Interface System. International Journal of Man-Machine Studies, 21, 1984, 293-310.  ",
      "doi": "10.1016/S0020-7373%2884%2980050-4"
    },
    {
      "text": "Jarrell, N. and Barrett, B. Network-based Systems for Asynchronous Group Communication. Proceedings of the Conference on Computer-Supported Cooperative Work, Austin, TX, December 1986, 184-191.  ",
      "doi": "10.1145/637069.637093"
    },
    {
      "text": "Proceedings of Hypertext '87. University of North Carolina, Chapel Hill, NC, November 1987.",
      "doi": ""
    },
    {
      "text": "Trigg, R., Suchman, L., and Halasz, F. Supporting Collaboration in Notecards. Proceedings of the Conference on Computer-Supported Cooperative Work, Austin, TX, December 1986, 153-162.  ",
      "doi": "10.1145/637069.637089"
    },
    {
      "text": "Winograd, T. A Language/Action Perspective on the Design of Cooperative Work. Human-Computer Interaction, 3 (1), 1987-1988, 3-30.",
      "doi": ""
    }
  ]
}