{
  "doi": "10.1145/67449.67476",
  "title": "A high-level user interface management system",
  "published": "1989-03-01",
  "proctitle": "CHI '89: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "133-138",
  "year": 1989,
  "badges": [],
  "abstract": "A high-level UIMS which automatically generates the lexical and syntactic design of graphical user interfaces is presented. The interfaces generated by the UIMS can easily and rapidly be refined by the designer by using highly interactive and graphical facilities. The UIMS accepts a high-level description of the semantic commands supported by the application, a description of the implementation device, and optionally, the end user's preferences. Based on these inputs the UIMS generates graphical user interfaces in which the commands are selected from menus and command arguments are provided through interaction with graphical interaction techniques.",
  "authors": [
    {
      "name": "Gurminder Singh",
      "institution": "National Univ. of Singapore, Kent Ridge",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100278882",
      "orcid": "missing"
    },
    {
      "name": "Mark Green",
      "institution": "Univ. of Alberta, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332501956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Shi-Kuo Chang, Visual Languages: A Tutorial and Survey, IEEE Software 4, 1 (Jan. 1987), 29-39.]]",
      "doi": ""
    },
    {
      "text": "Mark A. Flecchia and Daniel R. Bergeron, Specifying Complex Dialogs in ALGAE, Proc. CHI+GI'87 Human Factors in Computing Systems, Toronto, Ont., Canada, Apr. 5-9, 1987, 229-234.]]  ",
      "doi": "10.1145/29933.275635"
    },
    {
      "text": "james D. Foley, Christina Gibbs, Won Chul Kim and Srdjan Kovacevic, A Knowledge-Based User Interface Management System, Proc. CHI'88 Human Factors in Computer Systems, Washington, D.C., May 15-19, 1988, 67-72.]]  ",
      "doi": "10.1145/57167.57178"
    },
    {
      "text": "Mark Green, The University of Alberta User Interface Management System, Computer Graphics 19, 3 (July 1985), 205-213. (t~oc. SIGGRAPH'85 Conf., July 22-26, 1985, San Francisco, California).]]  ",
      "doi": "10.1145/325165.325286"
    },
    {
      "text": "Mark Green, A Survey of Three Dialogue Models, ACM Transactions on Graphics 5, 3 (July 1986), 244-275.]]  ",
      "doi": "10.1145/24054.24057"
    },
    {
      "text": "Alan MacDonald, Visual Programming, Datamation 28, 11 (1982), 132-140.]]",
      "doi": ""
    },
    {
      "text": "Brad A. Myers, Visual Programming, Programming by Example, and Program Visualization: A Taxonomy, Proc. CHI'86 Human Factors in Computing Systems, Boston, MA, Apr. 13-17, 1986, 59-66.]]  ",
      "doi": "10.1145/22627.22349"
    },
    {
      "text": "Dan R. Olsen, William A. S. Buxton, R. Ehrich, David Kasik, James Rhyne and John Sibert, A Context for User Interface Management, IEEE Computer Graphics and Applications 4, 12 (De~. 1984), 33-42.]]",
      "doi": ""
    },
    {
      "text": "Dan R. Olsen, MIKE: The Menu Interaction Kontrol Environment, ACM Transactions on Graphics 5, 4 (Oct. 1986), 318-344.]]  ",
      "doi": "10.1145/27623.28868"
    },
    {
      "text": "Gurminder Singh and Mark Green, Automatic Generation of Graphical User Interfaces, Proc. Graphics Interface '86, Vancouver, B.C., May 26- 30, 1986, 71-76.]] ",
      "doi": "10.5555/16564.16578"
    },
    {
      "text": "Gurminder Singh and Mark Green, Visual Programming of Graphical User Interfaces, Proc. 1987 Workshop on Visual Languages, Linkoping, Sweden, Aug. 19-21, 1987, 161-173.]]",
      "doi": ""
    },
    {
      "text": "Gurminder Singh and Mark Green, vu - visual userinterface design workshop, Graphics Interface '88 - Film Show, Edmonton, Alberta, Canada, June 6-10, 1988, video tape.]]",
      "doi": ""
    },
    {
      "text": "Gurminder Singh and Mark Green, Designing the Interface Designer's Interface, Proc. ACM SIGGRAPH Sy~sium on User Interface Software, Banff, Alberta, Canada, Oct. 17-19, 1988, 109-116.]]  ",
      "doi": "10.1145/62402.62422"
    },
    {
      "text": "Gurminder Singh, Automating the Lexical and Syntactic Design of Graphical User interfaces, Ph.D. Thesis, Dept. of Computing Science, University of Alberta, Edmonton, Canada, 1989.]] ",
      "doi": "10.5555/915928"
    },
    {
      "text": "Peter Tanner and William A. S. Buxton, Some Issues in Future User Interface Management System (UIMS) Development, in User Interface Management Systems, Gunther E. Pfaff (ed.), Springer-Verlag, 1985, 67-80.]]",
      "doi": ""
    },
    {
      "text": "James J. Thomas and Griffith Hamlin, eds., Graphics Input Interaction Technique (G I IT) Workshop Summary, June 2-4, 1982, Battelle Seattle, Computer Graphics 17, 1 (Jan. 1983), 5-66.]]",
      "doi": ""
    }
  ]
}