{
  "doi": "10.1145/22627.22362",
  "title": "Defining constraints graphically",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "137-143",
  "year": 1986,
  "badges": [],
  "abstract": "A number of constraint-oriented, interactive graphical systems have been constructed. A typical problem in such systems is that, to define a new kind of constraint, the user must leave the graphical domain and write code in the underlying implementation language. This makes it difficult for less experienced users to add new kinds of constraints. As a step toward solving this problem, the system described here allows the graphical definition of constraints. An interface has been built in which a user can conveniently construct a new kind of object, annotating it with the relations that it must obey.",
  "tags": [],
  "authors": [
    {
      "name": "Alan Borning",
      "institution": "Department of Computer Science, FR-35, University of Washington, Seattle, Washington",
      "img": "/do/10.1145/contrib-81100164129/rel-imgonly/alan.jpg",
      "acmid": "81100164129",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boming, A.H. ThingLab -- A Constraint- Oriented Simulation Laboratory. PhD thesis, Stanford, March, 1979. A revised version is published as Xerox Palo Alto Research Center Report SSL-79-3 (July 1979).]]",
      "doi": ""
    },
    {
      "text": "Borning, A.H. The Programming language Aspects of Thingl~b, A Constraint-Oriented Simulation Laboratory. ACM Transactions on Programming Languages and Systems 3(4):353-387, October, 1981.]]  ",
      "doi": "10.1145/357146.357147"
    },
    {
      "text": "Christensen, C. On the Implementation of AMBIT, a Language for Symbol Manipulation. Communications of the ACM 9(8):570-573, August, 1966.]]  ",
      "doi": "10.1145/365758.365765"
    },
    {
      "text": "Curry, G.A. Programming by Abstract Demonstration. PhD thesis, University of Washington, 1978. Published as UW Technical Report 78-03-02.]] ",
      "doi": "10.5555/908177"
    },
    {
      "text": "Ellis, T.O., Haefner, J.F., and Sibley, W.L. The GRAIL Project: An Experiment in Man-Machine Communication. Technical Report RM-5999-ARPA, The RAND Corporation, 1969.]]",
      "doi": ""
    },
    {
      "text": "Glinert, E.P. PICT: Experiments in the Design of Interactive, Graphical Programming Environments. Phi) thesis, University of Washington, 1985.]] ",
      "doi": "10.5555/911880"
    },
    {
      "text": "Goldberg, A.J., and Robson, D. Smalltalk-80: The Language and its Implementation. Addison-Wesley, 1983.]] ",
      "doi": "10.5555/273"
    },
    {
      "text": "Gosling, J. Algebraic Constraints. PhD thesis, Carnegie-Mellon University, May, 1983. Published as CMU ComputeT Science Department tech report CMU- CS-83-132.]] ",
      "doi": "10.5555/911102"
    },
    {
      "text": "Gould, L., and Finzer, W. Programming by Rehearsal. Technical Report SCL--84-1, Xerox Palo Alto Rese.areh Center, May, 1984.]]",
      "doi": ""
    },
    {
      "text": "Gould, L., and Finzer, W. Programming by Rehearsal. Byte 9(6): 187-210, June, 1984.]]",
      "doi": ""
    },
    {
      "text": "Halbert, D. Programming by Example. Phi) thesis, University of California, Berkeley, 1984. Published as Technical Retxm OSD-T8402, Office Systems Division, Xerox Corlx~tion, Palo Alto, CA.]] ",
      "doi": "10.5555/911909"
    },
    {
      "text": "Leler, W. Specification and Generation of Constraint Satisfaction Systems Using Augmented Term Rewriting. Forthcoming PhD thesis, Computer Science Department, University of North Carolina at Chapel Hill. 1986.]] ",
      "doi": "10.5555/37573"
    },
    {
      "text": "Levitt, D. Machine Tongues X: Constraint Languages. Computer Music Journal 8(1):9-21, Spring, 1984.]]",
      "doi": ""
    },
    {
      "text": "Nelson, G. Juno, A Constraint-Based Graphics System. In Barsky, B.A. (editor), SIGGRAPH '85 Conference Proceedings, pages 235-243. ACM, San Francisco, July, 1985.]]  ",
      "doi": "10.1145/325334.325241"
    },
    {
      "text": "Smith, D.C. PYGMALION: A Creative Programming Environment. Phi) thesis, Stanford, 1975. Published as Stanford Computer Science Department Report STAN-CS-75-499.]] ",
      "doi": "10.5555/907074"
    },
    {
      "text": "Steele, G.L. The Definition and Implementation of a Computer Programming Language Based on Constraints. PhD thesis, MIT, August, 1980. Published as Mrr-AI TR 595, August 1980.]] ",
      "doi": "10.5555/889490"
    },
    {
      "text": "Sutherland, I. Sketchpad: A Man-Machine Graphical Communication System. Phi) thesis, MIT, 1963.]]",
      "doi": ""
    },
    {
      "text": "Sutherland, W. On-Line Graphical Specifications of Computer Procedures. Phi) thesis, MIT, 1966.]]",
      "doi": ""
    },
    {
      "text": "Van Wyk, C. A Language for Typesetting Graphics. PhD thesis, Stanford, June, 1980.]] ",
      "doi": "10.5555/909348"
    }
  ]
}