{
  "doi": "10.1145/22627.22342",
  "title": "Generalized fisheye views",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "16-23",
  "year": 1986,
  "badges": [],
  "abstract": "In many contexts, humans often represent their own “neighborhood” in great detail, yet only major landmarks further away. This suggests that such views (“fisheye views”) might be useful for the computer display of large information structures like programs, data bases, online text, etc. This paper explores fisheye views presenting, in turn, naturalistic studies, a general formalism, a specific instantiation, a resulting computer program, example displays and an evaluation.",
  "authors": [
    {
      "name": "George W. Furnas",
      "institution": "Bell Communications Research, 435 South St., Morristown, New Jersey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100649937",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Robertson, G., D. McCracken and A. Newetl The ZOG approach to man-machine communication, Technical Report CMU-CS-97-148, Department of Computer Soience, Carnegie Mellon University, Pittsburgh, PA, 1979.",
      "doi": ""
    },
    {
      "text": "D.C. Englebart and W. K. English, A research center for augmenting human intellect, AFIPS Conference Proceedings, Vol. 33, 1968, 15ff. Also SRI-ARC Catalog item 3954.",
      "doi": "10.1145/1476589.1476645"
    },
    {
      "text": "Alberga, C. N., A. L. Brown, G. B. Leeman, M. Mikelsons and M. N. Wegman, A program development tool, IBM Research Report, Computer Science Department, IBM Thomas J. Watson Research Center, Yorktown Heights, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Horton, M. Design of a Multi Language Editor, Doctoral Thesis, U. C. Berkeley Computer Sc/ence, 1981. ",
      "doi": "10.5555/910283"
    },
    {
      "text": "Mikelsons, M., IBM Research Report, Computer Science Departn'mnt, IBM Thomas J. Watson Research Center, Yorktown Heights, New York.",
      "doi": ""
    },
    {
      "text": "Teslar, L, The Smalltalk Environment, BYTE, 6, 1981, 90-147.",
      "doi": ""
    },
    {
      "text": "Nelson, T. Compuler Lib Hugo's Book Source: Chicago, IL, 1974.",
      "doi": ""
    },
    {
      "text": "Farrar~, W. A. Information Display in Interactive Design, Doctoral Thesis, Department of Engineering, University of California at Los Angeles, 1973.",
      "doi": ""
    }
  ]
}