{
  "doi": "10.1145/22627.22372",
  "title": "Comparison of elderly and younger users on keyboard and voice input computer-based composition tasks",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "205-211",
  "year": 1986,
  "badges": [],
  "abstract": "An experiment was run in which elderly and younger people used a keyboard editor and a simulated listening typewriter to compose letters. Performance was measured and participants rated the systems used.\nOur general conclusions were as follows:\nThere are no major differences in performance between elderly computer users and their younger counterparts in carrying out a computer-based composition task.Elders appear to be more enthusiastic users of computer systems than are younger people. This is shown by preference ratings, behavioral observations, and post-experimental debriefings.Voice input does not improve performance on composition tasks, but it is greatly preferred over the traditional keyboard input method.",
  "tags": [],
  "authors": [
    {
      "name": "Virginia Z. Ogozalek",
      "institution": "Worcester Polytechnic Institute, Worcester, Massachusetts",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100095387",
      "orcid": "missing"
    },
    {
      "name": "John Van Praag",
      "institution": "Digital Equipment Corporation, Nashua, New Hampshire",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100624680",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chin, K , \"The Elderly Learn to Compute\" Infoworid, May 7, 1984, pp. 24-28.",
      "doi": ""
    },
    {
      "text": "Gould, J , \"How Experts Dictate\" Journal of E~Periment al Psychology- Huma~n Percevtion and perf0~ance, 1978, Voi. 23, No.5, pp. 648-661.",
      "doi": ""
    },
    {
      "text": "Gould, J. and Boies,S., \"Wrlting, Dictating, and Speaking Letters\" Science Sept 22 1978 pp.I145-I147.",
      "doi": ""
    },
    {
      "text": "Gould ,J. and Boies,S., \"How Authors Think about Their Writing, Dictating, and Speaking\", Ruman Factor.ss, 1978, Vol. 20, No.4, pp.495-505,",
      "doi": ""
    },
    {
      "text": "Gould ,J., \"Composing Letters with Computer-Based Text Editors\" Human Factors, 1981 Vol 23 No. 5, pp ~ 593-606.",
      "doi": ""
    },
    {
      "text": "Gould,J., Conti,J. and Hovanyecz,T., \"Composing Letters With a Simulated Listening Typewriter\", ~unicatiens o~f thee ACM, April 1983, pp. 295- 308.  ",
      "doi": "10.1145/2163.358100"
    },
    {
      "text": "Hicks, B. and Jaycox, K., \"Elders, Students, and Computers - Background Information\" , Illinois Series on Educational Technology of Computers, No.8, Sept~ 1976~",
      "doi": ""
    },
    {
      "text": "flicks, B., \"Computer Outreach\", National Institute of Education, Sept~ 1976.",
      "doi": ""
    },
    {
      "text": "Keats ley,G, and Furlong,M. C omvuters fo._E Kid_~s Ove__~r 60. Reading, MA: Addison-Wesley, 1984.",
      "doi": ""
    },
    {
      "text": "Kornbluh, M., \"CompuCez and Teleco~unications Applications to Enhance the Quality of Life of Our Elderly Citizens\", Congressional Research Service, Library of Congress, Washington, D.C., 1984.",
      "doi": ""
    },
    {
      "text": "Krauss, 5. and l~oyer, W., \"High Technology and the Older Person: Age and Experience as Moderators of Attitudes Towards Computers,\" Unpublished Study, Syracuse University, 1984.",
      "doi": ""
    },
    {
      "text": "Moto-oka,T. Fifth Generation Com~ S sty. New York: North-Holland Publishing Co., 1982.",
      "doi": ""
    },
    {
      "text": "U.S. Department of Commerce, Bureau of the Census, \"Population Estimates and Projections\", 1982.",
      "doi": ""
    },
    {
      "text": "Van Praag, J. and Jones, S., \"Speech Versus Keyboard Input to a Computer System- Performance, Preference, and System Evaluations\", Digital Equipment Corporation Technical Report No. 389, August, 1985.",
      "doi": ""
    },
    {
      "text": "Whiteside,J. and Wixon,D., \"Developmental Theory as a Framework for Studying Human-Computer Interaction\", in Advances\" in Huma_.~nn Com~ Interaction, ll .R .Hart son , ed., Norwood, NJ: Ablex, 1985,",
      "doi": ""
    }
  ]
}