{
  "doi": "10.1145/22627.22370",
  "title": "Designing a quality voice: an analysis of listeners' reactions to synthetic voices",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "192-197",
  "year": 1986,
  "badges": [],
  "abstract": "Eight subjects listened to a set of synthetic voices reflecting a crossing of four voice qualities: head size, pitch, richness and smoothness. The listeners evaluated the voices on sixteen perceptual scales, and judged each voice's appropriateness for twenty voice-output scenarios. Factor analysis of the perceptual ratings recovered two factors, fullness and clarity. A similar analysis of the appropriateness ratings revealed three situational factors, information, entertainment and feedback. Further analyses indicated that the voice qualities associated with the three situational factors were quite different, and suggest ways to optimize voices used for a particular purpose.",
  "tags": [],
  "authors": [
    {
      "name": "Mary Beth Rossen",
      "institution": "IBM Thomas J. Watson Research Center, Yorktown Heights, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "A. J. Cecala",
      "institution": "Yale University, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100130034",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Addin/~ton, D,W. The relationship of selected vocal characteristics to personality perception. Speech Monographs, 1968, 35, 492-501.",
      "doi": ""
    },
    {
      "text": "Carreil, T.D. Contributions of fundamental frequency, formant spacing, and glottal waveform to talker identification. SRL Technical Report No. 5, Speech Research Laboratory, Indiana University, Bloomington, Indiana, 1984.",
      "doi": ""
    },
    {
      "text": "Cox, A.C. and Cooper, M.B. Selecting a voice for a specified task: The example of telephone announcements. Language and Speech, 1981, 24(3). 233-243.",
      "doi": ""
    },
    {
      "text": "Gabrielsson, A. and Sjogren, H. Perceived sound quality of soundreproducing systems. Journal of the Acoustical Society of America, 1979, 65(4), 1019-1033.",
      "doi": ""
    },
    {
      "text": "Holmes, J.N. The influence of glottal waveform on the naturalness of speech from a parallel formant synthesizer. IEEE Transactions on Audio and Electroacoustics, 1973, A U-21, 298-305.",
      "doi": ""
    },
    {
      "text": "Kim, J. and Mueller, C.W. Factor Analysis: Statistical Methods and Practical Issues. Beverly Hills, CA: Sage Publications, 1978. (a).",
      "doi": ""
    },
    {
      "text": "Kim, J. and Mueller, C.W. Introduction to Factor Analysis. Beverly Hills, CA: Sage Publicat.ions, 1978. (b)",
      "doi": ""
    },
    {
      "text": "Kuwabara, H. and Ohgushi, K. Experiments on voice qualities of vowels in males and females and correlation with acoustic features. Language and Speech, 1984, 2 7(2), 135-145.",
      "doi": ""
    },
    {
      "text": "Murray, T. and Singh, S. Multidimensional analysis of male and female voices. Journal of the Acoustical Society of America, 1980, 68(5), 1294-1300.",
      "doi": ""
    },
    {
      "text": "Nusbaum, H.C., Schwab, E.C., and Pisoni, D.B. Subjective evaluation of synthetic speech: Measuring preference~ naturalness, and acceptability. Research on Speech Perception Progress Report No. 10,, Indiana University, 1984.",
      "doi": ""
    },
    {
      "text": "Rosenberg, A.E. Effect of glottal pulse shape on the quality of natural vowels. Journal of the Acoustical Society of America, 1970, 2(2), 583-590.",
      "doi": ""
    },
    {
      "text": "Rosson, M.B. and Mellon, N.M. Behavioral issues in speech-based remote information retrieval. In Leon Lerman (Ed.), Proceedings of the Voice 1/0 Systems Applications Conference \"85. San Francisco: AVIOS, 1985~",
      "doi": ""
    },
    {
      "text": "Simpson, C.A. and Williams, D,H. Response time effects of alerting tone and semantic contexts for synthesized voice cockpit warnings. Human Factors, 1980, 22, 319-320.",
      "doi": ""
    },
    {
      "text": "Streeter, L.A., Macdonald, N.H., Apple, W., Krauss, R.M,, and Galotti, K.M. Acoustic and perceptual indicators of emotional stress. Journal of the Acoustical Society of America, 1983, 73(4), 1354-t360.",
      "doi": ""
    },
    {
      "text": "Thorndike, R.M. Correlational Procedures for Research. New York: Gardner Press, 1978.",
      "doi": ""
    },
    {
      "text": "Tucker, L.R. Relations of factor score estimates to their use. Psychornetrika, 1971, 36, 427-436.",
      "doi": ""
    },
    {
      "text": "Voiers, W.D. Perceptual bases of speaker identity. Journal of the Acoustical Society of America, 1964, 36(6), 1065-1073.",
      "doi": ""
    },
    {
      "text": "von Bismarck, G. Timbre of steady sounds: A factorial investigation of its verbal attributes. Acustica, 1974, 30, 146-t59.",
      "doi": ""
    },
    {
      "text": "Walden, B.E., Montgomery, A.A., Gibeily, G.J., Prosek, R.A., and Schwartz, D.M. Correlates of psychological dimensions in talker similarity. Journal of Speech and Hearing Research, 1978, 21, 265-275.",
      "doi": ""
    }
  ]
}