{
  "doi": "10.1145/22627.22353",
  "title": "Classifying users: a hard look at some controversial issues",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "84-88",
  "year": 1986,
  "badges": [],
  "abstract": "It has become a common recommendation to computer interface designers that they should “Know the User” (e.g., Rubinstein and Hersh, 1984). This panel discussion will examine the issues that arise from this advice.",
  "authors": [
    {
      "name": "K. Potosnak",
      "institution": "The Koffler Group, 3029 Wilshire Blvd., Santa Monica, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100511283",
      "orcid": "missing"
    },
    {
      "name": "P. J. Hayes",
      "institution": "Computer Science Department, Carnegie-Mellon Univ., Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384622109",
      "orcid": "missing"
    },
    {
      "name": "M. B. Rosson",
      "institution": "IBM Thomas J. Watson Research Center, Yorktown Heights, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "M. L. Schneider",
      "institution": "Consultant, 22 Colonial Place, New Haven, CT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100156636",
      "orcid": "missing"
    },
    {
      "name": "J. A. Whiteside",
      "institution": "Digital Equipment Corporation, 110 Spit Brook Road, Nashua, NH",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100512851",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S.K., Moran, T. P., &amp; Newell, A. The Psychology of Human-Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Carroll, J.M., &amp; Rosson, M.B. Usability specifications as a tool in iteratlve development. In R. Hartson (Ed.), Advances in Human-Computer Interaction. New York: Ablex, 1985.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., &amp; Rosson, M.B. The paradox of the active user. In J.M. Carroll (Ed.), facing throught: Cognitive aspects of human computer interaction. MIT Press, to appear. ",
      "doi": "10.5555/28446.28451"
    },
    {
      "text": "Martin, J. Design of Man-Computer Dialogues. Englewood Cliffs, NJ: Prentice-Hall, 1973. ",
      "doi": "10.5555/574884"
    },
    {
      "text": "Potosnak, K.M., Choice of interface modes by empirically derived categories of users, doctoral dissertation, The Johns Hopkins University, 1983. (Can be obtained from University Microfilms international; 300 North Zeeb Road; Ann Arbor, Michigan 48106)",
      "doi": ""
    },
    {
      "text": "Potosnak, K.M., Choice of interface modes by empirical groupings of computer users. Proceedings of the First IFIP conference on Human-Computer Interaction (INTERACT '84), London, 4-7 September, 1984, 2.262-2.267.",
      "doi": ""
    },
    {
      "text": "Ramsey, H.R., &amp; Atwood, M.E. Human in computer systems: A review of the literature. Technical Report SAI-79-111-DEN. Englewood, CO: Science Applications, Inc., 1979. (NTIS No. ADA075679)",
      "doi": ""
    },
    {
      "text": "Rosson, M.B., &amp; Mellen, N.M. Behavioral issues in speech-based remote information access. In L. Lerman (Ed.), Proceedings of the Input/Output Society San Francisco: AVIOS, 1985 (Also IBM Research Report RC 11028).",
      "doi": ""
    },
    {
      "text": "Rubinstein, R., &amp; Hersh, H. The Human Factor. Burlington, MA: Digital Press, 1984.",
      "doi": ""
    },
    {
      "text": "Smith, S.L. The usability of software-Design guidelines for the user-system interface. Paper presented at the ITT Human Factors Symposium, ITT Shelton, Connecticut, October 1981.",
      "doi": ""
    },
    {
      "text": "Shackel, B. The concept of usability. Paper presented at ITT Human Factors Symposium, ITT Shelton, Connecticut, October, 1981.",
      "doi": ""
    },
    {
      "text": "Shackel, B. Ergonomics in information technology in Europe -- A review. Behaviour and Information Technology, 1985, 4(4), 263-287.",
      "doi": ""
    }
  ]
}