{
  "doi": "10.1145/22627.22379",
  "title": "On designing for usability: an application of four key principles",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "247-252",
  "year": 1986,
  "badges": [],
  "abstract": "In a recent paper, Gould and Lewis (1983a) argued for the importance of four key principles in computer system design. These principles are: early focus on users, interactive design, empirical measurement, and iterative design. Gould and Lewis also express their belief that these principles are essential to successful design and refer to an example of their use (Gould and Lewis, 1983b). It is the purpose of this paper to report another example of how these principles played a major role and proved their worth in the design of a successful system.",
  "authors": [
    {
      "name": "Thomas T. Hewett",
      "institution": "Department of Psychology and Sociology, Drexel University, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100451165",
      "orcid": "missing"
    },
    {
      "name": "Charles T. Meadow",
      "institution": "Faculty of Library and Information Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289836",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fenichel, C. H. (1979). Online information retrieval\" Identifcation of measures that discriminate among users with different levels and types of experience. Ph. D. Dissertation, School of Library and Information Science, Drexel University, Philadelphia, PA.",
      "doi": ""
    },
    {
      "text": "Gould, J. D. and Lewis, C. (1983a). Designing for usability--key principles and what designers think. In Proceedings CHI '83 Conference on Human Factors in Comouting system. (Boston, December 12-15), ACM: New York, 50-53.  ",
      "doi": "10.1145/800045.801579"
    },
    {
      "text": "Gould, J. D. and Lewis, C. (1983b). Human factors principles in designing for usability. IBM Research Report. (Cited in Gould &amp; Lewis 1983a.).",
      "doi": ""
    },
    {
      "text": "Hewett, T. T. and Meadow, C.T. (1981). A study of the measurement of user performance. In J. L. Divilbiss (Ed.),Public Access to Library Automation. Urbana-Champaign, IL.\" University of Illinois Graduate School of Library and Information Science, 49-76.",
      "doi": ""
    },
    {
      "text": "Lewis, C. (1982). Using the \"Thinking Aloud\" method in cognitive interface design. IBM Research Report, RC-9265. (Cited in Gould &amp; Lewis, 1983a.)",
      "doi": ""
    },
    {
      "text": "Meadow, C. T., Fenichel, C. H., &amp; Hewett, T.T. (1978). Individualized instruction for data access (IIDA)\" Quarterly report No. 2. Drexel University School of Library and Information Science, and Franklin Institute Research Center, Philadelphia, PA.",
      "doi": ""
    },
    {
      "text": "Meadow, C. T., Hewett, T. T., &amp; Aversa, E. S. (1982a). A computer intermediary for interactive data base searching\" Part 1, Design. Journal of the American Society for Information Science, 33, 325-332.",
      "doi": ""
    },
    {
      "text": "Meadow, C. T., Hewett, T. T., &amp; Aversa, E. S. (1982b). A computer intermediary for interactive data base searching\" Part II, Evaluation. Journal of the American Society for Information Science,, 33, 357-364.",
      "doi": ""
    },
    {
      "text": "Meadow, C. T., Hewett, T. T., Rafsnider, D. J., Toliver, D. E., Epstein, B., Edelman, J. V., &amp; Maher, A. (1977). Individualized instruction for data access. Graduate School of Library Science, Drexel University, Philadelphia, PA.",
      "doi": ""
    }
  ]
}