{
  "doi": "10.1145/22627.22388",
  "title": "A model of mental model construction",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "306-313",
  "year": 1986,
  "badges": [],
  "abstract": "Learning to control a computer system from limited experience with it seems to require constructing a mental model adequate to indicate the causal connections between user actions, system responses, and user goals. While many kinds of knowledge could be used in building such a model, a small number of simple, low-level heuristics is adequate to interpret some common computer interaction patterns. Designing interactions so that they fall within the scope of these heuristics may lead to easier mastery by learners.",
  "authors": [
    {
      "name": "Clayton H. Lewis",
      "institution": "Department of Computer Science and Institute of Cognitive Science, Campus Box 430, University of Colorado, Boulder CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100349845",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bullock, M, Gelman, R and Baillargeon, R. The development of causal reasoning. In W.J. Friedman (Ed.) The Developmental Psychology of Time. New York: Academic Press, 1982.",
      "doi": ""
    },
    {
      "text": "Duncker, K. On problem-solving. Psychological Monographs, 58, Whole No. 270, 1945.",
      "doi": ""
    },
    {
      "text": "Kieras, DE and Bovair, S. The role of a mental model in learning to operate a device. Cognitive Science, 8, 255-273, 1984.",
      "doi": ""
    },
    {
      "text": "Lewis, CH. Understanding what's happening in system interactions. In D. A. Norman and S.W. Draper (Eds.) User Centered System Design: New Perspectives on Human-Computer interaction. Hillsdale, Nj: Erlbaum, forthcoming.",
      "doi": ""
    },
    {
      "text": "Shultz, TR and Ravinsky, FB. Similarity as a principle of causal inference. C h i I d Development, 48, 1552-1558, 1977.",
      "doi": ""
    }
  ]
}