{
  "doi": "10.1145/22627.22359",
  "title": "The effects of structured, multi-level documentation",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "122-128",
  "year": 1986,
  "badges": [],
  "abstract": "The effects of general global documentation, detailed step-by-step documentation, and combined global and detailed documentation were examined for high, medium, and low experienced students. The 198 students in this study used a word-processing program to complete two problems during a two-hour session. Results from univariate and multivariate analyses indicated that both general time measures for reading documentation and completing problems as well as the student users' reactions to the documentation, the program, and the computer system were affected by either the type of documentation, the level of experience, or both of these factors.",
  "authors": [
    {
      "name": "R. W. Holt",
      "institution": "Psychology Department, George Mason University, Fairfax, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100355613",
      "orcid": "missing"
    },
    {
      "name": "D. A. Boehm-Davis",
      "institution": "Psychology Department, George Mason University, Fairfax, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153736",
      "orcid": "missing"
    },
    {
      "name": "A. C. Schultz",
      "institution": "Psychology Department, George Mason University, Fairfax, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547253356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boehm-Davis, D.A. ana Fregly, A. M. (1985) Documentation of Concurrent Programs, Human Factors, 27, 423-432",
      "doi": ""
    },
    {
      "text": "Brooks, R. (1982) A theoretical analysis of the role of documentation in the compehension of computer programs. In Proceedings of the Human Factors in Computer Systems Conference. Gaithersburg, MA: Institute for Computer Sciences &amp; Technology.  ",
      "doi": "10.1145/800049.801768"
    },
    {
      "text": "Isa, B. S., Neal, A. A., Evey, R. J., and McVey, B.W. (1982) Roadmaps versus roadsigns: Which is the better metalanguage? In Proceedings of the 26th Annual Meeting of the Human Factors Society. SantaMonica, CA: The Human Factors Society, Inc.",
      "doi": ""
    },
    {
      "text": "Norcio, A. F. (1982) Indentation, documentation and programmer comprehension. In Proceedings of the Human Factors in Computer Systems Conference. Gaithersburg, MA: Institute for Computer Sciences &amp; Technology.  ",
      "doi": "10.1145/800049.801766"
    },
    {
      "text": "Norman, D. A. (1982) Steps toward a cognitive engineering: Design rules based on analysis of human error.In Proceedings of the Human Factors in Computer Systems Conference. Gaithersburg, MA: Institute for Computer Sciences &amp; Technology.  ",
      "doi": "10.1145/800049.801815"
    },
    {
      "text": "Sheppard, S. B., Curtis, B., Milliman, P., and Love, T. (1979) Modern coding practices and programmer performance. Computer, 12 (12), pp 41-49.",
      "doi": "10.1109/MC.1979.1658575"
    },
    {
      "text": "Sheppard, S. B., Kruesi, E., and Curtis, B. (1981) The effects of symbology and spatial arrangement on the comprehension of software specification.\" In Proceedings of the Fifth International Conference on Software Enginneerinq. Copyright, the Institute of Electrical and Electronics Engineers, Inc. ",
      "doi": "10.5555/800078.802533"
    }
  ]
}