{
  "doi": "10.1145/22627.22371",
  "title": "Speech recognition enhancement by lip information",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "198-204",
  "year": 1986,
  "badges": [],
  "abstract": "Though technology in speech recognition has progressed recently, Automatic Speech Recognition (ASR) is vulnerable to noise. Lip-information is thought to be useful for speech recognition in noisy situations, such as in a factory or in a car.\nThis paper describes speech recognition enhancement by lip-information. Two types of usage are dealt with. One is the detection of start and stop of speech from lip-information. This is the simplest usage of lip-information. The other is lip-pattern recognition, and it is used for speech recognition together with sound information. The algorithms for both usages are proposed, and the experimental system shows they work well. The algorithms proposed here are composed of simple image-processing. Future progress in image-processing will make it possible to realize them in real-time.",
  "authors": [
    {
      "name": "Shogo Nishida",
      "institution": "Central Research Lab., Mitsubishi Electric Corp., Tsukaguchi-Hommachi 8-1-1, Amagasaki, Hyogo, 661, Japan and Media Laboratory, MIT, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332518691",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Richard A. Bolt, \"The Human Interface\", Lifetime Learning Publication, 1984.",
      "doi": ""
    },
    {
      "text": "W. H. Sumby and Irwin Pollak, \"Visual Contribution to Speech Intelligibility in Noise\"~ the Journal of the Accoustical Society of America, Vol. 26, No. 2, March 1954, pp.212- 215.",
      "doi": ""
    },
    {
      "text": "A. M. Rollins and J. Wiesen, \"Speed Recognition and Noise\", IEEE International Conference on Accoustics, Speech and Signal Processing, Boston, April 1983.",
      "doi": ""
    },
    {
      "text": "A. M. Rollins, \"Speech Recognition and Manners of Speaking in Noise and in Quiet\", CHI'85 Proceeding, April 1985, pp.197-199.  ",
      "doi": "10.1145/317456.317492"
    },
    {
      "text": "David E. Shaw, \"NON-VON Applicability to Three AI Task Areas\", IJCAI-85 Proceedings, 1985, pp.61-72.",
      "doi": ""
    },
    {
      "text": "Eric D. Petajan, \"Automatic Lip-reading to Enhance Speech Recognition\", Ph. D. Thesis, Univ. of Illinois at Urbana-Champaign, 1985. ",
      "doi": "10.5555/911713"
    }
  ]
}