{
  "doi": "10.1145/22627.22389",
  "title": "Intelligent interfaces: user models and planners",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "314-320",
  "year": 1986,
  "badges": [],
  "abstract": "To meet the challenge of constructing interfaces for increasingly complex multifunctional products, designers will be attracted by the promise offered by “intelligent” systems. However, the value of such sophisticated systems must be measured in terms of the quality of their user's models. One such intelligent interface — an Expert Help System — has been designed, implemented, and evaluated. We argue that the operability problems noted in users' interactions with this system are attributable to lack of a strong user model in the system interface. Such a model plays a critical role in determining the effectiveness of the system's ability to monitor the user's planning activities. We discuss the requirements of a strong user model and provide an example of how such a model might be integrated into a planner-based intelligent interface.",
  "authors": [
    {
      "name": "L. Quinn",
      "institution": "School of Education, SESAME Group, University of California, Berkeley and Human Factors Group, Reprographics Business Group, Xerox Corporation",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100109093",
      "orcid": "missing"
    },
    {
      "name": "D. M. Russell",
      "institution": "Intelligent Systems Laboratory, Palo Alto Research Center, Xerox Corporation",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589296",
      "orcid": "0000-0002-7243-9317"
    }
  ],
  "references": [
    {
      "text": "Fikes. R. Presentation given to RBG Design group, Rochester, NY, February 1983.",
      "doi": ""
    },
    {
      "text": "Fikes, R. and Nilsson, N .J. STRIPS: A new approach to the application of theorem proving and problem solving. Artificial (ntelligence, 1971, 2,189-208.",
      "doi": ""
    },
    {
      "text": "Fischer, G., Lemke, A. and Schwab, T. Active help systems, in T. Green, M. Tauber, G. van der Veer {Eds.), Proceedings of Second European Conference on Cognitive Ergonomics--Mind and Computers, Gmunden, Austria. NY: Springer Verlag, 1984. ",
      "doi": "10.5555/2815.2824"
    },
    {
      "text": "Nilsson, N.J. Principles of Artificial Intelligence'. Palo Alto, CA: Tioga Press, 1980. ",
      "doi": "10.5555/30425"
    },
    {
      "text": "Rich, E. Users are individuals: Individualizing user models. International Journal of Man-Machine Studies, 1983, 18, 199-214.",
      "doi": ""
    },
    {
      "text": "Sacerdoti, E. D. The nonlinear nature o~ plans. Proceedings of the International Joint Conference on Artificial intelligence, 1975, 4, 206-214.",
      "doi": ""
    },
    {
      "text": "Suchman, L. A. The machine interface as a user's construction. Working Paper, Cognitive and Instructional Sciences Group, Xerox Palo Alto Research Center, March 1982.",
      "doi": ""
    },
    {
      "text": "Suchman, L.A.Plans and situated actions: The problem of human-machine communication. Technical report, Intelligent Systems Laboratory, Xerox Palo Alto Research Center, February 1985.",
      "doi": ""
    }
  ]
}