{
  "doi": "10.1145/22627.22387",
  "title": "The memory extender personal filing system",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "298-305",
  "year": 1986,
  "badges": [],
  "abstract": "The benefits of electronic information storage are enormous and largely unrealized. As its cost continues to decline, the number of files in the average user's personal database may increase substantially. How is a user to keep track of several thousand, perhaps several hundred thousand, files? The Memory Extender (ME) system improves the user interface to a personal database by actively modeling the user's own memory for files and for the context in which these files are used. Files are multiply indexed through a network of variably weighted term links. Context is similarly represented and is used to minimize the user input necessary to disambiguate a file. Files are retrieved from the context through a spreading-activation-like process. The system aims towards an ideal in which the computer provides a natural extension to the user's own memory.",
  "authors": [
    {
      "name": "William Paul Jones",
      "institution": "Microelectronics and Computer Technology Corporation, 9430 Research Boulevard, Echelon #1, Austin, Texas",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100554899",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R. (1976). Language, htemory, and Thought. tiillsdale, Ne~ Jersey: La,a, rence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Anderson, J.R. (1983). The Architecture of Cognition. Cambridge, Massachusetts: Harvard University Press. ",
      "doi": "10.5555/538901"
    },
    {
      "text": "Collins, A. M., ~ Quiltian, M. R. (1969). Retrieval time from semantic memory. Journal of Verbal Learning a~Td Verbal Behavior, 8, 240-247.",
      "doi": ""
    },
    {
      "text": "Collins, A. M., ~ Qui{lian, M. R. (1972). Experiments on semantic memory and language comprehension. In Gregg, L. (Ed.), Cognition and Learning. New York: Wiley and Sons.",
      "doi": ""
    },
    {
      "text": "Furnas, G. W., Landauer, T. K., Gomez, L. M., ~ Dumais, S. T. (1983). Statistical Semantics: Analysis of the Potential Performance of Key- Word Information Systems. The Bell System Technical Journal, 62, 1753-1806.",
      "doi": ""
    },
    {
      "text": "Ide, E. ~ Salton, G. (1971). Interactive search strategies and dynamic file organization. In Salton, G. (Ed.), The SMART Retrieval System - Experiments in Automatic Document Processing. Englewood Cliffs, New Jersey: Prentice-Hall, Inc.",
      "doi": ""
    },
    {
      "text": "Jones, x,V. p. (1985a). On the Applied Use of Computer Models of Memory - A Proposal For a Large-scale Personal Filing System (Teeh. Rep. TR-85-103-04). Austin, TX: Microelectronics and Computer Technology Corporation,",
      "doi": ""
    },
    {
      "text": "Jones, ~,V. P. (1985b). A Geometric Analysis of Four Information Retrieval Similarity h4easures (Tech. Rep. HI-138-85). Austin, TX: Microelectronics and Computer Technology Corporation,",
      "doi": ""
    },
    {
      "text": "Salton, G. ~ Yang, O. S. (1973). On the specifications of term -~alues in automatic indexing. Journal of Documentation, 29, 351-372.",
      "doi": ""
    },
    {
      "text": "Salton, G. ~ McGill, M. J. (1983). Introduction to hdodern Information Retrieval. New York' McGraw Hill. ",
      "doi": "10.5555/576628"
    },
    {
      "text": "Sparck Jones, K. (1972). A statistical interpretation of term specificity and its application in retrieval. Journal of Documentation. 28, 11-21.",
      "doi": "10.5555/106765.106782"
    },
    {
      "text": "Wickelgren, W.A. (1976). Memory storage dynamics. In Estes, W. K. (Ed.), Handbook of Learning and Cognitive Processes. Hillsdale, New Jersey: Lawrence, Erlbaum Associates.",
      "doi": ""
    }
  ]
}