{
  "doi": "10.1145/22627.22340",
  "title": "The information lens: an intelligent system for information sharing in organizations",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 1986,
  "badges": [],
  "abstract": "This paper describes an intelligent system to help people share and filter information communicated by computer-based messaging systems. The system exploits concepts from artificial intelligence such as frames, production rules, and inheritance networks, but it avoids the unsolved problems of natural language understanding by providing users with a rich set of semi-structured message templates. A consistent set of “direct manipulation” editors simplifies the use of the system by individuals, and an incremental enhancement path simplifies the adoption of the system by groups.\nOne of the key problems that arises when any group of people cooperates to solve problems or make decisions is how to share information. Thus one of the central goals of designing good “organizational interfaces” (Malone, 1985) should be to help people share information in groups and organizations. In this paper, we will describe a prototype system, called the Information Lens, that focuses on one aspect of this problem: how to help people share the many diverse kinds of qualitative information that are communicated via electronic messaging systems.\nIt is already a common experience in mature computer-based messaging communities for people to feel flooded with large quantities of electronic “junk mail” (Denning, 1982; Palme, 1984; Wilson, 1984; Hiltz & Turoff, 1985), and the widespread availability of inexpensive communication capability has the potential to overwhelm people with even more messages that are of little or no value to them. At the same time, it is also a common experience for people to be ignorant of facts that would facilitate their work and that are known elsewhere in their organization. The system we will describe helps solve both these problems: it helps people filter, sort, and prioritize messages that are already addressed to them, and it also helps them find useful messages they would not otherwise have received.\nThe most common previous approach to structuring information sharing in electronic messaging environments is to let users implicitly specify their general areas of interest by associating themselves with centralized distribution lists or conference topics related to particular subjects (e.g., Hiltz & Turoff, 1978). Since these methods of disseminating information are often targeted for relatively large audiences, however, it is usually impossible for all the information distributed to be of interest to all recipients.\nThe Information Lens system uses much more detailed representations of message contents and receivers' interests to provide more sophisticated filtering possibilities. One of the key ideas behind this system is that many of the unsolved problems of natural language understanding can be avoided by using semi-structured templates (or frames) for different types of messages. These templates are used by the senders of messages to facilitate composing messages in the first place. Then, the same templates are used by the receivers of messages to facilitate constructing a set of rules to be used for filtering and categorizing messages of different types.",
  "tags": [],
  "authors": [
    {
      "name": "Thomas W. Malone",
      "institution": "Massachusetts Institute of Technology",
      "img": "/do/10.1145/contrib-81100548740/rel-imgonly/oct2010.jpg",
      "acmid": "81100548740",
      "orcid": "missing"
    },
    {
      "name": "Kenneth R. Grant",
      "institution": "Massachusetts Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100081464",
      "orcid": "missing"
    },
    {
      "name": "Franklyn Albin Turbak",
      "institution": "Massachusetts Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339533353",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blair, D. and Maron, M. An evaluation of retrieval effectiveness for a full-text document-retrieval system. Communications of the ACM, 28, 3, 1985. pp. 289-299.  ",
      "doi": "10.1145/3166.3197"
    },
    {
      "text": "Brobst, S. A., Malone, T. W., Grant, K. R., &amp; Cohen, M. D., Toward intelligent message routing systems. Proceedings of the Second International Symposium on Computer Message Systems, Washington, D. C., September 5- 7, 1985.",
      "doi": ""
    },
    {
      "text": "Crawford, A. Corporate electronic mail - A communication intensive application of information technology. MIS Quarterly, September 1982, pp. 1-14.",
      "doi": "10.2307/248652"
    },
    {
      "text": "Denning, P. Electronic junk. Communications of the ACM, 23, 3, 1982. pp. 163-165.  ",
      "doi": "10.1145/358453.358454"
    },
    {
      "text": "Englebart, D.C. and English, W.K. Research center for augmenting human intellect. Proceedings of FaU Joint Computing Congress, AFIPS press, December 1968, pp. 395-410.",
      "doi": "10.1145/1476589.1476645"
    },
    {
      "text": "Fikes, R. and Kehler, T. The role of frame-based representation in reasoning. Communications of the ACM, 28, 7, 1985, p. 904.  ",
      "doi": "10.1145/4284.4285"
    },
    {
      "text": "Hiltz, S.R. and Turoff, M. The network nation: human communication via computer. Reading, Mass.\" Addison-Wesley, 1978. ",
      "doi": "10.5555/151072"
    },
    {
      "text": "Hiltz, S.R. and Turoff, M. Structuring computermediated communication systems to avoid information overload. Communications of the ACM, 28, 7,1985, pp.680-689.  ",
      "doi": "10.1145/3894.3895"
    },
    {
      "text": "Johansen, R. Teleconferencing and beyond: Communications in the office of the future. New York: McGraw-Hill, 1984. ",
      "doi": "10.5555/1244"
    },
    {
      "text": "Kedzierski, B. Knowledge-based project management and communication support in a system development environment. Fourth Jerusalem Conference on Information Technology. Jerusalem, Israel, 1984.",
      "doi": ""
    },
    {
      "text": "Malone, T. Designing organizational interfaces. Proceedings of the CHI '85 Conference on Human Factors in Computing Systems. San Francisco, California, 1985.  ",
      "doi": "10.1145/317456.317469"
    },
    {
      "text": "Palme, J. You have 134 unread mail do you want to read them now? IFIP Conference on Computer Based Message Services. Nottingham University, 1984. ",
      "doi": "10.5555/3586.3599"
    },
    {
      "text": "Salton, G. and McGill, M. Introduction to modern information retrieval. New York: McGraw-Hill, 1983. ",
      "doi": "10.5555/576628"
    },
    {
      "text": "Sarin, S.K. and Greif, I. Interactive on-line conferences. Proceedings A CM-SIGOA Conference on Office Information Systems, June 1984.  ",
      "doi": "10.1145/800023.808333"
    },
    {
      "text": "Searle, J. A taxonomy of illocutionary acts in K. Gunderson (ed.), Minnesota Studies in the Philosophy of Language. Minneapolis: University of Minnesota Press, 1975.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. The future of interactive systems and the emergence of direct manipulation.\" Behavior and Information Technology, 1,237-256,1982.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Direct manipulation: A step beyond programming languages.\" {EEE Computer, 16, 57-69, August 1983.",
      "doi": ""
    },
    {
      "text": "Stallman, R. ZMai} manual. M.I.T. Artificial Intelligence Laboratory, 1983.",
      "doi": ""
    },
    {
      "text": "Stefik, M., Foster, G., Bobrow, D., Kahn, K., Lanning, S. and Suchman, L. Beyond the chalkboard: using computers to support collaboration and problem solving in meetings. Intelligent Systems Laboratory Technical Report, Xerox Palo Alto Research Center, Palo Alto, CA, September, 1985.",
      "doi": ""
    },
    {
      "text": "Tou, F.N., Williams, M.D., Fikes, R.E., Henderson, D.A., &amp; Malone, T.W. RABBIT: An intelligent daytabase assistant. Proceedings of the National Conference of the American Association for Artificial Intelligence, Pittsburgh, Pennsylvania, August 18-20, 1982.",
      "doi": ""
    },
    {
      "text": "Trigg, R. Network approach to text handling for the online scientific community. Ph.D. thesis, Department of Computer Science, University of Maryland, CSTR- 1346, November 1983. ",
      "doi": "10.5555/911585"
    },
    {
      "text": "Turoff, M. Information, value and the internal marketplace. New Jersey Institute of Technology, Newark, New Jersey, 1983.",
      "doi": ""
    },
    {
      "text": "Wilson, P., Maude, T., Marshall, C., and Heaton, N. The active mailbox- your on-line secretary. {FIP Conference on Computer Based Message Services. Nottingham University, 1984. ",
      "doi": "10.5555/3586.3596"
    }
  ]
}