{
  "doi": "10.1145/22627.22351",
  "title": "Learning and transfer for text and graphics editing with a direct manipulation interface",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "72-77",
  "year": 1986,
  "badges": [],
  "abstract": "For a Direct Manipulation interface, transfer of skill between text and graphics editing tasks has been investigated. A learning experiment has been carried out with two groups of novice users starting with a series of sessions in one task domain and then switching over to the other domain. The empirical results are discussed in the framework of the “cognitive complexity” theory of Polson and Kieras.",
  "authors": [
    {
      "name": "J. E. Ziegler",
      "institution": "Fraunhofer-Institut für Arbeitswirtschaft und Organisation (IAO), Holzgartenstr, 17, 700O Stuttgart, West Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100445374",
      "orcid": "missing"
    },
    {
      "name": "H. U. Hoppe",
      "institution": "Fraunhofer-Institut für Arbeitswirtschaft und Organisation (IAO), Holzgartenstr, 17, 700O Stuttgart, West Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100397563",
      "orcid": "missing"
    },
    {
      "name": "K. P. Fahnrich",
      "institution": "Fraunhofer-Institut für Arbeitswirtschaft und Organisation (IAO), Holzgartenstr, 17, 700O Stuttgart, West Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100400801",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Smith, D.C. et al.: Designing the Star user interface. In: Degano, P. &amp; Sandewall, E. (Eds.): integrated Interactive Computer Systems. North-Holland, Amsterdam 1983",
      "doi": ""
    },
    {
      "text": "Williams, G.: The LISA Computer System. BYTE, Febr. 1983, pp. 33-50",
      "doi": ""
    },
    {
      "text": "Williams, G.: The APPLE MACINTOSH Computer. BYTE, 9, 1984,pp 30-54",
      "doi": ""
    },
    {
      "text": "Tesler, L.: The SMALLTALK Environment. BYTE, Aug. 1981, pp. 90-147",
      "doi": ""
    },
    {
      "text": "Shneiderman, B.: The Future of interactive Systems and the Emergence of Direct Manipulation. Behaviour and Information Technology, Vol. 1, No. 3, 1982, pp. 237-256",
      "doi": ""
    },
    {
      "text": "Shneiderman, B.: Direct Manipulation: A Step beyond programming languages. IEEE Computer 16, No. 8, 1983, pp. 57-69",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Hutchins, E. L., Hollan, J. D. &amp; Norman D. A.: Direct Manipulation Interfaces. To appear in: Norman, D. A. &amp; Draper, S. W. (Eds.): User Centered System Design - New Perspectives in Human-Machine interaction. Hillsdale, N.Y., Erl baum, 1986 (cited with permission).",
      "doi": ""
    },
    {
      "text": "F~hnrich, K.P. &amp; Ziegler, J.: Workstations using Direct Manipulation as interaction mode. Proc. Interact 1984, London Sept. 1984, Vol. II, pp. 203-208",
      "doi": ""
    },
    {
      "text": "Poison, P.G. &amp; Kieras, D.: A quantitative model of the learning and performance of text editing knowledge. Proc. of CHI 85, San Francisco 1985, pp. 207-212  ",
      "doi": "10.1145/317456.317494"
    },
    {
      "text": "Singley, M.K. &amp; Anderson, J.R.: The transfer of text-editing ski~l. Int. J. Man-Machine Studies, 22, 1985, pp. 403-423",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., &amp; Newell, A.: The psychology of human-computer interaction. Hillsdale, N.Y., Erlbaum, 1983 ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Poison, P.G. &amp; Kieras, D.: An approach to the formal analysis of user complexity. Int. j. Man-Machine Studies 22, 1985, pp. 365-394",
      "doi": ""
    },
    {
      "text": "Thorndike, E.L. &amp; Woodworth, R.S.: The influence of improvement in one mental function upon the efficiency of other functions. Psychological Review, 8, 1901, pp. 247-261",
      "doi": ""
    }
  ]
}