{
  "doi": "10.1145/22627.22381",
  "title": "The formal specification of adaptive user interfaces using command language grammar",
  "published": "1986-04-01",
  "proctitle": "CHI '86: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "256-260",
  "year": 1986,
  "badges": [],
  "abstract": "The design and implementation of adaptive systems as opposed to non-adaptive systems creates new demands on user interface designers. This paper discusses a few of these demands as encountered by the authors while utilising a formal notation for the design of an adaptive user interface to an electronic mail system. Recommendations for the extension of this formal notation are proposed and discussed.",
  "tags": [],
  "authors": [
    {
      "name": "Dermot P. Browne",
      "institution": "Data Logic Limited, Queens House, Greenhill Way, Harrow, Middlesex, HA1 1YR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010235",
      "orcid": "missing"
    },
    {
      "name": "Brian Sharratt",
      "institution": "Heriot-Watt/Strathclyde MMI Unit, 33 ST. Mary's Street, Edinburgh, EH1 1TN.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100138418",
      "orcid": "missing"
    },
    {
      "name": "Michael G. Norman",
      "institution": "Heriot-Watt/Strathclyde MMI Unit, 33 ST. Mary's Street, Edinburgh, EH1 1TN.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100062584",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Davis, R. Task Analysis and User Errors: a methodology for assessing interactions. Int. J. Man-Machine Studies, 1983, 19, p.561-574.",
      "doi": ""
    },
    {
      "text": "Moran, T.P. The Command Language Grammar: a representation for the user interface of interactive computer systems. Int.J. Man-Machine Studies, 1981, 15, p.3-50.",
      "doi": ""
    },
    {
      "text": "Moran, T.P. Getting into a System: external-internal task mapping analysis. in Proc. CHI'83 Human Factors in Computing Systems, (Boston, December 1983), ACM, New York, p.45-49.  ",
      "doi": "10.1145/800045.801578"
    }
  ]
}