{
  "doi": "10.1145/985692.985776",
  "title": "Trust and mistrust of online health sites",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "663-670",
  "year": 2004,
  "badges": [],
  "abstract": "Do different design and information content factors influence trust and mistrust of online health sites? Fifteen women faced with a risky health decision were observed while searching the Internet for information and advice over four consecutive weeks. In some sessions their searches were unstructured, whilst in other sessions they were directed to review specific sites, chosen for their trust design elements. Content analysis of concurrent verbalisations and group discussion protocols provided support for a staged model wherein design appeal predicted rejection (mistrust) and credibility of information and personalisation of content predicted selection (trust) of advice sites.",
  "tags": [
    "credibility",
    "health",
    "trust",
    "social identity",
    "computer-mediated communication",
    "Internet"
  ],
  "authors": [
    {
      "name": "Elizabeth Sillence",
      "institution": "Northumbria University, Newcastle, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236514",
      "orcid": "missing"
    },
    {
      "name": "Pam Briggs",
      "institution": "Northumbria University, Newcastle, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100277550",
      "orcid": "missing"
    },
    {
      "name": "Lesley Fishwick",
      "institution": "Northumbria University, Newcastle, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100206925",
      "orcid": "missing"
    },
    {
      "name": "Peter Harris",
      "institution": "Sheffield University, Sheffield, U.K.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100116577",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albarracin, D. & Kumkale, G., T. Affect as Information in Persuasion: A Model of Affect Identification and Discounting, Journal of Personality and Social Psychology, 84, 3, (2003) 453--469.]]",
      "doi": ""
    },
    {
      "text": "Bhattacherjee, A. Individual Trust in Online Firms: Scale Development and Initial Test. Journal of management Information Systems, 19,1 (2002) 211--241.]]",
      "doi": ""
    },
    {
      "text": "Briggs, P., Burford, B., De Angeli, A. & Lynch, P. Trust in Online Advice, Social Science Computer Review, 20, 3, (2002) 321--332.]]  ",
      "doi": "10.1177/08939302020003009"
    },
    {
      "text": "Briggs, P., de Angeli, A. and Simpson, B. Personalisation and Trust: A Reciprocal Relationship? Forthcoming in M.C. Kalat, J. Blom and J. Kalat (Eds). Designing Personalized User Experiences for E-Commerce. Kluwer, 2004.]] ",
      "doi": "10.5555/1011236.1011240"
    },
    {
      "text": "Chaiken, S. Heuristic versus systematic information processing and the use of source versus message cues in persuasion. Journal of Personality And Social Psychology, 39 (1980) 752--766]]",
      "doi": ""
    },
    {
      "text": "Cheskin Research and Studio Archetype/Sapient (1999). Ecommerce trust study. Retrieved (July 16, 2003) from: http://www.cheskin.com/p/ar.asp?mlid=7&arid=40&art=0&isu=1]]",
      "doi": ""
    },
    {
      "text": "Clore, G., L., Schwarz, N.,& Conway, M. Affective causes and consequences of social information processing. In R. S. Wyer & T. K. Srull (Eds.) Handbook of Social Cognition (1994) 323--417. Hillsdale, NJ: Erlbaum.]]",
      "doi": ""
    },
    {
      "text": "Corritore, C.L., Kracher, B. and Wiedenbeck, S. On-line trust: concepts, evolving themes, a model. International Journal of Human-Computer Studies, 58, (2003) 737--758.]]  ",
      "doi": "10.1016/S1071-5819%2803%2900041-7"
    },
    {
      "text": "Egger, F.N. \"Trust Me, I'm an Online Vendor\": Towards a Model of Trust for E-Commerce System Design. Proc. CHI 2000. ACM Press.]]  ",
      "doi": "10.1145/633292.633352"
    },
    {
      "text": "Egger, F.N. Affective Design of E-Commerce User Interfaces: How to Maximise Perceived Trustworthiness. Proc CAHD: Conference on Affective Human Factors Design (2001) 317--324.]]",
      "doi": ""
    },
    {
      "text": "Eysenbach, G. and Köhler, C. How do consumers search for and appraise health information on the world wide web? Qualitative study using focus groups, usability tests, and in-depth interviews. British Medical Journal 324 (2002), 573--577.]]",
      "doi": ""
    },
    {
      "text": "Eysenbach, G. Powell, J., Kuss, O., and Sa, E-R. Empirical studies assessing the quality of health information for consumers on the world wide web, a systematic review. Journal of the American Medical Association 287, 20 (2002), 2691--2700.]]",
      "doi": ""
    },
    {
      "text": "Fogg, B. J., Kameda, T., Boyd, J., Marchall, J., Sethi, R., Sockol, M. and Trowbridge, T.. Stanford-Makovsky Web Credibiltiy Study 2002: Investigating what makes Web sites credible today, A Research Report by the Stanford Persuasive Technology Lab & Makovsky & Company, Stanford University. Retrieved from : http://www.webcredibility.org .]]",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Prominence-Interpretation Theory: Explaining How People Assess Credibility Online. Proc CHI 2003, ACM Press.]]  ",
      "doi": "10.1145/765891.765951"
    },
    {
      "text": "Grabner-Krauter, S. and Kaluscha, E.A. Empirical research in online-trust: a review and critical assessment. International Journal of Human-Computer Studies, 58 (2003) 783--812.]]  ",
      "doi": "10.1016/S1071-5819%2803%2900043-0"
    },
    {
      "text": "Griffiths, F. Women's control and choice regarding HRT. Social Science & Medicine 49 (1999), 469--481.]]",
      "doi": ""
    },
    {
      "text": "Hunter, M.S. and O'Dea, I. Perceptions of future health risks in mid-age women: estimates with and without behavioural changes and hormone replacement therapy. Maturitas 33 (1999) 37--43.]]",
      "doi": ""
    },
    {
      "text": "Klein, J.D and Wilson, K.M. Delivering quality care: adolescents' discussion of health risks with their providers. Journal of adolescent health, 30(3) 2003, 190--195.]]",
      "doi": ""
    },
    {
      "text": "Lee, M.K.O., and Turban, E. . A trust model for consumer Internet shopping. International Journal of Electronic Commerce, 6, 1 (2001), 75--91.]]",
      "doi": "10.1080/10864415.2001.11044227"
    },
    {
      "text": "Longmate, E. & Baber, C. How useful are online community design guidelines: A case study of two fan communities. Paper Presented at Association of Internet Researchers Conference,AIRC 3.0, 2002.]]",
      "doi": ""
    },
    {
      "text": "McAllister, D.J. Affect-Based And Cognition-Based Trust As Foundations For Interpersonal Cooperation In Organizations Academy Of Management Journal 38,1 (1995) 24--59.]]",
      "doi": ""
    },
    {
      "text": "McKnight, D. H. and Chervany, N.L. Trust and Distrust Definitions: One Bite at a Time. In R. Falcone, M. Singh and Y.-H. Tan (Eds.) Trust in Cyber-societies. Berlin: Springer-Verlag, 2001.]] ",
      "doi": "10.5555/646674.701819"
    },
    {
      "text": "Pandey, S.K., Hart, J.J., and Tiwary, S. Women's health and the internet: understanding emerging trends and implications. Social Science & Medicine 56 (2003), 179--191.]]",
      "doi": ""
    },
    {
      "text": "Petty, R.E. and Wegener, D. T. The elaboration likelihood model: Current status and controversies. In S. Chaiken & Y. Trope (Eds.),Dual-process theories in social psychology New York: Guilford Press (1999) 41--72.]]",
      "doi": ""
    },
    {
      "text": "Pew Research Center. The online health care revolution: How the Web helps Americans take better care of themselves (2000). Available at: &lt;http://www.pewinternet.org/&gt;]]",
      "doi": ""
    },
    {
      "text": "Preece, J. Online communities: Designing usability and supporting sociability. John Wiley & Sons, Chichester, UK, 2000.]] ",
      "doi": "10.5555/517688"
    },
    {
      "text": "Reed, M. and Anderson, C. Evaluation of patient information Internet web sites about menopause and hormone replacement therapy. Maturitas 43 (2002), 135--154.]]",
      "doi": ""
    },
    {
      "text": "Riegelsberger, J., Sasse, M. A., & McCarthy, J. Shiny happy people building trust? Photos on e-commerce websites and consumer trust. Proc CHI 2003. ACM Press.]]  ",
      "doi": "10.1145/642611.642634"
    },
    {
      "text": "Shelat, B. and Egger, F.N. What makes people trust online gambling sites? An empirical study to identify on- and offline factors that influence gamblers' perception of an online casino's trustworthiness. Proc CHI 2002. ACM Press.]]  ",
      "doi": "10.1145/506443.506631"
    },
    {
      "text": "Smart, J M and Burling, D. Radiology and the internet: a systematic review of patient information resources, Clinical Radiology, 56(11), (2001) 867--870]]",
      "doi": ""
    },
    {
      "text": "Stanford, J., Tauber, E., Fogg, B.J. and Marable, L. Experts vs. Online Consumers: A Comparative Credibility Study of Health and Finance Web Sites. Consumer Web Watch Research Report (2002). Retrieved (August 2003) from: &lt;http://www.consumerwebwatch.org/news/report3_credibilityresearch/slicedbread_abstract.htm&gt;]]",
      "doi": ""
    },
    {
      "text": "Steinbruck, U., Schaumburg, H., Duda, S. and Kruger, T. A picture says more than a thousand words: photographs as trust builders in e-commerce websites. Proc. CHI 2002. ACM Press.]]  ",
      "doi": "10.1145/506443.506578"
    }
  ]
}