{
  "doi": "10.1145/985692.985781",
  "title": "The usability of massively multiplayer online roleplaying games: designing for new users",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "703-710",
  "year": 2004,
  "badges": [],
  "abstract": "This study examines the usability challenges faced by new players of massively multiplayer online role-playing games (MMORPGs), one of the fastest-growing segments of the video game industry. Played in completely online worlds, these games allow players to communicate with one another, form groups and communities, and compete in a variety of fantasy environments.Nineteen subjects participated in an exploratory usability study of four games, three MMORPGs and a similar single-player game used for comparison. Results reveal that many people not usually considered as potential players of these games may be interested in them, but a wide variety of usability issues present serious problems for players inexperienced with the genre. Based on an analysis of the usability data and player feedback, specific recommendations are made to improve the experience of these games for new players. These results further demonstrate the applicability and importance of usability testing to video games.",
  "tags": [
    "MMORPG",
    "online game",
    "RPG",
    "game usability",
    "roleplaying game",
    "massively-multiplayer"
  ],
  "authors": [
    {
      "name": "Steve Cornett",
      "institution": "Indiana University, Bloomington, IN",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100526368",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anarchy Online &lt;http://www.anarchyonline.com/&gt;",
      "doi": ""
    },
    {
      "text": "Bub, A. S. Computer Role-Playing games. GameSpy.com (April 2002). &lt;http://www.gamespy.com/articles/april02/rpgweek/rpg1/&gt;",
      "doi": ""
    },
    {
      "text": "Cuciz, D. The History of MUDs. GameSpy.com (April 2002). http://www.gamespy.com/articles/january01/muds1/",
      "doi": ""
    },
    {
      "text": "Dark Age of Camelot &lt;http://www.darkageofcamelot.com/&gt;",
      "doi": ""
    },
    {
      "text": "DFC Intelligence. Challenges and opportunities in the online game market. (June 2003). &lt;http://www.dfcint.com/game_article/june03article.html&gt;",
      "doi": ""
    },
    {
      "text": "EverQuest &lt;http://everquest.station.sony.com/&gt;",
      "doi": ""
    },
    {
      "text": "Federoff, M. A. Heuristics and usability guidelines for the creation and evaluation of fun in video games. Unpublished thesis, Indiana University, Bloomington (2003). &lt;http://melissafederoff.com/thesis.html&gt;",
      "doi": ""
    },
    {
      "text": "Fulton, B. & Medlock, M. Beyond focus groups: Getting more useful feedback from consumers. Proc. Game Developers' Conference 2003. &lt;&lt;http://www.microsoft.com/playtest/publications.htm&gt;",
      "doi": ""
    },
    {
      "text": "Fulton, B. Beyond psychological theory: Getting data that improve games. Proc. Game Developers' Conference 2002. &lt;http://www.microsoft.com/playtest/publications.htm&gt;",
      "doi": ""
    },
    {
      "text": "Medlock, M. C., Wixon, D., Terrano, M., Romero R., Fulton B. Using the RITE method to improve products: A definition and a case study. Proc. Usability Professional's Association 2002. &lt;http://www.microsoft.com/playtest/publications.htm&gt;",
      "doi": ""
    },
    {
      "text": "Neverwinter Nights &lt;http://nwn.bioware.com/&gt;",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Guerrilla HCI: Using Discount Usability Engineering to Penetrate the Intimidation Barrier. (1994). &lt;http://www.useit.com/papers/guerrilla_hci.html&gt; ",
      "doi": "10.5555/526071"
    },
    {
      "text": "Pagulayan, R., Keeker, K., Wixon, D., Romero, R. L., Fuller, T. User-Centered Design in Games. In Baecker, R. M., Grudin, J., Buxton, W. A. S., Greenberg, S. In Jacko, J., Sears, A. (Eds.), The Human-Computer Interaction Handbook. Mahwah, NJ: Lawrence Erlbaum Associates ",
      "doi": "10.5555/772072.772128"
    },
    {
      "text": "Wagner, J. A. Showdown in cyberspace: Star Wars vs. The Sims. Salon.com (July 9, 2002). &lt;http://www.salon.com/tech/feature/2002/07/09/mmorpg/index.html&gt;",
      "doi": ""
    },
    {
      "text": "Woodcock, B.S. An analysis of MMOG subscription growth (August, 2003). &lt;http://pw1.netcom.com/~sirbruce/Subscriptions.html&gt;",
      "doi": ""
    },
    {
      "text": "Yee, N. Gender and age distribution. The Daedalus Project 1--2 (2003). &lt;http://www.nickyee.com/daedalus/archives/000343.php&gt;",
      "doi": ""
    },
    {
      "text": "Yee, N. Number of accounts. The Daedalus Project 1-2 (2003). &lt;http://www.nickyee.com/daedalus/archives/000343.php&gt;",
      "doi": ""
    }
  ]
}