{
  "doi": "10.1145/985692.985736",
  "title": "Model-based evaluation of cell phone menu interaction",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "343-350",
  "year": 2004,
  "badges": [],
  "abstract": "Cell phone interfaces are now ubiquitous. In this paper, we describe concepts to support the analysis of cell phone menu hierarchies. We present an empirical study of user performance on five simple tasks of menu traversal on a cell phone. Two models we tested, based on GOMS and ACT-R, give very good predictions of behavior. We use the study results to motivate an effective evaluation process for menu hierarchies. Our work makes several contributions: a novel and timely study of a new, very common HCI task; new models for accurately predicting performance; novel development tools to support such modeling; and a search procedure to generate menu hierarchies that reduce traversal time, in simulation studies, by about a third.",
  "tags": [
    "cognitive modeling",
    "mobile telephones",
    "menu traversal",
    "evaluation"
  ],
  "authors": [
    {
      "name": "Robert St. Amant",
      "institution": "North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452610940",
      "orcid": "missing"
    },
    {
      "name": "Thomas E. Horton",
      "institution": "North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547892656",
      "orcid": "missing"
    },
    {
      "name": "Frank E. Ritter",
      "institution": "The Pennsylvania State University, University Park, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81341495549",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J., & Lebiere, C. (1998). The atomic components of thought. Mahwah, NJ: LEA.",
      "doi": ""
    },
    {
      "text": "Byrne, M. D., & Gray, W. D. (2003). Returning human factors to an engineering discipline: Expanding the science base through a new generation of quantitative methods-Preface to the special section. Human Factors, 45, 1--4.",
      "doi": ""
    },
    {
      "text": "Byrne, M. D. (2001). ACT-R/PM and menu selection: Applying a cognitive architecture to HCI. Int. J. Human-Computer Studies, 55(1):41--84.",
      "doi": "10.1006/ijhc.2001.0469"
    },
    {
      "text": "Charney, B. (2003). Cell phone use to double. CNET News.com, http://news.com.com/2100-1039-5060745.html, August 6, 2003.",
      "doi": ""
    },
    {
      "text": "Gray, W. D., John, B. E., and Atwood, M. E. (1993). Project Ernestine: Validating a GOMS analysis for predicting and explaining real-world task performance, Human-Computer Interaction, 8(3): 237--309.",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "John, B. (2003). Information processing and skilled behavior. HCI models, theories, and frameworks, Carroll, J. (ed), SF, CA: Morgan Kaufman.",
      "doi": ""
    },
    {
      "text": "Kieras, D. (1999). A Guide to GOMS Model Usability Evaluation using GOMSL and GLEAN3, ftp://www. eecs.umich.edu/people/kieras/GOMS/GOMSL_Guide.pdf.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. (2003). Motor behavior models for human-computer interaction. HCI models, theories, and frameworks, Carroll, J. (ed), SF, CA: Morgan Kaufman.",
      "doi": ""
    },
    {
      "text": "Nichols, S., & Ritter, F. E. (1995). A theoretically motivated tool for automatically generating command aliases. In Proceedings of CHI, 393--400. NY, NY: ACM.  ",
      "doi": "10.1145/223904.223955"
    },
    {
      "text": "Ritter, F. E., and Young, R. M. (2001). Embodied models as simulated users: Introduction to this special issue on using cognitive models to improve interface design. Int. J. Human-Computer Studies, 55(1):1--14.",
      "doi": "10.1006/ijhc.2001.0471"
    },
    {
      "text": "Salvucci, D. D., and Lee, F. J. (2003). Simple cognitive modeling in a complex cognitive architecture. Proceedings of CHI, 265-272. New York, NY: ACM.  ",
      "doi": "10.1145/642611.642658"
    },
    {
      "text": "St. Amant, R., and Riedl, M. O. (2001). A perception/ action substrate for cognitive modeling in HCI. Int. J. Human-Computer Studies, 55(1):15--39.",
      "doi": "10.1006/ijhc.2001.0470"
    },
    {
      "text": "Silfverberg, M., MacKenzie, I. S., and Korhonen, P. (2000). Predicting text entry speed on mobile phones, Proceedings of CHI, 9--16. New York, NY: ACM.  ",
      "doi": "10.1145/332040.332044"
    }
  ]
}