{
  "doi": "10.1145/985692.985726",
  "title": "Gummi: a bendable computer",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "263-270",
  "year": 2004,
  "badges": [],
  "abstract": "Gummi is an interaction technique and device concept based on physical deformation of a handheld device. The device consists of several layers of flexible electronic components, including sensors measuring deformation of the device. Users interact with this device by a combination of bending and 2D position control. Gummi explores physical interaction techniques and screen interfaces for such a device. Its graphical user interface facilitates a wide range of interaction tasks, focused on browsing of visual information. We implemented both hardware and software prototypes to explore and evaluate the proposed interaction techniques.Our evaluations have shown that users can grasp Gummi's key interaction principles within minutes. Gummi demonstrates promising possibilities for new interaction techniques and devices based on flexible electronic components.",
  "authors": [
    {
      "name": "Carsten Schwesig",
      "institution": "Interaction Lab,Sony CSL, Shinagawa-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100155716",
      "orcid": "missing"
    },
    {
      "name": "Ivan Poupyrev",
      "institution": "Interaction Lab,Sony CSL, Shinagawa-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593278",
      "orcid": "missing"
    },
    {
      "name": "Eijiro Mori",
      "institution": "Sony Design Center, Shinagawa-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100500926",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R., Fitzmaurice, G., Kurtenbach, G. and Singh, K. Exploring interactive curve and surface manipulation using a bend and twist sensitive input strip. Proc. Symposium on I3DG, 1999, ACM, 111--118.  ",
      "doi": "10.1145/300523.300536"
    },
    {
      "text": "Bickmore, T. and Schilit, B. Digestor: Device-independent access to the World Wide Web. Proc. 6th International World Wide Web Conference, 1997, ACM. ",
      "doi": "10.5555/283554.283349"
    },
    {
      "text": "Fitzmaurice, G.W., Situated information spaces and spatially aware palmtop computers. Communication of the ACM, 1993. 36(7), 38--49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Furnas, G. Generalized Fisheye View. Proc. CHI'93, ACM, 18--23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Gelinck, G., Geuns, T. and Leeuw, D. High-performance all-polymer integrated circuits. Applied Physics Letters, 2000, 77, 1487--1489.",
      "doi": ""
    },
    {
      "text": "Harrison, B., Fishkin, K., Gujar, A. et al. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. Proc. CHI'98, ACM, 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Hinckley, K., Pierce, J., Sinclair, M. and Horvitz, E. Sensing Techniques for Mobile Interaction. Proc. UIST'2000, ACM, 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Kamba, T., Elson, S., Harpold, T., Stamper, T. and Sukaviriya, P. Using small screen space more effectively. Proc. CHI'96, ACM, 383--390.  ",
      "doi": "10.1145/238386.238582"
    },
    {
      "text": "MacKenzie, S. and Soukoreff, R. Text entry for mobile computing: models and methods, theory and practice. Human-Computer Interaction, 2002. 17(2).",
      "doi": ""
    },
    {
      "text": "Masui, T. An efficient text input method for pen-based computers. Proc. UIST'98. ACM, 328--335.  ",
      "doi": "10.1145/274644.274690"
    },
    {
      "text": "Perlin, K. and Fox, D. Pad: an alternative approach to the computer interface. Proc. SIGGRAPH'93, ACM, 57--64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Pioneer Corporation R&D Laboratories. http://www.pioneer.co.jp/crdl/org/display-e.html",
      "doi": ""
    },
    {
      "text": "Poupyrev, I., Maruyama, S. and Rekimoto, J. Ambient Touch: Designing tactile interfaces for handheld devices. Proc. UIST'02, ACM, 51--60.  ",
      "doi": "10.1145/571985.571993"
    },
    {
      "text": "Poupyrev, I., Tan, D., Billinghurst, M., Kato, H., Regenbrecht, H et al. Developing a generic augmented-reality interface. IEEE Computer, 2002, 44--49.  ",
      "doi": "10.1109/2.989929"
    },
    {
      "text": "Rekimoto, J. Tilting operations for small screen interfaces. Proc. UIST'96, ACM, 167--168.  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Rekimoto, J. and Nagao, K. The World through the Computer: Computer Augmented Interaction with Real World Environments. Proc. UIST'95, ACM, 29--36.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Sarkar, M., Snibbe, S. Tversky, O. et al. Stretching the Rubber Sheet: A Metaphor for Viewing large Layouts on Small Screens. Proc. UIST'93, ACM, 81--91.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "Sawhney, N. and Schmandt, C. Nomadic Radio: Scalable and contextual notification for wearable audio messaging. Proc. CHI'99, ACM, 96--103.  ",
      "doi": "10.1145/302979.303005"
    },
    {
      "text": "Shaw, J. and Seidler, P. Organic electronics: Introduction. IBM Journal of Research and Development, 2001, 45(1), 3--10.  ",
      "doi": "10.1147/rd.451.0003"
    },
    {
      "text": "Trevor, J., Hilbert, D., Schilit, B. and Koh, T. From desktop to phonetop: A UI for web interaction on very small devices. Proc. UIST'01, ACM, 121--130.  ",
      "doi": "10.1145/502348.502366"
    },
    {
      "text": "Ward, D., Blackwell, A. and MacKay, D. Dasher: a data entry interface using continuous gestures and language models. Proc. UIST'00, ACM, 129--137.  ",
      "doi": "10.1145/354401.354427"
    }
  ]
}