{
  "doi": "10.1145/985692.985783",
  "title": "Virtual guiding avatar: an effective procedure to reduce simulator sickness in virtual environments",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "719-726",
  "year": 2004,
  "badges": [],
  "abstract": "This study developed a new procedure, a Virtual Guiding Avatar (VGA), which combined self-motion prediction cues and an independent visual background (IVB) to alleviate simulator sickness (SS). The VGA, which was embodied as an abstract airplane, was designed to lead the participant along a horizontal motion trajectory through a virtual environment. Both motion prediction cues and IVBs, which provide an earth-fixed reference frame, reduced SS in separate previous studies. Participants were exposed to complex visual motion through a cartoon-like simulated environment in a very wide field of view driving simulator. Participants' responses to avatars with varying motion properties - fixed, rotation only or rotation plus translation - were assessed using a within-subjects experimental design. Results indicated that SS was reduced by a VGA that presented rotational cues alone or rotation plus translation. The VGA also increased participants' sense of presence and enjoyment relative to conditions lacking a VGA. The VGA procedure can be used to enhance user experiences in immersive virtual environments as well as to improve motion simulator design.",
  "tags": [
    "avatar",
    "simulator sickness",
    "virtual environment",
    "prediction",
    "motion prediction"
  ],
  "authors": [
    {
      "name": "James J. W. Lin",
      "institution": "University of Washington, Seattle, WA",
      "img": "/do/10.1145/contrib-81500649421/rel-imgonly/james-lin_page_l2.jpg",
      "acmid": "81500649421",
      "orcid": "missing"
    },
    {
      "name": "Habib Abi-Rached",
      "institution": "University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100099317",
      "orcid": "missing"
    },
    {
      "name": "Michal Lahav",
      "institution": "University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350576893",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cobb, S.V.G., Nichols, S., Ramsey, A., and Wilson, J.R. Virtual reality induced symptoms and effects (VRISE). Presence: Teleoperators and Virtual Environments, 8(2), 1999, 169--186.  ",
      "doi": "10.1162/105474699566152"
    },
    {
      "text": "Duh, H.B.L. Use of an independent visual background to alleviate simulator sickness in the virtual environments that employ wide-field displays. Doctoral dissertation, Seattle: University of Washington, 2001. ",
      "doi": "10.5555/934827"
    },
    {
      "text": "Duh, H.B.L., Parker, D.E., and Furness, T.A. An \"independent visual background\" reduced balance disturbance evoked by visual scene motion: implication for alleviating simulator sickness. Proc. CHI 2001, ACM conference on Human Factors in Computing Systems, CHI Letters 3(1), 85--89.  ",
      "doi": "10.1145/365024.365051"
    },
    {
      "text": "Duncker, K. Ueber induzierte Bewegung. Ein Beitrag zur Theorie optisch wahrgenommener Bewegung. {Concerning induced movement. A contribution to the theory of visually perceived movement.} Psychologische-Forschung, 12, 1929, 180--259.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M., and Posner, M.I. Human Performance. Belmont, Cal.:Brooks Cole, 1967.",
      "doi": ""
    },
    {
      "text": "Gogel, W. C., and Kodlow, M. A. The effects of perceived distance on induced movement. Perception and Psychophysics, 10, 1971, 142--146.",
      "doi": ""
    },
    {
      "text": "Griffin, M.J. Handbook of Human Vibration. London: Academic Press, 1990.",
      "doi": ""
    },
    {
      "text": "Hallett, P.E. Primary and secondary saccades to goals defined by instructions. Vision Research, 18, 1978, 1279--1296.",
      "doi": ""
    },
    {
      "text": "Held, R. Exposure history as a factor in maintaining stability of perception and coordination. Journal of Nervous and Mental Disease, 132, 1961, 26--32.",
      "doi": ""
    },
    {
      "text": "Helmholz, H. The perceptions of vision. In J.P.C. Southall (Ed.), Treatise on Physiological Optics, 3, New York: Optics Society of America, 1925.",
      "doi": ""
    },
    {
      "text": "von Holst, E. and Mittelstaedt, H. Das reafferenzprinzip, Naturwissenschaften, 37, 1950, 464--474.",
      "doi": ""
    },
    {
      "text": "Kennedy, R. S., Lane, N., Berbaum, K., and Lilienthal, M. Simulator sickness questionnaire: an enhanced method for quantifying simulator sickness. International Journal of Aviation Psychology, 3, 1993, 203--220.",
      "doi": ""
    },
    {
      "text": "Kennedy, R.S. and Stanney, K.M. Aftereffects of virtual environment exposure: Psychometric issues. In M. Smith, G. Salvendy, & R. Koubek (Eds.), Design of computing systems: Social and ergonomic considerations. Amsterdam: Elsevier Science Publishers, 1997, 897--900.",
      "doi": ""
    },
    {
      "text": "Kim, D.H. Development of method for quantification and analysis of simulator sickness in a driving simulation environment. Doctoral dissertation, Seoul, South Korea: Hanyang University, 1999.",
      "doi": ""
    },
    {
      "text": "LaViola J.J. A discussion of cybersickness in virtual environments, ACM SIGCHI Bulletin, 32 (1), 2000, 47--56.  ",
      "doi": "10.1145/333329.333344"
    },
    {
      "text": "Lee, F.K., Sheldon, K.M., and Turban, D.B. Personality and the goal-striving process: The influence of achievement goal patterns, goal level, and mental focus on performance and enjoyment. Journal of Applied Psychology, 88(2), 2003, 256--265.",
      "doi": ""
    },
    {
      "text": "Lin, J.J.W., Abi-Rached, H., Parker, D.E., Kenyon, R.V., and Furness, T.A. Effects of interactivity and motion trajectory prediction on presence, enjoyment, and simulator sickness. Human Interface Technology Laboratory Tech. Rep. R-01-5, Seattle: University of Washington, 2001.",
      "doi": ""
    },
    {
      "text": "Lin, J.J.W., Duh, H.B.L., Abi-Rached H., Parker, D.E., and Furness, T.A. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. Proc. IEEEVR2002, 164-171. ",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Lin, J.J.W., Abi-Rached, H., Kim, D.H., Parker, D.E., and Furness, T.A. A \"Natural\" independent visual background reduced simulator sickness, Proc. the Human Factors and Ergonomics Society 46th Annual Meeting, Baltimore, MD, 2002.",
      "doi": ""
    },
    {
      "text": "Lin, J.J.W., Parker, D.E., Lahav M., and Furness, T.A. Unobtrusive turns prediction cues reduced simulator sickness during passive motion in a driving simulator. Submitted to Ergonomics.",
      "doi": ""
    },
    {
      "text": "Lin, J.J.W., Parker, D.E., Lunneborg, C.E., and Furness, T.A. Assessment of user experience in virtual environments - evaluation of the Enjoyment, Engagement, and Immersion (E2I) Scale by multivariate analyses and the Item Response Theory. Human Interface Technology Laboratory Tech. Rep. R-02-2, Seattle: University of Washington, 2002.",
      "doi": ""
    },
    {
      "text": "Prothero, J.D. The role of rest frames in vection, presence and motion sickness. Doctoral dissertation, Seattle: University of Washington, 1998. ",
      "doi": "10.5555/927383"
    },
    {
      "text": "Prothero, J.D., Draper, M.H., Furness, T.A., Parker, D.E., and Wells, M.J. The use of an independent visual background to reduce simulator side-effects. Aviation Space Environmental Medicine, 70, 1999, 277--83.",
      "doi": ""
    },
    {
      "text": "Reason, J.T., and Brand, J.J. Motion Sickness. London: Academic Press, 1975.",
      "doi": ""
    },
    {
      "text": "Rogenbrecht, H. and Schubert, T. Real and illusory interactions enhance presence in virtual environments. Presence: Teleoperators & Virtual Environments, 11(4), 2002, 425 -- 434.  ",
      "doi": "10.1162/105474602760204318"
    },
    {
      "text": "Rolnick, A. and Lubow, R.E. Why is the driver rarely motion sick? The role of controllability in motion sickness. Ergonomics, 34, 1991, 867--879.",
      "doi": ""
    },
    {
      "text": "Sperry, R.W. Neural Basis of the spontaneous optokinetic response produced by visual neural inversion, Journal of Comparative and Physiological Psychology, 43, 1950, 482--489.",
      "doi": ""
    },
    {
      "text": "Stanney, K.M. and Hash, P. Locus of user-initiated control in virtual environments: Influences on cybersickness. Presence: Teleoperators & Virtual Environments, 7(5), 1998, 447 -- 459.  ",
      "doi": "10.1162/105474698565848"
    },
    {
      "text": "Stanney, K.M., and Kennedy R.S. The psychometrics of cybersickness. Commun. ACM, 40(8), 1997, 66 -- 68.  ",
      "doi": "10.1145/257874.257889"
    }
  ]
}