{
  "doi": "10.1145/985692.985698",
  "title": "Caretta: a system for supporting face-to-face collaboration by integrating personal and shared spaces",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "41-48",
  "year": 2004,
  "badges": [],
  "abstract": "In this paper, a system called Caretta that integrates personal and shared spaces to support face-to-face collaboration is described. We use PDAs and a multiple-input sensing board for personal and shared spaces, respectively. Users of Caretta can discuss and negotiate with each other in the shared space by manipulating physical objects, while they individually examine their ideas in their own personal spaces. Caretta allows users to participate in group activities interchangeably and seamlessly using both these spaces. Caretta is applicable to various collaborative tasks. In this paper, it supports users in urban planning tasks. User studies of Caretta demonstrated that it allowed users to collaborate in a flexible fashion: users could work individually in their personal spaces at their own pace, cooperatively work together in the shared space, and smoothly transition between both of the spaces.",
  "authors": [
    {
      "name": "Masanori Sugimoto",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100344146",
      "orcid": "missing"
    },
    {
      "name": "Kazuhiro Hosoi",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331494616",
      "orcid": "missing"
    },
    {
      "name": "Hiromichi Hashizume",
      "institution": "National Institute of Informatics, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100071502",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arias, E., Eden, H., Fischer, G., Gorman, A., and Schraff, E. Transcending the Individual Human Mind-Creating Shared Understanding through Collaborative Design. ACM Transactions on Computer-Human Interaction 7, 1 (2000), 84--113.  ",
      "doi": "10.1145/344949.345015"
    },
    {
      "text": "Fjeld, M., Lauche, K., Bichsel, M., Voorhorst, F., Krueger, H., and Rauterberg, M. Physical and Virtual Tools: Activity Theory Applied to the Design of Groupware, Computer Supported Cooperative Work, 11(1-2), 153--180, 2002.  ",
      "doi": "10.1023/A%3A1015269228596"
    },
    {
      "text": "Greenberg, S., Boyle, M., and LaBerge, J. PDAs and Shared Public Displays: Making Personal Information Public and Public Information Personal. Personal Technologies 3, 1 (1999), 54--64.",
      "doi": ""
    },
    {
      "text": "Gutwin, C., and Greenberg. S. Design for Individuals, Design for Groups: Tradeoffs between Power and Workspace Awareness. In Proceedings of CSCW'98 (November, Seattle, WA), ACM Press, 1998, pp. 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Ishii, H., and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits, and Atoms. In Proceedings of CHI'97 (March, Atlanta, GA), ACM Press, 1997, pp. 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Jacob, R., Ishii, H., Pangaro, G., and Patten, J. A Tangible Interface for Organizing Information Using a Grid, in Proceedings of CHI2002 (April, Minneapolis, MN), ACM Press, 2002, pp. 339--346.  ",
      "doi": "10.1145/503376.503437"
    },
    {
      "text": "Klemmer, S., Newman, M., Farrell, R., Bilezikjian, M., and Landay, J. The Designers' Outpost: A Tangible Interface for Collaborative Web Site Design. In Proceedings of UIST2001, (November, Orlando, FL), ACM Press, 2001, pp. 1--10.  ",
      "doi": "10.1145/502348.502350"
    },
    {
      "text": "Kusunoki, F., Sugimoto, M., and Hashizume, H. A System for Supporting Group Learning that Enhances Interactions. In Proceedings of CSCL'99, (December, Stanford, CA), 1999, pp. 323--327. ",
      "doi": "10.5555/1150240.1150280"
    },
    {
      "text": "Mandryk, R, Maranan, D., and Inkpen, K. False Prophets: Exploring Hybrid Board/Video Games, In Proceedings of CHI2002, (April, Minneapolis, MN), ACM, 2002, pp. 640--641.  ",
      "doi": "10.1145/506443.506523"
    },
    {
      "text": "Myers, B., Stiehl, H. and Gargiulo, R. Collaboration Using Multiple PDAs Connected to a PC. In Proceedings of CSCW'98, (November, Seattle, WA), ACM Press, 1998, pp. 285--294.  ",
      "doi": "10.1145/289444.289503"
    },
    {
      "text": "Rekimoto, J. A Multiple Device Approach for Supporting Whiteboard-based Interactions. In Proceedings of CHI'98 (April, Los Angeles, CA), ACM Press, 1998, 18--23.  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "Rekimoto, J., and Saitoh, M. A Spatially Continuous Workspace for Hybrid Computing Environment. In Proceedings of CHI'99 (May, Pittsburgh, PA,), ACM Press, 1999, pp. 377--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Shoemaker, G., and Inkpen, K. Single Display Privacyware: Augmenting Public Displays with Private Information. In Proceedings of CHI2001, (April, Seattle, WA), ACM Press, 2001, pp. 522--529.  ",
      "doi": "10.1145/365024.365349"
    },
    {
      "text": "Streitz, N., et al. i-LAND: An Interactive Landscape for Creativity and Innovation, in Proceedings of CHI'99, (May, Pittsburgh, PA), ACM Press, 1999, pp. 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Stewart, B., Bederson, B., and Druin, A. Single Display Groupware: A Model for Co-present Collaboration. In Proceedings of CHI' 99 (April, Pittsburgh, PA), ACM Press, 1998, pp. 286--293.  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Sugimoto, M., Kusunoki, F., and Hashizume, H. E2board: An Electronically Enhanced Board for Games and Group Activity Support. In Proceedings of the International Conference on Affective Human Factors Design (June, Singapore), 2001, pp. 238--245.",
      "doi": ""
    },
    {
      "text": "Sugimoto, M., Kusunoki, F., and Hashizume, H. Design of an Interactive System for Group Learning Support. In Proceeding of DIS2002 (June, London, UK), ACM Press, 2002, pp. 50--55.  ",
      "doi": "10.1145/778712.778723"
    },
    {
      "text": "Tandler, P., Prante, T., Muller-Tomfelde, C., Streitz, N., and Steinmetz, R. ConnecTable: Dynamic Coupling of Displays of the Flexible Creation of Shared workspace. In Proceedings of UIST2001 (November, Orlando, FL), ACM Press, 2001, pp. 11--20.  ",
      "doi": ""
    },
    {
      "text": "Underkoffler, J., and Ishii, H. Urp: A Luminous-Tangible Workbench for Urban Planning and Design. In Proceedings of CHI'99 (May, Pittsburgh, PA), ACM Press, 1999, pp. 386--393.  ",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Zanellra, A, and Greenberg, S. Reducing Interference in Single Groupware through Transparency, In Proceedings of ECSCW2001 (September, Bonn, Germany), Kluwer Academic Publishers, 2001, pp. 339--358. ",
      "doi": "10.5555/1241867.1241885"
    }
  ]
}