{
  "doi": "10.1145/985692.985728",
  "title": "IM here: public instant messaging on large, shared displays for workgroup interactions",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "279-286",
  "year": 2004,
  "badges": [],
  "abstract": "Instant messaging (IM) in the workplace has proven to be a valuable tool for facilitating informal communication. Its benefits, however, are generally limited to times when users are in front of their computers. Because so much work takes place while people are mobile within their workplace, we sought to extend the benefits of IM beyond people's personal machines and into publicly accessible groupware. We first conducted a study of large display groupware applications (LDGAs) to understand the affordances that large displays offer for groupware, and the factors surrounding their adoption. We developed the IM Here system for shared IM on large displays using the lessons learned from the study. In this paper, we present the findings of our LDGA study, the design of IM Here and the preliminary results of our evaluation of IM as a public resource for workgroups.",
  "tags": [
    "instant messaging",
    "public displays",
    "groupware",
    "large displays",
    "computer mediated communication"
  ],
  "authors": [
    {
      "name": "Elaine M. Huang",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100080130",
      "orcid": "missing"
    },
    {
      "name": "Daniel M. Russell",
      "institution": "IBM Almaden Research Center, San Jose, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589296",
      "orcid": "0000-0002-7243-9317"
    },
    {
      "name": "Alison E. Sue",
      "institution": "IBM Almaden Research Center, San Jose, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100265477",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Churchill, E., Nelson, L., Denoue, L., Girgensohn, A. The Plasma Poster Network: Posting Multimedia Content in Public Places. Proc. INTERACT'03.",
      "doi": ""
    },
    {
      "text": "Fass, A. Forlizzi, J., Pausch, R. MessyDesk and MessyBoard: Two Designs Inspired by the Goal of Improving Human Memory. Proc. DIS'02, 303--311.  ",
      "doi": "10.1145/778712.778754"
    },
    {
      "text": "Greenberg, S., Rounding, M. The Notification Collage: Posting Information to Public and Personal Displays. Proc. CHI'01, 514--521.  ",
      "doi": "10.1145/365024.365339"
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: Eight challenges for developers. Communications of the ACM, 37, 1, 1994, 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Huang, E., Mynatt, E. Semi-Public Displays for Small, Co-Located Groups. Proc. CHI'03, 49--56.  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "iLoft: http://www-cdr.stanford.edu/iloft/",
      "doi": ""
    },
    {
      "text": "Isaacs, E., Walendowski, A., Whittaker, S., Schiano, D., Kamm, C. The Character, Functions, and Styles of Instant Messaging in the Workplace. Proc. CSCW'02, 11--20.  ",
      "doi": "10.1145/587078.587081"
    },
    {
      "text": "Johanson, B., Fox, A., Winograd, T. The Interactive Workspaces Project: Experiences with Ubiquitous Computing Rooms &lt;https://graphics.stanford.edu/papers/iwork-overview/&gt;, IEEE Pervasive Computing 1:2, 67--75.  ",
      "doi": "10.1109/MPRV.2002.1012339"
    },
    {
      "text": "Klemmer, S., Newman, M., Farrell, R., Bilezikjian, M., Landay, J. The Designers Outpost: A Tangible Interface for Collaborative Web Site Design. Proc. UIST'01, 1--10.  ",
      "doi": "10.1145/502348.502350"
    },
    {
      "text": "McCarthy, J. Costa, T., Liongosari, E. UniCast, OutCast & GroupCast: Three Steps Toward Ubiquitous, Peripheral Displays. Proc. Ubicomp'01, 332--345. ",
      "doi": "10.5555/647987.741333"
    },
    {
      "text": "Nardi, B., Whittaker, S., Bradner, E. Interaction and Outeraction: Instant Messaging in Action. Proc. CSCW'00, 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "O'Hara, K., Perry, M., Lewis, S. Social Coordination Around a Situated Display Appliance. Proc. CHI'03, 65--72.  ",
      "doi": "10.1145/642611.642624"
    },
    {
      "text": "Russell, D., Gossweiler, R. On the Design of Personal & Communal Large Information Scale Appliances. Proc. Ubicomp'01, 354--361. ",
      "doi": "10.5555/647987.757257"
    },
    {
      "text": "Sametime: http://www.lotus.com/products/lotussametime.nsf/wdocs/homepage",
      "doi": ""
    },
    {
      "text": "Smart Technologies: http://www.smarttech.com",
      "doi": ""
    },
    {
      "text": "Tan, D.S., Czerwinski, M. (2003). Information Voyeurism: Social Impact of Physically Large Displays on Information Privacy. Extended Abstracts of CHI'03, 748--749.  ",
      "doi": "10.1145/765891.765967"
    },
    {
      "text": "Trimble, J., Wales, R., Gossweiler, R. NASA Position Paper for the CSCW 2002 Workshop on Public, Community and Situated Displays: MERBoard.",
      "doi": ""
    },
    {
      "text": "Whittaker, S., Frolich, D., Daly-Jones, O. Informal Workplace Communication: What is it Like and How Might We Support it? Proc. CHI'94. 131--137.  ",
      "doi": "10.1145/191666.191726"
    }
  ]
}