{
  "doi": "10.1145/985692.985730",
  "title": "Improving speech playback using time-compression and speech recognition",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "295-302",
  "year": 2004,
  "badges": [],
  "abstract": "Despite the ready availability of digital recording technology and the continually decreasing cost of digital storage, browsing audio recordings remains a tedious task. This paper presents evidence in support of a system designed to assist with information comprehension and retrieval tasks from a large collection of recorded speech. Two techniques are employed to assist users with these tasks. First, a speech recognizer creates necessarily error-laden transcripts of the recorded speech. Second, audio playback is time-compressed using the SOLAFS technique. When used together, subjects are able to perform comprehension tasks with more speed and accuracy.",
  "tags": [
    "time-compressed audio",
    "information retrieval",
    "speech recognition"
  ],
  "authors": [
    {
      "name": "Sunil Vemuri",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100014051",
      "orcid": "missing"
    },
    {
      "name": "Philip DeCamp",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100370425",
      "orcid": "missing"
    },
    {
      "name": "Walter Bender",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100458252",
      "orcid": "missing"
    },
    {
      "name": "Chris Schmandt",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100444749",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arons, B. Techniques, Perception, and Applications of Time-Compressed Speech. Proc. 1992 Conference, American Voice I/O Society, 169--177. (1992)",
      "doi": ""
    },
    {
      "text": "Arons, B. SpeechSkimmer: Interactively Skimming Recorded Speech. Proc. UIST 1993, 187--196. (November 1993).  ",
      "doi": "10.1145/168642.168661"
    },
    {
      "text": "Beasley, D.S. and Maki, J.E. Time- and Frequency-Altered Speech. In N.J. Lass, editor, Contemporary Issues in Experimental Phonetics, Academic Press, 419--458. (1976).",
      "doi": ""
    },
    {
      "text": "Foulke, W., and Sticht, T.G. Review of research on the intelligibility and comprehension of accelerated speech. Psychological Bulletin, 72, 50--62, (1969).",
      "doi": ""
    },
    {
      "text": "Garofolo, J., Auzanne, C., and Voorhees, E. The TREC Spoken Document Retrieval Track: A Success Story. Proc. TREC 8. 107--130. (1999).",
      "doi": ""
    },
    {
      "text": "Gemmell, J., Bell, G., Lueder, R., Drucker, S., and Wong, C., MyLifeBits: Fulfilling the Memex Vision, Proc. ACM Multimedia '02, Juan-les-Pins, France, 235--238. (December 2002).  ",
      "doi": "10.1145/641007.641053"
    },
    {
      "text": "Gerasimov, V., Every Sign of Life, MIT Ph.D. Thesis, Media Arts & Sciences. (January 2003). ",
      "doi": "10.5555/1087555"
    },
    {
      "text": "Henja, D. and Musicus, B.R., The SOLAFS Time-Scale Modification Algorithm, BBN Technical Report, (July 1991).",
      "doi": ""
    },
    {
      "text": "LifeLog, http://www.darpa.mil/baa/baa03-30.htm",
      "doi": ""
    },
    {
      "text": "Lin, W., Hauptmann, A.G. A Wearable Digital Library of Personal Conversations. In JCDL 2002: 277--278 (2002).  ",
      "doi": "10.1145/544220.544280"
    },
    {
      "text": "Orr, D.B., Friedman, H.L., and Williams, J.C., Trainability of Listening comprehension of Speeded Discourse.\" Journal of Educational Psychology, 56, 148--156 (1965).",
      "doi": ""
    },
    {
      "text": "Salton, G., Automatic Text Processing: the transfomation, analysis, and retrieval of information by computer. Addison-Wesley (1989). ",
      "doi": "10.5555/77013"
    },
    {
      "text": "Schmandt, C. The Intelligent Ear: An Interface to Digital Audio. Proc. IEEE International on Cybernetics and Society, IEEE, Atlanta, GA (1981).",
      "doi": ""
    },
    {
      "text": "Schmandt, C. Voice Communication with Computers: Conversational Systems. Van Nostrand Reinhold, New York. (1994). ",
      "doi": "10.5555/156633"
    },
    {
      "text": "Stifelman, L., Arons, B., and Schmandt, C. The audio notebook: paper and pen interaction with structured speech. Proc. CHI 2001, 182--189, (2001).  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Sticht, T.G. Comprehension of repeated time-compression recordings. The Journal of Experimental Education, 37(4), (Summer 1969)",
      "doi": ""
    },
    {
      "text": "Stark, L., Whittaker, S., and Hirschberg, J. ASR satisficing: the effects of ASR accuracy on speech retrieval. Proc. International Conference on Spoken Language Processing. (2000).",
      "doi": ""
    },
    {
      "text": "ViaVoice, http://www-3.ibm.com/software/speech/",
      "doi": ""
    },
    {
      "text": "ViaVoice, Frequently Asked Questions http://www.wizzardsoftware.com/voice/voicetools/dictationforsdkfaq.htm#What%20is%20Phrase%20Score.",
      "doi": ""
    },
    {
      "text": "Wactlar H.D., Hauptman A.G., and Witbrock M.J., Informedia News-On Demand: Using Speech Recognition to Create a Digital Video Library. Tech Report. CMU-CS-98-109 (March 1998).",
      "doi": ""
    },
    {
      "text": "Whittaker, S., pers. comm. (December 2003).",
      "doi": ""
    },
    {
      "text": "Whittaker, S., Hirschberg, J., Amento, B., Stark, L., Bacchiani, M., Isenhour, P., Stead, L., Zamchick G., & Rosenberg, A. SCANMail: a voicemail interface that makes speech browsable, readable and searchable. Proc. CHI 2002. 275--82 (2002).  ",
      "doi": "10.1145/503376.503426"
    },
    {
      "text": "Witbrock, M., http://infonortics.com/searchengines/boston1999/witbrock/index.htm, Lycos (1999).",
      "doi": ""
    }
  ]
}