{
  "doi": "10.1145/985692.985748",
  "title": "Physically large displays improve path integration in 3D virtual navigation tasks",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "439-446",
  "year": 2004,
  "badges": [],
  "abstract": "Previous results have shown that users perform better on spatial orientation tasks involving static 2D scenes when working on physically large displays as compared to small ones. This was found to be true even when the displays presented the same images at equivalent visual angles. Further investigation has suggested that large displays may provide a greater sense of presence, which biases users into adopting more efficient strategies to perform tasks. In this work, we extend those findings, demonstrating that users are more effective at performing 3D virtual navigation tasks on large displays. We also show that even though interacting with the environment affects performance, effects induced by interactivity are independent of those induced by physical display size. Together, these findings allow us to derive guidelines for the design and presentation of interactive 3D environments on physically large displays.",
  "authors": [
    {
      "name": "Desney S. Tan",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    },
    {
      "name": "Peter G. Scupelli",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100126432/rel-imgonly/cropped_scupelli.jpg",
      "acmid": "81100126432",
      "orcid": "missing"
    },
    {
      "name": "Randy Pausch",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arthur, K.W. (2000). Effects of field of view on performance with head-mounted displays. Dissertation Abstracts International, 61(5B), 2614. ",
      "doi": "10.5555/931187"
    },
    {
      "text": "Baudisch, P., Good, N., Belloti, V., & Schraedley, P. (2002). Keeping things in context: A comparative evaluation of focus plus context screens, overviews, and zooming. Proceedings of CHI 2002, 259--266.  ",
      "doi": "10.1145/503376.503423"
    },
    {
      "text": "Bell, S. (2002). Spatial cognition and scale: A child's perspective. Journal of Environmental Psychology, 22, 9--27.",
      "doi": ""
    },
    {
      "text": "Booth, K., Fisher, B., Page, S., Ware, C., & Widen, S. (2000). Wayfinding in a virtual environment. Graphics Interface.",
      "doi": ""
    },
    {
      "text": "Bystrom, K.E., Barfield, W., & Hendrix, C. (1999). A conceptual model of the sense of presence in virtual environments. Presence: Teleoperators and Virtual Environments, 8(2), 241--244.  ",
      "doi": "10.1162/105474699566107"
    },
    {
      "text": "Chance, S.S., Gaunet, F., Beall, A.C., & Loomis, J.M. (1998). Locomotion mode affects the updating of objects encounter during travel: The contribution of vestibular and proprioceptive inputs to path integration. Presence: Teleoperators and Virtual Environments, 7(2), 168--178.  ",
      "doi": "10.1162/105474698565659"
    },
    {
      "text": "Cutmore, T.R.H., Hine, T.J., Maberly, K.J., Langford, N.M., & Hawgood, G. (2000). Cognitive and gender factors influencing navigation in a virtual environment. International Journal of Human-Computer Studies, 53, 223--249.  ",
      "doi": "10.1006/ijhc.2000.0389"
    },
    {
      "text": "Czerwinski, M., Tan, D.S., & Robertson, G.G. (2002). Women take a wider view. Proceedings of CHI 2002, 195--202.  ",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Ekstrom, R.B., French, J.W., Harman, H.H, & Derman, D. (1976). Kit of factor-referenced cognitive tests. Educational Testing Service: Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "Flach, J. (1990). Control with an eye for perception: Percursors to an active psychophysics. Ecological Psychology, 2, 83--111.",
      "doi": ""
    },
    {
      "text": "Fujita, N., Klatzky, R.L., Loomis, J.M., & Golledge, R.G. (1993). The encoding-error model of pathway completion without vision. Geographical Analysis, 25, 295--314.",
      "doi": ""
    },
    {
      "text": "Golledge, R.G. (Ed.). (1999) Wayfinding behavior: Cognitive mapping and other spatial processes. Johns Hopkins University Press: Baltimore, MD.",
      "doi": ""
    },
    {
      "text": "Grabe, M.E., Lombard, M., Reich, R.D., Bracken, C.C., & Ditton, T.B. (1999). The role of screen size in viewer experiences of media content. Visual Communication Quarterly, 6, 4--9.",
      "doi": ""
    },
    {
      "text": "Just, M.A., & Carpenter, P.A. (1985). Cognitive coordinate systems: Accounts of mental rotation and individual differences in spatial ability. Psychological Review, 92(2), 137--172.",
      "doi": ""
    },
    {
      "text": "Kearns, M.J., Warren, W.H., Duchon, A.P., & Tarr, M.J. (2002). Path integration from optic flow and body senses in a homing task. Perception, 31, 349--374.",
      "doi": ""
    },
    {
      "text": "Klatzky, R.L., Loomis, J.M., Beall, A.C., Chance, S.S., & Golledge, R.G. (1998). Spatial updating of self-position and orientation during real, imagined, and virtual locomotion. Psychological Science, 9(4), 293--298.",
      "doi": ""
    },
    {
      "text": "Loomis, J.M., Klatzky, R.L., Golledge, R.G., Cicinelli, J.G., Pellegrino, J.W., & Fry, P.A. (1993). Nonvisual navigation by blind and sighted: Assessment of path integration ability. Journal of Experimental Psychology: General, 122(1), 73--91.",
      "doi": ""
    },
    {
      "text": "MacIntyre, B., Mynatt, E.D., Voida, S., Hansen, K.M., Tullio, J., & Corso, G.M. (2001). Support for multitasking and background awareness using interactive peripheral displays, Proceedings of UIST 2001, 41--50.  ",
      "doi": "10.1145/502348.502355"
    },
    {
      "text": "Patrick, E., Cosgrove, D., Slavkovic, A., Rode, J.A., Verratti, T., & Chiselko, G. (2000). Using a large projection screen as an alternative to head-mounted displays for virtual environments. Proceedings of CHI 2000, 478--485.  ",
      "doi": "10.1145/332040.332479"
    },
    {
      "text": "Peruch, P., May, M., & Wartenberg, F. (1997). Homing in virtual environments: Effects of field of view and path layout. Perception, 26, 301--311.",
      "doi": ""
    },
    {
      "text": "Philbeck, J.W., Klatzky, R.L., Behrmann, M., Loomis, J.M., & Goodridge, J. (2001). Active control of locomotion facilitates nonvisual navigation. Journal of Experimental Psychology: Human Perception and Performance, 27, 141--153.",
      "doi": ""
    },
    {
      "text": "Prothero, J.D., & Hoffman, H.D. (1995). Widening the field of view increases the sense of presence within immersive virtual environments. Technical Report, University of Washington, Seattle, WA, R-95-4.",
      "doi": ""
    },
    {
      "text": "Riecke, B.E., van Veen, H.A.H.C., & Büülthoff, H.H. (2000). Visual homing is possible without landmarks: A path integration study in virtual reality. Max-Planck-Institut für biologische Kybernetik, Germany.  ",
      "doi": "10.1162/105474602320935810"
    },
    {
      "text": "Rieser, J. J. (1989) Access to knowledge of spatial structure at novel points of observation. Journal of Experimental Psychology: Learning, Memory and Cognition, 15, 1157--1165.",
      "doi": ""
    },
    {
      "text": "Slater, M., & Usoh, M. (1993). Presence in Immersive Virtual Environments. Proceedings of IEEE VRAIS, 90--96.",
      "doi": "10.1109/VRAIS.1993.380793"
    },
    {
      "text": "Tan, D.S., Gergle, D., Scupelli, P.G., Pausch, R. (2003). With similar visual angles, larger displays improve spatial performance. Proceedings of CHI 2003, 217--224.  ",
      "doi": "10.1145/642611.642650"
    },
    {
      "text": "Tan, D.S., Stefanucci, J.K., Proffitt, D.R., & Pausch, R. (2001). The Infocockpit: Providing location and pace to aid human memory. Workshop on Perceptive User Interfaces 2001.  ",
      "doi": "10.1145/971478.971526"
    }
  ]
}