{
  "doi": "10.1145/985692.985723",
  "title": "Feeling bumps and holes without a haptic interface: the perception of pseudo-haptic textures",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "239-246",
  "year": 2004,
  "badges": [],
  "abstract": "We present a new interaction technique to simulate textures in desktop applications without a haptic interface. The proposed technique consists in modifying the motion of the cursor on the computer screen - i.e. the Control/Display ratio. Assuming that the image displayed on the screen corresponds to a top view of the texture, an acceleration (or deceleration) of the cursor indicates a negative (or positive) slope of the texture. Experimental evaluations showed that participants could successfully identify macroscopic textures such as bumps and holes, by simply using the variations of the motion of the cursor. Furthermore, the participants were able to draw the different profiles of bumps and holes which were simulated, correctly. These results suggest that our technique enabled the participants to successfully conjure a mental image of the topography of the macroscopic textures. Applications for this technique are: the feeling of images (pictures, drawings) or GUI components (windows' edges, buttons), the improvement of navigation, or the visualization of scientific data.",
  "tags": [
    "texture",
    "bump and hole",
    "control/display ratio",
    "pseudo-haptic"
  ],
  "authors": [
    {
      "name": "Anatole Lécuyer",
      "institution": "SIAMES Project, INRIA/IRISA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289712",
      "orcid": "missing"
    },
    {
      "name": "Jean-Marie Burkhardt",
      "institution": "University of Paris 5/INRIA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100178417",
      "orcid": "missing"
    },
    {
      "name": "Laurent Etienne",
      "institution": "University of Rennes 1/IRISA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660070665",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akamatsu, M., and MacKenzie, I.S. Movement Characteristics Using a Mouse with Tactile and Force Feedback. IJHCS, Vol. 45, 483--493, (1996).  ",
      "doi": "10.1006/ijhc.1996.0063"
    },
    {
      "text": "Bach-y-Rita, P., Webster, J.G., Thompkins, W.J. and Crabb, T. Sensory Substitution for Space Gloves and for Space Robots. Workshop on Space Telerobotics, Vol. 2, 51--57, (1987).",
      "doi": ""
    },
    {
      "text": "Basdogan, C., Ho, C.H., and Srinivasan, M.A. A ray-based haptic rendering technique for displaying shape and texture of 3D objects in virtual environments. ASME Dynamic Systems and Control Division, DSC-Vol. 61, 77--84, (1997).",
      "doi": ""
    },
    {
      "text": "Bier, E., and Stone, M. Snap-dragging. ACM SIGGRAPH, 20(4):233--240, (1986).  ",
      "doi": "10.1145/15886.15912"
    },
    {
      "text": "Burdea, G. Force and Touch Feedback for Virtual Reality, John Wiley & Sons, New York, (1996). ",
      "doi": "10.5555/232471"
    },
    {
      "text": "Campbell, C.S., Zhai, S., May, K.W., and Maglio, P.P. What You Feel Must Be What You See: Adding Tactile Feedback to the Trackpoint. INTERACT, 383--390, (1999).",
      "doi": ""
    },
    {
      "text": "Han, H., Yamashita, J., and Fujishiro, I. 3D Haptic Shape Perception Using a 2D Device, Technical Sketches of ACM SIGGRAPH, (2002).  ",
      "doi": "10.1145/1242073.1242148"
    },
    {
      "text": "Hasser, C.J., Goldenberg, A.S., Martin, K.M., and Rosenberg, L.B. User Performance in a GUI Pointing Task with a Low-cost Force-Feedback Computer Mouse. ASME Dynamics Systems and Control Division, DSC-Vol. 64, 151--156, (1998).",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J., and Kassell, N. Passive Real-World Interface Props for Neurosurgical Visualization. ACM CHI, 452--458, (1994).  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Immersion Corporation. http://www.immersion.com",
      "doi": ""
    },
    {
      "text": "Kawai, Y., and Tomita, F. Evaluation of Interactive Tactile Display System. Int. Conf. on Computers Helping People with Special Needs, 29--36, (1998).",
      "doi": ""
    },
    {
      "text": "Lécuyer, A., Coquillart, S., Kheddar, A., Richard, P., and Coiffet, P. Pseudo-Haptic Feedback : Can Isometric Input Devices Simulate Force Feedback? IEEE VR, (2000).",
      "doi": ""
    },
    {
      "text": "Macromedia Inc. http://wwwmacromedia.com",
      "doi": ""
    },
    {
      "text": "Minsky, M.D.R. Computational Haptics: The Sandpaper System for Synthesizing Texture with a Force-Feedback Haptic Display. Ph.D. Thesis, MIT, (1995). ",
      "doi": "10.5555/240160"
    },
    {
      "text": "Reachin Technologies. http://www.reachin.se",
      "doi": ""
    },
    {
      "text": "Robles-De-La-Torre, G., and Hayward, V. Force Can Overcome Object Geometry in the Perception of Shape Through Active Touch. Nature, 412, 445--448, (2001).",
      "doi": ""
    },
    {
      "text": "Swaminathan, K., and Sato, S. Interaction design for large displays. Interactions, 4(1):15--24, (1997).  ",
      "doi": "10.1145/242388.242395"
    },
    {
      "text": "Zhai, S., Morimoto, C., and Ihde, S. Manual and gaze input cascaded (MAGIC) pointing. ACM CHI, 246--253, (1999).  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}