{
  "doi": "10.1145/985692.985745",
  "title": "The perfect search engine is not enough: a study of orienteering behavior in directed search",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "415-422",
  "year": 2004,
  "badges": [],
  "abstract": "This paper presents a modified diary study that investigated how people performed personally motivated searches in their email, in their files, and on the Web. Although earlier studies of directed search focused on keyword search, most of the search behavior we observed did not involve keyword search. Instead of jumping directly to their information target using keywords, our participants navigated to their target with small, local steps using their contextual knowledge as a guide, even when they knew exactly what they were looking for in advance. This stepping behavior was especially common for participants with unstructured information organization. The observed advantages of searching by taking small steps include that it allowed users to specify less of their information need and provided a context in which to understand their results. We discuss the implications of such advantages for the design of personal information management tools.",
  "tags": [
    "context",
    "orienteering",
    "teleporting",
    "observational study",
    "search",
    "information seeking"
  ],
  "authors": [
    {
      "name": "Jaime Teevan",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Christine Alvarado",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550973056",
      "orcid": "missing"
    },
    {
      "name": "Mark S. Ackerman",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81100017207/rel-imgonly/81100017207.jpg",
      "acmid": "81100017207",
      "orcid": "0000-0001-9727-1664"
    },
    {
      "name": "David R. Karger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/do/10.1145/contrib-81100337812/rel-imgonly/square-photo-2.0569-17-centered.jpg",
      "acmid": "81100337812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M. S., and Halverson, C. (1998). Considering an organization's memory. In Proc. of CSCW '98, 39--48.  ",
      "doi": "10.1145/289444.289461"
    },
    {
      "text": "Bates, M. (1979). Information search tactics. JASIS, 30: 205--214.",
      "doi": ""
    },
    {
      "text": "Bates, M. (1989). The design of browsing and berrypicking techniques for the online search interface. Online Review, 13: 407--424.",
      "doi": ""
    },
    {
      "text": "Belkin, N. J. (1993). Interaction with texts: Information retrieval as information-seeking behavior. In Proc. of Information Retrieval, 55--66.",
      "doi": ""
    },
    {
      "text": "Bernard, H. R. (1994). Research methods in anthropology: Qualitative and quantitative approaches. Landham, MD: Altamira Press. ",
      "doi": "10.5555/517965"
    },
    {
      "text": "Broder, A. (2002). A Taxonomy of Web search. SIGIR Forum, 36(2): 3--10.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Capra, R. G. and Perez-Quinones, M. A. (2003). Re-finding found things: An exploratory study of how users re-find information, Technical Report, Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N. and Bellotti, V. (2001). E-mail as habitat: An exploration of embedded personal information management. interactions, 8(5): 30--38.  ",
      "doi": "10.1145/382899.383305"
    },
    {
      "text": "Dumais, S., Cutrell, E. and Chen, H. (2001). Optimizing search by showing results in context. In Proc. of CHI '01, 277--284.  ",
      "doi": "10.1145/365024.365116"
    },
    {
      "text": "Jones, W., Dumais, S. and Bruce, H. (2002). Once found, what then?: A study of \"keeping\" behaviors in the personal use of Web information. In Proc. of ASIST '02, 391--402.",
      "doi": ""
    },
    {
      "text": "Jul, S. and Furnas, G. W. (1997). Navigation in electronic worlds: Workshop report. SIGCHI Bulletin, 29(2):44--49.  ",
      "doi": "10.1145/270950.270979"
    },
    {
      "text": "Kim, K. S. and Allen, B. (2002). Cognitive and task influences on Web searching. JASIST, 52(2): 109--119.  ",
      "doi": "10.1002/asi.10014"
    },
    {
      "text": "Lansdale, M. (1988). The psychology of personal information management. Applied Ergonomics, 19(1): 458--465.",
      "doi": ""
    },
    {
      "text": "Lawrence, S. (2000). Context in Web search. IEEE Data Engineering Bulletin, 23(3): 25--32.",
      "doi": ""
    },
    {
      "text": "Lin, J., Quan, D., Sinha, V., Bakshi, K., Huynh, D., Katz, B. and Karger, D. R. (2003). The role of context in question answering systems. In Proc. of CHI '03 (Extended Abstracts), 1006--1007.  ",
      "doi": "10.1145/765891.766119"
    },
    {
      "text": "Maglio, P. P. and Barrett, R. (1997). How to build modeling agents to support Web searchers. In Proc. of UM '97, 5--16.",
      "doi": ""
    },
    {
      "text": "Malone, T. E. (1983). How do people organize their desks? ACM Trans. on Office Information Systems, 1(1): 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Marchionini, Gary. (1995). Information seeking in electronic environments. New York: Cambridge University Press. ",
      "doi": "10.5555/206740"
    },
    {
      "text": "Muramatsu, J. and Pratt, W. (2001). Transparent queries: Investigating users' mental models of search engines. In Proc. of SIGIR '01, 217--224.  ",
      "doi": "10.1145/383952.383991"
    },
    {
      "text": "Nardi, B. and Barreau, D. (1995). Finding and reminding: file organization from the desktop. ACM SIGCHI Bulletin, 27(3): 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "O'Day, V. and Jeffries, R. (1993). Orienteering in an information landscape: How information seekers get from here to there. In Proc. of CHI '93, 438--445. ",
      "doi": "10.5555/164632.164969"
    },
    {
      "text": "Palen, L. and Salzman M. (2002). Voice-mail diary studies for naturalistic data capture under mobile conditions. In Proc. of CSCW '02, 87--95.  ",
      "doi": "10.1145/587078.587092"
    },
    {
      "text": "Quan, D. and Karger, D. R. (2004). Haystack: A personalized, unified interface to creating, browsing, and organizing arbitrary information. In Proc. of CHI '04 (Extended Abstracts).  ",
      "doi": "10.1145/985921.985931"
    },
    {
      "text": "Sellen, A. J., Murphy, R. and Shaw, K. (2002). How knowledge workers use the Web. In Proc. of CHI '02, 227--234.  ",
      "doi": "10.1145/503376.503418"
    },
    {
      "text": "Spink, A., Wolfram, D., Jansen, B. J. and Saracevic, T. (2001). Searching the Web: The public and their queries. Journal of the American Society for Information Science, 52(3): 226--234.  ",
      "doi": "10.1002/1097-4571%282000%299999%3A9999%253C%3A%3AAID-ASI1591%253E3.3.CO%3B2-I"
    },
    {
      "text": "Suchman, L. A. (1987). Plans and situated actions. New York: Cambridge University Press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Whittaker, S. and Sidner, C. (1996). Email overload: Exploring personal information management of email. In Proc. of CHI '96, 276--283.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Yee, K-P., Swearingen, K., Li, K. and Hearst, M. (2003). Faceted metadata for image search and browsing. In Proc. of CHI '03, 401--408.  ",
      "doi": "10.1145/642611.642681"
    }
  ]
}