{
  "doi": "10.1145/985692.985721",
  "title": "The familiar stranger: anxiety, comfort, and play in public places",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "223-230",
  "year": 2004,
  "badges": [],
  "abstract": "As humans we live and interact across a wildly diverse set of physical spaces. We each formulate our own personal meaning of place using a myriad of observable cues such as public-private, large-small, daytime-nighttime, loud-quiet, and crowded-empty. Not surprisingly, it is the people with which we share such spaces that dominate our perception of place. Sometimes these people are friends, family and colleagues. More often, and particularly in public urban spaces we inhabit, the individuals who affect us are ones that we repeatedly observe and yet do not directly interact with - our Familiar Strangers. This paper explores our often ignored yet real relationships with Familiar Strangers. We describe several experiments and studies that led to designs for both a personal, body-worn, wireless device and a mobile phone based application that extend the Familiar Stranger relationship while respecting the delicate, yet important, constraints of our feelings and affinities with strangers in pubic places.",
  "authors": [
    {
      "name": "Eric Paulos",
      "institution": "Intel Research, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    },
    {
      "name": "Elizabeth Goodman",
      "institution": "Intel Research, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578588",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S. Milgram, The individual in a social world : essays and experiments. Reading, Mass.: Addison-Wesley Pub. Co., 1977.",
      "doi": ""
    },
    {
      "text": "www.meish.org/words/000147.php, \"me(ish),\" 2003.",
      "doi": ""
    },
    {
      "text": "C. Alexander, S. Ishikawa, and M. Silverstein, A pattern language: towns, buildings, construction. New York: Oxford University Press, 1977.",
      "doi": ""
    },
    {
      "text": "M. Foucault, \"Of other space,\" in The visual culture reader, N. Mirzoeff, Ed. London ; New York: Routledge, 1998, pp. xvi, 530.",
      "doi": ""
    },
    {
      "text": "W. H. Whyte, The social life of small urban spaces. Washington, D.C.: Conservation Foundation, 1980.",
      "doi": ""
    },
    {
      "text": "K. Lynch, The image of the city. Cambridge Mass.: Technology Press, 1960.",
      "doi": ""
    },
    {
      "text": "J. Jacobs, The death and life of great American cities. New York: Random House, 1961.",
      "doi": ""
    },
    {
      "text": "S. Milgram and P. Hollander, \"The Murder They Heard,\" in The Nation, vol. 198, 1964.",
      "doi": ""
    },
    {
      "text": "M. Moss and A. Townsend, \"How Telecommunication Systems are Transforming Urban Spaces,\" in Fractured Geographies: Cities in the Telecommunications Age, J. Wheeler and Y. Aoyama, Eds. New York: Routledge, 1999.",
      "doi": ""
    },
    {
      "text": "S. Jain, \"Urban Errands: The Means of Mobility,\" Journal of Consumer Culture, vol. 2, 2002.",
      "doi": ""
    },
    {
      "text": "H. Rheingold, Smart mobs : the next social revolution. Cambridge, MA: Perseus Pub., 2002. ",
      "doi": "10.5555/579424"
    },
    {
      "text": "G. Simmel, \"The Stranger,\" in The sociology of Georg Simmel, K. H. Wolff, Ed. Glencoe, Ill.,: Free Press, 1950, pp. lxiv, 445.",
      "doi": ""
    },
    {
      "text": "Z. Bauman, \"What Prospects of Morality in Times of Uncertainty,\" Theory, Culture and Society, vol. 15, pp. 11--22, 1998.",
      "doi": ""
    },
    {
      "text": "V. Acconci, \"Following Piece.\" New York, NY: Architectural League, 1969.",
      "doi": ""
    },
    {
      "text": "S. Calle and J. Baudrillard, Suite Vaenitienne. Paris: Editions de l'Etoile, 1983.",
      "doi": ""
    },
    {
      "text": "G. Debord, The society of the spectacle. New York: Zone Books, 1994.",
      "doi": ""
    },
    {
      "text": "E. Goffman, Behavior in public places; notes on the social organization of gatherings. New York: Free Press of Glencoe, 1963.",
      "doi": ""
    },
    {
      "text": "E. Goffman, Interaction ritual; essays in face-to-face behavior. Chicago,: Aldine Pub. Co., 1967.",
      "doi": ""
    },
    {
      "text": "W. W. Gaver, J. Beaver, and S. Benford, \"Ambiguity as a resource for design,\" ACM SIGCHI, 2003.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "M. McLuhan and B. R. Powers, The global village : transformations in world life and media in the 21st century. New York: Oxford University Press, 1989.",
      "doi": ""
    },
    {
      "text": "W. J. Mitchell, E-topia : \"Urban life, Jim--but not as we know it\". Cambridge, MA: MIT Press, 1999. ",
      "doi": "10.5555/317144"
    },
    {
      "text": "C. Vaucelle, G. Davenport, A. Wood, S. Anderson, L. E. Doyle, and J. Falk, \"Texting glances: Ambient Interludes from the Dublin Cityscape,\" presented at eNARRATIVE 5, Boston, 2003.",
      "doi": ""
    },
    {
      "text": "http://www.proboscis.org.uk/urbantapestries/index.html, \"Urban Tapestries reference,\" 2003.",
      "doi": ""
    },
    {
      "text": "R. Hansson and T. Skog, \"The LoveBomb: Encouraging the Communication of Emotions in Public Spaces,\" CHI, 2001.  ",
      "doi": "10.1145/634067.634319"
    },
    {
      "text": "L. Carroll, Through the looking-glass and what Alice found there: The Macmillan company, 1902.",
      "doi": ""
    },
    {
      "text": "\"Bluetooth,\" http://www.bluetooth.com.",
      "doi": ""
    },
    {
      "text": "M. Horton, D. Culler, K. Pister, J. Hill, R. Szewczyk, and A. Woo, \"MICA: the commercialization of microsensor motes,\" Sensors, vol. 19, pp. 40--8, 2002.",
      "doi": ""
    },
    {
      "text": "\"iMote,\" http://www.intel.com/research/exploratory/motes.htm.",
      "doi": ""
    }
  ]
}