{
  "doi": "10.1145/985692.985733",
  "title": "Labeling images with a computer game",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "319-326",
  "year": 2004,
  "badges": [],
  "abstract": "We introduce a new interactive system: a game that is fun and can be used to create valuable output. When people play the game they help determine the contents of images by providing meaningful labels for them. If the game is played as much as popular online games, we estimate that most images on the Web can be labeled in a few months. Having proper labels associated with each image on the Web would allow for more accurate image search, improve the accessibility of sites (by providing descriptions of images to visually impaired individuals), and help users block inappropriate images. Our system makes a significant contribution because of its valuable output and because of the way it addresses the image-labeling problem. Rather than using computer vision techniques, which don't work well enough, we encourage people to do the work by taking advantage of their desire to be entertained.",
  "authors": [
    {
      "name": "Luis von Ahn",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100069810/rel-imgonly/81100069810.jpg",
      "acmid": "81100069810",
      "orcid": "missing"
    },
    {
      "name": "Laura Dabbish",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    }
  ],
  "references": [
    {
      "text": "AltaVista Company. Altavista Search Home. http://www.altavista.com/",
      "doi": ""
    },
    {
      "text": "Barnard, K., Duygulu, P., and Forsyth, D. A. Clustering Art. IEEE conference on Computer Vision and Pattern Recognition, 2001, pages 434--441.",
      "doi": ""
    },
    {
      "text": "Barnard, K., and Forsyth, D. A. Learning the Semantics of Words and Pictures. International Conference of Computer Vision, 2001, pages 408--415.",
      "doi": ""
    },
    {
      "text": "Carson, C., and Ogle, V. E. Storage and Retrieval of Feature Data for a Very Large Online Image Collection &lt;http://elib.cs.berkeley.edu/papers/dataeng.html&gt;. IEEE Computer Society Bulletin of the Technical Committee on Data Engineering, 1996, Vol. 19 No. 4.",
      "doi": ""
    },
    {
      "text": "Columbia University Center for Telecommunications Research. webSEEK. www.ctr.columbia.edu/webseek/",
      "doi": ""
    },
    {
      "text": "Corbis. Stock Photography and Pictures. http://www.corbis.com/",
      "doi": ""
    },
    {
      "text": "Duygulu, P., Barnard, K., de Freitas, N., and Forsyth, D. A. Object recognition as machine translation: Learning a lexicon for a fixed image vocabulary. 7th European Conference on Computer Vision, &lt;http://www.itu.dk/events/eccv02/&gt;2002, pages 97--112. ",
      "doi": "10.5555/645318.649254"
    },
    {
      "text": "Electronic Arts. Pogo.com. http://www.pogo.com",
      "doi": ""
    },
    {
      "text": "Fleck, M. M., Forsyth, D. A., and Bregler, C. Finding Naked People. ECCV, 1996, pages 593--602. ",
      "doi": "10.5555/645310.649014"
    },
    {
      "text": "Google Inc. Google Web Search. http://www.google.com",
      "doi": ""
    },
    {
      "text": "Lempel, R. and Soffer, A. PicASHOW: Pictorial Authority Search by Hyperlinks on the Web. WWW10.  ",
      "doi": "10.1145/371920.372098"
    },
    {
      "text": "Microsoft Corporation. MSN Gaming Zone. http://zone.msn.com",
      "doi": ""
    },
    {
      "text": "Milliman, R. E. Website Accessibility And The Private Sector. www.rit.edu/~easi/itd/itdv08n2/milliman.html",
      "doi": ""
    },
    {
      "text": "N2H2, Inc. N2H2 Filter. http://www.n2h2.com",
      "doi": ""
    },
    {
      "text": "O'Connor, B. and O'Connor, M. Categories, Photographs & Predicaments: Exploratory Research on Representing Pictures for Access. Bulletin of the American Society for Information Science 25.6, 1999, page 17--20.",
      "doi": ""
    },
    {
      "text": "Random Bounce Me Website. http://random.bounceme.net/",
      "doi": ""
    },
    {
      "text": "Scheniderman, H. and Kanade, T. Object Detection Using the Statistics of Parts &lt;http://www.ri.cmu.edu/pubs/pub_3977.html&gt;. International Journal of Computer Vision, 2002.  ",
      "doi": "10.1023/B%3AVISI.0000011202.85607.00"
    },
    {
      "text": "Stork, D. G. and Lam C. P. Open Mind Animals: Ensuring the quality of data openly contributed over the World Wide Web. AAAI Workshop on Learning with Imbalanced Data Sets, 2000, pages 4--9.",
      "doi": ""
    },
    {
      "text": "Stork, D. G. The Open Mind Initiative. IEEE Intelligent Systems & Their Applications, 14-3, 1999, pages 19--20.",
      "doi": ""
    },
    {
      "text": "Trask, R. L. Language Change. Routledge, 1994",
      "doi": ""
    },
    {
      "text": "Yahoo!, Inc. Yahoo! Games. http://games.yahoo.com",
      "doi": ""
    }
  ]
}