{
  "doi": "10.1145/985692.985769",
  "title": "Tapping vs. circling selections on pen-based devices: evidence for different performance-shaping factors",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "607-614",
  "year": 2004,
  "badges": [],
  "abstract": "Tapping-based selection methods for handheld devices may need to be supplemented with other approaches as increasingly complex tasks are carried out using those devices. Circling selection methods (such as the Lasso) allow users to select objects on a touch screen by circling with a pen. An experimental comparison of the selection time and accuracy between a circling method and a traditional tapping style of selection was carried out. The experiment used a two dimensional grid (varying in terms of the sizes and the distances of the targets). Analysis of variance showed that tapping selection time differed significantly depending on the size and spacing of the targets. In contrast, circling selection times differed significantly for different levels of target cohesiveness and shape complexity. The results are discussed in terms of implications for design of new pen-based selection methods for handheld devices, and also in terms of evaluation methodology for input selection methods.",
  "tags": [
    "input and interaction technologies",
    "handheld devices",
    "target selection",
    "gesture input",
    "pen user interface"
  ],
  "authors": [
    {
      "name": "Sachi Mizobuchi",
      "institution": "Nokia Japan Co., Ltd. and Keio University, Meguro, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100643154",
      "orcid": "missing"
    },
    {
      "name": "Michiaki Yasumura",
      "institution": "Keio University, Fujisawa, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100007762",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Buxton, W. Chunking and Phrasing and the Design of Human-Computer Dialogues. Proc. of IFIP Congress 1986, North-Holland Pub. 475--480.",
      "doi": ""
    },
    {
      "text": "Card, S.K., McKinlay, J., and Robertson, G.G. A morphological analysis of the design space of input devices. ACM Transactions on Information Systems, 19, 2 (1991), 99--122.  ",
      "doi": "10.1145/123078.128726"
    },
    {
      "text": "Krishnan, S. N., and Moriya, S. One stroke operations: A new pen-based user interface that can integrate or separate operand specification, menu opening and selection, and action execution, in one or more strokes, IPSJ journal, 37, 12--026, 1996 (in Japanese).",
      "doi": ""
    },
    {
      "text": "Wills, G., Selection: 524,288 Ways to say `This is Interesting', Proc. of IEEE InfoVis '96, (1996), 54--60. ",
      "doi": "10.5555/857187.857607"
    },
    {
      "text": "Ren, X., and Moriya, S. Improving selection performance on pen-based systems: A study of pen-input interaction for selection tasks, ACM Transactions on Computer Human Interaction, l.7, 3 (2000), 384--416.  ",
      "doi": "10.1145/355324.355328"
    },
    {
      "text": "Accot, J., and Zhai, S. More than dotting the i's - foundations for crossing-based interfaces, Proc. of CHI2002, ACM Press (2002), 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Accot, J., and Zhai, S. Beyond Fitts' law: Models for trajectory-based HCI tasks, Proc. of CHI'97, ACM Press (1997), 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47, 6 (1954), 381--391.",
      "doi": ""
    },
    {
      "text": "Card, S. K., English, W. K., and Burr, B. J. Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT, Ergonomics 21 (1978), 601--613.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7 (1992), 91--139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Hick, W. E. On the rate of gain of information. Quarterly Journal of Experimental Psychology, 4 (1952), 11--26.",
      "doi": ""
    },
    {
      "text": "Hyman, R. Stimulus information as a determinant of reaction time. Journal of Experimental Psychology, 45 (1953), 423--432.",
      "doi": ""
    },
    {
      "text": "Attneave, F., and Arnoult, M. The quantitative study of shape and pattern perception. Psychological Bulletin, 53 (1956), 452--471",
      "doi": ""
    },
    {
      "text": "Brown, D.R. and Owen, D.H. Metrics of Visual Form: Methodological Dyspepsia, Psychological Bulletin, 68. (1967), 243--259.",
      "doi": ""
    },
    {
      "text": "Chipman, S. F., Complexity and structure in visual patterns. Journal of Experimental Psychology: General, 106, 3 (1977), 269--301.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G., and Buxton, W. Issues in combining marking and direct manipulation techniques. Proc. of the UIST1991, ACM Press (1991), 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Denoue, L., Chiu, P. and Fuse, T. Shared freeform input for note taking across devices. Ext. Abstracts CHI2003, ACM Press (2003), 710--711.  ",
      "doi": "10.1145/765891.765943"
    },
    {
      "text": "Schilit, B.N., Golovchinsky, G., and Price, M.N. Beyond Paper: Supporting Active Reading with Free-form Digital Ink Annotations, Proc. of CHI98, ACM Press (1998), 249--256.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Pappas, T. Triangular, Square & Pentagonal Numbers. In The Joy of Mathematics. San Carlos, CA: Wide World Publ./Tetra (1989), 214.",
      "doi": ""
    }
  ]
}