{
  "doi": "10.1145/985692.985720",
  "title": "Exploring PC-telephone convergence with the enhanced telephony prototype",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "215-222",
  "year": 2004,
  "badges": [],
  "abstract": "Industry trends suggest that the PC and telephone user experiences will converge over the next several years. This convergence raises important questions for the HCI community: how should the PC-phone user experience be designed, and how does PC-phone technology affect work practices? This paper focuses on the first question and provides some initial data on the second question. We describe a PC-phone prototype we built called Enhanced Telephony, and we report data from an eight month field deployment of Enhanced Telephony within our company where over 7,000 people installed the prototype. Results indicate that PC-phone software is a promising technology for the workplace and that the most valuable features may be those that help people manage their incoming calls.",
  "authors": [
    {
      "name": "JJ Cadiz",
      "institution": "Microsoft Real-Time Collaboration, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100025873",
      "orcid": "missing"
    },
    {
      "name": "Attila Narin",
      "institution": "Microsoft Real-Time Collaboration, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100299392",
      "orcid": "missing"
    },
    {
      "name": "Gavin Jancke",
      "institution": "Microsoft Real-Time Collaboration, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100269038",
      "orcid": "missing"
    },
    {
      "name": "Anoop Gupta",
      "institution": "Microsoft Real-Time Collaboration, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611908",
      "orcid": "missing"
    },
    {
      "name": "Michael Boyle",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100205383",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple iSync. http://www.apple.com/isync",
      "doi": ""
    },
    {
      "text": "Avaya IP Softphone. http://www.avaya.com",
      "doi": ""
    },
    {
      "text": "Brewster, S. Navigating Telephone-Based Interfaces with Earcons. HCI'97 Conference on People and Computers XII, 39--56. ",
      "doi": "10.5555/646684.702629"
    },
    {
      "text": "Cisco IP Softphone. http://www.cisco.com/en/US/products/sw/voicesw/ps1860/",
      "doi": ""
    },
    {
      "text": "Griffeth, N. Making a Simple Interface Complex: Interactions among Telephone Features. CHI 1996 Conference Companion, 244--245.  ",
      "doi": "10.1145/257089.257303"
    },
    {
      "text": "Hafner, K. Revolution in the Dorms of Dartmouth. The New York Times, September 23, 2003, p. C7.",
      "doi": ""
    },
    {
      "text": "Halstead-Nussloch, R. The Design of Phone-Based Interfaces for Consumers. Proc. CHI 1989, 347--352.  ",
      "doi": "10.1145/67449.67516"
    },
    {
      "text": "Herrell, H. Market Overview 2003: IP Telephony Voice Communications Systems. Giga Information Group, June 2, 2003.",
      "doi": ""
    },
    {
      "text": "Herring, R., List, J., and Youngs, E. Screen-Assisted Telephony and Voice Service Usability. Proceedings Human Factors Society 36th Annual Meeting, 1992, 221.",
      "doi": ""
    },
    {
      "text": "Horvitz, E., Apacible, J., Subramani, M., Sarin, R., Koch, P., Cadiz, J., Narin, A., and Rui, Y. Experiences with the Design, Fielding, and Evaluation of a Real-Time Communications Agent. Microsoft Research Technical Report MSR-TR-2003-98.",
      "doi": ""
    },
    {
      "text": "Isys Information Architects. Interface Hall of Shame: IBM's Real Phone. http://digilander.libero.it/ chiediloapippo/Engineering/iarchitect/",
      "doi": ""
    },
    {
      "text": "John, B. Extensions of GOMS Analyses to Expert Performance Requiring Perception of Dynamic Visual and Auditory Information. Proc. CHI 1990, 107--116.  ",
      "doi": "10.1145/97243.97262"
    },
    {
      "text": "Latour, A., and Delaney, K. J. KaZaA Creators Connect to Phones. The Wall Street Journal, September 19, 2003, p. B5.",
      "doi": ""
    },
    {
      "text": "Milewski, A. and Smith, T. Providing Presence Cues to Telephone Users. Proceedings of ACM Conference on Computer-Supported Cooperative Work, ACM Press (2000), 89--96.  ",
      "doi": "10.1145/358916.358978"
    },
    {
      "text": "Nelson, L., Bly, S., and Sokoler, T. Quiet Calls: Talking Silently on Mobile Phones. Proc. CHI 2001, 74--181.  ",
      "doi": "10.1145/365024.365094"
    },
    {
      "text": "Net2Phone, http://www.net2phone.com",
      "doi": ""
    },
    {
      "text": "Resnick, P., and Virzi, R. Skip and Scan: Cleaning Up Telephone Interfaces. Proc. CHI 1992, 419--426.  ",
      "doi": "10.1145/142750.142881"
    },
    {
      "text": "Roberts, T., and Engelbeck, G. The Effects of Device Technology on the Usability of Advanced Telephone Functions Using Auditory Output. Proc. CHI 1989, 331--337.  ",
      "doi": "10.1145/67449.67514"
    },
    {
      "text": "Savage, P. Designing a GUI for Business Telephone Users Features. Interactions. 1995, 2(1) 32--41.  ",
      "doi": "10.1145/208143.208157"
    },
    {
      "text": "Tang, J. C., Yankelovich, N., Begole, J., Van Kleek, M., Li, F., and Bhalodia, J. ConNexus to Awarenex: Extending Awareness to Mobile Users on the Road. Proc. CHI 2001, 221--228.  ",
      "doi": "10.1145/365024.365105"
    }
  ]
}