{
  "doi": "10.1145/985692.985716",
  "title": "Dual ecologies of robot as communication media: thoughts on coordinating orientations and projectability",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "183-190",
  "year": 2004,
  "badges": [],
  "abstract": "The aim of our study is to investigate systems for supporting remote instruction via a mobile robot. In the real world, instructions are typically given through words and body orientations such as head movements, which make it possible to project others' actions. Projectability is an important resource in organizing multiple actions among multiple participants in co-ordination with one another. It can likewise be said that in the case of robot-human collaboration, it is necessary to design a robot's head so that a local participant can project the robot's (and remote person's) actions. GestureMan is a robot that is designed to support such projectability properties. It is argued that a remote controlled mobile robot, designed as a communication medium, makes relevant dual ecologies: ecology at a remote (robot operator's) site and at a local participant's (robot's) site. In order to design a robot as a viable communication medium, it is essential to consider how these ecologies can be mediated and supported.",
  "authors": [
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba,, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Keiichi Yamazaki",
      "institution": "Saitama University, Sakura-ku, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620653",
      "orcid": "missing"
    },
    {
      "name": "Akiko Yamazaki",
      "institution": "Future University Hakodate, Hakodate, Hokkaido, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620449",
      "orcid": "missing"
    },
    {
      "name": "Jun'ichi Kosaka",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100105767",
      "orcid": "missing"
    },
    {
      "name": "Yasuko Suga",
      "institution": "Saitama University, Sakura-ku, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100136743",
      "orcid": "missing"
    },
    {
      "name": "Christian Heath",
      "institution": "King's College London, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100164455",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Auer, P., Projection in interaction and projection in grammar, InLiSt ,N0. 33, Freiburg (2002).",
      "doi": ""
    },
    {
      "text": "Dourish, P., Adler, A., Bellotti, V., Henderson, A. Your place or mine? Learning from long-term use of audio-video communication. Kluwer Academic Publishers Norwell, MA, USA, 33--62 (1996). ",
      "doi": "10.1007/BF00141935"
    },
    {
      "text": "Gaver, W., The Affordances of Media Spaces for Collaboration. Proc. CSCW'92, ACM Press, 17--24 (1992).  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Goodwin, C., Professional vision. American Anthropologist 96, 606--33 (1994).",
      "doi": ""
    },
    {
      "text": "Goodwin, C., Transparent vision. In: Ochs, E., E.A. Schegloff, S.A. Thompson, eds., Interaction and Grammar. Cambridge, Cambridge University Press, 370--404 (1996).",
      "doi": ""
    },
    {
      "text": "Goodwin, C., Action and embodiment within situated human interaction. Journal of Pragmatics, 32, 1489--1522 (2000).",
      "doi": ""
    },
    {
      "text": "Heath, C, Luff, P., Media space and communicative asymmetries: preliminary observations of video mediated interaction, Human-Computer Interaction 7, 315--46 (1992).",
      "doi": "10.1207/s15327051hci0703_3"
    },
    {
      "text": "Heath, C., Luff, P., Kuzuoka, H., Yamazaki, K., Creating coherent environments for collaboration, Proc. ECSCW2001, 119--128 (2001). ",
      "doi": "10.5555/1241867.1241874"
    },
    {
      "text": "Imai, M., Ono, T., Ishiguro, H., Physical Relation and Expression: Joint Attention for Human-Robot Interaction, IEEE Trans. on Industrial Electronics, Vol. 50, No. 4, 636--643 (2002).",
      "doi": ""
    },
    {
      "text": "Jouppi, N., First steps towards mutually-immersive mobile telepresence, Proc. CSCW2002, ACM Press, 354--363 (2002).  ",
      "doi": "10.1145/587078.587128"
    },
    {
      "text": "Kendon, A., Conducting Interaction: Patterns of Behavior in Focused Interaction, Cambridge, Cambridge University Press (1990).",
      "doi": ""
    },
    {
      "text": "Kuzuoka, H., Kosuge, T., and Tanaka, M., GestureCam: A Video Communication System for Sympathetic Remote Collaboration, Proc. of CSCW'94, 35--43 (1994).  ",
      "doi": "10.1145/192844.192866"
    },
    {
      "text": "Kuzuoka, H., Oyama, S., Yamazaki, K., Suzuki, K., Mitsuishi, M., GestureMan: A Mobile Robot that Embodies a Remote Instructor's Actions, Proc. CSCW2000, ACM Press, 155--162 (2000).  ",
      "doi": "10.1145/358916.358986"
    },
    {
      "text": "Luff, P., Heath, C., Kuzuoka, H., Hindmarsh, J., Yamazaki, K., and Oyama, S., Fractured ecologies: creating environments for collaboration, Special Issue of the HCI Journal: 'Talking About Things: Mediated Conversation about Objects', 18, 1 & 2, 51--84 (2003).  ",
      "doi": "10.1207/S15327051HCI1812_3"
    },
    {
      "text": "Morikawa, O. and Maesako, T., HyperMirror: Toward Pleasant-to-use Video Mediated Communication System, CSCW98, 149--158 (1998).  ",
      "doi": "10.1145/289444.289489"
    },
    {
      "text": "Nardi, B., Schwarz, H., Kuchinsky, A., Leichner, R., Whittaker, S., and Sclabassi, R., Turning away from talking heads: the use of video-as-data in neurosurgery, Proc. CHI'93, ACM Press, 327 -- 334 (1993).  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Paulos, E. and Canny, J., ProP: Personal Roving Presence, Proc. CHI' 98, ACM Press, 296--303 (1998).  ",
      "doi": "10.1145/274644.274686"
    },
    {
      "text": "Schegloff, E. A., Preliminaries to preliminaries: \"Can I ask you a question?\"', Sociological Inquiry 50, 104--52 (1980).",
      "doi": ""
    },
    {
      "text": "Schegloff, E. A., 'Body torque', Social Research, 65, 535--86 (1998).",
      "doi": ""
    },
    {
      "text": "Streeck, J., On Projection. In: E. Goody, ed., Interaction and Social Intelligence, Cambridge, Cambridge University Press, 84--110 (1995).",
      "doi": ""
    },
    {
      "text": "Tanaka, H., Turn-Taking in Japanese Conversation: A Study in Grammar and Interaction. Amsterdam: John Benjamins (1999).",
      "doi": ""
    },
    {
      "text": "Yamazaki, K., Yamazaki, A., Kuzuoka, H., Oyama, S., Kato, H., Suzuki, H., and Miki, H., GestureLaser and Gesturelaser Car: development of an Embodied Space to Support Remote Instruction, Proc. of ECSCW'99, 239--258 (1999). ",
      "doi": "10.5555/351689.351703"
    }
  ]
}