{
  "doi": "10.1145/985692.985715",
  "title": "A diary study of task switching and interruptions",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "175-182",
  "year": 2004,
  "badges": [],
  "abstract": "We report on a diary study of the activities of information workers aimed at characterizing how people interleave multiple tasks amidst interruptions. The week-long study revealed the type and complexity of activities performed, the nature of the interruptions experienced, and the difficulty of shifting among numerous tasks. We present key findings from the diary study and discuss implications of the findings. Finally, we describe promising directions in the design of software tools for task management, motivated by the findings.",
  "tags": [
    "task switching",
    "diary study",
    "interruptions",
    "office and workplace",
    "information worker",
    "multitasking"
  ],
  "authors": [
    {
      "name": "Mary Czerwinski",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100280834/rel-imgonly/marycz.jpg",
      "acmid": "81100280834",
      "orcid": "0000-0003-0881-401X"
    },
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    },
    {
      "name": "Susan Wilhite",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100288565",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bannon, L., Cypher, A., Greenspan, S., and Monty, M. (1983). Evaluation and analysis of user's activity organization\". In Proc. CHI'83 (pp. 54--57). NY: ACM.]]  ",
      "doi": "10.1145/800045.801580"
    },
    {
      "text": "Card, S.K. & Henderson, A.H. Jr. (1987). A multiple, virtual-workspace interface to support user task switching. In: Proceedings of the CHI+GI, Toronto, Canada. ACM Press, 53--59.]]  ",
      "doi": "10.1145/29933.30860"
    },
    {
      "text": "Chambers, C.V., Balaban, D.J., Carlson, B.L., Ungemack, J.A. MPH &Grasberger, D.M. (1989). Microcomputer-generated reminders: Improving the compliance of primary care physicians with mammography screening guidelines. Journal of Family Practice, 29(3), 273--280.]]",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Cutrell, E., & Horvitz, E. (2000). Instant Messaging and Interruption: Influence of Task Type on Performance. Proceedings of OZCHI 2000, 356--361.]]",
      "doi": ""
    },
    {
      "text": "Czerwinski, M. & Horvitz, E. (2002). Memory for Daily Computing Events. &lt;&lt;http://research.microsoft.com/~marycz/hci2002final.pdf&gt; In Faulkner, X., Finlay, J. & Detienne, F. (Eds.), People and Computers XVI, Proceedings of HCI 2002, 230--245.]]",
      "doi": ""
    },
    {
      "text": "Derthick, M. & Roth, S.F. (2000). Data exploration across temporal contexts, Proceedings of the International Conference on Intelligent User Interfaces (IUI 2000), New Orleans, LA, 60--67.]]  ",
      "doi": "10.1145/325737.325782"
    },
    {
      "text": "DeVaul, R.W., Clarkson, B. & Pentland, A.S. (2000). The memory glasses: Towards a wearable, context-aware, situation-appropriate reminder system. &lt;&lt;http://web.media.mit.edu/~rich/memory/SIUC00/&gt;Main.html.]]",
      "doi": ""
    },
    {
      "text": "Dey, A.K. & Abowd, G.D. (2000). CyberMinder: A context-aware system for supporting reminders. In Proceedings of HUC 2000, 172--186.]] ",
      "doi": "10.5555/647986.757284"
    },
    {
      "text": "Dey, A.K., Abowd, G.D., Wood, A. CyberDesk: A Framework for Providing Self-Integrating Context-Aware Services Proceedings of the International Conference on Intelligent User Interfaces (IUI '98) &lt;http://sigart.acm.org/Conferences/iui/iui98/&gt;, 47--54.]]  ",
      "doi": "10.1145/268389.268398"
    },
    {
      "text": "Ellis, J. & Kvavilashvili, L. (2000). Prospective memory in 2000: Past, present and future directions. Applied Cognitive Psychology, 14, 1--9.]]",
      "doi": ""
    },
    {
      "text": "Fertig, S., Freeman, E. & Gelernter, D. (1996). Lifestreams: An alternative to the desktop metaphor. In Proceedings of ACM CHI '96 Conference on Human Factors in Computing Systems, Extended Abstracts, ACM Press, 410--411.]]  ",
      "doi": "10.1145/257089.257404"
    },
    {
      "text": "Gillie, T. Broadbent, D. (1989). What Makes Interruptions Disruptive? A Study of Length, Similarity, and Complexity. Psychological Research, 50, 243--50.]]",
      "doi": ""
    },
    {
      "text": "Gwizdka, J. (2000). Timely Reminders: A Case Study of Temporal Guidance in PIM and Email Tools Usage. Extended abstract in Proceedings of CHI 2000, Human Factors in Computing Systems, Volume 2, ACM Press,163--164.]]  ",
      "doi": "10.1145/633292.633383"
    },
    {
      "text": "Henderson, D. A. Jr., Card, S.K. (1986). Rooms: The Use of Multiple Virtual Workspaces to Reduce Space Contention in a Window-based Graphical User Interface, ACM Transactions on Graphics, Vol. 5, No. 3, 211--243.]]  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "Hess, S.M. & Detweiler, M.C. (1994). Training to reduce the disruptive effects of interruptions. Proceedings of the Human Factors and Ergonomics Society's 38th Annual Meeting, 1173--1177.]]",
      "doi": ""
    },
    {
      "text": "Hess, S., Detweiler, M.C., & Ellis, R. D. (1999). The utility of display space in keeping-track of rapidly changing information. Human Factors, 41(2), 257--281.]]",
      "doi": ""
    },
    {
      "text": "Holden, K. L. & O'Neal, M.R. (1992). The utility of various windowing capabilities for single-task and multi-task environments. In Proceedings of CHI'92 Conference on Human Factors in Computing Systems, Extended Abstracts, ACM Press, 52--53.]]  ",
      "doi": "10.1145/1125021.1125070"
    },
    {
      "text": "Jones, W.P., Bruce, H. & Dumais, S. T. (2001). Keeping found things found on the web. In Proceedings of ACM's CIKM'01, Tenth International Conference on Information and Knowledge Management, 119--126.]]  ",
      "doi": "10.1145/502585.502607"
    },
    {
      "text": "Kandogan, E. and Shneiderman, B. (1997). Elastic Windows: evaluation of multi-window operations. In Proceedings of CHI '97 Conference on Human Factors in Computing Systems, ACM press, 250--257.]]  ",
      "doi": "10.1145/258549.258720"
    },
    {
      "text": "Kaptelinin, V. (2002) UMEA: User-Monitoring Environment for Activities. UIST '02 Companion. Posters and Demos from the 15th Annual ACM Symposium on User Interface Software and Technology, 31--32.]]",
      "doi": ""
    },
    {
      "text": "Lamming, M.G. & Newman, W.M. (1992). Activity-based information retrieval: Technology in support of personal memory. Information Processing 92, 3, 68--81.]] ",
      "doi": "10.5555/645571.660379"
    },
    {
      "text": "Lamming, M., Brown, P., Carter, K., Eldridge, M., Flynn, M., Louie, G., Robinson, P., & Sellen, AJ. (1994). The design of a human memory prosthesis. Computer Journal, 37(3), 153--163.]]",
      "doi": ""
    },
    {
      "text": "MacIntyre, B., Mynatt, E., Voida, S., Hansen, K., Tullio, J., Corso, G. (2001). Support for multitasking and background awareness using interactive peripheral displays. In Proceedings of Annual ACM Symposium on User Interface Software and Technology, UIST 2001, 41--50.]]  ",
      "doi": "10.1145/502348.502355"
    },
    {
      "text": "Maglio, P.P., Campbell, C.S. (2000). Tradeoffs in Displaying Peripheral Information. In Proceedings of CHI 2000 Conference on Human Factors in Computing Systems, ACM Press, 241--248.]]  ",
      "doi": "10.1145/332040.332438"
    },
    {
      "text": "Malone, T. W. (1983). How do people organize their desks? Implications for the design of office automation systems, ACM Transactions on Office Information Systems I, 99--112.]]  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "McFarlane, D.C. & Latorella, K.A. (2002). The Scope and Importance of Human Interruption in HCI design, Human Computer Interaction, 17, 1--62.]]",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Myers, B. (1988). Window interfaces: A taxonomy of window manager user interfaces, IEEE Computer Graphics and Applications 8, 5, 65--84.]]  ",
      "doi": "10.1109/38.7762"
    },
    {
      "text": "O'Connail, B. & Frohlich, D. (1995). Timespace in the workplace: Dealing with interruptions. CHI '95 Conference on Human Factors in Computing Systems, Extended Abstracts, ACM Press, 262--263.]]  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Rekimoto, J. (1999). Time-Machine Computing: A Time-centric Approach for the Information Environment. In Proceedings of Annual ACM Symposium on User Interface Software and Technology, UIST '99, 45--54.]]  ",
      "doi": "10.1145/320719.322582"
    },
    {
      "text": "Renaud, K. (2000). Expediting rapid recovery from interruptions by providing a visualization of application activity. Proceedings of OZCHI 2000, 348--355.]]",
      "doi": ""
    },
    {
      "text": "Rhodes B, Starner T. (1996). Remembrance agent: A continuously running automated information retrieval system. In Proceedings of the First International Conference on The Practical Application of Intelligent Agents and Multi Agent Technology (PAAM '96). London, UK, 487--495.]]",
      "doi": ""
    },
    {
      "text": "Robertson, G., van Dantzich, M., Robbins, D., Czerwinski, M., Hinckley, K., Risden, K., Thiel, D., Gorokhovsky, V. (2000). The Task Gallery: a 3D window manager. In Proceedings of CHI 2000 Conference on Human Factors in Computing Systems, ACM Press, 494--501.]]  ",
      "doi": "10.1145/332040.332482"
    },
    {
      "text": "Sellen, A.J., Louie, G, Harris, J.E. & Wilkins, A.J. (1996). What brings intentions to mind? An in situ study of prospective memory. Memory, 5(4), 483--507.]]",
      "doi": ""
    },
    {
      "text": "Smith, G., Baudisch, P., Robertson, G. G., Czerwinski, M., Meyers, B., Robbins, D., & Andrews, D. (2003). GroupBar: The TaskBar evolved. Proceedings of OZCHI 2003.]]",
      "doi": ""
    },
    {
      "text": "Terry, W.S. (1988). Everyday forgetting: Data from a diary study. Psychological Reports, 62, 299--303.]]",
      "doi": ""
    }
  ]
}