{
  "doi": "10.1145/985692.985757",
  "title": "Robotic camera control for remote exploration",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "511-517",
  "year": 2004,
  "badges": [],
  "abstract": "A video stream from a single camera is often the foundation for situational awareness in teleoperation activities. Poor camera placement, narrow field-of-view and other camera properties can significantly impair the operator's perceptual link to the environment, inviting cognitive mistakes and general disorientation. This paper provides a brief overview of viewpoint control research for 3D virtual environments (VE) to motivate a user study that evaluates the effectiveness of viewpoint controls on a simulated robotic vehicle. Findings suggest that providing a camera that is controlled independently from the orientation of the vehicle may facilitate wayfinding tasks. Moreover, there is evidence to support the use of separate cameras and interfaces for different navigational subtasks.",
  "authors": [
    {
      "name": "Stephen Hughes",
      "institution": "University of Pittsburgh, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100163569/rel-imgonly/steve.jpg",
      "acmid": "81100163569",
      "orcid": "0000-0002-9295-8480"
    },
    {
      "name": "Michael Lewis",
      "institution": "University of Pittsburgh, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100349943",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baker, M.P. and C.D. Wickens, Human Factors in Virtual Environments for the Visual Analysis of Scientific Data. 1995, NCSA-TR032 and Institute of Aviation report ARL-95-8/PNL-95-2.",
      "doi": ""
    },
    {
      "text": "Beaten, R., et al. An Evaluation of Input Devices for 3-D Computer Display Workstations. in Proc. of SPIE-The International Society for Optical Engineering. 1987.",
      "doi": ""
    },
    {
      "text": "Bowman, D., D. Koller, and L. Hodges, A Methodology for the Evaluation of Travel Techniques for Immersive Virtual Environments. Virtual Reality: Research, Development and Applications, 1998. 3(2): p. 120--131.",
      "doi": "10.1007/BF01417673"
    },
    {
      "text": "Darken, R., K. Kempster, and B. Peterson. Effects of Streaming Video Quality of Service on Spatial Comprehension in a Reconnaissance Task. in Proceedings of the meeting of I/ITSEC. 2001.",
      "doi": ""
    },
    {
      "text": "Darken, R. and B. Peterson, Spatial Orientation, Wayfinding and Representation., in Handbook of Virtual Environment Technology, K. Stanney, Editor. 2001, Lawrence Erlbaum Associates: Mahway, NJ.",
      "doi": ""
    },
    {
      "text": "Darken, R. and J.L. Siebert. Wayfinding Strategies and Behaviors in Large Virtual Worlds. in ACM SIGCHI 96. 1996.  ",
      "doi": "10.1145/238386.238459"
    },
    {
      "text": "Epic Games, I. Unreal Tournament 2003 Game. http://www.unrealtournament2003.com",
      "doi": ""
    },
    {
      "text": "Fong, T. and C. Thorpe, Vehicle Teleoperation Interfaces. Autonomous Robots, 2001(11): p. 9--18.  ",
      "doi": "10.1023/A%3A1011295826834"
    },
    {
      "text": "Hix, D., et al. User-Centered Design and Evaluation of a Real-Time Battlefield Visualization Virtual Environment. in IEEE Virtual Reality '99. 1999. ",
      "doi": "10.5555/554230.835707"
    },
    {
      "text": "Lewis, M., K. Sycara, and I. Nourbakhsh. Developing a Testbed for Studying Human-Robot Interaction in Urban Search and Rescue. in 10th International Conference on Human Computer Interation (HCII '03). 2003. Crete, Greece.",
      "doi": ""
    },
    {
      "text": "McGovern, D.E., Experiences and Results in Teleoperation of Land Vehicles. 1990, Sandia National Laboratories: Albuquerque, NM.",
      "doi": ""
    },
    {
      "text": "Milgram, P. and J. Ballantyne. Real World Teleoperation via Virtual Environment Modelling. in International Conference on Artificial Reality & Tele-existence. 1997. Tokyo.",
      "doi": ""
    },
    {
      "text": "Milgram, P. and H. Colquhoun, A Taxonomy of Real and Virtual World Display Integration, in Mixed Reality - Merging Real and Virtual Worlds., Y.O.a.H. Tamura, Editor. 1999, Springer Verlag: Berlin. p. 1--16.",
      "doi": ""
    },
    {
      "text": "Mine, M., Virtual Environment Interaction Techniques. 1995, UNC Chapel Hill Computer Science Technical Report TR95-018. ",
      "doi": "10.5555/897820"
    },
    {
      "text": "Murphy, R.R., et al. Mixed-Initiative Control of Multiple Heterogeneous Robots for Urban Search and Rescue. www.csee.usf.edu/robotics/Publications/",
      "doi": ""
    },
    {
      "text": "Tan, D.S., G.G. Robertson, and M. Czerwinski. Exploring 3D Navigation: Combining Speed-coupled flying with orbiting. in CHI 2001 Conference on Human Factors in Computing Systems. 2001. Seattle, WA.  ",
      "doi": "10.1145/365024.365307"
    },
    {
      "text": "Tittle, J.S., A. Roesler, and D.D. Woods. The Remote Perception Problem. in Human Factors and Ergonomics Society 46th annual meeting. 2002. Baltimore, MD.",
      "doi": ""
    },
    {
      "text": "Ware, C. and S. Osborne. Exploration and Virtual Camera Control in Three Dimensional Environments. in Proceedings of the 1990 Symposium on Interactive 3D Graphics. 1990.  ",
      "doi": "10.1145/91385.91442"
    }
  ]
}