{
  "doi": "10.1145/985692.985693",
  "title": "Acquiring in situ training data for context-aware ubiquitous computing applications",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2004,
  "badges": [],
  "abstract": "Ubiquitous, context-aware computer systems may ultimately enable computer applications that naturally and usefully respond to a user's everyday activity. Although new algorithms that can automatically detect context from wearable and environmental sensor systems show promise, many of the most flexible and robust systems use probabilistic detection algorithms that require extensive libraries of training data with labeled examples. In this paper, we describe the need for such training data and some challenges we have identified when trying to collect it while testing three context-detection systems for ubiquitous computing and mobile applications.",
  "authors": [
    {
      "name": "Stephen S. Intille",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100009538",
      "orcid": "missing"
    },
    {
      "name": "Ling Bao",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100450985",
      "orcid": "missing"
    },
    {
      "name": "Emmanuel Munguia Tapia",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100435014",
      "orcid": "missing"
    },
    {
      "name": "John Rondoni",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022967",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "G.D. Abowd and E.D. Mynatt. Charting past, present, and future research in ubiquitous computing. ACM Transactions on Computer-Human Interaction, 7(1):29--58, 2000.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "K. Aminian, P. Robert, E. Jequier, and Y. Schutz. Estimation of speed and incline of walking using neural network. IEEE Transactions on Instrumentation and Measurement, 44(3):743--746, 1995.",
      "doi": ""
    },
    {
      "text": "L. Bao. Physical Activity Recognition from Acceleration Data under Semi-Naturalistic Conditions. M.Eng. Thesis, Massachusetts Institute of Technology, 2003.",
      "doi": ""
    },
    {
      "text": "L. Bao and S.S. Intille. Activity recognition from user-annotated acceleration data. In Proceedings of Pervasive 2004: the Second International Conference on Pervasive Computing. Springer, 2004.",
      "doi": ""
    },
    {
      "text": "J. Beaudin. From Personal Experience to Design: Externalizing the Homeowner's Needs Assessment Process. S.M. Thesis, Massachusetts Institute of Technology, 2003.",
      "doi": ""
    },
    {
      "text": "J.B. Bussmann, W.L. Martens, J.H. Tulen, F.C. Schasfoort, H.J. van den Berg-Emons, and H.J. Stam. Measuring daily behavior using ambulatory accelerometry: the Activity Monitor. Behavior Research Methods, Instruments, & Computers, 33(3):349--56, 2001.",
      "doi": ""
    },
    {
      "text": "G.S. Chambers, S. Venkatesh, G.A.W. West, and H.H. Bui. Hierarchical recognition of intentional human gestures for sports video annotation. In International Conference on Pattern Recognition, pages 1082--5, Quebec City, 2002. ",
      "doi": "10.5555/968883.969426"
    },
    {
      "text": "F. Foerster, M. Smeja, and J. Fahrenberg. Detection of posture and motion by accelerometry: a validation in ambulatory monitoring. Computers in Human Behavior, 15:571--583, 1999.",
      "doi": ""
    },
    {
      "text": "S.S. Intille, E. Munguia Tapia, J. Rondoni, J. Beaudin, C. Kukla, S. Agarwal, L. Bao, and K. Larson. Tools for studying behavior and technology in natural settings. In A.K. Dey, A. Schmidt, and J.F. McCarthy, editors, Proceedings of UbiComp 2003: Ubiquitous Computing, volume LNCS 2864, pages 157--174. Springer, Berlin Heidelberg, 2003.",
      "doi": ""
    },
    {
      "text": "S.S. Intille, J. Rondoni, C. Kukla, I. Anacona, and L. Bao. A context-aware experience sampling tool. In Proceedings of the Conference on Human Factors in Computing Systems: Extended Abstracts, pages 972--973. ACM Press, NY, NY, 2003.  ",
      "doi": "10.1145/765891.766101"
    },
    {
      "text": "S.-W. Lee and K. Mase. Recognition of walking behaviors for pedestrian navigation. In Proceedings of 2001 IEEE Conference on Control Applications (CCA01), pages 1152--5. IEEE Press, 2001.",
      "doi": ""
    },
    {
      "text": "P. Lukowicz, H. Junker, M. Stager, T.V. Buren, and G. Troster. WearNET: a distributed multi-sensor system for context aware wearables. In G. Borriello and L.E. Holmquist, editors, Proceedings of UbiComp 2002: Ubiquitous Computing, volume LNCS 2498, pages 361--70. Springer-Verlag, Berlin Heidelberg, 2002. ",
      "doi": "10.5555/647988.741494"
    },
    {
      "text": "M. Makikawa and H. Iizumi. Development of an ambulatory physical activity monitoring device and its application for categorization of actions in daily life. In Proceedings of the 8th World Congress on Medical Informatics: MEDINFO 95, pages 747--750. North-Holland, Amsterdam, 1995.",
      "doi": ""
    },
    {
      "text": "M. Makikawa, S. Kurata, Y. Higa, Y. Araki, and R. Tokue. Ambulatory monitoring of behavior in daily life by accelerometers set at both-near-sides of the joint. In V. Patel, R. Rogers, and R. Haux, editors, Proceedings of MedInfo 2001, volume 10(Pt) 1, pages 840--3. IOS Press, Amsterdam, 2001.",
      "doi": ""
    },
    {
      "text": "J. Mantyjarvi, J. Himberg, and T. Seppanen. Recognizing human motion with multiple acceleration sensors. In Proceedings of the IEEE International Conference on Systems, Man, and Cybernetics, pages 747--52. IEEE Press, 2001.",
      "doi": ""
    },
    {
      "text": "E. Munguia Tapia, S.S. Intille, and K. Larson. Activity recognition in the home setting using simple and ubiquitous sensors. In Proceedings of Pervasive 2004: the Second International Conference on Pervasive Computing. Springer, 2004.",
      "doi": ""
    },
    {
      "text": "S.M. Patterson, D.S. Krantz, L.C. Montgomery, P.A. Deuster, S.M. Hedges, and L.E. Nebel. Automated physical activity monitoring: validation and comparison with physiological and self-report measures. Psychophysiology, 30(3):296--305, 1993.",
      "doi": ""
    },
    {
      "text": "M.R. Puyau, A.L. Adolph, F.A. Vohra, and N.F. Butte. Validation and calibration of physical activity monitors in children. Obesity Research, 10(3):150--7, 2002.",
      "doi": ""
    },
    {
      "text": "J.R. Quinlan. C4.5 : Programs for Machine Learning. The Morgan Kaufmann series in machine learning. Morgan Kaufmann Publishers, San Mateo, CA, 1993. ",
      "doi": "10.5555/152181"
    },
    {
      "text": "L.R. Rabiner and B.-H. Juang. Fundamentals Of Speech Recognition. PTR Prentice Hall, Englewood Cliffs, N.J., 1993. ",
      "doi": "10.5555/153687"
    },
    {
      "text": "C. Randell and H. Muller. Context awareness by analysing accelerometer data. In B. MacIntyre and B. Iannucci, editors, The Fourth International Symposium on Wearable Computers, pages 175--176. IEEE Press, 2000. ",
      "doi": "10.5555/851037.856514"
    },
    {
      "text": "J. Rondoni. A Context-Aware Application for Experience Sampling and Machine Learning. M.Eng. Thesis, Massachusetts Institute of Technology, 2003.",
      "doi": ""
    },
    {
      "text": "M. Uiterwaal, E.B. Glerum, H.J. Busser, and R.C. van Lummel. Ambulatory monitoring of physical activity in working situations, a validation study. Journal of Medical Engineering & Technology., 22(4):168--72, 1998.",
      "doi": ""
    },
    {
      "text": "K. Van Laerhoven and O. Cakmakci. What shall we teach our pants? In The Fourth International Symposium on Wearable Computers, pages 77--83. IEEE Press, 2000. ",
      "doi": "10.5555/851037.856531"
    }
  ]
}