{
  "doi": "10.1145/985692.985778",
  "title": "Ubiquitous computing for firefighters: field studies and prototypes of large displays for incident command",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "679-686",
  "year": 2004,
  "badges": [],
  "abstract": "In this paper, we demonstrate how field studies, interviews, and low-fidelity prototypes can be used to inform the design of ubiquitous computing systems for firefighters. We describe the artifacts and processes used by firefighters to assess, plan, and communicate during emergency situations, showing how accountability affects these decisions, how their current Incident Command System supports these tasks, and some drawbacks of existing solutions. These factors informed the design of a large electronic display for supporting the incident commander, the person who coordinates the overall response strategy in an emergency. Although our focus was on firefighters, our results are applicable for other aspects of emergency response as well, due to common procedures and training.",
  "authors": [
    {
      "name": "Xiaodong Jiang",
      "institution": "University of California, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659591583",
      "orcid": "missing"
    },
    {
      "name": "Jason I. Hong",
      "institution": "University of California, Berkeley, CA",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    },
    {
      "name": "Leila A. Takayama",
      "institution": "Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100499212/rel-imgonly/leila_recode_square.jpg",
      "acmid": "81100499212",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of Washington, Seattle, WA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Aoki, P.M., et al., The Mad Hatter's Cocktail Party: A Social Mobile Audio Space Supporting Multiple Conversations. CHI Letters (Human Factors in Computing Systems), 2003. 5(1): pp. 425--432.  ",
      "doi": "10.1145/642611.642686"
    },
    {
      "text": "Brewster, S., et al., Multimodal 'eyes-free' interaction techniques for wearable devices. CHI Letters (Human Factors in Computing Systems), 2003. 5(1): pp. 473--480.  ",
      "doi": "10.1145/642611.642694"
    },
    {
      "text": "Camp, P.J., et al. Supporting Communication and Collaboration Practices in Safety-Critical Situations. In Proceedings of Human Factors in Computing Systems: CHI 2000. Fort Lauderdale, FL: ACM Press. pp. 249--250 2000.  ",
      "doi": "10.1145/633292.633438"
    },
    {
      "text": "Chandler, C., et al., The Fire Wall. 2000. http://ratbert.bmrc.berkeley.edu/courseware/cs160/fall00/Projects/firefighting/",
      "doi": ""
    },
    {
      "text": "City of El Cerrito California Fire Department, Incident Command System. 2002. http://www.el-cerrito.com/fire/incident_command.html",
      "doi": ""
    },
    {
      "text": "DARPA Information Exploitation Office, Command Post of the Future. http://dtsn.darpa.mil/ixo/programdetail.asp?progid=18",
      "doi": ""
    },
    {
      "text": "FieldSoft, FDonScene. http://www.fieldsoft.com/fdonscene/fdsoftware.html",
      "doi": ""
    },
    {
      "text": "Hawkins, J.R., Making a Difference: How to Practically Use ICS Form 201, Incident Briefing, in California Fire Chief's Association, Fire Instructors' Workshop '92. 1992.",
      "doi": ""
    },
    {
      "text": "Helal, A., et al. Drishti: An Integrated Navigation System for Visually Impaired and Disabled. In Proceedings of The 5th International Symposium on Wearable Computers (ISWC 2001). Zurich, Switzerland 2001. ",
      "doi": "10.5555/580581.856574"
    },
    {
      "text": "International Fire Service Training Association, Essentials of Fire Fighting. 4th ed, ed. R. Hall and B. Adams. Stillwater, OK: Fire Protection Publications, Oklahoma State University, 1998.",
      "doi": ""
    },
    {
      "text": "Jiang, X., et al. Siren: Context-aware Computing for Firefighting. In Proceedings of Second International Conference on Pervasive Computing (Pervasive 2004). Vienna, Austria. To Appear 2004.",
      "doi": ""
    },
    {
      "text": "Kahn, J.M., et al. Mobile Networking for Smart Dust. In Proceedings of MobiCom 1999: The Fifth Annual International Conference on Mobile Computing and Networking. Seattle, WA: ACM Press. pp. 271--278 1999.  ",
      "doi": "10.1145/313451.313558"
    },
    {
      "text": "Klein, G., Sources of Power: How People Make Decisions. Cambridge, MA: MIT Press, 1998.",
      "doi": ""
    },
    {
      "text": "McKinsey and Company, Increasing FDNY's Preparedness. 2002. http://www.nyc.gov/html/fdny/html/mck_report/toc.html",
      "doi": ""
    },
    {
      "text": "National Institute for Occupational Safety and Health (NIOSH), Death in the Line of Duty: Six Career Fire Fighters Killed in Cold-Storage and Warehouse Building Fire - Massachusetts. 2000. http://www.cdc.gov/niosh/face9947.html",
      "doi": ""
    },
    {
      "text": "National Interagency Incident Management System, Glossary of Terms for the Incident Command System. http://www.acadia.net/mdisar/icsgloss.html",
      "doi": ""
    },
    {
      "text": "Pascoe, J., et al., Using While Moving: HCI Issues in Fieldwork Environments. ACM Transactions on Computer Human Interaction 2000. 7(3): pp. 417--437.  ",
      "doi": "10.1145/355324.355329"
    },
    {
      "text": "Paulison, R.D., Working for a Fire Safe America: The United States Fire Administration Challenge. 2002. http://www.usfa.fema.gov/dhtml/inside-usfa/about.cfm",
      "doi": ""
    },
    {
      "text": "Regehr, C., et al., Individual predictors of traumatic reactions in firefighters. Journal of of Nervous and Mental Disease 2000. 188(6): pp. 333--339.",
      "doi": ""
    },
    {
      "text": "Regehr, C., et al., Self-Efficacy and Trauma in New Recruits and Experienced Firefighters. Stress and Health 2003. 19: pp. 189--193.",
      "doi": ""
    },
    {
      "text": "Sneed, M., Study Guide for Fourth Edition of Essentials of Fire Fighting: Intl Fire Service Training Assn, 1998.",
      "doi": ""
    },
    {
      "text": "Strothotte, T., et al. Development of dialogue systems for a mobility aid for blind people: Initial design and usability testing. In Proceedings of The 2nd ACM/SIGCAPH Conference on Assistive Technologies. Vancouver, Canada: ACM Press. pp. 139--144 1996.  ",
      "doi": "10.1145/228347.228369"
    },
    {
      "text": "U.S. Fire Administration, F.E.M.A., Facts on Fire. 2003. http://www.usfa.fema.gov/public/factsheets/facts.shtm",
      "doi": ""
    },
    {
      "text": "Weick, K., The Collapse of Sensemaking in Organizations: The Mann Gulch Disaster. Administrative Science Quarterly 1993. 38(4): pp. 628--652.",
      "doi": ""
    }
  ]
}