{
  "doi": "10.1145/985692.985724",
  "title": "Finding meaningful uses for context-aware technologies: the humanistic research strategy",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "247-254",
  "year": 2004,
  "badges": [],
  "abstract": "Human-computer interaction (HCI) is undergoing a paradigm change towards interaction that is contextually adapted to rich use situations taking place \"beyond the desktop\". Currently, however, there are only few successful applications of context-adapted HCI, arguably because use scenarios have not been based on holistic understanding of the society, users, and use situations. A humanistic research strategy, utilized at the Helsinki Institute for Information Technology, aims to structure the innovation and evaluation of scenarios for future technologies. Population trends and motivational needs are analyzed to recognize psycho-socially relevant design opportunities. Ethnography, ethnomethodology, bodystorming, and computer simulations of use situations are conducted to understand use situations. The goal of design is to empower users by supporting their autonomy and control. Three design cases illustrate the approach. The paper showcases an emerging framework for informed innovation of use potentials.",
  "tags": [
    "use scenarios",
    "user-centered design",
    "context-awareness",
    "humanism",
    "research strategy",
    "empowerment"
  ],
  "authors": [
    {
      "name": "Antti Oulasvirta",
      "institution": "Helsinki Institute for Information Technology, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "Blom, J., Kankainen, A., Kankainen, T., and Tiitta, S. Location-aware multiuser messaging: exploring the evolution of mobile text-based communication services. HIIT Tech. Report 2003-2, Aug. 28, 2003.",
      "doi": ""
    },
    {
      "text": "Beyer, H., and Holtzblatt, K. Contextual design:Defining customer-centered systems. Morgan Kaufmann Publishers, San Francisco, CA, 1998. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Erickson, T., Halverson, C., Kellogg, W. A., Laff, M. and Wolf, T. Social translucence: designing social infrastructures that make collective activity visible. Comm. of the ACM 45, 4 (2002), 40--44.  ",
      "doi": "10.1145/505248.505270"
    },
    {
      "text": "Friedman, B. Value-sensitive design. interactions 3, 6 (1996), 16--23.  ",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Ishii, H., and Ullmer, B. Tangible bits: towards seamless interfaces between people, bits and atoms. Proc. CHI 1997, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Jones, M., Jain, P., Buchanan, G., and Marsden., G. Using a mobile device to vary the pace of search. Proc. Mobile HCI 2003, 390--394.",
      "doi": ""
    },
    {
      "text": "Kankainen, A., and Oulasvirta, A. Design ideas for everyday mobile ubiquitous computing based on qualitative user data. Proc. 7th ERCIM Workshop on User Interfaces for All 2002, 458--464. ",
      "doi": "10.5555/1765426.1765467"
    },
    {
      "text": "Kankainen, A. UCPCD - User-Centred Product Concept Design. Proc. DUX2003.  ",
      "doi": "10.1145/997078.997087"
    },
    {
      "text": "Kankainen, A. Thinking model and tools for understanding user experience related to information appliance product concepts. Doctoral Dissertation. Acta Polytechnica Scandinavica, Mathematics and Computing Series 118, Polytechnica Kustannus Oy (2002).",
      "doi": ""
    },
    {
      "text": "Kjeldskov, J., and Graham, C. A review of mobile HCI research methods. Proc. Mobile HCI 2003, 317--335.  ",
      "doi": "10.1145/2371574.2371586"
    },
    {
      "text": "Kindberg, T. The zen of everyday encounters: spontaneous interaction in ubiquitous computing. Proc. Mobile HCI 2003, 15--16.",
      "doi": ""
    },
    {
      "text": "Kirsh, D., The context of work. Human Computer Interaction 16, 2001.  ",
      "doi": "10.1207/S15327051HCI16234_12"
    },
    {
      "text": "Kurvinen, E., and Oulasvirta, A. Towards socially aware pervasive computing: A turntaking approach. Accepted to 2nd IEEE Conf. on Pervasive Computing and Communications 2004, Orlando, FL. ",
      "doi": "10.5555/977406.978675"
    },
    {
      "text": "Norman, D. A. and Draper, S. W. (Eds.) User-Centered System Design: New Perspectives on Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, USA, 1986. ",
      "doi": "10.5555/576915"
    },
    {
      "text": "Oulasvirta, A., Kurvinen, E., and Kankainen, T. Understanding contexts by being there: case studies in bodystorming. Personal and Ubiquitous Computing 7, 2 (2003), 125--134.  ",
      "doi": "10.1007/s00779-003-0238-7"
    },
    {
      "text": "Oulasvirta, A., Tiitta, S., and Saariluoma, P. Using population parameters in the design of product concepts for ubiquitous computing (In Finnish). HIIT Publications 2002-2. See http://www.hiit.fi/publications/ .",
      "doi": ""
    },
    {
      "text": "Patnaik, D., and Becker, R. Needfinding: the why and how of uncovering people's needs. Design Management Journal, 1999, 37--43.",
      "doi": ""
    },
    {
      "text": "Sacks, H., Schegeloff, E.A., Jefferson, G. A simplest systematics for the organization of turn-taking conversation. Language 50 (1974), 696--735.",
      "doi": ""
    },
    {
      "text": "Satyanarayanan, M. Pervasive computing: vision and challenges. IEEE Pers. Comm., Aug. 2001, 10--17.",
      "doi": ""
    },
    {
      "text": "Schmidt, A. Implicit human-computer interaction through context. Personal Technologies 4, 2 (2000), 191--199.",
      "doi": ""
    },
    {
      "text": "Schuler D., Social computing. Communications of the ACM 37, 1 (1994), 28--29.  ",
      "doi": "10.1145/175222.175223"
    },
    {
      "text": "Rantanen, M. A presence service for ubiquitous computing. Master of Science thesis, Helsinki University of Technology, Department of Industrial Engineering and Management, 2002.",
      "doi": ""
    },
    {
      "text": "Tamminen, S., Oulasvirta, A., Toiskallio, K., and Kankainen, A. Understanding mobile contexts. Proc. Mobile HCI 2003, 17--32.  ",
      "doi": ""
    },
    {
      "text": "Tennenhouse, D. Proactive computing. Comm. of the ACM 43, 5 (2000), 43--50.  ",
      "doi": "10.1145/332833.332837"
    },
    {
      "text": "Tiitta, S. Identifying elderly people's needs for communication and mobility. Proc. Include 2003, 266--271.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The computer for the twenty-first century. Scientific American, Sep. 1991, 94--104.",
      "doi": ""
    }
  ]
}