{
  "doi": "10.1145/985692.985703",
  "title": "A comparison of consecutive and concurrent input text entry techniques for mobile phones",
  "published": "2004-04-25",
  "proctitle": "CHI '04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "81-88",
  "year": 2004,
  "badges": [],
  "abstract": "The numeric keypads on mobile phones generally consist of 12 keys (0-9, *, #). Ambiguity arises when the 36-character alpha-numeric English alphabet is mapped onto this smaller number of keys. In this paper, we first present a taxonomy of the various techniques for resolving this ambiguity, dividing them into techniques that use consecutive actions to first select a character grouping and then a character from within that grouping, and those that use concurrent actions to achieve the same end. We then present the design and implementation of a chording approach to text entry that uses concurrent key presses. We conducted a controlled experiment that compared this chording technique to one-handed and two-handed versions of the commonly used MultiTap technique. The results show that the concurrent chording technique significantly outperforms both versions of the consecutive action MultiTap technique.",
  "authors": [
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Barfield, W., & Caudell, T., eds. (2001). Fundamentals of wearable computers and augmented reality. Lawrence Erlbaum Associates: Mahwah, New Jersey. ",
      "doi": "10.5555/557568"
    },
    {
      "text": "Conrad, R., & Longman, D. (1965). Standard typewriter versus chord keyboard: An experimental comparison. Ergonomics. 8. p. 77--88.",
      "doi": ""
    },
    {
      "text": "Gopher, D., & Koenig, W. (1983). Hands coordination in data entry with a two-hand chord typewriter.Technical Report CPL 83-3. Cognitive Psychology Laboratory, Dept. of Psychology, University of Illinois, Champaign, ILL 61820.",
      "doi": ""
    },
    {
      "text": "Gopher, D., & Raij, D. (1988). Typiing with a two-handed chord keyboard: Will QWERTY become obsolete. IEEE Transactions on Systems, Man, and Cybernetics. 18(4). p. 601--609.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. (2002). KSPC (keystrokes per character) as a characteristic of text entry techniques. Fourth International Symposium on Human-Computer Interaction with Mobile Devices. p. 195--210. ",
      "doi": "10.5555/645739.666587"
    },
    {
      "text": "MacKenzie, I.S., Kober, H., Smith, D., Jones, T., & Skepner, E. (2001). LetterWise: Prefix-based disambiguation for mobile text input. ACM UIST Symposium. p. 111--120.  ",
      "doi": "10.1145/502348.502365"
    },
    {
      "text": "MacKenzie, S., & Soukoreff, W. (2002). Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction. 17. p. 147--198.",
      "doi": ""
    },
    {
      "text": "MacKenzie, S., & Soukoreff, W. (2003). Phrase sets for evaluating text entry techniques. Extended Abstracts of the ACM CHI Conference on Human Factors in Computing Systems. p. 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Matias, E., MacKenzie, I., & Buxton, W. (1996). One-handed touch typing on a QWERTY keyboard. Human-Computer Interaction. 11. p. 1--27.  ",
      "doi": "10.1207/s15327051hci1101_1"
    },
    {
      "text": "Partridge, K., Chatterjee, S., Sazawal, V., Borriello, G., & Want, R. (2002). TiltType: accelerometer-supported text entry for very small devices. ACM UIST Symposium. p. 201--204.  ",
      "doi": "10.1145/571985.572013"
    },
    {
      "text": "Rosenberg, B. (1994). Chord keyboards. Queen Mary & Westfield College. London, UK.",
      "doi": ""
    },
    {
      "text": "Soukoreff, W., & MacKenzie, I.S. (2002). Text entry for mobile computing: Models and methods, theory and practice. Human-Computer Interaction. 17. p. 147--198.",
      "doi": ""
    },
    {
      "text": "Wigdor, D., & Balakrishnan, R. (2003). TiltText: Using tilt for text input to mobile phones. ACM UIST Symposium. p. 81--90.  ",
      "doi": "10.1145/964696.964705"
    }
  ]
}