{
  "doi": "10.1145/142750.142763",
  "title": "Graphical fisheye views of graphs",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "83-91",
  "year": 1992,
  "badges": [],
  "abstract": "A fisheye lens is a very wide angle lens that shows places nearby in detail while also showing remote regions in successively less detail. This paper describes a system for viewing and browsing planar graphs using a software analog of a fisheye lens. We first show how to implement such a view using solely geometric transformations. We then describe a more general transformation that allows hierarchical, structured information about the graph to modify the views. Our general transformation is a fundamental extension to the previous research in fisheye views.",
  "authors": [
    {
      "name": "Manojit Sarkar",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332525628",
      "orcid": "missing"
    },
    {
      "name": "Marc H. Brown",
      "institution": "Digital Equipment Corporation, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332491195",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Peter Eades and Roberto Tamassia. Algorithms for drawing graphs: An annotated bibliography. Technical Report CS-89-90, Department of Computer Science, Brown University, Providence, RI, 1989. ",
      "doi": ""
    },
    {
      "text": "Kim M. Fairchild, Steven E. Poltrok, and George W. Fumas. SemNet: Three-dimensional graphic representations of large knowledge bases. In Cognitive Science and Its Applications for Human Computer Interaction, pages 201-233, 1988.",
      "doi": ""
    },
    {
      "text": "William Augustus Farrand. Information display in interactive design. Ph.D. Thesis, Department of Engineering, UCLA, Los Angeles, CA, 1973.",
      "doi": ""
    },
    {
      "text": "George W. Fumas. The fisheye view- A new look at structured files. Technical Memorandum 82-11221-22, Bell Laboratories, 1982.",
      "doi": ""
    },
    {
      "text": "George W. Furnas. Generalized fisheye views. In Proc. ACM SIGCHI '86 Conf. on Human Factors in Computing Systems, pages 16-23, 1986.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Tyson R. Henry and ScottE. Hudson. Interactive graph layout. In Proc. ACM SIGGRAPH, SIGCHI Symposium on User interface Software and Technology, pages 55- 65, 1991.  ",
      "doi": "10.1145/120782.120788"
    },
    {
      "text": "Jock D. Mackinlay, George G. Robertson, and Stuart K. Card. The perspective wall: Detail and context smoothly integrated, in Proc. ACM SIGCHI '91 Conf. on Human Factors in Computing Systems, pages 173- 179, April 1991.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "Greg Nelson, Editor. Systems Programming with Modula-3. Prentice Hall, Englewood Cliffs, NJ, 1991. ",
      "doi": "10.5555/127967"
    },
    {
      "text": "George G. Robertson, Jock D. Mackinlay, and Stuart K. Card. Cone Trees: Animated 3D visualizations of hierarchical information. In Proc. ACM SiGCHI '91 Conf. on Human Factors in Computing Systems, pages 189-194, April 199 I.  ",
      "doi": "10.1145/108844.108883"
    }
  ]
}