{
  "doi": "10.1145/142750.142808",
  "title": "Workspaces: an architecture for editing collections of objects",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "267-272",
  "year": 1992,
  "badges": [],
  "abstract": "Many tools create new user interfaces by compositing them out of smaller pieces. This usually leads to variations on the dialog box to edit a single composite object. Workspaces are a model for compositing together various editors to manipulate sets of objects and their attributes. The workspace components communicate in terms of a selected set and the attributes possessed by objects in that set. This model has been implemented as part of the Sushi UIMS.",
  "tags": [
    "editors",
    "user interface management systems",
    "interactive software",
    "collection editing"
  ],
  "authors": [
    {
      "name": "Dan R. Olsen",
      "institution": "Brigham Young University, Computer Science Department, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410595121",
      "orcid": "missing"
    },
    {
      "name": "Thomas G. McNeill",
      "institution": "Brigham Young University, Computer Science Department, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392595618",
      "orcid": "missing"
    },
    {
      "name": "David C. Mitchell",
      "institution": "Brigham Young University, Computer Science Department, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414606601",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dewan, Prasun. A Tour of the Suite User Interface Software. In Proceedings of the ACM SIGGRAPH Symposium on User Interface Software and Technology (UIST '90), (Snowbird, Utah, Oct. 3-5, 1990), ACM Press, pp. 57-65.  ",
      "doi": "10.1145/97924.97931"
    },
    {
      "text": "Linton, Mark A., Vlissides, John M., and Calder, Paul R. Composing User interfaces with InterViews, IEEE Computer 22,2 (Feb. 1989), 8-22.  ",
      "doi": "10.1109/2.19829"
    },
    {
      "text": "Myers, Brad A., Guise, Dario A., Dannenberg, Roger B., Vander Zanden, Brad, Kosbie, David S., Pervin, Edward, Mickish, Andrew, and Marchal, Philippe. Garnet: Comprehensive Support for Graphical, Highly Interactive User Interfaces, IEEE Computer 23, 11 (Nov. 1990), 71-85.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "Olsen, Dan R., Jr. A Browse/Edit Model for User Interface Management. In Proceedings of Graphics Interface '88 (Edmonton, Alberta, Canada, June 6-10, 1988), 155-159. ",
      "doi": "10.5555/102313.102334"
    },
    {
      "text": "Olsen, Dan R., McNeill, Thomas G., Burbidge, A. Michael, and Mitchell, David C. SUSHI: An Extensible UIMS Framework, Technical Report, Computer Science Department, Brigham Young University, Provo, UT, (1991).",
      "doi": ""
    }
  ]
}