{
  "doi": "10.1145/142750.142786",
  "title": "Knowledge-based evaluation as design support for graphical user interfaces",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "181-188",
  "year": 1992,
  "badges": [],
  "abstract": "The motivation for our work is that even though user interface guidelines and style guides contain much useful knowledge, they are hard for user interface designers to use. We want to investigate ways of bringing the human factors knowledge closer to the design process, thus making it more accesible to designers. To this end, we present a knowledge-based tool, containing design knowledge drawn from general guideline documents and toolkit-specific style guides, capable of evaluating a user interface design produced in a UIMS. Our assessment shows that part of what the designers consider relevant design knowledge is related to the user's tasks and thus cannot be applied to the static design representation of the UIMS. The final section of the paper discusses ways of using this task-related knowledge.",
  "authors": [
    {
      "name": "Jonas Löwgren",
      "institution": "Linköping University, Linköping, Sweden",
      "img": "/do/10.1145/contrib-81100003076/rel-imgonly/2010_01_b_lr.jpg",
      "acmid": "81100003076",
      "orcid": "missing"
    },
    {
      "name": "Tommy Nordqvist",
      "institution": "National Defense Research Est. (FOA 531), Linköping, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100375374",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "T. Bleser and J. Foley. Towards specifying and evaluating the human factors of user-computer interfaces. In CHI'82 Proceedings, pages 309-314, 1982.  ",
      "doi": "10.1145/800049.801801"
    },
    {
      "text": "S. BOdker. Through the interface~a human activity approach to user interface design. Lic. thesis DAIMI PB-224, Aarhus University, 1987.",
      "doi": ""
    },
    {
      "text": "C. Brown. Human-Computer Interface Design Guidelines. Ablex Publishing Corp., NJ, 1988. ",
      "doi": "10.5555/38160"
    },
    {
      "text": "F. de Souza and N. Bevan. The use of giiidelines in menu interface design\" Evaluation of a draft standard. In D. Diaper, D. Gilmore, G. Cockton, and B. Shackel, editors, Human-Computer Interaction ~ interact'90, pages 435-440. North-Holland, 1990. Participants Edition. ",
      "doi": "10.5555/647402.725751"
    },
    {
      "text": "Digital Equipment Corp. Guide to the X UI User Interface Language Compiler, 2.0 edition, 1988.",
      "doi": ""
    },
    {
      "text": "G. Fischer, A. Lemke, T. Mastaglio, and A. Morch. Using critics to empower users. In CHI'90 Proceedings, pages 337-347, 1990.  ",
      "doi": "10.1145/97243.97305"
    },
    {
      "text": "J. Foley, W. Kim, S. Kova~evi6, and K. Murray. Defining interfaces at a high level of abstraction. IEEE Software, pages 25-32, January 1989.  ",
      "doi": "10.1109/52.16899"
    },
    {
      "text": "M. Green. Report on dialogue specification tools. In G. Pfaff, editor, User Interface Management Systems, pages 9-20. Springer Verlag, Berlin, 1985.",
      "doi": ""
    },
    {
      "text": "N. Hammond, M. Gardiner, B. Christie, and C. Marshall. The role of cognitive psychology in user-interface design. In M. Gardiner and B. Christie, editors, Applying Cognitive Psychology to User-interface Design, chapter 2, pages 13-53. John Wiley &amp; Sons, Chichester, 1987. ",
      "doi": "10.5555/26115.26117"
    },
    {
      "text": "S. Howard and M. D. Murray. A taxonomy of evaluation techniques for HCI. In H.-J. Bullinger and B. Shackel, editors, Human-Computer Interaction Interact'87, pages 453-459, 1987.",
      "doi": ""
    },
    {
      "text": "A. Lemke and G. Fischer. A cooperative problem solving system for user interface design. In Proceedings Eight National Conference on Artificial Intelligence (AAAI-90), pages 479-484, 1990.",
      "doi": ""
    },
    {
      "text": "Jonas LSwgren. Knowledge-Based Design Sup. port and Discourse Management in User interface Management Systems. Ph. D. dissertation, LinkSl~ing University, March 1991. LinkSping Studies in Science and Technology # 239.",
      "doi": ""
    },
    {
      "text": "Jonas LSwgren and Tommy Nordqvist. A knowledge-based tool for user interface evaluation and its integration in a UIMS. In D. Diaper, D. Gilmore, G. Cockton, and B. Shackel, editors, Human-Compuler Interaction ~ Interact'90, pages 395-400. North-Holland, August 1990. Also as research report LiTH-IDA-R-90-15. ",
      "doi": "10.5555/647402.725308"
    },
    {
      "text": "D. Olsen and B. Halversen. Interface usage measurements in a user interface management system. In Proc. A CM SIGGRAPH Symposium on User Interface Software (UIST'88), pages 102-108. ACM Press, 1988.  ",
      "doi": "10.1145/62402.62420"
    },
    {
      "text": "Open Software Foundation, Cambridge, MA. OSF/Motif Style Guide, 1988. Revision 1.1. ",
      "doi": "10.5555/101385"
    },
    {
      "text": "P. Reisner. Formal grammar and human factors design of an interactive graphics system. IEEE Trans. on Software Engineering, SE-7(2):229-240, March 1981.",
      "doi": "10.1109/TSE.1981.234520"
    },
    {
      "text": "A. Siochi and D. Hix. A study of computersupported user interface evaluation using maximal repeating pattern analysis. In CHI'gl Proceedings, pages 301-305, 1991.  ",
      "doi": "10.1145/108844.108926"
    },
    {
      "text": "S. L. Smith and J. N. Mosier. Guidelines for designing user interface software. Report ESD-TR- 86-278, Mitre Corp., Bedford, MA, 1986.",
      "doi": ""
    },
    {
      "text": "L. Tetzlaff and D. Schwartz. The use of guidelines in interface design. In CHI'91 Proceedings, pages 329-333, 1991.  ",
      "doi": "10.1145/108844.108936"
    }
  ]
}