{
  "doi": "10.1145/142750.142902",
  "title": "A visit to a very small database: lessons from managing the review of papers submitted for CHI'91",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "471-478",
  "year": 1992,
  "badges": [],
  "abstract": "Many of the principles that guide user-interface design for commercial systems do not scale down to simple applications developed on personal computers. These “very small systems” are typicaly designed within a high-level application such as a database or a spreadsheet. The entire development process may take no more than a few days. In this restricted context, iterative design and usability testing are unaffordable luxuries, while detailed task analysis and early focus on users fail because the task and users will not coalesce until the system is in place. We describe our experiences with developing and using a very small sytem. We present suggestions for successful design in similar situations.",
  "authors": [
    {
      "name": "John Rieman",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100642568",
      "orcid": "missing"
    },
    {
      "name": "Susan Davies",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615178",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Roberts",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332523954",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "B~dker, S. A human activity approach to user interfaces. Human-Computer Interaction 4 (1989), 171-195.",
      "doi": "10.1207/s15327051hci0403_1"
    },
    {
      "text": "Carroll, J.M. Infinite detail and emulation in an ontologically minimized HCI. In Proceedings of the Conference on Human Factors in Computing Systems (Seattle, WA, April 1-5). ACM, New York, 1990, pp. 321-327.  ",
      "doi": "10.1145/97243.97303"
    },
    {
      "text": "Carroll, J.M., Kellogg, W.A., and Rosson, M.B. The Task-Artifact Cycle. In Designing Interaction: Psychology of the Human-Computer Interface, Carroll, J.M. (Ed.), Cambridge University Press, Cambridge, 1991, pp. 74-102. ",
      "doi": "10.5555/120352.120358"
    },
    {
      "text": "Floyd, C., Wolf-Michael, M, Reisin, F.-M., Schmidt, G., and Wolf, G. Out of Scandinavia: Alternative approaches to software design and system development. Human-Computer Interaction 4 (1989), 253-350.",
      "doi": "10.1207/s15327051hci0404_1"
    },
    {
      "text": "G0ransson, B., Lind, M., Pettersson, E., Sandblad, B., and Schwalbe, P. The interface is often not the problem. In Proceedings of the Conference on Human Factors in Computing Systems and Graphics Interface (Toronto, April 1-5). ACM, New York, 1987, pp. 133- 136.  ",
      "doi": "10.1145/29933.30872"
    },
    {
      "text": "Gould, J.D., Boles, S., and Lewis, C. Making usable, useful, productivity-enhancing computer applications. Communications of the ACM 34 (1991), 74-89.  ",
      "doi": "10.1145/99977.99993"
    },
    {
      "text": "Hutchins, E.L., Hollan, J.D., and Norman, D.A. Direct Manipulation Interfaces. In User Centered System Design, Norman, D.A., and Draper, S.W. (Eds.), Lawrence Erlbaum, Hillsdale, NJ, 1986, pp. 87-124.",
      "doi": ""
    },
    {
      "text": "Lewis, Clayton. Personal communication, August, 1990.",
      "doi": ""
    },
    {
      "text": "Poison, P.G., and Lewis, C.H. Theory-based design for easily learned interfaces. Human-Computer Interaction 5 (1990), 191-220.",
      "doi": ""
    },
    {
      "text": "Poison, P.G. The consequences of consistent and inconsistent user interfaces. In Cognitive Science and its Applications for Human-Computer Interaction, Guindon, R., (Ed.), Lawrence Erlbaum, Hillsdale, NJ (1988), pp. 59-108.",
      "doi": ""
    },
    {
      "text": "Rubenstein, R., and Hersh, H. The Human Factor: Designing Computer Systems for People. Digital Press, Burlington, MA, 1984. ",
      "doi": "10.5555/574996"
    },
    {
      "text": "Wixon, D. Holtzblatt, K., and Knox, S. Contextual design\" An emergent view of system design. In Proceedings of the Conference on Human Factors in Computing Systems (Seattle, WA, April 1-5). ACM, New York, 1990, pp. 331-336.  ",
      "doi": "10.1145/97243.97304"
    },
    {
      "text": "Wixon, D., and Whiteside, J. Engineering for Usability: Lessons from the user derived interface. In Proceedings of the Conference on Human Factors in Computing Systems (San Francisco, CA, April 14- 18). ACM, New York, 1985, pp. 144-147.  ",
      "doi": "10.1145/317456.317484"
    }
  ]
}