{
  "doi": "10.1145/142750.142756",
  "title": "Speech patterns in video-mediated conversations",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "49-59",
  "year": 1992,
  "badges": [],
  "abstract": "This paper reports on the first of a series of analyses aimed at comparing same room and video-mediated conversations for multiparty meetings. This study compared patterns of spontaneous speech for same room versus two video-mediated conversations. One video system used a single camera, monitor and speaker, and a picture-in-a-picture device to display multiple people on one screen. The other system used multiple cameras, monitors, and speakers in order to support directional gaze cues and selective listening. Differences were found between same room and video-mediated conversations in terms of floor control and amount of simultaneous speech. While no differences were found between the video systems in terms of objective speech measures, other important differences are suggested and discussed.",
  "authors": [
    {
      "name": "Abigail J. Sellen",
      "institution": "missing",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M. (1975). Bodily communication. London: Methuen &amp; Co. Ltd.",
      "doi": ""
    },
    {
      "text": "Argyle, M. and Cook, M. (1976). Gaze and mutual gaze. London: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Argyle, M., Ingham, R., Alkena, F. and McCaUin, M. (1973). The different functions of gaze. Semiotica, 7, 10-32.",
      "doi": ""
    },
    {
      "text": "Argyle, M., Lalljee, M., and Cook, M. (1968). The effects of visibility on interaction in a dyad. Human Relations, 21, 3-17.",
      "doi": ""
    },
    {
      "text": "Brady, P.T. (1968). A statistical analysis of on-off patterns in 16 conversations. The Bell System Technical Journal, Jan., 73-91.",
      "doi": ""
    },
    {
      "text": "Cohen, K. M. (1982). Speaker interaction: Video teleconferences versus face-to-face meetings. Proceedings of 7eleconferencing and Electronic Communications, University of Wisconsin, 189-199.",
      "doi": ""
    },
    {
      "text": "Cook, M. &amp; Lalljee, M.G. (1972). Verbal substitutes for visual signals in interaction. Semiotica, 3, 212- 221.",
      "doi": ""
    },
    {
      "text": "Dabbs, LM. Jr., &amp; Ruback, R.B. (1984). Vocal patterns in male and female groups. Personality and Social Psychology Bulletin, 10(4), 518-525.",
      "doi": ""
    },
    {
      "text": "Dabbs, j.M. Jr., &amp; Ruback, R.B. (1987). Dimensions of group process: Amount and structure of vocal interaction. In Advances in Experimental Social Psychology, 20, 123-169.",
      "doi": ""
    },
    {
      "text": "Duncan, S. (1972). Some signals and rules for taking speaking turns in conversations. Journal of Personality and Social Psychology, 23(2), 283-292.",
      "doi": ""
    },
    {
      "text": "Duncan, S. &amp; Fiske, D. W. (1977). Face-to-face interaction: Research methods and theory. Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Duncan, S. &amp; Niederehe, G. (1974). On signalling that it's your turn to speak. Journal of Experimental Social Psychology, 23, 234-247.",
      "doi": ""
    },
    {
      "text": "Heath, C. &amp; Luff, P. (1991). Disembodied conduct: Communication through video in a multi-media office environment. Proceedings of CHI \"91, ACM Conference on Human Factors in Software, New Orleans, LA., 99-103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Jaffe, J., &amp; Feldstein, S. (1970). Rhythms of dialogue. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Kendon, A. (1967). Some functions of gaze direction in social interaction. Acta Psychologica, 32, 1-25.",
      "doi": ""
    },
    {
      "text": "Mantei, M., Baecker, R., Sellen, A., Buxton, W., Milligan, T. &amp; Wellman, B. (1991). Experiences in the use of a media space. Proceedings of CHI '91, ACM Conference on Human Factors in Software, New Orleans, LA., 203-208.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "Rutter (1987). Communicating by telephone. New York: Pergamon Press.",
      "doi": ""
    },
    {
      "text": "Rutter, D.R. &amp; and Stephenson, G.M (1977). The role of visual communication in synchronizing conversation. European Journal of Social Psychology, 2, 29-37.",
      "doi": ""
    },
    {
      "text": "SeUen, A., Buxton, W. &amp; Amott, J. (1991). Using spatial cues to improve desktop video conferencing. 8 minute videotape. Toronto: Dynamic Graphics Project, Computer Systems Research Institute, University of Toronto.",
      "doi": ""
    },
    {
      "text": "Shannon, C.E., and Weaver, W. (1949). The mathematical theory of communication. Urbana, IL: University of illinois Press. ",
      "doi": "10.5555/1102016"
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. (1976). The social psychology of telecommunications. London: Wiley &amp; Sons.",
      "doi": ""
    }
  ]
}