{
  "doi": "10.1145/142750.142752",
  "title": "The computer sciences electronic magazine: translating from paper to multimedia",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "11-18",
  "year": 1992,
  "badges": [],
  "abstract": "In this paper, we discuss issues in design and usability of the IBM Computer Sciences Electronic Magazine (CSEM). The CSEM is an interactive multimedia translation of a paper magazine. It contains articles describing Computer Sciences projects at the four IBM Research Labs. Combining aspects from print, television, and computers, it is a useful vehicle for studying what we see as a completely new communication medium. We report both our design rationale in creating the magazine and the results of several user studies which helped us understand our successes and failures. These studies are a part of an iterative process through which we have redesigned and improved the CSEM.",
  "authors": [
    {
      "name": "W. Randall Koons",
      "institution": "Interactive Media Project, IBM Watson Research Center, Yorktown Heights, New York USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100026648",
      "orcid": "missing"
    },
    {
      "name": "Anne M. O'Dell",
      "institution": "Interactive Media Project, IBM Watson Research Center, Yorktown Heights, New York USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332518777",
      "orcid": "missing"
    },
    {
      "name": "Nancy J. Frishberg",
      "institution": "Interactive Media Project, IBM Watson Research Center, Yorktown Heights, New York USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100504042",
      "orcid": "missing"
    },
    {
      "name": "Mark R. Laff",
      "institution": "Interactive Media Project, IBM Watson Research Center, Yorktown Heights, New York USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100347998",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J.M. Carroll, R. L. Mack, and W. A. Kellogg. Interface Metaphors and User Interface Design. In M. Helander, editors, Handbook of Human- Computer Interaction, 67-85, Elsevier Science Publishers, North Holland, 1988.",
      "doi": ""
    },
    {
      "text": "J.M. Carroll and J. C. Thomas. Metaphor and the Cognitive Representation of Computing Systems. IEEE Transactions on Systems, Man, and Cybernetics, SMC-12(2):107-116, March/April 1982.",
      "doi": ""
    },
    {
      "text": "B. Laurel, ed. The Art of Human-Computer Interface Design. Addison Wesley, New York, NY, 1990. ",
      "doi": "10.5555/575201"
    },
    {
      "text": "M. Gosney, ed. Verbum interactive, Issue 1.0. Verbum Inc., San Diego, CA, 1990.",
      "doi": ""
    },
    {
      "text": "S. Ambron, K. Hooper, ed. Interactive Multimedia. Microsoft Press, Redmond, WA, 1988. ",
      "doi": "10.5555/60911"
    },
    {
      "text": "N. Frishberg, M. R. Laff, M. R. Derosiers, W. R. Koons, and J. F. Kelley. John Cocke: A Retrospective by Friends (An Interactive Multimedia Scrapbook). In Scott P. Robertson, Gary M. Olson, and Judith S. Olson, editors, Human Factors in Computing Systems (CHI'91 Conference Proceedings), 423-424, Addison Wesley, New Orleans, LA, 1991.  ",
      "doi": "10.1145/108844.108984"
    },
    {
      "text": "G. Gay and E. Raffensperger. Considerations and Strategies in the Design of Interactive Multimedia Programs. Academic Computing, 24ff., September 1989.",
      "doi": ""
    },
    {
      "text": "Kelley, j.F. RIK+GEDD Case Study: Rapid Prototyping and the 1987 CHI+GI Conf Poster Demonstration at CHI '88 in Washington D.C., 1988.",
      "doi": ""
    },
    {
      "text": "Kelley, J.F., Gursky, M.C., and Kannan, K. RIK+GEDD - Research Information Kiosk + Graphic Editing and Database Delivery system: Rapid prototyping and iterative design of public access information applications. Internal publication., 1989.",
      "doi": ""
    },
    {
      "text": "M. Naimark. Shooting for Interactivity Paper delivered at the 191st SMIrl~ Technical Conference, L.A., October,, 1989.",
      "doi": ""
    },
    {
      "text": "W. Richmond. Design &amp; Technology, pages 181-186. Van Nostrand Reinhold, New York, NY, 1990.",
      "doi": ""
    },
    {
      "text": "K. Utting and N. Yankelovich. Context and Orientation in Hypermedia Networks. A CM Transactions on Information Systems, 7(1):58-84, 1989.  ",
      "doi": "10.1145/64789.64992"
    },
    {
      "text": "J.V. White. Designing Covers, Contents, Flash Forms, Departments, Editorials, Openers, and Products for Magazines, pages 33-36. R.R. Bowker, New York, NY, 1976.",
      "doi": ""
    }
  ]
}