{
  "doi": "10.1145/142750.142912",
  "title": "Facilitating the exploration of interface design alternatives: the HUMANOID model of interface design",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "507-515",
  "year": 1992,
  "badges": [],
  "abstract": "HUMANOID is a user interface design tool that lets designers express abstract conceptualizations of an interface in an executable form, allowing designers to experiment with scenarios and dialogues even before the application model is completely worked out. Three properties of the HUMANOID approach allow it to do so: a modularization of design issues into independent dimensions, support for multiple levels of specificity in mapping application models to user interface constructs, and mechanisms for constructing executable default user interface implementations from whatever level of specificity has been provided by the designer.",
  "authors": [
    {
      "name": "Pedro Szekely",
      "institution": "missing",
      "img": "/do/10.1145/contrib-81100625746/rel-imgonly/szekely-photo-isi.jpg",
      "acmid": "81100625746",
      "orcid": "missing"
    },
    {
      "name": "Ping Luo",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659403975",
      "orcid": "missing"
    },
    {
      "name": "Robert Neches",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327490788",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "W. Bennett, S. Boies, J. Gould, S. Greene and C. Wiecha. Transformations on a Dialog Tree\" Rule-Based Mapping of Content to Style. in Proceedings of the ACM SIGGRAPH Symposium on User Interface Software and Technology, pp. 67-75, November 1989.  ",
      "doi": "10.1145/73660.73669"
    },
    {
      "text": "W. Buxton and R. Sniderman. Iteration in the Design of the Human-Computer Interface. In Proceedings of the 13th Annual Meeting of the Human Factors Association of Canada. 1980, pp. 72-80.",
      "doi": ""
    },
    {
      "text": "J. D. Foley, W. C. Kim, S. Kovacevic and K. Murray. UIDE: An Intelligent User Interface Design Environment. In J. S. Sullivan and S. W. Tyler, editors, Intelligent User Interfaces. pp. 339-384. ACM Press, 1991.  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "D. Giuse. Efficient Frame Systems. In J. P. Martins and E. M. Morgado, editors, Lecture Notes in Artificial Intelligence, Springer Verlag, Sep, 1989. ",
      "doi": "10.5555/645372.651357"
    },
    {
      "text": "M. Green. Report on dialogue specification tools. In User Interface Management Systems. G. E. Pfaff, editor, Spring-Verlag, 1983, pp. 9-20.",
      "doi": ""
    },
    {
      "text": "P. J. Hayes, P. Szekely and R. Lerner. Design Altemafives for User Interface Management Systems Based on Experience with COUSIN. In Proceedings SIGCHI'85. April 1989, pp. 169-175.  ",
      "doi": "10.1145/317456.317488"
    },
    {
      "text": "R. K. Jacob. A specification language for direct manipulation interfaces. ACM Transactions on Graphics 5, 4. (October 1986), 283-317.  ",
      "doi": "10.1145/27623.27624"
    },
    {
      "text": "W. C. Kim and J. Foley. DON: User Interface Presentation Design Assistant. in Proceedings UIST'90. October 1990, pp. 10-20.  ",
      "doi": "10.1145/97924.97926"
    },
    {
      "text": "J. Mackinlay. Automating the Design of Graphical Presentations of Relational Information. ACM Transactions on Graphics, pp. 110-141, April 1986.  ",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "B. Myers, B. Vander Zanden and R. Dannenberg. Creating Graphical Interactive Application Objects by Demonstration. In Proceedings of the ACM SIGGRAPH Symposium on User interface Software and Technology, pp. 95-104, November 1989.  ",
      "doi": "10.1145/73660.73672"
    },
    {
      "text": "B.A. Myers. A New Model for Handling Input. A CM Transactions on Information Systems 8, 3. (July 1990), pp. 289-320.  ",
      "doi": "10.1145/98188.98204"
    },
    {
      "text": "Neuron Data, Inc. 1991. Open Interface Toolkit. 156 University Ave. Palo Alto, CA 94301.",
      "doi": ""
    },
    {
      "text": "NEXT, inc. 1990. Interface Builder, Palo Alto, CA.",
      "doi": ""
    },
    {
      "text": "D. Olsen. MIKE: The Menu interaction Kontrol Environment. ACM Transactions on Graphics, vol 17, no 3, pp. 43-50, 1986.  ",
      "doi": "10.1145/27623.28868"
    },
    {
      "text": "D. Olsen. A Programming Language Basis for User Interface Management. in Proceedings SIGCHI'89. April 1989, pp. 171-176.  ",
      "doi": "10.1145/67449.67485"
    },
    {
      "text": "S. Roth and J. Mattis. Data Characterization for Intelligent Graphics Presentation. In Proceedings SIG- CHI'90. April 1990, pp. 193-200.  ",
      "doi": "10.1145/97243.97273"
    },
    {
      "text": "K.J. Schmucker. MacApp: An application framework. In R. M. Baecker, W. A. Buxton, editors, Readings in Human-Computer Interaction. pp. 591-594. Morgan Kaufmann Publishers, Inc. 1987. ",
      "doi": "10.5555/58076.58126"
    },
    {
      "text": "G. S ingh and M. Green. A High-level User interface Management System. In Proceedings SIGCHI'89. April 1989, pp. 133-138.  ",
      "doi": "10.1145/67449.67476"
    },
    {
      "text": "G. Singh, C. H. Kok and T. Y. Ngan. Druid: A System for Demonstrational Rapid User Interface Development. In Proceedings UIST'90. October 1990, pp. 167- 177.  ",
      "doi": "10.1145/97924.97943"
    },
    {
      "text": "P. Szekely. Standardizing the interface between applications and UIMS's. In Proceedings UIST'89. November 1989, pp. 34-42.  ",
      "doi": "10.1145/73660.73665"
    },
    {
      "text": "P. Szekely. Template-based mapping of application data to interactive displays. In Proceedings UIST'90. October 1990, pp. 1-9.  ",
      "doi": "10.1145/97924.97925"
    },
    {
      "text": "W. Swartout and R. Balzer. On the Inevitable Intertwining of Specification and Implementation. CACM 25, 7 (July 1982), pp. 438-440.  ",
      "doi": "10.1145/358557.358572"
    },
    {
      "text": "P. Wellner. Statemaster: A UIMS Based on Statecharts for Prototyping and Target Implementation. In Proceedings SIGCHI'89. April 1989, pp. 177-182.  ",
      "doi": "10.1145/67449.67486"
    }
  ]
}