{
  "doi": "10.1145/142750.142898",
  "title": "Retrospective on a year of participatory design using the PICTIVE technique",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "455-462",
  "year": 1992,
  "badges": [],
  "abstract": "PICTIVE is a participatory design technique for increasing the direct and effective involvement of users and other stakeholders in the design of software. This paper reviews a year of the use of PICTVE on products and research prototypes at Bellcore. What we have learned is illustrated through five brief case studies. The paper concludes with a summary of our current PICTIVE practice, expressed as three developing, interrelated models: an object model, a process model, and a participation model.",
  "authors": [
    {
      "name": "Michael J. Muller",
      "institution": "Bellcore, Piscataway, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332517372",
      "orcid": "0000-0001-7860-163X"
    }
  ],
  "references": [
    {
      "text": "Bjerknes, G., Ehn, P., and Kyng, M. (Eds.) (1987). Computers andDemocracy: A Scandinavian Challenge. Brookfield, VT: Gower.]]",
      "doi": ""
    },
    {
      "text": "Bodker, S., Ehn, P., Kammersgaard, J., Kyng, M., and Sundblad, Y. (1987). A UTOPIAN Experience: On Design of Powerful Computer-Based Tools for Skilled Graphic Workers. In Bjerknes, G., Ehn, P., and Kyng, M. (Eds.), Computers and Democracy: A Scandinavian Challenge. Brookfield, VT: Gower.]]",
      "doi": ""
    },
    {
      "text": "Bodker, S., Ehn, P., Knudsen, J., Kyng, M., and Madsen, K. (1988). Computer support for cooperative design. In CSCW88 : Proceedings of the Conference on Computer- Supported Cooperative Work. Portland OR\" ACM, 377-393.]]  ",
      "doi": "10.1145/62266.62296"
    },
    {
      "text": "Bush, R.M. (1992). The Human Computer Technology Group at Bellcore: Laboratory Overview. In Proceedings of CHI'92. ACM: Monterey CA.]]  ",
      "doi": "10.1145/142750.142813"
    },
    {
      "text": "Carter, K. (1991). Participatory Design Work at Rank Xerox Cambridge EuroPARC. Position paper atCHI'91 workshop, Participatory Design: Practical Stories and Stories ofPractice. CHI'91 meeting, New Orleans LA, 29 April 1991.]]",
      "doi": ""
    },
    {
      "text": "Cebulka, K.D. (1990b). WISE: An Intelligent Interface for User Modification of Applications. In Proceedings of 1990 IEEE International Conference on Systems, Man, and Cybernetics. Los Angeles CA: IEEE Press, 637-639.]]",
      "doi": ""
    },
    {
      "text": "Crane, D. (1991). Changing the \"Demand\" for Participatory Design. Position paper at CHI'91 workshop, Participatory Design: Practical Stories and Stories ofPractice. CHI'91 meeting, New Orleans LA, 29 April 1991.]]",
      "doi": ""
    },
    {
      "text": "Crane, D. (1990). Workshop on Graphic Recording in Systems Design. In PDC'90: Conference on Participatory Design. Seattle WA: Computer Professionals for Social Responsibility, 95-98.]]",
      "doi": ""
    },
    {
      "text": "Dray, S. (1991). A Sampling of Participatory Strategies at IDS Financial Services. Position paper at CHI'91 workshop, Participatory Design\" Practical Stories and Stories ofPractice. CHI'91 meeting, New Orleans LA, 29 April 1991.]]",
      "doi": ""
    },
    {
      "text": "Ehn, P. (1988). Work-Oriented Design of Computer Artifacts. Stockholm: Arbetslivcentrum.]] ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Ehn, P. (1990). Strategies and Tools for Participatory Design. Presentation at PDC'90: Participatory Design Conference, Seattle WA.]]",
      "doi": ""
    },
    {
      "text": "Floyd, C. (1987). Outline of a paradigm change in software engineering. In Bjerknes, G., Ehn, P., and Kyng, M. rEds.). Computers and Democracy: A Scandinavian Challenge. Brookfield, VT: Gower.]]",
      "doi": ""
    },
    {
      "text": "Greenbaum, J., and Kyng, M. (1991). Designat Work.\" Cooperative Design of Computer Systems. Hillsdale NJ: Erlbaum.]] ",
      "doi": "10.5555/125470"
    },
    {
      "text": "t3rudin, J. (1990). Obstacles to Participatory Design in Large Product Development Organizations. In PDC' 90: Conference on Participatory Design. Seattle WA: Computer Professionals for Social Responsibility.]]",
      "doi": ""
    },
    {
      "text": "Helander, M. (Ed.) (1988). Handbook of Human- Computer Interaction. Amsterdam: North-Holland.]] ",
      "doi": "10.5555/549940"
    },
    {
      "text": "Kvavik, K. (1991). Effecting Buy-In from Participants --- Technology Transfer and its Spread. Position paper at CHI'91 workshop, Participatory Design: Practical Stories and Stories of Practice. CHI'91 meeting, New Orleans LA, 29 April 1991.]]",
      "doi": ""
    },
    {
      "text": "MeKim, R, (1972). Experiences in Visual Thinking. Monterey CA: Brooks/Cole.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J. (1991a). No Mechanization without Representation: Who Participates in Participatory Design of Large Software Products? In Reaching Through Technology: Proceedings of CHl' 91. New Orleans LA: ACM, 391.]]  ",
      "doi": "10.1145/108844.108896"
    },
    {
      "text": "Muller, M.J. (1991b). Panel: Participatory Design in Britain and North America\" Responses to the \"Scandinavian Challenge.\" (chair). InReaching Through Technology: Proceedings of CHl'91. New Orleans LA: ACM, 389-392.]]  ",
      "doi": "10.1145/108844.108962"
    },
    {
      "text": "Muller, Mj. (1991c). Participatory Design: Practical Stories and Stories of Practice (Workshop). In Reaching Through Technology: Proceedings of CHI'91. New Orleans LA: ACM, 501.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J. (1991d). PICTIVE ~ An Exploration in Participatory Design. InR eac hing Through Technology: Proceedings of CHl'91. New Orleans LA: ACM, 225- 231.]]  ",
      "doi": "10.1145/108844.108896"
    },
    {
      "text": "Muller, M.J., and Cebulka, K.D. (1990). Software Professionals in the Year 2000: Technologies to Support an Enhanced Social Communications Fabric. In Proceedings of National Communications Forum, 44. Chicago: Professional Education International.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J.,Farrell, R., Cebulka, K.D., and Smith, J.G. (1991). Issues in the Usability of Time-Varying Multimedia. Chapter to appear in B lattner, M. and Danenberg, R. (Eds),lnteractive Multimedia Computing, in press.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J., Kaye, C., and Sauer, J.E. Jr. (1991). Case Study of Transformation of Screen Layout and Dynamics through Participatory Design. Poster at 1991 meeting of the Human Factors Society, San Francisco CA, 4 September 1991.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J., Smith, J.G., Shoher, J.Z., and Goldberg, H. (1990). Privacy, Anonymity, and Interpersonal Competition Issues Identified during Participatory Design of Project Management Groupware. SIGCH1 Bulletin, 23(1), 82-87 (January 1991).]]  ",
      "doi": "10.1145/122672.122693"
    },
    {
      "text": "Namioka, A., and Schuler, D. (Eds.) (1990). PDC'90: Conference on Participatory Design. Seattle WA: Computer Professionals for Social Responsibility.]]",
      "doi": ""
    },
    {
      "text": "Nelms, H. (1957). ThinkingwithaPencil. Berkeley CA: Ten Speed Press.]]",
      "doi": ""
    },
    {
      "text": "Nielsen, J., Bush, R.M., Dayton, J.T., Mond, N.E., Muller, M.J., and Root, R.W. (1992). In Proceedings of CHI'92. ACM: Monterey CA.]]",
      "doi": ""
    },
    {
      "text": "Norman, D.A. (1988). The Psychology of Everyday Things. New York: Basic Books.]]",
      "doi": ""
    },
    {
      "text": "Open Software Foundation (1991). OSF/Motif Style Guide, Revision 1.1. Engelwood Cliffs NJ: Prentice Hall.]]",
      "doi": ""
    },
    {
      "text": "Silverstein, G., Farrell, R., and Smith, J.G. (1990). Integrating Multiple Instructional Paradigms in Industrial Training Applications. In Proceedings of AAA1 Workshop on Knowledge-based Environments for Learning and Teaching.]]",
      "doi": ""
    },
    {
      "text": "Smith, J.G., and Cebulka, K.D. (1990). A Framework for Intelligent Interfaces. Poster at CHI'90.]]",
      "doi": ""
    },
    {
      "text": "Thoresen, K. (1990a). Prototyping Organizational Changes. In PDC'90: Conference on Participatory Design. SeattleWA: Computer Professionals for Social Responsibility, 22-33.]]",
      "doi": ""
    },
    {
      "text": "Thoresen,K. (1990b). StatementforParticipatoryDesign of Computer Systems (Panel). in Empowering People: CHI'90 Conference Proceedings. Seattle WA.\" ACM, 144.]]  ",
      "doi": "10.1145/97243.97266"
    },
    {
      "text": "Verplank, W. (1990). Graphical Invention for User interfaces. Tutorial presented at Empowering People: CHI'90, Seattle WA, April 1990.]]",
      "doi": ""
    },
    {
      "text": "White, E.A., Wildman, D.M., and Muller, M.J. (1989). Practicum in Methods for User CenteredDesi gn. Tutorial presented at Human Factors Society Annual Meeting, September 1991.]]",
      "doi": ""
    },
    {
      "text": "Winner, L. (1986). The Whale and the Reactor: A SearchforLimitsinanAge of High Technology. Chicago: University of Chicago Press.]]",
      "doi": ""
    }
  ]
}