{
  "doi": "10.1145/142750.142908",
  "title": "Requirements and design of DesignVision and object-oriented graphical interface to an intelligent software design assistant",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "499-506",
  "year": 1992,
  "badges": [],
  "abstract": "Key findings from empirical studies—early design is opportunistic; critical role of pictures in design conception; impact of various cognitive limitations—have very effectively determined requirements and design for a set of tools to support early design. Key design features of the tools include respectively: (1) The (simultaneous) display of any software modules at arbitrary levels of abstraction and from any subsystems. The unrestricted, smooth navigation between these software modules. (2) Multiple design notations—pictorial and symbolic— cross-referenced, editable, and maintained consistent across all views. Integrated views of control flow, data flow, and functional decomposition. (3) Automatic layout at arbitrary levels of nesting. Visual display of execution paths in the solution. Automatic completeness and consistency check. Automatic visual indication and listing of modules with constraint violations.",
  "authors": [
    {
      "name": "Raymonde Guindon",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329489045",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fisher, A. S. (1988). CASE: Using Software Development Tools. New York\" Wiley. ",
      "doi": "10.5555/532562"
    },
    {
      "text": "Guindon, R. (1990a). Designing the design process: Exploiting opportunistic thoughts. Human- Computer Interaclion, 5,305-344.",
      "doi": "10.1207/s15327051hci0502%25263_6"
    },
    {
      "text": "Guindon, R. (1990b). Knowledge exploited by experts during software system design. International Journal of Man-Machine Studies, 33, 279-304.  ",
      "doi": "10.1016/S0020-7373%2805%2980120-8"
    },
    {
      "text": "Guindon, R., Krasner, H., and Curtis, B. (1987). Breakdowns and processes during the early activities of software design by professionals. In G. O1- son, E. Soloway, and S. Sheppard (Eds.), Empirical Studies of Programmers, Second Workshop. Ablex Publishing. ",
      "doi": "10.5555/54968.54973"
    },
    {
      "text": "Myers, B. A. The state of the art in visual programming and program visualization. In A. Kilgur and R. Earnshaw (Eds.) Graphzc Tools for Software Engineers, PP. 13-26, University Press, Cambridge, 1989.",
      "doi": ""
    },
    {
      "text": "Nii, H. P., Aiello, N., Bha.nsali, S., Guinclon, I:L., and Peyton, L. I(nowledge-asszsted .~ofl'ware engineemng (KAS'E): An zntroduct~on and slat'us-Ju~e 1991. Report KSL 91-28. Knowledge Systems Laboratory, Computer Science Department, Stanford University, 1991.",
      "doi": ""
    },
    {
      "text": "Schiudler, M. Con~putcr-a,ded software des~g~. John Wiley and Sons, New ~%rk, 1990.",
      "doi": ""
    },
    {
      "text": "Ullman, D.G., Stauffer, L.A., and Diett, erich, T.G. (1987). Toward Expert CAD. Computers ,~n Mechan'tcal Eng,neer'tT~g, Nov.-Dec. Issue.",
      "doi": ""
    }
  ]
}