{
  "doi": "10.1145/142750.3482505",
  "title": "Go Fish! A multi-user game in the Rendezvous System",
  "published": "2021-08-14",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "647",
  "year": 2021,
  "badges": [],
  "abstract": "The Rendezvous™ System is an infrastructure for building multi-user, synchronous applications. Multi-user, synchronous applications are those that are designed to be used by several people simultaneously. Examples of such applications range from collaborative debugging of software to multi-party contract negotiations to games for several players. This videotape shows a demonstration of one multi-user application we have built. The application is a card table that allows up to four people to play any card game they wish. On the tape, you will see several rounds of a game of fish. This game, though simple, serves to highlight four key capabilities that an infrastructure for building multi-user applications must support. These are: 1) support for separate, customized views for each user of the same underlying data, 2) support for public data (i.e., data shown to all users) as well as private data (i.e., data shown only to a particular user), 3) support for access control among users so that certain data is only accessible to some users, and 4) support for the direct manipulation of data objects on the users' displays. We believe that the ability for people to communicate with one another in the structured manner of multi-user applications offers an enormous opportunity for people to enrich the way they work, learn, and play. Many sorts of multi-user applications are possible and research into infrastructures like the Rendezvous System may some day allow for the rapid production of these types of systems. For more information, please see the suggested readings.",
  "authors": [
    {
      "name": "Steven L. Rohall",
      "institution": "Bellcore",
      "img": "/do/10.1145/contrib-81100064201/rel-imgonly/rohall.jpg",
      "acmid": "81100064201",
      "orcid": "missing"
    },
    {
      "name": "John F. Patterson",
      "institution": "Bellcore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100562339",
      "orcid": "missing"
    },
    {
      "name": "Ralph D. Hill",
      "institution": "Bellcore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100454732",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hill, R.D., The Abstraction-Link-View Paradigm: Using Constraints to Connect User Interfaces to Applications, Proceedings of CH/'92, the Conference on Human Factors in Computing Systems, (Monterey, CA, May 3-7, 1992), ACM Press, elsewhere in this volume.",
      "doi": ""
    },
    {
      "text": "Hill, R.D., Languages for the Construction of Multi-User Multi-Media Synchronous (MUMMS) Applications, in Languages for Developing User Interfaces, B. Myers (Ed.), Boston: Jones and Bartlett, 1992.",
      "doi": "10.5555/131302.131310"
    },
    {
      "text": "Hill, R.D., A 2-D Graphics System for Multi-User Interactive Graphics Based on Objects and Constraints, in Advances in Object-Oriented Graphics, E. Blake and P. Wisskirchen (Eds.), Berlin: Springer-Verlag, 1991.",
      "doi": ""
    },
    {
      "text": "Patterson, J.F., Comparing the Programming Demands of Single-User and Multi-User Applications, Proceedings of UIST'91, the ACM Symposium on User Interface Software and Technology, (Hilton Head, SC, November 11-13, 1991), ACM Press, pp. 87-94.",
      "doi": "10.1145/120782.120792"
    },
    {
      "text": "Patterson, J.F., Hill, R.D., Rohall, S.L., and Meeks, W.S., Rendezvous: An Architecture for Synchronous Multi-User Applications, Proceedings of CSCW'90, the Conference on Computer-Supported Cooperative Work, (Los Angeles, CA, October 7-10, 1990), ACM Press, pp. 317-328.",
      "doi": "10.1145/99332.99364"
    }
  ]
}