{
  "doi": "10.1145/142750.142895",
  "title": "Participatory design of a portable torque-feedback device",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "439-446",
  "year": 1992,
  "badges": [],
  "abstract": "Customer-driven design processes such as participatory design can be used to develop new presence, or virtual reality, technology. Chemists worked together with computer company engineers to develop scenarios for how present technology could be used to support future molecular modeling work in drug design. These scenarios led to the development of a portable torque-feedback device which can be used with either workstation or virtual reality technology. This paper discusses both the experience with the participatory design process and the novel features of the portable torque-feedback device.",
  "tags": [
    "participatory design",
    "chemistry",
    "virtual reality",
    "molecular modeling",
    "presence",
    "force feedback"
  ],
  "authors": [
    {
      "name": "Michael Good",
      "institution": "Digital Equipment Corporation, Nashua, NH, USA",
      "img": "/do/10.1145/contrib-81100090422/rel-imgonly/michael-formal-square2.png",
      "acmid": "81100090422",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blomberg, J. L. and Henderson, A. Reflections on participatory design: Lessons from the Trillium experience. In Proc. CHI '90 Human Factors in Computing Systems (Seattle, WA, April I-5, 1990), ACM, New York, 353-359.  ",
      "doi": "10.1145/97243.97307"
    },
    {
      "text": "Brooks, 1=. P., Jr., Ouh-Young, M., Batter, J. J. and Kilpatrick, P. J. Project GROPE --- Haptic displays for scientific visualization. Computer Graphics, 24, 4 (August 1990), 177-185. Proc. SIGGRAPH '90 (Dallas, TX, August 6-i0, 1990).  ",
      "doi": "10.1145/97880.97899"
    },
    {
      "text": "Ditlea, S. Another world: Inside artificial reality. PC~Computing, 2, I I (November 1989), 90-102. ",
      "doi": "10.5555/101916.101931"
    },
    {
      "text": "Elm, P. Work-Oriented Design of Computer Artifacts. Arbetslivscentnun, Stockholm, 1988. Available from Lawrence Erlbaum Associates, Hiilsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Gilles, W. The presence of products: A question of perspective. Innovation, 4, 3 (i 985), 5-8.",
      "doi": ""
    },
    {
      "text": "Gmdin, J. Systematic sources of suboptimal interface design in large product development organizations. Human-Computer Interaction, 6, 2 (1991), 147-196.",
      "doi": ""
    },
    {
      "text": "Holtzblatt, K. A., Jones, S. and Good, M. Articulating the experience of transparency: An example of field research techniques. SIGCHI Bulletin, 20, 2 (October 1988), 45-47.  ",
      "doi": "10.1145/54386.54402"
    },
    {
      "text": "lwata, H. Artificial reality with force-feedback: Development of desktop virtual space with compact master manipulator. Computer Graphics, 24, 4 (August 1990), 165--170. Proc. SIGGRAPH '90 (Dallas, TX, August 6-i 0, 1990).  ",
      "doi": "10.1145/97880.97897"
    },
    {
      "text": "Johnson, J., Ehn, P., Gmdin, J., Nard/, B., Thoresen, K. and Suclunan, L. Participatory design of computer systems (panel). In Proc. CHI '90 Human Factors in Computing Systems (Seattle, WA, April I-5, 1990), ACM, New York, 141-144.  ",
      "doi": "10.1145/97243.97266"
    },
    {
      "text": "Krueger, M. W. Artificial Reality II. Addison-Wesley, Reading, MA, 1991.",
      "doi": ""
    },
    {
      "text": "Laurel, B. Computers as Theatre. Addison-Wesley, Reading, MA, 1991. ",
      "doi": "10.5555/103681"
    },
    {
      "text": "Minsky, M., Ouh-Young, M., Steele, O., Brooks, F. P., Jr. and Behensky, M. Feeling and seeing: Issues in force display. Computer Graphics, 24, 2 (March 1990), 235-243. Proc. 1990 Symposium on Interactive 3D Graphics (Snowbird, UT, March 25-28, 1990).  ",
      "doi": "10.1145/91394.91451"
    },
    {
      "text": "Mohamadi, F., Richards, N. G. J., Guida, W. C., Li.~kamp, R., Lipton, M., Caufield, C., Chang, G., Hendrickson, T. and Still, W. C. MacroModel- An integrated software system for modeling organic and bioorganic molecules using molecular mechanics. Journal of Computational Chemistry, 11, 4 (April 1990), 44~67.  ",
      "doi": "10.1002/jcc.540110405"
    },
    {
      "text": "Mountford, S. J., Buxton, B., Kruegcr, M., Laurel, B. and Vertelney, L. Drama and personality in user interface design (panel). In Proc. CHI '89 Human Factors in Computing Systems (Austin, TX, April 30-May 4, 1989), ACM, New York, 105-108.  ",
      "doi": "10.1145/67449.67471"
    },
    {
      "text": "Perelman, Ch. and Olbrechts-Tyteca, L. The New Rhetoric\" A Treatise on Argumentation. Trans. J. Wilkinson and P. Weaver. University of Notre Dame Press, Notre Dame, IN, 1969. Original French version published in 1958.",
      "doi": ""
    },
    {
      "text": "Rh~ingold, H. Virtual Reality. Summit Books, New York, 1991. ",
      "doi": "10.5555/135302"
    },
    {
      "text": "Rorty, R. Essays on Heidegger and Others: Philosophical Papers Volume 2. Cambridge University Press, Cambridge, 1991.",
      "doi": ""
    },
    {
      "text": "Wixon, D. and Good, M. Interface style and eclecticism: Moving beyond categorical approaches. In Proc. Human Factors Society 31st Annual Meeting (New York, October 19-23, 1987), Human Factors Society, Santa Monica, CA, Vol. 1,571-575.",
      "doi": ""
    },
    {
      "text": "Wixon, D., Holtzblatt, K. and Knox, S. Contextual design: An emergent view of system design. In Proc. CHI '90 Human Factors in Computing Systems (Seattle, WA, April 1-5, 1990), ACM, New York, 329-336.  ",
      "doi": "10.1145/97243.97304"
    }
  ]
}