{
  "doi": "10.1145/142750.142905",
  "title": "Towards a model of cognitive process in logical design: comparing object-oriented and traditional functional decomposition software methodologies",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "489-498",
  "year": 1992,
  "badges": [],
  "abstract": "This study aims at developing and empirically testing hypotheses about professional designers' cognitive activities when using object-oriented methodology (OOD) versus using traditional functional decomposition methodologies (TFD). Our preliminary results indicate that OOD may achieve substantial time savings over TFD in logical design. The verbal protocols from a pilot study show that OOD may achieve these time savings: 1) by simplifying rule induction processes used in functional decomposition; 2) by guiding designers on how to build more effective problem spaces; and 3) by allowing designers to run mental simulation more efficiently and more effectively.",
  "authors": [
    {
      "name": "Jinwoo Kim",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406599725",
      "orcid": "missing"
    },
    {
      "name": "F. Javier Lerch",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100223021",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, B., and Soloway, E. A Model for Software Design (YALEU/CSD/RR #342). Shelton, CT: ITT 1984.",
      "doi": ""
    },
    {
      "text": "Anderson, J. and jefferies, R. Novice LISP Errors: Undetected Losses of Information from Working Memory. Human-Computer Interaction, Vol. 1, (1985), 107-131.",
      "doi": "10.1207/s15327051hci0102_2"
    },
    {
      "text": "Booch, G. Object-Oriented Development. IEEE Transactions on Software Engineering, SE-12, (1986). 211-221. ",
      "doi": "10.5555/9794.9797"
    },
    {
      "text": "Booch, G. Object Oriented Design with applications. Benjamin/Cummings, Redwood City, C.A., 1991. ",
      "doi": "10.5555/82528"
    },
    {
      "text": "Coad, P and Yourdon, E. Object-Oriented Analysis. Prentice-Hall, Englewood Cliffs, N.J., 1991. ",
      "doi": "10.5555/130444"
    },
    {
      "text": "Cox, B.J. Object oriented programming: An evolutionary approach. Reading, MA: Addision-Wesley, 1987. ",
      "doi": "10.5555/16111"
    },
    {
      "text": "Ericsson, A. and Simon, H. Protocol Analysis. MIT Press, London, England, 1984.",
      "doi": ""
    },
    {
      "text": "Guindon, R. Designing the Design Process: Exploiting Opportunistic Thoughts. Human-Computer Interaction, 5, (1990), 305-344.",
      "doi": "10.1207/s15327051hci0502%25263_6"
    },
    {
      "text": "Guindon, R., Curtis, B., and Krasner, H. A Model of Cognitive Processes in Software Design: An Analysis of Breakdowns in Early Design Activities by Individuals (MCC Tech. Rep. No. STP-283-87). Austin, TX: Microelectronics and Computer Technology Corporation, 1987.",
      "doi": ""
    },
    {
      "text": "Hayes, J.R. and Simon, H. Psychological Differences among Problem Isomorphs. In H. A. Simon (Ed), Models of Thought, Vol. L Yale University Press, New Haven, 1977, 498-512",
      "doi": ""
    },
    {
      "text": "Henderson-Sellers, B. and Edwards, J. M. The Object-Oriented Systems Life Cycle. Communications of the ACM, 33, (1990), 143-159.  ",
      "doi": "10.1145/83880.84529"
    },
    {
      "text": "Jackson, M.A. System Development. Prentice-Hall, Englewood Cliffs, N.J. 1983. ",
      "doi": "10.5555/1096895"
    },
    {
      "text": "Kahneman, D., and Tversky, A. The simulation heuristic. In D. Kahneman, P. Slovic, and A. Tversky (Eds.), Judgment under uncertainty: Heuristics and biases. New York\" Cambridge University Press, 1982, 201-208.",
      "doi": ""
    },
    {
      "text": "Kant, E. and Newell, A. Problem solving techniques for the design of algorithms, information processing and management, 20, (1984), 97-118.",
      "doi": ""
    },
    {
      "text": "Korson, T., and McGregor, J.D. Understanding Object-Oriented: A Unifying Paradigm. Communications of the ACM, 33, (1990), 40-60.  ",
      "doi": "10.1145/83880.84459"
    },
    {
      "text": "Meyer, B. Object-Oriented Software Construction. rentice-Hall, Hemel, Hempstead, 1988. ",
      "doi": "10.5555/261119"
    },
    {
      "text": "Newell, A., and Simon, H. Human Problem Solving. Prentice-Hall, Englewood Cliffs, N.J., 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Page-Jones, M. The Practical guide for strttctttral design. Prentice-Hall, Englewood Cliffs, New Jersey, 1987.",
      "doi": ""
    },
    {
      "text": "Rambaugh, J., Blaha, M., Premerlani, W., Eddy, F., and Lorensen, W. Object-oriented modeling and design. Prentice-Hall, Englewood Cliffs, N.J., 1991. ",
      "doi": "10.5555/130437"
    },
    {
      "text": "Rosson, M. B., and Alpert, S. R. The Cognitive Consequences of Object-Oriented Design. Human- Computer Interaction, 5, (1990), 345-379.",
      "doi": "10.1207/s15327051hci0504_1"
    },
    {
      "text": "Rosson, M. B., and Gold, E. Problem-Solution Mapping in Object-Oriented Design (RC 14496 (#64951)). User interface institute, IBM T. J. Watson research center, 1989.",
      "doi": ""
    },
    {
      "text": "Simon, H. A., Kotovsky, K., and Hayes, J.R. Why Are Some Problems Hard? Evidence from the Tower of Hanoi. Cognitive Psychology, 17, 1985, 248-294.",
      "doi": ""
    },
    {
      "text": "Simon, H. and Kotovsky, K. Empirical Tests of a Theory of Human Acquisition of Concepts for Sequential Patters. In H. A. Simon (Ed), Models of Thought, Vol. I. Yale University Press, New Haven, 1977, 274-291.",
      "doi": ""
    },
    {
      "text": "Simon, H. and Kulkarni, D. The processes of Scientific Discovery; The strategy of Experimentation. In H. A. Simon (IEd), Models of Thought, vol II. Yale University Press, New Haven, 1988, 357-382",
      "doi": ""
    },
    {
      "text": "Simon, H, A., Lea, G. Problem Solving and Rule Induction. In H. A. Simon (Ed.), Models of Thought, voI. /. Yale University Press, New Haven, 1977, 329-346.",
      "doi": ""
    },
    {
      "text": "Thomdyke, P., and Hayes-Roth, B. Differences in Spatial Knowledge Acquired from Maps and Navigation. Cognitive Psychology, 14, (1982), 560-589.",
      "doi": ""
    },
    {
      "text": "Yourdon, E. Modern Structured Analysis. Prentice- Hall, Englewood Cliffs, N.J., 1989. ",
      "doi": "10.5555/62004"
    }
  ]
}