{
  "doi": "10.1145/142750.142770",
  "title": "Evaluating two aspects of direct manipulation in advanced cockpits",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "127-134",
  "year": 1992,
  "badges": [],
  "abstract": "Increasing use of automation in computer systems, such as advanced cockpits, presents special challenges in the design of user interfaces. The challenge is particularly difficult when automation is intermittent because the interface must support smooth transitions from automated to manual mode. A theory of direct manipulation predicts that this interface style will smooth the transition. Interfaces were designed to test the prediction and to evaluate two aspects of direct manipulation, semantic distance and engagement. Empirical results supported the theoretical prediction and also showed that direct engagement can have some adverse effects on another concurrent manual task. Generalizations of our results to other complex systems are presented.",
  "authors": [
    {
      "name": "James A. Ballas",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100032930",
      "orcid": "missing"
    },
    {
      "name": "Constance L. Heitmeyer",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100276673",
      "orcid": "missing"
    },
    {
      "name": "Manuel A. Pérez-Quiñones",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/do/10.1145/contrib-81100175306/rel-imgonly/manuel1.png",
      "acmid": "81100175306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ballas, J. A., Heitmeyer, C. L., and Ptrez, M. A. Direct Manipulation and Intermittent Automation in Advanced Cockpits. Technical Rep. 9375. Naval Research Laboratory, Washington, D. C. (in press).",
      "doi": ""
    },
    {
      "text": "Beltracchi, L. A direct manipulation interface for heat engines based upon the Rankine cycle. I EEE Transactions on Systems, Man and Cybernetics. 17(3), pp. 478-487 (1987).",
      "doi": ""
    },
    {
      "text": "Benson, C. R., Govindaraj, T., Mitchell, C. M. and Krosner, S.P. Effectiveness of direct manipulation interaction in the supervisory control of FMS parts movement. Proc. IEEE International Conference on Systems, Man, and Cybernetics. Cambridge, MA, pp. 947-952 (Nov. 14-17, 1989).",
      "doi": ""
    },
    {
      "text": "Bernotat, R. K. Man and computer in future on-board guidance and control systems of aircraft. In B. Shackel (Ed.) Man-computer interaction: Human factors aspects of computers and people. Sijthoff &amp; Noordhoff, RockviUe, MD (1981).",
      "doi": ""
    },
    {
      "text": "Draper, S. W. Display managers as the basis for usermachine communication. In D. A. Norman &amp; S. W. Draper (Eds.) User-centered system design. Erlbaum Associates, HiUsdale, NJ, pp. 339-352 (1986).",
      "doi": ""
    },
    {
      "text": "Hutchins, E., Hollan, J. D. and Norman, D.A. Direct manipulation interfaces, in D. A. Norman &amp; S. W. Draper (Eds.) User-centered system design. Erlbaum Associates, Hillsdale, NJ, pp. 87-124 (1986).",
      "doi": ""
    },
    {
      "text": "Karat, J. Evaluating user interface complexity. Proceedings of the Human Factors Society 31 st Annual Meeting. Human Factors Society, Santa Monica, CA, pp. 566-570 (1987).",
      "doi": ""
    },
    {
      "text": "Kieras, D. E. An overview of human-computer interaction. Journal of the Washington Academy of Sciences. 80(2), pp. 39-70 (1990).",
      "doi": ""
    },
    {
      "text": "Marshak, W. P., Kuperman, G., Ramsey, E. G., and Wilson, D. Situation awareness in map displays. Proceedings of the Human Factors Society 31 st Annual Meeting. Human Factors Society, Santa Monica, CA pp. 533-535 (1987).",
      "doi": ""
    },
    {
      "text": "Parasuraman, R., Bahri, T., Deaton, I. E., Morrison, J. G. and Barnes, M. Theory and design of adaptive automation in aviation systems. Cognitive Science Laboratory, The Catholic University of America, Washington, D. C. (1990).",
      "doi": ""
    },
    {
      "text": "Reising, J. M. and Hartsock, D. C. Advanced warning/caution/advisory displays for fighter aircraft. Proceedings of the Human Factors Society 33rd Annual Meeting. Human Factors Society, Santa Monica, CA. pp. 66-70 (1989).",
      "doi": ""
    },
    {
      "text": "Whiteside, J., Jones, S., Levy, P. S. and Wixon, D. User performance with command, menu, and iconic interfaces. Proc. ACM CHI'85 Human Factors in Computing Systems. ACM, New York. pp. 185-191 (1985).  ",
      "doi": "10.1145/317456.317490"
    },
    {
      "text": "Wickens, C. D. and Liu, Y. Codes and modalities in multiple resources: A success and a qualification. Human Factors. 30(5), pp. 599-616 (1988). ",
      "doi": "10.1177/001872088803000505"
    },
    {
      "text": "Wiener, E.L. Beyond the sterile cockpit. Human Factors. 27(1), pp. 75-90 (1985).",
      "doi": ""
    },
    {
      "text": "Ziegler, J. E. &amp; Fahnrich, K. P. Direct manipulation. In M. Helender (Ed.) Handbook of human-computer interaction. Elsevier Science Publishers, North-Holland, pp. 123-133 (1988).",
      "doi": ""
    }
  ]
}