{
  "doi": "10.1145/142750.142782",
  "title": "Browser-Soar: a computational model of a highly interactive task",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "165-172",
  "year": 1992,
  "badges": [],
  "abstract": "Browser-Soar models the perceptual, cognitive, and motor operators of a user searching for information in an on-line help browser. The model accounts for 90% of the browsing behavior observed in ten episodes. This result suggests that much of browsing behavior is a routine cognitive task, describably by GOMS, and extends the boundary of tasks to which GOMS applies to include highly interactive tasks. Further, it also suggests that GOMS analyses can be used to evaluate text-editors and other computer applications, and to help focus design effort.",
  "authors": [
    {
      "name": "Virginia A. Peck",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100174035",
      "orcid": "missing"
    },
    {
      "name": "Bonnie E. John",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Gray, W.D., John, B.E., and Atwood, M.E. Project Ernestine: Validating GOMS for predicting and explaining real-world task performance. Human- Computer Interaction. In preparation.  ",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "Howes, A. and Young, R.M. Predicting the learnability of Task-action mappings. In Proceedings of Human Factors in Computing Systems, SIGCHI '91, New Orleans, LA, 1991, pp. 113-118.  ",
      "doi": "10.1145/108844.108861"
    },
    {
      "text": "John, B.E., Vera, A.H., and Newell, A. Towards Real-Time Gores. Carnegie Mellon University, School of Computer Science Technical Report. CMU-CS-90-195, 1990.",
      "doi": ""
    },
    {
      "text": "John, B.E. and Newell, A. Toward an engineering model of stimulus-response compatibility. In Stimulus-Response Compatibility: An Integrated Perspective, R. W. Proctor and T. G. Reeve, eds. North-Holland, New York, NY, 1989.",
      "doi": ""
    },
    {
      "text": "Newell, A. Unified Theories of Cognition. Harvard University Press, Cambridge, MA, 1990. ",
      "doi": "10.5555/86564"
    },
    {
      "text": "Newell, A. and Simon. H. Human Problem Solving. Prentice-Hall, Englewood Cliffs, NJ, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Olson, J.R. and Olson, G.M. The growth of cognitive modeling in human computer interaction since GOMS. Human Computer Interaction, 5, pp. 221-266, 1990.",
      "doi": "10.1207/s15327051hci0502%25263_4"
    },
    {
      "text": "Suchman, L.A. Plans and Situated Actions. Cambridge University Press, Cambridge, UK, 1987",
      "doi": "10.5555/38407"
    },
    {
      "text": "Wharton, C. Implications of the Differences Between Cognitive Architectures for Human-Computer Interaction. Ph.D. Dissertation, University of Colorado. In preparation.",
      "doi": ""
    }
  ]
}