{
  "doi": "10.1145/142750.142751",
  "title": "Edit wear and read wear",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3-9",
  "year": 1992,
  "badges": [],
  "abstract": "We describe two applications that illustrate the idea of computational wear in the domain of document processing. By graphically depicting the history of author and reader interactions with documents, these applications offer otherwise unavailable information to guide work. We discuss how their design accords with a theory of professional work and an informational physics perspective on interface design.",
  "tags": [
    "graphical user interfaces",
    "reflective practitioner",
    "professional work",
    "interface mechanisms",
    "informational physics"
  ],
  "authors": [
    {
      "name": "William C. Hill",
      "institution": "Computer Graphics and Interactive Media Research Group, Bellcore, Morristown, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100454370",
      "orcid": "missing"
    },
    {
      "name": "James D. Hollan",
      "institution": "Computer Graphics and Interactive Media Research Group, Bellcore, Morristown, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332504463",
      "orcid": "missing"
    },
    {
      "name": "Dave Wroblewski",
      "institution": "US West Advanced Technologies, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170929",
      "orcid": "missing"
    },
    {
      "name": "Tim McCandless",
      "institution": "US West Advanced Technologies, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100606774",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Egan, D.E., Remde, J.R., Gomez, L.M., Landauer, T.K., Eberhardt, J. and Lochbaum, C.C. Formative Design-Evaluation of SuperBook., ACM Transactions on Information Systems, 1989, 7:1, pp.30-57.]]  ",
      "doi": "10.1145/64789.64790"
    },
    {
      "text": "Fischer, G. and Lemke, A.C. Construction Kits and Design Environments: Steps Toward Human Problem- Domain Communication, Human-Computer Interaction, 1988, 3:3, pp. 179-222.]]  ",
      "doi": "10.1145/49103.1046496"
    },
    {
      "text": "Fischer, G., McCall, R., and Morch, A. JANUS: Integrating Hypertext with a Knowledge-based Design Environment, Proceedings of Hypertext'89 (Pittsburgh, PA), ACM, New York, November, 1989, pp. 105-117.]]  ",
      "doi": "10.1145/74224.74233"
    },
    {
      "text": "Fischer, G., McCall, R., and Morch, A. Making Argumentation Serve Design, Tech. report, Department of Computer Science, University of Colorado, Boulder, CO, 1991.]]",
      "doi": ""
    },
    {
      "text": "Fischer, G., Lemke, A. C., Mastaglio, T., and Morch, A., The Role of Critiquing in Cooperative Problem Solving, ACM Transactions on Information Systems, 1991, (in press).]]  ",
      "doi": "10.1145/123078.128727"
    },
    {
      "text": "Hollan, J. D., Hutchins, E. L., McCandless, T. E, Rosenstein, M., Weitzman, L. Graphical Interfaces for Simulation. In B. Rouse (Ed.) Advances in Man-Machine Systems Research, Greenwich, CT: JAI Press, Inc, 1987, 129-163.]]",
      "doi": ""
    },
    {
      "text": "Hollan, J.D. and Hill, W. C. Towards an Informational Physics Perspective for Interface Design, In preparation.]]",
      "doi": ""
    },
    {
      "text": "Lewis, C. and Norman, D. Designing for Error. In D. Norman &amp; S. Draper (Eds.) User Centered System Design: New Perspectives on Human-Computer Interaction, Hillsdale, NJ: Lawrence Eflbaum Associates, 1986, 411-432.]]",
      "doi": ""
    },
    {
      "text": "McCall, R., Fischer, G. and Morch, A. Supporting Reflection-in-Action in the Janus Design Environment in M. McCullough et al., (Eds.), The MIT Press, Cambridge, MA, 1990, pp. 247-259.]] ",
      "doi": "10.5555/109149.109167"
    },
    {
      "text": "McCandless, T. E, PDP Mechanisms of Intelligent Display Control, Society for Computer Simulation Conference on Intelligent Simulation Environments, San Diego, pp. 87- 91, 1986.]]",
      "doi": ""
    },
    {
      "text": "Schoen, D. The Reflective Practitioner: How Professionals Think in Action Basic Books, New York, 1982.]]",
      "doi": ""
    },
    {
      "text": "Schoen, D., Educating The Reflective Practitioner. Jossey-Bass Publishers, San Francisco, 1987.]]",
      "doi": ""
    },
    {
      "text": "Weaver, W. Lady Luck. Double Day, Garden City, NY, 1963.]]",
      "doi": ""
    },
    {
      "text": "Wroblewski, D., McCandless, T., and Hill, W.C., DETENTE: Practical Support for Practical Action, Human Factors in Computing Systems, CHI'91 Conference Proceedings (New Orleans, LA), ACM, New York, 1991, pp. 195-202.]]  ",
      "doi": "10.1145/108844.108887"
    },
    {
      "text": "Wroblewski, D., Hill, W.C., Mccandless, T. Attributemapped Scroll Bars, U.S. Patent Applications: Serial No. 07/523,117 filed May 14, 1990, Serial No. 07/626,130 filed Dec 11, 1990.]]",
      "doi": ""
    }
  ]
}