{
  "doi": "10.1145/142750.142830",
  "title": "Evocative agents and multi-media interface design",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "351-356",
  "year": 1992,
  "badges": [],
  "abstract": "This paper describes research which focusses on the issue of possible roles for computerized agents within multimedia educational software.",
  "tags": [
    "multi-media software",
    "computerized agents",
    "educational software",
    "foreign language learning"
  ],
  "authors": [
    {
      "name": "Beth Adelson",
      "institution": "Rutgers University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100466442",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, B. Characterizing the nature of analogical reasoning. In Design Theory and Methodology. M. Waldron (Ed.). Springer-Verlag. NY. In press.",
      "doi": ""
    },
    {
      "text": "Adelson, B. Categorizing Concepts. Cognitive Science. December, 198~.",
      "doi": ""
    },
    {
      "text": "Adelson, B. and Soloway, E. The role of domain experience in software design. IEEE: Transactions in Software Engineering. November, 1985.  ",
      "doi": "10.1109/TSE.1985.231883"
    },
    {
      "text": "Adelson, B. When novices surpass experts: How the difficulty of a task may increase with expertise. Journal of Ezperimental Psychology: Learning, Memory and Cognition. July, 1984.",
      "doi": ""
    },
    {
      "text": "Adelson, B. Problem solving and the development of abstract categories in programming languages. Memory ~ Cognition, 1981 9(4), 422-433.",
      "doi": ""
    },
    {
      "text": "Anderson, J.R. The architecture of Cognition. Harvard University Press: Cambridge, MA. 1983. ",
      "doi": "10.5555/538901"
    },
    {
      "text": "Chi, M., Bassok, M., Reimann, P. and Glazer, R. Self-explanations. Cognitive Science 13, 1989.",
      "doi": ""
    },
    {
      "text": "Chi, M., Feltovich, P and Glaser, R. Categorization and representation of physics problems by experts and novices. Cognitive Science. 1981",
      "doi": ""
    },
    {
      "text": "Larkin, J. What kind of knowledge transfrs? In Knowing, Learning and Instruction L. Resnick (ed.) Lawrence Erlbaum: Hillsdale, NJ. 1989.",
      "doi": ""
    },
    {
      "text": "Hodges, M. (ed.) Applications from the MIT Muse Software Consortium. NY: Addison-Wesley. In press.",
      "doi": ""
    },
    {
      "text": "Hodges, M. Sasnett, It. and Ackerman, M. A construction set for multi-media applications. IEEE: Transactions in Software Engineering. January, 1989.  ",
      "doi": "10.1109/52.16900"
    },
    {
      "text": "Hodges, M. Sasnett, R. and Harward, V. J. Uniz Review. Vol. 8, 2. 1990.",
      "doi": ""
    },
    {
      "text": "Larkin, J. What kind of knowledge transfrs? In Knowing, Learning and Instruction L. Resnick (ed.) Lawrence Erlbaum: Hillsdale, NJ. 1989.",
      "doi": ""
    },
    {
      "text": "Laurel, B. In~efface Agents. In The Art of HCI Design. (B. Laurel, ed.) NY: Addison-Wesley. 1990.",
      "doi": ""
    },
    {
      "text": "Novick, L. Analogical transfer, problem similarity and expertise, journal of Bzperimental Psychology: I,, M and C. 1988.",
      "doi": ""
    },
    {
      "text": "Oren,Salomon, Kreitman and Don, In The Art of HCI Design. (B. Laurel, ed.) NY: Addison-Wesley. 1990.",
      "doi": ""
    },
    {
      "text": "Schoenfeld, A. Mathematical Problem-Solving. Academic Press: NY. 1985.",
      "doi": ""
    },
    {
      "text": "Tufte, E. The Visual Display of Quantitatir Information. Graphics Press: Cheshire, CT. 1990. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Tufte, E. Envisioning Information. Graphics Press: Cheshire, CT. 1983. ",
      "doi": "10.5555/78223"
    }
  ]
}