{
  "doi": "10.1145/142750.143067",
  "title": "A case study of a multimedia co-working task and the resulting interface design of a collaborative communication tool",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "649-650",
  "year": 1992,
  "badges": [],
  "abstract": "The Video Viewer is a communication tool that allows two users to share video information across a network. The design of this tool was based on the results of a case study involving two multimedia, collaborative workstations situated in two separate rooms. Users performed several tasks collaboratively using different media in an unstructured environment (i.e., there were four monitors to increase screen space and there was no specific interface for guidance). This video outlines the case study, the preliminary case study results and how these results effected the interface design of the Video Viewer.",
  "authors": [
    {
      "name": "Amanda Ropa",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524082",
      "orcid": "missing"
    },
    {
      "name": "Bengt Ahlström",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Buxton, B. &amp; Moran, T. (1990). Europarc's integrated interactive intermedia facility: Early experiences in multi-user interfaces and applications, S. Gibbs &amp; A.A. Verrijn-Stuart (Eds.), Elsevier Science Publisher, North Holland. ",
      "doi": "10.5555/133482.133487"
    },
    {
      "text": "Heath, Christian &amp; Luff, Paul. (1991). Disembodied conduct: communication through video in a multi-media office environment. CHI'91 Conference Proceedings, April, New Orleans, LA, 99-103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "ishii, Hiroshi.(1990). TeamWorkstation: Towards a seamless shared workspace. Proc. CSCW'90 Conference on Computer-SupportedCooperative Work, October, Los Angeles, CA, 13-27.  ",
      "doi": "10.1145/99332.99337"
    },
    {
      "text": "Mantei M. Marilyn, Baecker M. Ronald, Abigail J. Sellen. Buxton. A.S. William, Milligan, Thomas,Wellman, Barry. (1991). Experiences in the use of media space. CHI'91 Conference Proceedings, April, New Orleans, LA, 203-207.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "MultiG: A Collaborative Research Program on Distributed Multimedia Applications in a Multi-Gigabit per Second Network. (1990). Proceedings from the 1st MultiG workshop, Stockholm, Sweden.",
      "doi": ""
    }
  ]
}