{
  "doi": "10.1145/142750.142806",
  "title": "Coupling application design and user interface design",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "259-266",
  "year": 1992,
  "badges": [],
  "abstract": "Building an interactive application involves the design of both a data model and a graphical user interface (GUI) to present that model to the user. These two design activities are typically approached as separate tasks and are frequently undertaken by different individuals or groups. Our apporach eliminated redundant specification work by generating an interface directly from the data model itself. An inference engine using style rules for selecting and placing GUI controls (i.e., widgets) is integrated with an interface design tool to generate a user interface definition. This approach allows a single data model to be mapped onto multiple GUI's by substituting the appropriate rule set and thus represents a step toward a GUI-independent run-time layout facility.",
  "authors": [
    {
      "name": "Dennis J. M. J. de Baar",
      "institution": "Delft University of Technology, Delft, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659851500",
      "orcid": "missing"
    },
    {
      "name": "James D. Foley",
      "institution": "Georgia Tech, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302796",
      "orcid": "missing"
    },
    {
      "name": "Kevin E. Mullet",
      "institution": "SunSoft Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100325096",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple Computer, Inc. Human Interface Guidelines: The Apple Desktop Interface. Reading, MA: Addison-Wesley, 1987.]] ",
      "doi": "10.5555/1207530"
    },
    {
      "text": "Beekman, W.H.R. D2m2edit, Master's Thesis, Delft University of Technology, The Netherlands, July 1990.]]",
      "doi": ""
    },
    {
      "text": "Beshers, C. and S. Feiner, \"Scope: Automated Generation of Graphical Interfaces,\" Proc. ACM SIGGRAPH Symposium on User Interface Software and Technology, October 1988, pp. 76-85.]]  ",
      "doi": "10.1145/73660.73670"
    },
    {
      "text": "Foley, J.D., C. Gibbs, W. Kim, S. Kovacevic, L. Moran, P. Sukaviriya, \"A Knowledge-Based User Interface Management System,\" Human Factors in Computing Systems, CHI'88 Conference Proceedings, May 1988, pp. 67-72.]]  ",
      "doi": "10.1145/57167.57178"
    },
    {
      "text": "Foley, J.D., W. C. Kim, S. Kovacevic, and K. Murray, \"UIDE - An intelligent User Interface Design Environment,\" in Sullivan, J and S. Tyler (eds.), Architectures for Intelligent Interfaces: Elements and Prototypes, Addison-Wesley, Reading, MA, 1991.]]  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "Hewlett-Packard Company, HP Interface Architect Developer's Guide, Hewlett-Packard Company, Corvallis, Oregon, October 1990.]]",
      "doi": ""
    },
    {
      "text": "IBM Corporation. System Application Architecture, Common Access Panel Design and User Interaction. SC26-4351-0. December 1987.]]",
      "doi": ""
    },
    {
      "text": "Kim, W. and J. Foley, \"DON: User Interface Presentation Design Assistant,\" Proc. ACM SIGGRAPH Symposium on User Interface Software and Technology, October 1990, pp. 10-20.]]  ",
      "doi": "10.1145/97924.97926"
    },
    {
      "text": "NeXT Computer Inc., NeXTstep Concepts, Redwood City, CA: NeXT Computer, Inc., pp. 8-1 to 8-53.]]",
      "doi": ""
    },
    {
      "text": "Olsen, D. \"A programming Language Basis for User interface Management,\" Human Factors in Computing Systems, CHI'89 Conference Proceedings, May 1989, pp. 171-176.]]  ",
      "doi": "10.1145/67449.67485"
    },
    {
      "text": "Open Software Foundation. OSF/Motif Style Guide, Revision 1.0, OSF I 1 Cambridge Center, Cambridge, MA 02142, ISBN 0-13-640491-X, 1990.]] ",
      "doi": "10.5555/101385"
    },
    {
      "text": "Singh, G. and M. Green, \"Chisel: A System for Creating Highly Interactive Screen Layouts,\" Proc. ACM SIGGRAPH Symposium on Software and Technology, November 1989, pp. 86-94.]]  ",
      "doi": "10.1145/73660.73671"
    },
    {
      "text": "Sun Microsystems, Inc. and AT&amp;T, OPENLDOK GUI Application Style Guidelines. Addison- Wesley, Reading, MA, 1990.]] ",
      "doi": "10.5555/101383"
    },
    {
      "text": "Sun Microsystems, Inc., Open Windows Developer's Guide 1.1,Reference Manual, Part No. 800-5380-10, Revision A, June 1990.]]",
      "doi": ""
    },
    {
      "text": "Wiecha, C., et. al., \"Generating Highly Interactive User Interfaces,\" Human Factors in Computing Systems, CHI'89 Conference Proceedings, May 1989, pp. 277-282.]]  ",
      "doi": "10.1145/67449.67502"
    },
    {
      "text": "Zanden, B. Vander and B.A. Myers, \"Automatic, Look-and-Feel Independent Dialog Creation for graphical User Interfaces,\" Human Factors in Computing Systems, CHI' 90 Conference Proceedings, April 1990, pp. 27-34.]]  ",
      "doi": "10.1145/97243.97248"
    }
  ]
}