{
  "doi": "10.1145/142750.142758",
  "title": "The Virginia User Interface Laboratory",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "63-64",
  "year": 1992,
  "badges": [],
  "abstract": "No abstract available.",
  "authors": [
    {
      "name": "Randy Pausch",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Randy Pausch, Virtual Reality on Five Dollars a Day, ACM SIGCHI: Human Factors in Computing Systems, April, 1991.  ",
      "doi": "10.1145/108844.108913"
    },
    {
      "text": "Randy Pausch and Ronald D. Williams, Giving CANDY to Children: User-Tailored Gesture Input Driving an Articulator-Based Speech Synthesizer, Communications of the ACM. (to appear).  ",
      "doi": "10.1145/129875.129880"
    },
    {
      "text": "Randy Pausch, Robert DeLine and Nathanicl Young, SUIT: The Pascal of User Interface TooUa'ts, ACM UIST '91\" Fourth Annual Symposium on User Interface Software and Technology, November, 1991.  ",
      "doi": "10.1145/120782.120795"
    },
    {
      "text": "Randy Pausch and James H. Leathcrby, An Empirical Study: Adding Voice Input to a Graphical Editor, Journal of the American Voice Input/Output Society, 9:2, July, 1991.",
      "doi": ""
    },
    {
      "text": "Randy Pausch and Ronald D. Williams, Tailor: Creating Custom User interfaces Based on Gesture, ACM UIST '90: Third Annual Symposium on User Interface Software and Technology, September, 1990, pp. 123- 134.  ",
      "doi": "10.1145/97924.97939"
    },
    {
      "text": "Randy Pausch and John Detmcr, Node Popularity as a Hypertext Browsing Aid, Electronic Publishing: Original Dissemination and Design, 3:4, December 1990, pp. 3- 10. ",
      "doi": "10.5555/119085.119088"
    },
    {
      "text": "Randy Pausch and Rich Gossweilcr, UserVerse: Application-Independent Object Selection From Inaccurate Multi-Modal Input, Multimedia and Multimodal User Interface Design, edited by Meera Blattner and Roger Dannenberg. Addison-Wesley, 1991. (to appear.)",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Pramod Dwivedi, and Allan Christian Long, Jr., A Low Cost Stereographic Head-mounted Display, SPIE/SPSE Symposium of Electronic Imaging Science and Technology, February 26, 1991.",
      "doi": ""
    }
  ]
}