{
  "doi": "10.1145/142750.142818",
  "title": "A performance model of system delay and user strategy selection",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "295-305",
  "year": 1992,
  "badges": [],
  "abstract": "This study lays the ground work for a predictive, zero-parameter engineering model that characterizes the relationship between system delay and user performance. This study specifically investigates how system delays affects a user's selection of task strategy. Strategy selection is hypothesized to be based on a cost function combining two factors: (1) the effort required to synchronize input system availability and (2) the accuracy level afforded. Results indicate that users, seeking to minimize effort and maximize accuracy, choose among three strategies – automatic performance, pacing, and monitoring. These findings provide a systematic account of the influence of system delay on user performance, based on adaptive strategy choice drive by cost.",
  "authors": [
    {
      "name": "Steven L. Teal",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100604907",
      "orcid": "missing"
    },
    {
      "name": "Alexander I. Rudnicky",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100553496/rel-imgonly/img_6400.jpg",
      "acmid": "81100553496",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barber, R. E., &amp; Lucas, H. C., Jr. (1983). System response time, operator productivity, and job satisfaction. Communications of the ACM, 26(11), 972-986.]]  ",
      "doi": "10.1145/182.358464"
    },
    {
      "text": "Bergman, H., Brinkman, A., &amp; Koelega, H. S. (1981). System response time and problem solving behavior. Proceedings of the 25th Annual Meeting of the Human Factors Society, 749-753.]]",
      "doi": ""
    },
    {
      "text": "Boies, S. J. (1974). User behavior on an interactive computer system. IBM Systems Journal, 13(1), 2-18.]]",
      "doi": "10.1147/sj.131.0002"
    },
    {
      "text": "Butler, T. W. (1983). Computer response time and user performance. Proceedings of the Annual Meeting of the ACM SIGCHI (SIGCHI'83), 58-62.]]  ",
      "doi": "10.1145/800045.801581"
    },
    {
      "text": "Dannenbring, G. L. (1983). The effect of computer response time on user performance and satisfaction: A preliminary investigation. Behavior Research Methods &amp; Instrumentation, 15(2), 213-216.]]",
      "doi": ""
    },
    {
      "text": "Dannenbring, G. L. (1984). System response time and user performance. IEEE Transactions on Systems, Man, and Cybernetics, SMC-14(3), 473-478.]]",
      "doi": ""
    },
    {
      "text": "Goodman, T. J., &amp; Spence, R. (1981). The effect of computer system response time variability on interactive graphical problem solving. IEEE Transactions on Systems, Man, and Cybernetics, SMC-11(3), 207-216.]]",
      "doi": ""
    },
    {
      "text": "Grossberg, M., Wiesen, R. A., &amp; Yntema, D. B. (1976). An experiment on problem solving with delayed computer responses. IEEE Transactions on Systems, Man, and Cybernetics, SMC-6(3), 219-222.]]",
      "doi": ""
    },
    {
      "text": "Johnson, E. J., &amp; Payne, J. W. (1985). Effort and accuracy in choice. Management Science, 31 (4), 395-414.]]",
      "doi": "10.1287/mnsc.31.4.395"
    },
    {
      "text": "Kleinmuntz, D. N., &amp; Schkade, D. A. (1989). The cognitive implications of infom~ation displays in computer-supported decision making (Working Paper 88/89- 4-11). Austin, TX: University of Texas at Austin, Graduate School of Business.]]",
      "doi": ""
    },
    {
      "text": "Kosmatka, L. J. (1984). A user challenges the value of subsecond response time. Computerworld, 18(24), ID 1-8.]]",
      "doi": ""
    },
    {
      "text": "Kuhmann, W. (1989). Experimental investigation of stress-inducing properties of system response times. Ergonomics, 32(3), 271-280.]]",
      "doi": ""
    },
    {
      "text": "Lambert, G. N. (1984). A comparative study of system response time on program developer productivity. IBM Systems Journal, 23(1), 36-43.]]",
      "doi": "10.1147/sj.231.0036"
    },
    {
      "text": "Martin, G. L., &amp; Corl, K. G. (1986). System response time effects on user productivity. Behaviour and Information Technology, 5(1), 3-13.]]",
      "doi": ""
    },
    {
      "text": "Miller, R. B. (1968). Response time in man-computer conversational transactions. Proceedings of the AFIPS Fall Joint Computer Conference, 33, 267-277.]]",
      "doi": "10.1145/1476589.1476628"
    },
    {
      "text": "N~afit~en, R., Muranen, V., &amp; Merisalo, A. (1974). Timing of expectancy peak in simple reaction time situation. Acta Psychologica, 38(6), 461-470.]]",
      "doi": ""
    },
    {
      "text": "Pachella, R. G. (1974). The interpretation of reaction time in information-processing research. In B. H. Kantowitz (Ed.), Human information processing: Tutorials in performance and cognition (pp. 41-82). Hillsdale, NJ: Lawrence ~lbaum Associates.]]",
      "doi": ""
    },
    {
      "text": "Rudnicky, A. I., &amp; Quirin, J. L. (1990). Subjective re. action to system response delay: A pilot study. Unpublished manuscript, Carnegie Mellon University, School of Computer Science, Pittsburgh.]]",
      "doi": ""
    },
    {
      "text": "Rushinek, A., &amp; Rushinek, S. F. (1986). What makes users happy? Communications of the ACM, 29(7), pp. 594-598.]]  ",
      "doi": "10.1145/6138.6140"
    },
    {
      "text": "Sherwood, B. A., &amp; Sherwood, J. N. (1988). The cT Language. Pittsburgh: Carnegie Mellon University.]]",
      "doi": ""
    },
    {
      "text": "Siegler, R. S., &amp; Jenkins, E. (1989). How children discover new strategies. Hillsdale, NJ: Lawrence Erlbaum Associates.]]",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. (1987). Response time and display rate. Designing the user interface: Strategies for effective human-computer interaction (pp. 272-309). Reading, MA: Addison-Wesley.]] ",
      "doi": "10.5555/523237"
    },
    {
      "text": "Shneiderman, B. (1991). Human values and the future of technology: A declaration of responsibility. A CM SIGCHI Bulletin, 23(i), 6- I 0.]]  ",
      "doi": "10.1145/122672.122674"
    },
    {
      "text": "Smith, D. (1983). A business case for subsecond response time: Faster is better. Computerworld, 17(16), ID 1-11.]]",
      "doi": ""
    },
    {
      "text": "Tlaadhani, A. J. (1981). Interactive user productivity. IBM Systems Journal, 20(4), 407-423.]]",
      "doi": "10.1147/sj.204.0407"
    },
    {
      "text": "Wickens, C. D. (1984). Engineering psychology and human performance. Glenview, IL: Scott, Foresman and Company.]]",
      "doi": ""
    }
  ]
}