{
  "doi": "10.1145/142750.142989",
  "title": "Integrating human factors on a large scale: product usability champions",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "565-570",
  "year": 1992,
  "badges": [],
  "abstract": "This paper describes how a software development division in a large corporate environment found a creative way to integrate human factors techniques into their development processes. It discusses the limitations of a single Human Factors Engineer, the needs of a typical engineer on a software project, and how these limitations and needs produced the Product Usability Champion Program. Product Usability Champions are representatives from each software project in the division who act as usability watchdogs for their respective projects. The Human Factors Engineer's responsibility is to provide support to these Champions. This support includes access to a Usability Lab, technical advice, references, consulting, classroom training, hands-on training, Usability Champion program facilitation and support, and specific project team involvement. This paper describes the program's structure, implementation, and success.",
  "tags": [
    "championing",
    "usability lab",
    "consulting",
    "usability toolkit",
    "Large-scale human factors",
    "centralized usability resources"
  ],
  "authors": [
    {
      "name": "Deborah Mrazek",
      "institution": "Hewlett-Packard Corporation, Roseville, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100437367",
      "orcid": "missing"
    },
    {
      "name": "Michael Rafeld",
      "institution": "Hewlett-Packard Corporation, Roseville, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332522247",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fisher, W. Increasing Human Factors Effectiveness Within the Organization. In Proceedings of the Human Factors Society - 33rd Amaual Meeting (Denver, Colo., October 16-20). Human Factors Society, Santa Monica, Calif., 1989, pp. 460-461.",
      "doi": ""
    },
    {
      "text": "Fisher, W. Increasing Human Factors Effectiveness in Product Design. In Proceedings of the Human Factors Society - 35th Annual Meeting (San Francisco, Calif., September 2-6). Human Factors Society, Santa Monica, Calif., 1991, pp. 471-475.",
      "doi": ""
    },
    {
      "text": "Grudin, J., and Poltrock, S.E. User interface design in large corporations: Coordination and communication across disciplines. In Proceedings CHI '89 Human Factors in Computing Systems. ACM, New York, 1981, pp. 197-203.  ",
      "doi": "10.1145/67449.67489"
    },
    {
      "text": "Hoffman, M. Advanced Product Development Through Market Participation. In Proceedings of the Human Factors Society - 33rd Annual Meeting (Denver, Colo., October 16-20). Human Factors Society, Santa Monica, Calif., 1989, pp. 461.",
      "doi": ""
    },
    {
      "text": "Norback, J. The Complete Computer Career Guide. Tab Books, Blue Ridge Summitt, Penn., 1987. ",
      "doi": "10.5555/32203"
    },
    {
      "text": "Thomas, J. Human Factors in IBM. In Proceedings of the Human Factors Society- 29th Annual Meeting. Human Factors Society, Santa Monica, Calif., 1985, pp. 611-614.",
      "doi": ""
    },
    {
      "text": "tynan, P. Human Factors and Time-based Competition. In Proceedings of the Human Factors Society- 33rd Annual Meeting (Denver, Colo., October 16-20). Human Factors Society, Santa Monica, Calif., 1989, pp. 462-463.",
      "doi": ""
    }
  ]
}