{
  "doi": "10.1145/142750.142759",
  "title": "System ergonomics and human-computer interaction at SIEMENS corporate research and development",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "65-66",
  "year": 1992,
  "badges": [],
  "abstract": "No abstract available.",
  "authors": [
    {
      "name": "H. Raffler",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142813",
      "orcid": "missing"
    },
    {
      "name": "M. Schneider-Hufschmidt",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100405556",
      "orcid": "missing"
    },
    {
      "name": "T. Kühme",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100087159",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Grollmann and C. Rumpf: Some Comments on the Future of User Interface Tools, In: D. A. Duce et al. (Eds.): User Interface Management and Design. Proceedings of the Workshop on User Interface Managemen: Systems and Environments, Lisbon, Portugal, 1990, Spri ager Verlag, pp 71 -87. ",
      "doi": "10.5555/134711.134736"
    },
    {
      "text": "U. Harke, M. Nlem011er and K. Zttnkler: Towards a Multi- Media System: Integrating Computer Animation and Speech-Dialog Interface, Proceedings of the MULTIME- DIA '90, 3rd IEE ComSoc International Workshop in Multimedia, Bordeaux, 1990.",
      "doi": ""
    },
    {
      "text": "H. HOge: SPICOS H- A Speech Understanding Dialogue System, Proceedings of tl~e ICSLP '90, Kobe, Japan, 1990",
      "doi": ""
    },
    {
      "text": "Th. Ktihrne, G. Homung and P. Witschital: Conceptual models in the design process of direct manipulation user interfaces. In: Proceedings of HCI International '91, Stuttgart, FRG, Sep. 1991, Elsevier, Amsterdam, 1991.",
      "doi": ""
    },
    {
      "text": "G. Niedermair, M. Streit and H. Tropf: Linguistic Processing related to Speech Understanding in Spicos H, Speech Communication 9 (1990), pp 565-585.  ",
      "doi": "10.1016/0167-6393%2890%2990031-4"
    },
    {
      "text": "M. Niem6ller and U. Leiner: Simulation of Motion Dynamics: An Approximative Approach to Motion Specification in Computer Animation, Proeeoding~ of Con Lputer Graphie~ 90, London, 1990, pp 229-240.",
      "doi": ""
    },
    {
      "text": "M. Schneider-Hufschmidt: Designing User Interfaces by Direct Composition - Prototyping Appearance and Behavior of User Interfaces, to appear in the proceedings of the NATO-Workshop on User-centered Requirements for Software Engineering Environments, Chateatt Bonas, France, September 1991.",
      "doi": ""
    },
    {
      "text": "P. Witschital: Why we need \"composable\" user h~terfaces. hi: D.G. Bouwhuis (Ed.): Cognitive Modeling &amp; htteractive Environments, NATO ASI, Series F, Sponger Verlag, Berlin, 1991.",
      "doi": ""
    }
  ]
}