{
  "doi": "10.1145/142750.142873",
  "title": "Comparison of empirical testing and walkthrough methods in user interface evaluation",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "397-404",
  "year": 1992,
  "badges": [],
  "abstract": "We investigated the relative effectiveness of empirical usability testing and individual and team walkthrough methods in identifying usability problems in two graphical user interface office systems. The findings were replicated across the two systems and show that the empirical testing condition identified the largest number of problems, and identified a significant number of relatively severe problems that were missed by the walkthrough conditions. Team walkthroughs achieved better results than individual walkthroughs in some areas. About a third of the significant usability problems identified were common across all methods. Cost-effectiveness data show that empirical testing required the same or less time to identify each problem when compared to walkthroughs.",
  "tags": [
    "walkthroughs",
    "problem severity",
    "cost-effectiveness",
    "empirical testing",
    "scenarios"
  ],
  "authors": [
    {
      "name": "Claire-Marie Karat",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332507969",
      "orcid": "missing"
    },
    {
      "name": "Robert Campbell",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332492056",
      "orcid": "missing"
    },
    {
      "name": "Tarra Fiegel",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332498694",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bias, R.G. Walkthroughs: Efficient collaborative testing. I EEE Software, 8, 5, 1991, pp. 94-95.]]  ",
      "doi": "10.1109/52.84220"
    },
    {
      "text": "Bellotti, V. Implications of current design practice for the use of HCI techniques. In Jones, D.M. and Winder, R., (Eds.), eeople and Computers IV. Cambridge University Press, Cambridge, 1988, pp. 13-34.]] ",
      "doi": "10.5555/54675.54677"
    },
    {
      "text": "Carroll, J., Smith-Kerker, P.L., Ford, J.R., and Mazur- Rimetz, S.A. The minimal manual. Human-Computer Interaction, 3, 1987-88, pp. 123-153.]]  ",
      "doi": "10.1145/49103.1046494"
    },
    {
      "text": "Desurvire, H., Lawrence, D., and Atwood, M. Empiricism versus judgment: Comparing user interface evaluation methods on a new telephone-based interface. SIGCHI Bulletin, 23, 4, pp. 58-59.]]  ",
      "doi": "10.1145/126729.1056062"
    },
    {
      "text": "Gould, J.D., and Lewis, C. Designing for usability: Key principles and what designers think. Communications of the ACM, 28, 1985, pp. 300-311.]]  ",
      "doi": "10.1145/3166.3170"
    },
    {
      "text": "Grudin, J. and Poltrock, S.E. User interface design in large corporations: Coordination and communication across disciplines. In Proceedings of CHI'89 (Austin, TX, April 30-May 4, 1989), ACM, New York, pp. 197-203.]]  ",
      "doi": "10.1145/67449.67489"
    },
    {
      "text": "Hackman, J.R., and Morris, C.G. Group tasks, group interaction process, and group performance effectiveness: A review and proposed integration. In Berkowitz, L., (Ed.), Advances in Experimental Social Psychology, V ol. 8, Academic Press, New York, 1975.]]",
      "doi": ""
    },
    {
      "text": "International Business Machines Corporation. Systems Ap. plication Architecture, Common User Access, Guide to User Interface Design, (SC34-4289), 1991.]]",
      "doi": ""
    },
    {
      "text": "International Standards Organization. Working Paper of ISO 9241 Part 10, 'Dialogue Principles, Version 2 , ISO}TC 159/SC4}WG5 N155, 1990.]]",
      "doi": ""
    },
    {
      "text": "Jeffries, R.J., Miller, J.R., Wharton, C., and Uyeda, K.M. User interface evaluation in the real world: A comparison of four techniques. In Proceedings of CHI'91, (New Orleans, LA, April 28-May 3, 199I), ACM, New York, pp. 119-I24.]]  ",
      "doi": "10.1145/108844.108862"
    },
    {
      "text": "Jeffries, R. J. Personal communication, Sept. 1991.]]",
      "doi": ""
    },
    {
      "text": "Jorgensen, A.K. Thinking-aloud in user interface design: A method promoting cognitive ergonomics. Ergonomics, 33, 4, 1990, pp. 501-507.]]",
      "doi": ""
    },
    {
      "text": "Karat, C. Cost-justifying human factors support on development projects. Human Factors Society Bulletin, 35, 3, 1992, pp. 1-4.]]",
      "doi": ""
    },
    {
      "text": "Karat, C. Cost-benefit and business case analysis of usability engineering. ACM SIGCIll Conference on Human Factors in Computing Systems, New Orleans, LA, April 28-May2, Tutorial Notes.]]",
      "doi": ""
    },
    {
      "text": "Karat, C. Cost-benefit analysis of usability engineering techniques. In Proceedings of the HFS Society, (Orlando, FL, Oct., 1990), pp. 839-843.]]",
      "doi": ""
    },
    {
      "text": "Lewis, C., Poison, P., Wharton, C., and Rieman, J. Testing a walkthrough methodology for theory-based design of walkup-and-use interfaces. In Proceedings of CHI'90 (Seattle, WA, April 1-5, 1990), ACM, New York, pp. 235-2,12.]]  ",
      "doi": "10.1145/97243.97279"
    },
    {
      "text": "McGrath, J.E. Groups: interaction and Performance Prentice- Hall, Englewood Cliffs, N.J., 1984.]]",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Finding usability problems through heuristic evaluation. In Proceedings of CHI'92 (Monterey, CA, May 3-7, 1992), ACM, New York.]]  ",
      "doi": "10.1145/142750.142834"
    },
    {
      "text": "Nielsen, J. Usability engineering at a discount. In Salvendy, G., and Smith, M.J., (Eds.), Designing and Using Ituman- Computer interfaces and Knowledge-Based Systems. Elsevier Science Pulishers, Amsterdam, 1989, pp. 394-401.]] ",
      "doi": "10.5555/92449.92499"
    },
    {
      "text": "Nielsen, J. and Molich, R. Heuristic evaluation of user interfaces, in Proceedings of CHI'90, (Seattle, WA, April 1-5, 1990), ACM, New York, pp. 249-256.]]  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Whitten, N. Managing Software Development Projects: Formula for Success. Wiley and Sons, New York, 1990, pp. 203-223.]] ",
      "doi": "10.5555/82571"
    },
    {
      "text": "Wharton, C., Bradford, J., jeffries, R., and Franzke, M. Applying cognitive walkthroughs to more complex user interfaces: Experiences, issues, and recommendations. In Proceedings of CIti'92 (Monterey, CA, May 3-7, 1992), ACM, New York.]]  ",
      "doi": "10.1145/142750.142864"
    },
    {
      "text": "Wright, P.C., and Monk, A.F. The use of think-aloud evaluation methods in design.S1GCHI Bulletin, 23, 1, 1991, pp. 55-57.]]  ",
      "doi": "10.1145/122672.122685"
    }
  ]
}