{
  "doi": "10.1145/142750.142828",
  "title": "The abstraction-link-view paradigm: using constraints to connect user interfaces to applications",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "335-342",
  "year": 1992,
  "badges": [],
  "abstract": "The goal of the RENDEZVOUS project is to build interactive systems that are used by multiple users from multiple workstations, simultaneously. This goal caused us to choose an architecture that requires a clean run-time separation of user interfaces from applications. Such a separation  has long been state goal of UIMS researchers, but it is difficult to achieve. A key technical reason for the difficulty is that modern direct manipulation interfaces require extensive communication between the user interface and the application to provide semantic feedback. We discuss several communications mechanisms that have been used in the past, and present our approach — the Abstraction-Link-View paradigm. Links are objects whose sole responsibility is to facilitate communication between the abstraction objects (application) and the view objects (user interfaces). The Abstraction-Link-View paradigm relies on concurrency and a fast but powerful constraint system.",
  "authors": [
    {
      "name": "Ralph D. Hill",
      "institution": "Bellcore, Morristown, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100454732",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Borenstein, N. S., Multimedia Applications Development with the Andrew Toolkit, Prentice Hall, Englewood Cliffs, New Jersey, 1990. ",
      "doi": "10.5555/83808"
    },
    {
      "text": "Crowley, T., Milazzo, P., Baker, E., Forsdick, H. and Tomlinson, R., MMConf: An Infrastructure for Building Shared Multimedia Applications, Proceedings of CSCW'90, 1990, 329-342.  ",
      "doi": "10.1145/99332.99365"
    },
    {
      "text": "Dance, J. R., Granor, T. E., Hill, R. D., Hudson, S. E., Meads, J., Myers, B. A. and Schulert, A., The Run-time Structure of UiMS-Supported Applications, Computer Graphics 21,2 (1987), 97- 101.  ",
      "doi": "10.1145/24919.24923"
    },
    {
      "text": "Forsdick, H., Exploration into Real-time Multimedia Conferencing, Proceedings of the Second International Symposium on Computer Message Systems, 1985, 299-315.",
      "doi": ""
    },
    {
      "text": "Freeman-Benson, B. N., Maloney, J. and Boming, A., An Incremental Constraint Solver, Communications of the ACM 33,1 (1990), 54-63.  ",
      "doi": "10.1145/76372.77531"
    },
    {
      "text": "Green, M., Report on Dialogue Specification Tools, in User Interface Management Systems, G. Pfaff (editor), Springer-Verlag, Berlin, 1985, 9-20.",
      "doi": ""
    },
    {
      "text": "Hartson, H. R. and Hix, D., Human-Computer Interface Development: Concepts and Systems for Its Management, ACM Computing Surveys 21,1 (1989), 5-92.  ",
      "doi": "10.1145/62029.62031"
    },
    {
      "text": "Hartson, R., User-Interface Management Control and Communication, IEEE Software 6,1 (1989), 62-70.  ",
      "doi": "10.1109/52.16903"
    },
    {
      "text": "Henry, T. R. and Hudson, S. E., Using Active Data in a UIMS, Proceedings of the ACM SIGGRAPH Symposium on User Interface Software, 1988, 167- 178.  ",
      "doi": "10.1145/62402.62429"
    },
    {
      "text": "Herrmann, M. and Hill, R., Abstraction and Declarativeness in User interface Development Systems--- The Methodological Basis of the Cq~nposite Object Architecture, Proceedings of the XI'\" Worm Computer Congress, 1989.",
      "doi": ""
    },
    {
      "text": "Hill, R. D., Supporting Concurrency, Communication and Synchronization in Human- Computer Interaction --- the Sassafras UIMS, ACM Trans. on Graphics 5,3 (1986), 179-210.  ",
      "doi": "10.1145/24054.24055"
    },
    {
      "text": "Hill, R. D., A 2-D Graphics System for Multi-User interactive Graphics Based on Objects and Constraints, in Advances in Object Oriented Graphics 1, E. Blake and P. Wisskirchen (editors), Springer-Verlag, Berlin, 1991, 67-91.",
      "doi": ""
    },
    {
      "text": "Krasner, G. E. and Pope, S. T., A Cookbook for Using the Model-View-Controller User Interface Paradigm in Smalltalk-80, Journal of Object- Oriented Programming 1,3 (1988), 26-49. ",
      "doi": "10.5555/50757.50759"
    },
    {
      "text": "Linton, M., Vlissides, J. M. and Calder, P. R., Composing User Interfaces with InterViews, IEEE Computer 22,2 (1989), 8-22.  ",
      "doi": "10.1109/2.19829"
    },
    {
      "text": "Myers, B. A., Creating User Interfaces by Demonstration, Academic Press, Boston, 1988. ",
      "doi": "10.5555/43392"
    },
    {
      "text": "Myers, B. A. and al., Garnet: Comprehensive Support for Graphical, Highly Interactive User Interfaces, IEEE Computer 23,11 (1990), 71-85.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "Nye, A. and O'Reilly, T., X Toolldt Intrinsics Programming Manual, 2Ed., O'Reilly &amp; Associates, Inc., Sebastopol, California, 1990. ",
      "doi": "10.5555/103665"
    },
    {
      "text": "Olsen, D. R., Dempsey, E. P. and Rogge, R., Input/Output Linkage in a User Interface Management System, Computer Graphics 19,3 (1985), 191-197.  ",
      "doi": "10.1145/325165.325236"
    },
    {
      "text": "Patterson, J. F., Hill, R. D., Rohall, S. L. and Meeks, W. S., Rendezvous: An architecture for synchronous multi-user applications, Proceedings of CSCW'90, 1990, 317-328.  ",
      "doi": "10.1145/99332.99364"
    },
    {
      "text": "Rohall, S. L., Patterson, J. F. and Hill, R. D., Go Fish! A Multi-User Game in the Rendezvous System, Video tape presented as part of the formal video program at CHI'92, 1992.",
      "doi": ""
    },
    {
      "text": "Smith, R. B., O'Shea, T., O'Malley, C., Scanlon, E. and Taylor, J., Preliminary experiments with a distributed, multi-media, problem solving environment, Proc. 1989 European Conference on Computer Supported Cooperative Work, 1989.",
      "doi": ""
    },
    {
      "text": "Stefik, M., Foster, G., Bobrow, D. G., Kahn, K., Lanning, S. and Suchman, L. Beyond the Chalkboard: Computer Support for Collaboration and Problem Solving in Meetings, Communications of the ACM 30,1 (1987), 32-47.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Thomas, J. J. and Hamlin, G., Graphical Input Interaction Technique Workshop Summary, Computer Graphics 17,1 (1983), 5-30.  ",
      "doi": "10.1145/988584.988585"
    },
    {
      "text": "Zanden, B. V., Myers, B. A., Giuse, D. and Szekely, P., The Importance of Pointer Variables in Constraint Models, Proc. of UIST'91, 1991, 155- 164.  ",
      "doi": "10.1145/120782.120799"
    }
  ]
}