{
  "doi": "10.1145/142750.142767",
  "title": "Gardeners and gurus: patterns of cooperation among CAD users",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "107-117",
  "year": 1992,
  "badges": [],
  "abstract": "We studied CAD system users to find out how they use the sophisticated customization and extension facilities offered by many CAD products. We found that users of varying levels of expertise collaborate to customize their CAD environments and to create programmatic extensions to their applications. Within a group of users, there is at least one local expert who provides support for other users. We call this person a local developer. The local developer is a fellow domain expert, not a professional programmer, outside technical consultant or MIS staff member. We found that in some CAD environments the support role has been formalized so that local developers are given official recognition, and time and resources to pursue local developer activities. In general, this formalization of the local developer role appears successful. We discuss the implications of our findings for work practices and for software design.",
  "authors": [
    {
      "name": "Michelle Gantt",
      "institution": "Hewlett-Packard Laboratories, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100472609",
      "orcid": "missing"
    },
    {
      "name": "Bonnie A. Nardi",
      "institution": "Hewlett-Packard Laboratories, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100150025",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Badham, R. Computer-aided design, work organization and the integrated factory. IEEE Transactions on Engineering Management 36, 3 (1989), 216-226.",
      "doi": ""
    },
    {
      "text": "Berardinis, L., Dibble, M., Dvorak, P., and Rouse, N. CAD/CAM industry report. Machine Design (May 23, 1991), 47-58.",
      "doi": ""
    },
    {
      "text": "Bowen, W. The puny payoff from office computers. In Computers in the Human Context. T. Forester, Ed. Basil Blackwell, New York, 1989, 267-271. ",
      "doi": "10.5555/79096.79133"
    },
    {
      "text": "Brooks, L., and Wells, C. Role conflict in design supervision. 1EEE Transactions on Engineering Management 36, 4 (1989), 271-281.",
      "doi": ""
    },
    {
      "text": "Clement, A. Cooperative support for computer work: A social perspective on the empowering of end users. Proceedings CSCW'90. (Los Angeles, 5-7 October, 1990), 223-236.  ",
      "doi": "10.1145/99332.99357"
    },
    {
      "text": "Cuomo, D., and Sharit, J. A study of human performance of computer-aided architectural design. International Journal of Human-Computer Interaction 1, 1 (1989), 69-107.",
      "doi": ""
    },
    {
      "text": "Dillon, A., and Sweeney, M. The application of cognitive psychology to CAD. People and Computers IV.\" Proceedings of the Fourth Conference of the British Computer Society Human-Computer Interaction Specialist Group. (University of Manchester, 5-9 September, 1988), 477-488. ",
      "doi": "10.5555/54675.54704"
    },
    {
      "text": "DiSessa, A. A principled design for an integrated computational environment. Human-Computer Interaction 1, (1985), 1-47.",
      "doi": "10.1207/s15327051hci0101_1"
    },
    {
      "text": "Encamacao, J., and Schlechtendahl, E. Computer AidedDesign: Fundamentals and System Architectures. Springer-Verlag, Berlin, 1983. ",
      "doi": "10.5555/95335"
    },
    {
      "text": "Forester, T. Computers in the Human Context. Basil Blackwell, New York, 1989.",
      "doi": "10.5555/534250"
    },
    {
      "text": "Foundyller, C. CAD~CAM, CAE: The Contemporary Technology. Daratech Associates, Cambridge, Mass., 1984.",
      "doi": ""
    },
    {
      "text": "Franke, R. Technological revolution and productivity decline: The case of US banks. In Computers in the Human Context. T. Forester, Ed. Basil BlackweU, New York, 1989, 281-290. ",
      "doi": "10.5555/79096.79135"
    },
    {
      "text": "Graham, B. Applying software tools to enhance engineering group productivity. Proceedings of the Fifth Annual Applied Power Electronics Conference and Exposition. (Los Angeles, 11-16 March, 1990), 612-618.",
      "doi": ""
    },
    {
      "text": "Krouse, J., Mills, R., Beckert, B., and Dvorak, P. CAD/CAM planning: 1990 - Managing people and the technology. Industry Week 239, 13 (1990), CC4-CC10.",
      "doi": ""
    },
    {
      "text": "Mackay, W. (1990). Patterns of sharing customizable software. Proceedings CSCW'90. (Los Angeles, 7-10 October, 1990), 209-221.  ",
      "doi": "10.1145/99332.99356"
    },
    {
      "text": "MacLean, A., Carter, K., Lovstrand, L., and Moran, T. User- tail orable systems: Pressing the issues with buttons. Proceedings, CHI'90. (Seattle, 1-5 April, 1990), 175-182.  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "Majchrzak, A., Chang, T., Barfield, W., Eberts, R., and Salvendy, G. Human Aspects of Computer-Aided Design. Taylor and Francis, Philadelphia, 1987. ",
      "doi": "10.5555/77005"
    },
    {
      "text": "Manske, F., and Wolf, H. Design work in change: Social conditions and results of CAD use in mechanical engineering. IEEE Transactions on Engineering Management 36, 4 (1989), 282-292.",
      "doi": ""
    },
    {
      "text": "Maulsby, D., Witten, I., and Kittlitz, K. Metamouse: Specifying graphical procedures by example. Computer Graphics 23 (1989), 127-136.  ",
      "doi": "10.1145/74334.74346"
    },
    {
      "text": "Mayer, T. Social impacts of computer-aided architectural design. Design Studies 7, 4 (1986), 178-184.",
      "doi": ""
    },
    {
      "text": "Myers, B. Text formatting by demonstration. Proceedings CH1'91. (New Orleans, 27 April- 2 May, 199 I), 251-256.  ",
      "doi": "10.1145/108844.108904"
    },
    {
      "text": "Nardi, B., and Miller, J. The spreadsheet interface: A basis for end user programming. Proceedings Interact'90. (Cambridge, England, 27-31 August, 1990), 977-983. ",
      "doi": "10.5555/647402.725609"
    },
    {
      "text": "Nardi, B., and Miller, J. Twinkling lights and nested loops: Distributed problem solving and spreadsheet development. International Journal of Man-Machine Studies 34, (1991), 161-184. (Reprinted in Computer Supported Cooperative Work and Groupware, S. Greenberg, ed. Academic Press, London, 1991.)  ",
      "doi": "10.1016/0020-7373%2891%2990040-E"
    },
    {
      "text": "Panko, R. End User Computing: Management, Applications, and Technology. John WHey and Sons, New York, 1988. ",
      "doi": "10.5555/43411"
    },
    {
      "text": "Perzanowski, P. Scheduling CAD productivity. AACE Transactions (1991), 1.1.1-I.1.5.",
      "doi": ""
    },
    {
      "text": "Petre, M., and Green, T.R.G. Requirements of graphical notations for professional users: Electronics CAD systems as a case study. In press. Le Travail Humain (1991).",
      "doi": ""
    },
    {
      "text": "Pikaar, R. Situation analysis of design tasks for CAD systems. Behaviour and Information Technology 8, 3 (1989), 191-206.",
      "doi": ""
    },
    {
      "text": "Raths, D. Nurturing the flock: As the PC population grows, so does the burden on support staff. InfoWorld, 19 August, 1991, 38-40.",
      "doi": ""
    },
    {
      "text": "Sebborn, M, Customising of a two-dimensional CAD system to service the needs of a small high technology company. Computer-Aided Engineering Journal (February, 1989), 13-15.  ",
      "doi": "10.1049/cae.1989.0004"
    },
    {
      "text": "Shaiken, H. The automated factory: Vision and reality. In Computers in the Human Context. T. Forester, Ed. Basil Blackwell, New York, 1989, 291-300. ",
      "doi": "10.5555/79096.79136"
    },
    {
      "text": "Sinclair, M., Siemieniuch, C., and John, P. A usercentered approach to define high-level requirements for next-generation CAD systems for mechanical engineering. IEEE Transactions on Engineering Management 36, 4 (1989), 262-270.",
      "doi": ""
    },
    {
      "text": "Sutherland, I. SKETCHPAD: A Man-Machine Graphical Communication System. Proceedings of AFIPS 23, 329-346 (Detroit, May, 1963).",
      "doi": ""
    },
    {
      "text": "Ullman, D., and Dietterich, T. Mechanical design methodology: implications on future developments of computer-aided design and knowledge-based systems. Engineering with Computers 2, 1 (1987), 21-29.",
      "doi": ""
    },
    {
      "text": "Ullman, D., Wood, S., and Craig, D. The importance of drawing in the mechanical design process. Computers and Graphics 14, 2 (1990), 263-274.",
      "doi": ""
    },
    {
      "text": "Warner, T. Information technology as a competitive burden. In Computers in the Human Context. T. Forester, Ed. Basil Blackwell, New York, 1989, 273-280. ",
      "doi": "10.5555/79096.79134"
    },
    {
      "text": "Wolz, U. The impact of user modeling on text generation in task-centered settings. Proceedings Second International Conference on User Modeling (Honolulu, 29 March- 1 April, 1990).",
      "doi": ""
    }
  ]
}