{
  "doi": "10.1145/142750.143055",
  "title": "A “pile” metaphor for supporting casual organization of information",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "627-634",
  "year": 1992,
  "badges": [],
  "abstract": "A user study was conducted to investigate how people deal with the flow of information in their workspaces. Subjects reported that, in an attempt to quickly and informally manage their information, they created piles of documents. Piles were seen as complementary to the folder filing system, which was used for more formal archiving. A new desktop interface element–the pile– was developed and prototyped through an iterative process. The design includes direct manipulation techniques and support for browsing, and goes beyond physical world functionality by providing system assistance for automatic pile construction and reorganization. Preliminary user tests indicate the design is promising and raise issues that will be addressed in future work.",
  "authors": [
    {
      "name": "Richard Mander",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100182411",
      "orcid": "missing"
    },
    {
      "name": "Gitta Salomon",
      "institution": "missing",
      "img": "/do/10.1145/contrib-81408600569/rel-imgonly/gittabiopic.jpg",
      "acmid": "81408600569",
      "orcid": "missing"
    },
    {
      "name": "Yin Yin Wong",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536390",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple Computer, inc. Human Interface Guidelines: The Apple Desktop Interface. Addison-Wesley Publishing Company, Inc., Reading, MA, 1987.]] ",
      "doi": "10.5555/1207530"
    },
    {
      "text": "Apple Computer, Inc. Inside Macintosh, Volume VI. Addison-Wesley Publishing Company, Inc., Reading, MA, 1991.]] ",
      "doi": "10.5555/600615"
    },
    {
      "text": "Cole, I. Human aspects of office filing: Implications for the electronic office Proceedings of the Human Factors Society, 26th Annual Meeting, Seattle, Washington. 1982.]]",
      "doi": ""
    },
    {
      "text": "Gomoll, K. Some Techniques for Observing Users The Art of Human-Computer Interface Design (ed. Brenda Laurel) Addison-Wesley Publishing Company, Inc., Reading, MA. 1990. pp. 85-90.]]",
      "doi": ""
    },
    {
      "text": "Ericsson, K.A. and Simon, H. A. Protocol analysis. Cambridge, Massachusetts: MIT Press. 1984.]]",
      "doi": ""
    },
    {
      "text": "Lansdale, M. The psychology of personal information management. Applied Ergonomics, 55, (1988), pp. 55- 66.]]",
      "doi": ""
    },
    {
      "text": "MacLean, A., Carter, K., Lovstrand, L. and Moran, T. User-Tailorable Systems: Pressing the Issues with Buttons. In Proceedings of CHI 1990 (Seattle, Washington, April 1-5, 1990) ACM, New York, 1990. pp. 175-182.]]  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "MacroMind, Inc. DirectorTM 2.0. April 1990.]]",
      "doi": ""
    },
    {
      "text": "Malone, T. W. How do People Organize Their Desks? Implications for the Design of Office Information Systems. ACM Transactions on Office Information Systems, 1,1, (January 1983), pp. 99-112.]]  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Malone, T. W., Grant, K.R., Turbak, F.A., Brobst, S.A. and Cohen, M.D. Intelligent Information-Sharing Systems. Communications of the ACM, 30, 5~ (May 1987), pp. 390-402.]]  ",
      "doi": "10.1145/22899.22903"
    },
    {
      "text": "Miller, P., Tetelbaum, S. and Webb, K. BUSINESS - an end-user oriented application development language. SIGMOD Record, 12, 1, (October 1981), pp. 38-69]]  ",
      "doi": "10.1145/984497.984502"
    },
    {
      "text": "Nielsen, J. Usability Engineering at a Discount. In G. Salvendy and M.J. Smith (Eds.), Designing and Using Human-Computer Interfaces and Knowledge Based Systems. Amsterdam: Elsevier. 1989.]] ",
      "doi": "10.5555/92449.92499"
    },
    {
      "text": "van Rijsbergen, C.J. Information Retrieval. (2nd. Ed.) Butterworths, London, England. 1983.]] ",
      "doi": "10.5555/539927"
    }
  ]
}