{
  "doi": "10.1145/142750.142810",
  "title": "Selectors: going beyond user-interface widgets",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "273-279",
  "year": 1992,
  "badges": [],
  "abstract": "Most UI toolkits and UIMSs make use of widgets, e.g., buttons, text fields, sliders, menus. Designers construct user interfaces by choosing and laying out widgets, then connectimg them to application semantics. This approach has four problems. First, most widgets are too low-level; constructing interfaces from them takes too much work. Second, working with widgets focuses attention on appearance and layout issues, rather than on more important semantic design issues. Third, designers can easily make poor widget choices, yielding poor interfaces. Fourth, widgets do not mesh well with application semantics; they know nothing about the variables they control. We are developing an application construction environment in which designers and implementers work with semantic-based controls called Selectors rather than with widgets. Selectors are classified according to their interface semantics (e.g., mutually-exclusive choice), rather than their appearance. Each type of Selector can be presented in a variety of ways; this may be chosen semi-automatically. Selectors mesh well with application semantics: their values are application data-types and their views determine how to present valid values automatically.",
  "authors": [
    {
      "name": "Jeff Johnson",
      "institution": "Hewlett-Packard Laboratories, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81100452161/rel-imgonly/jeff-2006small.jpg",
      "acmid": "81100452161",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Foley, j., Gibbs, C., Kim, W.C., and Kovacevic, S. \"Knowledge-based User Interface Management System.\" Proceedings of the ACM Conference on Computer-Human Interaction, 1988, ACM Press, 67- 72.  ",
      "doi": "10.1145/57167.57178"
    },
    {
      "text": "Gould, J.D., Boies, S.J., and Lewis, C. \"Making Usable, Useful, Productivity-Enhancing Computer Applications.\" Communications of the ACM, 34(1), January, 1991, 74-85.  ",
      "doi": "10.1145/99977.99993"
    },
    {
      "text": "Johnson, J., Roberts, T., Verplank, W., Smith, D.C., Irby, C., Beard, M., Mackey, K. \"The Xerox Star: A Retrospective.\" IEEE Computer, September, 1989, 22(9), I1 - 29.  ",
      "doi": "10.1109/2.35211"
    },
    {
      "text": "Linton, M.A., Vlissides, J.M., and Calder, P.R. \"Composing User Interfaces with InterViews.\" IEEE Computer, February, 1989, 8 - 22.  ",
      "doi": "10.1109/2.19829"
    },
    {
      "text": "M yers, B.A. \"rools for Creating User Interfaces: An Intrtxlucfion and Survey.\" Technical Report CMU-CS- 88-107, 1988, CMU.",
      "doi": ""
    },
    {
      "text": "Nardi, B. and Miller, j.R. \"Twinkling Lights and Nested Loops: Distributed Problem Solving and spreadsheet Development.\" Int. J. Man-Machine Studies, 34, 1991, 161-184.  ",
      "doi": "10.1016/0020-7373%2891%2990040-E"
    },
    {
      "text": "Nardi, B. and Zarmer, C. \"Beyond Models and Metaphors: Visual Formalisms in User Interface Design.\" Proceedings of the Hawaii International Conference on System Sciences (HICSS.24), 2, 1991, IEEE Computer Society Press, 478 - 493.",
      "doi": ""
    },
    {
      "text": "Szekely, P. \"Standardizing the Interface between Applications and User Interface Management Systems.\" Proceedings of the ACM SIGGRAPH Symposium on User interface Software and Technology, ACM Press, 1989, 34-42.  ",
      "doi": "10.1145/73660.73665"
    },
    {
      "text": "Swick, R. and Weissman, T. X Toolldt Widgets - C Language X Interface, X Window System, X Version 11, Release 2, MIT Project Athena, 1988.",
      "doi": ""
    },
    {
      "text": "Vander Zanden, B. and Myers, B.A. \"Automatic, Lookand-Feel Independent Dialog Creation for Graphical User Interfaces.\" Proceedings of the ACM Conference on Computer-Human Interaction, 1990, ACM Press, 27-34.  ",
      "doi": "10.1145/97243.97248"
    },
    {
      "text": "Zarmer, C. \"ACEKit: An Application Construction Toolkit.\" lip Laboratories Technical Report HPL-91. 134, 1991.",
      "doi": ""
    },
    {
      "text": "Zarmer, C. and Johnson, J. \"User Interface Tools: Past, Present, and Future Trends.\" lip Laboratories Technical Report HPL-90-20, 1990.",
      "doi": ""
    },
    {
      "text": "Zanner, C., Nardi, B., Johnson, J., and Miller, J. \"ACE: Zen and the Art of Application Building.\" Proceedings of the Hawaii International Conference on System Sciences (HICSS-25), 2, 1992, IEEE Computer Society Press, 687-698.",
      "doi": ""
    }
  ]
}