{
  "doi": "10.1145/142750.142904",
  "title": "Designing theory-based systems: a case study",
  "published": "1992-06-01",
  "proctitle": "CHI '92: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "479-488",
  "year": 1992,
  "badges": [],
  "abstract": "In this paper, we discuss principles for designing and testing computer systems intended to support users' thinking as they perform open-ended or ill-defined tasks. We argue that such systems inherently and inevitably implement a model of users' cognitive behaviors. Making that model explicit can provide system developers with guidance in taking design decisions. However, both model and system must be tested and refined. We discuss these principles in relation to a case study in which our group developed a hypertext-based writing environment and then tested that system in a series of experimental studies of writers' strategies.",
  "tags": [
    "cognitive modes and strategies",
    "task analysis",
    "system design",
    "cognitive models",
    "user testing"
  ],
  "authors": [
    {
      "name": "John B. Smith",
      "institution": "University of North Carolina, Chapel Hill, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528115",
      "orcid": "missing"
    },
    {
      "name": "Marcy Lansman",
      "institution": "University of North Carolina, Chapel Hill, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100154971",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ausubel, D. P. (1963). The psychology of meaningful verbal learning. New York: Grune &amp; Stratton.",
      "doi": ""
    },
    {
      "text": "Bodker, Susanne (1989). A human activity approach to user interfaces. Human-Computer Interaction, 4,3,171-195.",
      "doi": "10.1207/s15327051hci0403_1"
    },
    {
      "text": "Engelbart, D. C., Watson, R. W., &amp; Norton, J. C. (1973). The augmented knowledge workshop. AFIPS conference proceedings, pp. 9-21.",
      "doi": "10.1145/1499586.1499593"
    },
    {
      "text": "Floyd, C., Wolf-Michael, M., Reisin, F-M., Schmidt, G., &amp; Wolf, G. (1989). Out of Scandinavia: Alternative approaches to software design and system development. Human-Computer Interaction, 4,4, 253-349.",
      "doi": "10.1207/s15327051hci0404_1"
    },
    {
      "text": "Hayes, J. R. &amp; Flower, L. S. (1980). identifying the organization of the writing process. In L. W. Gregg &amp; E. R. Steinberg reds.), Cognitive Processes in Writing. Hillsdale, NJ\" Lawrence Erlbaum Associates, pp. 3-30.",
      "doi": ""
    },
    {
      "text": "Kieras, D. E. (1980). Initial mention as a signal to thematic content in technical passages. Memory and Cognition, 8, 345-353.",
      "doi": ""
    },
    {
      "text": "Kintsch, W., &amp; van Dijk, T. A. (1978). Toward a model of text comprehension and production. Psychological Review, 85, 363-394.",
      "doi": ""
    },
    {
      "text": "Meyer, G. J. F., Brandt, D. M., &amp; Bluth, G. J. (1980). Use of top-level structure in text: key for reading comprehension of ninth grade students. Reading Research Quarterly, 1, 72-103.",
      "doi": ""
    },
    {
      "text": "Schwartz, M. N. K., &amp; Flammer, A. (1981). Text structure and title-effects on comprehension and recall. Journal of Verbal Learning and Verbal Behavior, 20, 61-66.",
      "doi": ""
    },
    {
      "text": "Smith, J. B., &amp; Lansman, M. L (1991). Cognitive modes and strategies for writing. Chapel Hill, NC: UNC Department of Computer Science Technical Report # TR91-047.",
      "doi": ""
    },
    {
      "text": "Smith, J. B., &amp; Smith, C. F. (1987). A strategic method for writing. Chapel Hill, NC\" UNC Department of Computer Science Technical Report # TR87-024.",
      "doi": ""
    },
    {
      "text": "Smith, J. B., Smith, D. K, &amp; Kupstas, E. (1991). Tools and techniques for automated protocol analysis. Chapel Hill, NC: UNC Department of Computer Science Technical Report # TR91-034.",
      "doi": ""
    },
    {
      "text": "Suchman, L. (1987). Plans and situated actions: The problem of human-machine communication. Cambridge: Cambridge University Press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Winograd, T., &amp; Flores, C. F. (1986). Understanding computers and cognition: A new foundation for design. Norwood, NJ: Ablex. ",
      "doi": "10.5555/576359"
    }
  ]
}