{
  "doi": "10.1145/223904.223942",
  "title": "Electronic futures markets versus floor trading: implications for interface design",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "296-303",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Satu S. Parikh",
      "institution": "Finance Department, The Wharton School of the University of Pennsylvania, 1300 Steinberg Hall, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100298886",
      "orcid": "missing"
    },
    {
      "name": "Gerald L. Lohse",
      "institution": "Operations and Information Management Department, The Wharton School of the University of Pennsylvania, 1326 Steinberg Hall, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100506802",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baker, Wayne E., The Social Structure of a National Securities Market, American Journal of Sociology, 1984. pp. 775-811.",
      "doi": ""
    },
    {
      "text": "Becker, Lopez, Berberi-Doumar, Cohn, and Adkins, Automated Securities Trading, 1992.",
      "doi": ""
    },
    {
      "text": "Black, Fischer., Toward a Fully Automated Stock Exchange, Financial Analysts Journal, 1971. pp 29- 45.",
      "doi": ""
    },
    {
      "text": "Chicago Mercantile Exchange, A World Marketplace, 1990.",
      "doi": ""
    },
    {
      "text": "Clemons E.K. and Weber B.W., London's Big Bang: a Case Study of Information Technology, Competitive Impact, and Organizational Change. Journal of Management Information Systems, 1990, 6(4), 41-60. ",
      "doi": "10.1080/07421222.1990.11517871"
    },
    {
      "text": "Corcoran, Andrea M. and Lawton, John C., Regulatory Oversight and Automated Trading Design: Elements of Consideration, The Journal of Futures Markets, 1993. Vol 13, No 2, pp. 213-222.",
      "doi": ""
    },
    {
      "text": "Diamond, Barbara and Kollar, Mark., 24-Hour Trading - The Global Network of Futures and Options Markets, New York, NY, 1989.",
      "doi": ""
    },
    {
      "text": "Display Technology: City Lights, The Economist, September 3, 1994, p.80-81",
      "doi": ""
    },
    {
      "text": "Domowitz, Ian, Automating the Price Discovery Process: Some International Comparisons and Regulatory Implications, Journal of Financial Services Research, 1992. pp. 305-326.",
      "doi": ""
    },
    {
      "text": "Domowitz, Ian, Equally Open and Competitive: Regulatory Approval of Automated Trade Execution in the Futures Markets, Journal of Futures Markets, 1993. Vol 13, No 1, pp. 93-113.",
      "doi": ""
    },
    {
      "text": "Domowitz, Ian, The Mechanics of Automated Trade Execution Systems, Journal of Financial Intermediation, 1990. pp.167-194.",
      "doi": ""
    },
    {
      "text": "Domowitz, Ian, A Taxonomy of Automated Trade Execution Systems, Journal of International Money and Finance, 1993. pp. 607-631.",
      "doi": ""
    },
    {
      "text": "The London International Financial Futures and Options Exchange, APT - A Trading System for the Future, 1994.",
      "doi": ""
    },
    {
      "text": "Melamed, Leo, The Mechanics of a Commodity Futures Exchange: A Critique of Automation of the Transaction Process. Hofstra Law Review, 1977, 6, 149-172.",
      "doi": ""
    },
    {
      "text": "Nielson, G. M., Rosenblum, L. J., Visualization Comes of Age, IEEE Computer Applications and Graphics, 11(3), p.15-19 ",
      "doi": "10.5555/616017.617653"
    },
    {
      "text": "Stoll, Hans R., Principles of Trading Market Structure, Journal of Financial Services Research, 1992. pp. 75-107.",
      "doi": ""
    }
  ]
}