{
  "doi": "10.1145/223904.223965",
  "title": "Situated facial displays: towards social interaction",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "450-455",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Akikazu Takeuchi",
      "institution": "Sony Computer Science Laboratory, Inc., 3-14-13 Higashi-Gotanda, Shinagawa-ku, Tokyo 141, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100252843",
      "orcid": "missing"
    },
    {
      "name": "Taketo Naito",
      "institution": "Computer Science Department, Keio University, 3-14-1, Hiyoshi, Kohoku-ku, Yokohama, Kanagawa 223, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100603224",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brennan, S. E. and Ohaeri, J. O. Effect of Message Style on Users' Attributions toward Agents, In CHI'94 Conference Companion Human Factors in Computing Systems (Boston, April 24-28, 1994), ACM Press, pp. 281-282.  ",
      "doi": "10.1145/259963.260492"
    },
    {
      "text": "Chovil, N. Discourse-oriented facial displays in conversation. Research on Language and Social Interaction, 25 (1991/1992) 163-194.",
      "doi": ""
    },
    {
      "text": "Don, A. and Brennan, S. and Laurel, B. and Shneiderman, B. Anthropomorphism: from Eliza to Terminator 2, In Proc. CHI'92 Human Factors in Computing Systems (Monterey, May 3-7, 1992), ACM Press, pp. 67-70.  ",
      "doi": "10.1145/142750.142760"
    },
    {
      "text": "Don, A. and Oren, T. and Laurel, B. GUIDES 3.0, In Proc. CHI'91 Human Factors in Computing Systems (New Orleans, April 27-May 2, 1991), ACM Press, pp. 447-448.  ",
      "doi": "10.1145/108844.108996"
    },
    {
      "text": "Ishii, H. and Kobayashi, M. and Grudin, J. Integration of Interpersonal Space and Shared Workspace: ClearBoard Design and Experiments.ACM Trans. on Information Systems, 11, 4 (Oct. 1993) 349-375.  ",
      "doi": "10.1145/159764.159762"
    },
    {
      "text": "Maes, P. and Kozierok, R. Learning interface agents, In Proc. AAAI~93 (1993), MIT Press, Cambridge, pp. 459-465.",
      "doi": ""
    },
    {
      "text": "Nass, C. and Steuer, J. and Tauber, E. R. Computers are Social Actors, In Proc. CHI'94 Human Factors in Computing Systems (Boston, April 24-28, 1994), ACM Press, pp. 72-78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Schmandt, C. M. and Davis, J. R. Synthetics speech for real time direction giving, In Digest of Technical Papers, IEEE ICCE, 1989, pp. 288-289.",
      "doi": ""
    },
    {
      "text": "Sellen, A. and Buxton, B. Using Spacial Cues to Improve Videoconferencing, In Proc. CHI'92 Human Factors in Computing Systems (Monterey, May 3-7, 1992), ACM Press, pp. 651-652.  ",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "Suchman, L. A. Plans and Situated Actions, Cambridge University Press, Cambridge, 1987.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Takeuchi, A. and Franks, S. A Rapid Face Construction Lab. Tech. Report. SCSL-TR-92-010, Sony Computer Science Laboratory, Inc., Tokyo, 1992.",
      "doi": ""
    },
    {
      "text": "Takeuchi, A. and Nagao, K. Communicative Facial Displays as a New Conversation Modality, In Proc. INTERCHI'93 Human Factors in Computing Systems (Amsterdam, April 24-29, 1993), ACM Press, pp. 187-193.  ",
      "doi": "10.1145/169059.169156"
    },
    {
      "text": "Walker, J. and Sproull, L. and Subramani, R. Using a Human Face in an Interface, In Proc. CHI'94 Human Factors in Computing Systems (Boston, April 24-28, 1994), ACM Press, pp. 85-91.  ",
      "doi": "10.1145/191666.191708"
    },
    {
      "text": "Waters, K. A muscle model for animating three-dimensional facial expression, In Computer Graphics 21, 4 (July 1987), 17-24.  ",
      "doi": "10.1145/37402.37405"
    },
    {
      "text": "Special Issue on Intelligent Agents, Communications of the ACM 37, 7 (July 1994).",
      "doi": ""
    }
  ]
}