{
  "doi": "10.1145/223904.223945",
  "title": "Transparent layered user interfaces: an evaluation of a display design to enhance focused and divided attention",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "317-324",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Beverly L. Harrison",
      "institution": "Dept. of Industrial Engineering, University of Toronto, Toronto, Ontario, Canada, M5S 1A4 and Alias Research Ltd., 110 Richmond St. East, Toronto, Ontario, Canada, M5C 1P1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010116",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "NTT Human Interface Lab, 1-2356 Take, Yokosuka-Shi, Kanagawa, 238-03 Japan",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    },
    {
      "name": "Kim J. Vicente",
      "institution": "Dept. of Industrial Engineering, University of Toronto, Toronto, Ontario, Canada, M5S 1A4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100020575",
      "orcid": "missing"
    },
    {
      "name": "William A. S. Buxton",
      "institution": "Alias Research Ltd., 110 Richmond St. East, Toronto, Ontario, Canada, M5C 1P1 and Dept. of Computer Science, University of Toronto, Toronto, Ontario, Canada, M5S 1A4",
      "img": "/do/10.1145/contrib-81452616426/rel-imgonly/81452616426.jpg",
      "acmid": "81452616426",
      "orcid": "0000-0002-0170-7097"
    }
  ],
  "references": [
    {
      "text": "Becklen, R. and Cervone, D. (1983) Selective looking and the noticing of unexpected events. Memory and Cognition, 11 (6), 601-608.]]",
      "doi": ""
    },
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., and DeRose, T. D. (1993). Toolglass and magic lenses: The see-through interface. Proceedings of SIGGRAPH'93. Anaheim, CA.]]  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Cohen J.D., MacWhinney B., Flatt M. &amp; Provost J. (1993). PsyScope: A new graphic interactive environment for designing psychology experiments. Behavioral Research Methods, Instruments &amp; Computers, 25(2), 257-271.]]",
      "doi": ""
    },
    {
      "text": "Harrison, B. L., Zhai, S., Vicente, K. J., Buxton, B. (1994). Semi-transparent User Interface Object: Supporting Focused and Divided Attention. Cognitive Engineering Lab Technical Report CEL-94-08, Dept. of Industrial Engineering, Univ. of Toronto, November, 1994.]]",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Kobayashi, M. (1991). Clearboard: A seamless medium for shared drawing and conversation with eye contact. Proceedings of CHI'91, Monterey, CA, 525-532.]]  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Jensen, A. R. &amp; Rohwer, W. D. (1966). The Stroop color-word test: A review, Acta Psychologica, 25, 36-93.]]",
      "doi": ""
    },
    {
      "text": "Kabbash, P., Buxton, W. A. S., and Sellen, A. (1994). Two-handed input in a compound task. Proceedings of CHI'94, Boston, MA., 417-423. Kahneman, D. and Chajczyk, D. (1983) Tests of the Automaticity of Reading: Dilution of Stroop Effects by Color-Irrelevant Stimuli. Journal of Experimental Psychology: Human Perception and Performance, 9 (4), August, 1993, 497-509.]]  ",
      "doi": "10.1145/191666.191808"
    },
    {
      "text": "Knowlton, K. C. (1977). Computer displays optically superimposed on input devices. Bell System Technical Journal, Vol. 56, No. 3, March, 1977. 367-383.]]",
      "doi": ""
    },
    {
      "text": "Kobayashi, M. and Ishii, H. (1994). DispLayers: Multi-Layer Display Technique to Enhance Selective Looking of Overlaid Images. Poster from CHI'94 Conference, April, 1994, Boston MA.]]  ",
      "doi": "10.1145/1125021.1125083"
    },
    {
      "text": "Kohler, P. A. (1972) Aspects of Motion Perception. New York: Pergamon.]]",
      "doi": ""
    },
    {
      "text": "Larish, I and Wickens, C. D. (1991). Divided Attention with Superimposed and Separated Imagery: Implications for Head-Up Displays. University of Illinois Institute of Aviation Technical Report (ARL-91-4/NASA HUD-91-1).]]",
      "doi": ""
    },
    {
      "text": "MacLeod, C. M. (1991). Half a Century of Research on the Stroop Effect: An Integrative Review. Psychological Bulletin, Vol. 109, No. 2, 163-203. MacLeod, C. M. and Dunbar, K. (1988). Training and Stroop-like interference: Evidence for a continuum of automaticity. Journal of Experimental Psychology: Learning, Memory, and Cognition, 14, pp.126-135.]]",
      "doi": ""
    },
    {
      "text": "Neisser, U. and Becklen, R. (1975) Selective Looking: Attending to Visually Specified Events. Cognitive Psychology, 7, 480-494.]]",
      "doi": ""
    },
    {
      "text": "Schmandt, C. (1983). Spatial input/display correspondance in a stereoscopic computer graphic workstation. Computer Graphics, Vol. 17, No. 3., 253-259.]]  ",
      "doi": "10.1145/964967.801156"
    },
    {
      "text": "Stroop, J. R. (1935). Factors affecting speed in serial verbal reactions. Journal of Experimental Psychology, 18, 643-662.]]",
      "doi": ""
    },
    {
      "text": "Wickens, C. D., Martin-Emerson, R., and Larish, I. (1993). Attentional tunneling and the Head-up Display. Proceedings of the 7th Annual Symposium on Aviation Psychology, Ohio State University, Ohio, 865-870.]]",
      "doi": ""
    },
    {
      "text": "Zhai, S., Buxton, W., and Milgram, P. (1994). The \"silk cursor\": Investigating transparency for 3D target acquisition. Proceedings of CHI'94, Boston, MA., 459-464.]]  ",
      "doi": "10.1145/191666.191822"
    }
  ]
}