{
  "doi": "10.1145/223904.223912",
  "title": "TileBars: visualization of term distribution information in full text information access",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "59-66",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Marti A. Hearst",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Rd, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "M. Aboud, C. Chrisment, R. Razouk, and F. Sedes. (1993) Querying a hypertext information retrieval system by the use of classification. Information Processing and Management , 29(3):387-396, 1993.  ",
      "doi": "10.1016/0306-4573%2893%2990063-J"
    },
    {
      "text": "H. C. Arents and W. F. L. Bogaerts. (1993) Concept-based retrieval of hypermedia information - from term indexing to semantic hyperindexing. Information Processing and Management , 29(3):373-386, 1993.  ",
      "doi": "10.1016/0306-4573%2893%2990062-I"
    },
    {
      "text": "Jacques Bertin. (1983) Semiology of Graphics . The University of Wisconsin Press, Madison, WI, 1983. Translated by William J. Berg. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Richard Chimera. (1992) Value bars: An information visualization and navigation tool for multi-attribute listings. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems , pages 293-294, May 1992.  ",
      "doi": "10.1145/142750.142817"
    },
    {
      "text": "William S. Cooper, Fredric C. Gey, and Aitoa Chen. (1994) Probabilistic retrieval in the TIPSTER collections: An application of staged logistic regression. In Donna Harman, editor, Proceedings of the Second Text Retrieval Conference TREC-2 , pages 57-66. National Institute of standard and Technology Special Publication 500-215, 1994.",
      "doi": ""
    },
    {
      "text": "W. Bruce Croft and Howard R. Turtle. (1992) Text retrieval and inference. In Paul S. Jacobs, editor, Text-Based Intelligent Systems: Current Research and Practice in Information Extraction and Retrieval , pages 127-156. Lawrence Erlbaum Associates, 1992. ",
      "doi": "10.5555/132407.132418"
    },
    {
      "text": "Douglass R. Cutting, David Karger, and Jan Pedersen. (1993) Constant interaction-time Scatter/Gather browsing of very large document collections. In Proceedings of the 16th Annual International ACM/SIGIR Conference , pages 126-135, Pittsburgh, PA, 1993.  ",
      "doi": "10.1145/160688.160706"
    },
    {
      "text": "Douglass R. Cutting, Jan O. Pedersen, and Per-Kristian Halvorsen. (1991) An object-oriented architecture for text retrieval. In Conference Proceedings of RIAO '91, Intelligent Text and Image Handling , Barcelona, Spain, pages 285-298, April 1991. Also available as Xerox PARC technical report SSL-90-83.",
      "doi": ""
    },
    {
      "text": "Douglass R. Cutting, Jan O. Pedersen, Per-Kristian Halvorsen, and Meg Withgott. (1990) Information theater versus information refinery. In Paul S. Jacobs, editor, AAAI Spring Symposium on Text-based Intelligent Systems , 1990.",
      "doi": ""
    },
    {
      "text": "Dennis E. Egan, Joel R. Remde, Louis M. Gomez, Thomas K. Landauer, Jennifer Eberhardt, and Carol C. Lochbaum. (1989) Formative design evaluation of superbook. Transaction on Information Systems , 7(1), 1989.  ",
      "doi": "10.1145/64789.64790"
    },
    {
      "text": "Edward A. Fox and Matthew B. Koll. (1988) Practical enhanced Boolean retrieval: Experiences with the SMART and SIRE systems. Information Processing and Management , 24(3), 1988.  ",
      "doi": "10.1016/0306-4573%2888%2990093-3"
    },
    {
      "text": "Norbert Fuhr and Chris Buckley. (1993) Optimizing document indexing and search term weighting based on probabilistic models. In Donna Harman, editor, The First Text Retrieval Conference (TREC-1) , pages 89-100. NIST Special Publication 500-207, 1993.",
      "doi": ""
    },
    {
      "text": "Donna Harman. (1993) Overview of the first Text REtrieval Conference. In Proceedings of the 16th Annual International ACM/SIGIR Conference , pages 36-48, Pittsburgh, PA, 1993.  ",
      "doi": "10.1145/160688.160692"
    },
    {
      "text": "Marti A. Hearst. (1994a) Context and Structure in Automated Full-Text Information Access . PhD thesis, University of California at Berkeley, 1994. (Computer Science Division Technical Report UCB/CSD-94/836). ",
      "doi": "10.5555/221549"
    },
    {
      "text": "Marti A. Hearst. (1994b) Multi-paragraph segmentation of expository text. In Proceedings of the 32nd Meeting of the Association for Computational Linguistics , June 1994.  ",
      "doi": "10.3115/981732.981734"
    },
    {
      "text": "Marti A. Hearst. (1995) An investigation of term distribution effects in Full-Text Retrieval. Technical Report Report Number ISTL-QCA-1994-12-06, Xerox PARC, 1995. Submitted for publication.",
      "doi": ""
    },
    {
      "text": "William C. Hill, James D. Hollan, Dave Wroblewski, and Tim McCandless. (1992) Edit wear and read wear. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems , pages 3-9, May 1992.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Brewster Kahle and Art Medlar. (1991) An information system for corporate users: Wide area information servers. Technical Report TMC199, Thinking Machines Corporation, April 1991.",
      "doi": ""
    },
    {
      "text": "Robert R. Korfhage. (1991) To see or not to see - is that the query? In Proceedings of the 14th Annual International ACM/SIGIR Conference , pages 134-141, Chicago, 1991.  ",
      "doi": "10.1145/122860.122873"
    },
    {
      "text": "S. Kosslyn, S. Pinker, W. Simcox, and L. Parkin. (1983) Understanding Charts and Graphs: A Project in Applied Cognitive Science . National Institute of Education, 1983. ED 1.310/2:238687.",
      "doi": ""
    },
    {
      "text": "Jock Mackinlay. (1986) Automatic Design of Graphical Presentations . PhD thesis, Stanford University, 1986. Technical Report Stan-CS-86-1038. ",
      "doi": "10.5555/39942"
    },
    {
      "text": "Alistair Moffat, Ron Sacks-Davis, Ross Wilkinson, and Justin Zobel. (1994) Retrieval of partial documents. In Donna Harman, editor, Proceedings of the Second Text Retrieval Conference TREC-2 , pages 181-190. National Institute of standard and Technology Special Publication 500-215, 1994.",
      "doi": ""
    },
    {
      "text": "Terry Noreault, Michael McGill, and Matthew B. Koll. (1981) A performance evaluation of similarity measures, document term weighting schemes and representations in a Boolean environment. In R. N. Oddy, S. E. Robertson, C. J. van Rijsbergen, and P. W. Williams, editors, Information Retrieval Research , pages 57-76. Butterworths, London, 1981. ",
      "doi": "10.5555/636669.636674"
    },
    {
      "text": "John Ousterhout. (1991) An X11 toolkit based on the Tcl language. In Proceedings of the Winter 1991 USENIX Conference , pages 105-115, Dallas, TX, 1991.",
      "doi": ""
    },
    {
      "text": "George C. Robertson, Stuart K. Card, and Jock D. MacKinlay. (1993) Information visualization using 3D interactive animation. Communications of the ACM , 36(4):56-71, 1993.  ",
      "doi": "10.1145/255950.153577"
    },
    {
      "text": "Gerard Salton. (1988) Automatic text processing : the transformation, analysis, and retrieval of information by computer . Addison-Wesley, Reading, MA, 1988. ",
      "doi": "10.5555/77013"
    },
    {
      "text": "Hikmet Senay and Eve Ignatius. (1990) Rules and principles of scientific data visualization. Technical Report GWU-IIST-90-13, Institute for Information Science and Technology, The George Washington University, 1990.",
      "doi": ""
    },
    {
      "text": "Anselm Spoerri. (1993) InfoCrystal: A visual tool for information retrieval &amp; management. In Proceedings of Information Knowledge and Management '93 , Washington, D.C., Nov 1993.  ",
      "doi": "10.1145/170088.170095"
    },
    {
      "text": "Edward Tufte. (1983) The Visual Display of Quantitative Information . Graphics Press, Chelshire, CT, 1983. ",
      "doi": "10.5555/33404"
    }
  ]
}