{
  "doi": "10.1145/223904.223923",
  "title": "Multidisciplinary modelling in HCI design…in theory and in practice",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "146-153",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Victoria Bellotti",
      "institution": "Apple Computer Inc., One Infinite Loop, MS: 301-4A, Cupertino, CA and Rank Xerox Research Centre (formerly EuroPARC), 61 Regent Street, Cambridge, CB2 1AB, UK",
      "img": "/do/10.1145/contrib-81100464780/rel-imgonly/bellotti-portrait-small.jpg",
      "acmid": "81100464780",
      "orcid": "missing"
    },
    {
      "name": "Simon Buckingham Shum",
      "institution": "Human-Computer Interaction Group, Dept. Psychology, University of York, York, YO1 5DD, UK",
      "img": "/do/10.1145/contrib-81351597495/rel-imgonly/81351597495.png",
      "acmid": "81351597495",
      "orcid": "missing"
    },
    {
      "name": "Allan MacLean",
      "institution": "Rank Xerox Research Centre (formerly EuroPARC), 61 Regent Street, Cambridge, CB2 1AB, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100609167",
      "orcid": "missing"
    },
    {
      "name": "Nick Hammond",
      "institution": "Human-Computer Interaction Group, Dept. Psychology, University of York, York, YO1 5DD, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100001026",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barnard, P.J. and Harrison, M.D. Towards a Framework for Modelling Human-Computer Interaction. In Proceedings of EWHCI'92: East-West Conference in HCI, 1992, pp. 189-196.",
      "doi": ""
    },
    {
      "text": "Bellotti, V. Implications of Current Design Practice for the Use of HCI Techniques. In Proceedings of HCI'88: People and Computers V, 1988, CUP: Cambridge, pp. 13-34. ",
      "doi": "10.5555/54675.54677"
    },
    {
      "text": "Bellotti, V. A Framework for Assessing Applicability of HCI Techniques. In Proceedings of IFIP INTERACT'90: Human-Computer Interaction, 1990, Elsevier: Amsterdam, pp. 213-218. ",
      "doi": "10.5555/647402.725287"
    },
    {
      "text": "Bellotti, V. Integrating Theoreticians' and Practitioners' Perspectives with Design Rationale. In Proceedings of InterCHI'93: Human Factors in Computing Systems, 1993, ACM Press: NY, pp. 101-106.  ",
      "doi": "10.1145/169059.169107"
    },
    {
      "text": "Bellotti, V., Buckingham Shum, S. and MacLean, A. Assaying Multidisciplinary Modelling Using QOC as a Mediating Design Expression: The 'EuroCODE' Design Exemplar. Amodeus-2 Project, Working Paper ID/WP30, 1994.",
      "doi": ""
    },
    {
      "text": "Bernsen, N.O. Structuring Design Spaces. In Adjunct Proceedings of InterCHI'93 (Short Papers), 1993, pp. 211-212.  ",
      "doi": "10.1145/259964.260238"
    },
    {
      "text": "Blandford, A. and Young, R.M. Developing Runnable User Models: Separating the Problem Solving Techniques from the Domain Knowledge. In HCI'93: People and Computers VIII, 1993, CUP",
      "doi": ""
    },
    {
      "text": "Blandford, A.E. and Young, R.M. A tutorial introduction to the PUM Instruction Language. Amodeus-2 Project, Working Paper UM/WP29, 1995.",
      "doi": ""
    },
    {
      "text": "Buckingham Shum, S. Analyzing the Usability of a Design Rationale Notation. To appear in: Design Rationale: Concepts, Techniques, and Use, Moran, T.P. and Carroll, J.M., (Ed.), Lawrence Erlbaum Associates: Hillsdale, NJ, (in press). ",
      "doi": "10.5555/261685.261718"
    },
    {
      "text": "Buckingham Shum, S. (Ed.) Preliminary Modelling of the CERD Flight Sequencing Tool. Amodeus-2 Project, Working Paper TA/WP23, 1994.",
      "doi": ""
    },
    {
      "text": "Buckingham Shum, S. and Hammond, N. Argumentation-Based Design Rationale: What Use at What Cost? International Journal of Human-Computer Studies, 40, 4, 1994, pp. 603-652.  ",
      "doi": "10.1006/ijhc.1994.1029"
    },
    {
      "text": "Buckingham Shum, S. and Hammond, N. Delivering HCI Modelling to Designers: A Framework and Case Study of Cognitive Modelling. Interacting with Computers, 6, 3, 1994, pp. 311-341.",
      "doi": ""
    },
    {
      "text": "Buckingham Shum, S. and Hammond, N. Transferring HCI Modelling and Design Techniques to Practitioners: A Framework and Empirical Work. In Proceedings of HCI'94: People and Computers IX, 1994, CUP, pp. 21-36. ",
      "doi": "10.5555/211382.211385"
    },
    {
      "text": "Buckingham Shum, S., J~rgensen, A., Hammond, N. and Aboulafia, A. (Eds.) Amodeus HCI Modelling &amp; Design Approaches: Executive Summaries &amp; Worked Examples. Amodeus-2 Project, Working Paper TA/WP16, 1994.",
      "doi": ""
    },
    {
      "text": "Buckingham Shum, S., J~rgensen, A.H., Aboulafia, A. and Hammond, N.V. Communicating HCI Modelling to Practitioners. In Proceedings of ACM CHI'94: Human Factors in Computing Systems, 1994, ACM: New York, pp. 271-272 (Vol.2).  ",
      "doi": "10.1145/259963.260485"
    },
    {
      "text": "Carroll, J.M. and Rosson, M.B. Deliberated Evolution: Stalking The View Matcher in Design Space. Human-Computer Interaction, 6, 3&amp;4, 1991, pp. 281-318.",
      "doi": ""
    },
    {
      "text": "Coutaz, J. PAC: An Object-Oriented Model for Dialog Design. In Proceedings of IFIP INTERACT'87, 1987, Elsevier: Amsterdam, pp. 431-436.",
      "doi": ""
    },
    {
      "text": "Curtis, B., Krasner, H. and Iscoe, N. A Field Study of the Software Design Process for Large Systems. Communications of the ACM, 31, 11, 1988, pp. 1268-1286.  ",
      "doi": "10.1145/50087.50089"
    },
    {
      "text": "Duke, D. and Harrison, M. Abstract Interaction Objects. Computer Graphics Forum, 12, 1993, pp. 25-36.",
      "doi": ""
    },
    {
      "text": "Gaver, W., T., M., MacLean, A., L~vstrand, L., Dourish, P., Carter, K. and Buxton, W. Realising a Video Environment: EuroPARC's RAVE System. In Proceedings of ACM CHI'92: Human Factors in Computing Systems, ACM Press: New York: Monterey, CA, 1992, pp. 27-35.  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Gray, W.D., John, B.E. and Atwood, M.E. The Precis of Project Ernestine or an overview of a validation of GOMS. In Proceedings of ACM CHI'92: Human Factors in Computing Systems, 1992, ACM Press: New York, pp. 307-312.  ",
      "doi": "10.1145/142750.142821"
    },
    {
      "text": "Gugerty, L. The Use of Analytical Models in Human-Computer Interaction. International Journal of Man-Machine Studies, 38, 1993, pp. 625-660.  ",
      "doi": "10.1006/imms.1993.1030"
    },
    {
      "text": "acLean, A., Buckingham Shum, S. and Bellotti, V. Design Rationale Tutorial. Tutorials at HCI'92-94: British Computer Society HCI Conferences, UK, 1992-94",
      "doi": ""
    },
    {
      "text": "MacLean, A., Young, R.M., Bellotti, V. and Moran, T. Questions, Options, and Criteria: Elements of Design Space Analysis. Human-Computer Interaction, 6, 3 &amp; 4, 1991, pp. 201-250.",
      "doi": ""
    },
    {
      "text": "Mantei, M.M., Baecker, R.M., Sellen, A.J., Buxton, W.A.S., Milligan, T. and Wellman, B. Experiences in the Use of a Media Space. In Proceedings of ACM CHI'91: Human Factors in Computing Systems, 1991, pp. 203-208.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "May, J., Barnard, P.J. and Blandford, A. Using Structural Descriptions of Interfaces to Automate the Modelling of User Cognition. User Modelling and Adaptive User Interfaces, 3, 1993, pp. 27-64.",
      "doi": ""
    },
    {
      "text": "McKerlie, D. and MacLean, A. QOC in Action: Using Design Rationale to Support Design. Video Program, InterCHI'93: Human Factors in Computing Systems. Amsterdam, Netherlands. ACM SIGGRAPH Video Review Series, 1993  ",
      "doi": "10.1145/169059.169494"
    },
    {
      "text": "McKerlie, D. and MacLean, A. Reasoning with Design Rationale: Practical Experience with Design Space Analysis. Design Studies, 15, 2, 1994, pp. 214-226",
      "doi": ""
    },
    {
      "text": "Monk, A., Carroll, J., Harrison, M., Long, J. and Young, R. New Approaches to Theory in HCI: How Should We Judge Their Acceptability? In Proceedings of IFIP INTERACT'90: Human-Computer Interaction, 1990, Elsevier: Amsterdam, pp. 1055-1058. ",
      "doi": "10.5555/647402.725759"
    },
    {
      "text": "Payne, S.J. Understanding Calendar Use. Human-Computer Interaction, 8, 2, 1993, pp. 83-100.",
      "doi": "10.1207/s15327051hci0802_1"
    },
    {
      "text": "Rosson, M., Maass, S. and Kellogg, W. The Designer as User: Building Requirements for Design Tools from Design Practice. Communications of the ACM, 31, 11, 1988, pp. 1288-1298.  ",
      "doi": "10.1145/50087.50090"
    }
  ]
}