{
  "doi": "10.1145/223904.223956",
  "title": "A focus+context technique based on hyperbolic geometry for visualizing large hierarchies",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "401-408",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "John Lamping",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100154625",
      "orcid": "missing"
    },
    {
      "name": "Ramana Rao",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100591911",
      "orcid": "missing"
    },
    {
      "name": "Peter Pirolli",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100252735",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Bertin. Semiology of Graphics , University of Wisconsin Press, 1983. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "H. S. M. Coxeter. Non-Euclidean Geometry. University of Toronto Press, 1965.",
      "doi": ""
    },
    {
      "text": "George W. Furnas. Generalized fisheye views. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, pages 16--23. ACM, April 1986.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "C. Gunn. Visualizing hyperbolic space. In Computer Graphics and Mathematics, pages 299--311. Springer-Verlag, October 1991.",
      "doi": ""
    },
    {
      "text": "B. Johnson and B. Shnedierman. Tree-maps: A space-filling approach to the visualization of hierarchical information. In Visualization 1991, pages 284--291. IEEE, 1991. ",
      "doi": "10.5555/949607.949654"
    },
    {
      "text": "Hideki Koike and Hirotaka Yoshihara. Fractal approaches for visualizing huge hierarchies. In Proceedings of the 1993 IEEE Symposium on Visual Languages. IEEE, 1993.",
      "doi": ""
    },
    {
      "text": "Y.K. Leung and M.D.Apperley. A review and taxonomy of distortion-oriented presentation techniques. ACM Transactions on Computer-Human Interaction, 1(2):126--160, June 1994.  ",
      "doi": "10.1145/180171.180173"
    },
    {
      "text": "J. D. Mackinlay, G. G. Robertson, and S. K. Card. The perspective wall: Detail and context smoothly integrated. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, pages 173--179. ACM, April 1991.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "E. E. Moise. Elementary Geometry from an Advanced Standpoint. Addison-Wesley, 1974.",
      "doi": ""
    },
    {
      "text": "G. G. Robertson, S. K. Card, and J. D. Mackinlay. The cognitive coprocessor architecture for interactive user interfaces. In Proceedings of the ACM SIGGRAPH Symposium on User Interface Software and Technology, pages 10--18. ACM Press, Nov 1989.  ",
      "doi": "10.1145/73660.73662"
    },
    {
      "text": "G. G. Robertson, S. K. Card, and J. D. Mackinlay. Information visualization using 3d interactive animation. Communications of the ACM, 36(4), 1993.  ",
      "doi": "10.1145/255950.153577"
    },
    {
      "text": "G. G. Robertson, J. D. Mackinlay, and S. K. Card. Cone trees: Animated 3d visualizations of hierarchical information. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, pages 189--194. ACM, April 1991.  ",
      "doi": "10.1145/108844.108883"
    },
    {
      "text": "George G. Robertson and J. D. Mackinlay. The document lens. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM Press, Nov 1993.  ",
      "doi": "10.1145/168642.168652"
    },
    {
      "text": "Manojit Sarkar and Marc H. Brown. Graphical fisheye views of graphs. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, pages 83--91. ACM, April 1992.  ",
      "doi": "10.1145/142750.142763"
    },
    {
      "text": "Manojit Sarkar and Marc H. Brown. Graphical fisheye views. Communications of the ACM, 37(12):73--84, December 1994.  ",
      "doi": "10.1145/198366.198384"
    },
    {
      "text": "Manojit Sarkar, Scott Snibbe, and Steven Reiss. Stretching the rubber sheet: A metaphor for visualizing large structure on small screen. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM Press, Nov 1993.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "Steven H. Tang and Mark A. Linton. Pacers: Time-elastic objects. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM Press, Nov 1993.  ",
      "doi": "10.1145/168642.168646"
    }
  ]
}