{
  "doi": "10.1145/223904.223930",
  "title": "Pointing the way: active collaborative filtering",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "202-209",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "David Maltz",
      "institution": "Dept. of Computer Science, Carnegie-Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100525655",
      "orcid": "missing"
    },
    {
      "name": "Kate Ehrlich",
      "institution": "Lotus Development Corporation, One Rogers St, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331492075",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Danzig, P., Obraczka, K., and Li, S-H. Internet Resource Discovery Services, IEEE Computer, September 1993, pp. 8-22.  ",
      "doi": "10.1109/2.231277"
    },
    {
      "text": "Ehrlich, K. and Cash, D. Turning Information into Knowledge: Information Finding as a Collaborative Activity. In Proceedings Digital Libraries '94 (College Station, 1994), 119-125.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K. and Cash, D. I am an Information Waitress: Bringing Order to the New Digital Libraries. 1994. Lotus Internal Report.",
      "doi": ""
    },
    {
      "text": "Fischer, G. and Stevens, C. Information Access in Complex, Poorly Structured Information Spaces. In Proc. CHI'91 Human Factors in Computing Systems (New Orleans,1991), Addison-Wesley, pp. 63-70.  ",
      "doi": "10.1145/108844.108854"
    },
    {
      "text": "Goldberg, D., Oki, B., Nichols, D., Terry, D.B. Using Collaborative Filtering to Weave an Information Tapestry. Communications of the ACM, December 1992, Vol 35, No12, pp. 61-70.  ",
      "doi": "10.1145/138859.138867"
    },
    {
      "text": "Grudin, J. Why CSCW Applications Fail: problems in the Design and Evaluation of Organizational Interfaces. In Proc. CSCW '88 (Portland, 1988), ACM, pp. 85-93.  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Hill, W., Hollan, J., Wrobleski, D. and McCandless, T. Edit Wear and Read Wear. In Proc. CHI'92 Human Factors in Computing Systems (Monterey, 1992), Addison-Wesley, pp. 3-9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Johnson, M. Simon Homepage: \"Welcome to SIMON,'' University of London, available via World Wide Web at http://www.elec.qmw.ac.uk/simon/.",
      "doi": ""
    },
    {
      "text": "Loeb, S. Architecting Personalized Delivery of Multimedia Information. Communications of the ACM, December 1992, Vol 35, No 12, pp. 39-48.  ",
      "doi": "10.1145/138859.138862"
    },
    {
      "text": "Maltz, D.A. Distributing Information for Collaborative Filtering on Usenet Net News. MIT Department of EECS MS Thesis (May, 1994). Also available as Tech Report MIT/LCS/TR-603. ",
      "doi": "10.5555/888543"
    },
    {
      "text": "Mauldin, M., personal communication. see also \"The Lycos Home Page:Hunting WWW Information\" http://lycos.cs.cmu.edu/.",
      "doi": ""
    },
    {
      "text": "Palme, J. You have 134 unread mail! Do you want to read them now? Proceedings IFIP WG 6.5 Working Conference on Computer-Based Document Services, Nottingham England May 1984, pp 175-184. ",
      "doi": "10.5555/3586.3599"
    },
    {
      "text": "Reid, B. Usenet Readership Summary Report For May 93, Usenet news.lists, 2 June 1993.",
      "doi": ""
    },
    {
      "text": "Resnick, P., Neophytos, I., Mitesh, S. Bergstrom, P. and Riedl, J. GroupLens: An Open Architecture for Collaborative Filtering of Netnews. In Proc. of CSCW '94: Conference on Computer Supported Cooperative Work (Chapel Hill, 1994), Addison-Wesley.  ",
      "doi": "10.1145/192844.192905"
    },
    {
      "text": "Sheth, B., and Maes, P. Evolving Agents for Personalized Information Filtering. Proceedings of the Ninth IEEE Conference on Artificial Intelligence for Applications, 1993.",
      "doi": ""
    },
    {
      "text": "Terry, D.B. 7 Steps to a Better Mail System. Proceedings IFIP International Symposium on Message Handling System and Application Layer Communication Protocols, October 1990.",
      "doi": ""
    }
  ]
}