{
  "doi": "10.1145/223904.223925",
  "title": "Practical education for improving software usability",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "162-169",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "John Karat",
      "institution": "IBM T. J. Watson Research Center, 30 Saw Mill River Road, Hawthorne, NY",
      "img": "/do/10.1145/contrib-81100505984/rel-imgonly/john_pic1.jpg",
      "acmid": "81100505984",
      "orcid": "missing"
    },
    {
      "name": "Tom Dayton",
      "institution": "Bellcore, 444 Hoes Lane, RRC 4A-1112, Piscataway, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100070160",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellcore. New Jersey Learning Center Course Catalog. Bellcore, Piscataway, NJ, 1995.",
      "doi": ""
    },
    {
      "text": "Bennett, J., and Karat, J. Facilitating effective HCI design meetings. In Proc. of CHI '94 (1994), 198 204.  ",
      "doi": "10.1145/191666.191743"
    },
    {
      "text": "Card, S. K. Human limits and the VDT computer interface. In Visual Display Terminals. J. Bennett, D. Case, J. Sandelin, and M. Smith, Eds., Prentice-Hall, Englewood Cliffs, NJ, 1984, pp. 117 .",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T., and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum, Hillsdale, NJ, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Dayton, T. Cultivated eclecticism as the normative approach to design. In Taking Software Design Seriously: Practical Techniques for Human-Computer Interaction Design. J. Karat, Ed., Academic Press, Boston, 1991, pp. 21 44. ",
      "doi": "10.5555/110707.110709"
    },
    {
      "text": "Dayton, T., Barr, B., Burke, P. A., Cohill, A. M., Day, M. C., Dray, S., Ehrlich, K., Fitzsimmons, L. A., Henneman, R. L., Hornstein, S. B., Karat, J., Kliger, J., L~wgren, J., Rensch, J., Sellers, M., and Smith, M. R. Skills needed by user-centered design practitioners in real software development environments: Report on the CHI '92 workshop. SIGCHI Bulletin 25, 3 (1993), 16 31.  ",
      "doi": "10.1145/155786.155790"
    },
    {
      "text": "Dayton, T., McFarland, A., and White, E. Software development keeping users at the center. Bellcore Exchange 10, 5 (1994), 12 17.",
      "doi": ""
    },
    {
      "text": "Dayton, T., Tudor, L. G., and Root, R. W. Bellcore's user-centred-design support center. Behaviour &amp; Information Technology 13, 1 &amp; 2 (1994), 57 66.",
      "doi": ""
    },
    {
      "text": "Gould, J. D., and Lewis, C. H. Designing for usability key principles and what designers think. Commun. ACM 28, (1985), 300 311.  ",
      "doi": "10.1145/3166.3170"
    },
    {
      "text": "Grudin, J. Systematic sources of suboptimal interface design in large product development organizations. HCI 6, (1991), 147 196.",
      "doi": ""
    },
    {
      "text": "Hewett, T. T., Baecker, R., Card, S., Carey, T., Gasen, J., Mantei, M., Perlman, G., Strong, G., and Verplank, W. ACM SIGCHI Curricula for Human-Computer Interaction. ACM, NY, 1992.",
      "doi": ""
    },
    {
      "text": "Karat, J., and Dayton, T. Taking design seriously: Exploring techniques useful in HCI design. SIGCHI Bulletin 22, 2 (1990), 26 33.  ",
      "doi": "10.1145/122475.122480"
    },
    {
      "text": "Lund, A. M. How many human factors people are enough? Ergonomics in Design, (Jan. 1994), 36 39.",
      "doi": ""
    },
    {
      "text": "McFarland, A. Design Guide for Multiplatform Graphical User Interfaces (LP- R13). Bellcore, Piscataway, NJ, 1994.",
      "doi": ""
    },
    {
      "text": "Muller, M., and Kuhn, S. Participatory design {Special issue of Commun. ACM}. Commun. ACM 36, 4 (1993).  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Muller, M. J., Tudor, L. G., Wildman, D. M., White, E. A., Dayton, T., Carr, B., Diekmann, B., and Erickson, E. D. Bifocal tools for scenarios and representations in participatory activities with users. In Scenar- io-Based Design for Human-Computer Interac- tion. J. M. Carroll, Ed., New York, Wiley, in press. ",
      "doi": "10.5555/209227.209241"
    },
    {
      "text": "Muller, M. J., Wildman, D. M., and White, E. Participatory design through games and other group exercises {Tutorial at CHI '94, Boston}. CHI '94 Conference Companion, (1994), 411 412.  ",
      "doi": "10.1145/259963.260530"
    },
    {
      "text": "Rogers, Y., Bannon, L., and Button, G. Rethinking theoretical frameworks for HCI: Report on an INTERCHI '93 workshop. SIGCHI Bulletin 26, 1 (1994), 28 30.  ",
      "doi": "10.1145/181526.181530"
    },
    {
      "text": "Salasoo, A., White, E. A., Dayton, T., Burkhart, B., and Root, R. W. (1994). Bellcore's user-centered design approach. In Usability in Practice: How Companies Develop User-Friendly Products. M. E. Wiklund, Ed., Boston, Academic, 1994, pp. 489 515. ",
      "doi": "10.5555/180981.180997"
    },
    {
      "text": "Schoen, D. Educating the Reflective Practitioner. Jossey-Bass, San Francisco, 1986.",
      "doi": ""
    },
    {
      "text": "Strong, G. W., Gasen, J. B., Hewett, T., Hix, D., Morris, J., Muller, M. J., and Novick, D. G. New Directions in Human-Computer Interaction Education, Research, and Practice. Drexel Univ., Philadelphia, 1994.",
      "doi": ""
    },
    {
      "text": "Van Cott, H. P., and Huey, B. M., Eds., Human Factors Specialists' Education and Utilization: Results of a Survey. National Academy Press, Washington, D.C., 1992.",
      "doi": ""
    },
    {
      "text": "Whiteside, J., Bennett, J., and Holtzblatt, K. Usability engineering: Our experience and evolution. In Handbook of Human-Computer Interaction, M. Helander, Ed., Elsevier, Amsterdam, 1988.",
      "doi": ""
    },
    {
      "text": "Wroblewski, D. A. The construction of human-computer interfaces considered as a craft. In Taking Software Design Seriously: Practical Techniques for Human-Computer Interaction Design, J. Karat, Ed., Academic, Boston, 1991, pp. 1 19. ",
      "doi": "10.5555/110707.110708"
    }
  ]
}