{
  "doi": "10.1145/223904.223928",
  "title": "Time affordances: the time factor in diagnostic usability heuristics",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "186-193",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Alex Paul Conn",
      "institution": "Digital Equipment Corporation, 110 Spit Brook Road, Nashua, New Hampshire",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538209956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlberg, Christopher and Schneiderman, Ben, \"Visual Information Seeking: Tight Coupling of Dynamic Filters with Starfield Displays,\" CHI '94 Proceedings, pp. 313-317 and 479-480.  ",
      "doi": "10.1145/191666.191775"
    },
    {
      "text": "DeSoi, John F, Lively, William M., and Sheppard, Sallie V., \"Graphical Specification of User Interfaces with Behavior Abstraction,\" CHI '89 Proceedings, pp. 139-144.  ",
      "doi": "10.1145/67449.67477"
    },
    {
      "text": "Gaver, William W., \"Technology Affordances,\" CHI '91 Proceedings, pp. 79-84.  ",
      "doi": "10.1145/108844.108856"
    },
    {
      "text": "Geist, Robert, Allen, Robert, and Nowaczyk, Ronald, \"Towards a Model of User Perception of Computer System Response Time\" CHI '87 Proceedings, pp. 249-253.  ",
      "doi": "10.1145/29933.275638"
    },
    {
      "text": "Mayhew, Deborah J., Principles and Guidelines in Software User Interface Design, Prentice Hall, Englewood Cliffs, New Jersey, 1992. Chapters 9 and 15. ",
      "doi": "10.5555/121399"
    },
    {
      "text": "Myers, Brad A., \"The Importance of Percent-Done Progress Indicators for Computer-Human Interfaces,\" CHI '85 Proceedings, pp. 11-17.  ",
      "doi": "10.1145/317456.317459"
    },
    {
      "text": "Nielsen, Jakob and Phillips, Victoria L., \"Estimating the Relative Usability of Two Interfaces: Heuristic, Format, and Empirical Methods Compared, CHI '93 Proceedings, pp. 214-221.  ",
      "doi": "10.1145/169059.169173"
    },
    {
      "text": "Nielsen, Jakob, Enhancing the Explanatory Power of Usability Heuristics, CHI '94 Proceedings, pp. 152-158.  ",
      "doi": "10.1145/191666.191729"
    },
    {
      "text": "Norman, Donald A., The Psychology of Everyday Things, Basic Books, New York, 1988.",
      "doi": ""
    },
    {
      "text": "Schneiderman, Ben, \"Response Time and Display Rate in Human Performance with Computers,\" ACM Computing Surveys, Volume 16, Number 3, September 1984. See section 5 in particular.  ",
      "doi": "10.1145/2514.2517"
    },
    {
      "text": "Senge, Peter M., The Fifth Discipline, The Art and Practice of the Learning Organization, Doubleday, New York., 1990. See chapters 3 and 5 in particular.",
      "doi": ""
    },
    {
      "text": "Thovtrup, Henrik and Nielsen, Jakob, \"Assessing the Usability of a User Interface Standard,\" CHI '91 Proceedings, pp. 335-341.  ",
      "doi": "10.1145/108844.108937"
    }
  ]
}