{
  "doi": "10.1145/223904.223955",
  "title": "A theoretically motivated tool for automatically generating command aliases",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "393-400",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Sarah Nichols",
      "institution": "ESRC Centre for Research in Development, Instruction and Training, Department of Psychology, University of Nottingham, University Park, Nottingham, NG7 2RD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81330495823",
      "orcid": "missing"
    },
    {
      "name": "Frank E. Ritter",
      "institution": "ESRC Centre for Research in Development, Instruction and Training, Department of Psychology, University of Nottingham, University Park, Nottingham, NG7 2RD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81341495549",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S., Moran, T. and Newell, A. The psychology of human-computer interaction. 1983, Hillsdale, NJ: LEA. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Card, S.K., Moran, T.P. and Newell, A. The keystroke-level model for user performance time with interactive systems. Communications of the ACM, 1980. 23(7): p. 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Casner, S. and Larkin, J.H. Cognitive efficiency considerations for good graphic design. In Proceedings of the Annual Conference of the Cognitive Science Society. 1989. Hillsdale, NJ: LEA.",
      "doi": ""
    },
    {
      "text": "Ehrenreich, S.L. and Porcu, T. Abbreviations for Automated Syatems: Teaching Operators The Rules, In Directions in Human/Computer Interaction, A. Badre and B. Shneiderman, Editors. 1982, Ablex: Norwood, NJ.",
      "doi": ""
    },
    {
      "text": "Haunold, P. and Kuhn, W. A. Keystroke Level Analysis of a Graphics Application: Manual Map Digitizing. In CHI '94, Human Factors in Computing Systems. 1994. Boston, MA: ACM.  ",
      "doi": "10.1145/191666.191779"
    },
    {
      "text": "Hucka, M, The Soar Development Environment, 1994. Artificial Intelligence Laboratory, University of Michigan: Ann Arbor.",
      "doi": ""
    },
    {
      "text": "John, B.E. and Newell, A. Predicting the time to recall computer command abbreviations. In CHI'87 Conference on Human Factors and Computing Systems. 1987. New York: ACM Press.  ",
      "doi": "10.1145/29933.30857"
    },
    {
      "text": "Newell, A. Unified Theories of Cognition. 1990, Cambridge, MA: Harvard University Press. ",
      "doi": "10.5555/86564"
    },
    {
      "text": "Payne, S.J. and Green, T.R.G. Task-action grammars: A model of the mental representation of task languages. Human-Computer Interaction, 1986. 2: p. 93-133.",
      "doi": ""
    },
    {
      "text": "Ritter, F.E, Lochun, S, Bibby, P.A. and Marshall, S. Dismal: A free spreadsheet for sequential data analysis and HCI experimentation. In Computers in Psychology '94. 1994. York (UK): CTI Centre for Psychology, U. of York.",
      "doi": ""
    },
    {
      "text": "Watts, R.A. Introducing Interactive Computing. 1984, Manchester: NCC Publications.",
      "doi": ""
    }
  ]
}