{
  "doi": "10.1145/223904.223937",
  "title": "A Virtual Window on media space",
  "published": "1995-05-01",
  "proctitle": "CHI '95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "257-264",
  "year": 1995,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "William W. Gaver",
      "institution": "Royal College of Art, Kensington Gore, London SW7 2EU, U.K. and Technische Universiteit Delft, Jafalaan 9, 2628 BX Delft, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    },
    {
      "name": "Gerda Smets",
      "institution": "Technische Universiteit Delft, Jafalaan 9, 2628 BX Delft, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100012378",
      "orcid": "missing"
    },
    {
      "name": "Kees Overbeeke",
      "institution": "Technische Universiteit Delft, Jafalaan 9, 2628 BX Delft, The Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452609633",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adler, A., and Henderson, H. (1994). A room of our own: Experiences from a direct office share. Proceedings of CHI'94. ACM: New York, 138 - 144.  ",
      "doi": "10.1145/191666.191727"
    },
    {
      "text": "Bly, S., Harrison, S., and Irwin, S. (1993). Media spaces: Bringing people together in a video, audio, and computing environment. Communications of the ACM, 36 (1), 28 - 47.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Dourish, P., Adler, A., Bellotti, V. and Henderson, A. (1994). Your place or mine? Learning from long-term use of video communication. Working Paper, Rank Xerox Research Centre, Cambridge Laboratory.",
      "doi": ""
    },
    {
      "text": "Fish, R., Kraut, R., Root, R., and Rice, R. Evaluating video as a technology for informal communication. Proceedings of CHI'92. ACM, New York, 37 - 48.  ",
      "doi": "10.1145/142750.142755"
    },
    {
      "text": "Gaver, W. The affordances of media spaces for collaboration. Proceedings of CSCW'92 .  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Gaver, W., Moran, T., MacLean, A., L~vstrand, L., Dourish, P., Carter, K., and Buxton, W. Realizing a video environment: EuroPARC's RAVE system. Proceedings of CHI'92. ACM, New York, 27 - 35.  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Gaver, W., Sellen, A., Heath, C. and Luff, P. (1993). One is not enough: Multiple views on a media space. Proceedings of INTERCHI'93. ACM: New York, 335 - 341.  ",
      "doi": "10.1145/169059.169268"
    },
    {
      "text": "Gibson, J. J. (1979). The ecological approach to visual perception. Houghton Mifflin, New York.",
      "doi": ""
    },
    {
      "text": "Heath, C., and Luff, P. (1992a). Collaboration and control: Crisis management and multimedia technol- ogy in London underground line control rooms. CSCW Journal, 1 (1-2), 69 - 94.",
      "doi": ""
    },
    {
      "text": "Heath, C., and Luff, P. (1992b). Media space and communicative asymmetries: Preliminary observations of video mediated interaction. Human-Computer Interaction, 7, 315 - 346.",
      "doi": "10.1207/s15327051hci0703_3"
    },
    {
      "text": "Heath, C., Luff, P., and Sellen, A. (1994). Rethinking media space: The need for flexible access in video- mediated communication. Rank Xerox Research Centre technical report.",
      "doi": ""
    },
    {
      "text": "Hodges, L., and McAllister, D. (1987). True three- dimensional CRT-based displays. Information Display. ",
      "doi": "10.5555/29413.29415"
    },
    {
      "text": "Ishii, H., Kobayashi, M., and Arita, K. (1994). Iterative design of seamless collaboration media. Communications of the ACM, 37 (8), 83 - 97.  ",
      "doi": "10.1145/179606.179687"
    },
    {
      "text": "Mantei, M., Baecker, R., Sellen, A., Buxton, W., Milligan, T., and Wellman, B. Experiences in the use of a media space. Proceedings of CHI'91. ACM, New York, 203 - 208.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "Nardi, B., Schwarz, H., Kuchinsky, A. Leichner, R., Whittaker, S. and Sclabassi, R. (1993). Turning away from talking heads: The use of video-as-data in neuro- surgery. Proceedings of INTERCHI'93. ACM: New York, 327 - 334.  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Overbeeke, C., Smets, G., and Stratmann, M. (1987). Depth on a flat screen II. Perceptual &amp; Motor Skills, 65.",
      "doi": ""
    },
    {
      "text": "Root, R. (1988). Design of a multimedia vehicle for social browsing. In Proceedings of the CSCW'88. ACM, New York. 25-38.  ",
      "doi": "10.1145/62266.62269"
    },
    {
      "text": "Rose, H. (1994). QuickTime VR: Much more than \"virtual reality for the rest of us.\" Converge, August.",
      "doi": ""
    },
    {
      "text": "Sellen, A. Speech patterns in video-mediated conver- sations. Proceedings of CHI'92. ACM, New York, 49 - 59.  ",
      "doi": "10.1145/142750.142756"
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. The social psychology of telecommunications. London: Wiley &amp; Sons, 1976.",
      "doi": ""
    },
    {
      "text": "Smets, G., Overbeeke, C., and Blankendaal (1995, submitted). Movement induced visual perception and resolution for product design. Submitted to Automatica.",
      "doi": ""
    },
    {
      "text": "Smets, G., Overbeeke, C., and Stratmann, M. (1987). Depth on a flat screen. Perceptual &amp; Motor Skills 64, 1023 - 1034.",
      "doi": ""
    },
    {
      "text": "Smets, G., Stratmann, M., &amp; Overbeeke, C. (1988). Method of causing an observer to get a three- dimensional impression from a two-dimensional representation. US Patent 4, 7575, 380.",
      "doi": ""
    },
    {
      "text": "Stappers, P. (1995, submitted). Tracking head movements in front of a monitor. Submitted to Behaviour Research Methods, Instruments, and Computers.",
      "doi": ""
    },
    {
      "text": "Stults, R. (1986). Media space. Xerox PARC technical report.",
      "doi": ""
    }
  ]
}