{
  "doi": "10.1145/1357054.1357190",
  "title": "Framing the user experience: information biases on website quality judgement",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "855-864",
  "year": 2008,
  "badges": [],
  "abstract": "Understanding the complexities of users' judgements and user experience is a prerequisite for informing HCI design. Current user experience (UX) research emphasises that, beyond usability, non-instrumental aspects of system quality contribute to overall judgement and that the user experience is subjective and variable. Based on judgement and decision-making theory, we have previously demonstrated that judgement of websites can be influenced by contextual factors. This paper explores the strength of such contextual influence by investigating framing effects on user judgement of website quality. Two experimental studies investigate how the presentation of information about a website influences the user experience and the relative importance of individual quality attributes for overall judgement. Theoretical implications for the emerging field of UX research and practical implications for design are discussed.",
  "authors": [
    {
      "name": "Jan Hartmann",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488619",
      "orcid": "missing"
    },
    {
      "name": "Antonella De Angeli",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647415",
      "orcid": "missing"
    },
    {
      "name": "Alistair Sutcliffe",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100269401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beach, L.R., Puto, C.P., Heckler, S.E., Naylor, G. and Marble, T.A. Differential versus unit weighting of violations, framing, and the role of probability in image theory's compatibility test. Organizational Behavior And Human Decision Processes, 65 (1996), 77--82.",
      "doi": ""
    },
    {
      "text": "De Angeli, A., Sutcliffe, A. and Hartmann, J., Interaction, usability and aesthetics: what influences users' preferences? in Proc. DIS 2006, ACM Press (2006), 271--280.  ",
      "doi": "10.1145/1142405.1142446"
    },
    {
      "text": "Forlizzi, J. and Battarbee, K., Understanding experience in interactive systems. in Proc. DIS 2004, ACM Press (2004).  ",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Hartmann, J., Assessing the Attractiveness of Interactive Systems. in Ext. Abstracts CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1125451.1125781"
    },
    {
      "text": "Hartmann, J. and Sutcliffe, A., A framework for judgement of quality of interactive systems. in Proc. 2nd International Open Workshop on User Experience - Towards a unified View at NordiCHI2006",
      "doi": ""
    },
    {
      "text": "Hartmann, J., Sutcliffe, A. and De Angeli, A., Investigating Attractiveness in Web User Interfaces. in Proc. CHI 2007, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240687"
    },
    {
      "text": "Hassenzahl, M. The effect of perceived hedonic quality on product appealingness. International Journal of Human-Computer Interaction 13,4 (2001), 481--499.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. The Thing and I: Understanding the Relationship between User and Product. in Blythe, M., Overbeeke, K., Monk, A.F. and Wright, P.C. eds. Funology, Kluwer Academic Publishers, 2003. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "Hassenzahl, M. and Tractinsky, N. User Experience -- a research agenda. Behaviour &amp; Information Technology 25, 2 (2006), 91--97.",
      "doi": ""
    },
    {
      "text": "Jordan, P. Designing Pleasurable Products. Taylor &amp; Francis, New York, NY, 2000.",
      "doi": ""
    },
    {
      "text": "Karlsson, M. Expressions, Emotions, and website design. CoDesign, 3, 1 (2007), 75--89.",
      "doi": ""
    },
    {
      "text": "Kim, J., Lee, J. and Choi, D. Designing Emotionally Evocative Homepages: An Empirical Study of the Quantative Relations Between Design Factors and Emotional Dimensions. International Journal of Human-Computer Studies, 59, 6 (2003), 899--940.  ",
      "doi": "10.1016/j.ijhcs.2003.06.002"
    },
    {
      "text": "Lai, Y.-L. and Hui, K.-L., Internet Opt-In and Opt-Out: Investigating the Roles of Frames, Defaults and Privacy Concerns. in Proc. SIGMIS-CPR'06 (2006).  ",
      "doi": "10.1145/1125170.1125230"
    },
    {
      "text": "Lavie, T. and Tractinsky, N. Assessing dimensions of perceived visual aesthetics of web sites. International Journal of Human-Computer Interaction, 60 (2004), 269--298.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "Levin, I.P. Associative effects of information framing. Bulletin of the Psychonomic Society, 25 (1987), 85--86.",
      "doi": ""
    },
    {
      "text": "Levin, I.P. and Gaeth, G.J. How Consumers Are Affected by the Framing of Attribute Information Before and After Consuming the Product. Journal of Consumer Research, 15, 3 (1988), 374--378.",
      "doi": ""
    },
    {
      "text": "Levin, I.P., Schneider, S.L. and Gaeth, G.J. All Frames Are Not Created Equal: A Typology and Critical Analysis of Framing Effects. Organizational Behavior And Human Decision Processes, 76, 2 (1998), 149--188.",
      "doi": ""
    },
    {
      "text": "Lindgaard, G., Fernandes, G., Dudek, C. and Brown, J. Attention web designers: You have 50 milliseconds to make a good first impression! Behaviour &amp; Information Technology, 25, 2 (2006), 115--126.",
      "doi": ""
    },
    {
      "text": "Linville, P.W., Fischer, G.W. and Fischhoff, B. AIDS risk perceptions and decision biases. in Pryor, J.B. and Reeder, G.D. eds. The social psychology of HIV infection, Lawrence Erlbaum, 1993, 5--38.",
      "doi": ""
    },
    {
      "text": "Loftus. A framework for a theory of picture recognition. in Monty, R.A. and Senders, J.W. eds. Eye movements and psychological processes, John Wiley and Sons, New York, NY, USA, 1976.",
      "doi": ""
    },
    {
      "text": "Löwgren, J. and Stolterman, E. Thoughtful Interaction Design: A Design Perspective on Information Technology. The MIT Press, Cambridge, MA, 2005. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "McCarthy, J. and Wright, P. Technology as Experience. MIT Press, Cambridge, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Meyerowitz, B.E. and Chaiken, S. The effect of message framing onbreast self-examination attitudes, intentions, and behavior. Journal of Personality and Social Psychology, 52 (1987), 500--510.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. Emotional Design. Basic Books, New York, NY, 2004.",
      "doi": ""
    },
    {
      "text": "Payne, J.W., Bettman, J.R. and Johnson, E.J. The Adaptive Decision Maker. Cambridge University Press, Cambridge, UK, 1993.",
      "doi": ""
    },
    {
      "text": "Schneider, S.L. Framing and conflict: Aspiration level contingency, the status quo, and current theories of risky choice. Journal of Experimental Psychology: Learning, Memory, and Cognition, 18 (1992).",
      "doi": ""
    },
    {
      "text": "Sutcliffe, A. and De Angeli, A., Assessing Interaction Styles in Web User Interfaces. in Proc. Interact 2005.  ",
      "doi": "10.1007/11555261_34"
    },
    {
      "text": "Tractinsky, N., Toward the Study of Aesthetics in Information Technology. in Proc. ICIS 2004.",
      "doi": ""
    },
    {
      "text": "Tversky, A. and Kahneman, D. The framing of decisions and the psychology of choice. Science 211 (1981).",
      "doi": ""
    },
    {
      "text": "van der Heijden, H. Factors influencing the usage of websites: the case of a generic portal in The Netherlands. Information &amp; Management, 40 (2003).  ",
      "doi": "10.1016/S0378-7206%2802%2900079-4"
    }
  ]
}