{
  "doi": "10.1145/1357054.1357303",
  "title": "Cultural theory and real world design: Dystopian and Utopian Outcomes",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1593-1602",
  "year": 2008,
  "badges": [],
  "abstract": "When exploring a topic as intangible as the construction of mobile social networks it is necessary to look at how relationships are formed and at the way users identify themselves through their interactions. The theoretically informed discourses within cultural theory make an ideal lens for understanding these subtle nuances of use in terms of design. This paper describes a case study where the application of abstract cultural theory concepts to the practical act of analysing qualitative data from a user study resulted in the development of The Swarm mobile phone prototypes. By signposting the intersection of cultural theory within HCI, the value of a philosophically grounded mobile phone design space is highlighted. To uncover reactions to the design we explored the blogs that sprung up critiquing an online version of The Swarm and in doing so, discovered the at times subversive values (such as the need to lie) that users place on their mobile mediated interactions.",
  "authors": [
    {
      "name": "Christine Satchell",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81350582064/rel-imgonly/safe_cities_youtube.jpg",
      "acmid": "81350582064",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agre, P. 1997. Computation and human experience. Cambridge: Cambridge University Press. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Barker, C. 2000. Cultural studies theory and practice. Sage Publications: London.",
      "doi": ""
    },
    {
      "text": "Barthes, R. 1977. Image-music-text. London: Fontana.",
      "doi": ""
    },
    {
      "text": "Baudrillard, J. 1981. Simulacra and simulation. (S. Glaser, Trans.) Ann Arbor, Michigan: University of Michigan Press.",
      "doi": ""
    },
    {
      "text": "Beyer, H. &amp; Holtzblatt, K. 1998. Contextual design: Defining customer-centered systems. San Francisco: Morgan Kaufmann. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Blythe, M., Overbeeke, K., Monk, A. &amp; Wright, C. (Eds.) 2003. Funology: From usability to enjoyment. Boston, MA: Kluwer Academic Publishers. ",
      "doi": "10.5555/1139008"
    },
    {
      "text": "Boehner, K., David, S., Kaye, J &amp; Sengers, P. Critical Technical Practice as a Methodology for Values in Design. Workshop on quality, value(s) and choice: exploring wider implications of HCI practice, CHI '04.",
      "doi": ""
    },
    {
      "text": "Cassell, J. (2002). Genderizing HCI. In. J. Jacko &amp; A. Sears (Eds.) The handbook of human-computer interaction. Mahwah, NJ: Lawrence Erlbaum, 402--411.",
      "doi": ""
    },
    {
      "text": "De Fleur, M. L., &amp; Dennis, E. E. 1994. Understanding mass communication. (5th ed.). Boston: Houghton Mifflin.",
      "doi": ""
    },
    {
      "text": "De Souza, C. 2005. The semiotic engineering of human computer interaction. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Deleuze, G., &amp; Guattari, F. 1967. A thousand plateaus: Capitalism and schizophrenia. Minnesota: Thousand Oaks Press.",
      "doi": ""
    },
    {
      "text": "Derrida, J. 1985. Letter to A Japanese friend. Derrida and difference. (Eds). Wood, D. &amp; Bernasconi R. Warwick: Parousia.",
      "doi": ""
    },
    {
      "text": "De Souza, C. 2005. The semiotic engineering of human computer interaction. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Finlay, J., Sengers, P. &amp; Wright, P. Reflective HCI: towards a critical technical practice. In Extended Abstracts, CHI '04.  ",
      "doi": "10.1145/985921.986203"
    },
    {
      "text": "Dourish, P. Re-spaceing place: \"place\" and \"space\" ten years on. CSCW '06. ACM Press, New York, NY, 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Eagleton, T. 2003. After Theory. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T. &amp; Pacenti, E. (1999). Cultural probes. Interactions 6 (1), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Gaver, B., Dunne, T. &amp; Pacenti, E. Designing for interpretation. Proc. HCI International '05.",
      "doi": ""
    },
    {
      "text": "Giddens, A. 1991. Modernity and self-identity: Self and society in the late modern age. Stanford CA: Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Glaser, B. 1992. Basics of grounded theory analysis. Mill Valley, CA: Sociology Press.",
      "doi": ""
    },
    {
      "text": "Goffman, E. 1959. The Presentation of self in everyday life. London: Penguin.",
      "doi": ""
    },
    {
      "text": "Graham, C., Cheverst, K. &amp; Rouncefield, M. Whose probe is it anyway? Workshop on appropriate methods for design in complex and sensitive settings, OZCHI'05.",
      "doi": ""
    },
    {
      "text": "Haraway, D. 1991. A cyborg manifesto: science, technology and socialist-feminism in the late twentieth century, in Simians, cyborgs and women: The reinvention of nature. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "Hebdige, D. 1979. Subculture: the meaning of style. Methuen, London.",
      "doi": ""
    },
    {
      "text": "Jacucci, G., Oulasvirta, A., Ilmonen, T., Evans, J. &amp; Salovaara, A. Comedia: mobile group media for active spectatorship. Proc. CHI '07, ACM Press, New York, NY.  ",
      "doi": "10.1145/1240624.1240817"
    },
    {
      "text": "Laurel, B. (Ed.) 2003. Design research: Methods and perspectives. Cambridge, Massachusetts: MIT Press. ",
      "doi": "10.5555/971109"
    },
    {
      "text": "Minichello, V., Aroni R., Timewell, E. &amp; Alexander, L. 1995. In-depth interviewing: Researching people. Melbourne: Longman, 61--104",
      "doi": ""
    },
    {
      "text": "Plant, S. 2001. On the mobile: The effects of mobile telephones on social and individual life. Motorola. Inc. Retrieved August 27, 2001 from http://www.motorola.com/mot/doc/0/234_MotDoc.pdf",
      "doi": ""
    },
    {
      "text": "Poster, M. 2001. Cyberdemocracy: The Internet and the public sphere. In Trend, D. (Ed.). Reading digital culture. Malden, MA: Blackwell Publishers, 259--272.",
      "doi": ""
    },
    {
      "text": "Rheingold, H. 2002. Smart mobs: the next social revolution. Cambridge, MA: Perseus Publications. ",
      "doi": "10.5555/579424"
    },
    {
      "text": "Satchell, C. The Swarm: Facilitating fluidity and control in young peoples' use of mobile phones. Proc. OZCHI'03.",
      "doi": ""
    },
    {
      "text": "Satchell, C. &amp; Singh, S. The mobile phone as a globalising artefact. Proc. HCI International '05.",
      "doi": ""
    },
    {
      "text": "Satchell, C., Zic, J. &amp; Singh, S. Creating the ideal digital self. Workshop on pervasive image, capturing and sharing, Ubicomp '05.",
      "doi": ""
    },
    {
      "text": "Satchell, C. Cultural theory: from armchair critic to star performer. Proc. OZCHI '06, ACM Press, New York, NY.  ",
      "doi": "10.1145/1228175.1228211"
    },
    {
      "text": "Sengers P. &amp; Gaver, B. Designing for interpretation. Proc. HCI International '05.",
      "doi": ""
    },
    {
      "text": "Sengers, P. 1999. Practices for Machine Culture: A Case Study of Integrating Artificial Intelligence in Cultural Theory. Surfaces, VIII.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K., David, S. &amp; Kaye, J. Reflective design. CC '05. ACM Press, New York, NY, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Sengers, P., McCarthy, J. &amp; Dourish, P. Reflective HCI: articulating an agenda for critical practice. Extended Abstracts, CHI '06, ACM Press, New York, NY, 1683--1686.  ",
      "doi": "10.1145/1125451.1125762"
    },
    {
      "text": "Srinivasan, A., Compton, P., Malor, R., Edwards, G.,Sammut, C. &amp; Lazarus, L. Knowledge acquisition in context for a complex domain. Proc. European Knowledge Acquisition Workshop '91.",
      "doi": ""
    },
    {
      "text": "Silvert. Is iTunes the Answer to Music Piracy? Harvard Business School Working Knowledge. Retrieved 26th Aril, 2006 from http://hbswk.hbs.edu/archive/3882.html",
      "doi": ""
    },
    {
      "text": "Sherry, J., Mainwaring, S., Burrell, J., Beckwith, R. &amp; Salvador, T. 'This all together, hon?' Ubicomp in non-office work environments. Proc. Ubicomp'04.",
      "doi": ""
    },
    {
      "text": "Strauss, A. &amp; Corbin, J. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Newbury Park, CA: Sage Publications, 61--74.",
      "doi": ""
    },
    {
      "text": "Tanaka, A. &amp; Satchel, C. Malleable Swarm. DVD Proc. SIGGRAPH '05.",
      "doi": ""
    },
    {
      "text": "Turkle, S. 1995. Life on the Screen: Identity in the age of the Internet. New York: Simon &amp; Schuster. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Winograd, T. &amp; Flores, F. 1987. Understanding computers and cognition. Norwood, NJ: Ablex: Menlo Park, CA: Addison Wesley. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "Wray, S. 1999. On electronic civil disobedience. Proc. Socialist Scholars Conference. NewYork, NY.",
      "doi": ""
    },
    {
      "text": "Woodruff, A. &amp; Aoki, P. M. Push-to-talk social talk. CSCW '04, 409--441.  ",
      "doi": "10.1007/s10606-004-5060-x"
    }
  ]
}