{
  "doi": "10.1145/1357054.1357269",
  "title": "Tilt menu: using the 3D orientation information of pen devices to extend the selection capability of pen-based user interfaces",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1371-1380",
  "year": 2008,
  "badges": [],
  "abstract": "We present a new technique called 'Tilt Menu' for better extending selection capabilities of pen-based interfaces. The Tilt Menu is implemented by using 3D orientation information of pen devices while performing selection tasks. The Tilt Menu has the potential to aid traditional one-handed techniques as it simultaneously generates the secondary input (e.g., a command or parameter selection) while drawing/interacting with a pen tip without having to use the second hand or another device. We conduct two experiments to explore the performance of the Tilt Menu. In the first experiment, we analyze the effect of parameters of the Tilt Menu, such as the menu size and orientation of the item, on its usability. Results of the first experiment suggest some design guidelines for the Tilt Menu. In the second experiment, the Tilt Menu is compared to two types of techniques while performing connect-the-dot tasks using freeform drawing mechanism. Results of the second experiment show that the Tilt Menu perform better in comparison to the Tool Palette, and is as good as the Toolglass.",
  "tags": [
    "tilt menu",
    "orientation",
    "pen",
    "selection",
    "pen-based ui"
  ],
  "authors": [
    {
      "name": "Feng Tian",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106876",
      "orcid": "0000-0002-6598-419X"
    },
    {
      "name": "Lishuang Xu",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570033",
      "orcid": "missing"
    },
    {
      "name": "Hongan Wang",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100220294",
      "orcid": "0000-0002-9320-4920"
    },
    {
      "name": "Xiaolong Zhang",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491376",
      "orcid": "missing"
    },
    {
      "name": "Yuanyuan Liu",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659379464",
      "orcid": "missing"
    },
    {
      "name": "Vidya Setlur",
      "institution": "Nokia Research Palo Alto, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100609586",
      "orcid": "missing"
    },
    {
      "name": "Guozhong Dai",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100172122",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adobe Illustrator, http://www.adobe.com/products/illustrator/",
      "doi": ""
    },
    {
      "text": "Accot, J., Zhai, S., Beyond Fitts' Law: Models for Trajectory-Based HCI Tasks. In Proc. CHI 1997, ACM Press (1997), 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Arvo, J., Novins, K., Fluid Sketches: Continuous Recognition and Morphing of Simple Hand-Drawn Shapes. In Proc. UIST 2000, ACM Press (2000), 73--80.  ",
      "doi": "10.1145/354401.354413"
    },
    {
      "text": "Balakrishnan, R., Baudel, T., Kurtenbach, G., and Fitzmaurice, G., The Rockin'Mouse: integral 3D manipulation on a plane. In Proc. CHI 1997, ACM Press (1997), 311--318.  ",
      "doi": "10.1145/258549.258778"
    },
    {
      "text": "Balakrishnan, R., Hinckley, K., The role of kinesthetic reference frames in two-handed input performance. In Proc. UIST 1999, ACM Press (1999), 171--178.  ",
      "doi": "10.1145/320719.322599"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., Derose, T. D., Toolglass and magic lenses: The see-through interface. In Proc. SIGGRAPH 1993, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Callahan, J., Hopkins, D., Weiser, M., Shneiderman, B., An empirical comparison of pie vs. linear menus. In Proc. of CHI 1988, ACM Press (1988), 95--100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Fitzmaurice, G., Khan, A., Pieké, R., Buxton, W., Kurtenbach, G., Tracking menus. In Proc UIST 2003, ACM Press (2003), 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "Franke, K., The influence of physical and biomechanical processes on the ink trace methodological foundations for the forensic analysis of signatures, Ph.D. thesis, University of Groningen, The Netherlands, 2005.",
      "doi": ""
    },
    {
      "text": "Grossman T, Hinckley, K. Baudisch, P., Agrawala, M., Balakrishnan, R., Hover widgets: Using the tracking state to extend the capabilities of pen-operated devices. In Proc. CHI 2006, ACM Press (2006), 861--860.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Guimbretière, F., Winograd, T. FlowMenu: Combining command, text, and parameter entry. In Proc UIST 2000, ACM Press (2000). 213--216.  ",
      "doi": "10.1145/354401.354778"
    },
    {
      "text": "Guimbretière, F., Martin, A., Winograd, T., Benefits of merging command selection and direct manipulation. ACM TOCHI, 2005, 12 (3): 460--476.  ",
      "doi": "10.1145/1096737.1096742"
    },
    {
      "text": "Hinckley, K., Guimbretiere, F., Agrawala, M., Apitz, G., Chen, N., Phrasing techniques for multi-stroke selection gestures. GI, 147--154. ",
      "doi": "10.5555/1143079.1143104"
    },
    {
      "text": "Jacob, R.J.K., Deligiannidis, L., Morrison, S., A Software Model and Specification Language for Non-WIMP User Interfaces. ACM TOCHI, 1999, 6(1): 1--46.  ",
      "doi": "10.1145/310641.310642"
    },
    {
      "text": "Jagadeesh Babu V., Prashanth L., Raghunath Sharma R., Prabhakara Rao G.V., Bharath A., HMM-based Online Handwriting Recognition System for Telugu Symbols, In Proc. ICDAR 2007, 23--26 ",
      "doi": "10.5555/1304595.1304806"
    },
    {
      "text": "Kabbash, P., Buxton, W., Sellen, A., Two-handed input in a compound task. In Proc. CHI 1994, ACM Press (1994), 417--423.  ",
      "doi": "10.1145/191666.191808"
    },
    {
      "text": "Kurtenbach, G. Buxton, W., The limits of expert performance using hierarchical marking menus. In Proc. CHI 1992, ACM Press (1992), 482--487.  ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Kurtenbach, G., Sellen, A., Buxton, W., An empirical evaluation of some articulatory and cognitive aspects of \"marking menus\". Human Computer Interaction, 1993. 8(1): 1--23.",
      "doi": "10.1207/s15327051hci0801_1"
    },
    {
      "text": "Li, J., Zhang, X., Ao X., Dai G., Sketch recognition with continuous feedback based on incremental intention extraction, In Proc IUI 2005, ACM Press (2005), 145--150.  ",
      "doi": "10.1145/1040830.1040866"
    },
    {
      "text": "Li, Y., Hinckley, K., Guan Z., Landay, J.A., Experimental analysis of mode switching techniques in pen based user interfaces. In Proc. CHI 2005, ACM Press (2005), 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Odell, D., Davis, R., Smith, A., Wright, P. K., Toolglasses, Marking Menus, and Hotkeys: A Comparison of One and Two-Handed Command Selection Techniques, In Proc. GI 2004, 17--24. ",
      "doi": "10.5555/1006058.1006061"
    },
    {
      "text": "Partridge, K., Chatterjee, S., Want, R., TiltType: Accelerometer-supported text entry for very small devices, In Proc. CHI 2001, ACM Press (2001), 201--204.  ",
      "doi": "10.1145/571985.572013"
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G., and Barillot, E., Control menu: Execution and control in a single interactor. In Proc. CHI 2000, ACM Press (2000), 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Solidworks, http://www.solidworks.com",
      "doi": ""
    },
    {
      "text": "Ramos, G., Boulos, M., Balakrishnan, R. Pressure Widgets. In Proc. CHI 2004, ACM Press (2004), 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Ramos, G., Balakrishnan, R. Zliding: fluid zooming and sliding for high precision parameter manipulation. In Proc. UIST 2005, ACM Press (2005), 143--152.  ",
      "doi": "10.1145/1095034.1095059"
    },
    {
      "text": "Ramos, G., Balakrishnan, R. Pressure Marks. In Proc. CHI 2007, ACM Press (2007), 1375--1384.  ",
      "doi": "10.1145/1240624.1240834"
    },
    {
      "text": "Saund, E., Lank, E., Stylus input and editing without prior selection of mode. In Proc. UIST 2003, ACM Press (2003), 213--216.  ",
      "doi": "10.1145/964696.964720"
    },
    {
      "text": "Tandler, P., Prante, T., Using Incremental Gesture Recognition to Provide Immediate Feedback while Drawing Pen Gestures. In Proc. UIST 2001, ACM Press (2001), 18--25.",
      "doi": ""
    },
    {
      "text": "Tian, F., Ao, X., Wang, H., Setlur, V., Dai G., The Tilt Cursor: Enhancing Stimulus-Response Compatibility Based on 3D Orientation Cue of Pen Devices. In Proc. CHI 2007, ACM Press (2007), 303--306.  ",
      "doi": "10.1145/1240624.1240675"
    },
    {
      "text": "Wigdor, D., Balakrishnan, R. TiltText: Using Tilt. for Text Input to Mobile Phones. In Proc. UIST 2003. ACM Press (2003), 81--90.  ",
      "doi": "10.1145/964696.964705"
    },
    {
      "text": "Zhao, S., Agrawala, M., Hinckley, K., Zone and Polygon Menus: Using Relative Position to Increase the Breadth of Multi-Stroke Marking. Menus, In Proc. CHI 2006, ACM Press (2006), 1077--1086.  ",
      "doi": "10.1145/1124772.1124933"
    }
  ]
}