{
  "doi": "10.1145/1357054.1357227",
  "title": "Don't look now, but we've created a bureaucracy: the nature and roles of policies and rules in wikipedia",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1101-1110",
  "year": 2008,
  "badges": [],
  "abstract": "Wikis are sites that support the development of emergent, collective infrastructures that are highly flexible and open, suggesting that the systems that use them will be egalitarian, free, and unstructured. Yet it is apparent that the flexible infrastructure of wikis allows the development and deployment of a wide range of structures. However, we find that the policies in Wikipedia and the systems and mechanisms that operate around them are multi-faceted. In this descriptive study, we draw on prior work on rules and policies in organizations to propose and apply a conceptual framework for understanding the natures and roles of policies in wikis. We conclude that wikis are capable of supporting a broader range of structures and activities than other collaborative platforms. Wikis allow for and, in fact, facilitate the creation of policies that serve a wide variety of functions.",
  "tags": [
    "collaboration",
    "policy",
    "wikis",
    "policies",
    "wikipedia",
    "dynamics",
    "rules",
    "community"
  ],
  "authors": [
    {
      "name": "Brian Butler",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100547938/rel-imgonly/81100547938.jpg",
      "acmid": "81100547938",
      "orcid": "missing"
    },
    {
      "name": "Elisabeth Joyce",
      "institution": "Edinboro University of Pennsylvania, Edinboro, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485327",
      "orcid": "missing"
    },
    {
      "name": "Jacqueline Pike",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567384",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahuja, M.K. and K.M. Carley, Network structure in virtual organizations. Organization Science, 1999. 10(6): p. 741--757.  ",
      "doi": "10.1287/orsc.10.6.741"
    },
    {
      "text": "Barreto, M. and N. Ellemers, The impact of anonymity and group identification on progroup behavior in computer-mediated groups. Small Group Research, 2002. 33(5): p. 590--610.",
      "doi": ""
    },
    {
      "text": "Baym, N., Interpreting soap operas and creating community: Inside a computer-mediate fan culture. Journal of Folklore Research, 1993. 30: p. 143--176.",
      "doi": ""
    },
    {
      "text": "Baym, N.K., Tune in, log on: Soaps, fandom, and online community. 2000, Thousand Oaks, CA: Sage Publications.",
      "doi": ""
    },
    {
      "text": "Bryant, S.L., A. Forte, and A. Bruckman, Becoming wikipedia: Transformation of participation in a collaborative online encyclopedia, in GROUP. 2005: Sanibel Island, FL.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Burnett, G. and L. Bonnici, Beyond the faq: Explicit and implicit norms in usenet newsgroups. Library &amp; Information Science Research, 2003. 25(3): p. 333.",
      "doi": ""
    },
    {
      "text": "Chidambaram, L. and L.L. Tung, Is out of sight, out of mind? An empirical study of social loafing in technology-supported groups. Information Systems Research, 2005. 16(2): p. 149--168.  ",
      "doi": "10.1287/isre.1050.0051"
    },
    {
      "text": "Cohen, N., Defending wikipedia's impolite side, in The New York TImes. 2007, The New York Times Company: New York, NY.",
      "doi": ""
    },
    {
      "text": "Connelly, T. and B.K. Thorn, Discretionary databases: Theory, data, and implications, in Organizations and communication technology, J. Fulk and C. Steinfield, Editors. 1990, Sage Publications: Newbury Park, CA. p. 219--233.",
      "doi": ""
    },
    {
      "text": "Fogel, K., Producing open source software: How to run a successful free software project 2005, Sebastopol, CA O'Reilly Media, Inc. ",
      "doi": "10.5555/1121560"
    },
    {
      "text": "Forte, A. and A. Bruckman, Why do people write for wikipedia? Incentives to contribute to open-content publishing, in Group 2005 Workshop - Sustaining Community: The role and design of incentive mechanisms in online systems. 2005: Sanibel Island, FL.",
      "doi": ""
    },
    {
      "text": "Galegher, J., L. Sproull, and S. Kiesler, Legitimacy, authority, and community in electronic support groups. Written Communication, 1998. 15(4): p. 493--530.",
      "doi": ""
    },
    {
      "text": "Hinds, P.J. and D.E. Bailey, Out of sight, out of sync: Understanding conflict in distributed teams. Organization Science, 2003. 14(6): p. 515--632.  ",
      "doi": "10.1287/orsc.14.6.615.24872"
    },
    {
      "text": "Hinds, P.J. and M. Mortensen, Understanding conflict in geographically distributed teams: The moderating effects of shared identity, shared context, and spontaneous communication. Organization Science, 2005. 16(3): p. 290--307.  ",
      "doi": "10.1287/orsc.1050.0122"
    },
    {
      "text": "Jensen, C. and W. Scacchi. Collaboration, leadership, control, and conflict negotiation in the netbeans.Org software development community. in Proceedings of the 38th Hawaii International Conference on System Sciences. 2005. Waikola Village, HI.  ",
      "doi": "10.1109/HICSS.2005.147"
    },
    {
      "text": "Jensen, C. and W. Scacchi. Role migration and advancement processes in ossd projects: A comparative case study. in Proceedings of the 27th International Conference on Software Engineerring. 2007. Minneapolis, MN.  ",
      "doi": "10.1109/ICSE.2007.74"
    },
    {
      "text": "Jones, Q., G. Ravid, and S. Rafaeli, Information overload and the message dynamics of online interaction spaces: A theoretical model and empirical exploration. Information Systems Research, 2004. 15(2): p. 194--210.  ",
      "doi": "10.1287/isre.1040.0023"
    },
    {
      "text": "Kennedy, H., Beyond anonymity, or future directions for internet identity research. New Media &amp; Society, 2006. 8(6): p. 859--876.",
      "doi": ""
    },
    {
      "text": "Kim, A.J., Community building on the web: Secret strategies for successful online communities. 1 ed. 2000, Berkeley, CA Peachpit Press. ",
      "doi": "10.5555/518514"
    },
    {
      "text": "Kirsch, L.J., Portfolios of control modes and is project management. Information Systems Research, 1997. 8(3): p. 215--239.",
      "doi": ""
    },
    {
      "text": "Kirsch, L.J., et al., Controlling information systems development projects: The view from the client. Management Science, 2002. 48(4): p. 484--498.  ",
      "doi": "10.5555/2839449.2839452"
    },
    {
      "text": "Kittur, A., et al., Power of the few vs. Wisdom of the crowd: Wikipedia and the rise of the bourgeoisie, in Conference on Human Factors in Computing Systems (CHI). 2007: San Jose, CA.",
      "doi": ""
    },
    {
      "text": "Kittur, A., et al., He says, she says: Conflict and coordination in wikipedia, in Conference on Human Factors in Computing Systems (CHI). 2007: San Jose, CA.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Kollock, P. and M. Smith, Managing the virtual commons: Cooperation and conflict in computer communities, in Computer--mediated communication: Linguistic, social and cross-cultural perspectives, S. Herring, Editor. 1996, John Benjamins: Amsterdam. p. 109--128.",
      "doi": ""
    },
    {
      "text": "Kuechler, W.L. and C. Vaishnavi, So, talk to me: The effect of explicit goals on the comprehension of business process narratives. MIS Quarterly, 2006. 30(4): p. 961--A16. ",
      "doi": "10.5555/2017317.2017326"
    },
    {
      "text": "Lakhani, K.R. and E. von Hippel, How open source software works: \"Free\" User-to-user assistance. Research Policy, 2003. 32(6): p. 923--943.",
      "doi": ""
    },
    {
      "text": "Malone, T., W. and K. Crowston, The interdisciplinary study of coordination. ACM Computing Surveys, 1994. 26(1): p. 87--119.  ",
      "doi": "10.1145/174666.174668"
    },
    {
      "text": "Maney, K., Mass collaboration could change way companies operate, in USA Today. 2006.",
      "doi": ""
    },
    {
      "text": "March, J.G., M. Schulz, and X. Zhou, The dynamics of rules: Change in written organizational codes. 2000, Stanford, CA: Stanford University Press.",
      "doi": ""
    },
    {
      "text": "McKenna, K.Y.A. and J.A. Bargh, Coming out in the age of the internet: Identity \"Demarginalization\" Through virtual group participation. Journal of Personality &amp; Social Psychology. 75(3): p. 681.",
      "doi": ""
    },
    {
      "text": "Nidumolu, S.R. and M.R. Subramani, The matrix of control: Combining process and structure approaches to managing software development. Journal of Management Information Systems, 2003. 20(Issue 3): p. 159. ",
      "doi": "10.1080/07421222.2003.11045774"
    },
    {
      "text": "Ostrom, E., Collective action and the evolution of social norms. Journal of Economic Perspectives, 2000. 14(3): p. 137--158.",
      "doi": ""
    },
    {
      "text": "Petronio, S., The boundaries of privacy: Praxis of everyday life, in Balancing the secrets of private disclosures, S. Petronio, Editor. 2000, Lawrence Erlbaum Associates: Mahwah, N. J. p. 37--50.",
      "doi": ""
    },
    {
      "text": "Petronio, S., et al., (mis)communicating across boundaries. Communication Research, 1998: p. 571--595.",
      "doi": ""
    },
    {
      "text": "Raymond, E., The cathedral and the bazaar. Knowledge and Policy, 1999. 12(3). ",
      "doi": "10.5555/580808"
    },
    {
      "text": "Ren, Y., R.E. Kraut, and S. Kiesler, Applying common identity and bond theory to the design of online communities. In press, 2006.",
      "doi": ""
    },
    {
      "text": "Riva, G. and C. Galimberti, Computer-mediated communication: Identity and social interaction in an electronic environment. Genetic, Social &amp; General Psychology Monographs, 1998. 124(4): p. 434--463.",
      "doi": ""
    },
    {
      "text": "Roberts, J.A., I.-H. Hann, and S.A. Slaughter, Understanding the motivations, participation, and performance of open source software developers: A longitudinal study of the apache projects. Management Science, 2006. 52(7): p. 984--999.  ",
      "doi": "10.1287/mnsc.1060.0554"
    },
    {
      "text": "Simon, H., Bounded rationality and organizational learning. Organization Science, 1991. 2(1): p. 125--134.",
      "doi": "10.1287/orsc.2.1.125"
    },
    {
      "text": "Slaughter, S.A. and L.J. Kirsch, The effectiveness of knowledge transfer portfolios on software process improvement: A field study. Information Systems Research, 2006. 17(3): p. 301--320.  ",
      "doi": "10.1287/isre.1060.0098"
    },
    {
      "text": "Stewart, K.J. and S. Gosain, The impact of ideology on effectiveness in open source software development teams. MIS Quarterly, 2006. 30(2): p. 291--314. ",
      "doi": "10.5555/2017307.2017313"
    },
    {
      "text": "Viegas, F., M. Wattenberg, and K. Dave, Studying cooperation and conflict between authors with history flow visualizations, in Conference on Human Factors in Computing Systems (CHI). 2004: Vienna, Austria.  ",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "Viegas, F.B., et al. Talk before you type: Coordination in wikipedia. in Proceedings of the 40th Hawaii International Conference on System Sciences. 2007. Big Island, HI.  ",
      "doi": "10.1109/HICSS.2007.511"
    },
    {
      "text": "von Krogh, G., S. Spaeth, and K.R. Lakhani, Community, joining, and specialization in open source software innovation: A case study. Research Policy, 2003. 32(7): p. 1217--1241.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Ignore all rules. 2006, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Wikipedia talk:Biographies of living persons 2007, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Wikipedia talk:Copyrights 2007, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Wikipedia: Policies and guidelines. 2007, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Wikipedia:Consensus. 2007, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Wikipedia:Criteria for speedy deletion. 2007, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors, Wikipedia:Neutral point of view. 2007, Wikipedia, The Free Encyclopedia.",
      "doi": ""
    },
    {
      "text": "Zhang, X.M. and F. Zhu, Intrinsic motivation of open content contributors: The case of wikipedia, in Workshop on Information Systems and Economics. 2006: Evanston, IL.",
      "doi": ""
    },
    {
      "text": "Zlati?, V., et al., Wikipedias: Collaborative web-based encyclopedias as complex networks. Physical Review, 2006. 74(016115).",
      "doi": ""
    }
  ]
}