{
  "doi": "10.1145/1357054.1357332",
  "title": "Idea navigation: structured browsing for unstructured text",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1789-1792",
  "year": 2008,
  "badges": [],
  "abstract": "Traditional interfaces for information access do not fully support queries that rely on semantic relationships between terms. To better support such queries, we introduce a system that automatically extracts subject-verb-object concepts from unstructured text documents and dynamically presents them to the user as navigable refinements. This approach, which we call \"idea navigation,\" makes subject-verb-object querying as simple as selecting successive refinements. It also supports exploratory search by providing a view of the most common ideas in the current result set. First-time users of a prototype system successfully used idea navigation to solve realistic search tasks, demonstrating its effectiveness.",
  "authors": [
    {
      "name": "Robin Stewart",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538037756",
      "orcid": "missing"
    },
    {
      "name": "Gregory Scott",
      "institution": "Tufts University, Medford, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545609856",
      "orcid": "missing"
    },
    {
      "name": "Vladimir Zelevinsky",
      "institution": "Endeca, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350595344",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "White, R. W., Kules, B., Drucker, S. M., schraefel, m. c. (2006) Supporting Exploratory Search, Introduction, Special Issue. In Communications of the ACM 49(4), pp. 36--39.  ",
      "doi": "10.1145/1121949.1121978"
    },
    {
      "text": "Hearst, M., English, J., Sinha, R., Swearingen, K., and Yee, K.-P. (2002) Finding the Flow in Web Site Search. In Communications of the ACM 45(9), pp. 42--49.  ",
      "doi": "10.1145/567498.567525"
    },
    {
      "text": "Wilson, M., schraefel, m.c., White, R. (2007) Evaluating advanced interfaces using established information-seeking models. Technical Report, School of Electronics and Computer Science, University of Southampton. http://eprints.ecs.soton.ac.uk/13737/",
      "doi": ""
    },
    {
      "text": "Katz, B., Lin, J. (2003) Selectively Using Relations to Improve Precision in Question Answering. In Proc. EACL 2003 Workshop on Natural Language Processing for Question Answering.",
      "doi": ""
    },
    {
      "text": "http://www.powerset.com/",
      "doi": ""
    },
    {
      "text": "Bast, H., Chitea, A., Suchanek, F., Weber, I. (2007) ESTER: Efficient Search on Text, Entities, and Relations. In Proc. SIGIR 2007, ACM Press, pp. 671--678.  ",
      "doi": "10.1145/1277741.1277856"
    },
    {
      "text": "http://nlp.stanford.edu/software/lex-parser.shtml",
      "doi": ""
    },
    {
      "text": "http://www.alias-i.com/lingpipe/",
      "doi": ""
    },
    {
      "text": "http://wordnet.princeton.edu/",
      "doi": ""
    },
    {
      "text": "http://www.endeca.com/",
      "doi": ""
    }
  ]
}