{
  "doi": "10.1145/1357054.1357232",
  "title": "Topobo in the wild: longitudinal evaluations of educators appropriating a tangible interface",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1129-1138",
  "year": 2008,
  "badges": [],
  "abstract": "What issues arise when designing and deploying tangibles for learning in long term evaluations? This paper reports on a series of studies in which the Topobo system, a 3D tangible construction kit with the ability to record and playback motion, was provided to educators and designers to use over extended periods of time in the context of their day-to-day work. Tangibles for learning - like all educational materials - must be evaluated in relation both to the student and the teacher, but most studies of tangibles for learning focus on the student as user. Here, we focus on the conception of the educator, and their use of the tangible interface in the absence of an inventor or HCI researcher. The results of this study identify design and pedagogical issues that arise in response to distribution of a tangible for learning in different educational environments.",
  "authors": [
    {
      "name": "Amanda J. Parkes",
      "institution": "Massachusetts Institute of Technology (MIT) Media Lab, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100008987",
      "orcid": "missing"
    },
    {
      "name": "Hayes Solos Raffle",
      "institution": "Massachusetts Institute of Technology (MIT) Media Lab, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100381813",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusetts Institute of Technology (MIT) Media Lab, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Arduino Programming Environment: http://www.arduino.cc/",
      "doi": ""
    },
    {
      "text": "Exploratorium Museum: http://www.exploratorium.edu",
      "doi": ""
    },
    {
      "text": "Frei, Su, Mikhak and Ishii. curlybot: Designing a New Class of Computational Toys. Proc. CHI 2000. ACM Press (2000).  ",
      "doi": "10.1145/332040.332416"
    },
    {
      "text": "iCampus: http://icampus.mit.edu/",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. Proceedings of CHI'97, ACM Press, (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Muybridge, E., Man Walking on Inclined Plane: http://texaschapbookpress.com/muybridgeincline.htm",
      "doi": ""
    },
    {
      "text": "O'Malley, C. and Fraser, D. S. Literature Review in Learning with Tangible Technologies. NESTA Futurelab Report 12 (2005).",
      "doi": ""
    },
    {
      "text": "Papert, S. Mindstorms: Children Computers and Powerful Ideas. Cambridge, Massachusetts: Perseus Publishing, 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Piaget, Jean. The Grasp of Consciousness. Cambridge: Harvard University Press, 1976.",
      "doi": ""
    },
    {
      "text": "Raffle, H. Parkes, A. Ishii, H. Topobo: A Constructive Assembly System with Kinetic Memory. Proceedings of CHI 04. ACM Press, (2004), 869--877.  ",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Resnick, Martin, Berg, et al. Digital Manipulatives: New Toys to Think With. Paper Session, Proc. CHI1998, ACM Press, (1998) 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Rode, J.A., Stringer, M., Toye, E., Simpson, A.R. and Blackwell, A.Curriculum focused design. In Proceedings ACM Interaction Design and Children, ACM Press (2003). pp. 119--126.  ",
      "doi": "10.1145/953536.953553"
    },
    {
      "text": "Salomon, G. Technology's Promises and Dangers in a Psychological and Educational Context. Theory into Practice, Vol. 37 No. 1 (Winter 1998).",
      "doi": ""
    },
    {
      "text": "Wyeth, P., &amp; Purchase, H. C. (2002) Tangible Programming Elements for Young Children. Extended Abstracts, of CHI2002, ACM Press (2002).  ",
      "doi": "10.1145/506443.506591"
    },
    {
      "text": "Yvonne Rogers, Victoria Bellotti, Grounding blue-sky research: how can ethnography help?, interactions, v.4 n.3, p.58--63, May/June 1997.  ",
      "doi": "10.1145/255392.255404"
    }
  ]
}