{
  "doi": "10.1145/1357054.1357210",
  "title": "Query suggestions for mobile search: understanding usage patterns",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1013-1016",
  "year": 2008,
  "badges": [],
  "abstract": "Entering search terms on mobile phones is a time consuming and cumbersome task. In this paper, we explore the usage patterns of query entry interfaces that display suggestions. Our primary goal is to build a usage model of query suggestions in order to provide user interface guidelines for mobile text prediction interfaces. We find that users who were asked to enter queries on a search interface with query suggestions rated their workload lower and their enjoyment higher. They also saved, on average, approximately half of the key presses compared to users who were not shown suggestions, despite no associated decrease in time to enter a query. Surprisingly, users also accepted suggestions when the process of doing so resulted in an increase in the number of total key presses.",
  "authors": [
    {
      "name": "Maryam Kamvar",
      "institution": "GoogleInc./Columbia University, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484362",
      "orcid": "missing"
    },
    {
      "name": "Shumeet Baluja",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408603160",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kamvar, M., Baluja, S. Deciphering Trends in Mobile Search. Computer. vol.40, no.8. IEEE (Aug 2007), 58--62.  ",
      "doi": "10.1109/MC.2007.270"
    },
    {
      "text": "MacKenzie, I.S., Kober, H., Smith, D., Skepner, E. LetterWise: prefix-based disambiguation for mobile text input. Proc. UIST 2001,  ",
      "doi": "10.1145/502348.502365"
    },
    {
      "text": "Hart, S.G., Staveland, L.E. Development of NASA-TLX Results of empirical and theoretical research. Human Mental Workload. (1988)",
      "doi": ""
    },
    {
      "text": "Kamvar, M., Baluja, S. A Large Scale Study of Wireless Search Patterns. Proc. CHI 2006, ACM (2006), 701--709.  ",
      "doi": "10.1145/1124772.1124877"
    },
    {
      "text": "Google Suggest. http://labs.google.com/suggest.",
      "doi": ""
    },
    {
      "text": "Garay-Vitoria, N., Abascal, J. Text Prediction Systems: a survey. Univ Access Information Society vol 4. Springer-Verlag (2006), 188--20  ",
      "doi": "10.1007/s10209-005-0005-9"
    },
    {
      "text": "MacKenzie, I. S., Chen, J., &amp; Oniszczak, A. Unipad: Single-stroke text entry with language-based acceleration. NordiCHI 2006, 78--85.  ",
      "doi": "10.1145/1182475.1182484"
    }
  ]
}