{
  "doi": "10.1145/1357054.1357134",
  "title": "From awareness to repartee: sharing location within social groups",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "497-506",
  "year": 2008,
  "badges": [],
  "abstract": "This paper investigates emergent practices around 'microblogging', changing and sharing status within a social group. We present results from a trial of 'Connecto', a phone based status and location sharing application that allows a group to 'tag' areas and have individuals' locations shared automatically on a mobile phone. In use the system moved beyond being an awareness tool to a way of continuing the ongoing 'story' of conversations within the group. Through sharing status and location the system supported each groups' ongoing repartee - a site for social exchange, enjoyment and friendship.",
  "tags": [
    "location-awareness",
    "user studies",
    "mobile communication"
  ],
  "authors": [
    {
      "name": "Louise Barkhuus",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331488921",
      "orcid": "0000-0003-1306-249X"
    },
    {
      "name": "Barry Brown",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    },
    {
      "name": "Marek Bell",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100405925",
      "orcid": "missing"
    },
    {
      "name": "Scott Sherwood",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100522350",
      "orcid": "missing"
    },
    {
      "name": "Malcolm Hall",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100012107",
      "orcid": "missing"
    },
    {
      "name": "Matthew Chalmers",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100086432/rel-imgonly/matthewshead.jpg",
      "acmid": "81100086432",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barkhuus, L. and Dey, A. Location-Based Services for Mobile Telephony: a study of users' privacy concerns, In proceedings of Interact 2003, 709--712.",
      "doi": ""
    },
    {
      "text": "Bell, M., Chalmers, M., Barkhuus, L., Hall, M., Sherwood, S., Tennent, P., Brown, B., Rowland, D., and Benford, S. 2006. Interweaving mobile games with everyday life. In Proceedings of CHI '06. ACM Press, New York, NY, 417--426.  ",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Brown B., Chalmers, M., Bell, M., Macoll, I. and Hall, M. Sharing the Square: Collaborative Leisure on the City Streets. In Proceedings of ECSCW 2005, Paris, France. Kluwer, 427--429. ",
      "doi": "10.5555/1242029.1242051"
    },
    {
      "text": "Brown B., Taylor, A., Izadi, S., Sellen, A. and Kay, J. Locating Family Values: A Field Trial of the Whereabouts Clock. In Proceedings of UbiComp 2007. Insbruck, Austria. Springer, 354--371. ",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "Chen, M., Sohn, T., Chmelev, D., Haehnel, D., Hightower, J., Huges., J., LaMarca, A., Potter, F., Smith, I. and Varshavsky, A. Practical Metropolitan-Scale Positioning for GSM Phones. In Proceedings of UbiComp 2006, Springer (2006), 225--242.  ",
      "doi": "10.1007/11853565_14"
    },
    {
      "text": "Consolvo, S., Smith, I. E., Matthews, T., LaMarca, A., Tabert, J., and Powledge, P. 2005. Location disclosure to social relations: why, when, &amp; what people want to share. In Proceedings CHI '05. ACM Press, New York, NY, 81--90.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "DePaulo, B., Kashy, D., Kirkendol, S., Wyer, M. and Epstein. J. Lying in Everyday Life. Journal of Personality and Social Psychology. 70(5), 1996, 979--995. American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Dourish, P. and Chalmers, M. Running out of Space: Models of Information Navigation. Short paper presented at HCI'94, Glasgow, UK. 1994.",
      "doi": ""
    },
    {
      "text": "Disney Family Locator. http://disneymobile.go.com.",
      "doi": ""
    },
    {
      "text": "Ekahau: Ekahau: http://www.ekahau.com/",
      "doi": ""
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. 1959. University of Edinburgh Social Sciences Research Centre.",
      "doi": ""
    },
    {
      "text": "Harper, R., Lamming, M. and Newman, W. Locating Systems at Work: Implications for the Development of Active Badge Applications. Interacting With Computers, 4(3), 1992, 343--363.  ",
      "doi": "10.1016/0953-5438%2892%2990022-8"
    },
    {
      "text": "Harper, R., Palen, L. and Taylor, A. (eds.) The Inside Text. An Introduction. In The Inside Text - Social Cultural and Design Perspectives of SMS. Springer. 2005.",
      "doi": ""
    },
    {
      "text": "Iachello, G., Smith, I., Consolvo, S., Chen, M. and Abowd, G. D. Developing Privacy Guidelines for Social Location Disclosure Applications and Services. In Proceedings of SOUPS 2005, 65--76.  ",
      "doi": "10.1145/1073001.1073008"
    },
    {
      "text": "Iachello, G., Smith, I., Consolvo, S., Abowd, G. D., Hughes, J., Howard, J., Potter, F., Scott, J., Sohn, T., Hightower, J. and LaMarca, A. Control, Deception, and Communication: Evaluating the Deployment of a Location-Enhanced Messaging Service. In Proc. of UbiComp 2005. Springer (2005), 213--231.  ",
      "doi": "10.1007/11551201_13"
    },
    {
      "text": "Java, A., Song, X., Finin, T. and Tseng, B. Why We Twitter: Understanding Microblogging Usage and Communities. Procedings of the Joint 9th WEBKDD and 1st SNA-KDD Workshop 2007. August 2007.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Jensen, C., Potts, C. and Jensen, C. Privacy Practices of Internet Users: Self-report versus Observed Behavior. International Journal of Human Computer Studies, Volume 63, Issues 1-2, July 2005, 203--227.  ",
      "doi": "10.1016/j.ijhcs.2005.04.019"
    },
    {
      "text": "Khalil, A. and Connelly, K. 2006. Context-aware telephony: privacy preferences and sharing patterns. In Proceedings of CSCW '06. ACM Press, 469--478.  ",
      "doi": "10.1145/1180875.1180947"
    },
    {
      "text": "Kling, R., McKim, G., Fortuna, J. and King, A. Scientific Collaboratories as Socio-Technical Interaction Networks: A Theoretical Approach. In Proceedings of Americas Conference on Information Systems (Long Beach, CA). 2000.",
      "doi": ""
    },
    {
      "text": "Kopomaa, T. The Breakthrough of Text Messaging in Finland. In Harper, R., Palen, L. and Taylor, A. (eds.) The Inside Text. Springer. 2005.",
      "doi": ""
    },
    {
      "text": "LaMarca, A. Chawathe, Y., Consolvo, S., Hightower, J., Smith, I., Scott, J., Sohn, T., Howard, J., Hughes, J., Potter, F., Tabert, J., Powledge, J., Borriello, G. and Schilit, B. Place Lab: Device Positioning Using Radio Beacons in the Wild. In Proceedings of Pervasive 2005. Springer, 2005, 116--133.  ",
      "doi": "10.1007/11428572_8"
    },
    {
      "text": "LaMarca, A., Hightower, J., Smith, I. and Consolvo, S. Self-Mapping in 802.11 Location Systems. In Proceedings of UbiComp 2005. Springer, pp. 87--104.  ",
      "doi": "10.1007/11551201_6"
    },
    {
      "text": "Laasonen, K., Raento, M. and Toirvonen, H. Adaptive On-Device Location Recognition. In Proceedings of Pervasive. 2004, Springer, 287--304.",
      "doi": ""
    },
    {
      "text": "Lederer, S., Mankoff, J., Dey, A.K. \"Who Wants to Know What When? Privacy Preference Determinants in Ubiquitous Computing.\" In Extended Abstracts of CHI 2003, 724--725.  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "loopt. http://loopt.com",
      "doi": ""
    },
    {
      "text": "Mologogo. http://www.mologogo.com",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A., Petit, R., Raento, M. and Tiitta, S. On how users interpret and act upon mobile awareness cues. To appear in Human-Computer Interaction, Special issue on Awareness Systems.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Dourish, P. Unpacking \"Privacy\" for a Networked World. In Proceedings of CHI 2003. ACM Press, 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Raento, M., Oulasvirta, A., Petit, R. and Toivonen, H. ContextPhone: A Prototyping Platform for Context-Aware Mobile Applications. In IEEE Pervasive Computing. April-June 2005.  ",
      "doi": "10.1109/MPRV.2005.29"
    },
    {
      "text": "Sacks, H. Lectures on Conversation: Vols 1-2. 1995. Oxford: Basil Blackwell.",
      "doi": ""
    },
    {
      "text": "Simmel, G. (translation: Hughes, E.C), The Sociology of Sociability. The American Journal of Sociology, Vol. 55, No. 3 (Nov., 1949), 254--261.",
      "doi": ""
    },
    {
      "text": "Smith, I.E., Consolvo, S., LaMarca, A., Hightower, J. and Scott, J. Social Disclosure of Place: From Location technology to Communication Practices. Pervasive 2005, 134--151.  ",
      "doi": "10.1007/11428572_9"
    }
  ]
}