{
  "doi": "10.1145/1357054.1357265",
  "title": "FacetZoom: a continuous multi-scale widget for navigating hierarchical metadata",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1353-1356",
  "year": 2008,
  "badges": [],
  "abstract": "Faceted browsing is a promising way to incrementally refine data sets. Current approaches do not scale well in terms of screen size and have shortcomings in interacting with hierarchical facets. This paper introduces FacetZoom, a novel multi-scale widget combining facet browsing with zoomable user interfaces. Hierarchical facets are displayed as space-filling widgets which allow a fast traversal across all levels while simultaneously maintaining context. We contribute both a seamless continuous navigation and a quick tap-and-center interaction. Two prototypes are described which successfully apply the space-structuring widget to continuous, sampled data and an information collection. A formative user study of the latter indicates that the interface scales well to small screens. FacetZoom is versatile and offers consistent searching and browsing behaviors in a multitude of applications and device settings.",
  "tags": [
    "media management",
    "faceted metadata",
    "time navigation",
    "zoomable user interface",
    "interaction technique",
    "facet browsing"
  ],
  "authors": [
    {
      "name": "Raimund Dachselt",
      "institution": "Dresden University of Te hnology, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    },
    {
      "name": "Mathias Frisch",
      "institution": "Dresden University of Technology, Dresden, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100574683",
      "orcid": "missing"
    },
    {
      "name": "Markus Weiland",
      "institution": "Dresden University of Technology, Dresden, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572097",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Appert, C. and Fekete, J. OrthoZoom scroller: 1D multi-scale navigation. In Proc. CHI 2006, ACM Press, 21--30.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "Bederson, B.B., Clamage, A., Czerwinski, M.P., and Robertson, G.G. DateLens: A fisheye calendar interface for PDAs. Transactions on Computer-Human Interaction 11, 1 (2004), 90--119.  ",
      "doi": "10.1145/972648.972652"
    },
    {
      "text": "Dachselt, R. and Weiland, M. TimeZoom: a flexible detail and context timeline. In CHI 2006 Extended Abstracts, ACM Press (2006), 682--687.  ",
      "doi": "10.1145/1125451.1125590"
    },
    {
      "text": "Johnson, B. and Shneiderman, B. Treemaps: A Space Filling approach to the visualization of hierarchical information structures. In Proc. IEEE Visualization 1991, IEEE Computer Society Press (1991), 284--291. ",
      "doi": "10.5555/949607.949654"
    },
    {
      "text": "Karlson, A.K., Robertson, G.G., Robbins, D.C., Czerwinski, M.P., and Smith, G.R. FaThumb: a facet-based interface for mobile search. In Proc. CHI 2006, ACM Press (2006), 711--720.  ",
      "doi": "10.1145/1124772.1124878"
    },
    {
      "text": "Oren, E., Delbru, R., Decker, S. Extending faceted navigation for RDF data. In Proc. 5th International Semantic Web Conference, LNCS 4273 (2006).  ",
      "doi": "10.1007/11926078_40"
    },
    {
      "text": "Smith, G., Czerwinski, M., Meyers, B., Robbins, D., Robertson, G., Tan, D.S. FacetMap: A Scalable Search and Browse Visualization. IEEE Transactions on Visualization and Computer Graphics 12, 5 (2006), 797--804.  ",
      "doi": "10.1109/TVCG.2006.142"
    }
  ]
}