{
  "doi": "10.1145/1357054.1357082",
  "title": "WallCology: designing interaction affordances for learner engagement in authentic science inquiry",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "163-172",
  "year": 2008,
  "badges": [],
  "abstract": "The broadening array of technologies available to support the design of classroom activity has the potential to reshape science learning in schools. This paper presents a ubiquitous computing application, WallCology, which situates a virtual ecosystem within the unseen space of classroom walls, presenting affordances for science learners to engage in investigations of ecological phenomena. Motivated by a desire to foster authenticity in classroom science inquiry, WallCology extends the \"embedded phenomena\" framework in three ways: by enabling collaborative investigations among distributed work teams, by increasing the physicality of investigation activities, and by expanding the loci of activity sites. Pilot studies in two urban classrooms provide qualified support for the effectiveness of WallCology in promoting more authentic inquiry practices, content learning, and attitudes regarding scientific investigations.",
  "tags": [
    "embedded phenomena",
    "science inquiry learning",
    "ubiquitous computing"
  ],
  "authors": [
    {
      "name": "Tom Moher",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100538646",
      "orcid": "missing"
    },
    {
      "name": "Brian Uphoff",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385598153",
      "orcid": "missing"
    },
    {
      "name": "Darshan Bhatt",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385595807",
      "orcid": "missing"
    },
    {
      "name": "Brenda López Silva",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385596012",
      "orcid": "missing"
    },
    {
      "name": "Peter Malcolm",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385599502",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Association for the Advancement of Science. Science for All Americans. Washington, DC: AAAS, Inc., 1989.",
      "doi": ""
    },
    {
      "text": "Barab, S. A., Thomas, M. K., Dodge, T., Carteaux, R., Goodirch, T., Tuzun, H., and Misanchuk, M. Quest Atlantis: Creating a community-based, online, meta-game for learning. Proc. International Conference of the Learning Sciences (2002), 235--243.",
      "doi": ""
    },
    {
      "text": "Barron, M., Moher, T., and Maharry, J. RoomBugs: Simulating Insect Infestations in Elementary School Classrooms. Ext. Abstracts CHI 2006, ACM Press (2006), 315--320.  ",
      "doi": "10.1145/1125451.1125522"
    },
    {
      "text": "Brown, J. S., Collins, A. and Duguid, P. Situated cognition and the culture of learning. Educational Researcher 18, 1 (1989), 32--42.",
      "doi": ""
    },
    {
      "text": "Chinn, C. A., and Brewer, W. F. The role of anomalous data in knowledge acquisition: A theoretical framework and implications for science instruction. Review of Educational Research 63, 1 (1993), 1--49.",
      "doi": ""
    },
    {
      "text": "Chinn, C. A., and Malhotra, B. A. Epistemologically authentic reasoning in schools: A theoretical framework for evaluating inquiry tasks. Science Education 86, 2 (2002), 175--218.",
      "doi": ""
    },
    {
      "text": "Clancey, W. Situated Cognition: On Human Knowledge and Computer Representations. Cambridge, MA: Cambridge University Press. 1997. ",
      "doi": "10.5555/523074"
    },
    {
      "text": "Clark, A. Being There: Putting Brain Body and World Together Again. Cambridge, MA: MIT Press, 1997. ",
      "doi": "10.5555/524400"
    },
    {
      "text": "Dourish, P. Where The Action Is: The Foundations of Embodied Interaction, MIT Press, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Duschl, R. Making the nature of science explicit. In R. Millar, J. Leech & J. Osborne (Eds.) Improving Science Education: The contribution of research. Philadelphia: Open University Press, 2000, 187--206.",
      "doi": ""
    },
    {
      "text": "Facer, K., Joiner, D., Stanton, D., Reid, J., Hull, R., and Kirk, D. Savannah: mobile gaming and learning? Journal of Computer Assisted Learning 20, 6 (2004), 339--409.",
      "doi": ""
    },
    {
      "text": "Fraser, B. J. Development of a test of science-related attitudes. Science Education 62, 4 (1978), 509--515.",
      "doi": ""
    },
    {
      "text": "GLOBE (Global Learning and Observations to Benefit the Environment). http://www.globe.gov.",
      "doi": ""
    },
    {
      "text": "Greeno, J. The situativity of knowing, learning, and research. American Psychologist 53, 1 (1998), 5--26.",
      "doi": ""
    },
    {
      "text": "Hickey, D., Kindfield, A., Horwitz, P., and Christie, M. Integrating curriculum, instruction, assessment, and evaluation in a technology-supported genetics environment. American Educational Research Journal 40, 2 (2003), 495--538.",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. Proc. CHI 1997, ACM Press (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Johnson, M. L. The body in the mind: The bodily basis of meaning, imagination, and reason. Chicago University Press, Chicago, IL, USA, 1987.",
      "doi": ""
    },
    {
      "text": "Johnson, A. and Fotouhi, F. Sandbox: scientists assessing necessary data based on experimentation. interactions 2, 3 (1995), 34--45.  ",
      "doi": "10.1145/208666.208678"
    },
    {
      "text": "Johnson, A., Moher, T., Cho, Y., Edelson, D. and Reiser, B. Collecting Data and Looking for Patterns in a Virtual Field. Proc. IEEE VR 2002, IEEE Computer Society Press (2002), 281--283. ",
      "doi": "10.5555/580130.835873"
    },
    {
      "text": "Klopfer, E., Squire, K. and Jenkins, H. Environmental Detectives: PDAs as a window into a virtual simulated world. Proc. WMTE 2002, IEEE Computer Society Press (2002), 95--98. ",
      "doi": "10.5555/645964.674392"
    },
    {
      "text": "Lyons, L., Lee, J., Quintana, C., and Soloway, E. MUSHI: A Multi-Device Framework for Collaborative Inquiry Learning. Proc. ICLS 2006, Lawrence Erlbaum (2006), 453--459. ",
      "doi": "10.5555/1150034.1150100"
    },
    {
      "text": "Maxim Integrated Products: iButton. http://www.maxim-ic.com/products/ibutton/.",
      "doi": ""
    },
    {
      "text": "Moher, T. Embedded Phenomena: Supporting Science Learning with Classroom-sized Distributed Simulations. Proc. CHI 2006, ACM Press (2006), 691--700.  ",
      "doi": "10.1145/1124772.1124875"
    },
    {
      "text": "National Research Council. Inquiry and the national science education standards: A guide for teaching and learning. Washington, D.C.: National Academy Press, 2000.",
      "doi": ""
    },
    {
      "text": "Nelson, B., Ketelhut, D. J., Clarke, J., Bowman, C. and Dede, C. Design-based research strategies for developing a scientific inquiry curriculum in a multi-user virtual environment. Educational Technology 45, 1 (2005), 21--27.",
      "doi": ""
    },
    {
      "text": "Poole, R. W. An Introduction to Quantitative Ecology. McGraw-Hill, New York, NY, USA, 1974.",
      "doi": ""
    },
    {
      "text": "Price, S., Rogers, Y., Scaife, M., Stanton, D. and Neale. H. Using 'Tangibles' to promote novel forms of playful learning. Interacting with Computers 15, 2 (2003), 169--185.",
      "doi": ""
    },
    {
      "text": "Quintana, C., Reiser, B. J., Davis, E. A., Krajcik, J., Fretz, E., Duncan, R. G., Kyza, E., Edelson, D. and Soloway, E. A Scaffolding Design Framework for Software to Support Science Inquiry. The Journal of the Learning Sciences 13, 3 (2004), 337--386.",
      "doi": ""
    },
    {
      "text": "Randell, C., Ted Phelps, T. and Rogers, Y. Ambient Wood: Demonstration of a digitally enhanced field trip for schoolchildren. Proc. UbiComp 2003, IEEE Press (2003), 100--104.",
      "doi": ""
    },
    {
      "text": "Reiser, B. Scaffolding complex learning: The mechanisms of structuring and problematizing student work. The Journal of the Learning Sciences 13, 3 (2004), 273--304.",
      "doi": ""
    },
    {
      "text": "Rogers, Y. Moving on from Weiser's Vision of Calm Computing: Engaging UbiComp Experiences. Proc. UbiComp 2006, IEEE Press (2006), 404--421.  ",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Rogoff, B. Apprenticeship in thinking: Cognitive development in social context. Oxford University Press, New York, NY, USA, 1990.",
      "doi": ""
    },
    {
      "text": "Smith, B. and Reiser, B. Explaining behavior using video for observational inquiry and theory articulation. The Journal of the Learning Sciences 14, 2 (2005), 315--360.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Guzdial, M. and Hay, K. E. Learner-Centered Design: The Challenge for HCI in the 21st Century. interactions 1, 2 (1994), 36--48.  ",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "Tennenhouse, D.L. Proactive Computing. Communications of the ACM 43, 5 (2000), 43--50.  ",
      "doi": "10.1145/332833.332837"
    },
    {
      "text": "Thelen, E. Time-scale dynamics in the development of an embodied cognition. In R.F. Port and T. van Gelder (Eds.) Mind as Motion: Explorations in the Dynamics of Cognition, MIT Press, Cambridge, MA, USA, 1995, 69--100. ",
      "doi": "10.5555/225765.225771"
    },
    {
      "text": "Thompson, M. and Moher, T. HelioRoom: Problem-solving in a whole class visual simulation. Proc. ICLS 2006, Lawrence Erlbaum (2006), 1000--1001. ",
      "doi": "10.5555/1150034.1150219"
    },
    {
      "text": "Trolley Scan (Pty) Ltd. http://www.rfid-radar.com.",
      "doi": ""
    },
    {
      "text": "Weiser, M. and Brown, J.S. The coming age of calm technology. In P. Denning and R. Metcalfe (Eds.) Beyond Calculations: the Next Fifty Years, Copernicus, New York, NY, USA, 1997, 75--85. ",
      "doi": "10.5555/504928.504934"
    },
    {
      "text": "Wenger, E. Communities of practice. Cambridge University Press, New York, NY, USA, 1998.",
      "doi": ""
    },
    {
      "text": "Winn, W.D. Learning in artificial environments: Embodiment, embeddedness and dynamic adaptation. Technology, Instruction, Cognition and Learning 1, 1 (2003), 87--114.",
      "doi": ""
    },
    {
      "text": "Wisneski, C., lshii, H., Dahley, A., Gorbet, M., Brave, S., Ullmer, B. and Yarin, P. Ambient displays: Turning architectural space into an interface between people and digital information. Proceedings of the First International Workshop on Cooperative Buildings, Integrating Information, Organization, and Architecture, Springer-Verlag (1998), 22--32. ",
      "doi": "10.5555/645968.674740"
    }
  ]
}