{
  "doi": "10.1145/1357054.1357200",
  "title": "Impromptu: a new interaction framework for supporting collaboration in multiple display environments and its field evaluation for co-located software development",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "939-948",
  "year": 2008,
  "badges": [],
  "abstract": "We present a new interaction framework for collaborating in multiple display environments (MDEs) and report results from a field study investigating its use in an authentic work setting. Our interaction framework, IMPROMPTU, allows users to share task information across displays via off-the-shelf applications, to jointly interact with information for focused problem solving and to place information on shared displays for discussion and reflection. Our framework also includes a lightweight interface for performing these and related actions. A three week field study of our framework was conducted in the domain of face-to-face group software development. Results show that teams utilized almost every feature of the framework in support of a wide range of development-related activities. The framework was used most to facilitate opportunistic collaboration involving task information. Teams reported wanting to continue using the framework as they found value in it overall.",
  "authors": [
    {
      "name": "Jacob T. Biehl",
      "institution": "University of Illinois, Urbana, IL, USA",
      "img": "/do/10.1145/contrib-81100607745/rel-imgonly/me.jpg",
      "acmid": "81100607745",
      "orcid": "missing"
    },
    {
      "name": "William T. Baker",
      "institution": "University of Illinois, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350573453",
      "orcid": "missing"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    },
    {
      "name": "Desney S. Tan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Kori M. Inkpen",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Mary Czerwinski",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100280834/rel-imgonly/marycz.jpg",
      "acmid": "81100280834",
      "orcid": "0000-0003-0881-401X"
    }
  ],
  "references": [
    {
      "text": "CVS -- Concurrent Versions System. Retrieved January 3, 2008 from: http://www.nongnu.org/cvs/",
      "doi": ""
    },
    {
      "text": "Microsoft Office LiveMeeting. Retrieved January 3, 2008 from: http://office.microsoft.com/livemeeting/",
      "doi": ""
    },
    {
      "text": "Subversion Project. Retrieved January 3, 2008 from: http://subversion.tigris.org/",
      "doi": ""
    },
    {
      "text": "Benford, S., et.al. Designing Storytelling Technologies to Encourage Collaboration between Young Children. Proc. CHI, 2000, 556--563.  ",
      "doi": "10.1145/332040.332502"
    },
    {
      "text": "Biehl, J.T. and B.P. Bailey. ARIS: An Interface for Application Relocation in an Interactive Space. Proc. Graphics Interface, 2004, 107--116. ",
      "doi": "10.5555/1006058.1006072"
    },
    {
      "text": "Biehl, J.T. and B.P. Bailey. Improving Interfaces for Managing Applications in Multiple--Device Environments. Proc. Advanced Visual Interfaces (AVI), 2006, 35--42.  ",
      "doi": "10.1145/1133265.1133273"
    },
    {
      "text": "Biehl, J.T., M. Czerwinski, G. Smith and G.G. Robertson. FASTDash: A Visual Dashboard for Fostering Awareness in Software Teams. Proc. CHI, 2007, 1313--1322.  ",
      "doi": "10.1145/1240624.1240823"
    },
    {
      "text": "Booth, K.S., B.D. Fisher, C.J.R. Lin and R. Argue. The 'Mighty Mouse' Multi-Screen Collaboration Tool. Proc. UIST, 2002, 209--212.  ",
      "doi": "10.1145/571985.572016"
    },
    {
      "text": "Cheng, L.-T., S. Hupfer, S. Ross and J. Patterson. Jazzing up Eclipse with Collaborative Tools. Proc. OOPSLA Workshop on Eclipse Technology eXchange, 2003, 45--49.  ",
      "doi": "10.1145/965660.965670"
    },
    {
      "text": "Cohen, J. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement, 20 37--46.",
      "doi": ""
    },
    {
      "text": "d'Astous, P., F. Détienne, P.N. Robillard and W. Visser. Types of Dialogs in Evaluation Meetings: An Analysis of Technical-Review Meetings in Software Development. Proc. Conference on the Design of Cooperative Systems, 1998, 25--33.",
      "doi": ""
    },
    {
      "text": "Elwart-Keys, M., D. Halonen, M. Horton, R. Kass and P. Scott. User Interface Requirements for Face to Face Groupware. Proc. CHI, 1990, 295--301.  ",
      "doi": "10.1145/97243.97299"
    },
    {
      "text": "Forsyth, D.R. Group Dynamics. Wadsworth Publishing Company, Belmont, CA, 1999.",
      "doi": ""
    },
    {
      "text": "Froehlich, J. and P. Dourish. Unifying Artifacts and Activities in a Visual Tool for Distributed Software Development Teams. Proc. ICSE, 2004, 387--396. ",
      "doi": "10.5555/998675.999443"
    },
    {
      "text": "Grudin, J. Computer-Supported Cooperative Work: History and Focus. Computer (May): 19--26.  ",
      "doi": "10.1109/2.291294"
    },
    {
      "text": "Gutwin, C. and S. Greenberg. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Journal of Computer-Supported Cooperative Work (3-4): 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Ha, V., K. Inkpen, J. Wallace and R. Ziola. Swordfish: User Tailored Workspaces in Multi-Display Environments. Extended Abstracts CHI, 2006, 1487--1492.  ",
      "doi": "10.1145/1125451.1125724"
    },
    {
      "text": "Izadi, S., H. Brignull, T. Rodden, Y. Rogers and M. Underwood. Dynamo: A Public Interactive Surface Supporting the Cooperative Sharing and Exchange of Media. Proc. UIST, 2003, 159--168.  ",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Johanson, B., A. Fox and T. Winograd. The Interactive Workspaces Project: Experiences with Ubiquitous Computing Rooms. IEEE Pervasive Computing, 1 (2): 67--74.  ",
      "doi": "10.1109/MPRV.2002.1012339"
    },
    {
      "text": "Johanson, B., G. Hutchins, T. Winograd and M. Stone. Pointright: Experience with Flexible Input Redirection in Interactive Workspaces. Proc. UIST, 2002, 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Layman, L., L. Williams and L. Cunningham. Exploring Extreme Programming in Context: An Industrial Case Study. Proc. IEEE Agile Development Conference, 2004, 32-- 41. ",
      "doi": "10.5555/1025113.1025140"
    },
    {
      "text": "Li, D. and J. Lu. A Lightweight Approach to Transparent Sharing of Familiar Single--User Editors. Proc. CSCW, 2006, 139--148.  ",
      "doi": "10.1145/1180875.1180896"
    },
    {
      "text": "Mandviwalla, M. and L. Olfman. What Do Groups Need? A Proposed Set of Generic Groupware Requirements. ACM Transactions on Computer-Human Interaction, 1 (3): 245--268.  ",
      "doi": "10.1145/196699.196715"
    },
    {
      "text": "Morris, M.R., K. Ryall, C. Shen, C. Forlines and F. Vernier. Beyond \"Social Protocols\": Multi-User Coordination Policies for Co-Located Groupware. Proc. CSCW, 2004, 262--265.  ",
      "doi": "10.1145/1031607.1031648"
    },
    {
      "text": "Nacenta, M.A., D. Aliakseyeu, S. Subramanian and C. Gutwin. A Comparison of Techniques for Multi-Display Reaching. Proc. CHI, 2005, 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Nosek, J.T. The Case for Collaborative Programming. Communications of the ACM, 41 (3): 105--108.  ",
      "doi": "10.1145/272287.272333"
    },
    {
      "text": "Rekimoto, J. and M. Saitoh. Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments. Proc. CHI, 1999, 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Sarma, A., Z. Noroozi and A.v.d. Hoek. Palantír: Raising Awareness among Configuration Management Workspaces. Proc. ICSE, 2003, 444--454. ",
      "doi": "10.5555/776816.776870"
    },
    {
      "text": "Schwaber, K. and M. Beedle. Agile Software Development with Scrum. Prentice Hall, Upper Saddle River, NJ, 2002. ",
      "doi": "10.5555/559553"
    },
    {
      "text": "Scott, S.D., K.D. Grant and R.L. Mandryk. System Guidelines for Co-Located Collaborative Work on a Tabletop Display. Proc. ECSCW, 2003, 159--178. ",
      "doi": "10.5555/1241889.1241898"
    },
    {
      "text": "Shen, C., K.M. Everitt and K. Ryall. Ubitable: Impromptu Face-to-Face Collaboration on Horizontal Interactive Surfaces. Proc. UbiComp, 2003, 281 -- 288.",
      "doi": ""
    },
    {
      "text": "Souza, C., D. Redmiles and P. Dourish. \"Breaking the Code\", Moving between Private and Public Work in Collaborative Software Development. Proc. CSCW, 2003, 105--114.  ",
      "doi": "10.1145/958160.958177"
    },
    {
      "text": "Stefik, M., D.G. Bobrow, G. Foster, S. Lanning and D. Tatar. Wysiwis Revised: Early Experiences with Multiuser Interfaces. ACM TOIS, 5 (2): 147--167.  ",
      "doi": "10.1145/27636.28056"
    },
    {
      "text": "Stefik, M., G. Foster, D.G. Bobrow, K. Kahn, S. Lanning and L. Suchman. Beyond the Chalkboard: Computer Support for Collaboration and Problem Solving in Meetings. Communications of the ACM, 30 (1): 32--47.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Steiner, I. Group Process and Productivity. Academic Press, New York, 1972.",
      "doi": ""
    },
    {
      "text": "Streitz, N.A., J. Giessler, T. Holmer, S. Konomi, C. Muller-Tomfelde, W. Reischl, P. Rexroth, P. Seitz and R. Steinmetz. I-Land: An Interactive Landscape for Creativity and Innovation. Proc. CHI, 1999, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Streitz, N.A., P. Rexroth and T. Holmer. Does Roomware Matter? Investigating the Role of Personal and Public Information Devices and Their Combination in Meeting Room Collaboration. Proc. ECSCW, 1997, 297--312. ",
      "doi": "10.5555/1241980.1242000"
    },
    {
      "text": "Tan, D.S., B. Meyers and M. Czerwinski. Wincuts: Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. Proc. CHI, 2004, 1525--1528.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Tee, K., S. Greenberg and C. Gutwin. Providing Artifact Awareness to a Distributed Group through Screen Sharing. Proc. CSCW, 2006, 99--108.  ",
      "doi": "10.1145/1180875.1180891"
    },
    {
      "text": "Wigdor, D., C. Shen, C. Forlines and R. Balakrishnan. Table-Centric Interactive Spaces for Real-Time Collaboration. Proc. Advanced Visual Interfaces (AVI), 2006, 103--107.  ",
      "doi": "10.1145/1133265.1133286"
    },
    {
      "text": "Williams, L., R. Kessler, W. Cunningham and R. Jeffries. Strengthening the Case for Pair Programming. IEEE Software, 17 (4): 19--25.  ",
      "doi": "10.1109/52.854064"
    },
    {
      "text": "Wu, J., T.C.N. Graham and P.W. Smith. A Study of Collaboration in Software Design. Proc. International Symposium on Empirical Software Engineering, 2003. ",
      "doi": "10.5555/942801.943624"
    },
    {
      "text": "Xia, S., D. Sun, C. Sun, D. Chen and H. Shen. Leveraging Single-User Applications for Multi-User Collaboration: The CoWord Approach. Proc. CSCW, 2004, 162--171.  ",
      "doi": "10.1145/1031607.1031635"
    }
  ]
}