{
  "doi": "10.1145/1357054.1357249",
  "title": "Impact of screen size on performance, awareness, and user satisfaction with adaptive graphical user interfaces",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1247-1256",
  "year": 2008,
  "badges": [],
  "abstract": "Adaptive personalization, where the system adapts the interface to a user's needs, has the potential for significant performance benefits on small screen devices. However, research on adaptive interfaces has almost exclusively focused on desktop displays. To explore how well previous findings generalize to small screen devices, we conducted a study with 36 subjects to compare adaptive interfaces for small and desktop-sized screens. Results show that high accuracy adaptive menus have an even larger positive impact on performance and satisfaction when screen real estate is constrained. The drawback of the high accuracy menus, however, is that they reduce the user's awareness of the full set of items in the interface, potentially making it more difficult for users to learn about new features.",
  "authors": [
    {
      "name": "Leah Findlater",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baddeley, A. The Psychology of Memory. Basic Books, New York, 1976.",
      "doi": ""
    },
    {
      "text": "Billsus, D., Brunk, C. A., Evans, C., Gladish, B., and Pazzani, M. 2002. Adaptive interfaces for ubiquitous web access. CACM 45, 5 (2002), 34--38.  ",
      "doi": "10.1145/506218.506240"
    },
    {
      "text": "Bridle, R., and McCreath, E. Inducing shortcuts on a mobile phone interface. Proc. IUI, (2006), 327--329.  ",
      "doi": "10.1145/1111449.1111526"
    },
    {
      "text": "Bunt, A., Conati, C., and McGrenere, J. Supporting interface customization using a mixed--initiative approach. Proc. Intelligent User Interfaces, (2007), 92--101.  ",
      "doi": "10.1145/1216295.1216317"
    },
    {
      "text": "Bunt, A. Mixed-Initiative Support for Customizing Graphical User Interfaces. Ph.D. Thesis, University of British Columbia, 2007. ",
      "doi": "10.5555/1369161"
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Greenberg, S. A predictive model of menu performance. Proc. CHI, (2007), 627--636.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Cohen, J. Eta-squared and partial eta-squared in communication science. Human Communication Research, 28, Oxford Journals, (1973), 473--490.",
      "doi": ""
    },
    {
      "text": "Debevc, M., Meyer, B., Donlagic, D., and Svecko, R. Design and evaluation of an adaptive icon toolbar. User modeling and user adapted interaction 6, 1(1994), 1--21.",
      "doi": ""
    },
    {
      "text": "Dillon, A., Richardson, J., and McKnight, C. The effects of display size and text splitting on reading length text from screen. Behaviour and Information Technology 9, 3(1990), 215--227.",
      "doi": ""
    },
    {
      "text": "Findlater, L. and McGrenere, J. A comparison of static, adaptive and adaptable menus. Proc. ACM CHI 2004, (2004), 89--96.  ",
      "doi": "10.1145/985692.985704"
    },
    {
      "text": "Findlater, L. and McGrenere, J. Evaluating reduced-functionality interfaces according to feature findability and awareness. Proc. IFIP Interact 2007, (2007), 592--605. ",
      "doi": "10.5555/1776994.1777071"
    },
    {
      "text": "Gajos, K., Christianson, D., Hoffmann, R., Shaked, R., Henning, K., Long, J.J., and Weld, D.S. Fast And Robust Interface Generation for Ubiquitous Applications. Proc. UBICOMP '05, 2005), 37--55.  ",
      "doi": "10.1007/11551201_3"
    },
    {
      "text": "Gajos, K. Z., Czerwinski, M., Tan, D. S., and Weld, D. S. Exploring the design space for adaptive graphical user interfaces. Proc. AVI '06, (2006), 201--208.  ",
      "doi": "10.1145/1133265.1133306"
    },
    {
      "text": "Greenberg, S. The computer user as toolsmith: The use, reuse, and organization of computer-based tools. Cambridge: Cambridge University Press, 1993. ",
      "doi": "10.5555/151147"
    },
    {
      "text": "Greenberg, S. and Witten, I. Adaptive personalized interfaces: A question of viability. Behaviour and Information Technology 4, 1(1985), 31--45.",
      "doi": ""
    },
    {
      "text": "Greenberg S. and Witten, I. Directing the user interface: how people use command-based computer systems. Proc. 3rd IFAC Conference on Man-Machine Systems, (1988), 349--356.",
      "doi": ""
    },
    {
      "text": "Hansen, S., Kraut, R., and Farber, J. Interface design and multivariate analysis of Unix commands. ACM TOIS 2, 1(1984), 42--57.  ",
      "doi": "10.1145/357417.357421"
    },
    {
      "text": "Höök, K. Steps to take before intelligent user interfaces become real. Journal of Interacting with Computers 12, 4(2000), 409--426.",
      "doi": ""
    },
    {
      "text": "Jones, M., Buchanan, G., and Thimbleby, H. Improving web search on small screen devices. Interacting with Computers 15, (2003)4, 479--495.",
      "doi": ""
    },
    {
      "text": "Linton, F., Joy, D., Schaefer, H.-P., and Charron, A. Owl: A recommender system for organization-wide learning. Educational Technology &amp; Society 3, 1(2000).",
      "doi": ""
    },
    {
      "text": "McGrenere, J. and Moore, G. Are we all in the same \"bloat\"? Proc. of GI 2000, (2000), 187--196.",
      "doi": ""
    },
    {
      "text": "McGrenere, J., Baecker, R., and Booth, K. An evaluation of a multiple interface design solution for bloated software. CHI Letters 4, 1(2002), 163--170.  ",
      "doi": "10.1145/503376.503406"
    },
    {
      "text": "Mitchell, J. and Shneiderman, B. (1989). Dynamic versus static menus: An exploratory comparison. SIGCHI Bulletin 20, 4(1989), 33--37.  ",
      "doi": "10.1145/67243.67247"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V., and Kuorelahti, J. Interaction in 4-second bursts: The fragmented nature of attentional resources in mobile HCI. Proc CHI '05, (2005), 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "St. Amant, R., Horton, T. E., and Ritter, F. E. Model-based evaluation of expert cell phone menu interaction. ACM TOCHI 14, 1(2007).  ",
      "doi": "10.1145/1229855.1229856"
    },
    {
      "text": "Sears, A., and Shneiderman, B. Split menus: Effectively using selection frequency to organize menus. ACM TOCHI 1, 1(1994), 27 -- 51.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "Smyth, B., and Cotter, P. Personalized adaptive navigation for mobile portals. Proc. ECAI'02, (2002), 608--612.",
      "doi": ""
    },
    {
      "text": "Smyth, B., Cotter, P., and Oman, S. Enabling intelligent content discovery on the mobile internet. Proc. AAAI, (2007), 1744--1751. ",
      "doi": "10.5555/1620113.1620124"
    },
    {
      "text": "Tsandilas, T. and schraefel, m. c. An empirical assessment of adaptation techniques. CHI '05 Extended Abstracts, (2005), 2009--2012.  ",
      "doi": "10.1145/1056808.1057079"
    }
  ]
}