{
  "doi": "10.1145/1357054.1357175",
  "title": "Participant and interviewer attitudes toward handheld computers in the context of HIV/AIDS programs in sub-Saharan Africa",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "763-766",
  "year": 2008,
  "badges": [],
  "abstract": "Handheld computers have untapped potential to improve HIV/AIDS programs in sub-Saharan Africa, particularly in the collection of survey data. We conducted an experiment in three neighborhoods of Luanda, Angola to assess the impact of the technology on people's comfort and willingness to disclose sensitive personal information, such as sexual behavior. Participants were asked about their HIV/AIDS-related knowledge, attitudes, and practices by local interviewers using either handheld computers or paper surveys. T-tests showed no differences between participants' self-reported comfort across handheld and paper conditions. However, participants in the handheld condition were more likely to give socially desirable responses to the sexual behavior questions than participants in the paper condition. These results suggest that using handheld computers in data collection in sub-Saharan Africa may lead to biased reports of HIV/AIDS-related risk behaviors.",
  "tags": [
    "technology acceptability",
    "pda",
    "handheld computers",
    "paper surveys",
    "developing country",
    "hiv/aids",
    "user study"
  ],
  "authors": [
    {
      "name": "Karen G. Cheng",
      "institution": "Charles R. Drew University of Medicine and Science, Los Angeles, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350575188",
      "orcid": "missing"
    },
    {
      "name": "Francisco Ernesto",
      "institution": "Angolan Armed Forces, Luanda, Angola",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350587414",
      "orcid": "missing"
    },
    {
      "name": "Khai N. Truong",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "Bing, E. G., Ortiz, D. J., Ovalle-Bahamon, R. E., Cheng, K. G., Huang, F. H., Ernesto, F., &amp; Duan, N. (In Press). HIV/AIDS Behavioral Surveillance among Angolan Military Men. Journal of AIDS and Behavior.",
      "doi": ""
    },
    {
      "text": "Crowne, D.P. and Marlowe, D. A new scale of social desirability independent of psychopathology. Journal of Consulting Psychology, 24 (1960), 349--354.",
      "doi": ""
    },
    {
      "text": "Freedom from HIV/AIDS - ZMQ Software Systems Initiative. http://www.freedomhivaids.in/",
      "doi": ""
    },
    {
      "text": "Gregson, S., Mushati, P., White, P. J., Mlilo, M., Mundandi, C., &amp; Nyamukapa, C. Informal confidential voting interview methods and temporal changes in reported sexual risk behaviour for HIV transmission in sub-Saharan Africa. Sexually Transmitted Infections, 80(Suppl 2): i36--i42, (2004).",
      "doi": ""
    },
    {
      "text": "Gregson, S., Zhuwau, T., Ndlovu, J., &amp; Nyamukapa, C. A. Methods to reduce social desirability bias in sex surveys in low-development settings: experience in Zimbabwe. Sexually Transmitted Disease, 29 (2002), 568--575.",
      "doi": ""
    },
    {
      "text": "Grisdale, S., Graves, M., Grünsteidl, A. Designing a Graphical User Interface for Healthcare Workers in Rural India. In Proc. of CHI 1997. ACM Press (1997), 471--478.  ",
      "doi": "10.1145/258549.258869"
    },
    {
      "text": "Internet Usage World Stats - Internet and Population Statistics. http://www.InternetWorldStats.com",
      "doi": ""
    },
    {
      "text": "Kam, M., Ramachandran, D., Devanathan, V., Tewari, A., Canny, J.F. Localized iterative design for language learning in underdeveloped regions: the PACE framework. In Proc. of CHI 2007. ACM Press (2007), 1097--1106.  ",
      "doi": "10.1145/1240624.1240791"
    },
    {
      "text": "Kok, G., Harterink, P., Vriens, P., De Zwart, O. and Hospers, H.J. The Gay Cruise: Developing a Theory- and Evidence-Based Internet HIV-Prevention Intervention. Sexuality Research and Social Policy: Journal of NSRC, 3, 2 (2006), 52--67.",
      "doi": ""
    },
    {
      "text": "LaFraniere, S., Grady, D. Stalking a Deadly Virus, Battling a Town's Fears. The New York Times, (2005)",
      "doi": ""
    },
    {
      "text": "Parikh, T.S., Javid, P., Sasikumar, K., Ghosh, K., Toyama, K. Mobile phones and paper documents: evaluating a new approach for capturing microfinance data in rural India. In Proc. of CHI 2006. ACM Press (2006), 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Phillips, D.L. and Clancy, K.J. Some Effects of \"Social Desirability\" in Survey Studies. The American Journal of Sociology, 77, 5 (1972) 921--940.",
      "doi": ""
    },
    {
      "text": "Ramachandran, D., Kam, M., Chiu, J., Canny, J., Frankel, J.F. Social dynamics of early stage co-design in developing regions. In Proc. of CHI 2007. ACM Press (2007), 1087--1096.  ",
      "doi": "10.1145/1240624.1240790"
    },
    {
      "text": "Read, S.J., Miller, L.C., Appleby, P.R., Nwosu, M.E., Reynaldo, S., Lauren, A. and Putcha, A. Socially Optimized Learning in a Virtual Environment: Reducing Risky Sexual Behavior Among Men Who Have Sex With Men. Human Communication Research, 32, 1 (2006), 1--34.",
      "doi": ""
    },
    {
      "text": "Techneos - mobile survey software and face-to-face interviewing services. http://www.techneos.com",
      "doi": ""
    },
    {
      "text": "Tourangeau, R. Rips, L.R., Rasinski, K. The Psychology of Survey Response. Cambridge University Press (2000)",
      "doi": ""
    },
    {
      "text": "UNAIDS (2006). Report on the global HIV/AIDS epidemic. http://www.unaids.org/en/HIV_data/2006GlobalReport",
      "doi": ""
    },
    {
      "text": "U.S. Census Bureau, 2000. http://www.census.gov/main/www/cen2000.html",
      "doi": ""
    },
    {
      "text": "van de Wijgert, J., Padian, N., Shiboski, S., &amp; Turner, C. (2000). Is audio computer-assisted self-interviewing a feasible method of surveying in Zimbabwe? International Journal of Epidemiology, 29 (2000), 885--890.",
      "doi": ""
    },
    {
      "text": "Ybarra, M.L., Kiwanuka, J., Emenyonu, N. and Bangsberg, D.R. Internet Use among Ugandan Adolescents: Implications for HIV Intervention. PLoS Medicine, 3, 11 (2006), 1--9.",
      "doi": ""
    }
  ]
}