{
  "doi": "10.1145/1357054.1357066",
  "title": "Mobile multimedia presentation editor: enabling creation of audio-visual stories on mobile devices",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "63-72",
  "year": 2008,
  "badges": [],
  "abstract": "A mobile device provides an attractive tool for creating and sharing audio-visual stories. Earlier research has shown that the users enjoy creating digital stories with their mobile devices. However, designing editor interfaces that support creation of rich audio-visual presentations has been a major challenge due to the constrained input and output capabilities of mobile devices. In this paper, we present the design and evaluation of the Mobile Multimedia Presentation Editor, an application that makes it possible to author sophisticated multimedia presentations that integrate several different media types on mobile devices. Based on a user study, we present design principles for multimedia presentation editors on mobile devices. We describe an application design that supports these principles and so demonstrate that editing of sophisticated multimedia presentations is feasible on mobile devices. We report evaluations which indicate that the editor application was easy to use and supported the creativity of the mobile users well.",
  "tags": [
    "mms",
    "storytelling",
    "authoring",
    "editor",
    "multimedia messages",
    "content creation",
    "user interfaces",
    "mobile devices",
    "smil",
    "interaction design",
    "multimedia presentations"
  ],
  "authors": [
    {
      "name": "Tero Jokela",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408600326",
      "orcid": "missing"
    },
    {
      "name": "Jaakko T. Lehikoinen",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100569515",
      "orcid": "missing"
    },
    {
      "name": "Hannu Korhonen",
      "institution": "Nokia Research Center, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100009263/rel-imgonly/korhonen201015small.jpg",
      "acmid": "81100009263",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balabanović, M., Chu, L., Wolff, G. Storytelling with Digital Photographs. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, 2000. Pp. 564--571.  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Fono, D., Counts, S. Sandboxes: Supporting Social Play through Collaborative Multimedia Composition on Mobile Phones. In Proc. of the Conference on Computer Supported Cooperative Work, 2006. Pp. 163--166.  ",
      "doi": "10.1145/1180875.1180900"
    },
    {
      "text": "Jokela, T., Karukka, M., and Mäkelä, K. Mobile Video Editor: Design and Evaluation. In Proc. of the Int. Conference on Human-Computer Interaction, 2007. Vol. 2: pp. 344--353. ",
      "doi": "10.5555/1757268.1757309"
    },
    {
      "text": "Jokela, T., Mäkelä, K., and Karukka, M. Empirical Observations on Video Editing in the Mobile Context. In Proc. of the Int. Conference on Mobile Technology, Applications, and Systems, 2007. Pp. 490--497.  ",
      "doi": "10.1145/1378063.1378140"
    },
    {
      "text": "Kirk, D., Sellen, A., Rother, C., and Wood, K. Understanding Photowork. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, 2006. Pp. 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Koskinen, I., Kurvinen, E., and Lehtonen, T.-K. Mobile Image. IT Press, 2002.",
      "doi": ""
    },
    {
      "text": "Landry, B. and Guzdial, M. Learning from Human Support: Informing the Design of Personal Story-Authoring Tools. In Proc. of CODE 2006 {online}. Available: http://www.units.muohio.edu/codeconference/papers/papers/Landry_Guzdial.pdf",
      "doi": ""
    },
    {
      "text": "Madej, K. Towards Digital Narrative for Children: From Education to Entertainment: A Historical Perspective. ACM Computers in Entertainment, 2003. Vol. 1: 1. Pp. 1--17.  ",
      "doi": "10.1145/950566.950585"
    },
    {
      "text": "Mäkelä, A., Giller, V., Tscheligi, M., and Sefelin, R. Joking, Storytelling, Artsharing, Expressing Affection: A Field Trial of How Children and Their Social Network Communicate with Digital Images in Leisure Time. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, 2000. Pp. 548--555.  ",
      "doi": "10.1145/332040.332499"
    },
    {
      "text": "Salovaara, A. Appropriation of a MMS-Based Comic Creator: From System Functionalities to Resources for Action. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, 2007. Pp. 1117--1126.  ",
      "doi": "10.1145/1240624.1240794"
    },
    {
      "text": "Wu, C., Teng, C., Chen, Y., Lin, T., Chu, H., and Hsu, J.: Point-of-Capture Archiving and Editing of Personal Experiences from a Mobile Device. Personal and Ubiquitous Computing {online}. September 2006.  ",
      "doi": "10.1007/s00779-006-0082-7"
    }
  ]
}