{
  "doi": "10.1145/1357054.1357159",
  "title": "Experience sampling for building predictive user models: a comparative study",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "657-666",
  "year": 2008,
  "badges": [],
  "abstract": "Experience sampling has been employed for decades to collect assessments of subjects' intentions, needs, and affective states. In recent years, investigators have employed automated experience sampling to collect data to build predictive user models. To date, most procedures have relied on random sampling or simple heuristics. We perform a comparative analysis of several automated strategies for guiding experience sampling, spanning a spectrum of sophistication, from a random sampling procedure to increasingly sophisticated active learning. The more sophisticated methods take a decision-theoretic approach, centering on the computation of the expected value of information of a probe, weighing the cost of the short-term disruptiveness of probes with their benefits in enhancing the long-term performance of predictive models. We test the different approaches in a field study, focused on the task of learning predictive models of the cost of interruption.",
  "authors": [
    {
      "name": "Ashish Kapoor",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100301388",
      "orcid": "missing"
    },
    {
      "name": "Eric Horvitz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100323543/rel-imgonly/81100323543.jpg",
      "acmid": "81100323543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albrecht, D. W., Zukerman, I. and Nicholson, A. E.: Bayesian Models for Keyhole Plan Recognition in an Adventure Game. User Modeling and User-Adapted Interaction Volume 8 (1998).  ",
      "doi": "10.1023/A%3A1008238218679"
    },
    {
      "text": "Cesa-Bianchi, N., Conconi, A. and Gentile, C.: Learning probabilistic linear-threshold classifiers via selective sampling. Conference on Learning Theory (2003).",
      "doi": ""
    },
    {
      "text": "Fogarty, J., Hudson, S. E. and Lai, J.: Examining the Robustness of Sensor-Based Statistical Models of Human Interruptability. Proceedings of CHI (2004).  ",
      "doi": "10.1145/985692.985719"
    },
    {
      "text": "Freund, Y., Seung, H. S., Shamir, E. and Tishby, N.: Selective Sampling Using the Query by Committee Algorithm. Machine Learning Volume 28 (1997).  ",
      "doi": "10.1023/A%3A1007330508534"
    },
    {
      "text": "Froehlich J, Chen, M. Y., Smith, I. E., and Potter, F.: Voting with Your Feet: An Investigative Study of the Relationship Between Place Visit Behavior and Preference. UbiComp (2006).  ",
      "doi": "10.1007/11853565_20"
    },
    {
      "text": "Horvitz, E.: Principles of Mixed-Initiative User Interfaces. Proceedings of CHI (1999).  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Horvitz, E. and Apacible, J.: Learning and Reasoning about Interruption. International Conference on Multimodal Interfaces (2003).  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Horvitz, E., Apacible, J. and Koch, P. BusyBody: Creating and Fielding Personalized Models of the Cost of Interruption. Conference on Computer Supported Cooperative Work (2004).  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Horvitz, E., Breese, J., Heckerman, D., Hovel, D. and Rommelse, K.: The Lumiere Project: Bayesian User Modeling for Inferring the Goals and Needs of Software Users. Uncertainty in Artificial Intelligence (1998). ",
      "doi": "10.5555/2074094.2074124"
    },
    {
      "text": "Horvitz, E., Jacobs, A. and Hovel, D.: Attention-Sensitive Alerting. Uncertainty in Artificial Intelligence (1999). ",
      "doi": "10.5555/2073796.2073831"
    },
    {
      "text": "Intille, S. S., Rondoni, J., Kukla, C., Anacona, I., and Bao, L.: A Context-aware Experience Sampling Tool. Extended Abstract in Proceedings of CHI (2003).  ",
      "doi": "10.1145/765891.766101"
    },
    {
      "text": "Kapoor, A., Burleson, W. and Picard R. W.: Automatic Prediction of Frustration. International Journal of Human Computer Studies Volume 65 (2007).  ",
      "doi": "10.1016/j.ijhcs.2007.02.003"
    },
    {
      "text": "Kapoor, A. and Horvitz, E.: On Discarding, Caching, and Recalling Samples in Active Learning. Uncertainty in Artificial Intelligence (2007).",
      "doi": ""
    },
    {
      "text": "Lawrence, N., Seeger, M. and Herbrich, R.: Fast Sparse Gaussian Process Method: Informative Vector Machines. Neural Information Processing Systems (2002).",
      "doi": ""
    },
    {
      "text": "Lewis, D. D. and Gale, W. A.: A sequential algorithm for training text classifiers. International Conference on Research and Development in Information Retrieval (1994) ",
      "doi": "10.5555/188490.188495"
    },
    {
      "text": "MacKay, D.: Information-Based Objective Functions for Active Data Selection. Neural Computation Volume 4(4) (1992).  ",
      "doi": "10.1162/neco.1992.4.4.590"
    },
    {
      "text": "McCallum, A. K. and Nigam, K.: Employing EM in pool-based active learning for text classification. International Conference on Machine Learning (1998). ",
      "doi": "10.5555/645527.757765"
    },
    {
      "text": "Minka, T. P.: A Family of Algorithms for Approximate Bayesian Inference. PhD Thesis, Massachusetts Institue of Technology (2001). ",
      "doi": "10.5555/935427"
    },
    {
      "text": "Muslea, I., Minton, S. and Knoblock, C. A.: Active + Semi-supervised Learning = Robust Multi-View Learning. International Conference on Machine Learning (2002). ",
      "doi": "10.5555/645531.655845"
    },
    {
      "text": "Shen, J. and Dietterich, T. G.: Active EM to Reduce Noise in Activity Recognition. International Conference on Intelligent User Interface (2007).  ",
      "doi": "10.1145/1216295.1216323"
    },
    {
      "text": "Tong, S. and Koller, D.: Support Vector Machine Active Learning with Applications to Text Classification. International Conference on Machine Learning (2000). ",
      "doi": "10.5555/645529.658272"
    },
    {
      "text": "Zhu, X., Lafferty, J. and Ghahramani, Z.: Combining Active Learning and Semi-Supervised Learning Using Gaussian Fields and Harmonic Functions. Workshop on The Continuum from Labeled to Unlabeled Data in Machine Learning and Data Mining at ICML (2003).",
      "doi": ""
    }
  ]
}