{
  "doi": "10.1145/1357054.1357197",
  "title": "Making use of business goals in usability evaluation: an experiment with novice evaluators",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "903-912",
  "year": 2008,
  "badges": [],
  "abstract": "The utility and impact of a usability evaluation depend on how well its results align with the business goals of the system under evaluation. However, how to achieve such alignment is not well understood. We propose a simple technique that requires active consideration of a system's business goals in planning and reporting evaluations. The technique is tested in an experiment with 44 novice evaluators using think aloud testing. The evaluators considering business goals report fewer usability problems compared to evaluators that did not use the technique. The company commissioning the evaluation, however, assesses those problems 30-42% higher on four dimensions of utility. We discuss how the findings may generalize to usability professionals, and how the technique may be used in realistic usability evaluations. More generally, we discuss how our results illustrate one of a variety of ways in which business goals and other facets of a system's context may enter into usability evaluations.",
  "authors": [
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, DK-2100 Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    },
    {
      "name": "Erik Frøkjær",
      "institution": "University of Copenhagen, DK-2100 Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100265136",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bloomer, S. &amp; Croft, R. Pitching Usability to Your Organization, interactions, november+december (1997), 18--26.  ",
      "doi": "10.1145/267505.267510"
    },
    {
      "text": "Bødker, K., Kensing, F., &amp; Simonsen, J. Participatory IT Design, MIT Press, Cambridge, MA, 2004.",
      "doi": "10.5555/983163"
    },
    {
      "text": "Bødker, S. &amp; Madsen, K. H. Context: An Active Choice in Usability Work, interactions, july+august (1998), 17--25.  ",
      "doi": "10.1145/278465.278469"
    },
    {
      "text": "Carter, P. Liberating Usability Testing, interactions, march+april (2007), 18--22.  ",
      "doi": "10.1145/1229863.1229864"
    },
    {
      "text": "Cockton, G. Designing Worth Is Worth Designing, Proc. NordiCHI 2006, (2006), 165--174.  ",
      "doi": "10.1145/1182475.1182493"
    },
    {
      "text": "Cockton G., Lavery, D., &amp; Woolrych, A., Inspection-Based Evaluations, in Sears, A. &amp; Jacko, J. The Human-Computer Interaction Handbook, 2nd edition, CRC, 2007.",
      "doi": ""
    },
    {
      "text": "Cockton, G., Woolrych, A., Hall, L., &amp; Hindmarch, M. Changing Analysts' Tunes: The Surprising Impact of a New Instrument for Usability Inspection Method Assessment, Proc. HCI 2003, Springer (2003), 145--162.",
      "doi": ""
    },
    {
      "text": "Cockton, G., Woolrych, A., &amp; Hindemarch, M. Reconditioned Merchandise: Extended Structured Report Formats in Usability Inspection, Proc. CHI Extended Abstracts 2004, (2004), 1433--1436.  ",
      "doi": "10.1145/985921.986083"
    },
    {
      "text": "Desurvire, H. W., Lawrence, D., &amp; Atwood, M. E. Empiricism Versus Judgment: Comparing User Interface Evaluation Methods on a New Telephone-Based Interface, SIGCHI bulletin, 23, 4 (1991), 58--59.  ",
      "doi": "10.1145/126729.1056062"
    },
    {
      "text": "Dumas, J., Molich, R., &amp; Jefferies, R. Describing Usability Problems: Are We Sending the Right Message?, interactions, 4 (2004), 24--29.  ",
      "doi": "10.1145/1005261.1005274"
    },
    {
      "text": "Følstad, A. Work-Domain Experts as Evaluators: Usability Inspection of Domain-Specific Work-Support Systems, International Journal of Human-Computer Interaction, 22, 3 (2007), 217--245.",
      "doi": ""
    },
    {
      "text": "Furniss D., Blandford, A., &amp; Curzon, P., Usability Work in Professional Website Design: Insights from Practitioners' Perspectives, in Law, E., Hvannberg, E., &amp; Cockton, G. (eds.) Maturing Usability: Quality in Software, Interaction and Value, Springer, 2007",
      "doi": ""
    },
    {
      "text": "Gulliksen, J., Boivie, I., &amp; Gööransson, B. Usability Professionals-Current Practices and Future Development, Interacting with Computers, 18 (2006), 568--600.  ",
      "doi": "10.1016/j.intcom.2005.10.005"
    },
    {
      "text": "Hartson, H. R., Andre, T. S., &amp; Williges, R. C. Criteria for Evaluating Usability Evaluation Methods, International Journal of Human-Computer Interaction, 13, 4 (2001), 373--410.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K. &amp; Frøøkjær, E. Comparing Usability Problems and Redesign Proposals as Input to Practical Systems Development, Proc. CHI'2005, ACM Press (2005), 391--400.  ",
      "doi": "10.1145/1054972.1055027"
    },
    {
      "text": "Hornbæk, K. &amp; Stage, J. Special Issue on The Interplay Between Usability Evaluation and User Interaction Design, International Journal of Human Computer Interaction, 21, 5 (2006), 117--123.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K. &amp; Frøøkjær, E. (2004) Two Psychology-Based Usability Inspection Techniques Studied in a Diary Experiment, Proc. Nordichi 2004, ACM Press (2004), 3--12.  ",
      "doi": "10.1145/1028014.1028016"
    },
    {
      "text": "Janes, J. Relevance Judgments and the Incremental Presentation of Document Representations, Information Processing &amp; Management, 27, 6 (1991), 629--646.",
      "doi": ""
    },
    {
      "text": "Jeffries, R., Miller, J., Wharton, C., &amp; Uyeda, K. User Interface Evaluation in the Real World: A Comparison of Four Techniques, Proc. CHI'91, (1991), 119--124.  ",
      "doi": "10.1145/108844.108862"
    },
    {
      "text": "Jeffries R., Usability Problem Reports: Helping Evaluators Communicate Effectively With Developers, in Nielsen, J. &amp; Mack, R. L. Usability Inspection Methods, John Wiley, 1994, 273--294. ",
      "doi": "10.5555/189200.189228"
    },
    {
      "text": "John, B. E. &amp; Marks, S. J. Tracking the Effectiveness of Usability Evaluation Methods, Behaviour &amp; Information Technology, 16, 4/5 (1997), 188--202.",
      "doi": ""
    },
    {
      "text": "John, B. E. &amp; Packer, H. Learning and Using the Cognitive Walkthrough Method: a Case Study Approach, Proc. CHI'95, ACM Press (1995), 429--436.  ",
      "doi": "10.1145/223904.223962"
    },
    {
      "text": "Kazman, R. &amp; Bass, L. Categorizing Business Goals for Software Architectures, Technical report CMU/SEI-2005-TR-021 (2006).",
      "doi": ""
    },
    {
      "text": "Law, E. L. C. Evaluating the Downstream Utility of User Tests and Examining the Developer Effect: A Case Study, International Journal of Human-Computer Interaction, 21, 2 (2006), 147--172.",
      "doi": ""
    },
    {
      "text": "Leavitt, H. Applied Organizational Change in Industry: Structural, Technological and Humanistic Approaches, John Wiley, 1964.",
      "doi": ""
    },
    {
      "text": "Lewis, C. Using the \"Thinking-Aloud\" Method in Cognitive Interface Design, Research Report RC9265 (1982).",
      "doi": ""
    },
    {
      "text": "Maguire, M. Context of Use within Usability Activities, International Journal of Human-Computer Studies, 55 (2001), 453--483.  ",
      "doi": "10.1006/ijhc.2001.0486"
    },
    {
      "text": "Molich, R. Usable Web Design, Nyt Teknisk Forlag, 2007.",
      "doi": ""
    },
    {
      "text": "Molich, R., Jeffries, R., &amp; Dumas, J. Making Usability Recommendations Useful and Usable, Journal of Usability Studies, 2, 4 (2007), 162--179.",
      "doi": ""
    },
    {
      "text": "Newman, W. &amp; Taylor, A. Towards a Methodology Employing Critical Parameters to Deliver Performance Improvements in Interactive Systems, Proc. INTERACT'99, IOS Press (1999), 605--612.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Finding Usability Problems through Heuristic Evaluation, Proc. CHI'92, ACM Press (1992), 373--380.  ",
      "doi": "10.1145/142750.142834"
    },
    {
      "text": "Nielsen, J. &amp; Molich, R. Heuristic Evaluation of User Interfaces, Proc. CHI'90, ACM Press (1990), 249--256.  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Nielsen, J., Molich, R., Snyder, C., &amp; Farrell, S. E-Commerce User Experience, Nielsen Norman Group, Fremont, CA, 2001. ",
      "doi": "10.5555/600095"
    },
    {
      "text": "Nørgaard, M. &amp; Hornbææk, K. What Do Usability Evaluators Do in Practice? An Explorative Study of Think-Aloud Testing, Proc. DIS 2006, (2006), 209--218.  ",
      "doi": "10.1145/1142405.1142439"
    },
    {
      "text": "Pinelle, D. &amp; Gutwin, C. Groupware Walkthrough: Adding Context to Groupware Usability Evaluation, Proc. CHI 2002, ACM Press (2002), 455--462.  ",
      "doi": "10.1145/503376.503458"
    },
    {
      "text": "Redish, J., Bias, R., Bailey, R., Molich, R., Dumas, J., &amp; Spool, J. Usability in Practice: Formative Usability Evaluations -- Evolution and Revolution, (2002), 885--890.  ",
      "doi": "10.1145/506443.506647"
    },
    {
      "text": "Rubin, J. Handbook of Usability Testing, John Wiley &amp; Sons, New York, NY, 1994. ",
      "doi": "10.5555/561768"
    },
    {
      "text": "Simonsen, J. Involving Top Management in IT Projects, Communications of the ACM, 50, 8 (2007), 53--58.  ",
      "doi": "10.1145/1278201.1278206"
    },
    {
      "text": "Smith, S. L. &amp; Mosier, J. N. Guidelines for Designing User Interface Software, ESD-TR-86-278 (1986).",
      "doi": ""
    },
    {
      "text": "Uldall-Espersen, T. &amp; Frøøkjær, E. Usability and Software Development: Roles of the Stakeholders, Proc. HCI International, Lecture Notes in Computer Science 4550, (2007), 642--651. ",
      "doi": "10.5555/1772490.1772563"
    },
    {
      "text": "Wharton C. et al., The Cognitive Walkthrough Method: a Practitioner's Guide, in Nielsen, J. &amp; Mack, R. L. (eds.) Usability Inspection Methods, John Wiley &amp; Sons, 1994, 105--140. ",
      "doi": "10.5555/189200.189214"
    },
    {
      "text": "Whiteside J., Bennett, J., &amp; Holtzblatt, K., Usability Engineering: Our Experience and Evolution, in Helander, M. (ed.) Handbook of Human-Computer Interaction, Elsevier, 1988, 791-817.",
      "doi": ""
    },
    {
      "text": "Wixon D. &amp; Wilson, C., The Usability Engineering Framework, in Helander, M., Landauer, T., &amp; Prabhu, P. (eds.) Handbook of Human-Computer Interaction, 2nd edition, Elsevier, 1997, 653--688.",
      "doi": ""
    }
  ]
}