{
  "doi": "10.1145/1357054.1357111",
  "title": "Sustainable millennials: attitudes towards sustainability and the material effects of interactive technologies",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "333-342",
  "year": 2008,
  "badges": [],
  "abstract": "This paper describes the design and interprets the results of a survey of 435 undergraduate students concerning the attitudes of this mainly millennial population towards sustainability apropos of the material effects of information technologies. This survey follows from earlier work on notions of Sustainable Interaction Design (SID)---that is the perspective that sustainability can and should be a central focus within HCI. In so doing it advances to some degree the empirical resources needed to scaffold an understanding of the theory and principles of SID. The interpretations offered yield key insights about understanding different notions of what it means to be successful in a material sense to this population and specific design principles for creating interactive designs differently such that more sustainable behaviors are palatable to individuals of varying attitudes.",
  "tags": [
    "sustainability",
    "design",
    "value sensitive design",
    "hci and design",
    "sustainable interaction design",
    "sid"
  ],
  "authors": [
    {
      "name": "Kristin Hanks",
      "institution": "Indiana University at Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350575877",
      "orcid": "missing"
    },
    {
      "name": "William Odom",
      "institution": "Indiana University at Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    },
    {
      "name": "David Roedl",
      "institution": "Indiana University at Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339524704",
      "orcid": "missing"
    },
    {
      "name": "Eli Blevis",
      "institution": "Indiana University at Bloomington, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100365314/rel-imgonly/20171007-self.jpg",
      "acmid": "81100365314",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "André, F. and Cerdá, E. (2006). On the Dynamics of Recycling and Natural Resources. Environmental &amp; Resource Economics, 33, 199--221.",
      "doi": ""
    },
    {
      "text": "American Bankers Association (2003). Computer Castoffs. American Bankers Association. ABA Banking Journal, 95(4), 22--28.",
      "doi": ""
    },
    {
      "text": "Blevis, E. (2007). Sustainable interaction design: invention &amp; disposal, renewal &amp; reuse. In Proceedings CHI '07. ACM Press, New York, NY, 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Blevis, E., Lim, Y.K., Roedl, D., &amp; Stolterman, E. (2007). Using Design Critique as Research to link Sustainability and Interactive Technologies. In HCII 2007, LNCS 4564, 22--31. ",
      "doi": "10.5555/1784297.1784301"
    },
    {
      "text": "Blevis, E., Makice, K., Odom, W., Roedl, D., Beck, C., Blevis, S., and Ashok, A. (2007). Luxury &amp; New Luxury, Quality &amp; Equality. DPPI 2007. Helsinki, Finland. ACM Press, New York, NY.  ",
      "doi": "10.1145/1314161.1314188"
    },
    {
      "text": "Blevis, E. &amp; Stolterman, E. (2007). Ensoulment and Sustainable Interaction Design. IASDR 2007. Hong Kong",
      "doi": ""
    },
    {
      "text": "Blevis, E. (2006). Advancing Sustainable Interaction Design: Two Perspectives on Material Effects. Design Philosophy Papers. 2006 #4. Team D/E/S, Queensland, AU. ISSN 1448--7136.",
      "doi": ""
    },
    {
      "text": "Cross, N. (2001). Designerly Ways of Knowing: Design Discipline Versus Design Science. Design Issues (MIT Press), 17(3), 49--55.",
      "doi": ""
    },
    {
      "text": "Frand, J. (2000). The Information Age Mindset: Changes in Students and Implications for Higher Education, EDUCAUSE Review 35(5),15--24.",
      "doi": ""
    },
    {
      "text": "Friedman, B. (2004). Value sensitive design. Encyclopedia of Human-Computer Interaction. Great Barrington, MA: Berkshire Publishing Group. 76--774.",
      "doi": ""
    },
    {
      "text": "Friedman, B. (Ed.) (1997). Human Values and the Design of Computer Technology. Stanford CA: CSLI Press. ",
      "doi": "10.5555/278213"
    },
    {
      "text": "Friedman, B., &amp; Kahn, P., Jr. (2003). Human values, ethics, and design. In J. Jacko and A. Sears (Eds.), The Human-Computer Interaction Handbook. Mahwah, NJ: Lawrence Erlbaum Associates. 1177--1201. ",
      "doi": "10.5555/772072.772147"
    },
    {
      "text": "Friedman, B., Kahn, P., and Borning, A. (2006). Value sensitive design and information systems. In P. Zhang &amp; D. Galletta (eds.), Human-Computer Interaction and Management Information Systems: Foundations. M.E. Sharpe, New York, 348--372.",
      "doi": ""
    },
    {
      "text": "Fry, T. (1999). A New Design Philosophy: An Introduction to Defuturing. New South Wales, Australia: NSWU Press.",
      "doi": ""
    },
    {
      "text": "Gaudin, S. (2006). More than Half of All Business PCs Can't Run Vista, Survey Says. Information Week. 12.06.2006.",
      "doi": ""
    },
    {
      "text": "Halluite, J., Linton, J., Yeomans, J., &amp; Yoogalingam, R. (2005). The Challenge of Hazardous Waste Management in a Sustainable Environment. Corporate Social Responsibility and Environmental Management, 12(1), 31--37.",
      "doi": ""
    },
    {
      "text": "Heidegger, M. (1954). The Question Concerning Technology. in William Lovitt, The Question Concerning Technology and Other Essays, Harper Torchbooks, {1954} 1977, 3--35.",
      "doi": ""
    },
    {
      "text": "Howe, N. &amp; Strauss, B. (2000). Millennials Rising: The Next Great Generation. New York: Vintage Books.",
      "doi": ""
    },
    {
      "text": "Huang, E. M. &amp; Truong, K. N. (2008) Breaking the Disposable Technology Paradigm: Opportunities for Sustainable Interaction Design for Mobile Phones. In the Proceedings of the ACM Conference on Human Factors in Computing.  ",
      "doi": "10.1145/1357054.1357110"
    },
    {
      "text": "Kling, R. and Star, S. L. (1998). Human centered systems in the perspective of organizational and social informatics. SIGCAS Computing Soc. 28, 1 (Mar. 1998), 22--29  ",
      "doi": "10.1145/277351.277356"
    },
    {
      "text": "Linton, J., Yeomans, J., and Yoogalingam, R. (2004). Enabling Industrial Ecology through the Forecasting of Durable Goods Disposal. Canadian Journal of Administrative Sciences 12(2), 190--207.",
      "doi": ""
    },
    {
      "text": "Löwgren, J. &amp; Stolterman, E. (2004). Thoughtful Interaction Design. MIT Press. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Matthews, H., McMichael, F., Hendrickson, C., &amp; Hart, D. (1997). Disposition and End-of-Life Options for Personal Computers. Green Design Initiative Technical Report #97-10 Carnegie Mellon University. http://www.ce.cmu.edu/GreenDesign/comprec/NEWREPORT.PDF",
      "doi": ""
    },
    {
      "text": "McDonough, W. and Braungart, M. (2002) Cradle to Cradle: Remaking the Way We Make Things. North Point Press. New York.",
      "doi": ""
    },
    {
      "text": "Makelberge, N. (2003) Computing against the grain. Design Philosophy Papers. #04/2003",
      "doi": ""
    },
    {
      "text": "Mankoff, J. C., Blevis, E., Borning, A., Friedman, B., Fussell, S. R., Hasbrouck, J., Woodruff, A., and Sengers, P. (2007). Environmental sustainability and interaction. In Extended Abstracts CHI '07. ACM Press, New York, NY, 2121--2124.  ",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Mankoff, J., Matthews, D., Fussell, S. R., and Johnson, M. 2007. Leveraging Social Networks To Motivate Individuals to Reduce their Ecological Footprints. In Proceedings HICSS. IEEE Computer Society, Washington, DC, 87.  ",
      "doi": "10.1109/HICSS.2007.325"
    },
    {
      "text": "Margolin, V., &amp; Margolin, S. (2003). A \"Social Model\" of Design: Issues of Practice and Research. Design Issues (MIT Press), 18(4), 24--30.",
      "doi": ""
    },
    {
      "text": "Margolin, V. (Ed.) (2002). The Politics of the Artificial. University of Chicago Press. London, UK.",
      "doi": ""
    },
    {
      "text": "Margolin, V. (Ed.) (1989). Design Discourse: History, Theory, Criticism. Chicago: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Nardi, B.A., &amp; Others.: (2003) A social ecology of wireless technology by Critical Friends of Technology. First Monday, vol. 8(8).",
      "doi": ""
    },
    {
      "text": "Nardi, B.A. &amp; O'Day, V.L. (1999). Information Ecologies: Using Technology with Heart. Cambridge, MA: The MIT Press. ",
      "doi": "10.5555/299579"
    },
    {
      "text": "Nelson, H. &amp; Stolterman, E. (2003). The Design Way - Intentional Change in an Unpredictable World. Educational Technology Publications. New Jersey. ",
      "doi": "10.5555/861852"
    },
    {
      "text": "Oblinger, D. &amp; Oblinger J. (2006). Is it Age or IT: First Steps Toward Understanding the Net Generation. California School Library Association Journal, 29(2), 8--16.",
      "doi": ""
    },
    {
      "text": "Papanek, V. (1985). Design for the Real World: Human Ecology and Social Change (2nd ed.). Chicago: Academy Chicago.",
      "doi": ""
    },
    {
      "text": "Reck, J. &amp; Wood, B. (2004).Vodacom's community services phone shops. Small Enterprise Development, Volume 15, Number 4, December 2004, pp. 31--3, Practical Action Publishing",
      "doi": ""
    },
    {
      "text": "Schmidt, C. (2006). Unfair Trade: E-Waste in Africa. Environmental Health Perspectives, 114(4), 232--235.",
      "doi": ""
    },
    {
      "text": "Schön, D. (1983). The Reflective Practitioner. London: Temple Smith.",
      "doi": ""
    },
    {
      "text": "Selin, H and VanDeveer, S. (2006). Raising Global Standards: Hazardous Substances and E-Waste Management in the European Union. Environment, 48(10), 6--18.",
      "doi": ""
    },
    {
      "text": "Stegall, N. (2006). Designing sustainability: a philosophy for ecologically intentional design. Design Issues. 22(2). 56--63.",
      "doi": ""
    },
    {
      "text": "Thackara, John. (2005). In the Bubble: Designing for a Complex World. MIT Press. ",
      "doi": "10.5555/1076352"
    },
    {
      "text": "U.S. Environmental Protection Agency (2001). Electronics: A New Opportunity for Waste Prevention, Reuse, and Recycling. EPA 530-F-01-006 http://www.epa.gov/osw/elec_fs.pdf",
      "doi": ""
    },
    {
      "text": "U.S. Environmental Protection Agency (2000). WasteWise Update.EPA530-N-00-007. http://www.epa.gov/wastewise/pubs/wwupda14.pdf",
      "doi": ""
    },
    {
      "text": "U.S. Environmental Protection Agency (2006). EPA Applauds Progress in Recycling Electronic Waste. http://yosemite.epa.gov/opa/admpress.nsf/b6f538027a6b8c37852572a000650c04/494c3d000d508c1e852570ee005f003e!OpenDocument",
      "doi": ""
    },
    {
      "text": "Willis, A.M. (2006). Ontological Designing. Design Philosophy Papers. #02/2006.",
      "doi": ""
    },
    {
      "text": "Winograd, T. &amp; Flores, F. (1986). Understanding Computers and Cognition: A New Foundation for Design. New York: Addison-Wesley, Inc. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "Woolley, M. (2003). Choreographing obsolescence - ecodesign: the pleasure/dissatisfaction cycle. In Proc. of DPPI '03 Designing Pleasurable Products and Interfaces. ACM Press, New York, NY. 77--81.  ",
      "doi": "10.1145/782896.782916"
    },
    {
      "text": "Yoshida, F. (2002). Information technology waste problems in Japan. Environmental Economics and Policy Studies, 5, 249--26.",
      "doi": ""
    }
  ]
}