{
  "doi": "10.1145/1357054.1357091",
  "title": "MightyTrace: multiuser tracking technology on lc-displays",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "215-218",
  "year": 2008,
  "badges": [],
  "abstract": "In this paper, we present a new technology to perform multi Tangible User Interface (TUI) tracking on standard LC-displays. A lot of existing technologies for tangible user interface tracking use back- or front-projection setups, but they suffer from poor image quality, shadow casting, non-ergonomic interaction, and/or large installations. Thus, we introduce a principle that allows using the InfrActables' technology on a large LC-display. It combines simultaneous multiuser input on a display with the advantages of a large flat screen. We use infrared photodiodes (IR-LEDs) mounted behind the display's LC-matrix to track infrared diodes in front of the screen. After initial tests concerning the infrared transparency and sensor characteristics, we developed a proof of concept consisting of 384 sensors, which are addressed through a modular master-slave circuit. Using several interaction devices, multiuser interaction is possible.",
  "authors": [
    {
      "name": "Ramon Hofer",
      "institution": "Inspire AG, ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350579036",
      "orcid": "missing"
    },
    {
      "name": "Patrick Kaplan",
      "institution": "Technical University Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570558",
      "orcid": "missing"
    },
    {
      "name": "Andreas Kunz",
      "institution": "Inspire AG, ETH Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81100548693/rel-imgonly/portrait_ak.jpg",
      "acmid": "81100548693",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fitzmaurice, G.W.; Ishii, H.; and Buxton, W.: Bricks: Laying the Foundation for Graspable User Interfaces; CHI 95: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems; 1995; Denver, Colorado, USA; ACM Press  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Fjeld, M.; Bichsel, M.; and Rauterberg, M.: BUILD--IT: An Intuitive Design Tool Based on Direct Object Manipulation; Proceedings of the International Gesture Workshop on Gesture and Sign Language in Human--Computer Interaction; 1998; London, UK; Springer Verlag ",
      "doi": "10.5555/647590.728564"
    },
    {
      "text": "Ganser, Ch.; Steinemann, A.; Kunz, A.: InfrActables: Multi-user Tracking System for Interactive Surfaces; Virtual Reality Conference 2006; Alexandria, USA; ISBN 1087-8270; pp. 253--256  ",
      "doi": "10.1109/VR.2006.86"
    },
    {
      "text": "Dietz, P.; and Leigh, D.: Diamond Touch: A Multi-user Touch Technology; CHI 2001; Orlando, Florida, USA; ACM Press",
      "doi": ""
    },
    {
      "text": "Han, J.Y.: Low-cost Multi-touch Sensing Through Frustrated Total Internal Reflection; UIST 05: Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology; Seattle, WA, USA; ACM Press  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Ullmer, B.; and Ishii, H.: The metaDESK: Models and Prototypes for Tangible User Interfaces; UIST 97, Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology; 1997; Banff, Alberta, Canada; ACM Press  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Sugimoto, M.; Hosoi, K.; Hashizume, H.: Caretta: A System for Supporting Face-to-face Collaboration by Integrating Personal and Shared Spaces; CHI 04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems; 2004; Vienna, Austria; ACM Press  ",
      "doi": "10.1145/985692.985698"
    },
    {
      "text": "Microsoft Surface: http://www.microsoft.com/surface",
      "doi": ""
    },
    {
      "text": "Streitz, N.A.; Geissler, J.; Holmer, T.; Kononi, S.; Müller-Tomfelde, Ch.; Reischl, W.; Rexroth, P.; Seitz, P.; and Steinmetz, R.: i-LAND: An Interactive Landscape for Creativity and Innovation; Proceedings of SIGCHI Conference on Human Factors in Computing Systems: the CHI is the Limit; 1999; ACM Press  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Patten, J.; Ishii, H.; Hines, J.; and Pangaro, G.: Sensetable: A Wireless Object Tracking Platfrom for Tagible User Interfaces; Proceedings of the SIGCHI Conference on Human Factors in Computing Systems; 2001; ACM Press  ",
      "doi": "10.1145/365024.365112"
    }
  ]
}