{
  "doi": "10.1145/1357054.1357069",
  "title": "Communication chains and multitasking",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "83-92",
  "year": 2008,
  "badges": [],
  "abstract": "There is a growing literature on managing multitasking and interruptions in the workplace. In an ethnographic study, we investigated the phenomenon of communication chains, the occurrence of interactions in quick succession. Focusing on chains enable us to better understand the role of communication in multitasking. Our results reveal that chains are prevalent in information workers, and that attributes such as the number of links, and the rate of media and organizational switching can be predicted from the first catalyzing link of the chain. When chains are triggered by external interruptions, they have more links, a trend for more media switches and more organizational switches. We also found that more switching of organizational contexts in communication is associated with higher levels of stress. We describe the role of communication chains as performing alignment in multitasking and discuss the implications of our results.",
  "tags": [
    "multitasking",
    "interaction",
    "workplace",
    "communication"
  ],
  "authors": [
    {
      "name": "Norman Makoto Su",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81100108464/rel-imgonly/su_norman_2014_02_002.jpg",
      "acmid": "81100108464",
      "orcid": "missing"
    },
    {
      "name": "Gloria Mark",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279599",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailey, B. and Konstan, J. On the need for attention-aware systems: Measuring effects of interruption on task performance, error, and affective state. Computers in Human Behavior 22, 4 (2006), 685--708.",
      "doi": ""
    },
    {
      "text": "Bakeman, R. and Gottman, J. M. Observing Interaction. Cambridge University Press, Cambridge, UK, 1997.",
      "doi": ""
    },
    {
      "text": "Burnham, K. P. and Anderson, D. R. Model Selection and Inference: A Practical Information-Theoretical Approach. Springer, New York, NY, USA, 1998.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Horvitz, E. and Wilhite, S. A Diary Study of Task Switching and Interruptions. In Proc. of CHI'04, ACM Press (2004), 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Dabbish, L. and Kraut, R. E. Controlling interruptions: awareness displays and social motivation for coordination. In Proc. of CSCW '04, ACM Press (2004), 182--191.  ",
      "doi": "10.1145/1031607.1031638"
    },
    {
      "text": "Fogarty, J., Hudson and Lai, J. Examining the robustness of sensor-based statistical models of human interruptibility. In Proc. of CHI'04, ACM Press (2004), 207--214.  ",
      "doi": "10.1145/985692.985719"
    },
    {
      "text": "González, V. M. and Mark, G. Managing currents of work: Multitasking among multiple collaborations. In Proc. of ECSCW'05, Springer (2005), 143--162. ",
      "doi": "10.5555/1242029.1242037"
    },
    {
      "text": "González, V. M. and Mark, G. \"Constant, Constant, Multitasking Craziness\": Managing Multiple Working Spheres. In Proc. of CHI'04, ACM Press (2004), 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Grinstead, C. M. and Snell, J. L. Introduction to Probability. American Mathematical Society, Providence, RI, USA, 1997.",
      "doi": ""
    },
    {
      "text": "Hollan, J., Hutchins, E. and Kirsh, D. Distributed Cognition: Toward a New Foundation for Human-Computer Interaction Research. ACM TOCHI 7, 2 (2000), 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Hudson, J.M., Christensen, J., Kellogg, W.A. and Erickson, T. \"I'd be overwhelmed, but it's just one more thing to do:\" Availability and interruption in research management. In Proc. of CHI'02, (2002), 97--104.  ",
      "doi": "10.1145/503376.503394"
    },
    {
      "text": "Iqbal, S. T. and Horvitz, E. Disruption and Recovery of Computing Tasks: Field Study, Analysis and Directions. In Proc. of CHI'07, ACM Press (2007), 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Iqbal, S.T. and Horvitz, E. Conversations Admist Computing: A Study of Interruptions and Recovery of Task Activity. In Proc. of User Modeling '07, Springer (2007), 360--364.  ",
      "doi": "10.1007/978-3-540-73078-1_43"
    },
    {
      "text": "Karasek, R. A. Job Demands, Job Decision Latitude, and Mental Strain: Implications for Job Redesign. Administrative Science Quarterly 24, 2 (1979), 285--308.",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., Egido, C. and Galegher, J. Patterns of Contact and Communication in Scientific Research Collaborations. In Proc. of CSCW'88, ACM Press (1988), 1--12.  ",
      "doi": "10.1145/62266.62267"
    },
    {
      "text": "Mark, G., González, V. and Harris, J. No Task Left Behind? Examining the Nature of Fragmented Work. In Proc. of CHI'05, ACM Press (2005), 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Mintzberg, H. The Nature of Managerial Work. Harper &amp; Row, New York, NY, USA, 1973.",
      "doi": ""
    },
    {
      "text": "Nardi, B. A., Whittaker, S. Whittaker and Schwarz, H. NetWORKers and their Activity in Intensional Networks. CSCW 11, 1/2 (2002), 205--242.  ",
      "doi": "10.1023/A%3A1015241914483"
    },
    {
      "text": "Naur, P. Computing Versus Human Thinking. Communications of the ACM 50, 1 (2007), 85--94.  ",
      "doi": "10.1145/1188913.1188922"
    },
    {
      "text": "Nelson, B. L. Stochastic Modeling: Analysis &amp; Simulation. McGraw-Hill, New York, NY, USA, 1995.",
      "doi": ""
    },
    {
      "text": "Perlow, L. A. The Time Famine: Toward a Sociology of Work Time. Administrative Science Quarterly 44, 1 (1999), 57--81.",
      "doi": ""
    },
    {
      "text": "Pickering, M. and Garrod, S. Toward a mechanistic psychology of dialogue. Behavioral and Brain Sciences 27, 2 (2004), 169--226.",
      "doi": ""
    },
    {
      "text": "Reder, S. and Schwab, R. G. The Temporal Structure of Cooperative Activity. In Proc. of CSCW'90, ACM Press (1990), 303--316.  ",
      "doi": "10.1145/99332.99363"
    },
    {
      "text": "Sanderson, P. M. and Fisher, C. Exploratory Sequential Data Analysis: Foundations. Human-Computer Interaction 9, 3/4 (1994), 251--317.",
      "doi": ""
    },
    {
      "text": "Sproull, L. and Kiesler, S. Connections. The MIT Press, Cambridge, MA, USA, 1991.",
      "doi": "10.5555/117640"
    },
    {
      "text": "Strauss, A. Work and the division of labor. The Sociological Quarterly 26, 1 (1985), 1--19.",
      "doi": ""
    },
    {
      "text": "Su, N. M., Mark, G. and Sutton, S. A. Workplace Connectors as Facilitators for Work. In Proc. of Communities and Technologies '07, Springer (2007), 171--190.",
      "doi": ""
    },
    {
      "text": "Venolia, G. D. and Neustaedter, C. Understanding Sequence and Reply Relationships with Email Conversations: A Mixed-Model Visualization. In Proc. of CHI'03, ACM Press (2003), 361--368.  ",
      "doi": "10.1145/642611.642674"
    },
    {
      "text": "Whittaker, S., Frohlich, D. and Daly-Jones, O. (1994). Informal workplace communication: what is it like and how might we support it? In Proc. of CHI'94, ACM Press (1994), 131--137.  ",
      "doi": "10.1145/191666.191726"
    }
  ]
}