{
  "doi": "10.1145/1357054.1357162",
  "title": "The personal project planner: planning to organize personal information",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "681-684",
  "year": 2008,
  "badges": [],
  "abstract": "Prototyping and evaluation combine to explore ways that an effective, integrative organization of project-related information might emerge as a by-product of a person's efforts to plan a project. The Personal Project Planner works as an extension to the file manager -- providing people with rich-text overlays to their information. Document-like project plans provide a context in which to create or reference documents, email messages, web pages, etc. that are needed to complete the plan. The user can later locate an information item such as an email message with reference to the plan (e.g., as an alternative to searching through the inbox or sent mail). Results of an interim evaluation of the Planner are very promising and suggest special directions of focus for limited available prototyping resources.",
  "authors": [
    {
      "name": "William Jones",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100554899",
      "orcid": "missing"
    },
    {
      "name": "Predrag Klasnja",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594537",
      "orcid": "missing"
    },
    {
      "name": "Andrea Civan",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657149",
      "orcid": "0000-0003-4932-7314"
    },
    {
      "name": "Michael L. Adcock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580099",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, V. and Thornton, J., Managing Activities with TV-Acta: TaskVista and Activity-Centered Task Assistant. . in PIM 2006, The Second Workshop on Personal Information Management (PIM), sponsored by SIGIR, (Seattle, WA, USA, 2006).",
      "doi": ""
    },
    {
      "text": "Boardman, R., Spence, R. and Sasse, M.A., Too many hierarchies? : the daily struggle for control of the workspace. in HCI International 2003 : 10th International Conference on Human-Computer Interaction, (Crete, Greece, 2003), p. 616--620.",
      "doi": ""
    },
    {
      "text": "Bush, V. As We May Think The Atlantic Monthly, 1945, 641--649.",
      "doi": ""
    },
    {
      "text": "Buzan, T. and Buzan, B. The mind map book: How to use radiant thinking to maximize your brain's untapped potential. BBC, London, 2004.",
      "doi": ""
    },
    {
      "text": "Catarci, T., Dix, A., Katifori, A., Lepouras, G. and Poggi, A., Task-Centered Information Management. . in DELOS Conference 2007 on Working Notes, (Tirrenia, Pisa (Italy), 2007), 253--263. ",
      "doi": "10.5555/1782334.1782359"
    },
    {
      "text": "Czerwinski, M., Horvitz, E. and Wilhite, S., A diary study of task switching and interruptions. in ACM SIGCHI Conference on Human factors in Computing Systems (CHI 2004), (Vienna, Austria, 2004), ACM Press, 175 -- 182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Gonzalez, V.M. and Mark, G., Constant, constant, multitasking craziness': managing multiple working spheres. in CHI 2004, (2004), 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Jones, W. Keeping Found Things Found: The Study and Practice of Personal Information Management. Morgan Kaufmann Publishers, San Francisco, CA, 2007. ",
      "doi": "10.5555/2155696"
    },
    {
      "text": "Jones, W., Bruce, H., Foxley, A. and Munat, C., Planning personal projects and organizing personal information. in 69th Annual Meeting of the American Society for Information Science and Technology (ASIST 2006) (Austin, TX, 2006), American Society for Information Science &amp; Technology, TBD.",
      "doi": ""
    },
    {
      "text": "Kaptelinin, V., Integrating tools and tasks: UMEA: translating interaction histories into project contexts. in ACM SIGCHI Conference on Human Factors in Computing Systems (CHI 2003), (Ft. Lauderdale, FL, 2003), 353 -- 360.  ",
      "doi": "10.1145/642611.642673"
    },
    {
      "text": "Mark, G., Gonzalez, V.M. and Harris, J., No task left behind?: examining the nature of fragmented work. in CHI 2005, (Portland, OR, 2005), 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Russell, D.M., Stefik, M.J., Pirolli, P. and Card, S.K. The cost structure of sensemaking CHI 1993: Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM Press, Amsterdam, The Netherlands, 1993, 269--276. ",
      "doi": "10.5555/164632.164922"
    },
    {
      "text": "Shen, J., Li, L., Dietterich, T.G. and Herlocker, J.L. A hybrid learning system for recognizing user tasks from desktop activities and email messages Proceedings of the 11th international conference on Intelligent user interfaces, ACM Press, Sydney, Australia, 2006.  ",
      "doi": "10.1145/1111449.1111473"
    }
  ]
}