{
  "doi": "10.1145/1357054.1357286",
  "title": "LiveRAC: interactive visual exploration of system management time-series data",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1483-1492",
  "year": 2008,
  "badges": [],
  "abstract": "We present LiveRAC, a visualization system that supports the analysis of large collections of system management time-series data consisting of hundreds of parameters across thousands of network devices. LiveRAC provides high information density using a reorderable matrix of charts, with semantic zooming adapting each chart's visual representation to the available space. LiveRAC allows side-by-side visual comparison of arbitrary groupings of devices and parameters at multiple levels of detail. A staged design and development process culminated in the deployment of LiveRAC in a production environment. We conducted an informal longitudinal evaluation of LiveRAC to better understand which proposed visualization techniques were most useful in the target environment.",
  "authors": [
    {
      "name": "Peter McLachlan",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654521",
      "orcid": "missing"
    },
    {
      "name": "Tamara Munzner",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047885",
      "orcid": "0000-0002-3294-3869"
    },
    {
      "name": "Eleftherios Koutsofios",
      "institution": "AT&T Labs Inc. - Research, Florham Park, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289845",
      "orcid": "missing"
    },
    {
      "name": "Stephen North",
      "institution": "AT&T Labs Inc. - Research, Florham Park, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611984",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "W. Aigner et al. Visualizing time-oriented data: A systematic view. Computers and Graphics, 31(3):401--409, 2007.  ",
      "doi": "10.1016/j.cag.2007.01.030"
    },
    {
      "text": "J. Bertin. Graphics and graphic information processing. Walter de Gruyter, Berlin, Germany, 1981.",
      "doi": ""
    },
    {
      "text": "V. González and A. Kobsa. Benefits of information visualization systems for administrative data analysts. In IV '03: Proc. Intl. Conf. on Information Visualization, pages 331--336, 2003. ",
      "doi": "10.5555/938981.939600"
    },
    {
      "text": "V. González and A. Kobsa. A workplace study of the adoption of information visualization systems. Proc. I-KNOW '03: Intl. Conf. on Knowledge Management, pages 92--102, 2003.",
      "doi": ""
    },
    {
      "text": "H. Hochheiser and B. Shneiderman. Interactive exploration of time series data. In DS '01: Proc. Intl. Conf. on Discovery Science, pages 441--446. Springer-Verlag, 2001. ",
      "doi": "10.5555/647858.738708"
    },
    {
      "text": "R. Kincaid and H. Lam. Line Graph Explorer: scalable display of line graphs using Focus+Context. In AVI '06: Proc. Adv. Visual Interfaces, pages 404--411. ACM Press, 2006.  ",
      "doi": "10.1145/1133265.1133348"
    },
    {
      "text": "E. E. Koutsofios et al. Visualizing large-scale telecommunication networks and services (case study). In Vis '99: Proc. IEEE Conf. Visualization, pages 457--461, 1999. ",
      "doi": "10.5555/319351.319454"
    },
    {
      "text": "J. Lin et al. Visually mining and monitoring massive time series. In Proc. KDD '04, pages 460--469. ACM Press, 2004.  ",
      "doi": "10.1145/1014052.1014104"
    },
    {
      "text": "J. D. Mackinlay. Automating the Design of Graphical Presentations of Relational Information. ACM Trans. Graphics, 5(2):111--141, 1986.  ",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "P. McLachlan. LiveRAC - Live reorderable accordion drawing. Master's thesis, Univ. British Columbia CS Dept, 2006.",
      "doi": ""
    },
    {
      "text": "T. Munzner et al. TreeJuxtaposer: scalable tree comparison using Focus+Context with guaranteed visibility. ACM Trans. Graphics (Proc. SIGGRAPH '03), 22(3):453--462, 2003.  ",
      "doi": "10.1145/882262.882291"
    },
    {
      "text": "D. Nekrasovski et al. An evaluation of pan &amp; zoom and rubber sheet navigation with and without an overview. In Proc. CHI '06, pages 11--20. ACM Press, 2006.  ",
      "doi": "10.1145/1124772.1124775"
    },
    {
      "text": "K. Perlin and D. Fox. Pad: an alternative approach to the computer interface. In Proc. SIGGRAPH '93, pages 57--64. ACM Press, 1993.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "R. A. Rensink, J. K. O'Regan, and J. J. Clark. On the failure to detect changes in scenes across brief interruptions. In D. J. Simons, editor, Change Blindness and Visual Memory, pages 127--145. Psychology Press, London, 2000.",
      "doi": ""
    },
    {
      "text": "J. C. Roberts. State of the art: Coordinated &amp; multiple views in exploratory visualization. In Proc. CMV '07, pages 61--71, 2007.  ",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "G. Robertson, S. Card, and J. Mackinlay. The cognitive coprocessor architecture for interactive user interfaces. In Proc. UIST '89, pages 10--18, 1989.  ",
      "doi": "10.1145/73660.73662"
    },
    {
      "text": "M. Sarkar et al. Stretching the rubber sheet: a metaphor for viewing large layouts on small screens. In Proc. UIST '93, pages 81--91, 1993.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "B. Shneiderman. The eyes have it: A task by data type taxonomy for information visualizations. In VL '96: Proc. IEEE Symp. Visual Languages, pages 336--343, 1996. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "B. Shneiderman and C. Plaisant. Strategies for evaluating information visualization tools: multi-dimensional in-depth long-term case studies. In Proc. BELIV '06, pages 1--7. ACM Press, 2006.  ",
      "doi": "10.1145/1168149.1168158"
    },
    {
      "text": "H. Siirtola. Interaction with the reorderable matrix. In IV '99: Proc. Intl. Conf. on Information Visualisation, pages 272--277, 1999. ",
      "doi": "10.5555/555607.850368"
    },
    {
      "text": "J. Slack, K. Hildebrand, and T. Munzner. PRISAD: A partitioned rendering infrastructure for scalable accordion drawing (extended version). Information Visualization, 5(2):137--151, 2006.  ",
      "doi": "10.1145/1149731.1149737"
    },
    {
      "text": "C. Stolte, D. Tang, and P. Hanrahan. Query, analysis, and visualization of hierarchically structured data using Polaris. In Proc. KDD '02, pages 112--122, 2002.  ",
      "doi": "10.1145/775047.775064"
    },
    {
      "text": "E. Tufte. Envisioning Information. Graphics Press, 1990. ",
      "doi": "10.5555/78223"
    },
    {
      "text": "E. Tufte. Beautiful Evidence. Graphics Press, 2006. ",
      "doi": "10.5555/1198006"
    },
    {
      "text": "J. J. van Wijk and E. R. van Selow. Cluster and calendar based visualization of time series data. In Proc. InfoVis '99, pages 4--9, 1999. ",
      "doi": "10.5555/857189.857665"
    },
    {
      "text": "C. Ware. Information Visualization: Perception for Design. Morgan Kaufmann, 2nd edition, 2004. ",
      "doi": "10.5555/983611"
    }
  ]
}