{
  "doi": "10.1145/1357054.1357238",
  "title": "Performing thrill: designing telemetry systems and spectator interfaces for amusement rides",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1167-1176",
  "year": 2008,
  "badges": [],
  "abstract": "Fairground: Thrill Laboratory was a series of live events that augmented the experience of amusement rides. A wearable telemetry system captured video, audio, heart-rate and acceleration data, streaming them live to spectator interfaces and a watching audience. In this paper, we present a study of this event, which draws on video recordings and post-event interviews, and which highlights the experiences of riders, spectators and ride operators. Our study shows how the telemetry system transformed riders into performers, spectators into an audience, and how the role of ride operator began to include aspects of orchestration, with the relationship between all three roles also transformed. Critically, the introduction of a telemetry system seems to have had the potential to re-connect riders/performers back to operators/orchestrators and spectators/audience, re-introducing a closer relationship that used to be available with smaller rides. Introducing telemetry to a real-world situation also creates significant complexity, which we illustrate by focussing on a moment of perceived crisis.",
  "tags": [
    "wearable computing",
    "telemetry",
    "orchestration",
    "fairground",
    "theme-park",
    "performance",
    "spectator interface",
    "heart rate",
    "amusement",
    "biosensing"
  ],
  "authors": [
    {
      "name": "Holger Schnädelbach",
      "institution": "Mixed Reality Lab, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100504057",
      "orcid": "missing"
    },
    {
      "name": "Stefan Rennick Egglestone",
      "institution": "Mixed Reality Lab, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416605898",
      "orcid": "missing"
    },
    {
      "name": "Stuart Reeves",
      "institution": "Mixed Reality Lab, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100228688/rel-imgonly/headshot2-2016.jpg",
      "acmid": "81100228688",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "Mixed Reality Lab, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Brendan Walker",
      "institution": "Aerial, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423582",
      "orcid": "missing"
    },
    {
      "name": "Michael Wright",
      "institution": "Mixed Reality Lab, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659969",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aoki, P. and Woodruff, A., Ambiguity in the Design of Personal Communication Systems, in Proc. CHI2005, ACM Press (2005), 181--191.  ",
      "doi": "10.1145/1054972.1054998"
    },
    {
      "text": "Benford, S., Crabtree, A., Reeves, S., Flintham, M., Drozd, A., Sheridan, J. and Dix, A., The Frame of the Game: Blurring the Boundary between Fiction and Reality in Mobile Experiences, in Proc. CHI2006, ACM Press(2006), 427--436.  ",
      "doi": "10.1145/1124772.1124836"
    },
    {
      "text": "Brogni, A., Vinayagamoorthy, V., Steed, A., and Slater, M. Variations in physiological responses of participants during different stages of an immersive virtual environment experiment. In Proc. Symposium on Virtual Reality Software and Technology, ACM Press (2006), 376--382.  ",
      "doi": "10.1145/1180495.1180572"
    },
    {
      "text": "Chen, J., Flow in Games (and everything else), Communications of the ACM, 50, 4, (2007) 31--34.  ",
      "doi": "10.1145/1232743.1232769"
    },
    {
      "text": "Coverage of the 2006 formula one motor racing season, broadcast in the UK by the Independent Television Network (ITV) (2006), www.itv-f1.com/ (verified 14th December 2006).",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Tandavanitj, N., Steed, A., Benford, S., Rodden, T., Greenhalgh, C., Flintham, M., Anastasi, R., Drozd, A., Adams, M. and Row-Farr, J., Orchestrating a mixed reality game 'on the ground, in Proc. CHI2004, ACM Press (2004), 391--398.  ",
      "doi": "10.1145/985692.985742"
    },
    {
      "text": "Heath, C., Luff, P. K., vom Lehn, D., Hindmarsh, J., and Cleverly, J., Crafting participation: Designing ecologies, configuring experience. Visual Communication 1, 1, (2002), 9--34.",
      "doi": ""
    },
    {
      "text": "Koleva, B., Taylor, I., Benford, S., Fraser, M., Greenhalgh, C., Schnädelbach, H., vom Lehn, D., Heath, C., Row-Farr, J., Orchestrating a Mixed Reality Performance, in Proc. CHI2001, ACM Press (2001), 38--45.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Mandryk, R. and Inkpen, K., Physiological indicators for the evaluation of co-located collaborative play, in Proc. CSCW2004, ACM Press (2004). 102--111.  ",
      "doi": "10.1145/1031607.1031625"
    },
    {
      "text": "Nenonen, V., Lindblad, A., Häkinnen, V., Laitinen, T., Jouhtio, M., Hämäläinen, P., Using heart-rate to control an interactive game, in Proc. CHI 2007, ACM Press (2007), 853--858.  ",
      "doi": "10.1145/1240624.1240752"
    },
    {
      "text": "Nichols, K., They Seek Him here, They Seek Him There: True Tales of a Travelling Showman, Keith Nichols, UK, 1995.",
      "doi": ""
    },
    {
      "text": "Pausch, R., Snoddy, J., Taylor, R., Watson, S., and Haseltine, E. 1996. Disney's Aladdin: first steps toward storytelling in virtual reality, in Proc. SIGGRAPH96, ACM Press (1996), 193--203.  ",
      "doi": "10.1145/237170.237257"
    },
    {
      "text": "Reeves, S., Benford, S., O'Malley, C. and Fraser, M., Designing the spectator experience, in Proc. CHI2005, ACM Press (2005), 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Rowe, D., Silbert, J. and Irwin, D. Heart Rate Variability: Indicator of User State as an Aid to Human-Computer Interaction, in Proc. CHI98, ACM Press (1998), 480--487.  ",
      "doi": "10.1145/274644.274709"
    },
    {
      "text": "Trowell, I., Fairground rides --- a chronological development. Published by the national fairground archive. www.nfa.dept.shef.ac.uk/history/rides/index.php (verified 12th January 2007).",
      "doi": ""
    },
    {
      "text": "vom Lehn, D., Heath, C. and Hindmarsh, J., Exhibiting interaction: Conduct and collaboration in museums and galleries. Symbolic Interaction, 24, 2, 189--216.",
      "doi": ""
    },
    {
      "text": "Walker, B., Schnädelbach, H., Rennick Egglestone, S., Clarke, A., Ng, K.H., Wright, M., Rodden, T., Benford, S. and French, A. Augmenting amusement rides with telemetry, in Proc. ACE2007, ACM Press (2007), 115--122.  ",
      "doi": "10.1145/1255047.1255070"
    },
    {
      "text": "Worsell, N. and Ioannides, A. Safety integrity levels of fairground ride control systems. Published by UK Health and Safety Executive and available through the UK Health and Safety Laboratory library.",
      "doi": ""
    }
  ]
}