{
  "doi": "10.1145/1357054.1357169",
  "title": "MySong: automatic accompaniment generation for vocal melodies",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "725-734",
  "year": 2008,
  "badges": [],
  "abstract": "We introduce MySong, a system that automatically chooses chords to accompany a vocal melody. A user with no musical experience can create a song with instrumental accompaniment just by singing into a microphone, and can experiment with different styles and chord patterns using interactions designed to be intuitive to non-musicians. We describe the implementation of MySong, which trains a Hidden Markov Model using a music database and uses that model to select chords for new melodies. Model parameters are intuitively exposed to the user. We present results from a study demonstrating that chords assigned to melodies using MySong and chords assigned manually by musicians receive similar subjective ratings. We then present results from a second study showing that thirteen users with no background in music theory are able to rapidly create musical accompaniments using MySong, and that these accompaniments are rated positively by evaluators.",
  "authors": [
    {
      "name": "Ian Simon",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387596086",
      "orcid": "missing"
    },
    {
      "name": "Dan Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81405594249/rel-imgonly/dan_bass_brightened.jpg",
      "acmid": "81405594249",
      "orcid": "missing"
    },
    {
      "name": "Sumit Basu",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100645745",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allan, M., Williams, C.K.I. Harmonising Chorales by Probabilistic Inference. NIPS 2005.",
      "doi": ""
    },
    {
      "text": "Boersma, P, Accurate short-term analysis of the fundamental frequency and the harmonics-to-noise ratio of a sampled sound. Proc Inst Phonetic Sci, v17, 1993.",
      "doi": ""
    },
    {
      "text": "Buchholz, J., Lee, E., Borchers, J. coJIVE: A System to Support Collaborative Jazz Improvisation. Technical Report, AIB-2007-04, RWTH Aachen Univ, 2007.",
      "doi": ""
    },
    {
      "text": "Chuan, C.-H., Chew, E. A Hybrid System for Automatic Generation of Style-Specific Accompaniment. 4th Intl Joint Workshop on Computational Creativity, June 2007.",
      "doi": ""
    },
    {
      "text": "Cunha, U., Ramalho, G. (1999). An Intelligent Hybrid Model for Chord Prediction. Organised Sound 4(2), 115--19. Cambridge University Press.  ",
      "doi": "10.1017/S1355771899002071"
    },
    {
      "text": "Farbood, M., Pasztor, E., Jennings, K. Hyperscore: A Graphical Sketchpad for Novice Composers. IEEE Comp Graph and Appl, Jan 2004.  ",
      "doi": "10.1109/MCG.2004.1255809"
    },
    {
      "text": "Forney, D. The Viterbi algorithm. Proc IEEE 61(3), 1973.",
      "doi": ""
    },
    {
      "text": "Gang, D., Lehman, D., Wagner, N. Tuning a Neural Network for Harmonizing Melodies in Real-Time. ICMC 1998.",
      "doi": ""
    },
    {
      "text": "Grub, L., Dannenberg, R. A Stochastic Method of Tracking a Vocal Performer. ICMC 1997.",
      "doi": ""
    },
    {
      "text": "Klein, J. A Pattern-Based Software Framework for Computer Aided Jazz Improvisation. PhD Thesis, RWTH Aachen, 2005.",
      "doi": ""
    },
    {
      "text": "Obrenovic, Z. A flexible system for creating music while interacting with the computer. ACM MM 2005.  ",
      "doi": "10.1145/1101149.1101355"
    },
    {
      "text": "Orio, N., Déchelle, F. Score Following Using Spectral Analysis and Hidden Markov Models. ICMC 2001.",
      "doi": ""
    },
    {
      "text": "Paiement, J.-F., Eck, D., Bengio, S. Probabilistic Melodic harmonization. Proc Canandian Conf AI, 2006.  ",
      "doi": "10.1007/11766247_19"
    },
    {
      "text": "Pardo, B., Birmingham, W. Modeling Form for On-line Following of Musical Performances. AAAI 2005. ",
      "doi": "10.5555/1619410.1619496"
    },
    {
      "text": "PG Music Inc: Band-in-a-Box. http://www.pgmusic.com",
      "doi": ""
    },
    {
      "text": "Rabiner, L. R. A Tutorial on Hidden Markov Models and Selected Applications. Proc IEEE, 77(2) (1989).",
      "doi": ""
    },
    {
      "text": "Raphael, C. A Hybrid Graphical Model for Aligning Polyphonic Audio with Musical Scores. ICMIR 2004.",
      "doi": ""
    },
    {
      "text": "Schwarz, D., Orio, N., Schnell, N. Robust Polyphonic MIDI Score Following with Hidden Markov Models. ICMC 2004.",
      "doi": ""
    },
    {
      "text": "Weinberg, G. Interconnected Musical Networks - Bringing Expression and Thoughtfulness to Collaborative Music Making. PhD Thesis, MIT, 2003. ",
      "doi": "10.5555/979469"
    }
  ]
}