{
  "doi": "10.1145/1357054.1357223",
  "title": "Pick me!: link selection in expertise search results",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1089-1092",
  "year": 2008,
  "badges": [],
  "abstract": "Expertise locator systems have been designed to help find experts within organizations. While there are many examples of these systems in the literature, there has not been any systematic analysis of the factors that predict whether a particular expertise search result will be selected for further exploration. This paper describes a study of 67 employees from 21 countries that performed a specific expertise search to find an expert using an expertise locator system. Rank order and social connection information displayed in snippets of search results were found to significantly predict whether a user considers a particular search result for further exploration. Implications for the design of expertise location systems and future research directions are discussed.",
  "tags": [
    "people search",
    "social networks",
    "expertise search"
  ],
  "authors": [
    {
      "name": "N. Sadat Shami",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100499118/rel-imgonly/sadat_shami.png",
      "acmid": "81100499118",
      "orcid": "missing"
    },
    {
      "name": "Kate Ehrlich",
      "institution": "IBM TJ Watson Research Center, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331492075",
      "orcid": "missing"
    },
    {
      "name": "David R. Millen",
      "institution": "IBM TJ Watson Research Center, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100086599/rel-imgonly/81100086599.jpg",
      "acmid": "81100086599",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S., Pipek, V., and Wulf, V. Sharing Expertise: Beyond Knowledge Management. MIT Press 2002. ",
      "doi": "10.5555/572524"
    },
    {
      "text": "Clarke, C.L., Agichtein, E., Dumais, S., and White, R.W. The influence of caption features on clickthrough patterns in web search. In Proc. SIGIR 2007, ACM Press (2007), 135--142.  ",
      "doi": "10.1145/1277741.1277767"
    },
    {
      "text": "Constant, D., Sproull, L., and Kiesler, S. The Kindness of Strangers: The Usefulness of Electronic Weak Ties for Technical Advice. Org. Science 7, 2 (1996) 119--135.",
      "doi": ""
    },
    {
      "text": "Cuttrell, E., and Guan, Z. What are you looking for? An eye-tracking study of information usage in web search. In Proc. CHI 2007, ACM Press (2007), 407 -- 416.  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Ehrlich, K. Locating expertise: Design issues for an expertise locator system. In Ackerman, M.S., Pipek, V., P., Wulf, V. (eds.), Sharing Expertise: Beyond Knowledge Management. MIT Press, Cambridge, MA, USA, 2003.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K., Lin, C.Y., and Griffiths-Fisher, V. Searching for Experts in the Enterprise: Combining Text and Social Network Analysis. In Proc. GROUP 2007, (2007).  ",
      "doi": "10.1145/1316624.1316642"
    },
    {
      "text": "Fiore, A.T., and Donath, J.S. Homophily in online dating: when do you like someone like yourself? In Proc. CHI 2005, ACM Press (2005), 1371--1374.  ",
      "doi": "10.1145/1056808.1056919"
    },
    {
      "text": "Granovetter, M.S. The Strength of Weak Ties. American Journal of Sociology 78, 6 (1973) 1360--1380.",
      "doi": ""
    },
    {
      "text": "Guan, Z., and Cutrell, E. An eye tracking study of the effect of target rank on web search. In Proc. CHI 2007, ACM Press (2007), 417--420.  ",
      "doi": "10.1145/1240624.1240691"
    },
    {
      "text": "Hansen, M. The search-transfer problem: The role of weak ties in sharing knowledge across organization subunits. Admin. Science Quarterly 44, (1999) 82--111.",
      "doi": ""
    },
    {
      "text": "Joachims, T., Granka, L., Pan, B., and Gay, G. Accurately interpreting clickthrough data as implicit feedback. In Proc. SIGIR 2005, ACM Press (2005), 154--161.  ",
      "doi": "10.1145/1076034.1076063"
    },
    {
      "text": "Kautz, H., Selman, B., and Shah, M. Referral Web: combining social networks and collaborative filtering. Communications ACM 40, 3 (1997), 63--65.  ",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Lin, C.-Y., Griffiths-Fisher, V., Ehrlich, K., and Desforges, C. SmallBlue: People Mining for Expertise Search and Social Network Analysis. IEEE Multimedia Magazine (2008).  ",
      "doi": "10.1109/MMUL.2008.17"
    },
    {
      "text": "McDonald, D.W., and Ackerman, M.S. Expertise recommender: A flexible recommendation system and architecture. In Proc. CSCW 2000, ACM Press (2000), 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Nardi, B.A., Whittaker, S., and Schwarz, H. It's not what you know, it's who you know: Work in the information age. First Monday, 2002.",
      "doi": ""
    },
    {
      "text": "Norton, E.C., Bieler, G.S., Ennett, S.T., and Zarkin, G.A. Analysis of prevention program effectiveness with clustered data using generalized estimating equations. J. of Consulting and Clinical Psychology 64, 5 (1996), 919--926.",
      "doi": ""
    },
    {
      "text": "Pan, B., Hembrooke, H., Joachims, T., Lorigo, L., Gay, G., and Granka, L. In Google we trust: Users' decisions on rank, position, and relevance. Journal of Computer-Mediated Communication 12, 3 (2007).",
      "doi": ""
    },
    {
      "text": "Shami, N.S., Yuan, Y., Cosley, D.R., Xia, L., and Gay, G.K. That's what friends are for: Facilitating awareness of 'who knows what' across group boundaries. In Proc. GROUP 2007, ACM Press (2007).  ",
      "doi": "10.1145/1316624.1316681"
    },
    {
      "text": "Terveen, L., and McDonald, D.W. Social matching: A framework and research agenda. ACM Trans. Comp. Human Inter. (TOCHI) 12, 3 (2005) 401--434.  ",
      "doi": "10.1145/1096737.1096740"
    }
  ]
}