{
  "doi": "10.1145/1357054.1357326",
  "title": "Photos on the go: a mobile application case study",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1739-1748",
  "year": 2008,
  "badges": [],
  "abstract": "We designed and iterated on a photo browsing application for high-end mobile phones. The application, Zurfer, supports viewing of photos from the user, their contacts, and the general user population. Photos are organized using a channel metaphor, driven by multiple dimensions: social, spatial and topical. Zurfer was deployed to over 500 users; extensive user research was conducted with nine participants. The data from the deployment and the study exposes general themes of mobile application use, as well as requirements for mobile applications in the photos domain, mobile social applications, and entertainment-driven mobile applications.",
  "tags": [
    "photographs",
    "mobile applications",
    "user study",
    "photo browsing",
    "photo sharing",
    "mobile"
  ],
  "authors": [
    {
      "name": "Mor Naaman",
      "institution": "Yahoo! Inc., Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    },
    {
      "name": "Rahul Nair",
      "institution": "Yahoo! Inc., Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489425",
      "orcid": "missing"
    },
    {
      "name": "Vlad Kaplun",
      "institution": "Yahoo! Inc., Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350586399",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Flickr (Yahoo! Inc). http://www.flickr.com",
      "doi": ""
    },
    {
      "text": "Ahern, S., King, S., Qu, H., and Davis, M. 2005. PhotoRouter: destination-centric mobile media messaging. In Proc., MULTIMEDIA 2005. ACM Press (2005), 209--210.  ",
      "doi": "10.1145/1101149.1101180"
    },
    {
      "text": "Ames, M. and Naaman, M. Why we tag: motivations for annotation in mobile and online media. In Proc., CHI 2007. ACM Press (2007). 971--980.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Balabanovi?, M., Chu, L. L., and Wolff, G. J. Storytelling with digital photographs. In Proc., CHI 2000. ACM Press (2000), 564--571.  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Bentley, F., Metcalf, C., and Harboe, G. 2006. Personal vs. commercial content: the similarities between consumer use of photos and music. In Proc., CHI 2006. ACM Press (2006), 667--676.  ",
      "doi": "10.1145/1124772.1124871"
    },
    {
      "text": "Church, K., Smyth, B., Cotter, P., and Bradley, K. Mobile information access: A study of emerging search behavior on the mobile Internet. ACM Trans. Web 1, 1 (May. 2007), 4.  ",
      "doi": "10.1145/1232722.1232726"
    },
    {
      "text": "Counts, S. and Fellheimer, E. Supporting social presence through lightweight photo sharing on and off the desktop. In Proc., CHI 2004. ACM Press (2004), 599--606.  ",
      "doi": "10.1145/985692.985768"
    },
    {
      "text": "Davis, M., Van House, N., Towle, J., King, S., Ahern, S., Burgener, C., Perkel, D., Finn, M., Viswanathan, V., and Rothenberg, M. MMM2: mobile media metadata for media sharing. In Ext. Abstracts CHI 2005. ACM Press (2005), 1335--1338.  ",
      "doi": "10.1145/1056808.1056910"
    },
    {
      "text": "Frohlich, D., Kuchinsky, A., Pering, C., Don, A., and Ariss, S. Requirements for photoware. In Proc., CSCW 2002. ACM Press (2002), 166--175.  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Harada, S., Naaman, M., Song, Y. J., Wang, Q., and Paepcke, A. Lost in memories: interacting with photo collections on PDAs. In Proc., JCDL 2004. ACM Press (2004), 325--333.  ",
      "doi": "10.1145/996350.996425"
    },
    {
      "text": "Hwang, A., Ahern, S., King, S., Naaman, M., Nair , R. and Yang, J. Zurfer: Mobile Multimedia Access in Spatial, Social and Topical Context. In Proc., MULTIMEDIA 2007. ACM Press (2007), 557--560.  ",
      "doi": "10.1145/1291233.1291370"
    },
    {
      "text": "Jacucci, G., Oulasvirta, A., Salovaara, A., and Sarvas, R. 2005. Supporting the shared experience of spectators through mobile group media. In Proc., GROUP 2005. ACM Press (2005), 207--216.  ",
      "doi": "10.1145/1099203.1099241"
    },
    {
      "text": "Kamvar, M. and Baluja, S. A large scale study of wireless search behavior: Google mobile search. In Proc., CHI 2006, ACM Press (2006), 701--709.  ",
      "doi": "10.1145/1124772.1124877"
    },
    {
      "text": "Khella, A. and Bederson, B. B. 2004. Pocket PhotoMesa: a Zoomable image browser for PDAs. In Proc., MUM 2004, vol. 83. ACM Press (2004), 19--24.  ",
      "doi": "10.1145/1052380.1052384"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., and Sellen, A. I saw this and thought of you: some social uses of camera phones. In Ext. Abstracts CHI 2005, ACM (2005), 1545--1548.  ",
      "doi": "10.1145/1056808.1056962"
    },
    {
      "text": "Kirk, D., Sellen, A., Rother, C., and Wood, K. Understanding photowork. In Proc., CHI 2006. ACM Press (2006), 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Lerman, K., and Jones, L. Social Browsing on Flickr. In Proc., ICWSM 2007.",
      "doi": ""
    },
    {
      "text": "Liu, H., Xie, X., Ma, W., and Zhang, H. 2003. Automatic browsing of large pictures on mobile devices. In Proc., MULTIMEDIA 2003. ACM Press (2003), 148--155.  ",
      "doi": "10.1145/957013.957045"
    },
    {
      "text": "Naaman, M., Song, Y. J., Paepcke, A., and Garcia-Molina, H. Automatic organization for digital photographs with geographic coordinates. In Proc., JCDL 2004. ACM Press (2004), 53--62.  ",
      "doi": "10.1145/996350.996366"
    },
    {
      "text": "O'Hara, K., Mitchell, A. S., and Vorbau, A. 2007. Consuming video on mobile devices. In Proc., CHI 2007. ACM Press (2007), 857--866.  ",
      "doi": "10.1145/1240624.1240754"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V., and Kuorelahti, J. (2005). Interaction in 4-second bursts: The fragmented nature of attentional resources in mobile HCI. In Proc., CHI 2005. ACM Press (2005), 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Pauty, J., Couderc, P., and Banâtre, M. Using context to navigate through a photo collection. In Proc., MobileHCI 2005, vol. 111. ACM Press (2005), 857--866.  ",
      "doi": "10.1145/1085777.1085802"
    },
    {
      "text": "Pigeau, A. and Gelgon, M. Building and tracking hierarchical geographical &amp; temporal partitions for image collection management on mobile devices. In Proc., MULTIMEDIA 2005. ACM Press (2005), 141--150.  ",
      "doi": "10.1145/1101149.1101170"
    },
    {
      "text": "Sarvas, R., Oulasvirta, A., and Jacucci, G. 2005. Building social discourse around mobile photos: a systemic perspective. In Proc., MobileHCI 2005, vol. 111. ACM Press (2005), 31--38.  ",
      "doi": "10.1145/1085777.1085783"
    },
    {
      "text": "Setlur, V., Takagi, S., Raskar, R., Gleicher, M., and Gooch, B. Automatic image retargeting. In Proc., MUM 2005. ACM Press (2005), 59--68.  ",
      "doi": "10.1145/1149488.1149499"
    },
    {
      "text": "Toyama, K., Logan, R., and Roseway, A. Geographic location tags on digital images. In Proc., MULTIMEDIA 2003. ACM Press (2003), 156--166.  ",
      "doi": "10.1145/957013.957046"
    },
    {
      "text": "Van House, N. A. Flickr and public image-sharing: distant closeness and photo exhibition. In Ext. Abstracts, CHI 2007. ACM Press (2007), 2717--2722.  ",
      "doi": "10.1145/1240866.1241068"
    },
    {
      "text": "Van House, N. A. Interview viz: visualization-assisted photo elicitation. In Ext. Abstracts, CHI 2006. ACM Press (2006), 1463--1468.  ",
      "doi": "10.1145/1125451.1125720"
    },
    {
      "text": "Wang, M., Xie, X., Ma, W., and Zhang, H. 2003. MobiPicture: browsing pictures on mobile devices. In Proc., MULTIMEDIA 2003. ACM Press (2003), 106--107.  ",
      "doi": "10.1145/957013.957037"
    }
  ]
}