{
  "doi": "10.1145/1357054.1357299",
  "title": "Evaluating tactile feedback and direct vs. indirect stylus input in pointing and crossing selection tasks",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1563-1572",
  "year": 2008,
  "badges": [],
  "abstract": "We present a pair of experiments that explore the effects of tactile-feedback and direct vs. indirect pen input on pointing and crossing selection tasks. While previous work has demonstrated the validity of crossing as a useful selection mechanism for pen-based computing, those experiments were conducted using an indirect input device -- one in which the pen-input and display were separated. We investigate users' performance with pointing and crossing interfaces controlled via not only an indirect input device, but also a direct input device -- one in which the pen-input and display are co-located. Results show that direct input significantly outperforms indirect input for crossing selection, but the two modalities are essentially equivalent in pointing selection. A small amount of tactile feedback is shown to be beneficial for both pointing and crossing selection, most noticeably in crossing tasks when using direct input where visual feedback is often occluded by a hand or stylus.",
  "tags": [
    "crossing interfaces",
    "direct & indirect input",
    "haptic & tactile feedback",
    "pen/stylus input"
  ],
  "authors": [
    {
      "name": "Clifton Forlines",
      "institution": "Mitsubishi Electric Research Laboratories, Cambridge, MA, USA and University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584798",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. (2002). More than dotting the i's - foundations for crossing-based interfaces. ACM CHI Conference on Human Factors in Computing Systems. p. 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Akamatsu, M. and MacKenzie, S. (1996). Movement characteristics using a mouse with tactile and force feedback. International Journal Human-Computer Studies, 45(4). p. 483--493.  ",
      "doi": "10.1006/ijhc.1996.0063"
    },
    {
      "text": "Akamatsu, M., MacKenzie, S., and Hasbrouc, T. (1995). A comparison of tactile, auditory, and visual feedback in a pointing task using a mouse-type device. Ergonomics, 38(815--827).",
      "doi": ""
    },
    {
      "text": "Apitz, G. and Guimbretière, F. (2004). CrossY: a crossing-based drawing application. ACM UIST Symposium on User Interface Software and Technology. p. 3--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Baudisch, P. (1998). Don't click, paint! Using toggle maps to manipulate sets of toggle switches. ACM UIST Symposium on User Interface Software and Technology. p. 65--66.  ",
      "doi": "10.1145/288392.288574"
    },
    {
      "text": "Blaine, T. and Perkis, T. (2000). Jam-O-Drum: A study in interaction design. ACM DIS Conference on Designing Interactive Systems. p. 165--173.  ",
      "doi": "10.1145/347642.347705"
    },
    {
      "text": "Everitt, K., Forlines, C., Ryall, K., and Shen, C. (2005). Observations of a shared tabletop user study. Interactive poster in ACM CSCW Conference on Computer-Supported Cooperative Work.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47. p. 381--391.",
      "doi": ""
    },
    {
      "text": "Fukumoto, M. and Sugimura, T. (2001). Active click tactile feedback for touch panels. Extended Abstracts of the ACM CHI Conference on Human Factors in Computing Systems. p. 121--122.  ",
      "doi": "10.1145/634067.634141"
    },
    {
      "text": "Lee, J., Dietz, P., Leigh, D., Yerazunis, W., and Hudson, S. (2004). Haptic pen: a tactile feedback stylus for touch screens. ACM UIST Symposium on User Interface Software and Technology. p. 291--294.  ",
      "doi": "10.1145/1029632.1029682"
    },
    {
      "text": "MacKenzie, S. (1992). Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7. p. 91--139.",
      "doi": ""
    },
    {
      "text": "Oakley, I., Adams, A., Brewster, S., and Gray, P. (2002). Guidelines for the design of haptic widgets. Proceedings of the British HCI Conference. p. 195--212.",
      "doi": ""
    },
    {
      "text": "Oakley, I., Brewster, S., and Gray, P. (2001). Solving multi-target haptic problems in menu interaction. Extended Abstracts of ACM CHI Conference on Human Factors in Computing Systems. p. 357--358.  ",
      "doi": "10.1145/634067.634278"
    },
    {
      "text": "Poupyrev, I. and Maruyama, S. (2003). Tactile inter-faces for small touch screens. ACM UIST Symposium on User Interface Software and Technology. p. 217--220.  ",
      "doi": "10.1145/964696.964721"
    },
    {
      "text": "Poupyrev, I., Okabe, M., and Maruyama, S. (2004). Haptic feedback for pen computing: directions and strategies. Extended Abstracts of ACM CHI Conference on Human Factors in Computing Systems. p. 1309--1312.  ",
      "doi": "10.1145/985921.986051"
    },
    {
      "text": "Ren, X. and Moriya, S. (2000). Improving selection performance on pen-based systems: a study of pen-based interaction for selection tasks. ACM Transactions on Computer-Human Interaction, 7(3). p. 384--416.  ",
      "doi": "10.1145/355324.355328"
    },
    {
      "text": "Rosenbaum, D. (1991). Human motor control. San Diego, CA: Academic Press.",
      "doi": ""
    },
    {
      "text": "Schneiderman, B. (1991). Touch screens now offer compelling uses, IEEE Software, 8(2). p. 93--94.  ",
      "doi": "10.1109/52.73754"
    },
    {
      "text": "Zhai, S. (2004). Characterizing computer input with Fitts' law parameters - The information and non-information aspects of pointing. International Journal of Human-Computer Studies, 61(6). p. 791--809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    },
    {
      "text": "Zhai, S., Kong, J., and Ren, X. (2004). Speed-accuracy trade-off in Fitts' law tasks - On the equivalency of actual and nominal pointing precision. International Journal of Human-Computer Studies, 61(6). p. 823--856.  ",
      "doi": "10.1016/j.ijhcs.2004.09.007"
    }
  ]
}