{
  "doi": "10.1145/1357054.1357264",
  "title": "Sigma lenses: focus-context transitions combining space, time and translucence",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1343-1352",
  "year": 2008,
  "badges": [],
  "abstract": "Focus + context techniques such as fisheye lenses are used to navigate and manipulate objects in multi-scale worlds. They provide in-place magnification of a region without requiring users to zoom the whole representation and consequently lose context. Their adoption is however hindered by usability problems mostly due to the nature of the transition between focus and context. Existing transitions are often based on a physical metaphor (magnifying glass, fisheye, rubber sheet), and are almost always achieved through a single dimension: space. We investigate how other dimensions, namely time and translucence, can be used to achieve more efficient transitions. We present an extension to Carpendale's framework for unifying presentation space accommodating these new dimensions. We define new lenses in that space, called Sigma lenses, and compare them to existing lenses through experiments based on a generic task: focus targeting. Results show that one new lens, the Speed-coupled flattening lens, significantly outperforms all others.",
  "authors": [
    {
      "name": "Emmanuel Pietriga",
      "institution": "Institut National de Re her he en Informatique et en Automatique (INRIA), Orsay, France",
      "img": "/do/10.1145/contrib-81100222004/rel-imgonly/id2013.jpg",
      "acmid": "81100222004",
      "orcid": "missing"
    },
    {
      "name": "Caroline Appert",
      "institution": "LRI - Université Paris Sud, Orsay, France",
      "img": "/do/10.1145/contrib-81311484266/rel-imgonly/id-appert.jpg",
      "acmid": "81311484266",
      "orcid": "0000-0002-3050-9284"
    }
  ],
  "references": [
    {
      "text": "P. Baudisch and C. Gutwin. Multiblending: displaying overlapping windows simultaneously without the drawbacks of alpha blending. In CHI '04: Proc. Human Factors in Computing Systems, pages 367--374. ACM Press, 2004.  ",
      "doi": "10.1145/985692.985739"
    },
    {
      "text": "E. Bier, M. Stone, K. Pier, W. Buxton, and T. DeRose. Toolglass and magic lenses: the see--through interface. In SIGGRAPH '93: Proc. Computer graphics and interactive techniques, pages 73--80. ACM Press, 1993.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "M. S. T. Carpendale, D. J. Cowperthwaite, and F. D. Fracchia. 3-dimensional pliable surfaces: for the effective presentation of visual information. In UIST '95: Proc. ACM Symp. on User Interface Software and Te?hnology, pages 217--226. ACM Press, 1995.  ",
      "doi": "10.1145/215585.215978"
    },
    {
      "text": "M. S. T. Carpendale, D. J. Cowperthwaite, and F. D. Fracchia. Making distortions comprehensible. In VL '97: Proc. of the 1997 IEEE Symp. on Visual Languages, page 36. IEEE Comput. Soc., 1997. ",
      "doi": "10.5555/832278.834432"
    },
    {
      "text": "M. S. T. Carpendale and C. Montagnese. A framework for unifying presentation space. In UIST '01: Proc. ACM Symp. on User Interface Software and Technology, pages 61--70. ACM Press, 2001.  ",
      "doi": "10.1145/502348.502358"
    },
    {
      "text": "S. Carpendale, J. Ligh, and E. Pattison. Achieving higher magnification in context. In UIST '04: Proc. ACM Symp. on User Interface Software and Technology, pages 71--80. ACM Press, 2004.  ",
      "doi": "10.1145/1029632.1029645"
    },
    {
      "text": "D. A. Cox, J. S. Chugh, C. Gutwin, and S. Greenberg. The usability of transparent overview layers. In CHI 98 conference summary on Human factors in computing systems, pages 301--302. ACM Press, 1998.  ",
      "doi": "10.1145/286498.286777"
    },
    {
      "text": "C. Forlines, D. Vogel, and R. Balakrishnan. Hybridpointing: fluid switching between absolute and relative pointing with a direct input device. In UIST '06: Proc. ACM Symp. on User Interface Software and Technology, pages 211--220. ACM Press, 2006.  ",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "G. W. Furnas and B. B. Bederson. Space-scale diagrams: understanding multiscale interfaces. In CHI '95: Proc. Human Factors in Computing Systems, pages 234--241. ACM Press/Addison-Wesley, 1995.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "Y. Guiard and M. Beaudouin-Lafon. Target acquisition in multiscale electronic worlds. Int. J. Hum.-Comput. Stud., 61(6):875-905, Dec. 2004.  ",
      "doi": "10.1016/j.ijhcs.2004.09.005"
    },
    {
      "text": "C. Gutwin. Improving focus targeting in interactive fisheye views. In CHI '02: Proc. Human Factors in Computing Systems, pages 267--274. ACM Press, 2002.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "C. Gutwin, J. Dyck, and C. Fedak. The effects of dynamic transparency on targeting performance. In Graphics Interface, pages 105--112. A K Peters, 2003.",
      "doi": ""
    },
    {
      "text": "C. Gutwin and C. Fedak. A comparison of fisheye lenses for interactive layout tasks. In Graphics Interface, pages 213--220. A K Peters, 2004. ",
      "doi": "10.5555/1006058.1006084"
    },
    {
      "text": "C. Gutwin and A. Skopik. Fisheyes are good for large steering tasks. In CHI '03: Proc. Human Factors in Computing Systems, pages 201--208. ACM Press, 2003.  ",
      "doi": "10.1145/642611.642648"
    },
    {
      "text": "B. L. Harrison, H. Ishii, K. J. Vicente, and W. A. S. Buxton. Transparent layered user interfaces: an evaluation of a display design to enhance focused and divided attention. In CHI '95: Proc. Human Factors in Computing Systems, pages 317--324. ACM Press/Addison--Wesley Publishing Co., 1995.  ",
      "doi": "10.1145/223904.223945"
    },
    {
      "text": "K. Hornbæck, B. B. Bederson, and C. Plaisant. Navigation patterns and usability of zoomable user interfaces with and without an overview. ACM Trans. Comput.-Hum. Interact., 9(4):362--389, 2002.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "T. Igarashi and K. Hinckley. Speed-dependent automatic zooming for browsing large documents. In UIST '00: Proc. ACM Symp. on User Interface Software and Technology, pages 139--148. ACM Press, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "ISO. 9241-9 Ergonomic requirements for office work with visual display terminals (VDTs)-Part 9: Requirements for non-keyboard input devices. International Organization for Standardization, 2000.",
      "doi": ""
    },
    {
      "text": "T. A. Keahey and E. L. Robertson. Techniques for non-linear magnification transformations. In INFOVIS '96: IEEE Symp. on Information Visualization, pages 38--45. IEEE Computer Society, 1996. ",
      "doi": "10.5555/857187.857606"
    },
    {
      "text": "H. Lieberman. Powers of ten thousand: navigating in large information spaces. In UIST '94: Proc. ACM Symp. on User Interface Software and Technology, pages 15--16. ACM Press, 1994.  ",
      "doi": "10.1145/192426.192434"
    },
    {
      "text": "J. D. Mackinlay, G. G. Robertson, and S. K. Card. The perspective wall: detail and context smoothly integrated. In CHI '91: Proc. Human Factors in Computing Systems, pages 173--176. ACM Press, 1991.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "C. North and B. Shneiderman. Snap-together visualization: a user interface for coordinating visualizations via relational schemata. In AVI '00: Proc. working Conf. on Advanced Visual Interfaces, pages 128--135. ACM Press, 2000.  ",
      "doi": "10.1145/345513.345282"
    },
    {
      "text": "E. Pietriga. A Toolkit for Addressing HCI Issues in Visual Language Environments. In VL/HCC'05: IEEE Symp. on Visual Languages and Human-Centric Computing, pages 145--152. IEEE Comput. Soc., 2005.  ",
      "doi": "10.1109/VLHCC.2005.11"
    },
    {
      "text": "E. Pietriga, C. Appert, and M. Beaudouin-Lafon. Pointing and Beyond: an Operationalization and Preliminary Evaluation of Multi-scale Searching. In CHI '07: Proc. Human Factors in Computing Systems, pages 1215--1224. ACM Press, 2007.  ",
      "doi": "10.1145/1240624.1240808"
    },
    {
      "text": "C. Plaisant, D. Carr, and B. Shneiderman. Image-browser taxonomy and guidelines for designers. IEEE Software, 12(2):21--32, 1995.  ",
      "doi": "10.1109/52.368260"
    },
    {
      "text": "T. Porter and T. Duff. Compositing digital images. In SIGGRAPH '84: Proc. Comput. graphics and interact. techniques, pages 253--259. ACM Press, 1984.  ",
      "doi": "10.1145/800031.808606"
    },
    {
      "text": "G. Ramos, A. Co?kburn, R. Balakrishnan, and M. Beaudouin--Lafon.\\newblo?k Pointing lenses: fa?ilitating stylus input through visual--and motor--spa?e magnifi?ation.\\newblo?k In CHI ?07: Pro?. Human Fa?tors in Computing Systems, pages 757---766. ACM Press, 2007.  ",
      "doi": "10.1145/1240624.1240741"
    },
    {
      "text": "G. G. Robertson and J. D. Mackinlay. The document lens. In UIST '93: Proc. ACM Symp. on User Interface Softw. and Tech., pages 101--108. ACM Press, 1993.  ",
      "doi": "10.1145/168642.168652"
    },
    {
      "text": "M. Sarkar and M. H. Brown. Graphical fisheye views. Communications of the ACM, 37(12):73--83, 1994.  ",
      "doi": "10.1145/198366.198384"
    },
    {
      "text": "M. Sarkar, S. S. Snibbe, O. J. Tversky, and S. P. Reiss. Stretching the rubber sheet: a metaphor for viewing large layouts on small screens. In UIST '93: Proc. ACM Symp. on User Interface Software and Technology, pages 81--91. ACM Press, 1993.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "R. Stockli, E. Vermote, N. Saleous, R. Simmon, and D. Herring. The Blue Marble Next Generation -- A true color earth dataset including seasonal dynamics from MODIS. Published by the NASA Earth Observ., 2005.",
      "doi": ""
    },
    {
      "text": "C. Ware and M. Lewis. The DragMag image magnifier. In CHI '95 conference companion, Human Factors in Computing Systems, pages 407--408. ACM Press, 1995.  ",
      "doi": "10.1145/223355.223749"
    }
  ]
}