{
  "doi": "10.1145/1357054.1357208",
  "title": "What to do when search fails: finding information by association",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "999-1008",
  "year": 2008,
  "badges": [],
  "abstract": "Sometimes people cannot remember the names or locations of things on their computer, but they can remember what other things are associated with them. We created Feldspar, the first system that fully supports this associative retrieval of personal information on the computer. Feldspar's contributions include (1) an intuitive user interface that allows users to find information by interactively and incrementally specifying multiple levels of associations as retrieval queries, such as: \"find the file from the person who I met at an event in May\"; and (2) algorithms for collecting the association information and for providing answers to associative queries in real-time. A user study showed that Feldspar is easy to use, and suggested that it might be faster than conventional browsing and searching for these kinds of retrieval tasks. Feldspar could be an important addition to search and browsing tools.",
  "authors": [
    {
      "name": "Duen Horng Chau",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81311482767/rel-imgonly/duen_horng_chau.jpg",
      "acmid": "81311482767",
      "orcid": "0000-0001-9824-3323"
    },
    {
      "name": "Brad Myers",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    },
    {
      "name": "Andrew Faulring",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100067252",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlberg, C., Williamson, C., and Shneiderman, B. Dynamic Queries for Information Exploration: An Implementation and Evaluation. In Proc. CHI 1992, ACM Press (1992), 619--626.  ",
      "doi": "10.1145/142750.143054"
    },
    {
      "text": "Brin, S. and Page, L. The anatomy of a large-scale hypertextual Web search engine. Computer Networks and ISDN Systems 30, 1-7 (1998), 107--117.  ",
      "doi": "10.1016/S0169-7552%2898%2900110-X"
    },
    {
      "text": "Davies, G. and Thomson, D. Memory in Context: Context in Memory. Wiley, England, 1988.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Edwards, W. K., LaMarca, A., and Salisbury, M. Presto: An experimental architecture for fluid interactive document spaces. ACM Transactions on Computer-Human Interaction (TOCHI) 6, 2 (1999), 133--161.  ",
      "doi": "10.1145/319091.319099"
    },
    {
      "text": "Freeman, E. and Gelernter D. Lifestreams: A storage model for personal data. ACM SIGMOD Record 25, 1 (1996), 80--86.  ",
      "doi": "10.1145/381854.381893"
    },
    {
      "text": "Jones, W., Bruce, H., Foxley, A., Munat, C.F. The Universal Labeler: Plan the project and let our information follow. In Proc. ASIST 2005, Charlotte, NC.",
      "doi": ""
    },
    {
      "text": "Kleek, M., Bernstein, M., Karger D., and Schraefel M. GUI-- Phooey! : The Case for Text Input. In Proc. UIST 2007, ACM Press (2007), 193--202.  ",
      "doi": "10.1145/1294211.1294247"
    },
    {
      "text": "Lamming, M. G. and Newman, W. M. Activity-based Information Retrieval: Technology in Support of Personal Memory. IFIP Congress, Vol. 3 (1992), 68--81 ",
      "doi": "10.5555/645571.660379"
    },
    {
      "text": "Lansdale, M. The psychology of personal information management. Applied. Ergonomics 19, 1 (1988), 55--66.",
      "doi": ""
    },
    {
      "text": "Littell, R. C., Milliken, G. A., Stroup, W. W., and Wolfinger, R. D. SAS System for Mixed Models. Cary, North Carolina: SAS Institute, Inc, 1996.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. E. and Lehnert, W. G. Using Decision Trees for Coreference Resolution. International Joint Conference one Artificial Intelligence 14, 2 (1995), 1050--1055 ",
      "doi": "10.5555/1643031.1643036"
    },
    {
      "text": "Nardi, B. and Barreau, D. \"Finding and reminding\" revisited: appropriate metaphors for file organization at the desktop. ACM SIGCHI Bulletin 29, 1 (1997), 76--78.  ",
      "doi": "10.1145/251761.248508"
    },
    {
      "text": "Rekimoto, J. Time-machine computing: a time-centric approach for the information environment. In Proc. UIST 1999. ACM Press (1999), 45--54.  ",
      "doi": "10.1145/320719.322582"
    },
    {
      "text": "Rhodes, B.J. The Wearable Remembrance Agent: a system for augmented memory. In Proc. ISWC 1997, Cambridge, Mass., USA (1997), 123--128. ",
      "doi": "10.5555/851036.856441"
    },
    {
      "text": "Ringel, M., Cutrell, E., Dumais, S. T., and Horvitz, E. Milestones in Time: The Value of Landmarks in Retrieving Information from Personal Stores. In Proc. INTERACT 2003, 184--191.",
      "doi": ""
    },
    {
      "text": "Rothrock, B., Myers, B.A., and Wang, S.H. Unified Associative Information Storage and Retrieval. Ext. Abstracts CHI 2006. ACM Press (2006), 1271--1276.  ",
      "doi": "10.1145/1125451.1125688"
    },
    {
      "text": "Steinfeld, A., Bennett, S.R., Cunningham, K., Lahut, M., Quinones, P.-A., Wexler, D., Siewiorek, D., Hayes, J., Cohen, P., Fitzgerald, J., Hansson, O., Pool, M., and Drummond, M. Evaluation of an Integrated Multi-Task Machine Learning System with Humans in the Loop. In Proc. NIST Performance Metrics for Intelligent Systems Workshop (PerMIS), NIST (2007).  ",
      "doi": "10.1145/1660877.1660901"
    },
    {
      "text": "Teevan J., Alvarado C., Ackerman M., and Karger D. The perfect search engine is not enough: a study of orienteering behavior in directed search. In Proc. CHI 2004. ACM Press (2004), 415--422.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "Tulving, E. and Thomson, D. Encoding specificity and retrieval processes in episodic memory. Psychological Review 80 (1973), 352--373.",
      "doi": ""
    },
    {
      "text": "Yee, K., Swearingen, K., Li, K., and Hearst, M. Faceted metadata for image search and browsing. In Proc. CHI 2003. ACM Press (2003), 401--408.  ",
      "doi": "10.1145/642611.642681"
    }
  ]
}