{
  "doi": "10.1145/1357054.1357157",
  "title": "Interactional empowerment",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "647-656",
  "year": 2008,
  "badges": [],
  "abstract": "We propose that an interactional perspective on how emotion is constructed, shared and experienced, may be a good basis for designing affective interactional systems that do not infringe on privacy or autonomy, but instead empowers users. An interactional design perspective may make use of design elements such as open-ended, ambiguous, yet familiar, interaction surfaces that users can use as a basis to make sense of their own emotions and their communication with one-another. We describe the interactional view on design for emotional communication, and provide a set of orienting design concepts and methods for design and evaluation that help translate the interactional view into viable applications. From an embodied interaction theory perspective, we argue for a non-dualistic, non-reductionist view on affective interaction design.",
  "tags": [
    "emotional computing",
    "social factors",
    "contextual information",
    "interaction design",
    "affective interaction"
  ],
  "authors": [
    {
      "name": "Kristina Höök",
      "institution": "Mobile Life center at Stockholm University, Kista, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Anna Ståhl",
      "institution": "Swedish Institute of Computer Science, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100377942",
      "orcid": "missing"
    },
    {
      "name": "Petra Sundström",
      "institution": "Mobile Life center at Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597574",
      "orcid": "missing"
    },
    {
      "name": "Jarmo Laaksolaahti",
      "institution": "Swedish Institute of Computer Science, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350584936",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aoki, P. M., Woodruff, A. (2005). Making space for stories: ambiguity in the design of personal communication systems, Proceedings of the SIGCHI conference on Human factors in computing systems, Pages 181--190, ACM Press.  ",
      "doi": "10.1145/1054972.1054998"
    },
    {
      "text": "Boehner, K. Interfaces with the ineffable, (2006). Unpublished Thesis Manuscript, LB41.3 2006 B644, Mann Library, Cornell University, USA.",
      "doi": ""
    },
    {
      "text": "Boehner, K., DePaula, R., Dourish, P., and Sengers P. (2005). Affect: From Information to Interaction. Critical computing Conference 2005, Århus, Denmark.  ",
      "doi": "10.1145/1094562.1094570"
    },
    {
      "text": "Boehner, K., DePaula, R., Dourish, P., and Sengers P. (2007). How Emotion Is Made and Measured, International Journal of Human-Computer Studies, Vol. 65, Issue 4, Pp. 275--291.  ",
      "doi": "10.1016/j.ijhcs.2006.11.016"
    },
    {
      "text": "Bylund, M. (2005). A Design Rationale for Pervasive Computing - User Experience, Contextual Design, and Technical Requirements, Unpublished Thesis Manuscript, Royal Institute of Technology, Stockholm",
      "doi": ""
    },
    {
      "text": "Damasio, A. R. (1994). Descartes' Error: Emotion, Reason and the Human Brain, Grosset/Putnam, New York.",
      "doi": ""
    },
    {
      "text": "Davidson, R. J., Pizzagalli, D., Nitschke, J. B., Kalin, N. H. (2003). Parsing the subcomponents of emotion and disorders of emotion: perspectives from affective neuro-science, In Handbook of Affective Sciences, Davidson, R. J., Scherer, K. R., Goldsmith, H. H. (eds.).",
      "doi": ""
    },
    {
      "text": "Dewey, J. (1934). Art as Experience, Perigee, USA",
      "doi": ""
    },
    {
      "text": "Dourish, P. (2001). Where the Action Is: The Foundations of Embodied Interaction. Cambridge: MIT Press. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Eidmar, L. and Sallmander Prien, C. (2005). Who is watching you? A study on people's views on privacy in public places, Unpublished MSc-thesis, Dept. of Computer and Systems Sciences, SU/KTH, 05--79.",
      "doi": ""
    },
    {
      "text": "Erickson, T. and Kellogg, W. A. (2000). Social translucence: an approach to designing systems that support social processes, ACM Transactions on Computer-Human Interaction, Vol. 7, No. 1, Special issue on human-computer interaction in the new millennium, March 2000, Pages 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Fällman, D. (2003). In Romance with the Materials of Mobile Interaction: A Phenomenological Approach to the Design of Mobile Information Technology, Doctoral Thesis, ISSN 1401--4572, RR.03-04, ISBN 91-7305-578-6, Umeå University, Sweden: Larsson &amp; Co:s Tryckeri.",
      "doi": ""
    },
    {
      "text": "Gaver, W.W., Beaver J. and Benford, S. (2003). Ambiguity as a Resource for Design, Proceedings of the conference on Human factors in computing systems (CHI'03), Ft. Lauderdale, Florida, USA.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Grosz, E. (1994). Volatile Bodies: Toward a corporeal feminism, Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Harper, R. Randall, D. Smyth, N. Evans, C. Heledd, L. And Moore, R. (2007). Thanks for the memory, Interact: HCI 2007, Lancaster, Sept.",
      "doi": ""
    },
    {
      "text": "Höök, Kristina (2006). Designing Familiar Open Surfaces, In Proceedings of NordiCHI 2006 Oslo, Norway, October 2006, pp. 242 -- 251, ACM press.  ",
      "doi": "10.1145/1182475.1182501"
    },
    {
      "text": "Iacucci, G., Iacucci, C. and Kuutti, K. (2002). Imagining and experiencing in design, the role of performances, Proc. of the second Nordic conference on Human-computer interaction, Aarhus, Denmark, pp. 167 -- 176.  ",
      "doi": "10.1145/572020.572040"
    },
    {
      "text": "Isbister, K, Höök, K., Laaksolahti, J., and Sharp, M. (2007). The Sensual Evaluation Instrument: Developing a Trans-Cultural Self-Report Measure of Affect, IJHCS, vol. 65, issue 4, pp. 315 -- 328, April 2007.  ",
      "doi": "10.1016/j.ijhcs.2006.11.017"
    },
    {
      "text": "Katz, J. (1999). How Emotions Work. Chicago: University of Chicago Press",
      "doi": ""
    },
    {
      "text": "Kaye, J., Sengers, P. (2007). The Evolution of Evaluation, alt.chi (not archival) CHI 2007, San Jose CA.  ",
      "doi": "10.1145/1240624.2180962"
    },
    {
      "text": "Kort, B., Reilly R. and Picard R.W. (2001). An Affective Model of Interplay Between Emotions and Learning: Reengineering Educational Pedagogy-Building a Learning Companion, In Proceedings of International Conference on Advanced Learning Technologies (ICALT 2001), Madison, WI. ",
      "doi": "10.5555/876869.878064"
    },
    {
      "text": "Lindström, M., Ståhl, A., Höök, K., Sundström, P., Laaksolathi, J., Combetto, M., Taylor, A. and Bresin, R. (2006). Affective Diary -- Designing for Bodily Expressiveness and Self-Reflection, In Extended abstract CHI'06, Montréal, Québec, Canada, ACM Press.  ",
      "doi": "10.1145/1125451.1125649"
    },
    {
      "text": "Lisetti, C., Nasoz, F., LeRouge, C., Ozyer, O., and Alvarez, K., (2003). Developing multimodal intelligent affective interfaces for tele-home health care, International Journal of Human-Computer Studies, Volume 59, Issues 1-2 , July 2003, pp. 245--255  ",
      "doi": "10.1016/S1071-5819%2803%2900051-X"
    },
    {
      "text": "Liu, H., Selker, T., and Lieberman, H. (2003). Visualizing the Affective Structure of a Text Document. Extended Abstracts CHI 2003, Ft. Lauderdale, ACM Press.  ",
      "doi": "10.1145/765891.765961"
    },
    {
      "text": "Löwgren, J. (2007). Inspirational patterns for embodied interaction. Journal of Knowledge, Technology &amp; Policy 20(3).",
      "doi": ""
    },
    {
      "text": "Mota, S. and Picard, R. W. (2003). Automated Posture Analysis for Detecting Learner's Interest Level, Conference on Computer Vision and Pattern Recognition Workshop, Vol. 5, p. 49.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. (1992). Finding Usability Problems through Heuristic Evaluation. In Human Factors In Computing Systems CHI'92, pp.373--80. New York ACM Press.  ",
      "doi": "10.1145/142750.142834"
    },
    {
      "text": "Palen, L. and Dourish, P. (2003). Unpacking \"privacy\" for a networked world, CHI 2003, Ft. Lauderdale Florida, USA Pages: 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Picard, R. (1997). Affective Computing, MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Psik, T., Matkovi´c, K., Sainitzer, R., Petta, P., and Szalavari, Z., (2003). The invisible person: advanced inter-action using an embedded interface, Proc. workshop on Virtual environments. Pp. 29 -- 37, ACM Press.  ",
      "doi": "10.1145/769953.769957"
    },
    {
      "text": "Reynolds, C. And Picard, R. (2004). Affective sensors, privacy, and ethical contracts, In CHI '04 extended abstracts on Human factors in computing systems, Vienna, Austria, pp. 1103 -- 1106, ACM Press.  ",
      "doi": "10.1145/985921.985999"
    },
    {
      "text": "Russell, J.A. (1980). Circumplex Model of Affect, Journal of Personality and Social Psychology, Vol. 39, No. 6, 1161--1178, American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Schön, D. A. (1983). The Reflective Practitioner: How professionals think in action. London: Temple Smith.",
      "doi": ""
    },
    {
      "text": "Sundström, P., Ståhl, A., Höök, K. (2007). In Situ In-formants Exploring an emotional Mobile Messaging System in Their Everyday Practice, In a special issue of IJHCS on Evaluating Affective Interfaces, vol. 65, issue 4, pp. 388 -- 403, April 2007.  ",
      "doi": "10.1016/j.ijhcs.2006.11.013"
    },
    {
      "text": "Ståhl, A., Höök, K., Svensson, M. Taylor, A. and Combetto, M. (submitted). Experiencing the Affective Diary.",
      "doi": ""
    },
    {
      "text": "Tangney, J. P. and Fischer, K. W. (1995). Self-conscious emotions: The psychology of shame, guilt, embarrassment, and pride, NY: Guilford.",
      "doi": ""
    }
  ]
}