{
  "doi": "10.1145/1357054.1357235",
  "title": "Information distance and orientation in liquid layout",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1153-1156",
  "year": 2008,
  "badges": [],
  "abstract": "Liquid layout of web browser elements enables enterprise applications to adapt to larger windows on larger displays, but guidelines are needed to define layout rules for widescreen page content. The present study considers the impact of relative portlet distance and orientation in enterprise-type tasks. Eighteen analysts completed tasks in which critical information was located in two portlets separated by defined distances and orientations. Analysis of completion times, assists, errors, and subjective scales revealed a significant advantage for wider, horizontal information layouts over narrower, vertical layouts. The difference persisted, even when accounting for the influence of vertical scrolling. Horizontal layout in these dashboard-style tasks had a 5%-25% time savings over vertical layout, as separation distances increased to 2000 pixels. Differences in horizontal and vertical eye movement accuracy and velocity could account for these results. Widescreen design guidelines should include a preference for horizontal layout as horizontal screen distances increase.",
  "authors": [
    {
      "name": "Joseph H. Goldberg",
      "institution": "Oracle Corporation, Redwood Shores, CA, USA",
      "img": "/do/10.1145/contrib-81339501487/rel-imgonly/headshot1.jpg",
      "acmid": "81339501487",
      "orcid": "missing"
    },
    {
      "name": "Jonathan I. Helfman",
      "institution": "Oracle Corporation, Redwood Shores, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659553406",
      "orcid": "missing"
    },
    {
      "name": "Lynne Martin",
      "institution": "Naviscent LLC, Redwood City, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577311",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Badros, G.J., Borning, A., and Stuckey, P.J. The casowary linear arithmetic constraint solving algorithm, ACM Trans. Comp. Hum. Int., 8 (2001), 4, 267--306.  ",
      "doi": "10.1145/504704.504705"
    },
    {
      "text": "Collewijn, H., Erkelens, C.J., and Steinman, R.M. Parameters of human horizontal and vertical saccades measured in the two eyes, Neuroscience, 22 (1987), Supp. 8421.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Robertson, G., Meyers, B., Smith, G., Robbins, D., and Tan, D. Large display research overview. Proc. CHI 2006, ACM Press (2006), 69--74.  ",
      "doi": "10.1145/1125451.1125471"
    },
    {
      "text": "Czerwinski, M., Smith, G., Regan, T., Meyers, B., Robertson, G., and Starkweather, G. Toward characterizing the productivity benefits of very large displays. Proc. Interact, ACM Press (2003), 9--16.",
      "doi": ""
    },
    {
      "text": "Goldberg, J.H. and Helfman, J.I. Evaluating user expectations for widescreen content layout. Proc. UPA 2007 Conference, UPA Press (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Goldberg, J.H., and Mochel, K. Developing enterprise application design guidelines for large and multiple displays, ACM/CHI Wkshp. Info. Vis. Int. Tech. Collab. Mult. Dsplys. (2006), http://www.upassoc.org/ usability_resources/conference/ 2007/prp_036.pdf.",
      "doi": ""
    },
    {
      "text": "Raskino, M. Bigger and better displays will boost productivity at last, Gartner Research Report G00126172 (2005).",
      "doi": ""
    },
    {
      "text": "Reynolds, M. Display resolutions set to change, Gartner Research Report G00126431 (2005).",
      "doi": ""
    },
    {
      "text": "Robertson, G., Czerwinski, M., Baudisch, P., Meyers, B. Robbins, D., Smith, G., and Tan, D. The large-display user experience. IEEE Cmp. Grph. &amp; Apps. (2005), 2--9.  ",
      "doi": "10.1109/MCG.2005.88"
    },
    {
      "text": "Simmons, T. What's the optimum computer display size? Ergonomics in Design, 9, 4 (2001), 19--25.",
      "doi": ""
    },
    {
      "text": "Swaminathan, K., and Sato, S. Interaction design for large displays, Interactions (1997), 15--24.  ",
      "doi": "10.1145/242388.242395"
    },
    {
      "text": "Tidwell, J. Designing Interfaces, O'Reilly Media (2006), Sebastipol, CA, 2006. ",
      "doi": "10.5555/1203417"
    }
  ]
}