{
  "doi": "10.1145/1357054.1357323",
  "title": "CoScripter: automating & sharing how-to knowledge in the enterprise",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1719-1728",
  "year": 2008,
  "badges": [],
  "abstract": "Modern enterprises are replete with numerous online processes. Many must be performed frequently and are tedious, while others are done less frequently yet are complex or hard to remember. We present interviews with knowledge workers that reveal a need for mechanisms to automate the execution of and to share knowledge about these processes. In response, we have developed the CoScripter system (formerly Koala [11]), a collaborative scripting environment for recording, automating, and sharing web-based processes. We have deployed CoScripter within a large corporation for more than 10 months. Through usage log analysis and interviews with users, we show that CoScripter has addressed many user automation and sharing needs, to the extent that more than 50 employees have voluntarily incorporated it into their work practice. We also present ways people have used CoScripter and general issues for tools that support automation and sharing of how-to knowledge.",
  "authors": [
    {
      "name": "Gilly Leshed",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350569215",
      "orcid": "0000-0002-2308-2825"
    },
    {
      "name": "Eben M. Haber",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100560153",
      "orcid": "missing"
    },
    {
      "name": "Tara Matthews",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Tessa Lau",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100206193",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agostini, A., Albolino, S., De Michelis, G., De Paoli, F., and Dondi, R. Stimulating knowledge discovery and sharing. Proceedings of GROUP'03.  ",
      "doi": "10.1145/958160.958199"
    },
    {
      "text": "Alavi, M., &amp; Leidner, D.E. (2001). Review: Knowledge management &amp; knowledge management systems: Conceptual foundations &amp; research issues. MIS Quarterly, 25(1), 107--137.  ",
      "doi": "10.2307/3250961"
    },
    {
      "text": "Anderson, C. (2006). The long tail: why the future of business is selling less of more. New York: Hyperion. ",
      "doi": "10.5555/1197299"
    },
    {
      "text": "Birnholtz, J.P., &amp; Bietz, M.J. Data at work: supporting sharing in science and engineering. Proceedings of GROUP'03.  ",
      "doi": "10.1145/958160.958215"
    },
    {
      "text": "Brown, J.S., &amp; Duguid, P. (2001). Knowledge and organization: a social-practice perspective. Organization Science, 12(2), 198--213.  ",
      "doi": "10.1287/orsc.12.2.198.10116"
    },
    {
      "text": "Cyper, A. (1993). Watch What I Do: Programming by Demonstration. Cambridge: MIT Press. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Dorn, B. and Guzdial, M. Graphic designers who program as informal computer science learners. Proceedings of ICER'06.  ",
      "doi": "10.1145/1151588.1151608"
    },
    {
      "text": "Edwards, D.L., &amp; Mahling, D.E. Toward knowledge management systems in the legal domain. Proceedings of GROUP'97.  ",
      "doi": "10.1145/266838.266892"
    },
    {
      "text": "Halverson, C.A., Erickson, T., and Ackerman, M.S. Behind the helpdesk: evolution of knowledge management system in a large organization. Proceedings of CSCW'04.  ",
      "doi": "10.1145/1031607.1031657"
    },
    {
      "text": "Hoffmann, M., Loser, K., Walter, T., &amp; Herrmann, T. A design process for embedding knowledge management in everyday work. Proceedings of GROUP'99.  ",
      "doi": "10.1145/320297.320332"
    },
    {
      "text": "Little, G., Lau, T.A., Cypher, A., Lin, J., Haber, E.M., &amp; Kandogan, E. Koala: capture, share, automate, personalize business processes on the web. Proceedings of CHI'07.  ",
      "doi": "10.1145/1240624.1240767"
    },
    {
      "text": "Little, G., &amp; Miller, R.C. Translating Keyword Commands into Executable Code. Proceedings of UIST'06.  ",
      "doi": "10.1145/1166253.1166275"
    },
    {
      "text": "Lochovsky, F.H., Woo, C.C., &amp; Williams, L.J. A micro-organizational model for supporting knowledge migration. Proceedings of SIGOIS'90.  ",
      "doi": "10.1145/91474.91540"
    },
    {
      "text": "Millen, D.R., &amp; Fontaine, M.A. Improving individual and organizational performance through communities of practice. Proceedings of GROUP'03.  ",
      "doi": "10.1145/958160.958192"
    },
    {
      "text": "Nahapiet, J., &amp; Ghoshal, S. (1998). Social capital, intellectual capital, and the organizational advantage. The Academy of Management Review, 23(2), 242--266.",
      "doi": ""
    },
    {
      "text": "Nardi, B.A. (1993). A small matter of programming: perspectives on end-user computing. Cambridge: MIT Press. ",
      "doi": "10.5555/160165"
    },
    {
      "text": "Nonaka, I. (1994). A dynamic theory of organizational knowledge creation. Organization Science, 5(1), 14--37.",
      "doi": ""
    },
    {
      "text": "Nonaka, I., and Takeuchi, H. (1995). The knowledge-creating company: how Japanese companies create the dynamics of innovation. New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Rosson, M.B., Ballin, J., &amp; Rode, J. Who, what, and how: A survey of informal and professional web developers. Proceedings of VL/HCC'05.  ",
      "doi": "10.1109/VLHCC.2005.73"
    },
    {
      "text": "Stewart, T.A. (1997). Intellectual capital: the new wealth of organizations. New York: Doubleday / Currency. ",
      "doi": "10.5555/266020"
    },
    {
      "text": "Suchman, L. (1983). Office procedure as practical action: Models of work and system design. ACM Transactions on Office Information Systems, 1(4), 320--328.  ",
      "doi": "10.1145/357442.357445"
    },
    {
      "text": "Szulanski, G. (1996). Exploring internal stickiness: impediments to the transfer of best practice within the firm. Strategic Management Journal, 17, 27--43.",
      "doi": ""
    },
    {
      "text": "Yamauchi, Y., Whalen, J., &amp; Bobrow, D.G. Information use of service technicians in difficult cases. Proceedings of CHI'03.  ",
      "doi": "10.1145/642611.642627"
    }
  ]
}