{
  "doi": "10.1145/1357054.1357065",
  "title": "AutoTopography: what can physical mementos tell us about digital memories?",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "53-62",
  "year": 2008,
  "badges": [],
  "abstract": "Current technology makes it possible to capture huge amounts of information related to everyday experiences. Despite this, we know little about the processes by which people identify and manage mementos - objects which are directly meaningful to their memories. Among the millions of objects people encounter in a lifetime, few become such reminders of people, places or events. We report fieldwork where participants gave us a tour of their homes describing how and why particular objects become mementos. Our findings extend the existing digital memory literature; first our participants didn't view their activities as experiential 'capture', nor were mementos limited to pictorial representations of people and events; instead they included everyday objects. Furthermore, mementos were not only displayed and shared, but also integrated into everyday activities. Finally there were complex relations between house location and memento type. We discuss the theoretical and technical implications of our work.",
  "authors": [
    {
      "name": "Daniela Petrelli",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100189751",
      "orcid": "missing"
    },
    {
      "name": "Steve Whittaker",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "Jens Brockmeier",
      "institution": "University of Innsbruck, Innsbruck, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361593530",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, G. and Gemmell, J A (2007) Digital life. Scientific American, March 2007.",
      "doi": ""
    },
    {
      "text": "Bechelard, G. (1994) The poetics of space, Beacon Press.",
      "doi": ""
    },
    {
      "text": "Bergson, H. (1988) Matter and memory. Zone Books.",
      "doi": ""
    },
    {
      "text": "Brown, N. On the prevalence of event clusters in autobiographical memory. Social Cognition, 2005, 23 (1), 35--69.",
      "doi": ""
    },
    {
      "text": "Chaften, R. (1987) Snapshots Versions of Life. 1987. Popular Press.",
      "doi": ""
    },
    {
      "text": "Conway, M. and Pleydell-Pearce, C. (2000) The Construction of Autobiographical Memories in the Self-Memory System. Psychological Review, 107 (2), 261--288.",
      "doi": ""
    },
    {
      "text": "Crabtree,A., Rodden,T. Mariani,J. (2004) Collaborating around collections: informing the continued development of photoware, Proc. CSCW, 396--405.  ",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Csikszentmihalyi, M. and Rochberg-Halton, E. (1981) The meaning of things --- Domestic symbols and the self. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Dalsgaard, T., Skov, M., Stougaard, M. and Thomassen, B. (2006) Mediated Intimacy in Families: Understanding the relation between children and Parents. Proceedings of the conference Interaction Design and Children --- IDC'06, 145--152  ",
      "doi": "10.1145/1139073.1139110"
    },
    {
      "text": "Fivush, R. and Nelson, K. (2004) Culture and Language in the Emergence of Autobiographical Memory, Psychological Science, 15 (9), 573--577",
      "doi": ""
    },
    {
      "text": "Frohlich, D., Fennell, J. (2007) Sound, paper and memorabilia: resources for a simpler digital photography. Personal and Ubiquitous Computing, vol. 11, 107--116.  ",
      "doi": "10.1007/s00779-006-0069-4"
    },
    {
      "text": "Frohlich, D. (2004) Audiophotography: Bringing photos to life with sounds, Springer. ",
      "doi": "10.5555/1210132"
    },
    {
      "text": "Frohlich, D. and Murphy, R. (2000) The Memory Box. Personal Technologies, 4, 238--240.  ",
      "doi": "10.1007/PL00000011"
    },
    {
      "text": "Gonzalez, J. (1995) Autotopographies. In Brahm, G. and Driscoll, M. (eds.) Prosthetic Territories --- Politics and Hypertechnologies. 133--150, Westview Press.",
      "doi": ""
    },
    {
      "text": "Hoskins, J. (1998) Biographical objects --- how things tell the stories of people's lives. Routledge.",
      "doi": ""
    },
    {
      "text": "Hutchinson, H., Roussel, N., Mackay, W., Bederson, B., Durin, A., Plaisant, C. et al. (2003) Technology probes: inspiring design for and with families. CHI 2003, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Kalnikaite, V., and Whittaker, S. (2007). Software or Wetware? Discovering When and Why People Use Digital Prosthetic Memory. CHI07, 71--80.  ",
      "doi": "10.1145/1240624.1240635"
    },
    {
      "text": "Kawamura, T., Fukuhara, T., Takeda, H., Kono, J. and Kidode, Y. (2007) Ubiquitous Memories: a memory externalization system using physical objects -- Personal and Ubiquitous Computing, 11, 287--312.  ",
      "doi": "10.1007/s00779-006-0085-4"
    },
    {
      "text": "Kern, N., Schiele, B. and Schmidt, A. (2007) Recognizing context for annotating a live life recording. Personal and Ubiquitous Computing, 11, 251--263.  ",
      "doi": "10.1007/s00779-006-0086-3"
    },
    {
      "text": "Kopytoff, I. (1986) The cultural biography of things: commoditization as a process. In Appadurai, A. (ed.) The social life of things --- commoditization and cultural perspective, Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Leichtman, M. and Wang, Q. (2005) Autobiographical memory in the developmental niche: A cross-cultural perspective, in Homer, B. &amp; Tamis-LeMonda (eds.) The development of social cognition and communication. Mahwah, N. J., Lawrance Erlbaum.",
      "doi": ""
    },
    {
      "text": "Mann, S. (2004) Continuous lifelog capture of personal experience with EyeTap. Proc. of CARPE.  ",
      "doi": "10.1145/1026653.1026654"
    },
    {
      "text": "Sellen, A., Fogg, A., Aitken, M., Hodges, S., Rother, C. and Wood, K. (2007): Do life-logging technologies support memory for the past?. CHI07 81--90.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Stevens, M., Abowd, G., Truong, K. and Vollmer, F. (2003) Getting into the Living Memory Box: Family archives &amp; holistic design. Personal and Ubiquitous Computing, 7, 210--216.  ",
      "doi": "10.1007/s00779-003-0220-4"
    },
    {
      "text": "Turkle, S. (2007) Evocative Objects --- Things we think with, MIT Press.",
      "doi": ""
    },
    {
      "text": "Van den Hoven, E. (2004) Graspable Cues for Everyday Recollecting. PhD thesis, Technische Universiteit Eindhoven, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Wang, Q. and Brockmeier, J. (2002) Autobiographical remembering as cultural practice: Understanding the interplay between memory, self and culture, Culture Psychology, 8 (45), 45--64",
      "doi": ""
    }
  ]
}