{
  "doi": "10.1145/1357054.1357221",
  "title": "The adaptation of visual search strategy to expected information gain",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1075-1084",
  "year": 2008,
  "badges": [],
  "abstract": "An important question for HCI is to understand how and why visual search strategy is adapted to the demands imposed by the task of searching the results of a search engine. There is emerging evidence that a key part of the answer concerns the expected information gain of each of the set of available information gathering actions. We build on previous research to show that people are acutely sensitive to differences in the spacing and in the number of items returned by the search engine. These factors cause shifts in the efficiency of the available information gathering actions. We focus on an image browsing task, and show that, as a consequence of changes to the efficiency of available actions, people make small but significant changes to eye-movement strategy.",
  "authors": [
    {
      "name": "Yuan-Chi Tseng",
      "institution": "The University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659426765",
      "orcid": "missing"
    },
    {
      "name": "Andrew Howes",
      "institution": "The University of Manchester, Manchester, United Kingdom",
      "img": "/do/10.1145/contrib-81100489674/rel-imgonly/mypicture.jpg",
      "acmid": "81100489674",
      "orcid": "0000-0003-4251-1127"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. The Adaptive Character of Thought. Lawrence Erlbaum Associates, 1990.",
      "doi": ""
    },
    {
      "text": "Anderson, J.R., Bothell, D., Byrne, M.D., Douglass, S., Lebiere, C., and Qin, Y. An integrated theory of the mind. Psychological Review 111, 4 (2004), 1036--1060.",
      "doi": ""
    },
    {
      "text": "Araujo, C.C., Kowler, E.E., and Pavel, M.M. Eye movements during visual search: the costs of choosing the optimal path. Vision Research 41, 25-26 (2001), 3613--3625.",
      "doi": ""
    },
    {
      "text": "Bertera, J.H. and Rayner, K. Eye movements and the span of the effective visual stimulus in visual search. Perception &amp; Psychophysics 62 (2000), 576--585.",
      "doi": ""
    },
    {
      "text": "Brumby, D.P. and Howes, A. Good enough but I'll just check: Web-page search as attentional refocusing. In Proc. ICCM 2004, Lawrence Erlbaum Associates (2004).",
      "doi": ""
    },
    {
      "text": "Brumby, D.P. and Howes, A. Strategies for guiding interactive search: An empirical investigation into the consequences of label relevance for assessment and selection. Human-Computer Interaction (in press).",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Gutwin, C., and Alexander, J. Faster document navigation with space-filling thumbnails. In Proc. CHI 2006, ACM Press (2006), 1--10.  ",
      "doi": "10.1145/1124772.1124774"
    },
    {
      "text": "Cox, A.L. and Young, R.M. A Rational Model of the Effect of Information Scent on the Exploration of Menus. In Proc. ICCM 2004, Lawrence Erlbaum Associates (2004).",
      "doi": ""
    },
    {
      "text": "Cutrell, E. and Guan, Z. What are you looking for? An eye-tracking study of information usage in Web search. In Proc. CHI 2007, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240690"
    },
    {
      "text": "Eng, K., Lewis, R.L., Tollinger, I., Chu, A., Howes, A., and Vera, A. Generating automated predictions of behavior strategically adapted to specific performance objectives. In Proc. CHI 2006, ACM Press (2006), 621--630.  ",
      "doi": "10.1145/1124772.1124866"
    },
    {
      "text": "Everett, S.P. and Byrne, M.D. Unintended effects: Varying icon spacing changes users' visual search strategy. In Proc. CHI 2004, ACM Press (2004), 695--702.  ",
      "doi": "10.1145/985692.985780"
    },
    {
      "text": "Findlay, J.M. and Gilchrist, I.D. Active vision-the psychology of looking and seeing. Oxford University Press, 2003.",
      "doi": ""
    },
    {
      "text": "Fu, W.-T. and Pirolli, P. SNIF-ACT: A Cognitive Model of User Navigation on the World Wide Web. Human-Computer Interaction 22 (2007). ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "Gray, W.D. and Boehm-Davis, D.A. Milliseconds Matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experiment Psychology: Applied 6, 4 (2000), 322--335.",
      "doi": ""
    },
    {
      "text": "Halverson, T. and Hornof, A.J. Explaining eye movements in the visual search of varying density layouts. In Proc. ICCM 2004, Lawrence Erlbaum Associates (2004), 124--129.",
      "doi": ""
    },
    {
      "text": "Hooge, I.T.C., Vlaskamp, B.N.S., and Over, E.A.B. Saccadic search: the relation between fixation duration and saccade amplitude. Perception 31, ECVP Abstract Supplement (2002).",
      "doi": ""
    },
    {
      "text": "Howes, A., Vera, A., and Lewis, R.L. Bounding rational analysis: Constraints on asymptotic performance. In W.D. Gray (Ed.), Integrated Models of Cognitive Systems, Oxford University Press (2006).",
      "doi": ""
    },
    {
      "text": "Kieras, D.E. and Meyer, D.E. An overview of the EPIC architecture for cognition and performance with application to human-computer interaction. Human-Computer Interaction 12 (1997), 391--438.  ",
      "doi": "10.1207/s15327051hci1204_4"
    },
    {
      "text": "Kieras, D.E. and Meyer, D.E. The role of cognitive task analysis in the application of predictive models of human performance. In J.M. Schraagen and S.F. Chipman (Eds.), Cognitive task analysis (2000), 237--260.",
      "doi": ""
    },
    {
      "text": "Klöckner, K., Wirschum, N., and Jameson, A. Depth and breadth-first processing of search result lists. In Ext. Abstracts CHI 2004, ACM Press (2004), 1539--1539.  ",
      "doi": "10.1145/985921.986115"
    },
    {
      "text": "Lindberg, T. and Nasanen, R. The effect of icon spacing and size on the speed of icon processing in the human visual system. Displays 24, 3 (2003), 111--120.",
      "doi": ""
    },
    {
      "text": "Meyer, D.E. and Kieras, D.E. A computational theory of executive control processes and human multiple-task performance: Part 1. Basic Mechanisms. Psychological Review 104 (1997), 3--65.",
      "doi": ""
    },
    {
      "text": "Meyer, D.E. and Kieras, D.E. A computational theory of executive control processes and human multiple-task performance: Part 2. Accounts of Psychological Refractory-Period Phenomena. Psychological Review 104 (1997), 749--791.",
      "doi": ""
    },
    {
      "text": "Motter, B.C. and Belky, E.J. The zone of focal attention during active visual search. Vision Research 38 (1998), 1007--1022.",
      "doi": ""
    },
    {
      "text": "Najemnik, J. and Geisler, W.S. Optimal eye movement strategy in visual search. Nature 434 (2005), 387--391.",
      "doi": ""
    },
    {
      "text": "Ojanpää, H., Näsänen, R., and Kojo, I. Eye movements in the visual search of word lists. Vision Research 42, 12 (2002), 1499--1512.",
      "doi": ""
    },
    {
      "text": "Over, E.A.B., Hooge, I.T.C., Vlaskamp, B.N.S., and Erkelens, C.J. Coarse-to-fine eye movement strategy in visual search. Vision Research 47 (2007), 2272--2280.",
      "doi": ""
    },
    {
      "text": "Payne, S.J., Howes, A., and Reader, W.R. Adaptively distributing cognition: a decision-making perspective on human-computer interaction. Behaviour and Information Technology 20, 5 (2001), 339--346.",
      "doi": ""
    },
    {
      "text": "Pirolli, P. and Card, S.K. Information foraging. Psychological Review 106, 4 (1999), 643--675.",
      "doi": ""
    },
    {
      "text": "Pirolli, P., Card, S.K., and Van Der Wege, M. The effects of information scent on visual search in the hyperbolic tree browser. ACM Transactions on Computer Human Interaction 10, 1 (2003), 20--53.  ",
      "doi": "10.1145/606658.606660"
    },
    {
      "text": "Pirolli, P. and Fu, W.-T. SNIF-ACT: a model of information foraging on the world wide web. In Proc. Ninth International Conference on User Modeling, Springer (2003). ",
      "doi": "10.5555/1759957.1759968"
    },
    {
      "text": "Pollatsek, A., Perea, M., and Binder, K.S. The Effecs of Neighborhood Size in Reading and Lexical Decision. Journal of Experimental Psychology: Human Perception and Performance 25, 4 (1999), 1142--1158.",
      "doi": ""
    },
    {
      "text": "Rao, R.P.N., Zelinsky, G., Hayhoe, M.M., and Ballard, D.H. Eye movements in iconic visual search. Vision Research 42, 11 (2002), 1447--1463.",
      "doi": ""
    },
    {
      "text": "Reiman, J., Young, M., and Howes, A. A dual-space model of interatively deepening exploratory learning. International Journal of Human-Computer Studies 44 (1996), 743--775.  ",
      "doi": "10.1006/ijhc.1996.0032"
    },
    {
      "text": "Rele, R.S. and Duchowski, A.T. Using eye tracking to evaluate alternate search results interfaces. In Proc. HFES 49th Annual Conference (2005).",
      "doi": ""
    },
    {
      "text": "Resnick, M.L., Maldonado, C.A., Santos, J.M., and Lergier, R. Modeling On-line Search Behavior Using Alternative Output Structures. In Proc. HFES 45th Annual Conference (2001), 1166--1171.",
      "doi": ""
    },
    {
      "text": "Ross, J., Morrone, M.C., Goldberg, M.E., and Burr, D.C. Changes in visual perception at the time of saccades. Trends in Neurosciences 24, 2 (2001), 113--121.",
      "doi": ""
    },
    {
      "text": "Simon, H.A. A behavioral model of rational choice. Quarterly Journal of Economics 69 (1955), 99--118.",
      "doi": ""
    },
    {
      "text": "Sperling, G. and Dosher, B.A. Strategy and optimization in human information processing. In K.R. Boff, L. Kaufman, and J.P. Thomas (Eds.), Handbook of perception and human performance, Vol. I, Sensory processes and perception, Wiley (1986).",
      "doi": ""
    },
    {
      "text": "Vlaskamp, B.N.S., Over, E.A.B., and Hooge, I.T.C. Saccadic search performance: the effect of element spacing. Experimental Brain Research 3 (2005), 1--14.",
      "doi": ""
    },
    {
      "text": "Woodruff, A., Faulring, A., Rosenholtz, R., Morrison, J., and Pirolli, P. Using Thumbnails to Search the Web. In Proc. CHI 2001, ACM Press (2001), 198--205.  ",
      "doi": "10.1145/365024.365098"
    },
    {
      "text": "Yee, K.P., Swearingen, K., Li, K., and Hearst, M. Faceted metadata for image search and browsing. In Proc. CHI 2003, ACM Press (2003), 401--408.  ",
      "doi": "10.1145/642611.642681"
    }
  ]
}