{
  "doi": "10.1145/1357054.1357263",
  "title": "Melange: space folding for multi-focus interaction",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1333-1342",
  "year": 2008,
  "badges": [],
  "abstract": "Interaction and navigation in large geometric spaces typically require a sequence of pan and zoom actions. This strategy is often ineffective and cumbersome, especially when trying to study several distant objects. We propose a new distortion technique that folds the intervening space to guarantee visibility of multiple focus regions. The folds themselves show contextual information and support unfolding and paging interactions. Compared to previous work, our method provides more context and distance awareness. We conducted a study comparing the space-folding technique to existing approaches, and found that participants performed significantly better with the new technique.",
  "authors": [
    {
      "name": "Niklas Elmqvist",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    },
    {
      "name": "Nathalie Henry",
      "institution": "INRIA, Univ. Paris-Sud & University of Sydney, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81313483984",
      "orcid": "0000-0003-1759-7512"
    },
    {
      "name": "Yann Riche",
      "institution": "INRIA, Univ. Paris-Sud & University of Queensland, Orsay, France",
      "img": "/do/10.1145/contrib-81363604200/rel-imgonly/ynr.jpg",
      "acmid": "81363604200",
      "orcid": "missing"
    },
    {
      "name": "Jean-Daniel Fekete",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81100194446/rel-imgonly/81100194446.jpg",
      "acmid": "81100194446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Caroline Appert and Jean-Daniel Fekete. OrthoZoom scroller: 1D multi-scale navigation. In Proceedings of the ACM CHI 2006 Conference on Human Factors in Computing Systems, pages 21--30, 2006.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "Patrick Baudisch and Ruth Rosenholtz. Halo: a technique for visualizing off-screen objects. In Proceedings of the ACM CHI 2003 Conference on Human Factors in Computing Systems, pages 481--488, 2003.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Frederic Bourgeois and Yves Guiard. Multiscale pointing: facilitating pan-zoom coordination. In Extended Abstracts of the ACM CHI 2002 Conference on Human Factors in Computing Systems, pages 758--759, 2002.  ",
      "doi": "10.1145/506443.506583"
    },
    {
      "text": "Stuart K. Card and David Nation. Degree-of-interest trees: A component of an attention--reactive user interface. In Proceedings of the ACM Conference on Advanced Visual Interfaces, 2002.  ",
      "doi": "10.1145/1133265.1133358"
    },
    {
      "text": "M. Sheelagh T. Carpendale and Catherine Montagnese. A framework for unifying presentation space. In Proceedings of the ACM Symposium on User Interface Software and Technology, pages 61--70, 2001.  ",
      "doi": "10.1145/502348.502358"
    },
    {
      "text": "George W. Furnas. Generalized fisheye views. In Proceedings of the ACM CHI'86 Conference on Human Factors in Computer Systems, pages 16--23, 1986.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "George W. Furnas. A fisheye follow-up: further reflections on focus + context. In Proceedings of the ACM CHI 2006 Conference on Human Factors in Computing Systems, pages 999--1008, 2006.  ",
      "doi": "10.1145/1124772.1124921"
    },
    {
      "text": "George W. Furnas and Benjamin B. Bederson. Spacescale diagrams: Understanding multiscale interfaces. In Proceedings of the ACM CHI'95 Conference on Human Factors in Computing Systems, pages 234--241, 1995.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "Mohammad Ghoniem, Jean-Daniel Fekete, and Philippe Castagliola. On the readability of graphs using node-link and matrix-based representations: a controlled experiment and statistical analysis. Information Visualization, 4(2):114--135, 2005.  ",
      "doi": "10.1057/palgrave.ivs.9500092"
    },
    {
      "text": "Sean G. Gustafson and Pourang P. Irani. Comparing visualizations for tracking off-screen moving targets. In Extended Abstracts of the ACM CHI 2007 Conference on Human Factors in Computing Systems, pages 2399--2404, 2007.  ",
      "doi": "10.1145/1240866.1241014"
    },
    {
      "text": "Christopher G. Healey. Choosing effective colours for data visualization. In Proceedings of the IEEE Conference on Visualization, pages 263--270, 1996. ",
      "doi": "10.5555/244979.245597"
    },
    {
      "text": "Nathalie Henry and Jean-Daniel Fekete. MatLink: Enhanced matrix visualization for analyzing social networks. In Human-Computer Interaction - INTERACT 2007, volume 4663 of LNCS, pages 288--302, 2007. ",
      "doi": "10.5555/1778331.1778362"
    },
    {
      "text": "Takeo Igarashi and Ken Hinckley. Speed-dependent automatic zooming for browsing large documents. In Proceedings of the ACM Symposium on User Interface Software and Technology, pages 139--148, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Pourang Irani, Carl Gutwin, and Xing Dong Yang. Improving selection of off-screen targets with hopping. In Proceedings of ACM CHI 2006 Conference on Human Factors in Computing Systems, pages 299--308, 2006.  ",
      "doi": "10.1145/1124772.1124818"
    },
    {
      "text": "Bongshin Lee, Catherine Plaisant, Cynthia Sims Parr, Jean-Daniel Fekete, and Nathalie Henry. Task taxonomy for graph visualization. In Proceedings of BEyond time and errors: novel evaLuation methods for Information Visualization (BELIV'06), pages 82--86, 2006.  ",
      "doi": "10.1145/1168149.1168168"
    },
    {
      "text": "Jock D. Mackinlay, George G. Robertson, and Stuart K. Card. The Perspective Wall: Detail and context smoothly integrated. In Proceedings of the ACM CHI'91 Conference on Human Factors in Computing Systems, pages 173--179, 1991.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "Tamara Munzner, Franc¸ois Guimbretiere, Serdar Tasiran, Li Zhang, and Yunhong Zhou. TreeJuxtaposer: scalable tree comparison using focus+context with guaranteed visibility. In Proceedings of ACM SIGGRAPH 2003, pages 453--462, 2003.  ",
      "doi": "10.1145/1201775.882291"
    },
    {
      "text": "Dmitry Nekrasovski, Adam Bodnar, JoannaMcGrenere, François Guimbretière, and Tamara Munzner. An evaluation of pan &amp; zoom and rubber sheet navigation with and without an overview. In Proceedings of the ACM CHI 2006 Conference on Human Factors in Computing Systems, pages 11--20, 2006.  ",
      "doi": "10.1145/1124772.1124775"
    },
    {
      "text": "Ken Perlin and David Fox. Pad: An alternative approach to the computer interface. In Proceedings of Computer Graphics (SIGGRAPH 93), pages 57--64, 1993.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Catherine Plaisant, David Carr, and Ben Shneiderman. Image browsers: Taxonomy and guidelines for developers. IEEE Software, 12(2):21--32, March 1995.  ",
      "doi": "10.1109/52.368260"
    },
    {
      "text": "Catherine Plaisant, Jesse Grosjean, and Benjamin B. Bederson. SpaceTree: Supporting exploration in large node link tree, design evolution and empirical evaluation. In Proceedings of the IEEE Symposium on Information Visualization, pages 57--64, 2002. ",
      "doi": "10.5555/857191.857752"
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. LifeLines: Visualizing personal histories. In Proceedings of the ACM CHI'96 Conference on Human Factors in Computing Systems, pages 221--227, 1996.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Ramana Rao and Stuart K. Card. The Table Lens: Merging graphical and symbolic representations in an interactive focus+context visualization for tabular information. In Proceedings of the ACM CHI'94 Conference on Human Factors in Computing Systems, pages 318--322, 1994.  ",
      "doi": "10.1145/191666.191776"
    },
    {
      "text": "George G. Robertson and Jock D. Mackinlay. The Document Lens. In Proceedings of the ACM Symposium on User Interface Software and Technology, pages 101--108, 1993.  ",
      "doi": "10.1145/168642.168652"
    },
    {
      "text": "Manojit Sarkar, Scott S. Snibbe, Oren J. Tversky, and Steven P. Reiss. Stretching the rubber sheet: A metaphor for visualizing large layouts on small screens. In Proceedings of the ACM Symposium on User Interface Software and Technology, pages 81--91, 1993.  ",
      "doi": "10.1145/168642.168650"
    },
    {
      "text": "Garth Shoemaker and Carl Gutwin. Supporting multipoint interaction in visual workspaces. In Proceedings of the ACM CHI 2007 Conference on Human Factors in Computing Systems, pages 999--1008, 2007.  ",
      "doi": "10.1145/1240624.1240777"
    },
    {
      "text": "James Slack, Kristian Hildebrand, and Tamara Munzner. PRISAD: A partitioned rendering infrastructure for scalable accordion drawing (extended version). Information Visualization, 5(2):137--151, 2006.  ",
      "doi": "10.1145/1149731.1149737"
    },
    {
      "text": "Jarke J. van Wijk and Wim A. A. Nuij. Smooth and efficient zooming and panning. In Proceedings of the IEEE Symposium on Information Visualization, pages 15--22, 2003. ",
      "doi": "10.5555/1947368.1947376"
    },
    {
      "text": "Polle T. Zellweger, Jock D. Mackinlay, Lance Good, Mark Stefik, and Patrick Baudisch. City lights: contextual views in minimal space. In Extended Abstracts of the ACM CHI 2003 Conference on Human Factors in Computing Systems, pages 838--839, 2003.  ",
      "doi": "10.1145/765891.766022"
    }
  ]
}