{
  "doi": "10.1145/1357054.1357290",
  "title": "A latent semantic analysis methodology for the identification and creation of personas",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1501-1510",
  "year": 2008,
  "badges": [],
  "abstract": "A persona represents a group of target users that share common behavioral characteristics. By using a narrative, picture, and name, a persona provides HCI practitioners with a vivid and specific design target. This research develops a new methodology for the identification and creation of personas through the application of Latent Semantic Analysis (LSA). An application of the LSA methodology is provided in the context of the design of an Institutional Repository system. The LSA methodology helps overcome some of the drawbacks of current methods for the identification and creation of personas, and makes the process less subjective, more efficient, and less reliant on specialized skills.",
  "tags": [
    "latent semantic analysis",
    "personas",
    "cluster analysis",
    "user abstraction",
    "institutional repository"
  ],
  "authors": [
    {
      "name": "Tomasz Miaskiewicz",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583838",
      "orcid": "missing"
    },
    {
      "name": "Tamara Sumner",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81339531152/rel-imgonly/aa.jpg",
      "acmid": "81339531152",
      "orcid": "missing"
    },
    {
      "name": "Kenneth A. Kozar",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100162726",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blackmon, M.H., Polson, P.G., Kitajima, M. and Lewis, C. Cognitive walkthrough for the web. Proc. CHI 2002, ACM Press (2002), 463--470.  ",
      "doi": "10.1145/503376.503459"
    },
    {
      "text": "Britt, M.A., Wiemer-Hastings, P., Larson, A.A. and Perfetti, C. Using intelligent feedback to improve sourcing and integration in students' essays. International Journal of Artificial Intelligence in Education, 14, 3-4, 2004, 359--374. ",
      "doi": "10.5555/1434913.1434919"
    },
    {
      "text": "Chi, E.H., Rosien, A., Supattanasiri, G., Williams, A., Royer, C., Chow, C., Robles, E., Dalal, B., Chen, J. and Cousins, S. The Bloodhound Project: automating discovering of web usability issues using the InfoScent Simulator. Proc. CHI 2003, ACM Press (2003), 505--512.  ",
      "doi": "10.1145/642611.642699"
    },
    {
      "text": "Cooper, A. The Inmates are Running the Asylum. Morgan Kaufmann Publishers, Indianapolis, IN, 1999. ",
      "doi": "10.5555/553473"
    },
    {
      "text": "Cooper, A. and Reimann, R.M. About Face 2.0. Wiley Publishing, Indianapolis, IN, 2003.",
      "doi": "10.5555/862232"
    },
    {
      "text": "Dong, A. The latent semantic approach to studying design team communication. Design Studies, 26, 5, 2005, 445--461.",
      "doi": ""
    },
    {
      "text": "Goodwin, K. Getting from research to personas: harnessing the power of data. Cooper Newsletters, 2002, http://www.cooper.com/content/insights/newsletters/2002_11/getting_from_research_to_personas.asp",
      "doi": ""
    },
    {
      "text": "Grudin, J. and Pruitt, J. Personas, participatory design and product development: an infrastructure for engagement. Proc. of the Participatory Design Conference, CPSR (2002), 144--161.",
      "doi": ""
    },
    {
      "text": "Hair, J.F., Black, W.C., Babin, B.J., Anderson, R.E. and Tatham, R.L. Multivariate Data Analysis. Pearson Prentice Hall, Upper Saddle River, NJ, 2006. ",
      "doi": "10.5555/207590"
    },
    {
      "text": "Hanna, P. Customer storytelling at the heart of business success. Boxes and Arrows, 2005, http://www.boxesandarrows.com/view/customer_storytelling_at_the_heart_of_business_success",
      "doi": ""
    },
    {
      "text": "Landauer, T.K. and Dumais, S.T. A solution to Plato's problem: the Latent Semantic Analysis theory of acquisition, induction, and representation of knowledge. Psychological Review, 104, 2, 1997, 211--240.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K., Foltz, P.W. and Laham, D. Introduction to latent semantic analysis. Discourse Processes, 25, 2-3, 1998, 259--284.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K., McNamara, D.S., Dennis, S.J. and Kintsch W. Handbook of Latent Semantic Analysis. Erlbaum, Mahwah, NJ, 2007.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K. and Psotka, J. Simulating text understanding for educational applications with latent semantic analysis: introduction to LSA. Interactive Learning Environments, 8, 2, 2000, 73--86.",
      "doi": ""
    },
    {
      "text": "Landis, J.R. and Koch, G.G. The measurement of observer agreement for categorical data. Biometrics, 33, 1, 1977, 159--174.",
      "doi": ""
    },
    {
      "text": "Lemaire, B. and Dessus, P. A system to assess the semantic content of student essays. Journal of Educational Computing Research, 24, 3, 2001, 305--320.",
      "doi": ""
    },
    {
      "text": "Magliano, J.P., Wiemer-Hastings, K., Millis, K.K., Munoz, B.D. and McNamara, D. Using latent semantic analysis to assess reader strategies. Behavior Research Methods, Instruments &amp; Computers, 34, 2, 2002, 181--188",
      "doi": ""
    },
    {
      "text": "Manning, H., Temkin, B. and Belanger, N. The power of design personas. Forrester Research, 2003, http://www.forrester.com/ER/Research/Report/0,1338,33033,00.html",
      "doi": ""
    },
    {
      "text": "Manning, H., Root, N.L. and Backer, E. Site design personas: how many, how much. Forrester Research, 2005, http://www.forrester.com/Research/Document/Excerpt/0,7211,37110,00.html",
      "doi": ""
    },
    {
      "text": "Moss, J., Kotovsky, K. and Cagan, J. The role of functionality in the mental representations of engineering students: some differences in the early stages of expertise. Cognitive Science, 30, 1, 2006, 65--93.",
      "doi": ""
    },
    {
      "text": "Norman, D. Ad-hoc personas and empathetic focus. Jnd.org, 2004, http://www.jnd.org/dn.mss/personas_empath.html",
      "doi": ""
    },
    {
      "text": "Pruitt, J., and Adlin, T. The Persona Lifecycle: Keeping People in Mind Throughout Product Design. Morgan Kaufmann, San Francisco, CA, 2006. ",
      "doi": "10.5555/1076976"
    },
    {
      "text": "Reilly, C., Wang, C. and Rutherford, M. A rapid method for the comparison of cluster analyses. Statistica Sinica, 15, 2005, 19--33",
      "doi": ""
    },
    {
      "text": "Sinha, R. Persona development for information-rich domains. Extended Abstracts CHI 2003, ACM Press (2003), 830--831.  ",
      "doi": "10.1145/765891.766017"
    },
    {
      "text": "Srihari, S., Collins, J., Srihari, R., Babu, P. and Srinivasan, H. Automated scoring of handwritten essays based on Latent Semantic Analysis. Proc. of Document Analysis Systems, Springer (2006), 71--83.  ",
      "doi": "10.1007/11669487_7"
    },
    {
      "text": "Tan, P., Steinbach, M. and Kumar, V. Introduction to Data Mining. Pearson, Boston, MA, 2006. ",
      "doi": "10.5555/1095618"
    },
    {
      "text": "Zampa, V. and Lemaire, B. Latent semantic analysis for user modeling. Journal of Intelligent Information Systems, 18, 1, 2002, 15--30.  ",
      "doi": "10.1023/A%3A1012916523718"
    }
  ]
}