{
  "doi": "10.1145/1357054.1357059",
  "title": "Human-Currency Interaction: learning from virtual currency use in China",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "25-28",
  "year": 2008,
  "badges": [],
  "abstract": "What happens when the domains of HCI design and money intersect? This paper presents analyses from an ethnographic study of virtual currency use in China to discuss implications for game design, and HCI design more broadly. We found that how virtual currency is perceived, obtained, and spent can critically shape gamers' behavior and experience. Virtual and real currencies can interact in complex ways that promote, extend, and/or interfere with the value and character of game worlds. Bringing money into HCI design heightens existing issues of realness, trust, and fairness, and thus presents new challenges and opportunities for user experience innovation.",
  "tags": [
    "virtual currencies",
    "ethnography",
    "hci design",
    "virtual worlds",
    "digital money",
    "online games",
    "trust",
    "China"
  ],
  "authors": [
    {
      "name": "Yang Wang",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81537980956",
      "orcid": "missing"
    },
    {
      "name": "Scott D. Mainwaring",
      "institution": "Intel Research, Beaverton, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100420884",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Castronova, E. Synthetic Worlds: The Business and Culture of Online Games. U. Of Chicago Press, 2005. ",
      "doi": "10.5555/1076839"
    },
    {
      "text": "Dibbell, J. Play Money. Basic Books, New York, 2006.",
      "doi": ""
    },
    {
      "text": "Dourish, P. Where the Action Is: The Foundations of Embodied Interaction. The MIT Press, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E. and Moore, R.J., \"Alone together?\": exploring the social dynamics of massively multiplayer online games. In Proc. CHI 2006, ACM Press (2006), 407 -- 416.  ",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Ducheneaut, N., Yee, N., Nickell, E. and Moore, R.J., The life and death of online gaming communities: a look at guilds in world of warcraft. In Proc. CHI 2007, ACM Press (2007), 839 -- 848.  ",
      "doi": "10.1145/1240624.1240750"
    },
    {
      "text": "Hart, K. The Memory Bank: Money in an Unequal World. Profile Books, 2000.",
      "doi": ""
    },
    {
      "text": "Maurer, B. The Anthropology of Money. Annual Review of Anthropology 35 (2006), 15--36.",
      "doi": ""
    },
    {
      "text": "Morris, J. Editorial: Living in Virtual Reality. Economic Affairs 20, 1 (2000), 2--4.",
      "doi": ""
    },
    {
      "text": "Nardi, B. and Harris, J., Strangers and Friends: Collaborative Play in World of Warcraft. In Proc. CSCW 2006, ACM Press (2006), 149--158.  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Netease. Q Coins and Tencent, 2006. tech.163.com/07/0126/17/35PHR3QG000915BF.html",
      "doi": ""
    },
    {
      "text": "Simmel, G. The Philosophy of Money. Routledge, 2004.",
      "doi": ""
    },
    {
      "text": "Suchman, L.A. Plans and Situated Actions: The problem of human machine communication. Cambridge University Press, Cambridge, UK, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Tencent. 2007 Interim and Second Quarter Results. www.tencent.com.hk/ir/pdf/news20070815a_e.pdf",
      "doi": ""
    },
    {
      "text": "Webb, S.D. and Soh, S., Cheating in networked computer games: a review. In Proc. DIMEA 2007, ACM Press (2007), 105 -- 112.  ",
      "doi": "10.1145/1306813.1306839"
    }
  ]
}