{
  "doi": "10.1145/1357054.1357090",
  "title": "Inflatable mouse: volume-adjustable mouse with air-pressure-sensitive input and haptic feedback",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "211-224",
  "year": 2008,
  "badges": [],
  "abstract": "Inflatable Mouse is a volume-adjustable user interface. It can be inflated up to the volume of a familiar mouse, but be deflated and stored flat in a PC card slot of a laptop computer when not in use. Inflatable Mouse functions just like a typical mouse; moreover, it provides new interaction techniques by sensing the air pressure in the balloon of the mouse. It also addresses some issues associated with pressure-sensing interactions such as the lack of bi-directional input and the lack of effective feedback. Moreover, it can be used as both a control tool and a display tool. In this paper, the design of an Inflatable Mouse prototype is described and potential application scenarios such as zooming in/out and fast scrolling using pressure control are explained. We also discuss the potential use of Inflatable Mouse as an emotional communication tool.",
  "authors": [
    {
      "name": "Seoktae Kim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659906008",
      "orcid": "missing"
    },
    {
      "name": "Hyunjung Kim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452601021",
      "orcid": "missing"
    },
    {
      "name": "Boram Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583269",
      "orcid": "missing"
    },
    {
      "name": "Tek-Jin Nam",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320511",
      "orcid": "0000-0002-7942-0766"
    },
    {
      "name": "Woohun Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100384795",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cechanowicz, J., Irani, P., and Subramanian, S. Augmenting the mouse with pressure sensitive input. In Proc. CHI 2007, ACM Press(2007), 1385--1394.  ",
      "doi": "10.1145/1240624.1240835"
    },
    {
      "text": "Iwata, H., Yano, H., and Ono, N. Volflex. A Demonstration and Abstract at ACM SIGGRAPH 2005 Program: Emerging Technologies, 2005.  ",
      "doi": "10.1145/1187297.1187329"
    },
    {
      "text": "MightyMouseTM. http://www.apple.com/mightymouse/.",
      "doi": ""
    },
    {
      "text": "Ramos, G., Boulos, M., and Balakrishnan, R., Pressure widgets. In Proc. CHI 2004, ACM Press(2004), 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Rekimoto, J. and Schwesig, C., PreSenseII: bi-directional touch and pressure sensing interactions with tactile feedback. In Proc. CHI 2006 Extended Abstracts, ACM Press(2006), 1253--1258.  ",
      "doi": "10.1145/1125451.1125685"
    },
    {
      "text": "Ullmer, B. and Ishii, H., Emerging frameworks for tangible user interfaces. In IBM Systems Journal, v.39, n.3 - 4, p. 915--931, July 2000.  ",
      "doi": "10.1147/sj.393.0915"
    }
  ]
}