{
  "doi": "10.1145/1357054.1357107",
  "title": "The cone and the lazy bubble: two efficient alternatives between the point cursor and the bubble cursor",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "309-312",
  "year": 2008,
  "badges": [],
  "abstract": "We evaluated two cursor designs in the continuum between the traditional point cursor and the bubble cursor by Grossman and Balakrishnan. The lazy bubble cursor expanded to envelop the closest target when the ratio of the distances to the closest and the second closest target was less than 1:2. In addition to this lazy behavior the cone cursor had a tail that stayed on the last enveloped target until the next target was enveloped. In an experiment with 18 participants we found that the bubble cursor was faster than our cursors that had smaller target activation areas but the difference remained very small. Of the bubble cursor variants the lazy bubble exhibited higher error rate than the other two. Thus, the winners on the objective metrics were the bubble cursor and the cone cursor. The lazy bubble cursor and the bubble cursor were preferred in subjective ratings.",
  "authors": [
    {
      "name": "Joona Laukkanen",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583961",
      "orcid": "missing"
    },
    {
      "name": "Poika Isokoski",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100311272/rel-imgonly/poika2_smaller.jpg",
      "acmid": "81100311272",
      "orcid": "missing"
    },
    {
      "name": "Kari-Jouko Räihä",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100052864/rel-imgonly/aa.jpg",
      "acmid": "81100052864",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aliakseyeu, D., Nacenta, M. A., Subramaniam, S., and Gutwin, C. Bubble radar: efficient pen-based interaction. In Proc. AVI 2006, 19--26.  ",
      "doi": "10.1145/1133265.1133271"
    },
    {
      "text": "Baudisch, P., Cuttrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B, and Zierlinger, A. Drag-and-drop and drag-and-pick: techniques for accessing remote screen content on touch- and pen-operated systems. In Proc. INTERACT 2003, 57--64.",
      "doi": ""
    },
    {
      "text": "Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381--391.",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The Bubble Cursor: Enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. CHI'05, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. Object pointing: a complement to bitmap pointing in GUIs. In Proc. Graphics Interface 2004, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Kabbash, P. and Buxton, W. The \"Prince\" technique: Fitts' law and selection using area cursors. In Proc. CHI'95, 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7 (1992), 91--139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "McGuffin, M. and Balakrishnan, R. Acquisition of expanding targets. In Proc. CHI'02, 57--64.  ",
      "doi": "10.1145/503376.503388"
    }
  ]
}