{
  "doi": "10.1145/1357054.1357245",
  "title": "An exploratory study of visual information analysis",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1217-1226",
  "year": 2008,
  "badges": [],
  "abstract": "To design information visualization tools for collaborative use, we need to understand how teams engage with visualizations during their information analysis process. We report on an exploratory study of individuals, pairs, and triples engaged in information analysis tasks using paper-based visualizations. From our study results, we derive a framework that captures the analysis activities of co-located teams and individuals. Comparing this framework with existing models of the information analysis process suggests that information visualization tools may benefit from providing a flexible temporal flow of analysis actions.",
  "tags": [
    "analysis process",
    "collaboration",
    "information visualization"
  ],
  "authors": [
    {
      "name": "Petra Isenberg",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501650640",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Sheelagh Carpendale",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616781",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. A. Amar and J. T. Stasko. Knowledge Precepts for Design and Evaluation of Information Visualizations. IEEE Transactions on Visualization and Computer Graphics, 11(4):432--442, July/August 2005.  ",
      "doi": "10.1109/TVCG.2005.63"
    },
    {
      "text": "J. Bertin. Semiology of Graphics: Diagrams Networks Maps. The University of Wisconsin Press, Madison, WI, USA, 1983. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "S. Card, J. D. Mackinlay, and B. Shneiderman, editors. Readings In Information Visualization: Using Vision To Think. Morgan Kauffman Publishers, Inc., San Francisco, USA, 1999. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "J. M. Carroll, M. B. Rosson, G. Convertino, and C. H. Ganoe. Awareness and Teamwork in Computer-Supported Collaborations. Interacting with Computers, 18(1):21--46, 2006.  ",
      "doi": "10.1016/j.intcom.2005.05.005"
    },
    {
      "text": "E. H.-H. Chi and J. T. Riedl. An Operator Interaction Framework for Visualization Systems. In Proc. of the Symposium on Information Visualization (InfoVis), pages 63--70, Los Alamitos, USA, 1998. IEEE Comp. Society. ",
      "doi": "10.5555/647341.721078"
    },
    {
      "text": "H. H. Clark. Using Language. Cambridge University Press, Cambridge, UK, 1996.",
      "doi": ""
    },
    {
      "text": "J. Heiser, B. Tversky, and M. Silverman. Sketches For and From Collaboration. In Visual and spatial reasoning in design III. Key Centre for Design Research, Sydney, 2004.",
      "doi": ""
    },
    {
      "text": "P. Isenberg and S. Carpendale. Interactive Tree Comparison for Co-located Collaborative Information Visualization. IEEE Transactions on Visualization and Computer Graphics, 12(5):1232--1238, Nov./Dec. 2007.  ",
      "doi": "10.1109/TVCG.2007.70568"
    },
    {
      "text": "T. Jankun-Kelly, K.-L. Ma, and M. Gertz. A Model and Framework for Visualization Exploration. IEEE Transactions on Visualization and Computer Graphics, 13(2):357--369, March/April 2007.  ",
      "doi": "10.1109/TVCG.2007.28"
    },
    {
      "text": "G. Mark and A. Kobsa. The Effects of Collaboration and System Transparency on CIVE Usage: An Empirical Study and Model. Presence, 14(1):60--80, February 2005.  ",
      "doi": "10.1162/1054746053890279"
    },
    {
      "text": "MayaViz. CoMotion®. Website, 2007. http://www.mayaviz.com/ (accessed March 2007).",
      "doi": ""
    },
    {
      "text": "K. S. Park, A. Kapoor, and J. Leigh. Lessons Learned from Employing Multiple Perspectives In a Collaborative Virtual Environment for Visualizing Scientific Data. In Proc. of the Conference on Collaborative Virtual Environments (CVE), pages 73--82, New York, USA, 2000. ACM Press.  ",
      "doi": "10.1145/351006.351015"
    },
    {
      "text": "D. M. Russell, M. J. Stefik, P. Pirolli, and S. K. Card. The Cost Structure of Sensemaking. In Proc. of the Conference on Human Factors in Computing Systems (CHI), pages 269--276, New York, NY, USA, 1993. ACM Press.  ",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "S. D. Scott, M. S. T. Carpendale, and K. M. Inkpen. Territoriality in Collaborative Tabletop Workspaces. In Proc. of the Conference on Computer-Supported Cooperative Work (CSCW), pages 294--303, New York, USA, 2004. ACM Press.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "B. Shneiderman. The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations. In Proc. of the Symp. on Visual Languages, pages 336--343, Los Alamitos, USA, 1996. IEEE Computer Society. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "R. Spence. A Framework for Navigation. International Journal of Human-Computer Studies, 51(5):919--945, November 1999.  ",
      "doi": "10.1006/ijhc.1999.0265"
    },
    {
      "text": "R. Spence. Information Visualization. Pearson Education Limited, Harlow, England, 2nd edition, 2007. ",
      "doi": "10.5555/1196684"
    },
    {
      "text": "A. Tang, M. Tory, B. Po, P. Neumann, and S. Carpendale. Collaborative Coupling over Tabletop Displays. In Proc. of the Conference on Human Factors in Computing Systems (CHI), pages 1181--1290, New York, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "J. C. Tang. Findings from Observational Studies of Collaborative Work. International Journal of Man-Machine Studies, 34(2):143--160, February 1991.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "J. J. Thomas and K. A. Cook, editors. Illuminating the Path: The Research and Development Agenda for Visual Analytics. National Visualization and Analytics Center, August 2005.",
      "doi": ""
    },
    {
      "text": "F. B. Viégas, M. Wattenberg, F. van Ham, J. Kriss, and M. McKeon. Many Eyes: A Site for Visualization at Internet Scale. IEEE Transactions on Visualization and Computer Graphics (Proceedings Visualization / Information Visualization 2007), 12(5):1121--1128, Nov./Dec. 2007.  ",
      "doi": "10.1109/TVCG.2007.70577"
    }
  ]
}