{
  "doi": "10.1145/1357054.1357255",
  "title": "It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1285-1294",
  "year": 2008,
  "badges": [],
  "abstract": "We present data from detailed observations of CityWall, a large multi-touch display installed in a central location in Helsinki, Finland. During eight days of installation, 1199 persons interacted with the system in various social configurations. Videos of these encounters were examined qualitatively as well as quantitatively based on human coding of events. The data convey phenomena that arise uniquely in public use: crowding, massively parallel interaction, teamwork, games, negotiations of transitions and handovers, conflict management, gestures and overt remarks to co-present people, and \"marking\" the display for others. We analyze how public availability is achieved through social learning and negotiation, why interaction becomes performative and, finally, how the display restructures the public space. The multi-touch feature, gesture-based interaction, and the physical display size contributed differentially to these uses. Our findings on the social organization of the use of public displays can be useful for designing such systems for urban environments.",
  "tags": [
    "situated public displays",
    "urban environments",
    "multi-user interfaces"
  ],
  "authors": [
    {
      "name": "Peter Peltonen",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342507378",
      "orcid": "missing"
    },
    {
      "name": "Esko Kurvinen",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143375",
      "orcid": "missing"
    },
    {
      "name": "Antti Salovaara",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100551588/rel-imgonly/antti-2011-08-29-cropped-washed.jpg",
      "acmid": "81100551588",
      "orcid": "missing"
    },
    {
      "name": "Giulio Jacucci",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100644548/rel-imgonly/81100644548.png",
      "acmid": "81100644548",
      "orcid": "missing"
    },
    {
      "name": "Tommi Ilmonen",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100391905",
      "orcid": "missing"
    },
    {
      "name": "John Evans",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580664",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Petri Saarikko",
      "institution": "Helsinki Institute for Information Technology and University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342509745",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agostini, A., De Michelis, G., Divitini, M., Grasso, M.A. and Snowdon, D. Design and deployment of community systems: reflections on the Campiello experience. Interacting with Computers 14, 6 (2002), 689---712.",
      "doi": ""
    },
    {
      "text": "Ananny, M. Strohecker, C. and Biddick, K.. Shifting scales on common ground: developing personal expressions and public opinions. International Journal of Continuing Engineering Education and Life Long Learning 14, 6 (2004), 484--505.",
      "doi": ""
    },
    {
      "text": "Brignull, H. and Rogers, Y. Enticing people to interact with large public displays in public spaces. In Proc. INTERACT 2003, IOS Press (2003), Amsterdam, 17--24.",
      "doi": ""
    },
    {
      "text": "Brignull, H., Izadi, S., Fitzpatrick, G., Rogers, Y., and Rodden, T. The introduction of a shared interactive surface into a communal space. In Proc. CSCW 2004, ACM Press (2004), New York, 49--58.  ",
      "doi": "10.1145/1031607.1031616"
    },
    {
      "text": "Fatah gen. Schieck, A. and Kostakos, V. Exploring digital encounters in the city. Position paper presented in CHI2007 workshop on Shared Encounters. Available at www.cs.bath.ac.uk/~vk/files/chi07.pdf",
      "doi": ""
    },
    {
      "text": "Goffman, E. Behavior in Public Places. Free Press (1963), New York.",
      "doi": ""
    },
    {
      "text": "Huang, E.M., Mynatt, E.D. Semi-public displays for small, co-located groups. In Proc. CHI 2003, ACM Press (2003), New York, 49--56.  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "Huang, E.M., Mynatt, E.D. and Trimble, J.P. Displays in the wild: understanding the dynamics and evolution of a display ecology. In Proc. Pervasive 2006, Lecture Notes in Computer Science 3968, Springer (2006), Berlin, 321--336.  ",
      "doi": "10.1007/11748625_20"
    },
    {
      "text": "Huang, E.M., Mynatt, E.D. and Trimble, J.P. When design just isn't enough: the unanticipated challenges of the real world for large collaborative displays. Personal and Ubiquitous Computing 11, 7 (2007), 537--547, To appear, published online.  ",
      "doi": "10.1007/s00779-006-0114-3"
    },
    {
      "text": "Izadi, S., Brignull, H., Rodden, T. and Rogers, Y. Underwood, M. Dynamo: A public interactive surface supporting the cooperative sharing and exchange of media. In Proc. UIST 2003, ACM Press (2003), New York, 159--168.  ",
      "doi": "10.1145/964696.964714"
    },
    {
      "text": "Jacucci, G. Interaction as Performance. Cases of Configuring Physical Interfaces in Mixed Media. Oulu University Press (2004), Oulu, Finland.",
      "doi": ""
    },
    {
      "text": "Kurvinen, E., Lähteenmäki, M., Salovaara, A. and Lopez F. Are You Alive? Sensor data as a resource for social interaction. Journal of Knowledge, Technology & Policy 20, 1 (2007), 39--49.",
      "doi": ""
    },
    {
      "text": "Livingston, E.C. Making Sense of Ethnomethodology. Routledge & Kegan Paul, London, 1987.",
      "doi": ""
    },
    {
      "text": "Matsushita, N. and Rekimoto, J. HoloWall: designing a finger, hand, body, and object sensitive wall. In Proc. UIST 2003, ACM Press (2003), New York, 159--168.",
      "doi": ""
    },
    {
      "text": "Morris, M.R., Huang, A., Paepcke, A. and Winograd, T. Cooperative gestures: multi-user gestural interactions for co-located groupware. In Proc. CHI 2006, ACM Press (2006), New York, 1201--1210.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Robertson, T. The Public Availability of actions and artefacts. Computer Supported Cooperative Work 11, 3-4 (2002), 299--316.  ",
      "doi": "10.1023/A%3A1021214827446"
    },
    {
      "text": "Rogers, Y. and Rodden, T. Configuring spaces and surfaces to support collaborative interactions. In O'Hara, K., Perry, M., Churchill, E. and Russell, D. (eds.). Public and Situated Displays: Social and Interactional Aspects of Shared Display Technologies. Kluwer, Dordrecht, The Netherlands, 2003, 45--79.",
      "doi": ""
    },
    {
      "text": "Rogers, Y., Hazlewood, W., Blevis, E. and Lim, Y.-K. Finger talk: collaborative decision-making using talk and fingertip interaction around a tabletop display. In Proc. CHI 2004, ACM Press (2004), New York, 1271--1274.  ",
      "doi": "10.1145/985921.986041"
    },
    {
      "text": "Russell, D.M., Drews, D. and Sue, A. Social Aspects of Using Large Public Interactive Displays for Collaboration. In Proc. UbiComp 2002, Lecture Notes in Computer Science 2498, Springer (2002), Berlin, 229--236. ",
      "doi": "10.5555/647988.741473"
    },
    {
      "text": "Sacks, H., Schegloff, E.A. and Jefferson, G. A simplest systematics for the organization of turn taking in conversation. Language 50, 4 (1974), 696--735.",
      "doi": ""
    },
    {
      "text": "Schegloff, E.A. and Sacks, H. Opening Up Closings. Semiotica VIII, 4 (1973), 289--327.",
      "doi": ""
    },
    {
      "text": "Skog, T., Ljungblad, S. and Lars Holmquist, L.E. Between aesthetics and utility: designing ambient information visualizations. In Proc. InfoVis 2003, IEEE Computer Society (2003), New York, 233--240. ",
      "doi": "10.5555/1947368.1947410"
    },
    {
      "text": "Tschumi, B. Architechture and Limits III (1981). In Nesbitt, K. (ed.), Theorizing a New Agenda for Architecture. An Anthology of Architectural Theory 1965-1995. Princeton Architectural Press (1996), New York, 156--162.",
      "doi": ""
    },
    {
      "text": "Vogel, D. and Balakrishnan, R. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proc. UIST 2004, ACM Press (2004), New York, 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Wisneski, C., Ishii, H., Dahley, A., Gorbet, M., Brave, S., Ullmer, B., Yarin, P. Ambient displays: turning architectural space into an interface between people and digital information. In Proc. CoBuild 1998, Lecture Notes in Computer Science 1370, Springer (1998), Berlin, 22--33. ",
      "doi": "10.5555/645968.674740"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. In Proc. UIST 2003, ACM Press (2003), New York, 193--202.  ",
      "doi": "10.1145/964696.964718"
    }
  ]
}