{
  "doi": "10.1145/1357054.1357319",
  "title": "Multi-flick: an evaluation of flick-based scrolling techniques for pen interfaces",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1689-1698",
  "year": 2008,
  "badges": [],
  "abstract": "Multi-flick, which consists of repeated flick actions, has received popular media attention as an intuitive and natural document-scrolling technique for stylus based systems. In this paper we put multi-flick to test, by designing several flick-based scrolling techniques. We first map out the de-sign space of multi-flick and identify mapping functions that make multi-flick a natural and intuitive technique for document navigation. In the first experiment we compare several multi-flick variations for navigating lists on three different devices -- a PDA, a tabletPC, and a large table. Our study shows that compound-multi-flick (CMF) is the most preferred technique and it is at least as fast, if not faster than the traditional scrollbar. In a follow-up experiment, we evaluate multi-flick for scrolling text-based documents. Results show that all implementations of multi-flick are as good as the scrollbar for short distances while CMF is the most preferred. We discuss the implications of our findings and present several design guidelines.",
  "authors": [
    {
      "name": "Dzimitry Aliakseyeu",
      "institution": "Philips Research Eindhoven, Netherlands, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361598222",
      "orcid": "0000-0001-7075-5052"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Andrés Lucero",
      "institution": "Eindhoven University of Te hnology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81314484387/rel-imgonly/81314484387.jpg",
      "acmid": "81314484387",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Apitz, G. and Guimbretière, F. CrossY: a crossing-based drawing application. In Proc. UIST '04, 3--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Andersen, T. H. A simple movement time model for scrolling. In CHI'05 Extended Abstracts, 1180--1183.  ",
      "doi": "10.1145/1056808.1056871"
    },
    {
      "text": "Ayatsuka, Y., Rekimoto, J., and Matsuoka, S. Popup vernier: a tool for sub-pixel-pitch dragging with smooth mode transition. In Proc. UIST '98, 39--48.  ",
      "doi": "10.1145/288392.288407"
    },
    {
      "text": "Bartlett, J. F. 2000. Rock'n'Scroll Is Here to Stay, IEEE Computer Graphics and Applications, 20(3), 40--45.  ",
      "doi": "10.1109/38.844371"
    },
    {
      "text": "Byrne, M. D., John, B. E., Wehrle, N. S., Crow, D. C. The tangled Web we wove: a taxonomy of WWW use. In Proc. CHI'99, 544--551.  ",
      "doi": "10.1145/302979.303154"
    },
    {
      "text": "Cockburn, A., Gutwin, C., Alexander, J. Faster Document Navigation with Space-Filling Thumbnails. In Proc CHI'06, 1--10.  ",
      "doi": "10.1145/1124772.1124774"
    },
    {
      "text": "Cockburn, A., Savage, J., and Wallace, A. Tuning and testing scrolling interfaces that automatically zoom. In Proc. CHI '05, 71--80.  ",
      "doi": "10.1145/1054972.1054983"
    },
    {
      "text": "Cooper, K., de Bruijn, O., Spence, R., Witkowski, M. A comparison of static and moving presentation modes for image collections. In Proc. AVI'06, 381--388.  ",
      "doi": "10.1145/1133265.1133345"
    },
    {
      "text": "Evans, K. B., Tanner, P. P., Wein, M. 1981. Tablet-based Valuators that Provide One, Two or Three Degrees of Freedom. Computer Graphics 15 (3), 91--97  ",
      "doi": "10.1145/965161.806794"
    },
    {
      "text": "Geißler, J. Shuffle, throw or take it! working efficiently with an interactive wall. In CHI'98 Extended Abstracts, 265--266.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Harrison, B. L., Fishkin, K. P., Gujar, A., Mochon, C., and Want, R. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. In Proc. CHI'98, 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Hascoët, M. Throwing models for large displays, Proceedings of British HCI'2003, 73--77.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Cutrell, E., Bathiche, S., Muss, T. Quantitative Analysis of Scrolling Techniques. In Proc. CHI'02, 65--67.  ",
      "doi": "10.1145/503376.503389"
    },
    {
      "text": "Hinrichs, U., Carpendale, S., and Scott, S. D. Evaluating the effects of fluid interface components on tabletop collaboration. In Proc. AVI '06, 27--34.  ",
      "doi": "10.1145/1133265.1133272"
    },
    {
      "text": "Igarashi, T. and Hinckley, K. Speed-dependent auto-matic zooming for browsing large documents. In Proc. UIST '00, 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Irani, P., Gutwin, C., and Yang, X. D. Improving selection of off-screen targets with hopping. In Proc. CHI '06, 299--308.  ",
      "doi": "10.1145/1124772.1124818"
    },
    {
      "text": "Johnson, J. A. A comparison of user interfaces for panning on a touch-controlled display. In Proc. CHI'95, 218--225.  ",
      "doi": "10.1145/223904.223932"
    },
    {
      "text": "Kaptelinin, V., Mäntylä, T., and Åström, J. Transient visual cues for scrolling: an empirical study. In CHI '02 Extended Abstracts, 620--621.  ",
      "doi": "10.1145/506443.506513"
    },
    {
      "text": "Klein, C. and Bederson, B. B. Benefits of animated scrolling. In CHI '05 Extended Abstracts, 1965--1968.  ",
      "doi": "10.1145/1056808.1057068"
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S. D., and Tang, A. Fluid integration of rotation and translation. In Proc. CHI '05, 601--610.  ",
      "doi": "10.1145/1054972.1055055"
    },
    {
      "text": "MacKenzie, I. and Riddersma, S. Effects of Output Display and Control-Display Gain on Human Performance. In Interactive Systems. Behaviour and Information Technology, 13 (5), 328--337.",
      "doi": ""
    },
    {
      "text": "Moscovich, T., Hughes, J. F. Navigating Documents with the Virtual Scroll Ring. In Proc. UIST'04, 57--60.  ",
      "doi": "10.1145/1029632.1029642"
    },
    {
      "text": "Reetz, A., Gutwin, C., Stach, T., Nacenta, M., and Subramanian, S. Superflick: a natural and efficient technique for long-distance object placement on digital tables. In Proc. Graphics Interface'06, 163--170. ",
      "doi": "10.5555/1143079.1143106"
    },
    {
      "text": "Schraefel, M., Smith, G. M., Baudisch, P. Curve Dial: Eyes-free Parameter Entry for GUIs. In Proc. CHI'05 Extended Abstracts, pp. 1146--1147.  ",
      "doi": "10.1145/1056808.1056855"
    },
    {
      "text": "Smith, G. M. and Schraefel, M. C. The radial scroll tool: scrolling support for stylus- or touch-based document navigation. In Proc. UIST'04, 53--56.  ",
      "doi": "10.1145/1029632.1029641"
    },
    {
      "text": "Sun, L., Guimbretière, F. Flipper: a new method of digital document navigation, In CHI '05 Extended Abstracts, 2001--2004.  ",
      "doi": "10.1145/1056808.1057077"
    },
    {
      "text": "van Wijk, J. and Nuij, W. 2004. A Model for Smooth Viewing and Navigation of Large 2D Information Spaces. IEEE Trans. on Vis. and Comp. Graphics, 10 (4), 447--458.  ",
      "doi": "10.1109/TVCG.2004.1"
    },
    {
      "text": "Weld, D., and de Kleer, J. 1989. Readings in Qualitative Reasoning about Physical Systems. San Francisco, Calif: Morgan Kaufmann. ",
      "doi": "10.5555/93913"
    },
    {
      "text": "Wherry, E. Scroll Ring Performance Evaluation. In CHI'03 Extended Abstracts, 758--759.  ",
      "doi": "10.1145/765891.765973"
    },
    {
      "text": "Wirth, M. and Zhai, S. 2000. Visual scrolling feedback and method of achieving the same. US patent 6,476,83.",
      "doi": ""
    },
    {
      "text": "Wittenburg, K., Forlines, C., Lanning, T., Esenther, A., Harada, S., and Miyachi, T. Rapid serial visual presentation techniques for consumer digital video devices. In Proc. UIST '03, 115--124.  ",
      "doi": "10.1145/964696.964709"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. Multi-finger and whole hand gestural interaction techniques for multi-user table-top displays. In Proc. UIST '03, 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Zhai, S., Smith, B. A., and Selker, T. Improving Browsing Performance: A study of four input devices for scrolling and pointing tasks. In Proc. Interact'97, 286--293. ",
      "doi": "10.5555/647403.723823"
    }
  ]
}