{
  "doi": "10.1145/1357054.1357182",
  "title": "Keeping in touch by technology: maintaining friendships after a residential move",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "807-816",
  "year": 2008,
  "badges": [],
  "abstract": "Many observers have praised new communication technologies for providing convenient and affordable tools for maintaining relationships at a distance. Yet the precise role of mediated communication in relationship maintenance has been difficult to isolate. In this paper, we treat residential moves as natural experiments that threaten existing social relationships and often force people to rely on mediated communication to maintain their old relationships. Results from a 3-wave survey of 900 residential movers describing 1892 relationships shows that email and the telephone play different roles in social relationships. Email helps maintain social relationships, in the sense that relationships decline when email drops after the move. However increases in email are not associated with increases in the depth of the relationship or exchanges of support. In contrast, phone calls help movers grow relationships and exchange social support.",
  "tags": [
    "friendship",
    "cmc",
    "communication",
    "mobility",
    "social relationships"
  ],
  "authors": [
    {
      "name": "Irina Shklovski",
      "institution": "University of California Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81100288406/rel-imgonly/portraits_2019-2020_colour1.jpeg",
      "acmid": "81100288406",
      "orcid": "0000-0003-1874-0958"
    },
    {
      "name": "Robert Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Jonathon Cummings",
      "institution": "Duke University, Durham, NC, USA",
      "img": "/do/10.1145/contrib-81100088002/rel-imgonly/cummings.jpg",
      "acmid": "81100088002",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allan, G. (1989) Friendship: developing a sociological perspective. Westview Press, Boulder.",
      "doi": ""
    },
    {
      "text": "Baumeister, R.F. &amp; Leary, M.R. (1995) The Need to Belong: Desire for Interpersonal Attachments as a Fundamental Human Motivation. Psychological Bulletin, 117(3). 497--529.",
      "doi": ""
    },
    {
      "text": "Berscheid, E. &amp; Lopes, J. (1997) A temporal model of relationship satisfaction and stability. in Sternberg, R. &amp; Hojjat, M. eds. Satisfaction in close relationships, Guilford Press, New York, 129--159.",
      "doi": ""
    },
    {
      "text": "Boase, J. &amp; Wellman, B. (2006) Personal relationships: On and off the Internet. in Perlman, D. &amp; Vangelisti, A.L. eds. Handbook of Personal Relations, University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Boden, D. &amp; Molotch, H. (1994) The compulsion of proximity. in Friedland, R. &amp; Boden, D. eds. NowHere: Space, time and modernity, University of California Press, Berkeley, 257--286.",
      "doi": ""
    },
    {
      "text": "Braithwaite, D.O., Waldron, V.R. &amp; Finn, J. (1999) Communication of social support in computer-mediated groups for people with disabilities. Health Communication, 11(2). 123--151.",
      "doi": ""
    },
    {
      "text": "Bryk, A.S. &amp; Raudenbush, S.W. (1992) Hierarchical linear models: Applications and data analysis methods. Sage Publications, Inc, Thousand Oaks, CA, US.",
      "doi": ""
    },
    {
      "text": "Burt, R. (1986) A note on sociometric order in the general social survey network data. Social Networks, 8. 149--174.",
      "doi": ""
    },
    {
      "text": "Canary, D.J. &amp; Stafford, L. (1994) Maintaining relationships through strategic and routine interaction. in Canary, D.J. &amp; Stafford, L. eds. Communication and relational maintenance, Academic Press, San Diego, CA, US, 3--22.",
      "doi": ""
    },
    {
      "text": "Cohen, J., Cohen, P., West, S.G. &amp; Aiken, L.S. (2003) Applied multiple regression/correlation analysis for the behavioral sciences. Lawrence Erlbaum Associates, Mahwah, New Jersey.",
      "doi": ""
    },
    {
      "text": "Cohen, S., Mermelstein, R., Kamarck, T. &amp; Hoberman, H. (1984) Measuring the functional components of social support. in Sarason, I.S.B. ed. Social support: Theory, research, and applications, Martines Niijhoff, The Hague, Holland.",
      "doi": ""
    },
    {
      "text": "Cummings, J., Kraut, R. &amp; Lee, J. (2006) Communication technology and friendship: The transition from high school to college. in Kraut, R., Brynin, M. &amp; Kiesler, S. eds. Computers, Phones, and the Internet: The Social Impact of Information Technology, Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Daft, R. &amp; Lengel, R. (1986) Organizational information requirements, media richness and structural design. Management Science, 32(5). 554--571.  ",
      "doi": "10.1287/mnsc.32.5.554"
    },
    {
      "text": "DaVanzo, J. (1983) Repeat migration in the United States: Who moves back and who moves on? The Review of Economics and Statistics, 65(4). 552--559.",
      "doi": ""
    },
    {
      "text": "Dindia, K. (2004) The function of holiday greetings in maintaining relationships. Journal of Social &amp; Personal Relationships, 21(5). 577--593.",
      "doi": ""
    },
    {
      "text": "Duck, S., Rutt, D., Hurst, M. &amp; Strejc, H. (1991) Some evident truths about conversations in everyday relationships: All communications are not created equal. Human Communication Research, 18(2). 228--267.",
      "doi": ""
    },
    {
      "text": "Falk, T. &amp; Abler, R. (1980) Intercommunications, Distance, and Geographical Theory. Geografiska Annaler. Series B, Human Geography, 62(2). 59--67.",
      "doi": ""
    },
    {
      "text": "Finchum, T. (2005) Keeping the ball in the air; Contact in long-distance friendships. Journal of Women and Aging, 17(3). 91--106.",
      "doi": ""
    },
    {
      "text": "Fischer, C.S. (1982) To dwell among friends: Personal networks in town and city. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Fox, S. (2005) Digital Divisions, Pew Internet &amp; American Life Project, Washington DC, 2005.",
      "doi": ""
    },
    {
      "text": "Hoffman, D., Novak, T.P. &amp; Venkatesh, A. (2004) Has the Internet become indispensable? Communications of the ACM, 47(7). 37--42.  ",
      "doi": "10.1145/1005817.1005818"
    },
    {
      "text": "Kraut, R., Patterson, M., Lundmark, V., Kiesler, S., Mukhopadhyay, T. &amp; Scherlis, W. (1998) Internet paradox: A social technology that reduces social involvement and psychological well-being? American Psychologist, 53(9). 1017--1031.",
      "doi": ""
    },
    {
      "text": "McKenna, K., Green, A.S. &amp; Gleason, M.E.J. (2002) Relationship formation on the Internet: What's the big attraction? Journal of Social Issues, 58(1). 9--31.",
      "doi": ""
    },
    {
      "text": "Menon, G. &amp; Yorkston, E. (2000) The use of memory and contextual clues in the formation of behavioral frequency judgments. in Stone, A.A., Turkkan, J.S., Bachrach, C.A., Jobe, J.B., Kurtzman, H.S. &amp; Cain, V.S. eds. The science of self-report: Implications for research and practice, Lawrence Erlbaum Associates, New Jersey, 63--79.",
      "doi": ""
    },
    {
      "text": "Nie, N.H. (2001) Sociability, interpersonal relations, and the Internet: Reconciling conflicting findings. American Behavioral Scientist, 45(3). 420--435.",
      "doi": ""
    },
    {
      "text": "Nussbaum, J.F. (1994) Friendship in older adulthood. in Hummert, M.L., Wiemann, J.M. &amp; Nussbaum, J.F. eds. Interpersonal communication in older adulthood: interdisciplinary theory and research, Sage Publications, Thousand Oaks, Calif., 209--225.",
      "doi": ""
    },
    {
      "text": "Orlikowski, W.J. &amp; Yates, J. (1994) Genre repertoire: The structuring of communicative practices in organizations. Administrative Science Quarterly, 39(4). 541--574.",
      "doi": ""
    },
    {
      "text": "Rohlfing, M.E. (1995) \"Doesn't anybody stay in one place anymore?\" An exploration of under-studied phenomenon of long-distance relationships. in Wood, J.T. &amp; Duck, S. eds. Understudied relationships; Off the beaten track, Sage Publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Rose, S. (1984) How friendships end: Patterns among young adults. Journal of Social &amp; Personal Relationships, 1(3). 267--277.",
      "doi": ""
    },
    {
      "text": "Schachter, J. (2004) Geographic mobility: 2002-2003 Current population reports, U.S. Census Bureau, 2004.",
      "doi": ""
    },
    {
      "text": "Shklovski, I., Kiesler, S. &amp; Kraut, R. (2006) The Internet and social interaction: A meta-analysis and critique of studies, 1995-2003. in Kraut, R., Brynin, M. &amp; Kiesler, S. eds. Computers, Phones and the Internet: The Social Impact of Information Technology, Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Shklovski, I. &amp; Mainwaring, S. (2005) Exploring technology adoption through the lens of residential mobility. in proceedings of CHI 2005, Portland, Oregon.  ",
      "doi": "10.1145/1054972.1055058"
    },
    {
      "text": "Sigman, S.J. (1991) Handling discontinuous aspects of continuing social relationships: Toward research on the persistence of social forms. Communication Theory, 1. 106--127.",
      "doi": ""
    },
    {
      "text": "Smoreda, Z. &amp; Licoppe, C. (2000) Gender-specific use of the domestic telephone. Social Psychology Quarterly, 63(3). 238--252.",
      "doi": ""
    },
    {
      "text": "Smoreda, Z. &amp; Thomas, F. (2001) Social networks and residential ICT adoption and use. in EURESCOM Summit, (Heidelburg).",
      "doi": ""
    },
    {
      "text": "Stafford, L. (2004) Maintaining long-distance and cross-residential relationships. Lawrence Erlbaum Associates, New Jersey.",
      "doi": ""
    },
    {
      "text": "Starker, J.E. (1990) Psychosocial aspects of geographical relocation: The development of a new social network. American Journal of Health Promotion, 5(2). 52--57.",
      "doi": ""
    },
    {
      "text": "Tourangeau, R. (2000) Remembering What Happened: Memory Errors and Survey Reports. in Stone, A.A., Turkkan, J.S., Bachrach, C.A., Jobe, J.B., Kurtzman, H.S. &amp; Cain, V.S. eds. The Science of Self-Report: Implications for Research and Practice, Lawrence Erlbaum Associates, Mahweh, New Jersey, 29--48.",
      "doi": ""
    },
    {
      "text": "Wellman, B. &amp; Wortley, S. (1990) Different strokes from different folks: Community ties and social support. American Journal of Sociology, 96(3). 558--588.",
      "doi": ""
    },
    {
      "text": "Whittaker, S., Jones, Q., Nardi, B., Creech, M., Terveen, L., Isaacs, E. &amp; Hainsworth, J. (2004) ContactMap: Organizing communication in a social desktop. ACM Transactions of Computer Human Interaction (TOCHI), 11(4). 445--471.  ",
      "doi": "10.1145/1035575.1035580"
    }
  ]
}