{
  "doi": "10.1145/1357054.1357177",
  "title": "It's on my other computer!: computing with multiple devices",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "767-776",
  "year": 2008,
  "badges": [],
  "abstract": "The number of computing devices that people use is growing. To gain a better understanding of why and how people use multiple devices, we interviewed 27 people from academia and industry. From these interviews we distill four primary findings. First, associating a user's activities with a particular device is problematic for multiple device users because many activities span multiple devices. Second, device use varies by user and circumstance; users assign different roles to devices both by choice and by constraint. Third, users in industry want to separate work and personal activities across work and personal devices, but they have difficulty doing so in practice Finally, users employ a variety of techniques for accessing information across devices, but there is room for improvement: participants reported managing information across their devices as the most challenging aspect of using multiple devices. We suggest opportunities to improve the user experience by focusing on the user rather than the applications and devices; making devices aware of their roles; and providing lighter-weight methods for transferring information, including synchronization services that engender more trust from users.",
  "tags": [
    "multiple devices",
    "cross device interaction",
    "user study",
    "personal computing",
    "personal information management"
  ],
  "authors": [
    {
      "name": "David Dearman",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100428285/rel-imgonly/headshot-nokia.jpg",
      "acmid": "81100428285",
      "orcid": "missing"
    },
    {
      "name": "Jeffery S. Pierce",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81100303065/rel-imgonly/jeffpierce.jpg",
      "acmid": "81100303065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrams, D., Baecker, R. and Chignell, M. Information archiving with bookmarks: personal Web space construction and organization. In Proc. CHI 1998, ACM Press/Addison-Wesley Publishing Co. (1998), 41--48.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Bandelloni, R. and Paternò, F. Migratory user interfaces able to adapt to various interaction platforms. International Journal of Human Computer Studies, 60, 5--6 (2004), 621--639.",
      "doi": ""
    },
    {
      "text": "Bardram, J.E. Activity-based computing: support for mobility and collaboration in ubiquitous computing. Personal and Ubiquitous Computing, 9, 5 (2005), 312--322.  ",
      "doi": "10.1007/s00779-004-0335-2"
    },
    {
      "text": "Barreau, D. and Nardi, B.A. Finding and reminding: file organization from the desktop. SIGCHI Bulletin, 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., Smith, I. and Grinter, R.E. Quality Versus Quantity: E-Mail-Centric Task Management and Its Relation With Overload. Human-Computer Interaction, 20, 1-2 (2005), 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R. and Nachmias, R. The project fragmentation problem in personal information management. In Proc. CHI 2006, ACM Press (2006), 271--274.  ",
      "doi": "10.1145/1124772.1124813"
    },
    {
      "text": "Bush, V. As we may think. The Atlantic Monthly, 176, 1 (1945), 101--108.",
      "doi": ""
    },
    {
      "text": "Buzzword. www.buzzword.com.",
      "doi": ""
    },
    {
      "text": "Caceres, R., Carter, C., Narayanaswami, C. and Raghunath, M. Reincarnating PCs with portable SoulPads. In Proc. MobiSys 2005, ACM (2005), 65--78.  ",
      "doi": "10.1145/1067170.1067179"
    },
    {
      "text": "Cypher, A. The structure of users' activities. in Norman, D. and Draper, S. eds. User Centered System Design, New Perspectives on Human-Computer Interaction, Lawrence Erlbaum Associates, 1986. ",
      "doi": "10.5555/576915"
    },
    {
      "text": "del.icio.us. http://del.icio.us.",
      "doi": ""
    },
    {
      "text": "Dumais, S., Cutrell, E., Cadiz, J., Jancke, G., Sarin, R. and Robbins, D.C. Stuff I've seen: a system for personal information retrieval and re-use. In Proc. SIGIR 2003, ACM Press (2003), 72--79.  ",
      "doi": "10.1145/860435.860451"
    },
    {
      "text": "Google Browser Sync. www.google.com/tools/firefox/browsersync/.",
      "doi": ""
    },
    {
      "text": "Google Desktop. http://desktop.google.com/.",
      "doi": ""
    },
    {
      "text": "Google Docs. http://docs.google.com/.",
      "doi": ""
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. In Proc. CHI 2001, ACM Press (2001), 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Hinkley, K. Synchronous gestures for multiple persons and computers. In Proc. UIST 2003, ACM Press (2003), 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Lansdale, M. The psychology of personal information management. Applied Ergonomics, 19, 1 (1988), 55--66.",
      "doi": ""
    },
    {
      "text": "Miller, R.C. and Myers, B.A. Synchronizing clipboards of multiple computers. In Proc. UIST 1999, ACM (1999), 65--66.  ",
      "doi": "10.1145/320719.322584"
    },
    {
      "text": "Nippert-Eng, C.E. Home and Work: Negotiating Boundaries through Everyday Life. University of Chicago Press, 1996.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A. and Sumari, L. Mobile kits and laptop trays: managing multiple devices in mobile information work. In Proc. CHI 2007, ACM Press (2007), 1127--1136.  ",
      "doi": "10.1145/1240624.1240795"
    },
    {
      "text": "Plaxo. www.plaxo.com.",
      "doi": ""
    },
    {
      "text": "Satyanarayanan, M., Kozuch, M.A., Helfrich, C.J. and O'Hallaron, D.R. Towards Seamless Mobility on Pervasive Hardware. Pervasive and Mobile Computing, 1, 2 (2005), 157--189.  ",
      "doi": "10.1016/j.pmcj.2005.03.005"
    },
    {
      "text": "Schilit, B.N. and Sengupta, U. Device Ensembles. Computer, 37, 12 (2004), 56--64.  ",
      "doi": "10.1109/MC.2004.241"
    },
    {
      "text": "RealVNC. www.realvnc.com.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The Computer for the 21st Century. Scientific American, 265, 3 (1991), 94--104.",
      "doi": ""
    },
    {
      "text": "Whittaker, S. and Sinder, C. Email overload: exploring personal information management of email In Proc. CHI 1996, ACM Press (1996), 276--283.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Woodruff, A., Anderson, K., Mainwaring, S.D. and Aipperspach, R. Portable, But Not Mobile: A Study of Wireless Laptops in the Home. In Proc. Pervasive 2008, Springer-Verlag (2007), 216--233. ",
      "doi": "10.5555/1758156.1758173"
    }
  ]
}