{
  "doi": "10.1145/1357054.1357188",
  "title": "Human-aided computing: utilizing implicit human processing to classify images",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "845-854",
  "year": 2008,
  "badges": [],
  "abstract": "In this paper, we present Human-Aided Computing, an approach that uses an electroencephalograph (EEG) device to measure the presence and outcomes of implicit cognitive processing, processing that users perform automatically and may not even be aware of. We describe a classification system and present results from two experiments as proof-of-concept. Results from the first experiment showed that our system could classify whether a user was looking at an image of a face or not, even when the user was not explicitly trying to make this determination. Results from the second experiment extended this to animals and inanimate object categories as well, suggesting generality beyond face recognition. We further show that we can improve classification accuracies if we show images multiple times, potentially to multiple people, attaining well above 90% classification accuracies with even just ten presentations.",
  "authors": [
    {
      "name": "Pradeep Shenoy",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81337493710",
      "orcid": "missing"
    },
    {
      "name": "Desney S. Tan",
      "institution": "Microsoft Resear h, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon.com. Mechanical Turk. http://www.mturk.com.",
      "doi": ""
    },
    {
      "text": "Anderson, D.P., Cobb, J., Korpela, E., Lebofsky, M., &amp; Werthimer, D. (2002). SETI@home: An experiment in public-resource computing. Communications of the ACM, 45(11), 56--61.  ",
      "doi": "10.1145/581571.581573"
    },
    {
      "text": "Broadbent, D.E. (1958). Perception and communication. Pergamon Press: London, UK.",
      "doi": ""
    },
    {
      "text": "Carmel, D., Bentin, S. (2002). Domain specificity versus expertise: factors influencing distinct processing of faces. Journal of Cognition, 83, 1--29.",
      "doi": ""
    },
    {
      "text": "Farwell, L.A., Donchin, E. (1988). Talking off the top of your head: toward a mental prosthesis utilizing event-related brain potentials. Electroencephalography &amp; Clinical Neurophysiology, 70(6), 510--23.",
      "doi": ""
    },
    {
      "text": "Fisch, B.J. (2005). Fisch &amp; Spehlmann's EEG primer: Basic principles of digital and analog EEG. Elsevier: Amsterdam.",
      "doi": ""
    },
    {
      "text": "Gerson, A.D., Parra, L.C., &amp; Sajda, P. (2006). Cortically-coupled computer vision for rapid image search. IEEE Transactions on Neural Systems and Rehabilitation Engineering, 14(2), 174--179.",
      "doi": ""
    },
    {
      "text": "Griffin, G. Holub, A.D. Perona, P. (2007). The Caltech-256, Caltech Technical Report.",
      "doi": ""
    },
    {
      "text": "Grill-Spector, K. (2003). The neural basis of object perception. Current opinion in neurobiology, 13, 1--8.",
      "doi": ""
    },
    {
      "text": "Hariri, S., Parashar, M. eds. (2004). Tools and environments for paralell and distributed computing. Wiley Press: Hoboken, NJ. ",
      "doi": "10.5555/971131"
    },
    {
      "text": "Hastie, T., Tibshirani, R. &amp; Friedman, J.H. (2001). The elements of statistical learning: Data mining, inference, and prediction. Springer Series in Statistics. Springer-Verlag: New York, New York.",
      "doi": ""
    },
    {
      "text": "Hoffman, U., Vesin, J-M, Ebrahimi, T. (2006). Spatial filters for the classification of event-related potentials. In European Symposium on Artificial Neural Networks, 47--52.",
      "doi": ""
    },
    {
      "text": "Itier, R.J., Taylor, M.J. (2004). N170 or N1? Spatiotemporal differences between object and face processing using ERPs. Cerebral Cortex, 14, 132--142.",
      "doi": ""
    },
    {
      "text": "Jasper, H.H. (1958). The ten-twenty electrode system of the international federation. Electroencephalography and Clinical Neurophysiology, 10, 371--375.",
      "doi": ""
    },
    {
      "text": "Johnson J.S., Olshausen, B.A. (2005). The earliest EEG signatures of object recognition in a cued-target task are postsensory. Journal of Vision, 5(4), 299--312.",
      "doi": ""
    },
    {
      "text": "Koch, C., Tsuchiya, N. (2006). Attention and consciousness: Two distinct brain processes. Trends in Cognitive Sciences, 11(1), 16--22.",
      "doi": ""
    },
    {
      "text": "Larson, S.M., Snow, C., &amp; Pande, V.S. (2003). Folding@Home and Genome@Home: Using distributed computing to tackle previously intractable problems in computational biology. Modern Methods in Computational Biology (ed. R. Grant). Horizon Press.",
      "doi": ""
    },
    {
      "text": "Lee, J.C., Tan, D.S. (2006). Using a low-cost electroencephalograph for task classification in HCI research. In 19th ACM Symposium on User Interface Software and Technology, 81--90.  ",
      "doi": "10.1145/1166253.1166268"
    },
    {
      "text": "Marszalek, Z.J.M., Lazebnik, S., &amp; Schmid, C. (2006). Local features and kernels for classifcation of texture and object categories: A comprehensive study. International Journal of Computer Vision, 73(2), 213--238.  ",
      "doi": "10.1007/s11263-006-9794-4"
    },
    {
      "text": "Miller, G.A. (1987) Psychology: the science of mental life. Penguin: Harmondsworth, UK.",
      "doi": ""
    },
    {
      "text": "Posner, K.R. (1978). Chronometric explorations of mind. Lawrence Erlbaum Associates: Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Rossion, B., Gauthier, I., Delvenne, J.-F., Tarr, M.J., Bruyer, R., &amp; Crommelinck, M. (1999). Does the N170 occipito-temporal component reflect a face-specific structural encoding stage? Poster at Object Perception and Memory 1999.",
      "doi": ""
    },
    {
      "text": "Velmans, M. (1991). Is human processing conscious? Behavioral and Brain Sciences, 14, 651--726.",
      "doi": ""
    },
    {
      "text": "von Ahn, L. (2006). Games with a purpose. IEEE Computer Magazine, 39(6), 92--94.  ",
      "doi": "10.1109/MC.2006.196"
    },
    {
      "text": "von Ahn, L., Dabbish, L. (2004). Labeling images with a computer game. In CHI 2004 Conference on Human Factors in Computing Systems, 319--326.  ",
      "doi": "10.1145/985692.985733"
    }
  ]
}