{
  "doi": "10.1145/1357054.1357302",
  "title": "A co-located interface for narration to support reconciliation in a conflict: initial results from Jewish and Palestinian youth",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1583-1592",
  "year": 2008,
  "badges": [],
  "abstract": "So called intractable conflicts may benefit from more modest and socially oriented approaches than those based on classical conflict resolution techniques. This paper is inspired by theories on small group intervention in a conflict. The general claim is that participants may achieve a greater understanding of and appreciation for the other's viewpoint under conditions that support partaking in a tangible joint task and creating a shared narration. Our goal was to design a methodology wherein the extent to which technology contributes to conflict negotiation and resolution could be assessed. Specifically, a co-located interface for producing a joint narration as a tool for favouring reconciliation is presented and discussed. The results of an initial set of studies where the interface was used by Arab and Jewish youth in Israel provided insight into the usability of the various components of the technology and of the paradigm.",
  "tags": [
    "tabletop interaction",
    "face-to-face collaboration",
    "narration"
  ],
  "authors": [
    {
      "name": "Oliviero Stock",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409595352",
      "orcid": "missing"
    },
    {
      "name": "Massimo Zancanaro",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/do/10.1145/contrib-81100153077/rel-imgonly/mz-s.jpg",
      "acmid": "81100153077",
      "orcid": "missing"
    },
    {
      "name": "Chaya Koren",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418595182",
      "orcid": "missing"
    },
    {
      "name": "Cesare Rocchi",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100072664",
      "orcid": "missing"
    },
    {
      "name": "Zvi Eisikovits",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418595475",
      "orcid": "missing"
    },
    {
      "name": "Dina Goren-bar",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100179029",
      "orcid": "missing"
    },
    {
      "name": "Daniel Tomasini",
      "institution": "FBK-irst, Trento, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578541",
      "orcid": "missing"
    },
    {
      "name": "Patrice (Tamar) Weiss",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572487",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alborzi, H., Druin, A., Montemayor, J., Platner, M., Porteous, J., Sherman, L., Boltman, A., Taxén, G., Best, J., Hammer, J., Kruskal, A., Lal, A., Schwenn, T. P., Sumida, L., Wagner, R. and Hendler, J. Designing StoryRooms: interactive storytelling spaces for children. In Proceedings of the Conference on Designing interactive Systems: Processes, Practices, Methods, and Techniques. New York, 2000.  ",
      "doi": "10.1145/347642.347673"
    },
    {
      "text": "Ananny, M. Supporting Children's Collaborative Authoring: Practicing Written Literacy While Composing Oral Texts. In Proceedings of Computer-Supported Collaborative Learning. Boulder, CO, 2002. ",
      "doi": "10.5555/1658616.1658739"
    },
    {
      "text": "Bar-On, D. and Adwan, S. The PRIME Shared History Project. Peace-Building Project Under Fire. In Y. Iram (ed.) Educating Toward a Culture of Peace, pp 309--323, Information Age Publishing, Charlotte, NC, 2006.",
      "doi": ""
    },
    {
      "text": "Bar-On, D. and Kassem, F. Storytelling as a way to work-through intractable conflicts: The German Jewish experience and its relevance to the Palestinian-Israeli context. Journal of Social Issues 60(2):289--306, 2004.",
      "doi": ""
    },
    {
      "text": "Baruch Bush R. A. and Folger, J.P. The Promise of Mediation: Responding to Conflict Through Empowerment and Recognition. Jossey-Bass Publishers, San Francisco, 1994.",
      "doi": ""
    },
    {
      "text": "Benford, S., Rowland, D., Flintham, M., Drozd, A., Hull, R., Reid, J., Morrison, J. and Facer, K. Life on the edge: supporting collaboration in location-based experiences. In Proceedings of CHI-05, Portland, OR, 2005.  ",
      "doi": "10.1145/1054972.1055072"
    },
    {
      "text": "Bobick, A. F., Intille, S. S., Davis, J. W., Baird, F., Pinhanez, C. S., Campbell, L. W., Ivanov, Y. A., Schütte, A. and Wilson, A. Perceptual user interfaces: the KidsRoom. Communication of ACM, 43(3) March 2000.  ",
      "doi": "10.1145/330534.330541"
    },
    {
      "text": "Burak, A., Keylor, E. and Sweeney, T. PeaceMaker: A Video Game to Teach Peace. In Proceedings of INTETAIN 2005. Madonna di Campiglio, Italy. 2005.  ",
      "doi": "10.1007/11590323_40"
    },
    {
      "text": "Cassell, J. Towards a model of technology and literacy development: Story listening systems. Journal of Applied Developmental Psychology, 25:75--105, 2004.",
      "doi": ""
    },
    {
      "text": "Dietz, P.H. and Leigh, D.L. DiamondTouch: A Multi-User Touch Technology. In Proceedings of ACM Symposium on User Interface Software and Technology (UIST), Orlando, FL. 2001.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Eisikovits, Z. and Buchbinder, E. Locked in a violent embrace. Sage, Thousand Oaks, CA, 2000.",
      "doi": ""
    },
    {
      "text": "Green, J., Schnädelbach, H., Koleva, B., Benford, S., Pridmore, T. and Medina, K. Camping in the Digital wilderness: tents and flashlights as interfaces to virtual worlds. In Proceedings of ACM CHI-2002. 2002.  ",
      "doi": "10.1145/506443.506594"
    },
    {
      "text": "Kruger, R., Carpendale, S., Scott, S. and Tang, A. Fluid integration of rotation and translation. In Proceedings of ACM CHI-05. Portland, 2005.  ",
      "doi": "10.1145/1054972.1055055"
    },
    {
      "text": "Kruger, R. and Carpendale, S. Orientation and Gesture on Horizontal Displays Roles of Orientation in Tabletop Collaboration: Comprehension, Coordination and Communication. Journal of Computer Supported Collaborative Work, 13(5-6):501--537, 2004.  ",
      "doi": "10.1007/s10606-004-5062-8"
    },
    {
      "text": "Luwisch, F. E. Understanding what goes on in the heart and the mind: learning about diversity and co-existence through storytelling. Teaching and Teacher Education 17:133--146, 2001.",
      "doi": ""
    },
    {
      "text": "Maoz, I., Bar-On, D. and Fakhereldeen, M. The Dialogue between the \"Self\" and the \"Other\": a Process Analysis of Palestinian Jewish Encounters in Israel. Human Relations, 55(8): 931--962, 2002.",
      "doi": ""
    },
    {
      "text": "McNamee, S. and Gergen, K. Relational Responsibility: Resources for Sustainable Dialogue. Sage, Thousand Oaks, CA, 1999.",
      "doi": ""
    },
    {
      "text": "Morris Ringel, M., Huang, A., Paepcke, A. and Winograd, T. Cooperative Gestures: Multi-User Gestural Interactions for Co-located Groupware. In Proceedings of ACM CHI-06. Montréal, Canada, 2006.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Pettygrew, T.F. Intergroup Contact Theory. Annual Review of Psychology, Vol. 49, pp. 65--85, 1998.",
      "doi": ""
    },
    {
      "text": "Pianesi, F., Stock, O., Zancanaro, M., Venuti, P., Cappelletti, A., Iandolo, G., Prete, M. and Rossi, F. Children and Museums: an Environment for Collaborative Storytelling. In O. Stock, M. Zancanaro (eds.) PEACH: Intelligent Interfaces for Museum Visits. Cognitive Technologies Series, Springer, Berlin-Heidelberg, 2007.",
      "doi": ""
    },
    {
      "text": "Price, S, Rogers, Y, Scaife, M, Stanton, D, and Neale, H. Using 'tangibles' to promote novel forms of playful learning. In Interacting with Computers, 15(2):169--185, May 2003.",
      "doi": ""
    },
    {
      "text": "Ryokai, K, Vaucelle, C. and Cassell, J. Virtual Peers as Partners in Storytelling and Literacy Learning. Journal of Computer Assisted Learning 19(2):195--208, 2003.",
      "doi": ""
    },
    {
      "text": "Salomon, G. Does peace education make a difference in the context of an intractable conflict? Peace and Conflict. Journal of Peace Psychology, 10(3):257--274, 2004.",
      "doi": ""
    },
    {
      "text": "Shen, C., Lesh, N. B., Vernier, F., Forlines, C., and Frost, J. Sharing and building digital group histories. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work CSCW '02.New Orleans, Louisiana, 2002.  ",
      "doi": "10.1145/587078.587124"
    },
    {
      "text": "Winslade, J., and Monk, G. Narrative Mediation. A New Approach to Conflict Resolution. Jossey-Bass Publisher, San Francisco, 2000.",
      "doi": ""
    },
    {
      "text": "Winstok, Z., Eisikovits, Z. and Fishman, G. Towards the development of a conflict escalation model: The case of Israeli youth. Journal of Youth and Adolescence, 33(4):283--292, 2004.",
      "doi": ""
    }
  ]
}