{
  "doi": "10.1145/1357054.1357115",
  "title": "Playful toothbrush: ubicomp technology for teaching tooth brushing to kindergarten children",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "363-372",
  "year": 2008,
  "badges": [],
  "abstract": "This case study in UbiComp technology and design presents a \"Playful Toothbrush\" system for assisting parents and teachers to motivate kindergarten children to learn proper and thorough brushing skills. The system includes a vision-based motion tracker that recognizes different tooth brushing strokes and a tooth brushing game in which the child cleans a virtual, mirror picture of his/her dirty teeth by physically brushing his/her own teeth. The user study results suggest that Playful Toothbrush enhances the effectiveness of kindergarten children in brushing their teeth, as measured by number of brushing strokes, duration of brushing and thoroughness of teeth cleaning.",
  "authors": [
    {
      "name": "Yu-Chen Chang",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659632511",
      "orcid": "missing"
    },
    {
      "name": "Jin-Ling Lo",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384604365",
      "orcid": "missing"
    },
    {
      "name": "Chao-Ju Huang",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582714",
      "orcid": "missing"
    },
    {
      "name": "Nan-Yi Hsu",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350579621",
      "orcid": "missing"
    },
    {
      "name": "Hao-Hua Chu",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81100141352/rel-imgonly/hao.jpg",
      "acmid": "81100141352",
      "orcid": "missing"
    },
    {
      "name": "Hsin-Yen Wang",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350581054",
      "orcid": "missing"
    },
    {
      "name": "Pei-Yu Chi",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81440599192/rel-imgonly/peggychi_se2.jpg",
      "acmid": "81440599192",
      "orcid": "0000-0001-8511-2834"
    },
    {
      "name": "Ya-Lin Hsieh",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577632",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandrini, N. A. Play - A child's world. American Journal of Occupational Therapy, 3(1949), 9--12.",
      "doi": ""
    },
    {
      "text": "Anaise, J. Z. The toothbrush in plaque removal. Journal of Dentistry for Children, 42(1975), 186--189.",
      "doi": ""
    },
    {
      "text": "Bundy, A. C. Play and playfulness: What to look for. Parham, L. D., Fazio, L. S. eds. Play in occupational therapy for children, MO: Mosby, 1997, Chapter 4.",
      "doi": ""
    },
    {
      "text": "Chi, P., Chen, J.-H., Chu, H.-H. and Chen, B.-Y. Enabling nutrition-aware cooking in a smart kitchen. Ext. Abstracts CHI 2007, April 2007.  ",
      "doi": "10.1145/1240866.1241003"
    },
    {
      "text": "Choo, A., Delac, D. M. and Messer, L. B. Oral hygiene measures and promotion: review and considerations. Australian Dental Journal, 46(2001), 166--73.",
      "doi": ""
    },
    {
      "text": "Colgate-Palmolive Company, http://www.colgate.com",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Everitt, K., Smith, I. and Landay, J. A. Design requirements for technologies that encourage physical activity. In Proc. CHI 2006, 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Consolvo, S., Paulos, E. and Smith, I. Mobile persuasion for everyday behavior change. In Mobile Persuasion: 20 Perspective on the Future of Behavior Change, Fogg &amp; Eckles, Ed. Stanford captology media, 2007, 77--86.",
      "doi": ""
    },
    {
      "text": "Dean, J. A. and Hughes, C. V. Mechanical and chemo-therapeutic home oral hygiene. McDonald, R. E., Avery, D. R., Dean, J. A. eds. Dentistry for the child and adolescent (8th ed.). St. Louis, MI: Mosby, 2004, Chapter 11.",
      "doi": ""
    },
    {
      "text": "Dunn, W., Brown, C., McClain, L. and Westman, K. The ecology of human performance: A contextual perspective on human occupation. In C. B. Royeen (Ed.) AOTA self-study series: The practice of the future: Putting occupation back into therapy. Rockville, MD: American Occupational Therapy Association, 1994.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann, 2002. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Fogg, B.J. and Dean E. Mobile Persuasion: 20 Perspectives on the Future of Behavior Change. Stanford captology media, Stanford, California, USA, 2007.",
      "doi": ""
    },
    {
      "text": "Hasbro, Inc., TOOTH TUNES http://www.hasbro.com/toothtunes/.",
      "doi": ""
    },
    {
      "text": "Hausmann, E. and Hausmann, B. Motivation-Key to patient success in mechanical plaque control. The Journal of the American Dental Association, 92(1976), 403--408.",
      "doi": ""
    },
    {
      "text": "Kielhofner, G. A model of human occupation: Theory and application. MD: Lippincott Williams &amp; Wilkins, 2002.",
      "doi": ""
    },
    {
      "text": "Kimball, J. G. Sensory integration frame of reference. Kramer, P., Hinojosa J. eds. Frames of reference for pediatric occupational therapy. Baltimore: Williams &amp; Wikins. 1993, Chapter 11.",
      "doi": ""
    },
    {
      "text": "King, P. and Tester, J. The landscape of persuasive technologies. Communications of ACM, 42, 5(1999), 31--38.  ",
      "doi": "10.1145/301353.301398"
    },
    {
      "text": "Ko, J.-C., Hung, Y.-P. and Chu, H.-H. Mug-Tree: a Playful Mug to encourage healthy habit of drinking fluid regularly. In the Late Breaking Results (LBR) session of Proc. UBICOMP 2007, Sep. 2007.",
      "doi": ""
    },
    {
      "text": "Leal, S.C., Bezerra, A.C. and de Toledo O.A. Effectiveness of teaching methods for toothbrushing in preschool children. Brazilian Dental Journal, 13 (2002), 133--136.",
      "doi": ""
    },
    {
      "text": "Lo, J.-L., Lin, T.-Y., Chu, H.-H., Chou, H.-C., Chen, J.-H., Hsu, J.Y. and Huang, P. Playful tray: adopting Ubi-Comp and persuasive techniques into play-based occupational therapy for reducing poor eating behavior in young children. In Proc. UBICOMP 2007, Sep. 2007. ",
      "doi": "10.5555/1771592.1771595"
    },
    {
      "text": "McClure, D. B. A comparison of toothbrushing techniques for the preschool child. Journal of Dentistry for Children, 33(1966), 205--210.",
      "doi": ""
    },
    {
      "text": "Nawyn, J., Intille, S. S. and Larson, K. Embedding behavior modification strategies into a consumer electronic device: a case study. In Proc. UBICOMP 2006, Sep. 2006, 297--314.  ",
      "doi": "10.1007/11853565_18"
    },
    {
      "text": "Ogasawara, T., Watanabe, T. and Kasahara, H. Readiness for toothbrushing of young children. Journal of Dentistry for Children, 59(1992), 353--359.",
      "doi": ""
    },
    {
      "text": "O'Leary, T. J., Drake, R. B. and Naylor, J. E. The plaque control record. Journal of Periodontology, 43(1972), 38--39.",
      "doi": ""
    },
    {
      "text": "Oral-B.Triumph with SmartGuide ProfessionalCare 9910 Smart Guide. http://www.oral-b.com/us/products/power/triumphsmartguide/",
      "doi": ""
    },
    {
      "text": "Piper, A.M., O'Brien, E., Morris, M.R. and Winograd, T. SIDES: A cooperative tabletop computer game for social skills development. In Proc. CSCW 2006, Nov. 2006.  ",
      "doi": "10.1145/1180875.1180877"
    },
    {
      "text": "Preisch, J. W. The relationship between visual motor integration and oral hygiene in children, Master's Thesis, Bloomington, 1984, Indiana University.",
      "doi": ""
    },
    {
      "text": "Rodger, S. and Ziviani, J. Play-based occupational therapy, International Journal of Disability, Development and Education, 46(1999), 337--365.",
      "doi": ""
    },
    {
      "text": "Rugg-Gunn, A. J. and Macgregor, I. D. A survey of toothbrushing behaviour in children and young adults. Journal of Periodontal Research, 13 (1978), 382--9.",
      "doi": ""
    },
    {
      "text": "Shrout, P. E. and Fleiss, J. L. Intraclass correlations: Uses in assessing rater reliability. Psychological Bulletin, 86(1979), 420--428.",
      "doi": ""
    },
    {
      "text": "Simmons, S., Smith, R. and Gelbier, S. Effect of oral hygiene instruction on brushing skills in preschool children. Community Dentistry and Oral Epidemiology. 1983; 11: 193--198.",
      "doi": ""
    },
    {
      "text": "Starkey, P. Instructions to parents for brushing the child's teeth. Journal of Dentistry for Children, 28(1961), 42--47.",
      "doi": ""
    },
    {
      "text": "Tanguay, S. and Heywood, P. MyFoodPhone: the start of a mobile health revolution. In Mobile Persuasion: 20 Perspective on the Future of Behavior Change, Fogg &amp; Eckles, Ed. Stanford Captology Media, 2007, 21--28.",
      "doi": ""
    },
    {
      "text": "Tsamtsouris, A., White, G. E. and Clark, E. R. The effect of instruction and supervised toothbrushing on the reduction of dental plaque in kindergarten children. Journal of Dentistry for Children, 46(1979), 204--209.",
      "doi": ""
    }
  ]
}