{
  "doi": "10.1145/1357054.1357098",
  "title": "Handsaw: tangible exploration of volumetric data by direct cut-plane projection",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "251-254",
  "year": 2008,
  "badges": [],
  "abstract": "Tangible User Interfaces are well-suited to handling three-dimensional data sets by direct manipulation of real objects in space, but current interfaces can make it difficult to look inside dense volumes of information. This paper presents the Handsaw, a system that detects a virtual cut-plane projected by an outstretched hand or laser-line directly on an object or space and reveals sectional data on an adjacent display. By leaving the hands free and using a remote display, these techniques can be shared between multiple users and integrated into everyday practice. The Handsaw has been prototyped for scientific visualizations in medicine, engineering and urban design. User evaluations suggest that using a hand is more intuitive while projected light is more precise than keyboard and mouse control, and the Handsaw system has the potential to be used effectively by novices and in groups.",
  "authors": [
    {
      "name": "Leonardo Bonanni",
      "institution": "MIT Media Laboratory, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100186035/rel-imgonly/leoinindia100x100.jpg",
      "acmid": "81100186035",
      "orcid": "missing"
    },
    {
      "name": "Jason Alonso",
      "institution": "MIT Media Laboratory, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317490579",
      "orcid": "missing"
    },
    {
      "name": "Neil Chao",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414611963",
      "orcid": "missing"
    },
    {
      "name": "Greg Vargas",
      "institution": "MIT, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574903",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "MIT Media Laboratory, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Angesleva, J. Body Scanner. http://angesleva.iki.fi/projects/body_scanner/main.html",
      "doi": ""
    },
    {
      "text": "Goble, J.C, et.al. Two-Handed Spatial Interface Tools for Neurosurgical Planning. IEEE Computer, Vol. 28 No. 7 pp.20--6 July 1995.  ",
      "doi": "10.1109/2.391037"
    },
    {
      "text": "Hinckley, K., et.al. Passive Real-World Interface Props for Neurosurgical Visualization, In Proc. CHI '94, pp. 452--458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Ishii, H. and Ullmer, B., Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms, in Proc. CHI '97, pp. 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Lee, C-H., Ma, Y-P and Jeng, T. A Spatially-aware Tangible Interface for Computer-Aided Design. In Proc. CHI '03, Ft. Lauderdale, FL., USA, pp 960--1.  ",
      "doi": "10.1145/765891.766094"
    },
    {
      "text": "Piper, B., Ratti, C., and Ishii, H. Illuminating Clay: A 3-D Tangible Interface for Landscape Analysis. In Proc. CHI '02, pp. 181--190.  ",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Qi, W. et. al. Reach the Virtual Environment --- 3D Tangible Interaction with Scientific Data. In Proc. OZCHI 2005, Canberra, Australia. ",
      "doi": "10.5555/1108368.1108398"
    },
    {
      "text": "Ratti, C., Wang, Y., Piper, B., Ishii, H., Biderman, A. PHOXEL-SPACE: an Interface for Exploring Volumetric Data with Physical Voxels. In Proc. DIS '04, Cambridge Massachusetts, USA, pp. 289--96.  ",
      "doi": "10.1145/1013115.1013156"
    },
    {
      "text": "Schkolne, S., Pruett, M., Schroder, P. Surface Drawing: Creating Organic 3D Shapes with the Hand and Tangible Tools. In Proc. CHI 2001, pp. 261--8.  ",
      "doi": "10.1145/365024.365114"
    },
    {
      "text": "Underkoffler, J., Ullmer, B., and Ishii, H. Emancipated Pixels: Real-World Graphics in The Luminous Room. In Proc. SIGGRAPH '99, pp. 385--392.  ",
      "doi": "10.1145/311535.311593"
    }
  ]
}