{
  "doi": "10.1145/1357054.1357241",
  "title": "Large scale analysis of web revisitation patterns",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1197-1206",
  "year": 2008,
  "badges": [],
  "abstract": "Our work examines Web revisitation patterns. Everybody revisits Web pages, but their reasons for doing so can differ depending on the particular Web page, their topic of interest, and their intent. To characterize how people revisit Web content, we analyzed five weeks of Web interaction logs of over 612,000 users. We supplemented these findings by a survey intended to identify the intent behind the observed revisitation. Our analysis reveals four primary revisitation patterns, each with unique behavioral, content, and structural characteristics. Through our analysis we illustrate how understanding revisitation patterns can enable Web sites to provide improved navigation, Web browsers to predict users' destinations, and search engines to better support fast, fresh, and effective finding and re-finding.",
  "authors": [
    {
      "name": "Eytan Adar",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589033",
      "orcid": "missing"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Susan T. Dumais",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100134501/rel-imgonly/sdumais02.jpg",
      "acmid": "81100134501",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aula, A., N. Jhaveri, and M. Käki. Information search and re-access strategies of experienced Web users. In Proceedings of WWW '05, 2005.  ",
      "doi": "10.1145/1060745.1060831"
    },
    {
      "text": "Ayers, E. and J. Stasko. Using graphic history in browsing the World Wide Web. In Proceedings of WWW '95, 1995.",
      "doi": ""
    },
    {
      "text": "Bhide, M., P. Deolasee, A. Katkar, A. Panchbudhe, K. Ramamritham, and P. Shenoy. Adaptive Push-Pull: Disseminating dynamic Web data. IEEE Trans. Comput. 51(6):652--668, 2002.  ",
      "doi": "10.1109/TC.2002.1009150"
    },
    {
      "text": "Catledge, L.D. and J.E. Pitkow. Characterizing browsing strategies in the World-Wide Web. In Proceedings of WWW '95, 1995.  ",
      "doi": "10.1016/0169-7552%2895%2900043-7"
    },
    {
      "text": "ChangeDetect. www.changedetect.com, retrieved Jan. 2008.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and B. McKenzie. What do Web users do? An empirical analysis of Web use. Int. J. of Human-Computer Studies, 54(6): 903--922, 2001.  ",
      "doi": "10.1006/ijhc.2001.0459"
    },
    {
      "text": "Cockburn, A. and S. Greenberg. Issues of Page Representation and Organisation in Web Browser-Revisitation Tools. Australian J. of Info. Systems, 7(2):120--127, 2000.",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and A. Cockburn, Getting back to back: Alternate behaviors for a Web browser's back button. In Proceedings of the 5th Annual Human Factors and the Web Conference, 1999.",
      "doi": ""
    },
    {
      "text": "Herder, E. Characterizations of user Web revisit behavior. In Proceedings of Workshop on Adaptivity and User Modeling in Interactive Systems, 2005.",
      "doi": ""
    },
    {
      "text": "Jones, W., S. Dumais, and H. Bruce. Once found, what then?: A study of 'keeping' behaviors in the personal use of Web information. In Proceedings of ASIST '02, 2002.",
      "doi": ""
    },
    {
      "text": "Kaasten, S. and S. Greenberg. Designing an integrated bookmark / history system for Web browsing. Western Computer Graphics Symposium, 2000.",
      "doi": ""
    },
    {
      "text": "Karypis, G. Cluto -- a clustering toolkit, www.cs.umn.edu/~cluto, retrieved Jan. 2008.",
      "doi": ""
    },
    {
      "text": "Kellar, M., C. Watters, and K. M. Inkpen. An exploration of Web-based monitoring: Implications for design. In Proceedings of CHI'07, 2007.  ",
      "doi": "10.1145/1240624.1240686"
    },
    {
      "text": "Kellar, M., Watters, C., and Shepherd, M. A goal-based classification of Web information tasks. In Proceedings of ASIST '06, 2006.",
      "doi": ""
    },
    {
      "text": "Milic-Frayling, N., Jones, R., Rodden, K., Smyth, G., Blackwell, A., and Sommerer, R. Smartback: Supporting users in back navigation. In Proceedings of WWW '04, 2004.  ",
      "doi": "10.1145/988672.988682"
    },
    {
      "text": "Morrison, J. B., P. Pirolli, and S, K. Card. A taxonomic analysis of what World Wide Web activities significantly impact people's decisions and actions. In Proceedings of CHI '01, 2001.  ",
      "doi": "10.1145/634067.634167"
    },
    {
      "text": "Obendorf, Hartmut, H, Weinreich, E. Herder, and M. Mayer. Web page revisitation revisited: Implications of a long-term click-stream study of browser usage. In Proceedings of CHI '07, 2007.  ",
      "doi": "10.1145/1240624.1240719"
    },
    {
      "text": "Open Directory Project, www.dmoz.org, retrieved Jan. 2008.",
      "doi": ""
    },
    {
      "text": "Sanderson, M. and S. T. Dumais. Examining repetition in user search behavior. In Proceedings of ECIR '07, 2007. ",
      "doi": "10.5555/1763653.1763725"
    },
    {
      "text": "Sebastiani, F. Machine learning in automated text categorization. ACM Computing Surveys, 34(1):1--47, 2002.  ",
      "doi": "10.1145/505282.505283"
    },
    {
      "text": "Sellen, A. J., R. Murphy, and K.L. Shaw. How knowledge workers use the Web. In Proceedings of CHI '02, 2002.  ",
      "doi": "10.1145/503376.503418"
    },
    {
      "text": "Takano, H. and T. Winograd. Dynamic bookmarks for the WWW. In Proceedings of Hypertext '98, 1998.  ",
      "doi": "10.1145/276627.276667"
    },
    {
      "text": "Tauscher, L. and S. Greenberg. How people revisit Web pages: Empirical findings and implications for the design of history systems. Int. J. of Human-Computer Studies, 47(1):97--137, 1997.  ",
      "doi": "10.1006/ijhc.1997.0125"
    },
    {
      "text": "Teevan, J. The Re:Search Engine: Simultaneous support for finding and re-finding. In Proceedings of UIST '07, 2007.  ",
      "doi": "10.1145/1294211.1294217"
    },
    {
      "text": "Teevan, J., E. Adar, R. Jones, and M. A. Potts. Information re-retrieval: repeat queries in Yahoo's logs. In Proceedings of SIGIR '07, 2007.  ",
      "doi": "10.1145/1277741.1277770"
    },
    {
      "text": "White, R. W. and S. M. Drucker. Investigating behavioral variability in Web search. In Proceedings of WWW '07, 2007.  ",
      "doi": "10.1145/1242572.1242576"
    }
  ]
}