{
  "doi": "10.1145/1357054.1357149",
  "title": "Interlaced QWERTY: accommodating ease of visual search and input flexibility in shape writing",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "593-596",
  "year": 2008,
  "badges": [],
  "abstract": "Shape writing is an input technology for touch-screen mobile phones and pen-tablets. To shape write text, the user spells out word patterns by sliding a finger or stylus over a graphical keyboard. The user's trace is then recognized by a pattern recognizer. In this paper we analyze and evaluate various keyboard layouts, including alphabetic, optimized (ATOMIK), QWERTY, and interlaced QWERTY for shape writing. The goodness of a layout for shape writing has two aspects. For users' initial ease of use the letters should be easy to visually locate. For long term use, however, the layout should maximize the imprecision tolerance and writing flexibility for all words. We present empirical studies for the former and mathematical analyses for the latter. Our results led to a new layout, interlaced QWERTY, which offers excellent separation of word shapes, while still maintaining a low visual search time. Many of the findings in our study also apply to traditional soft keyboards tapped with a stylus or one finger.",
  "authors": [
    {
      "name": "Shumin Zhai",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Getschow, C.O., Rosen, M.J. and Goodenough-Trepagnier, C., A systematic approach to design a minimum distance alphabetical keyboard. Proc. RESNA 1986, 396--398.",
      "doi": ""
    },
    {
      "text": "Kristensson, P.O. and Zhai, S., Learning Shape Writing by Game Playing. Ext. Abstr. CHI 2007, 1971--1976.  ",
      "doi": "10.1145/1240866.1240934"
    },
    {
      "text": "Kristensson, P.O. and Zhai, S., SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. Proc. UIST 2004, 43 -- 52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Lewis, J.R., LaLomia, M.J. and Kennedy, P.J., Evaluation of Typing Key Layouts for Stylus Input. Proc. HFES 1999,",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., Zhang, S.X. and Soukoreff, R.W. Text entry using soft keyboards. Behav. Inform. Technol., 18, (1999). 235--244.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. and Fisher, D. Why alphabetic keyboards are not easy to use: Keyboard layout doesn't much matter. Hum. Factors, 24, 5 (1982). 509--519.",
      "doi": ""
    },
    {
      "text": "Smith, B.A. and Zhai, S., Optimised Virtual Keyboards with and without Alphabetical Ordering - A Novice User Study. Proc. INTERACT 2001, 92--99.",
      "doi": ""
    },
    {
      "text": "Yamada, H. A historical study of typewriters and typing methods: from the position of planning Japanese parallels. J. Inform. Proc., 2, 4 (1980). 175--202.",
      "doi": ""
    },
    {
      "text": "Zhai, S., Hunter, M. and Smith, B.A. Performance optimization of virtual keyboards. Hum.-Comput. Interact. 17, 2,3 (2002). 89--129.",
      "doi": ""
    }
  ]
}