{
  "doi": "10.1145/1357054.1357168",
  "title": "Choice: abidcating or exercising?",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "715-724",
  "year": 2008,
  "badges": [],
  "abstract": "Many people today have access to enormous libraries of digital content. Increasingly these libraries contain personal content, consumed in support of people's non-instrumental needs. If current trends persist, these repositories will only increase. Having to choose from so much could be unpleasant especially in the absence of strong preferences. This raises some concerns for user experience (UX) design. Approaches for such interactions should not only be optimized for UX but must also support users' non-instrumental needs. People face this predicament during digital music listening and yet report positive experiences when listening in shuffle. Through an empirical study of digital music listening and close examination of people's listening practices and experiences, we argue that a shuffle-based approach--whereby people can abdicate choice to a random process while being able to modulate the randomness--not only mitigates the unpleasantness of choosing but also supports their non-instrumental needs while fostering desirable experiential outcomes.",
  "authors": [
    {
      "name": "Tuck Leong",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309491918",
      "orcid": "missing"
    },
    {
      "name": "Steve Howard",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100328802/rel-imgonly/steve.jpg",
      "acmid": "81100328802",
      "orcid": "missing"
    },
    {
      "name": "Frank Vetere",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    }
  ],
  "references": [
    {
      "text": "Alaszewski A, Using diaries for social research. Sage: London, 2006",
      "doi": ""
    },
    {
      "text": "Baeza-Yates R and Ribeiro-Neto B, Modern information retrieval. Addison-Wesley Harlow, England, 1999 ",
      "doi": "10.5555/553876"
    },
    {
      "text": "Bell G, Blythe M, and Sengers P. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Trans. Comput.-Hum. Interact. 2005; 12(2): 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Botti S. and Iyengar SS. The psychological pleasure and pain of choosing: when people prefer choosing at the cost of subsequent outcome satisfaction. Journal of Personality and Social Psychology 2004; 87(3): 312--326.",
      "doi": ""
    },
    {
      "text": "Crawford L. Viktor Shklovskij: differance in defamiliarization. Comparative Literature 1984; 36(3): 209--219.",
      "doi": ""
    },
    {
      "text": "DeNora T. Music and emotion in real time, in: O'Hara K and Brown B (Eds). Consuming music together: Social and collaborative aspects of music consumption technologies. Springer: Dordrecht, Netherlands. 2006. 19--33.",
      "doi": ""
    },
    {
      "text": "Fishburn P. Decision theory: the next 100 years? The Economic Journal 1991; 101(404): 27--32.",
      "doi": ""
    },
    {
      "text": "Gaver W, Beaver J, and Benford S. Ambiguity as a resource for design. Proc SIGCHI Human factors in computing systems. ACM Press. 2003. 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Hassenzahl M. The Thing and I: Understanding the relationship between user and product, in: Blythe MA, et al. (Eds). Funology: From Usability to Enjoyment. Kluwer Academic Publishers: Dordrecht, Netherlands. 2003. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "Hassenzahl M and Tractinsky N. User experience -- a research agenda. Behaviour and Information Technology 2006; 25(2): 91--97.",
      "doi": ""
    },
    {
      "text": "IDEO. Tech Box for IDEO 2006, 1st September http://www.ideo.com/portfolio/re.asp?x=50035",
      "doi": ""
    },
    {
      "text": "Lee JH and Downie JS. Survey of music information needs, uses, and seeking behaviours: preliminary findings. 5th Int Conf Music Information Retrieval 2004.",
      "doi": ""
    },
    {
      "text": "Leong TW, Vetere F, and Howard S. The serendipity shuffle. Proc 19th CHISIG (OZCHI) of Australia 2005; 1--4. ",
      "doi": "10.5555/1108368.1108428"
    },
    {
      "text": "Leong TW, Vetere F, and Howard S. Randomness as a resource for design. Proc 6th DIS 2006, ACM Press; 132--139.  ",
      "doi": "10.1145/1142405.1142428"
    },
    {
      "text": "Lieberman H. Autonomous interface agents. Proc SIGCHI Human factors in computing systems. ACM Press. 1997. 67--74.  ",
      "doi": "10.1145/258549.258592"
    },
    {
      "text": "McCarthy J and Wright P, Technology as experience. MIT Press: Cambridge, 2004 ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "McCarthy J, et al. The experience of enchantment in human-computer interaction. Pers Ubiquit Comput 2006; 10(369--378).  ",
      "doi": "10.1007/s00779-005-0055-2"
    },
    {
      "text": "Merton RK and Barber E, The travels and adventures of serendipity. Princeton University Press: Princeton, NJ, 2004.",
      "doi": ""
    },
    {
      "text": "Neuman WL, Social research methods -- qualitative and quantitative approaches. 5 ed. Allyn and Bacon: Boston, 2003",
      "doi": ""
    },
    {
      "text": "Schwartz B, The paradox of choice: why more is less. ECCO: New York, 2004.",
      "doi": ""
    },
    {
      "text": "Shklovsky V. Art as technique, in: Davis RC (Ed). Contemporary literary criticism. Modernism through poststructuralism. Longman: New York. 1917.",
      "doi": ""
    },
    {
      "text": "Strauss A, Qualitative analysis for social scientists. Cambridge University Press: New York, 1987.",
      "doi": ""
    },
    {
      "text": "Van Dijck J. From shoebox to performative agent: the computer as a personal memory machine. New media &amp; Society 2005; 7(3): 311--322.",
      "doi": ""
    },
    {
      "text": "Van Dijck J, Mediated memories in the digital age. Stanford University Press: California, 2007.",
      "doi": ""
    },
    {
      "text": "Vignoli F. Digital music interaction concepts: a user study. 5th Int Conf Music Information Retrieval 2004.",
      "doi": ""
    },
    {
      "text": "Warde A. Consumption and theories of practice. Journal of Consumer Culture 2005; 5(2): 131--153.",
      "doi": ""
    }
  ]
}