{
  "doi": "10.1145/1357054.1357123",
  "title": "The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "423-432",
  "year": 2008,
  "badges": [],
  "abstract": "The advent of novel materials (such as conductive fibers) combined with accessible embedded computing platforms have made it possible to re-imagine the landscapes of fabric and electronic crafts--extending these landscapes with the creative range of electronic/computational textiles or e-textiles. This paper describes the LilyPad Arduino, a fabric-based construction kit that enables novices to design and build their own soft wearables and other textile artifacts. The kit consists of a microcontroller and an assortment of sensors and actuators in stitch-able packages; these elements can be sewn to cloth substrates and each other with conductive thread to build e-textiles. This paper will introduce the latest version of the kit; reflect on its affordances; present the results of our most recent user studies; and discuss possible directions for future work in the area of personalized e-textile design and its relation to technology education.",
  "authors": [
    {
      "name": "Leah Buechley",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81309510031/rel-imgonly/leahb_2.jpg",
      "acmid": "81309510031",
      "orcid": "0000-0003-2661-2761"
    },
    {
      "name": "Mike Eisenberg",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322492935",
      "orcid": "missing"
    },
    {
      "name": "Jaime Catchen",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583733",
      "orcid": "missing"
    },
    {
      "name": "Ali Crockett",
      "institution": "University of Colorado at Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585636",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arduino. Available: www.arduino.cc.",
      "doi": ""
    },
    {
      "text": "Berzowska, J. Electronic textiles: Wearable computers, reactive fashion, and soft computation. Textile, 3(1):2--19, 2005.",
      "doi": ""
    },
    {
      "text": "Buechley, L. A construction kit for electronic textiles. In Proceedings of ISWC, pp 83--90, 2006.",
      "doi": ""
    },
    {
      "text": "Buechley, L. and Eisenberg, M. Fabric PCBs, electronic sequins, and socket buttons: Techniques for e-textile craft. Personal and Ubiquitous Computing, 2007 (available online, print version pending).  ",
      "doi": "10.1007/s00779-007-0181-0"
    },
    {
      "text": "Buechley, L., Eisenberg, M. and Elumeze, N. Towards a curriculum for electronic textiles in the high-school classroom. In Proceedings of ITiCSE, pp 28--32, 2007.  ",
      "doi": "10.1145/1268784.1268795"
    },
    {
      "text": "Csikszentmihalyi, M., Rathunde, K., and Whalen, S. Talented Teenagers. Cambridge University Press, 1993.",
      "doi": ""
    },
    {
      "text": "Davis, F. Fashion, Culture, and Identity. University of Chicago Press, 1992.",
      "doi": ""
    },
    {
      "text": "Galluzzi, P. The Art of Invention: Leonardo and the Renaissance Engineers. Giunti, Italy, 1999.",
      "doi": ""
    },
    {
      "text": "Hartmann, B. et al. Reflective physical prototyping through integrated design, test, and analysis. In Proceedings of UIST, pp 299--308, 2006.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Igoe, T. Making Things Talk. O'Reilly, 2007. ",
      "doi": "10.5555/1406583"
    },
    {
      "text": "Margolis, J. and Fisher, A. Unlocking the Clubhouse. MIT Press, 2001.",
      "doi": ""
    },
    {
      "text": "National Center for Women and Information Technology. Statistics about Women and IT. Available: www.ncwit.org/what. publication.html.",
      "doi": ""
    },
    {
      "text": "Papert, S. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc., New York, NY, USA, 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Post, R. et al. E-broidery: design and fabrication of textile-based computing. IBM Systems Journal, 39(3-4):840--860, 2000.  ",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Resnick, M. Computer as paintbrush: Technology, play, and the creative society. In D. Singer, R. Golikoff, and K Hirsh-Pasek, editors, Play = Learning: How play motivates and enhances children's cognitive and social-emotional growth. Oxford University Press, 2006.",
      "doi": ""
    },
    {
      "text": "Resnick, M., Bruckman, A., and Martin, F. Pianos not stereos: creating computational construction kits. Interactions, 3(5):40--50, 1996.  ",
      "doi": "10.1145/234757.234762"
    },
    {
      "text": "Rich, L., Perry, H. and Guzdial, M. A CS1 course designed to address the interests of women. In Proceedings of SIGCSE, pp 190--194, 2004.  ",
      "doi": "10.1145/971300.971370"
    },
    {
      "text": "Tai, R. et al. Planning early for careers in science. Science, 312:1143--1144, May 2007.",
      "doi": ""
    },
    {
      "text": "University of Colorado, office of planning, budget and analysis. College of Engineering statistics. Available: http://www.colorado.edu/pba/div/femalebycol.htm.",
      "doi": ""
    }
  ]
}