{
  "doi": "10.1145/1357054.1357160",
  "title": "Investigating statistical machine learning as a tool for software development",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "667-676",
  "year": 2008,
  "badges": [],
  "abstract": "As statistical machine learning algorithms and techniques continue to mature, many researchers and developers see statistical machine learning not only as a topic of expert study, but also as a tool for software development. Extensive prior work has studied software development, but little prior work has studied software developers applying statistical machine learning. This paper presents interviews of eleven researchers experienced in applying statistical machine learning algorithms and techniques to human-computer interaction problems, as well as a study of ten participants working during a five-hour study to apply statistical machine learning algorithms and techniques to a realistic problem. We distill three related categories of difficulties that arise in applying statistical machine learning as a tool for software development: (1) difficulty pursuing statistical machine learning as an iterative and exploratory process, (2) difficulty understanding relationships between data and the behavior of statistical machine learning algorithms, and (3) difficulty evaluating the performance of statistical machine learning algorithms and techniques in the context of applications. This paper provides important new insight into these difficulties and the need for development tools that better support the application of statistical machine learning.",
  "tags": [
    "statistical machine learning",
    "software development"
  ],
  "authors": [
    {
      "name": "Kayur Patel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350576909",
      "orcid": "missing"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142271",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    },
    {
      "name": "Beverly Harrison",
      "institution": "Intel Research Seattle, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010116",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1. Card, S.K., Mackinlay, J.D., Shneiderman. B. Information Visualization, 1999. Morgan--Kaufmann.",
      "doi": ""
    },
    {
      "text": "Chen, M.Y., Kiciman, E., Fratkin, E., Fox, A., and Brewer, E. Pinpoint: Problem Determination in Large, Dynamic Internet Services. International Conference on Dependable Systems and Networks (ICDSN 2002), 595--604. ",
      "doi": "10.5555/647883.738238"
    },
    {
      "text": "Cross, N. Descriptive Models of Creative Design. Design Studies, 18(4) (1997), 427--440.",
      "doi": ""
    },
    {
      "text": "Fails, J.A. and Olsen, D. A Design Tool for Camera-Based Interaction. ACM Conference on Human Factors in Computing Systems (CHI 2003), 449--456.  ",
      "doi": "10.1145/642611.642690"
    },
    {
      "text": "Fails, J.A. and Olsen, D. Interactive Machine Learning. International Conference on Intelligent User Interfaces (IUI 2003), 39--45.  ",
      "doi": "10.1145/604045.604056"
    },
    {
      "text": "Fogarty, J. and Hudson, S.E. Toolkit Support for Developing and Deploying Sensor--Based Statistical Models of Human Situations. ACM Conference on Human Factors in Computing Systems (CHI 2007), 135--144.  ",
      "doi": "10.1145/1240624.1240645"
    },
    {
      "text": "Fogarty, J., Ko, A.J., Aung, H.H., Golden, E., Tang, K.P., and Hudson, S.E. Examining Task Engagement in Sensor-Based Statistical Models of Human Interruptibility. ACM Conference on Human Factors in Computing Systems (CHI 2005), 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "Hand, D. Data Mining: Statistics and More? The American Statistician, 52(2) (1998), 112--118.",
      "doi": ""
    },
    {
      "text": "Hartmann, B., Abdulla, L., Mittal, M., and Klemmer, S.R. Authoring Sensor Based Interactions Through Direct Manipulation and Pattern Matching. ACM Conference on Human Factors in Computing Systems (CHI 2007), 145--154.  ",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Hastie, T., Tibshirani, R., and Friedman, J.H. The Elements of Statistical Learning, (2001). Springer.",
      "doi": ""
    },
    {
      "text": "Hoffmann, R., Fogarty, J., and Weld, D.S. Assieme: Finding and Leveraging Implicit References in a Web Search Interface for Programmers. ACM Symposium on User Interface Software and Technology (UIST 2007), 13--22.  ",
      "doi": "10.1145/1294211.1294216"
    },
    {
      "text": "Horvitz, E. and Apacible, J. Learning and Reasoning About Interruption. International Conference on Multimodal Interfaces (ICMI 2003), 20--27.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Huynh, D.F., Miller, R.C., and Karger, D.R. Enabling Web Browsers to Augment Web Sites' Filtering and Sorting Functionalities. ACM Symposium on User Interface Software and Technology (UIST 2006), 125--134.  ",
      "doi": "10.1145/1166253.1166274"
    },
    {
      "text": "Kim, M., Bergman, L., Lau, T., and Notkin, D. An Ethnographic Study of Copy and Paste Programming Practices in OOPL. International Conference on Software Engineering (ICSE 2004), 83--92.  ",
      "doi": "10.5555/1018434.1021568"
    },
    {
      "text": "Ko, A.J., Aung, H., and Myers, B.A. Eliciting Design Requirements for Maintenance--Oriented Ides: a Detailed Study of Corrective and Perfective Maintenance Tasks. International Conference on Software Engineering (ICSE 2005), 126--135.  ",
      "doi": "10.1145/1062455.1062492"
    },
    {
      "text": "Ko, A.J., Myers, B.A., and Aung, H.H. Six Learning Barriers in End-User Programming Systems. Symposium on Visual Languages and Human Centric Computing (VLHCC 2004), 199--206.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "LaMarca, A., Chawathe, Y., Consolvo, S., Hightower, J., Smith, I.E., Scott, J., Sohn, T., Howard, J., Hughes, J., Potter, F., Tabert, J., Powledge, P., Borriello, G., and Schilit, B.N. Place Lab: Device Positioning Using Radio Beacons in the Wild. International Conference on Pervasive Computing (PERVASIVE 2005), 116--133.  ",
      "doi": "10.1007/11428572_8"
    },
    {
      "text": "LaToza, T.D., Venolia, G., and DeLine, R. Maintaining Mental Models: A Study of Developer Work Habits. International Conference on Software Engineering (ICSE 2005), 492--501.  ",
      "doi": "10.1145/1134285.1134355"
    },
    {
      "text": "Lester, J., Choudhury, T., Kern, N., Borriello, G., and Hannaford, B. A Hybrid Discriminative/Generative Approach for Modeling Human Activities. International Joint Conference on Artificial Intelligence (IJCAI 2005), 766--772. ",
      "doi": "10.5555/1642293.1642416"
    },
    {
      "text": "Maynes-Aminzade, D., Winograd, T., and Igarashi, T. Eyepatch: Prototyping Camera-Based Interaction Through Examples. ACM Symposium on User Interface Software and Technology (UIST 2007), 33--42.  ",
      "doi": "10.1145/1294211.1294219"
    },
    {
      "text": "Myers, B., Hudson, S. E., and Pausch, R. 2000. Past, Present, and Future of User Interface Software Tools. ACM Transactions on Computer-Human Interaction, 7(1) (2000), 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Mierswa, I., Wurst, M., Klinkenberg, R., Scholz, M., and Euler, T. Yale: Rapid Prototyping for Complex Data Mining Tasks. International Conference on Knowledge Discovery and Data Mining (KDD 2006), 935--940.  ",
      "doi": "10.1145/1150402.1150531"
    },
    {
      "text": "Mitchell, T.M. Machine Learning, (1997). McGraw-Hill. ",
      "doi": "10.5555/541177"
    },
    {
      "text": "Robillard, M.P. and Coelho, W. How Effective Developers Investigate Source Code: An Exploratory Study. IEEE Transactions on Software Engineering, 30(12) (2004), 889--903.  ",
      "doi": "10.1109/TSE.2004.101"
    },
    {
      "text": "Rosson, M.B. and Carroll, J.M. The Reuse of Uses in Smalltalk Programming. ACM Transactions on Computer-Human Interaction, 3(3) (1996), 219--253.  ",
      "doi": "10.1145/234526.234530"
    },
    {
      "text": "Smith, R.P. and Tjandra, P. Experimental Observation of Iteration in Engineering Design. Journal of Research in Engineering Design, 10(2) (1998), 107--117.",
      "doi": ""
    },
    {
      "text": "Witten, I.H. and Frank, E. Data Mining: Practical Machine Learning Tools and Techniques with Java Implementations, (2005). Morgan Kaufmann. ",
      "doi": "10.5555/1205860"
    },
    {
      "text": "Zheng, A.X., Jordan, M.I., Liblit, B., Naik, M., and Aiken, A. Statistical Debugging: Simultaneous Identification of Multiple Bugs. International Conference on Machine Learning (ICML 2006), 1105--1112.  ",
      "doi": "10.1145/1143844.1143983"
    }
  ]
}