{
  "doi": "10.1145/1357054.1357080",
  "title": "Explore! possibilities and challenges of mobile learning",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "145-154",
  "year": 2008,
  "badges": [],
  "abstract": "This paper reports the experimental studies we have performed to evaluate Explore!, an m-learning system that supports middle school students during a visit to an archaeological park. It exploits a learning technique called excursion-game, whose aim is to help students to acquire historical notions while playing and to make archaeological visits more effective and exciting. In order to understand the potentials and limitations of Explore!, our studies compare the experience of playing the excursion-game with and without technological support. The design and evaluation of Explore! have provided knowledge on the advantages and pitfalls of m-learning that may be instrumental in informing the current debate on e-learning.",
  "tags": [
    "digital augmentation",
    "mobile learning",
    "cooperative inquiry",
    "edutainment",
    "children"
  ],
  "authors": [
    {
      "name": "Maria F. Costabile",
      "institution": "Università di Bari, Bari, Italy",
      "img": "/do/10.1145/contrib-81100096224/rel-imgonly/francescah200.jpg",
      "acmid": "81100096224",
      "orcid": "missing"
    },
    {
      "name": "Antonella De Angeli",
      "institution": "The University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647415",
      "orcid": "missing"
    },
    {
      "name": "Rosa Lanzilotti",
      "institution": "Università di Bari, Bari, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592341",
      "orcid": "missing"
    },
    {
      "name": "Carmelo Ardito",
      "institution": "Università di Bari, Bari, Italy",
      "img": "/do/10.1145/contrib-81314481061/rel-imgonly/carmelo.jpg",
      "acmid": "81314481061",
      "orcid": "missing"
    },
    {
      "name": "Paolo Buono",
      "institution": "Università di Bari, Bari, Italy",
      "img": "/do/10.1145/contrib-81100302537/rel-imgonly/paolo.jpg",
      "acmid": "81100302537",
      "orcid": "missing"
    },
    {
      "name": "Thomas Pederson",
      "institution": "Umeå University, Umeå, Sweden",
      "img": "/do/10.1145/contrib-81100431226/rel-imgonly/pedersonitu_nov2013_smaller.jpg",
      "acmid": "81100431226",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrahamson, A., et al. What's a situation in situated cognition?: a constructionist critique of authentic inquiry. Proc. ICLS 2006, ACM Press (2006), 1015--1021. ",
      "doi": "10.5555/1150034.1150226"
    },
    {
      "text": "Ardito, C., Buono, P., Costabile, M.F., Lanzilotti, R., Pederson, T. Making dead history come alive through mobile game-play. Ext. Abstracts CHI '07, ACM Press (2007), 2249--2254.  ",
      "doi": "10.1145/1240866.1240989"
    },
    {
      "text": "Ardito, C., Buono, P., Costabile, M.F., Lanzilotti, R., Pederson, T. An augmented reality game on standard mobile phones for exploring history at archaeological parks. Meersman R. et al. (Eds.), LNCS 4805, Berlin: Springer (2007), 357--366. ",
      "doi": "10.5555/1780909.1780977"
    },
    {
      "text": "Bernhaupt, R., et al. (Eds). Proc. of workshop \"Methods for evaluating games-How to measure usability and user experience in games\", at ACE 2007.  ",
      "doi": "10.1145/1255047.1255142"
    },
    {
      "text": "Berri, J., Benlamri, R., Atif, Y. Ontology-based framework for context-aware mobile learning. Proc. IWCMC 2006, ACM Press (2006), 1307--1310.  ",
      "doi": "10.1145/1143549.1143811"
    },
    {
      "text": "Brown, R. et al. D. Mobile helper for university students: a design for a mobile learning environment. Proc. OZCHI 2006, ACM Press (2006), 297--300.  ",
      "doi": "10.1145/1228175.1228227"
    },
    {
      "text": "Cecalupo, M., Chirantoni, E. Una giornata di Gaio, in Clio al lavoro. Technical report, Didattica della Storia, Università degli Studi di Bari, (1994), 46--57.",
      "doi": ""
    },
    {
      "text": "Ciancio, E., Iacobone C. Nella città senza nome. Come esplorare l'area archeologica di Monte Sannace, Laterza, Bari, 2000.",
      "doi": ""
    },
    {
      "text": "Conati, C., and Zhao, X. Building and evaluating an intelligent pedagogical agent to improve the effectiveness of an educational game. Proc. IUI 2004, ACM Press (2004), 6--13.  ",
      "doi": "10.1145/964442.964446"
    },
    {
      "text": "Druin, A. (Ed.). The design of children's technology. Morgan Kaufman, San Francisco, CA, 1999. ",
      "doi": "10.5555/303430"
    },
    {
      "text": "Garzotto, F. Investigating the educational Effectiveness of multiplayer online games for children. Proc. IDC 2007, ACM Press (2007).  ",
      "doi": "10.1145/1297277.1297284"
    },
    {
      "text": "Hassenzahl, M., Tractinsky, N. User experience - a research agenda. Behaviour &amp; Information Technology, 25, 2 (Mar-Apr 2006), 91--97.",
      "doi": ""
    },
    {
      "text": "Hollan, J. D., Hutchins, E. and Kirsh, D. Distributed cognition: toward a new foundation for human-computer interaction research. ACM Transactions on Computer-Human Interaction, 7, 2 (1999), 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Holzinger, A., et al. Lifelong-learning support by m-learning: Example scenarios. eLearn, 11 (2005), 2.  ",
      "doi": "10.1145/1125280.1125284"
    },
    {
      "text": "Kardan, K. Computer role-playing games as a vehicle for teaching history, culture, and language. Proc. Sandbox- Symposium on Videogames, ACM Press (2006), 91--93.  ",
      "doi": "10.1145/1183316.1183328"
    },
    {
      "text": "Klopfer, E., et al. Mystery at the museum: a collaborative game for museum education. Proc. CSCL 2005, ACM Press (2005), 316--320. ",
      "doi": "10.5555/1149293.1149334"
    },
    {
      "text": "Kristensson, P.O., Zhai, S. Learning shape writing by game playing. Ext. Abstracts CHI '07, ACM Press (2007), 1971--1976.  ",
      "doi": "10.1145/1240866.1240934"
    },
    {
      "text": "Lanzilotti, R., and Roselli, T. An experimental evaluation of Logiocando, an intelligent tutoring hypermedia system. Inter. J. of Artificial Intelligence in Education, 17, 1 (2007), 41--56. ",
      "doi": "10.5555/1435364.1435367"
    },
    {
      "text": "Lieberman, H., Paternò, F. and Wulf, V. (Eds). End User Development. Springer, Dordrecht, The Netherlands, 2006.",
      "doi": ""
    },
    {
      "text": "Pan, Z. E-learning and game. Computers &amp; Graphics, 30, (2006), 1--2.",
      "doi": "10.1016/j.cag.2005.10.002"
    },
    {
      "text": "Pellerey, M., Questionario sulle Strategie d'Apprendimento (QSA), LAS, Roma, 1996.",
      "doi": ""
    },
    {
      "text": "Quintana, C., et al. Learner-centered design: reflections and new directions. Human-Computer Interaction in the New Millennium. Carroll (Ed.), ACM Press (2001), 605--626.",
      "doi": ""
    },
    {
      "text": "Rapeepisarn, K., et al. Similarities and differences between \"learn through play\" and \"edutainment\". Proc. IE 2006, ACM Press (2006), 28--32. ",
      "doi": "10.5555/1231894.1231899"
    },
    {
      "text": "Raybourn, E.M., Waern, A. Social learning through gaming. Proc. CHI '04, ACM Press (2004), 1733--1734.  ",
      "doi": "10.1145/985921.986206"
    },
    {
      "text": "Rogers, Y., et al. Ubi-learning Integrates indoor and outdoor experiences. Communications of the ACM, 48, 1 (2005), 55--59.  ",
      "doi": "10.1145/1039539.1039570"
    },
    {
      "text": "Schrier, K. Using augmented reality games to teach 21st century skills. Proc. SIGGRAPH 2006, 2006.  ",
      "doi": "10.1145/1179295.1179311"
    }
  ]
}