{
  "doi": "10.1145/1357054.1357250",
  "title": "Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1257-1266",
  "year": 2008,
  "badges": [],
  "abstract": "We evaluate two systems for automatically generating personalized interfaces adapted to the individual motor capabilities of users with motor impairments. The first system, SUPPLE, adapts to users' capabilities indirectly by first using the ARNAULD preference elicitation engine to model a user's preferences regarding how he or she likes the interfaces to be created. The second system, SUPPLE++, models a user's motor abilities directly from a set of one-time motor performance tests. In a study comparing these approaches to baseline interfaces, participants with motor impairments were 26.4% faster using ability-based user interfaces generated by SUPPLE++. They also made 73% fewer errors, strongly preferred those interfaces to the manufacturers' defaults, and found them more efficient, easier to use, and much less physically tiring. These findings indicate that rather than requiring some users with motor impairments to adapt themselves to software using separate assistive technologies, software can now adapt itself to the capabilities of its users.",
  "authors": [
    {
      "name": "Krzysztof Z. Gajos",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    },
    {
      "name": "Daniel S. Weld",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659376950",
      "orcid": "0000-0002-3255-0109"
    }
  ],
  "references": [
    {
      "text": "Akamatsu, M., MacKenzie, I. S., and Hasbroucq, T. A comparison of tactile, auditory, and visual feedback in a pointing task using a mouse-type device. Ergonomics, 38, 4 (1995), 816--827.",
      "doi": ""
    },
    {
      "text": "Bergman, E. and Johnson, E. Towards Accessible Human-Computer Interaction. Advances in Human-Computer Interaction, 5, 1. ",
      "doi": "10.5555/213617.213622"
    },
    {
      "text": "Bigham, J. P., Kaminsky, R. S., Ladner, R. E., Danielsson, O. M., and Hempton, G. L. Webinsight:: making web images accessible. Proc. Assets '06. ACM Press, New York, NY, USA, 2006, 181--188.  ",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Carter, S., Hurst, A., Mankoff, J., and Li, J. Dynamically adapting GUIs to diverse input devices. Proc. Assets '06. ACM Press, New York, NY, USA, 2006, 63--70.  ",
      "doi": "10.1145/1168987.1169000"
    },
    {
      "text": "Dawe, M. Desperately seeking simplicity: how young adults with cognitive disabilities and their families adopt assistive technologies. Proc. CHI'06. (2006), 1143--1152.  ",
      "doi": "10.1145/1124772.1124943"
    },
    {
      "text": "Fichten, C., Barile, M., Asuncion, J., and Fossey, M. What government, agencies, and organizations can do to improve access to computers for postsecondary students with disabilities: recommendations based on Canadian empirical data. Int J Rehabil Res, 23, 3 (2000), 191--9.",
      "doi": ""
    },
    {
      "text": "Gajos, K., Christianson, D., Hoffmann, R., Shaked, T., Henning, K., Long, J. J., and Weld, D. S. Fast and robust interface generation for ubiquitous applications. Proc. Ubicomp'05. Tokyo, Japan, 2005.  ",
      "doi": "10.1007/11551201_3"
    },
    {
      "text": "Gajos, K. and Weld, D. S. Supple: automatically generating user interfaces. Proc. IUI'04. ACM Press, New York, NY, 2004, 93--100.  ",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Gajos, K. and Weld, D. S. Preference elicitation for interface optimization. Proc. UIST '05. ACM Press, New York, NY, 2005.  ",
      "doi": "10.1145/1095034.1095063"
    },
    {
      "text": "Gajos, K. Z., Wobbrock, J. O., and Weld, D. S. Automatically generating user interfaces adapted to users' motor and vision capabilities. Proc. UIST'07. ACM Press, New York, NY, 2007.  ",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Harada, S., Wobbrock, J. O., and Landay, J. A. Voicedraw: A voice-driven hands-free drawing application. Proc. ASSETS'07. ACM Press, 2007.  ",
      "doi": "10.1145/1296843.1296850"
    },
    {
      "text": "Hornof, A., Cavender, A., and Hoselton, R. Eyedraw: a system for drawing pictures with eye movements. Proc. ASSETS'04. ACM Press, New York, NY, 2004, 86--93.  ",
      "doi": "10.1145/1028630.1028647"
    },
    {
      "text": "Hwang, F., Keates, S., Langdon, P., and Clarkson, J. Mouse movements of motion-impaired users: a submovement analysis. Proc. Assets '04. ACM Press, New York, NY, USA, 2004, 102--109.  ",
      "doi": "10.1145/1028630.1028649"
    },
    {
      "text": "International Organization for Standardization. 9241-9 Ergonomic requirements for office work with visual display terminals (VDTs)-Part 9: Requirements for non-keyboard input devices (2000).",
      "doi": ""
    },
    {
      "text": "Keates, S., Langdon, P., Clarkson, J. P., and Robinson, P. User models and user physical capability. User Modeling and User-Adapted Interaction, 12, 2 (2002), 139--169.  ",
      "doi": "10.1023/A%3A1015047002796"
    },
    {
      "text": "Koester, H. Abandonment of speech recognition by new users. Proc. RESNA03. Atlanta, Georgia, 2003.",
      "doi": ""
    },
    {
      "text": "Law, C., Sears, A., and Price, K. Issues in the categorization of disabilities for user testing. Proc. HCII'05. 2005.",
      "doi": ""
    },
    {
      "text": "Littell, R., MIlliken, G., Stroup, W., and Wolfinger, R. SAS System for Mixed Models. SAS Institute, Inc., Cary, NC, 1996.",
      "doi": ""
    },
    {
      "text": "Mankoff, J., Dey, A., Batra, U., and Moore, M. Web accessibility for low bandwidth input. Proc. Assets '02. ACM Press, New York, NY, USA, 2002, 17--24.  ",
      "doi": "10.1145/638249.638255"
    },
    {
      "text": "Nichols, J., Myers, B. A., Higgins, M., Hughes, J., Harris, T. K., Rosenfeld, R., and Pignol, M. Generating remote control interfaces for complex appliances. Proc. UIST'02. Paris, France, 2002.  ",
      "doi": "10.1145/571985.572008"
    },
    {
      "text": "Phillips, B. and Zhao, H. Predictors of assistive technology abandonment. Assist Technol, 5, 1 (1993), 36--45.",
      "doi": ""
    },
    {
      "text": "Savidis, A. Dynamic software assembly for automatic deployment-oriented adaptation. Electronic Notes in Theoretical Computer Science, 127, 3 (2005), 207--217.",
      "doi": "10.1016/j.entcs.2004.08.045"
    },
    {
      "text": "Savidis, A., Antona, M., and Stephanidis, C. A decision-making specification language for verifiable user-interface adaptation logic. International Journal of Software Engineering And Knowledge Engineering, 15, 6 (2005), 1063 -- 1094.",
      "doi": ""
    },
    {
      "text": "Savidis, A. and Stephanidis, C. Inclusive development: Software engineering requirements for universally accessible interactions. Interacting with Computers, 18, 1 (2006), 71--116.  ",
      "doi": "10.1016/j.intcom.2005.06.005"
    },
    {
      "text": "Schuster, C. and Von Eye, A. The relationship of anova models with random effects and repeated measurement designs. Journal of Adolescent Research, 16, 2 (2001), 205--220.",
      "doi": ""
    },
    {
      "text": "Stephanidis, C. User interfaces for all: New perspectives into human-computer interaction. In C. Stephanidis, ed., User Interfaces for All, Lawrence Erlbaum, 2001. 3--17.",
      "doi": ""
    },
    {
      "text": "Vermunt, J. K. Log-linear Models for Event Histories. Sage Publications, 1997.",
      "doi": ""
    },
    {
      "text": "Wilcoxon, F. Individual comparisons by ranking methods. Biometrics Bulletin, 1, 6 (1945), 80--83.",
      "doi": ""
    },
    {
      "text": "Winship, C. and Mare, R. D. Regression models with ordinal variables. American Sociological Review, 49, 4 (1984), 512--525.",
      "doi": ""
    }
  ]
}