{
  "doi": "10.1145/1357054.1357164",
  "title": "CareLog: a selective archiving tool for behavior management in schools",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "685-694",
  "year": 2008,
  "badges": [],
  "abstract": "Identifying the function of problem behavior can lead to the development of more effective interventions. One way to identify the function is through functional behavior assessment (FBA). Teachers conduct FBA in schools. However, the task load of recording the data manually is high, and the challenge of accurately identifying antecedents and consequences is significant while interacting with students. These issues often result in imperfect information capture. CareLog allows teachers more easily to conduct FBAs and enhances the capture of relevant information. In this paper, we describe the design process that led to five design principles that governed the development of CareLog. We present results from a five-month, quasi-controlled study aimed at validating those design principles. We reflect on how various constraints imposed by special education settings impact the design and evaluation process for HCI practitioners and researchers.",
  "authors": [
    {
      "name": "Gillian R. Hayes",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592620",
      "orcid": "0000-0003-0966-8739"
    },
    {
      "name": "Lamar M. Gardere",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435603007",
      "orcid": "missing"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    },
    {
      "name": "Khai N. Truong",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "Education Development Center: Supporting Children with Challenging Behaviors: Relationships Are Key. Training Guides for the Head Start Learning Community. Administration for Children, Youth, and Families (DHHS). (1997), 120.",
      "doi": ""
    },
    {
      "text": "Abowd, G.D. and Mynatt, E.D. Charting past, present and future research in ubiquitous computing. Transactions on Computer-Human Interaction (TOCHI), (2000) 7(1): 29--58.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Brophy, J. (Ed.) (2004). Advances in research on teaching: Vol. 10. Using video in teacher education. Oxford, UK: Elsevier.",
      "doi": ""
    },
    {
      "text": "Clarke, D., &amp; Hollingsworth, H. (2000). Seeing is understanding. Journal of Staff Development, 21(4), 40--43.",
      "doi": ""
    },
    {
      "text": "Hart, S.G. and L.E. Staveland, Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research, in Human Mental Workload, P.A. Hancock and N. Mashkati, Eds. Elsevier (1988) 139--183.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R. Documenting and Understanding Everyday Activities through the Selective Archiving of Live Experiences. PhD Thesis. Georgia Tech (2007). ",
      "doi": "10.5555/1354450"
    },
    {
      "text": "Hayes, G.R. and Abowd, G.D. Tensions in Designing Capture Technologies for an Evidence-Based Care Community, in Proc. CHI 2006, ACM Press (2006) 937--946.  ",
      "doi": "10.1145/1124772.1124911"
    },
    {
      "text": "Hayes, G.R. et al., Designing Capture Applications to Support the Education of Children with Autism, in Proc. Ubicomp 2004, Springer-Verlag (2004).",
      "doi": ""
    },
    {
      "text": "Hayes, G.R., et al., Experience buffers: a socially appropriate, selective archiving tool for evidence-based care, in CHI '05 Extended Abstracts, ACM Press (2005), 1435 -- 1438.  ",
      "doi": "10.1145/1056808.1056935"
    },
    {
      "text": "Horner, R.H. and Carr, E.G. Behavioral Support for Students with Severe Disabilities: Functional Assessment and Comprehensive Intervention. Journal of Special Education (1997). 31(1): 84--104.",
      "doi": ""
    },
    {
      "text": "Iwata, B.A. et al., Toward a functional analysis of self injury. Analysis and Intervention in Developmental Disabilities (1982).",
      "doi": ""
    },
    {
      "text": "Quinn, M. M., et al. (1998). Addressing student problem behavior: An IEP team's introduction to functional behavioral assessment and behavior intervention plans (2nd ed.). Washington, DC: Center for Effective Collaboration and Practice.",
      "doi": ""
    },
    {
      "text": "Sasso, G.M. et al., Use of descriptive and experimental analyses to identify the functional properties of aberrant behavior in school settings. Journal of Applied Behavior Analysis (1992) 25.",
      "doi": ""
    },
    {
      "text": "Su, N. et al., Augmenting Film and Video Footage with Sensor Data, in Proc. of PerCom '04. IEEE Press (2004), 3--12. ",
      "doi": "10.5555/977406.978697"
    },
    {
      "text": "Umbreit, J., Functional Assessment and Intervention in a Regular Classroom Setting for the Disruptive Behavior of a Student with Attention Deficit Hyperactivity Disorder. Behavioral Disorders, (1997) 20(4): 267--278.",
      "doi": ""
    }
  ]
}