{
  "doi": "10.1145/1357054.1357254",
  "title": "Indirect mappings of multi-touch input using one and two hands",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1275-1284",
  "year": 2008,
  "badges": [],
  "abstract": "Touchpad and touchscreen interaction using multiple fingers is emerging as a valuable form of high-degree-of-freedom input. While bimanual interaction has been extensively studied, touchpad interaction using multiple fingers of the same hand is not yet well understood. We describe two experiments on user perception and control of multi-touch interaction using one and two hands. The first experiment addresses how to maintain perceptual-motor compatibility in multi-touch interaction, while the second measures the separability of control of degrees-of-freedom in the hands and fingers. Results indicate that two-touch interaction using two hands is compatible with control of two points, while twotouch interaction using one hand is compatible with control of a position, orientation, and hand-span. A slight advantage is found for two hands in separating the control of two positions.",
  "authors": [
    {
      "name": "Tomer Moscovich",
      "institution": "University of Toronto, Toronto, ON, Canada and Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100624219",
      "orcid": "missing"
    },
    {
      "name": "John F. Hughes",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100166298",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albinsson, P.-A. and Zhai, S. High precision touch screen interaction. In Proceedings of CHI, pages 105--112, New York, NY, USA, 2003. ACM Press.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Balakrishnan, R. and Hinckley, K. Symmetric bimanual interaction. In Proceedings of CHI, pages 33--40, New York, NY, USA, 2000. ACM Press.  ",
      "doi": "10.1145/332040.332404"
    },
    {
      "text": "Benko, H., Wilson, A. D., and Baudisch, P. Precise selection techniques for multi-touch screens. In Proceedings of CHI, pages 1263--1272, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Buxton, W., Hill, R., and Rowley, P. Issues and techniques in touch-sensitive tablet input. In Proceedings of SIGGRAPH '85, pages 215--224, New York, NY, USA, 1985. ACM Press.  ",
      "doi": "10.1145/325334.325239"
    },
    {
      "text": "Cutler, L. D., Frolich, B., and Hanrahan, P. Two-handed direct manipulation on the responsive workbench. In SI3D '97, pages 107--ff. ACM Press, 1997.  ",
      "doi": "10.1145/253284.253315"
    },
    {
      "text": "Dietz, P. and Leigh, D. Diamondtouch: a multi-user touch technology. In Proceedings of UIST 2001, pages 219--226. ACM Press, 2001.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "FingerWorks. iGesture Pad.",
      "doi": ""
    },
    {
      "text": "Forlines, C. and Shen, C. Dtlens: multi-user tabletop spatial data exploration. In Proceedings of UIST, pages 119--122, New York, NY, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1095034.1095055"
    },
    {
      "text": "Forlines, C., Vogel, D., and Balakrishnan, R. Hybridpointing: Fluid switching between absolute and relative pointing with a direct input device. In UIST, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Gingold, Y., Davidson, P., Han, J., and Zorin, D. A direct texture placement and editing interface. In Proceedings of UIST, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1166253.1166259"
    },
    {
      "text": "Guiard, Y. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior, pages 485--517, 1987.",
      "doi": ""
    },
    {
      "text": "Hager-Ross, C. and Schieber, M. Quantifying the independence of human finger movements: Comparisons of digits, hands, and movement frequencies. Journal of Neuroscience, 20(22):8542--8550, 2000.",
      "doi": ""
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal reflection. In Proceedings of UIST, pages 115--118, New York, NY, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hinckley, K., Czerwinski, M., and Sinclair, M. Interaction and modeling techniques for desktop two-handed input. In Proceedings of UIST, pages 49--58, New York, NY, USA, 1998. ACM Press.  ",
      "doi": "10.1145/288392.288572"
    },
    {
      "text": "Holm, S. A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics, 6:65--70, 1979.",
      "doi": ""
    },
    {
      "text": "Igarashi, T., Moscovich, T., and Hughes, J. F. As-rigid-as-possible shape manipulation. ACM Trans. Graph., 24(3):1134--1141, 2005.  ",
      "doi": "10.1145/1073204.1073323"
    },
    {
      "text": "Jacob, R. J. K., Sibert, L. E., McFarlane, D. C., and M. Preston Mullen, J. Integrality and separability of input devices. ACM Trans. Comput.-Hum. Interact., 1(1):3--26, 1994.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Krueger, M. W., Gionfriddo, T., and Hinrichsen, K. Videoplace: An artificial reality. In Proceedings of CHI '85, pages 35--40, New York, NY, USA, 1985. ACM Press.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Baudel, T., and Buxton, B. The design of a GUI paradigm based on tablets, two-hands, and transparency. In Proceedings of CHI, pages 35--42. ACM Press, 1997.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Latulipe, C., Kaplan, C. S., and Clarke, C. L. A. Bimanual and unimanual image alignment: An evaluation of mouse-based techniques. In Proceedings of UIST '05, pages 123--131, New York, NY, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1095034.1095057"
    },
    {
      "text": "Latulipe, C., Mann, S., Kaplan, C. S., and Clarke, C. L. A. symspline: Symmetric two-handed spline manipulation. In Proceedings of CHI, pages 349--358, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1124772.1124825"
    },
    {
      "text": "Lee, S., Buxton, W., and Smith, K. C. A multi-touch three dimensional touch-sensitive tablet. In Proceedings of CHI '85, pages 21--25, New York, NY, USA, 1985. ACM Press.  ",
      "doi": "10.1145/317456.317461"
    },
    {
      "text": "Malik, S. An Exploration of Multi-finger Interaction on Multi-touch Surfaces. PhD thesis, University of Toronto, 2007. ",
      "doi": "10.5555/1467540"
    },
    {
      "text": "Malik, S. and Laszlo, J. Visual touchpad: A Toronto, 2007. ICMI '04, pages 289--296. ACM Press, 2004.  ",
      "doi": "10.1145/1027933.1027980"
    },
    {
      "text": "Malik, S., Ranjan, A., and Balakrishnan, R. Interacting with large displays from a distance with vision-tracked multi-finger gestural input. In Proceedings of UIST '05, pages 43--52. ACM Press, 2005.  ",
      "doi": "10.1145/1095034.1095042"
    },
    {
      "text": "Matsushita, N. and Rekimoto, J. Holowall: Designing a finger, hand, body, and object sensitive wall. In Proceedings of UIST '97, pages 209--210. ACM Press, 1997.  ",
      "doi": "10.1145/263407.263549"
    },
    {
      "text": "Morris, M. R., Huang, A., Paepcke, A., and Winograd, T. Cooperative gestures: Multi-user gestural interactions for co-located groupware. In Proceedings of CHI, pages 1201--1210, New York, NY, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Moscovich, T. and Hughes, J. F. Multi-finger cursor techniques. In GI '06: Proceedings of the 2006 conference on Graphics interface, pages 1--7, Quebec, Canada, 2006. ",
      "doi": "10.5555/1143079.1143081"
    },
    {
      "text": "Rekimoto, J. Smartskin: An infrastructure for freehand manipulation on interactive surfaces. In Proceedings of CHI 2002, pages 113--120. ACM Press, 2002.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Santello, M., Flanders, M., and Soechting, J. F. Postural hand synergies for tool use. The Journal of Neuroscience, 18:10105--10115, 1998.",
      "doi": ""
    },
    {
      "text": "Schieber, M. H. and Santello, M. Hand function: Peripheral and central constraints on performance. Journal of Applied Physiology, 6:2293--2300, 1996.",
      "doi": ""
    },
    {
      "text": "Tactiva Inc. TactaPad.",
      "doi": ""
    },
    {
      "text": "Ullmer, B. and Ishii, H. The metadesk: Models and prototypes for tangible user interfaces. In Proceedings of UIST '97, pages 223--232. ACM Press, 1997.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Vlack, K., Mizota, T., Kawakami, N., Kamiyama, K., Kajimoto, H., and Tachi, S. Gelforce: a vision-based traction field computer interface. In CHI '05 extended abstracts., pages 1154--1155, New York, NY, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1056808.1056859"
    },
    {
      "text": "Wang, Y., MacKenzie, C. L., Summers, V. A., and Booth, K. S. The structure of object transportation and orientation in human-computer interaction. In Proceedings of CHI, pages 312--319, New York, NY, USA, 1998. ACM Press.  ",
      "doi": "10.1145/274644.274688"
    },
    {
      "text": "Weigelt, C. and de Oliveira, S. C. Visuomotor transformations affect bimanual coupling. Experimental Brain Research, 148, 2003.",
      "doi": ""
    },
    {
      "text": "Wilson, A. D. Touchlight: An imaging touch screen and display for gesture-based interaction. International Conference on Multimodal Interfaces, 2004.  ",
      "doi": "10.1145/1027933.1027946"
    },
    {
      "text": "Wilson, A. D. Flowmouse: A computer vision-based pointing and gesture input device. In Interact '05, 2005.  ",
      "doi": "10.1007/11555261_46"
    },
    {
      "text": "Worringham, C. J. and Beringer, D. B. Directional stimulus-response compatibility: A test of three alternative principles. Ergonomics, 41(6):864--880, 1998.",
      "doi": ""
    },
    {
      "text": "Wu, M. and Balakrishnan, R. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. In ACM UIST, pages 193--202, 2003.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Wu, M., Shen, C., Ryall, K., Forlines, C., and Balakrishnan, R. Gesture registration, relaxation, and reuse for multi-point direct-touch surfaces. In First IEEE International Workshop on Horizontal Interactive Human-Computer Systems, TableTop 2006, 2006.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    },
    {
      "text": "Zhai, S. and Milgram, P. Quantifying coordination in multiple DOF movement and its application to evaluating 6 DOF input devices. In Proceedings of CHI, pages 320--327, New York, NY, USA, 1998. ACM Press.  ",
      "doi": "10.1145/274644.274689"
    }
  ]
}