{
  "doi": "10.1145/1357054.1357212",
  "title": "Harvesting with SONAR: the value of aggregating social network information",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1017-1026",
  "year": 2008,
  "badges": [],
  "abstract": "Web 2.0 gives people a substantial role in content and metadata creation. New interpersonal connections are formed and existing connections become evident through Web 2.0 services. This newly created social network (SN) spans across multiple services and aggregating it could bring great value. In this work we present SONAR, an API for gathering and sharing SN information. We give a detailed description of SONAR, demonstrate its potential value through user scenarios, and show results from experiments we conducted with a SONAR-based social networking application. These suggest that aggregating SN information across diverse data sources enriches the SN picture and makes it more complete and useful for the end user.",
  "tags": [
    "sna",
    "social network analysis",
    "aggregation",
    "social networks",
    "sn"
  ],
  "authors": [
    {
      "name": "Ido Guy",
      "institution": "IBM Haifa Research Lab, Haifa, Israel",
      "img": "/do/10.1145/contrib-81321492044/rel-imgonly/ig2014.png",
      "acmid": "81321492044",
      "orcid": "missing"
    },
    {
      "name": "Michal Jacovi",
      "institution": "IBM Haifa Research Lab, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100095688",
      "orcid": "missing"
    },
    {
      "name": "Elad Shahar",
      "institution": "IBM Haifa Research Lab, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342510891",
      "orcid": "missing"
    },
    {
      "name": "Noga Meshulam",
      "institution": "IBM Haifa Research Lab, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350575680",
      "orcid": "missing"
    },
    {
      "name": "Vladimir Soroka",
      "institution": "IBM Haifa Research Lab, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100504047",
      "orcid": "missing"
    },
    {
      "name": "Stephen Farrell",
      "institution": "IBM Almaden Research Center, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100596088",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamic, L. A., and Adar, E. Friends and neighbors on the Web, Social Networks, 25, 3 (2003), 211--230.",
      "doi": ""
    },
    {
      "text": "Aleman-Meza, B., Nagarajan, M., Ramakrishnan, C., Sheth, A., Arpinar, I., Ding, L., Kolari, P., Josi, A., and Finin, T. Semantic analytics on social networks: Experiences in addressing the problem of conflict of interest detection. Proc. WWW '06, ACM Press (2006), 407--416.  ",
      "doi": "10.1145/1135777.1135838"
    },
    {
      "text": "Bar-Yossef, Z., Guy, I., Lempel, R., Maarek, Y. S., and Soroka, V. Cluster ranking with an application to mining mailbox networks. Proc. ICDM '06, IEEE Computer Society (2006), 63--74.  ",
      "doi": "10.1109/ICDM.2006.35"
    },
    {
      "text": "Cai, D., Shao, Z., He, X., Yan, X., and Han, J. Mining hidden community in heterogeneous social networks. In Proc. of the 3rd International Workshop on Link Discovery (LinkKDD 2005),ACM Press (2005), 58 -- 65.  ",
      "doi": "10.1145/1134271.1134280"
    },
    {
      "text": "Culotta, A., Bekkerman, R., and McCallum, A. Extracting social networks and contact information from email and the Web. First Conference on Email and Anti-Spam (CEAS 2004) (2004).",
      "doi": ""
    },
    {
      "text": "Facebook Developers - Documentation. http://developers.facebook.com/documentation.php .",
      "doi": ""
    },
    {
      "text": "Farrell, S., and Lau, T. Fringe Contacts: People-Tagging for the Enterprise. Workshop on Collaborative Web Tagging, WWW'06, (2006).",
      "doi": ""
    },
    {
      "text": "Farnham, S., Portnoy, W., Turski, A., Cheng, L., and Vronay, D. Personal Map: Automatically modeling the user's online social network. Proc. INTERACT'03, IOS Press (2003), 567--574.",
      "doi": ""
    },
    {
      "text": "Fielding, R.T. Architectural styles and the design of network-based software architectures. PhD thesis, University of California, Irvine, CA, (2000). ",
      "doi": "10.5555/932295"
    },
    {
      "text": "Friend of a Friend (FOAF) project. http://www.foaf-project.org/ .",
      "doi": ""
    },
    {
      "text": "HammerSley, B. Content Syndication with RSS, (2003). ",
      "doi": "10.5555/1096093"
    },
    {
      "text": "Hope, T., Nishimura, T., and Takeda, H. An integrated method for social network extraction. Proc. WWW '06, ACM Press (2006), 845--846.  ",
      "doi": "10.1145/1135777.1135907"
    },
    {
      "text": "Introducing JSON. http://www.json.org/ .",
      "doi": ""
    },
    {
      "text": "Jackson, A., Yates, J., Orlikowski, W. \"Corporate Blogging: Building community through persistent digital talk\". Proc. 40th Annual Hawaii International Conference on System Sciences HICSS'07, (2007), p. 80  ",
      "doi": "10.1109/HICSS.2007.155"
    },
    {
      "text": "Kautz, H., Selman, B., and Shah., M. ReferralWeb: Combining social networks and collaborative filtering. Communications of the ACM 40, 3 (1997), 63--65.  ",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Matsuo, Y., Hamasaki, M. et al. Spinning multiple social networks for semantic Web. Proc. AAAI '06 (2006). ",
      "doi": "10.5555/1597348.1597408"
    },
    {
      "text": "Matsuo, Y., Mori, J., Hamasaki, M., Takeda, H., Nishimura, T., Hasida, K., and Ishizuka, M. POLYPHONET: An advanced social network extraction system. Proc. WWW '06, ACM Press (2006), 397--406.  ",
      "doi": "10.1145/1135777.1135837"
    },
    {
      "text": "McDonald D.W. and Ackerman M.S. Expertise recommender: a flexible recommendation system and architecture. Proc. CSCW'00, (2000), 231--240.  ",
      "doi": "10.1145/358916.358994"
    },
    {
      "text": "Millen, D.R., Feinberg, J., and Kerr, B. Dogear: Social Bookmarking in the Enterprise. Proc. CHI 2006, (2006), 111--120.  ",
      "doi": "10.1145/1124772.1124792"
    },
    {
      "text": "Nardi, B.A., Whittaker, S., Issacs, E., Creech, M., Johnson, J., and Hainsworth, J. Integrating communication and information through contact map. Communications of the ACM 45, 4 (2002) 89--95.  ",
      "doi": "10.1145/505248.505251"
    },
    {
      "text": "Neustaedter, C., Brush, A., Smith, M., and Fisher, D. The social network and relationship finder: Social sorting for email triage. Proc. CEAS 2005.",
      "doi": ""
    },
    {
      "text": "Newman, M. E. J. Scientific collaboration networks, part I. Network construction and fundamental results. Physical Review E, 64, 016131, (2001).",
      "doi": ""
    },
    {
      "text": "Nottingham, M., and Sayre, R. RFC 4287 - The Atom Syndication Format (Proposed Standard). http://tools.ietf.org/html/rfc4287",
      "doi": ""
    },
    {
      "text": "O'Reilly, T. What is Web 2.0. http://www.oreillynet.com/go/web2 .",
      "doi": ""
    },
    {
      "text": "Resig, J., Dawara, S., Homan, C. M., and Teredesai, A. Extracting social networks from instant messaging populations, Proc. of the 7th ACM SIGKDD Workshop on Link KDD, (2004).",
      "doi": ""
    },
    {
      "text": "Smarr, J. Technical and privacy challenges for integrating FOAF into existing applications. In the 1st Workshop on Friend of a Friend, Social Networking and the Semantic Web, (2004).",
      "doi": ""
    },
    {
      "text": "Smith, M. Invisible crowds in cyberspace: Measuring and mapping the social structure of Usenet. In Smith, M., and Kollock, P. Eds., Communities in Cyberspace. Routledge Press, (1999).",
      "doi": ""
    },
    {
      "text": "Tyler, J.R., Wilkinson, D.M., and Huberman, B.A. Email as spectroscopy: Automated discovery of community structure within organizations. In Communities and Technologies, Huysman, M., Wenger, E., and V. Wulf, Eds. (2003), 81--96. ",
      "doi": "10.5555/966263.966268"
    },
    {
      "text": "Wasserman, S., and Faust, K. Social Network Analysis. (1994).",
      "doi": ""
    },
    {
      "text": "Zhang, J., Ackerman M.S. Searching for expertise in social networks: a simulation of potential strategies. Proc. GROUP 2005, ACM Press (2005), 71--80.  ",
      "doi": "10.1145/1099203.1099214"
    },
    {
      "text": "Wellman, B. Computer networks as social networks. Science 293 (2001) 2031--2034.",
      "doi": ""
    }
  ]
}