{
  "doi": "10.1145/1357054.1357217",
  "title": "Sesame: informing user security decisions with system visualization",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1045-1054",
  "year": 2008,
  "badges": [],
  "abstract": "Non-expert users face a dilemma when making security decisions. Their security often cannot be fully automated for them, yet they generally lack both the motivation and technical knowledge to make informed security decisions on their own. To help users with this dilemma, we present a novel security user interface called Sesame. Sesame uses a concrete, spatial extension of the desktop metaphor to provide users with the security-related, visualized system-level information they need to make more informed decisions. It also provides users with actionable controls to affect a system's security state. Sesame graphically facilitates users' comprehension in making these decisions, and in doing so helps to lower the bar for motivating them to participate in the security of their system. In a controlled study, users with Sesame were found to make fewer errors than a control group which suggests that our novel security interface is a viable alternative approach to helping users with their dilemma.",
  "authors": [
    {
      "name": "Jennifer Stoll",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331504513",
      "orcid": "missing"
    },
    {
      "name": "Craig S. Tashman",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498515",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Kyle Spafford",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583995",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Conti, G., Abdullah, K., Grizzard, J., Stasko, J., Copeland, J., Ahamad, M., Owen, H., Lee, C. Countering Security Information Overload through Alert and Pack Visualization. IEEE Computer Graphics (2006).  ",
      "doi": "10.1109/MCG.2006.30"
    },
    {
      "text": "Dhamija, Rachna, Tygar, J.Doug. The Battle Against Phishing: Dynamic Security Skins. Symposium On Usable Privacy and Security, (2005).  ",
      "doi": "10.1145/1073001.1073009"
    },
    {
      "text": "DiGioia, P., Dourish P. Social Navigation as a Model for Usable Security. Symposium On Usable Privacy and Security (2005).  ",
      "doi": "10.1145/1073001.1073011"
    },
    {
      "text": "Downs, J. S., Holbrook, M. B., Cranor, L. F. Decision Strategies and Susceptibility to Phishing. Symposium On Usable Privacy and Security, (2005).  ",
      "doi": "10.1145/1143120.1143131"
    },
    {
      "text": "Edwards, W. K., Shehan, E., Stoll, J. Security Automation Considered Harmful? NSPW (2007)  ",
      "doi": "10.1145/1600176.1600182"
    },
    {
      "text": "Flinn, S.A., Flock of Birds, Safely Staged. DIMACS Workshop on Usable Privacy &amp; Security Software (2005).",
      "doi": ""
    },
    {
      "text": "Foresti, S., Agutter, J. Visual Correlation of Network Alerts. IEEE Computer Graphics (2006).  ",
      "doi": "10.1109/MCG.2006.49"
    },
    {
      "text": "Hutchins, E., Hollan, J., Norman, D. Direct Manipulation Interfaces. Human Computer Interaction, 1985. 1: p. 311--338.",
      "doi": ""
    },
    {
      "text": "Know Your Enemy: Tracking Botnets. Honeynet Project and Research Alliance. honeynet.org/papers/bots (2005).",
      "doi": ""
    },
    {
      "text": "Nielsen, J., Landauer, T. K., A mathematical model of the finding of usability problems. Proceedings of the ACM INTERCHI'93 Conference (1993). ",
      "doi": "10.5555/164632.164904"
    },
    {
      "text": "Shukla, S., Nah, F., Web Browsing and Spyware Intrusion. Communications of the ACM.Vol. 48, No. 8 (2005).  ",
      "doi": "10.1145/1076211.1076245"
    },
    {
      "text": "Smetters, D., Grinter, R. Moving from the Design of Usable Security Technologies to the Design of Useful Secure Applications. NSPW (2002).  ",
      "doi": "10.1145/844102.844117"
    },
    {
      "text": "Spyware. NISCC Technical Note. National Infrastructure Security Coordination Centre. (2006).",
      "doi": ""
    },
    {
      "text": "Thorpe, S., Fize, D. &amp; Marlot, C. (1996).Speed of processing in the human visual system. Nature, 381, 520--522.",
      "doi": ""
    },
    {
      "text": "Walker, A. Absolute Beginner's Guide to Security, Spam, Spyware &amp; Viruses. Que Publishing, ©© 2006. ",
      "doi": "10.5555/1076953"
    },
    {
      "text": "Whalen, T., Inkpen, K. Techniques for Visual Feedback of Security State. DIMACS Workshop on Usable Privacy and Security Software (2004).",
      "doi": ""
    },
    {
      "text": "Whitten, A., Tygar, J. Safe Security Staging. CHI 2003 Workshop on Human-Computer Interaction and Security Systems (2003).",
      "doi": ""
    },
    {
      "text": "Whitten, A., Tygar, J., Why Johnny Can't Encrypt. Proc. of the 8th USENIX Security Symposium (1999).",
      "doi": ""
    },
    {
      "text": "Wu, M., Miller, R. C., Little, G. Web Wallet: Preventing Phishing Attacks by Revealing User Intentions. Symposium On Usable Privacy and Security, (2006).  ",
      "doi": "10.1145/1143120.1143133"
    },
    {
      "text": "Wu, M., Miller, R. C., Garfinkel, S., Do Security Toolbars Actually Prevent Phishing Attacks? CHI (2006).  ",
      "doi": "10.1145/1124772.1124863"
    },
    {
      "text": "Yee, K., Sitaker, K. Passpet: Convenient Password Management and Phishing Protection. Symposium On Usable Privacy and Security, (2006).  ",
      "doi": "10.1145/1143120.1143126"
    },
    {
      "text": "www.sysinternals.com/Utilities/",
      "doi": ""
    }
  ]
}