{
  "doi": "10.1145/1357054.1357308",
  "title": "Fitts' throughput and the speed-accuracy tradeoff",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1633-1636",
  "year": 2008,
  "badges": [],
  "abstract": "We describe an experiment to test the hypothesis that Fitts' throughput is independent of the speed-accuracy tradeoff. Eighteen participants used a mouse in performing a total of 5,400 target selection trials. Comparing nominal, speed-emphasis, and accuracy-emphasis conditions, significant main effects were found on movement time (ms) and error rate (%), but not on throughput (bits/s). In the latter case, failure to reject the null hypothesis of \"no significant difference\" (i.e., .05 < p < 1) is viewed as evidence supporting the constant-throughput hypothesis.",
  "tags": [
    "speed-accuracy tradeoff",
    "throughput",
    "Fitts' law"
  ],
  "authors": [
    {
      "name": "I. Scott MacKenzie",
      "institution": "York University, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100367406/rel-imgonly/me8.jpg",
      "acmid": "81100367406",
      "orcid": "missing"
    },
    {
      "name": "Poika Isokoski",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100311272/rel-imgonly/poika2_smaller.jpg",
      "acmid": "81100311272",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fitts, P. M. and Radford, B. K., Information capacity of discrete motor responses under different cognitive sets, J Exp Psych, 71, 1966, 475--482.",
      "doi": ""
    },
    {
      "text": "Kantowitz, B. H. and Sorkin, R. D., Human factors: Understanding people-system relationships. New York: Wiley, 1983.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Fitts' law as a research and design tool in human-computer interaction, Human-Computer Interaction, 7, 1992, 91--139.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Soukoreff, R. W. and MacKenzie, I. S., Towards a standard for pointing device evaluation: Perspectives on 27 years of Fitts' law research in HCI, Int J Human-Computer Studies, 61, 2004, 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Zhai, S., Characterizing computer input with Fitts' law parameters: The information and non-information aspects of pointing, Int J Human-Computer Studies, 61, 2004, 791--801.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    }
  ]
}