{
  "doi": "10.1145/1357054.1357274",
  "title": "One-handed touchscreen input for legacy applications",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1399-1408",
  "year": 2008,
  "badges": [],
  "abstract": "Supporting one-handed thumb operation of touchscreen-based mobile devices presents a challenging tradeoff between visual expressivity and ease of interaction. ThumbSpace and Shift---two new application-independent, software-based interaction techniques---address this tradeoff in significantly different ways. ThumbSpace addresses distant objects while Shift addresses small object occlusion. We present two extensive, comparative user studies. The first compares ThumbSpace and Shift to peripheral hardware (directional pad and scrollwheel) and direct touchscreen input for selecting objects while standing and walking. The data favored the Shift design overall, but suggested ThumbSpace is promising for distant objects. Our second study examines the benefits and learnability of combining Shift and ThumbSpace on a device with a larger screen (3.5\"). We found their combined use offered users better overall speed and accuracy in hitting small targets (3.6 mm2) than using either method alone.",
  "tags": [
    "mobile devices",
    "one-handed interaction",
    "touchscreens"
  ],
  "authors": [
    {
      "name": "Amy K. Karlson",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100168208",
      "orcid": "0000-0001-8934-7761"
    },
    {
      "name": "Benjamin B. Bederson",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100083927/rel-imgonly/bederson.jpg",
      "acmid": "81100083927",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aliakseyeu, D., Subramanian, S., Gutwin, C. and Nacenta, M. Bubble radar: efficient pen-based interaction. In Proc. AVI 2006, ACM Press (2006), 19--26.  ",
      "doi": "10.1145/1133265.1133271"
    },
    {
      "text": "Asano, T., Sharlin, E., Kitamura, Y., et al. Predictive interaction using the delphian desktop. In Proc. UIST 2005, ACM Press (2005), 133--141.  ",
      "doi": "10.1145/1095034.1095058"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D. C., et al. Drag-and-Pop and Drag-and-Pick: Techniques for Accessing Remote Screen Content on Touch- and Pen-operated Systems. In Proc. INTERACT 2003 (2003), 57--64.",
      "doi": ""
    },
    {
      "text": "Bederson, B. B., Meyer, J. and Good, L. Jazz: An Extensible Zoomable User Interface Graphics Toolkit in Java. In Proc. UIST 2000), ACM Press (2000), 171--180.  ",
      "doi": "10.1145/354401.354754"
    },
    {
      "text": "Bezerianos, A. and Balakrishnan, R. The vacuum: facilitating the manipulation of distant objects. In Proc. CHI 2005, ACM Press (2005), 361--370.  ",
      "doi": "10.1145/1054972.1055023"
    },
    {
      "text": "Blanch, R., Guiard, Y. and Beaudouin-Lafon, M. Semantic pointing: improving target acquisition with control-display ratio adaptation. In Proc.CHI 2004, ACM Press (2004), 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Card, S. K., Moran, T. P. and Newell, A. The keystroke-level model for user performance time with interactive systems. Comm. of the ACM 23(1980), 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. CHI 2005, ACM Press (2005), 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R. and Beaudouin-Lafon, M. Object pointing: a complement to bitmap pointing in GUIs. In Proc. GI 2004, Canadian Human-Computer Communications Society (2004), 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Hascoët, M. Throwing models for large displays. In Proc. HCI 2003, British HCI Group (2003), 73--77.",
      "doi": ""
    },
    {
      "text": "Kabbash, P. and Buxton, W. The \"Prince\" technique: Fitts' Law and selection using area cursors. In Proc. CHI 1995), ACM Press (1995), 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Karlson, A. K., Bederson, B. B. and SanGiovanni, J. AppLens and LaunchTile: two designs for one-handed thumb use on small devices. In Proc. CHI 2005, ACM Press (2005), 201--210.  ",
      "doi": "10.1145/1054972.1055001"
    },
    {
      "text": "Karlson, A. K. and Bederson, B. B. ThumbSpace: generalized one-handed input for touchscreen-based mobile devices. In Proc. INTERACT 2007, Springer (2007), 324--338. ",
      "doi": "10.5555/1776994.1777034"
    },
    {
      "text": "Karlson, A. K., Bederson, B. B. and Contreras-Vidal, J. L. Understanding One Handed Use of Mobile Devices. In Lumsden, J. ed. Handbook of Research on User Interface Design and Evaluation for Mobile Technology, Information Science Reference, 2008.",
      "doi": ""
    },
    {
      "text": "Kristoffersen, S. and Ljungberg, F. \"Making place\" to make IT work. In Proc. SIGGROUP 1999, ACM Press (1999), 276--285.  ",
      "doi": "10.1145/320297.320330"
    },
    {
      "text": "Nacenta, M. A., Aliakseyeu, D., Subramanian, S. and Gutwin, C. A comparison of techniques for multi-display reaching. In Proc. CHI 2005, ACM Press (2005), 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V. and Kuorelahti, J. Interaction in 4-sec. bursts: the fragmented nature of attentional resources in mobile HCI. In Proc. CHI 2005, ACM Press (2005), 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Parhi, P., Karlson, A. K. and Bederson, B. B. Target Size Study for One-Handed Thumb Use on Small Touchscreen Devices. In Proc. MobileHCI 2006, ACM Press (2006), 203--210.  ",
      "doi": "10.1145/1152215.1152260"
    },
    {
      "text": "Pirhonen, P., Brewster, S. A. and Holguin, C. Gestural and audio metaphors as a means of control in mobile devices. In Proc. CHI 2002, ACM Press (2002), 291--298.  ",
      "doi": "10.1145/503376.503428"
    },
    {
      "text": "Potter, R. L., Weldon, L. J. and Shneiderman, B. Improving the accuracy of touch screens: an experimental evaluation of three strategies. In Proc. CHI 1988, ACM Press (1988), 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Sears, A. and Shneiderman, B. High-precision touchscreens: design strategies and comparisons with a mouse. Int. J. Man-Mach. Stud. 34, 4 (1991), 593--613.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "Vogel, D. and Baudisch, P. Shift: a technique for operating pen-based interfaces using touch. In Proc. CHI 2007, ACM Press (2007), 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Wigdor, D. and Balakrishnan, R. TiltText: using tilt for text input to mobile phones. In Proc. UIST 2003, ACM Press (2003), 81--90.  ",
      "doi": "10.1145/964696.964705"
    }
  ]
}