{
  "doi": "10.1145/1357054.1357285",
  "title": "Expandable grids for visualizing and authoring computer security policies",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1473-1482",
  "year": 2008,
  "badges": [],
  "abstract": "We introduce the Expandable Grid, a novel interaction technique for creating, editing, and viewing many types of security policies. Security policies, such as file permissions policies, have traditionally been displayed and edited in user interfaces based on a list of rules, each of which can only be viewed or edited in isolation. These list-of-rules interfaces cause problems for users when multiple rules interact, because the interfaces have no means of conveying the interactions amongst rules to users. Instead, users are left to figure out these rule interactions themselves. An Expandable Grid is an interactive matrix visualization designed to address the problems that list-of-rules interfaces have in conveying policies to users. This paper describes the Expandable Grid concept, shows a system using an Expandable Grid for setting file permissions in the Microsoft Windows XP operating system, and gives results of a user study involving 36 participants in which the Expandable Grid approach vastly outperformed the native Windows XP file-permissions interface on a broad range of policy-authoring tasks.",
  "tags": [
    "expandable grid",
    "visualization",
    "privacy",
    "file permissions",
    "security"
  ],
  "authors": [
    {
      "name": "Robert W. Reeder",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100651314/rel-imgonly/robthreequarterssmilemikemurphyportrait.jpg",
      "acmid": "81100651314",
      "orcid": "missing"
    },
    {
      "name": "Lujo Bauer",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350570444/rel-imgonly/lujo-5.jpg",
      "acmid": "81350570444",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Michael K. Reiter",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/do/10.1145/contrib-81387594159/rel-imgonly/mikereiter.jpg",
      "acmid": "81387594159",
      "orcid": "missing"
    },
    {
      "name": "Kelli Bacon",
      "institution": "Gonzaga University, Spokane, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350586056",
      "orcid": "missing"
    },
    {
      "name": "Keisha How",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578249",
      "orcid": "missing"
    },
    {
      "name": "Heather Strong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350576211",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "X. Cao and L. Iverson. Intentional access management: Making access control usable for end-users. In Proc. of the Second Symposium on Usable Privacy and Security (SOUPS 2006), pages 20--31, 2006.  ",
      "doi": "10.1145/1143120.1143124"
    },
    {
      "text": "N. S. Good and A. Krekelberg. Usability and privacy: a study of Kazaa P2P file-sharing. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems(CHI 2003), pages 137--144, New York, NY, April 2003.  ",
      "doi": "10.1145/642611.642636"
    },
    {
      "text": "J. Karat, C.-M. Karat, C. Brodie, and J. Feng. Privacy in information technology: Designing to enable privacy policy management in organizations. International Journal of Human--Computer Studies, 63(1-2):153--174, July 2005.  ",
      "doi": "10.1016/j.ijhcs.2005.04.011"
    },
    {
      "text": "B. W. Lampson. Protection. Operating Systems Review, 8(1):18--24, January 1974. Reprint of the original from Proceedings of the Fifth Princeton Symposium on Information Sciences and Systems (Princeton University, March, 1971), 437--443.",
      "doi": "10.1145/775265.775268"
    },
    {
      "text": "R. A. Maxion and R. W. Reeder. Improving user-interface dependability through mitigation of human error. International Journal of Human-Computer Studies, 63(1-2):25--50, July 2005.  ",
      "doi": "10.1016/j.ijhcs.2005.04.009"
    },
    {
      "text": "M. C. Mont, R. Thyne, and P. Bramhall. Privacy enforcement with HP Select Access for regulatory compliance. Technical Report HPL-2005-10, HP Laboratories Bristol, Bristol, UK, January 2005. Available at http://www.hpl.hp.com/techreports/2005/HPL-2005-10.pdf. Accessed on January 10, 2008.",
      "doi": ""
    },
    {
      "text": "J. Rode, C. Johansson, P. DiGioia, R. S. Filho, K. Nies, D. H. Nguyen, J. Ren, P. Dourish, and D. Redmiles. Seeing further: Extending visualization as a basis for usable security. In Proceedings of the Second Symposium on Usable Privacy and Security (SOUPS 2006), pages 145--155, 2006.  ",
      "doi": "10.1145/1143120.1143138"
    },
    {
      "text": "The Open Group Research Institute. Adage system overview. Available at http://www.memesoft.com/adage/SystemSpec.ps. Accessed on September 20, 2006.",
      "doi": ""
    },
    {
      "text": "U.S. Senate Sergeant at Arms. Report on the investigation into improper access to the Senate Judiciary Committee's computer system, March 2004. Available at http://judiciary.senate.gov/testimony.cfm?id=1085&wit_id=2514. Accessed on January 10, 2008.",
      "doi": ""
    },
    {
      "text": "M. E. Zurko. Adage usability testing results: Formal testing affinity mapping and questionnaire. Available at http://www.memesoft.com/adage/affinity.ps. Accessed on September 20, 2006.",
      "doi": ""
    },
    {
      "text": "M. E. Zurko, R. Simon, and T. Sanfilippo. A user-centered, modular authorization service built on an RBAC foundation. In Proceedings 1999 IEEE Symposium on Security and Privacy, pages 57--71, Los Alamitos, CA, May 1999.",
      "doi": ""
    }
  ]
}