{
  "doi": "10.1145/1357054.1357291",
  "title": "The effects of empathetic virtual characters on presence in narrative-centered learning environments",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1511-1520",
  "year": 2008,
  "badges": [],
  "abstract": "Recent years have seen a growing interest in the role that narrative can play in learning. With the emergence of narrative-centered learning environments that engage students by drawing them into rich interactions with compelling characters, we have begun to see the significant potential offered by immersive story-based learning experiences. In this paper we describe two studies that investigate the impact of empathetic characters on student perceptions of presence. A study was initially conducted with middle school students, and was then replicated with high school students. The results indicate that, for both populations, employing empathetic characters in narrative-centered learning environments significantly increases student perceptions of presence. The studies also reveal that empathetic characters contribute to a heightened sense of student involvement and control in learning situations.",
  "tags": [
    "presence",
    "empathy",
    "experimental studies",
    "narrative",
    "learning environments",
    "virtual characters"
  ],
  "authors": [
    {
      "name": "Scott W. McQuiggan",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318490239",
      "orcid": "missing"
    },
    {
      "name": "Jonathan P. Rowe",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381595960",
      "orcid": "missing"
    },
    {
      "name": "James C. Lester",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339512416",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailenson, J., Swinth, K., Hoyt, C., Persky, S., Dimov, A., &amp; Blascovich, J. The independent and interactive effects of embodied-agent appearance and behavior on self-report, cognitive, and behavioral markers of copresence in immersive virtual environments. Presence: Teleoperators and Virtual Environments, 14, 4 (2005), 379--393.  ",
      "doi": "10.1162/105474605774785235"
    },
    {
      "text": "Bates, J. Virtual reality, art, and entertainment. Presence: The Journal of Teleoperators and Virtual Environments, 1, 1 (1992), 133--138. ",
      "doi": "10.5555/2870721.2870734"
    },
    {
      "text": "Bickmore, T., and Picard, R. Establishing and maintaining long-term human-computer relationships. Trans. on Computer-Human Interaction, 12, 2 (2004), 293--327.  ",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Brave, S., Nass, C., and Hutchinson, K. Computers that care: investigating the effects of orientation of emotion exhibited by an embodied computer agent. International Journal of Human-Computer Studies, 62, (2005), 161--178.  ",
      "doi": "10.1016/j.ijhcs.2004.11.002"
    },
    {
      "text": "Craig, S., Graesser, A., Sullins, J., &amp; Gholson, B. Affect and learning: An exploratory look into the role of affect in learning with AutoTutor. Educational Media, 29, (2004), 241--250.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The psychology of optimal experience. Harper and Row Publishers Inc., New York, NY, 1990.",
      "doi": ""
    },
    {
      "text": "Davis, M. Empathy: A Social Psychological Approach. Brown and Benchmark Publishers, Madison, WI, 1994.",
      "doi": ""
    },
    {
      "text": "Dow, S., Mehta, M., Harmon, E., MacIntyre, B., and Mateas, M. Presence and Engagement in an Interactive Drama. Proc. CHI 2007, ACM Press (2007), 1475--1484  ",
      "doi": "10.1145/1240624.1240847"
    },
    {
      "text": "Elliot, A., and McGregor, H. A 2 x 2 achievement goal framework. Journal of Personality and Social Psychology, 80, 3 (2001), 501--519.",
      "doi": ""
    },
    {
      "text": "Egri, L. The Art of Dramatic Writing: Its Basis in the Creative Interpretation of Human Motives. Simon and Schuster, New York, NY, 1946.",
      "doi": ""
    },
    {
      "text": "Garau, M., Slater, M., Pertaub, D., and Razzaque, S.The responses of people to virtual humans in an immersive virtual environment, Presence: Teleoperators and Virtual Environments, 14, 1 (2005), 104--116.  ",
      "doi": "10.1162/1054746053890242"
    },
    {
      "text": "Gerrig, R. Experiencing narrative worlds: On the psychological activities of reading. Yale University Press, New Haven, CT, 1993.",
      "doi": ""
    },
    {
      "text": "Green, M., and Brock, T. The role of transportation in the persuasiveness of public narratives. Journal of Personality and Social Psychology, 27, (2000), 701--721.",
      "doi": ""
    },
    {
      "text": "Hoffman, M. Empathy and Moral Development: Implications for Caring and Justice. Cambridge University Press, Cambridge, UK, 2000.",
      "doi": ""
    },
    {
      "text": "Ickes, W. Empathic Accuracy. Guilford Press, New York, NY, 1997.",
      "doi": ""
    },
    {
      "text": "IJsselsteijn, W., de Ridder, H., Freeman, J. and Avons, S. Presence: Concept, determinants and measurement. In Proc of the SPIE 2000, 520--529.",
      "doi": ""
    },
    {
      "text": "Insko, B. Measuring presence: Subjective, behavioral and physiological methods. In G. Riva, F. Davide, and W. IJsselsteijn (Eds.), Being There: Concepts, Effects and Measurements of User Presence in Synthetic Environments. Amsterdam: Ios Press (2003), 109--119.",
      "doi": ""
    },
    {
      "text": "Kim, Y., and Baylor, A. A social-cognitive framework for pedagogical agents as learning companions. Educational Technology Research &amp; Development, 54, 6 (2006), 569--590.",
      "doi": ""
    },
    {
      "text": "Johnsen, K., Raij, A., Stevens, A., Lind, S., Lok, B. The validity of a virtual human experience for interpersonal skills education. Proc of CHI 2007, ACM Press (2007), 1049--1058.  ",
      "doi": "10.1145/1240624.1240784"
    },
    {
      "text": "Kelso, M., Weyhrauch, P., and Bates, J. Dramatic presence. Presence: The Journal of Teleoperators and Virtual Environments, 2,1 (1993), 1--15.",
      "doi": "10.1162/pres.1993.2.1.1"
    },
    {
      "text": "Kolb, D. A., Boyatzis, R. E., and Mainemelis, C. Experiential learning theory: Previous research and new directions. In R. J. Sternberg and L. F. Zhang (Eds), Perspectives on Thinking, Learning, and Cognitive Styles. Mahwah, NJ: Prentice Hall (2000), 227--247.",
      "doi": ""
    },
    {
      "text": "Lee, K., and Nass, C. Designing social presence of social actors in human computer interaction. Proc of CHI 2003, ACM Press (2003), 289--296.  ",
      "doi": "10.1145/642611.642662"
    },
    {
      "text": "Lombard, M., and Ditton, T. At the heart of it all: The concept of presence. Journal of Computer Mediated Communication. 3, 2 (1997).",
      "doi": ""
    },
    {
      "text": "Malone, T., and Lepper, M. Making learning fun: A taxonomy of intrinsic motivations for learning. In Snow, R., and Farr, M. (Eds.), Aptitude, learning, and instruction: III. Conative and affective process analyses (pp. 223--253). Erlbaum, Hillsdale, NJ, 1987.",
      "doi": ""
    },
    {
      "text": "McQuiggan, S., and Lester, J. Learning empathy: A data-driven framework for modeling empathetic companion agents. Proc. of AAMAS 2006, 961--968.  ",
      "doi": "10.1145/1160633.1160806"
    },
    {
      "text": "McQuiggan, S., and Lester, J. Modeling and evaluating empathy in embodied companion agents. International Journal of Human-Computer Studies, 65, 4, (2007), 348--360.  ",
      "doi": "10.1016/j.ijhcs.2006.11.015"
    },
    {
      "text": "McQuiggan, S., Robison, J., Phillips, R., and Lester, J. Modeling parallel and reactive empathy in virtual agents: An inductive approach. Proc. of AAMAS 2008, to appear. ",
      "doi": "10.5555/1402383.1402411"
    },
    {
      "text": "Meehan, M., Insko, B., Whitton, M. and Brooks, F. Physiological measures of presence in virtual environments. ACM Transactions on Graphics, 21, (2002), 645--652.  ",
      "doi": "10.1145/566654.566630"
    },
    {
      "text": "Norman, D. The Invisible Computer. MIT Press, 1998. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Paiva, A., Dias, J., Sobral, D., Aylett, R., Sobreperez, P., Woods, S., Zoll, C., Hall, L. Caring for Agents and Agents that Care: Building Empathic Relations with Synthetic Agents. Proc of AAMAS 2004, 194--201.  ",
      "doi": "10.5555/1018409.1018754"
    },
    {
      "text": "Parker, L. and Lepper, M. Effects of fantasy contexts on children's learning and motivation: Making learning more fun. Journal of Personality and Social Psychology, 62, 4 (1992), 625 -- 633.",
      "doi": ""
    },
    {
      "text": "Prendinger, H., and Ishizuka, M., The empathic companion: a character-based interface that addresses users' affective states. Applied Artificial Intelligence, 19, (2005), 267--285.",
      "doi": ""
    },
    {
      "text": "Rickel, J., and Johnson, L. Integrating pedagogical capabilities in a virtual environment agent. Proc. of Intl Conf on Autonomous Agents, (1997), 30--88.  ",
      "doi": "10.1145/267658.267664"
    },
    {
      "text": "Rowe, J., McQuiggan, S., and Lester, J. Narrative presence in intelligent learning environments. In 2007 AAAI Symposium on Intelligent Narrative Technologies.",
      "doi": ""
    },
    {
      "text": "Ryokai, K., Vaucelle, C., Cassell, J. Virtual Peers as Partners in Storytelling and Literacy Learning. Journal of Computer Assisted Learning, 19, 2 (2003), 195--208.",
      "doi": ""
    },
    {
      "text": "Schubert, T., Friedmann, F., and Regenbrecht, H. Embodied presence in virtual environments. In Paton, R., and Neilson, I. (Eds.), Visual Representations and Interpretations. London: Springer (1999). 269--278.",
      "doi": ""
    },
    {
      "text": "Swartout, W., Gratch, J., Hill, R., Hovy, E., Marsella, S., Rickel, J., &amp; Traum, D. Toward Virtual Humans. AI Magazine, 27, 2 ( 2006), 96--108. ",
      "doi": "10.5555/1167629.1167639"
    },
    {
      "text": "Vinayagamoorthy, V., Steed, A. and Slater, M. Building Characters: Lessons Drawn from Virtual Environments. Proc of Toward Social Mechanisms of Android Science at CogSci 2005, (2005), 119--126.",
      "doi": ""
    },
    {
      "text": "Waterworth, E.L., and Waterworth, J. A. Presence and Absence in Educational VR: The Role of Perceptual Seduction in Conceptual Learning. Themes in Education, 1, 1, (2000), 7--38.",
      "doi": ""
    },
    {
      "text": "Wells, C. The meaning makers: Children learning language and using language to learn. Heinnemann, Portsmouth, NH, 1986.",
      "doi": ""
    },
    {
      "text": "Wiendl, C., Dorfmüller-Ulhaas, K., Schulz, N., and André, E. Integrating a Virtual Agent into the Real World: the Virtual Anatomy Assistant Ritchie. Proc. of IVA 2007, 211--224.  ",
      "doi": "10.1007/978-3-540-74997-4_20"
    },
    {
      "text": "Witmer, B., and Singer, M. Measuring presence in virtual environments: A presence questionnaire. Presence: Teleoperators and Virtual Environments, 7, 3 (1998), 225--240.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Zanbaka, C., Ulinski, A., Goolkasian, P., Hodges, L. F. Social responses to virtual humans: Implications for future interface design.\" Proc of CHI 2007, ACM Press (2007), 1561 -- 1570.  ",
      "doi": "10.1145/1240624.1240861"
    }
  ]
}