{
  "doi": "10.1145/1357054.1357330",
  "title": "Evaluating motion constraints for 3D wayfinding in immersive and desktop virtual environments",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1769-1778",
  "year": 2008,
  "badges": [],
  "abstract": "Motion constraints providing guidance for 3D navigation have recently been suggested as a way of offloading some of the cognitive effort of traversing complex 3D environments on a computer. We present findings from an evaluation of the benefits of this practice where users achieved significantly better results in memory recall and performance when given access to such a guidance method. The study was conducted on both standard desktop computers with mouse and keyboard, as well as on an immersive CAVE system. Interestingly, our results also show that the improvements were more dramatic for desktop users than for CAVE users, even outperforming the latter. Furthermore, the study indicates that allowing the users to retain local control over the navigation on the desktop platform helps them in familiarizing themselves with the 3D world.",
  "authors": [
    {
      "name": "Niklas Elmqvist",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    },
    {
      "name": "Mihail Eduard Tudoreanu",
      "institution": "University of Arkansas at Little Ro k, Little Rock, AR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100378171",
      "orcid": "missing"
    },
    {
      "name": "Philippas Tsigas",
      "institution": "Chalmers University of Technology, Göteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100218610",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Carlos Andujar, Pere-Pau Vazquez, and Marta Fairen. Way-finder: guided tours through complex walkthrough models. In Proceedings of Eurographics, pages 499--508, 2004.",
      "doi": ""
    },
    {
      "text": "E. J. Arthur, P. A. Hancock, and S. T. Chrysler. Spatial orientation in real and virtual worlds. In Proceedings of the Human Factors and Ergonomics Society 37th Annual Meeting, pages 328--332, 1993.",
      "doi": ""
    },
    {
      "text": "M. Pauline Baker and Christopher D. Wickens. Human factors in virtual environments for the visual analysis of scientific data. Technical Report NCSA-TR032, National Center for Supercomputing, August 1995.",
      "doi": ""
    },
    {
      "text": "Steffi Beckhaus, Felix Ritter, and Thomas Strothotte. Guided exploration with dynamic potential fields: the CubicalPath system. Computer Graphics Forum, 20(4):201--210, 2001.",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman, David Koller, and Larry F. Hodges. Travel in immersive virtual environments: An evaluation of viewpoint motion control techniques. Proceedings of the IEEE Conference on Virtual Reality, pages 45--52, 1997. ",
      "doi": "10.5555/523977.836072"
    },
    {
      "text": "William G. Chase. Handbook of Perception and Human Performance, Vol II: Cognitive Processes and Performance, chapter Visual Information Processing. JohnWiley and Sons, 1986.",
      "doi": ""
    },
    {
      "text": "Luca Chittaro and Stefano Burigat. 3D location-pointing as a navigation aid in virtual environments. In Proceedings of the ACM Conference on Advanced Visual Interfaces, pages 267--274, 2004.  ",
      "doi": "10.1145/989863.989910"
    },
    {
      "text": "Luca Chittaro, Roberto Ranon, and Lucio Ieronutti. Guiding visitors of Web3D worlds through automatically generated tours. In Proceedings of the ACM Conference on 3D Web Technology, pages 27--38, 2003.  ",
      "doi": "10.1145/636593.636598"
    },
    {
      "text": "Rudolph P. Darken and Barry Peterson. Spatial orientation, wayfinding, and representation. In Kay M. Stanney, editor, Handbook of Virtual Environment Technology. Lawrence Erlbaum, 2001.",
      "doi": ""
    },
    {
      "text": "Rudolph P. Darken and John L. Sibert. Wayfinding strategies and behaviors in large virtual worlds. In Proceedings of the ACM CHI'96 Conference on Human Factors in Computing Systems, pages 142--149, 1996.  ",
      "doi": "10.1145/238386.238459"
    },
    {
      "text": "Niklas Elmqvist, Mihail Eduard Tudoreanu, and Philippas Tsigas. Tour generation for exploration of 3D virtual environments. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology, pages 207--210, 2007.  ",
      "doi": "10.1145/1315184.1315224"
    },
    {
      "text": "James D. Foley, Andries van Dam, Steven K. Feiner, and John F. Hughes. Computer Graphics: Principles and Practice. Addison-Wesley, Reading MA, 1990. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "Tinsley A. Galyean. Guided navigation of virtual environments. In Proceedings of the ACM Symposium on Interactive 3D Graphics, pages 103--104, 1995.  ",
      "doi": "10.1145/199404.199421"
    },
    {
      "text": "Andrew J. Hanson and Eric A. Wernert. Constrained 3D navigation with 2D controllers. In Proceedings of the IEEE Conference on Visualization, pages 176--182, 1997. ",
      "doi": "10.5555/266989.267052"
    },
    {
      "text": "Lichan Hong, Shigeru Muraki, Arie Kaufman, Dirk Bartz, and Taosong He. Virtual voyage: interactive navigation in the human colon. In Proceedings of the ACM SIGGRAPH Conference, pages 27--34, 1997.  ",
      "doi": "10.1145/258734.258750"
    },
    {
      "text": "Takeo Igarashi, Rieko Kadobayashi, Kenji Mase, and Hidehiko Tanaka. Path drawing for 3D walkthrough. In Proceedings of the ACM Symposium on User Interface Software and Technology, pages 173--174, 1998.  ",
      "doi": "10.1145/288392.288599"
    },
    {
      "text": "Jock D. Mackinlay, Stuart K. Card, and Robertson Robertson. Rapid controlled movement through a virtual 3D workspace. In Proceedings of the ACM SIGGRAPH Conference, pages 171--176, 1990.  ",
      "doi": "10.1145/97879.97898"
    },
    {
      "text": "Randy Pausch, Dennis Proffitt, and George Williams. Quantifying immersion in virtual reality. In Proceedings of the ACM SIGGRAPH Conference, pages 13--18, 1997.  ",
      "doi": "10.1145/258734.258744"
    },
    {
      "text": "P. Peruch, J. L. Vercher, and G. M. Gauthier. Acquisition of spatial knowledge through exploration of simulated environments. Ecological Psychology, 7(1):1--20, 1995.",
      "doi": ""
    },
    {
      "text": "George G. Robertson, Jock D. Mackinlay, and Stuart K. Card. Cone trees: Animated 3D visualizations of hierarchical information. In Proceedings of the ACM CHI'91 Conference on Human Factors in Computing Systems, pages 189--194, 1991.  ",
      "doi": "10.1145/108844.108883"
    },
    {
      "text": "Roy A. Ruddle. The effect of trails on first-time and subsequent navigation in a virtual environment. In Proceedings of the IEEE Conference on Virtual Reality, pages 115--122, 2005.  ",
      "doi": "10.1109/VR.2005.76"
    },
    {
      "text": "Jurgen Schulze, Andrew Forsberg, Alexander Kleppe, Robert Zeleznik, and David H. Laidlaw. Characterizing the effect of level of immersion on a 3D marking task. In Proceedings of HCI International, pages 447--452, 2005.",
      "doi": ""
    },
    {
      "text": "Deyang Song and Michael Norman. Nonlinear interactive motion control techniques for virtual space navigation. In Proceedings of the IEEE Virtual Reality Annual International Symposium, pages 111--117, 1993.",
      "doi": "10.1109/VRAIS.1993.380790"
    },
    {
      "text": "Desney S. Tan, George G. Robertson, and Mary Czerwinski. Exploring 3D navigation: Combining speedcoupled flying with orbiting. In Proceedings of the ACM CHI 2001 Conference on Human Factors in Computing Systems, pages 418--425, 2001.  ",
      "doi": "10.1145/365024.365307"
    },
    {
      "text": "Edward C. Tolman. Cognitive maps in rats and men. The Psychological Review, 55(4):189--208, July 1948.",
      "doi": ""
    },
    {
      "text": "Colin Ware and Danny R. Jessome. Using the bat: A sixdimensional mouse for object placement. IEEE Computer Graphics and Applications, 8(6):65--70, 1988.  ",
      "doi": "10.1109/38.20319"
    },
    {
      "text": "Colin Ware and Steven Osborne. Exploration and virtual camera control in virtual three dimensional environments. Computer Graphics, 24(2):175--183, 1990.  ",
      "doi": "10.1145/91394.91442"
    },
    {
      "text": "Eric A. Wernert and Andrew J. Hanson. A framework for assisted exploration with collaboration. In Proceedings of the IEEE Conference on Visualization, pages 241--248, 1999. ",
      "doi": "10.5555/319351.319380"
    },
    {
      "text": "Bob G. Witmer and Michael J. Singer. Measuring presence in virtual environments: A presence questionnaire. Presence, 7(3):225--240, June 1998.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Ji Soo Yoon and Mary Lou Maher. A swarm algorithm for wayfinding in dynamic virtual worlds. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology, pages 113--116, 2005.  ",
      "doi": "10.1145/1101616.1101639"
    }
  ]
}