{
  "doi": "10.1145/1357054.1357105",
  "title": "Rubbing and tapping for precise and rapid selection on touch-screen displays",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "295-304",
  "year": 2008,
  "badges": [],
  "abstract": "We introduce two families of techniques, rubbing and tapping, that use zooming to make possible precise interaction on passive touch screens, and describe examples of each. Rub-Pointing uses a diagonal rubbing gesture to integrate pointing and zooming in a single-handed technique. In contrast, Zoom-Tapping is a two-handed technique in which the dominant hand points, while the non-dominant hand taps to zoom, simulating multi-touch functionality on a single-touch display. Rub-Tapping is a hybrid technique that integrates rubbing with the dominant hand to point and zoom, and tapping with the non-dominant hand to confirm selection. We describe the results of a formal user study comparing these techniques with each other and with the well-known Take-Off and Zoom-Pointing selection techniques. Rub-Pointing and Zoom-Tapping had significantly fewer errors than Take-Off for small targets, and were significantly faster than Take-Off and Zoom-Pointing. We show how the techniques can be used for fluid interaction in an image viewer and in Google Maps.",
  "tags": [
    "pointing",
    "rubbing",
    "interaction techniques",
    "zoom-tapping",
    "touch screens",
    "rub-tapping",
    "rub-pointing",
    "tapping"
  ],
  "authors": [
    {
      "name": "Alex Olwal",
      "institution": "Royal Institute of Technology (KTH), Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81309497296/rel-imgonly/alex.png",
      "acmid": "81309497296",
      "orcid": "0000-0001-7772-0530"
    },
    {
      "name": "Steven Feiner",
      "institution": "Columbia University, New York, NY, USA",
      "img": "/do/10.1145/contrib-81100427474/rel-imgonly/feiner02nothumb.png",
      "acmid": "81100427474",
      "orcid": "missing"
    },
    {
      "name": "Susanna Heyman",
      "institution": "Royal Institute of Technology (KTH), Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585383",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albinsson, P-A. and Zhai, S. High precision touch screen interaction. Proc. CHI '03, ACM Press (2003), 105--112.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Apple iPhone. http://www.apple.com/iphone/. January 2008.",
      "doi": ""
    },
    {
      "text": "Bederson, B., Hollan, J., Perlin, K., Meyer, J., Bacon, D., and Furnas, G. Pad++: A zoomable graphical sketchpad for exploring alternate interface physics. Journal of Visual Languages and Computing, 7(1), March, 1996, 3--32.",
      "doi": ""
    },
    {
      "text": "Benko, H., Wilson, A., and Baudisch, P. Precise selection techniques for multi-touch screens. Proc. CHI 2006, ACM Press (2006), 1263--1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Buxton, W. A three-state model of graphical input. In D. Diaper et al. (eds.), Human-Computer Interaction-- INTERACT '90. Amsterdam: Elsevier Science Publishers B.V. (North-Holland), 449--456. ",
      "doi": "10.5555/647402.725582"
    },
    {
      "text": "Dietz, P.H., Leigh, D.L. DiamondTouch: A multi-user touch technology. Proc. UIST '01, ACM Press (2001), 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Evans, K. B., Tanner, P. P., and Wein, M. Tablet-based valuators that provide one, two, or three degrees of freedom. Proc. SIGGRAPH '81. ACM Press (1981), 91--97.  ",
      "doi": "10.1145/800224.806794"
    },
    {
      "text": "Google Maps. http://maps.google.com/. January 2008.",
      "doi": ""
    },
    {
      "text": "Han, J. Y. 2005. Low-cost multi-touch sensing through frustrated total internal reflection. Proc. UIST '05. ACM Press (2005), 115--118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Jazzmutant Lemur. http://www.jazzmutant.com/lemur_overview.php. January 2008.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G. and Buxton. W. Issues in combining marking and direct manipulation techniques. Proc UIST 91, ACM Press (1991), 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "MacKenzie, I.S. and Oniszczak, A. A comparison of three selection techniques for touchpads. Proc. CHI '98, ACM Press (1998), 336--343.  ",
      "doi": "10.1145/274644.274691"
    },
    {
      "text": "Matsushita, N., Ayatsuka, Y., and Rekimoto, J. Dual touch: a twohanded interface for pen-based PDAs. Proc. UIST '00. ACM Press (2000), 211--212.  ",
      "doi": "10.1145/354401.354774"
    },
    {
      "text": "Microsoft Surface. http://www.microsoft.com/surface/. January 2008.",
      "doi": ""
    },
    {
      "text": "Moscovich, T. and Hughes, J. F. Navigating documents with the virtual scroll ring. Proc. UIST '04. ACM Press (2004), 57--60.  ",
      "doi": "10.1145/1029632.1029642"
    },
    {
      "text": "Newman, W. A graphical technique for numerical input. The Computer Journal, 11(1), 1968, 63--64.",
      "doi": ""
    },
    {
      "text": "Olwal, A. and Feiner S. Rubbing the fisheye: Precise touch-screen interaction with gestures and fisheye views. Conf. Supplement of UIST '03 (2003), 83--84.",
      "doi": ""
    },
    {
      "text": "Potter, R.L., Weldon, L.J., and Shneiderman, B. Improving the accuracy of touch screens: An experimental evaluation of three strategies. Proc. CHI '88, ACM Press (1988), 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Smith, G. and schraefel, mc. The radial scroll tool: Scrolling support for stylus- or touch-based document navigation. Proc. UIST 2004, ACM Press (2004), 53--56.  ",
      "doi": "10.1145/1029632.1029641"
    },
    {
      "text": "Vogel, D. and Baudisch, P. Shift: a technique for operating pen-based interfaces using touch. Proc. CHI '07. ACM Press, (2007), 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    }
  ]
}