{
  "doi": "10.1145/1357054.1357187",
  "title": "Feasibility and pragmatics of classifying working memory load with an electroencephalograph",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "835-844",
  "year": 2008,
  "badges": [],
  "abstract": "A reliable and unobtrusive measurement of working memory load could be used to evaluate the efficacy of interfaces and to provide real-time user-state information to adaptive systems. In this paper, we describe an experiment we con-ducted to explore some of the issues around using an elec-troencephalograph (EEG) for classifying working memory load. Within this experiment, we present our classification methodology, including a novel feature selection scheme that seems to alleviate the need for complex drift modeling and artifact rejection. We demonstrate classification accuracies of up to 99% for 2 memory load levels and up to 88% for 4 levels. We also present results suggesting that we can do this with shorter windows, much less training data, and a smaller number of EEG channels, than reported previously. Finally, we show results suggesting that the models we construct transfer across variants of the task, implying some level of generality. We believe these findings extend prior work and bring us a step closer to the use of such technologies in HCI research.",
  "authors": [
    {
      "name": "David Grimes",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310502982",
      "orcid": "missing"
    },
    {
      "name": "Desney S. Tan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Pradeep Shenoy",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81337493710",
      "orcid": "missing"
    },
    {
      "name": "Rajesh P.N. Rao",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660783392",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baddeley, A.D., &amp; Hitch, G. (1974). Working Memory. In G.H Bower (ed.) Recent Advances in Learning and Motivation, 8. Academic Press: New York.",
      "doi": ""
    },
    {
      "text": "Berger, H. (1929). Uber das elektroenzephalogramm des menschen. Arch Psychiatr, 87, 527--570.",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T., &amp; Newell, A. (1983). The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates: Hillsdale, NJ. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chen, D., &amp; Vertegaal, R. (2004). Using mental load for managing interruptions in physiologically attentive user interfaces. Extended Abstracts of SIGCHI 2004 Conference on Human Factors in Computing Systems, 1513--1516.  ",
      "doi": "10.1145/985921.986103"
    },
    {
      "text": "Fisch, B.J. (2005). Fisch &amp; Spehlmann's EEG primer: Basic principles of digital and analog EEG. Elsevier; Amsterdam.",
      "doi": ""
    },
    {
      "text": "Gevins, A., &amp; Smith, M.E. (2003). Neurophysiological measures of cognitive workload during human-computer interaction. Theoretical Issues in Ergonomics Science, 4, 113--131.",
      "doi": ""
    },
    {
      "text": "Gevins, A., Smith, M.E., Leong, H., &amp; McEvoy, L. (1998). Monitoring working memory load during computer-based tasks with EEG pattern recognition methods. Human Factors, 40(1), 79--91.",
      "doi": ""
    },
    {
      "text": "Howard, M.W., Rizzuto, D.S., Caplan, J.B., Madsen, J.R., Lisman, J., Aschenbrenner-Scheibe, R., Schulze-Bonhage, A., &amp; Kahana, M.J. (2003). Gamma oscillations correlate with working memory load in humans. Cerebral Cortex, 13, 1369--1374.",
      "doi": ""
    },
    {
      "text": "Jasper, H.H. (1958). The ten-twenty electrode system of the international federation. Electroencephalography and Clinical Neurophysiology, 10, 371--375.",
      "doi": ""
    },
    {
      "text": "Jensen, O., Gelfand, J., Kounios, J., &amp; Lisman, J.E. (2002). Oscillations in the alpha band (9-12 Hz) increase with memory load during retention in a short-term memory task. Cerebral Cortex, 12, 877--882",
      "doi": ""
    },
    {
      "text": "Kilmesch, W., Schimke, H., &amp; Pfurtscheller, G. (1993). Alpha frequency, cognitive load and memory performance. Brain Topography, 5(3), 241--251.",
      "doi": ""
    },
    {
      "text": "Kitamura, Y., Yamaguchi, Y., Imamizu, H., Kishino, F., &amp; Kawato, M. (2003). Things happening in the brain while humans learn to use new tools. Proceedings of SIGCHI 2003 Conference on Human Factors in Computing Systems, 417--424.  ",
      "doi": "10.1145/642611.642684"
    },
    {
      "text": "Kohlmorgen, J., Muller, K.R., &amp; Pawelzik, K. (1998). Analysis of drafting dynamics with neural network hidden markov models. Conference on Advances in Neural Information Processing Systems, 735--741. ",
      "doi": "10.5555/302528.302790"
    },
    {
      "text": "Kramer, A.F. (1991). Physiological metrics of mental workload: A review of recent progress. In Multiple Task Performance (ed. Damos, D.L.), 279--328.",
      "doi": ""
    },
    {
      "text": "Lee, J., &amp; Tan, D.S. (2006). Using low-cost electroencephalograph for task classification in HCI research. Proceedings of the 19th ACM Symposium on User Interface Software and Technology, 81--90.  ",
      "doi": "10.1145/1166253.1166268"
    },
    {
      "text": "MacKay, D.J.C. (2002). Information Theory, Inference, &amp; Learning Algorithms. Cambridge University Press: USA. ",
      "doi": "10.5555/971143"
    },
    {
      "text": "Mecklinger, A., Kramer, A.F., &amp; Strayer, D.L. (1992). Event related potentials and EEG components in a semantic memory search task. Psychophysiology, 29, 104--119.",
      "doi": ""
    },
    {
      "text": "Onton, J., Delorme, A., &amp; Makeig, S. (2005). Frontal midline dynamics during working memory. Neuroimage, 27, 341--356.",
      "doi": ""
    },
    {
      "text": "Owen, A.M., McMillan, K.M., Laird, A.R., &amp; Bullmore, E. (2005). N-back working memory paradigm: A meta-analysis of normative functional neuroimaging studies. Human Brain Mapping, 25, 46--59.",
      "doi": ""
    },
    {
      "text": "Palaniappan, R. (2005). Brain computer interface design using band powers extracted during mental tasks. Proceedings of the 2nd International IEEE EMBS Conference on Neural Engineering, 321--324.",
      "doi": ""
    },
    {
      "text": "Picard, R. (2000). Affective Computing. MIT Press: Cambridge. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Picton, T.W., Bentin, P., Berg, P., Hillyard, S.A., Johnson, J.R., Miller, G.A., et al. (2000). Guidelines for using human event-related potentials to study cognition: Recording standards and publication criteria. Psychophysiology, 37, 127--152.",
      "doi": ""
    },
    {
      "text": "Piolat, A., Olive, T., Roussey, J., Thunin, O., &amp; Ziegler, J.C. (1999). SCRIPTKELL: A tool for measuring cognitive effort and time processing in writing and other complex cognitive activities. Behavior Research Methods, Instruments, &amp; Computers, 31(1), 113--121.",
      "doi": ""
    },
    {
      "text": "Pleydell-Pearce, C.W., Whitecross, S.E., &amp; Dickson, B.T. (2003). Multivariate analysis of EEG: Predicting cognition on the basis of frequency decomposition, inter-electrode correlation, coherence, cross phase and cross power. Hawaii International Conference on System Sciences, 11--20. ",
      "doi": "10.5555/820752.821575"
    },
    {
      "text": "Prinzel, L.J., Pope, A.T., Freeman, F.G., Scerbo, M.W., &amp; Mikulka, P.J. (2001). Empirical analysis of EEG and ERPs for psychophysiological adaptive task allocation. NASA Technical Report TM-2001-211016. ",
      "doi": "10.5555/886462"
    },
    {
      "text": "Rossion, B., &amp; Pourtois, G. (2004). Revisiting Snodgrass and Vanderwart's object set: The role of surface detail in basic-level object recognition. Perception, 33, 217--236.",
      "doi": ""
    },
    {
      "text": "Smith, M.E., Gevins, A., Brown, H., Karnik, A., &amp; Du, R. (2001). Monitoring task loading with multivariate EEG measures during complex forms of human-computer interaction. Human Factors, 43(3), 366--380.",
      "doi": ""
    },
    {
      "text": "Velichkovsky, B., &amp; Hansen, J.P. (1996). New technological windows into mind: There is more in eyes and brains for human-computer interaction. Proceedings of the SIGCHI 1996 Conference on Human Factors in Computing Systems, 496--503.  ",
      "doi": "10.1145/238386.238619"
    }
  ]
}