{
  "doi": "10.1145/1357054.1357337",
  "title": "SuperBreak: using interactivity to enhance ergonomic typing breaks",
  "published": "2008-04-06",
  "proctitle": "CHI '08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1817-1826",
  "year": 2008,
  "badges": [],
  "abstract": "Repetitive strain injuries and ergonomics concerns have become increasingly significant health issues as a growing number of individuals frequently use computers for long periods of time. Currently, limited software mechanisms exist for managing ergonomics; the most well-known are \"break-reminder\" packages that schedule and recommend typing breaks. Yet despite the proven benefits of taking breaks, such packages are rarely adopted due to the over-head of introducing periodic interruptions into a user's workflow. In this paper, we describe SuperBreak, a break-reminder package that provides hands-free interactions during breaks, with the goal of encouraging users to take more breaks and enhancing the benefits of those breaks. In a field study of 26 knowledge workers, 85% preferred SuperBreak over a traditional break-reminder system, and on average participants took a higher percentage of the interactive breaks suggested to them. Our results highlight the value of interactivity for improving the adoption and retention of ergonomic break practices.",
  "tags": [
    "rsi",
    "physical interfaces",
    "interruptions",
    "ergonomics"
  ],
  "authors": [
    {
      "name": "Dan Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81405594249/rel-imgonly/dan_bass_brightened.jpg",
      "acmid": "81405594249",
      "orcid": "missing"
    },
    {
      "name": "A.J. Bernheim Brush",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81332491415/rel-imgonly/ajbrushlarge.jpg",
      "acmid": "81332491415",
      "orcid": "missing"
    },
    {
      "name": "Brian R. Meyers",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100591949",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balci, R., Aghazadeh, F. 2004. Effects of exercise breaks on performance, muscular load, and perceived discomfort in data entry and cognitive tasks. Comput. Ind Eng. 46, 3 (Jun. 2004).  ",
      "doi": "10.1016/j.cie.2004.01.003"
    },
    {
      "text": "Barredo, R. Mahon, K. The Effects of Exercise and Rest Breaks on Musculoskeletal Discomfort during Computer Tasks: An Evidence Based Perspective, Journal of Physical Therapy Science, Vol. 19, 2007.",
      "doi": ""
    },
    {
      "text": "Bianchi-Berthouze, N. Kim,W., Darshak,P. Does Body Movement Engage You More in Digital Game Play? And Why? Affective Computing and Intelligent Interaction, Springer, LNCS 4738, 102--113  ",
      "doi": "10.1007/978-3-540-74889-2_10"
    },
    {
      "text": "Breazeal C, Wang A, Picard R. Experiments with a Robotic Computer: Body, Affect, and Cognition Interactions. 2nd Intl Conf on Human-Robot Interaction, 2007.  ",
      "doi": "10.1145/1228716.1228737"
    },
    {
      "text": "Consolvo, S., Everitt, K., Smith, I., Landay, J. A. 2006. Design requirements for technologies that encourage physical activity. Proc CHI 2006.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Dunne, L.E., Walsh, P., Smyth, B., Caulfield, B. Design and Evaluation of a Wearable Optical Sensor for Monitoring Seated Spinal Posture. Proc 10th Intl Symp on Wearable Computers, 2006.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Persuasive Technology: Using Computers to Change What We Think and Do, San Francisco, CA: Morgan Kaufmann Publishers, 2003. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Hedge, A., Evans, S. J. (2001): Ergonomic Management Software and Work Performance: An Evaluative Study. Cornell University Technical Report/RP 2501.",
      "doi": ""
    },
    {
      "text": "Henning, R.A., Jacques, P., Kissel, G.V., Sullivan, A.B., Alteras-Webb, S.M. Frequent short rest breaks from computer work: effects on productivity and well-being at two field sites. Ergonomics 40(1) (1997).",
      "doi": ""
    },
    {
      "text": "Horvitz, E., Apacible, J., Koch, P. BusyBody: Creating and Fielding Personalized Models of the Cost of Interruption. Proc CSCW 2004.  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Horvitz, E., Apacible, J. Learning and Reasoning about Interruption, Proc. ICMI 2003.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Lin, J., Mamykina, L., Lindtner, S., Delajoux, G., Strub H.B. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. Proc UbiComp 2006.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Lo, J-L., Lin, T-Y., Chu, H-h., Chou, H-C., Chen, J-h., Hsu, J., Huang, P. Playful Tray: Adopting Ubicomp and Persuasive Techniques into Play-Based Occupational Therapy for Reducing Poor Eating Behavior in Young Children. Proc UbiComp 2007. ",
      "doi": "10.5555/1771592.1771595"
    },
    {
      "text": "McLean, L., Tingley, M., Scott, R.N., and Rickards, J. Computer terminal work and the benefits of micro-breaks. Applied Ergonomics 32(3) (2001).",
      "doi": ""
    },
    {
      "text": "Monsey, M., Ioffe, I., Beatini, A., Lukey, B., Santiago, A., James A.B. Increasing compliance with stretch breaks in computer users through reminder software. Work; 2003, Vol. 21.2.",
      "doi": ""
    },
    {
      "text": "National Academy of Science. Musculoskeletal Disorders and the Workplace: Low Back and Upper Extremities. National Academy Press (2001).",
      "doi": ""
    },
    {
      "text": "OpenCV: http://intel.com/technology/computing/opencv",
      "doi": ""
    },
    {
      "text": "OSHA Ergonomic Solutions: Computer Workstations eTool, Work Process and Recognition: http://osha.gov/SLTC/etools/computerworkstations/workprocess.html, viewed 9/12/2007.",
      "doi": ""
    },
    {
      "text": "Pascarelli, E. Complete Guide to Repetitive Strain Injury, Wiley &amp; Sons, 2004.",
      "doi": ""
    },
    {
      "text": "Saltzman, A. Computer user perception of the effectiveness of exercise mini-breaks, Proc ErgoCon, 1998.",
      "doi": ""
    },
    {
      "text": "Slijper, H., Richter, J., Smeets, J., Frens, M. The effects of pause software on the temporal characteristics of computer use. Ergonomics. 50(2):178--191, 2007.",
      "doi": ""
    }
  ]
}