{
  "doi": "10.1145/57167.57187",
  "title": "Navigating integrated facilities: initiating and terminating interaction sequences",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "121-129",
  "year": 1988,
  "badges": [],
  "abstract": "Human performance data are reported for two dialogue conventions involving menu interactions with integrated facilities. Users prepared material for overhead foils in a six session experiment. An initiation style of dialogue in a flexible menu hierarchy was compared with a strict hierarchy involving explicit termination of dialogue sequences. Although tasks could be performed in the same number of steps with either interface, initiation had greater time and transaction costs than termination. The results are discussed in relation to the trade-offs that need to be considered in designing for navigational flexibility and to requirements for modeling user behavior.",
  "tags": [],
  "authors": [
    {
      "name": "Phil J. Barnard",
      "institution": "MRC Applied Psychology Unit, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469779",
      "orcid": "missing"
    },
    {
      "name": "Allan MacLean",
      "institution": "MRC Applied Psychology Unit, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100609167",
      "orcid": "missing"
    },
    {
      "name": "Michael Wilson",
      "institution": "MRC Applied Psychology Unit, Cambridge, UK",
      "img": "/do/10.1145/contrib-81100531210/rel-imgonly/mdw_head.jpg",
      "acmid": "81100531210",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barnard,P. Cognitive resources and the learning of human-computer dialogs. In J.M. Carroll (ed) Interfacing Thought: Cognitive aspects of h~tman-comp~ter interaction, Cambridge: MIT Press, 1987, 112-158. ",
      "doi": "10.5555/28446.28452"
    },
    {
      "text": "Card,S. &amp; Henderson,A. A multiple virtualworkspace interface to support user task switching. In Proceedings of CHI+ GI 1987. (Toronto, April 5-9). ACM, New York, 1987, 53-59.  ",
      "doi": "10.1145/29933.30860"
    },
    {
      "text": "Carroll,J M. &amp; Carr{thers,C. Training Wheels in a user interface. Communications of the ACM, 27, 1984, 800-806.  ",
      "doi": "10.1145/358198.358218"
    },
    {
      "text": "Furnas,G. Generalized Fisheye Views. In Proceedings of CHI ~6 Human Factors in Computing Systems. ACM, New York, 1986, 19-23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "MacLean,A., Barnard,P. &amp; Wilson,M. Rapid Prototyping of Dialogue for Human Factors Research: the EASIE approach. In M. Harrison &amp; A. Monk (eds), People and Computers: Designing for usability, CUP, Cambridge, 1986, 180-195. ",
      "doi": "10.5555/17324.24084"
    },
    {
      "text": "Norman,D. Design Principles for Human- Computer Interaction. In Proceedings of UHI 83, Human Factors in Computing Systems. ACM, New York, 1983, 1-10.  ",
      "doi": "10.1145/800045.801571"
    },
    {
      "text": "Norman,D. Cognitive Engineering - Cognitive Science. In j.M.Carroll (ed). interfacing Thought: Cognitive aspects of human-computer interaction. MIT Press, Cambridge Mass, 1987, 325-336. ",
      "doi": "10.5555/28446.28458"
    },
    {
      "text": "Wilson,M., Barnard,P. &amp; MacLean,A. Analysing the learning of command sequences in a menu system. In P.Johnson &amp; S.Cook (eds), People and Computers: Designing the interface. CUP, Cambridge, 1985, 63-75.",
      "doi": ""
    }
  ]
}