{
  "doi": "10.1145/57167.57180",
  "title": "The design of auditory interfaces for visually disabled users",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "83-88",
  "year": 1988,
  "badges": [],
  "abstract": "Recent developments in the design of human-machine interfaces have resulted in interfaces which make access to computer-based equipment more difficult for visually disabled people. The aim of this project was to explore whether it is possible to adapt such interfaces so as to make them usable by people who cannot see a screen. The approach adopted was based upon two principles: the replacement of visual interface entities by auditory analogues and appropriately constraining the resultant interface. Two forms of sound were used to embody the auditory interface: musical tones and synthetic speech. In order to test the principles a word processing program was implemented which demonstrated that a visual program might be adapted to be accessed through such an interface.",
  "tags": [],
  "authors": [
    {
      "name": "Alistair D. N. Edwards",
      "institution": "Open Univ., Milton Keynes, UK",
      "img": "/do/10.1145/contrib-81100595975/rel-imgonly/alistair1.jpg",
      "acmid": "81100595975",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bly, S., Sound and computer information presentation, PhD Thesis, University of California, Davis, California, USA, (1982) (Also published as Lawrence Livermore Laboratory report UCRL- 53282). ",
      "doi": "10.5555/910376"
    },
    {
      "text": "Edwards, A. D. N., Adapting user interfaces for visually disabled users, PhD Thesis, the Open University, UK, (1987).",
      "doi": ""
    },
    {
      "text": "Fitts, P. M., The information capacity of the human motor system in controlling the amplitude of movement, Journal of Experimental Psychology, 47, 6, pp381-391, (1954).",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Auditory icons: using sound in computer interfaces, (to appear in) Human-Computer Interaction, (1.987-8).",
      "doi": ""
    },
    {
      "text": "Miller, G. A.:. The magical number seven, plus or minus two: some limits on our capacity for processing information, Psychological Review, 63, 2, pp.81-97, (1956).",
      "doi": ""
    },
    {
      "text": "Scadden, L. A., Blindness in the information age: equality or irony? Journal of Visual Impairment and Blindness, (November 1984).",
      "doi": ""
    },
    {
      "text": "Sumikawa D. A, Blattner, M. M., Joy, K. I. and Greenberg, R. M., Guidelines for the syntactic design of audio cues in computer interfaces, Proceedings of the Nineteenth Annual Hawaii International Conference on System Sciences, (Honolulu, Hawaii), (1986).",
      "doi": ""
    },
    {
      "text": "Sumikawa D. A, Blattner, M. M. and Greenberg, R. M., Earcons: structured audio messages, (submitted for publication 1986).",
      "doi": ""
    },
    {
      "text": "Zachmann, W. F., A Look into the Near Future - 13 Predictions for the World's Computer Industry, International Data Corporation, Framingham, MA. (1987).",
      "doi": ""
    }
  ]
}