{
  "doi": "10.1145/57167.57211",
  "title": "Control of cognitive processes during software design: what tools are needed?",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "263-268",
  "year": 1988,
  "badges": [],
  "abstract": "A verbal protocol study of professional software designers has revealed three design process control strategies. At least one of them, the generation of opportunistic solutions at different levels of detail accompanied by problem domain modeling, had not been observed in previous empirical studies nor had been acknowledged in the software engineering practices. Specific breakdowns (difficulties) were associated with the different design process control strategies. Software tools should be provided to designers to alleviate these breakdowns. Parts of a cognitive model of software design, based on distributed control from specialists such as design schemas, design heuristics, and design methods, are presented to account for the observed control strategies.",
  "authors": [
    {
      "name": "R. Guindon",
      "institution": "Microelectronics and Computer Technology Corporation, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329489045",
      "orcid": "missing"
    },
    {
      "name": "B. Curtis",
      "institution": "Microelectronics and Computer Technology Corporation, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332495004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, B. and Soloway, E. A cognitive model of software design. Technical Report 342. Department of Computer Sctence, Yale University, 1984.",
      "doi": ""
    },
    {
      "text": "Adelson, B. and Solowax, E. The role of domain experience in software design. IEEE Transactions on Software Engineering 11, 11 (1985).  ",
      "doi": "10.1109/TSE.1985.231883"
    },
    {
      "text": "Anderson, J.R. The Architecture Of Cognition. Cambridge, MA: Harvard University Press, 1983. ",
      "doi": "10.5555/538901"
    },
    {
      "text": "Belady, L. Mcc: Planning the Revolution in Software. 1EEE Software 2, 6 (1985).",
      "doi": ""
    },
    {
      "text": "Conklin, J., &amp; Begeman, M. glBI_S: A hypertext tool for team design deh'beration. MCC Technical Report STP-016-88, 1988.",
      "doi": ""
    },
    {
      "text": "Conklin, J., &amp; Begeman, M. glBIS: A hypertext tool for team design deliberation. Proceedings blY the Hypertext 87 Conference, Nov. 87, Chapel Hill, North Carolina.  ",
      "doi": "10.1145/317426.317444"
    },
    {
      "text": "Darke, J. The primary generator and the design process. In Nigel Cross (Eft.), Developments in Design Methodology. New York: Wiley &amp; Sons, 1984.",
      "doi": ""
    },
    {
      "text": "diSessa, A.A. Phenomenology and the evolution of intuition. In D. Gentner and A.L. Stevens, Mental Models. Hillsdale, N.J.: Erlbaum, 1983, pp. 15-34.",
      "doi": ""
    },
    {
      "text": "Egan, D.E., &amp; Schwartz, B.J. Chunking in recall of symbolic drawings. Memory and Cognition 7., 2 (1979), 149-158.",
      "doi": ""
    },
    {
      "text": "Guindon, R. A model of cognitive processes in software design: An analysis Of breakdowns in early design activities by individuals. MCC Technical Report STP-283-87, 1987.",
      "doi": ""
    },
    {
      "text": "Guindon, R., Krasner, H. and Cmtis, B. Breakdown and ~ rocesses during the early activities of software design y professionals. In G. Olson, E. Soloway, and S. Sheppard {Eds.), Empirical Studies of_ Programmers- Second Workshop. Ablex Publishing, 1987. ",
      "doi": "10.5555/54968.54973"
    },
    {
      "text": "Hayes-Roth, B. and Hayes-Roth, F. A cognitive model of planning. Cognitive Science 3, 4 (1979), 275-310.",
      "doi": ""
    },
    {
      "text": "Jackson, M. System Development. Englewood Cliffs, N.J.: Prentice Hall, 1983.",
      "doi": ""
    },
    {
      "text": "Jeffries, R., Turner, A.A., Polson, P. and Atwood, M.E. The processes involved in designing software, in J.R. Anderson (Ed.), Cognitive Skills and Their Acquisition. Hillsdale, N.J.: Erlbaum, 1981, pp. 225-283.",
      "doi": ""
    },
    {
      "text": "Jones, J.C. Design Methods. New York: John Wiley &amp; Sons, 1980.",
      "doi": ""
    },
    {
      "text": "Kant, E. and Newell, A. Problem solving techniques for the design of algorithms. Information Processing and Management 28, 1 (1984), 97-118.",
      "doi": ""
    },
    {
      "text": "Kolodner, J.L. Towards and understanding of the role of experience in the evolution from novice to expert. International Journal of Man-Machine Studies 19, (1983),497-518.",
      "doi": ""
    },
    {
      "text": "Lubars, M.D. and Harandi, M.T. Addressing software reuse through knowledge-based design. MCC Technical Report Number STP-058-88, Febrm~y 1988.",
      "doi": ""
    },
    {
      "text": "McKeithen, K.B., Reitman, J.S., Reuter, H.H.. &amp; Hirtle, S.C. Knowledge Organization and Skill Differences in Computer Programmers. Cognitive Psycl~91ogy 13, (198I).",
      "doi": ""
    },
    {
      "text": "Schoenfetd, A.H. Mathematical Problem Solving. Academic Press, 1985.",
      "doi": ""
    },
    {
      "text": "Tong, C. Knowledge-Based Circuit Design. Ph.D. Dissertation, Department of Computer Science, Stanford University, 1987. ",
      "doi": "10.5555/914525"
    },
    {
      "text": "Ullman, D.G., Stauffer, L.A. and Dietterich, T.G. Preliminary results of an experimental study on the mechanical design process. Technical Report 86-30-9. Oregon State Umversity, Corvallis, Oregon, 1986.",
      "doi": ""
    }
  ]
}