{
  "doi": "10.1145/57167.57177",
  "title": "A case study of CSCW in a dispersed organization",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "61-66",
  "year": 1988,
  "badges": [],
  "abstract": "Pacific Bell conducted a trial of The Coordinator, a tool for computer-supported cooperative work. The trial group had diverse job functions and was dispersed across a variety of geographical locations and computing environments. The trial attempted to both measure the effectiveness of The Coordinator as a communications tool and to evaluate the speech act communications paradigm on which it is based. Only the first of these two goals was realized. Changes in subjects' cognition were assessed using a series of semantic differential scales. One negative cognitive shift was supported by the data. However, the anecdotal evidence was far more negative, suggesting that the experimental methodology be enhanced to include measurement of affective dimensions of group dynamics. Implementation and support for cooperative work systems were found to be more difficult than anticipated. The test group was not convinced that The Coordinator offered functionality that was worth the effort involved in learning to use the product. An improved interface, more flexible terminology, and better implementation support is needed for successful installation of The Coordinator, or similar products.",
  "authors": [
    {
      "name": "R. P. Carasik",
      "institution": "Pacific Bell, San Ramon, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546682556",
      "orcid": "missing"
    },
    {
      "name": "C. E. Grantham",
      "institution": "Pacific Bell, San Ramon, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100174948",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Austin (1962). How To Do Things With Words. Clarendon Press, Oxford.",
      "doi": ""
    },
    {
      "text": "Baroudi,J.J.,M.H. OlsonandB. Ives, (1986) \"An Empirical Study of the Impact of User Involvement and System Usage and Information Satisfaction\", Communications of the ACM, 29(3), 232-238.  ",
      "doi": "10.1145/5666.5669"
    },
    {
      "text": "Conrath, David, and James H. Bair (1974). \"The Computer as an Interpersonal Communication Device: A Study of Augmentation Technology and its Apparent Impact on Organizational Communication\". Proceedings Second International Conference on Computer Communications., Stockholm.",
      "doi": ""
    },
    {
      "text": "Flores, Femando (1982). Management andCommunication in the Office of the Future. Logonet, Berkeley.",
      "doi": ""
    },
    {
      "text": "Flores, Fernando, andTerry Winograd. Understanding Computers and Cognition. Ablex, Norwood, New Jersey, 1986.",
      "doi": ""
    },
    {
      "text": "Goffman, E. Presentation of Self in Everyday Life. Doubleday, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Grantham, C.E., Social Networks and Marital Interaction, 21st Century, Palo Alto, 1982.",
      "doi": ""
    },
    {
      "text": "arid J.J. Vaske, Predicting the Usage of an Advanced Communications Technology, (1985). Behavior and Information Technology. 4(4): 327-336.",
      "doi": ""
    },
    {
      "text": "Johnson, Bonnie, Margrethe Olson and Geraldine Weaver. Using A Computer-Based Tool To Support Collaboration: A Field Experiment (1986). MCC Conference on Computer-Supported Cooperative Work. Austin, December 1986.  ",
      "doi": "10.1145/637069.637114"
    },
    {
      "text": "Kemper, T. D. (1978). Toward a Sociology of Emotions: Some Problems and Some Solutions. The American Sociologist. 13, 30-41.",
      "doi": ""
    },
    {
      "text": "Meeker, Barbara,\"Decision andExchange.'\" American Sociological Review, V. 36, pp. 485-495, 1971.",
      "doi": ""
    },
    {
      "text": "Myers, I. (1962). Manual: The Myers-Briggs Type Indicator. Palo Alto, California. Consulting Psychologists Press.",
      "doi": ""
    },
    {
      "text": "Osgood, C.E., G.J. Suci, and P.H. Tannenbaum. (1957). The Measurement of Meaning. University of Illinois Press, Urbana.",
      "doi": ""
    },
    {
      "text": "Rouse, William B. and Nancy M. Morris (1986). \"Understanding and Enhancing User Acceptance of Computer Technology\". IEEE Transactions on System, Man, &amp; Cybernetics. Vol. 16(6), Nov-Dec.  ",
      "doi": "10.1109/TSMC.1986.4309014"
    },
    {
      "text": "Scheff, T., (1986), \"Micro-Linguistics and Social Structure: A Theory of Social Action\", Sociological Theory, 4, pp.71-83.",
      "doi": ""
    },
    {
      "text": "Schmeideck, R.A., (1978), The Personal Sphere Model, New York, Grune and Stratton.",
      "doi": ""
    },
    {
      "text": "Sproull, Lee and Sara Kiesler(1986). Reducing Social Context Cues: Electronic Mail in Organizational Communication. Management Science, November 1986.  ",
      "doi": "10.5555/8419.8428"
    },
    {
      "text": "Vaske, J.j. and Grantham, C.E.(1987), Socializing the Human Computer Environment. Ablex, Norwood, New Jersey. ",
      "doi": "10.5555/77659"
    },
    {
      "text": "Winograd, Terry. \"A Language/Action Perspective on the Design of Cooperative Work\"Report STAN-CS-87- 1158. Center for the Study of Language and Information, Stanford University, May 1987.",
      "doi": ""
    }
  ]
}