{
  "doi": "10.1145/57167.57168",
  "title": "Grasping reality through illusion—interactive graphics serving science",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 1988,
  "badges": [],
  "abstract": "I treat three related subjects: virtual-worlds research—the construction of real-time 3-D illusions by computer graphics; some observations about interfaces to virtual worlds; and the coming application of virtual-worlds techniques to the enhancement of scientific computing.\nWe need to design generalized interfaces for visualizing, exploring, and steering scientific computations. Our interfaces must be direct-manipulation, not command-string; interactive, not batch; 3-D, not 2-D; multisensory, not just visual.\nWe need generalized research results for 3-D interactive interfaces. More is known than gets reported, because of a reluctance to share “unproven” results. I propose a shells-of-certainty model for such knowledge.",
  "authors": [
    {
      "name": "F. P. Brooks",
      "institution": "Univ. of North Carolina, Chapel Hill, NC",
      "img": "/do/10.1145/contrib-81100077256/rel-imgonly/frederick_brooks.jpg",
      "acmid": "81100077256",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bergman, L., Fuchs, H., Grant, E., Spach, S. {1986} Image rendering by adaptive refinement. Computer Graphics: Proceesings of SIGGRAPH \"86, 20, 34 (August), 221-240.  ",
      "doi": "10.1145/15922.15889"
    },
    {
      "text": "Britton, E.G. {1977} A methodology for ergonomic design of interactive computer graphics systems, as applied to crystallography. Ph.D. dissertation, Universtity of North Carolina, Chapel Hill. ",
      "doi": "10.5555/908596"
    },
    {
      "text": "Britton, E., Lipscomb, J.S., Pique, M., Wright, W.V., and Brooks, Jr., F.P. {1981} The GRIP-75 man-machine interface. Videotape presented at SIGGRAPH Conference.",
      "doi": ""
    },
    {
      "text": "Brooks, Jr., F.P. {1977} The computer \"scientist\" as toolsmith: studies in interactive computer graphics. In Information Processing 77 (Toronto). North-Holland, Amsterdam, pp. 625-634.",
      "doi": ""
    },
    {
      "text": "Brooks, Jr., F.P. {1986} Walkthrough---a dynamic graphics system for simulating virtual buildings. In 1986 Workshop on Interactive 3-D Graphics (Chapel Hill).  ",
      "doi": "10.1145/319120.319122"
    },
    {
      "text": "Fuchs, H., Duran, J., and Johnson, B. {1977} A system for automatic acquisition of three-dimensional data. In National Computer Conference, 49-53.",
      "doi": ""
    },
    {
      "text": "Fuchs, H., Pizer, S.M., Heinz, E.R., Tsai, L.C., and Bloomberg, S.H. {1982} Adding a true 3D display to a raster graphics system. In IEEE Computer Graphics and Applications 2, 7 (September), 73-78.",
      "doi": "10.1109/MCG.1982.1674422"
    },
    {
      "text": "Fuchs, H. and Abram, G.D. {1985} Specialized computer organization fo;r raster-graphics display. In Algorithmically-specialized Parallel Computers, edited by L. Snyder, L.H. Jal~ieson, D.B. Gannon, and H.J. Siegel. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Fuchs, H., Gold feather, J., Hulquist, J.P., Spach, S., Austin, J.D., Brooks, Jr., F.P., Eyles, J.G., and Poulton, J. {19',35} Fast spheres, shadows, textures, transparencies, and image enhancement in Pixel Planes. Computer Graphics 19, 3 (July), 111-120.  ",
      "doi": "10.1145/325165.325205"
    },
    {
      "text": "Goldfeather, J.~ Molnar, S., Turk, G., and Fuchs, H. {1988} Near real-time CSG rendering using tre Normalization and geometric pruning. UNC Technical Report.",
      "doi": ""
    },
    {
      "text": "Hamming, R.W. {1962} Numerical Methods for Scientists and Engineers. New York: McGraw-Hill. ",
      "doi": "10.5555/19316"
    },
    {
      "text": "Harris, M.R. {1988} An introduction to reciprocal space modeling and rspace. UNC Technical Report.",
      "doi": ""
    },
    {
      "text": "Hobgood, Jr., William S. {1970} A 3-D computer graphics display using a varifocal mirror. M.S. thesis, UNC. ",
      "doi": "10.5555/904136"
    },
    {
      "text": "Holloway, R.L. {1987} Head-mounted display technical report. UNC Technical Report.",
      "doi": ""
    },
    {
      "text": "Holmes, David H. {1985} Three-dimensional depth perception enhancement by dynamic lighting. M.S. thesis, UNC.",
      "doi": ""
    },
    {
      "text": "Kilpatrick, P.J. {1976} The use of a kinesthetic supplement in an interactive graphics system. Ph.D. dissertation, University of North Carolina, Chapel Hill. ",
      "doi": "10.5555/907929"
    },
    {
      "text": "Lipscomb, J.S. {1981} Three-dimensional cues for a molecular computer graphics system. Ph.D. dissertation, University of North Carolina, Chapel Hill. ",
      "doi": "10.5555/910155"
    },
    {
      "text": "Lipscomb, J.S. and Brooks, Jr., F.P. {1981} The GRIP- 75 man-machine interface (videotape). I{nACM SIGGRAPH Video Review, 4 (August).",
      "doi": ""
    },
    {
      "text": "McCormick, B.H., DeFanti, T.A., and Brown, M.D., eds. {1987} Visualization in Scientific Computing. Report of the NSF Advisory Panel on Graphics, image Processing and Workstations.",
      "doi": ""
    },
    {
      "text": "Ming, O.Y., Pique, M., Hughes, J., Brooks, Jr., F.P. {1988} Using a :manipulator for force display in molecular docking. IEEE Robotics and Automation Conference.",
      "doi": ""
    },
    {
      "text": "Palmer, T.C. {1987} Docktool: a dynamically interactive raster graphics visualization for the molecular docking problem. M.S. thesis, UNC.",
      "doi": ""
    },
    {
      "text": "Pique, M., Richardson, J.S., and Brooks, Jr., F.P. {1982} What does a protein look like? Videotape presented at SIGGRAPH Conference.",
      "doi": ""
    },
    {
      "text": "Pique, M. {1982-83} Fast 3-D display of space-filling molecular models (videotape). In SIGGRAPH Video Review 6 (October, 1982), 10 (October, 1983).",
      "doi": ""
    },
    {
      "text": "Pique, M. and Brooks, Jr., F.P. {1985} Computer graphics for molecular modeling. In Molecular Dynamics in Protein Structure Edited by J, Hermans.",
      "doi": ""
    },
    {
      "text": "Pizer, S.M., Fuchs, H., Mosher, C., Lifshitz, L., Abram, G.D.,Ramanathan, S., Whitney, B.T., Rosenman, J.G., Stabb, E.V., Chaney, E.L., and Sherouse, G. {1986} 3D shaded graphics in radiotherapy and diagnostic imaging. In Computer Graphics Proceedings, 107-113",
      "doi": ""
    },
    {
      "text": "Richardson, D.C. {1977} Three-dimensional Structure of Cu, Zn, Superoxide Dismutase. Superoxide and Superoxide Dismutases. Edited by A.M. Michelson,",
      "doi": ""
    },
    {
      "text": "J.M. McCord, and I. Fridovich. New York: Academic Press, 1977",
      "doi": ""
    },
    {
      "text": "Sutherland, I.E. {1965} The ultimate display. Proceedings oflFIP 65, vol. 2, pp. 506-508, 582-583.",
      "doi": ""
    },
    {
      "text": "Toet, A., Koenderink, J.J., Pizer, S.M., Helmink, L. {1986} A multiresolution image segmentation algorith based on a topological description of image structure. First Quinquennial Review, Utrecht.",
      "doi": ""
    },
    {
      "text": "Tsernoglou, D. and Petsko, G.A. {1977} Threedimensional-structure of neurotoxin a from venom of the Philippines sea snake. In Proc. National Academy of Sciences USA 74, 3 (March), 971-974.",
      "doi": ""
    },
    {
      "text": "Tsernoglou, D., Petsko, G.A., McQueen, Jr., J.E., and Hermans, J. {1977} Molecular graphics: application to the structure determination of a snake venom neurotoxin. Science 197, 4311 (30 September), 1378-1381.",
      "doi": ""
    },
    {
      "text": "Williams, T.V. {1982} A man-machine interface for interpreting electron-density maps. Ph.D. dissertation, University of North Carolina, Chapel Hill. ",
      "doi": "10.5555/910784"
    }
  ]
}