{
  "doi": "10.1145/57167.57191",
  "title": "A general user modelling facility",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "145-150",
  "year": 1988,
  "badges": [],
  "abstract": "An important component of adaptable interactive systems is the ability to model the system's users. Previous systems have relied on user models tailored to the particular needs of that system alone. This paper presents the notion of a general user model, and describes some of our research on building a general user modelling facility that could be used by a variety of applications. This work focuses on the representation, maintenance, and acquisition issues of modelling long-term beliefs of the user, and describes a general facility for accomplishing these tasks.",
  "authors": [
    {
      "name": "R. Kass",
      "institution": "Univ. of Pennsylvania, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100214959",
      "orcid": "missing"
    },
    {
      "name": "T. Finin",
      "institution": "Unisys Corporation, Paoli, PA",
      "img": "/do/10.1145/contrib-81100529754/rel-imgonly/81100529754.jpg",
      "acmid": "81100529754",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. F. Alien and C. R. Perrault. Analyzing intention in utterances. Artificial Intelligence, 15:143-178, 1980.",
      "doi": ""
    },
    {
      "text": "J. R. Anderson, C. F. Boyle, and B. J. Reiser. intelligent tutoring systems. Science, 228:456--462, 1985.",
      "doi": ""
    },
    {
      "text": "R. J. Brachman and J. G. Schmolze. An overview of the KL-ONE knowledge representation system. Cognitive Science, 9:171-216, 1985.",
      "doi": ""
    },
    {
      "text": "j. S. Brown and R. R. Burton. Diagnostic models for procedural bugs in basic mathematical skills. Cognitive Science, 2:155-192, 1978.",
      "doi": ""
    },
    {
      "text": "T. Finin. GUMS--a general user modelling shell. In A. Kobsa and W. Wahlster, editors, User Models in Dialog Systems, Springer Verlag, Berlin--New York, 1988.",
      "doi": ""
    },
    {
      "text": "T. Finin. Providing help and advice in task oriented systems. In 8th International Conference on Artificial Intelligence, pages 176--178, 1983.",
      "doi": ""
    },
    {
      "text": "T. Finin and D, Drager. GUMS1: a general user modelling system. In Proceedings of the 1986 Conference of the Canadian Society for Computational Studies of Intelligence, pages 24-30, 1986.",
      "doi": ""
    },
    {
      "text": "H. P. Grice. Logic and conversation. In P. Cole and J. L. Morgan, editors, Syntax and Semantics, Academic Press, New York, 1975.",
      "doi": ""
    },
    {
      "text": "R. Kass. Implicit Acquisition of User Models in Cooperative Advisory Systems. Technical Report MS- CIS-87-05, Department of Computer and Information Science, University of Pennsylvania, 1987.",
      "doi": ""
    },
    {
      "text": "R. Kass. Modelling User Beliefs for Good Explanation. Technical Report MS-CIS-87-77, Department of Computer and Information Science, University of Pennsylvania, 1987. Submitted to the 26th Meeting of the Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "R. Kass. Student modelling in intelligent tutoring systems--implications for user modelling. In A. Kobsa and W. Wahlster, editors, User Models in Dialog Systems, Springer Verlag, Berlin--New York, 1988.",
      "doi": ""
    },
    {
      "text": "R. Kass and T. Finin. General User Modelling: A Iracility to Support intelligent interaction. Technical Report MS-CIS-87-78, Department of Computer and Information Science, University of Pennsylvania, 1987.",
      "doi": ""
    },
    {
      "text": "R. Kass and T. Finin. The Need for User Models in Generating Expert System Explanations. Technical Report MS-CIS-87-83, Department of Computer and Information Science, University of Pennsylvania, 1987.",
      "doi": ""
    },
    {
      "text": "R. Kass and T. Finin. Rules for the implicit acquisition of knowledge about the user. in Proceedings of the 6th National Conference on Artificial intelligence, pages 295-300, 1987.",
      "doi": ""
    },
    {
      "text": "R. Kass and T. Finin. User models in inte.lligent interfaces: why they are needed, problems with their implemenu~tion. In B. Neches and T. Kaczmarek, editors, AAAI-86 Workshop on Intelligent Interfaces, 1986.",
      "doi": ""
    },
    {
      "text": "J. McCarlLhy. Circumscription - a form of non-monotonic reasoning. Artificial intelligence, 13(1):27-40, 1980.",
      "doi": "10.1016/0004-3702%2880%2990011-9"
    },
    {
      "text": "K. F. McCoy. Reasoning on a highlighted user model to respond to misconceptions. Computational Linguistics, Special Issue on User Modelling, 1988. ",
      "doi": "10.5555/58914.58919"
    },
    {
      "text": "K. R. McKeown. Tailoring explanations for the user. In 9th International Conference on Artificial Intelligence, pages 794-798, 1985.",
      "doi": ""
    },
    {
      "text": "C. L. Paris. Tailoring object descriptions Io a user's level of expertise. Computational Linguistics, Special Issue on User Modelling, 1988. ",
      "doi": "10.5555/58914.58918"
    },
    {
      "text": "M. E. Pollack. Inferring Domain Plans in Question- Answering. PhD thesis, Department of Computer and Information Science, University of Pennsylvania, 1986. ",
      "doi": "10.5555/15203"
    },
    {
      "text": "R. Reiter. A logic for default reasoning. Artificial Intelligence, 13(1):81-132, 1980.",
      "doi": "10.1016/0004-3702%2880%2990014-4"
    },
    {
      "text": "D. H. Sleeman. UMFE: a user modelling front end subsystem. International Journal of Man-Machine Studies, 23.:71-88, 1985.  ",
      "doi": "10.1016/S0020-7373%2885%2980025-0"
    },
    {
      "text": "D. H. Sleeman and M. J. Smith. Modelling student's problem solving. Artificial Intelligence, 16\" 171-187, 1981.",
      "doi": ""
    },
    {
      "text": "J. W. Wallis and E. H. Shortliffe. CustomiTing explanations using causal knowledge. In B. G. Buchanan and E. H. Shortliffe, editors, Rule-Based Expert Systems, Addison-Wesley, Reading, MA, 1984.",
      "doi": ""
    },
    {
      "text": "R. Wilensky, J. Mayfield, A. Albert, D, N. Chin, C. Cox, M. Luria, J. Martin, and D. Wu. UC - A Progress Report. Technical Report UCB/CSD 87/303, Department of EECS, University of California, Berkeley, 1986. ",
      "doi": "10.5555/894743"
    },
    {
      "text": "A. Y. Zissos and I. H. Witten. User modelling for a computer coach: a case study. Internatior,~al Journal of Man-Machine Studies, 23:729-750, 1985.",
      "doi": ""
    }
  ]
}