{
  "doi": "10.1145/57167.57210",
  "title": "Providing the requisite knowledge via software documentation",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "257-261",
  "year": 1988,
  "badges": [],
  "abstract": "Software documentation should be useful to the programmer trying to understand a program. The key in that sentence was the word should: by and large documentation has a very bad reputation. We have been working on trying to improve documentation, in order that it may realize its potential. In this case study, we examine a programmer's use of documentation constructed along some specific guidelines. These guidelines, developed from our previous studies of documentation, are intended to help programmers draw causal connections between non-contiguous portions of programming plans in the program. This documentation appears to be helpful to a particular class of programmers, i.e., those who come to a program without the requisite background knowledge.",
  "tags": [],
  "authors": [
    {
      "name": "Jeannine Pinto",
      "institution": "Yale Univ., New Haven, CT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342507437",
      "orcid": "missing"
    },
    {
      "name": "Elliot Soloway",
      "institution": "Yale Univ., New Haven, CT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528788",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Letovsky, S., Soloway, E. De-localized Plans and Program Comprehension, IEEE Software (May, 1986).",
      "doi": ""
    },
    {
      "text": "Littman, D., Pinto, J., Letovsky, S., Soloway, E. Mental Models and Software Maintenance. In Empirical Studies of Programmers, Soloway and lyengar, (Eds.). Ablex, Inc., New Jersey, 1986, pp. 80-98. ",
      "doi": "10.5555/21842.28887"
    },
    {
      "text": "Reiss, S. PECAN: Program Development Systems That Support Multiple Views. In Proceedings of the Seventh International Conference on Software Engineering, March, 1984. ",
      "doi": "10.5555/800054.801988"
    },
    {
      "text": "Rich, C. Inspection Methods in Programming. Technical Report AI-TR-604, MIT AI Lab, Cambridge, 1981. ",
      "doi": "10.5555/889191"
    },
    {
      "text": "Shneiderman, B., Sharer, P., Simon, R., Weldon, L. Display Strategies for Program Browsing: Concepts and Experiment. IEEE Software (May, 1986).",
      "doi": "10.1109/MS.1986.233405"
    },
    {
      "text": "Soloway, E., Ehrlich, K. Empirical Studies of Programming Knowledge. IEEE Transactions on Software Engineering (September, 1984).",
      "doi": "10.1109/TSE.1984.5010283"
    },
    {
      "text": "Soloway, E., Pinto, J., Fertig, S., Letovsky, S., Lampert, R., Littman, D., Ewing, K. Studying Software Documentation From A Cognitive Perspective: A Status Report, In Proceedings of the lOth Annual NASA/Goddard Software Engineering Workshop (Greenbelt, MD) 1986.",
      "doi": ""
    }
  ]
}