{
  "doi": "10.1145/57167.57188",
  "title": "Pictures and category labels as navigational aids for catalog browsing",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "127-132",
  "year": 1988,
  "badges": [],
  "abstract": "We describe two experiments that compare the relative utility of pictures, labels, and the combination of both as navigational aids for computerized catalog browsing. The results point to the usefulness of example pictures as search aids in the context of menu traversal through hierarchically structured pictorial databases. We take this outcome to be a reflection of the disambiguating role that pictures can play for verbal category labels.",
  "authors": [
    {
      "name": "C. Egido",
      "institution": "Bell Communications Research, Inc., Morristown, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100130164",
      "orcid": "missing"
    },
    {
      "name": "J. Patterson",
      "institution": "Bell Communications Research, Inc., Morristown, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100562339",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alesandrini, K.L. \"Pictures and Adult Learning.\" Instructional Science, 13, pp.63-77, 1984.",
      "doi": ""
    },
    {
      "text": "Daynes, R. and Butler, B. The Videodi,;c Book. John Wiley &amp; Sons, Inc. New York, 1984.",
      "doi": ""
    },
    {
      "text": "Dumais, S.T. and Landauer, T.K. \"Describing categories of objects for menu retrieval systems.\" Behavior Research Methods, Instruments, and Computers, 16 (2), pp.242-248, 1984.",
      "doi": ""
    },
    {
      "text": "Esser, J.K., Die, A.H., Seholm, K.J., and Pebley, S.R. \"Memory for Brand-Product Information in Pictorial Advertising.\" The Journal of Psychology, 120 (4), 19136.",
      "doi": ""
    },
    {
      "text": "Gunter, B \"Remembering television news: Effects of picture content.\" The Journal of General Psychology, 102, pp.127-133, 1980.",
      "doi": ""
    },
    {
      "text": "Judd, T. and Clayton, R. \"A Still Frame Image Processor for Enhanced Video Browsing.'~ Electronic 1ranging '87, November, 1987, Boston, Mass.",
      "doi": ""
    },
    {
      "text": "Lambert, S. and Ropiequet, S. (eds.) CD ROM: The New Papyrus. Microsoft Library, 1986.",
      "doi": ""
    },
    {
      "text": "Mady, L.A. and Newman, S.E. \"Memory for auditorily and visually presented commercials: Effects of :repetition and type of claim.\" Bulletin of the Psychonomic Society, 25 (2), pp.75-76, 1987.",
      "doi": ""
    },
    {
      "text": "Potter, M.C. and Faulconer, B.A. \"Time to Understand Pictures and Words,\" Nature, 253, pp. 437-438, 1975.",
      "doi": ""
    },
    {
      "text": "Rusted, J. \"Differential Facilitation by Pictures of Children's Retention of Written Texts: A Review.\" Current Psychological Research &amp; Reviews, pp.61- 71, Fall, 1984.",
      "doi": ""
    },
    {
      "text": "Schatz, B. Telesophy: A System for Manipulating the Knowledge of a Community. Proceedbzgs of Globecom 1987. Tokyo, Japan. November, 1987.",
      "doi": ""
    },
    {
      "text": "Schneiderman, B. \"Response Time and Display Rate in Human Performance with Computers.\" Computh~g Surveys, 16 (3), pp.265-285, 1!985.  ",
      "doi": "10.1145/2514.2517"
    },
    {
      "text": "Shepard, R.N. \"Recognition Memory for Words, Sentences., and Pictures.\" Journal of Verbal Learning and Verbal Behavior, 6, pp. 156-163, 1967.",
      "doi": ""
    },
    {
      "text": "Salomon, G.B. Design and bnplementation of an Electronic Special Interest Magazhze. Unpublished Master's thesis, MIT, 1983.",
      "doi": ""
    },
    {
      "text": "Standing, L., Conezio, J., and Haber, R.N. \"Perception and memory for pictures: Single trial /earning of 2560 visual stimuli.\" Psychonomic Science, 19, pp.73-74, 1970.",
      "doi": ""
    }
  ]
}