{
  "doi": "10.1145/57167.57169",
  "title": "Exploratory evaluation of a planar foot-operated cursor-positioning device",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "13-18",
  "year": 1988,
  "badges": [],
  "abstract": "The use of feet instead of hands to perform workstation cursor-positioning and related functions has been the subject of an on-going investigation. In the exploratory study reported here, a particular foot-operated device, the planar slide mole, was assessed against a mouse in a target-selection task. The study showed that novices can learn to select fairly small targets using a mole; for a target size of 1/8″ square, the response time equaled that of the mouse when keyboard homing time was taken into account.",
  "tags": [],
  "authors": [
    {
      "name": "Glenn Pearson",
      "institution": "Univ. of Maryland, College Park",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332520467",
      "orcid": "missing"
    },
    {
      "name": "Mark Weiser",
      "institution": "Univ. of Maryland, College Park",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100068691",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pearson, Glenn, and Weiser, Mark Of Moles and Men: The Design of Foot Controls for Workstations, Human Factors in Computing Systems (Proceedings of CHI ~86 , April 13- 17,~86, Boston, MA), ACM SIGCHI, pp 333-339.  ",
      "doi": "10.1145/22627.22392"
    },
    {
      "text": "Pearson, Glenn, and Weiser, Mark Moles: A Class of Foot-Operated Cursor-Positioning Devices, CS-TR-1658 /UMIACS-TR-86-1 l, Dept. of Comp. Sci., Univ. of Maryland, College Park, MD 20742, Feb. 1986, 41 pp.",
      "doi": ""
    },
    {
      "text": "Brown &amp; Co., Inc, manufacturers, P.O. Box 2443, So. Hamilton, MA 01982.",
      "doi": ""
    },
    {
      "text": "Card,S., Moran,T., and Newell,A. The Keystroke-.Level Model for User Performance Time with Interactive Systems, CACM, 23 (7), 1980, pp. 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card,S., Moran,T., and Newell, A. The Psychology of Human-Computer Interaction, Lawrence Erlbaum Assoc., Hillsdale, NJ, '83. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Pearson, Glenn, and Weiser, Mark Exploratory Evaluations of Two Versions of a Foot-Operated Cursor-Positioning Device in a Target-Selection Task, 1987, submitted.",
      "doi": ""
    },
    {
      "text": "English,W., Engelbart,D., and Berman,M. Display-Selection Techniques for Text Manipulation, IEEE Trans. on Human. Factors in Electronics (now Trans. on Sys., Man, and Cybernetics), HFE-8 (1), March ~67, pp. 5-15.",
      "doi": ""
    },
    {
      "text": "Card S., Engtish,W., and Burr,B. Evaluation of Mouse, Rate-Controlled isometric Joystick, Step Keys, and Text Keys for Text Selection on a CRT, Ergonomics, 21 (8), 1978, pp. 601-613.",
      "doi": ""
    },
    {
      "text": "Card,S., Moran,T., and Newell, A. Computer text-editing: An Information-processing analysis of a routine cognitive skill, Cog, Psych. 12, 1980, pp. 32-74.",
      "doi": ""
    }
  ]
}