{
  "doi": "10.1145/57167.57171",
  "title": "Improving the accuracy of touch screens: an experimental evaluation of three strategies",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "27-32",
  "year": 1988,
  "badges": [],
  "abstract": "A study comparing the speed, accuracy, and user satisfaction of three different touch screen strategies was performed. The purpose of the experiment was to evaluate the merits of the more intricate touch strategies that are possible on touch screens that return a continuous stream of touch data. The results showed that a touch strategy providing continuous feedback until a selection was confirmed had fewer errors than other touch strategies. The implications of the results for touch screens containing small, densely-packed targets were discussed.",
  "authors": [
    {
      "name": "R. L. Potter",
      "institution": "Univ. of Maryland, College Park",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339522972",
      "orcid": "missing"
    },
    {
      "name": "L. J. Weldon",
      "institution": "Essex Community College, Baltimore County, MD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100437361",
      "orcid": "missing"
    },
    {
      "name": "Ben Shneiderman",
      "institution": "Univ. of Maryland, College Park",
      "img": "/do/10.1145/contrib-81100146468/rel-imgonly/shneiderman_2010_032cr2.jpg",
      "acmid": "81100146468",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eller, T. S. Personal communication, 1987.",
      "doi": ""
    },
    {
      "text": "Muratore, D. A. Human Performance Aspects of Cursor Control Devices, MITRE Corporation Working Paper 6321, Houston, Texas, 1987.",
      "doi": ""
    },
    {
      "text": "Murphy, R. A. Evaluation of Methods of Touch Screen Implementation for interactive Computer Displays, Westinghouse Electric Corporation, Baltimore, Maryland, 1986.",
      "doi": ""
    },
    {
      "text": "Ostroff, D. and Shneiderman, B. Selection Devices for Users of an Electronic Encyclopedia: An Empirical Comparison of Four Possibilities. Information Processing and Management. (in press).  ",
      "doi": "10.1016/0306-4573%2888%2990004-0"
    },
    {
      "text": "Pickering, J. A. Touch-sensitive screens: the technologies and their application, International Journal Man.Machine Studies, 25 (1986), 249-269.  ",
      "doi": "10.1016/S0020-7373%2886%2980060-8"
    },
    {
      "text": "Shneiderman, B. Designing the User Interface: Strategies for Effective Human.Cotnputer Interaction. Addison-Wesley, Reading, Mass, 1987. ",
      "doi": "10.5555/6682"
    },
    {
      "text": "Stone, M. D. Touch-Screens for Intuitive Input, PC Magazine, (August 1987), 183-192.",
      "doi": ""
    }
  ]
}