{
  "doi": "10.1145/57167.57179",
  "title": "A grammar-based approach to automatic generation of user-interface dialogues",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "73-78",
  "year": 1988,
  "badges": [],
  "abstract": "An effective user interface requires a dialogue layer that can handle multiple threads of interaction simultaneously. We propose a notation for specifying dialogues based on context-free attributed grammars with two extensions: fork operators for specifying sub-dialogues and context attributes for dispatching tokens. The notation is useful both as a means of communicating the behavior of the dialogue layer to designers and as input to a dialogue compiler that generates program code. In this paper we explain the motivation for our work and provide practical examples of the use of fork and context. In addition, we outline algorithms for parsing and for generating parser tables.",
  "tags": [],
  "authors": [
    {
      "name": "Michael L. Scott",
      "institution": "Univ. of Rochester, Rochester, NY",
      "img": "/do/10.1145/contrib-81335496957/rel-imgonly/mls.gif",
      "acmid": "81335496957",
      "orcid": "missing"
    },
    {
      "name": "Sue-Ken Yap",
      "institution": "Univ. of Rochester, Rochester, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100576749",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Evan Adams and Steven S. Muchnick. Dbxtool: a window-based symbolic debugger for Sun workstations. Software Practice and Experience, July 1986.  ",
      "doi": "10.5555/10747.10750"
    },
    {
      "text": "Alfred V. Aho, Ravi Sethi, and Jeffrey D. Ullman. Compilers ~ Principles, Techniques and Tools. Addison-Wesley, 1986. ",
      "doi": "10.5555/6448"
    },
    {
      "text": "William Buxton and Brad A. Myers. A study in two-handed input. In CHI'86 Conference Proceedings, pages 321-326, April 1986.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "E. A. Edmonds. Adaptive Man-Computer Inter. faces, pages 389-426. Academic Press, London, 1981.",
      "doi": ""
    },
    {
      "text": "Mark A. Fleechia and Daniel R. Bergeron. Specifying complex dialogs in ALGAE. In Conference Proceedings of Human Factors in Computing Systems and Graphics Interface, Toronto, Canada, April 1987.  ",
      "doi": "10.1145/29933.275635"
    },
    {
      "text": "Mark Green. A survey of three dialogue models. A CM Transactions on Graphics, 5(3):244-275, July 1986.  ",
      "doi": "10.1145/24054.24057"
    },
    {
      "text": "Mark Green. The University of Alberta user interface management system. Computer Graphics, July 1985.  ",
      "doi": "10.1145/325165.325286"
    },
    {
      "text": "Stephen P. Guest. The use of software tools for dialogue design. International Journal of Man- Machine Studies, 16:263-285, 1982.",
      "doi": ""
    },
    {
      "text": "Paul. R. Hanau and David. R. Lenorovitz. Prototyping and simulation tools for user/computer dialogue design. In SIGGRAPH '80 Conference Proceedings, pages 271-278, 1980.  ",
      "doi": "10.1145/800250.807504"
    },
    {
      "text": "David I-Iarel. Statecharts: a visual formalism for complex systems. Science of Compuler Programruing, 8(3):231-274, June 1987.  ",
      "doi": "10.1016/0167-6423%2887%2990035-9"
    },
    {
      "text": "Ralph D. Hill. Event-response systems -- a technique for specifying multi-threaded dialogues. In Conference Proceedings of Human Factors in Computing Systems and Graphics Interface, Toronto, Canada, April 1987.  ",
      "doi": "10.1145/29933.275637"
    },
    {
      "text": "Ralph D. Hill. Supporting concurrency, communication and synchronization in human-computer interaction-- the Sassafras UIMS. A CM Transactions on Graphics, 5(3):179-210, July 1986.  ",
      "doi": "10.1145/24054.24055"
    },
    {
      "text": "Robert J. K. Jacob. A specification language for direct-manipulation user interfaces. ACM Transactions on Graphics, 5(4):283-317, October 1986.  ",
      "doi": "10.1145/27623.27624"
    },
    {
      "text": "Robert J. K. Jacob. Using formal specifications in the design of a human-computer interface. Communications of the A CM, 26(4):259--264, April 1983.  ",
      "doi": "10.1145/2163.358093"
    },
    {
      "text": "Donald E. Knuth. Semantics of context-free languages. Mathematical Systems Theory, 2(2): 127- 145, June lC~68.",
      "doi": ""
    },
    {
      "text": "J. Matthys. Recent experiences with input handling at PMA. In User Inlerface Management Systems, Springer-Verlag, 1985.",
      "doi": ""
    },
    {
      "text": "W.M. Newman. A system for interactive graphical programming. In SJCC 1968, 1968.",
      "doi": "10.1145/1468075.1468083"
    },
    {
      "text": "Dan R. Olsen Jr. Automatic generation of interactive systems. Computer Graphics, January 1983.  ",
      "doi": "10.1145/988584.988589"
    },
    {
      "text": "Dan R. Olsen Jr. and Elizabeth P. Dempsey. Syngraph: a graphical user interface generator. Computer Graphics, July 1983.  ",
      "doi": "10.1145/800059.801131"
    },
    {
      "text": "Giinther E. Pfaff, editor. User Interface Managemeat Systems. Springer-Verlag, 1985. ",
      "doi": "10.5555/583657"
    },
    {
      "text": "Jan van den Bos. Input tools- a new language construct for input-driven programs. In Proceedings of the European Conference on Applied InformaIion Technology of IFIP, September 1979.",
      "doi": ""
    },
    {
      "text": "Anthony I. Wasserman. Extending state transition diagrams for the specification of human-computer interaction. IEEE Transactions on Software Engineering, SE--11(8):699-713, August 1985.  ",
      "doi": "10.1109/TSE.1985.232519"
    }
  ]
}