{
  "doi": "10.1145/57167.57170",
  "title": "An improved automatic lipreading system to enhance speech recognition",
  "published": "1988-05-01",
  "proctitle": "CHI '88: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "19-25",
  "year": 1988,
  "badges": [],
  "abstract": "Current acoustic speech recognition technology performs well with very small vocabularies in noise or with large vocabularies in very low noise. Accurate acoustic speech recognition in noise with vocabularies over 100 words has yet to be achieved. Humans frequently lipread the visible facial speech articulations to enhance speech recognition, especially when the acoustic signal is degraded by noise or hearing impairment. Automatic lipreading has been found to improve significantly acoustic speech recognition and could be advantageous in noisy environments such as offices, aircraft and factories.\nAn improved version of a previously described automatic lipreading system has been developed which uses vector quantization, dynamic time warping, and a new heuristic distance measure. This paper presents visual speech recognition results from multiple speakers under optimal conditions. Results from combined acoustic and visual speech recognition are also presented which show significantly improved performance compared to the acoustic recognition system alone.",
  "authors": [
    {
      "name": "E. Petajan",
      "institution": "AT&T Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339521887",
      "orcid": "missing"
    },
    {
      "name": "B. Bischoff",
      "institution": "AT&T Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100440831",
      "orcid": "missing"
    },
    {
      "name": "D. Bodoff",
      "institution": "AT&T Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100630234",
      "orcid": "missing"
    },
    {
      "name": "N. M. Brooke",
      "institution": "Univ. of Bath, Bath, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100118043",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brooke,N.M. and Petajan,E.D., ~'Seeing Speech'Investigations into Synthesis and Recognition of Visible Speech Movements Using Automatic image Processing and Computer Graphics,\" IEE Conference Publication No. 258, Internation Conference on Speech Input/Output; Techniques and Applications, pp. 104-109, London, England, 1986.",
      "doi": ""
    },
    {
      "text": "Finn,K.I., \"An Investigation of Visible Lip Information to be Used in Automated Speech Recognition,\" Ph.D.Thesis, Georgetown University, 1986.",
      "doi": ""
    },
    {
      "text": "Gersho,A. and Cuperman,V., \"Vector Quantization' A Pattern-Matching Technique for Speech Coding,\" IEEE Communications Magazine, pp. 15-21, December 1983.",
      "doi": "10.1109/MCOM.1983.1091516"
    },
    {
      "text": "Huang,T.S., \"Coding of two Tone Images,\" IEEE I'ransactions on Communications, vol. Com-25, no. 11, 1977.",
      "doi": ""
    },
    {
      "text": "Malkin,F.J., \"The Effects on Computer Recognition of Speech when Speaking Through Protective Masks,\" Proc. Speech Tech '86, pp. 265-268, 1986.",
      "doi": ""
    },
    {
      "text": "Meisel,W.S., \"A Natural Speech Recognition System \" Proc. Speech Tech '87, pp. 10-13, 1987.",
      "doi": ""
    },
    {
      "text": "Moody,T., Joost,M., and Rodman,R., \"A Comparative Evaluation of Speech Recognizers,\" Proc. Speech Tech '87, pp. 275-280, 1987.",
      "doi": ""
    },
    {
      "text": "PauI,D.B, Lippmann,R.P., Chen,Y., and Weinstein,C.J., \"Robust HMM-Based Techniques For Recognition of Speech Produced Under Stress and in Noise.\" Proc. Speech Tech '86, pp. 241-249, 1986.",
      "doi": ""
    },
    {
      "text": "Petajan,E.D., \"An Architecture for High Speed Contour and Region Coding of Threshold Images,\" Proc. {EEE International Conference on Computer Design' VLSI in Computers, ICCD '86, pp. 502-505, Port Chester, NY, 1986.",
      "doi": ""
    },
    {
      "text": "Petajan,E.D., \"Automatic Lipreading to Enhance Speech Recognition,\" Ph.D.Thesis, University of Illinois, 1984. ",
      "doi": "10.5555/911713"
    },
    {
      "text": "Petajan,E.D., \"Automatic Lipreading to Enhance Speech Recognition.\" Proc. IEEE Conf. on Computer Vision and Pattern Recognition, CVPR '85, pp. 40-47, San Francisco, CA., 1985.",
      "doi": ""
    },
    {
      "text": "Sakoe, H. and Chiba, S., \"Dynamic Programming Algorithm Optimization for Spoken Word Recognition,\" IEEE. ASSP, no. ASSP- 26, pp. 43-49, 1978.",
      "doi": ""
    }
  ]
}