{
  "doi": "10.1145/2702123.2702529",
  "title": "Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3739-3748",
  "year": 2015,
  "badges": [],
  "abstract": "In this work we explore cyberbullying and other toxic behavior in team competition online games. Using a dataset of over 10 million player reports on 1.46 million toxic players along with corresponding crowdsourced decisions, we test several hypotheses drawn from theories explaining toxic behavior. Besides providing large-scale, empirical based understanding of toxic behavior, our work can be used as a basis for building systems to detect, prevent, and counter-act toxic behavior.",
  "authors": [
    {
      "name": "Haewoon Kwak",
      "institution": "Qatar Computing Research Institute, Doha, Qatar",
      "img": "/do/10.1145/contrib-81452618313/rel-imgonly/haewoon_kwak_informal.jpg",
      "acmid": "81452618313",
      "orcid": "missing"
    },
    {
      "name": "Jeremy Blackburn",
      "institution": "Telefonica, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81485645770/rel-imgonly/jhb.jpg",
      "acmid": "81485645770",
      "orcid": "missing"
    },
    {
      "name": "Seungyeop Han",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81467644385/rel-imgonly/81467644385.jpg",
      "acmid": "81467644385",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "IWillDominate Tribunal permaban & eSports competition ruling. http://goo.gl/2qHH4I.",
      "doi": ""
    },
    {
      "text": "Player tally for League of Legends surges. http://goo.gl/YxjSjb.",
      "doi": ""
    },
    {
      "text": "Reporting a player. https://support.riotgames.com/hc/enus/articles/201752884-Reporting-a-Player.",
      "doi": ""
    },
    {
      "text": "Riot Games' League of Legends officially becomes most played pc game in the world. http://goo.gl/iqrru6.",
      "doi": ""
    },
    {
      "text": "Riot Games releases awesome League of Legends infographic. http://goo.gl/bDKLnO.",
      "doi": ""
    },
    {
      "text": "Suicide of Megan Meier. http://goo.gl/MHgLJG.",
      "doi": ""
    },
    {
      "text": "To anyone who seen the recent popular post about a game called Foldit. This is why you should avoid it. http://redd.it/2n97b1.",
      "doi": ""
    },
    {
      "text": "Aggression, R., and Roles, P. M. Cyberbullying in Japan. Cyberbullying in the Global Playground: Research from International Perspectives (2011), 183.",
      "doi": ""
    },
    {
      "text": "Barlinska, J., et al. Cyberbullying among adolescent bystanders: role of the communication medium, form of violence, and empathy. Journal of Community & Applied Social Psychology 23, 1 (2013), 37--51.",
      "doi": ""
    },
    {
      "text": "Blackburn, J., et al. Branded with a scarlet \"C\": cheaters in a gaming social network. In WWW (2012).  ",
      "doi": "10.1145/2187836.2187848"
    },
    {
      "text": "Blackburn, J., and Kwak, H. STFU NOOB! predicting crowdsourced decisions on toxic behavior in online games. In WWW (2014).  ",
      "doi": "10.1145/2566486.2567987"
    },
    {
      "text": "Boellstorff, T. Coming of age in Second Life: An anthropologist explores the virtually human. Princeton University Press, 2008. ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Carron, A. V. Cohesion and performance in sport. Journal of Sport & Exercise Psychology 24 (2002), 168--188.",
      "doi": ""
    },
    {
      "text": "Chee, F. The games we play online and offline: Making Wang-tta in Korea. Popular Communication 4, 3 (2006), 225--239.",
      "doi": ""
    },
    {
      "text": "Chen, V. H.-H., Duh, H. B.-L., and Ng, C. W. Players who play to make others cry: The influence of anonymity and immersion. In ACE (2009).  ",
      "doi": "10.1145/1690388.1690454"
    },
    {
      "text": "Chesney, T., et al. Griefing in virtual worlds: causes, casualties and coping strategies. Information Systems Journal 19, 6 (2009), 525--548.",
      "doi": ""
    },
    {
      "text": "Christopherson, K. M. The positive and negative implications of anonymity in Internet social interactions:\"on the Internet, nobody knows you're a dog\". Computers in Human Behavior 23, 6 (2007), 3038--3056.  ",
      "doi": "10.1016/j.chb.2006.09.001"
    },
    {
      "text": "Cox, T. H., Lobel, S. A., and McLeod, P. L. Effects of ethnic group cultural differences on cooperative and competitive behavior on a group task. Academy of management journal 34, 4 (1991), 827--847.",
      "doi": ""
    },
    {
      "text": "Cramton, C. D. The mutual knowledge problem and its consequences for dispersed collaboration. Organization science 12, 3 (2001), 346--371.  ",
      "doi": "10.1287/orsc.12.3.346.10098"
    },
    {
      "text": "Denant-Boemont, L., Masclet, D., and Noussair, C. N. Punishment, counterpunishment and sanction enforcement in a social dilemma experiment. Economic theory 33, 1 (2007), 145--167.",
      "doi": ""
    },
    {
      "text": "Diener, E. Deindividuation, self-awareness, and disinhibition. Journal of Personality and Social Psychology 37, 7 (1979), 1160.",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N., et al. The life and death of online gaming communities: A look at guilds in World of Warcraft. In CHI (2007).  ",
      "doi": "10.1145/1240624.1240750"
    },
    {
      "text": "Einhorn, H. J., and Hogarth, R. M. Judging probable cause. Psychological Bulletin 99, 1 (1986), 3.",
      "doi": ""
    },
    {
      "text": "Elo, A. E. The rating of chessplayers, past and present, vol. 3. Batsford London, 1978.",
      "doi": ""
    },
    {
      "text": "Felps, W., Mitchell, T. R., and Byington, E. How, when, and why bad apples spoil the barrel: Negative group members and dysfunctional groups. Research in organizational behavior 27 (2006), 175--222.",
      "doi": ""
    },
    {
      "text": "Foo, C. Y., and Koivisto, E. M. I. Defining grief play in MMORPGs: player and developer perceptions. In ACE (2004).  ",
      "doi": "10.1145/1067343.1067375"
    },
    {
      "text": "Hofstede, G. H. Culture's consequences: Comparing values, behaviors, institutions and organizations across nations. Sage, 2001.",
      "doi": ""
    },
    {
      "text": "Huang, Y., et al. Functional or social: exploring teams in online games. In CSCW (2013), 399--408.  ",
      "doi": "10.1145/2441776.2441822"
    },
    {
      "text": "Kavussanu, M., and Ntoumanis, N. Participation in sport and moral functioning: Does ego orientation mediate their relationship? Journal of Sport and Exercise Psychology 25 (2003), 501--518.",
      "doi": ""
    },
    {
      "text": "Keegan, B., et al. Sic transit gloria mundi virtuali?: promise and peril in the computational social science of clandestine organizing. In WebSci (2011).  ",
      "doi": "10.1145/2527031.2527057"
    },
    {
      "text": "Kirman, B., et al. Exploring mischief and mayhem in social computing or: how we learned to stop worrying and love the trolls. In CHI EA (2012).  ",
      "doi": "10.1145/2212776.2212790"
    },
    {
      "text": "Kwak, H., and Blackburn, J. Linguistic analysis of toxic behavior in an online video game. In EGG workshop (2014).",
      "doi": ""
    },
    {
      "text": "Latane, B., and Darley, J. M. The unresponsive bystander: Why doesn't he help? Appleton-Century Crofts New York, 1970.",
      "doi": ""
    },
    {
      "text": "Lin, H., and Sun, C.-T. The \"White-Eyed\" player culture: Grief play and construction of deviance in MMORPGs. In DiGRA Conference (2005).",
      "doi": ""
    },
    {
      "text": "Marsden, P. V., and Campbell, K. E. Measuring tie strength. Social forces 63, 2 (1984), 482--501.",
      "doi": ""
    },
    {
      "text": "Mason, W., and Clauset, A. Friends FTW! friendship and competition in Halo: Reach. In CSCW (2013).  ",
      "doi": "10.1145/2441776.2441820"
    },
    {
      "text": "McPherson, M., Smith-Lovin, L., and Cook, J. M. Birds of a feather: Homophily in social networks. Annual review of sociology (2001), 415--444.",
      "doi": ""
    },
    {
      "text": "Mullen, B., and Copper, C. The relation between group cohesiveness and performance: An integration. Psychological bulletin 115, 2 (1994), 210.",
      "doi": ""
    },
    {
      "text": "Naito, T., and Gielen, U. Bullying and Ijime in Japanese schools. In Violence in Schools. Springer, 2005.",
      "doi": ""
    },
    {
      "text": "Naquin, C. E., and Tynan, R. O. The team halo effect: Why teams are not blamed for their failures. Journal of Applied Psychology 88, 2 (2003), 332.",
      "doi": ""
    },
    {
      "text": "Ommundsen, Y., Roberts, G., Lemyre, P., and Treasure, D. Perceived motivational climate in male youth soccer: Relations to social-moral functioning, sportspersonship and team norm perceptions. Psychology of Sport and Exercise 4, 4 (2003), 397--413.",
      "doi": ""
    },
    {
      "text": "Paulhus, D. L. Measurement and control of response bias. Academic Press, 1991.",
      "doi": ""
    },
    {
      "text": "Reicher, S. D., Spears, R., and Postmes, T. A social identity model of deindividuation phenomena. European Review of Social Psychology 6, 1 (1995), 161--198.",
      "doi": ""
    },
    {
      "text": "Roese, N. J. Counterfactual thinking. Psychological bulletin 121, 1 (1997), 133.",
      "doi": ""
    },
    {
      "text": "Shores, K. B., He, Y., Swanenburg, K. L., Kraut, R., and Riedl, J. The identification of deviance and its impact on retention in a multiplayer game. In CSCW (2014).  ",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Smith, P. K., et al. Cyberbullying: Its nature and impact in secondary school pupils. Journal of Child Psychology and Psychiatry 49, 4 (2008), 376--385.",
      "doi": ""
    },
    {
      "text": "Szell, M., Lambiotte, R., and Thurner, S. Multirelational organization of large-scale social networks in an online world. PNAS 107, 31 (2010), 13636--13641.",
      "doi": ""
    },
    {
      "text": "Thompson, P. What's fueling the \"ames in cyberspace\" a social influence model. Communication and cyberspace: Social interaction in an electronic environment (1996), 293--311.",
      "doi": ""
    },
    {
      "text": "Tönnies, F. Gemeinschaft und gesellschaft. Springer, 2012.",
      "doi": ""
    },
    {
      "text": "Triandis, H. C., et al. Individualism and collectivism: Cross-cultural perspectives on self-ingroup relationships. Journal of personality and Social Psychology 54, 2 (1988), 323.",
      "doi": ""
    },
    {
      "text": "Turner, J. C. Social comparison and social identity: Some prospects for intergroup behaviour. European journal of social psychology 5, 1 (1975), 1--34.",
      "doi": ""
    },
    {
      "text": "Vorderer, P., Hartmann, T., and Klimmt, C. Explaining the enjoyment of playing video games: The role of competition. In ACE (2003).",
      "doi": ""
    },
    {
      "text": "Warner, D. E., and Ratier, M. Social context in massively-multiplayer online games (MMOGs): Ethical questions in shared space. International Review of Information Ethics 4, 7 (2005).",
      "doi": ""
    },
    {
      "text": "Weibel, D., et al. Playing online games against computer- vs. human-controlled opponents: Effects on presence, flow, and enjoyment. Computers in Human Behavior 24, 5 (Sept. 2008), 2274--2291.  ",
      "doi": "10.1016/j.chb.2007.11.002"
    },
    {
      "text": "Weiner, B. A cognitive (attribution)-emotion-action model of motivated behavior: An analysis of judgments of help-giving. Journal of Personality and Social Psychology 39, 2 (1980), 186.",
      "doi": ""
    }
  ]
}