{
  "doi": "10.1145/2702123.2702167",
  "title": "To Beep or Not to Beep?: Comparing Abstract versus Language-Based Multimodal Driver Displays",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3971-3980",
  "year": 2015,
  "badges": [],
  "abstract": "Multimodal displays are increasingly being utilized as driver warnings. Abstract warnings, without any semantic association to the signified event, and language-based warnings are examples of such displays. This paper presents a first comparison between these two types, across all combinations of audio, visual and tactile modalities. Speech, text and Speech Tactons (a novel form of tactile warnings synchronous to speech) were compared to abstract pulses in two experiments. Results showed that recognition times of warning urgency during a non-critical driving situation were shorter for abstract warnings, highly urgent warnings and warnings including visual feedback. Response times during a critical situation were shorter for warnings including audio. We therefore suggest abstract visual feedback when informing drivers during a non-critical situation and audio in a highly critical one. Language-based warnings during a critical situation performed equally well as abstract ones, so they are suggested as less annoying vehicle alerts.",
  "authors": [
    {
      "name": "Ioannis Politis",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81488658289/rel-imgonly/face.jpg",
      "acmid": "81488658289",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Frank Pollick",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100125366",
      "orcid": "0000-0002-7212-4622"
    }
  ],
  "references": [
    {
      "text": "Baldwin, C.L. and Moore, C. Perceived Urgency, Alerting Effectiveness and Annoyance of Verbal Collision Avoidance System Messages. HFES Annual Meeting 46, 22 (2002), 1848--1852.",
      "doi": ""
    },
    {
      "text": "Baldwin, C.L. Verbal collision avoidance messages during simulated driving: perceived urgency, alerting effectiveness and annoyance. Ergonomics 54, 4 (2011), 328--337.",
      "doi": ""
    },
    {
      "text": "Biondi, F., Rossi, R., Gastaldi, M., and Mulatti, C. Beeping ADAS: Reflexive effect on drivers' behavior. Transportation Research Part F: Traffic Psychology and Behaviour 25, (2014), 27--33.",
      "doi": ""
    },
    {
      "text": "Brumby, D. and Seyedi, V. An empirical investigation into how users adapt to mobile phone auto-locks in a multitask setting. MobileHCI 2012, ACM Press (2012), 281--290.  ",
      "doi": "10.1145/2371574.2371616"
    },
    {
      "text": "Brumby, D.P., Davies, S.C.E., Janssen, C.P., and Grace, J.J. Fast or Safe? How Performance Objectives Determine Modality Output Choices While Interacting on the Move. CHI 2011, ACM (2011), 473--482.  ",
      "doi": "10.1145/1978942.1979009"
    },
    {
      "text": "Cao, Y., Mahr, A., Castronovo, S., Theune, M., Stahl, C., and Müller, C.A. Local danger warnings for drivers: The effect of modality and level of assistance on driver reaction. Intelligent User Interfaces, ACM Press (2010), 239--248.  ",
      "doi": "10.1145/1719970.1720004"
    },
    {
      "text": "Cao, Y., Theune, M., and Müller, C. Multimodal Presentation of Local Danger Warnings for Drivers': A Situation-dependent Assessment of Usability. Professional Communication Conference (IPCC), IEEE (2010), 226--229.",
      "doi": ""
    },
    {
      "text": "Edworthy, J., Hellier, E., Walters, K., Clift-Mathews, W., and Crowther, M. Acoustic, semantic and phonetic influences in spoken warning signal words. Applied Cognitive Psychology 17, 8 (2003), 915--933.",
      "doi": ""
    },
    {
      "text": "Edworthy, J., Hellier, E., Walters, K., Weedon, B., and Adams, A. The Relationship between Task Performance, Reaction Time, and Perceived Urgency in Nonverbal Auditory Warnings. HFES Annual Meeting 44, 22 (2000), 674--677.",
      "doi": ""
    },
    {
      "text": "Edworthy, J., Loxley, S., and Dennis, I. Improving auditory warning design: Relationship between warning sound parameters and perceived urgency. Human Factors 33, 2 (1991), 205--231.",
      "doi": ""
    },
    {
      "text": "Edworthy, J., Walters, K., Hellier, E., and Weedon, B. Comparing Speech and Nonspeech Warnings. HFES Annual Meeting 44, 22 (2000), 746--749.",
      "doi": ""
    },
    {
      "text": "Gonzalez, C., Lewis, B.A., Roberts, D.M., Pratt, S.M., and Baldwin, C.L. Perceived Urgency and Annoyance of Auditory Alerts in a Driving Context. HFES Annual Meeting 56, 1 (2012), 1684--1687.",
      "doi": ""
    },
    {
      "text": "Gray, R., Ho, C., and Spence, C. A comparison of different informative vibrotactile forward collision warnings: does the warning need to be linked to the collision event? PloS one 9, 1 (2014), e87070.",
      "doi": ""
    },
    {
      "text": "Gray, R. Looming Auditory Collision Warnings for Driving. Human Factors 53, 1 (2011), 63--74.",
      "doi": ""
    },
    {
      "text": "Hellier, E., Edworthy, J., Weedon, B., Walters, K., and Adams, A. The Perceived Urgency of Speech Warnings: Semantics versus Acoustics. Human Factors 44, 1 (2002), 1--17.",
      "doi": ""
    },
    {
      "text": "Ho, C., Reed, N., and Spence, C. Multisensory In-Car Warning Signals for Collision Avoidance. Human Factors 49, 6 (2007), pp. 1107--1114.",
      "doi": ""
    },
    {
      "text": "Ho, C., Spence, C., and Gray, R. Looming Auditory and Vibrotactile Collision Warnings for Safe Driving. Proceedings of the 7th International Driving Symposium on Human Factors in Driver Assessment, Training, and Vehicle Design., (2013), 551--557.",
      "doi": ""
    },
    {
      "text": "Ho, C. and Spence, C. Assessing the effectiveness of various auditory cues in capturing a driver's visual attention. Journal of experimental psychology. Applied 11, 3 (2005), pp. 157--74.",
      "doi": ""
    },
    {
      "text": "Ho, C., Tan, H.Z., and Spence, C. Using spatial vibrotactile cues to direct visual attention in driving scenes. Traffic Psychology and Behaviour 8, 6 (2005), 397--412.",
      "doi": ""
    },
    {
      "text": "Lewis, B.A. and Baldwin, C.L. Equating Perceived Urgency Across Auditory, Visual, and Tactile Signals. HFES Annual Meeting 56, 1 (2012), 1307--1311.",
      "doi": ""
    },
    {
      "text": "Lindgren, A., Angelelli, A., Mendoza, P.A., and Chen, F. Driver behaviour when using an integrated advisory warning display for advanced driver assistance systems. IET Intelligent Transport Systems 3, 4 (2009), 390--399.",
      "doi": ""
    },
    {
      "text": "Liu, Y.C. Comparative study of the effects of auditory, visual and multimodality displays on drivers' performance in advanced traveller information systems. Ergonomics 44, 4 (2001), 425--42.",
      "doi": ""
    },
    {
      "text": "Marshall, D.C., Lee, J.D., and Austria, P.A. Alerts for In-Vehicle Information Systems: Annoyance, Urgency, and Appropriateness. Human Factors 49, 1 (2007), 145--157.",
      "doi": ""
    },
    {
      "text": "McKeown, D., Isherwood, S., and Conway, G. Auditory Displays as Occasion Setters. Human Factors 52, 1 (2010), 54--62.",
      "doi": ""
    },
    {
      "text": "McKeown, D. and Isherwood, S. Mapping Candidate Within-Vehicle Auditory Displays to Their Referents. Human Factors 49, 3 (2007), 417--428.",
      "doi": ""
    },
    {
      "text": "Meng, F., Gray, R., Ho, C., Ahtamad, M., and Spence, C. Dynamic Vibrotactile Signals for Forward Collision Avoidance Warning Systems. Human Factors, (2014).",
      "doi": ""
    },
    {
      "text": "Politis, I., Brewster, S., and Pollick, F. Evaluating Multimodal Driver Displays under Varying Situational Urgency. CHI 2014, ACM Press (2014), pp. 4067--4076.  ",
      "doi": "10.1145/2556288.2556988"
    },
    {
      "text": "Politis, I., Brewster, S., and Pollick, F. Evaluating Multimodal Driver Displays of Varying Urgency. Automotive UI 2013, ACM Press (2013), 92--99.  ",
      "doi": "10.1145/2516540.2516543"
    },
    {
      "text": "Politis, I., Brewster, S., and Pollick, F. Speech Tactons Improve Speech Warnings for Drivers. Automotive UI 2014, ACM Press (2014), 1 - 8.  ",
      "doi": "10.1145/2667317.2667318"
    },
    {
      "text": "Pratt, S.M., Lewis, B.A., Penaranda, B.N., Roberts, D.M., Gonzalez, C., and Baldwin, C.L. Perceived Urgency Scaling in Tactile Alerts. HFES Annual Meeting 56, 1 (2012), pp. 1303--1306.",
      "doi": ""
    },
    {
      "text": "Scott, J.J. and Gray, R. A Comparison of Tactile, Visual, and Auditory Warnings for Rear-End Collision Prevention in Simulated Driving. Human Factors 50, 2 (2008), 264--275.",
      "doi": ""
    },
    {
      "text": "Serrano, J., Di Stasi, L.L., Megías, A., and Catena, A. Effect of directional speech warnings on road hazard detection. Traffic injury prevention 12, 6 (2011), pp. 630--635.",
      "doi": ""
    }
  ]
}