{
  "doi": "10.1145/2702123.2702416",
  "title": "Zensors: Adaptive, Rapidly Deployable, Human-Intelligent Sensor Feeds",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1935-1944",
  "year": 2015,
  "badges": [],
  "abstract": "The promise of \"smart\" homes, workplaces, schools, and other environments has long been championed. Unattractive, however, has been the cost to run wires and install sensors. More critically, raw sensor data tends not to align with the types of questions humans wish to ask, e.g., do I need to restock my pantry? Although techniques like computer vision can answer some of these questions, it requires significant effort to build and train appropriate classifiers. Even then, these systems are often brittle, with limited ability to handle new or unexpected situations, including being repositioned and environmental changes (e.g., lighting, furniture, seasons). We propose Zensors, a new sensing approach that fuses real-time human intelligence from online crowd workers with automatic approaches to provide robust, adaptive, and readily deployable intelligent sensors. With Zensors, users can go from question to live sensor feed in less than 60 seconds. Through our API, Zensors can enable a variety of rich end-user applications and moves us closer to the vision of responsive, intelligent environments.",
  "authors": [
    {
      "name": "Gierad Laput",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "Walter S. Lasecki",
      "institution": "University of Rochester & Carnegie Mellon University, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490695200",
      "orcid": "missing"
    },
    {
      "name": "Jason Wiese",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81467645911/rel-imgonly/jason-190.jpg",
      "acmid": "81467645911",
      "orcid": "0000-0002-8766-3557"
    },
    {
      "name": "Robert Xiao",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81548910156/rel-imgonly/img_6433x_cropped_large.jpeg",
      "acmid": "81548910156",
      "orcid": "0000-0003-4306-8825"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. D. and Mynatt, E. D. Designing for the human experience in smart environments. Smart environments: technologies, protocols, and applications (2004), 151--174.",
      "doi": ""
    },
    {
      "text": "Bernstein, M.S., Brandt, J., Miller, R.C., Karger, D.R. Crowds in two seconds: enabling realtime crowd-powered interfaces. In Proc. UIST '11, 33--42.  ",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Bigham, J. P., et al. VizWiz: nearly real-time answers to visual questions. In Proc. UIST '10, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Boyle, M. and Greenberg, S. The language of privacy: Learning from video media space analysis and design. ACM ToCHI, 12(2), 2005, 328--370.  ",
      "doi": "10.1145/1067860.1067868"
    },
    {
      "text": "Boyle, M., Edwards, C., Greenberg, S. The effects of filtered video on awareness and privacy. In Proc. CSCW '00, 1--10.  ",
      "doi": "10.1145/358916.358935"
    },
    {
      "text": "Cohen, J. A coefficient of agreement for nominal scales. Educational and Psychological Measurement 20(1), 1960, 37--46.",
      "doi": ""
    },
    {
      "text": "Deng, J., Krause, J., Fei-Fei, L. Fine-grained crowdsourcing for fine-grained recognition. In Proc. CVPR '13, 580587.  ",
      "doi": "10.1109/CVPR.2013.81"
    },
    {
      "text": "Fails, J.A. and Olsen, D. A design tool for camera-based interaction. In Proc. CHI '03, 449--456.  ",
      "doi": "10.1145/642611.642690"
    },
    {
      "text": "Fails, J.A. and Olsen, D. Light widgets: interacting in every-day spaces. In Proc. IUI '02. 63--69.  ",
      "doi": "10.1145/502716.502729"
    },
    {
      "text": "Franklin, M. J., Kossmann, D., Kraska, T., Ramesh, S. and Xin, R. CrowdDB: answering queries with crowdsourcing. In Proc. SIGMOD '11. 61--72.  ",
      "doi": "10.1145/1989323.1989331"
    },
    {
      "text": "Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P., Witten, I. H. The WEKA data mining software: an update. ACM SIGKDD explorations newsletter, 11(1), 2009, 10--18.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Hall, M.A., Correlation-based Feature Subset Selection for Machine Learning. 1998. Hamilton, New Zealand.",
      "doi": ""
    },
    {
      "text": "Hara, K., Sun, J., Moore, R., Jacobs, D., Froehlich, J.E. Tohme: Detecting Curb Ramps in Google Street View Using Crowdsourcing, Computer Vision, and Machine Learning. In Proc. UIST '14. 189--204.  ",
      "doi": "10.1145/2642918.2647403"
    },
    {
      "text": "Hudson, S.E. and Smith, I. Techniques for addressing fundamental privacy and disruption tradeoffs in awareness support systems. In Proc. CSCW '96, 248--257.  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Kastrinaki, V., Zervakis, M., Kalaitzakis, K. A survey of video processing techniques for traffic applications. Image and Vision Computing 21(4), 2003, 359--381.",
      "doi": ""
    },
    {
      "text": "Khan, M., Acharya, B. and Verm, S. Comparison between different illumination independent change detection techniques. In Proc. ICCCS '11, 347--350  ",
      "doi": "10.1145/1947940.1948013"
    },
    {
      "text": "Lasecki, W., Gordon, M., Koutra, D., Jung, M., Dow, S., Bigham, J. Glance: Rapidly Coding Behavioral Video with the Crowd. In Proc. UIST '14. 551--562.  ",
      "doi": "10.1145/2642918.2647367"
    },
    {
      "text": "Lasecki, W.S., Song, Y., Kautz, H., and Bigham, J.P. Realtime crowd labeling for deployable activity recognition. In Proc. CSCW '13, 1203--1212.  ",
      "doi": "10.1145/2441776.2441912"
    },
    {
      "text": "Lee, M. L., Dey, A. K. Sensor-based observations of daily living for aging in place. Pers. Ubiquit. Comp., 2014, 1--17.  ",
      "doi": "10.1007/s00779-014-0810-3"
    },
    {
      "text": "Marcus, A., Karger, D., Madden, S., Miller, R., Oh, S. Counting with the crowd. In Proc. VLDB '12, 109--120.  ",
      "doi": "10.14778/2535568.2448944"
    },
    {
      "text": "Maynes-Aminzade, D., Winograd, T., Igarashi, T. Eyepatch: prototyping camera-based interaction through examples. In Proc. UIST '07. 33--42.  ",
      "doi": "10.1145/1294211.1294219"
    },
    {
      "text": "Salber, D., Dey, A. K., Abowd, G. D. The context toolkit: aiding the development of context-enabled applications. In Proc. CHI '99, 434--441  ",
      "doi": "10.1145/302979.303126"
    },
    {
      "text": "Tang, A., Greenberg, S., and Fels, S. Exploring video streams using slit-tear visualizations. Proc. AVI '08, 191198.  ",
      "doi": "10.1145/1385569.1385601"
    },
    {
      "text": "von Ahn, L. and Dabbish, L.. Labeling images with a computer game. In Proc. CHI '04, 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Vondrick, C., Patterson, D., and Ramanan, D. Efficiently Scaling Up Crowdsourced Video Annotation. International Journal of Computer Vision, June 2012.  ",
      "doi": "10.1007/s11263-012-0564-1"
    },
    {
      "text": "Wah, C. Crowdsourcing and its applications in computer vision. University of California, San Diego. 2006.",
      "doi": ""
    },
    {
      "text": "Walton, A. Life Expectancy of a Smartphone. Retrieved from chron.com, September 21, 2014.",
      "doi": ""
    },
    {
      "text": "Zhao, W., Chellappa, R., Phillips, P. and Rosenfeld, R. Face recognition: A literature survey. ACM Comput. Surv. 35(4), 2003, 399--458.  ",
      "doi": "10.1145/954339.954342"
    },
    {
      "text": "Zimmer, T., & Beigl, M. AwareOffice: Integrating Modular Context-Aware Applications. In Proc. ICDCSW'06.  ",
      "doi": "10.1109/ICDCSW.2006.25"
    }
  ]
}