{
  "doi": "10.1145/2702123.2702188",
  "title": "Personalized, Wearable Control of a Head-mounted Display for Users with Upper Body Motor Impairments",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "221-230",
  "year": 2015,
  "badges": [],
  "abstract": "Head-mounted displays provide relatively hands-free interaction that could improve mobile computing access for users with motor impairments. To investigate this largely unexplored area, we present two user studies. The first, smaller study evaluated the accessibility of Google Glass, a head-mounted display, with 6 participants. Findings revealed potential benefits of a head-mounted display yet demonstrated the need for alternative means of controlling Glass-3 of the 6 participants could not use it at all. We then conducted a second study with 12 participants to evaluate a potential alternative input mechanism that could allow for accessible control of a head-mounted display: switch-based wearable touchpads that can be affixed to the body or wheelchair. The study assessed input performance with three sizes of touchpad, investigated personalization patterns when participants were asked to place the touchpads on their body or wheelchair, and elicited subjective responses. All 12 participants were able to use the touchpads to control the display, and patterns of touchpad placement point to the value of personalization in providing support for each user's motor abilities.",
  "authors": [
    {
      "name": "Meethu Malu",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81496689048/rel-imgonly/original.jpg",
      "acmid": "81496689048",
      "orcid": "missing"
    },
    {
      "name": "Leah Findlater",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100170743",
      "orcid": "0000-0002-5619-4452"
    }
  ],
  "references": [
    {
      "text": "Anthony, L., Kim, Y., and Findlater, L. Analyzing usergenerated YouTube videos to understand touchscreen use by people with motor impairments. Proc. CHI'13, (2013), 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Ashbrook, D., Baudisch, P., and White, S. Nenya: subtle and eyes-free mobile input with a magnetically-tracked finger ring. Proc. CHI'11, (2011), 2043--2046.  ",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Carrington, P., Hurst, A., and Kane, S.K. Wearables and Chairables: Inclusive Design of Mobile Input and Output Techniques for Power Wheelchair Users. Proc. CHI'14, (2014), 3103--3112.  ",
      "doi": "10.1145/2556288.2557237"
    },
    {
      "text": "Carrington, P., Hurst, A., Kane, S.K. The Gest-Rest: a pressure-sensitive chairable input pad for power wheelchair armrests. Proc. ASSETS'14, (2014), to appear.  ",
      "doi": "10.1145/2661334.2661374"
    },
    {
      "text": "Duff, S.N., Irwin, C.B., Skye, J.L., Sesto, M.E., and Wiegmann, D.A. The effect of disability and approach on touch screen performance during a number entry task. Proc. HFES'10, (2010), 566--570.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Wobbrock, J.O., and Kane, S.K. Barrier Pointing: Using Physical Edges to Assist Target Acquisition on Mobile Device Touch Screens. Proc. ASSETS'07, (2007), 19--26.  ",
      "doi": "10.1145/1296843.1296849"
    },
    {
      "text": "Guerreiro, T.J.V., Nicolau, H., Jorge, J., and Gonçalves, D. Assessing Mobile Touch Interfaces for Tetraplegics. Proc. MobileHCI'10, (2010), 31--34.  ",
      "doi": "10.1145/1851600.1851608"
    },
    {
      "text": "Gustafson, S., Holz, C., and Baudisch, P. Imaginary phone: learning imaginary interfaces by transferring spatial memory from a familiar device. Proc. UIST'11, (2011), 283--292.  ",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Ha, K., Chen, Z., Hu, W., Richter, W., Pillai, P., and Satyanarayanan, M. Towards wearable cognitive assistance. Proc. MobiSys'14, (2014), 68--81.  ",
      "doi": "10.1145/2594368.2594383"
    },
    {
      "text": "Harrison, C. and Wilson, A.D. OmniTouch: wearable multitouch interaction everywhere. Proc. UIST'11, (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Huo, X., Park, H., Ghovanloo, M. Dual-mode tongue drive system. Proc. Wireless Health, (2012), 1--8.  ",
      "doi": "10.1145/2448096.2448102"
    },
    {
      "text": "International Organization for Standardization. Ergonomic requirements for office work with visual display terminals (VDTs)-Requirements for non-keyboard input devices (Ref. No. ISO 9241--9:2000(E)). 2002.",
      "doi": ""
    },
    {
      "text": "Irwin, C.B. and Sesto, M.E. Performance and touch characteristics of disabled and non-disabled participants during a reciprocal tapping task using touch screen technology. Applied Ergonomics 43, 6 (2012), 1038--1043.",
      "doi": ""
    },
    {
      "text": "Kane, S.K., Jayant, C., Wobbrock, J.O., and Ladner, R.E. Freedom to Roam: A Study of Mobile Device Adoption and Accessibility for People with Visual and Motor Disabilities. Proc. ASSETS'09, (2009), 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Kaufmann, B. and Buechley, L. Amarino. Proc. MobileHCI'10, (2010), 291.",
      "doi": "10.1145/1851600.1851652"
    },
    {
      "text": "Krevelen, D.W.F. Van and Poelman, R. A Survey of Augmented Reality Technologies , Applications and Limitations. Int'l J. of Virtual Reality 9, 2 (2010), 1.",
      "doi": ""
    },
    {
      "text": "Kumar, M., Paepcke, A., and Winograd, T. EyePoint. Proc. CHI'07, (2007), 421--430.  ",
      "doi": "10.1145/1240624.1240692"
    },
    {
      "text": "Kunze, K., Henze, N., and Kise, K. Wearable computing for older adults. UbiComp'14 Adjunct, (2014), 83--86.  ",
      "doi": "10.1145/2638728.2638747"
    },
    {
      "text": "Lee, T. and Hollerer, T. Handy AR: Markerless Inspection of Augmented Reality Objects Using Fingertip Tracking. Proc. ISWC'07, (2007), 1--8.  ",
      "doi": "10.1109/ISWC.2007.4373785"
    },
    {
      "text": "Lyons, K., Nguyen, D.H., Ashbrook, D., and White, S. Facet: a multi-segment wrist worn system. Proc. UIST'12, (2012), 123--129.  ",
      "doi": "10.1145/2380116.2380134"
    },
    {
      "text": "Lyons, K., Starner, T., Plaisted, D., et al. Twiddler typing: one-handed chording text entry for mobile phones. Proc. CHI '04, (2004), 671--678.  ",
      "doi": "10.1145/985692.985777"
    },
    {
      "text": "Mathiowetz, V., Volland, G., Kashman, N., and Weber, K. Adult norms for the Box and Block Test of manual dexterity. American J. of Occupational Therapy 39, 6 (1985), 386--391.",
      "doi": ""
    },
    {
      "text": "Mazilu, S., Blanke, U., Hardegger, M., Tröster, G., Gazit, E., Hausdorff, J.M. GaitAssist: a daily-life support and training system for Parkinson's disease patients with freezing of gait. Proc. CHI'14, (2014), 2531--2540.  ",
      "doi": "10.1145/2556288.2557278"
    },
    {
      "text": "McNaney, R., Vines, J., Roggen, D., et al. Exploring the acceptability of Google Glass as an everyday assistive device for people with Parkinson's. Proc. CHI'14, (2014), 2551--2554.  ",
      "doi": "10.1145/2556288.2557092"
    },
    {
      "text": "Naftali, M. and Findlater, L. Accessibility in Context: Understanding the Truly Mobile Experience of Smartphone Users With Motor Impairments. Proc. ASSETS'14, (2014), To appear.  ",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "Olwal, A. and Feiner, S. SenseShapes: Using statistical geometry for object selection in a multimodal aug-mented reality system. Proc. ISMAR '03 (2003), 300. ",
      "doi": "10.5555/946248.946836"
    },
    {
      "text": "Profita, H.P., Clawson, J., Gilliland, S., et al. Don't mind me touching my wrist. Proc. ISWC '13, (2013), 89.",
      "doi": ""
    },
    {
      "text": "Raya, R., Roa, J.O., Rocon, E., Ceres, R., and Pons, J.L. Wearable inertial mouse for children with physical and cognitive impairments. Sensors and Actuators A: Physical 162, 2 (2010), 248--259.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J. GestureWrist and GesturePad: unobtrusive wearable interaction devices. Proc. ISCW'01, (2001), 21--27. ",
      "doi": "10.5555/580581.856565"
    },
    {
      "text": "Saponas, T.S., Tan, D.S., Morris, D., Balakrishnan, R., Turner, J., and Landay, J.A. Enabling always-available input with muscle-computer interfaces. Proc. UIST'09, (2009), 167--176.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Shinohara, K. and Wobbrock, J.O. In the shadow of misperception. Proc. CHI'11, (2011), 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Trewin, S., Swart, C., and Pettick, D. Physical accessibility of touchscreen smartphones. Proc. ASSETS '13. Article 19, (2013), 1--8.  ",
      "doi": "10.1145/2513383.2513446"
    },
    {
      "text": "Wacharamanotham, C., Hurtmanns, J., Mertens, A., Kronenbuerger, M., Schlick, C., and Borchers, J. Evaluating swabbing: a touchscreen input method for elderly users with tremor. Proc. CHI'11, (2011), 623--626.  ",
      "doi": "10.1145/1978942.1979031"
    },
    {
      "text": "Wobbrock, J.O., Myers, B.A., and Kembel, J.A. EdgeWrite: A Stylus-Based Text Entry Method Designed for High Accuracy and Stability of Motion. Proc. UIST'03, (2003), 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Yamamoto, G., Kuroda, T., Yoshitake, D., et al. PiTaSu: wearable interface for assisting senior citizens with memory problems. Int'l Journal on Disability and Human Development 10, 4 (2011), 295--300.",
      "doi": ""
    },
    {
      "text": "Zhou, F., Duh, H.B.-L., and Billinghurst, M. Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR. Proc. ISMAR'08, (2008), 193--202.  ",
      "doi": "10.1109/ISMAR.2008.4637362"
    },
    {
      "text": "Zhou, H. and Hu, H. Human motion tracking for rehabilitation-A survey. Biomedical Signal Processing and Control 3, 1 (2008), 1--18.",
      "doi": ""
    }
  ]
}