{
  "doi": "10.1145/2702123.2702510",
  "title": "EnviroPulse: Providing Feedback about the Expected Affective Valence of the Environment",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2073-2082",
  "year": 2015,
  "badges": [],
  "abstract": "Interacting with nature is beneficial to a person's mental-state, but it can sometimes be difficult to find environments that will induce positive affect (e.g., when planning a run). In this paper, we describe EnviroPulse-a system for auto-matically determining and communicating the expected affective valence (EAV) of environments to individuals. We describe a prototype that allows this to be used in real-time on a smartphone, but EnviroPulse could easily be incorporated into GPS systems, mapping services, or image-based systems. Our work differs from existing work in af-fective computing in that, rather than detecting a user's affect directly, we automatically determine the EAV of the environment through visual analysis. We present results that suggest our system can determine the EAV of envi-ronments. We also introduce real-time affective visual feedback of the calculated EAV of the images, and present results from an informal study suggesting that real-time visual feedback can be used for induction of affect.",
  "authors": [
    {
      "name": "Deltcho Valtchanov",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658653011",
      "orcid": "missing"
    },
    {
      "name": "Mark Hancock",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100211996/rel-imgonly/acm.jpg",
      "acmid": "81100211996",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amir, O., Biederman, I., & Hayworth, K.J. The neural basis for shape preferences. Vision research 51, 20 (2011), 2198--2206.",
      "doi": ""
    },
    {
      "text": "American Psychological Association, Stress in America 2013, http://www.apa.org/news/press/releases/stress/",
      "doi": ""
    },
    {
      "text": "Bar, M., & Neta, M. Visual elements of subjective preference modulate amygdala activation. Neuropsychologia 45, 10 (2007), 2191--2200.",
      "doi": ""
    },
    {
      "text": "Baltrusaitis, Tadas, et al. Real-time inference of mental states from facial expressions and upper body gestures. In Automatic Face & Gesture Recognition and Workshops (FG 2011), IEEE Press, (2011), 909--914.",
      "doi": ""
    },
    {
      "text": "Biederman, I., & Vessel, E.A. Perceptual pleasure and the brain. American Scientist 94, 3 (2006), 249--255.",
      "doi": ""
    },
    {
      "text": "Bradley, M.M., & Lang, P.J. Measuring emotion: the self-assessment manikin and the semantic differential. J BEHAV THER EXP PSY 25, 1 (1994), 49--59.",
      "doi": ""
    },
    {
      "text": "Coyne, R. Nature vs. Smartphones. Interactions, 21,5 (2014), 24--31.  ",
      "doi": "10.1145/2656933"
    },
    {
      "text": "Datta, R., Joshi, D., Li, J., & Wang, J. Z. Studying aesthetics in photographic images using a computational approach. In Computer Vision-ECCV (2006), 288--301  ",
      "doi": "10.1007/11744078_23"
    },
    {
      "text": "Fernandez, D., & Wilkins, A.J. Uncomfortable images in art and nature. Perception 37, 7 (2008), 1098--1113.",
      "doi": ""
    },
    {
      "text": "Gullone, E. The biophilia hypothesis and life in the 21st century: Increasing mental health or increasing pathology? Journal of Happiness Studies, 1,3 (2000), 293--322.",
      "doi": ""
    },
    {
      "text": "Hanjalic, A. Extracting moods from pictures and sounds: Towards truly personalized TV. IEE Signal Processing Magazine, 23, 2 (2006), 90--100.",
      "doi": ""
    },
    {
      "text": "Hernandez, J., Hoque, M.E., and Picard, R.E. Mood Meter: large-scale and long-term smile monitoring system. In ACM SIGGRAPH 2012 Emerging Technologies, ACM Press (2012), 1.  ",
      "doi": "10.1145/2343456.2343471"
    },
    {
      "text": "Jiang, B., Chang, C. Y., & Sullivan, W. C. A dose of nature: Tree cover, stress reduction, and gender differences. Landscape and Urban Planning, 132 (2014), 26--36.",
      "doi": ""
    },
    {
      "text": "Juricevic, I., Land, L., Wilkins, A., & Webster., M.A. Visual discomfort and natural image statistics. Perception 39, 7 (2010), 884--899.",
      "doi": ""
    },
    {
      "text": "Lie, A. E., Kehrer, J., & Hauser, H. Critical design and realization aspects of glyph-based 3D data visualization. In Proc. 25th Spring Conference on Computer Graphics, ACM Press (2009), 19--26.  ",
      "doi": "10.1145/1980462.1980470"
    },
    {
      "text": "Oliva, A., & Torralba, A. Modeling the shape of the scene: A holistic representation of the spatial envelope. Int. Journal of Computer Vision 42, 3 (2001), 145--175.  ",
      "doi": "10.1023/A%3A1011139631724"
    },
    {
      "text": "O'Hare, L., & Hibbard, P. B. Spatial frequency and visual discomfort. Vision Research 51, 15, (2011), 1767--1777.",
      "doi": ""
    },
    {
      "text": "Palmer, S. E., & Schloss, K. B. An ecological valence theory of human color preference. In Proc. National Academy of Sciences, 107, 19, (2010), 8877--8882.",
      "doi": ""
    },
    {
      "text": "Paredes, P., Gilad-Bachrach, R., Czerwinski, M., Roseway, A., Rowan, K., & Hernandez, J. PopTherapy: Coping with Stress through Pop-Culture. In Proc Pervasive Technologies for Healthcare, (2014).  ",
      "doi": "10.4108/icst.pervasivehealth.2014.255070"
    },
    {
      "text": "Poh, M.Z., Kim, K., Goessling, A.D., Swenson, N.C., Picard, R.W., Heartphones: Sensor Earphones and Mobile Application for Non-obtrusive Health Monitoring. In Proc. IEEE International Symposium on Wearable Computers, (2009) 153--154.  ",
      "doi": "10.1109/ISWC.2009.35"
    },
    {
      "text": "Pence, H.E. Smartphones, smart objects, and augmented reality. REF LIB 52, (2010): 136--145.",
      "doi": ""
    },
    {
      "text": "Poffenberger, A.T., and Barrows, B.E. The Feeling Value of Lines. Journal of Applied Psychology 8, 2 (1924), 187--205.",
      "doi": ""
    },
    {
      "text": "Quercia, D., Schifanella, R., & Aiello, L.M. The shortest path to happiness: Recommending beautiful, quiet and happy routes in the city. In Proc. Hypertext and social media, ACM Press (2014), 116--125.  ",
      "doi": "10.1145/2631775.2631799"
    },
    {
      "text": "Sandor, C., Dey, A., Cunningham, A., Barbier, S., Eck, U., Urquhart, D., Marner, M.R., Jarvis, G., and Rhee, S. Egocentric space-distorting visualizations for rapid environment exploration in mobile mixed reality. In Virtual Reality Conference (VR) 2010, IEEE Press (2010), 47--50.  ",
      "doi": "10.1109/VR.2010.5444815"
    },
    {
      "text": "Valdez, P., & Mehrabian, A., Effects of color on emotions. Journal of Experimental Psychology: General 123, 4 (1994), 394--409.",
      "doi": ""
    },
    {
      "text": "Valtchanov, D., & Ellard, C. Physiological and affective responses to immersion in virtual reality: Effects of nature and urban settings. JCR 3, 4 (2010), 359--373.",
      "doi": ""
    },
    {
      "text": "Valtchanov, D., Exploring the Restorative Effects of Nature: Testing A Proposed Visuospatial Theory. (Doctoral dissertation). U of Waterloo, ON, CA, 2013.",
      "doi": ""
    },
    {
      "text": "van Krevelen, D.W.F., & Poelman, R. A survey of augmented reality technologies, applications and limitations. International Journal of Virtual Reality 9, 2 (2010), 1--19.",
      "doi": ""
    },
    {
      "text": "Västfjäll, D. Emotion induction through music: A review of the musical mood induction procedure. Musicae Scientiae 5, 1 (2002), 173--211.",
      "doi": ""
    },
    {
      "text": "Viera, A.J., & Garrett, J.M. Understanding Interobserver Agreement: The Kappa Statistic. Family Medicine 37, 5 (2005), 360--363.",
      "doi": ""
    },
    {
      "text": "Zhang, S., Huang, Q., Jiang, S., Gao, W., & Tian, Q. Affective visualization and retrieval for music video. Multimedia, IEEE Transactions on Multimedia 12, 6 (2010), 510--522.  ",
      "doi": "10.1109/TMM.2010.2059634"
    }
  ]
}