{
  "doi": "10.1145/2702123.2702329",
  "title": "Gauging Receptiveness to Social Microvolunteering",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1055-1064",
  "year": 2015,
  "badges": [],
  "abstract": "Crowd-powered systems that help people are difficult to scale and sustain because human labor is expensive and worker pools are difficult to grow. To address this problem we introduce the idea of social microvolunteering, a type of intermediated friendsourcing in which a person can provide access to their friends as potential workers for microtasks supporting causes that they care about. We explore this idea by creating Visual Answers, an exemplar social microvolunteering application for Facebook that posts visual questions from people who are blind. We present results of a survey of 350 participants on the concept of social microvolunteering, and a deployment of the Visual Answers application with 91 participants, which collected 618 high-quality answers to questions asked over 12 days, illustrating the feasibility of the approach.",
  "authors": [
    {
      "name": "Erin Brady",
      "institution": "University of Rochester, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-81490664843/rel-imgonly/erinbradyphotowp.jpeg",
      "acmid": "81490664843",
      "orcid": "missing"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    }
  ],
  "references": [
    {
      "text": "André, P. et al. Who Gives A Tweet? Evaluating Microblog Content Value. Proc. CSCW 2012.  ",
      "doi": "10.1145/2145204.2145277"
    },
    {
      "text": "Bernstein, M. et al. Micro-volunteering: helping the helpers in development. Proc. CSCW 2013.  ",
      "doi": "10.1145/2441955.2441979"
    },
    {
      "text": "Bernstein, M.S. et al. Quantifying the Invisible Audience in Social Networks. Proc. CHI 2013.  ",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Bigham, J.P. et al. VizWiz: Nearly Real-time Answers to Visual Questions. Proc. UIST 2010.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Bigham, J.P. et al. The Design of Human-Powered Access Technology. Proc. ASSETS 2011.  ",
      "doi": "10.1145/2049536.2049540"
    },
    {
      "text": "Blog, F.O. 2014. News Feed FYI: Giving People More Control Over When They Share from Apps.",
      "doi": ""
    },
    {
      "text": "Brady, E. et al. Visual Challenges in the Everyday Lives of Blind People. Proc. CHI 2013.  ",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Brady, E. et al. Investigating the appropriateness of social network question asking as a resource for blind users. Proc. CSCW 2013.  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Demographics of key social networking platforms: PewResearch Internet Project, Dec. 30, 2013.",
      "doi": ""
    },
    {
      "text": "Economic News Release - Volunteering in the USA, 2013: www.bls.gov/news.release/volun.nr0.htm.",
      "doi": ""
    },
    {
      "text": "Ellison, N.B. et al. Calling All Facebook Friends: Exploring Requests for Help on Facebook. Proc. ICWSM 2013.",
      "doi": ""
    },
    {
      "text": "Gray, R. et al. Who Wants to Know? Question-asking and Answering Practices among Facebook Users. Communication Arts. (2013).  ",
      "doi": "10.1145/2441776.2441913"
    },
    {
      "text": "Havens, J. et al. 2006. Charitable Giving: How Much, by Whom, to What, and How? The Non-Profit Sector: A Research Handbook. 542--567.",
      "doi": ""
    },
    {
      "text": "Korpela, E. et al. 2001. SETI@HOME -- Massively Distributed Computing for SETI. Computing in Science and Engineering. (2001), 78--83.  ",
      "doi": "10.1109/5992.895191"
    },
    {
      "text": "Lampe, C. et al. Help is on the Way: Patterns of Responses to Resource Requests on Facebook. Proc. CSCW 2014.  ",
      "doi": "10.1145/2531602.2531720"
    },
    {
      "text": "Lee, Y.-hao and Hsieh, G. Does Slacktivism Hurt Activism?: The Effects of Moral Balancing and Consistency in Online Activism. Proc. CHI 2013.  ",
      "doi": "10.1145/2470654.2470770"
    },
    {
      "text": "Marichal, J. Political Facebook groups: Micro-activism and the digital front stage. First Monday. 18, 2013.",
      "doi": ""
    },
    {
      "text": "Martins, J. et al. 2014. Friendsourcing the Unmet Needs of People with Dementia. W4A 2014.  ",
      "doi": "10.1145/2596695.2596716"
    },
    {
      "text": "Morris, M.R. et al. A Comparison of Information Seeking Using Search Engines and Social Networks. Proc. ICWSM 2010.",
      "doi": ""
    },
    {
      "text": "Morris, M.R. et al. What Do People Ask Their Social Networks, and Why? A Survey Study of Status Message Q&A Behavior. Proc. CHI 2010.  ",
      "doi": "10.1145/1753326.1753587"
    },
    {
      "text": "Nichols, J. and Kang, J. Asking questions of targeted strangers on social networks. Proc. CHI 2012.  ",
      "doi": "10.1145/2145204.2145352"
    },
    {
      "text": "Paul, S.A. et al. Is Twitter a Good Place for Asking Questions? A Characterization Study. ICWSM 2011.",
      "doi": ""
    },
    {
      "text": "Rahman, S. et al. FRAppE: Detecting Malicious Facebook Applications. Proc. CoNEXT 2012.  ",
      "doi": "10.1145/2413176.2413213"
    },
    {
      "text": "Rzeszotarski, J.M. and Morris, M.R. Estimating the Social Costs of Friendsourcing. Proc. CHI 2014.  ",
      "doi": "10.1145/2556288.2557181"
    },
    {
      "text": "Takagi, H. et al. Social Accessibility: Achieving Accessibility through Collaborative Metadata Authoring. Proc. ASSETS 2008.  ",
      "doi": "10.1145/1414471.1414507"
    },
    {
      "text": "Teodoro, R. and Naaman, M. Fitter with Twitter?: Understanding Personal Health and Fitness Activity in Social Media. Proc. ICWSM 2013.",
      "doi": ""
    },
    {
      "text": "Vie, S. 2014. In defense of \"slacktivism\": The Human Rights Campaign Facebook logo as digital activism. First Monday. 19, 2014.",
      "doi": ""
    },
    {
      "text": "Voida, A. et al. Bridging Between Organizations and the Public: Volunteer Coordinators' Uneasy Relationship with Social Computing. Proc. CHI 2012.  ",
      "doi": "10.1145/2207676.2208341"
    },
    {
      "text": "Wu, S. and Adamic, L. Visually Impaired Users on an Online Social Network. Proc. CHI 2014.  ",
      "doi": "10.1145/2556288.2557415"
    }
  ]
}