{
  "doi": "10.1145/2702123.2702426",
  "title": "STRATOS: Using Visualization to Support Decisions in Strategic Software Release Planning",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1479-1488",
  "year": 2015,
  "badges": [],
  "abstract": "Software is typically developed incrementally and released in stages. Planning these releases involves deciding which features of the system should be implemented for each release. This is a complex planning process involving numerous trade-offs-constraints and factors that often make decisions difficult. Since the success of a product depends on this plan, it is important to understand the trade-offs between different release plans in order to make an informed choice. We present STRATOS, a tool that simultaneously visualizes several software release plans. The visualization shows several attributes about each plan that are important to planners. Multiple plans are shown in a single layout to help planners find and understand the trade-offs between alternative plans. We evaluated our tool via a qualitative study and found that STRATOS enables a range of decision-making processes, helping participants decide on which plan is most optimal.",
  "authors": [
    {
      "name": "Bon Adriel Aseniero",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-81500662637/rel-imgonly/photo_2020-04-10__23_51_29_cropped.jpg",
      "acmid": "81500662637",
      "orcid": "missing"
    },
    {
      "name": "Tiffany Wun",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696551",
      "orcid": "missing"
    },
    {
      "name": "David Ledo",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490690490",
      "orcid": "0000-0002-0455-7936"
    },
    {
      "name": "Guenther Ruhe",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100627329",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Sheelagh Carpendale",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616781",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amandeep, Ruhe, G., and Stanford, M. Intelligent Support for Software Release Planning. In F. Bomarius and H. Iida, eds., Product Focused Software Process Improvement. Springer Berlin Heidelberg, 2004, 248--262.",
      "doi": ""
    },
    {
      "text": "Anderson, D.J. Kanban. Blue Hole Press, 2010.",
      "doi": ""
    },
    {
      "text": "Bhawnani, P. and Ruhe, G. ReleasePlanner-Planning new Releases for Software Maintenance and Evolution. ICSM (Industrial and Tool Volume), (2005), 73--76.",
      "doi": ""
    },
    {
      "text": "Carlshamre, P., Sandahl, K., Lindvall, M., Regnell, B., and Natt och Dag, J. An Industrial Survey of Requirements Interdependencies in Software Product Release Planning. In Proc. Fifth IEEE International Symposium on Requirements Engineering, (2001), 84--91. ",
      "doi": "10.5555/882477.883633"
    },
    {
      "text": "Clark, W. and Gantt, H.L. The Gantt Chart, a Working Tool of Management. New York, Ronald Press, 1923.",
      "doi": ""
    },
    {
      "text": "Feather, M.S., Cornford, S.L., Kiper, J.D., and Menzies, T. Experiences using Visualization Techniques to Present Requirements, Risks to Them, and Options for Risk Mitigation. First International Workshop on Requirements Engineering Visualization, REV '06, (2006), 10.  ",
      "doi": "10.1109/REV.2006.2"
    },
    {
      "text": "Feiner, S. Seeing the Forest for the Trees: Hierarchical Displays of Hypertext Structures. In Proc. ACM SIGOIS and IEEECS TC-OA 1988 Conference on Office Information Systems, ACM (1988), 205--212.  ",
      "doi": "10.1145/45410.45432"
    },
    {
      "text": "France, R., Evans, A., Lano, K., and Rumpe, B. The UML as a Formal Modeling Notation. Computer Standards & Interfaces 19, 7 (1998), 325--334.  ",
      "doi": "10.1016/S0920-5489%2898%2900020-8"
    },
    {
      "text": "Greer, D. and Ruhe, G. Software Release Planning: An Evolutionary and Iterative Approach. Information and Software Technology 46, 4 (2004), 243--253.",
      "doi": ""
    },
    {
      "text": "Herrmann, K. Visualization of Release Planning. First International Workshop on Requirements Engineering Visualization, 2006. REV '06, (2006), 8--8.  ",
      "doi": "10.1109/REV.2006.7"
    },
    {
      "text": "Inselberg, A. and Dimsdale, B. Parallel Coordinates: A Tool for Visualizing Multi-dimensional Geometry. In Proc. 1st Conference on Visualization '90, IEEE (1990), 361--378. ",
      "doi": "10.5555/949531.949588"
    },
    {
      "text": "Jantunen, S., Lehtola, L., Gause, D.C., Dumdum, U.R., and Barnes, R.J. The Challenge of Release Planning. Fifth International Workshop on Software Product Management (IWSPM), (2011), 36--45.",
      "doi": ""
    },
    {
      "text": "Kosara, R., Bendix, F., and Hauser, H. Parallel Sets: Interactive Exploration and Visual Analysis of Categorical Data. IEEE Transactions on Visualization and Computer Graphics 12, 4 (2006), 558--568.  ",
      "doi": "10.1109/TVCG.2006.76"
    },
    {
      "text": "Riehmann, P., Hanfler, M., and Froehlich, B. Interactive Sankey Diagrams. IEEE INFOVIS, (2005), 233--240.  ",
      "doi": "10.1109/INFOVIS.2005.21"
    },
    {
      "text": "Ruhe, G. Product Release Planning: Methods, Tools and Applications. CRC Press, 2011.",
      "doi": ""
    },
    {
      "text": "Rumbaugh, J., Jacobson, I., and Booch, G. The Unified Modeling Language Reference Manual (2nd Edition). Pearson Higher Education, 2004. ",
      "doi": "10.5555/993859"
    },
    {
      "text": "Sankey, H.R. The Thermal Efficiency of Steam-Engines. Minutes of the Proceedings 125, 1896 (1896), 182--212.",
      "doi": ""
    },
    {
      "text": "Sedlmair, M., Meyer, M., and Munzner, T. Design Study Methodology: Reflections from the Trenches and the Stacks. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2431--2440.  ",
      "doi": "10.1109/TVCG.2012.213"
    },
    {
      "text": "Shneiderman, B. The Eyes Have It: A Task By Data Type Taxonomy for Information Visualizations. In Proc. Visual Languages, IEEE (1996), 336--343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Shneiderman, B. and Maes, P. Direct Manipulation vs. Interface Agents. Interactions 4, 6 (1997), 42--61.  ",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "Treude, C. and Storey, M. Awareness 2.0: Staying Aware of Projects, Developers and Tasks Using Dashboards and Feeds. ACM/IEEE 32nd International Conference on Software Engineering, (2010), 365--374.  ",
      "doi": "10.1145/1806799.1806854"
    },
    {
      "text": "Tufte, E.R. The Visual Display of Quantitative Information. Graphics Press, Cheshire, CT, 1983. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Wnuk, K., Regnell, B., and Karlsson, L. Visualization of Feature Survival in Platform-Based Embedded Systems Development for Improved Understanding of Scope Dynamics. Requirements Engineering Visualization, REV '08, (2008), 41--50.  ",
      "doi": "10.1109/REV.2008.6"
    }
  ]
}