{
  "doi": "10.1145/2702123.2702409",
  "title": "Sensors Know When to Interrupt You in the Car: Detecting Driver Interruptibility Through Monitoring of Peripheral Interactions",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "487-496",
  "year": 2015,
  "badges": [],
  "abstract": "Interruptions while driving can be quite dangerous, whether these are self-interruptions or external interruptions. They increase driver workload and reduce performance on the primary driving task. Being able to identify when a driver is interruptible is critical for building systems that can mediate these interruptions. In this paper, we collect sensor and human-annotated data from 15 drivers, including vehicle motion, traffic states, physiological responses and driver motion. We demonstrate that this data can be used to build a machine learning classifier that can determine interruptibility every second with a 94% accuracy. We present both population and individual models and discuss the features that contribute to the high performance of this system. Such a classifier can be used to build systems that mediate when drivers use technology to self-interrupt and when drivers are interrupted by technology.",
  "tags": [
    "sensor data mining",
    "interruptions",
    "naturalistic driving"
  ],
  "authors": [
    {
      "name": "SeungJun Kim",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81452593686/rel-imgonly/sjk_profile.jpg",
      "acmid": "81452593686",
      "orcid": "missing"
    },
    {
      "name": "Jaemin Chun",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659893925",
      "orcid": "missing"
    },
    {
      "name": "Anind K. Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailey, B.P., Iqbal, S.T. (2008). Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management, ACM TOCHI, 14 (4): 1--28.  ",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Bailey, B.P., Konstan, J.A. (2006). On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior, 22 (4): 685--708",
      "doi": ""
    },
    {
      "text": "Böhmer, M., Lander, C., Gehring, S., Brumby, D.P., and Krüger, A. (2014). Interrupted by a phone call: exploring designs for lowering the impact of call notifications for smartphone users. Proc. CHI '14, 3045--3054.  ",
      "doi": "10.1145/2556288.2557066"
    },
    {
      "text": "Cho, H., Rybski, P.E., Bar-Hillel, A., and Zhang, W. (2012). Real-time pedestrian detection with deformable part models. In IEEE Intelligent Vehicles Symp.: 1035--1042.",
      "doi": ""
    },
    {
      "text": "Curry, D., Meyer, J., and Jones, A. (2013). Driver Distraction: Are We Mistaking a Symptom for the Problem?. SAE Technical Paper 2013-01-0439.",
      "doi": ""
    },
    {
      "text": "Cutrell, E. B., Czerwinski, M., and Horvitz, E. (2000). Effects of instant messaging interruptions on computing tasks. Proc. CHIEA '00, 99--100.  ",
      "doi": "10.1145/633292.633351"
    },
    {
      "text": "Espinosa, F., Jimenez, J.A., Santiso, E., Gardel, A., Perez, D., Casanova, J. and Santos, C. (2011). Design and implementation of a portable electronic system for vehicle-driver-route activity measurement. Measurement 44 (2): 326--337.",
      "doi": ""
    },
    {
      "text": "Governors Highway Safety Association. Distracted driving: What research shows and what states can do. Technical Report. July 2011.",
      "doi": ""
    },
    {
      "text": "Green, P. (2004). Driver Distraction, Telematics Design, and Workload Managers: Safety Issues and Solutions in SAE publication P-387. Society of Automotive Engineers, Inc., Pennsylvania, USA, pp. 165--180",
      "doi": ""
    },
    {
      "text": "Haapalainen, E., Kim, S., Forlizzi, J., Dey, A. (2010). Psycho-physiological Measures for assessing Cognitive Load. In: Proc. Ubicomp '10, 301--310.  ",
      "doi": "10.1145/1864349.1864395"
    },
    {
      "text": "Hong, J., Margines, B., Dey, A.K. (2014) A Smartphonebased Sensing Platform to Model Aggressive Driving Behaviors, Proc. CHI '14, 4047--56.  ",
      "doi": "10.1145/2556288.2557321"
    },
    {
      "text": "Illinois. Rules of the Road. (2014). See Chapter 11 Safe Driving Tips for details on the \"three-second rule\".",
      "doi": ""
    },
    {
      "text": "Iqbal, S.T., Horvitz, E., Ju, Y.C., and Mathews, E. (2011). Hang on a sec!: effects of proactive mediation of phone conversations while driving. Proc. CHI '11, 463--472.  ",
      "doi": "10.1145/1978942.1979008"
    },
    {
      "text": "Kim, S., Hong, J., Li, K.A., Forlizzi, J., and Dey, A.K. (2012). Route Guidance Modality for Elder Driver Navigation. Pervasive '12 , 179--196.  ",
      "doi": "10.1007/978-3-642-31205-2_12"
    },
    {
      "text": "Klauer, S.G., Guo, F., Sudweeks, J. and Dingus, T.A. (2010). An Analysis of Driver Inattention Using a CaseCrossover Approach 100-Car Data: Final Report (Report No. DOT HS 811 334). NHTSA.",
      "doi": ""
    },
    {
      "text": "Kun, A.L., Shyrokov, A., and Heeman, P.A. (2013). Interactions between human-human multi-threaded dialogues and driving. Pers Ubiquit Comput. 17(5): 825--834.  ",
      "doi": "10.1007/s00779-012-0518-1"
    },
    {
      "text": "Larson, R., and Csikszentmihalyi, M. (1983). The experience sampling method\". New Directions for Methodology of Social and Behavioral Science. 15, 41--56.",
      "doi": ""
    },
    {
      "text": "Lee, J. D., Moeckli, J., Brown, T. L., Roberts, S. C., Schwarz, C., Yekhshatyan, L., Nadler, E., Liang, Y., Victor, T., Marshall, D., & Davis, C. (2013). Distraction Detection and Mitigation Through Driver Feedback. (Report No. DOT HS 811 547A). NHTSA.",
      "doi": ""
    },
    {
      "text": "Monk, C., Trafton, J., and Boehm-Davis, D. (2008). The effect of interruption duration and demand on resuming suspended goals, Journal of Experimental Psychology: Applied, 14 (4): 299--313.",
      "doi": ""
    },
    {
      "text": "Mulligan, C. B., Schneider, B., and Wolfe, R. (2000). Time use and population representation in the Sloan Study of Adolescents. Unpublished manuscript, Alfred P. Sloan/University of Chicago Center for the Study of Working Families.",
      "doi": ""
    },
    {
      "text": "Riener, A., Chalfoun, P., and Claude Frasson, C. (2014). The Potential of Subliminal Information Displays to Change Driver Behavior. Presence 23(1): 51--70.  ",
      "doi": "10.1162/PRES_a_00170"
    },
    {
      "text": "Salvucci, D.D. (2010) On reconstruction of task context after interruption. Proc. CHI '10, 89--92.  ",
      "doi": "10.1145/1753326.1753341"
    },
    {
      "text": "Schneegass, S., Pfleging, B., Broy, N., Heinrich, F., and Schmidt, A. (2013). A data set of real world driving to assess driver workload. Proc. Automotive UI '13, 150--7.  ",
      "doi": "10.1145/2516540.2516561"
    },
    {
      "text": "Sherin, K.M., Lowe, A.L., Harvey, B.J., Leiva, D.F., Malik, A., Matthews, S., Suh, R., and the ACPM Prevention Practice Committee. (2014). Preventing Texting While Driving. Am J Prev Med. (in press).",
      "doi": ""
    },
    {
      "text": "Simon, H.A. (1971). Designing organizations for an information rich world. In Computers, Communications, and the Public Interest: 37--72.",
      "doi": ""
    },
    {
      "text": "Solovey, E.T., Zec, M., Perez, E.A.G., Reimer, B. and Mehler, B. (2014). Classifying driver workload using physiological and driving performance data: two field studies. Proc. CHI '14, 4057--4066.  ",
      "doi": "10.1145/2556288.2557068"
    },
    {
      "text": "Trafton J. G., Altmann E. M., Brock D. P., and Mintz F. E. (2003). Preparing to resume an interrupted task: Effects of prospective goal encoding and retrospective rehearsal, IJHCS, 58 (5): 583--603.  ",
      "doi": "10.1016/S1071-5819%2803%2900023-5"
    }
  ]
}