{
  "doi": "10.1145/2702123.2702471",
  "title": "Designing Autism Research for Maximum Impact",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2801-2804",
  "year": 2015,
  "badges": [],
  "abstract": "In recent decades, rates of autism spectrum disorder (ASD) have risen dramatically, and research into assistive technologies for this population has similarly escalated. For technology to be adopted, technologists need to communicate with practitioners across fields and match methodological and evaluation standards. We provide a set of recommendations for researchers to bridge the gap between fields and maximize the impact of their research, including instructions on how to identify and describe research participants and how to avoid research confounds and challenges specific to this population. We also advocate that researchers in ASD maintain a nimble, adaptable approach when performing experiments.",
  "authors": [
    {
      "name": "Elizabeth J. Carter",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466641562",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Hyde",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959130257",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Psychiatric Association. DSM-IV-TR: Diagnostic and statistical manual of mental disorders, text revision. American Psychiatric Association, 2000.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. DSM-V: Diagnostic and statistical manual of mental disorders, 5th Edition. American Psychiatric Publishing, 2013. Section 299.00.",
      "doi": ""
    },
    {
      "text": "Andrist, S., Leite, I., and Lehman, J. Fun and fair: influencing turn-taking in a multi-party game with a virtual agent. In Proc. IDC (2013), 352--355.  ",
      "doi": "10.1145/2485760.2485800"
    },
    {
      "text": "Baron-Cohen, S., Golan, O., and Ashwin, E. Can emotion recognition be taught to children with autism spectrum conditions? Phil Trans Royal Soc B 364, 1535 (2009), 3567--3574.",
      "doi": ""
    },
    {
      "text": "Buescher, A., Cidav, Z., Knapp, M., and Mandell, D. Costs of autism spectrum disorders in the united kingdom and the USA. JAMA Pediatrics 168, 8 (2014), 721--728.",
      "doi": ""
    },
    {
      "text": "Carter, E., Williams, D., Hodgins, J., and Lehman, J. Are children with autism more responsive to animated characters? A study of interactions with humans and human-controlled avatars. J Autism Dev Disord 44, 10 (2014), 2475--2485.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. Prevalence of autism spectrum disorder among children aged 8 years -- Autism and developmental disabilities monitoring network, 11 sites, USA, 2010. MMWR 63, SS02 (2014), 1--21.",
      "doi": ""
    },
    {
      "text": "Constantino, J. Social Responsiveness Scale. WPS Torrance, CA, 2005.",
      "doi": ""
    },
    {
      "text": "Fletcher-Watson, S. A targeted review of computer-assisted learning for people with autism spectrum disorder: Towards a consistent methodology. J Autism Dev Disord 1, 2 (2014), 87--100.",
      "doi": ""
    },
    {
      "text": "Granpeesheh, D., Dixon, D., Tarbox, J., Kaplan, A., et al. The effects of age and treatment intensity on behavioral intervention outcomes for children with autism spectrum disorders. Res Autism Spect Dis 3, 4 (2009), 1014--1022.",
      "doi": ""
    },
    {
      "text": "Happé, F., and Frith, U. The weak coherence account: detail-focused cognitive style in autism spectrum disorders. J Autism Dev Disord 36, 1 (2006), 5--25.",
      "doi": ""
    },
    {
      "text": "Kana, R., Murdaugh, D., Libero, L., Pennick, M., et al. Probing the brain in autism using fMRI and diffusion tensor imaging. J Visual Exp, 55 (2011).",
      "doi": ""
    },
    {
      "text": "Kientz, J. A., Goodwin, M. S., Hayes, G. R., and Abowd, G. D. Interactive technologies for autism. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 2, 2 (2013), 1--177. ",
      "doi": "10.5555/2613712"
    },
    {
      "text": "Lord, C., Rutter, M., and Le Couteur, A. Autism diagnostic interview-revised: a revised version of a diagnostic interview for caregivers of individuals with possible pervasive developmental disorders. J Autism Dev Disord 24, 5 (1994), 659--685.",
      "doi": ""
    },
    {
      "text": "Lord, C., Risi, S., Lambrecht, L., Cook, E., et al. The autism diagnostic observation schedule-generic: A standard measure of social and communication deficits associated with the spectrum of autism. J Autism Dev Disord 30, 3 (2000), 205--223.",
      "doi": ""
    },
    {
      "text": "O'Malley, P., Lewis, M., Donehower, C., and Stone, D. Effectiveness of using iPads to increase academic task completion by students with autism. Univer J of Ed Res 2, 1 (2014), 90--97.",
      "doi": ""
    },
    {
      "text": "Rutter, M., Bailey, A., and Lord, C. Social Communication Questionnaire. WPS Torrance, CA, 2003.",
      "doi": ""
    },
    {
      "text": "Schopler, E., Reichler, R., and Renner, B. R. The Childhood Autism Rating Scale. Irvington NY, 1986.",
      "doi": ""
    },
    {
      "text": "Warren, Z., McPheeters, M., Sathe, N., Foss-Feig, J., et al. A systematic review of early intensive intervention for autism spectrum disorders. Pediatrics 127, 5 (2011), e1303--e1311.",
      "doi": ""
    },
    {
      "text": "World Health Organization. International Statistical Classification of Diseases and Related Health Problems, tenth revision (ICD-10). WHO, 2008.",
      "doi": ""
    }
  ]
}