{
  "doi": "10.1145/2702123.2702296",
  "title": "Mobile Gamification for Crowdsourcing Data Collection: Leveraging the Freemium Model",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1065-1074",
  "year": 2015,
  "badges": [],
  "abstract": "Classic ways of gathering data on human behaviour are time-consuming, costly and are subject to limited participant pools. Crowdsourcing offers a reduction in operating costs and access to a diverse and large participant pool; however issues arise concerning low worker pay and questions about data quality. Gamification provides a motivation to participate, but also requires the development of specialized, research-question specific games that can be costly to produce. Our solution combines gamification and crowdsourcing in a smartphone-based system that emulates the popular Freemium model of play to motivate voluntary participation through in-game rewards, using a robust framework to study multiple unrelated research questions within the same system. We deployed our game on the Android store and compared it to a gamified laboratory version and a non-gamified laboratory version, and found that players who used the in-game rewards were motivated to do experimental tasks. There was no difference between the systems for performance on a motor task; however, performance on the cognitive task was worse for the crowdsourced game. We discuss options for improving performance on tasks requiring attention.",
  "authors": [
    {
      "name": "Kristen Dergousoff",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058886457",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon's Mechanical Turk. (2014, January). Retrieved from Amazon's Mechanical Turk: https://www.mturk.com/mturk/",
      "doi": ""
    },
    {
      "text": "Cechanowicz, J., Gutwin, C., Brownell, B., & Goodfellow, L. (2013). Effects of Gamification on Participation and Data Quality in a Real-World Market Research Domain. Gamification 2013, (pp. 58--65). Stratford, Ontario.  ",
      "doi": "10.1145/2583008.2583016"
    },
    {
      "text": "Cleveland, W. S., & McGill, R. (1984). Graphical perception: Theory, experimentation, and application to the development of graphical methods. J. Am. Statistical Association, 79, 531--554.",
      "doi": ""
    },
    {
      "text": "Cooper, S., Khatib, F., Treuille, A., Barbero, J., Lee, J., Beenen, M., et al. (2010). Predicting protein structures with a multiplayer online game. Nature, 756--760.",
      "doi": ""
    },
    {
      "text": "de la Iglesia, J. L., & Gayo, J. E. (2009). Doing Business by Selling Free Services. In Web 2.0 (pp. 114).",
      "doi": ""
    },
    {
      "text": "Deterding, S., Bjork, S., Nacke, L. E., Dixon, D., & Lawley, E. (2013). Designing Gamification: Creating Gameful and Playful Experiences. CHI 2013: (pp. 3263--3266). Paris, France: ACM.  ",
      "doi": "10.1145/2468356.2479662"
    },
    {
      "text": "Deterding, S., Sicart, M., Nacke, L. E., O'Hara, K., & Dixon, D. (2011). Gamification: Using Game-Design Elements in Non-Gaming Contexts. CHI '11 Extended Abstracts (pp. 2425--2428)..  ",
      "doi": "10.1145/1979742.1979575"
    },
    {
      "text": "Downs, J. S., Holbrook, M. B., Sheng, S., & Cranor, L. F. (2010). Are your participants gaming the system?: Screening Mechanical Turk workers. In Proc. CHI '10 (pp. 2399--2402). ACM.  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Eickhoff, C., Harris, C., & de Vries, A. P. (2012). Quality through Flow and Immersion: Gamifying Crowdsourced Relevance Assessments. SIGIR'12 (pp. 871--880). ACM.  ",
      "doi": "10.1145/2348283.2348400"
    },
    {
      "text": "Fatla, D. R., Gutwin, C., Nacke, L. E., Bateman, S., & Mandryk, R. L. (2011). Calibration Games: Making Calibration Tasks Enjoyable by Adding Motivating Game Elements. UIST '11 (pp. 403--411).  ",
      "doi": "10.1145/2047196.2047248"
    },
    {
      "text": "Guy, I., Perer, A., Daniel, T., Greenshpan, O., & Turbahn, I. (2011). Guess Who? Enriching the Social Graph through a Crowdsourcing Game. CHI 2011 (pp. 1373--1382). Vancouver, BC: ACM.  ",
      "doi": "10.1145/1978942.1979145"
    },
    {
      "text": "Heer, J., & Bostock, M. (2010). Crowdsourcing Graphical Perception: Using Mechanical Turk to Asses Visualization Design. CHI 2010 (pp. 203--212).  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Komarov, S., Reinecke, K., & Gajos, K. Z. (2013). Crowdsourcing Performance Evaluations of User Interfaces. CHI 2013, Paris, France: ACM.  ",
      "doi": "10.1145/2470654.2470684"
    },
    {
      "text": "Kraut, R., Olson, J., Banaji, M., Bruckman, A., Cohen, J., & Couper, M. (2004). Psychological Research Online: Opportunities and Challenges. American Psychologist, 105--117.",
      "doi": ""
    },
    {
      "text": "MacKenzie, S. I. (1992). Fitts' Law as a Research and Design Tool in Human-Computer Interaction. HumanComputer Interaction, 7, 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Mason, W., & Suri, S. (2012). Conducting Behavioural Research on Amazon's Mechanical Turk. Behavior Research Methods, 1--23.",
      "doi": ""
    },
    {
      "text": "Reinecke, K., & Gajos, K. (n.d.). LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples. To appear in CSCW'15.  ",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "von Ahn, L., & Dabbish, L. (2004). Labeling Images with a Computer Game. CHI 2004 (pp. 319--326). Vienna, Austria: ACM.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "von Ahn, L., & Dabbish, L. (2008). Designing Games With A Purpose. Communications of the ACM, 58--67.  ",
      "doi": "10.1145/1378704.1378719"
    },
    {
      "text": "von Ahn, L., Ginosar, S., Kedia, M., Liu, R., & Blum, M. (2006). Improving Accessibility of the Web with a Computer Game. CHI 2006 (pp. 79--82). ACM.  ",
      "doi": "10.1145/1124772.1124785"
    },
    {
      "text": "Watson, D., Hancock, M., & Mandryk, R. (2013). Gamifying Behaviour that Leads to Learning. Gamification '13, (pp. 87--90).  ",
      "doi": "10.1145/2583008.2583021"
    }
  ]
}