{
  "doi": "10.1145/2702123.2702594",
  "title": "The Effects of Sequence and Delay on Crowd Work",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1375-1378",
  "year": 2015,
  "badges": [],
  "abstract": "A common approach in crowdsourcing is to break large tasks into small microtasks so that they can be parallelized across many crowd workers and so that redundant work can be more easily compared for quality control. In practice, this can result in the microtasks being presented out of their natural order and often introduces delays between individual microtasks. In this paper, we demonstrate in a study of 338 crowd workers that non-sequential microtasks and the introduction of delays significantly decreases worker performance. We show that interruptions where a large delay occurs between two related tasks can cause up to a 102% slowdown in completion time, and interruptions where workers are asked to perform different tasks in sequence can slow down completion time by 57%. We conclude with a set of design guidelines to improve both worker performance and realized pay, and instructions for implementing these changes in existing interfaces for crowd work.",
  "tags": [
    "efficiency",
    "workflows",
    "crowdsourcing",
    "interruptions",
    "continuity",
    "human computation"
  ],
  "authors": [
    {
      "name": "Walter S. Lasecki",
      "institution": "University of Rochester, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490695200",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey M. Rzeszotarski",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490684184",
      "orcid": "0000-0002-4317-9501"
    },
    {
      "name": "Adam Marcus",
      "institution": "Locu, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659551041",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P. D., and Bailey, B. P. If not now, when?: the effects of interruption at different moments within task execution. In CHI 2004.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Bernstein, M. S., et al.Soylent: a word processor with a crowd inside. In Proc. UIST, pages 313--322, 2010.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Bigham., J. P., et. al. Vizwiz: nearly real-time answers to visual questions. In Proc. UIST, pages 333--342, 2010.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Cabon, P., Coblentz, A., and Mollard, R. Interruption of a monotonous activity with complex tasks: effects of individual differences. In Human Factors Society, 1990.",
      "doi": ""
    },
    {
      "text": "Chilton, L. B., Horton, J. J., Miller, R. C., and Azenkot, S. Task search in a human computation market. In HCOMP 2010.  ",
      "doi": "10.1145/1837885.1837889"
    },
    {
      "text": "Cutrell, E., Czerwinski, M., and Horvitz, E. Notification, disruption, and memory: Effects of messaging interruptions on memory and performance. In Proc. INTERACT, pages 263--269, 2001.",
      "doi": ""
    },
    {
      "text": "Dow, S., Kulkarni, A., Klemmer, S., and Hartmann, B. Shepherding the crowd yields better work. In Proc. CSCW, pages 1013--1022, 2012.  ",
      "doi": "10.1145/2145204.2145355"
    },
    {
      "text": "Gillie, T. and Broadbent, D.. What makes interruptions disruptive? a study of length, similarity, and complexity. Psychological Research, 50:243--50, 1989.",
      "doi": ""
    },
    {
      "text": "Jansset, C. P., and Brumby, D. P. Strategic adaptation to performance objectives in a dualtask setting. Cognitive Science, 34(8):1548--1560, 2010.",
      "doi": ""
    },
    {
      "text": "Kreifeldt, J. G., and McCarthy, M. E. Interruption as a test of the user-computer interface. In Proc. MC, 1981.",
      "doi": ""
    },
    {
      "text": "Lasecki, W. S., Murray, K., White, S., Miller, R. C., and Bigham, J. P. Real-time crowd control of existing interfaces. In Proc. UIST, pages 23--32, 2011.  ",
      "doi": "10.1145/2047196.2047200"
    },
    {
      "text": "Lasecki, W. S., White, S., Murray, K. I., and Bigham, J. P. Crowd memory: Learning in the collective. In Proc. Collective Intelligence, 2012.",
      "doi": ""
    },
    {
      "text": "Pattyn, N., Neyt, X., Henderickx, D., and Soetens, E. Psychophysiological investigation of vigilance decrement: boredom or cognitive fatigue? Physiology and Behavior, 93(1-2):369--378, 2008.",
      "doi": ""
    }
  ]
}