{
  "doi": "10.1145/2702123.2702339",
  "title": "New Interaction Tools for Preserving an Old Language",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3493-3502",
  "year": 2015,
  "badges": [],
  "abstract": "The Penan people of Malaysian Borneo were traditionally nomads of the rainforest. They would leave messages in the jungle for each other by shaping natural objects into language tokens and arranging these symbols in specific ways -- much like words in a sentence. With settlement, the language is being lost as it is not being used by the younger generation. We report here, a tangible system designed to help the Penan preserve their unique object writing language. The key features of the system are that: its tangibles are made of real objects; it works in the wild; and new tangibles can be fabricated and added to the system by the users. Our evaluations show that the system is engaging and encourages intergenerational knowledge transfer and thus has the potential to help preserve this language.",
  "authors": [
    {
      "name": "Beryl Plimmer",
      "institution": "University of Auckland & National University Singapore, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81100596526/rel-imgonly/portrait2008.jpg",
      "acmid": "81100596526",
      "orcid": "missing"
    },
    {
      "name": "Liang He",
      "institution": "Carnegie Mellon University & National University Singapore, Pittsburgh, USA",
      "img": "/do/10.1145/contrib-81548025594/rel-imgonly/liang-profile.jpg",
      "acmid": "81548025594",
      "orcid": "missing"
    },
    {
      "name": "Tariq Zaman",
      "institution": "Universiti Malaysia Sarawak, Kuching, Malaysia",
      "img": "/do/10.1145/contrib-83058888357/rel-imgonly/tariq.jpg",
      "acmid": "83058888357",
      "orcid": "missing"
    },
    {
      "name": "Kasun Karunanayaka",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448602211",
      "orcid": "missing"
    },
    {
      "name": "Alvin W. Yeo",
      "institution": "Universiti Malaysia Sarawak, Kuching, Malaysia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100426389",
      "orcid": "missing"
    },
    {
      "name": "Garen Jengan",
      "institution": "Universiti Malaysia Sarawak, Long Lamai, Malaysia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696818",
      "orcid": "missing"
    },
    {
      "name": "Rachel Blagojevic",
      "institution": "Massey University, Palmerston North, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585590",
      "orcid": "missing"
    },
    {
      "name": "Ellen Yi-Luen Do",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81100609985/rel-imgonly/ellendo025x.jpg",
      "acmid": "81100609985",
      "orcid": "0000-0002-9948-6375"
    }
  ],
  "references": [
    {
      "text": "Barrett, G. and Omote, R., Projected-capacitive touch technology. Information Display, 26, 3, (2010) 16--21.",
      "doi": ""
    },
    {
      "text": "Bidwell, N. J., Reitmaier, T., Marsden, G., & Hansen, S., Designing with mobile digital storytelling in rural Africa. In Proc Chi2010, ACM, (2010), 1593--1602.  ",
      "doi": "10.1145/1753326.1753564"
    },
    {
      "text": "Blagojevic, R., and Plimmer, B. CapTUI: Geometric Drawing with Tangibles on a Capacitive Multi-touch Display. In Proc INTERACT. (2013), 511--528.",
      "doi": ""
    },
    {
      "text": "Bogdan, R. C. and Biklen, S. K. Qualitative research in education. An introduction to theory and methods. Allyn & Bacon, MA, USA, 2010",
      "doi": ""
    },
    {
      "text": "Chan, L., Müller, S., et al, CapStones and ZebraWidgets: sensing stacks of building blocks, dials and sliders on capacitive touch screens. In Proc CHI 2012, ACM, (2012) pp. 2189--2192.  ",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Chipman, G., Fails, J. A., Druin, A. and Guha, M. L., Paper vs. tablet computers: a comparative study using Tangible Flags. In Proc IDC, ACM (2012), 29--36).  ",
      "doi": "10.1145/1999030.1999034"
    },
    {
      "text": "Do, E. YL, Gross, MD. Environments for Creativity: A Lab for Making Things, ACM C&C (2007) 27--36  ",
      "doi": "10.1145/1254960.1254965"
    },
    {
      "text": "Druin, A., Montemayor, J.et al, Designing PETS: A personal electronic teller of stories. In Proceedings CHI 1999, ACM (1999), 326--329.  ",
      "doi": "10.1145/302979.303103"
    },
    {
      "text": "Fitzmaurice, G. W., Buxton, W., An empirical evaluation of graspable user interfaces: towards specialized, space-multiplexed input. In Proc CHI 1997, ACM (1997), 43--50.  ",
      "doi": "10.1145/258549.258578"
    },
    {
      "text": "Fitzmaurice, G. W., Ishii, H. and Buxton, W. A. (1995, May). Bricks: laying the foundations for graspable user interfaces. In Proc CHI 1995, ACM (1995), 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Geertz, C. The interpretation of cultures: Selected essays Basic books, Vol. 5019, 1973.",
      "doi": ""
    },
    {
      "text": "Hengeveld, B., Hummels, et al, Tangibles for toddlers learning language. In Proc TEI (2009), pp. 161--168.  ",
      "doi": "10.1145/1517664.1517702"
    },
    {
      "text": "Ishii, H., Tangible bits: beyond pixels. In Proc TEI, ACM, (2008), xv-xxv  ",
      "doi": "10.1145/1347390.1347392"
    },
    {
      "text": "Jensen, H. Sign, symbol and script: An account of man's efforts to write. London: Allen & Unwin. 1970",
      "doi": ""
    },
    {
      "text": "Karime, A., Hossain, et al, A., Magic stick: a tangible interface for the edutainment of young children. In Proc ICME 2009. IEEE (2009), 1338--1341. ",
      "doi": "10.5555/1698924.1699254"
    },
    {
      "text": "Kratz, S., et al. CapWidgets: tangible widgets versus multi-touch controls on mobile devices. In Ext Abstracts CHI'11 ACM, 2011, (1351--135).  ",
      "doi": "10.1145/1979742.1979773"
    },
    {
      "text": "Liang, R. H., Chan, L., et al., GaussBricks: magnetic building blocks for constructive tangible interactions on portable displays. In Proc CHI 2014, ACM (2014), 3153--3162  ",
      "doi": "10.1145/2556288.2557105"
    },
    {
      "text": "Martínez, C., Digital Ayoyote Rattle: The Design of a Portable Low-Cost Digital Media System for a Mediated XicanIndio Resolana, In Proc IKTC, 2011, pp 88--97",
      "doi": ""
    },
    {
      "text": "Mayhew, D. J., The usability engineering lifecycle. In CHI'99 Extended Abstracts, ACM, (1999) 147--148.  ",
      "doi": "10.1145/632716.632805"
    },
    {
      "text": "Nielsen, J. 10 Usability Heuristics for User Interface Design. Nielsen Norman Group: Evidence-Based User Experience Research, Training, and Consulting. (1995)",
      "doi": ""
    },
    {
      "text": "Olson, I. C., Leong, Z.A., et al., It's just a toolbar!: using tangibles to help children manage conflict around a multi-touch tabletop. In Proc TEI, ACM, (2011), 29--36.  ",
      "doi": "10.1145/1935701.1935709"
    },
    {
      "text": "Price, S. and Marshall, P. (2013). Designing for learning with tangible technologies. Handbook of Design in Educational Technology, 288.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J., SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In Proc CHI 2002, ACM, (2002), 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Schuler, D., and Namioka, A., Participatory design: Principles and practices. L. Erlbaum Associates, 1993. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Shaer, O. and Hornecker, E., Tangible user interfaces: past, present, and future directions. Foundations & Trends in HCI, 3,1-2, (2010). 1--137.  ",
      "doi": "10.1561/1100000026"
    },
    {
      "text": "Schneider, B., Jermann, P., et al, Benefits of a tangible interface for collaborative learning and interaction. IEEE Trans on Learning Technologies, 4.3, (2011). 222232.  ",
      "doi": "10.1109/TLT.2010.36"
    },
    {
      "text": "Sia, C. and Tan, H., Little Chef: A Mergence of Kinesthetic and Digital Play, IDC 2014 Demos.",
      "doi": ""
    },
    {
      "text": "Simons, G. F. and Lewis, M. P. The world's languages in crisis. Responses to Language Endangerment. New directions in language documentation and language revitalization, (2013), 142, 3.",
      "doi": ""
    },
    {
      "text": "Smith, A., Reitsma, L., et al, Towards Preserving Indigenous Oral Stories Using Tangible Objects. In Culture and Computing, IEEE, (2011) pp. 86--91 IEEE.  ",
      "doi": "10.1109/Culture-Computing.2011.24"
    },
    {
      "text": "Suzuki, H. and Kato, H., AlgoBlock: a tangible programming language, a tool for collaborative learning. In Proc of 4th European Logo Conference, (1993), 297303.",
      "doi": ""
    },
    {
      "text": "Ullmer, B. and Ishii, H., The metaDESK: models and prototypes for tangible user interfaces. In Proc UIST, ACM, (1997), 223--232. ACM.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Ullmer, B. and Ishii, H., Emerging frameworks for tangible user interfaces. IBM systems journal, 39,3.4, (2000), 915--931.  ",
      "doi": "10.1147/sj.393.0915"
    },
    {
      "text": "Voida, A. and Greenberg, S., Console gaming across generations: Exploring intergenerational interactions in collocated console gaming. Universal Access in the Information Society, 11:1, (2012), 45--56.  ",
      "doi": "10.1007/s10209-011-0232-1"
    },
    {
      "text": "Wellner, P., The DigitalDesk calculator: tangible manipulation on a desk top display. In Proc UIST, ACM, (1991), 27--33).  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Xie, L., Antle, A. N. et al, Are tangibles more fun?: comparing children's enjoyment and engagement using physical, graphical and tangible user interfaces. In Proc TEI, ACM, (2008), 191--198.  ",
      "doi": "10.1145/1347390.1347433"
    },
    {
      "text": "Yu, N. H., Chan, L. W., et al, TUIC: enabling tangible interaction on capacitive multi-touch displays. In Proc CHI'91, ACM, (1991), pp. 2995--3004.  ",
      "doi": "10.1145/1978942.1979386"
    },
    {
      "text": "Zaman, T., Jengan, G., et al. Signs, Concepts and Representation: Experiences in Documentation of Penan Indigenous Knowledge, In Proc 4th Regional Conference On Local Knowledge, Kuching, Malaysia., 2014",
      "doi": ""
    }
  ]
}