{
  "doi": "10.1145/2702123.2702125",
  "title": "Long-Term Use of Motion-Based Video Games in Care Home Settings",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1573-1582",
  "year": 2015,
  "badges": [],
  "abstract": "Recent research suggests that motion-based video games have the potential to provide both mental and physical stimulation for older adults in residential care. However, little research has explored the practical challenges and opportunities that arise from integrating these games within existing schedules of activities in these contexts. In our work, we report on a qualitative enquiry that was conducted over a three month period at two long-term care facilities. Findings suggest that older adults enjoyed playing video games, and that games can be a valuable means of re-introducing challenge in late life, but that the impact of age-related changes and impairment can influence people's ability to engage with games in a group setting. We outline core challenges in the design for care context and discuss implications of our work regarding the suitability of games as a self-directed leisure activity.",
  "authors": [
    {
      "name": "Kathrin M. Gerling",
      "institution": "University of Lincoln, Lincoln, Lincolnshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    },
    {
      "name": "Conor Linehan",
      "institution": "University of Lincoln, Lincoln, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440592407",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alankus, G., Lazar, A., May, M., and Kelleher, C. Towards Customizable Games for Stroke Rehabilitation. In: Proc. of CHI 2010, ACM Press (2010), 2113--2122.  ",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "Anderson-Hanley, C., Arciero, P.J., Brickman, A.M., Nimon, J.P., Okuma, N., Westen, S.C., Merz, M.E., Pence, B.D., Woods, J.A., Kramer, A.F., and Zimmerman, E.A. Exergaming and Older Adult Cognition: A Cluster Randomized Clinical Trial. Am J Prev Med 42, 2 (2012), 109--119.",
      "doi": ""
    },
    {
      "text": "Bateni, H. Changes in balance in older adults based on use of physical therapy vs the Wii Fit gaming system: a preliminary study. Physiotherapy (2011).",
      "doi": ""
    },
    {
      "text": "Blythe, M., Wright, P., Bowers, J., Boucher, A., Jarvis, N., Reynolds, P., and Gaver, B. Age and Experience: Ludic engagement in a residential care setting. In: Proc. of DIS 2010, ACM Press (2010), 161--170.  ",
      "doi": "10.1145/1858171.1858200"
    },
    {
      "text": "Brandstädter, J., and Greve, W. The Aging Self: Stabilizing and Protective Processes. Developmental Review, 42 (1994), 52--80.",
      "doi": ""
    },
    {
      "text": "Braun, V., and Clarke, V. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Ngo, V., and Park, S.Y. Caring for Caregivers: Designing for Integrality. In: Proc. of CSCW 2012, ACM (2012), 91--102.  ",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "De Schutter, B. Never Too Old to Play: The Appeal of Digital Games to an Older Audience. Games and Culture 6, 2 (2011), 155--170.",
      "doi": ""
    },
    {
      "text": "Folstein, M.F., Folstein, S.E., and McHugh, P.R. \"MiniMental State\" -- A Practical Method for Grading the Cognitive State of Patiens for the Clinician. J Psychiat Res 12, (1975), 189--198.",
      "doi": ""
    },
    {
      "text": "Gerling, K.M., Livingston, I.J., Nacke, L.E., and Mandryk, R.L. Full-Body Motion-Based Game Interaction for Older Adults. In: Proc. of CHI 2012, ACM Press (2012).  ",
      "doi": "10.1145/2207676.2208324"
    },
    {
      "text": "Gerling, K.M., Mandryk, R.L., and Kalyn, M.R. Wheelchair-Based Game Design for Older Adults. In: Proc. of ASSETS 2013, ACM Press (2013).  ",
      "doi": "10.1145/2513383.2513436"
    },
    {
      "text": "Harley, D., Fitzpatrick, G., Axelrod, L., White, G., and McAllister, G. Making the Wii at home: game play by older people in sheltered housing. HCI in Work and Learning, Life and Leisure, Springer (2010), 156--176. ",
      "doi": "10.5555/1947789.1947802"
    },
    {
      "text": "Jung, Y., Li, J.K., Janissa, N.S., Gladys, W.L.C., and Lee, K.M. Games for a better life: effects of playing Wii games on the well-being of seniors in a long-term care facility. In: Proc. of IE '09, ACM Press (2009).  ",
      "doi": "10.1145/1746050.1746055"
    },
    {
      "text": "Khan, D.U., Siek, K.A., Meyers, J., Haverhals, L.M., Cali, S., and Ross, S.E. Designing a Personal Health Application for Older Adults to Manage Medication. In: Proc. of IHI '10, ACM (2010).  ",
      "doi": "10.1145/1882992.1883124"
    },
    {
      "text": "Kientz, J.A., Patel, S.N., Jones, B., Price, E.D., Mynatt, E.D., & Abowd, G.D. The Georgia Tech Aware Home. In: EA of CHI 2008, ACM Press (2008), 3675--3680.  ",
      "doi": "10.1145/1358628.1358911"
    },
    {
      "text": "Lindley, S.E., Harper, R., and Sellen, A. Designing for Elders: Exploring the Complexity of Relationships in Later Life. In: Proc. of HCI 2008, ACM (2008), 77--86. ",
      "doi": "10.5555/1531514.1531525"
    },
    {
      "text": "Marston, H.R., Greenlay, S., and van Hoof, J. Understanding the Nintendo Wii and Microsoft Kinect consoles in long-term care facilities. Technology and Disability 25, 2 (2013), 77--85.",
      "doi": ""
    },
    {
      "text": "Mueller, F., Edge, D., Vetere, F., Gibbs, M.R., Agamanolis, S., Bongers, B., and Sheridan, J.G. Designing Sports: A Framework for Exertion Games. In: Proc. of CHI 2011, ACM (2011), 2651--2660.  ",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Müller, C., Neufeldt, C., Randall, D., and Wulf, V. ICTDevelopment in Residential Care Settings: Sensitizing Design to the Life Circumstances of the Residents of a Care Home. In: Proc. of CHI 2012, ACM Press (2012).  ",
      "doi": "10.1145/2207676.2208655"
    },
    {
      "text": "Nap, H.H., de Kort, Y.A.W., and IJsselteijn, W.A. Senior gamers: Preferences, motivations and needs. Gerontechnology 8, 4 (2009), 247--262.",
      "doi": ""
    },
    {
      "text": "Pedell, S., Beh, J., Mozuna, K., and Duong, S. Engaging Older Adults in Activity Group Settings Playing Games on Touch Tablets. In: Proc. of OzCHI'13, ACM (2013), 477--480.  ",
      "doi": "10.1145/2541016.2541090"
    },
    {
      "text": "Pelham, B.W., and Swann, W.B. From Self-Conceptions to Self-Worth: On the Sources and Structure of Global Self-Esteem. Journal of Personality and Social Psychology 57, 4 (1989), 672--680.",
      "doi": ""
    },
    {
      "text": "Penedo, F.J., and Dahn, J.R. Exercise and well-being: a review of mental and physical health benefits associated with physical activity. Curr Opin Psychiatry, 18 (2005).",
      "doi": ""
    },
    {
      "text": "Rice, M., Tan, W.P., Ong, J., Yau, L.J., Wan, M., and Ng, J. The Dynamics of Younger and Older Adult's Paired Behaviour When Playing an Interactive Silhouette Game. In: Proc. of CHI 2013, ACM (2013), 1081--1090.  ",
      "doi": "10.1145/2470654.2466138"
    },
    {
      "text": "Ryan, R., Rigby, C., and Przybylski, A. Motivational pull of video games: A self-determination theory approach. Motivation and Emotion, 30 (2006), 347--365.",
      "doi": ""
    },
    {
      "text": "Theng, Y.-L., Chua, P.-H., and Pham, T.P. Wii as Entertainment and Socialisation Aid for the Mental and Social Health of the Elderly. In: EA of CHI 2012, ACM (2012), 691--702.  ",
      "doi": "10.1145/2212776.2212840"
    },
    {
      "text": "Ulbrecht, G., Wagner, D., and Gräßel, E. Exergames and Their Acceptance Among Nursing Home Residents. Activities, Adaptation & Aging 36, 2 (2012), 93--106.",
      "doi": ""
    },
    {
      "text": "Uzor, S., and Baille, L. Investigating the Long-Term Use of Exergames in the Home With Elderly Fallers. In: Proc. of CHI 2014, ACM (2014), 2813--2822  ",
      "doi": "10.1145/2556288.2557160"
    },
    {
      "text": "Vanden Abeele, V. and De Schutter, B. Meaningful Play in Elderly Life. In: Proc. of ICA 2008, (2008).",
      "doi": ""
    }
  ]
}