{
  "doi": "10.1145/2702123.2702579",
  "title": "Flow of Competence in UX Design Practice",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3285-3294",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "UX and design culture are beginning to dominate corporate priorities, but despite the current hype there is often a disconnect between the organizational efficiencies desired by executives and the knowledge of how UX can or should address these issues. This exploratory study addresses this space by reframing the concept of competence in UX to include the flow of competence between individual designers and the companies in which they work. Our reframing resulted in a preliminary schema based on interviews conducted with six design practitioners, which allows this flow to be traced in a performative way on the part of individuals and groups over time. We then trace this flow of individual and organizational competence through three case studies of UX adoption. Opportunities for use of this preliminary schema as a generative, rhetorical tool for HCI researchers to further interrogate UX adoption are considered, including accounting for factors that affect adoption.",
  "authors": [
    {
      "name": "Colin M. Gray",
      "institution": "Iowa State University, Ames, IA, USA",
      "img": "/do/10.1145/contrib-87959081657/rel-imgonly/gray_headshot.jpg",
      "acmid": "87959081657",
      "orcid": "missing"
    },
    {
      "name": "Austin L. Toombs",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597484",
      "orcid": "missing"
    },
    {
      "name": "Shad Gross",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484646796",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyris, C. and Schön, D.A. Theory in practice: Increasing professional effectiveness. Jossey-Bass Publishers, San Francisco, 1974.",
      "doi": ""
    },
    {
      "text": "Arvola, M. and Artman, H. Studio life: The construction of digital design competence. Digital Kompetanse 3, 2 (2008), 78--96.",
      "doi": ""
    },
    {
      "text": "Bærentsen, K.B. and Slavensky, H. A contribution to the Design Process. Comm. of the ACM 42, 5 (1999), pp. 72--77.  ",
      "doi": "10.1145/301353.301422"
    },
    {
      "text": "Bødker, S., Ehn, P., Sjögren, D. and Sundblad, Y. Cooperative design \"Perspectives on 20 years with the Scandinavian IT Design Model\". Proc. NordiCHI, (2000), 22--24.",
      "doi": ""
    },
    {
      "text": "Buur, J. and Bødker, S. From usability lab to \"design collaboratorium\": Reframing usability practice. Proc. DIS, ACM (2000), pp. 297--307.  ",
      "doi": "10.1145/347642.347768"
    },
    {
      "text": "Cooper, A. The inmates are running the asylum. Pearson Education, Indianapolis, IN, 2004. ",
      "doi": "10.5555/984201"
    },
    {
      "text": "Fabricant, R. Scaling your UX Strategy. Harvard Business Review, 2013, January 7. Retrieved from http://blogs.hbr.org/2013/01/scaling-your-ux-strategy/",
      "doi": ""
    },
    {
      "text": "Friedland, L., Innes, J., Longoria, R., Hom, W., Henry, P. and Anderson, R. Outsourcing & offshoring: Impact on the user experience. Proc. CHI, ACM (2005), 11701171.  ",
      "doi": "10.1145/1056808.1056866"
    },
    {
      "text": "Futt, Y.S. and Rasid, H. Meta Design. 2011, May. 156159. Retrieved from http://www.ideo.com/images/ uploads/news/pdfs/Designare.pdf",
      "doi": ""
    },
    {
      "text": "Glaser, B.G. and Strauss, A.L. The discovery of grounded theory: Strategies for qualitative research. Alpine de Gruyter, New York, 1967.",
      "doi": ""
    },
    {
      "text": "Gobert, D., Howlett, V., Snyder, C., Tamler, H., Tullis, T.S. and Wilson, C. What the best usability specialists are made of. Proc. CHI, ACM (2002), pp. 706--707.  ",
      "doi": "10.1145/506443.506556"
    },
    {
      "text": "Governor, J. On The Importance of Design at IBM: Love and Margins. 2013, January 7. Retrieved from http://redmonk.com/jgovernor/2013/01/07/on-theimportance-of-design-at-ibm-love-and-margins/",
      "doi": ""
    },
    {
      "text": "Gray, C.M. Evolution of Design Competence in UX Practice. Proc. CHI'14, ACM (2014), pp. 1645--2654.  ",
      "doi": "10.1145/2556288.2557264"
    },
    {
      "text": "Gray, C.M., Stolterman, E. and Siegel, M.A. Reprioritizing the Relationship Between HCI Research and Practice: Bubble-Up and Trickle-Down Effects. Proc. DIS'14, ACM (2014), 725--734.  ",
      "doi": "10.1145/2598510.2598595"
    },
    {
      "text": "Holmlid, S. and Arvola, M. 2007. Developing a thematic design curriculum as a Bologna master. International Conference on Engineering and Product Design Education (2007), 13--14.",
      "doi": ""
    },
    {
      "text": "Nelson, H.G. and Stolterman, E. The design way: Intentional change in an unpredictable world. MIT Press, Cambridge, 2012. ",
      "doi": "10.5555/2380996"
    },
    {
      "text": "Nieminen, M.P., Runonen, M., Nieminen, M. and Tyllinen, M. Designer experience: Exploring ways to design in experience. Proc. CHI, ACM (2011), 24492452.  ",
      "doi": "10.1145/1979742.1979581"
    },
    {
      "text": "Olsson, E. What active users and designers contribute in the design process. Interacting with computers 16, 2 (2004), 377--401.",
      "doi": ""
    },
    {
      "text": "Rychen, D.S. and Salganik, L.H. A holistic model of competence. In Key competencies for a successful life and a well-functioning society. Hogrefe & Huber, Göttingen, Germany, 2003, pp. 41--62.",
      "doi": ""
    },
    {
      "text": "Szóstek, A. A look into some practices behind Microsoft UX management. Proc. CHI, ACM (2012), 605--618.  ",
      "doi": "10.1145/2212776.2212833"
    },
    {
      "text": "Thompson, C.F., Anderson, R.I., Au, I., Ratzlaff, C. and Zada, N. Managing user experience: Managing change. Proc. CHI, ACM (2010), 3143--3146.  ",
      "doi": "10.1145/1753846.1753938"
    },
    {
      "text": "Yin, R.K. Case study research: Design and methods. Sage Publications, Los Angeles, Calif., 2009.",
      "doi": ""
    },
    {
      "text": "Weinert, F.E. Concept of competence: A conceptual clarification. In D.S. Rychen and L.A. Salganik, editor, Defining and selecting key competencies. Hogrefe & Huber, Seattle, WA, 2001, 45--66",
      "doi": ""
    }
  ]
}