{
  "doi": "10.1145/2702123.2702241",
  "title": "Towards Making Random Passwords Memorable: Leveraging Users' Cognitive Ability Through Multiple Cues",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2315-2324",
  "year": 2015,
  "badges": [],
  "abstract": "Given the choice, users produce passwords reflecting common strategies and patterns that ease recall but offer uncertain and often weak security. System-assigned passwords provide measurable security but suffer from poor memorability. To address this usability-security tension, we argue that systems should assign random passwords but also help with memorization and recall. We investigate the feasibility of this approach with CuedR, a novel cued-recognition authentication scheme that provides users with multiple cues (visual, verbal, and spatial) and lets them choose the cues that best fit their learning process for later recognition of system-assigned keywords. In our lab study, all 37 of our participants could log in within three attempts one week after registration (mean login time: 38.0 seconds). A pilot study on using multiple CuedR passwords also showed 100% recall within three attempts. Based on our results, we suggest appropriate applications for CuedR, such as financial and e-commerce accounts.",
  "authors": [
    {
      "name": "Mahdi Nasrullah Al-Ameen",
      "institution": "The University of Texas at Arlington, Arlington, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553815456",
      "orcid": "missing"
    },
    {
      "name": "Matthew Wright",
      "institution": "The University of Texas at Arlington, Arlington, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659958",
      "orcid": "missing"
    },
    {
      "name": "Shannon Scielzo",
      "institution": "The University of Texas at Arlington, Arlington, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84460327557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Passfaces corporation. The science behind Passfaces. White paper, http://www.passfaces.com/enterprise/ resources/white_papers.htm.",
      "doi": ""
    },
    {
      "text": "Al-Ameen, M. N., and Wright, M. A comprehensive study of the GeoPass user authentication scheme. Tech. rep., arXiv:1408.2852 {cs.HC}, 2014.",
      "doi": ""
    },
    {
      "text": "Anderson, J. R., and Bower, G. H. Recognition and recall processes in free recall. Psychological Review 79(2) (1972).",
      "doi": ""
    },
    {
      "text": "Atinkson, C. R., and Shiffrin, M. R. Human memory: A proposed system and its control processes. K.W. Spence and J.T. Spence (eds), Advances in the psychology of learning and motivation, New York academic press (1968).",
      "doi": ""
    },
    {
      "text": "Biddle, R., Chiasson, S., and van Oorschot, P. Graphical passwords: Learning from the first twelve years. ACM Computing Surveys 44(4) (2012).  ",
      "doi": "10.1145/2333112.2333114"
    },
    {
      "text": "Bonneau, J. The science of guessing: Analyzing an anonymized corpus of 70 million passwords. In IEEE S&P (2012).  ",
      "doi": "10.1109/SP.2012.49"
    },
    {
      "text": "Bonneau, J., and Preibusch, S. The password thicket: Technical and market failures in human authentication on the Web. In WEIS (2010).",
      "doi": ""
    },
    {
      "text": "Bridis, T. Hacker impersonated Palin, stole e-mail password. Associated Press, Sep. 18 2008.",
      "doi": ""
    },
    {
      "text": "Chiasson, S., Biddle, R., and van Oorschot, P. C. A second look at the usability of click-based graphical passwords. In SOUPS (2007).  ",
      "doi": "10.1145/1280680.1280682"
    },
    {
      "text": "Chiasson, S., Forget, A., Biddle, R., and van Oorschot, P. User interface design affects security: Patterns in click-based graphical passwords. International Journal of Information Security 8(6) (2009).  ",
      "doi": "10.1007/s10207-009-0080-7"
    },
    {
      "text": "Chiasson, S., Stobert, E., Biddle, R., and van Oorschot, P. Persuasive cued click-points: design, implementation, and evaluation of a knowledge- based authentication mechanism. IEEE TDSC 9 (2012).  ",
      "doi": "10.1109/TDSC.2011.55"
    },
    {
      "text": "Chiasson, S., van Oorschot, P. C., and Biddle, R. A usability study and critique of two password managers. In USENIX (2006). ",
      "doi": "10.5555/1267336.1267337"
    },
    {
      "text": "Chiasson, S., van Oorschot, P. C., and Biddle, R. Graphical password authentication using cued click points. In ESORICS (2007). ",
      "doi": "10.5555/2393847.2393880"
    },
    {
      "text": "Das, A., Bonneau, J., Caesar, M., Borisov, N., and Wangz, X. The tangled web of password reuse. In NDSS (2014).",
      "doi": ""
    },
    {
      "text": "Davis, D., Monrose, F., and Reiter, M. On user choice in graphical password schemes. In USENIX Security (2004). ",
      "doi": "10.5555/1251375.1251386"
    },
    {
      "text": "Dirik, A. E., Memon, N., and Birget, J.-C. Modeling user choice in the passpoints graphical password scheme. In SOUPS (2007).  ",
      "doi": "10.1145/1280680.1280684"
    },
    {
      "text": "Dunphy, P., and Yan, J. Do background images improve \"Draw a Secret\" graphical passwords? In CCS (2007).  ",
      "doi": "10.1145/1315245.1315252"
    },
    {
      "text": "Everitt, K., Bragin, T., Fogarty, J., and Kohno, T. A comprehensive study of frequency, interference, and training of multiple graphical passwords. In CHI (2009).  ",
      "doi": "10.1145/1518701.1518837"
    },
    {
      "text": "Florencio, D., and Herley, C. Where do security policies come from? In SOUPS (2010).  ",
      "doi": "10.1145/1837110.1837124"
    },
    {
      "text": "Forget, A. A World with Many Authentication Schemes. PhD thesis, Carleton University, 2012.",
      "doi": ""
    },
    {
      "text": "Forget, A., Chiasson, S., van Oorschot, P., and Biddle, R. Improving text passwords through persuasion. In SOUPS (2008).  ",
      "doi": "10.1145/1408664.1408666"
    },
    {
      "text": "Forget, A., Chiasson, S., van Oorschot, P. C., and Biddle, R. Persuasion for stronger passwords: Motivation and pilot study. In PT (2008).  ",
      "doi": "10.1007/978-3-540-68504-3_13"
    },
    {
      "text": "Hayashi, E., and Hong, J. I. A diary study of password usage in daily life. In CHI (2011).  ",
      "doi": "10.1145/1978942.1979326"
    },
    {
      "text": "Hlywa, M., Biddle, R., and Patrick, A. S. Facing the facts about image type in recognition-based graphical passwords. In ACSAC (2011).  ",
      "doi": "10.1145/2076732.2076754"
    },
    {
      "text": "Jermyn, I., Mayer, A., Monrose, F., Reiter, M., and Rubin, A. The design and analysis of graphical passwords. In USENIX Security (1999). ",
      "doi": "10.5555/1251421.1251422"
    },
    {
      "text": "Kaliski, B. RFC 2898: PKCS #5: Password-based cryptography specification version 2.0, Sep. 2000. ",
      "doi": "10.17487/rfc2898"
    },
    {
      "text": "Li, Z., He, W., Akhawe, D., and Song, D. The emperor's new password manager: Security analysis of Web-based password managers. In USENIX Security (Aug. 2014). ",
      "doi": "10.5555/2671225.2671255"
    },
    {
      "text": "Nali, D., and Thorpe, J. Analyzing user choice in graphical passwords. Tech. Rep. TR-04-01, School of Computer Science, Carleton University, 2004.",
      "doi": ""
    },
    {
      "text": "Nelson, D. L., Reed, V. S., and McEvoy, C. L. Learning to order pictures and words: A model of sensory and semantic encoding. Journal of Experimental Psychology: Human Learning and Memory 3(5) (1977).",
      "doi": ""
    },
    {
      "text": "Nicholson, J., Coventry, L., and Briggs, P. Age-related performance issues for PIN and face-based authentication systems. In CHI (2013).  ",
      "doi": "10.1145/2470654.2470701"
    },
    {
      "text": "Paivio, A. Mind and Its Evolution: A Dual Coding Theoretical Approach. Lawrence Erlbaum: Mahwah, N.J., 2006.",
      "doi": ""
    },
    {
      "text": "Peters, M. Revised Vandenberg and Kuse mental rotations tests: Forms MRT-A to MRT-D. Tech. rep., Department of Psychology, University of Guelph, 1995.",
      "doi": ""
    },
    {
      "text": "Provos, N., and Mazieres, D. A future-adaptable password scheme. In USENIX ATC (1999). ",
      "doi": "10.5555/1268708.1268740"
    },
    {
      "text": "Renaud, K. A visuo-biometric authentication mechanism for older users. In British HCI (2005).",
      "doi": ""
    },
    {
      "text": "Schaub, F., Walch, M., Konings, B., and Weber, M. Exploring the design space of graphical passwords on smartphones. In SOUPS (2013).  ",
      "doi": "10.1145/2501604.2501615"
    },
    {
      "text": "Schechter, S., Brush, A. J. B., and Egelman, S. It's no secret: Measuring the security and reliability of authentication via \"secret\" questions. In IEEE S&P (2009).  ",
      "doi": "10.1109/SP.2009.11"
    },
    {
      "text": "Shay, R., Ion, I., Reeder, R. W., and Consolvo, S. \"my religious aunt asked why i was trying to sell her Viagra\": Experiences with account hijacking. In CHI (2014).  ",
      "doi": "10.1145/2556288.2557330"
    },
    {
      "text": "Shay, R., Kelley, P. G., Komanduri, S., Mazurek, M. L., Ur, B., Vidas, T., Bauer, L., Christin, N., and Cranor, L. F. Correct horse battery staple: Exploring the usability of system-assigned passphrases. In SOUPS (2012).  ",
      "doi": "10.1145/2335356.2335366"
    },
    {
      "text": "Shay, R., Komanduri, S., Durity, A. L., Huh, P. S., Mazurek, M. L., Segreti, S. M., Ur, B., Bauer, L., Christin, N., and Cranor, L. F. Can long passwords be secure and usable? In CHI (2014).  ",
      "doi": "10.1145/2556288.2557377"
    },
    {
      "text": "Shay, R., Komanduri, S., Kelley, P. G., Leon, P. G., Mazurek, M. L., Bauer, L., Christin, N., and Cranor, L. F. Encountering stronger password requirements: User attitudes and behaviors. In SOUPS (2010).  ",
      "doi": "10.1145/1837110.1837113"
    },
    {
      "text": "Silver, D., Jana, S., Boneh, D., Chen, E., and Jackson, C. Password managers: Attacks and defenses. In USENIX Security (Aug. 2014). ",
      "doi": "10.5555/2671225.2671254"
    },
    {
      "text": "Stobert, E., and Biddle, R. Memory retrieval and graphical passwords. In SOUPS (2013).  ",
      "doi": "10.1145/2501604.2501619"
    },
    {
      "text": "Tari, F., Ozok, A., and Holden, S. A comparison of perceived and real shoulder-surfing risks between alphanumeric and graphical passwords. In SOUPS (2006).  ",
      "doi": "10.1145/1143120.1143128"
    },
    {
      "text": "Thorpe, J., MacRae, B., and Salehi-Abari, A. Usability and security evaluation of GeoPass: A geographic location-password scheme. In SOUPS (2013).  ",
      "doi": "10.1145/2501604.2501618"
    },
    {
      "text": "Tulving, E., and Thompson, D. M. Encoding specificity and retrieval processes in episodic memory. Psychological Review 80(5) (1973).",
      "doi": ""
    },
    {
      "text": "Tulving, E., and Watkins, M. Continuity between recall and recognition. American Journal of Psych 86(4) (1973).",
      "doi": ""
    },
    {
      "text": "Wickelgren, W. A., and Norman, D. A. Strength models and serial position in short-term recognition memory. Journal of Mathematical Psychology 3 (1966).",
      "doi": ""
    },
    {
      "text": "Wiedenbeck, S., Waters, J., Birget, J., Brodskiy, A., and Memon, N. Authentication using graphical passwords: Effects of tolerance and image choice. In SOUPS (2005).  ",
      "doi": "10.1145/1073001.1073002"
    },
    {
      "text": "Wright, N., Patrick, A. S., and Biddle, R. Do you see your password? Applying recognition to textual passwords. In SOUPS (2012).  ",
      "doi": "10.1145/2335356.2335367"
    },
    {
      "text": "Yan, J., Blackwell, A., Anderson, R., and Grant, A. Password memorability and security: Empirical results. IEEE Security and Privacy 2 (5) (2004), 25.  ",
      "doi": "10.1109/MSP.2004.81"
    }
  ]
}