{
  "doi": "10.1145/2702123.2702240",
  "title": "Resilience Mitigates the Negative Effects of Adolescent Internet Addiction and Online Risk Exposure",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4029-4038",
  "year": 2015,
  "badges": [],
  "abstract": "We cannot fully protect adolescents from experiencing online risks; however, we can aim to better understand how online risk experiences impact teens, factors that contribute to or prevent teens from exposure to risk, as well as factors that can protect teens from psychological harm in spite of online risk exposure. Through a web-based survey study of 75 adolescents in the US, we develop and empirically validate a theoretical model of adolescent resilience in the presence of online risks. We show evidence that resilience is a key factor in protecting teens from experiencing online risks, even when teens exhibit high levels of Internet addiction. Resilience also neutralizes the negative psychological effects associated with Internet addiction and online risk exposure. Therefore, we emphasize the importance of design solutions that foster teen resilience and strength building, as opposed to solutions targeted toward parents that often focus on restriction and risk prevention.",
  "authors": [
    {
      "name": "Pamela Wisniewski",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81498641142/rel-imgonly/wisniewski.jpg",
      "acmid": "81498641142",
      "orcid": "0000-0002-6223-1029"
    },
    {
      "name": "Haiyan Jia",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81460650583/rel-imgonly/haiyan-profile-small.jpg",
      "acmid": "81460650583",
      "orcid": "missing"
    },
    {
      "name": "Na Wang",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490677142",
      "orcid": "missing"
    },
    {
      "name": "Saijing Zheng",
      "institution": "Pennsylvania State University, State College, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548015090",
      "orcid": "missing"
    },
    {
      "name": "Heng Xu",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414616940",
      "orcid": "missing"
    },
    {
      "name": "Mary Beth Rosson",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alvord, M. K. and Grados, J. J. Enhancing Resilience in Children: A Proactive Approach. Professional Psychology : Research and Practice, 36, 3 (Jun 2005 2005), 238--245.",
      "doi": ""
    },
    {
      "text": "Burns, R. A. and Anstey, K. J. The Connor-Davidson Resilience Scale (CD-RISC): Testing the invariance of a uni-dimensional resilience measure that is independent of positive and negative affect. Personality and Individual Differences, 48, 5 (2010), 527--531.",
      "doi": ""
    },
    {
      "text": "Campbell-Sills L, S. M. B. Psychometric analysis and refinement of the Connor-Davidson Resilience Scale (CD-RISC): validation of a 10-item measure of resilience. J Traumatic Stress, 2007, 20 (2007), 10191028.",
      "doi": ""
    },
    {
      "text": "Chai, S., Bagchi-Sen, S., Morrell, C., Rao, H. R., & Upadhyaya, S. J. Internet and online information privacy: An exploratory study of preteens and early teens. IEEE Transactions, 52, 2 (2009), pp. 167--182.",
      "doi": ""
    },
    {
      "text": "Chou, C., Condron, L. and Belland, J. C. A Review of the Research on Internet Addiction. Educational Psychology Review, 17, 4 (Dec 2005 2005), 363--388.",
      "doi": ""
    },
    {
      "text": "Coleman, J. and Hagell, A. Adolescence, Risk and Resilience: Against the Odds. John Wiley & Sons, 2007.",
      "doi": ""
    },
    {
      "text": "Compas, B. E. and Reeslund, K. L. Processes of Risk and Resilience During Adolescence. In Handbook of Adolescent Psychology, (2009).",
      "doi": ""
    },
    {
      "text": "Connor, K. M. and Davidson, J. R. T. Development of a new resilience scale: the Connor-Davidson Resilience Scale (CD-RISC). Depression and Anxiety, 18 (2003), 71--82.",
      "doi": ""
    },
    {
      "text": "D'Haenens, L., Vandonink, S. and Donoso, V. How to cope and build resilience. EU Kids Online, 2013, http://eprints.lse.ac.uk/48115/1/How%20to%20cope%2 0and%20build%20online%20resilience%20%28lsero% 29.pdf.",
      "doi": ""
    },
    {
      "text": "David-Ferdon, C. and Hertz, M. F. Electronic Media, Violence, and Adolescents: An Emerging Public Health Problem. Journal of Adolescent Health, 41, 6, Supplement (2007), S1-S5.",
      "doi": ""
    },
    {
      "text": "Dawson, J. Moderation in Management Research: What, Why, When, and How. J Bus Psychol, 29, 1 (2014/03/01 2014), 1--19.",
      "doi": ""
    },
    {
      "text": "Duerager, A. and Livingstone, S. How can parents support children's internet safety?, 2012, http://www.lse.ac.uk/media@lse/research/EUKidsOnlin e/EU%20Kids%20III/Reports/ParentalMediation.pdf.",
      "doi": ""
    },
    {
      "text": "Ebesutani, C., Regan, J., Smith, A., Reise, S., HigaMcMillan, C. and Chorpita, B. The 10-Item Positive and Negative Affect Schedule for Children, Child and Parent Shortened Versions: Application of Item Response Theory for More Efficient Assessment. Journal of Psychopathology and Behavioral Assessment, 34, 2 (2012/06/01 2012), 191--203.",
      "doi": ""
    },
    {
      "text": "Facebook. Family Safety Center. 2014, https://www.facebook.com/safety.",
      "doi": ""
    },
    {
      "text": "Faul, F., Erdfelder, E., Lang, A. and Buchner, A. G* Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences. Behavior Research Methods, 39, 2 (2007), 175--191.",
      "doi": ""
    },
    {
      "text": "Fincham, D. S., Altes, L. K., Stein, D. J. and Seedat, S. Posttraumatic stress disorder symptoms in adolescents: risk factors versus resilience moderation. Comprehensive Psychiatry, 50, 3 (May 2009 2009), 193--199.",
      "doi": ""
    },
    {
      "text": "Fonagy, P., Steele, M., Steele, H., Higgitt, A. and Target, M. The Emanuel Miller Memorial Lecture 1992 The Theory and Practice of Resilience. Journal of Child Psychology and Psychiatry, 35, 2 (1994), 231--257.",
      "doi": ""
    },
    {
      "text": "Gabriel, I. J. and Nyshadham, E. A Cognitive Map of People's Online Risk Perceptions and Attitudes: An Empirical Study. In Proc. Hawaii International Conference on System Sciences, Proceedings of the 41st Annual (2008), 274--274.  ",
      "doi": "10.1109/HICSS.2008.6"
    },
    {
      "text": "Hayes, A. F. Introduction to mediation, moderation, and conditional process analysis: A regression-based approach. Guilford Press, 2008.",
      "doi": ""
    },
    {
      "text": "Hébert, M., Lavoie, F. and Blais, M. Post Traumatic Stress Disorder/PTSD in adolescent victims of sexual abuse: resilience and social support as protection factors. Ciência & Saúde Coletiva, 19 (2014), 685--694.",
      "doi": ""
    },
    {
      "text": "Hippe, J. Self-Awareness: A Precursor to Resiliency. Reclaiming Children and Youth 12, 4 (2004), 240--242.",
      "doi": ""
    },
    {
      "text": "Hooper, D., Coughlan, J. and Mullen, M. Structural Equation Modelling: Guidelines for Determining Model Fit. Electronic Journal of Business Research Methods, 6, 1 (2008), 53--60.",
      "doi": ""
    },
    {
      "text": "IBM. Structural Equation Modeling with IBM SPSS Amos. 2014, https://www.hearne.com.au/getattachment/f36d45376943--4ac2--9ed2--645a329c39fb/White%20Paper%20%20Structural%20Equation%20Modeling%20with%20I BM%20SPSS%20Amos.aspx.",
      "doi": ""
    },
    {
      "text": "Jia, H., Wisniewski, P., Xu, H., Rosson, M. B. and Carroll, J. M. Risk-taking as a Learning Process for Shaping Teen's Online Information Privacy Behaviors. In Proc. Computer-Supported Cooperative Work and Social Computing (2015).  ",
      "doi": "10.1145/2675133.2675287"
    },
    {
      "text": "Jones, L. M., Mitchell, K. J. and Finkelhor, D. Trends in Youth Internet Victimization: Findings From Three Youth Internet Safety Surveys 2000-2010. Journal of Adolescent Health, 50, 2 (2012), 179--186.",
      "doi": ""
    },
    {
      "text": "Leung, L. and Lee, P. S. N. The influences of information literacy, internet addiction and parenting styles on internet risks. New Media & Society, 14, 1 (2012), 117--136.",
      "doi": ""
    },
    {
      "text": "Livingstone, S., Haddon, L., Görzig, A. and Ólafsson, K. Risks and safety on the internet: The perspective of European children. EU Kids Online, 2011, http://eprints.lse.ac.uk/33731/.",
      "doi": ""
    },
    {
      "text": "Livingstone, S. and Helsper, E. J. Parental Mediation of Children's Internet Use. Journal of Broadcasting & Electronic Media, 52, 4 (2008), 581--599.",
      "doi": ""
    },
    {
      "text": "Livingstone, S., Ólafsson, K., O'Neill, B. and Donoso, V. Towards a better internet for children: findings and recommendations from EU Kids Online to inform the CEO coalition., The London School of Economics and Political Science, London, UK., 2012,",
      "doi": ""
    },
    {
      "text": "Mesch, G. S. Parental Mediation, Online Activities, and Cyberbullying CyberPsychology & Behavior, 12, 4 (2009), 387--393.",
      "doi": ""
    },
    {
      "text": "Mitchell, K. J., Finkelhor, D. and Wolak, J. The Exposure Of Youth To Unwanted Sexual Material On The Internet: A National Survey of Risk, Impact, and Prevention. Youth & Society, 34, 3 (March 1, 2003 2003), 330--358.",
      "doi": ""
    },
    {
      "text": "Rosen, L. D., Cheever, N. A. and Carrier, L. M. The association of parenting style and child age with parental limit setting and adolescent MySpace behavior. Journal of Applied Developmental Psychology, 29, 6 (2008), 459--471.",
      "doi": ""
    },
    {
      "text": "Staksrud, E. and Livingstone, S. Children and online risk: powerless victims or resourceful participants? Information, communication and society, 12, 3 (2009), 364--387.",
      "doi": ""
    },
    {
      "text": "Stevenson, F. and Zimmerman, M. A. Adolescent Resilience: A Framework for Understanding Healthy Development in the Face of Risk. Annual Review of Public Health, 26 (2005), 399--419.",
      "doi": ""
    },
    {
      "text": "van den Eijnden, R. J., Meerkerk, G. J., Vermulst, A. A., Spijkerman, R. and Engels, R. C. Online communication, compulsive Internet use, and psychosocial well-being among adolescents: a longitudinal study. Dev Psychol, 44, 3 (May 2008), 655--665.",
      "doi": ""
    },
    {
      "text": "Watson, D., Clark, L. A. and Tellegan, A. Development and Validation of Brief Measures of Positive and Negative Affect: The PANAS Scales. Journal of Personality and Social Psychology, 54, 6 (Jun 1988-1988), 1063.",
      "doi": ""
    },
    {
      "text": "Wisniewski, P., Jia, H., Xu, H., Rosson, M. B. and Carroll, J. M. \"Preventative\" vs. \"Reactive:\" How Parental Mediation Influences Teens' Social Media Privacy Behaviors. In Proc. Computer-Supported Cooperative Work and Social Computing (2015).  ",
      "doi": "10.1145/2675133.2675293"
    },
    {
      "text": "Wisniewski, P., Xu, H., Carroll, J. M. and Rosson, M. B. Grand Challenges of Researching Adolescent Online Safety: A Family Systems Approach. In Proc. the Nineteenth Americas Conference on Information Systems (2013).",
      "doi": ""
    },
    {
      "text": "Wisniewski, P., Xu, H., Rosson, M. B. and Carroll, J. M. Adolescent Online Safety: The \"Moral\" of the Story. In Proc. CSCW 2014 (2014).  ",
      "doi": "10.1145/2531602.2531696"
    },
    {
      "text": "Yardi, S. and Bruckman, A. Social and technical challenges in parenting teens' social media use. In Proc. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2011), 32373246.  ",
      "doi": "10.1145/1978942.1979422"
    },
    {
      "text": "Yen, J.-Y., Ko, C.-H., Yen, C.-F., Wu, H.-Y. and Yang, M.-J. The Comorbid Psychiatric Symptoms of Internet Addiction: Attention Deficit and Hyperactivity Disorder (ADHD), Depression, Social Phobia, and Hostility. Journal of Adolescent Health, 41, 1 (2007), 93--98.",
      "doi": ""
    }
  ]
}