{
  "doi": "10.1145/2702123.2702563",
  "title": "Looking for Respite and Support: Technological Opportunities for Spousal Caregivers",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1155-1158",
  "year": 2015,
  "badges": [],
  "abstract": "Our research aims at informing the design of technological solutions to alleviate the stress resulting from the involvement of spouses of Alzheimer's disease patients as caregivers. For so doing, we have observed and analyzed the different offline solutions that are offered by a healthcare network in the Aube region (North-East of France). We discuss the key factors that we have identified for building an effective support network and identify five perspectives for the development of an online social support platform to lower the burden of spousal caregivers.",
  "tags": [
    "spousal caregivers",
    "support groups",
    "alzheimer's disease",
    "caregiving",
    "respite care services",
    "social support"
  ],
  "authors": [
    {
      "name": "Matthieu Tixier",
      "institution": "Troyes University of Technology, Troyes, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430676464",
      "orcid": "missing"
    },
    {
      "name": "Myriam Lewkowicz",
      "institution": "Troyes University of Technology, Troyes, France",
      "img": "/do/10.1145/contrib-81100539609/rel-imgonly/mlmai2015-zoom.jpg",
      "acmid": "81100539609",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bossen, C., Christensen, L.R., Grönvall, E., and Vestergaard, L.S. CareCoor: Augmenting the coordination of cooperative home care work. International Journal of Medical Informatics 82, 5 (2013), e189--e199.",
      "doi": ""
    },
    {
      "text": "Christensen, L.R. and Grönvall, E. Challenges and opportunities for collaborative technologies for home care work. Proc. ECSCW 2011, Springer (2011), 61--80.",
      "doi": ""
    },
    {
      "text": "Heaney, C. A., & Israel, B. A. (2002). Social networks and social support. Health behavior and health education: Theory, research, and practice, 3, 185--209.",
      "doi": ""
    },
    {
      "text": "Hinchliffe, A.C., Hyman, I.L., Blizard, B., and Livingston, G. Behavioural complications of dementia- can they be treated? International Journal of Geriatric Psychiatry 10, 10 (1995), 839--847.",
      "doi": ""
    },
    {
      "text": "Maayan, N., Soares-Weiser, K., and Lee, H. Respite care for people with dementia and their carers. In Cochrane Database of Systematic Reviews, John Wiley & Sons, Ltd, 1996.",
      "doi": ""
    },
    {
      "text": "Mark S. Ackerman. The Intellectual Challenge of CSCW: The Gap Between Social Requirements and Technical Feasibility. Human-Computer Interaction 15, 2-3 (2000), 179--203.  ",
      "doi": "10.1207/S15327051HCI1523_5"
    },
    {
      "text": "Reinhard, S. C., Levine, C., and Samis, S. Home Alone: Family Caregivers Providing Complex Chronic Care, Washington, DC: AARP Public Policy Institute, 2012.",
      "doi": ""
    },
    {
      "text": "Tellioğlu, H., Lewkowicz, M., Pinatti De Carvalho, A.F., Brešković, I., and Schorch, M. Collaboration and Coordination in the Context of Informal Care (CCCiC 2014). Proc. Companion Publication of CSCW 2014, ACM Press (2014), 339--342.  ",
      "doi": "10.1145/2556420.2558862"
    },
    {
      "text": "Xie, B. Multimodal Computer-Mediated Communication and Social Support among Older Chinese Internet Users. Journal of Computer-Mediated Communication 13, 3 (2008), 728--750.",
      "doi": ""
    }
  ]
}