{
  "doi": "10.1145/2702123.2702605",
  "title": "Exploring Privacy and Accuracy Trade-Offs in Crowdsourced Behavioral Video Coding",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1945-1954",
  "year": 2015,
  "badges": [],
  "abstract": "Coding behavioral video is an important method used by researchers to understand social phenomenon. Unfortunately, traditional hand-coding approaches can take days or weeks of time to complete. Recent work has shown that these tasks can be completed quickly by leveraging the parallelism of large online crowds, but using the crowd introduces new concerns about accuracy, reliability, privacy, and cost. To explore these issues, we conducted interviews with 12 researchers who frequently code behavioral video, to investigate common practices and challenges with video coding. We find accuracy and privacy to be the researchers' primary concerns. To explore this more concretely, we used sample videos to investigate whether crowds can accurately recognize instances of commonly coded behaviors, and show that the crowd yields accurate results. Then, we demonstrate a method for obfuscating participant identity with a video blur filter, and find, as expected, that workers' ability to identify participants decreases as blur level increases. The workers' ability to accurately and reliably code behaviors also decreases, but not as steeply as the identity test. This trade-off between coding quality and privacy protection suggests that researchers can use online crowds to code for some key behaviors in video without compromising participant identity. We conclude with a discussion of how researchers can balance privacy and accuracy on their own data using a system we introduce called Incognito.",
  "authors": [
    {
      "name": "Walter S. Lasecki",
      "institution": "University of Rochester, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490695200",
      "orcid": "missing"
    },
    {
      "name": "Mitchell Gordon",
      "institution": "University of Rochester, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959139657",
      "orcid": "missing"
    },
    {
      "name": "Winnie Leung",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703852",
      "orcid": "missing"
    },
    {
      "name": "Ellen Lim",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696855",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Steven P. Dow",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    }
  ],
  "references": [
    {
      "text": "Datavyu. http://datavyu.org/.",
      "doi": ""
    },
    {
      "text": "Bakeman, R., and Gottman, J. M. Observing interaction: An introduction to sequential analysis. Cambridge University Press, 1986.",
      "doi": ""
    },
    {
      "text": "Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., Crowell, D., and Panovich, K. Soylent: a word processor with a crowd inside. In UIST (2010), 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Bigham, J. P., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R. C., Miller, R., Tatarowicz, A., White, B., White, S., and Yeh, T. Vizwiz: nearly real-time answers to visual questions. In UIST (2010), 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Borsboom, B. Guess who?: A game to crowdsource the labeling of affective facial expressions is comparable to expert ratings, 2012.",
      "doi": ""
    },
    {
      "text": "Boyle, M., Edwards, C., and Greenberg, S. The effects of filtered video on awareness and privacy. In CSCW (2000), 1--10.  ",
      "doi": "10.1145/358916.358935"
    },
    {
      "text": "Bruce, V. Fleeting images of shade: Identifying people caught on camera. The Psychologist (1998), 331--338.",
      "doi": ""
    },
    {
      "text": "Burr, B. Vaca: A tool for qualitative video analysis. In SIGCHI EA (2006), 622--627.  ",
      "doi": "10.1145/1125451.1125580"
    },
    {
      "text": "Coan, J. A., and Gottman, J. M. Handbook of Emotion Elicitation and Assessment. Series in Affective Science. Oxford University Press, 2007, ch. The Specific Affect Coding System (SPAFF).",
      "doi": ""
    },
    {
      "text": "Cohen, J. A Coefficient of Agreement for Nominal Scales. Educ Psychol Meas 20, 1 (1960), 37.",
      "doi": ""
    },
    {
      "text": "Di Salvo, R., Giordano, D., and Kavasidis, I. A crowdsourcing approach to support video annotation. In VIGTA (2013), 8:1--8:6.  ",
      "doi": "10.1145/2501105.2501113"
    },
    {
      "text": "Hagedorn, J., Hailpern, J., and Karahalios, K. G. Vcode and vdata: Illustrating a new framework for supporting the video annotation workflow. In AVI (2008), 317--321.  ",
      "doi": "10.1145/1385569.1385622"
    },
    {
      "text": "Henderson, Z., Bruce, V., and Burton, A. M. Matching the faces of robbers captured in video. Applied Cognitive Psychology (2001), 445--464.",
      "doi": ""
    },
    {
      "text": "Heyman, R. E., Lorber, M. F., Eddy, J. M., West, T., Reis, E. H. T., and Judd, C. M. Handbook of Research Methods in Social and Personality Psychology. Cambridge University Press, 2014, ch. Behavioral observation and coding.",
      "doi": ""
    },
    {
      "text": "Kipp, M. ANVIL- a generic annotation tool for multimodal dialogue. Eurospeech (2001), 1367--1370.",
      "doi": ""
    },
    {
      "text": "Lasecki, W. S., Gordon, M., Koutra, D., Jung, M. F., Dow, S. P., and Bigham, J. P. Glance: Rapidly coding behavioral video with the crowd. In UIST (2014).  ",
      "doi": "10.1145/2642918.2647367"
    },
    {
      "text": "Lasecki, W. S., Murray, K. I., White, S., Miller, R. C., and Bigham, J. P. Real-time crowd control of existing interfaces. In UIST (2011), 23--32.  ",
      "doi": "10.1145/2047196.2047200"
    },
    {
      "text": "Lasecki, W. S., Song, Y. C., Kautz, H., and Bigham, J. P. Real-time crowd labeling for deployable activity recognition. In CSCW (2013).  ",
      "doi": "10.1145/2441776.2441912"
    },
    {
      "text": "Lasecki, W. S., Teevan, J., and Kamar, E. Information extraction and manipulation threats in crowd-powered systems. In CSCW (2014).  ",
      "doi": "10.1145/2531602.2531733"
    },
    {
      "text": "Lasecki, W. S., Weingard, L., Ferguson, G., and Bigham, J. P. Finding dependencies between actions using the crowd. In SIGCHI (2014), 3095--3098.  ",
      "doi": "10.1145/2556288.2557176"
    },
    {
      "text": "Neustaedter, C., and Greenberg, S. Balancing privacy and awareness in home media spaces. In UBICOMP (2003).",
      "doi": ""
    },
    {
      "text": "Police Chiefs Association of Santa Clara County. Line-up protocol for law enforcement.",
      "doi": ""
    },
    {
      "text": "Riek, L. D., O'Connor, M. F., and Robinson, P. Guess what? a game for affective annotation of video using crowd sourcing. In ACII (2011), 277--285. ",
      "doi": "10.5555/2062780.2062813"
    },
    {
      "text": "Vondrick, C., Patterson, D., and Ramanan, D. Efficiently scaling up crowdsourced video annotation. Int J of Comput Vision (2012), 1--21.  ",
      "doi": "10.1007/s11263-012-0564-1"
    },
    {
      "text": "Weingart, L. R., Olekalns, M., and Smith, P. L. Quantitative coding of negotiation behavior. Int Negotiation 3, 9 (2005), 441--456.",
      "doi": ""
    }
  ]
}