{
  "doi": "10.1145/2702123.2702252",
  "title": "Improving Accuracy, Applicability and Usability of Keystroke Biometrics on Mobile Touchscreen Devices",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1393-1402",
  "year": 2015,
  "badges": [],
  "abstract": "Authentication methods can be improved by considering implicit, individual behavioural cues. In particular, verifying users based on typing behaviour has been widely studied with physical keyboards. On mobile touchscreens, the same concepts have been applied with little adaptations so far. This paper presents the first reported study on mobile keystroke biometrics which compares touch-specific features between three different hand postures and evaluation schemes. Based on 20.160 password entries from a study with 28 participants over two weeks, we show that including spatial touch features reduces implicit authentication equal error rates (EER) by 26.4 - 36.8% relative to the previously used temporal features. We also show that authentication works better for some hand postures than others. To improve applicability and usability, we further quantify the influence of common evaluation assumptions: known attacker data, training and testing on data from a single typing session, and fixed hand postures. We show that these practices can lead to overly optimistic evaluations. In consequence, we describe evaluation recommendations, a probabilistic framework to handle unknown hand postures, and ideas for further improvements.",
  "tags": [
    "touch",
    "biometrics",
    "mobile",
    "keystroke dynamics"
  ],
  "authors": [
    {
      "name": "Daniel Buschek",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-82659024557/rel-imgonly/daniel.png",
      "acmid": "82659024557",
      "orcid": "0000-0002-0013-715X"
    },
    {
      "name": "Alexander De Luca",
      "institution": "University of Munich (LMU) & DFKI GmbH, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488374",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Angulo, J., and Wästlund, E. Exploring Touch-Screen Biometrics for User Identification on Smart Phones. Privacy and Identity Management for Life 375 (2012), 130--143.",
      "doi": ""
    },
    {
      "text": "Aviv, A., Gibson, K., Mossop, E., Blaze, M., and Smith, J. Smudge Attacks on Smartphone Touch Screens. In WOOT (2010), 1--7. ",
      "doi": "10.5555/1925004.1925009"
    },
    {
      "text": "Azenkot, S., and Zhai, S. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In MobileHCI 2012 (2012), 251--260.  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Baldwin, T., and Chai, J. Towards Online Adaptation and Personalization of Key-Target Resizing for Mobile Devices. In IUI 2012 (2012), 11--20.  ",
      "doi": "10.1145/2166966.2166969"
    },
    {
      "text": "Banerjee, S., and Woodard, D. Biometric Authentication and Identification using Keystroke Dynamics: A Survey. Journal of Pattern Recognition Research 7 (2012), 116--139.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., and Chu, G. Back-of-Device Interaction Allows Creating Very Small Touch Devices. In CHI 2009 (2009), 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Beton, M., Marie, V., and Rosenberger, C. Biometric Secret Path for Mobile User Authentication: A Preliminary Study. In WCCIT 2013, Ieee (June 2013), 1--6.",
      "doi": ""
    },
    {
      "text": "Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling Asleep with Angry Birds, Facebook and Kindle - A Large Scale Study on Mobile Application Usage. MobileHCI 2011 (2011), 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Bours, P., and Barghouthi, H. Continuous Authentication Using Biometric Keystroke Dynamics. In NISK (2009), 1--12.",
      "doi": ""
    },
    {
      "text": "Buchoux, A., and Clarke, N. L. Deployment of Keystroke Analysis on a Smartphone. In Australian Information Security Management Conference (2008).",
      "doi": ""
    },
    {
      "text": "Burgbacher, U., and Hinrichs, K. An Implicit Author Verification System for Text Messages Based on Gesture Typing Biometrics. In CHI 2014 (2014), 2951--2954.  ",
      "doi": "10.1145/2556288.2557346"
    },
    {
      "text": "Buschek, D., Rogers, S., and Murray-Smith, R. User-Specific Touch Models in a Cross-Device Context. In MobileHCI 2013 (2013), 382--391.  ",
      "doi": "10.1145/2493190.2493206"
    },
    {
      "text": "Buschek, D., Schoenleben, O., and Oulasvirta, A. Improving Accuracy in Back-of-Device Multitouch Typing: A Clustering-based Approach to Keyboard Updating. In IUI 2014 (2014), 57--66.  ",
      "doi": "10.1145/2557500.2557501"
    },
    {
      "text": "Campisi, P., Maiorana, E., Lo Bosco, M., and Neri, A. User authentication using keystroke dynamics for cellular phones. IET Signal Processing 3, 4 (2009), 333--341.",
      "doi": ""
    },
    {
      "text": "Clarke, N. L., and Furnell, S. M. Authenticating mobile phone users using keystroke analysis. International Journal of Information Security 6, 1 (Aug. 2006), 1--14.  ",
      "doi": "10.1007/s10207-006-0006-6"
    },
    {
      "text": "Crawford, H. Keystroke Dynamics: Characteristics and Opportunities. In 8th International Conference on Privacy, Security and Trust (2010), 205--212.",
      "doi": ""
    },
    {
      "text": "Crawford, H. A. A Framework for Continuous, Transparent Authentication on Mobile Devices. PhD thesis, University of Glasgow, 2012.",
      "doi": ""
    },
    {
      "text": "De Luca, A., Hang, A., Brudy, F., Lindner, C., and Hussmann, H. Touch me once and I know its you! Implicit Authentication based on Touch Screen Patterns. In CHI 2012 (2012), 987--996.  ",
      "doi": "10.1145/2207676.2208544"
    },
    {
      "text": "Devroye, L., Györfi, L., and Lugosi, G. A Probabilistic Theory of Pattern Recognition. Springer, 1996.",
      "doi": ""
    },
    {
      "text": "Draffin, B., Zhu, J., and Zhang, J. KeySens: Passive User Authentication through Micro-behavior Modeling of Soft Keyboard Interaction. Mobile Computing, Applications, and Services 130 (2014), 184--201.",
      "doi": ""
    },
    {
      "text": "Edelmann, J., Mock, P., Schilling, A., Gerjets, P., Rosenstiel, W., and Strasser, W. Towards the Keyboard of Oz: Learning Individual Soft-Keyboard Models from Raw Optical Sensor Data. In ITS 2012 (2012), 163--172.  ",
      "doi": "10.1145/2396636.2396662"
    },
    {
      "text": "Forlines, C., Wigdor, D., Shen, C., and Balakrishnan, R. Direct-Touch vs. Mouse Input for Tabletop Displays. In CHI 2007 (2007), 647--656.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "Frank, M., Biedert, R., Ma, E., Martinovic, I., and Song, D. Touchalytics: On the Applicability of Touchscreen Input as a Behavioral Biometric for Continuous Authentication. Information Forensics and Security 8, 1 (2013), 126--148.  ",
      "doi": "10.1109/TIFS.2012.2225048"
    },
    {
      "text": "Goodman, J. T., Venolia, G., Steury, K., and Parker, C. Language Modeling for Soft Keyboards. In IUI 2002 (Jan. 2002), 194--195.  ",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Harbach, M., von Zezschwitz, E., Fichtner, A., De Luca, A., and Smith, M. It's a Hard Lock Life: A Field Study of Smartphone (Un) Locking Behavior and Risk Perception. In SOUPS 2014 (2014), 213--230.",
      "doi": ""
    },
    {
      "text": "Henze, N., Rukzio, E., and Boll, S. 100,000,000 Taps: Analysis and Improvement of Touch Performance in the Large. In MobileHCI 2011 (2011), 133--142.  ",
      "doi": "10.1145/2037373.2037395"
    },
    {
      "text": "Holz, C., and Baudisch, P. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. In CHI 2010 (2010), 581--590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Holz, C., and Baudisch, P. Understanding Touch. In CHI 2011 (2011), 2501--2510.  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Holz, C., and Baudisch, P. Fiberio: A Touchscreen that Senses Fingerprints. In UIST 2013 (2013), 41--50.  ",
      "doi": "10.1145/2501988.2502021"
    },
    {
      "text": "Hwang, S.-s., Cho, S., and Park, S. Keystroke dynamics-based authentication for mobile devices. Computers & Security 28, 1--2 (Feb. 2009), 85--93.  ",
      "doi": "10.1016/j.cose.2008.10.002"
    },
    {
      "text": "Jakobsson, M., Shi, E., Golle, P., and Chow, R. Implicit Authentication for Mobile Devices. In HotSec 2009 (2009). ",
      "doi": "10.5555/1855628.1855637"
    },
    {
      "text": "Jeanjaitrong, N., and Bhattarakosol, P. Feasibility Study on Authentication Based Keystroke Dynamic over Touch-Screen Devices. In ISCIT 2013, Ieee (Sept. 2013), 238--242.",
      "doi": ""
    },
    {
      "text": "Karatzouni, S., and Clarke, N. Keystroke Analysis for Thumb-based Keyboards on Mobile Devices. In IFIP International Federation for Information Processing, vol. 232 (2007), 253--263.",
      "doi": ""
    },
    {
      "text": "Killourhy, K. S., and Maxion, R. A. Comparing Anomaly-Detection Algorithms for Keystroke Dynamics. In Dependable Systems & Networks (June 2009), 125--134.",
      "doi": ""
    },
    {
      "text": "Kohavi, Ron and John, G. H. Wrappers for feature subset selection. Artificial Intelligence 97, 1 (1997), 273--324.  ",
      "doi": "10.1016/S0004-3702%2897%2900043-X"
    },
    {
      "text": "Kristensson, P. O. Discrete and Continuous Shape Writing for Text Entry and Control. PhD thesis, Linköping University, Sweden, 2007.",
      "doi": ""
    },
    {
      "text": "Lau, S.-h., Siena, S., Pandey, A., Sosothikul, S., Cranor, L., Ur, B., and Shay, R. Exploring the Usability of Pronounceable Passwords. In SOUPS Poster (2014).",
      "doi": ""
    },
    {
      "text": "Maiorana, E., Campisi, P., González-Carballo, N., and Neri, A. Keystroke Dynamics Authentication for Mobile Phones. In SAC 2011 (2011), 21--26.  ",
      "doi": "10.1145/1982185.1982190"
    },
    {
      "text": "Mock, P., Edelmann, J., Schilling, A., and Rosenstiel, W. User Identification Using Raw Sensor Data From Typing on Interactive Displays. In IUI 2014 (2014), 67--72.  ",
      "doi": "10.1145/2557500.2557503"
    },
    {
      "text": "Monrose, F., Reiter, M., and Wetzel, S. Password Hardening Based on Keystroke Dynamics. In Int'l. Journal of Information Security (2002), 69--83.",
      "doi": ""
    },
    {
      "text": "Monrose, F., and Rubin, A. Authentication via Keystroke Dynamics. In Computer and Communications Security (1997), 48--56.  ",
      "doi": "10.1145/266420.266434"
    },
    {
      "text": "Nauman, M., Ali, T., and Rauf, A. Using trusted computing for privacy preserving keystroke-based authentication in smartphones. Telecommunication Systems 52 (2013), 2149--2161.  ",
      "doi": "10.1007/s11235-011-9538-9"
    },
    {
      "text": "Platt, J. C. Probabilistic Outputs for Support Vector Machines and Comparisons to Regularized Likelihood Methods. Advances in Large Margin Classifiers 10, 3 (1999), 61--74.",
      "doi": ""
    },
    {
      "text": "Quinn, J., and Sugiyama, M. A least-squares approach to anomaly detection in static and sequential data. Pattern Recognition Letters (2014).  ",
      "doi": "10.1016/j.patrec.2013.12.016"
    },
    {
      "text": "Sae-Bae, N., Ahmed, K., Isbister, K., and Memon, N. Biometric-Rich Gestures: A Novel Approach to Authentication on Multi-touch Devices. In CHI 2012 (2012), 977--986.  ",
      "doi": "10.1145/2207676.2208543"
    },
    {
      "text": "Saevanee, H., and Bhattarakosol, P. Authenticating user using keystroke dynamics and finger pressure. In 6th IEEE Consumer Communications and Networking Conference (2009). ",
      "doi": "10.5555/1700527.1700794"
    },
    {
      "text": "Saevanee, H., Clarke, N., Furnell, S., and Biscione, V. Text-Based Active Authentication for Mobile Devices. ICT Systems Security and Privacy Protection 428 (2014), 99--112.",
      "doi": ""
    },
    {
      "text": "Schaub, F., Deyhle, R., and Weber, M. Password Entry Usability and Shoulder Surfing Susceptibility on Different Smartphone Platforms. In MUM 2012 (2012), 13:1--13:10.  ",
      "doi": "10.1145/2406367.2406384"
    },
    {
      "text": "Shi, E., Niu, Y., Jakobsson, M., and Chow, R. Implicit Authentication through Learning User Behavior. Information Security (2011), 99--113. ",
      "doi": "10.5555/1949317.1949329"
    },
    {
      "text": "Teh, P. S., Teoh, A. B. J., and Yue, S. A Survey of Keystroke Dynamics Biometrics. The Scientific World Journal 2013 (2013).",
      "doi": ""
    },
    {
      "text": "von Zezschwitz, E., Koslow, A., De Luca, A., and Hussmann, H. Making Graphic-Based Authentication Secure against Smudge Attacks. In IUI 2013 (2013), 277--286.  ",
      "doi": "10.1145/2449396.2449432"
    },
    {
      "text": "Wang, F., and Ren, X. Empirical Evaluation for Finger Input Properties In Multi-touch Interaction. In CHI 2009 (2009), 1063--1072.  ",
      "doi": "10.1145/1518701.1518864"
    },
    {
      "text": "Weir, D., Buschek, D., and Rogers, S. Sparse Selection of Training Data for Touch Correction Systems. In MobileHCI 2013 (2013), 404--407.  ",
      "doi": "10.1145/2493190.2493241"
    },
    {
      "text": "Weir, D., Rogers, S., Murray-Smith, R., and Löchtefeld, M. A User-Specific Machine Learning Approach for Improving Touch Accuracy on Mobile Devices. In UIST 2012 (2012), 465--476.  ",
      "doi": "10.1145/2380116.2380175"
    },
    {
      "text": "Xu, H., Zhou, Y., and Lyu, M. Towards Continuous and Passive Authentication via Touch Biometrics: An Experimental Study on Smartphones. SOUPS 2014 (2014), 187--198.",
      "doi": ""
    },
    {
      "text": "Yin, Y., Ouyang, T. Y., Partridge, K., and Zhai, S. Making Touchscreen Keyboards Adaptive to Keys, Hand Postures, and Individuals - A Hierarchical Spatial Backoff Model Approach. In CHI (2013), 2775--2784.  ",
      "doi": "10.1145/2470654.2481384"
    },
    {
      "text": "Zahid, S., Shahzad, M., Khayam, S. A., and Farooq, M. Keystroke-Based User Identification on Smart Phones. In LNCS, vol. 5758 (2009), 224--243.  ",
      "doi": "10.1007/978-3-642-04342-0_12"
    },
    {
      "text": "Zhao, X., Feng, T., and Shi, W. Continuous Mobile Authentication Using A Novel Graphic Touch Gesture Feature. In BTAS 2013 (2013), 1--6.",
      "doi": ""
    },
    {
      "text": "Zheng, N., Bai, K., Huang, H., and Wang, H. You Are How You Touch: User Verification on Smartphones via Tapping Behaviors. In Tech. Rep. WM-CS-2012-06 (2012).",
      "doi": ""
    }
  ]
}