{
  "doi": "10.1145/2702123.2702195",
  "title": "Exploring the Role of Activity Trace Design on Evaluations of Online Worker Quality",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1617-1620",
  "year": 2015,
  "badges": [],
  "abstract": "Websites can record individual users' activities and display them in a variety of ways. There is a tradeoff between detail and abstraction in visualization, especially when the amount of content increases and becomes more difficult to process. We conducted an experiment on Mechanical Turk varying the quality, detail, and visual presentation of information about an individual's past work to see how these design features affected perceptions of the worker. We found that providing detail in the display through text increased processing time and led to less positive evaluations. Visually abstract displays required less processing time but decreased confidence in evaluation. This suggests that different design parameters may engender differing psychological processes that influence reactions towards an unknown person.",
  "authors": [
    {
      "name": "Jennifer Marlow",
      "institution": "FX Palo Alto Laboratory, Inc. & Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482656556",
      "orcid": "missing"
    },
    {
      "name": "Laura A. Dabbish",
      "institution": "Heinz College & Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    },
    {
      "name": "Jodi L. Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ainsworth, S. The functions of multiple representations. Computers & Education 33, 2-3 (1999), 131--152.  ",
      "doi": "10.1016/S0360-1315%2899%2900029-9"
    },
    {
      "text": "Alter, A.L. and Oppenheimer, D.M. Uniting the tribes of fluency to form a metacognitive nation. Personality and Social Psychology Review 13, 3 (2009), 219--235.",
      "doi": ""
    },
    {
      "text": "Berger, C.R. and Calabrese, R.J. Some explorations in initial interaction and beyond: Toward a developmental theory of interpersonal communication. Human Communication Research 1, 2 (1975), 99--112.",
      "doi": ""
    },
    {
      "text": "Bontcheva, K. and Rout, D. Making sense of social media streams through semantics: a survey. Semantic Web Journal, (2012), 373--403.",
      "doi": ""
    },
    {
      "text": "Counts, S. and Fisher, K. Taking it all in? Visual attention in microblog consumption. In Proc. ICWSM (2011), 97--104.",
      "doi": ""
    },
    {
      "text": "Hullman, J., Adar, E., and Shah, P. Benefitting infovis with visual difficulties. IEEE Visualization and Computer Graphics 17, 12 (2011), 2213--2222.  ",
      "doi": "10.1109/TVCG.2011.175"
    },
    {
      "text": "Kim, D. and Shipman, F.M., III. Visualizing History to Improve Users' Location and Comprehension of Collaborative Work. In Proc. GROUP, (2012), pp. 11--20.  ",
      "doi": "10.1145/2389176.2389179"
    },
    {
      "text": "Liao, Q.V. and Fu, W.-T. Expert voices in echo chambers: effects of source expertise indicators on exposure to diverse opinions. In Proc. CHI, (2014), 2745--2754.  ",
      "doi": "10.1145/2556288.2557240"
    },
    {
      "text": "Norton, M.I., Frost, J.H., and Ariely, D. Less is more: the lure of ambiguity, or why familiarity breeds contempt. Journal of Personality and Social Psychology 92, 1 (2007), pp. 97--105.",
      "doi": ""
    },
    {
      "text": "Singer, L., Figueira Filho, F., Cleary, B., Treude, C., Storey, M.-A., & Schneider, K. (2013). Mutual assessment in the social programmer ecosystem: An empirical investigation of developer profile aggregators. In Proc. CSCW, (2013), 103--116.  ",
      "doi": "10.1145/2441776.2441791"
    },
    {
      "text": "Stephan, E., Liberman, N., and Trope, Y. The effects of time perspective and level of construal on social distance. Journal of Experimental Social Psychology 47(2), (2011), pp. 397--402.",
      "doi": ""
    },
    {
      "text": "Thompson, R.S., Rantanen, E.M., Yurcik, W., and Bailey, B.P. Command line or pretty lines? Comparing textual and visual interfaces for intrusion detection. In Proc. CHI, (2007), 1205--1214.  ",
      "doi": "10.1145/1240624.1240807"
    },
    {
      "text": "Tsai, C.I. and McGill, A.L. No pain, no gain? How fluency and construal level affect consumer confidence. Journal of Consumer Research 37, 5 (2011), 807--821.",
      "doi": ""
    }
  ]
}