{
  "doi": "10.1145/2702123.2702424",
  "title": "Providing Adaptive Support in an Interactive Simulation for Learning: An Experimental Evaluation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3671-3680",
  "year": 2015,
  "badges": [],
  "abstract": "Recent rise of Massive Open Online Courses (MOOCs) with unlimited participants, makes employing learning tools such as interactive simulations all but inevitable. Interactive simulations give students the opportunity to experiment with concrete examples and develop better understanding of concepts they have learned. However, some students do not learn well from this relatively unstructured form of interaction, suggesting the provision of adaptive support as a way to address this issue. This paper presents a formal evaluation of providing support to facilitate open exploration. We describe the process of designing an intervention delivery mechanism for adding adaptive support to an exploratory interactive simulation. The experimental evaluation of the adaptive version of the simulation indicates that the adaptive support provided to students significantly improved their learning performance. Quantitative and qualitative evaluations of users' acceptance of the system are generally positive but pinpoint areas for improvement.",
  "authors": [
    {
      "name": "Samad Kardan",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385604320",
      "orcid": "missing"
    },
    {
      "name": "Cristina Conati",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100274362",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amershi, S., Carenini, G., Conati, C., Mackworth, A.K., and Poole, D. Pedagogy and usability in interactive algorithm visualizations: Designing and evaluating CIspace. Interacting with Computers 20, 1 (2008), 64--96.  ",
      "doi": "10.1016/j.intcom.2007.08.003"
    },
    {
      "text": "Borek, A., McLaren, B.M., Karabinos, M., and Yaron, D. How Much Assistance Is Helpful to Students in Discovery Learning? In U. Cress, V. Dimitrova and M. Specht, eds., Learning in the Synergy of Multiple Disciplines. Springer Berlin Heidelberg, 2009, 391--404.  ",
      "doi": "10.1007/978-3-642-04636-0_38"
    },
    {
      "text": "Cohen, J. Statistical Power Analysis for the Behavioral Sciences. Lawrence Erlbaum, 1988.",
      "doi": ""
    },
    {
      "text": "Cohen, J., West, S.G., Aiken, L.S., and Cohen, P. Applied Multiple Regression/Correlation Analysis for the Behavioral Sciences. Lawrence Erlbaum, Mahwah, N.J, 2002.",
      "doi": ""
    },
    {
      "text": "Gluck, J., Bunt, A., and McGrenere, J. Matching attentional draw with utility in interruption. In Proc. CHI '07, (2007), 41.  ",
      "doi": "10.1145/1240624.1240631"
    },
    {
      "text": "Gobert, J.D., Montalvo, O., Toto, E., Sao Pedro, M., and Baker, R.S.J. d. The Science Assistments Project: Scaffolding Scientific Inquiry Skills. In Proc. Intelligent Tutoring Systems, (2010), 445--445.  ",
      "doi": "10.1007/978-3-642-13437-1_102"
    },
    {
      "text": "Hussain, T.S., Roberts, B., Menaker, E.S., et al. Designing and developing effective training games for the US Navy. The Interservice/Industry Training, Simulation & Education Conference (I/ITSEC), NTSA (2009).",
      "doi": ""
    },
    {
      "text": "Jackson, G.T., Olney, A., Graesser, A.C., and Kim, H.J. AutoTutor 3-D Simulations: Analyzing user's actions and learning trends. In Proc. the 28th annual meeting of the Cognitive Science Society, (2006), 1557--1562.",
      "doi": ""
    },
    {
      "text": "De Jong, T. Technological Advances in Inquiry Learning. Science 312, 5773 (2006), 532--533.",
      "doi": ""
    },
    {
      "text": "Van Joolingen, W.R., De Jong, T., and Dimitrakopoulou, A. Issues in computer supported inquiry learning in science. J. of Computer Assisted Learning 23, 2 (2007), 111--119.",
      "doi": ""
    },
    {
      "text": "Kardan, S. Data Mining for Adding Adaptive Interventions to Exploratory and Open-Ended Environments. In Proc. UMAP 2012, Springer Berlin / Heidelberg, 2012, 365--368.  ",
      "doi": "10.1007/978-3-642-31454-4_37"
    },
    {
      "text": "Kardan, S. and Conati, C. A Framework for Capturing Distinguishing User Interaction Behaviours in Novel Interfaces. In Proc. the 4th Int. Conf. on Educational Data Mining, (2011), 159--168.",
      "doi": ""
    },
    {
      "text": "Kardan, S. and Conati, C. Exploring Gaze Data for Determining User Learning with an Interactive Simulation. In Proc. UMAP 2012, Springer Berlin / Heidelberg, 2012, 126--138.  ",
      "doi": "10.1007/978-3-642-31454-4_11"
    },
    {
      "text": "Lenth, R.V. Java Applets for Power and Sample Size. 2006. http://www.stat.uiowa.edu/~rlenth/Power",
      "doi": ""
    },
    {
      "text": "Maloy, R.W., Verock-O'Loughlin, R.-E.A., Edwards, S.A., and Woolf, B.P. Transforming Learning with New Technologies. Pearson, Boston, 2013.",
      "doi": ""
    },
    {
      "text": "Mavrikis, M., Gutierrez-Santos, S., Geraniou, E., and Noss, R. Design requirements, student perception indicators and validation metrics for intelligent exploratory learning environments. Personal and Ubiquitous Computing, , 1--16.  ",
      "doi": "10.1007/s00779-012-0524-3"
    },
    {
      "text": "O'brien, R.M. A Caution Regarding Rules of Thumb for Variance Inflation Factors. Quality & Quantity 41, 5 (2007), 673--690.",
      "doi": ""
    },
    {
      "text": "Perkins, K., Adams, W., Dubson, M., et al. PhET: Interactive Simulations for Teaching and Learning Physics. The Physics Teacher 44, 1 (2006), 18--23.",
      "doi": ""
    },
    {
      "text": "Ploetzner, R., Lippitsch, S., Galmbacher, M., Heuer, D., and Scherrer, S. Students' difficulties in learning from dynamic visualisations and how they may be overcome. Computers in Human Behavior 25, 1 (2009), 56--65.  ",
      "doi": "10.1016/j.chb.2008.06.006"
    },
    {
      "text": "Poole, D.L. and Mackworth, A.K. Artificial Intelligence: Foundations of Computational Agents. Cambridge University Press, 2010. ",
      "doi": ""
    },
    {
      "text": "Salajan, F.D., Perschbacher, S., Cash, M., Talwar, R., ElBadrawy, W., and Mount, G.J. Learning with web-based interactive objects: An investigation into student perceptions of effectiveness. Computers & Education 53, 3 (2009), 632--643.  ",
      "doi": "10.1016/j.compedu.2009.04.006"
    },
    {
      "text": "Stamper, J., Eagle, M., Barnes, T., and Croy, M. Experimental Evaluation of Automatic Hint Generation for a Logic Tutor. Int. J. Artif. Intell. Ed.22, 1 (2013), 3--17.  ",
      "doi": "10.5555/2596893.2596895"
    },
    {
      "text": "Ting, C.Y., Zadeh, M., and Chong, Y.K. A decisiontheoretic approach to scientific inquiry exploratory learning environment. In Proc. Intelligent Tutoring Systems, (2006), 85--94.  ",
      "doi": "10.1007/11774303_9"
    },
    {
      "text": "VanLehn, K. The Behavior of Tutoring Systems. Int. J. Artif. Intell. Ed. 16, 3 (2006), 227--265. ",
      "doi": "10.5555/1435351.1435353"
    },
    {
      "text": "Westerfield, G., Mitrovic, A., and Billinghurst, M. Intelligent Augmented Reality Training for Assembly Tasks. In Proc. Artificial Intelligence in Education,(2013), 542--551.",
      "doi": ""
    }
  ]
}