{
  "doi": "10.1145/2702123.2702221",
  "title": "Understanding Long-Term Interactions with a Slow Technology: an Investigation of Experiences with FutureMe",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "575-584",
  "year": 2015,
  "badges": [],
  "abstract": "Emerging over a decade ago, slow technology is a design philosophy aimed at supporting experiences of reflection through and on technology in everyday life. Recent research has suggested that slow technologies can open up new forms of interaction with digital content that support self-reflection and re-visitation of the past. However, little work has investigated people's long-term interactions with systems that embody this design strategy. To investigate, a qualitative study with 31 participants was conducted to understand their long-term experiences with FutureMe-a slow technology that has been in use for over twelve years by more than one million people. Findings reveal that, despite its simplicity, FutureMe produced a range of outcomes-from profound reminiscence to unsettling encounters. Findings are interpreted to present opportunities and implications for future research and practice initiatives.",
  "authors": [
    {
      "name": "William Odom",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    }
  ],
  "references": [
    {
      "text": "Bae, J., Lim, Y., Bang, J., Kim, M. 2014. Ripening Room: Designing Social Media for Self-Reflection in Selfexpression. Proc. of DIS '14.  ",
      "doi": "10.1145/2598510.2598567"
    },
    {
      "text": "Baumer, E., Adams, P., Khovanskaya, V., Liao, T., Smith, M., Schwanda, V., Williams, K. 2013. Limiting, leaving, and (re)lapsing: an exploration of facebook non-use practices and experiences. Proc. of CHI '13, 3257--3266.  ",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Belk, R., 1988. Possessions and the Extended Self. Journal of Consumer Research, 15, 2, 139--168.",
      "doi": ""
    },
    {
      "text": "Brubaker, J., Dombrowski, L., Gilbert, A., Kusumakaulika, N., Hayes, G. 2014. Stewarding a Legacy: Responsibilities and Relationships in the Management of Post-mortem Data. Proc. of CHI '14, 4157--4166.  ",
      "doi": "10.1145/2556288.2557059"
    },
    {
      "text": "Cosley, D., Sosik, V., Schultz, J., Pessapati, S., Lee, S. 2012. Experiences with Designing Tools for Everyday Reminiscing, Human-Computer Interaction, 27.",
      "doi": ""
    },
    {
      "text": "Csikszenthmihalyi, M., Rochberg-Halton, E. 1981. The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Friedman, B., Nathan, L. 2010. Multi-Lifespan Information System Design: A Research Initiative for the HCI community. Proc. of CHI '10, 2243--2246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Glaser, B., Strauss, A. 1967. Discovery of grounded theory: strategies for qualitative research. Sociology press.",
      "doi": ""
    },
    {
      "text": "Grosse-Hering, B., Mason, J., Aliakseyeu, D., Bakker, C., Desmet, P. 2013. Slow design for meaningful interactions. Proc. of CHI '13, 3431--3440.  ",
      "doi": "10.1145/2470654.2466472"
    },
    {
      "text": "Gulotta, R., Odom, W., Faste, H., Forlizzi. J. 2013. Digital Artifacts as Legacy: Exploring the Lifespan and Value of Digital Data. Proc. of CHI '13, 1831--1840.  ",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Hallnas, L., Redstrom, J. 2001. Slow Technology: Designing for Reflection. P. Ubi. Comput. 5, 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Harmon, E., Mazmanian, M. 2013. Stories of the Smartphone in everyday discourse: conflict, tension & instability. Proc. of CHI '13, 1051--1060.  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "Harper, R., Randal, D., Smyth, N., Evans, C., Heledd, L., Moore, R. 2008. The Past is a Different Place: They Do Things Differently There. Proc. of DIS '08, 271--280.  ",
      "doi": "10.1145/1394445.1394474"
    },
    {
      "text": "Hawkins, D., Procyk, J., Neustaedter, C. 2014. Postulater: slowing the pace of media sharing. In Adjunct Proc. of DIS '14. 89--92.  ",
      "doi": "10.1145/2598784.2602790"
    },
    {
      "text": "Kaye, J. 2006. I just clicked to say I love you: rich evaluations of minimal communication. CHI EA '06.  ",
      "doi": "10.1145/1125451.1125530"
    },
    {
      "text": "Kaye, J., et al. 2006. To have and to hold: exploring the personal archive. Proc of CHI '06, 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "King, S., Forlizzi, J. 2007. Slow messaging: intimate communication for couples living at a distance. Proc. of DPPI 07, 451--454.  ",
      "doi": "10.1145/1314161.1314204"
    },
    {
      "text": "Kirk, D., Sellen, A. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM TOCHI 17, 3, Article 10 (July 2010).  ",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Leshed, G. 2012. Slowing down with personal productivity tools. interactions 19, 1, 58--63.  ",
      "doi": "10.1145/2065327.2065339"
    },
    {
      "text": "Mazé, R., Redström, J. 2005. Form and the Computational Object. Digital Creativity, 16(1).",
      "doi": ""
    },
    {
      "text": "McAdams, D. P. 2001. The Psychology of Life Stories. Review of General Psychology, 5, 2, 100--122.",
      "doi": ""
    },
    {
      "text": "Massimi, M., Odom, W., Banks, R., Kirk, D. 2011. Matters of Life and Death: Locating the end of life in lifespanoriented HCI research. Proc. of CHI' 11, 987--996.  ",
      "doi": "10.1145/1978942.1979090"
    },
    {
      "text": "Mayer-Schonberger, V. 2009. Delete: The Virtue of Forgetting in the Digital Age. Princeton University. ",
      "doi": "10.5555/1804518"
    },
    {
      "text": "Miles, M. B., Huberman, A., M. 1994. Qualitative Data Analysis. Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., Greenberg, S. 2012. Intimacy in longdistance relationships over video chat. Proc. of CHI '12.  ",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Odom, W., Sellen, A., Banks, R., Kirk, D., Regan, T., Selby, M., Forlizzi, J., Zimmerman, J. 2014. Designing for Slowness, Anticipation and Re-visitation: A Long Term Field Study of the Photobox. Proc. of CHI '14, 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Odom, W. et al. 2013. Fragmentation and Transition: Understanding Perceptions of Virtual Possessions among Young Adults in South Korea, Spain and the USA. Proc. of CHI '13, 1833--1842.  ",
      "doi": "10.1145/2470654.2466242"
    },
    {
      "text": "Odom, W. Banks, R., Kirk, D., Harper, R., Lindley, S., Sellen, A. 2012. Technology Heirlooms? Considerations for passing down and inheriting digital materials. Proc. of CHI '12, 337--346.  ",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "Odom, W., Harper, R., Sellen, A., Kirk, D., Banks, R. 2010. Passing On and Putting To Rest: Understanding Bereavement in the Context of Interactive Technologies. Proc. of CHI '10, 1831--1840.  ",
      "doi": "10.1145/1753326.1753601"
    },
    {
      "text": "Petrelli, D., van den Hoven, E., Whittaker, S. 2009. Making history: intentional capture of future memories. Proc. of CHI '09, 1723--1732.  ",
      "doi": "10.1145/1518701.1518966"
    },
    {
      "text": "Petrelli, D., Villar, N., Kalnikaite, V., Dib, L., Whittaker, S. 2010. FM radio: family interplay with sonic mementos. Proc of CHI '10, 2371--2380.  ",
      "doi": "10.1145/1753326.1753683"
    },
    {
      "text": "Sas, C., Whittaker, S. 2013. Design for forgetting: disposing of digital possessions after a breakup. Proc. of CHI '13, 1823--1832.  ",
      "doi": "10.1145/2470654.2466241"
    },
    {
      "text": "Sellen, A., Fogg, A., Aitken, M., Hodges, S., Rother, C., Wood, K. 2007. Do life-logging technologies support memory for the past?: an experimental study using sensecam. Proc. of CHI '07, 81--90.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Sengers, P., Boehner, K., David, S., Kaye, J. 2005. Reflective Design. Proc. of CC '05, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Tsai, W., Wang, P., Lee, H., Liang, R., Hsu, J. 2014. The reflexive printer: toward making sense of perceived drawbacks in technology-mediated reminiscence. Proc. of DIS '14. 995--1004.  ",
      "doi": "10.1145/2598510.2598589"
    },
    {
      "text": "Vetere, F., Gibbs, M., Kjeldskov, J., Howard, S., Mueller, F., Pedell, S., et al. 2005. Mediating intimacy: Supporting Strong-Tie Relationships. Proc. of CHI '05, 471--480.  ",
      "doi": "10.1145/1054972.1055038"
    },
    {
      "text": "Whittaker, S., Bergman, O., Clough, P. 2010. Easy on that trigger dad: a study of long term family photo retrieval. Personal Ubiquitous Comput. 14, 1, 31--43.  ",
      "doi": "10.1007/s00779-009-0218-7"
    },
    {
      "text": "Zhao, X., Lindley, S. 2014. Curation through Use: Understanding the Personal Value of Social Media. Proc. of CHI '14, 2431--2440.  ",
      "doi": "10.1145/2556288.2557291"
    }
  ]
}