{
  "doi": "10.1145/2702123.2702559",
  "title": "How Activists Are Both Born and Made: An Analysis of Users on Change.org",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "211-220",
  "year": 2015,
  "badges": [],
  "abstract": "E-petitioning has become one of the most important and popular forms of online activism. Although e-petition success is driven by user behavior, users have received relatively little study by HCI and social computing researchers. Drawing from theoretical and empirical work in analogous social computing systems, we identify two potentially competing theories about the trajectories of users in e-petition platforms: (1) \"power\" users in social computing systems are born, not made; and (2) users mature into \"power\" users. In a quantitative analysis of data from Change.org, one of the largest online e-petition platforms, we test and find support for both theories. A follow-up qualitative analysis shows that not only do users learn from their experience, systems also \"learn\" from users to make better recommendations. In this sense, we find that although power users are \"born,\" they are also \"made\" through both processes of personal growth and improved support from the system.",
  "authors": [
    {
      "name": "Shih-Wen Huang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659562241",
      "orcid": "missing"
    },
    {
      "name": "Minhyang (Mia) Suh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706667",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    },
    {
      "name": "Gary Hsieh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    }
  ],
  "references": [
    {
      "text": "Ahn, J., Butler, B. S., Weng, C., & Webster, S. Learn-ing to be a better q'er in social Q&A sites: Social norms and information artifacts. In Proc. the American Society for Information Science and Technology (2013). ",
      "doi": "10.5555/2655780.2655784"
    },
    {
      "text": "An, J., Quercia, D., & Crowcroft, J. Recommending investors for crowdfunding projects. In Proc. WWW (2014).  ",
      "doi": "10.1145/2566486.2568005"
    },
    {
      "text": "Charmaz, K., & Belgrave, L. Qualitative interviewing and grounded theory analysis. The SAGE handbook of interview research: The complexity of the craft (2002).",
      "doi": ""
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., & Riedl, J. Suggest Bot: using intelligent task routing to help peo-ple find work in Wikipedia. In Proc. IUI (2007).  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., & Riedl, J. Using intelligent task routing and contribution review to help communities build artifacts of lasting value. In Proc. CHI (2006).  ",
      "doi": "10.1145/1124772.1124928"
    },
    {
      "text": "Cruickshank, P., Edelmann, N., & Smith, C. F. Signing an e-petition as a transition from lurking to participation (2010).",
      "doi": ""
    },
    {
      "text": "Hale, S. A., Margetts, H., & Yasseri, T. Petition growth and success rates on the United Kingdom No. 10 Downing Street Website. In Proc. WebSci (2013).  ",
      "doi": "10.1145/2464464.2464518"
    },
    {
      "text": "Jungherr, A. and Jürgens, P. The Political click: Political participation through e-petitions in Germany. Poli-cy & Internet (2010).",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E., Pendleton, B. A., Suh, B., & Mytkowicz, T. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. World Wide Web (2007).",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., & Resnick, P. Building Successful Online Communities Evidence-Based Social Design (2012). ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "1Lave, Jean. & Wenger, E. Situated learning: Legitimate peripheral participation. (1991).",
      "doi": ""
    },
    {
      "text": "Margetts, H. Z., John, P., Hale, S. A., & Reissfelder, S. Leadership without Leaders' Starters and Followers in Online Collective Action. Political Studies (2013).",
      "doi": ""
    },
    {
      "text": "Muller, M. Lurking as personal trait or situational disposition: lurking and contributing in enterprise social media. In Proc. CSCW (2012).  ",
      "doi": "10.1145/2145204.2145245"
    },
    {
      "text": "Panagiotopoulos, P., & Elliman, T. Online engagement from the grassroots: Reflecting on over a decade of e-petitioning experience in Europe and the United Kingdom. In Empowering Open and Collaborative Governance (2012).",
      "doi": ""
    },
    {
      "text": "Pal, A., Farzan, R., Konstan, J. A., & Kraut, R. E. Early detection of potential experts in question answering communities. In User Modeling, Adaption and Personalization, Springer Berlin Heidelberg (2011). ",
      "doi": "10.5555/2021855.2021876"
    },
    {
      "text": "Panciera, K., Aaron, H., and Loren T. Wikipedians are born, not made: a study of power editors on Wikipedia.\" In Proc. GROUP (2009).  ",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Panciera, K., Priedhorsky, R., Erickson, T., & Terveen, L. Lurking? cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki. In Proc. CHI (2010).  ",
      "doi": "10.1145/1753326.1753615"
    },
    {
      "text": "Preece, J., & Shneiderman, B. The reader-to-leader framework: Motivating technology-mediated social participation. In AIS Transactions on Human-Computer Interaction (2009).",
      "doi": ""
    },
    {
      "text": "Wash, R., & Jacob S. Coordinating donors on crowd-funding websites.\" In Proc. CSCW (2014)  ",
      "doi": "10.1145/2531602.2531678"
    }
  ]
}