{
  "doi": "10.1145/2702123.2702276",
  "title": "Blood Pressure Beyond the Clinic: Rethinking a Health Metric for Everyone",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1679-1688",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Blood pressure (BP) is typically captured at irregular intervals, mostly in clinic environments. This approach treats BP as a static snapshot for health classification and largely ignores its value as a continuously fluctuat-ing measure. Recognizing that consumers are increasing-ly capturing health metrics through wearable devices, we explored BP measurement in relation to everyday living through a two-week field study with 34 adults. Based on questionnaires, measurement logs, and interviews, we examined participants' perceptions and attitudes to-wards BP variability and their associations of BP with aspects of their lives. We found that participants modi-fied their use of BP devices in response to BP variabil-ity, made associations with stress, food, and daily rou-tines, and revealed challenges with the design of current BP devices for personal use. We present design recom-mendations for BP use in everyday contexts and de-scribe strategies for re-framing BP capture and reporting.",
  "tags": [
    "personal informatics",
    "blood pressure",
    "self-monitoring"
  ],
  "authors": [
    {
      "name": "Logan Kendall",
      "institution": "Microsoft Research & University of Washington, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484644120",
      "orcid": "missing"
    },
    {
      "name": "Dan Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81405594249/rel-imgonly/dan_bass_brightened.jpg",
      "acmid": "81405594249",
      "orcid": "missing"
    },
    {
      "name": "Desney Tan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, N.B., Siddique, J., Wilkins, J.T., et al. Blood pressure trajectories in early adulthood and subclinical atherosclerosis in middle age. JAMA 311, 5 (2014), 490--7.",
      "doi": ""
    },
    {
      "text": "Bentley, F., Tollmar, K., Stephenson, P., et al. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM TOCHI 20, 5 (2013), 1--27.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Cheng, S., Lichtman, J.H., Amatruda, J.M., et al. Knowledge of blood pressure levels and targets in patients with coronary artery disease in the USA. Journal of human hypertension 19, 10 (2005), 769--74.",
      "doi": ""
    },
    {
      "text": "Choe, E.K., Lee, N.B., Lee, B., Pratt, W., Kientz, J.A. Understanding quantified-selfers' practices in collecting and exploring personal data. Proc CHI 2014, ACM Press (2014), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Clemensen, J., Craggs, M., Marcussen, C., et al. Chronically Ill Citizens and Home Monitoring: \"Nothing to talk about\"!. eTELEMED 2013, (2013), 47--52.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Harrison, B., Smith, I., et al. Conducting In Situ Evaluations for and With Ubiquitous Computing Technologies. International Journal of Human-Computer Interaction 22, 1--2 (2007), 103--118.",
      "doi": ""
    },
    {
      "text": "Cuckson, A.C., Reinders, A., Shabeeh, H., Shennan, A.H. Validation of the Microlife BP 3BTO-A oscillometric blood pressure monitoring device according to a modified British Hypertension Society protocol. Blood pressure monitoring 7, 6 (2002), 319--24.",
      "doi": ""
    },
    {
      "text": "Epstein, D., Cordeiro, F., Bales, E., Fogarty, J., Munson, S. Taming data complexity in lifelogs. Proc DIS 2014, ACM Press (2014), 667--676.  ",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Fox, S., Duggan, M. Tracking for Health. Pew Internet & American Life Project, Washington, DC, 2013.",
      "doi": ""
    },
    {
      "text": "Gerin, W., Schwartz, A.R., Schwartz, J.E., et al. Limitations of current validation protocols for home blood pressure monitors for individual patients. Blood pressure monitoring 7, 6 (2002), 313--8.",
      "doi": ""
    },
    {
      "text": "Go, A.S., Mozaffarian, D., Roger, V.L., et al. Heart disease and stroke statistics-2013 update: a report from the American Heart Association. Circulation 127, 1 (2013), e6--e245.",
      "doi": ""
    },
    {
      "text": "Grönvall, E., Verdezoto, N. Understanding challenges and opportunities of preventive blood pressure self-monitoring at home. Proc ECCE 2013, ACM Press (2013), 1.  ",
      "doi": "10.1145/2501907.2501962"
    },
    {
      "text": "Grönvall, E., Verdezoto, N. Beyond self-monitoring. Proc UbiComp 2013, ACM Press (2013), 587.",
      "doi": ""
    },
    {
      "text": "Hermida, R.C., Ayala, D.E., Portaluppi, F. Circadian variation of blood pressure: the basis for the chronotherapy of hypertension. Advanced drug delivery reviews 59, 9--10 (2007), 904--22.",
      "doi": ""
    },
    {
      "text": "Kay, M., Morris, D., Schraefel, M., Kientz, J.A. There's no such thing as gaining a pound. Proc Ubicomp 2013, ACM Press (2013), 401.  ",
      "doi": "10.1145/2493432.2493456"
    },
    {
      "text": "Le, V.-V., Mitiku, T., Sungar, G., Myers, J., Froelicher, V. The blood pressure response to dynamic exercise testing: a systematic review. Progress in cardiovascular diseases 51, 2 (2008), 135--60.",
      "doi": ""
    },
    {
      "text": "Li, I., Dey, A.K., Forlizzi, J. Understanding my data, myself. Proc Ubicomp 2011, ACM Press (2011), 405.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Lim, B.Y., Dey, A.K. Investigating intelligibility for uncertain context-aware applications. Proc Ubicomp 2011, ACM Press (2011), 415.  ",
      "doi": "10.1145/2030112.2030168"
    },
    {
      "text": "Mancia, G., Fagard, R., Narkiewicz, K., et al. 2013 ESH/ESC Guidelines for the management of arterial hypertension. European heart jrnl 34, 28 (2013), 2159--219.",
      "doi": ""
    },
    {
      "text": "Mancia, G. Short- and long-term blood pressure variability: present and future. Hypertension 60, 2 (2012), 512--7.",
      "doi": ""
    },
    {
      "text": "Mort, J.R., Kruse, H.R. Timing of blood pressure measurement related to caffeine consumption. Annals Pharmacotherapy 42, 1 (2008), 105--10.",
      "doi": ""
    },
    {
      "text": "Nair, D., Tan, S.-Y., Gan, H.-W., et al. The use of ambulatory tonometric radial arterial wave capture to measure ambulatory blood pressure: the validation of a novel wristbound device in adults. Journal of human hypertension 22, 3 (2008), 220--2.",
      "doi": ""
    },
    {
      "text": "National Center for Health Statistics. Percent Distribution of Number of Visits to Health Care Professionals by Selected Characteristics: 2000 and 2009. Statistical Abstract of the U.S.: 2010, 2010.",
      "doi": ""
    },
    {
      "text": "Niiranen, T.J., Hänninen, M.-R., Johansson, J., et al. Home-measured blood pressure is a stronger predictor of cardiovascular risk than office blood pressure: the FinnHome study. Hypertension 55, 6 (2010), 1346--51.",
      "doi": ""
    },
    {
      "text": "O'Kane, A.A., Rogers, Y., Blandford, A.E. Gaining empathy for non-routine mobile device use through autoethnography. Proc ACM CHI '14, ACM Press (2014), 987--990.  ",
      "doi": "10.1145/2556288.2557179"
    },
    {
      "text": "Pickering, T.G., White, W.B., Giles, T.D., et al. When and how to use self (home) and ambulatory blood pressure monitoring. J Am Soc Hypertens 4, 2 (2010), 56--61.",
      "doi": ""
    },
    {
      "text": "Rothwell, P.M. Limitations of the usual blood-pressure hypothesis and importance of variability, instability, and episodic hypertension. Lancet 375, 9718 (2010), 938--48.",
      "doi": ""
    }
  ]
}