{
  "doi": "10.1145/2702123.2702209",
  "title": "Making Software Tutorial Video Responsive",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1565-1568",
  "year": 2015,
  "badges": [],
  "abstract": "Tutorial videos are widely available to help people use software. These videos, however, are viewed by users as captured and offer little direct interaction between users and software. This paper presents a video navigation method that allows users to interact with software tutorial video as if they were using the software. To make the tutorial video responsive, our method records the user interaction events like mouse click and drag during capturing the video. Our method then analyzes, selects, and visualizes these user interaction events at the event locations. When a user directly interacts with an event visualization, our method automatically navigates to the proper video frame to provide the visual feedback as if the software were responding to the user input. Thus, our method provides the experience of interacting with the software through directly manipulating the tutorial video. Our study shows our method can better help users follow tutorial videos to complete tasks than the baseline timeline interface.",
  "authors": [
    {
      "name": "Cuong Nguyen",
      "institution": "Portland State University, Portland, OR, USA",
      "img": "/do/10.1145/contrib-81502644262/rel-imgonly/avatar.jpg",
      "acmid": "81502644262",
      "orcid": "0000-0001-9234-9960"
    },
    {
      "name": "Feng Liu",
      "institution": "Portland State University, Portland, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310489042",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Banovic, N., Grossman, T., Matejka, J., and Fitzmaurice, G. Waken: reverse engineering usage information and interface structure from software videos. In ACM UIST (2012), 83--92.  ",
      "doi": "10.1145/2380116.2380129"
    },
    {
      "text": "Brockly, C. Evaluation of direct manipulation techniques for in-scene video navigation. Master's thesis, RWTH Aachen University (2009).",
      "doi": ""
    },
    {
      "text": "Chi, P., Lee, B., and Drucker, S. DemoWiz: re-performing software demonstrations for a live presentation. In ACM CHI (2014), 1581--1590.  ",
      "doi": "10.1145/2556288.2557254"
    },
    {
      "text": "Denoue, L., Carter, S., Cooper, M., and Adcock, J. Real-time direct manipulation of screen-based videos. In IUI Companion (Mar. 2013), 43--44.  ",
      "doi": "10.1145/2451176.2451190"
    },
    {
      "text": "Dragicevic, P., Ramos, G., Bibliowitcz, J., Nowrouzezahrai, D., Balakrishnan, R., and Singh, K. Video browsing by direct manipulation. In ACM CHI (2008), 237--246.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Goldman, D. B., Gonterman, C., Curless, B., Salesin, D., and Seitz, S. M. Video object annotation, navigation, and composition. In ACM UIST (2008), 3--12.  ",
      "doi": "10.1145/1449715.1449719"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. Chronicle: capture, exploration, and playback of document workflow histories. In UIST (2010), 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Karrer, T., Weiss, M., Lee, E., and Borchers, J. Dragon: a direct manipulation interface for frame-accurate in-scene video navigation. In CHI (2008), 247--250.  ",
      "doi": "10.1145/1357054.1357097"
    },
    {
      "text": "Kim, J., Nguyen, P., Weir, S., and Guo, P. Crowdsourcing step-by-step information extraction to enhance existing how-to videos. In ACM CHI (2014), 4017--4026.  ",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "Lafreniere, B., Grossman, T., and Fitzmaurice, G. Investigating the feasibility of extracting tool demonstrations from in-situ video content. In ACM CHI (2014), 4007--4016.  ",
      "doi": "10.1145/2556288.2557142"
    },
    {
      "text": "Matejka, J., Grossman, T., and Fitzmaurice, G. Ambient help. In ACM CHI (2011), 2751--2760.  ",
      "doi": "10.1145/1978942.1979349"
    },
    {
      "text": "Pongnumkul, S., Dontcheva, M., Li, W., and Wang, J. Pause-and-play: automatically linking screencast video tutorials with applications. In ACM UIST (2011).  ",
      "doi": "10.1145/2047196.2047213"
    }
  ]
}