{
  "doi": "10.1145/2702123.2702272",
  "title": "A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1085-1094",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper reports on a study of motivations for the use of peer-to-peer or sharing economy services. We interviewed both users and providers of these systems to obtain different perspectives and to determine if providers are matching their system designs to the most important drivers of use. We found that the motivational models implicit in providers' explanations of their systems' designs do not match well with what really seems to motivate users. Providers place great emphasis on idealistic motivations such as creating a better community and increasing sustainability. Users, on the other hand are looking for services that provide what they need whilst increasing value and convenience. We discuss the divergent models of providers and users and offer design implications for peer system providers.",
  "authors": [
    {
      "name": "Victoria Bellotti",
      "institution": "Palo Alto Research Center & University of California, Santa Cruz, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81100464780/rel-imgonly/bellotti-portrait-small.jpg",
      "acmid": "81100464780",
      "orcid": "missing"
    },
    {
      "name": "Alexander Ambard",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358837157",
      "orcid": "missing"
    },
    {
      "name": "Daniel Turner",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704387",
      "orcid": "missing"
    },
    {
      "name": "Christina Gossmann",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699996",
      "orcid": "missing"
    },
    {
      "name": "Kamila Demkova",
      "institution": "Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699365",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ajzen, I. From intentions to actions: A theory of planned behavior. In J. Kuhl, J. Beckmann (Eds). Action Control: From Cognition to Behavior. Springer Berlin Heidelberg (1985), 11--39.",
      "doi": ""
    },
    {
      "text": "Ajzen, I. The theory of planned behavior. Organizational Behavior and Human Decision Processes 50,2 (1991) 179--211.",
      "doi": "10.1016/0749-5978%2891%2990020-t"
    },
    {
      "text": "Ajzen, I. & Fishbein, M. Understanding attitudes and predicting social behavior. Englewood Cliffs, NJ: Prentice-Hall, (1980).",
      "doi": ""
    },
    {
      "text": "Aunger, R. & Curtis, V. The Anatomy of Motivation: An Evolutionary-Ecological Approach. Biological Theory, 7,3 (2013) 49--63.",
      "doi": ""
    },
    {
      "text": "Bandura, A. (1977). Self-efficacy: toward a unifying theory of behavioral change. Psychological review, 84,2 (1977) 191--215.",
      "doi": ""
    },
    {
      "text": "Bauwens, M. P2P Foundation. Category: Relational. http://p2pfoundation.net/Category:Relational",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Carroll, J.M., & Han, K. Random Acts of Kindness: The Intelligent and Context-Aware Future of Reciprocal Altruism and Community Collaboration. In Proc. CTS 2013, IEEE (2013), 1--12.",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Cambridge, S., Hoy, K., Shih, P.C., Renery Handalian, L., Han, K., & Carroll, J.M. Towards community-centered support for peer-to-peer service exchange: rethinking the timebanking metaphor. In Proc. CHI 2014. ACM Press, (2014) 2975--2984.  ",
      "doi": "10.1145/2556288.2557061"
    },
    {
      "text": "Botsman, R. The Sharing Economy Lacks A Shared Definition. Fast Company Co.Exist Article November 21, 2013. http://www.fastcoexist.com/3022028/thesharing-economy-lacks-a-shared-definition",
      "doi": ""
    },
    {
      "text": "Botsman, R. and Rogers, R. (2011). What's mine is yours. How Collaborative Consumption is changing the way we live. HarperCollinsPublishers: London.",
      "doi": ""
    },
    {
      "text": "Cagle, S. The Case Against Sharing: On Access, Scarcity and Trust. Article in The Nib, May 27th , 2014. https://medium.com/the-nib/the-case-against-sharing9ea5ba3d216d",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. & Bellotti, V. Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange. To appear in Proc. CSCW 2015. ACM Press (2015).  ",
      "doi": "10.1145/2675133.2675270"
    },
    {
      "text": "Chakrabarti, B. & Baron-Cohen, S. Empathizing: neurocognitive developmental mechanisms and individual differences. Anders, Ende, Junghöfer, Kissler & Wildgruber (Eds.) Progress in brain research, 156 (2006), 403--417.",
      "doi": ""
    },
    {
      "text": "Charlton, B.G. The inequity of inequality: egalitarian instincts and evolutionary psychology. Journal of Health Psychology, 2 (1997), 413--425.",
      "doi": ""
    },
    {
      "text": "Chase, B. Sharing is caring. But not in the sharing economy. Huffington Post, 7/25/2014. Retrieved from http://www.huffingtonpost.com/brad-chase/sharing-iscaring-but-not-millenials_b_5618963.html",
      "doi": ""
    },
    {
      "text": "Cialdini, R. Influence: The psychology of persuasion. New York; Quill (1984).",
      "doi": ""
    },
    {
      "text": "Collom, E. The motivations, engagement, satisfaction, outcomes, and demographics of timebank participants: survey findings from a U.S. system. International Journal of Community Currency Research 11, (2007), 36--83.",
      "doi": ""
    },
    {
      "text": "Collom, E. Motivations and differential participation in a community currency system: The dynamics within a local social movement organization. Sociological Forum, 26, 1 (2011), 144--168.",
      "doi": ""
    },
    {
      "text": "Conley, C. Peak: How great companies get their mojo from Maslow. Jossey-Bass, (2007). ",
      "doi": "10.5555/1407010"
    },
    {
      "text": "Cook, K.S., Cheshire, C., Rice, E.R.W. & Nakagawa, S. Social exchange theory. In J. DeLamater & A. Ward (Eds.), Handbook of social psychology. Dordrecht: Springer (2013), 61--88.",
      "doi": ""
    },
    {
      "text": "Crowne, D., & Marlowe, D. The approval motive: Studies in evaluative dependence. New York: Wiley (1964).",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The psychology of optimal experience. Harper & Row (1990).",
      "doi": ""
    },
    {
      "text": "Deci, E. L., Koestner, R., & Ryan, R. M. A metaanalytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological Bulletin, 125,6 (1999). 627--668.",
      "doi": ""
    },
    {
      "text": "Eisenstein, C. Sacred economics: Money, gift, and society in the age of transition. Evolver Editions, 2011.",
      "doi": ""
    },
    {
      "text": "Emerson,R.M. Exchange Theory, Part I: A Psychological Basis for Social Exchange and Exchange Relations in Network Structures. In Sociological Theories in Progress. Houghton Mifflin, Boston, MA (1972a), 38--87.",
      "doi": ""
    },
    {
      "text": "Emerson, R.M. Exchange Theory, Part II: A Psychological Basis for Social Exchange and Exchange Relations in Network Structures. In Sociological Theories in Progress. Houghton Mifflin, Boston, MA (1972b), 38--87.",
      "doi": ""
    },
    {
      "text": "Gansky, L. The Mesh: Why the future of business is sharing. Portfolio Trade, 2012. ",
      "doi": "10.5555/2331393"
    },
    {
      "text": "Heath, C. & Heath, D. Made to Stick: Why some ideas survive and others die. Random House (2007).",
      "doi": ""
    },
    {
      "text": "Henrich J, Gil-White, F. The evolution of prestige: freely conferred deference as a mechanism for enhancing the benefits of cultural transmission. Evol Hum Behav, 22 (2001) 165--196.",
      "doi": ""
    },
    {
      "text": "Herzberg, F. (1966) Work and the nature of man. Cleveland, OH: World.",
      "doi": ""
    },
    {
      "text": "Homans, G. C. Social behavior as exchange. American Journal of Sociology, 63, (1958), 597--606.",
      "doi": ""
    },
    {
      "text": "Huitt, W. (2007). Maslow's hierarchy of needs. Educational Psychology Interactive. Valdosta, GA: Valdosta State University. Retrieved from, http://www.edpsycinteractive.org/topics/regsys/maslow.html",
      "doi": ""
    },
    {
      "text": "Knoke, David. Incentives in Collective Action Organizations. American Sociological Review 53,3 (1988), 311--329.",
      "doi": ""
    },
    {
      "text": "Lampinen, A., Lehtinen, V., Cheshire, C. & Suhonen, E. Indebtedness and reciprocity in local online exchange. In Proc. CSCW'13. ACM Press, (2013), 661--672.  ",
      "doi": "10.1145/2441776.2441850"
    },
    {
      "text": "Maslow, A.H. A theory of human motivation. Psychological Review, 50,4 (1943) 370--96.",
      "doi": ""
    },
    {
      "text": "Maslow, A. H. Motivation and personality. New York: Harper & Row. (1970a).",
      "doi": ""
    },
    {
      "text": "Molm, L. Collett, J. & Schaefer, D.R. Building Solidarity through Generalized Exchange: A Theory of Reciprocity. American Journal of Sociology, 113,1 (2007), 205--42.",
      "doi": ""
    },
    {
      "text": "Morozov, E. The 'sharing economy' undermines workers' rights. Notes EM. Retrieved 7/13/2014 from: http://www.ft.com/intl/cms/s/0/92c3021c-34c2-11e38148-00144feab7de.html",
      "doi": ""
    },
    {
      "text": "Msroka, M. Motivating workers in educational institutions: Adams' equity and Maslow's need hierarchy theoretical implications. GRIN Verlag (2013).",
      "doi": ""
    },
    {
      "text": "Oyserman, D. Identity-based motivation: Implications for action-readiness, procedural-readiness, and consumer behavior Journal of Consumer Psychology 19 (2009) 250--260.",
      "doi": ""
    },
    {
      "text": "Pink, D. H. Drive: The surprising truth about what motivates us. Riverhead Books (2011).",
      "doi": ""
    },
    {
      "text": "Regan, R. T. Effects of a favor and liking on compliance. Journal of Experimental Social Psychology 7 (1971), 627--639.",
      "doi": ""
    },
    {
      "text": "Ryan, R. M., & Deci, E. L. (2000). Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist, 55, 68--78.",
      "doi": ""
    },
    {
      "text": "Schor, J. B. True Wealth: How and why millions of Americans are creating a time-rich, ecologically light, small-scale, high-satisfaction economy. Penguin Books, (2010).",
      "doi": ""
    },
    {
      "text": "ServiceSpace Blog Post. From sharing economy to gift ecology. Posted by Nipun Mehta on May 31, 2014. http://www.servicespace.org/blog/view.php?id=14918",
      "doi": ""
    },
    {
      "text": "Suhonen, E., Lampinen, A., Cheshire, C. & Antin, J. Everyday favors: a case study of a local online gift exchange system. In Proc. GROUP '10. ACM Press, (2010), 11--20.  ",
      "doi": "10.1145/1880071.1880074"
    },
    {
      "text": "Tay, L. & Diener E. Needs and subjective well-being around the world. J Pers Soc Psychol, 101,2 (2011) 35465.",
      "doi": ""
    },
    {
      "text": "Trivers, R. L. The evolution of reciprocal altruism. The Quarterly Review of Biology 46, 1 (1971), 35--57.",
      "doi": ""
    },
    {
      "text": "Vallerand, R. J., & Fortier, M. S. Measures of intrinsic and extrinsic motivation in sport and physical activity: a review and critique. In J. Duda (Ed.), Advancements in sport and exercise psychology measurement (pp. 83--100). Morgantown, WV: Fitness Information Technology (1998).",
      "doi": ""
    },
    {
      "text": "van de Glind, P. The consumer potential of Collaborative Consumption. Research MSc in Sustainable Development -- Environmental Governance Faculty of Geosciences, Utrecht University, Netherlands August, (2013).",
      "doi": ""
    },
    {
      "text": "Vision Critical. Sharing is the new buying. How to win in the collaborative economy (2014). Retrieved from: http://www.visioncritical.com/sites/default/files/pdf/shari ng-new-buying-collaborative-economy-report.pdf",
      "doi": ""
    },
    {
      "text": "Wahba, M. A., & Bridwell, L. G. (1976). Maslow reconsidered: A review of research on the need hierarchy theory. Organizational Behavior and Human Performance, 15,2 (1976) 212--240.",
      "doi": ""
    },
    {
      "text": "Webb, T.L., Joseph, J., Yardley, L. & Michie, S. Using the Internet to promote health behavior change: A systematic review and meta-analysis of the impact of theoretical basis, use of behavior change techniques, and mode of delivery on efficacy. J Med Internet Res. 12,1 (2010).",
      "doi": ""
    },
    {
      "text": "Willer R. Groups reward individual sacrifice: the status solution to the collective action problem. Am Sociol Rev 74 (2009) 23--43.",
      "doi": ""
    },
    {
      "text": "Williams, G. C., & Deci, E. L. Internalization of biopsychosocial values by medical students: a test of self-determination theory. J Pers Soc Psychol, 70 (1996). 767--779.",
      "doi": ""
    },
    {
      "text": "Williams, G. C., Grow, V. M., Freedman, Z. R., Ryan, R. M., & Deci, E. L. Motivational predictors of weight loss and weight-loss maintenance. J Pers Soc Psychol, 70 (1996). 115--126.",
      "doi": ""
    },
    {
      "text": "Wright, R. The moral animal: Why we are, the way we are: The new science of evolutionary psychology. Vintage; Reprint edition, (1995).",
      "doi": ""
    }
  ]
}