{
  "doi": "10.1145/2702123.2702141",
  "title": "I Feel Like I'm Taking Selfies All Day!: Towards Understanding Biometric Authentication on Smartphones",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1411-1414",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present the results of an MTurk survey (n=383) on the reasons for using and not using biometric authentication systems on smartphones. We focused on Apple's Touch ID as well as Android's Face Unlock as they are the most prevalent systems on the market. For both systems, we categorized the participants as a) current users, b) former users that deactivated it at some point and c) nonusers. The results show that usability is one of the main factors that influences the decision on whether or not to use biometric verification on the smartphone. To our surprise and as opposed to previous research on biometric authentication, privacy and trust issues were not among the most important decision factors.",
  "authors": [
    {
      "name": "Alexander De Luca",
      "institution": "University of Munich (LMU) & DFKI GmbH, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488374",
      "orcid": "missing"
    },
    {
      "name": "Alina Hang",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371595104",
      "orcid": "missing"
    },
    {
      "name": "Emanuel von Zezschwitz",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421599585",
      "orcid": "missing"
    },
    {
      "name": "Heinrich Hussmann",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-81100395854/rel-imgonly/heinrich-hussmann.jpg",
      "acmid": "81100395854",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anjos, A., and Marcel, S. Counter-measures to photo attacks in face recognition: A public database and a baseline. In Proc. IJCB '11, IEEE (2011), pp. 1--7.  ",
      "doi": "10.1109/IJCB.2011.6117503"
    },
    {
      "text": "Bhagavatula, C., Iacovino, K., Kywe, S. M., Cranor, L. F., and Ur, B. Poster: Usability analysis of biometric authentication systems on mobile phones. SOUPS Poster (2014).",
      "doi": ""
    },
    {
      "text": "Coventry, L., De Angeli, A., and Johnson, G. Usability and biometric verification at the atm interface. In Proc. CHI '03, ACM (2003), pp. 153--160.  ",
      "doi": "10.1145/642611.642639"
    },
    {
      "text": "Egelman, S., Jain, S., Portnoff, R. S., Liao, K., Consolvo, S., and Wagner, D. Are you ready to lock? understanding user motivations for smartphone locking behaviors. In Proc. CCS '14, ACM (2014), pp. 750--761.  ",
      "doi": "10.1145/2660267.2660273"
    },
    {
      "text": "Hang, A., De Luca, A., Frison, K., von Zezschwitz, E., Tedesco, M., Kockmann, M., and Hussmann, H. Travel routes or geography facts? an evaluation of voice authentication user interfaces. In Proc. INTERACT '13, Springer (2013), 468--475.",
      "doi": ""
    },
    {
      "text": "Harbach, M., von Zezschwitz, E., Fichtner, A., De Luca, A., and Smith, M. It's a hard lock life: A field study of smartphone (un)locking behavior and risk perception. In Proc. SOUPS '14, USENIX Association (July 2014), pp. 213--230.",
      "doi": ""
    },
    {
      "text": "Sieger, H., Kirschnick, N., and Möller, S. Poster: User preferences for biometric authentication methods and graded security on mobile phones. SOUPS Poster (2010).",
      "doi": ""
    }
  ]
}