{
  "doi": "10.1145/2702123.2702305",
  "title": "Eye-Wearable Technology for Machine Maintenance: Effects of Display Position and Hands-free Operation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2125-2134",
  "year": 2015,
  "badges": [],
  "abstract": "Exciting developments in eye-wearable technology and its potential industrial applications warrant a thorough understanding of its advantages and drawbacks through empirical evidence. We conducted an experiment to investigate what characteristics of eye-wearable technology impact user performance in machine maintenance, which included a representative set of car maintenance tasks involving Locate, Manipulate, and Compare actions. Participants were asked to follow instructions displayed on one of four technologies: a peripheral eye-wearable display, a central eye-wearable display, a tablet, or a paper manual. We found a significant effect of display position: the peripheral eye-wearable display resulted in longer completion time than the central display; but no effect for hands-free operation. The technology effects were also modulated by different Tasks and Action types. We discuss the human factors implications for designing more effective eye-wearable technology, including display position, issues of monocular display, and how the physical proximity of the technology affects users' reliance level.",
  "tags": [
    "wearable computing",
    "smartglasses",
    "action type",
    "eye-wearable technology",
    "task guidance",
    "machine maintenance"
  ],
  "authors": [
    {
      "name": "Xianjun Sam Zheng",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606402",
      "orcid": "missing"
    },
    {
      "name": "Cedric Foucault",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959268857",
      "orcid": "missing"
    },
    {
      "name": "Patrik Matos da Silva",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707474",
      "orcid": "missing"
    },
    {
      "name": "Siddharth Dasari",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700643",
      "orcid": "missing"
    },
    {
      "name": "Tao Yang",
      "institution": "Siemens Corporate Research, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699216",
      "orcid": "missing"
    },
    {
      "name": "Stuart Goose",
      "institution": "Siemens Technology to Business, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100484153",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aleksy, M., Rissanen, M. J., Maczey, S., & Dix. M. Wearable computing in industrial service applications. Procedia Computer Science, 5:394--400, 2011.",
      "doi": ""
    },
    {
      "text": "Billinghurst, M., Bowskill, J., Jessop, M., & Morphett, J. A wearable spatial conferencing space. In Proc. 2nd International Symposium on Wearable Computers, 76--83. IEEE, 1998. ",
      "doi": "10.5555/857199.858019"
    },
    {
      "text": "Caudell, T.P., & Mizell, D.W. Augmented reality: an application of heads-up display technology to manual manufacturing processes. In Proc. 25th Hawaii International Conf. on System Sciences, 659--669, 1992.",
      "doi": ""
    },
    {
      "text": "Dey, A. K., Salber, D., Abowd, G. D., & Futakawa, M. The conference assistant: Combining context-awareness with wearable computing. In Proc. 3rd International Symposium on Wearable Computers, 21--28. IEEE, 1999. ",
      "doi": "10.5555/519309.856496"
    },
    {
      "text": "Friedrich, W. ARVIKA-augmented reality for development, production and service, In Proc. ISMAR, 34, 2002. ",
      "doi": "10.5555/850976.854993"
    },
    {
      "text": "Gartner Says Smartglasses Will Bring Innovation to Workplace Efficiency. http://gtnr.it/1qqbXce.",
      "doi": ""
    },
    {
      "text": "Goose, S., Sudarsky, S., Zhang, X..& Navab, N. Speechenabled augmented reality supporting mobile industrial maintenance, Pervasive Computing, IEEE, 2(1): 65--70, 2003.  ",
      "doi": "10.1109/MPRV.2003.1186727"
    },
    {
      "text": "Henderson, S. & Feiner, S. Augmented Reality in the Psychomotor Phase of a Procedural Task, In Proc. of IEEE International Symposium on Mixed and Augmented Reality, 191--200, (2011).  ",
      "doi": "10.1109/ISMAR.2011.6092386"
    },
    {
      "text": "Hung, G. K., & Ciuffreda, K. J. Models of the Visual System. Springer Science, 2002.",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., Fussell, S. R., & Siegel, J. Visual information as a conversational resource in collaborative physical tasks. HCI, 18, 13--49, 2003.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "Lee, J. D., & See, K. A. Trust in automation: Designing for appropriate reliance. Human Factors, 46(1):50--80, 2004.",
      "doi": ""
    },
    {
      "text": "Machinery Maintenance & Heavy Equipment Repair Services Market Research Report, 2014. http://bit.ly/1kVmv6N.",
      "doi": ""
    },
    {
      "text": "Mackay, W. E.. Users and customizable software: A coadaptive phenomenon. PhD thesis, 1990.",
      "doi": ""
    },
    {
      "text": "Mann, S. Wearable computing. The Encyclopedia of HCI, 2nd Ed., 2013.",
      "doi": ""
    },
    {
      "text": "Mann, S., Lo, R. C., Ovtcharov, K., Gu, S., Dai, D., Ngan, C., & Ai, T. Realtime high dynamic range video for eyetap wearable computers, fpga- based seeing aids, and glasseye. In Proc. 25th CCECE, 1--6, 2012.",
      "doi": ""
    },
    {
      "text": "Neumann, U., & Majoros, A. E. Cognitive, performance, and systems issues for augmented reality applications in manufacturing and maintenance. In Proc. VRAIS, p4--12, 1998. ",
      "doi": "10.5555/522258.836112"
    },
    {
      "text": "Ockerman, J. J., & Pritchett, A. R. Preliminary investigation of wearable computers for task guidance in aircraft inspection. In Proc. 2nd International Symposium on Wearable Computers 33--40. IEEE, 1998. ",
      "doi": "10.5555/857199.858012"
    },
    {
      "text": "Parasuraman, R., & Riley, V. Humans and automation: Use, misuse, disuse, abuse. Human Factors, 39(2):230253, 1997.",
      "doi": ""
    },
    {
      "text": "Pineles, S. L., Velez, F. G., Isenberg, S. J., Fenoglio, Z., Birch, E., Nusinowitz, S., & Demer, J. L. Functional burden of strabismus: Decreased binocular summation and binocular inhibition. JAMA ophthalmology, 131(11):1413--1419, 2013.",
      "doi": ""
    },
    {
      "text": "Reiss, M., & Reiss, G. Ocular dominance: some family data. Laterality: Asymmetries of Body, Brain and Cognition, 2(1):7--16, 1997.",
      "doi": ""
    },
    {
      "text": "Richardson, M., Jones, G. & Torrance, M.. Identifying the task variables that influence perceived object assembly complexity, Ergonomics, 47(9), 945--64, 2004.",
      "doi": ""
    },
    {
      "text": "Rhodes, B. J. The wearable remembrance agent: A system for augmented memory. Personal Technologies, 1(4):218--224, 1997.",
      "doi": ""
    },
    {
      "text": "Siegel, J., & Bauer, M. A field usability evaluation of a wearable system. In Proc. 1st International Symposium on Wearable Computers 18--22. IEEE, 1997. ",
      "doi": "10.5555/851036.856446"
    },
    {
      "text": "Siewiorek, D., Smailagic, A., Bass, L., Siegel, J., Martin, R., & Bennington, B. Adtranz: a mobile computing system for maintenance and collaboration. In Proc. 16th International Symposium on Wearable Computers, 25--25, IEEE, 1998. ",
      "doi": "10.5555/857199.858011"
    },
    {
      "text": "Smailagic, A., & Siewiorek, D. Application design for wearable and context-aware computers. Pervasive Computing, IEEE, 1(4):20--29, 2002.  ",
      "doi": "10.1109/MPRV.2002.1158275"
    },
    {
      "text": "Smart Glass Market by Technology -- 2020. http://bit.ly/1thCiOK.",
      "doi": ""
    },
    {
      "text": "Starner, T. The challenges of wearable computing: Part 1. IEEE Micro, 21(4):44--52, 2001.  ",
      "doi": "10.1109/40.946681"
    },
    {
      "text": "Starner, T., Mann, S., Rhodes, B., Levine, J., Healey, J., Kirsch, D., Picard, R. W., & Pentland, A. Augmented reality through wearable computing. Presence: Teleoperators and Virtual Environments, 6(4):386--398, 1997.",
      "doi": "10.1162/pres.1997.6.4.386"
    },
    {
      "text": "Stidwill, D., & Fletcher, R. Normal Binocular Vision: Theory, Investigation and Practical Aspects. John Wiley & Sons, 2010.",
      "doi": ""
    },
    {
      "text": "Thompson, C., Najjar, L. J., & Ockerman, J. J. Wearable computer based training and performance support systems. In Proc. the Interservice/Industry Training, Simulation & Education Conf., 1997.",
      "doi": ""
    },
    {
      "text": "Träskbäack, M. & Haller, M. Mixed reality training application for an oil refinery: user requirements. In Proc. of VRCAI, 324--327, 2004.  ",
      "doi": "10.1145/1044588.1044658"
    },
    {
      "text": "Trope, Y., & Liberman, N. Construal-level theory of psychological distance. Psychological review, 117(2):440, 2010.",
      "doi": ""
    },
    {
      "text": "Weaver, K. A., Baumann, H., Starner, T., Iben, H., & Lawo, M. An empirical task analysis of warehouse order picking using head-mounted displays. In Proc. of the SIGCHI, 1695--1704, 2010.  ",
      "doi": "10.1145/1753326.1753580"
    },
    {
      "text": "Wickens, C. D. Processing resources in attention. (Parasuraman R, Davies R), editors. Varieties of attention, 1984.",
      "doi": ""
    },
    {
      "text": "Williams, L. E. & Bargh, J. A. Keeping one's distance the influence of spatial distance cues on aect and evaluation. Psychological Science, 19(3):302--308, 200.",
      "doi": ""
    },
    {
      "text": "World Vehicle Population Tops 1 Billion Units WardsAuto. http://bit.ly/1jugNFm.",
      "doi": ""
    }
  ]
}