{
  "doi": "10.1145/2702123.2702198",
  "title": "GACA: Group-Aware Command-based Arrangement of Graphic Elements",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2787-2795",
  "year": 2015,
  "badges": [],
  "abstract": "Many graphic applications rely on command-based arrangement tools to achieve precise layouts. Traditional tools are designed to operate on a single group of elements that are distributed consistently with the arrangement axis implied by a command. This often demands a process with repeated element selections and arrangement commands to achieve 2D layouts involving multiple rows and/or columns of well aligned and/or distributed elements. Our work aims to reduce the numbers of selection operation and command invocation, since such reductions are particularly beneficial to professional designers who design lots of layouts. Our key idea is that an issued arrangement command is in fact very informative, instructing how to automatically decompose a 2D layout into multiple 1D groups, each of which is compatible with the command. We present a parameter-free, command-driven grouping approach so that users can easily predict our grouping results. We also design a simple user interface with pushpins to enable explicit control of grouping and arrangement. Our user study confirms the intuitiveness of our technique and its performance improvement over traditional command-based arrangement tools.",
  "tags": [
    "alignment",
    "arrangement commands",
    "group-aware",
    "layout editing"
  ],
  "authors": [
    {
      "name": "Pengfei Xu",
      "institution": "HKUST, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502775303",
      "orcid": "missing"
    },
    {
      "name": "Hongbo Fu",
      "institution": "City University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/do/10.1145/contrib-84458824857/rel-imgonly/hongbo_headshot_2023__small_.png",
      "acmid": "84458824857",
      "orcid": "0000-0002-0284-726X"
    },
    {
      "name": "Chiew-Lan Tai",
      "institution": "HKUST, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100311561",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P., Cutrell, E., Hinckley, K., and Eversole, A. Snap-and-go: helping users align objects without the modality of traditional snapping. In CHI '05 (2005), 301--310.  ",
      "doi": "10.1145/1054972.1055014"
    },
    {
      "text": "Bier, E. A., and Stone, M. C. Snap-dragging. In ACM SIGGRAPH Computer Graphics, vol. 20 (1986), 233--240.  ",
      "doi": "10.1145/15886.15912"
    },
    {
      "text": "Dwyer, T., Marriott, K., and Wybrow, M. Dunnart: A constraint-based network diagram authoring tool. In Graph Drawing (2009), 420--431.  ",
      "doi": "10.1007/978-3-642-00219-9_41"
    },
    {
      "text": "Frisch, M., Kleinau, S., Langner, R., and Dachselt, R. Grids & guides: multi-touch layout and alignment tools. In CHI '11 (2011), 1615--1618.  ",
      "doi": "10.1145/1978942.1979177"
    },
    {
      "text": "Frisch, M., Langner, R., and Dachselt, R. Neat: a set of flexible tools and gestures for layout tasks on interactive displays. In ITS '11 (2011), 1--10.  ",
      "doi": "10.1145/2076354.2076356"
    },
    {
      "text": "Galindo, D., and Faure, C. Perceptually-based representation of network diagrams. In ICDAR '97, vol. 1 (1997), 352--356. ",
      "doi": "10.5555/646270.685313"
    },
    {
      "text": "Heo, S., Lee, Y.-K., Yeom, J., and Lee, G. Design of a shape dependent snapping algorithm. In CHI EA '12 (2012), 2207--2212.  ",
      "doi": "10.1145/2212776.2223777"
    },
    {
      "text": "Igarashi, T., and Hughes, J. F. A suggestive interface for 3D drawing. In UIST '01 (2001), 173--181.  ",
      "doi": "10.1145/502348.502379"
    },
    {
      "text": "Igarashi, T., Matsuoka, S., Kawachiya, S., and Tanaka, H. Interactive beautification: a technique for rapid geometric design. In UIST (1997), 105--114.  ",
      "doi": "10.1145/263407.263525"
    },
    {
      "text": "Nan, L., Sharf, A., Xie, K., Wong, T.-T., Deussen, O., Cohen-Or, D., and Chen, B. Conjoining gestalt rules for abstraction of architectural drawings. ACM Trans. Graph. 30, 6 (2011), 185:1--185:10.  ",
      "doi": "10.1145/2070781.2024219"
    },
    {
      "text": "Nelson, G. Juno, a constraint-based graphics system. In ACM SIGGRAPH Computer Graphics, vol. 19 (1985), 235--243.  ",
      "doi": "10.1145/325165.325241"
    },
    {
      "text": "Pavlidis, T., and Van Wyk, C. J. An automatic beautifier for drawings and illustrations. In ACM SIGGRAPH Computer Graphics, vol. 19 (1985), 225--234.  ",
      "doi": "10.1145/325165.325240"
    },
    {
      "text": "Raisamo, R., and Raiha, K.-J. A new direct manipulation technique for aligning objects in drawing programs. In UIST (1996), 157--164.  ",
      "doi": "10.1145/237091.237113"
    },
    {
      "text": "Reinert, B., Ritschel, T., and Seidel, H.-P. Interactive by-example design of artistic packing layouts. ACM Trans. Graph. 31, 6 (2013), Article No. 218.  ",
      "doi": "10.1145/2508363.2508409"
    },
    {
      "text": "Ryall, K., Marks, J., and Shieber, S. An interactive constraint-based system for drawing graphs. In UIST '97 (1997), 97--104.  ",
      "doi": "10.1145/263407.263521"
    },
    {
      "text": "Saund, E., Fleet, D., Larner, D., and Mahoney, J. Perceptually-supported image editing of text and graphics. In UIST '03 (2003), 183--192.  ",
      "doi": "10.1145/964696.964717"
    },
    {
      "text": "Scarr, J., Cockburn, A., Gutwin, C., and Bunt, A. Improving command selection with commandmaps. In CHI '12 (2012), 257--266.  ",
      "doi": "10.1145/2207676.2207713"
    },
    {
      "text": "Tollis, I., Eades, P., Di Battista, G., and Tollis, L. Graph drawing: algorithms for the visualization of graphs, vol. 1. Prentice Hall New York, 1998. ",
      "doi": "10.5555/551884"
    },
    {
      "text": "Xu, P., Fu, H., Au, O. K.-C., and Tai, C.-L. Lazy selection: a scribble-based tool for smart shape elements selection. ACM Transactions on Graphics 31, 6 (2012), Article No. 142.  ",
      "doi": "10.1145/2366145.2366161"
    },
    {
      "text": "Xu, P., Fu, H., Igarashi, T., and Tai, C.-L. Global beautification of layouts with interactive ambiguity resolution. In UIST 14 (2014), 243--252.  ",
      "doi": "10.1145/2642918.2647398"
    }
  ]
}