{
  "doi": "10.1145/2702123.2702392",
  "title": "Design Considerations for Patient Portal Adoption by Low-Income, Older Adults",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3859-3868",
  "year": 2015,
  "badges": [],
  "abstract": "This paper describes the results of an interview study investigating facilitators and barriers to adoption of patient portals among low-income, older adults in rural and urban populations in the southeastern USA. We describe attitudes of this population of older adults and their current level of technology use and patient portal use. From qualitative analysis of 36 patient interviews and 16 caregiver interviews within these communities, we derive themes related to benefits of portals, barriers to use, concerns and desired features. Based on our initial findings, we present a set of considerations for designing the patient portal user experience, aimed at helping healthcare clinics to meet U.S. federally-mandated `meaningful use' requirements.",
  "authors": [
    {
      "name": "Celine Latulipe",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/do/10.1145/contrib-81100323202/rel-imgonly/celine-1657_sm.jpg",
      "acmid": "81100323202",
      "orcid": "missing"
    },
    {
      "name": "Amy Gatto",
      "institution": "Wake Forest School of Medicine, Winston-Salem, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699866",
      "orcid": "missing"
    },
    {
      "name": "Ha T. Nguyen",
      "institution": "Wake Forest School of Medicine, Winston-Salem, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701608",
      "orcid": "missing"
    },
    {
      "name": "David P. Miller",
      "institution": "Wake Forest School of Medicine, Winston-Salem, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703119",
      "orcid": "missing"
    },
    {
      "name": "Sara A. Quandt",
      "institution": "Wake Forest School of Medicine, Winston-Salem, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699733",
      "orcid": "missing"
    },
    {
      "name": "Alain G. Bertoni",
      "institution": "Wake Forest School of Medicine, Winston-Salem, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704160",
      "orcid": "missing"
    },
    {
      "name": "Alden Smith",
      "institution": "Greene County Healthcare, Snow Hill, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701773",
      "orcid": "missing"
    },
    {
      "name": "Thomas A. Arcury",
      "institution": "Wake Forest School of Medicine, Winston-Salem, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658698943",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rural-urban continuum codes, 2013. http://www.ers.usda.gov/data-products/ rural-urban-continuum-codes.aspx#.VAW_UmRdW-S {Online; accessed 2-Sept-2014}.",
      "doi": ""
    },
    {
      "text": "Step 5: Achieve meaningful use, 2014. http: //www.healthit.gov/providers-professionals/ step-5-achieve-meaningful-use-stage-2 {Online; accessed 2-Sept-2014}.",
      "doi": ""
    },
    {
      "text": "Ahern, D. K., Woods, S. S., Lightowler, M. C., Finley, S. W., and Houston, T. K. Promise of and potential for patient-facing technologies to enable meaningful use. American Journal of Preventive Medicine 40, 5 (2011), S162--S172.",
      "doi": ""
    },
    {
      "text": "Ancker, J. S., Barrón, Y., Rockoff, M. L., Hauser, D., Pichardo, M., Szerencsy, A., and Calman, N. Use of an electronic patient portal among disadvantaged populations. Journal of General Internal Medicine 26, 10 (2011), 1117--1123.",
      "doi": ""
    },
    {
      "text": "Arcury, T. A., and Quandt, S. A. Qualitative methods in arthritis research: sampling and data analysis. Arthritis & Rheumatism 11, 1 (1998), 66--74.",
      "doi": ""
    },
    {
      "text": "Arcury, T. A., and Quandt, S. A. Participant recruitment for qualitative research: A site-based approach to community research in complex societies. Human Organization 58, 2 (1999), 128--133.",
      "doi": ""
    },
    {
      "text": "Baird, A., North, F., and Raghu, T. S. Personal health records (phr) and the future of the physician-patient relationship. In Proceedings of the 2011 iConference, iConference '11, ACM (2011), 281--288.  ",
      "doi": "10.1145/1940761.1940800"
    },
    {
      "text": "Buntin, M. B., Burke, M. F., Hoaglin, M. C., and Blumenthal, D. The benefits of health information technology: a review of the recent literature shows predominantly positive results. Health Affairs 30, 3 (2011), 464--471.",
      "doi": ""
    },
    {
      "text": "Fruhling, A. Perceptions of e-health in rural communities. Patient-Centered E-Health (2008), 157--167.",
      "doi": ""
    },
    {
      "text": "Goel, M. S., Brown, T. L., Williams, A., Cooper, A. J., Hasnain-Wynia, R., and Baker, D. W. Patient reported barriers to enrolling in a patient portal. Journal of the American Medical Informatics Association 18, 1 (2011), 8--12.",
      "doi": ""
    },
    {
      "text": "Greysen, S., Chin, G. C., Sudore, R., Cenzer, I., and Covinsky, K. Functional impairment and internet use among older adults: Implications for meaningful use of patient portals. JAMA Internal Medicine (2014).",
      "doi": ""
    },
    {
      "text": "Hoffman, D. L., and Novak, T. P. Bridging the racial divide on the internet. Science 280, 5362 (1998), 390--391.",
      "doi": ""
    },
    {
      "text": "Kellermann, A. L., and Jones, S. S. What it will take to achieve the as-yet-unfulfilled promises of health information technology. Health Affairs 32, 1 (2013), 63--68.",
      "doi": ""
    },
    {
      "text": "Kim, E.-H., Stolyar, A., Lober, W. B., Herbaugh, A. L., Shinstrom, S. E., Zierler, B. K., Soh, C. B., and Kim, Y. Usage patterns of a personal health record by elderly and disabled users. In AMIA Annual Symposium Proceedings, vol. 2007, American Medical Informatics Association (2007), 409--413.",
      "doi": ""
    },
    {
      "text": "Klein, R. An empirical examination of patient-physician portal acceptance. European Journal of Information Systems 16, 6 (2007), 751--760.",
      "doi": ""
    },
    {
      "text": "Kumar, S., and Aldrich, K. Overcoming barriers to electronic medical record (EMR) implementation in the us healthcare system: A comparative study. Health informatics journal 16, 4 (2010), 306--318.",
      "doi": ""
    },
    {
      "text": "Liu, L. S., Shih, P. C., and Hayes, G. R. Barriers to the adoption and use of personal health record systems. In Proceedings of the 2011 iConference, iConference '11, ACM (2011), 363--370.  ",
      "doi": "10.1145/1940761.1940811"
    },
    {
      "text": "Luborsky, M. R. The identification and analysis of themes and patterns. Sage Publications, Inc, 1994.",
      "doi": ""
    },
    {
      "text": "Mauro, A., and de Quiros, F. G. B. Patient-centered e-health design. Patient-Centered E-Health: Medical Info Science Reference (2009).",
      "doi": ""
    },
    {
      "text": "Milewski, J., and Parra, H. Gathering requirements for a personal health management system. In CHI '11 Extended Abstracts on Human Factors in Computing Systems, CHI EA '11, ACM (2011), 2377--2382.  ",
      "doi": "10.1145/1979742.1979881"
    },
    {
      "text": "Moyer, C. A., Stern, D. T., Dobias, K. S., Cox, D. T., and Katz, S. J. Bridging the electronic divide: patient and provider perspectives on e-mail communication in primary care. The American Journal of Managed Care 8, 5 (2002), 427--433.",
      "doi": ""
    },
    {
      "text": "Or, C. K., and Karsh, B.-T. A systematic review of patient acceptance of consumer health information technology. Journal of the American Medical Informatics Association 16, 4 (2009), 550--560.",
      "doi": ""
    },
    {
      "text": "Pai, F.-Y., and Huang, K.-I. Applying the technology acceptance model to the introduction of healthcare information systems. Technological Forecasting and Social Change 78, 4 (2011), 650--660.",
      "doi": ""
    },
    {
      "text": "Pang, C. E., Neustaedter, C., Riecke, B. E., Oduor, E., and Hillman, S. Technology preferences and routines for sharing health information during the treatment of a chronic illness. In Proceedings of ACM CHI 2013, ACM (2013), 1759--1768.  ",
      "doi": "10.1145/2470654.2466232"
    },
    {
      "text": "Pratt, W., Unruh, K., Civan, A., and Skeels, M. M. Personal health information management. Communications of the ACM 49, 1 (2006), 51--55.  ",
      "doi": "10.1145/1107458.1107490"
    },
    {
      "text": "Ruland, C. M., Brynhi, H., Andersen, R., and Bryhni, T. Developing a shared electronic health record for patients and clinicians. Studies in health technology and informatics 136 (2008), 57.",
      "doi": ""
    },
    {
      "text": "Simon, S. R., Evans, J. S., Benjamin, A., Delano, D., and Bates, D. W. Patients attitudes toward electronic health information exchange: qualitative study. Journal of Medical Internet research 11, 3 (2009).",
      "doi": ""
    },
    {
      "text": "Sun, S., Zhou, X., Denny, J. C., Rosenbloom, T. S., and Xu, H. Messaging to your doctors: Understanding patient-provider communications via a portal system. In Proceedings of ACM CHI 2013, CHI '13, ACM (2013), 1739--1748.  ",
      "doi": "10.1145/2470654.2466230"
    },
    {
      "text": "Tang, P. C., Ash, J. S., Bates, D. W., Overhage, J. M., and Sands, D. Z. Personal health records: definitions, benefits, and strategies for overcoming barriers to adoption. Journal of the American Medical Informatics Association 13, 2 (2006), 121--126.",
      "doi": ""
    },
    {
      "text": "Wilson, E. V., and Lankton, N. K. Modeling patients' acceptance of provider-delivered e-health. Journal of the American Medical Informatics Association 11, 4 (2004), 241--248.",
      "doi": ""
    },
    {
      "text": "Wilson, E. V., and Lankton, N. K. Predicting patients use of provider-delivered e-health: The role of facilitating conditions. Patient-centered e-health (2009), 217--229.",
      "doi": ""
    },
    {
      "text": "Yagil, D., Cohen, M., and Beer, J. D. Older adults coping with the stress involved in the use of everyday technologies. Journal of Applied Gerontology (2013), 0733464813515089.",
      "doi": ""
    },
    {
      "text": "Zickmund, S. L., Hess, R., Bryce, C. L., McTigue, K., Olshansky, E., Fitzgerald, K., and Fischer, G. S. Interest in the use of computerized patient portals: role of the provider-patient relationship. Journal of General Internal Medicine 23, 1 (2008), 20--26.",
      "doi": ""
    }
  ]
}