{
  "doi": "10.1145/2702123.2702457",
  "title": "ActivPass: Your Daily Activity is Your Password",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2325-2334",
  "year": 2015,
  "badges": [],
  "abstract": "This paper explores the feasibility of automatically extracting passwords from a user's daily activity logs, such as her Facebook activity, phone activity etc. As an example, a smartphone might ask the user: \"Today morning from whom did you receive an SMS?\" In this paper, we observe that infrequent activities (i.e., outliers) can be memorable and unpredictable. Building on this observation, we have developed an end to end system ActivPass and experimented with 70 users. With activity logs from Facebook, browsing history, call logs, and SMSs, the system achieves 95% success (authenticates legitimate users) and is compromised in 5.5% cases (authenticates impostors). While this level of security is obviously inadequate for serious authentication systems, certain practices such as password sharing can immediately be thwarted from the dynamic nature of passwords. With security improvements in the future, activity-based authentication could fill in for the inadequacies in today's password-based systems.",
  "tags": [
    "activity-based password",
    "outliers",
    "dynamic authentication",
    "password sharing"
  ],
  "authors": [
    {
      "name": "Sourav Kumar Dandapat",
      "institution": "IIT Kharagpur, Kharagpur, West Bengal, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467649617",
      "orcid": "missing"
    },
    {
      "name": "Swadhin Pradhan",
      "institution": "University of Texas at Austin, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659180426",
      "orcid": "missing"
    },
    {
      "name": "Bivas Mitra",
      "institution": "Indian Institute of Technology, Kharapgpur, West Bengal, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335495075",
      "orcid": "missing"
    },
    {
      "name": "Romit Roy Choudhury",
      "institution": "University of Illinois at Urbana-Champaign, Urbana-Champaign, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100078034",
      "orcid": "missing"
    },
    {
      "name": "Niloy Ganguly",
      "institution": "IIT Kharagpur, Kharagpur, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100305563",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akhilomen, J. Data Mining Application for Cyber Credit-card Fraud Detection System. In ICDM (2013), 218--228.  ",
      "doi": "10.1007/978-3-642-39736-3_17"
    },
    {
      "text": "Blonder, G. E. Graphical Password, U.S. Patent 5559961. http://www.freepatentsonline.com/5559961.html, Sept. 1996.",
      "doi": ""
    },
    {
      "text": "Bonneau, J., Herley, C., Oorschot, P. C. v., and Stajano, F. The Quest to Replace Passwords: A Framework for Comparative Evaluation of Web Authentication Schemes. In IEEE S & P (2012), 553--567.  ",
      "doi": "10.1109/SP.2012.44"
    },
    {
      "text": "Chibelushi, C., Deravi, F., and Mason, J. A Review of Speech-Based Bimodal Recognition. IEEE Transactions on Multimedia 4, 1 (2002), 23--37.  ",
      "doi": "10.1109/6046.985551"
    },
    {
      "text": "Darwish, A. A., Zaki, W. M., Saad, O. M., Nassar, N. M., and Schaefer, G. Human Authentication Using Face and Fingerprint Biometrics. In CICSyN (2010), 274--278.  ",
      "doi": "10.1109/CICSyN.2010.40"
    },
    {
      "text": "Das, S., Hayashi, E., and Hong, J. I. Exploring Capturable Everyday Memory for Autobiographical Authentication. In UbiComp (2013), 211--220.  ",
      "doi": "10.1145/2493432.2493453"
    },
    {
      "text": "de Vel, O., Anderson, A., Corney, M., and Mohay, G. Mining e-Mail Content for Author Identification Forensics. SIGMOD Rec. 30, 4 (2001), 55--64.  ",
      "doi": "10.1145/604264.604272"
    },
    {
      "text": "Denning, D. E., and MacDoran, P. F. Internet besieged. ACM Press/Addison-Wesley Publishing Co., 1998, ch. Location-Based Authentication: Grounding Cyberspace for Better Security, 167--174. ",
      "doi": "10.5555/275737.275749"
    },
    {
      "text": "Gafurov, D., Helkala, K., and Sondrol, T. Biometric Gait Authentication Using Accelerometer Sensor. JCP 1, 7 (2006), 51--59.",
      "doi": ""
    },
    {
      "text": "Granger, E., Khreich, W., Sabourin, R., and Gorodnichy, D. O. Fusion of Biometric Systems Using Boolean Combination: An Application to Iris-Based Authentication. Int. J. Biometrics 4, 3 (2012), 291--315.  ",
      "doi": "10.1504/IJBM.2012.047645"
    },
    {
      "text": "Guha, S., Jain, M., and Padmanabhan, V. Koi: A Location-Privacy Platform for Smartphone Apps. In NSDI (2012), 183--196. ",
      "doi": "10.5555/2228298.2228317"
    },
    {
      "text": "Gupta, P., Wee, T. K., Ramasubbu, N., Lo, D., Gao, D., and Balan, R. HuMan: Creating Memorable Fingerprints of Mobile Users. In PerCom (2012), 479--482.",
      "doi": ""
    },
    {
      "text": "Khan, M. K., Zhang, J., and Wang, X. Chaotic Hash-Based Fingerprint Biometric Remote User Authentication Scheme on Mobile Devices. Chaos, Solitons & Fractals 35, 3 (2008), 519--524.",
      "doi": ""
    },
    {
      "text": "Mandujano, S., and Soto, R. Deterring Password Sharing: User Authentication via Fuzzy C-Means Clustering Applied to Keystroke Biometric Data. In ENC (2004), 181--187. ",
      "doi": "10.5555/1025121.1025743"
    },
    {
      "text": "McCool, C., et al. Bi-Modal Person Recognition on a Mobile Phone: Using Mobile Phone Data. In ICMEW (2012), 635--640.  ",
      "doi": "10.1109/ICMEW.2012.116"
    },
    {
      "text": "Nosseir, A., Connor, R., Revie, C., and Terzis, S. Question-Based Authentication Using Context Data. In NordiCHI (2006), 429--432.  ",
      "doi": "10.1145/1182475.1182529"
    },
    {
      "text": "Peacock, A., Ke, X., and Wilkerson, M. Typing Patterns: A Key to User Identification. IEEE S & P 2, 5 (2004), 40--47.  ",
      "doi": "10.1109/MSP.2004.89"
    },
    {
      "text": "Yampolskiy, R. Human Computer Interaction Based Intrusion Detection. In ITNG (2007), 837--842.  ",
      "doi": "10.1109/ITNG.2007.101"
    },
    {
      "text": "Zorkadis, V., and Donos, P. On biometrics-Based Authentication and Identification from a Privacy-Protection Perspective: Deriving Privacy-Enhancing Requirements. Inf. Manag. Comput. Security 12, 1 (2004), 125--137.",
      "doi": ""
    }
  ]
}