{
  "doi": "10.1145/2702123.2702417",
  "title": "Understanding the Role of Community in Online Dating",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "535-544",
  "year": 2015,
  "badges": [],
  "abstract": "Online dating sites have become a common means of finding a romantic partner. And yet, these sites differ greatly from many other socially oriented websites: perhaps most notably, the pairwise style of interaction afforded by these sites prevents a robust online community from forming. Users, however, have taken matters into their own hands by creating thriving external forums for discussion of specific dating sites. We report on a multiple methods study of two online dating services, via observation and interviews with users of the forums associated with these sites. Our findings suggest that these forums play an essential role in creating an \"outsourced community\" for the dating sites, and also reveal practices around how some users \"game the system\" in online dating, the prevalence of harassment in online dating, and users' frustrations with current dating sites. We conclude with a number of recommendations for system design.",
  "tags": [
    "social computing",
    "legitimate peripheral participation",
    "online communities",
    "online dating"
  ],
  "authors": [
    {
      "name": "Christina Masden",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959148157",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Best of Tinder -- /r/Tinder. 14 Sept 2014. https://reddit.com/r/tinder.",
      "doi": ""
    },
    {
      "text": "Georgia Institute of Technology. 22 Sept 2014. http://www.news.gatech.edu/2014/02/17/couplet-love-story.",
      "doi": ""
    },
    {
      "text": "OkCupid on Reddit -- /r/OkCupid. 14. Sept 2014. Available from: https://reddit.com/r/okcupid.",
      "doi": ""
    },
    {
      "text": "Terms | OkCupid. 12. Sept 2014. http://www.okcupid.com/legal/terms.",
      "doi": ""
    },
    {
      "text": "The Tinder-O-Matic. Sink Hacks. 22 Sept 2014. http://sinkhacks.com/tinder-o-matic/.",
      "doi": ""
    },
    {
      "text": "Usenet Personals: Advice for Straights FAQ (1/3. 14 Sept 2014. http://www.faqs.org/faqs/personals/straightfaq/part1",
      "doi": ""
    },
    {
      "text": "Bardzell, S. and J. Bardzell. Towards a Feminist HCI Methodology: Social science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 201 ACM.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Bernard, H.H.R. et. al, Analyzing Qualitative Data: Systematic Approaches. 2009: SAGE publications.",
      "doi": ""
    },
    {
      "text": "Biel, J. and D. Gatica-Perez, The Youtube Lens: Crowdsourced Personality Impressions and Audiovisual Analysis of Vlogs. Multimedia, IEEE Transactions on, 2013. 15(1): p. 41--55.  ",
      "doi": "10.1109/TMM.2012.2225032"
    },
    {
      "text": "Bruckman, A., et al. Managing Deviant Behavior in Online Communities. In CHI'06 Extended Abstracts on Human Factors in Computing Systems. 2006. ACM.  ",
      "doi": "10.1145/1125451.1125458"
    },
    {
      "text": "Bryant, S.L. et al. Becoming Wikipedian: Transformation of Participation in a Collaborative Online Encyclopedia. In Proceedings of the 2005 international ACM SIGGROUP conference on Supporting group work. 2005. ACM  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Collins, S.A., C. Missing, Vocal and Visual Attractiveness are Related in Women. Animal behaviour, 2003. 65(5): p. 997--1004.",
      "doi": ""
    },
    {
      "text": "DeSanctis, G., et al., Learning in Online Forums. European Management Journal, 2003. 21(5): p. 565--577.",
      "doi": ""
    },
    {
      "text": "Dimond, J.P., et al. Hollaback!: The Role of Storytelling Online in a Social Movement Organization. CSCW 2013. ACM.  ",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Ellison, N.B., Social Network Sites: Definition, History, and Scholarship. Journal of Computer-Mediated Communication, 2007. 13(1): p. 210--230.",
      "doi": ""
    },
    {
      "text": "Finkel, E.J., et al., Online Dating A Critical Analysis From the Perspective of Psychological Science. Psychological Science in the Public Interest, 2012. 13(1): p. 3--66.",
      "doi": ""
    },
    {
      "text": "Fiore, A.T. et al., Online Personals: An Overview. In CHI'04 Extended Abstracts on Human Factors in Computing Systems. 2004. ACM.  ",
      "doi": "10.1145/985921.986073"
    },
    {
      "text": "Fiore, A.T. , J.S. Donath. Homophily in Online Dating: When Do You Like Someone Like Yourself? In CHI'05 Extended Abstracts on Human Factors in Computing Systems. 2005. ACM.  ",
      "doi": "10.1145/1056808.1056919"
    },
    {
      "text": "Fiore, A.T., et al. Assessing Attractiveness in Online Dating Profiles. CHI 2008. ACM.  ",
      "doi": "10.1145/1357054.1357181"
    },
    {
      "text": "Frost, J.H., et al., People are Experience Goods: Improving Online Dating with Virtual Dates. Journal of Interactive Marketing, 2008. 22(1): p. 51--61.",
      "doi": ""
    },
    {
      "text": "Goffman, E., The Presentation of Self in Everyday Life. 1959.",
      "doi": ""
    },
    {
      "text": "Golbeck, J., C. Robles, and K. Turner. Predicting Personality with Social Media. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. 2011. ACM.  ",
      "doi": "10.1145/1979742.1979614"
    },
    {
      "text": "Hall, J.A., et al., Strategic misrepresentation in online dating: The effects of gender, self-monitoring, and personality traits. Journal of Social and Personal Relationships, 2010. 27(1): p. 117--135.",
      "doi": ""
    },
    {
      "text": "Hancock, J.T., C. Toma, and N. Ellison. The Truth About Lying in Online Dating Profiles. CHI 2007. ACM.  ",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Hancock, J.T. and C.L. Toma, Putting Your Best Face Forward: The Accuracy of Online Dating Photographs. Journal of Communication, 2009. 59(2): p. 367--386.",
      "doi": ""
    },
    {
      "text": "Hitsch, G.J. et al. What Makes You Click-Mate Preferences in Online Dating. Quantitative Marketing and Economics, 2010. 8(4): p. 393--427.",
      "doi": ""
    },
    {
      "text": "Irani, L.C. and M. Silberman. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. CHI 2013. ACM.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Jones, Q., Virtual-Communities, Virtual Settlements & Cyber-Archaeology: A Theoretical Outline. Journal of Computer-Mediated Communication, 1997. 3(3).",
      "doi": ""
    },
    {
      "text": "Kosinski, M., D. Stillwell, and T. Graepel, Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences, 2013. 110(15): p. 5802--5805.",
      "doi": ""
    },
    {
      "text": "Lampe, C. and E. Johnston. Follow the (Slash) dot: Effects of Feedback on New Members in an Online Community. SIGGROUP 2005. ACM.  ",
      "doi": "10.1145/1099203.1099206"
    },
    {
      "text": "Lauterbach, D., et al. Surfing a Web of Trust: Reputation and Reciprocity on Couchsurfing.com. CSE'09. IEEE.  ",
      "doi": "10.1109/CSE.2009.345"
    },
    {
      "text": "Lave, J. and E. Wenger, Situated Learning: Legitimate Peripheral Participation. 1991: Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Lee, A.Y. and A.S. Bruckman. Judging You by the Company You Keep: Dating on Social Networking Sites. CSCW 2007. ACM.  ",
      "doi": "10.1145/1316624.1316680"
    },
    {
      "text": "Masden, C.A., et al. Tensions in Scaling-up Community Social Media: A Multi-Neighborhood Study of Nextdoor. CHI 2014. ACM.  ",
      "doi": "10.1145/2556288.2557319"
    },
    {
      "text": "Oldenburg, R., The Great Good Place: Cafes, Coffee Shops, Bookstores, Bars, Hair Salons, and Other Hangouts at the Heart of a Community. 1999: Marlowe New York.",
      "doi": ""
    },
    {
      "text": "PRWeb. Dating Services in the US Industry Market Research Report from IBISWorld Has Been Updated. 2013 16 Mar. 2013; Available from: http://www.prweb.com/releases/2013/3/prweb10537905.htm.",
      "doi": ""
    },
    {
      "text": "Putnam, R.D., The Strange Disappearance of Civic America. American Prospect, 1996: p. 34--49.",
      "doi": ""
    },
    {
      "text": "Rosen, L.D., et al., The Impact of Emotionality and Self-Disclosure on Online Dating Versus Traditional Dating. Computers in Human Behavior, 2008. 24(5): p. 2124--2154.  ",
      "doi": "10.1016/j.chb.2007.10.003"
    },
    {
      "text": "Rudder, C., Dataclysm: Who We Are (When We Think No One's Looking). 2014: Random House LLC. ",
      "doi": "10.5555/2677103"
    },
    {
      "text": "Skopek, J. et al. Who Contacts Whom? Educational Homophily in Online Mate Selection. European Sociological Review, 2010: p. jcp068",
      "doi": ""
    },
    {
      "text": "Smith, A., M. Duggan. Online Dating & Relationships. Pew Internet & American Life Project, 2013.",
      "doi": ""
    },
    {
      "text": "Toma, C.L. et al., Separating Fact From Fiction: An Examination of Deceptive Self-Presentation in Online Dating Profiles. Personality and Social Psychology Bulletin, 2008. 34(8): p. 1023--1036",
      "doi": ""
    },
    {
      "text": "Yee, N., et al. Introverted Elves & Conscientious Gnomes: The Expression of Personality in World of Warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2011. ACM.  ",
      "doi": "10.1145/1978942.1979052"
    },
    {
      "text": "Zytko, D. et al., Impression Management Through Communication in Online Dating. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work and Social Computing. 2014. ACM.  ",
      "doi": "10.1145/2556420.2556487"
    }
  ]
}