{
  "doi": "10.1145/2702123.2702395",
  "title": "Piggyback Prototyping: Using Existing, Large-Scale Social Computing Systems to Prototype New Ones",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4047-4056",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We propose a technique we call piggyback prototyping, a prototyping mechanism for designing new social computing systems on top of existing ones. Traditional HCI prototyping techniques do not translate well to large social computing systems. To address this gap, we describe a 6-stage process for prototyping new social computing systems using existing online systems, such as Twitter or Facebook. This allows researchers to focus on what people do on their system rather than how to attract people to it. We illustrate this technique with an instantiation on Twitter to pair people who are different from each other in airports. Even though there were many missed meetings, 53% of survey respondents would be interested in being matched again, and eight people even met in person. Through piggyback prototyping, we gained insight into the future design of this system. We conclude the paper with considerations for privacy, consent, volume of users, and evaluation metrics.",
  "authors": [
    {
      "name": "Catherine Grevet",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650719",
      "orcid": "missing"
    },
    {
      "name": "Eric Gilbert",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489255",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beaudouin-Lafon, M. and Mackay, W. Prototyping Tools and Techniques. The Human-Computer Interaction Handbook. 2002. p. 1006--1031. ",
      "doi": "10.5555/772072.772136"
    },
    {
      "text": "Biernacki, P. and Waldorf, D. Snowball Sampling: Problems and Techniques of Chain Referral Sampling. Sociological Methods & Research. 1981.10(2):141--163.",
      "doi": ""
    },
    {
      "text": "Cramer, H., Rost, M. and Holmquist, L.E. Performing a check-in: emerging practices, norms and 'conflicts' in location-sharing using foursquare. MobileHCI. 2011. p. 57--66.  ",
      "doi": "10.1145/2037373.2037384"
    },
    {
      "text": "DeChoudhury, M. Tie formation on Twitter: Homophily and structure of egocentric networks. SocialCom: IEEE Conf. on Social Computing. 2011.",
      "doi": ""
    },
    {
      "text": "Doris-Down, A., Versee, H. and Gilbert, E. Political blend: an application designed to bring people together based on political differences. Communities and Technologies. 2013. p. 120--130.  ",
      "doi": "10.1145/2482991.2483002"
    },
    {
      "text": "Foner, L. and Crabtree, I. Multi-Agent Matchmaking. Software Agents and Soft Computing: Towards Enhancing Machine intelligence, Concepts and Applications. 1997. p. 100--115. ",
      "doi": "10.5555/646107.679104"
    },
    {
      "text": "Gaver, B., Dunne, T. and Pacenti, E. Design: Cultural probes. Interactions. 1999. 6(1): p. 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Gilbert, E. Designing social translucence over social networks. CHI. 2012. p. 2731--2740.  ",
      "doi": "10.1145/2207676.2208670"
    },
    {
      "text": "Greenberg, S. and Roseman, M. Groupware Toolkits for Synchronous Work. Computer-Supported Cooperative Work: Trends in Software 7. 1999.",
      "doi": ""
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: eight challenges for developers. Communications of the ACM. 1994. 37(1): p. 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Guy, I., Jacovi, M., Perer, A., Ronen, I., Uziel, E. Same places, same things, same people? mining user similarity on social media. CSCW. 2010. p. 41--50.  ",
      "doi": "10.1145/1718918.1718928"
    },
    {
      "text": "Hancock, J.T., Toma, C.L. and Fenner, K. I Know Something You Don't: The Use of Asymmetric Personal Information for Interpersonal Advantage. CSCW. 2008. p. 413--416.  ",
      "doi": "10.1145/1460563.1460629"
    },
    {
      "text": "Houde, S. and Hill, C. What do Prototypes Prototype? Handbook of Human-Computer Interaction Second Edition. 1997. p. 367--380.",
      "doi": ""
    },
    {
      "text": "Iachello, G., Truong, K.N., Abowd, G.D., Hayes, G.R., Stevens, M. Prototyping and sampling experience to evaluate ubiquitous computing privacy in the real world. CHI. 2006. p. 1009--1018.  ",
      "doi": "10.1145/1124772.1124923"
    },
    {
      "text": "Irani, L. and Silberman, S. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. CHI. 2013. p. 611--620.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Lim, Y-K., Stolterman, E. and Tenenberg, J. The Anatomy of Prototypes: Prototypes as Filters, Prototypes as Manifestations of Design Ideas. ACM Trans. on Computer-Human Interaction. 2008. 15(2).  ",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Lindqvist, J., Cranshaw, J., Wiese, J., Hong, J., Zimmerman, J. I'm the mayor of my house: examining why people use foursquare - a social-driven location sharing application. CHI. 2011. p. 2409--2418  ",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "McDonald, D., Gokhman, S. and Zachry, M. Building for social translucence: a domain analysis and prototype system. CSCW. 2012. p. 637--646.  ",
      "doi": "10.1145/2145204.2145301"
    },
    {
      "text": "Milgram, S., in The Familiar Stranger: An Aspect of Urban Anonymity. 1972.",
      "doi": ""
    },
    {
      "text": "Munson, S. and Resnick, P. Presenting Diverse Political Opinions: How and How Much. CHI. 2010. p. 14571466.  ",
      "doi": "10.1145/1753326.1753543"
    },
    {
      "text": "Nichols, J. and Kang, J-H. Asking questions of targeted strangers on social networks. CSCW. 2012. p. 999--1002  ",
      "doi": "10.1145/2145204.2145352"
    },
    {
      "text": "Rettig, M. Prototyping for tiny fingers. Communications of the ACM. 1994. p. 21--27.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Smith, J., McPherson, M. and Smith-Lovin, L. Social Distance in the USA: Sex, Race, Religion, Age, and Education Homophily among Confidants, 1985 to 2004. Annual Review of Sociology. 2014. p. 432--456.",
      "doi": ""
    },
    {
      "text": "Tang, K.P., Lin, J., Hong, J., Siewiorek, D. and Sadeh, N. Rethinking location sharing: exploring the implications of social-driven vs. purpose-driven location sharing. Ubicomp. 2010. p. 85--94.  ",
      "doi": "10.1145/1864349.1864363"
    },
    {
      "text": "Terveen, L. and McDonald, D.W. Social matching: A framework and research agenda. ACM Trans. Computer-Human Interaction. 2005. p. 401--434.  ",
      "doi": "10.1145/1096737.1096740"
    }
  ]
}