{
  "doi": "10.1145/2702123.2702556",
  "title": "\"I always assumed that I wasn't really that close to [her]\": Reasoning about Invisible Algorithms in News Feeds",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "153-162",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Our daily digital life is full of algorithmically selected content such as social media feeds, recommendations and personalized search results. These algorithms have great power to shape users' experiences, yet users are often unaware of their presence. Whether it is useful to give users insight into these algorithms' existence or functionality and how such insight might affect their experience are open questions. To address them, we conducted a user study with 40 Facebook users to examine their perceptions of the Facebook News Feed curation algorithm. Surprisingly, more than half of the participants (62.5%) were not aware of the News Feed curation algorithm's existence at all. Initial reactions for these previously unaware participants were surprise and anger. We developed a system, FeedVis, to reveal the difference between the algorithmically curated and an unadulterated News Feed to users, and used it to study how users perceive this difference. Participants were most upset when close friends and family were not shown in their feeds. We also found participants often attributed missing stories to their friends' decisions to exclude them rather than to Facebook News Feed algorithm. By the end of the study, however, participants were mostly satisfied with the content on their feeds. Following up with participants two to six months after the study, we found that for most, satisfaction levels remained similar before and after becoming aware of the algorithm's presence, however, algorithmic awareness led to more active engagement with Facebook and bolstered overall feelings of control on the site.",
  "tags": [
    "hidden processes",
    "algorithms",
    "news feeds",
    "algorithm awareness"
  ],
  "authors": [
    {
      "name": "Motahhare Eslami",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959132657",
      "orcid": "0000-0002-1499-3045"
    },
    {
      "name": "Aimee Rickman",
      "institution": "California State University, Fresno, Fresno, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699050",
      "orcid": "missing"
    },
    {
      "name": "Kristen Vaccaro",
      "institution": "University of Illinois, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699068",
      "orcid": "0000-0002-9843-942X"
    },
    {
      "name": "Amirhossein Aleyasen",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959114957",
      "orcid": "missing"
    },
    {
      "name": "Andy Vuong",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700039",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    },
    {
      "name": "Kevin Hamilton",
      "institution": "University of Illinois, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488642",
      "orcid": "missing"
    },
    {
      "name": "Christian Sandvig",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100067260",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Backstrom, L. News Feed FYI: A Window Into News Feed. http://on.fb.me/1kz3Yak.",
      "doi": ""
    },
    {
      "text": "Barocas, S., Hood, S., and Ziewitz, M. Governing algorithms: A provocation piece. In Governing Algorithms: A Conference on Computation, Automation, and Control. (2013).",
      "doi": ""
    },
    {
      "text": "Bennett, S. Social Media 2013: User Demographics For Facebook, Twitter, Pinterest And Instagram. http://bit.ly/1j6g12u.",
      "doi": ""
    },
    {
      "text": "Bernstein, M. S., Bakshy, E., Burke, M., and Karrer, B. Quantifying the invisible audience in social networks. In Proc. CHI 2013, ACM Press (2013), 21--30.  ",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Bilton, N. Facebook News Feed Draws More Criticism. The New York Times.",
      "doi": ""
    },
    {
      "text": "Brembs, B., Button, K., and Munaf, M. Deep impact: Unintended consequences of journal rank. Frontiers in Human Neuroscience 7, 291 (2013).",
      "doi": ""
    },
    {
      "text": "Collins, A., and Centner, D. How people construct mental models1. Cultural models in language and thought (1987), 243.",
      "doi": ""
    },
    {
      "text": "Diakopoulos, N. Sex, violence, and autocomplete algorithms, August 2013. http://slate.me/1hMomGN.",
      "doi": ""
    },
    {
      "text": "Diakopoulos, N. Algorithmic Accountability Reporting: On the Investigation of Black Boxes. Tow Center for Digital Journalism (2014).",
      "doi": ""
    },
    {
      "text": "DigitalShadow. http://digitalshadow.com/.",
      "doi": ""
    },
    {
      "text": "Facebook Developers. https://developers.facebook. com/bugs/576745515760299/.",
      "doi": ""
    },
    {
      "text": "Facebook newsroom, Company Info. http://newsroom.fb.com/company-info/.",
      "doi": ""
    },
    {
      "text": "Floodwatch. https://floodwatch.o-c-r.org/.",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Boucher, A., Pennington, S., and Walker, B. Cultural probes and the value of uncertainty. Interactions 11, 5 (2004), 53--56.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Gilbert, E. Computing Tie Strength. UIUC PhD dissertation (2010). ",
      "doi": "10.5555/2231228"
    },
    {
      "text": "Gilbreth, F. B., and Kent, R. T. Motion study, a method for increasing the efficiency of the workman. New York, D. Van Nostrand Company, 1911.",
      "doi": ""
    },
    {
      "text": "Gillespie, T. Can an Algorithm Be Wrong? http://limn.it/can-an-algorithm-be-wrong/.",
      "doi": ""
    },
    {
      "text": "Granka, L. A. The Politics of Search: A Decade Retrospective. The Information Society 26, 5 (2010), 364--374.  ",
      "doi": "10.1080/01972243.2010.511560"
    },
    {
      "text": "Hamilton, K., Karahalios, K., Sandvig, C., and Eslami, M. A path to understanding the effects of algorithm awareness. In Proc. CHI EA 2014, ACM Press (2014), 631--642.  ",
      "doi": "10.1145/2559206.2578883"
    },
    {
      "text": "Introna, L., and Nissenbaum, H. Shaping the Web: Why the Politics of Search Engines Matters. The Information Society 16, 3 (2000), 1--17.",
      "doi": ""
    },
    {
      "text": "Kempton, W. Two Theories of Home Heat Control. Cognitive Science 10, 1 (1986), 75--90.",
      "doi": ""
    },
    {
      "text": "Kramer, A., Guillory, J. E., and Hancock, J. T. Experimental evidence of massive-scale emotional contagion through social networks. Proceedings of the National Academy of Sciences 111, 24 (2013).",
      "doi": ""
    },
    {
      "text": "Litt, E. Knock, knock. Who's there? The imagined audience. Journal of Broadcasting and Electronic Media 56, 3 (2012), 330--345.",
      "doi": ""
    },
    {
      "text": "Lynch, K. The Image of the City. MIT Press: Cambridge, 1960.",
      "doi": ""
    },
    {
      "text": "McGee, M. EdgeRank Is Dead: Facebook's News Feed Algorithm Now Has Close To 100K Weight Factors. http://goo.gl/X4yOja.",
      "doi": ""
    },
    {
      "text": "ProPublica Message Machine. http://projects.propublica.org/emails/.",
      "doi": ""
    },
    {
      "text": "Morris, M. R. Social networking site use by mothers of young children. In Proc. CSCW 2014, ACM Press (2014), 1272--1282.  ",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "Facebook Inc. How does News Feed decide which stories to show? https://www.facebook.com/help/166738576721085.",
      "doi": ""
    },
    {
      "text": "Facebook Inc. What is News Feed? https://www.facebook.com/help/210346402339221.",
      "doi": ""
    },
    {
      "text": "Norman, D. The Psychology of Everyday Things. Basic Books: New York, 1988.",
      "doi": ""
    },
    {
      "text": "Nvivo Tool. http://www.qsrinternational.com.",
      "doi": ""
    },
    {
      "text": "Pasquale, F. Restoring Transparency to Automated Authority. Journal on Telecommunications and High Technology Law 9, 235 (2011).",
      "doi": ""
    },
    {
      "text": "Pegoraro, R. Facebook News Feed filtering can make friends vanish. The Washington Post.",
      "doi": ""
    },
    {
      "text": "Pieters, W. Explanation and trust: what to tell the user in security and ai? Ethics and information technology 13, 1 (2011), 53--64.  ",
      "doi": "10.1007/s10676-010-9253-3"
    },
    {
      "text": "Sandvig, C., Hamilton, K., Karahalios, K., and Langbort, C. Re-centering algorithms. In Governing Algorithms: A Conference on Computation, Automation, and Control. (2013).",
      "doi": ""
    },
    {
      "text": "Sandvig, C., Hamilton, K., Karahalios, K., and Langbort, C. Auditing algorithms: Research methods for detecting discrimination on internet platforms. In Data and Discrimination: Converting Critical Concerns into Productive Inquiry (2014).",
      "doi": ""
    },
    {
      "text": "Sanghvi, R. Facebook Gets a Facelift. http://on.fb.me/1gd7z1I.",
      "doi": ""
    },
    {
      "text": "Smith, C. 7 Statistics About Facebook Users That Reveal Why It's Such A Powerful Marketing Platform. http://read.bi/194eLre.",
      "doi": ""
    },
    {
      "text": "Steiner, C. Automate This: How Algorithms Came to Rule Our World. Portfolio: New York (2012).",
      "doi": ""
    },
    {
      "text": "Discrimination in online ad delivery. Communications of the Association of Computing Machinery (January 2013).  ",
      "doi": "10.1145/2447976.2447990"
    },
    {
      "text": "danah boyd: The kids are all right. http://www.pbs.org/wgbh/pages/frontline/media/generationlike/danah-boyd-the-kids-are-all-right/.",
      "doi": ""
    },
    {
      "text": "Valentino-Devries, J., Singer-Vine, J., and Soltani, A. Websites vary prices, deals based on users' information. Wall Street Journal (December 2012).",
      "doi": ""
    }
  ]
}