{
  "doi": "10.1145/2702123.2702220",
  "title": "Trap it!: A Playful Human-Biology Interaction for a Museum Installation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2593-2602",
  "year": 2015,
  "badges": [],
  "abstract": "We developed Trap it!, a human-biology interaction (HBI) medium encompassing a touchscreen interface, microscopy, and light projection. Users can interact with living cells by drawing on a touchscreen displaying the microscope view of the cells. These drawings are projected onto the microscopy field as light patterns, prompting observable movement in phototactic responses. The system design enables stable and robust HBI and a wide variety of programmed activities (art, games, and experiments). We investigated its affordances as an exhibit in a science museum in both facilitated and unfacilitated contexts. Overall, it had a low barrier of entry and fostered rich communication among visitors. Visitors were particularly excited upon realizing that the interaction involved real organisms, an understanding that was facilitated by the eyepiece on the physical system. With the results from user study, we provide our observations, insights and guidelines for designing HBI as a permanent museum exhibit.",
  "tags": [
    "biotic processing unit",
    "interactive biology",
    "biotic game",
    "human-biology interaction",
    "tangible interactive microbiology",
    "interactive microscope"
  ],
  "authors": [
    {
      "name": "Seung Ah Lee",
      "institution": "Stanford University, Stanford, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658686149",
      "orcid": "missing"
    },
    {
      "name": "Engin Bumbacher",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549143256",
      "orcid": "missing"
    },
    {
      "name": "Alice M. Chung",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658685504",
      "orcid": "missing"
    },
    {
      "name": "Nate Cira",
      "institution": "Stanford, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658681111",
      "orcid": "missing"
    },
    {
      "name": "Byron Walker",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702978",
      "orcid": "missing"
    },
    {
      "name": "Ji Young Park",
      "institution": "Stanford University, Stanford, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702132",
      "orcid": "missing"
    },
    {
      "name": "Barry Starr",
      "institution": "Stanford University, Stanford, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705218",
      "orcid": "missing"
    },
    {
      "name": "Paulo Blikstein",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81314487929/rel-imgonly/paulo_blikstein-9_2.jpg",
      "acmid": "81314487929",
      "orcid": "missing"
    },
    {
      "name": "Ingmar H. Riedel-Kruse",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658678707",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alberts, B., Prioritizing Science Education. Science 328, 5977 (2010), 405.",
      "doi": ""
    },
    {
      "text": "Barsanti, L., Evangelista, V., Passarelli, V., Frassanito, A.M., and Gualtieri, P., Fundamental questions and concepts about photoreception and the case of Euglena gracilis. Integrative Biology 4, 1 (2012), 22--36.",
      "doi": ""
    },
    {
      "text": "Bilda, Z., Edmonds, E., and Candy, L., Designing for creative engagement. Design Studies 29, 6 (2008), 525--540.",
      "doi": ""
    },
    {
      "text": "Blikstein, P. Gears of our childhood: constructionist toolkits, robotics, and physical computing, past and future. In Proc. IDC 2013, ACM Press (2013), 173--182.  ",
      "doi": "10.1145/2485760.2485786"
    },
    {
      "text": "Block, F., Horn, M.S., Phillips, B.C., Diamond, J., Evans, E.M., and Chia, S., The DeepTree Exhibit: Visualizing the Tree of Life to Facilitate Informal Learning. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2789--2798.  ",
      "doi": "10.1109/TVCG.2012.272"
    },
    {
      "text": "Boisvert, D.L. and Slez, B.J., The relationship between exhibit characteristics and learning-associated behaviors - 10 in a science museum discovery space. Science Education 79, 5 (1995), 503--518.",
      "doi": ""
    },
    {
      "text": "Brody, M., Bangert, A., and Dillon, J., Assessing learning in informal science contexts. Commissioned Paper by the National Research Council for Science Learning in Informal Environments Committee, (2009).",
      "doi": ""
    },
    {
      "text": "Cheok, A.D., Kok, R.T., Tan, C., Fernando, O.N.N., Merritt, T., and Sen, J.Y.P. Empathetic living media. In Proc. DIS 2008, ACM Press (2008), 465--473.  ",
      "doi": "10.1145/1394445.1394495"
    },
    {
      "text": "Chua, K.C., Qin, Y., Block, F., Phillips, B., Diamond, J., Evans, E.M., Horn, M.S., and Shen, C. FloTree: a multi-touch interactive simulation of evolutionary processes. In Proc. ITS 2012, ACM Press (2012), 299--302.  ",
      "doi": "10.1145/2396636.2396684"
    },
    {
      "text": "Frederickson, R.M., Fluidigm. Biochips get indoor plumbing. Chemistry & biology 9, 11 (2002), 1161.",
      "doi": ""
    },
    {
      "text": "Hamidi, F. and Baljko, M. Rafigh: a living media interface for speech intervention. In Proc. CHI 2014, ACM Press (2014), 1817--1820.  ",
      "doi": "10.1145/2556288.2557402"
    },
    {
      "text": "Harvey, H., Havard, M., Magnus, D., Cho, M., & Riedel-Kruse, I. , Innocent fun or microslavery? : Public Responses to and Ethical Analysis of Biotic Games. Hasting Center Report, (2014), 1--28.",
      "doi": ""
    },
    {
      "text": "Heath, C., Lehn, D.V., and Osborne, J., Interaction and interactives: collaboration and participation with computer-based exhibits. Public Understanding of Science 14, 1 (2005), 91--101.",
      "doi": ""
    },
    {
      "text": "Hertz, G., Cockroach controlled mobile robot. Garnet Hertz-Http://conceptlabcom, (2008).",
      "doi": ""
    },
    {
      "text": "Hinrichs, U., Schmidt, H., and Carpendale, S., EMDialog: Bringing Information Visualization into the Museum. IEEE Transactions on Visualization and Computer Graphics 14, 6 (2008), 1181--1188.  ",
      "doi": "10.1109/TVCG.2008.127"
    },
    {
      "text": "Horn, M., Leong, Z.A., Block, F., Diamond, J., Evans, E.M., Phillips, B., and Shen, C. Of BATs and APEs: an interactive tabletop game for natural history museums. In Proc. CHI 2012, ACM Press (2012), 2059--2068.  ",
      "doi": "10.1145/2207676.2208355"
    },
    {
      "text": "Horn, M.S., Solovey, E.T., Crouser, R.J., and Jacob, R.J.K. Comparing the use of tangible and graphical programming languages for informal science education. In Proc. CHI 2009, ACM Press (2009), 975--984.  ",
      "doi": "10.1145/1518701.1518851"
    },
    {
      "text": "Hornecker, E. and Stifter, M. Learning from interactive museum installations about interaction design for public settings. In Proc. OzCHI 2006, ACM Press (2006), 135--142.  ",
      "doi": "10.1145/1228175.1228201"
    },
    {
      "text": "Karsenty, T. and Fievez, A., The iPad in education: uses, benefits, and challenges. (2013).",
      "doi": ""
    },
    {
      "text": "Kuribayashi, S. and Wakita, A. PlantDisplay: turning houseplants into ambient display. In Proc. CHI 2006, ACM Press (2006), 40.  ",
      "doi": "10.1145/1178823.1178871"
    },
    {
      "text": "Lee, S.A., Chung, A.M., Cira, N., and Riedel-Kruse, I.H. Tangible interactive microbiology for informal science education. In Proc. TEI 2015, ACM Press (2015),  ",
      "doi": "10.1145/2677199.2680561"
    },
    {
      "text": "Littleford, R.A., Culture of Protozoa in the Classroom. The American Biology Teacher 22, 9 (1960), 551--559.",
      "doi": ""
    },
    {
      "text": "Mertens, M. and Meißner, T.O., Wir waren Space Invaders: Geschichten vom Computerspielen. Katrin Blumenkamp, 2006.",
      "doi": ""
    },
    {
      "text": "Ozasa, K., Lee, J., Song, S., Hara, M., and Maeda, M., Two-dimensional optical feedback control of Euglena confined in closed-type microfluidic channels. Lab on a Chip 11, 11 (2011), 1933--1940.",
      "doi": ""
    },
    {
      "text": "Papert, S., Mindstorms: children, computers, and powerful ideas. Basic Books, Inc., 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Ramey-Gassert, L., Walberg, H.J., and Walberg, H.J., Reexamining connections: Museums as science learning environments. Science Education 78, 4 (1994), 345--363.",
      "doi": ""
    },
    {
      "text": "Reas, C. and Fry, B., Processing: programming for the media arts. AI & SOCIETY 20, 4 (2006), 526--538.  ",
      "doi": "10.1007/s00146-006-0050-9"
    },
    {
      "text": "Rein, M.L. and Deussing, J.M., The optogenetic (r) evolution. Molecular Genetics and Genomics 287, 2 (2012), 95--109.",
      "doi": ""
    },
    {
      "text": "Riedel-Kruse, I.H., Chung, A.M., Dura, B., Hamilton, A.L., and Lee, B.C., Design, engineering and utility of biotic games. Lab on a Chip 11, 1 (2011), 14--22.",
      "doi": ""
    },
    {
      "text": "Schweingruber, H.A. and Fenichel, M., Surrounded by Science: Learning Science in Informal Environments. National Academies Press, Washington, DC, USA 2010.",
      "doi": ""
    },
    {
      "text": "Sellers, J., Arcade fever: the fan's guide to the golden age of video games. Running Press Book Publishers, 2001. ",
      "doi": "10.5555/516397"
    },
    {
      "text": "Stage, E.K., Asturias, H., Cheuk, T., Daro, P.A., and Hampton, S.B., Opportunities and Challenges in Next Generation Standards. Science 340, 6130 (2013), 276--277.",
      "doi": ""
    },
    {
      "text": "The Tech Museum of Innovation. TechTag. Available from: http://my.thetech.org/.",
      "doi": ""
    },
    {
      "text": "van Eck, W. and Lamers, M.H., Hybrid BiologicalDigital Systems in Artistic and Entertainment Computing. Leonardo 46, 2 (2013), 151--158.",
      "doi": ""
    },
    {
      "text": "Wessnitzer, J., Asthenidis, A., Petrou, G., and Webb, B. A cricket-controlled robot orienting towards a sound source. In Proc. TAROS 2011, Springer-Verlag Press (2011), 1--12. ",
      "doi": "10.5555/2035304.2035305"
    },
    {
      "text": "Whitesides, G.M., The origins and the future of microfluidics. Nature 442, 7101 (2006), 368--373.",
      "doi": ""
    },
    {
      "text": "Wolken, J.J., Euglena: The Photoreceptor System for Phototaxis*. The Journal of Protozoology 24, 4 (1977), 518--522.",
      "doi": ""
    }
  ]
}