{
  "doi": "10.1145/2702123.2702396",
  "title": "FeelSleeve: Haptic Feedback to Enhance Early Reading",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1015-1024",
  "year": 2015,
  "badges": [],
  "abstract": "Engaging children with traditional approaches in education, especially reading, grows ever more difficult in the face of their attachment to tablets and computer games. We explore the possibility of making the story reading experience more interesting and memorable for children using haptic augmentation. In this paper, we present FeelSleeve, an interface that allows children to feel story events in their hands while they are reading on a mobile device. FeelSleeve uses transducers and audio output from the tablet within a gloved attachment to create vibratory effects that are meaningfully related to story content. We describe a study investigating whether embedding such haptic feedback into stories enhances reading for six to nine year olds. Our results indicate that story events accompanied by haptic feedback are better comprehended and appear to be more salient in memory. These results provide evidence that haptic effects have the potential to improve children's reading experience and make it more memorable.",
  "tags": [
    "story listening technology",
    "haptic vocabulary",
    "vibrotactile feedback",
    "handheld technology",
    "story reading technology"
  ],
  "authors": [
    {
      "name": "Nesra Yannier",
      "institution": "Disney Research Pittsburgh & Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414604456",
      "orcid": "missing"
    },
    {
      "name": "Ali Israr",
      "institution": "Disney Research Pittsburgh, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81416593491/rel-imgonly/ali-pp-0913.jpg",
      "acmid": "81416593491",
      "orcid": "missing"
    },
    {
      "name": "Jill Fain Lehman",
      "institution": "Disney Research Pittsburgh, Pittsburgh, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659808043",
      "orcid": "missing"
    },
    {
      "name": "Roberta L. Klatzky",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100209584",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alles, D. S. Information transmission by phantom sensations. IEEE Transactions on Man-Machine Systems 11, 1 (1970), 85--91.",
      "doi": ""
    },
    {
      "text": "Back, M., Cohen, J., Gold, R., Harrison, S., & Minneman, S. Listen reader: an electronically augmented paper-based book. In Proc. CHI 2001, ACM Press (2001), 23--29.  ",
      "doi": "10.1145/365024.365031"
    },
    {
      "text": "Bau, O., Poupyrev, I., Israr, A., & Harrison, C. TeslaTouch: Electrovibration for touch surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology, ACM Press (2010), 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Békésy, G. v. Human skin perception of traveling waves similar to those on the cochlea. The Journal of the Acoustical Society of America 27, 5 (1955), 830--841.",
      "doi": ""
    },
    {
      "text": "Brewster, S., Chohan, F. and Brown, L. Tactile feedback for mobile interactions. In Proc. CHI'07, ACM Press (2007), 159--162.  ",
      "doi": "10.1145/1240624.1240649"
    },
    {
      "text": "Cholewiak, R.W., Collins A.A., The generation of vibrotactile patterns on a linear array: Influences of body site, time, and presentation mode. Perception & Psychophysics 62, 6 (2000), 1220--1235.",
      "doi": ""
    },
    {
      "text": "Englekamp, J. & Zimmer, H. D. Memory for action events: A new field of research. Psychological Research 51, 4 (1989), 153--157.",
      "doi": ""
    },
    {
      "text": "Enriquez, M., Maclean, K.E. & Chita, C. Haptic Phonemes: Basic building blocks of haptic communication. In Proc. of the 8th International Conference on Multimodal Interfaces, ACM Press (2006), 302--309.  ",
      "doi": "10.1145/1180995.1181053"
    },
    {
      "text": "Geldard, F. A. Adventures in tactile literacy. The American Psychologist 12 (1957), 115--124.",
      "doi": ""
    },
    {
      "text": "Geldard, F.A. & Sherrick, C.E. The Cutaneous \"Rabbit\": A Perceptual Illusion, Science 178 (1972), 178--179.",
      "doi": ""
    },
    {
      "text": "Heibeck, F., Hope, A. & Legault, J. Sensory Fiction MAS S65 Science Fiction to Science Fabrication (2013). Retrieved from http://scifi2scifab.media.mit.edu/ 2013/12/19/sensory-fiction/.",
      "doi": ""
    },
    {
      "text": "Israr, A., & Poupyrev, I. Tactile brush: drawing on skin with a tactile grid display. In Proc. of CHI 2011. ACM Press (2011), 2019--2028.  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Israr, A. and Poupyrev, I. Control Space of apparent haptic motion. In Proc. of World Haptics Conference, IEEE (2011), 457--462.",
      "doi": ""
    },
    {
      "text": "Israr, A., Zhao, S., Schwalje, K., Klatzky, R. L. & Lehman, J. Feel Effects: Enriching storytelling with haptic feedback. ACM Transactions on Applied Perception 11, 3 (2014), Article 11.  ",
      "doi": "10.1145/2641570"
    },
    {
      "text": "Jones, M. G., Bokinsky, A., Tretter, T., & Negishi, A. A comparison of learning with haptic and visual modalities. Haptics-e: Electronic J. Haptics Res 4, (2005).",
      "doi": ""
    },
    {
      "text": "Kirman, J.H. Tactile apparent movement: The effects of inter stimulus onset interval and stimulus duration. Perception and Psychophysics 15, 1 (1974), 1--6.",
      "doi": ""
    },
    {
      "text": "Lee, J., Kim, Y. & Kim, G. Funneling and saltation effects for tactile interaction with virtual objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), ACM Press (2012), 3141--3148.  ",
      "doi": "10.1145/2207676.2208729"
    },
    {
      "text": "Lévesque, V., Oram, L., MacLean, K., Cockburn, A., Marchuk, N.D., Johnson, D., Colgate, J.E. and Peshkin, M.A. Enhancing physicality in touch interaction with programmable friction. In Proc. CHI 2011, ACM (2011), 2481--2490.  ",
      "doi": "10.1145/1978942.1979306"
    },
    {
      "text": "Luk, J., Pasquero, J., Little, S., MacLean, K., Levesque, V. & Hayward, V. A role for haptics in mobile interaction: initial design using a handheld tactile display prototype. In Proc. of CHI 2006, ACM Press (2006), 171--180.  ",
      "doi": "10.1145/1124772.1124800"
    },
    {
      "text": "Phillips, L. The Role of Storytelling in Early Literacy Development (1999). http://www.home.aone.net.au/stories/doc/childhd.htm",
      "doi": ""
    },
    {
      "text": "Pike, M. M., Barnes, M. A., & Barron, R.W. The role of illustrations in children's inferential comprehension. Journal of Experimental Child Psychology 105, 3 (2010), 243--255.",
      "doi": ""
    },
    {
      "text": "Poupyrev, I. and Maruyama, S., Tactile Interfaces for Small Touch Screens. In Proc. of UIST 2003, ACM Press (2003), 217--220.  ",
      "doi": "10.1145/964696.964721"
    },
    {
      "text": "Rayner, K., Foorman, B.R., Perfetti, C. A., Pesetsky, D., & Seidenberg, M. S. (2001). How psychological science informs the teaching of reading. Psychological Science in the Public Interest 2, 2 (2002), 31--74.",
      "doi": ""
    },
    {
      "text": "Ricci, C. M. & Beal, C. R. The effect of interactive media on children's story memory. Journal of Educational Psychology 94, 1 (2002), 138--144.",
      "doi": ""
    },
    {
      "text": "Ryokai, K., & Cassell, J. StoryMat: a play space for collaborative storytelling. Ext. Abstracts CHI 1999, ACM Press (1999), 272--273.  ",
      "doi": "10.1145/632716.632883"
    },
    {
      "text": "Seo, J., & Choi, S. Initial study for creating linearly moving vibrotactile sensation on mobile device. In Proc. Haptics Symposium, IEEE (2010), 67--70.  ",
      "doi": "10.1109/HAPTIC.2010.5444677"
    },
    {
      "text": "Sherrick, C.E. and R. Rogers, Apparent Haptic Movement. Perception and Psychophysics 1, 3 (1966), 175--180.",
      "doi": ""
    },
    {
      "text": "Tanenbaum, J., Tanenbaum, K., & Antle, A. The Reading Glove: designing interactions for object-based tangible storytelling. In Proc.1st Augmented Human International Conference, ACM Press (2010), 19.  ",
      "doi": "10.1145/1785455.1785474"
    },
    {
      "text": "Ternes, D., & Maclean, K. E. Designing large sets of haptic icons with rhythm. In Haptics: Perception, Devices and Scenarios, Springer Berlin Heidelberg (2008), 199--208.  ",
      "doi": "10.1007/978-3-540-69057-3_24"
    },
    {
      "text": "Yang, G. H., Jin, M. S., Jin, Y. & Kang, S. T-mobile: Vibrotactile display pad spatial and directional information for hand-held device. In Proc. Intelligent Robots and Systems (IROS), IEEE (2010), 5245--5250.",
      "doi": ""
    },
    {
      "text": "Yannier, N., Basdogan, C., Tasiran, S. & Sen, O. L. Using haptics to convey cause-and-effect relations in climate visualization. IEEE Transactions on Haptics 1, 2 (2008), 130--141.  ",
      "doi": "10.1109/TOH.2008.16"
    },
    {
      "text": "Zhao, S. Feeling Stories: Enriching Story Listening Experience for Children with Haptic Feedback. Unpublished senior honors thesis, Carnegie Mellon University Dept. of Psychology (2014).",
      "doi": ""
    },
    {
      "text": "Zhou, Z., Cheok, A. D., Pan, J. & Li, Y. Magic Story Cube: An interactive tangible interface for storytelling. In Proc. of CHI 2004. ACM Press (2004). 364--365.  ",
      "doi": "10.1145/1067343.1067404"
    }
  ]
}