{
  "doi": "10.1145/2702123.2702238",
  "title": "Medium, Access, and Obsolescence: What Kinds of Objects are Lasting Objects?",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3433-3442",
  "year": 2015,
  "badges": [],
  "abstract": "This paper presents findings from a field study of records managers that provides context for understanding how people see objects on varying media as long-lasting objects (or not). Part of the mandate of the profession of records management is long-term preservation of digital and paper records. At the site of the fieldwork for this study, research participants' tasks primarily consisted of examining individual case files to determine if the files should be kept or destroyed under the relevant rules set by higher-level management according to legal requirements. Close observation of work practices showed that application of records management rules varied depending on the medium of the records, despite the policy that records on varying media are equal in importance. The results of the study suggest that the perceived accessibility and obsolescence of digital objects deserve more attention in the exploration of the place of digital objects in human lives over the long-term.",
  "authors": [
    {
      "name": "Jane Gruning",
      "institution": "The University of Texas at Austin, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658692091",
      "orcid": "missing"
    },
    {
      "name": "Julia Bullard",
      "institution": "The University of Texas at Austin, Austin, TX, USA",
      "img": "/do/10.1145/contrib-81481642958/rel-imgonly/photo-close.jpg",
      "acmid": "81481642958",
      "orcid": "missing"
    },
    {
      "name": "Melissa Ocepek",
      "institution": "The University of Texas at Austin, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82958620057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barreau, D., & Nardi, B. A. Finding and reminding: File organization from the desktop. SIGCHI Bull. 27, 3 (1995), 39--43.  ",
      "doi": "10.1145/221296.221307"
    },
    {
      "text": "Boardman, R., & Sasse, M. A. \"Stuff goes into the computer and doesn't come out\": a cross-tool study of personal information management. In Proc. SIGCHI Conference on Human Factors in Computing Systems (2004) (pp. 583--590). New York, NY, USA: ACM.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Campbell, S. M. On the absence of obsolescence. IEEE Annals of the History of Computing 31, 4 (2009), 118--120.  ",
      "doi": "10.1109/MAHC.2009.124"
    },
    {
      "text": "Dourish, P. Where the action is: The foundations of embodied interaction. MIT Press, Cambridge, MA, USA, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Duranti, L. Reliability and authenticity: The concepts and their implications. Archivaria 1, 39 (1995).",
      "doi": ""
    },
    {
      "text": "Duranti, L. Concepts and principles for the management of electronic records, or records management theory is archival diplomatics. Records Management Journal 20, 1 (2010a), 78--95.",
      "doi": ""
    },
    {
      "text": "Duranti, L. From digital diplomatics to digital records forensics. Archivaria 68, 68 (2010b).",
      "doi": ""
    },
    {
      "text": "Duranti, L., & MacNeil, H. The protection of the integrity of electronic records: An overview of the UBC-MAS research project. Archivaria 1, 42 (1996).",
      "doi": ""
    },
    {
      "text": "Duranti, L., & Thibodeau, K. The concept of record in interactive, experiential and dynamic environments: The view of InterPARES*. Archival Science 6, 1 (2006), 13--68.",
      "doi": ""
    },
    {
      "text": "Galloway, P. Preservation of digital objects. Annual Review of Information Science and Technology, Vol. 38 (2003), 549--590.",
      "doi": ""
    },
    {
      "text": "Generally Accepted Recordkeeping Principles. ARMA International. 2014. Retrieved from http://www.arma.org/r2/generally-accepted-brrecordkeeping-principles.",
      "doi": ""
    },
    {
      "text": "Ginn, M. L. (Ed.). Retention Management for Records and Information. ARMA International, Lenexa, KS, USA, 2009.",
      "doi": ""
    },
    {
      "text": "Golsteijn, C., van den Hoven, E., Frohlich, D., & Sellen, A. Towards a more cherishable digital object. Proc DIS 2012, ACM Press (2012), 655--664.  ",
      "doi": "10.1145/2317956.2318054"
    },
    {
      "text": "Gulotta, R., Odom, W., Forlizzi, J., & Faste, H. (2013). Digital artifacts as legacy: Exploring the lifespan and value of digital data. Proc. CHI 2013, ACM Press (2013), 1813--1822.  ",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Hughes, J. A., Randall, D., & Shapiro, D. Faltering from Ethnography to Design. In Proc. CSCW 1992, ACM Press (1992), 115--122.  ",
      "doi": "10.1145/143457.143469"
    },
    {
      "text": "International Standard on Records Management. ISO 15489--1:2001. Geneva, Switzerland: ISO.",
      "doi": ""
    },
    {
      "text": "Jackson, S. J., & Kang, L. Breakdown, obsolescence and reuse: HCI and the art of repair. Proc. CHI 2014, ACM Press (2014), 449--458.  ",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Kaye, J. \"Jofish,\" Vertesi, J., Avery, S., Dafoe, A., David, S., Onaga, L., -- Pinch, T. To have and to hold: Exploring the personal archive. Proc. CHI 2006, ACM Press (2006), 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "Kirk, D. S., Izadi, S., Sellen, A., Taylor, S., Banks, R., & Hilliges, O. Opening up the family archive. Proc. CSCW 2010, ACM Press (2010), 261--270.  ",
      "doi": "10.1145/1718918.1718968"
    },
    {
      "text": "Kirk, D. S., & Sellen, A. On human remains: Values and practice in the home archiving of cherished objects. ACM Trans. Comput.-Hum. Interact. 17, 3 (2010), 10:1--10:43.  ",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Lomas, D., Kumar, A., Patel, K., Ching, D., Lakshmanan, M., Kam, M., & Forlizzi, J. L. The power of play: Design lessons for increasing the lifespan of outdated computers. Proc. CHI 2013, ACM Press (2013), 2735--2744.  ",
      "doi": "10.1145/2470654.2481379"
    },
    {
      "text": "Malone, T. W. How do people organize their desks?: Implications for the design of office information systems. ACM Trans. Inf. Syst., 1, 1 (1983), 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Odom, W., Banks, R., Kirk, D., Harper, R., Lindley, S., & Sellen, A. Technology heirlooms': Considerations for passing down and inheriting digital materials. Proc. CHI 2012, ACM Press (2012), 337--346.  ",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "Odom, W., Sellen, A., Harper, R., & Thereska, E. (2012). Lost in translation: Understanding the possession of digital things in the cloud. Proc. CHI 2012, ACM Press (2012), 781--790.  ",
      "doi": "10.1145/2207676.2207789"
    },
    {
      "text": "Odom, W., Zimmerman, J., & Forlizzi, J. Teenagers and their virtual possessions: Design opportunities and issues. Proc. CHI 2011, ACM Press (2011), 1491--1500.  ",
      "doi": "10.1145/1978942.1979161"
    },
    {
      "text": "Odom, W., Zimmerman, J., Forlizzi, J., Choi, H., Meier, S., & Park, A. Investigating the presence, form and behavior of virtual possessions in the context of a teen bedroom. Proc. CHI 2012, ACM Press (2012), 327--336.  ",
      "doi": "10.1145/2207676.2207722"
    },
    {
      "text": "Pearce-Moses, R. Record. A Glossary of Archival and Records Terminology. Society of American Archivists, 2005.",
      "doi": ""
    },
    {
      "text": "Petrelli, D., & Whittaker, S. Family memories in the home: Contrasting physical and digital mementos. Personal Ubiquitous Comput., 14, 2 (2010), 153--169.  ",
      "doi": "10.1007/s00779-009-0279-7"
    },
    {
      "text": "Pierce, J., & Paulos, E. Electric materialities and interactive technology. Proc. CHI 2013, ACM Press (2013), 119--128.  ",
      "doi": "10.1145/2470654.2470672"
    },
    {
      "text": "Remy, J.C. & Huang, E. Addressing the Obsolescence of End-User Devices: Approaches from the Field of Sustainable HCI. In Hilty, L.M., Aebischer, B. (eds.) ICT Innovations for Sustainability. Springer (2014), 257 - 267.",
      "doi": ""
    },
    {
      "text": "Robles, E., & Wiberg, M. Texturing the \"Material Turn\" in Interaction Design. In Proc TEI 2010, ACM Press (2010), 137--144.  ",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Rothenberg, J. Avoiding technological quicksand: Finding a viable technical foundation for digital preservation. No. 77, Council on Library and Information Resources (CLIR), Washington, DC, USA, 1998. ",
      "doi": "10.5555/520971"
    },
    {
      "text": "Sellen, A., & Harper, R. The Myth of the Paperless Office. MIT Press, Cambridge, MA, USA, 2001. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Winograd, T., & Flores, F. Understanding computers and cognition: A new foundation for design. Ablex Corporation, Norwood, NJ, USA, 1986. ",
      "doi": "10.5555/576359"
    }
  ]
}