{
  "doi": "10.1145/2702123.2702135",
  "title": "VelociTap: Investigating Fast Mobile Text Entry using Sentence-Based Decoding of Touchscreen Keyboard Input",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "659-668",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We present VelociTap: a state-of-the-art touchscreen keyboard decoder that supports a sentence-based text entry approach. VelociTap enables users to seamlessly choose from three word-delimiter actions: pushing a space key, swiping to the right, or simply omitting the space key and letting the decoder infer spaces automatically. We demonstrate that VelociTap has a significantly lower error rate than Google's keyboard while retaining the same entry rate. We show that intermediate visual feedback does not significantly affect entry or error rates and we find that using the space key results in the most accurate results. We also demonstrate that enabling flexible word-delimiter options does not incur an error rate penalty. Finally, we investigate how small we can make the keyboard when using VelociTap. We show that novice users can reach a mean entry rate of 41 wpm on a 40 mm wide smartwatch-sized keyboard at a 3% character error rate.",
  "authors": [
    {
      "name": "Keith Vertanen",
      "institution": "Montana Tech, Butte, MT, USA",
      "img": "/do/10.1145/contrib-81413602297/rel-imgonly/keith_cs.png",
      "acmid": "81413602297",
      "orcid": "missing"
    },
    {
      "name": "Haythem Memmi",
      "institution": "Montana Tech, Butte, MT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358775057",
      "orcid": "missing"
    },
    {
      "name": "Justin Emge",
      "institution": "Montana Tech, Butte, MT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958810957",
      "orcid": "missing"
    },
    {
      "name": "Shyam Reyal",
      "institution": "University of St Andrews, St Andrews, Fife, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706737",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Bi, X., Ouyang, T., and Zhai, S. Both complete and correct?: multi-objective optimization of touchscreen keyboard. In Proc. CHI (2014), 2297--2306.  ",
      "doi": "10.1145/2556288.2557414"
    },
    {
      "text": "Bi, X., Smith, B. A., and Zhai, S. Quasi-Qwerty soft keyboard optimization. In Proc. CHI (2010), 283--286.  ",
      "doi": "10.1145/1753326.1753367"
    },
    {
      "text": "Bi, X., Smith, B. A., and Zhai, S. Multilingual touchscreen keyboard design and optimization. Human-Computer Interaction 27, 4 (2012), 352--382.",
      "doi": ""
    },
    {
      "text": "Cheng, L.-P., Liang, H.-S., Wu, C.-Y., and Chen, M. Y. iGrasp: grasp-based adaptive keyboard for mobile devices. In Proc. CHI (2013), 3037--3046.  ",
      "doi": "10.1145/2470654.2481422"
    },
    {
      "text": "Dunlop, M. D., and Levine, J. Multidimensional Pareto optimization of touchscreen keyboards for speed, familiarity and improved spell checking. In Proc. CHI (2012), 2669--2678.  ",
      "doi": "10.1145/2207676.2208659"
    },
    {
      "text": "Findlater, L., and Wobbrock, J. Personalized input: improving ten-finger touchscreen typing through automatic adaptation. In Proc. CHI (2012), 815--824.  ",
      "doi": "10.1145/2207676.2208520"
    },
    {
      "text": "Goel, M., Findlater, L., and Wobbrock, J. WalkType: using accelerometer data to accomodate situational impairments in mobile touch screen text entry. In Proc. CHI (2012), 2687--2696.  ",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Goel, M., Jansen, A., Mandel, T., Patel, S. N., and Wobbrock, J. O. ContextType: using hand posture information to improve mobile touch screen text entry. In Proc. CHI (2013), 2795--2798.  ",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Goodman, J., Venolia, G., Steury, K., and Parker, C. Language modeling for soft keyboards. In Proc. AAAI (2002), 419--424. ",
      "doi": "10.5555/777092.777159"
    },
    {
      "text": "Hart, S. G. NASA-task load index (NASA-TLX); 20 years later. Proc. Human Factors and Ergonomics Society Annual Meeting 50, 9 (2006), 904--908.",
      "doi": ""
    },
    {
      "text": "Komninos, A., and Dunlop, M. Text input on a smart watch. Pervasive Computing, IEEE 13, 4 (2014), 50--58.",
      "doi": ""
    },
    {
      "text": "Kristensson, P. O., and Vertanen, K. The inviscid text entry rate and its application as a grand goal for mobile text entry. In Proc. MobileHCI (2014), 335--338.  ",
      "doi": "10.1145/2628363.2628405"
    },
    {
      "text": "Kristensson, P. O., and Zhai, S. Shark2 : a large vocabulary shorthand writing system for pen-based computers. In Proc. UIST 2004 (2004), pp. 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Kristensson, P. O., and Zhai, S. Relaxing stylus typing precision by geometric pattern matching. In Proc. IUI (2005), 151--158.  ",
      "doi": "10.1145/1040830.1040867"
    },
    {
      "text": "Moore, R. C., and Lewis, W. Intelligent selection of language model training data. In Proc. ACL (2010), 220--224. ",
      "doi": "10.5555/1858842.1858883"
    },
    {
      "text": "Oney, S., Harrison, C., Ogan, A., and Wiese, J. ZoomBoard: A diminutive Qwerty soft keyboard using iterative zooming for ultra-small devices. In Proc. CHI (2013), 2799--2802.  ",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "Oulasvirta, A., Reichel, A., Li, W., Zhang, Y., Bachynskyi, M., Vertanen, K., and Kristensson, P. O. Improving two-thumb text entry on touchscreen devices. In Proc. CHI (2013), 2765--2774.  ",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Pauls, A., and Klein, D. Faster and smaller N-gram language models. In Proc. HLT (2011), 258--267. ",
      "doi": "10.5555/2002472.2002506"
    },
    {
      "text": "Vertanen, K., and Kristensson, P. O. A versatile dataset for text entry evaluations based on genuine mobile emails. In Proc. MobileHCI (2011), 295--298.  ",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Vertanen, K., and Kristensson, P. O. Complementing text entry evaluations with a composition task. ACM Transactions of Computer Human Interaction 21, 2 (Feb. 2014), Article No. 8.  ",
      "doi": "10.1145/2555691"
    },
    {
      "text": "Weir, D., Pohl, H., Rogers, S., Vertanen, K., and Kristensson, P. O. Uncertain text entry on mobile devices. In Proc. CHI (2014), 2307--2316.  ",
      "doi": "10.1145/2556288.2557412"
    },
    {
      "text": "Zhai, S., and Kristensson, P. O. Interlaced QWERTY: accommodating ease of visual search and input flexibility in shape writing. In Proc. CHI (2008), pp. 593--596.  ",
      "doi": "10.1145/1357054.1357149"
    },
    {
      "text": "Zhai, S., Sue, A., and Accot, J. Movement model, hits distribution and learning in virtual keyboarding. In Proc. CHI (2002), 17--24.  ",
      "doi": "10.1145/503376.503381"
    }
  ]
}