{
  "doi": "10.1145/2702123.2702474",
  "title": "Using Interactive Machine Learning to Support Interface Development Through Workshops with Disabled People",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "251-254",
  "year": 2015,
  "badges": [],
  "abstract": "We have applied interactive machine learning (IML) to the creation and customisation of gesturally controlled musical interfaces in six workshops with people with learning and physical disabilities. Our observations and discussions with participants demonstrate the utility of IML as a tool for participatory design of accessible interfaces. This work has also led to a better understanding of challenges in end-user training of learning models, of how people develop personalised interaction strategies with different types of pre-trained interfaces, and of how properties of control spaces and input devices influence people's customisation strategies and engagement with instruments. This work has also uncovered similarities between the musical goals and practices of disabled people and those of expert musicians.",
  "authors": [
    {
      "name": "Simon Katan",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702332",
      "orcid": "missing"
    },
    {
      "name": "Mick Grierson",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655842",
      "orcid": "missing"
    },
    {
      "name": "Rebecca Fiebrink",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335490245",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fails, J. and D. R. Olsen. 2003. Interactive machine learning. Proc. IUI, 39--45.  ",
      "doi": "10.1145/604045.604056"
    },
    {
      "text": "Fiebrink, R., P. R. Cook, and D. Trueman. 2011. Human model evaluation in interactive supervised learning. Proc. CHI, 147--56.  ",
      "doi": "10.1145/1978942.1978965"
    },
    {
      "text": "Fiebrink, R., D. Trueman, C. Britt et al. 2010. Toward understanding human-computer interactions in composing the instrument. Int'l Comuter Music Conf.",
      "doi": ""
    },
    {
      "text": "Gajos, K., D.S. Weld and J.O. Wobbrock. 2010. Automatically generating personalized user interfaces with Supple. Artificial Intelligence 174(12-13): 910--50.  ",
      "doi": "10.1016/j.artint.2010.05.005"
    },
    {
      "text": "Myers, B.A., S.E. Hudson and R. Pausch. 2000. Past, present, and future of user interface software tools. ACM Trans. CHI 7(1): 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Pausch, R., and R. D. Williams. 1990. Tailor: Creating custom user interfaces based on gesture. Proc. UIST, 123--34.  ",
      "doi": "10.1145/97924.97939"
    },
    {
      "text": "Xu, Z., R. Fiebrink, and Y. Matsuoka. 2012. Virtual therapist: A Phantom robot-based haptic system for personalised post-surgery finger rehabilitation. Proc. IEEE Robotics & Biometrics (ROBIO).",
      "doi": ""
    }
  ]
}