{
  "doi": "10.1145/2702123.2702554",
  "title": "News Feed: What's in it for Me?",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "163-172",
  "year": 2015,
  "badges": [],
  "abstract": "Over a billion people use social networking sites like Facebook to maintain awareness of their friends. Facebook's News Feed is the primary mechanism by which people are shown updates about their friends' daily activities on the site in the form of an algorithmically curated list of stories. This paper examines how people browse the News Feed, their perceptions and satisfaction while using it, and the interactions they make with their personal social network. We conducted a qualitative study involving think-aloud semi-structured interviews as the participants casually browsed their own feeds. We observed a wide variation in the use of the News Feed ranging from careful consideration of social conventions, judgment of people, and annoyance and frustration towards certain friends. Our findings suggest that people do not deliberately curate their own News Feed either due to lack of awareness or perceived social repercussions.",
  "authors": [
    {
      "name": "Paul Lapides",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350578065",
      "orcid": "missing"
    },
    {
      "name": "Apoorve Chokshi",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84460375857",
      "orcid": "missing"
    },
    {
      "name": "Sheelagh Carpendale",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616781",
      "orcid": "missing"
    },
    {
      "name": "Saul Greenberg",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-81100197069/rel-imgonly/saul.greenberg.jpg",
      "acmid": "81100197069",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Back, M. Facebook Profiles Reflect Actual Personality, Not Self-Idealization. In Psychology Science. (2010), 372--374",
      "doi": ""
    },
    {
      "text": "Bakshy, E., Rosenn, I., Marlow, C., and Adamic, L. The Role of Social Networks in Information Diffusion. In Proc. WWW 2012, ACM Press (2012), 519--528.  ",
      "doi": "10.1145/2187836.2187907"
    },
    {
      "text": "Barkhuus, L., and Tashiro, J. Student Socialization in the Age of Facebook. In Proc. CHI2010, ACM Press (2010), 133--142.  ",
      "doi": "10.1145/1753326.1753347"
    },
    {
      "text": "Burke, M., Marlow, C., and Lento, T. Feed Me: Motivating Newcomer Contribution in Social Network Sites. In Proc. CHI2009, ACM Press (2009), 945--954.  ",
      "doi": "10.1145/1518701.1518847"
    },
    {
      "text": "Click-baiting http://newsroom.fb.com/news/2014/08/news-feed-fyiclick-baiting/",
      "doi": ""
    },
    {
      "text": "Coleman, J. Social Capital in the Creation of Human Capital. American Journal of Sociology, Vol. 94, (1988), S95--S120.",
      "doi": ""
    },
    {
      "text": "Company Info, Facebook Newsroom http://newsroom.fb.com/company-info/",
      "doi": ""
    },
    {
      "text": "Ellison, B., Steinfield, C. and Lampe, C. The Benefits of Facebook \"Friends:\" Social Capital and College Students' Use of Online Social Network Sites. Journal of Computer-Mediated Communication, 12: 1143--1168.",
      "doi": ""
    },
    {
      "text": "Facebook Wants Your News Feed to Reflect What's Happening Right Nowhttps://time.com/3399167/facebook-news-feedchange/",
      "doi": ""
    },
    {
      "text": "Forest, A. L., & Wood, J. V. (2011a). {Closeness of Facebook friends}. Unpublished raw data.",
      "doi": ""
    },
    {
      "text": "Glaser, B., Strauss, A. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine De Gruyter, NY, USA, 1967.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. Doubleday, Garden City, NY, USA, 1959.",
      "doi": ""
    },
    {
      "text": "Granovetter, M. The Strength of Weak Ties: A Network Theory Revisited. Sociological Theory (1983), 201--233.",
      "doi": ""
    },
    {
      "text": "Hart, J., Ridley, C., Taher, F., Sas, C., and Dix, A. Exploring the Facebook Experience: A New Approach to Usability. In Proc. NordiCHI 2008, ACM Press (2008), 471--474.  ",
      "doi": "10.1145/1463160.1463222"
    },
    {
      "text": "I Liked Everything I Saw On Facebook http://www.wired.com/2014/08/i-liked-everything-isaw-on-facebook-for-two-days-heres-what-it-did-to-me/",
      "doi": ""
    },
    {
      "text": "Johnson, M., Egelman, S., and Bellovin, S.M. Facebook and Privacy it's Complicated. In Proc. SOUPS 2012, ACM Press (2012).  ",
      "doi": "10.1145/2335356.2335369"
    },
    {
      "text": "Joinson, A.N. Looking at, Looking up or Keeping up with People?: Motives and Uses of Facebook. In Proc. CHI 2008, ACM Press (2008), 1027--1036.  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Kairam, S., Brzozowski, M., Huffaker, D., and Chi, E. Talking in Circles: Selective Sharing in Google+. In Proc. CHI2012, ACM Press (2012), 1065--1074.  ",
      "doi": "10.1145/2207676.2208552"
    },
    {
      "text": "Lampe, C., Ellison, N. and Steinfield, C. A Face(book) in the Crowd: Social Searching vs. Social Browsing. In Proc. CSCW2006, ACM Press (2006), 167--170.  ",
      "doi": "10.1145/1180875.1180901"
    },
    {
      "text": "Lampe, C., Ellison, N. and Steinfield, C. Changes in Use and Perception of Facebook. In Proc.CSCW2008, ACM Press (2008), 721--730.  ",
      "doi": "10.1145/1460563.1460675"
    },
    {
      "text": "Lewis, C. and Rieman, J. Task-Centered User Interface Design. Chapter 5: Testing the Design With Users. http://hcibib.org/tcuid/chap-5.html#5-5.",
      "doi": ""
    },
    {
      "text": "Mehdizadeh, S., Self-presentation 2.0: Narcissism and Self-Esteem on Facebook. In Cyberpsychology, Behavior, and Social Networking. (2010), 357--364.",
      "doi": ""
    },
    {
      "text": "Michael Brown's shooting in Ferguson lost on social media http://www.cbc.ca/news/technology/michael-brown-sshooting-in-ferguson-lost-on-social-media-1.2740014",
      "doi": ""
    },
    {
      "text": "Net Neutrality, Algorithmic Filtering and Fergusonhttps://medium.com/message/ferguson-is-alsoa-net-neutrality-issue-6d2f3db51eb0",
      "doi": ""
    },
    {
      "text": "Pempek, T.A., Yermolayeva, Y.A., and Calvert, S.L. College students' social networking experiences on Facebook. Journal of Applied Developmental Psychology 30, Elsevier (2009), 227--238.",
      "doi": ""
    },
    {
      "text": "Purcell, K., Rainie, L., Mitchell, A., Rosenstiel, T., and Olmstead, K. Understanding the Participatory News Consumer. Research for Pew Internet, (2010)",
      "doi": ""
    },
    {
      "text": "Skeels, M. and Grudin, J. When Social Networks Cross Boundaries: A Case Study of Workplace Use of Facebook and LinkedIn. In Proc. GROUP2009. ACM Press (2009), 95--104.  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Sun, E., Rosenn, I., Marlow, C., and Lento, T. Gesundheit! Modeling Contagion through Facebook News Feed. In Proc. ICWSM 2009, AAAI Press (2009), 146--153.",
      "doi": ""
    },
    {
      "text": "The Ice Bucket Challenge on Facebook http://newsroom.fb.com/news/2014/08/the-ice-bucketchallenge-on-facebook/",
      "doi": ""
    },
    {
      "text": "Thompson, C. Brave New World of Digital Intimacy. New York Times Magazine. (September 5, 2008)",
      "doi": ""
    },
    {
      "text": "Vitak, J., Ellison, N.B., Steinfield, C. The Ties That Bond: Re-Examining the Relationship between Facebook Use and Bonding Social Capital. HICSS (2011)  ",
      "doi": "10.1109/HICSS.2011.435"
    }
  ]
}