{
  "doi": "10.1145/2702123.2702537",
  "title": "Working 9-5?: Professional Differences in Email and Boundary Management Practices",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3989-3998",
  "year": 2015,
  "badges": [],
  "abstract": "Technology not only brings benefits such as flexible working practices but can also have negative stressful consequences such as increasing email overload and the blurring of work-home boundaries. We report on an exploratory study that extends the current understanding of email usage by investigating how different professions at a university manage work and personal emails using different devices and how this impacts their work-home boundary management. Our findings lead us to identify two user groups: those with permeable boundaries (primarily academics) and those who have more rigid ones (primarily professional services employees) and that there are differences in when, where and how they manage their work and personal emails. In particular we find that some participants use micro-boundary strategies to manage transitions between work and personal life. Based on these novel findings we propose improvements of email software design to facilitate effective email, work-home boundary management, and support micro-boundary practices.",
  "tags": [
    "work and personal email",
    "email",
    "boundary management",
    "email overload",
    "work-home interference.",
    "cross-device interaction"
  ],
  "authors": [
    {
      "name": "Marta E. Cecchinato",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81508705985/rel-imgonly/marta2.jpg",
      "acmid": "81508705985",
      "orcid": "0000-0002-0627-8658"
    },
    {
      "name": "Anna L. Cox",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81350567335/rel-imgonly/a.cox.png",
      "acmid": "81350567335",
      "orcid": "0000-0003-2231-2964"
    },
    {
      "name": "Jon Bird",
      "institution": "City University, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100566270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashforth, B., Kreiner, G., and Fugate, M. All in a day's work: boundaries and micro-role transitions. Academy of Management review 25, 3 (2000), 472--491.",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Capra, R., Khanova, J., and Ramdeen, S. Work and personal e-mail use by university employees: PIM practices across domain boundaries. Journal of the American Society for Information Science and Technology 64, 5 (2013), 1029--1044.",
      "doi": ""
    },
    {
      "text": "Cecchinato, M.E., Bird, J., and Cox, A.L. Personalised Email Tools: A Solution to Email Overload? CHI'14 Workshop on Personalised Behaviour Change Technologies, (2014), 1--4.",
      "doi": ""
    },
    {
      "text": "Cecchinato, M.E., Cox, A.L., and Bird, J. \"I check my emails on the toilet\": Email Practices and Work-Home Boundary Management. MobileHCI'14 Workshop on Socio-Technical Systems and Work-Home Boundaries, (2014), 1--4.",
      "doi": ""
    },
    {
      "text": "Dabbish, L., Kraut, R., Fussell, S., and Kiesler, S. Understanding email use: predicting action on a message. Proc. of CHI, (2005), 691--700.  ",
      "doi": "10.1145/1054972.1055068"
    },
    {
      "text": "Dabbish, L. and Kraut, R. Email overload at work: an analysis of factors associated with email strain. Proc. of CSCW, (2006), 431--440.  ",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Dearman, D. and Pierce, J.S. \"It's on my other Computer!\": Computing with Multiple Devices. Proc. of CHI, (2008), 767--776.  ",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Dery, K., Kolb, D., and MacCormick, J. Working with connective flow: how smartphone use is evolving in practice. European Journal of Information Systems, April (2014), 1--13.",
      "doi": ""
    },
    {
      "text": "Fisher, D., Brush, a. J., Gleave, E., and Smith, M. a. Revisiting Whittaker & Sidner's \"email overload\" ten years later. Proc. of CSCW (2006), 309--312.  ",
      "doi": "10.1145/1180875.1180922"
    },
    {
      "text": "Google Help Center. Inbox tabs and category labels. 2013. http://bit.ly/Zno8R4.",
      "doi": ""
    },
    {
      "text": "Greenhaus, J. and Parasuraman, S. A Work-Nonwork Interactive Perspective of Stress and Its Consequences. Journal of Organizational Behavior 8, 2 (1987), 37--60.",
      "doi": ""
    },
    {
      "text": "Grevet, C., Choi, D., Kumar, D., and Gilbert, E. Overload is Overloaded!: Email in the Age of Gmail. Proc. of CHI, (2014), 793--802.  ",
      "doi": "10.1145/2556288.2557013"
    },
    {
      "text": "Hogan, B. and Fisher, D. A scale for measuring email overload. Microsoft Research 7, 9 (2006).",
      "doi": ""
    },
    {
      "text": "Jackson, B.T.W., Dawson, R., and Wilson, D. Understanding email interaction increases organisational productivity. Communications of the ACM 46, 2003, 80--84.  ",
      "doi": "10.1145/859670.859673"
    },
    {
      "text": "Kamsin, A., Blandford, A., and Cox, A. Personal task management: my tools fall apart when I'm very busy! CHI'12 Extended Abstracts on Human Factors in Computing Systems, (2012), 1369--1374.  ",
      "doi": "10.1145/2212776.2212457"
    },
    {
      "text": "Karlson, A., Iqbal, S., and Meyers, B. Mobile taskflow in context: a screenshot study of smartphone usage. Proc. of CHI, (2010), 2009--2018.  ",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Kossek, E.E., Ruderman, M.N., Braddy, P.W., and Hannum, K.M. Work-nonwork boundary management profiles: A person-centered approach. Journal of Vocational Behavior 81, 1 (2012), 112--128.",
      "doi": ""
    },
    {
      "text": "Mackay, W. Diversity in the use of electronic mail: A preliminary inquiry. ACM Transactions on Information Systems (TOIS) 6, 4 (1988), 380--397.  ",
      "doi": "10.1145/58566.58567"
    },
    {
      "text": "Matthews, T., Pierce, J., Road, H., Jose, S., and Tang, J. No smartphone is an island: the impact of places, situation and other device on smart phone use. IBM RJ10452. 10452, 2009, 1--10.",
      "doi": ""
    },
    {
      "text": "Mazmanian, M. and Erickson, I. The product of availability: understanding the economic underpinnings of constant connectivity. Proc. of CHI, (2014), 763--772.  ",
      "doi": "10.1145/2556288.2557381"
    },
    {
      "text": "Nippert-Eng, C. Calendars and keys: The classification of \"home\" and \"work.\" Sociological Forum 11, 3 (1996), 563--582.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A. and Sumari, L. Mobile kits and laptop trays: managing multiple devices in mobile information work. Proc. of CHI, (2007), 1127--1136.  ",
      "doi": "10.1145/1240624.1240795"
    },
    {
      "text": "Park, Y., Fritz, C., and Jex, S.M. Relationships between work-home segmentation and psychological detachment from work: The role of communication technology use at home. Journal of Occupational Health Psychology 16, 2011, 457--467.",
      "doi": ""
    },
    {
      "text": "Pew Research. Mobile Technology Fact Sheet. 2014. http://pewrsr.ch/OotDJE.",
      "doi": ""
    },
    {
      "text": "Pielot, M., Church, K., and Oliveira, R. De. An In-Situ Study of Mobile Phone Notifications. Proc. of MobileHCI, (2013), 233--242.  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Radicati Group. Email Statistics Report, 2013--2017. http://bit.ly/1l2gJ2z.",
      "doi": ""
    },
    {
      "text": "Rector, K. and Hailpern, J. MinEMail: SMS alert system for managing critical emails. Proc. of CHI, (2014), 783--792.  ",
      "doi": "10.1145/2556288.2557182"
    },
    {
      "text": "Scharf, F., Wolters, C., Cassens, J., and Herczeg, M. Cross-Device Interaction. AMBIENT 2013, The Third International Conference on Ambient Computing, Applications, Services and Technologies, (2013), 35--41.",
      "doi": ""
    },
    {
      "text": "Soucek, R. and Moser, K. Coping with information overload in email communication: Evaluation of a training intervention. Computers in Human Behavior 26, 6 (2010), 1458--1466.  ",
      "doi": "10.1016/j.chb.2010.04.024"
    },
    {
      "text": "Sumecki, D., Chipulu, M., and Ojiako, U. Email overload: Exploring the moderating role of the perception of email as a 'business critical' tool. International Journal of Information Management 31, 5 (2011), 407--414.  ",
      "doi": "10.1016/j.ijinfomgt.2010.12.008"
    },
    {
      "text": "Tang, J., Matthews, T., Cerruti, J., et al. Global differences in attributes of email usage. Proceedings of the 2009 international workshop on Intercultural collaboration, (2009), 185--194.  ",
      "doi": "10.1145/1499224.1499252"
    },
    {
      "text": "Whittaker, S. and Sidner, C. Email overload: exploring personal information management of email. Proc. of CHI, (1996), 276--283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}