{
  "doi": "10.1145/2702123.2702234",
  "title": "Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "585-594",
  "year": 2015,
  "badges": [],
  "abstract": "Despite demonstrated interest in designing for reflection, relatively little work provides a detailed explication of what exactly is meant by reflection or how to design around it. This paper fills that gap by reviewing and engaging with conceptual and theoretical models of reflection, organized by the disciplinary and epistemological perspectives each embodies. Synthesizing across this theoretical background, the paper identifies three dimensions of reflection: breakdown, inquiry, and transformation. Together, these dimensions serve as the foundation for reflective informatics, a conceptual approach that helps bring clarity and guidance to the discussion of designing for reflection. The paper distinguishes reflective informatics by demonstrating how it both differs from and complements existing related work. Finally, the paper provides a critically reflexive consideration of its own latent assumptions, especially about the value of reflection, and how they might impact work on designing for reflection.",
  "tags": [
    "design",
    "reflection",
    "reflective informatics",
    "reflective hci"
  ],
  "authors": [
    {
      "name": "Eric P.S. Baumer",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81311485671/rel-imgonly/dsc_3664-edit-square.png",
      "acmid": "81311485671",
      "orcid": "0000-0001-5338-4421"
    }
  ],
  "references": [
    {
      "text": "Agre, P.E. Computation and Human Experience. Cambridge University Press, Cambridge, 1997. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Arias, E., Eden, H., Fischer, G., Gorman, A., and Scharff, E. Transcending the Individual Human Mind Creating Shared Understanding through Collaborative Design. ACM ToCHI 7, 1 (2000), 84--113.  ",
      "doi": "10.1145/344949.345015"
    },
    {
      "text": "Bardzell, J. and Bardzell, S. What is \"critical\" about critical design?. Proc CHI, ACM Press (2013), 3297--3306.  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Bardzell, S., Bardzell, J., Forlizzi, J., Zimmerman, J., and Antanitis, J. Critical Design and Critical Theory: The Challenge of Designing for Provocation. Proc DIS, (2012), 288--297.  ",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Bateman, S., Teevan, J., and White, R.W. The Search Dashboard: How Reflection and Comparison Impact Search Behavior. Proc CHI, (2012), 1785--1794.  ",
      "doi": "10.1145/2207676.2208311"
    },
    {
      "text": "Baumer, E.P.S., Khovanskaya, V., Matthews, M., Reynolds, L., Sosik, V.S., and Gay, G. Reviewing Reflection: On the Use of Reflection in Interactive System Design. Proc DIS, (2014), 93--102.  ",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Baumer, E.P.S. and Silberman, M.S. When the Implication Is Not to Design (Technology). Proc CHI, (2011), 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Blevis, E. Stillness and Motion, Meaning and Form. Proc DIS, (2014), 493--502.  ",
      "doi": "10.1145/2598510.2602963"
    },
    {
      "text": "Boehner, K., Gay, G., and Larkin, C. Drawing evaluation into design for mobile computing: a case study of the Renwick Gallery's Hand Held Education Project. J of Digital Libraries 5, 3 (2005), 219--230.  ",
      "doi": "10.5555/1064175.1064181"
    },
    {
      "text": "Boud, D., Keogh, R., and Walker, D., eds. Reflection: Turning Experience into Learning. Kogan Page, London, 1985.",
      "doi": ""
    },
    {
      "text": "Cheng, J., Bapat, A., Thomas, G., et al. GoSlow: Designing for Slowness, Reflection and Solitude. Proc CHI Ext. Abst., (2011), 429--438.  ",
      "doi": "10.1145/1979742.1979622"
    },
    {
      "text": "Dewey, J. How We Think. A restatement of the relation of reflective thinking to the educative process. D. C. Heath, Boston, 1933.",
      "doi": ""
    },
    {
      "text": "Dourish, P. and Button, G. On Technomethodology: Foundational Relationships between Ethnomethodology and System Design. Human-Computer Interaction 13, 4 (1998), 395--432.  ",
      "doi": "10.1207/s15327051hci1304_2"
    },
    {
      "text": "Dunne, T. and Raby, F. Design Noir: The Secret Life of Electronic Objects. Birkhäuser, Berlin, 2001.",
      "doi": ""
    },
    {
      "text": "Fleck, R. and Fitzpatrick, G. Reflecting on Reflection: Framing a Design Landscape. Proc OZCHI, (2010), 216--223.  ",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "Fook, J., White, S., and Gardner, F. Critical reflection: a review of contemporary literature and understandings. In S. White, J. Fook and F. Gardner, eds., Critical reflection in health and social care. Open University Press, Maidenhead, 2006, 3--20.",
      "doi": ""
    },
    {
      "text": "Freire, P. The Pedagogy of the Oppressed. Seabury, New York, 1970.",
      "doi": ""
    },
    {
      "text": "Friedman, B., Kahn, P.H., and Borning, A. Value Sensitive Design and Information Systems. In P. Zhang and D. Galletta, eds., Human-Comput Interact in Mgmt Info Sys. M. E. Sharpe, London, 2003, 348--372.",
      "doi": ""
    },
    {
      "text": "Garfinkel, H. Studies in Ethnomethodology. Prentice-Hall, Englewood-Cliffs, NJ, 1967.",
      "doi": ""
    },
    {
      "text": "Hallnäs, L. and Redström, J. Slow Technology -- Designing for Reflection. Personal and Ubiquitous Computing 5, 3 (2001), 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Heidegger, M. Being and Time. Harper & Row, 1927.",
      "doi": ""
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K., and Grinter, R.E. Postcolonial computing: a lens on design and development. Proc CHI, ACM (2010), 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Kahneman, D. and Tversky, A. Prospect Theory: An Analysis of Decision Under Risk. Econometrica 47, 2 (1979), 263--292.",
      "doi": ""
    },
    {
      "text": "Kahneman, D. Thinking, Fast and Slow. Farrar, Straus and Giroux, New York, 2011.",
      "doi": ""
    },
    {
      "text": "Kant, I. Critique of the Power of Judgment. Cambridge University Press, Cambridge, 1790.",
      "doi": ""
    },
    {
      "text": "King, P.M. and Kitchener, K.S. Developing Reflective Judgment. Jossey-Bass, San Francisco, 1994.",
      "doi": ""
    },
    {
      "text": "Kolb, D. Experiential Learning: Experience as the source of learning and development. Prentice-Hall, Englewood Cliffs, NJ, 1984.",
      "doi": ""
    },
    {
      "text": "Kriplean, T., Morgan, J., Freelon, D., Borning, A., and Bennett, L. Supporting Reflective Public Thought with ConsiderIt. Proc CSCW, (2012), 265--274.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Kuhn, T.S. The Structure of Scientific Revolutions. University of Chicago Press, Chicago, 1962.",
      "doi": ""
    },
    {
      "text": "Laschke, M., Hassenzahl, M., and Diefenbach, S. Things with attitude: Transformational Products. Create Symposium, (2011).",
      "doi": ""
    },
    {
      "text": "Li, I., Dey, A., and Forlizzi, J. A Stage-Based Model of Personal Informatics Systems. Proc CHI, (2010), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Lindley, S.E., Harper, R., and Sellen, A. Desiring to be in Touch in a Changing Communications Landscape: Attitudes of Older Adults. Proc CHI, (2009), 1693--1702.  ",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Löwgren, J. and Stolterman, E. Thoughtful Interaction Design. MIT Press, Cambridge, MA, 2004. ",
      "doi": "10.5555/1050958"
    },
    {
      "text": "Lyons, N., ed. Handbook of Reflection and Reflective Inquiry. Springer, New York, 2010.",
      "doi": ""
    },
    {
      "text": "Malacria, S., Scarr, J., Cockburn, A., Gutwin, C., and Grossman, T. Skillometers: Reflective Widgets that Motivate and Help Users to Improve Performance. Proc UIST, (2013), 321--330.  ",
      "doi": "10.1145/2501988.2501996"
    },
    {
      "text": "Mezirow, J. How Critical Reflection Triggers Transformative Learning. In J. Mezirow, ed., Fostering Critical Reflection in Adulthood. Jossey-Bass, San Francisco, 1990, 1--20.",
      "doi": ""
    },
    {
      "text": "Moon, J. Reflection in Learning & Professional Development. RoutledgeFalmer, Abingdon, Oxon, 1999.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. Things That Make Us Smart. Perseus Group, New York, 1993.",
      "doi": "10.5555/200550"
    },
    {
      "text": "Orlikowski, W.J. and Baroudi, J.J. Studying Information Technology in Organizations: Research Approaches and Assumptions. Info Sys Research 2, 1 (1991), 1--28.  ",
      "doi": "10.1287/isre.2.1.1"
    },
    {
      "text": "Pirzadeh, A., He, L., and Stolterman, E. Personal Informatics and Reflection: A Critical Examination of the Nature. Proc CHI Ext. Abst., (2013), 1979--1988.  ",
      "doi": "10.1145/2468356.2468715"
    },
    {
      "text": "Prilla, M., Degeling, M., and Herrmann, T. Collaborative Reflection at Work: Supporting Informal Learning at a Healthcare Workplace. Proc GROUP, (2012), 55--64.  ",
      "doi": "10.1145/2389176.2389185"
    },
    {
      "text": "Sas, C. and Dix, A. Designing for reflection on experience. Proc CHI Ext. Abst., (2009), 4741--4744.  ",
      "doi": "10.1145/1520340.1520730"
    },
    {
      "text": "Schön, D.A. The Reflective Practitioner. Basic Books, New York, 1983.",
      "doi": ""
    },
    {
      "text": "Schön, D.A. Designing as reflective conversation with the materials of a design situation. Research in Engineering Design 3, 3 (1992), 131--147.",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, K., David, S., and Kaye, J. \"Jofish.\" Reflective Design. Proc Critical Computing, (2005), 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Suchman, L.A. Plans and Situated Actions. Cambridge University Press, Cambridge, 1987.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Sumison, J. and Fleet, A. Reflection: can we assess it? Should we assess it? Assessment & Evaluation in Higher Education 21, 2 (1996), 121--130.",
      "doi": ""
    },
    {
      "text": "Thaler, R.H. and Sunstein, C.R. Nudge. Yale University Press, New Haven, CT, 2008.",
      "doi": ""
    }
  ]
}