{
  "doi": "10.1145/2702123.2702224",
  "title": "DynamicMaps: Similarity-based Browsing through a Massive Set of Images",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "995-1004",
  "year": 2015,
  "badges": [],
  "abstract": "We present a novel system for browsing through a very large set of images according to similarity. The images are dynamically placed on a 2D canvas next to their nearest neighbors in a high-dimensional feature space. The layout and choice of images is generated on-the-fly during user interaction, reflecting the user's navigation tendencies and interests. This intuitive solution for image browsing provides a continuous experience of navigating through an infinite 2D grid arranged by similarity. In contrast to common multidimensional embedding methods, our solution does not entail an upfront creation of a full global map. Image map generation is dynamic, fast and scalable, independent of the number of images in the dataset, and seamlessly supports online updates to the dataset. Thus, the technique is a viable solution for massive and constantly varying datasets consisting of millions of images. Evaluation of our approach shows that when using DynamicMaps, users viewed many more images per minute compared to a standard relevance feedback interface, suggesting that it supports more fluid and natural interaction that enables easier and faster movement in the image space. Most users preferred DynamicMaps, indicating it is more exploratory, better supports serendipitous browsing and more fun to use",
  "tags": [
    "similarity browsing",
    "image search",
    "image browsing",
    "relevance feedback"
  ],
  "authors": [
    {
      "name": "Yanir Kleiman",
      "institution": "Tel Aviv University, Tel Aviv, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430621545",
      "orcid": "missing"
    },
    {
      "name": "Joel Lanir",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574181",
      "orcid": "missing"
    },
    {
      "name": "Dov Danon",
      "institution": "Tel Aviv University, Tel Aviv, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706613",
      "orcid": "missing"
    },
    {
      "name": "Yasmin Felberbaum",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706703",
      "orcid": "missing"
    },
    {
      "name": "Daniel Cohen-Or",
      "institution": "Tel Aviv University, Tel Aviv, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100264399",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "André, P., Cutrell, E., Tan, D. S., & Smith, G. Designing novel image search interfaces by understanding unique characteristics and usage. INTERACT '09 (2009), 340--353.  ",
      "doi": "10.1007/978-3-642-03658-3_40"
    },
    {
      "text": "Back, J., & Oppenheim, C. A model of cognitive load for IR: implications for user relevance feedback interaction. Information Research 6 (2) (2001).",
      "doi": ""
    },
    {
      "text": "Bederson, B. B. PhotoMesa: a zoomable image browser using quantum treemaps and bubblemaps. In Proc. UIST 2001, ACM Press (2001), 71--80.  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Borg, I. and Groenen, P. Modern multidimensional scaling: Theory and applications. Springer, 2005.",
      "doi": ""
    },
    {
      "text": "Chen, C., Gagaudakis, G., & Rosin, P. Similarity-based image browsing. Int. conference on intelligent information processing (2000), 206--213.",
      "doi": ""
    },
    {
      "text": "Chew, B., Rode, J. A., & Sellen, A. Understanding the everyday use of images on the web. In Proc. NordiCHI'10. ACM Press (2010), 102--111.  ",
      "doi": "10.1145/1868914.1868930"
    },
    {
      "text": "Chung, E., & Yoon, J. Image needs in the context of image use: An exploratory study. Journal of Information Science (2011).  ",
      "doi": "10.1177/0165551511400951"
    },
    {
      "text": "Combs, T. T., & Bederson, B. B. Does zooming improve image browsing? In Proceedings of Digital libraries'99. ACM Press. (1999), 130--137.  ",
      "doi": "10.1145/313238.313286"
    },
    {
      "text": "Datta, R., Li, J., & Wang, J. Z. Content-based image retrieval: approaches and trends of the new age. In Proc. of SIGMM. ACM Press (2005), 253--262.  ",
      "doi": "10.1145/1101826.1101866"
    },
    {
      "text": "Deselaers, Thomas, Daniel Keysers, and Hermann Ney. Features for image retrieval: an experimental comparison. Information Retrieval 11, 2 (2008), 77--107.  ",
      "doi": "10.1007/s10791-007-9039-3"
    },
    {
      "text": "Eakins, J. P., Briggs, P., & Burford, B. Image retrieval interfaces: A user perspective. In Image and Video Retrieval, Springer Berlin Heidelberg (2004). 628--637.",
      "doi": ""
    },
    {
      "text": "Fan, J., Keim, D. A., Gao, Y., Luo, H., Li, Z. JustClick: Personalized image recommendation via exploratory search from large-scale Flickr images. IEEE Transactions on Circuits and Systems for Video Technology, 19, 2 (2009), 273--288.  ",
      "doi": "10.1109/TCSVT.2008.2009258"
    },
    {
      "text": "Hearst, M. Search user interfaces. Cambridge University Press. 2009. ",
      "doi": "10.5555/1631268"
    },
    {
      "text": "Hoque, E., Hoeber, O., & Gong, M. Balancing the trade-offs between diversity and precision for web image search using concept-based query expansion. Journal of Emerging Technologies in Web Intelligence, 4, 1 (2012) 26--34.",
      "doi": ""
    },
    {
      "text": "Hu, P. J. H., Ma, P. C., & Chau, P. Y. Evaluation of user interface designs for information retrieval systems: a computer-based experiment. Decision Support Systems, 27, 1 (1999) 125--143.  ",
      "doi": "10.1016/S0167-9236%2899%2900040-8"
    },
    {
      "text": "Igarashi T, Hinckley, K., Speed-dependent automatic zooming for browsing large documents, Proceedings of UIST 2000. ACM Press (2000), 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Jing, Y., Rowley, H., Wang, J., Tsai, D., Rosenberg, C., & Covell, M. Google image swirl: a large-scale content-based image visualization system. Proceedings of WWW. (2012), 539--540.  ",
      "doi": "10.1145/2187980.2188116"
    },
    {
      "text": "Kohonen, T. Self-organizing maps (Vol. 30). Springer. 2001. ",
      "doi": "10.5555/558021"
    },
    {
      "text": "Kleiman, Y., Fish, N., Lanir, J., & Cohen-Or, D. Dynamic maps for exploring and browsing shapes. Computer Graphics Forum 32, 5 (2012), 187--196.  ",
      "doi": "10.1111/cgf.12185"
    },
    {
      "text": "Liu, H., Xie, X., Tang, X., Li, Z. W., & Ma, W. Y. Effective browsing of web image search results. In Proc of SIGMM. ACM Press (2004), 84--90.  ",
      "doi": "10.1145/1026711.1026726"
    },
    {
      "text": "Markkula, M., & Sormunen, E. End-user searching challenges indexing practices in the digital newspaper photo archive. Information retrieval, 1, 4, (2000) 259--285  ",
      "doi": "10.1023/A%3A1009995816485"
    },
    {
      "text": "Oliva, A., and Torralba, A. Modeling the shape of the scene: A holistic representation of the spatial envelope. International Journal of Computer Vision 42, 3 (2001) 145--175.  ",
      "doi": "10.1023/A%3A1011139631724"
    },
    {
      "text": "Pečenovic, Z., Do, M. N., Vetterli, M., & Pu, P. Integrated browsing and searching of large image collections. In Advances in Visual Information Systems. Springer Berlin Heidelberg. (2000). 279--289. ",
      "doi": "10.5555/647061.714575"
    },
    {
      "text": "Rodden, K., Basalaj, W., Sinclair, D., & Wood, K. Does organization by similarity assist image browsing? In Proc CHI. ACM Press (2001). 190--197  ",
      "doi": "10.1145/365024.365097"
    },
    {
      "text": "Rodden K, Basalaj D W Sinclair, Wood K. Evaluating a visualization of image similarity as a tool for image browsing. IEEE symposium on information visualization (1999) 36--43 ",
      "doi": "10.5555/857189.857655"
    },
    {
      "text": "Roweis, S., and Saul, L. Nonlinear dimensionality reduction by locally linear embedding. Science 290, 5500, (2000), 2323--2326.",
      "doi": ""
    },
    {
      "text": "Rui, Y., Huang, T. S., Ortega, M., & Mehrotra, S. Relevance feedback: a power tool for interactive content-based image retrieval. Circuits and Systems for Video Technology, IEEE Transactions on, 8, 5 (1998), 644--655.  ",
      "doi": "10.1109/76.718510"
    },
    {
      "text": "Ruthven, I., & Lalmas, M. A survey on the use of relevance feedback for information access systems. The Knowledge Engineering Review, 18, 2 (2003) 95--145  ",
      "doi": "10.1017/S0269888903000638"
    },
    {
      "text": "Sakamoto, Y., Kuriyama S., and Kaneko, T. Motion map: image-based retrieval and segmentation of motion data. In Proc SIGGRAPH/ Eurographics symposium on Computer animation, (2004).  ",
      "doi": "10.1145/1028523.1028557"
    },
    {
      "text": "Shatford-Layne, S. Some issues in the indexing of images. Journal of the American society of Information Science. 45, 8 (1994) 583--588  ",
      "doi": "10.5555/196845.196855"
    },
    {
      "text": "Shneiderman B. Designing The User Interface: Strategies for Effective Human-Computer Interaction, 4/e. Pearson Education India, 2003. ",
      "doi": "10.5555/983803"
    },
    {
      "text": "Strong, G., Gong, M.. Browsing a large collection of community photos based on similarity on GPU. Advances in Visual Computing. (2008), 390--399.  ",
      "doi": "10.1007/978-3-540-89646-3_38"
    },
    {
      "text": "Strong, G., Hoeber, O., & Gong, M. Visual image browsing and exploration (Vibe): User evaluations of image search tasks. Active Media Technology. Springer Berlin Heidelberg (2010), 424--435. ",
      "doi": "10.5555/1886192.1886250"
    },
    {
      "text": "Suditu, N., & Fleuret, F. HEAT: Iterative relevance feedback with one million images. In ICCV 2011 IEEE (2011), 2118--2125.  ",
      "doi": "10.1109/ICCV.2011.6126487"
    },
    {
      "text": "Teevan, J., Alvarado, C., Ackerman, M. S., & Karger, D. R. The perfect search engine is not enough: a study of orienteering behavior in directed search. In Proc CHI 2004. ACM Press (2004), 415--422  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "Yee, K. P., Swearingen, K., Li, K., & Hearst, M. Faceted metadata for image search and browsing. In Proc CHI 2003. ACM Press (2003), 401--408.  ",
      "doi": "10.1145/642611.642681"
    },
    {
      "text": "Zhou, X. S., & Huang, T. S. Relevance feedback in image retrieval: A comprehensive review. Multimedia systems, 8, 6 (2003), 536--544.",
      "doi": ""
    }
  ]
}