{
  "doi": "10.1145/2702123.2702350",
  "title": "NotiRing: A Comparative Study of Notification Channels for Wearable Interactive Rings",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2497-2500",
  "year": 2015,
  "badges": [],
  "abstract": "We conducted an empirical investigation of wearable interactive rings on the noticeability of four instantaneous notification channels (light, vibration, sound, poke) and a channel with gradually increased temperature (thermal) during five levels of physical activity (laying down, sitting, standing, walking, and running). Results showed that vibration was the most reliable and fastest channel to convey notification, followed by poke and sound which shared similar noticeability. The noticeability of these three channels was not affected by the level of physical activity. The other two channels, light and thermal, were less noticeable and were affected by the level of physical activity. Our post-experimental survey indicates that while noticeability has a significant influence on user preference, each channel has its own unique advantages that make it suitable for different notification scenarios.",
  "tags": [
    "sound",
    "notification",
    "activity",
    "poke",
    "vibration",
    "heat",
    "ring",
    "wearable computing",
    "light"
  ],
  "authors": [
    {
      "name": "Thijs Roumen",
      "institution": "National University of Singapore & Hasso Plattner Institut (Germany), Singapore, Singapore",
      "img": "/do/10.1145/contrib-99658700053/rel-imgonly/44627890994_233b53923c_o.jpg",
      "acmid": "99658700053",
      "orcid": "missing"
    },
    {
      "name": "Simon T. Perrault",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81484656821/rel-imgonly/simon_perrault.jpg",
      "acmid": "81484656821",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    }
  ],
  "references": [
    {
      "text": "Arens, E. A., & Zhang, H. (2006). The Skin's Role in Human Thermoregulation and Comfort. N. Pan and P. Gibson, Woodhead Publishing, 560--602.",
      "doi": ""
    },
    {
      "text": "Ashbrook, D., Baudisch, P., & White, S. Nenya: subtle and eyes-free mobile input with a magneticallytracked finger ring. In Proc. CHI'11. 2043--2046.  ",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Campbell, C. S., & Tarasewich, P. Designing visual notification cues for mobile devices. In CHI EA'04, ACM, 1199--1202.  ",
      "doi": "10.1145/985921.986023"
    },
    {
      "text": "Dimitriadis, P., & Alexander, J. Evaluating the effectiveness of physical shape-change for in-pocket mobile device notifications. In Proc. CHI'14. ACM, 2589--2592.  ",
      "doi": "10.1145/2556288.2557164"
    },
    {
      "text": "Fukumoto, M. A finger-ring shaped wearable handset based on bone-conduction. In Proc. ISWC'05, 10--13.  ",
      "doi": "10.1109/ISWC.2005.4"
    },
    {
      "text": "Harrison, C., Lim, B. Y., Shick, A., & Hudson, S. E. (2009, April). Where to locate wearable displays? reaction time performance of visual alerts from tip to toe. In Proc. CHI'09, ACM, 941--944.  ",
      "doi": "10.1145/1518701.1518845"
    },
    {
      "text": "Kim, S. Y., & Kim, K. Y. (2007). Interactive racing game with graphic and haptic feedback. In Haptic and Audio Interaction Design, Springer, 69--77. ",
      "doi": "10.1007/978-3-540-76702-2_8"
    },
    {
      "text": "MacKay, B., Dearman, D., Inkpen, K., & Watters, C. (2005). Walk'n scroll: a comparison of software-based navigation techniques for different levels of mobility. In Proc. Mobile HCI'05, ACM, 183--190.  ",
      "doi": "10.1145/1085777.1085808"
    },
    {
      "text": "Saket, B., Prasojo, C., Huang, Y., & Zhao, S., February). Designing an effective vibration-based notification interface for mobile phones. In Proc. CSCW'13, ACM, 149--1504.  ",
      "doi": "10.1145/2441776.2441946"
    },
    {
      "text": "Warnock, D., McGee-Lennon, M., & Brewster, S. The role of modality in notification performance. In Proc. INTERACT'11, Springer, 572--588. ",
      "doi": "10.5555/2042118.2042173"
    },
    {
      "text": "Wisneski, C.A. (1999) The design of personal ambient displays MSc. Thesis MIT Media Lab",
      "doi": ""
    }
  ]
}