{
  "doi": "10.1145/2702123.2702423",
  "title": "Remote Paper Prototype Testing",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "77-80",
  "year": 2015,
  "badges": [],
  "abstract": "To test paper prototypes of mobile applications, we have been experimenting with remote paper prototype testing as an approach and tool for enabling a designer to wizard a paper prototype from afar while a user tests the prototype out of the lab. This paper presents a system for remote paper prototype testing that consists of (1) a video camera placed over a paper prototype, which streams a live audio-visual feed via Google Hangouts to a tester, and (2) Google Glass on the tester, which streams a live audio-visual-data feed to the facilitator and wizard. Results from a pilot study found that remote paper prototype testing helped designers gain valuable insights through use in realistic scenarios.",
  "authors": [
    {
      "name": "Kevin Chen",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700655",
      "orcid": "missing"
    },
    {
      "name": "Haoqi Zhang",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436600404",
      "orcid": "0000-0002-7640-0532"
    }
  ],
  "references": [
    {
      "text": "Been-Lirn Duh, H., Tan, G. C. B. and Chen, V. H. 2006. Usability evaluation for mobile device: a comparison of laboratory and field tests. In MobileHCI '06  ",
      "doi": "10.1145/1152215.1152254"
    },
    {
      "text": "Bernstein, M., Brandt, J., Miller, R.C. and Karger, D.R. Crowds in two seconds: Enabling real-time crowdpowered interfaces. In UIST '11.  ",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Bigham, J., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R., Miller, R. and Yeh, T. VizWiz: nearly realtime answers to visual questions. In UIST '10.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Bolchini, D., Pulido, D., & Faiola, A. (2009). Paper in screen prototyping: an agile technique to anticipate the mobile experience. Interactions, 16(4), 29--33.  ",
      "doi": "10.1145/1551986.1551992"
    },
    {
      "text": "de Sá, M. and Carriço, L. 2008. Lessons from early stages design of mobile applications. In MobileHCI '08.",
      "doi": ""
    },
    {
      "text": "de Sá, M. and Carriço, L. 2009. A mobile tool for in-situ prototyping. In MobileHCI '09.",
      "doi": ""
    },
    {
      "text": "Kjeldskov, J. and Stage, J. New techniques for usability evaluation of mobile systems, International Journal of Human-Computer Studies, Volume 60, Issues 5-6, May 2004.",
      "doi": ""
    },
    {
      "text": "Lumsden, J., MacLean, R. A Comparison of PseudoPaper and Paper Prototyping Methods for Mobile Evaluations. MONET '2008, 2008.  ",
      "doi": "10.1007/978-3-540-88875-8_77"
    },
    {
      "text": "Nielsen, C.M., Overgaard, M., Pedersen, M.B., Stage, J. and Stenild, S. 2006. It's worth the hassle!: the added value of evaluating the usability of mobile systems in the field. In NordiCHI '06.  ",
      "doi": "10.1145/1182475.1182504"
    },
    {
      "text": "Raento, M.; Oulasvirta, A.; Petit, R.; Toivonen, H. ContextPhone: a prototyping platform for context-aware mobile applications. Pervasive Computing, IEEE, vol.4, no.2, pp.51--59, Jan.-March 2005.  ",
      "doi": "10.1109/MPRV.2005.29"
    },
    {
      "text": "Rettig, M. 1994. Prototyping for tiny fingers. Commun. ACM 37, 4 (April 1994), 21--27.  ",
      "doi": "10.1145/175276.175288"
    }
  ]
}