{
  "doi": "10.1145/2702123.2702228",
  "title": "An Architecture for Generating Interactive Feedback in Probabilistic User Interfaces",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2545-2554",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Increasingly natural, sensed, and touch-based input is being integrated into devices. Along the way, both custom and more general solutions have been developed for dealing with the uncertainty that is associated with these forms of input. However, it is difficult to provide dynamic, flexible, and continuous feedback about uncertainty using traditional interactive infrastructure. Our contribution is a general architecture with the goal of providing support for continual feedback about uncertainty. Our architecture is based on prior work in modeling uncertainty using Monte Carlo sampling, and tracks multiple interfaces -- one for each plausible and differentiable sequence of input that the user may have intended. Importantly, it considers how the presentation of uncertainty can be organized and implemented in a general way. Our primary contribution is a method for reducing the number of alternative interfaces and fusing possible interfaces into a single interface that both communicates uncertainty and allows for disambiguation. We demonstrate the value of this result through a collection of 11 new and existing feedback techniques along with two applications demonstrating the use of the feedback architecture.",
  "authors": [
    {
      "name": "Julia Schwarz",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416594005",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Bau, O., Mackay, W., OctoPocus: A Dynamic Guide for Learning Gesture-Based Command Sets. Proc. UIST 2008, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Baumgarten, Barksdale, and Rutter. IBM® ViaVoice QuickTutorial®, 2000.",
      "doi": ""
    },
    {
      "text": "Bi, X., & Zhai, S. Bayesian Touch: A Statistical Criterion of Target Selection with Finger Touch. Proc. UIST 2013, 51--60.  ",
      "doi": "10.1145/2501988.2502058"
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T. Toolglass and Magic Lenses. Proc. SIGGRAPH 1993, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Findlater, L. and Gajos, K. Design Space and Evaluation Challenges of Adaptive Graphical User Interafaces. AI Magazine. 30(4):68, 2009.",
      "doi": ""
    },
    {
      "text": "Hudson, S.E., Newell, G. L. Probabilistic State Machines: Dialog Management for Inputs With Uncertainty. Proc. UIST 1992, 199--208.  ",
      "doi": "10.1145/142621.142650"
    },
    {
      "text": "Igarashi, T., Sachiko, K., Hidehiko, T., Matsuoka, S. Pegasus: A Drawing System for Rapid Geometric Design. Proc. CHI 1998, 24--35.  ",
      "doi": "10.1145/286498.286511"
    },
    {
      "text": "Kristenson, P., Zhai, S. SHARK2 : a large vocabulary shorthand writing system for pen-based computers. Proc. UIST 2014, 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Lalanne, D., Palanque, P., Robinson, P., Vanderdonckt, J., Ladry, J. Fusion Engines for Multimodal Input: A Survey. Proc. ICMI 2009, 153--160.  ",
      "doi": "10.1145/1647314.1647343"
    },
    {
      "text": "Li, Y. Beyond Pinch and Flick: Enriching Mobile Gesture Interaction. Computer. 42(12):87--89, 2009.  ",
      "doi": "10.1109/MC.2009.381"
    },
    {
      "text": "Li, Y., Lu, H., Zhang, H. Optimistic Programming of Touch Interaction. TOCHI. 21(4): 24, 2014.  ",
      "doi": "10.1145/2631914"
    },
    {
      "text": "Lunzer, A., Hornbæk, K. Subjunctive Interfaces. TOCHI. 14(4): 1--44, 2008.  ",
      "doi": "10.1145/1314683.1314685"
    },
    {
      "text": "MacEachren, A.M. Visualizing Uncertain Information. Cartographic Perspective. 13(13):10--19, 1992.",
      "doi": ""
    },
    {
      "text": "Mankoff, J., Hudson, S. E., Abowd, G. D. Interaction techniques for ambiguity resolution in recognition-based interfaces. Proc. UIST 2000, 11--20.  ",
      "doi": "10.1145/354401.354407"
    },
    {
      "text": "Mankoff, J., Hudson, S. E., Abowd, G.D. Providing Integrated Toolkit-Level Support for Ambiguity in Recognition-Based Interfaces. Proc. CHI 2000, 368--375.  ",
      "doi": "10.1145/332040.332459"
    },
    {
      "text": "Martin, J. Veldman, R., Béroule, D. Developing Multimodal Interfaces: A Theoretical Framework and Guided Propagation Networks. Proc. Multimodal HumanComputer Comunication, Systems, Techniques and Experiments 1998, 158--187. ",
      "doi": "10.5555/647795.733832"
    },
    {
      "text": "Oviatt, S. Mutual disambiguation of recognition errors in a multimodal architecture. Proc. CHI 1999, 576--583.  ",
      "doi": "10.1145/302979.303163"
    },
    {
      "text": "Schwarz, J., Mankoff, J., Hudson, S.E., Monte Carlo Methods for Managing Interactive State, Action and Feedback Under Uncertainty. Proc. UIST 2011, 235--244.  ",
      "doi": "10.1145/2047196.2047227"
    },
    {
      "text": "Terry, M., Mynatt, E., Nakakoji, K., Yamamoto, Y. Variation in Element and Action: Supporting Simultaneous Development of Alternative Solutions. Proc. CHI 2004, 711--718,  ",
      "doi": "10.1145/985692.985782"
    },
    {
      "text": "Terry, M., Mynatt, E. Side Views: Persistent, OnDemand Previews for Open-Ended Tasks. Proc. UIST 2002, 71--80.  ",
      "doi": "10.1145/571985.571996"
    },
    {
      "text": "Weir, D., Rogers, S., Murray-Smith, R., Löchtefeld, M. A user-specific machine learning approach for improving touch accuracy on mobile devices. Proc. UIST 2012, 465--476.  ",
      "doi": "10.1145/2380116.2380175"
    },
    {
      "text": "Wigdor, D., Williams, S., Cronin, M., Levy, R., White, K., Mazeev, M., Benko, H. Ripples: Utilizing PerContact Visualizations to Improve User Interaction With Touch Displays. Proc. UIST 2009, 3--12.  ",
      "doi": "10.1145/1622176.1622180"
    },
    {
      "text": "Williamson, J., Continuous Uncertain Interaction. PhD thesis. PhD thesis, University of Glasgow.",
      "doi": ""
    },
    {
      "text": "Williamson, J. Hex: Dynamics and Probabilistic Text Entry. Proc. Switching and Learning in Feedback Systems 2003. 333--342. ",
      "doi": "10.5555/2137592.2137610"
    },
    {
      "text": "Wilson, A., Shafer, S. XWand: UI for Intelligent Spaces. Proc. CHI 2003, 545--552. Figure 10. N-Best lists in several scenarios of drawing applicatio. A: User drags on an empty area; he may create a line, rectangle, or ellipse. B: When adjusting endpoints, several snap points are possible (hollow circles). C: The intended action is ambiguous. D: Items may be dragged to the bottom to be removed.  ",
      "doi": "10.1145/642611.642706"
    }
  ]
}