{
  "doi": "10.1145/2702123.2702352",
  "title": "Factful: Engaging Taxpayers in the Public Discussion of a Government Budget",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2843-2852",
  "year": 2015,
  "badges": [],
  "abstract": "While a government budget determines how taxpayers' money is allocated to various programs and stakeholders that compete for limited resources, the extensiveness and complexity of the budget and its process hinder taxpayers from understanding the budget information and participating in the public discussion. To engage taxpayers in the public discussion around budgetary issues, we leverage news articles containing budgetary information for design opportunities. We present Factful, a web-based annotative article reading interface that enhances the article with fact-checking support and contextual budgetary information by processing open government data. In our lab study, participants using Factful discussed more critically with more fact-based supporting statements. They built a rich context surrounding the relevant budget facts beyond what was presented in the article. Factful presents a simple yet powerful model for supporting fact-oriented budgetary discussions online by leveraging open government data.",
  "authors": [
    {
      "name": "Juho Kim",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    },
    {
      "name": "Eun-Young Ko",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696997",
      "orcid": "missing"
    },
    {
      "name": "Jonghyuk Jung",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-99658705067/rel-imgonly/img_3111.png",
      "acmid": "99658705067",
      "orcid": "missing"
    },
    {
      "name": "Chang Won Lee",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697068",
      "orcid": "missing"
    },
    {
      "name": "Nam Wook Kim",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701264",
      "orcid": "0000-0003-4899-6671"
    },
    {
      "name": "Jihee Kim",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639957",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brush, A. J. B., Bargeron, D., Grudin, J., Borning, A., and Gupta, A. Supporting interaction outside of class: Anchored discussions vs. discussion boards. In CSCL'02 (2002), 425--434. ",
      "doi": "10.5555/1658616.1658676"
    },
    {
      "text": "Caumont, A. 12 trends shaping digital news, 2013. Pew Research Center. {Online; posted 16-October-2013}.",
      "doi": ""
    },
    {
      "text": "Chen, Y., Yang, J., and Ribarsky, W. Toward effective insight management in visual analytics systems. In IEEE PACIFICVIS '09 (2009), 49--56.  ",
      "doi": "10.1109/PACIFICVIS.2009.4906837"
    },
    {
      "text": "Diakopoulos, N., Goldenberg, S., and Essa, I. Videolyzer: Quality analysis of online informational video for bloggers and journalists. In CHI '09, ACM (2009), 799--808.  ",
      "doi": "10.1145/1518701.1518824"
    },
    {
      "text": "Diakopoulos, N., and Naaman, M. Towards quality discourse in online news comments. In CSCW'11, ACM (2011), 133--142.  ",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "Elster, J. Deliberative democracy, vol. 1. Cambridge University Press, 1998.",
      "doi": ""
    },
    {
      "text": "Ennals, R., Trushkowsky, B., and Agosta, J. M. Highlighting disputed claims on the web. In WWW'10, ACM (2010), 341--350.  ",
      "doi": "10.1145/1772690.1772726"
    },
    {
      "text": "Fishkin, J. S., and Luskin, R. C. Experimenting with a democratic ideal: Deliberative polling and public opinion. Acta Politica 40, 3 (2005), 284--298.",
      "doi": ""
    },
    {
      "text": "Frey, D. Recent research on selective exposure to information. Advances in experimental social psychology 19, 1 (1986), 41--80.",
      "doi": ""
    },
    {
      "text": "Garrett, R. K., and Weeks, B. E. The promise and peril of real-time corrections to political misperceptions. In CSCW '13, ACM (2013), 1047--1058.  ",
      "doi": "10.1145/2441776.2441895"
    },
    {
      "text": "Gomez, P., Friedman, J., and Shapiro, I. Opening budgets to public understanding and debate: Results from 36 countries. OECD Journal on Budgeting 5, 1 (2005).",
      "doi": ""
    },
    {
      "text": "Graham, J. The reader's helper: A personalized document reading environment. In CHI'99, ACM (1999), 481--488.  ",
      "doi": "10.1145/302979.303139"
    },
    {
      "text": "Graves, L. Deciding What's True: Fact-Checking Journalism and the New Ecology of News. PhD thesis, Columbia University, 2013.",
      "doi": ""
    },
    {
      "text": "Hullman, J., Diakopoulos, N., and Adar, E. Contextifier: Automatic generation of annotated stock visualizations. In CHI'13, ACM (2013), 2707--2716.  ",
      "doi": "10.1145/2470654.2481374"
    },
    {
      "text": "Iacobelli, F., Birnbaum, L., and Hammond, K. J. Tell me more, not just \"more of the same\". In IUI'10, ACM (2010), 81--90.  ",
      "doi": "10.1145/1719970.1719982"
    },
    {
      "text": "Kong, N., Hearst, M. A., and Agrawala, M. Extracting references between text and charts via crowdsourcing. In CHI'14, ACM (2014), 31--40.  ",
      "doi": "10.1145/2556288.2557241"
    },
    {
      "text": "Kriplean, T., Bonnar, C., Borning, A., Kinney, B., and Gill, B. Integrating on-demand fact-checking with public dialogue. In CSCW'14, ACM (2014), 1188--1199.  ",
      "doi": "10.1145/2531602.2531677"
    },
    {
      "text": "Kriplean, T., Morgan, J., Freelon, D., Borning, A., and Bennett, L. Supporting reflective public thought with considerit. In CSCW '12, ACM (2012), 265--274.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Kriplean, T., Toomim, M., Morgan, J., Borning, A., and Ko, A. Is this what you meant?: Promoting listening on the web with reflect. In CHI '12, ACM (2012), 1559--1568.  ",
      "doi": "10.1145/2207676.2208621"
    },
    {
      "text": "Lampe, C., and Resnick, P. Slash(dot) and burn: Distributed moderation in a large online conversation space. In CHI'04, ACM (2004), 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Liao, Q. V., and Fu, W.-T. Expert voices in echo chambers: effects of source expertise indicators on exposure to diverse opinions. In CHI'14, ACM (2014), 2745--2754.  ",
      "doi": "10.1145/2556288.2557240"
    },
    {
      "text": "Liaw, R., Zilnik, A., Baldwin, M., and Butler, S. Maater: Crowdsourcing to improve online journalism. In CHI EA'13, ACM (2013), 2549--2554.  ",
      "doi": "10.1145/2468356.2468828"
    },
    {
      "text": "Meola, M. Chucking the checklist: A contextual approach to teaching undergraduates web-site evaluation. portal: Libraries and the Academy 4, 3 (2004), 331--344.",
      "doi": ""
    },
    {
      "text": "Metzger, M. J. Making sense of credibility on the web: Models for evaluating online information and recommendations for future research. Journal of the American Society for Information Science and Technology 58, 13 (2007), 2078--2091.  ",
      "doi": "10.5555/1315930.1315940"
    },
    {
      "text": "Munson, S. A., Lee, S. Y., and Resnick, P. Encouraging reading of diverse political viewpoints with a browser widget. In ICWSM (2013).",
      "doi": ""
    },
    {
      "text": "Otterbacher, J. \"helpfulness\" in online communities: A measure of message quality. In CHI'09, ACM (2009), 955--964.  ",
      "doi": "10.1145/1518701.1518848"
    },
    {
      "text": "Purcell, K., Rainie, L., Mitchell, A., Rosenstiel, T., and Olmstead, K. Understanding the participatory news consumer. Pew Internet and American Life Project 1 (2010), 19--21.",
      "doi": ""
    },
    {
      "text": "Salton, G., and McGill, M. J. Introduction to modern information retrieval. McGraw-Hill, 1983. ",
      "doi": "10.5555/576628"
    },
    {
      "text": "Wu, Y., Agarwal, P. K., Li, C., Yang, J., and Yu, C. Toward computational fact-checking. Proc. of the VLDB Endowment 7, 7 (2014).  ",
      "doi": "10.14778/2732286.2732295"
    },
    {
      "text": "Zaller, J. The nature and origins of mass opinion. Cambridge university press, 1992.",
      "doi": ""
    }
  ]
}