{
  "doi": "10.1145/2702123.2702265",
  "title": "CrowdMonitor: Mobile Crowd Sensing for Assessing Physical and Digital Activities of Citizens during Emergencies",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4083-4092",
  "year": 2015,
  "badges": [],
  "abstract": "Emergencies such as the 2013 Central European flood or the 2013 typhoon Haiyan in Philippines have shown how citizens can organize themselves and coordinate private relief activities. These activities can be found in (physical) groups of affected people, but also within (digital) social media communities. There is an evident need, however, for a clearer picture of what exactly is going on to be available for use by the official emergency services: to enlist them, to keep them safe, to support their efforts and to avoid needless duplications or conflicts. Aligning emergency services and volunteer activities is, then, crucial. In this paper we present a mobile crowd sensing based concept, which was designed as well as implemented as the application CrowdMonitor and facilitates the detection of physical and digital activities and the assignment of specific tasks to citizens. Finally we outline the findings of its evaluation.",
  "authors": [
    {
      "name": "Thomas Ludwig",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/do/10.1145/contrib-99658655780/rel-imgonly/thomas_ludwig.jpg",
      "acmid": "99658655780",
      "orcid": "0000-0003-4020-6321"
    },
    {
      "name": "Christian Reuter",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502652658",
      "orcid": "missing"
    },
    {
      "name": "Tim Siebigteroth",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707767",
      "orcid": "missing"
    },
    {
      "name": "Volkmar Pipek",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100222454",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abel, F., Hauff, C., and Stronkman, R. Semantics + Filtering + Search = Twitcident Exploring Information in Social Web Streams Categories and Subject Descriptors. Proc Hypertext (2012), 5--8.  ",
      "doi": "10.1145/2309996.2310043"
    },
    {
      "text": "Alexander, D.E. Social Media in Disaster Risk Reduction and Crisis Management. Science and Engineering Ethics, 20, 3 (2013), 717--733.",
      "doi": ""
    },
    {
      "text": "Brabham, C.D. Crowdsourcing. The MIT Press, Cambridge MA, London, 2013. ",
      "doi": "10.5555/2500929"
    },
    {
      "text": "Burke, J., Estrin, D., Hansen, M., et al. Participatory Sensing. Proc. Sensys (2006), 1--5.",
      "doi": ""
    },
    {
      "text": "Chohan, A.F., Hester, V., and Munro, R. Crowdsourcing for Multipurpose and Multicategory Climate related Disaster Reporting. Manchester (2010), 1--9.",
      "doi": ""
    },
    {
      "text": "Chu, E.T., Chen, Y., Lin, J., and Liu, J.W.S. Crowdsourcing Support System for Disaster Surveillance and Response. Proc. WPMC, IEEE (2012), 21--25.",
      "doi": ""
    },
    {
      "text": "Denef, S., Bayerl, P.S., Kaptein, N. Social Media and the Police-Tweeting Practices of British Police Forces during the August 2011 Riots. Proc. CHI, ACM (2013).  ",
      "doi": "10.1145/2470654.2466477"
    },
    {
      "text": "Dynes, R.R. Situational Altruism: Toward an Explanation of Pathologies in Disaster Assistance. 1994, 18--23.",
      "doi": ""
    },
    {
      "text": "Estelles-Arolas, E. and Gonzalez-Ladron-de-Guevara, F. Towards an integrated crowdsourcing definition. Journal of Information Science 38, 2 (2012), 189--200.  ",
      "doi": "10.1177/0165551512437638"
    },
    {
      "text": "Frommberger, L. and Schmid, F. Mobile4D: Crowdsourced Disaster Alerting and Reporting. Proc. ICTD (2013), 29--32.  ",
      "doi": "10.1145/2517899.2517925"
    },
    {
      "text": "Gao, H. and Barbier, G. Harnessing the Crowdsourcing Power of Social Media for Disaster Relief. Intelligent Systems, IEEE 26, 3 (2011), 10--14.  ",
      "doi": "10.1109/MIS.2011.52"
    },
    {
      "text": "Guo, B., Yu, Z., Zhou, X., and Zhang, D. From Participatory Sensing to Mobile Crowd Sensing. Proc. Workshop: Social and Community Intelligence (2014).",
      "doi": ""
    },
    {
      "text": "Hughes, A.L., Denis, L.A.S., Palen, L., and Anderson, K.M. Online Public Communications by Police & Fire Services during the 2012 Hurricane Sandy. Proc. CHI (2014), 1505--1514.  ",
      "doi": "10.1145/2556288.2557227"
    },
    {
      "text": "Kuznetsov, S., Davis, G.N., Cheung, J.C., and Paulos, E. Ceci N'est Pas Une Pipe Bombe: Augthoring Urban Landscapes with Air Quality Sensors. Proc. CHI (2014), 2375--2384.  ",
      "doi": "10.1145/1978942.1979290"
    },
    {
      "text": "Latonero, M. and Shklovski, I. Emergency Management, Twitter, and Social Media Evangelism. IJISCRAM 3, 4 (2011), 1--16.",
      "doi": ""
    },
    {
      "text": "Ley, B., Ludwig, T., Pipek, V., Randall, D., Reuter, C., and Wiedenhoefer, T. Information and Expertise Sharing in Inter-Organizational Crisis Management. JCSCW, Springer, 23, 4--6 (2014), 347--387.  ",
      "doi": "10.1007/s10606-014-9205-2"
    },
    {
      "text": "Marcus, A., Bernstein, M., Badar, O., Karger, D.R., Madden, S., and Miller, R.C. Twitinfo: aggregating and visualizing microblogs for event exploration. Proc. CHI, ACM (2011).  ",
      "doi": "10.1145/1978942.1978975"
    },
    {
      "text": "Mills, A., Chen, R., Lee, J., and Rao, H. Web 2.0 emergency applications: how useful can twitter be for emergency response. JIPS, 5, 3 (2009) 3--26.",
      "doi": ""
    },
    {
      "text": "Moran, S. et al. Listening to the Forest and its Curators. Proc. CHI (2014), 2387--2396.  ",
      "doi": "10.1145/2556288.2557022"
    },
    {
      "text": "Nielsen, J. Usability Engineering. MKP, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Okolloh, O. Ushahidi, or \"testimony\": Web 2.0 tools for crowdsourcing crisis information. Participatory Learning and Action 59 (2008), 65--70.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Liu, S.B. Citizen communications in crisis: anticipating a future of ICT-supported public participation. Proc. CHI, ACM (2007).  ",
      "doi": "10.1145/1240624.1240736"
    },
    {
      "text": "Poblet, M., García-Cuesta, E., and Casanovas, P. IT Enabled Crowds: Leveraging the Geomobile Revolution for Disaster Management. Proc. WG5 CI (2014), 16--23",
      "doi": ""
    },
    {
      "text": "Reddy, S., Shilton, K., and Denisov, G. Biketastic: sensing and mapping for better biking. Proc. CHI (2010), 1817--1820.  ",
      "doi": "10.1145/1753326.1753598"
    },
    {
      "text": "Reuter, C., Heger, O., and Pipek, V. Combining Real and Virtual Volunteers through Social Media. Proc. ISCRAM (2013), 1--10.",
      "doi": ""
    },
    {
      "text": "Reuter, C., Ludwig, T., Kaufhold, M.-A., and Pipek, V. XHELP: Design of a Cross-Platform Social-Media Application to Support Volunteer Moderators in Disasters. Proc. CHI (2015).  ",
      "doi": "10.1145/2702123.2702171"
    },
    {
      "text": "Reuter, C., Ludwig, T., and Pipek, V. Ad Hoc Participation in Situation Assessment: Supporting Mobile Collaboration in Emergencies. TOCHI 21, 5 (2014).  ",
      "doi": "10.1145/2651365"
    },
    {
      "text": "Reuter, C., Marx, A., and Pipek, V. Crisis Management 2.0: Towards a Systematization of Social Software Use in Crisis Situations. IJISCRAM 4, 1 (2012), 1--16.",
      "doi": ""
    },
    {
      "text": "Schulz, A., Paulheim, H., and Probst, F. Crisis Information Management in the Web 3.0 Age. Proc. ISCRAM (2012), 2--6.",
      "doi": ""
    },
    {
      "text": "Stallings, R.A. and Quarantelli, E.L. Emergent Citizen Groups and Emergency Management. Public Administration Review 45 (1985), 93--100.",
      "doi": ""
    },
    {
      "text": "Starbird, K. and Palen, L. Voluntweeters: SelfOrganizing by Digital Volunteers in Times of Crisis. Proc. CHI. ACM, Vancouver, Canada, 2011.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Starbird, K. Delivering patients to sacré coeur: collective intelligence in digital volunteer communities. Proc. CHI, ACM (2013), 801--810.  ",
      "doi": "10.1145/2470654.2470769"
    },
    {
      "text": "Strauss, A.L. Qualitative Analysis for Social Scientists. Cambridge Press, 1987.",
      "doi": ""
    },
    {
      "text": "Tierney, K.J., Bevc, C., and Kuligowski, E. Metaphors Matter: Disaster Myths, Media Frames, and Their Consequences in Hurricane Katrina. AAPSS Journal 604, 1 (2006), 57--81.",
      "doi": ""
    },
    {
      "text": "Twidale, M., Randall, D., and Bentley, R. Situated evaluation for cooperative systems Situated evaluation for cooperative systems. Lancester, United Kingdom, 1994.",
      "doi": ""
    },
    {
      "text": "Vieweg, S., Hughes, A.L., Starbird, K., and Palen, L. Microblogging During Two Natural Hazards Events: What Twitter May Contribute to Situational Awareness. Proc. CHI (2010), 1079--1088.  ",
      "doi": "10.1145/1753326.1753486"
    },
    {
      "text": "Wachtendorf, T. and Kendra, J.M. Improvising Disaster in the City of Jazz: Organizational Response to Hurricane Katrina. 2006..",
      "doi": ""
    },
    {
      "text": "Winterboer, A., Martens, M.A., Pavlin, G., Groen, F.C.A., and Evers, V. DIADEM: A System for Collaborative Environmental Monitoring. Proc. CSCW, ACM (2011), 589--590.  ",
      "doi": "10.1145/1958824.1958920"
    },
    {
      "text": "Wulf, V., Rohde, M., Pipek, V., Stevens, G. Engaging with Practices: Design Case Studies as a Research Framework in CSCW. Proc. CSCW, ACM (2011).  ",
      "doi": "10.1145/1958824.1958902"
    },
    {
      "text": "Zaslavsky, A., Jayaraman, P.P., and Krishnaswamy, S. ShareLikesCrowd: Mobile Analytics for Participatory Sensing and Crowdsourcing Applications. Proc. ICDEW, IEEE (2013), 128--135.",
      "doi": ""
    }
  ]
}