{
  "doi": "10.1145/2702123.2702564",
  "title": "Standards and/as Innovation: Protocols, Creativity, and Interactive Systems Development in Ecology",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1769-1778",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Standards and protocols play important but under-theorized roles in HCI research and design efforts, including those dedicated to the development of new collaborative infrastructures in the sciences. Building on several years of ethnographic fieldwork, this paper examines standardization efforts attached to new forms of design and computational development in American ecology. We explore the role that standards play in large-scale research networks; how standards are enacted and enforced in complex interactive systems like science; how standards struggle and fail (and what happens when they do); and how actors work across the gaps that standards leave to produce more effective forms of practice and design. We also argue for the potentially creative role of standards, including contexts in which they function as fulcrums for change and innovation. We conclude with reflections on how HCI researchers might rethink the nature and possibilities of standards and standardization in their own work.",
  "tags": [
    "infrastructure",
    "ethnography",
    "science",
    "standardization",
    "collaboration",
    "standards",
    "ecology"
  ],
  "authors": [
    {
      "name": "Steven J. Jackson",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100096023",
      "orcid": "0000-0002-4426-1320"
    },
    {
      "name": "Sarah Barbrow",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556607756",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berliner, P. Thinking in jazz: the infinite art of improvisation. University of Chicago Press, Chicago, 1994.",
      "doi": ""
    },
    {
      "text": "Borges, J.L. A universal history of iniquity. Penguin, London, 2001.",
      "doi": ""
    },
    {
      "text": "Bowker, G.C. Science on the run: information management and industrial geophysics at Schlumberger, 1920--1940. MIT Press, Cambridge, MA, 1994.",
      "doi": ""
    },
    {
      "text": "Bowker, G.C. and Star, S.L. Sorting things out: classification and its consequences. MIT Press, Cambridge, MA, 1999. ",
      "doi": "10.5555/380681"
    },
    {
      "text": "Burton, M. and Jackson, S.J. Constancy and Change in Scientific Collaboration: Coherence and Integrity in LongTerm Ecological Data Production. HICSS 2012, (2012), 353--362.  ",
      "doi": "10.1109/HICSS.2012.178"
    },
    {
      "text": "Cargill, C.F. Eating Our Seed Corn: A Standards Parable for our Time. 2005. http://blogs.adobe.com/standards/files/2012/04/Eating-OurSeed-Corn-revised-April-2012.pdf.",
      "doi": ""
    },
    {
      "text": "Cataldo, M. and Herbsleb, J.D. Coordination Breakdowns and Their Impact on Development Productivity and Software Failures. IEEE Transactions on Software Engineering 39, 3 (2013), 343--360.  ",
      "doi": "10.1109/TSE.2012.32"
    },
    {
      "text": "DiSalvo, C., Sengers, P., and Brynjarsdóttir, H. Mapping the Landscape of Sustainable HCI. Proc. CHI 2010, ACM Press (2010), 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Dourish, P. HCI and environmental sustainability. Proc. DIS 2010, ACM Press (2010), 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Edwards, P.N., Jackson, S.J., Bowker, G.C., and Knobel, C.P. Understanding Infrastructure: Dynamics, Tensions, and Design. Ann Arbor, MI, 2007.",
      "doi": ""
    },
    {
      "text": "Edwards, P.N., Jackson, S.J., Chalmers, M.K., et al. Knowledge Infrastructures: Intellectual Frameworks and Research Challenges. Ann Arbor, MI, 2013.",
      "doi": ""
    },
    {
      "text": "Edwards, W.K. and Grinter, R.E. At Home with Ubiquitous Computing: Seven Challenges. Ubicomp 2001, Springer Berlin Heidelberg (2001), 256--272. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Edwards, W.K., Newman, M.W., and Poole, E.S. The infrastructure problem in HCI. Proc. CHI 2010, ACM Press (2010), 423--432.  ",
      "doi": "10.1145/1753326.1753390"
    },
    {
      "text": "Grinter, R.E. Doing Software Development: Occasions for Automation and Formalisation. Proc. Euro CSCW 1997, Springer Netherlands (1997), 173--188. ",
      "doi": "10.5555/1241980.1241992"
    },
    {
      "text": "Howison, J. and Herbsleb, J.D. Scientific software production: incentives and collaboration. Proc. CSCW 2011, ACM Press (2011), 513--522.  ",
      "doi": "10.1145/1958824.1958904"
    },
    {
      "text": "Jackson, S.J. and Barbrow, S.K. Infrastructure and vocation: field, calling and computation in ecology. Proc. CHI 2013, ACM Press (2013), 2873--2882.  ",
      "doi": "10.1145/2470654.2481397"
    },
    {
      "text": "Jackson, S.J., Edwards, P.N., Bowker, G.C., and Knobel, C.P. Understanding infrastructure: History, heuristics and cyberinfrastructure policy. First Monday 12, 6 (2007).",
      "doi": ""
    },
    {
      "text": "Jackson, S.J., Steinhardt, S.B., and Buyuktur, A. Why CSCW needs science policy (and vice versa). Proc. CSCW 2013, ACM (2013), 1113--1124.  ",
      "doi": "10.1145/2441776.2441902"
    },
    {
      "text": "Klemp, N., McDermott, R., Raley, J., Thibeault, M., Powell, K., and Levitin, D.J. Plans, Takes, and Mistakes. Critical Social Studies 1, (2008), 4--21.",
      "doi": ""
    },
    {
      "text": "Lampland, M. and Star, S.L. Standards and their stories: how quantifying, classifying, and formalizing practices shape everyday life. Cornell University Press, Ithaca, NY, 2009.",
      "doi": ""
    },
    {
      "text": "Lee, C.P., Dourish, P., and Mark, G. The human infrastructure of cyberinfrastructure. Proc. CSCW 2006, ACM Press (2006), 483--492.  ",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Monteiro, E., Pollock, N., Hanseth, O., and Williams, R. From Artefacts to Infrastructures. Computer Supported Cooperative Work (CSCW) 22, 4-6 (2013), 575--607.  ",
      "doi": "10.1007/s10606-012-9167-1"
    },
    {
      "text": "Newman, M.W., Elliott, A., and Smith, T.F. Providing an Integrated User Experience of Networked Media, Devices, and Services through End-User Composition. In J. Indulska, D.J. Patterson, T. Rodden and M. Ott, eds., Pervasive Computing. Springer Berlin Heidelberg, 2008, 213--227.  ",
      "doi": "10.1007/978-3-540-79576-6_13"
    },
    {
      "text": "Olson, G.M., Zimmerman, A., and Bos, N. Scientific collaboration on the Internet. MIT Press, Cambridge, MA, 2008. ",
      "doi": "10.5555/1522423"
    },
    {
      "text": "Oudshoorn, N. and Pinch, T.J., eds. How users matter: the co-construction of users and technologies. MIT Press, Cambridge, MA, 2003. ",
      "doi": "10.5555/1044860"
    },
    {
      "text": "Palen, L., Vieweg, S., and Anderson, K.M. Supporting \"Everyday Analysts\" in Safety- and Time-Critical Situations. The Information Society Journal 27, 1 (2010), 52--62.  ",
      "doi": "10.1080/01972243.2011.534370"
    },
    {
      "text": "Pierce, J., Fan, C., Lomas, D., Marcu, G., and Paulos, E. Some consideration on the (in)effectiveness of residential energy feedback systems. Proc. DIS 2010, ACM Press (2010), 244--247.  ",
      "doi": "10.1145/1858171.1858215"
    },
    {
      "text": "Ribes, D. Ethnography of Scaling, or, How to a Fit a National Research Infrastructure in the Room. Proc. CSCW 2014, ACM Press (2014), 158--170.  ",
      "doi": "10.1145/2531602.2531624"
    },
    {
      "text": "Ribes, D. and Lee, C.P. Sociotechnical Studies of Cyberinfrastructure and e-Research: Current Themes and Future Trajectories. Computer Supported Cooperative Work (CSCW) 19, 3-4 (2010), 231--244.  ",
      "doi": "10.1007/s10606-010-9120-0"
    },
    {
      "text": "Schmidt, K. and Bannon, L. Taking CSCW seriously. Computer Supported Cooperative Work (CSCW) 1, 1-2 (1992), 7--40.",
      "doi": ""
    },
    {
      "text": "Starbird, K. and Palen, L. Working and sustaining the virtual \"Disaster Desk.\" Proc. CSCW 2013, ACM Press (2013), 491--502.  ",
      "doi": "10.1145/2441776.2441832"
    },
    {
      "text": "Star, S.L. Orphans of Infrastructure: A New Point of Departure. Presentation given at Newnham College, Cambridge UK. 2007. http://events.stanford.edu/events/97/9744/.",
      "doi": ""
    },
    {
      "text": "Star, S.L. and Griesemer, J.R. Institutional Ecology, 'Translations' and Boundary Objects: Amateurs and Professionals in Berkeley's Museum of Vertebrate Zoology, 1907--39. Social Studies of Science 19, 3 (1989), 387--420.",
      "doi": ""
    },
    {
      "text": "Star, S.L. and Ruhleder, K. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Information Systems Research 7, 1 (1996), 111--134.  ",
      "doi": "10.1287/isre.7.1.111"
    },
    {
      "text": "Star, S.L. and Strauss, A. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. Computer Supported Cooperative Work (CSCW) 8, 1-2 (1999), 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Updegrove, A. ICT Standard setting today: A system under stress. First Monday 12, 6 (2007).",
      "doi": ""
    },
    {
      "text": "Wilson, W. Request for Declaration of War. 1917",
      "doi": ""
    }
  ]
}