{
  "doi": "10.1145/2702123.2702504",
  "title": "Lessons Learnt from Deploying an End-User Development Platform for Physical Rehabilitation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4133-4142",
  "year": 2015,
  "badges": [],
  "abstract": "Clinical researchers in rehabilitation technology have often called for exercise customization to address patient specific needs. Where such customization transcends simple parameter setting, the need for End-User Development (EUD) arises. EUD in this field can potentially tap on the expertise of highly skilled workers, but presents serious challenges regarding acceptance by end users and the feasibility of embedding EUD in their professional practice. This paper describes the deployment and adoption process of TagTrainer, a physical rehabilitation technology that supports EUD. TagTrainer was deployed in four rehabilitation clinics and was used by 24 rehabilitation therapists. We analyze how they engaged in EUD activities and we discuss decisions that we took in the design and deployment of TagTrainer. Based on these case studies, we present guidelines for the deployment of EUD systems.",
  "authors": [
    {
      "name": "Daniel Tetteroo",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81488671924/rel-imgonly/bvof2017tue-iddanieltetteroo.jpg",
      "acmid": "81488671924",
      "orcid": "missing"
    },
    {
      "name": "Paul Vreugdenhil",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706581",
      "orcid": "missing"
    },
    {
      "name": "Ivor Grisel",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703651",
      "orcid": "missing"
    },
    {
      "name": "Marc Michielsen",
      "institution": "Jesse Hospital, Hasselt, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556902556",
      "orcid": "missing"
    },
    {
      "name": "Els Kuppens",
      "institution": "MS Reva Overpelt, Overpelt, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697346",
      "orcid": "missing"
    },
    {
      "name": "Diana Vanmulken",
      "institution": "Adelante Centre of Expertise in Rehabilitation and Audiology, Hoensbroek, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706717",
      "orcid": "missing"
    },
    {
      "name": "Panos Markopoulos",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81350577812/rel-imgonly/myphoto.jpg",
      "acmid": "81350577812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alankus, G., Lazar, A., May, M., and Kelleher, C. Towards Customizable Games for Stroke Rehabilitation. Proc. CHI '10, ACM (2010), 2113--2122.  ",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "Bandura, A. Guide for constructing self-efficacy scales. Self-efficacy beliefs of adolescents 5, (2006), 307--337.",
      "doi": ""
    },
    {
      "text": "Blackwell, A.F. First Steps in Programming: A Rationale for Attention Investment Models. Proc. HCC '02, IEEE Computer Society (2002), 2--10. ",
      "doi": "10.5555/795687.797842"
    },
    {
      "text": "Burnett, M.M. and Myers, B.A. Future of End-user Software Engineering: Beyond the Silos. Proc. ICSE 2014, ACM (2014), 201--211.  ",
      "doi": "10.1145/2593882.2593896"
    },
    {
      "text": "Cabitza, F., Fogli, D., and Piccinno, A. Fostering participation and co-evolution in sentient multimedia systems. J. Vis. Lang. Comput. 25, 6 (2014), 684--694.",
      "doi": "10.1016/j.jvlc.2014.10.014"
    },
    {
      "text": "Carmien, S.P. and Fischer, G. Design, adoption, and assessment of a socio-technical environment supporting independence for persons with cognitive disabilities. Proc. CHI '08, ACM (2008), 597--606.  ",
      "doi": "10.1145/1357054.1357151"
    },
    {
      "text": "Cott, C.A. Client-centred rehabilitation: client perspectives. Disabil Rehabil 26, 24 (2004), 1411--1422.",
      "doi": ""
    },
    {
      "text": "Daughtry, J.M., Farooq, U., Stylos, J., and Myers, B.A. API usability: CHI'2009 special interest group meeting. CHI '09 Extended Abstracts, ACM (2009), 2771--2774.  ",
      "doi": "10.1145/1520340.1520403"
    },
    {
      "text": "Devilly, G.J. and Borkovec, T.D. Psychometric properties of the credibility/expectancy questionnaire. J Behav Ther Exp Psy 31, 2 (2000), 73--86.",
      "doi": ""
    },
    {
      "text": "Fischer, G. Understanding, fostering, and supporting cultures of participation. ACM interactions 18, 3 (2011), 42--53.  ",
      "doi": "10.1145/1962438.1962450"
    },
    {
      "text": "Fischer, G., Giaccardi, E., Ye, Y., Sutcliffe, A.G., and Mehandjiev, N. Meta-design: a manifesto for end-user development. Commun. ACM 47, 9 (2004), 33--37.  ",
      "doi": "10.1145/1015864.1015884"
    },
    {
      "text": "Fischer, G., McCall, R., Ostwald, J., Reeves, B., and Shipman, F. Seeding, evolutionary growth and reseeding: supporting the incremental development of design environments. Proc. CHI '94, ACM (1994), 292--298.  ",
      "doi": "10.1145/191666.191770"
    },
    {
      "text": "Fishbein, M. and Ajzen, I. Predicting and Changing Behavior: The Reasoned Action Approach. Taylor & Francis, 2011.",
      "doi": ""
    },
    {
      "text": "Fisher,II, M., Rothermel, G., Brown, D., Cao, M., Cook, C., and Burnett, M. Integrating automated test generation into the WYSIWYT spreadsheet testing methodology. ACM Trans. Softw. Eng. Methodol. 15, 2 (2006), 150--194.  ",
      "doi": "10.1145/1131421.1131423"
    },
    {
      "text": "Gantt, M. and Nardi, B.A. Gardeners and gurus: patterns of cooperation among CAD users. Proc. CHI '92, ACM (1992), 107--117.  ",
      "doi": "10.1145/142750.142767"
    },
    {
      "text": "Haefliger, S., Krogh, G. von, and Spaeth, S. Code Reuse in Open Source Software. Manage Sci 54, 1 (2008), 180--193.  ",
      "doi": "10.1287/mnsc.1070.0748"
    },
    {
      "text": "Hochstenbach-Waelen, A. and Seelen, H.A. Embracing change: practical and theoretical considerations for successful implementation of technology assisting upper limb training in stroke. J Neuroeng Rehabil 9, (2012), 52.",
      "doi": ""
    },
    {
      "text": "Jacobs, A., Timmermans, A., Michielsen, M., Vander Plaetse, M., and Markopoulos, P. CONTRAST: Gamification of Arm-hand Training for Stroke Survivors. CHI '13 Extended Abstracts, ACM (2013), 415--420.  ",
      "doi": "10.1145/2468356.2468430"
    },
    {
      "text": "Ko, A.J., Abraham, R., Beckwith, L., et al. The state of the art in end-user software engineering. ACM Comput. Surv. 43, 3 (2011), 21:1--21:44.  ",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Lieberman, H., Paternò, F., Klann, M., and Wulf, V. End-User Development: An Emerging Paradigm. In H. Lieberman, F. Paternò and V. Wulf, eds., End User Development. Springer Netherlands, 2006, 1--8.",
      "doi": ""
    },
    {
      "text": "Maceli, M. and Atwood, M.E. From Human Crafters to Human Factors to Human Actors and Back Again: Bridging the Design Time -- Use Time Divide. Proc. ISEUD 2011, Springer Berlin Heidelberg (2011), 76--91. ",
      "doi": "10.5555/2022939.2022951"
    },
    {
      "text": "Mehandjiev, N., Sutcliffe, A., and Lee, D. Organizational View of End-User Development. In End User Development. Springer, 2006, 371--399.",
      "doi": ""
    },
    {
      "text": "Orne, M.T. Demand characteristics and the concept of quasi-controls. In Artifacts in Behavioral Research: Robert Rosenthal and Ralph L. Rosnow's Classic Books. Oxford University Press, 2009, 110--137.",
      "doi": ""
    },
    {
      "text": "Pane, J.F., Ratanamahatana, C., and Myers, B.A. Studying the language and structure in nonprogrammers' solutions to programming problems. Int J Hum-Comput St 54, 2 (2001), 237--264.  ",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "Rothermel, G., Burnett, M., Li, L., Dupuis, C., and Sheretov, A. A methodology for testing spreadsheets. ACM Trans. Softw. Eng. Methodol. 10, 1 (2001), 110--147.  ",
      "doi": "10.1145/366378.366385"
    },
    {
      "text": "De Souza, C.S., Garcia, A.C.B., Slaviero, C., Pinto, H., and Repenning, A. Semiotic traces of computational thinking acquisition. Proc. IS-EUD 2011, SpringerVerlag (2011), 155--170. ",
      "doi": "10.5555/2022939.2022958"
    },
    {
      "text": "Spahn, M. and Wulf, V. End-User Development of Enterprise Widgets. In V. Pipek, M.B. Rosson, B. de Ruyter and V. Wulf, eds., End-User Development. Springer Berlin Heidelberg, 2009, 106--125.",
      "doi": ""
    },
    {
      "text": "Szyperski, C. Component software: beyond objectoriented programming. ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 1998. ",
      "doi": "10.5555/273030"
    },
    {
      "text": "Tetteroo, D., Markopoulos, P., Timmermans, A., and Seelen, H. Rehabilitation Therapists as Software Creators' Introducing End User Development in a Healthcare Setting. Int J of Sociotechnology and Knowledge Development 6, 1 (2014), 36--50.  ",
      "doi": "10.4018/ijskd.2014010103"
    },
    {
      "text": "Tetteroo, D., Soute, I., and Markopoulos, P. Five Key Challenges in End-User Development for Tangible and Embodied Interaction. Proc. ICMI '13, (2013).  ",
      "doi": "10.1145/2522848.2522887"
    },
    {
      "text": "Timmermans, A.A., Seelen, H.A., Willmann, R.D., et al. Arm and hand skills: training preferences after stroke. Disabil Rehabil 31, (2009), 1344--52.",
      "doi": ""
    },
    {
      "text": "Timmermans, A., Seelen, H., Willmann, R., and Kingma, H. Technology-assisted training of arm-hand skills in stroke: concepts on reacquisition of motor control and therapist guidelines for rehabilitation technology design. J Neuroeng Rehabil 6, 1 (2009), 1.",
      "doi": ""
    },
    {
      "text": "Venkatesh, V., Morris, M.G., Gordon B. Davis, and Davis, F.D. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly 27, 3 (2003), pp. 425--478. ",
      "doi": "10.5555/2017197.2017202"
    }
  ]
}