{
  "doi": "10.1145/2702123.2702442",
  "title": "Improving SSL Warnings: Comprehension and Adherence",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2893-2902",
  "year": 2015,
  "badges": [],
  "abstract": "Browsers warn users when the privacy of an SSL/TLS connection might be at risk. An ideal SSL warning would empower users to make informed decisions and, failing that, guide confused users to safety. Unfortunately, users struggle to understand and often disregard real SSL warnings. We report on the task of designing a new SSL warning, with the goal of improving comprehension and adherence. We designed a new SSL warning based on recommendations from warning literature and tested our proposal with microsurveys and a field experiment. We ultimately failed at our goal of a well-understood warning. However, nearly 30% more total users chose to remain safe after seeing our warning. We attribute this success to opinionated design, which promotes safety with visual cues. Subsequently, our proposal was released as the new Google Chrome SSL warning. We raise questions about warning comprehension advice and recommend that other warning designers use opinionated design.",
  "tags": [
    "ssl",
    "tls/ssl",
    "design",
    "https",
    "google consumer surveys",
    "security",
    "warnings",
    "microsurveys"
  ],
  "authors": [
    {
      "name": "Adrienne Porter Felt",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548017295",
      "orcid": "missing"
    },
    {
      "name": "Alex Ainslie",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487460",
      "orcid": "missing"
    },
    {
      "name": "Robert W. Reeder",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81100651314/rel-imgonly/robthreequarterssmilemikemurphyportrait.jpg",
      "acmid": "81100651314",
      "orcid": "missing"
    },
    {
      "name": "Sunny Consolvo",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459425",
      "orcid": "0000-0001-5337-328X"
    },
    {
      "name": "Somas Thyagaraja",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700859",
      "orcid": "missing"
    },
    {
      "name": "Alan Bettes",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658695916",
      "orcid": "missing"
    },
    {
      "name": "Helen Harris",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659281292",
      "orcid": "missing"
    },
    {
      "name": "Jeff Grimes",
      "institution": "University of Pennsylvania, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658698138",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akhawe, D., and Felt, A. P. Alice in Warningland: A Large-Scale Field Study of Browser Security Warning Effectiveness. In USENIX Security Symposium (2013). ",
      "doi": "10.5555/2534766.2534789"
    },
    {
      "text": "Almuhimedi, H., Felt, A. P., Reeder, R. W., and Consolvo, S. Your Reputation Precedes You: History, Reputation, and the Chrome Malware Warning. In SOUPS (2014).",
      "doi": ""
    },
    {
      "text": "Anderson, R. E., and Jolson, M. A. Technical wording in advertising: implications for market segmentation. Journal of Marketing 44 (1980).",
      "doi": ""
    },
    {
      "text": "ANSI. Product safety signs and labels: Z535.4.",
      "doi": ""
    },
    {
      "text": "Arron, J., Egans, R., and Mela, D. Paradoxical Effect of a Nutrition Labeling Scheme in a Student Cafeteria. Nutritional Research 15 (September 1995).",
      "doi": ""
    },
    {
      "text": "Bauer, L., Bravo-Lillo, C., Cranor, L. F., and Fragkaki, E. Warning design guidelines (cmu-cylab-13-002).",
      "doi": ""
    },
    {
      "text": "Biddle, R., van Oorschot, P., Patrick, A. S., Sobey, J., and Whalen, T. Browser interfaces and extended validation ssl certificates: an empirical study. In ACM Workshop on Cloud Computing Security (2009).  ",
      "doi": "10.1145/1655008.1655012"
    },
    {
      "text": "Braun, C. C., Greeno, B., and Silter, N. C. Differences in behavioral compliance as a function of warning color. In Human Factors and Ergonomics Society Annual Meeting (1998).",
      "doi": ""
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L., Komanduri, S., Schechter, S., and Sleeper, M. Harder to ignore?: Revisiting pop-up fatigue and approaches to prevent it. In SOUPS (2014).",
      "doi": ""
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L. F., Downs, J., and Komanduri, S. Bridging the gap in computer security warnings: A mental model approach. IEEE Security and Privacy 9, 2 (2011).  ",
      "doi": "10.1109/MSP.2010.198"
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L. F., Downs, J., Komanduri, S., Reeder, R. W., Schechter, S., and Sleeper, M. Your attention please: Designing security-decision uis to make genuine risks harder to ignore. In SOUPS (2013).  ",
      "doi": "10.1145/2501604.2501610"
    },
    {
      "text": "Breznitz, S. Cry Wolf: The Psychology of False Alarms.",
      "doi": ""
    },
    {
      "text": "Bzostek, J. A., and Wogalter, M. S. Measuring visual search time for a product warning label as a function of icon, color, column, and vertical placement. In Human Factors and Ergonomics Society Annual Meeting (1999).",
      "doi": ""
    },
    {
      "text": "Dhamija, R., Tygar, J. D., and Hearst, M. A. Why phishing works. In CHI (2006).  ",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Edworthy, J., and Adams, A. Warning design: a research perspective. Taylor and Francis, 1996.",
      "doi": ""
    },
    {
      "text": "Egelman, S., Cranor, L. F., and Hong, J. You've been warned: an empirical study of the effectiveness of web browser phishing warnings. In CHI (2008).  ",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "Egelman, S., and Schechter, S. The importance of being earnest {in security warnings}. In Financial Cryptography and Data Security, Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2013.",
      "doi": ""
    },
    {
      "text": "Felt, A. P., Reeder, R. W., Almuhimedi, H., and Consolvo, S. Experimenting At Scale With Google Chrome's SSL Warning. In CHI (2014).  ",
      "doi": "10.1145/2556288.2557292"
    },
    {
      "text": "Fischhoff, B., Riley, D., Kovacs, D. C., and Small, M. What information belongs in a warning? Psychology Marketing 15, 7 (1998).",
      "doi": ""
    },
    {
      "text": "Frantz, J. P. Effect of location and procedural explicitness on user process of and compliance with product warnings. Human Factors 36 (1994).",
      "doi": ""
    },
    {
      "text": "Frutiger, A. Signs and symbols: their design and meaning. Von Nostrand Reinhold, 1989.",
      "doi": ""
    },
    {
      "text": "Glover, B. L., and Wogalter, M. S. Using a computer simulated world to study behavior compliance with warnings: effect of salience and gender. In Human Factors Society Annual Meeting (1997).",
      "doi": ""
    },
    {
      "text": "Hancock, H., Bowles, C. T., Rogers, W. A., and Fisk, A. D. Comprehension and retention of warning information. Handbook of warnings (2006).",
      "doi": ""
    },
    {
      "text": "Hartley, J. Designing instructional text, 3 ed. Kagan Page and Nichols, 1994.",
      "doi": ""
    },
    {
      "text": "Kalsher, M. J., Wogalter, M. S., and Racicot, B. M. Pharmaceutical container labels and warnings: preference and perceived readability of alternative designs and pictorials. International Journal of Industrial Ergonomics 18 (1996).",
      "doi": ""
    },
    {
      "text": "Laughery, K. R., and Stanush, J. A. Effects of warning explicitness on product perceptions. In Human Factors Society (1989).",
      "doi": ""
    },
    {
      "text": "Laughery, K. R., and Vaubel, K. P. Explicitness in consequence information in warnings. Safety Science 16 (1993).",
      "doi": ""
    },
    {
      "text": "Laughery, K. R., Young, S. L., Vaubel, K. P., and Brelsford, J. W. The noticeability of warnings on alcoholic beverage containers. Journal of Public Policy and Marketing 12 (1993).",
      "doi": ""
    },
    {
      "text": "McDonald, P., Mohebbi, M., and Slatkin, B. Comparing Google Consumer Surveys to Existing Probability and Non-Probability Based Internet Survey. In Google Whitepaper (2012).",
      "doi": ""
    },
    {
      "text": "McLaughlin, G. H. Smog grading -- a new readability formula. Journal of Reading (1969).",
      "doi": ""
    },
    {
      "text": "Morrow, D. G., Hier, C. M., Mendard, W. E., and Leirer, V. O. Icons improve older and younger adults' comprehension of medication information. Journal of Gerontology: Psychological Sciences 53B (1998).",
      "doi": ""
    },
    {
      "text": "Reeder, R., Kowalczyk, E. C., and Shostack, A. Poster: Helping engineers design NEAT security warnings. In SOUPS (2011).",
      "doi": ""
    },
    {
      "text": "Research, P. A Comparison of Results from Surveys by the Pew Research Center and Google Consumer Surveys.",
      "doi": ""
    },
    {
      "text": "Schechter, S. E., Dhamija, R., Ozment, A., and Fischer, I. The emperor's new security indicators. In IEEE Symposium on Security and Privacy (2007).  ",
      "doi": "10.1109/SP.2007.35"
    },
    {
      "text": "Schwanda-Sosik, V., Bursztein, E., , Consolvo, S., Huffaker, D. A., Kossinets, G., Liao, K., McDonald, P., and Sedley, A. Online Microsurveys for User Experience Research. In CHI (Extended Abstracts) (2014).  ",
      "doi": "10.1145/2559206.2559975"
    },
    {
      "text": "Silver, N., Leonard, D. C., Ponsi, K. A., and Wogalter, M. S. Warnings and purchase intentions for pest-control products. Forensic Reports 4 (1991).",
      "doi": ""
    },
    {
      "text": "Sotirakopoulos, A., Hawkey, K., and Beznosov, K. On the Challenges in Usable Security Lab Studies: Lessons Learned from Replicating a Study on SSL Warnings. In SOUPS (2011).  ",
      "doi": "10.1145/2078827.2078831"
    },
    {
      "text": "Sunshine, J., Egelman, S., Almuhimedi, H., Atri, N., and Cranor, L. F. Crying Wolf: An Empirical Study of SSL Warning Effectiveness. In USENIX Security Symposium (2009). ",
      "doi": "10.5555/1855768.1855793"
    },
    {
      "text": "Thorley, P., Hellier, E., and Edworthy, J. Habituation effects in visual warnings. Contemporary ergonomics (2001).",
      "doi": ""
    },
    {
      "text": "Trommelen, M. Effectiveness of explicit warnings. Safety Science 25 (1997).",
      "doi": ""
    }
  ]
}