{
  "doi": "10.1145/2702123.2702153",
  "title": "You Tweet What You Eat: Studying Food Consumption Through Twitter",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3197-3206",
  "year": 2015,
  "badges": [],
  "abstract": "Food is an integral part of our lives, cultures, and well-being, and is of major interest to public health. The collection of daily nutritional data involves keeping detailed diaries or periodic surveys and is limited in scope and reach. Alternatively, social media is infamous for allowing its users to update the world on the minutiae of their daily lives, including their eating habits. In this work we examine the potential of Twitter to provide insight into US-wide dietary choices by linking the tweeted dining experiences of 210K users to their interests, demographics, and social networks. We validate our approach by relating the caloric values of the foods mentioned in the tweets to the state-wide obesity rates, achieving a Pearson correlation of 0.77 across the 50 US states and the District of Columbia. We then build a model to predict county-wide obesity and diabetes statistics based on a combination of demographic variables and food names mentioned on Twitter. Our results show significant improvement over previous CHI research (Culotta 2014). We further link this data to societal and economic factors, such as education and income, illustrating that areas with higher education levels tweet about food that is significantly less caloric. Finally, we address the somewhat controversial issue of the social nature of obesity (Christakis & Fowler 2007) by inducing two social networks using mentions and reciprocal following relationships.",
  "authors": [
    {
      "name": "Sofiane Abbar",
      "institution": "Qatar Computing Research Institute, Doha, Qatar",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81413607009",
      "orcid": "missing"
    },
    {
      "name": "Yelena Mejova",
      "institution": "Qatar Computing Research Institute, Doha, Qatar",
      "img": "/do/10.1145/contrib-81438596595/rel-imgonly/by_black_wall_1square.jpg",
      "acmid": "81438596595",
      "orcid": "missing"
    },
    {
      "name": "Ingmar Weber",
      "institution": "Qatar Computing Research Institute, Doha, Qatar",
      "img": "/do/10.1145/contrib-81309503156/rel-imgonly/dr.ingmarweber-copy.jpg",
      "acmid": "81309503156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abisheva, A., Garimella, V. R. K., Garcia, D., and Weber, I. Who watches (and shares) what on youtube? and when?: using twitter to understand youtube viewership. In WSDM (2014).  ",
      "doi": "10.1145/2556195.2566588"
    },
    {
      "text": "Ahn, Y.-Y., Ahnert, S. E., Bagrow, J. P., and Barabási, A.-L. Flavor network and the principles of food pairing. Nature Scientific reports (2011).",
      "doi": ""
    },
    {
      "text": "Aramaki, E., Maskawa, S., and Morita, M. Twitter catches the flu: Detecting influenza epidemics using twitter. In EMNLP (2011). ",
      "doi": "10.5555/2145432.2145600"
    },
    {
      "text": "Bian, J., Topaloglu, U., and Yu, F. Towards large-scale twitter mining for drug-related adverse events. In SHB (2012).  ",
      "doi": "10.1145/2389707.2389713"
    },
    {
      "text": "Cawley, J., and Meyerhoefer, C. The medical care costs of obesity: an instrumental variables approach. Journal of health economics 31, 1 (2012), 219--230.",
      "doi": ""
    },
    {
      "text": "Christakis, N. A., and Fowler, J. H. The spread of obesity in a large social network over 32 years. New England journal of medicine 357, 4 (2007), 370--379.",
      "doi": ""
    },
    {
      "text": "Chunara, R., Bouton, L., Ayers, J. W., and Brownstein, J. S. Assessing the online social environment for surveillance of obesity prevalence. PloS one 8, 4 (2013), e61373.",
      "doi": ""
    },
    {
      "text": "Cohen-Cole, E., and Fletcher, J. M. Is obesity contagious? social networks vs. environmental factors in the obesity epidemic. Journal of Health Economics 27, 5 (2008), 1382--1387.",
      "doi": ""
    },
    {
      "text": "Culotta, A. Lightweight methods to estimate influenza rates and alcohol sales volume from twitter messages. Language Resources and Evaluation (2013), 1--22.  ",
      "doi": "10.1007/s10579-012-9185-0"
    },
    {
      "text": "Culotta, A. Estimating county health statistics with twitter. In CHI (2014).  ",
      "doi": "10.1145/2556288.2557139"
    },
    {
      "text": "Cutler, D. M., Glaeser, E. L., and Shapiro, J. M. Why have americans become more obese? Journal of Economic Perspectives 17 (2003), 93--118.",
      "doi": ""
    },
    {
      "text": "de Castro, J. M. Seasonal rhythms of human nutrient intake and meal pattern. Physiology & behavior 50, 1 (1991), 243--248.",
      "doi": ""
    },
    {
      "text": "Donohew, L., Ray, E., and Donohew, L. Public health campaigns: Individual message strategies and a model. Communication and health: Systems and applications (1990), 136--152.",
      "doi": ""
    },
    {
      "text": "Fischler, C. Food, self and identity. Social science information 27, 2 (1988), 275--292.",
      "doi": ""
    },
    {
      "text": "Gershenson, C., Gasca-González, O. O., Delgado-Reyes, L., Pérez-Cruz, J. C., Orozco-Gómez, L. P., Hernández-Salazar, L., Moguel-Ancheita, S., Ramírez-Moreno, M. A., Morales-Cruz, M. V., Cortés-Gastélum, M. A., et al. Epidemiology and social networks. Cir Cir 79 (2011), 199--200.",
      "doi": ""
    },
    {
      "text": "Haimson, O. L., Brubaker, J. R., and Hayes, G. R. Ddfseeks same: Sexual health-related language in online personal ads for men who have sex with men. In CHI (2014).  ",
      "doi": "10.1145/2556288.2557077"
    },
    {
      "text": "Kooti, F., Mason, W. A., Gummadi, K. P., and Cha, M. Predicting emerging social conventions in online social networks. In CIKM (2012).  ",
      "doi": "10.1145/2396761.2396820"
    },
    {
      "text": "Paul, M. J., and Dredze, M. You are what you tweet: Analyzing twitter for public health. In ICWSM (2011).",
      "doi": ""
    },
    {
      "text": "Prier, K. W., Smith, M. S., Giraud-Carrier, C., and Hanson, C. L. Identifying health-related topics on twitter. In Social computing, behavioral-cultural modeling and prediction. Springer, 2011, 18--25. ",
      "doi": "10.5555/1964698.1964702"
    },
    {
      "text": "Romero, D. M., Meeder, B., and Kleinberg, J. Differences in the mechanics of information diffusion across topics: idioms, political hashtags, and complex contagion on twitter. In WWW (2011).  ",
      "doi": "10.1145/1963405.1963503"
    },
    {
      "text": "Sadilek, A., and Kautz, H. Modeling the impact of lifestyle on health at scale. In WSDM (2013).  ",
      "doi": "10.1145/2433396.2433476"
    },
    {
      "text": "Schwartz, H. A., Eichstaedt, J. C., Kern, M. L., Dziurzynski, L., Agrawal, M., Park, G. J., Lakshmikanth, S. K., Jha, S., Seligman, M. E., Ungar, L., et al. Characterizing geographic variation in well-being using tweets. In ICWSM (2013).",
      "doi": ""
    },
    {
      "text": "Silva, T. H., Vaz de Melo, P. O. S., Almeida, J., Musolesi, M., and Loureiro, A. You Are What You Eat (and Drink): Identifying Cultural Boundaries by Analyzing Food and Drink Habits in Foursquare. In ICWSM (2014).",
      "doi": ""
    },
    {
      "text": "Takhteyev, Y., Gruzd, A., and Wellman, B. Geography of twitter networks. Social networks 34, 1 (2012), 73--81.",
      "doi": ""
    },
    {
      "text": "Valente, T. W. Social network thresholds in the diffusion of innovations. Social networks 18, 1 (1996), 69--89.",
      "doi": ""
    },
    {
      "text": "Wagner, C., Singer, P., and Strohmaier, M. Spatial and Temporal Patterns of Online Food Preferences. In WWW (Republic and Canton of Geneva, Switzerland, 2014).  ",
      "doi": "10.1145/2567948.2576951"
    },
    {
      "text": "West, R., White, R. W., and Horvitz, E. From cookies to cooks: insights on dietary patterns via analysis of web usage logs. In WWW (2013). ",
      "doi": "10.1145/2488388.2488510"
    },
    {
      "text": "Xie, W., Li, C., Zhu, F., Lim, E.-P., and Gong, X. When a friend in twitter is a friend in life. In WebSci (2012).  ",
      "doi": "10.1145/2380718.2380763"
    },
    {
      "text": "Yom-Tov, E., Fernandez-Luque, L., Weber, I., and Crain, S. P. Pro-anorexia and pro-recovery photo sharing: a tale of two warring tribes. Journal of medical Internet research 14, 6 (2012).",
      "doi": ""
    },
    {
      "text": "Zhu, Y.-X., Huang, J., Zhang, Z.-K., Zhang, Q.-M., Zhou, T., and Ahn, Y.-Y. Geography and similarity of regional cuisines in china. PloS one 8, 11 (2013), e79161.",
      "doi": ""
    }
  ]
}