{
  "doi": "10.1145/2702123.2702150",
  "title": "Display Blindness?: Looking Again at the Visibility of Situated Displays using Eye-tracking",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3889-3898",
  "year": 2015,
  "badges": [],
  "abstract": "Observational studies of situated displays have suggested that they are rarely looked at, and when they are it is typically only for a short period of time. Using a mobile eye tracker during a realistic shopping task in a shopping center, we show that people look at displays more than would be predicted from these observational studies, but still only short glances and often from quite far away. We characterize the patterns of eye-movements that precede looking at a display and discuss some of the design implications for the design of situated display technologies that are deployed in public space.",
  "tags": [
    "space",
    "eye tracking",
    "display blindness",
    "public displays"
  ],
  "authors": [
    {
      "name": "Nicholas S. Dalton",
      "institution": "Open University, Milton Keyen, United Kingdom",
      "img": "/do/10.1145/contrib-81100572218/rel-imgonly/me.jpg",
      "acmid": "81100572218",
      "orcid": "missing"
    },
    {
      "name": "Emily Collins",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658635647",
      "orcid": "missing"
    },
    {
      "name": "Paul Marshall",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    }
  ],
  "references": [
    {
      "text": "Akpan, I., Marshall, P., Bird, J., and Harrison, D. Exploring the effects of space and place on engagement with an interactive installation. In Proc. CHI 2013,, ACM Press (2013), 2213--2222.  ",
      "doi": "10.1145/2470654.2481306"
    },
    {
      "text": "Alt, F., Schneegaß, S., Schmidt, A., Müller, J., and Memarovic, N. How to Evaluate Public Displays. In Proc. PerDis 2012, ACM Press (2012), 17:1--17:6.  ",
      "doi": "10.1145/2307798.2307815"
    },
    {
      "text": "Arthur, P. and Passini, R. Wayfinding: people, signs, and architecture. 1992.",
      "doi": ""
    },
    {
      "text": "Brignull, H. and Rogers, Y. Enticing people to interact with large public displays in public spaces. In Proc. INTERACT, (2003), 17--24.",
      "doi": ""
    },
    {
      "text": "Churchill, E.F., Nelson, L., and Denoue, L. Multimedia fliers: Information sharing with digital community bulletin boards. In Proc. C&T 2003, Springer (2003), 97--117. ",
      "doi": "10.5555/966263.966269"
    },
    {
      "text": "Dennis, C., Brakus, J.J., Gupta, S., and Alamanos, E. The effect of digital signage on shoppers' behavior: The role of the evoked experience. Journal of Business Research 67, 11 (2014), 2250--2257.",
      "doi": ""
    },
    {
      "text": "Farnham, S.D., McCarthy, J.F., Patel, Y., et al. Measuring the impact of third place attachment on the adoption of a place-based community technology. In Proc CHI 2009, ACM Press (2009), 2153--2156.  ",
      "doi": "10.1145/1518701.1519028"
    },
    {
      "text": "Hayhoe, M. and Ballard, D. Eye movements in natural behavior. Trends in Cognitive Sciences 9, 4 (2005), 188--194.",
      "doi": ""
    },
    {
      "text": "Höller, N., Schrammel, J., Tscheligi, M., and Paletta, L. The Perception of Information and Advertisement Screens Mounted in Public Transportation VehiclesResults from a Mobile Eye-tracking Study. In Proc. 2nd Workshop on Pervasive Advertising, (2009).",
      "doi": ""
    },
    {
      "text": "Houben, S. and Weichel, C. Overcoming interaction blindness through curiosity objects. In Proc. CHI'13 Extended Abstracts, ACM Press (2013), 1539--1544.  ",
      "doi": "10.1145/2468356.2468631"
    },
    {
      "text": "Houde, S., Bellamy, R., and Leahy, L. In search of design principles for tools and practices to support communication within a learning community. ACM SIGCHI Bulletin 30, 2 (1998), 113--118.  ",
      "doi": "10.1145/279044.279171"
    },
    {
      "text": "Huang, E.M., Koster, A., and Borchers, J. Overcoming assumptions and uncovering practices: When does the public really look at public displays? In Proc. Pervasive Computing. Springer, 2008, 228--243.  ",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Itti, L. and Baldi, P.F. Bayesian surprise attracts human attention. Advances in Neural Information Processing Systems, (2005), 547--554.",
      "doi": ""
    },
    {
      "text": "Jacob, R.J. and Karn, K.S. Eye tracking in humancomputer interaction and usability research: Ready to deliver the promises. Mind 2, 3 (2003), 4.",
      "doi": ""
    },
    {
      "text": "Kipp, M. and others. Spatiotemporal Coding in ANVIL. LREC, (2008).",
      "doi": ""
    },
    {
      "text": "Kukka, H., Oja, H., Kostakos, V., Goncalves, J., and Ojala, T. What makes you click: exploring visual signals to entice interaction on public displays. In Proc. CHI 2013, ACM Press (2013), 1699--1708.  ",
      "doi": "10.1145/2470654.2466225"
    },
    {
      "text": "Marquardt, N., Ballendat, T., Boring, S., Greenberg, S., and Hinckley, K. Gradual engagement: facilitating information exchange between digital devices as a function of proximity. In Proc. ITS 2012, ACM Press (2012), 31--40.  ",
      "doi": "10.1145/2396636.2396642"
    },
    {
      "text": "Michelis, D. and Müller, J. The audience funnel: Observations of gesture based interaction with multiple large displays in a city center. Intl. Journal of Human-Computer Interaction 27, 6 (2011), 562--579.",
      "doi": ""
    },
    {
      "text": "Müller, H.J. and Rabbitt, P.M. Reflexive and voluntary orienting of visual attention: time course of activation and resistance to interruption. Journal of Experimental Psychology: Human Perception and Performance 15, 2 (1989), 315.",
      "doi": ""
    },
    {
      "text": "Müller, J., Alt, F., Michelis, D., and Schmidt, A. Requirements and Design Space for Interactive Public Displays. In Proc. MM 2010., ACM Press (2010), 1285--1294.  ",
      "doi": "10.1145/1873951.1874203"
    },
    {
      "text": "Müller, J. and Krüger, A. MobiDiC: context adaptive digital signage with coupons. Springer, 2009.",
      "doi": ""
    },
    {
      "text": "Müller, J., Walter, R., Bailly, G., Nischt, M. and Alt, F. Looking glass: a field study on noticing interactivity of a shop window. In Proc. CHI 2012, ACM Press (2012), 297--306.  ",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "Müller, J., Wilmsmann, D., Exeler, J., et al. Display blindness: The effect of expectations on attention towards digital signage. In Proc. Pervasive Computing. Springer (2009), 1--8.  ",
      "doi": "10.1007/978-3-642-01516-8_1"
    },
    {
      "text": "O'Hara, K., Glancey, M. and Robertshaw, S. Collective play in an urban screen game. In Proc. CSCW '08, ACM Press (2008), 67--75.  ",
      "doi": "10.1145/1460563.1460576"
    },
    {
      "text": "Ojala, T., Kostakos, V., Kukka, H., et al. Multipurpose interactive public displays in the wild: Three years later. Computer 45, 5 (2012), 42--49.  ",
      "doi": "10.1109/MC.2012.115"
    },
    {
      "text": "Peltonen, P., Kurvinen, E., Salovaara, A., et al. It's Mine, Don'T Touch!: Interactions at a Large Multitouch Display in a City Centre. In Proc. CHI 2008, ACM Press (2008), 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Ravnik, R. and Solina, F. Audience measurement of digital signage: Quantitative study in real-world environment using computer vision. Interacting with Computers 25, 3 (2013), 218--228.",
      "doi": ""
    },
    {
      "text": "Rothkopf, C.A., Ballard, D.H., and Hayhoe, M.M. Task and context determine where you look. Journal of Vision 7, 14 (2007), 16.",
      "doi": ""
    },
    {
      "text": "Schrammel, J., Mattheiss, E., Döbelt, S., Paletta, L., Almer, A., and Tscheligi, M. Attentional behavior of users on the move towards pervasive advertising media. In Pervasive Advertising. Springer, 2011, 287--307.",
      "doi": ""
    },
    {
      "text": "Taylor, N., Cheverst, K., Fitton, D., Race, N.J., Rouncefield, M., and Graham, C. Probing communities: study of a village photo display. In Proc. OzCHI, ACM Press (2007), 17--24.  ",
      "doi": "10.1145/1324892.1324896"
    }
  ]
}