{
  "doi": "10.1145/2702123.2702475",
  "title": "Multimodal Analysis in Participatory Design with Children: A Primary School Case Study",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2825-2828",
  "year": 2015,
  "badges": [],
  "abstract": "We describe a multimodal method for the analysis of co-design outcomes in participatory design (PD) with children. The multimodal approach we take allows researchers to treat both verbal (notes, writings) and tangible material out-comes as complementary ways of communicating design ideas. We argue that an integrated approach in which both PD outcomes are compared and contrasted can result in a richer analysis, in which underlying values can be identified more clearly. To illustrate the method, we describe a PD process with primary school children.",
  "tags": [
    "participatory design",
    "values",
    "multimodality"
  ],
  "authors": [
    {
      "name": "Jan Derboven",
      "institution": "iMinds - KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472656556",
      "orcid": "missing"
    },
    {
      "name": "Maarten Van Mechelen",
      "institution": "iMinds - KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556774356",
      "orcid": "missing"
    },
    {
      "name": "Karin Slegers",
      "institution": "iMinds - KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442598065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bardzell, J. (2011). Interaction criticism: An introduction to the practice. Interact. Comput. 23(6), 604--621.  ",
      "doi": "10.1016/j.intcom.2011.07.001"
    },
    {
      "text": "Bjerknes, G. Ehn, P., and Kyng, M. (1987) . Computers and democracy: A Scandinavian challenge. Brookfield.",
      "doi": ""
    },
    {
      "text": "Buckingham, D. (2009). 'Creative' visual methods in media research: possibilities, problems and proposals. Media, Culture and Society, 31, 633--652.",
      "doi": ""
    },
    {
      "text": "Guha, M.L., Druin, A. & Fails, J.A. (2013). Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. Int. J. of Child-Computer Interaction, 1(1), 14--23.",
      "doi": ""
    },
    {
      "text": "Halloran, J., Hornecker, E., & Stringer, M. (2009). The value of values: Resourcing co-design of ubiquitous computing. CoDesign 4 (5), 245--273.",
      "doi": ""
    },
    {
      "text": "Iversen, O.S., Halskov, K., & Leong, T.W. (2010). Rekindling values in participatory design. In Proc. PDC '10, p. 92--100. ACM Press.  ",
      "doi": "10.1145/1900441.1900455"
    },
    {
      "text": "Jewitt, C. (2013) Multimodal Methods for Researching Digital Technologies. In: Price, S., Jewitt, C., Brown, B. (Eds.) The SAGE Handbook of Digital Technology Research, pp. 250--265. Sage.",
      "doi": ""
    },
    {
      "text": "Kress, G. (2010) Multimodality. A Social Semiotic Approach to Contemporary Communication. Routledge.",
      "doi": ""
    },
    {
      "text": "Rokeach, M. (1973). The Nature of Human Values. Free Press.",
      "doi": ""
    },
    {
      "text": "Scaife, M. and Rogers, Y. (1999). Kids as informants: Telling us what we didn't know or confirming what we knew already, in A. Druin (Ed.), The design of children's technology, pp.29--50. Morgan Kaufmann. ",
      "doi": "10.5555/303430.303434"
    },
    {
      "text": "Schön, D. (1984). The Reflective Practitioner: How Professionals Think In Action. Basic Books.",
      "doi": ""
    },
    {
      "text": "Schuler, D. and Namioka, A. (1993). Participatory Design: Principles and Practices. L. Erlbaum Assoc. Inc. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Sleeswijk Visser, F., Stappers, P.J., van der Lugt, R., Sanders, E.B.N. (2005). Contextmapping: Experiences from practice. CoDesign 1(2), 119--149.",
      "doi": ""
    },
    {
      "text": "Spinuzzi C., 2005, The Methodology of Participatory Design. In: Technical Communication. 52 (2), 163--175.",
      "doi": ""
    },
    {
      "text": "Van Mechelen, M., Gielen, M., Vanden Abeele, V., Laenen, A. and Zaman, B. (2014). Exploring challenging group dynamics in participatory design with children. In Proc. IDC '14 , 269--272. ACM Press.  ",
      "doi": "10.1145/2593968.2610469"
    },
    {
      "text": "Walsh, G., Druin, A., Guha, M.L., Foss, E., Golub, E., Hatley, L., Bonsignore, E. and Franckel, S. (2010) Layered elaboration: a new technique for co-design with children. In Proc. CHI 2010, 1237--1240. ACM Press.  ",
      "doi": "10.1145/1753326.1753512"
    }
  ]
}