{
  "doi": "10.1145/2702123.2702295",
  "title": "Open Book: A Socially-inspired Cloaking Technique that Uses Lexical Abstraction to Transform Messages",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "477-486",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Both governments and corporations routinely surveil computer-mediated communication (CMC). Technologists often suggest widespread encryption as a defense mechanism, but CMC encryption schemes have historically faced significant usability and adoption problems. Here, we introduce a novel technique called Open Book designed to address these two problems. Inspired by how people deal with eavesdroppers offline, Open Book uses data mining and natural language processing to transform CMC messages into ones that are vaguer than the original. Specifically, we present: 1) a greedy Open Book algorithm that cloaks messages by transforming them to resemble the average Internet message; 2) an open-source, browser-based instantiation of it called Read Me, designed for Gmail; and, 3) a set of experiments showing that intended recipients can decode Open Book messages, but that unintended human- and machine-recipients cannot. Finally, we reflect on some open questions raised by this approach, such as recognizability and future side-channel attacks.",
  "authors": [
    {
      "name": "Eric Gilbert",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489255",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1. L. Backstrom and J. Kleinberg. Romantic partnerships and the dispersion of social ties: A network analysis of relationship status on Facebook. In Proc. CSCW, pages 831--841, 2014.  ",
      "doi": "10.1145/2531602.2531642"
    },
    {
      "text": "2. C. Baker, C. Fillmore, and J. B. Lowe. The Berkeley FrameNet Project. In Proc. COLING, pages 86--90, 1998.  ",
      "doi": "10.3115/980845.980860"
    },
    {
      "text": "3. P. Biernacki and D. Waldorf. Snowball Sampling: Problems and Techniques of Chain Referral Sampling. Sociological Methods & Research, 10(2):141--163, 1981.",
      "doi": ""
    },
    {
      "text": "4. D. M. Blei, A. Y. Ng, and M. I. Jordan. Latent dirichlet allocation. JMLR, 3:993--1022, 2003. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "5. M. S. Blumenthal and D. D. Clark. Rethinking the design of the Internet: the end-to-end arguments vs. the brave new world. ACM TOIT, 1(1):70--109, 2001.  ",
      "doi": "10.1145/383034.383037"
    },
    {
      "text": "6. D. Boneh et al. Twenty years of attacks on the RSA cryptosystem. Notices of the AMS, 46(2):203--213, 1999.",
      "doi": ""
    },
    {
      "text": "7. boyd, danah and Marwick, Alice. Social Privacy in Networked Publics: Teens' Attitudes, Practices, and Strategies. In A Decade in Internet Time: Symposium on the Dynamics of the Internet and Society, 1999.",
      "doi": ""
    },
    {
      "text": "8. T. Brants and A. Franz. Web 1T 5-gram Version 1. Linguistic Data Consortium, Philadelphia, 2006.",
      "doi": ""
    },
    {
      "text": "9. S. E. Brennan. The grounding problem in conversations with and through computers. Social and cognitive approaches to interpersonal communication, pages 201--225, 1998.",
      "doi": ""
    },
    {
      "text": "10. R. S. Campbell and J. W. Pennebaker. The secret life of pronouns flexibility in writing style and physical health. Psychological Science, 14(1):60--65, 2003.",
      "doi": ""
    },
    {
      "text": "11. J. Chen, G. Hsieh, J. U. Mahmud, and J. Nichols. Understanding individuals' personal values from social media word use. In Proc. CSCW, pages 405--414, 2014.  ",
      "doi": "10.1145/2531602.2531608"
    },
    {
      "text": "12. C. Chung and J. W. Pennebaker. The psychological functions of function words. Social communication, pages 343--359, 2007.",
      "doi": ""
    },
    {
      "text": "13. H. H. Clark. Using language, volume 1996. Cambridge University Press Cambridge, 1996.",
      "doi": ""
    },
    {
      "text": "14. H. H. Clark and S. E. Brennan. Grounding in communication. Perspectives on socially shared cognition, 13(1991):127--149, 1991.",
      "doi": ""
    },
    {
      "text": "15. H. H. Clark and M. A. Krych. Speaking while monitoring addressees for understanding. Journal of Memory and Language, 50(1):62--81, 2004.",
      "doi": ""
    },
    {
      "text": "16. W. Diffie and M. E. Hellman. New directions in cryptography. IEEE Transactions on Information Theory, 22(6):644--654, 1976.  ",
      "doi": "10.1109/TIT.1976.1055638"
    },
    {
      "text": "17. D. Gergle, R. E. Kraut, and S. R. Fussell. The impact of delayed visual feedback on collaborative performance. In Proc. CHI, pages 1303--1312. ACM, 2006.  ",
      "doi": "10.1145/1124772.1124968"
    },
    {
      "text": "18. G. Greenwald and E. MacAskill. NSA Prism program taps in to user data of Apple, Google and others. The Guardian, June 6, 2013.",
      "doi": ""
    },
    {
      "text": "19. J. T. Hancock and P. J. Dunham. Language use in computer-mediated communication: The role of coordination devices. Discourse Processes, 31(1):91--110, 2001.",
      "doi": ""
    },
    {
      "text": "20. S. G. Hart and L. E. Staveland. Development of NASA-TLX (task load index): Results of empirical and theoretical research. Human mental workload, 1(3):139--183, 1988.",
      "doi": ""
    },
    {
      "text": "21. P. J. Hinds and D. E. Bailey. Out of sight, out of sync: Understanding conflict in distributed teams. Organization science, 14(6):615--632, 2003.  ",
      "doi": "10.1287/orsc.14.6.615.24872"
    },
    {
      "text": "22. F. Jin, R. P. Khandpur, N. Self, E. Dougherty, S. Guo, F. Chen, B. A. Prakash, and N. Ramakrishnan. Modeling Mass Protest Adoption in Social Network Communities Using Geometric Brownian Motion. In Proc. KDD, pages 1660--1669, 2014.  ",
      "doi": "10.1145/2623330.2623376"
    },
    {
      "text": "23. B. Klimt and Y. Yang. Introducing the Enron Corpus. In CEAS, 2004.",
      "doi": ""
    },
    {
      "text": "24. G. Miller. WordNet: A Lexical Database for English. CACM, 38(11):39--41, 1995.  ",
      "doi": "10.1145/219717.219748"
    },
    {
      "text": "25. C. Z. Mooney and R. D. Duval. Bootstrapping: A nonparametric approach to statistical inference. 1993.",
      "doi": ""
    },
    {
      "text": "26. R. L. Rivest, A. Shamir, and L. Adleman. A method for obtaining digital signatures and public-key cryptosystems. CACM, 21(2):120--126, 1978.  ",
      "doi": "10.1145/359340.359342"
    },
    {
      "text": "27. N. S. Shami, J. Nichols, and J. Chen. Social Media Participation and Performance at Work: A Longitudinal Study. In Proc. CHI, pages 115--118, 2014.  ",
      "doi": "10.1145/2556288.2557417"
    },
    {
      "text": "28. S. Sheng, L. Broderick, C. A. Koranda, and J. J. Hyland. Why Johnny still can't encrypt: evaluating the usability of email encryption software. In Proc. SOUPS, 2006.",
      "doi": ""
    },
    {
      "text": "29. N. Spasojevic, J. Yan, A. Rao, and P. Bhattacharyya. LASTA: Large Scale Topic Assignment on Multiple Social Networks. In Proc. KDD, pages 1809--1818, 2014.  ",
      "doi": "10.1145/2623330.2623350"
    },
    {
      "text": "30. S. Subramaniam. Frontiers in E-commerce Personalization. In Proc. KDD, pages 1516--1516, 2014.  ",
      "doi": "10.1145/2623330.2630820"
    },
    {
      "text": "31. J. Vertesi. My Experiment Opting Out of Big Data Made Me Look Like a Criminal. Time, May 1, 2014.",
      "doi": ""
    },
    {
      "text": "32. H. M. Wallach. Topic modeling: beyond bag-of-words. In Proc. ICML, pages 977--984, 2006.  ",
      "doi": "10.1145/1143844.1143967"
    },
    {
      "text": "33. A. Whitten and J. D. Tygar. Why Johnny can't encrypt: A usability evaluation of PGP 5.0. In Proceedings of the 8th USENIX Security Symposium, 1999. ",
      "doi": "10.5555/1251421.1251435"
    },
    {
      "text": "34. S.-H. Yang, A. Kolcz, A. Schlaikjer, and P. Gupta. Large-scale High-precision Topic Modeling on Twitter. In Proc. KDD, pages 1907--1916, 2014.  ",
      "doi": "10.1145/2623330.2623336"
    },
    {
      "text": "35. P. R. Zimmermann. The official PGP user's guide. MIT press, 1995. ",
      "doi": "10.5555/202735"
    }
  ]
}