{
  "doi": "10.1145/2702123.2702610",
  "title": "Gesture On: Enabling Always-On Touch Gestures for Fast Mobile Access from the Device Standby Mode",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3355-3364",
  "year": 2015,
  "badges": [],
  "abstract": "A significant percentage of mobile interaction involves short-period usages that originate from the standby mode-users wake up a device by pressing the power button, unlock the device by authenticating themselves, and then search for a target app or functionality on the device. These additional steps preceding a target task imposes significant overhead on users for each mobile device access. To address the issue, we developed Gesture On, a system that enables gesture shortcuts in the standby mode by which a user can draw a gesture on the touchscreen before the screen is turned on. Based on the gesture, our system directly brings up a target item onto the screen that bypasses all these additional steps in a mobile access. This paper examines several challenges in realizing Gesture On, including robustly rejecting accidental touches when the device is in standby, battery consumption incurred for continuous sensing and gesture-based user authentication methods for automatically device unlocking. Our analyses based on a set of user data indicated that Gesture On demonstrates a feasible approach for leveraging the standby mode for fast access to mobile content.",
  "tags": [
    "mobile computing",
    "gesture recognition",
    "power efficiency",
    "standby mode",
    "gesture-based interaction"
  ],
  "authors": [
    {
      "name": "Hao Lu",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351594340",
      "orcid": "missing"
    },
    {
      "name": "Yang Li",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Amini, S. and Li, Y. CrowdLearner: rapidly creating mobile recognizers using crowdsourcing. Proc. UIST 2013, ACM Press (2013), 163--172.  ",
      "doi": "10.1145/2501988.2502029"
    },
    {
      "text": "Appert, C. and Zhai, S. Using strokes as command shortcuts. Proc. CHI 2009, 2289--2298.  ",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage. Proc. MobileHCI 2011, 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Feng, T., Liu, Z., Kwon, K.-A., Shi, W., Carbunar, B., Jiang, Y., and Nguyen, N. Continuous mobile authentication using touchscreen gestures. 2012 IEEE Conference on Technologies for Homeland Security (HST), IEEE (2012), 451--456.",
      "doi": ""
    },
    {
      "text": "Ferreira, D., Goncalves, J., Kostakos, V., Barkhuus, L., and Dey, A.K. Contextual experience sampling of mobile application micro-usage. Proc. MobileHCI 2014, ACM Press (2014), 91--100.  ",
      "doi": "10.1145/2628363.2628367"
    },
    {
      "text": "Hayashi, E., Das, S., Amini, S., Hong, J., and Oakley, I. CASA: context-aware scalable authentication. Proceedings of the Ninth Symposium on Usable Privacy and Security - SOUPS '13, Article No. 3.  ",
      "doi": "10.1145/2501604.2501607"
    },
    {
      "text": "Kane, S.K., Wobbrock, J.O., and Ladner, R.E. Usable gestures for blind people?: understanding preference and performance. Proc. CHI 2011, 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Kennedy, P.R., Hall, T.G., and Hardy, D.A. Security token and method for wireless applications. Patent US6084968, 2000.",
      "doi": ""
    },
    {
      "text": "Li, Y. Protractor: a fast and accurate gesture recognizer. Proc. CHI 2010, ACM Press (2010), 2169--2172.  ",
      "doi": "10.1145/1753326.1753654"
    },
    {
      "text": "Li, Y. Gesture search: a tool for fast mobile data access. Proc. UIST 2010, ACM Press (2010), 87--96.  ",
      "doi": "10.1145/1866029.1866044"
    },
    {
      "text": "1Lü, H., Fogarty, J., and Li, Y. Gesture Script: recognizing gestures and their structure using rendering scripts and interactively trained parts. Proc. CHI 2014, ACM Press (2014), 1685--1694.  ",
      "doi": "10.1145/2556288.2557263"
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, I.H.W. The WEKA Data Mining Software: An Update. SIGKDD Explorations 11, 1 (2009).  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Mcgrath, W. and Li, Y. Detecting Tapping Motion on the Side of Mobile Devices By Probabilistically Combining Hand Postures. Proc. UIST 2014, 215--219.  ",
      "doi": "10.1145/2642918.2647363"
    },
    {
      "text": "Miluzzo, E., Varshavsky, A., Balakrishnan, S., and Choudhury, R.R. Tapprints: your finger taps have fingerprints. Proc. MobiSys 2012, 323--336.  ",
      "doi": "10.1145/2307636.2307666"
    },
    {
      "text": "Mochel, P. The sysfs filesystem. Linux Symposium, (2005), 313--326.",
      "doi": ""
    },
    {
      "text": "Ouyang, T. and Li, Y. Bootstrapping personal gesture shortcuts with the wisdom of the crowd and handwriting recognition. Proc. CHI 2012, 2895--2904.  ",
      "doi": "10.1145/2207676.2208695"
    },
    {
      "text": "Pirlo, G., Cuccovillo, V., Impedovo, D., and Mignone, P. On-line Signature Verification by Multi-Domain Classification. Proceedings of International Conference on Frontiers in Handwriting Recognition (ICFHR 2014), IEEE (2014), 67--72.",
      "doi": ""
    },
    {
      "text": "Ruiz, J. and Li, Y. DoubleFlip: a motion gesture delimiter for mobile interaction. Proc. CHI 2011, 2717--2720.  ",
      "doi": "10.1145/1978942.1979341"
    },
    {
      "text": "Schwarz, J., Xiao, R., Mankoff, J., Hudson, S.E., and Harrison, C. Probabilistic palm rejection using spatiotemporal touch features and iterative classification. Proc. CHI 2014, 2009--2012.  ",
      "doi": "10.1145/2556288.2557056"
    },
    {
      "text": "Shahzad, M., Liu, A.X., and Samuel, A. Secure unlocking of mobile touch screen devices by simple gestures. Proc. MobiCom 2013, 39--50.  ",
      "doi": "10.1145/2500423.2500434"
    },
    {
      "text": "2Sherman, M., Clark, G., Yang, Y., Sugrim, S., Modig, A., Lindqvist, J., Oulasvirta, A., and Roos, T. User-generated free-form gestures for authentication. Proc. MobiSys 2014, 176--189.  ",
      "doi": "10.1145/2594368.2594375"
    },
    {
      "text": "2Wobbrock, J.O., Wilson, A.D., and Li, Y. Gestures without libraries, toolkits or training: a 1 recognizer for user interface prototypes. Proc. UIST 2007, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}