{
  "doi": "10.1145/2702123.2702205",
  "title": "Understanding and Supporting Fathers and Fatherhood on Social Media Sites",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1905-1914",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Fathers are taking on more childcare and household responsibilities than they used to and many non-profit and government organizations have pushed for changes in policies to support fathers. Despite this effort, little research has explored how fathers go online related to their roles as fathers. Drawing on an interview study with 37 fathers, we find that they use social media to document and archive fatherhood, learn how to be a father, and access social support. They also go online to support diverse family needs, such as single fathers' use of Reddit instead of Facebook, fathers raised by single mothers' search for role models online, and stay-at-home fathers' use of father blogs. However, fathers are constrained by privacy concerns and perceptions of judgment relating to sharing content online about their children. Drawing on theories of fatherhood, we present theoretical and design ideas for designing online spaces to better support fathers and fatherhood. We conclude with a call for a research agenda to support fathers online.",
  "tags": [
    "fathers",
    "internet",
    "parents",
    "social media"
  ],
  "authors": [
    {
      "name": "Tawfiq Ammari",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-84459213457/rel-imgonly/smrl_ammari.png",
      "acmid": "84459213457",
      "orcid": "0000-0002-1920-1625"
    },
    {
      "name": "Sarita Schoenebeck",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81309483660/rel-imgonly/sarita_large.jpg",
      "acmid": "81309483660",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abernethy, V.D. Social network and response to the maternal role. International Journal of Sociology of the Family, (1973), 86--92.",
      "doi": ""
    },
    {
      "text": "Ammari, T., Schoenebeck, S.Y., and Morris, M.R. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. In Proc. ICWSM, (2014).",
      "doi": ""
    },
    {
      "text": "Azar, S.T., Nix, R.L., and Makin-Byrd, K.N. Parenting schemas and the process of change. Journal of Marital and Family Therapy 31, 1 (2005), 45--58.",
      "doi": ""
    },
    {
      "text": "BabyCenter. babycenter.com/help-about-company.",
      "doi": ""
    },
    {
      "text": "Balaam, M., Robertson, J., Say, R., et al. Motherhood and HCI. CHI Workshop, (2013).  ",
      "doi": "10.1145/2468356.2479650"
    },
    {
      "text": "Bandura, A. Social Learning Theory. General Learning Press, New York, 1977.",
      "doi": ""
    },
    {
      "text": "Bartholomew, M.K., Schoppe-Sullivan, S.J., Glassman, M., Kamp Dush, C.M., and Sullivan, J.M. New Parents' Facebook Use at the Transition to Parenthood. Family Relations 61, 3 (2012), 455--469.",
      "doi": ""
    },
    {
      "text": "Biddle, B.J. Role theory: Expectations, identities, and behaviors. Academic Press, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Budig, M.J. and England, P. The Wage Penalty for Motherhood. American Sociological Review 66, 2 (2001), 204--225.",
      "doi": ""
    },
    {
      "text": "Cabrera, N. and Peters, H.E. Public Policies and Father Involvement. Marr. & Fam. Rev. 29, 4 (2000), 295--314.",
      "doi": ""
    },
    {
      "text": "Cabrera, N., Tamis-LeMonda, C.S., Bradley, R.H., Hofferth, S., & Lamb, M.E. Fatherhood in the TwentyFirst Century. Child Dev. 71, 1 (2000), 127--136.",
      "doi": ""
    },
    {
      "text": "Cochran, M.M. and Brassard, J.A. Child development and personal social networks. Child development, (1979), 601--616.",
      "doi": ""
    },
    {
      "text": "Eriksson, H. and Salzmann-Erikson, M. Supporting a caring fatherhood in cyberspace-an analysis of communication about caring within an online forum for fathers. Scand. J. of Caring Science 27, 1 (2013), 63--69.",
      "doi": ""
    },
    {
      "text": "Fatherhood Institute. www.fatherhoodinstitute.org/.",
      "doi": ""
    },
    {
      "text": "Festinger, L. A theory of social comparison processes. Human relations 7, 2 (1954), 117--140.",
      "doi": ""
    },
    {
      "text": "Fletcher, R. and StGeorge, J. Heading Into Fatherhood Nervously: Support for Fathering From Online Dads. Qualitative Health Research 21, 8 (2011), 1101--1114.",
      "doi": ""
    },
    {
      "text": "Gibson, L. and Hanson, V.L. Digital motherhood: How Does Technology Help New Mothers? In Proc. CHI '13, ACM (2013), 313--322.  ",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Gregory, A. and Milner, S. What is \"New\" about Fatherhood?: The Social Construction of Fatherhood in France and the UK. Men & Masc. 14,5 (2011), 588--606.",
      "doi": ""
    },
    {
      "text": "Hays, S. The Cultural Contradictions of Motherhood. Yale University Press, 1996.",
      "doi": ""
    },
    {
      "text": "Himsel, A.J. and Goldberg, W.A. Social Comparisons and Satisfaction with the Division of Housework Implications for Men's and Women's Role Strain. Journal of Family Issues 24, 7 (2003), 843--866.",
      "doi": ""
    },
    {
      "text": "Hudson, D.B., Campbell-Grossman, C., Fleck, M.O., Elek, S.M., and Shipman, A. Effects of the New Fathers Network on first-time fathers' parenting self-efficacy and parenting satisfaction during the transition to parenthood. Issues in Comprehensive Pediatric Nursing 26, 4 (2003), 217--229.",
      "doi": ""
    },
    {
      "text": "Johansson, T. and Hammarén, N. 'Imagine, just 16 years old and already a dad!' The construction of young fatherhood on the Internet. International Journal of Adolescence and Youth, (2012), 1--16.",
      "doi": ""
    },
    {
      "text": "Kazakos, K., Bales, E., Neustaedter, C., Yarosh, S., Kaye, J. \"Jofish,\" and Kirk, D. Exploring the Diversity of Families: Designing Technologies for the Contemporary Family Life. In CHI '13 Extended Abstracts (2013), 3255--3258.  ",
      "doi": "10.1145/2468356.2479660"
    },
    {
      "text": "Kim Parker and Wendy Wang. Modern Parenthood. Pew Research, 2013.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Peters, A.M., Diriye, A., and Bove, M. Standing on the Schemas of Giants: Socially Augmented Information Foraging. In Proc. CSCW '14, ACM (2014), 999--1010.  ",
      "doi": "10.1145/2531602.2531644"
    },
    {
      "text": "Lamb, M.E. The History of Research on Father Involvement. Marr. & Fam. Rev. 29, 2-3 (2000), 23--42.",
      "doi": ""
    },
    {
      "text": "Lamb, M.E., Pleck, J.H., Charnov, E.L., and Levine, J.A. Paternal behavior in humans. American zoologist, (1985), 883--894.",
      "doi": ""
    },
    {
      "text": "Lamb, M., Pleck, J.H., Charnov, E.L., and Levine, J.A. A biosocial perspective on paternal behavior and involvement. 111--142. In Parenting across the life span: Biosocial dimensions. 1987, 111--142.",
      "doi": ""
    },
    {
      "text": "LaRossa, R. The Modernization of Fatherhood: A Social and Political History. Univ. of Chicago Press, 1997.",
      "doi": ""
    },
    {
      "text": "Marketing to Moms Coalition. State of the American Mom 2012. 2013.",
      "doi": ""
    },
    {
      "text": "Mickelson, K.D. Seeking social support: parents in electronic support groups. In S. Kiesler, ed., Culture of the Internet. LEA, 1997, 157--178.",
      "doi": ""
    },
    {
      "text": "Morris, M.R. Social Networking Site Use by Mothers of Young Children. In Proc. of CSCW '14, ACM, (2014), 1272--1282.  ",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "National Fatherhood Initiative. www.fatherhood.org/",
      "doi": ""
    },
    {
      "text": "Nicholas, D.B., Chahauver, A., Brownstone, D., Hetherington, R., McNeill, T., and Bouffet, E. Evaluation of an online peer support network for fathers of a child with a brain tumor. Social Work in Health Care 51, 3 (2012), 232--245.",
      "doi": ""
    },
    {
      "text": "Rehel, E.M. When Dad Stays Home Too Paternity Leave, Gender, and Parenting. Gender & Society, (2013), 0891243213503900.",
      "doi": ""
    },
    {
      "text": "Ryan, C.L. and Siebens, J. Educational attainment in the USA: 2009. US Census Bureau, (2012).",
      "doi": ""
    },
    {
      "text": "Salzmann-Erikson, M. and Eriksson, H. Fathers sharing about early parental support in health-care - virtual discussions on an Internet forum. Health & Social Care in the Community 21, 4 (2013), 381--390.",
      "doi": ""
    },
    {
      "text": "Schank, R.C. and Abelson, R.P. Scripts, Plans, Goals, and Understanding: An Inquiry Into Human Knowledge Structures. Psychology Press, 2013.",
      "doi": ""
    },
    {
      "text": "Schoenebeck, S.Y. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom.com. In Proc. ICWSM 2013, (2013).",
      "doi": ""
    },
    {
      "text": "Seligson, H. Fathers Seek Advertising That Does Not Ridicule. The New York Times, 2013. http://www.nytimes.com/2013/02/24/business/fathersseek-advertising-that-does-not-ridicule.html.",
      "doi": ""
    },
    {
      "text": "Sivek, S.C. \"We Need a Showing of All Hands\" Technological Utopianism in MAKE Magazine. Journal of Communication Inquiry 35, 3 (2011), 187--209.",
      "doi": ""
    },
    {
      "text": "StGeorge, J.M. and Fletcher, R.J. Fathers Online: Learning About Fatherhood Through the Internet. The Journal of Perinatal Education 20, 3 (2011), 154--162.",
      "doi": ""
    },
    {
      "text": "Tuffin, K., Rouch, G., and Frewin, K. Constructing adolescent fatherhood: responsibilities and intergenerational repair. Culture, health & sexuality 12, 5 (2010), 485--498.",
      "doi": ""
    },
    {
      "text": "White, N.R. About Fathers: Masculinity and the Social Construction of Fatherhood. Journal of Sociology 30, 2 (1994), 119--131.",
      "doi": ""
    },
    {
      "text": "Zhao, S. Parental education and children's online health information seeking: Beyond the digital divide debate. Social Science & Medicine 69, 10 (2009), 1501--1505.",
      "doi": ""
    },
    {
      "text": "We're Dads, Huggies. Not Dummies. Change.org. www.change.org/p/we-re-dads-huggies-not-dummie",
      "doi": ""
    }
  ]
}