{
  "doi": "10.1145/2702123.2702246",
  "title": "BaseLase: An Interactive Focus+Context Laser Floor",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3869-3878",
  "year": 2015,
  "badges": [],
  "abstract": "We present BaseLase, an interactive laser projected focus + context floor display. In order to provide a transportable system that works in areas where there are no ceilings, we provide an integrated unit (1.3m height) that stands on the floor. One unsolved challenge for laser projectors is to cover large projection areas while providing high resolution at the same time. Our focus + context laser projector solves this problem. BaseLase can cover a large context area in low resolution, while providing three movable high-resolution focus spots. We provide a convex mirror design that enables the laser to reach a large area (75m2) with low resolution while decreasing the beam divergence compared to spherical or parabolic mirrors. This hyperboloidal mirror shape approximately equalizes the point size on the floor independent from the projected location. We propose to add a number of planar mirrors on pan-tilt units to create dynamic zones of high resolution that can adjust to the user behavior. We provide example applications for BaseLase and report on user experience in preliminary trials.",
  "authors": [
    {
      "name": "Jörg Müller",
      "institution": "Aarhus University & TU Berlin, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    },
    {
      "name": "Dieter Eberle",
      "institution": "TU Berlin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958933057",
      "orcid": "missing"
    },
    {
      "name": "Constantin Schmidt",
      "institution": "TU Berlin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557539556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J., and Zhai, S. More than dotting the i's -- foundations for crossing-based interfaces. In Proc. of CHI'02, ACM (2002), 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Ashdown, M., and Robinson, P. Escritoire: A personal projected display. MultiMedia, IEEE 12, 1 (2005), 34--42.  ",
      "doi": "10.1109/MMUL.2005.18"
    },
    {
      "text": "Augsten, T., Kaefer, K., Meusel, R., Fetzer, C., Kanitz, D., Stoff, T., Becker, T., Holz, C., and Baudisch, P. Multitoe: high-precision interaction with back-projected floors based on high-resolution multi-touch input. In Proc. of UIST'10, ACM (2010), 209--218.  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Baudisch, P., Good, N., and Stewart, P. Focus plus context screens: combining display technology with visualization techniques. In Proc. of UIST'01, ACM (2001), 31--40.  ",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Benko, H., and Wilson, A. D. Pinch-the-sky dome: freehand multi-point interactions with immersive omni-directional data. In CHI EA '10, ACM (2010), 3045--3050.  ",
      "doi": "10.1145/1753846.1753915"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., and DeRose, T. D. Toolglass and magic lenses: the see-through interface. In Proc. of SIGGRAPH'93, ACM (1993), 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bränzel, A., Holz, C., Hoffmann, D., Schmidt, D., Knaust, M., Lühne, P., Meusel, R., Richter, S., and Baudisch, P. Gravityspace: tracking users and their poses in a smart room using a pressure-sensing floor. In Proc. of CHI'13, ACM (2013), 725--734.  ",
      "doi": "10.1145/2470654.2470757"
    },
    {
      "text": "Cassinelli, A., Zerroug, A., Watanabe, Y., Ishikawa, M., and ängeslevä, J. Camera-less smart laser projector. In SIGGRAPH Emerging Technologies (2010).  ",
      "doi": "10.1145/1836821.1836830"
    },
    {
      "text": "Dalsgaard, P., and Halskov, K. Designing urban media façades: cases and challenges. In Proc. of CHI'10, ACM (2010), 2277--2286.  ",
      "doi": "10.1145/1753326.1753670"
    },
    {
      "text": "Dalton, N. S. Taptiles: LED-based floor interaction. In Proc. of ITS'13, ACM (2013), 165--174.  ",
      "doi": "10.1145/2512349.2512800"
    },
    {
      "text": "Delbrück, T., Whatley, A. M., Douglas, R., Eng, K., Hepp, K., and Verschure, P. F. A tactile luminous floor for an interactive autonomous space. Robotics and Autonomous Systems 55, 6 (2007), 433--443.  ",
      "doi": "10.1016/j.robot.2007.01.006"
    },
    {
      "text": "Grønbæk, K., Iversen, O. S., Kortbek, K. J., Nielsen, K. R., and Aagaard, L. Igamefloor: a platform for co-located collaborative games. In Proc. of ACE'07, ACM (2007), 64--71.  ",
      "doi": "10.1145/1255047.1255061"
    },
    {
      "text": "Huang, E. M., Koster, A., and Borchers, J. Overcoming assumptions and uncovering practices: When does the public really look at public displays? In Pervasive Computing. Springer, 2008, 228--243.  ",
      "doi": "10.1007/978-3-540-79576-6_14"
    },
    {
      "text": "Jones, B., Sodhi, R., Murdock, M., Mehra, R., Benko, H., Wilson, A., Ofek, E., MacIntyre, B., Raghuvanshi, N., and Shapira, L. Roomalive: Magical experiences enabled by scalable, adaptive projector-camera units. In Proc. of UIST'14, ACM (2014), 637--644.  ",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "Jones, B. R., Benko, H., Ofek, E., and Wilson, A. D. Illumiroom: peripheral projected illusions for interactive experiences. In Proc. of CHI'13, ACM (2013), 869--878.  ",
      "doi": "10.1145/2470654.2466112"
    },
    {
      "text": "Krogh, P., Ludvigsen, M., and Lykke-Olesen, A. \"help me pull that cursor\" a collaborative interactive floor enhancing community interaction. Australasian Journal of Information Systems 11, 2 (2007).",
      "doi": ""
    },
    {
      "text": "Lamping, J., Rao, R., and Pirolli, P. A focus+ context technique based on hyperbolic geometry for visualizing large hierarchies. In Proc. of CHI'95, ACM (1995), 401--408.  ",
      "doi": "10.1145/223904.223956"
    },
    {
      "text": "Lee, J. C., Hudson, S. E., Summet, J. W., and Dietz, P. H. Moveable interactive projected displays using projector based tracking. In Proc. of UIST'05, ACM (2005), 63--72.  ",
      "doi": "10.1145/1095034.1095045"
    },
    {
      "text": "Müller, J., Walter, R., Bailly, G., Nischt, M., and Alt, F. Looking glass: a field study on noticing interactivity of a shop window. In Proc. of CHI'12, ACM (2012), 297--306.  ",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "Müller, J., Wilmsmann, D., Exeler, J., Buzeck, M., Schmidt, A., Jay, T., and Krüger, A. Display blindness: The effect of expectations on attention towards digital signage. In Pervasive Computing. Springer, 2009, 1--8.  ",
      "doi": "10.1007/978-3-642-01516-8_1"
    },
    {
      "text": "Orr, R. J., and Abowd, G. D. The smart floor: A mechanism for natural user identification and tracking. In CHI EA '00, ACM (2000), 275--276.  ",
      "doi": "10.1145/633292.633453"
    },
    {
      "text": "Paradiso, J., Abler, C., Hsiao, K.-y., and Reynolds, M. The magic carpet: physical sensing for immersive environments. In CHI EA '97, ACM (1997), 277--278.  ",
      "doi": "10.1145/1120212.1120391"
    },
    {
      "text": "Peltonen, P., Kurvinen, E., Salovaara, A., Jacucci, G., Ilmonen, T., Evans, J., Oulasvirta, A., and Saarikko, P. It's mine, don't touch!: Interactions at a large multi-touch display in a city centre. In Proc. of CHI'08, ACM (New York, NY, USA, 2008), 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Pinhanez, C. The everywhere displays projector: A device to create ubiquitous graphical interfaces. In Proc. of Ubicomp'01, Springer (2001), 315--331. ",
      "doi": "10.5555/647987.741324"
    },
    {
      "text": "Rogers, Y., Hazlewood, W. R., Marshall, P., Dalton, N., and Hertrich, S. Ambient influence: Can twinkly lights lure and abstract representations trigger behavioral change? In Proc. of Ubicomp'10, ACM (2010), 261--270.  ",
      "doi": "10.1145/1864349.1864372"
    },
    {
      "text": "Schrammel, J., Mattheiss, E., Döbelt, S., Paletta, L., Almer, A., and Tscheligi, M. Attentional behavior of users on the move towards pervasive advertising media. In Pervasive Advertising, J. Müller, F. Alt, and D. Michelis, Eds., Human-Computer Interaction Series. Springer London, 2011, 287--307.",
      "doi": ""
    },
    {
      "text": "Wilson, A. D. PlayAnywhere: a compact interactive tabletop projection-vision system. In Proc. of UIST'05, ACM (2005), 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Xiao, R., Nacenta, M. A., Mandryk, R. L., Cockburn, A., and Gutwin, C. Ubiquitous cursor: A comparison of direct and indirect pointing feedback in multi-display environments. In Proc. of GI'11 (2011), 135--142. ",
      "doi": "10.5555/1992917.1992939"
    }
  ]
}