{
  "doi": "10.1145/2702123.2702235",
  "title": "DIYbio Things: Open Source Biology Tools as Platforms for Hybrid Knowledge Production and Scientific Participation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4065-4068",
  "year": 2015,
  "badges": [],
  "abstract": "DIYbio (Do It Yourself Biology) is a growing movement of scientists, hobbyists, artists, and tinkerers who practice biology outside of professional settings. In this paper, we present our work with several open source DIYbio tools, including OpenPCR and Pearl Blue Transilluminator, which can be used to test DNA samples for specific sequences. We frame these platforms as things that gather heterogeneous materials and concerns, and enable new forms of knowledge transfer. Working with these hybrid systems in professional and DIY settings, we conducted a workshop where non-biologists tested food products for genetic modifications. Our findings suggest new design directions at the intersection of biology, technology, and DIY: i) DIYbio platforms as rich tools for hybrid knowledge production; and ii) open source biology as a site for public engagement with science.",
  "tags": [
    "diybio",
    "design things",
    "publics"
  ],
  "authors": [
    {
      "name": "Stacey Kuznetsov",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338489421",
      "orcid": "missing"
    },
    {
      "name": "Carrie Doonan",
      "institution": "Carnegie Mellon Unviversity, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697504",
      "orcid": "missing"
    },
    {
      "name": "Nathan Wilson",
      "institution": "Carnegie Mellon Unviversity, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701432",
      "orcid": "missing"
    },
    {
      "name": "Swarna Mohan",
      "institution": "Carnegie Mellon Unviversity, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700691",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Eric Paulos",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Binder, T., De Michelis, G., Ehn, P., Jacucci, G., Linde, P., Wagner, I. Design Things, MIT Press, Cambridge, MA, 2012.",
      "doi": ""
    },
    {
      "text": "Brandner, D. L. 200 PCR-Based detection of genetically modified foods. Pages 69--84, in Tested studies for laboratory teaching, Volume 23 (M. A. O'Donnell, Ed.), ABLE.",
      "doi": ""
    },
    {
      "text": "Buechley, L., Rosner, D. K., Paulos, E., Williams, A. DIY for CHI: methods, communities, and values of reuse and customization, CHI '09, 4823--4826.  ",
      "doi": "10.1145/1520340.1520750"
    },
    {
      "text": "Carolina Biological Supply. http://www.carolina.com",
      "doi": ""
    },
    {
      "text": "Dewey, J. The Public and Its Problems. NY: Holt, 1927.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Lukens, J., Lodato, T., Jenkins, T., Kim, T. 2014. Making public things: how HCI design can express matters of concern. CHI '14, 2397--240  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Kuznetsov, S., Taylor, A. S., Regan, T., Villar, N., Paulos, E. 2012. At the seams: DIYbio and opportunities for HCI. DIS'12, 258--26  ",
      "doi": "10.1145/2317956.2317997"
    },
    {
      "text": "Latour, B. and Weibel, P. (eds.) Making Things Public: Atmospheres of Democracy, MIT Press, 2005.",
      "doi": ""
    },
    {
      "text": "OpenPCR. http://openpcr.org",
      "doi": ""
    },
    {
      "text": "Pearl Biotech Blue Transilluminator. http://pearlbiotech.org",
      "doi": ""
    },
    {
      "text": "1Shaer, O., Mazalek, A., Ullmer, B., Konkel, M. 2013. From big data to insights: opportunities and challenges for TEI in genomics. TEI '13, 109--116.  ",
      "doi": "10.1145/2460625.2460642"
    },
    {
      "text": "Taylor, A. S., Piterman, N., Ishtiaq, S., Fisher, J., Cook, B., Cockerton, C., Bourton, S., Benque. D. 2013. At the interface of biology and computation. SIGCHI, 493--502.  ",
      "doi": "10.1145/2470654.2470725"
    },
    {
      "text": "Wiggins, A. 2011. eBirding: technology adoption and the transformation of leisure into science. In Proceedings of iConference '11. ACM, NY, 798--799.  ",
      "doi": "10.1145/1940761.1940910"
    },
    {
      "text": "Willett, W., Aoki, P., Kumar, N., Subramanian, S., Woodruff, A. 2010. Common sense community: scaffolding mobile sensing and analysis for novice users. Pervasive'10, 301--318  ",
      "doi": "10.1007/978-3-642-12654-3_18"
    }
  ]
}