{
  "doi": "10.1145/2702123.2702453",
  "title": "Concealing or Revealing Mobile Medical Devices?: Designing for Onstage and Offstage Presentation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1689-1698",
  "year": 2015,
  "badges": [],
  "abstract": "Adults with Type 1 Diabetes have choices regarding the technology they use to self-manage their chronic condition. They can use glucose meters, insulin pumps, smartphone apps, and other technologies to support their everyday care. However, little is known about how their social lives might influence what they adopt or how they use technologies. A multi-method study was conducted to examine contextual factors that influence their technology use. While individual differences play a large role in everyday use, social factors were also found to influence use. For example, people can hide their devices in uncertain social situations or show them off to achieve a purpose. We frame these social behaviours using Goffman's theatre metaphor of onstage and offstage behaviour, and discuss how this kind of analysis can inform the design of future mobile medical devices for self-management of chronic conditions.",
  "authors": [
    {
      "name": "Aisling Ann O'Kane",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81484657437/rel-imgonly/headshot.jpg",
      "acmid": "81484657437",
      "orcid": "0000-0001-8219-8126"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Ann E. Blandford",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100644401/rel-imgonly/p1010038.jpg",
      "acmid": "81100644401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ANSI. Medical devices -- Application of usability engineering to medical devices. ANSI/AAMI/IEC 62366:2007, 2007.",
      "doi": ""
    },
    {
      "text": "Benjamin, A., Birnholtz, J., Baecker, R., Gromala, D., and Furlan, A. Impression Management Work: How Seniors with Chronic Pain Address Disruptions in Their Interactions. In Proc. CSCW 2012, ACM Press (2012), 799--808.  ",
      "doi": "10.1145/2145204.2145324"
    },
    {
      "text": "Beyer, H. and Holtzblatt, K. Contextual Design: Defining Customer-Centered Systems. Elsevier, San Diego, 1997. ",
      "doi": "10.5555/523184"
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology, 3(2), 77--101.",
      "doi": ""
    },
    {
      "text": "Bury, M. Chronic illness as biographical disruption. Sociology of Health and Illness 4, 2 (1982), 167--182.",
      "doi": ""
    },
    {
      "text": "Cafazzo, J.A., Casselman, M., Hamming, N., Katzman, D.K., and Palmert, M.R. Design of an mHealth app for the self-management of adolescent type 1 diabetes: a pilot study. JMIR 14, 3 (2012), e70.",
      "doi": ""
    },
    {
      "text": "Diabetes United Kingdom. Diabetes United Kingdom gets behind #showmeyourpump movement. Diabetes United Kingdom. 2014. http://www.diabetes.org.uk/About_us/News/DiabetesUnited Kingdom-gets-behind-showmeyourpump-movement/.",
      "doi": ""
    },
    {
      "text": "Diabetes United Kingdom. Testing -- Diabetes United Kingdom. Diabetes United Kingdom. 2013. http://www.diabetes.org.uk/Guidetodiabetes/Monitoring/Testing/.",
      "doi": ""
    },
    {
      "text": "Dourish, P. What we talk about when we talk about context. Personal Ubiquitous Comput. 8, 1 (2004), 19--30.",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Funnell, M. and RM, A. The problem with compliance in diabetes. JAMA 284, 13 (2000), 1709.",
      "doi": ""
    },
    {
      "text": "Funnell, M.M., Brown, T.L., Childs, B.P., et al. National Standards for Diabetes Self-Management Education. The Diabetes Educator 33, 4 (2007), 599--614.",
      "doi": ""
    },
    {
      "text": "Furniss, D., O'Kane, A.A., Randell, R., Taneva, S., Mentis, H., and Blandford, A. Fieldwork for Healthcare: Case Studies Investigating Human Factors in Computing Systems. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 3, 1 (2014), 1--129. ",
      "doi": "10.5555/2616402"
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Penguin Books Ltd., London, 1959.",
      "doi": ""
    },
    {
      "text": "Harry, D., Gordon, E., and Schmandt, C. Setting the Stage for Interaction: A Tablet Application to Augment Group Discussion in a Seminar Class. In Proc. CSCW 2012, ACM Press (2012), 1071--1080.  ",
      "doi": "10.1145/2145204.2145364"
    },
    {
      "text": "Hutchins, E. Cognition in the Wild . MIT Press, Cambridge, MA, 1995.",
      "doi": ""
    },
    {
      "text": "Isomursu, M., Kuutti, K., and Väinämö, S. Experience Clip: Method for User Participation and Evaluation of Mobile Concepts. In Proc. PD 2004, ACM Press (2004), 83--92.  ",
      "doi": "10.1145/1011870.1011881"
    },
    {
      "text": "JDRF. Continuous Glucose Monitors. JDRF. 2013. http://www.jdrf.org.uk/life-with-type-1diabetes/managing-type-1/treatments/cgms.",
      "doi": ""
    },
    {
      "text": "Kanstrup, A.M. Design concepts for digital diabetes practice: Design to explore, share, and camouflage chronic illness. Int. J. of Design 8, 3 (2014), 49--60.",
      "doi": ""
    },
    {
      "text": "Kanstrup, A.M., Bertelsen, P., Glasemann, M. and Boye, N. Design for More: An Ambient Perspective on Diabetes. In Proc. PD 2008, ACM Press (2008), 118--127. ",
      "doi": "10.5555/1795234.1795252"
    },
    {
      "text": "Kanstrup, A.M., Bjerge, K. and Kristensen, J.E. A Living Laboratory Exploring Mobile Support for Everyday Life with Diabetes. Wirel. Pers. Commun. 53, 3 (2010), 395--408.  ",
      "doi": "10.1007/s11277-010-9953-3"
    },
    {
      "text": "Linekin, P.L. Diabetes Pattern Management: The Key to Diabetes Self-Management and Glycemic Control. Home Healthcare Nurse 20, 3 (2002), 168--177.",
      "doi": ""
    },
    {
      "text": "Lutfey, K.E. and Wishner, W.J. Beyond \"compliance\" is \"adherence\". Improving the prospect of diabetes care. Diabetes Care 22 , 4 (1999), 635--639.",
      "doi": ""
    },
    {
      "text": "Mamykina, L., Mynatt, E., Davidson, P., and Greenblatt, D. MAHI. In Proc. CHI 2008, ACM Press (2008), 477.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Mamykina, L., Mynatt, E.D., and Kaufman, D.R. Investigating Health Management Practices of Individuals with Diabetes. In Proc. CHI 2006, ACM Press (2006), 927--936.  ",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "McCarthy, J. and Wright, P. Technology as Experience. The MIT Press, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "McMahon, B.T., West, S.L., Mansouri, M., and Belongia, L. Workplace discrimination and diabetes: the EEOC Americans with Disabilities Act research project. Work: A Journal of Prevention, Assessment and Rehabilitation 25, 1 (2005), 9--18.",
      "doi": ""
    },
    {
      "text": "NHS Choices. Diabetes, type 1 - NHS Choices. NHS Choices. http://www.nhs.uk/Conditions/Diabetes-type1",
      "doi": ""
    },
    {
      "text": "O'Kane, A.A. and Blandford, A. 2013. Recruiting Diabetes Patients: a Success and a Failure. In CHI 2013 Workshop HCI fieldwork in healthcare: Creating a Graduate Handbook Workshop. 2013. http://www.chimed.ac.uk/publicdocs/WP179.pdf",
      "doi": ""
    },
    {
      "text": "O'Kane, A.A., Mentis, H.M. and Thereska, E. 2013. Non-static nature of patient consent: shifting privacy perspectives in health information sharing. In Proc. CSCW 2013, ACM Press (2013), 553--562.  ",
      "doi": "10.1145/2441776.2441838"
    },
    {
      "text": "Owen, T., Buchanan, G., and Thimbleby, H. Understanding user requirements in take-home diabetes management technologies. In Proc. BCS HCI, British Computer Society (2012), 268--273. ",
      "doi": "10.5555/2377916.2377950"
    },
    {
      "text": "Piette, J.D. The Impact of Comorbid Chronic Conditions on Diabetes Care. Diabetes Care 29, 3 (2006), 725--731.",
      "doi": ""
    },
    {
      "text": "Rieman, J. The diary study: a workplace-oriented research tool to guide laboratory efforts. In Proc. INTERACT 1993 and CHI 1993 , (1993), 321--326. ",
      "doi": "10.5555/164632.164935"
    },
    {
      "text": "Ritholz, M.D., Smaldone, A., Lee, J., Castillo, A., Wolpert, H., and Weinger, K. Perceptions of psychosocial factors and the insulin pump. Diabetes Care 30, 3 (2007), 549--54.",
      "doi": ""
    },
    {
      "text": "Rogers, Y. Interaction design gone wild: striving for wild theory. Interactions 18 , 4 (2011), 58.  ",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "Sharples, S., Martin, J., Lang, A., Craven, M., O'Neill, S., and Barnett, J. Medical device design in context: A model of user'device interaction and consequences. Displays 33, 4-5 (2012), 221--232.",
      "doi": ""
    },
    {
      "text": "Storni, C. Multiple forms of appropriation in selfmonitoring technology: Reflections on the role of evaluation in future self-care. IJHCI 26, 5 (2010), 537--561.",
      "doi": ""
    },
    {
      "text": "Storni, C. Patients' lay expertise in chronic self-care: a case study in type 1 diabetes. Health Expectations, (2013).",
      "doi": ""
    },
    {
      "text": "Strauss, A.L., Corbin, J., Fagerhaugh, S., Glaser, B.G., Maines, D., Suczek, B. and Wiener, C.L. Chronic illness and the quality of life. Mosby, St. Louis, USA, 1984.",
      "doi": ""
    },
    {
      "text": "Suchman, L. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press, Cambridge, United Kingdom, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Tsvyatkova, D. and Storni, C. Adapting Design Probes to Explore Health Management Practices in Pediatric Type 1 Diabetes. In Proc. IDC, ACM Press (2014), 277--280.  ",
      "doi": "10.1145/2593968.2610471"
    },
    {
      "text": "Writtle, J. Colostomy bag bikini photograph seen by nine million people. BBC News, 2014. http://www.bbc.co.uk/news/uk-englandherefordworcester-28138485.",
      "doi": ""
    },
    {
      "text": "Zhao, X., Salehi, N., Naranjit, S., Alwaalan, S., Voida, S., and Cosley, D. The Many Faces of Facebook: Experiencing Social Media As Performance, Exhibition, and Personal Archive. In Proc. CHI 2013, ACM Press (2013), 1--10.  ",
      "doi": "10.1145/2470654.2470656"
    }
  ]
}