{
  "doi": "10.1145/2702123.2702589",
  "title": "StructJumper: A Tool to Help Blind Programmers Navigate and Understand the Structure of Code",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3043-3052",
  "year": 2015,
  "badges": [],
  "abstract": "It can be difficult for a blind developer to understand and navigate through a large amount of code quickly, as they are unable to skim as easily as their sighted counterparts. To help blind developers overcome this problem, we present StructJumper, an Eclipse plugin that creates a hierarchical tree based on the nesting structure of a Java class. The programmer can use the TreeView to get an overview of the code structure of the class (including all the methods and control flow statements) and can quickly switch between the TreeView and the Text Editor to get an idea of where they are within the nested structure. To evaluate StructJumper, we had seven blind programmers complete three tasks with and without our tool. We found that the users thought they would use StructJumper and there was a trend that they were faster completing the tasks with StructJumper.",
  "tags": [
    "navigation",
    "accessibility",
    "screen reader",
    "code structure",
    "blind programmers"
  ],
  "authors": [
    {
      "name": "Catherine M. Baker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81458642818/rel-imgonly/catieheadshot.jpeg",
      "acmid": "81458642818",
      "orcid": "missing"
    },
    {
      "name": "Lauren R. Milne",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358939557",
      "orcid": "missing"
    },
    {
      "name": "Richard E. Ladner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100297556/rel-imgonly/ladner3.jpg",
      "acmid": "81100297556",
      "orcid": "0000-0001-9413-6774"
    }
  ],
  "references": [
    {
      "text": "Asakawa, C. and Itoh, T. 1998. User interface of a Home Page Reader. In Proc. of ACM conference on Assistive technologies Assets '98. ACM, New York, NY, USA, 149--156.  ",
      "doi": "10.1145/274497.274526"
    },
    {
      "text": "Austin, J. 2013. Want a Great Scientific Career? Choose Computer Science. From http://sciencecareers.sciencemag.org/career_magazine/ previous_issues/articles/2013_03_25/caredit.a1300053.",
      "doi": ""
    },
    {
      "text": "Bragdon, A., Zeleznik, R., Reiss, S.P., Karumuri, S., Cheung, W., Kaplan, J., Coleman, C., Adeputra, F. and LaViola, J.J. Jr.. 2010. Code bubbles: a working setbased interface for code understanding and maintenance. In Proceedings of CHI '10. ACM, New York, NY, USA, (April 2010), 2503--2512.  ",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Henley, A.Z. and Fleming, S.D. 2014. The patchworks code editor: toward faster navigation with less code arranging and fewer navigation mistakes. In Proc. of CHI '14. ACM, (April 2014), 2511--2520.  ",
      "doi": "10.1145/2556288.2557073"
    },
    {
      "text": "Jakobsen, M.R. and Hornbaek, K. 2006. Evaluating a Fisheye View of Source Code. In Proc. CHI '06, ACM Press, (April 2006), 377--386.  ",
      "doi": "10.1145/1124772.1124830"
    },
    {
      "text": "Mealin, S., Murphy-Hill, E. 2012. An exploratory study of blind software developers. Visual Languages and Human-Centric Computing (VL/HCC), 2012 IEEE Symposium on. IEEE, (September 2012), 71--74.",
      "doi": ""
    },
    {
      "text": "Palladino, D. and Walker, B. 2007. Learning rates for auditory menus enhanced with spearcons versus earcons. In Proc. of International Conference on Auditory Display (Montreal, Canada June 26--29, 2007) ICAD '07.",
      "doi": ""
    },
    {
      "text": "Sánchez, J., Aguayo, F. 2005. Blind learners programming through audio. In CHI'05 extended abstracts on Human factors in computing systems, ACM, (April 2005), 1769--1772.  ",
      "doi": "10.1145/1056808.1057018"
    },
    {
      "text": "Smith, A., Cook, J., Francioni, J., Hossain, A., Anwar, M., and Rahman, M. 2003. Nonvisual tool for navigating hierarchical structures. In SIGACCESS Access. Comput. 77--78 (September 2003), 133--139.  ",
      "doi": "10.1145/1029014.1028654"
    },
    {
      "text": "Stefik, A., Alexander, R., Patterson, and Brown, J. 2007. WAD: A Feasibility study using the Wicked Audio Debugger. In Proceedings of the 15th IEEE International Conference on Program Comprehension (ICPC '07). IEEE Computer Society, Washington, DC, USA, 69--80.  ",
      "doi": "10.1109/ICPC.2007.42"
    },
    {
      "text": "Stefik, A., Hundhausen, C., and Patterson, R. 2011. An empirical investigation into the design of auditory cues to enhance computer program comprehension. In International Journal of Human-Computer Studies, 69 12, (December 2011), 820--838.  ",
      "doi": "10.1016/j.ijhcs.2011.07.002"
    },
    {
      "text": "Stefik, A., Hundhausen, C., and Smith, D. 2011. On the design of an educational infrastructure for the blind and visually impaired in computer science. In Proceedings of the 42nd ACM technical symposium on Computer science education, ACM, (March 2011), 571--576.  ",
      "doi": "10.1145/1953163.1953323"
    },
    {
      "text": "Vickers, P. and Alty, J. 2002 When Bugs Sing. In Interacting with Computers, 14 (6). 793--819. ISSN 0953-5438",
      "doi": ""
    },
    {
      "text": "WebAIM, 2012. Screen Reader User Survey #4 Results. From http://webaim.org/projects/screenreadersurvey4/.",
      "doi": ""
    },
    {
      "text": "W3C, 2008. Web Content Accessibility Guidelines (WCAG) 2.0, From http://www.w3.org/TR/WCAG20/",
      "doi": ""
    }
  ]
}