{
  "doi": "10.1145/2702123.2702602",
  "title": "Building Change: Constructive Design of Smart Domestic Environments for Goal Achievement",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3083-3092",
  "year": 2015,
  "badges": [],
  "abstract": "This paper presents the constructive design research (CDR) of smart domestic environments comprised of smart home infrastructure, smart domestic artifacts and digital services. CDR is an approach that focuses on imagining futures and learning through the making and testing of prototypes to construct new knowledge about how people engage with the world. While the body of research on smart domestic environments includes a wealth of human-centered research, the use of CDR is marginal. Our work demonstrates how such a process engages residents in activities to imagine why people might value smart domestic environments and how they might want to interact with them. Through goal setting activities, paper prototyping, and field-testing of resident designed technology probes, we present use cases, design principles and experiential insights. After sharing these findings, we introduce the emergence of smart domestic environments as possessing persuasive, personified and artful qualities.",
  "authors": [
    {
      "name": "Ryan Brotman",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548039765",
      "orcid": "missing"
    },
    {
      "name": "Winslow Burleson",
      "institution": "NY University, NY City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81366590839",
      "orcid": "missing"
    },
    {
      "name": "Jodi Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    },
    {
      "name": "William Heywood",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703129",
      "orcid": "missing"
    },
    {
      "name": "Jisoo Lee",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458859757",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beaudouin-Lafon, M. and Mackay, W. Prototyping tools and techniques. The human-computer interaction handbook: fundamentals, evolving technologies and emerging applications, Lawrence Erlbaum Associates, NY, USA, 2007. ",
      "doi": "10.5555/772072.772136"
    },
    {
      "text": "Burleson, W., Ruffenach, C., Jensen, C., Bandaru, U and Muldner, K. Game as life - life as game. In Proc IDC 2009, ACM Press, 272--273.  ",
      "doi": "10.1145/1551788.1551852"
    },
    {
      "text": "Cialdini, R. Influence: The psychology of persuasion (Revised ed.), Harper Press, New York, NY, USA, 2006.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., and Rodden, T. Domestic routines and design for the home. Computer Supported Cooperative Work (CSCW), 13(2), (2004) 191--220.  ",
      "doi": "10.1023/B%3ACOSU.0000045712.26840.a4"
    },
    {
      "text": "Elliot, K., Neustaedter, C., and Greenberg, S. Using location to embed technology into the social practices of home In Proc TIE 2007, ACM Press, (2007), 79--86.  ",
      "doi": "10.1145/1226969.1226985"
    },
    {
      "text": "Fogg, B. Persuasive Technologies: Using Computers to Change What We Think and Do. Morgan Kaufman, CA, USA, 2002. ",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Foland, A., and Lewicka, M. Psi-Map: Psychological method for psycho-cartographic research. In Poster 10th EU Congress of Psychology, SPA Press (2007).",
      "doi": ""
    },
    {
      "text": "Hayes, G. The relationship of action research to humancomputer interaction. ACM Transactions on ComputerHuman Interaction 18, 3 (2011) 15.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Hornecker, E. and Nicol, E. What do lab-based user studies tell us about in-the-wild behavior?: Insights from a study of museum interactives. In Proc DIS 2012, ACM Press (2012), 358--367.  ",
      "doi": "10.1145/2317956.2318010"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B., Druin, A., Plaisant, C. and Eiderbäck, B. Technology probes: inspiring design for and with families. In Proc CHI 2005, ACM Press (2005), 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Intille, S., Larson, K., Beaudin, J., Nawyn, J., Tapia, E. and Kaushik, P. A living laboratory for the design and evaluation of ubiquitous computing technologies. In Proc CHI 2005, (2005), 1941--1944.  ",
      "doi": "10.1145/1056808.1057062"
    },
    {
      "text": "Kalnikaite, V., Rogers, Y., Bird, J., Villar, N., Bachour, K., Payne, S. and Kreitmayer, S. How to nudge in Situ: designing lambent devices to deliver salient information in supermarkets. In Proc UbiComp 2013, ACM Press (2013), 11--20.  ",
      "doi": "10.1145/2030112.2030115"
    },
    {
      "text": "Kidd C., Orr, R., Abowd, G., Atkeson, C., Essa, I., MacIntyre, B., Mynatt, E., Starner, T. and Newstetter, W. The aware home: A living laboratory for ubiquitous computing research. In Cooperative buildings. Integrating information, organizations, and architecture. Springer (1999) 191--198 ",
      "doi": "10.5555/645969.674887"
    },
    {
      "text": "Koskinen, I., Zimmerman, J., Binder, T., Redstrom, J., and Wensveen, S. Design research through practice: From the lab, field, and showroom. Morgan Kaufman, MA, USA 2011. ",
      "doi": "10.5555/2132674"
    },
    {
      "text": "Little, B., Salmela-Aro, K. and Phillips, S. (2007). Personal project pursuit: Goals, actions and human flourishing (1st ed.). Lawrence Erlbaum Associates, NY, USA 2007.",
      "doi": ""
    },
    {
      "text": "Mateas, M., Salvador, T., Scholtz, J. and Sorensen, D. Engineering ethnography in the home. In Proc CHI 1996, ACM Press (1996), 283--284.  ",
      "doi": "10.1145/257089.257323"
    },
    {
      "text": "Mennicken, S., Scott, J., Brush, A. and Roseway, A. Finding roles for interactive furniture in homes with EmotoCouch. In Proc Ubicomp 2014, ACM Press (2014), 923--930.  ",
      "doi": "10.1145/2638728.2641547"
    },
    {
      "text": "Muller, M. PICTIVE-an exploration in participatory design. In Proc CHI 1991, ACM Press (1991), 225--231.  ",
      "doi": "10.1145/108844.108896"
    },
    {
      "text": "Neustaedter, C. and Brush, A. LINC-ing the family: The participatory design of a family calendar. In Proc CHI 2006, ACM Press (2006), 141--150.  ",
      "doi": "10.1145/1124772.1124796"
    },
    {
      "text": "Nurmi, J. Age differences in adult life goals, concerns, and their temporal extension: A life course approach to future-oriented motivation. International Journal of Behavioral Development, 15(4), (1992) 487--508.",
      "doi": ""
    },
    {
      "text": "Pousman, Z., Romero, M., Smith, A. and Mateas, M. Living with tableau machine: A longitudinal investigation of a curious domestic intelligence. In Proc Ubicomp. ACM Press (2008), 370--379.  ",
      "doi": "10.1145/1409635.1409685"
    },
    {
      "text": "Purpura, S., Schwanda, V., Williams, K., Stubler, W. and Sengers, P. Fit4life: The design of a persuasive technology promoting healthy behavior and ideal weight. In Proc CHI 2011. ACM Press, (2011), 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Rowan, J. and Mynatt, E. Digital family portrait field trial: Support for aging in place. In Proc CHI 2005, ACM Press (2005), 521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Salmela-Aro, K., Aunola, K. and Nurmi, J. E. Personal Goals During Emerging Adulthood: A 10-Year Follow Up. Journal of Adolescent Research, 22(6), (2007) 690--715.",
      "doi": ""
    },
    {
      "text": "Schwartz, T., Stevens, G., Jakobi, T., Denef, S., Ramirez, L., Wulf, V., & Randall, D. (2014). What People Do with Consumption Feedback: A Long-Term Living Lab Study of a Home Energy Management System. Interacting with Computers, (2014) 1--26.",
      "doi": ""
    },
    {
      "text": "Sellen, A., Harper, R., Eardley, R., Izadi, S., Regan, T., Taylor, A. and Wood, K. HomeNote: Supporting situated messaging in the home. In Proc CSCW 2006 ACM Press (2006), 383--392.  ",
      "doi": "10.1145/1180875.1180933"
    },
    {
      "text": "Taylor, A., Harper, R., Swan, L., Izadi, S., Sellen, A. and Perry, M. Homes that make us smart. Personal and Ubiquitous Computing 11, 5, (2007) 383--393.  ",
      "doi": "10.1007/s00779-006-0076-5"
    },
    {
      "text": "Taylor, A. and Swan, L. Artful systems in the home. In Proc CHI 2005. ACM Press, (2005), 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Venkatesh, A. (1996). Computers and other interactive technologies for the home. Communications of the ACM, 39(12), 47--54.  ",
      "doi": "10.1145/240483.240491"
    },
    {
      "text": "Wang, C. and Burris, M. Photovoice: Concept, methodology, and use for participatory needs assessment. Health education & behavior 24, 3 (1997), 369--387.",
      "doi": ""
    },
    {
      "text": "Westerlund, B., Lindqvist, S., and Sundblad, Y. (2003, September). Co-designing with and for Families. In Proc COST269, (2003), 290--294.",
      "doi": ""
    }
  ]
}