{
  "doi": "10.1145/2702123.2702490",
  "title": "Retargeting Technical Documentation to Augmented Reality",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3337-3346",
  "year": 2015,
  "badges": [],
  "abstract": "We present a system which automatically transfers printed technical documentation, such as handbooks, to three-dimensional Augmented Reality. Our system identifies the most frequent forms of instructions found in printed documentation, such as image sequences, explosion diagrams, textual annotations and arrows indicating motion. The analysis of the printed documentation works automatically, with minimal user input. The system only requires the documentation itself and a CAD model or 3D scan of the object described in the documentation. The output is a fully interactive Augmented Reality application, presenting the information from the printed documentation in 3D, registered to the real object.",
  "authors": [
    {
      "name": "Peter Mohr",
      "institution": "Institute for Computer Graphics and Vision, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699174",
      "orcid": "missing"
    },
    {
      "name": "Bernhard Kerbl",
      "institution": "Institute for Computer Graphics and Vision, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548693956",
      "orcid": "missing"
    },
    {
      "name": "Michael Donoser",
      "institution": "Institute for Computer Graphics and Vision, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317492478",
      "orcid": "missing"
    },
    {
      "name": "Dieter Schmalstieg",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100091694",
      "orcid": "missing"
    },
    {
      "name": "Denis Kalkofen",
      "institution": "Institute for Computer Graphics and Vision, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414597830",
      "orcid": "0000-0002-0359-206X"
    }
  ],
  "references": [
    {
      "text": "Agrawala, M., Phan, D., Heiser, J., Haymaker, J., Klingner, J., Hanrahan, P., and Tversky, B. Designing effective step-by-step assembly instructions. ACM Trans. Graph. 22, 3 (2003), 828--837.  ",
      "doi": "10.1145/882262.882352"
    },
    {
      "text": "Bergig, O., Hagbi, N., El-Sana, J., and Billinghurst, M. In-place 3d sketching for authoring and augmenting mechanical systems. In Proc. of ISMAR (2009), 87--94.  ",
      "doi": "10.1109/ISMAR.2009.5336490"
    },
    {
      "text": "Butz, A. Betty: Planning and generating animations for the visualization of movements and spatial relations. In Proc. of Advanced Visual Interfaces (1994), 53--58.  ",
      "doi": "10.1145/192309.192324"
    },
    {
      "text": "Canny, J. A computational approach to edge detection. IEEE Trans. Pattern Anal. Mach. Intell. 8, 6 (June 1986), 679--698.  ",
      "doi": "10.1109/TPAMI.1986.4767851"
    },
    {
      "text": "Dementhon, D. F., and Davis, L. S. Model-based object pose in 25 lines of code. Int. J. Comput. Vision 15, 1--2 (June 1995), 123--141.  ",
      "doi": "10.1007/BF01450852"
    },
    {
      "text": "Gupta, A., Fox, D., Curless, B., and Cohen, M. F. Duplotrack a real-time system for authoring and guiding duplo block assembly. In UIST (2012), 389--402.  ",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Heiser, J., Phan, D., Agrawala, M., Tversky, B., and Hanrahan, P. Identification and validation of cognitive design principles for automated generation of assembly instructions. In Proc. of AVI (2004), 311--319.  ",
      "doi": "10.1145/989863.989917"
    },
    {
      "text": "Henderson, S., and Feiner, S. Exploring the benefits of augmented reality documentation for maintenance and repair. IEEE TVCG 17, 10 (2011), 1355--1368.  ",
      "doi": "10.1109/TVCG.2010.245"
    },
    {
      "text": "Kalkofen, D., Tatzgern, M., and Schmalstieg, D. Explosion diagrams in augmented reality. In Proc of IEEE VR (2009), 71--78.  ",
      "doi": "10.1109/VR.2009.4811001"
    },
    {
      "text": "Kalkofen, D., Veas, E. E., Zollmann, S., Steinberger, M., and Schmalstieg, D. Adaptive ghosted views for augmented reality. In IEEE ISMAR (2013), 1--9.",
      "doi": ""
    },
    {
      "text": "Ledermann, F., and Schmalstieg, D. April: A high-level framework for creating augmented reality presentations. In Proc. of IEEE VR (2005), 187--194.  ",
      "doi": "10.1109/VR.2005.8"
    },
    {
      "text": "Li, W., Agrawala, M., Curless, B., and Salesin, D. Automated generation of interactive 3d exploded view diagrams. ACM Trans. Graph. 27, 3 (2008).  ",
      "doi": "10.1145/1360612.1360700"
    },
    {
      "text": "Li, W., Agrawala, M., and Salesin, D. Interactive image-based exploded view diagrams. In Prof of Graphics Interface (2004), 203--212. ",
      "doi": "10.5555/1006058.1006083"
    },
    {
      "text": "Liu, C., Yuen, J., Torralba, A., Sivic, J., and Freeman, W. T. Sift flow: Dense correspondence across different scenes. In Proc. of ECCV (2008), 28--42.  ",
      "doi": "10.1007/978-3-540-88690-7_3"
    },
    {
      "text": "Liu, M.-Y., Tuzel, O., Veeraraghavan, A., and Chellappa, R. Fast directional chamfer matching. In Proc. of CVPR (2010), 1696--1703.",
      "doi": ""
    },
    {
      "text": "Lozano-Perez, T. Spatial planning: A configuration space approach. IEEE Trans. Comput. 32, 2 (1983), 108--120.  ",
      "doi": "10.1109/TC.1983.1676196"
    },
    {
      "text": "Matas, J., Chum, O., Urban, M., and Pajdla, T. Robust wide baseline stereo from maximally stable extremal regions. In Proc. of BMVC (2002).",
      "doi": ""
    },
    {
      "text": "Mijksenaar, P., and Westendorp, P. Open Here: The Art of Instructional Design. Thames & Hudson, 1999.",
      "doi": ""
    },
    {
      "text": "Newcombe, R. A., Izadi, S., Hilliges, O., Molyneaux, D., Kim, D., Davison, A. J., Kohli, P., Shotton, J., Hodges, S., and Fitzgibbon, A. W. Kinectfusion: Real-time dense surface mapping and tracking. In ISMAR, IEEE (2011), 127--136.  ",
      "doi": "10.1109/ISMAR.2011.6092378"
    },
    {
      "text": "Petersen, N., and Stricker, D. Learning task structure from video examples for workflow tracking and authoring. In Proc of ISMAR (2012), 237--246.  ",
      "doi": "10.1109/ISMAR.2012.6402562"
    },
    {
      "text": "Romney, B., Godard, C., Goldwasser, M., and Ramkumar, G. An efficient system for geometric assembly sequence generation and evaluation. In Proc. of Computers in Engineering (1995), 699--712.",
      "doi": ""
    },
    {
      "text": "Rusu, R. B., Blodow, N., and Beetz, M. Fast point feature histograms (fpfh) for 3d registration. In ICRA, IEEE (2009), 3212--3217. ",
      "doi": "10.5555/1703435.1703733"
    },
    {
      "text": "Rusu, R. B., and Cousins, S. 3D is here: Point Cloud Library (PCL). Proc. of ICRA (2011).",
      "doi": ""
    },
    {
      "text": "Shao, T., Li, W., Zhou, K., Xu, W., Guo, B., and Mitra, N. J. Interpreting concept sketches. TOG 32, 4 (2013).  ",
      "doi": "10.1145/2461912.2462003"
    },
    {
      "text": "Srinivasan, H., and Gadh, R. Efficient geometric disassembly of multiple components from an assembly using wave propagation. Mech. Design 122 (2000), 179.",
      "doi": ""
    },
    {
      "text": "Wilson, R. H., and Latombe, J.-C. Geometric reasoning about mechanical assembly. In Proc. Algorithmic Foundations of Robotics (1995), 203--220. ",
      "doi": "10.5555/215074.215093"
    },
    {
      "text": "Zauner, J., Haller, M., Brandl, A., and Hartmann, W. Authoring of a mixed reality assembly instructor for hierarchical structures. In ISMAR (2003), 237--246. ",
      "doi": "10.5555/946248.946783"
    },
    {
      "text": "Zheng, Y., Kuang, Y., Sugimoto, S., strm, K., and Okutomi, M. Revisiting the pnp problem: A fast, general and optimal solution. In ICCV (2013), 2344--2351.  ",
      "doi": "10.1109/ICCV.2013.291"
    }
  ]
}