{
  "doi": "10.1145/2702123.2702255",
  "title": "HCI, Civic Engagement & Trust",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2833-2842",
  "year": 2015,
  "badges": [],
  "abstract": "There is a widespread belief that pervasive technologies will encourage and facilitate partnerships between citizens and civic authorities, enabling individuals to play a greater role in civic planning, service delivery and infrastructure management. However, at present sustained use and perceived value of civic engagement technologies remains low because the design space is poorly understood by system developers who focus almost exclusively on empowering citizens rather than adopting an informed, inclusive approach that addresses the needs of both citizens and civic authorities, and helps establish trusted relationships between these different stakeholders. We report on an extensive study of civic engagement in the domain of public infrastructure maintenance and provide insights into the civic management processes to support future design of trusted civic engagement interactions.",
  "authors": [
    {
      "name": "Mike Harding",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350579787",
      "orcid": "missing"
    },
    {
      "name": "Bran Knowles",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81557365856/rel-imgonly/profile2.jpg",
      "acmid": "81557365856",
      "orcid": "missing"
    },
    {
      "name": "Nigel Davies",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81100185417/rel-imgonly/nigel.jpg",
      "acmid": "81100185417",
      "orcid": "missing"
    },
    {
      "name": "Mark Rouncefield",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589917",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "The Wisdom of Crowds: Why the Many Are Smarter Than the Few. James Surowiecki, 2005.",
      "doi": ""
    },
    {
      "text": "Akamavi, N., and Kimble, C. Knowledge sharing and computer supported collaborative work: the role of organisational culture and trust. In Proceedings of the 10th Conference of the United Kingdom Academy of Information Systems, Citeseer (2005), 22.",
      "doi": ""
    },
    {
      "text": "Alliance, A. I. Annual local authority road maintenance (alarm) survey 2014. http://www.asphaltindustryalliance.com/images/ library/files/ALARM_Survey_2014.pdf.",
      "doi": ""
    },
    {
      "text": "Amazon. Amazon mechanical turk website. https://www.mturk.com/.",
      "doi": ""
    },
    {
      "text": "Aoki, P. M., Honicky, R. J., Mainwaring, A., Myers, C., Paulos, E., Subramanian, S., and Woodruff, A. A vehicle for research: Using street sweepers to explore the landscape of environmental community action. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '09, ACM (New York, NY, USA, 2009), 375--384.  ",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Association, A. P. Nyc 311 - issue reporting mobile application. http://www1.nyc.gov/connect/applications.page. Accessed: 2014-07--26.",
      "doi": ""
    },
    {
      "text": "Baier, A. Trust and antitrust. Ethics 96, 2 (1986), 231--260.",
      "doi": ""
    },
    {
      "text": "El Husseini, A., M'hamed, A., El Hassan, B., and Mokhtari, M. Trust-based authentication scheme with user rating for low-resource devices in smart environments. Personal Ubiquitous Comput. 17, 5 (June 2013), 1013--1023.  ",
      "doi": "10.1007/s00779-012-0548-8"
    },
    {
      "text": "for an Urban Future, C. Caution ahead: Overdue nvestments for new york's aging infrastructure. http://nhtsurvey2013.econtrack.co.uk, March 2014.",
      "doi": ""
    },
    {
      "text": "Gonçalves, J., Kostakos, V., Karapanos, E., Barreto, M., Camacho, T., Tomasic, A., and Zimmerman, J. Citizen motivation on the go: The role of psychological empowerment. Interacting with Computers (2013), iwt035.",
      "doi": ""
    },
    {
      "text": "Group, N. S. S. National highways public satisfaction survey. http://nhtsurvey2013.econtrack.co.uk.",
      "doi": ""
    },
    {
      "text": "Grudin, J. Why cscw applications fail: problems in the design and evaluationof organizational interfaces. In Proceedings of the 1988 ACM conference on Computer-supported cooperative work, ACM (1988).  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Kazemi, L., Shahabi, C., and Chen, L. Geotrucrowd: Trustworthy query answering with spatial crowdsourcing. In Proceedings of the 21st ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems, SIGSPATIAL'13, ACM (New York, NY, USA, 2013), 314--323.  ",
      "doi": "10.1145/2525314.2525346"
    },
    {
      "text": "Knowles, B., Harding, M., Blair, L., Davies, N., Hannon, J., Rouncefield, M., and Walden, J. Trustworthy by design. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work Social Computing, CSCW '14, ACM (New York, NY, USA, 2014), 1060--1071.  ",
      "doi": "10.1145/2531602.2531699"
    },
    {
      "text": "Olphert, C. W., and Damodaran, L. Citizen participation and engagement in the design of e-government services: The missing link in effective ict design and delivery. J. AIS 8, 9 (2007).",
      "doi": ""
    },
    {
      "text": "openPlans Organisation. Open311 civic issue tracking specification. http://open311.org/.",
      "doi": ""
    },
    {
      "text": "openSociety. Fix my street website. http://www.fixmystreet.com/.",
      "doi": ""
    },
    {
      "text": "Org., N. Neat streets website. www.neatstreets.com.au.",
      "doi": ""
    },
    {
      "text": "Parker, S., Spires, P., Farook, F., and Mean, M. State of Trust - How to Build Better Relationships Between Councils and the Public. Demos, 2008.",
      "doi": ""
    },
    {
      "text": "Patrick, A., Marsh, S., Briggs, P., et al. Designing systems that people will trust.",
      "doi": ""
    },
    {
      "text": "Putnam, R. D. Bowling Alone: The Collapse and Revival of American Community. Simon & Schuster, New York, 2000.",
      "doi": ""
    },
    {
      "text": "Rousseau, D. M., Sitkin, S. B., Burt, R. S., and Camerer, C. Not so different after all: A cross-discipline view of trust. Academy of Management Review 23 (1998).",
      "doi": ""
    },
    {
      "text": "Thatcher, J. B., Carter, M., Li, X., and Rong, G. A classification and investigation of trustees in b-to-c e-commerce: General vs. specific trust. Communications of the Association for Information Systems 32 (2013).",
      "doi": ""
    },
    {
      "text": "Tsampoulatidis, I., Ververidis, D., Tsarchopoulos, P., Nikolopoulos, S., Kompatsiaris, I., and Komninos, N. Improvemycity: An open source platform for direct citizen-government communication. In Proceedings of the 21st ACM International Conference on Multimedia, MM '13, ACM (New York, NY, USA, 2013), 839--842.  ",
      "doi": "10.1145/2502081.2502225"
    },
    {
      "text": "Yu, H., Shen, Z., Miao, C., and An, B. A reputation-aware decision-making approach for improving the efficiency of crowdsourcing systems. In Proceedings of the 2013 International Conference on Autonomous Agents and Multi-agent Systems, AAMAS '13 (Richland, SC, 2013), 1315--1316. ",
      "doi": "10.5555/2484920.2485201"
    }
  ]
}