{
  "doi": "10.1145/2702123.2702451",
  "title": "Weave: Scripting Cross-Device Wearable Interaction",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3923-3932",
  "year": 2015,
  "badges": [],
  "abstract": "We present Weave, a framework for developers to create cross-device wearable interaction by scripting. Weave provides a set of high-level APIs, based on JavaScript, for developers to easily distribute UI output and combine sensing events and user input across mobile and wearable devices. Weave allows developers to focus on their target interaction behaviors and manipulate devices regarding their capabilities and affordances, rather than low-level specifications. Weave also contributes an integrated authoring environment for developers to program and test cross-device behaviors, and when ready, deploy these behaviors to its runtime environment on users' ad-hoc network of devices. An evaluation of Weave with 12 participants on a range of tasks revealed that Weave significantly reduced the effort of developers for creating and iterating on cross-device interaction.",
  "authors": [
    {
      "name": "Pei-Yu (Peggy) Chi",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81440599192/rel-imgonly/peggychi_se2.jpg",
      "acmid": "81440599192",
      "orcid": "0000-0001-8511-2834"
    },
    {
      "name": "Yang Li",
      "institution": "Google Research, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    }
  ],
  "references": [
    {
      "text": "Apple Inc. Apple -- iOS 8 -- Continuity. https://www.apple.com/ios/whats-new/continuity/ (2014).",
      "doi": ""
    },
    {
      "text": "Boring, S., Baur, D., Butz, A., Gustafson, S., and Baudisch, P. Touch projector: Mobile Interaction through Video. In Proc. CHI '10, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Bostock, M., Ogievetsky, V., and Heer, J. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, (2011).  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Chen, X., Grossman, T., Wigdor, D.J., and Fitzmaurice, G. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proc. CHI '14, ACM Press (2014).  ",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Chen, X., Marquardt, N., Tang, A., Boring, S., and Greenberg, S. Extending a mobile device's interaction space through body-centric interaction. In Proc. MobileHCI '12, ACM Press (2012).  ",
      "doi": "10.1145/2371574.2371599"
    },
    {
      "text": "Dearman, D. and Pierce, J.S. \"It's on my other computer!\": Computing with Multiple Devices. In Proc. CHI '08, ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Elmqvist, N. Distributed user interfaces: State of the art. In Distributed User Interfaces. Springer London, 2011, 1--12.",
      "doi": ""
    },
    {
      "text": "Feiner, S. and Shamash, A. Hybrid user interfaces: breeding virtually bigger interfaces for physically smaller computers. In Proc. UIST '91, ACM Press (1991).  ",
      "doi": "10.1145/120782.120783"
    },
    {
      "text": "Fitbit Inc. Fitbix Flex. http://www.fitbit.com/flex (2014).",
      "doi": ""
    },
    {
      "text": "Frosini, L. and Paternò, F. User interface distribution in multi-device and multi-user environments with dynamically migrating engines. In Proc. EICS 2014, ACM Press (2014).  ",
      "doi": "10.1145/2607023.2607032"
    },
    {
      "text": "1Gjerlufsen, T., Klokmose, C.N., Eagan, J., Pillias, C., and Beaudouin-Lafon, M. Shared substance: developing flexible multi-surface applications. In Proc. CHI '11, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1979446"
    },
    {
      "text": "Google Inc. Chromecast. http://www.google.com/chrome/devices/chromecast/ (2014).",
      "doi": ""
    },
    {
      "text": "Google Inc. Google Glass. https://www.google.com/glass/start/ (2014).",
      "doi": ""
    },
    {
      "text": "Google Inc. Android Wear: The developer's perspective. https://www.google.com/events/io/io14videos/ (2014).",
      "doi": ""
    },
    {
      "text": "Google Inc. UI Patterns for Android Wear. https://developer.android.com/design/wear/ (2014).",
      "doi": ""
    },
    {
      "text": "Google Inc. Google Glass -- Patterns. https://developers.google.com/glass/design/patterns (2014).",
      "doi": ""
    },
    {
      "text": "Hamilton, P. and Wigdor, D.J. Conductor: enabling and understanding cross-device interaction. In Proc. CHI '14, ACM Press (2014).  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Hartmann, B., Beaudouin-Lafon, M., and Mackay, W.E. HydraScope: Creating Multi-Surface Meta-Applications Through View Synchronization and Input Multiplexing. In Proc. PerDis '13, ACM Press (2013).  ",
      "doi": "10.1145/2491568.2491578"
    },
    {
      "text": "Hernandez, J., Li, Y., Rehg, J.M., and Picard, R.W. BioGlass: Physiological Parameter Estimation Using a Head-mounted Wearable Device. In Proc. MobiHealth '14 (2014).",
      "doi": ""
    },
    {
      "text": "Ishimaru, S., Kunze, K., Kise, K., Weppner, J., Dengel, A., Lukowicz, P., and Bulling, A In the blink of an eye -- Combining Head Motion and Eye Blink Frequency for Activity Recognition with Google Glass. In Proc. AH '14, ACM Press (2014).  ",
      "doi": "10.1145/2582051.2582066"
    },
    {
      "text": "2Marcotte, E. Responsive Web Design. A Book Apart (2011).",
      "doi": ""
    },
    {
      "text": "2Marquardt, N., Diaz-Marino, R., Boring, S., and Greenberg, S. The proximity toolkit: Prototyping Proxemic Interactions in Ubiquitous Computing Ecologies. In Proc. UIST '11, ACM Press (2011).  ",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Marquardt, N., Hinckley, K., and Greenberg, S. Cross-device interaction via micro-mobility and f-formations. In Proc. UIST '12, ACM Press (2012).  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Mayer, S., Tschofen, A., Dey, A. K., Mattern, F. User Interfaces for Smart Things - A Generative Approach with Semantic Interaction Descriptions. ACM Transactions on Computer-Human Interaction (2014), 21, 2, article 12.  ",
      "doi": "10.1145/2584670"
    },
    {
      "text": "Nebeling, M., Mintsi, T., Husmann, M., and Norrie, M. Interactive development of cross-device user interfaces. In Proc. CHI '14, ACM Press (2014).  ",
      "doi": "10.1145/2556288.2556980"
    },
    {
      "text": "Paternò, F., Santoro, C., Spano, L.D. MARIA: A Universal Language for Service-Oriented Applications in Ubiquitous Environment. ACM Transactions on Computer-Human Interaction (2009), 16, 4, article 19.  ",
      "doi": "10.1145/1614390.1614394"
    },
    {
      "text": "Santosa, S. and Wigdor, D. A field study of multi-device workflows in distributed workspaces. In Proc. UbiComp '13, ACM Press (2013).  ",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Serrano, M., Ens, B.M., and Irani, P.P. Exploring the use of hand-to-face input for interacting with head-worn displays. In Proc. CHI '14, ACM Press (2014).  ",
      "doi": "10.1145/2556288.2556984"
    },
    {
      "text": "Sinha, A. K. Informally Prototyping Multimodal, Multidevice User Interfaces. Ph.D. Dissertation. UC Berkeley (2003). ",
      "doi": "10.5555/1023232"
    },
    {
      "text": "Wagner, J., Nancel, M., Gustafson, S.G., Huot, S., and Mackay, W.E. Body-centric design space for multi-surface interaction. In Proc. CHI '13, ACM Press (2013).  ",
      "doi": "10.1145/2470654.2466170"
    },
    {
      "text": "3Weiser, M. and Brown, J.S. The coming age of calm technology. Beyond calculation: the next fifty years, Copernicus (1997). ",
      "doi": "10.5555/504928.504934"
    },
    {
      "text": "3Yang, J. and Wigdor, D. Panelrama: Enabling Easy Specification of Cross-Device Web Applications. In Proc. CHI '14, ACM Press (2014).  ",
      "doi": "10.1145/2556288.2557199"
    },
    {
      "text": "3Zhang, B., Chen, Y., Tuna, C., Dave, A., Li, Y., and Lee, E., Hartmann, B. HOBS: Head Orientation-Based Selection in Physical Spaces. In Proc. SUI '14 (2014).  ",
      "doi": "10.1145/2659766.2659773"
    }
  ]
}