{
  "doi": "10.1145/2702123.2702321",
  "title": "Understanding Individual Differences for Tailored Smoking Cessation Apps",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1699-1708",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Finding ways to help people quit smoking is a high priority in health behavior change research. Recent HCI studies involving technologies using specific quitting techniques such as social support and SMS messaging to help people quit have reported some success. Early studies using computer generated print material report significant success of tailored versus non-tailored material, however, there is limited understanding on what aspects of digitally delivered quitting assistance should be tailored and how. To address this, we have conducted an empirical investigation with smokers to identify perceived importance of different types of help when quitting and the potential role of technology in providing such help. We found that people are highly individual in their approach to quitting and the kind of help they regard as relevant to their situation. Our contribution is a collection of empirically derived themes for tailoring smoking cessation apps to individual quitting needs.",
  "authors": [
    {
      "name": "Jeni Paay",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423598",
      "orcid": "missing"
    },
    {
      "name": "Jesper Kjeldskov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020677",
      "orcid": "0000-0001-7990-4229"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Lars Lichon",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658642146",
      "orcid": "missing"
    },
    {
      "name": "Stephan Rasmussen",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640201",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abroms, L., Padmanabhan, N., Thaweethai, L. and Phillips, T. iPhone Apps for Smoking Cessation: A Content Analysis. Am. J. of Preventive Medicine, 40, 3 (2011), 279--285.",
      "doi": ""
    },
    {
      "text": "Abroms, L., Westmaas, L., Bontemps-Jones, J., Ramani, R. and Mellerson, J. A Content Analysis of Popular Smartphone Apps for Smoking Cessation. Am. J. of Preventive Medicine, 45, 6 (2013), pp. 732--736.",
      "doi": ""
    },
    {
      "text": "Ahijevych, K. and Wewers, M. Processes of Change Across Five Stages of Smoking Cessation. Addictive Behaviors, 17 (1992), 17--25.",
      "doi": ""
    },
    {
      "text": "Ali, A., Hossain, S., Hovsepian, K., Rahman, M., Plarre, K. and Kumar, S. mPuff: Automated Detection of Cigarette Smoking Puffs from Respiration Measurements. In Proc. IPSN '12, ACM Press (2012), pp. 269--280.  ",
      "doi": "10.1145/2185677.2185741"
    },
    {
      "text": "Ananthanarayan, S., Lapinski, N., Siek, K. and Eisenberg, M. Towards the Crafting of Personal Health Technologies. In Proc. DIS '14, ACM Press (2014), 587--596.  ",
      "doi": "10.1145/2598510.2598581"
    },
    {
      "text": "Aveyard, P., Massey, L., Parsons, A., Manaseki, S. and Griffin, C. The effect of Transtheoretical Model based interventions on smoking cessation. Social Science and Medicine, 68 (2009), 397--403.",
      "doi": ""
    },
    {
      "text": "Backinger, C. and Auguston, E. Where There's an App There's a Way? Am. J. of Preventive Medicine, 40, 3 (2011), 390--391.",
      "doi": ""
    },
    {
      "text": "Choe, E., Lee, N., Lee, B., Pratt, W. and Kientz, J. Understanding Quantified-Selfers' Practice in Collecting and Exploring Personal Data. In Proc. CHI '14, ACM Press (2014), pp. 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Chung, W., Kim, H., Lim, S., Lee, S. and Cho, K. Factors influencing cigarette smoking and quantified implications for anti-smoking policy: evidence from South Korea. Int. Journal of Public Health, 54, 6 (2009), 409--419.",
      "doi": ""
    },
    {
      "text": "Cummings, K., Hellmann, R. and Emon, S. Correlates of Participation in a Worksite Stop-Smoking Contest. Journal of Behavioral Medicine, 11, 3 (1988), 267--277.",
      "doi": ""
    },
    {
      "text": "Fogg, B. Persuasive Technology. Morgan Kaufmann, 2003.",
      "doi": ""
    },
    {
      "text": "Fogg, B. and Allen, E. 10 Uses of Texting to Improve Health. In Proc. Persuasive '09, ACM Press (2009), Article 38.  ",
      "doi": "10.1145/1541948.1541997"
    },
    {
      "text": "Gaver, B., Dunne, T. and Pacenti, E. Design: Cultural probes. Interactions, 6,1 (1999).  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Girma, E., Assefa, T. and Deribew, A. Cigarette smokers' intention to quit smoking in Dire Dawa town Ethiopia: an assessment using the Transtheoretical Model. BMC Public Health, 10 (2010).",
      "doi": ""
    },
    {
      "text": "Godtfredsen, N. and Prescott, E. Effect of Smoking Reduction on Lung Cancer Risk. J. of the Am. Medical Association, 294, 12 (2005), pp. 1505--1510",
      "doi": ""
    },
    {
      "text": "Graham, C., Benda, P., Howard, S., Balmford, J., Bishop, N. and Borland, R. \"heh -- keeps me off the smokes...\": Probing Technology Support for Personal Change. In Proc. OzCHI'06, ACM Press (2006), 221228.  ",
      "doi": "10.1145/1228175.1228214"
    },
    {
      "text": "Heckler, E., Klasnja, P., Froehlich, J. and Buman, M. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proc. CHI'13, ACM Press (2013), 3307--3316.  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Klasnja, P., Consolvo, S. and Pratt, W. How to evaluate technologies for health behavior change in HCI research. In Proc. CHI'11, ACM Press (2011), 30633072.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Marlatt, G. and Donovan, D. Relapse Prevention. Guilford Press, 2005.",
      "doi": ""
    },
    {
      "text": "Michie, S. and West, R. Behaviour change theory and evidence: a presentation to Government. Health Psych Review, 7, 1 (2013), 1--22.",
      "doi": ""
    },
    {
      "text": "Michie, S. Hyder, N., Walia, A. and West, R. Development of a taxonomy of behaviour change techniques used in individual behavioural support for smoking cessation. Addictive Behaviors, 36 (2011), 315319.",
      "doi": ""
    },
    {
      "text": "Michie, S., van Stralen, M. and West, R. The behaviour change wheel: A new method for characterising and designing behaviour change interventions. Implementation Science, 6 (2011), 42.",
      "doi": ""
    },
    {
      "text": "Morris, M. Motivating Change with Mobile: Seven Guidelines. Interactions, 19, 3 (2012), 26--31.  ",
      "doi": "10.1145/2168931.2168939"
    },
    {
      "text": "Murnane, E. and Counts, S. Unraveling Abstinence and Relapse: Smoking Cessation Reflected in Social Media. In Proc. CHI'14, ACM Press (2014), 1345--1354.  ",
      "doi": "10.1145/2556288.2557145"
    },
    {
      "text": "Paay, J., Kjeldskov, J., Brinthaparan, U., Lichon, L., Rasmussen, S., Srikandaraja, N., Smith, W., Wadley, G., Ploderer, B. Quitty: Using Technology to Persuade Smokers to Quit. In Proc. NordiCHI'14, ACM Press (2014).  ",
      "doi": "10.1145/2639189.2639195"
    },
    {
      "text": "Park, E., DePue, J., Goldstein, M., Niaura, R., Harlow, L., Willey, C., Rakowski, W. and Prokhorov, A. Assessing the Transtheoretical Model of Change Constructs for Physicians Counseling Smokers. Annals of Behavioral Medicine, 25, 2 (2003), 120--126.",
      "doi": ""
    },
    {
      "text": "Ploderer, B., Smith, W., Howard, S. Pearce, J. and Borland, R. Patterns of Support in an Online Community for Smoking Cessation. In Proc. C&T'13, ACM Press (2013), 26--35.  ",
      "doi": "10.1145/2482991.2482992"
    },
    {
      "text": "Ploderer, B., Smith, W., Howard, S. Pearce, J. and Borland, R. Things You Don't Want to Know About Yourself: Ambivalence About Tracking and Sharing Personal Information for Behavior Change. In Proc. OzCHI'12, ACM Press (2012), 489--492.  ",
      "doi": "10.1145/2414536.2414610"
    },
    {
      "text": "Ploderer, B., Smith, W., Howard, S. Pearce, J. and Borland, R. Introducing the Ambivalent Socialiser. In Proc. CHI'12, ACM Press (2012), 1511--1514.  ",
      "doi": "10.1145/2207676.2208613"
    },
    {
      "text": "Ploderer, B., Smith, W., Pearce, J. and Borland, R. A Mobile App Offering Distractions and Tips to Cope With Cigarette Craving: A Qualitative Study. JMIR mHealth uHealth 2, 2 (2014), e23.",
      "doi": ""
    },
    {
      "text": "Primatesta, P., Falaschetti, E., Gupta, S., Marmot, M. and Poulter, N. Association Between Smoking and Blood Pressure. Hypertension, 37 (2001), 187--193.",
      "doi": ""
    },
    {
      "text": "Prochaska, J. and Velicer, W. The Transtheoretical Model of Health Behavior Change. Am. J. of Health Promotion, 12, 1 (1997), 38--48.",
      "doi": ""
    },
    {
      "text": "Roubroeks, M., Ham, J. and Midden, C. When Artificial Social Agents Try to Persuade People: The Role of Social Agency on the Occurrence of Psychological Reactance. Int. J. of Social Robotics, 3, 2 (2011), 155165.",
      "doi": ""
    },
    {
      "text": "Scholl, P., Kücükyildiz, N. and Laerhoven, K. Demo: When Do You Light a Fire? Capturing Tobacco Use with Situated Wearable Sensors. In Proc. UbiComp'13, ACM Press (2013), 1309--1310.  ",
      "doi": "10.1145/2494091.2499905"
    },
    {
      "text": "Shimoda, T. and Stapel, L. Increasing Relevance of Smoking Cessation Messages in an Online Software Agent Environment. In Proc. HICSS'06, Vol. 5, IEEE (2006), 89a.  ",
      "doi": "10.1109/HICSS.2006.219"
    },
    {
      "text": "Snuggs, S. and Hajek, P. Responsiveness to reward following cessation of smoking. Psychopharmacology, 225, 4 (2013), 869--873.",
      "doi": ""
    },
    {
      "text": "Springer Healthcare News. Financial reward stubs out smoking habit. Published online, Springer Healthcare (2012).",
      "doi": ""
    },
    {
      "text": "Strauss, A. and Corbin, J. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Strecher, V. Computer-tailored smoking cessation materials: A review and discussion. Patient Education and Counseling, 26, 2 (1999), 107--117.",
      "doi": ""
    },
    {
      "text": "The Fagerströms Test. http://www.health.wa.gov.au/smokefree/docs/Fgerstrom _Test.pdf. Government of Western Australia Department of Health.",
      "doi": ""
    },
    {
      "text": "Valdivieso-López, E., Flores-Mateo, G., Molina-Gómez, J., Rey-Reñones, C., Uriarte, M.B., Duch, J. and Valverde, A. Efficacy of a mobile application for smoking cessation in young people: study protocol for a clustered randomized trial. BMC Public Health 2013, 13 (2013).",
      "doi": ""
    },
    {
      "text": "West, R. and Brown, J. Theory of Addiction. Wiley Blackwell, 2013.",
      "doi": ""
    },
    {
      "text": "West, R. with Smyth, C., West, J. The SmokeFree Formula. Orian, 2013.",
      "doi": ""
    },
    {
      "text": "Zhang M. and Yang, C. The Effectiveness of Smoking Cessation Intervention on Facebook: A Preliminary Study of Posts and Users. In Proc. ICSH'13, Springer (2013), pp. 7--17.  ",
      "doi": "10.1007/978-3-642-39844-5_2"
    }
  ]
}