{
  "doi": "10.1145/2702123.2702507",
  "title": "Motif: Supporting Novice Creativity through Expert Patterns",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1211-1220",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Creating personal narratives helps people build meaning around their experiences. However, novices lack the knowledge and experience to create stories with strong narrative structure. Current storytelling tools often structure novice work through templates, enforcing a linear creative process that asks novices for materials they may not have. In this paper, we propose scaffolding creative work using storytelling patterns extracted from stories created by experts. Patterns are modular sets of related camera shots that expert videographers commonly use to achieve a specific narrative function. After identifying a set of patterns from high-quality storytelling videos, we created Motif, a mobile video storytelling application that allows users to construct video stories by combining these patterns. By making existing solutions used by experts available to novices, we encourage capturing shots with story structure and narrative goals in mind. In a controlled study where we asked participants to create travel video stories, videos created with patterns conveyed stronger narrative structure and were considered higher quality by expert evaluators than videos created without patterns.",
  "authors": [
    {
      "name": "Joy Kim",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259149257",
      "orcid": "missing"
    },
    {
      "name": "Mira Dontcheva",
      "institution": "Adobe Research, San Francisco, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654713",
      "orcid": "missing"
    },
    {
      "name": "Wilmot Li",
      "institution": "Adobe Systems, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100480929",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    },
    {
      "name": "Daniela Steinsapir",
      "institution": "Adobe Research & Wikispaces, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479663252",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Animoto. http://animoto.com/.",
      "doi": ""
    },
    {
      "text": "Explory. http://www.explory.com/.",
      "doi": ""
    },
    {
      "text": "iMovie. https://www.apple.com/mac/imovie/.",
      "doi": ""
    },
    {
      "text": "Memoir. http://www.yourmemoir.com/.",
      "doi": ""
    },
    {
      "text": "Timehop. http://timehop.com/.",
      "doi": ""
    },
    {
      "text": "Alexander, C., Ishikawa, S., and Silverstein, M. Pattern languages. Center for Environmental Structure 2 (1977).",
      "doi": ""
    },
    {
      "text": "Balabanović, M., Chu, L. L., and Wolff, G. J. Storytelling with digital photographs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '00, ACM (New York, NY, USA, 2000), 564--571.  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Barry, B. A. Mindful Documentary. PhD thesis, Cambridge, MA, USA, 2005. AAI0808503. ",
      "doi": "10.5555/1144829"
    },
    {
      "text": "Chi, P.-Y., and Lieberman, H. Intelligent assistance for conversational storytelling using story patterns. In Proceedings of the 16th International Conference on Intelligent User Interfaces, IUI '11, ACM (New York, NY, USA, 2011), 217--226.  ",
      "doi": "10.1145/1943403.1943438"
    },
    {
      "text": "Duyne, D. K. V., Landay, J., and Hong, J. I. The Design of Sites: Patterns, Principles, and Processes for Crafting a Customer-Centered Web Experience. Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA, 2002. ",
      "doi": "10.5555/548998"
    },
    {
      "text": "Hodges, S., Williams, L., Berry, E., Izadi, S., Srinivasan, J., Butler, A., Smyth, G., Kapur, N., and Wood, K. Sensecam: A retrospective memory aid. In Proceedings of the 8th International Conference on Ubiquitous Computing, UbiComp'06, Springer-Verlag (Berlin, Heidelberg, 2006), 177--193.  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "Lindley, S. E., Durrant, A. C., Kirk, D. S., and Taylor, A. S. Collocated social practices surrounding photos. In CHI'08 Extended Abstracts on Human Factors in Computing Systems, ACM (2008), 3921--3924.  ",
      "doi": "10.1145/1358628.1358957"
    },
    {
      "text": "Petrelli, D., van den Hoven, E., and Whittaker, S. Making history: Intentional capture of future memories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '09, ACM (New York, NY, USA, 2009), 1723--1732.  ",
      "doi": "10.1145/1518701.1518966"
    },
    {
      "text": "Resnick, M., Maloney, J., Monroy-Hernández, A., Rusk, N., Eastmond, E., Brennan, K., Millner, A., Rosenbaum, E., Silver, J., Silverman, B., and Kafai, Y. Scratch: Programming for all. Commun. ACM 52, 11 (Nov. 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Rubin, M. The little digital video book. Pearson Education, 2008. ",
      "doi": "10.5555/1457431"
    },
    {
      "text": "Stokes, P. D. Creativity from constraints: The psychology of breakthrough. Springer Publishing Company, 2005.",
      "doi": ""
    },
    {
      "text": "Thiry, E., Lindley, S., Banks, R., and Regan, T. Authoring personal histories: Exploring the timeline as a framework for meaning making. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), pp. 1619--1628.  ",
      "doi": "10.1145/2470654.2466215"
    },
    {
      "text": "Van House, N., Davis, M., Takhteyev, Y., Good, N., Wilhelm, A., and Finn, M. From what? to why?: the social uses of personal photos. In Proc. of CSCW 2004, Citeseer (2004).",
      "doi": ""
    },
    {
      "text": "Wines-Reed, J., and Wines, J. Scrapbooking for Dummies. John Wiley & Sons, 2011.",
      "doi": ""
    }
  ]
}