{
  "doi": "10.1145/2702123.2702360",
  "title": "Effects of Ad Quality & Content-Relevance on Perceived Content Quality",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2231-2234",
  "year": 2015,
  "badges": [],
  "abstract": "Native advertising, ads that are highly cohesive with actual content in format and style, is a pervasive online trend. We report on a two-stage Mechanical Turk experiment exploring the effects of perceived quality of native ads on perceptions of site quality. First, a set of native ads was rated (N=98) for perceived annoyance and trust. Second, we compare four conditions of an aggregation of news headlines (N=237): 'no ads', 'low quality ads', 'high quality ads + content-relevant', 'high-quality ads + not content-relevant'. Our results indicate that native ads, which in isolation have been rated as high quality, could still have a negative effect on perceived site credibility and perceived site quality if they are too content-relevant. In addition to the effect of ad quality alone (e.g. non-annoying, trustworthy ads), there is an additional impact for ads that are too similar to content; avoiding confusion is important for quality perceptions.",
  "authors": [
    {
      "name": "Henriette Cramer",
      "institution": "Yahoo Labs, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487965",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agarwal, L., Shrivastava, N., Jaiswal, S., Panjwani, S. Do Not Embarrass: Re-Examining User Concerns for Online Tracking and Advertising, Proc. SOUPS'13.  ",
      "doi": "10.1145/2501604.2501612"
    },
    {
      "text": "Buscher, G., Dumais, S., Cutrell, E. 2010. The good, the bad, and the random: an eye-tracking study of ad quality in web search. Proc. SIGIR'10.  ",
      "doi": "10.1145/1835449.1835459"
    },
    {
      "text": "Cho, C-H. Cheon, H. Why do people avoid advertising on the Internet? Journal of Advertising 33, 4 (2004).",
      "doi": ""
    },
    {
      "text": "De Sa, M., Navalpakkam, V., Churchill, E. (2013). Mobile advertising: evaluating the effects of animation, user and content relevance. Proc. CHI'13, 2487--2496.  ",
      "doi": "10.1145/2470654.2481344"
    },
    {
      "text": "Gladney, G., Shapiro, I., Castaldo, J. Online editors rate web news. Newspaper Research Journal 28, 1, 2007",
      "doi": ""
    },
    {
      "text": "Goldfarb, A, Tucker, C. Online Display Advertising: Targeting and Obtrusiveness, Marketing Science 30, (3), 389--404 (2011).  ",
      "doi": "10.1287/mksc.1100.0583"
    },
    {
      "text": "Goldsmith, R., Lafferty, B. Newell, S. The Impact of Corporate Credibility and Celebrity Credibility on Consumer Reaction to Advertisements and Brands, Journal of Advertising 29, 3 (2000), 43--54",
      "doi": ""
    },
    {
      "text": "Goldstein, P., McAfee, S. (2013) The Cost of Annoying Ads, Proc. WWW'13, 459--470. ",
      "doi": "10.1145/2488388.2488429"
    },
    {
      "text": "IAB, The Native Advertising Playbook, http://bit.ly/1gzLtDh, accessed Sept 10, 2014.",
      "doi": ""
    },
    {
      "text": "IPG Media Lab, Native Ad Research from IPG & Sharethrough Reveals that In-Feed Beats Banners, http://bit.ly/1qmrhMs, accessed Aug 28, 2014.",
      "doi": ""
    },
    {
      "text": "1Lacy, S. Fico, F. The link between newspaper content quality and circulation. Newspaper Research Journal, 12,2 (1991) 46--57.",
      "doi": ""
    },
    {
      "text": "Yan, J., Liu,N., Wang,G., Zhang, W. Jiang,Y. and Chen, Z. How much can behavioral targeting help online advertising?, Proc. WWW'09, 261--270.  ",
      "doi": "10.1145/1526709.1526745"
    }
  ]
}