{
  "doi": "10.1145/2702123.2702542",
  "title": "Flow is Not Enough: Understanding the Needs of Advanced Amateur Runners to Design Motivation Technology",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2013-2022",
  "year": 2015,
  "badges": [],
  "abstract": "Motivation studies on running are often focused on how to convince non-runners to run, mainly through designing for extrinsic motivations such as health concerns or external reward systems. In contrast, we conducted a structured inquiry into understanding how to design technology for those whom are already committed to running and participate in organized races. Through interviews, focus groups, ethnographic observation, questionnaires, and design-based research over the course of two years, we investigated the needs of the advanced amateur runner community. An analysis of the gathered data led to five design themes -- Festival, Competition, Practicalities, Togetherness, and Support -- to inform future runner motivation technology. While flow theory appears to be a convenient tool to understand support during a race, we observed a number of other factors that need to be considered. Through combining the themes with previous research, we conclude by presenting nine guidelines for designing technology for this domain.",
  "authors": [
    {
      "name": "Kristina Knaving",
      "institution": "University of Gothenburg, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440620710",
      "orcid": "missing"
    },
    {
      "name": "Paweł Woźniak",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    },
    {
      "name": "Morten Fjeld",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100571519",
      "orcid": "missing"
    },
    {
      "name": "Staffan Björk",
      "institution": "University of Gothenburg, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100363935",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bloom, B.S. and Sosniak, L.A. Developing talent in young people. Ballantine Books, New York, 1985.",
      "doi": ""
    },
    {
      "text": "Brière, N.M., Vallerand, R.J., Blais, M.R., and Pelletier, L.G. Développement et Validation d'une Mesure de Motivation Intrinsèque, Extrinsèque et d'Amotivation en Contexte Sportif: L'Échelle de Motivation dans les Sports (ÉMS). International Journal of Sport Psychology 26, 4 (1995), 465--489.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Flow: the psychology of optimal experience. 1990.",
      "doi": ""
    },
    {
      "text": "Curmi, F., Ferrario, M.A., Southern, J., and Whittle, J. HeartLink: open broadcast of live biometric data to social networks. CHI '13, ACM (2013), 1749--1758.  ",
      "doi": "10.1145/2470654.2466231"
    },
    {
      "text": "Deci, E.L., Koestner, R., and Ryan, R.M. A metaanalytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological bulletin 125, 6 (1999), 627--68; discussion 692--700.",
      "doi": ""
    },
    {
      "text": "Dourish, P. and Bell, G. Divining a digital future: Mess and mythology in ubiquitous computing. Cambridge: MIT Press, 2011. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Fogg, B.J. Introduction to Persuasive 2014. 2014.",
      "doi": ""
    },
    {
      "text": "Getz, D. The Nature and Scope of Festival Studies. International Journal of Event Management Research 5, (2010), 1--47.",
      "doi": ""
    },
    {
      "text": "Graether, E. and Mueller, F. Joggobot: a flying robot as jogging companion. CHI EA '12, ACM (2012), 1063--1066.  ",
      "doi": "10.1145/2212776.2212386"
    },
    {
      "text": "McGookin, D.K. and Brewster, S.A. Investigating and supporting undirected navigation for runners. CHI EA '13, ACM Press (2013), 1395.  ",
      "doi": "10.1145/2468356.2468605"
    },
    {
      "text": "Morgan, W. and Pollock, M. Psychologic characterization of the elite distance runner. Annals of the New York Academy of Sciences 301, (1977), 382--403.",
      "doi": ""
    },
    {
      "text": "Mueller, F., Vetere, F., Gibbs, M.R., Edge, D., Agamanolis, S., and Sheridan, J.G. Jogging over a distance between Europe and Australia. UIST '10, ACM Press (2010), 189.  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Mynatt, E.D., Rowan, J., Craighill, S., and Jacobs, A. Digital family Digital family portraits: supporting peace of mind for extended family members. CHI '01, ACM Press (2001), 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "De Oliveira, R. and Oliver, N. TripleBeat: enhancing exercise performance with persuasion. Mobile HCI 2008, ACM (2008), 255--264.  ",
      "doi": "10.1145/1409240.1409268"
    },
    {
      "text": "Pelletier, L.G., Tuson, K.M., Fortier, M.S., et al. Toward a New Measure of Intrinsic Motivation , Extrinsic Motivation , and Amotivation in Sports'?: The Sport Motivation Scale (SMS). English 17, 1 (1995), 35--53.",
      "doi": ""
    },
    {
      "text": "Ryan, R. and Deci, E. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. Contemporary educational psychology 25, 1 (2000), 54-- 67.",
      "doi": ""
    },
    {
      "text": "Ryan, R.M. and Deci, E.L. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. The American psychologist 55, (2000), 68--78.",
      "doi": ""
    },
    {
      "text": "Schüler, J. and Brunner, S. The rewarding effect of flow experience on performance in a marathon race. Psychology of Sport and Exercise 10, 1 (2009), 168-- 174.",
      "doi": ""
    },
    {
      "text": "Sellen, A., Rogers, Y., Harper, R., and Rodden, T. Human Values in the Digital Age. Communications of the ACM 52, 3 (2009), 58--66.  ",
      "doi": "10.1145/1467247.1467265"
    },
    {
      "text": "Shipway, R., Holloway, I., and Jones, I. Organisations, practices, actors, and events: Exploring inside the distance running social world. International Review for the Sociology of Sport 48, 3 (2012), 259--276.",
      "doi": ""
    },
    {
      "text": "Sosnowski, L. Sztuka jako swietowanie. Estetyka i Krytyka, 2(5) (2003), 90--105.",
      "doi": ""
    },
    {
      "text": "Toscos, T., Faber, A., An, S., and Gandhi, M.P. Chick clique: persuasive technology to motivate teenage girls to exercise. CHI EA '06, ACM (2006), 1873--1878.  ",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "Ying, F., Li, B., Li, Z., Li, X., Tao, J., and Gao, S. Telepathy Lamp: Remote Affective Interaction Based on Ambient Metaphor for Emotional Caring of the Elderly. 2010 International Conference on System Science, Engineering Design and Manufacturing Informatization, IEEE (2010), 129--132.  ",
      "doi": "10.1109/ICSEM.2010.122"
    }
  ]
}