{
  "doi": "10.1145/2702123.2702573",
  "title": "Residual Mobilities: Infrastructural Displacement and Post-Colonial Computing in Bangladesh",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "437-446",
  "year": 2015,
  "badges": [],
  "abstract": "This paper explores discrepancies between the founding assumptions of mobile and ubiquitous computing in the western world, and the starkly different experiences of mobility and infrastructure to be found in many post-colonial environments. Based on a field study of forced mobility and technology use among populations displaced by the Hatirjheel waterfront development project in Dhaka, Bangladesh, we make two basic arguments. First, we point to the partial nature of assumptions around mobility that frame the imagination of mainstream HCI research, and argue that different and heretofore residual experiences of mobility must also be accounted for in post-colonial and other marginal computing environments. Second, we document four forms of infrastructural experience -- dispossession, reconstitution, collaboration, and repair -- that characterize real-world engagements with infrastructure in such settings. We conclude with implications for HCI research and design, and reflections on how HCI researchers might better account for such experiences in their work.",
  "authors": [
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    },
    {
      "name": "Nusrat Jahan Mim",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702308",
      "orcid": "missing"
    },
    {
      "name": "Steven J. Jackson",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100096023",
      "orcid": "0000-0002-4426-1320"
    }
  ],
  "references": [
    {
      "text": "Agar, J. Constant Touch: A Global History of the Mobile Phone. Icon Books, 2004.",
      "doi": ""
    },
    {
      "text": "Ahmed, S.I., Jackson, S.J., Ahmed, N., Ferdous, H.S., Rifat, M.R., Rizvi, A.S.M., Ahmed, S., Mansur, R.S. Protibadi: a platform for fighting sexual harassment in urban Bangladesh. In Proc. CHI'14, ACM (2014), 2695--2704.  ",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Ahmed, S.I., Jackson, S.J., Zaber, M., Morshed, M.B., Ismail, M.H.B., and Afrose, S. Ecologies of Use and Design: Individual and Social Uses of Mobile Phones Within Low-Literate Rickshaw-Puller Communities in Urban Bangladesh. Proc. DEV-4, ACM (2013), 14:1--14:10.  ",
      "doi": "10.1145/2537052.2537066"
    },
    {
      "text": "Burrell, J. Evaluating Shared Access: social equality and the circulation of mobile phones in rural Uganda. Journal of Computer Mediated Communication 15, 2 (2010), 230--250.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C.A. and Edwards, W.K. Designs on dignity: perceptions of technology among the homeless. In Proc. CHI '08, ACM (2008), 627--636.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Elyachar, J. Phatic labor, infrastructure, and the question of empowerment in Cairo. American Ethnologist 37, 3 (2010), 452--464.",
      "doi": ""
    },
    {
      "text": "Fields, G.S. Dualism in the Labor Market: a Perspective on the Lewis Model after Half a Century. The Manchester School 72, 6 (2004), 724--735.",
      "doi": ""
    },
    {
      "text": "Graham, S. and Marvin, S. Splintering urbanism: networked infrastructures, technological mobilities and the urban condition. Psychology Press, 2001.",
      "doi": ""
    },
    {
      "text": "Hardoy, J.E. and Satterthwaite, D. Squatter citizen: life in the urban Third World. Routledge, 2014.",
      "doi": ""
    },
    {
      "text": "Heimerl, K., Hasan, S., Ali, K., Brewer, E., and Parikh, T. Local, sustainable, small-scale cellular networks. In Proc. ICTD'13, ACM (2013), 2--12.  ",
      "doi": "10.1145/2516604.2516616"
    },
    {
      "text": "Houston, L. Inventive Infrastructure: An Exploration of Mobile Phone. PhD Thesis, Lanchaster University, 2014.",
      "doi": ""
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K., and Grinter, R.E. Postcolonial computing: a lens on design and development. In Proc. CHI'10, ACM, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Jackson, S.J., Ahmed, S.I., and Rifat, M.R. Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh. In Proc. DIS'14, ACM (2014), 905--914.  ",
      "doi": "10.1145/2598510.2598576"
    },
    {
      "text": "Jackson, S.J., Pompe, A., and Krieshok, G. Things fall apart: maintenance, repair, and technology for education initiatives in rural Namibia. In Proc. iConference'11, ACM (2012), 107--116.  ",
      "doi": "10.1145/1940761.1940773"
    },
    {
      "text": "Jackson, S.J., Pompe, A., and Krieshok, G. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. In Proc. CSCW'12, ACM (2012), 107--116.  ",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Jamasb, T. Electricity sector reform in developing countries: a survey of empirical evidence on determinants and performance. World Bank Publications 3549, (2005).",
      "doi": ""
    },
    {
      "text": "Larkin, B. The politics and poetics of infrastructure. Annual Review of Anthropology 42, (2013), 327--343.",
      "doi": ""
    },
    {
      "text": "Lindtner, S., Nardi, B., Wang, Y., Mainwaring, S., Jing, H., and Liang, W. Emerging sites of HCI innovation: hackerspaces, hardware startups and incubators. Proc. CSCW'08, ACM (2008), 371--382.  ",
      "doi": "10.1145/1460563.1460624"
    },
    {
      "text": "Mahbub, A.Q.M. and Islam, N. The growth of slums in Dhaka City: a spatio temporal analysis. In SU Ahmed Eds. Dhaka Past Present Future. Dhaka: Asiatic Society of Bangladesh, 1991, 508--521.",
      "doi": ""
    },
    {
      "text": "Massey, D. Power-geometry and a progressive sense of place. In Bird, J., Curtis, B., Putnam, T., & Tickner, L. eds. Mapping the Futures: Local Cultures, Global Change. Routledge, 2012.",
      "doi": ""
    },
    {
      "text": "Medhi, I., Patnaik, S., Brunskill, E., Gautama, S.N., Theis, W., and Toyama, K. Designing mobile interfaces for novice and low-literacy users. ACM Transactions on Computer-Human Interaction 18, 1 (2011), 2:1--2:27.  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Palen, L., Vieweg, S., Sutton, J., Liu, S.B., and Hughes, A.L. Crisis informatics: Studying crisis in a networked world. In Proc. e-Social Science'07.",
      "doi": ""
    },
    {
      "text": "Patel, N., Chittamuru, D., Jain, A., Dave, P., and Parikh, T. Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. Proc. CHI'10, ACM (2010), 733--742.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Rangaswamy, N. and Sambasivan, N. Cutting Chai, Jugaad, and Here Pheri: towards UbiComp for a global community. Personal and Ubiquitous Computing 15, 6 (2011), 553--564.  ",
      "doi": "10.1007/s00779-010-0349-x"
    },
    {
      "text": "Rouvinen, P. Diffusion of digital mobile telephony: Are developing countries different? Telecommunications Policy 30, 1 (2006), 46--63.",
      "doi": ""
    },
    {
      "text": "Sambasivan, N., Cutrell, E., Toyama, K., and Nardi, B. Intermediated technology use in developing communities. In Proc. CHI'10, ACM (2010), 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Sassen, S. Expulsions: Brutality and Complexity in the Global Economy. Harvard University Press, 2014.",
      "doi": ""
    },
    {
      "text": "Sherwani, J., Ali, N., Mirza, S., et al. HealthLine: Speech-based access to health information by lowliterate users. In Proc. ICTD'07, IEEE (2007), 1--9.",
      "doi": ""
    },
    {
      "text": "Star, S.L. and Bowker, G.C. Enacting silence: Residual categories as a challenge for ethics, information systems, and communication. Ethics and Information Technology 9, 4 (2007), 273--280.  ",
      "doi": "10.1007/s10676-007-9141-7"
    },
    {
      "text": "Suchman, L. Practice-based design of information systems: notes from the hyperdeveloped world. The information society 18, 2 (2002), 139--144.",
      "doi": ""
    },
    {
      "text": "Suchman, L. Human-machine reconfigurations: Plans and situated actions. Cambridge University Press, 2007. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Todaro, M.P. and Smith, S. Economic Development. Pearson Education, 2014.",
      "doi": ""
    },
    {
      "text": "Tomlinson, B., Silberman, M., Patterson, D., Pan, Y., and Blevis, E. Collapse informatics: augmenting the sustainability & ICT4D discourse in HCI. In Proc. CHI'12, (2012), 655--664.  ",
      "doi": "10.1145/2207676.2207770"
    },
    {
      "text": "UNICEF Bangladesh. Understanding urban inequalities in Bangladesh: A prerequisite for achieving Vision 2021. 2010.",
      "doi": ""
    },
    {
      "text": "Urry, J. Mobilities. Polity, 2007.",
      "doi": ""
    },
    {
      "text": "Woelfer, J.P. and Hendry, D.G. Homeless young people's experiences with information systems: life and work in a community technology center. In Proc. CHI'10, ACM (2010), 1291--1300.  ",
      "doi": "10.1145/1753326.1753520"
    },
    {
      "text": "\"War's Human Cost\": World's population of displaced tops 50 million. UN News Centre, 2014. http://www.un.org/apps/news/story.asp?NewsID=48089",
      "doi": ""
    },
    {
      "text": "Crisismappers. http://crisismappers.net/.",
      "doi": ""
    }
  ]
}