{
  "doi": "10.1145/2702123.2702412",
  "title": "From User-Centered to Adoption-Centered Design: A Case Study of an HCI Research Innovation Becoming a Product",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1749-1758",
  "year": 2015,
  "badges": [],
  "abstract": "As we increasingly strive for scientific rigor and generalizability in HCI research, should we entertain any hope that by doing good science, our discoveries will eventually be more transferrable to industry? We present an in-depth case study of how an HCI research innovation goes through the process of transitioning from a university project to a revenue-generating startup financed by venture capital. The innovation is a novel contextual help system for the Web, and we reflect on the different methods used to evaluate it and how research insights endure attempted dissemination as a commercial product. Although the extent to which any innovation succeeds commercially depends on a number of factors like market forces, we found that our HCI innovation with user-centered origins was in a unique position to gain traction with customers and garner buy-in from investors. However, since end users were not the buyers of our product, a strong user-centered focus obfuscated other critical needs of the startup and pushed out perspectives of non-user-centered stakeholders. To make the research-to-product transition, we had to focus on adoption-centered design, the process of understanding and designing for adopters and stakeholders of the product. Our case study raises questions about how we evaluate the novelty and research contributions of HCI innovations with respect to their potential for commercial impact.",
  "authors": [
    {
      "name": "Parmit K. Chilana",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81416609224/rel-imgonly/parmit2015linkedin.jpg",
      "acmid": "81416609224",
      "orcid": "missing"
    },
    {
      "name": "Amy J. Ko",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    },
    {
      "name": "Jacob Wobbrock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Bernstein, M.S., Ackerman, M.S., Chi, E.H. & Miller, R.C. 2011. The trouble with social computing systems research. ACM CHI-Extended Abstracts, 389--398.  ",
      "doi": "10.1145/1979742.1979618"
    },
    {
      "text": "Brown, B., Reeves, S. & Sherwood, S. 2011. Into the wild: challenges and opportunities for field trial methods. ACM CHI, 1657--1666.  ",
      "doi": "10.1145/1978942.1979185"
    },
    {
      "text": "Chilana, P.K., Ko, A.J., Wobbrock, J.O. & Grossman, T. 2013. A multi-site field study of crowdsourced contextual help: usage and perspectives of end users and software teams. ACM CHI, 217--226.  ",
      "doi": "10.1145/2470654.2470685"
    },
    {
      "text": "Chilana, P., Ko, A.J. & Wobbrock, J.O. 2012. LemonAid: selection-based crowdsourced contextual help for web applications. ACM CHI, 1549--1558.  ",
      "doi": "10.1145/2207676.2208620"
    },
    {
      "text": "Christensen, C. 2013. The innovator's dilemma: when new technologies cause great firms to fail. Harvard Business Review Press. ",
      "doi": "10.5555/268729"
    },
    {
      "text": "Colyer, A.M. 2000. From research to reward: challenges in technology transfer. ICSE, 569--576.  ",
      "doi": "10.1145/337180.337467"
    },
    {
      "text": "Foley, J. 1996. Technology transfer from university to industry. Comm. ACM. 39, 9, 30--31.  ",
      "doi": "10.1145/234215.234466"
    },
    {
      "text": "Greenberg, S. & Buxton, B. 2008. Usability evaluation considered harmful (some of the time). ACM CHI, 111--120.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Henderson, A. 2005. The innovation pipeline: design collaborations between research and development. interactions, 12, 1, 24--29.  ",
      "doi": "10.1145/1041280.1041295"
    },
    {
      "text": "Hornbæk, K. & Frøkjær, E. 2008. Making use of business goals in usability evaluation: an experiment with novice evaluators. ACM CHI, 903--912.  ",
      "doi": "10.1145/1357054.1357197"
    },
    {
      "text": "Isaacs, E.A., Tang, J.C., Foley, J., Johnson, J., Kuchinsky, A., Scholtz, J. & Bennett, J. 1996. Technology transfer: so much research, so few good products. ACM CHI Companion, 155--156.  ",
      "doi": "10.1145/257089.257227"
    },
    {
      "text": "Jick, T.D. 1979. Mixing qualitative and quantitative methods: Triangulation in action. Administrative science quarterly, 24, 4, 602--611.",
      "doi": ""
    },
    {
      "text": "Kolko, J. 2014. Running an entrepreneurial pilot to identify value. interactions, 21, 4, 22--23.  ",
      "doi": "10.1145/2611812"
    },
    {
      "text": "Landay, J. 2009. I give up on CHI/UIST. DUB for the Future blog. Retrieved Jan 1, 2015: http://dubfuture.blogspot.com/2009/11/i-give-up-on-chiuist.html.",
      "doi": ""
    },
    {
      "text": "Larsson, M., Wall, A., Norström, C. & Crnkovic, I. 2006. Technology transfer: why some succeed and some don't. Software Tech Transfer in Soft. Engr., 23--28.  ",
      "doi": "10.1145/1138046.1138055"
    },
    {
      "text": "Lee, A.S. & Baskerville, R.L. 2003. Generalizing generalizability in information systems research. Information systems research, 14, 3, 221--243.  ",
      "doi": "10.1287/isre.14.3.221.16560"
    },
    {
      "text": "McGrath, J.E. 1995. Methodology matters: doing research in the behavioral and social sciences. Human-computer interaction. R.M. Baecker, J. Grudin, W.A.S. Buxton, & S. Greenberg (eds.) Morgan Kaufmann Publishers, 152--169. ",
      "doi": "10.5555/212925.212940"
    },
    {
      "text": "Mcgrenere, J., Bunt, A., Findlater, L. & Moffatt, K. 2010. Generalization in Human-Computer Interaction Research. Generalization of Knowledge: Multidisciplinary Perspectives. M. Banich and D. Caccamise, eds. Psychology Press, 277--295.",
      "doi": ""
    },
    {
      "text": "Pfleeger, S.L. 1999. Understanding and improving technology transfer in software engineering. J. of Systems and Software, 47, 2, 111--124.  ",
      "doi": "10.1016/S0164-1212%2899%2900031-X"
    },
    {
      "text": "Rettig, M. 1991. Nobody reads documentation. Comm. ACM, 34, 7, 19--24.  ",
      "doi": "10.1145/105783.105788"
    },
    {
      "text": "Rogers, E.M. 2010. Diffusion of innovations. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Olsen, D. 2007. Evaluating user interface systems research. Proc ACM UIST, 251--258.  ",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Schuler, D. & Namioka, A. 1993. Participatory Design: Principles and Practices. Lawrence Erlbaum Associates, Inc. Mahwah, NJ, USA. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Slater, S.F. & Mohr, J.J. 2006. Successful development and commercialization of technological innovation: insights based on strategy type. J. Product Innovation Management, 23, 1, 26--33.",
      "doi": ""
    },
    {
      "text": "Szuc, Daniel. 2007. Walking through your product design with stakeholders. UX Matters. Retrieved Jan 1, 2015 from http://www.uxmatters.com/mt/archives/2007/06/walkingthrough-your-product-design-with-stakeholders.php.",
      "doi": ""
    },
    {
      "text": "Winkler, D., Mordinyi, R. & Biffl, S. 2013. Research Prototypes versus Products: Lessons Learned from Software Development Processes in Research Projects. Systems, Software and Services Process Improvement. Springer, 48--59.",
      "doi": ""
    },
    {
      "text": "Zelkowitz, M.V. 1996. Software engineering technology infusion within NASA. IEEE Engineering Management, 43, 3, 250--261.",
      "doi": ""
    }
  ]
}