{
  "doi": "10.1145/2702123.2702379",
  "title": "Empirical Evidence for a Diminished Sense of Agency in Speech Interfaces",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3967-3970",
  "year": 2015,
  "badges": [],
  "abstract": "While the technology underlying speech interfaces has improved in recent years, our understanding of the human side of speech interactions remains limited. This paper provides new insight on one important human aspect of speech interactions: the sense of agency - defined as the experience of controlling one's own actions and their outcomes. Two experiments are described. In each case a voice command is compared with keyboard input. Agency is measured using an implicit metric: intentional binding. In both experiments we find that participants' sense of agency is significantly reduced for voice commands as compared to keyboard input. This finding presents a fundamental challenge for the design of effective speech interfaces. We reflect on this finding and, based on current theory in HCI and cognitive neuroscience, offer possible explanations for the reduced sense of agency observed in speech interfaces.",
  "authors": [
    {
      "name": "Hannah Limerick",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700702",
      "orcid": "missing"
    },
    {
      "name": "James W. Moore",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502653175",
      "orcid": "missing"
    },
    {
      "name": "David Coyle",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81333488106/rel-imgonly/davidcoyle.jpg",
      "acmid": "81333488106",
      "orcid": "0000-0002-5103-0379"
    }
  ],
  "references": [
    {
      "text": "Aylett, M.P., Kristensson, P.O., Whittaker, S. & VazquezAlvarez, Y. (2014) None of a CHInd: relationship counselling for HCI and speech technology. ACM CHI EA 2014. 749--60.  ",
      "doi": "10.1145/2559206.2578868"
    },
    {
      "text": "Coyle, D., Moore, J., Kristensson, P.O., Fletcher, P. & Blackwell, A. (2012) I did that! Measuring users' experience of agency in their own actions. ACM CHI 2014. 2025--34.  ",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Haggard, P., Clark, S. & Kalogeras, J. (2002) Voluntary action and conscious awareness. Nature Neuroscience 5(4) 382--85.",
      "doi": ""
    },
    {
      "text": "Haggard, P. & Tsakiris, M. (2009) The Experience of Agency: Feelings, Judgments, and Responsibility. Curr Dir Psychol Sci. 18(4) 242--46.",
      "doi": ""
    },
    {
      "text": "Hon, N., Poh, J.H. & Soon, C.S. (2013) Preoccupied minds feel less control: Sense of agency is modulated by cognitive load. Consciousness and Cognition. 22(2) 556--61.",
      "doi": ""
    },
    {
      "text": "Limerick, H., Coyle, D. & Moore, J.W. (2014) The Experience of Agency in Human-Computer Interactions: A Review. Frontiers in Human Neuroscience. 8:643.",
      "doi": ""
    },
    {
      "text": "Moore, J.W. & Fletcher, P.C. (2012) Sense of agency in health and disease: A review of cue integration approaches. Consciousness and Cognition. 21(1) 59--68.",
      "doi": ""
    },
    {
      "text": "Moore, J.W. & Obhi, S.S. (2012) Intentional binding and the sense of agency: a review. Conscious Cogn. 21(1) 546--61.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. (2000) The limits of speech recognition. Commun. ACM. 43(9) 63--65.  ",
      "doi": "10.1145/348941.348990"
    },
    {
      "text": "Shneiderman, B. & Plaisant, C. Designing the User Interface: Strategies for Effective Human-Computer Interaction. 2004. ",
      "doi": "10.5555/983803"
    },
    {
      "text": "Walker, W., Lamere, P., Kwok, P., Raj, B., Singh, R., Gouvea, E., Wolf, P. & Woelfel, J. (2004) Sphinx-4: a flexible open source framework for speech recognition. ",
      "doi": "10.5555/1698193"
    }
  ]
}