{
  "doi": "10.1145/2702123.2702403",
  "title": "Designing Political Deliberation Environments to Support Interactions in the Public Sphere",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3167-3176",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Little is known about the challenges and successes people face when piecing together multiple social media to interact in the online public sphere when: seeking information, disseminating information, and engaging in political discussions. We interviewed 29 US citizens and conducted 17 talk-out-loud sessions with people who were using one or more social media technologies, such as Facebook and Twitter, to interact in the online public sphere. We identified a number of challenges and workarounds related to public sphere interactions, and used our findings to formulate requirements for new political environments that support the interactions in the public sphere. Through evolving requirements generation, we developed a new political deliberation technology, dubbed Poli, which is an integrated social media environment with the potential to enable more effective interactions in the public sphere. We discuss several remaining questions and limitations to our tool that will drive future work.",
  "authors": [
    {
      "name": "Bryan Semaan",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/do/10.1145/contrib-81384620999/rel-imgonly/81384620999.jpg",
      "acmid": "81384620999",
      "orcid": "0000-0003-1151-2389"
    },
    {
      "name": "Heather Faucett",
      "institution": "University of California Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259479357",
      "orcid": "missing"
    },
    {
      "name": "Scott P. Robertson",
      "institution": "University of Hawaii at Manoa, Honolulu, HI, USA",
      "img": "/do/10.1145/contrib-81326492414/rel-imgonly/scottpaulrobertson02_500x700.jpg",
      "acmid": "81326492414",
      "orcid": "missing"
    },
    {
      "name": "Misa Maruyama",
      "institution": "University of Hawaii at Manoa, Honolulu, HI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557876956",
      "orcid": "missing"
    },
    {
      "name": "Sara Douglas",
      "institution": "University of Hawaii at Manoa, Honolulu, HI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503671402",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AbouAssi, K., Nabatchi, T., and Antoun, R. 2013. Citizen participation in public administration: Views from Lebanon. Inter. J. of Pub. Admin., 36(14), 1029--1043.",
      "doi": ""
    },
    {
      "text": "Adamic, L., and Glance, N. (2005). The political blogosphere and the 2004 U.S. election: Divided they blog. In Proc. of IWLD, 36--43.  ",
      "doi": "10.1145/1134271.1134277"
    },
    {
      "text": "Brabham, D. C. (2008). Crowdsourcing as a model for problem solving an introduction and cases. Convergence: the international journal of research into new media technologies, 14(1), 75--90.",
      "doi": ""
    },
    {
      "text": "Coleman, S., and Moss, G. (2012). Under construction: the field of online deliberation research. Journal of Information Technology & Politics, 9(1), 1--15.",
      "doi": ""
    },
    {
      "text": "Dahlberg, L. (2001). The Internet and democratic discourse: Exploring the prospects of online deliberative forums extending the public sphere. Information, Communication & Society, 4(4), 615--633.",
      "doi": ""
    },
    {
      "text": "Dahlgren, P. (2009). Media and political engagement: Citizens, communication, and democracy. University Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Ellison, N., Steinfield, C., and Lampe, C. (2007). The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication, 12 (4), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Fung, A., and Wright, E. (2001). Deepening democracy: Institutional innovations in empowered participatory governance. Politics & Society, 29(1), 5--41.",
      "doi": ""
    },
    {
      "text": "Goffman, E. (1959). The Presentation of Self in Everyday Life. Doubleday, Carden City, NY",
      "doi": ""
    },
    {
      "text": "Gilbert, E., Bergstrom, T., and Karahalios, K. (2009). Blogs are echo chambers: Blogs are echo chambers. In Proc. of HICSS-42.  ",
      "doi": "10.1109/HICSS.2009.91"
    },
    {
      "text": "Gordon, E., Baldwin-Philippi, J., and Balestra, M. (2013). Why we engage: How theories of human behavior contribute to our understanding of civic engagement in a digital era. Berkman Center Research Publication, 21.",
      "doi": ""
    },
    {
      "text": "Gordon, E., Manosevitch, E. (2010). Augmented deliberation: merging physical and virtual interaction to engage communities in urban planning. New Media and Society, 12, 763--778.",
      "doi": ""
    },
    {
      "text": "Graham, T., and Wright. S. (2014). Discursive equality and everyday talk online: The Impact of 'superparticipants.' JCMC, 19(3), 625--642.",
      "doi": "10.1111/jcc4.12016"
    },
    {
      "text": "Graham, T. (2008). Needles in a haystack: A new approach for identifying and assessing political talk in non-political discussion forums. Javnost, 15(2), 17--36.",
      "doi": ""
    },
    {
      "text": "Habermas, J. (1984). The theory of communicative action: Reason and the rationalization of society. Heneimann, London.",
      "doi": ""
    },
    {
      "text": "Habermas, J. (1991). The structural transformation of the public sphere: An inquiry into a category of bourgeois society. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Jensen, J. (2003). Virtual democratic dialogue? Bringing together citizens and politicians. Info. Pol., 8(1-2), 29--47. ",
      "doi": "10.5555/1412469.1412472"
    },
    {
      "text": "Karlsson, M. (2011). What does it take to make online deliberation happen?: A comparative analysis of 28 online discussion forums. In E-Participation to Online Deliberation: Proceedings of the Fourth International Conference on Online Deliberation, 142--156.",
      "doi": ""
    },
    {
      "text": "Kies, R. (2010). Promises and Limits of Web-Deliberation. New York, NY: Palgrave Macmillan. ",
      "doi": "10.5555/1841697"
    },
    {
      "text": "Klein, M. (2012). Enabling large-scale deliberation using attention-mediation metrics. Computer Supported Cooperative Work, 21(4-5), 449--473.  ",
      "doi": "10.1007/s10606-012-9156-4"
    },
    {
      "text": "Kriplean, T., Morgan, J., Freelon, D., Borning, A., and Bennett, L. (2012a). Supporting reflective public thought with Considerit. In Proc. of CSCW '12.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Lampe, C., Ellison, N., and Steinfield, C. (2006). A face (book) in the crowd: Social searching vs. social browsing. In Proc. of CSCW'06.  ",
      "doi": "10.1145/1180875.1180901"
    },
    {
      "text": "Macintosh, A., Robson, E., Smith, E., and Whyte, A. (2003). Electronic democracy and young people. Social Science Computer Review, 21(1), 43--54.  ",
      "doi": "10.1177/0894439302238970"
    },
    {
      "text": "Maruyama, M., Robertson, S., Douglas, S., Semaan, B., Faucett, H. (2014). Hybrid Media Consumption: How Tweeting During a Televised Political Debate Influences the Vote Decision. In Proc. of CSCW'14.  ",
      "doi": "10.1145/2531602.2531719"
    },
    {
      "text": "Munson, S., and Resnick, P. (2010). Presenting diverse political opinions: how and how much, In Proc. of CHI'10.  ",
      "doi": "10.1145/1753326.1753543"
    },
    {
      "text": "Noveck, B. S. (2009). Wiki government: How technology can make government better, democracy stronger, and citizens more powerful. Harrisonburg, VA: Brookings Institution Press.",
      "doi": ""
    },
    {
      "text": "Papacharissi, Z. (2010). A private sphere: Democracy in a digital age. Polity Press, Malden, MA.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J.W., Francis, M.E. and Booth, R.J. (2001). Linguistic Inquiry and Word Count: LIWC (2nd Edition). Mahwah, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J.W., Mehl, M.R., and Niederhoffer, K.G. (2003). Psychological aspects of natural language use: Our words, our selves. Ann. Rev. of Psych., 54, 547--577.",
      "doi": ""
    },
    {
      "text": "Raine, L., and Smith, A. (2012). Politics on social networking sites. Pew Internet and American Life Project.",
      "doi": ""
    },
    {
      "text": "Robertson, S., Wania, C., Abraham, G., and Park, S.J. (2008). Drop-down democracy: Internet portal design influences voters' search strategies. In Proc. of HICSS'08.  ",
      "doi": "10.1109/HICSS.2008.131"
    },
    {
      "text": "3Semaan, B., Robertson, S., Douglas, S., Maruyama, M. (2014). Social Media Supporting Political Deliberation Across Multiple Public Spheres: Towards Depolarization. In Proc. of CSCW'14.  ",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "Smith, G. (2009). Democratic Innovations: Designing Institutions for Citizen Participation. Cambridge, United Kingdom: Cambridge University Press. ",
      "doi": "10.5555/1795662"
    },
    {
      "text": "Strauss, A. L. and Corbin, J. M. (1998). Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage, CA.",
      "doi": ""
    },
    {
      "text": "Stromer-Galley, J. (2004). Diversity of political conversation on the Internet: Users' perspectives. Journal of Computer-Mediated Communication, 8(3).",
      "doi": ""
    },
    {
      "text": "Sunstein, C. (2002). The law of group polarization. Journal of Political Philosophy, 10(2), 175--195.",
      "doi": ""
    },
    {
      "text": "Towne, B., and Herbsleb, J. (2012). Design considerations for online deliberation systems. Journal of Information Technology & Politics, 9(1), 97--115.",
      "doi": ""
    },
    {
      "text": "Wright, S. (2012). Politics as Usual? Revolution, Normalization and a New Agenda for Online Deliberation. New Media & Society, 14(2), 244--261.",
      "doi": ""
    },
    {
      "text": "Wright, S., and Street, J. (2007). Democracy, deliberation and design: The case of online discussion forums. New Media & Society, 9(5). 849--869.",
      "doi": ""
    },
    {
      "text": "Zuckerman, E. (2014). New media, new civics? Policy and Internet, 6(2), 151--168",
      "doi": ""
    }
  ]
}