{
  "doi": "10.1145/2702123.2702233",
  "title": "MUBox: Multi-User Aware Personal Cloud Storage",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1855-1864",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Personal cloud services such as Dropbox are used increasingly to support collaborative work, even though they typically have poor support for tracking files and users' activities and collaborators often rely on other communication channels to be notified of changes. We present a meta-cloud storage service, MUBox, that, independent of a particular cloud storage service, provides improved support for collaboration. First, users can switch to activity views that list user activities rather than files, which is an example of an increasingly available feature in popular cloud storage clients. Second, MUBox introduces multi-user aware folder views that embed information on the last changes performed by collaborators. These folder views are enhanced based on a new concept of shadow files which act as placeholders for files that have been moved or renamed. A user study (N=16) with realistic folder exploration tasks shows that activity views have a significant effect on the accuracy and confidence of users in workspace awareness tasks, while shadow files significantly improve the speed, accuracy and confidence of users in traceability tasks. We describe how existing services could implement these features as well as a new concept for voting on changes to shared folders that could improve asynchronous collaboration.",
  "authors": [
    {
      "name": "Michael Nebeling",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640607",
      "orcid": "0000-0003-3743-2387"
    },
    {
      "name": "Matthias Geel",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474696598",
      "orcid": "missing"
    },
    {
      "name": "Oleksiy Syrotkin",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700076",
      "orcid": "missing"
    },
    {
      "name": "Moira C. Norrie",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100036334",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bergman, O., Tucker, S., Beyth-Marom, R., Cutrell, E., and Whittaker, S. It's not that important: demoting personal information of low subjective importance using GrayArea. In Proc. CHI (2009).  ",
      "doi": "10.1145/1518701.1518745"
    },
    {
      "text": "Biehl, J., Czerwinski, M., Smith, G., and Robertson, G. FASTDash: A visual dashboard for fostering awareness in software teams. In Proc. CHI (2007).  ",
      "doi": "10.1145/1240624.1240823"
    },
    {
      "text": "Calefato, F., Gendarmi, D., and Lanubile, F. Adding social awareness to Jazz for reducing socio-cultural distance between distributed teams, 2009. Eclipse-IT.",
      "doi": ""
    },
    {
      "text": "DeLine, R., Czerwinski, M., and Robertson, G. Easing Program Comprehension by Sharing Navigation Data. In Proc. VL/HCC (2005).  ",
      "doi": "10.1109/VLHCC.2005.32"
    },
    {
      "text": "Dourish, P., and Bellotti, V. Awareness and coordination in shared workspaces. In Proc. CSCW (1992).  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Foster, I., Vöockler, J., Wilde, M., and Zhao, Y. Chimera: AVirtual Data System for Representing, Querying, and Automating Data Derivation. In Proc. SSDBM (2002).  ",
      "doi": "10.1109/SSDM.2002.1029704"
    },
    {
      "text": "Froehlich, J., and Dourish, P. Unifying artefacts and activities in a visual tool for distributed software engineering teams. In Proc. ICSE (2004). ",
      "doi": "10.5555/998675.999443"
    },
    {
      "text": "Jensen, C., Lonsdale, H., Wynn, E., Cao, J., Slater, M., and Dietterich, T. G. The life and times of files and information: a study of desktop provenance. In Proc. CHI (2010).  ",
      "doi": "10.1145/1753326.1753439"
    },
    {
      "text": "Kantor, M., and Redmiles, D. Creating infrastructure for ubiquitous awareness. In Proc. INTERACT (2001).",
      "doi": ""
    },
    {
      "text": "Karlson, A. K., Smith, G., and Lee, B. Which version is this?: improving the desktop experience within a copy-aware computing ecosystem. In Proc. CHI (2011).  ",
      "doi": "10.1145/1978942.1979334"
    },
    {
      "text": "Kersten, M., and Murphy, G. C. Using task context to improve programmer productivity. In Proc. SIGSOFT (2006).  ",
      "doi": "10.1145/1181775.1181777"
    },
    {
      "text": "Marshall, C., and Tang, J. That syncing feeling: early user experiences with the cloud. In Proc. DIS (2012).  ",
      "doi": "10.1145/2317956.2318038"
    },
    {
      "text": "Omoronyia, I., Ferguson, J., Roper, M., and Wood, M. A review of awareness in distributed collaborative software engineering. SPE (2010).  ",
      "doi": "10.5555/1890754.1890755"
    },
    {
      "text": "Rader, E. Yours, mine and (not) ours: social influences on group information repositories. In Proc. CHI (2009).  ",
      "doi": "10.1145/1518701.1519019"
    },
    {
      "text": "Sultana, S., and Bertino, E. A file provenance system. In Proc. CODASPY (2013).  ",
      "doi": "10.1145/2435349.2435368"
    },
    {
      "text": "Voida, A., Olson, J. S., and Olson, G. M. Turbulence in the clouds: challenges of cloud-based information work. In Proc. CHI (2013).  ",
      "doi": "10.1145/2470654.2481313"
    },
    {
      "text": "Voida, S., Edwards, W. K., Newman, M. W., Griner, R. E., and Ducheneaut, N. Share and Share Alike: Exploring the User Interface Affordances of File Sharing. In Proc. CHI (2006).  ",
      "doi": "10.1145/1124772.1124806"
    },
    {
      "text": "Xu, J., Zhang, J., Harvey, T., and Young, J. A Survey of Asynchronous Collaboration Tools. Information Technology Journal (2008).",
      "doi": ""
    }
  ]
}