{
  "doi": "10.1145/2702123.2702245",
  "title": "Data-Things: Digital Fabrication Situated within Participatory Data Translation Activities",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2467-2476",
  "year": 2015,
  "badges": [],
  "abstract": "This paper explores a design-led approach to digital fabrication which situates it in participatory data translation activities to demonstrate that this technology can find application beyond its use as tool for manufacture. We present two contrasting design contexts in which, respectively, data from conference twitter conversations and craft practitioners' movements are translated into interactively generated and fabricated physical artefacts. We argue that direct involvement in such digital fabrication activities can help people invest meaning into artefacts and facilitate social interaction and reflection upon their activities, while encouraging practitioners to incorporate new forms into their own work. On this basis, we reconsider digital fabrication within data translation activities as situated along an extended 'trajectory of use' in which reflective, meaningful 'data-things' can be created.",
  "tags": [
    "digital fabrication",
    "data materialisation",
    "data translation",
    "making",
    "craft",
    "research through design",
    "3d printing"
  ],
  "authors": [
    {
      "name": "Bettina Nissen",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758858357",
      "orcid": "missing"
    },
    {
      "name": "John Bowers",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260889",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baudrillard, J. The Gulf War Did Not Take Place. Bloomington: Indiana University Press, 1995.",
      "doi": ""
    },
    {
      "text": "Blikstein, P. and Krannich, P. The Makers' Movement and FabLabs in Education: Experiences, Technologies, and Research. In Proc. IDC '13. ACM (2013), 613--616.  ",
      "doi": "10.1145/2485760.2485884"
    },
    {
      "text": "Ehn, P. (1988). Work-Oriented Design of Computer Artifacts. Stockholm: Arbetslivescentrum. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Gaver, W., Beaver, J. and Benford, S. Ambiguity as a Resource for Design. In Proc. CHI'03. ACM (2003), 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Gaver, W., Bowers, J., Boehner, K. et al. Indoor Weather Stations: Investigating a Ludic Approach to Environmental HCI Through Batch Prototyping. In Proc. CHI'13. ACM (2013). 3451--3460.  ",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "Gershenfeld, N. Fab: The Coming Revolution on Your Desktop-From Personal Computers to Personal Fabrication. Basic Books, 2008. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Ingold, T. Making: Anthropolgy, Archaeology, Art and Architecture. Routledge, 2013.",
      "doi": ""
    },
    {
      "text": "Khot, R., Hjorth, L. and Mueller, F. Understanding Physical Activity through 3D Printed Material Artifacts. In Proc. CHI '14. ACM (2014). 3835--3844.  ",
      "doi": "10.1145/2556288.2557144"
    },
    {
      "text": "Kuznetsov, S. and Paulos, E. Rise of the Expert Amateur: DIY Projects , Communities , and Cultures. In Proc. NordiCHI '10. ACM (2010). 295--304.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Latour, B. Science in Action: How to Follow Scientists and Engineers Through Society. Harvard University Press, 1987.",
      "doi": ""
    },
    {
      "text": "Lindtner, S. Hertz, G., Dourish, P. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Startups & Incubators. In Proc. CHI'14. ACM (2014). 1--10.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Lupton, D. Self-tracking Cultures: Towards a Sociology of Personal Informatics. In Proc. OZCHI'14. ACM 2014  ",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Malone, E. and Lipson, H. Fab@Home: The Personal Desktop Fabricator Kit. Rapid Prototyping Journal 13, 4 (2007). 245--255.",
      "doi": ""
    },
    {
      "text": "Mellis, D., Follmer, S., Hartmann, B. et al. FAB at CHI: Digital Fabrication Tools, Design, and Community. In Proc. CHI EA '13. ACM (2013). 3307--3310.  ",
      "doi": "10.1145/2468356.2479673"
    },
    {
      "text": "Mueller, S., Lopes, P., and Baudisch, P. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. In Proc. UIST '12. ACM (2012). 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Nissen, B., Bowers, J., Wright, P. et al. Volvelles, Domes and Wristbands: Embedding Digital Fabrication within a Visitor's Trajectory of Engagement. In Proc. DIS '14. ACM (2014). 825--834.  ",
      "doi": "10.1145/2598510.2598524"
    },
    {
      "text": "Ogawa, H., Mara, M., Lindinger, C., et al. Shadowgram: A Case Study for Social Fabrication through Interactive Fabrication in Public Spaces. In Proc. TEI'12. ACM (2012). 57--60.  ",
      "doi": "10.1145/2148131.2148145"
    },
    {
      "text": "Posch, I., Ogawa, H., Lindinger, et al. Introducing the FabLab as Interactive Exhibition Space. In Proc. IDC '10. ACM (2010). 254--257.  ",
      "doi": "10.1145/1810543.1810584"
    },
    {
      "text": "Quantified Self www.quantifiedself.com {acc. Sept'14}",
      "doi": ""
    },
    {
      "text": "Rosner, D. Mediated Crafts: Digital Practices around Creative Handwork. In Proc. CHI EA'10. ACM (2010). 2955--2958.  ",
      "doi": "10.1145/1753846.1753894"
    },
    {
      "text": "Rosner, D., Ryokai, K. Reflections on Craft: Probing the Creative Process of Everyday Knitters. In Proc. C&C'09. ACM (2009). 195--204.  ",
      "doi": "10.1145/1640233.1640264"
    },
    {
      "text": "Simon, N., The Participatory Museum. Santa Cruz: Museum 2.0, 2010.",
      "doi": ""
    },
    {
      "text": "Tanenbaum, J.G., Williams, A.M., Desjardins, A., and Tanenbaum, K. Democratizing Technology?: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proc. CHI '13. ACM (2013). 2603--2612.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Vande Moere, A. Beyond the Tyranny of the Pixel: Exploring the Physicality of Information Visualization. In Proc. IV'08. IEEE Computer Society(2008). 469--474  ",
      "doi": "10.1109/IV.2008.84"
    },
    {
      "text": "Willis, K.D.D, Lin, J., Mitani, J. et al. Spatial Sketch: Bridging Between Movement & Fabrication. In Proc. TEI'10. ACM (2010). 5--12.  ",
      "doi": "10.1145/1709886.1709890"
    },
    {
      "text": "Willis, K.D.D., Xu, C., Wu, K.-J., et al. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proc. TEI '11. ACM (2011). 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Zoran, A. Hybrid Basketry: Interweaving Digital Practice within Contemporary Craft. In ACM SIGGRAPH 2013 Art Gallery (SIGGRAPH '13). ACM. 324--331.  ",
      "doi": "10.1145/2503649.2503651"
    }
  ]
}