{
  "doi": "10.1145/2702123.2702308",
  "title": "Exploring Subtle Foot Plantar-based Gestures with Sock-placed Pressure Sensors",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3019-3028",
  "year": 2015,
  "badges": [],
  "abstract": "We propose subtle foot-based gestures named foot plantar-based (FPB) gestures that are used with sock-placed pressure sensors. In this system, the user can control a computing device by changing his or her foot plantar distributions, e.g., pressing the floor with his/her toe. Because such foot movement is subtle, it is suitable for use especially in a public space such as a crowded train. In this study, we first conduct a guessability study to design a user-defined gesture set for interaction with a computing device. Then, we implement a gesture recognizer with a machine learning technique. To avoid unexpected gesture activations, we also collect foot plantar pressure patterns made during daily activities such as walking, as negative training data. Additionally, we evaluate the unobservability of FPB gestures by using crowdsourcing. Finally, we conclude with several applications to further illustrate the utility of FPB gestures.",
  "tags": [
    "sock-placed interface",
    "user-defined gesture",
    "foot plantar sensing device",
    "hands-free interaction"
  ],
  "authors": [
    {
      "name": "Koumei Fukahori",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958680257",
      "orcid": "missing"
    },
    {
      "name": "Daisuke Sakamoto",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81329491765/rel-imgonly/____________.jpg",
      "acmid": "81329491765",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Han, T., Judd, W., Irani, P., and Subramanian, S., Putting Your Best Foot Forward: investigating real-world mappings for foot-based gestures. In Proc. CHI'12, 1229--1238.  ",
      "doi": "10.1145/2207676.2208575"
    },
    {
      "text": "Amento, B., Hill, W., and Terveen, L. The Sound of One Hand : a wrist-mounted bio-acoustic fingertip gesture interface. In Proc CHI EA'02, 724--725.  ",
      "doi": "10.1145/506443.506566"
    },
    {
      "text": "Augsten, T., Kaefer, K., Meusel, R., Fetzer, C., Kanitz, D., Stoff, T., Becker, T., Holz, C., and Baudisch, P. Multitoe: high-precision interaction with back-projected floors based on high-resolution multi-touch input. In Proc. UIST '10, 209--218.  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Chan, L., Liang, R.H, Tsai, M.C., Chang, K.Y., Su, C.H., Chen, M.Y., Cheng, W.H., Chen, B.Y. FingerPad: private and subtle interaction using fingertips. In Proc. UIST'13, 255--260.  ",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Chen, K.Y., Lyons, K., White, S., Patel, S. uTrack: 3D input using two magnetic sensors. In Proc. UIST'13, 237--244.  ",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Choi, I., and Ricci, C. Foot-mounted gesture detection and its application in virtual environments. In Proc. IEEE Internationa Conference on System, Man and Cybernetics '97, 4248--4253.",
      "doi": ""
    },
    {
      "text": "Costanza, E., Inverso, S.A., Allen, R., and Maes, P. Intimate Interfaces in Action: assessing the usability and subtlety of EMG-based motionless gestures. In Proc. CHI '07, 819--828.  ",
      "doi": "10.1145/1240624.1240747"
    },
    {
      "text": "Dwass, M. Some k-sample rank-order tests. In Essays in Honor of Harold Hotelling. 198--202.",
      "doi": ""
    },
    {
      "text": "Edgar, S., Swyka, T., Fulk, G., and Sazonov, E.S. Wearable shoe-based device for rehabilitation of stroke patients. In Proc. IEEE Engineering in Medicine and Biology Society'10. 3772--3775.",
      "doi": ""
    },
    {
      "text": "Haan, G.D., Griffith, E.J., and Post, F.H. Using the WiiBalance Board TM as a low-cost VR interaction device. In Proc. VRST '08, 289--290.  ",
      "doi": "10.1145/1450579.1450657"
    },
    {
      "text": "Holleczek, T., Ruegg, A., Harms, H., and Troster, G. Textile pressure sensors for sports applications, In Journal of Sensors '10, 732--737.",
      "doi": ""
    },
    {
      "text": "Luo, Z.P., Berglund, L.J., and An, K.N. Validation of FScan pressure sensor system: a technical note. In Journal of rehabilitation research and development 98, 186--191.",
      "doi": ""
    },
    {
      "text": "Matthies, D.J.C., Muller, F., Anthes, C., and Kranzlmuller, D. ShoeSoleSense: proof of concept for a wearable foot interface for virtual and real environments. In Proc. VRST'13, 93--96.  ",
      "doi": "10.1145/2503713.2503740"
    },
    {
      "text": "Papetti, S., Fontana, F., Civolani, M., Berrezag, A., and Hayward V. Audio-tactile display of ground properties using interactive shoe. In Proc. HAID'10, 117--128. ",
      "doi": "10.5555/1887984.1888000"
    },
    {
      "text": "Paradiso, J., Abler, C., Hsiao, K.Y., and Reynolds M. The Magic Carpet: physical sensing for immersive environmentse. In Proc. CHI EA '97, 1997.  ",
      "doi": "10.1145/1120212.1120391"
    },
    {
      "text": "Paradiso, J., Hu, E., and Hsiao, K.Y. Instrumented footwear for interactive dance. In Proc. the XII Colloquium on Musical Informatics '98, 89--92.",
      "doi": ""
    },
    {
      "text": "Pearson, G., and Weiser, M. Exploratory evaluation of a planar foot-operated cursor-positioning device. In Proc. CHI '88, 13--18.  ",
      "doi": "10.1145/57167.57169"
    },
    {
      "text": "Pike, M.F., Major, H.A., Porcheron, M., Sharples, S.C., and Wilson, M. L. Measuring the effect of think aloud protocols on workload using fNIRS. In Proc. CHI '14, pp. 3807--3816, 2013.  ",
      "doi": "10.1145/2556288.2556974"
    },
    {
      "text": "Razak, A.H.A., Zayegh, A., Begg, R.K., and Wahab, Y. Foot plantar pressure measurement system: a review. In Journal of Sensors 2012, 9884--912.",
      "doi": ""
    },
    {
      "text": "Richardson, B., Leydon, K., Fernstrom, M., and Paradiso, J.A. Z-Tiles: building blocks for modular , pressure-sensing floorspaces, In Proc. CHI '04 EA, 1529--1532.  ",
      "doi": "10.1145/985921.986107"
    },
    {
      "text": "Ruiz J., Li, Y., and Lank E., User-defined motion gestures for mobile interaction. In Proc. CHI'11, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Salpavaara, T., Verho, J., Lekkala, J., and Halttunen, J. Wireless insole sensor system for plantar force measurements during sport events. In Proc. IMEKO XIX World Congress on Fundamental and Applied Metrology'09, 2118--2123",
      "doi": ""
    },
    {
      "text": "Saponas, T.S., Tan, D.S., Morris, D., Balakrishnan, R., Turner, J., and Landay, J.A. Enabling always-available input with muscle-computer interfaces. In Proc. UIST '09, 167--176.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Scott, J., Dearman, D., Yatani, K., and Truong, K.N. Sensing foot gestures from the pocket. In Proc. UIST '10, 199--208.  ",
      "doi": "10.1145/1866029.1866063"
    },
    {
      "text": "Sensoria. http://www.sensoriafitness.com/",
      "doi": ""
    },
    {
      "text": "Takeuchi, Y. Gilded Gait: reshaping the urban experience with augmented footsteps. In Proc. UIST '10, 185--188.  ",
      "doi": "10.1145/1866029.1866061"
    },
    {
      "text": "Tan, D. S., and Nijholt, A. Brain-Computer Interfaces: applying our minds to human-computer interaction. Springer, 2010. ",
      "doi": "10.5555/1855009"
    },
    {
      "text": "Wertsch, J.J., Webster, J.G., and Tompkins, W.J. A portable insole plantar pressure measurement system. In Journal of Rehabilitation Research and Development '92, 13--18.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson , A. D. User-defined gestures for surface computing. In Proc. CHI '09, 1083--1092, 2009.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Wolf, K., Rohs, M., Naumann, A., Müller, J., Laboratories, D.T., and Berlin, T.U. A taxonomy of microinteractions: defining microgestures based on ergonomic and scenario-dependent requirements. In Proc. INTERACT '11, 559--575. ",
      "doi": "10.5555/2042053.2042111"
    }
  ]
}