{
  "doi": "10.1145/2702123.2702304",
  "title": "Mudslide: A Spatially Anchored Census of Student Confusion for Online Lecture Videos",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1555-1564",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Educators have developed an effective technique to get feedback after in-person lectures, called \"muddy cards.\" Students are given time to reflect and write the \"muddiest\" (least clear) point on an index card, to hand in as they leave class. This practice of assigning end-of-lecture reflection tasks to generate explicit student feedback is well suited for adaptation to the challenge of supporting feedback in online video lectures. We describe the design and evaluation of Mudslide, a prototype system that translates the practice of muddy cards into the realm of online lecture videos. Based on an in-lab study of students and teachers, we find that spatially contextualizing students' muddy point feedback with respect to particular lecture slides is advantageous to both students and teachers. We also reflect on further opportunities for enhancing this feedback method based on teachers' and students' experiences with our prototype.",
  "tags": [
    "lecture feedback",
    "flipped classrooms",
    "online lecture videos"
  ],
  "authors": [
    {
      "name": "Elena L. Glassman",
      "institution": "Microsoft Research & Massachusetts Institute of Technology, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-82658918057/rel-imgonly/glassman_200x300.jpg",
      "acmid": "82658918057",
      "orcid": "0000-0001-5178-3496"
    },
    {
      "name": "Juho Kim",
      "institution": "Microsoft Research & Massachusetts Institute of Technology, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    },
    {
      "name": "Andrés Monroy-Hernández",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81350567841/rel-imgonly/8598964387_bdf95cfca1_z.jpg",
      "acmid": "81350567841",
      "orcid": "0000-0003-4889-9484"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    }
  ],
  "references": [
    {
      "text": "Altman, D.G. Practical statistics for medical research. CRC Press, 1990. ",
      "doi": "10.5555/1204461"
    },
    {
      "text": "Angelo, T.A. and Cross, K.P. Classroom assessment techniques. 1993.",
      "doi": ""
    },
    {
      "text": "Breslow, L., Pritchard, D.E., DeBoer, J., Stump, G.S., Ho, A.D., and Seaton, D.T. Studying learning in the worldwide classroom: Research into edX's first MOOC. Research & Practice in Assessment 8, (2013), 13--25.",
      "doi": ""
    },
    {
      "text": "Brush, A.J.B., Bargeron, D., Grudin, J., Borning, A., and Gupta, A. Supporting Interaction Outside of Class: Anchored Discussions vs. Discussion Boards. CSCL 2002, International Society of the Learning Sciences (2002), 425--434. ",
      "doi": "10.5555/1658616.1658676"
    },
    {
      "text": "Cohen, J. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement 20, 1 (1960), 37--46.",
      "doi": ""
    },
    {
      "text": "Craig, S., Graesser, A., Sullins, J., and Gholson, B. Affect and learning: an exploratory look into the role of affect in learning with AutoTutor. Journal of Educational Media 29, 3 (2004), 241--250.",
      "doi": ""
    },
    {
      "text": "Cross, A., Bayyapunedi, M., Ravindran, D., Cutrell, E., and Thies, W. VidWiki: Enabling the Crowd to Improve the Legibility of Online Educational Videos. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM (2014), 1167--1175.  ",
      "doi": "10.1145/2531602.2531670"
    },
    {
      "text": "D'Mello, S., Lehman, B., Pekrun, R., and Graesser, A. Confusion can be beneficial for learning. Learning and Instruction 29, (2014), 153--170.",
      "doi": ""
    },
    {
      "text": "Freeman, S., Eddy, S.L., McDonough, M., et al. Active learning increases student performance in science, engineering, and mathematics. PNAS 111, 23 (2014), 8410--8415.",
      "doi": ""
    },
    {
      "text": "Hall, S.R. Teaching By Questioning. MIT Aero-Astro Annual, 2003, 29--35.",
      "doi": ""
    },
    {
      "text": "Harwood, W.S. The one-minute paper: a communication tool for large lecture classes. J. Chemical Education 73, 3 (1996), 229.",
      "doi": ""
    },
    {
      "text": "Herreid, C.F. and Schiller, N.A. Case studies and the flipped classroom. J. College Science Teaching 42, 5 (2013), 62--66.",
      "doi": ""
    },
    {
      "text": "Kibler, J. Cognitive Disequilibrium. In S. Goldstein and J.A. Naglieri, eds., Encyclopedia of Child Behavior and Development. Springer US, 2011, 380--380.",
      "doi": ""
    },
    {
      "text": "Kim, J., Guo, P.J., Cai, C.J., Li, S.-W.D., Gajos, K.Z., and Miller, R.C. Data-Driven Interaction Techniques for Improving Navigation of Educational Videos. UIST 2014.  ",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Kulkarni, C., Wei, K.P., Le, H., et al. Peer and self assessment in massive online classes. ACM Trans. on Computer-Human Interaction 20, 6 (2013), 33.  ",
      "doi": "10.1145/2505057"
    },
    {
      "text": "Lombard, M., Snyder-Duch, J., and Bracken, C.C. Practical resources for assessing and reporting intercoder reliability in content analysis research projects. Retrieved April 19, (2004), 2004.",
      "doi": ""
    },
    {
      "text": "Luther, K., Pavel, A., Wu, W., et al. CrowdCrit: crowdsourcing and aggregating visual design critique. CSCW 2014, ACM (2014), 21--24.  ",
      "doi": "10.1145/2556420.2556788"
    },
    {
      "text": "Mosteller, F. The \"Muddiest Point in the Lecture\" as a feedback device. On Teaching and Learning: J. Harvard-Danforth Center 3, (1989), 10--21.",
      "doi": ""
    },
    {
      "text": "Sadler, D.R. Formative assessment and the design of instructional systems. Instructional science 18, 2 (1989), 119--144.",
      "doi": ""
    },
    {
      "text": "Surowiecki, J. The wisdom of crowds. Random House LLC, 2005. ",
      "doi": "10.5555/1095645"
    },
    {
      "text": "Wattenberg, M. and Viegas, F.B. The Word Tree, an Interactive Visual Concordance. IEEE Transactions on Visualization and Computer Graphics 14, 6 (2008), 1221--1228.  ",
      "doi": "10.1109/TVCG.2008.172"
    },
    {
      "text": "Wilson, R.C. Improving faculty teaching: Effective use of student evaluations and consultants. J. Higher Education, (1986), 196--211.",
      "doi": ""
    },
    {
      "text": "Xu, A., Huang, S.-W., and Bailey, B. Voyant: generating structured feedback on visual designs using a crowd of non-experts. CSCW 2014, ACM (2014), 1433--1444.  ",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Zyto, S., Karger, D., Ackerman, M., and Mahajan, S. Successful classroom deployment of a social document annotation system. CHI 2012, ACM (2012), 1883--1892.  ",
      "doi": "10.1145/2207676.2208326"
    }
  ]
}