{
  "doi": "10.1145/2702123.2702149",
  "title": "DesignScape: Design with Interactive Layout Suggestions",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1221-1224",
  "year": 2015,
  "badges": [],
  "abstract": "Creating graphic designs can be challenging for novice users. This paper presents DesignScape, a system which aids the design process by making interactive layout suggestions, i.e., changes in the position, scale, and alignment of elements. The system uses two distinct but complementary types of suggestions: refinement suggestions, which improve the current layout, and brainstorming suggestions, which change the style. We investigate two interfaces for interacting with suggestions. First, we develop a suggestive interface, where suggestions are previewed and can be accepted. Second, we develop an adaptive interface where elements move automatically to improve the layout. We compare both interfaces with a baseline without suggestions, and show that for novice designers, both interfaces produce significantly better layouts, as evaluated by other novices.",
  "authors": [
    {
      "name": "Peter O'Donovan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314491507",
      "orcid": "missing"
    },
    {
      "name": "Aseem Agarwala",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100035467",
      "orcid": "missing"
    },
    {
      "name": "Aaron Hertzmann",
      "institution": "University of Toronto (CA) & Adobe Systems, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100015154",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dow, S. P., Glassco, A., Kass, J., Schwarz, M., Schwartz, D. L., and Klemmer, S. R. Parallel Prototyping Leads to Better Design Results, More Divergence, and Increased Self-efficacy. ACM Trans. Comput.-Hum. Interact. 17, 4 (2010), 18:1--18:24.  ",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Gross, M. D., and Do, E. Y.-L. Ambiguous Intentions: A Paper-like Interface for Creative Design. In Proc. UIST (1996), 183--192.  ",
      "doi": "10.1145/237091.237119"
    },
    {
      "text": "Lee, B., Srivastava, S., Kumar, R., Brafman, R., and Klemmer, S. R. Designing with Interactive Example Galleries. In Proc. CHI (2010), 2257--2266.  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Merrell, P., Schkufza, E., Li, Z., Agrawala, M., and Koltun, V. Interactive Furniture Layout Using Interior Design Guidelines. ACM TOG (2011).  ",
      "doi": "10.1145/2010324.1964982"
    },
    {
      "text": "O'Donovan, P., Agarwala, A., and Hertzmann, A. Learning Layouts for Single-Page Graphic Designs. IEEE TVCG, 20, 8 (2014), 1200--1213.  ",
      "doi": "10.1109/TVCG.2014.48"
    },
    {
      "text": "Swendsen, R. H., and Wang, J. S. Replica Monte Carlo Simulation of Spin-Glasses. Physical Review Letters 57, 21 (Nov. 1986), 2607--2609.",
      "doi": ""
    },
    {
      "text": "Terry, M., Mynatt, E. D., Nakakoji, K., and Yamamoto, Y. Variation in Element and Action. In Proc. CHI (2004), 711--718.  ",
      "doi": "10.1145/985692.985782"
    }
  ]
}