{
  "doi": "10.1145/2702123.2702601",
  "title": "Joint Estimation of 3D Hand Position and Gestures from Monocular Video for Mobile Interaction",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3657-3660",
  "year": 2015,
  "badges": [],
  "abstract": "We present a machine learning technique to recognize gestures and estimate metric depth of hands for 3D interaction, relying only on monocular RGB video input. We aim to enable spatial interaction with small, body-worn devices where rich 3D input is desired but the usage of conventional depth sensors is prohibitive due to their power consumption and size. We propose a hybrid classification-regression approach to learn and predict a mapping of RGB colors to absolute, metric depth in real time. We also classify distinct hand gestures, allowing for a variety of 3D interactions. We demonstrate our technique with three mobile interaction scenarios and evaluate the method quantitatively and qualitatively.",
  "tags": [
    "machine learning",
    "mobile interaction",
    "gesture recognition"
  ],
  "authors": [
    {
      "name": "Jie Song",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658638604",
      "orcid": "missing"
    },
    {
      "name": "Fabrizio Pece",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81479664130/rel-imgonly/profile_pic.jpg",
      "acmid": "81479664130",
      "orcid": "missing"
    },
    {
      "name": "Gábor Sörös",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453662639",
      "orcid": "missing"
    },
    {
      "name": "Marion Koelle",
      "institution": "University of Passau & ETHZ, Passau, Bavaria, Germany",
      "img": "/do/10.1145/contrib-86158741357/rel-imgonly/marionkoelle_xs.jpg",
      "acmid": "86158741357",
      "orcid": "0000-0002-5931-3218"
    },
    {
      "name": "Otmar Hilliges",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81309495440/rel-imgonly/81309495440.jpg",
      "acmid": "81309495440",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bau, O., and Mackay, W. E. Octopocus: A dynamic guide for learning gesture-based command sets. In Proc. ACM UIST (2008), 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Fanello, S. R., Keskin, C., Izadi, S., Kohli, P., Kim, D., Sweeney, D., Criminisi, A., Shotton, J., Kang, S. B., and Paek, T. Learning to be a depth camera for close-range human capture and interaction. ACM Trans. Graph. 33, 4 (2014), 86:1--86:11.  ",
      "doi": "10.1145/2601097.2601223"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. Skinput: Appropriating the Body As an Input Surface. In Proc. ACM CHI (2010), 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Karsch, K., Liu, C., and Kang, S. B. Depth extraction from video using non-parametric sampling. In Proc. of ECCV (2012), 775--788.  ",
      "doi": "10.1007/978-3-642-33715-4_56"
    },
    {
      "text": "Kim, D., Hilliges, O., Izadi, S., Butler, A. D., Chen, J., Oikonomidis, I., and Olivier, P. Digits: Freehand 3D interactions anywhere using a wrist-worn gloveless sensor. In Proc. ACM UIST (2012), 167--176.  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Ladicky, L., Shi, J., and Pollefeys, M. Pulling things out of perspective. In Proc. IEEE CVPR (2013), 89--96.  ",
      "doi": "10.1109/CVPR.2014.19"
    },
    {
      "text": "Ladicky, L., Zeisl, B., and Pollefeys, M. Discriminatively trained dense surface normal estimation. In Proc. of ECCV (2014), 468--484.",
      "doi": ""
    },
    {
      "text": "Lissermann, R., Huber, J., Hadjakos, A., and Mühlhäuser, M. Earput: Augmenting behind-the-ear devices for ear-based interaction. In ACM CHI Extended Abstracts (2013), 1323--1328.  ",
      "doi": "10.1145/2468356.2468592"
    },
    {
      "text": "Ogata, M., Sugiura, Y., Makino, Y., Inami, M., and Imai, M. SenSkin: Adapting Skin As a Soft Interface. In Proc. ACM UIST (2013), 539--544.  ",
      "doi": "10.1145/2501988.2502039"
    },
    {
      "text": "Perrault, S. T., Lecolinet, E., Eagan, J., and Guiard, Y. Watchit: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. In Proc. ACM CHI (2013), 1451--1460.  ",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Saponas, T. S., Kelly, D., Parviz, B. A., and Tan, D. S. Optically Sensing Tongue Gestures for Computer Input. In Proc. ACM UIST (2009), 177--180.  ",
      "doi": "10.1145/1622176.1622209"
    },
    {
      "text": "Serrano, M., Ens, B. M., and Irani, P. P. Exploring the use of hand-to-face input for interacting with head-worn displays. In Proc. of ACM SIGCHI (2014), 3181--3190.  ",
      "doi": "10.1145/2556288.2556984"
    },
    {
      "text": "Song, J., Soros, G., Pece, F., Fanello, S., Izadi, S., Keskin, C., and Hilliges, O. In-air Gestures Around Unmodified Mobile Devices. In Proc. ACM UIST (2014), 319--329.  ",
      "doi": "10.1145/2642918.2647373"
    },
    {
      "text": "Yang, X.-D., Grossman, T., Wigdor, D., and Fitzmaurice, G. Magic finger: Always-available input through finger instrumentation. In Proc. ACM UIST (2012), 147--156.  ",
      "doi": "10.1145/2380116.2380137"
    }
  ]
}