{
  "doi": "10.1145/2702123.2702340",
  "title": "EyeBookmark: Assisting Recovery from Interruption during Reading",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2963-2966",
  "year": 2015,
  "badges": [],
  "abstract": "In this paper, we present gaze-based bookmarking, EyeBookmark, to mitigate the deleterious effect of interruption during reading. The key idea of EyeBookmark is to provide a visual cue to help people decide where to resume reading. We design four highlighting methods and conduct a controlled user study with a proof-of-concept design to verify the usefulness of EyeBookmark. The user study demonstrates not only that participants preferred our highlighting methods but also that such highlighting methods significantly reduced the time taken to resume reading after interruption regardless of the difficulty of text.",
  "authors": [
    {
      "name": "Jaemin Jo",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703635",
      "orcid": "missing"
    },
    {
      "name": "Bohyoung Kim",
      "institution": "Seoul National University Bundang Hospital, Seongnam-si, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758814957",
      "orcid": "missing"
    },
    {
      "name": "Jinwook Seo",
      "institution": "Seoul National University, Seoul, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100413624",
      "orcid": "0000-0002-7734-822X"
    }
  ],
  "references": [
    {
      "text": "Buscher, G., Biedert, R., Heinesch, D., and Dengel, A. Eye tracking analysis of preferred reading regions on the screen. Proc. CHI EA'10, 2010, 3307--3312.  ",
      "doi": "10.1145/1753846.1753976"
    },
    {
      "text": "Cane, J.E., Cauchard, F., and Weger, U.W. The timecourse of recovery from interruption during reading: Eye movement evidence for the role of interruption lag and spatial memory. The Quarterly Journal of Experimental Psychology 65, 7 (2012), 1397--1413.",
      "doi": ""
    },
    {
      "text": "Duggan, G.B. and Payne, S.J. Skim reading by satisficing: evidence from eye tracking. Proc. CHI'11, 2011, 1141--1150.  ",
      "doi": "10.1145/1978942.1979114"
    },
    {
      "text": "Inhoff, A.W. and Weger, U.W. Memory for word location during reading: Eye movements to previously read words are spatially selective but not precise. Memory & cognition 33, 3 (2005), 447--461.",
      "doi": ""
    },
    {
      "text": "Latorella, K.A. Investigating interruptions: Implications for flightdeck performance. National Aeronautics and Space Administration, 1999.",
      "doi": ""
    },
    {
      "text": "McFarlane, D.C. and Latorella, K.A. The scope and importance of human interruption in human-computer interaction design. Human-Computer Interaction 17, 1 (2002), 1--61.  ",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Olsen, A. The Tobii I-VT Fixation Filter. Tobii Technology, 2012.",
      "doi": ""
    },
    {
      "text": "Sharmin, S., Špakov, O., and Räihä, KJ. Reading onscreen text with gaze-based auto-scrolling. Proc. ETSA'13, 2013, pp. 24--31.  ",
      "doi": "10.1145/2509315.2509319"
    },
    {
      "text": "Text 2.0, http://text20.net/, Jan 2015.",
      "doi": ""
    },
    {
      "text": "Yun, C. A Study on the development of a readability formula in non-literary texts, 2006",
      "doi": ""
    }
  ]
}