{
  "doi": "10.1145/2702123.2702173",
  "title": "Color Portraits: From Color Picking to Interacting with Color",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4207-4216",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Although ubiquitous, color pickers have remained largely unchanged for 25 years. Based on contextual interviews with artists and designers, we created the Color Portraits design space to characterize five key color manipulation activities: sampling and tweaking individual colors, manipulating color relationships, combining colors with other elements, revisiting previous color choices, and revealing a design process through color. We found similar color manipulation requirements with scientists and engineers. We designed novel color interaction tools inspired by the design space, and used them as probes to identify specific design requirements, including: interactive palettes for sampling colors and exploring relationships; color composites for blending and decomposing colors with other elements; interactive histories to enable reuse of previous color choices; and providing color as a way to reveal underlying processes. We argue that color tools should allow users to interact with colors, not just pick or sample them.",
  "tags": [
    "color tools",
    "creativity",
    "generative design",
    "color picker"
  ],
  "authors": [
    {
      "name": "Ghita Jalal",
      "institution": "Inria/Universite Paris Sud, Orsay, Essonne, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704013",
      "orcid": "missing"
    },
    {
      "name": "Nolwenn Maudet",
      "institution": "INRIA & Paris Sud, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699736",
      "orcid": "missing"
    },
    {
      "name": "Wendy E. Mackay",
      "institution": "INRIA & Univ Paris-Sud, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236706",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albers, J. Interaction of Color: 50th Anniversary Edition. Yale University Press, New Haven, CT, 2013. ",
      "doi": "10.5555/1204273"
    },
    {
      "text": "Bailey, P., Manktelow, K., & Olomolaiye, P. Examination of the color selection process within digital design for the built environment. In Proc. IEEE, Theory and Practice of Computer Graphics (2003), 193--200. ",
      "doi": "10.5555/832264.833402"
    },
    {
      "text": "Bergman, L.D., Rogowitz, B.E., & Treinish, L.A. A rule-based tool for assisting colormap selection. In Proc. Visualization (1995), 118. ",
      "doi": "10.5555/832271.833862"
    },
    {
      "text": "Chevalier, F., Dragicevic, P., & Hurter, C. Histomages: fully synchronized views for image editing. In Proc. ACM UIST (2012), 281--286.  ",
      "doi": "10.1145/2380116.2380152"
    },
    {
      "text": "Della Ventura, A. & Schettini, R. (1992) Computeraided color coding for data display. In Proc. IAPR (1992), 3: 29--32.",
      "doi": ""
    },
    {
      "text": "Douglas, S.A. & Kirkpatrick, A.E. Model and representation: the effect of visual feedback on human performance in a color picker interface. ACM Transactions on Graphics (1999), 18(2): 96--127.  ",
      "doi": "10.1145/318009.318011"
    },
    {
      "text": "Faul, F. & Ekroll, V. Psychophysical model of chromatic perceptual transparency based on substractive color mixture. JOSA A 19,6 (2002), 1084--1095.",
      "doi": ""
    },
    {
      "text": "Frisby, J.P. & Clatworthy, J.L. Illusory contours: curious cases of simultaneous brightness contrast? Perception 4, 3 (1975), 349--357.",
      "doi": ""
    },
    {
      "text": "Glaser, B. & Strauss, A. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine Transaction, Chicago, 1999.",
      "doi": ""
    },
    {
      "text": "Harrower, M. & Brewer, C.A. ColorBrewer.org: An Online Tool for Selecting Colour Schemes for Maps. The Cartographic Journal 40, 1 (2003), 27--37.",
      "doi": ""
    },
    {
      "text": "Healey, C.G. Choosing effective colours for data visualization. In Proc. Visualization (1996), 263--270. ",
      "doi": "10.5555/244979.245597"
    },
    {
      "text": "Hill, W.C., Hollan, J.D., Wroblewski, D., & McCandless, T. Edit Wear and Read Wear. In Proc. ACM SIGCHI (1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B., Druin, A., Plaisant, A., Beaudouin-Lafon, M., Conversy, M., Evans, H., Hansen, H., Roussel, N., & Eiderbäck, B. Technology probes: inspiring design for and with families. In Proc. ACM CHI (2003), 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Itten, J. Art de la couleur, édition abrégée. Bordas Editions, Paris, 1996.",
      "doi": ""
    },
    {
      "text": "Jirousek, C. Color, Value and Hue. Art, Design and Visual Thinking, 1995.",
      "doi": ""
    },
    {
      "text": "King, T.D. Human color perception, cognition, and culture: why red is always red. Electronic Imaging, Inter. Soc. Optics & Photo. (2005), 234--242.",
      "doi": ""
    },
    {
      "text": "Kubat, R., Mirman, D., & Roy, D. Semantic context effects on color categorization. In Proc. CogSci (2009).",
      "doi": ""
    },
    {
      "text": "McCollough, C. Color Adaptation of Edge-Detectors in the Human Visual System. Science (New York, N.Y.) 149, 3688 (1965), 1115--1116.",
      "doi": ""
    },
    {
      "text": "Meier, B.J., Spalter, A.M., & Karelitz, D.B. Interactive color palette tools In Proc. IEEE Graphics and Applications, 24, 3 (2004), 64--72.  ",
      "doi": "10.1109/MCG.2004.1297012"
    },
    {
      "text": "Meier, B.J. ACE: a color expert system for user interface design. In Proc. ACM SIGGRAPH symposium on User Interface Software (1988), 117--128.  ",
      "doi": "10.1145/62402.62424"
    },
    {
      "text": "Meyer, G.W. & Greenberg, D.P. Perceptual color spaces for computer graphics. In Proc. ACM SIGGRAPH Computer Graphics (1980), 254--261.  ",
      "doi": "10.1145/800250.807502"
    },
    {
      "text": "O'Neill, J., Martin, D., Colombino, T., Roulland, F. & Willamowski, J. Colour management is a sociotechnical problem. In Proc. ACM CSCW (2008), 599--608.  ",
      "doi": "10.1145/1460563.1460657"
    },
    {
      "text": "Pang, W. M. An intuitive texture picker. In Proc. ACM IUI (2010), 365--368.  ",
      "doi": "10.1145/1719970.1720032"
    },
    {
      "text": "Pouli, T. & Reinhard, E. Progressive histogram reshaping for creative color transfer and tone reproduction. In Proc. ACM Symposium on NonPhotorealistic Animation and Rendering (2010), 81--90.  ",
      "doi": "10.1145/1809939.1809949"
    },
    {
      "text": "Robertson, P.K. Visualizing color gamuts: A user interface for the effective use of perceptual color spaces in data displays. IEEE CG&A, 8, 5 (1988), 50--64.  ",
      "doi": "10.1109/38.7761"
    },
    {
      "text": "Wang, L., Giesen, J., McDonnell, K.T., Zolliker, P., & Mueller, K. Color design for illustrative visualization. IEEE Vis. Comp. Graph, 14 6 (2008), 1739--1754.  ",
      "doi": "10.1109/TVCG.2008.118"
    },
    {
      "text": "Wijffelaars, M., Vliegen, R., Van Wijk, J.J., & Van Der Linden, E.-J. Generating color palettes using intuitive parameters. Comp Graph. For. (2008), 743--750.  ",
      "doi": "10.1111/j.1467-8659.2008.01203.x"
    }
  ]
}