{
  "doi": "10.1145/2702123.2702213",
  "title": "Patina Engraver: Visualizing Activity Logs as Patina in Fashionable Trackers",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1173-1182",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Despite technological improvements in commercial activity trackers, little attention has been given to their emotional, social, or fashion-related qualities, such as their visual aesthetics and their relationship to self-expression and social connection. As an alternative integrated approach incorporating HCI, fashion, and product design, our project made use of the characteristics of patina to improve activity trackers as fashionable wearables. We developed the Patina Engraving System, which engraves patina-like patterns on an activity tracker according to a user's activity logs. Using a piercing technique, the patina of activity logs has been made abstract, visually rich, gradually emerging, and historically accumulated. During the field trial, we found that the patina motivated the participants to increase exercises for engraving aesthetic patinas. A tracker with patina triggered spontaneous social interactions in face-to-face situations. The participants also cherished the trackers that held their own history. Based on the field trial, we discuss design implications for utilizing patina in designing future fashionable technologies.",
  "authors": [
    {
      "name": "Moon-Hwan Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556815556",
      "orcid": "missing"
    },
    {
      "name": "Seijin Cha",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658700999",
      "orcid": "missing"
    },
    {
      "name": "Tek-Jin Nam",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320511",
      "orcid": "0000-0002-7942-0766"
    }
  ],
  "references": [
    {
      "text": "Adidas miCoach Elite. http://goo.gl/qECxs3.",
      "doi": ""
    },
    {
      "text": "Bolton, A. The super modern wardrobe. New York: Harry N. Abrahms (2002).",
      "doi": ""
    },
    {
      "text": "Brown, B., Reeves, S. and Sherwood, S. Into the wild: challenges and opportunities for field trial methods. Proc. CHI'11, ACM (2011), 1657--1666.  ",
      "doi": "10.1145/1978942.1979185"
    },
    {
      "text": "Choe, E.K., et al. A. Understanding Quantified-Selfers' Practices in Collecting and Exploring Personal Data. Proc. CHI'14, ACM (2014) 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Consolvo, S., Everitt, K., Smith, I., and Landay, J.A. Design Requirements for Technologies that Encourage Physical Activity. Proc. CHI'06, ACM (2006), 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "DeSilvey, C. Observed decay: telling stories with mutable things. Journal of Material Culture, 11, 3 (2006), 318--338.",
      "doi": ""
    },
    {
      "text": "Erickson, T. and Kellogg, W. Social Translucence: An Approach to Designing Systems that Support Social Processes. ACM Transactions on Human-Computer Interaction, 7, 1 (2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Fallman, D. The new good: exploring the potential of philosophy of technology to contribute to human-computer interaction. In Proc. CHI'11, 1051--1060.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Fan, C., Forlizzi, J., and Dey, A. A Spark Of Activity: Exploring Informative Art As Visualization For Physical Activity. In Proc. UbiComp'12, ACM (2012), 81--84.  ",
      "doi": "10.1145/2370216.2370229"
    },
    {
      "text": "Fitbit. http://www.fitbit.com/.",
      "doi": ""
    },
    {
      "text": "Fitbit and Tory Burch. http://goo.gl/As7ce1.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Persuasive Techology: Using Computers to Change What We Think and Do. Ubiquity (2002), 89--120.  ",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Fogg, B.J. \"The new rules of persuasion.\" RSA Digital Journal, Summer 2009. Online.",
      "doi": ""
    },
    {
      "text": "Fougere, T. Tyndall Table (2012). http://thomfougere.com/thomfougere-TyndallTable.",
      "doi": ""
    },
    {
      "text": "Frey, J., Fontana, A. The group interview in social research, The Social Science Journal, 28(2) (1991), 175--187.",
      "doi": ""
    },
    {
      "text": "Gaver, W.W., Dunne, A., and Pacenti, E. Cultural Probes. Interactions (1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Heijdens's Broken White. http://goo.gl/nnMuhE.",
      "doi": ""
    },
    {
      "text": "Hiiop, H. The Possibility of Patina in Contemporary Art or, Does the \"New Art\" Have a Right to Get Old? In Koht ja paik. Place and Location. Studies in Environmental Aesthetics and Semiotics VI Estonian Literary Museum, Estonian Academy of Arts (2008), 153--165.",
      "doi": ""
    },
    {
      "text": "Hill, W., Hollan, J., Wroblewski, D. & McCandless, T. Edit wear and read wear. Proc. CHI'92, ACM (1992), 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Jacobs, J. and Buechley, L. Codeable objects: computational design and digital fabrication for novice programmers. In Proc.CHI'13, ACM (2013), 1589--1598.  ",
      "doi": "10.1145/2470654.2466211"
    },
    {
      "text": "Khot, R., Hjorth, L., Mueller, F. Understanding Physical Activity through 3D Printed Material Artifacts. In Proc. CHI'14 (2014), 3835--3844.  ",
      "doi": "10.1145/2556288.2557144"
    },
    {
      "text": "Kleine, S. S., Kleine III, R. E. and Allen, C. T. How is a possession\" me\" or\" not me\"? Characterizing types and an antecedent of material possession attachment. Journal of Consumer Research (1995), 327--343.",
      "doi": ""
    },
    {
      "text": "Ledger, D. & McCarffrey, D. Inside Wearables, Endeavour Partners (2014).",
      "doi": ""
    },
    {
      "text": "Li, I., Dey, A., and Forlizzi, J. Using Context to Reveal Factors that Affect Physical Activity. TOCHI, 19(1) (2012), 1--21.  ",
      "doi": "10.1145/2147783.2147790"
    },
    {
      "text": "Li, I., Dey, A.K.A., and Forlizzi, J. Understanding My Data, Myself: Supporting Self-Reflection with Ubicomp Technologies. In Proc. UbiComp'11, 405--414.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Lin, J.J., et al. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. In Proc. UbiComp'06 (2006), 261--78.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Mauriello, M., Gubbels, M. and Froehlich, J. Social fabric fitness: the design and evaluation of wearable E-textile displays to support group running. Proc. CHI'14, 2833-  ",
      "doi": "10.1145/2556288.2557299"
    },
    {
      "text": "Pan, Y. and Blevis, E. Fashion thinking: lessons from fashion and sustainable interaction design, concepts and issues. In Proc. DIS'14, ACM, 1005--1014.  ",
      "doi": "10.1145/2598510.2598586"
    },
    {
      "text": "Requena, E. LOVE PROJECT. http://goo.gl/o19avO.",
      "doi": ""
    },
    {
      "text": "Rooksby, J., Rost, M., et al. Personal Tracking as Lived Informatics. In Proc. CHI 2014, ACM, 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "RunKeeper. http://runkeeper.com/.",
      "doi": ""
    },
    {
      "text": "Seymour, S. Fashionable Technology: The Intersection of Design, Fashion, Science and Technology, Springer. 2008 ",
      "doi": "10.5555/1386567"
    },
    {
      "text": "Schütte, A. A. Patina: layering a history-of-use on digital objects. MIT Media Laboratory (1998).",
      "doi": ""
    },
    {
      "text": "Simpson, I. The Encyclopedia of Drawing Techniques. London: Headline (1987), 62--64.",
      "doi": ""
    },
    {
      "text": "Stack, K. NFL Prospects to Wear Smart, Data Gathering Workout Shirt. Gizmodo (2011). http://goo.gl/xxbdan.",
      "doi": ""
    },
    {
      "text": "Swaminathan, S., et al. Supporting the design and fabrication of physical visualizations. In Proc. CHI'14, ACM, 3845--3854.  ",
      "doi": "10.1145/2556288.2557310"
    },
    {
      "text": "Zancheti, S. M., de Figueirôa Silva, A., Braga, A. C., Gameiro, F. G., Lira, F. B., & Costa, L. S. The patina of the city. City & Time, 2 (2) (2006).",
      "doi": ""
    }
  ]
}