{
  "doi": "10.1145/2702123.2702311",
  "title": "ClimbSense: Automatic Climbing Route Recognition using Wrist-worn Inertia Measurement Units",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2033-2042",
  "year": 2015,
  "badges": [],
  "abstract": "Today, sports and activity trackers are ubiquitous. Especially runners and cyclists have a variety of possibilities to record and analyze their workouts. In contrast, climbing did not find much attention in consumer electronics and human-computer interaction. If quantified data similar to cycling or running data were available for climbing, several applications would be possible, ranging from simple training diaries to virtual coaches or usage analytics for gym operators. This paper introduces a system that automatically recognizes climbed routes using wrist-worn inertia measurement units (IMUs). This is achieved by extracting features of a recorded ascent and use them as training data for the recognition system. To verify the recognition system, cross-validation methods were applied to a set of ascent recordings that were assessed during a user study with eight climbers in a local climbing gym. The evaluation resulted in a high recognition rate, thus proving that our approach is possible and operational.",
  "tags": [
    "climbing",
    "machine learning",
    "inertial sensors",
    "sports technologies"
  ],
  "authors": [
    {
      "name": "Felix Kosmalla",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556717456",
      "orcid": "missing"
    },
    {
      "name": "Florian Daiber",
      "institution": "German Research Center for Artificial Intelligence (DFKI) & Lancaster University, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436595707",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Aladdin, R., and Kry, P. Static pose reconstruction with an instrumented bouldering wall. In Proc. VRST (2012), 177--184.  ",
      "doi": "10.1145/2407336.2407369"
    },
    {
      "text": "Cormen, T. H., Leiserson, C. E., and Rivest, R. L. Introduction to Algorithms , Second Edition, vol. 7. The MIT Press, 2001. ",
      "doi": "10.5555/500824"
    },
    {
      "text": "Curmi, F., Ferrario, M. A., and Whittle, J. Sharing real-time biometric data across social networks. In Proc. DIS (2014), pp. 657--666.  ",
      "doi": "10.1145/2598510.2598515"
    },
    {
      "text": "Daiber, F., Kosmalla, F., and Kröuger, A. BouldAR Using Augmented Reality to Support Collaborative Boulder Training. In Proc. CHI EA (2013), pp. 949--954.  ",
      "doi": "10.1145/2468356.2468526"
    },
    {
      "text": "Daukantas, S., Marozas, V., and Lukosevicius, A. Inertial sensor for objective evaluation of swimmer performance. In Proc. BEC (2008), 321--324.",
      "doi": ""
    },
    {
      "text": "Fuss, F. K., and Niegl, G. Instrumented climbing holds and dynamics of sport climbing. In The Engineering of Sport 6, E. F. Moritz and S. Haake, Eds. Springer New York, 2006, 57--62.",
      "doi": ""
    },
    {
      "text": "Horst, E. J. How to Climb 5.12, 2nd ed. Falcon, 2003.",
      "doi": ""
    },
    {
      "text": "Kajastila, R., and Höamöalöainen, P. Augmented climbing: Interacting with projected graphics on a climbing wall. In Proc. CHI EA (2014), 1279--1284.  ",
      "doi": "10.1145/2559206.2581139"
    },
    {
      "text": "Kooyman, D. J., James, D. A., and Rowlands, D. D. A feedback system for the motor learning of skills in golf. Procedia Engineering 60, 0 (2013), 226--231.",
      "doi": ""
    },
    {
      "text": "Kranz, M., Möoller, A., Hammerla, N., Diewald, S., Plöotz, T., Olivier, P., and Roalter, L. The mobile fitness coach: Towards individualized skill assessment using personalized mobile devices. Pervasive and Mobile Computing 9, 2 (2013), pp. 203--215.  ",
      "doi": "10.1016/j.pmcj.2012.06.002"
    },
    {
      "text": "Ladha, C., Hammerla, N. Y., Olivier, P., and Plöotz, T. Climbax: Skill assessment for climbing enthusiasts. In Proc. UbiComp (2013), 235--244.  ",
      "doi": "10.1145/2493432.2493492"
    },
    {
      "text": "Liljedahl, M., Lindberg, S., and Berg, J. Digiwall: An interactive climbing wall. In Proc. ACE (2005), 225--228.  ",
      "doi": "10.1145/1178477.1178513"
    },
    {
      "text": "Morris, D., Saponas, T. S., Guillory, A., and Kelner, I. Recofit: Using a wearable sensor to find, recognize, and count repetitive exercises. In Proc. CHI (2014), pp. 3225--3234.  ",
      "doi": "10.1145/2556288.2557116"
    },
    {
      "text": "Ojala, J., and Saarela, J. Understanding social needs and motivations to share data in online sports communities. In Proc. MindTrek (2010), 95--102.  ",
      "doi": "10.1145/1930488.1930508"
    },
    {
      "text": "Ouchi, H., Nishida, Y., Kim, I., Motomura, Y., and Mizoguchi, H. Detecting and modeling play behavior using sensor-embedded rock-climbing equipment. In Proc. IDC (2010), 118--127.  ",
      "doi": "10.1145/1810543.1810557"
    },
    {
      "text": "Pfeil, J., Mitani, J., and Igarashi, T. Interactive climbing route design using a simulated virtual climber. In SA Sketches (2011), 2:1--2:2.  ",
      "doi": "10.1145/2077378.2077381"
    },
    {
      "text": "Premerlani, W., and Bizard, P. Direction cosine matrix imu: Theory. DIY Drones.{Online} http://goo.gl/cCGNXB (2009).",
      "doi": ""
    },
    {
      "text": "Rooksby, J., Rost, M., Morrison, A., and Chalmers, M. C. Personal tracking as lived informatics. In Proc. CHI (2014), pp. 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Stamm, A., James, D., and Thiel, D. Velocity profiling using inertial sensors for freestyle swimming. Sports Engineering 16, 1 (2013), 1--11.",
      "doi": ""
    },
    {
      "text": "Stamm, A., Thiel, D. V., Burkett, B., and James, D. A. Towards determining absolute velocity of freestyle swimming using 3-axis accelerometers. Procedia Engineering 13, 0 (2011), pp. 120--125.",
      "doi": ""
    },
    {
      "text": "Stiefmeier, T., Roggen, D., and Tröoster, G. Gestures are strings: efficient online gesture spotting and classification using string matching. Proc. BodyNets (2007). ",
      "doi": "10.5555/1460232.1460248"
    },
    {
      "text": "Thong, Y., Woolfson, M., Crowe, J., Hayes-Gill, B., and Jones, D. Numerical double integration of acceleration measurements in noise. Measurement 36, 1 (July 2004), 73--92.",
      "doi": ""
    }
  ]
}