{
  "doi": "10.1145/2702123.2702218",
  "title": "uCap: An Internet Data Management Tool For The Home",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3093-3102",
  "year": 2015,
  "badges": [],
  "abstract": "Internet Service Providers (ISPs) have introduced \"data caps\", or quotas on the amount of data that a customer can download during a billing cycle. Under this model, Internet users who reach a data cap can be subject to degraded performance, extra fees, or even temporary interruption of Internet service. For this reason, users need better visibility into and control over their Internet usage to help them understand what uses up data and control how these quotas are reached. In this paper, we present the design and implementation of a tool, called uCap, to help home users manage Internet data. We conducted a field trial of uCap in 21 home networks in three countries and performed an in-depth qualitative study of ten of these homes. We present the results of the evaluation and implications for the design of future Internet data management tools.",
  "tags": [
    "bandwidth caps",
    "data caps",
    "home networking tools"
  ],
  "authors": [
    {
      "name": "Marshini Chetty",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81328487724/rel-imgonly/a08a3333.jpg",
      "acmid": "81328487724",
      "orcid": "0000-0003-0804-6110"
    },
    {
      "name": "Hyojoon Kim",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660554112",
      "orcid": "missing"
    },
    {
      "name": "Srikanth Sundaresan",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444605345",
      "orcid": "missing"
    },
    {
      "name": "Sam Burnett",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467651419",
      "orcid": "missing"
    },
    {
      "name": "Nick Feamster",
      "institution": "Princeton University, Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100095142",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexa. Top websites in USA. http://www.alexa.com/topsites/countries/US.",
      "doi": ""
    },
    {
      "text": "Chetty, M., Banks, R., Bernheim Brush, A.J., Donner, J., and Grinter, R.E. Under Development: While the meter is running: computing in a capped world. Interactions 18, 2 (2011), 72--75.  ",
      "doi": "10.1145/1925820.1925836"
    },
    {
      "text": "Chetty, M., Banks, R., Brush, A.J., Donner, J., and Grinter, R. You're capped: understanding the effects of bandwidth caps on broadband use in the home. CHI 2012, ACM (2012), 3021--3030. - 10 -  ",
      "doi": "10.1145/2207676.2208714"
    },
    {
      "text": "Chetty, M., Banks, R., Harper, R., Regan, T., Sellen, A., Gkantsidis, C., Karagiannis, T., and Key, P. Who's hogging the bandwidth: the consequences of revealing the invisible in the home. CHI 2010, ACM (2010), 659--668.  ",
      "doi": "10.1145/1753326.1753423"
    },
    {
      "text": "Chetty, M., Haslem, D., Baird, A., Ofoha, U., Sumner, B., and Grinter, R. Why is my internet slow?: making network speeds visible. CHI 2011, ACM (2011), 1889-- 1898.  ",
      "doi": "10.1145/1978942.1979217"
    },
    {
      "text": "Corbin, J. and Strauss, A. Basics of Qualitative Research. SAGE, 2008.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Mortier, R., Rodden, T., and Tolmie, P. Unremarkable networking: the home network as a part of everyday life. DIS 2012, ACM (2012), 554--563 .  ",
      "doi": "10.1145/2317956.2318039"
    },
    {
      "text": "Davidoff, S., Lee, M.K., Yiu, C., and Zimmerman, J. Principles of smart home control. UbiComp 2006, Springer-Verlag (2006), 19--34 .  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Feamster, N., Rexford, J., and Zegura, E. The Road to SDN. Queue 11, 12 (2013), 20--40.  ",
      "doi": "10.1145/2559899.2560327"
    },
    {
      "text": "Federal Communications Commision. Policy Issues in Data Caps and Usage-Based Pricing. (2013), 1--26.",
      "doi": ""
    },
    {
      "text": "Georgia Institute of Technology. GVU Fall Research Showcase. 2011.",
      "doi": ""
    },
    {
      "text": "Government Accountability Office. Eshoo Shares Preliminary Findings of Study on Broadband Data Caps with FCC 2014. http://eshoo.house.gov/pressreleases/eshoo-shares-preliminary-findings-of-study-onbroadband-data-caps-with-fcc/.",
      "doi": ""
    },
    {
      "text": "Grinter, R.E., Edwards, W.K., Chetty, M., et al. The ins and outs of home networking: The case for useful and usable domestic networking. ACM TOCHI 16, 2 (2009), 8--28.  ",
      "doi": "10.1145/1534903.1534905"
    },
    {
      "text": "Grover, S., Park, M.S., and Sundaresan, S. Peeking behind the NAT: an empirical study of home networks. IMC 2013, ACM, 377--390.  ",
      "doi": "10.1145/2504730.2504736"
    },
    {
      "text": "Kawsar, F. and Brush, A.J.B. Home computing unplugged: why, where and when people use different connected devices at home. Ubicomp 2013, ACM (2013), 627--636.  ",
      "doi": "10.1145/2493432.2493494"
    },
    {
      "text": "Kim, H., Sundaresan, S., Chetty, M., Feamster, N., and Edwards, W.K. Communicating with caps: managing usage caps in home networks. SIGCOMM 2011 Demo,ACM (2011), 470--471.  ",
      "doi": "10.1145/2018436.2018526"
    },
    {
      "text": "Yiakoumis, Y., Katti, S., Huang, T., McKeown, N., Yap, K., and Johari, R. Putting Home Users in Charge of their Network. Ubicomp 2012, ACM (2012), 1114--1119.  ",
      "doi": "10.1145/2370216.2370451"
    },
    {
      "text": "Lasar, M. It could be worse: data caps around the world. Ars Technica, 2011.",
      "doi": ""
    },
    {
      "text": "Lohr, S. F.C.C. Is Deluged With Comments on Net Neutrality Rules. New York Times, 2014. http://www.nytimes.com/2014/07/16/technology/adeluge-of-comment-on-net-rules.html.",
      "doi": ""
    },
    {
      "text": "Lucey, P. How Data Caps Are Bad for Cybersecurity. http://oti.newamerica.net/blogposts/2014/how_data_cap s_are_bad_for_cybersecurity-117644.",
      "doi": ""
    },
    {
      "text": "Lunden, I. Comcast Acquired PowerCloud Systems, Gears Up For Smart Home Play. TechCrunch, 2014. http://techcrunch.com/2014/07/14/comcast-skydog/.",
      "doi": ""
    },
    {
      "text": "Mazurek, M.L., Arsenault, J.P., Bresee, J., et al. Access Control for Home Data Sharing: Attitudes, Needs and Practices. CHI 2010, ACM (2010), 645--654.  ",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Monsanto, C., Foster, N., Rexford, J., and Walker, D. Composing Software Defined Networks. NDSI 2013, ACM (2013), 1--13. ",
      "doi": "10.5555/2482626.2482629"
    },
    {
      "text": "Mortier, R., Rodden, T., Tolmie, P., and Lodge, T. Homework: Putting interaction into the infrastructure. UIST 2012, ACM (2012), 197--206.  ",
      "doi": "10.1145/2380116.2380143"
    },
    {
      "text": "OECD. Average data caps by country (GB) logarithmic scale, September 2012. 2012.",
      "doi": ""
    },
    {
      "text": "OECD. Prevalence of explicit bit/data caps amongst surveyed offers by country, September 2012. 2012.",
      "doi": ""
    },
    {
      "text": "OToole, J. Comcast plans data caps for all customers. CNN, 2014. http://money.cnn.com/2014/05/15/technology/comcastdata-limits/.",
      "doi": ""
    },
    {
      "text": "Pfaff, B., Pettit, J., Amidon, K., Casado, M., Koponen, T., and Shenker, S. Extending Networking into the Virtualization Layer. Hotnets 2009, (2009).",
      "doi": ""
    },
    {
      "text": "Poole, E.S., Chetty, M., Grinter, R.E., and Edwards, W.K. More than meets the eye: transforming the user experience of home network management. DIS 2008, ACM (2008), 455--464.  ",
      "doi": "10.1145/1394445.1394494"
    },
    {
      "text": "Sambasivan, N., Lee, P., Hecht, G., and Aoki, P.M. Chale, how much it cost to browse?: results from a mobile data price transparency trial in Ghana. ICTD 2013, ACM (2013), 13--23.  ",
      "doi": "10.1145/2516604.2516607"
    },
    {
      "text": "Sen, S., Joe-Wong, C., Ha, S., and Bawa, J. When the price is right: enabling time-dependent pricing of broadband data. CHI 2013, ACM (2013), 2477--2486 .  ",
      "doi": "10.1145/2470654.2481343"
    },
    {
      "text": "Sen, S., Joe-Wong, C., Ha, S., and Chiang, M. A survey of smart data pricing: Past proposals, current plans, and future trends. ACM Computing Surveys (CSUR), (2013).  ",
      "doi": "10.1145/2543581.2543582"
    },
    {
      "text": "Valancius, V., Lumezanu, C., Feamster, N., Johari, R., and Vazirani, V.V. How many tiers?: pricing in the internet transit market. SIGCOMM 2011, 194--205.  ",
      "doi": "10.1145/2043164.2018459"
    },
    {
      "text": "Yang, J., Edwards, W.K., and Haslem, D. Eden: supporting home network management through interactive visual tools. UIST 2010, ACM, 109--118.  ",
      "doi": "10.1145/1866029.1866049"
    },
    {
      "text": "OpenWRT. https://openwrt.org/.",
      "doi": ""
    },
    {
      "text": "NetWorx. http://www.softperfect.com/products/",
      "doi": ""
    }
  ]
}