{
  "doi": "10.1145/2702123.2702527",
  "title": "A Large-Scale Study of User Image Search Behavior on the Web",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "985-994",
  "year": 2015,
  "badges": [],
  "abstract": "In this study, we analyze user image search behavior from a large-scale Yahoo! Image Search query log, based on the hypothesis that behavior is dependent on query type. We categorize queries using two orthogonal taxonomies (subject-based and facet-based) and identify important query types at the intersection of these taxonomies. We study user search behavior on a large-scale set of search sessions for each query type, examining characteristics of sessions, query reformulation patterns, click patterns, and page view patterns. We identify important behavioral differences across query types, in particular showing that some query types are more exploratory, while others correspond to focused search. We also supplement our study with a survey to link the behavioral differences to users' intent. Our findings shed light on the importance of considering query categories to better understand user behavior on image search platforms.",
  "tags": [
    "user search behavior",
    "query analysis",
    "click analysis",
    "search intent",
    "search strategy",
    "image search"
  ],
  "authors": [
    {
      "name": "Jaimie Y. Park",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659815246",
      "orcid": "missing"
    },
    {
      "name": "Neil O'Hare",
      "institution": "Yahoo, Barcelona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332519337",
      "orcid": "missing"
    },
    {
      "name": "Rossano Schifanella",
      "institution": "University of Torino, Torino, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100596574",
      "orcid": "missing"
    },
    {
      "name": "Alejandro Jaimes",
      "institution": "Yahoo Labs, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100375238",
      "orcid": "missing"
    },
    {
      "name": "Chin-Wan Chung",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351596608",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andre, P., Cutrell, E., Tan, D. S., and Smith, G. Designing novel image search interfaces by understanding unique characteristics and usage. In INTERACT 2009, Springer-Verlag (2009), 340--353.  ",
      "doi": "10.1007/978-3-642-03658-3_40"
    },
    {
      "text": "Armitage, L. H., and Enser, P. G. Analysis of user need in image archives. JIS 23 (1997), 287--299.",
      "doi": ""
    },
    {
      "text": "Broder, A. A taxonomy of web search. SIGIR Forum 36, 2 (2002), 3--10.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Craswell, N., and Szummer, M. Random walks on the click graph. In SIGIR 2007, 239--246.  ",
      "doi": "10.1145/1277741.1277784"
    },
    {
      "text": "Goodrum, A., and Spink, A. Visual information seeking: A study of image queries on the world wide web. In ASIS 1999, vol. 36, ERIC (1999), 665--74.",
      "doi": ""
    },
    {
      "text": "Goodrum, A., and Spink, A. Image searching on the excite web search engine. IPM 37, 2 (2001), 295--311.  ",
      "doi": "10.1016/S0306-4573%2800%2900033-9"
    },
    {
      "text": "Huang, J., and Efthimiadis, E. N. Analyzing and evaluating query reformulation strategies in web search logs. In CIKM 2009, ACM (2009).  ",
      "doi": "10.1145/1645953.1645966"
    },
    {
      "text": "Jansen, B. J. Searching for digital images on the web. JDOC 64, 1 (2008), 81--101.",
      "doi": ""
    },
    {
      "text": "Jansen, B. J., Spink, A., and Narayan, B. Query modifications patterns during web searching. In ITNG 2007 (2007), 439--444.  ",
      "doi": "10.1109/ITNG.2007.164"
    },
    {
      "text": "Jansen, B. J., Spink, A., and Pedersen, J. O. The effect of specialized multimedia collections on web searching. J. Web Eng. 3, 3--4 (2004), 182--199. ",
      "doi": "10.5555/2011149.2011152"
    },
    {
      "text": "Joachims, T., Granka, L., Pan, B., Hembrooke, H., and Gay, G. Accurately interpreting clickthrough data as implicit feedback. In SIGIR 2005, 154--161.  ",
      "doi": "10.1145/1076034.1076063"
    },
    {
      "text": "Liu, J., Cole, M. J., Liu, C., Bierig, R., Gwizdka, J., Belkin, N. J., Zhang, J., and Zhang, X. Search behaviors in different task types. In JCDL 2010, 69--78.  ",
      "doi": "10.1145/1816123.1816134"
    },
    {
      "text": "Lux, M., Kofler, C., and Marques, O. A classification scheme for user intentions in image search. In Ext. Abstracts CHI 2010, ACM (2010).  ",
      "doi": "10.1145/1753846.1754078"
    },
    {
      "text": "Maniu, S., O'Hare, N., Aiello, L., Chiarandini, L., and Jaimes, A. Search behaviour on photo sharing platforms. In ICME 2013 (2013), 1--6.",
      "doi": ""
    },
    {
      "text": "Ozmutlu, S., Spink, A., and Ozmutlu, H. C. Multimedia web searching trends: 1997--2001. IPM 39, 4 (2003), 611--621.  ",
      "doi": "10.1016/S0306-4573%2802%2900038-9"
    },
    {
      "text": "Panofsky, E. Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Harper & Row, 1972.",
      "doi": ""
    },
    {
      "text": "Pu, H.-T. A comparative analysis of web image and textual queries. OIR 29, 5 (2005), 457--467.",
      "doi": ""
    },
    {
      "text": "Shatford, S. Analyzing the subject of a picture: a theoretical approach. CCQ 6, 3 (1986), 39--62.",
      "doi": ""
    },
    {
      "text": "Smith, G., Brien, C., and Ashman, H. Evaluating implicit judgments from image search clickthrough data. JASIST 63, 12 (Dec. 2012), 2451--2462.  ",
      "doi": "10.1002/asi.22742"
    },
    {
      "text": "Tjondronegoro, D., Spink, A., and Jansen, B. J. A study and comparison of multimedia Web searching: 1997--2006. JASIST 60 (2009), 1756--1768.  ",
      "doi": "10.5555/1598884.1598887"
    },
    {
      "text": "Tsikrika, T., and Diou, C. Multi-evidence user group discovery in professional image search. In ECIR 2014, Springer (2014), 693--699.  ",
      "doi": "10.5555/2964060.2964119"
    }
  ]
}