{
  "doi": "10.1145/2702123.2702333",
  "title": "LeviPath: Modular Acoustic Levitation for 3D Path Visualisations",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "309-312",
  "year": 2015,
  "badges": [],
  "abstract": "LeviPath is a modular system to levitate objects across 3D paths. It consists of two opposed arrays of transducers that create a standing wave capable of suspending objects in mid-air. To control the standing wave, the system employs a novel algorithm based on combining basic patterns of movement. Our approach allows the control of multiple beads simultaneously along different 3D paths. Due to the patterns and the use of only two opposed arrays, the system is modular and can scale its interaction space by joining several LeviPaths. In this paper, we describe the hardware architecture, the basic patterns of movement and how to combine them to produce 3D path visualisations.",
  "authors": [
    {
      "name": "Themis Omirou",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702913",
      "orcid": "missing"
    },
    {
      "name": "Asier Marzo",
      "institution": "Public University of Navarre & University of Bristol (UK), Pamplona, Spain",
      "img": "/do/10.1145/contrib-81549130456/rel-imgonly/outside.jpg",
      "acmid": "81549130456",
      "orcid": "missing"
    },
    {
      "name": "Sue Ann Seah",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558018556",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Brandt, H. Levitation in Physics, Science, New Series, Vol. 243, No. 4889 (Jan. 20, 1989), pp. 349--355.",
      "doi": ""
    },
    {
      "text": "Courtney, C. R., Ong, C. K., Drinkwater, B. W., Bernassau, A. L., Wilcox, P. D. and Cumming, D. R. S. Manipulation of microparticles using phase-controllable ultrasonic standing waves, The Journal of the Acoustical Society of America, 128, EL195-EL199 (2010).",
      "doi": ""
    },
    {
      "text": "Follmer, S., Leithinger, D., Olwal, A., Hogge, A and Ishii, H. inFORM: dynamic physical affordances and constraints through shape and object actuation. UIST'13, 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Foresti, D., Nabavi, M., Klingauf, M., Ferrari, A. and Poulikakos, D. Acoustophoretic contactless transport and handling of matter in air. Proceedings of the National Academy of Sciences 110, 31 (2013), 12549--12554.",
      "doi": ""
    },
    {
      "text": "Jansen, Y., Dragicevic, P. and Fekete, J.D. Evaluating the efficiency of physical visualizations. SIGCHI, CHI '13, ACM (NY, USA, 2013), 2593--2602.  ",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Lee, J., Post, R. and Ishii, H. 2011. ZeroN: mid-air tangible interaction enabled by computer controlled magnetic levitation. ACM UIST '11. (2011) NY, USA  ",
      "doi": "10.1145/2047196.2047239"
    },
    {
      "text": "Ochiai, Y., Hoshi, T. and Rekimoto, J. Pixie dust: graphics generated by levitated and animated objects in computational acoustic-potential field. ACM Transactions on Graphics (TOG) 33, 4 (2014), 85.  ",
      "doi": "10.1145/2601097.2601118"
    },
    {
      "text": "Moere, A.V. Beyond the tyranny of the pixel: Exploring the physicality of information visualization. In Information Visualisation. IV '08. (July 2008), 469--47.  ",
      "doi": "10.1109/IV.2008.84"
    },
    {
      "text": "Reznik, D., Moshkovich, E. and Canny, J. Building a universal planar manipulator. In Distributed Manipulation. (2000), (pp. 147--171). Springer US.",
      "doi": ""
    },
    {
      "text": "Seah, S., Drinkwater, B., Carter, T., Malkin, R., and Subramanian, S.. \"Correspondence: Dexterous ultrasonic levitation of millimeter-sized objects in air.\" IEEE TUFFC 61, no. 7 (2014): 1233--1236.",
      "doi": ""
    }
  ]
}