{
  "doi": "10.1145/2702123.2702408",
  "title": "Informing and Improving Retirement Saving Performance using Behavioral Economics Theory-driven User Interfaces",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "917-920",
  "year": 2015,
  "badges": [],
  "abstract": "Can human-computer interaction help people make informed and effective decisions about their retirement savings? We applied the behavioral economic theories of endowment effect and loss aversion to the design of novel retirement saving user interfaces. To examine effectiveness, we conducted an experiment in which 487 participants were exposed to one of three experimental user interface designs of a retirement saving simulator, representing endowment effect, loss aversion and control. Users made 34 yearly asset allocation decisions. We found that designs informed by the endowment effect and loss aversion theories and which communicated to savers the long-term implications of their asset allocation choices, led users to adjust their behavior, make larger and more frequent asset allocation changes, and achieve their saving goals more effectively.",
  "authors": [
    {
      "name": "Junius Gunaratne",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100658274",
      "orcid": "missing"
    },
    {
      "name": "Oded Nov",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339520089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Armstrong, M. and Murlis, H., Reward Management. 2007.",
      "doi": ""
    },
    {
      "text": "Sec. and Exch. Comm. Invest Wisely. 2014.",
      "doi": ""
    },
    {
      "text": "Cramer, M. and Hayes, G. R., \"The digital economy,\" Proc. Interaction Design and Children, 2013.",
      "doi": ""
    },
    {
      "text": "Dougherty, C. (2013) Retirement Savings Accounts Draw U.S. Consumer Bureau Attention. Bloomberg.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J., Persuasive Technology, 2002.",
      "doi": "10.5555/640634"
    },
    {
      "text": "Froehlich, J., Findlater, L., Ostergren, et al., The design and evaluation of prototype eco-feedback displays for fixture-level water usage data. Proc. CHI 2012.  ",
      "doi": "10.1145/2207676.2208397"
    },
    {
      "text": "Fryer, R., Levitt, S., et al., Enhancing the Efficacy of Teacher Incentives Through Loss Aversion. NBER, 2012.",
      "doi": ""
    },
    {
      "text": "Heath, C., Larrick, R., and Wu, G., Goals as reference points.Cognitive psychology, 38, 79--109, 1999.",
      "doi": ""
    },
    {
      "text": "Helman, R., Adams, N., et al., Retirement Confidence Survey. Employee Benefit Research Institute. 2014.",
      "doi": ""
    },
    {
      "text": "Kahneman, D., Knetsch, J., and Thaler, R., Anomalies. J. of Econ. Perspectives, 5, 193--206, 1991.",
      "doi": ""
    },
    {
      "text": "Kahneman, D. and Tversky, A., Prospect Theory. Econometrica, 47, 263--291, 1979.",
      "doi": ""
    },
    {
      "text": "Kaye, J., McCuistion, M., Gulotta, R., & Shamma, D., Money talks: tracking personal finances. Proc. CHI 2014.  ",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Lee, M., Kiesler, S., and Forlizzi, J., Mining behavioral economics to design persuasive technology for healthy choices. Proc. CHI 2011.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Matson, B. and Hardy, M. R., Data Driven Investing: Professional Edition: Data Driven Publishing , 2004.",
      "doi": ""
    },
    {
      "text": "Merton, R., The Crisis in Retirement Planning,\" Harvard Business Review. 92, 42--50, 2014.",
      "doi": ""
    },
    {
      "text": "Odean, T., Are Investors Reluctant to Realize Their Losses? J. of Finance, LIII, 1775--1798, 1998.",
      "doi": ""
    },
    {
      "text": "Thaler, R. and Benartzi, S., Save More Tomorrow. Journal of Political Economy, 112, pp. S164--S187, 2004.",
      "doi": ""
    },
    {
      "text": "Vines, J., Dunphy, P. and Monk, A., Pay or delay: the role of technology when managing a low income CHI 2014.  ",
      "doi": "10.1145/2556288.2556961"
    },
    {
      "text": "Yun, R., Scupelli, P., et al., Sustainability in the workplace. Proc. Persuasive Technology 2013. 2015 2020 2025 2030 2035 2040 2045 0.450.550.650.75 StockPercent Endowment Effect Loss Aversion Control  ",
      "doi": "10.1007/978-3-642-37157-8_30"
    }
  ]
}