{
  "doi": "10.1145/2702123.2702137",
  "title": "Your Money's No Good Here: The Elimination of Cash Payment on London Buses",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "907-916",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As digital payments become increasingly important features of economic exchange, traditional forms of payment such as cash are becoming phased out in certain settings. We study one such context-the elimination of cash payment on London buses in July 2014. We conducted ethnographic fieldwork, interviews with drivers and collected online and social media comments before, during and shortly after the introduction of cashless fares. We explore how drivers and passengers were fearful of the change due in part to a lack of information and communication, the anticipation of negative effects on vulnerable passengers and a compromise in freedom, flexibility and surveillance. We highlight the ways cashless payments can alter the social function of money, create new forms of work for drivers and passengers, and if not carefully introduced can cause emotional stress and fears of state surveillance and control.",
  "authors": [
    {
      "name": "Gary Pritchard",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556719056",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Alexander, V. D., Thomas, H., Cronin, A. Fielding, J. and Moran-Ellis, J. 'Mixed methods'. In N. Gilbert (ed.) Researching Social Life (3rd edn). London, Sage, 2008.",
      "doi": ""
    },
    {
      "text": "Bell, C. A note on participant observation. Sociology, 3, 417--418.",
      "doi": ""
    },
    {
      "text": "BBC News. Oyster data is 'new police tool'. http://news.bbc.co.uk/1/hi/england/london/4800490.stm",
      "doi": ""
    },
    {
      "text": "Brewer, J., Mainwaring, S., and Dourish, P. Aesthetic journeys. In: Proc. DIS '08, ACM, 333--341.  ",
      "doi": "10.1145/1394445.1394481"
    },
    {
      "text": "Collier, B., and Hampshire, R. Sending mixed signals: Multilevel reputation effects in peer-to-peer lending markets. In: Proc. CSCW '10, ACM, 197--206.  ",
      "doi": "10.1145/1718918.1718955"
    },
    {
      "text": "Collins, P. Black Feminist Thought Knowledge, Consciousness, and the Politics of Empowerment. New York, Routledge, 1990.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Mortier, R., Rodden, T., and Tolmie, P. Unremarkable computing: The home network as a part of everyday life. In: Proc. DIS '12, ACM, 554--563.  ",
      "doi": "10.1145/2317956.2318039"
    },
    {
      "text": "De Hert, P., Gutworth, S., Moscibroda, A., Wright, D., and Fuster, G. Legal safeguards for privacy and data protection in ambient intelligence. Pers Ubi Comp, 13 (2009), 435--444  ",
      "doi": "10.1007/s00779-008-0211-6"
    },
    {
      "text": "Deren, S., Oliver-Verez, D., Finlinson, A. et al. Integrating qualitative and quantitative methods: comparing HIV-related risk behaviors among Puerto Rican drug users in Puerto Rico and New York. Substance Use and Misuse, 38, 1, 1--24.",
      "doi": ""
    },
    {
      "text": "Edwards, W., Newman, M., and Poole, E. The infrastructure problem in HCI. In: Proc. CHI '10, ACM, 423--432.  ",
      "doi": "10.1145/1753326.1753390"
    },
    {
      "text": "Glaser, B. and Strauss, A. The discovery of grounded theory: strategies for qualitative research. Chicago.: Aldine, 1967.",
      "doi": ""
    },
    {
      "text": "Glassner, B. The culture of feat: Why americans are afraid of the wrong things. Basic Books, New York, 1999.",
      "doi": ""
    },
    {
      "text": "Garcia, F., de Koning Gans, G., Muijrers, R., et al. Dismantling MIFARE Classic. In: Proc. ESORICS '08, Springer, 97--114.  ",
      "doi": "10.1007/978-3-540-88313-5_7"
    },
    {
      "text": "Gupta, A. and Ferguson, J. Discipline and practice: \"the field\" as site, method, and location in anthropology. In: A. Gupta and J. Ferguson (eds.) Anthropological Locations: Boundaries and Grounds of a Field Science. Berkley, University of California Press, 1997.",
      "doi": ""
    },
    {
      "text": "Hochschild, A. The Managed Heart. Berkley, CA: University of California Press, 1983.",
      "doi": ""
    },
    {
      "text": "Lathia, N., and Capra, L. How smart is your smartcard? Measuring travel behaviours, perceptions, and incentives. In: Proc. UbiComp 11, ACM, 291--300.  ",
      "doi": "10.1145/2030112.2030152"
    },
    {
      "text": "Kaye, J. Understanding Self-reported Password Sharing Strategies. In: Proc. CHI '11, ACM, 2619--2622.  ",
      "doi": "10.1145/1978942.1979324"
    },
    {
      "text": "Kaye, J., McCuiston, M., Gulotta, R., and Shamma, D. Money talks: Tracking personal finances. In: Proc. CHI '14, ACM, 521--530.  ",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Kumar, D., Martin, D., and O'Neill, J. The times they are a-changin': Mobile payments in India. In: Proc. CHI '11, ACM (2011), 1413--1422.  ",
      "doi": "10.1145/1978942.1979150"
    },
    {
      "text": "Mas, I. and Morawczynski, O. Designing mobile money services: Lessons from M-PESA. Innovations, 4 (2), Springer (2009), 77--91.",
      "doi": ""
    },
    {
      "text": "Mason, J. 2006. Mixing methods in a qualitatively driven way. Qualitative Research, 6, 1, 9--25.",
      "doi": ""
    },
    {
      "text": "Mastercard (2013) Cashless Journey: The Global Journey from Cash to Cashless. Cashless Journey Whitepaper. http://tinyurl.com/pfy5g4g",
      "doi": ""
    },
    {
      "text": "Marx, K. Early writings, ed. T.B. Bottomore. New York, McGraw-Hill, 1963.",
      "doi": ""
    },
    {
      "text": "Phillips, S. The Invisible Culture: Communication in Classroom and Community in Warm Spring Reservation. Thesis (PhD). University of Pennsylvania, 1975.",
      "doi": ""
    },
    {
      "text": "Poole, E., Le Dantec, C, Eagen, J., and Edwards, W. Reflecting on the invisible: Understanding end-user perceptions of ubiquitous computing. In: Proc. UbiComp '08, ACM, 192--201.  ",
      "doi": "10.1145/1409635.1409662"
    },
    {
      "text": "Pritchard, G., Vines, J., Briggs, P., et al. Digitally driven: how location based services impact the work practices of London bus drivers. In: Proc. CHI '14, ACM, 3617--3626.  ",
      "doi": "10.1145/2556288.2557156"
    },
    {
      "text": "Pritchard, G., Briggs, P., Vines, J., and Olivier, P. How (not) to drive a London bus: Measuring performance in a mobile and remote workplace. In: Proc. CHI '15, ACM.  ",
      "doi": "10.1145/2702123.2702307"
    },
    {
      "text": "Rafaeli, A., and Sutton, R. The expression of emotion in organizational life. In: Cummings L., and Staw, B. (Eds.), Research in organizational behavior, 1--42",
      "doi": ""
    },
    {
      "text": "Schensul, S., Schensul, J. and LeCompte, M. Essential Ethnographic Methods: Observations, Interviews, and Questionnaires. Walnut Creek, AltaMira Press, 1999.",
      "doi": ""
    },
    {
      "text": "Schwarz, J., Mankoff, J., and Matthews, H. Reflections of everyday activities in spending data. In: Proc. CHI '09, ACM, 1737--1740.  ",
      "doi": "10.1145/1518701.1518968"
    },
    {
      "text": "Singh, S. Marriage Money: The social shaping of money in marriage & banking. St. Leonards, Allen & Unwin, 1998.",
      "doi": ""
    },
    {
      "text": "Simmel, G. The Philosophy of Money. Trans., ed. T. Bottomore. Boston, Routledge & Kegan Paul, 1978.",
      "doi": ""
    },
    {
      "text": "Slosar, J. Ogre, bandit, and operating employee: The problems and adaptations of the metropolitan bus driver. Journal of Contemporary Ethnography, 1, 339--362.",
      "doi": ""
    },
    {
      "text": "Tirachini, A. Bus dwell time: the effect of different fare collection systems, bus floor level and age of passengers. Transportmetrica A: Transport Science, 9:1, 28--49.",
      "doi": ""
    },
    {
      "text": "Transport for London. Going Cashless on TfL Bus Services: Consultation Report. London, TfL, 2014.",
      "doi": ""
    },
    {
      "text": "Vines, J., Dunphy, P., Blythe, M., et al. The joy of cheques: Trust, paper and eighty sometings. In: Proc. CSCW '12, ACM, 147--156.  ",
      "doi": "10.1145/2145204.2145229"
    },
    {
      "text": "Vines, J., Dunphy, P., and Monk, A. Pay or delay: The role of technology when managing a low income. In: Proc. CHI '14, ACM, 501--510.  ",
      "doi": "10.1145/2556288.2556961"
    },
    {
      "text": "Whyte, W. Street Corner Society. Chicago, University of Chicago Press, 1995.",
      "doi": ""
    },
    {
      "text": "Wolf, D. High risk methodology: reflections on leaving an outlaw society. In W. Shaffir and R. Stebbins (eds.) Experiencing Fieldwork: an Inside View of Qualitative Research. Newbury Park, Sage, 1991.",
      "doi": ""
    },
    {
      "text": "Xynou, M. Oyster, octopus and metro cards: What happens to our data? http://tinyurl.com/9ror9yc",
      "doi": ""
    }
  ]
}