{
  "doi": "10.1145/2702123.2702262",
  "title": "(s|qu)eries: Visual Regular Expressions for Querying and Exploring Event Sequences",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2683-2692",
  "year": 2015,
  "badges": [],
  "abstract": "Many different domains collect event sequence data and rely on finding and analyzing patterns within it to gain meaningful insights. Current systems that support such queries either provide limited expressiveness, hinder exploratory workflows or present interaction and visualization models which do not scale well to large and multi-faceted data sets. In this paper we present (s|qu)eries (pronounced \"Squeries\"), a visual query interface for creating queries on sequences (series) of data, based on regular expressions. (s|qu)eries is a touch-based system that exposes the full expressive power of regular expressions in an approachable way and interleaves query specification with result visualizations. Being able to visually investigate the results of different query-parts supports debugging and encourages iterative query-building as well as exploratory work-flows. We validate our design and implementation through a set of informal interviews with data scientists that analyze event sequences on a daily basis.",
  "tags": [
    "event sequences",
    "visual analytics",
    "visual query languages",
    "gesture interfaces",
    "query interfaces"
  ],
  "authors": [
    {
      "name": "Emanuel Zgraggen",
      "institution": "Microsoft Reseaerch & Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658694296",
      "orcid": "missing"
    },
    {
      "name": "Steven M. Drucker",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090466",
      "orcid": "0000-0002-5022-9343"
    },
    {
      "name": "Danyel Fisher",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81309487122/rel-imgonly/fn5a3561-copy.jpg",
      "acmid": "81309487122",
      "orcid": "missing"
    },
    {
      "name": "Robert DeLine",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350602833",
      "orcid": "0000-0001-8885-8367"
    }
  ],
  "references": [
    {
      "text": "Agrawal, R., and Srikant, R. Mining sequential patterns. In Data Engineering, 1995. Proceedings of the Eleventh International Conference on, IEEE (1995), 3--14. ",
      "doi": "10.5555/645480.655281"
    },
    {
      "text": "Allen, J. F. Maintaining knowledge about temporal intervals. Communications of the ACM 26, 11 (1983), 832--843.  ",
      "doi": "10.1145/182.358434"
    },
    {
      "text": "Bade, R., Schlechtweg, S., and Miksch, S. Connecting time-oriented data and information to a coherent interactive visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2004), 105--112.  ",
      "doi": "10.1145/985692.985706"
    },
    {
      "text": "Chittaro, L., and Combi, C. Visualizing queries on databases of temporal histories: new metaphors and their evaluation. Data & Knowledge Engineering 44, 2 (2003), 239--264.  ",
      "doi": "10.1016/S0169-023X%2802%2900137-4"
    },
    {
      "text": "Drucker, S. M., Fisher, D., Sadana, R., Herron, J., et al. Touchviz: a case study comparing two interfaces for data analytics on tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2013), 2301--2310.  ",
      "doi": "10.1145/2470654.2481318"
    },
    {
      "text": "Elmqvist, N., Moere, A. V., Jetter, H.-C., Cernea, D., Reiterer, H., and Jankun-Kelly, T. Fluid interaction for information visualization. Information Visualization (2011), 1473871611413180.  ",
      "doi": "10.1177/1473871611413180"
    },
    {
      "text": "Fails, J. A., Karlson, A., Shahamat, L., and Shneiderman, B. A visual interface for multivariate temporal data: Finding patterns of events across multiple histories. In Visual Analytics Science And Technology, 2006 IEEE Symposium On, IEEE (2006), 167--174.",
      "doi": ""
    },
    {
      "text": "Fourney, A., Mann, R., and Terry, M. Characterizing the usability of interactive applications through query log analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2011), 1817--1826.  ",
      "doi": "10.1145/1978942.1979205"
    },
    {
      "text": "Harrison, B. L., Owen, R., and Baecker, R. M. Timelines: an interactive system for the collection and visualization of temporal data. In Graphics Interface, Citeseer (1994), 141--141.",
      "doi": ""
    },
    {
      "text": "Jensen, C. S., and Snodgrass, R. T. Temporal data management. Knowledge and Data Engineering, IEEE Transactions on 11, 1 (1999), 36--44.  ",
      "doi": "10.1109/69.755613"
    },
    {
      "text": "Jin, J., and Szekely, P. Querymarvel: a visual query language for temporal patterns using comic strips. In Visual Languages and Human-Centric Computing, 2009. VL/HCC 2009. IEEE Symposium on, IEEE (2009), 207--214.  ",
      "doi": "10.1109/VLHCC.2009.5295262"
    },
    {
      "text": "Jin, J., and Szekely, P. Interactive querying of temporal data using a comic strip metaphor. In Visual Analytics Science and Technology (VAST), 2010 IEEE Symposium on, IEEE (2010), 163--170.",
      "doi": ""
    },
    {
      "text": "Karam, G. M. Visualization using timelines. In Proceedings of the 1994 ACM SIGSOFT international symposium on Software testing and analysis, ACM (1994), 125--137.  ",
      "doi": "10.1145/186258.187157"
    },
    {
      "text": "Kleene, S. C. Representation of events in nerve nets and finite automata. Tech. rep., DTIC Document, 1951.",
      "doi": ""
    },
    {
      "text": "Lam, H., Russell, D., Tang, D., and Munzner, T. Session viewer: Visual exploratory analysis of web session logs. In Visual Analytics Science and Technology, 2007. VAST 2007. IEEE Symposium on (Oct 2007), 147--154.  ",
      "doi": "10.1109/VAST.2007.4389008"
    },
    {
      "text": "Lan, R., Lee, H., Fong, A., Monroe, M., Plaisant, C., and Shneiderman, B. Temporal search and replace: An interactive tool for the analysis of temporal event sequences. HCIL, University of Maryland, College Park, Maryland, Tech. Rep. HCIL-2013-TBD (2013).",
      "doi": ""
    },
    {
      "text": "Lee, B., Isenberg, P., Riche, N. H., and Carpendale, S. Beyond mouse and keyboard: Expanding design considerations for information visualization interactions. Visualization and Computer Graphics, IEEE Transactions on 18, 12 (2012), 2689--2698.  ",
      "doi": "10.1109/TVCG.2012.204"
    },
    {
      "text": "Monroe, M., Lan, R., Del Olmo, J. M., Shneiderman, B., Plaisant, C., and Millstein, J. The intervals and absences of temporal query. In Proceedings of the 2013 Annual Conference Human Factors in Computing Systems (CHI13) (2013).",
      "doi": ""
    },
    {
      "text": "Monroe, M., Wongsuphasawat, K., Plaisant, C., Shneiderman, B., Millstein, J., and Gold, S. Exploring point and interval event patterns: Display methods and interactive visual query. Tech. rep., Citeseer, 2012.",
      "doi": ""
    },
    {
      "text": "Plaisant, C., Milash, B., Rose, A., Widoff, S., and Shneiderman, B. Lifelines: visualizing personal histories. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (1996), 221--227.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Plaisant, C., Mushlin, R., Snyder, A., Li, J., Heller, D., and Shneiderman, B. Lifelines: using visualization to enhance navigation and analysis of patient records. In Proceedings of the AMIA Symposium, American Medical Informatics Association (1998), 76.",
      "doi": ""
    },
    {
      "text": "Riehmann, P., Hanfler, M., and Froehlich, B. Interactive sankey diagrams. In Information Visualization, 2005. INFOVIS 2005. IEEE Symposium on, IEEE (2005), 233--240.  ",
      "doi": "10.1109/INFOVIS.2005.21"
    },
    {
      "text": "Shneiderman, B. 1.1 direct manipulation: a step beyond programming languages. Sparks of innovation in human-computer interaction 17 (1993).",
      "doi": ""
    },
    {
      "text": "Snodgrass, R. T., Ahn, I., Ariav, G., Batory, D. S., Clifford, J., Dyreson, C. E., Elmasri, R., Grandi, F., Jensen, C. S., Käfer, W., et al. Tsql2 language specification. Sigmod Record 23, 1 (1994), 65--86.  ",
      "doi": "10.1145/181550.181562"
    },
    {
      "text": "Srikant, R., and Agrawal, R. Mining sequential patterns: Generalizations and performance improvements. Springer, 1996.",
      "doi": ""
    },
    {
      "text": "Wang, T. D., Plaisant, C., Quinn, A. J., Stanchak, R., Murphy, S., and Shneiderman, B. Aligning temporal data by sentinel events: discovering patterns in electronic health records. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2008), 457--466.  ",
      "doi": "10.1145/1357054.1357129"
    },
    {
      "text": "Wongsuphasawat, K., Guerra Gómez, J. A., Plaisant, C., Wang, T. D., Taieb-Maimon, M., and Shneiderman, B. Lifeflow: visualizing an overview of event sequences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2011), 1747--1756.  ",
      "doi": "10.1145/1978942.1979196"
    }
  ]
}