{
  "doi": "10.1145/2702123.2702320",
  "title": "From Care Plans to Care Coordination: Opportunities for Computer Support of Teamwork in Complex Healthcare",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1419-1428",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Children with complex health conditions require care from a large, diverse team of caregivers that includes multiple types of medical professionals, parents and community support organizations. Coordination of their outpatient care, essential for good outcomes, presents major challenges. Extensive healthcare research has shown that the use of integrated, team-based care plans improves care coordination, but such plans are rarely deployed in practice. This paper reports on a study of care teams treating children with complex conditions at a major university tertiary care center. This study investigated barriers to plan implementation and resultant care coordination problems. It revealed the complex nature of teamwork in complex care, which poses challenges to team coordination that extend beyond those identified in prior work and handled by existing coordination systems. The paper builds on a computational teamwork theory to identify opportunities for technology to support increased plan-based complex-care coordination and to propose design approaches for systems that enable and enhance such coordination.",
  "authors": [
    {
      "name": "Ofra Amir",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502722610",
      "orcid": "missing"
    },
    {
      "name": "Barbara J. Grosz",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100521266",
      "orcid": "missing"
    },
    {
      "name": "Krzysztof Z. Gajos",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    },
    {
      "name": "Sonja M. Swenson",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658698162",
      "orcid": "missing"
    },
    {
      "name": "Lee M. Sanders",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704704",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abraham, J., and Reddy, M. C. Moving patients around: a field study of coordination between clinical and non-clinical staff in hospitals. In Proc. CSCW '08, ACM (2008), 225--228.  ",
      "doi": "10.1145/1460563.1460598"
    },
    {
      "text": "Adams, S., Cohen, E., Mahant, S., Friedman, J. N., MacCulloch, R., and Nicholas, D. B. Exploring the usefulness of comprehensive care plans for children with medical complexity (cmc): a qualitative study. BMC Pediatrics 13, 10 (2014).",
      "doi": ""
    },
    {
      "text": "Afantenos, S., Karkaletsis, V., and Stamatopoulos, P. Summarization from medical documents: a survey. Artificial intelligence in medicine 33, 2 (2005), 157--177.  ",
      "doi": "10.1016/j.artmed.2004.07.017"
    },
    {
      "text": "Amir, O., Grosz, B. J., Law, E., and Stern, R. Collaborative health care plan support. In Proc. AAMAS '13, AAMAS (2013), 793--796. ",
      "doi": "10.5555/2484920.2485045"
    },
    {
      "text": "Babaian, T., Grosz, B. J., and Shieber, S. M. A writer's collaborative assistant. In Proc. IUI '02, ACM (2002), 7--14.  ",
      "doi": "10.1145/502716.502722"
    },
    {
      "text": "Ballegaard, S. A., Hansen, T. R., and Kyng, M. Healthcare in everyday life: designing healthcare services for daily life. In Proc. CHI '08, ACM (2008), 1807--1816.  ",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Bardram, J. E. Temporal coordination on time and coordination of collaborativeactivities at a surgical department. CSCW 9, 2 (2000), 157--187.  ",
      "doi": "10.1023/A%3A1008748724225"
    },
    {
      "text": "Bardram, J. E., and Hansen, T. R. Why the plan doesn't hold: a study of situated planning, articulation and coordination work in a surgical ward. In Proc. CSCW '10, ACM (2010), 331--340.  ",
      "doi": "10.1145/1718918.1718977"
    },
    {
      "text": "Barry, M. J., and Edgman-Levitan, S. Shared decision makingthe pinnacle of patient-centered care. New England Journal of Medicine 366, 9 (2012), 780--781.",
      "doi": ""
    },
    {
      "text": "Bates, D. W. Getting in step: electronic health records and their role in care coordination. Journal of general internal medicine 25, 3 (2010), 174--176.",
      "doi": ""
    },
    {
      "text": "Beyer, H., and Holtzblatt, K. Contextual design. interactions 6, 1 (1999), 32--42.  ",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Bickmore, T. W., Pfeifer, L. M., and Paasche-Orlow, M. K. Using computer agents to explain medical documents to patients with low health literacy. Patient Education and Counseling 75, 3 (2009), 315--320.",
      "doi": ""
    },
    {
      "text": "Carman, K. L., Dardess, P., Maurer, M., Sofaer, S., Adams, K., Bechtel, C., and Sweeney, J. Patient and family engagement: a framework for understanding the elements and developing interventions and policies. Health Affairs 32, 2 (2013), 223--231.",
      "doi": ""
    },
    {
      "text": "Coleman, K., Austin, B. T., Brach, C., and Wagner, E. H. Evidence on the chronic care model in the new millennium. Health affairs 28, 1 (2009), 75--85.",
      "doi": ""
    },
    {
      "text": "Fiks, A., Mayne, S., Localio, A., Alessandrini, E., and Guevara, J. Shared decision-making and health care expenditures among children with special health care needs. Pediatrics 129, 1 (2012), 99--107.",
      "doi": ""
    },
    {
      "text": "Fitzpatrick, G., and Ellingsen, G. A review of 25 years of cscw research in healthcare: Contributions, challenges and future agendas. CSCW 22, 4--6 (2013), 609--665.  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Gal, Y., Reddy, S., Shieber, S. M., Rubin, A., and Grosz, B. J. Plan recognition in exploratory domains. Artif. Intell. 176, 1 (Jan. 2012), 2270--2290.  ",
      "doi": "10.1016/j.artint.2011.09.002"
    },
    {
      "text": "Grosz, B. J., and Hunsberger, L. The dynamics of intention in collaborative activity. Cognitive Systems Research 7, 2 (2006), 259--272.  ",
      "doi": "10.1016/j.cogsys.2005.11.006"
    },
    {
      "text": "Grosz, B. J., and Kraus, S. Collaborative plans for complex group action. Artif. Intell. 86, 2 (1996), pp. 269--357.  ",
      "doi": "10.1016/0004-3702%2895%2900103-4"
    },
    {
      "text": "Hinds, P., and McGrath, C. Structures that work: social structure, work structure and coordination ease in geographically distributed teams. In Proc. CSCW '06, ACM (2006), 343--352.  ",
      "doi": "10.1145/1180875.1180928"
    },
    {
      "text": "Horvitz, E., and Apacible, J. Learning and reasoning about interruption. In Proceedings of the 5th international conference on Multimodal interfaces, ACM (2003), pp. 20--27.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Hutchins, E. Cognition in the Wild, 8 ed. Bradford Books. University Press Group Limited, 1996.",
      "doi": ""
    },
    {
      "text": "Kientz, J. A., Hayes, G. R., Abowd, G. D., and Grinter, R. E. From the war room to the living room: decision support for home-based therapy teams. In Proc. CSCW '06, ACM (2006), pp. 209--218.  ",
      "doi": "10.1145/1180875.1180909"
    },
    {
      "text": "Klasnja, P., Civan Hartzler, A., Unruh, K. T., and Pratt, W. Blowing in the wind: unanchored patient information work during cancer care. In Proc. CHI '10, ACM (2010), pp. 193--202.  ",
      "doi": "10.1145/1753326.1753355"
    },
    {
      "text": "Law, E., Grosz, B. J., Sanders, L., and Fischer, S. H. SimplyPut: A Crowdware System for Improving Health Literacy. In Proc. HAIDM Workshop, AAMAS (2013).",
      "doi": ""
    },
    {
      "text": "Leape, L. Order From Chaos: Accelerating Care Integration. National Patient Safety Foundation, 2012.",
      "doi": ""
    },
    {
      "text": "Levesque, H. J., Cohen, P. R., and Nunes, J. H. On acting together. SRI International Menlo Park, CA 94025--3493, 1990.",
      "doi": ""
    },
    {
      "text": "McAllister, J. W. Achieving a shared plan of care with children and youth with special health care needs, 2014.",
      "doi": ""
    },
    {
      "text": "OMalley, A. S., Grossman, J. M., Cohen, G. R., Kemper, N. M., and Pham, H. H. Are electronic medical records helpful for care coordination experiences of physician practices. Journal of general internal medicine 25, 3 (2010), pp. 177--185.",
      "doi": ""
    },
    {
      "text": "Pinelle, D., and Gutwin, C. Loose coupling and healthcare organizations: deployment strategies for groupware. CSCW 15, 5--6 (2006), pp. 537--572.  ",
      "doi": "10.1007/s10606-006-9031-2"
    },
    {
      "text": "Quigley, L., Lacombe-Duncan, A., Adams, S., Hepburn, C. M., and Cohen, E. A qualitative analysis of information sharing for children with medical complexity within and across health care organizations. BMC Health Services Research 14, 283 (2014).",
      "doi": ""
    },
    {
      "text": "Reddy, M. C., and Spence, P. R. Collaborative information seeking: A field study of a multidisciplinary patient care team. Information processing & management 44, 1 (2008), 242--255.  ",
      "doi": "10.1016/j.ipm.2006.12.003"
    },
    {
      "text": "Rich, C., Sidner, C. L., and Lesh, N. Collagen: Applying collaborative discourse theory to human-computer interaction.(articles). AI magazine 22, 4 (2001). ",
      "doi": "10.5555/567363.567364"
    },
    {
      "text": "Sarcevic, A., Palen, L. A., and Burd, R. S. Coordinating time-critical work with role-tagging. In Proc. CSCW '11, ACM (2011), 465--474.  ",
      "doi": "10.1145/1958824.1958896"
    },
    {
      "text": "Schulman-Green, D. J., Naik, A. D., Bradley, E. H., McCorkle, R., and Bogardus, S. T. Goal setting as a shared decision making strategy among clinicians and their older patients. Patient education and counseling 63, 1 (2006), 145--151.",
      "doi": ""
    },
    {
      "text": "Sonenberg, E., Tidhar, G., Werner, E., Kinny, D., Ljungberg, M., and Rao, A. Planned team activity. Artificial Social Systems 890 (1992).",
      "doi": ""
    },
    {
      "text": "Stille, C. J., McLaughlin, T. J., Primack, W. A., Mazor, K. M., and Wasserman, R. C. Determinants and impact of generalist specialist communication about pediatric outpatient referrals. Pediatrics 118, 4 (2006), 1341--1349.",
      "doi": ""
    },
    {
      "text": "Strickland, B., McPherson, M., Weissman, G., Van Dyck, P., Huang, Z. J., and Newacheck, P. Access to the medical home: results of the national survey of children with special health care needs. Pediatrics 113, Supplement 4 (2004), 1485--1492.",
      "doi": ""
    },
    {
      "text": "Tambe, M. Agent architecture for flexible, practical teamwork. Proceedings of the National Conference on Artificial Intelligence (1997), 22--28. ",
      "doi": "10.5555/1867406.1867410"
    }
  ]
}