{
  "doi": "10.1145/2702123.2702533",
  "title": "Offline Strangers, Online Friends: Bridging Classroom Gender Segregation with WhatsApp",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3799-3808",
  "year": 2015,
  "badges": [],
  "abstract": "Mobile Instant Messaging (MIM) apps such as WhatsApp are heralding new communication behaviors amongst students in peri-urban India. From an ethnographic study of a co-ed engineering college, we describe and analyze the role of WhatsApp in both engendering and balancing the ripples caused by cross gender communication. Through in-depth interviews and immersive participant observations in both physical as well as digital spaces, we show how WhatsApp emerges as the backbone of student interactions in a gender segregated academic environment. In analyzing social conditions and identifying structural features of WhatsApp that led to its bottoms up appropriation, our study presents possibilities for educators and designers aiming to create technology enabled collaborative spaces between people otherwise hemmed in by social norms from reaching out to one another.",
  "tags": [
    "mobile instant messaging",
    "whatsapp",
    "indian youth",
    "cross gender communication"
  ],
  "authors": [
    {
      "name": "Preeti Mudliar",
      "institution": "Xerox Research Centre, India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500664728",
      "orcid": "missing"
    },
    {
      "name": "Nimmi Rangaswamy",
      "institution": "Xerox Research Centre, India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381609830",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abraham, L. Bhai-behen, true love, time pass, friendships and sexual partnerships among youth in an Indian metropolis. In An International Journal for Research, Intervention and Care, (2001). 337--353.",
      "doi": ""
    },
    {
      "text": "Ames, M.G. Managing mobile multitasking: The culture of iPhones on Stanford campus. In Proceedings of CSCW'13, ACM (2013), 1487--1498.  ",
      "doi": "10.1145/2441776.2441945"
    },
    {
      "text": "Chanana, K. Hinduism and female sexuality: social control and education of girls in India. In Sociological Bulletin, 50, (2001), 37--63.",
      "doi": ""
    },
    {
      "text": "Church, K. and de Oliveira, R. What's up with WhatsApp? Comparing mobile instant messaging behaviors with traditional SMS. In Proceedings of MobileHCI'13, ACM (2013), 352--361.  ",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Das, V. (1998). Femininity and the orientation to the body. In Socialization, Education and Women, Chanana, K, Ed. Orient Longman (1988), 193--207.",
      "doi": ""
    },
    {
      "text": "De Certeau, M. (1984) The Practice of Everyday Life, Berkeley: University of California Press.",
      "doi": ""
    },
    {
      "text": "Dube, L. Women and Kinship: Comparative Perspectiveson Gender in South and South-East Asia, United Nations University Press, (1988).",
      "doi": ""
    },
    {
      "text": "Grinter, R.E. and Palen, L. Instant messaging in teen life. In Proceedings of CSCW'02, ACM (2002), 21--30.  ",
      "doi": "10.1145/587078.587082"
    },
    {
      "text": "Grinter, R.E. and Eldridge, M. Wan2tlk: Everyday text messaging. In Proceedings of CHI'2003, ACM (2003), 441--448.  ",
      "doi": "10.1145/642611.642688"
    },
    {
      "text": "http://whatsapp.com",
      "doi": ""
    },
    {
      "text": "Ito, M. Mobile phones, Japanese youth, and the replacement of social contact. In Ling, R. and Pederson, P. (eds) In Mobile Communication and Renegotiation of the Public Sphere. Springer (2005), 131--148.",
      "doi": ""
    },
    {
      "text": "Nisbett, N. Friendship, consumption, morality: practising identity, negotiating hierarchy in middle-class Bangalore. In Journal of the Royal Anthropological Institute, 13, (2007) 935--950",
      "doi": ""
    },
    {
      "text": "O'Hara, K.,Massimi, M., Harper, R., Rubens, S., Morris, J. Everyday Dwelling with WhatsApp. In Proceedings of CSCW' 14, ACM Press (2014).  ",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Osella, C & Osella, F. Friendship and Flirting: MicroPolitics in Kerala, South India Author(s): The Journal of the Royal Anthropological Institute, 4, 2 (1998), 189--206",
      "doi": ""
    },
    {
      "text": "Rangaswamy, N and Cutrell, E. 'Re-Sourceful Networks: Notes from a Mobile Social Networking Platform in India', Pacific Affairs, Fall, 2012",
      "doi": ""
    },
    {
      "text": "Rogers, M. Modernity, 'authenticity', and ambivalence: subaltern masculinities on a South Indian college campus. Journal of the Royal Anthropological Institute 14, 79--95. (2008).",
      "doi": ""
    },
    {
      "text": "Strauss, A. and Corbin, J. Basics of qualitative research: Techniques and procedures for developing grounded theory. Thousand Oaks, CA: Sage Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Taylor, S.A. and Harper, R. Age-old Practices in the 'New World': A study of gift-giving between teenage mobile phone users. In Proceedings of CHI'02, ACM (2002), 439--446.  ",
      "doi": "10.1145/503376.503455"
    },
    {
      "text": "Walton, M., Hassreiter, S., Marsden, G., and Allen, S. Degrees of sharing: Proximate media sharing and messaging by young people in Khayelitsha. In Proceedings of MobileHCI'12, ACM (2012), 403--41.  ",
      "doi": "10.1145/2371574.2371636"
    }
  ]
}