{
  "doi": "10.1145/2702123.2702482",
  "title": "Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2913-2922",
  "year": 2015,
  "badges": [],
  "abstract": "We have conducted interviews with ten elite and recreational athletes to understand their experiences and engagement with endurance sport and personal and wearable sports technology. The athletes emphasized the experiential aspects of doing sports and the notion of feeling was repeatedly used to talk about their activities. Technology played both an instrumental role in measuring performance and feeding bio-data back to them, and an experiential role in supporting and enhancing the sport experience. To guide further interaction design research in the sports domain, we suggest two interrelated ways of looking at sports performances and experiences, firstly through the notion of a measured sense of performance, and secondly as a lived-sense of performance.",
  "authors": [
    {
      "name": "Jakob Tholander",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100187595",
      "orcid": "missing"
    },
    {
      "name": "Stina Nylander",
      "institution": "Mobile Life @ SICS, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502691503",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahtinen, A., Huuskonen, P. and Häkkilä, J., Let's All Get Up and Walk to the North Pole: Design and Evaluation of a Mobile Wellness Application. In proceedings of NordiCHI, (2010).  ",
      "doi": "10.1145/1868914.1868920"
    },
    {
      "text": "Ahtinen, A., Isomursu, M., Mukhtar, M., Mäntyjärvi, J., Häkkilä, J. and Blom, J., Designing Social Features for Mobile and Ubiquitous Wellness Applications. In proceedings of MUM, (2009), ACM Press.  ",
      "doi": "10.1145/1658550.1658562"
    },
    {
      "text": "Bial, D., Appelmann, T., Rukzio, E. and Schmidt, A., Improving Cyclists Training with Tactile Feedback on Feet. In proceedings of HAID, (2012), 41--50.  ",
      "doi": "10.1007/978-3-642-32796-4_5"
    },
    {
      "text": "Chi, E.H., Song, J. and Corbin, G., \"Killer App\" of Wearable Computing: Wireless Force Sensing Body Protectors for Martial Arts. In proceedings of UIST, (Santa Fe, NM, 2004), 277--285.  ",
      "doi": "10.1145/1029632.1029680"
    },
    {
      "text": "Consolvo, S., McDonald, D.W., Toscos, T., Chen, M.Y., Froehlich, D., Harrison, B., Klasnja, P., LaMarca, A., LeGrand, L., Libby, R., Smith, I. and Landay, J.A., Activity sensing in the wild: a field trial of ubifit garden. In proceedings of CHI, (2008), 1797--1806  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Curmi, F., Ferrario, M.A., Southern, J. and Whittle, J., HeartLink: Open Broadcast of Live Biometric Data to Social Networks. In proc of CHI, (2013), 1749--1758.  ",
      "doi": "10.1145/2470654.2466231"
    },
    {
      "text": "de Oliveira, R. and Oliver, N., TripleBeat: Enhancing Exercise performance with Persuasion. In proceedings of MobileHCI, (2008), 255--264.  ",
      "doi": "10.1145/1409240.1409268"
    },
    {
      "text": "Eriksson, M. and Bresin, R., Improving Running Mechanics by Use of Interactive Sonification. In proceedings of Interactive Sonification Workshop, (Stockholm, Sweden, 2010), 95--98.",
      "doi": ""
    },
    {
      "text": "Grimes, A. and Harper, R., Celebratory Technology: New Directions for Food Research in HCI. In proceedings of CHI, (2008), 467--476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Hassmén, P., Hassmén, N. and Plate, J. Idrottspsykologi. Natur & Kultur, 2003.",
      "doi": ""
    },
    {
      "text": "Hillerup Fogtmann, M., Grönbaek, K. and Kofod Ludvigsen, M., Interaction Technology for Collective and Psychomotor Training in Sports. In proc ACE, (2011).  ",
      "doi": "10.1145/2071423.2071440"
    },
    {
      "text": "Hämäläinen, P., Ilmonen, T., Höysniemi, J., Lindholm, M. and Nykänen, A., Martial Arts in Artificial Reality. In proceedings of CHI, (Portland, OR, 2005), 781--790.  ",
      "doi": "10.1145/1054972.1055081"
    },
    {
      "text": "Höök, K., Transferring qualities from horseback riding to design. In proceedings of NordiCHI, (2010), 226--235.  ",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Höök, K., Ståhl, A., Sundström, P. and Laaksolahti, J., Interactional Empowerment. In proceedings of CHI, (2008), ACM Press, 647--656.  ",
      "doi": "10.1145/1357054.1357157"
    },
    {
      "text": "Ishii, H., Wisneski, C., Orbanes, J., Chun, B. and Paradios, J., PingPongPlus: design of an athletictangible interface for computer-supported cooperative play. In proceedings of CHI, (1999), 394--401.  ",
      "doi": "10.1145/302979.303115"
    },
    {
      "text": "Leahu, L. and Sengers, P., Freaky: performing hybrid human-machine emotion. In proc DIS, (2014), 607--616.  ",
      "doi": "10.1145/2598510.2600879"
    },
    {
      "text": "Lim, Y.-K., Stolterman, E., Jung, H. and Donaldson, J., Interaction gestalt and the design of aesthetic interactions. In proceedings of CHI, (2007), 239--254  ",
      "doi": "10.1145/1314161.1314183"
    },
    {
      "text": "Loke, L. and Robertson, T. Studies of Dancers: Moving from Experience to Interaction Design. International Journal of Design, 4 (2). 39--54.",
      "doi": ""
    },
    {
      "text": "Ludvigsen, M., Hillerup Fogtmann, M. and Grönbaek, K., TacTowers: An Interactive Training Equipment for Elite Athletes. In proceedings of DIS, (2010), 412--415.  ",
      "doi": "10.1145/1858171.1858250"
    },
    {
      "text": "Mauriello, S., Gubbels, M. and Froehlich, J., Social fabric fitness: the design and evaluation of wearable Etextile displays to support group running. In proceedings of CHI, (Toronto, CA, 2014), ACM Press, 2833--2842.  ",
      "doi": "10.1145/2556288.2557299"
    },
    {
      "text": "Michahelles, F. and Schiele, B. Sensing and Monitoring Professional Skiers. IEEE Pervasive Comp, 2005 (julysept). 40--46.  ",
      "doi": "10.1109/MPRV.2005.66"
    },
    {
      "text": "Mueller, F., Agamanolis, S. and Picard, R.W., Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. In proceedings of CHI, (2003), 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Mueller, F., Vetere, F., Gibbs, M.R., Edge, D., Agamanolis, S. and Sheridan, J.G., Jogging over a distance between Europe and Australia. In proceedings of UIST, (New York, NY, 2010), 189--198.  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Nagargoje, A., Maybach, K. and Sokoler, T., Social Yoga Mats: Designing for Exercising / Socializing Synergy. In proceedings of TEI, (2012), 87--90.  ",
      "doi": "10.1145/2148131.2148151"
    },
    {
      "text": "Nenonen, V., Lindblad, A., Häkkinän, V., Laitinen, T., Jouhtio, M. and Hämäläinen, P., Using Heart Rate to Control an Interactive Game. In proceedings of CHI, (San Jose, CA, 2007), 853--856.  ",
      "doi": "10.1145/1240624.1240752"
    },
    {
      "text": "Normark, M. and Tholander, J., Performativity in Sustainable Interaction: The Case of Seasonal Grocery Shopping in EcoFriends. In proc CHI, (2014), 271--280.  ",
      "doi": "10.1145/2556288.2557318"
    },
    {
      "text": "Nylander, S., Jacobsson, M. and Tholander, J., RunRight; Real-time Visual and Audio Feedback on Running. In proceedings of CHI EA, (2014), 583--586.  ",
      "doi": "10.1145/2559206.2574806"
    },
    {
      "text": "Nylander, S., Kent, A. and Tholander, J., SwingSound Experiencing the Golf Swing through Sound. In proceedings of CHI EA, (2014), 443--446.  ",
      "doi": "10.1145/2559206.2574789"
    },
    {
      "text": "Nylander, S. and Tholander, J., Designing for movement - the case of sports. In proceedings of International workshop on Movement and Computing (MOCO), (2014), ACM Press, 130--135.  ",
      "doi": "10.1145/2617995.2618018"
    },
    {
      "text": "Pijnappel, S. and Mueller, F., 4 design themes for skateboarding. In proceedings CHI, (2013), 1271--1274  ",
      "doi": "10.1145/2470654.2466165"
    },
    {
      "text": "Rooksby, J., Rost, M., Morrison, A. and Chalmers, M., Personal Tracking as Lived Informatics. In proceedings of CHI, (Toronto, CA, 2014), ACM Press, 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Slovák, P., Janssen, J.H. and Fitzpatrick, G., Understanding Heart Rate Sharing: Towards Unpacking Physiosocial Space. In proc of CHI, (2012), 859--868.  ",
      "doi": "10.1145/2207676.2208526"
    },
    {
      "text": "Spelmezan, D., An Investigation into the Use of Tactile Instructions in Snowboarding. In proceedings of MobileHCI, (2012), 417--426.  ",
      "doi": "10.1145/2371574.2371639"
    },
    {
      "text": "Stienstra, J., Bruns Alonso, M., Wensveen, S. and Kuenen, S., How to Design for Transformation of Behavior through Interactive Materiality. In proceedings of NordiCHI, (2012), ACM Press, 21--30.  ",
      "doi": "10.1145/2399016.2399020"
    },
    {
      "text": "Ståhl, A., Löwgren, J. and Höök, K. Evocative Balance: Designing for Interactional Empowerment. International Journal of Design, 8 (1). 43--57.",
      "doi": ""
    },
    {
      "text": "Tholander, J. and Johansson, C., Design qualities for Whole Body Interaction - Learning from Golf, Skateboarding and BodyBugging. In proc of NordiCHI, (2010), 493--502.  ",
      "doi": "10.1145/1868914.1868970"
    },
    {
      "text": "Toscos, T., Faber, A., An, S. and Praful Gandhi, M., Chick Clique: Persuasive Technology to Motivate Teenage Girls to Exercise. In proc of CHI EA, (2006), 1873--1878.  ",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "Walmink, W., Wilde, D. and Mueller, F., Displaying heart rate data on a bicycle helmet to support social exertion experiences. In proc of TEI, (2014), 97--104  ",
      "doi": "10.1145/2540930.2540970"
    },
    {
      "text": "Wijnalda, G., Pauws, S., Vignoli, F. and Stuckenschmidt, H. A Personalized Music System for Motivation in Sport Performance. IEEE Pervasive Computing, 2005 (july-september). 26--32.  ",
      "doi": "10.1109/MPRV.2005.47"
    }
  ]
}