{
  "doi": "10.1145/2702123.2702502",
  "title": "Balancing Accuracy and Fun: Designing Camera Based Mobile Games for Implicit Heart Rate Monitoring",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "847-856",
  "year": 2015,
  "badges": [],
  "abstract": "Heart rate monitoring is widely used in clinical care, fitness training, and stress management. However, tracking individuals' heart rates faces two major challenges, namely equipment availability and user motivation. In this paper, we present a novel technique, LivePulse Games (LPG), to measure users' heart rates in real time by having them play games on unmodified mobile phones. With LPG, the heart rate is calculated by detecting changes in transparency of users' fingertips via the built-in camera of a mobile device. More importantly, LPG integrate users' camera lens covering actions as an essential control mechanism in game play, and detect heart rates implicitly from intermittent lens covering actions. We explore the design space and trade-offs of LPG through three rounds of iterative design. In a 12-subject user study, we found that LPG are fun to play and can measure heart rates accurately. We also report the insights for balancing measurement speed, accuracy, and entertainment value in LPG.",
  "tags": [
    "ecg",
    "serious game",
    "mobile phone",
    "quantified self",
    "heart rate",
    "game design",
    "multi-modal interface"
  ],
  "authors": [
    {
      "name": "Teng Han",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488652855",
      "orcid": "missing"
    },
    {
      "name": "Xiang Xiao",
      "institution": "University of Pittsburgh, Pittsburgh, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84458885457",
      "orcid": "missing"
    },
    {
      "name": "Lanfei Shi",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959146057",
      "orcid": "missing"
    },
    {
      "name": "John Canny",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415489",
      "orcid": "missing"
    },
    {
      "name": "Jingtao Wang",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81490672860/rel-imgonly/jingtaow_full.jpg",
      "acmid": "81490672860",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, G, Durand, F., et al, Detecting Pulse from Head Motions in Video, In Proc. IEEE CVPR 2013.  ",
      "doi": "10.1109/CVPR.2013.440"
    },
    {
      "text": "Banitsas K., Pelegris P. et al, A Simple Algorithm to Monitor HR for Real Time Treatment Applications, In Proc. ITAB 2009.",
      "doi": ""
    },
    {
      "text": "Bjork, S., Patterns in Game Design, Charles River Media, 1st ed, 2004.",
      "doi": ""
    },
    {
      "text": "Cardiograph for iOS, https://itunes.apple.com/us/app/cardiograph/id441079429?ls=1&mt=8",
      "doi": ""
    },
    {
      "text": "Carrol, E., Czerwinski, M., Roseway, A., Kapoor, A., d Schraefel, m.c., Food and Mood: An Exploration in Emotional Eating Intervention, In Proc. ACII 2013.",
      "doi": ""
    },
    {
      "text": "Cook, S., Togni, M., et al, High heart rate: a cardiovascular risk factor?, European Heart Journal, vol. 27(20), 2006.",
      "doi": ""
    },
    {
      "text": "Cooper, K., Pollock, M., et al, Physical Fitness Levels vs Selected Coronary Risk Factors A Cross-Sectional Study, The Journal of the American Medical Association (JAMA), vol. 236, No. 2, July, 1976.",
      "doi": ""
    },
    {
      "text": "Flatla, D., Gutwin, C., et al, Calibration Games: Making Calibration Tasks Enjoyable by Adding Motivating Game Elements, In Proc. UIST 2011.  ",
      "doi": "10.1145/2047196.2047248"
    },
    {
      "text": "Fridly, J., Snijders, M., et al., Hidden Markov models approach to the analysis of array CGH data, Journal of Multivariate Analysis, Vol 90(1), July 2004.  ",
      "doi": "10.1016/j.jmva.2004.02.008"
    },
    {
      "text": "Garbey, M., Sun, N., et al, Contact-free Measurement of Cardiac Pulse Based on the Analysis of Thermal Imagery, IEEE Trans. Biomedical Engineering 54(8), pp 1418--1426 2007.",
      "doi": ""
    },
    {
      "text": "Hay, T., The Rise of the 'Quantified Self' in Health Care, In Wall Street Journal, Aug 13, 2013.",
      "doi": ""
    },
    {
      "text": "Instant Heart Rate for iOS, https://itunes.apple.com/app/instant-heartrate-measure/id395042892?mt=8",
      "doi": ""
    },
    {
      "text": "Jensen, M., Suadicani, P. et al, Elevated Resting Heart Rate, Physical Fitness and All-Cause Mortality: a 16-year Follow-up in The Copenhagen Male Study, Heart Vol. 99, 2013.",
      "doi": ""
    },
    {
      "text": "Joshi, N., Kang, S.B., et al, Image Deblurring using Inertial Measurement Sensors, In Proc SIGGRAPH 2010.  ",
      "doi": "10.1145/1833349.1778767"
    },
    {
      "text": "Jraidi, I., Chaouachi, M., Frasson, C., A Dynamic Multimodal Approach for Assessing Learners' Interaction Experience, In Proc. ACM ICMI 2013.  ",
      "doi": "10.1145/2522848.2522896"
    },
    {
      "text": "Kristal-Boneh, E., Raifel, M., et al, Heart rate variability in health and disease, Scand J Work Environ Health. 1995 Apr;21(2):85--95.",
      "doi": ""
    },
    {
      "text": "Lipsman, A., Aquino, C., 2013 Mobile Future in Focus, comScore whitepaper, released on February 22, 2013.",
      "doi": ""
    },
    {
      "text": "Malik, M., et al, Heart rate variability: standards of measurement, physiological interpretation, and clinical use, Circulation 93:1043-- 1065,1996",
      "doi": ""
    },
    {
      "text": "Mueller, F., Vetere, F., et al, Jogging Over a Distance Between Europe and Australia, In Proc. UIST 2010.  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Mueller, F., Vetere, F., et al, Balancing Exertion Experiences, In Proc. CHI 2012.  ",
      "doi": "10.1145/2207676.2208322"
    },
    {
      "text": "Nacke, L., Kalyn, M., Biofeedback Game Design: Using Direct and Indirect Physiological Control to Enhance Game Interaction, In Proc. CHI 2011.  ",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Naima, R., and Canny, J. The Berkeley Tricorder: Ambulatory Health Monitoring, 2009 Sixth International Workshop on Wearable and Implantable Body Sensor Networks, 53--58.  ",
      "doi": "10.1109/BSN.2009.58"
    },
    {
      "text": "Nenonen, V., Lindblad, A., Using Heart Rate to Control an Interactive Game, In Proc. CHI 2007.  ",
      "doi": "10.1145/1240624.1240752"
    },
    {
      "text": "Oliveira, R., Oliver, N., TripleBeat: Enhancing Exercise Performance with Persuasion, In Proc. MobileHCI 2009.  ",
      "doi": "10.1145/1409240.1409268"
    },
    {
      "text": "Pantelopoulos, A., Bourbakis, N., A Survey on Wearable Biosensor Systems for Health Monitoring, In Proc. IEEE EMBS 2008.",
      "doi": ""
    },
    {
      "text": "Pelegris, P., Banitsas, K., et al, A Novel Method to Detect Heart Beat Rate Using a Mobile Phone, In Proc. IEEE EMBS 2010.",
      "doi": ""
    },
    {
      "text": "Poh, M., McDuff, D., Picard, R., Advancements in non-contact, multiparameter physiological measurements using a webcam, In IEEE Trans Biomed Eng, vol. 58(1), 2011.",
      "doi": ""
    },
    {
      "text": "Poh, M., McDuff, D., Picard, R., Noncontact, Automated Cardiac Pulse Measurements Using Video Imaging and Blind Source Separation, Optics Express 18 (2010): 10762.",
      "doi": ""
    },
    {
      "text": "Rowe, D.R., Sibert, J., and Irwin, D. Heart Rate Variability: Indicator of User State as an Aid to Human-Computer Interaction. In Proc. CHI 1998.  ",
      "doi": "10.1145/274644.274709"
    },
    {
      "text": "Scruggs, P., Beveridge, S., Watson, D., Increasing Children's School Time Physical Activity Using Structured Fitness Breaks. Pediatric Exercise Science, 15(2), 2003.",
      "doi": ""
    },
    {
      "text": "Stach, T., Graham, T.C., et al, Heart Rate Control of Exercise Video Games, In Proc. Graphics Interface 2009. ",
      "doi": "10.5555/1555880.1555912"
    },
    {
      "text": "Singh, D., Saini, B.S. Heart Rate Variability-A Bibliographical Survey, IETE Journal of research on Biomedical Signal and Image Processing, vol. 54, no. 3, pp. 209--216, 2008.",
      "doi": ""
    },
    {
      "text": "Sun, D., Canny, J., Paredes, P., MouStress: Detecting Stress from Mouse Motion, In Proc. CHI 2014.  ",
      "doi": "10.1145/2556288.2557243"
    },
    {
      "text": "Tian, F., Lv, F., et al, Let's Play Chinese Characters: Mobile Learning Approaches via Culturally Inspired Group Games, In Proc. of CHI 2010.  ",
      "doi": "10.1145/1753326.1753565"
    },
    {
      "text": "Walker, W., Aroul, P., et al, Mobile Health Monitoring Systems, In Proc. IEEE EMBS 2009.",
      "doi": ""
    },
    {
      "text": "Weinman J, Hayat A, Raviv G: Reflection photoplethysmography of arterial-blood volume pulses. In Med Biol Eng Comput 1977;",
      "doi": ""
    },
    {
      "text": "Vrijkotte, T., et al, Effects of Work Stress on Ambulatory Blood Pressure, Heart Rate, and Heart Rate Variability, Hypertension: J. of Ameri. Heart Assoc Vol. 35, 2000",
      "doi": ""
    },
    {
      "text": "Yar, T., Resting Heart Rate and its Relationship with General and Abdominal Obesity in Young Male Saudi University Students, Pak J Physiol vol. 6(1), 2010.",
      "doi": ""
    },
    {
      "text": "Yun, C., Shastri, D., et al, O' game, Can You Feel My Frustration?: Improving User's Gaming Experience via Stresscam, In Proc. CHI 2009.  ",
      "doi": "10.1145/1518701.1519036"
    },
    {
      "text": "Xiao, X., Han, T., Wang, J., LensGesture: Augmenting Mobile Interactions with Back-of-Device Finger Gestures, In Proc. ACM ICMI 2013.  ",
      "doi": "10.1145/2522848.2522850"
    }
  ]
}