{
  "doi": "10.1145/2702123.2702419",
  "title": "MatrixWave: Visual Comparison of Event Sequence Data",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "259-268",
  "year": 2015,
  "badges": [],
  "abstract": "Event sequence data analysis is common in many domains, including web and software development, transportation, and medical care. Few have investigated visualization techniques for comparative analysis of multiple event sequence datasets. Grounded in the real-world characteristics of web clickstream data, we explore visualization techniques for comparison of two clickstream datasets collected on different days or from users with different demographics. Through iterative design with web analysts, we designed MatrixWave, a matrix-based representation that allows analysts to get an overview of differences in traffic patterns and interactively explore paths through the website. We use color to encode differences and size to offer context over traffic volume. User feedback on MatrixWave is positive. Our study participants made fewer errors with MatrixWave and preferred it over the more familiar Sankey diagram.",
  "authors": [
    {
      "name": "Jian Zhao",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81484648585/rel-imgonly/dsc_7313__jian_zhao_portrait_large_.jpg",
      "acmid": "81484648585",
      "orcid": "missing"
    },
    {
      "name": "Zhicheng Liu",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385599440",
      "orcid": "missing"
    },
    {
      "name": "Mira Dontcheva",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654713",
      "orcid": "missing"
    },
    {
      "name": "Aaron Hertzmann",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100015154",
      "orcid": "missing"
    },
    {
      "name": "Alan Wilson",
      "institution": "Adobe Research, Lehi, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707524",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "B. Alper, B. Bach, N. Henry Riche, T. Isenberg, and J.-D. Fekete. Weighted graph comparison techniques for brain connectivity analysis. In Proc. CHI, 483--492, 2013.  ",
      "doi": "10.1145/2470654.2470724"
    },
    {
      "text": "B. Bach, E. Pietriga, and J.-D. Fekete. Graphdiaries: Animated transitions and temporal navigation for dynamic networks. IEEE TVCG, 20(5):740--754, 2014.  ",
      "doi": "10.1109/TVCG.2013.254"
    },
    {
      "text": "J. Bertin. Semiology of Graphics: Diagrams, Networks, Maps. University of Wisconsin Press, 1983. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "A. Bezerianos, P. Dragicevic, J.-D. Fekete, J. Bae, and B. Watson. GeneaQuilts: A System for Exploring Large Genealogies. IEEE TVCG, 16(6):1073--1081, 2010.  ",
      "doi": "10.1109/TVCG.2010.159"
    },
    {
      "text": "J. Brainerd and B. Becker. Case study: e-commerce clickstream visualization. In Proc. InfoVis, 153, 2001. ",
      "doi": "10.5555/580582.857714"
    },
    {
      "text": "S. Bremm, T. von Landesberger, M. Hess, T. Schreck, P. Weil, and K. Hamacherk. Interactive visual comparison of multiple trees. In Proc. VAST, 31--40, 2011.",
      "doi": ""
    },
    {
      "text": "I. Cadez, D. Heckerman, C. Meek, P. Smyth, and S. White. Visualization of navigation patterns on a web site using model-based clustering. In Proc. KDD, 280--284, 2000.  ",
      "doi": "10.1145/347090.347151"
    },
    {
      "text": "M. Ghoniem, J.-D. Fekete, and P. Castagliola. On the readability of graphs using node-link and matrix-based representations: A controlled experiment and statistical analysis. Info. Vis., 4(2):114--135, 2005.  ",
      "doi": "10.1057/palgrave.ivs.9500092"
    },
    {
      "text": "M. Gleicher, D. Albers, R. Walker, I. Jusufi, C. D. Hansen, and J. C. Roberts. Visual comparison for information visualization. Info. Vis., 10(4):289--309, 2011.  ",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "D. Gotz and H. Stavropoulos. Decisionflow: Visual analytics for high-dimensional temporal event sequence data. IEEE TVCG, 20(12):1783--1792, 2014.",
      "doi": ""
    },
    {
      "text": "J. Guerra-Gomez, M. Pack, C. Plaisant, and B. Shneiderman. Visualizing change over time using dynamic hierarchies: Treeversity2 and the stemview. IEEE TVCG, 19(12):2566--2575, 2013.  ",
      "doi": "10.1109/TVCG.2013.231"
    },
    {
      "text": "D. Holten and J. J. van Wijk. Visual comparison of hierarchically organized data. Comp. Graph. Forum, 27(3):759--766, 2008.  ",
      "doi": "10.1111/j.1467-8659.2008.01205.x"
    },
    {
      "text": "J. I. Hong, J. Heer, S. Waterson, and J. Landay. Webquilt: A proxy-based approach to remote web usability testing. IEEE Trans. Info. Sys, 19(3):263--285, 2001.  ",
      "doi": "10.1145/502115.502118"
    },
    {
      "text": "S. Kannappady, S. P. Mudur, and N. Shiri. Visualization of web usage patterns. In Proc. IDEAS, 220--227, 2006.  ",
      "doi": "10.1109/IDEAS.2006.52"
    },
    {
      "text": "M. Krstajic, E. Bertini, and D. Keim. Cloudlines: Compact display of event episodes in multiple time-series. IEEE TVCG, 17(12):2432--2439, 2011.  ",
      "doi": "10.5555/2068462.2068661"
    },
    {
      "text": "B. Lee, G. G. Robertson, M. Czerwinski, and C. S. Parr. Candidtree: visualizing structural uncertainty in similar hierarchies. Info. Vis., 6(3):233--246, 2007.  ",
      "doi": "10.1145/1375939.1375944"
    },
    {
      "text": "J. Lee, M. Podlaseck, E. Schonberg, and R. Hoch. Visualization and analysis of clickstream data of online stores for understanding web merchandising. Data Mining and Knowledge Discovery, 5:59--84, 2001.  ",
      "doi": "10.1023/A%3A1009843912662"
    },
    {
      "text": "E. Maguire, P. Rocca-Serra, S.-A. Sansone, J. Davies, and M. Chen. Visual compression of workflow visualizations with automated detection of macro motifs. IEEE TVCG, 19(12):2576--2585, 2013.  ",
      "doi": "10.1109/TVCG.2013.225"
    },
    {
      "text": "M. Monroe, R. Lan, H. Lee, C. Plaisant, and B. Shneiderman. Temporal event sequence simplification. IEEE TVCG, 19(12):2227--2236, 2013.  ",
      "doi": "10.1109/TVCG.2013.200"
    },
    {
      "text": "M. Monroe, R. Lan, J. Morales del Olmo, B. Shneiderman, C. Plaisant, and J. Millstein. The challenges of specifying intervals and absences in temporal queries: A graphical language approach. In Proc. CHI, 2349--2358, 2013.  ",
      "doi": "10.1145/2470654.2481325"
    },
    {
      "text": "T. Munzner, F. Guimbretiére, S. Tasiran, L. Zhang, and Y. Zhou. Treejuxtaposer: scalable tree comparison using focus+context with guaranteed visibility. ACM Trans. Graphics, 22(3):453--462, 2003.  ",
      "doi": "10.1145/882262.882291"
    },
    {
      "text": "A. Perer and J. Sun. Matrixflow: Temporal network visual analytics to track symptom evolution during disease progression. In Proc. AMIA, 716--725, 2012.",
      "doi": ""
    },
    {
      "text": "A. Perer and F. Wang. Frequence: Interactive mining and visualization of temporal frequent event sequences. In Proc. AVI, 153--162, 2014.  ",
      "doi": "10.1145/2557500.2557508"
    },
    {
      "text": "C. Plaisant, B. Milash, A. Rose, S. Widoff, and B. Shneiderman. Lifelines: visualizing personal histories. In Proc. CHI, 221--227, 1996.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "P. Riehmann, M. Hanfler, and B. Froehlich. Interactive sankey diagrams. In Proc. InfoVis, 233--240, 2005.  ",
      "doi": "10.1109/INFOVIS.2005.21"
    },
    {
      "text": "Y. Tu and H.-W. Shen. Visualizing changes of hierarchical data using treemaps. IEEE TVCG, 13(6):1286--1293, 2007.  ",
      "doi": "10.1109/TVCG.2007.70529"
    },
    {
      "text": "F. van Ham, H. Van De Wetering, and J. van Wijk. Interactive visualization of state transition systems. IEEE TVCG, 8(4):319--329, 2002.  ",
      "doi": "10.1109/TVCG.2002.1044518"
    },
    {
      "text": "T. D. Wang, C. Plaisant, A. J. Quinn, R. Stanchak, S. Murphy, and B. Shneiderman. Aligning temporal data by sentinel events: Discovering patterns in electronic health records. In Proc. CHI, 457--466, 2008.  ",
      "doi": "10.1145/1357054.1357129"
    },
    {
      "text": "J. Wei, Z. Shen, N. Sundaresan, and K.-L. Ma. Visual cluster exploration of web clickstream data. In Proc. VAST, 3--12, 2012.  ",
      "doi": "10.1109/VAST.2012.6400494"
    },
    {
      "text": "K. Wongsuphasawat and D. Gotz. Exploring flow, factors, and outcomes of temporal event sequences with the outflow visualization. IEEE TVCG, 18(12):2659--2668, 2012.  ",
      "doi": "10.1109/TVCG.2012.225"
    },
    {
      "text": "K. Wongsuphasawat, J. A. Guerra Gómez, C. Plaisant, T. D. Wang, M. Taieb-Maimon, and B. Shneiderman. Lifeflow: visualizing an overview of event sequences. In Proc. CHI, 1747--1756, 2011.  ",
      "doi": "10.1145/1978942.1979196"
    },
    {
      "text": "J. Zhao, F. Chevalier, C. Collins, and R. Balakrishnan. Facilitating discourse analysis with interactive visualization. IEEE TVCG, 18(12):2639--2648, 2012.  ",
      "doi": "10.1109/TVCG.2012.226"
    },
    {
      "text": "J. Zhao, S. M. Drucker, D. Fisher, and D. Brinkman. Timeslice: Interactive faceted browsing of timeline data. In Proc. AVI, 433--436, 2012.  ",
      "doi": "10.1145/2254556.2254639"
    }
  ]
}