{
  "doi": "10.1145/2702123.2702318",
  "title": "Eco-Forecasting for Domestic Electricity Use",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1985-1988",
  "year": 2015,
  "badges": [],
  "abstract": "Over the past decade we have seen an increased awareness about domestic energy consumption and a growing focus on eco-feedback displays. In this paper we explore the concept of providing forecasts in such displays as a supplement to information about past usage. Our prototype, eForecast, extends the display of past electricity usage with forecasts about expected usage, electricity price, availability of wind power, and expected demand drops and peaks. Building on previous eco-feedback display research, our approach specifically enables people to use electricity at more opportune times -- when it is cheap, green, or when there is an abundance of capacity. We evaluated eForecast in real world use in three domestic households for 22 weeks, where we explored potentials and limitations of forecasting for shifting electricity consumption. In this way, families were able to act in a more sustainable way -- without necessarily reducing the amount of electricity consumed.",
  "tags": [
    "forecasting",
    "sustainability",
    "domestic",
    "energy consumption"
  ],
  "authors": [
    {
      "name": "Jesper Kjeldskov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020677",
      "orcid": "0000-0001-7990-4229"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Jeni Paay",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423598",
      "orcid": "missing"
    },
    {
      "name": "Dennis Lund",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658686451",
      "orcid": "missing"
    },
    {
      "name": "Tue Madsen",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658676336",
      "orcid": "missing"
    },
    {
      "name": "Michael Nielsen",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/do/10.1145/contrib-81460644143/rel-imgonly/photoon22-02-16at10.14.jpg",
      "acmid": "81460644143",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Costanza, E., Fisher, J.E., Colleu, J.A., Rodden, T., Ramchurn, S.D., Jennings N.R. Doing the Laundry with Agents: a Field Trial of a Future Smart Energy System in the Home. Proc. CHI'14, ACM (2014), pp. 823--832  ",
      "doi": "10.1145/2556288.2557167"
    },
    {
      "text": "Froehlich, J., Findlater, L., and Landay, J. The design of eco-feedback technology. Proc. CHI'10, ACM (2010), pp. 1999--2008  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Froehlich, J., Findlater, L., Ostergren, M., Ramanathan, S., Peterson, J., Wragg, I., Larson, E., Fu, F., Bai, M., Patel, S. and Landay, J. A. The design and evaluation of prototype eco-feedback displays for fixture-level water usage data. Proc. CHI'12, ACM (2012), pp. 2367--2376  ",
      "doi": "10.1145/2207676.2208397"
    },
    {
      "text": "Kjeldskov, J., Skov, M. B., Paay, J. and Pathmanathan, R. Using mobile phones to support sustainability: A field study of residential electricity consumption. Proc. CHI'12, ACM (2012), 2347--2356  ",
      "doi": "10.1145/2207676.2208395"
    },
    {
      "text": "Mankoff, J. C., Blevis, E., Borning, A., Friedman, B., Fussell, S. R., Hasbrouck, J., Woodruff, A., and Sengers, P. Environmental sustainability and interaction. Ext. Abstracts of CHI'07, ACM (2007), pp. 2121--2124  ",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Pathmanathan, R., Pearce, J., Kjeldskov, J. and Smith, W. Using Mobile Phones for Promoting Water Conservation. Proc. OzCHI'11, ACM (2011), pp. 243--252  ",
      "doi": "10.1145/2071536.2071575"
    },
    {
      "text": "Pierce, J. and Paulos, E. Beyond Energy Monitors: Interaction, Energy, and Emerging Energy Systems. Proc. CHI'12. ACM (2012), pp. 665--674  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "Pierce, J., Schiano, D., and Paulos, E. Home, Habits, and Energy: Domestic Interactions and Energy Consumption. Proc. CHI'10. ACM (2011), pp. 1985--1994  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Schrammel, J., Gerdenitsch, C., Weiss, A., Kluckner, P., and Tscheligi, M. FORE-Watch - The Clock that Tells You When to Use. Proc AmI'11, LNCS (2011), 157--166  ",
      "doi": "10.1007/978-3-642-25167-2_19"
    },
    {
      "text": "Strengers, Y. Designing eco-feedback systems for everyday life. Proc. CHI'11, ACM (2011), 2135--2144  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Yang, R., Newman, M.W., and Forlizzi, J. Making Sustainability Sustainable: Challenges in the Design of Eco-Interaction Technologies. Proc. CHI'14, ACM (2014), pp. 823--832.  ",
      "doi": "10.1145/2556288.2557380"
    }
  ]
}