{
  "doi": "10.1145/2702123.2702431",
  "title": "Understanding Data Videos: Looking at Narrative Visualization through the Cinematography Lens",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1459-1468",
  "year": 2015,
  "badges": [],
  "abstract": "Data videos, motion graphics that incorporate visualizations about facts, are increasingly gaining popularity as a means of telling stories with data. However, very little is systematically recorded about (a) what elements are featured in data videos and (b) the processes used to create them. In this article, we provide initial insights to build this knowledge. We first report on a qualitative analysis of 50 professionally designed data videos, extracting and exposing their most salient constituents. Second, we report on a series of workshops with experienced storytellers from cinematography, graphics design and screenplay writing. We provided them with a set of data facts and visualizations and observed them create storyboards for data videos. From these exploratory studies, we derive broader implications for the design of an authoring tool to enable a wide audience to create data videos. Our findings highlight the importance of providing a flexible tool supporting a non-linear creation process and allowing users to iteratively go back to different phases of the process.",
  "tags": [
    "information visualization",
    "data video",
    "qualitative analysis",
    "narrative visualization",
    "data storytelling"
  ],
  "authors": [
    {
      "name": "Fereshteh Amini",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351594407",
      "orcid": "missing"
    },
    {
      "name": "Nathalie Henry Riche",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502798938",
      "orcid": "missing"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Christophe Hurter",
      "institution": "University of Toulouse, Toulouse, France",
      "img": "/do/10.1145/contrib-81350584067/rel-imgonly/web.jpg",
      "acmid": "81350584067",
      "orcid": "0000-0003-4318-6717"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, MAN, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Divorces in 2012. http://www.ons.gov.uk/ons/rel/vsob1/divorces-inengland-and-wales/index.html.",
      "doi": ""
    },
    {
      "text": "The general (1926). http://explore.bfi.org.uk/ 4ce2b6aae85f3.",
      "doi": ""
    },
    {
      "text": "Oxford online dictionary. http://www.oxforddictionaries.com.",
      "doi": ""
    },
    {
      "text": "Use a picture. it's worth a thousand words. Speakers Give Sound Advice, Syracuse Post Standard (page 18), March 28, 1911.",
      "doi": ""
    },
    {
      "text": "99% v 1%: the data behind the occupy movement. http://www.theguardian.com/news/datablog/video/2011/ nov/16/99-v-1-occupy-data-animation, 2012.",
      "doi": ""
    },
    {
      "text": "Global air traffic. http://www.rightcolours.com/portfolio2.html, 2012.",
      "doi": ""
    },
    {
      "text": "Racing against history. http://www.nytimes.com/ interactive/2012/08/01/sports/olympics/racing-againsthistory.html?_r=0, 2012.",
      "doi": ""
    },
    {
      "text": "An infographic exploration of online video. http://www.shutterstock.com/blog/an-infographicexploration-of-online-video, Shutterstock, 2014.",
      "doi": ""
    },
    {
      "text": "Bateman, S., Mandryk, R. L., Gutwin, C., Genest, A., McDine, D., and Brooks, C. Useful junk?: the effects of visual embellishment on comprehension and memorability of charts. Proc. CHI, 2573--2582, 2010.  ",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "Borkin, M. A., Vo, A. A., Bylinskii, Z., Isola, P., Sunkavalli, S., Oliva, A., and Pfister, H. What makes a visualization memorable? IEEE TVCG (InfoVis '13) 19, 12 (2013), 2306--2315.  ",
      "doi": "10.1109/TVCG.2013.234"
    },
    {
      "text": "Brehmer, M., Carpendale, S., Lee, B., and Tory, M. Predesign empiricism for information visualization: Scenarios, methods, and challenges. Proc. BELIV Workshop, ACM Press (2014), 147--151.  ",
      "doi": "10.1145/2669557.2669564"
    },
    {
      "text": "Satyanarayan, A. and Heer, J. Authoring narrative visualizations with ellipsis. Proc. EuroVis, (2014).",
      "doi": ""
    },
    {
      "text": "Cohn, N. Visual narrative structure. Cognitive science 37, 3 (2013), 413--452.",
      "doi": ""
    },
    {
      "text": "Eccles, R., Kapler, T., Harper, R., and Wright, W. Stories in geotime. Information Visualization 7, 1 (2008), 3--17.  ",
      "doi": "10.1145/1391107.1391109"
    },
    {
      "text": "Freytag, G. Technique of the Drama: An Exposition of Dramatic Composition and Art. University Press of the Pacific, 1904.",
      "doi": ""
    },
    {
      "text": "Gershon, N., and Page, W. What storytelling can do for information visualization. CACM 44, 8 (2001), 31--37.  ",
      "doi": "10.1145/381641.381653"
    },
    {
      "text": "Glaser, B. G., and Strauss, A. L. The discovery of grounded theory: Strategies for qualitative research. Transaction Publishers, 2009.",
      "doi": ""
    },
    {
      "text": "Heer, J., Mackinlay, J., Stolte, C., and Agrawala, M. Graphical histories for visualization: Supporting analysis, communication, and evaluation. IEEE TVCG (InfoVis '08) 14, 6 (2008), 1189--1196.  ",
      "doi": "10.1109/TVCG.2008.137"
    },
    {
      "text": "Hullman, J., and Diakopoulos, N. Visualization rhetoric: Framing effects in narrative visualization. IEEE TVCG (InfoVis '11) 17, 12 (2011), 2231--2240.  ",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Hullman, J., Drucker, S., Riche, N. H., Lee, B., Fisher, D., and Adar, E. A deeper understanding of sequence in narrative visualization. IEEE TVCG (InfoVis '13) 19, 12 (2013), 2406--2415.  ",
      "doi": "10.1109/TVCG.2013.119"
    },
    {
      "text": "Jern, M., Rogstadius, J., Astrom, T., and Ynnerman, A. Visual analytics presentation tools applied in html documents. Proc. IV, IEEE (2008), pp. 200--207.  ",
      "doi": "10.1109/IV.2008.22"
    },
    {
      "text": "Kosara, R., and Mackinlay, J. Storytelling: The next step for visualization. IEEE Computer 46, 5 (2013), 44--50.  ",
      "doi": "10.1109/MC.2013.36"
    },
    {
      "text": "Ma, K.-L., Liao, I., Frazier, J., Hauser, H., and Kostis, H.-N. Scientific storytelling using visualization. IEEE CG&A 32, 1 (2012), 12--19.  ",
      "doi": "10.1109/MCG.2012.24"
    },
    {
      "text": "Mascelli, J. V. The five C's of cinematography.",
      "doi": ""
    },
    {
      "text": "McCloud, S. Understanding comics: The invisible art. William Morrow Paperbacks, 1994.",
      "doi": ""
    },
    {
      "text": "Richards, L. Handling qualitative data: A practical guide. Sage Publications, 2009.",
      "doi": ""
    },
    {
      "text": "Segel, E., and Heer, J. Narrative visualization: Telling stories with data. IEEE TVCG (InfoVis '10) 16, 6 (2010), 1139--1148.  ",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Viegas, F. B., Wattenberg, M., van Ham, F., Kriss, J., and McKeon, M. Manyeyes: a site for visualization at internet scale. IEEE TVCG (InfoVis '07) 13, 6 (2007), 1121--1128.  ",
      "doi": "10.1109/TVCG.2007.70577"
    },
    {
      "text": "Wojtkowski, W. and Wojtkowski, W. G. Storytelling: its role in information visualization. European Systems Science Congress (2002).",
      "doi": ""
    }
  ]
}