{
  "doi": "10.1145/2702123.2702211",
  "title": "A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3903-3912",
  "year": 2015,
  "badges": [],
  "abstract": "As people possess increasing numbers of information devices, situations where several devices are combined and used together have become more common. We present a user study on people's current practices in combining multiple information devices in their everyday lives, ranging from pragmatic tasks to leisure activities. Based on diaries and interviews of 14 participants, we characterize the usage practices of the most common devices, including smartphones, computers, tablets, and home media centers. We analyze 123 real-life multi-device use cases and identify the main usage patterns, including Sequential Use, Resource Lending, Related Parallel Use, and Unrelated Parallel Use. We discuss the practical challenges of using several information devices together. Finally, we identify three levels of decisions that determine which devices are used in a particular situation, including acquiring, making available, and selecting the devices for use.",
  "authors": [
    {
      "name": "Tero Jokela",
      "institution": "Nokia Technologies, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408600326",
      "orcid": "missing"
    },
    {
      "name": "Jarno Ojala",
      "institution": "Tampere University of Technology, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641790",
      "orcid": "missing"
    },
    {
      "name": "Thomas Olsson",
      "institution": "Tampere University of Technology, Tampere, Finland",
      "img": "/do/10.1145/contrib-99659364710/rel-imgonly/20180530-tdo_5098_small.jpg",
      "acmid": "99659364710",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bandelloni, R., and Paternò, F. Migratory user interfaces able to adapt to various interaction platforms. Int. Journal of Human-Computer Studies 60, 5--6 (2004), 621--639.",
      "doi": ""
    },
    {
      "text": "Bardram, J. Activity-based computing for medical work in hospitals. ACM Transactions on Computer-Human Interaction 16, 2 (2009).  ",
      "doi": "10.1145/1534903.1534907"
    },
    {
      "text": "Dearman, D. and Pierce, J. It's on my other computer!: computing with multiple devices. In Proc. CHI '08, 767--776.  ",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Google. The New Multi-Screen World Study. https://www.thinkwithgoogle.com/research-studies/thenew-multi-screen-world-study.html",
      "doi": ""
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. In Proc. CHI '01, 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Holtzblatt, K., Wendell, J. B. and Wood, S. Rapid Contextual Design. Morgan Kaufmann, 2004.",
      "doi": ""
    },
    {
      "text": "Jung, H., Stolterman, E., Ryan, W., Thompson, T. and Siegel, M. Toward a framework for ecologies of artifacts: how are digital artifacts interconnected within a personal life? In Proc. NordiCHI '08, 201--210.  ",
      "doi": "10.1145/1463160.1463182"
    },
    {
      "text": "Kane, S., Karlson, A., Meyers, B., Johns, P., Jacobs, A. and Smith, G. Exploring cross-device web use on PCs and mobile devices. In Proc. INTERACT '09, 722--735.  ",
      "doi": "10.1007/978-3-642-03655-2_79"
    },
    {
      "text": "Karlson, A., Iqbal, S., Meyers, B., Ramos, G., Lee, K. and Tang, J. Mobile taskflow in context: a screenshot study of smartphone usage. In Proc. CHI '10, 2009-2018.  ",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Karlson, A., Meyers, B., Jacobs, A., Johns, P. and Kane, S. Working overtime: patterns of smartphone and PC usage in the day of an information worker. In Proc. Pervasive '09, 398--405.  ",
      "doi": "10.1007/978-3-642-01516-8_27"
    },
    {
      "text": "Mainwaring, S., Anderson, K. and Chang, M. Living for the global city: mobile kits, urban interfaces, and Ubicomp. In Proc. UbiComp '05, 269--286.  ",
      "doi": "10.1007/11551201_16"
    },
    {
      "text": "Müller, H., Gove, J. and Webb, J. Understanding tablet use: a multi-method exploration. In Proc. MobileHCI '12, 1--10.  ",
      "doi": "10.1145/2371574.2371576"
    },
    {
      "text": "Nacenta, M. Cross-display object movement in multidisplay environments. PhD thesis, University of Saskatchewan, 2009. ",
      "doi": "10.5555/2020001"
    },
    {
      "text": "Norman, D. The Invisible Computer. MIT Press, 1999. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Oulasvirta, A. and Sumari, L. Mobile kits and laptop trays: managing multiple devices in mobile information work. In Proc. CHI '07, 1127--1136.  ",
      "doi": "10.1145/1240624.1240795"
    },
    {
      "text": "Santosa, S., and Wigdor, D. A field study of multidevice workflows in distributed workspaces. In Proc. UbiComp '13, 63--72.  ",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Terrenghi, L., Quigley, A. and Dix, A. A taxonomy for and analysis of multi-person-display ecosystems. Personal and Ubiquitous Computing 13, 8 (2009), 583--598.  ",
      "doi": "10.1007/s00779-009-0244-5"
    },
    {
      "text": "Uzun, E., Saxena, N. and Kumar, A. Pairing devices for social interactions: a comparative usability evaluation. In Proc. CHI '11, 2315--2324.  ",
      "doi": "10.1145/1978942.1979282"
    },
    {
      "text": "Weiser, M. The computer for the 21st century. Scientific American 265 (1991), 94--104.",
      "doi": ""
    }
  ]
}