{
  "doi": "10.1145/2702123.2702356",
  "title": "Couples' Communication Channels: What, When & Why?",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "709-712",
  "year": 2015,
  "badges": [],
  "abstract": "An overwhelming variety of communication channels are available to consumers. Here, we present an overview of the aspects that need to be accounted for when intimate partners select a communication channel. We present interviews with 10 cohabiting couples (20 participants) and an 8-day diary study of communication and coordination. Using reported instances of within-couple communication, triggered by relationship-oriented or practical household needs, we identify why particular channels are chosen or sequenced. Extending media richness critiques, we identify additional factors that influence communication choice such as intimate knowledge of the others' habits, possibilities to add emotional meaning, and couples' shared needs as an identifiable unit. We also extend the notion of network effects on channel choice, and discuss the ecology of channel, networks, devices and device settings involved between partners. Finally, channel choice is not an all-or-nothing game; multiple channels can, and must, co-exist.",
  "authors": [
    {
      "name": "Henriette Cramer",
      "institution": "Yahoo Labs, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487965",
      "orcid": "missing"
    },
    {
      "name": "Maia L. Jacobs",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058964857",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Böhmer, M. Hecht, B. Schöning, J., Krüger, A., Bauer, G. Falling asleep with Angry Birds, Facebook and Kindle. Proc. MobileHCI'11 (2011), 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Church, K., De Oliveira, R. WhatsUp With WhatsApp? Comparing Mobile Instant Messaging Behaviors with Traditional SMS, Proc. MobileHCI'13 (2013).  ",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Dennis, A., Fuller, R., Valacich, J. Media, Tasks and Communication Processes: A Theory of Media Synchronicity, MIS Quarterly 32, 2 (2008), 575--600. ",
      "doi": "10.5555/2017388.2017395"
    },
    {
      "text": "El-Shinnaway, M., Markus, M. (1997). The poverty of media richness theory: explaining people's choice of electronic mail vs. voice mail. IJHCS, 46, 443--467.  ",
      "doi": "10.1006/ijhc.1996.0099"
    },
    {
      "text": "McGregor, M., Brown, B., McMillan, D. 100 days of iPhone use: mobile recording in the wild. CHI'14 Extended Abstracts (2014), 2335--2340.  ",
      "doi": "10.1145/2559206.2581296"
    },
    {
      "text": "Jung, Y., Lyytinen, K. Towards an ecological account of media choice: a case study on pluralistic reasoning while choosing email. Information Systems Journal, 24, 3 (2014), 271--293.  ",
      "doi": "10.1111/isj.12024"
    },
    {
      "text": "O'Hara, K., Massimi, M., Harper, R., Rubens, S., Morris. J., 2014. Everyday dwelling with WhatsApp. Proc. CSCW'14 (2014), 1131--1143.  ",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Schuler, R., Grandhi, S., Mayer, J., Ricken, S., Jones, Q. The doing of doing stuff: understanding the coordination of social group-activities. Proc. CHI'14 (2014),119--128.  ",
      "doi": "10.1145/2556288.2557388"
    },
    {
      "text": "Scissors, L. Gergle, D. \"Back and forth, back and forth\": channel switching in romantic couple conflict. Proc. CSCW'13 (2013), 237--248.  ",
      "doi": "10.1145/2441776.2441804"
    },
    {
      "text": "Zhou, T., Lu, Y. Examining mobile instant messaging user loyalty from the perspectives of network externalities and flow experience. Computers in Human Behavior, 27 (2011), 883--889. .  ",
      "doi": "10.1016/j.chb.2010.11.013"
    }
  ]
}