{
  "doi": "10.1145/2702123.2702199",
  "title": "Texting while Parenting: How Adults Use Mobile Phones while Caring for Children at the Playground",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "727-736",
  "year": 2015,
  "badges": [],
  "abstract": "Child development research suggests that using phones while caring for children can be problematic, but limited prior work in this space makes defining appropriate use challenging. We conducted the first exploration of whether adults feel pressure to limit phone use in this context and whether they choose to do so. Through mixed methods, we collected data from 466 adult caregivers at playgrounds. We found that phone use was a small part of playground time, yet a notable source of guilt. Adults engaged in systematic and specific phone-use and phone-non-use behaviors in order to prioritize their children above themselves. Our results indicate that caregiver values and self-control together predict behavior and can be used to model phone use in this context. Users' mixed success with engaging in intentional periods of non-use suggests that a design agenda which prioritizes cycles of engagement, disengagement, and re-engagement may be of value to this group.",
  "authors": [
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    },
    {
      "name": "Kiley Sobel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557410456",
      "orcid": "missing"
    },
    {
      "name": "Hyewon Suh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958696857",
      "orcid": "missing"
    },
    {
      "name": "Yi-Chen Sung",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659421447",
      "orcid": "missing"
    },
    {
      "name": "Charlotte P. Lee",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81320491691/rel-imgonly/lee-hcde-mar10-ps300adj2-dsc_0036.jpg",
      "acmid": "81320491691",
      "orcid": "missing"
    },
    {
      "name": "Julie A. Kientz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548025762/rel-imgonly/kientz-headshot-small.png",
      "acmid": "81548025762",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M. (2013). Managing mobile multitasking: the culture of iPhones on Stanford campus. CSCW'13, (pp. 1487--1498).  ",
      "doi": "10.1145/2441776.2441945"
    },
    {
      "text": "Baumer, E.P.S. et al. (2014). Refusing, limiting, departing: why we should study technology non-use. Ext. Abstracts CHI'14, (pp. 65--68).  ",
      "doi": "10.1145/2559206.2559224"
    },
    {
      "text": "Brussoni, M., Olsen, L.L., Pike, I., & Sleet, D.A. (2012). Risky play and children's safety: Balancing priorities for optimal child development. Int J Environ Res Publ Health, 9(9), 3134--3148.",
      "doi": ""
    },
    {
      "text": "Charmaz, K. (2006). Constructing grounded theory: a practical guide through qualitative analysis.",
      "doi": ""
    },
    {
      "text": "Christakis, D.A. (2009). The effects of infant media usage: what do we know and what should we learn?. Acta Paediatrica, 98(1), 8--16.",
      "doi": ""
    },
    {
      "text": "Christopher, K. (2012). Extensive mothering: Employed mothers' constructions of the good mother. Gender & Society, 26(1), 73--96.",
      "doi": ""
    },
    {
      "text": "Codol, J.P. (1975). On the so-called \"superior conformity of the self\" behavior: Twenty experimental investigations. European Journal of Social Psychology, 5(4), 457--501.",
      "doi": ""
    },
    {
      "text": "Emerson, R.M., Fretz, R.I., & Shaw, L.L. (2011). Writing ethnographic fieldnotes. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Foot, K.A. (2014). The Online Emergence of Pushback on Social Media in the USA: A Historical Discourse Analysis. Int J Comm, 8, 30.",
      "doi": ""
    },
    {
      "text": "Friedman, B. et al. (2009). Value Sensitive Design and Information Systems. The Handbook of Information and Computer Ethics. John Wiley & Sons, Inc., 69--101.",
      "doi": ""
    },
    {
      "text": "Ginsburg, K.R. (2007). The importance of play in promoting healthy child development and maintaining strong parent-child bonds. Pediatrics. 119(1), 182--191.",
      "doi": ""
    },
    {
      "text": "Harmon, E., & Mazmanian, M. (2013). Stories of the smartphone in everyday discourse: Conflict, tension & instability. CHI'13 (pp. 1051--1060).  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "Hashish, Y. et al. (2014). Involving children in content control: A collaborative and educationoriented content filtering approach. CHI'14 (pp. 1797--1806)  ",
      "doi": "10.1145/2556288.2557128"
    },
    {
      "text": "Hays, S. (1996). The cultural contradictions of motherhood. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Isola, S., & Fails, J. (2012). Family and design in the IDC and CHI communities. IDC'12 (pp. 40--49).  ",
      "doi": "10.1145/2307096.2307102"
    },
    {
      "text": "Lareau, A. (2002). Invisible Inequality: Social Class and Childrearing in Black Families and White Families. American Sociological Review.",
      "doi": ""
    },
    {
      "text": "Lareau, A. (2010). Unequal Childhoods. Race, Class and Gender: An Anthology, 343--351.",
      "doi": ""
    },
    {
      "text": "Lee, E.J. (2008). Living with risk in the age of \"intensive motherhood': Maternal identity & infant feeding. Health, Risk & Society, 10(5), 467--477.",
      "doi": ""
    },
    {
      "text": "Manjoo, F. (2014). You don't have to feel very guilty about using your smartphone while parenting. The New York Times.",
      "doi": ""
    },
    {
      "text": "Mazmanian, M. (2012). Avoiding the trap of constant connectivity: When congruent frames allow for heterogeneous practices. AMJ.",
      "doi": ""
    },
    {
      "text": "Morrison, S., & Gomez, R. (2013). Pushback: The growth of expressions of resistance to constant online connectivity. iConference (pp. 1--15).",
      "doi": ""
    },
    {
      "text": "Morrongiello, B.A., & Dawber, T. (2000). Mothers' responses to sons and daughters engaging in injuryrisk behaviors on a playground: implications for sex differences in injury rates. J Exp Child Psychol, 76(2), 89--103.",
      "doi": ""
    },
    {
      "text": "Park, A. 2014. Don't Text While Parenting - It Will Make You Cranky. Time Magazine.",
      "doi": ""
    },
    {
      "text": "Radesky, J.S. et al. 2014. Patterns of mobile device use by caregivers and children during meals in fast food restaurants. Pediatrics, 133(4), 843--9.",
      "doi": ""
    },
    {
      "text": "Romagnoli, A. & Wall, G. (2012). \"I know I'm a good mom\": Young, low-income mothers' experiences with risk perception, intensive parenting ideology and parenting education programmes. Health, Risk & Society, 14(3), 273--289.",
      "doi": ""
    },
    {
      "text": "Satchell, C. & Dourish, P. (2009). Beyond the user: use and non-use in HCI. OzCHI'09 (pp. 9--16).  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Schoenebeck, S.Y. (2014). Giving up Twitter for Lent?: How and why we take breaks from social media. CHI'14 (pp. 773--782).  ",
      "doi": "10.1145/2556288.2556983"
    },
    {
      "text": "Steiner-Adair, C. & Barker, T.H. (2013). The big disconnect: Protecting childhood and family relationships in the digital age. Harper Business. ",
      "doi": "10.5555/2564820"
    },
    {
      "text": "Svenson, O. (1981). Are we all less risky and more skillful than our fellow drivers' Acta Psychologica, 47(2), 143--148.",
      "doi": ""
    },
    {
      "text": "Tummala-Narra, P. (2009). Contemporary impingements on mothering. The American Journal of Psychoanalysis, 69, 4--21.",
      "doi": ""
    },
    {
      "text": "Turkle, S. (2011). Alone Together: Why We Expect More from Technology and Less from Each Other. Basic books. ",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Wall, G. (2010). Mothers' experiences with intensive parenting and brain development discourse. Womens Stud Int Forum, 33(3), 253--263.",
      "doi": ""
    },
    {
      "text": "Worthen, B. (2012). The Perils of Texting While Parenting. The Wall Street Journal.",
      "doi": ""
    }
  ]
}