{
  "doi": "10.1145/2702123.2702478",
  "title": "TUIkit: Evaluating Physical and Functional Experiences of Tangible User Interface Prototypes",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1267-1276",
  "year": 2015,
  "badges": [],
  "abstract": "This paper describes TUIkit, a new method for evaluating both physical and functional experiences of users with early TUI prototypes. By means of a study to evaluate interactive dice prototypes, TUIkit's appropriateness for tracing the effect of different physical attributes (e.g. shape, size, weight, material, texture) on the functional and thus overall user experience was investigated. The results show that separating physical and functional experiences first and joining these afterwards, enhanced the evaluation of TUI prototypes. By applying this approach, participants became more aware of how they physically experienced the prototypes, rather than focusing solely on the functional value of the prototypes. This awareness supports earlier studies that suggest that TUIs consist of more than just interaction, and that form and materiality has a strong impact on their user experience. Finally, we suggest some future adjustments of the TUIkit method.",
  "authors": [
    {
      "name": "Jorick Vissers",
      "institution": "iMinds / KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259380357",
      "orcid": "missing"
    },
    {
      "name": "David Geerts",
      "institution": "iMinds / KU Leuven, Leuven, Belgium",
      "img": "/do/10.1145/contrib-81311483568/rel-imgonly/david2.jpg",
      "acmid": "81311483568",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Antle, A. N. (2008). Inquiring materials for tangible prototyping. In Proceedings of the 2nd International Conference on Tangible and Embedded Interaction (pp. 139--140). Presented at the TEI'08, Bonn, Germany: ACM.  ",
      "doi": "10.1145/1347390.1347420"
    },
    {
      "text": "Baskinger, M., & Gross, M. (2010, February). Tangible interaction = form + computing. Interactions, 17(1), 6--11.  ",
      "doi": "10.1145/1649475.1649477"
    },
    {
      "text": "Buxton, B. (2007). Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Doering, T. (n.d.). Material-centered design and evaluation of tangible user interfaces. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (pp. 437--438). Presented at the TEI'11, New York, NY: ACM.  ",
      "doi": "10.1145/1935701.1935819"
    },
    {
      "text": "Doering, T., Sylvester, A., & Schmidt, A. (May 5-10). Exploring material-centered design concepts for tangible interaction. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (pp. 1523--1528). Presented at the CHI EA '12, Austin, Texas: ACM.  ",
      "doi": "10.1145/2212776.2223666"
    },
    {
      "text": "Fallman, D., & Waterworth, J. (2005). Dealing with user experience and affective evaluation in hci design: A repertory grid approach. In CHI'05 Workshop on Evaluating Affective Interfaces - Innovative Approaces. Presented at the CHI'05, Portland.",
      "doi": ""
    },
    {
      "text": "Flatters, I. J., Otten, L., Witvliet, A., Henson, B., Holt, R. J., Culmer, P., -- Mon-Williams, M. (2012). Predicting the Effect of Surface Texture on the Qualitative Form of Prehension. PLOS one, 7(3).",
      "doi": ""
    },
    {
      "text": "Fuchsberger, V., Murer, M., & Tscheligi, M. (2013). Materials, materiality, and media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 2853--2862). Presented at the CHI '13, Paris, France: ACM.  ",
      "doi": "10.1145/2470654.2481395"
    },
    {
      "text": "Gross, S., Bardzell, J., & Bardzell, S. (2014). Structures, Forms, and Stuff: The Materiality and Medium of Interaction. Personal Ubiquitous Comput., 18(3), 637--649.  ",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Heller, F., & Borchers, J. (2012). Physical prototyping of an on-outlet power-consumption display. Interactions, 19(1), 14--17.  ",
      "doi": "10.1145/2065327.2065332"
    },
    {
      "text": "Hornecker, E., & Psik, T. (2005). Using ARToolKit markers to build tangible prototypes and simulate other technologies. In Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (pp. 30--42). Presented at the INTERACT'05, Rome, Italy: Springer-Verlag.  ",
      "doi": "10.1007/11555261_6"
    },
    {
      "text": "Ishii, H. (2008, June). The tangible user interface and its evolution. Communications of the ACM - Organic user interfaces, 51(6), 32--36.  ",
      "doi": "10.1145/1349026.1349034"
    },
    {
      "text": "Jung, H., & Stolterman, E. (2011). Form and materiality in interaction design: a new approach to HCI. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (pp. 399--408). Presented at the CHI EA '11, Vancouver, BC, Canada: ACM.  ",
      "doi": "10.1145/1979742.1979619"
    },
    {
      "text": "Kelly, G. A. (1963). A Theory of Personality: The Psychology of Personal Constructs. W. W. Norton & Company.",
      "doi": ""
    },
    {
      "text": "Kimura, H., Tokunaga, E., Okuda, Y., & Nakajima, T. (2006). CookieFlavors: easy building blocks for wireless tangible input. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (pp. 965--970). Presented at the CHI'06, Montréal, Québec, Canada: ACM.  ",
      "doi": "10.1145/1125451.1125637"
    },
    {
      "text": "Klemmer, S. R., Li, Z., Lin, J., & Landay, J. A. (2004). Papier-Mache: toolkit support for tangible input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 399--406). Presented at the CHI'04, Vienna, Austria: ACM.  ",
      "doi": "10.1145/985692.985743"
    },
    {
      "text": "Lewis, C. (1982). Using the \"thinking Aloud\" Method in Cognitive Interface Design. IBM T.J. Watson Research Center.",
      "doi": ""
    },
    {
      "text": "Mellis, D., Follmer, S., Hartmann, B., Buechley, L., & Gross, M. D. (2013). FAB at CHI: digital fabrication tools, design, and community. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (pp. 3307--3310). Presented at the CHI'13, Paris, France: ACM.  ",
      "doi": "10.1145/2468356.2479673"
    },
    {
      "text": "Mota, C. (2011). The rise of personal fabrication. In Proceedings of the 8th ACM Conference on Creativity and Cognition (pp. 279--288). Presented at the C&C '11, Atlanta, Georgia, USA: ACM.  ",
      "doi": "10.1145/2069618.2069665"
    },
    {
      "text": "Norman, D. A. (1999, June). Affordance, conventions, and design. Interactions, 6(3), 38--43.  ",
      "doi": "10.1145/301153.301168"
    },
    {
      "text": "Provost, G., & Robert, J. (2013). The dimensions of positive and negative user experiences with interactive products. 2nd conference on Design, User Experience, and Usability: design philosophy, methods, and tools, I, pp. 399--408.  ",
      "doi": "10.1007/978-3-642-39229-0_43"
    },
    {
      "text": "Rosner, D. K. (n.d.). The material practices of collaboration. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (pp. 1155--1164). Presented at the CSCW '12, Seattle, WA, USA: ACM.  ",
      "doi": "10.1145/2145204.2145375"
    },
    {
      "text": "Sartori, L., Straulino, E., Castiello, U., & Avenanti, A. (2011). How Objects Are Grasped: The Interplay between Affordances and End-Goals. PLOS One, 6(9).",
      "doi": ""
    },
    {
      "text": "Schmid, M., Rümelin, S., & Richter, H. (2013). Empowering materiality: inspiring the design of tangible interactions. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (pp. 91--98). Presented at the TEI '13, Barcelona, Spain: ACM.  ",
      "doi": "10.1145/2460625.2460639"
    },
    {
      "text": "Shaer, O., & Hornecker, E. (2010). Tangible User Interfaces: Past, Present, and Future Directions. Foundations and Trends in Human-Computer Interaction, 3(1--2), 1--137.  ",
      "doi": "10.1561/1100000026"
    },
    {
      "text": "Sharlin, E., Watson, B., Kitamura, Y., Kishino, F., & Itoh, Y. (2004). On tangible user interfaces, humans and spatiality. Personal and Ubiquitous Computing, 8(5), 338--346.  ",
      "doi": "10.1007/s00779-004-0296-5"
    },
    {
      "text": "Wiethoff, A., Schneider, H., Küfner, J., Rohs, M., Butz, A., & Greenberg, S. (2013). Paperbox: a toolkit for exploring tangible interaction on interactive surfaces. In Proceedings of the 9th ACM Conference on Creativity & Cognition Pages 64--73 (pp. 64--73). Presented at the C&C'13, Sydney, NSW, Australia: ACM.  ",
      "doi": "10.1145/2466627.2466635"
    },
    {
      "text": "Wiethoff, A., Schneider, H., Rohs, M., Butz, A., & Greenberg, S. (2012). Sketch-a-TUI: low cost prototyping of tangible interactions using cardboard and conductive ink. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (pp. 309--312). Presented at the TEI'12, Kingston, Ontario, Canada: ACM.  ",
      "doi": "10.1145/2148131.2148196"
    },
    {
      "text": "Xu, D., Read, J. C., & Sheehan, R. (2008). In search of tangible magic. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction (Vol. 2, pp. 97--100). Presented at the BCS-HCI '08, Como, Italy: British Computer Society Swinton, UK. ",
      "doi": "10.5555/1531826.1531850"
    }
  ]
}