{
  "doi": "10.1145/2702123.2702410",
  "title": "\"Is it Weird to Still Be a Virgin\": Anonymous, Locally Targeted Questions on Facebook Confession Boards",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2613-2622",
  "year": 2015,
  "badges": [],
  "abstract": "People have long sought answers to questions online, typically using either anonymous or pseudonymous forums or social network platforms that primarily use real names. Systems that allow anonymous communication afford freedom to explore identity and discuss taboo topics, but can result in negative disinhibited behavior such as cyberbullying. Identifiable communication systems allows one to reach a known audience and avoid negative disinhibition, but can constrain behavior with concerns about privacy and reputation. One persistent design issue is understanding how to leverage the benefits of anonymity without suffering its drawbacks. This paper presents a case study analysis of question asking on Facebook confession boards (FCBs), a tool popular on some college campuses. FCBs present a unique configuration in which members of an offline community (e.g., a university) anonymously submit content to a moderator who posts it to a Facebook page where others in the community can view it and respond. Response is via identifiable Facebook comments and likes. Our results show users asking about taboo and stigmatized topics with local others, and receiving relevant responses with little cyberbullying or negativity.",
  "tags": [
    "facebook",
    "anonymity",
    "social support",
    "identity"
  ],
  "authors": [
    {
      "name": "Jeremy Birnholtz",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100651315",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Aaron Ross Merola",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659562516",
      "orcid": "missing"
    },
    {
      "name": "Arindam Paul",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704993",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bargh, J. A., McKenna, K. Y. and Fitzsimons, G. M. Can you see the real me? Activation and expression of the \"true self\" on the Internet. J. of Social Issues, 58, 1 (2002), 33--48.",
      "doi": ""
    },
    {
      "text": "Baxter, L. A. and Wilmot, W. W. Taboo topics in close relationships. J. of Social and Personal Relationships, 2,3. (1985), pp. 253--269.",
      "doi": ""
    },
    {
      "text": "Bounds, A. 'Confessions': anonymous Facebook pages gain popularity among Boulder high school, college students. Retrieved from: http://www.huffingtonpost.com/2013/03/27/confessions -facebook-page-cu-boulder-students_n_2962252.html",
      "doi": ""
    },
    {
      "text": "Chicago, C. \"Yik Yak\" app disabled in Chicago after schools warn of cyberbullying danger. Retrieved from: http://chicago.cbslocal.com/2014/03/06/schools-warnof-cyberbullying-danger-from-new-yik-yak-app/",
      "doi": ""
    },
    {
      "text": "Ellison, N., Steinfield, C. and Lampe, C. The benefits of Facebook \"friends:\" Social capital and college students' use of online social network sites. JCMC, 12, 2 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Ellison, N. B. and boyd, d. m. Sociality through social network sites. In W. H. Dutton, ed. The Oxford Handbook of Internet Studies. Oxford Press, 2013.",
      "doi": ""
    },
    {
      "text": "Fisher, D., Smith, M. and Welser, H. T. You are who you talk to: detecting roles in Usenet newsgroups. In Proc. HICSS (2006), 59b.  ",
      "doi": "10.1109/HICSS.2006.536"
    },
    {
      "text": "Goffman, E. The presentation of self in everyday life. Anchor Books, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Goffman, E. Stigma: notes on the management of spoiled identity. Prentice-Hall, Englewood Cliffs, N.J. , 1963.",
      "doi": ""
    },
    {
      "text": "Goodwin, R. and Lee, I. Taboo Topics among Chinese and English Friends A Cross-Cultural Comparison. J. of cross-cultural psychology, 25, 3 (1994), pp. 325--338.",
      "doi": ""
    },
    {
      "text": "Gray, R., Ellison, N., Lampe, C. and Vitak, J. Who wants to know? question-asking and answering practices among Facebook users. In Proc. CSCW (2013), 12131224.  ",
      "doi": "10.1145/2441776.2441913"
    },
    {
      "text": "Hargittai, E. and Hsieh, Y. P. Predictors and consequences of differentiated practices and social network sites. Information, Communication & Society, 13, 4 (2010), pp. 515--536.",
      "doi": ""
    },
    {
      "text": "National Survey on Drug Use and Health. Nonmedical Use of Adderall® among Full-Time College Students. Retrieved from: http://www.samhsa.gov/data/2k9/adderall/adderall.htm",
      "doi": ""
    },
    {
      "text": "Huang, J. J., Chang, S. C. and Hu, S. Y. Searching for answers via social networks. In Proc. IEEE CCNC (2008), 289--293.",
      "doi": ""
    },
    {
      "text": "Johnson, S. E., Richeson, J. and Finkel, E. J. Middle class and marginal? socioeconomic status, stigma, and self-regulation at an elite university. J. of Personality and Social Psychology, 100(2011), 838--852.",
      "doi": ""
    },
    {
      "text": "Joinson, A. N. Disinhibition and the Internet. In J. Gackenbach, ed. Psychology and the Internet: Intrapersonal, interpersonal, and transpersonal implications. 2007.",
      "doi": ""
    },
    {
      "text": "Le Bon, G. The crowd: A study of the popular mind. MacMillan, London, UK, 1897.",
      "doi": ""
    },
    {
      "text": "Litt, E. Knock, Knock. Who's There? The Imagined Audience. Journal of Broadcasting & Electronic Media, 56, 3 (2012), 330--345.",
      "doi": ""
    },
    {
      "text": "Mamykina, L., Manoim, B., Mittal, M., Hripcsak, G. and Hartmann, B. Design lessons from the fastest q&a site in the west. In Proc. CHI (2011), pp. 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Mohamed, A. Ontario school board wants Facebook to remove anonymous \"confessions\" page. Retrieved from: https://ca.news.yahoo.com/blogs/dailybrew/ontarioschool-board-wants-facebook-remove-anonymousconfessions-200348526.html",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Teevan, J. and Panovich, K. What do people ask their social networks, and why?: a survey study of status message q&a behavior. In Proc. CHI (2010), 1739--1748.  ",
      "doi": "10.1145/1753326.1753587"
    },
    {
      "text": "Nilizadeh, S., Alam, N., Husted, N. and Kapadia, A. Pythia: a privacy aware, peer-to-peer network for social search. In Proc. WPES (2011), 43--48.  ",
      "doi": "10.1145/2046556.2046562"
    },
    {
      "text": "O'Sullivan, P. B. and Flanagin, A. J. Reconceptualizing \"flaming\" and other problematic messages. New Media Soc, 5, 1 (2003), 69--94.",
      "doi": ""
    },
    {
      "text": "Oeldorf-Hirsch, A., Hecht, B., Morris, M. R., Teevan, J. and Gergle, D. To search or to ask: the routing of information needs between traditional search engines and social networks. In Proc. CSCW (2014), pp. 16--27.  ",
      "doi": "10.1145/2531602.2531706"
    },
    {
      "text": "Peesapati, S. T., Schultz, J., Lepage, M., Jeong, S. and Cosley, D. Pensieve: supporting everyday reminiscence. In Proc. CHI (2010), 2027--2036.  ",
      "doi": "10.1145/1753326.1753635"
    },
    {
      "text": "Priedhorsky, R., Masli, M. and Terveen, L. Eliciting and focusing geographic volunteer work. In Proc. CSCW (2010), 61--70.  ",
      "doi": "10.1145/1718918.1718931"
    },
    {
      "text": "Pullen, M. Law enforcement warns about dangers of Yik Yak app. Retrieved from: http://www.wjtv.com/story/24958821/law-enforcementwarns-about-dangers-of-yik-yak-app",
      "doi": ""
    },
    {
      "text": "Stuart, C., Dabbish, L., Kiesler, S., Kinnaird, P. and Kang, R. Social transparency in networked information exchange: a theoretical framework. In Proc. CSCW (2012), 451--460.  ",
      "doi": "10.1145/2145204.2145275"
    },
    {
      "text": "Suler, J. The online disinhibition effect. Cyberpsychology & Behavior, 7, 3 (2004), 321--326.",
      "doi": ""
    },
    {
      "text": "Turkle, S. Life on the screen : identity in the age of the Internet. Simon & Schuster, New York, 1995. ",
      "doi": "10.5555/526517"
    },
    {
      "text": "Wang, G., Gill, K., Mohanlal, M., Zheng, H. and Zhao, B. Y. Wisdom in the social crowd: an analysis of quora. In Proc. WWW, (2013) pp. 1341--1352. ",
      "doi": "10.1145/2488388.2488506"
    },
    {
      "text": "Whittaker, E. and Kowalski, R. Cyberbullying via social media. Journal of School Violence(in press).",
      "doi": ""
    },
    {
      "text": "Whittaker, S., Terveen, L., Hill, W. and Cherny, L. The dynamics of mass interaction. In Proc. CSCW (1998), 257--264.  ",
      "doi": "10.1145/289444.289500"
    },
    {
      "text": "Woo, J. The right not to be identified: privacy and anonymity in the interactive media environment. New Media Soc, 8, 7 (2006), pp. 949--967.",
      "doi": ""
    },
    {
      "text": "Zimmer, M. \"But the data is already public\": on the ethics of research in Facebook. Ethics and Information Technology, 12, 4 (2010), 313--325.  ",
      "doi": "10.1007/s10676-010-9227-5"
    }
  ]
}