{
  "doi": "10.1145/2702123.2702163",
  "title": "The Royal Corgi: Exploring Social Gaze Interaction for Immersive Gameplay",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "115-124",
  "year": 2015,
  "badges": [],
  "abstract": "The eyes are a rich channel for non-verbal communication in our daily interactions. We propose social gaze interaction as a game mechanic to enhance user interactions with virtual characters. We develop a game from the ground-up in which characters are designed to be reactive to the player's gaze in social ways, such as getting annoyed when the player seems distracted or changing their dialogue depending on the player's apparent focus of attention. Results from a qualitative user study provide insights about how social gaze interaction is intuitive for users, elicits deep feelings of immersion, and highlight the players' self-consciousness of their own eye movements through their strong reactions to the characters.",
  "tags": [
    "games",
    "eye tracking",
    "virtual agents",
    "immersion"
  ],
  "authors": [
    {
      "name": "Melodie Vidal",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488666558",
      "orcid": "missing"
    },
    {
      "name": "Remi Bismuth",
      "institution": "ISART Digital, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658678415",
      "orcid": "missing"
    },
    {
      "name": "Andreas Bulling",
      "institution": "Max Planck Institute for Informatics, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-81372593219/rel-imgonly/portraet_cut.jpg",
      "acmid": "81372593219",
      "orcid": "0000-0001-6317-7303"
    },
    {
      "name": "Hans Gellersen",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616827",
      "orcid": "0000-0003-2233-2121"
    }
  ],
  "references": [
    {
      "text": "Argyle, M., and Cook, M. Gaze and mutual gaze. Cambridge University Press Cambridge, Eng. ; New York, 1976.",
      "doi": ""
    },
    {
      "text": "Bee, N., Wagner, J., André, E., Vogt, T., Charles, F., Pizzi, D., and Cavazza, M. Discovering eye gaze behavior during human-agent conversation in an interactive storytelling application. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (2010), 9:1--9:8.  ",
      "doi": "10.1145/1891903.1891915"
    },
    {
      "text": "Castiello, U. Understanding other people's actions: Intention and attention. Journal of Experimental Psychology: Human Perception and Performance 29 (2003), 416--430.",
      "doi": ""
    },
    {
      "text": "Das, D., Rashed, M. G., Kobayashi, Y., and Kuno, Y. Recognizing gaze pattern for human robot interaction. In Proc. of HRI (2014), 142--143.  ",
      "doi": "10.1145/2559636.2559818"
    },
    {
      "text": "Dorr, M., Böhme, M., Martinetz, T., and Barth, E. Gaze beats mouse: A case study. In The 3rd Conference on Communication by Gaze Interaction (COGAIN 2007) (2007), 16--19.",
      "doi": ""
    },
    {
      "text": "Eichner, T., Prendinger, H., André, E., and IshizUnited Kingdoma, M. Attentive presentation agents. In Proc. of the 7th International Conference on Intelligent Virtual Agents (2007), 283--295.  ",
      "doi": "10.1007/978-3-540-74997-4_26"
    },
    {
      "text": "Emery, N. J. The eyes have it: the neuroethology, function and evolution of social gaze. Neuroscience and Biobehavioural Reviews 24 (2000), 581--604.",
      "doi": ""
    },
    {
      "text": "Frischen, A., Bayliss, A. P., and Tipper, S. P. Gaze cueing of attention: visual attention, social cognition, and individual differences. Psychological bulletin 133 (2007).",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Beaver, J., and Benford, S. Ambiguity as a resource for design. In Proc. of CHI (2003), 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Grynszpan, O., Simonin, J., Martin, J.-C., and Nadel, J. Investigating social gaze as an action-perception online performance. Frontiers in Human Neuroscience 6, 94 (2012).",
      "doi": ""
    },
    {
      "text": "Hillaire, S., Lécuyer, A., Cozot, R., and Casiez, G. Using an eye-tracking system to improve camera motions and depth-of-field blur effects in virtual environments. In VR (2008), 47--50.",
      "doi": ""
    },
    {
      "text": "Ishii, R., Nakano, Y. I., and Nishida, T. Gaze awareness in conversational agents: Estimating a user's conversational engagement from eye gaze. ACM Trans. Interact. Intell. Syst. 3, 2 (Aug. 2013), 11:1--11:25.  ",
      "doi": "10.1145/2499474.2499480"
    },
    {
      "text": "Isokoski, P., Joos, M., Spakov, O., and Martin, B. Gaze controlled games. Universal Access in the Information Society 8, 4 (Oct. 2009), 323--337.  ",
      "doi": "10.1007/s10209-009-0146-3"
    },
    {
      "text": "Istance, H., Hyrskykari, A., Vickers, S., and Chaves, T. For your eyes only: Controlling 3d online games by eye-gaze. In Proc. of INTERACT (2009), 314--327.  ",
      "doi": "10.1007/978-3-642-03655-2_36"
    },
    {
      "text": "Jönsson, E. If looks could kill - An Evaluation of Eye Tracking in Computer Games. Master's thesis, KTH Royal Institute of Technology, Sweden, 2005.",
      "doi": ""
    },
    {
      "text": "Kleinke, C. L. Gaze and eye contact: a research review. Psychological bulletin (1986).",
      "doi": ""
    },
    {
      "text": "Kobayashi, Y., Shibata, T., Hoshi, Y., Kuno, Y., Okada, M., and Yamazaki, K. Choosing answerers by observing gaze responses for museum guide robots. In Proc. of HRI (2010), 109--110. ",
      "doi": "10.5555/1734454.1734496"
    },
    {
      "text": "Kumar, M., Paepcke, A., and Winograd, T. Eyepoint: Practical pointing and selection using gaze and keyboard. In Proc. of CHI (2007), 421--430.  ",
      "doi": "10.1145/1240624.1240692"
    },
    {
      "text": "Lahiri, U., Warren, Z., and Sarkar, N. Design of a gaze-sensitive virtual social interactive system for children with autism. Neural Systems and Rehabilitation Engineering, IEEE Transactions on 19, 4 (Aug 2011), 443--452.",
      "doi": ""
    },
    {
      "text": "Mollenbach, E., Hansen, J., and Lillholm, M. Eye movements in gaze interaction. Journal of Eye Movement Research 6(2) (2013), 1--15.",
      "doi": ""
    },
    {
      "text": "Muñoz, J., Yannakakis, G. N., Mulvey, F., Hansen, D. W., Gutierrez, G., and Sanchis, A. Towards Gaze-Controlled Platform Games. In Proc. of IEEE Conference on Computational Intelligence and Games (2011).",
      "doi": ""
    },
    {
      "text": "Nacke, L. E., Kalyn, M., Lough, C., and Mandryk, R. L. Biofeedback game design: Using direct and indirect physiological control to enhance game interaction. In Proc. of CHI (2011), 103--112.  ",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Ruhland, K., Andrist, S., Badler, J. B., Peters, C. E., Badler, N. I., Gleicher, M., Mutlu, B., and McDonnell, R. Look me in the Eyes: A Survey of Eye and Gaze Animation for Virtual Agents and Artificial Systems. In EG 2014 - STARs, Eurographics Association (2014), 69--91.",
      "doi": ""
    },
    {
      "text": "Smith, J. D., and Graham, T. C. N. Use of eye movements for video game control. In Proc. of ACE (2006).  ",
      "doi": "10.1145/1178823.1178847"
    },
    {
      "text": "Stellmach, S., and Dachselt, R. Designing gaze-based user interfaces for steering in virtual environments. In Proc. of ETRA (2012), 131--138.  ",
      "doi": "10.1145/2168556.2168577"
    },
    {
      "text": "Stellmach, S., and Dachselt, R. Investigating gaze-supported multimodal pan and zoom. In Proc. of ETRA (2012), 357--360.  ",
      "doi": "10.1145/2168556.2168636"
    },
    {
      "text": "Sweetser, P., and Wyeth, P. Gameflow: A model for evaluating player enjoyment in games. Computers in Entertainment 3, 3 (July 2005), 3--3.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Turner, J., Bulling, A., Alexander, J., and Gellersen, H. Cross-device gaze-supported point-to-point content transfer. In Proc. of ETRA (2014), 19--26.  ",
      "doi": "10.1145/2578153.2578155"
    },
    {
      "text": "Vertegaal, R., Weevers, I., Sohn, C., and Cheung, C. Gaze-2: Conveying eye contact in group video conferencing using eye-controlled camera direction. In Proc. of CHI (2003), 521--528.  ",
      "doi": "10.1145/642611.642702"
    },
    {
      "text": "Wetzel, S., Spiel, K., and Bertel, S. Dynamically adapting an ai game engine based on players' eye movements and strategies. In Proc. of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (2014), 3--12.  ",
      "doi": "10.1145/2607023.2607029"
    },
    {
      "text": "Yang, R., and Zhang, Z. Eye gaze correction with stereovision for video-teleconferencing. In Proc. of ECCV (2002), 479--494. ",
      "doi": "10.5555/645316.649219"
    }
  ]
}