{
  "doi": "10.1145/2702123.2702509",
  "title": "ModelTracker: Redesigning Performance Analysis Tools for Machine Learning",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "337-346",
  "year": 2015,
  "badges": [],
  "abstract": "Model building in machine learning is an iterative process. The performance analysis and debugging step typically involves a disruptive cognitive switch from model building to error analysis, discouraging an informed approach to model building. We present ModelTracker, an interactive visualization that subsumes information contained in numerous traditional summary statistics and graphs while displaying example-level performance and enabling direct error examination and debugging. Usage analysis from machine learning practitioners building real models with ModelTracker over six months shows ModelTracker is used often and throughout model building. A controlled experiment focusing on ModelTracker's debugging capabilities shows participants prefer ModelTracker over traditional tools without a loss in model performance.",
  "authors": [
    {
      "name": "Saleema Amershi",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323487634",
      "orcid": "missing"
    },
    {
      "name": "Max Chickering",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381592935",
      "orcid": "missing"
    },
    {
      "name": "Steven M. Drucker",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090466",
      "orcid": "0000-0002-5022-9343"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Patrice Simard",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100027001",
      "orcid": "missing"
    },
    {
      "name": "Jina Suh",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705846",
      "orcid": "0000-0002-7646-5563"
    }
  ],
  "references": [
    {
      "text": "Ankerst, M., Elsen, C., Ester, M., and Kriegal, H. Visual Classification: An Interactive Approach to Decision Tree Construction. Proc. KDD 1999, ACM Press (1999), 392--396.  ",
      "doi": "10.1145/312129.312298"
    },
    {
      "text": "Becker, B., Kohavi, R., and Sommerfield, D. Visualizing the Simple Bayesian Classifier. Information Visualization in Data Mining and Knowledge Discovery. Fayyad, U., Grinstein, G.G., and Wierse, A. (eds). Morgan Kaufmann Publishers, 2001, 237--249. ",
      "doi": "10.5555/383784.383809"
    },
    {
      "text": "Bird, S., Klein, E., and Loper, E. Natural Language Processing with Python. O'Reilly Media, 2009. ",
      "doi": "10.5555/1717171"
    },
    {
      "text": "Broekens, J., Cocx, T., and Kosters, W. Object-Centered Interactive Multi-Dimensional Scaling: Ask the Expert. Proc. BNAIC 2006, 59--66.",
      "doi": ""
    },
    {
      "text": "Caragea, D., Cook, D., and Honavar, V. Gaining Insights into Support Vector Machine Pattern Classifiers Using Projection-Based Tour Methods. Proc. KDD 2001, ACM Press (2001), 251--256.  ",
      "doi": "10.1145/502512.502547"
    },
    {
      "text": "Chan, Y., Correa, C., and Ma, K-L. Flow-based Scatterplots for Sensitivity Analysis. Proc. VAST 2010, IEEE (2010), 43--50.",
      "doi": ""
    },
    {
      "text": "Choo, J., Hanseung, L., Liu, Z., Stasko, J., and Park, H. An Interactive Visual Testbed System for Dimension Reduction and Clustering of Large-Scale HighDimensional Data. Proc. SPIE Electronic Imaging 2013, 865402-865402-15.",
      "doi": ""
    },
    {
      "text": "Domingos, P. A Few Useful Things to Know about Machine Learning. CACM 55, 10 (2012), 78--87.  ",
      "doi": "10.1145/2347736.2347755"
    },
    {
      "text": "Fails, J.A. and Olsen, D.R. Interactive Machine Learning. Proc. IUI 2003, ACM Press (2003), 39--45.  ",
      "doi": "10.1145/604045.604056"
    },
    {
      "text": "Fiebrink, R., Cook, P.R., and Trueman, D. Human Model Evaluation in Interactive Supervised Learning. Proc. CHI 2011, ACM Press (2011), 147--156.  ",
      "doi": "10.1145/1978942.1978965"
    },
    {
      "text": "Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P., and Witten, I.H. The WEKA Data Mining Software: An Update. SIGKDD Explorations 11, 1 (2009).  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Hao, M.C., Dayal, U., Sharma, R.K., Keim, D.A., and Janetzko, H. Variable Binned Scatter Plots. Information Visualization 9, 3 (2010), 194--203.  ",
      "doi": "10.1057/ivs.2010.4"
    },
    {
      "text": "MATLAB 9.0 and Statistics Toolbox Release 2014a, The MathWorks, Inc., Natick, Massachusetts, USA, http://www.mathworks.com/products/statistics, 2014.",
      "doi": ""
    },
    {
      "text": "Mayorga, A. and Gleicher, M. Scatterplots: Overcoming Overdraw in Scatter Plots. IEEE TVCG 19, 9 (2013), 1526--1538.  ",
      "doi": "10.1109/TVCG.2013.65"
    },
    {
      "text": "Nettleton, D. F., Orriols-Puig, A., and Fornells, A. A Study of the Effect of Different Types of Noise on the Precision of Supervised Learning Techniques. AI Review 33, 4 (2010), 275--306.  ",
      "doi": "10.1007/s10462-010-9156-z"
    },
    {
      "text": "Patel, K., Bancroft, N., Drucker, S.M., Fogarty, J., Ko, A., and Landay, J.A. Gestalt: Integrated Support for Implementation and Analysis in Machine Learning Processes. Proc. UIST 2010, ACM Press (2010), 37--46.  ",
      "doi": "10.1145/1866029.1866038"
    },
    {
      "text": "Patel, K., Drucker, S.M., Fogarty, J., Kapoor, A., and Tan, D.S. Using Multiple Models to Understand Data Proc. IJCAI 2011, AAAI Press (2011), 1723--1728.  ",
      "doi": "10.5555/2283516.2283682"
    },
    {
      "text": "Patel, K., Fogarty, J., Landay, J.A., and Harrison, B. Examining Difficulties Software Developers Encounter in the Adoption of Statistical Machine Learning. Proc. AAAI 2008, AAAI Press (2008), 1563--1566. ",
      "doi": "10.5555/1620270.1620333"
    },
    {
      "text": "R Core Team, \"R: A Language and Environment for Statistical Computing,\" R Foundation for Statistical Computing, http://www.R-project.org, 2013.",
      "doi": ""
    },
    {
      "text": "Rossi, F. Visual Data Mining and Machine Learning Proc. ESANN 2006, 251--264.",
      "doi": ""
    },
    {
      "text": "Simard, P., Chickering, D., Lakshmiratan, A., Charles, D., Bottou, L., Suarez, C.G.J., Grangier, D., Amershi, S., Verwey, J., and Suh, J. ICE: Enabling Non-Experts to Build Models Interactively for Large-Scale Lopsided Problems. 2014, arXiv:1409.4814.",
      "doi": ""
    },
    {
      "text": "Talbot, J., Lee, B., Kapoor, A., and Tan, D. EnsembleMatrix: Interactive Visualization to Support Machine Learning with Multiple Classifiers. Proc. CHI 2009, ACM Press (2009), 1283--1292.  ",
      "doi": "10.1145/1518701.1518895"
    }
  ]
}