{
  "doi": "10.1145/2702123.2702449",
  "title": "Practice-based Design of a Neighborhood Portal: Focusing on Elderly Tenants in a City Quarter Living Lab",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2295-2304",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper contributes to the current discourse on practice-based research in HCI paying particular attention to the overall temporal and situational conditions which frame an R&D project. We present a Living Lab study situated in an arbitrary neighborhood of a German city which develops ICT support to foster informal help and social interaction with a special, but not exclusive, focus on elderly tenants. We demonstrate that practice-based, long-term research in a city quarter goes beyond those challenges already described in the current Living Lab and PD literature. The long-term study's positioning in a real-world context is contoured not only by a high diversity of stakeholders and their individual interests and motivation for participation but also by their individual skill sets and learning needs. These distinct and often contradictive perspectives have to be permanently counterbalanced. Thus attention has to be focused on how related strategies and decisions impact on the design of the project as well as on the final ICT product. To enable all tenants, irrespective of age and technical skill, to participate in a long-term ICT-based community development project, we applied the format of 'experience-based PD workshops' to foster confidence in ICT usage and encourage the competency of the elderly and non-tech-savvy tenants.",
  "tags": [
    "practice",
    "living lab",
    "action research",
    "elderly people",
    "methodology",
    "participatory design",
    "city quarter"
  ],
  "authors": [
    {
      "name": "Claudia Müller",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659489824",
      "orcid": "missing"
    },
    {
      "name": "Dominik Hornung",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658630578",
      "orcid": "missing"
    },
    {
      "name": "Theodor Hamm",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658698996",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Almirall, E. and Wareham, J. Living Labs and Open Innovation: Roles and Applicability. The Electronic Journal for for Virtual Organizations and Networks 10, 3 (2008), 21--46.",
      "doi": ""
    },
    {
      "text": "Bergvall-Kåreborn, B., Ihlström Eriksson, C., Ståhlbröst, A., Svensson, J. A Milieu for Innovation -- Defining Living Labs. 2nd ISPIM Innovation Symposium, (2009), 6--9.",
      "doi": ""
    },
    {
      "text": "Binder, T., Michelis, G. De, and Ehn, P. What's the Object of Design? Proc. of CHI'12, (2012), 21--30.  ",
      "doi": "10.1145/2212776.2212780"
    },
    {
      "text": "Brandt, E., Binder, T., Malmborg, L., and Sokoler, T. Communities of everyday practice and situated elderliness as an approach to co-design for senior interaction. Proc. of OZCHI '10, (2010), 400--403.  ",
      "doi": "10.1145/1952222.1952314"
    },
    {
      "text": "Briggs, P., Olivier, P., and Kitson, J. Film as Invisible Design: The example of the Biometric Daemon. Proc. of CHI '09 EA, (2009), 3511.  ",
      "doi": "10.1145/1520340.1520517"
    },
    {
      "text": "Bucciarelli, L. An ethnographic perspective on engineering design. Design Studies 9, 3 (1988), 159--168.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. and Rosson, M.B. Participatory design in community informatics. Design Studies 28, 3 (2007), 243--261.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Hemmings, T., Rodden, T., et al. Designing with Care: Adapting Cultural Probes to Inform Design in Sensitive Settings. Proc. of OZCHI '03, (2003), 4--13.",
      "doi": ""
    },
    {
      "text": "Crabtree, A. Ethnography in participatory design. Proc. of the 1998 PDC (1998).",
      "doi": ""
    },
    {
      "text": "Dachtera, J., Randall, D., and Wulf, V. Research on Research: Design Research at the Margins: Academia, Industry and End-Users. Proc. of CHI '14, (2014), 713--722.  ",
      "doi": "10.1145/2556288.2557261"
    },
    {
      "text": "Dalsgaard, P. Aligning research and external stakeholder agendas in collaborative interaction design projects. Proc. of OZCHI '10, (2010), 392--395.  ",
      "doi": "10.1145/1952222.1952311"
    },
    {
      "text": "Fischer, G. Symmetry of Ignorance, Social Creativity, and Meta-Design. Knowledge-Based Systems 13, 7 (2000), 527--537.",
      "doi": "10.1016/S0950-7051%2800%2900065-4"
    },
    {
      "text": "Flick, U., von Kardorff, E., and Steinke, I. A Companion to Qualitative Research. Sage, London, 2004.",
      "doi": ""
    },
    {
      "text": "Følstad, A. Living Labs for Innovation and Development of Information and Communication Technology: A Literature Review. eJOV 10, August (2008), 99--131.",
      "doi": ""
    },
    {
      "text": "Foth, M. Analyzing the Factors Influencing the Successful Design and Uptake of Interactive Systems to Support Social Networks in Urban Neighborhoods. International Journal of Technology and Human Interaction 2, 2 (2006), 65--81.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T., and Pacenti, E. Design: Cultural Probes. Interactions 6, Jan./Feb. (1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Hayes, G.R. The Relationship of Action Research to Human Computer Interactoin. ACM TOCHI 18, 3 (2011), 20 pages.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Hlauschek, W., Panek, P., and Zagler, W.L. Involvement of elderly citizens as potential end users of assistive technologies in the Living Lab Schwechat. Proc. of PETRA '09, (2009), 1--4.  ",
      "doi": "10.1145/1579114.1579169"
    },
    {
      "text": "Hughes, J., Randall, D., and Shapiro, D. Faltering from Ethnography to Design. Proc. of CSCW '92, November (1992), 115--122.  ",
      "doi": "10.1145/143457.143469"
    },
    {
      "text": "Intille, S.S., Larson, K., Beaudin, J.S., Nawyn, J., Mungui Tapia, E., and Kaushik, P. A Living Laboratory for the Design and Evaluation of Ubiquitous Computing Technologies. Proc. CHI '05 EA, (2005), 1--4.  ",
      "doi": "10.1145/1056808.1057062"
    },
    {
      "text": "Kuutti, K. and Bannon, L.J. The Turn to Practice in HCI!: Towards a Research Agenda. Proc. of CHI '14, (2014), 3543--3552.  ",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Lindsay, S., Jackson, D., Ladha, C., Ladha, K., Brittain, K., and Olivier, P. Empathy, Participatory Design and People with Dementia. Proc. of CHI '12, (2012), 521--530.  ",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Lindsay, S., Jackson, D., Schofield, G., and Olivier, P. Engaging Older People using Participatory Design. Proc. of CHI '12, (2012), 1199--1208.  ",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Massimi, M. and Baecker, R. Participatory Design Process with Older Users. Proc. UbiCoomp2006 Workshop on future media, (2006).",
      "doi": ""
    },
    {
      "text": "McDermott, R. Learning across teams. Knowledge Management Review, 303 (1999), 1--8.",
      "doi": ""
    },
    {
      "text": "Meurer, J., Stein, M., Randall, D., Rohde, M., and Wulf, V. Social Dependency and Mobile Autonomy -- Supporting Older Adults' Mobility with Ridesharing ICT. Proc. of CHI '14, (2014), 1923--1932.  ",
      "doi": "10.1145/2556288.2557300"
    },
    {
      "text": "Molinari, F. Living Labs as Multi-Stakeholder Platforms for the eGovernance of Innovation. Proc. of ICEGOV '11, (2011), 131--140.  ",
      "doi": "10.1145/2072069.2072092"
    },
    {
      "text": "Müller, C., Neufeldt, C., Randall, D., and Wulf, V. ICT-development in residential care settings: sensitizing design to the life circumstances of the residents of a care home. Proc. of CHI'12, (2012), 2639--2648.  ",
      "doi": "10.1145/2207676.2208655"
    },
    {
      "text": "Müller, C. Praxisbasiertes Technologiedesign für die alternde Gesellschaft. Josef Eul Verlag, Lohmar, 2014.",
      "doi": ""
    },
    {
      "text": "Newell, A.F., Carmichael, A., Morgan, M., and Dickinson, A. The use of theatre in requirements gathering and usability studies. Interacting with Computers 18, 5 (2006), 996--1011.  ",
      "doi": "10.1016/j.intcom.2006.05.003"
    },
    {
      "text": "Ogonowski, C., Ley, B., Hess, J., Wan, L., and Wulf, V. Designing for the Living Room!: Long-Term User Involvement in a Living Lab. Proc. of CHI '13, (2013), 1539--1548.  ",
      "doi": "10.1145/2470654.2466205"
    },
    {
      "text": "Olivier, P., Xu, G., Monk, A., and Hoey, J. Ambient kitchen: designing situated services using a high fidelity prototyping environment. Proc. of PETRA '09, (2009).  ",
      "doi": "10.1145/1579114.1579161"
    },
    {
      "text": "Raijmakers, B., Gaver, W., and Bishay, J. Design Documentaries: Inspiring Design Research Through Documentary Film. Proc. of DIS '06, (2006), 229--238.  ",
      "doi": "10.1145/1142405.1142441"
    },
    {
      "text": "Rau, M., Aleven, V., Rummel, N., and Rohrbach, S. Why Interactive Learning Environments Can Have It All: Resolving Design Conflicts Between Competing Goals. Proc. of CHI '13, (2013), 109--118.  ",
      "doi": "10.1145/2470654.2470670"
    },
    {
      "text": "Redhead, F. and Brereton, M. Getting to the nub of neighbourhood interaction. Proceedings of the Tenth Anniversary Conference on Participatory Design, October (2008), 1--4. ",
      "doi": "10.5555/1795234.1795297"
    },
    {
      "text": "Rice, M. and Carmichael, A. Factors facilitating or impeding older adults' creative contributions in the collaborative design of a novel DTV-based application. Universal Access in the Information Society 12, 1 (2011), 5--19.  ",
      "doi": "10.1007/s10209-011-0262-8"
    },
    {
      "text": "Schuurman, D., De Moor, K., De Marez, L., and Evens, T. A Living Lab research approach for mobile TV. Telematics and Informatics 28, 4 (2011), 271--282.  ",
      "doi": "10.1016/j.tele.2010.11.004"
    },
    {
      "text": "Suchman, L. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press, Cambridge, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Vines, J., Blythe, M., Lindsay, S., Dunprhy, P., Monk, A., and Olivier, P. Questionable Concepts: Critique as Resource for Designing with Eighty Somethings. Proc. of CHI '12, (2012), 1169--1178.  ",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "Wan, L., Müller, C., Wulf, V., and Randall, D. Addressing the subtleties in dementia care: pre-study & evaluation of a GPS monitoring system. Proc. of CHI '14, (2014), 3987--3996.  ",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "Wulf, V., Rohde, M., Pipek, V., and Stevens, G. Engaging with Practices: Design Case Studies as a Research Framework in CSCW. Proc. of CSCW '11, (2011), 505--512.  ",
      "doi": "10.1145/1958824.1958902"
    },
    {
      "text": "Yoo, D., Huldtgren, A., Woelfer, J., Hendry, D.G., and Friedman, B. A Value Sensitive Action-Reflection Model: Evolving a Co-Design Space with Stakeholder and Designer Prompts. Proc. of CHI '13, (2013), 419428.  ",
      "doi": "10.1145/2470654.2470715"
    }
  ]
}