{
  "doi": "10.1145/2702123.2702588",
  "title": "CoFaçade: A Customizable Assistive Approach for Elders and Their Helpers",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1583-1592",
  "year": 2015,
  "badges": [],
  "abstract": "We present CoFaçade, a novel approach to helping elders reach their goals with IT products by working collaboratively with helpers. In this approach, the elder uses an interface with a small number of triggers, where each trigger is a single button (or card) that can execute a procedure. The helper uses a customization interface to link triggers to procedures that accomplish frequently-recurring high-level goals with IT products. Customization can be done either locally or remotely. We conducted an experiment to compare the CoFaçade approach with a baseline approach where helpers taught elders to perform IT tasks. Our results showed that CoFaçade can reduce helpers' time and effort, reduce elders' frustration, and improve elders' success rate in completing IT tasks.",
  "authors": [
    {
      "name": "Jason Chen Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658690225",
      "orcid": "missing"
    },
    {
      "name": "Richard C. Davis",
      "institution": "Singapore Management University, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81416597118/rel-imgonly/2011-rcdavis-mugshot.jpg",
      "acmid": "81416597118",
      "orcid": "missing"
    },
    {
      "name": "Pin Sym Foong",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414606008",
      "orcid": "missing"
    },
    {
      "name": "Shengdong Zhao",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416592901",
      "orcid": "0000-0001-7971-3107"
    }
  ],
  "references": [
    {
      "text": "Abascal, J. and Nicolle, C. Moving towards inclusive design guidelines for socially and ethically aware HCI. Interacting with Computers 17, 5 (2005), 484--505.  ",
      "doi": "10.1016/j.intcom.2005.03.002"
    },
    {
      "text": "Ackerman, M.S. and Palen, L. The Zephyr Help Instance. In Proc. CHI '96, 268--275.  ",
      "doi": "10.1145/238386.238528"
    },
    {
      "text": "Alves, V. and Paulo, B. Distributed adapters pattern: a design pattern for object-oriented distributed applications. In First Latin American Conference on Pattern Languages of Programming (2001).",
      "doi": ""
    },
    {
      "text": "Ayotte, D., Vass, J., Mitchell, J. and Trevarinus, J. Universal Access in Human-Computer Interaction. Design and Development Methods for Universal Access Lecture Notes in Computer Science 8513 (2014), 191--202.",
      "doi": ""
    },
    {
      "text": "Brett, D, J. and Ute, J, Bayenb. Teaching older adults to use computers: recommendations based on cognitive aging research. Educational Gerontology.",
      "doi": ""
    },
    {
      "text": "Bolin, M., M. Webber, P. Rha, T. Wilson, and R. C. Miller. Automation and customization of rendered web pages. In Proc. UIST '05, 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Carmien, S, P. Socio-Technical Environments Supporting Distributed Cognition for Persons with Cognitive Disabilities. Ph.D. dissertation, University of Colorado, 2006. ",
      "doi": "10.5555/1269101"
    },
    {
      "text": "Catherine, L,K and Neil C. Issues in training older adults to use computers. Behaviour & Information Technology 14, 2 (1995), 107--120.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Horvitz, E., and Cutrell, E. Subjective Duration Assessment: An Implicit Probe for Software Usability. In Proc. of IHMHCI '01, 167--170.",
      "doi": ""
    },
    {
      "text": "Dickinson, A., Newell, A., Smith, M.J., and Hill, R.L. Introducing the internet to the over-60's: Developing an email system for older novice computer users. Interacting with Computers 17, 6 (2005), 621--642.  ",
      "doi": "10.1016/j.intcom.2005.09.003"
    },
    {
      "text": "Dixon, M. and Fogarty, J. Prefab?: Implementing Advanced Behaviors Using Pixel-Based Reverse Engineering of Interface Structure. In Proc. CHI '10, 1525--1534.  ",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Eagan, J.R., Beaudouin-Lafon, M., and Mackay, W.E. Cracking the cocoa nut. In Proc. UIST '11, 225--234.  ",
      "doi": "10.1145/2047196.2047226"
    },
    {
      "text": "Fisk, A.D., Rogers, W.A., Charness, N., Czaja, S.J., and Sharit, J. Designing for Older Adults: Principles and creative human factors approaches. 2009.",
      "doi": ""
    },
    {
      "text": "Fisk, A.D., Rogers, W.A. Toward a psychological science of advanced technology design for elders. J Gerontol B Psychol Sci Soc Sci. 2010;65(6):645--653.",
      "doi": ""
    },
    {
      "text": "Gilly, L., Eben M. H., Tara M., and Tessa L. CoScripter: automating & sharing how-to knowledge in the enterprise. In Proc. CHI '08, 1719--1728.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Gregor, P., Newell, A.F., and Zajicek, M. Designing for dynamic diversity: interfaces for older adults. In Proc. Assets '02, 151.  ",
      "doi": "10.1145/638249.638277"
    },
    {
      "text": "Grinter, R.E., Edwards, W.K., Newman, M.W., and Ducheneaut, N. The Work to Make a Home Network Work. ECSCW 2005, Springer (2005), 469--488. ",
      "doi": "10.5555/1242029.1242053"
    },
    {
      "text": "Hanson, V.L. Technology skill and age: what will be the same 20 years from now? Universal Access in the Information Society 10, 4 (2011), 443--452.  ",
      "doi": "10.1007/s10209-011-0224-1"
    },
    {
      "text": "Meng, X. Zhao, S. Huang, Y. Zhang, Z. Eagan, J. Subramanian, R. WADE: Simplified GUI Add-on Development for Third-party Software. In Proc. CHI '14, 2221--2230.  ",
      "doi": "10.1145/2556288.2557349"
    },
    {
      "text": "Milne, S., Dickinson, a., Carmichael, a., Sloan, D., Eisma, R., and Gregor, P. Are guidelines enough? An introduction to designing Web sites accessible to older adults. IBM Systems Journal 44, 3 (2005), 557--571.  ",
      "doi": "10.1147/sj.443.0557"
    },
    {
      "text": "Olwal, A., Lachanas, D., and Zacharouli, E. OldGen: Mobile phone personalization for elders. In Proc. CHI' 11, 3393--3396.  ",
      "doi": "10.1145/1978942.1979447"
    },
    {
      "text": "Picard, R.W., Street, A., and Daily, S.B. Evaluating affective interactions: Alternatives to asking what users feel. Sciences. New York 1, (2004), 1--4.",
      "doi": ""
    },
    {
      "text": "Poole, E.S., Chetty, M., Grinter, R.E., and Edwards, W.K. More than meets the eye: transforming the user experience of home network management. In Proc. DIS '08, 455--464.  ",
      "doi": "10.1145/1394445.1394494"
    },
    {
      "text": "Poole, E.S., Chetty, M., Morgan, T., Grinter, R.E., and Edwards, W.K. Computer Help at Home?: Methods and Motivations for Informal Technical Support. Methods 34, 3 (2009), 739--748.  ",
      "doi": "10.1145/1518701.1518816"
    },
    {
      "text": "Shneiderman, B. Universal usability. Communications of the ACM 43, 5 (2000), 84--91.  ",
      "doi": "10.1145/332833.332843"
    },
    {
      "text": "Sloan, D., Atkinson, M.T., Machin, C., and Li, Y. The potential of adaptive interfaces as an accessibility aid for older web users. In Proc. W4A 10, (2010), 1.  ",
      "doi": "10.1145/1805986.1806033"
    },
    {
      "text": "Sue, S. When Elderly Loved Ones Live Far Away: The Challenge of Long-Distance Care. Wall Street Journal, 2004.",
      "doi": ""
    },
    {
      "text": "Walter S. Lasecki, Young Chol Song, Henry A. Kautz, Jeffrey P. Bigham: Real-time crowd labeling for deployable activity recognition. In Proc. CSCW '13, 1203--1212.  ",
      "doi": "10.1145/2441776.2441912"
    },
    {
      "text": "Wobbrock, J.O., Kane, S.K., Gajos, K.Z., Harada, S., and Froehlich, J. Ability-Based Design: Concept, Principles and Examples. ACM ToCHI '11:3, 3, 1--36.  ",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Yeh, T., Chang, T. H., & Miller, R. C. Sikuli: using GUI screenshots for search and automation. In Proc. UIST '09, 183--192.  ",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "S. Zhao, K. Nakamura, K. Ishii, and T. Igarashi. Magic cards: a paper tag interface for implicit robot control. In Proc. CHI '09, 173--182.  ",
      "doi": "10.1145/1518701.1518730"
    }
  ]
}