{
  "doi": "10.1145/2702123.2702418",
  "title": "Real-time Guidance Camera Interface to Enhance Photo Aesthetic Quality",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1183-1186",
  "year": 2015,
  "badges": [],
  "abstract": "This paper explores whether it is effective to use real-time on-screen guidance to help users take better photos with mobile devices. Using a three-camera array, we developed a photo-taking interface that provides real-time feedback on how to position the subject-of-interest according to a photography composition rule: rule-of-thirds. We conduct a user study to compare the aesthetic quality of photos taken with our real-time guidance interface against a static gridline interface common to existing digital cameras. Expert photographers and Mechanical Turk workers rate the aesthetic quality of these pairs of photos. Results indicate the photos taken with our real-time guidance interface have significantly higher aesthetics scores. This study shows the potential in using camera array, computational photography, and real-time guidance interface to help non-expert users take better photos.",
  "tags": [
    "user evaluation",
    "camera array.",
    "photo aesthetics",
    "camera user interface"
  ],
  "authors": [
    {
      "name": "Yan Xu",
      "institution": "Intel Labs, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696885",
      "orcid": "missing"
    },
    {
      "name": "Joshua Ratcliff",
      "institution": "Intel Labs, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508685956",
      "orcid": "missing"
    },
    {
      "name": "James Scovell",
      "institution": "Intel Corporation, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707580",
      "orcid": "0000-0002-4816-3162"
    },
    {
      "name": "Gheric Speiginer",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639557",
      "orcid": "missing"
    },
    {
      "name": "Ronald Azuma",
      "institution": "Intel Labs, Santa Clara, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100099945",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bradski, G. OpenCV Library. Dr. Dobb's Journal of Software Tools.",
      "doi": ""
    },
    {
      "text": "Datta, R. and Wang, J. ACQUINE: aesthetic quality inference engine-real-time automatic rating of photo aesthetics. Proc. of Multimedia Information Retrieval, ACM, (2010), 421--424.  ",
      "doi": "10.1145/1743384.1743457"
    },
    {
      "text": "Khan, S. and Vogel, Evaluating visual aesthetics in photographic portraiture. In Proc. of Symposium on Computational Aesthetics in Graphics, Visualization, and Imaging, ACM (2012), 1--8. ",
      "doi": "10.5555/2328888.2328898"
    },
    {
      "text": "Kindberg, T., Spasojevic, M., Fleck, R., & Sellen, A. The Ubiquitous Camera: An In-Depth Study of Camera Phone Use. IEEE Pervasive Computing, 4, 2 (2005), 42--50.  ",
      "doi": "10.1109/MPRV.2005.42"
    },
    {
      "text": "Li, C. and Gallagher, A. Aesthetic quality assessment of consumer photos with faces. Proc. of Image Processing IEEE (2010), 3--6.",
      "doi": ""
    },
    {
      "text": "Luo, Y., & Tang, X. Photo and video quality evaluation: F1ocusing on the subject. In Proc. of Computer Vision? ECCV, Springer (2008), 386--399.  ",
      "doi": "10.1007/978-3-540-88690-7_29"
    },
    {
      "text": "Luo, W., Wang, X., & Tang, X. Content-based photo quality assessment. International Conference on Computer Vision, IEEE (2011), 2206--2213  ",
      "doi": "10.1109/ICCV.2011.6126498"
    },
    {
      "text": "Mason, W. and Suri, S. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods 44, 1 (2012), pp. 1--23.",
      "doi": ""
    },
    {
      "text": "Northrup, T. (2012). How to create stunning digital photography. Mason Press.",
      "doi": ""
    },
    {
      "text": "Pedro, J.S. and Church, K. The sound of light: induced synesthesia for augmenting the photography experience. CHI'13 Extended Abstracts, ACM (2013), 745--750.  ",
      "doi": "10.1145/2468356.2468489"
    },
    {
      "text": "Peterson, B. F. (2003). Learning to see creatively, Amphoto Press.",
      "doi": ""
    },
    {
      "text": "Smith, J. T. (1797). Remarks on rural scenery. Nathaniel Smith ancient Print. Cited by the Wikipedia page about rule of thirds: http://en.wikipedia.org/wiki/Rule_of_thirds (retrieved September 10, 2014)",
      "doi": ""
    },
    {
      "text": "Yao, L., Suryanarayan, P., and Qiao, M. Oscar: On-site composition and aesthetics feedback through exemplars for photographers. International journal of Computer Vision, 96, 3, Springer (2012), 353--383.  ",
      "doi": "10.1007/s11263-011-0478-3"
    }
  ]
}