{
  "doi": "10.1145/2702123.2702172",
  "title": "Lightweight Relief Shearing for Enhanced Terrain Perception on Interactive Maps",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3563-3572",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We explore interactive relief shearing, a set of non-intrusive, direct manipulation interactions that expose depth and shape information in terrain maps using ephemeral animations. Reading and interpreting topography and relief on terrain maps is an important aspect of map use, but extracting depth information from 2D maps is notoriously difficult. Modern mapping software attempts to alleviate this limitation by presenting digital terrain using 3D views. However, 3D views introduce occlusion, complicate distance estimations, and typically require more complex interactions. In contrast, our approach reveals depth information via shearing animations on 2D maps, and can be paired with existing interactions such as pan and zoom. We examine explicit, integrated, and hybrid interactions for triggering relief shearing and present a version that uses device tilt to control depth effects. Our evaluation shows that these interactive techniques improve depth perception when compared to standard 2D and perspective views.",
  "authors": [
    {
      "name": "Wesley Willett",
      "institution": "INRIA & University of Calgary (CA), Saclay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572817",
      "orcid": "0000-0002-6793-3062"
    },
    {
      "name": "Bernhard Jenny",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597718",
      "orcid": "0000-0001-6101-6100"
    },
    {
      "name": "Tobias Isenberg",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81100203466/rel-imgonly/tobiselection.jpg",
      "acmid": "81100203466",
      "orcid": "missing"
    },
    {
      "name": "Pierre Dragicevic",
      "institution": "INRIA, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723138",
      "orcid": "0000-0002-1854-5899"
    }
  ],
  "references": [
    {
      "text": "Bernabé-Poveda, M. A., and Cöltekin, A. Prevalence of the terrain reversal effect in satellite imagery. International Journal of Digital Earth (2014). To appear.",
      "doi": ""
    },
    {
      "text": "Bowman, D. A., Kruijff, E., LaViola, Jr., J. J., and Poupyrev, I. 3D User Interfaces: Theory and Practice. Addison-Wesley, Boston, 2005. ",
      "doi": "10.1162/pres.2005.14.1.117"
    },
    {
      "text": "Buchroithner, M. F., and Knust, C. True-3D in cartography-Current hard-and softcopy developments. In Geospatial Visualisation. Springer, Heidelberg/Berlin, 2013, 41--65.",
      "doi": ""
    },
    {
      "text": "Castner, H. W., and Wheate, R. Re-assessing the role played by shaded relief in topographic scale maps. The Cartographic Journal 16, 2 (Dec. 1979), 77--85.",
      "doi": ""
    },
    {
      "text": "Cumming, G. The new statistics: Why and how. Psychological Science 25, 1 (Jan. 2014), 7--29.",
      "doi": ""
    },
    {
      "text": "Degener, P., and Klein, R. A variational approach for automatic generation of panoramic maps. ACM Transactions on Graphics 28, 1 (Jan. 2009), 2:1--2:14.  ",
      "doi": "10.1145/1477926.1477928"
    },
    {
      "text": "Dragicevic, P., Chevalier, F., and Huot, S. Running an HCI experiment in multiple parallel universes. In CHI Extended Abstracts, ACM (New York, 2014), 607--618.  ",
      "doi": "10.1145/2559206.2578881"
    },
    {
      "text": "Francone, J., and Nigay, L. Using the user's point of view for interaction on mobile devices. In Proc. IHM, ACM (New York, 2011), 4:1--4:8.  ",
      "doi": "10.1145/2044354.2044360"
    },
    {
      "text": "Grossman, T., and Balakrishnan, R. An evaluation of depth perception on volumetric displays. In Proc. AVI, ACM (New York, 2006), 193--200.  ",
      "doi": "10.1145/1133265.1133305"
    },
    {
      "text": "Hancock, M., Cate, T., and Carpendale, S. Sticky tools: Full 6DOF force-based interaction for multi-touch tables. In Proc. ITS, ACM (New York, 2009), 133--140.  ",
      "doi": "10.1145/1731903.1731930"
    },
    {
      "text": "Imhof, E. Cartographic Relief Presentation. Esri Press, Redlands, CA, USA, 2007.",
      "doi": ""
    },
    {
      "text": "Jenny, B., and Patterson, T. Introducing plan oblique relief. Cartographic Perspectives, 57 (Spring 2007), 21--40.",
      "doi": ""
    },
    {
      "text": "Jenny, H., Jenny, B., Cartwright, W. E., and Hurni, L. Interactive local terrain deformation inspired by handpainted panoramas. The Cartographic Journal 48, 1 (Feb. 2011), 11--20.",
      "doi": ""
    },
    {
      "text": "Jenny, H., Jenny, B., and Hurni, L. Interactive design of 3D maps with progressive projection. The Cartographic Journal 47, 3 (Aug. 2010), 211--221.",
      "doi": ""
    },
    {
      "text": "Kirby, K. N., and Gerlanc, D. BootES: An R package for bootstrap confidence intervals on effect sizes. Behavior Research Methods 45, 4 (Dec. 2013), 905--927.",
      "doi": ""
    },
    {
      "text": "Knust, C., and Buchroithner, M. F. Principles and terminology of true-3D geovisualisation. The Cartographic Journal 51, 3 (Aug. 2014), 191--202.",
      "doi": ""
    },
    {
      "text": "Langer, M. S., and Bülthoff, H. H. A prior for global convexity in local shape-from-shading. Perception 30, 4 (Jan. 2001), 403--410.",
      "doi": ""
    },
    {
      "text": "Loomis, J. M., and Eby, D. W. Perceiving structure from motion: Failure of shape constancy. In Proc. ICCV, IEEE Computer Society (Los Alamitos, 1988), 383--391.",
      "doi": ""
    },
    {
      "text": "Phillips, R. J., Lucia, A., and Skelton, N. Some objective tests of the legibility of relief maps. The Cartographic Journal 12, 1 (June 1975), 39--46.",
      "doi": ""
    },
    {
      "text": "Potash, L. M., Farrell, J. P., and Jeffrey, T. S. A technique for assessing map relief legibility. The Cartographic Journal 15, 1 (June 1978), 28--35.",
      "doi": ""
    },
    {
      "text": "Rapp, D. N., Culpepper, S. A., Kirkby, K., and Morin, P. Fostering students' comprehension of topographic maps. Journal of Geoscience Education 55, 1 (Jan. 2007), 5--16.",
      "doi": ""
    },
    {
      "text": "Reisman, J. L., Davidson, P. L., and Han, J. Y. A screenspace formulation for 2D and 3D direct manipulation. In Proc. UIST, ACM (New York, 2009), 69--78.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "Shneiderman, B. Why not make interfaces better than 3D reality? IEEE Computer Graphics and Applications 23, 6 (Nov./Dec. 2003), 12--15.  ",
      "doi": "10.1109/MCG.2003.1242376"
    },
    {
      "text": "Smith, G., Stuerzlinger, W., Salzman, T., Watson, B., and Buchanan, J. 3D scene manipulation with 2D devices and constraints. In Proc. Graphics Interface, CIPS (Toronto, 2001), 135--142. ",
      "doi": "10.5555/780986.781003"
    },
    {
      "text": "Todd, J. T. The visual perception of 3D shape. Trends in Cognitive Sciences 8, 3 (Mar. 2004), 115--121.",
      "doi": ""
    },
    {
      "text": "Todd, J. T., and Norman, J. F. The visual perception of 3-D shape from multiple cues: Are observers capable of perceiving metric structure? Perception & Psychophysics 65, 1 (Jan. 2003), 31--47.",
      "doi": ""
    },
    {
      "text": "VandenBos, G. R., Ed. Publication Manual of the American Psychological Assn., 6th ed. APA, Washington, DC, 2009.",
      "doi": ""
    },
    {
      "text": "Vezzani, S., Kramer, P., and Bressan, P. Stereokinetic effect, kinetic depth effect, and structure from motion. In The Oxford Handbook of Perceptual Organization. Oxford University Press, Oxford, United Kingdom, 2014. In press.",
      "doi": ""
    }
  ]
}