{
  "doi": "10.1145/2702123.2702351",
  "title": "Lost in Email: Pulling Users Down a Path of Interaction",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3981-3984",
  "year": 2015,
  "badges": [],
  "abstract": "In this paper we describe a study exploring why users spend more time in email than originally intended, which we call getting lost in email. To study this phenomenon, we implemented an IMAP logger that also dispatched diary entries to collect data for twenty participants over a two week period. Most participants reported getting lost in email during both short and long sessions. Our analysis suggests two primary factors in getting lost: the number of emails awaiting a reply and whether or not the session caused an interruption. We conclude that much of the problem around getting lost in email is in managing the tension between promptly responding to messages while limiting engagement with email.",
  "tags": [
    "email",
    "personal information management"
  ],
  "authors": [
    {
      "name": "Benjamin V. Hanrahan",
      "institution": "Xerox Research Center Europe, Meylan, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481650520",
      "orcid": "missing"
    },
    {
      "name": "Manuel A. Pérez-Quiñones",
      "institution": "Virginia Tech, Blacksburg, VA, USA",
      "img": "/do/10.1145/contrib-81100175306/rel-imgonly/manuel1.png",
      "acmid": "81100175306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bälter, O., and Sidner, C. L. Bifrost inbox organizer: Giving users control over the inbox. In Proc. NordiCHI '02, ACM Press (2002), 111--118.  ",
      "doi": "10.1145/572020.572034"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., and Smith, I. Taking email to task: the design and evaluation of a task management centered email tool. In Proc. CHI '03, ACM (New York, NY, USA, 2003), 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., Smith, I., and Grinter, R. E. Quality versus quantity: E-mail-centric task management and its relation with overload. Human-Computer Interaction 20 (2005), 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Bradley, A., Brumby, D. P., Cox, A. L., and Bird, J. How to manage your inbox: Is a once a day strategy best? In Proc. of BCS-HCI '13, British Computer Society (Swinton, UK, 2013), 20:1--20:6. ",
      "doi": "10.5555/2578048.2578077"
    },
    {
      "text": "Chase, N., and Clegg, B. Effects of email utilization on higher education professionals. International Journal of Technology and Human Interaction 7, 4 (2011), 31--45.  ",
      "doi": "10.4018/jthi.2011100103"
    },
    {
      "text": "Cselle, G., Albrecht, K., and Wattenhofer, R. Buzztrack: topic detection and tracking in email. In Proc. IUI '07, ACM Press (2007), 190--197.  ",
      "doi": "10.1145/1216295.1216331"
    },
    {
      "text": "Czerwinski, M., Horvitz, E., and Wilhite, S. A diary study of task switching and interruptions. In Proc. CHI '04, ACM (New York, NY, USA, 2004), 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Dabbish, L. A., and Kraut, R. E. Email overload at work: an analysis of factors associated with email strain. In Proc. of CSCW '06, CSCW '06, ACM (New York, NY, USA, 2006), 431--440.  ",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Ducheneaut, N., and Bellotti, V. E-mail as habitat: an exploration of embedded personal information management. Interactions 8, 5 (2001), 30--38.  ",
      "doi": "10.1145/382899.383305"
    },
    {
      "text": "Faulring, A., Myers, B., Mohnkern, K., Schmerl, B., Steinfeld, A., Zimmerman, J., Smailagic, A., Hansen, J., and Siewiorek, D. Agent-assisted task management that reduces email overload. In Proc IUI 2010, ACM Press (2010), 61--70.  ",
      "doi": "10.1145/1719970.1719980"
    },
    {
      "text": "Freed, M., Carbonell, J. G., Gordon, G. J., Hayes, J., Myers, B. A., Siewiorek, D. P., Smith, S. F., Steinfeld, A., and Tomasic, A. Radar: A personal assistant that learns to reduce email overload. In AAAI (2008), 1287--1293. ",
      "doi": "10.5555/1620270.1620274"
    },
    {
      "text": "Grevet, C., Choi, D., Kumar, D., and Gilbert, E. Overload is overloaded: Email in the age of gmail. In Proc. of CHI '14, ACM (New York, NY, USA, 2014), 793--802.  ",
      "doi": "10.1145/2556288.2557013"
    },
    {
      "text": "Gwizdka, J. Reinventing the inbox: Supporting the management of pending tasks in email. In Proc. of CHI EA '02, ACM (New York, NY, USA, 2002), 550--551.  ",
      "doi": "10.1145/506443.506476"
    },
    {
      "text": "Hemp, P. Death by information overload. Harvard business review 87, 9 (2009), 82--89.",
      "doi": ""
    },
    {
      "text": "Iqbal, S. T., and Horvitz, E. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proc CHI '07, ACM Press (2007), 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Jerejian, A., Reid, C., and Rees, C. S. The contribution of email volume, email management strategies and propensity to worry in predicting email stress among academics. Computers in Human Behavior 29, 3 (2013), 991--996.  ",
      "doi": "10.1016/j.chb.2012.12.037"
    },
    {
      "text": "McCullagh, P., and Nelder, J. A. Generalized Linear Models. New York: Chapman & Hall, 1990.",
      "doi": ""
    },
    {
      "text": "McMurtry, K. Managing email overload in the workplace. Performance Improvement 53, 7 (August 2014), 13--37.",
      "doi": ""
    },
    {
      "text": "Sumeckia, D., Chipulua, M., and Ojiakoa, U. Email overload: Exploring the moderating role of the perception of email as a business critical tool. International Journal of Information Management 31 (2011), 407--414.  ",
      "doi": "10.1016/j.ijinfomgt.2010.12.008"
    },
    {
      "text": "Tyler, J. R., and Tang, J. C. When can I expect an email response? a study of rhythms in email usage. In Proc of ECSCW'03, Kluwer Academic Publishers (Norwell, MA, USA, 2003), 239--258. ",
      "doi": "10.5555/1241889.1241902"
    },
    {
      "text": "Vacek, M. How to survive email. In 9th IEEE International Symposium on Applied Computational Intelligence and Informatics, IEEE (May 2014), 49--54.",
      "doi": ""
    },
    {
      "text": "Wainer, J., Dabbish, L., and Kraut, R. Should I open this email?: inbox-level cues, curiosity and attention to email. In Proc. of CHI '11, ACM (New York, NY, USA, 2011), 3439--3448.  ",
      "doi": "10.1145/1978942.1979456"
    },
    {
      "text": "Whittaker, S., Bellotti, V., and Gwizdka, J. Personal Information Management. University of Washington Press, 2007, ch. Everything Through Email.",
      "doi": ""
    },
    {
      "text": "Whittaker, S., and Sidner, C. Email overload: exploring personal information management of email. In Proc. CHI 1996, ACM Press (1996), pp. 276--283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}