{
  "doi": "10.1145/2702123.2702191",
  "title": "Sangeet Swara: A Community-Moderated Voice Forum in Rural India",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "417-426",
  "year": 2015,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Interactive voice forums have emerged as a promising platform for people in developing regions to record and share audio messages using low-end mobile phones. However, one of the barriers to the scalability of voice forums is the process of screening and categorizing content, often done by a dedicated team of moderators. We present Sangeet Swara, a voice forum for songs and cultural content that relies on the community of callers to curate high-quality posts that are prioritized for playback to others. An 11-week deployment of Sangeet Swara found broad and impassioned usage, especially among visually impaired users. We also conducted a follow-up experiment, called Talent Hunt, that sought to reduce reliance on toll-free telephone lines. Together, our deployments span about 53,000 calls from 13,000 callers, who submitted 6,000 posts and 150,000 judgments of other content. Using a mixed-methods analysis of call logs, audio content, comparison with outside judges, and 204 automated phone surveys, we evaluate the user experience, the strengths and weaknesses of community moderation, financial sustainability, and the implications for future systems.",
  "authors": [
    {
      "name": "Aditya Vashistha",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research India, Bangalore, Karnataka, India",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Gaetano Borriello",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100123081/rel-imgonly/me.jpg",
      "acmid": "81100123081",
      "orcid": "missing"
    },
    {
      "name": "William Thies",
      "institution": "Microsoft Research India, Bangalore, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100276340",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Awaaz.de. http://awaaz.de/.",
      "doi": ""
    },
    {
      "text": "CensusInfo India 2011. http: //www.devinfolive.info/censusinfodashboard/.",
      "doi": ""
    },
    {
      "text": "Gram Vaani. http://gramvaani.org/.",
      "doi": ""
    },
    {
      "text": "The World in 2014: ICT Facts and Figures. Tech. rep. http://www.itu.int/en/ITU-D/Statistics/Documents/facts/ICTFactsFigures2014-e.pdf.",
      "doi": ""
    },
    {
      "text": "Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. In CHI (2010).",
      "doi": ""
    },
    {
      "text": "Press Release on Telecom Subscription Data as of 31st March, 2014. Tech. rep., TRAI, 2014. http://www. trai.gov.in/Content/PressDetails/2148_0.aspx.",
      "doi": ""
    },
    {
      "text": "Agarwal, S. K., Kumar, A., Nanavati, A. A., and Rajput, N. User-Generated Content Creation and Dissemination in Rural Areas. ITID 6, 2 (2010).",
      "doi": ""
    },
    {
      "text": "Chakraborty, D., Medhi, I., Cutrell, E., and Thies, W. Man Versus Machine: Evaluating IVR Versus a Live Operator for Phone Surveys in India. In DEV (2013).  ",
      "doi": "10.1145/2442882.2442891"
    },
    {
      "text": "Desai, S. B., Dubey, A., Joshi, B. L., Sen, M., Shariff, A., and Vanneman, R. Human Development in India: Challenges For a Society in Transition. Tech. rep., Oxford University Press, 2010.",
      "doi": ""
    },
    {
      "text": "D'Silva, K., Marathe, M., Vashistha, A., Borriello, G., and Thies, W. A Mobile Application for Interactive Voice Forums: Design and Pilot Deployment in Rural India. In DEV (2014).  ",
      "doi": "10.1145/2674377.2678270"
    },
    {
      "text": "Eagle, N. txteagle : Mobile Crowdsourcing. Money (2009).",
      "doi": ""
    },
    {
      "text": "Grover, A., and Calteaux, K. A voice service for user feedback on school meals. In DEV (2012).  ",
      "doi": "10.1145/2160601.2160619"
    },
    {
      "text": "Gulaid, M., and Vashistha, A. Ila Dhageyso : An Interactive Voice Forum to Foster Transparent Governance in Somaliland. In ICTD (2013).  ",
      "doi": "10.1145/2517899.2517947"
    },
    {
      "text": "Gupta, A., and Thies, W. mClerk: enabling mobile crowdsourcing in developing regions. In CHI (2012).  ",
      "doi": "10.1145/2207676.2208320"
    },
    {
      "text": "Koradia, Z., Aggarwal, P., Seth, A., and Luthra, G. Gurgaon idol: A singing competition over community radio and IVRS. In DEV (2013).  ",
      "doi": "10.1145/2442882.2442890"
    },
    {
      "text": "Lerer, A., Ward, M., and Amarasinghe, S. P. Evaluation of IVR data collection UIs for untrained rural users. In DEV (2010).  ",
      "doi": "10.1145/1926180.1926183"
    },
    {
      "text": "Medhi, I., Patnaik, S., Brunskill, E., Gautama, S. N., Thies, W., and Toyama, K. Designing mobile interfaces for novice and low-literacy users. TOCHI 18, 1 (2011).  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Meeker, M. 2014 Internet Trends. Tech. rep., Kleiner Perkins Caufield Byers, 2014. http://www.kpcb.com/internet-trends.",
      "doi": ""
    },
    {
      "text": "Mudliar, P., Donner, J., and Thies, W. Emergent Practices Around CGNet Swara: A Voice Forum for Citizen Journalism in Rural India. ITID (2013).  ",
      "doi": "10.1145/2160673.2160695"
    },
    {
      "text": "Munroe, R. Reddit's new comment sorting system, Oct. 2009. http://www.redditblog.com/2009/10/ reddits-new-comment-sorting-system.html.",
      "doi": ""
    },
    {
      "text": "Narula, P., Gutheim, P., Rolnitzky, D., Kulkarni, A., and Hartmann, B. MobileWorks : A Mobile Crowdsourcing Platform for Workers at the Bottom of the Pyramid. In HCOMP (2011).",
      "doi": ""
    },
    {
      "text": "Ochoa, X., and Duval, E. Quantitative analysis of user-generated content on the web. In WebEvolve (2008).",
      "doi": ""
    },
    {
      "text": "Patel, N., Agarwal, S., Rajput, N., Nanavati, A., Dave, P., and Parikh, T. S. A Comparative Study of Speech and Dialed Input Voice Interfaces in Rural India. In CHI (2009).  ",
      "doi": "10.1145/1518701.1518709"
    },
    {
      "text": "Rangaswamy, N., and Cutrell, E. Anthropology, Development and ICTs: Slums, Youth and the Mobile Internet in Urban India. In ICTD (2012).  ",
      "doi": "10.1145/2160673.2160685"
    },
    {
      "text": "Raza, A. A., Rosenfeld, R., Sherwani, J., Milo, C., Alster, G., Saif, U., Pervaiz, M., and Razaq, S. Viral Entertainment as Vehicle for Disseminating Speech Based Services to Low Literate Users. In ICTD (2012).  ",
      "doi": "10.1145/2160673.2160715"
    },
    {
      "text": "Raza, A. A., Ul Haq, F., Tariq, Z., Pervaiz, M., Razaq, S., Saif, U., and Rosenfeld, R. Job opportunities through entertainment: Virally spread speech-based services for low-literate users. In CHI (2013).  ",
      "doi": "10.1145/2470654.2481389"
    },
    {
      "text": "Smyth, T. N., Kumar, S., Medhi, I., and Toyama, K. Where There's a Will There's a Way: Mobile Media Sharing in Urban India. In CHI (2010).  ",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Su, X., and Khoshgoftaar, T. M. A survey of collaborative filtering techniques. Adv. in AI (2009).  ",
      "doi": "10.1155/2009/421425"
    },
    {
      "text": "Vashistha, A., Brady, E., Thies, W., and Cutrell, E. Educational Content Creation and Sharing by Low-Income Visually Impaired People in India. In DEV (2014).  ",
      "doi": "10.1145/2674377.2674385"
    },
    {
      "text": "White, J., Duggirala, M., Srivastava, S., and Kummamuru, K. Designing a Voice-Based Employment Exchange for Rural India. In ICTD (2012).  ",
      "doi": "10.1145/2160673.2160717"
    }
  ]
}