{
  "doi": "10.1145/2702123.2702508",
  "title": "We Are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1621-1630",
  "year": 2015,
  "badges": [],
  "abstract": "By lowering the costs of communication, the web promises to enable distributed collectives to act around shared issues. However, many collective action efforts never succeed: while the web's affordances make it easy to gather, these same decentralizing characteristics impede any focus towards action. In this paper, we study challenges to collective action efforts through the lens of online labor by engaging with Amazon Mechanical Turk workers. Through a year of ethnographic fieldwork, we sought to understand online workers' unique barriers to collective action. We then created Dynamo, a platform to support the Mechanical Turk community in forming publics around issues and then mobilizing. We found that collective action publics tread a precariously narrow path between the twin perils of stalling and friction, balancing with each step between losing momentum and flaring into acrimony. However, specially structured labor to maintain efforts' forward motion can help such publics take action.",
  "authors": [
    {
      "name": "Niloufar Salehi",
      "institution": "Stanford University, Stanford, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556617856",
      "orcid": "0000-0003-1237-5814"
    },
    {
      "name": "Lilly C. Irani",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459507",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    },
    {
      "name": "Ali Alkhatib",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706423",
      "orcid": "missing"
    },
    {
      "name": "Eva Ogbe",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706728",
      "orcid": "missing"
    },
    {
      "name": "Kristy Milland",
      "institution": "Ryerson University & We Are Dynamo, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703355",
      "orcid": "missing"
    },
    {
      "name": "Clickhappier",
      "institution": "We Are Dynamo & MTurkGrind, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699877",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Asen. \"Seeking the 'Counter' in Counterpublics.\" Communication Theory, 2000",
      "doi": ""
    },
    {
      "text": "Beck, E. P for political: Participation is not enough. Scandinavian Journal of Information Systems, 14(1), 1, 2002.",
      "doi": ""
    },
    {
      "text": "Benkler, Y. The wealth of networks: How social production transforms markets and freedom. Yale University Press, 2006. ",
      "doi": "10.1177/1084713807301373"
    },
    {
      "text": "Beyer, J. L. Expect Us: Online Communities and Political Mobilization. Oxford University Press, 2014.",
      "doi": ""
    },
    {
      "text": "Cranshaw, J., and Kittur, A. The polymath project: lessons from a successful online collaboration in mathematics. In Proc. CHI 2011.  ",
      "doi": "10.1145/1978942.1979213"
    },
    {
      "text": "Dahlberg, L. Computer mediated communication and the public sphere: A critical analysis. Journal of Computer Mediated Communication, 2001.",
      "doi": ""
    },
    {
      "text": "Dewey, J. The public and its problems: An essay in political inquiry. Penn State Press, 2012.",
      "doi": ""
    },
    {
      "text": "Dimond, J. P., Dye, M., Larose, D., and Bruckman, A. S. Hollaback!: the role of storytelling online in a social movement organization. In Proc. CSCW 2013.  ",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "DiSalvo, C. Design and the Construction of Publics. Design Issues, 2009, 25(1), 48--63.",
      "doi": ""
    },
    {
      "text": "Earl, J. Pursuing Social Change Online The Use of Four Protest Tactics on the Internet. Social Science Computer Review, 2006, 24(3), 362--377.",
      "doi": ""
    },
    {
      "text": "Earl, J., and Kimport, K. Digitally enabled social change: Activism in the internet age. Mit Press, 2011. ",
      "doi": "10.5555/2011873"
    },
    {
      "text": "Ehn, Pelle. Work-oriented design of computer artifacts. Vol. 78. Stockholm: Arbetslivscentrum, 1988. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Foucault. Two lectures. In Gordon (Ed.), Power / knowledge: Selected interviews and other writings,",
      "doi": ""
    },
    {
      "text": "Fraser, N., and Kate, N. Transnationalizing the public sphere. Polity, 2013",
      "doi": ""
    },
    {
      "text": "Goodwin, J., and Jasper, J. M. (Eds.). The social movements reader: cases and concepts (Vol. 12). John Wiley & Sons, 2009.",
      "doi": ""
    },
    {
      "text": "Habermas, Jürgen. The structural transformation of the public sphere: An inquiry into a category of bourgeois society. MIT press, 1991.",
      "doi": ""
    },
    {
      "text": "Hill, B. M. Almost Wikipedia: What Eight Collaborative Encyclopedia Projects Reveal About Mechanisms of Collective Action. Berkman Center for Internet and Society, 2011.",
      "doi": ""
    },
    {
      "text": "Hirschman, A. O. Exit, voice, and loyalty: Responses to decline in firms, organizations, and states (Vol. 25). Harvard university press, 1970.",
      "doi": ""
    },
    {
      "text": "Irani, L. C., and Silberman, M. Turkopticon: Interrupting worker invisibility in amazon mechanical turk. In Proc. CHI 2013  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Irani, L. The cultural work of microwork. New Media & Society, 2013, 1461444813511926.",
      "doi": ""
    },
    {
      "text": "Keegan, B., and Gergle, D. Egalitarians at the gate: One-sided gatekeeping practices in social media. In Proc. CSCW 2010  ",
      "doi": "10.1145/1718918.1718943"
    },
    {
      "text": "Kittur, A., and Kraut, R. E. Beyond Wikipedia: coordination and conflict in online production groups. In Proc. CSCW 2010  ",
      "doi": "10.1145/1718918.1718959"
    },
    {
      "text": "Kittur, A., et al. The future of crowd work. In Proc. of CSCW 2013  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Kraut, R. E., et al. Building successful online communities. MIT, 2012. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Kriplean, T., et al. Integrating on-demand factchecking with public dialogue. In Proc. CSCW 2014.  ",
      "doi": "10.1145/2531602.2531677"
    },
    {
      "text": "Kriplean, T., Morgan, J., et al. Supporting reflective public thought with ConsiderIt. In Proc. CSCW 2012.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Le Dantec, C. A., and DiSalvo, C. Infrastructuring and the formation of publics in participatory design. Social Studies of Science, 2013 43(2), 241--264.",
      "doi": ""
    },
    {
      "text": "Lee, C. et al. \"The Human infrastructure of cyberinfrastructure.\" In Proc. CSCW 2006.  ",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Luther, K., and Bruckman, A. Leadership in online creative collaboration. In Proc. CSCW 2008  ",
      "doi": "10.1145/1460563.1460619"
    },
    {
      "text": "Martin, D., Hanrahan, B. V., O'Neill, J., and Gupta, N. Being a turker. In Proc. CSCW 2014  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Muller, M. Participatory design: the third space in HCI. Human-computer interaction: Development process, 2003, 165--185.",
      "doi": ""
    },
    {
      "text": "Open-Source, E. O., Healy, K., and Schussman, A. The ecology of open-source software development. In Dept. of Sociology. University of Arizona, 2003.",
      "doi": ""
    },
    {
      "text": "Riles, A. From Comparison to Collaboration: Experiments with a New Scholarly and Political Form. Law and Contemporary Problems 77 2014",
      "doi": ""
    },
    {
      "text": "Rudy, P. \"Justice for janitors\" not \"compensation for custodians\".Rebuilding labor: Organizing and organizers in the new union movement, 2004.",
      "doi": ""
    },
    {
      "text": "Schmidt, K., and Bannon, L. Taking CSCW seriously. In Proc. CSCW 1992",
      "doi": ""
    },
    {
      "text": "Shaw, A., et al. Computer supported collective action. interactions 21.2, 2014, 74--77.  ",
      "doi": "10.1145/2576875"
    },
    {
      "text": "Star, S. L., and Strauss, A. Layers of silence, arenas of voice: The ecology of visible and invisible work. In Proc. CSCW 1999  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Starbird, K., & Palen, L. (How) will the revolution be retweeted? In Proc. CSCW 2012  ",
      "doi": "10.1145/2145204.2145212"
    },
    {
      "text": "Suchman, L. Human-Machine Reconfigurations: Plans and Situated Actions. Oxford Press, 2006 ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Suchman, L. Practice-based design of information systems: Notes from the hyperdeveloped world. The information society, 2002, 18(2), 139--144.",
      "doi": ""
    },
    {
      "text": "Taylor, A. \"Out there.\" In Proc. of CHI 2011  ",
      "doi": "10.1145/1978942.1979042"
    }
  ]
}