{
  "doi": "10.1145/2702123.2702498",
  "title": "Improving Multilingual Collaboration by Displaying How Non-native Speakers Use Automated Transcripts and Bilingual Dictionaries",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3463-3472",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Conversational grounding, or establishing mutual knowledge that messages have been understood as intended, can be difficult to achieve when some conversational participants are using a non-native language. These difficulties in grounding can be challenging for native speakers to detect. In this paper, we examine the value of signaling potential grounding problems to native speakers (NS) by displaying how non-native speakers (NNS) use automated transcripts and bilingual dictionaries. We conducted a laboratory experiment in which NS and NNS of English collaborated via audio conferencing on a map navigation task. Triads of one NS guider, one NS follower, and one NNS follower performed the task using one of three awareness displays: (a) a no awareness display that showed only the automated transcripts, (b) a general awareness display that showed whether each follower was reading the automated transcripts and/or translating a word; or (c) a detailed awareness display that showed which line of the transcripts a follower was reading and/or which words he/she was translating. NS guiders and NNS followers collaborated most successfully with the detailed awareness display, while NS guiders and NS followers performed equally across conditions. Our findings suggest several ways to improve systems to support multilingual collaboration.",
  "authors": [
    {
      "name": "Ge Gao",
      "institution": "NTT Communication Science Labs & Cornell University (USA), Kyoto, Japan",
      "img": "/do/10.1145/contrib-81498646640/rel-imgonly/ge_photo.png",
      "acmid": "81498646640",
      "orcid": "0000-0003-2733-2681"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Laboratories, Soraku-gun, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Ari M.J. Hautasaari",
      "institution": "NTT Communication Science Labs, Kyoto, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467668347",
      "orcid": "0000-0002-5351-4035"
    },
    {
      "name": "Susan R. Fussell",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, A., Bader, M., Bard, E., et al. (1991). The HCRC Map Task Corpus. Language and Speech, 34, 351--366.",
      "doi": ""
    },
    {
      "text": "Bardram, J. E., Hansen, T. R., & Soegaard, M. (2006). AwareMedia- A shared interative display supporting social, temporal, and spatial awareness in surgery. Proc. of CSCW 2006, 109--118.  ",
      "doi": "10.1145/1180875.1180892"
    },
    {
      "text": "Beebe, L.M., & Giles, H. (1984). Speechaccommodation theories: A discussion in terms of second-language acquisition. International Journal of the Sociology of Language, 46, 5--32,",
      "doi": ""
    },
    {
      "text": "Birnholtz, J., & Ibara, S. (2012). Tracking changes in collaborative writing: Edits, visibility, and group maintenance. Proc. of CSCW 2012, 809--818.  ",
      "doi": "10.1145/2145204.2145325"
    },
    {
      "text": "Carter, J., & Dewan, P. (2010). Are you having difficulty? Proc. of CSCW 2010, 211--214.  ",
      "doi": "10.1145/1718918.1718958"
    },
    {
      "text": "Cheung, V., Chang, Y. L. B., & Scott, S. D. (2012). Communication channels and awareness cues in collocated collaborative time-critical gaming. Proc. of CSCW 2012, 569--578.  ",
      "doi": "10.1145/2145204.2145291"
    },
    {
      "text": "Clark, H.H. (1996). Using Language. Cambridge Press.",
      "doi": ""
    },
    {
      "text": "Clark, H. H., & Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, J. M. Levine, & S. D. Teasley, (Eds.). Perspectives on Socially Shared Cognition (pp. 127--149). APA Press.",
      "doi": ""
    },
    {
      "text": "Dabbish, L., & Kraut, R. (2008). Awareness displays and social motivation for coordinating communication. Information Systems Research, 19, 221--238.  ",
      "doi": "10.1287/isre.1080.0175"
    },
    {
      "text": "Diamant, E.I., Fussell, S. R., & Lo, F. L. (2008). Where did we turn wrong? Unpacking the effects of culture and technology on attributions of team performance. Proc. CSCW 2008, 383--391.  ",
      "doi": "10.1145/1460563.1460625"
    },
    {
      "text": "Dourish, P., & Bellotti, V. (1992). Awareness and coordination in shared workspaces. Proc. of CSCW 1992, 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Feely, A. J., & Harzing, A. W. K. (2003). Language management in multinational companies. CrossCultural Management: An Intl'l Journal, 10, 27--52.",
      "doi": ""
    },
    {
      "text": "Fung, L., & Carter, R. (2007). Discourse markers and spoken English: Native and learner use in pedagogic settings. Applied Linguistics, 28, 410--439.",
      "doi": ""
    },
    {
      "text": "Gao, G., Yamashita, N., Hautasaari, A., Echenique, A., & Fussell, S. R. (2014). Effects of public vs. private automated transcripts on multiparty communication between native and non-native English speakers. Proc. of CHI 2014, 843--852.  ",
      "doi": "10.1145/2556288.2557303"
    },
    {
      "text": "Gergle, D., Kraut, R. E., & Fussell, S. R. (2013). Using visual information for grounding and awareness in collaborative tasks. Human-Computer Interaction, 28, 1--39.",
      "doi": ""
    },
    {
      "text": "Gibson, C. B., & Gibbs, J. L. (2006). Unpacking the concept of virtuality: The effects of geographic dispersion, electronic dependence, dynamic structure, and national diversity on team innovation. Administrative Science Quarterly, 51, 451--495.",
      "doi": ""
    },
    {
      "text": "Hart, S. G., & Staveland, L. E. (1998). Development of NASA-TLX: Results of empirical and theoretical research. Advances in Psychology, 52, 139--183.",
      "doi": ""
    },
    {
      "text": "Henderson, J.K. (2005). Language diversity in international management teams. International Studies of Management and Organization, 35, 66--82.",
      "doi": ""
    },
    {
      "text": "Ishida, T. (2011). The language grid. Springer Press.",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., Fussell, S. R., & Siegel, J. (2003). Visual information as a conversational resource in collaborative physical tasks. Human Computer Interaction, 18, 13--49.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "Li, H. Z., Yum, Y., Yates, R., Aguilera, L., Mao, Y., & Zheng, Y. (2005). Interruption and involvement in discourse: Can intercultural interlocutors be trained? J. Intercultural Communication Research, 34, 233--254.",
      "doi": ""
    },
    {
      "text": "Li, H. Z. (1999). Grounding and information communication in intercultural and intracultural dyadic discourse. Discourse Processes, 28, 195--215.",
      "doi": ""
    },
    {
      "text": "Lim, B. Y., Brdiczka, O., & Bellotti, V. (2010). Show me a good time: Using content to provide activity awareness to collaborators with Activity Spotter. Proc. of GROUP 2010, 263--272.  ",
      "doi": "10.1145/1880071.1880115"
    },
    {
      "text": "Reynolds, L., Birnholtz, J., & Lee, A. (2012). The effect of communication channel and visual awareness display on coordination in online tasks. Proc. iConference 2012, 120--128  ",
      "doi": "10.1145/2132176.2132192"
    },
    {
      "text": "Rogerson-Revell, P. (2008). Participation and performance in international business meetings. English for Specific Purposes, 27, 338--360.",
      "doi": ""
    },
    {
      "text": "Setlock, L. D., Fussell, S. R., & Neuwirth, C. (2004). Taking it out of context: Collaborating within and across cultures in face-to-face settings and via instant messaging. Proc. CSCW 2004, 604--613.  ",
      "doi": "10.1145/1031607.1031712"
    },
    {
      "text": "Takano, Y., & Noda, A. (1993). A temporary decline of thinking ability during foreign language processing. Journal of Cross-Cultural Psychology, 24, 445--462.",
      "doi": ""
    },
    {
      "text": "Tange, H., & Lauring, J. (2009). Language management and social interaction within the multilingual workplace. J. Communication Management, 13, 218--232.",
      "doi": ""
    },
    {
      "text": "Wang, H. C., Fussell, S. R., & Cosley, D. (2013). Machine translation vs. common language: Effects on idea exchange in cross-lingual groups. Proc. of CSCW 2013, 935--944.  ",
      "doi": "10.1145/2441776.2441882"
    },
    {
      "text": "Wang, H-C., Fussell, S. R. & Setlock, L. D. (2009). Cultural difference and adaptation of communication styles in computer-mediated group brainstorming. Proc. CHI 2009, 669--678.  ",
      "doi": "10.1145/1518701.1518806"
    },
    {
      "text": "Wong, J. (2000). The token\" yeah\" in nonnative speaker English conversation. Research on Language and Social Interaction, 33, 39--67.",
      "doi": ""
    },
    {
      "text": "Yamashita, N., Echenique, A., Ishita, T., & Hautasaari, A. (2013). Lost in translation: How transmission lag enhances and deteriorates multilingual collaboration. In Proc. of CSCW 2013, 923--934.  ",
      "doi": "10.1145/2441776.2441881"
    }
  ]
}