{
  "doi": "10.1145/2702123.2702282",
  "title": "The Use of Games as Extrinisic Motivation in Education",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3735-3738",
  "year": 2015,
  "badges": [],
  "abstract": "This paper presents results of a controlled trial using a clash-of-clans style game as an extrinsic motivator to encourage revision in 15-16 year olds preparing for a maths exam. The trial demonstrates a statistically significant improvement in performance among those using the game. We discuss differences between our work and a previous trial that showed no performance improvement from an extrinsically linked educational game, and present hypotheses as to why the game structure we used may be effective within our chosen deployment environment.",
  "authors": [
    {
      "name": "Chris Preist",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100643653",
      "orcid": "0000-0002-5094-5294"
    },
    {
      "name": "Robert Jones",
      "institution": "Games Faction Ltd, Sheffield, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699822",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Deci, E. L., Koestner, R., and Ryan, R. M. \"Extrinsic rewards and intrinsic motivation in education: Reconsidered once again.\" Review of Educational Research, 71(1), 1--27,2001.",
      "doi": ""
    },
    {
      "text": "Denny, P. \"The Effect of Virtual Achievments on Student Engagement.\" Proc. ACM CHI 2013, 763--772.  ",
      "doi": "10.1145/2470654.2470763"
    },
    {
      "text": "Dondlinger, M. J. (2007). \"Educational video game design: A review of the literature.\" Journal of Applied Educational Technology, 4(1), 21--31.",
      "doi": ""
    },
    {
      "text": "Habgood, M. J. and Ainsworth, S. E. \"Motivating children to learn effectively: Exploring the value of intrinsic integration in educational games.\" Journal of the Learning Sciences, 20(2), 169--206, 2011.",
      "doi": ""
    },
    {
      "text": "Feltovich, N. \"Nonparametric tests of differences in medians: comparison of the Wilcoxon-Mann-Whitney and robust rank-order tests.\" Experimental Econ, 6(3), 273--297, 2003.",
      "doi": ""
    },
    {
      "text": "Linehan, C., Kriman, B., Lawson, S., and Chan, G. \"Practical, appropriate, empirically-validated guidelines for designing educational games.\" ACM CHI 2011, 1979--1988.  ",
      "doi": "10.1145/1978942.1979229"
    },
    {
      "text": "O'Rourke,E., Haimovitz, K., Ballweber, C., Dweck, C., and Popovic, Z. \"Brain Points: A Growth Mindset Incentive Structure Boosts Persistence in an Educational Game.\" ACM CHI 2014, 3339--3348.  ",
      "doi": "10.1145/2556288.2557157"
    },
    {
      "text": "Wouters, P., van Nimwegen, C., van Oostendorp, H., & van der Spek, E. D. \"A meta-analysis of the cognitive and motivational effects of serious games.\" Journal of Educational Psychology, 105(2), 249, 2013.",
      "doi": "https%3A//doi.org/10.1037/a0031311"
    }
  ]
}