{
  "doi": "10.1145/2702123.2702506",
  "title": "Mapping out Work in a Mixed Reality Project Room",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "887-896",
  "year": 2015,
  "badges": [],
  "abstract": "We present results from a study examining how the physical layout of a project room and task affect the cognitive maps acquired of a connected virtual environment during mixed-presence collaboration. Results indicate that a combination of physical layout and task impacts cognitive maps of the virtual space. Participants did not form a strong model of how different physical work regions were situated relative to each other in the virtual world when the tasks performed in each region differed. Egocentric perspectives of multiple displays enforced by different furniture arrangements encouraged cognitive maps of the virtual world that reflected these perspectives, when the displays were used for the same task. These influences competed or coincided with document-based, audiovisual and interface cues, influencing collaboration. We consider the implications of our findings on WYSIWIS mappings between real and virtual for mixed-presence collaboration.",
  "authors": [
    {
      "name": "Derek Reilly",
      "institution": "Dalhousie University, Halifax, NS, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100514123",
      "orcid": "missing"
    },
    {
      "name": "Andy Echenique",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593075",
      "orcid": "missing"
    },
    {
      "name": "Andy Wu",
      "institution": "General Electric, San Ramon, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703562",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aliakseyeu, D., Lucero, A., and Martens, J. Users' quest for an optimized representation of a multi-device space. Personal Ubiquitous Comput. 13, 8 (2009), 599--607.  ",
      "doi": "10.1007/s00779-009-0245-4"
    },
    {
      "text": "Billinghurst, M., and Weghorst, S. The Use of Sketch Maps to Measure Cognitive Maps of Virtual Environments. In Proceedings of the Virtual Reality Annual International Symposium, (1995), pp 40--47. ",
      "doi": "10.5555/527216.836005"
    },
    {
      "text": "Bly, S. A., Harrison, S. R., and Irwin, S. Media spaces: bringing people together in a video, audio, and computing environment. Commun. ACM 36, 1 (Jan. 1993), 28--46  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Buxton, W. Living in Augmented Reality: Ubiquitous Media and Reactive Environments. In Finn, K., Sellen, A. and Wilber, S. (Eds). Video Mediated Communication: 363--384.",
      "doi": ""
    },
    {
      "text": "Colle, H. A., and Reid, G. B. The room effect: Metric spatial knowledge of local and separated regions. Presence:Teleoper.Virtual Environ.7(2)(1998),116--128.  ",
      "doi": "10.1162/105474698565622"
    },
    {
      "text": "Dix, A., Friday, A., Rodden, T., Koleva, B., Muller, H., Ranell, C. and Steed, A. Managing multiple spaces. In: Turner, Phil and Davenport, Elisabeth, (eds.) Spaces, Spatiality and Technology. Springer.",
      "doi": ""
    },
    {
      "text": "Golledge, R.G. Methods and Methodological Issues in Environmental Cognition Research. In Environmental Knowing, (Golledge, R.G. and Moore, G.T. Eds.), Dowden, Hutchinson and Ross, Inc., 1976, pp. 300--313.",
      "doi": ""
    },
    {
      "text": "Harrison, S. and Dourish. P. Re-place-ing space: the roles of place and space in collaborative systems. CSCW 1996: 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C., Benford, S., and Greenhalgh, C.. Fragmented interaction: establishing mutual orientation in virtual environments. CSCW 1998: 217--226.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Hommel, B., and Knuf, L. Action related determinants of spatial coding in perception and memory. In Spatial Cognition II, Integrating Abstract Theories, Empirical Studies, Formal Methods, and Practical Applications (2000), Springer-Verlag, pp. 387--398. ",
      "doi": "10.5555/645973.675365"
    },
    {
      "text": "Huang, E., Mynatt, E., Trimble, J. Displays in the Wild: Understanding the Dynamics and Evolution of a Display Ecology. Pervasive 2006.  ",
      "doi": "10.1007/11748625_20"
    },
    {
      "text": "Huang, J. and Waldvogel, M. The swisshouse: an inhabitable interface for connecting nations. DIS 2004.  ",
      "doi": "10.1145/1013115.1013143"
    },
    {
      "text": "Hunter, S., Maes, P., Tang, T., Inkpen, K.M. and Hessey, S.M. 2014. WaaZam!: supporting creative play at a distance in customized video environments. CHI 2014: 1197--1206.  ",
      "doi": "10.1145/2556288.2557382"
    },
    {
      "text": "Luff, P., Heath, C., Kuzuoka, H., Yamazaki, K. and Yamashita, J. Handling documents and discriminating objects in hybrid spaces. CHI 2006: 561--570.  ",
      "doi": "10.1145/1124772.1124858"
    },
    {
      "text": "Mark, D., Freksa, C., Hirtle, S., Lloyd, R., and Tversky, B. Cognitive models of geographic space. International Journal of Geographical Information Science 13, 8 (1999), 747--774.",
      "doi": ""
    },
    {
      "text": "Newcombe, N. Methods for the Study of Spatial Cognition. In The Development of Spatial Cognition, (Cohen, R. Ed.), Hillsdale, New Jersey, Lawrence Erlbaum Associates, 1985, pp. 277--300.",
      "doi": ""
    },
    {
      "text": "Olson, G. M. and Olson, J. S. Distance matters. Hum.Comput. Interact. 15, 2 (Sep. 2000), 139--178.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Reilly, D., Mathiasen, N., Salimian, M., Edwards, W.K., Franz, J. and MacKay, B. (2014) SecSpace: Prototyping Usable Privacy and Security for Mixed Reality Collaborative Environments. EICS 2014.  ",
      "doi": "10.1145/2607023.2607039"
    },
    {
      "text": "Reilly, D., Rouzati, H., Wu, A., Brudvik, J., Hwang, J. Y., and Edwards, W. K. TwinSpace: an Infrastructure for Cross-reality Team Spaces. UIST 2010.  ",
      "doi": "10.1145/1866029.1866050"
    },
    {
      "text": "Reilly, D., Voida, S., McKeon, M., Le Dantec, C., Edwards, W. K., Mynatt, E. and Mazalek, A. Space Matters: Physical-Digital and Physical-Virtual Codesign in inSpace, IEEE Pervasive Computing 9(3):54--63,  ",
      "doi": "10.1109/MPRV.2010.22"
    },
    {
      "text": "Stefik, M., Bobrow, D. G., Foster, G., Lanning, S. and Tatar, D.(1987) WYSIWIS revised: early experiences with multiuser interfaces. ACM Trans. Inf. Syst. 5:2, 147--167.  ",
      "doi": "10.1145/27636.28056"
    },
    {
      "text": "Streitz, N. A., Geißler, J., and Holmer, T. 1998. Roomware for Cooperative Buildings: Integrated Design of Architectural Spaces and Information Spaces. 1st intl. Workshop on Cooperative Buildings, London, 4--21. ",
      "doi": "10.5555/645968.674732"
    },
    {
      "text": "Tang, A., Boyle, M., and Greenberg, S. (2004) Display and presence disparity in Mixed Presence Groupware. OzCHI 2004:73--82. ",
      "doi": "10.5555/976310.976320"
    },
    {
      "text": "Teasley, S., Covi, L., Krishnan, M., and Olson, J. (2000) How does radical collocation help a team succeed? CSCW 2000: 339--346  ",
      "doi": "10.1145/358916.359005"
    },
    {
      "text": "Tversky, B. (1993) Cognitive maps, cognitive collages, and spatial mental models. In COSIT 1993: pp. 4--24. The columns on the last page should be of approximately equal length. Remove these two lines from your final version.",
      "doi": ""
    }
  ]
}