{
  "doi": "10.1145/2702123.2702371",
  "title": "zSense: Enabling Shallow Depth Gesture Recognition for Greater Input Expressivity on Smart Wearables",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3661-3670",
  "year": 2015,
  "badges": [],
  "abstract": "In this paper we present zSense, which provides greater input expressivity for spatially limited devices such as smart wearables through a shallow depth gesture recognition system using non-focused infrared sensors. To achieve this, we introduce a novel Non-linear Spatial Sampling (NSS) technique that significantly cuts down the number of required infrared sensors and emitters. These can be arranged in many different configurations; for example, number of sensor emitter units can be as minimal as one sensor and two emitters. We implemented different configurations of zSense on smart wearables such as smartwatches, smartglasses and smart rings. These configurations naturally fit into the flat or curved surfaces of such devices, providing a wide scope of zSense enabled application scenarios. Our evaluations reported over 94.8% gesture recognition accuracy across all configurations.",
  "tags": [
    "interacting with small devices",
    "smart wearables",
    "compressive sensing",
    "shallow depth gesture recognition"
  ],
  "authors": [
    {
      "name": "Anusha Withana",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81456616335/rel-imgonly/28416_398719482664_7387313_n.jpg",
      "acmid": "81456616335",
      "orcid": "0000-0001-6587-1278"
    },
    {
      "name": "Roshan Peiris",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385592390",
      "orcid": "0000-0002-4191-3565"
    },
    {
      "name": "Nipuna Samarasekara",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705353",
      "orcid": "missing"
    },
    {
      "name": "Suranga Nanayakkara",
      "institution": "Singapore University of Technology and Design, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81416609140/rel-imgonly/_mg_5811-uoa.jpg",
      "acmid": "81416609140",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashbrook, D., Baudisch, P., and White, S. Nenya: Subtle and eyes-free mobile input with a magnetically-tracked finger ring. In Proc. of CHI '11 (2011), 2043--2046.  ",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Bailly, G., Mller, J., Rohs, M., Wigdor, D., and Kratz, S. ShoeSense: A new perspective on gestural interaction and wearable applications. In Proc. of CHI '12 (2012), 1239--1248.  ",
      "doi": "10.1145/2207676.2208576"
    },
    {
      "text": "Baraniuk, R. G. Compressive sensing. IEEE signal processing magazine 24, 4 (2007), 118--121.",
      "doi": ""
    },
    {
      "text": "Bencina, R., Kaltenbrunner, M., and Jorda, S. Improved topological fiducial tracking in the reacTIVision system. In IEEE CVPR Workshops (2005), 99--99.  ",
      "doi": "10.1109/CVPR.2005.475"
    },
    {
      "text": "Butler, A., Izadi, S., and Hodges, S. Sidesight: multi- touch interaction around small devices. In Proc. of UIST '08 (2008), 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Chan, L., Liang, R.-H., Tsai, M.-C., Cheng, K.-Y., Su, C.-H., Chen, M. Y., Cheng, W.-H., and Chen, B.-Y. FingerPad: Private and subtle interaction using fingertips. In Proc. of UIST '13 (2013), 255--260.  ",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Chen, K.-Y., Lyons, K., White, S., and Patel, S. uTrack: 3d input using two magnetic sensors. In Proc. of UIST '13 (2013), 237--244.  ",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Colao, A., Kirmani, A., Yang, H. S., Gong, N.-W., Schmandt, C., and Goyal, V. K. Mime: Compact, low-power 3d gesture sensing for interaction with head-mounted displays. In Proc. of UIST '13 (2013), 227--236.  ",
      "doi": "10.1145/2501988.2502042"
    },
    {
      "text": "Duarte, M., Davenport, M., Takhar, D., Laska, J., Kelly, K., and Baraniuk, R. Single-pixel imaging via compressive sampling. IEEE Signal Processing Magazine 25, 2 (2008), 83--91.",
      "doi": ""
    },
    {
      "text": "Gustafson, S., Bierwirth, D., and Baudisch, P. Imaginary interfaces: Spatial interaction with empty hands and without visual feedback. In Proc. of UIST '10 (2010), 3--12.  ",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P., and Witten, I. H. The WEKA data mining software. ACM SIGKDD Explorations Newsletter 11, 1 (2009), 10.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Harrison, C., Benko, H., and Wilson, A. D. OmniTouch: Wearable multitouch interaction everywhere. In Proc. of UIST '11 (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Harrison, C., and Hudson, S. E. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proc. of UIST '09 (2009), 121.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Harrison, C., Schwarz, J., and Hudson, S. TapSense: enhancing finger interaction on touch surfaces. In Proc. of UIST '11 (2011), 627--636.  ",
      "doi": "10.1145/2047196.2047279"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. Skinput: Appropriating the body as an input surface chris. In Proc. of CHI '10 (2010), 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Hwang, S., Ahn, M., and Wohn, K.-y. MagGetz: customizable passive tangible controllers on and around conventional mobile devices. In Proc. of UIST '13 (2013), 411--416.  ",
      "doi": "10.1145/2501988.2501991"
    },
    {
      "text": "Jones, B., Sodhi, R., Forsyth, D., Bailey, B., and Maciocci, G. Around device interaction for multiscale navigation. In Proc. of MobileHCI '12 (2012), 83--92.  ",
      "doi": "10.1145/2371574.2371589"
    },
    {
      "text": "Ketabdar, H., Roshandel, M., and Yksel, K. A. Towards using embedded magnetic field sensor for around mobile device 3d interaction. In Proc. of MobileHCI '10 (2010), 153--156.  ",
      "doi": "10.1145/1851600.1851626"
    },
    {
      "text": "Kim, D., Hilliges, O., Izadi, S., Butler, A. D., Chen, J., Oikonomidis, I., and Olivier, P. Digits:freehand 3d interactions anywhere using a wrist-worn gloveless sensor. In Proc. of UIST'12 (2012), 167--176.  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Kim, J., He, J., Lyons, K., and Starner, T. The gesture watch: A wireless contact-free gesture based wrist interface. In Proc. of ISWC '07 (2007), 1--8.  ",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "MacKenzie, D. Compressed sensing makes every pixel count. What's Happening in the Mathematical Sciences, July (2009), 114--127.",
      "doi": ""
    },
    {
      "text": "Mitra, S., and Acharya, T. Gesture recognition: A survey. IEEE Transactions on Systems, Man and Cybernetics, Part C (Applications and Reviews) 37, 3 (May 2007), 311--324.  ",
      "doi": "10.1109/TSMCC.2007.893280"
    },
    {
      "text": "Nakatsuma, K., Shinoda, H., Makino, Y., Sato, K., and Maeno, T. Touch interface on back of the hand. In proc. of SIGGRAPH '11 (2011), 39:1--39:1.  ",
      "doi": "10.1145/2037715.2037760"
    },
    {
      "text": "Nanayakkara, S., Shilkrot, R., Yeo, K. P., and Maes, P. EyeRing: A finger-worn input device for seamless interactions with our surroundings. In Proc. of AH '13 (2013), 13--20.  ",
      "doi": "10.1145/2459236.2459240"
    },
    {
      "text": "Olberding, S., Yeo, K. P., Nanayakkara, S., and Steimle, J. AugmentedForearm: Exploring the design space of a display-enhanced forearm. In Proc. of AH '13 (2013), 9--12.  ",
      "doi": "10.1145/2459236.2459239"
    },
    {
      "text": "Rekimoto, J., and Saitoh, M. Augmented surfaces: A spatially continuous work space for hybrid computing environments. In Proc. of CHI '99 (1999), 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Ruiz, J., Li, Y., and Lank, E. User-defined motion gestures for mobile interaction. In Proc. of CHI '11 (2011), 197.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Siek, K. A., Rogers, Y., and Connelly, K. H. Fat finger worries : How older and younger users physically interact with PDAs. In Proc. of INTERACT '05, Springer Berlin Heidelberg (2005), 267--280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In Proc. of CHI'09 (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Xiao, R., Laput, G., and Harrison, C. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proc. of CHI '14 (2014), 193--196.  ",
      "doi": "10.1145/2556288.2557017"
    }
  ]
}