{
  "doi": "10.1145/2702123.2702443",
  "title": "Understanding Malicious Behavior in Crowdsourcing Platforms: The Case of Online Surveys",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1631-1640",
  "year": 2015,
  "badges": [],
  "abstract": "Crowdsourcing is increasingly being used as a means to tackle problems requiring human intelligence. With the ever-growing worker base that aims to complete microtasks on crowdsourcing platforms in exchange for financial gains, there is a need for stringent mechanisms to prevent exploitation of deployed tasks. Quality control mechanisms need to accommodate a diverse pool of workers, exhibiting a wide range of behavior. A pivotal step towards fraud-proof task design is understanding the behavioral patterns of microtask workers. In this paper, we analyze the prevalent malicious activity on crowdsourcing platforms and study the behavior exhibited by trustworthy and untrustworthy workers, particularly on crowdsourced surveys. Based on our analysis of the typical malicious activity, we define and identify different types of workers in the crowd, propose a method to measure malicious activity, and finally present guidelines for the efficient design of crowdsourced surveys.",
  "authors": [
    {
      "name": "Ujwal Gadiraju",
      "institution": "Leibniz Universitat Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-83458903457/rel-imgonly/ujwal-circle.png",
      "acmid": "83458903457",
      "orcid": "0000-0002-6189-6539"
    },
    {
      "name": "Ricardo Kawase",
      "institution": "L3S Research Center, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453660813",
      "orcid": "missing"
    },
    {
      "name": "Stefan Dietze",
      "institution": "L3S Research Center, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332496259",
      "orcid": "missing"
    },
    {
      "name": "Gianluca Demartini",
      "institution": "University of Sheffield, Sheffield, United Kingdom",
      "img": "/do/10.1145/contrib-81340488691/rel-imgonly/g06acm.jpg",
      "acmid": "81340488691",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baba, Y., Kashima, H., Kinoshita, K., Yamaguchi, G., and Akiyoshi, Y. Leveraging crowdsourcing to detect improper tasks in crowdsourcing marketplaces. In Twenty-Fifth IAAI Conference (2013).",
      "doi": ""
    },
    {
      "text": "Behrend, T. S., Sharek, D. J., Meade, A. W., and Wiebe, E. N. The viability of crowdsourcing for survey research. Behavior research methods 43, 3 (2011), 800--813.",
      "doi": ""
    },
    {
      "text": "Brabham, D. C. Crowdsourcing as a Model for Problem Solving. Convergence: The International Journal of Research into New Media Technologies 14, 1 (Feb. 2008), 75--90.",
      "doi": ""
    },
    {
      "text": "Buchholz, S., and Latorre, J. Crowdsourcing preference tests, and how to detect cheating. In INTERSPEECH (2011), 3053--3056.",
      "doi": ""
    },
    {
      "text": "Corbin, J., and Strauss, A. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage, 2008.",
      "doi": ""
    },
    {
      "text": "Difallah, D. E., Demartini, G., and Cudré-Mauroux, P. Mechanical cheat: Spamming schemes and adversarial techniques on crowdsourcing platforms. In CrowdSearch (2012), 26--30.",
      "doi": ""
    },
    {
      "text": "Dow, S., Kulkarni, A., Bunge, B., Nguyen, T., Klemmer, S., and Hartmann, B. Shepherding the crowd: managing and providing feedback to crowd workers. In CHI'11 Extended Abstracts on Human Factors in Computing Systems, ACM (2011), 1669--1674.  ",
      "doi": "10.1145/1979742.1979826"
    },
    {
      "text": "Dow, S., Kulkarni, A., Klemmer, S., and Hartmann, B. Shepherding the crowd yields better work. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, ACM (2012), 1013--1022.  ",
      "doi": "10.1145/2145204.2145355"
    },
    {
      "text": "Eickhoff, C., and de Vries, A. How crowdsourcable is your task. In Proceedings of the workshop on crowdsourcing for search and data mining (CSDM) at the fourth ACM international conference on web search and data mining (WSDM) (2011), 11--14.",
      "doi": ""
    },
    {
      "text": "Eickhoff, C., and de Vries, A. P. Increasing cheat robustness of crowdsourcing tasks. Information retrieval 16, 2 (2013), 121--137.  ",
      "doi": "10.1007/s10791-011-9181-9"
    },
    {
      "text": "Estellés-Arolas, E., and González-Ladrón-de Guevara, F. Towards an integrated crowdsourcing definition. Journal of Information science 38, 2 (2012), 189--200.  ",
      "doi": "10.1177/0165551512437638"
    },
    {
      "text": "Gadiraju, U., Kawase, R., and Dietze, S. A taxonomy of microtasks on the web. In Proceedings of the 25th ACM conference on Hypertext and social media, ACM (2014), 218--223.  ",
      "doi": "10.1145/2631775.2631819"
    },
    {
      "text": "Gennaro, R., Gentry, C., and Parno, B. Non-interactive verifiable computing: Outsourcing computation to untrusted workers. In Advances in Cryptology-CRYPTO 2010. Springer, 2010, 465--482. ",
      "doi": "10.5555/1881412.1881445"
    },
    {
      "text": "Glass, R. L., and Vessey, I. Contemporary application-domain taxonomies. IEEE Software 12, 4 (1995), 63--76.  ",
      "doi": "10.1109/52.391837"
    },
    {
      "text": "Ipeirotis, P. G., Provost, F., and Wang, J. Quality management on amazon mechanical turk. In Proceedings of the ACM SIGKDD workshop on human computation, ACM (2010), 64--67.  ",
      "doi": "10.1145/1837885.1837906"
    },
    {
      "text": "Kaufmann, N., Schulze, T., and Veit, D. More than fun and money. worker motivation in crowdsourcing - a study on mechanical turk. In AMCIS (2011).",
      "doi": ""
    },
    {
      "text": "Kazai, G., Kamps, J., and Milic-Frayling, N. Worker types and personality traits in crowdsourcing relevance labels. In Proceedings of the 20th ACM international conference on Information and knowledge management, ACM (2011), 1941--1944.  ",
      "doi": "10.1145/2063576.2063860"
    },
    {
      "text": "Kazai, G., Kamps, J., and Milic-Frayling, N. An analysis of human factors and label accuracy in crowdsourcing relevance judgments. Inf. Retr. 16, 2 (2013), 138--178.  ",
      "doi": "10.1007/s10791-012-9205-0"
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with mechanical turk. In Proceedings of the SIGCHI conference on human factors in computing systems, ACM (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kittur, A., Nickerson, J. V., Bernstein, M., Gerber, E., Shaw, A., Zimmerman, J., Lease, M., and Horton, J. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work, ACM (2013), 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Marshall, C. C., and Shipman, F. M. Experiences surveying the crowd: Reflections on methods, participation, and reliability. In Proceedings of the 5th Annual ACM Web Science Conference, WebSci '13, ACM (New York, NY, USA, 2013), 234--243.  ",
      "doi": "10.1145/2464464.2464485"
    },
    {
      "text": "Mason, W., and Watts, D. J. Financial incentives and the performance of crowds. ACM SigKDD Explorations Newsletter 11, 2 (2010), 100--108.  ",
      "doi": "10.1145/1809400.1809422"
    },
    {
      "text": "Ntalianis, K., Tsapatsoulis, N., Doulamis, A., and Matsatsinis, N. Automatic annotation of image databases based on implicit crowdsourcing, visual concept modeling and evolution. Multimedia Tools and Applications 69, 2 (2014), 397--421.  ",
      "doi": "10.1007/s11042-012-0995-2"
    },
    {
      "text": "Oleson, D., Sorokin, A., Laughlin, G. P., Hester, V., Le, J., and Biewald, L. Programmatic gold: Targeted and scalable quality assurance in crowdsourcing. Human computation 11 (2011), 11.",
      "doi": ""
    },
    {
      "text": "Ross, J., Irani, L., Silberman, M., Zaldivar, A., and Tomlinson, B. Who are the crowdworkers?: shifting demographics in mechanical turk. In CHI'10 Extended Abstracts on Human Factors in Computing Systems, ACM (2010), 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Wang, G., Wilson, C., Zhao, X., Zhu, Y., Mohanlal, M., Zheng, H., and Zhao, B. Y. Serf and turf: crowdturfing for fun and profit. In Proceedings of the 21st international conference on World Wide Web, ACM (2012), 679--688.  ",
      "doi": "10.1145/2187836.2187928"
    },
    {
      "text": "Yuen, M.-C., King, I., and Leung, K.-S. A survey of crowdsourcing systems. In Privacy, security, risk and trust (passat), 2011 ieee third international conference on and 2011 ieee third international conference on social computing (socialcom), IEEE (2011), 766--773.",
      "doi": ""
    }
  ]
}