{
  "doi": "10.1145/2702123.2702232",
  "title": "Beyond the Individual: The Contextual Wheel of Practice as a Research Framework for Sustainable HCI",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1125-1134",
  "year": 2015,
  "badges": [],
  "abstract": "Addressing human impact on the environment by focusing on shared everyday practices, rather than just individual behavior is an approach that shows promise. However, it can be challenging to put this approach into concrete use, especially in teams unfamiliar with the practice orientation. To support the practice approach, we introduce the Contextual Wheel of Practice (COWOP), a framework that can: 1) help researchers and designers to better understand practices, 2) design effective interventions, and 3) facilitate collaboration between team members from different disciplines, who may not be familiar with the practice orientation. We describe how COWOP was developed, and our experiences using COWOP in three different cases. We then position COWOP as part of the \"turn to practice\" in HCI, and discuss how it can be useful to HCI researchers and be applied in domains beyond sustainability, such as healthcare and privacy.",
  "tags": [
    "sustainable hci",
    "framework",
    "practice-orientation",
    "energy",
    "collaboration",
    "practice",
    "design"
  ],
  "authors": [
    {
      "name": "Johanne Mose Entwistle",
      "institution": "Alexandra Institute, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706274",
      "orcid": "missing"
    },
    {
      "name": "Mia Kruse Rasmussen",
      "institution": "Alexandra Institute, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704316",
      "orcid": "missing"
    },
    {
      "name": "Nervo Verdezoto",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81486655045/rel-imgonly/81486655045.png",
      "acmid": "81486655045",
      "orcid": "missing"
    },
    {
      "name": "Robert S. Brewer",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658733841",
      "orcid": "missing"
    },
    {
      "name": "Mads Schaarup Andersen",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467641129",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blunck, H., Bouvin, N. O., Mose Entwistle, J., Grønbæk, K., Kjærgaard, M. B., Nielsen, M., Graves Petersen, M., Rasmussen, M. K. and Wüstenberg, M. Computational environmental ethnography: combining collective sensing and ethnographic inquiries to advance means for reducing environmental footprints. In Proc. eEnergy '13, ACM Press (2013), 87--98.  ",
      "doi": "10.1145/2487166.2487176"
    },
    {
      "text": "Bødker, S. When second wave HCI meets third wave challenges. In Proc. NordiCHI '06, ACM (2006), 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Bourdieu, P. Outline of a Theory of Practice. Cambridge University Press, 1977.",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology, 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Brynjarsdóttir, H., Håkansson, M., Pierce, J., Baumer, E. P. S., Disalvo, C. and Sengers, P. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proc. CHI '12, ACM Press (2012), 947--956.  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Darby, S. The effectiveness of feedback on energy consumption. Environmental Change Institute, University of Oxford, 2006.",
      "doi": ""
    },
    {
      "text": "Darnton, A. and Horn, J. Influencing Behaviours Moving Beyond the Individual - A User Guide to the ISM Tool. The Scottish Government, 2013.",
      "doi": ""
    },
    {
      "text": "Doherty, G., McKnight, J. and Luz, S. Fieldwork for requirements: Frameworks for mobile healthcare applications. International Journal of Human-Computer Studies, 68, 10 (10// 2010), 760--776.  ",
      "doi": "10.1016/j.ijhcs.2010.06.005"
    },
    {
      "text": "Dourish, P. Implications for design. In Proc. CHI '06, ACM Press (2006), 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Entwistle, J. M. and Rasmussen, M. K. The Model of Change -- Understanding the How and Why of Change. In Proc. EPIC (Ethnographic Praxis in Industry Conference) (2014).",
      "doi": ""
    },
    {
      "text": "Fitzpatrick, G. and Ellingsen, G. A Review of 25 Years of CSCW Research in Healthcare: Contributions, Challenges and Future Agendas. Comput Supported Coop Work, 22, 4-6 (2013), 609--665.  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Friedman, B., Kahn, P., Jr., Borning, A. and Huldtgren, A. Value Sensitive Design and Information Systems. In N. Doorn, D. Schuurbiers, I. van de Poel and M. E. Gorman (eds.) Early engagement and new technologies: Opening up the laboratory, 16, (2013), 55--95.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Findlater, L. and Landay, J. The design of eco-feedback technology. In Proc. CHI '10, ACM Press (2010), 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Ganglbauer, E., Fitzpatrick, G. and Comber, R. Negotiating food waste: Using a practice lens to inform design. ACM Trans. Comput.-Hum. Interact., 20, 2 (2013), 1--25.  ",
      "doi": "10.1145/2463579.2463582"
    },
    {
      "text": "Geels, F. W. From sectoral systems of innovation to socio-technical systems. Research Policy, 33, 6--7 (2004), 897--920.",
      "doi": ""
    },
    {
      "text": "Giddens, A. The Constitution of Society: Outline of the Theory of Structuration. Polity Press, 1984.",
      "doi": ""
    },
    {
      "text": "Grönvall, E. and Verdezoto, N. Beyond self-monitoring: understanding non-functional aspects of home-based healthcare technology. In Proc. UbiComp 2013, ACM (2013), 587--596.  ",
      "doi": "10.1145/2493432.2493495"
    },
    {
      "text": "Gross, S., Bardzell, J. and Bardzell, S. Structures, forms, and stuff: the materiality and medium of interaction. Pers Ubiquit Comput, 18, 3 (2014), 637--649.  ",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Ingram, J., Shove, E. and Watson, M. Products and Practices: Selected Concepts from Science and Technology Studies and from Social Theories of Consumption and Practice. Design Issues, 23, 2 (2007), 3--16.",
      "doi": ""
    },
    {
      "text": "Kuijer, L. and Jong, A. D. Identifying design opportunities for reduced household resource consumption: exploring practices of thermal comfort. Journal of Design Research, 10, 1 (2012), 67--85.",
      "doi": ""
    },
    {
      "text": "Kuijer, L., Jong, A. d. and Eijk, D. v. Practices as a unit of design: An exploration of theoretical guidelines in a study on bathing. ACM Trans. Comput.-Hum. Interact., 20, 4 (2013), 1--22.  ",
      "doi": "10.1145/2493382"
    },
    {
      "text": "Kuutti, K. and Bannon, L. J. The turn to practice in HCI: towards a research agenda. In Proc. CHI 2014, ACM Press (2014), 3543--3552.  ",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Nissenbaum, H. Privacy as contextual integrity. Wash. L. Rev., 79 (2004), 119--157.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Dourish, P. Unpacking \"privacy\" for a networked world. In Proc. CHI '03, ACM Press (2003), 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Pierce, J., Strengers, Y., Sengers, P. and Bødker, S. Introduction to the special issue on practice-oriented approaches to sustainable HCI. ACM Trans. Comput.Hum. Interact., 20, 4 (2013), 1--8.  ",
      "doi": "10.1145/2494260"
    },
    {
      "text": "Pink, S., Mackley, K. L., Mitchell, V., Hanratty, M., Escobar-Tello, C., Bhamra, T. and Morosanu, R. Applying the Lens of Sensory Ethnography to Sustainable HCI. ACM Trans. Comput.-Hum. Interact., 20, 4 (2013), 25:21--25:18.  ",
      "doi": "10.1145/2494261"
    },
    {
      "text": "Randles, S. and Warde, A. Consumption: the view from theories of practice. In K. Green and S. Randles (eds.) Industrial Ecology and Spaces of Innovation, (2006), 220--237.",
      "doi": ""
    },
    {
      "text": "Rasmussen, M. K., Entwistle, J. M. and Nielsen, L. L. Understanding Energy Consumption at the Grundfos Dormitory Lab as Situated Practices. Alexandra Institute, 2014.",
      "doi": ""
    },
    {
      "text": "Reckwitz, A. Toward a Theory of Social Practices: A Development in Culturalist Theorizing. European Journal of Social Theory, 5, 2 (2002), 243--263.",
      "doi": ""
    },
    {
      "text": "Rogers, Y. HCI Theory: Classical, Modern, and Contemporary. Morgan & Claypool Publishers, 2012.",
      "doi": ""
    },
    {
      "text": "Røpke, I. Theories of practice -- New inspiration for ecological economic studies on consumption. Ecological Economics, 68, 10 (2009), 2409--2497.",
      "doi": ""
    },
    {
      "text": "Schatzki, T. R. Social Practices: A Wittgensteinian Approach to Human Activity and the Social. Cambridge University Press, 1996.",
      "doi": ""
    },
    {
      "text": "Schatzki, T. R., Cetina, K. K. and von Savigny, E., eds. The Practice Turn in Contemporary Theory. Routledge, 2001.",
      "doi": ""
    },
    {
      "text": "Scott, K., Quist, J. and Bakker, C. Co-design, social practices and sustainable innovation: involving users in a living lab exploratory study on bathing. In Proc. Joint Actions on Climate Change Conference, Aalborg, Denmark (2009), 8--9.",
      "doi": ""
    },
    {
      "text": "Shove, E. and Pantzar, M. Consumers, Producers and Practices: Understanding the invention and reinvention of Nordic walking. Journal of Consumer Culture, 5, 1 (2005), 43--64.",
      "doi": ""
    },
    {
      "text": "Shove, E., Pantzar, M. and Watson, M. The dynamics of social practice: everyday life and how it changes. Sage, 2012.",
      "doi": ""
    },
    {
      "text": "Star, S. L. This is Not a Boundary Object: Reflections on the Origin of a Concept. Science, Technology & Human Values, 35, 5 (2010), 601--617.",
      "doi": ""
    },
    {
      "text": "Stolterman, E. The Nature of Design Practice and Implications for Interaction Design Research, 2008.",
      "doi": ""
    },
    {
      "text": "Strengers, Y. Smart Energy in Everyday Life: Are You Designing for Resource Man? interactions, 21, 4 (2014), 24--31.  ",
      "doi": "10.1145/2621931"
    },
    {
      "text": "Strengers, Y. A. A. Designing eco-feedback systems for everyday life. In Proc. CHI '11, ACM Press (2011), 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Wakkary, R., Desjardins, A., Hauser, S. and Maestri, L. A sustainable design fiction: Green practices. ACM ACM Trans. Comput.-Hum. Interact, 20, 4 (2013), 23.  ",
      "doi": "10.1145/2494265"
    },
    {
      "text": "Warde, A. Consumption and Theories of Practice. Journal of Consumer Culture, 5, 2 (2005), 131--153.",
      "doi": ""
    },
    {
      "text": "Wenger, E. Communities of Practice: Learning, Meaning, and Identity. Cambridge University Press, 1998.",
      "doi": "10.1016/j.compedu.2011.06.007"
    }
  ]
}