{
  "doi": "10.1145/2702123.2702429",
  "title": "Masters of Control: Behavioral Patterns of Simultaneous Unit Group Manipulation in StarCraft 2",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3711-3720",
  "year": 2015,
  "badges": [],
  "abstract": "Most user interfaces require the user to focus on one element at a time, but StarCraft 2 is a game where players often control more than a hundred units simultaneously. The game interface provides an optional mechanism called \"control groups\" that allows players to select multiple units and assign them to a group in order to quickly recall previous selections of units. From an analysis of over 3,000 replays, we show that the usage of control groups is a key differentiator of individual players as well as players of different skill levels---novice users rarely use control groups while experts nearly always do. But players also behave differently in how they use their control groups, especially in time-pressured situations. While certain control group behaviors are common across all skill levels, expert players appear to be better at remaining composed and sustaining control group use in battle. We also qualitatively analyze discussions on web forums from players about how they use control groups to provide context about how such a simple interface mechanic has produced numerous ways of optimizing unit control.",
  "tags": [
    "player behavior",
    "skill",
    "video games",
    "control groups"
  ],
  "authors": [
    {
      "name": "Eddie Q. Yan",
      "institution": "University of California, Los Angeles, Los Angeles, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697085",
      "orcid": "missing"
    },
    {
      "name": "Jeff Huang",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447597481",
      "orcid": "missing"
    },
    {
      "name": "Gifford K. Cheung",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416595240",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blizzard. Wcs season 1 and 2 replays. http://media.blizzard.com/sc2/replays/ WCS-Season1-and-2-Replays.zip. Accessed August 30, 2014.",
      "doi": ""
    },
    {
      "text": "Brown, L. D., Cai, T. T., and DasGupta, A. Interval estimation for a binomial proportion. Statistical Science 16, 2 (2001), pp. 101--117.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. The keystroke-level model for user performance time with interactive systems. Commun. ACM 23, 7 (July 1980), 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Cheung, G., and Huang, J. Starcraft from the stands: understanding the game spectator. In Proceedings of CHI (2011), 763--772.  ",
      "doi": "10.1145/1978942.1979053"
    },
    {
      "text": "Faure, G., Chapuis, O., and Roussel, N. Power tools for copying and moving: useful stuff for your desktop. In Proceedings of CHI (2009), 1675--1678.  ",
      "doi": "10.1145/1518701.1518958"
    },
    {
      "text": "Fields, B., Wright, P., and Harrison, M. Time, tasks and errors. ACM SIGCHI Bulletin 28, 2 (1996), 53--56.  ",
      "doi": "10.1145/226650.226671"
    },
    {
      "text": "Forman, G., and Scholz, M. Apples-to-apples in cross-validation studies: Pitfalls in classifier performance measurement. SIGKDD Explor. Newsl. 12, 1 (Nov. 2010), 49--57.  ",
      "doi": "10.1145/1882471.1882479"
    },
    {
      "text": "Huang, J., Zimmermann, T., Nagapan, N., Harrison, C., and Phillips, B. C. Mastering the art of war: How patterns of gameplay influence skill in halo. In Proceedings of CHI (2013), 695--704.  ",
      "doi": "10.1145/2470654.2470753"
    },
    {
      "text": "Kim, G. sc2reader. http://sc2reader.readthedocs.org/, 2011.",
      "doi": ""
    },
    {
      "text": "Kirsh, D., and Rebotier, T. Passing the bubble: Cognitive eficiency of augmented video for collaborative transfer of situational understanding. Tech. rep., DTIC Document, 2003.",
      "doi": ""
    },
    {
      "text": "Lauradoux, C. Show me how you play and I will tell you who you are. In Atelier Protection de la Vie Privée (Soreze, France, June 2011).",
      "doi": ""
    },
    {
      "text": "Leggett, J., Williams, G., Usnick, M., and Longnecker, M. Dynamic identity verification via keystroke characteristics. International Journal of Man-Machine Studies 35, 6 (1991), 859--870.  ",
      "doi": "10.1016/S0020-7373%2805%2980165-8"
    },
    {
      "text": "Mason, W., and Clauset, A. Friends ftw! friendship and competition in halo: Reach. 375--386.",
      "doi": ""
    },
    {
      "text": "Norman, D. A. Emotional design. Ubiquity 2004, January (Jan. 2004), 1--1.  ",
      "doi": "10.1145/985600.966013"
    },
    {
      "text": "Pagulayan, R. J., Keeker, K., Wixon, D., Romero, R. L., and Fuller, T. User-centered design in games. The human-computer interaction handbook: fundamentals, evolving technologies and emerging applications (2003), 883--906. ",
      "doi": "10.5555/772072.772128"
    },
    {
      "text": "Pedregosa, F., Varoquaux, G., Gramfort, A., Michel, V., Thirion, B., Grisel, O., Blondel, M., Prettenhofer, P., Weiss, R., Dubourg, V., Vanderplas, J., Passos, A., Cournapeau, D., Brucher, M., Perrot, M., and Duchesnay, E. Scikit-learn: Machine learning in Python. Journal of Machine Learning Research 12 (2011), 2825--2830. ",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Strauss, A., and Corbin, J. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Taylor, T. Raising the Stakes: E-sports and the Professionalization of Computer Gaming. Mit Press, 2012. ",
      "doi": "10.5555/2209770"
    },
    {
      "text": "Thompson, J. J., Blair, M. R., Chen, L., and Henrey, A. J. Video game telemetry as a critical tool in the study of complex skill learning. PLoS ONE 8, 9 (2013), e75129.",
      "doi": ""
    },
    {
      "text": "Weber, B., and Mateas, M. A data mining approach to strategy prediction. In Computational Intelligence and Games, 2009. CIG 2009. IEEE Symposium on (Sept 2009), 140--147. ",
      "doi": "10.5555/1719293.1719324"
    }
  ]
}