{
  "doi": "10.1145/2702123.2702331",
  "title": "MultiFi: Multi Fidelity Interaction with Displays On and Around the Body",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3933-3942",
  "year": 2015,
  "badges": [],
  "abstract": "Display devices on and around the body such as smartwatches, head-mounted displays or tablets enable users to interact on the go. However, diverging input and output fidelities of these devices can lead to interaction seams that can inhibit efficient mobile interaction, when users employ multiple devices at once. We present MultiFi, an interactive system that combines the strengths of multiple displays and overcomes the seams of mobile interaction with widgets distributed over multiple devices. A comparative user study indicates that combined head-mounted display and smartwatch interfaces can outperform interaction with single wearable devices.",
  "authors": [
    {
      "name": "Jens Grubert",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020564",
      "orcid": "missing"
    },
    {
      "name": "Matthias Heinisch",
      "institution": "University of Technology Graz, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558407056",
      "orcid": "missing"
    },
    {
      "name": "Aaron Quigley",
      "institution": "The University of St Andrews, St Andrews, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502006",
      "orcid": "0000-0002-5274-6889"
    },
    {
      "name": "Dieter Schmalstieg",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100091694",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beaudouin-Lafon, M., Huot, S., Nancel, M., Mackay, W., Pietriga, E., Primet, R., Wagner, J., Chapuis, O., Pillias, C., Eagan, J., Gjerlufsen, T., and Klokmose, C. Multisurface interaction in the wild room. Computer, 45(4), 2012: 48--56.  ",
      "doi": "10.1109/MC.2012.110"
    },
    {
      "text": "Benko, H., Ishak, E. W., and Feiner, S. Crossdimensional gestural interaction techniques for hybrid immersive environments. VR 05. 2005, 209--216.  ",
      "doi": "10.1109/VR.2005.27"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., and DeRose, T. D. Toolglass and magic lenses: the see-through interface. SIGGRAPH. 1993, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Billinghurst, M., and Starner, T. Wearable devices: new ways to manage information. Computer, 32(1), 1999: 57--64.  ",
      "doi": "10.1109/2.738305"
    },
    {
      "text": "Billinghurst, M., Bowskill, J., Dyer, N., and Morphett, J. An evaluation of wearable information spaces. VRAIST 98. 1998, 20--27. ",
      "doi": "10.5555/522258.836113"
    },
    {
      "text": "Billinghurst, M., Grasset, R., and Looser, J. Designing augmented reality interfaces. SIGGRAPH CG, 39(1), 2005: 17--22.  ",
      "doi": "10.1145/1057792.1057803"
    },
    {
      "text": "Boring, S., Baur, D., Butz, A., Gustafson, S., and Baudisch, P. Touch projector: mobile interaction through video. CHI 10. 2010, 2287--2296.  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Budhiraja, R., Lee, G. A., and Billinghurst, M. Using a hhd with a hmd for mobile ar interaction. ISMAR 13. 2013, 1--6.",
      "doi": ""
    },
    {
      "text": "Chen, X., Marquardt, N., Tang, A., Boring, S., and Greenberg, S. Extending a mobile device's interaction space through body-centric interaction. MobileHCI 12. 2012, 151--160.  ",
      "doi": "10.1145/2371574.2371599"
    },
    {
      "text": "Chen, X., Grossman, T., Wigdor, D. J., and Fitzmaurice, G. Duet: exploring joint interactions on a smart phone and a smart watch. CHI 14. 2014, 159--168.  ",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Cockburn, A., Quinn, P., Gutwin, C., Ramos, G., and Looser, J. Air pointing: design and evaluation of spatial target acquisition with and without visual feedback. IJHCS, 69(6), 2011: 401--414.  ",
      "doi": "10.1016/j.ijhcs.2011.02.005"
    },
    {
      "text": "Delamare, W., Coutrix, C., and Nigay, L. Designing disambiguation techniques for pointing in the physical world. EICS 13. 2013, 197--206.  ",
      "doi": "10.1145/2494603.2480309"
    },
    {
      "text": "Ens, B., Hincapié-Ramos, J. D., and Irani, P. Ethereal planes: a design framework for 2d information space in 3d mixed reality environments. SUI 14. 2014, 2--12.  ",
      "doi": "10.1145/2659766.2659769"
    },
    {
      "text": "Ens, B., Finnegan, R., and Irani, P. The personal cockpit: a spatial interface for effective task switching on head-worn displays. CHI 14. 2014, 3171--3180.  ",
      "doi": "10.1145/2556288.2557058"
    },
    {
      "text": "Feiner, S., MacIntyre, B., Haupt, M., and Solomon, E. Windows on the world: 2d windows for 3d augmented reality. UIST 93. 1993, 145--155.  ",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Fitzmaurice, G. W. Situated information spaces and spatially aware palmtop computers. CACM, 36(7), 1993: 39--49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Greenberg, S., Marquardt, N., Ballendat, T., Diaz-Marino, R., and Wang, M. Proxemic interactions: the new ubicomp interactions, 18(1), 2011: 42--50.  ",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Grubert, J., Tuemler, J., Mecke, R., and Schenk, M. Comparative user study of two see-through calibration methods. VR 10. 2010, 269--270.",
      "doi": ""
    },
    {
      "text": "Grubert, J., Pahud, M., Grasset, R., Schmalstieg, D., and Seichter, H. The utility of magic lens interfaces on handheld devices for touristic map navigation. PMC, 2014:",
      "doi": ""
    },
    {
      "text": "Hart, S. G., and Staveland, L. E. Development of nasa-tlx (task load index): results of empirical and theoretical research. AIP, 52, 1988: 139--183.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Burmester, M., and Koller, F. Attrakdi: ein fragebogen zur messung wahrgenommener hedonischer und pragmatischer qualität. In: M&C 03. Springer, 2003, 187--196.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P., and Smith, M. Stitching: pen gestures that span multiple displays. AVI 04. 2004, 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Lewis, J. R. Psychometric evaluation of an afterscenario questionnaire for computer usability studies: the asq. SIGCHI Bulletin, 23(1), 1991: 78--81.  ",
      "doi": "10.1145/122672.122692"
    },
    {
      "text": "Li, F. C. Y., Dearman, D., and Truong, K. N. Virtual shelves: interactions with orientation aware devices. UIST 09. 2009, 125--128.  ",
      "doi": "10.1145/1622176.1622200"
    },
    {
      "text": "Olwal, A., Feiner, S., and Heyman, S. Rubbing and tapping for precise and rapid selection on touch-screen displays. CHI 08. 2008, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Perlin, K., and Fox, D. Pad: an alternative approach to the computer interface. SIGGRAPH 93. 1993, 57--64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Rädle, R., Jetter, H.-C., Marquardt, N., Reiterer, H., and Rogers, Y. Huddlelamp: spatially-aware mobile displays for ad-hoc around-the-table collaboration. ITS 14. 2014, 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Rashid, U., Nacenta, M. A., and Quigley, A. The cost of display switching: a comparison of mobile, large display and hybrid ui configurations. AVI 12. 2012, 99--106.  ",
      "doi": "10.1145/2254556.2254577"
    },
    {
      "text": "Reichenbacher, T. Adaptive concepts for a mobile cartography. JGS, 11(1), 2001: 43--53.",
      "doi": ""
    },
    {
      "text": "Reichlen, B. A. Sparcchair: a one hundred million pixel display. VRAIS 93. 1993, 300--307.  ",
      "doi": "10.1109/VRAIS.1993.380765"
    },
    {
      "text": "Rico, J., and Brewster, S. Gestures all around us: user differences in social acceptability perceptions of gesture based interfaces. MobileHCI 09. 2009, 64:1--64:2.  ",
      "doi": "10.1145/1613858.1613936"
    },
    {
      "text": "Vogel, D., and Baudisch, P. Shift: a technique for operating pen-based interfaces using touch. CHI 07. 2007, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Yang, J., and Wigdor, D. Panelrama: enabling easy specification of cross-device web applications. CHI 14. 2014, 2783--2792.  ",
      "doi": "10.1145/2556288.2557199"
    },
    {
      "text": "Zhao, J., Soukoré, R. W., Ren, X., and Balakrishnan, R. A model of scrolling on touch-sensitive displays. IJHCS, 72(12), 2014: 805--821.",
      "doi": ""
    }
  ]
}