{
  "doi": "10.1145/2702123.2702237",
  "title": "Investigating the Direct Manipulation of Ranking Tables for Time Navigation",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2703-2706",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We introduce a novel time navigation technique to update ranking tables by direct manipulation. The technique allows users to drag a table's cells to change the time period, while a line chart overlays on top of the table to provide an overview of the changes. The line chart is also a visual hint to control the pace at which data are updated. We explore the design and usability of this technique for table variations in size, time spans and data variability. We report the results of a usability study, using academic citation rankings and economic complexity datasets, and discuss design implications coming with real-world scenarios such as missing data and affordance.",
  "authors": [
    {
      "name": "Romain Vuillemot",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81361609844/rel-imgonly/romain_vuillemot_lyon_120x160.png",
      "acmid": "81361609844",
      "orcid": "missing"
    },
    {
      "name": "Charles Perin",
      "institution": "INRIA Saclay, Paris-Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557576356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amar, R., Eagan, J., and Stasko, J. Low-level components of analytic activity in information visualization. In Proc. INFOVIS '05, IEEE (2005), 15--.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Andrienko, N., and Andrienko, G. Exploratory Analysis of Spatial and Temporal Data: A Systematic Approach. Springer-Verlag New York, Inc., 2005. ",
      "doi": "10.5555/1121625"
    },
    {
      "text": "Benbasat, I., and Dexter, A. An investigation of the effectiveness of color and graphical information presentation under varying time constraints. MIS Q. 10, 1 (Mar. 1986), 59--83.  ",
      "doi": "10.2307/248881"
    },
    {
      "text": "Hausmann, R., and Hidalgo, C. A. The atlas of economic complexity: Mapping paths to prosperity. MIT Press, 2014.",
      "doi": ""
    },
    {
      "text": "Jarvenpaa, S. L., and Dickson, G. W. Graphics and managerial decision making: Research-based guidelines. Commun. ACM 31, 6 (June 1988), 764--774.  ",
      "doi": "10.1145/62959.62971"
    },
    {
      "text": "Perin, C., Vuillemot, R., and Fekete, J.-D. À table!: Improving temporal navigation in soccer ranking tables. In Proc. CHI '14, ACM (2014), 887--896.  ",
      "doi": "10.1145/2556288.2557379"
    },
    {
      "text": "Rao, R., and Card, S. K. The table lens: Merging graphical and symbolic representations in an interactive focus + context visualization for tabular information. In Proc. CHI '94, ACM (New York, NY, USA, 1994), 318--322.  ",
      "doi": "10.1145/191666.191776"
    },
    {
      "text": "Shneiderman, B. Direct manipulation: A step beyond programming languages. Computer 16, 8 (1983), 57--69.  ",
      "doi": "10.1109/MC.1983.1654471"
    }
  ]
}