{
  "doi": "10.1145/2702123.2702300",
  "title": "How Much Faster is Fast Enough?: User Perception of Latency & Latency Improvements in Direct and Indirect Touch",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "1827-1836",
  "year": 2015,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper reports on two experiments designed to further our understanding of users' perception of latency in touch- based systems. The first experiment extends previous efforts to measure latency perception by reporting on a unified study in which direct and indirect form-factors are compared for both tapping and dragging tasks. Our results show significant effects from both form-factor and task, and inform system designers as to what input latencies they should aim to achieve in a variety of system types. A follow-up experiment investigates peoples' ability to perceive small improvements to latency in direct and indirect form-factors for tapping and dragging tasks. Our results provide guidance to system designers of the relative value of making improvements in latency that reduce but do not fully eliminate lag from their systems.",
  "authors": [
    {
      "name": "Jonathan Deber",
      "institution": "University of Toronto & Tactual Labs, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556766756",
      "orcid": "missing"
    },
    {
      "name": "Ricardo Jota",
      "institution": "University of Toronto & Tactual Labs, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81416594286/rel-imgonly/img_0133.jpg",
      "acmid": "81416594286",
      "orcid": "missing"
    },
    {
      "name": "Clifton Forlines",
      "institution": "University of Toronto & Tactual Labs, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584798",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "Allison, R.S., Harris, L.R., Jenkin, M., Jasiobedzka, U., and Zacher, J.E. (2001). Tolerance of Temporal Delay in Virtual Environments. In Proc. IEEE VR '01, 247--254. ",
      "doi": "10.5555/580521.835823"
    },
    {
      "text": "Anderson, G., Doherty, R., and Ganapathy, S. (2011). User Perception of Touch Screen Latency. In Proc. Design, User Experience, and Usability (DUXU) '11, 195--202.",
      "doi": ""
    },
    {
      "text": "Annett, M., Ng, A., Dietz, P., Bischof, W.F., and Gupta, A. (2014). How Low Should We Go? Understanding the Perception of LatencyWhile Inking. In Proc. GI '14,167--174. ",
      "doi": "10.5555/2619648.2619677"
    },
    {
      "text": "Cheshire, S. (1996). Latency and the Quest for Interactivity. White paper for the Synchronous Person-toPerson Interactive Computing Env Meeting, Nov. 1996.",
      "doi": ""
    },
    {
      "text": "Ellis, S.R., Bréant, F., Manges, B., Jacoby, R., and Adelstein, B.D. (1997). Factors Influencing Operator Interaction with Virtual Objects Viewed via Head-Mounted See-Through Displays: Viewing Conditions and Rendering Latency. In Proc. IEEE VR '97, 138--145. ",
      "doi": "10.5555/523977.836086"
    },
    {
      "text": "Ellis, S.R., Young, M.J., Adelstein, B.D., and Ehrlich, S.M. (1999). Discrimination of Changes of Latency During Voluntary Hand Movements of Virtual Objects. In Proc. Human Factors and Ergonomics Society '99, 1182--1186.",
      "doi": ""
    },
    {
      "text": "Harris, L., Harrar, V., Jaekl, P., and Kopinska, A. (2010). Mechanisms of Simultaneity Constancy. In Nijhawan, R., and Khurana, B. (Eds.). Space and Time in Perception and Action. Cambridge: Cambridge University Press, 232--253.",
      "doi": ""
    },
    {
      "text": "Jota, R., Ng, A., Dietz, P., and Wigdor, D. (2013). How Fast is Fast Enough? A Study of the Effects of Latency in DirectTouch Pointing Tasks. In Proc. CHI '13, 2291--2300.  ",
      "doi": "10.1145/2470654.2481317"
    },
    {
      "text": "Kaaresoja, T., and Brewster, S. (2010). Feedback is Late: Measuring Multimodal Delays in Mobile Device Touchscreen Interaction. In Proc. ICMI '10, Article 2, 8 pages.  ",
      "doi": "10.1145/1891903.1891907"
    },
    {
      "text": "Kaaresoja, T., Brewster, S., and Lantz, V. (2014). Towards the Temporally Perfect Virtual Button: Touch-Feedback Simultaneity and Perceived Quality in Mobile Touchscreen Press Interactions. ACM Trans. Appl. Percept. 11, 2, Article 9 (Jun. 2014), 25 pages.  ",
      "doi": "10.1145/2611387"
    },
    {
      "text": "Kaernbach, C. (1991). Simple Adaptive Testing with the Weighted Up-Down Method. Perception & Psychophysics 49, 3 (Mar. 1991), 227--229.",
      "doi": ""
    },
    {
      "text": "Leigh, D., Forlines, C., Jota, R., Sanders, S., and Wigdor, D. (2014). High-Rate, Low-Latency Multi-Touch Sensing with Simultaneous Orthogonal Multiplexing. In Proc. UIST '14, 355--364.  ",
      "doi": "10.1145/2642918.2647353"
    },
    {
      "text": "Levitt, H. (1971). Transformed up-down methods in psychoacoustics. J. Acoustical Soc. of Am. 49, 2 (Feb. 1971), 467--477.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., and Ware, C. (1993). Lag as a Determinant of Human Performance in Interactive Systems. In Proc. CHI '93, 488--493. ",
      "doi": "10.1145/169059.169431"
    },
    {
      "text": "Meehan, M., Razzaque, S., Whitton, M.C., and Brooks, F.P. (2003). Effect of Latency on Presence in Stressful Virtual Environments. In Proc. IEEE VR '03, 141--138. ",
      "doi": "10.5555/832289.835964"
    },
    {
      "text": "Miller, R.B. (1968). Response Time in Man-Computer Conversational Transactions. In Proc. AFIPS '68, 267--277.  ",
      "doi": "10.1145/1476589.1476628"
    },
    {
      "text": "Nelson, W.T., Roe, M.M., Bolia, R.S., and Morley, R.M. (1998). Assessing Simulator Sickness in a See-Through HMD: Effects of Time Delay, Time on Task, and Task Complexity. In Proc. IMAGE '00.",
      "doi": ""
    },
    {
      "text": "Ng, A., Annett, M., Dietz, P., Gupta, A., and Bischof, W.F. (2014). In the Blink of an Eye: Investigating Latency Perception During Stylus Interaction. In Proc. CHI '14, 1103--1112.  ",
      "doi": "10.1145/2556288.2557037"
    },
    {
      "text": "Ng, A., Lepinski, J., Wigdor, D., Sanders, S., and Dietz, P. (2012). Designing for Low-Latency Direct-Touch Input. In Proc. UIST '12, 453--464.  ",
      "doi": "10.1145/2380116.2380174"
    },
    {
      "text": "Pavlovych, A., and Gutwin C. (2012). Assessing Target Acquisition and Tracking Performance for Moving Targets in the Presence of Latencyand Jitter. In Proc. GI '12, 109--116. ",
      "doi": "10.5555/2305276.2305295"
    },
    {
      "text": "Pavlovych, A., and Stürzlinger, W. (2011). Target Following Performance in the Presence of Latency, Jitter, and Signal Dropouts. In Proc. GI '11, 33--40. ",
      "doi": "10.5555/1992917.1992924"
    },
    {
      "text": "Pavlovych, A., and Stürzlinger, W. (2009). The Tradeoff between Spatial Jitter and Latency in Pointing Tasks. In Proc. ACM EICS '09, 187--196.  ",
      "doi": "10.1145/1570433.1570469"
    },
    {
      "text": "Savage, W.C. (1970). The Measurement of Sensation: A Critique of Perceptual Psychophysics. Berkley: UC Press.",
      "doi": ""
    },
    {
      "text": "So, R.H.Y., and Chung, G.K.M. (2005). Sensory Motor Responses in Virtual Environments: Studying the Effects of Image Latencies for Target-directed Hand Movement. In Proc. IEEE-EMBS '05, 5006--5008.",
      "doi": ""
    },
    {
      "text": "Steed, A. (2008). A Simple Method for Estimating the Latency of Interactive, Real-Time Graphics Simulations. In Proc. ACM VRST '08, 123--129.  ",
      "doi": "10.1145/1450579.1450606"
    },
    {
      "text": "Teather, R., Pavlovych, A., Stürzlinger, W., and MacKenzie, I.S. (2009). Effects of Tracking Technology, Latency, and Spatial Jitter on Object Movement. In Proc. 3DUI '09, 43--50.  ",
      "doi": "10.1109/3DUI.2009.4811204"
    },
    {
      "text": "Vogels, I.M.L.C. (2004). Detectionof Temporal Delays in Visual-Haptic Interfaces. Hum. Fact. 46, 1 (Spr. 2004), 118--134.",
      "doi": ""
    },
    {
      "text": "Ware, C., and Balakrishnan, R. (1994). Reaching for Objects in VR Displays: Lag and Frame Rate. ACM Trans. Comput.-Hum. Interact. 1, 4 (Dec. 1994), 331--356.  ",
      "doi": "10.1145/198425.198426"
    }
  ]
}