{
  "doi": "10.1145/2702123.2702411",
  "title": "The Known Stranger: Supporting Conversations between Strangers with Personalized Topic Suggestions",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "555-564",
  "year": 2015,
  "badges": [],
  "abstract": "Striking up a good conversation with new acquaintances is often a difficult problem. In this paper we report on the perceptions of wearable device users who were given real-time personalized topic suggestions during a conversation with a person they just met. Suggestions were generated using a ranking recommendation algorithm, and were delivered via Google Glasses. We conducted a study with 38 pairs of strangers, who received such suggestions while conversing for the first time. Participants found the suggestions to be helpful, but only at the right moments, and for certain types of speakers. Our results contribute to the understanding of how communication interventions influence people's experience and behaviors, and enhance interpersonal interactions. Our study also presents design implications for applications on wearable devices to facilitate conversations between strangers.",
  "authors": [
    {
      "name": "Tien T. Nguyen",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548027871",
      "orcid": "missing"
    },
    {
      "name": "Duyen T. Nguyen",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467656292",
      "orcid": "missing"
    },
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    }
  ],
  "references": [
    {
      "text": "Altman, I., & Taylor, D. A. (1973). Social penetration: The development of interpersonal relationships., Oxford: Holt, Rinehart & Winston.",
      "doi": ""
    },
    {
      "text": "Bergstrom, T., & Karahalios, K. (2007). Conversation Clock: Visualizing audio patterns in co-located groups. Proc. HICSS '07, 78--78.  ",
      "doi": "10.1109/HICSS.2007.151"
    },
    {
      "text": "Burgoon, J. K., & Hale, J. L. (1987). Validation and measurement of the fundamental themes of relational communication. Communication Monographs, 54, 1, 19--41.",
      "doi": ""
    },
    {
      "text": "Clark, H. (1992). Arenas of Language Use. Chicago: The University of Chicago Press & CSLI.",
      "doi": ""
    },
    {
      "text": "Clark, H. H., & Brennan, S. E. (1991). Grounding in communication. Perspectives on socially shared cognition, 13, 127--149.",
      "doi": ""
    },
    {
      "text": "Gosling, S. D., Rentfrow, P. J., & Swann Jr, W. B. (2003). A very brief measure of the Big-Five personality domains. Journal of Research in personality, 37, 6, 504528.",
      "doi": "10.1016/S0092-"
    },
    {
      "text": "Goffman, E. (1967). On face-work. In Interaction Ritual: Essays on Face-to-Face Behavior, 5--46. New York: Pantheon.",
      "doi": ""
    },
    {
      "text": "Granovetter, M. S. (1973). The strength of weak ties. American Journal of Sociology, 1360--1380.",
      "doi": ""
    },
    {
      "text": "Hannon, J., Bennett, M., & Smyth, B. (2010). Recommending twitter users to follow using content and collaborative filtering approaches. Proc. RecSys '12, 199--206.  ",
      "doi": "10.1145/1864708.1864746"
    },
    {
      "text": "Manning, C. D., Surdeanu, M., Bauer, J., Finkel, J., Bethard, S. J., & McClosky, D. (2014). The Stanford CoreNLP Natural Language Processing Toolkit. Proc. ALC'14, 55--60.",
      "doi": ""
    },
    {
      "text": "McCarthy, J. (2002). Using public displays to create conversation opportunities. Proc. CSCW'02 Workshop.",
      "doi": ""
    },
    {
      "text": "McLaughlin, M. L., & Cody, M. J. (1982). Awkward silences: Behavioral antecedents and consequences of the conversational lapse. Human Communication Research, 8, 4, 299--316.",
      "doi": ""
    },
    {
      "text": "Nguyen, T. T., Kluver, D., Wang, T. Y., Hui, P. M., Ekstrand, M. D., Willemsen, M. C., & Riedl, J. (2013). Rating support interfaces to improve user experience and recommender accuracy. Proc. RecSys '13, 149--156.  ",
      "doi": "10.1145/2507157.2507188"
    },
    {
      "text": "Nguyen, D. T., & Fussell, S. R. (2014). Lexical Cues of Interaction Involvement in Dyadic Instant Messaging Conversations. Discourse Processes, 51, 468--493.",
      "doi": ""
    },
    {
      "text": "Ofek, E., Iqbal, S. T., Strauss. K. (2013). Reducing Disruption from Subtle Information Delivery during a Conversation: Mode and Bandwidth Investigation. Proc. CHI'13, 3111--3120.  ",
      "doi": "10.1145/2470654.2466425"
    },
    {
      "text": "Parviz, B., Tan, D. (2011). Functional Contact Lens Monitors Blood Sugar Without Needles http://research.microsoft.com/enus/collaboration/stories/nui_contactlens_cs.pdf, retrieved 2014-09--17.",
      "doi": ""
    },
    {
      "text": "Powell, E., Brinkman, R., Barnes, T., & Catete, V. (2012). Table tilt: making friends fast. Proc. FDG'12, 242--245.  ",
      "doi": "10.1145/2282338.2282386"
    },
    {
      "text": "Resnick, P., Iacovou, N., Suchak, M., Bergstrom, P., & Riedl, J. (1994, October). GroupLens: an open architecture for collaborative filtering of netnews. Proc. CSCW 94, 175--186.  ",
      "doi": "10.1145/192844.192905"
    },
    {
      "text": "Rhodes, B. J. (1997). The wearable remembrance agent: A system for augmented memory. Personal Technologies, 1, 4, 218--224.",
      "doi": ""
    },
    {
      "text": "Rhodes, B. J., Minar, N., & Weaver, J. (1999). Wearable computing meets ubiquitous computing: Reaping the best of both worlds. Procs. of the 3rd International Symposium on Wearable Computers, 141--149. ",
      "doi": "10.5555/519309.856497"
    },
    {
      "text": "Sunnafrank, M. J., & Miller, G. R. (1981). The role of initial conversations in determining attraction to similar and dissimilar strangers. Human Communication Research, 8, 16--25.",
      "doi": ""
    },
    {
      "text": "Svennevig, J. (2000). Getting acquainted in conversation: a study of initial interactions (Vol. 64). Amsterdam: John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "Thorne, A. The press of personality: A study of conversations between introverts and extraverts. Journal of Personality and Social Psychology, 53, 718--726.",
      "doi": ""
    },
    {
      "text": "Tolmie, P., Crabtree, A., Rodden, T., & Benford. S. (2008). \"Are you watching this film or what?\": interruption and the juggling of cohorts. Procs. CSCW '08, 257--266.  ",
      "doi": "10.1145/1460563.1460605"
    },
    {
      "text": "Vig, J., Sen, S., & Riedl, J. (2012). The tag genome: Encoding community knowledge to support novel interaction. Proc. TIIS, 2, 13.  ",
      "doi": "10.1145/2362394.2362395"
    },
    {
      "text": "Wang, H. C., Cosley, D., & Fussell, S. R. (2010, February). Idea Expander: Supporting group brainstorming with conversationally triggered visual thinking stimuli. Proc. CSCW '10, 103--106.  ",
      "doi": "10.1145/1718918.1718938"
    },
    {
      "text": "Weiss, R. S. (1973). Loneliness: The experience of emotional and social isolation. Cambridge: MIT Press.",
      "doi": ""
    },
    {
      "text": "Wu, Z., & Palmer, M. (1994). Verbs semantics and lexical selection. Proc. ACL' 94, 133--138.  ",
      "doi": "10.3115/981732.981751"
    },
    {
      "text": "Yeo, Z. (2008). Emotional instant messaging with KIM. CHI'08 Extended Abstracts, 3729--3734.  ",
      "doi": "10.1145/1358628.1358921"
    },
    {
      "text": "Yoon, J., Oishi, J., Nawyn, J., Kobayashi, K., Gupta, N. (2004). FishPong: encouraging human-to-human interaction in informal social environments. Proc. CSCW '04, 374--377.  ",
      "doi": "10.1145/1031607.1031669"
    },
    {
      "text": "Yuan, C. W., Setlock, L. D., Cosley, D., & Fussell, S. R. (2013). Understanding informal communication in multilingual contexts. Proc. CSCW '13, 909--92  ",
      "doi": "10.1145/2441776.2441880"
    }
  ]
}