{
  "doi": "10.1145/2702123.2702373",
  "title": "TabLETS Get Physical: Non-Visual Text Entry on Tablet Devices",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "39-42",
  "year": 2015,
  "badges": [],
  "abstract": "Tablet devices can display full-size QWERTY keyboards similar to the physical ones. Yet, the lack of tactile feedback and the inability to rest the fingers on the home keys result in a highly demanding and slow exploration task for blind users. We present SpatialTouch, an input system that leverages previous experience with physical QWERTY keyboards, by supporting two-handed interaction through multitouch exploration and spatial, simultaneous audio feedback. We conducted a user study, with 30 novice touchscreen participants entering text under one of two conditions: (1) SpatialTouch or (2) mainstream accessibility method Explore by Touch. We show that SpatialTouch enables blind users to leverage previous experience as they do a better use of home keys and perform more efficient exploration paths. Results suggest that although SpatialTouch did not result in faster input rates overall, it was indeed able to leverage previous QWERTY experience in contrast to Explore by Touch.",
  "authors": [
    {
      "name": "João Guerreiro",
      "institution": "Instituto Superior Técnico, Universidade de Lisboa & INESC-ID, Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467649970",
      "orcid": "0000-0002-0952-8368"
    },
    {
      "name": "André Rodrigues",
      "institution": "Universidade de Lisboa, Lisboa, Portugal",
      "img": "/do/10.1145/contrib-99658688286/rel-imgonly/picture1.jpg",
      "acmid": "99658688286",
      "orcid": "0000-0002-0810-4619"
    },
    {
      "name": "Kyle Montague",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-81472655898/rel-imgonly/xsmall_profile.jpg",
      "acmid": "81472655898",
      "orcid": "missing"
    },
    {
      "name": "Tiago Guerreiro",
      "institution": "University of Lisbon, Lisbon, Portugal",
      "img": "/do/10.1145/contrib-81350573788/rel-imgonly/aa.jpg",
      "acmid": "81350573788",
      "orcid": "0000-0002-0333-5792"
    },
    {
      "name": "Hugo Nicolau",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-81416594384/rel-imgonly/me_small.png",
      "acmid": "81416594384",
      "orcid": "0000-0002-8176-7638"
    },
    {
      "name": "Daniel Gonçalves",
      "institution": "Universidade de Lisboa & INESC-ID, Lisboa, Portugal",
      "img": "/do/10.1145/contrib-81100240223/rel-imgonly/317_face.jpg",
      "acmid": "81100240223",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azenkot, S. et al. Input finger detection for nonvisual touch screen text entry in Perkinput. In Proceedings of Graphics Interface (2012) ",
      "doi": "10.5555/2305276.2305297"
    },
    {
      "text": "Barrett, J. Performance effects of reduced proprioceptive feedback on touch typists and casual users in a typing task. Behaviour & Information Tech. 13 (6) (1994).",
      "doi": ""
    },
    {
      "text": "Brungart, D. S., Simpson, B. D. Improving multitalker speech communication with advanced audio displays. Air Force Res. Lab Wright Patterson AFN OH (2005).",
      "doi": ""
    },
    {
      "text": "Guerreiro, J., Gonçalves, D. Text-to-Speeches: Evaluating the Perception of Concurrent Speech by Blind People. In Proceedings of ASSETS (2014).  ",
      "doi": "10.1145/2661334.2661367"
    },
    {
      "text": "Kim, S et al. TapBoard: making a touch screen keyboard more touchable. In Proceedings of CHI (2013).  ",
      "doi": "10.1145/2470654.2470733"
    },
    {
      "text": "Nicolau, H. et al. B#: chord-based correction for multitouch braille input. In Proceedings of CHI (2014).  ",
      "doi": "10.1145/2556288.2557269"
    },
    {
      "text": "Oliveira, J. et al. Blind people and mobile touch-based text-entry: acknowledging the need for different flavors. In Proceedings of ASSETS (2011).  ",
      "doi": "10.1145/2049536.2049569"
    },
    {
      "text": "Rodrigues, A., Guerreiro, T. SWAT: Mobile System-Wide Assistive technologies. Proceedings of BCS HCI (2014). ",
      "doi": "10.5555/2742941.2742991"
    },
    {
      "text": "Southern, C. et al. An evaluation of BrailleTouch: mobile touchscreen text entry for the visually impaired. In Proceedings of Mobile HCI (2012).  ",
      "doi": "10.1145/2371574.2371623"
    }
  ]
}