{
  "doi": "10.1145/2702123.2702432",
  "title": "Quantifying and Mitigating the Negative Effects of Local Latencies on Aiming in 3D Shooter Games",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "135-144",
  "year": 2015,
  "badges": [],
  "abstract": "Real-time games such as first-person shooters (FPS) are sensitive to even small amounts of lag. The effects of net-work latency have been studied, but less is known about local latency, the lag caused by input devices and displays. While local latency is important to gamers, we do not know how it affects aiming performance and whether we can reduce its negative effects. To explore these issues, we tested local latency in a variety of real-world gaming scenarios and carried out a controlled study focusing on targeting and tracking activities in an FPS game with varying degrees of local latency. In addition, we tested the ability of a lag compensation technique (based on aim assistance) to mitigate the negative effects. Our study found local latencies in the real-world range from 23 to 243 ms which cause significant and substantial degradation in performance (even for latencies as low as 41 ms). The study also showed that our compensation technique worked extremely well, reducing the problems caused by lag in the case of targeting, and removing the problem altogether in the case of tracking. Our work shows that local latency is a real and substantial problem -- but games can mitigate the problem with appropriate compensation methods.",
  "tags": [
    "targeting",
    "aiming",
    "lag",
    "local latency",
    "fps games"
  ],
  "authors": [
    {
      "name": "Zenja Ivkovic",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553616256",
      "orcid": "missing"
    },
    {
      "name": "Ian Stavness",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-81319501712/rel-imgonly/ianstavness.jpg",
      "acmid": "81319501712",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Steven Sutcliffe",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557483656",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J., and Zhai, S. Refining Fitts' law models for bivariate pointing. CHI 2003, 193--200.  ",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "Beigbeder, T., et al. The effects of loss and latency on user performance in Unreal Tournament. NetGames 2004, 144--51.  ",
      "doi": "10.1145/1016540.1016556"
    },
    {
      "text": "Braga Sangiorgi, U., et al. Assessing lag perception in electronic sketching. NordiCHI 2012, 153--161.  ",
      "doi": "10.1145/2399016.2399040"
    },
    {
      "text": "Chen, L., et al., An HCI method to improve human performance reduced by local-lag mechanism, Interacting with Computers 19, 2 (2007), 215--224.  ",
      "doi": "10.1016/j.intcom.2006.05.009"
    },
    {
      "text": "Elliott, D., Helsen, W., and Chua, R. A century later: Woodworth's (1899) two-component model of goal-directed aiming. Psych. Bulletin 127, 3, 2001, 342.",
      "doi": ""
    },
    {
      "text": "Fritsch, T., Ritter, H., and Schiller, J. The effect of latency and network limitations on MMORPGs: a field study of Everquest2. SIGCOMM 2005, 1--9.  ",
      "doi": "10.1145/1103599.1103623"
    },
    {
      "text": "Ghez, C., & Krakauer, J. The organization of movement. Principles of neural science 4, 2000, 653--73.",
      "doi": ""
    },
    {
      "text": "Gutwin, C. The effects of network delay on group work in shared workspaces, Proc. ECSCW 2001, 299--318. ",
      "doi": "10.5555/1241867.1241883"
    },
    {
      "text": "Isokoski, P., et al. Gaze controlled games. Universal Access in the Information Society 8, 4, 2009, 323--337.  ",
      "doi": "10.1007/s10209-009-0146-3"
    },
    {
      "text": "Jörg, S., Normoyle, A., and Safonova, A. How responsiveness affects players' perception in digital games. In Proc. Applied Perception 2012, 33--38.  ",
      "doi": "10.1145/2338676.2338683"
    },
    {
      "text": "Jota, R., Ng, A., Dietz, P., and Wigdor, D. How fast is fast enough?: a study of the effects of latency in directtouch pointing tasks. CHI 2013, 2291--2300.  ",
      "doi": "10.1145/2470654.2481317"
    },
    {
      "text": "Kopper, R., et al. A human motor behavior model for distal pointing tasks. IJHCS 68, 10, 2010, 603--615.  ",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "Leadbetter, R. Console Gaming: the Lag Factor. (2009) eurogamer.net/articles/digitalfoundry-lag-factor-article",
      "doi": ""
    },
    {
      "text": "Lee, B., Bang, H. A kinematic analysis of directional effects on mouse control. Ergon. 56, 11, 2013, 1754--65.",
      "doi": ""
    },
    {
      "text": "Looser, J., Cockburn, A. and Savage, J. On the validity of using First-Person Shooters for Fitts' law studies. People and Computers 2005, 33--36.",
      "doi": ""
    },
    {
      "text": "MacKenzie I., Ware C. Lag as a determinant of human performance in interactive systems. CHI 1993, 488--493. ",
      "doi": "10.5555/164632.164979"
    },
    {
      "text": "Mandryk, R.L., and Gutwin, C. Perceptibility and utility of sticky targets. In Proc. GI 2008, 65--72. ",
      "doi": "10.5555/1375714.1375726"
    },
    {
      "text": "Matejka, J., Grossman, T., and Fitzmaurice, G. Swift: reducing the effects of latency in online video scrubbing. CHI 2012, 637--646.  ",
      "doi": "10.1145/2207676.2207766"
    },
    {
      "text": "Pantel, L. and Wolf, L. On the impact of delay realtime multiplayer games. Proc. NOSSDAV 2002, 23--29.  ",
      "doi": "10.1145/507670.507674"
    },
    {
      "text": "Pavlovych, A., and Stuerzlinger, W. Target following performance in the presence of latency, jitter, and signal dropouts. Proc. GI 2011, 33--40. ",
      "doi": "10.5555/1992917.1992924"
    },
    {
      "text": "Pavlovych, A., and Gutwin, C. Assessing target acquisition and tracking performance for complex moving targets in the presence of latency. GI 2012, 109--116. ",
      "doi": "10.5555/2305276.2305295"
    },
    {
      "text": "Savery, C., Graham, T.C., and Gutwin, C. The human factors of consistency maintenance in multiplayer computer games. CSCW 2010, 187--196.  ",
      "doi": "10.1145/1880071.1880103"
    },
    {
      "text": "So, R., Chung, G. Sensory motor responses in virtual environments. IEEE EMBS 2005, 5006--8.",
      "doi": ""
    },
    {
      "text": "Stuckel, D., and Gutwin, C. The effects of local lag on tightly-coupled interaction in distributed groupware CSCW 2008, 447--456.  ",
      "doi": "10.1145/1460563.1460635"
    },
    {
      "text": "Vicencio-Moreira, R., et al. The effectiveness (or lack thereof) of aim-assist techniques in first person shooter games. CHI 2014, 937--46.  ",
      "doi": "10.1145/2556288.2557308"
    },
    {
      "text": "Ware, C., Balakrishnan, R. Reaching for objects in VR displays: lag and frame rate. ToCHI 1, 4, 1994, 331--356.  ",
      "doi": "10.1145/198425.198426"
    },
    {
      "text": "Wattimena, A.F., et al. Predicting the perceived quality of a first person shooter: the Quake IV G-model. SIGCOMM, 2006, 42.  ",
      "doi": "10.1145/1230040.1230052"
    },
    {
      "text": "Wilson, D. Triple Buffering: why we love it. Feb 2009. http://www.anandtech.com/show/2794/4.",
      "doi": ""
    }
  ]
}