{
  "doi": "10.1145/2702123.2702541",
  "title": "Supporting the Modern Polyglot: A Comparison of Multilingual Search Interfaces",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3483-3492",
  "year": 2015,
  "badges": [],
  "abstract": "The unrelenting rise in online user diversification has generated tremendous new challenges for search system providers. Among these, the need to address multiple user language abilities and preferences is paramount. The majority of research on multilingual search has so far focused on improving retrieval and translation techniques in cross-language information retrieval. However, less research has focused on the human-computer interaction aspects of multilingual search, particularly in terms of multilingual result display interfaces. To address this research gap, this paper presents a comparison of 5 different search interface designs for multilingual search. We analyze and evaluate these interfaces through a crowd-based experiment involving 885 participants. Our results show that the common approach of interleaving multilingual results is in fact the least preferred, whereas single-page displays with clear language separation are most preferred. In addition, we show that user proficiency and search content type play an important role in user preferences, and that different interfaces elicit different user behaviors.",
  "tags": [
    "multilingual search",
    "evaluation",
    "crowd-sourcing",
    "human-computer information retrieval",
    "multilingual interfaces"
  ],
  "authors": [
    {
      "name": "Ben Steichen",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659574514",
      "orcid": "missing"
    },
    {
      "name": "Luanne Freund",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81100165051/rel-imgonly/81100165051.jpg",
      "acmid": "81100165051",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agirre, E., Nunzio, G.M.D., Ferro, N., Mandl, T., and Peters, C. CLEF 2008: Ad Hoc Track Overview. Evaluating Systems for Multilingual and Multimodal Information Access, (2009), 15--37. ",
      "doi": "10.5555/1813809.1813813"
    },
    {
      "text": "Amato, G., Debole, F., Peters, C., and Savino, P. The MultiMatch Prototype: Multilingual/Multimedia Search for Cultural Heritage Objects. Research and Adv. Technol. for Digital Libraries, (2008), 385--387.  ",
      "doi": "10.1007/978-3-540-87599-4_40"
    },
    {
      "text": "Borlund, P. The IIR evaluation model: a framework for evaluation of interactive information retrieval systems. Information Research 8, 3 (2003).",
      "doi": ""
    },
    {
      "text": "Bradley, R.A. Paired comparisons: Some basic procedures and examples. Nonparametric Methods 4, (1984), 299--326.",
      "doi": ""
    },
    {
      "text": "Braschler, M. Combination Approaches for Multilingual Text Retrieval. Information Retrieval, 7, 1--2 (2004), 183--204.  ",
      "doi": "10.1023/B%3AINRT.0000009445.19495.46"
    },
    {
      "text": "Bron, M., van Gorp, J., Nack, F., Baltussen, L.B., and de Rijke, M. Aggregated Search Interface Preferences in Multi-session Search Tasks. Proc. of 36th Int. ACM SIGIR Conf. on Research and Development in Information Retrieval, (2013), 123--132.  ",
      "doi": "10.1145/2484028.2484050"
    },
    {
      "text": "Capstick, J., Diagne, A.K., Erbach, G., Uszkoreit, H., Leisenberg, A., and Leisenberg, M. A system for supporting cross-lingual information retrieval. Inf. Process. & Manage. 36, 2 (2000), 275--289.  ",
      "doi": "10.1016/S0306-4573%2899%2900058-8"
    },
    {
      "text": "Clough, P., Al-Maskari, A., and Darwish, K. Providing Multilingual Access to FLICKR for Arabic Users. Evaluation of Multilingual and Multi-modal Information Retrieval, (2007), 205--216. ",
      "doi": "10.5555/2393955.2393991"
    },
    {
      "text": "Gladwell, M. Blink: The Power of Thinking Without Thinking. Back Bay Books, New York, 2006.",
      "doi": ""
    },
    {
      "text": "Marlow, J., Clough, P., Recuero, J.C., and Artiles, J. Exploring the effects of language skills on multilingual web search. Proc. of 30th European conf. on Advances in information retrieval, (2008), 126--137. ",
      "doi": "10.5555/1793274.1793293"
    },
    {
      "text": "Oard, D.W., He, D., and Wang, J. User-assisted query translation for interactive cross-language information retrieval. Inf. Proc. & Manage. 44, 1 (2008), 181--211.  ",
      "doi": "10.1016/j.ipm.2006.12.009"
    },
    {
      "text": "Peinado, V., Artiles, J., Barker, E., and LopezOstenero, F. FlickLing: a Multilingual Search Interface for Flickr. Working Notes - CLEF Workshop, (2008).",
      "doi": ""
    },
    {
      "text": "Peters, C., Braschler, M., and Clough, P. Multilingual Information Retrieval: From Research To Practice, chapt. 4, Springer Science & Business Media, (2012).",
      "doi": ""
    },
    {
      "text": "Petrelli, D., Levin, S., Beaulieu, M., and Sanderson, M. Which user interaction for cross-language information retrieval? Design issues and reflections. J. Assoc. Inf. Sci. Technol., 57, 5 (2006), 709--722.  ",
      "doi": "10.5555/1124136.1124149"
    },
    {
      "text": "Reinecke, K. and Gajos, K.Z. Quantifying Visual Preferences Around the World. Proc. of SIGCHI Conf. on Human Factors in Computing Syst., (2014), 11--20.  ",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Steichen, B., Ghorab, M.R., Lawless, S., O'Connor, A., and Wade, V. Towards Personalized Multilingual Information Access - Exploring the Browsing and Search Behavior of Multilingual Users. Proc. of int. conf. on User Modeling, Adaptation, and Personalization, (2014), 435--446.",
      "doi": ""
    },
    {
      "text": "Sushmita, S., Joho, H., Lalmas, M., and Villa, R. Factors Affecting Click-through Behavior in Aggregated Search Interfaces. Proc. of 19th Int. Conf. on Inf. and Knowledge Management, (2010), 519--528.  ",
      "doi": "10.1145/1871437.1871506"
    },
    {
      "text": "Thomas, P., Noack, K., and Paris, C. Evaluating Interfaces for Government Metasearch. Proc. of 3rd Symp. on Inform. Interac. in Context, (2010), 65--74.  ",
      "doi": "10.1145/1840784.1840796"
    },
    {
      "text": "Turner, H. and Firth, D. Bradley-Terry models in R: the BradleyTerry2 package. Journal of Statistical Software 48, 10 (2012).",
      "doi": ""
    },
    {
      "text": "Zuccon, G., Leelanupab, T., Whiting, S., Yilmaz, E., Jose, J.M., and Azzopardi, L. Crowdsourcing interactions: using crowdsourcing for evaluating interactive information retrieval systems. Information Retrieval 16, 2 (2013), 267--305.  ",
      "doi": "10.1007/s10791-012-9206-z"
    }
  ]
}