{
  "doi": "10.1145/2702123.2702239",
  "title": "Designing Information for Remediating Cognitive Biases in Decision-Making",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "2211-2220",
  "year": 2015,
  "badges": [],
  "abstract": "Software is playing an increasingly important role in supporting human decision-making. Previous HCI research on decision support systems (DSS) has improved the information visualization aspect of DSS information design, but has somewhat overlooked the cognitive aspect of decision-making, namely that human reasoning is heuristic and reflects systematic errors or cognitive biases. We report on an empirical study of two cognitive biases: conservatism and loss aversion. Two remediation techniques recommended by previous research were tested: the expected return method, an actuarial-inspired approach presenting objective metrics; and bootstrapping, a technique successful in improving judgment consistency. The results show that the two biases can occur simultaneously and can have a huge impact on decision-making. The results also show that the two debiasing techniques are only partly effective. These findings suggest a need for more research on debiasing, and indicate some directions for exploring debiasing techniques and building decision support systems.",
  "tags": [
    "multiple-cue probability learning",
    "cognitive bias",
    "decision support system",
    "intelligent assistance",
    "loss aversion",
    "decision making",
    "conservatism"
  ],
  "authors": [
    {
      "name": "Yunfeng Zhang",
      "institution": "University of Oregon, Eugene, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658899757",
      "orcid": "missing"
    },
    {
      "name": "Rachel K.E. Bellamy",
      "institution": "IBM T. J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100257325",
      "orcid": "missing"
    },
    {
      "name": "Wendy A. Kellogg",
      "institution": "IBM T.J. Watson Research Center, Yorktown Heights, NY, USA",
      "img": "/do/10.1145/contrib-81100457150/rel-imgonly/81100457150.jpg",
      "acmid": "81100457150",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bornstein, B. H., and Emler, A. C. Rationality in medical decision making: a review of the literature on doctors' decision-making biases. Journal of Evaluation in Clinical Practice 7, 2 (2001), 97--107.",
      "doi": ""
    },
    {
      "text": "Brenner, L., Griffin, D., and Koehler, D. J. Modeling patterns of probability calibration with random support theory: Diagnosing case-based judgment. Organizational Behavior and Human Decision Processes 97, 1 (2005), 64--81.",
      "doi": ""
    },
    {
      "text": "Daradkeh, M., Churcher, C., and McKinnon, A. Supporting informed decision-making under uncertainty and risk through interactive visualization. In Proceedings of Fourteenth Australasian User Interface Conference (AUGIC2013) (Adelaide, Australia, 2013). ",
      "doi": "10.5555/2525493.2525496"
    },
    {
      "text": "Dawes, R. M., and Corrigan, B. Linear models in decision making. Psychological Bulletin 81, 2 (1974), 95--106.",
      "doi": ""
    },
    {
      "text": "Erev, I., Wallsten, T. S., and Budescu, D. V. Simultaneous over- and underconfidence: The role of error in judgment processes. Psychological Review 101, 3 (1994), 519--527.",
      "doi": ""
    },
    {
      "text": "Fischhoff, B., Slovic, P., and Lichtenstein, S. Knowing with certainty: The appropriateness of extreme confidence. Journal of Experimental Psychology: Human Perception and Performance 3, 4 (1977), 552--564.",
      "doi": ""
    },
    {
      "text": "Hogarth, R. M., and Karelaia, N. Heuristic and linear models of judgment: Matching rules and environments. Psychological Review 114, 3 (2007), 733--758.",
      "doi": ""
    },
    {
      "text": "Kadiyala, P., and Rau, P. R. Investor reaction to corporate event announcements: underreaction or overreaction? The Journal of Business 77, 2 (2004), 357--386.",
      "doi": ""
    },
    {
      "text": "Karelaia, N., and Hogarth, R. M. Determinants of linear judgment: A meta-analysis of lens model studies. Psychological Bulletin 134, 3 (2008), 404--426.",
      "doi": ""
    },
    {
      "text": "Larrick, R. P. Debiasing. In Blackwell handbook of judgment and decision making, D. J. Koehler and N. Harvey, Eds. John Wiley & Sons, 2004, 316--337.",
      "doi": ""
    },
    {
      "text": "Lee, M. K., Kiesler, S., and Forlizzi, J. Mining behavioral economics to design persuasive technology for healthy choices. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, CHI '11 (2011), 325--334.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "O'Connor, M., Remus, W., and Lim, K. Improving judgmental forecasts with judgmental bootstrapping and task feedback support. Journal of Behavioral Decision Making 18, 4 (Oct 2005), 247--260.",
      "doi": ""
    },
    {
      "text": "Rakow, T., Demes, K. A., and Newell, B. R. Biased samples not mode of presentation: Re-examining the apparent underweighting of rare events in experience-based choice. Organizational Behavior and Human Decision Processes 106, 2 (Jul 2008), 168--179.",
      "doi": ""
    },
    {
      "text": "Samanez-Larkin, G. R., Wagner, A. D., and Knutson, B. Expected value information improves financial risk taking across the adult life span. Social Cognitive and Affective Neuroscience 6, 2 (2010), 207--217.",
      "doi": ""
    },
    {
      "text": "Shanteau, J. Psychological characteristics of expert decision makers. In Expert judgment and expert systems. Springer, 1987, 289--304. ",
      "doi": "10.5555/39590.39606"
    },
    {
      "text": "Shen-Hsieh, A., and Schindl, M. Data visualization for strategic decision making. In Case Studies of the CHI2002 (2002), 1--17.  ",
      "doi": "10.1145/507752.507756"
    },
    {
      "text": "Solomon, J. Customization bias in decision support systems. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, CHI '14 (2014), 3065--3074.  ",
      "doi": "10.1145/2556288.2557211"
    },
    {
      "text": "Thaler, R. H., Tversky, A., Kahneman, D., and Schwartz, A. The effect of myopia and loss aversion on risk taking: An experimental test. The Quarterly Journal of Economics 112, 2 (May 1997), 647--661.",
      "doi": ""
    },
    {
      "text": "Tversky, A., and Kahneman, D. Advances in prospect theory: Cumulative representation of uncertainty. Journal of Risk and Uncertainty 5, 4 (1992), 297--323.",
      "doi": ""
    },
    {
      "text": "Whaley, J. The first UK giant oil field. GEO ExPro 7, 3 (2010).",
      "doi": ""
    },
    {
      "text": "Zacharakis, A. L., and Meyer, G. A lack of insight: Do venture capitalists really understand their own decision process? Journal of Business Venturing 13, 1 (1998), 57--76.",
      "doi": ""
    },
    {
      "text": "Zhao, J. C., Fu, W.-T., Zhang, H., Zhao, S., and Duh, H. B.-L. To risk or not to risk? improving financial risk-taking of older adults by online social information. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing, CSCW '15 (2015), to appear.  ",
      "doi": "10.1145/2675133.2685033"
    }
  ]
}