{
  "doi": "10.1145/2702123.2702294",
  "title": "Success & Scale in a Data-Producing Organization: The Socio-Technical Evolution of OpenStreetMap in Response to Humanitarian Events",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "4113-4122",
  "year": 2015,
  "badges": [],
  "abstract": "OpenStreetMap (OSM) is a volunteer-driven, globally distributed organization whose members work to create a common digital map of the world. OSM embraces ideals of open data, and to that end innovates both socially and technically to develop practices and processes for coordinated operation. This paper provides a brief history of OSM and then, through quantitative and qualitative examination of the OSM database and other sites of articulation work, examines organizational growth through the lens of two catastrophes that spurred enormous humanitarian relief responses-the 2010 Haiti Earthquake and the 2013 Typhoon Yolanda. The temporally- and geographically- constrained events scope analysis for what is a rapidly maturing, whole-planet operation. The first disaster identified how OSM could support other organizations responding to the event. However, to achieve this, OSM has had to refine mechanisms of collaboration around map creation, which were tested again in Typhoon Yolanda. The transformation of work between these two events yields insights into the organizational development of large, data-producing online organizations.",
  "tags": [
    "crowdwork",
    "open data",
    "crisis informatics",
    "mapping",
    "social computing",
    "organizational behavior",
    "geospatial data"
  ],
  "authors": [
    {
      "name": "Leysia Palen",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    },
    {
      "name": "Robert Soden",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704911",
      "orcid": "0000-0003-2657-0485"
    },
    {
      "name": "T. Jennings Anderson",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658998387",
      "orcid": "missing"
    },
    {
      "name": "Mario Barrenechea",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81502758117/rel-imgonly/mario.jpeg",
      "acmid": "81502758117",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bernstein, M., Little, G., Miller, R., Hartmann, B., Ackerman, M., Karger, D., Crowell, D., Panovich, K. Soylent: a word processor with a crowd inside. Proc. of UIST (2010), 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Beschastnikh, I., Kriplean, T., McDonald, D. W. Wikipedian Self-Governance in Action: Motivating the Policy Lens. Proc of ICWSM. (2008).",
      "doi": ""
    },
    {
      "text": "Bietz, M., Ferro, T., Lee, C. Sustaining the development of cyberinfrastructure: an organization adapting to change. Proc of CSCW (2012), 901--910.  ",
      "doi": "10.1145/2145204.2145339"
    },
    {
      "text": "Budhathoki, N., Haythornthwaite, C. Motivation for open collaboration crowd and community models and the case of OpenStreetMap. American Behavioral Scientist 54, 5 (2013), 548--575.",
      "doi": ""
    },
    {
      "text": "Chilton, S. Crowdsourcing is radically changing the geodata landscape: case study of OpenStreetMap. Proc. of UK Cartographic Conf, (2009).",
      "doi": ""
    },
    {
      "text": "Fairhurst, R. OpenStreetMap opens up to more contributors with easy \"add a note\" feature. OSM Foundation Blog. (4/29/13).",
      "doi": ""
    },
    {
      "text": "Forte, A, Bruckman, A. Scaling consensus: Increasing decentralization in Wikipedia governance. Proc of HICSS, 2008.  ",
      "doi": "10.1109/HICSS.2008.383"
    },
    {
      "text": "Haklay, M. How good is volunteered geographical information? A comparative study of OpenStreetMap & Ordnance Survey datasets. Environment & Planning B: Planning & Design 34, 4 (2010), 682--703.",
      "doi": ""
    },
    {
      "text": "Haklay, M., Antoniou, V., Basiouka, S., R Soden, R., Mooney, P. Crowdsourced Geographic Information Use in Government. World Bank. (2014).",
      "doi": ""
    },
    {
      "text": "Halfaker, A., Geiger, R. S., Morgan, J. T., Riedl, J. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist. (2012).",
      "doi": ""
    },
    {
      "text": "Hecht, B., Schöning, J., Erickson, T., Preidhorsky, R. Geographic Human Interaction. Ext. Proc, of CHI (2011).  ",
      "doi": "10.1145/1979742.1979532"
    },
    {
      "text": "HOT Tasking Manager. Typhoon Haiyan. http://tasks.hotosm.org/job/350.",
      "doi": ""
    },
    {
      "text": "Hristova, D., Quattrone, G., Mashhadi, A. J., Capra, L. The Life of the Party: Impact of Social Mapping in OpenStreetMap. Proc of ICWSM (2013).",
      "doi": ""
    },
    {
      "text": "Human Rights Watch (HRW). World Report 2011. Seven Stories Press (2011).",
      "doi": ""
    },
    {
      "text": "ITO World Blog. January 20, 2010. http://itoworld.blogspot.com/2010/01/mapping-crisisopenstreetmap-response.html.",
      "doi": ""
    },
    {
      "text": "Keegan, B, Gergle, D, Contractor, N. Hot off the wiki: dynamics, practices, and structures in Wikipedia's coverage of the Tohoku catastrophes. Proc of WikiSym, (2011).  ",
      "doi": "10.1145/2038558.2038577"
    },
    {
      "text": "Lam, STK., Uduwage, A., Dong, Z., Sen, S., Musicant, D. R., Terveen, L., Riedl, J. WP: clubhouse: An exploration of Wikipedia's gender imbalance. Symposium on Wikis & Open Collaboration. (2011).  ",
      "doi": "10.1145/2038558.2038560"
    },
    {
      "text": "Lave, J., Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge Univ, (1991), 138.",
      "doi": ""
    },
    {
      "text": "Lin, Y. A qualitative enquiry into OpenStreetMap making. New Review of Hypermedia and Multimedia 17, 1 (2011), 53--71.  ",
      "doi": "10.1080/13614568.2011.552647"
    },
    {
      "text": "Mileti, D.S. 1999. Disasters by Design: A Reassessment of Natural Hazards in the US. Joseph Henry D.C.",
      "doi": ""
    },
    {
      "text": "Mooney, P, & Corcoran, P. How social is OSM. In Proc of AGILE Conf on GIS. 2012. (24--27).",
      "doi": ""
    },
    {
      "text": "OpenStreetMap Development. http://pierzen.dev.openstreetmap.org/hot/leaflet/OSMCompare-before-after-philippines.html.",
      "doi": ""
    },
    {
      "text": "OSM Foundation. We are Changing the License. (2012).",
      "doi": ""
    },
    {
      "text": "Priedhorsky, R., Jordan, B., Terveen, L. How a personalized geowiki can help bicyclists share information more effectively. WikiSym, (2007), 93--98.  ",
      "doi": "10.1145/1296951.1296962"
    },
    {
      "text": "Schmidt, K, & L Bannon. \"Taking CSCW seriously.\" Journal of CSCW, 1.1--2 (1992): 7--40.",
      "doi": ""
    },
    {
      "text": "Schmidt, M., Klettner, S. Gender and Experience-Related Motivators for Contributing to OSM. ACTIVITY (2013).",
      "doi": ""
    },
    {
      "text": "Simonite, T. The Decline of Wikipedia. MIT Technology Review. October 22, 2013.",
      "doi": ""
    },
    {
      "text": "Soden, R., Budhathoki, N., Palen, L. Resilience-Building and the Crisis Informatics Agenda: Lessons Learned from Open Cities Kathmandu. ISCRAM, (2014).",
      "doi": ""
    },
    {
      "text": "Soden R., Palen, L. From crowdsourcing to community mapping: the post-earthquake work of OpenStreetMap Haiti. In Proc. of COOP, (2014).",
      "doi": ""
    },
    {
      "text": "Starbird, K. Palen, L. \"Voluntweeters\": self-organizing by digital volunteers in times of crisis. Proc. of CHI, (2011), 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Starbird,K, Palen,L. Working & Sustaining the Virtual \"Disaster Desk.\" Proc. of CSCW (2013), 491--502.  ",
      "doi": "10.1145/2441776.2441832"
    },
    {
      "text": "United Nations Office for Coordination of Humanitarian Affairs (UNOCHA) 2013. https://docs.unocha.org/sites/dms/CAP/SRP_20132014_Philippines_Typhoon_Haiyan.pdf",
      "doi": ""
    },
    {
      "text": "USAID Yolanda Factsheet http://www.usaid.gov/haiyan/fy14/fs20",
      "doi": ""
    },
    {
      "text": "White, J., Palen, L., Anderson, K. M. Digital mobilization in disaster response: the work & selforganization of on-line pet advocates in response to hurricane sandy. Proc. of CSCW, (2014), 866--876.  ",
      "doi": "10.1145/2531602.2531633"
    }
  ]
}