{
  "doi": "10.1145/2702123.2702248",
  "title": "Evaluating the Memorability of Physical Visualizations",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3247-3250",
  "year": 2015,
  "badges": [],
  "abstract": "Physical Visualizations are currently mostly used in casual contexts, e.g., as artistic data sculptures. However, their measurable benefits for traditional information visualization are largely unexplored. As a step in this direction, we compared the memorability of physical visualizations to that of digital visualizations. We conducted a user study with 40 participants in which we measured the recall of three types of information immediately after exploration and with a delay of two weeks. The results show that the physical visualization led to significantly less information decay within this time span. Our results build on known effects from cognitive psychology and provide a first indicator for measurable benefits of physical visualizations regarding memorability.",
  "tags": [
    "physical visualization",
    "memorability",
    "evaluation"
  ],
  "authors": [
    {
      "name": "Simon Stusak",
      "institution": "University of Munich (LMU), Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958689557",
      "orcid": "missing"
    },
    {
      "name": "Jeannette Schwarz",
      "institution": "University of Munich (LMU), Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697234",
      "orcid": "missing"
    },
    {
      "name": "Andreas Butz",
      "institution": "University of Munich (LMU), Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100266654",
      "orcid": "0000-0002-9007-9888"
    }
  ],
  "references": [
    {
      "text": "Bateman, S., Mandryk, R. L., Gutwin, C., Genest, A., McDine, D., and Brooks, C. Useful junk?: the effects of visual embellishment on comprehension and memorability of charts. In Proc. CHI '10, ACM (2010), 2573--2582.  ",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "Bevan, W., and Steger, J. A. Free recall and abstractness of stimuli. Science 172, 3983 (1971), 597--599.",
      "doi": ""
    },
    {
      "text": "Easton, R. D., Greene, A. J., and Srinivas, K. Transfer between vision and haptics: Memory for 2-d patterns and 3-d objects. Psychonomic Bulletin & Review 4, 3 (1997), 403--410.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Leithinger, D., Olwal, A., Hogge, A., and Ishii, H. inFORM: dynamic physical affordances and constraints through shape and object actuation. In UIST '13, ACM (2013), 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Healey, C. G., and Enns, J. T. Attention and visual memory in visualization and computer graphics. In Proc. VIS '12, vol. 18, IEEE (2012), 1170--1188.  ",
      "doi": "10.1109/TVCG.2011.127"
    },
    {
      "text": "Jansen, Y., and Dragicevic, P. An interaction model for visualizations beyond the desktop. In Proc. VIS '13, vol. 19, IEEE (2013), 2396--2405.  ",
      "doi": "10.1109/TVCG.2013.134"
    },
    {
      "text": "Jansen, Y., Dragicevic, P., and Fekete, J.-D. Evaluating the efficiency of physical visualizations. In Proc. CHI '13, ACM (2013), 2593--2602.  ",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Kelly, J. W., Avraamides, M. N., and Giudice, N. A. Haptic experiences influence visually acquired memories: Reference frames during multimodal spatial learning. Psychonomic bulletin & review 18, 6 (2011), 1119--1125.",
      "doi": ""
    },
    {
      "text": "Kerzel, D. Visual short-term memory is influenced by haptic perception. Journal of Exp. Psychol.: Learning, Memory, and Cognition 27, 4 (2001), 1101--1109.",
      "doi": ""
    },
    {
      "text": "Scott, K. G. Clustering with perceptual and symbolic stimuli in free recall. Journal of Verbal Learning and Verbal Behavior 6, 6 (1967), 864--866.",
      "doi": ""
    },
    {
      "text": "Stusak, S., Tabard, A., Sauka, F., Ashok Khot, R., and Butz, A. Activity Sculptures: Exploring the Impact of Physical Visualizations on Running Activity. In Proc. VIS '14, vol. 20, IEEE (2014), 2201--2210.",
      "doi": ""
    },
    {
      "text": "Swaminathan, S., Shi, C., Jansen, Y., Dragicevic, P., Oehlberg, L., and Fekete, J.-D. Supporting the design and fabrication of physical visualizations. In Proc. CHI '14, ACM (2014), 3845--3854.  ",
      "doi": "10.1145/2556288.2557310"
    },
    {
      "text": "Ware, C. Information visualization: perception for design. Elsevier, 2013. ",
      "doi": "10.5555/2285540"
    }
  ]
}