{
  "doi": "10.1145/2702123.2702549",
  "title": "Gender and Tenure Diversity in GitHub Teams",
  "published": "2015-04-18",
  "proctitle": "CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems",
  "pages": "3789-3798",
  "year": 2015,
  "badges": [],
  "abstract": "Software development is usually a collaborative venture. Open Source Software (OSS) projects are no exception; indeed, by design, the OSS approach can accommodate teams that are more open, geographically distributed, and dynamic than commercial teams. This, we find, leads to OSS teams that are quite diverse. Team diversity, predominantly in offline groups, is known to correlate with team output, mostly with positive effects. How about in OSS? Using GitHub, the largest publicly available collection of OSS projects, we studied how gender and tenure diversity relate to team productivity and turnover. Using regression modeling of GitHub data and the results of a survey, we show that both gender and tenure diversity are positive and significant predictors of productivity, together explaining a sizable fraction of the data variability. These results can inform decision making on all levels, leading to better outcomes in recruiting and performance.",
  "authors": [
    {
      "name": "Bogdan Vasilescu",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81485658533/rel-imgonly/bogdan2013bw.jpg",
      "acmid": "81485658533",
      "orcid": "0000-0003-4418-5783"
    },
    {
      "name": "Daryl Posnett",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658124",
      "orcid": "missing"
    },
    {
      "name": "Baishakhi Ray",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659205950",
      "orcid": "missing"
    },
    {
      "name": "Mark G.J. van den Brand",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486646568",
      "orcid": "missing"
    },
    {
      "name": "Alexander Serebrenik",
      "institution": "University of Eindhoven, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81100069109/rel-imgonly/alexmagazine.png",
      "acmid": "81100069109",
      "orcid": "missing"
    },
    {
      "name": "Premkumar Devanbu",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/do/10.1145/contrib-81452608115/rel-imgonly/81452608115.jpg",
      "acmid": "81452608115",
      "orcid": "missing"
    },
    {
      "name": "Vladimir Filkov",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100348267",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apesteguia, J., Azmat, G., and Iriberri, N. The impact of gender composition on team performance and decision making: Evidence from the field. Manage. Sci. 58, 1 (2012), 78--93.  ",
      "doi": "10.1287/mnsc.1110.1348"
    },
    {
      "text": "Aries, E. Interaction patterns and themes of male, female, and mixed groups. Small Group Behavior (1976).",
      "doi": ""
    },
    {
      "text": "Bates, D. M. lme4: Mixed-effects modeling with R, 2010.",
      "doi": ""
    },
    {
      "text": "Begel, A., and Nagappan, N. Usage and perceptions of agile software development in an industrial context: An exploratory study. In ESEM, IEEE (2007), 255--264.  ",
      "doi": "10.1109/ESEM.2007.85"
    },
    {
      "text": "Bird, C., et al. Mining email social networks. In MSR, ACM (2006), 137--143.  ",
      "doi": "10.1145/1137983.1138016"
    },
    {
      "text": "Bird, C., et al. Open borders' immigration in open source projects. In MSR, IEEE (2007), 6.  ",
      "doi": "10.1109/MSR.2007.23"
    },
    {
      "text": "Bird, C., et al. Latent social structure in open source projects. In FSE, ACM (2008), 24--35.  ",
      "doi": "10.1145/1453101.1453107"
    },
    {
      "text": "Bird, C., et al. Does distributed development affect software quality?: An empirical case study of Windows Vista. CACM 52, 8 (2009), 85--93.  ",
      "doi": "10.1145/1536616.1536639"
    },
    {
      "text": "Bird, C., et al. The promises and perils of mining git. In MSR, IEEE (2009), 1--10.  ",
      "doi": "10.1109/MSR.2009.5069475"
    },
    {
      "text": "Blau, P. M. Inequality and heterogeneity: A primitive theory of social structure, vol. 7. Free Press NY, 1977.",
      "doi": ""
    },
    {
      "text": "Brooks, F. P. The mythical man-month, vol. 1995. Addison-Wesley Reading, MA, 1975. ",
      "doi": "10.5555/207583"
    },
    {
      "text": "Byrne, D. E. The attraction paradigm. Personality and psychopathology. Academic Press, 1971.",
      "doi": ""
    },
    {
      "text": "Chen, J., et al. The effects of diversity on group productivity and member withdrawal in online volunteer groups. In CHI, ACM (2010), 821--830.  ",
      "doi": "10.1145/1753326.1753447"
    },
    {
      "text": "Cohen, J. Statistical Power Analysis for the Behavioral Sciences. Lawrence Erlbaum Associates, 1988.",
      "doi": ""
    },
    {
      "text": "Croson, R., and Gneezy, U. Gender differences in preferences. J. Econ. Lit. (2009), 448--474.",
      "doi": ""
    },
    {
      "text": "Dabbish, L., et al. Social coding in GitHub: transparency and collaboration in an open software repository. In CSCW, ACM (2012), 1277--1286.  ",
      "doi": "10.1145/2145204.2145396"
    },
    {
      "text": "Dabbish, L., et al. Leveraging transparency. IEEE Software 30, 1 (2013), 37--43.  ",
      "doi": "10.1109/MS.2012.172"
    },
    {
      "text": "Daniel, S., et al. The effects of diversity in global, distributed collectives: A study of open source project success. Inform. Syst. Res. 24, 2 (2013), 312--333.",
      "doi": ""
    },
    {
      "text": "David, P. A., and Shapiro, J. S. Community-based production of open-source software: What do we know about the developers who participate? Information Economics and Policy 20, 4 (2008), 364--398.",
      "doi": ""
    },
    {
      "text": "de Gilder, D., and Wilke, H. A. M. Expectation states theory and the motivational determinants of social influence. Eur. Rev. Soc. Psychol. 5, 1 (1994), 243--269.",
      "doi": ""
    },
    {
      "text": "de O. Melo, C., et al. Interpretative case studies on agile team productivity and management. Inform. Software Tech. 55, 2 (2013), 412--427.  ",
      "doi": "10.1016/j.infsof.2012.09.004"
    },
    {
      "text": "Domingos, P. A few useful things to know about machine learning. CACM 55, 10 (2012), 78--87.  ",
      "doi": "10.1145/2347736.2347755"
    },
    {
      "text": "Ducheneaut, N. Socialization in an open source software community: A socio-technical analysis. CSCW 14, 4 (2005), 323--368.  ",
      "doi": "10.1007/s10606-005-9000-1"
    },
    {
      "text": "Earley, C. P., and Mosakowski, E. Creating hybrid team cultures: An empirical test of transnational team functioning. Acad. Manag. J. 43, 1 (2000), 26--49.",
      "doi": ""
    },
    {
      "text": "Easterbrook, S., et al. Selecting empirical methods for software engineering research. In Guide Adv. Empir. Softw. Eng. Springer, 2008, 285--311.",
      "doi": ""
    },
    {
      "text": "Feller, J., and Fitzgerald, B. A framework analysis of the open source software development paradigm. In ICIS, Association for Information Systems (2000), 58--69. ",
      "doi": "10.5555/359640.359723"
    },
    {
      "text": "Goeminne, M., and Mens, T. A comparison of identity merge algorithms for software repositories. Science of Computer Programming 78, 8 (2013), 971--986.  ",
      "doi": "10.1016/j.scico.2011.11.004"
    },
    {
      "text": "Gould, R. V. The origins of status hierarchies: A formal theory and empirical test. Am. J. Sociol. 107, 5 (2002), 1143--1178.",
      "doi": ""
    },
    {
      "text": "Gousios, G. The GHTorent dataset and tool suite. In MSR, IEEE (2013), 233--236. ",
      "doi": "10.5555/2487085.2487132"
    },
    {
      "text": "Harrison, D. A., et al. Beyond relational demography: Time and the effects of surface-and deep-level diversity on work group cohesion. Acad. Manag. J. 41, 1 (1998), 96--107.",
      "doi": ""
    },
    {
      "text": "Horwitz, S. K., and Horwitz, I. B. The effects of team diversity on team outcomes: A meta-analytic review of team demography. J. Manag. 33, 6 (2007), 987--1015.",
      "doi": ""
    },
    {
      "text": "Howison, J., et al. Validity issues in the use of social network analysis with digital trace data. JAIS 12 (2011).",
      "doi": ""
    },
    {
      "text": "Jackson, S. E., and Joshi, A. Diversity in social context: a multi-attribute, multilevel analysis of team diversity and sales performance. J. Organ. Behav. 25, 6 (2004), 675--702.",
      "doi": ""
    },
    {
      "text": "Kalliamvakou, E., et al. The promises and perils of mining GitHub. In MSR, ACM (2014).  ",
      "doi": "10.1145/2597073.2597074"
    },
    {
      "text": "Kouters, E., et al. Who's who in Gnome: Using LSA to merge software repository identities. In ICSM (2012), 592--595.  ",
      "doi": "10.1109/ICSM.2012.6405329"
    },
    {
      "text": "Lakhani, K. R., and Von Hippel, E. How open source software works: \"free\" user-to-user assistance. Research Policy 32, 6 (2003), 923--943.",
      "doi": ""
    },
    {
      "text": "Lee, M. J., et al. GitHub developers use rockstars to overcome overflow of news. In CHI, ACM (2013), 133--138.  ",
      "doi": "10.1145/2468356.2468381"
    },
    {
      "text": "Lipsey, M., et al. Translating the statistical representation of the effects of education interventions into more readily interpretable forms. Tech. Rep. NCSER 2013--3000, U.S. Dept of Education, Institute of Education Sciences, 2012.",
      "doi": ""
    },
    {
      "text": "Marlow, J., et al. Impression formation in online peer production: activity traces and personal profiles in GitHub. In CSCW, ACM (2013), 117--128.  ",
      "doi": "10.1145/2441776.2441792"
    },
    {
      "text": "Martins, L. L., et al. Virtual teams: What do we know and where do we go from here? J. Manag. 30, 6 (2004), 805--835.",
      "doi": ""
    },
    {
      "text": "McDonald, N., and Goggins, S. Performance and participation in open source software on GitHub. In CHI, ACM (2013), 139--144.  ",
      "doi": "10.1145/2468356.2468382"
    },
    {
      "text": "Michailidou, A., and Economides, A. Gender and diversity in collaborative virtual teams. Computer Supported Collaborative Learning: Best practices and principles for instructors (2007), 199--224.",
      "doi": ""
    },
    {
      "text": "Molleman, E., and Slomp, J. The impact of team and work characteristics on team functioning. Hum. Factors Ergon. Manuf. 16, 1 (2006), 1--15.  ",
      "doi": "10.5555/1107417.1107420"
    },
    {
      "text": "Nafus, D. 'Patches don't have gender': What is not open in open source software. New Media & Society 14, 4 (2012), 669--683.",
      "doi": ""
    },
    {
      "text": "Oreg, S., and Nov, O. Exploring motivations for contributing to open source initiatives: The roles of contribution context and personal values. Comput. Hum. Behav. 24, 5 (2008), 2055--2073.  ",
      "doi": "10.1016/j.chb.2007.09.007"
    },
    {
      "text": "O'Reilly III, C. A., et al. Work group demography, social integration, and turnover. Admin. Sci. Quart. (1989), 21--37.",
      "doi": ""
    },
    {
      "text": "Preece, J., and Shneiderman, B. The reader-to-leader framework: Motivating technology-mediated social participation. AIS Trans. Hum.-Comput. Interact. 1, 1 (2009), 13--32.",
      "doi": ""
    },
    {
      "text": "Riordan, C. M., and Shore, L. M. Demographic diversity and employee attitudes: An empirical examination of relational demography within work units. J. Appl. Psychol. 82, 3 (1997), 342.",
      "doi": ""
    },
    {
      "text": "Robles, G., et al. FLOSS 2013: A survey dataset about free software contributors: challenges for curating, sharing, and combining. In MSR, ACM (2014), 396--399.  ",
      "doi": "10.1145/2597073.2597129"
    },
    {
      "text": "Robles, G., and Gonzalez-Barahona, J. M. Contributor turnover in libre software projects. In Open Source Systems. Springer, 2006, 273--286.",
      "doi": ""
    },
    {
      "text": "Rogelberg, S. G., and Rumery, S. M. Gender diversity, team decision quality, time on task, and interpersonal cohesion. Small Group Research 27, 1 (1996), 79--90.",
      "doi": ""
    },
    {
      "text": "Salancik, G. R., and Pfeffer, J. A social information processing approach to job attitudes and task design. Admin. Sci. Quart. 23, 2 (1978), 224--253.",
      "doi": ""
    },
    {
      "text": "Simmons, J., et al. False-positive psychology undisclosed flexibility in data collection and analysis allows presenting anything as significant. Psychol. Sci. 22, 11 (2011).",
      "doi": ""
    },
    {
      "text": "Stahl, G. K., et al. Unraveling the effects of cultural diversity in teams: A meta-analysis of research on multicultural work groups. J. Int. Bus. Stud. 41, 4 (2010), 690--709.",
      "doi": ""
    },
    {
      "text": "Tajfel, H. Social psychology of intergroup relations. Annu. Rev. Psychol. 33, 1 (1982), 1--39.",
      "doi": ""
    },
    {
      "text": "Takhteyev, Y., and Hilts, A. Investigating the geography of open source software through GitHub, 2010.",
      "doi": ""
    },
    {
      "text": "Tao, Y., et al. How do software engineers understand code changes?: An exploratory study in industry. In FSE, ACM (2012), 51:1--51:11.  ",
      "doi": "10.1145/2393596.2393656"
    },
    {
      "text": "Turkle, S. The Second Self: Computers and the Human Spirit. MIT Press, 2005. ",
      "doi": ""
    },
    {
      "text": "Vasilescu, B., Capiluppi, A., and Serebrenik, A. Gender, representation and online participation: A quantitative study. Interacting with Computers (2013), 1--24.",
      "doi": ""
    },
    {
      "text": "Vasilescu, B., et al. StackOverflow and GitHub: Associations between software development and crowdsourced knowledge. In SocialCom, IEEE (2013), 188--195.  ",
      "doi": "10.1109/SocialCom.2013.35"
    },
    {
      "text": "Vasilescu, B., et al. How social Q&A sites are changing knowledge sharing in open source software communities. In CSCW, ACM (2014), 342--354.  ",
      "doi": "10.1145/2531602.2531659"
    },
    {
      "text": "Vasilescu, B., et al. On the variation and specialisation of workload-A case study of the Gnome ecosystem community. Empir. Softw. Eng. 19, 4 (2014), 955--1008.  ",
      "doi": "10.1007/s10664-013-9244-1"
    },
    {
      "text": "Wang, L., et al. Searching for the goldilocks zone: trade-offs in managing online volunteer groups. In CSCW, ACM (2012), 989--998.  ",
      "doi": "10.1145/2145204.2145351"
    },
    {
      "text": "Watson, W. E., et al. Cultural diversity's impact on interaction process and performance: Comparing homogeneous and diverse task groups. Acad. Manag. J. 36, 3 (1993), 590--602.",
      "doi": ""
    },
    {
      "text": "Weyuker, E. J., et al. Do too many cooks spoil the broth? using the number of developers to enhance defect prediction models. Empir. Softw. Eng. 13, 5 (2008), 539--559.  ",
      "doi": "10.1007/s10664-008-9082-8"
    },
    {
      "text": "Williams, K. Y., and O'Reilly, C. A. Demography and diversity in organizations: A review of 40 years of research. Res. Organ. Behav. 20 (1998), 77--140.",
      "doi": ""
    },
    {
      "text": "Ye, Y., and Kishida, K. Toward an understanding of the motivation of open source software developers. In ICSE, IEEE (2003), 419--429. ",
      "doi": "10.5555/776816.776867"
    },
    {
      "text": "Zellmer-Bruhn, M. E., et al. When and how do differences matter? an exploration of perceived similarity in teams. Organ. Behav. Hum. Dec. 107, 1 (2008), 41--59.",
      "doi": ""
    }
  ]
}