{
  "doi": "10.1145/3025453.3025656",
  "title": "Rice Today, Roti Tomorrow: Diets and Diabetes in Urban Indian Households",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4069-4081",
  "year": 2017,
  "badges": [],
  "abstract": "In India, where diabetes is a growing concern and approximately 69 million are affected, we investigate the factors that influence diet management, a critical component of living with the disease. Taking the middle-income diabetes-affected household as our unit of analysis, we use a combination of semi-structured interviews and a design probe to understand if and how diets are monitored, tailored, and balanced. We research the various information-seeking behaviors of our participants and their culturally situated approaches to food and eating. Our findings illuminate how contextual nuances shape individuals' beliefs around dealing with diabetes and the ways in which family, friends, and broader social networks influence dietary decisions. We conclude by offering a framework of Learning-Being-Doing to inform the holistic design of technologies for managing diets and diabetes.",
  "tags": [
    "qualitative methods",
    "india",
    "diets",
    "diabetes"
  ],
  "authors": [
    {
      "name": "Jasmine Hentschel",
      "institution": "THRIVE, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658719347",
      "orcid": "missing"
    },
    {
      "name": "Samyukta Manjayya Sherugar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163314",
      "orcid": "missing"
    },
    {
      "name": "Rui Zhou",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-99659163013/rel-imgonly/2017fall.jpg",
      "acmid": "99659163013",
      "orcid": "missing"
    },
    {
      "name": "Vaishnav Kameswaran",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027270",
      "orcid": "missing"
    },
    {
      "name": "Rajesh Chandwani",
      "institution": "Indian Institute of Management, Ahmedabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84460030557",
      "orcid": "missing"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd, Gillian R. Hayes, Julie A. Kientz, Lena Mamykina, and Elizabeth D. Mynatt. 2006. Challenges and opportunities for collaboration technologies for chronic care management. The Human-Computer Interaction Consortium (HCIC 2006) (2006).",
      "doi": ""
    },
    {
      "text": "Noemi B. Albarran, Martha N. Ballesteros, Gloria G. Morales, and Maria I. Ortega. 2006. Dietary behavior and type 2 diabetes care. Patient Education and Counseling 61, 2 (2006), 191--199. ",
      "doi": ""
    },
    {
      "text": "Alice S. Ammerman, Christine H. Lindquist, Kathleen N. Lohr, and James Hersey. 2002. The efficacy of behavioral interventions to modify dietary fat and fruit and vegetable intake: a review of the evidence. Preventive medicine 35, 1 (2002), 25--41. ",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1977. Self-efficacy: toward a unifying theory of behavioral change. Psychological review 84, 2 (1977), 191.",
      "doi": ""
    },
    {
      "text": "Alison O. Booth, Carole Lowis, Moira Dean, Steven J. Hunter, and Michelle C. McKinley. 2013. Diet and physical activity in the self-management of type 2 diabetes: barriers and facilitators identified by patients and health professionals. Primary health care research & development 14, 03 (2013), 293--306. ",
      "doi": ""
    },
    {
      "text": "Virginia Braun, Victoria Clarke, and Gareth Terry. 2014. Thematic analysis. Qual Res Clin Health Psychol (2014), 95--114.",
      "doi": ""
    },
    {
      "text": "Rajesh Chandwani and Vaibhavi Kulkarni. 2016. Who's the Doctor? Physicians' Perception of Internet Informed Patients in India. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3091--3102.  ",
      "doi": "10.1145/2858036.2858500"
    },
    {
      "text": "Yunan Chen. 2010. Take it personally: accounting for individual difference in designing diabetes management systems. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM, 252--261.  ",
      "doi": "10.1145/1858171.1858218"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, and others. 2008. Activity sensing in the wild: a field trial of UbiFit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Sunny Consolvo, Peter Roessler, Brett E Shelton, Anthony LaMarca, Bill Schilit, and Sara Bly. 2004. Technology for care networks of elders. IEEE Pervasive Computing 3, 2 (2004), 22--29.  ",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Jeanette M. Daly, Arthur J. Hartz, Yinghui Xu, Barcey T. Levy, Paul A. James, Mary L. Merchant, and Robert E. Garrett. 2009. An assessment of attitudes, behaviors, and outcomes of patients with type 2 diabetes. The Journal of the American Board of Family Medicine 22, 3 (2009), 280--290. ",
      "doi": ""
    },
    {
      "text": "Feiyue Deng, Anran Zhang, and Catherine B Chan. 2013. Acculturation, dietary acceptability, and diabetes management among Chinese in North America. Frontiers in endocrinology 4 (2013).",
      "doi": ""
    },
    {
      "text": "Ontrack Diabetes. 2016. https://medivo.com/ontrack/. (2016). (Accessed on 09/21/2016).",
      "doi": ""
    },
    {
      "text": "DiabetesConnect. 2016. DiabetesConnect Diabetes Management. http://www.diabetesconnect.de/en/. (2016). (Accessed on 09/21/2016).",
      "doi": ""
    },
    {
      "text": "Sara Diamond, Bhuvaneswari Arunachalan, Derek Reilly, and Anne Stevens. 2014. Workshop on designing the future of mobile healthcare support. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. ACM, 589--592.",
      "doi": ""
    },
    {
      "text": "Rujuta Diwekar. 2011. Don't Lose Your Mind, Lose Your Weight. Random House India.",
      "doi": ""
    },
    {
      "text": "B. J. Fogg. 2003. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann.",
      "doi": "10.5555/640634"
    },
    {
      "text": "Fooducate. 2016. Lose weight & improve your health with a real food diet. http://www.fooducate.com/. (2016). (Accessed on 09/21/2016).",
      "doi": ""
    },
    {
      "text": "Mary C. Gannon and Frank Q. Nuttall. 2006. Control of blood glucose in type 2 diabetes without weight loss by modification of diet composition. Nutrition & metabolism 3, 1 (2006), 1.",
      "doi": ""
    },
    {
      "text": "Leo A. Goodman. 1961. Snowball sampling. The annals of mathematical statistics (1961), 148--170. ",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Desney Tan, and Dan Morris. 2009. Toward technologies that support family reflections on health. In Proceedings of the ACM 2009 international conference on Supporting group work. ACM, 311--320.  ",
      "doi": "10.1145/1531674.1531721"
    },
    {
      "text": "Kelli Hale, Sandra Capra, and Judy Bauer. 2016. Are nutrition messages lost in transmission? Assessing the quality and consistency of diabetes guideline recommendations on the delivery of nutrition therapy. Patient Education and Counseling (2016).",
      "doi": ""
    },
    {
      "text": "Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3307--3316.  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Rury R. Holman, Carole A. Cull, Charles Fox, and Robert C. Turner. 1995. United Kingdom prospective diabetes study (UKPDS) 13: relative efficacy of randomly allocated diet, sulphonylurea, insulin, or metformin in patients with newly diagnosed non-insulin dependent diabetes followed for three years. British Medical Journal 310, 6972 (1995), 83.",
      "doi": ""
    },
    {
      "text": "International Diabetes Federation. 2016. India. http://www.idf.org/membership/sea/india. (2016). (Accessed on 09/21/2016).",
      "doi": ""
    },
    {
      "text": "Renate Jansink, Jozé Braspenning, Trudy van der Weijden, Glyn Elwyn, and Richard Grol. 2010. Primary care nurses struggle with lifestyle counseling in diabetes care: a qualitative analysis. BMC family practice 11, 1 (2010), 1.",
      "doi": ""
    },
    {
      "text": "Anne Marie Kanstrup, Pernille Bertelsen, Marie Glasemann, and Niels Boye. 2008. Design for more: an ambient perspective on diabetes. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008. Indiana University, 118--127.",
      "doi": "10.5555/1795234.1795252"
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3063--3072.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge university press. ",
      "doi": ""
    },
    {
      "text": "Alice H. Lichtenstein, Lawrence J. Appel, Michael Brands, Mercedes Carnethon, Stephen Daniels, Harold A. Franch, Barry Franklin, Penny Kris-Etherton, William S. Harris, Barbara Howard, and others. 2006. Diet and lifestyle recommendations revision 2006 A scientific statement from the American Heart Association nutrition committee. Circulation 114, 1 (2006), 82--96. ",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Andrew D. Miller, Elizabeth D. Mynatt, and Daniel Greenblatt. 2010. Constructing identities through storytelling in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1203--1212.  ",
      "doi": "10.1145/1753326.1753507"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Lena Mamykina and Elizabeth D. Mynatt. 2007. Investigating and supporting health management practices of individuals with diabetes. In Proceedings of the 1st ACM SIGMOBILE international workshop on Systems and networking support for healthcare and assisted living environments. ACM, 49--54.  ",
      "doi": "10.1145/1248054.1248068"
    },
    {
      "text": "Lena Mamykina, Elizabeth D. Mynatt, and David R. Kaufman. 2006. Investigating health management practices of individuals with diabetes. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 927--936.  ",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Lena Mamykina, Drashko Nakikj, and Noemie Elhadad. 2015. Collective Sensemaking in Online Health Forums. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3217--3226.  ",
      "doi": "10.1145/2702123.2702566"
    },
    {
      "text": "Todd R. Marcy, Mark L. Britton, and Don Harrison. 2011. Identification of barriers to appropriate dietary behavior in low-income patients with type 2 diabetes mellitus. Diabetes Therapy 2, 1 (2011), 9--19.",
      "doi": ""
    },
    {
      "text": "Jill A. Metz, Judith S. Stern, Penny Kris-Etherton, Molly E. Reusser, Cynthia D. Morris, Daniel C. Hatton, Suzanne Oparil, R. Brian Haynes, Lawrence M. Resnick, F. Xavier Pi-Sunyer, and others. 2000. A randomized trial of improved weight loss with a prepared meal plan in overweight and obese patients: impact on cardiovascular risk reduction. Archives of Internal Medicine 160, 14 (2000), 2150--2158. ",
      "doi": ""
    },
    {
      "text": "MyFitnessPal. 2016. Free Calorie Counter, Diet & Exercise Journal. https://www.myfitnesspal.com/. (2016). (Accessed on 09/21/2016).",
      "doi": ""
    },
    {
      "text": "Elizabeth D Mynatt. 2011. IT in healthcare: a body of work. interactions 18, 3 (2011), 22--25.",
      "doi": "10.1145/1962438.1962446"
    },
    {
      "text": "Karin M. Nelson, Gayle Reiber, and Edward J. Boyko. 2002. Diet and exercise among adults with type 2 diabetes findings from the third national health and nutrition examination survey (NHANES III). Diabetes care 25, 10 (2002), 1722--1728. ",
      "doi": ""
    },
    {
      "text": "Tom Owen, Jennifer Pearson, Harold Thimbleby, and George Buchanan. 2015. ConCap: Designing to Empower Individual Reflection on Chronic Conditions using Mobile Apps. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 105--114.  ",
      "doi": "10.1145/2785830.2785881"
    },
    {
      "text": "Carolyn E. Pang, Carman Neustaedter, Bernhard E. Riecke, Erick Oduor, and Serena Hillman. 2013. Technology preferences and routines for sharing health information during the treatment of a chronic illness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1759--1768.",
      "doi": "10.1145/2470654.2466232"
    },
    {
      "text": "Ari H. Pollack, Uba Backonja, Andrew D. Miller, Sonali R. Mishra, Maher Khelić, Logan Kendall, and Wanda Pratt. 2016. Closing the Gap: Supporting Patient's Transition to Self-Management after Hospitalization. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5324--5336.",
      "doi": "10.1145/2858036.2858240"
    },
    {
      "text": "James O Prochaska. 2013. Transtheoretical model of behavior change. In Encyclopedia of behavioral medicine. Springer, 1997--2000.",
      "doi": ""
    },
    {
      "text": "Ambady Ramachandran, Simon Mary, Annasami Yamuna, Narayanasamy Murugesan, and Chamukuttan Snehalatha. 2008. High prevalence of diabetes and cardiovascular risk factors associated with urbanization in India. Diabetes care 31, 5 (2008), 893--898. ",
      "doi": ""
    },
    {
      "text": "J. Salas-Salvadó, M. A. Martinez-Gonzalez, M. Bullo, and E. Ros. 2011. The role of diet in the prevention of type 2 diabetes. Nutrition, Metabolism and Cardiovascular Diseases 21 (2011), B32--B48. ",
      "doi": ""
    },
    {
      "text": "V. Sujatha. 2007. Pluralism in Indian medicine Medical lore as a genre of medical knowledge. Contributions to Indian Sociology 41, 2 (2007), 169--202. ",
      "doi": ""
    },
    {
      "text": "Andrea Taylor, Angus Aitken, David Godden, and Judith Colligan. 2011. Group pulmonary rehabilitation delivered to the home via the internet: feasibility and patient perception. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3083--3092.  ",
      "doi": "10.1145/1978942.1979398"
    },
    {
      "text": "S. Vijan, N. S. Stuart, J. T. Fitzgerald, D. L. Ronis, R. A. Hayward, S. Slater, and T. P. Hofer. 2005. Barriers to following dietary recommendations in Type 2 diabetes. Diabetic Medicine 22, 1 (2005), 32--38. ",
      "doi": ""
    },
    {
      "text": "Xiaomu Zhou, Si Sun, and Jiang Yang. 2014. Sweet Home: understanding diabetes management via a chinese online community. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3997--4006.  ",
      "doi": "10.1145/2556288.2557344"
    }
  ]
}