{
  "doi": "10.1145/3025453.3025645",
  "title": "Toward Principles for the Design of Navigation Affordances in Code Editors: An Empirical Investigation",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5690-5702",
  "year": 2017,
  "badges": [],
  "abstract": "Design principles are a key tool for creators of interactive systems; however, a cohesive set of principles has yet to emerge for the design of code editors. In this paper, we conducted a between-subjects empirical study comparing the navigation behaviors of 32 professional LabVIEW programmers using two different code-editor interfaces: the ubiquitous tabbed editor and the experimental Patchworks editor. Our analysis focused on how the programmers arranged and navigated among open information patches (i.e., code modules and program output). Key findings of our study included that Patchworks users made significantly fewer click actions per navigation, juxtaposed patches side by side significantly more, and exhibited significantly fewer navigation mistakes than tabbed-editor users. Based on these findings and more, we propose five general principles for the design of effective navigation affordances in code editors.",
  "tags": [
    "design principles",
    "user study",
    "navigation",
    "visual programming languages",
    "programming environments"
  ],
  "authors": [
    {
      "name": "Austin Z. Henley",
      "institution": "University of Memphis, Memphis, TN, USA",
      "img": "/do/10.1145/contrib-87959373057/rel-imgonly/azh.jpg",
      "acmid": "87959373057",
      "orcid": "missing"
    },
    {
      "name": "Scott D. Fleming",
      "institution": "University of Memphis, Memphis, TN, USA",
      "img": "/do/10.1145/contrib-81100588251/rel-imgonly/scott_fleming.jpg",
      "acmid": "81100588251",
      "orcid": "missing"
    },
    {
      "name": "Maria V. Luong",
      "institution": "University of Memphis, Memphis, TN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160222",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "John R. Anderson and Gordon H. Bower. 1972. Recognition and retrieval processes in free recall. Psychol. Rev. 79, 2 (March 1972), 97--123.",
      "doi": ""
    },
    {
      "text": "Andrew. Bragdon. 2009. Creating Simultaneous Views of Source Code in Contemporary IDEs Using Tab Panes and MDI Child Windows: A Pilot Study. Technical Report CS-09-09. Brown Univ.",
      "doi": ""
    },
    {
      "text": "Andrew Bragdon, Steven P. Reiss, Robert Zeleznik, Suman Karumuri, William Cheung, Joshua Kaplan, Christopher Coleman, Ferdi Adeputra, and Joseph J. LaViola, Jr. 2010a. Code Bubbles: Rethinking the User Interface Paradigm of Integrated Development Environments. In Proceedings of the 32nd ACM/IEEE International Conference on Software Engineering Volume 1 (ICSE '10). ACM, New York, NY, USA, 455--464.  ",
      "doi": "10.1145/1806799.1806866"
    },
    {
      "text": "Andrew Bragdon, Robert Zeleznik, Steven P. Reiss, Suman Karumuri, William Cheung, Joshua Kaplan, Christopher Coleman, Ferdi Adeputra, and Joseph J. LaViola, Jr. 2010b. Code Bubbles: A Working Set-based Interface for Code Understanding and Maintenance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2503--2512.  ",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Joel Brandt, Mira Dontcheva, Marcos Weskamp, and Scott R. Klemmer. 2010. Example-centric programming: Integrating Web search into the development environments. In Proc. 28th Int'l Conf. on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 513--522.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Michael J. Coblenz, Andrew J. Ko, and Brad A. Myers. 2006. JASPER: An Eclipse Plug-in to Facilitate Software Maintenance Tasks. In Proceedings of the 2006 OOPSLA Workshop on Eclipse Technology eXchange (ETX '06). ACM, New York, NY, USA, 65--69.  ",
      "doi": "10.1145/1188835.1188849"
    },
    {
      "text": "National Instruments Corporation. 2008. LabVIEW Calculator. http://www.ni.com/example/30779/ Accessed: 2017-01-06.",
      "doi": ""
    },
    {
      "text": "National Instruments Corporation. 2017. LabVIEW System Design Software. http://www.ni.com/labview/ Accessed: 2017-01-06.",
      "doi": ""
    },
    {
      "text": "Robert DeLine, Mary Czerwinski, Brian Meyers, Gina Venolia, Steven Drucker, and George Robertson. 2006. Code Thumbnails: Using Spatial Memory to Navigate Source Code. In Proceedings of the Visual Languages and Human-Centric Computing (VL/HCC '06). IEEE Computer Society, Washington, DC, USA, 11--18.  ",
      "doi": "10.1109/VLHCC.2006.14"
    },
    {
      "text": "Robert DeLine, Mary Czerwinski, and George Robertson. 2005. Easing Program Comprehension by Sharing Navigation Data. In Proceedings of the 2005 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '05). IEEE Computer Society, Washington, DC, USA, 241--248.  ",
      "doi": "10.1109/VLHCC.2005.32"
    },
    {
      "text": "Robert DeLine, Amir Khella, Mary Czerwinski, and George Robertson. 2005. Towards Understanding Programs Through Wear-based Filtering. In Proceedings of the 2005 ACM Symposium on Software Visualization (SoftVis '05). ACM, New York, NY, USA, 183--192.  ",
      "doi": "10.1145/1056018.1056044"
    },
    {
      "text": "Robert DeLine and Kael Rowan. 2010. Code Canvas: Zooming Towards Better Development Environments. In Proceedings of the 32nd ACM/IEEE International Conference on Software Engineering - Volume 2 (ICSE '10). ACM, New York, NY, USA, 207--210.  ",
      "doi": "10.1145/1810295.1810331"
    },
    {
      "text": "Martin Ester, Hans-Peter Kriegel, Jörg Sander, and Xiaowei Xu. 1996. A density-based algorithm for discovering clusters in large spatial databases with noise.. In Proc. 2nd Int'l Conf. Knowledge Discovery and Data Mining (KDD '96). 226--231. ",
      "doi": "10.5555/3001460.3001507"
    },
    {
      "text": "Thomas Fritz, David C. Shepherd, Katja Kevic, Will Snipes, and Christoph Bräunlich. 2014. Developers' Code Context Models for Change Tasks. In Proceedings of the 22nd ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE '14). ACM, New York, NY, USA, 7--18.  ",
      "doi": "10.1145/2635868.2635905"
    },
    {
      "text": "Austin Z. Henley and Scott D. Fleming. 2014. The Patchworks Code Editor: Toward Faster Navigation with Less Code Arranging and Fewer Navigation Mistakes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2511--2520.  ",
      "doi": "10.1145/2556288.2557073"
    },
    {
      "text": "Austin Z. Henley, A. Singh, Scott D. Fleming, and Maria V. Luong. 2014. Helping programmers navigate code faster with Patchworks: A simulation study. In Proceedings of the 2014 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '14). 77--80.",
      "doi": ""
    },
    {
      "text": "Eric Horvitz. 1999. Principles of Mixed-initiative User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2007. Disruption and Recovery of Computing Tasks: Field Study, Analysis, and Directions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "W. Jernigan, A. Horvath, M. Lee, M. Burnett, T. Cuilty, S. Kuttal, A. Peters, I. Kwan, F. Bahmani, and A. Ko. 2015. A principled evaluation for a principled Idea Garden. In Proc. 2015 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '15). 235--243.",
      "doi": ""
    },
    {
      "text": "Thorsten Karrer, Jan-Peter Krämer, Jonathan Diehl, Björn Hartmann, and Jan Borchers. 2011. Stacksplorer: Call Graph Navigation Helps Increasing Code Maintenance Efficiency. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 217--224.  ",
      "doi": "10.1145/2047196.2047225"
    },
    {
      "text": "Mik Kersten and Gail C. Murphy. 2006. Using Task Context to Improve Programmer Productivity. In Proceedings of the 14th ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE '06). ACM, New York, NY, USA, 1--11.  ",
      "doi": "10.1145/1181775.1181777"
    },
    {
      "text": "Katja Kevic, Braden M. Walters, Timothy R. Shaffer, Bonita Sharif, David C. Shepherd, and Thomas Fritz. 2015. Tracing Software Developers' Eyes and Interactions for Change Tasks. In Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering (ESEC/FSE 2015). ACM, New York, NY, USA, 202--213.  ",
      "doi": "10.1145/2786805.2786864"
    },
    {
      "text": "Andrew J. Ko, Htet Aung, and Brad A. Myers. 2005. Eliciting Design Requirements for Maintenance-oriented IDEs: A Detailed Study of Corrective and Perfective Maintenance Tasks. In Proceedings of the 27th International Conference on Software Engineering (ICSE '05). ACM, New York, NY, USA, 126--135.  ",
      "doi": "10.1145/1062455.1062492"
    },
    {
      "text": "Andrew J. Ko and Brad A. Myers. 2009. Finding Causes of Program Output with the Java Whyline. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1569--1578.  ",
      "doi": "10.1145/1518701.1518942"
    },
    {
      "text": "Andrew J. Ko, Brad A. Myers, Michael J. Coblenz, and Htet Htet Aung. 2006. An Exploratory Study of How Developers Seek, Relate, and Collect Relevant Information during Software Maintenance Tasks. IEEE Trans. Softw. Eng. 32, 12 (Dec. 2006), 971--987.  ",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Jan-Peter Krämer, Thorsten Karrer, Joachim Kurz, Moritz Wittenhagen, and Jan Borchers. 2013. How Tools in IDEs Shape Developers' Navigation Behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3073--3082.  ",
      "doi": "10.1145/2470654.2466419"
    },
    {
      "text": "Jan-Peter Krämer, Joachim Kurz, Thorsten Karrer, and Jan Borchers. 2012. Blaze: Supporting Two-phased Call Graph Navigation in Source Code. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 2195--2200.  ",
      "doi": "10.1145/2212776.2223775"
    },
    {
      "text": "Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. 2015. Principles of Explanatory Debugging to Personalize Interactive Machine Learning. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, New York, NY, USA, 126--137.  ",
      "doi": "10.1145/2678025.2701399"
    },
    {
      "text": "Joseph Lawrance, Margaret Burnett, Rachel Bellamy, Christopher Bogart, and Calvin Swart. 2010. Reactive Information Foraging for Evolving Goals. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 25--34.  ",
      "doi": "10.1145/1753326.1753332"
    },
    {
      "text": "Michael J. Lee, Faezeh Bahmani, Irwin Kwan, Jilian LaFerte, Polina Charters, Amber Horvath, Fanny Luor, Jill Cao, Catherine Law, Michael Beswetherick, Sheridan Long, Margaret Burnett, and Andrew J. Ko. 2014. Principles of a debugging-first puzzle game for computing education. In Proceedings of the 2014 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '14). 57--64.",
      "doi": ""
    },
    {
      "text": "Tom Lieber, Joel R. Brandt, and Rob C. Miller. 2014. Addressing Misconceptions About Code with Always-on Programming Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2481--2490.  ",
      "doi": "10.1145/2556288.2557409"
    },
    {
      "text": "Chris Parnin and Robert DeLine. 2010. Evaluating Cues for Resuming Interrupted Programming Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/1753326.1753342"
    },
    {
      "text": "Chris Parnin and Carsten Görg. 2006. Building Usage Contexts During Program Comprehension. In Proc. 14th IEEE Int'l Conf. Program Comprehension (ICPC '06). 13--22.  ",
      "doi": "10.1109/ICPC.2006.14"
    },
    {
      "text": "Chris Parnin, Carsten Görg, and Spencer Rugaber. 2010. CodePad: Interactive Spaces for Maintaining Concentration in Programming Environments. In Proceedings of the 5th International Symposium on Software Visualization (SOFTVIS '10). ACM, New York, NY, USA, 15--24.  ",
      "doi": "10.1145/1879211.1879217"
    },
    {
      "text": "Chris Parnin and Spencer Rugaber. 2012. Programmer information needs after memory failure. In Proc. 20th IEEE Int'l Conf. Program Comprehension (ICPC '12). 123--132.",
      "doi": ""
    },
    {
      "text": "David Piorkowski, Scott Fleming, Christopher Scaffidi, Christopher Bogart, Margaret Burnett, Bonnie John, Rachel Bellamy, and Calvin Swart. 2012. Reactive information foraging: An empirical investigation of theory-based recommender systems for programmers. In Proc. ACM SIGCHI Conf. Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1471--1480.  ",
      "doi": "10.1145/2207676.2208608"
    },
    {
      "text": "David Piorkowski, Scott D. Fleming, Christopher Scaffidi, Margaret Burnett, Irwin Kwan, Austin Z. Henley, Jamie Macbeth, Charles Hill, and Amber Horvath. 2015. To Fix or to Learn? How Production Bias Affects Developers' Information Foraging during Debugging. In 31st IEEE International Conference on Software Maintenance and Evolution (ICSME '15). 11--20.  ",
      "doi": "10.1109/ICSM.2015.7332447"
    },
    {
      "text": "David Piorkowski, Scott D. Fleming, Christopher Scaffidi, Liza John, Christopher Bogart, Bonnie E. John, Margaret Burnett, and Rachel Bellamy. 2011. Modeling programmer navigation: A head-to-head empirical evaluation of predictive models. In Proceedings of the 2011 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC '11). 109--116.",
      "doi": ""
    },
    {
      "text": "David Piorkowski, Austin Z. Henley, Tahmid Nabi, Scott D. Fleming, Christopher Scaffidi, and Margaret Burnett. 2016. Foraging and Navigations, Fundamentally: Developers' Predictions of Value and Cost. In Proceedings of the 24th ACM SIGSOFT International Symposium on Foundations of Software Engineering (FSE 2016). ACM, New York, NY, USA, 97--108.  ",
      "doi": "10.1145/2950290.2950302"
    },
    {
      "text": "David J. Piorkowski, Scott D. Fleming, Irwin Kwan, Margaret M. Burnett, Christopher Scaffidi, Rachel K. E. Bellamy, and Joshua Jordahl. 2013. The Whats and Hows of Programmers' Foraging Diets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 3063--3072.  ",
      "doi": "10.1145/2470654.2466418"
    },
    {
      "text": "Peter Pirolli and Stuart Card. 1999. Information Foraging. Psychological Review 106, 4 (1999), 643--675.",
      "doi": "10.1037/0033-"
    },
    {
      "text": "Matthew D. Plumlee and Colin Ware. 2006. Zooming Versus Multiple Window Interfaces: Cognitive Costs of Visual Comparisons. ACM Trans. Comput.-Hum. Interact. 13, 2 (June 2006), 179--209.  ",
      "doi": "10.1145/1165734.1165736"
    },
    {
      "text": "George Robertson, Mary Czerwinski, Kevin Larson, Daniel C. Robbins, David Thiel, and Maarten van Dantzich. 1998. Data Mountain: Using Spatial Memory for Document Management. In Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology (UIST '98). ACM, New York, NY, USA, 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Janice Singer, Robert Elves, and Margaret-Anne Storey. 2005. NavTracks: Supporting Navigation in Software Maintenance. In Proceedings of the 21st IEEE International Conference on Software Maintenance (ICSM '05). IEEE Computer Society, Washington, DC, USA, 325--334.  ",
      "doi": "10.1109/ICSM.2005.66"
    },
    {
      "text": "Alka Singh, Austin Z. Henley, Scott D. Fleming, and Maria V. Luong. 2016. An Empirical Evaluation of Models of Programmer Navigation. In IEEE Int'l Conference on Software Maintenance and Evolution (ICSME '16). 9--19.",
      "doi": ""
    },
    {
      "text": "Randall B. Smith, John Maloney, and David Ungar. 1995. The Self-4.0 User Interface: Manifesting a System-wide Vision of Concreteness, Uniformity, and Flexibility. In Proceedings of the Tenth Annual Conference on Object-oriented Programming Systems, Languages, and Applications (OOPSLA '95). ACM, New York, NY, USA, 47--60.  ",
      "doi": "10.1145/217838.217843"
    },
    {
      "text": "Jared M. Spool, Christine Perfetti, and David Brittan. 2004. Designing for the Scent of Information. User Interface Engineering, Middleton, MA.",
      "doi": ""
    },
    {
      "text": "Davor Čubranič, Gail C. Murphy, Janice Singer, and Kellogg S. Booth. 2005. Hipikat: A Project Memory for Software Development. IEEE Trans. Softw. Eng. 31, 6 (2005), 446--465.  ",
      "doi": "10.1109/TSE.2005.71"
    },
    {
      "text": "Kirsten N. Whitley, Laura R. Novick, and Doug Fisher. 2006. Evidence in Favor of Visual Representation for the Dataflow Paradigm: An Experiment Testing LabVIEW's Comprehensibility. Int. J. Hum.-Comput. Stud. 64, 4 (April 2006), 281--303.  ",
      "doi": "10.1016/j.ijhcs.2005.06.005"
    }
  ]
}