{
  "doi": "10.1145/3025453.3025971",
  "title": "PinPad: Touchpad Interaction with Fast and High-Resolution Tactile Output",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2416-2425",
  "year": 2017,
  "badges": [],
  "abstract": "We explored new interaction scenarios that can be realized when a touchpad outputs fast and high-resolution spatio-temporal tactile patterns to the touch-sensitive skin on the fingertips of a user. We first constructed a special tactile multi-touch touchpad called PinPad, which was capable of outputting fast and high-resolution tactile patterns using a 40 x 25 array of actuated pins. We then developed various interaction scenarios that could be realized using the prototype: 1) Tactile Target, 2) Guide and Constraint, 3) Multi-finger Output, and 4) Dynamic Partition. To evaluate the PinPad scenarios, we implemented demo applications, and conducted interviews with users to collect feedback about their experiences with PinPad and the PinPad scenarios. The participants confirmed the effectiveness of spatio-temporal outputs of PinPad in the scenarios. In particular, they provided diverse feedback regarding the unique tactile experiences of the fast and high-resolution outputs of PinPad.",
  "authors": [
    {
      "name": "Jingun Jung",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "60000000515",
      "orcid": "missing"
    },
    {
      "name": "Eunhye Youn",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640721",
      "orcid": "missing"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: electrovibration for touch surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Andrea Bianchi, Ian Oakley, and Dong Soo Kwon. 2010. The secure haptic keypad: a tactile password system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1089--1092.  ",
      "doi": "10.1145/1753326.1753488"
    },
    {
      "text": "Sangwon Choi, Jaehyun Han, Geehyuk Lee, Narae Lee, and Woohun Lee. 2011. RemoteTouch: touch-screen-like interaction in the tv viewing environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 393--402.  ",
      "doi": "10.1145/1978942.1978999"
    },
    {
      "text": "Craig Michael Ciesla and Micah B Yairi. 2012. User interface system and method. (May 15 2012). US Patent 8,179,375.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In UIST, Vol. 13. 417--426.",
      "doi": ""
    },
    {
      "text": "Masaaki Fukumoto and Toshiaki Sugimura. 2001. Active click: tactile feedback for touch panels. In CHI'01 Extended Abstracts on Human Factors in Computing Systems. ACM, 121--122.  ",
      "doi": "10.1145/634067.634141"
    },
    {
      "text": "Louis H Goldish and Harry E Taylor. 1974. The Optacon: A Valuable Device for Blind Persons. New Outlook for the Blind 68, 2 (1974), 49--56.",
      "doi": ""
    },
    {
      "text": "Jiseong Gu, Seongkook Heo, Jaehyun Han, Sunjun Kim, and Geehyuk Lee. 2013. LongPad: a touchpad using the entire area below the keyboard of a laptop computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1421--1430.  ",
      "doi": "10.1145/2470654.2466188"
    },
    {
      "text": "Chris Harrison and Scott E Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 299--308.  ",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. TRANSFORM: Embodiment of Radical Atoms at Milano Design Week. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 687--694.  ",
      "doi": "10.1145/2702613.2702969"
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: adding haptic surface to graphics. In Proceedings of the 28th annual conference on Computer graphics and interactive techniques. ACM, 469--476.  ",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Yvonne Jansen, Thorsten Karrer, and Jan Borchers. 2010. MudPad: tactile feedback and haptic texture overlay for touch surfaces. In ACM International Conference on Interactive Tabletops and Surfaces. ACM, 11--14.  ",
      "doi": "10.1145/1936652.1936655"
    },
    {
      "text": "Lynette A Jones and Kathryn Ray. 2008. Localization and pattern recognition with tactile displays. In 2008 Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 33--39.  ",
      "doi": "10.1109/HAPTICS.2008.4479910"
    },
    {
      "text": "Sunjun Kim and Geehyuk Lee. 2013. Haptic feedback design for a virtual button along force-displacement curves. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 91--96.  ",
      "doi": "10.1145/2501988.2502041"
    },
    {
      "text": "Seung-Chan Kim, Ali Israr, and Ivan Poupyrev. 2013. Tactile rendering of 3D features on touch surfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 531--538.  ",
      "doi": "10.1145/2501988.2502020"
    },
    {
      "text": "Michael Kraus, Thorsten Völkel, and Gerhard Weber. 2008. An off-screen model for tactile graphical user interfaces. In International Conference on Computers for Handicapped Persons. Springer, 865--872.  ",
      "doi": "10.1007/978-3-540-70540-6_128"
    },
    {
      "text": "Jaeyeon Lee, Jaehyun Han, and Geehyuk Lee. 2015. Investigating the Information Transfer Efficiency of a 3x3 Watch-back Tactile Display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1229--1232.  ",
      "doi": "10.1145/2702123.2702530"
    },
    {
      "text": "Vincent Levesque, Louise Oram, Karon MacLean, Andy Cockburn, Nicholas D Marchuk, Dan Johnson, J Edward Colgate, and Michael A Peshkin. 2011. Enhancing physicality in touch interaction with programmable friction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2481--2490.  ",
      "doi": "10.1145/1978942.1979306"
    },
    {
      "text": "Shahzad Malik and Joe Laszlo. 2004. Visual touchpad: a two-handed gestural input device. In Proceedings of the 6th international conference on Multimodal interfaces. ACM, 289--296.  ",
      "doi": "10.1145/1027933.1027980"
    },
    {
      "text": "Mays. 2013. Move Over Laptops; Touchpads Are on the Rise in Cars. https://www.cars.com/articles/2013/11/ move-over-laptops-touchpads-rise-in-cars. (Nov. 12 2013). Accessed: 2016-09--21.",
      "doi": ""
    },
    {
      "text": "Viktor Miruchna, Robert Walter, David Lindlbauer, Maren Lehmann, Regine Von Klitzing, and Jörg Müller. 2015. GelTouch: Localized Tactile Feedback Through Thin, Programmable Gel. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 3--10.  ",
      "doi": "10.1145/2807442.2807487"
    },
    {
      "text": "Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: interactive visual and shape display for calm computing. In ACM SIGGRAPH 2004 Emerging technologies. ACM, 17.  ",
      "doi": "10.1145/1186155.1186173"
    },
    {
      "text": "Ivan Poupyrev, Jun Rekimoto, and Shigeaki Maruyama. 2002. TouchEngine: a tactile display for handheld devices. In CHI'02 Extended Abstracts on Human Factors in Computing Systems. ACM, 644--645.  ",
      "doi": "10.1145/506443.506525"
    },
    {
      "text": "Denise Prescher, Gerhard Weber, and Martin Spindler. 2010. A tactile windowing system for blind users. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility. ACM, 91--98.  ",
      "doi": "10.1145/1878803.1878821"
    },
    {
      "text": "Christophe Ramstein. 1996. Combining haptic and braille technologies: design issues and pilot study. In Proceedings of the second annual ACM conference on Assistive technologies. ACM, 37--44.  ",
      "doi": "10.1145/228347.228355"
    },
    {
      "text": "Jun Rekimoto and Carsten Schwesig. 2006. PreSenseII: bi-directional touch and pressure sensing interactions with tactile feedback. In CHI'06 extended abstracts on Human factors in computing systems. ACM, 1253--1258.  ",
      "doi": "10.1145/1125451.1125685"
    },
    {
      "text": "Deepak Ranjan Sahoo, Kasper Hornbæk, and Sriram Subramanian. 2016. TableHop: An Actuated Fabric Display Using Transparent Electrodes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3767--3780.  ",
      "doi": "10.1145/2858036.2858544"
    },
    {
      "text": "Martin Spindler, Michael Kraus, and Gerhard Weber. 2010. A graphical tactile screen-explorer. In International Conference on Computers for Handicapped Persons. Springer, 474--481. ",
      "doi": ""
    },
    {
      "text": "Jessica Tsimeris, Colin Dedman, Michael Broughton, and Tom Gedeon. 2013. ForceForm: A Dynamically Deformable Interactive Surface.. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces. 175--178.  ",
      "doi": "10.1145/2512349.2512807"
    },
    {
      "text": "Laura Windield, John Glassmire, J Edward Colgate, and Michael Peshkin. 2007. T-pad: Tactile pattern display through variable friction reduction. In Second Joint EuroHaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (WHC'07). IEEE, 421--426.",
      "doi": "10.1109/WHC.2007.105"
    }
  ]
}