{
  "doi": "10.1145/3025453.3025768",
  "title": "Voyager 2: Augmenting Visual Analysis with Partial View Specifications",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2648-2659",
  "year": 2017,
  "badges": [],
  "abstract": "Visual data analysis involves both open-ended and focused exploration. Manual chart specification tools support question answering, but are often tedious for early-stage exploration where systematic data coverage is needed. Visualization recommenders can encourage broad coverage, but irrelevant suggestions may distract users once they commit to specific questions. We present Voyager 2, a mixed-initiative system that blends manual and automated chart specification to help analysts engage in both open-ended exploration and targeted question answering. We contribute two partial specification interfaces: wildcards let users specify multiple charts in parallel, while related views suggest visualizations relevant to the currently specified chart. We present our interface design and applications of the CompassQL visualization query language to enable these interfaces. In a controlled study we find that Voyager 2 leads to increased data field coverage compared to a traditional specification tool, while still allowing analysts to flexibly drill-down and answer specific questions.",
  "authors": [
    {
      "name": "Kanit Wongsuphasawat",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548549056",
      "orcid": "missing"
    },
    {
      "name": "Zening Qu",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659076190",
      "orcid": "missing"
    },
    {
      "name": "Dominik Moritz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-89758751957/rel-imgonly/dominik_berlin.jpg",
      "acmid": "89758751957",
      "orcid": "0000-0002-3110-1053"
    },
    {
      "name": "Riley Chang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162564",
      "orcid": "missing"
    },
    {
      "name": "Felix Ouk",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162342",
      "orcid": "missing"
    },
    {
      "name": "Anushka Anand",
      "institution": "Tableau Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659421712",
      "orcid": "missing"
    },
    {
      "name": "Jock Mackinlay",
      "institution": "Tableau Software, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81452617082/rel-imgonly/jock.jpg",
      "acmid": "81452617082",
      "orcid": "missing"
    },
    {
      "name": "Bill Howe",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548006563/rel-imgonly/billhowe.jpg",
      "acmid": "81548006563",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Heer",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anushka Anand and Justin Talbot. 2016. Automatic Selection of Partitioning Variables for Small Multiple Displays. IEEE Transactions on Visualization and Computer Graphics (Proc. InfoVis) 22, 1 (2016), 669--677.",
      "doi": ""
    },
    {
      "text": "Dale J. Barr, Roger Levy, Christoph Scheepers, and Harry J. Tily. 2013. Random effects structure for confirmatory hypothesis testing: Keep it maximal. Journal of memory and language 68, 3 (2013), 255--278. ",
      "doi": ""
    },
    {
      "text": "Jacques Bertin. 1983. Semiology of graphics: diagrams, networks, maps. University of Wisconsin press.",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Enrico Bertini, Andrada Tatu, and Daniel Keim. 2011. Quality metrics in high-dimensional data visualization: an overview and systematization. IEEE Transactions on Visualization and Computer Graphics (Proc. InfoVis) 17, 12 (2011), 2203--2212.",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics (Proc. InfoVis) 17, 12 (2011), 2301--2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Stephen M. Casner. 1991. Task-analytic approach to the automated design of graphic presentations. ACM Transactions on Graphics (TOG) 10, 2 (1991), 111--151.  ",
      "doi": "10.1145/108360.108361"
    },
    {
      "text": "William S. Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. J. Amer. Statist. Assoc. 79, 387 (1984), 531--554. ",
      "doi": ""
    },
    {
      "text": "David Gotz and Zhen Wen. 2009. Behavior-driven visualization recommendation. In Proceedings of the 14th international conference on Intelligent user interfaces. 315--324.",
      "doi": "10.1145/1502650.1502695"
    },
    {
      "text": "Spence Green, Jeffrey Heer, and Christopher D. Manning. 2013. The efficacy of human post-editing for language translation. In Proc. ACM Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/2470654.2470718"
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive Dynamics for Visual Analysis. Commun. ACM 55, 4 (April 2012), 45--54. http: //idl.cs.washington.edu/papers/interactive-dynamics.",
      "doi": "10.1145/2133806.2133821"
    },
    {
      "text": "Jeffrey Heer, Frank Van Ham, Sheelagh Carpendale, Chris Weaver, and Petra Isenberg. 2008. Creation and collaboration: Engaging new audiences for information visualization. In Information Visualization. Springer, 92--133.  ",
      "doi": "10.1007/978-3-540-70956-5_5"
    },
    {
      "text": "Jonathan L. Herlocker, Joseph A. Konstan, Loren G. Terveen, and John T. Riedl. 2004. Evaluating Collaborative Filtering Recommender Systems. ACM Trans. Inf. Syst. 22, 1 (Jan. 2004), 5--53.  ",
      "doi": "10.1145/963770.963772"
    },
    {
      "text": "Jeff Huang, Ryen White, and Georg Buscher. 2012. User see, user point: gaze and cursor alignment in web search. In Proc. ACM Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/2207676.2208591"
    },
    {
      "text": "Jock Mackinlay. 1986. Automating the design of graphical presentations of relational information. ACM Transactions on Graphics 5, 2 (1986), 110--141.  ",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "Jock Mackinlay, Pat Hanrahan, and Chris Stolte. 2007. Show Me: Automatic Presentation for Visual Analysis. IEEE Transactions on Visualization and Computer Graphics (Proc. InfoVis) 13, 6 (2007), 1137--1144.",
      "doi": "10.1109/TVCG.2007.70594"
    },
    {
      "text": "Gary Marchionini. 2006. Exploratory search: from finding to understanding. Commun. ACM 49, 4 (2006), 41--46.  ",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Joe Marks, Brad Andalman, Paul A. Beardsley, William Freeman, Sarah Gibson, Jessica Hodgins, Thomas Kang, Brian Mirtich, Hanspeter Pfister, Wheeler Ruml, and others. 1997. Design galleries: A general approach to setting parameters for computer graphics and animation. In Proceedings of the 24th annual conference on Computer graphics and interactive techniques. ACM Press/Addison-Wesley Publishing Co., 389--400.  ",
      "doi": "10.1145/258734.258887"
    },
    {
      "text": "David S. Moore and George P. McCabe. 1989. Introduction to the Practice of Statistics. WH Freeman/Times Books/Henry Holt & Co.",
      "doi": ""
    },
    {
      "text": "Daniel B. Perry, Bill Howe, Alicia M.F. Key, and Cecilia Aragon. 2013. VizDeck: Streamlining exploratory visual analytics of scientific data. In Proc. iSchool Conference.",
      "doi": ""
    },
    {
      "text": "Zening Qu and Jessica Hullman. 2016. Evaluating Visualization Sets: Trade-offs Between Local Effectiveness and Global Consistency. In Proceedings of the Beyond Time and Errors on Novel Evaluation Methods for Visualization. ACM, 44--52.  ",
      "doi": "10.1145/2993901.2993910"
    },
    {
      "text": "Ernesto Ramos and David Donoho. 1983. ASA Data Exposition Dataset. (1983). http://stat-computing.org/dataexpo/1983.html.",
      "doi": ""
    },
    {
      "text": "Francesca Rossi, Peter Van Beek, and Toby Walsh. 2006. Handbook of constraint programming. Elsevier.",
      "doi": "10.5555/2843512"
    },
    {
      "text": "Steven F. Roth, John Kolojejchick, Joe Mattis, and Jade Goldstein. 1994. Interactive graphic design using automatic presentation knowledge. In Proc. ACM Human Factors in Computing Systems (CHI). ACM, 112--117.",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2017). http://idl.cs.washington.edu/papers/vega-lite.",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Ryan Russell, Jane Hoffswell, and Jeffrey Heer. 2016. Reactive Vega: A Streaming Dataflow Architecture for Declarative Interactive Visualization. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2016). http://idl.cs.washington.edu/papers/ reactive-vega-architecture.",
      "doi": ""
    },
    {
      "text": "Jinwook Seo and Ben Shneiderman. 2005. A rank-by-feature framework for interactive exploration of multidimensional data. Information Visualization 4, 2 (2005), 96--113.",
      "doi": "10.1057/palgrave.ivs.9500091"
    },
    {
      "text": "Ben Shneiderman. 1994. Dynamic queries for visual information seeking. Software, IEEE 11, 6 (1994), 70--77.  ",
      "doi": "10.1109/52.329404"
    },
    {
      "text": "Tarique Siddiqui, Albert Kim, John Lee, Karrie Karahalios, and Aditya Parameswaran. 2017. Effortless Data Exploration with zenvisage: An Expressive and Interactive Visual Analytics System. International Conference on Very Large Data Bases (VLDB) (2017).",
      "doi": ""
    },
    {
      "text": "Chris Stolte, Diane Tang, and Pat Hanrahan. 2002. Polaris: A System for Query, Analysis, and Visualization of Multidimensional Relational Databases. IEEE Transactions on Visualization and Computer Graphics 8, 1 (2002), 52--65.  ",
      "doi": "10.1109/2945.981851"
    },
    {
      "text": "John W. Tukey. 1977. Exploratory data analysis. Reading, Ma 231 (1977), 32.",
      "doi": ""
    },
    {
      "text": "Stef van den Elzen and Jarke J. van Wijk. 2013. Small multiples, large singles: A new approach for visual data exploration. Computer Graphics Forum 32, 3pt2 (2013), 191--200.  ",
      "doi": "10.1111/cgf.12106"
    },
    {
      "text": "Manasi Vartak, Samuel Madden, Aditya Parameswaran, and Neoklis Polyzotis. 2014. SeeDB: Automatically Generating Query Visualizations. Proceedings of the VLDB Endowment 7, 13 (2014), 1581--1584.  ",
      "doi": "10.14778/2733004.2733035"
    },
    {
      "text": "Ryen W. White and Resa A. Roth. 2009. Exploratory search: Beyond the query-response paradigm. Synthesis Lectures on Information Concepts, Retrieval, and Services 1, 1 (2009), 1--98. ",
      "doi": ""
    },
    {
      "text": "Hadley Wickham. 2009. ggplot2: Elegant Graphics for Data Analysis. Springer.",
      "doi": "10.5555/1795559"
    },
    {
      "text": "Leland Wilkinson. 2005. The Grammar of Graphics. Springer.",
      "doi": "10.5555/316575"
    },
    {
      "text": "Leland Wilkinson, Anushka Anand, and Robert L. Grossman. 2005. Graph-Theoretic Scagnostics.. In IEEE Transactions on Visualization and Computer Graphics (Proc. InfoVis), Vol. 5. 21. ",
      "doi": ""
    },
    {
      "text": "Graham Wills and Leland Wilkinson. 2010. Autovis: automatic visualization. Information Visualization 9, 1 (2010), 47--69.  ",
      "doi": "10.1057/ivs.2008.27"
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016a. Towards a general-purpose query language for visualization recommendation. In Proceedings of the Workshop on Human-In-the-Loop Data Analytics. ACM. http://idl.cs.washington.edu/papers/compassql.  ",
      "doi": "10.1145/2939502.2939506"
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016b. Voyager: Exploratory Analysis via Faceted Browsing of Visualization Recommendations. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2016). http://idl.cs.washington.edu/papers/voyager.",
      "doi": ""
    },
    {
      "text": "Ka-Ping Yee, Kirsten Swearingen, Kevin Li, and Marti Hearst. 2003. Faceted Metadata for Image Search and Browsing. In Proc. ACM Human Factors in Computing Systems (CHI). 401--408.  ",
      "doi": "10.1145/642611.642681"
    },
    {
      "text": "Michelle X. Zhou and Min Chen. 2003. Automated generation of graphic sketches by example. In IJCAI, Vol. 3. 65--71.",
      "doi": ""
    }
  ]
}