{
  "doi": "10.1145/3025453.3025941",
  "title": "Improving Gesture Recognition Accuracy on Touch Screens for Users with Low Vision",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4667-4679",
  "year": 2017,
  "badges": [],
  "abstract": "We contribute in this work on gesture recognition to improve the accessibility of touch screens for people with low vision. We examine the accuracy of popular recognizers for gestures produced by people with and without visual impairments, and we show that the user-independent accuracy of $P, the best recognizer among those evaluated, is small for people with low vision (83.8%), despite $P being very effective for gestures produced by people without visual impairments (95.9%). By carefully analyzing the gesture articulations produced by people with low vision, we inform key algorithmic revisions for the P recognizer, which we call P+. We show significant accuracy improvements of $P+ for gestures produced by people with low vision, from 83.8% to 94.7% on average and up to 98.2%, and 3x faster execution times compared to P.",
  "tags": [
    "recognition",
    "evaluation",
    "point clouds",
    "algorithms",
    "touch gestures",
    "low vision",
    "gesture recognition",
    "P+",
    "P",
    "recognition accuracy",
    "visual impairments",
    "1",
    "touch screens"
  ],
  "authors": [
    {
      "name": "Radu-Daniel Vatavu",
      "institution": "University Stefan cel Mare of Suceava, Suceava, Romania",
      "img": "/do/10.1145/contrib-81343507895/rel-imgonly/radu.jpg",
      "acmid": "81343507895",
      "orcid": "0000-0002-7631-6445"
    }
  ],
  "references": [
    {
      "text": "Lisa Anthony, Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2013. Understanding the Consistency of Users' Pen and Finger Stroke Gesture Articulation. In Proc. of Graphics Interface 2013 (GI '13). Canadian Inf. Processing Society, 87--94. http://dl.acm.org/ citation.cfm?id=2532129.2532145 ",
      "doi": "10.5555/2532129.2532145"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2010. A Lightweight Multistroke Recognizer for User Interface Prototypes. In Proc. of Graphics Interface 2010 (GI '10). Canadian Inf. Processing Society, 245--252. http://dl.acm.org/citation.cfm?id=1839214.1839258 ",
      "doi": "10.5555/1839214.1839258"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2012. N-protractor: A Fast and Accurate Multistroke Recognizer. In Proc. of Graphics Interface 2012 (GI '12). Canadian Inf. Processing Society, 117--120. http://dl.acm.org/citation.cfm?id=2305276.2305296 ",
      "doi": "10.5555/2305276.2305296"
    },
    {
      "text": "American Optometric Association. 1997a. Optometric Clinical Practice Guideline: Care of the Patient with Hyperopia. (1997). http://www.aoa.org/documents/optometrists/CPG-16.pdf",
      "doi": ""
    },
    {
      "text": "American Optometric Association. 1997b. Optometric Clinical Practice Guideline: Care of the Patient with Myopia. (1997). http://www.aoa.org/documents/optometrists/CPG-15.pdf",
      "doi": ""
    },
    {
      "text": "American Optometric Association. 1997c. Optometric Clinical Practice Guideline: Care of the Patient with Visual Impairment (Low Vision Rehabilitation). (1997). http://www.aoa.org/documents/optometrists/CPG-14.pdf",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot, Kyle Rector, Richard Ladner, and Jacob Wobbrock. 2012. PassChords: Secure Multi-touch Authentication for Blind People. In Proc. of the 14th Int. ACM Conf. on Computers and Accessibility (ASSETS '12). ACM, NY, NY, USA, 159--166.  ",
      "doi": "10.1145/2384916.2384945"
    },
    {
      "text": "Rachel Blagojevic, Samuel Hsiao-Heng Chang, and Beryl Plimmer. 2010. The Power of Automatic Feature Selection: Rubine on Steroids. In Proc. of the Seventh Sketch-Based Interfaces and Modeling Symposium (SBIM '10). Eurographics Association, 79--86. http://dl.acm. org/citation.cfm?id=1923363.1923377 ",
      "doi": "10.5555/1923363.1923377"
    },
    {
      "text": "Anke Brock, Philippe Truillet, Bernard Oriola, and Christophe Jouffrais. 2014. Making Gestural Interaction Accessible to Visually Impaired People. Springer Berlin Heidelberg, Berlin, Heidelberg, 41--48.",
      "doi": ""
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, and Loredana Martusciello. 2011. Making Visual Maps Accessible to the Blind. In Proc. of the 6th Int. Conf. on Universal Access in Human-Computer Interaction: Users Diversity (UAHCI'11). Springer, 271--280. http://dl.acm.org/citation.cfm?id=2027376.2027408 ",
      "doi": "10.5555/2027376.2027408"
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, and Amaury Trujillo. 2015. Exploring Visually Impaired People's Gesture Preferences for Smartphones. In Proc. of the 11th Conf. on Italian SIGCHI Chapter (CHItaly 2015). ACM, NY, NY, USA, 94--101.  ",
      "doi": "10.1145/2808435.2808448"
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, and Amaury Trujillo. 2016. Analyzing visually impaired people's touch gestures on smartphones. Multimedia Tools and Applications (2016), 1--29.",
      "doi": ""
    },
    {
      "text": "Tim Dittmar, Claudia Krull, and Graham Horton. 2015. A new approach for touch gesture recognition: Conversive Hidden non-Markovian Models. Joural of Computational Science 10 (2015), 66--76.",
      "doi": ""
    },
    {
      "text": "Manfredo Do Carmo. 1976. Differential Geometry of Curves and Surfaces. Prentice-Hall, Englewood Cliffs, New Jersey, USA.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z. Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2007. Automatically Generating User Interfaces Adapted to Users' Motor and Vision Capabilities. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, NY, NY, USA, 231--240.  ",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Poika Isokoski. 2001. Model for Unistroke Writing Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, NY, NY, USA, 357--364.  ",
      "doi": "10.1145/365024.365299"
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide Rule: Making Mobile Touch Screens Accessible to Blind People Using Multi-touch Interaction Techniques. In Proc. of the 10th Int. ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '08). ACM, NY, NY, USA, 73--80.  ",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to Roam: A Study of Mobile Device Adoption and Accessibility for People with Visual and Motor Disabilities. In Proc. of the 11th Int. ACM Conf. on Computers and Accessibility (ASSETS '09). ACM, NY, NY, USA, 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, and Jacob O. Wobbrock. 2013. Touchplates: Low-cost Tactile Overlays for Visually Impaired Touch Screen Users. In Proc. of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, NY, NY, USA, Article 22, 8 pages.  ",
      "doi": "10.1145/2513383.2513442"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Levent Burak Kara and Thomas F. Stahovich. 2004. Hierarchical Parsing and Recognition of Hand-sketched Diagrams. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 13--22.  ",
      "doi": "10.1145/1029632.1029636"
    },
    {
      "text": "Kenrick Kin, Björn Hartmann, Tony DeRose, and Maneesh Agrawala. 2012. Proton: Multitouch Gestures As Regular Expressions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2885--2894.  ",
      "doi": "10.1145/2207676.2208694"
    },
    {
      "text": "Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. In Proc. of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Réjean Plamondon. 2015. Gestures À Go Go: Authoring Synthetic Human-Like Stroke Gestures Using the Kinematic Theory of Rapid Movements. ACM Trans. Intell. Syst. Technol. 7, 2, Article 15 (Nov. 2015), 29 pages.  ",
      "doi": "10.1145/2799648"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Radu-Daniel Vatavu. 2017. Synthesizing Stroke Gestures Across User Populations: A Case for Users with Visual Impairments. In Proc. of the 35th ACM Conf. on Human Factors in Computing Systems (CHI '17). ACM.  ",
      "doi": "10.1145/3025453.3025906"
    },
    {
      "text": "L.A. Levin and D.M. Albert. 2010. Ocular Disease: Mechanisms and Management. Elsevier.",
      "doi": ""
    },
    {
      "text": "Yang Li. 2010. Protractor: A Fast and Accurate Gesture Recognizer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2169--2172.  ",
      "doi": "10.1145/1753326.1753654"
    },
    {
      "text": "Hao Lü and Yang Li. 2012. Gesture Coder: A Tool for Programming Multi-touch Gestures by Demonstration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2875--2884.  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Hao Lü and Yang Li. 2013. Gesture Studio: Authoring Multi-touch Interactions Through Demonstration and Declaration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 257--266.  ",
      "doi": "10.1145/2470654.2470690"
    },
    {
      "text": "David McGookin, Stephen Brewster, and WeiWei Jiang. 2008. Investigating Touchscreen Accessibility for People with Visual Impairments. In Proc. of the 5th Nordic Conf. on Human-Computer Interaction (NordiCHI '08). ACM, NY, NY, USA, 298--307.  ",
      "doi": "10.1145/1463160.1463193"
    },
    {
      "text": "Martez E. Mott, Radu-Daniel Vatavu, Shaun K. Kane, and Jacob O. Wobbrock. 2016. Smart Touch: Improving Touch Accuracy for People with Motor Impairments with Template Matching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1934--1946.  ",
      "doi": "10.1145/2858036.2858390"
    },
    {
      "text": "C.S. Myers and L.R. Rabiner. 1981. A comparative study of several dynamic time-warping algorithms for connected word recognition. The Bell System Technical Journal 60, 7 (1981), 1389--1409.",
      "doi": ""
    },
    {
      "text": "Uran Oh, Stacy Branham, Leah Findlater, and Shaun K. Kane. 2015. Audio-Based Feedback Techniques for Teaching Touchscreen Gestures. ACM Trans. Access. Comput. 7, 3, Article 9 (Nov. 2015), 29 pages.  ",
      "doi": "10.1145/2764917"
    },
    {
      "text": "World Health Organization. 2014. Visual impairment and blindness. Fact Sheet N282. (2014). http://www.who.int/mediacentre/factsheets/fs282/en/",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2016. ICD-10, Visual disturbances and blindness. (2016). http://apps.who.int/classifications/icd10/browse/2016/en#/H53-H54",
      "doi": ""
    },
    {
      "text": "C. H. Papadimitriou and K. Steiglitz. 1998. Combinatorial optimization: algorithms and complexity. Dover Publications, Mineola, NY, USA.",
      "doi": ""
    },
    {
      "text": "Thanawin Rakthanmanon, Bilson Campana, Abdullah Mueen, Gustavo Batista, Brandon Westover, Qiang Zhu, Jesin Zakaria, and Eamonn Keogh. 2012. Searching and Mining Trillions of Time Series Subsequences Under Dynamic Time Warping. In Proc. of the 18th ACM Int. Conf. on Knowledge Discovery and Data Mining (KDD '12). ACM, NY, NY, USA, 262--270.  ",
      "doi": "10.1145/2339530.2339576"
    },
    {
      "text": "Yosra Rekik, Radu-Daniel Vatavu, and Laurent Grisoni. 2014a. Match-up & Conquer: A Two-Step Technique for Recognizing Unconstrained Bimanual and Multi-finger Touch Input. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, NY, NY, USA, 201--208.  ",
      "doi": "10.1145/2598153.2598167"
    },
    {
      "text": "Yosra Rekik, Radu-Daniel Vatavu, and Laurent Grisoni. 2014b. Understanding Users' Perceived Difficulty of Multi-Touch Gesture Articulation. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, NY, NY, USA, 232--239.  ",
      "doi": "10.1145/2663204.2663273"
    },
    {
      "text": "Dean Rubine. 1991. Specifying Gestures by Example. In Proceedings of the 18th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '91). ACM, NY, NY, USA, 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Tevfik Metin Sezgin and Randall Davis. 2005. HMM-based Efficient Sketch Recognition. In Proc. of the 10th Int. Conf. on Intelligent User Interfaces (IUI '05). ACM, NY, NY, USA, 281--283.  ",
      "doi": "10.1145/1040830.1040899"
    },
    {
      "text": "Kristen Shinohara and Josh Tenenberg. 2007. Observing Sara: A Case Study of a Blind Person's Interactions with Technology. In Proceedings of the 9th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '07). ACM, NY, NY, USA, 171--178.  ",
      "doi": "10.1145/1296843.1296873"
    },
    {
      "text": "Radu-Daniel Vatavu. 2011. The Effect of Sampling Rate on the Performance of Template-based Gesture Recognizers. In Proc. of the 13th Int. Conf. on Multimodal Interfaces (ICMI '11). ACM, 271--278.  ",
      "doi": "10.1145/2070481.2070531"
    },
    {
      "text": "Radu-Daniel Vatavu. 2012. 1F: One Accessory Feature Design for Gesture Recognizers. In Proc. of the 2012 ACM Int. Conf. on Intelligent User Interfaces (IUI '12). ACM, NY, NY, USA, 297--300.  ",
      "doi": "10.1145/2166966.2167022"
    },
    {
      "text": "Radu-Daniel Vatavu. 2013. The Impact of Motion Dimensionality and Bit Cardinality on the Design of 3D Gesture Recognizers. Int. J. Hum.-Comput. Stud. 71, 4 (April 2013), 387--409.  ",
      "doi": "10.1016/j.ijhcs.2012.11.005"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2012. Gestures As Point Clouds: A $P Recognizer for User Interface Prototypes. In Proc. of the 14th ACM Int. Conference on Multimodal Interaction (ICMI '12). ACM, NY, NY, USA, 273--280.  ",
      "doi": "10.1145/2388676.2388732"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2013. Relative Accuracy Measures for Stroke Gestures. In Proc. of the 15th ACM Int. Conf. on Multimodal Interaction (ICMI '13). ACM, 279--286.  ",
      "doi": "10.1145/2522848.2522875"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2014. Gesture Heatmaps: Understanding Gesture Performance with Colorful Visualizations. In Proc. of the 16th Int. Conf. on Multimodal Interaction (ICMI '14). ACM, NY, NY, USA, 172--179.  ",
      "doi": "10.1145/2663204.2663256"
    },
    {
      "text": "Radu-Daniel Vatavu, Gabriel Cramariuc, and Doina Maria Schipor. 2015. Touch Interaction for Children Aged 3 to 6 Years: Experimental Findings and Relationship to Motor Skills. International Journal of Human-Computer Studies 74 (2015), 54--76.  ",
      "doi": "10.1016/j.ijhcs.2014.10.007"
    },
    {
      "text": "Radu-Daniel Vatavu, Laurent Grisoni, and Stefan-Gheorghe Pentiuc. 2009. Gesture-Based Human-Computer Interaction and Simulation. Springer-Verlag, Chapter Gesture Recognition Based on Elastic Deformation Energies, 1--12.  ",
      "doi": "10.1007/978-3-540-92865-2_1"
    },
    {
      "text": "Radu-Daniel Vatavu, Laurent Grisoni, and Stefan-Gheorghe Pentiuc. 2010. Multiscale Detection of Gesture Patterns in Continuous Motion Trajectories. In Proc. of the 8th Int. Conf. on Gesture in Embodied Communication and Human-Computer Interaction (GW'09). Springer-Verlag, 85--97.  ",
      "doi": "10.1007/978-3-642-12553-9_8"
    },
    {
      "text": "Radu-Daniel Vatavu, Daniel Vogel, Géry Casiez, and Laurent Grisoni. 2011. Estimating the Perceived Difficulty of Pen Gestures. In Proc. of the 13th IFIP TC 13 Int. Conf. on Human-computer Interaction (INTERACT'11). Springer, 89--106. http://dl.acm. org/citation.cfm?id=2042118.2042130 ",
      "doi": "10.5555/2042118.2042130"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proc. of the 33rd Annual ACM Conf. on Human Factors in Computing Systems (CHI '15). ACM, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with Soli: Exploring Fine-Grained Dynamic Gesture Recognition in the Radio-Frequency Spectrum. In Proc. of the 29th Annual Symp. on User Interface Software and Technology (UIST '16). ACM, 851--860.  ",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Sy Bor Wang, Ariadna Quattoni, Louis-Philippe Morency, and David Demirdjian. 2006. Hidden Conditional Random Fields for Gesture Recognition. In Proc. of the 2006 IEEE Conf. on Computer Vision and Pattern Recognition (CVPR '06). 1521--1527.  ",
      "doi": "10.1109/CVPR.2006.132"
    },
    {
      "text": "Don Willems, Ralph Niels, Marcel van Gerven, and Louis Vuurpijl. 2009. Iconic and Multi-stroke Gesture Recognition. Pattern Recognition 42, 12 (2009), 3303--3312.  ",
      "doi": "10.1016/j.patcog.2009.01.030"
    },
    {
      "text": "Andrew D. Wilson and Aaron F. Bobick. 1999. Parametric Hidden Markov Models for Gesture Recognition. IEEE TPAMI 21, 9 (1999), 884--900.  ",
      "doi": "10.1109/34.790429"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Trans. Access. Comput. 3, 3, Article 9 (2011), 27 pages.  ",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures Without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proc. of the 20th Annual ACM Symp. on User Interface Software and Technology (UIST '07). ACM, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}