{
  "doi": "10.1145/3025453.3025922",
  "title": "Regression by Eye: Estimating Trends in Bivariate Visualizations",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1387-1396",
  "year": 2017,
  "badges": [],
  "abstract": "Observing trends and predicting future values are common tasks for viewers of bivariate data visualizations. As many charts do not explicitly include trend lines or related statistical summaries, viewers often visually estimate trends directly from a plot. How reliable are the inferences viewers draw when performing such regression by eye? Do particular visualization designs or data features bias trend perception? We present a series of crowdsourced experiments that assess the accuracy of trends estimated using regression by eye across a variety of bivariate visualizations, and examine potential sources of bias in these estimations. We find that viewers accurately estimate trends in many standard visualizations of bivariate data, but that both visual features (e.g., \"within-the-bar\" bias) and data features (e.g., the presence of outliers) can result in visual estimates that systematically diverge from standard least-squares regression models.",
  "tags": [
    "graphical perception",
    "information visualization",
    "regression"
  ],
  "authors": [
    {
      "name": "Michael Correll",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502658789",
      "orcid": "0000-0001-7902-3907"
    },
    {
      "name": "Jeffrey Heer",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Danielle Albers, Michael Correll, and Michael Gleicher. 2014. Task-driven evaluation of aggregation in time series visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 551--560.  ",
      "doi": "10.1145/2556288.2557200"
    },
    {
      "text": "Francis J Anscombe. 1973. Graphs in statistical analysis. The American Statistician 27, 1 (1973), 17--21.",
      "doi": ""
    },
    {
      "text": "Dan Ariely. 2001. Seeing sets: Representation by statistical properties. Psychological science 12, 2 (2001), 157--162. ",
      "doi": ""
    },
    {
      "text": "Vivien Beattie and Michael John Jones. 2002. The impact of graph slope on rate of change judgments in corporate reports. Abacus 38, 2 (2002), 177--199. ",
      "doi": ""
    },
    {
      "text": "Fergus Bolger and Nigel Harvey. 1993. Context-sensitive heuristics in statistical reasoning. The Quarterly Journal of Experimental Psychology 46, 4 (1993), 779--811. ",
      "doi": ""
    },
    {
      "text": "Sean D Campbell and Steven A Sharpe. 2009. Anchoring bias in consensus forecasts and its effect on market prices. Journal of Financial and Quantitative Analysis 44, 02 (2009), 369--390. ",
      "doi": ""
    },
    {
      "text": "William S Cleveland, Persi Diaconis, and Robert McGill. 1982. Variables on scatterplots look more highly correlated when the scales are increased. Technical Report. DTIC Document.",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984a. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531--554. ",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984b. The many faces of a scatterplot. J. Amer. Statist. Assoc. 79, 388 (1984), 807--822. ",
      "doi": ""
    },
    {
      "text": "Michael Correll, Danielle Albers, Steven Franconeri, and Michael Gleicher. 2012. Comparing averages in time series data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1095--1104.  ",
      "doi": "10.1145/2207676.2208556"
    },
    {
      "text": "Michael Correll and Michael Gleicher. 2014. Error bars considered harmful: Exploring alternate encodings for mean and error. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2142--2151. ",
      "doi": ""
    },
    {
      "text": "Rachel Croson and James Sundali. 2005. The gamblera; AZs fallacy and the hot hand: Empirical data from casinos. Journal of risk and uncertainty 30, 3 (2005), 195--209. ",
      "doi": ""
    },
    {
      "text": "Johannes Fuchs, Fabian Fischer, Florian Mansmann, Enrico Bertini, and Petra Isenberg. 2013. Evaluation of alternative glyph designs for time series data in a small multiple setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3237--3246.  ",
      "doi": "10.1145/2470654.2466443"
    },
    {
      "text": "Michael Gleicher, Michael Correll, Christine Nothelfer, and Steven Franconeri. 2013. Perception of average value in multiclass scatterplots. IEEE transactions on visualization and computer graphics 19, 12 (2013), 2316--2325.  ",
      "doi": "10.1109/TVCG.2013.183"
    },
    {
      "text": "Lane Harrison, Fumeng Yang, Steven Franconeri, and Remco Chang. 2014. Ranking visualizations of correlation using weber's law. IEEE transactions on visualization and computer graphics 20, 12 (2014), 1943--1952. ",
      "doi": ""
    },
    {
      "text": "Nigel Harvey Teresa Ewart Robert West. 1997. Effects of data noise on statistical judgement. Thinking & Reasoning 3, 2 (1997), 111--132. ",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization rhetoric: Framing effects in narrative visualization. IEEE transactions on visualization and computer graphics 17, 12 (2011), 2231--2240.  ",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Li-Jun Ji, Richard E Nisbett, and Yanjie Su. 2001. Culture, change, and prediction. Psychological Science 12, 6 (2001), 450--456. ",
      "doi": ""
    },
    {
      "text": "Matthew Kay and Jeffrey Heer. 2016. Beyond Weber's Law: A Second Look at Ranking Visualizations of Correlation. IEEE transactions on visualization and computer graphics 22, 1 (2016), 469--478. ",
      "doi": "10.1109/TVCG.2015.2467671"
    },
    {
      "text": "Yea-Seul Kim, Jessica Hullman, and Katharina Reinecke. 2017. Explaining the Gap: Visualizing OneaAZ Predictions Improves Recall and Comprehension of Data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM. To appear.",
      "doi": "10.1145/3025453.3025592"
    },
    {
      "text": "Stephan Lewandowsky. 2011. Popular consensus climate change is set to continue. Psychological Science (2011).",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky and Ian Spence. 1989. Discriminating strata in scatterplots. J. Amer. Statist. Assoc. 84, 407 (1989), 682--688. ",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Michael Glueck, Tovi Grossman, and George Fitzmaurice. 2016. The Effect of Visual Appearance on the Performance of Continuous Sliders and Visual Analogue Scales. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5421--5432.  ",
      "doi": "10.1145/2858036.2858063"
    },
    {
      "text": "Luana Micallef, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Assessing the effect of visualizations on bayesian reasoning through crowdsourcing. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2536--2545.  ",
      "doi": "10.1109/TVCG.2012.199"
    },
    {
      "text": "Mahsa Mirzargar, Ross T Whitaker, and Robert M Kirby. 2014. Curve boxplot: Generalization of boxplot for ensembles of curves. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2654--2663. ",
      "doi": ""
    },
    {
      "text": "George E Newman and Brian J Scholl. 2012. Bar graphs depicting averages are perceptually misinterpreted: The within-the-bar bias. Psychonomic bulletin & review 19, 4 (2012), 601--607. ",
      "doi": ""
    },
    {
      "text": "Ronald A Rensink and Gideon Baldridge. 2010. The perception of correlation in scatterplots. In Computer Graphics Forum, Vol. 29. Wiley Online Library, 1203--1210.",
      "doi": ""
    },
    {
      "text": "Danielle Albers Szafir, Steve Haroz, Michael Gleicher, and Steven Franconeri. 2016. Four types of ensemble coding in data visualizations. Journal of vision 16, 5 (2016), 11--11. ",
      "doi": ""
    },
    {
      "text": "Justin Talbot, Vidya Setlur, and Anushka Anand. 2014. Four experiments on the perception of bar charts. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2152--2160. ",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1975. Judgment under uncertainty: Heuristics and biases. In Utility, probability, and human decision making. Springer, 141--162. ",
      "doi": ""
    },
    {
      "text": "Jo Wood, Petra Isenberg, Tobias Isenberg, Jason Dykes, Nadia Boukhelifa, and Aidan Slingsby. 2012. Sketchy rendering for information visualization. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2749--2758.  ",
      "doi": "10.1109/TVCG.2012.262"
    },
    {
      "text": "Jeff Zacks and Barbara Tversky. 1999. Bars and lines: A study of graphic communication. Memory & Cognition 27, 6 (1999), 1073--1079. ",
      "doi": ""
    }
  ]
}