{
  "doi": "10.1145/3025453.3025638",
  "title": "Is Difficulty Overrated?: The Effects of Choice, Novelty and Suspense on Intrinsic Motivation in Educational Games",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1028-1039",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Many game designers aim to optimize difficulty to make games that are \"not too hard, not too easy.\" However, recent experiments have shown that even moderate difficulty can reduce player engagement. The present work investigates other design factors that may account for the purported benefits of difficulty, such as choice, novelty and suspense. These factors were manipulated in three design experiments involving over 20,000 play sessions of an online educational game. The first experiment (n=10,472) randomly assigned some players to a particular level of difficulty but allowed other players to freely choose their difficulty. Moderately difficult levels were most motivating when self-selected; yet, when difficulty was blindly assigned, the easiest games were most motivating. The second experiment (n=5,065) randomly assigned players to differing degrees of novelty. Moderate novelty was optimal, while too much or too little novelty reduced intrinsic motivation. A final experiment (n=6,511) investigated the role of suspense in \"close games\", where it was found to be beneficial. If difficulty decreases motivation while novelty and suspense increase it, then an implication for educational game designers is to make easy, interesting games that are \"not too hard, not too boring.\"",
  "authors": [
    {
      "name": "J. Derek Lomas",
      "institution": "University of California, San Diego, San Diego, CA & Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021764",
      "orcid": "missing"
    },
    {
      "name": "Kenneth Koedinger",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100484653/rel-imgonly/img_3518.jpeg",
      "acmid": "81100484653",
      "orcid": "missing"
    },
    {
      "name": "Nirmal Patel",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022347",
      "orcid": "missing"
    },
    {
      "name": "Sharan Shodhan",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81335497377/rel-imgonly/81335497377.jpg",
      "acmid": "81335497377",
      "orcid": "missing"
    },
    {
      "name": "Nikhil Poonwala",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021953",
      "orcid": "missing"
    },
    {
      "name": "Jodi L. Forlizzi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100492013",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abuhamdeh, S. and Csikszentmihalyi, M. (2012) The Importance of Challenge for the Enjoyment of Intrinsically Motivated, Goal-Directed Activities. Personality and Social Psychology Bulletin 38, 3, 317--330. ",
      "doi": ""
    },
    {
      "text": "Andersen, E., Liu, Y., Snider, R., Szeto, R., and Popovic, Z. (2011) Placing a value on aesthetics in online casual games. ACM CHI.  ",
      "doi": "10.1145/1978942.1979131"
    },
    {
      "text": "Aponte, M., Levieux, G., & Natkin, S. (2011). Measuring the level of difficulty in single player video games. Entertainment Computing, 2(4), 205--21 ",
      "doi": ""
    },
    {
      "text": "Atkinson, J. (1958) Towards Experimental Analysis of Human Motivation in Terms of Motives, Expectances, and incentives. In J. Atkinson, ed., Motives in fantasy, action and society. Van Nostrand, Princeton, NJ, 288--305.",
      "doi": ""
    },
    {
      "text": "Barto, A., Mirolli, M., & Baldassarre, G. (2013). Novelty or surprise? Frontiers of Psychology, 4. ",
      "doi": ""
    },
    {
      "text": "Berlyne, D. E. (1970). Novelty, complexity, and hedonic value. Perception & Psychophysics, 8(5), 279--286. ",
      "doi": ""
    },
    {
      "text": "Bjork, S., & Holopainen, J. (2004). Patterns in game design.",
      "doi": ""
    },
    {
      "text": "Chase, C. C. (2012). The interplay of chance and skill: Exploiting a common game mechanic to enhance learning and persistence. Proceedings of the 2012 International Conference of the Learning Sciences.",
      "doi": ""
    },
    {
      "text": "Cordova, D. I., & Lepper, M. R. (1996). Intrinsic motivation and the process of learning: Beneficial effects of contextualization, personalization, and choice. Journal of Educational Psychology, 88(4), 715. ",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M., & Csikszentmihalyi, I. S. (Eds.). (1992). Optimal experience: Psychological studies of flow in consciousness. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Deci, E. L., & Ryan, R. M. (2000). The \"what\" and \"why\" of goal pursuits: Human needs and the self-determination of behavior. Psychological Inquiry, 4, 227--268. ",
      "doi": ""
    },
    {
      "text": "Deci, E. L., & Ryan, R. M. (2003). Intrinsic motivation inventory. Self-Determination Theory, 267.",
      "doi": ""
    },
    {
      "text": "Deci, E. L., Koestner, R., & Ryan, R. M. (1999). A meta-analytic review of experiments examining the effects of extrinsic rewards on intrinsic motivation. Psychological bulletin, 125(6), 627. ",
      "doi": ""
    },
    {
      "text": "Dickey, M.D. (2005) Engaging by design: How engagement strategies in popular computer and video games can inform instructional design. Educational Technology Research and Development 53, 2, 67--83. ",
      "doi": ""
    },
    {
      "text": "Eccles, J. S. and Wigfield, A. Motivational beliefs, values, and goals. Annual review of psychology 53, (2002), 109--32. ",
      "doi": ""
    },
    {
      "text": "Ely, J., Frankel, A., & Kamenica, E. (2015). Suspense and surprise. Journal of Political Economy, 123(1), 215--260. ",
      "doi": ""
    },
    {
      "text": "Fishbach, A. and Finkelstein, S. How feedback influences persistence, disengagement and change in goal pursuit. In A. Elliot and H. Aarts, eds., Goal-directed behavior. Psychology Press, 2012, 1--53.",
      "doi": ""
    },
    {
      "text": "Harter, S. (1978a) Pleasure derived from challenge and the effects of receiving grades on children's difficulty level choices. Child Development 49, 3 788--799.",
      "doi": ""
    },
    {
      "text": "Hebb, D. O. (1955) Drives and the C.N.S. (Conceptual Nervous System) Psychological Review, 62, 243--254 ",
      "doi": ""
    },
    {
      "text": "Van der Heijden, H. (2004). User acceptance of hedonic information systems. MIS Quarterly, 28(4), 695--704.",
      "doi": "10.5555/2017236.2017244"
    },
    {
      "text": "Hockley, R. (2013) The Psychology of Fatigue: Work, Effort and Control. Cambridge University Press. ",
      "doi": ""
    },
    {
      "text": "2Hong, Y., Chiu, C., Dweck, C.S., Lin, D.M.-S., and Wan, W. Implicit theories, attributions, and coping: A meaning system approach. Journal of Personality and Social Psychology 77, 3 (1999), 588--599. ",
      "doi": ""
    },
    {
      "text": "Hunicke, R., & Chapman, V. (2004). AI for dynamic difficulty adjustment in games. Challenges in Game Artificial Intelligence AAAI, 91--96.",
      "doi": ""
    },
    {
      "text": "Kashdan, T. B., & Silvia, P. J. (2009). Curiosity and interest: The benefits of thriving on novelty and challenge. Oxford handbook of positive psychology, 2, 367--374. ",
      "doi": ""
    },
    {
      "text": "Khajah, M. M., Roads, B. D., Lindsey, R. V, & Mozer, M. C. (2016). Designing Engaging Games Using Bayesian Optimization. ACM CHI.  ",
      "doi": "10.1145/2858036.2858253"
    },
    {
      "text": "Klarkowski, M., Johnson, D., Wyeth, P., McEwan, M., Phillips, C., & Smith, S. (2016). Operationalising and Evaluating Sub-Optimal and Optimal Play Experiences through Challenge-Skill Manipulation. ACM CHI.  ",
      "doi": "10.1145/2858036.2858563"
    },
    {
      "text": "Kline, P. (2014). The new psychometrics: Science, psychology and measurement. Routledge. p. 79.",
      "doi": ""
    },
    {
      "text": "Koedinger, K. R., Baker, R. S., Cunningham, K., Skogsholm, A., Leber, B., & Stamper, J. (2010). A data repository for the EDM community: The PSLC DataShop. Handbook of educational data mining, 43. ",
      "doi": ""
    },
    {
      "text": "Koedinger, K. R., Booth, J. L., Klahr, D. (2013) Instructional Complexity and the Science to Constrain It Science. 22 November 2013: Vol. 342 no. 6161 pp. 935--937",
      "doi": ""
    },
    {
      "text": "Kohavi, R., Longbotham, R., Sommerfield, D., and Henne, R. M. (2008) Controlled experiments on the web: survey and practical guide. Data Mining and Knowledge Discovery 18, 1 140--181.",
      "doi": "10.1007/s10618-008-0114-1"
    },
    {
      "text": "Kurzban, R., Duckworth, A., Kable, J. W., and Myers, J. An opportunity cost model of subjective effort and task performance. The Behavioral and brain sciences 36, 6 (2013), 661--79. ",
      "doi": ""
    },
    {
      "text": "Inoue, N. (2007). Why face a challenge? The reason behind intrinsically motivated students' spontaneous choice of challenging tasks. Learning and Individual Differences, 17(3), 251--259. ",
      "doi": ""
    },
    {
      "text": "Lomas, D., Patel, K., Forlizzi, J. L., & Koedinger, K. R. (2013) Optimizing challenge in an educational game using large-scale design experiments. ACM CHI  ",
      "doi": "10.1145/2470654.2470668"
    },
    {
      "text": "Lomas, D., Forlizzi, J., Poonwala, N., Patel, N., Shodhan, S., Patel, K., Koedinger, K., and Brunskill, E. (2016). Interface Design Optimization as a Multi-Armed Bandit Problem. ACM CHI.  ",
      "doi": "10.1145/2858036.2858425"
    },
    {
      "text": "Lomas, D. (2015) Accelerating Theory Development with Large Online Experiments: Towards an Interaction Design Science. HCIC",
      "doi": ""
    },
    {
      "text": "Lomas, J. D. (2014). Optimizing motivation and learning with large-scale game design experiments (Doctoral dissertation, Carnegie Mellon University).",
      "doi": ""
    },
    {
      "text": "Malone, T. (1981) Toward a theory of intrinsically motivating instruction. Cognitive Science 5, 4, 333--369. ",
      "doi": ""
    },
    {
      "text": "Malone, T. W., & Lepper, M. R. (1987). Making learning fun: A taxonomy of intrinsic motivations for learning. Aptitude, learning, and instruction, 3(1987), 223--253.",
      "doi": ""
    },
    {
      "text": "Murphy, J., Hofacker, C. and Mizerski, R. (2006) Primacy and recency effects on clicking behavior. Journal of Computer Mediated Communication, 11 (2). ",
      "doi": ""
    },
    {
      "text": "Norman, D. A. (2013). The design of everyday things: Revised and expanded edition. Basic books.",
      "doi": ""
    },
    {
      "text": "O'Rourke, E. and Haimovitz, K. (2014) Brain points: a growth mindset incentive structure boosts persistence in an educational game. ACM CHI.  ",
      "doi": "10.1145/2556288.2557157"
    },
    {
      "text": "Papoušek, J., & Pelánek, R. (2015) Impact of Adaptive Educational System Behaviour on Student Motivation. AIED. ",
      "doi": ""
    },
    {
      "text": "Pelánek, R., Rihák, J., & Papoušek, J. (2016). Impact of data collection on interpretation and evaluation of student models. In Proceedings of the Sixth International Conference on Learning Analytics & Knowledge (pp. 40--47). ACM.  ",
      "doi": "10.1145/2883851.2883868"
    },
    {
      "text": "Shalley, C. E., & Oldham, G. R. (1985). Effects of goal difficulty and expected external evaluation on intrinsic motivation: A laboratory study. Academy of Management Journal, 28(3), 628--640. ",
      "doi": ""
    },
    {
      "text": "Shapira, Z. (1989) Task choice and assigned goals as determinants of task motivation and performance. Org. Behavior & Human Dec. Proc. 44, 2, 141--165. ",
      "doi": ""
    },
    {
      "text": "Schell, J. (2008) The Art of Game Design. Morgan Kaufmann",
      "doi": ""
    },
    {
      "text": "Schmierbach, M., Chung, M., Wu, M., & Kim, K. (2014). No One Likes to Lose: The Effect of Game Difficulty on Competency, Flow, and Enjoyment. Journal of Media Psychology, 26(3), 105--110. ",
      "doi": ""
    },
    {
      "text": "Sweetser, P. and Wyeth, P. (2005) GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3, 3, 1--24.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Teigen, K. (1994) Yerkes-Dodson: A Law for all Seasons. Theory & Psychology 4:525--547, ",
      "doi": ""
    },
    {
      "text": "Weiner, B. An attributional theory of achievement motivation and emotion. Psychological review 92, 4 (1985), 548--73. ",
      "doi": ""
    },
    {
      "text": "Yannakakis, G. N., Denmark, S., and Hallam, J. (2007) Towards optimizing entertainment in computer games, 933--971.",
      "doi": ""
    },
    {
      "text": "Yerkes, R. M., & Dodson, J. D. (1908). The relation of strength of stimulus to rapidity of habit-formation. Journal of comparative neurology and psychology, 18(5), 459--482. ",
      "doi": ""
    }
  ]
}