{
  "doi": "10.1145/3025453.3025624",
  "title": "Digital Mechanical Metamaterials",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "977-988",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we explore how to embody mechanical computation into 3D printed objects, i.e., without electronic sensors, actuators, or controllers typically used for this purpose. A key benefit of our approach is that the resulting objects can be 3D printed in one piece and thus do not require assembly. We are building on 3D printed cell structures, also known as metamaterials. We introduce a new type of cell that propagates a digital mechanical signal using an embedded bistable spring. When triggered, the embedded spring discharges and the resulting impulse triggers one or more neighboring cells, resulting in signal propagation. We extend this basic mechanism to implement simple logic functions. We demonstrate interactive objects based on this concept, such as a combination lock. We present a custom editor that allows users to model 3D objects, route signals, simulate signal flow, and synthesize cell patterns.",
  "tags": [
    "programmable matter",
    "metamaterials",
    "fabrication"
  ],
  "authors": [
    {
      "name": "Alexandra Ion",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658655048/rel-imgonly/portrait_square_20103.jpg",
      "acmid": "99658655048",
      "orcid": "missing"
    },
    {
      "name": "Ludwig Wall",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658761910/rel-imgonly/lww11.jpg",
      "acmid": "99658761910",
      "orcid": "missing"
    },
    {
      "name": "Robert Kovacs",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658696163/rel-imgonly/robert_kovacs.jpg",
      "acmid": "99658696163",
      "orcid": "0000-0002-9427-2861"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Jeffrey K. Anderson, Larry L. Howell, Jonathan W. Wittwer, and Timothy W. McLain. 2006. Piezoresistive sensing of bistable micro mechanism state. Journal of Micromechanics and Microengineering 16.5 (2006): 943. http://dx.doi.org/10.1088/0960--1317/16/5/010",
      "doi": ""
    },
    {
      "text": "Moritz Bächer, Stelian Coros, and Bernhard Thomaszewski. 2015. LinkEdit: interactive linkage editing using symbolic kinematics ACM Transactions on Graphics 34, 4, Article 99 (July 2015), 8 pages. http://dx.doi.org/10.1145/2766985  ",
      "doi": "10.1145/2766985"
    },
    {
      "text": "Moritz Bächer, Emily Whiting, Bernd Bickel, and Olga Sorkine-Hornung. 2014. Spin-it: optimizing moment of inertia for spinnable objects. ACM Transactions on Graphics 33, 4. http://dx.doi.org/10.1145/2601097.2601157  ",
      "doi": "10.1145/2601097.2601157"
    },
    {
      "text": "Bernd Bickel, Moritz Bächer, Miguel A. Otaduy, Hyunho Richard Lee, Hanspeter Pfister, Markus Gross, and Wojciech Matusik. 2010. Design and fabrication of materials with desired deformation behavior. ACM Transactions on Graphics 29, 4, Article 63 (July 2010), 10 pages. http://dx.doi.org/10.1145/1778765.1778800  ",
      "doi": "10.1145/1778765.1778800"
    },
    {
      "text": "Marco Bucci, Luca Giancane, Raimondo Luzzi, and Alessandro Trifiletti. 2006. Three-phase dual-rail precharge logic. In International Workshop on Cryptographic Hardware and Embedded Systems, pp. 232241. Springer Berlin Heidelberg, 2006.",
      "doi": ""
    },
    {
      "text": "Jacques Calì, Dan A. Calian, Cristina Amati, Rebecca Kleinberger, Anthony Steed, Jan Kautz, and Tim Weyrich. 2012. 3D-printing of non-assembly, articulated models. ACM Transactions on Graphics 31, 6, Article 130 (November 2012), 8 pages. http://dx.doi.org/10.1145/2366145.2366149  ",
      "doi": "10.1145/2366145.2366149"
    },
    {
      "text": "Xiang 'Anthony' Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 29--39. DOI: https://doi.org/10.1145/2984511.2984512",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Juan Carlos Álvarez Elipe, and Andrés Díaz Lantada. 2012. Comparative study of auxetic geometries by means of computer-aided design and engineering. Smart Materials and Structures 21.10 (2012): 105004. ",
      "doi": ""
    },
    {
      "text": "Daniel Groeger, Elena Chong Loo, and Jürgen Steimle. 2016. HotFlex: Post-print Customization of 3D Prints Using Embedded State Change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 420432. DOI: https://doi.org/10.1145/2858036.2858191",
      "doi": "10.1145/2858036.2858191"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the annual ACM symposium on User interface software and technology (UIST '16). ACM, New York, NY, USA, 529--539. DOI: https://doi.org/10.1145/2984511.2984540",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Yuichiro Katsumoto, Satoru Tokuhisa, and Masa Inakage. 2013. Ninja track: design of electronic toy variable in shape and flexibility. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, New York, NY, USA, 17--24. http://dx.doi.org/10.1145/2460625.2460628  ",
      "doi": "10.1145/2460625.2460628"
    },
    {
      "text": "Lin Lu, Andrei Sharf, Haisen Zhao, Yuan Wei, Qingnan Fan, Xuelin Chen, Yann Savoye, Changhe Tu, Daniel Cohen-Or, and Baoquan Chen. 2014. Build-tolast: strength to weight 3D printed objects. ACM Transactions on Graphics 33, 4. http://dx.doi.org/10.1145/2601097.2601168  ",
      "doi": "10.1145/2601097.2601168"
    },
    {
      "text": "Merkle, Ralph C. 1993. Two types of mechanical reversible logic. Nanotechnology 4.2 (1993): 114. ",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3827--3834. http://dx.doi.org/10.1145/2556288.2557005  ",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Tom Mullin, S. Deschanel, Katia Bertoldi, and Mary C. Boyce. 2007. Pattern transformation triggered by deformation. Physical review letters 99, no. 8 (2007): 084301. http://dx.doi.org/10.1103/PhysRevLett.99.084301 ",
      "doi": ""
    },
    {
      "text": "Nadkarni, Neel, Chiara Daraio, and Dennis M. Kochmann. 2014. Dynamics of periodic mechanical structures containing bistable elastic elements: From elastic to solitary wave propagation. Physical Review E 90.2 (2014): 023204. ",
      "doi": ""
    },
    {
      "text": "Julian Panetta, Qingnan Zhou, Luigi Malomo, Nico Pietroni, Paolo Cignoni, and Denis Zorin. 2015. Elastic textures for additive fabrication. ACM Transactions on Graphics 34, 4. http://dx.doi.org/10.1145/2766937  ",
      "doi": "10.1145/2766937"
    },
    {
      "text": "Jayson Paulose, Anne S. Meeussen, and Vincenzo Vitelli. 2015. Selective buckling via states of self-stress in topological metamaterials. In Proceedings of the National Academy of Sciences, 112(25), 7639--7644. ",
      "doi": ""
    },
    {
      "text": "Huaishu Peng, François Guimbretière, James McCann, and Scott Hudson. 2016. A 3D Printer for Interactive Electromagnetic Devices. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 553--562. DOI: https://doi.org/10.1145/2984511.2984523",
      "doi": "10.1145/2984511.2984523"
    },
    {
      "text": "Romain Prévost, Emily Whiting, Sylvain Lefebvre, and Olga Sorkine-Hornung. 2013. Make it stand: balancing shapes for 3D fabrication. ACM Transactions on Graphics 32, 4. http://dx.doi.org/10.1145/2461912.2461957  ",
      "doi": "10.1145/2461912.2461957"
    },
    {
      "text": "Jin Qiu, Jeffrey H. Lang, and Alexander H. Slocum. 2004. A curved-beam bistable mechanism. Journal of microelectromechanical systems 13.2 (2004): 137--146. ",
      "doi": ""
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces using Actuators, Sensors and 3D Printing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 409419. DOI: https://doi.org/10.1145/2858036.2858485",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Jordan R. Raney, Neel Nadkarni, Chiara Daraio, Dennis M. Kochmann, Jennifer A. Lewis, and Katia Bertoldi. 2016. Stable propagation of mechanical signals in soft media using stored elastic energy. In Proceedings of the National Academy of Sciences (2016): 201604838.",
      "doi": ""
    },
    {
      "text": "Greg Saul, Manfred Lau, Jun Mitani, and Takeo Igarashi. 2010. SketchChair: an all-in-one chair design system for end users. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, New York, NY, USA, 73--80. DOI: http://dx.doi.org/10.1145/1935701.1935717  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 447--456. http://dx.doi.org/10.1145/2501988.2501992  ",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A series of tubes: adding interactivity to 3D prints using internal pipes. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 3--12. http://dx.doi.org/10.1145/2642918.2647374  ",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to control elasticity in 3D printing. ACM Transactions on Graphics 34, 4. http://dx.doi.org/10.1145/2766926  ",
      "doi": "10.1145/2766926"
    },
    {
      "text": "Three-state logic. https://en.wikipedia.org/wiki/Threestate_logic#Tri-state_Buffer Retrieved on September 21st , 2016",
      "doi": ""
    },
    {
      "text": "Tatyana Vasilevitsky and Amit Zoran. 2016. SteelSense: Integrating Machine Elements with Sensors by Additive Manufacturing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5731--5742. http://dx.doi.org/10.1145/2858036.2858309  ",
      "doi": "10.1145/2858036.2858309"
    },
    {
      "text": "Kiril Vidimce, Alexandre Kaspar, Ye Wang, and Wojciech Matusik. 2016. Foundry: Hierarchical Material Design for Multi-Material Fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 563--574. DOI: https://doi.org/10.1145/2984511.2984516",
      "doi": "10.1145/2984511.2984516"
    },
    {
      "text": "Voxel8. http://www.voxel8.co/ Retrieved on September 21st , 2016",
      "doi": ""
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3855--3864. http://dx.doi.org/10.1145/2556288.2557090  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 589--598. http://dx.doi.org/10.1145/2380116.2380190  ",
      "doi": "10.1145/2380116.2380190"
    }
  ]
}