{
  "doi": "10.1145/3025453.3026000",
  "title": "Understanding the Role of Human Senses in Interactive Meditation",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4960-4965",
  "year": 2017,
  "badges": [],
  "abstract": "In our fast-paced society, stress and anxiety have become increasingly common. Meditation for relaxation has received much attention. Meditation apps exploit various senses, e.g., touch, audio and vision, but the relationship between human senses and interactive meditation is not well understood. This paper empirically evaluates the effects of single and combined human senses on interactive meditation. We found that the effectiveness of human senses can be defined by their respective roles in maintaining the balance between relaxation and focus. This work is the first to attempt to understand these relationships. The findings have broad implications for the field of multi-modal interaction and interactive meditation applications.",
  "tags": [
    "relaxation",
    "\"human senses",
    "mindfulness",
    "interactive meditation",
    "focus\""
  ],
  "authors": [
    {
      "name": "Mahmoud Mohamed Hussien Ahmed",
      "institution": "Kochi University of Technology & South Valley University, Kami city, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160491",
      "orcid": "missing"
    },
    {
      "name": "Chaklam Silpasuwanchai",
      "institution": "Kochi University of Technology, Kami city, Kochi, Japan",
      "img": "/do/10.1145/contrib-87958919157/rel-imgonly/mypersonalphoto.jpg",
      "acmid": "87958919157",
      "orcid": "missing"
    },
    {
      "name": "Kavous Salehzadeh Niksirat",
      "institution": "Kochi University of Technology, Kami city, Kochi, Japan",
      "img": "/do/10.1145/contrib-99659163243/rel-imgonly/img_2795.jpg",
      "acmid": "99659163243",
      "orcid": "0000-0003-4438-3544"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kami-shi, KOCHI, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jesper J Alvarsson, Stefan Wiens, and Mats E Nilsson. 2010. Stress recovery during exposure to nature sound and environmental noise. International journal of environmental research and public health 7, 3 (2010), 1036--1046.",
      "doi": ""
    },
    {
      "text": "Susanne Blödt, Daniel Pach, Stephanie Roll, and Claudia M Witt. 2014. Effectiveness of app-based relaxation for patients with chronic low back pain (Relaxback) and chronic neck pain (Relaxneck): study protocol for two randomized pragmatic trials. Trials 15, 1 (2014), 490.",
      "doi": ""
    },
    {
      "text": "Philip C Boswell and Edward J Murray. 1979. Effects of meditation on psychological and physiological measures of anxiety. Journal of Consulting and Clinical Psychology 47, 3 (1979), 606--607.",
      "doi": ""
    },
    {
      "text": "Gemma A Calvert. 2001. Crossmodal processing in the human brain: insights from functional neuroimaging studies. Cerebral cortex 11, 12 (2001), 1110--1123.",
      "doi": ""
    },
    {
      "text": "Peng Cheng, Andrés Lucero, and Jacob Buur. 2016. PAUSE: Exploring Mindful Touch Interaction on Smartphones. In Proceedings of the 20th International Academic Mindtrek Conference (AcademicMindtrek '16). ACM, New York, NY, USA, 184--191.  ",
      "doi": "10.1145/2994310.2994342"
    },
    {
      "text": "Binod Chowdhary. 2016. Effect of Tratak Candle Flame Meditation on Concentration and Memory Level of the College Athletics Team. PARIPEX-Indian Journal of Research 4, 7 (2016).",
      "doi": ""
    },
    {
      "text": "Katie Derthick. 2014. Understanding Meditation and Technology Use. In Proc. CHI 2014. ACM, 2275--2280.  ",
      "doi": "10.1145/2559206.2581368"
    },
    {
      "text": "Scale Description. 1994. Intrinsic Motivation Inventory (IMI). (1994).",
      "doi": ""
    },
    {
      "text": "Alexander B Fennell, Erik M Benau, and Ruth Ann Atchley. 2016. A single session of meditation reduces of physiological indices of anger in both experienced and novice meditators. Consciousness and cognition 40 (2016), 54--66.",
      "doi": ""
    },
    {
      "text": "Jerrold S Greenberg. 2011. Comprehensive stress management. McGraw-Hill Higher Education,. ",
      "doi": "10.5555/1200343"
    },
    {
      "text": "Bhante Gunaratana and Henepola Gunaratana. 2011. Mindfulness in plain English. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "CE Guzzetta. 1989. Effects of relaxation and music therapy on patients in a coronary care unit with presumptive acute myocardial infarction. Heart and lung:the journal of critical care 18, 6 (November 1989). http://europepmc.org/abstract/MED/2684920",
      "doi": ""
    },
    {
      "text": "Kelsang Gyatso. 2009. The new meditation handbook: meditations to make our life happy and meaningful. Tharpa Publications US.",
      "doi": ""
    },
    {
      "text": "MD Herbert Benson and Miriam Z Klipper. 1992. The relaxation response. Harper Collins, New York.",
      "doi": ""
    },
    {
      "text": "Nis Hjortskov, Dag Rissén, Anne Katrine Blangsted, Nils Fallentin, Ulf Lundberg, and Karen Søgaard. 2004. The effect of mental stress on heart rate variability and blood pressure during computer work. European journal of applied physiology 92, 1--2 (2004), 84--89.",
      "doi": ""
    },
    {
      "text": "Jon Kabat-Zinn. 2009. Wherever you go, there you are: Mindfulness meditation in everyday life. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Stephen Kaplan. 1995. The restorative benefits of nature: Toward an integrative framework. Journal of environmental psychology 15, 3 (1995), 169--182.",
      "doi": "10.1016/0272-"
    },
    {
      "text": "JOJWGSJ Kubanek, KJ Miller, JG Ojemann, JR Wolpaw, and G Schalk. 2009. Decoding flexion of individual fingers using electrocorticographic signals in humans. Journal of neural engineering 6, 6 (2009), 066001.",
      "doi": ""
    },
    {
      "text": "James Laurie and Ann Blandford. 2016. Making time for mindfulness. International Journal of Medical Informatics (2016).",
      "doi": ""
    },
    {
      "text": "Banu Manav. 2007. Color-emotion associations and color preferences: A case study for residences. Color Research & Application 32, 2 (2007), 144--150.",
      "doi": ""
    },
    {
      "text": "B Monteiro, A Galhardo, M Cunha, M Couto, F Fonseca, and L Carvalho. 2016. MindfulSpot: A mindfulness mobile app for people dealing with infertility. European Psychiatry 33 (2016), 609--610.",
      "doi": ""
    },
    {
      "text": "Ivan Nyklíček and Karlijn F Kuijpers. 2008. Effects of mindfulness-based stress reduction intervention on psychological well-being and quality of life: is increased mindfulness indeed the mechanism? Annals of Behavioral Medicine 35, 3 (2008), 331--340.",
      "doi": ""
    },
    {
      "text": "Doug Oman, Shauna L Shapiro, Carl E Thoresen, Thomas G Plante, and Tim Flinders. 2008. Meditation lowers stress and supports forgiveness among college students: A randomized controlled trial. Journal of American College Health 56, 5 (2008), 569--578.",
      "doi": ""
    },
    {
      "text": "Maria B Ospina, Kenneth Bond, Mohammad Karkhaneh, Lisa Tjosvold, Ben Vandermeer, Yuanyuan Liang, Liza Bialy, Nicola Hooton, Nina Buscemi, Donna M Dryden, and others. 2007. Meditation practices for health: state of the research. Evid Rep Technol Assess (Full Rep) 155, 155 (2007), 1--263.",
      "doi": ""
    },
    {
      "text": "Andrew Young Paek, Harshavardhan Agashe, and Jose Luis Contreras-Vidal. 2014. Decoding repetitive finger movements with brain activity acquired via non-invasive electroencephalography. Frontiers in neuroengineering 7, 3 (2014).",
      "doi": ""
    },
    {
      "text": "C-K Peng, Isaac C Henry, Joseph E Mietus, Jeffrey M Hausdorff, Gurucharan Khalsa, Herbert Benson, and Ary L Goldberger. 2004. Heart rate dynamics during three forms of meditation. International journal of cardiology 95, 1 (2004), 19--27.",
      "doi": ""
    },
    {
      "text": "Linda Gay Peterson and Lori Pbert. 1992. Effectiveness of a meditation-based stress reduction program in the treatment of anxiety disorders. Am J Psychiatry 149 (1992), 936--943. Issue 7.",
      "doi": ""
    },
    {
      "text": "Matthieu Ricard. 2010. The art of meditation. Atlantic Books Ltd.",
      "doi": ""
    },
    {
      "text": "Kavous Salehzadeh Niksirat, Chaklam Silpasuwanchai, Mahmoud Mohamed Hussien Ahmed, Peng Cheng, and Xiangshi Ren. 2017. A Framework for Interactive Mindfulness Meditation Using Attention-Regulation Process. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, In Press.  ",
      "doi": "10.1145/3025453.3025914"
    },
    {
      "text": "Wolfgang Schmid and Thomas Ostermann. 2010. Home-based music therapy - a systematic overview of settings and conditions for an innovative service in healthcare. BMC Health Services Research 10, 1 (2010), 291--301.",
      "doi": ""
    },
    {
      "text": "Marc B Schure, John Christopher, and Suzanne Christopher. 2008. Mind-body medicine and the art of self-care: Teaching mindfulness to counseling students through yoga, meditation, and qigong. Journal of Counseling and Development: JCD 86, 1 (2008), 47--56.",
      "doi": ""
    },
    {
      "text": "Elizabeth Scott. 2015. Ideas For Objects of Focused Meditation. (October 2015). https: //www.verywell.com/focused-meditation-ideas-3144770",
      "doi": ""
    },
    {
      "text": "Jaime Snyder, Mark Matthews, Jacqueline Chien, Pamara F. Chang, Emily Sun, Saeed Abdullah, and Geri Gay. 2015. MoodLight: Exploring Personal and Social Implications of Ambient Display of Biosensor Data. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work Social Computing (CSCW '15). ACM, New York, NY, USA, 143--153.  ",
      "doi": "10.1145/2675133.2675191"
    },
    {
      "text": "Stress Statistics. 2015. Statistic Brain Research Institute, American Institute of Stress, NY. (19 July 2015). http://www.statisticbrain.com/stress-statistics/",
      "doi": ""
    },
    {
      "text": "Anna M Tacón, Jacalyn McComb, Yvonne Caldera, and Patrick Randolph. 2003. Mindfulness meditation, anxiety reduction, and heart disease: a pilot study. Family & community health 26, 1 (2003), 25--33.",
      "doi": ""
    },
    {
      "text": "Yi-Yuan Tang, Britta K Hölzel, and Michael I Posner. 2015. The neuroscience of mindfulness meditation. Nature Reviews Neuroscience 16, 4 (2015), 213--225.",
      "doi": ""
    },
    {
      "text": "Julian F Thayer, Fredrik Åhs, Mats Fredrikson, John J Sollers, and Tor D Wager. 2012. A meta-analysis of heart rate variability and neuroimaging studies: implications for heart rate variability as a marker of stress and health. Neuroscience & Biobehavioral Reviews 36, 2 (2012), 747--756.",
      "doi": ""
    },
    {
      "text": "Ralph Vacca. 2016. Designing for Interactive Loving and Kindness Meditation on Mobile. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1772--1778.  ",
      "doi": "10.1145/2851581.2892396"
    },
    {
      "text": "Elizabeth R Valentine and Philip LG Sweet. 1999. Meditation and attention: A comparison of the effects of concentrative and mindfulness meditation on sustained attention. Mental Health, Religion & Culture 2, 1 (1999), 59--70.",
      "doi": ""
    },
    {
      "text": "Deltcho Valtchanov, Kevin R Barton, and Colin Ellard. 2010. Restorative effects of virtual nature settings. Cyberpsychology, Behavior, and Social Networking 13, 5 (2010), 503--512.",
      "doi": ""
    },
    {
      "text": "Tanja GM Vrijkotte, Lorenz JP Van Doornen, and Eco JC De Geus. 2000. Effects of work stress on ambulatory blood pressure, heart rate, and heart rate variability. Hypertension 35, 4 (2000), 880--886.",
      "doi": ""
    },
    {
      "text": "Roger Walsh and Shauna L Shapiro. 2006. The meeting of meditative disciplines and Western psychology: a mutually enriching dialogue. American psychologist 61, 3 (2006), 227--239.",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Alex Gamburg, and Neema Moraveji. 2012. You Can'T Force Calm: Designing and Evaluating Respiratory Regulating Interfaces for Calming Technology. In Adjunct Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST Adjunct Proceedings '12). ACM, New York, NY, USA, 69--70.  ",
      "doi": "10.1145/2380296.2380326"
    },
    {
      "text": "Shao-Wei Xue, Yi-Yuan Tang, Rongxiang Tang, and Michael I Posner. 2014. Short-term meditation induces changes in brain resting EEG theta networks. Brain and cognition 87 (2014), 1--6.",
      "doi": ""
    }
  ]
}