{
  "doi": "10.1145/3025453.3025530",
  "title": "Seeing, Sensing and Recognizing Laban Movement Qualities",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4009-4020",
  "year": 2017,
  "badges": [],
  "abstract": "Human movement has historically been approached as a functional component of interaction within human computer interaction. Yet movement is not only functional, it is also highly expressive. In our research, we explore how movement expertise as articulated in Laban Movement Analysis (LMA) can contribute to the design of computational models of movement's expressive qualities as defined in the framework of Laban Efforts. We include experts in LMA in our design process, in order to select a set of suitable multimodal sensors as well as to compute features that closely correlate to the definitions of Efforts in LMA. Evaluation of our model shows that multimodal data combining positional, dynamic and physiological information allows for a better characterization of Laban Efforts. We conclude with implications for design that illustrate how our methodology and our approach to multimodal capture and recognition of Effort qualities can be integrated to design interactive applications.",
  "tags": [
    "laban movement analysis",
    "multimodal measures",
    "movement recognition",
    "movement observation",
    "movement-based interaction",
    "movement qualities"
  ],
  "authors": [
    {
      "name": "Sarah Fdili Alaoui",
      "institution": "Universit Paris-Saclay, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656800",
      "orcid": "0000-0003-1775-213X"
    },
    {
      "name": "Jules Françoise",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81556248156/rel-imgonly/81556248156.jpg",
      "acmid": "81556248156",
      "orcid": "missing"
    },
    {
      "name": "Thecla Schiphorst",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409594757",
      "orcid": "missing"
    },
    {
      "name": "Karen Studd",
      "institution": "Laban Institute of Movement Studies, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658727364",
      "orcid": "missing"
    },
    {
      "name": "Frederic Bevilacqua",
      "institution": "IRCAM, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100077889",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Irmgard Bartenieff. 1970. Four Adaptations of Effort Theory in Research and Teaching. Gordon and Breach Science, NY, USA.",
      "doi": ""
    },
    {
      "text": "Frédéric Bevilacqua, Bruno Zamborlin, Antony Sypniewski, Norbert Schnell, Fabrice Guédy, and Nicolas Rasamimanana. 2010. Continuous realtime gesture following and recognition. In Embodied Communication and Human-Computer Interaction, volume 5934 of Lecture Notes in Computer Science. Springer, 73--84.  ",
      "doi": "10.1007/978-3-642-12553-9_7"
    },
    {
      "text": "andreas Scharader Borge Kordts, Bashar Altakrouri. 2015. Capturing and Analysing Movement Using Depth Sensors and Labanotation. In ACM SIGGRAPH Symposium on Engineering Interactive Computing Systems.",
      "doi": ""
    },
    {
      "text": "Durell Bouchard and Norman Badler. 2007. Semantic segmentation of motion capture using laban movement analysis. In Intelligent Virtual Agents. Springer, 37--44.  ",
      "doi": "10.1007/978-3-540-74997-4_4"
    },
    {
      "text": "Mary C. Broughton and Catherine J. Stevens. 2012. Analyzing Expressive Qualities in Movement and Stillness: Effort-Shape Analyses of Solo Marimbists' Bodily Expression. (2012).",
      "doi": ""
    },
    {
      "text": "Antonnio Camurri, Barbara Mazzarino, Matteo Ricchetti, Renee Timmers, and Gualtierro Volpe. 2004. Multimodal analysis of expressive gesture in music and dance performances. In Gesture-based communication in human-computer interaction volume 2915 of Lecture Notes in Artificial Intelligence. Springer, 357--358. ",
      "doi": ""
    },
    {
      "text": "Diane Chi, Monica Costa, Liwei Zhao, and Norman Badler. 2000. The EMOTE model for effort and shape. In In Proceedings of ACM SIGGRAPH. ACM, 173--182.  ",
      "doi": "10.1145/344779.352172"
    },
    {
      "text": "Martha Davis. 1987. Steps to achieving observer agreement: the LIMS reliability project. Movement Studies (NY: Laban / Bartenieff Institute) 2 (1987), 7--19.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. The MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Daniel Fallman. 2011. The new good: exploring the potential of philosophy of technology to contribute to human-computer interaction. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems (CHI'11). ACM, 1051--1060.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Sarah Fdili Alaoui, Frederic Bevilacqua, Bertha Bermudez, and Christian Jacquemin. 2013. Dance Interaction with physical model visualization based on movement qualities. International Journal of Arts and Technology, IJART (2013), 0--12.",
      "doi": ""
    },
    {
      "text": "Sarah Fdili Alaoui, Baptiste Caramiaux, Marcos Serrano, and Frédéric Bevilacqua. 2012. Movement qualities as interaction modality. In Proceedings of the ACM SIGCHI Conference on Designing Interactive Systems (DIS'12). ACM Press, Newcastle, UK, 761--769.  ",
      "doi": "10.1145/2317956.2318071"
    },
    {
      "text": "Sarah Fdili Alaoui, Kristin Carlson, Shannon Cuykendall, , Karen Studd, Karen Bradley, and Thecla Schiphorst. 2015a. How Do Experts Observe Movement. In Proceedings of the International Workshop on Movement and Computing. Vancouver, BC, Canada.  ",
      "doi": "10.1145/2790994.2791000"
    },
    {
      "text": "Sarah Fdili Alaoui, Thecla Schiphorst, Shannon Cuykendall, Kristin Carlson, Karen Studd, and Karen Bradley. 2015b. Strategies for Embodied Design: The Value and Challenges of Observing Movement. In Proceedings of ACM Creativity and Cognition (CC '15). ACM, Glasgow, Scotland, UK, 121--130.",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Baptiste Caramiaux, and Frédéric Bevilacqua. 2012. A Hierarchical Approach for the Design of Gesture-to-Sound Mappings. In Proceedings of SMC conference. 233--240.",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Sarah Fdili Alaoui, Thecla Schiphorst, and Frédéric Bevilacqua. 2014. Vocalizing Dance Movement for Interactive Sonification of Laban Effort Factors. In Proceedings of the ACM SIGCHI Conference on Designing Interactive Systems (DIS '14). ACM, Vancouver, Canada, 1079--1082.  ",
      "doi": "10.1145/2598510.2598582"
    },
    {
      "text": "Marco Gillies, Rebecca Fiebrink, Atau Tanaka, Jérémie Garcia, Frederic Bevilacqua, Alexis Heloir, Fabrizio Nunnari, Wendy Mackay, Saleema Amershi, Bongshin Lee, Nicolas d'Alessandro, Joëlle Tilmanne, Todd Kulesza, and Baptiste Caramiaux. 2016. Human-Centred Machine Learning. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI'16). ACM, 3558--3565.  ",
      "doi": "10.1145/2851581.2856492"
    },
    {
      "text": "Kristina Höök, Martin P Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, San Jose, CA, USA, 3131--3142.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Caroline Hummels, Kees C. J. Overbeeke, and Sietske Klooster. 2007. Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction. Personal and Ubiquitous Computing 11, 8 (oct 2007), 677--690.  ",
      "doi": "10.1007/s00779-006-0135-y"
    },
    {
      "text": "David Kirsh. 2013. Embodied cognition and the magical future of interaction design. ACM Transaction on Computer Human Interaction 20, 1 (2013), 1--30.  ",
      "doi": "10.1145/2442106.2442109"
    },
    {
      "text": "Rudolf Laban and F. C Lawrence. 1974. Effort Economy of Human Movement. Princeton Book.",
      "doi": ""
    },
    {
      "text": "Rudolf Laban and Lisa Ullmann. 1963. Modern educational dance. MacDonald and Evans.",
      "doi": ""
    },
    {
      "text": "Amy LaViers and Magnus Egerstedt. 2012. Style based robotic motion. American Control Conference (ACC) (2012).",
      "doi": ""
    },
    {
      "text": "Wonjun Lee and Richard Shusterman. 2014. Practicing Somaesthetics : Exploring Its Impact on Interactive Product Design Ideation. In Proceedings of the ACM SIGCHI Conference on Designing Interactive Systems (DIS '14). ACM, Vancouver, Canada, 1055--1064.  ",
      "doi": "10.1145/2598510.2598561"
    },
    {
      "text": "JA Levy and MP Duke. 2003. Laban Movement Analysis in the study of personality, emotional state and movement style: An exploratory investigation of the veridicality of body language. Individual Differences Research 1, 1 (2003), 39.",
      "doi": ""
    },
    {
      "text": "Lian Loke and George Poonkhin Khut. 2011. Surging Verticality : An Experience of Balance. In Proceedings of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI'11). ACM, 237--240.",
      "doi": "10.1145/1935701.1935747"
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange: An embodied approach to movement-based interaction design. Transaction on Computer Human Interaction 20, 1 (2013).",
      "doi": ""
    },
    {
      "text": "Tino Lourens, Roos van Berkel, and Emilia Barakova. 2010. Communicating emotions and mental states to robots in a real time parallel framework using Laban movement analysis. Robotics and Autonomous Systems 58, 12 (2010), 1256--1265.  ",
      "doi": "10.1016/j.robot.2010.08.006"
    },
    {
      "text": "Diego Silang Maranan, Sarah Fdili Alaoui, Thecla Schiphorst, Philippe Pasquier, and Lyn Bartram. 2014. Designing For Movement : Evaluating Computational Models using LMA Effort Qualities. In Proceedings of the 2014 CHI Conference on Human Factors in Computing Systems (CHI'14). ACM, Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami, and Annika Waern. 2016. Embodied Sketching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, San Jose, CA, USA, 6014--6027.  ",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "M. Masuda, S. Kato, and H. Itoh. 2009. Emotion detection from body motion of human form robot based on laban movement analysis. Springer. 322--334 pages.  ",
      "doi": "10.1007/978-3-642-11161-7_22"
    },
    {
      "text": "Helena Mentis and Carolina Johansson. 2013. Seeing Movement Qualities. In Proceedings of the 2013 CHI Conference on Human Factors in Computing Systems (CHI'13). ACM, Paris, France, 3375--3384.  ",
      "doi": "10.1145/2470654.2466462"
    },
    {
      "text": "M Merleau-Ponty. 1945. Phenomenology of Perception. Editions Gallimard.",
      "doi": ""
    },
    {
      "text": "Jin Moen. 2007. From hand-held to body-worn: embodied experiences of the design and use of a wearable movement-based interaction concept. In Proceedings of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI'07). ACM, 251--258.",
      "doi": "10.1145/1226969.1227021"
    },
    {
      "text": "Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic Interaction: A Pragmatist's Aesthetics of Interactive Systems. In Proceedings of the ACM SIGCHI Conference on Designing Interactive Systems (DIS '04). ACM, Cambridge, MA, USA, 269--276.  ",
      "doi": "10.1145/1013115.1013153"
    },
    {
      "text": "Mary Pietrowicz, Guy Garnett, Robert McGrath, and John Toenjes. 2010. Multimodal Gestural Interaction in Performance. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, 1--8.",
      "doi": ""
    },
    {
      "text": "Nicolas Rasamimanana, Frédéric Bevilacqua, Norbert Schnell, Emmanuel Fléty, and Bruno Zamborlin. 2011. Modular Musical Objects Towards Embodied Control Of Digital Music Real Time Musical Interactions. In Proceedings of the International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, 9--12.",
      "doi": "10.1145/1935701.1935704"
    },
    {
      "text": "TD Sanger. 2007. Bayesian filtering of myoelectric signals. Journal of neurophysiology (2007), 1839--1845.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst. 2011. Self-evidence: Applying Somatic Connoisseurship to Experience Design. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, Vancouver, BC, Canada, 145--160.  ",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Norbert Schnell, Axel Röbel, Diemo Schwarz, Geoffroy Peeters, and Riccardo Borghesi. 2009. Mubu & friends assembling tools for content based real-time interactive audio processing in max/msp. In Proceedings of International Computer Music Conference. Montreal.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2012. Thinking through the body: Essays in somaesthetics. Cambridge University Press. ",
      "doi": ""
    },
    {
      "text": "Karen A Studd and Laura L Cox. 2013. Everybody is a body. Dog Ear Publishing.",
      "doi": ""
    },
    {
      "text": "Gualtierro Volpe. 2003. Computational models of expressive gesture in Computational models of expressive gesture in multimedia systems. Ph.D. Dissertation. InfoMus Lab, Genova.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Thecla Schiphorst, and Sietske Klooster. 2011. Move to Design/Design to Move: A Conversation About Designing for the Body. interactions 18, 4 (jul 2011), 22--27.",
      "doi": "10.1145/1978822.1978828"
    },
    {
      "text": "Margaret Wilson. 2009. Dance pedagogy case studies: A grounded theory approach to analyzing qualitative data. Research in Dance Education 10, 1 (2009), 3--16. ",
      "doi": ""
    },
    {
      "text": "Liwei Zhao and Norman Badler. 2005. Acquiring and validating motion qualities from live limb gestures. Graphical Models journal 67, 1 (2005), 1--16.",
      "doi": "10.1016/j.gmod.2004.08.002"
    }
  ]
}