{
  "doi": "10.1145/3025453.3025679",
  "title": "Group Spinner: Recognizing and Visualizing Learning in the Classroom for Reflection, Communication, and Planning",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5556-5567",
  "year": 2017,
  "badges": [],
  "abstract": "Group Spinner is a digital visual tool intended to help teachers observe and reflect on children's collaborative technology-enhanced learning activities in the classroom. We describe the design of Group Spinner, which was informed by activity theory, previous work and teachers' focus group feedback. Based on a radar chart and a set of indicators, Group Spinner allows teachers to record in-class observations as to different aspects of group learning and learning behaviors, beyond the limited knowledge acquisition measures. Our exploratory study involved 6 teachers who used the tool for a total of 23 classes in subjects ranging from Maths and Geography to Sociology and Art. Semi-structured interviews with these teachers revealed a number of different uses of the tool. Depending on their experience and pedagogy, teachers considered Group Spinner to be a valuable tool to support awareness, reflection, communication, and/or planning.",
  "authors": [
    {
      "name": "Ahmed Kharrufa",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479662079",
      "orcid": "missing"
    },
    {
      "name": "Sally Rix",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163415",
      "orcid": "missing"
    },
    {
      "name": "Timur Osadchiy",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161317",
      "orcid": "missing"
    },
    {
      "name": "Anne Preston",
      "institution": "Kingston University, Kingston upon Thames, Greater London, United Kingdom",
      "img": "/do/10.1145/contrib-99659246404/rel-imgonly/s200_anne.preston.jpg",
      "acmid": "99659246404",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004670",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L. W. Anderson and D. Krathwohl. 2001. A Taxonomy for Learning, Teaching and Assessing: a Revision of Bloom's Taxonomy of Educational Objectives. Longman, New York.",
      "doi": ""
    },
    {
      "text": "Sasha Barab, Steve Schatz, and Rebecca Scheckler. 2004. Using Activity Theory to Conceptualize Online Community and Using Online Community to Conceptualize Activity Theory. Mind, Culture, and Activity 11, 1: 25--47.",
      "doi": ""
    },
    {
      "text": "John B. Biggs and K. F. Collis. 2014. Evaluating the quality of learning: the SOLO taxonomy (Structure of the Observed Learning Outcome). Academic Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "John B. Biggs and Catherine Tang. 2011. Teaching For Quality Learning At University.",
      "doi": ""
    },
    {
      "text": "B. S. Bloom and D. R. Krathwohl. 1956. Taxonomy of Educational Objectives: The classification of educational goals. Handbook I: Cognitive Domain. Longmans, New York.",
      "doi": ""
    },
    {
      "text": "S. K. Card, J. D. Mackinlay, and B. Shneiderman. 1999. Readings in information visualization: using vision to think. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Andrew. Churches. 2009. Bloom's digital taxonomy. Educational origami.",
      "doi": ""
    },
    {
      "text": "C. Crook. 1996. Computers and the collaborative experience of learning. Psychology Press. ",
      "doi": "10.5555/193913"
    },
    {
      "text": "Pierre Dillenbourg and Patrick Jermann. 2010. Technology for Classroom Orchestration. In New Science of Learning. Springer New York, New York, NY, 525--552.",
      "doi": ""
    },
    {
      "text": "Matthew R. Dintzner, Eric C. Nemec, Kim Tanzer, and Beth Welch. 2015. Using Radar Plots for Curricular Mapping to Visualize Assessment in a New Doctor of Pharmacy Program. American journal of pharmaceutical education 79, 8: 121.",
      "doi": ""
    },
    {
      "text": "Yrjö Engeström. 2014. Learning by Expanding. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Yrjö Engestrom. 2001. Expansive Learning at Work: toward an activity theoretical reconceptualization. Journal of Education and Work 14, 1: 133--156.",
      "doi": ""
    },
    {
      "text": "Cresencia Fong. 2009. Guidance and Career Education Course rubric.",
      "doi": ""
    },
    {
      "text": "Dianne P. Ford and Sandy Staples. 2010. Are full and partial knowledge sharing the same? Journal of Knowledge Management 14, 394--409.",
      "doi": ""
    },
    {
      "text": "Leonardo Giusti, Massimo Zancanaro, Eynat Gal, and Patrice L. (Tamar) Weiss. 2011. Dimensions of collaboration on a tabletop interface for children with autism spectrum disorder. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, 3295.  ",
      "doi": "10.1145/1978942.1979431"
    },
    {
      "text": "T. Good and J. Brophy. 2003. Looking in Classrooms. Boston: Allyn & Bacon.",
      "doi": ""
    },
    {
      "text": "Jiangyue Gu and Brian R. Belland. 2015. Preparing Students with 21st Century Skills: Integrating Scientific Knowledge, Skills, and Epistemic Beliefs in Middle School Science Curricula. In Emerging Technologies for STEAM Education. Springer International Publishing, Cham, 39--60.",
      "doi": ""
    },
    {
      "text": "Marie J. Guilloteaux, Zoltán Dörnyei, and Zoltàn Dôrnyei. 2008. Motivating Language Learners: A Classroom-Oriented Investigation of the Effects of Motivational Strategies on Student Motivation. Source: TESOL Quarterly 42, 1: 55--77.",
      "doi": ""
    },
    {
      "text": "P. Heslop, A. Preston, A. Kharrufa, M. Balaam, D. Leat, and P. Olivier. 2015. Evaluating digital tabletop collaborative writing in the classroom.",
      "doi": ""
    },
    {
      "text": "Wendy Holliday and Qin Li. 2004. Understanding the millennials: updating our knowledge about students. Reference Services Review 32, 4: 356-- 366.",
      "doi": ""
    },
    {
      "text": "Desmond Hunter. 2006. Assessing collaborative learning. British Journal of Music Education 23, 1: 75.",
      "doi": ""
    },
    {
      "text": "T. Ikuta and Y. Gotoh. 2014. Development of Visualization of Learning Outcomes Using Curriculum Mapping. Takashi Ikuta and Yasushi Gotoh. In Digital Systems for Open Access to Formal and Informal Learning, D. G. Sampson et al (ed.). Springer International Publishing, 69--82.",
      "doi": ""
    },
    {
      "text": "K. Isssroff and E. Scanlon. 2002. Using technology in Higher Education: an Activity Theory perspective. Journal of Computer Assisted Learning 18, 1: 77--83.",
      "doi": ""
    },
    {
      "text": "Ahmed Kharrufa, Madeline Balaam, Phil Heslop, David Leat, Paul Dolan, and Patrick Olivier. 2013. Tables in the Wild: Lessons Learned from a LargeScale Multi-Tabletop Deployment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 1021.  ",
      "doi": "10.1145/2470654.2466130"
    },
    {
      "text": "Ahmed Kharrufa, Roberto Martinez-Maldonado, Judy Kay, and Patrick Olivier. 2013. Extending tabletop application design to the classroom. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces ITS '13, 115--124.  ",
      "doi": "10.1145/2512349.2512816"
    },
    {
      "text": "Ahmed N. S. Kharrufa, Patrick Olivier, and David Leat. 2010. Learning Through Reflection at the Tabletop: A Case Study with Digital Mysteries. In EdMedia: World Conference on Educational Media and Technology, 665--674.",
      "doi": ""
    },
    {
      "text": "D. R. Krathwohl, B. S. Bloom, and B. B. Masia. 1964. Taxonomy of Educational Objectives: The classification of educational goals. Handbook II: Affective Domain. David McKay Company, New York.",
      "doi": ""
    },
    {
      "text": "Stefan Kreitmayer, Yvonne Rogers, Robin Laney, and Stephen Peake. 2013. UniPad: orchestrating collaborative activities through shared tablets and an integrated wall display. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13, 801.  ",
      "doi": "10.1145/2493432.2493506"
    },
    {
      "text": "Carol C. Kuhlthau, Jannica Heinström, and Ross J. Todd. 2008. The \"information search process\" revisited: is the model still useful? Information Research 13: 45--45. https://doi.org/Article",
      "doi": ""
    },
    {
      "text": "Cher Ping Lim, Yong Zhao, Jo Tondeur, Ching Sing Chai, and Chin-Chung Tsai. 2013. Bridging the gap: technology trends and use of technology in schools. Educational Technology & Society 16, 2: 59--69.",
      "doi": ""
    },
    {
      "text": "Louise Limberg. 1999. Three Conceptions of Information Seeking and Use. Proceedings of the Second international conference on research in Information Needs, seeking and use in different contexts, September 1999: 1--16.",
      "doi": ""
    },
    {
      "text": "Louise Limberg. 1999. Experiencing information seeking and learning: A study of the interaction between two phenomena. Information Research 5, 50--67.",
      "doi": ""
    },
    {
      "text": "D. L. Lowther, F. A. Inan, and J. Daniel Strahl. 2008. Does technology integration \"work\" when key barriers are removed? Educational Media International 45, 3: 195--213.",
      "doi": ""
    },
    {
      "text": "Roberto Martinez Maldonado, Yannis Dimitriadis, Judy Kay, Kalina Yacef, and Marie-Theresa Edbauer. 2012. Orchestrating a multi-tabletop classroom: from activity design to enactment and reflection. In Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces - ITS '12, 119.  ",
      "doi": "10.1145/2396636.2396655"
    },
    {
      "text": "A. McFarlane. 2001. Perspectives on the relationships between ICT and assessment. Journal of Computer Assisted Learning 17, 3: 227--234.",
      "doi": ""
    },
    {
      "text": "Sugata Mitra. 2014. SOLE Toolkit. Newcastle University.",
      "doi": ""
    },
    {
      "text": "Sugata Mitra. 2014. The future of schooling: Children and learning at the edge of chaos. Prospects 44, 4: 547--558.",
      "doi": ""
    },
    {
      "text": "B. A. Nardi. 1996. Context and consciousness: activity theory and human-computer interaction. MIT Press. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Takatsune Narumi and Yasushi Gotoh. 2014. Students' Reflections Using Visualized Learning Outcomes and E-Portfolios. International Association for Development of the Information Society.",
      "doi": ""
    },
    {
      "text": "Karen Renaud and Judy Van Biljon. 2016. The role of knowledge visualisation in supporting postgraduate dissertation assessment. British Journal of Educational Technology.",
      "doi": ""
    },
    {
      "text": "S. Rix and S. McElwee. 2016. What happens if students are asked to learn Geography content, specifically Population, through SOLE? Other Education: The Journal of Educational Alternatives 5, 1: 30--54.",
      "doi": ""
    },
    {
      "text": "W.-M. Roth and Y.-J. Lee. 2007. \"Vygotsky's Neglected Legacy\": Cultural-Historical Activity Theory. Review of Educational Research 77, 2: 186--232.",
      "doi": ""
    },
    {
      "text": "Wolff-Michael Roth. 2004. Introduction: \"Activity Theory and Education: An Introduction.\" Mind, Culture, and Activity 11, 1: 1--8.",
      "doi": ""
    },
    {
      "text": "Louise Starkey. 2011. Evaluating learning in the 21st century: a digital age learning matrix. Technology, Pedagogy and Education 20, 1: 19--39.",
      "doi": ""
    },
    {
      "text": "Harvey S. Wiener. 1986. Collaborative Learning in the Classroom: A Guide to Evaluation. College English 48, 1: 52.",
      "doi": ""
    }
  ]
}