{
  "doi": "10.1145/3025453.3025810",
  "title": "Time Travel with One Click: Effects of Digital Filters on Perceptions of Photographs",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6000-6011",
  "year": 2017,
  "badges": [],
  "abstract": "Today's digital photographs are being heavily \"filtered.\" By simple clicks on mobile apps like Hipstamatic and Instagram, users can easily apply digital filters to their pictures to create effects such as faux-vintage and light leaks. To understand the potential impacts of photo filters, we conducted an online experiment and investigated how the use of the black-and-white and film-style photo filters changed viewers' perceptions and descriptions of photographs. We found that photo filters substantially increased viewers' perceived temporal distances to photographs. Participants also tended to describe analogue-style photos more interpretively and tentatively than unfiltered ones, indicating an increase in construal levels. We suggest that the widely used photo filter is not just a tool to change aesthetics; it also adds a layer of history, meaning, and defamiliarization to photographs, allowing users to construct a mental distance in images that deviates from everyday experiences. We offer insights into the psychology of visual styles and implications for designing filter apps and photo-sharing platforms.",
  "tags": [
    "mobile app",
    "digital filter",
    "construal level theory",
    "visual style",
    "computational text analysis"
  ],
  "authors": [
    {
      "name": "Yilang Peng",
      "institution": "University of Pennsylvania, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160160",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahn, S. J. 2015. Incorporating immersive virtual environments in health promotion campaigns: A construal level theory approach. Health Communication 30, 6: 545--556.",
      "doi": ""
    },
    {
      "text": "Alper, M. 2014. War on Instagram: Framing conflict photojournalism with mobile photography apps. New Media & Society 16, 8: 1233--1248.",
      "doi": ""
    },
    {
      "text": "Alter, A. L. and Oppenheimer, D. M. 2008. Effects of fluency on psychological distance and mental construal (or why NY is a large city, but NY is a civilized jungle). Psychological Science 19, 2: 161--167.",
      "doi": ""
    },
    {
      "text": "Amit, E., Algom, D., and Trope, Y. 2009. Distance-dependent processing of pictures and words. Journal of Experimental Psychology: General 138, 3: 400--415.",
      "doi": ""
    },
    {
      "text": "BabyCenter. 2015. Hottest baby name trends of 2015. Online article. (December 2015). Retrieved May 2, 2016 from: http://www.babycenter.com/0_hottest-baby-name-trends-of-2015_10408983.bc",
      "doi": ""
    },
    {
      "text": "Bakhshi, S., Shamma, D. A., Kennedy, L., and Gilbert, E. 2015. Why we filter our photos and how it impacts engagement. In Proceedings of the International AAAI Conference on Web and Social Media (ICWSM '15), 12--21.",
      "doi": ""
    },
    {
      "text": "Bar-Anan, Y., Liberman, N., and Trope, Y. 2006. The association between psychological distance and construal level: Evidence from an implicit association test. Journal of Experimental Psychology: General 135, 4: 609--622.",
      "doi": ""
    },
    {
      "text": "Beukeboom, C. J., Tanis, M., and Vermeulen, I. E. 2013. The language of extraversion: Extraverted people talk more abstractly, introverts are more concrete. Journal of Language and Social Psychology 32, 2: 191--201.",
      "doi": ""
    },
    {
      "text": "Bevan, K. 2012. Instagram is debasing real photography. Online article. (19 July 2012). Retrieved December 1, 2015 from: http://www.theguardian.com/technology/2012/jul/19/instagram-debasing-real-photography",
      "doi": ""
    },
    {
      "text": "Boroditsky, L. 2000. Metaphoric structuring: Understanding time through spatial metaphors. Cognition 75, 1: 1--28.",
      "doi": ""
    },
    {
      "text": "Buhrmester, M., Kwang, T., and Gosling, S. D. 2011. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on Psychological Science 6, 1: 3--5.",
      "doi": ""
    },
    {
      "text": "Chandler, L., and Livingston, D. 2012. Reframing the Authentic: photography, mobile technologies and the visual language of digital imperfection. In Proceedings of the Global Conference, Visual Literacies: Exploring Critical Issues, 1--15.",
      "doi": ""
    },
    {
      "text": "Chu, W. T., Chen, Y. K., and Chen, K. T. 2013. Size does matter: How image size affects aesthetic perception? In Proceedings of the ACM International Conference on Multimedia, 53--62.  ",
      "doi": "10.1145/2502081.2502102"
    },
    {
      "text": "Estrin, J. 2012. Ben Lowy: Virtually unfiltered. Online article. (2 May 2012). Retrieved May 2, 2016 from http://lens.blogs.nytimes.com/2012/05/02/ben-lowy-virtually-unfiltered/",
      "doi": ""
    },
    {
      "text": "Fujita, K., Henderson, M. D., Eng, J., Trope, Y., & Liberman, N. 2006. Spatial distance and mental construal of social events. Psychological Science 17, 4: 278--282.",
      "doi": ""
    },
    {
      "text": "Halonen, R. 2014. From Photographers to Viewers - What Makes Editorial Photos Interesting? Licentiate thesis. Aalto University, Espoo, Finland.",
      "doi": ""
    },
    {
      "text": "Heer, J., Kong, N., and Agrawala, M. (2009). Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1303--1312.  ",
      "doi": "10.1145/1518701.1518897"
    },
    {
      "text": "Ito, M., and Okabe, D. 2003. Camera phones changing the definition of picture-worthy. Japan Media Review, August 29, 2003.",
      "doi": ""
    },
    {
      "text": "Katzman, N., and Nyenhuis, J. (1972). Color vs. black-and-white effects on learning, opinion, and attention. AV Communication Review 20, 1: 16--28.",
      "doi": ""
    },
    {
      "text": "Kim, H. S. 2015. Attracting views and going viral: how message features and news-sharing channels affect health news diffusion. Journal of Communication, 65, 3: 512--534.",
      "doi": ""
    },
    {
      "text": "Lee, H., Deng, X., Unnava, H. R., and Fujita, K. 2014. Monochrome forests and colorful trees: The effect of black-and-white versus color imagery on construal level. Journal of Consumer Research 41, 4: 1015--1032.",
      "doi": ""
    },
    {
      "text": "Lee, K. J. and Perrett, D. 1997. Presentation-time measures of the effects of manipulations in colour space on discrimination of famous faces. Perception 26, 6: 733--752.",
      "doi": ""
    },
    {
      "text": "Lee, M. K., Fruchter, N and Dabbish, L. 2015. Making decisions from a distance: the impact of technological mediation on riskiness and dehumanization. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1576--1589.  ",
      "doi": "10.1145/2675133.2675288"
    },
    {
      "text": "Liberman, N., Trope, Y., McCrea, S. M., and Sherman, S. J. 2007. The effect of level of construal on the temporal distance of activity enactment. Journal of Experimental Social Psychology 43, 1: 143--149.",
      "doi": ""
    },
    {
      "text": "Liberman, N., and Trope, Y. 2008. The psychology of transcending the here and now. Science 322, 5905: 1201--1205.",
      "doi": ""
    },
    {
      "text": "Lucas, H. C., and Goh, J. M. 2009. Disruptive technology: How Kodak missed the digital photography revolution. The Journal of Strategic Information Systems 18, 1: 46--55.  ",
      "doi": "10.1016/j.jsis.2009.01.002"
    },
    {
      "text": "Marlow, J., and Dabbish, L. 2014. When is a picture not worth a thousand words? The psychological effects of mediated exposure to a remote location. Computers in Human Behavior 30, 824--831.  ",
      "doi": "10.1016/j.chb.2013.08.002"
    },
    {
      "text": "Mayfield, E., and Rosé, C. P. 2012. LightSIDE: Text mining and machine learning user's manual. Manual. (Spring 2012). Retrieved from http://www.cs.cmu.edu/~emayfiel/LightSIDE.pdf",
      "doi": ""
    },
    {
      "text": "Miller, A. D., and Edwards, W. K. (2007). Give and take: a study of consumer photo-sharing culture and practice. In Proceedings of the SIGCHI conference on Human factors in Computing Systems (CHI '07), 347-- 356.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "Miller, J. 2013. What your Instagram filter says about you. Infographic. (19 March 2013). Retrieved May 4, 2016 from http://blog.marketo.com/2013/03/what-your-instagram-filter-says-about-you-infographic.html",
      "doi": ""
    },
    {
      "text": "Morlot, E. 2013. Nostalgic Consumption Behaviours among Young Generations in Photography: A Comparative Approach of Instagram and Analogue Photography. Master thesis. Umeå University, Umeå, Sweden.",
      "doi": ""
    },
    {
      "text": "Mould, D., Mandryk, R. L., and Li, H. 2012. Emotional response and visual attention to non-photorealistic images. Computers & Graphics, 36, 6: 658--672.  ",
      "doi": "10.1016/j.cag.2012.03.039"
    },
    {
      "text": "Pennebaker, J. W., and King, L. A. 1999. Linguistic styles: language use as an individual difference. Journal of Personality and Social Psychology 77, 6: 1296--1312.",
      "doi": ""
    },
    {
      "text": "Price, N. Undated. Color vs black and white photography - What makes sense and when? Retrieved May 10, 2016 from http://www.photographyvox.com/a/color-vs-black-andwhite-photography/",
      "doi": ""
    },
    {
      "text": "Redi, J., and Povoa I. 2014. Crowdsourcing for rating image aesthetic appeal: Better a paid or a volunteer crowd? In Proceedings of the International ACM Workshop on Crowdsourcing for Multimedia, 25--30.  ",
      "doi": "10.1145/2660114.2660118"
    },
    {
      "text": "Reece, A. G., and Danforth, C. M. 2016. Instagram photos reveal predictive markers of depression. Online manuscript. (13 August 2016). Retrieve September 1, 2016 from http://arxiv.org/abs/1608.03282",
      "doi": ""
    },
    {
      "text": "Schwartz, H. A., Eichstaedt, J. C., Kern, M. L., Dziurzynski, L., Ramones, S. M., Agrawal, M., ... and Ungar, L. H. 2013. Personality, gender, and age in the language of social media: The open-vocabulary approach. PLOS ONE, 8, 9: e73791.",
      "doi": ""
    },
    {
      "text": "Shklovsky, V. 1965. Art as technique. In Russian Formalist Criticism, Lemon, L. T., and Reis, M. J. (eds.). University of Nebraska Press, Lincoln, NE, 3--24.",
      "doi": ""
    },
    {
      "text": "Snyder, S. R. 1991. Are Emerging Technologies Affecting the Credibility of Photographs? An Experimental Study in Photographic Believability. Master thesis. Texas Tech University, Lubbock, TX.",
      "doi": ""
    },
    {
      "text": "Sontag, S. 1977. On Photography. Dell/Delta, NY, NY.",
      "doi": ""
    },
    {
      "text": "Spence, I., Wong, P., Rusan, M., and Rastegar, N. 2006. How color enhances visual memory for natural scenes. Psychological Science 17, 1: 1--6.",
      "doi": ""
    },
    {
      "text": "Suh, M. M., and Hsieh, G. 2016. Designing for future behaviors: Understanding the effect of temporal distance on planned behaviors. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI '16), 1084--1096.  ",
      "doi": "10.1145/2858036.2858591"
    },
    {
      "text": "Tausczik, Y. R. and Pennebaker, J. W. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology 29, 1: 24--54.",
      "doi": ""
    },
    {
      "text": "Trope, Y. and Liberman, N. 2010. Construal-level theory of psychological distance. Psychological Review 117, 2: 440--463.",
      "doi": ""
    },
    {
      "text": "Totti, L. C., Costa, F. A., Avila, S., Valle, E., Meira Jr, W., & Almeida, V. 2014. The impact of visual attributes on online image diffusion. In Proceedings of the ACM conference on Web science, 42--51.  ",
      "doi": "10.1145/2615569.2615700"
    },
    {
      "text": "West, S. G., Aiken, L. S., & Krull, J. L. 1996. Experimental personality designs: Analyzing categorical by continuous variable interactions. Journal of Personality 64, 1: 1--48.",
      "doi": ""
    },
    {
      "text": "World Press Photo. 2016. World Press Photo of the Year 2015 goes to Warren Richardson. Online article. (18 February 2016). Retrieved May 10, 2016 from http://www.worldpressphoto.org/news/2016-02-18/world-press-photo-year-2015-goes-warren-richardson",
      "doi": ""
    },
    {
      "text": "Zhang, M., and Wang, J. 2009. Psychological distance asymmetry: The spatial dimension vs. other dimensions. Journal of Consumer Psychology 19, 3: 497--507.",
      "doi": ""
    }
  ]
}