{
  "doi": "10.1145/3025453.3025526",
  "title": "Squeezeback: Pneumatic Compression for Notifications",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5318-5330",
  "year": 2017,
  "badges": [],
  "abstract": "Current mobile devices commonly use vibration feedback to signal incoming notifications. However, vibration feedback exhibits strong attention capture, limiting its use to short periods and prominent notifications. Instead, we investigate the use of compression feedback for notifications, which scales from subtle stimuli to strong ones and can provide sustained stimuli over longer periods. Compression feedback utilizes inflatable straps around a user's limbs, a form factor allowing for easy integration into many common wearables. We explore technical aspects of compression feedback and investigate its psychophysical properties with several lab and in situ studies. Furthermore, we show how compression feedback enables reactive feedback. Here, deflation patterns are used to reveal further information on a user's query. We also compare compression and vibrotactile feedback and find that they have similar performance.",
  "authors": [
    {
      "name": "Henning Pohl",
      "institution": "University of Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-81484643749/rel-imgonly/photo.jpg",
      "acmid": "81484643749",
      "orcid": "missing"
    },
    {
      "name": "Peter Brandes",
      "institution": "University of Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161572",
      "orcid": "missing"
    },
    {
      "name": "Hung Ngo Quang",
      "institution": "University of Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162630",
      "orcid": "missing"
    },
    {
      "name": "Michael Rohs",
      "institution": "University of Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-81314494694/rel-imgonly/mr-120.jpg",
      "acmid": "81314494694",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch, Henning Pohl, Stefanie Reinicke, Emilia Wittmers, Patrick Lühne, Marius Knaust, Sven Köhler, Patrick Schmidt, and Christian Holz. 2013. Imaginary Reality Gaming: Ball Games Without a Ball. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13. ACM Press, New York, New York, USA, 405--410.  ",
      "doi": "10.1145/2501988.2502012"
    },
    {
      "text": "Matthew A. Baumann, Karon E. MacLean, Thomas W. Hazelton, and Ashley McKay. 2010. Emulating Human Attention-Getting Practices with Wearable Haptics. In Proceedings of the 2010 IEEE Haptics Symposium. IEEE, 149--156.  ",
      "doi": "10.1109/HAPTIC.2010.5444662"
    },
    {
      "text": "S. J. Bolanowski, G. A. Gescheider, R. T. Verrillo, and C. M. Checkosky. 1988. Four channels mediate the mechanical aspects of touch. The Journal of the Acoustical Society of America 84, 5 (1988), 1680--1694.",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Mirko Aurilio, Claudio Pacchierotti, and Domenico Prattichizzo. 2014. The HapBand: A Cutaneous Device for Remote Tactile Interaction. In Proceedings of EuroHaptics - EuroHaptics '14. 284--291.",
      "doi": ""
    },
    {
      "text": "V. G. Chouvardas, a. N. Miliou, and M. K. Hatalis. 2008. Tactile Displays: Overview and Recent Advances. Displays 29 (2008), 185--194.",
      "doi": ""
    },
    {
      "text": "Martin Culjat, Chih-Hung King, Miguel Franco, James Bisley, Warren Grundfest, and Erik Dutson. 2008. Pneumatic Balloon Actuators for Tactile Feedback in Robotic Surgery. Industrial Robot: An International Journal 35, 5 (2008), 449--455.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Francine Gemperle, Jodi Forlizzi, and Elliott Montgomery. 2003. The Hug: An Exploration of Robotic Form for Intimate Communication. In Proceedings of the 12th IEEE International Workshop on Robot and Human Interactive Communication - ROMAN '03. 403--408.",
      "doi": ""
    },
    {
      "text": "Stephen M. Edelson, Meredyth G. Edelson, David C. R. Kerr, and Temple Grandin. 1999. Behavioral and Physiological Effects of Deep Pressure on Children With Autism: A Pilot Study Evaluating the Efficacy of Grandin's Hug Machine. American Journal of Occupational Therapy 53, 1979 (1999), 145--152.",
      "doi": ""
    },
    {
      "text": "Mario Enriquez, Oleg Afonin, Brent Yager, and Karon Maclean. 2001. A Pneumatic Tactile Alerting System for the Driving Environment. In Proceedings of the 2001 workshop on Percetive user interfaces - PUI '01. ACM Press, New York, New York, USA, 1--7.  ",
      "doi": "10.1145/971478.971506"
    },
    {
      "text": "Richard E. Fan, Martin O. Culjat, Chih-Hung King, Miguel L. Franco, Richard Boryk, James W. Bisley, Erik Dutson, and Warren S. Grundfest. 2008. A Haptic Feedback System for Lower-Limb Prostheses. IEEE Transactions on Neural Systems and Rehabilitation Engineering 16, 3 (jun 2008), 270--277.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming User Interfaces: Programmable Particle Stiffness and Sensing for Malleable and Shape-Changing Devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST '12. ACM Press, New York, New York, USA, 519--528.  ",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "F. Funke and U.-D. Reips. 2012. Why Semantic Differentials in Web-Based Research Should Be Made from Visual Analogue Scales and Not from 5-Point Scales. Field Methods 24, 3 (aug 2012), 310--327.",
      "doi": ""
    },
    {
      "text": "George A. Gescheider. 1997. The Classical Psychophysical Methods. In Psychophysics: The Fundamentals. Lawrence Erlbaum Associates, Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Kristian Gohlke, Eva Hornecker, and Wolfgang Sattler. 2016. Pneumatibles: Exploring Soft Robotic Actuators for the Design of User Interfaces with Pneumotactile Feedback. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '16. ACM Press, New York, New York, USA, 308--315.  ",
      "doi": "10.1145/2839462.2839489"
    },
    {
      "text": "Michael Haller, Christoph Richter, Peter Brandl, Sabine Gross, Gerold Schossleitner, Andreas Schrempf, Hideaki Nii, Maki Sugimoto, and Masahiko Inami. 2011. Finding the Right Way for Interrupting People Improving Their Sitting Posture. In Proceedings of the 13th International Conference on Human-Computer Interaction INTERACT '11. 1--17. ",
      "doi": "10.5555/2042118.2042120"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Providing Dynamically Changeable Physical Buttons on a Visual Display. In Proceedings of the 27th international conference on Human factors in computing systems - CHI '09. ACM Press, New York, New York, USA, 299--308.  ",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Liang He, Cheng Xu, Ding Xu, and Ryan Brill. 2015. PneuHaptic: Delivering Haptic Cues with a Pneumatic Armband. In Proceedings of the 2015 ACM International Symposium on Wearable Computers - ISWC '15. ACM Press, New York, New York, USA, 47--48.  ",
      "doi": "10.1145/2802083.2802091"
    },
    {
      "text": "Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable Mouse: Volume-adjustable Mouse with Air-pressure-sensitive Input and Haptic Feedback. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08. ACM Press, New York, New York, USA, 211--224.  ",
      "doi": "10.1145/1357054.1357090"
    },
    {
      "text": "Yeongmi Kim, Sehun Kim, Taejin Ha, Ian Oakley, and Woontack Woo. 2006. Air-Jet Button Effects in AR. In Proceedings of the 16th International Conference on Artificial Reality and Telexistence - ICAT'06 (Lecture Notes in Computer Science), Vol. 4282. Berlin, Heidelberg, 384--391.  ",
      "doi": "10.1007/11941354_39"
    },
    {
      "text": "R. L. Klatzky and S. J. Lederman. 2002. Touch. In Experimental Psychology, I. B. Weiner (Ed.). Vol. 4. Wiley, New York, NY, USA, 147--176.",
      "doi": ""
    },
    {
      "text": "H. Levitt. 1971. Transformed Up-Down Methods in Psychoacoustics. The Journal of the Acoustical Society of America 49, 2B (1971), 467--477.",
      "doi": ""
    },
    {
      "text": "Ramses V. Martinez, Carina R. Fish, Xin Chen, and George M. Whitesides. 2012. Elastomeric Origami: Programmable Paper-Elastomer Composites as Pneumatic Actuators. Advanced Functional Materials 22, 7 (apr 2012), 1376--1384.",
      "doi": ""
    },
    {
      "text": "Takashi Mitsuda. 2013. Pseudo Force Display that Applies Pressure to the Forearms. Presence: Teleoperators and Virtual Environments 22, 3 (2013), 191--201.",
      "doi": "10.1162/PRES_a_00150"
    },
    {
      "text": "Florian Floyd Mueller, Frank Vetere, Martin R. Gibbs, Jesper Kjeldskov, Sonja Pedell, and Steve Howard. 2005. Hug Over a Distance. In Extended Abstracts of the 2005 Conference on Human Factors and Computing Systems CHI EA '05. 1673--1676.  ",
      "doi": "10.1145/1056808.1056994"
    },
    {
      "text": "Ryuma Niiyama, Xu Sun, Lining Yao, Hiroshi Ishii, Daniela Rus, and Sangbae Kim. 2015. Sticky Actuator: Free-Form Planar Actuators for Animated Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14. ACM Press, New York, New York, USA, 77--84.  ",
      "doi": "10.1145/2677199.2680600"
    },
    {
      "text": "Minna Pakanen, Ashley Colley, Jonna Häkkilä, Johan Kildal, and Vuokko Lantz. 2014. Squeezy Bracelet: Designing a Wearable Communication Device for Tactile Interaction. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction Fun, Fast, Foundational - NordiCHI '14. ACM Press, New York, New York, USA, 305--314.  ",
      "doi": "10.1145/2639189.2639238"
    },
    {
      "text": "Patrick E. Patterson and Judd A. Katz. 1992. Design and Evaluation of a Sensory Feedback System that Provides Grasping Pressure in a Myoelectric Hand. Journal of Rehabilitation Research and Development 29, 1 (1992), 1--8.",
      "doi": ""
    },
    {
      "text": "Laura Perovich, Philippa Mothersill, and Jennifer Broutin Farah. 2013. Awakened Apparel: Embedded Soft Actuators for Expressive Fashion and Functional Garments. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction - TEI '14. ACM Press, New York, New York, USA, 77--80.  ",
      "doi": "10.1145/2540930.2540958"
    },
    {
      "text": "Henning Pohl, Dennis Becke, Eugen Wagner, Maximilian Schrapel, and Michael Rohs. 2015. Wrist Compression Feedback by Pneumatic Actuation. In CHI '15 Extended Abstracts on Human Factors in Computing Systems on CHI EA '15.  ",
      "doi": "10.1145/2702613.2725427"
    },
    {
      "text": "Henning Pohl and Roderick Murray-Smith. 2013. Focused and Casual Interactions: Allowing Users to Vary Their Level of Engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 2223--2232.  ",
      "doi": "10.1145/2470654.2481307"
    },
    {
      "text": "Ronit Slyper and Jessica Hodgins. 2012. Prototyping Robot Appearance, Movement, and Interactions Using Flexible 3D Printing and Air Pressure Sensors. In Proceedings of the 21st IEEE International Symposium on Robot and Human Interactive Communication RO-MAN'12, Vol. 1. IEEE, 6--11.",
      "doi": ""
    },
    {
      "text": "Sunghyun Song, Geeyoung Noh, Junwoo Yoo, Ian Oakley, Jundong Cho, and Andrea Bianchi. 2015. Hot & Tight: Exploring Thermo and Squeeze Cues Recognition on Wrist Wearables. In Proceedings of the 2015 ACM International Symposium on Wearable Computers - ISWC '15. ACM Press, New York, New York, USA, 39--42.  ",
      "doi": "10.1145/2802083.2802092"
    },
    {
      "text": "Andrew A. Stanley and Katherine J. Kuchenbecker. 2012. Evaluation of Tactile Feedback Methods for Wrist Rotation Guidance. IEEE Transactions on Haptics 5, 3 (jan 2012), 240--251.  ",
      "doi": "10.1109/TOH.2012.33"
    },
    {
      "text": "Katja Suhonen, Kaisa Väänänen-Vainio-Mattila, and Kalle Mäkelä. 2012. User Experiences and Expectations of Vibrotactile, Thermal and Squeeze Feedback in Interpersonal Communication. In Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers - BCS-HCI '12. 205--214. http://dl.acm.org/citation.cfm?id=2377939 ",
      "doi": "10.5555/2377916.2377939"
    },
    {
      "text": "James Keng Soon Teh, Adrian David Cheok, Yongsoon Choi, Charith Lasantha Fernando, Roshan Lalintha Peiris, and Owen Noel Newton Fernando. 2009. Huggy Pajama: A Mobile Parent and Child Hugging Communication System. In Proceedings of the 8th International Conference on Interaction Design and Children - IDC '09. ACM Press, New York, New York, USA, 250--257.  ",
      "doi": "10.1145/1463689.1463763"
    },
    {
      "text": "Camilo Tejeiro, Cara E. Stepp, Mark Malhotra, Eric Rombokas, and Yoky Matsuoka. 2012. Comparison of Remote Pressure and Vibrotactile Feedback for Prosthetic Hand Control. In Proceedings of the IEEE RAS and EMBS International Conference on Biomedical Robotics and Biomechatronics. 521--525.",
      "doi": ""
    },
    {
      "text": "Dzmitry Tsetserukou. 2010. HaptiHug: A Novel Haptic Display for Communication of Hug Over a Distance. In Haptics: Generating and Perceiving Tangible Sensations EuroHaptics '10. 340--347. ",
      "doi": "10.5555/1884164.1884216"
    },
    {
      "text": "Cati Vaucelle, Leonardo Bonanni, and Hiroshi Ishii. 2009. Design of Haptic Interfaces for Therapy. In Proceedings of the 27th international conference on Human factors in computing systems - CHI '09 (CHI). ACM Press, 467--470.  ",
      "doi": "10.1145/1518701.1518776"
    },
    {
      "text": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E. Hudson. 2015. 3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 1295--1304.  ",
      "doi": "10.1145/2702123.2702569"
    },
    {
      "text": "Rongrong Wang, Francis Quek, Deborah Tatar, Keng Soon Teh, and Adrian Cheok. 2012. Keep in Touch: Channel, Expectation and Experience. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press, New York, New York, USA, 139--148.  ",
      "doi": "10.1145/2207676.2207697"
    },
    {
      "text": "John Williamson, Roderick Murray-Smith, and Stephen Hughes. 2007. Shoogle: Excitatory Multimodal Interaction on Mobile Devices. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 121--124.  ",
      "doi": "10.1145/1240624.1240642"
    },
    {
      "text": "Graham Wilson, Martin Halvey, Stephen A. Brewster, and Stephen A. Hughes. 2011. Some Like it Hot: Thermal Feedback for Mobile Devices. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems - CHI '11 (CHI). ACM Press, 2555--2564.  ",
      "doi": "10.1145/1978942.1979316"
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13. ACM Press, New York, New York, USA, 13--22.  ",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Ying Zheng and John B. Morrell. 2012. Haptic Actuator Design Parameters that Influence Affect and Attention. In 2012 IEEE Haptics Symposium - HAPTICS'12. Ieee, 463--470.",
      "doi": ""
    },
    {
      "text": "Ying Zheng, Ellen Su, and John B. Morrell. 2013. Design and evaluation of pactors for managing attention capture. In 2013 World Haptics Conference (WHC). IEEE, 497--502.",
      "doi": ""
    }
  ]
}