{
  "doi": "10.1145/3025453.3026005",
  "title": "WatchSense: On- and Above-Skin Input Sensing through a Wearable Depth Sensor",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3891-3902",
  "year": 2017,
  "badges": [],
  "abstract": "This paper contributes a novel sensing approach to support on- and above-skin finger input for interaction on the move. WatchSense uses a depth sensor embedded in a wearable device to expand the input space to neighboring areas of skin and the space above it. Our approach addresses challenging camera-based tracking conditions, such as oblique viewing angles and occlusions. It can accurately detect fingertips, their locations, and whether they are touching the skin or hovering above it. It extends previous work that supported either mid-air or multitouch input by simultaneously supporting both. We demonstrate feasibility with a compact, wearable prototype attached to a user's forearm (simulating an integrated depth sensor). Our prototype---which runs in real-time on consumer mobile devices---enables a 3D input space on the back of the hand. We evaluated the accuracy and robustness of the approach in a user study. We also show how WatchSense increases the expressiveness of input by interweaving mid-air and multitouch for several interactive applications.",
  "authors": [
    {
      "name": "Srinath Sridhar",
      "institution": "Max Planck Institute for Informatics, Saarbrücken, Saarland, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660158757",
      "orcid": "missing"
    },
    {
      "name": "Anders Markussen",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959333557",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Christian Theobalt",
      "institution": "Max Planck Institute for Informatics, Saarbrucken, Saarland, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331505042",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Boring",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81331489074/rel-imgonly/mobilehci2015.jpg",
      "acmid": "81331489074",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gilles Bailly, Jörg Müller, Michael Rohs, Daniel Wigdor, and Sven Kratz. 2012. ShoeSense: A New Perspective on Gestural Interaction and Wearable Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1239--1248. DOI: http://dx.doi.org/10.1145/2207676.2208576  ",
      "doi": "10.1145/2207676.2208576"
    },
    {
      "text": "Yannick Bernaerts, Matthias Druwé, Sebastiaan Steensels, Jo Vermeulen, and Johannes Schöning. 2014. The Office Smartwatch: Development and Design of a Smartwatch App to Digitally Augment Interactions in an Office Environment. In Proceedings of the 2014 Companion Publication on Designing Interactive Systems (DIS Companion '14). ACM, New York, NY, USA, 41--44. DOI:http://dx.doi.org/10.1145/2598784.2602777  ",
      "doi": "10.1145/2598784.2602777"
    },
    {
      "text": "Alex Butler, Shahram Izadi, and Steve Hodges. 2008. SideSight: multi-touch interaction around small devices. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1e Filter: A Simple Speed-based Low-pass Filter for Noisy Input in Interactive Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2527--2530. DOI: http://dx.doi.org/10.1145/2207676.2208639  ",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, Kai-Yin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen. 2013. FingerPad: Private and Subtle Interaction Using Fingertips. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 255--260. DOI: http://dx.doi.org/10.1145/2501988.2502016  ",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Ke-Yu Chen, Kent Lyons, Sean White, and Shwetak Patel. 2013. uTrack: 3D Input Using Two Magnetic Sensors. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 237--244. DOI: http://dx.doi.org/10.1145/2501988.2502035  ",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Xiang 'Anthony' Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff, and Scott E. Hudson. Air+Touch: Interweaving Touch & In-air Gestures. In Proc. of UIST '14. ACM, New York, NY, USA, 519--525.",
      "doi": ""
    },
    {
      "text": "Dorin Comaniciu and Peter Meer. 2002. Mean shift: A robust approach toward feature space analysis. Pattern Analysis and Machine Intelligence, IEEE Transactions on 24, 5 (2002), 603--619.",
      "doi": "10.1109/34.1000236"
    },
    {
      "text": "Antonio Criminisi and Jamie Shotton. 2013. Decision forests for computer vision and medical image analysis. Springer Science & Business Media. ",
      "doi": ""
    },
    {
      "text": "David A Forsyth and Jean Ponce. 2002. Computer vision: a modern approach. Prentice Hall Professional Technical Reference.",
      "doi": "10.5555/580035"
    },
    {
      "text": "Sean Gustafson, Daniel Bierwirth, and Patrick Baudisch. 2010. Imaginary Interfaces: Spatial Interaction with Empty Hands and Without Visual Feedback. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 3--12. DOI: http://dx.doi.org/10.1145/1866029.1866033  ",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Sean Gustafson, Christian Holz, and Patrick Baudisch. 2011. Imaginary Phone: Learning Imaginary Interfaces by Transferring Spatial Memory from a Familiar Device. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 283--292. DOI: http://dx.doi.org/10.1145/2047196.2047233  ",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D. Wilson. 2011. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 441--450. DOI: http://dx.doi.org/10.1145/2047196.2047255  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Abracadabra: Wireless, High-precision, and Unpowered Finger Input for Very Small Mobile Devices. In Proceedings of the 22Nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 121--124. DOI: http://dx.doi.org/10.1145/1622176.1622199  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Khalad Hasan, David Ahlström, and Pourang Irani. 2013. Ad-binning: Leveraging Around Device Space for Storing, Browsing and Retrieving Mobile Device Content. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 899--908. DOI: http://dx.doi.org/10.1145/2470654.2466115  ",
      "doi": "10.1145/2470654.2466115"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1247--1256. DOI: http://dx.doi.org/10.1145/2702123.2702215  ",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Brett Jones, Rajinder Sodhi, David Forsyth, Brian Bailey, and Giuliano Maciocci. 2012. Around Device Interaction for Multiscale Navigation. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 83--92. DOI:http://dx.doi.org/10.1145/2371574.2371589  ",
      "doi": "10.1145/2371574.2371589"
    },
    {
      "text": "Cem Keskin, Furkan Kraç, Yunus Emre Kara, and Lale Akarun. 2013. Real time hand pose estimation using depth sensors. In Consumer Depth Cameras for Computer Vision. Springer, 119--137. ",
      "doi": ""
    },
    {
      "text": "David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: Freehand 3D Interactions Anywhere Using a Wrist-worn Gloveless Sensor. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 167--176. DOI: http://dx.doi.org/10.1145/2380116.2380139  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Jungsoo Kim, Jiasheng He, Kent Lyons, and Thad Starner. 2007. The Gesture Watch: A Wireless Contact-free Gesture Based Wrist Interface. In Proceedings of the 2007 11th IEEE International Symposium on Wearable Computers (ISWC '07). IEEE Computer Society, Washington, DC, USA, 1--8. DOI: http://dx.doi.org/10.1109/ISWC.2007.4373770  ",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "Sven Kratz and Michael Rohs. 2009. HoverFlow: Expanding the Design Space of Around-device Interaction. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, USA, Article 4, 8 pages. DOI: http://dx.doi.org/10.1145/1613858.1613864  ",
      "doi": "10.1145/1613858.1613864"
    },
    {
      "text": "Seungyon Claire Lee, Bohao Li, and Thad Starner. 2011. AirTouch: Synchronizing In-air Hand Gesture and On-body Tactile Feedback to Augment Mobile Gesture Interaction. In Proceedings of the 2011 15th Annual International Symposium on Wearable Computers (ISWC '11). IEEE Computer Society, Washington, DC, USA, 3--10. DOI: http://dx.doi.org/10.1109/ISWC.2011.27  ",
      "doi": "10.1109/ISWC.2011.27"
    },
    {
      "text": "Jhe-Wei Lin, Chiuan Wang, Yi Yao Huang, Kuan-Ting Chou, Hsuan-Yu Chen, Wei-Luan Tseng, and Mike Y. Chen. 2015. BackHand: Sensing Hand Gestures via Back of the Hand. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 557--564. DOI: http://dx.doi.org/10.1145/2807442.2807462  ",
      "doi": "10.1145/2807442.2807462"
    },
    {
      "text": "Simon Mayer and Gábor Sörös. 2014. User Interface Beaming Seamless Interaction with Smart Things using Personal Wearable Computers. In Proceedings of the 11th International Conference on Wearable and Implantable Body Sensor Networks (BSN 2014). Zurich, Switzerland, 46--49.  ",
      "doi": "10.1109/BSN.Workshops.2014.17"
    },
    {
      "text": "Kei Nakatsuma, Hiroyuki Shinoda, Yasutoshi Makino, Katsunari Sato, and Takashi Maeno. 2011. Touch Interface on Back of the Hand. In ACM SIGGRAPH 2011 Emerging Technologies (SIGGRAPH '11). ACM, New York, NY, USA, Article 19, 1 pages. DOI: http://dx.doi.org/10.1145/2048259.2048278  ",
      "doi": "10.1145/2048259.2048278"
    },
    {
      "text": "Jerome Pasquero, Scott J. Stobbe, and Noel Stonehouse. 2011. A Haptic Wristwatch for Eyes-free Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3257--3266. DOI: http://dx.doi.org/10.1145/1978942.1979425  ",
      "doi": "10.1145/1978942.1979425"
    },
    {
      "text": "Simon T. Perrault, Eric Luecolinet, James Eagan, and Yves Guiard. 2013. Watchit: Simple Gestures and Eyes-free Interaction for Wristwatches and Bracelets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1451--1460. DOI: http://dx.doi.org/10.1145/2470654.2466192  ",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Toby Sharp, Cem Keskin, Duncan Robertson, Jonathan Taylor, Jamie Shotton, David Kim Christoph Rhemann Ido Leichter, Alon Vinnikov Yichen Wei, Daniel Freedman Pushmeet Kohli Eyal Krupka, Andrew Fitzgibbon, and Shahram Izadi. 2015. Accurate, Robust, and Flexible Real-time Hand Tracking. In Proc. CHI, Vol. 8.  ",
      "doi": "10.1145/2702123.2702179"
    },
    {
      "text": "Jamie Shotton, Toby Sharp, Alex Kipman, Andrew Fitzgibbon, Mark Finocchio, Andrew Blake, Mat Cook, and Richard Moore. 2013. Real-time human pose recognition in parts from single depth images. Commun. ACM 56, 1 (2013), 116--124.  ",
      "doi": "10.1145/2398356.2398381"
    },
    {
      "text": "Jie Song, Fabrizio Pece, Gábor Sörös, Marion Koelle, and Otmar Hilliges. 2015. Joint Estimation of 3D Hand Position and Gestures from Monocular Video for Mobile Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3657--3660.  ",
      "doi": "10.1145/2702123.2702601"
    },
    {
      "text": "Srinath Sridhar, Franziska Mueller, Antti Oulasvirta, and Christian Theobalt. 2015. Fast and Robust Hand Tracking Using Detection-Guided Optimization. In Proceedings of Computer Vision and Pattern Recognition (CVPR). 9. http://handtracker.mpi-inf.mpg.de/projects/ FastHandTracker/",
      "doi": ""
    },
    {
      "text": "Paul Strohmeier. DIY IR Sensors for Augmenting Objects and Human Skin. In Proc. of Augmented Human International Conference '15. ACM, New York, NY, USA, 181--182.  ",
      "doi": "10.1145/2735711.2735802"
    },
    {
      "text": "Cheng-Yao Wang, Wei-Chen Chu, Po-Tsung Chiu, Min-Chieh Hsiu, Yih-Harn Chiang, and Mike Y. Chen. 2015a. PalmType: Using Palms As Keyboards for Smart Glasses. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 153--160. DOI: http://dx.doi.org/10.1145/2785830.2785886  ",
      "doi": "10.1145/2785830.2785886"
    },
    {
      "text": "Cheng-Yao Wang, Min-Chieh Hsiu, Po-Tsung Chiu, Chiao-Hui Chang, Liwei Chan, Bing-Yu Chen, and Mike Y. Chen. 2015b. PalmGesture: Using Palms As Gesture Interfaces for Eyes-free Input. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 217--226. DOI:http://dx.doi.org/10.1145/2785830.2785885  ",
      "doi": "10.1145/2785830.2785885"
    },
    {
      "text": "David Way and Joseph Paradiso. 2014. A Usability User Study Concerning Free-Hand Microgesture and Wrist-Worn Sensors. In Proceedings of the 2014 11th International Conference on Wearable and Implantable Body Sensor Networks (BSN '14). IEEE Computer Society, Washington, DC, USA, 138--142. DOI: http://dx.doi.org/10.1109/BSN.2014.32  ",
      "doi": "10.1109/BSN.2014.32"
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2991--3000. DOI: http://dx.doi.org/10.1145/2702123.2702391  ",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Vikram Mehta, and Jürgen Steimle. 2014. More Than Touch: Understanding How People Use Skin As an Input Surface for Mobile Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 179--188. DOI: http://dx.doi.org/10.1145/2556288.2557239  ",
      "doi": "10.1145/2556288.2557239"
    },
    {
      "text": "Andrew D Wilson. 2006. Robust computer vision-based detection of pinching for one and two-handed gesture input. In Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, 255--258.",
      "doi": "10.1145/1166253.1166292"
    },
    {
      "text": "Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the Input Expressivity of Smartwatches with Mechanical Pan, Twist, Tilt and Click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 193--196. DOI:http://dx.doi.org/10.1145/2556288.2557017  ",
      "doi": "10.1145/2556288.2557017"
    },
    {
      "text": "Hui-Shyong Yeo, Juyoung Lee, Andrea Bianchi, and Aaron Quigley. 2016. WatchMI: Pressure Touch, Twist and Pan Gesture Input on Unmodified Smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 394--399. DOI: http://dx.doi.org/10.1145/2935334.2935375  ",
      "doi": "10.1145/2935334.2935375"
    },
    {
      "text": "Yang Zhang, Junhan Zhou, Gierad Laput, and Chris Harrison. 2016. SkinTrack: Using the Body As an Electrical Waveguide for Continuous Finger Tracking on the Skin. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1491--1503. DOI: http://dx.doi.org/10.1145/2858036.2858082  ",
      "doi": "10.1145/2858036.2858082"
    }
  ]
}