{
  "doi": "10.1145/3025453.3025900",
  "title": "Playing Fast and Loose with Music Recognition",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4302-4313",
  "year": 2017,
  "badges": [],
  "abstract": "We report lessons from iteratively developing a music recognition system to enable a wide range of musicians to embed musical codes into their typical performance practice. The musician composes fragments of music that can be played back with varying levels of embellishment, disguise and looseness to trigger digital interactions. We collaborated with twenty-three musicians, spanning professionals to amateurs and working with a variety of instruments. We chart the rapid evolution of the system to meet their needs as they strove to integrate music recognition technology into their performance practice, introducing multiple features to enable them to trade-off reliability with musical expression. Collectively, these support the idea of deliberately introducing \"looseness\" into interactive systems by addressing the three key challenges of control, feedback and attunement, and highlight the potential role for written notations in other recognition-based systems.",
  "tags": [
    "music recognition",
    "casual interactions",
    "attunement",
    "H-metaphor",
    "looseness",
    "sensing systems",
    "notation",
    "performance"
  ],
  "authors": [
    {
      "name": "Chris Greenhalgh",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100557223/rel-imgonly/chrisgreenhalghsmall.jpg",
      "acmid": "81100557223",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Adrian Hazzard",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958943157",
      "orcid": "missing"
    },
    {
      "name": "Alan Chamberlain",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100146006/rel-imgonly/ac.jpg",
      "acmid": "81100146006",
      "orcid": "0000-0002-2122-8077"
    }
  ],
  "references": [
    {
      "text": "Michel Beaudouin-Lafon and Wendy Mackay. 2002. Prototyping tools and techniques. In The humancomputer interaction handbook, Julie A. Jacko and Andrew Sears (Eds.). L. Erlbaum Associates Inc., Hillsdale, NJ, USA 1006--1031.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti, Maribeth Back, W. Keith Edwards, Rebecca E. Grinter, Austin Henderson, and Cristina Lopes. 2002. Making sense of sensing systems: five questions for designers and researchers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, NY, NY, USA, 415--422. DOI=http://dx.doi.org/10.1145/503376.503450  ",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Emmanouil Benetos and Simon Dixon. 2012. A ShiftInvariant Latent Variable Model for Automatic Music Transcription. Comput. Music J. 36, 4 (Dec.2012), 81--94.  ",
      "doi": "10.1162/COMJ_a_00146"
    },
    {
      "text": "Steve Benford, Holger Schnädelbach, Boriana Koleva, Rob Anastasi, Chris Greenhalgh, Tom Rodden, Jonathan Green, Ahmed Ghali, Tony Pridmore, Bill Gaver, Andy Boucher, Brendan Walker, Sarah Pennington, Albrecht Schmidt, Hans Gellersen, and Anthony Steed. 2005. Expected, sensed, and desired: A framework for designing sensing-based interaction. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 3--30. DOI=http://dx.doi.org/10.1145/1057237.1057239  ",
      "doi": "10.1145/1057237.1057239"
    },
    {
      "text": "Mason Bretan and Gil Weinberg. 2016. A survey of robotic musicianship. Commun. ACM 59, 5 (April 2016), 100--109.  ",
      "doi": "10.1145/2818994"
    },
    {
      "text": "Chris Cannam, Matthias Mauch, Matthew E. P. Davies, Simon Dixon, Christian Landone, Katy C. Noland, Mark Levy, Massimiliano Zanoni, Dan Stowell, and Luís A. Figueira, 2013. MIREX 2013 entry: Vamp plugins from the centre for digital music. MIREX.",
      "doi": ""
    },
    {
      "text": "Alan J. Dix. 1992. Pace and interaction. In Proceedings of HCI'92: People and Computers VII, Eds. A. Monk, D. Diaper and M. Harrison. Cambridge University Press. 193--207.",
      "doi": ""
    },
    {
      "text": "Alan J. Dix. 1995. Cooperation without (reliable) Communication: Interfaces for Mobile Applications. Distributed Systems Engineering, 2(3): pp. 171--181. ",
      "doi": ""
    },
    {
      "text": "Tom Djajadiningrat, Kees Overbeeke, and Stephan Wensveen. 2002. But how, Donald, tell us how?: on the creation of meaning in interaction design through feedforward and inherent feedback. In Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '02). ACM, NY, NY, USA, 285--291. DOI=http://dx.doi.org/10.1145/778712.778752  ",
      "doi": "10.1145/778712.778752"
    },
    {
      "text": "Kenneth H. Goodrich, Paul C. Schutte, Frank O. Flemisch and Ralph A. Williams. 2006. Application of the H-Mode, A Design and Interaction Concept for Highly Automated Vehicles, to Aircraft. 2006 ieee/aiaa 25TH Digital Avionics Systems Conference, Portland, OR, 1--13. doi: 10.1109/DASC.2006.313781 ",
      "doi": ""
    },
    {
      "text": "Chris Greenhalgh, Steve Benford, Adrian Hazzard. 2016. ^muzicode$: Composing and Performing Musical Codes. In Proceedings of AM '16, October 04 -- 06. Norrköping, Sweden. http://dx.doi.org/10.1145/2986416.2986444  ",
      "doi": "10.1145/2986416.2986444"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24. DOI=http://dx.doi.org/10.1145/642611.642616  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "ISO/IEC. 1999. 13407 Human-Centred Design Processes for Interactive Systems, ISO/IEC 13407: 1999 (E).",
      "doi": ""
    },
    {
      "text": "C. Joder, S. Essid, and G. Richard. 2011. A Conditional Random Field Framework for Robust and Scalable Audio-to-Score Matching. Trans. Audio, Speech and Lang. Proc. 19, 8 (November 2011), 23852397. DOI=http://dx.doi.org/10.1109/TASL.2011.2134092  ",
      "doi": "10.1109/TASL.2011.2134092"
    },
    {
      "text": "Anna Jordanous and Alan Smaill. 2009. Investigating the Role of Score Following in Automatic Musical Accompaniment. Journal of New Music Research, 38 (2). 197 - 209. ",
      "doi": ""
    },
    {
      "text": "Olivier Lartillot and Petri Toiviainen. 2007. A Matlab toolbox for musical feature extraction from audio, In International Conference on Digital Audio Effects, 237--244.",
      "doi": ""
    },
    {
      "text": "Tod Machover and Joe Chung. 1989. Hyperinstruments: Musically Intelligent and Interactive Performance and Creativity Systems. In ICMC 1989, 186--190.",
      "doi": ""
    },
    {
      "text": "Robert Cecil Martin. 2003. Agile Software Development: Principles, Patterns, and Practices. Prentice Hall PTR, Upper Saddle River, NJ, USA.",
      "doi": "10.5555/515230"
    },
    {
      "text": "Andrew McPherson. 2010. The Magnetic Resonator Piano: Electronic Augmentation of an Acoustic Grand Piano. Journal of New Music Research, 39(3), 189202. DOI=10.1080/09298211003695587",
      "doi": ""
    },
    {
      "text": "Donald A. Norman and Stephen W. Draper. 1986. User Centered System Design; New Perspectives on Human-Computer Interaction. L. Erlbaum Assoc. Inc., Hillsdale, NJ, USA.",
      "doi": "10.5555/576915"
    },
    {
      "text": "Donald A. Norman. 2010. Natural user interfaces are not natural. interactions 17, 3 (May 2010), 6--10. DOI=http://dx.doi.org/10.1145/1744161.1744163  ",
      "doi": "10.1145/1744161.1744163"
    },
    {
      "text": "Rebecca Fiebrink, Perry R. Cook, and Dan Trueman. 2011. Human model evaluation in interactive supervised learning. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 147--156. DOI=http://dx.doi.org/10.1145/1978942.1978965.  ",
      "doi": "10.1145/1978942.1978965"
    },
    {
      "text": "François Pachet. 2004. On the design of a musical flow machine. In A Learning Zone of One's Own, Tokoro and Steels (Eds), IOS Press, 111--134.",
      "doi": ""
    },
    {
      "text": "George Perle. 1972. Serial composition and atonality: an introduction to the music of Schoenberg, Berg, and Webern. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Henning Pohl and Roderick Murray-Smith. 2013. Focused and casual interactions: allowing users to vary their level of engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 22232232. DOI: http://dx.doi.org/10.1145/2470654.2481307  ",
      "doi": "10.1145/2470654.2481307"
    },
    {
      "text": "R. Rowe. 1992. Machine Listening and Composing with Cypher. Comput. Music J. 16, 1, 43.",
      "doi": ""
    },
    {
      "text": "Justin Salamon, Emilia Gomez, Daniel P. W. Ellis, and Gael Richard. 2014. Melody extraction from polyphonic music signals: Approaches, applications, and challenges. Signal Process. Mag. IEEE 31, 2--134. ",
      "doi": ""
    },
    {
      "text": "E. Sams. 1970. Elgar's Cipher Letter to Dorabella. Music. Times, 151--154.",
      "doi": ""
    },
    {
      "text": "A. M. Stark. 2014. Sound Analyser: A Plug-In For Real-Time Audio Analysis In Live Performances And Installations. In Proceedings of New Interfaces for Musical Expression (NIME), London, 2014",
      "doi": ""
    },
    {
      "text": "Greg Turner, Alastair Weakley, Yun Zhang, Ernest Edmonds. 2005. Attuning: A Social and Technical Study of Artist--Programmer Collaborations. In 17th Workshop of the Psychology of Programming Interest Group, Sussex University, P. Romero, J. Good, E. Acosta Chaparro & S. Bryant (Eds). Proc. PPIG 17, 106--109, June 2005",
      "doi": ""
    },
    {
      "text": "Jo Vermeulen, Kris Luyten, Elise van den Hoven, and Karin Coninx. 2013. Crossing the bridge over Norman's Gulf of Execution: revealing feedforward's true identity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 19311940. DOI: http://dx.doi.org/10.1145/2470654.2466255  ",
      "doi": "10.1145/2470654.2466255"
    },
    {
      "text": "Avery Wang. 2006. The Shazam music recognition service. Commun. ACM 49, 8 (August 2006), 44--48. DOI=http://dx.doi.org/10.1145/1145287.1145312  ",
      "doi": "10.1145/1145287.1145312"
    },
    {
      "text": "Bruno Zamborlin, Frederic Bevilacqua, Marco Gillies, and Mark D'inverno. 2014. Fluid gesture interaction design: Applications of continuous recognition for the design of modern gestural interfaces. ACM Trans. Interact. Intell. Syst. 3, 4, Article 22 (January 2014), 30 pages. DOI=http://dx.doi.org/10.1145/2543921.  ",
      "doi": "10.1145/2543921"
    }
  ]
}