{
  "doi": "10.1145/3025453.3025490",
  "title": "HCI, Solidarity Movements and the Solidarity Economy",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3126-3137",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The financial crisis and austerity politics in Europe has had a devastating impact on public services, social security and vulnerable populations. Greek civil society responded quickly by establishing solidarity structures aimed at helping vulnerable citizens to meet their basic needs and empower them to co-create an anti-austerity movement. While digital technology and social media played an important role in the initiation of the movement, it has a negligible role in the movement's on-going practices. Through embedded work with several solidarity structures in Greece, we have begun to understand the \"solidarity economy\" (SE) as an experiment in direct democracy and self-organization. Working with a range of solidarity structures we are developing a vision for a \"Solidarity HCI\" committed to designing to support personal, social and institutional transformation through processes of agonistic pluralism and contestation, where the aims and objectives of the SE are continuously re-formulated and put into practice.",
  "tags": [
    "social movements",
    "solidarity economy",
    "digital civics"
  ],
  "authors": [
    {
      "name": "Vasillis Vlachokyriakos",
      "institution": "Newcastle University & Open Lab-let: Athens, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502803064",
      "orcid": "0000-0001-6038-5959"
    },
    {
      "name": "Clara Crivellaro",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    },
    {
      "name": "Pete Wright",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Evika Karamagioli",
      "institution": "University of Athens, Athens, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361602565",
      "orcid": "missing"
    },
    {
      "name": "Eleni-Revekka Staiou",
      "institution": "University of Athens, Athens, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658678451",
      "orcid": "missing"
    },
    {
      "name": "Dimitris Gouscos",
      "institution": "University of Athens, Athens, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100356108",
      "orcid": "missing"
    },
    {
      "name": "Rowan Thorpe",
      "institution": "Open Lab: Athens, Athens, Greece",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162026",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    },
    {
      "name": "Johannes Schöning",
      "institution": "University of Bremen, Bremen, Germany",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Solidarity for All. 2014. Building hope against fear and devastation. Retrieved from https://goo.gl/Vd68uT",
      "doi": ""
    },
    {
      "text": "Paul M Aoki, R J Honicky, Alan Mainwaring, et al. 2009. A Vehicle for Research: Using Street Sweepers to Explore the Landscape of Environmental Community Action. ACM Transactions on Computer-Human Interaction: 10. http://doi.org/10.1145/1518701.1518762",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Athina Arampatzi. 2014. Resisting austerity: the spatial politics of solidarity and struggle in Athens, Greece.",
      "doi": ""
    },
    {
      "text": "Athina Arampatzi. 2016. The spatiality of counterausterity politics in Athens, Greece: Emergent \"urban solidarity spaces.\" Urban Studies: 42098016629311.",
      "doi": ""
    },
    {
      "text": "Athina Arampatzi and Walter J. Nicholls. 2012. The urban roots of anti-neoliberal social movements: The case of Athens, Greece. Environment and Planning A 44, 11: 2591--2610. http://doi.org/10.1068/a44416 ",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A location-mapping mobile application for breastfeeding women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1709--1718.  ",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: working with marginalised social movements. CoDesign 8, 2--3: 127--144.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. http://doi.org/10.1191/1478088706qp063oa ",
      "doi": ""
    },
    {
      "text": "Manuel Castells. 2012. Where are the \"indignados\" going? La Vanguardia. Retrieved September 21, 2016 from https://goo.gl/7wL06M",
      "doi": ""
    },
    {
      "text": "Manuel Castells. 2015. Networks of outrage and hope: Social movements in the Internet age. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2012. Mic check! Media cultures and the Occupy movement. Social movement studies 11, 3--4: 375--385.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C Wright, and Patrick Olivier. 2014. A pool of dreams: facebook, politics and the emergence of a social movement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3573--3582.",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon Bowen, Peter Wright, and Patrick Olivier. 2015. Contesting the City: Enacting the Political Through Digitally Supported Urban Walks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2853--2862.  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Clara Crivellaro, Alex Taylor, Vasilis Vlachokyriakos, Rob Comber, Bettina Nissen, and Pete Wright. 2016. Re-making places: HCI, \"Community Building\" and Change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858332"
    },
    {
      "text": "Lincoln Dahlberg. 2011. Re-constructing digital democracy: An outline of four \"positions.\" new media & society: 1461444810389569.",
      "doi": ""
    },
    {
      "text": "Javier Ramos Diaz and Bruno González Cacheda. 2016. Financing Social Activism: Crowdfunding and Advocatory Social Movement in Spain in Times of Crisis. In Proceedings of the 9th International Conference on Theory and Practice of Electronic Governance, 139--148.  ",
      "doi": "10.1145/2910019.2910053"
    },
    {
      "text": "Jill P Dimond, Michaelanne Dye, Daphne LaRose, and Amy S Bruckman. 2013. Hollaback!: the role of storytelling online in a social movement organization. In Proceedings of the 2013 conference on Computer supported cooperative work, 477--490.",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Carl DiSalvo. 2010. Design, Democracy and Agonistic Pluralism. Proceedings of the design research society conference.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. The MIT Press.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Paul Dourish. 2010. HCI and environmental sustainability: the politics of design and the design of politics. In Proceedings of the Designing Interactive Systems Conference, 1--10. http://doi.org/10.1145/1858171.1858173  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Andrew Feenberg and Alastair Hannay. 1995. Technology and the Politics of Knowledge.",
      "doi": ""
    },
    {
      "text": "Andy Garbett, Rob Comber, Edd Jenkins, and Patrick Olivier. 2016. App Movement: A Platform for Community Commissioning of Mobile Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858094"
    },
    {
      "text": "Keith Hart, Jean-Louis Laville, and Antonio David Cattani. 2010. The human economy.",
      "doi": ""
    },
    {
      "text": "David Harvey. 2000. Spaces of hope. University of CA Press.",
      "doi": ""
    },
    {
      "text": "Gillian R Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 3: 15.",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Philip N Howard, Aiden Duffy, Deen Freelon, Muzammil Hussain, Will Mari, and Marwa Mazaid. 2011. Opening closed regimes: what was the role of social media during the Arab Spring? In Project on Information Technology and Political Islam, 1--30.",
      "doi": ""
    },
    {
      "text": "Emily Kawano, Thomas Neal Masterson, and Jonathan Teller-Elsberg. 2009. Solidarity economy I: Building alternatives for people and planet. Center for Popular Economics, Amherst, MA, USA.",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Mark Lochrie, Paul Coulton, and Jon Whittle. 2014. BARTER: promoting local spending behavior. In CHI'14 Extended Abstracts on Human Factors in Computing Systems, 1933--1938.  ",
      "doi": "10.1145/2559206.2581306"
    },
    {
      "text": "Yong Ming Kow, Yubo Kou, Bryan Semaan, and Waikuen Cheng. 2016. Mediating the Undercurrents: Using Social Media to Sustain a Social Movement. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3883--3894. http://doi.org/10.1145/2858036.2858186  ",
      "doi": "10.1145/2858036.2858186"
    },
    {
      "text": "Ernesto Laclau and Chantal Mouffe. 2001. Hegemony and socialist strategy: Towards a radical democratic politics. Verso.",
      "doi": ""
    },
    {
      "text": "Lila Leontidou. 2010. Urban social movements in \"weak\" civil societies: The right to the city and cosmopolitan activism in Southern Europe. Urban Studies 47, 6: 1179--1203. ",
      "doi": ""
    },
    {
      "text": "David Lewis and Nazneen Kanji. 2009. Nongovernmental organizations and development. Routledge.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2011. The politics of representing cultures in ubiquitous media: challenging national cultural norms by studying a map with Indian and British users. Personal and Ubiquitous Computing 15, 6: 585--596.  ",
      "doi": "10.1007/s00779-010-0339-z"
    },
    {
      "text": "Chris J Martin. 2016. The sharing economy: A pathway to sustainability or a nightmarish form of neoliberal capitalism? Ecological Economics 121: 149--159.",
      "doi": ""
    },
    {
      "text": "Andrés Monroy-Hernández, Shelly Farnham, Emre Kiciman, Scott Counts, and Munmun De Choudhury. 2013. Smart societies: from citizens as sensors to collective action. interactions 20, 4: 16--19.",
      "doi": ""
    },
    {
      "text": "Chantal Mouffe. 2000. The democratic paradox. Verso.",
      "doi": ""
    },
    {
      "text": "Chantal Mouffe. 2005. On the political. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Sissel Olander, Tau Ulv Lenskjold, Signe Louise Yndigegn, and Maria Foverskov. 2011. Mobilizing for community building and everyday innovation. interactions 18, 4: 28--32.",
      "doi": ""
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics: taking a local turn. interactions 22, 4: 61--63.",
      "doi": ""
    },
    {
      "text": "Andrea Parker, Vasudhara Kantroo, Hee Rin Lee, Miguel Osornio, Mansi Sharma, and Rebecca E Grinter. 2012. Health promotion as activism: building community capacity to effect social change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 99--108.  ",
      "doi": "10.1145/2207676.2207692"
    },
    {
      "text": "Pamela Pietrucci. 2011. \"Poetic\" publics: Agency and rhetorics of 'netroots' activism in post-earthquake L'Aquila. The Journal of Community Informatics 6, 3.",
      "doi": ""
    },
    {
      "text": "Theodoros Rakopoulos. 2014. The crisis seen from below, within, and against: from solidarity economy to food distribution cooperatives in Greece. Dialectical Anthropology 38, 2: 189--207. ",
      "doi": ""
    },
    {
      "text": "Theodoros Rakopoulos. 2014. Resonance of solidarity: meanings of a local concept in anti-austerity Greece. Journal of Modern Greek Studies 32, 2: 313--337. ",
      "doi": ""
    },
    {
      "text": "Theodoros Rakopoulos. 2015. \"Movementality\", Economic Democracy and Social Reproduction during Crisis. Economy for and Against Democracy 2: 161.",
      "doi": ""
    },
    {
      "text": "Joan Roelofs. 1995. The third sector as a protective layer for capitalism. Monthly Review 47, 4: 16.",
      "doi": ""
    },
    {
      "text": "Saqib Saeed, Markus Rohde, and Volker Wulf. 2011. Analyzing political activists' organization practices: findings from a long term case study of the european social forum. Computer Supported Cooperative Work (CSCW) 20, 4--5: 265--304.",
      "doi": "10.1007/s10606-011-9144-0"
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 767--776.  ",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "Trebor Scholz. 2014. Platform Cooperativism vs. the Sharing Economy. Medium. Retrieved January 8, 2016 from https://goo.gl/EowzuJ",
      "doi": ""
    },
    {
      "text": "Patrick C Shih, Victoria Bellotti, Kyungsik Han, and John M Carroll. 2015. Unequal time for unequal value: Implications of differing motivations for participation in timebanking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1075--1084.",
      "doi": "10.1145/2702123.2702560"
    },
    {
      "text": "M Silberman, Lisa Nathan, Bran Knowles, et al. 2014. Next steps for sustainable HCI. interactions 21, 5: 66-- 69.",
      "doi": ""
    },
    {
      "text": "Dimitris A Sotiropoulos and Dimitris Bourikos. 2014. Economic crisis, social solidarity and the voluntary sector in Greece. Journal of Power, Politics & Governance 2, 2: 33--53.",
      "doi": ""
    },
    {
      "text": "Eleni-Revekka Staiou. 2016. Organosi20.gr. Retrieved September 21, 2016 from https://goo.gl/Nl9PNJ",
      "doi": ""
    },
    {
      "text": "Ali Tayebi. 2013. Planning activism: using social media to claim marginalized citizens' right to the city. Cities 32: 88--93. ",
      "doi": ""
    },
    {
      "text": "Alex S Taylor, Siân Lindley, Tim Regan, et al. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2863--2872.",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Sherry Turkle. 2012. Alone together: Why we expect more from technology and less from each other. Basic books.",
      "doi": ""
    },
    {
      "text": "Tyler Veak. 2000. Whose technology? Whose modernity? Questioning Feenberg's questioning technology. Science, technology, & human values 25, 2: 226--237. ",
      "doi": ""
    },
    {
      "text": "Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, et al. 2014. PosterVote: Expanding the Action Repertoire for Local Political Activism. In Proceedings of the Designing Interactive Systems Conference.  ",
      "doi": "10.1145/2598510.2598523"
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Christopher A Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics: Citizen Empowerment With and Through Technology. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 1096--1099.  ",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "Volker Wulf, Konstantin Aal, Ibrahim Abu Kteish, et al. 2013. Fighting against the wall: social media use by political activists in a Palestinian village. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1979--1988.  ",
      "doi": "10.1145/2470654.2466262"
    },
    {
      "text": "Volker Wulf, Kaoru Misaki, Meryem Atam, David Randall, and Markus Rohde. 2013. \"On the ground\" in Sidi Bouzid: investigating social media use during the tunisian revolution. In Proceedings of the 2013 conference on Computer supported cooperative work, 1409--1418.",
      "doi": "10.1145/2441776.2441935"
    }
  ]
}