{
  "doi": "10.1145/3025453.3025748",
  "title": "Videos of Things: Speculating on, Anticipating and Synthesizing Technological Mediations",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4489-4500",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper we present Videos of Things: videos that portray the mediated, lived world of computational artifacts informed by postphenomenology. In a post-phenomenological understanding, things and us are interdependent in that they mutually shape each other. And as a whole, technology or designed things mediate the relations between our world and us. This can be a challenge for designers. Through the making of design videos, we explored narrative strategies for creating stories featuring technological mediation. These include humanness, patterns in time, and non-human ensembles. We reflect on how the videos at different stages of the design process have helped to a) speculate on technological mediated relationships, b) synthesize and reflect on qualitative data on technological mediation and c) anticipate technological mediation. The paper contributes different narrative strategies for design videos and the role these videos can play within a design process aimed at elaborating the mediated qualities of technologies.",
  "authors": [
    {
      "name": "Doenja Oogjes",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-99658985626/rel-imgonly/img_7637_crop.jpg",
      "acmid": "99658985626",
      "orcid": "0000-0002-4398-5060"
    },
    {
      "name": "Ron Wakkary",
      "institution": "Simon Fraser University & Eindhoven University of Technology, Surrey , BC, Canada",
      "img": "/do/10.1145/contrib-81100283877/rel-imgonly/img_3637_400x400.jpeg",
      "acmid": "81100283877",
      "orcid": "0000-0003-2073-715X"
    }
  ],
  "references": [
    {
      "text": "Wiebe E. Bijker. 1997. Of Bicycles, Bakelites, and Bulbs: Toward a Theory of Sociotechnical Change. MIT Press.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2015. Practical Products for Centenarian Spies. interactions 22, 2: 18--19.  ",
      "doi": "10.1145/2734887"
    },
    {
      "text": "Albert Borgmann. 1987. Technology and the Character of Contemporary Life: A Philosophical Inquiry. The University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Pam Briggs, Mark Blythe, John Vines, Stephen Lindsay, Paul Dunphy, James Nicholson, David Green, Jim Kitson, Andrew Monk, and Patrick Olivier. 2012. Invisible Design: Exploring Insights and Ideas Through Ambiguous Film Scenarios. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 534--543.  ",
      "doi": "10.1145/2317956.2318036"
    },
    {
      "text": "John M. Carroll (ed.). 199 Scenario-based Design: Envisioning Work and Technology in System Development. John Wiley & Sons, Inc., NY, NY, USA. ",
      "doi": "10.5555/209227"
    },
    {
      "text": "Alan Cooper. 2004. The Inmates Are Running the Asylum: Why High Tech Products Drive Us Crazy and How to Restore the Sanity. Sams - Pearson Education, Indianapolis, IN. ",
      "doi": "10.5555/984201"
    },
    {
      "text": "Lorenzo Davoli and Johan Redström. 2014. Materializing Infrastructures for Participatory Hacking. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14), 121--130.  ",
      "doi": "10.1145/2598510.2602961"
    },
    {
      "text": "Audrey Desjardins and Ron Wakkary. 2013. Manifestations of Everyday Design: Guiding Goals and Motivations. In Proceedings of the 9th ACM Conference on Creativity & Cognition (C&C '13), 253--262.  ",
      "doi": "10.1145/2466627.2466643"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2014. Speculative Everything: Design, Fiction, and Social Dreaming. MIT Press, Cambridge, Massachusetts?; London. ",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. Technological Dream Series: No. 1, Robots. Retrieved September 21, 2016 from https://vimeo.com/2611597",
      "doi": ""
    },
    {
      "text": "ECAL. ECAL \"Delirious Home\" - Milano 2014. Retrieved September 21, 2016 from https://vimeo.com/90425702",
      "doi": ""
    },
    {
      "text": "Ericsson. The Social Web of Things. Retrieved September 21, 2016 from https://www.youtube.com/watch?v=1syj_2jfJ4g",
      "doi": ""
    },
    {
      "text": "Everyday Design Studio. Vincent & Vincent - Tilting Bowl - Everyday Design Studio. Retrieved September 21, 2016 from https://vimeo.com/174882812",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2011. The New Good: Exploring the Potential of Philosophy of Technology to Contribute to Human-computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 1051--1060.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "BJ Fogg. 2009. A Behavior Model for Persuasive Design. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive '09), 40:1--40:7.  ",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Bill Gaver and Heather Martin. 2000. Alternatives: Exploring Information Appliances Through Conceptual Design Proposals. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00), 209--2  ",
      "doi": "10.1145/332040.332433"
    },
    {
      "text": "William Gaver. 2007. Cultural commentators: Non-native interpretations as resources for polyphonic assessment. International Journal of Human-Computer Studies 65, 4: 292--305.  ",
      "doi": "10.1016/j.ijhcs.2006.11.014"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The Drift Table: Designing for Ludic Engagement. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04), 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Elisa Giaccardi, Nazli Cila, Chris Speed, and Melissa Caldwell. 2016. Thing Ethnography: Doing Design Research with Non-Humans. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 377--387.  ",
      "doi": "10.1145/2901790.2901905"
    },
    {
      "text": "Google. Project Glass: One day... Retrieved September 21, 2016 from https://www.youtube.com/watch?v=9c6W4CCU9M4",
      "doi": ""
    },
    {
      "text": "Giulio Iacucci, Kari Kuutti, and Mervi Ranta. 2000. On the Move with a Magic Thing: Role Playing in Concept Design of Mobile Services and Devices. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00), 193--202.  ",
      "doi": "10.1145/347642.347715"
    },
    {
      "text": "Don Ihde. 1990. Technology and the Lifeworld: From Garden to Earth. Indiana University Press, Bloomington.",
      "doi": ""
    },
    {
      "text": "Chris Keeney. 2014. Petcam: The World Through the Lens of Our Four-Legged Friends. Princeton Architectural Press, NY.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2007. Reassembling the Social: An Introduction to Actor-Network-Theory. Oxford University Press, Oxford; NY.",
      "doi": ""
    },
    {
      "text": "Clara Mancini, Yvonne Rogers, Arosha K. Bandara, Tony Coe, Lukasz Jedrzejczyk, Adam N. Joinson, Blaine A. Price, Keerthi Thomas, and Bashar Nuseibeh. 2010. Contravision: Exploring Users' Reactions to Futuristic Technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 153--162.  ",
      "doi": "10.1145/1753326.1753350"
    },
    {
      "text": "Ramia Mazé and Johan Redström. 2005. Form and the computational object. Digital Creativity 16, 1: 7--18.",
      "doi": ""
    },
    {
      "text": "Microsoft. Microsoft HoloLens - Transform your world with holograms. Retrieved September 21, 2016 from https://www.youtube.com/watch?v=aThCr0PsyuA",
      "doi": ""
    },
    {
      "text": "Near Future Laboratory. Corner Convenience. Retrieved September 21, 2016 from https://vimeo.com/92325970",
      "doi": ""
    },
    {
      "text": "Lene Nielsen. 2002. From User to Character: An Investigation into User-descriptions in Scenarios. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02), 99--104.  ",
      "doi": "10.1145/778712.778729"
    },
    {
      "text": "William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: An Investigation of Experiences with FutureMe. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 575--584.  ",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "William Odom and Ron Wakkary. 2015. Intersecting with Unaware Objects. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15), 33--42.  ",
      "doi": "10.1145/2757226.2757240"
    },
    {
      "text": "Doenja Oogjes. The Other Half. Retrieved September 21, 2016 from https://vimeo.com/148558555",
      "doi": ""
    },
    {
      "text": "Doenja Oogjes, Miguel Bruns, and Ron Wakkary. 2016. Lyssna: A Design Fiction to Reframe Food Waste. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems (DIS '16 Companion), 109--112.  ",
      "doi": "10.1145/2908805.2909401"
    },
    {
      "text": "John Pruitt and Jonathan Grudin. 2003. Personas: Practice and Theory. In Proceedings of the 2003 Conference on Designing for User Experiences (DUX '03), 1--15.  ",
      "doi": "10.1145/997078.997089"
    },
    {
      "text": "Bas Raijmakers, William W. Gaver, and Jon Bishay. 2006. Design Documentaries: Inspiring Design Research Through Documentary Film. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06), 229--238.  ",
      "doi": "10.1145/1142405.1142441"
    },
    {
      "text": "Robert Rosenberger and Peter-Paul Verbeek. 2015. A post phenomenological field guide. In Post phenomenological investigations: Essays on human--technology relations. 9--41.",
      "doi": ""
    },
    {
      "text": "Elizabeth Shove, Mika Pantzar, and Matt Watson. 2012. The Dynamics of Social Practice: Everyday Life and how it Changes. SAGE Publications Ltd, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Nynke Tromp, Paul Hekkert, and Peter-Paul Verbeek. 2011. Design for Socially Responsible Behavior: A Classification of Influence Based on Intended User Experience. Design Issues 27, 3: 3--19.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2010. What Things Do: Philosophical Reflections on Technology, Agency, and Design. Penn State Press.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2011. Moralizing Technology: Understanding and Designing the Morality of Things. University Of Chicago Press, Chicago?; London.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2015. COVER STORY: Beyond Interaction: A Short Introduction to Mediation Theory. interactions 22, 3: 26--31.  ",
      "doi": "10.1145/2751314"
    },
    {
      "text": "Ron Wakkary, Audrey Desjardins, and Sabrina Hauser. 2015. Unselfconscious Interaction: A Conceptual Construct. Interacting with Computers: iwv018.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary and Leah Maestri. 2007. The Resourcefulness of Everyday Design. In Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition (C&C '07), 163--172.  ",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 2015. Material Speculation: Actual Artifacts for Critical Inquiry. Aarhus Series on Human Centered Computing 1, 1: 12.",
      "doi": "10.7146/aahcc.v1i1.21299"
    }
  ]
}