{
  "doi": "10.1145/3025453.3025600",
  "title": "Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1471-1482",
  "year": 2017,
  "badges": [],
  "abstract": "We explore how to add haptics to walls and other heavy objects in virtual reality. When a user tries to push such an object, our system actuates the user's shoulder, arm, and wrist muscles by means of electrical muscle stimulation, creating a counter force that pulls the user's arm backwards. Our device accomplishes this in a wearable form factor. In our first user study, participants wearing a head-mounted display interacted with objects provided with different types of EMS effects. The repulsion design (visualized as an electrical field) and the soft design (visualized as a magnetic field) received high scores on \"prevented me from passing through\" as well as \"realistic\". In a second study, we demonstrate the effectiveness of our approach by letting participants explore a virtual world in which all objects provide haptic EMS effects, including walls, gates, sliders, boxes, and projectiles.",
  "authors": [
    {
      "name": "Pedro Lopes",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81557182156/rel-imgonly/_pedrolopes_uchicago.jpg",
      "acmid": "81557182156",
      "orcid": "0000-0001-6527-7084"
    },
    {
      "name": "Sijing You",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99659162096/rel-imgonly/profile.png",
      "acmid": "99659162096",
      "orcid": "missing"
    },
    {
      "name": "Lung-Pan Cheng",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81470651683/rel-imgonly/32956970-44d4-41fa-95c3-df5faf94a414_1_201_a.jpeg",
      "acmid": "81470651683",
      "orcid": "0000-0002-7712-8622"
    },
    {
      "name": "Sebastian Marwecki",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558084156",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Anthony D. Kurtz. Tactile feel apparatus for use with robotic operations, U.S. Patent 650, 643, filed January 8, 2007, issued July 10, 2008.",
      "doi": ""
    },
    {
      "text": "M. Bergamasco. The GLAD-IN-ART Project. In Virtual Reality SE-19, 251--258.",
      "doi": ""
    },
    {
      "text": "Brooks Jr., and P. Frederick. What's real about virtual reality? In IEEE Computer Graphics and Applications 19, 6, 16--27, 1999. rotate arm (infraspinatus) arm up (biceps) arm down triceps) wrist up (carpis ulnaris)",
      "doi": ""
    },
    {
      "text": "Daniel K. Y. Chen, Iain A. Anderson, Cameron G. Walker and Thor F. Besier. Lower Extremity Lateral Skin Stretch Perception for Haptic Feedback. In Haptics IEEE Transactions, 9, 62--68, 2016.",
      "doi": "10.1109/TOH.2016.2516012"
    },
    {
      "text": "Farzam Farbiz, Zhou Hao Yu, Corey Manders, and Waqas Ahmad. An electrical muscle stimulation haptic feedback for mixed reality tennis game. In ACM SIGGRAPH 2007 posters (SIGGRAPH '07), Article 140.",
      "doi": ""
    },
    {
      "text": "James D. Foley. Interfaces for advanced computing. Sci. Am. 257, 4, 126--135, 1987.  ",
      "doi": "10.1038/scientificamerican1087-126"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, N. Cheng, and Hiroshii Ishii. Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 519--528.",
      "doi": ""
    },
    {
      "text": "Grigore C. Burdea. Haptic Issues in Virtual Environments. In Proceedings of Computer Graphics International (GCI '00), 2000.",
      "doi": ""
    },
    {
      "text": "P. Gruenbaum, W. McNeely, H. Sowizral, T. Overman, and B. Knutson. Implementation of dynamic robotic graphics for a virtual control panel. In Proc. Presence'97, 118--126.  ",
      "doi": "10.1162/pres.1997.6.1.118"
    },
    {
      "text": "Heather Culbertson, Juan Jose Lopez Delgado, Katherine J. Kuchenbecker. One hundred data-driven haptic texture models and open-source methods for rendering on 3d objects. In Proc. IEEE Haptics Symposium, 2014. ",
      "doi": ""
    },
    {
      "text": "J. Hollerbach and S. Jacobsen. Haptic Interfaces for Teleoperation and Virtual Environments. In Proc. Workshop on Simulation and Interaction in Virtual Environments'95, 13--15.",
      "doi": ""
    },
    {
      "text": "B.E. Insko. Passive haptics significantly enhances virtual environments. Dissertation at University of North Carolina at Chapel Hill, 2001.",
      "doi": "10.5555/933178"
    },
    {
      "text": "S. Jeong, N. Hashimoto, and S. Makoto A novel interaction system with force feedback between real - and virtual human: an entertainment system: \"virtual catch ball\". In Proc. ACE'04, 61--66.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. Traxion: a tactile interaction device with virtual force sensation. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13), 427--432.",
      "doi": ""
    },
    {
      "text": "K.E. Overvlieta, J.B.J. Smeetsa, and E. Brennera. The use of proprioception and tactile information in haptic search. In Acta Psychologica 129, 1, 83--90, 2008. ",
      "doi": ""
    },
    {
      "text": "Kazuki Nagai, Soma Tanoue, Katsuhito Akahane, and Makoto Sato. Wearable 6-DoF wrist haptic device \"SPIDAR-W\". In SIGGRAPH Asia 2015 Haptic Media And Contents Design (SA '15), Article 19.",
      "doi": ""
    },
    {
      "text": "J. Kramer. Force feedback and Texture Simulating Interface device, U.S. Patent 5, 184, 319.",
      "doi": ""
    },
    {
      "text": "A. Kron, and G. Schmidt. Multi-fingered Tactile Feedback from Virtual and Remote Environments. In Proc. HAPTICS'03, 16--23. ",
      "doi": ""
    },
    {
      "text": "W. Lindeman, Y. Yanagida, H. Noma, and K. Hosaka. Wearable vibrotactile systems for virtual contact and information display. In Virtual Reality 9, 2, 203--213, 2006.  ",
      "doi": "10.5555/3227221.3227399"
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. Muscle-propelled force feedback: bringing force feedback to mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 25772580.",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. TurkDeck: Physical Virtual Reality Based on People. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 417426.  ",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Luv Kohli, Eric Burns, Dorian Miller, and Henry Fuchs. Combining passive haptics with redirected walking. In Proceedings of the 2005 International Conference on Augmented Teleexistence 57, 4, 253--254.  ",
      "doi": "10.1145/1152399.1152451"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1968--1979.",
      "doi": ""
    },
    {
      "text": "Martin Usoh, Kevin Arthur, Mary C. Whitton, Rui Bastos, Anthony Steed, Mel Slater, and Frederick P. Brooks, Jr. Walking &gt; walking-in-place &gt; flying, in virtual environments. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques (SIGGRAPH '99), 359--364.  ",
      "doi": "10.1145/311535.311589"
    },
    {
      "text": "Max Pfeiffer, Tim Dünte, Stefan Schneegass, Florian Alt, and Michael Rohs. Cruise Control for Pedestrians: Controlling Walking Direction using Electrical Muscle Stimulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2505--2514.  ",
      "doi": "10.1145/2702123.2702190"
    },
    {
      "text": "Mohamed Benali-Khoudja, Moustapha Hafez, JeanMarc Alexandre, and A. Kheddar. Tactile interfaces: a state-of-the-art survey, In Proceedings of International Symposium on Robotics (ISR'04).",
      "doi": ""
    },
    {
      "text": "Murayama, J., Bougrila, L., Luo, Y., Akahane, K., Hasegawa, S., Hirsbrunner, B., Sato, M. SPIDAR G&G: a two-handed haptic interface for bimanual VR interaction. In Proc. EuroHaptics'04, 138-- 146.",
      "doi": ""
    },
    {
      "text": "G. Norman. Likert scales, levels of measurement, and the \"laws\" of statistics. In Advances in Health Sciences Education 15, 5, 625--632, 2010. ",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15), 1119.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "P. Strojnik, A. Kralj, and I. Ursic. Programmed sixchannel electrical stimulator for complex stimulation of leg muscles during walking. In IEEE Trans. Biomed. Eng. 26, 112.",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. PossessedHand: techniques for controlling human hands using electrical muscles stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 543--552.  ",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Timothy M. Simon, Ross T. Smith, and Bruce H. Thomas. Wearable jamming mitten for virtual environment haptics. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14), 67--70.",
      "doi": ""
    },
    {
      "text": "Dzmitry Tsetserukou, Katsunari Sato, and Susumu Tachi. ExoInterfaces: novel exosceleton haptic interfaces for virtual reality, augmented sport and rehabilitation. In Proceedings of the 1st Augmented Human International Conference (AH '10), article 1.  ",
      "doi": "10.1145/1785455.1785456"
    },
    {
      "text": "A. McNeely. Robotic graphics: a new approach to force feedback for virtual reality. In Proceedings of the Annual IEEE International Symposium on Virtual Reality, 336--341, 1999.",
      "doi": ""
    },
    {
      "text": "William R. Sherman and Alan B. Craig. Understanding Virtual Reality: Interface, Application, and Design. ed. Morgan Kaufmann, Series in Computer Graphics.",
      "doi": ""
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1991--1995.",
      "doi": ""
    },
    {
      "text": "Y. Yokokohji, Y. Sugawara, J. Kinoshita, and Yoshikawa T. Mechano-Media that Transmit Kinesthetic Knowledge from a Human to Other Humans. In Proc. Robotics Research'01, 499--512. ",
      "doi": ""
    }
  ]
}