{
  "doi": "10.1145/3025453.3025921",
  "title": "Class Confessions: Restorative Properties in Online Experiences of Socioeconomic Stigma",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3377-3389",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we examine stigma related to class identity online through an empirical examination of Elite University Class Confessions (EUCC). EUCC is an online space that includes a Facebook page and a surrounding sociotechnical ecosystem. It is a community of, for, and about low-income and first generation students at an elite university. By bringing in a community that learns and engages with users' socioeconomic struggles, EUCC engenders unique restorative properties for students experiencing class stigma. EUCC's restorative properties foster new ways of understanding one's stigmatized identity through meaning- making interactions in a networked sociotechnical system. We discuss how EUCC's design shapes the nature of user interactions around class stigma, and explore in depth how people experience stigma differently through the restorative properties of EUCC.",
  "authors": [
    {
      "name": "Eugenia Ha Rim Rho",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161058",
      "orcid": "missing"
    },
    {
      "name": "Oliver L. Haimson",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-87958760357/rel-imgonly/haimson.jpg",
      "acmid": "87958760357",
      "orcid": "0000-0001-6552-4540"
    },
    {
      "name": "Nazanin Andalibi",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958798457",
      "orcid": "0000-0002-3257-2527"
    },
    {
      "name": "Melissa Mazmanian",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467671821",
      "orcid": "missing"
    },
    {
      "name": "Gillian R. Hayes",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592620",
      "orcid": "0000-0003-0966-8739"
    }
  ],
  "references": [
    {
      "text": "Vibe Aarkrog and Christian Helms Jørgensen. 2008. Divergence and Convergence in Education and Work. Peter Lang. ",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L. Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding Social Media Disclosures of Sexual Abuse Through the Lenses of Support Seeking and Anonymity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 3906--3918. https://doi.org/10.1145/2858036.2858096",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self- disclosures, Responses, and Social Support on Instagram: the Case of #Depression. In Proceedings of the 20th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '17). https://doi.org/http://dx.doi.org/10.1145/2998181.29982",
      "doi": ""
    },
    {
      "text": "Elizabeth Aries and Maynard Seider. The Interactive Relationship Between Class Identity and the College Experience: The Case of Lower Income Students. Retrieved August 1, 2016 from http://itp.wceruw.org/documents/Aries_Seider_2005_TheInteractiveRelationshipBetweenClassIdentityandtheCollegeExperience.pdf",
      "doi": ""
    },
    {
      "text": "Emily Badger. 2015. The Surprising Cost of Growing Up Poor In the Shadow of Wealth. Washington Post. Retrieved September 15, 2016 from https://www.washingtonpost.com/news/wonk/wp/2015/01/23/the-surprising-cost-of-growing-up-poor-in-theshadow-of-wealth/",
      "doi": ""
    },
    {
      "text": "Jeremy Birnholtz, Nicholas Aaron Ross Merola, and Arindam Paul. 2015. \"Is It Weird to Still Be a Virgin\": Anonymous, Locally Targeted Questions on Facebook Confession Boards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2613--2622. https://doi.org/10.1145/2702123.2702410",
      "doi": "10.1145/2702123.2702410"
    },
    {
      "text": "Geoffrey C. Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT press.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Danah Boyd. 2008. Taken Out of Context: American Teen Sociality in Networked Publics. University of California, Berkeley. Retrieved December 17, 2016 from http://www.danah.org/papers/TakenOutOfContext.html",
      "doi": ""
    },
    {
      "text": "Danah Boyd. 2010. Social Network Sites as Networked Publics: Affordances, Dynamics, and Implications. ResearchGate. Retrieved December 30, 2016 from https://www.researchgate.net/publication/265035948_Social_Network_Sites_as_Networked_Publics_Affordances_Dynamics_and_Implications",
      "doi": ""
    },
    {
      "text": "Alberto F. Cabrera and Steven M. La Nasa. 2001. On the Path to College: Three Critical Tasks Facing America's Disadvantaged. Research in Higher Education 42, 2: 119--149. https://doi.org/10.1023/A:1026520002362 ",
      "doi": ""
    },
    {
      "text": "Caleb T. Carr, D. Yvette Wohn, and Rebecca A. Hayes. 2016. as social support: Relational closeness, automaticity, and interpreting social support from paralinguistic digital affordances in social media. Computers in Human Behavior 62: 385--393. https://doi.org/10.1016/j.chb.2016.03.087  ",
      "doi": "10.1016/j.chb.2016.03.087"
    },
    {
      "text": "Hui-Tzu Grace Chou and Nicholas Edge. 2011. \"They Are Happier and Having Better Lives than I Am\": The Impact of Using Facebook on Perceptions of Others' Lives. Cyberpsychology, Behavior, and Social Networking 15, 2: 117--121. https://doi.org/10.1089/cyber.2011.0324 ",
      "doi": ""
    },
    {
      "text": "Neil S. Coulson, Heather Buchanan, and Aimee Aubeeluck. 2007. Social support in cyberspace: A content analysis of communication within a Huntington's disease online support group. Patient Education and Counseling 68, 2: 173--178. https://doi.org/10.1016/j.pec.2007.06.002 ",
      "doi": ""
    },
    {
      "text": "Constantinos K. Coursaris and Ming Liu. 2009. An analysis of social support exchanges in online HIV/AIDS self-help groups. Computers in Human Behavior 25, 4: 911--918. https://doi.org/10.1016/j.chb.2009.03.006  ",
      "doi": "10.1016/j.chb.2009.03.006"
    },
    {
      "text": "Jennifer Crocker and Brenda Major. 1989. Social stigma and self-esteem: The self-protective properties of stigma. Psychological Review 96, 4: 608--630. https://doi.org/10.1037/0033--295X.96.4.608 ",
      "doi": ""
    },
    {
      "text": "Jean-Claude Croizet and Theresa Claire. 1998. Extending the Concept of Stereotype Threat to Social Class: The Intellectual Underperformance of Students from Low Socioeconomic Backgrounds. Personality and Social Psychology Bulletin 24, 6: 588--594. https://doi.org/10.1177/0146167298246003 ",
      "doi": ""
    },
    {
      "text": "Robert Crosnoe. 2009. Low-Income Students and the Socioeconomic Composition of Public High Schools. American Sociological Review 74, 5: 709--730. https://doi.org/10.1177/000312240907400502 ",
      "doi": ""
    },
    {
      "text": "Carolyn E. Cutrona and Julie A. Suhr. 1992. Controllability of Stressful Events and Satisfaction With Spouse Support Behaviors. Communication Research 19, 2: 154--174. https://doi.org/10.1177/009365092019002002 ",
      "doi": ""
    },
    {
      "text": "Alexa Davis. Food Insecurity On Campus: Is Your Ivy Leaguer Starving? Forbes. Retrieved August 1, 2016 from http://www.forbes.com/sites/alexadavis/2015/12/17/food-insecurity-on-campus-is-your-ivy-leaguer-starving/",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos and Mor Naaman. 2011. Towards Quality Discourse in Online News Comments. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11), 133--142. https://doi.org/10.1145/1958824.1958844",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "Judith Donath. 1999. Identity and deception in the virtual community. In Communities in Cyberspace. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Kristen Campbell Eichhorn. 2008. Soliciting and Providing Social Support Over the Internet: An Investigation of Online Eating Disorder Support Groups. Journal of Computer-Mediated Communication 14, 1: 67--78. https://doi.org/10.1111/j.10836101.2008.01431.x ",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, D. Yvette Wohn, and Michael G. Brown. 2014. Social Media and College Access. interactions 21, 4: 62--65. https://doi.org/10.1145/2630008",
      "doi": "10.1145/2630008"
    },
    {
      "text": "Jolene Galegher, Lee Sproull, and Sara Kiesler. 1998. Legitimacy, Authority, and Community in Electronic Support Groups. Written Communication 15, 4: 493--530. https://doi.org/10.1177/0741088398015004003 ",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2014. An Introduction to Discourse Analysis: Theory and Method. Routledge.",
      "doi": ""
    },
    {
      "text": "Kenneth Gergen. 1992. The Saturated Self: Dilemmas of Identity in Contemporary Life. Basic Books.",
      "doi": ""
    },
    {
      "text": "Anthony Giddens. 1991. Modernity and Self-identity: Self and Society in the Late Modern Age. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1956. The presentation of self in everyday life. University of Edinburgh, Edinburgh.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 2009. Stigma: Notes on the Management of Spoiled Identity. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Robert Granfield. 1991. MAKING IT BY FAKING IT Working-Class Students in an Elite Academic Environment. Journal of Contemporary Ethnography 20, 3: 331--351. https://doi.org/10.1177/089124191020003005 ",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1176--1190. https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L. Haimson and Anna Lauren Hoffmann. 2016. Constructing and enforcing \"authentic\" identity online: Facebook, real names, and non-normative identities. First Monday 21, 6. Retrieved August 29, 2016 from http://firstmonday.org/ojs/index.php/fm/article/view/679 ",
      "doi": ""
    },
    {
      "text": "D. Fox Harrell. 2009. Computational and Cognitive Infrastructures of Stigma: Empowering Identity in Social Computing and Gaming. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (C&C '09), 49--58. https://doi.org/10.1145/1640233.1640244",
      "doi": "10.1145/1640233.1640244"
    },
    {
      "text": "Matthew Heston and Jeremy Birnholtz. 2016. (In)visible cities: an exploration of social identity, anonymity and location-based filtering on yik yak. https://doi.org/10.9776/16152",
      "doi": ""
    },
    {
      "text": "B. Hogan. 2010. The Presentation of Self in the Age of Social Media: Distinguishing Performances and Exhibitions Online. Bulletin of Science, Technology & Society 30, 6: 377--386. https://doi.org/10.1177/0270467610385893 ",
      "doi": ""
    },
    {
      "text": "Grace YoungJoo Jeon, Nicole B. Ellison, Bernie Hogan, and Christine Greenhow. 2016. First-Generation Students and College: The Role of Facebook Networks As Information Sources. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 887--899. https://doi.org/10.1145/2818048.2820074",
      "doi": "10.1145/2818048.2820074"
    },
    {
      "text": "Sarah E. Johnson, Jennifer A. Richeson, and Eli J. Finkel. 2011. Middle class and marginal? Socioeconomic status, stigma, and self-regulation at an elite university. Journal of Personality and Social Psychology 100, 5: 838--852. https://doi.org/10.1037/a0021956 ",
      "doi": ""
    },
    {
      "text": "Alexandra Juhasz. 2012. An Idea Whose Time is Here: FemTechNet -- A Distributed Online Collaborative Course (DOCC). Ada: A Journal of Gender, New Media, and Technology. Retrieved December 28, 2016 from http://adanewmedia.org/2012/11/issue1-juhasz/",
      "doi": ""
    },
    {
      "text": "Martin Lea, Russell Spears, and Daphne de Groot. 2001. Knowing Me, Knowing You: Anonymity Effects on Social Identity Processes within Groups. Personality and Social Psychology Bulletin 27, 5: 526--537. https://doi.org/10.1177/0146167201275002 ",
      "doi": ""
    },
    {
      "text": "Barbara L. Ley. 2007. Vive Les Roses!: The Architecture of Commitment in an Online Pregnancy and Mothering Group. Journal of Computer-Mediated Communication 12, 4: 1388--1408. https://doi.org/10.1111/j.10836101.2007.00378.x ",
      "doi": ""
    },
    {
      "text": "Noëmi Manders-Huits. 2010. Practical versus moral identities in identity management. Ethics and Information Technology 12, 1: 43--55. https://doi.org/10.1007/s10676-010--9216--8  ",
      "doi": ""
    },
    {
      "text": "Heidi Mattson. 2013. Ivy League Stripper: A Memoir. Skyhorse Publishing, Inc.",
      "doi": ""
    },
    {
      "text": "George Herbert Mead. 2009. Mind, Self, and Society: From the Standpoint of a Social Behaviorist. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Soraya Mehdizadeh. 2010. Self-Presentation 2.0: Narcissism and Self-Esteem on Facebook. Cyberpsychology, Behavior, and Social Networking 13, 4: 357--364. https://doi.org/10.1089/cyber.2009.0257 ",
      "doi": ""
    },
    {
      "text": "Tsubasa Morioka, Nicole B. Ellison, and Michael Brown. 2016. Identity Work on Social Media Sites: Disadvantaged Students' College Transition Processes. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 848--859. https://doi.org/10.1145/2818048.2819959",
      "doi": "10.1145/2818048.2819959"
    },
    {
      "text": "Candice L. Odgers, Sachiko Donley, Avshalom Caspi, Christopher J. Bates, and Terrie E. Moffitt. 2015. Living alongside more affluent neighbors predicts greater involvement in antisocial behavior among low-income boys. Journal of Child Psychology and Psychiatry 56, 10: 1055--1064. https://doi.org/10.1111/jcpp.12380 ",
      "doi": ""
    },
    {
      "text": "Joan M. Ostrove. 2003. Belonging and Wanting: Meanings of Social Class Background for Women's Constructions of their College Experiences. Journal of Social Issues 59, 4: 771--784. https://doi.org/10.1046/j.0022--4537.2003.00089.x ",
      "doi": ""
    },
    {
      "text": "Joan M. Ostrove and Susan M. Long. 2001. White Women's Social Class Identity and the College Experience. Retrieved August 1, 2016 from http://eric.ed.gov/?id=ED457510",
      "doi": ""
    },
    {
      "text": "Joan M Ostrove and Susan M Long. 2007. Social Class and Belonging: Implications for College Adjustment. The Review of Higher Education 30, 4: 363--389. https://doi.org/10.1353/rhe.2007.0028 ",
      "doi": ""
    },
    {
      "text": "S. D. Reicher, R. Spears, and T. Postmes. 1995. A Social Identity Model of Deindividuation Phenomena. European Review of Social Psychology 6, 1: 161--198. https://doi.org/10.1080/14792779443000049 ",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke and Sabine Trepte. 2014. Authenticity and Well-being on Social Network Sites: A Two-wave Longitudinal Study on the Effects of Online Authenticity and the Positivity Bias in SNS Communication. Comput. Hum. Behav. 30: 95--102. https://doi.org/10.1016/j.chb.2013.07.030",
      "doi": "10.1016/j.chb.2013.07.030"
    },
    {
      "text": "Bryce J. Renninger. 2014. \"Where I can be myself -- where I can speak my mind\"?: Networked counter publics in a polymedia environment. New Media & Society: 1461444814530095. https://doi.org/10.1177/1461444814530095",
      "doi": ""
    },
    {
      "text": "Kathryn E. Ringland, Christine T. Wolf, LouAnne E. Boyd, Mark S. Baldwin, and Gillian R. Hayes. 2016. Would You Be Mine: Appropriating Minecraft As an Assistive Technology for Youth with Autism. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 33--41. https://doi.org/10.1145/2982142.2982172",
      "doi": "10.1145/2982142.2982172"
    },
    {
      "text": "Kathryn E. Ringland, Christine T. Wolf, Heather Faucett, Lynn Dombrowski, and Gillian R. Hayes. 2016. \"Will I always be not social?\": Re-Conceptualizing Sociality in the Context of a Minecraft Community for Autism. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems 2016., 1256--1269. https://doi.org/10.1145/2858036.2858038",
      "doi": "10.1145/2858036.2858038"
    },
    {
      "text": "Allucquère Rosanne Stone. 1996. The War of Desire and Technology at the Close of the Mechanical Age. MIT Press.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M. Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The Online Disinhibition Effect. CyberPsychology & Behavior 7, 3: 321--326. https://doi.org/10.1089/1094931041291295 ",
      "doi": ""
    },
    {
      "text": "Ron Suskind. 2010. A Hope in the Unseen: An American Odyssey from the Inner City to the Ivy League. Crown/Archetype.",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 1999. Cyberspace and Identity. Research Gate 28, 6: 643--648. https://doi.org/10.2307/2655534",
      "doi": ""
    },
    {
      "text": "2014. What does poverty look like on social media? Global Social Media Impact Study. Retrieved August 1, 2016 from http://blogs.ucl.ac.uk/global-socialmedia/2014/08/02/how-does-poverty-looks-like-onsocial-media/",
      "doi": ""
    }
  ]
}