{
  "doi": "10.1145/3025453.3025741",
  "title": "WAVES: A Wearable Asymmetric Vibration Excitation System for Presenting Three-Dimensional Translation and Rotation Cues",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4972-4982",
  "year": 2017,
  "badges": [],
  "abstract": "WAVES, a Wearable Asymmetric Vibration Excitation System, is a novel wearable haptic device for presenting three dimensions of translation and rotation guidance cues. In contrast to traditional vibration feedback, which usually requires that users learn to interpret a binary cue, asymmetric vibrations have been shown to induce a pulling sensation in a desired direction. When attached to the fingers, a single voicecoil actuator presents a translation guidance cue and a pair of voicecoil actuators presents a rotation guidance cue. The directionality of mechanoreceptors in the skin led to our choice of the location and orientation of the actuators in order to elicit very strong sensations in certain directions. For example, users distinguished a \"left\" cue versus a \"right\" cue 94.5% of the time. When presented with one of six possible direction cues, users on average correctly identified the direction of translation cues 86.1% of the time and rotation cues 69.0% of the time.",
  "authors": [
    {
      "name": "Heather Culbertson",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-99659147563/rel-imgonly/heatherculbertson.jpg",
      "acmid": "99659147563",
      "orcid": "missing"
    },
    {
      "name": "Julie M. Walker",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658972955",
      "orcid": "missing"
    },
    {
      "name": "Michael Raitor",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160358",
      "orcid": "missing"
    },
    {
      "name": "Allison M. Okamura",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100361592",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2005a. Phantom-DRAWN: direction guidance using rapid and asymmetric acceleration weighted by nonlinearity of perception. In Proc. ACM International Conference on Augmented Tele-Existence. 201--208.  ",
      "doi": "10.1145/1152399.1152436"
    },
    {
      "text": "Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2005b. Virtual force display: Direction guidance using asymmetric acceleration via periodic translational motion. In Proc. IEEE World Haptics Conference. 619--622.  ",
      "doi": "10.1109/WHC.2005.146"
    },
    {
      "text": "Tomohiro Amemiya and Hiroaki Gomi. 2014. Distinct pseudo-attraction force sensation by a thumb-sized vibrator that oscillates asymmetrically. In Haptics: Neuroscience, Devices, Modeling, and Applications. Springer, 88--95.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya and Hiroaki Gomi. 2016. Active Manual Movement Improves Directional Perception of Illusory Force. IEEE Transactions on Haptics 9 (2016).  ",
      "doi": "10.1109/TOH.2016.2587624"
    },
    {
      "text": "Karlin Bark, Emily Hyman, Frank Tan, Elizabeth Cha, Steven A Jax, Laurel J Buxbaum, and Katherine J Kuchenbecker. 2015. Effects of vibrotactile feedback on human learning of arm motions. IEEE Transactions on Neural Systems and Rehabilitation Engineering 23, 1 (2015), 51--63.",
      "doi": ""
    },
    {
      "text": "Jonathan Bell, Stanley Bolanowski, and Mark H. Holmes. 1994. The structure and function of Pacinian corpuscles: A review. Progress in Neurobiology 42, 1 (1994), 79--128.",
      "doi": ""
    },
    {
      "text": "James Biggs and Mandayam Srinivasan. 2002. Tangential versus normal displacements of skin: Relative effectiveness for producing tactile sensations. In Proc. IEEE Haptics Symposium. 121--128. ",
      "doi": "10.5555/795682.797528"
    },
    {
      "text": "Ingvars Birznieks, Per Jenmalm, Antony W Goodwin, and Roland S Johansson. 2001. Encoding of direction of fingertip forces by human tactile afferents. The Journal of Neuroscience 21, 20 (2001), 8222--8237.",
      "doi": ""
    },
    {
      "text": "Stanley J Bolanowski, George A Gescheider, and Ronald T Verrillo. 1994. Hairy skin: psychophysical channels and their physiological substrates. Somatosensory & motor research 11, 3 (1994), 279--290.",
      "doi": ""
    },
    {
      "text": "Roger W Cholewiak, Amy A Collins, and J Christopher Brill. 2001. Spatial factors in vibrotactile pattern perception. In Proc. Eurohaptics Conference. 41--47.",
      "doi": ""
    },
    {
      "text": "David Collett. 2002. Modeling binary data (2 ed.). Chapman & Hall/CRC Press, Boca Raton, FL, Chapter 8, 269--302.",
      "doi": ""
    },
    {
      "text": "Carter Compton Collins. 1970. Tactile television-mechanical and electrical image projection. IEEE Transactions on Man-Machine Systems 11, 1 (1970), 65--71.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Julie M Walker, and Allison M Okamura. 2016. Modeling and design of asymmetric vibrations to induce ungrounded pulling sensation through asymmetric skin displacement. In Proc. IEEE Haptics Symposium. 27--33.",
      "doi": ""
    },
    {
      "text": "Sevgi Ertan, Clare Lee, Abigail Willets, Hong Tan, and Alex Pentland. 1998. A wearable haptic navigation guidance system. In Proc. IEEE International Symposium on Wearable Computers. 164--165. ",
      "doi": "10.5555/857199.858004"
    },
    {
      "text": "Brian T Gleeson, Scott K Horschel, and William R Provancher. 2010. Perception of direction for applied tangential skin displacement: Effects of speed, displacement, and repetition. IEEE Transactions on Haptics 3, 3 (2010), 177--188.  ",
      "doi": "10.1109/TOH.2010.20"
    },
    {
      "text": "Ashley L Guinan, Nicholas C Hornbaker, Markus N Montandon, Andrew J Doxon, and William R Provancher. 2013. Back-to-back skin stretch feedback for communicating five degree-of-freedom direction cues. In Proc. IEEE World Haptics Conference. 13--18.",
      "doi": ""
    },
    {
      "text": "JF Hahn. 1966. Vibrotactile adaptation and recovery measured by two methods. Journal of Experimental Psychology 71, 5 (1966), 655.",
      "doi": ""
    },
    {
      "text": "Liang He, Cheng Xu, Ding Xu, and Ryan Brill. 2015. PneuHaptic: delivering haptic cues with a pneumatic armband. In Proc. ACM International Symposium on Wearable Computers. 47--48.  ",
      "doi": "10.1145/2802083.2802091"
    },
    {
      "text": "Akihiro Imaizumi, Shogo Okamoto, and Yoji Yamada. 2014. Friction sensation produced by laterally asymmetric vibrotactile stimulus. In Haptics: Neuroscience, Devices, Modeling, and Applications. Springer, 11--18.",
      "doi": ""
    },
    {
      "text": "Ali Israr, Seungmoon Choi, and Hong Z Tan. 2006. Detection threshold and mechanical impedance of the hand in a pen-hold posture. In Proc. IEEE/RSJ International Conference on Intelligent Robots and Systems. 472--477.",
      "doi": ""
    },
    {
      "text": "Roland S Johansson and Å B Vallbo. 1979. Tactile sensibility in the human hand: relative and absolute densities of four types of mechanoreceptive units in glabrous skin. The Journal of Physiology 286, 1 (1979), 283--300.",
      "doi": ""
    },
    {
      "text": "Kenneth O Johnson. 2001. The roles and functions of cutaneous mechanoreceptors. Current Opinion in Neurobiology 11, 4 (2001), 455--461.",
      "doi": ""
    },
    {
      "text": "Anita Meier, Denys JC Matthies, Bodo Urban, and Reto Wettach. 2015. Exploring vibrotactile feedback on the body and foot for the purpose of pedestrian navigation. In Proc. International Workshop on Sensor-Based Activity Recognition and Interaction. ACM, 11.  ",
      "doi": "10.1145/2790044.2790051"
    },
    {
      "text": "Takuto Nakamura, Narihiro Nishimura, Michi Sato, and Hiroyuki Kajimoto. 2014. Application of hanger reflex to wrist and waist. In Proc. IEEE Virtual Reality. 181--182.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. 2014. Traxion: a tactile interaction device with virtual force sensation. In ACM SIGGRAPH Emerging Technologies. 25.  ",
      "doi": "10.1145/2614066.2614079"
    },
    {
      "text": "Simon Robinson, Matt Jones, Parisa Eslambolchilar, Roderick Murray-Smith, and Mads Lindborg. 2010. I did it my way: moving away from the tyranny of turn-by-turn pedestrian navigation. In Proc. International Conference on Human Computer Interaction with Mobile Devices and Services. ACM, 341--344.  ",
      "doi": "10.1145/1851600.1851660"
    },
    {
      "text": "Carlos Rossa, Jason Fong, Nawaid Usmani, Ronald Sloboda, and Mahdi Tavakoli. 2016. Multiactuator haptic feedback on the wrist for needle steering guidance in brachytherapy. IEEE Robotics and Automation Letters 1, 2 (2016), 852--859.",
      "doi": ""
    },
    {
      "text": "Sonja Rümelin, Enrico Rukzio, and Robert Hardy. 2011. NaviRadar: a novel tactile information display for pedestrian navigation. In Proc. ACM Symposium on User Interface Software and Technology. 293--302.  ",
      "doi": "10.1145/2047196.2047234"
    },
    {
      "text": "Samuel B Schorr, Zhan Fan Quek, William R Provancher, and Allison M Okamura. 2015. Environment Perception in the Presence of Kinesthetic or Tactile Guidance Virtual Fixtures. In Proc. ACM/IEEE International Conference on Human-Robot Interaction. 287--294.  ",
      "doi": "10.1145/2696454.2696488"
    },
    {
      "text": "Takuya Shima and Kenjiro Takemura. 2012. An ungrounded pulling force feedback device using periodical vibration-impact. In Haptics: Perception, Devices, Mobility, and Communication. Springer, 481--492.  ",
      "doi": "10.1007/978-3-642-31401-8_43"
    },
    {
      "text": "Roland Sigrist, Georg Rauter, Robert Riener, and Peter Wolf. 2013. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: a review. Psychonomic Bulletin & Review 20, 1 (2013), 21--53.",
      "doi": ""
    },
    {
      "text": "Adam J Spiers and Aaron M Dollar. 2016. Outdoor pedestrian navigation assistance with a shape-changing haptic interface and comparison with a vibrotactile device. In Proc. IEEE Haptics Symposium. 34--40.",
      "doi": ""
    },
    {
      "text": "Takeshi Tanabe, Hiroaki Yano, and Hiroo Iwata. 2016. Properties of proprioceptive sensation with a vibration speaker-type non-grounded haptic interface. In Proc. IEEE Haptics Symposium. 21--26.",
      "doi": ""
    },
    {
      "text": "Hanns W Tappeiner, Roberta L Klatzky, Bert Unger, and Ralph Hollis. 2009. Good vibrations: Asymmetric vibrations for directional haptic cues. In Proc. IEEE World Haptics Conference. 285--289.  ",
      "doi": "10.1109/WHC.2009.4810863"
    },
    {
      "text": "Beverly von Haller Gilmer. 1935. The measurement of the sensitivity of the skin to mechanical vibration. The Journal of General Psychology 13, 1 (1935), 42--61.",
      "doi": ""
    },
    {
      "text": "Bernhard Weber, Simon Schätzle, Thomas Hulin, Carsten Preusche, and Barbara Deml. 2011. Evaluation of a vibrotactile feedback device for spatial guidance. In Proc. IEEE World Haptics Conference. 349--354.",
      "doi": ""
    }
  ]
}