{
  "doi": "10.1145/3025453.3025888",
  "title": "ForgetMeNot: Active Reminder Entry Support for Adults with Acquired Brain Injury",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6012-6023",
  "year": 2017,
  "badges": [],
  "abstract": "Smartphone reminding apps can compensate for memory impairment after acquired brain injury (ABI). In the absence of a caregiver, users must enter reminders themselves if the apps are going to help them. Poor memory and apathy associated with ABI can result in failure to initiate such configuration behaviour and the benefits of reminder apps are lost. ForgetMeNot takes a novel approach to address this problem by periodically encouraging the user to enter reminders with unsolicited prompts (UPs). An in situ case study investigated the experience of using a reminding app for people with ABI and tested UPs as a potential solution to initiating reminder entry. Three people with severe ABI living in a post-acute rehabilitation hospital used the app in their everyday lives for four weeks to collect real usage data. Field observations illustrated how difficulties with motivation, insight into memory difficulties and anxiety impact reminder app use in a rehabilitation setting. Results showed that when 6 UPs were presented throughout the day, reminder-setting increased, showing UPs are an important addition to reminder applications for people with ABI. This study demonstrates that barriers to technology use can be resolved in practice when software is developed with an understanding of the issues experienced by the user group.",
  "authors": [
    {
      "name": "Matthew Jamieson",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81541249056",
      "orcid": "missing"
    },
    {
      "name": "Brian O'Neill",
      "institution": "Graham Anderson House, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160636",
      "orcid": "missing"
    },
    {
      "name": "Breda Cullen",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658758304",
      "orcid": "missing"
    },
    {
      "name": "Marilyn Lennon",
      "institution": "University of Strathclyde, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100287703",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Jonathan Evans",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658758589",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arab, F., Bauchet, J., Pigot, H., Giroux, A., & Giroux, S. (2014, September). Design and assessment of enabling environments for cooking activities. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (pp. 517--526). ACM.  ",
      "doi": "10.1145/2638728.2641329"
    },
    {
      "text": "Baldwin, V. N., Powell, T., & Lorenc, L. (2011). Factors influencing the uptake of memory compensations: A qualitative analysis. Neuropsychological Rehabilitation, 21, 484--501.",
      "doi": ""
    },
    {
      "text": "Boman, I-L., Bartfai, a, Borell, L., Tham, K., & Hemmingsson, H. (2010). Support in everyday activities with a home-based electronic memory aid for persons with memory impairments. Disability and rehabilitation. Assistive technology, 5(5), 339--50.",
      "doi": ""
    },
    {
      "text": "De Joode, E. A., Van Heugten, C. M., Verhey, F. R. J., & Van Boxtel, M. P. J. (2012). Effectiveness of an electronic cognitive aid in patients with acquired brain injury: A multicentre randomised parallel-group study. Neuropsychological Rehabilitation 23(1) 133--156.",
      "doi": ""
    },
    {
      "text": "Douglas, J. M. (2013). Conceptualizing self and maintaining social connection following severe traumatic brain injury. Brain injury, 27(1), 60--74.",
      "doi": ""
    },
    {
      "text": "Evans, J. (2003). Rehabilitation of executive deficits. In Neuropsychological rehabilitation: theory and practice. In series Studies in neuropsychology: development and cognition, ed., B Wilson, 5455. NY/Amsterdam: Swets and Zeitlinger.",
      "doi": ""
    },
    {
      "text": "Evans, J. J., Emslie, H., & Wilson, B. A. (1998). External cueing systems in the rehabilitation of executive impairments of action.. Journal of the International Neuropsychological Society, 4, 399407.",
      "doi": ""
    },
    {
      "text": "Felt, A. P., Egelman, S., & Wagner, D. (2012, October). I've got 99 problems, but vibration ain't one: a survey of smartphone users' concerns. In Proceedings of the second ACM workshop on Security and privacy in smartphones and mobile devices (pp. 33--44). ACM.  ",
      "doi": "10.1145/2381934.2381943"
    },
    {
      "text": "Fischer, J. E., Greenhalgh, C., & Benford, S. (2011, August). Investigating episodes of mobile phone activity as indicators of opportune moments to deliver notifications. In Proceedings of the 13th international conference on human computer interaction with mobile devices and services (pp. 181--190). ACM.  ",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Fish, J., Evans, J. J., Nimmo, M., Martin, E., Kersel, D., Bateman, A., Wilson, B. a, et al. (2007). Rehabilitation of executive dysfunction following brain injury: \"content-free\" cueing improves everyday prospective memory performance. Neuropsychologia, 45(6), 1318--30.",
      "doi": ""
    },
    {
      "text": "Gardner, R. M., Bird, F. L., Maguire, H., Carreiro, R., & Abenaim, N. (2003). Intensive positive behavior supports for adolescents with acquired brain injury: Long-term outcomes in community settings. The Journal of head trauma rehabilitation, 18(1), 52--74.",
      "doi": ""
    },
    {
      "text": "Gilbert, S. J. (2015). Strategic use of reminders: Influence of both domain-general and task-specific metacognitive confidence, independent of objective memory ability. Consciousness and Cognition, 33, 245--260.",
      "doi": ""
    },
    {
      "text": "Gillespie, A., Best, C., & O'Neill, B. (2012). Cognitive function and assistive technology for cognition: a systematic review. Journal of the International Neuropsychological Society?: JINS, 18(1), 1--19.",
      "doi": ""
    },
    {
      "text": "Headway (2015) Brain Injury Statistics. Retrieved September 19, 2015 from https://www.headway.org.uk/brain-injurystatistics.aspx",
      "doi": ""
    },
    {
      "text": "Ho, J., & Intille, S. S. (2005, April). Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI conference on Human factors in computing systems (pp. 909--918). ACM.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Jamieson, M., Cullen, B., McGee-Lennon, M., Brewster, S., & Evans, J. J. (2014). The efficacy of cognitive prosthetic technology for people with memory impairments: A systematic review and meta-analysis. Neuropsychological Rehabilitation, 24, 419--444.",
      "doi": ""
    },
    {
      "text": "Jamieson, M., McGee-Lennon, M., Cullen, B., Brewster, S., & Evans, J. (2015, October). Issues influencing the Uptake of Smartphone Reminder apps for People with Acquired Brain Injury. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (pp. 339--340). NY, USA: ACM.  ",
      "doi": "10.1145/2700648.2811368"
    },
    {
      "text": "Mehrotra, A., Pejovic, V., Vermeulen, J., Hendley, R., & Musolesi, M. (2016). My Phone and Me: Understanding People's Receptivity to Mobile Notifications. In Proc. CHI 2016.  ",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "McDonald, A., Haslam, C., Yates, P., Gurr, B., Leeder, G., & Sayers, A. (2011). Google Calendar: A new memory aid to compensate for prospective memory deficits following acquired brain injury. Neuropsychological rehabilitation, 21(6), 784807.",
      "doi": ""
    },
    {
      "text": "McGee-Lennon, M., Smeaton, A., & Brewster, S. (2012). Designing Home Care Reminder Systems: Lessons Learned Through Co-Design with Older Users. Proceedings of the 6th International Conference on Pervasive Computing Technologies for Healthcare, 49--56.",
      "doi": ""
    },
    {
      "text": "O'Neill, B., Best, C., Gillespie, A., & O'Neill, L. (2013). Automated prompting technologies in rehabilitation and at home. Social Care and Neurodisability, 4(1), 17--28.",
      "doi": ""
    },
    {
      "text": "Paul, C. L., Komlodi, A., & Lutters, W. (2011). Again?!! the emotional experience of social notification interruptions. In Human-Computer Interaction--INTERACT 2011 (pp. 471--478). Springer Berlin Heidelberg. ",
      "doi": "10.5555/2042118.2042163"
    },
    {
      "text": "Paul, L., Wyke, S., Brewster, S., Sattar, N., Gill, J. M., Alexander, G., ... & Dybus, A. (2016). Increasing physical activity in stroke survivors using STARFISH, an interactive mobile phone application: a pilot study. Topics in stroke rehabilitation, 23(3), 170--177.",
      "doi": ""
    },
    {
      "text": "Pielot, M., Church, K., & de Oliveira, R. (2014, September). An in-situ study of mobile phone notifications. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (pp. 233--242). ACM.  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Rosenthal, S., Dey, A. K., & Veloso, M. (2011). Using decision-theoretic experience sampling to build personalized mobile phone interruption models. In Pervasive Computing (pp. 170--187). Springer Berlin Heidelberg. ",
      "doi": "10.5555/2021975.2021991"
    },
    {
      "text": "Shirazi, S. A., Henze, N., Dingler, T., Pielot, M., Weber, D., & Schmidt, A. (2014, April). Largescale assessment of mobile notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 3055--3064). ACM.  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Sosin DM, Sniezek JE, Thurman DJ. (1996) Incidence of mild and moderate brain injury in the USA, 1991. Brain Injury, 10, 47--54.",
      "doi": ""
    },
    {
      "text": "Stawarz, K.M., Cox, A.L. & Blandford, A. (2015). Beyond self-tracking and reminders: Designing smartphone apps that support habit formation. In Proc. CHI 2015.  ",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Sutcliffe, A., Fickas, S., Sohlberg, M. M., & Ehlhardt, L. A. (2003). Investigating the usability of assistive user interfaces. Interacting with computers, 15(4), 577--602.",
      "doi": ""
    },
    {
      "text": "Svoboda, E., Richards, B., Leach, L., & Mertens, V. (2012). PDA and smartphone use by individuals with moderate-to-severe memory impairment: Application of a theory-driven training programme. Neuropsychological rehabilitation, 22(3), 408--427.",
      "doi": ""
    },
    {
      "text": "Szymkowiak, Andrea, Kenny Morrison, Peter Gregor, Prveen Shah, Jonathan Evans, and Barbara Wilson. \"Memojog-Successes and Limitations of a Memory Aid System.\" Brain Impairment 5, no. 1 (2004): 98.",
      "doi": ""
    },
    {
      "text": "Tate, R. L., Perdices, M., Rosenkoetter, U., Wakim, D., Godbee, K., Togher, L., & McDonald, S. (2013). Revision of a method quality rating scale for single-case experimental designs and nof-1 trials: The 15-item Risk of Bias in N-of-1 Trials (RoBiNT) Scale. Neuropsychological Rehabilitation, 23(5), 619--638.",
      "doi": ""
    },
    {
      "text": "Warnock, D., McGee-Lennon, M., & Brewster, S. (2013). Multiple notification modalities and older users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1091--1094). ACM.  ",
      "doi": "10.1145/2470654.2466139"
    },
    {
      "text": "Wechsler, D. (2008). Wechsler adult intelligence scale-fourth. San Antonio, TX: Pearson",
      "doi": ""
    },
    {
      "text": "Wechsler, D. (2011). Test of Premorbid Functioning. UK Version (TOPF UK). London, UK: Pearson Corporation.",
      "doi": ""
    },
    {
      "text": "Weiser, M. (1991). The computer for the 21st century. Scientific american, 265(3), 94--104.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A. (1991). Long-term prognosis of patients with severe memory disorders. Neuropsychological Rehabilitation, 1(2), 117--134.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A., Cockburn, J., & Baddeley, A. D. (1991). The Rivermead behavioural memory test. Bury St Edmunds, UK: Thames Valley Test Company.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A., Emslie, H., Quirk, K., & Evans, J. (1999). George: Learning to live independently with NeuroPage®. Rehabilitation Psychology, 44(3), 284.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A, Emslie, H. C., Quirk, K., & Evans, J. J. (2001). Reducing everyday memory and planning problems by means of a paging system: a randomised control crossover study. Journal of neurology, neurosurgery, and psychiatry, 70(4), 477--82.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A., Evans, J. J., Alderman, N., Burgess, P. W., & Emslie, H. (1997). Behavioural assessment of the dysexecutive syndrome. In P. Rabbitt (Ed.), Methodology of frontal and executive function (pp. 239--250). London, UK: Psychology Press.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A., Gracey, F., & Evans, J. J. (2009). Neuropsychological rehabilitation: Theory, models, therapy and outcome. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Wilson, B. A., Shiel, A., Foley, J., Emslie, H., Groot, Y., Hawkins, K., & Watson, P. (2005). Cambridge test of prospective memory (CAMPROMPT). San Antonio: Pearson Assessment.",
      "doi": ""
    }
  ]
}