{
  "doi": "10.1145/3025453.3025662",
  "title": "Reducing Interruptions at Work: A Large-Scale Field Study of FlowLight",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "61-72",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Due to the high number and cost of interruptions at work, several approaches have been suggested to reduce this cost for knowledge workers. These approaches predominantly focus either on a manual and physical indicator, such as headphones or a closed office door, or on the automatic measure of a worker's interruptibilty in combination with a computer-based indicator. Little is known about the combination of a physical indicator with an automatic interruptibility measure and its long-term impact in the workplace. In our research, we developed the FlowLight, that combines a physical traffic-light like LED with an automatic interruptibility measure based on computer interaction data. In a large-scale and long-term field study with 449 participants from 12 countries, we found, amongst other results, that the FlowLight reduced the interruptions of participants by 46%, increased their awareness on the potential disruptiveness of interruptions and most participants never stopped using it.",
  "tags": [
    "automatic interruptibility measure",
    "physical indicator",
    "field study",
    "knowledge worker",
    "awareness",
    "interruption cost"
  ],
  "authors": [
    {
      "name": "Manuela Züger",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158767457",
      "orcid": "missing"
    },
    {
      "name": "Christopher Corley",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81485650364",
      "orcid": "missing"
    },
    {
      "name": "André N. Meyer",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-99658658128/rel-imgonly/andre_meyer.2.jpg",
      "acmid": "99658658128",
      "orcid": "missing"
    },
    {
      "name": "Boyang Li",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261139",
      "orcid": "missing"
    },
    {
      "name": "Thomas Fritz",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/do/10.1145/contrib-81309488123/rel-imgonly/small.jpg",
      "acmid": "81309488123",
      "orcid": "missing"
    },
    {
      "name": "David Shepherd",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/do/10.1145/contrib-81100380496/rel-imgonly/davidshepherd.jpg",
      "acmid": "81100380496",
      "orcid": "missing"
    },
    {
      "name": "Vinay Augustine",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81365592781",
      "orcid": "missing"
    },
    {
      "name": "Patrick Francis",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/do/10.1145/contrib-81100150095/rel-imgonly/headshot_small.jpg",
      "acmid": "81100150095",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Kraft",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81337491004",
      "orcid": "missing"
    },
    {
      "name": "Will Snipes",
      "institution": "ABB Corporate Research, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315492027",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2016. http://www.embrava.com/. (2016).",
      "doi": ""
    },
    {
      "text": "Ernesto Arroyo and Ted Selker. 2011. Attention and intention goals can mediate disruption in human-computer interaction. In IFIP Conference on Human-Computer Interaction. Springer, 454--470. ",
      "doi": ""
    },
    {
      "text": "Brian P. Bailey and Shamsi T. Iqbal. 2008. Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management. ACM Transactions on Computer-Human Interaction (TOCHI) 14, 4 (2008), 21.",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Brian P. Bailey and Joseph A. Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in human behavior 22, 4 (2006), 685--708. ",
      "doi": ""
    },
    {
      "text": "James Bo Begole, Nicholas E. Matsakis, and John C. Tang. 2004. Lilsys: sensing unavailability. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 511--514.  ",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "Suzanne C. Beyea. 2007. Distractions, interruptions, and patient safety. AORN journal 86, 1 (2007), 109--112. ",
      "doi": ""
    },
    {
      "text": "Milan Z. Bjelica, Bojan Mrazovac, Istvan Papp, and Nikola Teslic. 2011. Busy flag just got better: Application of lighting effects in mediating social interruptions. In MIPRO, 2011 Proceedings of the 34th International Convention. IEEE, 975--980.",
      "doi": ""
    },
    {
      "text": "Jelmer P Borst, Niels A. Taatgen, and Hedderik van Rijn. 2015. What Makes Interruptions Disruptive? A Process-Model Account of the Effects of the Problem State Bottleneck on Task Interruption and Resumption. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 2971--2980.",
      "doi": "10.1145/2702123.2702156"
    },
    {
      "text": "Daniel Chen, Jamie Hart, and Roel Vertegaal. 2007. Towards a physiological model of user interruptability. In IFIP Conference on Human-Computer Interaction. Springer, 439--451. ",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proc. SIGCHI. ACM, 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "James Fogarty, Andrew J. Ko, Htet Htet Aung, Elspeth Golden, Karen P. Tang, and Scott E. Hudson. 2005. Examining task engagement in sensor-based statistical models of human interruptibility. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "James Fogarty, Jennifer Lai, and Jim Christensen. 2004. Presence versus availability: the design and evaluation of a context-aware communication client. International Journal of Human-Computer Studies 61, 3 (2004), 299--317.  ",
      "doi": "10.1016/j.ijhcs.2003.12.016"
    },
    {
      "text": "Victor M. González and Gloria Mark. 2004. Constant, constant, multi-tasking craziness: managing multiple working spheres. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Juan David Hincapié-Ramos, Stephen Voida, and Gloria Mark. 2011a. A design space analysis of availability-sharing systems. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 85--96.  ",
      "doi": "10.1145/2047196.2047207"
    },
    {
      "text": "Juan David Hincapié-Ramos, Stephen Voida, and Gloria Mark. 2011b. Sharing availability information with InterruptMe. In Proceedings of the 13th international conference on Ubiquitous computing. ACM, 477--478.  ",
      "doi": "10.1145/2030112.2030179"
    },
    {
      "text": "Joyce Ho and Stephen S. Intille. 2005. Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 909--918.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Eric Horvitz, Paul Koch, Carl M. Kadie, and Andy Jacobs. 2002. Coordinate: Probabilistic forecasting of presence and availability. In Proceedings of the Eighteenth conference on Uncertainty in artificial intelligence. Morgan Kaufmann Publishers Inc., 224--233.",
      "doi": "10.5555/2073876.2073903"
    },
    {
      "text": "Scott Hudson, James Fogarty, Christopher Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny Lee, and Jie Yang. 2003. Predicting human interruptibility with sensors: a Wizard of Oz feasibility study. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 257--264.  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2008. Effects of intelligent notification management on users and their tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 93--102.  ",
      "doi": "10.1145/1357054.1357070"
    },
    {
      "text": "Ellen Isaacs, Steve Whittaker, David Frohlich, and Brid O'Conaill. 1997. Informal communication re-examined: New functions for video in supporting opportunistic encounters. Video-mediated communication 997 (1997), 459--485.",
      "doi": ""
    },
    {
      "text": "Jennifer Lai, Sachiko Yoshihama, Thomas Bridgman, Mark Podlaseck, Paul B. Chou, and Danny C. Wong. 2003. MyTeam: Availability Awareness Through the Use of Sensor Data.. In INTERACT.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Santosh Mathan, Stephen Whitlow, Michael Dorneich, Patricia Ververs, and Gene Davis. 2007. Neurophysiological estimation of interruptibility: Demonstrating feasibility in a field context. In In Proceedings of the 4th International Conference of the Augmented Cognition Society.",
      "doi": ""
    },
    {
      "text": "Daniel McFarlane. 2002. Comparison of four primary methods for coordinating the interruption of people in human-computer interaction. Human-Computer Interaction 17, 1 (2002), 63--139.  ",
      "doi": "10.1207/S15327051HCI1701_2"
    },
    {
      "text": "Allen E. Milewski and Thomas M. Smith. 2000. Providing presence cues to telephone users. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 89--96.  ",
      "doi": "10.1145/358916.358978"
    },
    {
      "text": "Bonnie A. Nardi, Steve Whittaker, and Erin Bradner. 2000. Interaction and outeraction: instant messaging in action. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Jaime Snyder, Mark Matthews, Jacqueline Chien, Pamara F. Chang, Emily Sun, Saeed Abdullah, and Geri Gay. 2015. Moodlight: Exploring personal and social implications of ambient display of biosensor data. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 143--153.  ",
      "doi": "10.1145/2675133.2675191"
    },
    {
      "text": "Hermann Stern, Viktoria Pammer, and Stefanie N. Lindstaedt. 2011. A preliminary study on interruptibility detection based on location and calendar information. Proc. CoSDEO 11 (2011).",
      "doi": ""
    },
    {
      "text": "Edward R. Sykes. 2011. Interruptions in the workplace: A case study to reduce their effects. International Journal of Information Management 31, 4 (2011), 385--394.  ",
      "doi": "10.1016/j.ijinfomgt.2010.10.010"
    },
    {
      "text": "John C. Tang, Nicole Yankelovich, James Begole, Max Van Kleek, Francis Li, and Janak Bhalodia. 2001. ConNexus to awarenex: extending awareness to mobile users. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 221--228.  ",
      "doi": "10.1145/365024.365105"
    },
    {
      "text": "Takahisa Tani and Seiji Yamada. 2013. Estimating user interruptibility by measuring table-top pressure. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1707--1712.  ",
      "doi": "10.1145/2468356.2468662"
    },
    {
      "text": "Manuela Züger and Thomas Fritz. 2015. Interruptibility of software developers and its prediction using psycho-physiological sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2981--2990.  ",
      "doi": "10.1145/2702123.2702593"
    }
  ]
}