{
  "doi": "10.1145/3025453.3025974",
  "title": "Examining Crowd Work and Gig Work Through The Historical Lens of Piecework",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4599-4616",
  "year": 2017,
  "badges": [],
  "abstract": "The internet is empowering the rise of crowd work, gig work, and other forms of on-demand labor. A large and growing body of scholarship has attempted to predict the socio-technical outcomes of this shift, especially addressing three questions: 1) What are the complexity limits of on-demand work?, 2) How far can work be decomposed into smaller microtasks?, and 3) What will work and the place of work look like for workers? In this paper, we look to the historical scholarship on piecework — a similar trend of work decomposition, distribution, and payment that was popular at the turn of the 20th century — to understand how these questions might play out with modern on-demand work. We identify the mechanisms that enabled and limited piecework historically, and identify whether on-demand work faces the same pitfalls or might differentiate itself. This approach introduces theoretical grounding that can help address some of the most persistent questions in crowd work, and suggests design interventions that learn from history rather than repeat it.",
  "authors": [
    {
      "name": "Ali Alkhatib",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706423",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    },
    {
      "name": "Margaret Levi",
      "institution": "Stanford University, Stanford, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160996",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. House Cleaning, Handyman, Lawn Care Services in Austin, Denver, Kansas City, Minneapolis and San Francisco - Zaarly. (9 2015). https://www.zaarly.com/",
      "doi": ""
    },
    {
      "text": "2015. TaskRabbit connects you to safe and reliable help in your neighborhood. (9 2015). https://www.taskrabbit.com/",
      "doi": ""
    },
    {
      "text": "2015. Uber. (9 2015). https://www.uber.com/",
      "doi": ""
    },
    {
      "text": "2016. 150 Million Indian Workers Take Part In Largest Strike in Centuries. (9 2016). http://therealnews.com/t2/index.php?option= com_content&task=view&id=31&Itemid=74&jumival=17170",
      "doi": ""
    },
    {
      "text": "Elena Agapie, Jaime Teevan, and Andrés Monroy-Hernández. 2015. Crowdsourcing in the field: A case study using local crowds for event reporting. In Third AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Jonas Agell. 2004. Why are Small Firms Difierent? Managers' Views. Scandinavian Journal of Economics 106, 3 (2004), 437--452.",
      "doi": ""
    },
    {
      "text": "J Ignacio Aguaded-Gómez. 2013. The MOOC Revolution: A new form of education from the technological paradigm. Comunicar 41, 21 (2013), 7--8.",
      "doi": ""
    },
    {
      "text": "John S Ahlquist and Margaret Levi. 2013. In the interest of others: Organizations and social activism. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Erin Anderson and David C. Schmittlein. 1984. Integration of the Sales Force: An Empirical Examination. The RAND Journal of Economics 15, 3 (1984), 385--395. http://www.jstor.org/stable/2555446",
      "doi": ""
    },
    {
      "text": "Paul André, Aniket Kittur, and Steven P. Dow. 2014. Crowd Synthesis: Extracting Categories and Clusters from Complex Data. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, 989--998.  ",
      "doi": "10.1145/2531602.2531653"
    },
    {
      "text": "Judd Antin and Aaron Shaw. 2012. Social Desirability Bias and Self-reports of Motivation: A Study of Amazon Mechanical Turk in the US and India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 2925--2934.  ",
      "doi": "10.1145/2207676.2208699"
    },
    {
      "text": "Peter Baker. 1993. Production restructuring in the textiles and clothing industries. New Technology, Work and Employment 8, 1 (1993), 43--55.",
      "doi": ""
    },
    {
      "text": "Jeff Bercovici. 2011. AOL-Huffpo Suit Seeks $105M: \"This Is About Justice\". (4 2011). http://www.forbes.com/ sites/jeffbercovici/2011/04/12/aol-huffpo-suit-seeks105m-this-is-about-justice/#1544785f305d",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A Word Processor with a Crowd Inside. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Truman F Bewley. 1999. Why wages don't fall during a recession. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bigham. 2014. My MTurk (half) Workday. (7 2014). http://www.cs.cmu.edu/~jbigham/posts/2014/halfworkday-as-turker.html",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Michael S. Bernstein, and Eytan Adar. 2015. Human-Computer Interaction and Collective Intelligence. In Handbook of Collective Intelligence. MIT Press, 57--84. http: //repository.cmu.edu/cgi/viewcontent.cgi?article=1264",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: Nearly Real-time Answers to Visual Questions. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Franz Boas. 1940. Race, language, and culture. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Charles Booth. 1903. Life and Labour of the People in London. Vol. 8. Macmillan and Company.",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. \"Why Would Anybody Do This?\": Understanding Older Adults' Motivations and Challenges in Crowd Work. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2246--2257.  ",
      "doi": "10.1145/2858036.2858198"
    },
    {
      "text": "Charles Brown. 1990. Firms' Choice of Method of Pay. Industrial & Labor Relations Review 43, 3 (1990), 165S--182S.",
      "doi": ""
    },
    {
      "text": "Carrie J. Cai, Philip J. Guo, James R. Glass, and Robert C. Miller. 2015. Wait-Learning: Leveraging Wait Time for Second Language Education. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 3701--3710.  ",
      "doi": "10.1145/2702123.2702267"
    },
    {
      "text": "Carrie J. Cai, Shamsi T. Iqbal, and Jaime Teevan. 2016. Chain Reactions: The Impact of Order on Microtask Chains. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 3143--3154.  ",
      "doi": "10.1145/2858036.2858237"
    },
    {
      "text": "Chris Callison-Burch. 2014. Crowd-workers: Aggregating information across turkers to help them find higher paying work. In Second AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Norma W Carlson. 1982. Time rates tighten their grip on manufacturing industries. Monthly Lab. Rev. 105 (1982), 15.",
      "doi": ""
    },
    {
      "text": "L. Elisa Celis, Sai Praneeth Reddy, Ishaan Preet Singh, and Shailesh Vaya. 2016. Assignment Techniques for Crowdsourcing Sensitive Tasks. In Proceedings of the 19th ACM Conference on Computer--Supported Cooperative Work & Social Computing (CSCW '16). ACM, 836--847.  ",
      "doi": "10.1145/2818048.2835202"
    },
    {
      "text": "Edwin Chadwick. 1865. Openi, at the Meeting of the National Association for the Promotion of Social Science, held at York, in September, 1864. Journal of the Statistical Society of London 28, 1 (1865), 1--33. http://www.jstor.org/stable/2338394",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Aniket Kittur, and Nathan Hahn. 2016. Alloy: Clustering with Crowds and Computation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 3180--3191.  ",
      "doi": "10.1145/2858036.2858411"
    },
    {
      "text": "Yan Chen, Steve Oney, and Walter S. Lasecki. 2016. Towards Providing On-Demand Expert Support for Software Developers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 3192--3203.  ",
      "doi": "10.1145/2858036.2858512"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, and Michael S. Bernstein. 2015a. Measuring Crowdsourcing Effort with Error--Time Curves. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1365--1374.  ",
      "doi": "10.1145/2702123.2702145"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, Shamsi T. Iqbal, and Michael S. Bernstein. 2015b. Break It Down: A Comparison of Macro- and Microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 4061--4064.  ",
      "doi": "10.1145/2702123.2702146"
    },
    {
      "text": "Lydia B. Chilton, John J. Horton, Robert C. Miller, and Shiri Azenkot. 2010. Task Search in a Human Computation Market. In Proceedings of the ACM SIGKDD Workshop on Human Computation (HCOMP '10). ACM, 1--9.  ",
      "doi": "10.1145/1837885.1837889"
    },
    {
      "text": "Lydia B. Chilton, Greg Little, Darren Edge, Daniel S. Weld, and James A. Landay. 2013. Cascade: Crowdsourcing Taxonomy Creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 1999--2008.  ",
      "doi": "10.1145/2470654.2466265"
    },
    {
      "text": "William Alexander Graham Clark. 1908. Cotton Textile Trade in Turkish Empire, Greece, and Italy. Vol. 10. US Government Printing Office.",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Dan Frankowski, Loren Terveen, and John Riedl. 2007. SuggestBot: Using Intelligent Task Routing to Help People Find Work in Wikipedia. In Proceedings of the 12th International Conference on Intelligent User Interfaces (IUI '07). ACM, 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Peng Dai, Jeffrey M. Rzeszotarski, Praveen Paritosh, and Ed H. Chi. 2015. And Now for Something Completely Different: Improving Crowdsourcing Workflows with Micro-Diversions. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, 628--638.  ",
      "doi": "10.1145/2675133.2675260"
    },
    {
      "text": "Andrea Rees Davies and Brenda D Frink. 2014. The origins of the ideal worker: The separation of work and home in the United States from the market revolution to 1950. Work and Occupations 41, 1 (2014), 18--39.",
      "doi": ""
    },
    {
      "text": "Jan Drahokoupil and Brian Fabo. 2016. The Sharing Economy That Is Not: Shaping Employment In Platform Capitalism. (7 2016). https://www.socialeurope.eu/2016/07/sharing-economynot-shaping-employment-platform-capitalism/",
      "doi": ""
    },
    {
      "text": "Benjamin G Edelman, Michael Luca, and Dan Svirsky. 2015. Racial Discrimination in the Sharing Economy: Evidence from a Field Experiment. Harvard Business School NOM Unit Working Paper 16-069 (2015).",
      "doi": ""
    },
    {
      "text": "Amy C. Edmondson. 2012. Teaming: How organizations learn, innovate, and compete in the knowledge economy. John Wiley & Sons, San Francisco, California.",
      "doi": ""
    },
    {
      "text": "Boris Emmet. 1918. Trade Agreements In The Women's Clothing Industries Of Philadelphia. Monthly Review of the U.S. Bureau of Labor Statistics 6, 1 (1918), 27--39. http://www.jstor.org/stable/41829256",
      "doi": ""
    },
    {
      "text": "Douglas C Engelbart. 2001. Augmenting human intellect: a conceptual framework (1962). PACKER, Randall and JORDAN, Ken. Multimedia. From Wagner to Virtual Reality. New York: WW Norton & Company (2001), 64--90.",
      "doi": ""
    },
    {
      "text": "Samer Faraj and Yan Xiao. 2006. Coordination in Fast-Response Organizations. Management Science 52, 8 (2006), 1155--1169. http: //mansci.journal.informs.org/content/52/8/1155.short  ",
      "doi": "10.1287/mnsc.1060.0526"
    },
    {
      "text": "Ethan Fast and Michael S. Bernstein. 2016. Meta: Enabling Programming Languages to Learn from the Crowd. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, 259--270.  ",
      "doi": "10.1145/2984511.2984532"
    },
    {
      "text": "David N Figlio and Lawrence W Kenny. 2007. Individual teacher incentives and student performance. Journal of Public Economics 91, 5 (2007), 901--914.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter H. Khan, Jr., and Daniel C. Howe. 2000. Trust Online. Commun. ACM 43, 12 (12 2000), 34--40.  ",
      "doi": "10.1145/355112.355120"
    },
    {
      "text": "Gerald Friedman. 2014. Workers without employers: shadow corporations and the rise of the gig economy. Review of Keynesian Economics 2 (2014), 171--188.",
      "doi": ""
    },
    {
      "text": "Mark Fuge, Kevin Tee, Alice Agogino, and Nathan Maton. 2014. Analysis of collaborative design networks: A case study of openideo. Journal of Computing and Information Science in Engineering 14, 2 (2014), 021009.",
      "doi": ""
    },
    {
      "text": "Ujwal Gadiraju, Ricardo Kawase, Stefan Dietze, and Gianluca Demartini. 2015. Understanding Malicious Behavior in Crowdsourcing Platforms: The Case of Online Surveys. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1631--1640.  ",
      "doi": "10.1145/2702123.2702443"
    },
    {
      "text": "David Geiger, Stefan Seedorf, Thimo Schulze, Robert C Nickerson, and Martin Schader. 2011. Managing the Crowd: Towards a Taxonomy of Crowdsourcing Processes.. In AMCIS.",
      "doi": ""
    },
    {
      "text": "Carl Graves. 1981. Applying Scientific Management Principles to Railroad Repair Shops -- the Santa Fe Experience, 1904--18. Business and Economic History 10 (1981), 124--136. http://www.jstor.org/stable/23702539",
      "doi": ""
    },
    {
      "text": "Mary Gray. 2015. Fixing the Chaotic Crowdworker Economy. (8 2015). http://www.bloombergview.com/articles/2015-08--12/ fixing-the-chaotic-crowdworker-economy",
      "doi": ""
    },
    {
      "text": "Mary L. Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The Crowd is a Collaborative Network. In Proceedings of the 19th ACM Conference on Computer--Supported Cooperative Work & Social Computing (CSCW '16). ACM, 134--147.  ",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "David Alan Grier. 2013. When computers were human. Princeton University Press. ",
      "doi": "10.5555/1095650"
    },
    {
      "text": "Neha Gupta, David Martin, Benjamin V. Hanrahan, and Jacki O'Neill. 2014. Turk-Life in India. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14). ACM, 1--11.  ",
      "doi": "10.1145/2660398.2660403"
    },
    {
      "text": "Daniel Haas, Jason Ansel, Lydia Gu, and Adam Marcus. 2015. Argonaut: macrotask crowdsourcing for complex data processing. Proceedings of the VLDB Endowment 8, 12 (2015), 1642--1653.  ",
      "doi": "10.14778/2824032.2824062"
    },
    {
      "text": "J. Hagan and C. Fisher. 1973. Piece Work and Some of Its Consequences in the Printing and Coal Mining Industries in Australia, 1850--1930. Labour History 25 (1973), 19--39. http://www.jstor.org/stable/27508091",
      "doi": ""
    },
    {
      "text": "Nathan Hahn, Joseph Chang, Ji Eun Kim, and Aniket Kittur. 2016. The Knowledge Accelerator: Big Picture Thinking in Small Pieces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2258--2270.  ",
      "doi": "10.1145/2858036.2858364"
    },
    {
      "text": "Russell Hardin. 1982. Collective action. Resources for the Future.",
      "doi": ""
    },
    {
      "text": "Robert A Hart. 2005. Piecework Versus Timework in British Wartime Engineering. (2005).",
      "doi": ""
    },
    {
      "text": "Robert A Hart and others. 2016. the rise and fall of piecework. IZA World of Labor (2016).",
      "doi": ""
    },
    {
      "text": "Robert A Hart and J Elizabeth Roberts. 2013. The rise and fall of piecework--timework wage differentials: market volatility, labor heterogeneity, and output pricing. (2013).",
      "doi": ""
    },
    {
      "text": "John S. Heywood, W. S. Siebert, and Xiangdong Wei. 1997. Payment by Results Systems: British Evidence. British Journal of Industrial Relations 35, 1 (1997), 1--22.",
      "doi": ""
    },
    {
      "text": "Sam Hind and Alex Gekker. 2014. \"Outsmarting Trafic, Together\": Driving as Social Navigation. Exchanges: the Warwick Research Journal 1, 2 (2014), 165--180.",
      "doi": ""
    },
    {
      "text": "Maureen Honey. 1985. Creating Rosie the Riveter: class, gender, and propaganda during World War II. Univ of Massachusetts Press.",
      "doi": ""
    },
    {
      "text": "John J. Horton, Leonard N. Stern, and Joseph M. Golden. 2015. Reputation Inflation: Evidence from an Online Labor Market. (2015).",
      "doi": ""
    },
    {
      "text": "Jeff Howe. 2008. Crowdsourcing: How the power of the crowd is driving the future of business. Random House. ",
      "doi": "10.5555/1481457"
    },
    {
      "text": "Te C Hu. 1961. Parallel Sequencing and Assembly Line Problems. Operations Research 9, 6 (1961), 841--848.  ",
      "doi": "10.1287/opre.9.6.841"
    },
    {
      "text": "Panagiotis G Ipeirotis. 2010. Demographics of mechanical turk. (2010).",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2008. Effects of Intelligent Notification Management on Users and Their Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, 93--102.  ",
      "doi": "10.1145/1357054.1357070"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 611--620.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2016. Stories We Tell About Labor: Turkopticon and the Trouble with \"Design\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 4573--4586.  ",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Sanford M Jacoby. 1983. Union--management cooperation in the United States: Lessons from the 1920s. Industrial & Labor Relations Review 37, 1 (1983), 18--33.",
      "doi": ""
    },
    {
      "text": "B.M. Jewell. 1921. The problem of piece work. Number nos. 1--16 in The Problem of Piece Work. Bronson Canode Print. Co. https://books.google.com/books?id=NN5NAQAAIAAJ",
      "doi": ""
    },
    {
      "text": "Sanjay Kairam and Jeffrey Heer. 2016. Parting Crowds: Characterizing Divergent Interpretations in Crowdsourced Annotation Tasks. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 1637--1648.  ",
      "doi": "10.1145/2818048.2820016"
    },
    {
      "text": "Nicolas Kaufmann, Thimo Schulze, and Daniel Veit. 2011. More than fun and money. Worker Motivation in Crowdsourcing--A Study on Mechanical Turk.. In AMCIS, Vol. 11. 1--11.",
      "doi": ""
    },
    {
      "text": "Sarah Kessler. 2015. What Does A Union Look Like In The Gig Economy? (2 2015). http://www.fastcompany.com/3042081/what-does-a-unionlook-like-in-the-gig-economy",
      "doi": ""
    },
    {
      "text": "Joy Kim and Andrés Monroy-Hernández. 2016. Storia: Summarizing Social Media Content Based on Narrative Theory Using Crowdsourcing. In Proceedings of the 19th ACM Conference on Computer--Supported Cooperative Work & Social Computing (CSCW '16). ACM, 1018--1027.  ",
      "doi": "10.1145/2818048.2820072"
    },
    {
      "text": "Joy Kim, Sarah Sterman, Allegra Argent Beal Cohen, and Michael S Bernstein. 2017. Mechanical Novel: Crowdsourcing Complex Work through Revision. In Proceedings of the 20th ACM Conference on Computer Supported Cooperative Work & Social Computing.",
      "doi": "10.1145/2998181.2998196"
    },
    {
      "text": "Peter Kinnaird, Laura Dabbish, and Sara Kiesler. 2012. Workflow Transparency in a Microtask Marketplace. In Proceedings of the 17th ACM International Conference on Supporting Group Work (GROUP '12). ACM, 281--284.  ",
      "doi": "10.1145/2389176.2389219"
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The Future of Crowd Work. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E. Kraut. 2011. CrowdForge: Crowdsourcing Complex Work. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Ranjay A. Krishna, Kenji Hata, Stephanie Chen, Joshua Kravitz, David A. Shamma, Li Fei-Fei, and Michael S. Bernstein. 2016. Embracing Error to Enable Rapid Crowdsourcing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 3167--3179.  ",
      "doi": "10.1145/2858036.2858115"
    },
    {
      "text": "Anand Kulkarni, Philipp Gutheim, Prayag Narula, David Rolnitzky, Tapan Parikh, and Björn Hartmann. 2012. Mobileworks: Designing for quality in a managed crowdsourcing architecture. IEEE Internet Computing 16, 5 (2012), 28--35.  ",
      "doi": "10.1109/MIC.2012.72"
    },
    {
      "text": "Walter Lasecki, Christopher Miller, Adam Sadilek, Andrew Abumoussa, Donato Borrello, Raja Kushalnagar, and Jeffrey Bigham. 2012. Real-time Captioning by Groups of Non-experts. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, 23--34.  ",
      "doi": "10.1145/2380116.2380122"
    },
    {
      "text": "Walter S. Lasecki, Kyle I. Murray, Samuel White, Robert C. Miller, and Jeffrey P. Bigham. 2011. Real-time Crowd Control of Existing Interfaces. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 23--32.  ",
      "doi": "10.1145/2047196.2047200"
    },
    {
      "text": "Walter S. Lasecki, Jeffrey M. Rzeszotarski, Adam Marcus, and Jeffrey P. Bigham. 2015. The Effects of Sequence and Delay on Crowd Work. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1375--1378.  ",
      "doi": "10.1145/2702123.2702594"
    },
    {
      "text": "Walter S. Lasecki, Rachel Wesley, Jeffrey Nichols, Anand Kulkarni, James F. Allen, and Jeffrey P. Bigham. 2013. Chorus: A Crowd-powered Conversational Assistant. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, 151--162.  ",
      "doi": "10.1145/2501988.2502057"
    },
    {
      "text": "Thomas D. LaToza, W. Ben Towne, Christian M. Adriano, and André van der Hoek. 2014. Microtask Programming: Building Software with a Crowd. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 43--54.  ",
      "doi": "10.1145/2642918.2647349"
    },
    {
      "text": "Edith Law, Ming Yin, Joslin Goh, Kevin Chen, Michael A. Terry, and Krzysztof Z. Gajos. 2016. Curiosity Killed the Cat, but Makes Crowdwork Better. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 4098--4110.  ",
      "doi": "10.1145/2858036.2858144"
    },
    {
      "text": "John Le, Andy Edmonds, Vaughn Hester, and Lukas Biewald. 2010. Ensuring quality in crowdsourced search relevance evaluation: The effects of training question distribution. In SIGIR 2010 workshop on crowdsourcing for search evaluation. 21--26.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data--Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1603--1612.  ",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Lawrence Lessig. 2006. Code. Lawrence Lessig.",
      "doi": ""
    },
    {
      "text": "Margaret Levi, David Olson, Jon Agnone, and Devin Kelly. 2009. Union democracy reexamined. Politics & Society 37, 2 (2009), 203--228.",
      "doi": ""
    },
    {
      "text": "Alain Lipietz. 1982. Towards Global Fordism? New Left Review 0, 132 (3 1982), 33. http://search.proquest.com/ docview/1301937328?accountid=14026 Last updated -- 2013-02-24.",
      "doi": ""
    },
    {
      "text": "Greg Little, Lydia B. Chilton, Max Goldman, and Robert C. Miller. 2010. TurKit: Human Computation Algorithms on Mechanical Turk. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, 57--66.  ",
      "doi": "10.1145/1866029.1866040"
    },
    {
      "text": "Kurt Luther, Nathan Hahn, Steven P Dow, and Aniket Kittur. 2015. Crowdlines: Supporting Synthesis of Diverse Information Sources through Crowdsourced Outlines. In Third AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Ioanna Lykourentzou, Angeliki Antoniou, Yannick Naudet, and Steven P. Dow. 2016. Personality Matters: Balancing for Personality Types Leads to Better Outcomes for Crowd Teams. In Proceedings of the 19th ACM Conference on Computer--Supported Cooperative Work & Social Computing (CSCW '16). ACM, 260--273.  ",
      "doi": "10.1145/2818048.2819979"
    },
    {
      "text": "Eleanor A. Maguire, David G. Gadian, Ingrid S. Johnsrude, Catriona D. Good, John Ashburner, Richard S. J. Frackowiak, and Christopher D. Frith. 2000. Navigation-related structural change in the hippocampi of taxi drivers. Proceedings of the National Academy of Sciences 97, 8 (2000), 4398--4403.",
      "doi": ""
    },
    {
      "text": "Eleanor A. Maguire, Rory Nannery, and Hugo J. Spiers. 2006. Navigation around London by a taxi driver with bilateral hippocampal lesions. Brain 129, 11 (2006), 2894--2907.",
      "doi": ""
    },
    {
      "text": "Bronislaw Malinowski. 2002. Argonauts of the Western Pacific: An account of native enterprise and adventure in the archipelagoes of Melanesian New Guinea. Routledge.",
      "doi": ""
    },
    {
      "text": "David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, 224--235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Jamie K McCallum. 2013. Global unions, local power: the new spirit of transnational labor organizing. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Brian McInnis, Dan Cosley, Chaebong Nam, and Gilly Leshed. 2016a. Taking a HIT: Designing Around Rejection, Mistrust, Risk, and Workers' Experiences in Amazon Mechanical Turk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2271--2282.  ",
      "doi": "10.1145/2858036.2858539"
    },
    {
      "text": "Brian James McInnis, Elizabeth Lindley Murnane, Dmitry Epstein, Dan Cosley, and Gilly Leshed. 2016b. One and Done: Factors Affecting One-time Contributors to Ad-hoc Online Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 609--623.  ",
      "doi": "10.1145/2818048.2820075"
    },
    {
      "text": "Margaret Mead and Franz Boas. 1973. Coming of age in Samoa. Penguin.",
      "doi": ""
    },
    {
      "text": "Milton J Nadworny. 1955. Scientific management and the unions, 1900--1932; a historical analysis. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Michael Nebeling, Alexandra To, Anhong Guo, Adrian A. de Freitas, Jaime Teevan, Steven P. Dow, and Jeffrey P. Bigham. 2016. WearWrite: Crowd--Assisted Writing from Smartwatches. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 3834--3846.  ",
      "doi": "10.1145/2858036.2858169"
    },
    {
      "text": "Edward Newell and Derek Ruths. 2016. How One Microtask Affects Another. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 3155--3166.  ",
      "doi": "10.1145/2858036.2858490"
    },
    {
      "text": "Jon Noronha, Eric Hysen, Haoqi Zhang, and Krzysztof Z. Gajos. 2011. Platemate: Crowdsourcing Nutritional Analysis from Food Photographs. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 1--12.  ",
      "doi": "10.1145/2047196.2047198"
    },
    {
      "text": "David Oleson, Alexander Sorokin, Greg Laughlin, Vaughn Hester, John Le, and Lukas Biewald. 2011. Programmatic Gold: Targeted and Scalable Quality Assurance in Crowdsourcing. (2011). http: //www.aaai.org/ocs/index.php/WS/AAAIW11/paper/view/3995",
      "doi": ""
    },
    {
      "text": "Judith S Olson and Wendy A Kellogg. 2014. Ways of Knowing in HCI. Springer. ",
      "doi": "10.5555/2631405"
    },
    {
      "text": "Mancur Olson. 1965. Logic of collective action public goods and the theory of groups Rev. ed..",
      "doi": ""
    },
    {
      "text": "Elinor Ostrom. 1990. Governing the commons: The evolution of institutions for collective action. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on amazon mechanical turk. Judgment and Decision making 5, 5 (2010), 411--419.",
      "doi": ""
    },
    {
      "text": "Paolo Parigi and Xiao Ma. 2016. The Gig Economy. XRDS 23, 2 (Dec. 2016), 38--41.  ",
      "doi": "10.1145/3013496"
    },
    {
      "text": "Alexander J. Quinn and Benjamin B. Bederson. 2011. Human Computation: A Survey and Taxonomy of a Growing Field. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 1403--1412.  ",
      "doi": "10.1145/1978942.1979148"
    },
    {
      "text": "Hugh Raynbird. 1847. Essay on Measure Work, locally known as task, piece, job, or grate work (in its application to agricultural labour).",
      "doi": ""
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S. Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S. Bernstein. 2014. Expert Crowdsourcing with Flash Teams. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 75--85.  ",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Frank Richards. 1904. Is Anything the Matter with Piecework. ASME.",
      "doi": ""
    },
    {
      "text": "Jacob August Riis. 1901. How the other half lives: Studies among the tenements of New York. Penguin.",
      "doi": ""
    },
    {
      "text": "Horst WJ Rittel and Melvin M Webber. 1973. Dilemmas in a general theory of planning. Policy sciences 4, 2 (1973), 155--169.",
      "doi": ""
    },
    {
      "text": "D. H. Robertson. 1912. A Narrative of the Coal Strike. The Economic Journal 22, 87 (1912), 365--387. http://www.jstor.org/stable/2221944",
      "doi": ""
    },
    {
      "text": "Nathan Rosenberg. 1982. Inside the black box: technology and economics. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Nathan Rosenberg. 1994. Exploring the black box: Technology, economics, and history. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who Are the Crowdworkers?: Shifting Demographics in Mechanical Turk. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "James Rowan. 1901. A Premium System of Remunerating Labour. Proceedings of the Institution of Mechanical Engineers 61, 1 (1901), 865--882.",
      "doi": ""
    },
    {
      "text": "Donald Roy. 1954. Eficiency and the \"x\": Informal intergroup relations in a piecework machine shop. American journal of sociology (1954), 255--266.",
      "doi": ""
    },
    {
      "text": "Jeffrey Rzeszotarski and Aniket Kittur. 2012. CrowdScape: Interactively Visualizing User Behavior and Output. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, 55--62.  ",
      "doi": "10.1145/2380116.2380125"
    },
    {
      "text": "Jeffrey M. Rzeszotarski and Aniket Kittur. 2011. Instrumenting the Crowd: Using Implicit Behavioral Measures to Predict Task Performance. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 13--22.  ",
      "doi": "10.1145/2047196.2047199"
    },
    {
      "text": "Niloufar Salehi, Lilly C. Irani, Michael S. Bernstein, Ali Alkhatib, Eva Ogbe, Kristy Milland, and Clickhappier. 2015. We Are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1621--1630.  ",
      "doi": "10.1145/2702123.2702508"
    },
    {
      "text": "Lowell J. Satre. 1982. After the Match Girls' Strike: Bryant and May in the 1890s. Victorian Studies 26, 1 (1982), 7--31. http://www.jstor.org/stable/3827491",
      "doi": ""
    },
    {
      "text": "Trebor Scholz. 2012. Digital labor: The Internet as playground and factory. Routledge. ",
      "doi": "10.5555/2432415"
    },
    {
      "text": "Victor S. Sheng, Foster Provost, and Panagiotis G. Ipeirotis. 2008. Get Another Label? Improving Data Quality and Data Mining Using Multiple, Noisy Labelers. In Proceedings of the 14th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '08). ACM, 614--622.  ",
      "doi": "10.1145/1401890.1401965"
    },
    {
      "text": "Pao Siangliulue, Kenneth C. Arnold, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, 937--945.  ",
      "doi": "10.1145/2675133.2675239"
    },
    {
      "text": "Six Silberman. 2015. Stop citing Ross et al. 2010, \"Who are the crowdworkers?\". (3 2015). https://medium.com/@silberman/stop-citing-ross-et-al2010-who-are-the-crowdworkers-b3b9b1e8d300",
      "doi": ""
    },
    {
      "text": "Thiago H Silva, Pedro OS Vaz de Melo, Aline Carneiro Viana, Jussara M Almeida, Juliana Salles, and Antonio AF Loureiro. 2013. Trafic condition is more than colored lines on a map: characterization of waze alerts. In International Conference on Social Informatics. Springer, 309--318.  ",
      "doi": "10.1007/978-3-319-03260-3_27"
    },
    {
      "text": "Walter Skok. 1999. Knowledge Management: London Taxi Cabs Case Study. In Proceedings of the 1999 ACM SIGCPR Conference on Computer Personnel Research (SIGCPR '99). ACM, 94--101.  ",
      "doi": "10.1145/299513.299625"
    },
    {
      "text": "Walter Skok. 2000. Managing knowledge within the London taxi cab service. Knowledge and Process Management 7, 4 (2000), 224.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Niloufar Salehi, Michelle S. Lam, Juan C. Marroquin, and Michael S. Bernstein. 2016. Atelier: Repurposing Expert Crowdsourcing Tasks As Micro--internships. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2645--2656.  ",
      "doi": "10.1145/2858036.2858121"
    },
    {
      "text": "John C. Tang, Manuel Cebrian, Nicklaus A. Giacobe, Hyun-Woo Kim, Taemie Kim, and Douglas \"Beaker\" Wickert. 2011. Reflecting on the DARPA Red Balloon Challenge. Commun. ACM 54, 4 (4 2011), 78--85.  ",
      "doi": "10.1145/1924421.1924441"
    },
    {
      "text": "Frederick Winslow Taylor. 1896. A piece rate system. Economic Studies 1, 2 (1896), 89.",
      "doi": ""
    },
    {
      "text": "Frederick Winslow Taylor. 1911. The principles of scientific management. Harper.",
      "doi": ""
    },
    {
      "text": "Jaime Teevan, Shamsi T. Iqbal, Carrie J. Cai, Jeffrey P. Bigham, Michael S. Bernstein, and Elizabeth M. Gerber. 2016b. Productivity Decomposed: Getting Big Things Done with Little Microtasks. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, 3500--3507.  ",
      "doi": "10.1145/2851581.2856480"
    },
    {
      "text": "Jaime Teevan, Shamsi T. Iqbal, and Curtis von Veh. 2016a. Supporting Collaborative Writing with Microtasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2657--2668.  ",
      "doi": "10.1145/2858036.2858108"
    },
    {
      "text": "Jaime Teevan, Daniel J. Liebling, and Walter S. Lasecki. 2014. Selfsourcing Personal Tasks. In CHI '14 Extended Abstracts on Human Factors in Computin  ",
      "doi": "10.1145/2559206.2581181"
    }
  ]
}