{
  "doi": "10.1145/3025453.3025650",
  "title": "The Design Fictions of Philanthropic IT: Stuck Between an Imperfect Present and an Impossible Future",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "7015-7028",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we examine the stories about philanthropic IT that circulate via product websites, marketing materials, and third-party news articles. Through a series of product-centered case studies, we surface these texts' implicit and explicit visions about the (near) future of philanthropy. We detail their prescriptions about how, why, and in service of what ends nonprofit organizations could, should, and ought to leverage IT. We also examine their underlying assumptions about philanthropy: how social good is accomplished, how philanthropic organizations are - and might be more - effective, to whom organizations and beneficiaries should be accountable, and the terms of that accountability. Analyzing these visions as design fictions, we argue that they help cultivate unrealistic anticipatory relationships to the present and entail concomitantly unrealistic imperatives for the philanthropic sector. We conclude by arguing for the crucial role of HCI scholars in disrupting these impossible futures, and by highlighting areas needing further, re-imagined, research.",
  "authors": [
    {
      "name": "Ellie Harmon",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81328488651/rel-imgonly/me_jtree.jpeg",
      "acmid": "81328488651",
      "orcid": "missing"
    },
    {
      "name": "Chris Bopp",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-99659131212/rel-imgonly/bopp_headshot.jpg",
      "acmid": "99659131212",
      "orcid": "missing"
    },
    {
      "name": "Amy Voida",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100147309",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amelia Abreau. 2016. Towards an Ethics of Care: Understanding and Acknowledging Care Work in Technology Companies. Talk at Open Source Bridge. June 21-24, 2016, Portland Oregon. Text available at: https://medium.com/@ameliaabreu/towards-an-ethicof-care-26769966feca",
      "doi": ""
    },
    {
      "text": "Vincanne Adams, Michelle Murphy, and Adele E Clarke. 2009. \"Anticipation: Technoscience, Life, Affect, Temporality\" Subjectivity. 28: 246.",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making cultures: empowerment, participation, and democracy - or not? In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Matthew P. Aylett and Shaun Lawson. 2016. The Smartphone: A Lacanian Stain, A Tech Killer, and an Embodiment of Radical Individualism. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 501--511.  ",
      "doi": "10.1145/2851581.2892581"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2016. Humanistic HCI. interactions 23, 2 (February 2016), 20--29.",
      "doi": ""
    },
    {
      "text": "Eric P. S. Baumer and M. Six Silberman. 2011. When the Implication is Not to Design (Technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday's Tomorrows: Notes on Ubiquitous Computing's Dominant Vision. Personal Ubiquitous Comput. 11, 2 (January 2007), 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Julian Bleeker. 2009. Design Fiction: A Short Essay on Design, Science Fact, and Science Fiction. Near Future Laboratory. Available at:",
      "doi": ""
    },
    {
      "text": "Chris Bopp, Ellie Harmon, and Amy Voida. 2017. Disempowered by Data. To appear in Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2017). New York: ACM Press.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2014. Research through Design Fiction: Narrative in Real and Imaginary Abstracts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 703--712.  ",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Ryan Champagne, Julio Guerra, Chun-Hua Tsai, Jocelyn Monahan, and Rosta Farzan. 2015. Fuzziness in LGBT Non-profit ICT Use. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (ICTD '15). ACM, New York, NY, USA, Article 30, 4 pages.  ",
      "doi": "10.1145/2737856.2737893"
    },
    {
      "text": "Adele Clarke. 2005. Situational Analysis. Sage Publications.",
      "doi": ""
    },
    {
      "text": "G. F. Davis, D. McAdam, W. R. Scott & M. N. Zald (Eds.), Social Movements and Organizational Theory (pp. 41--68). Cambridge, UK: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Lynn Dombrowski, Amy Voida, Gillian R. Hayes, and Melissa Mazmanian. 2012. The Labor Practices of Service Mediation: A Study of the Work Practices of Food Assistance Outreach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1977-1986.  ",
      "doi": "10.1145/2207676.2208342"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. The MIT Press. ",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Hamid R. Ekbia, Bonnie Nardi, and Selma Sabanovic. 2015. On the Margins of the Machine: Heteromation and Robotics. iConference 2015. http://hdl.handle.net/2142/73678",
      "doi": ""
    },
    {
      "text": "Martha Feldman. 1995. Strategies for Interpreting Qualitative Data. Sage.",
      "doi": ""
    },
    {
      "text": "Martha S. Feldman and Julka Almquist. 2011. Analyzing the Implicit in Stories. In Varieties of Narrative Analysis. J. Holstein and J. Gubrium (Eds.). Sage Publishing.",
      "doi": ""
    },
    {
      "text": "Claude S. Fischer. America calling: a social history of the telephone to 1940. University of California Press, March 1992. ",
      "doi": "10.5555/528466"
    },
    {
      "text": "Jeremy Goecks, Amy Voida, Stephen Voida, and Elizabeth D. Mynatt. 2008. Charitable Technologies: Opportunities for Collaborative Computing in Nonprofit Fundraising. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, New York, NY, USA, 689698.  ",
      "doi": "10.1145/1460563.1460669"
    },
    {
      "text": "Ellie Harmon, Matthias Korn, and Amy Voida. 2017. Supporting Everyday Philanthropy: Care Work in Situ and at Scale. To appear in Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work (CSCW '17). ACM, New York, NY, USA.  ",
      "doi": "10.1145/2998181.2998330"
    },
    {
      "text": "Ellie Harmon and Melissa Mazmanian. 2013. Stories of the Smartphone in Everyday Discourse: Conflict, Tension & Instability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1051--1060.  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "Lilly Irani and M. Six Silberman. 2014. From Critical Design to Critical Infrastructure: Lessons from Turkopticon. interactions 21, 4 (July 2014), 32--35.  ",
      "doi": "10.1145/2627392"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2016. Stories We Tell About Labor: Turkopticon and the Trouble with \"Design\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4573--4586.  ",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Steven J. Jackson and Laewoo Kang. 2014. Breakdown, Obsolescence and Reuse: HCI and the Art of Repair. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 449--458.  ",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Sunyoung Kim, Jennifer Mankoff, and Eric Paulos. 2015. Exploring Barriers to the Adoption of Mobile Technologies for Volunteer Data Collection Campaigns. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3117--3126.  ",
      "doi": "10.1145/2702123.2702378"
    },
    {
      "text": "John Kolko. 2010. Sensemaking and Framing: A Theoretical Reflection on Perspective in Design Synthesis. In Proceedings of the 2010 Design Research Society Conference.",
      "doi": ""
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating Friction: Infrastructuring Civic Engagement in Everyday Life. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15). Aarhus University Press 145--156.  ",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Christopher A. Le Dantec and W. Keith Edwards. 2008. The View from the Trenches: Organization, Power, and Technology at Two Nonprofit Homeless Outreach Centers. In Proceedings of the 2008 ACM Cconference on Computer supported cooperative work (CSCW '08). ACM, New York, NY, USA, 589598.  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "Ann Light. 2011. HCI as Heterodoxy: Technologies of Identity and the Queering of Interaction with Computers. Interact. Comput. 23, 5 (September 2011), 430--438.  ",
      "doi": "10.1016/j.intcom.2011.02.002"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Back to the Future: 10 Years of Design Fiction. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, New York, NY, USA, 210--211.  ",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "Melissa Mazmanian, Ingrid Erickson, and Ellie Harmon. 2015. Circumscribed Time and Porous Time: Logics as a Way of Studying Temporality. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1453--1464.  ",
      "doi": "10.1145/2675133.2675231"
    },
    {
      "text": "Porta, D. D. & Diani, M. 2006. Individuals, Networks and Participation. In Social Movements: An Introduction. (2nd ed). Malder, MA: Blackwell Publishing.",
      "doi": ""
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 97--107.  ",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Schmidt, K. & Bannon, L. 1992. Taking CSCW Seriously. Computer Supported Cooperative Work, 1(1-2), 7--40.",
      "doi": ""
    },
    {
      "text": "Stephanie B. Steinhardt and Steven J. Jackson. 2015. Anticipation Work: Cultivating Vision in Collective Practice. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 443--453.  ",
      "doi": "10.1145/2675133.2675298"
    },
    {
      "text": "Bruce Sterling. 2005. Shaping Things. MIT Press.",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2009. Design Fiction. interactions 16, 3 (May 2009), 20--24.  ",
      "doi": "10.1145/1516016.1516021"
    },
    {
      "text": "Lucy Suchman. 1995. Making Work Visible. Commun. ACM 38, 9 (September 1995), 56--64.  ",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Katie G. Tanaka and Amy Voida. 2016. Legitimacy Work: Invisible Work in Philanthropic Crowdfunding. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4550--4561.  ",
      "doi": "10.1145/2858036.2858110"
    },
    {
      "text": "Charlotte Tang, Yunan Chen, Bryan C. Semaan, and Jahmeilah A. Roberson. 2015. Restructuring Human Infrastructure: The Impact of EHR Deployment in a Volunteer-Dependent Clinic. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 649--661.  ",
      "doi": "10.1145/2675133.2675277"
    },
    {
      "text": "Nitya Verma and Amy Voida. 2016. Mythologies of Business Intelligence. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2341--2347.  ",
      "doi": "10.1145/2851581.2892379"
    },
    {
      "text": "Amy Voida, Lynn Dombrowski, Gillian R. Hayes, and Melissa Mazmanian. 2014. Shared Values/Conflicting Logics: Working Around E-government Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3583--3592.  ",
      "doi": "10.1145/2556288.2556971"
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging Between Organizations and the Public: Volunteer Coordinators' Uneasy Relationship with Social Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1967--1976.  ",
      "doi": "10.1145/2207676.2208341"
    },
    {
      "text": "Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew Databases: Complexities of Everyday Information Management in Nonprofit Organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 915--924.  ",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Voida, A., Harmon, E., Weller, W., Thornsbury, A., Casale, A., Vance, S., Adams, F., Hoffman, Z., Schmidt, A., Grimley, K., Cox, L., Neeley, A. & Goodyear, C. 2017. Competing Currencies: Designing for Politics in Units of Measurement. To appear in Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing.  ",
      "doi": "10.1145/2998181.2998209"
    },
    {
      "text": "Amy Voida, Zheng Yao, and Matthias Korn. 2015. (Infra)structures of Volunteering. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1704--1716.  ",
      "doi": "10.1145/2675133.2675153"
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2016. When a Product Is Still Fictional: Anticipating and Speculating Futures through Concept Videos. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 121--133. TEXTS  ",
      "doi": "10.1145/2901790.2901801"
    },
    {
      "text": "\"Blackbaud History\" Blackbaud Website. Archived on October 30, 1996. Available at: https://web.archive.org/web/19961030085538/http://www.blackbaud.com/aboutbb/hist/history.htm",
      "doi": ""
    },
    {
      "text": "\"The Raiser's Edge for Windows\" Blackbaud Website. Archived on October 30, 1996: https://web.archive.org/web/19961030085954/http://www.blackbaud.com/PRODUCTS/rewin.htm",
      "doi": ""
    },
    {
      "text": "\"Blackbaud - Products - NetSolutions\" Blackbaud Website. Archived on June 4, 2001: https://web.archive.org/web/20010604171929/http://www.blackbaud.com/products/NetSolutions/default.asp?ID=solns",
      "doi": ""
    },
    {
      "text": "\"Blackbaud - About Us - October 19 Press Release\" Blackbaud Website. Archived on June 4, 2001: https://web.archive.org/web/20010604160011/http://www.blackbaud.com/aboutus/pressreleases/PR_Radiothon.asp",
      "doi": ""
    },
    {
      "text": "\"Blackbaud, Inc. - Welcome\" Blackbaud Website. Archived on June 4, 2001: https://web.archive.org/web/20010604201722/http://www.blackbaud.com/",
      "doi": ""
    },
    {
      "text": "\"Blackbaud Overview\" Blackbaud Website. Accessed September 2016: https://www.blackbaud.com/company/",
      "doi": ""
    },
    {
      "text": "\"Nonprofit CRM, Constituent Relationship Management - Blackbaud\" Blackbaud Website. Accessed September 2016: https://www.blackbaud.com/CRM",
      "doi": ""
    },
    {
      "text": "\"Fundraising for Nonprofits, Nonprofit Software Blackbaud\" Blackbaud Website. Accessed September 2016: https://www.blackbaud.com/",
      "doi": ""
    },
    {
      "text": "\"Raiser's Edge: Fundraising & Donor Management Software\" Blackbaud Website. Accessed September 2016: https://www.blackbaud.com/fundraising-andrelationship-management/raisers-edge",
      "doi": ""
    },
    {
      "text": "\"Data Health Scorecard\" Blackbaud Web Materials. Accessed September 2016: https://www.blackbaud.com/files/resources/re-datahealth-scorecard-0714.pdf",
      "doi": ""
    },
    {
      "text": "\"Luminate Nonprofit CRM Software | Blackbaud\" Blackbaud Website. Accessed September 2016: https://www.blackbaud.com/fundraising-crm/luminatecrm",
      "doi": ""
    },
    {
      "text": "\"Charity Navigator - Guiding Intelligent Giving - Charitable Donations\" {Our Mission} Charity Navigator Website. Archived on August 2, 2002: https://web.archive.org/web/20020802122956/http://charitynavigator.org/index.cfm/bay/content.view/catid/1/cpid/17.htm",
      "doi": ""
    },
    {
      "text": "\"Charity Navigator - Guiding Intelligent Giving - Charitable Donations\" {Our Vision} Charity Navigator website. Archived on August 2, 2002: https://web.archive.org/web/20020615135008/http://www.charitynavigator.org/index.cfm/bay/content.view/c atid/1/cpid/27.htm",
      "doi": ""
    },
    {
      "text": "\"Charity Navigator - Your Guide to Intelligent Giving | Home\" Charity Navigator Website. Accessed September 2016: http://www.charitynavigator.org/",
      "doi": ""
    },
    {
      "text": "\"The Timeline of Charity Navigator: Charity Navigator\" Charity Navigator Website. Accessed September 2016: http://www.charitynavigator.org/index.cfm?bay=content.view&cpid=1957",
      "doi": ""
    },
    {
      "text": "\"Video: The History of Charity Navigator: Charity Navigator\" Charity Navigator Website. Accessed September 2016: https://www.charitynavigator.org/index.cfm?bay=content.view&cpid=1535",
      "doi": ""
    },
    {
      "text": "\"Mission: Charity Navigator\" Charity Navigator Website. Accessed September 2016: http://www.charitynavigator.org/index.cfm?bay=content.view&cpid=17",
      "doi": ""
    },
    {
      "text": "\"How do we rate Charities' Financial Health? Charity Navigator\" Charity Navigator Website. Accessed September 2016: http://www.charitynavigator.org/index.cfm?bay=content.view&cpid=35",
      "doi": ""
    },
    {
      "text": "\"How do we rate Charities' Charity Navigator\" Charity Navigator Website. Accessed September 2016: http://www.charitynavigator.org/index.cfm?bay=content.view&cpid=1284",
      "doi": ""
    },
    {
      "text": "Wallace, Nicole. 2002. \"New Watchdog Group Puts Charity Ratings Online.\" The Chronicle of Philanthropy. May 14, 2002. Archived version available without a paywall at: https://web.archive.org/web/20020603152455/http://www.charitynavigator.org/index.cfm/bay/content.view/c atid/38/cpid/67.htm",
      "doi": ""
    },
    {
      "text": "Carnes, Ann. 2016. \"Charity Navigator Tweaks Its Rating System\" May 28, 2016. The New York Times. Your Money. Accessed September 2016: http://www.nytimes.com/2016/05/28/yourmoney/charity-navigator-tweaks-its-ratingsystem.html?_r=0",
      "doi": ""
    },
    {
      "text": "The Editors. \"Guidestar, Charity Navigator, and Wise Giving Alliance Call for End to Overhead Obsession\" June 17, 2016. Nonprofit Quarterly (NPQ). https://nonprofitquarterly.org/2013/06/17/guidestarcharity-navigator-and-wise-giving-alliance-call-forend-to-overhead-obsession/",
      "doi": ""
    },
    {
      "text": "\"VolunteerMatch - Where Volunteering Begins\" VolunteerMatch Website. Accessed September 2016: http://www.volunteermatch.org/",
      "doi": ""
    },
    {
      "text": "Carnegie Corporation of New York. 2008. \"VolunteerMatch: An Online Service Helps Everyone Find a Great Place to Volunteer\" Carnegie Reports. Available for download as of September 2016: https://www.carnegie.org/media/filer_public/22/d3/22d 37609-0b2f-404c-b9e8--299311853b13/ccny_cresults_2008_volunteermatch.pdf",
      "doi": ""
    },
    {
      "text": "\"Attentive.ly\" Attentive.ly Website. Accessed September 2016: https://attentive.ly/",
      "doi": ""
    },
    {
      "text": "\"About Us | Attentive.ly\" Attentive.ly Website. Accessed September 2016: https://attentive.ly/team/",
      "doi": ""
    },
    {
      "text": "\"Attentive.ly Acquired by Blackbaud | Attentive.ly\" Attentive.ly Website. Accessed September 2016: https://attentive.ly/press/better-together/",
      "doi": ""
    },
    {
      "text": "\"Klout Score\" Klout Website. Accessed September 2016: https://klout.com/corp/score",
      "doi": ""
    },
    {
      "text": "\"HandUp - Direct Giving for the Homeless and others At Risk\" HandUp Website. Accessed September 2016: https://handup.org/",
      "doi": ""
    },
    {
      "text": "\"About HandUp\" HandUp Website. Accessed September 2016: https://handup.org/about",
      "doi": ""
    },
    {
      "text": "\"FAQ\" a javascript popup, accessible via \"HandUp Gift Cards\" HandUp Website. Accessed September 2016: https://handup.org/giftcards",
      "doi": ""
    },
    {
      "text": "Lee Clifford. 2015. \"Here's the Right Way To Give Charity This Year\" December 10, 2015. Fortune. http://fortune.com/2015/12/10/right-way-give-charity/",
      "doi": ""
    },
    {
      "text": "Stacy Donahue. 2015. \"Civic Tech Brings Power And Positivity To The People\" November 14, 2015. TechCrunch. https://techcrunch.com/2015/11/14/civictech-brings-power-and-positivity-to-the-people/",
      "doi": ""
    },
    {
      "text": "Kevin Fagan. 2016. \"Rose Broome Uses Crowdfunding to Offer Hope to Homeless\" March 9, 2016. SF Gate. http://www.sfgate.com/visionsf/article/Rose-Broome-uses-crowdfunding-to-offerhope-to-6857696.php",
      "doi": ""
    },
    {
      "text": "Christina Farr. 2013. \"Hacking Homelessness: HandUp Lets You Help Out Via Mobile Phone Donations\" August 20, 2013. VentureBeat. http://venturebeat.com/2013/08/20/hacking-homelessness-handup-ensures-your-donation-goes-toward-food-and-shelter/",
      "doi": ""
    },
    {
      "text": "Michael Gentilucci. 2014. \"Okay, We Hear You: Google Steps Up Focus on Bay Area Poverty\" Inside Philanthropy. http://www.insidephilanthropy.com/tech-philanthropy/2014/12/18/okay-we-hear-yougoogle-steps-up-focus-on-bay-area-poverty.html",
      "doi": ""
    },
    {
      "text": "John Greathouse. 2015. \"Why Google Backed This Uber-Cool B Corp\" February 2, 2015. Forbes. http://www.forbes.com/sites/johngreathouse/2015/02/0 2/why-google-backed-this-uber-cool-b-corp/#29a2f17832a1",
      "doi": ""
    },
    {
      "text": "Richard Taylor. \"Social Start-up Gives Homeless People a Helping Hand\" July 5, 2015. BBC. http://www.bbc.com/news/technology-33325407",
      "doi": ""
    },
    {
      "text": "Lora Kolodny. \"A Crowdfunding App for the Homeless, HandUp Raises $850,000\" July 16, 2014. Wall Street Journal. http://blogs.wsj.com/venturecapital/2014/07/16/a-crowdfunding-app-for-the-homeless-handup-raises-850000/",
      "doi": ""
    }
  ]
}