{
  "doi": "10.1145/3025453.3025729",
  "title": "Kinecting with Orangutans: Zoo Visitors' Empathetic Responses to Animals' Use of Interactive Technology",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6075-6088",
  "year": 2017,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Animal conservation organisations occasionally harness depictions of animals using digital technology to inspire interest in, and concern for animals. To better understand the forms of empathy experienced by people observing animal-computer interaction, we designed and studied an interactive installation for orangutans at a zoo. Through collaborative design we established an understanding of zoos' objectives and strategies related to empathy in the zoo context. We deployed a prototype installation, and observed and interviewed visitors who watched orangutans use the installation. Analysis of observations and interviews revealed that visitors responded with cognitive, affective and motor empathy for the animals. We propose that these empathetic responses are prompted by the visibility of orangutans' bodily movements, by the \"anthropic frame\" provided by digital technology, and by prompting reflection on animals' cognitive processes and affective states. This paper contributes new evidence and understanding of people's empathetic responses to observing animal-computer interaction and confirms the value of designing for empathy in its various forms",
  "authors": [
    {
      "name": "Sarah Webber",
      "institution": "University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159053057",
      "orcid": "0000-0002-3144-9957"
    },
    {
      "name": "Marcus Carter",
      "institution": "University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81543822756",
      "orcid": "missing"
    },
    {
      "name": "Sally Sherwen",
      "institution": "Zoos Victoria, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022309",
      "orcid": "missing"
    },
    {
      "name": "Wally Smith",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324494027",
      "orcid": "0000-0002-1059-6704"
    },
    {
      "name": "Zaher Joukhadar",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-99659160139/rel-imgonly/14519891_10154577623286800_765132742204248888_n.jpg",
      "acmid": "99659160139",
      "orcid": "missing"
    },
    {
      "name": "Frank Vetere",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    }
  ],
  "references": [
    {
      "text": "Joelle Alcaidinho, Giancarlo Valentin, Stephanie Tai, Brian Nguyen, Krista Sanders, Melody Jackson, Eric Gilbert, and Thad Starner. 2015. Leveraging Mobile Technology to Increase the Permanent Adoption of Shelter Dogs. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15), 463--469.  ",
      "doi": "10.1145/2785830.2785861"
    },
    {
      "text": "Roy Ballantyne, Jan Packer, Karen Hughes, and Lynn Dierking. 2007. Conservation learning in wildlife tourism settings: lessons from research in zoos and aquariums. Environmental Education Research 13, 3: 367--383.",
      "doi": ""
    },
    {
      "text": "Roy Ballantyne, Jan Packer, and Lucy A. Sutherland. 2011. Visitors' memories of wildlife tourism: Implications for the design of powerful interpretive experiences. Tourism Management 32, 4: 770--779.",
      "doi": ""
    },
    {
      "text": "C. Daniel Batson. 2009. These things called empathy: Eight related but distinct phenomena. In The social neuroscience of empathy, J. Decety and W. Ickes (eds.). MIT Press, Cambridge, MA, 3--15.",
      "doi": ""
    },
    {
      "text": "Jonathan Belman and Mary Flanagan. 2010. Designing games to foster empathy. International Journal of Cognitive Technology 15, 1: 11.",
      "doi": ""
    },
    {
      "text": "Jaime Berenguer. 2007. The Effect of Empathy in Proenvironmental Attitudes and Behaviors. Environment and Behavior 39, 2: 269--283.",
      "doi": ""
    },
    {
      "text": "Sarah M. Bexell, Olga S. Jarrett, and Xu Ping. 2013. The Effects of a Summer Camp Program in China on Children's Knowledge, Attitudes, and Behaviors Toward Animals: A Model for Conservation Education. Visitor Studies 16, 1: 59--81.",
      "doi": ""
    },
    {
      "text": "Sarah Marie Bexell. 2006. Effect of a Wildlife Conservation Camp Experience in China on Student Knowledge of Animals, Care, Propensity for Environmental Stewardship, and Compassionate Behavior Toward Animals. Retrieved August 21, 2016 from http://scholarworks.gsu.edu/ece_diss/1/",
      "doi": ""
    },
    {
      "text": "R. J. R. Blair. 2005. Responding to the emotions of others: Dissociating forms of empathy through the study of typical and psychiatric populations. Consciousness and Cognition 14, 4: 698--718.",
      "doi": ""
    },
    {
      "text": "Danielle M. A. Bons, Floor E. Scheepers, Nanda N. J. Rommelse, and Jan K. Buitelaar. 2010. Motor, Emotional and Cognitive Empathic Abilities in Children with Autism and Conduct Disorder. In Proceedings of the 7th International Conference on Methods and Techniques in Behavioral Research (MB '10), 4:1--4:5.  ",
      "doi": "10.1145/1931344.1931348"
    },
    {
      "text": "Helen Boostrom. 2013. Problem-solving with orangutans (Pongo Pygmaeus and Pongo Abelii) and chimpanzees (Pan Troglodytes): Using the iPad to provide novel enrichment opportunities. Texas A&M University. Retrieved July 1, 2015 from http://oaktrust.library.tamu.edu/handle/1969.1/150918",
      "doi": ""
    },
    {
      "text": "Karin Brulliard. 2016. Los Angeles Zoo animals are showing off some strong selfie skills. Washington Post. Retrieved September 19, 2016 from https://www.washingtonpost.com/news/animalia/wp/20 16/03/10/los-angeles-zoo-animals-are-showing-off-some-strong-selfie-skills/",
      "doi": ""
    },
    {
      "text": "Max E. Butterfield, Sarah E. Hill, and Charles G. Lord. 2012. Mangy mutt or furry friend? Anthropomorphism promotes animal welfare. Journal of Experimental Social Psychology 48, 4: 957--960.",
      "doi": ""
    },
    {
      "text": "Andrea W. Clay, Bonnie M. Perdue, Diann E. Gaalema, Francine L. Dolins, and Mollie A. Bloomsmith. 2011. The use of technology to enhance zoological parks. Zoo Biology 30, 5: 487--497.",
      "doi": ""
    },
    {
      "text": "Susan Clayton, John Fraser, and Carol D. Saunders. 2009. Zoo experiences: conversations, connections, and concern for animals. Zoo Biology 28, 5: 377--397.",
      "doi": ""
    },
    {
      "text": "Susan Clayton and Gene Myers. 2015. Conservation Psychology: Understanding and Promoting Human Care for Nature. Wiley-Blackwell, Chichester, UK.",
      "doi": ""
    },
    {
      "text": "Shannon Cuykendall, Ethan Soutar-Rau, Karen Cochrane, Jacob Freiberg, and Thecla Schiphorst. 2015. Simply Spinning: Extending Current Design Frameworks for Kinesthetic Empathy. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), 305--312.  ",
      "doi": "10.1145/2677199.2680567"
    },
    {
      "text": "Beth Daly and L. L. Morton. 2006. An investigation of human-animal interactions and empathy as related to pet preference, ownership, attachment, and attitudes in children. Anthrozoös 19, 2: 113--127.",
      "doi": ""
    },
    {
      "text": "Mark H. Davis. 1983. Measuring individual differences in empathy: Evidence for a multidimensional approach. Journal of Personality and Social Psychology 44, 1: 113--126.",
      "doi": "10.1037/0022-"
    },
    {
      "text": "Mathias Dekeyser, Robert Elliott, and Mia Leijssen. 2011. Empathy in psychotherapy: Dialogue and embodied understanding. In The Social Neuroscience of Empathy, Jean Decety and William Ickes (eds.). MIT Press, Cambridge, MA, 113--124.",
      "doi": ""
    },
    {
      "text": "Marjorie L. DeVault. 2000. Producing Family Time: Practices of Leisure Activity Beyond the Home. Qualitative Sociology 23, 4: 485--503.",
      "doi": ""
    },
    {
      "text": "Clemens Driessen, Kars Alfrink, Marinka Copier, Hein Lagerweij, and Irene van Peer. 2014. What could playing with pigs do to us? Game design as multispecies philosophy. Antennae, 30: 79.",
      "doi": ""
    },
    {
      "text": "John H. Falk, Eric M. Reinhard, Cynthia L. Vernon, Kerry Bronnenkant, and Nora L. Deans. 2007. Why Zoos & Aquariums Matter: Assessing the Impact of a Visit to a Zoo or Aquarium. Association of Zoos and Aquariums. Retrieved from https://www.aza.org/uploadedFiles/Education/why_zoos_matter.pdf",
      "doi": ""
    },
    {
      "text": "Sarah Fdili Alaoui, Thecla Schiphorst, Shannon Cuykendall, Kristin Carlson, Karen Studd, and Karen Bradley. 2015. Strategies for Embodied Design: The Value and Challenges of Observing Movement. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15), 121--130.  ",
      "doi": "10.1145/2757226.2757238"
    },
    {
      "text": "Eduardo J. Fernandez, Michael A. Tamborski, Sarah R. Pickens, and William Timberlake. 2009. Animal-visitor interactions in the modern zoo: Conflicts and interventions. Applied Animal Behaviour Science 120, 1-2: 1--8.",
      "doi": ""
    },
    {
      "text": "Maiken Hillerup Fogtmann, Jonas Fritsch, and Karen Johanne Kortbek. 2008. Kinesthetic Interaction: Revealing the Bodily Potential in Interaction Design. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08), 89--96.  ",
      "doi": "10.1145/1517744.1517770"
    },
    {
      "text": "Jessica Katherine Frawley and Laurel Evelyn Dyson. 2014. Animal Personas: Acknowledging Non-human Stakeholders in Designing for Sustainable Food Systems. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14), 21--30.  ",
      "doi": "10.1145/2686612.2686617"
    },
    {
      "text": "V. Gazzola, G. Rizzolatti, B. Wicker, and C. Keysers. 2007. The anthropomorphic brain: The mirror neuron system responds to human and robotic actions. NeuroImage 35, 4: 1674--1684.",
      "doi": ""
    },
    {
      "text": "Elizabeth S. Herrelko. 2011. An assessment of the development of a cognitive research programme and introductions in zoo-housed chimpanzees. University of Stirling. Retrieved May 14, 2015 from http://dspace.stir.ac.uk/handle/1893/3654",
      "doi": ""
    },
    {
      "text": "Harold A. Herzog Jr., Nancy S. Betchart, and Robert B. Pittman. 1991. Gender, Sex Role Orientation, and Attitudes toward Animals. Anthrozoös 4, 3: 184--191.",
      "doi": ""
    },
    {
      "text": "Adelma M. Hills. 1995. Empathy and Belief in the Mental Experience of Animals. Anthrozoös 8, 3: 132--142.",
      "doi": ""
    },
    {
      "text": "Jonny Huck, Paul Coulton, David Gullick, Philip Powell, Jennifer Roberts, Andrew Hudson-Smith, Martin De-Jode, and Panagiotis Mavros. 2015. Supporting Empathy Through Embodiment in the Design of Interactive Systems. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), 523--528.  ",
      "doi": "10.1145/2677199.2687892"
    },
    {
      "text": "Ida Kathrine Hammeleff Jørgensen and Hanna Wirman. 2016. Multispecies methods, technologies for play. Digital Creativity 2016, 1: 1--15.",
      "doi": ""
    },
    {
      "text": "Sarah Knight, Aldert Vrij, Julie Cherryman, and Karl Nunkoosing. 2004. Attitudes towards animal use and belief in animal mind. Anthrozoös 17, 1: 43--62.",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Ben Kirman, Conor Linehan, Tom Feltwell, and Lisa Hopkins. 2015. Problematising Upstream Technology Through Speculative Design: The Case of Quantified Cats and Dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2663--2672.  ",
      "doi": "10.1145/2702123.2702260"
    },
    {
      "text": "Rachel Lowry. 2009. Visitor based conservation campaigns at Zoos Victoria. International Zoo Education 45: 11--14.",
      "doi": ""
    },
    {
      "text": "Randy Malamud. 2015. The Problem with Zoos. In The Oxford Handbook of Animal Studies, Linda Kalof (ed.). Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Clara Mancini. 2011. Animal-computer Interaction: A Manifesto. Interactions 18, 4: 69--73.  ",
      "doi": "10.1145/1978822.1978836"
    },
    {
      "text": "Clara Mancini, Rob Harris, Brendan Aengenheister, and Claire Guest. 2015. Re-Centering Multispecies Practices: A Canine Interface for Cancer Detection Dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2673--2682.  ",
      "doi": "10.1145/2702123.2702562"
    },
    {
      "text": "Clara Mancini, Janet van der Linden, Jon Bryan, and Andrew Stuart. 2012. Exploring Interspecies Sensemaking: Dog Tracking Semiotics and Multispecies Ethnography. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 143--152.  ",
      "doi": "10.1145/2370216.2370239"
    },
    {
      "text": "Christopher Flynn Martin, Rahul Bhui, Peter Bossaerts, Tetsuro Matsuzawa, and Colin Camerer. 2014. Chimpanzee choice rates in competitive games match equilibrium game theory predictions. Scientific Reports 4.",
      "doi": ""
    },
    {
      "text": "Katsutoshi Masai, Kai Kunze, Maki Sugimoto, and Mark Billinghurst. 2016. Empathy Glasses. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 1257--1263.  ",
      "doi": "10.1145/2851581.2892370"
    },
    {
      "text": "Olin Eugene Myers and Carol D. Saunders. 2002. Animals as links toward developing caring relationships with the natural world. In Children and nature: Psychological, sociocultural, and evolutionary investigations. MIT Press, Cambridge, MA, 153--178.",
      "doi": ""
    },
    {
      "text": "Olin Eugene Myers, Carol D. Saunders, and Andrej A. Birjulin. 2004. Emotional Dimensions of Watching Zoo Animals: An Experience Sampling Study Building on Insights from Psychology. Curator: The Museum Journal 47, 3: 299--321.",
      "doi": ""
    },
    {
      "text": "Jonathan K. Nelson and Patrick C. Shih. CompanionViz: Mediated platform for gauging canine health and enhancing human-pet interactions. International Journal of Human-Computer Studies.  ",
      "doi": "10.1016/j.ijhcs.2016.04.002"
    },
    {
      "text": "David T. Nguyen and John Canny. 2009. More Than Face-to-face: Empathy Effects of Video Framing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 423--432.  ",
      "doi": "10.1145/1518701.1518770"
    },
    {
      "text": "Jordan Owen. 2016. Snow monkey at Lincoln Park Zoo names her baby by touchscreen. Chicago Sun-Times. Retrieved September 19, 2016 from http://chicago.suntimes.com/news/snow-monkey-at-lincoln-park-zoo-names-her-baby-by-touchscreen/",
      "doi": ""
    },
    {
      "text": "Patricia G. Patrick, Catherine E. Matthews, David Franklin Ayers, and Sue Dale Tunnicliffe. 2007. Conservation and Education: Prominent Themes in Zoo Mission Statements. The Journal of Environmental Education 38, 3: 53--60.",
      "doi": ""
    },
    {
      "text": "Elizabeth S. Paul. 2000. Empathy with Animals and with Humans: Are They Linked? Anthrozoös 13, 4: 194--202.",
      "doi": ""
    },
    {
      "text": "Bonnie M. Perdue, Andrea W. Clay, Diann E. Gaalema, Terry L. Maple, and Tara S. Stoinski. 2012. Technology at the zoo: the influence of a touchscreen computer on orangutans and zoo visitors. Zoo Biology 31, 1: 27--39.",
      "doi": ""
    },
    {
      "text": "Clive Phillips. 2009. Empathy Towards Animals. In The Welfare of Animals. Springer Netherlands, 47--54.",
      "doi": ""
    },
    {
      "text": "Stephanie D. Preston and Frans B. M. de Waal. 2002. Empathy: Its ultimate and proximate bases. The Behavioral and Brain Sciences 25, 1: 1-20--71.",
      "doi": ""
    },
    {
      "text": "Mark Prigg. 2015. P-P-P-Pick up an iPad: Zoo unveils app penguins play with their beak. Daily Mail Online. Retrieved September 19, 2016 from http://www.dailymail.co.uk/sciencetech/article2897908/P-P-P-Pick-iPad-Zoo-unveils-latest-treat-penguins-app-play-beak.html",
      "doi": ""
    },
    {
      "text": "Charlotte Robinson, Clara Mancini, Janet van der Linden, Claire Guest, and Robert Harris. 2014. Canine-centered Interface Design: Supporting the Work of Diabetes Alert Dogs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3757--3766.  ",
      "doi": "10.1145/2556288.2557396"
    },
    {
      "text": "P. Wesley Schultz. 2000. Empathizing With Nature: The Effects of Perspective Taking on Concern for Environmental Issues. Journal of Social Issues 56, 3: 391--406.",
      "doi": ""
    },
    {
      "text": "Simone G. Shamay-Tsoory. 2011. The Neural Bases for Empathy. The Neuroscientist 17, 1: 18--24.",
      "doi": ""
    },
    {
      "text": "Julian Smith. 2011. Apps for apes: Orangutans want iPads for Christmas. New Scientist 212: 69--71.",
      "doi": ""
    },
    {
      "text": "N. Taylor and T. D. Signal. 2005. Empathy and attitudes to animals. Anthrozoös 18, 1: 18--27.",
      "doi": ""
    },
    {
      "text": "Matt Walker. 2010. Movie made by chimpanzees to be broadcast on television. BBC Earth News. Retrieved September 19, 2016 from http://news.bbc.co.uk/earth/hi/earth_news/newsid_8472000/8472831.stm",
      "doi": ""
    },
    {
      "text": "D. A. Washburn. 2015. The four Cs of psychological wellbeing: Lessons from three decades of computerbased environmental enrichment. Animal Behavior and Cognition 2, 3: 218--232.",
      "doi": ""
    },
    {
      "text": "Sarah Webber, Marcus Carter, Wally Smith, and Frank Vetere. 2016. Interactive Technology and HumanAnimal Encounters at the Zoo. International Journal of Human-Computer Studies 98: 150--168.  ",
      "doi": "10.1016/j.ijhcs.2016.05.003"
    },
    {
      "text": "Michelle Westerlaken and Stefano Gualeni. 2013. Digitally Complemented Zoomorphism: a Theoretical Foundation for Human-Animal Interaction Design. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces.  ",
      "doi": "10.1145/2513506.2513527"
    },
    {
      "text": "Andrew D. Wilson. 2010. Using a Depth Camera As a Touch Sensor. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10), 69--72.  ",
      "doi": "10.1145/1936652.1936665"
    },
    {
      "text": "Hanna Wirman. 2014. Games for / with strangers - Captive orangutan (pongo pygmaeus) touch screen play. Antennae, 30: 104--112.",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2008. Empathy and Experience in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    }
  ]
}