{
  "doi": "10.1145/3025453.3025533",
  "title": "HeadPhones: Ad Hoc Mobile Multi-Display Environments through Head Tracking",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3966-3971",
  "year": 2017,
  "badges": [],
  "abstract": "We present HeadPhones (Headtracking + smartPhones), a novel approach for the spatial registration of multiple mobile devices into an ad hoc multi-display environment. We propose to employ the user's head as external reference frame for the registration of multiple mobile devices into a common coordinate system. Our approach allows for dynamic repositioning of devices during runtime without the need for external infrastructure such as separate cameras or fiducials. Specifically, our only requirements are local network connections and mobile devices with built-in front facing cameras. This way, HeadPhones enables spatially-aware multi-display applications in mobile contexts. A user study and accuracy evaluation indicate the feasibility of our approach.",
  "authors": [
    {
      "name": "Jens Grubert",
      "institution": "Coburg University, Coburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020564",
      "orcid": "missing"
    },
    {
      "name": "Matthias Kranz",
      "institution": "University of Passau, Passau, Bavaria, Germany",
      "img": "/do/10.1145/contrib-81336490722/rel-imgonly/matthiaskranz-small.jpg",
      "acmid": "81336490722",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ming Ki Chong and Hans Gellersen. 2012. Usability Classification for Spontaneous Device Association. Personal Ubiquitous Comput. 16, 1 (Jan. 2012), 77--89. DOI: http://dx.doi.org/10.1007/s00779-011-0421-1  ",
      "doi": "10.1007/s00779-011-0421-1"
    },
    {
      "text": "David Dearman, Richard Guy, and Khai Truong. 2012. Determining the Orientation of Proximate Mobile Devices Using Their Back Facing Camera. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2231--2234. DOI: http://dx.doi.org/10.1145/2207676.2208377  ",
      "doi": "10.1145/2207676.2208377"
    },
    {
      "text": "Jens Grubert, Matthias Kranz, and Aaron Quigley. 2016a. Challenges in mobile multi-device ecosystems. mUX: The Journal of Mobile User Experience 5, 1 (2016), 5. DOI: http://dx.doi.org/10.1186/s13678-016-0007-y ",
      "doi": ""
    },
    {
      "text": "Jens Grubert, Eyal Ofek, Michel Pahud, Matthias Kranz, and Dieter Schmalstieg. 2016b. GlassHands: Interaction Around Unmodified Mobile Devices Using Sunglasses. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 215--224. DOI: http://dx.doi.org/10.1145/2992154.2992162  ",
      "doi": "10.1145/2992154.2992162"
    },
    {
      "text": "Ken Hinckley, Gonzalo Ramos, Francois Guimbretiere, Patrick Baudisch, and Marc Smith. 2004. Stitching: Pen Gestures That Span Multiple Displays. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, NY, NY, USA, 23--31. DOI: http://dx.doi.org/10.1145/989863.989866  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbæk. 2015a. Tracko: Ad-hoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 147--156. DOI: http://dx.doi.org/10.1145/2807442.2807475  ",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "Haojian Jin, Cheng Xu, and Kent Lyons. 2015b. Corona: Positioning Adjacent Device with Asymmetric Bluetooth Low Energy RSSI Distributions. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 175--179. DOI: http://dx.doi.org/10.1145/2807442.2807485  ",
      "doi": "10.1145/2807442.2807485"
    },
    {
      "text": "Vincent Lepetit, Francesc Moreno-Noguer, and Pascal Fua. 2009. Epnp: An accurate o (n) solution to the pnp problem. International journal of computer vision 81, 2 (2009), 155--166. DOI: http://dx.doi.org/10.1007/s11263-008-0152-6  ",
      "doi": "10.1007/s11263-008-0152-6"
    },
    {
      "text": "Ming Li and Leif Kobbelt. 2012. Dynamic Tiling Display: Building an Interactive Display Surface Using Multiple Mobile Devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, NY, NY, USA, Article 24, 4 pages. DOI: http://dx.doi.org/10.1145/2406367.2406397  ",
      "doi": "10.1145/2406367.2406397"
    },
    {
      "text": "Heidi Selmer Nielsen, Marius Pallisgaard Olsen, Mikael B. Skov, and Jesper Kjeldskov. 2014. JuxtaPinch: An Application for Collocated Multi-device Photo Sharing. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, NY, NY, USA, 417--420. DOI: http://dx.doi.org/10.1145/2628363.2633569  ",
      "doi": "10.1145/2628363.2633569"
    },
    {
      "text": "Michel Pahud, Ken Hinckley, Shamsi Iqbal, Abigail Sellen, and Bill Buxton. 2013. Toward Compound Navigation Tasks on Mobiles via Spatial Manipulation. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, NY, NY, USA, 113--122. DOI: http://dx.doi.org/10.1145/2493190.2493210  ",
      "doi": "10.1145/2493190.2493210"
    },
    {
      "text": "Chunyi Peng, Guobin Shen, Yongguang Zhang, Yanlin Li, and Kun Tan. 2007. BeepBeep: A High Accuracy Acoustic Ranging System Using COTS Mobile Devices. In Proceedings of the 5th International Conference on Embedded Networked Sensor Systems (SenSys '07). ACM, NY, NY, USA, 1--14. DOI: http://dx.doi.org/10.1145/1322263.1322265  ",
      "doi": "10.1145/1322263.1322265"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, NY, NY, USA, 45--54. DOI: http://dx.doi.org/10.1145/2669485.2669500  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2010. Usable Gestures for Mobile Interfaces: Evaluating Social Acceptability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 887--896. DOI: http://dx.doi.org/10.1145/1753326.1753458  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "J. M. Saragih, S. Lucey, and J. F. Cohn. 2009. Face alignment through subspace constrained mean-shifts. In 2009 IEEE 12th International Conference on Computer Vision. 1034--1041. DOI: http://dx.doi.org/10.1109/ICCV.2009.5459377 ",
      "doi": ""
    },
    {
      "text": "Arne Schmitz, Ming Li, Volker Schönefeld, and Leif Kobbelt. 2010. Ad-hoc multi-displays for mobile interactive applications. In In Proceeding Eurographics 2010, Vol. 29. 8. http://dx.doi.org/10.2312/ega.20101006",
      "doi": ""
    },
    {
      "text": "Julia Schwarz, David Klionsky, Chris Harrison, Paul Dietz, and Andrew Wilson. 2012. Phone As a Pixel: Enabling Ad-hoc, Large-scale Displays Using Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2235--2238. DOI: http://dx.doi.org/10.1145/2207676.2208378  ",
      "doi": "10.1145/2207676.2208378"
    },
    {
      "text": "Ian Stavness, Billy Lam, and Sidney Fels. 2010. pCubee: A Perspective-corrected Handheld Cubic Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1381--1390. DOI: http://dx.doi.org/10.1145/1753326.1753535  ",
      "doi": "10.1145/1753326.1753535"
    },
    {
      "text": "Zheng Sun, Shijia Pan, Yu-Chi Su, and Pei Zhang. 2013. Headio: Zero-configured Heading Acquisition for Indoor Mobile Devices Through Multimodal Context Sensing. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, NY, NY, USA, 33--42. DOI: http://dx.doi.org/10.1145/2493432.2493434  ",
      "doi": "10.1145/2493432.2493434"
    },
    {
      "text": "Yaniv Taigman, Ming Yang, Marc-Aurelio Ranzato, and Lior Wolf. 2014. Deepface: Closing the gap to human-level performance in face verification. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1701--1708.  ",
      "doi": "10.1109/CVPR.2014.220"
    },
    {
      "text": "P. Viola and M. Jones. 2001. Robust real-time face detection. 2 (2001), 747--747. DOI: http://dx.doi.org/10.1109/ICCV.2001.937709 ",
      "doi": ""
    },
    {
      "text": "Z. Zhang, D. Chu, X. Chen, and T. Moscibroda. 2012. SwordFight: Exploring Phone-to-Phone Motion Games. IEEE Pervasive Computing 11, 4 (Oct 2012), 8--12. DOI: http://dx.doi.org/10.1109/MPRV.2012.78  ",
      "doi": "10.1109/MPRV.2012.78"
    }
  ]
}