{
  "doi": "10.1145/3025453.3025537",
  "title": "Is Two Enough?: ! Studying Benefits, Barriers, and Biases of Multi-Tablet Use for Collaborative Visualization",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4548-4560",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "A sizable part of HCI research on cross-device interaction is driven by the vision of users conducting complex knowledge work seamlessly across multiple mobile devices. This is based on the Weiserian assumption that people will be inclined to distribute their work across multiple ``pads' if such are available. We observed that this is not the reality today, even when devices were in abundance. We present a study with 24 participants in 12 dyads completing a collaborative visualization task with up to six tablets. They could choose between three different visualization types to answer questions about economic data. Tasks were designed to afford simultaneous use of tablets, either with linked or independent views. We found that users typically utilized only one tablet per user. A quantitative and qualitative analysis revealed a ``legacy bias' that introduced barriers for using more tablets and reduced the overall benefit of multi-device visualization.",
  "tags": [
    "multiple coordinated views",
    "tablets",
    "cross-device interaction",
    "group work",
    "information visualization"
  ],
  "authors": [
    {
      "name": "Thomas Plank",
      "institution": "University of Applied Sciences Upper Austria, Steyr, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159951",
      "orcid": "missing"
    },
    {
      "name": "Hans-Christian Jetter",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/do/10.1145/contrib-81361609796/rel-imgonly/029_hanschristianjetterdr_6307_small.jpg",
      "acmid": "81361609796",
      "orcid": "0000-0001-6502-7114"
    },
    {
      "name": "Roman Rädle",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81416608648/rel-imgonly/roman.jpeg",
      "acmid": "81416608648",
      "orcid": "missing"
    },
    {
      "name": "Clemens N. Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    },
    {
      "name": "Thomas Luger",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163309",
      "orcid": "missing"
    },
    {
      "name": "Harald Reiterer",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-81100236830/rel-imgonly/reiterer_2021.jpeg",
      "acmid": "81100236830",
      "orcid": "0000-0001-8528-8928"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd. 2012. What Next, Ubicomp?: Celebrating an Intellectual Disappearing Act. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/2370216.2370222"
    },
    {
      "text": "Christopher Andrews, Alex Endert, and Chris North. 2010. Space to Think: Large High-resolution Displays for Sensemaking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 55--64.  ",
      "doi": "10.1145/1753326.1753336"
    },
    {
      "text": "Matthew P. Aylett and Shaun Lawson. 2016. The Smartphone: A Lacanian Stain, A Tech Killer, and an Embodiment of Radical Individualism. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 501--511.  ",
      "doi": "10.1145/2851581.2892581"
    },
    {
      "text": "Matthew P. Aylett and Aaron J. Quigley. 2015. The Broken Dream of Pervasive Sentient Ambient Calm Invisible Ubiquitous Computing. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '15. ACM, New York, NY, USA, 425--435.  ",
      "doi": "10.1145/2702613.2732508"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2006. Yesterday's tomorrows: notes on ubiquitous computing's dominant vision. Personal and Ubiquitous Computing 11, 2 (nov 2006), 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "R. Borovoy and B. Knep. 2011. Junkyard Jumbotron, http://jumbotron.media.mit.edu. (2011).",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2011). http://vis.stanford.edu/papers/d3  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Thorsten Buering, Jens Gerken, and Harald Reiterer. 2006. User Interaction with Scatterplots on Small Screens - A Comparative Evaluation of Geometric-Semantic Zoom and Fisheye Distortion. IEEE Transactions on Visualization and Computer Graphics 12, 5 (Sept. 2006), 829--836.  ",
      "doi": "10.1109/TVCG.2006.187"
    },
    {
      "text": "Nicholas Chen, Francois Guimbretiere, and Abigail Sellen. 2012. Designing a Multi-slate Reading Environment to Support Active Reading Activities. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 18 (Oct. 2012), 35 pages.  ",
      "doi": "10.1145/2362364.2362366"
    },
    {
      "text": "Nicholas Chen, Francois Guimbretiere, and Abigail Sellen. 2013. Graduate student use of a multi-slate reading system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM Press, New York, New York, USA, 1799.  ",
      "doi": "10.1145/2470654.2466237"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2014. Supporting Novice to Expert Transitions in User Interfaces. ACM Comput. Surv. 47, 2, Article 31 (Nov. 2014), 36 pages.  ",
      "doi": "10.1145/2659796"
    },
    {
      "text": "Steven M. Drucker, Danyel Fisher, Ramik Sadana, Jessica Herron, and m.c. schraefel. 2013. TouchViz: A Case Study Comparing Two Interfaces for Data Analytics on Tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2301--2310.  ",
      "doi": "10.1145/2470654.2481318"
    },
    {
      "text": "C. Ailie Fraser, Mira Dontcheva, Holger Winnemöller, Sheryl Ehrlich, and Scott Klemmer. 2016. DiscoverySpace: Suggesting Actions in Complex Software. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 1221--1232.  ",
      "doi": "10.1145/2901790.2901849"
    },
    {
      "text": "Jens Grubert, Matthias Kranz, and Aaron Quigley. 2016. Challenges in mobile multi-device ecosystems. mUX: The Journal of Mobile User Experience 5, 1 (2016), 1--22.",
      "doi": ""
    },
    {
      "text": "Jonathan Haber, Miguel a. Nacenta, and Sheelagh Carpendale. 2014. Paper vs. tablets: the effect of document media in co-located collaborative work. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces - AVI '14. ACM Press, New York, New York, USA, 89--96.  ",
      "doi": "10.1145/2598153.2598170"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2773--2782.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Sandra G. Hart. 2006. Nasa-Task Load Index (NASA-TLX); 20 Years Later. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 50, 9 (oct 2006), 904--908.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley. 2003. Synchronous Gestures for Multiple Persons and Computers. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, New York, NY, USA, 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "James Hollan, Edwin Hutchins, and David Kirsh. 2000. Distributed Cognition: Toward a New Foundation for Human-computer Interaction Research. ACM Trans. Comput.-Hum. Interact. 7, 2 (June 2000), 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Weidong Huang, Peter Eades, and Seok-Hee Hong. 2009. Measuring Effectiveness of Graph Visualizations: A Cognitive Load Perspective. Information Visualization 8, 3 (June 2009), 139--152.  ",
      "doi": "10.1057/ivs.2009.10"
    },
    {
      "text": "Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics around a Tabletop Display. IEEE Trans. Vis. Comput. Graph. 18, 5 (2012), 689--702.  ",
      "doi": "10.1109/TVCG.2011.287"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2014. Up Close and Personal: Collaborative Work on a High-resolution Multitouch Wall Display. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 11 (Feb. 2014), 34 pages.  ",
      "doi": "10.1145/2576099"
    },
    {
      "text": "Hans-Christian Jetter, Jens Gerken, Michael Zöllner, Harald Reiterer, and Natasa Milic-Frayling. 2011. Materializing the Query with Facet-streams: A Hybrid Surface for Collaborative Search on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3013--3022.  ",
      "doi": "10.1145/1978942.1979390"
    },
    {
      "text": "Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3903--3912.  ",
      "doi": "10.1145/2702123.2702211"
    },
    {
      "text": "David Kirsh. 1995. The Intelligent Use of Space. Artif. Intell. 73, 1--2 (Feb. 1995), 31--68.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Rock Leung, Leah Findlater, Joanna McGrenere, Peter Graf, and Justine Yang. 2010. Multi-Layered Interfaces to Improve Older Adults' Initial Learnability of Mobile Applications. ACM Trans. Access. Comput. 3, 1, Article 1 (Sept. 2010), 30 pages.  ",
      "doi": "10.1145/1838562.1838563"
    },
    {
      "text": "Ming Li and Leif Kobbelt. 2012. Dynamic tiling display: building an interactive display surface using multiple mobile devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia MUM '12. ACM Press, New York, New York, USA, 1.  ",
      "doi": "10.1145/2406367.2406397"
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-them-around: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1787--1796.  ",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "Andrés Lucero, Matt Jones, Tero Jokela, and Simon Robinson. 2013. Mobile Collocated Interactions: Taking an Offline Break Together. interactions 20, 2 (March 2013), 26--32.  ",
      "doi": "10.1145/2427076.2427083"
    },
    {
      "text": "Andrés Lucero, Jaakko Keränen, and Hannu Korhonen. 2010. Collaborative Use of Mobile Phones for Brainstorming. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 337--340.  ",
      "doi": "10.1145/1851600.1851659"
    },
    {
      "text": "Paul Luff and Christian Heath. 1998. Mobility in Collaboration. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98). ACM, New York, NY, USA, 305--314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "Thomas W. Malone. 1983. How Do People Organize Their Desks?: Implications for the Design of Office Information Systems. ACM Trans. Inf. Syst. 1, 1 (Jan. 1983), 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device Interaction via Micro-mobility and F-formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Will McGrath, Brian Bowman, David McCallum, Juan David Hincapié-Ramos, Niklas Elmqvist, and Pourang Irani. 2012. Branch-explore-merge: Facilitating Real-time Revision Control in Collaborative Visual Exploration. In Proc. of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 235--244.  ",
      "doi": "10.1145/2396636.2396673"
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, m. c. Schraefel, and Jacob O. Wobbrock. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. Interactions 21, 3 (May 2014), 40--45.  ",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Meredith Ringel Morris, Danyel Fisher, and Daniel Wigdor. 2010a. Search on Surfaces: Exploring the Potential of Interactive Tabletops for Collaborative Search Tasks. Inf. Process. Manage. 46, 6 (Nov. 2010), 703--717.  ",
      "doi": "10.1016/j.ipm.2009.10.004"
    },
    {
      "text": "Meredith Ringel Morris, Jarrod Lombardo, and Daniel Wigdor. 2010b. WeSearch: Supporting Collaborative Search and Sensemaking on a Tabletop Display. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 401--410.  ",
      "doi": "10.1145/1718918.1718987"
    },
    {
      "text": "Antti Oulasvirta. 2008. When users \"do\" the Ubicomp. interactions 15, 2 (mar 2008), 6.  ",
      "doi": "10.1145/1340961.1340963"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatially-agnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3913--3922.  ",
      "doi": "10.1145/2702123.2702287"
    },
    {
      "text": "Jonathan C. Roberts. 2007. State of the Art: Coordinated Multiple Views in Exploratory Visualization. In Coordinated and Multiple Views in Exploratory Visualization, 2007. CMV '07. Fifth International Conference on. 61--71.  ",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "Yvonne Rogers. 2006. Moving on from Weiser's Vision of Calm Computing: engaging UbiComp experiences. 4206 (sep 2006), 404--421.  ",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Yvonne Rogers and Sian Lindley. 2004. Collaborating around vertical and horizontal large interactive displays: which way is best? Interacting with Computers 16, 6 (Dec. 2004), 1133--1152.",
      "doi": ""
    },
    {
      "text": "Ramik Sadana and John Stasko. 2014. Designing and Implementing an Interactive Scatterplot Visualization for a Tablet Computer. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, New York, NY, USA, 265--272.  ",
      "doi": "10.1145/2598153.2598163"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2016. Designing Multiple Coordinated Visualizations for Tablets. Computer Graphics Forum 35, 3 (jun 2016), 261--270.  ",
      "doi": "10.5555/3071534.3071563"
    },
    {
      "text": "Stephanie Santosa and Daniel Wigdor. 2013. A Field Study of Multi-device Workflows in Distributed Workspaces. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 63--72.  ",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Arne Schmitz, Ming Li, Volker Schönefeld, and Leif Kobbelt. 2010. Ad-Hoc Multi-Displays for Mobile Interactive Applications. In The Eurographics Association. The Eurographics Association, 45--52.",
      "doi": ""
    },
    {
      "text": "Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, New York, NY, USA, 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Frank M. Shipman, III, Catherine C. Marshall, and Thomas P. Moran. 1995. Finding and Using Implicit Structure in Human-organized Spatial Layouts of Information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 346--353.  ",
      "doi": "10.1145/223904.223949"
    },
    {
      "text": "Ben Shneiderman. 2002. Promoting Universal Usability with Multi-layer Interface Design. SIGCAPH Comput. Phys. Handicap. (June 2002), 1--8.  ",
      "doi": "10.1145/960201.957206"
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 1181--1190.  ",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "Lucia Terrenghi, Aaron Quigley, and Alan Dix. 2009. A Taxonomy for and Analysis of Multi-person-display Ecosystems. Personal Ubiquitous Comput. 13, 8 (Nov. 2009), 583--598.  ",
      "doi": "10.1007/s00779-009-0244-5"
    },
    {
      "text": "James R. Wallace, Stacey D. Scott, and Carolyn G. MacGregor. 2013. Collaborative Sensemaking on a Digital Tabletop and Personal Tablets: Prioritization, Comparisons, and Tableaux. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3345--3354.  ",
      "doi": "10.1145/2470654.2466458"
    },
    {
      "text": "Mark Weiser. 1991. The computer for the 21st century. Scientific American 265, 3 (Sept. 1991), 66--75.  ",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Robert E. Wood. 1986. Task complexity: Definition of the construct. Organizational Behavior and Human Decision Processes 37, 1 (feb 1986), 60--82.",
      "doi": ""
    },
    {
      "text": "Pawel Wozniak, Nitesh Goyal, Przemyslaw Kucharski, Lars Lischke, Sven Mayer, and Morten Fjeld. 2016. RAMPARTS: Supporting Sensemaking with Spatially-Aware Mobile Interactions. Proceedings of the SIGCHI Conference on Human Factors in Computing System 2016 (2016).  ",
      "doi": "10.1145/2858036.2858491"
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Roman Rädle, Hans-Christian Jetter, Clemens Klokmose, and Harald Reiterer. 2016. When Tablets Meet Tabletops: The Effect of Tabletop Size on Around-the-Table Collaboration with Personal Tablets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5470--5481.  ",
      "doi": "10.1145/2858036.2858224"
    }
  ]
}