{
  "doi": "10.1145/3025453.3025916",
  "title": "Modeling Sub-Document Attention Using Viewport Time",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6475-6480",
  "year": 2017,
  "badges": [],
  "abstract": "Website measures of engagement captured from millions of users, such as in-page scrolling and viewport position, can provide deeper understanding of attention than possible with simpler measures, such as dwell time. Using data from 1.2M news reading sessions, we examine and evaluate three increasingly sophisticated models of sub-document attention computed from viewport time, the time a page component is visible on the user display. Our modeling incorporates prior eye-tracking knowledge about onscreen reading, and we validate it by showing how, when used to estimate user reading rate, it aligns with known empirical measures. We then show how our models reveal an interaction between article topic and attention to page elements. Our approach supports refined large-scale measurement of user engagement at a level previously available only from lab-based eye-tracking studies.",
  "tags": [
    "user modeling",
    "web analytics",
    "news articles",
    "reading",
    "attention"
  ],
  "authors": [
    {
      "name": "Max Grusky",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161375",
      "orcid": "missing"
    },
    {
      "name": "Jeiran Jahani",
      "institution": "Chartbeat, Inc., New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162216",
      "orcid": "missing"
    },
    {
      "name": "Josh Schwartz",
      "institution": "Chartbeat, Inc., New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161437",
      "orcid": "missing"
    },
    {
      "name": "Dan Valente",
      "institution": "Chartbeat, Inc, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320496299",
      "orcid": "missing"
    },
    {
      "name": "Yoav Artzi",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498659618",
      "orcid": "missing"
    },
    {
      "name": "Mor Naaman",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    }
  ],
  "references": [
    {
      "text": "David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent Dirichlet Allocation. Journal of Machine Learning Research 3, Jan (2003), 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Agnieszka Bojko. 2006. Using Eye Tracking to Compare Web Page Designs: A Case Study. Journal of Usability Studies 1, 3 (May 2006), 112--120. http://dl.acm.org/citation.cfm?id=2835663.2835665 ",
      "doi": "10.5555/2835663.2835665"
    },
    {
      "text": "Georg Buscher, Ralf Biedert, Daniel Heinesch, and Andreas Dengel. 2010. Eye Tracking Analysis of Preferred Reading Regions on the Screen. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 3307--3312.  ",
      "doi": "10.1145/1753846.1753976"
    },
    {
      "text": "Georg Buscher, Edward Cutrell, and Meredith Ringel Morris. 2009. What Do You See when You'Re Surfing?: Using Eye Tracking to Predict Salient Regions of Web Pages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 21--30.  ",
      "doi": "10.1145/1518701.1518705"
    },
    {
      "text": "Christopher S. Campbell and Paul P. Maglio. 2001. A Robust Algorithm for Reading Detection. In Proceedings of the 2001 Workshop on Perceptive User Interfaces (PUI '01). ACM, NY, NY, USA, 1--7.  ",
      "doi": "10.1145/971478.971503"
    },
    {
      "text": "Mon Chu Chen, John R. Anderson, and Myeong Ho Sohn. 2001. What Can a Mouse Cursor Tell Us More?: Correlation of Eye/Mouse Movements on Web Browsing. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 281--282.  ",
      "doi": "10.1145/634067.634234"
    },
    {
      "text": "Soussan Djamasbi, Marisa Siegel, and Tom Tullis. 2010. Generation Y, Web Design, and Eye Tracking. International Journal of Human-Computer Studies 68, 5 (May 2010), 307--323.  ",
      "doi": "10.1016/j.ijhcs.2009.12.006"
    },
    {
      "text": "Laura Granka, Matthew Feusner, and Lori Lorigo. 2008. Eye Monitoring in Online Search. Passive Eye Monitoring (2008), 347--372.",
      "doi": ""
    },
    {
      "text": "Jeff Huang, Ryen White, and Georg Buscher. 2012. User See, User Point: Gaze and Cursor Alignment in Web Search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1341--1350.  ",
      "doi": "10.1145/2207676.2208591"
    },
    {
      "text": "Youngho Kim, Ahmed Hassan, Ryen W. White, and Imed Zitouni. 2014a. Comparing Client and Server Dwell Time Estimates for Click-level Satisfaction Prediction. In Proceedings of the 37th International ACM SIGIR Conference on Research & Development in Information Retrieval (SIGIR '14). ACM, NY, NY, USA, 895--898.  ",
      "doi": "10.1145/2600428.2609468"
    },
    {
      "text": "Youngho Kim, Ahmed Hassan, Ryen W. White, and Imed Zitouni. 2014b. Modeling Dwell Time to Predict Click-level Satisfaction. In Proceedings of the 7th ACM International Conference on Web Search and Data Mining (WSDM '14). ACM, NY, NY, USA, 193--202.  ",
      "doi": "10.1145/2556195.2556220"
    },
    {
      "text": "Dmitry Lagun, Chih-Hung Hsieh, Dale Webster, and Vidhya Navalpakkam. 2014. Towards Better Measurement of Attention and Satisfaction in Mobile Search. In Proceedings of the 37th International ACM SIGIR Conference on Research & Development in Information Retrieval (SIGIR '14). ACM, NY, NY, USA, 113--122.  ",
      "doi": "10.1145/2600428.2609631"
    },
    {
      "text": "Dmitry Lagun and Mounia Lalmas. 2016. Understanding User Attention and Engagement in Online News Reading. In Proceedings of the 9th ACM International Conference on Web Search and Data Mining (WSDM '16). ACM, NY, NY, USA, 113--122.  ",
      "doi": "10.1145/2835776.2835833"
    },
    {
      "text": "Dmitry Lagun, Donal McMahon, and Vidhya Navalpakkam. 2016. Understanding Mobile Searcher Attention with Rich Ad Formats. In Proceedings of the 25th Conference on Information and Knowledge Management (CIKM '16). ACM, NY, NY, USA, 599--608.  ",
      "doi": "10.1145/2983323.2983853"
    },
    {
      "text": "Pascual Martínez-Gómez, Tadayoshi Hara, and Akiko Aizawa. 2012. Recognizing Personal Characteristics of Readers using Eye-Movements and Text Features. Proceedings of COLING 2012 December (2012), 1747--1762. http://www.aclweb.org/anthology/C12--1107",
      "doi": ""
    },
    {
      "text": "Jan M Noyes and Kate J Garland. 2008. Computer- vs. paper-based tasks: are they equivalent? Ergonomics 51, 9 (2008), 1352--1375.",
      "doi": ""
    },
    {
      "text": "Radim Řehůřek and Petr Sojka. 2010. Software Framework for Topic Modelling with Large Corpora. In Proceedings of the LREC 2010 Workshop on New Challenges for NLP Frameworks. ELRA, Valletta, Malta, 45--50. http://is.muni.cz/publication/884893/en.",
      "doi": ""
    },
    {
      "text": "Selina Sharmin, Oleg Špakov, and Kari-Jouko Räihä. 2013. Reading On-screen Text with Gaze-based Auto-scrolling. In Proceedings of the 2013 Conference on Eye Tracking South Africa (ETSA '13). ACM, NY, NY, USA, 24--31.  ",
      "doi": "10.1145/2509315.2509319"
    },
    {
      "text": "Susanne Trauzettel-Klosinski and Klaus Dietz. 2012. Standardized assessment of reading performance: The new international reading speed texts IReST. Investigative Ophthalmology and Visual Science 53, 9 (2012), 5452--5461.",
      "doi": ""
    },
    {
      "text": "Eric W Weisstein. 2002. Erf. http://web.archive.org/web/20080207010024/http: //www.808multimedia.com/winnt/kernel.htm. (2002). Retrieved December 2016.",
      "doi": ""
    },
    {
      "text": "Xing Yi, Liangjie Hong, Erheng Zhong, Nanthan Nan Liu, and Suju Rajan. 2014. Beyond Clicks: Dwell Time for Personalization. In Proceedings of the 8th ACM Conference on Recommender Systems (RecSys '14). ACM, NY, NY, USA, 113--120.  ",
      "doi": "10.1145/2645710.2645724"
    }
  ]
}