{
  "doi": "10.1145/3025453.3025565",
  "title": "BackXPress: Using Back-of-Device Finger Pressure to Augment Touchscreen Input on Smartphones",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4654-4666",
  "year": 2017,
  "badges": [],
  "abstract": "When people hold their smartphone in landscape orientation, they use their thumbs for input on the frontal touchscreen, while their remaining fingers rest on the back of the device (BoD) to stabilize the grip. We present BackXPress, a new interaction technique that lets users create BoD pressure input with these remaining fingers to augment their interaction with the touchscreen on the front: Users can apply various pressure levels with each of these fingers to enter different temporary \"quasi-modes\" that are only active as long as that pressure is applied. Both thumbs can then interact with the frontal screen in that mode. We illustrate the practicality of BackXPress with several sample applications, and report our results from three user studies: Study 1 investigated which fingers can be used to exert BoD pressure and found index, middle, and ring finger from both hands to be practical. Study 2 revealed how pressure touches from these six fingers are distributed across the BoD. Study 3 examined user performance for applying BoD pressure (a) during single touches at the front and (b) for 20 seconds while touching multiple consecutive frontal targets. Participants achieved up to 92% pressure accuracy for three separate pressure levels above normal resting pressure, with the middle fingers providing the highest accuracy. BoD pressure did not affect frontal touch accuracy. We conclude with design guidelines for BoD pressure input.",
  "tags": [
    "smartphone",
    "back-of-device",
    "bimanual input",
    "pressure"
  ],
  "authors": [
    {
      "name": "Christian Corsten",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460658496",
      "orcid": "missing"
    },
    {
      "name": "Bjoern Daehlmann",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160854",
      "orcid": "missing"
    },
    {
      "name": "Simon Voelker",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81479651640/rel-imgonly/simon_voelker.jpg",
      "acmid": "81479651640",
      "orcid": "missing"
    },
    {
      "name": "Jan Borchers",
      "institution": "RWTH Aachen University, Aachen, NRW, Germany",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch and Gerry Chu. 2009. Back-of-Device Interaction Allows Creating Very Small Touch Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the Functional Area of the Thumb on Mobile Touchscreen Surfaces. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1991--2000.  ",
      "doi": "10.1145/2556288.2557354"
    },
    {
      "text": "Stephen A. Brewster and Michael Hughes. 2009. Pressure-Based Text Entry for Mobile Devices. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, USA, 9:1--9:4.  ",
      "doi": "10.1145/1613858.1613870"
    },
    {
      "text": "Daniel Buschek, Oliver Schoenleben, and Antti Oulasvirta. 2014. Improving Accuracy in Back-of-Device Multitouch Typing: A Clustering-based Approach to Keyboard Updating. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, New York, NY, USA, 57--66.  ",
      "doi": "10.1145/2557500.2557501"
    },
    {
      "text": "William Buxton, Ralph Hill, and Peter Rowley. 1985. Issues and Techniques in Touch-Sensitive Tablet Input. In Proceedings of the 12th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '85). ACM, New York, NY, USA, 215--224.  ",
      "doi": "10.1145/325334.325239"
    },
    {
      "text": "Jared Cechanowicz, Pourang Irani, and Sriram Subramanian. 2007. Augmenting the Mouse with Pressure Sensitive Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1385--1394.  ",
      "doi": "10.1145/1240624.1240835"
    },
    {
      "text": "Christian Corsten, Christian Cherek, Thorsten Karrer, and Jan Borchers. 2015. HaptiCase: Back-of-Device Tactile Landmarks for Eyes-Free Absolute Indirect Touch. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2171--2180.  ",
      "doi": "10.1145/2702123.2702277"
    },
    {
      "text": "Philip L. Davidson and Jefferson Y. Han. 2008. Extending 2D Object Arrangement with Pressure-Sensitive Layering Cues. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 87--90.  ",
      "doi": "10.1145/1449715.1449730"
    },
    {
      "text": "Alexander De Luca, Marian Harbach, Emanuel von Zezschwitz, Max-Emanuel Maurer, Bernhard Ewald Slawik, Heinrich Hussmann, and Matthew Smith. 2014. Now You See Me, Now You Don't: Protecting Smartphone Authentication from Shoulder Surfers. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2937--2946.  ",
      "doi": "10.1145/2556288.2557097"
    },
    {
      "text": "Masitah Ghazali and Alan Dix. Knowledge of Today for the Design of Tomorrow. In Proceedings of the 2nd International Design and Engagibility Conference (IDEC '05). http://citeseerx.ist.psu.edu/viewdoc/ download?doi=10.1.1.563.6831&rep=rep1&type=pdf",
      "doi": ""
    },
    {
      "text": "Hiroyuki Hakoda, Yoshitomo Fukatsu, Buntarou Shizuki, and Jiro Tanaka. 2015. Back-of-Device Interaction Based on the Range of Motion of the Index Finger. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, New York, NY, USA, 202--206.  ",
      "doi": "10.1145/2838739.2838812"
    },
    {
      "text": "Seongkook Heo and Geehyuk Lee. 2011a. Force Gestures: Augmented Touch Screen Gestures Using Normal and Tangential Force. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 1909--1914.  ",
      "doi": "10.1145/1979742.1979895"
    },
    {
      "text": "Seongkook Heo and Geehyuk Lee. 2011b. Forcetap: Extending the Input Vocabulary of Mobile Touch Screens by Adding Tap Gestures. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 113--122.  ",
      "doi": "10.1145/2037373.2037393"
    },
    {
      "text": "Seongkook Heo and Geehyuk Lee. 2012. ForceDrag: Using Pressure as a Touch Input Modifier. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12). ACM, New York, NY, USA, 204--207.  ",
      "doi": "10.1145/2414536.2414572"
    },
    {
      "text": "Apple inc. 2017 (accessed January 6, 2017). iOS9 UIKit API Reference. https://developer.apple.com/reference/uikit/uitouch. (2017 (accessed January 6, 2017)).",
      "doi": ""
    },
    {
      "text": "Markus Löchtefeld, Christoph Hirtz, and Sven Gehring. 2013. Evaluation of Hybrid Front- and Back-of-Device Interaction on Mobile Devices. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, New York, NY, USA, Article 17, 4 pages.  ",
      "doi": "10.1145/2541831.2541865"
    },
    {
      "text": "Ross McLachlan, Daniel Boland, and Stephen Brewster. 2014. Transient and Transitional States: Pressure as an Auxiliary Input Modality for Bimanual Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 401--410.  ",
      "doi": "10.1145/2556288.2557260"
    },
    {
      "text": "Ross McLachlan and Stephen Brewster. 2015. Bimanual Input for Tablet Devices with Pressure and Multi-Touch Gestures. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 547--556.  ",
      "doi": "10.1145/2785830.2785878"
    },
    {
      "text": "Sachi Mizobuchi, Shinya Terasaki, Turo Keski-Jaskari, Jari Nousiainen, Matti Ryynanen, and Miika Silfverberg. 2005. Making an Impression: Force-Controlled Pen Input for Handheld Devices. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1661--1664.  ",
      "doi": "10.1145/1056808.1056991"
    },
    {
      "text": "Mohammad Faizuddin Mohd Noor, Andrew Ramsay, Stephen Hughes, Simon Rogers, John Williamson, and Roderick Murray-Smith. 2014. 28 Frames Later: Predicting Screen Touches from Back-of-Device Grip Changes. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2005--2008.  ",
      "doi": "10.1145/2556288.2557148"
    },
    {
      "text": "R. Kevin Nelson. 2017 (accessed January 6, 2017). Exploring Apple's 3D Touch. https://medium.com/@rknla/ exploring-apple-s-3d-touch-f5980ef45af5#.pijkgrkw0. (2017 (accessed January 6, 2017)).",
      "doi": ""
    },
    {
      "text": "Siyuan Qiu, Lu Wang, and Laikuan Wong. 2016. Pressure-Based Touch Positioning Techniques for 3D Objects. In Proceedings of the 20th ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games (I3D '16). ACM, New York, NY, USA, 199--200.  ",
      "doi": "10.1145/2856400.2876010"
    },
    {
      "text": "Gonzalo Ramos, Matthew Boulos, and Ravin Balakrishnan. 2004. Pressure Widgets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Gonzalo A. Ramos and Ravin Balakrishnan. 2007. Pressure Marks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1375--1384.  ",
      "doi": "10.1145/1240624.1240834"
    },
    {
      "text": "Xiangshi Ren, Jibin Yin, Shengdong Zhao, and Yang Li. 2007. The Adaptive Hybrid Cursor: A Pressure-Based Target Selection Technique for Pen-Based User Interfaces. In Proceedings of the 2007 IFIP TC15 International Conference on Human-Computer Interaction (INTERACT'07). Springer, Berlin, Heidelberg, 310--323. ",
      "doi": "10.5555/1776994.1777033"
    },
    {
      "text": "Oliver Schoenleben and Antti Oulasvirta. 2013. Sandwich Keyboard: Fast Ten-Finger Typing on a Mobile Device with Adaptive Touch Sensing on the Back Side. In Proceedings of the 15th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 175--178.  ",
      "doi": "10.1145/2493190.2493233"
    },
    {
      "text": "Erh-li Early Shen, Sung-sheng Daniel Tsai, Hao-hua Chu, Yung-jen Jane Hsu, and Chi-wen Euro Chen. 2009. Double-side Multi-touch Input for Mobile Devices. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 4339--4344.  ",
      "doi": "10.1145/1520340.1520663"
    },
    {
      "text": "Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (INTERACT'05). Springer-Verlag, Berlin, Heidelberg, 267--280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a Standard for Pointing Device Evaluation, Perspectives on 27 Years of Fitts' Law Research in HCI. Int. J. Hum.-Comput. Stud. 61, 6 (Dec. 2004), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Caleb Southern, James Clawson, Brian Frey, Gregory Abowd, and Mario Romero. 2012. An Evaluation of BrailleTouch: Mobile Touchscreen Text Entry for the Visually Impaired. In Proceedings of the 14th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 317--326.  ",
      "doi": "10.1145/2371574.2371623"
    },
    {
      "text": "Daniel Spelmezan, Caroline Appert, Olivier Chapuis, and Emmanuel Pietriga. 2013a. Controlling Widgets with One Power-up Button. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 71--74.  ",
      "doi": "10.1145/2501988.2502025"
    },
    {
      "text": "Daniel Spelmezan, Caroline Appert, Olivier Chapuis, and Emmanuel Pietriga. 2013b. Side Pressure for Bidirectional Navigation on Small Devices. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/2493190.2493199"
    },
    {
      "text": "Craig Stewart, Michael Rohs, Sven Kratz, and Georg Essl. 2010. Characteristics of Pressure-Based Input for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 801--810.  ",
      "doi": "10.1145/1753326.1753444"
    },
    {
      "text": "Feng Wang and Xiangshi Ren. 2009. Empirical Evaluation for Finger Input Properties in Multi-touch Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1063--1072.  ",
      "doi": "10.1145/1518701.1518864"
    },
    {
      "text": "Daniel Wigdor, Clifton Forlines, Patrick Baudisch, John Barnwell, and Chia Shen. 2007. Lucid Touch: A See-Through Mobile Device. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Graham Wilson, Stephen Brewster, and Martin Halvey. 2013. Towards Utilising One-handed Multi-digit Pressure Input. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1317--1322.  ",
      "doi": "10.1145/2468356.2468591"
    },
    {
      "text": "Graham Wilson, Stephen A. Brewster, Martin Halvey, Andrew Crossan, and Craig Stewart. 2011. The Effects of Walking, Feedback and Control Method on Pressure-Based Interaction. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 147--156.  ",
      "doi": "10.1145/2037373.2037397"
    },
    {
      "text": "Graham Wilson, Craig Stewart, and Stephen A. Brewster. 2010. Pressure-Based Menu Selection for Mobile Devices. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/1851600.1851631"
    },
    {
      "text": "Katrin Wolf, Christian Müller-Tomfelde, Kelvin Cheng, and Ina Wechsung. 2012. PinchPad: Performance of Touch-Based Gestures While Grasping Devices. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, New York, NY, USA, 103--110.  ",
      "doi": "10.1145/2148131.2148155"
    },
    {
      "text": "Xing-Dong Yang, Edward Mak, Pourang Irani, and Walter F. Bischof. 2009. Dual-Surface Input: Augmenting One-Handed Interaction with Coordinated Front and Behind-the-Screen Input. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, USA, Article 5, 10 pages.  ",
      "doi": "10.1145/1613858.1613865"
    },
    {
      "text": "Cheng Zhang, Anhong Guo, Dingtian Zhang, Caleb Southern, Rosa Arriaga, and Gregory Abowd. 2015. BeyondTouch: Extending the Input Language with Built-in Sensors on Commodity Smartphones. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, New York, NY, USA, 67--77.  ",
      "doi": "10.1145/2678025.2701374"
    }
  ]
}