{
  "doi": "10.1145/3025453.3025749",
  "title": "All about Acceptability?: Identifying Factors for the Adoption of Data Glasses",
  "published": "2017-05-06",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "295-300",
  "year": 2017,
  "badges": [],
  "abstract": "Innovations often trigger objections before becoming widely accepted. This paper assesses whether a familiarisation over time can be expected for data glasses, too. While user attitudes towards those devices have been reported to be prevalently negative [14], it is still unclear, to what extent this initial, negative user attitude might impede adoption. However, indepth understanding is crucial for reducing barriers early in order to gain access to potential benefits from the technology. With this paper we contribute to a better understanding of factors affecting data glasses adoption, as well as current trends and opinions. Our multiple-year case study (N=118) shows, against expectations, no significant change towards a more positive attitude between 2014 and 2016. We complement these findings with an expert survey (N=51) investigating prognoses, challenges and discussing the relevance of social acceptability. We elicit and contrast a controversial spectrum of expert opinions, and assess whether initial objections can be overwritten. Our analysis shows that while social acceptability is considered relevant for the time being, utility and usability are more valued for long-term adoption.",
  "authors": [
    {
      "name": "Marion Koelle",
      "institution": "Media Informatics and Multimedia Systems, University of Oldenburg, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-86158741357/rel-imgonly/marionkoelle_xs.jpg",
      "acmid": "86158741357",
      "orcid": "0000-0002-5931-3218"
    },
    {
      "name": "Abdallah El Ali",
      "institution": "Media Informatics and Multimedia Systems, University of Oldenburg, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-81474700470/rel-imgonly/offis_photo_el_ali.jpg",
      "acmid": "81474700470",
      "orcid": "missing"
    },
    {
      "name": "Vanessa Cobus",
      "institution": "Interactive Systems Group, OFFIS - Institute for IT, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658658006",
      "orcid": "missing"
    },
    {
      "name": "Wilko Heuten",
      "institution": "Interactive Systems Group, OFFIS - Institute for IT, Oldenburg, Germany",
      "img": "/do/10.1145/contrib-81320490169/rel-imgonly/csm_offis_gesundheit_heuten_wilko_dsc05737__1__web_4024cc8173.jpg",
      "acmid": "81320490169",
      "orcid": "0000-0003-2085-193X"
    },
    {
      "name": "Susanne CJ Boll",
      "institution": "Media Informatics and Multimedia Systems, University of Oldenburg, Oldenburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398416",
      "orcid": "0000-0003-4293-1623"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2015. Supporting Subtlety with Deceptive Devices and Illusory Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, New York, NY, USA, 1489-1498.  ",
      "doi": "10.1145/2702123.2702336"
    },
    {
      "text": "Angela Berkley. 2015. Snapshot Seeing: Kodak Fiends, Child Photographers, and Henry James's What Maisie Knew. MFS Modern Fiction Studies 61, 3 (2015), 375-403. https://muse.jhu.edu/article/594732",
      "doi": ""
    },
    {
      "text": "Cherrylyn Buenaflor and Hee-Cheol Kim. 2013. Six Human Factors to Acceptability of Wearable Computers. International Journal of Multimedia and Ubiquitous Engineering 8, 3 (2013), 1-8. http://www.sersc.org/journals/IJMUE/vol8_no3_2013/10.pdf",
      "doi": ""
    },
    {
      "text": "Daniel Castro and Alan McQuinn. 2015. The Privacy Panic Cycle: A Guide to Public Fears About New Technologies. The Information Technology & Innovation Foundation, Washington, DC, USA. http://www2.itif.org/2015-privacy-panic.pdf",
      "doi": ""
    },
    {
      "text": "Fred D. Davis Jr. 1986. A technology acceptance model for empirically testing new end-user information systems: Theory and results. Dissertation. Massachusetts Institute of Technology. http://hdl.handle.net/1721.1/15192",
      "doi": ""
    },
    {
      "text": "Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In situ with Bystanders of Augmented Reality Glasses: Perspectives on Recording and Privacy-mediating Technologies. In Proceedings of the 32rd Annual ACM Conference on Human Factors in Computing Systems (CHI'14). ACM, New York, NY, 2377-2386.  ",
      "doi": "10.1145/2556288.2557352"
    },
    {
      "text": "David Dobbelstein, Philipp Hock, and Enrico Rukzio. 2015. Belt: An Unobtrusive Touch Input Device for Head-worn Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, New York, NY, USA, 2135-2138.  ",
      "doi": "10.1145/2702123.2702450"
    },
    {
      "text": "Barrett Ens, Tovi Grossman, Fraser Anderson, Justin Matejka, and George Fitzmaurice. 2015. Candid Interaction: Revealing Hidden Mobile and Wearable Computing Activities. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST'15). ACM, New York, NY, USA, 467-476.  ",
      "doi": "10.1145/2807442.2807449"
    },
    {
      "text": "Vivian Genaro Motti and Kelly Caine. 2014. Understanding the Wearability of Head-mounted Devices from a Human-centered Perspective. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC'14). ACM, New York, NY, USA, 83-86.  ",
      "doi": "10.1145/2634317.2634340"
    },
    {
      "text": "Shuhei Hosokawa. 1984. The Walkman Effect. Popular Music 4 (1984), 165.",
      "doi": ""
    },
    {
      "text": "Elena Karahanna, Detmar W. Straub, and Norman L. Chervany. 1999. Information Technology Adoption Across Time: A Cross-sectional Comparison of Pre-adoption and Post-adoption Beliefs. MIS Q. 23, 2 (June 1999), 183-213.  ",
      "doi": "10.2307/249751"
    },
    {
      "text": "Hee-Cheol Kim. 2015. Acceptability Engineering: The Study of user Acceptance of Innovative Technologies. Journal of Applied Research and Technology 13, 2 (2015), 230-237.",
      "doi": ""
    },
    {
      "text": "Ki Joon Kim and Dong-Hee Shin. 2015. An acceptance model for smart watches. Internet Research 25, 4 (2015), 527-541.",
      "doi": ""
    },
    {
      "text": "Marion Koelle, Matthias Kranz, and Andreas Möller. 2015. Don't Look at Me That Way!: Understanding User Attitudes Towards Data Glasses Usage. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI'15). ACM, New York, NY, USA, 362-372.  ",
      "doi": "10.1145/2785830.2785842"
    },
    {
      "text": "Kate Miriam Loewenthal. 2001. An Introduction to Psychological Tests and Scales (2nd Edition). Psychology Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Yogesh Malhotra and Dennis F. Galletta. 1999. Extending the Technology Acceptance Model to Account for Social Influence: Theoretical Bases and Empirical Validation. In Proceedings of the Thirty-Second Annual Hawaii International Conference on System Sciences (HICSS'99). IEEE Computer Society, Washington, DC, USA, 1006-1019. http://dl.acm.org/citation.cfm?id=874068.875913 ",
      "doi": "10.5555/874068.875913"
    },
    {
      "text": "Philipp Mayring. 2014. Qualitative Content Analysis: Theoretical Foundation, Basic Procedures and Software Solution. SSOAR, Klagenfurt, Germany. 143 pages. http://nbn-resolving.de/urn:nbn:de:0168-ssoar-395173",
      "doi": ""
    },
    {
      "text": "Philipp A. Rauschnabel, Alexander Brem, and Bjoern S. Ivens. 2015. Who will buy smart glasses? Empirical results of two pre-market-entry studies on the role of personality in individual awareness and intended adoption of Google Glass wearables. Computers in Human Behavior 49 (2015), 635-647.  ",
      "doi": "10.1016/j.chb.2015.03.003"
    },
    {
      "text": "Philipp A Rauschnabel, Daniel W.E Hein, Jun He, Young K. Ro, Samir Rawashdeh, and Bryan Krulikowski. 2016. Fashion or Technology? A Fashnology Perspective on the Perception and Adoption of Augmented Reality Smart Glasses. i-com 15, 2 (2016), 179-194.",
      "doi": ""
    },
    {
      "text": "Philipp A. Rauschnabel and Young K. Ro. 2016. Augmented reality smart glasses: An investigation of technology acceptance drivers. International Journal of Technology Marketing 11, 2 (2016), 123.",
      "doi": ""
    },
    {
      "text": "Stuart Reeves, Steve Benford, Claire O'Malley, and Mike Fraser. 2005. Designing the Spectator Experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'05). ACM, New York, NY, USA, 741-750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Everett M Rogers. 2010. Diffusion of Innovations (4th Edition). Free Press, Simon and Schuster Inc., New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Neil Selwyn. 2003. Apart from Technology: Understanding People's Non-use of Information and Communication Technologies in Everyday Life. Technology in sSociety 25, 1 (2003), 99-116.",
      "doi": ""
    },
    {
      "text": "Brian Shackel. 2009. Usability - Context, Framework, Definition, Design and Evaluation. Interact. Comput. 21, 5-6 (Dec. 2009), 339-346.  ",
      "doi": "10.1016/j.intcom.2009.04.007"
    },
    {
      "text": "Koert M. van Mensvoort. 2013. Pyramid of Technology: How Technology becomes Nature in Seven Steps. Technische Universiteit Eindhoven, Eindhoven, the Netherlands. https://pure.tue.nl/ws/files/3805415/760124.pdf",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh and Michael G. Morris. 2000. Why Don't Men Ever Stop to Ask for Directions? Gender, Social Influence, and Their Role in Technology Acceptance and Usage Behavior. MIS Q. 24, 1 (March 2000), 115-139.  ",
      "doi": "10.2307/3250981"
    },
    {
      "text": "Heetae Yang, Jieun Yu, Hangjung Zo, and Munkee Choi. 2016. User Acceptance of Wearable Devices: An extended Perspective of Perceived Value. Telematics and Informatics 33, 2 (2016), 256-269.  ",
      "doi": "10.1016/j.tele.2015.08.007"
    }
  ]
}