{
  "doi": "10.1145/3025453.3025770",
  "title": "Technology Individuation: The Foibles of Augmented Everyday Objects",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6632-6644",
  "year": 2017,
  "badges": [],
  "abstract": "This paper presents the concept of technology individuation and explores its role in design. Individuation expresses how, over time, a technology becomes personal and intimate, unique in purpose, orchestrated in place, and how people eventually come to rely on it to sustain connection with others. We articulate this concept as a critical vantage point for designing augmented everyday objects and the Internet of Things. Individuation foregrounds aspects of habituation, routines and arrangements that through everyday practices reveal unique meaning, reflect self-identity and support agency. The concept is illustrated through three long term case studies of technology in use, involving tangible and embodied interaction with devices that afford communication, monitoring, and awareness in the home setting. The cases are analysed using Hornecker and Buur's Tangible Interaction Framework. We further extend upon this framework to better reveal the role played by personal values, history of use, and arrangements, as they develop over time in the home setting, in shaping tangible and embodied interaction with individuated technologies.",
  "tags": [
    "framework",
    "situated.",
    "embodied",
    "objects",
    "design",
    "internet of things",
    "connection",
    "things",
    "tangible",
    "individuation",
    "communication",
    "habituation",
    "smart"
  ],
  "authors": [
    {
      "name": "Aloha Hufana Ambe",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658949906",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    },
    {
      "name": "Alessandro Soro",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/do/10.1145/contrib-81100420083/rel-imgonly/alessandro.soro.jpg",
      "acmid": "81100420083",
      "orcid": "missing"
    },
    {
      "name": "Paul Roe",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338049",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kevin Ashton. 2009. That \"internet of things\" thing. RFiD Journal 22, 7: 97--114.",
      "doi": ""
    },
    {
      "text": "Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2010. The Internet of Things: A survey. Computer Networks 54, 15: 2787--2805.  ",
      "doi": "10.1016/j.comnet.2010.05.010"
    },
    {
      "text": "Hanif Baharin and Salman Khalidi. 2015. Fyro: A Symbolic-Based Phatic Technology. Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, ACM, 304--308.  ",
      "doi": "10.1145/2838739.2838795"
    },
    {
      "text": "Hanif Baharin, Universiti Teknologi, Mara Stephen Viller, and Sean Rintel. 2015. SonicAIR: Supporting Independent Living with Reciprocal Ambient Audio Awareness. ACM Trans. Comput.Hum. Interact. Article 22, 23.  ",
      "doi": "10.1145/2754165"
    },
    {
      "text": "Jeremy Birnholtz and Mckenzie Jones-rounds. 2010. Independence and Interaction?: Understanding Seniors -- Privacy and Awareness Needs For Aging in Place. 143--152.  ",
      "doi": "10.1145/1753326.1753349"
    },
    {
      "text": "Margot Brereton. 2013. Habituated Objects: Everyday Tangibles That Foster the Independent Living of an Elderly Woman. Interactions 20, 4: 20--24.  ",
      "doi": "10.1145/2486227.2486233"
    },
    {
      "text": "Margot Brereton, Alessandro Soro, Kate Vaisutis, and Paul Roe. 2015. The Messaging Kettle: Prototyping Connection over a Distance Between Adult Children and Older Parents. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 713--716.  ",
      "doi": "10.1145/2702123.2702462"
    },
    {
      "text": "Barry Brown, Alex S. Taylor, Shahram Izadi, Abigail Sellen, Joseph Kaye, and Rachel Eardley. 2007. Locating Family Values: A Field Trial of the Whereabouts Clock. Proceedings of the 9th International Conference on Ubiquitous Computing (UbiComp'07) 4717: 354--371. ",
      "doi": "10.5555/1771592.1771613"
    },
    {
      "text": "Jennie Carroll. 2004. Completing Design in Use?: Closing the Appropriation Cycle. European Conference of Information Systems, January 2004, 11.",
      "doi": ""
    },
    {
      "text": "Jonathan Chapman. 2009. Design for (emotional) durability. Design Issues 25, 4: 29--35.",
      "doi": ""
    },
    {
      "text": "Hyemin Chung, Chia-Hsun Jackie Lee, and Ted Selker. 2006. Lover's Cups: Drinking Interfaces As New Communication Channels. CHI '06 Extended Abstracts on Human Factors in Computing Systems, ACM, 375--380.  ",
      "doi": "10.1145/1125451.1125532"
    },
    {
      "text": "N. Cila, Elisa Giaccardi, Melissa Caldwell, N. Rubens, and F. Tynan-O'Mahony. 2015. Listening To an Everyday Kettle?: How Can the Data Objects Collect Be Useful for Design Research? Proceedings of the 4th Participatory Innovation Conference, 500--506.",
      "doi": ""
    },
    {
      "text": "Allan Costall and O. Dreir. 2006. Doing Things with Things: The Design and Use of Everyday Objects. Ashgate Publishing, Aldershot.",
      "doi": ""
    },
    {
      "text": "M Csikszentmihalyi. 1993. Why We Need Things.pdf. History from Things, 20--29.",
      "doi": ""
    },
    {
      "text": "Jelle van Dijk, Remko van der Lugt, and Caroline Hummels. 2014. Beyond Distributed R epresentation?: Embodied Cognition Design Supporting Socio Sensorimotor Couplings. 8th International Conference on Tangible, Embedded and Embodied Interaction, 181--188.  ",
      "doi": "10.1145/2540930.2540934"
    },
    {
      "text": "Alan Dix. 2007. Designing for Appropriation. Proceedings of the 21st BCS HCI Group Conference, 2--5. ",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "Paul Dourish. 2004. Where the Action Is: The Foundations of Embodied Interaction. MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Pelle Ehn. 2008. Participation in Design Things. Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, Indiana University, 92--101. ",
      "doi": "10.5555/1795234.1795248"
    },
    {
      "text": "George W Fitzmaurice, Hiroshi Ishii, and William A S Buxton. 1995. Bricks: laying the foundations for graspable user interfaces. CHI '95: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM Press/Addison-Wesley Publishing Co., 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Elisa Giaccardi, Nazli Cila, Chris Speed, Melissa Caldwell, and Santa Cruz. 2016. Thing Ethnography?: Doing Design Research with NonHumans. Dis 2016, 377--387.  ",
      "doi": "10.1145/2901790.2901905"
    },
    {
      "text": "Elisa Giaccardi, Chris Speed, Nazli Cila, and Melissa L Caldwell. 2016. Things as coethnographers: Implications of a thing perspective for design and anthrolopogy. In Design Anthropological Futures, R.C. Smith et al. (ed.). 235--248.",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi, Chris Speed, and N. Rubens. 2014. Things Making Things: An Ethnography of the Impossible. Proceedings of the 1st International Research Network for Design Anthropology (online proceedings), 10--11.",
      "doi": ""
    },
    {
      "text": "Daniel López Gómez. 2015. Little arrangements that matter . Rethinking autonomy-enabling innovations for later life. Technological Forecasting & Social Change 93: 91--101.",
      "doi": ""
    },
    {
      "text": "Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow design for meaningful interactions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13, November 2015: 3431.  ",
      "doi": "10.1145/2470654.2466472"
    },
    {
      "text": "Paul Hewer and Douglas Brownlie. 2007. Cultures of consumption of car aficionados . Aethetics and consumption communities. International Journal of Sociology and Social Policy 27, 3/4: 106--119.",
      "doi": ""
    },
    {
      "text": "Michael S Horn. 2013. The Role of Cultural Forms in Tangible Interaction Design. International Conference on Tangible, Embedded and Embodied Interaction, 117--124.  ",
      "doi": "10.1145/2460625.2460643"
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a Grip on Tangible Interaction?: A Framework on Physical Space and Social Interaction. Computer Human Interaction.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. CHI '97: Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Hsin-liu Cindy Kao and Chris Schmandt. 2015. MugShots?: A Mug Display for Front & Back Stage Social Interaction in the Workplace. Proceedings of the 9th International Conference on Tangible, Embedded, and Embodied Interaction - TEI '15, 57--60.  ",
      "doi": "10.1145/2677199.2680557"
    },
    {
      "text": "Jina Kim, Young-woo Park, and Tek-jin Nam. 2015. BreathingFrame?: An Inflatable Frame for Remote Breath Signal Sharing. Proceedings of the 9th International Conference on Tangible, Embedded, and Embodied Interaction - TEI '15, 109--112.  ",
      "doi": "10.1145/2677199.2680606"
    },
    {
      "text": "Treffyn Lynch Koreshoff, Tuck Wah Leong, and Toni Robertson. 2013. Approaching a Humancentred Internet of Things. Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration, ACM, 363--366.  ",
      "doi": "10.1145/2541016.2541093"
    },
    {
      "text": "Treffyn Lynch Koreshoff, Toni Robertson, and Tuck Wah Leong. 2013. Internet of things: a review of literature and products. Proceedings of the 25th Australian Computer-Human Interaction Conference on Augmentation, Application, Innovation, Collaboration - OzCHI '13: 335--344.  ",
      "doi": "10.1145/2541016.2541048"
    },
    {
      "text": "G Kortuem, F Kawsar, D Fitton, and V Sundramoorthy. 2010. Smart objects as building blocks for the internet of things. Internet Computing, -- 14, 1: 44--51.  ",
      "doi": "10.1109/MIC.2009.143"
    },
    {
      "text": "Bruno Latour. 1999. Pandora's Hope: Essays on the Reality of Science Studies. Harvard University Press, 179.",
      "doi": ""
    },
    {
      "text": "Youn-kyung Lim, Erik Stolterman, Heekyoung Jung, and Justin Donaldson. 2007. Interaction Gestalt and the Design of Aesthetic Interactions. Designing Pleasurable Products and Interfaces, August: 22--25.  ",
      "doi": "10.1145/1314161.1314183"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. The Threads of Experience. In Technology as Experience. 79--104.",
      "doi": ""
    },
    {
      "text": "Gratiane de Moustier. 2008. The Story of Odile. Gratiane de Moustier. Retrieved June 26, 2016 from http://gratianedemoustier.com/stories/thestory-of-odile/",
      "doi": ""
    },
    {
      "text": "Ruth Mugge, Jan P.L. Schoormans, and Hendrik N.J. Schifferstein. 2009. Emotional bonding with personalised products. Journal of Engineering Design 20, 5: 467--476.",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Jim Rowan, Annie Jacobs, and Sarah Craighill. 2001. Digital Family Portraits: Supporting Peace of Mind for Extended Family Members. Proceedings of the SIGCHI conference on Human factors in computing systems: 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Bjorn Nansen, Luke van Ryn, Frank Vetere, Toni Robertson, Margot Brereton, and Paul Douish. 2014. An Internet of Social Things. Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design, ACM, 87--96.  ",
      "doi": "10.1145/2686612.2686624"
    },
    {
      "text": "Bjorn Nansen, Frank Vetere, Toni Robertson, John Downs, Margot Brereton, and Jeannette Durick. 2014. Reciprocal Habituation: A Study of Older People and the Kinect. ACM Transactions on Computer-Human Interaction 21, 3: 1--20.  ",
      "doi": "10.1145/2617573"
    },
    {
      "text": "M. Nevile, P. Haddington, T. Heinemann, and M. Rauniomaa. 2014. Interacting with objects: Language, materiality, and social activity. John Benjamins Publishing, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Wanda J. Orlikowski. 2007. Sociomaterial Practices: Exploring Technology at Work. Organization Studies 28: 1435--1448.",
      "doi": ""
    },
    {
      "text": "Julian E. Orr. 1996. Talking about Machines: An Ethnography of a Modern Job. Cornell University Press, London.",
      "doi": ""
    },
    {
      "text": "Marianne Graves Petersen, Ole Sejer Iversen, and Peter Gall Krogh. 2004. Aesthetic Interaction -- A Pragmatist's Aesthetics of Interactive Systems. Designing Interactive Systems '04 Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques 1: 269--276.  ",
      "doi": "10.1145/1013115.1013153"
    },
    {
      "text": "Johan Redström. 2008. Tangled Interaction: On the Expressiveness of Tangled User Interfaces. ACM Transactions on Computer-Human Interaction 15, 4: 1--17.  ",
      "doi": "10.1145/1460355.1460358"
    },
    {
      "text": "Johan Redström, Marianne Graves Petersen, Hallnäs Lar, and Jacob Robert J.K. 2008. Introduction to special issue on the aesthetics of interaction. ACM Transactions on ComputerHuman Interaction 15, 3: 1--5.  ",
      "doi": "10.1145/1453152.1453153"
    },
    {
      "text": "Karen Renaud and Judy Van Biljon. 2008. Predicting Technology Acceptance and Adoption by the Elderly?: A Qualitative study. Saicsit 2008, 210--219. http://doi.org/1456659.1456684  ",
      "doi": "10.1145/1456659.1456684"
    },
    {
      "text": "Vincent van Rheden and Bart Hengeveld. 2016. Engagement Through Embodiment. Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, ACM Press, 349--356.  ",
      "doi": "10.1145/2839462.2839498"
    },
    {
      "text": "Kai Riemer and Robert Bruce Johnstone. 2012. Place-making: A Phenomenological Theory of Technology Appropriation. Proc. of 33rd International Conference on Information Systems, Association for Information Systems.",
      "doi": ""
    },
    {
      "text": "Jim Rowan and Elizabeth D. Mynatt. 2005. Digital Family Portrait Field Trial: Support for Aging in Place. Proceedings of the SIGCHI conference on Human factors in computing systems, 521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2015. The Messaging Kettle: It's IoTea Time. Proceedings of the 5th Decennial Aarhus Conference, 57--59.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2016. Towards an Analysis Framework of Technology Habituation by Older Users. Proceedings of the 2016 ACM Conference on Designing Interactive Systems, ACM, 1021--1033.  ",
      "doi": "10.1145/2901790.2901806"
    },
    {
      "text": "Carolyn F Strauss and Alastair Fuad-luke. 2008. The Slow Design Principles. Changing the Change.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human-Machine Reconfiguration. Cambridge Universtiy Press, New York, NY, USA. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Lucy Suchman and Brigitte Jordan. 1997. Computerization and Women's Knowledge. In Reinventing technology, rediscovering community: Critical explorations of computing as a social practice. 97--105.",
      "doi": ""
    },
    {
      "text": "B Ullmer and H Ishii. 2000. Emerging frameworks for tangible user interfaces. IBM Syst. J. 39, 3--4: 915--931.  ",
      "doi": "10.1147/sj.393.0915"
    },
    {
      "text": "Kate Vaisutis, Margot Brereton, Toni Robertson, et al. 2014. Invisible Connections: Investigating Older People's Emotions and Social Relations Around Objects. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1937--1940.  ",
      "doi": "10.1145/2556288.2557314"
    },
    {
      "text": "Thomas Visser, Martijn H. Vastenburg, and David V. Keyson. 2011. Designing to support social connectedness: The case of snowglobe. International Journal of Design 5, 3: 129--142.",
      "doi": ""
    },
    {
      "text": "Mark Weiser and John Seely Brown. 2001. The Coming Age of Calm Technology { 1 } Transition the Internet and Distributed Computing. Distributed Computing.",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Phoebe Sengers, and Rebecca E Grinter. 2006. Historical analysis: Using the past to design the future. Ubicomp: 35--51.  ",
      "doi": "10.1007/11853565_3"
    },
    {
      "text": "Oren Zuckerman, Tamar Gal, Tal KerenCapelovitch, Tal Karsovsky, Ayelet Gal-Oz, and Patrice L Tamar Weiss. 2016. DataSpoon: Overcoming Design Challenges in Tangible and Embedded Assistive Technologies. Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction, 30--37.  ",
      "doi": "10.1145/2839462.2839505"
    }
  ]
}