{
  "doi": "10.1145/3025453.3025476",
  "title": "Recording and Sharing Non-Visible Information on Body Movement while Skateboarding",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2488-2492",
  "year": 2017,
  "badges": [],
  "abstract": "Knowing your own body movement is an essential element of sports. Recently, the popularization of smartphones has enabled people to easily record their performance in most situations. However, these observations have limited applicability in assisting with a clear understanding of body movement. In this paper, we propose the Motion Log Skateboard, which records and shares non-visible information about body movement that is difficult to obtain through current observation methods in skateboarding. A pressure-sensor matrix on a skateboard deck is used to record the pressure distribution data, which are then played using the video function of a smartphone camera. With this logged data, a user can access the feet positions, pressure intensity, and timing of the foot movements. To verify the proposed concept and determine the specific context of its use, an experimental session and interviews were conducted with skateboarders of various skill levels. Based on the results of this research, the shared experiences of non-visible information, which is perceived differently depending on the individual, are expected to become a standard for exploring and training body movement.",
  "tags": [
    "representation",
    "sports learning",
    "body movement",
    "sports interaction",
    "body perception",
    "skateboarding"
  ],
  "authors": [
    {
      "name": "Hyung Kun Park",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82459108657",
      "orcid": "missing"
    },
    {
      "name": "HyeonBeom Yi",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162621",
      "orcid": "missing"
    },
    {
      "name": "Woohun Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100384795",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Daniel R. Mestre, Virginie Dagonneau, and CharlesSymphorien Mercier. 2011. Does Virtual Reality Enhance Exercise Performance, Enjoyment, and Dissociation? An Exploratory Study on a Stationary Bike Apparatus. Presence: Teleoperators and Virtual Environments 20, 1: 1--14. http://doi.org/10.1162/pres_a_00031",
      "doi": ""
    },
    {
      "text": "Florian \"Floyd\" Mueller, Darren Edge, Frank Vetere, et al. 2011. Designing sports: a framework for exertion games. Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11: 2651-- 2660. http://doi.org/10.1145/1978942.1979330",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Frederick, E. C., Determan, J. J., Whittlesey, S. N., & Hamill, J. 2006. Biomechanics of skateboarding: Kinetics of the Ollie. Journal of applied biomechanics, 22(1), 33. https://doi.org/10.1123/jab.22.1.33 ",
      "doi": ""
    },
    {
      "text": "Hamilton a. Hernandez, Zi Ye, T.C. Nicholas Graham, Darcy Fehlings, and Lauren Switzer. 2013. Designing action-based exergames for children with cerebral palsy. Human Factors in Computing Systems: Proceedings of the SIGCHI Conference, (CHI 2013): 1261--1270. http://doi.org/10.1145/2470654.2466164",
      "doi": "10.1145/2470654.2466164"
    },
    {
      "text": "Holleczek, T., Zysset, C., Arnrich, B., Roggen, D., & Troster, G. 2009. Towards an interactive snowboarding assistance system. Proceedings of 2009 International Symposium on Wearable Computers -- IEEE'09: 147148. https://doi.org/10.1109/iswc.2009.30",
      "doi": "10.1109/iswc.2009.30"
    },
    {
      "text": "HyungKun Park and Woohun Lee (2016, June). Motion Echo Snowboard: Enhancing Body Movement Perception in Sport via Visually Augmented Feedback. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems -- DIS '16: 192--203. http://doi/10.1145/2901790.2901797",
      "doi": "10.1145/2901790.2901797"
    },
    {
      "text": "IOFIT http://iofitshoes.com/",
      "doi": ""
    },
    {
      "text": "J. R. Roberts, R. Jones, N. J. Mansfield, and S. J. Rothberg. 2005. Evaluation of impact sound on the \"feel\" of a golf shot. Journal of Sound and Vibration 287, 4--5: 651--666. http://doi.org/10.1016/j.jsv.2004.11.026",
      "doi": ""
    },
    {
      "text": "Jon Moeller, DIY Pressure Sensitive Floors for Expressive Interaction",
      "doi": ""
    },
    {
      "text": "Kitronix, Arduino Embedded Force & Touch Development Kit (TDK), http://www.kitronyx.com/snowboard.html",
      "doi": ""
    },
    {
      "text": "NIKE SB, iOS application, http://www.nike.com/us/en_us/c/skateboarding/sb-app",
      "doi": ""
    },
    {
      "text": "Ojala, J., & Saarela, J. (2010). Understanding social needs and motivations to share data in online sports communities. Proceedings of the 14th International Academic MindTrek Conference -- MindTrek 10: 95102. https://doi.org/10.1145/1930488.1930508  ",
      "doi": "10.1145/1930488.1930508"
    },
    {
      "text": "Philip Kelly, Aoife Healy, Kieran Moran, and Noel E. O'Connor (October, 2010). A virtual coaching environment for improving golf swing technique. In Proceedings of the 2010 ACM workshop on Surreal media and virtual cloning, SMVC '10, 51--56, http://doi.org/10.1145/1878083.1878098  ",
      "doi": "10.1145/1878083.1878098"
    },
    {
      "text": "Reynell, E., & Thinyane, H. (2012, October). Hardware and software for skateboard trick visualisation on a mobile phone. In Proceedings of the South African Institute for Computer Scientists and Information Technologists Conference, SAICSIT '12: 253--261https://doi.org/10.1145/2389836.2389866",
      "doi": "10.1145/2389836.2389866"
    },
    {
      "text": "Rideblock http://www.rideblock.com/",
      "doi": ""
    },
    {
      "text": "Sebastiaan Pijnappel and Florian \"Floyd\" Mueller. 2013. Designing interactive technology for skateboarding. Proceeadings of the 8th International Conference on Tangible, Embedded and Embodied Interaction - TEI '14: 141--148. http://doi.org/10.1145/2540930.2540950",
      "doi": "10.1145/2540930.2540950"
    },
    {
      "text": "Stina Nylander and Jakob Tholander. 2014. Designing for Movement: the Case of Sports. Proceedings of the 2014 International Workshop on Movement and Computing - MOCO '14: 130--135. http://doi.org/10.1145/2617995.2618018  ",
      "doi": "10.1145/2617995.2618018"
    },
    {
      "text": "Strava, http://strava.com/",
      "doi": ""
    },
    {
      "text": "Syrmo http://syrmo.com/",
      "doi": ""
    },
    {
      "text": "Williams, Alison M. \"King of the Mountain: A Rapid Ethnography of Strava Cycling.\"",
      "doi": ""
    },
    {
      "text": "W. F. Helsen and J. L. Starkes. 1999. A multidimensional approach to skilled perception and performance in sport. Applied Cognitive Psychology 13, 1: 1--27. http://doi.org/10.1002/(SICI)10990720(199902)13:13.0.CO;2-T",
      "doi": ""
    }
  ]
}