{
  "doi": "10.1145/3025453.3025934",
  "title": "Be Me or Be Mii?: A Study of Self-Presentation and Interaction in the Miitomo Mobile Application",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1973-1977",
  "year": 2017,
  "badges": [],
  "abstract": "In this study, we consider what Nintendo's widely downloaded Miitomo mobile application, which simultaneously promotes non-idealized self-fictionalization and authentic self-presentation, can suggest to us about self-presentation and technology design. Ten groups of four friends each (N=40), all novice users, engaged with Miitomo for one week, and completed supplementary pre- and post-use surveys. The data were analyzed to assess the extent to which participants' engagement in Miitomo reflected their \"real life\" selves and correlated with in-app and \"real life\" features, respectively. Although most participants believed that their behaviors within the app accurately reflected their \"true selves,\" we found that in-app traits generally correlated more strongly with Miitomo engagement patterns than did users' \"real life\" traits and qualities. We discuss implications for social network and online community design, and propose future plans to study authenticity and self-distancing in online self-presentation.",
  "tags": [
    "authenticity",
    "social networks",
    "mobile application",
    "self-presentation",
    "fantasy",
    "self-distancing",
    "personality"
  ],
  "authors": [
    {
      "name": "Anna Kasunic",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688728",
      "orcid": "missing"
    },
    {
      "name": "Geoff Kaufman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459698057",
      "orcid": "0000-0002-0123-3792"
    }
  ],
  "references": [
    {
      "text": "Arthur Aron and Barbara Fraley. 1999. Relationship Closeness as Including Other in the Self: Cognitive Underpinnings and Measures. Social Cognition 17, 140--160. http://doi.org/10.1521/soco.1999.17.2.140 ",
      "doi": ""
    },
    {
      "text": "Mitja D Back, Juliane M Stopfer, Simine Vazire, et al. 2010. Facebook Profiles Reflect Actual Personality, Not Self-Idealization. Source: Psychological Science 21, 3: 372--374. http://doi.org/10.1177/0956797609360756",
      "doi": ""
    },
    {
      "text": "John A. Bargh, Katelyn Y. A. McKenna, and Grainne M. Fitzsimons. 2002. Can You See the Real Me? Activation and Expression of the \"True Self\" on the Internet. Journal of Social Issues 58, 1: 33--48. http://doi.org/10.1111/1540--4560.00247",
      "doi": ""
    },
    {
      "text": "Fabio Celli, Elia Bruni, and Bruno Lepri. 2014. Automatic Personality and Interaction Style Recognition from Facebook Profile Pictures. Proceedings of the ACM International Conference on Multimedia - MM '14: 1101--1104. http://doi.org/10.1145/2647868.2654977  ",
      "doi": "10.1145/2647868.2654977"
    },
    {
      "text": "Youjeong Kim and S. Shyam Sundar. 2012. Visualizing ideal self vs. actual self through avatars: Impact on preventive health outcomes. Computers in Human Behavior 28, 4: 1356--1364. http://doi.org/10.1016/j.chb.2012.02.021  ",
      "doi": "10.1016/j.chb.2012.02.021"
    },
    {
      "text": "Kristine L. Nowak. 2013. Choosing Buddy Icons that look like me or represent my personality: Using Buddy Icons for social presence. Computers in Human Behavior 29, 4: 1456--1464. http://doi.org/10.1016/j.chb.2013.01.027  ",
      "doi": "10.1016/j.chb.2013.01.027"
    },
    {
      "text": "Bradley M. Okdie, Rosanna E. Guadagno, Frank J. Bernieri, Andrew L. Geers, and Amber R. MclarneyVesotski. 2011. Getting to know you: Face-to-face versus online interactions. Computers in Human Behavior 27, 1: 153--159. http://doi.org/10.1016/j.chb.2010.07.017",
      "doi": "10.1016/j.chb.2010.07.017"
    },
    {
      "text": "John P. Oliver and Sanjay Srivastava. 1999. Big Five Inventory (BFI). Handbook of personality: Theory and research 2: 102--138. http://doi.org/10.1525/fq.1998.51.4.04a00260",
      "doi": ""
    },
    {
      "text": "Joseph Schwartz. 2016. Trending US Apps- March 2016. Digital Vision.",
      "doi": ""
    },
    {
      "text": "Gwendolyn Seidman. 2013. Self-presentation and belonging on Facebook: How personality influences social media use and motivations. Personality and Individual Differences 54, 3: 402--407. http://doi.org/10.1016/j.paid.2012.10.009 ",
      "doi": ""
    },
    {
      "text": "Itoi Shigesato. 2016. Miitomo's Potential: Yoshio Sakamoto and Shigesato Itoi. Miitomo website. Retrieved from https://miitomo.com/en/talk/",
      "doi": ""
    },
    {
      "text": "Aaron Souppouris. 2016. Nintendo's \"Miitomo\" app passes 10 million users. Engadget.",
      "doi": ""
    },
    {
      "text": "Lawrence R. Wheeless. 1978. A Follow-Up Study of the Relationships Among Trust, Disclosure, and Interpersonal Solidarity. Human Communication Research 4, 2: 143--157. http://doi.org/10.1111/j.14682958.1978.tb00604.x",
      "doi": ""
    },
    {
      "text": "Monica T. Whitty. 2008. Revealing the \"real\" me, searching for the \"actual\" you: Presentations of self on an internet dating site. Computers in Human Behavior 24, 4: 1707--1723. http://doi.org/10.1016/j.chb.2007.07.002  ",
      "doi": "10.1016/j.chb.2007.07.002"
    },
    {
      "text": "D. Williams, T. L. M. Kennedy, and R. J. Moore. 2011. Behind the Avatar: The Patterns, Practices, and Functions of Role Playing in MMOs. Games and Culture 6: 171--200. http://doi.org/10.1177/1555412010364983 ",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The proteus effect: The effect of transformed self-representation on behavior. Human Communication Research 33, 3: 271--290. http://doi.org/10.1111/j.14682958.2007.00299.x",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jn Bailenson. 2006. Walk a mile in digital shoes: The impact of embodied perspectivetaking on the reduction of negative stereotyping in immersive virtual environments. Proceedings of PRESENCE: 147--156.",
      "doi": ""
    },
    {
      "text": "Miitomo | Nintendo. Retrieved from https://miitomo.com/en/talk/03.html",
      "doi": ""
    },
    {
      "text": "The rise and fall of Nintendo's Miitomo: Massive downloads don't mean success. Retrieved January 5, 2017 from http://venturebeat.com/2016/05/28/the-riseand-fall-of-nintendos-miitomo-massive-downloadsdont-mean-success/",
      "doi": ""
    }
  ]
}