{
  "doi": "10.1145/3025453.3025666",
  "title": "Consumer to Creator: How Households Buy Furniture to Inform Design and Fabrication Interfaces",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "484-496",
  "year": 2017,
  "badges": [],
  "abstract": "Emerging technologies for digital design and fabrication let people participate in the making of objects that were previously dominated by professional designers. A growing body of work in HCI provides understanding in the activities of designing and making by novices and in maker communities. However, we know little about how casual users might employ these technologies with the goal of having an object in their home that satisfies a need. We present a long-term qualitative study in which we followed 16 households during a purchasing process of furniture items for their homes. We looked into how families discover what they need, find solutions, realize a solution in their house and put it to use. The results provide insights into their design activities and workflow and we identify two distinct stages: understanding needs and prototyping a solution. Based on the findings, we discuss the social practice of acquiring and appropriating furniture in the home and within families, and identify design opportunities for digital design and fabrication to support people as they create the objects they need, want and desire.",
  "tags": [
    "design",
    "qualitative study",
    "furniture",
    "purchase",
    "fabrication"
  ],
  "authors": [
    {
      "name": "Bokyung Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-99658747582/rel-imgonly/bokyunglee_jpg.jpg",
      "acmid": "99658747582",
      "orcid": "missing"
    },
    {
      "name": "Gyeol Han",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658729485",
      "orcid": "missing"
    },
    {
      "name": "Jundong Park",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162385",
      "orcid": "missing"
    },
    {
      "name": "Daniel Saakes",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309492813",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Harshit Agrawal, Udayan Umapathi, Robert Kovacs, Johannes Frohnhofen, Hsiang-Ting Chen, Stefanie Mueller, and Patrick Baudisch. 2015. Protopiper: Physically Sketching Room-Sized Objects at Actual Scale. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 427--436. DOI: http://dx.doi.org/10.1145/2807442.2807505  ",
      "doi": "10.1145/2807442.2807505"
    },
    {
      "text": "Zeynep Arsel and Jonathan Bean. 2013. Taste Regimes and Market-Mediated Practice. Journal of Consumer Research 39, 5 (2013), 899--917. ",
      "doi": ""
    },
    {
      "text": "Rachel Ashman, Michael R. Solomon, and Julia Wolny. 2015. An old model for a new age: Consumer decision making in participatory digital culture. Journal of Customer Behaviour 14, 2 (2015), 127--146. DOI: http://dx.doi.org/doi:10.1362/147539215X14373846805743 ",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1998. Contextual Design: Defining Customer-centered Systems. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/286067"
    },
    {
      "text": "Adrien Bousseau, Theophanis Tsandilas, Lora Oehlberg, and Wendy E. Mackay. 2016. How Novices Sketch and Prototype Hand-Fabricated Objects. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 397--408. DOI: http://dx.doi.org/10.1145/2858036.2858159  ",
      "doi": "10.1145/2858036.2858159"
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00). ACM, New York, NY, USA, 424--433. DOI: http://dx.doi.org/10.1145/347642.347802  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Design Counsil. 2007. A Study of the Design Process. (2007). Retrieved July 3, 2016 from www.designcouncil.org.uk/resources/report/11-lessons-managing-design-global-brands.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Tom Rodden. 2004. Domestic Routines and Design for the Home. Comput. Supported Coop. Work 13, 2 (April 2004), 191--220. DOI: http://dx.doi.org/10.1023/B:COSU.0000045712.26840.a4  ",
      "doi": "10.1023/B%3ACOSU.0000045712.26840.a4"
    },
    {
      "text": "Nigel Cross. 2004. Expertise in design: an overview. Design Studies 25, 5 (2004), 427--441. DOI: http://dx.doi.org/10.1016/j.destud.2004.06.002 Expertise in Design. ",
      "doi": ""
    },
    {
      "text": "Darren W. Dahl and C. Page Moreau. 2007. Thinking Inside the Box: Why Consumers Enjoy Constrained Creative Experiences. Journal of Marketing Research 44, 3 (2007), 357--369. DOI: http://dx.doi.org/10.1509/jmkr.44.3.357 ",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Ron Wakkary. 2013. Manifestations of Everyday Design: Guiding Goals and Motivations. In Proceedings of the 9th ACM Conference on Creativity & Cognition (C&C '13). ACM, New York, NY, USA, 253--262. DOI: http://dx.doi.org/10.1145/2466627.2466643  ",
      "doi": "10.1145/2466627.2466643"
    },
    {
      "text": "Audrey Desjardins and Ron Wakkary. 2016. Living In A Prototype: A Reconfigured Space. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5274--5285. DOI: http://dx.doi.org/10.1145/2858036.2858261  ",
      "doi": "10.1145/2858036.2858261"
    },
    {
      "text": "Kees Dorst and Nigel Cross. 2001. Creativity in the design process: co-evolution of problem-solution. Design Studies 22, 5 (2001), 425 -- 437. DOI: http://dx.doi.org/10.1016/S0142-694X(01)00009-6 ",
      "doi": ""
    },
    {
      "text": "Sean Follmer, David Carr, Emily Lovell, and Hiroshi Ishii. 2010. CopyCAD: Remixing Physical Objects with Copy and Paste from the Real World. In Adjunct Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 381--382. DOI: http://dx.doi.org/10.1145/1866218.1866230  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Nikolaus Franke, Peter Keinz, and Martin Schreier. 2008. Complementing mass customization toolkits with user communities: How peer input improves customer self-design. Journal of product innovation management 25, 6 (2008), 546--559. ",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman and Daniela Rosner. 2011. From Garments to Gardens: Negotiating Material Relationships Online and 'by Hand'. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2257--2266. DOI: http://dx.doi.org/10.1145/1978942.1979273  ",
      "doi": "10.1145/1978942.1979273"
    },
    {
      "text": "Steffen Hedegaard and Jakob Grue Simonsen. 2013. Extracting Usability and User Experience Information from Online User Reviews. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2089--2098. DOI: http://dx.doi.org/10.1145/2470654.2481286  ",
      "doi": "10.1145/2470654.2481286"
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, and Parmit K. Chilana. 2016. Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers (CHI '16). ACM, New York, NY, USA, 384--396. DOI: http://dx.doi.org/10.1145/2858036.2858266  ",
      "doi": "10.1145/2858036.2858266"
    },
    {
      "text": "Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User Experience over Time: An Initial Framework. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 729--738. DOI:http://dx.doi.org/10.1145/1518701.1518814  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Ilpo Koskinen, Kristo Kuusela, Katja Battarbee, Anne Soronen, Frans Mäyrä, Jussi Mikkonen, and Mari Zakrzewski. 2006. Morphome: A Constructive Field Study of Proactive Information Technology in the Home. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, New York, NY, USA, 179--188. DOI: http://dx.doi.org/10.1145/1142405.1142435  ",
      "doi": "10.1145/1142405.1142435"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 295--304. DOI: http://dx.doi.org/10.1145/1868914.1868950  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Manfred Lau, Masaki Hirose, Akira Ohgawara, Jun Mitani, and Takeo Igarashi. 2012. Situated Modeling: A Shape-stamping Interface with Tangible Primitives. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, New York, NY, USA, 275--282. DOI: http://dx.doi.org/10.1145/2148131.2148190  ",
      "doi": "10.1145/2148131.2148190"
    },
    {
      "text": "Manfred Lau, Greg Saul, Jun Mitani, and Takeo Igarashi. 2010. Modeling-in-context: User Design of Complementary Objects with a Single Photo. In Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium (SBIM '10). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 17--24. http://dl.acm.org/citation.cfm?id=1923363.1923367",
      "doi": "10.5555/1923363.1923367"
    },
    {
      "text": "Bokyung Lee, Minjoo Cho, Joonhee Min, and Daniel Saakes. 2016. Posing and Acting As Input for Personalizing Furniture. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 44, 10 pages. DOI: http://dx.doi.org/10.1145/2971485.2971487  ",
      "doi": "10.1145/2971485.2971487"
    },
    {
      "text": "Torsten Lihra and Raoul Graf. 2007. Multi-channel communication and consumer choice in the household furniture buying process. Direct Marketing: An International Journal 1, 3 (2007), 146--160. ",
      "doi": ""
    },
    {
      "text": "Tuuli Mattelmäki. 2005. Applying probes: from inspirational notes to collaborative insights. CoDesign 1, 2 (2005), 83--102. DOI: http://dx.doi.org/10.1080/15719880500135821 ",
      "doi": ""
    },
    {
      "text": "Andrea Moed, Elizabeth Goodman, and Mike Kuniavsky. 2012. Observing the User Experience: A Practitioner's Guide to User Research (Interactive Technologies). Elsevier Science.",
      "doi": ""
    },
    {
      "text": "Opendesk. 2016. Opendesk-A different approach to design furniture. (2016). Retrieved Dec. 25, 2016 from https://www.opendesk.cc/.",
      "doi": ""
    },
    {
      "text": "Gerhard Pahl, W Beitz, Jörg Feldhusen, and Karl-Heinrich Grote. 2007. Engineering Design. A Systematic Approach (3 ed.). Springer-Verlag, London. DOI: http://dx.doi.org/10.1007/978--1--84628--319--2",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2011. Second-hand Interactions: Investigating Reacquisition and Dispossession Practices Around Domestic Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2385--2394. DOI: http://dx.doi.org/10.1145/1978942.1979291  ",
      "doi": "10.1145/1978942.1979291"
    },
    {
      "text": "Taylor Randall, Christian Terwiesch, and Karl T. Ulrich. 2005. Principles for User Design of Customized Products. California Management Review 47, 4 (2005), 68--85. DOI: http://dx.doi.org/10.2307/41166317 ",
      "doi": ""
    },
    {
      "text": "Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA Hacking: I'M Not One to Decoupage a Tabletop and Call It a Day. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 419--422. DOI: http://dx.doi.org/10.1145/1518701.1518768  ",
      "doi": "10.1145/1518701.1518768"
    },
    {
      "text": "Greg Saul, Manfred Lau, Jun Mitani, and Takeo Igarashi. 2011. SketchChair: An All-in-one Chair Design System for End Users. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 73--80. DOI: http://dx.doi.org/10.1145/1935701.1935717  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Theodore R Schatzki. 1996. Social practices: A Wittgensteinian approach to human activity and the social. Cambridge Univ Press.",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1983. The reflective practitioner: How professionals think in action. Vol. 5126. Basic books.",
      "doi": ""
    },
    {
      "text": "Rita Shewbridge, Amy Hurst, and Shaun K. Kane. 2014. Everyday Making: Identifying Future Uses for 3D Printing in the Home. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 815--824. DOI: http://dx.doi.org/10.1145/2598510.2598544  ",
      "doi": "10.1145/2598510.2598544"
    },
    {
      "text": "Leon Shiffman and Leslie Lazar Kanuk. 2004. Consumer behavior (8 ed.). Pearson Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Elizabeth Shove, Mika Pantzar, and Matt Watson. 2012. The dynamics of social practice: Everyday life and how it changes. Sage Publications. ",
      "doi": ""
    },
    {
      "text": "Jeffry A. Simpson, Vladas Griskevicius, and Alexander J. Rothman. 2012. Consumer decisions in relationships. Journal of Consumer Psychology 22, 3 (2012), 304--314. DOI: http://dx.doi.org/10.1016/j.jcps.2011.09.007 ",
      "doi": ""
    },
    {
      "text": "G. J. Szybillo and A. Sosanie. 1977. Family decision making: Husband, wife and children. Advances in Consumer Research 4 (1977), 46--49.",
      "doi": ""
    },
    {
      "text": "Karl Ulrich and Steven Eppinger. 2004. Product Design and Development. McGraw-Hill, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Nobuyuki Umentani, Takeo Igarashi, and Niloy J. Mitra. 2015. Guided Exploration of Physically Valid Shapes for Furniture Design. Commun. ACM 58, 9 (Aug. 2015), 116--124. DOI: http://dx.doi.org/10.1145/2801945  ",
      "doi": "10.1145/2801945"
    },
    {
      "text": "Valentijn Visch, Ed Tan, and Daniel Saakes. 2015. Viewer Knowledge: Application of Exposure-based Layperson Knowledge in Genre-specific Animation Production. International Journal of Design 9, 1 (2015).",
      "doi": ""
    },
    {
      "text": "Froukje Sleeswijk Visser, Pieter Jan Stappers, Remko Van der Lugt, and Elizabeth B. N. Sanders. 2005. Contextmapping: experiences from practice. CoDesign 1, 2 (2005), 119--149. ",
      "doi": ""
    },
    {
      "text": "Eric von Hippel. 2005. Democratizing Innovation. The MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary and Leah Maestri. 2007. The Resourcefulness of Everyday Design. In Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition (C&C '07). ACM, New York, NY, USA, 163--172. DOI: http://dx.doi.org/10.1145/1254960.1254984  ",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Alan Warde. 2005. Consumption and Theories of Practice. Journal of Consumer Culture 5, 2 (2005), 131--153. DOI: http://dx.doi.org/10.1177/1469540505053090 ",
      "doi": ""
    },
    {
      "text": "Christian Weichel, Jason Alexander, Abhijit Karnik, and Hans Gellersen. 2015. SPATA: Spatio-Tangible Tools for Fabrication-Aware Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 189--196. DOI: http://dx.doi.org/10.1145/2677199.2680576  ",
      "doi": "10.1145/2677199.2680576"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3855--3864. DOI: http://dx.doi.org/10.1145/2556288.2557090  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Allen T.W. Whitfield and Lucila R de Destefani. 2011. Mundane aesthetics. Psychology of Aesthetics, Creativity, and the Arts 5, 3 (2011), 291--299.",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User Experience in Do-it-yourself-style Smart Homes. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 779--790. DOI: http://dx.doi.org/10.1145/2750858.2806063  ",
      "doi": "10.1145/2750858.2806063"
    }
  ]
}