{
  "doi": "10.1145/3025453.3025845",
  "title": "Facade: Auto-generating Tactile Interfaces to Appliances",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5826-5838",
  "year": 2017,
  "badges": [],
  "abstract": "Common appliances have shifted toward flat interface panels, making them inaccessible to blind people. Although blind people can label appliances with Braille stickers, doing so generally requires sighted assistance to identify the original functions and apply the labels. We introduce Facade - a crowdsourced fabrication pipeline to help blind people independently make physical interfaces accessible by adding a 3D printed augmentation of tactile buttons overlaying the original panel. Facade users capture a photo of the appliance with a readily available fiducial marker (a dollar bill) for recovering size information. This image is sent to multiple crowd workers, who work in parallel to quickly label and describe elements of the interface. Facade then generates a 3D model for a layer of tactile and pressable buttons that fits over the original controls. Finally, a home 3D printer or commercial service fabricates the layer, which is then aligned and attached to the interface by the blind person. We demonstrate the viability of Facade in a study with 11 blind participants.",
  "authors": [
    {
      "name": "Anhong Guo",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99658635901/rel-imgonly/anhong_website.jpg",
      "acmid": "99658635901",
      "orcid": "0000-0002-4447-7818"
    },
    {
      "name": "Jeeeun Kim",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-87959397157/rel-imgonly/me_2020.jpeg",
      "acmid": "87959397157",
      "orcid": "0000-0002-8915-481X"
    },
    {
      "name": "Xiang 'Anthony' Chen",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81498649386/rel-imgonly/xac.jpg",
      "acmid": "81498649386",
      "orcid": "missing"
    },
    {
      "name": "Tom Yeh",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557134256",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    }
  ],
  "references": [
    {
      "text": "American Foundation for Blind 2016. Braille: Deciphering the code. http://braillebug.afb.org/braille_deciphering.asp. (2016).",
      "doi": ""
    },
    {
      "text": "Herbert Bay, Tinne Tuytelaars, and Luc Van Gool. 2006. SURF: Speeded up robust features. In Proceedings of the 9th European Conference on Computer Vision - Volume Part I (ECCV'06). Springer-Verlag, Berlin, Heidelberg, 404--417.  ",
      "doi": "10.1007/11744023_32"
    },
    {
      "text": "Jeffrey P. Bigham, Michael S. Bernstein, and Eytan Adar. 2015. Human-computer interaction and collective intelligence. Handbook of Collective Intelligence 57 (2015).",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010a. VizWiz: Nearly real-time answers to visual questions. In Proceedings of the 23rd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Andrew Miller, Brandyn White, and Tom Yeh. 2010b. VizWiz::LocateIt Enabling blind people to locate objects in their environment. In Computer Vision and Pattern Recognition Workshops (CVPRW), 2010 IEEE Computer Society Conference on. IEEE, 65--72.",
      "doi": ""
    },
    {
      "text": "Erin Brady and Jeffrey P. Bigham. 2015. Crowdsourcing accessibility: Human-powered access technologies. Foundations and Trends in Human-Computer Interaction 8, 4 (2015), 273--372.",
      "doi": "10.5555/2864703.2864704"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013. Visual challenges in the everyday lives of blind people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2117--2126.  ",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: Automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 131--138.  ",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frederic Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-sensory interactive maps for children living with visual impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 445--457.  ",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J. Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K. Kane. 2015. Sharing is caring: Assistive technology designs on thingiverse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 525--534.  ",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Erin Buehler, Amy Hurst, and Megan Hofmann. 2014a. Coming to grips: 3D printing for accessibility. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '14). ACM, NY, NY, USA, 291--292.  ",
      "doi": "10.1145/2661334.2661345"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014b. ABC and 3D: Opportunities and obstacles to 3D printing in special education environments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '14). ACM, NY, NY, USA, 107--114.  ",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "H. Burton, D. G. McLaren, and R. J. Sinclair. 2006. Reading embossed capital letters: An fMRI study in blind and sighted individuals. Human brain mapping 27, 4 (2006), 325--339.",
      "doi": ""
    },
    {
      "text": "Xiang 'Anthony' Chen, Stelian Coros, Jennifer Mankoff, and Scott E. Hudson. 2015. Encore: 3D printed augmentation of everyday objects with printed-over, affixed and interlocked attachments. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, NY, NY, USA, 73--82.  ",
      "doi": "10.1145/2807442.2807498"
    },
    {
      "text": "Xiang 'Anthony' Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A design tool for specifying, generating, and customizing 3D printable adaptations on everyday objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 29--39.  ",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Adrian A. de Freitas, Michael Nebeling, Xiang 'Anthony' Chen, Junrui Yang, Akshaye Shreenithi Kirupa Karthikeyan Ranithangam, and Anind K. Dey. 2016. Snap-To-It: A user-inspired platform for opportunistic device interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5909--5920.  ",
      "doi": "10.1145/2858036.2858177"
    },
    {
      "text": "Martin A. Fischler and Robert C. Bolles. 1981. Random sample consensus: A paradigm for model fitting with applications to image analysis and automated cartography. Commun. ACM 24, 6 (June 1981), 381--395.  ",
      "doi": "10.1145/358669.358692"
    },
    {
      "text": "Timo Götzelmann. 2016. LucentMaps: 3D printed audiovisual tactile maps for blind and visually impaired people. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 81--90.  ",
      "doi": "10.1145/2982142.2982163"
    },
    {
      "text": "Timo Götzelmann and Aleksander Pavkovic. 2014. Towards automatically generated tactile detail maps by 3D printers for blind persons. Springer International Publishing, Cham, 1--7.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Xiang 'Anthony' Chen, and Jeffrey P. Bigham. 2015. ApplianceReader: A wearable, crowdsourced, vision-based system to make appliances accessible. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 2043--2048.  ",
      "doi": "10.1145/2702613.2732755"
    },
    {
      "text": "Anhong Guo, Xiang 'Anthony' Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P. Bigham. 2016a. VizLens: A robust and interactive screen reader for interfaces in the real world. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 651--664.  ",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang 'Anthony' Chen, Tom Yeh, Scott E. Hudson, Jennifer Mankoff, and Jeffrey P. Bigham. 2016b. Facade: Auto-generating tactile interfaces to appliances. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 315--316.  ",
      "doi": "10.1145/2982142.2982187"
    },
    {
      "text": "Megan Hofmann, Jeffrey Harris, Scott E. Hudson, and Jennifer Mankoff. 2016. Helping hands: Requirements for a prototyping methodology for upper-limb prosthetics users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1769--1780.  ",
      "doi": "10.1145/2858036.2858340"
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P. Bigham. 2011. Supporting blind photography. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '11). ACM, NY, NY, USA, 203--210.  ",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking @Stemxcomet: Teaching programming to blind students via 3D printing, crisis management, and twitter. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14). ACM, NY, NY, USA, 247--252.  ",
      "doi": "10.1145/2538862.2538975"
    },
    {
      "text": "Jeeeun Kim and Tom Yeh. 2015. Toward 3D-printed movable tactile pictures for children with visual impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 2815--2824.  ",
      "doi": "10.1145/2702123.2702144"
    },
    {
      "text": "Benjamin Lafreniere, Tovi Grossman, Fraser Anderson, Justin Matejka, Heather Kerrick, Danil Nagy, Lauren Vasey, Evan Atherton, Nicholas Beirne, Marcelo H. Coelho, Nicholas Cote, Steven Li, Andy Nogueira, Long Nguyen, Tobias Schwinn, James Stoddart, David Thomasson, Ray Wang, Thomas White, David Benjamin, Maurice Conti, Achim Menges, and George Fitzmaurice. 2016. Crowdsourced fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 15--28.  ",
      "doi": "10.1145/2984511.2984553"
    },
    {
      "text": "Walter S. Lasecki, Phyo Thiha, Yu Zhong, Erin Brady, and Jeffrey P. Bigham. 2013. Answering visual questions with conversational crowd assistants. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, NY, NY, USA, Article 18, 8 pages.  ",
      "doi": "10.1145/2513383.2517033"
    },
    {
      "text": "Roberto Manduchi and James M. Coughlan. 2014. The last meter: Blind visual guidance to a target. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3113--3122.  ",
      "doi": "10.1145/2556288.2557328"
    },
    {
      "text": "Samantha McDonald, Niara Comrie, Erin Buehler, Nicholas Carter, Braxton Dubin, Karen Gordes, Sandy McCombe-Waller, and Amy Hurst. 2016. Uncovering challenges and opportunities for 3D printing assistive technology with physical therapists. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 131--139.  ",
      "doi": "10.1145/2982142.2982162"
    },
    {
      "text": "Samantha McDonald, Joshua Dutterer, Ali Abdolrahmani, Shaun K. Kane, and Amy Hurst. 2014. Tactile aids for visually impaired graphical design education. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '14). ACM, NY, NY, USA, 275--276.  ",
      "doi": "10.1145/2661334.2661392"
    },
    {
      "text": "George A. Miller. 1956. The magical number seven, plus or minus two: Some limits on our capacity for processing information. Psychological review 63, 2 (1956), 81.",
      "doi": ""
    },
    {
      "text": "Marius Muja and David G. Lowe. 2009. Fast approximate nearest neighbors with automatic algorithm configuration. In International Conference on Computer Vision Theory and Application VISSAPP'09). INSTICC Press, 331--340.",
      "doi": ""
    },
    {
      "text": "Jeffrey Nichols, Brad A. Myers, Michael Higgins, Joseph Hughes, Thomas K. Harris, Roni Rosenfeld, and Mathilde Pignol. 2002. Generating remote control interfaces for complex appliances. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, NY, NY, USA, 161--170.  ",
      "doi": "10.1145/571985.572008"
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A design tool for retrofitting physical interfaces using actuators, sensors and 3D printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 409--419.  ",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and talker: An accessible labeling toolkit for 3D printed models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4896--4907.  ",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Saiganesh Swaminathan, Thijs Roumen, Robert Kovacs, David Stangl, Stefanie Mueller, and Patrick Baudisch. 2016. Linespace: A sensemaking platform for the blind. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2175--2185.  ",
      "doi": "10.1145/2858036.2858245"
    },
    {
      "text": "Brandon Taylor, Anind Dey, Dan Siewiorek, and Asim Smailagic. 2016. Customizable 3D printed tactile maps as interactive overlays. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16). ACM, NY, NY, USA, 71--79.  ",
      "doi": "10.1145/2982142.2982167"
    },
    {
      "text": "United States Access Board 2016. Advancing full access and inclusion for all. https://www.access-board.gov/guidelines-and-standards. (2016).",
      "doi": ""
    },
    {
      "text": "Gregg Vanderheiden and Jutta Treviranus. 2011. Creating a global public inclusive infrastructure. In International Conference on Universal Access in Human-Computer Interaction. Springer, 517--526. ",
      "doi": "10.5555/2022591.2022652"
    },
    {
      "text": "Marynel Vázquez and Aaron Steinfeld. 2014. An assisted photography framework to help visually impaired users properly aim a camera. ACM Transactions on Computer-Human Interaction 21, 5, Article 25 (Nov. 2014), 29 pages.  ",
      "doi": "10.1145/2651380"
    },
    {
      "text": "Samuel White, Hanjie Ji, and Jeffrey P. Bigham. 2010. EasySnap: Real-time audio feedback for blind photography. In Adjunct Proceedings of the 23rd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 409--410.  ",
      "doi": "10.1145/1866218.1866244"
    },
    {
      "text": "Wikipedia. 2016. Homography (computer vision) - Wikipedia, The Free Encyclopedia. (2016). https://en.wikipedia.org/w/index.php?title=Homography_(computer_vision)&oldid=752434320 {Online; accessed 1-December-2016}.",
      "doi": ""
    },
    {
      "text": "Yu Zhong, Pierre J. Garrigues, and Jeffrey P. Bigham. 2013. Real time object scanning using a mobile phone and cloud-based visual search engine. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, NY, NY, USA, Article 20, 8 pages.  ",
      "doi": "10.1145/2513383.2513443"
    },
    {
      "text": "Yu Zhong, Walter S. Lasecki, Erin Brady, and Jeffrey P. Bigham. 2015. RegionSpeak: Quick comprehensive spatial descriptions of complex images for blind users. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2353--2362.  ",
      "doi": "10.1145/2702123.2702437"
    }
  ]
}