{
  "doi": "10.1145/3025453.3026003",
  "title": "Personas and Behavioral Theories: A Case Study Using Self-Determination Theory to Construct Overweight Personas",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2127-2136",
  "year": 2017,
  "badges": [],
  "abstract": "Personas are a widely used tool to keep real users in mind, while avoiding stereotypical thinking in the design process. Yet, creating personas can be challenging. Starting from Cooper's approach for constructing personas, this paper details how behavioral theory can contribute substantially to the development of personas. We describe a case study in which Self-Determination Theory (SDT) is used to develop five distinctive personas for the design of a digital coach for sustainable weight loss. We show how behavioral theories such as SDT can help to understand what genuinely drives and motivates users to sustainably change their behavior. In our study, we used SDT to prepare and analyze interviews with envisioned users of the coach and to create complex, yet engaging and highly realistic personas that make users' basic psychological needs explicit. The paper ends with a critical reflection on the use of behavioral theories to create personas, discussing both challenges and strengths.",
  "authors": [
    {
      "name": "Arne Jansen",
      "institution": "KU Leuven - imec, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556897156",
      "orcid": "missing"
    },
    {
      "name": "Maarten Van Mechelen",
      "institution": "KU Leuven - imec, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556774356",
      "orcid": "missing"
    },
    {
      "name": "Karin Slegers",
      "institution": "KU Leuven - imec, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442598065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anne Adams, Peter Lunt, and Paul Cairns. 2008. A qualitative approach to HCI research. In Paul Cairns and Anna L. Cox (reds.) Research Methods for Human-Computer Interaction. Cambridge University Press. ",
      "doi": ""
    },
    {
      "text": "Tamara Adlin and John Pruitt. 2010. The Essential Persona Lifecycle: Your Guide to Building and Using Personas. Burlington, Massachusetts: Morgan Kaufman Publishers.",
      "doi": ""
    },
    {
      "text": "Alissa N. Antle. 2008. Child-based personas: Need, ability and experience. In Cognition, Technology & Work 10(2), pp. 155--166. London: Springer-Verlag. DOI:http://dx.doi.org/10.1007/s10111-007-0071-2. [https://pdfs.semanticscholar.org/6619/8fbee049a7cd1b 462fa4912aa14cd9227c3e.pdf].  ",
      "doi": "10.1007/s10111-007-0071-2"
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI Research: Going Behind the Scenes. Morgan & Claypool Publishers.",
      "doi": "10.5555/3019315"
    },
    {
      "text": "Alan Cooper, Robert Reimann, and Dave Cronin. 2007. About Face 3: The Essentials of Interaction Design. Indianapolis, Indiana: Wiley Publishing.",
      "doi": "10.5555/1207736"
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The \"What\" and \"Why\" of Goal Pursuits: Human Needs and the Self-Determination of Behavior. In Psychological Inquiry, 11(4), pp 227--268. Abingdon, Oxfordshire: Taylor & Francis. [http://www.jstor.org/stable/1449618]. ",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2004. Handbook of Self-determination Research. Rochester, NY: University of Rochester Press.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne. 2006. Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design. London: The MIT Press.",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proc. CHI'03, pp. 233--240. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/642611.642653. [http://delivery.acm.org/10.1145/650000/642653/p233gaver.pdf].  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William W. Gaver, Andrew Boucher, Sarah Pennington, and Brendan Walker. 2004. Cultural Probes and the value of uncertainty. In Interactions, 11(5), pp. 53--56. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/1015530.1015555. [http://delivery.acm.org/10.1145/1020000/1015555/p5 3-gaver.pdf].  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Lieve Laporte, Karin Slegers, and Dirk De Grooff. 2012. Using Correspondence Analysis to monitor the persona segmentation process. In Proc. NordiCHI'12, pp. 265--274. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/2399016.2399058. [http://delivery.acm.org/10.1145/2400000/2399058/p2 65-laporte.pdf].  ",
      "doi": "10.1145/2399016.2399058"
    },
    {
      "text": "Chantal S. Levesque, Geoffrey C. Williams, Diane L. Elliot, Michael A. Pickering, Bradley Bodenhamer, and Phillip J. Finley. 2007. Validating the theoretical structure of the Treatment Self-Regulation Questionnaire (TSRQ) across three different health behaviors. In Health Education Research, 22 (5), pp. 691--702. Oxford University Press. [http://her.oxfordjournals.org/content/22/5/691.full.pdf ].",
      "doi": ""
    },
    {
      "text": "David Markland and Vannessa Tobin. 2004. A Modification to the Behavioural Regulation in Exercise Questionnaire to Include an Assessment of Amotivation. In Journal of Sport & Exercise Psychology, 26(2), pp. 191--196. Human Kinetics Publishers, Inc. DOI:http://dx.doi.org/10.1123/jsep.26.2.191. ",
      "doi": ""
    },
    {
      "text": "Trent W. Maurer, Deborah Allen, Delena B. Gatch, Padmini Shankar, and Diana Sturges. 2012. Students' Academic Motivations in Allied Health Classes. In The Internet Journal of Allied Health Sciences and Practice, 10(1), pp. 1--12. [http://nsuworks.nova.edu/ijahsp/vol10/iss1/6/].",
      "doi": ""
    },
    {
      "text": "Jennifer McGinn and Nalini Kotamraju. 2008. DataDriven Persona Development. In Proc. CHI'08, pp. 1521--1524. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/1357054.1357292. [http://delivery.acm.org/10.1145/1360000/1357292/p1 521-mcginn.pdf].  ",
      "doi": "10.1145/1357054.1357292"
    },
    {
      "text": "Tomasz Miaskiewicz, Tamara Sumner, and Kenneth A. Kozar. 2008. A Latent Semantic Analysis Methodology for the Identification and Creation of Personas. In Proc. CHI'08, pp. 1501--1510. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/1357054.1357290. [http://delivery.acm.org/10.1145/1360000/1357290/p1 501-miaskiewicz.pdf].  ",
      "doi": "10.1145/1357054.1357290"
    },
    {
      "text": "Christiane Moser, Ferena Fuchsberger, Katja Neureiter, Wolfgang Sellner, and Manfred Tscheligi. 2012. Revisiting Personas: The Making-of for Special User Groups. In Proc. CHI'12. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/2212776.2212822. [http://delivery.acm.org/10.1145/2220000/2212822/p4 53-moser.pdf].  ",
      "doi": "10.1145/2212776.2212822"
    },
    {
      "text": "Lene Nielsen. 2014. Personas. In Mads Soegaard and Rikke F. Dam (reds.) Encyclopedia of HumanComputer Interaction. The Interaction Design Foundation. [https://www.interactiondesign.org/literature/book/the-encyclopedia-of-humancomputer-interaction-2nd-ed/personas].",
      "doi": ""
    },
    {
      "text": "Lene Nielsen and Kira Storgaard Hansen. 2014. Personas is Applicable: A study on the Use of Personas in Denmark. In Proc. CHI'14, pp. 1665--1674. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/2556288.2557080. [http://delivery.acm.org/10.1145/2560000/2557080/p1 665-nielsen.pdf].  ",
      "doi": "10.1145/2556288.2557080"
    },
    {
      "text": "George Olsen. 2004. Persona Creation and Usage Toolkit. Interaction by Design [http://www.interactionbydesign.com/presentations/ols en_persona_toolkit.pdf].",
      "doi": ""
    },
    {
      "text": "John Pruitt and Jonathan Grudin. 2003. Personas: Practice and Theory. In Proc. DUX'03, pp. 1--15. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/997078.997089. [http://delivery.acm.org/10.1145/1000000/997089/p1pruitt.pdf].  ",
      "doi": "10.1145/997078.997089"
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. In Contemporary Educational Psychology, 25(1), pp. 54--67. Academic Press. DOI:http://dx.doi.org/10.1006/ceps.1999.1020. [https://mmrg.pbworks.com/f/Ryan,+Deci+00.pdf]. ",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, Heather Patrick, Edward L. Deci, and Geoffrey C. Williams. 2008. Facilitating health behaviour change and its maintenance: Interventions based on Self-Determination Theory. In The European Health Psychologist, 10(1), pp. 2--5. Ehps.net/ehp. [http://www.ehps.net/ehp/index.php/contents/article/vie w/ehp.v10.i1.p2/32].",
      "doi": ""
    },
    {
      "text": "Simon J. Sebire, Martyn Standage, and Maarten Vansteenkiste. 2008. Development and Validation of the Goal Content for Exercise Questionnaire. In Journal of Sport & Exercise Psychology, 30(4), pp. 353--377. Champaign, IL: Human Kinetics. [http://selfdeterminationtheory.org/SDT/documents/20 08_SebireStandageVansteenkiste_JSEP.pdf]. ",
      "doi": ""
    },
    {
      "text": "Rashmi Sinha. 2003. Persona Development for Information-rich Domains. In Proc. CHI'03. New York, NY: ACM Press. DOI:http://dx.doi.org/10.1145/765891.766017. [http://delivery.acm.org/10.1145/770000/766017/p830sinha.pdf].  ",
      "doi": "10.1145/765891.766017"
    },
    {
      "text": "Maarten Vansteenkiste, Willy Lens, and Edward L. Deci. 2006. Intrinsic Versus Extrinsic Goal Contents in Self-Determination Theory: Another Look at the Quality of Academic Motivation. In Educational Psychologist, 41(1), pp. 19--31. Lawrence Erlbaum Associates, Inc. DOI:http://dx.doi.org/10.1207/s15326985ep4101_4. [https://selfdeterminationtheory.org/SDT/documents/20 06_VansteenkisteLensDeci_InstrinsicvExtrinsicGoal_ EP.pdf]. ",
      "doi": ""
    },
    {
      "text": "Maarten Vansteenkiste, Eline Sierens, Bart Soenens, Koen Luyckx, and Willy Lens. 2009. Motivational profiles from a self-determination perspective: The quality of motivation matters. In Journal of Educational Psychology, 101(3), pp. 671--688. Washington, DC: American Psychological Association. DOI:http://dx.doi.org/10.1037/a0015083. [http://uahost.uantwerpen.be/linguapolis/call2010/JEP2 009%20-%20profiles.pdf]. ",
      "doi": ""
    },
    {
      "text": "Geoffrey C. Williams, Virginia M. Grow, Zachary R. Freedman, Richard M. Ryan, Edward L. Deci. 1996. Motivational Predictors of Weight Loss and WeightLoss Maintenance. In Journal of Personality and Social Psychology, 70(1), pp. 115--126. Washington, DC: American Psychological Association. [http://selfdeterminationtheory.org/SDT/documents/19 96_WilliamsGrowFreeRyanDeci.pdf]. ",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2006. Fifty-Ninth World Health Assembly. Who.int. [http://apps.who.int/gb/ebwha/pdf_files/WHA59REC3/WHA59_REC3-en.pdf].",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2016. Obesity and Overweight: Fact Sheet. Who.int. [http://www.who.int/mediacentre/factsheets/fs311/en/].",
      "doi": ""
    },
    {
      "text": "Robert K. Yin. 2013. Case Study Research: Design and Methods. London: SAGE Publications Ltd.",
      "doi": ""
    }
  ]
}