{
  "doi": "10.1145/3025453.3025723",
  "title": "Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1731-1742",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we present and evaluate Ambiotherm, a wearable accessory for Head Mounted Displays (HMD) that provides thermal and wind stimuli to simulate real-world environmental conditions, such as ambient temperatures and wind conditions, to enhance the sense of presence in Virtual Reality (VR). Ambiotherm consists of a Ambient Temperature Module that is attached to the user's neck, a Wind Simulation Module focused towards the user's face, and a Control Module utilizing Bluetooth communication. We demonstrate Ambiotherm with two VR environments, a hot desert, and a snowy mountain, to showcase the different types of simulated environmental conditions. We conduct several studies to 1) address design factors of the system and 2) evaluate Ambiotherm's effect on factors related to a user's sense of presence. Our findings show that the addition of wind and thermal stimuli significantly improves sensory and realism factors, contributing towards an enhanced sense of presence when compared to traditional VR experiences.",
  "authors": [
    {
      "name": "Nimesha Ranasinghe",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81448597526/rel-imgonly/nimesha.jpg",
      "acmid": "81448597526",
      "orcid": "missing"
    },
    {
      "name": "Pravar Jain",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/do/10.1145/contrib-99659080670/rel-imgonly/pravar.png",
      "acmid": "99659080670",
      "orcid": "missing"
    },
    {
      "name": "Shienny Karwita",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080734",
      "orcid": "missing"
    },
    {
      "name": "David Tolley",
      "institution": "National University of Singapore, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080804",
      "orcid": "missing"
    },
    {
      "name": "Ellen Yi-Luen Do",
      "institution": "National University of Singapore & Georgia Institute of Technology, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81100609985/rel-imgonly/ellendo025x.jpg",
      "acmid": "81100609985",
      "orcid": "0000-0002-9948-6375"
    }
  ],
  "references": [
    {
      "text": "Duzgun Agdas, Gregory D Webster, and Forrest J Masters. 2012. Wind speed perception and risk. PloS one 7, 11 (2012), e49944.",
      "doi": ""
    },
    {
      "text": "Khandaker Shabbir Ahmed. 2003. Comfort in urban spaces: defining the boundaries of outdoor thermal comfort for the tropical urban environments. Energy and Buildings 35, 1 (2003), 103--110. ",
      "doi": ""
    },
    {
      "text": "Henrique Andrade, Maria-João Alcoforado, and Sandra Oliveira. 2011. Perception of temperature and wind by users of public outdoor spaces: relationships with weather parameters and personal characteristics. International journal of biometeorology 55, 5 (2011), 665--680. ",
      "doi": ""
    },
    {
      "text": "Edward Arens, Hui Zhang, and Charlie Huizenga. 2006. Partial-and whole-body thermal sensation and comfort-Part I: Uniform environmental conditions. Journal of thermal Biology 31, 1 (2006), 53--59. ",
      "doi": ""
    },
    {
      "text": "Bettina A Babbitt and Charles O Nystrom. 1989. Questionnaire construction manual. Technical Report. DTIC Document.",
      "doi": ""
    },
    {
      "text": "Sylvain Cardin, Daniel Thalmann, and Frederic Vexo. 2007. Head mounted wind. In proceeding of the 20th annual conference on Computer Animation and Social Agents (CASA2007). 101--108.",
      "doi": ""
    },
    {
      "text": "Ian Darian-Smith and Kenneth O Johnson. 1977. Thermal sensibility and thermoreceptors. Journal of Investigative Dermatology 69, 1 (1977), 146--153. ",
      "doi": ""
    },
    {
      "text": "Leonidas Deligiannidis and Robert JK Jacob. 2006. The vr scooter: Wind and tactile feedback improve user performance. In 3D User Interfaces (3DUI'06). IEEE, 143--150.",
      "doi": ""
    },
    {
      "text": "Huong Q Dinh, Neff Walker, Larry F Hodges, Chang Song, and Akira Kobayashi. 1999. Evaluating the importance of multi-sensory input on memory and the sense of presence in virtual environments. In Virtual Reality, 1999. Proceedings., IEEE. IEEE, 222--228.",
      "doi": "10.5555/554230.835733"
    },
    {
      "text": "José Dionisio. 1997. Virtual hell: A trip through the fiames. IEEE Computer Graphics and Applications 17, 3 (1997), 11--14.  ",
      "doi": "10.1109/38.586012"
    },
    {
      "text": "Gary Fontaine. 1992. The experience of a sense of presence in intercultural and international encounters. Presence: Teleoperators & Virtual Environments 1, 4 (1992), 482--490.  ",
      "doi": "10.5555/2870800.2870806"
    },
    {
      "text": "Chauncey Frend and Michael Boyles. 2015. Programmable immersive peripheral environmental system (PIPES): a prototype control system for environmental feedback devices. In SPIE/IS&T Electronic Imaging. International Society for Optics and Photonics, 939209--939209.",
      "doi": ""
    },
    {
      "text": "D Gooch. 2009. An Investigation into Communicating Social Presence With Thermal Devices. Ph.D. Dissertation. MSc Dissertation.",
      "doi": ""
    },
    {
      "text": "Barry G Green and Barbara Gelhard. 1987. Perception of temperature on oral and facial skin. Somatosensory research 4, 3 (1987), 191--200. ",
      "doi": ""
    },
    {
      "text": "HT Hammel, DC Jackson, JAJ Stolwijk, JD Hardy, and SB Stromme. 1963. Temperature regulation by hypothalamic proportional control with an adjustable set point. Journal of Applied Physiology 18, 6 (1963), 1146--1154.",
      "doi": ""
    },
    {
      "text": "David Hannah, Martin Halvey, Graham Wilson, and Stephen A Brewster. 2011. Using multimodal interactions for 3D television and multimedia browsing. In Proceddings of the 9th international interactive conference on Interactive television. ACM, 181--184.",
      "doi": ""
    },
    {
      "text": "Richard M Held and Nathaniel I Durlach. 1992. Telepresence. Presence: Teleoperators & Virtual Environments 1, 1 (1992), 109--112.  ",
      "doi": "10.5555/2870721.2870730"
    },
    {
      "text": "Felix Hülsmann, Julia Fröhlich, Nikita Mattar, and Ipke Wachsmuth. 2014. Wind and warmth in virtual reality: implementation and evaluation. In Proceedings of the 2014 Virtual Reality International Conference. ACM, 24.  ",
      "doi": "10.1145/2617841.2620712"
    },
    {
      "text": "JCR Hunt, EC Poulton, and JC Mumford. 1976. The effects of wind on people; new criteria based on wind tunnel experiments. Building and Environment 11, 1 (1976), 15--28. ",
      "doi": ""
    },
    {
      "text": "Ken Iwasaki, Takashi Miyaki, and Jun Rekimoto. 2010. AffectPhone: A Handset Device to Present User's Emotional State with Warmth/Coolness. In B-Interface. 83--88.",
      "doi": ""
    },
    {
      "text": "Claus Jessen. 2012. Temperature regulation in humans and other mammals. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Lynette A Jones and Michal Berris. 2002. The psychophysics of temperature perception and thermal-interface design. In Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2002. HAPTICS 2002. Proceedings. 10th Symposium on. IEEE, 137--142.",
      "doi": ""
    },
    {
      "text": "Igor Knez and Sofia Thorsson. 2006. Influences of culture and environmental attitude on thermal, emotional and perceptual evaluations of a public square. International journal of biometeorology 50, 5 (2006), 258--268. ",
      "doi": ""
    },
    {
      "text": "Wonjun Lee and Youn-kyung Lim. 2010. Thermo-message: exploring the potential of heat as a modality of peripheral expression. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 4231--4236.",
      "doi": "10.1145/1753846.1754131"
    },
    {
      "text": "Michael W McGreevy. 1992. The presence of field geologists in Mars-like terrain. Presence: Teleoperators & Virtual Environments 1, 4 (1992), 375--403.  ",
      "doi": "10.5555/2870800.2870801"
    },
    {
      "text": "W. H. Melbourne. 1978. Criteria for environmental wind conditions. Journal of Wind Engineering and Industrial Aerodynamics 3, 2--3 (1978), 241--249.",
      "doi": ""
    },
    {
      "text": "Mitsuru Minakuchi and Satoshi Nakamura. 2007. Collaborative ambient systems by blow displays. In Proceedings of the 1st international conference on Tangible and embedded interaction. ACM, 105--108.",
      "doi": "10.1145/1226969.1226992"
    },
    {
      "text": "Taeyong Moon and Gerard J Kim. 2004. Design and evaluation of a wind display for virtual reality. In Proceedings of the ACM symposium on Virtual reality software and technology. ACM, 122--128.",
      "doi": "10.1145/1077534.1077558"
    },
    {
      "text": "Heilig Morton. 1962. Sensorama simulator. (Aug. 28 1962). US Patent 3,050,870.",
      "doi": ""
    },
    {
      "text": "Mayumi Nakamura, Tamae Yoda, Larry I Crawshaw, Momoko Kasuga, Yuki Uchida, Ken Tokizawa, Kei Nagashima, and Kazuyuki Kanosue. 2013. Relative importance of different surface regions for thermal comfort in humans. European journal of applied physiology 113, 1 (2013), 63--76. ",
      "doi": ""
    },
    {
      "text": "Mutsuhiro Nakashige, Minoru Kobayashi, Yuriko Suzuki, Hidekazu Tamaki, and Suguru Higashino. 2009. Hiya-Atsu media: augmenting digital media with temperature. In CHI'09 Extended Abstracts on Human Factors in Computing Systems. ACM, 3181--3186.  ",
      "doi": "10.1145/1520340.1520453"
    },
    {
      "text": "Joost P Pluijms, Rouwen Cañal-Bruland, Wouter M Bergmann Tiest, Fabian A Mulder, and Geert JP Savelsbergh. 2015. Expertise effects in cutaneous wind perception. Attention, Perception, & Psychophysics 77, 6 (2015), 2121--2133.",
      "doi": ""
    },
    {
      "text": "Katri Salminen, Veikko Surakka, Jukka Raisamo, Jani Lylykangas, Johannes Pystynen, Roope Raisamo, Kalle Mäkelä, and Teemu Ahmaniemi. 2011. Emotional responses to thermal stimuli. In Proceedings of the 13th international conference on multimodal interfaces. ACM, 193--196.  ",
      "doi": "10.1145/2070481.2070513"
    },
    {
      "text": "Thomas B Sheridan. 1992. Musings on telepresence and virtual presence. Presence: Teleoperators & Virtual Environments 1, 1 (1992), 120--126.",
      "doi": ""
    },
    {
      "text": "Sunghyun Song, Geeyoung Noh, Junwoo Yoo, Ian Oakley, Jundong Cho, and Andrea Bianchi. 2015. Hot & tight: exploring thermo and squeeze cues recognition on wrist wearables. In Proceedings of the 2015 ACM International Symposium on Wearable Computers. ACM, 39--42.  ",
      "doi": "10.1145/2802083.2802092"
    },
    {
      "text": "Theodore Stathopoulos, Hanqing Wu, and John Zacharias. 2004. Outdoor human comfort in an urban climate. Building and Environment 39, 3 (2004), 297--305. ",
      "doi": ""
    },
    {
      "text": "Jonathan Steuer. 1992. Defining virtual reality: Dimensions determining telepresence. Journal of communication 42, 4 (1992), 73--93. ",
      "doi": ""
    },
    {
      "text": "Jouke C Verlinden, Fabian A Mulder, Joris S Vergeest, Anna de Jonge, Darina Krutiy, Zsuzsa Nagy, Bob J Logeman, and Paul Schouten. 2013. Enhancement of presence in a virtual sailing environment through localized wind simulation. Procedia Engineering 60 (2013), 435--441.",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Martin Halvey, Stephen A Brewster, and Stephen A Hughes. 2011. Some like it hot: thermal feedback for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2555--2564.",
      "doi": "10.1145/1978942.1979316"
    },
    {
      "text": "Bob G Witmer and Michael J Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence: Teleoperators and virtual environments 7, 3 (1998), 225--240.  ",
      "doi": "10.1162/105474698565686"
    }
  ]
}