{
  "doi": "10.1145/3025453.3025500",
  "title": "Subtle and Personal Workspace Requirements for Visual Search Tasks on Public Displays",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6760-6764",
  "year": 2017,
  "badges": [],
  "abstract": "We explore how users approach and define personal space on large, public displays. Our results show that users of public displays use one of two strategies for visual search tasks: minimizers create a small window and work up close to the display, and maximizers expand content to its full resolution and work at a distance. We show that these interaction styles match predicted 'personal' and 'subtle' interaction zones, characterize typical width and height requirements for these interactions, and show that these requirements are independent of the on-screen content's dimensions. Finally, we suggest practical guidelines for defining workspaces during personal and subtle interaction on large, public displays.",
  "tags": [
    "personal workspace",
    "large public displays",
    "visual search"
  ],
  "authors": [
    {
      "name": "James R. Wallace",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81311486022/rel-imgonly/4016_portrait_-_oct_2013_-_small.jpg",
      "acmid": "81311486022",
      "orcid": "missing"
    },
    {
      "name": "Ariel Weingarten",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160271",
      "orcid": "missing"
    },
    {
      "name": "Edward Lank",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315489747",
      "orcid": "0000-0003-2760-2370"
    }
  ],
  "references": [
    {
      "text": "Trent Apted, Judy Kay, and Aaron Quigley. 2006. Tabletop Sharing of Digital Photographs for the Elderly. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 781--790.  ",
      "doi": "10.1145/1124772.1124887"
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In Proc. ITS 2010. ACM, NY, NY, USA, 121--130.  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Xiaojun Bi, Seok-Hyung Bae, and Ravin Balakrishnan. 2010. Effects of Interior Bezels of Tiled-monitor Large Displays on Visual Search, Tunnel Steering, and Target Selection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 65--74.  ",
      "doi": "10.1145/1753326.1753337"
    },
    {
      "text": "Xiaojun Bi and Ravin Balakrishnan. 2009. Comparing Usage of a Large High-resolution Display to Single or Dual Desktop Displays for Daily Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1005--1014.  ",
      "doi": "10.1145/1518701.1518855"
    },
    {
      "text": "Saul Greenberg, Sebastian Boring, Jo Vermeulen, and Jakub Dostal. 2014. Dark Patterns in Proxemic Interactions: A Critical Perspective. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA, 523--532.  ",
      "doi": "10.1145/2598510.2598541"
    },
    {
      "text": "Michael Haller, Jakob Leitner, Thomas Seifried, James R. Wallace, Stacey D. Scott, Christoph Richter, Peter Brandl, Adam Gokcezade, and Seth Hunter. 2010. The NiCE Discussion Room: Integrating Paper and Digital Media to Support Co-Located Group Meetings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 609--618.  ",
      "doi": "10.1145/1753326.1753418"
    },
    {
      "text": "Uta Hinrichs and Sheelagh Carpendale. 2011. Gestures in the Wild: Studying Multi-touch Gesture Sequences on Interactive Tabletop Exhibits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Daniel Klinkhammer, Markus Nitsche, Marcus Specht, and Harald Reiterer. 2011. Adaptive Personal Territories for Co-located Tabletop Interaction in a Museum Setting. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, NY, NY, USA, 107--110.  ",
      "doi": "10.1145/2076354.2076375"
    },
    {
      "text": "Russell Kruger, Sheelagh Carpendale, Stacey D. Scott, and Anthony Tang. 2005. Fluid Integration of Rotation and Translation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 601--610.  ",
      "doi": "10.1145/1054972.1055055"
    },
    {
      "text": "Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. In Proc CHI. ACM, NY, NY, USA, 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Kathy Ryall, Meredith Ringel Morris, Katherine Everitt, Clifton Forlines, and Chia Shen. 2006. Experiences with and observations of direct-touch tabletops. In Proceedings Tabletop 2006. IEEE, 8--pp.  ",
      "doi": "10.1109/TABLETOP.2006.12"
    },
    {
      "text": "Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, NY, NY, USA, 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Norbert A Streitz, Carsten Röcker, Thorsten Prante, Richard Stenzel, and Daniel van Alphen. 2003. Situated interaction with ambient information: Facilitating awareness and communication in ubiquitous work environments. In HCI International 2003.",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Mattias Finke, Michael Blackstock, Rock Leung, Meghan Deutscher, and Rodger Lea. 2008. Designing for Bystanders: Reflections on Building a Public Digital Forum. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 879--882.  ",
      "doi": "10.1145/1357054.1357193"
    },
    {
      "text": "Aaron Toney and Bruce H. Thomas. 2006. Applying Reach in Direct Manipulation User Interfaces. In Proceedings of the 18th Australia Conference on Computer-Human Interaction: Design: Activities, Artefacts and Environments (OZCHI '06). ACM, NY, NY, USA, 393--396.  ",
      "doi": "10.1145/1228175.1228255"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proc UIST '04. ACM, 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "James R. Wallace, Nancy Iskander, and Edward Lank. 2016. Creating Your Bubble: Personal Space On and Around Large Public Displays. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2087--2092.  ",
      "doi": "10.1145/2858036.2858118"
    },
    {
      "text": "James R. Wallace, Daniel Vogel, and Edward Lank. 2014. Effect of Bezel Presence and Width on Visual Search. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, NY, NY, USA, Article 118, 6 pages.  ",
      "doi": "10.1145/2611009.2611019"
    }
  ]
}