{
  "doi": "10.1145/3025453.3025597",
  "title": "Micro-Versioning Tool to Support Experimentation in Exploratory Programming",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6208-6219",
  "year": 2017,
  "badges": [],
  "abstract": "Experimentation plays an essential role in exploratory programming, and programmers apply version control operations when switching the part of the source code back to the past state during experimentation. However, these operations, which we refer to as micro-versioning, are not well supported in current programming environments. We first examined previous studies to clarify the requirements for a micro-versioning tool. We then developed a micro-versioning tool that displays visual cues representing possible micro-versioning operations in a textual code editor. Our tool includes a history model that generates meaningful candidates by combining a regional undo model and tree-structured undo model. The history model uses code executions as a delimiter to segment text edit operations into meaning groups. A user study involving programmers indicated that our tool satisfies the above-mentioned requirements and that it is useful for exploratory programming.",
  "tags": [
    "develpment environment",
    "micro-versioning",
    "version control system"
  ],
  "authors": [
    {
      "name": "Hiroaki Mikami",
      "institution": "University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160663",
      "orcid": "missing"
    },
    {
      "name": "Daisuke Sakamoto",
      "institution": "University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81329491765/rel-imgonly/____________.jpg",
      "acmid": "81329491765",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659190029",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kent Beck. 2003. Test-driven development: by example. Addison-Wesley Professional. ",
      "doi": "10.5555/579193"
    },
    {
      "text": "Joel Brandt, Philip J Guo, Joel Lewenstein, Scott R Klemmer, and Mira Dontcheva. 2009. Writing Code to Prototype, Ideate, and Discover. Software, IEEE 26, 5 (2009), 18--24.  ",
      "doi": "10.1109/MS.2009.147"
    },
    {
      "text": "John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Aaron G Cass and Chris ST Fernandes. 2007. Using task models for cascading selective undo. In Task Models and Diagrams for Users Interface Design. Springer, Hasselt, Belgium, 186--201. ",
      "doi": "10.5555/1756988.1757008"
    },
    {
      "text": "Eclipse 2016. Eclipse - The Eclipse Foundation open source community website. (31 July 2016). Retrieved July 31, 2016 from http://www.eclipse.org/.",
      "doi": ""
    },
    {
      "text": "EGit 2016. EGit. (31 July 2016). Retrieved July 31, 2016 from http://www.eclipse.org/egit/.",
      "doi": ""
    },
    {
      "text": "emacs 2016. Emacs. (31 July 2016). Retrieved July 31, 2016 from https://www.gnu.org/software/emacs/.",
      "doi": ""
    },
    {
      "text": "James Fogarty, Andrew J Ko, Htet Htet Aung, Elspeth Golden, Karen P Tang, and Scott E Hudson. 2005. Examining task engagement in sensor-based statistical models of human interruptibility. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI 2005). ACM, Portland, Oregon, USA, 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "git 2016. Git. (31 July 2016). Retrieved July 31, 2016 from https://git-scm.com/.",
      "doi": ""
    },
    {
      "text": "Max Goldman, Greg Little, and Robert C Miller. 2011. Collabode: collaborative coding in the browser. In Proceedings of the 4th international workshop on Cooperative and human aspects of software engineering (CHASE 2011). ACM, Waikiki, Honolulu, HI, USA, 65--68.  ",
      "doi": "10.1145/1984642.1984658"
    },
    {
      "text": "Google Bug Prediction 2016. Google Bug Prediction. (24 July 2016). Retrieved July 31, 2016 from http://google-engtools.blogspot.jp/2011/12/ bug-prediction-at-google.html.",
      "doi": ""
    },
    {
      "text": "gundo 2016. Gundo - Visualize your Vim Undo Tree. (29 March 2016). Retrieved July 31, 2016 from http://sjl.bitbucket.org/gundo.vim/.",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R Klemmer. 2008. Design as exploration: creating interface alternatives through parallel authoring and runtime tuning. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST 2008). ACM, Monterey, CA, USA, 91--100.  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Shinpei Hayashi, Daiki Hoshino, Jumpei Matsuda, Motoshi Saeki, Takayuki Omori, and Katsuhisa Maruyama. 2015. Historef: A tool for edit history refactoring. In 2015 IEEE 22nd International Conference on Software Analysis, Evolution, and Reengineering (SANER 2015). IEEE Computer Society, Montreal, QC, Canada, 469--473.",
      "doi": ""
    },
    {
      "text": "Yun Young Lee, Sam Harwell, Sarfraz Khurshid, and Darko Marinov. 2013. Temporal code completion and navigation. In 35th International Conference on Software Engineering (ICSE 2013). IEEE Computer Society, San Francisco, CA, USA, 1181--1184. ",
      "doi": "10.5555/2486788.2486956"
    },
    {
      "text": "Erica Mealy, David Carrington, Paul Strooper, and Peta Wyeth. 2007. Improving usability of software refactoring tools. In Australian Software Engineering Conference (ASWEC 2007). IEEE Computer Society, Melbourne, Australia, 307--318.  ",
      "doi": "10.1109/ASWEC.2007.24"
    },
    {
      "text": "Mathieu Nancel and Andy Cockburn. 2014. Causality: A conceptual model of interaction history. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, Toronto, ON, Canada, 1777--1786.  ",
      "doi": "10.1145/2556288.2556990"
    },
    {
      "text": "Atul Prakash and Michael J Knister. 1994. A framework for undoing actions in collaborative systems. ACM Transactions on Computer-Human Interaction (TOCHI) 1, 4 (1994), 295--330.  ",
      "doi": "10.1145/198425.198427"
    },
    {
      "text": "Bastian Steinert, Damien Cassou, and Robert Hirschfeld. 2012. Coexist: Overcoming aversion to change. ACM SIGPLAN Notices 48, 2 (2012), 107--118.  ",
      "doi": "10.1145/2480360.2384591"
    },
    {
      "text": "undotree 2016. EmacsWiki: Undo Tree. (31 July 2016). Retrieved July 31, 2016 from http://www.emacswiki.org/emacs/UndoTree.",
      "doi": ""
    },
    {
      "text": "Mohsen Vakilian, Nicholas Chen, Stas Negara, Balaji Ambresh Rajkumar, Brian P Bailey, and Ralph E Johnson. 2012. Use, disuse, and misuse of automated refactorings. In 34th International Conference on Software Engineering (ICSE 2012). IEEE Computer Society, Zurich, Switzerland, 233--243. ",
      "doi": "10.5555/2337223.2337251"
    },
    {
      "text": "YoungSeok Yoon and Brad A Myers. 2011. Capturing and analyzing low-level events from the code editor. In Proceedings of the 3rd ACM SIGPLAN workshop on Evaluation and usability of programming languages and tools (PLATEAU 2011). ACM, Portland, OR, USA, 25--30.  ",
      "doi": "10.1145/2089155.2089163"
    },
    {
      "text": "YoungSeok Yoon and Brad A Myers. 2012. An exploratory study of backtracking strategies used by developers. In Proceedings of the 5th International Workshop on Co-operative and Human Aspects of Software Engineering (CHASE 2012). IEEE Computer Society, Zurich, Switzerland, 138--144. ",
      "doi": "10.5555/2663638.2663669"
    },
    {
      "text": "Young Seok Yoon and Brad A Myers. 2014. A longitudinal study of programmers' backtracking. In IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC 2014). IEEE Computer Society, Melbourne, VIC, Australia, 101--108.",
      "doi": ""
    },
    {
      "text": "Young Seok Yoon and Brad A Myers. 2015. Supporting selective undo in a code editor. In the 37th International Conference on Software Engineering-Volume 1 (ICSE 2015). IEEE Computer Society, Florence, Italy, 223--233. ",
      "doi": "10.5555/2818754.2818784"
    }
  ]
}