{
  "doi": "10.1145/3025453.3025927",
  "title": "Supporting Expressive Procedural Art Creation through Direct Manipulation",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6330-6341",
  "year": 2017,
  "badges": [],
  "abstract": "Computation is a powerful artistic medium. Artists with experience in programming have demonstrated the unique creative opportunities of using code to make art. Currently, manual artists interested in using procedural techniques must undergo the difficult process of learning to program, and must adopt tools and practices far removed from those to which they are accustomed. We hypothesize that, through the right direct manipulation interface, we can enable accessible and expressive procedural art creation. To explore this, we developed Para, a digital illustration tool that supports the creation of declarative constraints in vector artwork. Para's constraints enable procedural relationships while facilitating live manual control and non-linear editing. Constraints can be combined with duplication behaviors and ordered collections of artwork to produce complex, dynamic compositions. We use the results of two open-ended studies with professional artists and designers to provide guidelines for accessible tools that integrate manual and procedural expression.",
  "authors": [
    {
      "name": "Jennifer Jacobs",
      "institution": "Massachusetts Institute of Technology & Adobe Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556713956",
      "orcid": "0000-0001-8666-8527"
    },
    {
      "name": "Sumit Gogia",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160830",
      "orcid": "missing"
    },
    {
      "name": "Radomír Mĕch",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100163820",
      "orcid": "missing"
    },
    {
      "name": "Joel R. Brandt",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81351596282/rel-imgonly/joel-brandt-adobe.jpg",
      "acmid": "81351596282",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cycling '74. 2016. Max. http://cycling74.com/products/max",
      "doi": ""
    },
    {
      "text": "Robert Aish. 2012. DesignScript: origins, explanation, illustration. In Computational Design Modelling. Springer, 1--8.",
      "doi": ""
    },
    {
      "text": "Arduino. 2017. Arduino Introduction. http://www.arduino.cc/en/Guide/Introduction",
      "doi": ""
    },
    {
      "text": "J. Ashkenas and DocumentCloud. 2010. Backbone.js. http://backbonejs.org",
      "doi": ""
    },
    {
      "text": "Alan F. Blackwell. 2014. Palimpsest: A layered language for exploratory image processing. Journal of Visual Languages Computing 25, 5 (2014), 545 -- 571.  ",
      "doi": "10.1016/j.jvlc.2014.07.001"
    },
    {
      "text": "Ravi Chugh, Jacob Albers, and Mitchell Spradlin. 2015. Program Synthesis for Direct Manipulation Interfaces. CoRR abs/1507.02988 (2015). http://arxiv.org/abs/1507.02988",
      "doi": ""
    },
    {
      "text": "Scott Davidson. 2007. Grasshopper. http://www.grasshopper3d.com.",
      "doi": ""
    },
    {
      "text": "Experimental Media Research Group. 2004. NodeBox. http://www.nodebox.net",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R. Klemmer. 2008. Design As Exploration: Creating Interface Alternatives Through Parallel Authoring and Runtime Tuning. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, NY, NY, USA, 91--100.  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "B. Harvey. 1991. Symbolic Programming vs. the A.P. Curriculum. The Computing Teacher 56 (February 1991), 27--29.",
      "doi": ""
    },
    {
      "text": "Brian Hempel and Ravi Chugh. 2016. Semi-Automated SVG Programming via Direct Manipulation. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 379--390.  ",
      "doi": "10.1145/2984511.2984575"
    },
    {
      "text": "Raphaël Hoarau and Stéphane Conversy. 2012. Augmenting the Scope of Interactions with Implicit and Explicit Graphical Structures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1937--1946.  ",
      "doi": "10.1145/2207676.2208337"
    },
    {
      "text": "MakerBot Industries. 2015. Thingiverse Customizer. http://www.thingiverse.com/apps/customizer",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs and Leah Buechley. 2013. Codeable Objects: Computational Design and Digital Fabrication for Novice Programmers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1589--1598.  ",
      "doi": "10.1145/2470654.2466211"
    },
    {
      "text": "Jennifer Jacobs, Mitchel Resnick, and Leah Buechley. 2014. Dresscode: supporting youth in computational design and making. In Constructionism. Vienna, Austria.",
      "doi": ""
    },
    {
      "text": "Alan C. Kay. 1990. User Interface: A Personal View. Addison-Wesley. 191--207 pages.",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2014. Kitty: Sketching Dynamic and Interactive Illustrations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 11.  ",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Nobuyuki Umetani, and George Fitzmaurice. 2016. SKUID: Sketching Dynamic Drawings Using the Principles of 2D Animation. In ACM SIGGRAPH 2016 Talks (SIGGRAPH '16). ACM, NY, NY, USA, Article 84, 1 pages.  ",
      "doi": "10.1145/2897839.2927410"
    },
    {
      "text": "Scott R. Klemmer, Björn Hartmann, and Leila Takayama. 2006. How Bodies Matter: Five Themes for Interaction Design. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, NY, NY, USA.  ",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Andrew J. Ko, Brad A. Myers, and Htet Htet Aung. 2004. Six Learning Barriers in End-User Programming Systems. In Proceedings of the 2004 IEEE Symposium on Visual Languages - Human Centric Computing (VLHCC '04). IEEE Computer Society, Washington, DC, USA, 199--206.  ",
      "doi": "10.1109/VLHCC.2004.47"
    },
    {
      "text": "J. Lehni and J. Puckey. 2011. Paper.js. http://paperjs.org/",
      "doi": ""
    },
    {
      "text": "Golan Levin. 2003. Essay for Creative Code. http:// www.flong.com/texts/essays/essay_creative_code",
      "doi": ""
    },
    {
      "text": "Z. Lieberman, T. Watson, and A. Castro. 2015. openFrameworks. http://openframeworks.cc/about",
      "doi": ""
    },
    {
      "text": "Maryam M. Maleki, Robert F. Woodbury, and Carman Neustaedter. 2014. Liveness, Localization and Lookahead: Interaction Elements for Parametric Design. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2598510.2598554"
    },
    {
      "text": "John H. Maloney and Randall B. Smith. 1995. Directness and liveness in the morphic user interface construction environment. In Proceedings of the 8th annual ACM symposium on User interface and software technology. ACM.  ",
      "doi": "10.1145/215585.215636"
    },
    {
      "text": "M. McCullough. 1996. Abstracting Craft: The Practiced Digital Hand. The MIT Press, Cambridge, Massachusetts. ",
      "doi": "10.5555/524384"
    },
    {
      "text": "W.J. Mitchell. 1990. The Logic of Architecture: Design, Computation, and Cognition. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/533511"
    },
    {
      "text": "Brad Myers, Scott E Hudson, and Randy Pausch. 2000. Past, present, and future of user interface software tools. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 1 (2000), 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Brad A Myers. 1990. Taxonomies of visual programming and program visualization. Journal of Visual Languages & Computing 1, 1 (1990), 97--123.  ",
      "doi": "10.1016/S1045-926X%2805%2980036-9"
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Stephen Oney, Brad Myers, and Joel Brandt. 2012. ConstraintJS: Programming Interactive Behaviors for the Web by Integrating Constraints and States. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2380116.2380146"
    },
    {
      "text": "Stephen Oney, Brad Myers, and Joel Brandt. 2014. InterState: A Language and Environment for Expressing Interface Behavior. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2642918.2647358"
    },
    {
      "text": "Fatih Kursat Ozenc, Miso Kim, John Zimmerman, Stephen Oney, and Brad Myers. 2010. How to Support Designers in Getting Hold of the Immaterial Material of Software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA.  ",
      "doi": "10.1145/1753326.1753707"
    },
    {
      "text": "S. Papert. 1980. Mindstorms: children, computers, and powerful ideas. Basic Books. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "C. Reas and B. Fry. 2004. Processing. http://processing.org",
      "doi": ""
    },
    {
      "text": "C. Reas and B. Fry. 2007. The Processing Handbook. MIT Press, Cambridge, Massachusetts, USA.",
      "doi": ""
    },
    {
      "text": "C. Reas and B. Fry. 2016. Processing Overview. http://processing.org/overview",
      "doi": ""
    },
    {
      "text": "C. Reas, C. McWilliams, and LUST. 2010. Form and Code. Princeton Architectural Press, NY, NY, USA.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun. ACM 52, 11 (Nov. 2009).  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mitchel Resnick and Brian Silverman. 2005. Some Reflections on Designing Construction Kits for Kids. In Proceedings of the 2005 Conference on Interaction Design and Children (IDC '05). ACM, NY, NY, USA.  ",
      "doi": "10.1145/1109540.1109556"
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. ACM Trans. Comput.-Hum. Interact. 22, 3 (June 2015).  ",
      "doi": "10.1145/2699742"
    },
    {
      "text": "J. Rosenkrantz and J. Louis-Rosenberg. 2015. Nervous System Tools. http://n-e-r-v-o-u-s.com/tools",
      "doi": ""
    },
    {
      "text": "Toby Schachman. 2012. Alternative Programming Interfaces for Alternative Programmers. In Proceedings of the ACM International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Onward! 2012). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2384592.2384594"
    },
    {
      "text": "Toby Schachman. 2015. Apparatus: a hybrid graphics editor / programming environment for creating interactive diagrams. In Strange Loop.",
      "doi": ""
    },
    {
      "text": "Donald Schön and John Bennett. 1996. Bringing Design to Software. ACM, NY, NY, USA, Chapter Reflective Conversation with Materials.  ",
      "doi": "10.1145/229868.230044"
    },
    {
      "text": "Ben Shneiderman. 1984. The Future of Interactive Systems and the Emergence of Direct Manipulation. In Proc. Of the NYU Symposium on User Interfaces on Human Factors and Interactive Computer Systems. Ablex Publishing Corp., Norwood, NJ, USA, 1--28. http://dl.acm.org/citation.cfm?id=2092.2093 ",
      "doi": "10.5555/2092.2093"
    },
    {
      "text": "Ivan E. Sutherland. 1998. Seminal Graphics. ACM, NY, NY, USA, Chapter Sketchpad: a Man-machine Graphical Communication System, 391--408.  ",
      "doi": "10.1145/280811.281031"
    },
    {
      "text": "Cesar Torres and Eric Paulos. 2015. MetaMorphe: Designing Expressive 3D Models for Digital Fabrication. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, NY, NY, USA.  ",
      "doi": "10.1145/2757226.2757235"
    },
    {
      "text": "S. Turkle and S. Papert. 1992. Epistemological Pluralism and the Revaluation of the Concrete. Journal of Mathematical Behavior 11, 1 (March 1992).",
      "doi": ""
    },
    {
      "text": "B. Victor. 2011. Dynamic Pictures. http: //worrydream.com/DynamicPicturesMotivation.",
      "doi": ""
    },
    {
      "text": "B. Victor. 2012. Learnable Programming: Designing a programming system for understanding programs. http://worrydream.com/LearnableProgramming.",
      "doi": ""
    },
    {
      "text": "B. Victor. 2013a. Drawing Dynamic Data Visualizations Addendum. http://worrydream.com/ DrawingDynamicVisualizationsTalkAddendum.",
      "doi": ""
    },
    {
      "text": "B. Victor. 2013b. Drawing Dynamic Data Visualizations (Talk). http://vimeo.com/66085662.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Bruno Araujo, Tovi Grossman, and Daniel Wigdor. 2016. Object-Oriented Drawing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4610--4621.  ",
      "doi": "10.1145/2858036.2858075"
    }
  ]
}