{
  "doi": "10.1145/3025453.3025955",
  "title": "The World-as-Support: Embodied Exploration, Understanding and Meaning-Making of the Augmented World",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5132-5144",
  "year": 2017,
  "badges": [],
  "abstract": "Current technical capabilities of mobile technologies are consolidating the interest in developing context-aware Augmented/Mixed Reality applications. Most of these applications are designed based on the Window-on-the-World (WoW) interaction paradigm. A significant decrease in cost of projection technology and advances in pico-sized projectors have spurred applications of Projective Augmented Reality. This research has focused mainly on technological development. However, there is still a need to fully understand its communicational and expressive potential. Hence, we define a conceptual paradigm that we call World-as-Support (WaS). We compare the WaS and WoW paradigms by contrasting their assumptions and cultural values, as well as through a study of an application aimed at supporting the collaborative improvisation of site-specific narratives by children. Our analysis of children's understanding of the physical and social environment and of their imaginative play allowed us to identify the affordances, strengths and weaknesses of these two paradigms.",
  "authors": [
    {
      "name": "Laura Malinverni",
      "institution": "Universitat Pompeu Fabra, Barcelona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502809097",
      "orcid": "missing"
    },
    {
      "name": "Julian Maya",
      "institution": "Universitat Pompeu Fabra, Barcelona, Spain",
      "img": "/do/10.1145/contrib-99659163327/rel-imgonly/10351079_10155153360310441_270937650966926441_n.jpg",
      "acmid": "99659163327",
      "orcid": "missing"
    },
    {
      "name": "Marie-Monique Schaper",
      "institution": "Universitat Pompeu Fabra, Barcelona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658676490",
      "orcid": "missing"
    },
    {
      "name": "Narcis Pares",
      "institution": "Universitat Pompeu Fabra, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81502774896/rel-imgonly/narcispares2013bwwbkgrnd.jpg",
      "acmid": "81502774896",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Edith K. Ackermann. 1999. Enactive representations in learning: pretense, models, and machines. In Learning Sites: Social and technological contexts for learning. Elsevier Ltd, 144--154.",
      "doi": ""
    },
    {
      "text": "Edith K. Ackermann. 2007. Experience of Artifacts?: People's Appropriations / Object's Affordances. In Ernst von Glasersfeld, Key works on radical constructivism, M. Larochelle (ed.).",
      "doi": ""
    },
    {
      "text": "Ronald Azuma, Yohan Baillot, Reinhold Behringer, Steven Feiner, Simon Julier, and Blair MacIntyre. 2001. Recent advances in augmented reality. IEEE computer graphics and applications 21, 6, 34--47.  ",
      "doi": "10.1109/38.963459"
    },
    {
      "text": "Sasha Barab and Kurt Squire. 2004. Design-based research: Putting a stake in the ground. The journal of the learning sciences 13, 1, 1--14.",
      "doi": ""
    },
    {
      "text": "Gotow Benjamin, Krzysztof Zienkiewicz, Jules White, and Douglas C. Schmidt. 2010. Addressing challenges with augmented reality applications on smartphones. International Conference on Mobile Wireless Middleware, Operating Systems, and Applications, 129--143.",
      "doi": ""
    },
    {
      "text": "Liam Betsworth, Huw Bowen, Simon Robinson, and Matt Jones. 2014. Performative technologies for heritage site regeneration. Personal Ubiquitous Comput. 18, 7, 1631--1650.  ",
      "doi": "10.1007/s00779-014-0766-3"
    },
    {
      "text": "Michel de Certeau. 1984. The Practice of Everyday Life. Berkeley: University of California Press.",
      "doi": ""
    },
    {
      "text": "Lisa G. Cowan and Kevin Li. 2011. ShadowPuppets: supporting collocated interaction with mobile projector phones using hand shadows. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2707--2716.  ",
      "doi": "10.1145/1978942.1979340"
    },
    {
      "text": "Lucrezia Crescenzi, Carey Jewitt, and Sara Price. 2014. The role of touch in preschool children's learning using iPad versus paper interaction. Australian Journal of Language & Literacy 37, 2, 86--95.",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Christian Dindler. 2014. Between Theory and Practice?: Bridging Concepts in HCI Research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1635--1644.  ",
      "doi": "10.1145/2556288.2557342"
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. The MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Anne Friedberg. The Virtual Window. From Alberti to Microsoft. Cambridge: The MIT Press.",
      "doi": ""
    },
    {
      "text": "Timo Göttel. 2011. Reviewing children's collaboration practices in storytelling environments. Proceedings of the 10th International Conference on Interaction Design and Children, ACM, New York, NY, USA, 153--156.  ",
      "doi": "10.1145/1999030.1999049"
    },
    {
      "text": "Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with Computers 23, 5, 385--392.  ",
      "doi": "10.1016/j.intcom.2011.03.005"
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a grip on tangible interaction: a framework on physical space and social interaction. Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM, 437--446.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Robert Jacob, Auderey Girouard, Leanne Hirshfield, et al. 2008. Reality-based interaction: a framework for post-WIMP interfaces. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 201--210.  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Carey Jewitt. 2013. Multimodal methods for researching digital technologies. In The SAGE handbook of digital technology research., Sara Price and Carey Jewitt (eds.). SAGE Publications Ltd, Los Angeles, CA, USA, 250--265.",
      "doi": ""
    },
    {
      "text": "Gunther Kress. 2010. Multimodality. A social semiotic approach to contemporary communication. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Jiri Kysela and Pavla Štorková. 2015. Using augmented reality as a medium for teaching history and tourism. Procedia-Social and Behavioral Sciences 174, 926--931.",
      "doi": ""
    },
    {
      "text": "Theo Van Leeuwen. 2004. Introducing Social Semiotics: An Introductory Textbook. London: Routledge.",
      "doi": ""
    },
    {
      "text": "Laura Lotti. 2013. Through the Augmenting-Glass: The Rhetorics of Augmented Reality Between Code and Interface. Itineration: Cross-Disciplinary Studies in Rhetoric, Media, and Culture.",
      "doi": ""
    },
    {
      "text": "Laura Malinverni, J. Mora-Guiard, and N. Pares. 2016. Towards methods for evaluating and communicating participatory design: A multimodal approach. International Journal of HumanComputer Studies.  ",
      "doi": "10.1016/j.ijhcs.2016.03.004"
    },
    {
      "text": "Laura Malinverni and Narcis Pares. 2014. Learning of Abstract Concepts through Embodied Interaction: a 10 years systematic review of Full Body Interaction Learning Environments. Journal of Educational Technology & Society.",
      "doi": ""
    },
    {
      "text": "Laura Malinverni and Narcis Pares. 2015. The Medium Matters: the Impact of Full-Body Interaction on the Socio-Affective Aspects of Collaboration. IDC '15 Proceedings of the 2015 conference on Interaction design and children, ACM.  ",
      "doi": "10.1145/2771839.2771849"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems 77, 12, 1321--1329.",
      "doi": ""
    },
    {
      "text": "David Molyneaux, David Shahram Izadi, Otmar Kim, et al. 2012. Interactive Environment-aware Handheld Projectors for Pervasive Computing Spaces. Proceedings of the 10th International Conference on Pervasive Comp, 197--215.  ",
      "doi": "10.1007/978-3-642-31205-2_13"
    },
    {
      "text": "Ann Morrison, Antti Oulasvirta, Peter Peltonen, et al. 2009. Like Bees Around the Hive?: A Comparative Study of a Mobile Augmented Reality Map.",
      "doi": ""
    },
    {
      "text": "Jens Müller, Roman Rädle, and Harald Reiterer. 2016. Virtual Objects as Spatial Cues in Collaborative Mixed Reality Environments: How They Shape Communication Behavior and User Task Load. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16)., ACM, New York, NY, USA, 1245--1249.  ",
      "doi": "10.1145/2858036"
    },
    {
      "text": "Anderson Nash, James Steele, Lise-Ann O'Neill, and Lesley A. Harden. 2016. Pokémon Go: mobile app user guides. British journal of sports medicine.",
      "doi": ""
    },
    {
      "text": "Mitchell. Nathan. 2012. Rethinking formalisms in formal education. Educational Psychologist 47, 2, 125--148.",
      "doi": ""
    },
    {
      "text": "Yannier Nesra, Kenneth R. Koedinger, and Scott E. Hudson. 2015. Learning from Mixed-Reality Games: Is Shaking a Tablet as Effective as Physical Observation? Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1045--1055.  ",
      "doi": "10.1145/2702123.2702397"
    },
    {
      "text": "Daniel Pacheco, Sytse Wierenga, Pedro Omedas, et al. 2015. A location-based Augmented Reality system for the spatial interaction with historical datasets. Digital Heritage 1, 393--396.",
      "doi": ""
    },
    {
      "text": "Jun Park. 2012. Evaluation of interaction tools for augmented reality based digital storytelling. International Conference on Hybrid Information Technology, Springer Berlin Heidelberg, 263--270.",
      "doi": ""
    },
    {
      "text": "Fabio Pittarello and Luca Bertani. 2012. CASTOR: learning to create context-sensitive and emotionally engaging narrations in-situ. Proceedings of the 11th International Conference on Interaction Design and Children (IDC '12), ACM, New York, NY, USA, 1--10.07098  ",
      "doi": "10.1145/2307096.2307098"
    },
    {
      "text": "Sara Price, Mona Sakr, and Carey Jewitt. 2015. Exploring Whole-Body Interaction and Design for Museums. Interacting with Computers. Interacting with Computers iwv032.",
      "doi": ""
    },
    {
      "text": "Sara Price and Carey Jewitt. 2013. A multimodal approach to examining \"embodiment\" in tangible learning environments. Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13)., 43--50.  ",
      "doi": "10.1145/2460625.2460632"
    },
    {
      "text": "Fernando Quesada López. 2009. La horma del zapato?: la(s) platea(s). In Querido Publico, Ignasi Duarte and Roger Bernat (eds.). Murcia?: Centro Párraga?: CENDEAC, 2009, 201--222.",
      "doi": ""
    },
    {
      "text": "Rouse Rebecca, Maria Engberg, Nassim JafariNaimi, and Jay David Bolter. 2015. MRX: an interdisciplinary framework for mixed reality experience design and criticism. Digital Creativity 26, 3, 175--181.",
      "doi": ""
    },
    {
      "text": "Gervais Renaud, Jérémy Frey, and Martin Hachet. 2015. Pointing in Spatial Augmented Reality from 2D Pointing Devices. Human-Computer Interaction, 381--389.",
      "doi": ""
    },
    {
      "text": "Gianni Rodari. 1979. La grammatica della fantasia. PBE.",
      "doi": ""
    },
    {
      "text": "Elisa Rubegni and Monica Landoni. 2014. Fiabot!: design and evaluation of a mobile storytelling application for schools. Proceedings of the 2014 conference on Interaction design and children (IDC '14)., ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/2593968.2593979"
    },
    {
      "text": "Phoebe Sengers, Kristen Boehner, Shay David, and J. J. Kaye. 2005. Reflective design. Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility. ACM, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Roy Shilkrot, Seth Hunter, and Patricia Maes. PoCoMo: projected collaboration using mobile devices. Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, 2011.  ",
      "doi": "10.1145/2037373.2037424"
    },
    {
      "text": "Masanori Sugimoto, Kosuke Miyahara, Hiroshi Inoue, and Yuji Tsunesada. 2005. Hotaru: intuitive manipulation techniques for projected displays of mobile devices. IFIP Conference on HumanComputer Interaction, Springer Berlin Heidelberg, 57--68.  ",
      "doi": "10.1007/11555261_8"
    },
    {
      "text": "Huang Tien-Chi, Chia-Chen Chen, and Yu-Wen Chou. 2016. Animating eco-education: To see, feel, and discover in an augmented reality-based experiential learning environment. Computers & Education 96, 72--82.  ",
      "doi": "10.1016/j.compedu.2016.02.008"
    },
    {
      "text": "Ina Wagner, Wolfgang Broll, Giulio Jacucci, et al. 2009. On the Role of Presence in Mixed Reality. Presence: Teleoperators and Virtual Environments 18, 4, 249--276.  ",
      "doi": "10.1162/pres.18.4.249"
    },
    {
      "text": "Karl Willis, Ivan Poupyrev, Scott Hudson, and Moshe Mahler. 2011. SideBySide: ad-hoc multiuser interaction with handheld projectors. Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11)., ACM, New York, NY, USA, 431--440.  ",
      "doi": "10.1145/2047196.2047254"
    },
    {
      "text": "Karl Willis, Ivan Poupyrev, and Takaaki Shiratori. 2011. Motionbeam: a metaphor for character interaction with handheld projectors. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), ACM, New York, NY, USA, 1031--1040.  ",
      "doi": "10.1145/1978942.1979096"
    },
    {
      "text": "Karl Willis, Takaaki Shiratori, and Moshe Mahler. 2013. HideOut: mobile projector interaction with tangible objects and surfaces. Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13), ACM, New York, NY, USA, 331--338.  ",
      "doi": "10.1145/2460625.2460682"
    },
    {
      "text": "Andrew Wilson. 2005. PlayAnywhere: a compact interactive tabletop projection-vision system. Proceedings of the 18th annual ACM symposium on User interface software and technology, ACM, 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Fabio Zünd, Mattia Ryffel, Stéphane Magnenat, et al. 2015. Augmented creativity: bridging the real and virtual worlds to enhance creative play. SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications, ACM, New York, NY, USA, 21. Fraunhofer PHAR.",
      "doi": ""
    }
  ]
}