{
  "doi": "10.1145/3025453.3025474",
  "title": "Experimental Evaluation of Sketching on Surfaces in VR",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5643-5654",
  "year": 2017,
  "badges": [],
  "abstract": "Sketching in immersive 3D virtual reality (VR) environments has great potential for a variety of interactive 3D design applications. Precisely sketching the intended strokes in mid-air, however, can be a challenge. In this paper, we present a set of controlled studies to analyze the factors affecting human ability to sketch freely in a 3D VR environment. In our first study, we directly compare traditional sketching on a physical surface to sketching in VR, with and without a physical surface to rest the stylus on. Our results indicate that the lack of a physical drawing surface is a major cause of inaccuracies in VR drawing, and that the effect is dependent on the orientation of the drawing surface. In a second experiment, we evaluate the extent to which visual guidance can compensate for the loss of sketching precision in VR. We found that while additional visual guidance improves positional accuracy, it can be detrimental to the aesthetic quality of strokes. We conclude by distilling our experimental findings into design guidelines for sketching tools in immersive 3D environments.",
  "tags": [
    "motor ability",
    "virtual reality",
    "3d drawing",
    "visual factors"
  ],
  "authors": [
    {
      "name": "Rahul Arora",
      "institution": "University of Toronto & Autodesk Research, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-99659159921/rel-imgonly/rahul_arora_aug_2021.jpg",
      "acmid": "99659159921",
      "orcid": "missing"
    },
    {
      "name": "Rubaiat Habib Kazi",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645237",
      "orcid": "missing"
    },
    {
      "name": "Fraser Anderson",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623584",
      "orcid": "0000-0003-3486-8943"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Karan Singh",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335497253",
      "orcid": "missing"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    }
  ],
  "references": [
    {
      "text": "W. Abend, E. Bizzi, and P. Morasso. 1982. Human Arm Trajectory Formation. Brain 105, 2: 331--348.",
      "doi": ""
    },
    {
      "text": "George J. Andersen, Myron L. Braunstein, and Asad Saidpour. 1998. The perception of depth and slant from texture in three-dimensional scenes. Perception 27, 9: 1087--1106.",
      "doi": ""
    },
    {
      "text": "Tom M. Apostol and Mamikon A. Mnatsakanian. 2007. Unwrapping curves from cylinders and cones. American Mathematical Monthly 114, 5: 388--416.",
      "doi": ""
    },
    {
      "text": "Seok-Hyung Bae, Ravin Balakrishnan, and Karan Singh. 2008. ILoveSketch: as-natural-as-possible sketching system for creating 3d curve models. Proceedings of the 21st annual ACM symposium on User interface software and technology, ACM, 151--160.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "A. Bair and D. House. 2007. Grid With a View: Optimal Texturing for Perception of Layered Surface Shape. IEEE Transactions on Visualization and Computer Graphics 13, 6: 1656--1663.  ",
      "doi": "10.1109/TVCG.2007.70559"
    },
    {
      "text": "Barbara Bradley. 2003. Drawing People. North Light Books, Cincinnati, Ohio.",
      "doi": ""
    },
    {
      "text": "Xiang Cao and Shumin Zhai. 2007. Modeling Human Performance of Pen Stroke Gestures. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07), ACM, 1495--1504.  ",
      "doi": "10.1145/1240624.1240850"
    },
    {
      "text": "Dale J. Cohen and Susan Bennett. 1997. Why can't most people draw what they see? Journal of Experimental Psychology: Human Perception and Performance 23, 3: 609.",
      "doi": ""
    },
    {
      "text": "Josh Constine. Oculus \"Quill\" Turns VR Painting Into Performance Art. TechCrunch. Retrieved September 20, 2016 from http://social.techcrunch.com/2016/01/26/oculus-quill/",
      "doi": ""
    },
    {
      "text": "Chris De Paoli and Karan Singh. 2015. SecondSkin: Sketch-based Construction of Layered 3D Models. ACM Trans. Graph. 34, 4: 126:1--126:10.  ",
      "doi": "10.1145/2766948"
    },
    {
      "text": "C. Donalek, S. G. Djorgovski, A. Cioc, et al. 2014. Immersive and collaborative data visualization using virtual reality platforms. 2014 IEEE International Conference on Big Data (Big Data), 609--614.",
      "doi": ""
    },
    {
      "text": "Gerald Farin and Nickolas Sapidis. 1989. Curvature and the Fairness of Curves and Surfaces. IEEE Comput. Graph. Appl. 9, 2: 52--57.  ",
      "doi": "10.1109/38.19051"
    },
    {
      "text": "George W. Fitzmaurice, Ravin Balakrishnan, Gordon Kurtenbach, and Bill Buxton. 1999. An Exploration into Supporting Artwork Orientation in the User Interface. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), ACM, 167--174.  ",
      "doi": "10.1145/302979.303033"
    },
    {
      "text": "Anthony G. Gallagher, E. Matt Ritter, Howard Champion, et al. 2005. Virtual Reality Simulation for the Operating Room: Proficiency-Based Training as a Paradigm Shift in Surgical Skills Training. Annals of Surgery 241, 2: 364--372.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, Ravin Balakrishnan, Gordon Kurtenbach, George Fitzmaurice, Azam Khan, and Bill Buxton. 2002. Creating Principal 3D Curves with Digital Tape Drawing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), ACM, 121--128.  ",
      "doi": "10.1145/503376.503398"
    },
    {
      "text": "Tovi Grossman, Ravin Balakrishnan, and Karan Singh. 2003. An Interface for Creating and Manipulating Curves Using a High Degree-of-freedom Curve Input Device. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), ACM, 185--192.  ",
      "doi": "10.1145/642611.642645"
    },
    {
      "text": "Rorik Henrikson, Bruno De Araujo, Fanny Chevalier, Karan Singh, and Ravin Balakrishnan. 2016. Multidevice storyboards for cinematic narratives in VR. In proceedings of UIST 2016.  ",
      "doi": "10.1145/2984511.2984539"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 1999. Teddy: A Sketching Interface for 3D Freeform Design. Proceedings of the 26th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '99), ACM Press/AddisonWesley Publishing Co., 409--416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Poika Isokoski. 2001. Model for Unistroke Writing Time. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01), ACM, 357--364.  ",
      "doi": "10.1145/365024.365299"
    },
    {
      "text": "J. H. Israel, E. Wiese, M. Mateescu, C. Zöllner, and R. Stark. 2009. Investigating three-dimensional sketching for early conceptual design - Results from expert discussions and user studies. Computers & Graphics 33, 4: 462--473.  ",
      "doi": "10.1016/j.cag.2009.05.005"
    },
    {
      "text": "B. Jackson and D. F. Keefe. 2016. Lift-Off: Using Reference Imagery and Freehand Sketching to Create 3D Models in VR. IEEE Transactions on Visualization and Computer Graphics 22, 4: 1442--1451.  ",
      "doi": "10.1109/TVCG.2016.2518099"
    },
    {
      "text": "Bret Jackson and Daniel F. Keefe. 2011. Sketching Over Props: Understanding and Interpreting 3D Sketch Input Relative to Rapid Prototype Props. IUI 2011 Sketch Recognition Workshop.",
      "doi": ""
    },
    {
      "text": "Peter Karasev, Ivan Kolesov, Karl Fritscher, Patricio Vela, Phillip Mitchell, and Allen Tannenbaum. 2013. Interactive medical image segmentation using PDE control of active contours. IEEE transactions on medical imaging 32, 11: 2127--2139.",
      "doi": ""
    },
    {
      "text": "Raghavendra S. Kattinakere, Tovi Grossman, and Sriram Subramanian. 2007. Modeling steering within above-the-surface interaction layers. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 317--326.  ",
      "doi": "10.1145/1240624.1240678"
    },
    {
      "text": "Daniel F. Keefe, Daniel Acevedo Feliz, Tomer Moscovich, David H. Laidlaw, and Joseph J. LaViola Jr. 2001. CavePainting: a fully immersive 3D artistic medium and interactive experience. Proceedings of the 2001 symposium on Interactive 3D graphics, ACM, 85--93.  ",
      "doi": "10.1145/364338.364370"
    },
    {
      "text": "Daniel F. Keefe and David H. Laidlaw. 2007. Poster: Analysis of Performance in Precise 3D Curve Input Tasks in Virtual Reality. IEEE Visualization (Best Posters Session).",
      "doi": ""
    },
    {
      "text": "Daniel Keefe, Robert Zeleznik, and David Laidlaw. 2007. Drawing on air: Input techniques for controlled 3D line illustration. IEEE Transactions on Visualization and Computer Graphics 13, 5: 1067--1081.  ",
      "doi": "10.1109/TVCG.2007.1060"
    },
    {
      "text": "T. Kuehnert, S. Rusdorf, and G. Brunnett. 2011. Virtual Prototyping of Shoes. IEEE Computer Graphics and Applications 31, 5: 30--42.  ",
      "doi": "10.1109/MCG.2010.81"
    },
    {
      "text": "Jung-hoon Kwon, Han-wool Choi, Jeong-in Lee, and Young-Ho Chai. 2005. Free-Hand Stroke Based NURBS Surface for Sketching and Deforming 3D Contents. In Advances in Multimedia Information Processing - PCM 2005, Yo-Sung Ho and Hyoung Joong Kim (eds.). Springer Berlin Heidelberg, 315--326.  ",
      "doi": "10.1007/11581772_28"
    },
    {
      "text": "James McCrae, Nobuyuki Umetani, and Karan Singh. 2014. FlatFitFab: Interactive Modeling with Planar Sections. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14), ACM, 13--22.  ",
      "doi": "10.1145/2642918.2647388"
    },
    {
      "text": "J. McCrae and K. Singh. 2008. Sketching piecewise clothoid curves. Proceedings of the Fifth Eurographics conference on Sketch-Based Interfaces and Modeling, Eurographics Association, 1--8.  ",
      "doi": "10.5555/2386301.2386303"
    },
    {
      "text": "Julius Panero and Martin Zelnik. 1979. Human Dimension and Interior Space: A Source Book of Design Reference Standards. Watson-Guptill, New York.",
      "doi": ""
    },
    {
      "text": "Emanuel Sachs, Andrew Roberts, and David Stoops. 1991. 3-Draw: A Tool for Designing 3D Shapes. IEEE Comput. Graph. Appl. 11, 6: 18--26.  ",
      "doi": "10.1109/38.103389"
    },
    {
      "text": "Johannes Schmid, Martin Sebastian Senn, Markus Gross, and Robert W. Sumner. 2011. OverCoat: An Implicit Canvas for 3D Painting. ACM SIGGRAPH 2011 Papers (SIGGRAPH '11), ACM, 28:1--28:10.  ",
      "doi": "10.1145/2010324.1964923"
    },
    {
      "text": "Ryan Schmidt, Azam Khan, Gord Kurtenbach, and Karan Singh. 2009. On Expert Performance in 3D Curve-drawing Tasks. Proceedings of the 6th Eurographics Symposium on Sketch-Based Interfaces and Modeling (SBIM '09), ACM, 133--140.  ",
      "doi": "10.1145/1572741.1572765"
    },
    {
      "text": "Shun'ichi Tano, Shinya Yamamoto, Junko Ichino, Tomonori Hashiyama, and Mitsuru Iwata. 2013. Truly Useful 3D Drawing System for Professional Designer by \"Life-Sized and Operable\" Feature and New Interaction. In Human-Computer Interaction - INTERACT 2013. Springer Berlin Heidelberg, 37--55.",
      "doi": ""
    },
    {
      "text": "Yannick Thiel, Karan Singh, and Ravin Balakrishnan. 2011. Elasticurves: exploiting stroke dynamics and inertia for the real-time neatening of sketched 2D curves. Proceedings of the 24th annual ACM symposium on User interface software and technology, ACM, 383--392.  ",
      "doi": "10.1145/2047196.2047246"
    },
    {
      "text": "P. Viviani and C. Ternuolo. 1982. Trajectory Determines Movement Dynamics. Neuroscience 7, 2: 431--7.",
      "doi": ""
    },
    {
      "text": "Gerold Wesche and Hans-Peter Seidel. 2001. FreeDrawer: a free-form sketching system on the responsive workbench. ACM Press, 167.  ",
      "doi": "10.1145/505008.505041"
    },
    {
      "text": "Eva Wiese, Johann Habakuk Israel, Achim Meyer, and Sara Bongartz. 2010. Investigating the learnability of immersive free-hand sketching. Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium, Eurographics Association, 135--142. ",
      "doi": "10.5555/1923363.1923387"
    },
    {
      "text": "Baoxuan Xu, William Chang, Alla Sheffer, Adrien Bousseau, James McCrae, and Karan Singh. 2014. True2Form: 3D Curve Networks from 2D Sketches via Selective Regularization. ACM Trans. Graph. 33, 4: 131:1--131:13.  ",
      "doi": "10.1145/2601097.2601128"
    },
    {
      "text": "Youyi Zheng, Han Liu, Julie Dorsey, and Niloy J. Mitra. 2016. SmartCanvas: Context-inferred Interpretation of Sketches for Preparatory Design Studies. Computer Graphics Forum, Wiley Online Library, 37--48.  ",
      "doi": "10.5555/3028584.3028590"
    },
    {
      "text": "Tilt Brush by Google. Retrieved January 8, 2017 from https://www.tiltbrush.com/",
      "doi": ""
    },
    {
      "text": "PaintLab VR - Paint and Sculpt in Virtual Reality. PaintLab VR. Retrieved September 20, 2016 from http://paintlabvr.com",
      "doi": ""
    },
    {
      "text": "DesignSpace. Retrieved September 20, 2016 from http://www.designspacevr.com/",
      "doi": ""
    },
    {
      "text": "Tvori - Anyone Can Tell a Story. Retrieved September 20, 2016 from http://tvori.co",
      "doi": ""
    },
    {
      "text": "Virtual Art Sessions. Retrieved September 20, 2016 from https://virtualart.chromeexperiments.com/",
      "doi": ""
    }
  ]
}