{
  "doi": "10.1145/3025453.3025750",
  "title": "Self-tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "629-641",
  "year": 2017,
  "badges": [],
  "abstract": "Previous research suggests an important role for self-tracking in promoting mental wellness. Recent studies with college student populations have examined the feasibility of collecting everyday mood, activity, and social data. However, these studies do not account for students' experiences and challenges adopting self-tracking technologies to support mental wellness goals. We present two studies conducted to better understand self-tracking for stress management and mental wellness in student populations. First, focus groups and card sorting activities with 14 student health professionals reveal expert perspectives on the usefulness of tracking for three scenarios. Second, an online survey of 297 students examines personal experiences with self-tracking and attitudes toward sharing self-tracked data with others. We draw on findings from these studies to characterize students' motivations, challenges and preferences in collecting and viewing self-tracked data related to mental wellness, and we compare findings between students with diagnosed mental illnesses and those without. We conclude with a discussion of challenges and opportunities in leveraging self-tracking for mental wellness, highlighting several design considerations.",
  "tags": [
    "mental health",
    "quantified self",
    "health communication",
    "patient-clinician communication",
    "personal informatics",
    "self-tracking",
    "mental wellness",
    "self-monitoring"
  ],
  "authors": [
    {
      "name": "Christina Kelley",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162771",
      "orcid": "missing"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Lauren Wilcox",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81416600696/rel-imgonly/81416600696.jpeg",
      "acmid": "81416600696",
      "orcid": "0000-0001-6598-1733"
    }
  ],
  "references": [
    {
      "text": "American College Health Association (ACH). 2016. National College Health Assessment II: Reference Group/Executive Summary Fall 2015. Hanover, MD. Retrieved from http://www.acha-ncha.org/docs/NCHA-II%20FALL%202015%20REFERENCE%20GROUP%20EXECUTIVE%20SUMMARY.pdf",
      "doi": ""
    },
    {
      "text": "Steve Whittaker Artie Konrad, Vitoria Belotti, Nicole Crenshaw, Simon Tucker, Les Nelson, Honglu Du, Peter Pirolli. 2015. Finding the adaptive sweet spot: Balancing compliance and achievement in automated stress reduction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15:), 3829--3838.  ",
      "doi": "10.1145/2702123.2702512"
    },
    {
      "text": "Jennifer S. Beaudin, Stephen S. Intille, Margaret E. Morris. 2006. To track or not to track: User reactions to concepts in longitudinal health monitoring. Journal of Medical Internet Research 8, 4: 29.",
      "doi": ""
    },
    {
      "text": "Lora E. Burke, Valerie Swigart, Melanie Turk Warziski, Nicole Derro, Linda J. Ewing. 2009. Experiences of self-monitoring: Successes and struggles during treatment for weight loss. Qualitative Health Research 19, 6: 815--828.",
      "doi": ""
    },
    {
      "text": "Linda G. Castillo and Seth J. Schwartz. 2013. Introduction to the special issue on college student mental health. Journal of Clinical Psychology 69(4): 291--297.",
      "doi": ""
    },
    {
      "text": "Center for Collegiate Mental Health. 2015. Center for Collegiate Mental Health 2014 Annual Report. 1--44. Retrieved from http://ccmh.psu.edu/wp-content/uploads/sites/3058/2015/02/2014-CCMH-Annual-Report.pdf",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, Julie A. Kientz. 2015. SleepTight: Low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 121--132.  ",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '14), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sheldon Cohen, Tom Kamarck, Robin Mermelstein. 1983. A global measure of perceived stress. Journal of Health and Social Behavior 24, 4: 385--396.",
      "doi": ""
    },
    {
      "text": "Alison Dillon, Mark Kelly, Ian H Robertson, Deirdre A Robertson. 2016. Smartphone applications utilizing biofeedback can aid stress reduction. Frontiers in Psychology 7, June: 832.",
      "doi": ""
    },
    {
      "text": "Gavin Doherty, David Coyle, Mark Matthews. 2010. Design and evaluation guidelines for mental health technologies. Interacting with Computers 22, 4: 243--252.  ",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Kevin Eagan, Ellen Bara Stolzenberg, Joseph J Ramirez, Melissa C Aragon, Maria Ramirez Suchard, Sylvia Hurtado. 2016. The American Freshman: National Norms Fall 2014. Retrieved from http://heri.ucla.edu/monographs/TheAmericanFreshman2014.pdf",
      "doi": ""
    },
    {
      "text": "Daniel Eisenberg, Justin Hunt, Nicole Speer. 2012. Help seeking for mental health on college campuses: review of evidence and next steps for research and practice. Harvard Review of Psychiatry 20, 4: 222--232.",
      "doi": ""
    },
    {
      "text": "Daniel Epstein, An Ping, James Fogarty, Sean A Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, Sean A. Munson. 20 From \"nobody cares\" to \"way to go!\" In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1622--1636.  ",
      "doi": "10.1145/2675133.2675135"
    },
    {
      "text": "Emre Ertin, Nathan Stohs, Santosh Kumar, Andrew Raij, Mustafa al'Absi, Siddharth Shah. 2011. AutoSense: unobtrusively wearable sensor suite for inferring the onset, causality, and consequences of stress in the field. In Proceedings of the ACM Conference on Embedded Networked Sensor Systems (SenSys '11), 274--287.  ",
      "doi": "10.1145/2070942.2070970"
    },
    {
      "text": "Jinjuan Feng, Jonathan Lazar, Libby Kumin. 2010. Computer usage by children with down syndrome: challenges and future research. ACM Transactions on Accessible Computing 2, 3: 17--61.  ",
      "doi": "10.1145/1714458.1714460"
    },
    {
      "text": "Andrea Gaggioli and Giuseppe Riva. 2013. From mobile mental health to mobile wellbeing: opportunities and challenges. Studies in Health Technology and Informatics 184, February: 141--147.",
      "doi": ""
    },
    {
      "text": "Ginger.io. Retrieved from https://ginger.io/",
      "doi": ""
    },
    {
      "text": "Christine R. Harris and Ryan S. Darby. 2009. Shame in physician-patient interactions: patient perspectives. Basic and Applied Social Psychology 31, 4: 325--334.",
      "doi": ""
    },
    {
      "text": "Javier Hernandez, Pablo Paredes, Asta Roseway, Mary Czerwinski. 2014. Under pressure: sensing stress of computer users. In Proceedings of the ACM conference on Human Factors in Computing Systems (CHI '14), 51--60.  ",
      "doi": "10.1145/2556288.2557165"
    },
    {
      "text": "Maia L. Jacobs, James Clawson, Elizabeth D. Mynatt. 2015. Comparing health information sharing preferences of cancer patients, doctors, and navigators. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 808--818.  ",
      "doi": "10.1145/2675133.2675252"
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R Mishra, James Fogarty, Sean A Munson, Julie A Kientz. 2016. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association 23, 3: 440--448.",
      "doi": ""
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, Kwonhyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging framing effects to enhance personal productivity. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '16), 272--283.  ",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Matthew Lee and Anind Dey. 2014. Real-time feedback for improving medication taking. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '14), 2259--2268.  ",
      "doi": "10.1145/2556288.2557210"
    },
    {
      "text": "Ian Li, Anind Dey, Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '10), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Susan Michie, Charles Abraham, Craig Whittington, John McAteer, Sunjai Gupta. 2009. Effective techniques in healthy eating and physical activity interventions: A meta-regression. Health Psychology 28, 6: 690--701.",
      "doi": ""
    },
    {
      "text": "Neema Moraveji and Charlton Soesanto. 2012. Towards stress-less user interfaces: 10 design heuristics based on the psychophysiology of stress. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '12), 1643--1648.  ",
      "doi": "10.1145/2212776.2223686"
    },
    {
      "text": "Sean A. Munson, Hasan Cavusoglu, Larry Frisch, and Sidney Fels. 2013. Sociotechnical challenges and progress in using social media for health. Journal of Medical Internet Research 15, 10: 1--14.",
      "doi": ""
    },
    {
      "text": "National Alliance on Mental Illness: Teens & Young Adults. Retrieved from http://www.nami.org/Find-Support/Teens-and-Young-Adults",
      "doi": ""
    },
    {
      "text": "National Sleep Foundation. Sleep Hygiene. Retrieved from https://sleepfoundation.org/ask-the-expert/sleep-hygiene",
      "doi": ""
    },
    {
      "text": "Carolyn Pang, Carmen Neustaedter, Bernhard Riecke, Erick Oduor, and Serena Hillman. 2013. Technology preferences and routines for sharing health information during the treatment of a chronic illness. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '13), 1759--1768.  ",
      "doi": "10.1145/2470654.2466232"
    },
    {
      "text": "Pablo Paredes, Ran Gilad-Bachrach, Mary Czerwinski, Asta Roseway, Kael Rowan, Javier Hernandez. 2014. PopTherapy: Coping with stress through pop-culture. In Proceedings of the Int'l Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '14), 109--117.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.255070"
    },
    {
      "text": "Stephanie Pinder-Amaker, Catherine Bell. 2012. A bioecological systems approach for navigating the college mental health crisis. Harvard Review of Psychiatry 20, 4:174--188.",
      "doi": ""
    },
    {
      "text": "Wanda Pratt, Kenton Unruh, Andrea Civan, and Meredith Skeels. 2006. Personal health information management. Communications of the ACM 49, 1: 51--55.  ",
      "doi": "10.1145/1107458.1107490"
    },
    {
      "text": "Qualtrics. Retrieved from https://www.qualtrics.com/",
      "doi": ""
    },
    {
      "text": "Stefan Rennick-Egglestone, Sarah Knowles, Gill Toms, Penny Bee, Karina Lovell, Peter Bower. 2016. Health technologies \"in the wild\": experiences of engagement with computerised CBT. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '16), 2124--2135.  ",
      "doi": "10.1145/2858036.2858128"
    },
    {
      "text": "Jonathan W Roberti, Lisa N Harrington, Eric A Storch. 2006. Further psychometric support for the 10-item version of the perceived stress scale. Journal of College Counseling 9: 135--147.",
      "doi": ""
    },
    {
      "text": "Michael Seyffert, Pooja Lagisetty, Jessica Landgraf, Vineet Chopra, Paul N. Pfeiffer, Marisa L. Conte, Mary A. M. Rogers. 2016. Internet-delivered cognitive behavioral therapy to treat insomnia: A systematic review and meta-analysis. PLoS ONE 11, 2: 1--21.",
      "doi": ""
    },
    {
      "text": "Timothy B. Smith, Brenda Dean, Suzanne Floyd, Christopher Silva, Momoko Yamashita, Jared Durtschi, Richard A. Heaps. 2007. Pressing issues in college counseling: A survey of american college counseling association members. Journal of College Counseling 10, 1: 64--78.",
      "doi": ""
    },
    {
      "text": "Spire.io. Retrieved from https://spire.io/",
      "doi": ""
    },
    {
      "text": "Mark Joseph Stern. 2013. Weight, watched. Slate. Retrieved from http://www.slate.com/articles/technology/future_tense/2013/11/smartphone_diet_apps_are_they_helping_us_lose_weight.html",
      "doi": ""
    },
    {
      "text": "StudentLife Study. Retrieved from http://studentlife.cs.dartmouth.edu/",
      "doi": ""
    },
    {
      "text": "Sebastian Trautmann and Hans-ulrich Wittchen. 2016. Do our societies react appropriately to the burden of mental disorders' EMBO Reports 17, 9: 1245--1249.",
      "doi": ""
    },
    {
      "text": "Lisa M Vizer. 2009. Detecting cognitive and physical stress through typing behavior. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '09), 3113--3116.  ",
      "doi": "10.1145/1520340.1520440"
    },
    {
      "text": "Katy Waldman. 2013. The year we quantified everything and learned...anything? Slate. Retrieved from http://www.slate.com/blogs/xx_factor/2013/12/27/quantified_self_critique_personal_data_apps_for_calories_exercise_sleep.html",
      "doi": ""
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T. Campbell. 2014. StudentLife: assessing mental health, academic performance and behavioral trends of college students using smartphones. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 3--14.  ",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "Peter West, Richard Giordano, Max Van Kleek, Nigel Shadbolt. 2016. The quantified patient in the doctor's office: challenges & oppportunities. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '16), 3066--3078.  ",
      "doi": "10.1145/2858036.2858445"
    },
    {
      "text": "Rayoung Yang, Eunice Shin, Mark W. Newman, Mark S. Ackerman. 2015. When fitness trackers don't \"fit\": end-user difficulties in the assessment of personal tracking device accuracy. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 623--634.  ",
      "doi": "10.1145/2750858.2804269"
    }
  ]
}