{
  "doi": "10.1145/3025453.3026017",
  "title": "Getting Something for Nothing?: A User-Centric Perspective on Loyalty Card Schemes",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4443-4453",
  "year": 2017,
  "badges": [],
  "abstract": "Loyalty cards are a form of tracking and recording technology (TRT) that enables retailers to collect data about their customers' demographic and purchase behaviours. As recompense for sharing their data consumers receive 'loyalty points' which they can redeem for exclusive discounts and rewards. The design of loyalty schemes, and TRTs more generally, plays a key role in defining the economic terms of that exchange, and ultimately the economic value of personal data. In this paper we present findings from an interview study with 12 loyalty cardholders in the UK explicating the ways in which they create (and lose) value through the everyday practice of shopping with loyalty cards and the orientations associated with them. Based on our findings we suggest cardholders are less concerned with the protection of their privacy than with leveraging its value, only some of which was economic. We provide design guidelines for TRTs that may enable consumers to derive greater value from the data they produce and share.",
  "tags": [
    "digital economy",
    "loyalty cards",
    "interview study",
    "personal data",
    "retail shopping",
    "tracking and recording technologies"
  ],
  "authors": [
    {
      "name": "Annika Hupfeld",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502803114",
      "orcid": "missing"
    },
    {
      "name": "Chris Speed",
      "institution": "Edinburgh University, Edinburgh, Scotland, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479661155",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "George Arnett. 2013. Are Loyalty Cards Really Worth it? The Guardian (2013). http://www.theguardian.com/news/datablog/2013/oct/3 1/are-loyalty-cards-really-worth-it",
      "doi": ""
    },
    {
      "text": "Adam Arvidsson. 2006. Brands: Meaning and Value in Media Culture. Routledge, London. ",
      "doi": "10.5555/1077092"
    },
    {
      "text": "Barry J. Babbin, William R. Darden, Mitch Griffin. 1994. Work and/or Fun: Measuring Hedonic and Utilitarian Shopping Value. Journal of Consumer Research 20(4): 644--56.",
      "doi": ""
    },
    {
      "text": "Richard Beckwith. 2003. Designing for Ubiquity: The Perception of Privacy. IEEE Pervasive Computing, 2, 2, (2003), 40--46.  ",
      "doi": "10.1109/MPRV.2003.1203752"
    },
    {
      "text": "Nicole Blackmore. 2015. The £6bn catch in loyalty points: the schemes sitting on your rewards. The Telegraph (2015). http://www.telegraph.co.uk/finance/personalfinance/m oney-saving-tips/11912823/Shoppers-waste-6bn-ofloyalty-reward-points.html",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Richard Mortier. 2015. HumanData Interaction: Historical Lessons from Social Studies and CSCW. In Proceedings ECSCW. Springer, Heidelberg, 3--21.",
      "doi": ""
    },
    {
      "text": "Nathalie Demoulin, Pietro Zidda. 2006. On the Differences between Loyalty Card Adopters and NonAdopters: The Case of a New Loyalty Program in the Grocery Retail Market. Proc 35th European Marketing Academy Conf (EMAC).",
      "doi": ""
    },
    {
      "text": "Nathalie Demoulin, Pietro Zidda. 2008. On the impact of store loyalty cards on store loyalty: Does the Customers' Satisfaction with the Reward Scheme Matter? Journal of Retailing and Consumer Services, 15, 5 (2008), 386--398.",
      "doi": ""
    },
    {
      "text": "Alan S. Dick, Kunal Basu. 1994. Consumer loyalty: toward an integrated conceptual framework. Journal of the Academy of Marketing Science, 22, 2 (1994), 99-- 113.",
      "doi": ""
    },
    {
      "text": "Matilda Dorotic, Tammo Bijmolt, Peter Verhoef. 2012. Loyalty Programmes: Current Knowledge and Research Directions. International Journal of Management Reviews, 14 (2012). Blackwell, Oxford, 217--237.",
      "doi": ""
    },
    {
      "text": "Graham Dowling, Mark Uncles. 1997. Do Customer Loyalty Programs Really Work? Sloan Management Review 38, 4 (1997), 71--82.",
      "doi": ""
    },
    {
      "text": "Donna Ferguson. 2013. How Supermarkets Get Your Data and What they Do with it. Guardian (2013). https://www.theguardian.com/money/2013/jun/08/supe rmarkets-get-your-data",
      "doi": ""
    },
    {
      "text": "David J. Gilmore, Gilbert Cockton, Elizabeth Churchill, Sari Kujala, Austin Henderson, and Monty Hammontree. 2008. Values, value and worth: their relationship to HCI?. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 3933--3936.  ",
      "doi": "10.1145/1358628.1358960"
    },
    {
      "text": "Timothy R. Graeff, Susan Harmon. 2002. Collecting and Using Personal Data: Consumers? Awareness and Concerns. Journal of Consumer Marketing, 19, 4 (2002). Springer, 302--318.",
      "doi": ""
    },
    {
      "text": "Hamed Haddadi, Heidi Howard, Amir Chaudhry, Jon Crowcroft, Anil Madhavapeddy, Richard Mortier, Derek McAuley. 2015. Personal Data: Thinking Inside the Box. Cornell University Library. http://arxiv.org/abs/1501.04737",
      "doi": ""
    },
    {
      "text": "Carlos Jensen, Colin Potts, Christian Jensen. 2005. Privacy Practices of Internet Users: Self-reports Versus Observed Behavior. International Journal of HumanComputer Studies, 63, 1--2 (2005), 203--227.  ",
      "doi": "10.1016/j.ijhcs.2005.04.019"
    },
    {
      "text": "Carlos Jensen, Colin Potts, Christian Jensen. 2005. Privacy Practices of Internet Users: Self-reports Versus Observed Behavior. International Journal of HumanComputer Studies, 63, 1--2 (2005), 203--227.  ",
      "doi": "10.1016/j.ijhcs.2005.04.019"
    },
    {
      "text": "Eminegül Karababa, Dannie Kjeldgaard. 2013. Value marketing: Toward sociocultural perspectives. Marketing Theory, 14, 1, (2013), 119--127.",
      "doi": ""
    },
    {
      "text": "V. Kumar, Denish Shah. 2004. Building and Sustaining Profitable Customer Loyalty for the 21st Century. Journal of Retailing, 80, 4 (2004), 317--330.",
      "doi": ""
    },
    {
      "text": "Jorna Leenheer, Harald van Heerde, Tammo Bijmolt, Ale Smidts. 2007. Do Loyalty Programs Really Enhance Behavioural Loyalty? An Empirical Analysis Accounting for Self-Selecting Members. International Journal of Research in Marketing, 24, 1 (2007), 31--47.",
      "doi": ""
    },
    {
      "text": "Ann Light, Peter J. Wild, Andy Dearden, and Michael J. Muller. 2005. Quality, value(s) and choice: exploring deeper outcomes for HCI products. In CHI '05 Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 2124--2125.  ",
      "doi": "10.1145/1056808.1057119"
    },
    {
      "text": "Ewa Luger, Tom Rodden. 2013. An Informed View on Consent for Ubicomp. In proceedings UbiComp '13. ACM, New York, 529--538.  ",
      "doi": "10.1145/2493432.2493446"
    },
    {
      "text": "Robert F. Lusch, Stephen L. Vargo. 2006. Servicedominant logic: reactions, reflections and refinements. Marketing Theory, 6, 3, (2006), 281--288.",
      "doi": ""
    },
    {
      "text": "Anne Mägi. 2003. Share of Wallet in Retailing: The Effects of Customer Satisfaction, Loyalty Cards and Shopper Characteristics. Journal of Retailing, 79, 2 (2003), 97--106.",
      "doi": ""
    },
    {
      "text": "Richard Mortier, Hamed Haddadi, Tristan Henderson, Derek McAuley, Jon Crowcroft. 2014. Human-Data Interaction: The Human Face of the Data-Driven Society. Social Science Research Network.",
      "doi": ""
    },
    {
      "text": "Irene Ng. 2012. Value & Worth: Creating New Markets in the Digital Economy. Innovorsa Press.",
      "doi": ""
    },
    {
      "text": "Irene Ng, Laura A. Smith. 2012. An Integrative Framework of Value, Review of Marketing Research, Special Issue Toward a Better Understanding of the Role of Value in Market and Marketing, 9, (2012), 207--43.",
      "doi": ""
    },
    {
      "text": "David Nguyen, Gillian Hayes. 2010. Information Privacy in Institutional and End-User Tracking and Recording Technologies. Personal and Ubiquitous Computing, 14, 1 (2010). Springer, Heidelberg, 53--72.  ",
      "doi": "10.1007/s00779-009-0229-4"
    },
    {
      "text": "David Nguyen, Alfred Kobsa, Gillian Hayes. 2008. An Empirical Investigation of Concerns of Everyday Tracking and Recording Technologies. In UbiComp 2008. ACM, New York, 182--191.  ",
      "doi": "10.1145/1409635.1409661"
    },
    {
      "text": "Louise O'Brien, Charles Jones. 1995. Do rewards really create loyalty? Harvard Business Review. http://hbr.org/1995/05/do-rewards-really-createloyalty.",
      "doi": ""
    },
    {
      "text": "Gabor Pauler, Alan Dick. 2005. Maximizing profit of a food retailing chain by targeting and promoting valuable customers using loyalty card and scanner data. European Journal of Operational Research, 174, 2 (2006), 1260--1280.",
      "doi": ""
    },
    {
      "text": "Milton Rokeach. 1979. Understanding Human Values: Individual and Societal. The Free Press, New York.",
      "doi": ""
    },
    {
      "text": "Andrew Smith, Leigh Sparks, Susan Hart, Nikolaos Tzokas. 2003. Retail loyalty schemes: results from a consumer diary study. Journal of Retailing and Consumer Services, 10, 2 (2003), 109--119.",
      "doi": ""
    },
    {
      "text": "Andrew Smith, Leigh Sparks. 2009. \"It's nice to get a wee treat if you've had a bad week\": Consumer motivations in retail loyalty scheme point redemption. Journal of Business Research, 62 (2009), 542--547.",
      "doi": ""
    },
    {
      "text": "Sarah Spiekermann. Privacy Enhancing Technologies for RFID in Retail: An Empirical Investigation. In UbiComp 2007. Springer, Heidelberg, 56--72. ",
      "doi": "10.5555/1771592.1771596"
    },
    {
      "text": "Statista. 2015. Share of holders of supermarket loyalty cards and credit cards in the United Kingdom in 2015, by gender. https://www.statista.com/statistics/533219/uksupermarket-loyalty-and-credit-cards-holders-bygender/",
      "doi": ""
    },
    {
      "text": "Mark Uncles. 1994. Do you or your customers need a loyalty scheme? Journal of Targeting Measurement and Analysis of Marketing, 2, 4 (1994), 335--349.",
      "doi": ""
    },
    {
      "text": "Paco Underhill. 2008. Why We Buy: The Science of Shopping. Simon&Schuster, USA. ",
      "doi": "10.5555/1201675"
    },
    {
      "text": "Evelien van de Garde-Perik, Panos Markopoulos, Boris de Ruyter, Berry Eggen, Winjnand Ijsselsteijn. 2008. Investigating Privacy Attitudes and Behavior in Relation to Personalization. Social Science Computer Review, 26, 1. Sage, 20--43.  ",
      "doi": "10.1177/0894439307307682"
    },
    {
      "text": "Stephen L. Vargo, Paul P. Maglio, Melissa Archpru Akaka. 2008. On Value and Value Co-creation: A Service Systems and Service Logic Perspective, European Management Journal 26(3): 145--52.",
      "doi": ""
    }
  ]
}