{
  "doi": "10.1145/3025453.3025844",
  "title": "The Heat is On: A Temperature Display for Conveying Affective Feedback",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1756-1767",
  "year": 2017,
  "badges": [],
  "abstract": "Previous research has investigated whether temperature can augment a range of media including music, images and video. We describe the first experiment to investigate whether temperature can augment emotion conveyed by text messages. A challenge in prior work has been ensuring users can discern different thermal signals. We present an improved technique for thermal feedback that uses an array of three thermal stimulators. We demonstrate that the Thermal Array Display (TAD) increases users' ability to identify temperatures within a narrower range, compared to using a single thermal stimulator. While text messages dominate valence in the absence of context for temperature, the TAD consistently conveys arousal, and can enhance arousal of text messages, especially those that are emotionally neutral. We discuss potential applications of augmenting text with temperature.",
  "authors": [
    {
      "name": "Jordan Tewell",
      "institution": "City University, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551837356",
      "orcid": "missing"
    },
    {
      "name": "Jon Bird",
      "institution": "City University, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100566270",
      "orcid": "missing"
    },
    {
      "name": "George R. Buchanan",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100456135/rel-imgonly/g5edit.jpg",
      "acmid": "81100456135",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Shimon Akiyama, Katsunari Sato, Yasutoshi Makino, and Takashi Maeno. 2012. Presentation of thermal sensation through preliminary adjustment of adapting skin temperature. In Haptics Symposium (HAPTICS '12), 355--358. ",
      "doi": ""
    },
    {
      "text": "Margaret M. Bradley and Peter J. Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1: 49--59. ",
      "doi": ""
    },
    {
      "text": "Lorna M. Brown, Stephen A. Brewster, and Helen C. Purchase. 2006. Multidimensional tactons for nonvisual information presentation in mobile devices. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services (MobileHCI '06). ACM, NY, NY, USA, 231238.  ",
      "doi": "10.1145/1152215.1152265"
    },
    {
      "text": "Paul Cairns and Anna L. Cox. 2008. Research Methods for Human-Computer Interaction (1st ed.). Cambridge University Press, NY, NY, USA. ",
      "doi": ""
    },
    {
      "text": "Arthur. D. Craig and M.C. Bushnell. 1994. The thermal grill illusion: unmasking the burn of cold pain. Science 256, 5169: 252--255.",
      "doi": ""
    },
    {
      "text": "Arthur D. Craig, Chen Kewei, D. Bandy, and Eric M. Reiman. 2000. Thermosensory activation of insular cortex. Nature neuroscience 3, 2: 184--190.",
      "doi": ""
    },
    {
      "text": "CMDMessenger Library. Retrieved March 22, 2016 from http://playground.arduino.cc/Code/CmdMessenger",
      "doi": ""
    },
    {
      "text": "Hidenori Fujita and Kazushi Nishimoto. 2004. Lovelet: a heartwarming communication tool for intimate people by constantly conveying situation data. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04), 1553--1553.  ",
      "doi": "10.1145/985921.986129"
    },
    {
      "text": "Alastair J. Gill, Darren Gergle, Robert M. French, and Jon Oberlander. 2008. Emotion rating from short blog texts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1121--1124.  ",
      "doi": "10.1145/1357054.1357229"
    },
    {
      "text": "Daniel Gooch, and Leon Watts. 2010. Communicating social presence through thermal hugs.",
      "doi": ""
    },
    {
      "text": "Barry G. Green. 1977. Localization of thermal sensation: An illusion and synthetic heat. Perception & Psychophysics 22, 4: 331--337. ",
      "doi": ""
    },
    {
      "text": "Martin Halvey, Michael Henderson, Stephen A. Brewster, Graham Wilson, and Stephen A. Hughes. 2012. Augmenting media with thermal stimulation. In International Conference on Haptic and Audio Interaction Design, 91--100.  ",
      "doi": "10.1007/978-3-642-32796-4_10"
    },
    {
      "text": "Martin Halvey, Graham Wilson, Stephen Brewster, and Stephen Hughes. 2012. Baby it's cold outside: the influence of ambient temperature and humidity on thermal feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 715--724.  ",
      "doi": "10.1145/2207676.2207779"
    },
    {
      "text": "Martin Halvey, Graham Wilson, Stephen A. Brewster, and Stephen A. Hughes. 2013. Perception of thermal stimuli for continuous interaction. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 1587--1592.  ",
      "doi": "10.1145/2468356.2468640"
    },
    {
      "text": "Martin Halvey, Graham Wilson, Yolanda Vazquez Alvarez, Stephen A. Brewster, and Stephen A. Hughes. 2011. The effect of clothing on thermal feedback perception. In Proceedings of the 13th international conference on multimodal interfaces (ICMI '11), 217220.  ",
      "doi": "10.1145/2070481.2070519"
    },
    {
      "text": "David Hannah, Martin Halvey, Graham Wilson, and Stephen A. Brewster. 2011. Using multimodal interactions for 3D television and multimedia browsing. In Proceedings of the 9th international interactive conference on Interactive television (EuroITV '11), 181--184.  ",
      "doi": "10.1145/2000119.2000156"
    },
    {
      "text": "Hans IJzerman, and Gün R. Semin. 2009. \"The thermometer of social relations mapping social proximity on temperature.\" Psychological science 20, 10: 1214--1220. ",
      "doi": ""
    },
    {
      "text": "Ken Iwasaki, Takashi Miyaki, and Jun Rekimoto. 2010. AffectPhone: a handset device to present user's emotional state with warmth/coolness. In Proceedings of the 1st International Workshop on Bio-inspired Human-Machine Interfaces and Healthcare Applications, 83--88.",
      "doi": ""
    },
    {
      "text": "Lynette A. Jones, and Michal Berris. 2002. The psychophysics of temperature perception and thermal interface design. In Proceedings of the 10th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (HAPTICS '02), 137--142. ",
      "doi": ""
    },
    {
      "text": "Dan R. Kenshalo and Harley A. Scott. 1966. Temporal course of thermal adaptation. Science 151, 3714: 1095--1096. ",
      "doi": ""
    },
    {
      "text": "Wonjun Lee and Youn-kyung Lim. 2010. Thermomessage: exploring the potential of heat as a modality of peripheral expression. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10) 4231--4236.",
      "doi": ""
    },
    {
      "text": "Wonjun Lee and Youn-kyung Lim. 2012. Explorative research on the heat as an expression medium: focused on interpersonal communication. Personal and Ubiquitous Computing 16, 8: 1039--1049.  ",
      "doi": "10.1007/s00779-011-0424-y"
    },
    {
      "text": "Michael W. Levine and Jeremy M. Shefner. 2000. Fundamentals of Sensation and Perception (3rd. ed.). Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Markus Löchtefeld, Nadine Lautemann, Sven Gehring, and Antonio Krüger. 2014. ambiPad: enriching mobile digital media with ambient feedback. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14), 295--298.",
      "doi": "10.1145/2628363.2628395"
    },
    {
      "text": "Homei Miyashita and Kazushi Nishimoto. 2004. Thermoscore: a new-type musical score with temperature sensation. In Proceedings of the 2004 Conference on New Interfaces for Musical Expression (NIME '04), 104--107.",
      "doi": ""
    },
    {
      "text": "Takuji Narumi, Akagawa Tomohiro, Young Ah Seong, and Michitaka Hirose. 2009. Characterizing the Space by thermal feedback through a wearable device. In Virtual and Mixed Reality, Randall Shumaker (ed.). Springer Berlin Heidelberg, 355--364.  ",
      "doi": "10.1007/978-3-642-02771-0_40"
    },
    {
      "text": "Tal Oron-Gilad, Yael Salzer, and Adi Ronen. 2008. Thermoelectric tactile display based on the thermal grill illusion. In Haptics: Perception, Devices and Scenarios, Manuel Ferre (ed.). Springer Berlin Heidelberg, 343--348.  ",
      "doi": "10.1007/978-3-540-69057-3_43"
    },
    {
      "text": "Preotiuc-Pietro, D., Schwartz, H.A., Park, G., Eichstaedt, J.C., Kern, M., Ungar, L. and Shulman, E.P., 2016. Modelling Valence and Arousal in Facebook posts. Proceedings of the Workshop on Computational Approaches to Subjectivity, Sentiment and Social Media Analysis (WASSA), NAACL. ",
      "doi": ""
    },
    {
      "text": "James A Russell. 1980. A Circumplex Model of Affect. Journal of Personality and Social Psychology 39, 6: 1161--1178.",
      "doi": ""
    },
    {
      "text": "Katri Salminen, Veikko Surakka, Jukka Raisamo, Jani Lylykangas, Johannes Pystynen, Roope Raisamo, Kalle Mäkelä, and Teemu Ahmaniemi. 2011. Emotional responses to thermal stimuli. In Proceedings of the 13th international conference on multimodal interfaces (ICMI '11), 193--196.  ",
      "doi": "10.1145/2070481.2070513"
    },
    {
      "text": "Katsunari Sato and Takashi Maeno. 2012. Presentation of sudden temperature change using spatially divided warm and cool stimuli. In Haptics: Perception, Devices, Mobility, and Communication, Poika Isokoski and Jukka Springare (eds.). Springer Berlin Heidelberg, 457--468.  ",
      "doi": "10.1007/978-3-642-31401-8_41"
    },
    {
      "text": "Katja Suhonen, Sebastian Müller, Jussi Rantala, Kaisa Väänänen-Vainio-Mattila, Roope Raisamo, and Vuokko Lantz. 2012. Haptically augmented remote speech communication: a study of user practices and experiences. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12), 361--369.  ",
      "doi": "10.1145/2399016.2399073"
    },
    {
      "text": "Eun-Jung Sung, Seung-Schik Yoo, Hyo Woon Yoon, Sung-Suk Oh, Yeji Han, and Hyun Wook Park. Brain activation related to affective dimension during thermal stimulation in humans: a functional magnetic resonance imaging study. 2007. International Journal of Neuroscience 117, 7: 1011--1027. ",
      "doi": ""
    },
    {
      "text": "Caroline Tagg. 2009. A corpus linguistics study of SMS text messaging. Ph.D Dissertation. The University of Birmingham, Birmingham, UK.",
      "doi": ""
    },
    {
      "text": "Cati Vaucelle, Leonardo Bonanni, and Hiroshi Ishii. 2009. Design of haptic interfaces for therapy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 467--470.  ",
      "doi": "10.1145/1518701.1518776"
    },
    {
      "text": "Ryuji Watanabe, Ryuta Okazaki, and Hiroyuki Kajimoto. 2014. Mutual referral of thermal sensation between two thermal-tactile stimuli. In Haptics Symposium (HAPTICS '14), 299--302.",
      "doi": ""
    },
    {
      "text": "Lawrence E. Williams, and John A. Bargh. 2008. Experiencing physical warmth promotes interpersonal warmth. Science 322, 5901: 606--607. ",
      "doi": ""
    },
    {
      "text": "Graham Alasdair Wilson. 2013. Using pressure input and thermal feedback to broaden haptic interaction with mobile devices. Ph.D Dissertation. University of Glasgow, UK.",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Stephen Brewster, Martin Halvey, and Stephen Hughes. 2012. Thermal icons: evaluating structured thermal feedback for mobile interaction. In Proceedings of the 14th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '12), 309--312.  ",
      "doi": "10.1145/2371574.2371621"
    },
    {
      "text": "Graham Wilson, Gavin Davidson, and Stephen A. Brewster. 2015. In the heat of the moment: subjective interpretations of thermal feedback during interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2063--2072.  ",
      "doi": "10.1145/2702123.2702219"
    },
    {
      "text": "Graham Wilson, Dobromir Dobrev, and Stephen A. Brewster. 2016. Hot Under the Collar: Mapping Thermal Feedback to Dimensional Models of Emotion. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4838--4849.  ",
      "doi": "10.1145/2858036.2858205"
    },
    {
      "text": "Graham Wilson, Martin Halvey, Stephen A. Brewster, and Stephen A. Hughes. 2011. Some like it hot: thermal feedback for mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2555--2564.  ",
      "doi": "10.1145/1978942.1979316"
    },
    {
      "text": "Chen-Bo Zhong and Geoffrey J. Leonardelli. 2008. Cold and lonely does social exclusion literally feel cold?. Psychological Science 19, 9: 838--842. ",
      "doi": ""
    }
  ]
}