{
  "doi": "10.1145/3025453.3025689",
  "title": "Extending the Body for Interaction with Reality",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5145-5157",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we explore how users can control remote devices with a virtual long arm, while preserving the perception that the artificial arm is actually part of their own body. Instead of using pointing, speech, or a remote control, the users' arm is extended in augmented reality, allowing access to devices that are out of reach. Thus, we allow users to directly manipulate real-world objects from a distance using their bare hands. A core difficulty we focus on is how to maintain ownership for the unnaturally long virtual arm, which is the strong feeling that one's limbs are actually part of the own body. Fortunately, what the human brain experiences as being part of the own body is very malleable and we find that during interaction the user's virtual arm can be stretched to more than twice its real length, without breaking the user's sense of ownership for the virtual limb.",
  "authors": [
    {
      "name": "Tiare Feuchtner",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-87958930557/rel-imgonly/87958930557.jpg",
      "acmid": "87958930557",
      "orcid": "0000-0002-9922-5538"
    },
    {
      "name": "Jörg Müller",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abednego, M., Lee, J.-H., Moon, W., and Park, J.-H. I-grabber: Expanding physical reach in a large-display tabletop environment through the use of a virtual grabber. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, ITS '09, ACM (New York, NY, USA, 2009), 61--64.  ",
      "doi": "10.1145/1731903.1731917"
    },
    {
      "text": "Argelaguet, F., and Andujar, C. A survey of 3d object selection techniques for virtual environments. Computers & Graphics 37, 3 (2013), 121--136.  ",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Argelaguet, F., Hoyet, L., Trico, M., and Lécuyer, A. The role of interaction in virtual embodiment: Effects of the virtual hand representation. In Virtual Reality (VR), 2016 IEEE, IEEE (2016), 3--10.",
      "doi": ""
    },
    {
      "text": "Azmandian, M., Hancock, M., Benko, H., Ofek, E., and Wilson, A. D. Haptic retargeting: Dynamic repurposing of passive haptics for enhanced virtual reality experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM (2016), 1968--1979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Banakou, D., Groten, R., and Slater, M. Illusory ownership of a virtual child body causes overestimation of object sizes and implicit attitude changes. Proceedings of the National Academy of Sciences 110, 31 (2013), 12846--12851.",
      "doi": ""
    },
    {
      "text": "Beaudouin-Lafon, M. Instrumental interaction: an interaction model for designing post-wimp user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, ACM (2000), 446--453.  ",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Botvinick, M., and Cohen, J. Rubber hands 'feel' touch that eyes see. Nature 391, 6669 (1998), 756--756.",
      "doi": ""
    },
    {
      "text": "Bowman, D. A., Coquillart, S., Froehlich, B., Hirose, M., Kitamura, Y., Kiyokawa, K., and Stuerzlinger, W. 3d user interfaces: New directions and perspectives. IEEE computer graphics and applications, 6 (2008), 20--36.  ",
      "doi": "10.1109/MCG.2008.109"
    },
    {
      "text": "Braun, N., Thorne, J. D., Hildebrandt, H., and Debener, S. Interplay of agency and ownership: The intentional binding and rubber hand illusion paradigm combined. PloS one 9, 11 (2014), e111967.",
      "doi": ""
    },
    {
      "text": "Buchmann, V., Violich, S., Billinghurst, M., and Cockburn, A. Fingartips: gesture based direct manipulation in augmented reality. In Proceedings of the 2nd international conference on Computer graphics and interactive techniques in Australasia and South East Asia, ACM (2004), 212--221.  ",
      "doi": "10.1145/988834.988871"
    },
    {
      "text": "Calvert, G., Spence, C., and Stein, B. E. The handbook of multisensory processes. MIT press, 2004.",
      "doi": ""
    },
    {
      "text": "Casiez, G., Vogel, D., Balakrishnan, R., and Cockburn, A. The impact of control-display gain on user performance in pointing tasks. Human-Computer Interaction 23, 3 (2008), 215--250.",
      "doi": ""
    },
    {
      "text": "Caspar, E. A., Cleeremans, A., and Haggard, P. The relationship between human agency and embodiment. Consciousness and cognition 33 (2015), 226--236.",
      "doi": ""
    },
    {
      "text": "Costantini, M., and Haggard, P. The rubber hand illusion: sensitivity and reference frame for body ownership. Consciousness and cognition 16, 2 (2007), 229--240.",
      "doi": ""
    },
    {
      "text": "Dummer, T., Picot-Annand, A., Neal, T., and Moore, C. Movement and the rubber hand illusion. Perception 38, 2 (2009), 271.",
      "doi": ""
    },
    {
      "text": "Ehrsson, H. The concept of body ownership and its relation to multisensory integration. The New Handbook of Multisensory Processes - B. E. Stein (Ed.) (2012), 775--792. MIT Press (Cambridge).",
      "doi": ""
    },
    {
      "text": "Ehrsson, H. H., Holmes, N. P., and Passingham, R. E. Touching a rubber hand: feeling of body ownership is associated with activity in multisensory brain areas. The Journal of Neuroscience 25, 45 (2005), 10564--10573.",
      "doi": ""
    },
    {
      "text": "Ehrsson, H. H., Spence, C., and Passingham, R. E. That's my hand! activity in premotor cortex reflects feeling of ownership of a limb. Science 305, 5685 (2004), 875--877.",
      "doi": ""
    },
    {
      "text": "Franck, N., Farrer, C., Georgieff, N., Marie-Cardine, M., Daléry, J., d'Amato, T., and Jeannerod, M. Defective recognition of one's own actions in patients with schizophrenia. American Journal of Psychiatry 158, 3 (2001), 454--459.",
      "doi": ""
    },
    {
      "text": "Fraser, M., Benford, S., Hindmarsh, J., and Heath, C. Supporting awareness and interaction through collaborative virtual interfaces. In Proceedings of the 12th Annual ACM Symposium on User Interface Software and Technology, UIST '99, ACM (New York, NY, USA, 1999), 27--36.  ",
      "doi": "10.1145/320719.322580"
    },
    {
      "text": "Frees, S., Kessler, G. D., and Kay, E. Prism interaction for enhancing control in immersive virtual environments. ACM Transactions on Computer-Human Interaction (TOCHI) 14, 1 (2007), 2.  ",
      "doi": "10.1145/1229855.1229857"
    },
    {
      "text": "Gallo, L., Ciampi, M., and Minutolo, A. Smoothed pointing: a user-friendly technique for precision enhanced remote pointing. In Complex, Intelligent and Software Intensive Systems (CISIS), 2010 International Conference on, IEEE (2010), 712--717.  ",
      "doi": "10.1109/CISIS.2010.76"
    },
    {
      "text": "Guterstam, A., Petkova, V. I., and Ehrsson, H. H. The illusion of owning a third arm. PloS one 6, 2 (2011), e17208.",
      "doi": ""
    },
    {
      "text": "Hilliges, O., Kim, D., Izadi, S., Weiss, M., and Wilson, A. Holodesk: direct 3d interactions with a situated see-through display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2012), 2421--2430.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C., Benford, S., and Greenhalgh, C. Object-focused interaction in collaborative virtual environments. ACM Trans. Comput.-Hum. Interact. 7, 4 (Dec. 2000), 477--509.  ",
      "doi": "10.1145/365058.365088"
    },
    {
      "text": "Holz, C., Grossman, T., Fitzmaurice, G., and Agur, A. Implanted user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2012), 503--512.  ",
      "doi": "10.1145/2207676.2207745"
    },
    {
      "text": "Hutchins, E. L., Hollan, J. D., and Norman, D. A. Direct manipulation interfaces. Human-Computer Interaction 1, 4 (1985), 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Ijsselsteijn, W., de Kort, Y., and Haans, A. Is this my hand i see before me? the rubber hand illusion in reality, virtual reality, and mixed reality. Presence 15, 4 (2006), 455--464.  ",
      "doi": "10.1162/pres.15.4.455"
    },
    {
      "text": "Ishii, H., Lakatos, D., Bonanni, L., and Labrune, J.-B. Radical atoms: Beyond tangible bits, toward transformable materials. interactions 19, 1 (Jan. 2012), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Jenkinson, P. M., and Preston, C. New reflections on agency and body ownership: The moving rubber hand illusion in the mirror. Consciousness and cognition 33 (2015), 432--442.",
      "doi": ""
    },
    {
      "text": "Kalckert, A., and Ehrsson, H. H. The moving rubber hand illusion revisited: Comparing movements and visuotactile stimulation to induce illusory ownership. Consciousness and cognition 26 (2014), 117--132.",
      "doi": ""
    },
    {
      "text": "Kalckert, A., and Ehrsson, H. H. The spatial distance rule in the moving and classical rubber hand illusions. Consciousness and cognition 30 (2014), 118--132.",
      "doi": ""
    },
    {
      "text": "Kilteni, K., Bergstrom, I., and Slater, M. Drumming in immersive virtual reality: the body shapes the way we play. Visualization and Computer Graphics, IEEE Transactions on 19, 4 (2013), 597--605.  ",
      "doi": "10.5555/2478535.2478597"
    },
    {
      "text": "Kilteni, K., Maselli, A., Kording, K. P., and Slater, M. Over my fake body: body ownership illusions for studying the multisensory basis of own-body perception. Frontiers in human neuroscience 9 (2015).",
      "doi": ""
    },
    {
      "text": "Kilteni, K., Normand, J.-M., Sanchez-Vives, M. V., and Slater, M. Extending body space in immersive virtual reality: a very long arm illusion. PloS one 7, 7 (2012), e40867.",
      "doi": ""
    },
    {
      "text": "Kokkinara, E., and Slater, M. Measuring the effects through time of the influence of visuomotor and visuotactile synchronous stimulation on a virtual body ownership illusion. Perception 43, 1 (2014), 43--58.",
      "doi": ""
    },
    {
      "text": "König, W. A., Gerken, J., Dierdorf, S., and Reiterer, H. Adaptive pointing: implicit gain adaptation for absolute pointing devices. In CHI'09 Extended Abstracts on Human Factors in Computing Systems, ACM (2009), 4171--4176.  ",
      "doi": "10.1145/1520340.1520635"
    },
    {
      "text": "Lin, L., and Jörg, S. Need a hand? How appearance affects the virtual hand illusion. In Proceedings of the ACM Symposium on Applied Perception, SAP '16, ACM (New York, NY, USA, 2016), 69--76.  ",
      "doi": "10.1145/2931002.2931006"
    },
    {
      "text": "Maravita, A., Spence, C., and Driver, J. Multisensory integration and the body schema: close to hand and within reach. Current Biology 13, 13 (2003), R531--R539.",
      "doi": ""
    },
    {
      "text": "Maselli, A., and Slater, M. The building blocks of the full body ownership illusion. Frontiers in human neuroscience 7 (2013).",
      "doi": ""
    },
    {
      "text": "Nancel, M., Pietriga, E., Chapuis, O., and Beaudouin-Lafon, M. Mid-air pointing on ultra-walls. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 5 (2015), 21.  ",
      "doi": "10.1145/2766448"
    },
    {
      "text": "Parker, J. K., Mandryk, R. L., and Inkpen, K. M. Tractorbeam: Seamless integration of local and remote pointing for tabletop displays. In Proceedings of Graphics Interface 2005, GI '05, Canadian Human-Computer Communications Society (School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 2005), 33--40. ",
      "doi": "10.5555/1089508.1089515"
    },
    {
      "text": "Petkova, V. I., and Ehrsson, H. H. If i were you: perceptual illusion of body swapping. PloS one 3, 12 (2008), e3832.",
      "doi": ""
    },
    {
      "text": "Poupyrev, I., Billinghurst, M., Weghorst, S., and Ichikawa, T. The go-go interaction technique: non-linear mapping for direct manipulation in vr. In Proceedings of the 9th annual ACM symposium on User interface software and technology, ACM (1996), 79--80.  ",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Riemer, M., Fuchs, X., Bublatzky, F., Kleinböhl, D., Hülzl, R., and Trojan, J. The rubber hand illusion depends on a congruent mapping between real and artificial fingers. Acta psychologica 152 (2014), 34--41.",
      "doi": ""
    },
    {
      "text": "Shimada, S., Fukuda, K., and Hiraki, K. Rubber hand illusion under delayed visual feedback. PloS one 4, 7 (2009), e6185.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Direct manipulation: a step beyond programming languages. Sparks of innovation in human-computer interaction 17 (1983).  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Slater, M., Perez-Marcos, D., Ehrsson, H. H., and Sanchez-Vives, M. V. Towards a digital body: the virtual arm illusion. Frontiers in human neuroscience 2 (2008).",
      "doi": ""
    },
    {
      "text": "Slater, M., Perez-Marcos, D., Ehrsson, H. H., and Sanchez-Vives, M. V. Inducing illusory ownership of a virtual body. Frontiers in neuroscience 3, 2 (2009), 214.",
      "doi": ""
    },
    {
      "text": "Slater, M., Spanlang, B., Sanchez-Vives, M. V., and Blanke, O. First person experience of body transfer in virtual reality. PloS one 5, 5 (2010), e10564.",
      "doi": ""
    },
    {
      "text": "Steptoe, W., Steed, A., and Slater, M. Human tails: ownership and control of extended humanoid avatars. Visualization and Computer Graphics, IEEE Transactions on 19, 4 (2013), 583--590.  ",
      "doi": "10.5555/2478535.2478595"
    },
    {
      "text": "Telea, A. An image inpainting technique based on the fast marching method. Journal of graphics tools 9, 1 (2004), 23--34.",
      "doi": ""
    },
    {
      "text": "Tieri, G., Tidoni, E., Pavone, E., and Aglioti, S. Mere observation of body discontinuity affects perceived ownership and vicarious agency over a virtual hand. Experimental brain research 233, 4 (2015), 1247--1259.",
      "doi": ""
    },
    {
      "text": "Tsakiris, M., Carpenter, L., James, D., and Fotopoulou, A. Hands only illusion: multisensory integration elicits sense of ownership for body parts but not for non-corporeal objects. Experimental Brain Research 204, 3 (2010), 343--352.",
      "doi": ""
    },
    {
      "text": "Tsakiris, M., Prabhu, G., and Haggard, P. Having a body versus moving your body: How agency structures body-ownership. Consciousness and cognition 15, 2 (2006), 423--432.",
      "doi": ""
    },
    {
      "text": "van der Hoort, B., and Ehrsson, H. H. Body ownership affects visual perception of object size by rescaling the visual representation of external space. Attention, Perception, & Psychophysics 76, 5 (2014), 1414--1428.",
      "doi": ""
    },
    {
      "text": "Vogel, D., and Balakrishnan, R. Distant freehand pointing and clicking on very large, high resolution displays. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology, UIST '05, ACM (New York, NY, USA, 2005), 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Walsh, L. D., Moseley, G. L., Taylor, J. L., and Gandevia, S. C. Proprioceptive signals contribute to the sense of body ownership. The Journal of physiology 589, 12 (2011), 3009--3021.",
      "doi": ""
    },
    {
      "text": "Zhang, J., Chen, W., Li, H., Hommel, B., and Yuan, T. Disentangling the sense of agency and the sense of ownership in the virtual hand illusion paradigm. Tech. rep., PeerJ PrePrints, 2014.",
      "doi": ""
    }
  ]
}