{
  "doi": "10.1145/3025453.3025746",
  "title": "Five Lenses for Designing Exertion Experiences",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2473-2487",
  "year": 2017,
  "badges": [],
  "abstract": "The field of HCI has increasingly looked at ways to support the physically active human being, however, new work suggests that the field has only begun to understand the many virtues of exertion. To further the field, we present a set of five design lenses extended primarily from sports philosophy literature to help approach exertion not just as a means of deferring death, but also as an opportunity for personal growth. The lenses facilitate learning how to appreciate a void (Reverie), welcome pleasure (Pleasure), become humble (Humility), as well as be fearful and excited simultaneously (Sublime), whilst being more carefully aware of one's own body (Oneness). Using these lenses, we articulate associated technology opportunities through related work as well as our own craft knowledge. With our work, we aim to support designers who want to facilitate the many virtues of exertion so that ultimately more people profit from the many benefits of being physically active.",
  "tags": [
    "whole-body interaction",
    "exergame",
    "movement-based interaction",
    "exertion games",
    "sport",
    "exertion interface"
  ],
  "authors": [
    {
      "name": "Florian 'Floyd' Mueller",
      "institution": "RMIT University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    },
    {
      "name": "Damon Young",
      "institution": "RMIT University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161328",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sensoria Fitness. Retrieved September 1, 2016 from http://www.sensoriafitness.com/.",
      "doi": ""
    },
    {
      "text": "Florian Mueller and Sarah Jane Pell. 2016. Technology Meets Adventure: Learnings from an Earthquake-Interrupted Mt. Everest Expedition. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Ubicomp'16). ACM, 817--828. http://dx.doi.org/10.1145/2971648.2971683  ",
      "doi": "10.1145/2971648.2971683"
    },
    {
      "text": "Ruth Sancho Huerga, Jennifer Lade and Florian Mueller. 2016. Designing Play to Support Hospitalized Children. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY'16). ACM, 401--412. http://dx.doi.org/10.1145/2967934.2968106  ",
      "doi": "10.1145/2967934.2968106"
    },
    {
      "text": "Gregory D Abowd, Anind K Dey, Peter J Brown, Nigel Davies, Mark Smith and Pete Steggles. 1999. Towards a Better Understanding of Context and Context-Awareness. In Proceedings of the International Symposium on Handheld and Ubiquitous Computing. Springer, 304--307.",
      "doi": "10.5555/647985.743843"
    },
    {
      "text": "David Altimira, Florian Mueller, Jenny Clarke, Gun Lee, Mark Billinghurst and Christoph Bartneck. 2016. Digitally Augmenting Sports: An Opportunity for Exploring and Understanding Novel Balancing Techniques. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, 1681--1691. http://dx.doi.org/10.1145/2858036.2858277  ",
      "doi": "10.1145/2858036.2858277"
    },
    {
      "text": "Nadia Bianchi-Berthouze. 2013. Understanding the Role of Body Movement in Player Engagement. Human-Computer Interaction 28, 1: 40--75.",
      "doi": ""
    },
    {
      "text": "Ian Bogost. 2006. Persuasive Games: Wii's Revolution Is in the Past. Retrieved September 1, 2007 from http://www.seriousgamessource.com/features/feature_ 112806_wii_1.php",
      "doi": ""
    },
    {
      "text": "Richard Byrne, Joe Marshall and Florian Mueller. 2016. Designing the Vertigo Experience: Vertigo as a Design Resource for Digital Bodily Play. In Proceedings of TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI'16). ACM, 296--303. http://dx.doi.org/10.1145/2839462.2839465  ",
      "doi": "10.1145/2839462.2839465"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'08). ACM, 1797--1806. http://dx.doi.org/10.1145/1357054.1357335.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W McDonald and James A Landay. 2012. Designing for Healthy Lifestyles: Design Considerations for Mobile Technologies to Encourage Consumer Health and Wellness. Human--Computer Interaction 6, 3--4: 167315.",
      "doi": "10.1561/1100000040"
    },
    {
      "text": "Wikipedia contributors. 2016. George Mallory Wikipedia, the Free Encyclopedia. Retrieved September 1, 2016 from https://en.wikipedia.org/w/index.php?title=George_M allory&oldid=738677523.",
      "doi": ""
    },
    {
      "text": "Eka Peng Cox, Nicholas O'Dwyer, Rebecca Cook, Melanie Vetter, Hoi Lun Cheng, Kieron Rooney and Helen O'Connor. 2015. Relationship between Physical Activity and Cognitive Function in Apparently Healthy Young to Middle-Aged Adults: A Systematic Review. Journal of Science and Medicine in Sport 19, 8: 616--628. ",
      "doi": ""
    },
    {
      "text": "Crytek. 2016. The Climb. Retrieved September 1, 2016 from http://www.theclimbgame.com.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Performance. New York: Harper and Row.",
      "doi": ""
    },
    {
      "text": "Anthony Cuthbertson. 2015. Brand Killer: Augmented Reality Goggles Create Real-World Adblock. Retrieved September 1, 2016 from http://www.ibtimes.co.uk/brand-killer-augmentedreality-goggles-create-real-world-adblock-1484844.",
      "doi": ""
    },
    {
      "text": "Rodrigo de Oliveira and Nuria Oliver. 2008. Triplebeat: Enhancing Exercise Performance with Persuasion. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services. ACM, 255--264. http://dx.doi.org/10.1145/1409240.1409268  ",
      "doi": "10.1145/1409240.1409268"
    },
    {
      "text": "Anind Dey. 2016. Where the *#*$% Is My Walk in the Woods? Ubicomp'16 Plenary Talk.",
      "doi": ""
    },
    {
      "text": "Arne Dietrich. 2006. Transient Hypofrontality as a Mechanism for the Psychological Effects of Exercise. Psychiatry Research 145, 1: 79--83. http://dx.doi.org/10.1016/j.psychres.2005.07.033 ",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is: The Foundations of Embodied Interaction. MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Daniel A Epstein, Alan Borning and James Fogarty. 2013. Fine-Grained Sharing of Sensed Physical Activity: A Value Sensitive Approach. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 489--498. http://dx.doi.org/10.1145/2493432.2493433  ",
      "doi": "10.1145/2493432.2493433"
    },
    {
      "text": "Kathrin Maria Gerling, Matthew Miller, Regan L Mandryk, Max Valentin Birk and Jan David Smeddinck. 2014. Effects of Balancing for Physical Abilities on Player Performance, Experience and SelfEsteem in Exergames. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14). ACM, 2201--2210. http://dx.doi.org/10.1145/2556288.2556963  ",
      "doi": "10.1145/2556288.2556963"
    },
    {
      "text": "Jonna Häkkilä, Leena Ventä-Olkkonen, Henglin Shi, Ville Karvonen, Yun He and Mikko Häyrynen. 2013. Jogging in a Virtual City. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia. ACM, 50. http://dx.doi.org/10.1145/2541831.2541881  ",
      "doi": "10.1145/2541831.2541881"
    },
    {
      "text": "Perttu Hamalainen, Joe Marshall, Raine Kajastila, Richard Byrne and Florian Mueller. 2015. Utilizing Gravity in Movement-Based Games and Play. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY'15). ACM, 67--77. http://dx.doi.org/10.1145/2793107.2793110  ",
      "doi": "10.1145/2793107.2793110"
    },
    {
      "text": "Richard Harper, Tom Rodden, Yvonne Rogers and Abigail Sellen. 2008. Being Human: Hci in the Year 2020. Microsoft Research.",
      "doi": ""
    },
    {
      "text": "Susan Harter. 2015. The Construction of the Self: Developmental and Sociocultural Foundations. Guilford Publications.",
      "doi": ""
    },
    {
      "text": "Eric B Hekler, Predrag Klasnja, Jon E Froehlich and Matthew P Buman. 2013. Mind the Theoretical Gap: Interpreting, Using, and Developing Behavioral Theory in Hci Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13). ACM, 3307--3316. http://dx.doi.org/10.1145/2470654.2466452  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond Being There. In CHI '92: Proceedings of the SIGCHI conference on Human factors in computing systems (CHI'92). ACM Press, 119--125. http://dx.doi.org/10.1145/142750.142769  ",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Kristina Höök, Martin Jonsson, Anna Ståhl and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'16),.ACM, 3131--3142. https://doi.org/10.1145/2858036.2858583  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Kristina Hook, Anna Stahl, Martin Jonsson, Johanna Mercurio, Anna Karlsson and Eva-Carin Banka Johnson. 2015. Somaesthetic Design. interactions 22, 4: 26--33. http://dx.doi.org/10.1145/2770888  ",
      "doi": "10.1145/2770888"
    },
    {
      "text": "David Hume. 2012. A Treatise of Human Nature. Courier Corporation.",
      "doi": ""
    },
    {
      "text": "Caroline Hummels, Kees C. Overbeeke and Sietske Klooster. 2007. Move to Get Moved: A Search for Methods, Tools and Knowledge to Design for Expressive and Rich Movement-Based Interaction. Personal and Ubiquitous Computing 11, 8: 677--690.  ",
      "doi": "10.1007/s00779-006-0135-y"
    },
    {
      "text": "Katherine Isbister and Florian Mueller. 2014. Guidelines for the Design of Movement-Based Games and Their Relevance to HCI. Human--Computer Interaction 30, 3--4: 366--399. http://dx.doi.org/10.1080/07370024.2014.996647  ",
      "doi": "10.1080/07370024.2014.996647"
    },
    {
      "text": "Raine Kajastila, Leo Holsti and Perttu Hämäläinen. 2016. The Augmented Climbing Wall: High-Exertion Proximity Interaction on a Wall-Sized Interactive Surface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, 758--769. https://doi.org/10.1145/2858036.2858450  ",
      "doi": "10.1145/2858036.2858450"
    },
    {
      "text": "Pamela M Kato, Steve W Cole, Andrew S Bradlyn and Brad H Pollock. 2008. A Video Game Improves Behavioral Outcomes in Adolescents and Young Adults with Cancer: A Randomized Trial. Pediatrics 122, 2: e305-e317.",
      "doi": ""
    },
    {
      "text": "Rohit Ashok Khot, Larissa Hjorth and Florian Mueller. 2014. Understanding Physical Activity through 3d Printed Material Artifacts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14). ACM, 3835--3844. http://dx.doi.org/10.1145/2556288.2557144  ",
      "doi": "10.1145/2556288.2557144"
    },
    {
      "text": "Rohit Ashok Khot, Jeewon Lee, Deepti Aggarwal, Larissa Hjorth and Florian Mueller. 2015. Tastybeats: Designing Palatable Representations of Physical Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, 2933--2942. http://dx.doi.org/10.1145/2702123.2702197  ",
      "doi": "10.1145/2702123.2702197"
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo and Wanda Pratt. 2011. How to Evaluate Technologies for Health Behavior Change in Hci Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11). ACM, 3063--3072. http://dx.doi.org/10.1145/1978942.1979396  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Scott Klemmer and Bjorn Hartmann. 2006. How Bodies Matter: Five Themes for Interaction Design. In Proceedings of the 6th conference on Designing Interactive systems (DIS'06). ACM, 140--149. https://doi.org/10.1145/1142405.1142429  ",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Robert Scott Kretchmar. 2005. Practical Philosophy of Sport and Physical Activity. Human Kinetics Publishers (Champaign, IL, USA).",
      "doi": ""
    },
    {
      "text": "Kylie Ladd. The Unexpected Idea. Retrieved September 1, 2016 from https://griffithreview.com/articles/the-unexpectedidea/.",
      "doi": ""
    },
    {
      "text": "Richard E. Ladner. 2015. Design for User Empowerment. interactions 22, 2: 24--29. http://dx.doi.org/10.1145/2723869  ",
      "doi": "10.1145/2723869"
    },
    {
      "text": "James Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux and Henry Strub. 2006. Fish'n'steps: Encouraging Physical Activity with an Interactive Computer Game. In Proceedings of UbiComp 2006: Ubiquitous Computing. ACM, 261--278. https://doi.org/10.1007/11853565_16  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Conor Linehan, Sabine Harrer, Ben Kirman, Shaun Lawson and Marcus Carter. 2015. Games against Health: A Player-Centered Design Philosophy. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 589--600. http://dx.doi.org/10.1145/2702613.2732514  ",
      "doi": "10.1145/2702613.2732514"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui and Eric Paulos. 2016. Skintillates: Designing and Creating Epidermal Interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS'16). ACM, 853--864. http://dx.doi.org/10.1145/2901790.2901885  ",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Lian Loke, Astrid Larssen, Toni Robertson and Jenny Edwards. 2007. Understanding Movement for Interaction Design: Frameworks and Approaches. Personal and Ubiquitous Computing 11, 8 Special Issue Movement-Based Interaction: 691--701.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to Movement-Based Interaction Design. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 1: 7.",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Lumo. 2016. Lumo Lift. Retrieved September 1, 2016 from http://www.lumobodytech.com/lumo-lift/.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2016. The Quantified Self: A Sociology of Self-Tracking Cultures. Polity Press.",
      "doi": ""
    },
    {
      "text": "Alasdair MacIntyre. 2013. After Virtue. A&C Black.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami and Annika Waern. 2016. Embodied Sketching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, 6014--6027. https://doi.org/10.1145/2858036.2858486  ",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "Joe Marshall, Conor Linehan and Adrian Hazzard. 2016. Designing Brutal Multiplayer Video Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, 26692680. https://doi.org/10.1145/2858036.2858080",
      "doi": "10.1145/2858036.2858080"
    },
    {
      "text": "Joe Marshall, Florian Mueller, Steve Benford and Sebastiaan Pijnappel. 2016. Expanding Exertion Gaming. International Journal of Human-Computer Studies 90: 1--13. http://dx.doi.org/http://dx.doi.org/10.1016/j.ijhcs.2016 .02.003",
      "doi": ""
    },
    {
      "text": "Joe Marshall, Duncan Rowland, Stefan Rennick Egglestone, Steve Benford, Brendan Walker and Derek McAuley. 2011. Breath Control of Amusement Rides. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI'11). ACM, 73--82. http://dx.doi.org/10.1145/1978942.1978955  ",
      "doi": "10.1145/1978942.1978955"
    },
    {
      "text": "Mike McNamee. 2008. Sports, Virtues and Vices: Morality Plays. Routledge.",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Stefan Agamanolis and Rosalind Picard. 2003. Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. In Proceedings of SIGCHI conference on Human factors in computing systems (CHI'03). ACM, 561--568. http://dx.doi.org/http://doi.acm.org/10.1145/642611.6  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Florian Mueller, Stefan Agamanolis, Frank Vetere and Martin Gibbs. 2009. Brute Force Interactions: Leveraging Intense Physical Actions in Gaming. In OzCHI '09: Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group. ACM, 57--64. http://dx.doi.org/10.1145/1738826.1738836  ",
      "doi": "10.1145/1738826.1738836"
    },
    {
      "text": "Florian Mueller, Darren Edge, Frank Vetere, Martin. Gibbs, Stefan Agamanolis, Bert Bongers and Jennifer. Sheridan. 2011. Designing Sports: A Framework for Exertion Games. In CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11). ACM, 2651--2660. https://doi.org/10.1145/1978942.1979330",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Florian Mueller, Frank Vetere, Martin Gibbs, Darren Edge, Stefan Agamanolis, Jennifer Sheridan and Jeff Heer. 2012. Balancing Exertion Experiences. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems (CHI'12). ACM, 18531862. https://doi.org/10.1145/2207676.2208322",
      "doi": "10.1145/2207676.2208322"
    },
    {
      "text": "Florian Mueller, Frank Vetere, Martin.Gibbs, Stefan Agamanolis and Jennifer Sheridan. 2010. Jogging over a Distance: The Influence of Design in Parallel Exertion Games. In Sandbox '10: Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games. ACM, 63--68. https://doi.org/10.1145/1836135.1836145",
      "doi": "10.1145/1836135.1836145"
    },
    {
      "text": "Florian Mueller, Frank Vetere, Martin Gibbs, Darren Edge, Stefan Agamanolis and Jennifer Sheridan. 2010. Jogging over a Distance between Europe and Australia. In UIST '10. Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST'10). ACM, 189--198. http://dx.doi.org/10.1145/1866029.1866062  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Florian Mueller, Martin Gibbs, Frank Vetere, Stefan Agamanolis and Darren Edge. 2014. Designing Mediated Combat Play. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI'14). ACM, 149--156. https://doi.org/10.1145/2540930.2540937",
      "doi": "10.1145/2540930.2540937"
    },
    {
      "text": "Florian Mueller and Katherine Isbister. 2014. Movement-Based Game Guidelines. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2557163, 21912200. http://dx.doi.org/10.1145/2556288.2557163  ",
      "doi": "10.1145/2556288.2557163"
    },
    {
      "text": "Florian Mueller, Cagdas Toprak, Eberhard Graether, Wouter Walmink, Bert Bongers and Elise van den Hoven. 2012. Hanging Off a Bar. In Proceedings of CHI '12 extended abstracts on Human factors in computing systems. ACM, 1055--1058. http://dx.doi.org/10.1145/2212776.2212384  ",
      "doi": "10.1145/2212776.2212384"
    },
    {
      "text": "Florian Mueller, Gunnar Stevens, Alex Thorogood, Shannon O'Brien and Volker Wulf. 2007. Sports over a Distance. Personal and Ubiquitous Computing 11, 8: 633--645. doi:10.1007/s00779-006-0133-0  ",
      "doi": "10.1007/s00779-006-0133-0"
    },
    {
      "text": "Florian Mueller and Matthew Muirhead. 2015. Jogging with a Quadcopter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, 2023--2032. http://dx.doi.org/10.1145/2702123.2702472  ",
      "doi": "10.1145/2702123.2702472"
    },
    {
      "text": "Florian Mueller, Martin Gibbs and Frank Vetere. 2009. The Mousegrip. In Proceedings of the 27th international conference on Human factors in Computing Systems, Extended Abstract. ACM, 31993204. http://dx.doi.org/http://doi.acm.org/10.1145/1520340.",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Martin Gibbs and Vetere Frank. 2010. Towards Understanding How to Design for Social Play in Exertion Games. Personal and Ubiquitous Computing 14, 5: 417--424. doi:10.1007/s00779-009-0268-x  ",
      "doi": "10.1007/s00779-009-0268-x"
    },
    {
      "text": "Florian Mueller, Martin Gibbs and Frank Vetere. 2009. Design Influence on Social Play in Distributed Exertion Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09). ACM Press, 1539--1548. https://doi.org/10.1145/1518701.1518938  ",
      "doi": "10.1145/1518701.1518938"
    },
    {
      "text": "Florian Mueller, Luke Cole, Shannon O'Brien and Wouter Walmink. 2006. Airhockey over a Distance: A Networked Physical Game to Support Social Interactions. In Proceedings of the 2006 ACM SIGCHI international conference on Advances in computer entertainment technology. ACM, 70. http://dx.doi.org/http://doi.acm.org/10.1145/1178823.",
      "doi": "10.1145/1178823.1178906"
    },
    {
      "text": "Robb Mitchell, Andreas Fender and Florian Mueller. 2016. Handyfeet: Social Bodily Play Via Split Control of a Human Puppet's Limbs. In Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI'16). ACM, 506--511. http://dx.doi.org/10.1145/2839462.2856531  ",
      "doi": "10.1145/2839462.2856531"
    },
    {
      "text": "Nike. 2012. Nike+. Retrieved September 1, 2013 from http://nikeplus.nike.com",
      "doi": ""
    },
    {
      "text": "Stina Nylander, Jakob Tholander, Florian Mueller and Joe Marshall. 2015. Hci and Sports. interactions 22, 2: 30--31. http://dx.doi.org/10.1145/2559206.2559223  ",
      "doi": "10.1145/2559206.2559223"
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2013. 4 Design Themes for Skateboarding. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI'13). ACM, 1271--1274. https://doi.org/10.1145/2470654.2466165  ",
      "doi": "10.1145/2470654.2466165"
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2014. Designing Interactive Technology for Skateboarding. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI'14). ACM, 141--148. http://dx.doi.org/10.1145/2540930.2540950  ",
      "doi": "10.1145/2540930.2540950"
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler and Phoebe Sengers. 2011. Fit4life: The Design of a Persuasive Technology Promoting Healthy Behavior and Ideal Weight. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11). ACM, 423432. http://dx.doi.org/10.1145/1978942.1979003  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Yvonne Rogers. 2014. Mindless or Mindful Technology? In Proceedings of the 2014 ACM SIGCHI symposium on Engineering interactive computing systems. ACM, 241--241. http://dx.doi.org/10.1145/2607023.2611428  ",
      "doi": "10.1145/2607023.2611428"
    },
    {
      "text": "Alyson Ross and Sue Thomas. 2010. The Health Benefits of Yoga and Exercise: A Review of Comparison Studies. The journal of Alternative and complementary medicine 16, 1: 3--12. ",
      "doi": ""
    },
    {
      "text": "m.c. schraefel. 2015. From Field to Office: Translating Brain-Body Benefits from Sport to Knowledge Work. interactions 22, 2: 32--35. http://dx.doi.org/10.1145/2732479  ",
      "doi": "10.1145/2732479"
    },
    {
      "text": "Elena Marquez Segura, Annika Waern, Jin Moen and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI'13). ACM, 33653374. http://dx.doi.org/10.1145/2470654.2466461  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Jennifer Sheridan and Florian Mueller. 2010. Fostering Kinesthetic Literacy through Exertion Games. In Workshop on Whole-Body Interactions at CHI'10: International Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Frank Smith. 2016. Could Hololens' Augmented Reality Change How We Study the Human Body? Retrieved September 1, 2016 from http://www.edtechmagazine.com/higher/article/2016/0 4/university-testing-limits-hololens-augmented-reality.",
      "doi": ""
    },
    {
      "text": "Tadeusz Stach, Nicholas Graham, Jeffrey Yim and Ryan Rhodes. 2009. Heart Rate Control of Exercise Video Games. In Proceedings of Graphics Interface 2009. Canadian Information Processing Society, 125132.",
      "doi": "10.5555/1555880.1555912"
    },
    {
      "text": "Chek Tien Tan, Richard Byrne, Simon Lui, Weilong Liu and Florian Mueller. 2015. Joggar: A MixedModality Ar Approach for Technology-Augmented Jogging. In Proceedings of SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications. ACM, 1. http://dx.doi.org/10.1145/2818427.2818434  ",
      "doi": "10.1145/2818427.2818434"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, 2913--2922. https://doi.org/10.1145/2702123.2702482  ",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Tammy Toscos, Anne Faber, Shunying An and Mona Praful Gandhi. 2006. Chick Clique: Persuasive Technology to Motivate Teenage Girls to Exercise. In Proceedings of CHI '06 Extended Abstracts on Human Factors in Computing Systems. ACM, 1873--1878. http://dx.doi.org/10.1145/1125451.1125805.  ",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "Jelle van Dijk, Remko van der Lugt and Caroline Hummels. 2014. Beyond Distributed Representation: Embodied Cognition Design Supporting SocioSensorimotor Couplings. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI'14). ACM, 181--188. https://doi.org/10.1145/2540930.2540934",
      "doi": "10.1145/2540930.2540934"
    },
    {
      "text": "Wouter Walmink, Danielle Wilde and Florian Mueller. 2014. Displaying Heart Rate Data on a Bicycle Helmet to Support Social Exertion Experiences. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI'14). ACM, 97--104. http://dx.doi.org/10.1145/2540930.2540970  ",
      "doi": "10.1145/2540930.2540970"
    },
    {
      "text": "Jin Wang, Mary She, Saeid Nahavandi and Abbas Kouzani. 2010. A Review of Vision-Based Gait Recognition Methods for Human Identification. In Proceedings of the International Conference on Digital Image Computing: Techniques and Applications (DICTA), IEEE, 320--327. https://doi.org/10.1109/DICTA.2010.62  ",
      "doi": "10.1109/DICTA.2010.62"
    },
    {
      "text": "Mark Weiser. 1993. Some Computer Science Issues in Ubiquitous Computing. Communications of the ACM 36, 7: 75--84.  ",
      "doi": "10.1145/159544.159617"
    },
    {
      "text": "Jeffrey Yim and T. C. Nicholas Graham. 2007. Using Games to Increase Exercise Motivation. In Proceedings of the 2007 conference on Future Play. ACM, 166--173. http://dx.doi.org/10.1145/1328202.1328232  ",
      "doi": "10.1145/1328202.1328232"
    },
    {
      "text": "Damon. Young. 2014. How to Think About Exercise: The School of Life. Pan Macmillan UK.",
      "doi": ""
    }
  ]
}