{
  "doi": "10.1145/3025453.3025682",
  "title": "Situated Anonymity: Impacts of Anonymity, Ephemerality, and Hyper-Locality on Social Media",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6912-6924",
  "year": 2017,
  "badges": [],
  "abstract": "Anonymity, ephemerality, and hyper-locality are an uncommon set of features in the design of online communities. However, these features were key to Yik Yak's initial success and popularity. In an interview-based study, we found that these three features deeply affected the identity of the community as a whole, the patterns of use, and the ways users committed to this community. We conducted interviews with 18 Yik Yak users on an urban American university campus and found that these three focal design features contributed to casual commitment, transitory use, and emergent community identity. We describe situated anonymity, which is the result of anonymity, ephemerality, and hyper-locality coexisting as focal design features of an online community. This work extends our understanding of use and identity-versus-bond based commitment, which has implications for the design and study of other atypical online communities.",
  "authors": [
    {
      "name": "Ari Schlesinger",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-99659161054/rel-imgonly/ari_cover_square.png",
      "acmid": "99659161054",
      "orcid": "missing"
    },
    {
      "name": "Eshwar Chandrasekharan",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163032",
      "orcid": "missing"
    },
    {
      "name": "Christina A. Masden",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959148157",
      "orcid": "missing"
    },
    {
      "name": "Amy S. Bruckman",
      "institution": "Georgia Institute of Technology, Atlanta, USA",
      "img": "/do/10.1145/contrib-81100562702/rel-imgonly/asb-summer08-cropped.jpg",
      "acmid": "81100562702",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Rebecca E. Grinter",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    }
  ],
  "references": [
    {
      "text": "Liam J. Bannon. 2006. Forgetting as a feature, not a bug: the duality of memory and implications for ubiquitous computing. CoDesign 2, 1: 3--15.",
      "doi": ""
    },
    {
      "text": "Eric Baumer and Phil Adams. 2013. Limiting, Leaving, and (re)Lapsing: An Exploration of Facebook Non-Use Practices and Experiences. Proceedings of the SIGCHI conference on human factors in computing systems., ACM.  ",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Eric P. S. Baumer, Morgan G. Ames, Jenna Burrell, Jed R. Brubaker, and Paul Dourish. 2015. Why Study Technology Non-Use? First Monday 20, 11.",
      "doi": ""
    },
    {
      "text": "Joseph B. Bayer, Nicole B. Ellison, Sarita Y. Schoenebeck, and Emily B. Falk. 2015. Sharing the small moments: ephemeral social interaction on Snapchat. Information, Communication & Society: 1-- 22.",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Andres Monroy-Hernandez, Drew Harry, Paul Andre, Katrina Panovich, and Greg Vargas. 2011. 4chan and /b/: An Analysis of Anonymity and Ephemerality in a Large Online Community. Proceedings of the Fifth International AAAI Conference on Weblogs and Social Media, Coleman: 50--57.",
      "doi": ""
    },
    {
      "text": "Jeremy Birnholtz, Nicholas Aaron, Ross Merola, and Arindam Paul. 2015. \"Is it Weird to Still Be a Virgin?\" Anonymous, Locally Targeted Questions on Facebook Confession Boards. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2613--2622.  ",
      "doi": "10.1145/2702123.2702410"
    },
    {
      "text": "Jean-François Blanchette and Deborah G. Johnson. 2002. Data retention and the panoptic society: The social benefits of forgetfulness. The Information Society 18, 1: 33--45.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 3: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Jed R. Brubaker, Mike Ananny, and Kate Crawford. 2014. Departing glances: a sociotechnical account of \"leaving\" grindr. New Media & Society, July.",
      "doi": ""
    },
    {
      "text": "Amy Bruckman. 2006. A New Perspective on \"Community\" and its Implications for ComputerMediated Communication Systems. CHI '06 Extended Abstracts on Human Factors in Computing Systems: 616--621.  ",
      "doi": "10.1145/1125451.1125579"
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 1996. Developing the Blacksburg electronic village. Communications of the ACM 39, 12: 69--74.  ",
      "doi": "10.1145/240483.240498"
    },
    {
      "text": "Kimberly M. Christopherson. 2007. The positive and negative implications of anonymity in Internet social interactions: \"On the Internet, Nobody Knows You're a Dog.\" Computers in Human Behavior 23, 6: 3038-- 3056.  ",
      "doi": "10.1016/j.chb.2006.09.001"
    },
    {
      "text": "Denzil Correa, Leandro Araújo Silva, Mainack Mondal, Fabrício Benevenuto, and Krishna P. Gummadi. 2015. The Many Shades of Anonymity: Characterizing Anonymous Social Media Content. Ninth International AAAI Conference on Web and Social Media: 71--80.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Rosta Farzan, Robert Kraut, and Tom Postmes. 2012. Fresh Faces in the Crowd: Turnover, Identity, and Commitment in Online Groups. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW '12, ACM, 245.  ",
      "doi": "10.1145/2145204.2145243"
    },
    {
      "text": "Caitlin Dewey. 2014. How do you solve a problem like Yik Yak? The Washington Post. Retrieved May 20, 2016 from https://www.washingtonpost.com/news/theintersect/wp/2014/10/07/how-do-you-solve-a-problem-like-yik-yak/",
      "doi": ""
    },
    {
      "text": "Sheena L. Erete. 2015. Engaging Around Neighborhood Issues. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15: 1590--1601.  ",
      "doi": "10.1145/2675133.2675182"
    },
    {
      "text": "Sheena L. Erete, Ryan Miller, and Dan a. Lewis. 2014. Differences in technology use to support community crime prevention. Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing CSCW Companion '14: 153--156.  ",
      "doi": "10.1145/2556420.2556499"
    },
    {
      "text": "Sheena Lewis Erete. 2013. Protecting the Home: Exploring the Roles of Technology and Citizen Activism from a Burglar's Perspective. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2507--2516.  ",
      "doi": "10.1145/2470654.2481347"
    },
    {
      "text": "Sheena Erete, Love Nicole, Jesse Mumm, Anfal Boussayoud, and Ihudiya Finda Ogbonnaya-Ogburu. 2016. \"That Neighborhood is Sketchy!\": Examining Online Conversations About Social Disorder in Transitioning Neighborhoods. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 1180--1186.  ",
      "doi": "10.1145/2851581.2892550"
    },
    {
      "text": "Eric Gordon and Adriana de Souza e Silva. 2011. Net Locality: Why Location Matters in a Networked World. Wiley Publishing. ",
      "doi": "10.5555/2028611"
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E Grinter. 2008. EatWell: Sharing Nutrition-related Memories in a Low-income Community. Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, ACM, 87--96.  ",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Gunnthorunn Gudmundsdottir. 2014. The Online Self: Memory and Forgetting in the Digital Age. European Journal of Life Writing 3.",
      "doi": ""
    },
    {
      "text": "Keith N. Hampton. 2003. Grieving for a lost network: collective action in a wired suburb special issue: ICTs and community networking. The Information Society 19, 5: 417--428.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai. 2007. Whose Space? Differences Among Users and Non-Users of Social Network Sites. Journal of Computer-Mediated Communication 13, 1: 276--297.  ",
      "doi": "10.1111/j.1083-6101.2007.00396.x"
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing space. Proceedings of the 1996 ACM conference on Computer supported cooperative work - CSCW '96 7: 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Stephen C. Hayne and Ronald E. Rice. 1997. Attribution Accuracy When Using Anonymity in Group Support Systems. International Journal of Human-Computer Studies 47: 429--452.  ",
      "doi": "10.1006/ijhc.1997.0134"
    },
    {
      "text": "Matthew Heston and Jeremy Birnholtz. 2016. (In)visible Cities: An Exploration of Social Identity, Anonymity and Location-Based Filtering on Yik Yak. iConference 2016 Proceedings.",
      "doi": ""
    },
    {
      "text": "Hyukjae Jang, Sungwon Peter Choe, and Junehwa Song. 2011. Exploring Serendipitous Social Networks: Sharing Immediate Situations Among Unacquainted Individuals. Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, ACM, 513--516.  ",
      "doi": "10.1145/2037373.2037449"
    },
    {
      "text": "Leonard M. Jessup and Joey F. George. 1997. Theoretical and Methodological Issues in Group Support Systems Research Learning from Groups Gone Away. Small Group Research 28, 3: 394--413.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Sara Kiesler, and Kate Sutton. 2016. Strangers on your phone: Why people use anonymous communication applications. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, 359--370.  ",
      "doi": "10.1145/2818048.2820081"
    },
    {
      "text": "Amy Jo Kim. 2000. Community Building on the Web: Secret Strategies for Successful Online Communities. Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA. ",
      "doi": "10.5555/518514"
    },
    {
      "text": "Robert E. Kraut and Paul Resnick. 2012. Building Successful Online Communities: Evidence Based Social Design. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Cliff Lampe, Jessica Vitak, and Nicole B. Ellison. 2013. Users and nonusers: interactions between levels of adoption and social capital. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13: 809--820.  ",
      "doi": "10.1145/2441776.2441867"
    },
    {
      "text": "Alex Leavitt. 2015. \"This is a Throwaway Account\": Temporary Technical Identities and Perceptions of Anonymity in a Massive Online Community. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15: 317--327.  ",
      "doi": "10.1145/2675133.2675175"
    },
    {
      "text": "W. Robert Leskovich. 2015. Yik Yak: a social media sensor. Proc. SPIE 9499: 949904--949909.",
      "doi": ""
    },
    {
      "text": "Sheena Lewis and Dan A. Lewis. 2012. Examining Technology That Supports Community Policing. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, ACM, 1371.  ",
      "doi": "10.1145/2207676.2208595"
    },
    {
      "text": "Yvonna S. Lincoln and Egon G. Guba. 1985. Naturalistic inquiry. Sage, Beverly Hills, CA.",
      "doi": ""
    },
    {
      "text": "Claudia a. López and Brian S. Butler. 2013. Consequences of content diversity for online public spaces for local communities. Proceedings of the 2013 conference on Computer supported cooperative work CSCW '13: 673.  ",
      "doi": "10.1145/2441776.2441851"
    },
    {
      "text": "Claudia López and Rosta Farzan. 2015. Lend me sugar, I am your neighbor! A content analysis of online forums for local communities. Proceedings of the 7th International Conference on Communities and Technologies, ACM, 59--68.  ",
      "doi": "10.1145/2768545.2768558"
    },
    {
      "text": "Claudia López and Rosta Farzan. 2015. Exploring the Mechanisms Behind the Assessment of Usefulness of Restaurant Reviews. Proceedings of the 7th International Conference on Communities and Technologies, ACM, 19--27.  ",
      "doi": "10.1145/2768545.2768557"
    },
    {
      "text": "Pamela J Ludford, Reid Priedhorsky, Ken Reily, and Loren Terveen. 2007. Capturing, Sharing, and Using Local Place Information. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1235--1244.  ",
      "doi": "10.1145/1240624.1240811"
    },
    {
      "text": "Jonathan Mahler. 2015. Who Spewed That Abuse? Anonymous Yik Yak App Isn't Telling. The New York Times.",
      "doi": ""
    },
    {
      "text": "Christina A. Masden, Catherine Grevet, Rebecca E. Grinter, Eric Gilbert, and W. Keith Edwards. 2014. Tensions in scaling-up community social media. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM, 3239--3248.  ",
      "doi": "10.1145/2556288.2557319"
    },
    {
      "text": "Viktor Mayer-Schönberger. 2009. Delete: The virtue of forgetting in the digital age. Princeton University Press. ",
      "doi": "10.5555/1804518"
    },
    {
      "text": "Grant McKenzie, Benjamin Adams, and Krzysztof Janowicz. 2015. Of Oxen and Birds: Is Yik Yak a useful new data source in the geosocial zoo or just another Twitter? Proceedings of the 8th ACM SIGSPATIAL International Workshop on LocationBased Social Networks - LBSN'15: 1--4.  ",
      "doi": "10.1145/2830657.2830659"
    },
    {
      "text": "Poppy Lauretta McLeod. 1997. A Comprehensive Model of Anonymity in Computer-supported Group Decision Making. Proceedings of the Eighteenth International Conference on Information Systems, Association for Information Systems, 223--234. ",
      "doi": "10.5555/353071.353124"
    },
    {
      "text": "David R. Millen and John F. Patterson. 2002. Stimulating Social Engagement in a Community Network. Proceedings of the 2002 ACM conference on...: 306--313.  ",
      "doi": "10.1145/587078.587121"
    },
    {
      "text": "Casey Newton. 2016. Yik Yak lays off 60 percent of employees as growth collapses. The Verge. Retrieved January 4, 2017 from http://www.theverge.com/2016/12/8/13887622/yikyak-layoffs-growth-collapse",
      "doi": ""
    },
    {
      "text": "Claudia Niederee, Nattiya Kanhabua, Francesco Gallo, and Robert H. Logie. 2015. Forgetful Digital Memory: Towards Brain-Inspired Long-Term Data and Information Management. SIGMOD Rec. 44, 2: 41--46.  ",
      "doi": "10.1145/2814710.2814718"
    },
    {
      "text": "Helen Nissenbaum. 1999. The Meaning of Anonymity in an Information Age. The Information Society: An International Journal 15, 2: 141--144.",
      "doi": ""
    },
    {
      "text": "Kathryn M. Northcut. 2015. Dark Side or Insight? Yik Yak and Culture on Campus. 2015 IEEE International Professional Communication Conference (IPCC): 1--5.",
      "doi": ""
    },
    {
      "text": "Ray Oldenburg. 1999. The Great Good Place: Cafés, Coffee Shops, Bookstores, Bars, Hair Salons, and Other Hangouts at the Heart of a Community. Da Capo Press.",
      "doi": ""
    },
    {
      "text": "Jessica Annette Pater, Yacin Nadji, Elizabeth Mynatt, and Amy S. Bruckman. 2014. Just Awful Enough: The Functional Dysfunction of the Something Awful Forums. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems: 2407--2410.  ",
      "doi": "10.1145/2556288.2557193"
    },
    {
      "text": "Ângela Guimarães Pereira, Lucia Vesnić-Alujević, and Alessia Ghezzi. 2014. The Ethics of Forgetting and Remembering in the Digital World through the Eye of the Media. In The Ethics of Memory in a Digital Age. Springer, 9--27.",
      "doi": ""
    },
    {
      "text": "Sarah Perez. 2015. Amid Bullying & Threats Of Violence, Anonymous Social App Yik Yak Shuts Off Access To U.S. Middle & High School Students. Tech Crunch.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, Robert Kraut, Sara Kiesler, and Paul Resnick. 2012. Encouraging Commitment in Online Communities. In Building Successful Online Communities: Evidence-Based Social Design. 77--125.",
      "doi": ""
    },
    {
      "text": "Paul Resnick and Robert Kraut. 2012. Introduction. In Building Successful Online Communities: EvidenceBased Social Design. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Everett M. Rogers, Lori Collins-Jarvis, and Joseph Schmitz. 1994. The PEN project in Santa Monica: interactive communication, equality, and political action. Journal of the American Society for Information Science 45, 6: 401.  ",
      "doi": "10.1002/%28SICI%291097-4571%28199407%2945%3A6%253C401%3A%3AAID-ASI6%253E3.0.CO%3B2-N"
    },
    {
      "text": "Christine Satchell and Paul Dourish. 2009. Beyond The User: Use And Non-Use in HCI. Proceedings of the 21st Annual Conference of the Australian ComputerHuman Interaction Special Interest Group: Design: Open 24/7, November: 9-16.  ",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2013. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom.com. ICWSM, 555--562.",
      "doi": ""
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2014. Giving up Twitter for Lent: How and Why We Take Breaks from Social Media. Proceedings of the 32nd annual ACM conference CHI 2014: 1--10.  ",
      "doi": "10.1145/2556288.2556983"
    },
    {
      "text": "Raz Schwartz and Germaine R. Halegoua. 2014. The Spatial Self: Location-Based Identity Performance on Social Media. New media & society.",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2013. Interviewing as Qualitative Research. Teachers College Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Eric Stoller. 2015. Don't Ban Yik Yak. Inside Higher Ed. Retrieved May 20, 2016 from https://www.insidehighered.com/blogs/student-affairs-and-technology/dont-ban-yik-yak",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The Online Disinhibition Effect. Cyberpsychology & behavior 7, 3: 321--326.",
      "doi": ""
    },
    {
      "text": "Joseph S. Valacich, Leonard M. Jessup, Alan R. Dennis, and J. F. Nunamaker Jr. 1992. A conceptual framework of anonymity in group support systems. Group Decision and Negotiation 1, 3: 219--241.",
      "doi": ""
    },
    {
      "text": "Gang Wang, Bolun Wang, Tianyi Wang, Ana Nika, Haitao Zheng, and Ben Y. Zhao. 2014. Whispers in the Dark: Analysis of an Anonymous Social Network. Proceedings of the 2014 Conference on Internet Measurement Conference - IMC '14, OCTOBER: 137--150.  ",
      "doi": "10.1145/2663716.2663728"
    },
    {
      "text": "Suzanne Weisband. 1993. Overcoming social awareness in computer-supported groups. Computer Supported Cooperative Work (CSCW) 2, 4: 285--297.",
      "doi": ""
    },
    {
      "text": "Bin Xu, Pamara Chang, Christopher L. Welker, Natalya N. Bazarova, and Dan Cosley. 2016. Automatic Archiving Versus Default Deletion: What Snapchat Tells Us About Ephemerality in Design. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, ACM, 1662--1675.  ",
      "doi": "10.1145/2818048.2819948"
    },
    {
      "text": "2014. Yik Yak Moves Into Top 10 Social Media Apps. Yik Yaker. Retrieved November 29, 2014 from https://web.archive.org/20141208095159/http://yikyaker.com/yik-yak-moves-top-10-social-media-apps/",
      "doi": ""
    }
  ]
}