{
  "doi": "10.1145/3025453.3025856",
  "title": "Toward Harmonizing Self-reported and Logged Social Data for Understanding Human Behavior",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2233-2238",
  "year": 2017,
  "badges": [],
  "abstract": "While self-reporting remains the most common method to understand human behavior, recent advances in social networks, mobile technologies, and other computer-mediated communication technologies are allowing researchers to obtain detailed logs of human behavior with ease. While the logged data is very useful (and accurate) at capturing the structure of the user's social network, the self-reported data provides an insight into the user's cognitive map of her social network. Based on a field study involving 47 users for a period of ten weeks we report that combining the two sets of data (self-reported and logged) gives higher predictive power than using either one of them individually. Further, the difference between the two types of values captures the level of dissonance between a user's actual and perceived social behavior and is found to be an important predictor of the person's social outcomes including social capital, social support and trust.",
  "authors": [
    {
      "name": "Vivek K. Singh",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409595497",
      "orcid": "missing"
    },
    {
      "name": "Arushi Jain",
      "institution": "Indian Institute of Technology, Kanpur, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660179368",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beranrd, H., Killworth, P. & Sailer, L., 1982. Informant Accuracy in Social-Network Data V: An Experimental Attempt to Predict Actual Communication from Recall Data. Social Science Research, 11(1), pp. 30--66. ",
      "doi": ""
    },
    {
      "text": "Bernard, H., Killworth, P., Kronenfeld, D. & Sailer , L., 1984. The problem of informant accuracy: The validity of retrospective data. Annual review of anthropology, pp. 495--517. ",
      "doi": ""
    },
    {
      "text": "Boase , J. & Ling, R., 2013. Measuring mobile phone use: Self report versus log data. Journal of Computer Mediated Communication, 18(4), pp. 508--519. ",
      "doi": ""
    },
    {
      "text": "Brewer, D. D., 2000. Forgetting in the recall-based elicitation of personal and social networks. Social networks, 22(1), pp. 29--43. ",
      "doi": ""
    },
    {
      "text": "Brewer, d. D. et al., 1998. Comparison of direct estimate and partner elicitation methods for measuring the number of sexual and injection partners.. In 126th Annual Meeting of the American Public Health Association..",
      "doi": ""
    },
    {
      "text": "Brewer, D. D. & Webster, C. M., 2000. Forgetting of friends and its effects on measuring friendship networks. Social Networks, 21(4), pp. 361--373. ",
      "doi": ""
    },
    {
      "text": "Corman, S. R. & Bradford, L., 1993. Situational effects on the accuracy of self-reported organizational communication behavior. Communication Research , 20(6), pp. 822--840. ",
      "doi": ""
    },
    {
      "text": "Haselton, M. G., Nettle, D. & Murray, D. R., 2005. The evolution of cognitive bias. The handbook of evolutionary psychology.",
      "doi": ""
    },
    {
      "text": "Herbert, B., Fiedler, K. & Strack, F., 2004. Social cognition: How individuals construct social reality. s.l.:Psychology Press.",
      "doi": ""
    },
    {
      "text": "Jones, L. M. & Claude S., F., 1978. Studying egocentric networks by mass survey.",
      "doi": ""
    },
    {
      "text": "Karckhardt, D., 1992. The strength of strong ties: The importance of philos in organizations. Networks and organizations: Structure, form, and action, Volume 216, p. 239.",
      "doi": ""
    },
    {
      "text": "Killworth, P. & Bernard, H., 1980. Informant accuracy in social network data III: A comparison of triadic structure in behavioral and cognitive data. Social Networks, 2(1), pp. 19--46. ",
      "doi": ""
    },
    {
      "text": "Killworth, P., Bernard, H. & Sailer, L., 1980. Informant accuracy in social network data IV: A comparison of clique-level structure in behavioral and cognitive network data. Social Networks, 2(3), pp. 191--218.",
      "doi": ""
    },
    {
      "text": "Kleim, B., Thorn, H. & Ehlert, U., 2014. Positive interpretation bias predicts well-being in medical interns. Frontiers in psychology, Volume 5. ",
      "doi": ""
    },
    {
      "text": "Kobayashi, K. & Boase, J., 2012. No such effect? The implications of measurement error in self-report measures of mobile communication use. Communication Methods and Measures, 6(2), pp. 126143. ",
      "doi": ""
    },
    {
      "text": "Liberman , C. J., 2008. Why communication networks might impact employee identification with one or more organizational targets. s.l.:ProQuest.",
      "doi": ""
    },
    {
      "text": "Marsden, P., 1990. Network data and measurement. Annual review of sociology, pp. 435--463. ",
      "doi": ""
    },
    {
      "text": "Moller, A. et al., 2013. Investigating self-reporting behavior in long-term studies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 2931--2940.  ",
      "doi": "10.1145/2470654.2481406"
    },
    {
      "text": "Pasch, . M., 2010. Improving children's self-report in user-centered evaluations. Proceedings of the 9th International Conference on Interaction Design and Children, pp. 331--334.  ",
      "doi": "10.1145/1810543.1810606"
    },
    {
      "text": "Poole, I. & Kochen, M., 1978. Contracts and Influence. Social Networks, Volume 1, pp. 5--51. ",
      "doi": ""
    },
    {
      "text": "Roberts, S. G. & Dunbar, . R. I., 2011. Communication in social networks: Effects of kinship, network size, and emotional closeness. Personal Relationships, 18(3), pp. 439--452. ",
      "doi": ""
    },
    {
      "text": "Samkange-Zeeb, F. & Gabriele, B., 2004. Validation of self-reported cellular phone use.. Journal of Exposure Science and Environmental Epidemiology , 14(3), pp. 245--248. ",
      "doi": ""
    },
    {
      "text": "Schweizer, K., Beck-Seyffer, A. & Schneider, R., 1999. Cognitive bias of optimism and its influence on psychological well-being. Psychological Reports, 84(2), pp. 627--636. ",
      "doi": ""
    },
    {
      "text": "Sherbourne, C. D. & Stewart, A. L., 1991. The MOS social support survey. Social science & medicine , 32(6), pp. 705--714. ",
      "doi": ""
    },
    {
      "text": "Shiraishi, . M. et al., 2009. Tracking behavior in persuasive apps: is sensor-based detection always better than user self-reporting?. In CHI'09 Extended Abstracts on Human Factors in Computing Systems, pp. 40454050.  ",
      "doi": "10.1145/1520340.1520615"
    },
    {
      "text": "Tibshirani, R., 1996. Regression shrinkage and selection via the lasso. Series B (Methodological), pp. 267--288.",
      "doi": ""
    },
    {
      "text": "Toshio, Y., 1986. The provision of a sanctioning system as a public good. Journal of Personality and social Psychology, 51(1), p. 110. ",
      "doi": ""
    },
    {
      "text": "Williams, M. D. & Hollan, J. D., 1981. The process of retrieval from very long-term memory. Cognitive science, 5(2), pp. 87--119. ",
      "doi": ""
    },
    {
      "text": "Yamagishi, T. & Yamagishi, M., 1994. Trust and commitment in the USA and Japan. Motivation and emotion, 18(2), pp. 129--166. ",
      "doi": ""
    },
    {
      "text": "Eagle, Nathan, and Alex Sandy Pentland. \"Reality mining: sensing complex social systems.\" Personal and ubiquitous computing 10.4 (2006): 255--268.  ",
      "doi": "10.1007/s00779-005-0046-3"
    },
    {
      "text": "Thomée, Sara, Annika Härenstam, and Mats Hagberg. \"Mobile phone use and stress, sleep disturbances, and symptoms of depression among young adults-a prospective cohort study.\" BMC public health 11.1 (2011): 1.",
      "doi": ""
    },
    {
      "text": "Williams, D. (2006). On and off the 'Net: Scales for social capital in an online era. Journal of Computer Mediated Communication, 11(2), 593--628. ",
      "doi": ""
    }
  ]
}