{
  "doi": "10.1145/3025453.3025492",
  "title": "Celebratory Technology to Orchestrate the Sharing of Devices and Stories during Family Mealtimes",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6960-6972",
  "year": 2017,
  "badges": [],
  "abstract": "While the idea of \"celebratory technologies\" during family mealtimes to support positive interactions at the dinner table is promising, there are few studies that investigate how these technologies can be meaningfully integrated into family practices. This paper presents the deployment of Chorus - a mealtime technology that orchestrates the sharing of personal devices and stories during family mealtimes, explores related content from all participants' devices, and supports revisiting previously shared content. A three-week field deployment with seven families shows that Chorus augments family interactions through sharing contents of personal and familial significance, supports togetherness and in-depth discussion by combining resources from multiple devices, helps to broach sensitive topics into familial conversation, and encourages participation from all family members including children. We discuss implications of this research and reflect on design choices and opportunities that can further enhance the family mealtime experience.",
  "authors": [
    {
      "name": "Hasan Shahid Ferdous",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81467669958/rel-imgonly/9253_10151240800160126_311432181_n.jpg",
      "acmid": "81467669958",
      "orcid": "missing"
    },
    {
      "name": "Frank Vetere",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    },
    {
      "name": "Hilary Davis",
      "institution": "The University of Melbourne & Swinburne University of Technology, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483723",
      "orcid": "missing"
    },
    {
      "name": "Bernd Ploderer",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/do/10.1145/contrib-81311485528/rel-imgonly/bp2017-167a8820portrait.jpg",
      "acmid": "81311485528",
      "orcid": "missing"
    },
    {
      "name": "Kenton O'Hara",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Rob Comber",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "Geremy Farr-Wharton",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81552751356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd. 2012. What Next, Ubicomp?: Celebrating an Intellectual Disappearing Act. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/2370216.2370222"
    },
    {
      "text": "Louise Barkhuus and Barry Brown. 2009. Unpacking the Television: User Practices Around a Changing Technology. ACM Trans. Comput.-Hum. Interact. 16, 3, Article 15 (Sept. 2009), 22 pages.  ",
      "doi": "10.1145/1592440.1592444"
    },
    {
      "text": "Alan Beardsworth and Teresa Keil. 2002. Sociology on the Menu: An Invitation to the Study of Food and Society. Routledge.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell. 2006. The age of the thumb: A cultural reading of mobile technologies from Asia. Knowledge, Technology & Policy 19, 2 (2006), 41--57.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell and Joseph Kaye. 2002. Designing Technology for Domestic Spaces: A Kitchen Manifesto. Gastronomica 2, 2 (2002), 46--62.",
      "doi": ""
    },
    {
      "text": "France Bellisle and Anne-Marie Dalix. 2001. Cognitive Restraint can be Offset by Distraction, Leading to Increased Meal Intake in Women. The American Journal of Clinical Nutrition 74, 2 (2001), 197--200.",
      "doi": ""
    },
    {
      "text": "Feiler Bruce. 2015. Should You Google at Dinner? (2015). Retrieved September 09, 2016 from http: //www.nytimes.com/2010/12/12/fashion/12THISLIFE.html",
      "doi": ""
    },
    {
      "text": "Jeffrey M Brunstrom and Gemma L Mitchell. 2006. Effects of Distraction on the Development of Satiety. British Journal of Nutrition 96, 04 (2006), 761--769.",
      "doi": ""
    },
    {
      "text": "Katharine A. Coon, Jeanne Goldberg, Beatrice L. Rogers, and Katherine L. Tucker. 2001. Relationships between Use of Television during Meals and Children's Food Consumption Patterns. Pediatrics 107, 1 (2001).",
      "doi": ""
    },
    {
      "text": "Marjorie L. DeVault. 1994. Feeding the Family: The Social Organization of Caring as Gendered Work. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "DinnerTimePlus. 2014. Developed by ZeroDesktop, Inc. (2014). Retrieved June 11, 2015 from http://www.dinnertimeapp.com",
      "doi": ""
    },
    {
      "text": "Matthew Dunn. 2016. Dolmio pepper grinder \"hacker\" will disable your Wi-Fi for family dinners. (2016). Retrieved September 20, 2016 from https://goo.gl/rg2bQ7",
      "doi": ""
    },
    {
      "text": "Hasan Shahid Ferdous. 2015. Technology at Mealtime: Beyond the \"Ordinary\". In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 195--198.  ",
      "doi": "10.1145/2702613.2702620"
    },
    {
      "text": "Hasan Shahid Ferdous, Bernd Ploderer, Hilary Davis, Frank Vetere, and Kenton O'Hara. 2015. Pairing Technology and Meals: A Contextual Enquiry in the Family Household. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, New York, NY, USA, 370--379.  ",
      "doi": "10.1145/2838739.2838780"
    },
    {
      "text": "Hasan Shahid Ferdous, Bernd Ploderer, Hilary Davis, Frank Vetere, and Kenton O'hara. 2016a. Commensality and the Social Use of Technology During Family Mealtime. ACM Trans. Comput.-Hum. Interact. 23, 6, Article 37 (Dec. 2016), 26 pages.  ",
      "doi": "10.1145/2994146"
    },
    {
      "text": "Hasan Shahid Ferdous, Bernd Ploderer, Hilary Davis, Frank Vetere, Kenton O'Hara, Geremy Farr-Wharton, and Rob Comber. 2016b. TableTalk: Integrating Personal Devices and Content for Commensal Experiences at the Family Dinner Table. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 132--143.  ",
      "doi": "10.1145/2971648.2971715"
    },
    {
      "text": "Claude Fischler. 2011. Commensality, Society and Culture. Social Science Information 50, 3--4 (2011), 528--548.",
      "doi": ""
    },
    {
      "text": "Eileen FitzPatrick, Lynn S Edmunds, and Barbara A Dennison. 2007. Positive effects of family dinner are undone by television viewing. Journal of the American Dietetic Association 107, 4 (2007), 666--671.",
      "doi": ""
    },
    {
      "text": "Jayne A. Fulkerson, Mary Story, Dianne Neumark-Sztainer, and Sarah Rydell. 2008. Family Meals: Perceptions of Benefits and Challenges among Parents of 8-to 10-Year-Old Children. Journal of the American Dietetic Association 108, 4 (2008), 706--709.",
      "doi": ""
    },
    {
      "text": "Sangita Ganesh, Paul Marshall, Yvonne Rogers, and Kenton O'Hara. 2014. FoodWorks: Tackling Fussy Eating by Digitally Augmenting Children's Meals. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 147--156.  ",
      "doi": "10.1145/2639189.2639225"
    },
    {
      "text": "Catherine Grevet, Anthony Tang, and Elizabeth Mynatt. 2012. Eating Alone, Together: New Forms of Commensality. In Proceedings of the 17th ACM International Conference on Supporting Group Work (GROUP '12). ACM, New York, NY, USA, 103--106.  ",
      "doi": "10.1145/2389176.2389192"
    },
    {
      "text": "Andrea Grimes and Richard Harper. 2008. Celebratory Technology: New Directions for Food Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 467--476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Andrea Grimes, Desney Tan, and Dan Morris. 2009. Toward Technologies That Support Family Reflections on Health. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (GROUP '09). ACM, New York, NY, USA, 311--320.  ",
      "doi": "10.1145/1531674.1531721"
    },
    {
      "text": "Florian Güldenpfennig and Geraldine Fitzpatrick. 2015. Personal Digital Archives on Mobile Phones with MEO. Personal Ubiquitous Comput. 19, 2 (Feb. 2015), 445--461.  ",
      "doi": "10.1007/s00779-014-0802-3"
    },
    {
      "text": "Reiko Hamada, Jun Okabe, Ichiro Ide, Shin'ichi Satoh, Shuichi Sakai, and Hidehiko Tanaka. 2005. Cooking Navi: Assistant for Daily Cooking in Kitchen. In Proceedings of the 13th Annual ACM International Conference on Multimedia (MULTIMEDIA '05). ACM, New York, NY, USA, 371--374.  ",
      "doi": "10.1145/1101149.1101228"
    },
    {
      "text": "Ellie Harmon and Melissa Mazmanian. 2013. Stories of the Smartphone in Everyday Discourse: Conflict, Tension & Instability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1051--1060.  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "James C. Hersey and Amy Jordan. 2007. Reducing Children's TV Time to Reduce the Risk of Childhood Overweight: The Children's Media Use Study. Centers for Disease Control and Prevention (2007).",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sarita Y. Schoenebeck, and Julie A. Kientz. 2016. Not at the Dinner Table: Parents' and Children's Perspectives on Family Technology Rules. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1376--1389.  ",
      "doi": "10.1145/2818048.2819940"
    },
    {
      "text": "Annika Hupfeld and Tom Rodden. 2012. Laying the Table for HCI: Uncovering Ecologies of Domestic Food Consumption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 119--128.  ",
      "doi": "10.1145/2207676.2207694"
    },
    {
      "text": "Robert W Jeffery and Simone A French. 1998. Epidemic obesity in the USA: are fast foods and television viewing contributing? American journal of public health 88, 2 (1998), 277--280.",
      "doi": ""
    },
    {
      "text": "Deni Kirkova. 2013. Is This the Death of the Dining Table? Now SIX Out of Ten Meals are Eaten in Front of the Television. (Mar 2013). Retrieved June 11, 2015 from http://goo.gl/2RMNbg",
      "doi": ""
    },
    {
      "text": "Walter Kirkpatrick Lacey. 1968. Family in Classical Greece. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Reed W. Larson, Kathryn R. Branscomb, and Angela R. Wiley. 2006. Forms and Functions of Family Mealtimes: Multidisciplinary Perspectives. New Directions for Child and Adolescent Development 2006, 111 (2006), 1--15.",
      "doi": ""
    },
    {
      "text": "Eric Laurier and Sally Wiggins. 2011. Finishing the Family Meal. The Interactional Organisation of Satiety. Appetite 56, 1 (2011), 53--64.",
      "doi": ""
    },
    {
      "text": "James Lull. 2014. Inside Family Viewing (Routledge Revivals): Ethnographic Research on Television's Audiences. Routledge.",
      "doi": ""
    },
    {
      "text": "Matthew B. Miles and A. Michael Huberman. 1994. Qualitative Dosata Analysis: An Expanded Sourcebook. Sage.",
      "doi": ""
    },
    {
      "text": "Sidney W. Mintz and Christine M. Du Bois. 2002. The Anthropology of Food and Eating. Annual Review of Anthropology 31, 1 (2002), 99--119.",
      "doi": ""
    },
    {
      "text": "Carol Moser, Sarita Y. Schoenebeck, and Katharina Reinecke. 2016. Technology at the Table: Attitudes About Mobile Phone Use at Mealtimes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1881--1892.  ",
      "doi": "10.1145/2858036.2858357"
    },
    {
      "text": "Mamoun Nawahdah and Tomoo Inoue. 2013. Virtually Dining Together in Time-shifted Environment: KIZUNA Design. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 779--788.  ",
      "doi": "10.1145/2441776.2441863"
    },
    {
      "text": "Elinor Ochs and Merav Shohet. 2006. The Cultural Structuring of Mealtime Socialization. New Directions for Child and Adolescent Development 2006, 111 (2006), 35--49.",
      "doi": ""
    },
    {
      "text": "Kenton O'Hara, John Helmes, Abigail Sellen, Richard Harper, Martijn ten Bhömer, and Elise van den Hoven. 2012. Food for Talk: Phototalk in the Context of Sharing a Meal. Human-Computer Interaction 27, 1--2 (2012), 124--150.",
      "doi": ""
    },
    {
      "text": "Takashi Ohta and Jun Tanaka. 2012. Pinch: An Interface That Relates Applications on Multiple Touch-screen by \"Pinching\" Gesture. In Proceedings of the 9th International Conference on Advances in Computer Entertainment (ACE'12). Springer-Verlag, Berlin, Heidelberg, 320--335.  ",
      "doi": "10.1007/978-3-642-34292-9_23"
    },
    {
      "text": "Joanne Orlando. 2016. Tablets at the table can influence child development, not always in a good way. (2016). Retrieved August 15, 2016 from http://goo.gl/DrZoxn",
      "doi": ""
    },
    {
      "text": "Benjamin Poppinga, Stefan Oehmcke, Wilko Heuten, and Susanne Boll. 2013. Storyteller: In-situ Reflection on Study Experiences. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 472--475.  ",
      "doi": "10.1145/2493190.2494655"
    },
    {
      "text": "Jenny S Radesky, Elizabeth Peacock-Chambers, Barry Zuckerman, and Michael Silverstein. 2016. Use of Mobile Technology to Calm Upset Children: Associations With Social-Emotional Development. JAMA pediatrics 170, 4 (2016), 397--399.",
      "doi": ""
    },
    {
      "text": "Lee Rainie and Kathryn Zickuhr. 2015. Americans' Views on Mobile Etiquette. (2015). Retrieved September 06, 2016 from http://www.pewinternet.org/2015/08/26/ americans-views-on-mobile-etiquette/",
      "doi": ""
    },
    {
      "text": "Victoria J. Rideout, Ulla G. Foehr, and Donald F. Roberts. 2010. Generation M {superscript 2}: Media in the Lives of 8-to 18-Year-Olds. Henry J. Kaiser Family Foundation (2010).",
      "doi": ""
    },
    {
      "text": "Sara Rimer. 2009. Play With Your Food, Just Don't Text! (2009). Retrieved September 09, 2016 from http: //www.nytimes.com/2009/05/27/dining/27text.html?_r=0",
      "doi": ""
    },
    {
      "text": "Georg Simmel. 1997. The sociology of the meal.",
      "doi": ""
    },
    {
      "text": "Jeffery Sobal and Mary K Nelson. 2003. Commensal eating patterns: a community study. Appetite 41, 2 (2003), 181--190.",
      "doi": ""
    },
    {
      "text": "Nanette Stroebele and John M. De Castro. 2004. Effect of ambience on food intake and food choice. Nutrition 20, 9 (2004), 821--838.",
      "doi": ""
    },
    {
      "text": "Martin Svensson, Kristina Höök, and Rickard Cöster. 2005. Designing and Evaluating Kalas: A Social Navigation System for Food Recipes. ACM Trans. Comput.-Hum. Interact. 12, 3 (Sept. 2005), 374--400.  ",
      "doi": "10.1145/1096737.1096739"
    },
    {
      "text": "Martijn ten Bhömer, John Helmes, Kenton O'Hara, and Elise van den Hoven. 2010. 4Photos: A Collaborative Photo Sharing Experience. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 52--61.  ",
      "doi": "10.1145/1868914.1868925"
    },
    {
      "text": "Hitomi Tsujita, Svetlana Yarosh, and Gregory D. Abowd. 2010. CU-Later: A Communication System Considering Time Difference. In Proceedings of the 12th ACM International Conference Adjunct Papers on Ubiquitous Computing - Adjunct (UbiComp '10 Adjunct). ACM, New York, NY, USA, 435--436.  ",
      "doi": "10.1145/1864431.1864474"
    },
    {
      "text": "Nancy A. Van House. 2009. Collocated Photo Sharing, Story-telling, and the Performance of Self. Int. J. Hum.-Comput. Stud. 67, 12 (Dec. 2009), 1073--1086.  ",
      "doi": "10.1016/j.ijhcs.2009.09.003"
    },
    {
      "text": "Jun Wei, Adrian David Cheok, and Ryohei Nakatsu. 2012. Let's Have Dinner Together: Evaluate the Mediated Co-dining Experience. In Proceedings of the 14th ACM International Conference on Multimodal Interaction (ICMI '12). ACM, New York, NY, USA, 225--228.  ",
      "doi": "10.1145/2388676.2388721"
    },
    {
      "text": "Jun Wei, Xuan Wang, Roshan Lalintha Peiris, Yongsoon Choi, Xavier Roman Martinez, Remi Tache, Jeffrey Tzu Kwan Valino Koh, Veronica Halupka, and Adrian David Cheok. 2011. CoDine: An Interactive Multi-sensory System for Remote Dining. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, New York, NY, USA, 21--30.  ",
      "doi": "10.1145/2030112.2030116"
    }
  ]
}