{
  "doi": "10.1145/3025453.3025825",
  "title": "Co-3Deator: A Team-First Collaborative 3D Design Ideation Tool",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6581-6592",
  "year": 2017,
  "badges": [],
  "abstract": "We present Co-3Deator, a sketch-based collaborative 3D modeling system based on the notion of \"team-first\" ideation tools, where the needs and processes of the entire design team come before that of an individual designer. Co-3Deator includes two specific team-first features: a concept component hierarchy which provides a design representation suitable for multi-level sharing and reusing of design information, and a collaborative design explorer for storing, viewing, and accessing hierarchical design data during collaborative design activities. We conduct two controlled user studies, one with individual designers to elicit the form and functionality of the collaborative design explorer, and the other with design teams to evaluate the utility of the concept component hierarchy and design explorer towards collaborative design ideation. Our results support our rationale for both of the proposed team-first collaboration mechanisms and suggest further ways to streamline collaborative design.",
  "authors": [
    {
      "name": "Cecil Piya",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501679116",
      "orcid": "missing"
    },
    {
      "name": "Vinayak Krishnamurthy",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659451839",
      "orcid": "missing"
    },
    {
      "name": "Senthil Chandrasegaran",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549216656",
      "orcid": "0000-0003-0561-2148"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    },
    {
      "name": "Karthik Ramani",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502255",
      "orcid": "0000-0001-8639-5135"
    }
  ],
  "references": [
    {
      "text": "Bryan M Blair and Katja Hölttä-Otto. 2012. Comparing the Contribution of the Group to the Initial Idea in Progressive Idea Generation. In Proceedings of the ASME International Design Engineering Technical Conferences and Computers in Engineering Conference.",
      "doi": ""
    },
    {
      "text": "Margaret A Boden. 1996. Dimensions of Creativity. MIT Press.",
      "doi": ""
    },
    {
      "text": "Louis L. Bucciarelli. 1996. Designing Engineers. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/202737"
    },
    {
      "text": "Siddhartha Chaudhuri and Vladlen Koltun. 2010. Data-driven suggestions for creativity support in 3D modeling. ACM Transactions on Graphics 29, 6 (2010), 183.  ",
      "doi": "10.1145/1882261.1866205"
    },
    {
      "text": "Michael Diehl and Wolfgang Stroebe. 1987. Productivity loss in brainstorming groups: Toward the solution of a riddle. Journal of personality and social psychology 53, 3 (1987), 497.",
      "doi": ""
    },
    {
      "text": "Tomás Dorta. 2007. Implementing and assessing the hybrid ideation space: a cognitive artefact for conceptual design. International Journal of Design Sciences and Technology 14, 2 (2007), 119--133.",
      "doi": ""
    },
    {
      "text": "Florian Geyer, Jochen Budzinski, and Harald Reiterer. 2012. IdeaVis: a hybrid workspace and interactive visualization for paper-based collaborative sketching sessions. In Proceedings of the Nordic Conference on Human-Computer Interaction. 331--340.  ",
      "doi": "10.1145/2399016.2399069"
    },
    {
      "text": "Ashok K Goel and Susan Craw. 2005. Design, innovation and case-based reasoning. The Knowledge Engineering Review 20, 03 (2005), 271--276.  ",
      "doi": "10.1017/S0269888906000609"
    },
    {
      "text": "Christopher A Gosnell and Scarlett R Miller. 2016. But Is It Creative? Delineating the Impact of Expertise and Concept Ratings on Creative Concept Selection. Journal of Mechanical Design 138, 2 (2016), 021101.",
      "doi": ""
    },
    {
      "text": "Joy P. Guilford. 1956. The Structure of Intellect. Psychological Bulletin 53, 4 (1956), 267--293.",
      "doi": ""
    },
    {
      "text": "Joshua Hailpern, Erik Hinterbichler, Caryn Leppert, Damon Cook, and Brian P. Bailey. 2007. TEAM STORM: demonstrating an interaction model for working with multiple ideas during creative group work. In Proceedings of the ACM Conference on Creativity & Cognition. 193--202.  ",
      "doi": "10.1145/1254960.1254987"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 2007. Teddy: a sketching interface for 3D freeform design. In Acm SIGGRAPH 2007 Courses. ACM, 21.  ",
      "doi": "10.1145/1281500.1281532"
    },
    {
      "text": "Uma Jayaram, YoungJun Kim, Sankar Jayaram, Venkata K Jandhyala, and Tatsuki Mitsui. 2004. Reorganizing CAD assembly models (as-designed) for manufacturing simulations and planning (as-built). Journal of Computing and Information Science in Engineering 4, 2 (2004), 98--108.",
      "doi": ""
    },
    {
      "text": "Evangelos Kalogerakis, Siddhartha Chaudhuri, Daphne Koller, and Vladlen Koltun. 2012. A probabilistic model for component-based shape synthesis. ACM Transactions on Graphics 31, 4 (2012), 55.  ",
      "doi": "10.1145/2185520.2185551"
    },
    {
      "text": "James McCrae, Nobuyuki Umetani, and Karan Singh. 2014. FlatFitFab: interactive modeling with planar sections. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, 13--22.  ",
      "doi": "10.1145/2642918.2647388"
    },
    {
      "text": "Michael Michalko. 2006. Thinkertoys: A Handbook of Creative-Thinking Techniques. Ten Speed Press.",
      "doi": ""
    },
    {
      "text": "Gioacchino Noris, Daniel S'ykora, A Shamir, Stelian Coros, Brian Whited, Maryann Simmons, Alexander Hornung, M Gross, and R Sumner. 2012. Smart scribbles for sketch segmentation. In Computer Graphics Forum, Vol. 31. Wiley Online Library, 2516--2527.  ",
      "doi": "10.1111/j.1467-8659.2012.03224.x"
    },
    {
      "text": "Luke Olsen, Faramaz Samavati, Mario Costa Sousa, and Joaquim Jorge. 2008. A taxonomy of modeling techniques using sketch-based interfaces. Eurographics State of the Art Reports 1, 1.4 (2008), 1.",
      "doi": ""
    },
    {
      "text": "Johan Ölvander, Björn Lundén, and Hampus Gavel. 2009. A computerized optimization framework for the morphological matrix applied to aircraft conceptual design. Computer-Aided Design 41, 3 (2009), 187--196.  ",
      "doi": "10.1016/j.cad.2008.06.005"
    },
    {
      "text": "Alex F Osborn. 1953. Applied Imagination. Scribner.",
      "doi": ""
    },
    {
      "text": "Gerhard Pahl and Wolfgang Beitz. 1999. Engineering Design: A Systematic Approach (second ed.). Springer.",
      "doi": ""
    },
    {
      "text": "Paul B Paulus, Nicholas W Kohn, and Lauren E Arditti. 2011. Effects of quantity and quality instructions on brainstorming. The Journal of Creative Behavior 45, 1 (2011), 38--46.",
      "doi": ""
    },
    {
      "text": "B. Rohrbach. 1969. Creative nach Regeln: Methode 635, eine neue Technik zum Lösen von Problemen. Absatzwirtschaft 12, 19 (1969), 73--75.",
      "doi": ""
    },
    {
      "text": "Ugo Braga Sangiorgi, François Beuvens, and Jean Vanderdonckt. 2012. User interface design by collaborative sketching. In Proceedings of the ACM Conference on Designing Interactive Systems. 378--387.  ",
      "doi": "10.1145/2317956.2318013"
    },
    {
      "text": "Ryan Schmidt, Brian Wyvill, Mario Costa Sousa, and Joaquim A Jorge. 2007. Shapeshop: Sketch-based solid modeling with blobtrees. In ACM SIGGRAPH 2007 courses. ACM, 43.  ",
      "doi": "10.1145/1281500.1281554"
    },
    {
      "text": "Jami J Shah, Noe Vargas-Hernandez, Joshua D Summers, and Santosh Kulkarni. 2001. Collaborative Sketching (C-Sketch)--An Idea Generation Technique for Engineering Design. Creative Behavior 35, 3 (2001), 168--198.",
      "doi": ""
    },
    {
      "text": "Andrei Sharf, Marina Blumenkrants, Ariel Shamir, and Daniel Cohen-Or. 2006. Snappaste: an interactive technique for easy mesh composition. The Visual Computer 22, 9--11 (2006), 835--844.  ",
      "doi": "10.1007/s00371-006-0068-5"
    },
    {
      "text": "Patrick C Shih, David H Nguyen, Sen H Hirano, David F Redmiles, and Gillian R Hayes. 2009. GroupMind: supporting idea generation through a collaborative mind-mapping tool. In Proceedings of the ACM Conference on Supporting Group Work. ACM, 139--148.  ",
      "doi": "10.1145/1531674.1531696"
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity support tools: Accelerating discovery and innovation. Commun. ACM 50, 12 (2007), 20--32.  ",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Pieter Jan Stappers and James M Hennessey. 1999. Toward electronic napkins and beermats: Computer support for visual ideation skills. In Visual representations and interpretations. Springer, 220--225.",
      "doi": ""
    },
    {
      "text": "Norbert Streitz, Jorg Geissler, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz, and Ralf Steinmetz. 1999. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Christine A Toh and Scarlett R Miller. 2015. How engineering teams select design concepts: A view through the lens of creativity. Design Studies 38 (2015), 111--138.",
      "doi": ""
    },
    {
      "text": "Ellis Paul Torrance. 1968. Torrance Tests of Creative Thinking. Personnel Press Incorporated.",
      "doi": ""
    },
    {
      "text": "Remko van der Lugt. 2003. Relating the quality of the idea generation process to the quality of the resulting design ideas. In Proceedings of the International Conference on Engineering Design.",
      "doi": ""
    },
    {
      "text": "Luke Wroblewski. 2009. Mobile First. http://www.lukew.com/ff/entry.asp?933. (November 2009).",
      "doi": ""
    },
    {
      "text": "Xiaohua Xie, Kai Xu, Niloy J Mitra, Daniel Cohen-Or, Wenyong Gong, Qi Su, and Baoquan Chen. 2013. Sketch-to-Design: Context-Based Part Assembly. In Computer Graphics Forum, Vol. 32. Wiley Online Library, 233--245.",
      "doi": ""
    },
    {
      "text": "Kai Xu, Hao Zhang, Daniel Cohen-Or, and Baoquan Chen. 2012. Fit and diverse: set evolution for inspiring 3D shape galleries. ACM Transactions on Graphics 31, 4 (2012), 57.  ",
      "doi": "10.1145/2185520.2185553"
    },
    {
      "text": "Zhenpeng Zhao, Sriram Karthik Badam, Senthil Chandrasegaran, Deok Gun Park, Niklas Elmqvist, Lorraine Kisselburgh, and Karthik Ramani. 2014. skWiki: a Multimedia Sketching System for Collaborative Creativity. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 1235--1244.  ",
      "doi": "10.1145/2556288.2557394"
    },
    {
      "text": "Fritz Zwicky. 1969. Discovery, Invention, Research through the Morphological Approach. Macmillan.",
      "doi": ""
    }
  ]
}