{
  "doi": "10.1145/3025453.3025684",
  "title": "HapticHead: A Spherical Vibrotactile Grid around the Head for 3D Guidance in Virtual and Augmented Reality",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3729-3740",
  "year": 2017,
  "badges": [],
  "abstract": "Current virtual and augmented reality head-mounted displays usually include no or only a single vibration motor for haptic feedback and do not use it for guidance. We present HapticHead, a system utilizing multiple vibrotactile actuators distributed in three concentric ellipses around the head for intuitive haptic guidance through moving tactile cues. We conducted three experiments, which indicate that HapticHead vibrotactile feedback is both faster (2.6 s vs. 6.9 s) and more precise (96.4% vs. 54.2% success rate) than spatial audio (generic head-related transfer function) for finding visible virtual objects in 3D space around the user. The baseline of visual feedback is as expected more precise (99.7% success rate) and faster (1.3 s) in comparison, but there are many applications in which visual feedback is not desirable or available due to lighting conditions, visual overload, or visual impairments. Mean final precision with HapticHead feedback on invisible targets is 2.3° compared to 0.8° with visual feedback. We successfully navigated blindfolded users to real household items at different heights using HapticHead vibrotactile feedback independently of a head-mounted display.",
  "authors": [
    {
      "name": "Oliver Beren Kaul",
      "institution": "University of Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-99659019796/rel-imgonly/kaulberen2.jpg",
      "acmid": "99659019796",
      "orcid": "missing"
    },
    {
      "name": "Michael Rohs",
      "institution": "University of Hannover, Hannover, Germany",
      "img": "/do/10.1145/contrib-81314494694/rel-imgonly/mr-120.jpg",
      "acmid": "81314494694",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berning, M., Braun, F., Riedel, T., and Beigl, M. ProximityHat. Proceedings of the 2015 ACM International Symposium on Wearable Computers ISWC '15, ACM Press (2015), 31--38.  ",
      "doi": "10.1145/2802083.2802088"
    },
    {
      "text": "Biocca, F., Tang, A., Owen, C., and Xiao, F. Attention funnel: omnidirectional 3D cursor for mobile augmented reality platforms. Proceedings of the SIGCHI conference on Human Factors in computing systems 6, (2006), 1115--1122.  ",
      "doi": "10.1145/1124772.1124939"
    },
    {
      "text": "Cassinelli, A., Reynolds, C., and Ishikawa, M. Augmenting spatial awareness with haptic radar. Proceedings International Symposium on Wearable Computers, ISWC, (2007), 61--64.",
      "doi": ""
    },
    {
      "text": "Cosgun, A., Sisbot, E. A., and Christensen, H. I. Evaluation of rotational and directional vibration patterns on a tactile belt for guiding visually impaired people. IEEE Haptics Symposium, HAPTICS, IEEE Computer Society (2014), 367-- 370. ",
      "doi": ""
    },
    {
      "text": "Dobrzynski, M. K., Mejri, S., Wischmann, S., and Floreano, D. Quantifying Information Transfer Through a Head-Attached Vibrotactile Display: Principles for Design and Control. IEEE Transactions on Biomedical Engineering 59, 7 (2012), 2011--2018. ",
      "doi": ""
    },
    {
      "text": "Van Erp, J. B. F. and Van Veen, H. A. H. C. Vibrotactile in-vehicle navigation system. Transportation Research Part F: Traffic Psychology and Behaviour 7, 4 (2004), 247--256. ",
      "doi": ""
    },
    {
      "text": "Erp, J. B. F. Van, Veen, H. a. H. C. Van, Jansen, C., and Dobbins, T. Waypoint navigation with a vibrotactile waist belt. ACM Transactions on Applied Perception 2, 2 (2005), 106--117.  ",
      "doi": "10.1145/1060581.1060585"
    },
    {
      "text": "Geronazzo, M., Bedin, A., Brayda, L., Campus, C., and Avanzini, F. Interactive spatial sonification for non-visual exploration of virtual maps. International Journal of Human-Computer Studies 85, (2016), 4--15.  ",
      "doi": "10.1016/j.ijhcs.2015.08.004"
    },
    {
      "text": "Gilliland, K. and Schlegel, R. E. Tactile Stimulation of the Human Head for Information Display. Human Factors: The Journal of the Human Factors and Ergonomics Society 36, 4 (1994), 700--717.",
      "doi": ""
    },
    {
      "text": "Israr, A. and Poupyrev, I. Tactile brush. Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11, ACM Press (2011), 2019.  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Kajimoto, H., Kanno, Y., and Tachi, S. Forehead electro-tactile display for vision substitution. Proc EuroHaptics, (2006), 11.",
      "doi": ""
    },
    {
      "text": "Kaul, O. B. and Rohs, M. HapticHead: 3D Guidance and Target Acquisition through a Vibrotactile Grid. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems CHI EA '16, ACM Press (2016), 2533--2539.  ",
      "doi": "10.1145/2851581.2892355"
    },
    {
      "text": "Kerdegari, H., Kim, Y., and Prescott, T. J. HeadMounted Sensory Augmentation Device: Comparing Haptic and Audio Modality. In Springer International Publishing, 2016, 107--118.",
      "doi": ""
    },
    {
      "text": "Kerdegari, H., Kim, Y., Stafford, T., and Prescott, T. J. Centralizing bias and the vibrotactile funneling illusion on the forehead. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Springer Verlag (2014), 55--62. ",
      "doi": ""
    },
    {
      "text": "Klein, F. and Werner, S. Auditory Adaptation to Non-Individual HRTF Cues in Binaural Audio Reproduction. Journal of the Audio Engineering Society 64, 1/2 (2016), 45--54. ",
      "doi": ""
    },
    {
      "text": "Meier, A., Matthies, D. J. C., Urban, B., and Wettach, R. Exploring vibrotactile feedback on the body and foot for the purpose of pedestrian navigation. Proceedings of the 2nd international Workshop on Sensor-based Activity Recognition and Interaction - WOAR '15, ACM Press (2015), 1--11.  ",
      "doi": "10.1145/2790044.2790051"
    },
    {
      "text": "Møller, H., Sørensen, M. F., Jensen, C. B., and Hammershøi, D. Binaural Technique: Do We Need Individual Recordings' Journal of the Audio Engineering Society 44, 6 (1996), 451--469.",
      "doi": ""
    },
    {
      "text": "Myles, K. and Kalb, J. T. Vibrotactile Sensitivity of the Head. 2009.",
      "doi": ""
    },
    {
      "text": "Myles, K. and Kalb, J. T. Guidelines for Head Tactile Communication. 2010.",
      "doi": ""
    },
    {
      "text": "Myles, K., Kalb, J. T., Lowery, J., and Kattel, B. P. The effect of hair density on the coupling between the tactor and the skin of the human head. Applied Ergonomics 48, (2015), 177--185. ",
      "doi": ""
    },
    {
      "text": "Paneels, S., Anastassova, M., Strachan, S., Van, S. P., Sivacoumarane, S., and Bolzmacher, C. What's around me Multi-actuator haptic feedback on the wrist. 2013 World Haptics Conference, WHC 2013, (2013), 407--412. ",
      "doi": ""
    },
    {
      "text": "Pielot, M., Krull, O., and Boll, S. Where is my team? Supporting Situation Awareness with Tactile Displays. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press (2010), 1705.  ",
      "doi": "10.1145/1753326.1753581"
    },
    {
      "text": "Precision Microdrives. Precision Microdrives 310117 - Pico Vibe. https://www.precisionmicrodrives.com/product/310-117-10mm-vibration-motor-3mm-type.",
      "doi": ""
    },
    {
      "text": "Schneider, O. S., Israr, A., and MacLean, K. E. Tactile Animation by Direct Manipulation of Grid Displays. Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST '15, ACM Press (2015), 21--30.  ",
      "doi": "10.1145/2807442.2807470"
    },
    {
      "text": "Scott, J. J. and Gray, R. A comparison of tactile, visual, and auditory warnings for rear-end collision prevention in simulated driving. Human factors 50, 2 (2008), 264--275. ",
      "doi": ""
    },
    {
      "text": "Seo, J. and Choi, S. Initial study for creating linearly moving vibrotactile sensation on mobile device. 2010 IEEE Haptics Symposium, IEEE (2010), 67--70.",
      "doi": ""
    },
    {
      "text": "Sloane, N. J. A., Hardin, R. H., Smith, W. D., and others. Spherical codes. URL http://neilsloane.com/packings/, (2000).",
      "doi": ""
    },
    {
      "text": "Tsukada, K. and Yasumura, M. ActiveBelt: BeltType Wearable Tactile Display for Directional Navigation. 2004.",
      "doi": ""
    },
    {
      "text": "Way, T. P. and Barner, K. E. Automatic visual to tactile translation. I. Human factors, access methods and image manipulation. IEEE Transactions on Rehabilitation Engineering 5, 1 (1997), 81--94. ",
      "doi": ""
    },
    {
      "text": "Weber, B., Schätzle, S., Hulin, T., Preusche, C., and Deml, B. Evaluation of a vibrotactile feedback device for spatial guidance. 2011 IEEE World Haptics Conference, WHC 2011, (2011), 349--354. ",
      "doi": ""
    },
    {
      "text": "Zotkin, D. N., Duraiswami, R., and Davis, L. S. Rendering Localized Spatial Audio in a Virtual Auditory Space. IEEE Transactions on Multimedia 6, 4 (2004), 553--564.  ",
      "doi": "10.1109/TMM.2004.827516"
    },
    {
      "text": "Unity - Game Engine. https://unity3d.com/.",
      "doi": ""
    }
  ]
}