{
  "doi": "10.1145/3025453.3025798",
  "title": "Challenges in Public Display Deployments: A Taxonomy of External Factors",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3426-3475",
  "year": 2017,
  "badges": [],
  "abstract": "Public display deployments are often subjected to various surprising and unwanted effects. These effects are frequently due to external factors properties and phenomena that are unrelated to the deployment. Therefore, we conducted a literature review within the public display domain to investigate the causes behind the reported issues. This work presents a taxonomy of external factors affecting deployments, consisting of six categories: weather, events, surroundings, space, inhabitants, and vandalism. Apart from a few positive examples, we predominantly found negative effects arising from these factors. We then identified four ways of addressing the effects: ignoring, adapting, solving, and embracing. Of these, ignoring and adapting are substantially more frequent responses than solving and embracing emphasizing the need for researchers to adapt. We present real-world examples and insights on how researchers and practitioners can address the effects to better manage their deployments.",
  "authors": [
    {
      "name": "Ville Mäkelä",
      "institution": "University of Tampere, Tampere, Pirkanmaa, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758718057",
      "orcid": "0000-0001-6095-2570"
    },
    {
      "name": "Sumita Sharma",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159148557",
      "orcid": "missing"
    },
    {
      "name": "Jaakko Hakulinen",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/do/10.1145/contrib-81100361132/rel-imgonly/jh300.jpg",
      "acmid": "81100361132",
      "orcid": "missing"
    },
    {
      "name": "Tomi Heimonen",
      "institution": "University of Wisconsin-Stevens Point, Stevens Point, WI, USA",
      "img": "/do/10.1145/contrib-81100238527/rel-imgonly/tomi_web.png",
      "acmid": "81100238527",
      "orcid": "missing"
    },
    {
      "name": "Markku Turunen",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100155914",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christopher Ackad, Rainer Wasinger, Richard Gluga, Judy Kay, and Martin Tomitsch. 2013. Measuring interactivity at an interactive public information display. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13), Haifeng Shen, Ross Smith, Jeni Paay, Paul Calder, and Theodor Wyeld (Eds.). ACM, NY, NY, USA, 329--332. DOI: http://dx.doi.org/10.1145/2541016.2541091  ",
      "doi": "10.1145/2541016.2541091"
    },
    {
      "text": "Christopher Ackad, Andrew Clayphan, Martin Tomitsch, and Judy Kay. 2015. An in-the-wild study of learning mid-air gestures to browse hierarchical information at a large interactive public display. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 12271238. DOI: http://dx.doi.org/10.1145/2750858.2807532 *  ",
      "doi": "10.1145/2750858.2807532"
    },
    {
      "text": "Christopher Ackad, Martin Tomitsch, and Judy Kay. 2016. Skeletons and Silhouettes: Comparing User Representations at a Gesture-based Large Display. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2343--2347. DOI: http://dx.doi.org/10.1145/2858036.2858427 *  ",
      "doi": "10.1145/2858036.2858427"
    },
    {
      "text": "Imeh Akpan, Paul Marshall, Jon Bird, and Daniel Harrison. 2013. Exploring the effects of space and place on engagement with an interactive installation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2213--2222. DOI: http://dx.doi.org/10.1145/2470654.2481306 *  ",
      "doi": "10.1145/2470654.2481306"
    },
    {
      "text": "Florian Alt, Albrecht Schmidt, and Jörg Müller . 2012. Advertising on Public Display Networks. IEEE Computer 45, 5 (May 2012), 50--56. DOI= https://doi.org/10.1109/MC.2012.150",
      "doi": "10.1109/MC.2012.150"
    },
    {
      "text": "Florian Alt, Stefan Schneegaß, Albrecht Schmidt, Jörg Müller, and Nemanja Memarovic. 2012. How to evaluate public displays. In Proceedings of the 2012 International Symposium on Pervasive Displays (PerDis '12). ACM, NY, NY, USA, , Article 17 , 6 pages. DOI=http://dx.doi.org/10.1145/2307798.2307815  ",
      "doi": "10.1145/2307798.2307815"
    },
    {
      "text": "Moritz Behrens, Ava Fatah gen. Schieck, Efsathia Kostopoulou, Steve North, Wallis Motta, Lei Ye, and Holger Schnadelbach. 2013. Exploring the effect of spatial layout on mediated urban interactions. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, NY, NY, USA, 79--84. DOI=http://dx.doi.org/10.1145/2491568.2491586  ",
      "doi": "10.1145/2491568.2491586"
    },
    {
      "text": "Gisele Bennett, Gitte Lindgaard, Bruce Tsuji, Kay H. Connelly, and Katie A. Siek. 2006. Reality testing: HCI challenges in non-traditional environments. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 1679--1682. DOI=http://dx.doi.org/10.1145/1125451.1125761  ",
      "doi": "10.1145/1125451.1125761"
    },
    {
      "text": "Gilbert Beyer, Florian Alt, Jörg Müller, Albrecht Schmidt, Karsten Isakovic, Stefan Klose, Manuel Schiewe, and Ivo Haulsen. 2011. Audience behavior around large interactive cylindrical screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1021--1030. DOI=http://dx.doi.org/10.1145/1978942.1979095  ",
      "doi": "10.1145/1978942.1979095"
    },
    {
      "text": "Harry Brignull and Yvonne Rogers. 2003. Enticing people to interact with large public displays in public spaces. In Proceedings of INTERACT, 3, 17--24.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Stuart Reeves, and Scott Sherwood. 2011. Into the wild: challenges and opportunities for field trial methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1657--1666. DOI=http://dx.doi.org/10.1145/1978942.1979185  ",
      "doi": "10.1145/1978942.1979185"
    },
    {
      "text": "Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles (NordiCHI '06), Anders Mørch, Konrad Morgan, Tone Bratteteig, Gautam Ghosh, and Dag Svanaes (Eds.). ACM, NY, NY, USA, 1--8. DOI=http://dx.doi.org/10.1145/1182475.1182476  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Xiang Cao, Michael Massimi, and Ravin Balakrishnan. 2008. Flashlight jigsaw: an exploratory study of an adhoc multi-player game on public displays. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, NY, NY, USA, 77--86. DOI=http://dx.doi.org/10.1145/1460563.1460577 *  ",
      "doi": "10.1145/1460563.1460577"
    },
    {
      "text": "John M. Carroll. 2003. The Blacksburg Electronic Village: A Study in Community Computing. Lecture Notes in Computer Science 3081 (September 2003), 43--65. DOI= http://dx.doi.org/10.1007/11407546_3  ",
      "doi": "10.1007/11407546_3"
    },
    {
      "text": "Scott Carter and Jennifer Mankoff. 2005. Prototypes in the Wild: Lessons from Three Ubicomp Systems. IEEE Pervasive Computing 4, 4 (October 2005), 51--57. DOI=http://dx.doi.org/10.1109/MPRV.2005.84  ",
      "doi": "10.1109/MPRV.2005.84"
    },
    {
      "text": "Chien-Hsu Chen, Hsiao-Mei Hung, I-Jui Lee, Yu-Wen Chen, and Fong-Gong Wu. 2011. Observe the user interactive behavior with a large multi-touch display in public space. In Proceedings of the 6th international conference on Universal access in human-computer interaction: context diversity - Volume Part III (UAHCI'11), Constantine Stephanidis (Ed.), Vol. Part III. Springer-Verlag, Berlin, Heidelberg, 141--144.",
      "doi": ""
    },
    {
      "text": "Elizabeth F. Churchill, Les Nelson, Laurent Denoue, Jonathan Helfman, and Paul Murphy. 2004. Sharing multimedia content with interactive public displays: a case study. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). ACM, NY, NY, USA, 7--16. DOI=http://dx.doi.org/10.1145/1013115.1013119 *  ",
      "doi": "10.1145/1013115.1013119"
    },
    {
      "text": "Céline Coutrix, Kai Kuikkaniemi, Esko Kurvinen, Giulio Jacucci, Ivan Avdouevski, and Riikka Mäkelä. 2011. FizzyVis: designing for playful information browsing on a multitouch public display. In Proceedings of the 2011 Conference on Designing Pleasurable Products and Interfaces (DPPI '11). ACM, NY, NY, USA, , Article 27 , 8 pages. DOI=http://dx.doi.org/10.1145/2347504.2347534  ",
      "doi": "10.1145/2347504.2347534"
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2010. Designing urban media façades: cases and challenges. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2277--2286. DOI=http://dx.doi.org/10.1145/1753326.1753670 *  ",
      "doi": "10.1145/1753326.1753670"
    },
    {
      "text": "Peter Dalsgaard, Christian Dindler, and Kim Halskov. 2011. Understanding the dynamics of engaging interaction in public spaces. In Proceedings of the 13th IFIP TC 13 international conference on Humancomputer interaction - Volume Part II (INTERACT'11), Pedro Campos, Nuno Nunes, Nicholas Graham, Joaquim Jorge, and Philippe Palanque (Eds.), Vol. Part II. Springer-Verlag, Berlin, Heidelberg, 212--229. ",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2006. Re-space-ing place: \"place\" and \"space\" ten years on. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM, NY, NY, USA, 299--308. DOI=http://dx.doi.org/10.1145/1180875.1180921  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Ivan Elhart, Marc Langheinrich, Nemanja Memarovic, and Elisa Rubegni. 2016. A good balance of costs and benefits: convincing a university administration to support the installation of an interactive multiapplication display system on campus. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, NY, NY, USA, 197--203. DOI: http://dx.doi.org/10.1145/2914920.2915029  ",
      "doi": "10.1145/2914920.2915029"
    },
    {
      "text": "Matthias Finke, Anthony Tang, Rock Leung, and Michael Blackstock. 2008. Lessons learned: game design for large public displays. In Proceedings of the 3rd international conference on Digital Interactive Media in Entertainment and Arts (DIMEA '08). ACM, NY, NY, USA, 26--33. DOI=http://dx.doi.org/10.1145/1413634.1413644 *  ",
      "doi": "10.1145/1413634.1413644"
    },
    {
      "text": "Patrick Tobias Fischer, Christian Zöllner, and Eva Hornecker. 2010. VR/Urban: Spread.gun - design process and challenges in developing a shared encounter for media façades. In Proceedings of the 24th BCS Interaction Specialist Group Conference (BCS '10). British Computer Society, Swinton, UK, UK, 289--298. *  ",
      "doi": "10.1145/1709886.1709989"
    },
    {
      "text": "Patrick Tobias Fischer and Eva Hornecker. 2012. Urban HCI: spatial aspects in the design of shared encounters for media facades. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 307316. DOI=http://dx.doi.org/10.1145/2207676.2207719 *  ",
      "doi": "10.1145/2207676.2207719"
    },
    {
      "text": "Adrian Friday, Nigel Davies, and Christos Efstratiou. 2012. Reflections on Long-Term Experiments with Public Displays. IEEE Computer 45, 5 (May 2012), 4249. DOI= https://doi.org/10.1109/MC.2012.155",
      "doi": "10.1109/MC.2012.155"
    },
    {
      "text": "Kazjon Grace, Rainer Wasinger, Christopher Ackad, Anthony Collins, Oliver Dawson, Richard Gluga, Judy Kay, and Martin Tomitsch. 2013. Conveying interactivity at an interactive public information display. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, NY, NY, USA, 19--24. DOI=http://dx.doi.org/10.1145/2491568.2491573  ",
      "doi": "10.1145/2491568.2491573"
    },
    {
      "text": "Sukeshini A. Grandhi, Gina Joue, and Irene Mittelberg. 2011. Understanding naturalness and intuitiveness in gesture production: insights for touchless gestural interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 821--824. DOI=http://dx.doi.org/10.1145/1978942.1979061  ",
      "doi": "10.1145/1978942.1979061"
    },
    {
      "text": "Saul Greenberg and Michael Rounding. 2001. The notification collage: posting information to public and personal displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, NY, NY, USA, 514--521. DOI=http://dx.doi.org/10.1145/365024.365339  ",
      "doi": "10.1145/365024.365339"
    },
    {
      "text": "Jonna Häkkilä, Olli Koskenranta, Maaret Posti, Leena Ventä-Olkkonen, and Ashley Colley. 2013. Clearing the virtual window: connecting two locations with interactive public displays. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, NY, NY, USA, 85--90. DOI=http://dx.doi.org/10.1145/2491568.2491587  ",
      "doi": "10.1145/2491568.2491587"
    },
    {
      "text": "Eric Harris, Geraldine Fitzpatrick, Yvonne Rogers, Sara Price, Ted Phelps, and Cliff Randell. 2004. From Snark to Park: Lessons learnt moving pervasive experiences from indoors to outdoors. In Proceedings of the fifth conference on Australasian user interface (AUIC '04), Australian Computer Society, Inc., 39--48. *",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work (CSCW '96), Mark S. Ackerman (Ed.). ACM, NY, NY, USA, 67--76. DOI=http://dx.doi.org/10.1145/240080.240193  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Tommi Heikkinen, Tomas Lindén, Timo Ojala, Hannu Kukka, Marko Jurmu, and Simo Hosio. 2010. Lessons learned from the deployment and maintenance of ubihotspots. In Proceedings of the Fourth International Conference on Multimedia and Ubiquitous Engineering (MUE '10), 1--6. http://dx.doi.org/10.1109/MUE.2010.5575054 * ",
      "doi": ""
    },
    {
      "text": "Simo Hosio, Jorge Goncalves, Hannu Kukka, Alan Chamberlain, and Alessio Malizia. 2014. What's in it for me: Exploring the Real-World Value Proposition of Pervasive Displays. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14), Sven Gehring (Ed.). ACM, NY, NY, USA, , Pages 174 , 6 pages. DOI=http://dx.doi.org/10.1145/2611009.2611012  ",
      "doi": "10.1145/2611009.2611012"
    },
    {
      "text": "Simo Hosio, Hannu Kukka, Jorge Goncalves, Vassilis Kostakos, and Timo Ojala. 2016. Toward Meaningful Engagement with Pervasive Displays. IEEE Pervasive Computing 15, 3 (July 2016), 24--31. DOI= https://doi.org/10.1109/MPRV.2016.58",
      "doi": "10.1109/MPRV.2016.58"
    },
    {
      "text": "Elaine M. Huang and Elizabeth D. Mynatt. 2003. Semi-public displays for small, co-located groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 49--56. DOI=http://dx.doi.org/10.1145/642611.642622  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "Elaine M. Huang, Anna Koster, and Jan Borchers. 2009. Overcoming Assumptions and Uncovering Practices: When Does the Public Really Look at Public Displays?. In Proceedings of the 6th International Conference on Pervasive Computing (Pervasive '08), Jadwiga Indulska, Donald J. Patterson, Tom Rodden, and Max Ott (Eds.). Springer-Verlag, Berlin, Heidelberg, 228--243. DOI=10.1007/978--3--540--795766_14 http://dx.doi.org/10.1007/978--3--540--79576--6_14",
      "doi": ""
    },
    {
      "text": "Giulio Jacucci, Ann Morrison, Gabriela T. Richard, Jari Kleimola, Peter Peltonen, Lorenza Parisi, and Toni Laitinen. 2010. Worlds of information: designing for engagement at a public multi-touch display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2267--2276. DOI=http://dx.doi.org/10.1145/1753326.1753669  ",
      "doi": "10.1145/1753326.1753669"
    },
    {
      "text": "Wendy Ju and David Sirkin. 2010. Animate objects: how physical motion encourages public interaction. In Proceedings of the 5th international conference on Persuasive Technology (PERSUASIVE'10), Thomas Ploug, Per Hasle, and Harri Oinas-Kukkonen (Eds.). Springer-Verlag, Berlin, Heidelberg, 40--51. DOI=http://dx.doi.org/10.1007/978--3--642--13226--1_6",
      "doi": ""
    },
    {
      "text": "Marko Jurmu, Masaki Ogawa, Sebastian Boring, Jukka Riekki, and Hideyuki Tokuda. 2013. Waving to a touch interface: descriptive field study of a multipurpose multimodal public display. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, NY, NY, USA, 7--12. DOI=http://dx.doi.org/10.1145/2491568.2491571  ",
      "doi": "10.1145/2491568.2491571"
    },
    {
      "text": "Maurice Ten Koppel, Gilles Bailly, Jörg Müller, and Robert Walter. 2012. Chained displays: configurations of public displays can be used to influence actor-, audience-, and passer-by behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 317--326. DOI=http://dx.doi.org/10.1145/2207676.2207720  ",
      "doi": "10.1145/2207676.2207720"
    },
    {
      "text": "Matthias Korn and Susanne Bødker. 2012. Looking ahead: how field trials can work in iterative and exploratory design of ubicomp systems. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 21--30. DOI=http://dx.doi.org/10.1145/2370216.2370221  ",
      "doi": "10.1145/2370216.2370221"
    },
    {
      "text": "Kai Kuikkaniemi, Giulio Jacucci, Marko Turpeinen, Eve Hoggan, and Jörg Müller. 2011. From Space to Stage: How Interactive Screens Will Change Urban Life. IEEE Computer 6, 44 (June 2011), 40--47. DOI=http://dx.doi.org/ 10.1109/MC.2011.135  ",
      "doi": "10.1109/MC.2011.135"
    },
    {
      "text": "Hannu Kukka, Heidi Oja, Vassilis Kostakos, Jorge Gonçalves, and Timo Ojala. 2013. What makes you click: exploring visual signals to entice interaction on public displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1699--1708. DOI: http://dx.doi.org/10.1145/2470654.2466225 *  ",
      "doi": "10.1145/2470654.2466225"
    },
    {
      "text": "Scott Mcquire. 2010. Rethinking media events: Large screens, public space broadcasting and beyond. New Media & Society 12, 4 (June 2010), 567--582. DOI= http://dx.doi.org/10.1177/1461444809342764 ",
      "doi": ""
    },
    {
      "text": "Nemanja Memarovic, Marc Langheinrich, Keith Cheverst, Nick Taylor, and Florian Alt. 2013. PLAYERS -- A Layered Framework Addressing the Multifaceted Issues Facing Community-Supporting Public Display Deployments. ACM Transactions in Computer-Human Interaction 20, 3, Article 17 (July 2013), 34 pages. DOI=http://dx.doi.org/10.1145/2491500.2491505 *  ",
      "doi": "10.1145/2491500.2491505"
    },
    {
      "text": "Daniel Michelis and Jörg Müller. 2011. The Audience Funnel: Observations of Gesture Based Interaction with Multiple Large Displays in a City Center. In International Journal of Human-Computer Interaction 27,6, 562--579. http://dx.doi.org/10.1080/10447318.2011.555299 ",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Dennis Wilmsmann, Juliane Exeler, Markus Buzeck, Albrecht Schmidt, Tim Jay, and Antonio Krüger. 2009. Display Blindness: The Effect of Expectations on Attention towards Digital Signage. In Proceedings of the 7th International Conference on Pervasive Computing (Pervasive '09), Hideyuki Tokuda, Michael Beigl, Adrian Friday, A. J. Brush, and Yoshito Tobe (Eds.). Springer-Verlag, Berlin, Heidelberg, 1--8. DOI=http://dx.doi.org/10.1007/978--3642-01516--8_1",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Florian Alt, Daniel Michelis, and Albrecht Schmidt. 2010. Requirements and design space for interactive public displays. In Proceedings of the 18th ACM international conference on Multimedia (MM '10). ACM, NY, NY, USA, 1285--1294. DOI=http://dx.doi.org/10.1145/1873951.1874203  ",
      "doi": "10.1145/1873951.1874203"
    },
    {
      "text": "Jörg Müller, Robert Walter, Gilles Bailly, Michael Nischt, and Florian Alt. 2012. Looking glass: a field study on noticing interactivity of a shop window. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 297--306. DOI=http://dx.doi.org/10.1145/2207676.2207718  ",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "Jörg Müller, Gilles Bailly, Thor Bossuyt, and Niklas Hillgren. 2014. MirrorTouch: combining touch and mid-air gestures for public displays. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, NY, NY, USA, 319--328. DOI=http://dx.doi.org/10.1145/2628363.2628379  ",
      "doi": "10.1145/2628363.2628379"
    },
    {
      "text": "Jörg Müller, Dieter Eberle, and Konrad Tollmar. 2014. Communiplay: a field study of a public display mediaspace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1415--1424. DOI=http://dx.doi.org/10.1145/2556288.2557001 *  ",
      "doi": "10.1145/2556288.2557001"
    },
    {
      "text": "Kenton O'Hara, Maxine Glancy, and Simon Robertshaw. 2008. Understanding collective play in an urban screen game. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, NY, NY, USA, 67--76. DOI=http://dx.doi.org/10.1145/1460563.1460576 *  ",
      "doi": "10.1145/1460563.1460576"
    },
    {
      "text": "Timo Ojala, Hannu Kukka, Tomas Lindén, Tommi Heikkinen, Marko Jurmu, Simo Hosio, and Fabio Kruger. 2010. UBI-hotspot 1.0: Large-scale long-term deployment of interactive public displays in a city center. In Fifth International Conference on Internet and Web Applications and Services (ICIW), IEEE, 285--294. IEEE. *  ",
      "doi": "10.1109/ICIW.2010.49"
    },
    {
      "text": "Timo Ojala, Vassilis Kostakos, Hannu Kukka, Tommi Heikkinen, Tomas Lindén, Marko Jurmu, Simo Hosio, Fabio Kruger, and Daniele Zanni. 2012. Multipurpose Interactive Public Displays in the Wild: Three Years Later. IEEE Computer 45, 5 (May 2012), 42--49. DOI=http://dx.doi.org/10.1109/MC.2012.115  ",
      "doi": "10.1109/MC.2012.115"
    },
    {
      "text": "Gonzalo Parra, Joris Klerkx, and Erik Duval. 2014. Understanding Engagement with Interactive Public Displays: an Awareness Campaign in the Wild. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14), Sven Gehring (Ed.). ACM, NY, NY, USA, , Pages 180 , 6 pages. DOI=http://dx.doi.org/10.1145/2611009.2611020  ",
      "doi": "10.1145/2611009.2611020"
    },
    {
      "text": "Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, and Petri Saarikko. 2008. It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1285--1294. DOI=http://dx.doi.org/10.1145/1357054.1357255 *  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Mark Perry, Steve Beckett, Kenton O'Hara, and Sriram Subramanian. 2010. WaveWindow: public, performative gestural interaction. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 109112. DOI=http://dx.doi.org/10.1145/1936652.1936672  ",
      "doi": "10.1145/1936652.1936672"
    },
    {
      "text": "Constantin Schmidt, Jörg Müller, and Gilles Bailly. 2013. Screenfinity: extending the perception area of content on very large public displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1719--1728. DOI: http://dx.doi.org/10.1145/2470654.2466227  ",
      "doi": "10.1145/2470654.2466227"
    },
    {
      "text": "Ronald Schroeter, Marcus Foth, and Christine Satchell. 2012. People, content, location: sweet spotting urban screens for situated engagement. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 146--155. DOI=http://dx.doi.org/10.1145/2317956.2317980 *  ",
      "doi": "10.1145/2317956.2317980"
    },
    {
      "text": "Fabius Steinberger, Marcus Foth, and Florian Alt. 2014. Vote With Your Feet: Local Community Polling on Urban Screens. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14), Sven Gehring (Ed.). ACM, NY, NY, USA, , Pages 44 , 6 pages. DOI=http://dx.doi.org/10.1145/2611009.2611015  ",
      "doi": "10.1145/2611009.2611015"
    },
    {
      "text": "Oliver Storz, Adrian Friday, Nigel Davies, Joe Finney, Corina Sas, and Jennifer Sheridan. 2006. Public Ubiquitous Computing Systems: Lessons from the eCampus Display Deployments. IEEE Pervasive Computing 5, 3 (July 2006), 40--47. DOI=http://dx.doi.org/10.1109/MPRV.2006.56 *  ",
      "doi": "10.1109/MPRV.2006.56"
    },
    {
      "text": "Mirjam Struppek. 2006. Urban Screens -- The Urbane Potential of Public Screens for Interaction. Intelligent Agent 6, 2.",
      "doi": ""
    },
    {
      "text": "Nick Taylor and Keith Cheverst. 2012. Supporting Community Awareness with Interactive Displays. IEEE Computer 45, 5 (May 2012), 26--32. DOI=http://dx.doi.org/10.1109/MC.2012.113  ",
      "doi": "10.1109/MC.2012.113"
    },
    {
      "text": "Nick Taylor, Justin Marshall, Alicia Blum-Ross, John Mills, Jon Rogers, Paul Egglestone, David M. Frohlich, Peter Wright, and Patrick Olivier. 2012. Viewpoint: empowering communities with situated voting devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1361--1370. DOI=http://dx.doi.org/10.1145/2207676.2208594 *  ",
      "doi": "10.1145/2207676.2208594"
    },
    {
      "text": "Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild: lessons from community technology handovers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1549--1558. DOI: http://dx.doi.org/10.1145/2470654.2466206  ",
      "doi": "10.1145/2470654.2466206"
    },
    {
      "text": "Martin Tomitsch, Christopher Ackad, Oliver Dawson, Luke Hespanhol, and Judy Kay. 2014. Who cares about the Content? An Analysis of Playful Behaviour at a Public Display. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14), Sven Gehring (Ed.). ACM, NY, NY, USA, , Pages 160 , 6 pages. DOI=http://dx.doi.org/10.1145/2611009.2611016 *  ",
      "doi": "10.1145/2611009.2611016"
    },
    {
      "text": "Nina Valkanova, Robert Walter, Andrew Vande Moere, and Jörg Müller. 2014. MyPosition: sparking civic discourse by a public interactive poll visualization. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1323--1332. DOI=http://dx.doi.org/10.1145/2531602.2531639 *  ",
      "doi": "10.1145/2531602.2531639"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proceedings of the 17th annual ACM symposium on User interface software and technology (UIST '04). ACM, NY, NY, USA, 137--146. DOI=http://dx.doi.org/10.1145/1029632.1029656  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Robert Walter, Gilles Bailly, and Jörg Müller. 2013. StrikeAPose: revealing mid-air gestures on public displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 841--850. DOI: http://dx.doi.org/10.1145/2470654.2470774  ",
      "doi": "10.1145/2470654.2470774"
    },
    {
      "text": "Robert Walter, Gilles Bailly, Nina Valkanova, and Jörg Müller. 2014. Cuenesics: using mid-air gestures to select items on interactive public displays. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, NY, NY, USA, 299--308. DOI: http://dx.doi.org/10.1145/2628363.2628368  ",
      "doi": "10.1145/2628363.2628368"
    },
    {
      "text": "* Part of the taxonomy of external factors.",
      "doi": ""
    },
    {
      "text": "All referenced papers were part of the literature review.",
      "doi": ""
    }
  ]
}