{
  "doi": "10.1145/3025453.3025886",
  "title": "Design for Trust: An Exploration of the Challenges and Opportunities of Bitcoin Users",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6499-6510",
  "year": 2017,
  "badges": [],
  "abstract": "Bitcoin is a cryptocurrency which has received increasing interest over the last five years. Built upon a decentralized peer to peer system, it supports transparent, fast, cost effective, and irreversible transactions, without the need for trusting third party financial institutions. We know however little about people's motivation and experience with bitcoin currency. This paper reports on interviews with 20 bitcoin users in Malaysia about their experience and trust challenges. Findings show that bitcoins are used more as store of value for speculative investment or savings' protection. The paper advances the HCI theories on trust by identifying main bitcoin characteristics and their impact on trust, such as decentralization, unregulation, embedded expertise, and reputation, as well as transactions' transparency, low cost, and easiness to complete. We discuss insecure transactions, the risk of dishonest traders and its mitigating strategies. The paper concludes with design implications including support for the transparency of two-way transactions, tools for materializing trust, and tools for supporting reversible transactions.",
  "authors": [
    {
      "name": "Corina Sas",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81100639942/rel-imgonly/dsc_0976_close_up.jpg",
      "acmid": "81100639942",
      "orcid": "missing"
    },
    {
      "name": "Irni Eliana Khairuddin",
      "institution": "Universiti Teknologi MARA, Shah Alam, Malaysia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658771566",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michael Bacharach and Diego Gambetta. 2003. Trust in Signs. In Trust in Society, Karen S. Cook (ed.),. Russell Sage, New York.",
      "doi": ""
    },
    {
      "text": "Rachid El Bansarkhaniand Jan Sturm. 2016. An Efficient Lattice-Based Multisignature Scheme with Applications to Bitcoins. In International Conference on Cryptology and Network Security, 140--155.",
      "doi": ""
    },
    {
      "text": "Ardion Beldad, Menno de Jong and Michaël Steehouder. 2010. How shall I trust the faceless and the intangible? A literature review on the antecedents of online trust. Computers in human behavior 26, 5: 857869.  ",
      "doi": "10.1016/j.chb.2010.03.013"
    },
    {
      "text": "Bitcoin Wiki. Anonymity. Retrieved September 14, 2016 from https://en.bitcoin.it/wiki/Anonymity",
      "doi": ""
    },
    {
      "text": "Mads Bodker. 2004. Trust and the digital environment. Retrieved June 10, 2016 from http://www.itu.dk/people/boedker/trustpaper.pdf",
      "doi": ""
    },
    {
      "text": "Michael Bordo. 1981. The classical gold standard: some lessons for today. Review, 2--17.",
      "doi": ""
    },
    {
      "text": "Davide Carboni. 2015. Feedback based Reputation on top of the Bitcoin Blockchain. Retrieved September 19, 2016 from arXiv preprint arXiv:1502.01504",
      "doi": ""
    },
    {
      "text": "Raul Carillo. 2015. Alternative currencies are bigger than bitcoin: how they're building prosperity from London to Kenya. Retrieved June 22, 2016 from http://www.yesmagazine.org/commonomics/alternativecurrencies-bigger-than-bitcoin-bangla-pesa-brixton",
      "doi": ""
    },
    {
      "text": "John M. Carroll and Victoria Bellotti. 2015. Creating Value Together: The Emerging Design Space of Peerto-Peer Currency and Exchange. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1500--1510.  ",
      "doi": "10.1145/2675133.2675270"
    },
    {
      "text": "Nicolas Christin. 2013. Traveling the Silk road: A measurement analysis of a large anonymous online marketplace. In Proceedings of the 22nd international conference on World Wide Web. ACM, 213--224.  ",
      "doi": "10.1145/2488388.2488408"
    },
    {
      "text": "CNN Money. 2015. Greece shuts banks in bid to prevent collapse. Retrieved June 10, 2016 from http://money.cnn.com/2015/06/28/news/economy/greec e-banks-ecb/",
      "doi": ""
    },
    {
      "text": "Coin Market Cap. 2016. Crypto-currency market capitalizations. Retrieved June 10, 2016 from https://coinmarketcap.com/",
      "doi": ""
    },
    {
      "text": "Cynthia L. Corritore, Beverly Kracher and Susan Wiedenbeck. 2003. International Journal of HumanComputer Studies 58, 6: 738--758.",
      "doi": ""
    },
    {
      "text": "Robert Costanza, et. al. 2003. Complementary currencies as a method to improve local sustainable economic welfare. Retrieved June 10, 2016 from http://78.46.126.155/Record/632",
      "doi": ""
    },
    {
      "text": "Michael Crosby, Nachiappan , Pradhan Pattanayak, Sanjeev Verma and Vignesh Kalyanaraman. 2015. Retrieved June 10, 2016 from http://scet.berkeley.edu/wpcontent/uploads/BlockchainPaper.pdf",
      "doi": ""
    },
    {
      "text": "Fred D. Davis. 1989. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly 13, 3: 319--340.  ",
      "doi": "10.2307/249008"
    },
    {
      "text": "Encyclopedia.com. 2002. Coins and currency. Retrieved September 19, 2016 from http://www.encyclopedia.com/topic/coin.aspx",
      "doi": ""
    },
    {
      "text": "European Central Bank. 2012. Virtual currency schemes. Retrieved June 10, 2016 from https://www.ecb.europa.eu/pub/pdf/other/virtualcurrenc yschemes201210en.pdf",
      "doi": ""
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating rigor using thematic analysis: A hybrid approach of inductive and deductive coding and theme development. International journal of qualitative methods, 5, 1: 80--92.",
      "doi": ""
    },
    {
      "text": "Amy Fontinelle. 2011. An introduction to complementary currencies. Retrieved June 10, 2016 from http://www.investopedia.com/articles/economics/11/intr oduction-complementary-currencies.asp",
      "doi": ""
    },
    {
      "text": "David Gilbert. 2016. Bitcoin's big problem: transaction delays renew blockchain debate. Retrieved June 10, 2016 from http://www.ibtimes.com/bitcoins-bigproblem-transaction-delays-renew-blockchain-debate-",
      "doi": ""
    },
    {
      "text": "Herb Goldberg and Lewis Robert. 2000. Money madness: The psychology of saving, spending, loving, and hating money. Wellness Institute, Inc, Gretna LA,",
      "doi": ""
    },
    {
      "text": "Andres Guadamuz, Chris Marsden Guadamuz. 2015. Blockchains and Bitcoin: Regulatory responses to cryptocurrencies. First Monday, 20: 12--7.",
      "doi": ""
    },
    {
      "text": "Russell Hardin. 2002. Trust and trustworthiness. Sage Foundation, New York.",
      "doi": ""
    },
    {
      "text": "Garrick Hileman. 2014. From bitcoin to the brixton pound: history and prospects for alternative currencies. In International Conference on Financial Cryptography and Data Security ,163--165.",
      "doi": ""
    },
    {
      "text": "Jofish Kaye, Janet Vertesi, Jennifer Ferreira, Barry Brown, and Mark Perry. 2014. #CHImoney: financial interactions, digital cash, capital exchange and mobile money. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). 111--114.  ",
      "doi": "10.1145/2559206.2559221"
    },
    {
      "text": "Erol Kazan, Chee-Wee Tan, and Eric TK Lim. 2015. Value Creation in Cryptocurrency Networks: Towards A Taxonomy of Digital Business Models for Bitcoin Companies. The 19th Pacific Asia Conference on Information Systems (PACIS 2015).",
      "doi": ""
    },
    {
      "text": "Irni Eliana Khairuddin, Corina Sas, Sarah Clinch, and Nigel Davies. 2016. Exploring Motivations for Bitcoin Technology Usage. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2872--2878.  ",
      "doi": "10.1145/2851581.2892500"
    },
    {
      "text": "Brad Klontz, Sonya L. Britt, Jennifer Mentzer, and Ted Klontz. 2011. Money beliefs and financial behaviors: Development of the Klontz Money Script Inventory. Journal of Financial Therapy 2,1.",
      "doi": ""
    },
    {
      "text": "Katharina Krombholz, Aljosha Judmayer, Matthias Gusenbauer and Edgar Weippl. 2016. The Other Side of the Coin: User Experiences with Bitcoin Security and Privacy. Financial Cryptography and Data Security.",
      "doi": ""
    },
    {
      "text": "Sara Lipkis and Amanda Roth. 2016. Anatomy: what is alternative currency? Retrieved June 10 2016 from http://www.worldpolicy.org/anatomy-what-alternativecurrency",
      "doi": ""
    },
    {
      "text": "Niklas Luhman. 1979. Trust: a mechanism for reduction of social complexity. In Trust and Power, Niklas Luhmann (ed). Wiley, New York,",
      "doi": ""
    },
    {
      "text": "Caitlin Lustig and Bonnie Nardi. 2015. Algorithmic authority: The case of Bitcoin. In System Sciences (HICSS), 2015 48th Hawaii International Conference IEEE. 743--752.  ",
      "doi": "10.1109/HICSS.2015.95"
    },
    {
      "text": "Roger C. Mayer, James H. Davis and F. David Schoorman. 1995. An integrative model of organizational trust. The Academy of Management Review 20, 3: 709",
      "doi": ""
    },
    {
      "text": "Barbara A. Misztal. 1996. Trust in Modern Societies. The Search for Basis of Social Order. Cambridge University Press, Cambridge, 42--87.",
      "doi": ""
    },
    {
      "text": "Guido Mollering. 2006. Trust: Reason, Routine, Reflectivity. Elseiver, Netherlands.",
      "doi": ""
    },
    {
      "text": "Malte Moser. 2013. Anonymity of bitcoin transactions: an analysis if mixing service. RetrievedJune 10, 2016 from https://www.wi.unimuenster.de/sites/wi/files/public/dep artment/itsecurity/mbc13/mbc13-moeser-paper.pdf",
      "doi": ""
    },
    {
      "text": "Fiona F. Nah and Sid Davis. 2002. HCI research issues in e-commerce. Journal of Electronic Commerce Research 3.3: 98--113.",
      "doi": ""
    },
    {
      "text": "Satoshi Nakamoto. 2008. Bitcoin: peer to peer electronic cash system. Retrieved September 14, 2016 from https://bitcoin.org/bitcoin.pdf",
      "doi": ""
    },
    {
      "text": "P2P Foundations. 2015. Definition of Bitcoin. Retrieved June 10, 2016 from http://p2pfoundation.net/bitcoin",
      "doi": ""
    },
    {
      "text": "Jens Riegelsberger, M. Angela Sasse and John D. McCarthy. 2005. The mechanics of trust: a framework for research and design. International of HumanComputer Studies. 62, 3: 381--422.  ",
      "doi": "10.1016/j.ijhcs.2005.01.001"
    },
    {
      "text": "Antti Salovaara, Kristina Höök, Keith Cheverst, Michael Twidale, Matthew Chalmers, and Corina Sas. 2011. Appropriation and creative use: linking user studies and design. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 37--40.  ",
      "doi": "10.1145/1979742.1979585"
    },
    {
      "text": "Corina Sas and Irni Eliana Khairuddin. 2015. Exploring Trust in Bitcoin Technology: A Framework for HCI Research. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), 338- 342.  ",
      "doi": "10.1145/2838739.2838821"
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, New York, NY, USA, 1971--1980.  ",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Larry Schweikart. 1991. U.S. commercial banking: a historiographical survey. Business History Review. 65 (Autumn): 606.",
      "doi": ""
    },
    {
      "text": "Evander Smart. 2015. Top 10 Countries in which bitcoin is banned. Retrieved June 10, 2016 from https://www.cryptocoinsnews.com/top-10-countriesbitcoin-banned/",
      "doi": ""
    },
    {
      "text": "Melanie Swan. 2015. Blockchain blueprint for a new economy. O.Reilly, California. ",
      "doi": "10.5555/3006358"
    },
    {
      "text": "Tether. White paper. Retrieved September 19, 2016 from https://www.weusecoins.com/assets/pdf/library/Tether% 20Whitepaper.pdf",
      "doi": ""
    },
    {
      "text": "The Law Library of Congress. 2014. Regulation of bitcoin in selected jurisdiction. Retrieved June 10, 2016 from https://www.loc.gov/law/help/bitcoinsurvey/regulation-of-bitcoin.pdf",
      "doi": ""
    },
    {
      "text": "UK Government. 2016. Distributed ledger technology beyond block chain. Retrieved June 10, 2016 from https://www.gov.uk/government/uploads/system/upload s/attachment_data/file/492972/gs-16--1-distributedledger-technology.pdf",
      "doi": ""
    },
    {
      "text": "Randall L. Wray. 2012. Introduction to an alternative history of money. Levy Economics Institute Working Paper, 717.",
      "doi": ""
    },
    {
      "text": "David Yermack. 2013. Is bitcoin a real currency? an economic appraisal. NBER Working Paper19747.",
      "doi": ""
    },
    {
      "text": "Suraya Zainuddin. 2016. The complete guide to bitcoin scams. Retrieved June 10, 2016 from https://www.coingecko.com/buzz/complete-guide-tobitcoin-scams?locale=en",
      "doi": ""
    },
    {
      "text": "Adam Vaziri Zanjani. 2014. Bitcoin Exchanges as Payment Institution. Retrieved September 16, 2016 from http://neopay.co.uk/site/wpcontent/uploads/Diacle-Bitcoin-Regulation.pdf",
      "doi": ""
    }
  ]
}