{
  "doi": "10.1145/3025453.3025873",
  "title": "Embodied Design Ideation Methods: Analysing the Power of Estrangement",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5158-5170",
  "year": 2017,
  "badges": [],
  "abstract": "Embodied design ideation practices work with relationships between body, material and context to enliven design and research potential. Methods are often idiosyncratic and due to their physical nature not easily transferred. This presents challenges for designers wishing to develop and share techniques or contribute to research. We present a framework that enables designers to understand, describe and contextualise their embodied design ideation practices in ways that can be understood by peers, as well as those new to embodied ideation. Our framework developed over two conference workshops provides a frame for discussion of embodied design actions that leverage the power of estrangement. We apply our framework to eight embodied design ideation methods. Our contribution is thus twofold: (1) a framework to understand and leverage the power of estrangement in embodied design ideation, and (2) an inspirational catalogue demonstrating the diversity of ideas that embodied design ideation methods can foster.",
  "authors": [
    {
      "name": "Danielle Wilde",
      "institution": "University of Southern Denmark, Kolding, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502707705",
      "orcid": "missing"
    },
    {
      "name": "Anna Vallgårda",
      "institution": "IT University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81385600598/rel-imgonly/akav-square.jpg",
      "acmid": "81385600598",
      "orcid": "missing"
    },
    {
      "name": "Oscar Tomico",
      "institution": "Eindhoven University of Technology & ELISAVA, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363603590",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sarah Fdili Alaoui. 2015. Collaborative Somatic Inquiries. Workshop submission for Embodying Embodied Design Research at Århus 2015 Critical Alternatives.",
      "doi": ""
    },
    {
      "text": "Alissa N. Antle, Paul Marshall, Elise van den Hoven. 2011. Workshop on embodied interaction: theory and practice in HCI. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 5--8.  ",
      "doi": "10.1145/1979742.1979592"
    },
    {
      "text": "ArcInTex Architecture Interaction and Textiles Network conference workshop advertisement: http://arcintex.hb.se/news/59/17/TEI-WorkshopEmbodying-Soft-Wearables-Research/",
      "doi": ""
    },
    {
      "text": "Genevieve Bell, Mark Blythe and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2 (2005), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Eva Brandt and Camilla Grunnet. Evoking the future: Drama and props in user centered design. Proceedings Participatory Design Conference (PDC 2000). 2000.",
      "doi": ""
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. Experience Prototyping. In Proc. Designing Interactive Systems (DIS2000), ACM Press (2000) 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Colin Burns, Eric Dishman, William Verplank, and Bud Lassiter. 1994. Actors, hairdos & videotape informance design. In Conference Companion on Human Factors in Computing Systems (CHI '94), ACM, New York, (1994), 119--120.  ",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Jacob Buur and Preben Friis. 2015. Object Theatre in Design Education. | Designing with Theatre Objects. In the Proceedings of Nordes No 6 (2015): Nordes 2015: Design Ecologies, ISSN 1604--9705",
      "doi": ""
    },
    {
      "text": "Andy Clark. 1998. Being There: Putting Brain, Body and World Together Again MIT Press. ",
      "doi": "10.5555/524400"
    },
    {
      "text": "Andy Clark. 2010 Supersizing the Mind Embodiment, Action, and Cognitive Extension (Philosophy of Mind). Oxford University Press.",
      "doi": ""
    },
    {
      "text": "CoDesign; International Journal of CoCreation in Design and the Arts. Taylor and Francis http://www.tandfonline.com/loi/ncdn20",
      "doi": ""
    },
    {
      "text": "Greg Corness and Thecla Schiphorst, Performing with a system's intention: embodied cues in performersystem interaction. In Proc. Creativity and Cognition (C&C 2013) ACM, NY (2013), 156--164.  ",
      "doi": "10.1145/2466627.2466642"
    },
    {
      "text": "Arthur Coleman Danto. 1981. The transfiguration of the commonplace: a philosophy of art. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Shannon Cuykendall, Ethan Soutar-Rau, Karen Cochrane, Jacob Freiberg, and Thecla Schiphorst. 2015. Simply Spinning: Extending Current Design Frameworks for Kinesthetic Empathy. InProceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 305--312.  ",
      "doi": "10.1145/2677199.2680567"
    },
    {
      "text": "John Dewey. 2005 (1934). Art as Experience. New York, N.Y.: Perigee (Penguin, Berkley)",
      "doi": ""
    },
    {
      "text": "Tom Djajadiningrat, Ben Matthews, and Marcelle Stienstra. 2007. Easy doesn't do it: skill and expression in tangible aesthetics. Personal Ubiquitous Comput. 11, 8 (December 2007), 657--676.  ",
      "doi": "10.1007/s00779-006-0137-9"
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press, 2004.",
      "doi": ""
    },
    {
      "text": "Maiken Hillerup Fogtmann, Jonas Fritsch, and Karen Johanne Kortbek. 2008. Kinesthetic interaction: revealing the bodily potential in interaction design. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08). ACM, New York, NY, USA, 89--96.  ",
      "doi": "10.1145/1517744.1517770"
    },
    {
      "text": "Shaun Gallagher. 2012. Phenomenology. Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Shaun Gallagher. 2016. How the body shapes the mind. Oxford University Press, (2006)",
      "doi": ""
    },
    {
      "text": "Shaun Gallagher and Dan Zahavi. 2012. The phenomenological mind. Routledge; 2 edition",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 1990. The computer reaches out: The historical continuity of interface design. In the Proceedings of the Conference on Human Factors in Computing Systems (CHI'90), pp. 261--268.  ",
      "doi": "10.1145/97243.97284"
    },
    {
      "text": "Sandra Harding. 1991 Whose Science? Whose Knowledge? Ithaca, NY: Cornell University Press",
      "doi": ""
    },
    {
      "text": "Martin Heidegger. 1996 Being and time. Trans. Joan Stambaugh. Albany: State University of New York Press.",
      "doi": ""
    },
    {
      "text": "Martin Heidegger. 1977. The Question Concerning Technology. trans., W. Lovitt. NY: Harper and Row.",
      "doi": ""
    },
    {
      "text": "John Hughes, Val King, Tom Rodden, and Hans Andersen. 1995. The role of ethnography in interactive systems design. interactions 2, 2 (April 1995), 56--65.  ",
      "doi": "10.1145/205350.205358"
    },
    {
      "text": "Caroline Hummels and Jelle van Dijk. 2015. Seven Principles to Design for Embodied Sensemaking. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY (2015), 21--28.  ",
      "doi": "10.1145/2677199.2680577"
    },
    {
      "text": "Caroline Hummels, Kees C. Overbeeke, and Sietske Klooster. 2007. Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction.Personal Ubiquitous Comput. 11, 8 (December 2007), 677--690.  ",
      "doi": "10.1007/s00779-006-0135-y"
    },
    {
      "text": "Kristina Höök, Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, and Eva-Carin Banka Johnson. 2015. COVER STORY: Somaesthetic design. interactions 22, 4 (June 2015), 26--33  ",
      "doi": "10.1145/2770888"
    },
    {
      "text": "Kristina Höök, Martin Jonsson, Anna Ståhl, Jakob Tholander, Toni Robertson, Patrizia Marti, Dag Svanaes, Marianne Graves Petersen, Jodi Forlizzi, Thecla Schiphorst, Katherine Isbister, Caroline Hummels, Sietske Klooster, Lian Loke, and George Poonkhin Khut. 2016. Move to be Moved. InProceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3301--3308.  ",
      "doi": "10.1145/2851581.2856470"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3131--3142.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Giulio Iacucci and Kari Kuutti. 2002. Everyday Life as a Stage in Creating and Performing Scenarios for Wireless Devices. Personal Ubiquitous Comput. 6, 4 (January 2002), 299--306.  ",
      "doi": "10.1007/s007790200031"
    },
    {
      "text": "Sarah Kettley, Sarah Walker, & Katherine Townsend. 2015. Evidencing Embodied Participatory Design. In the Proceedings of the Workshop contribution for Embodied Ideation Workshop at the Aarhus Decenial: Critical Alternatives",
      "doi": ""
    },
    {
      "text": "David Kirsh. 2010. Thinking with the Body. Proc. Cognitive Science Society (2010), 2864--2869",
      "doi": ""
    },
    {
      "text": "Julian Kiverstein and Andy Clark. Introduction: Mind embodied, embedded, enacted: One church or many? Topoi 28.1 (2009): 1--7.",
      "doi": ""
    },
    {
      "text": "Lone Koefoed Hansen and Susan Kozel. 2007. Embodied imagination: a hybrid method of designing for intimacy. Digital Creativity. 18, 4. 207--220.",
      "doi": ""
    },
    {
      "text": "Susan Kozel. 2007. Closer: Performance, Technologies, Phenomenology. Cambridge: MIT Press.",
      "doi": ""
    },
    {
      "text": "Susan Kozel. The virtual and the physical. In M. Biggs and H. Karlsson (Eds.) The Routledge Companion in Research in the Arts, 2010.",
      "doi": ""
    },
    {
      "text": "Astrid Tweneboa Larssen, Toni Robertson, Lian Loke, Jenny Edwards (eds.) Personal & Ubiquitous Computing Special issue on movement-based interaction 11(8), Springer, 2007",
      "doi": ""
    },
    {
      "text": "Brenda Laurel Computers as Theatre. Addison Wesley; First Edition edition. May 1991; Addison-Wesley Professional; 2nd edition. Sept. 2013 ",
      "doi": "10.5555/103681"
    },
    {
      "text": "Henri Lefebvre. \"Towards a Leftist Cultural Politics: Remarks Occasioned by the Centenary of Marx's Death, 1988.\" In Marxism and the Interpretation of Culture, edited by C. Nelson and L. Grossberg, 75--88. Urbana and Chicago: University of Chicago Press, 1991.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2011. The lived body in design: mapping the terrain. InProceedings of the 23rd Australian Computer-Human Interaction Conference (OzCHI '11). ACM, New York, NY, USA, 181--184.  ",
      "doi": "10.1145/2071536.2071565"
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange: An embodied approach to movementbased interaction design. ACM Transactions on Computer-Human Interaction (TOCHI). 20, 1. 7.  ",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Leilah Lyons, Brian Slattery, Priscilla Jimenez, Brenda Lopez, and Tom Moher. 2012. Don't forget about the sweat: effortful embodied interaction in support of learning. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 77--84.  ",
      "doi": "10.1145/2148131.2148149"
    },
    {
      "text": "Catriona Macaulay, Giulio Jacucci, Shaleph O'Neill and Tomi Kankaineen (eds.) Special issue on The Emerging Roles of Performance within HCI and Interaction Design. Interacting with Computers 18, 5, 869--1164 (September 2006).  ",
      "doi": "10.1016/j.intcom.2006.07.001"
    },
    {
      "text": "Ezio Manzini. 1989. The Material of Invention: Materials and Design. MIT Press. Cambridge, USA",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami, and Annika Waern. 2016. Embodied Sketching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI '16). ACM, New York, NY, USA, 6014--6027.  ",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "Paul Marshall, Alissa Antle, Elise Van Den Hoven, and Yvonne Rogers (eds.). Special Issue on the Theory and Practice of Embodied Interaction in HCI and Interaction Design ACM Transactions on ComputerHuman Interaction, Vol. 20, No. 1 (2013)  ",
      "doi": "10.1145/2442106.2442107"
    },
    {
      "text": "Helena M. Mentis, Kristina Höök, Florian Mueller, Katherine Isbister, George Poonkhin Khut, and Toni Robertson. 2014. Designing for the experiential body. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1069--1074.  ",
      "doi": "10.1145/2559206.2579402"
    },
    {
      "text": "Maurice Merleau-Ponty. 1996. Phenomenology of perception. trans. Colin Smith. Motilal Banarsidas",
      "doi": ""
    },
    {
      "text": "Philip R. Ross and Stephan A. G. Wensveen. 2010. Designing Behavior in Interaction: Using Aesthetic Experience as a Mechanism for Design. International Journal of Design. 4, 2. 3--13.",
      "doi": ""
    },
    {
      "text": "Thecla Schiphorst, Kristina Andersen. Between bodies. Proc. CHI 2004 Fringe Papers. ACM Press, 2004",
      "doi": ""
    },
    {
      "text": "Dennis Schleicher, Peter Jones, and Oksana Kachur. 2010. Bodystorming as embodied designing. Interactions 17, 6 (November 2010), 47--51.  ",
      "doi": "10.1145/1865245.1865256"
    },
    {
      "text": "Maxine Sheets-Johnstone. 2010. Why is movement therapeutic? American Journal of Dance Therapy. 32, 1. 2--15.",
      "doi": ""
    },
    {
      "text": "Maxine Sheets-Johnstone. 2011. The primacy of movement. John Benjamins Publishing.",
      "doi": ""
    },
    {
      "text": "Viktor Shklovsky. 1965 (1917). Art as Technique. In Russian Formalist Criticism: Four Essays. Translated by L. Lemon and M. Reis. Lincoln: University of Nebraska Press.",
      "doi": ""
    },
    {
      "text": "Richard Shusterman. 2000. Pragmatist Aesthetics: Living Beauty, Rethinking Art. Second Edition. Lanham, Maryland: Rowman and Littlefield",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Ana Tajadura-Jimez, Nadia BianchiBerthouze, Nic Marquardt, Monica Tentori, Roberto Bresin, and Dana Kulic. 2016. Mind the Gap: A SIG on Bridging the Gap in Research on Body Sensing, Body Perception and Multisensory Feedback. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1092--1095.  ",
      "doi": "10.1145/2851581.2886440"
    },
    {
      "text": "Johan Stjernholm, Katja Vaghi, Emma-Ruth Richards, & Flora Zeta. 2015. Interrelations. Workshop submission for Embodying Embodied Design Research at Århus 2015 Critical Alternatives.",
      "doi": ""
    },
    {
      "text": "Johan Stjernholm, Moving through the virtual: A dramaturgy of choreographic practice and perception. Dance Dramaturgy: Catalyst, Perspective and Memory. Proc. Society of Dance History Scholars Conference, SDSH. 2011.",
      "doi": ""
    },
    {
      "text": "Petra Sundström, Elsa Vaara, Jordi Solsona, Niklas Wirström, Marcus Lundén, Jarmo Laaksolhati, Annika Waern, and Kristina Höök. 2011. Experiential artifacts as a design method for somaesthetic service development. In Proceedings of the 2011 ACM symposium on The role of design in UbiComp research & practice (RDURP '11). ACM, New York, NY, USA, 33--36.  ",
      "doi": "10.1145/2030031.2030041"
    },
    {
      "text": "Doug Svanæs, 2013. Interaction Design for and with the Lived Body: Some Implications of MerleauPonty's Phenomenology. ACM Trans. Comput-Hum. Interact. 20, 1, Article 8 (March 2013)  ",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Oscar Tomico and Danielle Wilde. Embodying Soft Wearables Research. In Proc. Tangible, Embedded, and Embodied Interaction. ACM (2016): 774--777.  ",
      "doi": "10.1145/2839462.2854115"
    },
    {
      "text": "Oscar Tomico and Danielle Wilde. 2016. Soft, embodied, situated & connected: enriching interactions with soft wearables. mUX: The Journal of Mobile User Experience (2016) 5:3",
      "doi": ""
    },
    {
      "text": "Victor Turner. Variations on a Theme of Liminality. In Sally Falk Moore, Barbara G. Myerhoff (eds.) Secular Ritual. Assen {u.a.} : Van Gorcum, 1977. p.36--52.",
      "doi": ""
    },
    {
      "text": "Anna Vallgårda and Ylva Fernaeus. 2015. Interaction Design As a Bricolage Practice. In the Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15), pp. 173--180.  ",
      "doi": "10.1145/2677199.2680594"
    },
    {
      "text": "Anna Vallgårda, Morten Winther, Nina Mørch, & Edit Emese Vizer. 2015. Temporal Form in Interaction Design. International Journal of Design. 9, 3. 1--15.",
      "doi": ""
    },
    {
      "text": "Francisco J. Varela, Evan Thompson and Eleanor Rosch. The Embodied Mind: Cognitive Science and Human Experience. MIT Press (1993)",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Oscar Tomico, Andrés Lucero, Kristina Höök, Jacob Buur. Embodying Embodied Design Research Techniques. 5th Decennial Aarhus Conference on Critical Alternatives. Aarhus University and ACM. 2015 see also: https://embodieddesignresearch.wordpress.com",
      "doi": ""
    },
    {
      "text": "Danielle Wilde. 2015. Embodying Material Ideation. In the Proceedings of the Participatory Innovation Conference, pp. 386--397.",
      "doi": ""
    },
    {
      "text": "Danielle Wilde, Thecla Schiphorst, & Sietske Klooster. 2011. Move to design design to move: a conversation about designing for the body. Interactions. 18, 4. 2227.  ",
      "doi": "10.1145/1978822.1978828"
    },
    {
      "text": "Anna Xambó, Carey Jewitt, and Sara Price. 2014. Towards an integrated methodological framework for understanding embodiment in HCI. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1411--1416.  ",
      "doi": "10.1145/2559206.2581276"
    },
    {
      "text": "Salu P. Ylirisku and Jacob Buur. 2007. Designing with Video. Springer Verlag.",
      "doi": ""
    }
  ]
}