{
  "doi": "10.1145/3025453.3025876",
  "title": "CodePilot: Scaffolding End-to-End Collaborative Software Development for Novice Programmers",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1136-1141",
  "year": 2017,
  "badges": [],
  "abstract": "Novice programmers often have trouble installing, configuring, and managing disparate tools (e.g., version control systems, testing infrastructure, bug trackers) that are required to become productive in a modern collaborative software development environment. To lower the barriers to entry into software development, we created a prototype IDE for novices called CodePilot, which is, to our knowledge, the first attempt to integrate coding, testing, bug reporting, and version control management into a real-time collaborative system. CodePilot enables multiple users to connect to a web-based programming session and work together on several major phases of software development. An eight-subject exploratory user study found that first-time users of CodePilot spontaneously used it to assume roles such as developer/tester and developer/assistant when creating a web application together in pairs. Users felt that CodePilot could aid in scaffolding for novices, situational awareness, and lowering barriers to impromptu collaboration.",
  "authors": [
    {
      "name": "Jeremy Warner",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99658953508/rel-imgonly/year6_headshot_crop.jpg",
      "acmid": "99658953508",
      "orcid": "missing"
    },
    {
      "name": "Philip J. Guo",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488891",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jacob T. Biehl, Mary Czerwinski, Greg Smith, and George G. Robertson. 2007. FASTDash: A Visual Dashboard for Fostering Awareness in Software Teams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1313--1322. DOI: http://dx.doi.org/10.1145/1240624.1240823  ",
      "doi": "10.1145/1240624.1240823"
    },
    {
      "text": "Yan Chen, Steve Oney, and Walter S. Lasecki. 2016. Towards Providing On-Demand Expert Support for Software Developers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3192--3203. DOI: http://dx.doi.org/10.1145/2858036.2858512  ",
      "doi": "10.1145/2858036.2858512"
    },
    {
      "text": "Laura Dabbish, Colleen Stuart, Jason Tsay, and Jim Herbsleb. 2012. Social Coding in GitHub: Transparency and Collaboration in an Open Software Repository. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 1277--1286. DOI: http://dx.doi.org/10.1145/2145204.2145396  ",
      "doi": "10.1145/2145204.2145396"
    },
    {
      "text": "Prasun Dewan, Puneet Agarwal, Gautam Shroff, and Rajesh Hegde. 2009. Distributed Side-by-side Programming. In Proceedings of the 2009 ICSE Workshop on Cooperative and Human Aspects on Software Engineering (CHASE '09). IEEE Computer Society, Washington, DC, USA, 48--55. DOI: http://dx.doi.org/10.1109/CHASE.2009.5071410  ",
      "doi": "10.1109/CHASE.2009.5071410"
    },
    {
      "text": "Hongfei Fan, Chengzheng Sun, and Haifeng Shen. 2012. ATCoPE: Any-time Collaborative Programming Environment for Seamless Integration of Real-time and Non-real-time Teamwork in Software Development. In Proceedings of the 17th ACM International Conference on Supporting Group Work (GROUP '12). ACM, New York, NY, USA, 107--116. DOI: http://dx.doi.org/10.1145/2389176.2389194  ",
      "doi": "10.1145/2389176.2389194"
    },
    {
      "text": "Max Goldman, Greg Little, and Robert C. Miller. 2011. Real-time Collaborative Coding in a Web IDE. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 155--164. DOI: http://dx.doi.org/10.1145/2047196.2047215  ",
      "doi": "10.1145/2047196.2047215"
    },
    {
      "text": "Max Goldman and Robert C. Miller. 2010. Test-driven Roles for Pair Programming. In Proceedings of the 2010 ICSE Workshop on Cooperative and Human Aspects of Software Engineering (CHASE '10). ACM, New York, NY, USA, 13--20. DOI: http://dx.doi.org/10.1145/1833310.1833313  ",
      "doi": "10.1145/1833310.1833313"
    },
    {
      "text": "Lile Hattori and Michele Lanza. 2010. Syde: A Tool for Collaborative Software Development. In Proceedings of the 32Nd ACM/IEEE International Conference on Software Engineering - Volume 2 (ICSE '10). ACM, New York, NY, USA, 235--238. DOI: http://dx.doi.org/10.1145/1810295.1810339  ",
      "doi": "10.1145/1810295.1810339"
    },
    {
      "text": "R. Hegde and P. Dewan. 2008. Connecting Programming Environments to Support Ad-Hoc Collaboration. In Proceedings of the 2008 23rd IEEE/ACM International Conference on Automated Software Engineering (ASE '08). IEEE Computer Society, Washington, DC, USA, 178--187. DOI:http://dx.doi.org/10.1109/ASE.2008.28  ",
      "doi": "10.1109/ASE.2008.28"
    },
    {
      "text": "James D. Herbsleb. 2007. Global Software Engineering: The Future of Socio-technical Coordination. In 2007 Future of Software Engineering (FOSE '07). IEEE Computer Society, Washington, DC, USA, 188--198. DOI:http://dx.doi.org/10.1109/FOSE.2007.11  ",
      "doi": "10.1109/FOSE.2007.11"
    },
    {
      "text": "Stephan Salinger, Christopher Oezbek, Karl Beecher, and Julia Schenk. 2010. Saros: An Eclipse Plug-in for Distributed Party Programming. In Proceedings of the 2010 ICSE Workshop on Cooperative and Human Aspects of Software Engineering (CHASE '10). ACM, New York, NY, USA, 48--55. DOI: http://dx.doi.org/10.1145/1833310.1833319  ",
      "doi": "10.1145/1833310.1833319"
    },
    {
      "text": "Patrick Thibodeau. 2013. India to overtake U.S. on number of developers by 2017. http: //www.computerworld.com/article/2483690/it-careers/ india-to-overtake-u-s--on-number-of-developers-by-2017. html. (2013). Accessed: 2016-09--13.",
      "doi": ""
    },
    {
      "text": "Laurie Williams, Robert R. Kessler, Ward Cunningham, and Ron Jeffries. 2000. Strengthening the Case for Pair Programming. IEEE Software 17, 4 (July 2000), 19--25. DOI:http://dx.doi.org/10.1109/52.854064  ",
      "doi": "10.1109/52.854064"
    },
    {
      "text": "Laurie Williams, Charlie McDowell, Nachiappan Nagappan, Julian Fernald, and Linda Werner. 2003. Building Pair Programming Knowledge Through a Family of Experiments. In Proceedings of the 2003 International Symposium on Empirical Software Engineering (ISESE '03). IEEE Computer Society, Washington, DC, USA, 143--. http://dl.acm.org/citation.cfm?id=942801.943642 ",
      "doi": ""
    }
  ]
}