{
  "doi": "10.1145/3025453.3025570",
  "title": "Prescribing 10,000 Steps Like Aspirin: Designing a Novel Interface for Data-Driven Medical Consultations",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5787-5799",
  "year": 2017,
  "badges": [],
  "abstract": "Due to the prevalence of personal health tracking, cases of self-logged data being utilized in the clinic are gradually increasing. However, obstacles to clinicians' ability to further adopt such data-driven medical consultations in the existing workflow remain, such as lack of time and poor interoperability. In this paper, we conducted a workshop to design a clinician interface supporting the integration of data-driven consultation into the existing workflow and investigate the role of the interface in situ. After implementing the clinician interface designed based on the workshop results, we observed 32 cases of actual use within the clinical context. We found that our interface, DataMD, helped the clinician construct a new workflow, enhanced the clinician's counseling skills, and facilitated more in-depth conversation. This paper contributes to empirically identifying the role of a clinician interface through a user-centered design approach.",
  "authors": [
    {
      "name": "Yoojung Kim",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958697457",
      "orcid": "missing"
    },
    {
      "name": "Eunyoung Heo",
      "institution": "Seoul National University Bundang Hospital, Seongnam-si, Gyeonggi-do, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162579",
      "orcid": "missing"
    },
    {
      "name": "Hyunjeong Lee",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021440",
      "orcid": "missing"
    },
    {
      "name": "Sookyoung Ji",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490650402",
      "orcid": "missing"
    },
    {
      "name": "Jueun Choi",
      "institution": "Seoul National Universtiy, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161922",
      "orcid": "missing"
    },
    {
      "name": "Jeong-Whun Kim",
      "institution": "Seoul National University Bundang Hospital, Seongnam, Kyunggi-do, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020095",
      "orcid": "missing"
    },
    {
      "name": "Joongseek Lee",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490660504",
      "orcid": "missing"
    },
    {
      "name": "Sooyoung Yoo",
      "institution": "Seoul National University Bundang Hospital, Seongnam, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317502841",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Manal Almalki, Kathleen Gray, and Fernando Martin Sanchez. The use of self-quantification systems for personal health information: big data management activities and prospects. Health information science and systems 3, 1 (2015): 1.",
      "doi": ""
    },
    {
      "text": "Jessica S. Ancker, Holly O. Witteman, Baria Hafeez, Thierry Provencher, Mary Van de Graaf, and Esther Wei. 2015. \"You Get Reminded You're a Sick Person\": Personal Data Tracking and Patients With Multiple Chronic Conditions. Journal of medical Internet research. 17, 8 (August 2015): e202.",
      "doi": ""
    },
    {
      "text": "Jessica S Ancker, Holly O. Witteman, Baria Hafeez, Thierry Provencher, Mary Van de Graaf, and Esther Wei. 2015. The invisible work of personal health information management among people with multiple chronic conditions: qualitative interview study among patients and providers. Journal of medical Internet research 17, 6 (June 2015):137.",
      "doi": ""
    },
    {
      "text": "Ole A. Andreas, Anita Das, and Dag Svanæs. 2012. Mobile health IT: The effect of user interface and form factor on doctor-patient communication. International journal of medical informatics 81, 1 (January 2012): 12--28.",
      "doi": ""
    },
    {
      "text": "Jessica S. Ancker, Holly O. Witteman, Baria Hafeez, Thierry Provencher, Mary Van de Graaf, and Esther Wei. 2015. The invisible work of personal health information management among people with multiple chronic conditions: qualitative interview study among patients and providers. Journal of medical Internet research 17, 6 (2015).",
      "doi": ""
    },
    {
      "text": "Geoff Appelboom, Melissa LoPresti, Jean-Yves Reginster, E. Sander Connolly, and Emmanuel PL Dumont. 2014. The quantified patient: a patient participatory culture. Current medical research and opinion 30, 12 (December 2014): 2585--2587.",
      "doi": ""
    },
    {
      "text": "Stinne Aaløkke Ballegaard, Thomas Riisgaard Hansen, and Morten Kyng. 2008. Healthcare in everyday life: designing healthcare services for daily life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1807--1816.  ",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Stefan Becker, Talya Miron-Shatz, Nikolaus Schumacher, Johann Krocza, Clarissa Diamantidis, and Urs-Vito Albrecht. 2014. mHealth 2.0: experiences, possibilities, and perspectives. JMIR mHealth and uHealth 2, 2 (April-June 2014): e24.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, and Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Trans. Comput.-Hum. Interact. 20, 5, Article 30 (November 2013), 27 pages.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (January 2006): 77--101.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, Sidney Harrison, and Victoria Duong. 2011. Unpacking exam-room computing: negotiating computer-use in patient-physician interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3343--3352.  ",
      "doi": "10.1145/1978942.1979438"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 121--132.  ",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, and Sean A. Munson. 2015. More than telemonitoring: Health provider use and nonuse of lifelog data in irritable bowel syndrome and weight management. Journal of medical Internet research 17, 8 (August 2015): e203.",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Kristin Dew, Allison Cole, Jasmine Zia, James Fogarty, Julie A. Kientz, and Sean A. Munson. 2016. Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 770--786.  ",
      "doi": "10.1145/2818048.2819926"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity sensing in the wild: a field trial of ubifit garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Martin Dawes and Sampson Uchechukwu. 2003. Knowledge management in clinical practice: a systematic review of information seeking behavior in physicians. International journal of medical informatics 71, 1 (August 2003): 9--15.",
      "doi": ""
    },
    {
      "text": "Neelima Deshpande, Mary Publicover, Harry Gee, and Khalid S. Khan. 2003. Incorporating the views of obstetric clinicians in implementing evidence-supported labour and delivery suite ward rounds: a case study. Health Information & Libraries Journal 20, 2 (June 2003): 86--94.",
      "doi": ""
    },
    {
      "text": "Manon L. Dontje, Martijn de Groot, Remko R. Lengton, Cees P. van der Schans, and Wim P. Krijnen. 2015. Measuring steps with the Fitbit activity tracker: an inter-device reliability study. Journal of medical engineering & technology 39, no. 5 (2015): 286--290.",
      "doi": ""
    },
    {
      "text": "Glyn Elwyn, Adrian Edwards, and Paul Kinnersley. 1999. Shared decision-making in primary care: the neglected second half of the consultation. Br J Gen Pract 49, 443 (1999): 477--482.",
      "doi": ""
    },
    {
      "text": "Deborah Estrin and Ida Sim. 2010. Open mHealth architecture: an engine for health care innovation. Science 330, 6005 (2010): 759--760.",
      "doi": ""
    },
    {
      "text": "Caroline Free, Gemma Phillips, Louise Watson, Leandro Galli, Lambert Felix, Phil Edwards, Vikram Patel, and Andy Haines. 2013. The effectiveness of mobile-health technologies to improve health care service delivery processes: a systematic review and meta-analysis. PLoS Med 10, 1 (15 January 2013): e1001363.",
      "doi": ""
    },
    {
      "text": "Susannah Fox and Maeve Duggan. Tracking for health. Pew Research Center's Internet & American Life Project, 2013.",
      "doi": ""
    },
    {
      "text": "Gary Wolf - The Quantified Self. Video. (June 2010). Retrieved September 22, 2016 from https://www.ted.com/talks/gary_wolf_the_quantified_self?language=en",
      "doi": ""
    },
    {
      "text": "Valerie Gay and Peter Leijdekkers. 2015. Bringing health and fitness data together for connected health care: mobile apps as enablers of interoperability. Journal of medical Internet research 17, 11 (November 2015).",
      "doi": ""
    },
    {
      "text": "Google Fit. Retrieved 2016 form https://www.google.com/fit/",
      "doi": ""
    },
    {
      "text": "Amanda Hall and Graham Walton. 2004. Information overload within the health care system: a literature review. Health Information & Libraries Journal 21, 2 (June 2004): 102--108.",
      "doi": ""
    },
    {
      "text": "Healthkit Apple Developer. Retrieved from https://developer.apple.com/healthkit/",
      "doi": ""
    },
    {
      "text": "Alastair van Heerden, Mark Tomlinson, and Leslie Swartz. 2012. Point of care in your pocket: a research agenda for the field of m-health. Bulletin of the World Health Organization 90, 5 (2012): 393--394.",
      "doi": ""
    },
    {
      "text": "Institute for Health Technology. Transforming Health Care Through Big Data: Strategies for leveraging big data in the health care industry. Institute for Health Technology. 2013",
      "doi": ""
    },
    {
      "text": "Nicholas Huba and Yan Zhang. 2012. Designing patient-centered personal health records (PHRs): health care professionals' perspective on patient-generated data. Journal of medical systems 36, 6 (2012): 38933905.  ",
      "doi": "10.1007/s10916-012-9861-z"
    },
    {
      "text": "Eun-Young Jung, Jonghun Kim, Kyung-Yong Chung, and Dong Kyun Park. Mobile healthcare application with EMR interoperability for diabetes patients. Cluster Computing 17, 3 (November 2014): 871--880.  ",
      "doi": "10.1007/s10586-013-0315-2"
    },
    {
      "text": "Sandra K. Joos, David H. Hickam, Geoffrey H. Gordon, and Laurence H. Baker. 1996. Effects of a physician communication intervention on patient care outcomes. Journal of general internal medicine 11, no. 3 (1996): 147--155.",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Sookyoung Ji, Hyunjeong Lee, JeongWhun Kim, Sooyoung Yoo, and Joongseek Lee. 2016. \"My Doctor is Keeping an Eye on Me!\" Exploring the Clinical Applicability of a Mobile Food Logger. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5620--5631.  ",
      "doi": "10.1145/2858036.2858145"
    },
    {
      "text": "Rober F. Kushner. 1995. Barriers to providing nutrition counseling by physicians: a survey of primary care practitioners. Preventive medicine 24, 6 (1995): 546552.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "John Lynn. 2015. Fitbit Data in the EMR? Retrieved from http://www.emrandehr.com/2015/11/03/fitbit-data-in-the-emr/",
      "doi": ""
    },
    {
      "text": "Maulik D. Majmudar, Lina Avancini Colucci, and Adam B. Landman. The quantified patient of the future: Opportunities and challenges. In Healthcare 3, (3): 153--156. Elsevier, 2015.",
      "doi": ""
    },
    {
      "text": "Stephane Meystre. 2005. The current state of telemonitoring: a comment on the literature. Telemedicine Journal & e-Health 11, 1 (February 2005): 63--69.",
      "doi": ""
    },
    {
      "text": "Sonali R. Mishra, Shefali Haldar, Ari H. Pollack, Logan Kendall, Andrew D. Miller, Maher Khelifi, and Wanda Pratt. 2016. \"Not Just a Receiver\": Understanding Patient Behavior in the Hospital Environment. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3103--3114.  ",
      "doi": "10.1145/2858036.2858167"
    },
    {
      "text": "Ira S. Ockene, James R. Hebert, Judith K. Ockene, Gordon M. Saperia, Ed Stanek, Robert Nicolosi, Philip A. Merriam, and Thomas G. Hurley. 1999. Effect of physician-delivered nutrition counseling training and an office-support program on saturated fat intake, weight, and serum lipid measurements in a hyperlipidemic population: Worcester Area Trial for Counseling in Hyperlipidemia (WATCH). Archives of Internal Medicine 159, 7 (April 1999): 725--731.",
      "doi": ""
    },
    {
      "text": "Bernardine M. Pinto, Henry Lynn, Bess H. Marcus, Judith DePue, and Michael G. Goldstein. 2001. Physician-based activity counseling: intervention effects on mediators of motivational readiness for physical activity. Annals of Behavioral Medicine 23, no. 1 (February 2001): 2--10.",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Min Hane Aung, Mi Zhang, and Tanzeem Choudhury. 2015. MyBehavior: automatic personalized health feedback from user behaviors and preferences using smartphones. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 707--718.  ",
      "doi": "10.1145/2750858.2805840"
    },
    {
      "text": "Reframer. Retrieved from https://www.optimalworkshop.com/reframer",
      "doi": ""
    },
    {
      "text": "Coline W. Rhodes, 2015. Fitbit data in the EMR? I don't think so! Retrieved November 2 from https://healthcareit.me/2015/11/02/fitbit-data-in-the-emr-i-dont-think-so/",
      "doi": ""
    },
    {
      "text": "Nancy K. Russell and Debra L. Roter. 1993. Health promotion counseling of chronic-disease patients during primary care visits. American journal of public health 83, 7 (July 1993): 979--982.",
      "doi": ""
    },
    {
      "text": "Line Silsand and Gunnar Ellingsen. 2016. Complex Decision-Making in Clinical Practice. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 993--1004.  ",
      "doi": "10.1145/2818048.2819952"
    },
    {
      "text": "Moira Stewart, Judith Belle Brown, Heather Boon, Joanne Galajda, Leslie Meredith, and Michelle Sangster. 1999. Evidence on patient-doctor communication. Cancer 25 (1999): 30.",
      "doi": ""
    },
    {
      "text": "Mark Sullivan. 2015. Guess what? Doctors don't care about your Fitbit data. Retrieved August 15, 2015 from http://venturebeat.com/2014/08/15/guess-what-doctors-dont-care-about-your-fitbit-data/",
      "doi": ""
    },
    {
      "text": "Teresa Taft, Leslie Lenert, Farrant Sakguchi, Gregory Stoddard, Caroline Milne. 2014. Effects of electronic health record use on the exam room communication skills of resident physicians: a randomized within-subjects study. Journal of the American Medical Informatics Association: amiajnl-2014.",
      "doi": ""
    },
    {
      "text": "Athanasios Tsoukalas, Timothy Albertson, and Ilias Tagkopoulos. 2015. From data to optimal decision making: a data-driven, probabilistic machine learning approach to decision support for patients with sepsis. JMIR medical informatics 3.1 (2015): e11.",
      "doi": ""
    },
    {
      "text": "Chris Welch. 2015. Major Los Angeles hospital enables Apple's HealthKit for 80,000 patients. Retrieved April 27, 2015 from http://www.theverge.com/2015/4/27/8502929/apple-healthkit-cedars-sinai-hospital",
      "doi": ""
    },
    {
      "text": "Peter West, Richard Giordano, Max Van Kleek, and Nigel Shadbolt. 2016. The Quantified Patient in the Doctor's Office: Challenges & Opportunities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3066--3078.  ",
      "doi": "10.1145/2858036.2858445"
    },
    {
      "text": "Nathan Zeldes and Neil Baum. 2011. Information overload in medical practice. The Journal of medical practice management: MPM. 26, 5: 314.",
      "doi": ""
    }
  ]
}