{
  "doi": "10.1145/3025453.3025489",
  "title": "SoPhy: A Wearable Technology for Lower Limb Assessment in Video Consultations of Physiotherapy",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3916-3928",
  "year": 2017,
  "badges": [],
  "abstract": "Physiotherapists are increasingly using video conferencing tools for their teleconsultations. Yet, the assessment of subtle differences in body movements remains a challenge. To support lower limb assessment in video consultations, we present SoPhy, a wearable technology consisting of a pair of socks with embedded sensors for patients to wear; and a web interface that displays information about range of weight distribution, foot movement, and foot orientation for physiotherapists in real-time. We conducted a laboratory study of 40 video consultations, in which postgraduate physiotherapy students assessed lower limb function. We compare assessment with and without SoPhy. Findings show that SoPhy increased the confidence in assessing squats exercise and fewer repetitions were required to assess patients when using SoPhy. We discuss the significance of SoPhy to address the challenges of assessing bodily information over video, and present considerations for its integration with clinical practices and tools.",
  "authors": [
    {
      "name": "Deepti Aggarwal",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501672387",
      "orcid": "missing"
    },
    {
      "name": "Weiyi Zhang",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161182",
      "orcid": "missing"
    },
    {
      "name": "Thuong Hoang",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442608558",
      "orcid": "0000-0001-7354-260X"
    },
    {
      "name": "Bernd Ploderer",
      "institution": "University of Melbourne & Queensland University of Technology, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81311485528/rel-imgonly/bp2017-167a8820portrait.jpg",
      "acmid": "81311485528",
      "orcid": "missing"
    },
    {
      "name": "Frank Vetere",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    },
    {
      "name": "Mark Bradford",
      "institution": "Royal Children's Hospital, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659035599",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adafruit 9-DOF Absolute Orientation IMU Fusion Breakout https://www.adafruit.com/product/2472",
      "doi": ""
    },
    {
      "text": "Arduino Pro Mini Microcontroller. https://www.arduino.cc/en/Main/ArduinoBoardProMini",
      "doi": ""
    },
    {
      "text": "Deepti Aggarwal, Bernd Ploderer, Frank Vetere, Mark Bradford, and Thuong Hoang. 2016. Doctor, Can You See My Squats? Understanding Bodily Communication in Video Consultations for Physiotherapy. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, 1197--1208. DOI: http://dx.doi.org/10.1145/2901790.2901871  ",
      "doi": "10.1145/2901790.2901871"
    },
    {
      "text": "Deepti Aggarwal, Robyn Garnett, Bernd Ploderer, Frank Vetere, Patricia Eadie, and Bronwyn Joy Davidson. 2015. Understanding Video based Parent Training Intervention for Children with Autism. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), ACM, 10--19. DOI: https://doi.org/10.1145/2838739.2838770",
      "doi": "10.1145/2838739.2838770"
    },
    {
      "text": "Swamy Ananthanarayan, Miranda Sheh, Alice Chien, Halley Profita, and Katie A. Siek. 2014. Designing wearable interfaces for knee rehabilitation. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '14). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, 101--108. DOI=http://dx.doi.org/10.4108/icst.pervasivehealth.2014.",
      "doi": ""
    },
    {
      "text": "Mobolaji Ayoade and Lynne Baillie. 2014. A novel knee rehabilitation system for the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 2521--2530. DOI: http://dx.doi.org/10.1145/2556288.2557353  ",
      "doi": "10.1145/2556288.2557353"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative research in psychology 3, 2(2006), 77--101. ",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, Sidney Harrison, and Victoria Duong. 2011. Unpacking exam-room computing: negotiating computer-use in patient-physician interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 3343--3352. DOI=http://dx.doi.org/10.1145/1978942.1979438  ",
      "doi": "10.1145/1978942.1979438"
    },
    {
      "text": "George Demiris, Neil Charness, Elizabeth Krupinski, David Ben-Arieh, Karla Washington, John Wu, and Bonne Farberow. 2010. The Role of Human Factors in Telehealth. Telemedicine and e-Health. 16(4): 446--453. ",
      "doi": ""
    },
    {
      "text": "Diabetic Pressure Sensing Stockings. https://www.fraunhofer.de/en/press/researchnews/2015/may/Pressure-monitoring-stockings-to-prevent-wounds-in-diabetics.html.",
      "doi": ""
    },
    {
      "text": "Sarah Dods, Jill Freyne, Leila Alem, Surya Nepal, Jane Li, and Julian Jang-Jaccard. 2012. Caring for the Last 3%: Telehealth Potential and Broadband Implications for Remote Australia. Canberra: CSIRO. https://publications.csiro.au/rpr/download?pid=csiro:EP129516&dsid=DS3",
      "doi": ""
    },
    {
      "text": "Julie Doyle, Cathy Bailey, Ben Dromey, Cliodhna Ni Scanaill. 2010. BASE - An Interactive Technology Solution to Deliver Balance and Strength Exercises to Older Adults. In 4th International Conference on Pervasive Computing Technologies for Healthcare, PervasiveHealth 2010, 1--5. ",
      "doi": ""
    },
    {
      "text": "Anne G. Ekeland, Alison Bowes, and Signe Flottorp. 2010. Effectiveness of telemedicine: A systematic review of reviews. International Journal of medical informatics 2010, 79(11), 736--771. ",
      "doi": ""
    },
    {
      "text": "Geraldine Fitzpatrick, and Gunnar Ellingsen. 2013. A review of 25 years of CSCW Research in Healthcare: Contributions, Challenges and Future Agendas. Computer Supported Cooperative Work (CSCW), 22, 4-6, 609--665. http://dx.doi.org/10.1007/s10606-012-9168-0  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Flexiforce Pressure Sensor https://www.sparkfun.com/products/11207",
      "doi": ""
    },
    {
      "text": "Flex Sensor 2.2\" https://www.sparkfun.com/products/10264",
      "doi": ""
    },
    {
      "text": "Thuong N. Hoang, Martin Reinoso, Frank Vetere, and Egemen Tanin. 2016. Onebody: Remote Posture Guidance System using First Person View in Virtual Environment. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, Article 25, 10 pages. DOI: https://doi.org/10.1145/2971485.2971521",
      "doi": "10.1145/2971485.2971521"
    },
    {
      "text": "Jun-Da Huang. 2011. Kinerehab: a kinect-based system for physical rehabilitation: a pilot study for young adults with motor disabilities. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11). ACM, 319320. DOI=http://dx.doi.org/10.1145/2049536.2049627  ",
      "doi": "10.1145/2049536.2049627"
    },
    {
      "text": "Rose Johnson, Nadia Bianchi-Berthouze, Yvonne Rogers, and Janet van der Linden. 2013. Embracing calibration in body sensing: using self-tweaking to enhance ownership and performance. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, NY, NY, USA, 811--820. DOI=http://dx.doi.org/10.1145/2493432.2493457  ",
      "doi": "10.1145/2493432.2493457"
    },
    {
      "text": "Agnes W. K. Lam, Danniel Varona-Marin, Yeti Li, Mitchell Fergenbaum, and Dana Kulić. 2016. Automated Rehabilitation System: Movement Measurement and Feedback for Patients and Physiotherapists in the Rehabilitation Clinic. Hum.-Comput. Interact. 31, 2016, 294--334.  ",
      "doi": "10.1080/07370024.2015.1093419"
    },
    {
      "text": "Min Kyung Lee, Nathaniel Fruchter, and Laura Dabbish. 2015. Making Decisions From a Distance: The Impact of Technological Mediation on Riskiness and Dehumanization. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, 1576--1589. DOI: http://dx.doi.org/10.1145/2675133.2675288  ",
      "doi": "10.1145/2675133.2675288"
    },
    {
      "text": "Christian Licoppe, and Julien Morel. 2012. Video-ininteraction: \"Talking heads\" and the multimodal organization of mobile and Skype video calls. Research on Language & Social Interaction 2012, 45(4), 399--429. http://dx.doi.org/10.1080/08351813.2012.724996 ",
      "doi": ""
    },
    {
      "text": "LilyPad Arduino Main Board. https://www.arduino.cc/en/Main/ArduinoBoardLilyPad",
      "doi": ""
    },
    {
      "text": "Rian McGough, Kade Paterson, Elizabeth J. Bradshaw, Adam L. Bryant, and Ross A. Clark. 2012. Improving Lower Limb Weight Distribution Asymmetry During the Squat Using Nintendo Wii Balance Boards and Real-time Feedback. In Journal of Strength and Conditioning Research 2012, 26(1), 47--52. ",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken, Oliver Sack, and Martina Ziefle. 2011. People and a virtual doctor's visit: learning about multiple acceptance aspects of a telemedical scenario. In Proceedings of the 5th International Conference on Pervasive Computing Technologies for Healthcare, PervasiveHealth, 2011, 577--584.",
      "doi": ""
    },
    {
      "text": "Edward Alan Miller. 2011. The continuing need to investigate the nature and content of Teleconsultation communication using interaction analysis techniques. Telemedicine and Telecare, 17(2): 55--64. ",
      "doi": ""
    },
    {
      "text": "Bijan Najafi, Gurtej Grewal, Saman Parvaneh, Robert A Menzies, Talal K Talal, and David G Armstrong. 2013. SmartSox- A Smart Textile to Prevent Diabetic Foot Amputation. https://diabeticfootonline.com/2013/11/18/smartsox-asmart-textile-to-prevent-diabetic-foot-amputation/",
      "doi": ""
    },
    {
      "text": "Kenton O'Hara, Cecily Morrison, Abigail Sellen, Nadia Bianchi-Berthouze, and Cathy Craig. 2016. Body tracking in healthcare. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving 5, no. 1 (2016): 1151. ",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal, and Michael Haller. 2016. FlexTiles: A Flexible, Stretchable, Formable, Pressure-Sensitive, Tactile Input Sensor. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, 3754--3757. DOI: http://dx.doi.org/10.1145/2851581.2890253  ",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "T. G. Russell, P. Buttrum, R. Wootton, and G. A. Jull. 2011. Internet-based outpatient telerehabilitation for patients following total knee arthroplasty: a randomized controlled trial. The Journal of Bone and Joint Surgery, 2011, 93(2), 113--120. ",
      "doi": ""
    },
    {
      "text": "Marc R. Sarnow, Barry I. Rosenblum, Aristidis Veves, James S. Chrzan, John M. Giurini, Geoffrey M. Habesrshaw. 1994. In-Shoe Foot Pressure Measurements in Diabetic Patients With At-Risk Feet and in Healthy Subjects. In Diabetes Care, 17(9), 1002--1006. ",
      "doi": ""
    },
    {
      "text": "Sensoria Fitness Socks and Anklets http://www.sensoriafitness.com/",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Stefano Piana, Davide Pollarolo, Gualtiero Volpe, Giovanna Varni, Ana Tajadura-Jimenez, Amanda CdeC Williams, Antonio Camurri & Nadia Bianchi-Berthouze. 2016. Go-with-the-Flow: Tracking, Analysis and Sonification of Movement and Breathing to Build Confidence in Activity Despite Chronic Pain. Human Computer Interaction 2016, 1--49.",
      "doi": ""
    },
    {
      "text": "Sparkfun Bluetooth mate Silver https://www.sparkfun.com/products/12576",
      "doi": ""
    },
    {
      "text": "Duncan Roderick Stevenson. 2011. Tertiary-Level Telehealth: A Media Space Application. Computer Supported Cooperative Work (CSCW), 20: 61--92.  ",
      "doi": "10.1007/s10606-010-9125-8"
    },
    {
      "text": "M. A. Stewart. 1995. Effective physician-patient communication and health outcomes: a review. In Journal of Can Med Assoc., 1423--1433.",
      "doi": ""
    },
    {
      "text": "Richard Tang, Xing-Dong Yang, Scott Bateman, Joaquim Jorge, and Anthony Tang. 2015. Physio@Home: Exploring Visual Guidance and Feedback Techniques for Physiotherapy Exercises. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4123--4132. DOI: http://doi.acm.org/10.1145/2702123.2702401",
      "doi": "10.1145/2702123.2702401"
    },
    {
      "text": "Ana Tajadura-Jiménez, Maria Basia, Ophelia Deroy, Merle Fairhurst, Nicolai Marquardt, and Nadia Bianchi-Berthouze. 2015. As Light as your Footsteps: Altering Walking Sounds to Change Perceived Body Weight, Emotional State and Gait. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2943--2952. DOI: http://dx.doi.org/10.1145/2702123.2702374  ",
      "doi": "10.1145/2702123.2702374"
    },
    {
      "text": "G. Tao, P. S. Archambault and M. F. Levin. 2013. Evaluation of Kinect skeletal tracking in a virtual reality rehabilitation system for upper limb hemiparesis. In 2013 International Conference on Virtual Rehabilitation (ICVR), IEEE, 164--165. ",
      "doi": ""
    },
    {
      "text": "Liezl van Dyk. 2014. A review of Telehealth Service Implementation Frameworks. International journal of environmental research and public health 11, no. 2 (2014): 1279--1298. ",
      "doi": ""
    },
    {
      "text": "Junji Watanabe, Hideyuki Ando, and Taro Maeda. 2005. Shoe-shaped interface for inducing a walking cycle. In Proceedings of the 2005 international conference on Augmented tele-existence (ICAT '05). ACM, 30--34. DOI=http://dx.doi.org/10.1145/1152399.1152406  ",
      "doi": "10.1145/1152399.1152406"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 143--146. DOI=http://dx.doi.org/10.1145/1978942.1978963.  ",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}