{
  "doi": "10.1145/3025453.3025518",
  "title": "Audible Beacons and Wearables in Schools: Helping Young Visually Impaired Children Play and Move Independently",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4146-4157",
  "year": 2017,
  "badges": [],
  "abstract": "Young children with visual impairments tend to engage less with their surroundings, limiting the benefits from activities at school. We investigated novel ways of using sound from a bracelet, such as speech or familiar noises, to tell children about nearby people, places and activities, to encourage them to engage more during play and help them move independently. We present a series of studies, the first two involving visual impairment educators, that give insight into challenges faced by visually impaired children at school and how sound might help them. We then present a focus group with visually impaired children that gives further insight into the effective use of sound. Our findings reveal novel ways of combining sounds from wearables with sounds from the environment, motivating audible beacons, devices for audio output and proximity estimation. We present scenarios, findings and a design space that show the novel ways such devices could be used alongside wearables to help visually impaired children at school.",
  "tags": [
    "beacons",
    "visual impairment",
    "wearables",
    "children",
    "play"
  ],
  "authors": [
    {
      "name": "Euan Freeman",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548012975",
      "orcid": "missing"
    },
    {
      "name": "Graham Wilson",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467653138",
      "orcid": "0000-0003-2664-1634"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Gabriel Baud-Bovy",
      "institution": "Italian Institute of Technology, Genova, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435594241",
      "orcid": "missing"
    },
    {
      "name": "Charlotte Magnusson",
      "institution": "Lund University, Lund, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489667",
      "orcid": "missing"
    },
    {
      "name": "Hector Caltenco",
      "institution": "Lund University, Lund, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658643363",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anupriya Ankolekar, Thomas Sandholm, and Louis Yu. 2013. Play it by Ear: A Case for Serendipitous Discovery of Places with Musicons. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM Press, 2959--2968. DOI: http://dx.doi.org/10.1145/2470654.2481411  ",
      "doi": "10.1145/2470654.2481411"
    },
    {
      "text": "Jorg Baus, Rainer Wasinger, Ilhan Aslan, Antonio Krüger, Andreas Maier, and Tim Schwartz. 2007. Auditory Perceptible Landmarks in Mobile Navigation. In Proceedings of the 12th international conference on Intelligent user interfaces - IUI '07. ACM Press, 302--304. DOI:http://dx.doi.org/10.1145/1216295.1216352  ",
      "doi": "10.1145/1216295.1216352"
    },
    {
      "text": "Liam Betsworth, Nitendra Rajput, Saurabh Srivastava, and Matt Jones. 2013. Audvert: Using Spatial Audio to Gain a Sense of Place. In Proceedings of INTERACT '13 in LNCS 8120. IFIP, 455--462. DOI: http://dx.doi.org/10.1007/978--3--642--40498--6_35",
      "doi": ""
    },
    {
      "text": "Jeffrey R. Blum, Mathieu Bouchard, and Jeremy R. Cooperstock. 2012. What's Around Me? Spatialized Audio Augmented Reality for Blind Users with a Smartphone. In Proceedings of Mobile and Ubiquitous Systems: Computing, Networking, and Services Mobiquitous '12. Springer, 49--62. DOI: http://dx.doi.org/10.1007/978--3--642--30973--1_5",
      "doi": ""
    },
    {
      "text": "Jeffrey R. Blum, Mathieu Bouchard, and Jeremy R. Cooperstock. 2013. Spatialized Audio Environmental Awareness for Blind Users with a Smartphone. Mobile Networks and Applications 18, 3 (2013), 295--309. DOI: http://dx.doi.org/10.1007/s11036-012-0425--8",
      "doi": ""
    },
    {
      "text": "Cynathia M. Brame, Don Martin, and Paige Martin. 1998. Counseling the Blind or Visually Impaired Child: An Examination of Behavioral Techniques. Professional School Counseling 1, 5 (1998), 60--62.",
      "doi": ""
    },
    {
      "text": "Anke Brock, Slim Kammoun, Marc Macé, and Christophe Jouffrais. 2014. Using wrist vibrations to guide hand movement and whole body navigation. I-Com 13, 3 (2014), 19--28. DOI: http://dx.doi.org/10.1515/icom.2014.0026 ",
      "doi": ""
    },
    {
      "text": "Héctor Caltenco, Charlotte Magnusson, Bitte Rydeman, Sara Finocchietti, Giulia Cappagli, Elena Cocchi, Lope Ben Porquis, Gabriel Baud-bovy, and Monica Gori. 2016. Co-designing Wearable Technology Together with Visually Impaired Children. International Journal of Mobile Human Computer Interaction 8, 4 (2016), 68--84. DOI:http://dx.doi.org/10.4018/IJMHCI.2016100104  ",
      "doi": "10.4018/IJMHCI.2016100104"
    },
    {
      "text": "Sylvain Cardin, Daniel Thalmann, and Frédéric Vexo. 2007. A wearable system for mobility improvement of visually impaired people. Visual Computer 23, 2 (2007), 109--118. DOI: http://dx.doi.org/10.1007/s00371-006-0032--4",
      "doi": ""
    },
    {
      "text": "Hsuan-Eng Chen, Yi-Ying Lin, Chien-Hsing Chen, and I-Fang Wang. 2015. BlindNavi: A Navigation App for the Visually Impaired Smartphone User. In CHI '15 Extended Abstracts on Human Factors in Computing Systems. ACM Press, 19--24. DOI: http://dx.doi.org/10.1145/2702613.2726953  ",
      "doi": "10.1145/2702613.2726953"
    },
    {
      "text": "Ling Chen, Ibrar Hussain, Ri Chen, WeiKai Huang, and Gencai Chen. 2013. BlueView: A Perception Assistant System for the Visually Impaired. In Adjunct Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing - UbiComp '13 Adjunct. ACM Press, 143--146. DOI: http://dx.doi.org/10.1145/2494091.2494139  ",
      "doi": "10.1145/2494091.2494139"
    },
    {
      "text": "Vlad Coroama and Felix Röthenbacher. 2003. The Chatty Environment - Providing Everyday Independence to the Visually Impaired. In The 2nd International Workshop on Ubiquitous Computing for Pervasive Healthcare Applications at Ubicomp '03. http://citeseerx.ist.psu. edu/viewdoc/summary?doi=10.1.1.5.7386",
      "doi": ""
    },
    {
      "text": "Elisa Fazzi, Josè Lanners, Simona Danova, Oreste Ferrarri-Ginevra, Chiara Gheza, Antonella Luparia, Umberto Balottin, and Giovanni Lanzi. 1999. Stereotyped behaviours in blind children. Brain and Development 21 (1999), 522--528. DOI: http://dx.doi.org/10.1016/S0387--7604(99)00059--5",
      "doi": ""
    },
    {
      "text": "Sara Finocchietti, Giulia Cappagli, Gabriel Baud-Bovy, Charlotte Magnusson, Héctor Caltenco, Graham Wilson, Stephen Brewster, Ann-Kathrin Rogge, Brigitte Röder, Elena Cocchi, Elisabetta Capris, Paola Campana, Carla Gilio, and Monica Gori. 2015a. ABBI, a New Technology for Sensory-motor Rehabilitation of Visual Impaired People. In Proceedings of the International Conference on Enabling Access for Persons with Visual Impairment ICEAPVI '15. 80--84.",
      "doi": ""
    },
    {
      "text": "Sara Finocchietti, Giulia Cappagli, Lope Ben Porquis, Gabriel Baud-Bovy, Elena Cocchi, and Monica Gori. 2015b. Evaluation of the Audio Bracelet for Blind Interaction for improving mobility and spatial cognition in early blind children - A pilot study. In Proceedings of the 37th Annual International Conference of the IEEE Engineering in Medicine and Biology Society - EMBS '15. IEEE, 7998--8001. DOI: http://dx.doi.org/10.1109/EMBC.2015.7320248 ",
      "doi": ""
    },
    {
      "text": "Simon Holland, David R. Morse, and Henrik Gedenryd. 2002. AudioGPS: Spatial Audio Navigation with a Minimal Attention Interface. Personal and Ubiquitous Computing 6 (2002), 253--259. DOI: http://dx.doi.org/10.1007/s007790200025  ",
      "doi": "10.1007/s007790200025"
    },
    {
      "text": "J. E. Jan, M. Groenveld, and A. M. Sykanda. 1990. Light-gazing by Visually Impaired Children. Developmental Medicine and Child Neurology 32, 9 (1990), 755--759. DOI: http://dx.doi.org/10.1111/j.1469--8749.1990.tb08478.x",
      "doi": ""
    },
    {
      "text": "Anssi Kainulainen, Markku Turunen, Jaakko Hakulinen, and Aleksi Melto. 2007. Soundmarks in Spoken Route Guidance. In Proceedings of the 13th International Conference on Auditory Display - ICAD '07. 107--111. https://smartech.gatech.edu/handle/1853/50034",
      "doi": ""
    },
    {
      "text": "Charlotte Magnusson, Bitte Rydeman, Sara Finocchietti, Giulia Cappagli, Lope Ben Porquis, Gabriel Baud-Bovy, and Monica Gori. 2015. Co-located Games Created by Children with Visual Impairments. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services MobileHCI '15 Adjunct. ACM Press, 1157--1162. DOI: http://dx.doi.org/10.1145/2786567.2794350  ",
      "doi": "10.1145/2786567.2794350"
    },
    {
      "text": "David McGookin, Stephen Brewster, and Pablo Priego. 2009. Audio Bubbles: Employing Non-speech Audio to Support Tourist Wayfinding. In Proceedings of Haptic and Audio Interaction Design - HAID '09. Springer-Verlag, 41--50.  ",
      "doi": "10.1007/978-3-642-04076-4_5"
    },
    {
      "text": "Onyx Beacon. 2015. World premiere: large scale iBeacons network guides visually impaired people to use the public transportation service. (2015). http://www.onyxbeacon.com/ world-premiere-large-scale-ibeacons-network-guides-",
      "doi": ""
    },
    {
      "text": "visually-impaired-people-to-use-the-public-",
      "doi": ""
    },
    {
      "text": "transportation-service/",
      "doi": ""
    },
    {
      "text": "Sabrina A. Panëels, Adriana Olmos, Jeffrey R. Blum, and Jeremy R. Cooperstock. 2013. Listen to it yourself!: Evaluating Usability of \"What's Around Me?\" for the blind. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, 2107--2116. DOI: http://dx.doi.org/10.1145/2470654.2481290  ",
      "doi": "10.1145/2470654.2481290"
    },
    {
      "text": "Rona L. Pogrund and Diane L. Fazzi. 2002. Early Focus: Working with Young Children Who Are Blind or Visually Impaired and Their Families. AFB Press. 501 pages. http://www.afb.org/store/Pages/ShoppingCart/ ProductDetails.aspx?ProductId=978-0--89128--856--5",
      "doi": ""
    },
    {
      "text": "RNIB. 2014. Mobility and independence : School Age. (2014). https://www.rnib.org.uk/sites/default/files/ Mobility-and-Independence-at-school.doc",
      "doi": ""
    },
    {
      "text": "David A. Ross and Bruce B Blasch. 2000. Wearable interfaces for orientation and wayfinding. Proceedings of the fourth international ACM conference on Assistive technologies - ASSETS '00 (2000), 193--200. DOI: http://dx.doi.org/10.1145/354324.354380  ",
      "doi": "10.1145/354324.354380"
    },
    {
      "text": "Merja Saarela. 2015. Solving way-finding challenges of a visually impaired person in a shopping mall by strengthening landmarks recognisability with iBeacons. Technical Report. Häme University of Applied Sciences, Finland. http://www.hamk.fi/english/collaboration-and-research/ smart-services/matec/Documents/solving-way.pdf",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez and Miguel Elías. 2007. Guidelines for Designing Mobility and Orientation Software for Blind Children. In Lecture Notes in Computer Science 4662, Part I - INTERACT '07. Springer, 375--388. DOI: http://dx.doi.org/10.1007/978--3--540--74796--3_35",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the Shadow of Misperception: Assistive Technology Use and Social Interactions. In Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems CHI '11. ACM Press, 705--714. DOI: http://dx.doi.org/10.1145/1978942.1979044  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Jason Stewart, Sara Bauman, Michelle Escobar, Jakob Hilden, Kumud Bihani, and Mark W. Newman. 2008. Accessible Contextual Information for Urban Orientation. In Proceedings of the 10th international conference on Ubiquitous computing - UbiComp '08. ACM Press, 332--335. DOI: http://dx.doi.org/10.1145/1409635.1409679  ",
      "doi": "10.1145/1409635.1409679"
    },
    {
      "text": "Martin Tomitsch, Richard Schlögl, Thomas Grechenig, Christoph Wimmer, and Thomas Költringer. 2008. Accessible Real-World Tagging through Audio-Tactile Location Markers. In Proceedings of the 5th Nordic conference on Human-computer interaction - NordiCHI '08. 551--554. DOI: http://dx.doi.org/10.1145/1463160.1463242  ",
      "doi": "10.1145/1463160.1463242"
    },
    {
      "text": "Heinrich Tröster and Michael Brambring. 1994. The play behavior and play materials of blind and sighted infants and preschoolers. Journal of Visual Impairment & Blindness 88, 5 (1994), 421--432.",
      "doi": ""
    },
    {
      "text": "Heinrich Tröster, Michael Brambring, and Andreas Beelmann. 1991. Prevalence and Situational Causes of Stereotyped Behaviors in Blind Infants and Preschoolers. Journal of Abnormal Child Psychology 19, 5 (1991), 569--590. DOI:http://dx.doi.org/10.1007/BF00925821 ",
      "doi": ""
    },
    {
      "text": "Wallace Ugulino and Hugo Fuks. 2015. Landmark Identification with Wearables for Supporting Spatial Awareness by Blind Persons. In Proceedings of ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '15. ACM Press, 63--74. DOI:http://dx.doi.org/10.1145/2750858.2807541  ",
      "doi": "10.1145/2750858.2807541"
    },
    {
      "text": "Wayfindr. 2016. Wayfindr Open Standard. (2016). https://www.wayfindr.net/open-standard/",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A Brewster. 2015. Using Dynamic Audio Feedback to Support Peripersonal Reaching in Visually Impaired People. Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility - ASSETS '15 (2015), 433--434. DOI: http://dx.doi.org/10.1145/2700648.2811339  ",
      "doi": "10.1145/2700648.2811339"
    },
    {
      "text": "Michael Zöllner, Stephan Huber, Hans-Christian Jetter, and Harald Reiterer. 2011. NAVI A Proof-of-Concept of a Mobile Navigational Aid for Visually Impaired Based on the Microsoft Kinect. In Proceedings of INTERACT '11 in LNCS 6949. Springer, 584--587. DOI: http://dx.doi.org/10.1007/978--3--642--23768--3_88",
      "doi": ""
    }
  ]
}