{
  "doi": "10.1145/3025453.3025926",
  "title": "Self-Confidence Trumps Knowledge: A Cross-Cultural Study of Security Behavior",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2202-2214",
  "year": 2017,
  "badges": [],
  "abstract": "Computer security tools usually provide universal solutions without taking user characteristics (origin, income level, ...) into account. In this paper, we test the validity of using such universal security defenses, with a particular focus on culture. We apply the previously proposed Security Behavior Intentions Scale (SeBIS) to 3,500 participants from seven countries. We first translate the scale into seven languages while preserving its reliability and structure validity. We then build a regression model to study which factors affect participants' security behavior. We find that participants from different countries exhibit different behavior. For instance, participants from Asian countries, and especially Japan, tend to exhibit less secure behavior. Surprisingly to us, we also find that actual knowledge influences user behavior much less than user self-confidence in their computer security knowledge. Stated differently, what people think they know affects their security behavior more than what they do know.",
  "authors": [
    {
      "name": "Yukiko Sawaya",
      "institution": "KDDI Research, Inc., Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490695810",
      "orcid": "missing"
    },
    {
      "name": "Mahmood Sharif",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459033857",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Christin",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131105",
      "orcid": "missing"
    },
    {
      "name": "Ayumu Kubota",
      "institution": "KDDI Research, Inc., Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545157056",
      "orcid": "missing"
    },
    {
      "name": "Akihiro Nakarai",
      "institution": "KDDI Research, Inc., Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159948",
      "orcid": "missing"
    },
    {
      "name": "Akira Yamada",
      "institution": "KDDI Research, Inc., Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660059075",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Galit Ailon. 2008. Mirror, mirror on the wall: Culture's consequences in a value test of its own design. Academy of management review 33, 4 (2008), 885--904. ",
      "doi": ""
    },
    {
      "text": "Hashem Abdullah A Almakrami. 2015. Online self-disclosure across cultures: A study of Facebook use in Saudi Arabia and Australia. Ph.D. Dissertation. Queensland University of Technology.",
      "doi": ""
    },
    {
      "text": "Annie I Antón, Julia B Earp, and Jessica D Young. 2010. How internet users' privacy concerns have evolved since 2002. IEEE Security & Privacy 8, 1 (2010), 21--27.",
      "doi": "10.1109/MSP.2010.38"
    },
    {
      "text": "Steven Bellman, Eric J Johnson, Stephen J Kobrin, and Gerald L Lohse. 2004. International differences in information privacy concerns: A global survey of consumers. The Information Society 20, 5 (2004), 313--324. ",
      "doi": ""
    },
    {
      "text": "Sunil Chaudhary, Yan Zhao, Eleni Berki, Juri Valtanen, Linfeng Li, Marko Helenius, and Stylianos Mystakidis. 2015. A cross-cultural and gender-based perspective for online security: Exploring knowledge, skills and attitudes of higher education students. IADIS International Journal on WWW/Internet 13, 1 (2015).",
      "doi": ""
    },
    {
      "text": "China Internet Network Information Center. 2014. Statistical Survey on Internet Developmentin China2015.12. http://www.internetstatistik.se/ wordpress/wp-content/uploads/2014/07/CNNIC_report.pdf. (2014). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Hichang Cho, Milagros Rivera-Sánchez, and Sun Sun Lim. 2009. A multinational study on online privacy: global concerns and local responses. New media & society 11, 3 (2009), 395--416. ",
      "doi": ""
    },
    {
      "text": "Robert Colosi. 2005. Negatively worded questions cause respondent confusion. Proceedings of the Survey Research Methods Section, American Statistical Association (2005) (2005), 2896--2903.",
      "doi": ""
    },
    {
      "text": "ComScore, Inc. 2015. 2015 Japan Digital Audience Report. https://www.comscore.com/layout/set/popup/ Request/Presentations/2015/ 2015-Japan-Digital-Audience-Report?req=slides&pre= 2015+Japan+Digital+Audience+Report. (2015). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "CRÉDOC. 2014. La diffusion des technologies de l'information et de la communication dans la société française (2014). http://www.arcep.fr/uploads/tx_ gspublication/etude-CREDOC-diffusion-TIC-2014.pdf. (2014). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Cross Marketing Inc. 2015. Online Research. http: //global.cross-m.co.jp/solution/online/index.html. (2015). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Dan Cvrcek, Marek Kumpost, Vashek Matyas, and George Danezis. 2006. A study on the value of location privacy. In Proceedings of WPES. DOI: http://dx.doi.org/10.1145/1179601.1179621  ",
      "doi": "10.1145/1179601.1179621"
    },
    {
      "text": "Jacqueline K Eastman, Bill Fredenberger, David Campbell, and Stephen Calvert. 1997. The Relationship between Status Consumption and Materialism: A Cross-Cultural Comparison of Chinese, Mexican, and American Student. Journal of Marketing Theory and Practice 5, 1 (1997), 52--66.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Marian Harbach, and Eyal Peer. 2016. Behavior Ever Follows Intention?: A Validation of the Security Behavior Intentions Scale (SeBIS). In Proceedings of CHI. DOI: http://dx.doi.org/10.1145/2858036.2858265  ",
      "doi": "10.1145/2858036.2858265"
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015a. The myth of the average user: Improving privacy and security systems through individualization. In Proceedings of NSPW. DOI: http://dx.doi.org/10.1145/2841113.2841115  ",
      "doi": "10.1145/2841113.2841115"
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015b. Scaling the Security Wall: Developing a Security Behavior Intentions Scale (SeBIS). In Proceedings of ACM CHI. DOI: http://dx.doi.org/10.1145/2702123.2702249  ",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Alain Forget, Sarah Pearman, Jeremy Thomas, Alessandro Acquisti, Nicolas Christin, Lorrie Faith Cranor, Serge Egelman, Marian Harbach, and Rahul Telang. 2016. Do or Do Not, There Is No Try: User Engagement May Not Improve Security Outcomes. In Proceedings of SOUPS.",
      "doi": ""
    },
    {
      "text": "Tsutomu Fujinami and Christine Nanz. 2013. The 101 translation problems between Japanese and German/English. (2013).",
      "doi": ""
    },
    {
      "text": "Adrian Furnham. 1986. Response bias, social desirability and dissimulation. Personality and individual differences 7, 3 (1986), 385--400. ",
      "doi": ""
    },
    {
      "text": "Gengo, Inc. 2016. Gengo. https://www.gengo.com. (2016). [Online; accessed 09/20/2016].",
      "doi": ""
    },
    {
      "text": "Güliz Ger and Russell W Belk. 1996. Cross-cultural differences in materialism. Journal of economic psychology 17, 1 (1996), 55--77. ",
      "doi": ""
    },
    {
      "text": "Marian Harbach, Alexander De Luca, Nathan Malkin, and Serge Egelman. 2016. Keep on Lockin'in the Free World: A Multi-National Comparison of Smartphone Locking. In Proceedings of ACM CHI. DOI: http://dx.doi.org/10.1145/2858036.2858273  ",
      "doi": "10.1145/2858036.2858273"
    },
    {
      "text": "Geert Hofstede. 1984. Culture's consequences: International differences in work-related values. Vol. 5. Sage.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 2001. Culture's consequences: Comparing values, behaviors, institutions and organizations across nations. Sage.",
      "doi": ""
    },
    {
      "text": "Li-Tze Hu and Peter M. Bentler. 1999. Cutoff criteria for fit indexes in covariance structure analysis: Conventional criteria versus new alternatives. Structural equation modeling: a multidisciplinary journal 6, 1 (1999), 1--55.",
      "doi": ""
    },
    {
      "text": "Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. \"... no one can hack my mind\": Comparing Expert and Non-Expert Security Practices. In Proceedings of SOUPS.",
      "doi": ""
    },
    {
      "text": "Iulia Ion, Niharika Sachdeva, Ponnurangam Kumaraguru, and Srdjan Capkun. 2011. Home is safer than the cloud!: privacy concerns for consumer cloud storage. In Proceedings of SOUPS.  ",
      "doi": "10.1145/2078827.2078845"
    },
    {
      "text": "Ipsos. 2014. Ipsos Online Audience Measurement in The Arab World. http://fac.ksu.edu.sa/sites/default/files/ online-audience-measurement.pdf. (2014). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara B Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the US Public. In Proceedings of SOUPS.",
      "doi": ""
    },
    {
      "text": "Kristiina Karvonen, Lucas Cardholm, and Stefan Karlsson. 2000. Cultures of trust: A cross-cultural study on the formation of trust in an electronic environment. In Proceedings of the nordic workshop on secure IT systems.",
      "doi": ""
    },
    {
      "text": "Korean Internet & Security Agency. 2016. 2015 Survey on the Internet Usage Executive Summary. http://isis.kisa.or.kr/board/fileDown.jsp&pageId=060300&bbsId=10&itemId=345&athSeq=1. (2016). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Hanna Krasnova and Natasha F Veltri. 2010. Privacy calculus on social networking sites: Explorative evidence from Germany and USA. In Proceedings of HICSS.  ",
      "doi": "10.1109/HICSS.2010.307"
    },
    {
      "text": "Lydia Kraus, Ina Wechsung, and Sebastian Möller. 2014. A comparison of privacy and security knowledge and privacy concern as influencing factors for mobile protection behavior. In Proceedings of PPS.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Lorrie Faith Cranor, and Elaine Newton. 2005. Privacy perceptions in india and the USA: An interview study. In Proceedings of TPRC.",
      "doi": ""
    },
    {
      "text": "Jialiu Lin, Michael Benisch, Norman Sadeh, Jianwei Niu, Jason Hong, Banghui Lu, and Shaohui Guo. 2013. A comparative study of location-sharing privacy preferences in the USA and China. Personal and ubiquitous computing 17, 4 (2013), 697--711.  ",
      "doi": "10.1007/s00779-012-0610-6"
    },
    {
      "text": "Macromill, Inc. 2015. Macromill. http://www.macromill.com/global/index.html. (2015). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Brendan McSweeney. 2002. Hofstede's model of national cultural differences and their consequences: A triumph of faith-a failure of analysis. Human relations 55, 1 (2002), 89--118. ",
      "doi": ""
    },
    {
      "text": "Ferenc Moksony. 1999. Small is beautiful. The use and interpretation of R2 in social research. Review of Sociology (1999), 130--138.",
      "doi": ""
    },
    {
      "text": "Alan L Montgomery and Michael D Smith. 2009. Prospects for Personalization on the Internet. Journal of Interactive Marketing 23, 2 (2009), 130--137. ",
      "doi": ""
    },
    {
      "text": "Richard G. Netemeyer, William O. Bearden, and Subhash Sharma. 2003. Scaling procedures: Issues and applications. Sage Publications. ",
      "doi": ""
    },
    {
      "text": "Ofcom. 2015a. Gross national income per capita 2015, Atlas method and PPP. http://databank.worldbank.org/data/download/GNIPC.pdf. (2015). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Ofcom. 2015b. International Communications Market Report 2015. http://stakeholders.ofcom.org.uk/ binaries/research/cmr/cmr15/icmr15/icmr_2015.pdf. (2015). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Mehrbod Shari, Eugene Fink, and Jaime G Carbonell. 2010. Learning of personalized security settings. (2010).",
      "doi": ""
    },
    {
      "text": "Mikko Siponen, M Adam Mahmood, and Seppo Pahnila. 2009. Technical opinion Are employees putting your company at risk by not following information security policies? Commun. ACM 52, 12 (2009), 145--147. DOI: http://dx.doi.org/10.1145/1610252.1610289  ",
      "doi": "10.1145/1610252.1610289"
    },
    {
      "text": "Tom W Smith. 2003. Developing comparable questions in cross-national surveys. Cross-cultural survey methods (2003), 69--92.",
      "doi": ""
    },
    {
      "text": "Statistics Bureau. 2011. 2010 National Census in Japan (in Japanese). http://www.stat.go.jp/data/kokusei/2010/index.htm. (2011). [Online; accessed 5/10/2016].",
      "doi": ""
    },
    {
      "text": "Mohsen Tavakol and Reg Dennick. 2011. Making sense of Cronbach's alpha. International journal of medical education 2 (2011), 53. ",
      "doi": ""
    },
    {
      "text": "Narongsak Thongpapanl and Abdul Rehman Ashraf. 2011. Enhancing online performance through website content and personalization. Journal of computer information systems 52, 1 (2011), 3--13.",
      "doi": ""
    },
    {
      "text": "TNS Russia. 2015. Web Index. http://tns-global.ru/ services/media/media-audience/internet/information/. (2015). [Online; accessed 9/5/2016].",
      "doi": ""
    },
    {
      "text": "Blase Ur and Yang Wang. 2013. A cross-cultural framework for protecting user privacy in online social media. In Proceedings of WWW. DOI: http://dx.doi.org/10.1145/2487788.2488037  ",
      "doi": "10.1145/2487788.2488037"
    },
    {
      "text": "Eric Van Sonderen, Robbert Sanderman, and James C Coyne. 2013. Ineffectiveness of reverse wording of questionnaire items: Let's learn from cows in the rain. PloS one 8, 7 (2013), e68967.",
      "doi": ""
    },
    {
      "text": "Yang Wang, Gregory Norcie, and Lorrie Faith Cranor. 2011. Who is concerned about what? A study of American, Chinese and Indian users' privacy concerns on social network sites. In Proceedings of TRUST. ",
      "doi": ""
    },
    {
      "text": "Yang Wang, Huichuan Xia, and Yun Huang. 2016. Examining American and Chinese Internet Users' Contextual Privacy Preferences of Behavioral Advertising. In Proceedings of CSCW. DOI: http://dx.doi.org/10.1145/2818048.2819941  ",
      "doi": "10.1145/2818048.2819941"
    },
    {
      "text": "Rick Wash and Emilee Rader. 2015. Too much knowledge? security beliefs and protective behaviors among USA internet users. In Proceedings of SOUPS.",
      "doi": ""
    },
    {
      "text": "Nancy Wong, Aric Rindfleisch, and James E Burroughs. 2003. Do reverse-worded items confound measures in cross-cultural consumer research? The case of the material values scale. Journal of consumer research 30, 1 (2003), 72--91. ",
      "doi": ""
    },
    {
      "text": "World Bank. 2016. World Bank Atlas Method. (2016). http://go.worldbank.org/IEH2RL06U0 [Online; accessed 12/31/2016].",
      "doi": ""
    },
    {
      "text": "Chen Zhao, Pamela Hinds, and Ge Gao. 2012. How and to whom people share: the role of culture in self-disclosure in online communities. In Proceedings of CSCW. DOI:http://dx.doi.org/10.1145/2145204.2145219  ",
      "doi": "10.1145/2145204.2145219"
    }
  ]
}