{
  "doi": "10.1145/3025453.3025842",
  "title": "Electrick: Low-Cost Touch Sensing Using Electric Field Tomography",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2017,
  "badges": [],
  "abstract": "Current touch input technologies are best suited for small and flat applications, such as smartphones, tablets and kiosks. In general, they are too expensive to scale to large surfaces, such as walls and furniture, and cannot provide input on objects having irregular and complex geometries, such as tools and toys. We introduce Electrick, a low-cost and versatile sensing technique that enables touch input on a wide variety of objects and surfaces, whether small or large, flat or irregular. This is achieved by using electric field tomography in concert with an electrically conductive material, which can be easily and cheaply added to objects and surfaces. We show that our technique is compatible with commonplace manufacturing methods, such as spray/brush coating, vacuum forming, and casting/molding enabling a wide range of possible uses and outputs. Our technique can also bring touch interactivity to rapidly fabricated objects, including those that are laser cut or 3D printed. Through a series of studies and illustrative example uses, we show that Electrick can enable new interactive opportunities on a diverse set of objects and surfaces that were previously static.",
  "authors": [
    {
      "name": "Yang Zhang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81548025596/rel-imgonly/yang.jpg",
      "acmid": "81548025596",
      "orcid": "0000-0003-2472-6968"
    },
    {
      "name": "Gierad Laput",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "3M Material Safety Data Sheet. Retrieved January 5, 2017 from http://multimedia.3m.com/mws/mediawebserver?66666 UtN&ZUxL99XlX&ynxM_4Vu9KcuZgVU_LXT1u66 6666--",
      "doi": ""
    },
    {
      "text": "3M Multi-Touch Display C5567PW. Datasheet. Retrieved December 26, 2016 from http://multimedia.3m.com/mws/media/1082683O/3mmulti-touch-display-c5567pw.pdf",
      "doi": ""
    },
    {
      "text": "Amazon Product Details. Retrieved January 5, 2017 from https://amzn.com/B008OA931A",
      "doi": ""
    },
    {
      "text": "Analog Devices. 32-Channel Analog Multiplexer. ADG732. Retrieved January 5, 2017 from http://www.analog.com/media/en/technicaldocumentation/data-sheets/ADG726_732.pdf",
      "doi": ""
    },
    {
      "text": "Analog Devices. Programmable Frequency Sweep and Output Burst Waveform Generator. AD5930. Retrieved January 5, 2017 from http://www.analog.com/media/en/technicaldocumentation/data-sheets/AD5930.pdf",
      "doi": ""
    },
    {
      "text": "Analog Devices. JFET Input Instrumentation Amplifier with Rail-to-Rail Output in MSOP Package. Retrieved January 5, 2017 from http://www.analog.com/media/en/technicaldocumentation/data-sheets/AD8220.pdf",
      "doi": ""
    },
    {
      "text": "Andy Adler and Robert Guardo. 1996. Electrical impedance tomography: regularized imaging and contrast detection. IEEE transactions on medical imaging 15, 2. 170--179. http://doi.org/10.1109/42.491418",
      "doi": ""
    },
    {
      "text": "Eric Akaoka, Tim Ginn, and Roel Vertegaal. 2010. DisplayObjects: prototyping functional physical interfaces on 3d styrofoam, paper or cardboard models. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, NY, NY, USA, 49--56. http://doi.org/10.1145/1709886.1709897  ",
      "doi": "10.1145/1709886.1709897"
    },
    {
      "text": "Hassan Alirezaei, Akihiko Nagakubo, and Yashuo Kuniyoshi. 2009. A tactile distribution sensor which enables stable measurement under high and dynamic stretch. In Proceedings of the IEEE Symposium 3D User Interfaces. 87--93. http://doi.org/10.1109/3DUI.2009.4811210  ",
      "doi": "10.1109/3DUI.2009.4811210"
    },
    {
      "text": "Thomas Augsten, Konstantin Kaefer, René Meusel, Caroline Fetzer, Dorian Kanitz, Thomas Stoff, Torsten Becker, Christian Holz, and Patrick Baudisch. 2010. Multitoe: high-precision interaction with backprojected floors based on high-resolution multi-touch input. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, NY, NY, USA, 209--218. http://doi.org/10.1145/1866029.1866064  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "D'Antona, G., Ferrero, A., Lazzaroni, M., Ottoboni, R. and Samarani, E. 2002. Active monitoring apparatus for underground pollutant detection based on electrical impedance tomography. In Proceedings of the IEEE Instrumentation and Measurement Technology Conference. 577--579. http://doi.org/10.1109/IMTC.2002.1006906 ",
      "doi": ""
    },
    {
      "text": "Beginner's Mind Collective and David Shaw. 2012. Makey Makey: improvising tangible and nature-based user interfaces. In Proceedings of the 6th International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, NY, NY, USA, 367370. http://doi.org/10.1145/2148131.2148219  ",
      "doi": "10.1145/2148131.2148219"
    },
    {
      "text": "Gabe Cohn, Sidhant Gupta, Tien-Jui Lee, Dan Morris, Joshua R. Smith, Matthew S. Reynolds, Desney S. Tan, and Shwetak N. Patel. 2012. An ultra-low-power human body motion sensor using static electric field sensing. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 99--102. http://doi.org/10.1145/2370216.2370233  ",
      "doi": "10.1145/2370216.2370233"
    },
    {
      "text": "Gabe Cohn, Daniel Morris, Shwetak N. Patel, and Desney S. Tan. 2011. Your noise is my command: sensing gestures using the body as an antenna. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 791--800. http://doi.org/10.1145/1978942.1979058  ",
      "doi": "10.1145/1978942.1979058"
    },
    {
      "text": "Blair Evans. 1989. Method of and apparatus for sensing the location, such as coordinates, of designated points on an electrically sensitive touch-screen surface, Google Patents.",
      "doi": ""
    },
    {
      "text": "Freescale Microcontroller Datasheet. Retrieved January 5, 2017 from http://cache.freescale.com/files/32bit/doc/data_sheet/K 20P64M72SF1.pdf",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails and Dan Olsen Jr. 2002. Light widgets: interacting in every-day spaces. In Proceedings of the 7th international conference on Intelligent user interfaces (IUI '02). ACM, NY, NY, USA, 63--69. http://doi.org/10.1145/502716.502729  ",
      "doi": "10.1145/502716.502729"
    },
    {
      "text": "Mathieu Le Goc, Stuart Taylor, Shahram Izadi, and Cem Keskin. 2014. A low-cost transparent electric field sensor for 3d interaction on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3167--3170. http://doi.org/10.1145/2556288.2557331  ",
      "doi": "10.1145/2556288.2557331"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the 35th Annual ACM Conference on Human Factors in Computing Systems (CHI '17). ACM, NY, NY, USA. http://doi.org/10.1145/3025453.3025808",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2008. Scratch input: creating large, inexpensive, unpowered and mobile finger input surfaces. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, NY, NY, USA, 205--208. http://doi.org/10.1145/1449715.1449747  ",
      "doi": "10.1145/1449715.1449747"
    },
    {
      "text": "David Holman and Roel Vertegaal. 2011. TactileTape: low-cost touch sensing on curved surfaces. In Proceedings of the 24th annual ACM symposium adjunct on User interface software and technology (UIST '11 Adjunct). ACM, NY, NY, USA, 17--18. http://doi.org/10.1145/2046396.2046406  ",
      "doi": "10.1145/2046396.2046406"
    },
    {
      "text": "Eun-Soo Hwang, Jung-hoon Seo, and Yong-Jun Kim. 2007. A Polymer-Based Flexible Tactile Sensor for Both Normal and Shear Load Detections and Its Application for Robotics. Journal of Micromechanical Systems Vol. 16, No. 3, 556--563. http://doi.org/10.1109/JMEMS.2007.896716 ",
      "doi": ""
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA data mining software: an update. SIGKDD Explor. Newsl. 11, 1. 10--18. http://doi.org/10.1145/1656274.1656278",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Scott E. Hudson and Jennifer Mankoff. 2006. Rapid construction of functioning physical interfaces from cardboard, thumbtacks, tin foil and masking tape. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06). ACM, NY, NY, USA, 289--298. http://doi.org/10.1145/1166253.1166299  ",
      "doi": "10.1145/1166253.1166299"
    },
    {
      "text": "Hemant Jain, David Isaacson, Peter M Edic, and Jonathan C Newell. 1997. Electrical Impedance Tomography of Complex Conductivity Distributions with Noncircular Boundary. 44, 11: 1051--1060. http://doi.org/10.1109/10.641332",
      "doi": ""
    },
    {
      "text": "Philip T. Krein and R. David Meadows. 1990. The electroquasistatics of the capacitive touch panel. IEEE Transactions on Industry Applications Volume: 26, Issue: 3, 529 -- 534. http://doi.org/10.1109/28.55954 ",
      "doi": ""
    },
    {
      "text": "LG Inc. Media cover. Retrieved January 5, 2017 from http://www.theverge.com/2016/1/3/10706180/lgrollable-display-flexible-screen-announced-ces-2016",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2161--2170. http://doi.org/10.1145/2702123.2702414  ",
      "doi": "10.1145/2702123.2702414"
    },
    {
      "text": "MG Chemicals Inc: http://www.mgchemicals.com",
      "doi": ""
    },
    {
      "text": "Microsoft Surface Hub. User Guide. Retrieved January 5, 2017 from https://microsoft.com/microsoft-surfacehub/en-us",
      "doi": ""
    },
    {
      "text": "Mouser product page. Retrieved January 5, 2017 from http://www.mouser.com/ProductDetail/SCS/1704--36",
      "doi": ""
    },
    {
      "text": "MTE Solutions Product Details. Retrieved January 5, 2017 from http://shop.mtesolutionsinc.com/new-frommg-chemicals/mg-chemicals-838ar-3--78l-carbonconductive-coating/",
      "doi": ""
    },
    {
      "text": "Adiyan Mujibiya and Jun Rekimoto. 2013. Mirage: exploring interaction modalities using off-body static electric field sensing. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 211220. http://doi.org/10.1145/2501988.2502031  ",
      "doi": "10.1145/2501988.2502031"
    },
    {
      "text": "Maggie Orth, Rehmi Post, and Emily Cooper. 1998. Fabric computing interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM, NY, NY, USA, 331332. http://doi.org/10.1145/286498.286800  ",
      "doi": "10.1145/286498.286800"
    },
    {
      "text": "Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. 2013. Touch & activate: adding interactivity to existing objects using active acoustic sensing. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 31--40. http://doi.org/10.1145/2501988.2501989  ",
      "doi": "10.1145/2501988.2501989"
    },
    {
      "text": "PJRC Inc Product Detail. Retrieved January 5, 2017 from https://www.pjrc.com/teensy/teensy31.html",
      "doi": ""
    },
    {
      "text": "Pham, D.T., Ji, Z., Peyroutet, O., Yang, M., Wang, Z. and Al-Kutubi, M. 2006. Localization of impacts on solid objects using the wavelet transform and maximum likelihood estimation. In Proceedings of IPROMS '06. 541--547. http://doi.org/10.1016/B978-0080451572/50095-X",
      "doi": ""
    },
    {
      "text": "Ganna Pugach, Alexandre Pitti, and Philippe Gaussier. 2015. Neural learning of the topographic tactile sensory information of an artificial skin through a selforganizing map. Advanced Robotics, Volume 29 Issue 21: Robotic Sensor Skins. 1393--1409. http://doi.org/10.1371/journal.pone.0026561",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Chris Harrison, and Munehiko Sato. 2012. Touché: touch and gesture sensing for the real world. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, NY, NY, USA, 536--536. http://doi.org/10.1145/2370216.2370296  ",
      "doi": "10.1145/2370216.2370296"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4216--4227. http://doi.org/10.1145/2858036.2858176  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Joseph A. Paradiso, Che King Leo, Nisha Checka, and Kaijen Hsiao. 2002. Passive acoustic knock tracking for interactive windows. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 732--733. http://doi.org/10.1145/506443.506570  ",
      "doi": "10.1145/506443.506570"
    },
    {
      "text": "Joshua R. Smith. 1995. Toward Electric Field Tomography. M.S. Thesis. Massachusetts Institute of Technology, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Joshua R. Smith. 1999. Electric field imaging. Ph.D. Dissertation. Massachusetts Institute of Technology, Cambridge, MA.",
      "doi": "10.5555/929818"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 253258. http://doi.org/10.1145/2807442.2807503  ",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham Mysore, and Wilmot Li. 2015. Lamello: Passive Acoustic Sensing for Tangible Input Components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1277--1280. http://doi.org/10.1145/2702123.2702207  ",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, NY, NY, USA, 447--456. http://doi.org/10.1145/2501988.2501992  ",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 103--108. http://doi.org/10.1145/2807442.2807508  ",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 579--588. http://doi.org/10.1145/2380116.2380189  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Eckhard Teschner, Michael Imhoff, and Steffen Leonhardt. 2015. Electrical Impedance Tomography: The realization of regional ventilation monitoring, 2nd Edition. Dräger Medical GmbH, Germany.",
      "doi": ""
    },
    {
      "text": "Treetronic. 2015. PiCUS: Treetronic, Electric Resistance Tomography. Retrieved January 5, 2017 from http://www.arguselectronic.de/en/content/download/431/4060/.../ TreeTronic+3+manual.pdf",
      "doi": ""
    },
    {
      "text": "David Silvera Tawil, David Rye, and Mari Velonaki. 2011. Touch Modality Interpretation for an EIT-Based Sensitive Skin. In Proceedings of the IEEE Conference on Robotics and Automation (ICRA). 3770--3776. http://doi.org/10.1109/ICRA.2011.5979697 ",
      "doi": ""
    },
    {
      "text": "David Silvera Tawil, David Rye, Manuchehr Soleimani, and Mari Velonaki. 2015. Electrical Impedance Tomography for Artificial Sensitive Robotic Skin?: A Review. IEEE Sensors Journal, vol. 15, no. 4, 2001--2016 http://doi.org/10.1109/JSEN.2014.2375346 ",
      "doi": ""
    },
    {
      "text": "Marko Vauhkonen, W.R.B. Lionheart, Lasse M Heikkinen, P.J. Vauhkonen and Jari P Kaipio. A MATLAB package for the EIDORS project to reconstruct twodimensional EIT images. Physiological Measurement 22.1 107--111 http://doi.org/10.1088/09673334/22/1/314",
      "doi": ""
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2010. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, NY, NY, USA, 273--282. http://doi.org/10.1145/1866029.1866073  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Andrew D. Wilson. 2005. PlayAnywhere: a compact interactive tabletop projection-vision system. In Proceedings of the 18th annual ACM symposium on User interface software and technology (UIST '05). ACM, NY, NY, USA, 83--92. http://doi.org/10.1145/1095034.1095047  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, NY, NY, USA, 589--598. http://doi.org/10.1145/2380116.2380190  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Raphael Wimmer and Patrick Baudisch. 2011. Modular and deformable touch-sensitive surfaces based on time domain reflectometry. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, NY, NY, USA, 517--526. http://doi.org/10.1145/2047196.2047264  ",
      "doi": "10.1145/2047196.2047264"
    },
    {
      "text": "Robert Xiao, Chris Harrison, and Scott E. Hudson. 2013. WorldKit: rapid and easy creation of ad-hoc interactive applications on everyday surfaces. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 2889--2890. http://doi.org/10.1145/2468356.2479563  ",
      "doi": "10.1145/2468356.2479563"
    },
    {
      "text": "Robert Xiao, Greg Lew, James Marsanico, Divya Hariharan, Scott Hudson, and Chris Harrison. 2014. Toffee: enabling ad hoc, around-device interaction with acoustic time-of-arrival correlation. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services (MobileHCI '14). ACM, NY, NY, USA, 67--76. http://doi.org/10.1145/2628363.2628383  ",
      "doi": "10.1145/2628363.2628383"
    },
    {
      "text": "Zen ToolWorks Inc: http://www.zentoolworks.com",
      "doi": ""
    },
    {
      "text": "Thomas G. Zimmerman, Joshua R. Smith, Joseph A. Paradiso, David Allport, and Neil Gershenfeld. 1995. Applying electric field sensing to human-computer interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM, NY, NY, USA, 280--287. http://doi.org/10.1145/223904.223940  ",
      "doi": "10.1145/223904.223940"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2015. Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 167--173. http://doi.org/10.1145/2807442.2807480  ",
      "doi": "10.1145/2807442.2807480"
    },
    {
      "text": "Yang Zhang, Robert Xiao, and Chris Harrison. 2016. Advancing Hand Gesture Recognition with High Resolution Electrical Impedance Tomography. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 843--850. http://doi.org/10.1145/2984511.2984574",
      "doi": "10.1145/2984511.2984574"
    }
  ]
}