{
  "doi": "10.1145/3025453.3025626",
  "title": "Variolite: Supporting Exploratory Programming by Data Scientists",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1265-1276",
  "year": 2017,
  "badges": [],
  "abstract": "How do people ideate through code? Using semi-structured interviews and a survey, we studied data scientists who program, often with small scripts, to experiment with data. These studies show that data scientists frequently code new analysis ideas by building off of their code from a previous idea. They often rely on informal versioning interactions like copying code, keeping unused code, and commenting out code to repurpose older analysis code while attempting to keep those older analyses intact. Unlike conventional version control, these informal practices allow for fast versioning of any size code snippet, and quick comparisons by interchanging which versions are run. However, data scientists must maintain a strong mental map of their code in order to distinguish versions, leading to errors and confusion. We explore the needs for improving version control tools for exploratory tasks, and demonstrate a tool for lightweight local versioning, called Variolite, which programmers found usable and desirable in a preliminary usability study.",
  "authors": [
    {
      "name": "Mary Beth Kery",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659029834",
      "orcid": "0000-0002-1771-0565"
    },
    {
      "name": "Amber Horvath",
      "institution": "Oregon State Unviersity, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658972945",
      "orcid": "missing"
    },
    {
      "name": "Brad Myers",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    }
  ],
  "references": [
    {
      "text": "Atom Editor, https://atom.io/",
      "doi": ""
    },
    {
      "text": "Andrew J Ko, Htet Htet Aung, and Brad A Myers. 2005. Design requirements for more flexible structured editors from a study of programmers' text editing. In CHI'05 extended abstracts on human factors in computing systems. ACM, 1557--1560.",
      "doi": ""
    },
    {
      "text": "Andrew J Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, and others. 2011. The state of the art in end-user software engineering. ACM Computing Surveys (CSUR) 43, 3 (2011), 21.",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Aran Lunzer and Kasper Hornbæk. 2008. Subjunctive interfaces: Extending applications to support parallel setup, viewing and control of alternative scenarios. ACM Transactions on ComputerHuman Interaction (TOCHI) 14, 4 (2008), 17.",
      "doi": "10.1145/1314683.1314685"
    },
    {
      "text": "Beau Sheil. 1983. Environments for exploratory programming. Datamation 29, 7 (1983), 131--144.",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Loren Yu, Abel Allison, Yeonsoo Yang, and Scott R Klemmer. 2008. Design as exploration: creating interface alternatives through parallel authoring and runtime tuning. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 91--100.  ",
      "doi": "10.1145/1449715.1449732"
    },
    {
      "text": "Charles Hill, Rachel Bellamy, Thomas Erickson, and Margaret Burnett. 2016. Trials and Tribulations of Developers of Intelligent Systems: A Field Study. In 2016 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 162--170. ",
      "doi": ""
    },
    {
      "text": "Fernando Pérez and Brian E Granger. 2007. IPython: a system for interactive scientific computing. Computing in Science & Engineering 9, 3 (2007), 21--29.  ",
      "doi": "10.1109/MCSE.2007.53"
    },
    {
      "text": "Helen Shen and others. 2014. Interactive notebooks: Sharing the code. Nature 515, 7525 (2014), 151--152. ",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1997. Contextual design: defining customer-centered systems . Elsevier.",
      "doi": "10.5555/286067"
    },
    {
      "text": "John M Carroll and Mary Beth Rosson. 1987. Paradox of the active user. The MIT Press.",
      "doi": ""
    },
    {
      "text": "John W Tukey. 1977. Exploratory data analysis (1st, ed.). Pearson, New York, NY.",
      "doi": ""
    },
    {
      "text": "Judith Segal. 2007. Some problems of professional end user developers. In IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC 2007). IEEE, 111--118.  ",
      "doi": "10.1109/VLHCC.2007.17"
    },
    {
      "text": "Kayur Patel, James Fogarty, James A Landay, and Beverly Harrison. 2008. Investigating statistical machine learning as a tool for software development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 667--676.",
      "doi": "10.1145/1357054.1357160"
    },
    {
      "text": "Kayur Dushyant Patel. 2013. Lowering the Barrier to Applying Machine Learning. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Luke Nguyen-Hoan, Shayne Flint, and Ramesh Sankaranarayana. 2010. A survey of scientific software development. In Proceedings of the 2010 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement. ACM, 12.  ",
      "doi": "10.1145/1852786.1852802"
    },
    {
      "text": "Michael Terry, Elizabeth D Mynatt, Kumiyo Nakakoji, and Yasuhiro Yamamoto. 2004. Variation in element and action: supporting simultaneous development of alternative solutions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 711--718.",
      "doi": "10.1145/985692.985782"
    },
    {
      "text": "Michael Toomim, Andrew Begel, and Susan L Graham. 2004. Managing duplicated code with linked editing. In Visual Languages and Human Centric Computing, 2004 IEEE Symposium on. IEEE, 173--180.",
      "doi": "10.1109/VLHCC.2004.35"
    },
    {
      "text": "Mitchel Resnick, Brad Myers, Kumiyo Nakakoji, Ben Shneiderman, Randy Pausch, Ted Selker, and Mike Eisenberg. 2005. Design principles for tools to support creative thinking. (2005).",
      "doi": ""
    },
    {
      "text": "Paul Clements and Linda Northrop. 2001. Software product lines: Patterns and practice. Boston, MA, EUA: Addison Wesley Longman Publishing Co (2001).",
      "doi": ""
    },
    {
      "text": "Pete Warden, Why the term \"data science\" is flawed but useful: Counterpoints to four common data science criticisms., O'Reilly Radar Data Newsletter, 3/2011 http://radar.oreilly.com/2011/05/data-scienceterminology.html",
      "doi": ""
    },
    {
      "text": "Philip Jia Guo. 2012. Software tools to facilitate research programming. Ph.D. Dissertation. Stanford University.",
      "doi": ""
    },
    {
      "text": "Philip J Guo and Margo Seltzer. 2012. BURRITO: Wrapping Your Lab Notebook in Computational Infrastructure. In Proceedings of the 12th. USENIX Workshop on the Theory and Practice of Provenance (TaPP 2012) . USENIX, 7--7.",
      "doi": ""
    },
    {
      "text": "R Studio https://www.rstudio.com/",
      "doi": ""
    },
    {
      "text": "Robert DeLine and Danyel Fisher. 2015. Supporting exploratory data analysis with live programming. In Visual Languages and Human-Centric Computing (VL/HCC), 2015 IEEE Symposium on. IEEE, 111--119. ",
      "doi": ""
    },
    {
      "text": "Robert Hawley. 1987. Artificial intelligence programming environments. Intellect Books.",
      "doi": ""
    },
    {
      "text": "Sandeep Kaur Kuttal, Anita Sarma, Amanda Swearngin, and Gregg Rothermel. 2011. Versioning for Mashups--An Exploratory Study. In International Symposium on End User Development. Springer, 25--41. ",
      "doi": ""
    },
    {
      "text": "Sruti Srinivasa Ragavan, Sandeep Kaur Kuttal, Charles Hill, Anita Sarma, David Piorkowski, and Margaret Burnett. 2016. Foraging Among an Overabundance of Similar Variants. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3509--3521.  ",
      "doi": "10.1145/2858036.2858469"
    },
    {
      "text": "Thomas H Davenport and DJ Patil. 2012. Data scientist. Harvard business review 90 (2012), 70-- 76.",
      "doi": ""
    },
    {
      "text": "Knitr tool, http://yihui.name/knitr/",
      "doi": ""
    },
    {
      "text": "YoungSeok Yoon and Brad A Myers. 2012. An exploratory study of backtracking strategies used by developers. In Proceedings of the 5th International Workshop on Co-operative and Human Aspects of Software Engineering. IEEE Press, 138-- 144.",
      "doi": "10.5555/2663638.2663669"
    },
    {
      "text": "YoungSeok Yoon and Brad A Myers. 2014. A longitudinal study of programmers' backtracking. In 2014 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 101--108. ",
      "doi": ""
    },
    {
      "text": "YoungSeok Yoon and Brad A Myers. 2015. Supporting selective undo in a code editor. In Proceedings of the 37th International Conference on Software Engineering-Volume 1. IEEE Press, 223--233.",
      "doi": "10.5555/2818754.2818784"
    },
    {
      "text": "Zeeya Merali. 2010. Computational science: Error, why scientific programming does not compute. Nature 467, 7317 (2010), 775--777. ",
      "doi": ""
    },
    {
      "text": "Ziv Bar-Joseph, Georg K Gerber, Tong Ihn Lee, Nicola J Rinaldi, Jane Y Yoo, François Robert, D Benjamin Gordon, Ernest Fraenkel, Tommi S Jaakkola, Richard A Young, and others. 2003. Computational discovery of gene modules and regulatory networks. Nature Biotechnology 21, 11 (2003), 1337--1342. ",
      "doi": ""
    }
  ]
}