{
  "doi": "10.1145/3025453.3025896",
  "title": "What Do We Really Know about How Habituation to Warnings Occurs Over Time?: A Longitudinal fMRI Study of Habituation and Polymorphic Warnings",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2215-2227",
  "year": 2017,
  "badges": [],
  "abstract": "A major inhibitor of the effectiveness of security warnings is habituation: decreased response to a repeated warning. Although habituation develops over time, previous studies have examined habituation and possible solutions to its effects only within a single experimental session, providing an incomplete view of the problem. To address this gap, we conducted a longitudinal experiment that examines how habituation develops over the course of a five-day workweek and how polymorphic warnings decrease habituation. We measured habituation using two complementary methods simultaneously: functional magnetic resonance imaging (fMRI) and eye tracking. Our results show a dramatic drop in attention throughout the workweek despite partial recovery between workdays. We also found that the polymorphic warning design was substantially more resistant to habituation compared to conventional warnings, and it sustained this advantage throughout the five-day experiment. Our findings add credibility to prior studies by showing that the pattern of habituation holds across a workweek, and indicate that cross-sectional habituation studies are valid proxies for longitudinal studies. Our findings also show that eye tracking is a valid measure of the mental process of habituation to warnings.",
  "authors": [
    {
      "name": "Anthony Vance",
      "institution": "Brigham Young University, Provo, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414602941",
      "orcid": "missing"
    },
    {
      "name": "Brock Kirwan",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160379",
      "orcid": "missing"
    },
    {
      "name": "Daniel Bjornn",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659168999",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Jenkins",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447596037",
      "orcid": "missing"
    },
    {
      "name": "Bonnie Brinton Anderson",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100101853",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Devdatta Akhawe and Adrienne Porter Felt. 2013. Alice in Warningland: A Large-Scale Field Study of Browser Security Warning Effectiveness Proceedings of the 22nd USENIX Conference on Security, USENIX Association, Washington, D.C., 257--272.",
      "doi": ""
    },
    {
      "text": "T. S. Amer and Jo-Mae B. Maris. 2007. Signal words and signal icons in application control and information technology exception messages-Hazard matching and habituation effects. Journal of Information Systems, 21 (2). 1--25.",
      "doi": ""
    },
    {
      "text": "Bonnie Brinton Anderson, C. Brock Kirwan, Jeffrey L. Jenkins, David Eargle, Seth Howard and Anthony Vance. 2015. How Polymorphic Warnings Reduce Habituation in the Brain: Insights from an fMRI Study Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul, Republic of Korea, 2883--2892.",
      "doi": ""
    },
    {
      "text": "Robert J. Barry. 2009. Habituation of the Orienting Reflex and the Development of Preliminary Process Theory. Neurobiology of Learning and Memory, 92 (2). 235--242. http://dx.doi.org/10.1016/j.nlm.2008.07.007 ",
      "doi": ""
    },
    {
      "text": "Marc G Berman, John Jonides and Richard L Lewis. 2009. In Search of Decay in Verbal Short-Term Memory. Journal of Experimental Psychology: Learning, Memory, and Cognition, 35 (2). 317--333.",
      "doi": ""
    },
    {
      "text": "Curt C Braun and N Clayton Silver. 1995. Interaction of Signal Word and Colour on Warning Labels: Differences in Perceived Hazard and Behavioural Compliance. Ergonomics, 38 (11). 2207--2220.",
      "doi": ""
    },
    {
      "text": "Cristian Bravo-Lillo, Lorrie Cranor, Saranga Komanduri, Stuart Schechter and Manya Sleeper. 2014. Harder to Ignore? Revisiting Pop-Up Fatigue and Approaches to Prevent It. in, USENIX Association, 105--111.",
      "doi": ""
    },
    {
      "text": "Cristian Bravo-Lillo, Saranga Komanduri, Lorrie Faith Cranor, Robert W. Reeder, Manya Sleeper, Julie Downs and Stuart Schechter. 2013. Your Attention Please: Designing Security-decision UIs to Make Genuine Risks Harder to Ignore Proceedings of the Ninth Symposium on Usable Privacy and Security ACM, Newcastle, United Kingdom, 1--12.",
      "doi": ""
    },
    {
      "text": "José Carlos Brustoloni and Ricardo VillamarínSalomón. 2007. Improving Security Decisions with Polymorphic and Audited Dialogs, ACM, 76--85.",
      "doi": ""
    },
    {
      "text": "José Carlos Brustoloni and Ricardo VillamarínSalomón. 2007. Improving security decisions with polymorphic and audited dialogs. in Proceedings of the 3rd symposium on Usable privacy and security, ACM, 76--85.",
      "doi": "10.1145/1280680.1280691"
    },
    {
      "text": "Münire Özlem Çevik. 2014. Habituation, Sensitization, and Pavlovian Conditioning. Frontiers in Integrative Neuroscience, 8. 13. 10.3389/fnint.2014.00013 ",
      "doi": ""
    },
    {
      "text": "G. Chen, N. E. Adleman, Z.S Saad, E. Leibenluft and R.W. Cox. 2014. Applications of Multivariate Modeling to Neuroimaging Group Analysis: A Comprehensive Alternative to Univariate General Linear Model. NeuroImage, 99. 571--588. ",
      "doi": ""
    },
    {
      "text": "G. R. J. Christoffersen. 1997. Habituation: Events in the History of Its Characterization and Linkage to Synaptic Depression. A New Proposed Kinetic Criterion for Its Identification. Progress in Neurobiology, 53 (1). 45--66. 10.1016/S03010082(97)00031--2",
      "doi": ""
    },
    {
      "text": "John Colombo and D. Wayne Mitchell. 2009. Infant Visual Habituation. Neurobiology of Learning and Memory, 92 (2). 225--234. http://dx.doi.org/10.1016/j.nlm.2008.06.002 ",
      "doi": ""
    },
    {
      "text": "Sam F. Cooke, Robert W. Komorowski, Eitan S. Kaplan, Jeffrey P. Gavornik and Mark F. Bear. 2015. Visual recognition memory, manifested as long-term habituation, requires synaptic plasticity in V1. Nature Neuroscience, 18 (2). 262--271. 10.1038/nn.3920 ",
      "doi": ""
    },
    {
      "text": "R. W. Cox and A Jesmanowicz. 1999. Real-time 3D image registration for functional MRI. Magnetic Resonance in Medicine,, 42. 1014--1018. ",
      "doi": ""
    },
    {
      "text": "Robert W Cox. 1996. AFNI: Software for Analysis and Visualization of Functional Magnetic Resonance Neuroimages. Computers and Biomedical Research, 29 (3). 162--173.",
      "doi": "10.1006/cbmr.1996.0014"
    },
    {
      "text": "Lorrie Faith Cranor. 2008. A Framework for Reasoning about the Human in the Loop, USENIX Association 1:1--1:15.",
      "doi": ""
    },
    {
      "text": "A. Dimoka, R. D. Banker, I. Benbasat, F. D. Davis, A. R. Dennis, D. Gefen, A. Gupta, A. Lschebeck, P. H. Kenning, P. A. Pavlou, G. Muller-Putz, R. Riedl, J. vom Brocke and B. Weber. 2012. On the Use of Neurophysiological Tools in IS Research: Developing a Research Agenda for NeuroIS. MIS Quarterly, 36 (3). 679--702.",
      "doi": "10.5555/2481655.2481657"
    },
    {
      "text": "Angelika Dimoka. 2012. How to Conduct a Functional Magnetic Resonance (fMRI) Study in Social Science Research. MIS Quarterly, 36 (3). 811840.",
      "doi": ""
    },
    {
      "text": "Angelika Dimoka, Paul A Pavlou and Fred D Davis. 2011. Research Commentary-NeuroIS: The Potential of Cognitive Neuroscience for Information Systems Research. Information Systems Research, 22 (4). 687702.",
      "doi": "10.1287/isre.1100.0284"
    },
    {
      "text": "Angelika Dimoka, Paul A Pavlou and Fred D Davis. 2011. Research Commentary-NeuroIS: The Potential of Cognitive Neuroscience for Information Systems Research. Information Systems Research, 22 (4). 687702.",
      "doi": "10.1287/isre.1100.0284"
    },
    {
      "text": "Serge Egelman, Lorrie Faith Cranor and Jason Hong. 2008. You've Been Warned: An Empirical Study of the Effectiveness of Web Browser Phishing Warnings. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Florence, Italy, ACM, 1065--1074. 10.1145/1357054.1357219  ",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "Serge Egelman, Andreas Sotirakopoulos, Ildar Muslukhov, Konstantin Beznosov and Cormac Herley. 2013. Does My Password Go Up to Eleven?: The Impact of Password Meters on Password Selection. in, ACM, 2379--2388. 10.1145/2470654.2481329  ",
      "doi": "10.1145/2470654.2481329"
    },
    {
      "text": "Steven Furnell. 2010. Usability Versus Complexity-Striking the Balance in End-user Security. Network Security, 2010 (12). 13--17.  ",
      "doi": "10.1016/S1353-4858%2810%2970147-1"
    },
    {
      "text": "Kalanit Grill-Spector, Richard Henson and Alex Martin. 2006. Repetition and the Brain: Neural Models of Stimulus-specific Effects. Trends in Cognitive Sciences, 10 (1). 14--23. ",
      "doi": ""
    },
    {
      "text": "Matthew Grizzard, Ron Tamborini, John L. Sherry, René Weber, Sujay Prabhu, Lindsay Hahn and Patrick Idzik. 2015. The thrill is gone, but you might not know: Habituation and generalization of biophysiological and self-reported arousal responses to video games. Communication Monographs, 82 (1). 6487. 10.1080/03637751.2014.971418 ",
      "doi": ""
    },
    {
      "text": "Phillip M. Groves and Richard F. Thompson. 1970. Habituation: A Dual-Process Theory. Psychological Review, 77. 419--450. ",
      "doi": ""
    },
    {
      "text": "Marian Harbach, Markus Hettig, Susanne Weber and Matthew Smith. 2014. Using personal examples to improve risk communication for security & privacy decisions Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, Toronto, Ontario, Canada, 2647--2656.",
      "doi": ""
    },
    {
      "text": "Jennifer J. Heisz and David I. Shore. 2008. More efficient scanning for familiar faces. Journal of Vision, 8 (1). ",
      "doi": ""
    },
    {
      "text": "Michael J Kalsher, Michael S Wogalter and Bernadette M Racicot. 1996. Pharmaceutical Container Labels: Enhancing Preference Perceptions with Alternative Designs and Pictorials. International Journal of Industrial Ergonomics, 18 (1). 83--90.",
      "doi": ""
    },
    {
      "text": "MJ Kalsher and KJ Williams. 2006. Behavioral Compliance: Theory, Methodology, and Result. in Wogalter, M. ed. Handbook of Warnings, Lawrence Erlbaum Associates, Mahwah NJ, 313--331.",
      "doi": ""
    },
    {
      "text": "Chun-Ming Leung. 2009. Depress Phishing by CAPTCHA with OTP. in 3rd International Conference on Anti-Counterfeiting, Security, and Identification in Communication (ASID), Hong Kong, IEEE, 187--192. ",
      "doi": ""
    },
    {
      "text": "Ajaya Neupane, Nitesh Saxena, Keya Kuruvilla, Michael Georgescu and Rajesh Kana. 2014. Neural Signatures of User-Centered Security: An fMRI Study of Phishing, and Malware Warnings The Network and Distributed System Security Symposium (NDSS), San Diego, CA, 1--16.",
      "doi": ""
    },
    {
      "text": "Catharine H. Rankin. 2009. Introduction to Special Issue of Neurobiology of Learning and Memory on Habituation. Neurobiology of Learning and Memory, 92 (2). 125--126. http://dx.doi.org/10.1016/j.nlm.2008.09.010 ",
      "doi": ""
    },
    {
      "text": "Catharine H. Rankin, Thomas Abrams, Robert J. Barry, Seema Bhatnagar, David F. Clayton, John Colombo, Gianluca Coppola, Mark A. Geyer, David L. Glanzman, Stephen Marsland, Frances K. McSweeney, Donald A. Wilson, Chun-Fang Wu and Richard F. Thompson. 2009. Habituation revisited: An updated and revised description of the behavioral characteristics of habituation. Neurobiology of Learning and Memory, 92 (2). 135--138. http://dx.doi.org/10.1016/j.nlm.2008.09.012 ",
      "doi": ""
    },
    {
      "text": "René Riedl, Fred D. Davis and Alan R. Hevner. 2014. Towards a NeuroIS Research Methodology: Intensifying the Discussion on Methods, Tools, and Measurement. Journal of the Association for Information Systems, 15 (10). i-xxxv.",
      "doi": ""
    },
    {
      "text": "René Riedl, Adriane B Randolph, Jan vom Brocke, Pierre-Majorique Léger and Angelika Dimoka. 2010. The Potential of Neuroscience for Human-Computer Interaction Research. in Proceedings of the 9th Annual Workshop on HCI Research in MIS, 1--5.",
      "doi": ""
    },
    {
      "text": "R. Rosenholtz, Y. Li and L. Nakano. 2007. Measuring visual clutter. Journal of Vision, 7 (2). 1--22. Doi:10.1167/7.2.17. ",
      "doi": ""
    },
    {
      "text": "Christina M Rudin-Brown, Mike P Greenley, Andrea Barone, Joe Armstrong, Alice F Salway and Beverley J Norris. 2004. The Design of Child Restraint System (CRS) Labels and Warnings Affects Overall CRS Usability. Traffic Injury Prevention, 5 (1). 8--17.",
      "doi": ""
    },
    {
      "text": "Jennifer D. Ryan, Robert R. Althoff, Stephen Whitlow and Neal J. Cohen. 2000. Amnesia is a deficit in relational memory. Psychological Science, 11 (6). 454461. ",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L Durity and Lorrie Faith Cranor. 2015. A Design Space for Effective Privacy Notices. To appear in the.",
      "doi": ""
    },
    {
      "text": "S. E. Schechter, R. Dhamija, A. Ozment and I. Fischer. 2007. The Emperor's New Security Indicators IEEE Symposium on Security and Privacy, 2007. SP '07, 5165.",
      "doi": ""
    },
    {
      "text": "Stuart E Schechter, Rachna Dhamija, Andy Ozment and Ian Fischer. 2007. The Emperor's New Security Indicators. in Security and Privacy, 2007. SP'07. IEEE Symposium on, Berkeley, CA, IEEE, 51--65.",
      "doi": "10.1109/SP.2007.35"
    },
    {
      "text": "Susanne Schmid, Donald A. Wilson and Catharine H. Rankin. 2014. Habituation Mechanisms and Their Importance for Cognitive Function. Frontiers in Integrative Neuroscience, 8. 97. 10.3389/fnint.2014.00097 ",
      "doi": ""
    },
    {
      "text": "Russell J Sojourner and Michael S Wogalter. 1997. The Influence of Pictorials on Evaluations of Prescription Medication Instructions. Drug Information Journal, 31 (3). 963--972.",
      "doi": ""
    },
    {
      "text": "Evgeny Sokolov. 1963. Higher Nervous Functions: The Orienting Reflux. Annual Review of Physiology, 25. 545--580. ",
      "doi": ""
    },
    {
      "text": "Andreas Sotirakopoulos, Kirstie Hawkey and Konstantin Beznosov. 2011. On the challenges in usable security lab studies: lessons learned from replicating a study on SSL warnings Proceedings of the Seventh Symposium on Usable Privacy and Security, ACM, Pittsburgh, Pennsylvania, 1--18.",
      "doi": ""
    },
    {
      "text": "Nathalie Stembert, Arne Padmos, Mortaza S Bargh, Sunil Choenni and Frans Jansen. 2015. A Study of Preventing Email (Spear) Phishing by Enabling Human Intelligence. in Intelligence and Security Informatics Conference (EISIC), 2015 European, IEEE, 113--120.",
      "doi": "10.1109/EISIC.2015.38"
    },
    {
      "text": "Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri and Lorrie Faith Cranor. 2009. Crying Wolf: An Empirical Study of SSL Warning Effectiveness, USENIX Association, 399--416.",
      "doi": ""
    },
    {
      "text": "Richard F. Thompson. 2009. Habituation: A History. Neurobiology of Learning and Memory, 92 (2). 127134. http://dx.doi.org/10.1016/j.nlm.2008.07.011 ",
      "doi": ""
    },
    {
      "text": "Anthony Vance, Bonnie Brinton Anderson, C. Brock Kirwan and David Eargle. 2014. Using Measures of Risk Perception to Predict Information Security Behavior: Insights from Electroencephalography (EEG). Journal of the Association for Information Systems, 15 (10). 679--722.",
      "doi": ""
    },
    {
      "text": "Vinod Venkatraman, Angelika Dimoka, Paul A. Pavlou, Khoi Vo, William Hampton, Bryan Bollinger, Hal E. Hershfield, Masakazu Ishihara and Russell S. Winer. 2015. Predicting Advertising Success Beyond Traditional Measures: New Insights from Neurophysiological Methods and Market Response Modeling. Journal of Marketing Research, 52 (4). 436452. doi:10.1509/jmr.13.0593 ",
      "doi": ""
    },
    {
      "text": "Michael S Wogalter. 2006. Communication-Human Information Processing (C-HIP) Model. in Wogalter, M.S. ed. Handbook of Warnings, Lawrence Erlbaum Associates, Mahwah, NJ, 51--61.",
      "doi": ""
    },
    {
      "text": "J. H. Xiong, J. H. Gao, J. L. Lancaster and Peter T Fox. 1995. Clustered pixels analysis for functional MRI activation studies of the human brain. Human Brain Mapping, 3 (4). 287--301.",
      "doi": ""
    }
  ]
}