{
  "doi": "10.1145/3025453.3025544",
  "title": "Mastery Learning of Second Language through Asynchronous Modeling of Native Speakers in a Collaborative Mobile Game",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4887-4898",
  "year": 2017,
  "badges": [],
  "abstract": "Acquiring Chinese tones is often considered as the most difficult task in learning Chinese as a Second Language (CSL). Recently, ToneWars, a collaborative mobile learning game, demonstrated the feasibility and efficacy of connecting CSL learners with native speakers for tone learning. However, the synchronous gameplay nature in ToneWars can be hard to scale due to the time constraint and limited availability of native speakers. We present principled research to make ToneWars scalable and sustainable. First, we address the scalability issue via asynchronous modeling of native speakers. Second, we quantify whether a CSL learner achieves native level mastery for a specific phrase, and explore the use of fine-grained feedback on language mastery as a sustainable motivator for language learning. The insights in this research are generalizable to designing second language learning technologies beyond Chinese. In a longitudinal study with 18 CSL learners, we found that asynchronous gameplay significantly improved learning with an average gain of 29.7 tones and 16.4 syllables, and helped participants achieve native level mastery on 58.2 out of 69 phrases.",
  "authors": [
    {
      "name": "Xiangmin Fan",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99659261665/rel-imgonly/20191207163100.jpg",
      "acmid": "99659261665",
      "orcid": "missing"
    },
    {
      "name": "Wencan Luo",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460648823",
      "orcid": "missing"
    },
    {
      "name": "Jingtao Wang",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81490672860/rel-imgonly/jingtaow_full.jpg",
      "acmid": "81490672860",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Khalil Al-Mekhlafi, Xiangpei Hu, and Ziguang Zheng. An approach to context-aware mobile Chinese language learning for foreign students. Mobile Business, 2009. ICMB 2009. Eighth International Conference on. IEEE, 2009.  ",
      "doi": "10.1109/ICMB.2009.65"
    },
    {
      "text": "Jennifer S. Beaudin, Stephen S. Intille, Emmanuel Munguia Tapia, Randy Rockinson, and Margaret E. Morris. Context-sensitive microlearning of foreign language vocabulary on a mobile device. Ambient Intelligence. Springer Berlin Heidelberg, 2007. 55--72. ",
      "doi": "10.5555/1775401.1775407"
    },
    {
      "text": "Kees Bot. The psycholinguistics of the Output Hypothesis. Language Learning, 46, 529--555, 1996.",
      "doi": ""
    },
    {
      "text": "Carrie J. Cai, Philip J. Guo, James R. Glass, and Robert C. Miller. Wait-Learning: Leveraging wait time for second language education. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, pp. 3701--3710. ACM, 2015.  ",
      "doi": "10.1145/2702123.2702267"
    },
    {
      "text": "Nadire Cavus, and Dogan Ibrahim. m'Learning: An experiment in using SMS to support learning new English language words. British journal of educational technology, 40.1 (2009): 78--91.",
      "doi": ""
    },
    {
      "text": "David Dearman, and Khai Truong. Evaluating the implicit acquisition of second language vocabulary using a live wallpaper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2012.  ",
      "doi": "10.1145/2207676.2208598"
    },
    {
      "text": "Zoltán Dörnyei, and Kata Csizér. Ten commandments for motivating language learners: Results of an empirical study. Language teaching research 2.3 (1998): 203--229.",
      "doi": ""
    },
    {
      "text": "Nathan Dummitt. Chinese Through Tone & Color. Hippocrene Books, 2008.",
      "doi": ""
    },
    {
      "text": "Darren Edge, Kai-Yin Cheng, Michael Whitney, Yao Qian, Zhijie Yan, and Frank Soong. Tip tap tones: mobile microtraining of mandarin sounds. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, pp. 427--430. ACM, 2012.  ",
      "doi": "10.1145/2371574.2371640"
    },
    {
      "text": "Darren Edge, Elly Searle, Kevin Chiu, Jing Zhao, and James A. Landay. MicroMandarin: mobile language learning in context. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 3169--3178. ACM, 2011.  ",
      "doi": "10.1145/1978942.1979413"
    },
    {
      "text": "Darren Edge, Stephen Fitchett, Michael Whitney, and James Landay. MemReflex: adaptive flashcards for mobile microlearning. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, pp. 431--440. ACM, 2012.  ",
      "doi": "10.1145/2371574.2371641"
    },
    {
      "text": "Kyle Feldscher (Sep 25th , 2015). \"Obama wants 1 million Americans learning Chinese by 2020\". http://www.washingtonexaminer.com/article/2572865",
      "doi": ""
    },
    {
      "text": "I-Ping P. Fu. Student approaches to learning Chinese vocabulary, doctoral dissertation, Virginia Polytechnic Institute and State University (2005).",
      "doi": ""
    },
    {
      "text": "Robert Godwin-Jones. Emerging technologies from memory palaces to spacing algorithms: approaches to second-language vocabulary learning. Language, Learning & Technology 14.2 (2010): 4--11.",
      "doi": ""
    },
    {
      "text": "Andrew Head, Yi Xu, and Jingtao Wang. Tonewars: Connecting language learners and native speakers through collaborative mobile games. Intelligent Tutoring Systems. Springer International Publishing, 2014.",
      "doi": ""
    },
    {
      "text": "Matthew Kam, Divya Ramachandran, Varun Devanathan, Anuj Tewari, and John Canny. Localized iterative design for language learning in underdeveloped regions: the PACE framework. In Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 1097--1106. ACM, 2007.  ",
      "doi": "10.1145/1240624.1240791"
    },
    {
      "text": "Ayako Kawase. Second language acquisition and synchronous computer mediated communication. Tesol & Applied Linguistics 6.2 (2006): 1--27.",
      "doi": ""
    },
    {
      "text": "Constantine Kiriloff. On the auditory perception of tones in Mandarin. Phonetica 20.2-4 (1969): 63--67.",
      "doi": ""
    },
    {
      "text": "Stephen D. Krashen. The input hypothesis: Issues and implications. Addison-Wesley Longman Ltd, 1985.",
      "doi": ""
    },
    {
      "text": "Anuj Kumar, Pooja Reddy, Anuj Tewari, Rajat Agrawal, and Matthew Kam. Improving literacy in developing countries using speech recognition-supported games on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 1149--1158. ACM, 2012.  ",
      "doi": "10.1145/2207676.2208564"
    },
    {
      "text": "Jonathan Leather. F0 Pattern Inference in the Perceptual Acquisition of Second Language Tone in Sound Patterns in Second Language Acquisition. Studies on Language Acquisition (SOLA) 5 (1987): 59--80.",
      "doi": ""
    },
    {
      "text": "Jonathan Leather. Perceptual and productive learning of Chinese lexical tone by Dutch and English speakers. New sounds 90 (1990): 72--97.",
      "doi": ""
    },
    {
      "text": "Lina Lee. Learners' perspectives on networked collaborative interaction with native speakers of Spanish in the US. Language Learning & Technology 8, no. 1 (2004): 83--100.",
      "doi": ""
    },
    {
      "text": "Lili Liu (Jun 27th 2011). Chinese language proficiency test becoming popular in Mexico. http://news.xinhuanet.com/english2010/china/201106/27/c_13951048.htm",
      "doi": ""
    },
    {
      "text": "Michael H. Long. Native speaker/non-native speaker conversation in the second language classroom. University of Hawai'i Working Papers in English as a Second Language 2 (1) (1983).",
      "doi": ""
    },
    {
      "text": "Laura M. Morett, and Li-Yun Chang (2015). Emphasizing sound and meaning: pitch gestures enhance Mandarin lexical tone acquisition, Language, Cognition, and Neuroscience, 30:3, 347--353.",
      "doi": ""
    },
    {
      "text": "Julie Rico, and Stephen Brewster. Usable gestures for mobile interfaces: evaluating social acceptability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 887--896. ACM, 2010.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Xiaonan S. Shen (1989). Toward a register approach in teaching Mandarin tones. Journal of the Chinese Language Teachers Association, 24(3), 27--47.",
      "doi": ""
    },
    {
      "text": "Steven L. Thorne, Rebecca W. Black, and Julie M. Sykes. Second Language Use, Socialization, and Learning in Internet Interest Communities and Online Gaming, The Modern Language Journal, Volume 93, Issue Supplement s1, pages 802--821 (2009).",
      "doi": ""
    },
    {
      "text": "Feng Tian, Fei Lv, Jingtao Wang, Hongan Wang, Wencan Luo, Matthew Kam, Vidya Setlur, Guozhong Dai, and John Canny. Let's play chinese characters: mobile learning approaches via culturally inspired group games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 1603--1612. ACM, 2010.  ",
      "doi": "10.1145/1753326.1753565"
    },
    {
      "text": "Yue Wang, Allard Jongman, and Joan A. Sereno (2003). Acoustic and perceptual evaluation of Mandarin tone productions before and after perceptual training. The Journal of the Acoustical Society of America, 113(2), 1033--1043.",
      "doi": ""
    },
    {
      "text": "Yue Wang, Michelle M. Spence, Allard Jongman, and Joan A. Sereno (1999). Training American listeners to perceive Mandarin tones. The Journal of the Acoustical Society of America, 106(6), 3649--3658.",
      "doi": ""
    },
    {
      "text": "Carolyn M. White. Tonal perception errors and interference from English intonation. Journal of the Chinese Language Teachers Association 16.2 (1981): 27--56.",
      "doi": ""
    },
    {
      "text": "Janet Zhiqun Xing. Teaching and Learning Chinese as a Foreign Language. Electronic Journal of Foreign Language Teaching 5, no. 1 (2008): 174--176.",
      "doi": ""
    }
  ]
}