{
  "doi": "10.1145/3025453.3025549",
  "title": "Making Space for the Quality Care: Opportunities for Technology in Cognitive Behavioral Therapy for Insomnia",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5773-5786",
  "year": 2017,
  "badges": [],
  "abstract": "Insomnia can drastically affect individuals' overall well-being and work performance, with substantial costs to society and industry. Cognitive behavioral therapy for insomnia (CBT-I) is a psychotherapeutic treatment, which requires patients to track sleep and share the data with CBT-I clinicians. However, the number of specialists who can provide CBT-I limits the number of patients who can receive it. In this paper, we aim to identify opportunities to leverage technology to assist clinicians in delivering quality and effective CBT-I services to broader populations. Toward this goal, we conducted formative studies, including 11 CBT-I clinic observations and 17 semi-structured interviews, to understand the current workflow of CBT-I and associated challenges. We discuss how technology can assist clinicians and patients throughout the various steps of CBT-I workflow while addressing some of the identified challenges, and more broadly, how technology can make space for clinicians and patients to build quality therapeutic relationships.",
  "authors": [
    {
      "name": "Haining Zhu",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-99659161075/rel-imgonly/hainingzhu.jpg",
      "acmid": "99659161075",
      "orcid": "missing"
    },
    {
      "name": "Yuhan Luo",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159937",
      "orcid": "missing"
    },
    {
      "name": "Eun Kyoung Choe",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608724",
      "orcid": "0000-0001-5038-8320"
    }
  ],
  "references": [
    {
      "text": "1978. American Board of Sleep Medicine. http://www.absm.org/bsmspecialists.aspx. (1978). Accessed: 2016-09--18.",
      "doi": ""
    },
    {
      "text": "2005. CBT for Insomnia. http://www.cbtforinsomnia.com. (2005). Accessed: 2016-09--18.",
      "doi": ""
    },
    {
      "text": "2007. Fitbit. https://www.fitbit.com/. (2007). Accessed: 2016-09--18.",
      "doi": ""
    },
    {
      "text": "2013. CBT-i Coach. https://cbticoach.org. (2013). Accessed: 2016-09--18.",
      "doi": ""
    },
    {
      "text": "2014. Withings Aura Sleep Sensor. https://www.withings.com/fr/en/products/aura/ sleep-sensor-accessory. (2014). Accessed: 2016-09--18.",
      "doi": ""
    },
    {
      "text": "Gazihan Alankus, Amanda Lazar, Matt May, and Caitlin Kelleher. 2010. Towards customizable games for stroke rehabilitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2113--2122.  ",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "S Ancoli-Israel, R Cole, C Alessi, M Chambers, W Moorcroft, and C Pollak. 2003. The role of actigraphy in the study of sleep and circadian rhythms. American Academy of Sleep Medicine Review Paper. Sleep 26, 3 (2003), 342--392.",
      "doi": ""
    },
    {
      "text": "Joan S Ash, Marc Berg, and Enrico Coiera. 2004. Some unintended consequences of information technology in health care: the nature of patient care information system-related errors. Journal of the American Medical Informatics Association 11, 2 (2004), 104--112.",
      "doi": ""
    },
    {
      "text": "Robbert Jan Beun. 2013. Persuasive strategies in mobile insomnia therapy: alignment, adaptation, and motivational support. Personal and Ubiquitous Computing 17, 6 (2013), 1187--1195.  ",
      "doi": "10.1007/s00779-012-0586-2"
    },
    {
      "text": "Ann Blandford, Erik Berndt, Ken Catchpole, Dominic Furniss, Astrid Mayer, Helena Mentis, Aisling OKane, Tom Owen, Atish Rajkomar, and Rebecca Randell. 2012. Experiencing Interactive Healthcare Technologies: embracing the wild-on its own terms. Invited submission to ToCHIs special issue on The Turn to the Wild (2012).",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Erik Berndt, Ken Catchpole, Dominic Furniss, Astrid Mayer, Helena Mentis, Aisling Ann OKane, Tom Owen, Atish Rajkomar, and Rebecca Randell. 2015. Strategies for conducting situated studies of technology use in hospitals. Cognition, Technology & Work 17, 4 (2015), 489--502.  ",
      "doi": "10.1007/s10111-014-0318-7"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Cameron A Brick, Darbi L Seely, and Tonya M Palermo. 2010. Association between sleep hygiene and sleep quality in medical students. Behavioral sleep medicine 8, 2 (2010), 113--121.",
      "doi": ""
    },
    {
      "text": "Jane Carthey. 2003. The role of structured observational research in health care. Quality and safety in health care 12, suppl 2 (2003), ii13--ii16.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Karen Cheng, Charlotte Tang, Katie A Siek, and Jakob E Bardram. 2013. Is my doctor listening to me?: impact of health it systems on patient-provider interaction. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 2419--2426.  ",
      "doi": "10.1145/2468356.2468791"
    },
    {
      "text": "Yunan Chen, Victor Ngo, Sidney Harrison, and Victoria Duong. 2011. Unpacking exam-room computing: negotiating computer-use in patient-physician interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3343--3352.  ",
      "doi": "10.1145/1978942.1979438"
    },
    {
      "text": "Eun Kyoung Choe, Saeed Abdullah, Mashfiqui Rabbi, Edison Thomaz, Daniel A Epstein, Matthew Kay, Felicia Cordeiro, Gregory D Abowd, Tanzeem Choudhury, James Fogarty, Bongshin Lee, Mark Matthews, and Julie A Kientz. 2017. Semi-automated tracking: a balanced approach for self-monitoring applications. Pervasive Computing (2017).  ",
      "doi": "10.1109/MPRV.2017.18"
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Nathaniel F Watson, and Julie A Kientz. 2011. Opportunities for computing technologies to support healthy sleep behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3053--3062.  ",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A Kientz. 2015. SleepTight: low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 121--132.  ",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, and Sean A Munson. 2015. More than telemonitoring: Health provider use and nonuse of life-log data in irritable bowel syndrome and weight management. Journal of medical Internet research 17, 8 (2015), e203.",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Kristin Dew, Allison Cole, Jasmine Zia, James Fogarty, Julie A Kientz, and Sean A Munson. 2016. Boundary Negotiating Artifacts in Personal Informatics: Patient-Provider Collaboration with Patient-Generated Data. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 770--786.  ",
      "doi": "10.1145/2818048.2819926"
    },
    {
      "text": "Enrico Coiera and Vanessa Tombs. 1998. Communication behaviours in a hospital setting: an observational study. Bmj 316, 7132 (1998), 673--676.",
      "doi": ""
    },
    {
      "text": "Harvey R Colten, Bruce M Altevogt, and others. 2006. Sleep disorders and sleep deprivation: an unmet public health problem. National Academies Press.",
      "doi": ""
    },
    {
      "text": "David Coyle, Gavin Doherty, Mark Matthews, and John Sharry. 2007. Computers in talk-based mental health interventions. Interacting with computers 19, 4 (2007), 545--562.  ",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "David Coyle, Nicola McGlade, Gavin Doherty, and Gary O'Reilly. 2011. Exploratory evaluations of a computer game supporting cognitive behavioural therapy for adolescents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2937--2946.  ",
      "doi": "10.1145/1978942.1979378"
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1421--1430.  ",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Richard Frankel, Andrea Altschuler, Sheba George, James Kinsman, Holly Jimison, Nan R Robertson, and John Hsu. 2005. Effects of exam-room computing on clinician--patient communication. Journal of General Internal Medicine 20, 8 (2005), 677--682.",
      "doi": ""
    },
    {
      "text": "Dominic Furniss, Rebecca Randell, Aisling Ann OKane, Svetlena Taneva, Helena Mentis, and Ann Blandford. 2014. Fieldwork for healthcare: guidance for investigating human factors in computing systems. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 3, 2 (2014), 1--146. ",
      "doi": "10.5555/2616402"
    },
    {
      "text": "Sheldon Greenfield, Sherrie Kaplan, and John E Ware. 1985. Expanding patient involvement in care: effects on patient outcomes. Annals of internal medicine 102, 4 (1985), 520--528.",
      "doi": ""
    },
    {
      "text": "Fjóla Dögg Helgadóttir, Ross G Menzies, Mark Onslow, Ann Packman, and Sue O'Brian. 2009. Online CBT I: Bridging the gap between Eliza and modern online CBT treatment packages. Behaviour Change 26, 04 (2009), 245--253.",
      "doi": ""
    },
    {
      "text": "Winni F Hofman, Anand Kumar, and others. 2010. Online treatment of insomnia using behavioral techniques. Sleep Diagn Ther 5, 3 (2010), 28--32.",
      "doi": ""
    },
    {
      "text": "M Holmqvist, N Vincent, and K Walsh. 2014. Web-vs telehealth-based delivery of cognitive behavioral therapy for insomnia: a randomized controlled trial. Sleep medicine 15, 2 (2014), 187--195.",
      "doi": ""
    },
    {
      "text": "Eva Kaltenthaler, Paul Sutcliffe, Glenys Parry, C Beverley, A Rees, and Michael Ferriter. 2008. The acceptability to patients of computerized cognitive behaviour therapy for depression: a systematic review. Psychological medicine 38, 11 (2008), 1521--1530.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A Kientz. 2012. Lullaby: a capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 226--234.  ",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Shaun Lawson, Sue Jamison-Powell, Andrew Garbett, Conor Linehan, Erica Kucharczyk, Sanne Verbaan, Duncan A Rowland, and Kevin Morgan. 2013. Validating a mobile phone application for the everyday, unobtrusive, objective measurement of sleep. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2497--2506.  ",
      "doi": "10.1145/2470654.2481345"
    },
    {
      "text": "Reeva Lederman, Greg Wadley, John Gleeson, Sarah Bendall, and Mario Alvarez-Jiménez. 2014. Moderated online social therapy: Designing and evaluating technology for mental health. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 1 (2014), 5.  ",
      "doi": "10.1145/2513179"
    },
    {
      "text": "Niall Maclean and Pandora Pound. 2000. A critical review of the concept of patient motivation in the literature on physical rehabilitation. Soc Sci Med 50, 4 (2000), 495--506.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Gabriela Marcu, Kevin Tassini, Quintin Carlson, Jillian Goodwyn, Gabrielle Rivkin, Kevin J Schaefer, Anind K Dey, and Sara Kiesler. 2013. Why do they still use paper?: understanding data collection and use in Autism education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3177--3186.  ",
      "doi": "10.1145/2470654.2466436"
    },
    {
      "text": "Jun-Ki Min, Afsaneh Doryab, Jason Wiese, Shahriyar Amini, John Zimmerman, and Jason I Hong. 2014. Toss-n-turn: smartphone as sleep and sleep quality detector. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 477--486.  ",
      "doi": "10.1145/2556288.2557220"
    },
    {
      "text": "Matthew D Mitchell, Philip Gehrman, Michael Perlis, and Craig A Umscheid. 2012. Comparative effectiveness of cognitive behavioral therapy for insomnia: a systematic review. BMC family practice 13, 1 (2012), 1.",
      "doi": ""
    },
    {
      "text": "Charles M Morin, James P Culbert, and Steven M Schwartz. 1994. Nonpharmacological interventions for insomnia. Am J Psychiatry 151, 8 (1994), 1172.",
      "doi": ""
    },
    {
      "text": "Tao Ni, Amy K Karlson, and Daniel Wigdor. 2011. AnatOnMe: facilitating doctor-patient communication using a projection-based handheld device. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3333--3342.  ",
      "doi": "10.1145/1978942.1979437"
    },
    {
      "text": "Peter J Norton and Terri L Barrera. 2012. Transdiagnostic versus diagnosis-specific CBT for anxiety disorders: A preliminary randomized controlled noninferiority trial. Depression and Anxiety 29, 10 (2012), 874--882.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 6 (2015), 33.  ",
      "doi": "10.1145/2803173"
    },
    {
      "text": "US Department of Health, Human Services, and others. 1999. Mental health: A report of the Surgeon General. (1999).",
      "doi": ""
    },
    {
      "text": "Isa Okajima, Yoko Komada, and Yuichi Inoue. 2011. A meta-analysis on the treatment effectiveness of cognitive behavioral therapy for primary insomnia. Sleep and Biological Rhythms 9, 1 (2011), 24--34.",
      "doi": ""
    },
    {
      "text": "Aisling Ann O'Kane and Helena Mentis. 2012. Sharing medical data vs. health knowledge in chronic illness care. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 2417--2422.  ",
      "doi": "10.1145/2212776.2223812"
    },
    {
      "text": "Lucille ML Ong, Johanna CJM De Haes, Alaysia M Hoos, and Frits B Lammes. 1995. Doctor-patient communication: a review of the literature. Social science & medicine 40, 7 (1995), 903--918.",
      "doi": ""
    },
    {
      "text": "Sun Young Park, So Young Lee, and Yunan Chen. 2012. The effects of EMR deployment on doctors work practices: A qualitative study in the emergency department of a teaching hospital. International journal of medical informatics 81, 3 (2012), 204--217.",
      "doi": ""
    },
    {
      "text": "Michael L Perlis, Carla Jungquist, Michael T Smith, and Donn Posner. 2006. Cognitive behavioral treatment of insomnia: A session-by-session guide. Vol. 1. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Laura Pfeifer Vardoulakis, Amy Karlson, Dan Morris, Greg Smith, Justin Gatewood, and Desney Tan. 2012. Using mobile phones to present medical information to hospital patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1411--1420.  ",
      "doi": "10.1145/2207676.2208601"
    },
    {
      "text": "Olga Pykhtina, Madeline Balaam, Gavin Wood, Sue Pattison, Ahmed Kharrufa, and Patrick Olivier. 2012. Magic land: the design and evaluation of an interactive tabletop supporting therapeutic play with children. In Proceedings of the Designing Interactive Systems Conference. ACM, 136--145.  ",
      "doi": "10.1145/2317956.2317978"
    },
    {
      "text": "Stefan Rennick-Egglestone, Sarah Knowles, Gill Toms, Penny Bee, Karina Lovell, and Peter Bower. 2016. Health technologies In the wild: experiences of engagement with computerised CBT. In CHI'16 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery.  ",
      "doi": "10.1145/2858036.2858128"
    },
    {
      "text": "Lee M Ritterband, Linda A Gonder-Frederick, Daniel J Cox, Allan D Clifton, Rebecca W West, and Stephen M Borowitz. 2003. Internet interventions: in review, in use, and into the future. Professional Psychology: Research and Practice 34, 5 (2003), 527.",
      "doi": ""
    },
    {
      "text": "Lee M Ritterband, Frances P Thorndike, Linda A Gonder-Frederick, Joshua C Magee, Elaine T Bailey, Drew K Saylor, and Charles M Morin. 2009. Efficacy of an Internet-based behavioral intervention for adults with insomnia. Archives of General Psychiatry 66, 7 (2009), 692--698.",
      "doi": ""
    },
    {
      "text": "Debra L Roter, Richard M Frankel, Judith A Hall, and David Sluyter. 2006. The expression of emotion through nonverbal behavior in medical visits. Journal of general internal medicine 21, S1 (2006), S28--S34.",
      "doi": ""
    },
    {
      "text": "Moira Stewart, Judith Belle Brown, Heather Boon, Joanne Galajda, Leslie Meredith, and Michelle Sangster. 1999. Evidence on patient-doctor communication. Cancer 25 (1999), 30.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, John McCarthy, Paula Johnson, Stephanie Phillips, Jayne Wallace, Siân Lindley, Karim Ladha, Daniel Jackson, Diana Nowacka, Ashur Rafiev, and others. 2016. Challenges for Designing new Technology for Health and Wellbeing in a Complex Mental Healthcare Context. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2136--2149.  ",
      "doi": "10.1145/2858036.2858182"
    },
    {
      "text": "Kim M Unertl, Matthew B Weinger, and Kevin B Johnson. 2006. Applying direct observation to model workflow and assess adoption. In AMIA Annual Symposium Proceedings, Vol. 2006. American Medical Informatics Association, 794.",
      "doi": ""
    },
    {
      "text": "Kim M Unertl, Matthew B Weinger, Kevin B Johnson, and Nancy M Lorenzi. 2009. Describing and modeling workflow and information flow in chronic disease care. Journal of the American Medical Informatics Association 16, 6 (2009), 826--836.",
      "doi": ""
    },
    {
      "text": "David K Vawdrey, Lauren G Wilcox, Sarah A Collins, Suzanne Bakken, Steve Feiner, Aurelia Boyer, and S Restaino. 2011. A tablet computer application for patients to participate in their hospital care. In AMIA Annu Symp Proc, Vol. 2011. 1428--1435.",
      "doi": ""
    },
    {
      "text": "Norah Vincent and Samantha Lewycky. 2009. Logging on for better sleep: RCT of the effectiveness of online treatment for insomnia. Sleep 32, 6 (2009), 807--815.",
      "doi": ""
    },
    {
      "text": "Norah Vincent and Kate Walsh. 2013. Stepped care for insomnia: an evaluation of implementation in routine practice. Journal of clinical sleep medicine: JCSM: official publication of the American Academy of Sleep Medicine 9, 3 (2013), 227.",
      "doi": ""
    },
    {
      "text": "Lauren Wilcox, Dan Morris, Desney Tan, and Justin Gatewood. 2010. Designing patient-centric information displays for hospitals. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2123--2132.  ",
      "doi": "10.1145/1753326.1753650"
    },
    {
      "text": "Nicola Wiles, Laura Thomas, Anna Abel, Nicola Ridgway, Nicholas Turner, John Campbell, Anne Garland, Sandra Hollinghurst, Bill Jerrom, David Kessler, and others. 2013. Cognitive behavioural therapy as an adjunct to pharmacotherapy for primary care based patients with treatment resistant depression: results of the CoBalT randomised controlled trial. The Lancet 381, 9864 (2013), 375--384.",
      "doi": ""
    },
    {
      "text": "Maja Wrzesien, Cristina Botella, Juana Bretón-Lóípez, Eva del Ró González, Jean-Marie Burkhardt, Mariano Alcañiz, and María ángeles Pérez-Ara. 2015. Treating small animal phobias using a projective-augmented reality system: A single-case study. Computers in Human Behavior 49 (2015), 343--353.  ",
      "doi": "10.1016/j.chb.2015.01.065"
    },
    {
      "text": "Robert Zachariae, Marlene S Lyby, Lee M Ritterband, and Mia S O'Toole. 2016. Efficacy of internet-delivered cognitive-behavioral therapy for insomnia--A systematic review and meta-analysis of randomized controlled trials. Sleep medicine reviews 30 (2016), 1--10.",
      "doi": ""
    },
    {
      "text": "Kai Zheng, Hilary M Haftel, Ronald B Hirschl, Michael O'Reilly, and David A Hanauer. 2010. Quantifying the impact of health IT implementations on clinical workflow: a new methodological perspective. Journal of the American Medical Informatics Association 17, 4 (2010), 454--461.",
      "doi": ""
    },
    {
      "text": "Haining Zhu, Joanna Colgan, Madhu Reddy, and Eun Kyoung Choe. 2016. Sharing Patient-Generated Data in Clinical Practices: An Interview Study. In AMIA Annual Symposium Proceedings, Vol. 2016. American Medical Informatics Association.",
      "doi": ""
    }
  ]
}