{
  "doi": "10.1145/3025453.3025582",
  "title": "Identifying how Visually Impaired People Explore Raised-line Diagrams to Improve the Design of Touch Interfaces",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "550-555",
  "year": 2017,
  "badges": [],
  "abstract": "Raised-line diagrams are widely used by visually impaired (VI) people to read maps, drawings or graphs. While previous work has identified general exploration strategies for raised-line drawings, we have limited knowledge on how this exploration is performed in detail and how it extends to other types of diagrams such as maps or graphs, frequently used in specialized schools. Such information can be crucial for the design of accessible interfaces on touchscreens. We conducted a study in which participants were asked to explore five types of raised-line diagrams (common drawings, perspective drawings, mathematical graphs, neighborhood maps, and geographical maps) while tracking both hands fingers. Relying on a first set of results, we proposed a set of design guidelines for touch interfaces.",
  "tags": [
    "blind",
    "finger tracking",
    "raised-line diagram",
    "tactile exploration",
    "tactile drawings",
    "tactile maps",
    "bimanual exploration"
  ],
  "authors": [
    {
      "name": "Sandra Bardot",
      "institution": "University of Toulouse & CNRS, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657437",
      "orcid": "missing"
    },
    {
      "name": "Marcos Serrano",
      "institution": "University of Toulouse & CNRS, Toulouse, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Bernard Oriola",
      "institution": "CNRS & University of Toulouse, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100409371",
      "orcid": "0000-0001-5888-5268"
    },
    {
      "name": "Christophe Jouffrais",
      "institution": "CNRS & University of Toulouse, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377594403",
      "orcid": "0000-0002-0768-1019"
    }
  ],
  "references": [
    {
      "text": "D'Angiulli, A., Kennedy, J. M., & Heller, M. A. 1998. Blind children recognizing tactile pictures respond like sighted children given guidance in exploration. Scand.J.Psychol, 39(3), 187--190. ",
      "doi": ""
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, and Christophe Jouffrais. 2016. From tactile to virtual: using a smartwatch to improve spatial map exploration for visually impaired users. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, NY, NY, USA, 100111. DOI: http://dx.doi.org/10.1145/2935334.2935342  ",
      "doi": "10.1145/2935334.2935342"
    },
    {
      "text": "Anke Brock, Samuel Lebaz, Bernard Oriola, Delphine Picard, Christophe Jouffrais, and Philippe Truillet. 2012. Kin'touch: understanding how visually impaired people explore tactile maps. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, NY, NY, USA, 24712476. DOI: http://dx.doi.org/10.1145/2212776.2223821  ",
      "doi": "10.1145/2212776.2223821"
    },
    {
      "text": "Julie Ducasse, Marc J.-M. Macé, Marcos Serrano, and Christophe Jouffrais. 2016. Tangible Reels: Construction and Exploration of Tangible Maps by Visually Impaired Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 21862197. DOI: http://dx.doi.org/10.1145/2858036.2858058  ",
      "doi": "10.1145/2858036.2858058"
    },
    {
      "text": "Nicholas A. Giudice, Hari Prasath Palani, Eric Brenner, and Kevin M. Kramer. 2012. Learning non-visual graphical information using a touch-based vibro-audio interface. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '12). ACM, NY, NY, USA, 103--110. DOI= http://dx.doi.org/10.1145/2384916.2384935  ",
      "doi": "10.1145/2384916.2384935"
    },
    {
      "text": "Tiago Guerreiro, Kyle Montague, João Guerreiro, Rafael Nunes, Hugo Nicolau, and Daniel J. V. Gonçalves. 2015. Blind People Interacting with Large Touch Surfaces: Strategies for One-handed and Twohanded Exploration. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, NY, NY, USA, 25--34. DOI: http://dx.doi.org/10.1145/2817721.2817743  ",
      "doi": "10.1145/2817721.2817743"
    },
    {
      "text": "Heller, M. A. 1989. Picture and pattern perception in the sighted and blind: The advantage of the late blind. Perception;18:379. ",
      "doi": ""
    },
    {
      "text": "Heller, M. A., Calcaterra, J. A., Burson, L. L., Tyler, L. A. 1996. Tactual picture identification by blind and sighted people: Effects of providing categorical information. Percept Psychophys; 58. ",
      "doi": ""
    },
    {
      "text": "Heller, M. A. 2002. Tactile picture perception in sighted and blind people. Behavioural Brain Research, 135(1-2), 65--68. Journal Article. http://doi.org/Pm:12356435",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Annuska Z. Perkins, Daniel Wigdor, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Access overlays: improving nonvisual access to large touch screens for blind users. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, NY, NY, USA, 273--282. DOI= http://dx.doi.org/10.1145/2047196.2047232  ",
      "doi": "10.1145/2047196.2047232"
    },
    {
      "text": "Klatzky, R. L., Giudice, N. A., Bennett, C. R., & Loomis, J. M. 2014.Touch-Screen Technology for the Dynamic Display of 2D Spatial Information without Vision: Promise and progress. Multisensory Research. 27(5-6), 359--378. ",
      "doi": ""
    },
    {
      "text": "Klatzky, R. L., Lederman, S. J. 1987. The Intelligent Hand', chapter in The Psychology of Learning and Motivation Ed. G Bower (NY: Academic Press) pp. 121--151.",
      "doi": ""
    },
    {
      "text": "Lebaz, S., Jouffrais, C., & Picard, D. 2012. Haptic identification of raised-line drawings: high visuospatial imagers outperform low visuospatial imagers. Psychological Research, 76(5), 667--675. http://doi.org/10.1007/s00426-011-0351-6 ",
      "doi": ""
    },
    {
      "text": "Lederman, S. J., Klatzky, R. L., Chataway, C., Summers, C. D. 1990. Visual mediation and the haptic recognition of two-dimensional pictures of common objects. Percept Psychophys. Jan;47(1):54--64.",
      "doi": ""
    },
    {
      "text": "Lederman, S. J., & Klatzky, R. L. 1993. Extracting object properties through haptic exploration. Acta Psychol (Amst), 84(1), 29--40. ",
      "doi": ""
    },
    {
      "text": "A. K. Lobben. 2005. Identifying the needs of tactile map makers. Proceedings of XXII International Cartographic Conference.",
      "doi": ""
    },
    {
      "text": "Jack M. Loomis, Roberta L. Klatzky and Susan J. Lederman. 1991. Similarity of Tactual and Visual Picture Recognition with Limited Field of View. In Perception vol. 20 no. 2 167--177. DOI: 10.1068/p200167 ",
      "doi": ""
    },
    {
      "text": "David McGookin, Euan Robertson, and Stephen Brewster. 2010. Clutching at straws: using tangible interaction to provide non-visual access to graphs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1715--1724. DOI= http://dx.doi.org/10.1145/1753326.1753583  ",
      "doi": "10.1145/1753326.1753583"
    },
    {
      "text": "O'Modhrain, S., Giudice, N. A., Gardner, J. A., & Legge, G. E. 2015. Designing media for visuallyimpaired users of refreshable touch displays: Possibilities and pitfalls. Transactions on Haptics. 8(3), 248--257. ",
      "doi": "10.1109/TOH.2015.2466231"
    },
    {
      "text": "Bernhard Schmitz and Thomas Ertl. 2012. Interactively Displaying Maps on a Tactile Graphics Display. Spatial Knowledge Acquisition with Limited Information Displays (SKALID 2012), 13--18.",
      "doi": ""
    },
    {
      "text": "Snodgrass, J., Vanderwart, M., 1980. A standardized set of 260 pictures: Norms for name agreement, image agreement, familiarity, and visual complexity. Journal of Experimental Psychology: Human Learning and Memory, 6: 174--215. ",
      "doi": ""
    },
    {
      "text": "Symmons, M., Richardson, B. 2000. Raised line drawings are spontaneously explored with a single finger. Perception 29(5):621--626. ",
      "doi": ""
    },
    {
      "text": "Wijntjes, M. W., van Lienen, T., Verstijnen, I. M., Kappers, A. M. 2008. The influence of picture size on recognition and exploratory behaviour in raised-line drawings. Perception.; 37(4):602--14. ",
      "doi": ""
    },
    {
      "text": "Limin Zeng and Gerhard Weber. 2012. ATMap: Annotated Tactile Maps for the Visually Impaired. International Training School, Cognitive Behavioural Systems (COST 2102), LNCS Volume 7403, Springer Berlin Heidelberg, 29.",
      "doi": ""
    },
    {
      "text": "Zhao, H., Plaisant, C., Shneiderman, B., and Lazar, J. 2008. Data Sonification for Users with Visual Impairment. ACM Transactions on Computer-Human Interaction 15, 1: 1--28.  ",
      "doi": "10.1145/1352782.1352786"
    }
  ]
}