{
  "doi": "10.1145/3025453.3026006",
  "title": "GIAnT: Visualizing Group Interaction at Large Wall Displays",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2639-2647",
  "year": 2017,
  "badges": [],
  "abstract": "Large interactive displays are increasingly important and a relevant research topic, and several studies have focused on wall interaction. However, in many cases, thorough user studies currently require time-consuming video analysis and coding. We present the Group Interaction Analysis Toolkit GIAnT, which provides a rich set of visualizations supporting investigation of multi-user interaction at large display walls. GIAnT focuses on visualizing time periods, making it possible to gain overview-level insights quickly. The toolkit is designed to be extensible and features several carefully crafted visualizations: A novel timeline visualization shows movement in front of the wall over time, a wall visualization shows interactions on the wall and gaze data, and a floor visualization displays user positions. In addition, GIAnT shows the captured video stream along with basic statistics. We validate our tool by analyzing how it supports investigating major research topics and by practical use in evaluating a cooperative game.",
  "authors": [
    {
      "name": "Ulrich von Zadow",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479663154",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Christopher Andrews, Alex Endert, Beth Yost, and Chris North. 2011. Information Visualization on Large, High-resolution Displays: Issues, Challenges, and Opportunities. Information Visualization 10, 4 (Oct. 2011), 341--355. DOI: http://dx.doi.org/10.1177/1473871611415997  ",
      "doi": "10.1177/1473871611415997"
    },
    {
      "text": "Christopher Andrews and Chris North. 2013. The Impact of Physical Navigation on Spatial Organization for Sensemaking. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2207--2216. DOI: http://dx.doi.org/10.1109/TVCG.2013.205  ",
      "doi": "10.1109/TVCG.2013.205"
    },
    {
      "text": "Alec Azad, Jaime Ruiz, Daniel Vogel, Mark Hancock, and Edward Lank. 2012. Territoriality and Behaviour on and Around Large Vertical Publicly-shared Displays. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 468--477. DOI: http://dx.doi.org/10.1145/2317956.2318025  ",
      "doi": "10.1145/2317956.2318025"
    },
    {
      "text": "Robert Ball and Chris North. 2008. The Effects of Peripheral Vision and Physical Navigation on Large Scale Visualization. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 9--16. DOI: http://dx.doi.org/10.20380/GI2008.02",
      "doi": ""
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 121--130. DOI: http://dx.doi.org/10.1145/1936652.1936676  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Jeremy P. Birnholtz, Tovi Grossman, Clarissa Mak, and Ravin Balakrishnan. 2007. An Exploratory Study of Input Configuration and Group Process in a Negotiation Task Using a Large Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 91--100. DOI: http://dx.doi.org/10.1145/1240624.1240638  ",
      "doi": "10.1145/1240624.1240638"
    },
    {
      "text": "Andrew Bragdon, Rob DeLine, Ken Hinckley, and Meredith Ringel Morris. 2011. Code Space: Touch + Air Gesture Hybrid Interactions for Supporting Developer Meetings. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, NY, NY, USA, 212--221. DOI: http://dx.doi.org/10.1145/2076354.2076393  ",
      "doi": "10.1145/2076354.2076393"
    },
    {
      "text": "Brandon Burr. 2006. VACA: A Tool for Qualitative Video Analysis. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, NY, NY, USA, 622--627. DOI: http://dx.doi.org/10.1145/1125451.1125580  ",
      "doi": "10.1145/1125451.1125580"
    },
    {
      "text": "Andrew Clayphan, Roberto Martinez-Maldonado, Martin Tomitsch, Susan Atkinson, and Judy Kay. 2016. An In-the-Wild Study of Learning to Brainstorm: Comparing Cards, Tabletops and Wall Displays in the Classroom. Interacting with Computers (2016), 1--23. DOI: http://dx.doi.org/10.1093/iwc/iww001 ",
      "doi": ""
    },
    {
      "text": "Raimund Dachselt and Robert Buchholz. 2008. Throw and Tilt -- Seamless Interaction across Devices Using Mobile Phone Gestures. In Proceedings of the 2nd Workshop on Mobile and Embedded Interactive Systems (Lecture Notes in Informatics Series (LNI)). Gesellschaft für Informatik e.V. (GI), 272--278.",
      "doi": ""
    },
    {
      "text": "Adam Fouse, Nadir Weibel, Edwin Hutchins, and James D. Hollan. 2011. ChronoViz: A System for Supporting Navigation of Time-coded Data. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 299--304. DOI: http://dx.doi.org/10.1145/1979742.1979706  ",
      "doi": "10.1145/1979742.1979706"
    },
    {
      "text": "T.C. Nicholas Graham, Irina Schumann, Mrunal Patel, Quentin Bellay, and Raimund Dachselt. 2013. Villains, Architects and Micro-managers: What Tabula Rasa Teaches Us About Game Orchestration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 705--714. DOI:http://dx.doi.org/10.1145/2470654.2470754  ",
      "doi": "10.1145/2470654.2470754"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Computer Supported Collaborative Work 11, 3 (Nov. 2002), 411--446. DOI: http://dx.doi.org/10.1023/A:1021271517844  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Joey Hagedorn, Joshua Hailpern, and Karrie G. Karahalios. 2008. VCode and VData: Illustrating a New Framework for Supporting the Video Annotation Workflow. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, NY, NY, USA, 317--321. DOI: http://dx.doi.org/10.1145/1385569.1385622  ",
      "doi": "10.1145/1385569.1385622"
    },
    {
      "text": "Edward T. Hall. 1966. The Hidden Dimension. Doubleday.",
      "doi": ""
    },
    {
      "text": "Michael Haller, Jakob Leitner, Thomas Seifried, James R. Wallace, Stacey D. Scott, Christoph Richter, Peter Brandl, Adam Gokcezade, and Seth Hunter. 2010. The NiCE Discussion Room: Integrating Paper and Digital Media to Support Co-Located Group Meetings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '10). ACM, 609--618. DOI: http://dx.doi.org/10.1145/1753326.1753418  ",
      "doi": "10.1145/1753326.1753418"
    },
    {
      "text": "Cristian Hofmann, Nina Hollender, and Dieter W. Fellner. 2009. Workflow-Based Architecture for Collaborative Video Annotation. Springer Berlin Heidelberg, Berlin, Heidelberg, 33--42. DOI: http://dx.doi.org/10.1007/978--3--642-02774--1_4",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Danyel Fisher, Sharoda A. Paul, Meredith Ringel Morris, Kori Inkpen, and Mary Czerwinski. 2012. Co-Located Collaborative Visual Analytics Around a Tabletop Display. IEEE Transactions on Visualization and Computer Graphics 18, 5 (May 2012), 689--702. DOI:http://dx.doi.org/10.1109/TVCG.2011.287  ",
      "doi": "10.1109/TVCG.2011.287"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2014. Up Close and Personal: Collaborative Work on a High-resolution Multitouch Wall Display. ACM Transactions on Human-computer Interaction 21, 2, Article 11 (Feb. 2014), 34 pages. DOI: http://dx.doi.org/10.1145/2576099  ",
      "doi": "10.1145/2576099"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2015. Is Moving Improving?: Some Effects of Locomotion in Wall-Display Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 4169--4178. DOI: http://dx.doi.org/10.1145/2702123.2702312  ",
      "doi": "10.1145/2702123.2702312"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2016. Negotiating for Space?: Collaborative Work Using a Wall Display with Mouse and Touch Input. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2050--2061. DOI: http://dx.doi.org/10.1145/2858036.2858158  ",
      "doi": "10.1145/2858036.2858158"
    },
    {
      "text": "Ulrike Kister, Patrick Reipschläger, Fabrice Matulic, and Raimund Dachselt. 2015. BodyLenses: Embodied Magic Lenses and Personal Territories for Wall Displays. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, NY, NY, USA, 117--126. DOI: http://dx.doi.org/10.1145/2817721.2817726  ",
      "doi": "10.1145/2817721.2817726"
    },
    {
      "text": "Ricardo Langner, Ulrich von Zadow, Tom Horak, Annett Mitschick, and Raimund Dachselt. 2016. Content Sharing Between Spatially-Aware Mobile Phones and Large Vertical Displays Supporting Collaborative Work. Springer International Publishing. DOI: http://dx.doi.org/10.1007/978--3--319--45853--3_5",
      "doi": ""
    },
    {
      "text": "Walter S. Lasecki, Mitchell Gordon, Danai Koutra, Malte F. Jung, Steven P. Dow, and Jeffrey P. Bigham. 2014. Glance: Rapidly Coding Behavioral Video with the Crowd. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 551--562. DOI: http://dx.doi.org/10.1145/2642918.2647367  ",
      "doi": "10.1145/2642918.2647367"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-device Interaction via Micro-mobility and F-formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, NY, NY, USA, 13--22. DOI: http://dx.doi.org/10.1145/2380116.2380121  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Nicolai Marquardt, Frederico Schardong, and Anthony Tang. 2015. EXCITE: EXploring Collaborative Interaction in Tracked Environments. In Proceedings of INTERACT 2015. Lecture Notes in Computer Science, Vol. 9297. Springer International Publishing, 89--97. DOI: http://dx.doi.org/10.1007/978--3--319--22668--2_8",
      "doi": ""
    },
    {
      "text": "Roberto Martinez, Anthony Collins, Judy Kay, and Kalina Yacef. 2011. Who Did What? Who Said That?: Collaid: An Environment for Capturing Traces of Collaborative Learning at the Tabletop. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, NY, NY, USA, 172--181. DOI: http://dx.doi.org/10.1145/2076354.2076387  ",
      "doi": "10.1145/2076354.2076387"
    },
    {
      "text": "Roshanak Zilouchian Moghaddam and Brian Bailey. 2011. VICPAM: A Visualization Tool for Examining Interaction Data in Multiple Display Environments. In Proceedings of the 2011 International Conference on Human Interface and the Management of Information Volume Part I (HI'11). Springer-Verlag, Berlin, Heidelberg, 278--287. http://dl.acm.org/citation.cfm?id=2027916.2027951 ",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen and Kara Pernice. 2009. Eyetracking Web Usability (1st ed.). New Riders Publishing, Thousand Oaks, CA, USA.",
      "doi": "10.5555/1823564"
    },
    {
      "text": "Stacey D. Scott, S. Carpendale, and M. Inkpen. 2004. Territoriality in collaborative tabletop workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, 294--303. DOI: http://dx.doi.org/10.1145/1031607.1031655  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Ben Shneiderman. 1996. The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations. In Proceedings of the 1996 IEEE Symposium on Visual Languages (VL '96). IEEE Computer Society, Washington, DC, USA, 336--343. DOI: http://dx.doi.org/10.1109/VL.1996.545307 ",
      "doi": ""
    },
    {
      "text": "Samuel Silva, Beatriz Sousa Santos, and Joaquim Madeira. 2011. Using color in visualization: A survey. Computers & Graphics 35, 2 (2011), 320 -- 333. DOI: http://dx.doi.org/10.1016/j.cag.2010.11.015  ",
      "doi": "10.1016/j.cag.2010.11.015"
    },
    {
      "text": "Anthony Tang, Michel Pahud, Sheelagh Carpendale, and Bill Buxton. 2010. VisTACO: Visualizing Tabletop Collaboration. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, NY, NY, USA, 29--38. DOI: http://dx.doi.org/10.1145/1936652.1936659  ",
      "doi": "10.1145/1936652.1936659"
    },
    {
      "text": "Ulrich von Zadow, Daniel Bösel, Duc Dung Dam, Anke Lehmann, Patrick Reipschläger, and Raimund Dachselt. 2016. Miners: Communication and Awareness in Collaborative Gaming at an Interactive Display Wall. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, NY, NY, USA, 235--240. DOI:http://dx.doi.org/10.1145/2992154.2992174  ",
      "doi": "10.1145/2992154.2992174"
    },
    {
      "text": "Ulrich von Zadow, Wolfgang Büschel, Ricardo Langner, and Raimund Dachselt. 2014. SleeD: Using a Sleeve Display to Interact with Touch-sensitive Display Walls. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, NY, NY, USA, 129--138. DOI: http://dx.doi.org/10.1145/2669485.2669507  ",
      "doi": "10.1145/2669485.2669507"
    },
    {
      "text": "Ulrich von Zadow, Patrick Reipschläger, Daniel Bösel, Anita Sellent, and Raimund Dachselt. 2016. YouTouch! Low-Cost User Identification at an Interactive Display Wall. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, NY, NY, USA, 144--151. DOI: http://dx.doi.org/10.1145/2909132.2909258  ",
      "doi": "10.1145/2909132.2909258"
    }
  ]
}