{
  "doi": "10.1145/3025453.3025652",
  "title": "Pineal: Bringing Passive Objects to Life with Embedded Mobile Devices",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2583-2593",
  "year": 2017,
  "badges": [],
  "abstract": "Interactive, smart objects-customized to individuals and uses-are central to many movements, such as tangibles, the internet of things (IoT), and ubiquitous computing. Yet, rapid prototyping both the form and function of these custom objects can be problematic, particularly for those with limited electronics or programming experience. Designers often need to embed custom circuitry; program its workings; and create a form factor that not only reflects the desired user experience but can also house the required circuitry and electronics. To mitigate this, we created Pineal, a design tool that lets end-users: (1) modify 3D models to include a smart watch or phone as its heart; (2) specify high-level interactive behaviours through visual programming; and (3) have the phone or watch act out such behaviours as the objects' \"smarts\". Furthermore, a series of prototypes show how Pineal exploits mobile sensing and output, and automatically generates 3D printed form-factors for rich, interactive, objects.",
  "authors": [
    {
      "name": "David Ledo",
      "institution": "Autodesk Research & University of Calgary, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490690490",
      "orcid": "0000-0002-0455-7936"
    },
    {
      "name": "Fraser Anderson",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623584",
      "orcid": "0000-0003-3486-8943"
    },
    {
      "name": "Ryan Schmidt",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502722680",
      "orcid": "missing"
    },
    {
      "name": "Lora Oehlberg",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436599468",
      "orcid": "missing"
    },
    {
      "name": "Saul Greenberg",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/do/10.1145/contrib-81100197069/rel-imgonly/saul.greenberg.jpg",
      "acmid": "81100197069",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Daniel Ashbrook, Patrick Baudisch, and Sean White. 2011. Nenya: Subtle and Eyes-free Mobile Input with a Magnetically-tracked Finger Ring. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2043--2046. http://doi.org/10.1145/1978942.1979238  ",
      "doi": "10.1145/1978942.1979238"
    },
    {
      "text": "Martin Azizyan, Ionut Constandache, and Romit Roy Choudhury. 2009. SurroundSense: mobile phone localization via ambience fingerprinting. Proceedings of the 15th annual international conference on Mobile computing and networking, ACM, 261--272. Retrieved September 18, 2016 from http://dl.acm.org/citation.cfm?id=1614350",
      "doi": "10.1145/1614320.1614350"
    },
    {
      "text": "Patrick Baudisch, Torsten Becker, and Frederik Rudeck. 2010. Lumino: Tangible Blocks for Tabletop Computers Based on Glass Fiber Bundles. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1165--1174. http://doi.org/10.1145/1753326.1753500  ",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "Tracey Booth, Simone Stumpf, Jon Bird, and Sara Jones. 2016. Crossed Wires: Investigating the Problems of End-User Developers in a Physical Computing Task. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 3485--3497. Retrieved September 18, 2016 from http://dl.acm.org/citation.cfm?id=2858533",
      "doi": "10.1145/2858036.2858533"
    },
    {
      "text": "Anthony Chen, Stelian Coros, Jennifer Mankoff, and Scott Hudson E. 2015. Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments. To appear in Proceedings of the ACM symposium on User Interface Software and Technology.",
      "doi": ""
    },
    {
      "text": "Anthony Chen, Jeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. ACM UIST.  ",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Sean Follmer, David Carr, Emily Lovell, and Hiroshi Ishii. 2010. CopyCAD: Remixing Physical Objects with Copy and Paste from the Real World. Adjunct Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology, ACM, 381--382. http://doi.org/10.1145/1866218.1866230",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Sean Follmer and Hiroshi Ishii. 2012. KidCAD: digitally remixing toys through tangible tools. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2401--2410. http://doi.org/10.1145/2207676.2208403  ",
      "doi": "10.1145/2207676.2208403"
    },
    {
      "text": "Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. SoundWave: Using the Doppler Effect to Sense Gestures. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1911--1914. http://doi.org/10.1145/2207676.2208331  ",
      "doi": "10.1145/2207676.2208331"
    },
    {
      "text": "John Harris, Stephanie Law, Kazuki Takashima, Ehud Sharlin, and Yoshifumi Kitamura. 2014. Calamaro: Perceiving Robotic Motion in the Wild. Proceedings of the Second International Conference on Human-agent Interaction, ACM, 59--66. http://doi.org/10.1145/2658861.2658891  ",
      "doi": "10.1145/2658861.2658891"
    },
    {
      "text": "Stephanie Houde and Charles Hill. 1997. What do prototypes prototype. Handbook of human-computer interaction 2: 367--381. ",
      "doi": ""
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, and Parmit K. Chilana. 2016. Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 384--396. http://doi.org/10.1145/2858036.2858266  ",
      "doi": "10.1145/2858036.2858266"
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Moshe Mahler, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-driven, Interactive Controls for Handheld Devices. ACM SIGGRAPH 2015 Emerging Technologies, ACM, 3:1--3:1. http://doi.org/10.1145/2782782.2792490",
      "doi": "10.1145/2782782.2792490"
    },
    {
      "text": "Patrick Lazik and Anthony Rowe. 2012. Indoor pseudo-ranging of mobile devices using ultrasonic chirps. Proceedings of the 10th ACM Conference on Embedded Network Sensor Systems, ACM, 99--112. Retrieved September 18, 2016 from http://dl.acm.org/citation.cfm?id=2426667",
      "doi": "10.1145/2426656.2426724"
    },
    {
      "text": "E. Ohbuchi, H. Hanaizumi, and L. A. Hock. 2004. Barcode readers using the camera device in mobile phones. 2004 International Conference on Cyberworlds, 260--265. http://doi.org/10.1109/CW.2004.23  ",
      "doi": "10.1109/CW.2004.23"
    },
    {
      "text": "Makoto Ono, Buntarou Shizuki, and Jiro Tanaka. 2013. Touch & Activate: Adding Interactivity to Existing Objects Using Active Acoustic Sensing. Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, ACM, 31--40. http://doi.org/10.1145/2501988.2501989  ",
      "doi": "10.1145/2501988.2501989"
    },
    {
      "text": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis, and Hiroshi Ishii. 2016. Cilllia: 3D Printed Micro-Pillar Structures for Surface Texture, Actuation and Sensing. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 5753--5764. http://doi.org/10.1145/2858036.2858257  ",
      "doi": "10.1145/2858036.2858257"
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces Using Actuators, Sensors and 3D Printing. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 409--419. http://doi.org/10.1145/2858036.2858485  ",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: Enhancing Touch Interaction on Humans, Screens, Liquids, and Everyday Objects. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 483--492. http://doi.org/10.1145/2207676.2207743  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Valkyrie Savage. 2016. Fabbed to Sense: Integrated Design of Geometry and Sensing Algorithms for Interactive Objects.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: Embedded Single-camera Sensing of Printed Physical User Interfaces. Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology, ACM, 447--456. http://doi.org/10.1145/2501988.2501992  ",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. Proceedings of User Interfaces and Software Technology.",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham Mysore, and Wilmot Li. 2015. Lamello: Passive Acoustic Sensing for Tangible Input Components. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1277--1280. http://doi.org/10.1145/2702123.2702207  ",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology, ACM, 3--12. http://doi.org/10.1145/2642918.2647374  ",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology, ACM, 579--588. http://doi.org/10.1145/2380116.2380189  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, ACM, 253--258. http://doi.org/10.1145/2807442.2807503  ",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Jeremy Scott, David Dearman, Koji Yatani, and Khai N. Truong. 2010. Sensing Foot Gestures from the Pocket. Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology, ACM, 199--208. http://doi.org/10.1145/1866029.1866063  ",
      "doi": "10.1145/1866029.1866063"
    },
    {
      "text": "E. Short, K. Swift-Spong, J. Greczek, et al. 2014. How to train your DragonBot: Socially assistive robots for teaching children about nutrition through play. The 23rd IEEE International Symposium on Robot and Human Interactive Communication, 924--929. http://doi.org/10.1109/ROMAN.2014.6926371",
      "doi": ""
    },
    {
      "text": "Alexander Teibrich, Stefanie Mueller, Francois Guimbretiere, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching Physical Objects. To appear in Proceedings of the ACM symposium on User Interface Software and Technology.  ",
      "doi": "10.1145/2807442.2807467"
    },
    {
      "text": "Thingiverse.com. MakerBot Thingiverse. Retrieved September 18, 2016 from http://www.thingiverse.com/",
      "doi": ""
    },
    {
      "text": "Christian Weichel, Manfred Lau, and Hans Gellersen. 2013. Enclosed: A Component-centric Interface for Designing Prototype Enclosures. Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, ACM, 215--218. http://doi.org/10.1145/2460625.2460659  ",
      "doi": "10.1145/2460625.2460659"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3855--3864. http://doi.org/10.1145/2556288.2557090  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "M. Weiss, R. Jennings, R. Khoshabeh, et al. 2009. SLAP widgets: bridging the gap between virtual and physical controls on tabletops. ACM, 3229--3234.",
      "doi": ""
    },
    {
      "text": "Shota Yamanaka and Homei Miyashita. 2014. Vibkinesis: Notification by Direct Tap and \"Dying Message\" Using Vibronic Movement Controllable Smartphones. Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology, ACM, 535--540. http://doi.org/10.1145/2642918.2647365  ",
      "doi": "10.1145/2642918.2647365"
    },
    {
      "text": "Neng-Hao Yu, Sung-Sheng Tsai, I-Chun Hsiao, et al. 2011. Clip-on Gadgets: Expanding Multi-touch Interaction Area with Unpowered Tactile Controls. Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology, ACM, 367--372. http://doi.org/10.1145/2047196.2047243  ",
      "doi": "10.1145/2047196.2047243"
    },
    {
      "text": "Smartboy Development Kit. Hyperkin Lab. Retrieved September 18, 2016 from http://hyperkinlab.com/smartboy-development-kit/",
      "doi": ""
    },
    {
      "text": "Industrial Fiber Optics. Retrieved September 21, 2016 from http://www.i-fiberoptics.com/",
      "doi": ""
    },
    {
      "text": "Google Cardboard - Google VR. Retrieved September 18, 2016 from https://vr.google.com/cardboard/",
      "doi": ""
    },
    {
      "text": "Cycloramic. Retrieved September 18, 2016 from http://www.cycloramic.com/",
      "doi": ""
    },
    {
      "text": "3D Models for Professionals: TurboSquid. Retrieved September 18, 2016 from http://www.turbosquid.com/",
      "doi": ""
    }
  ]
}