{
  "doi": "10.1145/3025453.3025607",
  "title": "Understanding the Aesthetic Evolution of Websites: Towards a Notion of Design Periods",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5976-5987",
  "year": 2017,
  "badges": [],
  "abstract": "In art and music, time periods like \"classical\" and \"impressionist\" are powerful means for academics and practitioners to compare and contrast artifacts that share aesthetics or philosophies. While web designs have undergone changes for 25 years, we lack theories to describe or explain these changes. In this paper, we take a first step towards identifying and understanding the design periods of websites. Drawing from humanistic HCI methods, we asked subject experts of web design to critically analyze a dataset of prominent websites whose lifetimes span over a decade. These informed judgments reveal a set of key markers that signal shifts in design periods. For instance, advances in display technologies and changes in company strategies help explain how design periods demarcated by particular layout templates and navigation models arise. We suggest that designers and marketers can draw inspiration from website designs curated into design periods. Future work should examine the utility of applying design periods to any computationally embedded artifact that is an interaction design.",
  "tags": [
    "design periods",
    "interaction design criticism",
    "art",
    "websites"
  ],
  "authors": [
    {
      "name": "Wen Chen",
      "institution": "Indiana University, Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162881",
      "orcid": "missing"
    },
    {
      "name": "David J. Crandall",
      "institution": "Indiana University, Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100151330",
      "orcid": "missing"
    },
    {
      "name": "Norman Makoto Su",
      "institution": "Indiana University, Bloomington, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100108464/rel-imgonly/su_norman_2014_02_002.jpg",
      "acmid": "81100108464",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2016. The Buxton Collection. http://research.microsoft.com/en-us/um/people/ bibuxton/buxtoncollection/default.aspx. (2016).",
      "doi": ""
    },
    {
      "text": "2016. Internet Archive: Wayback Machine. (2016). https://archive.org/web/",
      "doi": ""
    },
    {
      "text": "Thomas Adajian. 2016. The Definition of Art -- The Stanford Encyclopedia of Philosophy. http://plato. stanford.edu/archives/sum2016/entries/art-definition/. (2016). {Online; accessed 19-September-2016}.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell. 2011. Interaction criticism: An introduction to the practice. Interacting with Computers 23, 6 (Nov. 2011), 604--621.  ",
      "doi": "10.1016/j.intcom.2011.07.001"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic HCI. Synthesis Lectures on Human-Centered Informatics 8, 4 (Sept. 2015), 1--185.",
      "doi": ""
    },
    {
      "text": "Howard S. Becker. 2008. Art Worlds (25th anniversary, updated and expanded ed.). University of CA Press, Berkeley, CA, USA.",
      "doi": ""
    },
    {
      "text": "Olav W. Bertelsen and Søren Pold. 2004. Criticism As an Approach to Interface Aesthetics. In Proceedings of the Third Nordic Conference on Human-computer Interaction (NordiCHI '04). ACM, NY, NY, USA, 23--32.  ",
      "doi": "10.1145/1028014.1028018"
    },
    {
      "text": "Wiebe E. Bijker. 1992. The social construction of fluorescent lighting, or how an artifact was invented in its diffusion stage. MIT Press, MA.",
      "doi": ""
    },
    {
      "text": "John Bowers. 2012. The Logic of Annotated Portfolios: Communicating the Value of \"Research Through Design\". In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 68--77.  ",
      "doi": "10.1145/2317956.2317968"
    },
    {
      "text": "Harry Brignull. 2016. Dark Patterns: fighting user deception worldwide. http://darkpatterns.org/. (2016).",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2010. A touching story: A personal perspective on the history of touch interfaces past and future. In SID Symposium Digest of Technical Papers, Vol. 41. Wiley Online Library, 444--448.",
      "doi": ""
    },
    {
      "text": "Stuart K. Card, Jock Mackinlay, and Ben Shneiderman. 1999. Readings in Information Visualization: Using Vision to Think. Morgan Kaufmann, San Francisco, Calif. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Ed H. Chi, James Pitkow, Jock Mackinlay, Peter Pirolli, Rich Gossweiler, and Stuart K. Card. 1998. Visualizing the Evolution of Web Ecologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., NY, NY, USA, 400--407.  ",
      "doi": "10.1145/274644.274699"
    },
    {
      "text": "Jack Cook and Mike Finlayson. 2005. The impact of cultural diversity on web site design. Advanced Management Journal 70, 3 (July 2005), 15--23. https://ritdml.rit.edu/handle/1850/7707",
      "doi": ""
    },
    {
      "text": "Susmita Dasgupta, Somik Lall, and David Wheeler. 2001. Policy Reform, Economic Growth, and the Digital Divide: An Econometric Analysis. Vol. 2567. World Bank Publications.",
      "doi": ""
    },
    {
      "text": "Martha S Feldman and James G March. 1981. Information in Organizations as Signal and Symbol. Administrative Science Quarterly 26, 2 (1981), 171--186.",
      "doi": ""
    },
    {
      "text": "Vishal Gaikar. 2014. The 10 Hottest Web Design Trends of 2014. (2014). http://www.tricksmachine.com/2014/07/ the-10-hottest-web-design-trends-2014.html",
      "doi": ""
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated Portfolios. Interactions July + August (2012), 40--49. https://interactions.acm.org/archive/view/ july-august-2012/annotated-portfolios  ",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "Friedhelm Hillebrand. 2002. GSM and UMTS: the Creation of Global Mobile Communication. John Wiley & Sons, Inc. ",
      "doi": "10.5555/863300"
    },
    {
      "text": "Ronald Kline and Trevor Pinch. 1996. Users as Agents of Technological Change: The Social Construction of the Automobile in the Rural USA. Technology and Culture 37, 4 (Oct. 1996), 763--795.",
      "doi": ""
    },
    {
      "text": "Lucian Leahu, Phoebe Sengers, and Michael Mateas. 2008. Interactionist AI and the promise of Ubicomp, or, how to put your box in the world without putting the world in your box. In Proceedings of the International Conference on Ubiquitous Computing (UBICOMP '08). ACM Press, NY, NY, USA, 134--143.  ",
      "doi": "10.1145/1409635.1409654"
    },
    {
      "text": "Victor Margolin. 1989. Design discourse: History, Theory, Criticism. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Philip B Meggs and Alston W Purvis. 2016. Meggs' History of Graphic Design. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Janni Nielsen, Torkil Clemmensen, and Carsten Yssing. 2002. Getting Access to What Goes on in People's Heads?: Reflections on the Think-aloud Technique. In Proceedings of the Second Nordic Conference on Human-computer Interaction (NordiCHI '02). ACM, NY, NY, USA, 101--110.  ",
      "doi": "10.1145/572020.572033"
    },
    {
      "text": "Trond Are Øritsland and Jacob Buur. 2000. Taking the Best from a Company History -- Designing with Interaction Styles. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00). ACM, NY, NY, USA, 27--38.  ",
      "doi": "10.1145/347642.347658"
    },
    {
      "text": "Trevor J. Pinch and Wiebe E. Bijker. 1987. The Social Construction of Facts and Artifacts: Or How the Sociology of Science and the Sociology of Technology Might Benefit Each Other. In The Social Construction of Technological Systems: New Directions in the Sociology and History of Technology. MIT Press.",
      "doi": ""
    },
    {
      "text": "António Pratas. 2014. Creating Flat Design Websites. Packt Publishing.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences Around the World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 11--20.  ",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Katharina Reinecke, Tom Yeh, Luke Miratrix, Rahmatri Mardiko, Yuechen Zhao, Jenny Liu, and Krzysztof Z. Gajos. 2013. Predicting Users' First Impressions of Website Aesthetics with a Quantification of Perceived Visual Complexity and Colorfulness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2049--2058.  ",
      "doi": "10.1145/2470654.2481281"
    },
    {
      "text": "David Robins and Jason Holmes. 2008. Aesthetics and credibility in web site design. Information Processing & Management 44, 1 (Jan. 2008), 386--399.  ",
      "doi": "10.1016/j.ipm.2007.02.003"
    },
    {
      "text": "Charles Rosen. 1998a. The Classical Style: Haydn, Mozart, Beethoven (expanded ed.). W. W. Norton & Company, NY.",
      "doi": ""
    },
    {
      "text": "Charles Rosen. 1998b. The Romantic Generation (fifth ed.). Harvard University Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Ronald J. Vetter, Chris Spell, and Charles Ward. 1994. Mosaic and the World Wide Web. Computer 27, 10 (1994), 49--57.  ",
      "doi": "10.1109/2.318591"
    },
    {
      "text": "Fernanda B. Viégas, Scott Golder, and Judith Donath. 2006. Visualizing Email Content: Portraying Relationships from Conversational Histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 979--988.  ",
      "doi": "10.1145/1124772.1124919"
    },
    {
      "text": "Fernanda B. Viégas, Martin Wattenberg, and Kushal Dave. 2004. Studying Cooperation and Conflict Between Authors with History Flow Visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 575--582.  ",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "Robert Stuart Weiss. 1995. Learning from Strangers: The Art and Method of Qualitative Interview Studies. Simon and Schuster, NY.",
      "doi": ""
    },
    {
      "text": "Mikael Wiberg and Erik Stolterman. 2014. What Makes a Prototype Novel?: A Knowledge Contribution Concern for Interaction Design Research. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 531--540.  ",
      "doi": "10.1145/2639189.2639487"
    },
    {
      "text": "Steve Woolgar. 1990. Configuring the User: the Case of Usability Trials. The Sociological Review 38, S1 (1990), 58--99.",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Phoebe Sengers, and Rebecca E. Grinter. 2006. Historical Analysis: Using the Past to Design the Future. In Proceedings of the International Conference on Ubiquitous Computing (UBICOMP '06). Springer-Verlag, Berlin, 35--51.  ",
      "doi": "10.1007/11853565_3"
    }
  ]
}