{
  "doi": "10.1145/3025453.3025521",
  "title": "Handsfree Omnidirectional VR Navigation using Head Tilt",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4063-4068",
  "year": 2017,
  "badges": [],
  "abstract": "Navigating mobile virtual reality (VR) is a challenge due to limited input options and/or a requirement for handsfree interaction. Walking-in-place (WIP) is considered to offer a higher presence than controller input but only allows unidirectional navigation in the direction of the user's gaze--which impedes navigation efficiency. Leaning input enables omnidirectional navigation but currently relies on bulky controllers, which aren't feasible in mobile VR contexts. This note evaluates the use of head-tilt - implemented using inertial sensing - to allow for handsfree omnidirectional VR navigation on mobile VR platforms. A user study with 24 subjects compared three input methods using an obstacle avoidance navigation task: (1) head-tilt alone (TILT) (2) a hybrid method (WIP-TILT) that uses head tilting for direction and WIP to control speed; and (3) traditional controller input. TILT was significantly faster than WIP-TILT and joystick input, while WIP-TILT and TILT offered the highest presence. There was no difference in cybersickness between input methods.",
  "authors": [
    {
      "name": "Sam Tregillus",
      "institution": "University of Nevada, Reno, NV, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019560",
      "orcid": "missing"
    },
    {
      "name": "Majed Al Zayer",
      "institution": "University of Nevada, Reno, NV, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659077766",
      "orcid": "missing"
    },
    {
      "name": "Eelke Folmer",
      "institution": "University of Nevada, Reno, NV, USA",
      "img": "/do/10.1145/contrib-81377590840/rel-imgonly/folmer.png",
      "acmid": "81377590840",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Graveyard - VR Cardboard, 2016 https://play.google.com/store/apps/details?id=com.Company.HorrorShooterVR&hl=en",
      "doi": ""
    },
    {
      "text": "Gravity Pull - VR Puzzle Game, 2016 https://play.google.com/store/apps/details?id=com.VRMersive.GravityDrop&hl=en",
      "doi": ""
    },
    {
      "text": "Slender - VR Cardboard, 2016 https://play.google.com/store/apps/details?id=com.InsomniaLabs.SlenderVRCardboard&hl=en",
      "doi": ""
    },
    {
      "text": "Works with Google Cardboard Guidelines and Best Practices, 2015 http://static.googleusercontent.com/media/www.google.com/en//get/cardboard/downloads/wwgc_best_practices.pdf",
      "doi": ""
    },
    {
      "text": "2016. VR-STEP; Unity Plugin that enables walking-in-place on mobile VR, https://www.assetstore.unity3d.com/en/#!/content/60450",
      "doi": ""
    },
    {
      "text": "Steffi Beckhaus, Kristopher J Blom, and Matthias Haringer. 2007. ChairIO - the chair-based Interface. Concepts and technologies for pervasive games: a reader for pervasive gaming research Vol:1, 231--264.",
      "doi": ""
    },
    {
      "text": "Laroussi Bouguila, Florian Evequoz, Michele Courant, and Beat Hirsbrunner. 2004. Walking-pad: a step-in-place locomotion interface for virtual environments. In Proceedings of the 6th international conference on Multimodal interfaces (ICMI'04). ACM, 77--81.  ",
      "doi": "10.1145/1027933.1027948"
    },
    {
      "text": "Bumble. 2016. Locomotion in VR: Overview of different locomotion methods on the HTC Vive, https://www.youtube.com/watch?v=p0YxzgQG2-E.",
      "doi": ""
    },
    {
      "text": "Weiya Chen, Anthony Plancoulaine, Nicolas Férey, Damien Touraine, Julien Nelson, and Patrick Bourdot. 2013. 6DoF navigation in virtual worlds: comparison of joystick-based and head-controlled paradigms. In Proceedings of the 19th ACM Symposium on Virtual Reality Software and Technology (VRST'13). ACM, 111--114.  ",
      "doi": "10.1145/2503713.2503754"
    },
    {
      "text": "Joel Chestnutt, James Kuffner, Koichi Nishiwaki, and Satoshi Kagami. 2003. Planning biped navigation strategies in complex environments. In IEEE International Conference on Humanoid Robots (Humanoids'03), Munich, Germany.",
      "doi": ""
    },
    {
      "text": "Rudolph P. Darken, William R. Cockayne, and David Carmein. 1997. The omni-directional treadmill: a locomotion device for virtual worlds. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST'97). ACM, 213--221.  ",
      "doi": "10.1145/263407.263550"
    },
    {
      "text": "Gerwin de Haan, Eric J. Griffith, and Frits H. Post. 2008. Using the Wii Balance Board#8482; as a low-cost VR interaction device. In Proceedings of the 2008 ACM symposium on Virtual reality software and technology (VRST'08). ACM, 289--290.  ",
      "doi": "10.1145/1450579.1450657"
    },
    {
      "text": "Jeff Feasel, Mary C. Whitton, and Jeremy D. Wendt. 2008. LLCM-WIP: Low-Latency, Continuous-Motion Walking-in-Place. In Proceedings of the IEEE Symposium on 3D User Interfaces (3DUI '08). IEEE, 97--104.",
      "doi": ""
    },
    {
      "text": "Richard C. Fitzpatrick, Jane E. Butler, and Brian L. Day. 2006. Resolving head rotation for human bipedalism. Current Biology 16:15, 1509--1514. ",
      "doi": ""
    },
    {
      "text": "Eelke Folmer, Fangzhou Liu, and Barrie Ellis. 2011. Navigating a 3D Avatar using a Single Switch. In Proceedings of Foundations of Digital Interactive Games (FDG'11). Bordeaux, France, 154--160.",
      "doi": "10.1145/2159365.2159386"
    },
    {
      "text": "Beverly K. Jaeger and Ronald R. Mourant. 2001. Comparison of simulator sickness using static and dynamic walking simulators. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting (HFES'01), Vol. 45. SAGE Publications, 1896--1900. ",
      "doi": ""
    },
    {
      "text": "Jason Jerald. 2015. The VR Book: Human-Centered Design for Virtual Reality. Morgan & Claypool. ",
      "doi": "10.1145/2792790"
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G. Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3:3, 203--220. ",
      "doi": ""
    },
    {
      "text": "William B. Lathrop and Mary K. Kaiser. 2002. Perceived orientation in physical and virtual environments: changes in perceived orientation as a function of idiothetic information available. Presence 11:1, 19--32.  ",
      "doi": "10.1162/105474602317343631"
    },
    {
      "text": "Joseph J. LaViola Jr, Daniel Acevedo Feliz, Daniel F. Keefe, and Robert C Zeleznik. 2001. Hands-free multi-scale navigation in virtual environments. In Proceedings of the 2001 symposium on Interactive 3D graphics (I3D '01). ACM, 9--15.",
      "doi": "10.1145/364338.364339"
    },
    {
      "text": "Gerard Llorach, Alun Evans, and Josep Blat. 2014. Simulator sickness and presence using HMDs: comparing use of a game controller and a position estimation system. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology (VRST'14). ACM, 137--140.  ",
      "doi": "10.1145/2671015.2671120"
    },
    {
      "text": "Maud Marchal, Julien Pettré, and Anatole Lécuyer. 2011. Joyman: A human-scale joystick for navigating in virtual worlds. In IEEE Symposium on 3D User Interfaces (3DUI'11), 19--26. ",
      "doi": ""
    },
    {
      "text": "John Martindale. 2016. Digital Trends: How should we move around in VR? Nobody has figured it out yet. http://www.digitaltrends.com/virtual-reality/vr-locomotion-movement-omni-hover-junkers.",
      "doi": ""
    },
    {
      "text": "Thies Pfeiffer, Aljoscha Schmidt, and Patrick Renner. 2016. Detecting Movement Patterns from Inertial Data of a Mobile Head-Mounted-Display for Navigation via Walking-in-Place. Proceedings of the IEEE Virtual Reality Conference (VR'16). 263--264 ",
      "doi": ""
    },
    {
      "text": "Bernhard E. Riecke, Bobby Bodenheimer, Timothy P. McNamara, Betsy Williams, Peng Peng, and Daniel Feuereissen. 2010. Do We Need to Walk for Effective Virtual Reality Navigation? Physical Rotations Alone May Suffice. In Proceedings of the 7th International Conference on Spatial Cognition (SC'10). Springer-Verlag, Berlin, Heidelberg, 234--247. ",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Steps and ladders in virtual reality. In Proceedings of the ACM Conference on Virtual Reality Software and Technology (VRST '94). World Scientific, 45--54. ",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1995. Taking steps: the influence of a walking technique on presence in virtual reality. ACM Transactions on Computer-Human Interaction (TOCHI) 2:3, 201--219.  ",
      "doi": "10.1145/210079.210084"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Klaus Hinrichs, Jason Jerald, Harald Frenz, Markus Lappe, Jens Herder, Simon Richir, and Indira Thouvenin. 2009. Real walking through virtual environments by redirection techniques. Journal of Virtual Reality and Broadcasting 6--2.",
      "doi": ""
    },
    {
      "text": "James Templeman, Patricia S. Denbrook, and Linda E. Sibert. 1999. Virtual Locomotion: Walking in Place through Virtual Environments. Presence 8, 6 Dec 1999, 598--617.  ",
      "doi": "10.1162/105474699566512"
    },
    {
      "text": "Léo Terziman, Maud Marchal, Mathieu Emily, Franck Multon, Bruno Arnaldi, and Anatole Lécuyer. 2010. Shake-your-head: Revisiting walking-in-place for desktop virtual reality. In Proceedings of the 17th ACM Symposium on Virtual Reality Software and Technology (VRST'10). ACM, 27--34.  ",
      "doi": "10.1145/1889863.1889867"
    },
    {
      "text": "Léo Terziman, Maud Marchal, Franck Multon, and Anatole Lécuyer. 2011. Comparing virtual trajectories made in slalom using walking-in-place and joystick techniques. In EuroVR/EGVE Joint Virtual Reality Conference (JVRC'11). Eurographics.",
      "doi": ""
    },
    {
      "text": "Sam Tregillus and Eelke Folmer. 2016. VR-STEP: Walking-in-Place using Inertial Sensing for Hands Free Navigation in Mobile VR Environments. In Proceedings of the CHI Conference on Human Factors in Computing Systems (CHI'16). ACM, 1250--1255.  ",
      "doi": "10.1145/2858036.2858084"
    },
    {
      "text": "Martin Usoh, Kevin Arthur, Mary C Whitton, Rui Bastos, Anthony Steed, Mel Slater, and Frederick P Brooks Jr. 1999. Walking&gt; walking-in-place&gt; flying, in virtual environments. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques (SIGGRAPH'99). ACM Press/Addison-Wesley Publishing Co., 359--364.  ",
      "doi": "10.1145/311535.311589"
    },
    {
      "text": "Dimitar Valkov, Frank Steinicke, Gerd Bruder, and Klaus H Hinrichs. 2010. Traveling in 3D virtual environments with foot gestures and a multi-touch enabled wim. In Proceedings of virtual reality international conference (VRIC'10). 171--180.",
      "doi": ""
    },
    {
      "text": "Jia Wang and Rob Lindeman. 2012. Leaning-based travel interfaces revisited: frontal versus sidewise stances for flying in 3D virtual spaces. In Proceedings of the 18th ACM symposium on Virtual reality software and technology (VRST'12), 121--128.  ",
      "doi": "10.1145/2407336.2407360"
    },
    {
      "text": "Jia Wang and Robert W Lindeman. 2012. Comparing isometric and elastic surfboard interfaces for leaning-based travel in 3D virtual environments. In IEEE Symposium on 3D User Interfaces (3DUI'12), 31--38.",
      "doi": ""
    },
    {
      "text": "Betsy Williams, Stephen Bailey, Gayathri Narasimham, Muqun Li, and Bobby Bodenheimer. 2011. Evaluation of Walking in Place on a Wii Balance Board to Explore a Virtual Environment. ACM Transactions on Applied Perception 8:3 Article#19",
      "doi": "10.1145/2010325.2010329"
    },
    {
      "text": "Preston Tunnell Wilson, Kevin Nguyen, Alyssa Harris, and Betsy Williams. 2014. Walking in place using the Microsoft Kinect to explore a large VE. In Proceedings of the 13th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and its Applications in Industry (VRCAI'14). ACM, 27--33.  ",
      "doi": "10.1145/2670473.2670492"
    }
  ]
}