{
  "doi": "10.1145/3025453.3025628",
  "title": "iSphere: Focus+Context Sphere Visualization for Interactive Large Graph Exploration",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2916-2927",
  "year": 2017,
  "badges": [],
  "abstract": "Interactive exploration plays a critical role in large graph visualization. Existing techniques, such as zoom-and-pan on a 2D plane and hyperbolic browser facilitate large graph exploration by showing both the details of a focal area and its surrounding context that guides the exploration process. However, existing techniques for large graph exploration are limited in either providing too little context or presenting graphs with too much distortion. In this paper, we propose a novel focus+context technique, iSphere, to address the limitation. iSphere maps a large graph onto a Riemann Sphere that better preserves graph structures and shows greater context information. We conduct extensive experiment studies on different graph exploration tasks under various conditions. The results show that iSphere performs the best in task completion time compared to the baseline techniques in link and path exploration tasks. This research also contributes to understanding large graph exploration on small screens.",
  "authors": [
    {
      "name": "Fan Du",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660690048",
      "orcid": "missing"
    },
    {
      "name": "Nan Cao",
      "institution": "Tongji University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320488328",
      "orcid": "missing"
    },
    {
      "name": "Yu-Ru Lin",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358607257",
      "orcid": "0000-0002-8497-3015"
    },
    {
      "name": "Panpan Xu",
      "institution": "Hong Kong University of Science and Technology, Clear Water Bay, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487645560",
      "orcid": "0000-0001-7966-2389"
    },
    {
      "name": "Hanghang Tong",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508696192",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "James Abello, Stephen G Kobourov, and Roman Yusufov. 2004. Visualizing large graphs with compound-fisheye views and treemaps. In International Symposium on Graph Drawing. 431--441.",
      "doi": ""
    },
    {
      "text": "James Abello, Frank Van Ham, and Neeraj Krishnan. 2006. ASK-graphview: A large scale graph visualization system. IEEE Transactions on Visualization and Computer Graphics 12, 5 (2006), 669--676.  ",
      "doi": "10.1109/TVCG.2006.120"
    },
    {
      "text": "Lars Valerian Ahlfors and Leo Sario. 2015. Riemann Surfaces. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "James Anderson. 2006. Hyperbolic Geometry. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Mark D Apperley, I Tzavaras, and Robert Spence. 1982. A bifocal display technique for data presentation. In Proceedings of Eurographics, Vol. 82. 27--43.",
      "doi": ""
    },
    {
      "text": "Michael Balzer and Oliver Deussen. 2007. Level-of-detail visualization of clustered graph layouts. In 6th International Asia-Pacific Symposium on Visualization. 133--140. ",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch, Nathaniel Good, and Paul Stewart. 2001. Focus plus context screens: Combining display technology with visualization techniques. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology. 31--40.  ",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Alan F Beardon and Ch Pommerenke. 1978. The Poincaré metric of plane domains. Journal of the London Mathematical Society 2, 3 (1978), 475--483.",
      "doi": ""
    },
    {
      "text": "Benjamin B Bederson, James D Hollan, Ken Perlin, Jonathan Meyer, David Bacon, and George Furnas. 1996. Pad++: A zoomable graphical sketchpad for exploring alternate interface physics. Journal of Visual Languages & Computing 7, 1 (1996), 3--32.",
      "doi": ""
    },
    {
      "text": "Nan Cao, Yu-Ru Lin, Liangyue Li, and HangHang Tong. 2015. g-Miner: Interactive visual group mining on multivariate graphs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 279--288.  ",
      "doi": "10.1145/2702123.2702446"
    },
    {
      "text": "Nan Cao, Jimeng Sun, Yu-Ru Lin, David Gotz, Shixia Liu, and Huamin Qu. 2010. FacetAtlas: Multifaceted visualization for rich text corpora. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 1172--1181.  ",
      "doi": "10.1109/TVCG.2010.154"
    },
    {
      "text": "Duen Horng Chau, Aniket Kittur, Jason I Hong, and Christos Faloutsos. 2011. Apolo: Interactive large graph sensemaking by combining machine learning and visualization. In Proceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 739--742.",
      "doi": "10.1145/2020408.2020524"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B Bederson. 2009. A review of overview+detail, zooming, and focus+context interfaces. Comput. Surveys 41, 1 (2009), 2:1--2:31.",
      "doi": ""
    },
    {
      "text": "Aurélie Cohé, Bastien Liutkus, Gilles Bailly, James Eagan, and Eric Lecolinet. 2016. SchemeLens: A content-aware vector-based fisheye technique for navigating large systems diagrams. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 330--338. ",
      "doi": "10.1109/TVCG.2015.2467035"
    },
    {
      "text": "Harold Scott Macdonald Coxeter. 1969. Introduction to Geometry. Wiley.",
      "doi": ""
    },
    {
      "text": "Andrej Cvetkovski and Mark Crovella. 2016. Multidimensional scaling in the Poincaré disk. Applied Mathematics & Information Sciences 10, 1 (2016), 125--133. ",
      "doi": ""
    },
    {
      "text": "Arnold Douglas and Jonathan Rogness. 2009. Möbius transformations revealed. Notices of American Mathematical Society 55, 10 (2009), 1226--1231.",
      "doi": ""
    },
    {
      "text": "Juan C. Dürsteler. 2002. Focus+context. www.infovis.net/printMag.php?num=85&lang=2. (2002). [Online; accessed 1-Sept-2016].",
      "doi": ""
    },
    {
      "text": "Peter Eades and Qing-Wen Feng. 1997. Multilevel visualization of clustered graphs. In Graph Drawing. 101--112. ",
      "doi": ""
    },
    {
      "text": "Niklas Elmqvist and Jean-Daniel Fekete. 2010. Hierarchical aggregation for information visualization: Overview, techniques, and design guidelines. IEEE Transactions on Visualization and Computer Graphics 16, 3 (2010), 439--454.  ",
      "doi": "10.1109/TVCG.2009.84"
    },
    {
      "text": "Werner Fenchel. 1989. Elementary Geometry in Hyperbolic Space. Walter de Gruyter. ",
      "doi": ""
    },
    {
      "text": "G W Furnas. 1986. Generalized fisheye views. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 16--23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "George W Furnas. 2006. A fisheye follow-up: Further reflections on focus+context. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 999--1008.",
      "doi": "10.1145/1124772.1124921"
    },
    {
      "text": "Emden R Gansner, Yehuda Koren, and Stephen North. 2005a. Graph drawing by stress majorization. In Graph Drawing. 239--250.",
      "doi": ""
    },
    {
      "text": "Emden R Gansner, Yehuda Koren, and Stephen C North. 2005b. Topological fisheye views for visualizing large graphs. IEEE Transactions on Visualization and Computer Graphics 11, 4 (2005), 457--468.  ",
      "doi": "10.1109/TVCG.2005.66"
    },
    {
      "text": "Mohammad Ghoniem, Jean-Daniel Fekete, and Philippe Castagliola. 2004. A comparison of the readability of graphs using node-link and matrix-based representations. In IEEE Symposium on Information Visualization. 17--24. ",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk, Benjamin B. Bederson, and Catherine Plaisant. 2002. Navigation patterns and usability of zoomable user interfaces with and without an overview. ACM Transactions on Computer-Human Interaction 9, 4 (2002), 362--389.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "Takao Ito, Kazuo Misue, and Jiro Tanaka. 2009. Sphere anchored map: A visualization technique for bipartite graphs in 3D. In International Conference on Human-Computer Interaction. 811--820.  ",
      "doi": "10.1007/978-3-642-02577-8_89"
    },
    {
      "text": "Naftali Kadmon and Eli Shlomi. 1978. A polyfocal projection for statistical surfaces. The Cartographic Journal 15, 1 (1978), 36--41. ",
      "doi": ""
    },
    {
      "text": "P. Karnick, D. Cline, S. Jeschke, A. Razdan, and P. Wonka. 2010. Route visualization using detail lenses. IEEE Transactions on Visualization and Computer Graphics 16, 2 (2010), 235--247.  ",
      "doi": "10.1109/TVCG.2009.65"
    },
    {
      "text": "Stephen G Kobourov and Kevin Wampler. 2005. Non-Euclidean spring embedders. IEEE Transactions on Visualization and Computer Graphics 11, 6 (2005), 757--767.  ",
      "doi": "10.1109/TVCG.2005.103"
    },
    {
      "text": "Matthias Kreuseler, Norma Lopez, and Heidrun Schumann. 2000. A scalable framework for information visualization. In IEEE Symposium on Information Visualization. 27--36. ",
      "doi": ""
    },
    {
      "text": "Oh-Hyun Kwon, Chris Muelder, Kyungwon Lee, and Kwan-Liu Ma. 2015. Spherical layout and rendering methods for immersive graph visualization. In IEEE Pacific Visualization Symposium. 63--67.",
      "doi": ""
    },
    {
      "text": "Eric LaMar, Bernd Hamann, Kenneth Joy, and others. 2001. A magnification lens for interactive volume visualization. In Proceedings of the 9th Pacific Conference on Computer Graphics and Applications. 223--232. ",
      "doi": ""
    },
    {
      "text": "John Lamping, Ramana Rao, and Peter Pirolli. 1995. A focus+context technique based on hyperbolic geometry for visualizing large hierarchies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 401--408.  ",
      "doi": "10.1145/223904.223956"
    },
    {
      "text": "Bongshin Lee, Catherine Plaisant, Cynthia Sims Parr, Jean-Daniel Fekete, and Nathalie Henry. 2006. Task taxonomy for graph visualization. In Proceedings of the AVI Workshop on BEyond Time and Errors: Novel Evaluation Methods for Information Visualization. 1--5.  ",
      "doi": "10.1145/1168149.1168168"
    },
    {
      "text": "Ying K Leung and Mark D Apperley. 1994. A review and taxonomy of distortion-oriented presentation techniques. ACM Transactions on Computer-Human Interaction 1, 2 (1994), 126--160.  ",
      "doi": "10.1145/180171.180173"
    },
    {
      "text": "Wanchun Li and Masahiro Takatsuka. 2004. Adding filtering to geometric distortion to visualize a clustered graph on small screens. In Proceedings of the Australasian Symposium on Information Visualisation, Vol. 35. 71--79.",
      "doi": ""
    },
    {
      "text": "Zhiyuan Lin, Nan Cao, Hanghang Tong, Fei Wang, U Kang, and Duen Horng Polo Chau. 2013. Demonstrating interactive multi-resolution large graph exploration. In IEEE 13th International Conference on Data Mining Workshops. 1097--1100.",
      "doi": "10.1109/ICDMW.2013.124"
    },
    {
      "text": "Kwan-Liu Ma and Chris W Muelder. 2013. Large-scale graph visualization and analytics. Computer 46, 7 (2013), 39--46.  ",
      "doi": "10.1109/MC.2013.242"
    },
    {
      "text": "Tomer Moscovich, Fanny Chevalier, Nathalie Henry, Emmanuel Pietriga, and Jean-Daniel Fekete. 2009. Topology-aware navigation in large networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2319--2328.  ",
      "doi": "10.1145/1518701.1519056"
    },
    {
      "text": "Tamara Munzner. 1998. Exploring large graphs in 3D hyperbolic space. IEEE Computer Graphics and Applications 18, 4 (1998), 18--23.  ",
      "doi": "10.1109/38.689657"
    },
    {
      "text": "M. E. J. Newman. 2006. Modularity and community structure in networks. Proceedings of the National Academy of Sciences 103, 23 (2006), 8577--8582. ",
      "doi": ""
    },
    {
      "text": "Ken Perlin and David Fox. 1993. Pad: An alternative approach to the computer interface. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques. 57--64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Pratha Sah, Lisa Singh, Aaron Clauset, and Shweta Bansal. 2014. Exploring community structure in biological networks with random graphs. BMC Bioinformatics 15, 1 (2014), 220.",
      "doi": ""
    },
    {
      "text": "Manojit Sarkar and Marc H. Brown. 1994. Graphical fisheye views. Commun. ACM 37, 12 (1994), 73--83.  ",
      "doi": "10.1145/198366.198384"
    },
    {
      "text": "Lei Shi, Nan Cao, Shixia Liu, Weihong Qian, Li Tan, Guodong Wang, Jimeng Sun, and Ching-Yung Lin. 2009. Himap: Adaptive visualization of large-scale online social networks. In IEEE Pacific Visualization Symposium. 41--48.",
      "doi": ""
    },
    {
      "text": "Christian Tominski, James Abello, and Heidrun Schumann. 2009. CGV-an interactive graph visualization system. Computers & Graphics 33, 6 (2009), 660--678.  ",
      "doi": "10.1016/j.cag.2009.06.002"
    },
    {
      "text": "C Tominski, S Gladisch, U Kister, R Dachselt, and H Schumann. 2016. Interactive lenses for visualization: An extended survey. Computer Graphics Forum (2016).",
      "doi": ""
    },
    {
      "text": "Frank Van Ham and Jarke J van Wijk. 2004. Interactive visualization of small world graphs. In IEEE Symposium on Information Visualization. 199--206.  ",
      "doi": "10.1109/INFVIS.2004.43"
    },
    {
      "text": "Tatiana Von Landesberger, Arjan Kuijper, Tobias Schreck, Jörn Kohlhammer, Jarke J van Wijk, Jean-Daniel Fekete, and Dieter W Fellner. 2011. Visual analysis of large graphs: State-of-the-art and future research challenges. Computer Graphics Forum 30, 6 (2011), 1719--1749. ",
      "doi": ""
    },
    {
      "text": "w3schools. 2015. Browser display statistics. w3schools.com/browsers/browsers_display.asp. (2015). [Online; accessed 1-Sept-2016].",
      "doi": ""
    },
    {
      "text": "Jörg A Walter. 2004. H-MDS: A new approach for interactive visualization with multidimensional scaling in the hyperbolic space. Information Systems 29, 4 (2004), 273--292.  ",
      "doi": "10.1016/j.is.2003.10.002"
    },
    {
      "text": "InfoVis Wiki. 2014. Semantic zoom. infovis-wiki.net/index.php/Semantic_Zoom. (2014). [Online; accessed 1-Sept-2016].",
      "doi": ""
    },
    {
      "text": "Harold E Wolfe. 2012. Introduction to Non-Euclidean Geometry. Dover Publications.",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Xiaotong Liu, Shixia Liu, and Kwan-Liu Ma. 2013. ViSizer: A visualization resizing framework. IEEE Transactions on Visualization and Computer Graphics 19, 2 (2013), 278--290.  ",
      "doi": "10.1109/TVCG.2012.114"
    },
    {
      "text": "Kai Xu, Chris Rooney, Peter Passmore, Dong-Han Ham, and Phong H Nguyen. 2012. A user study on curved edges in graph visualization. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2449--2456.  ",
      "doi": "10.1109/TVCG.2012.189"
    }
  ]
}