{
  "doi": "10.1145/3025453.3025615",
  "title": "Technologies and Social Justice Outcomes in Sex Work Charities: Fighting Stigma, Saving Lives",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3352-3364",
  "year": 2017,
  "badges": [],
  "abstract": "Sex workers' rights are human rights, and as such are an issue inherently based in social, criminal, and political justice debates. As HCI continues to move towards feminist and social justice oriented research and design approaches, we argue that we need to take into consideration the difficulties faced by sex workers; and explore how technology can and does mediate social justice outcomes for them. We contribute directly to this challenge by providing an empirical account of a charity whose work is built on the underlying move towards social and criminal justice for sex workers in the UK. Through ethnographic fieldwork, meetings, interviews, surveys, and creative workshops we describe the different points of view associated with the charity from a variety of stakeholders. We discuss their service provision and the ways in which HCI is uniquely positioned to be able respond to the needs of and to support sex work support services.",
  "tags": [
    "activism",
    "charities",
    "sex work",
    "feminist hci",
    "ethnography",
    "social justice"
  ],
  "authors": [
    {
      "name": "Angelika Strohmayer",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702171",
      "orcid": "missing"
    },
    {
      "name": "Mary Laing",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160614",
      "orcid": "missing"
    },
    {
      "name": "Rob Comber",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    }
  ],
  "references": [
    {
      "text": "Yoko Akama and Ann Light. 2012. A candor in reporting. Proceedings of the 2012 ACM annual conference extended abstracts on Human Factors in Computing Systems Extended Abstracts - CHI EA '12, ACM Press, 281. http://doi.org/10.1145/2212776.2212806  ",
      "doi": "10.1145/2212776.2212806"
    },
    {
      "text": "Priscilla Alexander. 2010. Feminism, Sex Workers, and Human Rights. In Whores and other Feminists, Jill Nagle (ed.). Routledge, Oxon, 83--97.",
      "doi": ""
    },
    {
      "text": "Teresa Almeida. 2015. Designing intimate wearables to promote preventative health care practices. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers - UbiComp '15, ACM Press, 659--662. http://doi.org/10.1145/2800835.2809440  ",
      "doi": "10.1145/2800835.2809440"
    },
    {
      "text": "Teresa Almeida, Gavin Wood, Dean Saraf, and Madeline Balaam. 2015. Labella. Proceedings of the 2015 British HCI Conference on - British HCI '15, ACM Press, 310--311. http://doi.org/10.1145/2783446.2783626",
      "doi": "10.1145/2783446.2783626"
    },
    {
      "text": "Amnesty International. 2016. AMNESTY INTERNATIONAL POLICY ON STATE OBLIGATIONS TO RESPECT, PROTECT AND FULFIL THE HUMAN RIGHTS OF SEX WORKERS. Amnesty International. Retrieved September 16, 2016 from https://www.amnesty.org/en/documents/pol30/4062 /2016/en/",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2011. Pleasure is your birthright. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, 257. http://doi.org/10.1145/1978942.1978979  ",
      "doi": "10.1145/1978942.1978979"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press, 1301. http://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, 675. http://doi.org/10.1145/1978942.1979041  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Eli Blevis, Susanne Bødker, John Flach, et al. 2015. Ecological Perspectives in HCI. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '15, ACM Press, 2401--2404. http://doi.org/10.1145/2702613.2702634  ",
      "doi": "10.1145/2702613.2702634"
    },
    {
      "text": "Susanne Bødker. 2015. Third-wave HCI, 10 years later--participation and sharing. interactions 22, 5, 24--31. http://doi.org/10.1145/2804405",
      "doi": "10.1145/2804405"
    },
    {
      "text": "Johanna Brewer, Joseph 'Jofish' Kaye, Amanda Williams, and Susan Wyche. 2006. Sexual interactions. CHI '06 extended abstracts on Human factors in computing systems - CHI EA '06, ACM Press, 1695. http://doi.org/10.1145/1125451.1125765",
      "doi": "10.1145/1125451.1125765"
    },
    {
      "text": "Alex Bryce, Rosie Campbell, Jane Pitcher, et al. 2015. Male escorting, safety and National Ugly Mugs. In Queer Sex Work, Mary Laing, Katy Pilcher and Nicola Smith (eds.). Routledge, Oxon. Retrieved from https://books.google.co.uk/books?hl=en&lr=&id=X GDABgAAQBAJ&oi=fnd&pg=PT289&dq=violen ce+against+escorts&ots=EixdCSZ7Vo&sig=Qhbf9 1ON82Z6rdQqR4Ml_iPc8zw#v=onepage&q=viole nce against escorts&f=false",
      "doi": ""
    },
    {
      "text": "Melinda Chateauvert. 2013. Sex Workers Unite: A History of the Movement from Stonewall to SlutWalk. Beacon Press, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Peter Wright, Madeline Balaam, and John McCarthy. 2013. Digital portraits. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, 2517. http://doi.org/10.1145/2470654.2481348  ",
      "doi": "10.1145/2470654.2481348"
    },
    {
      "text": "Laura Connelly. 2014. Working Conditions and Job Satisfaction in Sex Work Pilot.",
      "doi": ""
    },
    {
      "text": "Scott Cunningham and Todd D. Kendall. 2011. Prostitution 2.0: The changing face of sex work. Journal of Urban Economics 69, 3, 273--287. http://doi.org/10.1016/j.jue.2010.12.001 ",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and W. Keith Edwards. 2008. The view from the trenches. Proceedings of the ACM 2008 conference on Computer supported cooperative work - CSCW '08, ACM Press, 589. http://doi.org/10.1145/1460563.1460656  ",
      "doi": "10.1145/1460563.1460656"
    },
    {
      "text": "Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15, ACM Press, 1348--1358. http://doi.org/10.1145/2675133.2675147  ",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Christina DeCurtis. 2003. Prostitution, Sex Tourism on the Internet. ACM SIGCAS Computers and Society 33, 1, 3. http://doi.org/10.1145/966498.966502",
      "doi": "10.1145/966498.966502"
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2014. Relational expertise in participatory design. Proceedings of the 13th Participatory Design Conference on Research Papers - PDC '14, ACM Press, 41--50. http://doi.org/10.1145/2661435.2661452  ",
      "doi": "10.1145/2661435.2661452"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 656--671. http://doi.org/10.1145/2901790.2901861  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Anna Eaglin and Shaowen Bardzell. 2011. Sex toys and designing for sexual wellness. Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems - CHI EA '11, ACM Press, 1837. http://doi.org/10.1145/1979742.1979879  ",
      "doi": "10.1145/1979742.1979879"
    },
    {
      "text": "Alex Feis-Bryce. 2015. Why the Third Sector Must Be Political. The Huffington Post. Retrieved July 5, 2016 from http://www.huffingtonpost.co.uk/alexfeisbryce/third-sector-politics_b_7783312.html",
      "doi": ""
    },
    {
      "text": "Pippa Grenfell, Janet Eastham, Georgina Perry, and Lucy Platt. 2016. Decriminalising sex work in the UK. BMJ (Clinical research ed.) 354, 9, i4459. http://doi.org/10.1136/bmj.i4459 ",
      "doi": ""
    },
    {
      "text": "Miriam Heijnders and Suzanne Van Der Meij. 2006. The fight against stigma: An overview of stigma-reduction strategies and interventions. Psychology, Health & Medicine 11, 3, 353--363. http://doi.org/10.1080/13548500600595327 ",
      "doi": ""
    },
    {
      "text": "Home Affairs Committee. 2016. Prostitution. London. Retrieved September 15, 2016 from http://www.publications.parliament.uk/pa/cm20161 7/cmselect/cmhaff/26/26.pdf",
      "doi": ""
    },
    {
      "text": "Phil. Hubbard. 2011. Cities and sexualities. Routledge.",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and Paul Dourish. 2009. Postcolonial interculturality. Proceeding of the 2009 international workshop on Intercultural collaboration - IWIC '09, ACM Press, 249. http://doi.org/10.1145/1499224.1499268  ",
      "doi": "10.1145/1499224.1499268"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, ACM Press, 1311. http://doi.org/10.1145/1753326.1753522  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Robert R. Johnson. 2000. Nardi and O'Day's information ecologies. ACM Journal of Computer Documentation 24, 2, 78. http://doi.org/10.1145/337271.337286",
      "doi": "10.1145/337271.337286"
    },
    {
      "text": "Mary Laing. 2016. After Keith Vaz: why the Home Affairs Select Committee's prostitution inquiry must continue. The Conversation.",
      "doi": ""
    },
    {
      "text": "Mary Laing, Jane Pitcher, and With Adele Irving. 2013. National Ugly Mugs Pilot Scheme Evaluation Report.",
      "doi": ""
    },
    {
      "text": "John Law. 2004. After Method: Mess in Social Science Research. Routledge, Oxon.",
      "doi": ""
    },
    {
      "text": "Carol Leigh. 2010. Inventing Sex Work. In Whores and other Feminists, Jill Nagle (ed.). Routledge, New York, 225--231.",
      "doi": ""
    },
    {
      "text": "Yi Liu, Chuangbai Xiao, Zhe Wang, and Chunxiao Bian. 2012. An one-class classification approach to detecting porn image. Proceedings of the 27th Conference on Image and Vision Computing New Zealand - IVCNZ '12, ACM Press, 284--289. http://doi.org/10.1145/2425836.2425893  ",
      "doi": "10.1145/2425836.2425893"
    },
    {
      "text": "Toni Mac. 2016. The laws that sex workers really want. TED. Retrieved from https://www.ted.com/talks/toni_mac_the_laws_that _sex_workers_really_want",
      "doi": ""
    },
    {
      "text": "David Martin and Ian Sommerville. 2004. Patterns of cooperative interaction. ACM Transactions on Computer-Human Interaction 11, 1, 59--89. http://doi.org/10.1145/972648.972651  ",
      "doi": "10.1145/972648.972651"
    },
    {
      "text": "Jill Nagle. 2010. Introduction. In Whores and other Feminists, Jill Nagle (ed.). Routledge, Oxon. ",
      "doi": ""
    },
    {
      "text": "Pradeep Narayanan. 2003. Empowerment through Participation: How Effective Is This Approach? on JSTOR. Economic and Political Weekly 38, 25, 2484--2486. Retrieved from http://www.jstor.org/stable/4413702'seq=1#page_s can_tab_contents",
      "doi": ""
    },
    {
      "text": "National Ugly Mugs. 2015. Impact Report. Retrieved September 13, 2016 from https://uknswp.org/um/uploads/UglyMugsA6Broch urev4.pdf",
      "doi": ""
    },
    {
      "text": "National Ugly Mugs. 2016. Written evidence submitted by National Ugly Mugs. London. Retrieved September 15, 2016 from http://data.parliament.uk/writtenevidence/committe eevidence.svc/evidencedocument/home-affairscommittee/prostitution/written/29064.pdf",
      "doi": ""
    },
    {
      "text": "National Ugly Mugs. 2016. Supplementary written evidence submitted by National Ugly Mugs. London. Retrieved September 15, 2016 from http://data.parliament.uk/writtenevidence/committe eevidence.svc/evidencedocument/home-affairscommittee/prostitution/written/30848.pdf",
      "doi": ""
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics. interactions 22, 4, 61--63. http://doi.org/10.1145/2776885",
      "doi": "10.1145/2776885"
    },
    {
      "text": "Scott R. Peppet. 2012. Prostitution 3.0. Iowa Law Review 98. Retrieved September 6, 2016 from http://heinonline.org/HOL/Page?handle=hein.journ als/ilr98&id=2061&div=56&collection=journals",
      "doi": ""
    },
    {
      "text": "J. Pitcher and M. Wijers. 2014. The impact of different regulatory models on the labour conditions, safety and welfare of indoor-based sex workers. Criminology and Criminal Justice 14, 5, 549--564. http://doi.org/10.1177/1748895814531967 ",
      "doi": ""
    },
    {
      "text": "Michael L Rekart. 2005. Sex-work harm reduction. The Lancet 366, 9503, 2123--2134. http://doi.org/10.1016/S0140--6736(05)67732-X",
      "doi": ""
    },
    {
      "text": "Jennifer A. Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5, 393--400. http://doi.org/10.1016/j.intcom.2011.04.005  ",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Nithya Sambasivan, Julie Weber, and Edward Cutrell. 2011. Designing a phone broadcasting system for urban sex workers in India. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, 267. http://doi.org/10.1145/1978942.1978980  ",
      "doi": "10.1145/1978942.1978980"
    },
    {
      "text": "Daniel Ribeiro Silva, Andrew Philpot, Abhishek Sundararajan, Nicole Marie Bryan, and Eduard Hovy. 2014. Data integration from open internet sources and network detection to combat underage sex trafficking. Proceedings of the 15th Annual International Conference on Digital Government Research - dg.o '14, ACM Press, 86--90. http://doi.org/10.1145/2612733.2612746  ",
      "doi": "10.1145/2612733.2612746"
    },
    {
      "text": "Allegra W. Smith. 2015. Porn architecture. Communication Design Quarterly Review 3, 1, 17-- 23. http://doi.org/10.1145/2721882.2721885  ",
      "doi": "10.1145/2721882.2721885"
    },
    {
      "text": "Angelika Strohmayer, Rob Comber, and Madeline Balaam. 2015. Exploring Learning Ecologies among People Experiencing Homelessness. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, 2275--2284. http://doi.org/10.1145/2702123.2702157  ",
      "doi": "10.1145/2702123.2702157"
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Paula Johnson, et al. 2013. Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, 2647. http://doi.org/10.1145/2470654.2481366  ",
      "doi": "10.1145/2470654.2481366"
    },
    {
      "text": "Gareth Tyson, Yehia Elkhatib, Nishanth Sastry, and Steve Uhlig. 2013. Demystifying porn 2.0. Proceedings of the 2013 conference on Internet measurement conference - IMC '13, ACM Press, 417--426. http://doi.org/10.1145/2504730.2504739",
      "doi": "10.1145/2504730.2504739"
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, 429. http://doi.org/10.1145/2470654.2470716  ",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Kristin M Wall, William Kilembe, Mubiana Inambao, et al. 2015. Implementation of an electronic fingerprint-linked data collection system: a feasibility and acceptability study among Zambian female sex workers. Globalization and health 11, 1, 27. http://doi.org/10.1186/s12992-0150114-z",
      "doi": ""
    },
    {
      "text": "Hao Wang, Congxing Cai, Andrew Philpot, Mark Latonero, Eduard H. Hovy, and Donald Metzler. 2012. Data integration from open internet sources to combat sex trafficking of minors. Proceedings of the 13th Annual International Conference on Digital Government Research - dg.o '12, ACM Press, 246. http://doi.org/10.1145/2307729.2307769  ",
      "doi": "10.1145/2307729.2307769"
    },
    {
      "text": "Westminster Sex Worker Task Group. 2013. Violence Faced By Sex Workers In Westminster: Recommendations Report. Retrieved from http://transact.westminster.gov.uk/docstores/publica tions_store/policy-scrutiny/sex-worker-report2013.pdf",
      "doi": ""
    },
    {
      "text": "Amanda M. Williams and Lilly Irani. 2010. There's methodology in the madness. Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems CHI EA '10, ACM Press, 2725. http://doi.org/10.1145/1753846.1753857  ",
      "doi": "10.1145/1753846.1753857"
    },
    {
      "text": "Jill Palzkill Woelfer, Amy Iverson, David G. Hendry, Batya Friedman, and Brian T. Gill. 2011. Improving the safety of homeless young people with mobile phones. Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, ACM Press, 1707. http://doi.org/10.1145/1978942.1979191  ",
      "doi": "10.1145/1978942.1979191"
    },
    {
      "text": "Matthew Wood, Gavin Wood, and Madeline Balaam. 2015. Talk About Sex. Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY '15, ACM Press, 795--798. http://doi.org/10.1145/2793107.2810270  ",
      "doi": "10.1145/2793107.2810270"
    }
  ]
}