{
  "doi": "10.1145/3025453.3025967",
  "title": "Why Players use Pings and Annotations in Dota 2",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1978-2018",
  "year": 2017,
  "badges": [],
  "abstract": "Groupware research has long focused on representing gestures as a means to facilitate collaboration. However, this work has not led to wide support of gesturing in commercial groupware systems. In contrast, Dota 2, a popular MOBA game, provides two frequently-used gesturing tools: annotations - freely drawn lines on top of the gamespace - and pings - a combination of animation and sound indicating a point of interest. While gesturing tools are important for quickly coordinating with teammates in Dota 2, there is little information about how and why people use them. To gather this information, we performed two complementary studies: an interaction analysis of eight game replays, and a survey of 167 experienced players. Our findings include: six distinct motivations for the use of gesturing tools; when and how frequently gesture motivations occur during games; and, that players find pings an essential tool for winning, but not annotations. Our findings provide new directions for the design of gesturing tools in groupware and online games.",
  "tags": [
    "gestures",
    "groupware",
    "online games",
    "pings",
    "dota 2",
    "communication tools",
    "mobas",
    "annotations",
    "motivation"
  ],
  "authors": [
    {
      "name": "Jason Wuertz",
      "institution": "University of New Brunswick, Fredericton, NB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659077520",
      "orcid": "missing"
    },
    {
      "name": "Scott Bateman",
      "institution": "University of New Brunswick, Fredericton, NB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361599570",
      "orcid": "0000-0003-3592-2163"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    }
  ],
  "references": [
    {
      "text": "Herbert H. Clark. 1996. Using Language. Cambridge University Press. ",
      "doi": ""
    },
    {
      "text": "Susan R. Fussell, Leslie D. Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer, and Adam D. I. Kramer. 2004. Gestures over video streams to support remote collaboration on physical tasks. Hum.-Comput. Interact. 19, 3 (September 2004), 273--309. http://dx.doi.org/10.1207/s15327051hci1903_3  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. World-stabilized annotations and virtual scene navigation for remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, NY, NY, USA, 449--459. http://doi.acm.org/10.1145/2642918.2647372  ",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware Computer Supported Cooperative Work (CSCW), 11,3. 411--446. http://dx.doi.org/10.1023/A:1021271517844  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Carl Gutwin, Mark Roseman, and Saul Greenberg. 1996. A usability study of awareness widgets in a shared workspace groupware system. In Proceedings of the 1996 ACM conference on Computer supported cooperative work (CSCW '96), 258--267. http://dx.doi.org/10.1145/240080.240298  ",
      "doi": "10.1145/240080.240298"
    },
    {
      "text": "Hiroshi Ishii, Minoru Kobayashi, and Jonathan Grudin. 1993. Integration of interpersonal space and shared workspace: ClearBoard design and experiments. ACM Transactions on Information Systems 11, 4: 349--375. http://doi.org/10.1145/159764.159762  ",
      "doi": "10.1145/159764.159762"
    },
    {
      "text": "Brennan Jones, Anna Witcraft, Scott Bateman, Carman Neustaedter, and Anthony Tang. 2015. Mechanics of Camera Work in Mobile Video Collaboration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 957--966. http://doi.acm.org/10.1145/2702123.2702345  ",
      "doi": "10.1145/2702123.2702345"
    },
    {
      "text": "Brigitte Jordan, and Austin Henderson. 1995. Interaction Analysis: Foundations and Practice. Journal of the Learning Sciences. 4, 1, 39--103. http://dx.doi.org/10.1207/s15327809jls0401_2 ",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2014. Playing with strangers: understanding temporary teams in league of legends. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY '14), 161--169. http://dx.doi.org/10.1145/2658537.2658538  ",
      "doi": "10.1145/2658537.2658538"
    },
    {
      "text": "Alex Leavitt, Brian C. Keegan, and Joshua Clark. 2016. Ping to Win?: Non-Verbal Communication and Team Performance in Competitive Online Multiplayer Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). 4337--4350. http://dx.doi.org/10.1145/2858036.2858132  ",
      "doi": "10.1145/2858036.2858132"
    },
    {
      "text": "John C. Tang and Scott L. Minneman. 1991. Videodraw: a video interface for collaborative drawing. ACM Transactions on Information Systems 9, 2: 170-- 184. http://doi.org/10.1145/123078.128729  ",
      "doi": "10.1145/123078.128729"
    },
    {
      "text": "John C. Tang. Findings from observational studies of collaborative work. International Journal of Manmachine studies 34, 2 (1991): 143--160.  ",
      "doi": "10.1016/0020-7373%2891%2990039-A"
    },
    {
      "text": "Anthony Tang, Carman Newstaedter and Saul Greenberg. 2006. VideoArms: Embodiments for Mixed Presence Groupware. In Proceedings of the 20th British HCI Group Annual Conference (HCI 2006), 85102.",
      "doi": ""
    },
    {
      "text": "Zachary O. Toups, Jessica Hammer, William A. Hamilton, Ahmad Jarrah, William Graves, and Oliver Garretson. 2014. A framework for cooperative communication game mechanics from grounded theory. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY '14). ACM, NY, NY, USA, 257--266. http://dx.doi.org/10.1145/2658537.2658681  ",
      "doi": "10.1145/2658537.2658681"
    },
    {
      "text": "Deepika Vaddi, Zachary Toups, Igor Dolgov and Rina Wehbe and Lennart Nacke. 2016. Investigating the Impact of Cooperative Communication Mechanics on Player Performance in Portal 2. In Proceedings of Graphics Interface (GI 2016), 41--48. http://doi.org/10.20380/GI2016.06",
      "doi": ""
    },
    {
      "text": "Paul Ward and Eccles, (2006). A commentary on \"Team cognition and expert teams: Emerging insights into learning and performance for exceptional teams\". International Journal of Sport and Exercise Psychology 4: 463--483.",
      "doi": ""
    }
  ]
}