{
  "doi": "10.1145/3025453.3025875",
  "title": "Stories from Survivors: Privacy & Security Practices when Coping with Intimate Partner Abuse",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2189-2201",
  "year": 2017,
  "badges": [],
  "abstract": "We present a qualitative study of the digital privacy and security motivations, practices, and challenges of survivors of intimate partner abuse (IPA). This paper provides a framework for organizing survivors' technology practices and challenges into three phases: physical control, escape, and life apart. This three-phase framework combines technology practices with three phases of abuse to provide an empirically sound method for technology creators to consider how survivors of IPA can leverage new and existing technologies. Overall, our results suggest that the usability of and control over privacy and security functions should be or continue to be high priorities for technology creators seeking ways to better support survivors of IPA.",
  "authors": [
    {
      "name": "Tara Matthews",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Kathleen O'Leary",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556316956",
      "orcid": "missing"
    },
    {
      "name": "Anna Turner",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021717",
      "orcid": "missing"
    },
    {
      "name": "Manya Sleeper",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488672672",
      "orcid": "missing"
    },
    {
      "name": "Jill Palzkill Woelfer",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81435608664/rel-imgonly/resize_img_2697_fulbright1.jpg",
      "acmid": "81435608664",
      "orcid": "missing"
    },
    {
      "name": "Martin Shelton",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558085056",
      "orcid": "missing"
    },
    {
      "name": "Cori Manthorne",
      "institution": "Community Overcoming Relationship Abuse, San Mateo, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160198",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth F. Churchill",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81100143170/rel-imgonly/elizabethchurchill.jpeg",
      "acmid": "81100143170",
      "orcid": "missing"
    },
    {
      "name": "Sunny Consolvo",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459425",
      "orcid": "0000-0001-5337-328X"
    }
  ],
  "references": [
    {
      "text": "Devdatta Akhawe and Adrienne Porter Felt. 2013. Alice in warningland: A large-scale field study of browser security warning effectiveness. In Presented as part of the 22nd USENIX Security Symposium (USENIX Security 13), 257--272.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L. Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding Social Media Disclosures of Sexual Abuse Through the Lenses of Support Seeking and Anonymity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3906--3918. https://doi.org/10.1145/2858036.2858096",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Deborah K. Anderson and Daniel G. Saunders. 2003. Leaving An Abusive Partner An Empirical Review of Predictors, the Process of Leaving, and Psychological Well-Being. Trauma, Violence, & Abuse 4, 2: 163--191. https://doi.org/10.1177/1524838002250769 ",
      "doi": ""
    },
    {
      "text": "Paul M. Aoki and Allison Woodruff. 2005. Making space for stories: Ambiguity in the design of personal communication systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 181--190. https://doi.org/10.1145/1054972.1054998",
      "doi": "10.1145/1054972.1054998"
    },
    {
      "text": "Budi Arief, Kovila PL Coopamootoo, Martin Emms, and Aad van Moorsel. 2014. Sensible Privacy: How We Can Protect Domestic Violence Survivors Without Facilitating Misuse. In Proceedings of the 13th Workshop on Privacy in the Electronic Society, 201204. https://doi.org/10.1145/2665943.2665965",
      "doi": "10.1145/2665943.2665965"
    },
    {
      "text": "Matthew J. Breiding, Sharon G. Smith, Kathleen C. Basile, Mikel L. Walters, Jieru Chen, and Melissa T. Merrick. 2014. Prevalence and characteristics of sexual violence, stalking, and intimate partner violence victimization-National Intimate Partner and Sexual Violence Survey, USA, 2011. Morbidity and Mortality Weekly Report 63, 4: 1--18. https://doi.org/10.2105/AJPH.2015.302634",
      "doi": ""
    },
    {
      "text": "Jacquelyn C. Campbell, Daniel Webster, Jane KoziolMcLain, Carolyn Block, Doris Campbell, Mary Ann Curry, Faye Gary, Nancy Glass, Judith McFarlane, Carolyn Sachs, and others. 2003. Risk factors for femicide in abusive relationships: Results from a multisite case control study. American Journal of Public Health 93, 7: 1089--1097. https://doi.org/10.2105/AJPH.93.7.1089",
      "doi": ""
    },
    {
      "text": "Judy C. Chang, Diane Dado, Lynn Hawker, Patricia A. Cluss, Raquel Buranosky, Leslie Slagel, Melissa McNeil, and Sarah Hudson Scholle. 2010. Understanding turning points in intimate partner violence: Factors and circumstances leading women victims toward change. Journal of Women's Health 19, 2: 251--259. https://doi.org/10.1089/jwh.2009.1568 ",
      "doi": ""
    },
    {
      "text": "Jeremy Clark, P. C. van Oorschot, and Carlisle Adams. 2007. Usability of Anonymous Web Browsing: An Examination of Tor Interfaces and Deployability. In Proceedings of the 3rd Symposium on Usable Privacy and Security (SOUPS '07), 41--51. https://doi.org/10.1145/1280680.1280687",
      "doi": "10.1145/1280680.1280687"
    },
    {
      "text": "Rachel Clarke, Peter Wright, Madeline Balaam, and John McCarthy. 2013. Digital Portraits: Photo-sharing After Domestic Violence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2517--2526. https://doi.org/10.1145/2470654.2481348",
      "doi": "10.1145/2470654.2481348"
    },
    {
      "text": "Sunny Consolvo, Jaeyeon Jung, Ben Greenstein, Pauline Powledge, Gabriel Maganis, and Daniel Avrahami. 2010. The Wi-Fi privacy ticker: Improving awareness & control of personal information exposure on Wi-Fi. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (UBICOMP '10), 321--330. https://doi.org/10.1145/1864349.1864398",
      "doi": "10.1145/1864349.1864398"
    },
    {
      "text": "Lorrie Faith Cranor. 2008. A framework for reasoning about the human in the loop. In Proceedings of the 1st Conference on Usability, Psychology, and Security (UPSEC'08). 1--15.",
      "doi": "10.5555/1387649.1387650"
    },
    {
      "text": "Lorrie Faith Cranor. 2012. Necessary but not sufficient: Standardized mechanisms for privacy notice and choice. Journal on Telecommunications and High Technology Law 10, 2: 273--307.",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor and Simson Garfinkel. 2005. Security and usability: Designing secure systems that people can use. O'Reilly Media, Inc.",
      "doi": ""
    },
    {
      "text": "Sally A. Matar Curnow. 1997. The open window phase: Helpseeking and reality behaviors by battered women. Applied Nursing Research 10, 3: 128--135. https://doi.org/10.1016/S0897--1897(97)80215--7 ",
      "doi": ""
    },
    {
      "text": "Jill P. Dimond, Casey Fiesler, and Amy S. Bruckman. 2011. Domestic violence and information communication technologies. Interacting with Computers 23, 5: 413--421. https://doi.org/10.1016/j.intcom.2011.04.006  ",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Paul Dunphy, John Vines, Lizzie Coles-Kemp, Rachel Clarke, Vasilis Vlachokyriakos, Peter Wright, John McCarthy, and Patrick Olivier. 2014. Understanding the Experience-Centeredness of Privacy and Security Technologies. In Proceedings of the 2014 Workshop on New Security Paradigms Workshop (NSPW '14), 83--94. https://doi.org/10.1145/2683467.2683475",
      "doi": "10.1145/2683467.2683475"
    },
    {
      "text": "Mary Ellsberg and Lori Heise. 2002. Bearing witness: Ethics in domestic violence research. The Lancet 359, 9317: 1599--1604. https://doi.org/10.1016/S01406736(02)08521--5 ",
      "doi": ""
    },
    {
      "text": "Martin Emms, Budi Arief, and Aad van Moorsel. 2014. Electronic footprints in the sand: Technologies for assisting domestic violence survivors. In Privacy Technologies and Policy, 203--214.",
      "doi": ""
    },
    {
      "text": "Cynthia Fraser, Erica Olsen, Kaofeng Lee, Cindy Southworth, and Sarah Tucker. 2010. The new age of stalking: Technological implications for stalking. Juvenile and family court journal 61, 4: 39--55. https://doi.org/10.1111/j.1755--6988.2010.01051.x ",
      "doi": ""
    },
    {
      "text": "Jeffrey Hunker and Christian W. Probst. 2011. Insiders and Insider Threats. Journal of Wireless Mobile Networks, Ubiquitous Computing and Dependable Applications 2, 1: 4--27.",
      "doi": ""
    },
    {
      "text": "Giovanni Iachello and Jason Hong. 2007. End-user privacy in human-computer interaction. Foundations and Trends in Human-Computer Interaction 1, 1: 1137. https://doi.org/10.1561/1100000004",
      "doi": "10.1561/1100000004"
    },
    {
      "text": "Eric Jardine. 2015. The Dark Web Dilemma: Tor, Anonymity and Online Policing. Global Commission on Internet Governance Paper Series, No. 21. https://ssrn.com/abstract=2667711",
      "doi": ""
    },
    {
      "text": "Maritza Johnson, Serge Egelman, and Steven M. Bellovin. 2012. Facebook and privacy: It's complicated. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12), 9. https://doi.org/10.1145/2335356.2335369",
      "doi": "10.1145/2335356.2335369"
    },
    {
      "text": "Zayira Jordán Conde, William Eric Marsh, Andrew W. Luse, and Li-Shan Eva Tao. 2008. GuardDV: A proximity detection device for homeless survivors of domestic violence. In CHI'08 Extended Abstracts on Human Factors in Computing Systems, 3855--3860. https://doi.org/10.1145/1358628.1358943",
      "doi": "10.1145/1358628.1358943"
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My data just goes everywhere:\" User mental models of the internet and implications for privacy and security. In Eleventh Symposium On Usable Privacy and Security (SOUPS '15), 39--52.",
      "doi": ""
    },
    {
      "text": "Saranga Komanduri, Richard Shay, Patrick Gage Kelley, Michelle L. Mazurek, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, and Serge Egelman. 2011. Of passwords and people: Measuring the effect of password-composition policies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2595--2604. https://doi.org/10.1145/1978942.1979321",
      "doi": "10.1145/1978942.1979321"
    },
    {
      "text": "T. K. Logan and Robert Walker. 2009. Partner stalking: Psychological dominance or \"business as usual?\" Trauma Violence Abuse 10, 3. https://doi.org/10.1177/1524838009334461",
      "doi": ""
    },
    {
      "text": "Michael Massimi, Jill P. Dimond, and Christopher A. Le Dantec. 2012. Finding a new normal: The role of technology in life disruptions. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12), 719--728. https://doi.org/10.1145/2145204.2145314",
      "doi": "10.1145/2145204.2145314"
    },
    {
      "text": "Michelle L. Mazurek, J. P. Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, and others. 2010. Access control for home data sharing: Attitudes, needs and practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 645--654. https://doi.org/10.1145/1753326.1753421",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Judith McFarlane, Ann Malecha, Julia Gist, Kathy Watson, Elizabeth Batten, Iva Hall, and Sheila Smith. 2004. Increasing the safety-promoting behaviors of abused women. AJN The American Journal of Nursing 104, 3: 40--50. ",
      "doi": ""
    },
    {
      "text": "M. Merritt-Gray and J. Wuest. 1995. Counteracting abuse and breaking free: The process of leaving revealed through women's voices. Health Care for Women International 16, 5: 399--412. https://doi.org/10.1080/07399339509516194 ",
      "doi": ""
    },
    {
      "text": "Wendy Moncur. 2013. The Emotional Wellbeing of Researchers: Considerations for Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1883--1890. https://doi.org/10.1145/2470654.2466248",
      "doi": "10.1145/2470654.2466248"
    },
    {
      "text": "NNEDV. Power and Control Wheel. Retrieved September 17, 2016 from http://nnedv.org/resources/transitional-housing/139financial-empowerment-economic-justiceresources/3898-power-and-control-wheel.html",
      "doi": ""
    },
    {
      "text": "NNEDV. Tech Safety App. Retrieved September 17, 2016 from http://techsafetyapp.org/",
      "doi": ""
    },
    {
      "text": "Greg Norcie, Kelly Caine, and L. Jean Camp. 2012. Eliminating stop-points in the installation and use of anonymity systems: a usability evaluation of the tor browser bundle. In 5th Workshop on Hot Topics in Privacy Enhancing Technologies (HotPETS).",
      "doi": ""
    },
    {
      "text": "Shirley Patton. 2003. Pathways: How women leave violent men. Government of Tasmania. http://nla.gov.au/anbd.bib-an25304195",
      "doi": ""
    },
    {
      "text": "Martina Angela Sasse, Sacha Brostoff, and Dirk Weirich. 2001. Transforming the \"weakest link\"-a human/computer interaction approach to usable and effective security. BT Technology Journal 19, 3: 122131. https://doi.org/10.1023/A:1011902718709",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "Cindy Southworth, Shawndell Dawson, Cynthia Fraser, and Sarah Tucker. 2005. A high-tech twist on abuse: Technology, intimate partner stalking, and advocacy. Violence Against Women Online Resources. Retrieved January 3, 2017 from http://www.vawnet.org",
      "doi": ""
    },
    {
      "text": "Cynthia Southworth, Jerry Finn, Shawndell Dawson, Cynthia Fraser, and Sarah Tucker. 2007. Intimate partner violence, technology, and stalking. Violence Against Women 13, 8: 842--856. https://doi.org/10.1177/1077801207302045 ",
      "doi": ""
    },
    {
      "text": "David R. Thomas. 2006. A General Inductive Approach for Analyzing Qualitative Evaluation Data. American Journal of Evaluation 27, 2: 237--246. ",
      "doi": ""
    },
    {
      "text": "Lenore E. Walker. 1977. Battered women and learned helplessness. Victimology 2, 3--4: 525--534. https://www.ncjrs.gov/App/Publications/abstract.aspx?ID=46167",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2010. Folk models of home computer security. In Proceedings of the Sixth Symposium on Usable Privacy and Security (SOUPS '10). https://doi.org/10.1145/1837110.1837125",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "WHO, Department of Reproductive Health and Research, and London School of Hygiene and Tropical Medicine, South African Medical Research Council. 2013. Global and regional estimates of violence against women: Prevalence and health effects of intimate partner violence and non-partner sexual violence. World Health Organization. Retrieved from http://www.who.int/iris/handle/10665/85239",
      "doi": ""
    },
    {
      "text": "Delanie Woodlock. 2016. The abuse of technology in domestic violence and stalking. Violence Against Women. https://doi.org/10.1177/1077801216646277",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2002. World Report on Violence and Health. Edited by Etienne G. Krug, Linda L. Dahlberg, et al. http://www.who.int/violence_injury_prevention/violence/world_report/",
      "doi": ""
    },
    {
      "text": "J. Wuest and M. Merritt-Gray. 2001. Beyond survival: Reclaiming self after leaving an abusive male partner. The Canadian Journal of Nursing Research 32, 4: 7994.",
      "doi": ""
    },
    {
      "text": "Judith Wuest and Marilyn Merritt-Gray. 1999. Not Going Back: Sustaining the Separation in the Process of Leaving Abusive Relationships. Violence Against Women 5, 2: 110--133. ",
      "doi": ""
    },
    {
      "text": "Safe Chat Silicon Valley. Retrieved September 17, 2016 from http://safechatsv.com/about-us/",
      "doi": ""
    },
    {
      "text": "The National Domestic Violence Hotline: 50 Obstacles to Leaving: 1--10. Retrieved September 17, 2016 from http://www.thehotline.org/2013/06/50-obstacles-toleaving-1--10/",
      "doi": ""
    }
  ]
}