{
  "doi": "10.1145/3025453.3025826",
  "title": "Designing Leaderboards for Gamification: Perceived Differences Based on User Ranking, Application Domain, and Personality Traits",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1949-1960",
  "year": 2017,
  "badges": [],
  "abstract": "Leaderboards, a common gamification technique, are used to enhance engagement through social comparisons. Prior research has demonstrated the overall utility of leaderboards but has not examined their effectiveness when individuals are ranked at particular levels or when the technique is applied in different application domains, such as social networking, fitness, or productivity. In this paper, we present a survey study investigating how preferences for leaderboards change based on individual differences (personality traits), ranking, social scoping, and application domains. Our results show that a respondent's position on the leaderboard had important effects on their perception of the leaderboard and the surrounding app, and that participants rated leaderboards most favorably in fitness apps and least favorably in social networking contexts. More extraverted people reported more positive experiences with leaderboards despite their ranking or the application domain. We present design implications for creating leaderboards targeted at different domains and for different audiences.",
  "authors": [
    {
      "name": "Yuan Jia",
      "institution": "Indiana University at Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550647956",
      "orcid": "missing"
    },
    {
      "name": "Yikun Liu",
      "institution": "Indiana University at Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484647158",
      "orcid": "missing"
    },
    {
      "name": "Xing Yu",
      "institution": "Indiana University at Indianapolis, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659048756",
      "orcid": "missing"
    },
    {
      "name": "Stephen Voida",
      "institution": "University of Colorado, Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81100147302/rel-imgonly/steve_-_interactions__cropped_close_.png",
      "acmid": "81100147302",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ian Anderson, Julie Maitland, Scott Sherwood, Louise Barkhuus, Matthew Chalmers, Malcolm Hall, Barry Brown, and Henk Muller. 2007. Shakra: Tracking and sharing daily activity levels with unaugmented mobile phones. Mobile Networks and Applications 12, 2--3: 185--199.",
      "doi": "10.1007/s11036-007-0011-7"
    },
    {
      "text": "Isabel Anger and Christian Kittl. 2011. Measuring influence on Twitter. In Proceedings of the 11th International Conference on Knowledge Management and Knowledge Technologies, 31.  ",
      "doi": "10.1145/2024288.2024326"
    },
    {
      "text": "Sonia M. Arteaga, Mo Kudeki, and Adrienne Woodworth. 2009. Combating obesity trends in teenagers through persuasive mobile technology. SIGACCESS Accessibility and Computing 94: 17--25. http://doi.acm.org/10.1145/1595061.1595064",
      "doi": "10.1145/1595061.1595064"
    },
    {
      "text": "Charles Butler. 2013. The effect of leaderboard ranking on players' perception of gaming fun. In International Conference on Online Communities and Social Computing, 129--136.  ",
      "doi": "10.1007/978-3-642-39371-6_15"
    },
    {
      "text": "David Codish and Gilad Ravid. 2014. Personality based gamification-educational gamification for extroverts and introverts. In Proceedings of the 9th CHAIS Conference for the Study of Innovation and Learning Technologies: Learning in the Technological Era, 36--44.",
      "doi": ""
    },
    {
      "text": "João P. Costa, Rina R. Wehbe, James Robb, and Lennart E. Nacke. 2013. Time's up: Studying leaderboards for engaging punctual behaviour. In Proceedings of the First International Conference on Gameful Design, Research, and Applications, 26-- 33.  ",
      "doi": "10.1145/2583008.2583012"
    },
    {
      "text": "Paul T. Costa, Jr. and Robert R. McCrae. 1992. NEO Personality Inventory--Revised (NEO-PI-R) and NEO Five-Factor Inventory (NEO-FFI) Professional Manual. Psychological Assessment Resources, Odessa, FL.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: Defining \"gamification\". In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments, 915. http://doi.acm.org/10.1145/2181037.2181040",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Rosta Farzan, Joan M. DiMicco, David R. Millen, Casey Dugan, Werner Geyer, and Elizabeth A. Brownholtz. 2008. Results from deploying a participation incentive mechanism within the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 563--572.  ",
      "doi": "10.1145/1357054.1357145"
    },
    {
      "text": "Samuel D. Gosling, Peter J. Rentfrow, and William B. Swann. 2003. A very brief measure of the Big-Five personality domains. Journal of Research in personality 37, 6: 504--528. ",
      "doi": ""
    },
    {
      "text": "Juho Hamari and Jonna Koivisto. 2015 \"Working out for likes\": An empirical study on social influence in exercise gamification. Computers in Human Behavior 50: 333--347.  ",
      "doi": "10.1016/j.chb.2015.04.018"
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does gamification work?: A literature review of empirical studies on gamification. In Proceedings of the 47th Hawaii International Conference on System Sciences (HICSS '14), 3025--3034.  ",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Juho Hamari. 2013. Transforming homo economicus into homo ludens: A field experiment on gamification in a utilitarian peer-to-peer trading service. Electronic Commerce Research and Applications 12, 4: 236--245. ",
      "doi": ""
    },
    {
      "text": "Victoria Husted Medvec, Scott F. Madey and Thomas Gilovich. 1995. When less is more: Counterfactual thinking and satisfaction among Olympic medalists. Journal of Personality and Social Psychology 69, 4, 603.",
      "doi": ""
    },
    {
      "text": "Maurits Kaptein and Dean Eckles. 2012. Heterogeneity in the effects of online persuasion. Journal of Interactive Marketing 26, 3: 176--188. ",
      "doi": ""
    },
    {
      "text": "Yuan Jia, Bin Xu, Yamini Karanam, and Stephen Voida. 2016. Personality-targeted gamification: A survey study on personality traits and motivational affordances. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2001--2013.  ",
      "doi": "10.1145/2858036.2858515"
    },
    {
      "text": "Oliver P. John, Laura P. Naumann, and Christopher J. Soto. 2008. Paradigm shift to the integrative Big Five trait taxonomy: History, measurement, and conceptual issues. In Handbook of Personality: Theory and Research (3rd ed.), Oliver P. John, Richard W. Robbins, and Lawrence A. Pervin (eds.). Guilford Press, NY, NY, 114--158.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Florian Brühlmann, Klaus Opwis, and Alexandre N. Tuch. 2013. Do points, levels and leaderboards harm intrinsic motivation?: An empirical analysis of common gamification elements. In Proceedings of the First International Conference on Gameful Design, Research, and Applications, 66-- 73.  ",
      "doi": "10.1145/2583008.2583017"
    },
    {
      "text": "Robert R. McCrae, and Paul T. Costa. 1989. Reinterpreting the Myers-Briggs type indicator from the perspective of the Five Factor model of personality. Journal of Personality 57, 1: 17--40. ",
      "doi": ""
    },
    {
      "text": "Rudy McDaniel, Robb Lindgren, and Jon Friskics. 2012. Using badges for shaping interactions in online learning environments. In Proceeding of IEEE International Professional Communication Conference, 1--4. ",
      "doi": ""
    },
    {
      "text": "Ethan R. Mollick and Nancy Rothbard. 2014. Mandatory fun: Consent, gamification and the impact of games at work. The Wharton School research paper series.",
      "doi": ""
    },
    {
      "text": "Mark J. Nelson. 2012. Soviet and American precursors to the gamification of work. In Proceedings of the 16th International Academic MindTrek Conference, 23--26.  ",
      "doi": "10.1145/2393132.2393138"
    },
    {
      "text": "Oded Nov and Ofer Arazy. 2013. Personality-targeted design: Theory, experimental procedure, and preliminary results. In Proceedings of the 2013 ACM Conference on Computer Supported Cooperative Work (CSCW '13), 977--984. http://doi.acm.org/10.1145/2441776.2441887",
      "doi": "10.1145/2441776.2441887"
    },
    {
      "text": "Jon Radoff. 2011. Game on: Energize your business with social media games. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Byron Reeves and J. Leighton Read. 2009. Total engagement: Using games and virtual worlds to change the way people work and businesses compete. Harvard Business School Press, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Katie Seaborn and Deborah I. Fels. 2015. Gamification in theory and action: A survey. International Journal of Human-Computer Studies 74, 14--31.  ",
      "doi": "10.1016/j.ijhcs.2014.09.006"
    },
    {
      "text": "Emily Sun, Brooke Jones, Stefano Traca, and Maarten W. Bos. 2015. Leaderboard position psychology: counterfactual thinking. In Extended Abstracts of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1217--1222.  ",
      "doi": "10.1145/2702613.2732732"
    },
    {
      "text": "Kevin Werbach and Dan Hunter. 2012. For the win: How game thinking can revolutionize your business. Wharton Digital Press.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Cliff Lampe, Rick Wash, Nicole Ellison, and Jessica Vitak. 2011. The \"s\" in social network games: Initiating, maintaining, and enhancing relationships. In Proceedings of the 44th Hawaii International Conference on System Sciences (HICSS 2011), 1--10.  ",
      "doi": "10.1109/HICSS.2011.400"
    },
    {
      "text": "Clara Choi-Ki Wong and Ron Chi-Wai Kwok. 2016. The effect of gamified mHealth app on exercise motivation and physical activity. In Proceedings of Pacific Asia Conference on Information Systems (PACIS), 389.",
      "doi": ""
    },
    {
      "text": "Gabe Zichermann and Christopher Cunningham. 2011. Gamification by design: Implementing game mechanics in web and mobile apps. O'Reilly Media.",
      "doi": "10.5555/2073550"
    }
  ]
}