{
  "doi": "10.1145/3025453.3025563",
  "title": "Don't Talk Dirty to Me: How Sexist Beliefs Affect Experience in Sexist Games",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1530-1543",
  "year": 2017,
  "badges": [],
  "abstract": "Research on sexism in digital games has suggested that women self-select out of playing sexist games; however, assuming a homogenous gender-based response does not account for the diversity of identities within a gender group. Gender-incongruent responses to recent events like #gamergate implies that the gender of the participant is not paramount to experience, but that their beliefs about gender roles are. To explore the role of sexist beliefs on experience in sexist games, we created three versions of a game that were identical except for the presence of sexist imagery and/or dialogue. We show that enjoyment of sexist games is not predicted by player gender, but by the player's pre-existing beliefs about gender. Furthermore, avatar identification is the pathway through which enjoyment is facilitated. Finally, sexist dialogue does not improve the play experience for anyone rather it harms experience for players of all genders who do not hold sexist beliefs.",
  "authors": [
    {
      "name": "Jason T. Bowey",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658746848",
      "orcid": "missing"
    },
    {
      "name": "Ansgar E. Depping",
      "institution": "University of Sakatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022433",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elizabeth Behm-Morawitz and Dana Mastro. 2009. The Effects of the Sexualization of Female Video Game Characters on Gender Stereotyping and Female Self-Concept. Sex Roles 61, 11-12: 808--823. http://doi.org/10.1007/s11199-009-9683-8",
      "doi": ""
    },
    {
      "text": "Helena Bilandzic and Rick W. Busselle. 2008. Transportation and Transportability in the Cultivation of Genre-Consistent Attitudes and Estimates. Journal of Communication 58, 3: 508--529. http://doi.org/10.1111/j.1460-2466.2008.00397.x ",
      "doi": ""
    },
    {
      "text": "Helena Bilandzic and Rick W. Busselle. 2011. Enjoyment of films as a function of narrative experience, perceived realism and transportability. Communications 36, 1. http://doi.org/10.1515/comm.2011.002 ",
      "doi": ""
    },
    {
      "text": "Max Birk and Regan L. Mandryk. 2013. Control your game-self. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. http://doi.org/10.1145/2470654.2470752  ",
      "doi": "10.1145/2470654.2470752"
    },
    {
      "text": "Max V. Birk, Dereck Toker, Regan L. Mandryk, and Cristina Conati. 2015. Modeling Motivation in a Social Network Game Using Player-Centric Traits and Personality Traits. Lecture Notes in Computer Science User Modeling, Adaptation and Personalization: 18- 30. http://doi.org/10.1007/978-3-319-20267-9_2",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Cheralyn Atkins, Jason T. Bowey, and Regan L. Mandryk. 2016. Fostering Intrinsic Motivation through Avatar Identification in Digital Games. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16. http://doi.org/10.1145/2858036.2858062  ",
      "doi": "10.1145/2858036.2858062"
    },
    {
      "text": "Kathleen M. Blee and Mary R. Jackman. 1994. The Velvet Glove: Paternalism and Conflict in Gender, Class, and Race Relations. Contemporary Sociology 23, 6: 792. http://doi.org/10.2307/2076034",
      "doi": ""
    },
    {
      "text": "Blog death threats spark debate. Retrieved December 21, 2016 from http://news.bbc.co.uk/2/hi/technology/6499095.stm",
      "doi": ""
    },
    {
      "text": "Janet Bloomfield. 2015. #GamerGate is fundamentally a fight for men, for masculinity and for male spaces. judgybitch. Retrieved from http://judgybitch.com/2015/09/16/gamergate-is-fundamentally-a-fight-for-men-for-masculinity-and-for-male-spaces/",
      "doi": ""
    },
    {
      "text": "Jason T. Bowey, Max V. Birk, and Regan L. Mandryk. 2015. Manipulating Leaderboards to Induce Player Experience. Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play CHI PLAY '15. http://doi.org/10.1145/2793107.2793138  ",
      "doi": "10.1145/2793107.2793138"
    },
    {
      "text": "Melinda C. R. Burgess, Steven Paul Stermer, and Stephen R. Burgess. 2007. Sex, Lies, and Video Games: The Portrayal of Male and Female Characters on Video Game Covers. Sex Roles 57, 5-6: 419--433. http://doi.org/10.1007/s11199-007-9250-0",
      "doi": ""
    },
    {
      "text": "Judith Butler. 1990. Gender trouble: feminism and the subversion of identity. Routledge, NY.",
      "doi": ""
    },
    {
      "text": "Justine Cassell and Henry Jenkins. 1998. Chess for girls? Feminism and computer games, From Barbie to Mortal Kombat: gender and computer games.",
      "doi": ""
    },
    {
      "text": "Justine Cassell and Henry Jenkins. 1998. From Barbie to Mortal Kombat: gender and computer games. MIT Press, Cambridge, MA.",
      "doi": "10.5555/295056.295058"
    },
    {
      "text": "CD Projekt RED. 2007. The Witcher. Game [Microsoft Windows, Mac OS]. (26 October 2007). Atari.",
      "doi": ""
    },
    {
      "text": "Shira Chess and Adrienne Shaw. 2015. A Conspiracy of Fishes, or, How We Learned to Stop Worrying About #GamerGate and Embrace Hegemonic Masculinity. Journal of Broadcasting & Electronic Media 59, 1: 208--220. http://doi.org/10.1080/08838151.2014.999917 ",
      "doi": ""
    },
    {
      "text": "Katheryn R. Christy and Jesse Fox. 2016. Transportability and Presence as Predictors of Avatar Identification Within Narrative Video Games. Cyberpsychology, Behavior, and Social Networking 19, 4: 283--287. http://doi.org/10.1089/cyber.2015.0474 ",
      "doi": ""
    },
    {
      "text": "Jonathan Cohen. 2001. Defining Identification: A Theoretical Look at the Identification of Audiences With Media Characters. Mass Communication and Society 4, 3: 245--264. http://doi.org/10.1207/s15327825mcs0403_01 ",
      "doi": ""
    },
    {
      "text": "Core Design. 1996. Tomb Raider. Game[Sega Saturn, PlayStation, MS-DOS]. (25 October 1996). Edits Interactive.",
      "doi": ""
    },
    {
      "text": "Sonya. Dal Cin, Mark P. Zanna, Geoffrey. T. Fong. Narrative persuasion and overcoming resistance. Resistance and persuasion. http://doi.org/10.1037/e633872013-232",
      "doi": ""
    },
    {
      "text": "Suzanne De Castell and Mary Bryson. 1998. Retooling play: Dystopia, dysphoria, and difference. From Barbie to Mortal Kombat: gender and computer games: 232--261.",
      "doi": ""
    },
    {
      "text": "Karen E. Dill, Brian P. Brown, and Michael A. Collins. 2008. Effects of exposure to sex-stereotyped video game characters on tolerance of sexual harassment. Journal of Experimental Social Psychology 44, 5: 1402--1408. http://doi.org/10.1016/j.jesp.2008.06.002 ",
      "doi": ""
    },
    {
      "text": "Edward Downs and Stacy L. Smith. 2009. Keeping Abreast of Hypersexuality: A Video Game Character Content Analysis. Sex Roles 62, 11-12: 721--733. http://doi.org/10.1007/s11199-009-9637-1",
      "doi": ""
    },
    {
      "text": "Christopher Dring. 2015. More money is spent on games than movies and music combined, says IHS. The Market for Computer and Video Games. Retrieved from http://www.mcvuk.com/news/read/more-money-is-spent-on-games-than-movies-and-music-combined-says-ihs/0151059",
      "doi": ""
    },
    {
      "text": "Epic Games. 2006. Gears of War. Game [Xbox 360, Microsoft Windows]. (7 November 2006). Microsoft Game Studios.",
      "doi": ""
    },
    {
      "text": "O. E. Favreau. 1997. Sex and Gender Comparisons: Does Null Hypothesis Testing Create a False Dichotomy? Feminism & Psychology 7, 1: 63--81. http://doi.org/10.1177/0959353597071010 ",
      "doi": ""
    },
    {
      "text": "J. Fox, R. A. Ralston, C. K. Cooper, and K. A. Jones. 2014. Sexualized Avatars Lead to Women's Self-Objectification and Acceptance of Rape Myths. Psychology of Women Quarterly 39, 3: 349--362. http://doi.org/10.1177/0361684314553578 ",
      "doi": ""
    },
    {
      "text": "Jesse Fox, Jeremy N. Bailenson, and Liz Tricase. 2013. The embodiment of sexualized virtual selves: The Proteus effect and experiences of self-objectification via avatars. Computers in Human Behavior 29, 3: 930--938. http://doi.org/10.1016/j.chb.2012.12.027  ",
      "doi": "10.1016/j.chb.2012.12.027"
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2014. Sexism in online video games: The role of conformity to masculine norms and social dominance orientation. Computers in Human Behavior 33: 314--320. http://doi.org/10.1016/j.chb.2013.07.014  ",
      "doi": "10.1016/j.chb.2013.07.014"
    },
    {
      "text": "Tracy Fullerton. 2014. Game design workshop: a playcentric approach to creating innovative games.",
      "doi": ""
    },
    {
      "text": "Gearbox Software. 2011. Duke Nukem Forever. Game [Microsoft Windows, Mac OS X, PlayStation 3, Xbox 360]. (10 Jun 2011). 2K Games.",
      "doi": ""
    },
    {
      "text": "Kathrin Maria Gerling, Matthew Miller, Regan L. Mandryk, Max Valentin Birk, and Jan David Smeddinck. 2014. Effects of balancing for physical abilities on player performance, experience and self-esteem in exergames. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14. http://doi.org/10.1145/2556288.2556963  ",
      "doi": "10.1145/2556288.2556963"
    },
    {
      "text": "Richard J. Gerrig. 1993. Experiencing narrative worlds: on the psychological activities of reading. Yale University Press, New Haven.",
      "doi": ""
    },
    {
      "text": "Peter Glick and Susan T. Fiske. 1996. The Ambivalent Sexism Inventory: Differentiating hostile and benevolent sexism. Journal of Personality and Social Psychology 70, 3: 491--512. http://doi.org/10.1037/0022-3514.70.3.491 ",
      "doi": ""
    },
    {
      "text": "Joanna Goode, Rachel Estrella, Jane Margolis. 2006. Lost in translation: gender and high school computer science. Women and Information Technology: Research on Underrepresentation, eds J. M. Cohoon & W. Aspray, MIT Press, Cambridge, MA, pp. 89--114. ",
      "doi": ""
    },
    {
      "text": "K. L. Gray. 2012. Deviant bodies, stigmatized identities, and racist acts: examining the experiences of African-American gamers in Xbox Live. New Review of Hypermedia and Multimedia 18, 4: 261--276. http://doi.org/10.1080/13614568.2012.746740  ",
      "doi": "10.1080/13614568.2012.746740"
    },
    {
      "text": "Melanie C. Green and Timothy C. Brock. 2000. The role of transportation in the persuasiveness of public narratives. Journal of Personality and Social Psychology 79, 5: 701--721. http://doi.org/10.1037/0022-3514.79.5.701",
      "doi": ""
    },
    {
      "text": "Melanie C. Green and Timothy C. Brock. 2000. The role of transportation in the persuasiveness of public narratives. Journal of Personality and Social Psychology 79, 5: 701--721. http://doi.org/10.1037/0022-3514.79.5.701 ",
      "doi": ""
    },
    {
      "text": "Melanie C. Green, Timothy C. Brock, and Geoff F. Kaufman. 2004. Understanding Media Enjoyment: The Role of Transportation Into Narrative Worlds. Commun Theory Communication Theory 14, 4: 311--327. http://doi.org/10.1111/j.1468-2885.2004.tb00317.x ",
      "doi": ""
    },
    {
      "text": "Tilo Hartmann and Christoph Klimmt. 2006. Gender and Computer Games: Exploring Females' Dislikes. Journal of Computer-Mediated Communication J Comp Mediated Comm 11, 4: 910--931. http://doi.org/10.1111/j.1083-6101.2006.00301.x ",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes. 2013. Introduction to mediation, moderation, and conditional process analysis: a regression-based approach. The Guilford Press, NY.",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes. 2012. PROCESS: A versatile computational tool for observed variable mediation, moderation, and conditional process modelling. Retrieved from http://www.afhayes.com/public/process2012.pdf",
      "doi": ""
    },
    {
      "text": "Dorothée Hefner, Christoph Klimmt, and Peter Vorderer. Identification with the Player Character as Determinant of Video Game Enjoyment. Entertainment Computing - ICEC 2007 Lecture Notes in Computer Science: 39--48. http://doi.org/10.1007/978-3-54074873-1_6",
      "doi": ""
    },
    {
      "text": "IO Interactive. 2012. Hitman: Absolution. Game [PlayStation 3, Xbox 360, Microsoft Windows, Mac OS] .(20 November 2012). Square Enix.",
      "doi": ""
    },
    {
      "text": "James D. Ivory. 2006. Still a Man's Game: Gender Representation in Online Reviews of Video Games. Mass Communication and Society 9, 1: 103--114. http://doi.org/10.1207/s15327825mcs0901_6 ",
      "doi": ""
    },
    {
      "text": "J. Jansz. 2005. The Emotional Appeal of Violent Video Games for Adolescent Males. Communication Theory 15, 3: 219--241. http://doi.org/10.1093/ct/15.3.219 ",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Anna L. Cox, Paul Cairns, et al. 2008. Measuring and defining the experience of immersion in games. International Journal of HumanComputer Studies 66, 9: 641--661. http://doi.org/10.1016/j.ijhcs.2008.04.004  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Jennifer Jenson and Suzanne de Castell. 2011. Girls@ Play. Feminist Media Studies 11, 2: 167--179. http://doi.org/10.1080/14680777.2010.521625 ",
      "doi": ""
    },
    {
      "text": "Jennifer Jenson and Suzanne de Castell. 2008. Theorizing gender and digital gameplay: Oversights, accidents and surprises. Eludamos: Journal for Computer Game Culture 2, 1: 15--25.",
      "doi": ""
    },
    {
      "text": "Daniel Johnson and John Gardner. 2010. Personality, motivation and video games. Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on ComputerHuman Interaction - OZCHI '10. http://doi.org/10.1145/1952222.1952281  ",
      "doi": "10.1145/1952222.1952281"
    },
    {
      "text": "Kamala O. Norris. 2004. Gender Stereotypes, Aggression, and Computer Games: An Online Survey of Women. CyberPsychology & Behavior 7, 6: 714727. Web. http://doi.org/10.1089/cpb.2004.7.714",
      "doi": ""
    },
    {
      "text": "Herbert C. Kelman. 1961. Processes of Opinion Change. Public Opinion Quarterly 25, 1: 57. http://doi.org/10.1086/266996",
      "doi": ""
    },
    {
      "text": "Marleen J. E. Klaassen and Jochen Peter. 2014. Gender (In)equality in Internet Pornography: A Content Analysis of Popular Pornographic Internet Videos. The Journal of Sex Research 52, 7: 721--735. http://doi.org/10.1080/00224499.2014.976781 ",
      "doi": ""
    },
    {
      "text": "L. Kruse, E. Weimer, and F. Wagner. 1988. What Men and Women are Said to Be: Social Representation and Language. Journal of Language and Social Psychology 7, 3-4: 243--262. http://doi.org/10.1177/0261927x8800700407",
      "doi": ""
    },
    {
      "text": "Lionhead Studios. 2008. Fable II. Game [Xbox 360, Xbox One]. (21 October 2008). Microsoft Game Studios.",
      "doi": ""
    },
    {
      "text": "Matthew Lombard, Robert D. Reich, Maria E. Grabe, Cheryl C. Bracken, and Theresa B. Ditton. \"Presence and television.\" Human Communication Research 26, no. 1 (2000): 75--98. ",
      "doi": ""
    },
    {
      "text": "Jan Van Looy, Cédric Courtois, Melanie De Vocht, and Lieven De Marez. 2012. Player Identification in Online Games: Validation of a Scale for Measuring Identification in MMOGs. Media Psychology 15, 2: 197--221. http://doi.org/10.1080/15213269.2012.674917 ",
      "doi": ""
    },
    {
      "text": "C. Neil. Macrae, Charles Stangor, and Miles Hewstone. 1996. Language and stereotyping. In Stereotypes and stereotyping. Guilford Press, NY.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2011. Conducting behavioral research on Amazon's Mechanical Turk. Behav Res Behavior Research Methods 44, 1: 1--23. http://doi.org/10.3758/s13428-011-0124-6 ",
      "doi": ""
    },
    {
      "text": "Edward Mcauley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1: 48--58. http://doi.org/10.1080/02701367.1989.10607413 ",
      "doi": ""
    },
    {
      "text": "A. R. Mcconnell and R. H. Fazio. 1996. Women as Men and People: Effects of Gender-Marked Language. Personality and Social Psychology Bulletin 22, 10: 1004--1013. http://doi.org/10.1177/01461672962210003 ",
      "doi": ""
    },
    {
      "text": "Adam W. Meade and S. Bartholomew Craig. 2012. Identifying careless responses in survey data. Psychological Methods 17, 3: 437--455. http://doi.org/10.1037/a0028085 ",
      "doi": ""
    },
    {
      "text": "O. Moore. 2012. Woman's Call to End Video Game Misogyny Sparks Vicious Online Attacks. The Globe and Mail.",
      "doi": ""
    },
    {
      "text": "David Morley. 1992. Television, audiences, and cultural studies. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Newzoo. Global Games Market Will Reach $102.9 Billion in 2017. Retrieved from: http://www.newzoo.com/insights/global-gamesmarket-will-reach-102-9-billion-2017-2/",
      "doi": ""
    },
    {
      "text": "Nintendo. 1985. Super Mario Bros. Game [NES]. (13 September 1985). Nintendo.",
      "doi": ""
    },
    {
      "text": "Nintendo Entertainment Analysis & Development. 2006. The Legend of Zelda: Twilight Princess. Game [Wii, GameCube]. (19 November 2006). Nintendo.",
      "doi": ""
    },
    {
      "text": "Martha C. Nussbaum. 1995. Objectification. Philosophy Public Affairs Philosophy & Public Affairs 24, 4: 249--291. http://doi.org/10.1111/j.10884963.1995.tb00032.x",
      "doi": ""
    },
    {
      "text": "Susan P. Phillips. 2005. Defining and measuring gender: A social determinant of health whose time has come. International Journal for Equity in Health. ",
      "doi": ""
    },
    {
      "text": "Platinum Games. 2009. Bayonetta. Game [PlayStation 3, Xbox 360]. (29 October 2009). Nintendo.",
      "doi": ""
    },
    {
      "text": "Joseph H. Pleck, Freya L. Sonenstein, and Leighton C. Ku. 1994. Attitudes toward male roles among adolescent males: A discriminant validity analysis. Sex Roles 30, 7-8: 481--501. http://doi.org/10.1007/bf01420798",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, Netta Weinstein, Richard M. Ryan, and C. Scott Rigby. 2009. Having to versus Wanting to Play: Background and Consequences of Harmonious versus Obsessive Engagement in Video Games. CyberPsychology & Behavior 12, 5: 485--492. http://doi.org/10.1089/cpb.2009.0083 ",
      "doi": ""
    },
    {
      "text": "Sheri Graner Ray. 2004. Gender inclusive game design: expanding the market. Charles River Media, Hingham, MA.",
      "doi": ""
    },
    {
      "text": "Eva A. Van Reijmersdal, Jeroen Jansz, Oscar Peters, and Guda Van Noort. 2013. Why girls go pink: Game character identification and game-players' motivations. Computers in Human Behavior 29, 6: 2640--2649. http://doi.org/10.1016/j.chb.2013.06.046  ",
      "doi": "10.1016/j.chb.2013.06.046"
    },
    {
      "text": "Cecilia L. Ridgeway. 1992. Gender, interaction, and inequality. Springer-Verlag, NY. ",
      "doi": ""
    },
    {
      "text": "Rockstar North. 2013. Grand Theft Auto V. Game [PlayStation 4, PlayStation 3, Xbox One, Xbox 360, Microsoft Windows]. (17 September 2013). Rockstar Games.",
      "doi": ""
    },
    {
      "text": "Rockstar San Diego. 2010. Red Dead Redemption. Game [PlayStation 3, Xbox 360]. (18 May 2010). Rockstar Games.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Intrinsic and Extrinsic Motivations: Classic Definitions and New Directions. Contemporary Educational Psychology 25, 1: 54--67. http://doi.org/10.1006/ceps.1999.1020 ",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55, 1: 68--78. http://doi.org/10.1037/0003-066x.55.1.68 ",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion Motiv Emot 30, 4: 344--360. http://doi.org/10.1007/s11031-006-9051-8 ",
      "doi": ""
    },
    {
      "text": "Anastasia Salter and Bridget Blodgett. 2012. Hypermasculinity & Dickwolves: The Contentious Role of Women in the New Gaming Public. Journal of Broadcasting & Electronic Media 56, 3: 401-416. http://doi.org/10.1080/08838151.2012.705199 ",
      "doi": ""
    },
    {
      "text": "Santa Monica Studio. 2005. God of War. Game [PlayStation 3, PlayStation 2, PlayStation Vita]. (22 March 2005). Sony Computer Entertainment.",
      "doi": ""
    },
    {
      "text": "Anita Sarkeesian. 2011. Tropes vs. Women:#2 Women in Refrigerators. Feminist Frequency. Retrieved from https://feministfrequency.com/video/tropes-vs-women-2-women-in-refrigerators/",
      "doi": ""
    },
    {
      "text": "Anita Sarkeesian. 2014. Women as Background Decoration (Part 1). Feminist Frequency. Retrieved from https://feministfrequency.com/video/women-as-background-decoration-tropes-vs-women/",
      "doi": ""
    },
    {
      "text": "P. Skalski, R. Tamborini, A. Shelton, M. Buncher, and P. Lindmark. 2010. Mapping the road to fun: Natural video game controllers, presence, and game enjoyment. New Media & Society 13, 2: 224--242. http://doi.org/10.1177/1461444810370949 ",
      "doi": ""
    },
    {
      "text": "Christina Hoff Sommers. 2014. What critics of GamerGate get wrong. Youtube. Retrieved from https://www.youtube.com/watch?v=5rvlcvbd21w",
      "doi": ""
    },
    {
      "text": "Christina Hoff Sommers. 2015. The war on gamers continues. Youtube. Retrieved from https://www.youtube.com/watch?v=ymw39mekmzy",
      "doi": ""
    },
    {
      "text": "Spence, J. T., & Helmreich, R. L. (1978). Masculinity and femininity: their psychological dimensions, correlates, and antecedents. Austin, TX: University of Texas Press.",
      "doi": ""
    },
    {
      "text": "Janet K. Swim, Robyn Mallett, and Charles Stangor. 2004. Understanding Subtle Sexism: Detection and Use of Sexist Language. Sex Roles 51, 3/4: 117--128. http://doi.org/10.1023/b:sers.0000037757.73192.06 ",
      "doi": ""
    },
    {
      "text": "Ron Tamborini, Nicholas David Bowman, Allison Eden, Matthew Grizzard, and Ashley Organ. 2010. Defining Media Enjoyment as the Satisfaction of Intrinsic Needs. Journal of Communication 60, 4: 758--777. http://doi.org/10.1111/j.1460-2466.2010.01513.x ",
      "doi": ""
    },
    {
      "text": "Team Ninja. 2003. Dead or Alive Xtreme Beach Volleyball. Game [Xbox]. (22 January 2003). Tecmo.",
      "doi": ""
    },
    {
      "text": "2014. Thoughts on #GamerGate | Game/Show | PBS Digital Studios. Youtube. Retrieved from https://www.youtube.com/watch?v=ezrt-qvz04",
      "doi": ""
    },
    {
      "text": "Diane Watson, Mark Hancock, Regan L. Mandryk, and Max Birk. 2013. Deconstructing the touch experience. Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces - ITS '13. http://doi.org/10.1145/2512349.2512819  ",
      "doi": "10.1145/2512349.2512819"
    },
    {
      "text": "D. Williams, N. Martins, M. Consalvo, and J. D. Ivory. 2009. The virtual census: representations of gender, race and age in video games. New Media & Society 11, 5: 815--834. http://doi.org/10.1177/1461444809105354 ",
      "doi": ""
    },
    {
      "text": "Brianna Wu. No skin thick enough: The daily harassment of women in the game industry. Retrieved December 22, 2016 from http://www.polygon.com/2014/7/22/5926193/womengaming-harassment",
      "doi": ""
    },
    {
      "text": "Mike Z. Yao, Chad Mahood, and Daniel Linz. 2009. Sexual Priming, Gender Stereotyping, and Likelihood to Sexually Harass: Examining the Cognitive Effects of Playing a Sexually-Explicit Video Game. Sex Roles 62, 1-2: 77--88. http://doi.org/10.1007/s11199-009-9695-4",
      "doi": ""
    },
    {
      "text": "Nick Yee, Nicolas Ducheneaut, Han-Tai Shiao, and Les Nelson. 2012. Through the azerothian looking glass. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12. http://doi.org/10.1145/2207676.2208683  ",
      "doi": "10.1145/2207676.2208683"
    },
    {
      "text": "Andreas Zecher. 2014. Open letter to the gaming community. Medium. Retrieved from https://medium.com/@andreaszecher/open-letter-to-the-gaming-community-df4511032e8a#.f1heon42t",
      "doi": ""
    }
  ]
}