{
  "doi": "10.1145/3025453.3025617",
  "title": "Locked or Not?: Mental Models of IoT Feature Interaction",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2993-2997",
  "year": 2017,
  "badges": [],
  "abstract": "Internet of Things (IoT) frequently involves conflicting interactions between devices and features that must be resolved to a single system state. The problem of feature interaction (FI) resolution has been investigated in Software Engineering through approaches that focus on verifiability but usually do not include the user in the evaluation. This paper bridges the gap between IoT approaches in HCI and Software Engineering by applying qualitative methods to understanding users' mental models of one representative FI resolution mechanism. Our contributions are in identifying common mental model errors and biases and how these may inform future IoT systems and research.",
  "tags": [
    "mental models",
    "iot",
    "feature interaction",
    "home automation"
  ],
  "authors": [
    {
      "name": "Svetlana Yarosh",
      "institution": "University of Minnesota, Twin Cities, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81350580946/rel-imgonly/goldyandlana.jpg",
      "acmid": "81350580946",
      "orcid": "0000-0001-8389-2064"
    },
    {
      "name": "Pamela Zave",
      "institution": "AT&T Labs Research, Bedminster, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100039133",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. J. Bernheim Brush, Jaeyeon Jung, Ratul Mahajan, and James Scott. 2012. HomeLab: Shared Infrastructure for Home Technology Field Studies. In Proc. of Ubicomp, 1108--1113.",
      "doi": ""
    },
    {
      "text": "A J Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home Automation in the Wild: Challenges and Opportunities. In Proc. of CHI, 2115--2124.",
      "doi": ""
    },
    {
      "text": "Muffy Calder, Mario Kolberg, Evan H. Magill, and Stephan Reiff-Marganiec. 2003. Feature interaction: a critical review and considered forecast. Computer Networks 41, 1: 115--141.  ",
      "doi": "10.1016/S1389-1286%2802%2900352-3"
    },
    {
      "text": "Colin Dixon, Ratul Mahajan, Sharad Agarwal, A. J. Brush, Bongshin Lee, Stefan Saroiu, and Victor Bahl. 2010. The Home Needs an Operating System (and an App Store). In Proc. of Workshop on Hot Topics in Networks, 18:1--18:6.  ",
      "doi": "10.1145/1868447.1868465"
    },
    {
      "text": "W. Keith Edwards and Rebecca E. Grinter. 2001. At Home with Ubiquitous Computing: Seven Challenges. UbiComp: 256--272.",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Willet Kempton. 1986. Two Theories of Home Heat Control. Cognitive Science 10: 75--90. ",
      "doi": ""
    },
    {
      "text": "P. Leelaprute, T. Matsuo, T. Tsuchiya, and T. Kikuno. 2008. Detecting Feature Interactions in Home Appliance Networks. In Proc. of Software Engineering, Artificial Intelligence, Networking, and Parallel/Distributed Computing, 895--903. https://doi.org/10.1109/SNPD.2008.158",
      "doi": "10.1109/SNPD.2008.158"
    },
    {
      "text": "Sarah Mennicken, Jonas Hofer, Anind Dey, and Elaine M. Huang. 2014. Casalendar: A Temporal Interface for Automated Homes. In Ext. Abst. of CHI, 2161--2166.  ",
      "doi": "10.1145/2559206.2581321"
    },
    {
      "text": "Miji Park, Juhyun Eune, and Suzung Kim. 2010. Tangible User Interface Design for Home Automation Energy Management Appliances. In Proc. of SIGRAPH Asia.  ",
      "doi": "10.1145/1900354.1900367"
    },
    {
      "text": "Ajitha Rajan, Lydie du Bousquet, Yves Ledru, German Vega, and Jean-Luc Richier. 2010. Assertion-based Test Oracles for Home Automation Systems. In Proc. of Workshop on Model-Based Methodologies for Pervasive and Embedded Software, 45--52.  ",
      "doi": "10.1145/1865875.1865882"
    },
    {
      "text": "J. Rasmussen. 1983. Skills, rules, and knowledge; signals, signs, and symbols, and other distinctions in human performance models. IEEE Transactions on Systems, Man and Cybernetics SMC-13, 3: 257--266. https://doi.org/10.1109/TSMC.1983.6313160",
      "doi": ""
    },
    {
      "text": "Jens Rasmussen. 1982. Human errors. A taxonomy for describing human malfunction in industrial installations. Journal of Occupational Accidents 4, 2--4: 311--333. https://doi.org/10.1016/0376--6349(82)90041--4",
      "doi": ""
    },
    {
      "text": "Michael Rietzler, Julia Greim, Marcel Walch, Florian Schaub, Björn Wiedersheim, and Michael Weber. 2013. homeBLOX: Introducing Process-driven Home Automation. In Proc. of Ubicomp 2013, 801--808.",
      "doi": ""
    },
    {
      "text": "Cédric Seguin, Florent De Lamotte, and Jeans-Luc Philippe. 2012. System Services Partitioning in Ambient Assisted Living Environment. In Proc. of Ubicomp, 778--781.  ",
      "doi": "10.1145/2370216.2370390"
    },
    {
      "text": "Irving Seidman. 1998. Interviewing as Qualitative Research: A Guide for Researchers in Education And the Social Sciences. Teachers College Press, New York.",
      "doi": ""
    },
    {
      "text": "C. Soares, R.S. Moreira, R. Morla, J. Torres, and P. Sobral. 2012. Prognostic of feature interactions between independently developed pervasive systems. In Proc. of Conference on Prognostics and Health Management. https://doi.org/10.1109/ICPHM.2012.6299523",
      "doi": ""
    },
    {
      "text": "C. Soares, R.S. Moreira, R. Morla, J. Torres, and P. Sobral. 2012. Graph-based approach for interference free integration of pervasive applications. In Proc. of Symposium on Wireless and Pervasive Computing (ISWPC). https://doi.org/10.1109/ISWPC.2012.6263661",
      "doi": ""
    },
    {
      "text": "Susan L. Star. 1999. The Ethnography of Infrastructure. American Behavioral Scientist 43, 3: 377--391. ",
      "doi": ""
    },
    {
      "text": "Leila Takayama, Caroline Pantofaru, David Robson, Bianca Soto, and Michael Barry. 2012. Making Technology Homey: Finding Sources of Satisfaction and Meaning in Home Automation. In Proc. of Ubicomp, 511--520.",
      "doi": "10.1145/2370216.2370292"
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, Chris Greenhalgh, and Steve Benford. 2007. Making the home network at home: Digital housekeeping. In Proc. of ECSCW, 331--350. ",
      "doi": ""
    },
    {
      "text": "Michael Wilson, Mario Kolberg, and Evan H. Magill. 2008. Considering Side Effects in Service Interactions in Home Automation -- an Online Approach. In Feature Interactions in Software and Communication Systems IX. IOS Press, 172--187.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath Day Home Automation: \"It's Like Mixing Technology and Religion.\" In Proc. of CHI, 527-- 536.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Rayoung Yang and Mark W. Newman. 2013. Learning from a Learning Thermostat: Lessons for Intelligent Systems for the Home. In Proc. of Ubicomp, 93--102.  ",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Pamela Zave. 2011. Mid-call, Multi-party, and Multidevice Telecommunication Features and Their Interactions. In Proc. of IPTcomm, 17:1--17:12.",
      "doi": ""
    },
    {
      "text": "Pamela Zave and Eric Cheung. 2014. A resolution mechanism for feature interactions in ubiquitous computing. AT&T Research Labs.",
      "doi": ""
    },
    {
      "text": "Pamela Zave, Eric Cheung, and Svetlana Yarosh. 2015. Toward user-centric feature composition for the Internet of Things. arXiv:1510.06714 [cs]. Retrieved December 21, 2016 from http://arxiv.org/abs/1510.06714",
      "doi": ""
    },
    {
      "text": "AT&T Home Security and Automation. Retrieved December 21, 2016 from https://mydigitallife.att.com/learn/home-security-and-automation",
      "doi": ""
    }
  ]
}