{
  "doi": "10.1145/3025453.3025982",
  "title": "Keeping Users Engaged through Feature Updates: A Long-Term Study of Using Wearable-Based Exergames",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1053-1064",
  "year": 2017,
  "badges": [],
  "abstract": "Gamification and exergames in particular have been broadly employed in health and fitness as an attempt to promote exercise and more active life styles. Motivated by popularity and availability of wearable activity trackers, we present the design and findings of a study on the motivational effects of using activity tracker-based games to promote daily exercise. Furthermore, we have investigated user behaviors, usage patterns, engagement, and parameters that affect them. An exergame was developed with an accompanying wearable device, for which different variations of application updates were pushed out periodically over a 70-day period. The results of this long-term study show that the usage of wearable activity trackers during exercise, even when gamified for increased entertainment, sees a consistent decline over time. This decline, however, is observed to be reversible with periodic updates to the game. This work, we believe, can make a significant contribution to solving the user retention problem of wearable-based exergames.",
  "authors": [
    {
      "name": "Zhao Zhao",
      "institution": "Carleton University, Ottawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660021153",
      "orcid": "missing"
    },
    {
      "name": "Ali Arya",
      "institution": "Carleton University, Ottawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315487846",
      "orcid": "missing"
    },
    {
      "name": "Anthony Whitehead",
      "institution": "Carleton University, Ottawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100051534",
      "orcid": "missing"
    },
    {
      "name": "Gerry Chan",
      "institution": "Carleton University, Ottawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658629338",
      "orcid": "missing"
    },
    {
      "name": "S. Ali Etemad",
      "institution": "Carleton University, Ottawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444605633",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Riikka Ahola, et al. 2013. Gamified physical activation of young men: A multidisciplinary population-based randomized controlled trial (MOPO study). BMC Public Health 13, 32: 1--8. ",
      "doi": ""
    },
    {
      "text": "Marie-Louise Bird, Brodie Clark, Johanna Millar, Sue Whetton, and Stuart Smith. 2015. Exposure to \"exergames\" increases older adults' perception of the usefulness of technology for improving health and physical activity: A pilot study. JMIR Serious Games 3, 2: e8. doi: 10.2196/games.4275. ",
      "doi": ""
    },
    {
      "text": "Blast Analytics & Marketing. 2013. Can You Trust Your Google Analytics Data? Retrieved September 5 2016 from http://www.blastam.com/blog/can-you-trust-yourgoogle-analytics-data",
      "doi": ""
    },
    {
      "text": "Taj Campbell, Brian Ngo, and James Fogarty. 2008. Game design principles in everyday fitness applications. Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work, ACM2008, 249--252.  ",
      "doi": "10.1145/1460563.1460603"
    },
    {
      "text": "James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 647--658.  ",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Amanda J. Daley. 2009. Can exergaming contribute to improving physical activity levels and health outcomes in children's Pediatrics, 124, 2: 763--771.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining gamification. Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments. ACM2011.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Daniel A. Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A. Munson. 2016. Beyond abandonment to next steps: Understanding and designing for life after personal informatics tool use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1109--1113.  ",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Stefan Göbel, Sandro Hardy, Viktor Wendel, Florian Mehm, and Ralf Steinmetz. 2010. Serious games for health: Personalized exergames. Proceedings of the 18th ACM international conference on Multimedia, ACM2010, 1663--1666.  ",
      "doi": "10.1145/1873951.1874316"
    },
    {
      "text": "Google.com. 2016. Google Analytics - Mobile, Premium and Free Website Analytics -- Google. Retrieved September 5 2016 from https://www.google.com/analytics",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers? A longitudinal study of Habito. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 1305--1316.  ",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Lee Graves, Gareth Stratton, N. D. Ridgers, and N. T. Cable. 2008. Energy expenditure in adolescents playing new generation computer games. British journal of sports medicine 42, 7: 592--594.",
      "doi": ""
    },
    {
      "text": "Juho Hamari and Jonna Koivisto. 2013. Social motivations to use gamification: An empirical study of gamifying exercise. In ECIS 2013, 105.",
      "doi": ""
    },
    {
      "text": "Hockeyapp.net. 2016. HockeyApp - The Platform for Your Apps. Retrieved August 5, 2016 from https://www.hockeyapp.net",
      "doi": ""
    },
    {
      "text": "Intrinsic Motivation Inventory. 2016. SelfDetermination Theory. http://selfdeterminationtheory.org/intrinsic-motivationinventory/",
      "doi": ""
    },
    {
      "text": "James Jaccard, Michael A. Becker, and Gregory Wood. 1984. Pairwise multiple comparison procedures: a review. Psychological Bulletin, 96, 3: 589--596. ",
      "doi": ""
    },
    {
      "text": "Younbo Jung, et al. 2009. Games for a better life: effects of playing Wii games on the well-being of seniors in a long-term care facility. Proceedings of the Sixth Australasian Conference on Interactive Entertainment. ACM2009.  ",
      "doi": "10.1145/1746050.1746055"
    },
    {
      "text": "Evangelos Karapanos. 2015. Sustaining user engagement with behavior change tools. Interactions, 22, 4: 48--52.  ",
      "doi": "10.1145/2775388"
    },
    {
      "text": "Anthony M. Limperos and Mike Schmierbach. 2016. Understanding the relationship between exergame play experiences, enjoyment, and intentions for continued play. Games for Health Journal, 5, 2: 100--107. ",
      "doi": ""
    },
    {
      "text": "Elizabeth J. Lyons, Deborah F. Tate, Dianne S. Ward, Kurt M. Ribisl, J. Michael Bowling, and Sriran Kalyanaraman. 2014. Engagement, enjoyment, and energy expenditure during active video game play. Health Psychology, 33, 2: 174--181. ",
      "doi": ""
    },
    {
      "text": "Andrew Macvean and Judy Robertson. 2013. Understanding exergame users' physical activity, motivation and behavior over time. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/2470654.2466163"
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research Quarterly for Exercise and Sport, 60, 1: 48--58. ",
      "doi": ""
    },
    {
      "text": "Florian 'Floyd' Mueller, Firaz Peer, Stefan Agamanolis, and Jennifer Sheridan. 2011. Gamification and exertion. Proceedings of the Workshop on Gamification at the Conference on Human Factors in Computing Systems. ACM.",
      "doi": ""
    },
    {
      "text": "Huynh Van Nguyen, et al. 2016. Double-edged sword: The effect of exergaming on other forms of exercise; a randomized controlled trial using the selfcategorization theory. Computers in Human Behavior, 62: 590--593.  ",
      "doi": "10.1016/j.chb.2016.04.030"
    },
    {
      "text": "Lukasz Piwek, et al. 2016. The rise of consumer health wearables: promises and barriers. PLoS Med., 13, 2: e1001953.",
      "doi": ""
    },
    {
      "text": "Positive Gaming. 2016. The Benefits of Exergaming. Retrieved September 5, 2016 from http://www.positivegaming.com/positivegaming/benefi ts/exergaming-benefits",
      "doi": ""
    },
    {
      "text": "Michael Schwenk, Gurtej S. Grewal, Bahareh Honarvar, Stefanie Schwenk, Jane Mohler, Dharma S. Khalsa, and Bijan Najafi. 2014. Interactive balance training integrating sensor-based visual feedback of movement performance: a pilot study in older adults. Journal of Neuroengineering and Rehabilitation, 11, 1: 1.",
      "doi": ""
    },
    {
      "text": "Jan David Smeddinck, Marc Herrlich, and Rainer Malaka. 2015. Exergames for physiotherapy and rehabilitation: A medium-term situated study of motivational aspects and impact on functional reach. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/2702123.2702598"
    },
    {
      "text": "Amanda E. Staiano and Sandra L. Calvert. 2011. Exergames for physical education courses: Physical, social, and cognitive benefits. Child development perspectives, 5, 2: 93--98. ",
      "doi": ""
    },
    {
      "text": "Haichun Sun. 2013. Impact of exergames on physical activity and motivation in elementary school students: A follow-up study. Journal of Sport and Health Science, 2, 3: 138--145. ",
      "doi": ""
    },
    {
      "text": "Mohsen Tavakol and Reg Dennick. 2011. Making sense of Cronbach's alpha. International Journal of Medical Education, 2: 53--55. ",
      "doi": ""
    },
    {
      "text": "Ti.com. 2016. Simplelink SensorTag - TI.com. Retrieved September 5, 2016 from http://www.ti.com/ww/en/wireless_connectivity/sensor tag2015/?INTC=SensorTag&HQS=sensortag",
      "doi": ""
    },
    {
      "text": "Anthony Whitehead, Hannah Johnston, Nicole Nixon, and Jo Welch. 2010. Exergame effectiveness: what the numbers can tell us. Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games ACM. 55--62.  ",
      "doi": "10.1145/1836135.1836144"
    },
    {
      "text": "Justin Wylie. 2010. Fitness gamification: concepts, characteristics, and applications. Retrieved from: http://www.justintwylie.com/wpcontent/uploads/2014/12/JUSTIN-WYLIE-FitnessGamification.pdf",
      "doi": ""
    },
    {
      "text": "Jeffrey Yim and T. C. Nicholas Graham. 2007. Using games to increase exercise motivation. Proceedings of the 2007 conference on Future Play. ACM2007.  ",
      "doi": "10.1145/1328202.1328232"
    },
    {
      "text": "Zhao Zhao, S. Ali Etemad, Ali Arya, and Anthony Whitehead. 2016. Usability and motivational effects of a gamified exercise and fitness system based on wearable devices. In International Conference of Design, User Experience, and Usability, Springer International Publishing, 333--344. ",
      "doi": ""
    }
  ]
}