{
  "doi": "10.1145/3025453.3025767",
  "title": "Gender Norms and Attitudes about Childcare Activities Presented on Father Blogs",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4966-4971",
  "year": 2017,
  "badges": [],
  "abstract": "Father involvement is important for child well-being. However, fathers still do significantly less childcare than mothers, due in part to traditional gender norms. This research investigates whether incorporating do-it-yourself (DIY) language and imagery into parenting blogs is an effective mechanism for boosting fathers' willingness to perform childcare activities. We conducted a between-subjects experiment with 374 participants in the U.S. who responded to ten parenting blog posts. Subjects were randomized to view posts with either DIY or neutral language and either routine childcare activities (e.g., changing diapers) or interactive ones (e.g., finger painting). Results show that DIY language actually decreases a father's willingness to do a childcare activity. Further, fathers underestimate how socially appropriate it is for them to perform childcare activities and this misperception relates to their willingness to get involved. We draw on social norms literature to recommend next steps for designing interfaces to support father involvement in childrearing.",
  "authors": [
    {
      "name": "Kai Lukoff",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161231",
      "orcid": "0000-0001-5069-6817"
    },
    {
      "name": "Carol Moser",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-99659021889/rel-imgonly/carolmoser_bw.png",
      "acmid": "99659021889",
      "orcid": "missing"
    },
    {
      "name": "Sarita Schoenebeck",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750237",
      "orcid": "0000-0002-8688-1595"
    }
  ],
  "references": [
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not? In Proceedings of the Extended Abstracts of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14), 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Tawfiq Ammari, Silvia Lindtner, and Sarita Schoenebeck. Bringing the Shed into the Home: The Crafting of DIY Fatherhood. Under review.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1905--1914.  ",
      "doi": "10.1145/2702123.2702205"
    },
    {
      "text": "T. Ammari and S. Schoenebeck. 2016. \"Thanks for your interest in our Facebook group, but it's only for dads\": Social Roles of Stay-at-Home Dads. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 1363--1375.  ",
      "doi": "10.1145/2818048.2819927"
    },
    {
      "text": "babycenter. Company Overview. BabyCenter. Retrieved from www.babycenter.com/help-aboutcompany",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Judy Robertson, Geraldine Fitzpatrick, Rebecca Say, Gillian Hayes, Melissa Mazmanian, and Belinda Parmar. 2013. Motherhood and HCI. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 3215-- 3218.  ",
      "doi": "10.1145/2468356.2479650"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of statistical software 67, 1: 1--48.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Back to the shed: gendered visions of technology and domesticity. Personal and Ubiquitous Computing 11, 5: 373--381.  ",
      "doi": "10.5555/1265387.1265397"
    },
    {
      "text": "Suzanne M. Bianchi, John P. Robinson, and Melissa A. Milke. 2006. The changing rhythms of American family life. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure during Shifting Social Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 610--622.  ",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Natasha Cabrera and H. Elizabeth Peters. 2000. Public Policies and Father Involvement. Marriage & family review 29, 4: 295--314.",
      "doi": ""
    },
    {
      "text": "Robert B. Cialdini, Carl A. Kallgren, and Raymond R. Reno. 1991. A Focus Theory of Normative Conduct: A Theoretical Refinement and Reevaluation of the Role of Norms in Human Behavior. In Advances in Experimental Social Psychology, Mark P. Zanna (ed.). Academic Press, 201--234.",
      "doi": ""
    },
    {
      "text": "Lyn Craig. 2006. Does Father Care Mean Fathers Share? A Comparison of How Mothers and Fathers in Intact Families Spend Time with Children. Gender and Society 20, 2: 259--281.",
      "doi": ""
    },
    {
      "text": "Andrea Doucet. 2004. \"It's almost like I have a job, but I don't get paid\": fathers at home reconfiguring work, care, and masculinity. Fathering 2, 3: 277.",
      "doi": ""
    },
    {
      "text": "A. Field, J. Miles, and Z. Field. 2012. Discovering Statistics Using R. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 56--68.  ",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Steven M. Gelber. 1997. Do-It-Yourself: Constructing, Repairing and Maintaining Domestic Masculinity. American quarterly 49, 1: 66--112.",
      "doi": ""
    },
    {
      "text": "Lorna Gibson and Vicki L. Hanson. 2013. Digital Motherhood: How Does Technology Help New Mothers? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 313--322.  ",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Alan J. Hawkins, Kay P. Bradford, Rob Palkovitz, Shawn L. Christiansen, Randal D. Day, and Vaughn R. A. Call. 2002. The Inventory of Father Involvement: A Pilot Study of a New Measure of Father Involvement. The Journal of Men's Studies 10, 2: 183--196.",
      "doi": ""
    },
    {
      "text": "Arlie Hochschild and Anne Machung. 2012. The Second Shift: Working Families and the Revolution at Home. Penguin.",
      "doi": ""
    },
    {
      "text": "Michael E. Lamb. 2000. The History of Research on Father Involvement. Marriage & Family Review 29, 23: 23--42.",
      "doi": ""
    },
    {
      "text": "Michael E. Lamb. 2004. The Role of the Father in Child Development. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner. 2014. Hackerspaces and the Internet of Things in China: How makers are reinventing industrial production, innovation, and the self. China Information 28, 2: 145--167.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Anna Greenspan, and David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15), 85--96.  ",
      "doi": "10.7146/aahcc.v1i1.21265"
    },
    {
      "text": "Gretchen Livingston. 2013. The rise of single fathers: A ninefold increase since 1960. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Gretchen Livingston. 2014. Growing number of dads home with the kids. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "James R. Mahalik, Benjamin D. Locke, Larry H. Ludlow, Matthew A. Diemer, Ryan P. J. Scott, Michael Gottfried, and Gary Freitas. 2003. Development of the Conformity to Masculine Norms Inventory. Psychology of Men & Masculinity 4, 1: 3.",
      "doi": ""
    },
    {
      "text": "Kim Parker and Wendy Wang. 2013. Modern Parenthood: Roles of Moms and Dads Converge as They Balance Work and Family. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Wesley H. Perkins. 2002. Social norms and the prevention of alcohol misuse in collegiate contexts. Journal of studies on alcohol. Supplement, 14: 164-- 172.",
      "doi": ""
    },
    {
      "text": "Wesley H. Perkins and Alan D. Berkowitz. 1986. Perceiving the Community Norms of Alcohol Use among Students: Some Research Implications for Campus Alcohol Education Programming. The International journal of the addictions 21, 9--10: 961-- 976.",
      "doi": ""
    },
    {
      "text": "Wesley H. Perkins, Philip W. Meilman, Leichliter, S. Jami, Jeffrey R. Cashin, and Cheryl A. Presley. 1999. Misperceptions of the norms for the frequency of alcohol and other drug use on college campuses. Journal of American College Health 47, 6: 253--258.",
      "doi": ""
    },
    {
      "text": "Deborah A. Prentice and Dale T. Miller. 1993. Pluralistic ignorance and alcohol use on campus: some consequences of misperceiving the social norm. Journal of personality and social psychology 64, 2: 243--256.",
      "doi": ""
    },
    {
      "text": "Erin M. Rehel. 2013. When Dad Stays Home Too: Paternity Leave, Gender, and Parenting. Gender & Society.",
      "doi": ""
    },
    {
      "text": "John Robinson and Geoffrey Godbey. 2010. Time for life: The surprising ways Americans use their time. Penn State Press.",
      "doi": ""
    },
    {
      "text": "Aaron B. Rochlen, Ryan A. McKelley, and Tiffany A. Whittaker. 2010. Stay-at-home fathers' reasons for entering the role and stigma experiences: A preliminary report. Psychology of Men & Masculinity 11, 4: 279.",
      "doi": ""
    },
    {
      "text": "Anne Roeters, Tanja Van Der Lippe, and Esther S. Kluwer. 2009. Parental Work Demands and the Frequency of Child-Related Routine and Interactive Activities. Journal of Marriage and Family 7, 5: 1193-- 1204.",
      "doi": ""
    },
    {
      "text": "Anna Sarkadi, Robert Kristiansson, Frank Oberklaid, and Sven Bremberg. 2008. Fathers? involvement and children's developmental outcomes: a systematic review of longitudinal studies. Acta paediatrica 97, 2: 153--158.",
      "doi": ""
    },
    {
      "text": "S. H. Schwartz. 1977. Nonnative influences on altruism. Advances in experimental social psychology 10.",
      "doi": ""
    },
    {
      "text": "Susan Currie Sivek. 2011. \"We Need a Showing of All Hands\": Technological Utopianism in MAKE Magazine. Journal of Communication Inquiry.",
      "doi": ""
    },
    {
      "text": "Wendy Wang, Kim Parker, and Paul Taylor. 2013. Breadwinner moms. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Modern Families + Fresh Ideas. Parenting.com. Retrieved October 23, 2015 from http://www.parenting.com/",
      "doi": ""
    }
  ]
}