{
  "doi": "10.1145/3025453.3025648",
  "title": "Why is This Happening to Me?: How Player Attribution can Broaden our Understanding of Player Experience",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1040-1052",
  "year": 2017,
  "badges": [],
  "abstract": "Games user research (GUR) measures the performance and preference of digital game players, and interprets these measurements in the context of theories that explain human behavior. There are many validated approaches for measuring player experience that are grounded in psychological theories on motivation and emotion. Attribution theory explains how people assign causes to events and how these attributions affect peoples' emotional reactions and motivations. In this paper we argue that attribution theory can provide additional value to the existing suite of GUR tools; however, there are currently no validated tools to assess player attribution in the context of games. This paper describes the conceptualization of player attribution based on literature, presents the development and validation of a scale to assess player attribution in games, and discusses the implications of adding player attribution to the toolbox of methods for the design and evaluation of digital games.",
  "authors": [
    {
      "name": "Ansgar E. Depping",
      "institution": "University of Sakatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022433",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lyn Y. Abramson, Martin E. Seligman, and John D. Teasdale. 1978. Learned helplessness in humans: Critique and reformulation. Journal of Abnormal Psychology 87, 1 (1978), 49--74. http://dx.doi.org/10.1037/0021-843x.87.1.49 ",
      "doi": ""
    },
    {
      "text": "Craig A. Anderson and Alice L. Riger. 1991. A Controllability Attributional Model of Problems in Living: Dimensional and Situational Interactions in the Prediction of Depression and Loneliness. Social Cognition 9, 2 (jun 1991), 149--181. http://dx.doi.org/10.1521/soco.1991.9.2.149. ",
      "doi": ""
    },
    {
      "text": "Max V. Birk, Regan L. Mandryk, Matthew K. Miller, and Kathrin M. Gerling. 2015. How Self-Esteem Shapes our Interactions with Play Technologies. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15). ACM, New York, NY, USA, 35--45. http://dx.doi.org/10.1145/2793107.2793111  ",
      "doi": "10.1145/2793107.2793111"
    },
    {
      "text": "Max V. Birk, Dereck Toker, Regan L. Mandryk, and Cristina Conati. 2011. Modeling Motivation in a Social Network Game using Player-Centric Traits and Personality Traits. In Proceedings of the 23rd Conference on User Modelling, Adaptation, and Personalization UMAP '11. Dublin, Ireland, 18--30. http://dx.doi.org/10.1007/978-3-319-20267-9_2 ",
      "doi": ""
    },
    {
      "text": "Gifford W. Bradley. 1978. Self-serving biases in the attribution process: A reexamination of the fact or fiction question. Journal of Personality and Social Psychology 36, 1 (1978), 56--71. http://dx.doi.org/10.1037/0022-3514.36.1.56 ",
      "doi": ""
    },
    {
      "text": "Thomas N. Bradbury and Frank D. Fincham. 1990. Attributions in marriage: Review and critique. Psychological Bulletin 107, 1 (1990), 3--33. http://dx.doi.org/10.1037/0033--2909.107.1.3.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1988. The flow experience and its significance for human psychology. In Psychological studies of flow in consciousness, Mihaly Csikszentmihalyi and Isabella Selega Csikszentmihalyi (Eds.). Cambridge University Press (CUP), 15--35. http://dx.doi.org/10.1017/cbo9780511621956.002. ",
      "doi": ""
    },
    {
      "text": "Frederik De Grove, Verolien Cauberghe, and Jan Van Looy. 2014. Development and Validation of an Instrument for Measuring Individual Motives for Playing Digital Games. Media Psychology (jun 2014), 1--25. http://dx.doi.org/10.1080/15213269.2014.902318 ",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping, Regan L. Mandryk, Chengzhao Li, Carl Gutwin, and Rodrigo Vicencio-Moreira. 2016. How Disclosing Skill Assistance Affects Play Experience in a Multiplayer First-Person Shooter Game. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. (ACM), 3462--3472.  ",
      "doi": "10.1145/2858036.2858156"
    },
    {
      "text": "Sebastian Deterding. 2012. Gamification: designing for motivation. interactions,19(4), 14--17.",
      "doi": ""
    },
    {
      "text": "Robert F DeVellis. 2012. Scale development: Theory and applications. Vol. 26. Sage publications.",
      "doi": ""
    },
    {
      "text": "Christopher Dring, 2015, June 14th . More money is spent on games than movies and music combined, says HIS. Retrieved from www.mcvuk.com/news/read/more-money-is-spent-ongames-than-movies-and-music-combined-saysihs/0151059",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1 (mar 1989), 48--58. http://dx.doi.org/10.1080/02701367.1989.10607413.",
      "doi": ""
    },
    {
      "text": "Josefine Fahlström, Emma Matson. 2014. Preventing Toxic Behaviour through Game Mechanics.",
      "doi": ""
    },
    {
      "text": "Gordon Fitch. 1970. Effects of self-esteem, perceived performance, and choice on causal attributions. Journal of Personality and Social Psychology 16, 2 (1970), 311--315. http://dx.doi.org/10.1037/h0029847. ",
      "doi": ""
    },
    {
      "text": "Susan Folkman, Richard S. Lazarus, Rand J. Gruen, and Anita DeLongis. 1986. Appraisal, coping, health status, and psychological symptoms. Journal of Personality and Social Psychology 50, 3 (1986), 571--579. http://dx.doi.org/10.1037/0022-3514.50.3.571. ",
      "doi": ""
    },
    {
      "text": "Kathrin Maria Gerling, Matthew Miller, Regan L. Mandryk, Max Valentin Birk, and Jan David Smeddinck. 2014. Effects of balancing for physical abilities on player performance, experience and self-esteem in exergames. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI 14. Association for Computing Machinery (ACM). http://dx.doi.org/10.1145/2556288.2556963  ",
      "doi": "10.1145/2556288.2556963"
    },
    {
      "text": "Sandra Graham. 1991. A review of attribution theory in achievement contexts. Educational Psychology Review 3,1 (mar 1991), 5--39. http://dx.doi.org/10.1007/bf01323661 ",
      "doi": ""
    },
    {
      "text": "Grüsser, S. M., Thalemann, R., & Griffiths, M. D. (2006). Excessive computer game playing: evidence for addiction and aggression? CyberPsychology & Behavior, 10(2), 290--292. ",
      "doi": ""
    },
    {
      "text": "Shlomo Hareli and Bernard Weiner. 2002. Social Emotions and Personality Inferences: A Scaffold for a New Direction in the Study of Achievement Motivation. Educational Psychologist 37, 3 (sep 2002), 183--193. http://dx.doi.org/10.1207/s15326985ep3703_4 ",
      "doi": ""
    },
    {
      "text": "Robert M. Hessling, Craig A. Anderson, and Daniel W. Russell 2,002. Attributional styles. Encyclopedia of psychological assessment, 116--120.",
      "doi": ""
    },
    {
      "text": "Li tze Hu and Peter M. Bentler. 1999. Cutoff criteria for fit indexes in covariance structure analysis: Conventional criteria versus new alternatives. Structural Equation Modeling: A Multidisciplinary Journal 6, 1 (jan 1999), 1--55. http://dx.doi.org/10.1080/10705519909540118 ",
      "doi": ""
    },
    {
      "text": "E. Tory Higgins. 1987. Self-discrepancy: A theory relating self and affect. Psychological Review 94, 3 (1987), 319--340. http://dx.doi.org/10.1037/0033295x.94.3.31",
      "doi": ""
    },
    {
      "text": "Oliver P. John, Laura P. Naumann, and Christopher J. Soto, 2008. Paradigm shift to the integrative big five trait taxonomy. Handbook of personality: Theory and research, 3, 114--158.",
      "doi": ""
    },
    {
      "text": "Dan, Russell. 1982 The Causal Dimension Scale: A measure of how individuals perceive causes. Journal of Personality and social Psychology 42, 6, 1982: 1137.",
      "doi": ""
    },
    {
      "text": "Kent, Russell L. 1991. The development and evaluation of a scale to measure organizational attributional style.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI 15. Association for Computing Machinery (ACM). http://dx.doi.org/10.1145/2702123.2702529  ",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 453--456. http://dx.doi.org/10.1145/1357054.1357127  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "William W. Lambert and Richard S. Lazarus. 1970. Psychological Stress and the Coping Process. The American Journal of Psychology 83, 4 (dec 1970), 634. http://dx.doi.org/10.2307/1420698 ",
      "doi": ""
    },
    {
      "text": "Nicole Lazzaro, 2008. Fun keys: Testing emotions and player experiences. Game Usability: Advice from the Experts for Advancing the Player Experience. Morgan Kaufmann, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Paul Benjamin Lowry and James Gaskin. 2014. Partial Least Squares (PLS) Structural Equation Modeling (SEM) for Building and Testing Behavioral Causal Theory: When to Choose It and How to Use It. IEEE Trans. Profess. Commun. 57, 2 (jun 2014), 123--146. http://dx.doi.org/10.1109/tpc.2014.2312452 ",
      "doi": ""
    },
    {
      "text": "Mark Martinko. 1995.Attribution theory: An organizational perspective. CRC Press",
      "doi": ""
    },
    {
      "text": "Winter Mason, and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods, 44(1), 1--23. http://dx.doi.org/10.3758/s13428-011-0124-6 ",
      "doi": ""
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V. Tammen. 1989. Psychometric properties of the Intrinsic Motivation Inventory in a competitive sport setting: A confirmatory factor analysis. Research Quarterly for Exercise and Sport, 60(1), 48--58. http://dx.doi.org/10.1080/02701367.1989.10607413 ",
      "doi": ""
    },
    {
      "text": "Matthew K. Miller, and Regan L. Mandryk. 2016. Differentiating in-Game Frustration from at-Game Frustration using Touch Pressure. Proceedings of the 2016 ACM Conference on Interactive Surfaces and Spaces. (ACM), 225--234.  ",
      "doi": "10.1145/2992154.2992185"
    },
    {
      "text": "Lennart E. Nacke, Chris Bateman, and Regan L. Mandryk, 2014. BrainHex: A neurobiological gamer typology survey. Entertainment computing, 5(1), 55--62. ",
      "doi": ""
    },
    {
      "text": "Newzoo. 2015 Global Games Market Report, https://newzoo.com/solutions/revenuesprojections/global-games-market-report/",
      "doi": ""
    },
    {
      "text": "Christopher Peterson, Amy Semmel, Carl von Baeyer, Lyn Y. Abramson, Gerald I. Metalsky, and Martin E. P. Seligman. 1982. The attributional Style Questionnaire. Cognitive Therapy and Research 6, 3 (sep 1982), 287--299. http://dx.doi.org/10.1007/bf01173577 ",
      "doi": ""
    },
    {
      "text": "Christopher Peterson and Lisa C. Barrett. 1987. Explanatory style and academic performance among university freshman. Journal of Personality and Social Psychology 53, 3 (1987), 603--607. http://dx.doi.org/10.1037/0022-3514.53.3.603. ",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, Netta Weinstein, Richard M. Ryan, and C. Scott Rigby. 2009. Having to versus wanting to play: Background and consequences of harmonious versus obsessive engagement in video games. CyberPsychology & Behavior 12(5), 485--492. http://dx.doi.org/10.1089/cpb.2009.0083 ",
      "doi": ""
    },
    {
      "text": "Rocío Fernández-Ballesteros, ed. 2002. Encyclopedia of psychological assessment. Sage.",
      "doi": ""
    },
    {
      "text": "Morris Rosenberg, 1965. Society and the adolescent self-image. Social Forces 44, 2 (dec 1965), 255. http://dx.doi.org/10.2307/2575639. ",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Selfdetermination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55, 1 (2000), 68--78. http://dx.doi.org/10.1037/0003-066x.55.1.68 ",
      "doi": ""
    },
    {
      "text": "Ryan, Richard M., C. Scott Rigby, and Andrew Przybylski. \"The motivational pull of video games: A self-determination theory approach.\" Motivation and emotion 30, no. 4 (2006): 344--360. ",
      "doi": ""
    },
    {
      "text": "Katie Salen, and Eric Zimmerman, 2004. Rules of play: Game design fundamentals. MIT press. http://dx.doi.org/10.1162/leon.2004.37.5.414 ",
      "doi": ""
    },
    {
      "text": "Klaus R. Scherer, Angela Schorr, and Tom Johnstone, eds. 2001. Appraisal processes in emotion: Theory, methods, research. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Martin E. Seligman and et al. 1984. Attributional style and depressive symptoms among children. Journal of Abnormal Psychology 93, 2 (1984), 235--238. http://dx.doi.org/10.1037/0021-843x.93.2.235 ",
      "doi": ""
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow. Comput. Entertain. 3, 3 (jul 2005), 3. http://dx.doi.org/10.1145/1077246.1077253  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "David Watson, and Lee Anna Clark. 1999. The PANAS-X: Manual for the positive and negative affect schedule-expanded form.",
      "doi": ""
    },
    {
      "text": "Bernard Weiner. 1979. A theory of motivation for some classroom experiences. Journal of Educational Psychology 71, 1 (1979), 3--25. http://dx.doi.org/10.1037/0022-0663.71.1.3. ",
      "doi": ""
    },
    {
      "text": "Bernard Weiner. 1985. An attributional theory of achievement motivation and emotion. Psychological Review 92, 4 (1985), 548--573. http://dx.doi.org/10.1037/0033-295x.92.4.548 ",
      "doi": ""
    },
    {
      "text": "Bernard Weiner. 1986. An Attributional Theory of Motivation and Emotion. Springer Science Business Media. http://dx.doi.org/10.1007/978-1-4612-4948-1 ",
      "doi": ""
    },
    {
      "text": "Bernard Weiner. 2001. Intrapersonal and Interpersonal Theories of Motivation from an Attribution Perspective. In Student Motivation. Springer Science Business Media, 17--30. http://dx.doi.org/10.1007/978-1-46151273-8_2",
      "doi": ""
    },
    {
      "text": "B. Weiner. 2014. The Attribution Approach to Emotion and Motivation: History, Hypotheses, Home Runs, Headaches/Heartaches. Emotion Review 6, 4 (sep 2014), 353--361. http://dx.doi.org/10.1177/1754073914534502 ",
      "doi": ""
    },
    {
      "text": "E. J. Wolf, K. M. Harrington, S. L. Clark, and M. W. Miller. 2013. Sample Size Requirements for Structural Equation Models: An Evaluation of Power, Bias, and Solution Propriety. Educational and Psychological Measurement 73, 6 (jul 2013), 913--934. http://dx.doi.org/10.1177/0013164413495237. ",
      "doi": ""
    }
  ]
}