{
  "doi": "10.1145/3025453.3026021",
  "title": "BreakSense: Combining Physiological and Location Sensing to Promote Mobility during Work-Breaks",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3595-3607",
  "year": 2017,
  "badges": [],
  "abstract": "Work breaks can play an important role in the mental and physical well-being of workers and contribute positively to productivity. In this paper we explore the use of activity-, physiological-, and indoor-location sensing to promote mobility during work-breaks. While the popularity of devices and applications to promote physical activity is growing, prior research highlights important constraints when designing for the workplace. With these constraints in mind, we developed BreakSense, a mobile application that uses a Bluetooth beacon infrastructure, a smartphone and a smartwatch to encourage mobility during breaks with a game-like design. We discuss constraints imposed by design for work and the workplace, and highlight challenges associated with the use of noisy sensors and methods to overcome them. We then describe a short deployment of BreakSense within our lab that examined bound vs. unbound augmented breaks and how they affect users' sense of completion and readiness to work.",
  "authors": [
    {
      "name": "Scott A. Cambo",
      "institution": "FXPAL & Northwestern University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080799",
      "orcid": "missing"
    },
    {
      "name": "Daniel Avrahami",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367734",
      "orcid": "missing"
    },
    {
      "name": "Matthew L. Lee",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81372592158/rel-imgonly/lee_m.jpg.jpeg",
      "acmid": "81372592158",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Daniel Avrahami, and Jennifer Marlow. 2016. Staying the Course: System-Driven Lapse Management for Supporting Behavior Change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1072--1083. https://doi.org/10.1145/2858036.2858142",
      "doi": "10.1145/2858036.2858142"
    },
    {
      "text": "Pradeep Buddharaju and Yokeshwaran Lokanathan. 2016. Mobile Exergaming: Exergames on the Go. In Proceedings of the International Conference on Mobile Software Engineering and Systems (MOBILESoft '16), 25--26. https://doi.org/10.1145/2897073.2897125",
      "doi": "10.1145/2897073.2897125"
    },
    {
      "text": "Derek Burkland. 2013. The Effects of Taking a Short Break: Task Difficulty, Need for Recovery and Task Performance.",
      "doi": ""
    },
    {
      "text": "Anjana Chatta, Tyler Hurst, Gayani Samaraweera, Rongkai Guo, and John Quarles. 2015. Get off the Couch: An Approach to Utilize Sedentary Commercial Games As Exergames. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '15), 47--56. https://doi.org/10.1145/2793107.2793115",
      "doi": "10.1145/2793107.2793115"
    },
    {
      "text": "James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. 2015. No Longer Wearing: Investigating the Abandonment of Personal Health-tracking Technologies on Craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 647--658. https://doi.org/10.1145/2750858.2807554",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Laura A. Clemente, Andrew J. Davidson, Ian D. Reid, José Neira, and Juan D. Tardós. 2007. Mapping Large Loops with a Single Hand-Held Camera. Robotics: Science and Systems 2: 2.",
      "doi": ""
    },
    {
      "text": "Vicki S. Conn, Adam R. Hafdahl, Pamela S. Cooper, Lori M. Brown, and Sally L. Lusk. 2009. Meta-Analysis of Workplace Physical Activity Interventions. American journal of preventive medicine 37, 4: 330--339. https://doi.org/10.1016/j.amepre.2009.06.008 ",
      "doi": ""
    },
    {
      "text": "Dean Cooley and Scott Pedersen. 2013. A pilot study of increasing nonpurposeful movement breaks at work as a means of reducing prolonged sitting. Journal of environmental and public health 2013. ",
      "doi": ""
    },
    {
      "text": "Matthew Cooper, Jacob Biehl, Gerry Filby, and Sven Kratz. 2016. LoCo: boosting for indoor location classification combining Wi-Fi and BLE. Personal and Ubiquitous Computing 20, 1: 83--96.  ",
      "doi": "10.1007/s00779-015-0899-z"
    },
    {
      "text": "Daniel A. Epstein, Daniel Avrahami, and Jacob T. Biehl. 2016. Taking 5: Work-Breaks, Productivity, and Opportunities for Personal Informatics for Knowledge Workers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 673--684. https://doi.org/10.1145/2858036.2858066",
      "doi": "10.1145/2858036.2858066"
    },
    {
      "text": "James Fogarty, Scott E Hudson, Christopher G Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1: 119--146.",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "BJ Fogg. 2009. A Behavior Model for Persuasive Design. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive '09), 40:1--40:7. https://doi.org/10.1145/1541948.1541999",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Nanna Gorm and Irina Shklovski. 2016. Steps, Choices and Moral Accounting: Observations from a StepCounting Campaign in the Workplace. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 148--159. https://doi.org/10.1145/2818048.2819944",
      "doi": "10.1145/2818048.2819944"
    },
    {
      "text": "Nanna Gorm and Irina Shklovski. 2016. Sharing Steps in the Workplace: Changing Privacy Concerns Over Time. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4315--4319. https://doi.org/10.1145/2858036.2858352",
      "doi": "10.1145/2858036.2858352"
    },
    {
      "text": "Janne Haverinen and Anssi Kemppainen. 2009. Global indoor self-localization based on the ambient magnetic field. Robotics and Autonomous Systems 57, 10: 1028--1035. https://doi.org/10.1016/j.robot.2009.07.018  ",
      "doi": "10.1016/j.robot.2009.07.018"
    },
    {
      "text": "G. N. Healy, D. W. Dunstan, J. Salmon, E. Cerin, J. E. Shaw, P. Z. Zimmet, and N. Owen. 2008. Breaks in Sedentary Time: Beneficial associations with metabolic risk. Diabetes Care 31, 4: 661--666. https://doi.org/10.2337/dc07--2046 ",
      "doi": ""
    },
    {
      "text": "Robert A Henning, Eric A Callaghan, Anna M Ortega, George V Kissel, Jason I Guttman, and Heather A Braun. 1996. Continuous feedback to promote selfmanagement of rest breaks during computer use. International Journal of Industrial Ergonomics 18, 1: 71--82.",
      "doi": ""
    },
    {
      "text": "Robert A Henning, Pierre Jacques, George V. Kissel, Anne B Sullivan, and Sabina M. Alteras-Webb. 1997. Frequent short rest breaks from computer work: effects on productivity and well-being at two field sites. Ergonomics 40, 1: 78--91.",
      "doi": ""
    },
    {
      "text": "Peter Henry, Michael Krainin, Evan Herbst, Xiaofeng Ren, and Dieter Fox. 2012. RGB-D mapping: Using Kinect-style depth cameras for dense 3D modeling of indoor environments. The International Journal of Robotics Research 31, 5: 647--663.  ",
      "doi": "10.1177/0278364911434148"
    },
    {
      "text": "Jeffrey Hightower, Roy Want, and Gaetano Borriello. 2000. SpotON: An indoor 3D location sensing technology based on RF signal strength. UW CSE 00 02-02, University of Washington, Dept. of Computer Science and Engineering, Seattle, WA 1. Retrieved September 21, 2016 from http://ahvaz.ist.unomaha.edu/azad/temp/sal/00hightower-localization-indoor-3d-rssi-spotontechrep.pdf",
      "doi": ""
    },
    {
      "text": "Institute for Health and Productivity Studies. Physical Activity in the Workplace: A Guide for Employers. Retrieved from http://www.cdc.gov/physicalactivity/worksitepa/index.htm",
      "doi": ""
    },
    {
      "text": "Brett Klika and Chris Jordan. 2013. HIGH-INTENSITY CIRCUIT TRAINING USING BODY WEIGHT: Maximum Results With Minimal Investment. ACSM's Health & Fitness Journal 17, 3: 8--13. https://doi.org/10.1249/FIT.0b013e31828cb1e8 ",
      "doi": ""
    },
    {
      "text": "Ken Leung, Derek Reilly, Kate Hartman, Suzanne Stein, and Emma Westecott. 2012. Limber: DIY Wearables for Reducing Risk of Office Injury. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 85--86. https://doi.org/10.1145/2148131.2148150",
      "doi": "10.1145/2148131.2148150"
    },
    {
      "text": "Andrew Macvean and Judy Robertson. 2013. Understanding Exergame Users' Physical Activity, Motivation and Behavior over Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1251--1260. https://doi.org/10.1145/2470654.2466163",
      "doi": "10.1145/2470654.2466163"
    },
    {
      "text": "Regan L. Mandryk and Kathrin M. Gerling. 2015. Discouraging Sedentary Behaviors Using Interactive Play. interactions 22, 3: 52--55. https://doi.org/10.1145/2744707",
      "doi": "10.1145/2744707"
    },
    {
      "text": "Regan L Mandryk, Kathrin M Gerling, and Kevin G Stanley. 2014. Designing games to discourage sedentary behaviour. In Playful User Interfaces. Springer, 253--274.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Daniel C McFarlane and Kara A Latorella. 2002. The scope and importance of human interruption in humancomputer interaction design. Human-Computer Interaction 17, 1: 1--61.",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Florian 'Floyd' Mueller, Darren Edge, Frank Vetere, Martin R. Gibbs, Stefan Agamanolis, Bert Bongers, and Jennifer G. Sheridan. 2011. Designing Sports: A Framework for Exertion Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2651--2660. https://doi.org/10.1145/1978942.1979330",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "D. Nister, O. Naroditsky, and J. Bergen. 2004. Visual odometry. In Proceedings of the 2004 IEEE Computer Society Conference on Computer Vision and Pattern Recognition, 2004. CVPR 2004, I-652-I-659 Vol.1. https://doi.org/10.1109/CVPR.2004.1315094",
      "doi": ""
    },
    {
      "text": "Derek Reilly, Emma Westecott, David Parker, Samuel Perreault, Derek Neil, Nathan Lapierre, Kate Hartman, and Harjot Bal. 2013. Design-driven Research for Workplace Exergames: The Limber Case Study. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Gamification '13), 123--126. https://doi.org/10.1145/2583008.2583030",
      "doi": "10.1145/2583008.2583030"
    },
    {
      "text": "Ann E Rogers, Wei-Ting Hwang, and Linda D Scott. 2004. The effects of work breaks on staff nurse performance. Journal of Nursing Administration 34, 11: 512--519.",
      "doi": ""
    },
    {
      "text": "Ralf Schwarzer. 2008. Modeling Health Behavior Change: How to Predict and Modify the Adoption and Maintenance of Health Behaviors. Applied Psychology 57, 1: 1--29. https://doi.org/10.1111/j.14640597.2007.00325.x ",
      "doi": ""
    },
    {
      "text": "Meredith M Skeels and Jonathan Grudin. 2009. When social networks cross boundaries: a case study of workplace use of facebook and linkedin. In Proceedings of the ACM 2009 international conference on Supporting group work, 95--104.",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Naomi G Swanson and Steven L Sauter. 1991. The design of rest breaks for video display terminal work: A review of the relavant literature. Journal of Safety Research 21, 4: 166.",
      "doi": ""
    },
    {
      "text": "Ann M Swartz, Leah Squires, and Scott J Strath. 2011. Energy expenditure of interruptions to sedentary behavior. International Journal of Behavioral Nutrition and Physical Activity 8, 1: 69. https://doi.org/10.1186/1479--5868--8--69",
      "doi": ""
    },
    {
      "text": "Wendell C Taylor, Ross Shegog, Vincent Chen, David M Rempel, Marybeth Pappas Baun, Cresendo L Bush, Tomas Green, and Nicole Hare-Everline. 2010. The Booster Break program: description and feasibility test of a worksite physical activity daily practice. Work 37, 4: 433--443.",
      "doi": ""
    },
    {
      "text": "Mark Stephen Tremblay, Rachel Christine Colley, Travis John Saunders, Genevieve Nissa Healy, and Neville Owen. 2010. Physiological and health implications of a sedentary lifestyle. Applied Physiology, Nutrition, and Metabolism = Physiologie Appliquée, Nutrition Et Métabolisme 35, 6: 725--740. https://doi.org/10.1139/H10-079",
      "doi": ""
    },
    {
      "text": "Phillip Tucker, Simon Folkard, and Ian Macdonald. 2003. Rest breaks and accident risk. The Lancet 361, 9358: 680.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 143--146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "World Health Organization. 2010. Healthy workplaces: a model for action: for employers, workers, policymakers and practitioners. WHO Press, Geneva.",
      "doi": ""
    },
    {
      "text": "Kenneth P. Wright, Christopher A. Lowry, and Monique K. LeBourgeois. 2012. Circadian and wakefulness-sleep modulation of cognition in humans. Frontiers in Molecular Neuroscience 5. https://doi.org/10.3389/fnmol.2012.00050 ",
      "doi": ""
    },
    {
      "text": "Han Xu, Zheng Yang, Zimu Zhou, Longfei Shangguan, Ke Yi, and Yunhao Liu. 2016. Indoor Localization via Multi-modal Sensing on Smartphones. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16), 208--219. https://doi.org/10.1145/2971648.2971668",
      "doi": "10.1145/2971648.2971668"
    },
    {
      "text": "Doohee Yun, Hyunseok Chang, and T. V. Lakshman. 2014. Accelerating Vision-based 3D Indoor Localization by Distributing Image Processing over Space and Time. In Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology (VRST '14), 77--86. https://doi.org/10.1145/2671015.2671018",
      "doi": "10.1145/2671015.2671018"
    },
    {
      "text": "EyeLeo. Retrieved September 21, 2016 from http://eyeleo.com/",
      "doi": ""
    },
    {
      "text": "Take A Break! Meditation Oasis. Retrieved September 21, 2016 from http://www.meditationoasis.com/apps/",
      "doi": ""
    },
    {
      "text": "Android Beacon Library. Retrieved September 20, 2016 from https://altbeacon.github.io/android-beaconlibrary/",
      "doi": ""
    },
    {
      "text": "Parse. Parse Open Source Hub. Retrieved September 21, 2016 from http://parseplatform.github.io/",
      "doi": ""
    },
    {
      "text": "BeaconOSX. GitHub. Retrieved September 21, 2016 from https://github.com/mttrb/BeaconOSX",
      "doi": ""
    }
  ]
}