{
  "doi": "10.1145/3025453.3025706",
  "title": "User Interactions and Permission Use on Android",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "362-373",
  "year": 2017,
  "badges": [],
  "abstract": "Android and other mobile operating systems ask users for authorization before allowing apps to access sensitive resources such as contacts and location. We hypothesize that such authorization systems could be improved by becoming more integrated with the app's user interface. In this paper, we conduct two studies to test our hypothesis. First, we use apptracer{}, a dynamic analysis tool we developed, to measure to what extent user interactions and sensitive resource use are related in existing apps. Second, we conduct an online survey to examine how different interactions with the UI affect users' expectations about whether an app accesses sensitive resources. Our results suggest that user interactions such as button clicks can be interpreted as authorization, reducing the need for separate requests; but that accesses not directly tied to user interactions should be separately authorized, possibly when apps are first launched.",
  "tags": [
    "android",
    "permissions",
    "apps",
    "contextual security"
  ],
  "authors": [
    {
      "name": "Kristopher Micinski",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548302656",
      "orcid": "missing"
    },
    {
      "name": "Daniel Votipka",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488669410",
      "orcid": "missing"
    },
    {
      "name": "Rock Stevens",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161155",
      "orcid": "missing"
    },
    {
      "name": "Nikolaos Kofinas",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658680925",
      "orcid": "missing"
    },
    {
      "name": "Michelle L. Mazurek",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641915",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey S. Foster",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81338488852/rel-imgonly/jeff-foster.jpg",
      "acmid": "81338488852",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2012. How to Ask for Permission. In Presented as part of the 7th USENIX Workshop on Hot Topics in Security. USENIX, Berkeley, CA. https://www.usenix.org/conference/hotsec12/workshopprogram/presentation/Felt",
      "doi": ""
    },
    {
      "text": "Hirotugu Akaike. 1974. A new look at the statistical model identification. Automatic Control, IEEE Transactions on 19, 6 (06 Dec. 1974), 716--723. DOI: http://dx.doi.org/10.1109/tac.1974.1100705 ",
      "doi": ""
    },
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your Location Has Been Shared 5,398 Times!: A Field Study on Mobile App Privacy Nudging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 787--796. DOI: http://dx.doi.org/10.1145/2702123.2702210  ",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Kathy Wain Yee Au, Yi Fan Zhou, Zhen Huang, and David Lie. 2012. PScout: Analyzing the Android Permission Specification. In Proceedings of the 2012 ACM Conference on Computer and Communications Security (CCS '12). ACM, New York, NY, USA, 217--228. DOI:http://dx.doi.org/10.1145/2382196.2382222  ",
      "doi": "10.1145/2382196.2382222"
    },
    {
      "text": "Rebecca Balebako, Jaeyeon Jung, Wei Lu, Lorrie Faith Cranor, and Carolyn Nguyen. 2013. \"Little Brothers Watching You\": Raising Awareness of Data Leaks on Smartphones. In Proceedings of the Ninth Symposium on Usable Privacy and Security (SOUPS '13). ACM, New York, NY, USA, Article 12, 11 pages. DOI: http://dx.doi.org/10.1145/2501604.2501616  ",
      "doi": "10.1145/2501604.2501616"
    },
    {
      "text": "Sven Bugiel, Stephen Heuser, and Ahmad-Reza Sadeghi. 2013. Flexible and Fine-grained Mandatory Access Control on Android for Diverse Security and Privacy Policies. In Proceedings of the 22nd USENIX Security Symposium (USENIX Security '13). USENIX, Washington, D.C., 131--146. https://www.usenix.org/conference/usenixsecurity13/ technical-sessions/presentation/bugiel",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data? Perspectives on Psychological Science 6, 1 (2011), 3--5. DOI:http://dx.doi.org/10.1177/1745691610393980 ",
      "doi": ""
    },
    {
      "text": "Kevin Zhijie Chen, Noah M. Johnson, Vijay D'Silva, Shuaifu Dai, Kyle MacNamara, Thomas R. Magrino, Edward XueJun Wu, Martin Rinard, and Dawn Xiaodong Song. 2013. Contextual Policy Enforcement in Android Applications with Permission Event Graphs. In 20th Annual Network and Distributed System Security Symposium, NDSS 2013. Internet Society, San Diego, California, USA. http://internetsociety.org/doc/contextual-policyenforcement-android-applications-permission-eventgraphs",
      "doi": ""
    },
    {
      "text": "Julie S. Downs, Mandy B. Holbrook, Steve Sheng, and Lorrie Faith Cranor. 2010. Are Your Participants Gaming the System?: Screening Mechanical Turk Workers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2399--2402. DOI: http://dx.doi.org/10.1145/1753326.1753688  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Adrienne Porter Felt, Erika Chin, Steve Hanna, Dawn Song, and David Wagner. 2011. Android Permissions Demystified. In Proceedings of the 18th ACM Conference on Computer and Communications Security (CCS '11). ACM, New York, NY, USA, 627--638. DOI: http://dx.doi.org/10.1145/2046707.2046779  ",
      "doi": "10.1145/2046707.2046779"
    },
    {
      "text": "Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012a. I've Got 99 Problems, but Vibration Ain't One: A Survey of Smartphone Users' Concerns. In Proceedings of the Second ACM Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM '12). ACM, New York, NY, USA, 33--44. DOI: http://dx.doi.org/10.1145/2381934.2381943  ",
      "doi": "10.1145/2381934.2381943"
    },
    {
      "text": "Adrienne Porter Felt, Elizabeth Ha, Serge Egelman, Ariel Haney, Erika Chin, and David Wagner. 2012b. Android Permissions: User Attention, Comprehension, and Behavior. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, New York, NY, USA, Article 3, 14 pages. DOI: http://dx.doi.org/10.1145/2335356.2335360  ",
      "doi": "10.1145/2335356.2335360"
    },
    {
      "text": "Huiqing Fu, Yulong Yang, Nileema Shingte, Janne Lindqvist, and Marco Gruteser. 2014. A field study of run-time location access disclosures on android smartphones. In Workshop on Usable Security (USEC). Internet Society, San Diego, California, USA. ",
      "doi": ""
    },
    {
      "text": "Google 2016. Requesting Permissions at Run Time. Google. https://developer.android.com/training/ permissions/requesting.html",
      "doi": ""
    },
    {
      "text": "Andrew F Hayes and Klaus Krippendorff. 2007. Answering the call for a standard reliability measure for coding data. Communication methods and measures 1, 1 (2007), 77--89. http://dx.doi.org/10.1080/19312450709336664 ",
      "doi": ""
    },
    {
      "text": "Donald Hedeker. 2008. Multilevel models for ordinal and nominal variables. In Handbook of multilevel analysis. Springer, 237--274. http://link.springer.com/chapter/10.1007/978-0--38773186--5_6 ",
      "doi": ""
    },
    {
      "text": "Jinseong Jeon, Kristopher K. Micinski, Jeffrey A. Vaughan, Ari Fogel, Nikhilesh Reddy, Jeffrey S. Foster, and Todd Millstein. 2012. Dr. Android and Mr. Hide: Fine-grained Permissions in Android Applications. In ACM CCS Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM). ACM, Raleigh, NC, USA, 3--14.  ",
      "doi": "10.1145/2381934.2381938"
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In Proceedings of the 23rd USENIX Security Symposium (USENIX Security '14). USENIX Association, San Diego, California, USA, 37--49. https://www.usenix.org/conference/soups2014/ proceedings/presentation/kang",
      "doi": ""
    },
    {
      "text": "Jennifer King. 2012. \"How Come I'm Allowing Strangers To Go Through My Phone?\": Smartphones and Privacy Expectations. In Proceedings of the Ninth Symposium on Usable Privacy and Security (SOUPS '12). USENIX, Washington, DC, USA. http: //papers.ssrn.com/sol3/papers.cfm?abstract_id=2493412",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 453--456. DOI: http://dx.doi.org/10.1145/1357054.1357127  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kristopher Micinski, Jonathan Fetter-Degges, Jinseong Jeon, Jeffrey S. Foster, and Michael R. Clarkson. 2015. Checking Interaction-Based Declassification Policies for Android Using Symbolic Execution. Springer International Publishing, Vienna, Austria, 520--538. DOI: http://dx.doi.org/10.1007/978--3--319--24177--7_26",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as Contextual Integrity. Washington Law Review 79 (2004), 119--157.",
      "doi": ""
    },
    {
      "text": "Ashwini Rao, Florian Schaub, Norman Sadeh, Alessandro Acquisti, and Ruogu Kang. 2016. Expecting the Unexpected: Understanding Mismatched Privacy Expectations Online. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO, 77--96. https://www.usenix.org/conference/soups2016/technicalsessions/presentation/rao",
      "doi": ""
    },
    {
      "text": "Android Developers Reference. 2016. Manifest.permission_group. (2016). https://developer. android.com/guide/topics/security/permissions.html (Accessed 9--16--2016).",
      "doi": ""
    },
    {
      "text": "Talia Ringer, Dan Grossman, and Franziska Roesner. 2016. AUDACIOUS: User-Driven Access Control with Unmodified Operating Systems. In Proceedings of the 23rd ACM Conference on Computer and Communications Security. ACM, Vienna, Austria. http://tlringer.github.io/pdf/audacious.pdf  ",
      "doi": "10.1145/2976749.2978344"
    },
    {
      "text": "Franziska Roesner and Tadayoshi Kohno. 2013. Securing Embedded User Interfaces: Android and Beyond. In Proceedings of the 22nd USENIX Security Symposium (USENIX Security '13). USENIX, Washington, D.C., 97--112. https://www.usenix.org/conference/usenixsecurity13/ technical-sessions/presentation/roesner",
      "doi": ""
    },
    {
      "text": "Franziska Roesner, Tadayoshi Kohno, Alexander Moshchuk, Bryan Parno, Helen J. Wang, and Crispin Cowan. 2012. User-Driven Access Control: Rethinking Permission Granting in Modern Operating Systems. In Proceedings of the 2012 IEEE Symposium on Security and Privacy (SP '12). IEEE Computer Society, Washington, DC, USA, 224--238. DOI: http://dx.doi.org/10.1109/SP.2012.24  ",
      "doi": "10.1109/SP.2012.24"
    },
    {
      "text": "Stuart E Schechter, Rachna Dhamija, Andy Ozment, and Ian Fischer. The Emperor's New Security Indicators. In Proceedings of the 2007 IEEE Symposium on Security and Privacy.",
      "doi": ""
    },
    {
      "text": "Marc Stiegler, Alan H. Karp, Ka-Ping Yee, Tyler Close, and Mark S. Miller. 2006. Polaris: Virus-safe Computing for Windows XP. Commun. ACM 49, 9 (Sept. 2006), 83--88. DOI:http://dx.doi.org/10.1145/1151030.1151033  ",
      "doi": "10.1145/1151030.1151033"
    },
    {
      "text": "Marc Stiegler and Mark S. Miller. 2002. A Capability-based Client: The DarpaBrowser. Technical Report Technical Report, Focused Research Topic 5. Combex Inc, Meadowbrook, PA. http://www.combex.com/papers/darpareport/index.html",
      "doi": ""
    },
    {
      "text": "Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri, and Lorrie Faith Cranor. 2009. Crying Wolf An Empirical Study of SSL Warning Effectiveness.. In Proceedings of the 18th USENIX Security Symposium. {}https://www.usenix.org/legacy/events/sec09/tech/ full_papers/sunshine.",
      "doi": ""
    },
    {
      "text": "Michael Toomim, Travis Kriplean, Claus Pörtner, and James Landay. 2011. Utility of Human-computer Interactions: Toward a Science of Preference Measurement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2275--2284. DOI: http://dx.doi.org/10.1145/1978942.1979277  ",
      "doi": "10.1145/1978942.1979277"
    },
    {
      "text": "Primal Wijesekera, Arjun Baokar, Ashkan Hosseini, Serge Egelman, David Wagner, and Konstantin Beznosov. 2015. Android Permissions Remystified: A Field Study on Contextual Integrity. In Proceedings of the 24th USENIX Security Symposium (USENIX Security '15). USENIX Association, Washington, D.C., 499--514. https://www.usenix.org/conference/usenixsecurity15/ technical-sessions/presentation/wijesekera",
      "doi": ""
    },
    {
      "text": "Zhemin Yang, Min Yang, Yuan Zhang, Guofei Gu, Peng Ning, and X. Sean Wang. 2013. AppIntent: analyzing sensitive data transmission in android for privacy leakage detection. In Proceedings of the 2013 ACM SIGSAC conference on Computer and Communications Security (CCS '13). ACM, New York, NY, USA, 1043--1054. DOI: http://dx.doi.org/10.1145/2508859.2516676  ",
      "doi": "10.1145/2508859.2516676"
    }
  ]
}