{
  "doi": "10.1145/3025453.3025601",
  "title": "Robust Gaze Features for Enabling Language Proficiency Awareness",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2998-3010",
  "year": 2017,
  "badges": [],
  "abstract": "We are often confronted with information interfaces designed in an unfamiliar language, especially in an increasingly globalized world, where the language barrier inhibits interaction with the system. In our work, we explore the design space for building interfaces that can detect the user's language proficiency. Specifically, we look at how a user's gaze properties can be used to detect whether the interface is presented in a language they understand. We report a study (N=21) where participants were presented with questions in multiple languages, whilst being recorded for gaze behavior. We identified fixation and blink durations to be effective indicators of the participants' language proficiencies. Based on these findings, we propose a classification scheme and technical guidelines for enabling language proficiency awareness on information displays using gaze data.",
  "authors": [
    {
      "name": "Jakob Karolus",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658725717",
      "orcid": "missing"
    },
    {
      "name": "Paweł W. Wozniak",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    },
    {
      "name": "Lewis L. Chuang",
      "institution": "Max Planck Institute for Biological Cybernetics, Tuebingen, Baden-Wuerttemberg, Germany",
      "img": "/do/10.1145/contrib-81100637067/rel-imgonly/social-media.jpg",
      "acmid": "81100637067",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Florian Alt, Andreas Bulling, Gino Gravanis, and Daniel Buschek. 2015. GravitySpot: Guiding Users in Front of Public Displays Using On-Screen Visual Cues. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, NY, NY, USA, 47--56. DOI: http://dx.doi.org/10.1145/2807442.2807490  ",
      "doi": "10.1145/2807442.2807490"
    },
    {
      "text": "Florian Alt, Alireza Sahami Shirazi, Albrecht Schmidt, and Julian Mennenöh. 2012. Increasing the User's Attention on the Web: Using Implicit Interaction Based on Gaze Behavior to Tailor Content. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 544--553. DOI: http://dx.doi.org/10.1145/2399016.2399099  ",
      "doi": "10.1145/2399016.2399099"
    },
    {
      "text": "Ralf Biedert, Georg Buscher, Sven Schwarz, Jörn Hees, and Andreas Dengel. 2010. Text 2.0. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 4003--4008. DOI: http://dx.doi.org/10.1145/1753846.1754093  ",
      "doi": "10.1145/1753846.1754093"
    },
    {
      "text": "Björn Browatzki, Heinrich H. Bülthoff, and Lewis L. Chuang. 2014. A Comparison of Geometric- and Regression-Based Mobile Gaze-Tracking. Frontiers in Human Neuroscience 8 (April 2014). DOI: http://dx.doi.org/10.3389/fnhum.2014.00200 ",
      "doi": ""
    },
    {
      "text": "Andreas Bulling, Daniel Roggen, and Gerhard Tröster. 2008. It's in Your Eyes: Towards Context-Awareness and Mobile HCI Using Wearable EOG Goggles. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08). ACM, NY, NY, USA, 84--93. DOI: http://dx.doi.org/10.1145/1409635.1409647  ",
      "doi": "10.1145/1409635.1409647"
    },
    {
      "text": "Andreas Bulling, Jamie A. Ward, Hans Gellersen, and Gerhard Tröster. 2009. Eye Movement Analysis for Activity Recognition. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp '09). ACM, NY, NY, USA, 41--50. DOI: http://dx.doi.org/10.1145/1620545.1620552  ",
      "doi": "10.1145/1620545.1620552"
    },
    {
      "text": "Shiwei Cheng, Zhiqiang Sun, Lingyun Sun, Kirsten Yee, and Anind K. Dey. 2015. Gaze-Based Annotations for Reading Comprehension. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1569--1572. DOI: http://dx.doi.org/10.1145/2702123.2702271  ",
      "doi": "10.1145/2702123.2702271"
    },
    {
      "text": "Council of Europe. 2001. Common European Framework of Reference for Languages: Learning, Teaching, Assessment. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Guy Deutscher. 2006. The Unfolding of Language: An Evolutionary Tour of Mankind's Greatest Invention. Henry Holt and Company.",
      "doi": ""
    },
    {
      "text": "Sidney D'Mello, Andrew Olney, Claire Williams, and Patrick Hays. 2012. Gaze Tutor: A Gaze-Reactive Intelligent Tutoring System. International Journal of Human-Computer Studies 70, 5 (May 2012), 377--398. DOI:http://dx.doi.org/10.1016/j.ijhcs.2012.01.004  ",
      "doi": "10.1016/j.ijhcs.2012.01.004"
    },
    {
      "text": "Heiko Drewes and Albrecht Schmidt. 2007. Interacting with the Computer Using Gaze Gestures. In Proceedings of the 11th IFIP TC 13 International Conference on Human-Computer Interaction - Volume Part II (INTERACT'07). Springer-Verlag, Berlin, Heidelberg, 475--488. DOI: http://dx.doi.org/10.1007/978--3--540--74800--7_43",
      "doi": "10.5555/1778331.1778385"
    },
    {
      "text": "Andrew T. Duchowski, Nathan Cournia, and Hunter Murphy. 2004. Gaze-Contingent Displays: A Review. Cyberpsychology & Behavior: The Impact of the Internet, Multimedia and Virtual Reality on Behavior and Society 7, 6 (Dec. 2004), 621--634. DOI: http://dx.doi.org/10.1089/cpb.2004.7.621 ",
      "doi": ""
    },
    {
      "text": "Rong-En Fan, Kai-Wei Chang, Cho-Jui Hsieh, Xiang-Rui Wang, and Chih-Jen Lin. 2008. LIBLINEAR - A Library for Large Linear Classification. (2008). http://www.csie.ntu.edu.tw/~cjlin/liblinear/ The Weka classifier works with version 1.33 of LIBLINEAR.",
      "doi": ""
    },
    {
      "text": "Matt Feusner and Brian Lukoff. 2008. Testing for Statistically Significant Differences Between Groups of Scan Patterns. In Proceedings of the 2008 Symposium on Eye Tracking Research & Applications (ETRA '08). ACM, 43--46. DOI:http://dx.doi.org/10.1145/1344471.1344481  ",
      "doi": "10.1145/1344471.1344481"
    },
    {
      "text": "Tom Foulsham, Joey T. Cheng, Jessica L. Tracy, Joseph Henrich, and Alan Kingstone. 2010. Gaze Allocation in a Dynamic Situation: Effects of Social Status and Speaking. Cognition 117, 3 (Dec. 2010), 319--331. DOI: http://dx.doi.org/10.1016/j.cognition.2010.09.003 ",
      "doi": ""
    },
    {
      "text": "Joseph H Goldberg and Xerxes P Kotval. 1999. Computer Interface Evaluation Using Eye Movements: Methods and Constructs. International Journal of Industrial Ergonomics 24, 6 (Oct. 1999), 631--645. DOI: http://dx.doi.org/10.1016/S0169--8141(98)00068--7",
      "doi": ""
    },
    {
      "text": "Brian Guenter, Mark Finch, Steven Drucker, Desney Tan, and John Snyder. 2012. Foveated 3D Graphics. ACM Trans. Graph. 31, 6 (Nov. 2012), 164:1--164:10. DOI: http://dx.doi.org/10.1145/2366145.2366183  ",
      "doi": "10.1145/2366145.2366183"
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA Data Mining Software: An Update. SIGKDD Explor. Newsl. 11, 1 (Nov. 2009), 10--18. DOI: http://dx.doi.org/10.1145/1656274.1656278  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Lotta Hirvenkari, Johanna Ruusuvuori, Veli-Matti Saarinen, Maari Kivioja, Anssi Peräkylä, and Riitta Hari. 2013. Influence of Turn-Taking in a Two-Person Conversation on the Gaze of a Viewer. PLoS ONE 8, 8 (Aug. 2013). DOI: http://dx.doi.org/10.1371/journal.pone.0071569 ",
      "doi": ""
    },
    {
      "text": "Kenneth Holmqvist, Marcus Nyström, Richard Andersson, Richard Dewhurst, Halszka Jarodzka, and Joost van de Weijer. 2011. Eye Tracking: A Comprehensive Guide to Methods and Measures. OUP Oxford.",
      "doi": ""
    },
    {
      "text": "Aulikki Hyrskykari, Päivi Majaranta, Antti Aaltonen, and Kari-Jouko Räihä. 2000. Design Issues of iDICT: A Gaze-Assisted Translation Aid. In Proceedings of the 2000 Symposium on Eye Tracking Research & Applications (ETRA '00). ACM, NY, NY, USA, 9--14. DOI:http://dx.doi.org/10.1145/355017.355019  ",
      "doi": "10.1145/355017.355019"
    },
    {
      "text": "Aulikki Hyrskykari, Päivi Majaranta, and Kari-Jouko Räihä. 2003. Proactive Response to Eye Movements. In INTERACT, Vol. 3. IOS press Amsterdam, 129--136.",
      "doi": ""
    },
    {
      "text": "Halszka Jarodzka, Kenneth Holmqvist, and Marcus Nyström. 2010. A Vector-based, Multidimensional Scanpath Similarity Measure. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (ETRA '10). ACM, 211--218. DOI: http://dx.doi.org/10.1145/1743666.1743718  ",
      "doi": "10.1145/1743666.1743718"
    },
    {
      "text": "Marcel A. Just and Patricia A. Carpenter. 1980. A Theory of Reading: From Eye Fixations to Comprehension. Psychological review 87, 4 (1980), 329.",
      "doi": ""
    },
    {
      "text": "Pawel Kasprowski and Katarzyna Harezlak. 2016. Implicit Calibration Using Predicted Gaze Targets. In Proceedings of the Ninth Biennial ACM Symposium on Eye Tracking Research & Applications (ETRA '16). ACM, 245--248. DOI: http://dx.doi.org/10.1145/2857491.2857511  ",
      "doi": "10.1145/2857491.2857511"
    },
    {
      "text": "Dagmar Kern, Paul Marshall, and Albrecht Schmidt. 2010. Gazemarks: Gaze-Based Visual Placeholders to Ease Attention Switching. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2093--2102. DOI: http://dx.doi.org/10.1145/1753326.1753646  ",
      "doi": "10.1145/1753326.1753646"
    },
    {
      "text": "Mohamed Khamis, Ozan Saltuk, Alina Hang, Katharina Stolz, Andreas Bulling, and Florian Alt. 2016. TextPursuits: Using Text for Pursuits-Based Interaction and Calibration on Public Displays. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, NY, NY, USA, 274--285. DOI: http://dx.doi.org/10.1145/2971648.2971679  ",
      "doi": "10.1145/2971648.2971679"
    },
    {
      "text": "Kai Kunze, Katsutoshi Masai, Masahiko Inami, Ömer Sacakli, Marcus Liwicki, Andreas Dengel, Shoya Ishimaru, and Koichi Kise. 2015. Quantifying Reading Habits: Counting How Many Words You Read. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 87--96. DOI: http://dx.doi.org/10.1145/2750858.2804278  ",
      "doi": "10.1145/2750858.2804278"
    },
    {
      "text": "Päivi Majaranta and Kari-Jouko Räihä. 2002. Twenty Years of Eye Typing: Systems and Design Issues. In Proceedings of the 2002 Symposium on Eye Tracking Research & Applications (ETRA '02). ACM, NY, NY, USA, 15--22. DOI: http://dx.doi.org/10.1145/507072.507076  ",
      "doi": "10.1145/507072.507076"
    },
    {
      "text": "Linda Marschner, Sebastian Pannasch, Johannes Schulz, and Sven-Thomas Graupner. 2015. Social Communication with Virtual Agents: The Effects of Body and Gaze Direction on Attention and Emotional Responding in Human Observers. International Journal of Psychophysiology 97, 2 (Aug. 2015), 85--92. DOI: http://dx.doi.org/10.1016/j.ijpsycho.2015.05.007 ",
      "doi": ""
    },
    {
      "text": "Pascual Martínez-Gómez and Akiko Aizawa. 2014. Recognition of Understanding Level and Language Skill Using Measurements of Reading Behavior. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, NY, NY, USA, 95--104. DOI: http://dx.doi.org/10.1145/2557500.2557546  ",
      "doi": "10.1145/2557500.2557546"
    },
    {
      "text": "Michael Mauderer, David R. Flatla, and Miguel A. Nacenta. 2016. Gaze-Contingent Manipulation of Color Perception. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5191--5202. DOI: http://dx.doi.org/10.1145/2858036.2858320  ",
      "doi": "10.1145/2858036.2858320"
    },
    {
      "text": "Jörg Müller, Florian Alt, Daniel Michelis, and Albrecht Schmidt. 2010. Requirements and Design Space for Interactive Public Displays. In Proceedings of the 18th ACM International Conference on Multimedia (MM '10). ACM, NY, NY, USA, 1285--1294. DOI: http://dx.doi.org/10.1145/1873951.1874203  ",
      "doi": "10.1145/1873951.1874203"
    },
    {
      "text": "Ayano Okoso, Takumi Toyama, Kai Kunze, Joachim Folz, Marcus Liwicki, and Koichi Kise. 2015. Towards Extraction of Subjective Reading Incomprehension: Analysis of Eye Gaze Features. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 1325--1330. DOI: http://dx.doi.org/10.1145/2702613.2732896  ",
      "doi": "10.1145/2702613.2732896"
    },
    {
      "text": "Ross Quinlan. 1993. C4.5: Programs for Machine Learning. Morgan Kaufmann Publishers, San Mateo, CA.",
      "doi": "10.5555/152181"
    },
    {
      "text": "Pernilla Qvarfordt and Shumin Zhai. 2005. Conversing with the User Based on Eye-Gaze Patterns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 221--230. DOI: http://dx.doi.org/10.1145/1054972.1055004  ",
      "doi": "10.1145/1054972.1055004"
    },
    {
      "text": "K. Rayner. 1998. Eye Movements in Reading and Information Processing: 20 Years of Research. Psychological Bulletin 124, 3 (Nov. 1998), 372--422. ",
      "doi": ""
    },
    {
      "text": "Keith Rayner, Timothy J. Slattery, and Nathalie N. Bélanger. 2010. Eye Movements, the Perceptual Span, and Reading Speed. Psychonomic bulletin & review 17, 6 (2010), 834--839. DOI: http://dx.doi.org/10.3758/PBR.17.6.834 ",
      "doi": ""
    },
    {
      "text": "Erik D. Reichle, Alexander Pollatsek, Donald L. Fisher, and Keith Rayner. 1998. Toward a Model of Eye Movement Control in Reading. Psychological Review 105, 1 (1998), 125--157. DOI: http://dx.doi.org/10.1037/0033--295X.105.1.125",
      "doi": ""
    },
    {
      "text": "Dario D. Salvucci and John R. Anderson. 2000. Intelligent Gaze-Added Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 273--280. DOI:http://dx.doi.org/10.1145/332040.332444  ",
      "doi": "10.1145/332040.332444"
    },
    {
      "text": "Dario D. Salvucci and Joseph H. Goldberg. 2000. Identifying Fixations and Saccades in Eye-Tracking Protocols. In Proceedings of the 2000 Symposium on Eye Tracking Research & Applications. ACM, 71--78. DOI: http://dx.doi.org/10.1145/355017.355028  ",
      "doi": "10.1145/355017.355028"
    },
    {
      "text": "Anthony Santella and Doug DeCarlo. 2004. Robust Clustering of Eye Movement Recordings for Quantification of Visual Interest. In Proceedings of the 2004 Symposium on Eye Tracking Research & Applications (ETRA '04). ACM, 27--34. DOI: http://dx.doi.org/10.1145/968363.968368  ",
      "doi": "10.1145/968363.968368"
    },
    {
      "text": "Sara C. Sereno and Keith Rayner. 2003. Measuring Word Recognition in Reading: Eye Movements and Event-Related Potentials. Trends in cognitive sciences 7, 11 (2003), 489--493. DOI: http://dx.doi.org/10.1016/j.tics.2003.09.010 ",
      "doi": ""
    },
    {
      "text": "John L. Sibert, Mehmet Gokturk, and Robert A. Lavine. 2000. The Reading Assistant: Eye Gaze Triggered Auditory Prompting for Reading Remediation. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, NY, NY, USA, 101--107. DOI: http://dx.doi.org/10.1145/354401.354418  ",
      "doi": "10.1145/354401.354418"
    },
    {
      "text": "Linda E. Sibert and Robert J. K. Jacob. 2000. Evaluation of Eye Gaze Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 281--288. DOI: http://dx.doi.org/10.1145/332040.332445  ",
      "doi": "10.1145/332040.332445"
    },
    {
      "text": "Greg J. Siegle, Naho Ichikawa, and Stuart Steinhauer. 2008. Blink before and after You Think: Blinks Occur prior to and Following Cognitive Load Indexed by Pupillary Responses. Psychophysiology 45, 5 (Sept. 2008), 679--687. DOI: http://dx.doi.org/10.1111/j.1469--8986.2008.00681.x",
      "doi": ""
    },
    {
      "text": "William Steptoe, Robin Wolff, Alessio Murgia, Estefania Guimaraes, John Rae, Paul Sharkey, David Roberts, and Anthony Steed. 2008. Eye-Tracking for Avatar Eye-Gaze and Interactional Analysis in Immersive Collaborative Virtual Environments. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 197--200. DOI: http://dx.doi.org/10.1145/1460563.1460593  ",
      "doi": "10.1145/1460563.1460593"
    },
    {
      "text": "Takumi Toyama, Daniel Sonntag, Andreas Dengel, Takahiro Matsuda, Masakazu Iwamura, and Koichi Kise. 2014. A Mixed Reality Head-Mounted Text Translation System Using Eye Gaze Input. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, NY, NY, USA, 329--334. DOI: http://dx.doi.org/10.1145/2557500.2557528  ",
      "doi": "10.1145/2557500.2557528"
    },
    {
      "text": "Roel Vertegaal, Robert Slagter, Gerrit van der Veer, and Anton Nijholt. 2001. Eye Gaze Patterns in Conversations: There Is More to Conversational Agents Than Meets the Eyes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, NY, NY, USA, 301--308. DOI: http://dx.doi.org/10.1145/365024.365119  ",
      "doi": "10.1145/365024.365119"
    },
    {
      "text": "Kazuyo Yoshimura, Koichi Kise, and Kai Kunze. 2015. The Eye as the Window of the Language Ability: Estimation of English Skills by Analyzing Eye Movement While Reading Documents. In Document Analysis and Recognition (ICDAR), 2015 13th International Conference on. IEEE, 251--255. DOI: http://dx.doi.org/10.1109/ICDAR.2015.7333762  ",
      "doi": "10.1109/ICDAR.2015.7333762"
    },
    {
      "text": "Shumin Zhai, Carlos Morimoto, and Steven Ihde. 1999. Manual and Gaze Input Cascaded (MAGIC) Pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, 246--253. DOI:http://dx.doi.org/10.1145/302979.303053  ",
      "doi": "10.1145/302979.303053"
    },
    {
      "text": "Yanxia Zhang, Ming Ki Chong, Jörg Müller, Andreas Bulling, and Hans Gellersen. 2015. Eye Tracking for Public Displays in the Wild. Personal and Ubiquitous Computing 19, 5--6 (Aug. 2015), 967--981. DOI: http://dx.doi.org/10.1007/s00779-015-0866--8",
      "doi": ""
    }
  ]
}