{
  "doi": "10.1145/3025453.3025837",
  "title": "A Design Perspective on Data",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2952-2963",
  "year": 2017,
  "badges": [],
  "abstract": "Empirical studies invariably show that data generation is situationally contingent and interpretively flexible, even when data is collected automatically. This essay situates data generation within a design perspective, demonstrating how data creation can be understood as a multilayered set of interlocking design activities. By showing how data is infused with design, this paper argues that any \"use\" of data represents a continuation of its design. We are always designers of data, never its mere appropriators.",
  "authors": [
    {
      "name": "Melanie Feinberg",
      "institution": "University of North Carolina at Chapel Hill, Chapel Hill, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81477641021",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. Telier. (Thomas Binder, Giorgio De Michelis, Pelle Ehn, Giulio Jacucci, Per Linde and Ina Wagner.) 2011. Design Things. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner and Carl DiSalvo. 2016. Data, Design and civics: an exploratory study of civic tech. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16)., 2970--2981. http://dx.doi.org/10.1145/2858036.2858326  ",
      "doi": "10.1145/2858036.2858326"
    },
    {
      "text": "Geoffrey Bowker. 2000. Biodiversity datadiversity. Social Studies of Science 30, 5: 643--683. ",
      "doi": ""
    },
    {
      "text": "Allyson Carlyle. 2015. The policeman's beard was what? Representation and reality in knowledge organization and description. Proceedings of the iConference 2015. http://hdl.handle.net/2142/73642",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Richard Mortier. 2015. Human data interaction: historical lessons from social studies and CSCW In: Proceedings of the 14th European Conference on Computer Supported Cooperative Work. 1--20. ",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines. 2016. Metadating: exploring the romance and future of personal data. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 685--698. http://dx.doi.org/10.1145/2858036.2858173  ",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Melanie Feinberg. 2015. Genres without writers: information systems and distributed authorship. In Genre Theory in Information Studies, edited by J. Andersen. London: Emerald. ",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer, Andy Crabtree, Tom Rodden, James A. Colley, Enrico Costanza, Michael O. Jewell, and Sarvapali D. Ramchurn. 2016. \"Just whack it on until it gets hot\": working with IoT data in the home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5933--5944. http://dx.doi.org/10.1145/2858036.2858518  ",
      "doi": "10.1145/2858036.2858518"
    },
    {
      "text": "Jonathan Furner. 2010. Philosophy and information studies. Annual Review of Information Science and Technology, 44: 161--200.  ",
      "doi": "10.1002/aris.2010.1440440111"
    },
    {
      "text": "William Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 233--240. http://dx.doi.org/10.1145/642611.642653  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William Gaver, Andy Boucher, Nadine Jarvis, David Cameron, Mark Hauenstein, Sarah Pennington, John Bowers, James Pike, Robin Beitra, and Liliana Ovalle. 2016. The Datacatcher: batch deployment and documentation of 130 location-aware, mobile devices that put sociopolitically-relevant big data in people's hands: polyphonic interpretation at scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1597--1607. http://dx.doi.org/10.1145/2858036.2858472  ",
      "doi": "10.1145/2858036.2858472"
    },
    {
      "text": "Charles Goodwin. 1994. Professional vision. American Anthropologist 96(3): 606--633. ",
      "doi": ""
    },
    {
      "text": "Jane Greenberg. 2009. Metadata and digital information. In Bates, Marcia, and Mary Niles Maack (eds). Encyclopedia of Library and Information Sciences. 3rd ed. CRC Press. ",
      "doi": ""
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: data engagement through physical ambient visualizations in the home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16)., 1608--1619. http://dx.doi.org/10.1145/2858036.2858059  ",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "International Federation of Library Associations (IFLA). 1998. Functional requirements for bibliographic records (FRBR). http://www.ifla.org/files/assets/cataloguing/frbr/frbr_2 008.pdf",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson and Sarah Barbrow. 2015. Standards and/as innovation: protocols, creativity, and interactive systems development in ecology. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1769--1778. http://dx.doi.org/10.1145/2702123.2702564  ",
      "doi": "10.1145/2702123.2702564"
    },
    {
      "text": "Eric Kansa, Sarah Kansa, and Benjamin Arbuckle. 2014. Publishing and pushing: mixing models for communicating research data in archeology. International Journal of Digital Curation 9,1: 57--70. ",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 1999. Pandora's hope: essays on the reality of science studies. Cambridge, MA: Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Jin Ha Lee, Hyerim Cho, Violet Fox, and Andrew Perti. 2013. User-centered approach in creating a metadata schema for video games and interactive media. Proceedings of the 13th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL), 229--238.",
      "doi": "10.1145/2467696.2467702"
    },
    {
      "text": "Jin Ha Lee, Rachel Clarke, and Andrew Perti. 2015. Empirical evaluation of metadata for video games and interactive media. Journal for the Association of Information Science and Technology (JASIST).",
      "doi": "10.1002/asi.23357"
    },
    {
      "text": "Donald McMillan, Arvid Engström, Airi Lampinen, and Barry Brown. 2016. Data and the city. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 2933--2944. http://dx.doi.org/10.1145/2858036.2858434  ",
      "doi": "10.1145/2858036.2858434"
    },
    {
      "text": "Johan Redström. 2008. RE: definitions of use. Design Studies 29:4, 410--23. ",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1163--1172. http://doi.acm.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06), 99--108. http://dx.doi.org/10.1145/1142405.1142422  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Susan Leigh Star and James Griesemer. 1989. Institutional ecology, \"translations\" and boundary objects: amateurs and professionals in Berkeley's Museum of Vertebrate Zoology, 1907--1939. Social Studies of Science 19, 3: 387--420. ",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-place: thinking through the relations between data and community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2863--2872. http://dx.doi.org/10.1145/2702123.2702558  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. \"This has to be the cats\": personal data legibility in networked sensing systems. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 491--502. http://dx.doi.org/10.1145/2818048.2819992  ",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "Cesar Torres, Jasper O'Leary, and Eric Paulos. 2016. LiveObjects: leveraging theatricality for an expressive Internet of Things. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems (DIS '16 Companion), 5--8. http://dx.doi.org/10.1145/2908805.2908807  ",
      "doi": "10.1145/2908805.2908807"
    },
    {
      "text": "Ron Wakkary, Audrey Desjardins, and Sabrina Hauser. 2016. Unselfconscious interaction: a conceptual construct. Interacting With Computers 28, 4: 501--520. ",
      "doi": ""
    },
    {
      "text": "Patrick Wilson. 1968. Two kinds of power: an essay on bibliographic control. Berkeley and Los Angeles: University of CA Press.",
      "doi": ""
    },
    {
      "text": "Peter Worthy, Ben Matthews, and Stephen Viller. 2016. Trust me: doubts and concerns living with the Internet of Things. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 427--434. https://doi.org/10.1145/2901790.2901890",
      "doi": "10.1145/2901790.2901890"
    },
    {
      "text": "Marcia Zeng and Lois Mai Chan. 2009. Semantic interoperability. In Bates, Marcia, and Mary Niles Maack (eds). Encyclopedia of Library and Information Sciences. 3rd ed. CRC Press. ",
      "doi": ""
    }
  ]
}