{
  "doi": "10.1145/3025453.3025643",
  "title": "Informality and Invisibility: Traditional Technologies as Tools for Collaboration in an Informal Market",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4765-4775",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper explores how actors in local markets in the Global South adapt traditional communication technologies to successfully collaborate to sustain the markets and their business practices. Drawing on ethnographic observations at a local technology goods market in Bangalore, India, the study details the use of a landline telephone intercom system as the primary tool for business communication in the market. Through analyzing how the intercom system relates to informality and physical space, the paper argues that it bridges the formal with the informal, and helps facilitate informal business practices while also allowing them to remain hidden from the formal regulatory gaze of the state.",
  "authors": [
    {
      "name": "Priyank Chandra",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714851",
      "orcid": "0000-0003-4024-8871"
    }
  ],
  "references": [
    {
      "text": "Paul Atkinson, Martyn Hammersley, and others. 1994. Ethnography and participant observation. Handbook of qualitative research 1, 23: 248--261.",
      "doi": ""
    },
    {
      "text": "François Bar, Matthew S. Weber, and Francis Pisani. 2016. Mobile technology appropriation in a distant mirror: Baroquization, creolization, and cannibalism. new media & society: 1461444816629474.",
      "doi": ""
    },
    {
      "text": "Jakob E Bardram and Claus Bossen. 2005. Mobility Work: The Spatial Dimension of Collaboration at a Hospital. Computer Supported Cooperative Work (CSCW) 14, 2: 131--160.  ",
      "doi": "10.1007/s10606-005-0989-y"
    },
    {
      "text": "Elisabetta Basile and Barbara Harriss-White. 2010. India's informal capitalism and its regulation. International Review of Sociology 20, 3: 457--471.",
      "doi": ""
    },
    {
      "text": "Libby Bishop. 1999. Visible and invisible work: The emerging post-industrial employment relation. Computer Supported Cooperative Work (CSCW) 8, 1: 115--126.  ",
      "doi": "10.1023/A%3A1008684030375"
    },
    {
      "text": "John Bowers. 1996. Hanging around and making something of it: Ethnography. In Psychological Research: Innovative Methods and Strategies, John Trevor Haworth (ed.). Taylor & Francis US, 120--138.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2012. Invisible users: Youth in the Internet cafés of urban Ghana. Mit Press.",
      "doi": ""
    },
    {
      "text": "Miguel Angel Centeno and Alejandro Portes. 2006. The informal economy in the shadow of the state. Out of the shadows: Political action and the informal economy in Latin America: 23--48.",
      "doi": ""
    },
    {
      "text": "Joanie Connell, Gerald Mendelsohn, Richard Robins, and John Canny. 2001. Don't Hang Up on the Telephone Yet! In ACM Conference on Supporting Group Work (GROUP), 2003.",
      "doi": ""
    },
    {
      "text": "John C Cross and Sergio Peña. 2006. Risk and regulation in informal and illegal markets. Out of the shadows: Political action and the informal economy in Latin America: 49--80.",
      "doi": ""
    },
    {
      "text": "Hernando De Soto. 1990. The other path: The invisible revolution in the third world.",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The Ins and Outs of HCI for Development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 2220--2232.  ",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Jonathan Donner. 2006. The use of mobile phones by microentrepreneurs in Kigali, Rwanda: Changes to social and business networks. Information Technologies & International Development 3, 2: pp--3.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2006. Re-space-ing place: place and space ten years on. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. In Proceedings of the SIGCHI conference on Human Factors in computing systems, 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Thomas Erickson. 1993. From interface to interplace: The spatial environment as a medium for interaction. In Spatial Information Theory A Theoretical Basis for GIS. Springer Berlin Heidelberg, 391--405.",
      "doi": ""
    },
    {
      "text": "Edgar L. Feige. 1990. Defining And Estimating Underground And Informal Economies: The New Institional Economics Approach. World Development 18, 7: 989--1002.",
      "doi": ""
    },
    {
      "text": "Geraldine Fitzpatrick, Simon Kaplan, and Tim Mansfield. 1996. Physical spaces, virtual places and social worlds: A study of work in the virtual. In Proceedings of the 1996 ACM conference on Computer supported cooperative work, 334--343.  ",
      "doi": "10.1145/240080.240322"
    },
    {
      "text": "Matthew H Fleming, John Roman, and Graham Farrell. 2000. The shadow economy. Journal of International Affairs 53, 2: 387--409.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1967. Interaction ritual: essays on face-to-face interaction. Oxford, England.",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. 1985. Economic action and social structure: the problem of embeddedness. American journal of sociology: 481--510.",
      "doi": ""
    },
    {
      "text": "Keith Hart. 1973. Informal income opportunities and urban employment in Ghana. The journal of modern African studies 11, 01: 61--89.",
      "doi": ""
    },
    {
      "text": "Hsain Ilahiane and John Sherry. 2008. Joutia: street vendor entrepreneurship and the informal economy of information and communication technologies in Morocco1. The Journal of North African Studies 13, 2: 243--255.",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson, Syed Ishtiaque Ahmed, and Md. Rashidujjaman Rifat. 2014. Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh. In Proceedings of the 2014 conference on Designing interactive systems, 905--914.  ",
      "doi": "10.1145/2598510.2598576"
    },
    {
      "text": "Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work, 107--116.  ",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Herbert Kubicek and Rose M. Wagner. 2002. Community Networks in a Generational Perspective: The Change of an Electronic Medium Within Three Decades. Information, Communication & Society 5, 3: 291--319.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Tapan S. Parikh. 2013. Mobiles, music, and materiality. In Proceedings of the SIGCHI conference on human factors in computing systems, 2863--2872.  ",
      "doi": "10.1145/2470654.2481396"
    },
    {
      "text": "Helen B. Lamb. 1955. The Indian Business Communities and the Evolution of an Industrialist Class. Pacific Affairs 28, 2: 101.",
      "doi": ""
    },
    {
      "text": "Henri Lefebvre. 1991. The production of space. Oxford Blackwell.",
      "doi": ""
    },
    {
      "text": "Gordon Mathews, Gustavo Lins Ribeiro, and Carlos Alba Vega. 2012. Globalization from Below: The World's Other Economy. Routledge.",
      "doi": ""
    },
    {
      "text": "Nimmi Rangaswamy and Edward Cutrell. 2012. Anthropology, development and ICTs: slums, youth and the mobile internet in urban India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development, 85--93.  ",
      "doi": "10.1145/2160673.2160685"
    },
    {
      "text": "Nimmi Rangaswamy and Melissa Densmore. 2013. Understanding Jugaad: ICTD and the tensions of appropriation, innovation and utility. In Proceedings of the Sixth International Conference on Information and Communications Technologies and Development: Notes-Volume 2, 120--123.  ",
      "doi": "10.1145/2517899.2517938"
    },
    {
      "text": "Nimmi Rangaswamy and Sumitra Nair. 2010. The mobile phone store ecology in a Mumbai slum community: Hybrid networks for enterprise. Information technologies & international development 6, 3: pp--51.",
      "doi": ""
    },
    {
      "text": "Nimmi Rangaswamy and Thomas Smyth. 2012. Assembling and Aggregating Mobile Phones: The Social Ecology of Grey Mobile Phone Markets in Urban India. Proceedings of M4D 2012 28--29 February 2012 New Delhi, India 28, 29: 295.",
      "doi": ""
    },
    {
      "text": "Paul Resnick. 1992. HyperVoice: a phone-based CSCW platform. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work, 218--225.  ",
      "doi": "10.1145/143457.143482"
    },
    {
      "text": "Carlos Rey-Moreno, Amalia G. Sabiescu, and Masbulele Jay Siya. 2014. Towards self-sustaining community networks in rural areas of developing countries: Understanding local ownership. Proceedings of the International Development Informatics Association (IDIA'14): 63--77.",
      "doi": ""
    },
    {
      "text": "Mike Robinson. 1991. Double-level languages and cooperative working. AI & society 5, 1: 34--60.  ",
      "doi": "10.1007/BF01891356"
    },
    {
      "text": "Janet L. Roitman. 1990. The politics of informal markets in sub-Saharan Africa. The Journal of Modern African Studies 28, 04: 671--696.",
      "doi": ""
    },
    {
      "text": "Ester Schiavo, Sergio Rodríguez, and Paula Vera. 2013. Appropriation of ICTs by informal communities in metropolitan cities. The case of the \"La Salada\" market in the Latin American context. The Journal of Community Informatics 9, 3.",
      "doi": ""
    },
    {
      "text": "Adriana de Souza e Silva, Daniel M Sutko, Fernando A Salis, and Claudio de Souza e Silva. 2011. Mobile phone appropriation in the favelas of Rio de Janeiro, Brazil. new media & society 13, 3: 411--426.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1--2: 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Communications of the ACM 38, 9: 56--64.  ",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Hilda Tellioălu and Ina Wagner. 2001. Work Practices Surrounding PACS: The Politics of Space in Hospitals. Computer Supported Cooperative Work (CSCW) 10, 2: 163--188.  ",
      "doi": "10.1023/A%3A1011298824442"
    },
    {
      "text": "Tricia Wang and Barry Brown. 2011. Ethnography of the telephone: changing uses of communication technology in village life. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, 37--46.  ",
      "doi": "10.1145/2037373.2037382"
    },
    {
      "text": "Kristina Westerberg. 1999. Collaborative networks among female middle managers in a hierarchical organization. Computer Supported Cooperative Work (CSCW) 8, 1--2: 95--114.  ",
      "doi": "10.1023/A%3A1008659328558"
    },
    {
      "text": "Susan P. Wyche, Sarita Yardi Schoenebeck, and Andrea Forte. 2013. Facebook is a luxury: An exploratory study of social media use in rural Kenya. In Proceedings of the 2013 conference on Computer supported cooperative work, 33--44.  ",
      "doi": "10.1145/2441776.2441783"
    }
  ]
}