{
  "doi": "10.1145/3025453.3026054",
  "title": "Trajectories of Engagement and Disengagement with a Story-Based Smoking Cessation App",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3045-3056",
  "year": 2017,
  "badges": [],
  "abstract": "Strong user engagement with digital technologies for behaviour change is often taken as a precursor to their longer-term efficacy. We critically examine this assumption through a qualitative study of a smoking cessation app, called NewLeaf, which allows quitters to swap personal stories. The study examined what influenced people to engage or disengage with NewLeaf, and how the app was deployed in quit attempts during a four week trial. Several properties of swapped stories were reported to promote engagement, including: authenticity, currency, contextualization of advice, and evoking a sense of community. But while the resulting engagement was sometimes productive in supporting quitting, other trajectories of use were observed involving counterproductive engagement, and a surprising pattern of productive disengagement especially among stronger quitters. We discuss how this analysis of different trajectories problematizes any simple interpretation of user engagement as an early indicator of success for behaviour change technologies.",
  "authors": [
    {
      "name": "Wally Smith",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324494027",
      "orcid": "0000-0002-1059-6704"
    },
    {
      "name": "Bernd Ploderer",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/do/10.1145/contrib-81311485528/rel-imgonly/bp2017-167a8820portrait.jpg",
      "acmid": "81311485528",
      "orcid": "missing"
    },
    {
      "name": "Greg Wadley",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81309499961/rel-imgonly/greg.jpg",
      "acmid": "81309499961",
      "orcid": "0000-0003-4230-3440"
    },
    {
      "name": "Sarah Webber",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159053057",
      "orcid": "0000-0002-3144-9957"
    },
    {
      "name": "Ron Borland",
      "institution": "Cancer Council Victoria, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324488029",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Lucas Colusso, Sean A. Munson, and Gary Hsieh. 2016. PlanSourcing: Generating Behavior Change Plans with Friends and Crowds. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 119--133. DOI: http://dx.doi.org.ezp.lib.unimelb.edu.au/10.1145/28180 48.2819943",
      "doi": "10.1145/2818048.2819943"
    },
    {
      "text": "Eric P.S. Baumer, Sherri Jean Katz, Jill E. Freeman, et al. 2012. Prescriptive Persuasion and Open-ended Social Awareness: Expanding the Design Space of Mobile Health. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work, ACM, 475--484. http://doi.org/10.1145/2145204.2145279  ",
      "doi": "10.1145/2145204.2145279"
    },
    {
      "text": "Ron Borland. 2013. Understanding Hard to Maintain Behaviour Change: A Dual Process Approach. John Wiley & Sons, Somerset, UK. ",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2, 77--101. ",
      "doi": ""
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably Unpersuaded: How Persuasion Narrows Our Vision of Sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 947--956. http://doi.org/10.1145/2207676.2208539  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity.In Proceedings of 8th International AAAI Conference on Weblogs and Social Media. Retrieved September 22, 2015 from http://www.aaai.org/ocs/index.php/ICWSM/ICWSM14 /paper/view/8075",
      "doi": ""
    },
    {
      "text": "James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. 2015. No Longer Wearing: Investigating the Abandonment of Personal Health-tracking Technologies on Craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 647--658. http://doi.org/10.1145/2750858.2807554  ",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Alan D. DeSantis. 2002. Smoke screen: an ethnographic study of a cigar shop's collective rationalization. Health Communication 14, 2: 167--198. http://doi.org/10.1207/S15327027HC1402_2 ",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems, ACM, 1--10. http://doi.org/10.1145/1858171.1858173  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Epstein, D. A., Caraway, M., Johnston, C., Ping, A., Fogarty, J., and Munson, S. A. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (pp. 1109--1113). ACM.  ",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "B. J. Fogg. 2003. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann, Boston.",
      "doi": "10.5555/2821581"
    },
    {
      "text": "Thomas Fritz, Elaine M. Huang, Gail C. Murphy, and Thomas Zimmermann. 2014. Persuasive Technology in the Real World: A Study of Long-term Use of Activity Sensing Devices for Fitness. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems, ACM, 487--496. http://doi.org/10.1145/2556288.2557383  ",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Melanie C. Green. 2008. Research challenges in narrative persuasion. Information Design Journal 16, 1: 47--52. http://doi.org/10.1075/idj.16.1.07gre ",
      "doi": ""
    },
    {
      "text": "Helen Ai He, Saul Greenberg, and Elaine M. Huang. 2010. One Size Does Not Fit All: Applying the Transtheoretical Model to Energy Feedback Technology Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 927--936. http://doi.org/10.1145/1753326.1753464  ",
      "doi": "10.1145/1753326.1753464"
    },
    {
      "text": "Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the Theoretical Gap: Interpreting, Using, and Developing Behavioral Theory in HCI Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3307--3316. http://doi.org/10.1145/2470654.2466452  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Leslie J. Hinyard and Matthew W. Kreuter. 2007. Using Narrative Communication as a Tool for Health Behavior Change: A Conceptual, Theoretical, and Empirical Overview. Health Education & Behavior 34, 5: 777--792. http://doi.org/10.1177/1090198106291963 ",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3063--3072. http://doi.org/10.1145/1978942.1979396  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Lena Mamykina, Andrew D. Miller, Elizabeth D. Mynatt, and Daniel Greenblatt. 2010. Constructing identities through storytelling in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1203--1212. Retrieved September 22, 2015 from http://dl.acm.org/citation.cfm?id=1753507",
      "doi": "10.1145/1753326.1753507"
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work, ACM, 341--350. http://doi.org/10.1145/1958824.1958876  ",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "O'Brien HL, Toms EG. 2008. What is user engagement? A conceptual framework for defining user engagement with technology. Journal of the American Society for Information Science and Technology, 59(6), 938--55. ",
      "doi": ""
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Mikael B. Skov, Lars Lichon, and Stephan Rasmussen. 2015. Understanding Individual Differences for Tailored Smoking Cessation Apps. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1699--1708. http://doi.org/10.1145/2702123.2702321  ",
      "doi": "10.1145/2702123.2702321"
    },
    {
      "text": "James W. Pennebaker and Janel D. Seagal. 1999. Forming a story: The health benefits of narrative. Journal of clinical psychology 55, 10, 1243--1254. ",
      "doi": ""
    },
    {
      "text": "Bernd Ploderer, Wally Smith, Jon Pearce, and Ron Borland. 2014. A mobile app offering distractions and tips to cope with cigarette craving: A qualitative study. JMIR mHealth and uHealth 2, 2, 1--23. http://doi.org/10.2196/mhealth.3209 ",
      "doi": ""
    },
    {
      "text": "Bernd Ploderer, Wally Smith, Jon Pearce, and Ron Borland. 2015. An Object-Centred Approach to Encourage Online Participation in the Context of Behaviour Change. Computer Supported Cooperative Work (CSCW) 24, 1, 39--6433.  ",
      "doi": "10.1007/s10606-014-9212-3"
    },
    {
      "text": "J. O. Prochaska and W. F. Velicer. 1997. The transtheoretical model of health behavior change. American journal of health promotion: AJHP 12, 1: 38--48. ",
      "doi": ""
    },
    {
      "text": "Corbin Reno and Erika S. Poole. 2016. It Matters If My Friends Stop Smoking: Social Support for Behavior Change in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, NY, NY, USA, 5548--5552. http://dx.doi.org.ezp.lib.unimelb.edu.au/10.1145/28580 36.2858203",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal Tracking As Lived Informatics. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1163--1172. http://doi.org/10.1145/2556288.2557039  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Schane, R. E., Ling, P. M. and Glantz, S. A. Health. 2010. Effects of Light and Intermittent Smoking: A Review. Circulation, 121, 13, 1518--1522.",
      "doi": ""
    },
    {
      "text": "Victoria Schwanda, Steven Ibara, Lindsay Reynolds, and Dan Cosley. 2011. Side Effects and \"Gateway\" Tools: Advocating a Broader Look at Evaluating Persuasive Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 345--348. http://doi.org/10.1145/1978942.1978991  ",
      "doi": "10.1145/1978942.1978991"
    },
    {
      "text": "Katie A. Siek, Gillian R. Hayes, Mark W. Newman, and John C. Tang. 2014. Field Deployments: Knowing from Using in Context. In Ways of Knowing in HCI. Springer, NY, 119--142. ",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2015. Beyond Self-Tracking and Reminders: Designing Smartphone Apps That Support Habit Formation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2653--2662. http://doi.org/10.1145/2702123.2702230  ",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Sutcliffe, A. 2009. Designing for User Engagement: Aesthetic and Attractive User Interfaces. Synthesis Lectures on Human-Centered Informatics, 2, 1, 1--55. ",
      "doi": ""
    },
    {
      "text": "Phil Turner. 2010. The anatomy of engagement. In Proceedings of the 28th Annual European Conference on Cognitive Ergonomics (ECCE '10). ACM, NY, NY, USA, 59--66. DOI=http://dx.doi.org/10.1145/1962300.1962315  ",
      "doi": "10.1145/1962300.1962315"
    },
    {
      "text": "West, R., Hajek, P., Stead, L., and Stapleton, J. 2005. Outcome criteria in smoking cessation trials: proposal for a common standard. Addiction 100, 3, 299--303. ",
      "doi": ""
    },
    {
      "text": "World Health Organisation. 2011. WHO report on the global tobacco epidemic. WHO. Retrieved September 24, 2015 from http://www.who.int/tobacco/global_report/2011/en/",
      "doi": ""
    }
  ]
}