{
  "doi": "10.1145/3025453.3025520",
  "title": "Investigating Tilt-based Gesture Keyboard Entry for Single-Handed Text Entry on Large Devices",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4194-4202",
  "year": 2017,
  "badges": [],
  "abstract": "The popularity of mobile devices with large screens is making single-handed interaction difficult. We propose and evaluate a novel design point around a tilt-based text entry technique which supports single handed usage. Our technique is based on the gesture keyboard (shape writing). However, instead of drawing gestures with a finger or stylus, users articulate a gesture by tilting the device. This can be especially useful when the user's other hand is otherwise encumbered or unavailable. We show that novice users achieve an entry rate of 15 words-per-minute (wpm) after minimal practice. A pilot longitudinal study reveals that a single participant achieved an entry rate of 32 wpm after approximate 90 minutes of practice. Our data indicate that tilt-based gesture keyboard entry enables walk-up use and provides a suitable text entry rate for occasional use and can act as a promising alternative to single-handed typing in certain situations.",
  "authors": [
    {
      "name": "Hui-Shyong Yeo",
      "institution": "University of St Andrews, St Andrews, Fife, United Kingdom",
      "img": "/do/10.1145/contrib-99658693776/rel-imgonly/20150812_183746.jpg",
      "acmid": "99658693776",
      "orcid": "0000-0002-9512-828X"
    },
    {
      "name": "Xiao-Shen Phang",
      "institution": "NEC Corporation of Malaysia, Kuala Lumpur, Malaysia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163050",
      "orcid": "missing"
    },
    {
      "name": "Steven J. Castellucci",
      "institution": "York University, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585002",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    },
    {
      "name": "Aaron Quigley",
      "institution": "University of St Andrews, St Andrews, Fife, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502006",
      "orcid": "0000-0002-5274-6889"
    }
  ],
  "references": [
    {
      "text": "A. S. Arif. 2012. A survey on mobile text entry handedness: How do users input text on handheld devices while nomadic? In Intelligent Human Computer Interaction (IHCI), 2012 4th International Conference on. 1--6. DOI: http://dx.doi.org/10.1109/IHCI.2012.6481818 ",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif, Michel Pahud, Ken Hinckley, and Bill Buxton. 2014. Experimental Study of Stroke Shortcuts for a Touchscreen Keyboard with Gesture-redundant Keys Removed. In Proceedings of Graphics Interface 2014 (GI '14). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 43--50. http://dl.acm.org/citation.cfm?id=2619648.2619657",
      "doi": "10.5555/2619648.2619657"
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 251--260. DOI: http://dx.doi.org/10.1145/2371574.2371612  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the Functional Area of the Thumb on Mobile Touchscreen Surfaces. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1991--2000. DOI: http://dx.doi.org/10.1145/2556288.2557354  ",
      "doi": "10.1145/2556288.2557354"
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1 Euro Filter: A Simple Speed-based Low-pass Filter for Noisy Input in Interactive Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2527--2530. DOI: http://dx.doi.org/10.1145/2207676.2208639  ",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Steven J. Castellucci and I. Scott MacKenzie. 2011. Gathering Text Entry Metrics on Android Devices. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 1507--1512. DOI: http://dx.doi.org/10.1145/1979742.1979799  ",
      "doi": "10.1145/1979742.1979799"
    },
    {
      "text": "Steven J. Castellucci and I. Scott Mackenzie. 2013. Gestural Text Entry Using Huffman Codes. In Proceedings of the International Conference on Multimedia and Human Computer Interaction (ASET '13). 119-1--119-8.",
      "doi": ""
    },
    {
      "text": "Youli Chang, Sehi L'Yi, Kyle Koh, and Jinwook Seo. 2015. Understanding Users' Touch Behavior on Large Mobile Touch-Screens and Assisted Targeting by Tilting Gesture. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1499--1508. DOI: http://dx.doi.org/10.1145/2702123.2702425  ",
      "doi": "10.1145/2702123.2702425"
    },
    {
      "text": "Daniel Fitton, I. Scott MacKenzie, Janet C. Read, and Matthew Horton. 2013. Exploring Tilt-based Text Input for Mobile Devices with Teenagers. In Proceedings of the 27th International BCS Human Computer Interaction Conference (BCS-HCI '13). British Computer Society, Swinton, UK, UK, Article 25, 6 pages. http://dl.acm.org/citation.cfm?id=2578048.2578082",
      "doi": "10.5555/2578048.2578082"
    },
    {
      "text": "Mitchell Gordon, Tom Ouyang, and Shumin Zhai. 2016. WatchWriter: Tap and Gesture Typing on a Smartwatch Miniature Keyboard with Statistical Decoding. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3817--3821. DOI: http://dx.doi.org/10.1145/2858036.2858242  ",
      "doi": "10.1145/2858036.2858242"
    },
    {
      "text": "Yves Guiard. 1987. Asymmetric Division of Labor in Human Skilled Bimanual Action. Journal of Motor Behavior 19, 4 (1987), 486--517. DOI: http://dx.doi.org/10.1080/00222895.1987.10735426 PMID: 15136274. ",
      "doi": ""
    },
    {
      "text": "Ken Hinckley and Hyunyoung Song. 2011. Sensor Synaesthesia: Touch in Motion, and Motion in Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 801--810. DOI: http://dx.doi.org/10.1145/1978942.1979059  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2010. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 581--590. DOI: http://dx.doi.org/10.1145/1753326.1753413  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2011. Understanding Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2501--2510. DOI: http://dx.doi.org/10.1145/1978942.1979308  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Steven Hoober. 2013. How Do Users Really Hold Mobile Devices? (2013). http://www.uxmatters.com/mt/archives/2013/02/how-do-users-really-hold-mobile-devices.php.",
      "doi": ""
    },
    {
      "text": "Eleanor Jones, Jason Alexander, Andreas Andreou, Pourang Irani, and Sriram Subramanian. 2010. GesText: Accelerometer-based Gestural Text-entry Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2173--2182. DOI: http://dx.doi.org/10.1145/1753326.1753655  ",
      "doi": "10.1145/1753326.1753655"
    },
    {
      "text": "Per Ola Kristensson. 2007. Discrete and Continuous Shape Writing for Text Entry and Control. Ph.D. Dissertation. Institute of Technology, Linköping University, Sweden.",
      "doi": ""
    },
    {
      "text": "Per Ola Kristensson and Keith Vertanen. 2011. Asynchronous Multimodal Text Entry Using Speech and Gesture Keyboards. In Annual Conference of the International Speech Communication Association (Interspeech). 581--584. http://www.isca-speech.org/archive/interspeech_2011/i11_0581.html",
      "doi": ""
    },
    {
      "text": "Per Ola Kristensson and Shumin Zhai. 2004. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 43--52. DOI: http://dx.doi.org/10.1145/1029632.1029640  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754--755. DOI: http://dx.doi.org/10.1145/765891.765971  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Anders Markussen, Mikkel Rønne Jakobsen, and Kasper Hornbæk. 2014. Vulture: A Mid-air Word-gesture Keyboard. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1073--1082. DOI: http://dx.doi.org/10.1145/2556288.2556964  ",
      "doi": "10.1145/2556288.2556964"
    },
    {
      "text": "Alexander Ng, Stephen A. Brewster, and John H. Williamson. 2014. Investigating the Effects of Encumbrance on One- and Two- Handed Interactions with Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1981--1990. DOI: http://dx.doi.org/10.1145/2556288.2557312  ",
      "doi": "10.1145/2556288.2557312"
    },
    {
      "text": "Kurt Partridge, Saurav Chatterjee, Vibha Sazawal, Gaetano Borriello, and Roy Want. 2002. TiltType: Accelerometer-supported Text Entry for Very Small Devices. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, NY, NY, USA, 201--204. DOI: http://dx.doi.org/10.1145/571985.572013  ",
      "doi": "10.1145/571985.572013"
    },
    {
      "text": "Mahfuz Rahman, Sean Gustafson, Pourang Irani, and Sriram Subramanian. 2009. Tilt Techniques: Investigating the Dexterity of Wrist-based Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1943--1952. DOI: http://dx.doi.org/10.1145/1518701.1518997  ",
      "doi": "10.1145/1518701.1518997"
    },
    {
      "text": "Jun Rekimoto. 1996. Tilting Operations for Small Screen Interfaces. In Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology (UIST '96). ACM, NY, NY, USA, 167--168. DOI: http://dx.doi.org/10.1145/237091.237115  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Shyam Reyal, Shumin Zhai, and Per Ola Kristensson. 2015. Performance and User Experience of Touchscreen and Gesture Keyboards in a Lab Setting and in the Wild. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 679--688. DOI: http://dx.doi.org/10.1145/2702123.2702597  ",
      "doi": "10.1145/2702123.2702597"
    },
    {
      "text": "Stephen Sale. 2014. OTT messaging volumes. (2014). http://www.analysysmason.com/About-Us/News/Insight/OTT-messaging-volumes-Jan2014-RDMV0/.",
      "doi": ""
    },
    {
      "text": "Vibha Sazawal, Roy Want, and Gaetano Borriello. 2002. The Unigesture Approach. In Proceedings of the 4th International Symposium on Mobile Human-Computer Interaction (Mobile HCI '02). Springer-Verlag, London, UK, UK, 256--270. http://dl.acm.org/citation.cfm?id=645739.666599",
      "doi": "10.5555/645739.666599"
    },
    {
      "text": "Katie A. Siek, Yvonne Rogers, and Kay H. Connelly. 2005. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Proceedings of the 2005 IFIP TC13 International Conference on Human-Computer Interaction (INTERACT'05). Springer-Verlag, Berlin, Heidelberg, 267--280. DOI: http://dx.doi.org/10.1007/11555261_24  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Swiftkey. 2014. Swiftkey Tilt. (2014). https://blog.swiftkey.com/swiftkey-tilt/.",
      "doi": ""
    },
    {
      "text": "Swype. 2014. Swype. (2014). http://www.swype.com.",
      "doi": ""
    },
    {
      "text": "Robert J. Teather and I. Scott MacKenzie. 2014. Position vs. Velocity Control for Tilt-based Interaction. In Proceedings of Graphics Interface 2014 (GI '14). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 51--58. http://dl.acm.org/citation.cfm?id=2619648.2619658",
      "doi": "10.5555/2619648.2619658"
    },
    {
      "text": "Theophanis Tsandilas, Caroline Appert, Anastasia Bezerianos, and David Bonnet. 2014. Coordination of Tilt and Touch in One- and Two-handed Use. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2001--2004. DOI: http://dx.doi.org/10.1145/2556288.2557088  ",
      "doi": "10.1145/2556288.2557088"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2014. Complementing Text Entry Evaluations with a Composition Task. ACM Trans. Comput.-Hum. Interact. 21, 2, Article 8 (Feb. 2014), 33 pages. DOI: http://dx.doi.org/10.1145/2555691  ",
      "doi": "10.1145/2555691"
    },
    {
      "text": "William S. Walmsley, W. Xavier Snelgrove, and Khai N. Truong. 2014. Disambiguation of Imprecise Input with One-dimensional Rotational Text Entry. ACM Trans. Comput.-Hum. Interact. 21, 1, Article 4 (Feb. 2014), 40 pages. DOI: http://dx.doi.org/10.1145/2542544  ",
      "doi": "10.1145/2542544"
    },
    {
      "text": "Lars Weberg, Torbjorn Brange, and Asa Wendelbo Hansson. 2001. A Piece of Butter on the PDA Display. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, NY, NY, USA, 435--436. DOI: http://dx.doi.org/10.1145/634067.634320  ",
      "doi": "10.1145/634067.634320"
    },
    {
      "text": "Daniel Wigdor and Ravin Balakrishnan. 2003. TiltText: Using Tilt for Text Input to Mobile Phones. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 81--90. DOI: http://dx.doi.org/10.1145/964696.964705  ",
      "doi": "10.1145/964696.964705"
    },
    {
      "text": "John Williamson and Roderick Murray-Smith. 2005. Switching and Learning in Feedback Systems. Springer-Verlag, Berlin, Heidelberg, Chapter Hex: Dynamics and Probabilistic Text Entry, 333--342. http://dl.acm.org/citation.cfm?id=2137592.2137610",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock and Brad A. Myers. 2006. Analyzing the Input Stream for Character- Level Errors in Unconstrained Text Entry Evaluations. ACM Trans. Comput.-Hum. Interact. 13, 4 (Dec. 2006), 458--489. DOI: http://dx.doi.org/10.1145/1188816.1188819  ",
      "doi": "10.1145/1188816.1188819"
    },
    {
      "text": "Shumin Zhai and Per Ola Kristensson. 2003. Shorthand Writing on Stylus Keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 97--104. DOI: http://dx.doi.org/10.1145/642611.642630  ",
      "doi": "10.1145/642611.642630"
    },
    {
      "text": "Shumin Zhai and Per Ola Kristensson. 2012. The Word-gesture Keyboard: Reimagining Keyboard Interaction. Commun. ACM 55, 9 (Sept. 2012), 91--101. DOI: http://dx.doi.org/10.1145/2330667.2330689  ",
      "doi": "10.1145/2330667.2330689"
    }
  ]
}