{
  "doi": "10.1145/3025453.3025990",
  "title": "Activity as the Ultimate Particular of Interaction Design",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3390-3402",
  "year": 2017,
  "badges": [],
  "abstract": "In the turn towards practice-oriented research in interaction design, one of the most important proposals has been the emphasis on the 'ultimate particulars' produced by design, as embodiments of design knowledge. In current HCI research, those particulars are almost always taken to be 'things' artefacts or singular systems. We argue that this emphasis may have come at a cost that can be described as a loss of identity; interaction design research was never primarily concerned with the design of artefacts, but with how humans act and interact with each other with and through artefacts. We propose a complementary perspective by looking at design projects and traditions where the 'ultimate particulars' can be considered to be activities rather than things. The article is concerned with how knowledge needs to be articulated in the scholarly engagement with such design practices. We argue that engagement with activity-centric design gets design research one step closer towards understanding salient contemporary design practices and what Buchanan calls 'environmental design'.",
  "tags": [
    "ultimate particular",
    "third wave hci",
    "second order design",
    "research through design",
    "environmental design",
    "activity-centric design"
  ],
  "authors": [
    {
      "name": "Annika Waern",
      "institution": "Uppsala University, Uppsala, Sweden",
      "img": "/do/10.1145/contrib-81100020339/rel-imgonly/282023_3annika-waern.jpg",
      "acmid": "81100020339",
      "orcid": "missing"
    },
    {
      "name": "Jon Back",
      "institution": "Uppsala University, Uppsala, Sweden",
      "img": "/do/10.1145/contrib-99659161061/rel-imgonly/jon.jpg",
      "acmid": "99659161061",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Espen Aarseth. 2003. Playing Research: Methodological approaches to game analysis. In Proceedings of the digital arts and culture conference, 28--29.",
      "doi": ""
    },
    {
      "text": "Timo Arnall. 2014. Exploring \"Immaterials\": Mediating design's invisible materials. International Journal of Design 8, 2: 101--117.",
      "doi": ""
    },
    {
      "text": "Jon Back. 2015. The Embarrassing act of becoming a street performance audience. In CHI'15 Embarrassing Interactions Workshop, CHI'15.",
      "doi": ""
    },
    {
      "text": "Jon Back. 2016. Designing Public Play: Playful engagement, constructed activity, and player experience. Ph.D. thesis, Uppsala University, Uppsala.",
      "doi": ""
    },
    {
      "text": "J. Back and A. Waern. 2013. We are two strong women: Designing Empowerment in a Pervasive Game. Proceedings of DiGRA 2013.",
      "doi": ""
    },
    {
      "text": "Liam Bannon. 1991. From human factors to human actors: The role of psychology and human-computer interaction studies in system design. Design at work: Cooperative design of computer systems 25: 44.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2093--2102.  ",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Eric PS Baumer and M. Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2271--2274.",
      "doi": ""
    },
    {
      "text": "Steve Benford and Gabriella Giannachi. 2008. Temporal trajectories in shared interactive narratives. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 73--82.  ",
      "doi": "10.1145/1357054.1357067"
    },
    {
      "text": "Steve Benford, Gabriella Giannachi, Boriana Koleva, and Tom Rodden. 2009. From Interaction to Trajectories: designing coherent journeys through user experiences. 709--718.",
      "doi": ""
    },
    {
      "text": "Karl Bergström. 2010. The implicit rules of board games: On the particulars of the lusory agreement. In Proceedings of the 14th International Academic MindTrek Conference: Envisioning Future Media Environments, 86--93.  ",
      "doi": "10.1145/1930488.1930506"
    },
    {
      "text": "Olav W. Bertelsen and Susanne Bødker. 2003. Activity theory. HCI models, theories, and frameworks: Toward a multidisciplinary science: 291--324.",
      "doi": ""
    },
    {
      "text": "Erling Bjögvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Design Things and Design Thinking: Contemporary participatory design challenges. Design Issues 28, 3: 101--116. ",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Richard Buchanan. 2001. Design research and the new learning. Design issues 17, 4: 3--23. ",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard and Christian Dindler. 2014. Between theory and practice: bridging concepts in HCI research. In Proceedings of the 32nd annual ACM conference on human factors in computing systems, 1635--1644.  ",
      "doi": "10.1145/2556288.2557342"
    },
    {
      "text": "Lorenzo Davoli and Johan Redström. 2014. Materializing infrastructures for participatory hacking. In Proceedings of the 2014 conference on Designing interactive systems, 121--130.  ",
      "doi": "10.1145/2598510.2602961"
    },
    {
      "text": "Alan Dix. 2007. Designing for appropriation. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI... but not as we know it-Volume 2, 27--30.",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "Scott Donaldson. 2016. Towards a typology of metagames. In Proceedings of the Australasian Computer Science Week Multiconference, 73.  ",
      "doi": "10.1145/2843043.2843474"
    },
    {
      "text": "Pelle Ehn. 1993. Scandinavian design: On participation and skill. Participatory design: Principles and practices: 41--77.",
      "doi": ""
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated portfolios. interactions 19, 4: 40--49.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2009. Designing for homo ludens, still. In (Re)Searching The Digital Bauhaus. Springer, 163--178. Retrieved January 4, 2017 from http://link.springer.com/chapter/10.1007%2F978-184800-350-7_9",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design? In Proceedings of the SIGCHI conference on human factors in computing systems, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI conference on Human factors in computing systems, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The drift table: designing for ludic engagement. In CHI'04 extended abstracts on Human factors in computing systems, 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Geraldine Gay and Helene Hembrooke. 2004. Activity Centered Design: An ecological approach to designing smart tools and usable systems. MIT Press.",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. In Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA, 1--18.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2004. Active co-construction of meaningful experiences: but what is the designer's role? In Proceedings of the third Nordic conference on Human-computer interaction, 1--2.  ",
      "doi": "10.1145/1028014.1028015"
    },
    {
      "text": "Kristina Höök. 2006. Designing familiar open surfaces. In Proceedings of the 4th Nordic conference on Humancomputer interaction: changing roles, 242--251.  ",
      "doi": "10.1145/1182475.1182501"
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on ComputerHuman Interaction (TOCHI) 19, 3: 23.",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Kristina Höök, Anna Ståhl, Petra Sundström, and Jarmo Laaksolaahti. 2008. Interactional empowerment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 647--656.  ",
      "doi": "10.1145/1357054.1357157"
    },
    {
      "text": "Robin Hunicke, Marc LeBlanc, and Robert Zubek. 2004. MDA: A formal approach to game design and game research. In Proceedings of the AAAI Workshop on Challenges in Game AI.",
      "doi": ""
    },
    {
      "text": "Melinda Jacobs and Tanja Sihvonen. 2011. In Perpetual Beta? On the participatory design of Facebook games. In Think Design Play: The Fifth International Conference of the Digital Research Association (DIGRA).",
      "doi": ""
    },
    {
      "text": "Staffan Jonsson, Annika Waern, Markus Montola, and Jaakko Stenros. 2007. Game mastering a pervasive larp. Experiences from momentum. In PerGames 2007: Proceedings of the 4th International Symposium on Pervasive Gaming Applications.",
      "doi": ""
    },
    {
      "text": "Victor Kaptelinin and Bonnie Nardi. 2012. Activity theory in HCI: Fundamentals and Reflections. Synthesis Lectures Human-Centered Informatics 5, 1: 1--105. ",
      "doi": ""
    },
    {
      "text": "Kari Kuutti. 1996. Activity theory as a potential framework for human-computer interaction research. Context and consciousness: Activity theory and human-computer interaction: 17--44.",
      "doi": ""
    },
    {
      "text": "Lian Loke and George Poonkhin Khut. 2014. Intimate aesthetics and facilitated interaction. In Interactive Experience in the Digital Age. Springer, 91--108.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange: An embodied approach to movement based interaction design. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 1: 7.",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Jonas Löwgren. 2011. The need for video in scientific communication. ACM Interactions 18, 1: 22.",
      "doi": "10.1145/1897239.1897246"
    },
    {
      "text": "Jonas Löwgren. 2013. Annotated portfolios and other forms of intermediate-level knowledge. ACM Interactions 20, 1: 30--34.  ",
      "doi": "10.1145/2405716.2405725"
    },
    {
      "text": "Elena Márquez Segura and Laia Turmo. Submitted manuscript. Sketching the ephemeral.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The design space of body games: technological, physical, and social design. In Proceedings of the SIGCHI conference on Human Factors in computing systems, 3365--3374.  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Scott McCloud. 1993. Understanding comics: The invisible art. Northampton, Mass.",
      "doi": ""
    },
    {
      "text": "Bonnie A. Nardi. 1996. Context and consciousness: activity theory and human-computer interaction. MIT Press.",
      "doi": "10.5555/223826"
    },
    {
      "text": "Eric Paulos and James Pierce. 2011. Citizen Energy: Towards Populist Interactive Micro-Energy Production. In System Sciences (HICSS), 2011 44th Hawaii International Conference on, 1--10.",
      "doi": "10.1109/HICSS.2011.99"
    },
    {
      "text": "James Pierce. 2014. On the presentation and production of design research artifacts in HCI. In Proceedings of the 2014 conference on Designing interactive systems, 735--744.  ",
      "doi": "10.1145/2598510.2598525"
    },
    {
      "text": "James Pierce and Eric Paulos. 2015. Making Multiple Uses of the Obscura 1C Digital Camera: Reflecting on the Design, Production, Packaging and Distribution of a Counter functional Device. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2103--2112.  ",
      "doi": "10.1145/2702123.2702405"
    },
    {
      "text": "Patrick Prax. 2012. Co-creative interface development in MMORPGs--the case of World of Warcraft add-ons. Journal of Gaming & Virtual Worlds 4, 1: 3--24. ",
      "doi": ""
    },
    {
      "text": "Johan Redström. 2008. RE: Definitions of use. Design studies 29, 4: 410--423. ",
      "doi": ""
    },
    {
      "text": "Katie Salen and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press.",
      "doi": "10.5555/1215723"
    },
    {
      "text": "David Shenk. 2011. The immortal game. Souvenir Press.",
      "doi": ""
    },
    {
      "text": "Herbert A. Simon. 1996. The sciences of the artificial. MIT press.",
      "doi": "10.5555/237774"
    },
    {
      "text": "Anna Ståhl, Jonas Löwgren, and Kristina Höök. 2014. Evocative balance: Designing for interactional empowerment.",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros, Jussi Holopainen, Annika Waern, Markus Montola, and Elina Ollila. 2011. Narrative friction in alternate reality games: Design insights from conspiracy for good. In Proceedings of DiGRA 2011 Conference: Think Design Play, Utrecht, The Netherlands. DiGRA.",
      "doi": ""
    },
    {
      "text": "Erik Stolterman. 2008. The nature of design practice and implications for interaction design research. International Journal of Design 2, 1: 55--65.",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2015. A personal perspective on research through design. interactions 22, 4: 74--76.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human-machine reconfigurations: Plans and situated actions. Cambridge University Press.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Bernard Suits. 1978. Grasshopper: Games, Life and Utopia. Toronto, ON: University of Toronto Press.",
      "doi": ""
    },
    {
      "text": "Petra Sundström, Anna Ståhl, and Kristina Höök. 2007. In situ informants exploring an emotional mobile messaging system in their everyday practice. International Journal of Human-Computer Studies 65, 4: 388--403.  ",
      "doi": "10.1016/j.ijhcs.2006.11.013"
    },
    {
      "text": "Alex Taylor. 2015. After interaction. ACM Interactions 22, 5: 48--53.  ",
      "doi": "10.1145/2809888"
    },
    {
      "text": "Anna Vallgårda and Ylva Fernaeus. 2015. Interaction Design as a Bricolage Practice. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction, 173--180.  ",
      "doi": "10.1145/2677199.2680594"
    },
    {
      "text": "Eric Zimmerman. 2004. Narrative, interactivity, play, and games: Four naughty concepts in need of discipline. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}