{
  "doi": "10.1145/3025453.3025788",
  "title": "I'm too Busy to Reset my LinkedIn Password: On the Effectiveness of Password Reset Emails",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "387-391",
  "year": 2017,
  "badges": [],
  "abstract": "A common security practice used to deal with a password breach is locking user accounts and sending out an email to tell users that they need to reset their password to unlock their account. This paper evaluates the effectiveness of this security practice based on the password reset email that LinkedIn sent out around May 2016, and through an online survey conducted on 249 LinkedIn users who received that email. Our evaluation shows that only about 46% of the participants reset their passwords. The mean time taken to reset password was 26.3 days, revealing that a significant proportion of the participants reset their password a few weeks, or even months after first receiving the email. Our findings suggest that more effective persuasive measures need to be added to convince users to reset their password in a timely manner, and further reduce the risks associated with delaying password resets.",
  "tags": [
    "reset email",
    "linkedin",
    "password breach",
    "password reset"
  ],
  "authors": [
    {
      "name": "Jun Ho Huh",
      "institution": "Honeywell ACS Labs, Golden Valley, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387593973",
      "orcid": "0000-0003-2007-4018"
    },
    {
      "name": "Hyoungshick Kim",
      "institution": "Sungkyunkwan University, Suwon-si, Gyeonggi-do , Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658914957",
      "orcid": "missing"
    },
    {
      "name": "Swathi S.V.P. Rayala",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160324",
      "orcid": "missing"
    },
    {
      "name": "Rakesh B. Bobba",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323488389",
      "orcid": "missing"
    },
    {
      "name": "Konstantin Beznosov",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81100388506/rel-imgonly/kosta_soups.jpg",
      "acmid": "81100388506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joseph Bonneau and Sören Preibusch. 2010. The Password Thicket: Technical and Market Failures in Human Authentication on the Web. In Proceedings of the 9th Annual Workshop on the Economics of Information Security.",
      "doi": ""
    },
    {
      "text": "Sonia Chiasson and P. C. van Oorschot. 2015. Quantifying the security advantage of password expiration policies. Designs, Codes and Cryptography 77, 2 (2015), 401--408.  ",
      "doi": "10.1007/s10623-015-0071-9"
    },
    {
      "text": "Adrienne Porter Felt, Alex Ainslie, Robert W. Reeder, Sunny Consolvo, Somas Thyagaraja, Alan Bettes, Helen Harris, and Jeff Grimes. 2015. Improving SSL Warnings: Comprehension and Adherence. In Proceedings of the 33rd Conference on Human Factors and Computing Systems.  ",
      "doi": "10.1145/2702123.2702442"
    },
    {
      "text": "Dinei Florencio and Cormac Herley. 2007. A Large-scale Study of Web Password Habits. In Proceedings of the 16th International Conference on World Wide Web.  ",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "Steven Furnell. 2007. An assessment of website password practices. Computers & Security 26, 7--8 (2007), 445--451.",
      "doi": "10.1016/j.cose.2007.09.001"
    },
    {
      "text": "Simson L. Garfinkel. 2003. Email-Based Identification and Authentication: An Alternative to PKI? IEEE Security and Privacy 1, 6 (Nov. 2003), 20--26.  ",
      "doi": "10.1109/MSECP.2003.1253564"
    },
    {
      "text": "Patrick Heim. 2016. Resetting passwords to keep your files safe. https://blogs.dropbox.com/dropbox/2016/08/ resetting-passwords-to-keep-your-files-safe/. (August 2016).",
      "doi": ""
    },
    {
      "text": "Chris Karlof, J. D. Tygar, and David Wagner. 2009. Conditioned-safe Ceremonies and a User Study of an Application to Web Authentication. In Proceedings of the 16th Network and Distributed System Security Symposium.",
      "doi": "10.1145/1572532.1572578"
    },
    {
      "text": "Simon Marechal. 2008. Advances in password cracking. Journal in Computer Virology 4, 1 (2008), 73--81. ",
      "doi": ""
    },
    {
      "text": "Cory Scott. 2016. Protecting Our Members. https: //blog.linkedin.com/2016/05/18/protecting-our-members. (May 2016).",
      "doi": ""
    },
    {
      "text": "Yinqian Zhang, Fabian Monrose, and Michael K. Reiter. 2010. The Security of Modern Password Expiration: An Algorithmic Framework and Empirical Analysis. In Proceedings of the 17th ACM Conference on Computer and Communications Security.  ",
      "doi": "10.1145/1866307.1866328"
    }
  ]
}