{
  "doi": "10.1145/3025453.3025913",
  "title": "Transitions in Digital Personhood: Online Activity in Early Retirement",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6398-6411",
  "year": 2017,
  "badges": [],
  "abstract": "We present findings from a qualitative study about how Internet use supports self-functioning following the life transition of retirement from work. This study recruited six recent retirees and included the deployment of OnLines, a design research artifact that logged and visualized key online services used by participants at home over four-weeks. The deployment was supported by pre- and post-deployment interviews. OnLines prompted participants' reflection on their patterns of Internet use. Position Exchange Theory was used to understand retirees' sense making from a lifespan perspective, informing the design of supportive online services. This paper delivers a three-fold contribution to the field of human-computer interaction, advancing a lifespan-oriented approach by conceptualizing the self as a dialogical phenomenon that develops over time, advancing the ageing discourse by reporting on retirees' complex identities in the context of their life histories, and advancing discourse on research through design by developing OnLines to foster participant-researcher reflection informed by Self Psychology.",
  "tags": [
    "personhood",
    "lifespan-oriented research",
    "retirement",
    "ageing",
    "research through design",
    "position exchange theory"
  ],
  "authors": [
    {
      "name": "Abigail Durrant",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488179",
      "orcid": "0000-0003-4752-5376"
    },
    {
      "name": "David Kirk",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Diego Trujillo Pisanty",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758951157",
      "orcid": "missing"
    },
    {
      "name": "Wendy Moncur",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-81350572262/rel-imgonly/wendy-kayak.jpg",
      "acmid": "81350572262",
      "orcid": "missing"
    },
    {
      "name": "Kathryn Orzech",
      "institution": "University of Dundee, Dundee, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658767278",
      "orcid": "missing"
    },
    {
      "name": "Tom Schofield",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81474700787/rel-imgonly/profile_small.jpg",
      "acmid": "81474700787",
      "orcid": "missing"
    },
    {
      "name": "Chris Elsden",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-89758813157/rel-imgonly/headshotcrop.jpg",
      "acmid": "89758813157",
      "orcid": "missing"
    },
    {
      "name": "David Chatting",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100022543/rel-imgonly/1u6a2452-square.jpg",
      "acmid": "81100022543",
      "orcid": "missing"
    },
    {
      "name": "Andrew Monk",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660653872",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nichola Adams, David Stubbs, and Valerie Woods. 2005. Psychological barriers to Internet usage among older adults in the UK. Informatics for Health and Social Care 30, 1: 3--17.",
      "doi": ""
    },
    {
      "text": "Ben Anderson and Karina Tracey. 2001. Digital Living The Impact (or Otherwise) of the Internet on Everyday Life. American Behavioral Scientist 45 (3): 456--75.",
      "doi": ""
    },
    {
      "text": "Ron Baecker, Kate Sellen, Sarah Crosskey, Veronique Boscart, and Barbara Barbosa Neves. 2014. Technology to reduce social isolation and loneliness. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS '14). ACM, NY, NY, USA, 27--34.  ",
      "doi": "10.1145/2661334.2661375"
    },
    {
      "text": "Eric P.S. Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 585--594.  ",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Eric P.S. Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing reflection: on the use of reflection in interactive system design. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 93102.  ",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "David Bawden. 2008. Origins and concepts of digital literacy. In Digital literacies: Concepts, policies and practices. Peter Lang Publishing Inc, pp17--32.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2: 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Jessica M. David, Alison Benjamin, Ronald M. Baecker, Diane Gromala, and Jeremy Birnholtz. 2011. Living with pain, staying in touch: exploring the communication needs of older adults with chronic pain. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 1219--1224.  ",
      "doi": "10.1145/1979742.1979751"
    },
    {
      "text": "Eli Blevis, Susanne Bødker, John Flach, Jodi Forlizzi, Heekyoung Jung, Victor Kaptelinin, Bonnie Nardi, and Antonio Rizzo. 2015. Ecological Perspectives in HCI: Promise, Problems, and Potential. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, 2401--2404.  ",
      "doi": "10.1145/2702613.2702634"
    },
    {
      "text": "Naomi Bloch and Bertram C. Bruce. 2011. Older Adults and the New Public Sphere. Proceedings of the 2011 iConference, ACM, 1--7.  ",
      "doi": "10.1145/1940761.1940762"
    },
    {
      "text": "Mark Blythe, Andrew Monk and Kevin Doughty. 2005. Socially Dependable Design: The Challenge of Ageing Populations for HCI, Interacting with Computers, 17, 672--689.  ",
      "doi": "10.1016/j.intcom.2005.09.005"
    },
    {
      "text": "Laurens Boer and Jared Donovan. 2012. Provotypes for participatory innovation. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, NY, NY, USA, 388--397.  ",
      "doi": "10.1145/2317956.2318014"
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. \"Tell It Like It Really Is\": A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5529--5542.  ",
      "doi": "10.1145/2858036.2858379"
    },
    {
      "text": "Oliver K. Burmeister. 2012. What seniors value about online community. Community Informatics, 8, 1.",
      "doi": ""
    },
    {
      "text": "Alison Burrows, Val Mitchell, and Colette Nicolle. 2015. Cultural probes and levels of creativity. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '15). ACM, NY, NY, USA, 920--923.  ",
      "doi": "10.1145/2786567.2794302"
    },
    {
      "text": "Jean Butters. 2002. Managing the mental and emotional aspects of retirement. Leadership in Health Services 15, 4: 6--11.",
      "doi": ""
    },
    {
      "text": "Bronwyn Davies and Rom Harré. 1990. Positioning: the discursive production of selves. Journal for the Theory of Social Behaviour, 20, 43--63.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and Lisa P. Nathan. 2010. Multilifespan information system design: a research initiative for the hci community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 22432246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Chiara Garattini, Joseph Wherton , David Prendergast. 2012. Linking the lonely: an exploration of a communication technology designed to support social interaction among older adults. Universal Access in the Information Society. 11, 2, 211--222  ",
      "doi": "10.1007/s10209-011-0235-y"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 937946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Lorna Gibson, Wendy Moncur, Paula Forbes, John Arnott, Christopher Martin, and Amritpal S. Bhachu. 2010. Designing social networking sites for older adults. Proceedings of the 24th BCS Interaction Specialist Group Conference, British Computer Society, 186--194. ",
      "doi": "10.5555/2146303.2146331"
    },
    {
      "text": "Lorna Gibson and Vicki L. Hanson. 2013. Digital motherhood: how does technology help new mothers? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 313--322.  ",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Alex Gillespie and Jack Martin. 2014. Position exchange theory: a socio-material basis for discursive and psychological positioning. New Ideas in Psychology, 32, 73--79.",
      "doi": ""
    },
    {
      "text": "Jasmin Grosinger, Frank Vetere, and Geraldine Fitzpatrick. 2012. Agile life: addressing knowledge and social motivations for active aging. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12). ACM, NY, NY, USA, 162--165.  ",
      "doi": "10.1145/2414536.2414566"
    },
    {
      "text": "Susan Harter. 1999. The construction of the self: A developmental perspective. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Hubert Hermans and Agnieszka Hermans-Konopka. 2010. Dialogical self theory: Positioning and counterpositioning in a globalizing society. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Alexis Hope, Ted Schwaba, and Anne Marie Piper. 2014. Understanding digital and material social communications for older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 39033912.  ",
      "doi": "10.1145/2556288.2557133"
    },
    {
      "text": "Alison Hulme. 2014. 'Next Steps: Life Transitions and Retirement in the 21st Century'. Calouste Gulbenkian Foundation. http://gulbenkian.org.uk/files/01-07--12Next%20steps%20%20Life%20transitions%20and%20retirement%20in%20the%2021st%20century.pdf",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Hans Jonsson, Lena Borell & Gaynor Sadlo. 2000. Retirement: An occupational transition with consequences for temporality, balance and meaning of occupations, Journal of Occupational Science, 7:1, 2937.",
      "doi": ""
    },
    {
      "text": "Jungmeen E. Kim and Phyllis Moen. 2001. Is Retirement Good or Bad for Subjective Well-Being? Current Directions in Psychological Science, 10, 3, 8386.",
      "doi": ""
    },
    {
      "text": "Vilma Lehtinen, Jaana Näsänen, and Risto Sarvas. 2009. \"A little silly and empty-headed\": older adults' understandings of social networking sites. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCS-HCI '09). British Computer Society, Swindon, UK, UK, 45--54. ",
      "doi": "10.5555/1671011.1671017"
    },
    {
      "text": "Siân E. Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to be in touch in a changing communications landscape: attitudes of older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1693--1702.  ",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Siân Lindley and Jayne Wallace. 2015. Placing in Age: Transitioning to a New Home in Later Life. ACM Trans. Comput.-Hum. Interact. 22, 4, Article 20 (June 2015), 39 pages.  ",
      "doi": "10.1145/2755562"
    },
    {
      "text": "Jack Martin and Alex Gillespie. 2012. Position exchange theory and personhood: moving between positions and perspectives within physical, sociocultural, and psychological space and time. In Martin, Jack, and Mark H. Bickhard, eds. The psychology of personhood: Philosophical, historical, social developmental, and narrative perspectives. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Michael Massimi, Richard Harper, and Abigail J. Sellen. 2014. \"Real, but Glossy\": technology and the practical pursuit of magic in modern weddings. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 854--865.  ",
      "doi": "10.1145/2531602.2531682"
    },
    {
      "text": "Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of life and death: locating the end of life in lifespan-oriented hci research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 987--996.  ",
      "doi": "10.1145/1978942.1979090"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as Experience. The MIT Press. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking {A}Part: The Politics and Aesthetics of Participation in Experience-Centered Design. The MIT Press. ",
      "doi": "10.5555/2742697"
    },
    {
      "text": "Wendy Moncur, Lorna Gibson, and Daniel Herron. 2016. The Role of Digital Technologies During Relationship Breakdowns. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 371--382.  ",
      "doi": "10.1145/2818048.2819925"
    },
    {
      "text": "Galit Nimrod. 2010. Seniors' Online Communities: A Quantitative Content Analysis. The Gerontologist 50, 3: 382--392.",
      "doi": ""
    },
    {
      "text": "Paul G. Nixon, Rajash Rawal, and Andreas Funk, eds. 2016. Digital Media Usage Across the Life Course. Routledge.",
      "doi": ""
    },
    {
      "text": "Chris Norval, John L. Arnott, and Vicki L. Hanson. 2014. What's on your mind?: investigating recommendations for inclusive social networking and older adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3923--3932.  ",
      "doi": "10.1145/2556288.2556992"
    },
    {
      "text": "William Odom, Ron Wakkary, Youn-kyung Lim, Audrey Desjardins, Bart Hengeveld, and Richard Banks. 2016. From Research Prototype to Research Product. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2549--2561.  ",
      "doi": "10.1145/2858036.2858447"
    },
    {
      "text": "William Odom, John Zimmerman, Jodi Forlizzi, Ana López Higuera, Mauro Marchitto, José Cañas, Younkyung Lim, Tek-Jin Nam, Moon-Hwan Lee, Yeoreum Lee, Da-jung Kim, Yea-kyung Row, Jinmin Seok, Bokyung Sohn, and Heather Moore. 2013. Fragmentation and transition: understanding perceptions of virtual possessions among young adults in Spain, South Korea and the United States. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1833--1842.  ",
      "doi": "10.1145/2470654.2466242"
    },
    {
      "text": "Ofcom. Adults' Media Use and Attitudes Report 2014. Retrieved July 29, 2015 from http://stakeholders.ofcom.org.uk/market-dataresearch/other/research-publications/adults/adultsmedia-lit-14/",
      "doi": ""
    },
    {
      "text": "Kathryn M. Orzech, Wendy Moncur, Abigail Durrant, Diego Trujillo-Pisanty. 2016. Opportunities and challenges of the digital lifespan: views of service providers and citizens in the UK. Information, Communication & Society, 1--16.",
      "doi": ""
    },
    {
      "text": "Benoît Otjacques, Marc Krier, Fernand Feltz, Dieter Ferring, and Martine Hoffmann. 2009. Helping older people to manage their social activities at the retirement home. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology (BCSHCI '09). British Computer Society, Swindon, UK, 375--380. ",
      "doi": "10.5555/1671011.1671059"
    },
    {
      "text": "Sonja Pedell, Frank Vetere, Lars Kulik, Elizabeth Ozanne, and Alan Gruner. 2010. Social isolation of older people: the role of domestic technologies. In Proceedings of the 22nd Conference of the ComputerHuman Interaction Special Interest Group of Australia on Computer-Human Interaction (OZCHI '10). ACM, NY, NY, USA, 164--167.  ",
      "doi": "10.1145/1952222.1952255"
    },
    {
      "text": "Anna Pettican and Sarah Prior. 2011. \"It's a new way of life\": an exploration of the occupational transition of retirement. The British Journal of Occupational Therapy 74, 1: 12--19.",
      "doi": ""
    },
    {
      "text": "James Pierce. 2014. On the presentation and production of design research artifacts in HCI. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14). ACM, NY, NY, USA, 735--744.  ",
      "doi": "10.1145/2598510.2598525"
    },
    {
      "text": "James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2083--2092.  ",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "Martin Pinquart and Ines Schindler. 2007. Changes of Life Satisfaction in the Transition to Retirement: A Latent-Class Approach. Psychology and Aging. 22, 3, 442--455.",
      "doi": ""
    },
    {
      "text": "Claudia Beatriz Rebola, Patricio A. Vela, Jorge Palacio, Gbolabo Ogunmakin, and Chauncey Saurus. 2012. Stitchtures: interactive art installations for social interventions in retirement communities. In Proceedings of the 30th ACM international conference on Design of communication (SIGDOC '12). ACM, NY, NY, USA, 71--78.  ",
      "doi": "10.1145/2379057.2379072"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L. Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never too old: engaging retired people inventing the future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 39133922.  ",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Antti Salovaara, Asko Lehmuskallio, Leif Hedman, Paula Valkonen, and Jaana Näsänen. 2010. Information technologies and transitions in the lives of 55--65-yearolds: The case of colliding life interests. International Journal of Human-Computer Studies 68, 11: 803--821.  ",
      "doi": "10.1016/j.ijhcs.2010.06.007"
    },
    {
      "text": "Corina Sas and Steve Whittaker. 2013. Design for forgetting: disposing of digital possessions after a breakup. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1823--1832.  ",
      "doi": "10.1145/2470654.2466241"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC '05), Olav W. Bertelsen, Niels Olof Bouvin, Peter G. Krogh, and Morten Kyng (Eds.). ACM, NY, NY, USA, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proceedings of the 6th conference on Designing Interactive systems (DIS '06). ACM, NY, NY, USA, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Jonathan A., Smith 2015. Qualitative psychology: A practical guide to research methods. Sage.",
      "doi": ""
    },
    {
      "text": "Madeline E. Smith. 2014. Connecting students and families for support during the college transition. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW Companion '14). ACM, NY, NY, USA, 93--96.  ",
      "doi": "10.1145/2556420.2556832"
    },
    {
      "text": "Lisa Thomas and Pam Briggs. 2014. An older adult perspective on digital legacy. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, NY, NY, USA, 237--246.  ",
      "doi": "10.1145/2639189.2639485"
    },
    {
      "text": "UK Office for National Statistics. 2015. 'Internet Access - Households and Individuals, 2015'. Last Accessed 21-09--16: http://www.ons.gov.uk/peoplepopulationandcommunity/householdcharacteristics/homeinternetandsocialmediausage/bulletins/internetaccesshouseholdsandindividuals/2015-08-06",
      "doi": ""
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Transactions on Computer-Human Interaction 22, 1: 1--27.  ",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner, and John Downs. 2013. Older adults as digital content producers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 39--48.  ",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Amanda Williams, Ken Anderson, and Paul Dourish. 2008. Anchored mobilities: mobile technology and transnational migration. In Proceedings of the 7th ACM conference on Designing interactive systems (DIS '08). ACM, NY, NY, USA, 323--332.  ",
      "doi": "10.1145/1394445.1394480"
    },
    {
      "text": "Jason Chen Zhao, Wai-Tat Fu, Hanzhe Zhang, Shengdong Zhao, and Henry Duh. 2015. To Risk or Not to Risk?: Improving Financial Risk Taking of Older Adults by Online Social Information. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 95--104.  ",
      "doi": "10.1145/2675133.2685033"
    }
  ]
}