{
  "doi": "10.1145/3025453.3025992",
  "title": "Crowd Diversity and Performance in Wikipedia: The Mediating Effects of Task Conflict and Communication",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6342-6351",
  "year": 2017,
  "badges": [],
  "abstract": "Crowd diversity is a key attribute that impacts crowd performance in online collaboration systems. As a structural composition of a crowd, diversity is likely to influence crowd performance through communication processes during collaboration. This study examined how diversity influenced crowd performance under different conditions of task conflict and communication in Wikipedia article production. With a sample of 5,899 articles, we found that contribution diversity positively predicted crowd performance, whereas experience diversity was negatively related to performance. In addition, task communication and conflict partially mediated the relationship between crowd diversity and performance. Task communication positively predicted performance for both forms of diversity. Task conflict, on the other hand, was positively predicted by expertise diversity, but had negative associations with contribution diversity and performance. The findings help unpack the reasons for differential effects of diversity on crowd performance, and demonstrate the importance of including communication variables when studying online crowd collaboration.",
  "tags": [
    "communication",
    "crowd performance",
    "wikipedia",
    "conflict",
    "diversity"
  ],
  "authors": [
    {
      "name": "Ruqin Ren",
      "institution": "University of Southern California, Los Angeles, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750292",
      "orcid": "missing"
    },
    {
      "name": "Bei Yan",
      "institution": "University of Southern California, Los Angeles, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750683",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ofer Arazy, Oded Nov, Raymond Patterson, and Lisa Yeo. 2011. Information quality in Wikipedia: The effects of group composition and task conflict. Journal of Management Information Systems 27, 4 (2011), 71--98.  ",
      "doi": "10.2753/MIS0742-1222270403"
    },
    {
      "text": "Reuben M Baron and David A Kenny. 1986. The moderator--mediator variable distinction in social psychological research: Conceptual, strategic, and statistical considerations. Journal of personality and social psychology 51, 6 (1986), 1173.",
      "doi": ""
    },
    {
      "text": "Zoe I Barsness, Kristina A Diekmann, and Marc-David L Seidel. 2005. Motivation and opportunity: The role of remote work, demographic dissimilarity, and social network centrality in impression management. Academy of Management Journal 48, 3 (2005), 401--419.",
      "doi": ""
    },
    {
      "text": "Beth A Bechky. 2003. Sharing meaning across occupational communities: The transformation of understanding on a production floor. Organization science 14, 3 (2003), 312--330.  ",
      "doi": "10.1287/orsc.14.3.312.15162"
    },
    {
      "text": "Yochai Benkler. 2006. The wealth of networks: How social production transforms markets and freedom. Yale University Press. ",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Jilin Chen, Yuqing Ren, and John Riedl. 2010. The effects of diversity on group productivity and member withdrawal in online volunteer groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 821--830.  ",
      "doi": "10.1145/1753326.1753447"
    },
    {
      "text": "Sherae Daniel, Ritu Agarwal, and Katherine J Stewart. 2013. The effects of diversity in global, distributed collectives: A study of open source project success. Information Systems Research 24, 2 (2013), 312--333.",
      "doi": ""
    },
    {
      "text": "Samer Faraj, Sirkka L Jarvenpaa, and Ann Majchrzak. 2011. Knowledge collaboration in online communities. Organization science 22, 5 (2011), 1224--1239.  ",
      "doi": "10.1287/orsc.1100.0614"
    },
    {
      "text": "Anna Filippova and Hichang Cho. 2015. Mudslinging and Manners: Unpacking Conflict in Free and Open Source Software. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1393--1403.  ",
      "doi": "10.1145/2675133.2675254"
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, and John Riedl. 2012. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist (2012), 0002764212469365.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't bite the newbies: how reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th international symposium on wikis and open collaboration. ACM, 163--172.  ",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "David A Harrison and Katherine J Klein. 2007. What's the difference? Diversity constructs as separation, variety, or disparity in organizations. Academy of management review 32, 4 (2007), 1199--1228.",
      "doi": ""
    },
    {
      "text": "Andrew F Hayes. 2009. Beyond Baron and Kenny: Statistical mediation analysis in the new millennium. Communication monographs 76, 4 (2009), 408--420.",
      "doi": ""
    },
    {
      "text": "Jeff Howe. 2008. Crowdsourcing: How the power of the crowd is driving the future of business. Random House. ",
      "doi": "10.5555/1481457"
    },
    {
      "text": "Karen A Jehn. 1995. A multimethod examination of the benefits and detriments of intragroup conflict. Administrative science quarterly (1995), 256--282.",
      "doi": ""
    },
    {
      "text": "Karen A Jehn, Gregory B Northcraft, and Margaret A Neale. 1999. Why differences make a difference: A field study of diversity, conflict and performance in workgroups. Administrative science quarterly 44, 4 (1999), 741--763.",
      "doi": ""
    },
    {
      "text": "Elisabeth Joyce and Robert E Kraut. 2006. Predicting continued participation in newsgroups. Journal of Computer-Mediated Communication 11, 3 (2006), 723--747.",
      "doi": ""
    },
    {
      "text": "Gerald C Kane and Sam Ransbotham. 2016. Content and Collaboration: An Affiliation Network Approach to Information Quality in Online Peer Production Communities. Information Systems Research (2016).",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2009. What's in Wikipedia?: mapping topics and conflict using socially annotated category structure. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1509--1512.  ",
      "doi": "10.1145/1518701.1518930"
    },
    {
      "text": "Aniket Kittur and Robert E Kraut. 2008. Harnessing the wisdom of crowds in wikipedia: quality through coordination. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Aniket Kittur and Robert E Kraut. 2010. Beyond Wikipedia: coordination and conflict in online production groups. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 215--224.  ",
      "doi": "10.1145/1718918.1718959"
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, Bryan A Pendleton, and Ed H Chi. 2007. He says, she says: conflict and coordination in Wikipedia. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 453--462.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Terri R Kurtzberg. 2005. Feeling creative, being creative: An empirical study of diversity and creativity in teams. Creativity Research Journal 17, 1 (2005), 51--65.",
      "doi": ""
    },
    {
      "text": "Karim R Lakhani and Eric Von Hippel. 2003. How open source software works:'free' user-to-user assistance. Research policy 32, 6 (2003), 923--943.",
      "doi": ""
    },
    {
      "text": "Frances J Milliken, Caroline A Bartel, and Terri R Kurtzberg. 2003. Diversity and creativity in work groups: A dynamic perspective on the affective and cognitive processes that link diversity and performance. Group creativity: Innovation through collaboration (2003), 32--62.",
      "doi": ""
    },
    {
      "text": "Jonathan T Morgan, Michael Gilbert, Mark Zachry, and David McDonald. 2013. A content analysis of Wikiproject discussions: Toward a typology of coordination language used by virtual teams. In Proceedings of the 2013 conference on Computer supported cooperative work companion. ACM, 231--234.  ",
      "doi": "10.1145/2441955.2442011"
    },
    {
      "text": "Mark Mortensen and Pamela J Hinds. 2001. Conflict and shared identity in geographically distributed teams. International Journal of Conflict Management 12, 3 (2001), 212--238.",
      "doi": ""
    },
    {
      "text": "Charlan J Nemeth, Bernard Personnaz, Marie Personnaz, and Jack A Goncalo. 2004. The liberating role of conflict in group creativity: A study in two countries. European Journal of Social Psychology 34, 4 (2004), 365--374.",
      "doi": ""
    },
    {
      "text": "Mancur Olson. 1965. The logic of collective action: Public goods and the theory of groups. Cambridge, Mass (1965).",
      "doi": ""
    },
    {
      "text": "Siobhán O'Mahony and Fabrizio Ferraro. 2007. The emergence of governance in an open source community. Academy of Management Journal 50, 5 (2007), 1079--1106.",
      "doi": ""
    },
    {
      "text": "Scott E Page. 2008. The difference: How the power of diversity creates better groups, ?rms, schools, and societies. Princeton University Press. ",
      "doi": "10.5555/1296125"
    },
    {
      "text": "Scott E Page. 2010. Diversity and complexity. Princeton University Press. ",
      "doi": "10.5555/1984802"
    },
    {
      "text": "Linda Peters and Ronald J Karren. 2009. An examination of the roles of trust and functional diversity on virtual team performance ratings. Group & Organization Management (2009).",
      "doi": ""
    },
    {
      "text": "Kristopher J Preacher and Andrew F Hayes. 2004. SPSS and SAS procedures for estimating indirect effects in simple mediation models. Behavior research methods, instruments, & computers 36, 4 (2004), 717--731.",
      "doi": ""
    },
    {
      "text": "Sam Ransbotham and Gerald C Kane. 2011. Membership turnover and collaboration success in online communities: Explaining rises and falls from grace in Wikipedia. MIS Quarterly 35, 3 (2011), 613. ",
      "doi": "10.5555/2208923.2208929"
    },
    {
      "text": "Yuqing Ren, Jilin Chen, and John Riedl. 2015. The Impact and Evolution of Group Diversity in Online Open Collaboration. Management Science (2015).",
      "doi": ""
    },
    {
      "text": "Lionel Robert and Daniel M Romero. 2015. Crowd Size, Diversity and Performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1379--1382.  ",
      "doi": "10.1145/2702123.2702469"
    },
    {
      "text": "Lionel P Robert and Daniel M Romero. 2016. The influence of diversity and experience on the effects of crowd size. Journal of the Association for Information Science and Technology (2016).  ",
      "doi": "10.1002/asi.23653"
    },
    {
      "text": "Pnina Shachaf. 2008. Cultural diversity and information and communication technology impacts on global virtual teams: An exploratory study. Information & Management 45, 2 (2008), 131--142.  ",
      "doi": "10.1016/j.im.2007.12.003"
    },
    {
      "text": "James Surowiecki. 2005. The wisdom of crowds. Anchor. ",
      "doi": "10.5555/1095645"
    },
    {
      "text": "Daan Van Knippenberg, Carsten KW De Dreu, and Astrid C Homan. 2004. Work group diversity and group performance: an integrative model and research agenda. Journal of applied psychology 89, 6 (2004), 1008.",
      "doi": ""
    },
    {
      "text": "Daan Van Knippenberg and Michaela C. Schippers. 2007. Work group diversity. Annu. Rev. Psychol. 58 (2007), 515--541.",
      "doi": ""
    },
    {
      "text": "Fernanda B Viégas, Martin Wattenberg, and Kushal Dave. 2004. Studying cooperation and conflict between authors with history flow visualizations. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 575--582.  ",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "K Williams and Charles O'Reilly. 1998. The complexity of diversity: A review of forty years of research. Research in organizational behavior 21 (1998), 77--140.",
      "doi": ""
    },
    {
      "text": "Taha Yasseri, Robert Sumi, András Rung, András Kornai, and János Kertész. 2012. Dynamics of conflicts in Wikipedia. PloS one 7, 6 (2012), e38869.",
      "doi": ""
    }
  ]
}