{
  "doi": "10.1145/3025453.3025681",
  "title": "ThirdEye: Simple Add-on Display to Represent Remote Participant's Gaze Direction in Video Communication",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5307-5312",
  "year": 2017,
  "badges": [],
  "abstract": "A long-standing challenge in video-mediated communication systems is to represent a remote participant's gaze direction in local environments correctly. To address this issue, we developed ThirdEye, an add-on eye-display for a video communication system. This display is made from an artificial ulexite (TV rock) that is cut into a hemispherical shape, enabling light from the bottom surface to be projected onto the hemisphere surface. By drawing an appropriate ellipse on an LCD and placing ThirdEye over it, this system simulates an eyeball. Our experiment proved that an observer could perceive a remote Looker's gaze direction more precisely when the gaze was presented using ThirdEye compared to the case in which the gaze was presented using the Looker's face on a flat display.",
  "authors": [
    {
      "name": "Mai Otsuki",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81448596239/rel-imgonly/img_2014.jpg",
      "acmid": "81448596239",
      "orcid": "missing"
    },
    {
      "name": "Taiki Kawano",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659079667",
      "orcid": "missing"
    },
    {
      "name": "Keita Maruyama",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659078952",
      "orcid": "missing"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Yusuke Suzuki",
      "institution": "OKI Electric Industry Co., Ltd., Warabi, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81554619056",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sigurdur O. Adalgeirsson, and Cynthia Breazeal. 2010. MeBot: a robotic platform for socially embodied presence. In Proceedings of the 5th ACM/IEEE international conference on Human-robot interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 15--22. ",
      "doi": "10.5555/1734454.1734467"
    },
    {
      "text": "Eric Brockmeyer, Ivan Poupyrev, and Scott Hudson. 2013. PAPILLON: designing curved display surfaces with printed optics. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 457--462.  ",
      "doi": "10.1145/2501988.2502027"
    },
    {
      "text": "Frédéric Delaunay, Joachim de Greeff, and Tony Belpaeme. 2010. A study of a retro-projected robotic face and its effectiveness for gaze reading by humans. In Proceedings of the 5th ACM/IEEE international conference on Human-robot interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 39--44. ",
      "doi": "10.5555/1734454.1734471"
    },
    {
      "text": "Jens Edlund, Samer Al Moubayed, and Jonas Beskow. 2011. The Mona Lisa gaze effect as an objective metric for perceived cospatiality. In Proceedings of the 10th international conference on Intelligent virtual agents (IVA'11), Hannes Högni Vilhjálmsson, Stefan Kopp, Stacy Marsella, and Kristinn R. Thórisson (Eds.). Springer-Verlag, Berlin, Heidelberg, 439--440. ",
      "doi": "10.5555/2041666.2041727"
    },
    {
      "text": "John V. Forrester, Andrew D. Dick, Paul G. McMenamin, Fiona Roberts, and Eric Pearlman. 2015. The eye: Basic sciences in practice (4th ed.). Saunders Ltd.",
      "doi": ""
    },
    {
      "text": "Susan R. Fussell, Leslie D. Setlock, and Elizabeth M. Parker. 2003. Where do helpers look? Gaze targets during collaborative physical tasks. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 768--769.  ",
      "doi": "10.1145/765891.765980"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. World-stabilized annotations and virtual scene navigation for remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 449--459.  ",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "Charles Goodwin. 1994. Professional vision, American anthropologist, Vol. 96, No. 3, 606--633.",
      "doi": ""
    },
    {
      "text": "Christian Heath and Paul Luff. 1991. Disembodied conduct: communication through video in a multimedia office environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91), Scott P. Robertson, Gary M. Olson, and Judith S. Olson (Eds.). ACM, New York, NY, USA, 99--103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Keita Higuchi, Ryo Yonetani, and Yoichi Sato. 2016. Can Eye Help You? Effects of Visualizing Eye Fixations on Remote Collaboration Scenarios for Physical Tasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5180--5190.  ",
      "doi": "10.1145/2858036.2858438"
    },
    {
      "text": "Tomoko Imai, Dairoku Sekiguchi, Masahiko Inami, Naoki Kawakami, and Susumu Tachi. 2006. Measuring gaze direction perception capability of humans to design human centered communication systems. Presence, Vol. 15, No.2 (Apr. 2006), 123--138.  ",
      "doi": "10.1162/pres.2006.15.2.123"
    },
    {
      "text": "Hiroshi Ishii, Minoru Kobayashi, and Jonathan Grudin. 1993. Integration of interpersonal space and shared workspace: ClearBoard design and experiments. ACM Trans. Inf. Syst. 11, 4 (October 1993), 349--375.  ",
      "doi": "10.1145/159764.159762"
    },
    {
      "text": "Ikkaku Kawaguchi, Hideaki Kuzuoka, and Yusuke Suzuki. 2015. Study on Gaze Direction Perception of Face Image Displayed on Rotatable Flat Display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1729--1737.  ",
      "doi": "10.1145/2702123.2702369"
    },
    {
      "text": "Hiroaki Kawanobe, Yoshifumi Aosaki, Hideaki Kuzuoka, and Yusuke Suzuki. 2013. iRIS: a remote surrogate for mutual reference. In Proceedings of the 8th ACM/IEEE international conference on Human-robot interaction (HRI '13). IEEE Press, Piscataway, NJ, USA, 403--404. ",
      "doi": "10.5555/2447556.2447690"
    },
    {
      "text": "Adam Kendon. 1967. Some functions of gaze-direction in social interaction, Acta Psychologica 26, 22--63.",
      "doi": ""
    },
    {
      "text": "Sven Mayer, Katrin Wolf, Stefan Schneegass, and Niels Henze. 2015. Modeling Distant Pointing for Compensating Systematic Displacements. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4165--4168.  ",
      "doi": "10.1145/2702123.2702332"
    },
    {
      "text": "Kana Misawa, Yoshio Ishiguro, and Jun Rekimoto. 2012. LiveMask: a telepresence surrogate system with a face-shaped screen for supporting nonverbal communication. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12), Genny Tortora, Stefano Levialdi, and Maurizio Tucci (Eds.). ACM, New York, NY, USA, 394--397.  ",
      "doi": "10.1145/2254556.2254632"
    },
    {
      "text": "Moore, C.; Dunham, P (1995). Joint Attention: Its Origins and Role in Development. Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Bonnie A. Nardi, Heinrich Schwarz, Allan Kuchinsky, Robert Leichner, Steve Whittaker, and Robert Sclabassi. 1993. Turning away from talking heads: the use of video-as-data in neurosurgery. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93). ACM, New York, NY, USA, 327--334.  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Hirotaka Osawa, Ren Ohmura, and Michita Imai. 2009. Using attachable humanoid parts for realizing imaginary intention and body image. International Journal of Social Robotics, Vol. 1, No. 1 (Jan. 2009), 109--123.",
      "doi": ""
    },
    {
      "text": "David Sirkin and Wendy Ju. 2012. Consistency in physical and on-screen action improves perceptions of telepresence robots. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction (HRI '12). ACM, New York, NY, USA, 57--64.  ",
      "doi": "10.1145/2157689.2157699"
    },
    {
      "text": "Roel Vertegaal, Robert Slagter, Gerrit van der Veer, and Anton Nijholt. 2001. Eye gaze patterns in conversations: there is more to conversational agents than meets the eyes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 301--308.  ",
      "doi": "10.1145/365024.365119"
    }
  ]
}