{
  "doi": "10.1145/3025453.3025527",
  "title": "The Value of Experience-Centred Design Approaches in Dementia Research Contexts",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1326-1338",
  "year": 2017,
  "badges": [],
  "abstract": "Experience-Centred Design (ECD) has been applied in numerous HCI projects to call attention to the particular and dialogical nature of people's experiences with technology. In this paper, we report on ECD within the context of publicly-funded, long-stay residential dementia care, where the approach helped to highlight aspects of participants' felt experience, and informed sensitive and meaningful design responses. This study contributes an extended understanding of the quality of experience and the means of making sense in dementia, as well as unpicking the potential of ECD to support enriched experience and contextual meaning-making for people with dementia. Finally, we delineate what it is about Experience-Centred Design that differentiates the approach from other often-used approaches in designing in dementia contexts: 1) explorative thinking, 2) working within 'cuttings-out of time and space', 3) careful yet expressive methodology and documentation, and 4) working together to imagine futures. We end with considerations of how the contributions of this research may extend to other experience-centred projects in challenging settings.",
  "tags": [
    "embodiment",
    "dementia",
    "experience",
    "design approaches",
    "design methods",
    "experience-centred design"
  ],
  "authors": [
    {
      "name": "Kellie Morrissey",
      "institution": "Newcastle University, Newcastle-Upon-Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059070757",
      "orcid": "0000-0002-6962-6920"
    },
    {
      "name": "John McCarthy",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406600199",
      "orcid": "missing"
    },
    {
      "name": "Nadia Pantidi",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418594586",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Katherine Abbott and Mark C. Pachucki. 2016. Associations between social network characteristics, cognitive function, and quality of life among residents in a dementia special care unit: A pilot study. Dementia, 1 (4): 71--83. ",
      "doi": ""
    },
    {
      "text": "Norman Alm, Richard Dye, Gary Gowans, Jim Campbell, Arlene Astell, and Maggie Ellis. 2002. Designing an interface usable by people with dementia. In Proceedings of the 2003 conference on Universal usability (CUU '03). ACM, New York, NY, USA, 156157. DOI= http://dx.doi.org/10.1145/957205.957237  ",
      "doi": "10.1145/957205.957237"
    },
    {
      "text": "Hamdi Aloulou, Mounir Mokhtari, Thibaut Tiberghien, Jit Biswas, Clifton Phua, Jin Hong Kenneth Lin, and Philip Yap. 2013. Deployment of assistive living technology in a nursing home environment: methods and lessons learned. BMC Medical Informatics and Decision Making, 13 (1). ",
      "doi": ""
    },
    {
      "text": "Ashok Bharucha, Vivek Anand, Jodi Forlizzi, Mary Amanda Dew, Charles F. Reynolds, Scott Stevens, and Howard Wactlar. 2009. Intelligent assistive technology applications to dementia care: current capabilities, limitations, and future challenges. The American Journal of Geriatric Psychiatry, 17(2): 88--104. ",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-Solutionist Strategies: Seriously Silly Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4968--4978. DOI: http://dx.doi.org/10.1145/2858036.2858482  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Froydis Kristine Bruvik, Ingun Dina Ulstein, Anette Hylen Ranhoff, and Knut Engedal. 2012. The quality of life of people with dementia and their family carers. Dementia and Geriatric Cognitive Disorders, 34 (1): 714. ",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Rob Mitchell. 2001. Grounded theory in ethnography. In: Atkinson, P., Coffey, A., Delamont, S., et al. (eds) Handbook of Ethnography. Thousand Oaks, CA: SAGE, pp. 160--174. ",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Peter Wright, Madeline Balaam, and John McCarthy. 2013. Digital portraits: photo-sharing after domestic violence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2517--2526. DOI= http://dx.doi.org/10.1145/2470654.2481348  ",
      "doi": "10.1145/2470654.2481348"
    },
    {
      "text": "Stefano Federici, Marcia J. Scherer, and Simone Borsci. 2014. An ideal model of an assistive technology assessment and delivery process. Technology and Disability, 26 (1): 27--38.",
      "doi": ""
    },
    {
      "text": "Gemma Fiumara. 1990. The Other Side of Language: A Philosophy of Listening, trans. Charles Lambert. London: Routledge.",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 233--240. DOI= http://dx.doi.org/10.1145/642611.642653  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Erving Goffman. 1961. Asylums: essays on the social situation of mental patients and other inmates. Doubleday Publishers.",
      "doi": ""
    },
    {
      "text": "Jacob Gubrium. 1975. Living and dying at Murray Manor. Charlottesville: University of Virginia Press.",
      "doi": ""
    },
    {
      "text": "Deborah Hicks. 2000. Self and other in Bakhtin's early philosophical essays: Prelude to a theory of prose consciousness. Mind, Culture, and Activity, 7 (3): 227242. ",
      "doi": ""
    },
    {
      "text": "Kristine Holbø, Silje Bøthun, and Yngve Dahl. 2013. Safe walking technology for people with dementia: what do they want? In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, , Article 21 , 8 pages. DOI: http://dx.doi.org/10.1145/2513383.2513434  ",
      "doi": "10.1145/2513383.2513434"
    },
    {
      "text": "Louise Hopper, Paulina Piasek & Kate Irving. 2015. Ethical Challenges Associated with Technology use with People with Dementia. International Association of Geriatrics and Gerontology, Dublin, April 2015.",
      "doi": ""
    },
    {
      "text": "Julian C. Hughes, Stephen J. Louw, Steven R. Sabat. 2006. Dementia: Mind, Meaning, and the Person. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Amy S. Hwang, Khai N. Truong, and Alex Mihailidis. 2016. Expanding design possibilities for life with dementia. Interactions, 23 (3), 59--61. DOI= http://dx.doi.org/10.1145/2899380  ",
      "doi": "10.1145/2899380"
    },
    {
      "text": "John Killick and Claire Craig. 2011. Creativity and Communication in Persons with Dementia: A Practical Guide. London: Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Pia C. Kontos, and Gary Naglie. 2006. Expressions of personhood in Alzheimer's: Moving from ethnographic text to performing ethnography. Qualitative Research, 6 (3), 301--317. ",
      "doi": ""
    },
    {
      "text": "Amanda Lazar. 2014. Using Technology to Increase Meaningful Engagement in a Memory Care Unit. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14). ACM, New York, NY, USA, 255--257. DOI= http://dx.doi.org/10.1145/2660398.2660433  ",
      "doi": "10.1145/2660398.2660433"
    },
    {
      "text": "Ruth Landau and Shirli Werner. 2012. Ethical aspects of using GPS for tracking people with dementia: recommendations for practice. International Psychogeriatrics, 24 (3): 358--366. ",
      "doi": ""
    },
    {
      "text": "Claudia K. Y. Lai and David G. Arthur. 2003. Wandering behaviour in people with dementia. Journal of Advanced Nursing, 44 (2): 173--182. ",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 521--530. DOI= http://dx.doi.org/10.1145/2207676.2207749  ",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "João Martins, José Carilho, Oliver Schnell, Carlos Duarte, Francisco M. Couto, Luís Carriço, and Tiago Guerreiro. 2014. Friendsourcing the unmet needs of people with dementia. In Proceedings of the 11th Web for All Conference (W4A '14). ACM, New York, NY, USA. DOI= http://dx.doi.org/10.1145/2596695.2596716  ",
      "doi": "10.1145/2596695.2596716"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as Experience. Cambridge: MIT Press.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking [A]part: The Politics and Aesthetics of Participation in Experience-Centred Design. Cambridge: MIT Press.",
      "doi": ""
    },
    {
      "text": "John McCarthy, Peter Wright, Jayne Wallace, and Andy Dearden. 2006. The experience of enchantment in human--computer interaction. Personal Ubiquitous Comput. 10, 369--378. DOI= http://dx.doi.org/10.1007/s00779-005-0055--2",
      "doi": ""
    },
    {
      "text": "Kellie Morrissey and John McCarthy. 2015. Creative and Opportunistic Use of Everyday Music Technologies in a Dementia Care Unit. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, New York, NY, USA, 295--298. DOI= http://dx.doi.org/10.1145/2757226.2757228  ",
      "doi": "10.1145/2757226.2757228"
    },
    {
      "text": "Kellie Morrissey, Gavin Wood, David Green, Nadia Pantidi, and John McCarthy. 2016. 'I'm a rambler, I'm a gambler, I'm a long way from home': The Place of Props, Music, and Design in Dementia Care. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 1008--1020. DOI: https://doi.org/10.1145/2901790.2901798",
      "doi": "10.1145/2901790.2901798"
    },
    {
      "text": "Maurice Mulvenna, Suzanne Martin, Stefan Sävenstedt, Johan Bengtsson, Franka Meiland, Rose Marie Dröes, Marike Hettinga, Ferial Moelaert, and David Craig. 2010. Designing & evaluating a cognitive prosthetic for people with mild dementia. In Proceedings of the 28th Annual European Conference on Cognitive Ergonomics (ECCE '10). ACM, New York, NY, USA, 11--18. DOI= http://dx.doi.org/10.1145/1962300.1962306  ",
      "doi": "10.1145/1962300.1962306"
    },
    {
      "text": "Louise Nolan, Mary McCarron, Phillip McCallion, & Jo Murphy-Lawless. 2006. Perceptions of stigma in dementia: an exploratory study. Retrieved from: https://www.lenus.ie/hse/handle/10147/299918, June 17th, 2015.",
      "doi": ""
    },
    {
      "text": "Patrick Olivier, Guangyou Xu, Andrew Monk, and Jesse Hoey. 2009. Ambient kitchen: designing situated services using a high fidelity prototyping environment. In Proceedings of the 2nd International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '09). ACM, New York, NY. DOI= http://dx.doi.org/10.1145/1579114.1579161  ",
      "doi": "10.1145/1579114.1579161"
    },
    {
      "text": "Catherine Oppenheimer. 2006. I am, thou art: Personal identity in dementia. In Hughes, J. C., Stephen J. Louw, Steven R. Sabat. Dementia: Mind, Meaning, and the Person. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Deborah Reed-Danahay. 2006. 'This is your home now!': conceptualizing location and dislocation in a dementia unit. Qualitative Research, 1 (1), 47--63. ",
      "doi": ""
    },
    {
      "text": "Yoichi Sakai, Yuuko Nonaka, Kiyoshi Yasuda, and Yukiko I. Nakano. 2012. Listener agent for elderly people with dementia. In Proceedings of the seventh annual ACM/IEEE international conference on Human-Robot Interaction (HRI '12). ACM, New York, NY, USA, 199--200. DOI= http://dx.doi.org/10.1145/2157689.2157754  ",
      "doi": "10.1145/2157689.2157754"
    },
    {
      "text": "Vardit Sarne-Fleischmann, Noam Tractinsky, Tzvi Dwolatzky, and Inbal Rief. 2011. Personalized reminiscence therapy for patients with Alzheimer's disease using a computerized system. In Proceedings of the 4th International Conference on Pervasive Technologies Related to Assistive Environments (PETRA '11). ACM, New York, NY, USA. DOI= http://dx.doi.org/10.1145/2141622.2141679  ",
      "doi": "10.1145/2141622.2141679"
    },
    {
      "text": "Keith Sawyer. (2003). Improvised dialogues: Emergence and creativity in conversation. Greenwood Publishing.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Paula Johnson, John McCarthy, Siân Lindley, Peter Wright, Patrick Olivier, and Thomas D. Meyer. 2013. Design to promote mindfulness practice and sense of self for vulnerable women in secure hospital services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2647--2656. DOI= http://dx.doi.org/10.1145/2470654.2481366  ",
      "doi": "10.1145/2470654.2481366"
    },
    {
      "text": "Julia Twigg. 2000. Bathing: the body and community care. Routledge Psychology Press. ",
      "doi": ""
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Trans. Comput.-Hum. Interact. 22, 1, Article 2. DOI= http://dx.doi.org/10.1145/2696867  ",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Loic Wacquant. 2005. Carnal connections: On embodiment, apprenticeship, and membership. Qualitative Sociology, 28 (4), 445--474. ",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia: an enquiry into design in a hospital setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 26292638. DOI= http://dx.doi.org/10.1145/2207676.2208654  ",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C. Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3441--3450. DOI= http://dx.doi.org/10.1145/2470654.2466473  ",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2617--2626. http://doi.acm.org/10.1145/2470654.2481363  ",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Walmsley, Bruce, and Lynne McCormack. 2015. Shame, hope, intimacy and growth: Dementia distress and growth in families from the perspective of senior aged care professionals. Dementia, 14 (7) - 121--130.",
      "doi": ""
    },
    {
      "text": "Xi Wang. 2012. The construction of researcher - researched relationships in school ethnography: doing research, participating in the field and reflecting on ethical dilemmas. International Journal of Qualitative Studies in Education, 26 (7), 763--779. ",
      "doi": ""
    },
    {
      "text": "Joe Wherton and Andrew Monk. 2006. Designing cognitive supports for dementia. SIGACCESS Access. Comput. 86, 28--31. DOI= http://dx.doi.org/10.1145/1196148.1196155  ",
      "doi": "10.1145/1196148.1196155"
    },
    {
      "text": "Hui-Xin Wang, Anita Karp, Bengt Winblad, and Laura Fratiglioni. 2002. Late-life engagement in social and leisure activities is associated with a decreased risk of dementia: a longitudinal study from the Kungsholmen project. American Journal of Epidemiology, 155 (12): 1081--1087. ",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2010. ExperienceCentred Design. Cambridge: MIT Press.",
      "doi": ""
    },
    {
      "text": "Huiru Zheng, Chris Nugent, Paul McCullagh, Yan Huang, Shumei Zhang, William Burns, & Richard Davies. 2010. Smart self management: assistive technology to support people with chronic disease. Journal of Telemedicine and Telecare, 16 (4): 224--227. ",
      "doi": ""
    }
  ]
}