{
  "doi": "10.1145/3025453.3025715",
  "title": "Connecting Those That Care: Designing for Transitioning, Talking, Belonging and Escaping",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1339-1351",
  "year": 2017,
  "badges": [],
  "abstract": "Care provision in many nations increasingly relies on the work of informal, or non-professional, carers. Often these carers experience substantial disruptions and reductions to their own sociality, weakened social support networks and, ultimately, a heightened risk of social isolation. We describe a qualitative study, comprised of interviews, design workshops and probes, that investigated the social and community support practices of carers. Our findings highlight issues related to becoming and recognising being a carer, and feelings of being ignored by, and isolated from, others. We also note the benefits that sharing between carers can bring, and routes to coping and relaxing from the burdens of care. We conclude with design considerations for facilitating new forms of digitally mediated support that connect those that care, emphasising design qualities related to transitioning, talking, belonging and escaping.",
  "tags": [
    "informal care",
    "qualitative study",
    "carers",
    "co-design"
  ],
  "authors": [
    {
      "name": "Kiel Long",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557422756",
      "orcid": "missing"
    },
    {
      "name": "Lyndsey L. Bakewell",
      "institution": "Loughborough University, Loughborough, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160506",
      "orcid": "missing"
    },
    {
      "name": "Roisin C. McNaney",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484658582",
      "orcid": "0000-0003-3761-296X"
    },
    {
      "name": "Konstantina Vasileiou",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162716",
      "orcid": "missing"
    },
    {
      "name": "Mark Atkinson",
      "institution": "University of Exeter, Exeter, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161501",
      "orcid": "missing"
    },
    {
      "name": "Manuela Barreto",
      "institution": "University of Exeter, Exeter, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161609",
      "orcid": "missing"
    },
    {
      "name": "Julie Barnett",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158781057",
      "orcid": "missing"
    },
    {
      "name": "Michael Wilson",
      "institution": "Loughborough University, Loughborough, United Kingdom",
      "img": "/do/10.1145/contrib-99659161774/rel-imgonly/michaelwilson.jpg",
      "acmid": "99659161774",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Ronald Adelman, Lyubov Tmanova, Diana Delgado, Sarah Dion and Mark Lachs. 2014. Caregiver Burden: A Clinical Review. In JAMA, 311 (10), 1052--1060. DOI: 10.1001/jama.2014.304. ",
      "doi": ""
    },
    {
      "text": "Kristina Andersen. 2013. Making Magic Machines. 10th European Academy of Design ConferenceCrafting the Future. DOI: 10.13140/2.1.1280.1285",
      "doi": ""
    },
    {
      "text": "Ron Baecker, Kate Sellen, Sarah Crosskey, Veronique Boscart, and Barbara Barbosa Neves. 2014. Technology to reduce social isolation and loneliness. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS '14). ACM, NY, NY, USA, 27--34. DOI: http://dx.doi.org/10.1145/2661334.2661375  ",
      "doi": "10.1145/2661334.2661375"
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2271--2274. DOI: http://dx.doi.org/10.1145/1978942.1979275  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Natalya N. Bazarova. 2012. Contents and contexts: disclosure perceptions on facebook. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 369--372. DOI: http://dx.doi.org/10.1145/ 2145204.2145262",
      "doi": "10.1145/2145204.2145262"
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-Solutionist Strategies: Seriously Silly Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 4968--4978. DOI: http://dx.doi.org/10.1145/2858036.2858482  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Virginia Braun, and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology. 3 (2). 77--101. DOI: 10.1191/1478088706qp063oa ",
      "doi": ""
    },
    {
      "text": "Caregiving | Family Caregiver Alliance Retrieved 4Sept-2016 From: https://www.caregiver.org/caregiving",
      "doi": ""
    },
    {
      "text": "Mary Chambers, A. A. Ryan, and S. L. Connor. 2001, Exploring the emotional support needs and coping strategies of family carers. Journal of Psychiatric and Mental Health Nursing, 8: 99--106. DOI:",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: designing for integrality. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 91--102. DOI: http://dx.doi.org/10.1145/2441776.2441789  ",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Katherine Y. Chuang, and Christopher C Yang. 2010. Helping you to help me: exploring supportive interaction in online health community. In Proceedings of the American Society for Information Science and Technology, 47(1), 1--10. DOI: 10.1002/meet.14504701140 ",
      "doi": ""
    },
    {
      "text": "Elizabeth C. Clipp, and Linda K. George. 1990. Caregiver Needs and Patterns of Social Support. Journal of Gerontology , 45 (3). 102--111. DOI: 10.1093/geronj/45.3.S102 ",
      "doi": ""
    },
    {
      "text": "Andy Crabtree, Terry Hemmings, Tom Rodden, Keith Cheverst, Karen Clarke, Guy Dewsbury, John Hughes, and Mark Rouncefield. 2003. Designing with care: Adapting cultural probes to inform design in sensitive settings. In Proceedings of the 2003 Australasian Conference on Computer-Human Interaction (OZCHI2003), pp. 4--13.",
      "doi": ""
    },
    {
      "text": "Matty Cruijsberg, Martijn H. Vastenburg, and Pieter Jan Stappers. 2012. Family Carebook: A Case Study on Designing Peace of Mind for Family Caregivers. In Ambient Intelligence-Software and Applications. 129--136. Springer Berlin Heidelberg. DOI: 10.1007/978-3-642-28783-1_16 ",
      "doi": ""
    },
    {
      "text": "John F. Deeken, Kathryn L. Taylor, Patricia Mangan, K. Robin Yabroff, and Jane M. Ingham. 2003. Care for the caregivers: a review of self-report instruments developed to measure the burden, needs, and quality of life of informal caregivers. Journal of Pain and Symptom Management. 26, 4: 922--953. DOI: 10.1016/S0885-3924(03)00327-0 ",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2397--2406. DOI: http://dx.doi.org/10.1145/2556288.2557359  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Elizabeth H. Ehleringer and Si Jung Kim. 2013. The Wearable Lullaby: Improving Sleep Quality of Caregivers of Dementia Patients. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, 409--414. DOI: http://doi.org/10.1145/2468356.2468429  ",
      "doi": "10.1145/2468356.2468429"
    },
    {
      "text": "Carolina Fuentes, Valeria Herskovic, Jurgen Heysen, and Monica Tentori. 2013. Towards a technology for caregivers' emotional expression and self-reflection. In International Conference on Ubiquitous Computing and Ambient Intelligence. 143--150. Springer International Publishing. DOI: 10.1007/978-3-31903176-7_19",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural probes. interactions 6, 1 (January 1999), 21--29. DOI: http://dx.doi.org/10.1145/291224.291235  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Rachael Gooberman-Hill and Shah Ebrahim. 2006. Informal Care At Times Of Change In Health And Mobility: A Qualitative Study. In Age And Ageing. 35 (3). 261--266. DOI: 10.1093/ageing/afj065 ",
      "doi": ""
    },
    {
      "text": "Kirstie Hawkey, Kori M. Inkpen, Kenneth Rockwood, Michael McAllister, and Jacob Slonim. 2005. Requirements gathering with alzheimer's patients and caregivers. In Proceedings of the 7th international ACM SIGACCESS conference on Computers and accessibility (Assets '05). ACM, NY, NY, USA, 142--149. DOI: http://dx.doi.org/10.1145/1090785.1090812  ",
      "doi": "10.1145/1090785.1090812"
    },
    {
      "text": "Laura Hayes, Graeme Hawthorne, John Farhall, Brendan O'Hanlon, Carol Harvey. 2015. Quality of Life and Social Isolation Among Caregivers of Adults with Schizophrenia: Policy and Outcomes. Community Mental Health Journal, 51 (5), 591--597. DOI: 10.1007/s10597-015-9848-6 ",
      "doi": ""
    },
    {
      "text": "Susanne Hensely-Schinkinger, Aparecido Fabiano Pinatti de Carvalho, Michael Glanznig, and Hilda Tellioglu. 2015. The Definition and Use of Personas in the Design of Technologies for Informal Caregivers. In 17th International Conference on Human-Computer Interaction. 202--213. Springer International Publishing. DOI: 10.1007/978-3-319-20901-2_19 ",
      "doi": ""
    },
    {
      "text": "Frédérique Hoffmann, and Ricardo Rodrigues. 2010. Informal carers: who takes care of them?. Retrieved 4Sept-2016 From: http://www.euro.centre.org/data/1274190382_99603.p df",
      "doi": ""
    },
    {
      "text": "Nic Hughes, Louise Locock, and Sue Ziebland. 2013. Personal identity and the role of 'carer' among relatives and friends of people with multiple sclerosis. Social science & medicine 96 (2013): 78--85. ",
      "doi": ""
    },
    {
      "text": "Philip Ice, Reagan Curtis, Perry Phillips, and John Wells. 2007. Using Asynchronous Audio Feedback to Enhance Teaching Presence and Students' Sense of Community. Journal of Asynchronous Learning Networks. 11(2). 3--25.",
      "doi": ""
    },
    {
      "text": "Konstantinos Kazakos, Siddhartha Asthana, Madeline Balaam, Mona Duggal, Amey Holden, Limalemla Jamir, Nanda Kishore Kannuri, Saurabh Kumar, Amarendar Reddy Manindla, Subhashini Arcot Manikam, GVS Murthy, Papreen Nahar, Peter Phillimore, Shreyaswi Sathyanath, Pushpendra Singh, Meenu Singh, Pete Wright, Deepika Yadav, and Patrick Olivier. 2016. A Real-Time IVR Platform for Community Radio. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 343--354. DOI: http://dx.doi.org/10.1145/2858036.2858585  ",
      "doi": "10.1145/2858036.2858585"
    },
    {
      "text": "Hyesook Kim, Andrew Monk, Gavin Wood, Mark Blythe, Jayne Wallace, and Patrick Olivier. 2013. TimelyPresent: Connecting families across continents. International Journal of Human-Computer Studies. 71(10). 1003--1011  ",
      "doi": "10.1016/j.ijhcs.2013.05.001"
    },
    {
      "text": "Kate Lacey, 2014. Smart radio and audio apps: The politics and paradoxes of listening to (anti-) social media. Australian Journalism Review, 36(2), 77--89",
      "doi": ""
    },
    {
      "text": "Heisook Lee and Sunsook Noh. 2003. Educational Use of E-mentoring to Encourage Women into Science and Engineering. In Web and Communication Technologies and Internet-Related Social Issues -- HSI 2003. Springer Berlin Heidelberg, 75--84.",
      "doi": ""
    },
    {
      "text": "Leslie S. Liu, Sen H. Hirano, Monica Tentori, Karen G. Cheng, Sheba George, Sun Young Park, and Gillian R. Hayes. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. In Proceedings of the ACM 2011 conference on Computer supported cooperative work (CSCW '11). ACM, NY, NY, USA, 475--484. DOI: http://dx.doi.org/10.1145/1958824.1958897  ",
      "doi": "10.1145/1958824.1958897"
    },
    {
      "text": "Diane Maloney-Krichmar and Jenny Preece. 2005. A multilevel analysis of sociability, usability, and community dynamics in an online health community. ACM Trans. Comput.-Hum. Interact. 12, 2 (June 2005), 201--232. DOI: http://dx.doi.org/10.1145/1067860.1067864  ",
      "doi": "10.1145/1067860.1067864"
    },
    {
      "text": "Michael Massimi. 2013. Exploring remembrance and social support behavior in an online bereavement support group. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 1169--1180. DOI: http://dx.doi.org/10.1145/2441776.2441908  ",
      "doi": "10.1145/2441776.2441908"
    },
    {
      "text": "Michael Massimi, Jackie L. Bender, Holly O. Witteman, and Osman H. Ahmed. 2014. Life transitions and online health communities: reflecting on adoption, use, and disengagement. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1491--1501. DOI: http://dx.doi.org/10.1145/2531602.2531622  ",
      "doi": "10.1145/2531602.2531622"
    },
    {
      "text": "Chandylen Nightingale, Barbara Curbow, John Wingard, Deidre Pereira and Giselle Carnaby. 2016. Burden, quality of life, and social support in caregivers of patients undergoing radiotherapy for head and neck cancer: A pilot study. Chronic Illness, 12 (3), 236--245. DOI: 10.1177/1742395316644305 ",
      "doi": ""
    },
    {
      "text": "Jody Oomen-Early, Mary Bold, Kristin L. Wiginton, Tara L. Gallien, and Nancy Anderson. 2008. Using asynchronous audio communication (AAC) in the online classroom: A comparative study. Journal of Online Learning and Teaching. 4(3). 267--276.",
      "doi": ""
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 787--799. DOI: http://dx.doi.org/10.1145/2818048.2819999  ",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Venkatesh Sivaraman, Dongwook Yoon, and Piotr Mitros. 2016. Simplified Audio Production in Asynchronous Voice-Based Discussions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1045--1054. DOI: http://dx.doi.org/10.1145/2858036.2858416  ",
      "doi": "10.1145/2858036.2858416"
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Communications of the ACM 38, 9 (September 1995), 56--64. DOI: http://dx.doi.org/10.1145/223248.223263  ",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Carl A. Thompson, Karen Spilsbury, Jill Hall, Yvonne Birks, Colin Barnes, and Joy Adamson. 2007. Systematic review of information and support interventions for caregivers of people with dementia. BMC geriatrics 7(18) doi:10.1186/1471--2318--7--18",
      "doi": ""
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for Respite and Support: Technological Opportunities for Spousal Caregivers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1155--1158. DOI: http://dx.doi.org/10.1145/2702123.2702563  ",
      "doi": "10.1145/2702123.2702563"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. \"Counting on the Group\": Reconciling Online and Offline Social Support among Older Informal Caregivers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3545--3558. DOI: http://dx.doi.org/10.1145/2858036.2858477  ",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Michelle Van Ruyn, Sarah Sanders, Katharine Kahn, Courtney van Houtven, Joan Griffin, Sean Phelan, Michelle Martin, Audie Atienza, Deborah Finstad, and Julie Rowland. 2011. Objective Burden, Resources and Other Stressors Among Informal Cancer Caregivers: a hidden quality issue. Psycho-oncology. 20, 1. 44--52. DOI:10.1002/pon.1703 ",
      "doi": ""
    },
    {
      "text": "John Vines, Stephen Lindsay, Gary W. Pritchard, Mabel Lie, David Greathead, Patrick Olivier, and Katie Brittain. 2013. Making family care work: dependence, privacy and remote home monitoring telecare systems. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, NY, NY, USA, 607--616. DOI: http://dx.doi.org/10.1145/2493432.2493469  ",
      "doi": "10.1145/2493432.2493469"
    },
    {
      "text": "John Vines, Peter C. Wright, David Silver, Maggie Winchcombe, and Patrick Olivier. 2015. Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 82--94. DOI: http://dx.doi.org/10.1145/2675133.2675222  ",
      "doi": "10.1145/2675133.2675222"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner, and John Downs. 2013. Older adults as digital content producers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 39--48. DOI: http://dx.doi.org/10.1145/2470654.2470662  ",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2637--2646. DOI: http://dx.doi.org/10.1145/2470654.2481365.  ",
      "doi": "10.1145/2470654.2481365"
    }
  ]
}