{
  "doi": "10.1145/3025453.3025765",
  "title": "What Is Interaction?",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5040-5052",
  "year": 2017,
  "badges": [
    "Best Paper"
  ],
  "abstract": "The term interaction is field-defining, yet surprisingly confused. This essay discusses what interaction is. We first argue that only few attempts to directly define interaction exist. Nevertheless, we extract from the literature distinct and highly developed concepts, for instance viewing interaction as dialogue, transmission, optimal behavior, embodiment, and tool use. Importantly, these concepts are associated with different scopes and ways of construing the causal relationships between the human and the computer. This affects their ability to inform empirical studies and design. Based on this discussion, we list desiderata for future work on interaction, emphasizing the need to improve scope and specificity, to better account for the effects and agency that computers have in interaction, and to generate strong propositions about interaction.",
  "authors": [
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "John R. Anderson. 1996. ACT: A simple theory of complex cognition. American Psychologist 51, 4: 355.",
      "doi": ""
    },
    {
      "text": "Terence S. Andre, H. Rex Hartson, Steven M. Belz, and Faith A. McCreary. 2001. The user action framework: a reliable foundation for usability engineering support tools. International Journal of Human-Computer Studies 54, 1: 107--136.  ",
      "doi": "10.1006/ijhc.2000.0441"
    },
    {
      "text": "Christopher Baber. 200 Cognition and tool use: Forms of engagement in human and animal use of tools. CRC Press.",
      "doi": ""
    },
    {
      "text": "Ravin Balakrishnan. 200 \"Beating\" Fitts' Law: Virtual Enhancements for Pointing Facilitation. Int. J. Hum.-Comput. Stud. 61, 6: 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Liam Bannon. 2011. Reimagining HCI: toward a more human-centered perspective. interactions 18, 4: 50--57.  ",
      "doi": "10.1145/1978822.1978833"
    },
    {
      "text": "Javier A. Bargas-Avila and Kasper Hornbæk. 2011. Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience. In Proceedings of the 2011 annual conference on Human factors in computing systems, 2689--2698.  ",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental interaction: an interaction model for designing post-WIMP user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, 446--453.  ",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2004. Designing interaction, not interfaces. In Proceedings of the working conference on Advanced visual interfaces, 15--22.  ",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Suresh K. Bhavnani and Bonnie E. John. 2000. The strategic use of complex computer systems. Human-computer interaction 15, 2: 107--137.  ",
      "doi": "10.1207/S15327051HCI1523_3"
    },
    {
      "text": "Susanne Bødker. 1987. Through the interface-A human activity approach to user interface design. DAIMI Report Series 16, 224.",
      "doi": ""
    },
    {
      "text": "1Susanne Bødker. 1995. Applying activity theory to video analysis: how to make sense of video data in human-computer interaction. In Context and consciousness, 147--174. ",
      "doi": "10.5555/223826.223833"
    },
    {
      "text": "Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06), 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Mario Augusto Bunge. 1979. Causality and Modern Science. New York: Dover Publications.",
      "doi": ""
    },
    {
      "text": "Stuart K. Card, Allen Newell, and Thomas P. Moran. 1983. The psychology of human-computer interaction. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "John M. Carroll. 1997. Human-computer interaction: psychology as a science of design. Annual review of psychology 48, 1: 61--83.",
      "doi": ""
    },
    {
      "text": "John M. Carroll, Wendy A. Kellogg, and Mary Beth Rosson. 1991. The Task-artefact cycle. In Designing Interaction, John M. Carroll (ed.). Cambridge University Press, New York, NY, USA, 74--102. ",
      "doi": "10.5555/120352.120358"
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1 -- Filter: A Simple Speed-based Low-pass Filter for Noisy Input in Interactive Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2527--2530.  ",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Matthew Chalmers and Areti Galani. 2004. Seamful interweaving: heterogeneity in the theory and design of interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques, 243--252.  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "William S. Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American Statistical Association 79, 387: 531--554.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Philip Quinn, and Carl Gutwin. 2015. Examining the peak-end effects of subjective experience. In Proceedings of the 33rd annual ACM conference on human factors in computing systems, 357--366.  ",
      "doi": "10.1145/2702123.2702139"
    },
    {
      "text": "2Deborah R. Compeau and Christopher A. Higgins. 1995. Computer self-efficacy: Development of a measure and initial test. MIS quarterly: 189--211.  ",
      "doi": "10.2307/249688"
    },
    {
      "text": "2Andy Crabtree, Alan Chamberlain, Rebecca E. Grinter, Matt Jones, Tom Rodden, and Yvonne Rogers. 2013. Introduction to the special issue of \"The Turn to The Wild.\" ACM Transactions on Computer-Human Interaction (TOCHI) 20, 3: 13.  ",
      "doi": "10.1145/2491500.2491501"
    },
    {
      "text": "Pieter MA Desmet and Anna E. Pohlmeyer. 2013. Positive design: An introduction to design for subjective well-being. International Journal of Design, 7 (3), 2013.",
      "doi": ""
    },
    {
      "text": "Alan Dix. 2016. Human--computer interaction, foundations and new paradigms. Journal of Visual Languages & Computing.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Robert Dubin. 1969. Theory building. The Free Press, New York.",
      "doi": ""
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6: 381.",
      "doi": ""
    },
    {
      "text": "Samuel J. Gershman, Eric J. Horvitz, and Joshua B. Tenenbaum. 2015. Computational rationality: A converging paradigm for intelligence in brains, minds, and machines. Science 349, 6245: 273--278.",
      "doi": ""
    },
    {
      "text": "Wayne D. Gray and Deborah A. Boehm-Davis. 2000. Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology: Applied 6, 4: 322.",
      "doi": ""
    },
    {
      "text": "Wayne D. Gray and Wai-Tat Fu. 2001. Ignoring perfect knowledge in-the-world for imperfect knowledge in-the-head. In Proceedings of the SIGCHI conference on Human factors in computing systems, 112--119.  ",
      "doi": "10.1145/365024.365061"
    },
    {
      "text": "3Peter A. Hancock, Richard J. Jagacinski, Raja Parasuraman, Christopher D. Wickens, Glenn F. Wilson, and David B. Kaber. 2013. Human-automation interaction research past, present, and future. Ergonomics in Design: The Quarterly of Human Factors Applications 21, 2: 9--14.",
      "doi": ""
    },
    {
      "text": "3Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work, 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "3Jennefer Hart, Alistair G. Sutcliffe, and Antonella De Angeli. 2013. Love It or Hate It!: Interactivity and User Types. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2059--2068.  ",
      "doi": "10.1145/2470654.2481282"
    },
    {
      "text": "Marc Hassenzahl. 2004. The interplay of beauty, goodness, and usability in interactive products. Human-Computer Interaction 19, 4: 319--349.  ",
      "doi": "10.1207/s15327051hci1904_2"
    },
    {
      "text": "Marc Hassenzahl. 2008. User experience (UX): towards an experiential perspective on product quality. In Proceedings of the 20th Conference on l'Interaction Homme-Machine, 11--15.  ",
      "doi": "10.1145/1512714.1512717"
    },
    {
      "text": "Marc Hassenzahl. 2010. Experience design: Technology for all the right reasons. Synthesis Lectures on Human-Centered Informatics 3, 1: 1--95. ",
      "doi": "10.5555/1855019"
    },
    {
      "text": "3Marc Hassenzahl, Sarah Diefenbach, and Anja Göritz. 2010. Needs, affect, and interactive products -- Facets of user experience. Interacting with Computers 22, 5: 353--362.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "3Marc Hassenzahl and Noam Tractinsky. 2006. User experience - a research agenda. Behaviour & Information Technology 25, 2: 91--97.",
      "doi": ""
    },
    {
      "text": "3Martin G. Helander, Thomas K. Landauer, and Prasad V. Prabhu. 1997. Handbook of human-computer interaction. Elsevier. ",
      "doi": "10.5555/549940"
    },
    {
      "text": "Jesse Hoey, Tobias Schroder, and Areej Alhothali. 2013. Bayesian affect control theory. In Affective Computing and Intelligent Interaction (ACII), 2013 Humaine Association Conference on, 166--172.  ",
      "doi": "10.1109/ACII.2013.34"
    },
    {
      "text": "4Kasper Hornbæk. 2006. Current practice in measuring usability: Challenges to usability studies and research. International journal of human-computer studies 64, 2: 79--102.  ",
      "doi": "10.1016/j.ijhcs.2005.06.002"
    },
    {
      "text": "4Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "4Edwin L. Hutchins, James D. Hollan, and Donald A. Norman. 1985. Direct manipulation interfaces. Human--Computer Interaction 1, 4: 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "4Jacko, J. A. 2012. The Human-Computer Interaction Handbook. CRC Press. ",
      "doi": "10.5555/2378709"
    },
    {
      "text": "4Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, et al. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems CHI '08.  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "4Richard J. Jagacinski and John M. Flach. 2003. Control theory for humans: Quantitative approaches to modeling performance. CRC Press.",
      "doi": ""
    },
    {
      "text": "4Lars-Erik Janlert and Erik Stolterman. 2016. The Meaning of Interactivity--Some Proposals for Definitions and Measures. Human-Computer Interaction.  ",
      "doi": "10.1080/07370024.2016.1226139"
    },
    {
      "text": "4Grace J. Johnson, Gordon C. Bruner II, and Anand Kumar. 2006. Interactivity and its facets revisited: Theory and empirical test. Journal of Advertising 35, 4: 35--52.",
      "doi": ""
    },
    {
      "text": "4John Kammersgaard. 1988. Four different perspectives on human--computer interaction. International Journal of Man-Machine Studies 28, 4: 343--362.  ",
      "doi": "10.1016/S0020-7373%2888%2980017-8"
    },
    {
      "text": "Oliver Beren Kaul, Max Pfeiffer, and Michael Rohs. 2016. Follow the Force: Steering the Index Finger Towards Targets Using EMS. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 2526--2532.  ",
      "doi": "10.1145/2851581.2892352"
    },
    {
      "text": "5Alex Kirlik. 2006. Adaptive perspectives on human-technology interaction: Methods and models for cognitive engineering and human-computer interaction. Oxford University Press. ",
      "doi": "10.5555/1204684"
    },
    {
      "text": "5David Kirsh. 1997. Interactivity and multimedia interfaces. Instructional Science 25, 2: 79--96.",
      "doi": ""
    },
    {
      "text": "5Vassilis Kostakos. 2015. The Big Hole in HCI Research. interactions 22, 2: 48--51.  ",
      "doi": "10.1145/2729103"
    },
    {
      "text": "5Per Ola Kristensson, Xiaojun Bi, Andrew Howes, et al. 2015. Principles, techniques and perspectives on optimization and HCI. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, 2441--2444.  ",
      "doi": "10.1145/2702613.2702662"
    },
    {
      "text": "5Kari Kuutti. 1996. Activity theory as a potential framework for human-computer interaction research. Context and consciousness: Activity theory and human-computer interaction: 17--44. ",
      "doi": "10.5555/223826.223828"
    },
    {
      "text": "5Kari Kuutti and Liam J. Bannon. 2014. The Turn to Practice in HCI: Towards a Research Agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3543--3552.  ",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "5Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++: Allowing Objects to Communicate Dynamic Use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 2515--2524.  ",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "5I. Scott MacKenzie. 1992. Fitts' law as a research and design tool in human-computer interaction. Hum.-Comput. Interact. 7, 1: 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "5Sascha Mahlke and Manfred Thüring. 2007. Studying antecedents of emotional experiences in interactive contexts. In Proceedings of the SIGCHI conference on Human factors in computing systems, 915--918.  ",
      "doi": "10.1145/1240624.1240762"
    },
    {
      "text": "Elisa D. Mekler and Kasper Hornbæk. 2016. Momentary Pleasure or Lasting Meaning?: Distinguishing Eudaimonic and Hedonic User Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4509--4520.  ",
      "doi": "10.1145/2858036.2858225"
    },
    {
      "text": "6Raymond S. Nickerson, Jerome I. Elkind, and Jaime R. Carbonell. 1968. Human Factors and the Design of Time Sharing Computer Systems. Human Factors: The Journal of the Human Factors and Ergonomics Society 10, 2: 127--133.",
      "doi": ""
    },
    {
      "text": "6Donald A. Norman. 1986. Cognitive engineering. User centered system design: New perspectives on human-computer interaction 3161.",
      "doi": ""
    },
    {
      "text": "6Donald A. Norman. 1988. The psychology of everyday things. Basic books.",
      "doi": ""
    },
    {
      "text": "6Donald A. Norman. 1991. Cognitive artifacts. In Designing Interaction. 17--38. ",
      "doi": "10.5555/120352.120354"
    },
    {
      "text": "6Donald A. Norman. 1999. The invisible computer: Why good products fail, the personal computer is so complex, and information appliances are the solution. MIT press. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "6Antti Oulasvirta and Kasper Hornbæk. 2016. HCI Research as Problem-Solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 4956--4967.  ",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "6Stephen J. Payne. 1990. Looking HCI in the I. In Proceedings of the IFIP TC13 Third Interational Conference on Human-Computer Interaction, 185--191. ",
      "doi": "10.5555/647402.725280"
    },
    {
      "text": "6Stephen J. Payne and Andrew Howes. 2013. Adaptive interaction: A utility maximization approach to understanding human interaction with technology. Synthesis Lectures on Human-Centered Informatics 6, 1: 1--111. ",
      "doi": "10.5555/2534478"
    },
    {
      "text": "6Marianne Graves Petersen, Ole Sejer Iversen, Peter Gall Krogh, and Martin Ludvigsen. 2004. Aesthetic Interaction: A Pragmatist's Aesthetics of Interactive Systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04), 269--276.  ",
      "doi": "10.1145/1013115.1013153"
    },
    {
      "text": "William A. Pike, John Stasko, Remco Chang, and Theresa A. O'Connell. 2009. The science of interaction. Information Visualization 8, 4: 263--274.  ",
      "doi": "10.1057/ivs.2009.22"
    },
    {
      "text": "7Peter Pirolli and Stuart Card. 1999. Information foraging. Psychological review 106, 4: 643.",
      "doi": ""
    },
    {
      "text": "7Henning Pohl and Roderick Murray-Smith. 2013. Focused and casual interactions: allowing users to vary their level of engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2223--2232.  ",
      "doi": "10.1145/2470654.2481307"
    },
    {
      "text": "7J Preece, Yvonne Rogers, and Helen Sharp. 2015. Interaction Design: Beyond Human-computer Interaction. Wiley.",
      "doi": "10.5555/1215597"
    },
    {
      "text": "7Antonio Rizzo, Enrica Marchigiani, and Alessandro Andreadis. 1997. The AVANTI project: prototyping and evaluation with a cognitive walkthrough based on the Norman's model of action. In Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques, 305--309.  ",
      "doi": "10.1145/263552.263629"
    },
    {
      "text": "7Yvonne Rogers. 2012. HCI theory: classical, modern, and contemporary. Synthesis Lectures on Human-Centered Informatics 5, 2: 1--129. ",
      "doi": "10.5555/3019322"
    },
    {
      "text": "7Pertti Saariluoma. 2005. The challenges and opportunities of human technology. Human Technology 1, 1: 1--4.",
      "doi": ""
    },
    {
      "text": "7Dan Saffer. 2010. Designing for interaction: creating innovative applications and devices. New Riders. ",
      "doi": "10.5555/1795836"
    },
    {
      "text": "7Klaus R. Scherer, Angela Schorr, and Tom Johnstone. 2001. Appraisal processes in emotion: Theory, methods, research. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "7Kjeld Schmidt and Jørgen Bansler. 2016. Computational Artifacts: Interactive and Collaborative Computing as an Integral Feature of Work Practice. In COOP 2016: Proceedings of the 12th International Conference on the Design of Cooperative Systems, 23--27 May 2016, Trento, Italy, Antonella De Angeli, Liam Bannon, Patrizia Marti and Silvia Bordin (eds.). Springer International Publishing, 21--38.",
      "doi": ""
    },
    {
      "text": "Abigail Sellen, Yvonne Rogers, Richard Harper, and Tom Rodden. 2009. Reflecting human values in the digital age. Communications of the ACM 52, 3: 58--66.  ",
      "doi": "10.1145/1467247.1467265"
    },
    {
      "text": "8Steven C. Seow. 2005. Information theoretic models of HCI: a comparison of the Hick-Hyman law and Fitts' law. Human-Computer Interaction 20, 3: 315--352.  ",
      "doi": "10.1207/s15327051hci2003_3"
    },
    {
      "text": "8Shneiderman Ben Shneiderman and Catherine Plaisant. 2005. Designing the user interface 4 th edition. ed: Pearson Addison Wesley, USA.",
      "doi": ""
    },
    {
      "text": "8Lucy A. Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "8Dag Svanæs. 2013. Philosophy of interaction. The Encyclopedia of Human-Computer Interaction, 2nd Ed.",
      "doi": ""
    },
    {
      "text": "8Alex Taylor. 2015. After Interaction. interactions 22, 5: 48--53.  ",
      "doi": "10.1145/2809888"
    },
    {
      "text": "8N Tractinsky, A. S Katz, and D Ikar. 2000. What is beautiful is usable. Interacting with Computers 13, 2: 127--145.",
      "doi": ""
    },
    {
      "text": "8Edward R. Tufte. 1983. The visual display of quantitative information. Graphics press Cheshire, CT. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "8Peter-Paul Verbeek. 2015. Beyond interaction: a short introduction to mediation theory. interactions 22, 3: 26--31.  ",
      "doi": "10.1145/2751314"
    },
    {
      "text": "8Christopher D. Wickens, Justin G. Hollands, Simon Banbury, and Raja Parasuraman. 2015. Engineering psychology & human performance. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Terry Winograd. 1990. What can we teach about human-computer interaction? (plenary address). In CHI '90 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/97243.97322"
    },
    {
      "text": "9Terry Winograd and Fernando Flores. 1986. Understanding computers and cognition: A new foundation for design. Intellect Books. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "9Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined gestures for surface computing. In Proceedings of the 27th international conference on Human factors in computing systems, 1083--10  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "9Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures Without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "9Peter Wright and John McCarthy. 2004. Technology as experience. MIT Press Cambridge, MA. ",
      "doi": "10.5555/1044942"
    }
  ]
}