{
  "doi": "10.1145/3025453.3025608",
  "title": "MistForm: Adaptive Shape Changing Fog Screens",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4383-4395",
  "year": 2017,
  "badges": [],
  "abstract": "We present MistForm, a shape changing fog display that can support one or two users interacting with either 2D or 3D content. Mistform combines affordances from both shape changing interfaces and mid-air displays. For example, a concave display can maintain content in comfortable reach for a single user, while a convex shape can support several users engaged on individual tasks. MistForm also enables unique interaction possibilities by exploiting the synergies between shape changing interfaces and mid-air fog displays. For instance, moving the screen will affect the brightness and blurriness of the screen at specific locations around the display, creating spaces with similar (collaboration) or different visibility (personalized content). We describe the design of MistForm and analyse its inherent challenges, such as image distortion and uneven brightness on dynamic curved surfaces. We provide a machine learning approach to characterize the shape of the screen and a rendering algorithm to remove aberrations. We finally explore novel interactive possibilities and reflect on their potential and limitations.",
  "authors": [
    {
      "name": "Yutaka Tokuda",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81421599806/rel-imgonly/yutakacolor.jpg",
      "acmid": "81421599806",
      "orcid": "missing"
    },
    {
      "name": "Mohd Adili Norasikin",
      "institution": "University of sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-99659161536/rel-imgonly/img_8566.jpg",
      "acmid": "99659161536",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    },
    {
      "name": "Diego Martinez Plasencia",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81548363756/rel-imgonly/diego-bw-e1492896584298-thegem-person.jpg",
      "acmid": "81548363756",
      "orcid": "0000-0002-5815-8236"
    }
  ],
  "references": [
    {
      "text": "Peter C. Barnum, Srinivasa G. Narasimhan, and Takeo Kanade. 2010. A Multi-Layered Display with Water Drops. ACM Transactions on Graphics (TOG) 297, 4 (2010), 1--7.  ",
      "doi": "10.1145/1778765.1778813"
    },
    {
      "text": "Olivier Bau, Uros Petrevski, and Wendy Mackay. 2009. BubbleWrap: A Textile-Based Electromagnetic Haptic Display. In Extended Abstracts on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 3607--3612.  ",
      "doi": "10.1145/1520340.1520542"
    },
    {
      "text": "Oliver Bimber. 2004. Combining Optical Holograms with Interactive Computer Graphics. Computer 37, 1 (2004), 85--91.  ",
      "doi": "10.1109/MC.2004.1260730"
    },
    {
      "text": "Alex Butler, Otmar Hilliges, Shahram Izadi, Steve Hodges, David Molyneaux, David Kim, and Danny Kong. 2011. Vermeer: Direct Interaction with a 360° Viewable 3D Display. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 569--576.  ",
      "doi": "10.1145/2047196.2047271"
    },
    {
      "text": "T. Matthew Ciolek and Adam Kendon. 1980. Environment and the Spatial Arrangement of Conversational Encounters. Sociological Inquiry 50, 3--4 (1980), 237--271.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho, Hiroshi Ishii, and Pattie Maes. 2008. Surflex: a programmable surface for the design of tangible interfaces. In Extended Abstracts on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 3429--3434.  ",
      "doi": "10.1145/1358628.1358869"
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shapechanging Interfaces. Personal and Ubiquitous Computing 15, 2 (2011), 161--173.  ",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Shin-ichiro Eitoku, Kunihiro Nishimura, Tomohiro Tanikawa, and Michitaka Hirose. 2009. Study on Design of Controllable Particle Display Using Water Drops Suitable for Light Environment. In Proceedings of the 16th ACM Symposium on Virtual Reality Software and Technology (VRST '09). ACM, New York, NY, USA, 23--26.  ",
      "doi": "10.1145/1643928.1643936"
    },
    {
      "text": "Barrett Ens, Rory Finnegan, and Pourang Irani. 2014. The Personal Cockpit: A Spatial Interface for Effective Task Switching on Head-worn Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3171--3180.  ",
      "doi": "10.1145/2556288.2557058"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Martin Hachet, Benoit Bossavit, Aurélie Cohé, and Jean-Baptiste de la Rivière. 2011. Toucheo: Multitouch and Stereo Combined in a Seamless Workspace. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 587--592.  ",
      "doi": "10.1145/2047196.2047273"
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. ShapeClip: Towards Rapid Prototyping with Shape-Changing Displays for Designers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 19--28.  ",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "David M. Hoffman, Ahna R. Girshick, Kurt Akeley, and Martin S. Banks. 2015. Vergence--accommodation conflicts hinder visual performance and cause visual fatigue. Journal of Vision 8, 3 (2015), 1--30.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical Atoms: Beyond Tangible Bits, Toward Transformable Materials. Interactions XIX, 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: Adding Haptic Surface to Graphics. In Proceedings of the 28th Annual Conference on Computer Graphics and Interactive Techniques. ACM, New York, NY, USA, 469--476.  ",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Akira Kataoka and Yasuhiro Kasahara. 1993. A Method and apparatus for a fog screen and imageforming method using the same. US Patent 5,270,752. (14 December 1993), Filed December 4, 1992.",
      "doi": ""
    },
    {
      "text": "Miu-Ling Lam, Bin Chen, Kit-Yung Lam, and Yaozhun Huang. 2014. 3D Fog Display using Parallel Linear Motion Platforms. In International Conference on Virtual Systems & Multimedia (VSMM). IEEE, 234--237.",
      "doi": ""
    },
    {
      "text": "Miu Ling Lam, Bin Chen, and Yaozhung Huang. 2015. A Novel Volumetric Display using Fog Emitter Matrix. In IEEE International Conference on Robotics and Automation (ICRA). IEEE, 4452--4457.",
      "doi": ""
    },
    {
      "text": "Jinha Lee, Alex Olwal, Hiroshi Ishii, and Cati Boulanger. 2013. SpaceTop: Integrating 2D and Spatial 3D Interactions in a See-through Desktop Environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 189--192.  ",
      "doi": "10.1145/2470654.2470680"
    },
    {
      "text": "Jinha Lee, Rehmi Post, and Hiroshi Ishii. 2011. ZeroN: Mid-Air Tangible Interaction Enabled by Computer Controlled Magnetic Levitation. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 327--366.  ",
      "doi": "10.1145/2047196.2047239"
    },
    {
      "text": "McAtamne Lynn and E. Nigel Corlett. 1993. RULA: a survey method for the investigation of work-related upper limb disorders. Applied ergonomics 24, 2 (1993), 91--99.",
      "doi": ""
    },
    {
      "text": "Donald W. Marquardt. 1963. An Algorithm for LeastSquares Estimation of Nonlinear Parameters. Journal of the Society for Industrial and Applied Mathematics 11, 2 (1963), 431--441.",
      "doi": ""
    },
    {
      "text": "Yasuaki Monnai, Keisuke Hasegawa, Masahiro Fujiwara, Kazuma Yoshino, Seki Inoue, and Hiroyuki Shinoda. 2014. HaptoMime: Mid-Air Haptic Interaction with a Floating Virtual Screen. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 663--667.  ",
      "doi": "10.1145/2642918.2647407"
    },
    {
      "text": "Alex Olwal, Stephen DiVerdi, Ismo Rakkolainen, and Tobias Höllerer. 2008. Consigalo: Multi-user Face-toface Interaction on Immaterial Displays. In Proceedings of the 2nd international conference on INtelligent TEchnologies for interactive enterTAINment (INTETAIN '08). ICST, 8. ",
      "doi": "10.5555/1363200.1363211"
    },
    {
      "text": "Themis Omirou, Asier Marzo Perez, Sriram Subramanian, and Anne Roudaut. 2016. Floating Charts: Data Plotting using Free-Floating Acoustically Levitated Representations. In IEEE Symposium on 3D User Interfaces (3DUI). 187--190.",
      "doi": ""
    },
    {
      "text": "Hilliges Otmar, David Kim, Shahram Izadi, Malte Weiss, and Andrew D. Wilson. 2012. HoloDesk: Direct 3D Interactions with a Situated See-Through Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2421--2430.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Gian Pangaro, Maynes-Aminzade Dan, and Hiroshi Ishii. 2003. The Actuated Workbench: ComputerControlled Actuation in Tabletop Tangible Interfaces. In Proceedings of the 15th annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/571985.572011"
    },
    {
      "text": "Amanda Parkes, Ivan Poupyrev, and Hiroshi Ishii. 2008. Designing Kinetic Interactions for Organic User Interfaces. Communications of the ACM 51, 6 (2008), 58--65.  ",
      "doi": "10.1145/1349026.1349039"
    },
    {
      "text": "Kenneth Perlin and Jefferson Y. Han. 2006. Volumetric display with dust as the participating medium. US Patent 6,997,558. (14 February 2006), Filed December 5, 2003.",
      "doi": ""
    },
    {
      "text": "Diego Martinez Plasencia, Florent Berthaut, Abhijit Karnik, and Sriram Subramanian. 2014. Through the Combining Glass. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 341--350.  ",
      "doi": "10.1145/2642918.2647351"
    },
    {
      "text": "Diego Martinez Plasencia, Edward Joyce, and Sriram Subramanian. 2014. MisTable: Reach-through Personal Screens for Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3493--3502.  ",
      "doi": "10.1145/2556288.2557325"
    },
    {
      "text": "Timothy Poston and Luis Serra. 1994. The Virtual Workbench: Dextrous VR. In Proceedings of the Virtual Reality and Software Technology Conference (VRST '94). World Scientific, River Edge, NJ, USA, 111--121. ",
      "doi": "10.5555/207072.207133"
    },
    {
      "text": "Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: Interactive Visual and Shape Display for Calm Computing. In ACM SIGGRAPH 2004 Emerging technologies (SIGGRAPH '04). ACM, New York, NY, USA, 17.  ",
      "doi": "10.1145/1186155.1186173"
    },
    {
      "text": "Ismo Rakkolainen. 2008. Mid-air Displays Enabling Novel User Interfaces. In Proceedings of the 1st ACM International Workshop on Semantic Ambient Media Experiences (SAME '08). ACM, New York, NY, USA, 25--30.  ",
      "doi": "10.1145/1461912.1461919"
    },
    {
      "text": "Ismo Rakkolainen. 2008. Measurements and Experiments of the Immaterial Virtual Reality Display. In 3DTV Conference: The True VisionCapture, Transmission and Display of 3D Video. IEEE, 37--40.",
      "doi": ""
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. ShapeChanging Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 735-- 744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Self-Actuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 593--602.  ",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Deepak Ranjan Sahoo, Diego Martinez Plasencia, and Sriram Subramanian. 2015. Control of Non-Solid Diffusers by Electrostatic Charging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, New York, NY, USA, 11--14.  ",
      "doi": "10.1145/2702123.2702363"
    },
    {
      "text": "Deepak Ranjan Sahoo, Nakamura Takuto, Asier Marzo, Themis Omirou, Michihiro Asakawa, and Sriram Subramanian. 2016. JOLED: A Mid-Air Display Based on Electrostatic Rotation of Levitated Janus Objects. In 29th ACM User Interface Software and Technology Symposium (UIST '16). ACM, New York, NY, USA, .  ",
      "doi": "10.1145/2984511.2984549"
    },
    {
      "text": "Stefan Schneegass, Florian Alt, Jürgen Scheible, and Albrecht Schmidt. 2014. Midair Displays: Concept and First Experiences with Free-Floating Pervasive Displays. In Proceedings of The International Symposium on Pervasive Displays (PerDis'14). ACM, New York, NY, USA, 27--31.  ",
      "doi": "10.1145/2611009.2611013"
    },
    {
      "text": "Takashi Shibata, Joohwan Kim, David M. Hoffman, and Martin S. Banks. 2011. The zone of comfort: Predicting visual discomfort with stereo displays. Journal of vision 11, 8 (2011), 1--29.",
      "doi": ""
    },
    {
      "text": "Kazuki Takashima, Takafumi Oyama, Yusuke Asari, Ehud Sharlin, Saul Greenberg, and Yoshifumi Kitamura. 2016. Study and Design of a Shape-Shifting Wall Display. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 796--806.  ",
      "doi": "10.1145/2901790.2901892"
    },
    {
      "text": "Yutaka Tokuda, Atsushi Hiyama, Michitaka Hirose, and Hirotsugu Yamamoto. 2015. R2D2 w / AIRR: Real time & Real space Double-Layered Display with Aerial Imaging by Retro-Reflection. In SIGGRAPH Asia 2015 Emerging Technologies (SA'15). ACM, New York, NY, USA, 20.  ",
      "doi": "10.1145/2818466.2818484"
    },
    {
      "text": "Dimitar Valkov, Frank Steinicke, Gerd Bruder, and Klaus Hinrichs. 2011. 2D Touching of 3D Stereoscopic Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1353--1362.  ",
      "doi": "10.1145/1978942.1979142"
    },
    {
      "text": "Asuka Yagi, Masataka Imura, Yoshihiro Kuroda, and Osamu Oshiro. 2011. 360-Degree Fog Projection Interactive Display. In SIGGRAPH Asia 2011 Emerging Technologies (SA '11). ACM, New York, NY, USA, 19.  ",
      "doi": "10.1145/2073370.2073388"
    },
    {
      "text": "Hirotsugu Yamamoto, Yuka Tomiyama, and Shiro Suyama. 2014. Floating aerial LED signage based on aerial imaging by retro-reflection (AIRR). Optics Express 22, 22 (2014), 26919--26924.",
      "doi": ""
    },
    {
      "text": "Zhengyou Zhang. 2000. A Flexible New Technique for Camera Calibration. IEEE Transactions on Pattern Analysis and Machine Intelligence 22, 11 (2000), 1330--1334.  ",
      "doi": "10.1109/34.888718"
    }
  ]
}