{
  "doi": "10.1145/3025453.3025923",
  "title": "How Values Shape Collaboration Between Patients with Multiple Chronic Conditions and Spousal Caregivers",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5257-5270",
  "year": 2017,
  "badges": [],
  "abstract": "Individuals with multiple chronic conditions (MCC) collaborate with spousal caregivers daily to pursue what is most important to their health and well-being. Previous research in human-computer interaction has supported individuals with chronic conditions or their caregivers, but little has supported both as a unit. We conducted a field study with 12 patient-caregiver dyads, all married and living together, to identify partners' values and how they shape collaborative management of MCC. Partners' coinciding values motivated them to empathize with and support each other in the face of challenges related to health and well-being. When their values were asymmetric, they perceived tensions between individual autonomy and their ability to coordinate with their partner. Systems to support partners in this context could help them overcome asymmetric values, but should balance this with support for individual autonomy.",
  "authors": [
    {
      "name": "Andrew B. L. Berry",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131032",
      "orcid": "0000-0002-3167-4716"
    },
    {
      "name": "Catherine Lim",
      "institution": "Group Health Research Institute, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659037296",
      "orcid": "0000-0001-7708-4802"
    },
    {
      "name": "Andrea L. Hartzler",
      "institution": "Group Health Research Institute, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657149",
      "orcid": "0000-0003-4932-7314"
    },
    {
      "name": "Tad Hirsch",
      "institution": "University of Washington, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503651895",
      "orcid": "0000-0003-1421-3544"
    },
    {
      "name": "Edward H. Wagner",
      "institution": "Group Health Research Institute, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659037494",
      "orcid": "missing"
    },
    {
      "name": "Evette Ludman",
      "institution": "Group Health Research Institute, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659036518",
      "orcid": "missing"
    },
    {
      "name": "James D. Ralston",
      "institution": "Group Health Research Institute, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470641901",
      "orcid": "0000-0001-6317-7987"
    }
  ],
  "references": [
    {
      "text": "Gregory D Abowd, Gillian R Hayes, Julie A Kientz, Lena Mamykina, and Elizabeth D Mynatt. 2006. Challenges and opportunities for collaboration technologies for chronic care management. The Human-Computer Interaction Consortium (HCIC 2006).",
      "doi": ""
    },
    {
      "text": "Gerard F Anderson. 2010. Chronic care: making the case for ongoing care. Robert Wood Johnson Foundation, Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "Jakob E Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing mobile health technology for bipolar disorder: a field trial of the MONARCA system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2627--2636.  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, and Gabriela Marcu. 2012. The MONARCA selfassessment system. In Proceedings of the 2nd ACM SIGHIT symposium on International health informatics IHI '12.  ",
      "doi": "10.1145/2110363.2110370"
    },
    {
      "text": "Elizabeth A Bayliss, John F Steiner, Douglas H Fernald, Lori A Crane, and Deborah S Main. 2003. Descriptions of barriers to self-care by persons with comorbid chronic diseases. Annals of family medicine 1, 1: 15--21.",
      "doi": ""
    },
    {
      "text": "Thomas Bodenheimer, Kate R Lorig, and Halsted R Holman. 2002. Patient Self-management of Chronic Disease in Primary Care. JAMA 288, 19: 2469.",
      "doi": ""
    },
    {
      "text": "Thomas Bodenheimer, Edward H Wagner, and Kevin Grumbach. 2002. Improving primary care for patients with chronic illness. JAMA 288, 14: 1775--1779.",
      "doi": ""
    },
    {
      "text": "Thomas Bodenheimer, Edward H Wagner, and Kevin Grumbach. 2002. Improving primary care for patients with chronic illness: the chronic care model, Part 2. JAMA 288, 15: 1909--1914.",
      "doi": ""
    },
    {
      "text": "Claus Bossen, Lars Rune Christensen, Erik Grönvall, and Lasse Steenbock Vestergaard. 2013. CareCoor: Augmenting the coordination of cooperative home care work. International Journal of Medical Informatics 82, 5: e189--e199.",
      "doi": ""
    },
    {
      "text": "Stacy M Branham, Steve H Harrison, and Tad Hirsch. 2012. Expanding the design space for intimacy: supporting mutual reflection for local partners. In Proceedings of the Designing Interactive Systems Conference, 220--223.  ",
      "doi": "10.1145/2317956.2317990"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI'15.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 20 Moving Healthcare to the Home: The Work to Make Homecare Work. In ECSCW 2013: Proceedings of the 13th European Conference on Computer Supported Cooperative Work, 143--162.",
      "doi": ""
    },
    {
      "text": "Centers for Medicare and Medicaid Services. 2012. Chronic Conditions Among Medicare Beneficiaries: Chartbook, 2012 edition. Centers for Medicare and Medicaid Services, Baltimore.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis (Introducing Qualitative Methods Series). Sage Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: designing for integrality. In Proceedings of the 2013 conference on Computer supported cooperative work, 91--102.  ",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Sunny Consolvo, Peter Roessler, Brett E Shelton, Anthony LaMarca, Bill Schilit, and Sara Bly. 2004. Technology for care networks of elders. Pervasive Computing, IEEE 3, 2: 22--29.  ",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1988. Unending work and care: Managing chronic illness at home. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 1985. Managing chronic illness at home: three lines of work. Qualitative Sociology 8, 3: 224--247.",
      "doi": ""
    },
    {
      "text": "Sara J Czaja and Mark P Rubert. 2002. Telecommunications technology as an aid to family caregivers of persons with dementia. Psychosomatic Medicine 64, 3: 469--476.",
      "doi": ""
    },
    {
      "text": "Karen Davis, Stephen C Schoenbaum, and Anne-Marie Audet. 2005. A 2020 vision of patient-centered primary care. Journal of General Internal Medicine 20, 10: 953--957.",
      "doi": ""
    },
    {
      "text": "John Duncan, L Jean Camp, and William R Hazelwood. 2009. The portal monitor: a privacy enhanced event-driven system for elder care. In Proceedings of the 4th International Conference on Persuasive Technology, 36.  ",
      "doi": "10.1145/1541948.1541995"
    },
    {
      "text": "Angela Fagerlin, Michael Pignone, Purva Abhyankar, Nananda Col, Deb Feldman-Stewart, Teresa Gavaruzzi, Jennifer Kryworuchko, Carrie A Levin, Arwen H Pieterse, Valerie Reyna, Stiggelbout, Anne, Scherer, Laura D, Wills, Celia, and Witteman, Holly O. 2013. Clarifying values: an updated review. BMC Medical Informatics and Decision Making 13, Suppl 2: S8.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter H Kahn Jr, Alan Borning, and Alina Huldtgren. 2013. Value Sensitive Design and Information Systems. In Philosophy of Engineering and Technology. Springer, 55--95.",
      "doi": ""
    },
    {
      "text": "Ronald Gijsen, Nancy Hoeymans, François G Schellevis, Dirk Ruwaard, William A Satariano, and Geertrudis AM van den Bos. 2001. Causes and consequences of comorbidity: a review. Journal of Clinical Epidemiology 54, 7: 661--674.",
      "doi": ""
    },
    {
      "text": "Richard W Grant, Alyce S Adams, Elizabeth A Bayliss, and Michele Heisler. 2013. Establishing visit priorities for complex patients: A summary of the literature and conceptual model to guide innovative interventions. In Healthcare, 117--122.",
      "doi": ""
    },
    {
      "text": "Erik Grönvall and Nervo Verdezoto. 2013. Beyond self-monitoring: understanding non-functional aspects of home-based healthcare technology. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing, 587--596.  ",
      "doi": "10.1145/2493432.2493495"
    },
    {
      "text": "Tad Hirsch, Jodi Forlizzi, Elaine Hyder, Jennifer Goetz, Chris Kurtz, and Jacey Stroback. 2000. The ELDer project: social, emotional, and environmental factors in the design of eldercare technologies. In Proceedings on the 2000 conference on Universal Usability, 72--79.  ",
      "doi": "10.1145/355460.355476"
    },
    {
      "text": "Matthew K Hong, Lauren Wilcox, Daniel Machado, Thomas A Olson, and Stephen F Simoneaux. 2016. Care Partnerships: Toward Technology to Support Teens' Participation in Their Health Care. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858508"
    },
    {
      "text": "Lara Houston, Steven J Jackson, Daniela K Rosner, Syed Ishtiaque Ahmed, Meg Young, and Laewoo Kang. 2016. Values in Repair. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 1403--1414.  ",
      "doi": "10.1145/2858036.2858470"
    },
    {
      "text": "Elizabeth Kaziunas, Ayse G Buyuktur, Jasmine Jones, Sung W Choi, David A Hanauer, and Mark S Ackerman. 2015. Transition and Reflection in the Use of Health Information: The case of pediatric bone marrow transplant caregivers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 1763--1774.  ",
      "doi": "10.1145/2675133.2675276"
    },
    {
      "text": "Elizabeth Kaziunas, David A Hanauer, Mark S Ackerman, and Sung Won Choi. 2016. Identifying unmet informational needs in the inpatient setting to increase patient and caregiver engagement in the context of pediatric hematopoietic stem cell transplantation. Journal of the American Medical Informatics Association 23, 1: 94--104.",
      "doi": ""
    },
    {
      "text": "Michael P Kelly, Iona Heath, Jeremy Howick, and Trisha Greenhalgh. 2015. The importance of values in evidence-based medicine. BMC Medical Ethics 16, 1: 69.",
      "doi": ""
    },
    {
      "text": "Rob Kling. 1991. Cooperation, coordination and control in computer-supported work. Communications of the ACM 34, 12: 83--88.  ",
      "doi": "10.1145/125319.125396"
    },
    {
      "text": "Christopher A Le Dantec, Erika Shehan Poole, and Susan P Wyche. 2009. Values as lived experience: evolving value sensitive design in support of value discovery. In Proceedings of the 27th international conference on Human factors in computing systems.  ",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Yeonjung Lee and Karen A Zurlo. 2014. Spousal Caregiving and Financial Strain Among Middle-Aged and Older Adults. The International Journal of Aging and Human Development 79, 4: 302--321.",
      "doi": ""
    },
    {
      "text": "Catherine Lim, Andrew BL Berry, Tad Hirsch, Andrea Hartzler, Edward H Wagner, Evette Ludman, and James D Ralston. 2016. \"It just seems outside my health:\" How Patients with Chronic Conditions Perceive Communication Boundaries with Providers. In ACM Conference on Designing Interactive Systems.  ",
      "doi": "10.1145/2901790.2901866"
    },
    {
      "text": "Leslie S Liu, Sen H Hirano, Monica Tentori, Karen G Cheng, Sheba George, Sun Young Park, and Gillian R Hayes. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. In Proceedings of the ACM 2011 conference on Computer supported cooperative work, 475--484.  ",
      "doi": "10.1145/1958824.1958897"
    },
    {
      "text": "Kate R Lorig and Halsted R Holman. 2003. Self management education: History, definition, outcomes, and mechanisms. Annals of Behavioral Medicine 26, 1: 1--7.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Gabriela Marcu, Jakob Bardram, and Silvia Gabrielli. 2011. A Framework for Overcoming Challenges in Designing Persuasive Monitoring and Feedback Systems for Mental Illness. In Proceedings of the 5th International ICST Conference on Pervasive Computing Technologies for Healthcare.",
      "doi": ""
    },
    {
      "text": "Andrew D Miller, Sonali R Mishra, Logan Kendall, Shefali Haldar, Ari H Pollack, and Wanda Pratt. 2016. Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 756--769.  ",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "Heehyul Moon, Aloen L Townsend, Carol J Whitlatch, and Peggye Dilworth-Anderson. 2016. Quality of Life for Dementia Caregiving Dyads: Effects of Incongruent Perceptions of Everyday Care and Values. The Gerontologist: gnw055.",
      "doi": ""
    },
    {
      "text": "Elizabeth D Mynatt, Jim Rowan, Sarah Craighill, and Annie Jacobs. 2001. Digital family portraits: supporting peace of mind for extended family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2015. SelfCare Technologies and Collaboration. International Journal of Human-Computer Interaction 31, 12: 869-- 881.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Transactions on Computer-Human Interaction 22, 6: 33.  ",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Donald L Patrick, Susan Kinne, Ruth A Engelberg, and Robert A Pearlman. 2000. Functional status and perceived quality of life in adults with and without chronic conditions. Journal of Clinical Epidemiology 53, 8: 779--785.",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments.",
      "doi": ""
    },
    {
      "text": "Allison M Reamy, Kyungmin Kim, Steven H Zarit, and Carol J Whitlatch. 2011. Understanding Discrepancy in Perceptions of Values: Individuals With Mild to Moderate Dementia and Their Family Caregivers. The Gerontologist 51, 4: 473--483.",
      "doi": ""
    },
    {
      "text": "Susan C Reinhard, Carol Levine, and Sarah Samis. 2014. Family Caregivers Providing Complex Chronic Care to Their Spouses. AARP Public Policy Institute, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Barbara Riegel and Victoria Vaughan Dickson. 2008. A situation-specific theory of heart failure self-care. The Journal of Cardiovascular Nursing 23, 3: 190-- 196.",
      "doi": ""
    },
    {
      "text": "Rikke Aarhus and Stinne Aaløkke Ballegaard. 2010. Negotiating boundaries: managing disease at home. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems, 1223--1232.  ",
      "doi": "10.1145/1753326.1753509"
    },
    {
      "text": "Nancy E Schoenberg, Corinne Leach, and William Edwards. 2009. \"It's a toss up between my hearing, my heart, and my hip\": Prioritizing and Accommodating Multiple Morbidities by Vulnerable Older Adults. Journal of Health Care for the Poor and Underserved 20, 1: 134--151.",
      "doi": ""
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 787--799.  ",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Charles Senteio and Tiffany Veinot. 2014. Trying to Make Things Right: Adherence Work in High-Poverty, African American Neighborhoods. Qualitative Health Research 24, 12: 1745.",
      "doi": ""
    },
    {
      "text": "Meredith M Skeels, Kenton T Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing social support for breast cancer patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 173--182.  ",
      "doi": "10.1145/1753326.1753353"
    },
    {
      "text": "Anita L. Stewart, Sheldon Greenfield, Ron D. Hays, Kenneth Wells, William H. Rogers, Sandra D. Berry, Elizabeth A. McGlynn, and John E. Ware. 1989. Functional status and well-being of patients with chronic conditions. Results from the Medical Outcomes Study. JAMA 262, 7: 907--913.",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2010. Multiple Forms of Appropriation in Self-Monitoring Technology: Reflections on the Role of Evaluation in Future SelfCare. International Journal of Human-Computer Interaction 26, 5: 537--561.",
      "doi": ""
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for Respite and Support: Technological Opportunities for Spousal Caregivers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1155--1158.  ",
      "doi": "10.1145/2702123.2702563"
    },
    {
      "text": "US Department of Health and Human Services and others. 2010. Multiple chronic conditions-a strategic framework: optimum health and quality of life for individuals with multiple chronic conditions. US Department of Health and Human Services, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Ana-Maria Vranceanu, Cynthia Cooper, and David Ring. 2009. Integrating Patient Values into EvidenceBased Practice: Effective Communication for Shared Decision-Making. Hand Clinics 25, 1: 83--96.",
      "doi": ""
    },
    {
      "text": "Gregg Warshaw. 2006. Introduction: advances and challenges in care of older people with chronic illness. Generations 30, 3: 5--10.",
      "doi": ""
    },
    {
      "text": "Carlos O Weiss, Cynthia M Boyd, Qilu Yu, Jennifer L Wolff, and Bruce Leff. 2007. Patterns of Prevalent Major Chronic Disease Among Older Adults in the United States. JAMA 298, 10: 1160--1162.",
      "doi": ""
    },
    {
      "text": "Holly O Witteman, Laura D Scherer, Teresa Gavaruzzi, Arwen H Pieterse, Andrea Fuhrel-Forbis, Selma Chipenda Dansokho, Nicole Exe, Valerie C Kahn, Deb Feldman-Stewart, Nananda F Col, Turgeon, Alexis F, and Fagerlin, Angela. 2016. Design Features of Explicit Values Clarification Methods A Systematic Review. Medical Decision Making 36, 4: 453--471.",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2637--2646.  ",
      "doi": "10.1145/2470654.2481365"
    },
    {
      "text": "America's Families and Living Arrangements: 2011. Retrieved July 21, 2016 from http://www.census.gov/population/www/socdemo/hhfam/cps2011.html",
      "doi": ""
    },
    {
      "text": "Culture Clues. Retrieved July 27, 2016 from https://depts.washington.edu/pfes/CultureClues.htm",
      "doi": ""
    }
  ]
}