{
  "doi": "10.1145/3025453.3025467",
  "title": "User-Guided Synthesis of Interactive Diagrams",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "195-207",
  "year": 2017,
  "badges": [],
  "abstract": "Interactive diagrams are expensive to build, requiring significant programming experience. The cost of building such diagrams often prevents novice programmers or non-programmers from doing so. In this paper, we present user-guided techniques that transform a static diagram into an interactive one without requiring the user to write code. We also present a tool called EDDIE that prototypes these techniques. We evaluate EDDIE through: (1) a case study in which we use EDDIE to implement existing real-world diagrams from the literature and (2) a usability session with target users in which subjects build several diagrams in EDDIE and provide feedback on EDDIE's user experience. Our experiments demonstrate that EDDIE is usable and expressive, and that EDDIE enables real-world diagrams to be implemented without requiring programming expertise.",
  "tags": [
    "program synthesis",
    "interactive diagrams"
  ],
  "authors": [
    {
      "name": "John Sarracino",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358809657",
      "orcid": "missing"
    },
    {
      "name": "Odaris Barrios-Arciga",
      "institution": "Scripps College, Claremont, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163038",
      "orcid": "missing"
    },
    {
      "name": "Jasmine Zhu",
      "institution": "Harvey Mudd College, Claremont, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161819",
      "orcid": "missing"
    },
    {
      "name": "Noah Marcus",
      "institution": "Harvey Mudd College, Claremont, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162266",
      "orcid": "missing"
    },
    {
      "name": "Sorin Lerner",
      "institution": "University of California, San Diego, San Diego, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100399150",
      "orcid": "missing"
    },
    {
      "name": "Ben Wiedermann",
      "institution": "Harvey Mudd College, Claremont, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322510080",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2016. Apparatus: a hybrid graphics editor and programming environment for creating interactive diagrams. Website. (2016). Accessed on 2016-04--12 from http://aprt.us.",
      "doi": ""
    },
    {
      "text": "2016. FabricJS JavaScript Canvas Library. Website. (2016). Accessed on 2016-09--19 from http://fabricjs.com/.",
      "doi": ""
    },
    {
      "text": "2016. Interactive Mathematics: Learn math while you play with it. Website. (2016). Accessed on 2016-04-08 from http://www.intmath.com.",
      "doi": ""
    },
    {
      "text": "2016. Overconstrained: Cassowary projects and its community. Website. (2016). Accessed on 2016-04--11 from http://overconstrained.io.",
      "doi": ""
    },
    {
      "text": "2016. Pendulum Lab -- Motion, Pendulum, Simple Harmonic Motion -- PhET. Website. (2016). Accessed on 2016-09--19 from https://phet.colorado.edu/en/ simulation/legacy/pendulum-lab.",
      "doi": ""
    },
    {
      "text": "2016. PhET: Interactive Simulations for Science and Math. Website. (2016). Accessed on 2016-04--11 from https://PhET.colorado.edu.",
      "doi": ""
    },
    {
      "text": "2016. Resonance -- Resonance, Harmonic Motion, Oscillator -- PhET. Website. (2016). Accessed on 2016-09--19 from https://phet.colorado.edu/en/ simulation/legacy/resonance.",
      "doi": ""
    },
    {
      "text": "Wendy K. Adams, Sam Reid, Ron LeMaster, Sarah McKagan, Katherine Perkins, Michael Dubson, and Carl E. Wieman. 2008a. A Study of Educational Simulations Part II Interface Design. Journal of Interactive Learning Research 19, 4 (October 2008), 551--577. https://www.learntechlib.org/p/24364",
      "doi": ""
    },
    {
      "text": "Wendy K. Adams, Sam Reid, Ron LeMaster, Sarah B. McKagan, Katherine K. Perkins, Michael Dubson, and Carl E. Wieman. 2008b. A Study of Educational Simulations Part I - Engagement and Learning. Journal of Interactive Learning Research 19, 3 (July 2008), 397--419. https://www.learntechlib.org/p/24230",
      "doi": ""
    },
    {
      "text": "Christine Alvarado and Randall Davis. 2004. SketchREAD: A Multi-domain Sketch Recognition Engine. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, NY, NY, USA, 23--32. DOI: http://dx.doi.org/10.1145/1029632.1029637  ",
      "doi": "10.1145/1029632.1029637"
    },
    {
      "text": "Christine Alvarado and Randall Davis. 2006. Resolving ambiguities to create a natural computer-based sketching environment. In ACM SIGGRAPH 2006 Courses. ACM, 24.  ",
      "doi": "10.1145/1185657.1185785"
    },
    {
      "text": "Greg J. Badros, Alan Borning, and Peter J. Stuckey. 2001. The Cassowary linear arithmetic constraint solving algorithm. ACM Transactions on Computer-Human Interaction 8, 4 (dec 2001), 267--306. DOI: http://dx.doi.org/10.1145/504704.504705  ",
      "doi": "10.1145/504704.504705"
    },
    {
      "text": "Julia M. Chamberlain, Kelly Lancaster, Robert Parson, and Katherine K. Perkins. 2014. How guidance affects student engagement with an interactive simulation. Chem. Educ. Res. Pract. 15 (2014), 628--638. Issue 4. DOI: http://dx.doi.org/10.1039/C4RP00009A ",
      "doi": ""
    },
    {
      "text": "Salman Cheema and Joseph J LaViola Jr. 2010. Applying mathematical sketching to sketch-based physics tutoring software. In International Symposium on Smart Graphics. Springer, 13--24. ",
      "doi": ""
    },
    {
      "text": "Allen Cypher and Daniel Conrad Halbert. 1993. Watch what I do: programming by demonstration. MIT press.",
      "doi": "10.5555/168080"
    },
    {
      "text": "George B Dantzig, Alex Orden, Philip Wolfe, and others. 1955. The generalized simplex method for minimizing a linear form under linear inequality restraints. Pacific J. Math. 5, 2 (1955), 183--195.",
      "doi": ""
    },
    {
      "text": "Richard C. Davis, Brien Colwell, and James A. Landay. 2008. K-sketch. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems CHI '08. ACM Press, NY, NY, USA, 413. DOI:http://dx.doi.org/10.1145/1357054.1357122  ",
      "doi": "10.1145/1357054.1357122"
    },
    {
      "text": "Tim Felgentreff, Alan Borning, Robert Hirschfeld, Jens Lincke, Yoshiki Ohshima, Bert Freudenberg, and Robert Krahn. 2014. ECOOP 2014 -- Object-Oriented Programming: 28th European Conference, Uppsala, Sweden, July 28 -- August 1, 2014. Proceedings. Springer Berlin Heidelberg, Berlin, Heidelberg, Chapter Babelsberg/JS, 411--436. DOI: http://dx.doi.org/10.1007/978--3--662--44202--9_17",
      "doi": ""
    },
    {
      "text": "Bjorn N Freeman-Benson, John Maloney, and Alan Borning. 1990. An incremental constraint solver. Commun. ACM 33, 1 (1990), 54--63.",
      "doi": "10.1145/76372.77531"
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Wilmot Li, Mira Dontcheva, and Takeo Igarashi. 2009. Generating Photo Manipulation Tutorials by Demonstration. In ACM SIGGRAPH 2009 Papers (SIGGRAPH '09). ACM, NY, NY, USA, Article 66, 9 pages. DOI: http://dx.doi.org/10.1145/1576246.1531372  ",
      "doi": "10.1145/1576246.1531372"
    },
    {
      "text": "Sumit Gulwani. 2010. Dimensions in program synthesis. In Proceedings of the 12th international ACM SIGPLAN symposium on Principles and practice of declarative programming. ACM, 13--24.  ",
      "doi": "10.1145/1836089.1836091"
    },
    {
      "text": "Sumit Gulwani, Susmit Jha, Ashish Tiwari, and Ramarathnam Venkatesan. 2011a. Synthesis of loop-free programs. In Proceedings of the 32nd ACM SIGPLAN conference on Programming language design and implementation - PLDI '11. ACM Press, NY, NY, USA, 62. DOI: http://dx.doi.org/10.1145/1993498.1993506  ",
      "doi": "10.1145/1993498.1993506"
    },
    {
      "text": "Sumit Gulwani, Vijay Anand Korthikanti, and Ashish Tiwari. 2011b. Synthesizing geometry constructions. ACM SIGPLAN Notices 46, 6 (jun 2011), 50. DOI: http://dx.doi.org/10.1145/1993316.1993505  ",
      "doi": "10.1145/1993316.1993505"
    },
    {
      "text": "Markus Hohenwarter and Karl Fuchs. 2005. Combination of dynamic geometry , algebra and calculus in the software system GeoGebra. Computer algebra systems and dynamic geometry systems in mathematics teaching conference 2004 2002, July (2005), 1--6. http: //www.geogebratube.org/material/show/id/747",
      "doi": ""
    },
    {
      "text": "Thibaud Hottelier, Ras Bodik, and Kimiko Ryokai. 2014. Programming by manipulation for layout. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14. ACM Press, NY, NY, USA, 231--241. DOI: http://dx.doi.org/10.1145/2642918.2647378  ",
      "doi": "10.1145/2642918.2647378"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 2007. Teddy: a sketching interface for 3D freeform design. In Acm siggraph 2007 courses. ACM, 21.  ",
      "doi": "10.1145/1281500.1281532"
    },
    {
      "text": "Joaquim Jorge and Faramarz Samavati. 2010. Sketch-based interfaces and modeling. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive Visual Specification of Data Transformation Scripts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 3363--3372. DOI: http://dx.doi.org/10.1145/1978942.1979444  ",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Alan Kay and Adele Goldberg. 1977. Personal dynamic media. Computer 10, 3 (1977), 31--41.  ",
      "doi": "10.1109/C-M.1977.217672"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2014a. Kitty: sketching dynamic and interactive illustrations. Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14 (2014), 395--405. DOI: http://dx.doi.org/10.1145/2642918.2647375  ",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, Shengdong Zhao, and George Fitzmaurice. 2014b. Draco: Bringing Life to Illustrations with Kinetic Textures. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2014), 351--360. DOI: http://dx.doi.org/10.1145/2556288.2556987  ",
      "doi": "10.1145/2556288.2556987"
    },
    {
      "text": "Rubaiat Habib Kazi, Tovi Grossman, Nobuyuki Umetani, and George Fitzmaurice. 2016. Skuid: Sketching Dynamic Illustrations Using the Principles of 2D Animation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4599--4609.  ",
      "doi": "10.1145/2858036.2858386"
    },
    {
      "text": "Vu Le, Sumit Gulwani, and Zhendong Su. 2013. SmartSynth. In Proceeding of the 11th annual international conference on Mobile systems, applications, and services - MobiSys '13. ACM Press, NY, NY, USA, 193. DOI: http://dx.doi.org/10.1145/2462456.2464443  ",
      "doi": "10.1145/2462456.2464443"
    },
    {
      "text": "Gilly Leshed, Eben M Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: automating & sharing how-to knowledge in the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1719--1728.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Hao Lü and Yang Li. 2012. Gesture Coder: A Tool for Programming Multi-touch Gestures by Demonstration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2875--2884. DOI: http://dx.doi.org/10.1145/2207676.2208693  ",
      "doi": "10.1145/2207676.2208693"
    },
    {
      "text": "Emily B. Moore, Timothy A. Herzog, and Katherine K. Perkins. 2013. Interactive simulations as implicit support for guided-inquiry. Chem. Educ. Res. Pract. 14 (2013), 257--268. Issue 3. DOI: http://dx.doi.org/10.1039/C3RP20157K ",
      "doi": ""
    },
    {
      "text": "B. A. Myers. 1986. Visual Programming, Programming by Example, and Program Visualization: A Taxonomy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '86). ACM, NY, NY, USA, 59--66. DOI: http://dx.doi.org/10.1145/22627.22349  ",
      "doi": "10.1145/22627.22349"
    },
    {
      "text": "Brad A. Myers. 1990. Creating User Interfaces Using Programming by Example, Visual Programming, and Constraints. ACM Trans. Program. Lang. Syst. 12, 2 (April 1990), 143--177. DOI: http://dx.doi.org/10.1145/78942.78943  ",
      "doi": "10.1145/78942.78943"
    },
    {
      "text": "Dan R. Olsen, Jr. and Kirk Allan. 1990. Creating Interactive Techniques by Symbolically Solving Geometric Constraints. In Proceedings of the 3rd Annual ACM SIGGRAPH Symposium on User Interface Software and Technology (UIST '90). ACM, NY, NY, USA, 102--107. DOI: http://dx.doi.org/10.1145/97924.97936  ",
      "doi": "10.1145/97924.97936"
    },
    {
      "text": "Stephen Oney, Brad Myers, and Joel Brandt. 2012. ConstraintJS: programming interactive behaviors for the web by integrating constraints and states. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 229--238.  ",
      "doi": "10.1145/2380116.2380146"
    },
    {
      "text": "Eleanor O'Rourke, Erik Andersen, Sumit Gulwani, and Zoran Popović. 2015. A Framework for Automatically Generating Interactive Instructional Scaffolding. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1545--1554. DOI: http://dx.doi.org/10.1145/2702123.2702580  ",
      "doi": "10.1145/2702123.2702580"
    },
    {
      "text": "Katherine Perkins, Wendy Adams, Michael Dubson, Noah Finkelstein, Sam Reid, Carl Wieman, and Ron LeMaster. 2006. PhET: Interactive Simulations for Teaching and Learning Physics. The Physics Teacher 44, 1 (dec 2006), 18. DOI: http://dx.doi.org/10.1119/1.2150754 ",
      "doi": ""
    },
    {
      "text": "Noah S. Podolefsky, Katherine K. Perkins, and Wendy K. Adams. 2009. Computer simulations to classrooms: tools for change. AIP Conference Proceedings 1179, 1 (2009), 233--236. DOI: http://dx.doi.org/10.1063/1.3266723 ",
      "doi": ""
    },
    {
      "text": "Robert D Rogers and Stephen Monsell. 1995. Costs of a predictible switch between simple cognitive tasks. Journal of experimental psychology: General 124, 2 (1995), 207.",
      "doi": ""
    },
    {
      "text": "Leonid Ryzhyk, Adam Walker, John Keys, Alexander Legg, Arun Raghunath, Michael Stumm, and Mona Vij. 2014. User-guided device driver synthesis. In 11th USENIX Symposium on Operating Systems Design and Implementation (OSDI 14). 661--676.",
      "doi": ""
    },
    {
      "text": "Armando Solar-Lezama, Liviu Tancau, Rastislav Bodik, Sanjit Seshia, and Vijay Saraswat. 2006. Combinatorial Sketching for Finite Programs. SIGOPS Oper. Syst. Rev. 40, 5 (Oct. 2006), 404--415. DOI: http://dx.doi.org/10.1145/1168917.1168907  ",
      "doi": "10.1145/1168917.1168907"
    },
    {
      "text": "Ivan E Sutherland. 1964. Sketch pad a man-machine graphical communication system. In Proceedings of the SHARE design automation workshop. ACM, 6--329.",
      "doi": "10.1145/800265.810742"
    },
    {
      "text": "Brad Vander Zanden. 1992. Languages for Developing User Interfaces. A. K. Peters, Ltd., Natick, MA, USA, Chapter An Active-value&Mdash;Spreadsheet Model for Interactive Languages, 183--209. http://dl.acm.org/citation.cfm?id=131302.131313",
      "doi": ""
    },
    {
      "text": "Bradley T. Vander Zanden, Richard Halterman, Brad A. Myers, Rob Miller, Pedro Szekely, Dario A. Giuse, David Kosbie, and Rich McDaniel. 2005. Lessons Learned from Programmers' Experiences with One-way Constraints: Research Articles. Softw. Pract. Exper. 35, 13 (Nov. 2005), 1275--1298. DOI: http://dx.doi.org/10.1002/spe.v35:13",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Bruno Araujo, Tovi Grossman, and Daniel Wigdor. 2016. Object-Oriented Drawing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4610--4621.  ",
      "doi": "10.1145/2858036.2858075"
    },
    {
      "text": "Jun Xing, Rubaiat Habib Kazi, Tovi Grossman, Li-Yi Wei, Jos Stam, and George Fitzmaurice. 2016. Energy-Brushes: Interactive Tools for Illustrating Stylized Elemental Dynamics. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 755--766.",
      "doi": "10.1145/2984511.2984585"
    },
    {
      "text": "Jun Xing, Li-Yi Wei, Takaaki Shiratori, and Koji Yatani. 2015. Autocomplete hand-drawn animations. ACM Transactions on Graphics (TOG) 34, 6 (2015), 169.",
      "doi": "10.1145/2816795.2818079"
    },
    {
      "text": "Kuat Yessenov, Shubham Tulsiani, Aditya Menon, Robert C. Miller, Sumit Gulwani, Butler Lampson, and Adam Kalai. 2013. A Colorful Approach to Text Processing by Example. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 495--504. DOI: http://dx.doi.org/10.1145/2501988.2502040  ",
      "doi": "10.1145/2501988.2502040"
    },
    {
      "text": "Clemens Zeidler, Christof Lutteroth, Wolfgang Sturzlinger, and Gerald Weber. 2013. The Auckland Layout Editor: An Improved GUI Layout Specification Process. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, 343--352. DOI: http://dx.doi.org/10.1145/2501988.2502007  ",
      "doi": "10.1145/2501988.2502007"
    },
    {
      "text": "Bo Zhu, Michiaki Iwata, Ryo Haraguchi, Takashi Ashihara, Nobuyuki Umetani, Takeo Igarashi, and Kazuo Nakazawa. 2011. Sketch-based Dynamic Illustration of Fluid Systems. ACM Transactions on Graphics 30, 6 (dec 2011), 1. DOI: http://dx.doi.org/10.1145/2070781.2024168  ",
      "doi": "10.1145/2070781.2024168"
    }
  ]
}