{
  "doi": "10.1145/3025453.3025649",
  "title": "Response Times when Interpreting Artificial Subtle Expressions are Shorter than with Human-like Speech Sounds",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3501-3505",
  "year": 2017,
  "badges": [],
  "abstract": "Artificial subtle expressions (ASEs) are machine-like expressions used to convey a system's confidence level to users intuitively. In this paper, we focus on the cognitive loads of users in interpreting ASEs in this study. Specifically, we assume that a shorter response time indicates less cognitive load, and we hypothesize that users will show a shorter response time when interpreting ASEs compared with speech sounds. We succeeded in verifying our hypothesis in a web-based investigation done to comprehend participants' cognitive loads by measuring their response times in interpreting ASEs and speeches.",
  "tags": [
    "artificial subtle expressions (ases)",
    "cognitive loads",
    "response time",
    "speech"
  ],
  "authors": [
    {
      "name": "Takanori Komatsu",
      "institution": "Meiji University, Nakano-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81328489326/rel-imgonly/_mg_3986.jpg",
      "acmid": "81328489326",
      "orcid": "missing"
    },
    {
      "name": "Kazuki Kobayashi",
      "institution": "Shinshu University, Nagano, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381602707",
      "orcid": "missing"
    },
    {
      "name": "Seiji Yamada",
      "institution": "National Institute of Informatics & SOKENDAI, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81321500077/rel-imgonly/syamada-20180903.jpg",
      "acmid": "81321500077",
      "orcid": "missing"
    },
    {
      "name": "Kotaro Funakoshi",
      "institution": "Honda Research Institute Japan Co., Ltd., Wako, Saitama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100237137",
      "orcid": "missing"
    },
    {
      "name": "Mikio Nakano",
      "institution": "Ltd., Wako, Saitama, Japan",
      "img": "/do/10.1145/contrib-81100633290/rel-imgonly/nakano-photo3-c.jpg",
      "acmid": "81100633290",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Antifakos, S., Kern, N., Shiele, B., and Schwaninger, A. Towards Improving Trust in Context Aware Systems by Displaying System Confidence, In Proc. MobileHCI'05, ACM Press (2005), 9--14.  ",
      "doi": "10.1145/1085777.1085780"
    },
    {
      "text": "Beatty, J. Task-evoked pupillary responses, processing load, and the structure of processing resources, Psychological Bulletin 91, (1982), 276--292. ",
      "doi": ""
    },
    {
      "text": "Bellotti, V. and Edwards, K. Intelligibility and accountability: Human considerations in context-aware systems, Human-Computer Interaction 16, 2 (2001), 193--212.  ",
      "doi": "10.1207/S15327051HCI16234_05"
    },
    {
      "text": "Benzeghibaa, M., De Moria, R., Derooa, O., Dupont S., Erbesa, T., Jouveta, D., Fissorea, F., Lafacea, P., Mertinsa, A., Risa, C., Rosea, R., Tyagia, V., and Wellekensa, C. Automatic speech recognition and speech variability: A review, Speech Communication 49, 10-11 (2007), 763--786.",
      "doi": "10.1016/j.specom.2007.02.006"
    },
    {
      "text": "Blattner, M. M., Sumikawa, D. A., and Greenberg, R. M. Earcons and Icons: Their Structure and Common Design Principles, SIGCHI Bull. 21, 1 (1989), 123--124.  ",
      "doi": "10.1145/67880.1046599"
    },
    {
      "text": "Cai, H. and Lin, Y. Tuning Trust Using Cognitive Cues for Better Human-Machine Collaboration, In Proc. HFES2010, pp. 2437--2441(5).",
      "doi": ""
    },
    {
      "text": "Feng, J. and Sears, A. Using Confidence Scores to Improve Hands-Free Speech Based Navigation in Continuous Dictation Systems, ACM Transactions on Computer-Human Interaction 11, 4, ACM Press (2004), 329--356.",
      "doi": "10.1145/1035575.1035576"
    },
    {
      "text": "Fredericks, T. K., Choi, S. D., Hart, J., Butt, S. E., and Mital, A. An investigation of myocardial aerobic capacity as a measure of both physical and cognitive workloads, International Journal of Industrial Ergonomics 35 (12), (2005), 1097--1107. ",
      "doi": ""
    },
    {
      "text": "Horvitz, E., and Barry, M. Display of information for time-critical decision making, In Proc. 11th Conf. on Uncertainty in Artificial Intelligence, Morgan Kaufmann (1995), 296--305.",
      "doi": "10.5555/2074158.2074191"
    },
    {
      "text": "Horvitz, E. Principles of mixed-initiative user interfaces, In Proc. CHI'99, ACM Press (1999), 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Hussain, S., Chen, S., Calvo, R. A., and Chen, F. Classification of cognitive load from task performance & multichannel physiology during affective changes, In Proc. MMCogEmS: Inferring Cognitive and Emotional States from Multimodal Measures (ICMI 2011 Workshop) (2011).",
      "doi": ""
    },
    {
      "text": "Kahneman, D. Attention and effort, Prentice-Hall, New Jersey, (1973).",
      "doi": ""
    },
    {
      "text": "Katehakis, M, N. and Veinott, A, F, Jr. The MultiArmed Bandit Problem: Decomposition and Computation, Mathematics of Operation Research 12, 2 (1987), 262--268.  ",
      "doi": "10.5555/34030.34037"
    },
    {
      "text": "Komatsu, T., Yamada, S., Kobayashi, K., Funakoshi, K., and Nakano, M. Artificial Subtle Expressions: Intuitive Notification Methodology for Artifacts, In Proc. CHI'10, ACM Press (2010), 1941--1944.  ",
      "doi": "10.1145/1753326.1753619"
    },
    {
      "text": "Komatsu, T., Kobayashi, K., Yamada, S., Funakoshi, K., and Nakano, M. How Can We Live with Overconfident or Unconfident Systems? A Comparison of Artificial Subtle Expressions with Human-like Expression, In Proc. CogSci2012 (2012), 1816--1821.",
      "doi": ""
    },
    {
      "text": "Komatsu, T., Kobayashi, K., Yamada, S., Funakoshi, K., and Nakano, M. Investigating Ways of Interpretations of Artificial Subtle Expressions Among Different Languages: A Case of Comparison Among Japanese, German, Portuguese and Mandarin Chinese, In Proc. CogSci2015 (2015), 1159--1164.",
      "doi": ""
    },
    {
      "text": "Komarov, S., Reinecke, K., and Gajos, K. Z. Crowdsourcing performance evaluations of user interfaces, In Proc. CHI'13, ACM Press (2013), 207216.  ",
      "doi": "10.1145/2470654.2470684"
    },
    {
      "text": "Liu, B. and Lane, I. Joint Online Spoken Language Understanding and Language Modeling with Recurrent Neural Networks, In Proc. SIGDIAL'16, (2016), 22--30. ",
      "doi": ""
    },
    {
      "text": "Navon, D. and Gopher, D. On the economy of the human-processing system, Psychological Review 86, (1979), 214--255. ",
      "doi": ""
    },
    {
      "text": "Noyes, J. M., Hellier, E., and Edworthy, J. Speech warnings: a review, Theoretical Issues in Ergonomics Science 7, 6 (2006), 551--571. ",
      "doi": ""
    },
    {
      "text": "Mesnil, G., Dauphin, Y., Yao, K., Bengio, Y., Deng, L., Hakkani-Tur, D., He, X., Heck, L., Tur, G., Yu, D., and Zweig, G. Using Recurrent Neural Networks for Slot Filling in Spoken Language Understanding, IEEE Transactions on Audio, Speech, and Language Processing 23 (3), (2015), 530--539.",
      "doi": "10.5555/2817174.2817185"
    },
    {
      "text": "Ogawa, A. and Nakamura, A. Joint estimation of confidence and error causes in speech recognition, Speech Communication 54, 9 (2012), 1014--1028.  ",
      "doi": "10.1016/j.specom.2012.04.004"
    },
    {
      "text": "Paas, F. G. W. C. and Van Merrienboer, J. J. G. The Efficiency of Instructional Conditions: An Approach to Combine Mental Effort and Performance Measures, Human Factors: the Journal of the Human Factors and Ergonomics Society 35 (4), (1993), 737--743.",
      "doi": ""
    },
    {
      "text": "Sweller, J. Cognitive Load During Problem Solving: Effects on Learning, Cognitive Science 12, (1998), 257--285. ",
      "doi": ""
    },
    {
      "text": "Vilimek, R., and Hempel, T. Effects of speech and non-speech sounds on short-term memory and possible implications for in-vehicle use, In Proc. ICAD 2005, (2005).",
      "doi": ""
    }
  ]
}