{
  "doi": "10.1145/3025453.3025840",
  "title": "Exploring Topic-Based Sharing Mechanisms",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6973-6985",
  "year": 2017,
  "badges": [],
  "abstract": "General-purpose content-sharing platforms make it difficult for users to limit sharing to people interested in particular topics. Additional topic-based controls may allow users to better reach desired audiences. Designing such tools requires understanding current interest-based targeting techniques and the potential impact of additional mechanisms. We present an exploratory, interview-based study (n = 16) that addresses these dynamics for Facebook. We use diary-driven probes to explore general topic-based sharing across applications. We then use Facebook-based mockups to probe use cases and design tensions around adding topic-based sharing mechanisms to Facebook. We find that participants currently draw on various audience-limiting and reaching strategies to target interest-based audiences. Participants felt additional topic-based sharing mechanisms on Facebook might allow them to avoid oversharing or offending others and allow them to target improved audiences or share improved content. Usable topic-based sharing tools would also need to account, however, for participants' varied desired engagement strategies.",
  "tags": [
    "topics",
    "targeting strategies",
    "facebook",
    "topic-based sharing",
    "selective sharing",
    "access control"
  ],
  "authors": [
    {
      "name": "Manya Sleeper",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488672672",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Faith Cranor",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Sarah K. Pearman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160332",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti and Ralph Gross. 2006. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In Privacy Enhancing Technologies. Springer, 36--58. http://link.springer.com/chapter/10.1007/11957454_3  ",
      "doi": "10.1007/11957454_3"
    },
    {
      "text": "Morgan Ames and Mor Naaman. 2007. Why we tag: Motivations for annotation in mobile and online media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 971--980. http://dl.acm.org/citation.cfm?id=1240772  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Michael S Bernstein, Eytan Bakshy, Moira Burke, and Brian Karrer. 2013. Quantifying the invisible audience in social networks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 21--30. http://dl.acm.org/citation.cfm?doid=2470654.2470658  ",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Jeremy Birnholtz, Nicholas Aaron Ross Merola, and Arindam Paul. 2015. Is it weird to sill be a virgin?: Anonymous, locally targeted questions on Facebook Confession Boards. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, 2613--2622. http://comm.soc.northwestern.edu/ socialmedia/files/2012/09/pn1506-birnholtz.pdf  ",
      "doi": "10.1145/2702123.2702410"
    },
    {
      "text": "Danah Boyd. 2006. Friends, friendsters, and myspace top 8: Writing community into being on social network sites. (2006). http://citeseerx.ist.psu.edu/viewdoc/ summary?doi=10.1.1.79.5665",
      "doi": ""
    },
    {
      "text": "Sauvik Das and Adam Kramer. 2013. Self-Censorship on Facebook.. In ICWSM. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM13/paper/ viewPDFInterstitial/6093/6350",
      "doi": ""
    },
    {
      "text": "Nicole B. Ellison, Jessica Vitak, Rebecca Gray, and Cliff Lampe. 2014. Cultivating social resources on social network sites: Facebook relationship maintenance behaviors and their role in social capital processes. Journal of Computer-Mediated Communication 19, 4 (2014), 855--870.  ",
      "doi": "10.1111/jcc4.12078"
    },
    {
      "text": "Roberto González-Ibánez, Smaranda Muresan, and Nina Wacholder. 2011. Identifying sarcasm in Twitter: A closer look. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies: Short papers-Volume 2. Association for Computational Linguistics, 581--586. ",
      "doi": "10.5555/2002736.2002850"
    },
    {
      "text": "Kathryn Greene and S Petronio. 2000. Disclosure of chronic illness varies by topic and target: The role of stigma and boundaries in willingness to disclose. In Balancing the Secrets of Private Disclosures. Lawrence Erlbaum Associates, 123--135.",
      "doi": ""
    },
    {
      "text": "Andrea Hartzler, Meredith M Skeels, Marlee Mukai, Christopher Powell, Predrag Klasnja, and Wanda Pratt. 2011. Sharing is caring, but not error free: Transparency of granular controls for sharing personal health information in social networks. In AMIA Annual Symposium Proceedings, Vol. 2011. 559--568. http://pubmedcentralcanada.ca/pmcc/articles/ PMC3243199/pdf/0559_amia_2011_proc.pdf",
      "doi": ""
    },
    {
      "text": "Bernie Hogan. 2010. The presentation of self in the age of social media: Distinguishing performances and exhibitions online. Bulletin of Science, Technology & Society (2010). http://bst.sagepub.com/content/early/ 2010/10/31/0270467610385893.abstract",
      "doi": ""
    },
    {
      "text": "The White House. 2014. Big Data: Seizing Opportunities, Preserving Values. (2014). https://www.whitehouse.gov/sites/default/files/docs/ big_data_privacy_report_may_1_2014.pdf",
      "doi": ""
    },
    {
      "text": "Adam N. Joinson. 2008. Looking at, looking up or keeping up with people?: Motives and use of Facebook. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1027--1036. http://dl.acm.org/citation.cfm?id=1357213  ",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Sanjay Kairam, Mike Brzozowski, David Huffaker, and Ed Chi. 2012. Talking in circles: Selective sharing in Google+. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1065--1074. http://dl.acm.org/citation.cfm?id=2208552  ",
      "doi": "10.1145/2207676.2208552"
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, and Sara Kiesler. 2013. Why do people seek anonymity on the Internet? Informing policy and design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2657--2666. http://dl.acm.org/citation.cfm?id=2481368  ",
      "doi": "10.1145/2470654.2481368"
    },
    {
      "text": "Patrick Gage Kelley, Robin Brewer, Yael Mayer, Lorrie Faith Cranor, and Norman Sadeh. 2011. An investigation into Facebook friend grouping. In Human-Computer Interaction, INTERACT, 2011. Springer, 216--233. http://link.springer.com/chapter/ 10.1007/978--3--642--23765--2_15 ",
      "doi": "10.5555/2042182.2042202"
    },
    {
      "text": "Peter Klemperer, Yuan Liang, Michelle Mazurek, Manya Sleeper, Blase Ur, Lujo Bauer, Lorrie Faith Cranor, Nitin Gupta, and Michael Reiter. 2012. Tag, you can see it!: Using tags for access control in photo sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 377--386. http://dl.acm.org/citation.cfm?id=2207728  ",
      "doi": "10.1145/2207676.2207728"
    },
    {
      "text": "Haewoon Kwak, Hyunwoo Chun, and Sue Moon. 2011. Fragile online relationship: A first look at unfollow dynamics in Twitter. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1091--1100. http://dl.acm.org/citation.cfm?id=1979104  ",
      "doi": "10.1145/1978942.1979104"
    },
    {
      "text": "Airi Lampinen, Vilma Lehtinen, Asko Lehmuskallio, and Sakari Tamminen. 2011. We're in it together: Interpersonal management of disclosure in social network services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3217--3226. http://dl.acm.org/citation.cfm?id=1979420  ",
      "doi": "10.1145/1978942.1979420"
    },
    {
      "text": "A. Lampinen, S. Tamminen, and A. Oulasvirta. 2009. All my people right here, right now: Management of group co-presence on a social networking site. In Proceedings of the ACM 2009 International Conference on Supporting Group Work. 281--290. http://dl.acm.org/citation.cfm?doid=1531674.1531717  ",
      "doi": "10.1145/1531674.1531717"
    },
    {
      "text": "Eden Litt. 2012. Knock, knock. Who's there? The imagined audience. Journal of Broadcasting & Electronic Media 56, 3 (2012), 330--345.",
      "doi": ""
    },
    {
      "text": "Eden Litt and Eszter Hargittai. 2016. \"Just cast the net, and hopefully the right fish swim into it\": Audience management on social network sites. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, NY, NY, USA, 1488--1500.  ",
      "doi": "10.1145/2818048.2819933"
    },
    {
      "text": "Eden Litt, Erin Spottswood, Jeremy Birnholtz, Jeff T. Hancock, Madeline E. Smith, and Lindsay Reynolds. 2014. Awkward encounters of an other kind: Collective self-presentation and face threat on Facebook. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 449--460. http://dl.acm.org/citation.cfm?id=2531646  ",
      "doi": "10.1145/2531602.2531646"
    },
    {
      "text": "Cameron Marlow, Mor Naaman, Danah Boyd, and Marc Davis. 2006. HT06, tagging paper, taxonomy, Flickr, academic article, to read. In Proceedings of the Seventeenth Conference on Hypertext and Hypermedia. ACM, 31--40. http://dl.acm.org/citation.cfm?doid=1149941.1149949  ",
      "doi": "10.1145/1149941.1149949"
    },
    {
      "text": "Alice E. Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (2011), 114--133. http://nms.sagepub.com/content/13/1/114.short",
      "doi": ""
    },
    {
      "text": "Caitlin McLaughlin and Jessica Vitak. 2012. Norm evolution and violation on Facebook. New Media & Society 14, 2 (March 2012), 299--315.",
      "doi": ""
    },
    {
      "text": "Mark W Newman, Debra Lauterbach, Sean A Munson, Paul Resnick, and Margaret E Morris. 2011. It's not that I don't have problems, I'm just not putting them on Facebook: Challenges and opportunities in using online social networks for health. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. ACM, 341--350. http://dl.acm.org/citation.cfm?doid=1958824.1958876  ",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Sai Teja Peddinti, Keith W. Ross, and Justin Cappos. 2014. \"On the Internet, nobody knows you're a dog\": A Twitter case study of anonymity in social networks. In Proceedings of the Second ACM Conference on Online Social Networks. ACM, NY, NY, USA, 83--94.  ",
      "doi": "10.1145/2660460.2660467"
    },
    {
      "text": "Sandra Petronio. 2012. Boundaries of privacy: Dialectics of disclosure. Suny Press.",
      "doi": ""
    },
    {
      "text": "Lillian Røstad and Ole Andreas Alsos. 2009. Patient-administered access control: A usability study. In International Conference on Availability, Reliability and Security International. IEEE, 877--881.",
      "doi": ""
    },
    {
      "text": "Bryan Semaan, Heather Faucett, Scott Robertson, Misa Maruyama, and Sara Douglas. 2015. Navigating Imagined Audiences: Motivations for Participating in the Online Public Sphere. In Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, NY, NY, USA, 1158--1169.  ",
      "doi": "10.1145/2675133.2675187"
    },
    {
      "text": "Christopher Sibona and Steven Walczak. 2011. Unfriending on Facebook: Friend request and online/offline behavior analysis. In Hawaii International Conference on System Sciences. IEEE, 1--10. http:// ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=5718725  ",
      "doi": "10.1109/HICSS.2011.467"
    },
    {
      "text": "Manya Sleeper, Rebecca Balebako, Sauvik Das, Amber Lynn McConahy, Jason Wiese, and Lorrie Faith Cranor. 2013. The post that wasn't: Exploring self-censorship on Facebook. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. ACM, 793--802. http://dl.acm.org/citation.cfm?id=2441865  ",
      "doi": "10.1145/2441776.2441865"
    },
    {
      "text": "Manya Sleeper, William Melicher, Hana Habib, Lujo Bauer, Lorrie Faith Cranor, and Michelle L Mazurek. 2016. Sharing Personal Content Online: Exploring Channel Choice and Multi-Channel Behaviors. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM. http://dl.acm.org/citation.cfm?doid=2858036.2858170  ",
      "doi": "10.1145/2858036.2858170"
    },
    {
      "text": "H. Colleen Stuart, Laura Dabbish, Sara Kiesler, Peter Kinnaird, and Ruogu Kang. 2012. Social transparency in networked information exchange: A theoretical framework. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. ACM, 451--460. http://dl.acm.org/citation.cfm?id=2145275  ",
      "doi": "10.1145/2145204.2145275"
    },
    {
      "text": "Frederic Stutzman and Woodrow Hartzog. 2012. Boundary regulation in social media. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work. ACM, 769--778. http://dl.acm.org/citation.cfm?doid=2145204.2145320  ",
      "doi": "10.1145/2145204.2145320"
    },
    {
      "text": "Eran Toch, Justin Cranshaw, Paul Hankes Drielsma, Janice Y Tsai, Patrick Gage Kelley, James Springfield, Lorrie Cranor, Jason Hong, and Norman Sadeh. 2010. Empirical models of privacy in location sharing. In Proceedings of the ACM International Conference on Ubiquitous Computing. ACM, 129--138. http://dl.acm.org/citation.cfm?doid=1864349.1864364  ",
      "doi": "10.1145/1864349.1864364"
    },
    {
      "text": "Jessica Vitak, Stacy Blasiola, Sameer Patil, and Eden Litt. 2015. Balancing audience and privacy tensions on social network sites: Strategies of highly engaged users. International Journal of Communication 9 (2015), 20. http://ijoc.org/index.php/ijoc/article/view/3208",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Nicole B. Ellison. 2012. \"There's a network out there you might as well tap\": Exploring the benefits of and barriers to exchanging informational and support-based resources on Facebook. New Media & Society (2012). http://nms.sagepub.com/content/early/ 2012/07/17/1461444812451566.abstract",
      "doi": ""
    },
    {
      "text": "Yang Wang, Gregory Norcie, Saranga Komanduri, Alessandro Acquisti, Pedro Giovanni Leon, and Lorrie Faith Cranor. 2011. I regretted the minute I pressed share: A qualitative study of regrets on Facebook. In Proceedings of the Seventh Symposium on Usable Privacy and Security. ACM, 10. http://dl.acm.org/citation.cfm?id=2078841  ",
      "doi": "10.1145/2078827.2078841"
    },
    {
      "text": "Jason Wiese, Patrick Gage Kelley, Lorrie Faith Cranor, Laura Dabbish, Jason I. Hong, and John Zimmerman. 2011. Are you close with me? Are you nearby?: Investigating social groups, closeness, and willingness to share. In Proceedings of the International Conference on Ubiquitous Computing. ACM, NY, NY, USA, 197--206.  ",
      "doi": "10.1145/2030112.2030140"
    },
    {
      "text": "Pamela Wisniewski, Heather Lipford, and David Wilson. 2012. Fighting for my space: Coping mechanisms for SNS boundary regulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 609--618.  ",
      "doi": "10.1145/2207676.2207761"
    },
    {
      "text": "Pamela J Wisniewski, Bart P Knijnenburg, and Heather Richter Lipford. 2017. Making privacy personal: Profiling social network users to inform privacy education and nudging. International Journal of Human-Computer Studies 98 (2017), 95--108.  ",
      "doi": "10.1016/j.ijhcs.2016.09.006"
    },
    {
      "text": "Xuan Zhao, Cliff Lampe, and Nicole B Ellison. 2016. The Social Media Ecology: User Perceptions, Strategies and Challenges. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, 89--100.  ",
      "doi": "10.1145/2858036.2858333"
    }
  ]
}