{
  "doi": "10.1145/3025453.3025543",
  "title": "Revisiting The American Voter on Twitter",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4507-4519",
  "year": 2017,
  "badges": [],
  "abstract": "The American Voter - a seminal work in political science - uncovered the multifaceted nature of voting behavior which has been corroborated in electoral research for decades since. In this paper, we leverage The American Voter as an analysis framework in the realm of computational political science, employing the factors of party, personality, and policy to structure the analysis of public discourse on online social media during the 2016 U.S. presidential primaries. Our analysis of 50 million tweets reveals the continuing importance of these three factors; our understanding is also enriched by the application of sentiment analysis techniques. The overwhelmingly negative sentiment of conversations surrounding 10 major presidential candidates reveals more \"crosstalk\" from Democratic leaning users towards Republican candidates, and less vice-versa. We uncover the lack of moderation as the most discussed personality dimension during this campaign season, as the political field becomes more extreme - Clinton and Rubio are perceived as moderate, while Trump, Sanders, and Cruz are not. While the most discussed issues are foreign policy and immigration, Republicans tweet more about abortion than Democrats who tweet more about gay rights than Republicans. Finally, we illustrate the importance of multifaceted political discourse analysis by applying regression to quantify the impact of party, personality, and policy on national polls.",
  "authors": [
    {
      "name": "Huyen T. Le",
      "institution": "The University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161201",
      "orcid": "missing"
    },
    {
      "name": "G. R. Boynton",
      "institution": "The University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100323680",
      "orcid": "missing"
    },
    {
      "name": "Yelena Mejova",
      "institution": "Qatar Computing Research Institute, Doha, Qatar",
      "img": "/do/10.1145/contrib-81438596595/rel-imgonly/by_black_wall_1square.jpg",
      "acmid": "81438596595",
      "orcid": "missing"
    },
    {
      "name": "Zubair Shafiq",
      "institution": "The University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659038473",
      "orcid": "missing"
    },
    {
      "name": "Padmini Srinivasan",
      "institution": "The University of Iowa, Iowa City, IA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332529194",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2013. New Tweets per second record, and how! https://blog.twitter.com/2013/new-tweets-per-second-record-and-how. (August 2013).",
      "doi": ""
    },
    {
      "text": "2016. Donald Trump: Ban all Muslim travel to U.S. http://www.cnn.com/2015/12/07/politics/donald-trump-muslim-ban-immigration/. (December 2016).",
      "doi": ""
    },
    {
      "text": "2016. Election 2016 Presidential Polls. http://www.realclearpolitics.com/epolls/latest_polls/president/. (2016).",
      "doi": ""
    },
    {
      "text": "2016. Fiorina: Obama 'delusional' about magnitude of climate change as security threat. http://www.foxnews.com/politics/2015/11/29/fiorina-obama-delusional-about-magnitude-climate-change-as-security-threat.html. (November 2016).",
      "doi": ""
    },
    {
      "text": "Alan Abramowitz and Steven Webster. 2015. All politics is national: The rise of negative partisanship and the nationalization of US house and senate elections in the 21st century. In Annual Meeting of the Midwest Political Science Association Conference.",
      "doi": ""
    },
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social Media and Fake News in the 2016 Election. (January 2017). NBER Working Paper No. 23089.",
      "doi": ""
    },
    {
      "text": "Stefano Baccianella, Andrea Esuli, and Fabrizio Sebastiani. 2010. SentiWordNet 3.0: An Enhanced Lexical Resource for Sentiment Analysis and Opinion Mining. In LREC, Vol. 10. 2200--2204.",
      "doi": ""
    },
    {
      "text": "Eytan Bakshy, Solomon Messing, and Lada Adamic. 2015. Exposure to Ideologically Diverse News and Opinion on Facebook. Science 348, 6239 (May 2015), 1130--1132.",
      "doi": ""
    },
    {
      "text": "Pablo Barberá, John T. Jost, Jonathan Nagler, Joshua A. Tucker, and Richard Bonneau. 2015. Tweeting From Left to Right: Is Online Political Communication More Than an Echo Chamber? Psychological Science (August 2015).",
      "doi": ""
    },
    {
      "text": "Larry M. Bartels. 2002. Beyond the Running Tally: Partisan Bias in Political Perceptions. Political Behavior 24, 2 (Jun 2002), 117--150.",
      "doi": ""
    },
    {
      "text": "Frank R. Baumgartner, F. R. tner and Bryan D. Jones. 1993. Agendas and Instability in American Politics. Chicago : University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "William M. Benoit. 2004. Political Party Affiliation and Presidential Campaign Discourse. Communication Quarterly 52, 2 (2004), 81--97.",
      "doi": ""
    },
    {
      "text": "Adam Bermingham and Alan F. Smeaton. 2011. On Using Twitter to Monitor Political Sentiment and Predict Election Results. In Sentiment Analysis where AI meets Psychology.",
      "doi": ""
    },
    {
      "text": "Sanmitra Bhattacharya, Chao Yang, Padmini Srinivasan, and Bob Boynton. 2015. Perceptions of Presidential Candidates' Personality in Twitter. Journal of the Association for Information Science and Technology (2015).  ",
      "doi": "10.1002/asi.23377"
    },
    {
      "text": "Pete Burnap, Rachel Gibson, Luke Sloan, Rosalynd Southern, and Matthew Williams. 2015. 140 Characters to Victory?: Using Twitter to Predict the UK 2015 General Election. Cardiff University (working paper) (2015).",
      "doi": ""
    },
    {
      "text": "Angus Campbell, Converse Philip, Miller Warren, and Stokes Donald. 1960. The American Voter. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2015. A Deep Dive Into Party Affiliation. http://www.people-press.org/2015/04/07/a-deep-dive-into-party-affiliation/. (April 2015).",
      "doi": ""
    },
    {
      "text": "Andrea Ceron, Luigi Curini, and Stefano M. Iacus. 2014. Every tweet counts? How sentiment analysis of social media can improve our knowledge of citizens' political preferences with an application to Italy and France. New Media & Society 16, 2 (2014), 340--358.",
      "doi": ""
    },
    {
      "text": "Roger W. Cobb and Charles D. Elder. 1972. Participation in American Politics: The Dynamics of Agenda Building. Johns Hopkins University Press.",
      "doi": ""
    },
    {
      "text": "Raviv Cohen and Derek Ruths. 2013. Classifying Political Orientation on Twitter: It's Not Easy!. In Proceedings of the Seventh International AAAI Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Michael D. Conover, Bruno Gonçalves, Jacob Ratkiewicz, Alessandro Flammini, and Filippo Menczer. 2011a. Predicting the political alignment of Twitter users. Proceedings of the International Conference on Social Computing (2011).",
      "doi": ""
    },
    {
      "text": "Michael D. Conover, Jacob Ratkiewicz, Matthew Francisco, Bruno Gonçalves, Filippo Menczer, and Alessandro Flammini. 2011b. Political Polarization on Twitter. In AAAI International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Edmond Costantini and Kenneth H. Craik. 1980. Personality and politicians: California party leaders, 1960-1976. Personality and Social Psychology 38, 4 (1980), 641--661.",
      "doi": ""
    },
    {
      "text": "Joseph DiGrazia, Karissa McKelvey, Johan Bollen, and Fabio Rojas. 2013. More tweets, more votes: Social media as a quantitative indicator of political behavior. PLOS ONE 11, 8 (2013).",
      "doi": ""
    },
    {
      "text": "Patrick Dolan. 2011. Abortion and American Politics: Can a single policy issue lead to party switching? Breithaupt American Government Paper Competition, Roanoke College. (April 2011).",
      "doi": ""
    },
    {
      "text": "Adam Edelman. 2016. 2016 candidate John Kasich: I would create a NEW government agency that would 'promote Judeo-Christian values'. http://www.nydailynews.com/news/politics/kasich-create-agency-push-judeo-christian-values-article-1.2439022. (November 2016).",
      "doi": ""
    },
    {
      "text": "Pew Research Center for the People & the Press. 2012a. Obama in a Word: From 'Inexperienced' and 'Change' to 'Good' and 'Trying'. http://www.people-press.org/2012/09/05/obama-in-a-word-from-inexperienced-and-change-to-good-and-trying/. (September 2012).",
      "doi": ""
    },
    {
      "text": "Pew Research Center for the People & the Press. 2012b. Romney in a Word: 'Honest,' 'Businessman,' 'Rich'. http://www.people-press.org/2012/08/29/romney-in-a-word-honest-businessman-rich/. (August 2012).",
      "doi": ""
    },
    {
      "text": "Maryann E. Gallagher and Susan H. Allen. 2014. Presidential Personality: Not Just a Nuisance. Foreign Policy Analysis 10, 1 (January 2014), 1--21.",
      "doi": ""
    },
    {
      "text": "Daniel Gayo-Avello. 2012. \"I Wanted to Predict Elections with Twitter and all I got was this Lousy Paper\" - A Balanced Survey on Election Prediction using Twitter Data. arXiv: 12046441 (2012).",
      "doi": ""
    },
    {
      "text": "Daniel Gayo-Avello, Panagiotis T. Metaxas, and Eni Mustafaraj. 2011. Limits of Electoral Predictions Using Twitter. In AAAI International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Alexander L. George and Juliette L. George. 1998. Presidential personality and performance. Boulder, CO: Westview Press.",
      "doi": ""
    },
    {
      "text": "Jennifer Golbeck and Derek Hansen. 2014. A method for computing political preference among Twitter followers. Social Networks (2014).",
      "doi": ""
    },
    {
      "text": "Jeffrey Gottfried, Michael Barthel, Elisa Shearer, and Amy Mitchell. 2016. The 2016 Presidential Campaign - a News Event That's Hard to Miss. http://www.journalism.org/2016/02/04/the-2016-presidential-campaign-a-news-event-thats-hard-to-miss/. (February 2016).",
      "doi": ""
    },
    {
      "text": "Harrison G. Gough and Alfred B. Heilbrun. 1983. The Adjective Check List Manual. Consulting Psychologists Press. (1983).",
      "doi": ""
    },
    {
      "text": "Benjamin Highton. 2012. Updating Political Evaluations: Policy Attitudes, Partisanship, and Presidential Assessments. Political Behavior 34, 1 (March 2012), 57--78.",
      "doi": ""
    },
    {
      "text": "Ryan Holmes. 2016. How Bernie Sanders Beats Donald Trump at Social Media. http://fortune.com/2016/04/18/bernie-sanders-donald-trump-social-media/. (April 2016).",
      "doi": ""
    },
    {
      "text": "Sounman Hong and Daniel Nadler. 2012. Which candidates do the public discuss online in an election campaign? The use of social media by 2012 presidential candidates and its impact on candidate salience. Government Information Quarterly 29, 4 (2012), 455--461.",
      "doi": ""
    },
    {
      "text": "Andreas Jungherr, Pascal Jürgens, and Harald Schoen. 2012. Why the Pirate Party Won the German Election of 2009 or The Trouble With Predictions. Social Science Computer Review 2, 30 (2012), 229--234.  ",
      "doi": "10.1177/0894439311404119"
    },
    {
      "text": "Michael Lewis-Beck, Jacoby G. William, Norpath Helmut, and Weisberg F. Herbert. 2008. The American Voter Revisited. University of Michigan Press.",
      "doi": ""
    },
    {
      "text": "Yelena Mejova, Padmini Srinivasan, and Bob Boynton. 2013. GOP Primary Season on Twitter: \"Popular\" Political Sentiment in Social Media. In WSDM.  ",
      "doi": "10.1145/2433396.2433463"
    },
    {
      "text": "Jonathan Scott Morgan, Cliff Lampe, and M.Z. Shafiq. 2013. Is news sharing on Twitter ideologically biased? In ACM Conference on Computer Supported Cooperative Work (CSCW).  ",
      "doi": "10.1145/2441776.2441877"
    },
    {
      "text": "Brendan O'Connor, Ramnath Balasubramanyan, Bryan R. Routledge, and Noah A. Smith. 2010. From Tweets to Polls: Linking Text Sentiment to Public Opinion Time Series. In AAAI International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Alexandra Olteanu, Carlos Castillo, Fernando Diaz, and Sarah Vieweg. 2014. CrisisLex: A Lexicon for Collecting and Filtering Microblogged Communications in Crises. In AAAI International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Marco Pennacchiotti and Ana-Maria Popescu. 2011. A Machine Learning Approach to Twitter User Classification. AAAI International Conference on Weblogs and Social Media (ICWSM) (2011).",
      "doi": ""
    },
    {
      "text": "Terri Rupar, Aaron Blake, and Samuel Granados. 2015. The ever-changing issues of the 2016 campaign, as seen on Twitter. http://wapo.st/1OgbJ45. (December 2015).",
      "doi": ""
    },
    {
      "text": "Erik T. K. Sang and Johan Bos. 2012. Predicting the 2011 Dutch senate election results with Twitter. In Workshop on Semantic Analysis in Social Media (SASN). ",
      "doi": "10.5555/2389969.2389976"
    },
    {
      "text": "David O. Sears and Jonathan L. Freedman. 1967. Selective Exposure to Information: A Critical Review. Public Opinion Quarterly 31, 2 (1967), 194--213.",
      "doi": ""
    },
    {
      "text": "Dean K. Simonton. 1986. Presidential Personality: Biographical Use of the Gough Adjective Check List. Journal of Personality and Social Psychology 51, 1 (1986), 149--160.",
      "doi": ""
    },
    {
      "text": "Marko Skoric and Nathaniel Poor. 2012. Tweets and votes: A study of the 2011 Singapore general election. In Hawaii International Conference on System Sciences (HICSS).  ",
      "doi": "10.1109/HICSS.2012.607"
    },
    {
      "text": "Aaron Smith. 2014. Cell Phones, Social Media and Campaign 2014. Pew Research Center. (November 2014).",
      "doi": ""
    },
    {
      "text": "Stefan Stieglitz and Linh X. Dang. 2013. Social media and political communication: a social media analytics framework. Social Network Analysis and Mining 4, 4 (December 2013), 1277--1291.",
      "doi": ""
    },
    {
      "text": "Andranik Tumasjan, Timm O. Sprenger, Philipp G. Sandner, and Isabell M. Welpe. 2010. Predicting Elections with Twitter: What 140 Characters Reveal about Political Sentiment. In AAAI International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Hao Wang, Dogan Can, Abe Kazemzadeh, François Bar, and Shrikanth Narayanan. 2012. A System for Real-time Twitter Sentiment Analysis of 2012 U.S. Presidential Election Cycle. In 50th Annual Meeting of the Association for Computational Linguistics. 115--120. ",
      "doi": "10.5555/2390470.2390490"
    },
    {
      "text": "Dan B. Wood and Alesha Doan. 2003. The Politics of Problem Definition: A Theory and Application to Sexual Harassment. American Journal of Political Science 47, 4 (October 2003), 640--653.",
      "doi": ""
    },
    {
      "text": "Dan B. Wood and Arnold Vedlitz. 2007. Issue Definition, Information Processing, and the Politics of Global Warming. American Journal of Political Science 51, 3 (July 2007), 552--568.",
      "doi": ""
    },
    {
      "text": "Faiyaz A. Zamal, Wendy Liu, and Derek Ruths. 2012. Homophily and latent attribute inference: Inferring latent attributes of Twitter users from neighbors. AAAI International Conference on Weblogs and Social Media (ICWSM) (2012).",
      "doi": ""
    },
    {
      "text": "Amy X. Zhang and Scott Counts. 2015. Modeling Ideology and Predicting Policy Change with Social Media: Case of Same-Sex Marriage. ACM Conference on Human Factors in Computing Systems (CHI) (2015).  ",
      "doi": "10.1145/2702123.2702193"
    },
    {
      "text": "Daniel X. Zhou, Paul Resnick, and Qiaozhu Mei. 2011. Classifying the Political Leaning of News Articles and Users from User Votes. In AAAI International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    }
  ]
}