{
  "doi": "10.1145/3025453.3025851",
  "title": "Participatory Evaluation with Autistic Children",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5755-5766",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Participatory Design (PD) has become a standard methodology in HCI, however, the evaluation of the outcomes of participatory processes is often exclusively driven by researcher defined measures of success. Through our work with autistic children, who have radically different life worlds from our own, it became evident that their criteria for the success of a project are most likely also very different. In order to address the limitations of researcher defined and led evaluations in this context, we developed an approach for participatory evaluation called PEACE (Participatory Evaluation with Autistic ChildrEn). Using this approach, we were able to include autistic children in dedicated evaluation phases through the co-definition of goals and methods, joint processes of data gathering and the co-interpretation of results. We discuss three case studies in which we successfully applied our approach and conclude with a reflection on the novel insights created through participatory evaluation and researchers' roles in such a process.",
  "tags": [
    "autism",
    "participatory evaluation",
    "children"
  ],
  "authors": [
    {
      "name": "Katta Spiel",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758673057",
      "orcid": "missing"
    },
    {
      "name": "Laura Malinverni",
      "institution": "Universitat Pompeu Fabra, Barcelona, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502809097",
      "orcid": "missing"
    },
    {
      "name": "Judith Good",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090405",
      "orcid": "missing"
    },
    {
      "name": "Christopher Frauenberger",
      "institution": "Vienna University of Technology & University of Sussex, Vienna, Austria",
      "img": "/do/10.1145/contrib-81100559491/rel-imgonly/greenme.jpg",
      "acmid": "81100559491",
      "orcid": "0000-0003-0204-881X"
    }
  ],
  "references": [
    {
      "text": "Laura Benton, Hilary Johnson, Emma Ashwin, Mark Brosnan, and Beate Grawemeyer. 2012. Developing IDEAS: Supporting Children with Autism Within a Participatory Design Team. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2599--2608.  ",
      "doi": "10.1145/2207676.2208650"
    },
    {
      "text": "Claus Bossen, Christian Dindler, and Ole Sejer Iversen. 2016. Evaluation in Participatory Design: A Literature Survey. In Proceedings of the 14th Participatory Design Conference: Full Papers - Volume 1 (PDC '16). ACM, New York, NY, USA, 151--160.  ",
      "doi": "10.1145/2940299.2940303"
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 2012. Disentangling power and decision-making in participatory design. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1 (PDC '12). ACM, Roskilde, Denmark, 41--50.  ",
      "doi": "10.1145/2347635.2347642"
    },
    {
      "text": "Sharon Brisolara. 1998. The history of participatory evaluation and current debates in the field. New Directions for Evaluation 1998, 80 (1998), 25--41.",
      "doi": ""
    },
    {
      "text": "Alison Clark*. 2005. Listening to and involving young children: a review of research and practice. Early Child Development and Care 175, 6 (2005), 489--505.",
      "doi": ""
    },
    {
      "text": "Bill Cooke and Uma Kothari. 2001. Participation: The new Tyranny? Zed Books, London, UK.",
      "doi": ""
    },
    {
      "text": "J. Bradley Cousins and Elizabeth Whitmore. 1998. Framing participatory evaluation. New Directions for Evaluation 1998, 80 (1998), 5--23.",
      "doi": ""
    },
    {
      "text": "Nick S. Dalton. 2013. Neurodiversity HCI. interactions 20, 2 (March 2013), 72--75.  ",
      "doi": "10.1145/2427076.2427091"
    },
    {
      "text": "Hanne De Jaegher. 2013. Embodiment and sense-making in autism. Frontiers in Integrative Neuroscience 7 (2013), 15.",
      "doi": ""
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2007. Fictional Inquiry Design collaboration in a shared narrative space. CoDesign 3, 4 (Dec. 2007), 213--234.",
      "doi": ""
    },
    {
      "text": "Sue Dockett, Sarah Main, and Lynda Kelly. 2011. Consulting Young Children: Experiences from a Museum. Visitor Studies 14, 1 (April 2011), 13--33.",
      "doi": ""
    },
    {
      "text": "Allison Druin. 2002. The Role of Children in the Design of New Technology. Behaviour and Information Technology 21, 1 (2002), 1--25. http://hcil.cs.umd.edu/trs/99--23/99--23.html",
      "doi": ""
    },
    {
      "text": "Johanna Einarsdottir. 2005. Playschool in pictures: children's photographs as a research method. Early Child Development and Care 175, 6 (2005), 523--541.",
      "doi": ""
    },
    {
      "text": "Marc Fakhoury. 2015. Autistic spectrum disorders: A review of clinical features, theories and diagnosis. International Journal of Developmental Neuroscience 43 (June 2015), 70--77.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Judith Good, Alyssa Alcorn, and Helen Pain. 2013. Conversing Through and About Technologies: Design Critique as an Opportunity to Engage Children with Autism and Broaden Research(er) Perspectives. International Journal of Child-Computer Interaction 1, 2 (May 2013), 38--49.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Judith Good, and Wendy Keay-Bright. 2010. Phenomenology, a framework for participatory design. In Proceedings of the 11th Biennial Participatory Design Conference. ACM, ACM, Sydney, Australia, 187--190.  ",
      "doi": "10.1145/1900441.1900474"
    },
    {
      "text": "Christopher Frauenberger, Julia Makhaeva, and Katta Spiel. 2016. Designing Smart Objects with Autistic Children: Four Design Exposès. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 130--139. ",
      "doi": "10.1145/2858036.2858050"
    },
    {
      "text": "Christopher Frauenberger and Irene Posch. 2014. Exploring Future Technologies Through Digital Fabrication With Autistic Children. In Participatory Design in Digital Fabrication workshop at FabLearn'14. FabLearn'14, Stanford, CA, USA, Article 1, 4 pages. http://outsidethebox.at/files/fabwithasd.pdf",
      "doi": ""
    },
    {
      "text": "Gila B. Garaway. 1995. Participatory evaluation. Studies in Educational Evaluation 21, 1 (1995), 85--102.",
      "doi": ""
    },
    {
      "text": "Egon G. Guba and Yvonna S. Lincoln. 1994. Competing Paradigms in Qualitative Research. In Handbook of qualitative research, Norman K. Denzin and Yvonna S. Lincoln (Eds.). Sage Publications, Inc., London, UK, 105--117.",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with Computers 23 (2011), 385--392.  ",
      "doi": "10.1016/j.intcom.2011.03.005"
    },
    {
      "text": "Gillian R. Hayes. 2011. The Relationship of Action Research to Human-computer Interaction. ACM Transactions on Computer-Human Interaction 18, 3 (2011), 15:1--15:20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "K. Holtzblatt and S. Jones. 1993. Contextual inquiry: A participatory technique for system design. In Participatory design: Principles and practice. Erlbaum, Hillsdale, NJ, USA, 180--193.",
      "doi": ""
    },
    {
      "text": "Christopher Jarrold. 2003. A Review of Research into Pretend Play in Autism. Autism 7, 4 (2003), 379--390.",
      "doi": ""
    },
    {
      "text": "Jane Jorgenson and Tracy Sullivan. 2009. Accessing Children's Perspectives Through Participatory Photo Interviews. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 11, 1 (2009), Art. 8. http://www.qualitative-research.net/index.php/fqs/ article/view/447",
      "doi": ""
    },
    {
      "text": "Wendy E. Keay-Bright. 2007. The Reactive Colours Project: Demonstrating Participatory and Collaborative Design Methods for the Creation of Software for Autistic Children. Digital Creativity 1, 2 (2007), 7--16. http://ijg.cgpublisher.com/product/pub.154/prod.17",
      "doi": ""
    },
    {
      "text": "Lorcan Kenny, Caroline Hattersley, Bonnie Molins, Carole Buckley, Carol Povey, and Elizabeth Pellicano. 2015. Which terms should be used to describe autism? Perspectives from the UK autism community. Autism 20, 4 (July 2015), 1362361315588200.",
      "doi": ""
    },
    {
      "text": "Julie A. Kientz, Matthew S. Goodwin, Gillian R. Hayes, and Gregory D. Abowd. 2013. Interactive Technologies for Autism. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 2, 2 (2013), 1--177. ",
      "doi": "10.5555/2613712"
    },
    {
      "text": "Mike Kuniavsky. 2007. Magic as a Metaphor for Ubiquitous Computing. Ambidextrous Magazine Spring (2007), 36--37.",
      "doi": ""
    },
    {
      "text": "Diana Kusunoki and Aleksandra Sarcevic. 2012. Applying Participatory Design Theory to Designing Evaluation Methods. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1895--1900.  ",
      "doi": "10.1145/2212776.2223725"
    },
    {
      "text": "Diana S. Kusunoki and Aleksandra Sarcevic. 2013. A Participatory Framework for Evaluation Design. In iConference 2013 Proceedings. iSchools, Fort Worth, Texas, 860--864.",
      "doi": ""
    },
    {
      "text": "Julia Makhaeva, Christopher Frauenberger, and Katta Spiel. 2016. Creating Creative Spaces for Co-designing with Autistic Children: The Concept of a \"Handlungsspielraum\". In Proceedings of the 14th Participatory Design Conference: Full Papers - Volume 1 (PDC '16). ACM, New York, NY, USA, 51--60. ",
      "doi": "10.1145/2940299.2940306"
    },
    {
      "text": "Laura Malinverni, Joan Mora-Guiard, and Narcis Pares. 2016. Towards methods for evaluating and communicating participatory design: A multimodal approach. International Journal of Human-Computer Studies 94 (2016), 53 -- 63.  ",
      "doi": "10.1016/j.ijhcs.2016.03.004"
    },
    {
      "text": "Laura Malinverni, Joan MoraGuiard, Vanesa Padillo, MariaAngeles Mairena, Amaia Hervás, and Narcis Pares. 2014. Participatory Design Strategies to Enhance the Creative Contribution of Children with Special Needs. In Proceedings of the 2014 Conference on Interaction Design and Children (IDC '14). ACM, New York, NY, USA, 85--94.  ",
      "doi": "10.1145/2593968.2593981"
    },
    {
      "text": "CDC/ATSDR Committee on Community Engagement. 2011/Accessed July 14, 2016. Principles of Community Engagement. (2011/Accessed July 14, 2016). https://www.atsdr.cdc.gov/communityengagement/",
      "doi": ""
    },
    {
      "text": "Narcis Pares, Paul Masri, Gerard van Wolferen, and Chris Creed. 2005. Achieving dialogue with children with severe autism in an adaptive multisensory interaction: the \"MEDIATE\" project. IEEE Transactions on Visualization and Computer Graphics 11, 6 (Nov. 2005), 734--743.  ",
      "doi": "10.1109/TVCG.2005.88"
    },
    {
      "text": "Susi Ross, Magnus Ramage, and Yvonne Rogers. 1995. PETRA: participatory evaluation through redesign and analysis. Interacting with Computers 7, 4 (1995), 335--360.",
      "doi": ""
    },
    {
      "text": "Ginny Russell, Stephan Collishaw, Jean Golding, Susan E Kelly, and Tamsin Ford. 2015. Changes in diagnosis rates and behavioural traits of autism spectrum disorder over time. British Journal of Psychiatry Open 1, 2 (2015), 110--115.",
      "doi": ""
    },
    {
      "text": "Steve Sato and Tony Salvador. 1999. Methods & Tools: Playacting and Focus Troupes:: Theater Techniques for Creating Quick, Intense, Immersive, and Engaging Focus Group Sessions. interactions 6, 5 (Sept. 1999), 35--41.  ",
      "doi": "10.1145/312683.312715"
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Geraldine Fitzpatrick, and Eva Hornecker. 2017. When Empathy Is Not Enough:Assessing the Experiences of Autistic Children withTechnologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17). ACM, New York, NY, USA, tbd. ",
      "doi": "10.1145/3025453.3025785"
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Julia Makhaeva, and Fares Kayali. 2016. Talking about Myself - Playful Inquiry into an Absent Life World. In Workshop on Games as HCI Method at CHI'16. ., San Jose, USA, Article 0, 4 pages.",
      "doi": ""
    },
    {
      "text": "Jean Lee Tan, Dion Hoe-Lian Goh, Rebecca P. Ang, and Vivien S. Huan. 2013. Participatory evaluation of an educational game for social skills acquisition. Computers & Education 64 (2013), 70--80.  ",
      "doi": "10.1016/j.compedu.2013.01.006"
    },
    {
      "text": "Giasemi Vavoula and Mike Sharples. 2007. Future technology workshop: A collaborative method for the design of new learning technologies and activities. International Journal of Computer-Supported Collaborative Learning 2, 4 (2007), 393--419.",
      "doi": ""
    }
  ]
}