{
  "doi": "10.1145/3025453.3025627",
  "title": "Providing Online Crisis Information: An Analysis of Official Sources during the 2014 Carlton Complex Wildfire",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3151-3162",
  "year": 2017,
  "badges": [],
  "abstract": "Using the 2014 Carlton Complex Wildfire as a case study, we examine who contributes official information online during a crisis event, and the timeliness and relevance of the information provided. We identify and describe the communication behaviors of four types of official information sources (Event Based Resources, Local Responders, Local News Media, and Cooperating Agencies), and collect message data from each source's website, public Facebook page, and/or Twitter account. The data show that the Local News Media provided the highest quantity of relevant information and the timeliest information. Event Based Resources shared the highest percentage of relevant information, however, it was often unclear who managed these resources and the credibility of the information. Based on these findings, we offer suggestions for how providers of official crisis information might better manage their online communications and ways that the public can find more timely and relevant online crisis information from official sources.",
  "tags": [
    "wildfire",
    "risk communication",
    "crisis informatics",
    "social media",
    "social computing"
  ],
  "authors": [
    {
      "name": "Apoorva Chauhan",
      "institution": "Utah State University, Logan, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160878",
      "orcid": "missing"
    },
    {
      "name": "Amanda L. Hughes",
      "institution": "Utah State University, Logan, UT, USA",
      "img": "/do/10.1145/contrib-81413602846/rel-imgonly/81413602846.jpg",
      "acmid": "81413602846",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cynthia Andrews, Elodie Fichet, Yuwei Ding, Emma S. Spiro, and Kate Starbird. 2016. Keeping Up with the Tweet-dashians: The Impact of \"Official\" Accounts on Online Rumoring. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), 452--465.  ",
      "doi": "10.1145/2818048.2819986"
    },
    {
      "text": "Lucinda Austin, Brooke Fisher Liu, and Yan Jin. 2012. How Audiences Seek Out Crisis Information: Exploring the Social-Mediated Crisis Communication Model. Journal of Applied Communication Research 40, 2: 188--207. ",
      "doi": ""
    },
    {
      "text": "Rowena L. Briones, Beth Kuch, Brooke Fisher Liu, and Yan Yin. 2011. Keeping Up with the Digital Age: How the American Red Cross uses Social Media to Build Relationships. Public Relations Review 37, 1: 37--43. ",
      "doi": ""
    },
    {
      "text": "Michael Crutcher and Matthew Zook. 2009. Placemarks and Waterlines: Racialized Cyberscapes in Post-Katrina Google Earth. Geoforum 40: 523--534. ",
      "doi": ""
    },
    {
      "text": "Shideh Dashti, Leysia Palen, Mehdi P Heris, Kenneth M Anderson, Scott Anderson, and Jennings Anderson. 2014. Supporting Disaster Reconnaissance with Social Media Data: A Design-Oriented Case Study of the 2013 Colorado Floods. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 20014).",
      "doi": ""
    },
    {
      "text": "Sebastian Denef, Petra S. Bayerl, and Nico Kaptein. 2013. Social Media and the Police-Tweeting Practices of British Police Forces during the August 2011 Riots. In Proceedings of the 2013 Conference on Human Factors in Computing Systems (CHI 2013), 3471-- 3480.",
      "doi": ""
    },
    {
      "text": "Gazette-Tribune. 2014. State Federal Delegation Backs Inslee's Request for Major Disaster Declaration. Okanogan Valley Gazette-Tribune. Retrieved April 27, 2016 from http://www.gazette-tribune.com/news/statefederal-delegation-backs-inslees-request-for-majordisaster-declaration/68353/",
      "doi": ""
    },
    {
      "text": "Chris Hagar and Caroline Haythornthwaite. 2005. Crisis, Farming & Community. The Journal of Community Informatics 1, 3: 41--52.",
      "doi": ""
    },
    {
      "text": "Y. Linlin Huang, Kate Starbird, Mania Orand, Stephanie A. Stanek, and Heather T. Pedersen. 2015. Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 969--980.  ",
      "doi": "10.1145/2675133.2675202"
    },
    {
      "text": "Amanda L. Hughes and Apoorva Chauhan. 2015. Online Media as a Means to Affect Public Trust in Emergency Responders. In Proceedings of the 2015 Information Systems for Crisis Response and Management Conference (ISCRAM 2015).",
      "doi": ""
    },
    {
      "text": "Amanda L. Hughes and Leysia Palen. 2012. The Evolving Role of the Public Information Officer: An Examination of Social Media in Emergency Management. Journal of Homeland Security and Emergency Management 9, 1. ",
      "doi": ""
    },
    {
      "text": "Amanda L. Hughes, Leysia Palen, Jeannette Sutton, Sophia B. Liu, and Sarah Vieweg. 2008. \"Site-Seeing \" in Disaster: An Examination of On-Line Social Convergence. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 2008).",
      "doi": ""
    },
    {
      "text": "Amanda L. Hughes, Lise Ann St. Denis, Leysia Palen, and Kenneth M. Anderson. 2014. Online Public Communications by Police & Fire Services during the 2012 Hurricane Sandy. In Proceedings of the 2014 International Conference on Human Factors in Computing Systems (CHI 2014), 1505--1514.  ",
      "doi": "10.1145/2556288.2557227"
    },
    {
      "text": "Muhammad Imran, Carlos Castillo, Fernando Diaz, and Sarah Vieweg. 2015. Processing Social Media Messages in Mass Emergency: A Survey. ACM Comput. Surv. 47, 4: 67:1--67:38.",
      "doi": ""
    },
    {
      "text": "Mark Latonero and Irina Shklovski. 2011. Emergency Management, Twitter, and Social Media Evangelism. International Journal of Information Systems for Crisis Response and Management 3, 4: 1--16. ",
      "doi": ""
    },
    {
      "text": "Michael K. Lindell and Ronald W. Perry. 1987. Warning Mechanisms in Emergency Response Systems. Iternational Journal of Mass Emergencies and Disasters 5, 2: 137--153.",
      "doi": ""
    },
    {
      "text": "Michael K. Lindell and Ronald W. Perry. 2004. Communicating Environmental Risk in Multiethnic Communities. SAGE Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Michelle McNiel. 2014. Cost of Fighting Carlton Complex Hits $60 million; 322 Homes Destroyed. Retrieved May 27, 2016 from http://www.wenatcheeworld.com/news/2014/aug/07/ca rlton-complex-now-cost-60-million-and-destroyednearly-500-structures/",
      "doi": ""
    },
    {
      "text": "Dennis S. Mileti and Colleen Fitzpatrick. 1992. The Causal Sequence of Risk Communication in the Parkfield Earthquake Prediction Experiment. Risk Analysis 12, 3: 393--400. ",
      "doi": ""
    },
    {
      "text": "Dhiraj Murthy. 2013. New Media and Natural Disasters: Blogs and the 2004 Indian Ocean Tsunami. Information, Communication & Society 16, 7: 1176-- 1192. ",
      "doi": ""
    },
    {
      "text": "Leysia Palen and Sophia B. Liu. 2007. Citizen Communications in Crisis: Anticipating a Future of ICT-supported Public Participation. In Proceedings of the 2007 Conference on Human Factors in Computing Systems (CHI 2007), 727--736.  ",
      "doi": "10.1145/1240624.1240736"
    },
    {
      "text": "Leysia Palen and Sarah Vieweg. 2008. The Emergence of Online Widescale Interaction in Unexpected Events. In 2008 ACM Proceedings of Computer Supported Cooperative Work Conference, 117--126.  ",
      "doi": "10.1145/1460563.1460583"
    },
    {
      "text": "Leysia Palen, Sarah Vieweg, Sophia B. Liu, and Amanda L. Hughes. 2009. Crisis in a Networked World. Social Science Computing Review 27, 4: 467-- 480.  ",
      "doi": "10.1177/0894439309332302"
    },
    {
      "text": "Laura E. Pechta, Dale C. Brandenburg, and Matthew W. Seeger. 2010. Understanding the Dynamics of Emergency Communication: Propositions for a FourChannel Model. Journal of Homeland Security and Emergency Management 7, 1. ",
      "doi": ""
    },
    {
      "text": "Sung-Yueh Perng, Monika Büscher, Ragnhild Halvorsrud, Lisa Wood, Michael Stiso, Leonardo Ramirez, and Amro Al-Akkad. 2012. Peripheral Response: Microblogging During the 22/7/2011 Norway Attacks. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 2012).",
      "doi": ""
    },
    {
      "text": "Linda Plotnick, Starr Roxanne Hiltz, Jane A. Kushma, and Andrea H. Tapia. 2015. Red Tape: Attitudes and Issues Related to Use of Social Media by U.S. CountyLevel Emergency Managers. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 20015).",
      "doi": ""
    },
    {
      "text": "Tobias Preis, Helen Susannah Moat, Steven R. Bishop, Philip Treleaven, and H. Eugene Stanley. 2013. Quantifying the Digital Traces of Hurricane Sandy on Flickr. Scientific Reports 3. ",
      "doi": ""
    },
    {
      "text": "Yan Qu, Philip Fei Wu, and Xiaoqing Wang. 2009. Online Community Response to Major Disaster: A Study of Tianya Forum in the 2008 Sichuan Earthquake. In Proceedings of the 2009 Hawaii International Conference on System Sciences (HICSS 2009), 1--11.",
      "doi": ""
    },
    {
      "text": "Barbara Reynolds and Matthew W. Seeger. 2005. Crisis and Emergency Risk Communication as an Integrative Model. Journal of Health Communication 10, 1: 43--55. ",
      "doi": ""
    },
    {
      "text": "Irina Shklovski, Moira Burke, Sara Kiesler, and Robert Kraut. 2010. Technology Adoption and Use in the Aftermath of Hurricane Katrina in New Orleans. American Behavioral Scientist 53, 8: 1228--1246. ",
      "doi": ""
    },
    {
      "text": "Irina Shklovski, Leysia Palen, and Jeannette Sutton. 2008. Finding Community through Information and Communication Technology in Disaster Response. In Proceedings of the 2008 Conference on Computer Supported Cooperative Work (CSCW 2008), 127--136.  ",
      "doi": "10.1145/1460563.1460584"
    },
    {
      "text": "John H. Sorensen and Barbara V. Sorensen. 2007. Community Processes: Warning and Evacuation. In Handbook of Disaster Research, Havidan Rodriguez, Enrico L. Quarantelli and Russell R. Dynes (eds.). Springer New York, New York, NY, 183--199.",
      "doi": ""
    },
    {
      "text": "Lise Ann St. Denis, Amanda L. Hughes, and Leysia Palen. 2012. Trial by Fire: The Deployment of Trusted Digital Volunteers in the 2011 Shadow Lake Fire. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 2012).",
      "doi": ""
    },
    {
      "text": "Seattle Times Staff. 2014. Crews Plan Controlled Burn Near Carlton Complex Wildfire. The Seattle Times. Retrieved April 19, 2016 from http://www.seattletimes.com/seattle-news/crews-plancontrolled-burn-near-carlton-complex-wildfire/",
      "doi": ""
    },
    {
      "text": "Robert A. Stallings. 2007. Methodological Issues. In Handbook of Disaster Research, Havidán Rodríguez, Enrico L. Quarantelli and Russell R. Dynes (eds.). Springer New York, New York, NY, 55--82. ",
      "doi": ""
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2011. \"Voluntweeters:\" Self-Organizing by Digital Volunteers in Times of Crisis. In Proceedings of the 2011 Conference on Human Factors in Computing Systems (CHI 2011), 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Kate Starbird, Leysia Palen, Amanda L. Hughes, and Sarah Vieweg. 2010. Chatter on the Red: What Hazards Threat Reveals about the Social Life of Microblogged Information. In Proceedings of the ACM 2010 Conference on Computer Supported Cooperative Work (CSCW 2010), 241--250.  ",
      "doi": "10.1145/1718918.1718965"
    },
    {
      "text": "Geoffrey Stockdale and Rahul Sood. 1989. Emergency Public Information: A Quick Response Study of Coalinga. Natural Hazards Research and Applications Information Center, Institute of Behavioral Science, University of Colorado at Boulder.",
      "doi": ""
    },
    {
      "text": "Jeannette N. Sutton. 2009. Social Media Monitoring and the Democratic National Convention: New Tasks and Emergent Processes. Journal of Homeland Security and Emergency Management 6, 1. ",
      "doi": ""
    },
    {
      "text": "Jeannette N. Sutton, Leysia Palen, and Irina Shklovski. 2008. Backchannels on the Front Lines: Emergent Use of Social Media in the 2007 Southern California Fires. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 2008).",
      "doi": ""
    },
    {
      "text": "Jeannette N. Sutton, Emma Spiro, Carter Butts, Sean Fitzhugh, Britta Johnson, and Matt Greczek. 2013. Tweeting the Spill: Online Informal Communications, Social Networks, and Conversational Microstructures during the Deepwater Horizon Oilspill. International Journal of Information Systems for Crisis Response and Management 5, 1: 58--76. ",
      "doi": ""
    },
    {
      "text": "Jeannette N. Sutton, Emma Spiro, Sean Fitzhugh, Britta Johnson, Ben Gibson, and Carter T. Butts. 2014. Online Message Amplification in the Boston Bombing Response. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 20014).",
      "doi": ""
    },
    {
      "text": "Jeannette N. Sutton, Emma S. Spiro, Sean Fitzhugh, Britta Johnson, Ben Gibson, and Carter T. Butts. 2014. Terse Message Amplification in the Boston Bombing Response. In Proceedings of the Information Systems for Crisis Response and Management Conference (ISCRAM 2014).",
      "doi": ""
    },
    {
      "text": "Kathleen J. Tierney, Michael K. Lindell, and Ronald W. Perry. 2001. Facing the Unexpected: Disaster Preparedness and Response in the United States. John Henry Press, Washington D.C.",
      "doi": ""
    },
    {
      "text": "United Nations Secretariat of the International Strategy for Disaster Reduction (UNISDR). 2010. Early Warning Practices can Save Many Lives: Good Practices and Lessons Learned. Bonn, Germany. Retrieved from http://www.unisdr.org/files/15254_EWSBBLLfinalwe b.pdf",
      "doi": ""
    },
    {
      "text": "US Forest Service. 2014. Carlton Complex Fire Perimeter Map August 20, 2014. Retrieved from http://inciweb.nwcg.gov/incident/map/3967/1/39520/",
      "doi": ""
    },
    {
      "text": "US Forest Service. 2014. Carlton Complex Wildfire: Incident Overview. Retrieved from http://inciweb.nwcg.gov/incident/3967/",
      "doi": ""
    },
    {
      "text": "US Forest Service. 2014. Carlton Complex Wildfire: Fire Update 8--24--14. Retrieved from http://inciweb.nwcg.gov/incident/article/3967/24094/",
      "doi": ""
    },
    {
      "text": "Ricardo J. Wray, Jennifer Rivers, Amanda Whitworth, and Keri Jupka. 2006. Public Perceptions About Trust in Emergency Risk Communication: Qualitative Research Findings. International Journal of Mass Emergencies and Disasters 24, 1: 45--75.",
      "doi": ""
    },
    {
      "text": "InciWeb: 8/1/14 Evacuation Update 8pm. Retrieved August 18, 2016 from http://inciweb.nwcg.gov/incident/article/3967/22887/",
      "doi": ""
    },
    {
      "text": "InciWeb: 8/3/14 Carlton Complex 9am Update. Retrieved August 18, 2016 from http://inciweb.nwcg.gov/incident/article/3967/22956/",
      "doi": ""
    }
  ]
}