{
  "doi": "10.1145/3025453.3025550",
  "title": "Community Commerce: Facilitating Trust in Mom-to-Mom Sale Groups on Facebook",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4344-4357",
  "year": 2017,
  "badges": [],
  "abstract": "Consumers are turning to Facebook Groups to buy and sell with strangers in their local communities. This trend is counter-intuitive given Facebook's lack of conventional e-commerce features, such as sophisticated search engines and reputation systems. We interviewed 18 members of two Mom-to-Mom Facebook sale groups. Despite a lack of commerce tools, members perceived sale groups as an easy-to-use way to quickly and conveniently buy and sell. Most important to members was that the groups felt safe and trustworthy. Drawing on these insights, we contribute a novel framing, community commerce, which explains the trust mechanisms that enable transactions between strangers in some groups. Community commerce fosters trust through (a) exclusive membership to a closed group, (b) regulation and sanctioning of behavior at the admin, member, and group level, and (c) a shared group identity or perceived similarity (though, surprisingly, not through social bonding). We discuss how community commerce affords unique and sometimes superior trust assurances and propose design implications for platforms hoping to foster trust between members who buy, sell, or share amongst themselves.",
  "authors": [
    {
      "name": "Carol Moser",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-99659021889/rel-imgonly/carolmoser_bw.png",
      "acmid": "99659021889",
      "orcid": "missing"
    },
    {
      "name": "Paul Resnick",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100225915/rel-imgonly/resnick_paul_5x7.jpeg",
      "acmid": "81100225915",
      "orcid": "missing"
    },
    {
      "name": "Sarita Schoenebeck",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658750237",
      "orcid": "0000-0002-8688-1595"
    }
  ],
  "references": [
    {
      "text": "Mallory Anderson. Are Facebook Groups the new rummage sale? Retrieved August 24, 2016 from http://www.uppermichiganssource.com/content/news/Are-Facebook-Groups-the-new-rummage-sale-390362572.html",
      "doi": ""
    },
    {
      "text": "J. Benamati, M. A. Benamati, M. A. Serva, and J. Baroudi. 2010. Clarifying the Integration of Trust and TAM in ECommerce Environments: Implications for Systems Design and Management. IEEE Transactions on Engineering Management 57, 3: 380--393.",
      "doi": ""
    },
    {
      "text": "Katie Benner. 2016. Airbnb Adopts Rules to Fight Discrimination by Its Hosts. The NY Times. Retrieved September 11, 2016 from http://www.nytimes.com/2016/09/09/technology/airbnb-anti-discrimination-rules.html",
      "doi": ""
    },
    {
      "text": "Jacquie Goetz Bluethman. 2016. Secrets of \"the swap\": Buy, sell and save on maternity and baby gear through online swaps. Metro Parent's Pink+Blue Magazine 5, 72--74.",
      "doi": ""
    },
    {
      "text": "Lex Borghans, Bart H. H. Golsteyn, James J. Heckman, and Huub Meijers. 2009. Gender Differences in Risk Aversion and Ambiguity Aversion. Journal of the European Economic Association 7, 2/3: 649--658.",
      "doi": ""
    },
    {
      "text": "Julie Bort. Craigslist Slammed On National TV For Selling Dangerous Recalled Products. Business Insider. Retrieved September 7, 2016 from http://www.businessinsider.com/craigslist-slammed-on-national-tv-for-selling-dangerous-recalled-products-2014-11",
      "doi": ""
    },
    {
      "text": "Rachel Botsman and Roo Rogers. 2010. What's Mine Is Yours: The Rise of Collaborative Consumption. Harper Collins.",
      "doi": ""
    },
    {
      "text": "Josh Boyd. 2002. In Community We Trust: Online Security Communication at eBay. Journal of ComputerMediated Communication 7, 3: 0--0.",
      "doi": ""
    },
    {
      "text": "Jin Chen, Cheng Zhang, and Yunjie Xu. 2009. The Role of Mutual Trust in Building Members' Loyalty to a C2C Platform Provider. International Journal of Electronic Commerce 14, 1: 147--171.  ",
      "doi": "10.2753/JEC1086-4415140105"
    },
    {
      "text": "C. E. H. Chua and J. Wareham. 2004. Fighting Internet auction fraud: an assessment and proposal. Computer 37, 10: 31--37.  ",
      "doi": "10.1109/MC.2004.165"
    },
    {
      "text": "James S. Coleman. 1994. Foundations of Social Theory. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Corritore, Susan Wiedenbeck, and Beverly Kracher. 2001. The Elements of Online Trust. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01), 504--505.  ",
      "doi": "10.1145/634067.634355"
    },
    {
      "text": "Kandiss Crone. 2016. Craigslist tip leads to loads of stolen goods. 10News. Retrieved September 7, 2016 from http://www.10news.com/news/craigslist-tip-leads-to-loads-of-stolen-goods-071216",
      "doi": ""
    },
    {
      "text": "Cudjoe Dan. 2014. Consumer-To-Consumer (C2C) Electronic Commerce: The Recent Picture. International Journal of Networks and Communication 4, 2: 29--32.",
      "doi": ""
    },
    {
      "text": "Shay David and Trevor John Pinch. 2005. Six degrees of reputation: The use and abuse of online review and recommendation systems. Available at SSRN 857505. Retrieved March 11, 2016 from http://papers.ssrn.com.proxy.lib.umich.edu/sol3/papers.cfm?abstract_id=857505",
      "doi": ""
    },
    {
      "text": "Chrysanthos Dellarocas. 2003. The Digitization of Word of Mouth: Promise and Challenges of Online Feedback Mechanisms. Management Science 49, 10: 1407--1424.  ",
      "doi": "10.1287/mnsc.49.10.1407.17308"
    },
    {
      "text": "Catherine C. Eckel and Philip J. Grossman. 2008. Men, Women and Risk Aversion: Experimental Evidence. In Handbook of Experimental Economics Results, Charles R. Plott and Vernon L. Smith (ed.). Elsevier, 1061--1073.",
      "doi": ""
    },
    {
      "text": "Benjamin G. Edelman, Michael Luca, and Dan Svirsky. 2016. Racial Discrimination in the Sharing Economy: Evidence from a Field Experiment. Social Science Research Network, Rochester, NY. Retrieved September 11, 2016 from http://papers.ssrn.com.proxy.lib.umich.edu/abstract=270",
      "doi": ""
    },
    {
      "text": "Florian N. Egger. 2000. \"Trust Me, I'M an Online Vendor\": Towards a Model of Trust for e-Commerce System Design. In CHI '00 Extended Abstracts on Human Factors in Computing Systems (CHI EA '00), 101--102.  ",
      "doi": "10.1145/633292.633352"
    },
    {
      "text": "Max Ernest-Jones, Daniel Nettle, and Melissa Bateson. 2011. Effects of eye images on everyday cooperative behavior: a field experiment. Evolution and Human Behavior 32, 3: 172--178.",
      "doi": ""
    },
    {
      "text": "Eyal Ert, Aliza Fleischer, and Nathan Magen. 2016. Trust and reputation in the sharing economy: The role of personal photos in Airbnb. Tourism Management 55: 62--73.",
      "doi": ""
    },
    {
      "text": "Facebook Newsroom. Products | Facebook Newsroom. Facebook Newsroom. Retrieved February 22, 2016 from https://newsroom.fb.com/products/",
      "doi": ""
    },
    {
      "text": "Alan Feingold. 1994. Gender differences in personality: A meta-analysis. Psychological Bulletin 116, 3: 429--456.",
      "doi": ""
    },
    {
      "text": "J. Fleiss. 1981. Statistical Methods for Rates and Proportions.",
      "doi": ""
    },
    {
      "text": "Ellen Garbarino and Michal Strahilevitz. 2004. Gender differences in the perceived risk of buying online and the effects of receiving a site recommendation. Journal of Business Research 57, 7: 768--775.",
      "doi": ""
    },
    {
      "text": "V. Garg and S. Niliadeh. 2013. Craigslist Scams and Community Composition: Investigating Online Fraud Victimization. In 2013 IEEE Security and Privacy Workshops (SPW), 123--126.  ",
      "doi": "10.1109/SPW.2013.21"
    },
    {
      "text": "David Gefen, Elena Karahanna, and Detmar W. Straub. 2003. Trust and TAM in Online Shopping: An Integrated Model. MIS Q. 27, 1: 51--90. ",
      "doi": "10.5555/2017181.2017185"
    },
    {
      "text": "Jennifer Golbeck. 2009. Trust and Nuanced Profile Similarity in Online Social Networks. ACM Trans. Web 3, 4: 12:1--12:33.  ",
      "doi": "10.1145/1594173.1594174"
    },
    {
      "text": "Anthony Griffin and Dennis Viehland. 2012. Demographic Factors in Assessing Perceived Risk in Online Shopping. In Proceedings of the 13th International Conference on Electronic Commerce (ICEC '11), 9:1--9:6.  ",
      "doi": "10.1145/2378104.2378113"
    },
    {
      "text": "Gayle Guyardo. 2016. Bay area moms finding deals and steals on Facebook | WFLA.com. Retrieved August 24, 2016 from http://wfla.com/2016/03/29/bay-area-moms-finding-deals-and-steals-on-facebook/",
      "doi": ""
    },
    {
      "text": "Michael A. Hogg. 1992. The social psychology of group cohesiveness: from attraction to social identity. Harvester Wheatsheaf.",
      "doi": ""
    },
    {
      "text": "Jacob Jacoby and Leon B. Kaplan. 1972. The Components of Perceived Risk. SV - Proceedings of the Third Annual Conference of the Association for Consumer Research. Retrieved September 4, 2016 from http://acrwebsite.org/volumes/12016/volumes/sv02/SV02",
      "doi": ""
    },
    {
      "text": "Kiku Jones and Lori N. K. Leonard. 2008. Trust in consumer-to-consumer electronic commerce. Information & Management 45, 2: 88--95.  ",
      "doi": "10.1016/j.im.2007.12.002"
    },
    {
      "text": "Kiku Jones and Lori N. K. Leonard. 2014. Factors Influencing Buyer's Trust in Consumer-to-Consumer E Commmerce. Journal of Computer Information Systems 54, 4: 71--79.",
      "doi": ""
    },
    {
      "text": "Audun Jøsang, Roslan Ismail, and Colin Boyd. 2007. A survey of trust and reputation systems for online service provision. Decision Support Systems 43, 2: 618--644.  ",
      "doi": "10.1016/j.dss.2005.05.019"
    },
    {
      "text": "Florian Kerschbaum. 2009. A Verifiable, Centralized, Coercion-free Reputation System. In Proceedings of the 8th ACM Workshop on Privacy in the Electronic Society (WPES '09), 61--70.  ",
      "doi": "10.1145/1655188.1655197"
    },
    {
      "text": "Sara Kiesler, Robert E. Kraut, Paul Resnick, and Aniket Kittur. 2012. Regulating Behavior in Online Communities. In Building Successful Online Communities: Evidence-Based Social Design. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Robert V. Kozinets. 2010. Netnography: ethnographic research in the age of the internet. Sage Publications Ltd, Thousand Oaks, CA. ",
      "doi": "10.5555/1823232"
    },
    {
      "text": "Airi Lampinen, Victoria Bellotti, Andrés MonroyHernández, Coye Cheshire, and Alexandra Samuel. 2015. Studying the \"Sharing Economy\": Perspectives to Peer-to-Peer Exchange. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing (CSCW'15 Companion), 117--121.  ",
      "doi": "10.1145/2685553.2699339"
    },
    {
      "text": "Airi Lampinen and Coye Cheshire. 2016. Hosting via Airbnb: Motivations and Financial Assurances in Monetized Network Hospitality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1669--1680.  ",
      "doi": "10.1145/2858036.2858092"
    },
    {
      "text": "Airi Lampinen, Kai Huotari, and Coye Cheshire. 2015. Challenges to Participation in the Sharing Economy: The Case of Local Online Peer-to-Peer Exchange in a Single Parents' Network. Interaction Design and Architecture (s), special issue on peer-to-peer exchange and the sharing economy 24: 16--32.",
      "doi": ""
    },
    {
      "text": "J. Richard Landis and Gary G. Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1: 159--174.",
      "doi": ""
    },
    {
      "text": "D. Lauterbach, H. Truong, T. Shah, and L. Adamic. 2009. Surfing a Web of Trust: Reputation and Reciprocity on CouchSurfing.com. In International Conference on Computational Science and Engineering, 2009. CSE '09, 346--353.  ",
      "doi": "10.1109/CSE.2009.345"
    },
    {
      "text": "Khai Sheang Lee and Soo Jiuan Tan. 2003. E-retailing versus physical retailing: A theoretical model and empirical test of consumer choice. Journal of Business Research 56, 11: 877--885.",
      "doi": ""
    },
    {
      "text": "Lori N. K. Leonard. 2012. Attitude Influencers in C2C E-Commerce: Buying and Selling. Journal of Computer Information Systems 52, 3: 11--17.",
      "doi": ""
    },
    {
      "text": "Lori N. K. Leonard and Kiku Jones. 2010. Consumer-toConsumer e-Commerce Research in Information Systems Journals. Journal of Internet Commerce 9, 3-4: 186--207.",
      "doi": ""
    },
    {
      "text": "June Lu, Luzhuang Wang, and Linda A. Hayes. 2012. How Do Technology Readiness, Platform Functionality and Trust Influence C2c User Satisfaction? Journal of Electronic Commerce Research 13, 1: 50--69.",
      "doi": ""
    },
    {
      "text": "Lone Malmborg, Ann Light, Geraldine Fitzpatrick, Victoria Bellotti, and Margot Brereton. 2015. Designing for Sharing in Local Communities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 2357--2360.  ",
      "doi": "10.1145/2702613.2702645"
    },
    {
      "text": "D. Harrison McKnight, Vivek Choudhury, and Charles Kacmar. 2002. Developing and Validating Trust Measures for e-Commerce: An Integrative Typology. Information Systems Research 13, 3: 334--359.  ",
      "doi": "10.1287/isre.13.3.334.81"
    },
    {
      "text": "Anthony D. Miyazaki and Ana Fernandez. 2001. Consumer Perceptions of Privacy and Security Risks for Online Shopping. Journal of Consumer Affairs 35, 1: 27--44.",
      "doi": ""
    },
    {
      "text": "F.F.H. Nah and S Davis. 2002. HCI research issues in ecommerce. Journal of Electronic Commerce Research 3, 3: 98--113.",
      "doi": ""
    },
    {
      "text": "Thomas Ngo-Ye. 2013. eBay or Craigslist?: Explaining users' choice of online transaction community. Issues in Information Systems 14, 2.",
      "doi": ""
    },
    {
      "text": "Jo Ann Oravec. 2014. Craigslist in Crisis: Issues of Censorship and Moral Panic in the Context of Online Communities. International Journal of the Academic Business World 8, 2: 1--11.",
      "doi": ""
    },
    {
      "text": "Paul A. Pavlou. 2003. Consumer Acceptance of Electronic Commerce: Integrating Trust and Risk with the Technology Acceptance Model. International Journal of Electronic Commerce 7, 3: 101--134. ",
      "doi": "10.5555/1288216.1288221"
    },
    {
      "text": "Sarah Perez. 2015. Facebook Adds A New Way To Sell Items In Groups. TechCrunch. Retrieved February 21, 2016 from http://social.techcrunch.com/2015/02/10/facebook-adds-a-new-way-to-sell-items-in-groups/",
      "doi": ""
    },
    {
      "text": "Robert D. Putnam. 2001. Bowling Alone: The Collapse and Revival of American Community. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Robert D. Putnam. 2007. E Pluribus Unum: Diversity and Community in the Twenty-first Century The 2006 Johan Skytte Prize Lecture. Scandinavian Political Studies 30, 2: 137--174.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, Robert E. Kraut, Sara Kiesler, and Paul Resnick. 2012. Encouraging Commitment in Online Communities. In Building Successful Online Communities: Evidence-Based Social Design. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, Robert Kraut, and Sara Kiesler. 2007. Applying Common Identity and Bond Theory to Design of Online Communities. Organization Studies 28, 3: 377--408.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, Ko Kuwabara, Richard Zeckhauser, and Eric Friedman. 2000. Reputation Systems. Commun. ACM 43, 12: 45--48.  ",
      "doi": "10.1145/355112.355122"
    },
    {
      "text": "Paul Resnick and Richard J. Zeckhauser. 2002. Trust among strangers in internet transactions: Empirical analysis of ebay's reputation system. In The Economics of the Internet and E-commerce (2nd ed.). Elsevier, 23--25.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, Richard Zeckhauser, John Swanson, and Kate Lockwood. The value of reputation on eBay: A controlled experiment. Experimental Economics 9, 2: 79--101.",
      "doi": ""
    },
    {
      "text": "Howard Rheingold. 2000. The Virtual Community: Homesteading on the Electronic Frontier. The MIT Press, Cambridge, Mass. ",
      "doi": "10.5555/541496"
    },
    {
      "text": "Jens Riegelsberger and M. Angela Sasse. 2002. Face It - Photos Don't Make a Web Site Trustworthy. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02), 742--743.  ",
      "doi": "10.1145/506443.506575"
    },
    {
      "text": "Jens Riegelsberger, M. Angela Sasse, and John D. McCarthy. 2003. Shiny Happy People Building Trust? Photos on e-Commerce Websites and Consumer Trust. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 121--128.  ",
      "doi": "10.1145/642611.642634"
    },
    {
      "text": "Jens Riegelsberger, M. Angela Sasse, and John D. McCarthy. 2005. The mechanics of trust: A framework for research and design. International Journal of Human-Computer Studies 62, 3: 381--422.  ",
      "doi": "10.1016/j.ijhcs.2005.01.001"
    },
    {
      "text": "Jens Riegelsberger and Asimina Vasalou. 2007. Trust 2.1: Advancing the Trust Debate. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07), 2137--2140.  ",
      "doi": "10.1145/1240866.1240967"
    },
    {
      "text": "Denise Christine Rieser and Orlando Bernhard. 2016. Measuring Trust: The Simpler the Better? In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 2940--2946.  ",
      "doi": "10.1145/2851581.2892468"
    },
    {
      "text": "Ted Roselius. 1971. Consumer Rankings of Risk Reduction Methods. Journal of Marketing 35, 1: 56--61.",
      "doi": ""
    },
    {
      "text": "W. Scott Sanders, Gopi Chand Nutakki, and Olfa Nasraoui. 2016. Testing the Application of Warranting Theory to Online Third Party Marketplaces: The Effects of Information Uniqueness and Product Type. In Proceedings of the 7th 2016 International Conference on Social Media & Society (SMSociety '16), 16:1--16:7.  ",
      "doi": "10.1145/2930971.2930988"
    },
    {
      "text": "Johannes Sänger, Norman Hänsch, Brian Glass, Zinaida Benenson, Robert Landwirth, and M. Angela Sasse. 2016. Look Before You Leap: Improving the Users' Ability to Detect Fraud in Electronic Marketplaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 3870--3882.  ",
      "doi": "10.1145/2858036.2858555"
    },
    {
      "text": "Aarti Shahani. 2016. Social Network Nextdoor Moves To Block Racial Profiling Online. NPR.org. Retrieved from http://www.npr.org/sections/alltechconsidered/2016/08/23/490950267/social-network-nextdoor-moves-to-block-racial-profiling-online",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2000. Designing Trust into Online Experiences. Commun. ACM 43, 12: 57--59.  ",
      "doi": "10.1145/355112.355124"
    },
    {
      "text": "Ulrike Steinbrück, Heike Schaumburg, Sabrina Duda, and Thomas Krüger. 2002. A Picture Says More Than a Thousand Words: Photographs As Trust Builders in eCommerce Websites. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02), 748--749.  ",
      "doi": "10.1145/506443.506578"
    },
    {
      "text": "Troy J. Strader and Sridhar N. Ramaswami. 2002. The Value of Seller Trustworthiness in C2C Online Markets. Commun. ACM 45, 12: 45--49.  ",
      "doi": "10.1145/585597.585600"
    },
    {
      "text": "Arun Sundararajan. 2016. The Sharing Economy: The End of Employment and the Rise of Crowd-Based Capitalism. MIT Press. ",
      "doi": "10.5555/3002839"
    },
    {
      "text": "Hung Tran, Thomas Hornbeck, Viet Ha-Thuc, James Cremer, and Padmini Srinivasan. 2011. Spam Detection in Online Classified Advertisements. In Proceedings of the 2011 Joint WICOW/AIRWeb Workshop on Web Quality (WebQuality '11), 35--41.  ",
      "doi": "10.1145/1964114.1964122"
    },
    {
      "text": "John Tulloch and Deborah Lupton. 2003. Risk and Everyday Life. SAGE.",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1996. Computer-Mediated Communication Impersonal, Interpersonal, and Hyperpersonal Interaction. Communication Research 23, 1: 3--43.",
      "doi": ""
    },
    {
      "text": "2007. The Marketplace Is Open | Facebook Newsroom. Retrieved September 1, 2016 from https://www.facebook.com/notes/facebook/the-marketplace-is-open/2383962130/",
      "doi": ""
    },
    {
      "text": "2009. The New Facebook Marketplace Powered by Oodle | Facebook Newsroom. Retrieved September 1, 2016 from https://www.facebook.com/notes/facebook/the-new-facebook-marketplace-powered-by-oodle/57525537130/",
      "doi": ""
    },
    {
      "text": "2015. U.S. Census Bureau QuickFacts: Population estimates, July 1, 2015. Retrieved October 24, 2016 from https://www.census.gov/quickfacts/table/PST045215/1714000",
      "doi": ""
    },
    {
      "text": "2015. Educational Attainment in the United States. U. S. Census Bureau. Retrieved December 16, 2016 from https://www.census.gov/hhes/socdemo/education/data/c ps/2015/tables.html",
      "doi": ""
    },
    {
      "text": "2015. Household Income Distribution to $250,000 or More for Households. U.S. Census Bureau. Retrieved December 16, 2016 from https://www.census.gov/data/tables/timeseries/demo/income-poverty/cps-hinc/hinc-06.html",
      "doi": ""
    },
    {
      "text": "2015. Five Online Sites for Buying Used Baby Gear. GoGirl Finance. Retrieved August 24, 2016 from http://gogirlfinance.com/five-online-sites-for-buyingused-baby-gear/",
      "doi": ""
    },
    {
      "text": "2016. Introducing Marketplace: Buy and Sell with Your Local Community | Facebook Newsroom. Retrieved December 19, 2016 from http://newsroom.fb.com/news/2016/10/introducing-marketplace-buy-and-sell-with-your-local-community/",
      "doi": ""
    },
    {
      "text": "2016. Household Income: 2015. American Community Survey Briefs, U.S. Census Bureau. Retrieved December 16, 2016 from www.census.gov/content/dam/Census/library/publicatio ns/2016/demo/acsbr15-02.pdf",
      "doi": ""
    },
    {
      "text": "How do I know who's seen each post or message in a group? | Facebook Help Center. Retrieved September 13, 2016 from https://www.facebook.com/help/409719555736128?helpref=search",
      "doi": ""
    },
    {
      "text": "Oodle Marketplace. Retrieved September 1, 2016 from http://fb.oodle.com/info/faq/",
      "doi": ""
    }
  ]
}