{
  "doi": "10.1145/3025453.3025777",
  "title": "Finding Similar People to Guide Life Choices: Challenge, Design, and Evaluation",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5498-5544",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "People often seek examples of similar individuals to guide their own life choices. For example, students making academic plans refer to friends; patients refer to acquaintances with similar conditions, physicians mention past cases seen in their practice. How would they want to search for similar people in databases? We discuss the challenge of finding similar people to guide life choices and report on a need analysis based on 13 interviews. Our PeerFinder prototype enables users to find records that are similar to a seed record, using both record attributes and temporal events found in the records. A user study with 18 participants and four experts shows that users are more engaged and more confident about the value of the results to provide useful evidence to guide life choices when provided with more control over the search process and more context for the results, even at the cost of added complexity.",
  "authors": [
    {
      "name": "Fan Du",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658692957",
      "orcid": "0000-0002-4383-8888"
    },
    {
      "name": "Catherine Plaisant",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100041782/rel-imgonly/photo-plaisant.jpg",
      "acmid": "81100041782",
      "orcid": "missing"
    },
    {
      "name": "Neil Spring",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100151523",
      "orcid": "missing"
    },
    {
      "name": "Ben Shneiderman",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100146468/rel-imgonly/shneiderman_2010_032cr2.jpg",
      "acmid": "81100146468",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ragnar Bade, Stefan Schlechtweg, and Silvia Miksch. 2004. Connecting time-oriented data and information to a coherent interactive visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 105--112.  ",
      "doi": "10.1145/985692.985706"
    },
    {
      "text": "Eftychia Baikousi, Georgios Rogkakos, and Panos Vassiliadis. 2011. Similarity measures for multidimensional data. In IEEE International Conference on Data Engineering. 171--182.  ",
      "doi": "10.1109/ICDE.2011.5767869"
    },
    {
      "text": "Brian H Bornstein and A Christine Emler. 2001. Rationality in medical decision making: a review of the literature on doctors? decision-making biases. Journal of Evaluation in Clinical Practice 7, 2 (2001), 97--107.",
      "doi": ""
    },
    {
      "text": "Fred D Davis. 1989. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly 13, 3 (1989), 319--340.  ",
      "doi": "10.2307/249008"
    },
    {
      "text": "Jan De Leeuw and Sandra Pruzansky. 1978. A new computational method to fit the weighted Euclidean distance model. Psychometrika 43, 4 (1978), 479--490.",
      "doi": ""
    },
    {
      "text": "Lieven Decock and Igor Douven. 2011. Similarity after goodman. Review of Philosophy and Psychology 2, 1 (2011), 61--75.",
      "doi": ""
    },
    {
      "text": "Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. 2016a. EventAction: Visual analytics for temporal event sequence recommendation. In Proceedings of the IEEE Visual Analytics Science and Technology. 61--70.",
      "doi": ""
    },
    {
      "text": "Fan Du, Ben Shneiderman, Catherine Plaisant, Sana Malik, and Adam Perer. 2016b. Coping with volume and variety in temporal event sequences: Strategies for sharpening analytic focus. IEEE Transactions on Visualization and Computer Graphics PP, 99 (2016), 1--14.",
      "doi": ""
    },
    {
      "text": "Ellen A Ensher and Susan E Murphy. 1997. Effects of race, gender, perceived similarity, and contact on mentor relationships. Journal of Vocational Behavior 50, 3 (1997), 460--481.",
      "doi": ""
    },
    {
      "text": "Lyndsey Franklin, Catherine Plaisant, Kazi Minhazur Rahman, and Ben Shneiderman. 2016. TreatmentExplorer: An interactive decision aid for medical risk communication and treatment exploration. Interacting with Computers 28, 3 (2016), 238--252.",
      "doi": ""
    },
    {
      "text": "David Gotz and Harry Stavropoulos. 2014. DecisionFlow: Visual analytics for high-dimensional temporal event sequence data. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1783--1792.",
      "doi": ""
    },
    {
      "text": "Fabio Grandi. 2010. T-SPARQL: A TSQL2-like temporal query language for RDF. In In International Workshop on Querying Graph Structured Data. 21--30.",
      "doi": ""
    },
    {
      "text": "Beverly L Harrison, Russell Owen, and Ronald M Baecker. 1994. Timelines: An interactive system for the collection and visualization of temporal data. In Graphics Interface. 141--141.",
      "doi": ""
    },
    {
      "text": "Jonathan L Herlocker, Joseph A Konstan, and John Riedl. 2000. Explaining collaborative filtering recommendations. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. 241--250.  ",
      "doi": "10.1145/358916.358995"
    },
    {
      "text": "Sandy H Huang, Paea LePendu, Srinivasan V Iyer, Ming Tai-Seale, David Carrell, and Nigam H Shah. 2014. Toward personalizing treatment for depression: Predicting diagnosis and severity. Journal of the American Medical Informatics Association 21, 6 (2014), 1069--1075.",
      "doi": ""
    },
    {
      "text": "Gerald M Karam. 1994. Visualization using timelines. In Proceedings of the ACM International Symposium on Software Testing and Analysis. 125--137.  ",
      "doi": "10.1145/186258.187157"
    },
    {
      "text": "Josua Krause, Adam Perer, and Harry Stavropoulos. 2016. Supporting iterative cohort construction with visual temporal queries. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 91--100.",
      "doi": "10.1109/TVCG.2015.2467622"
    },
    {
      "text": "Christopher A Longhurst, Robert A Harrington, and Nigam H Shah. 2014. A \"Green Button\" for using aggregate patient data at the point of care. Health Affairs 33, 7 (2014), 1229--1235.",
      "doi": ""
    },
    {
      "text": "Sana Malik, Ben Shneiderman, Fan Du, Catherine Plaisant, and Margret Bjarnadottir. 2016. High-volume hypothesis testing: Systematic exploration of event sequence comparisons. ACM Transactions on Interactive Intelligent Systems 6, 1 (2016), 9:1--9:23.  ",
      "doi": "10.1145/2890478"
    },
    {
      "text": "Heikki Mannila and Pirjo Ronkainen. 1997. Similarity of event sequences. TIME 97 (1997), 136--140. ",
      "doi": "10.5555/523427.832454"
    },
    {
      "text": "Alaina Michaelson and Noshir S Contractor. 1992. Structural position and perceived similarity. Social Psychology Quarterly (1992), 300--310.",
      "doi": ""
    },
    {
      "text": "Megan Monroe, Rongjian Lan, Hanseung Lee, Catherine Plaisant, and Ben Shneiderman. 2013a. Temporal event sequence simplification. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2227--2236.  ",
      "doi": "10.1109/TVCG.2013.200"
    },
    {
      "text": "Megan Monroe, Rongjian Lan, Juan Morales del Olmo, Ben Shneiderman, Catherine Plaisant, and Jeff Millstein. 2013b. The challenges of specifying intervals and absences in temporal queries: A graphical language approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2349--2358.  ",
      "doi": "10.1145/2470654.2481325"
    },
    {
      "text": "David O'hare. 1976. Individual differences in perceived similarity and preference for visual art: A multidimensional scaling analysis. Perception & Psychophysics 20, 6 (1976), 445--452.",
      "doi": ""
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. 1996. LifeLines: Visualizing personal histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 221--227.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Catherine Plaisant, Rich Mushlin, Aaron Snyder, Jia Li, Daniel Heller, and Ben Shneiderman. 1998. LifeLines: Using visualization to enhance navigation and analysis of patient records. In Proceedings of the AMIA Symposium. 76--80.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman, Catherine Plaisant, Maxine Cohen, Steven Jacobs, Niklas Elmqvist, and Nicholas Diakopoulos. 2017. Designing the User Interface: Strategies for Effective Human-Computer Interaction. Pearson. ",
      "doi": "10.5555/3033040"
    },
    {
      "text": "Rashmi Sinha and Kirsten Swearingen. 2002. The role of transparency in recommender systems. In CHI Extended Abstracts on Human Factors in Computing Systems. 830--831.  ",
      "doi": "10.1145/506443.506619"
    },
    {
      "text": "Richard Snodgrass. 1987. The temporal query language TQuel. ACM Transactions on Database Systems 12, 2 (1987), 247--298.  ",
      "doi": "10.1145/22952.22956"
    },
    {
      "text": "Ellen Spertus, Mehran Sahami, and Orkut Buyukkokten. 2005. Evaluating similarity measures: A large-scale study in the orkut social network. In Proceedings of the ACM International Conference on Knowledge Discovery in Data Mining. 678--684.  ",
      "doi": "10.1145/1081870.1081956"
    },
    {
      "text": "Ashish Sureka and Pranav Prabhakar Mirajkar. 2008. An empirical study on the effect of different similarity measures on user-based collaborative filtering algorithms. In Pacific Rim International Conference on Artificial Intelligence. 1065--1070.  ",
      "doi": "10.5555/1496134.1496245"
    },
    {
      "text": "Jaime Teevan, Christine Alvarado, Mark S Ackerman, and David R Karger. 2004. The perfect search engine is not enough: A study of orienteering behavior in directed search. In Proceedings of the SIGCHI conference on Human factors in computing systems. 415--422.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "Katerina Vrotsou and Camilla Forsell. 2011. A qualitative study of similarity measures in event-based data. In Symposium on Human Interface. 170--179. ",
      "doi": "10.5555/2027916.2027939"
    },
    {
      "text": "Katerina Vrotsou, Anders Ynnerman, and Matthew Cooper. 2013. Are we what we do? Exploring group behaviour through user-defined event-sequence similarity. Information Visualization (2013), 232--247.",
      "doi": ""
    },
    {
      "text": "Taowei David Wang, Catherine Plaisant, Alexander J Quinn, Roman Stanchak, Shawn Murphy, and Ben Shneiderman. 2008. Aligning temporal data by sentinel events: Discovering patterns in electronic health records. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 457--466.  ",
      "doi": "10.1145/1357054.1357129"
    },
    {
      "text": "Krist Wongsuphasawat and David Gotz. 2012. Exploring flow, factors, and outcomes of temporal event sequences with the outflow visualization. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2659--2668.  ",
      "doi": "10.1109/TVCG.2012.225"
    },
    {
      "text": "Krist Wongsuphasawat, John Alexis Guerra Gómez, Catherine Plaisant, Taowei David Wang, Meirav Taieb-Maimon, and Ben Shneiderman. 2011. LifeFlow: Visualizing an overview of event sequences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1747--1756.  ",
      "doi": "10.1145/1978942.1979196"
    },
    {
      "text": "Krist Wongsuphasawat and Ben Shneiderman. 2009. Finding comparable temporal categorical records: A similarity measure with an interactive visualization. In IEEE Symposium on Visual Analytics Science and Technology. 27--34.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 1992. The tenth revision of the international classification of diseases and related health problems (ICD-10). (1992).",
      "doi": ""
    },
    {
      "text": "Emanuel Zgraggen, Steven M. Drucker, Danyel Fisher, and Robert DeLine. 2015. (s|qu)eries: Visual regular expressions for querying and exploring event sequences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2683--2692.  ",
      "doi": "10.1145/2702123.2702262"
    }
  ]
}