{
  "doi": "10.1145/3025453.3025792",
  "title": "WireDraw: 3D Wire Sculpturing Guided with Mixed Reality",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3693-3704",
  "year": 2017,
  "badges": [],
  "abstract": "The availability of commodity 3D extruder pen allows direct drawing of 3D wire sculptures for novice users, enabling many novel applications such as intuitive spatial intelligence development for school students. However, the lack of spatial and structural cues among individual pen strokes makes the 3D drawing process challenging, which often leads to highly distorted and even incomplete wire sculptures. We present a mixed reality system, called `WireDraw', to immersively guide the 3D drawing for easy wire sculpturing. The system design is based on novel 3D drawing principles and the subsequent optimization, making the stroke sequence of the wire model drawable and easy to draw. On-the-fly edits on unsatisfactory strokes are also allowed for creative design. We demonstrate the effectiveness of our system by testing on a variety of wire models and a user study. The results show that the visual guidance provided by our system is extremely helpful for drawing high-quality wire sculptures.",
  "tags": [
    "3D extruder pen",
    "stroke generation",
    "drawing optimization",
    "mixed reality",
    "wire sculpture"
  ],
  "authors": [
    {
      "name": "Ya-Ting Yue",
      "institution": "The University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161904",
      "orcid": "missing"
    },
    {
      "name": "Xiaolong Zhang",
      "institution": "The University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163461",
      "orcid": "missing"
    },
    {
      "name": "Yongliang Yang",
      "institution": "University of Bath, Bath, Avon, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659513664",
      "orcid": "missing"
    },
    {
      "name": "Gang Ren",
      "institution": "Xiamen University of Technology, Xiamen, Fujian, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556449756",
      "orcid": "missing"
    },
    {
      "name": "Yi-King Choi",
      "institution": "The University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416602092",
      "orcid": "missing"
    },
    {
      "name": "Wenping Wang",
      "institution": "The University of Hong Kong, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451595839",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. Master Your 3D Pen: Tips, Techniques, and Inspiration for 3D Designs. 3DTotal Publishing.",
      "doi": ""
    },
    {
      "text": "3DScribbler. 2016. http://www.scribbler3dpen.com/. (2016).",
      "doi": ""
    },
    {
      "text": "ARTookit. 2016. http://artoolkit.org. (2016).",
      "doi": ""
    },
    {
      "text": "Seok-Hyung Bae, Ravin Balakrishnan, and Karan Singh. 2008. ILoveSketch: As-natural-as-possible Sketching System for Creating 3D Curve Models. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology. 151--160.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Found. Trends Hum.-Comput. Interact. 8, 2--3 (2015), 73--272.",
      "doi": "10.1561/1100000049"
    },
    {
      "text": "Thomas O. Boucher. 1996. Computer Automation in Manufacturing. Springer US. ",
      "doi": ""
    },
    {
      "text": "Bruno De Araùjo, Géry Casiez, and Joaquim Jorge. 2012. Mockup builder: direct 3D modeling on and above the surface in a continuous interaction space. In Proceedings of Graphics Interface 2012 (GI 2012). 173--180.",
      "doi": ""
    },
    {
      "text": "Fernando De Goes, Siome Goldenstein, Mathieu Desbrun, and Luiz Velho. 2011. Exoskeleton: Curve network abstraction for 3D shapes. Computers & Graphics 35, 1 (2011), 112--121.  ",
      "doi": "10.1016/j.cag.2010.11.012"
    },
    {
      "text": "Matthew Flagg and James M. Rehg. 2006. Projector-guided Painting. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). 235--244.  ",
      "doi": "10.1145/1166253.1166290"
    },
    {
      "text": "Hongbo Fu, Shizhe Zhou, Ligang Liu, and Niloy J. Mitra. 2011. Animated Construction of Line Drawings. ACM Trans. Graph. 30, 6 (2011), 133:1--133:10.",
      "doi": "10.1145/2070781.2024167"
    },
    {
      "text": "Akash Garg, Andrew O. Sageman-Furnas, Bailin Deng, Yonghao Yue, Eitan Grinspun, Mark Pauly, and Max Wardetzky. 2014. Wire Mesh Design. ACM Trans. Graph. 33, 4 (2014), 66:1--66:12.",
      "doi": "10.1145/2601097.2601106"
    },
    {
      "text": "Cindy Grimm and Pushkar Joshi. 2012. Just DrawIt: A 3D Sketching System. In Proceedings of the International Symposium on Sketch-Based Interfaces and Modeling. 121--130.",
      "doi": ""
    },
    {
      "text": "Ankit Gupta, Dieter Fox, Brian Curless, and Michael Cohen. 2012. DuploTrack: A Real-time System for Authoring and Guiding Duplo Block Assembly. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology. 389--402.  ",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Arthur Guptill and Susan Meyer. 1997. Rendering in Pen and Ink. Watson-Guptill Publications Inc.",
      "doi": ""
    },
    {
      "text": "Jiyang Huang, Juyong Zhang, Xin Hu, Guoxian Song, Zhongyuan Liu, Lei Yu, and Ligang Liu. 2016. FrameFab: Robotic Fabrication of Frame Shapes. ACM Trans. Graph. 35, 6 (2016), to appear.  ",
      "doi": "10.1145/2980179.2982401"
    },
    {
      "text": "Emmanuel Iarussi, Adrien Bousseau, and Theophanis Tsandilas. 2013. The Drawing Assistant: Automated Drawing Guidance and Feedback from Photographs. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). 183--192.  ",
      "doi": "10.1145/2501988.2501997"
    },
    {
      "text": "Emmanuel Iarussi, Wilmot Li, and Adrien Bousseau. 2015. WrapIt: Computer-assisted Crafting of Wire Wrapped Jewelry. ACM Trans. Graph. 34, 6 (2015), 221:1--221:8.",
      "doi": "10.1145/2816795.2818118"
    },
    {
      "text": "D. Keefe, R. Zeleznik, and D. Laidlaw. 2007. Drawing on Air: Input Techniques for Controlled 3D Line Illustration. IEEE Transactions on Visualization and Computer Graphics 13, 5 (2007), 1067--1081.  ",
      "doi": "10.1109/TVCG.2007.1060"
    },
    {
      "text": "Yongkwan Kim and Seok-Hyung Bae. 2016. SketchingWithHands: 3D Sketching Handheld Products with First-Person Hand Posture. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). 797--808.",
      "doi": "10.1145/2984511.2984567"
    },
    {
      "text": "S. Kirkpatrick, C. D. Gelatt, and M. P. Vecchi. 1983. Optimization by Simulated Annealing. Science 220, 4598 (1983), 671--680. ",
      "doi": ""
    },
    {
      "text": "Manfred Lau, Greg Saul, Jun Mitani, and Takeo Igarashi. 2010. Modeling-in-context: User Design of Complementary Objects with a Single Photo. In Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium. 17--24.",
      "doi": ""
    },
    {
      "text": "Jeremy Laviole and Martin Hachet. 2012. Spatial Augmented Reality for Physical Drawing. In Adjunct Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST Adjunct Proceedings '12). 9--10.  ",
      "doi": "10.1145/2380296.2380302"
    },
    {
      "text": "Yong Jae Lee, C. Lawrence Zitnick, and Michael F. Cohen. 2011. ShadowDraw: Real-time User Guidance for Freehand Drawing. ACM Trans. Graph. 30, 4 (2011), 27:1--27:10.",
      "doi": "10.1145/2010324.1964922"
    },
    {
      "text": "Eder Miguel, Mathias Leputre, and Bernd Bickel. 2016. Computational Design of Stable Planar-Rod Structures. ACM Trans. Graph. 35, 6 (2016), to appear.  ",
      "doi": "10.1145/2897824.2925978"
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014. WirePrint: 3D Printed Previews for Fast Prototyping. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology. 273--280.  ",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive construction: interactive fabrication of functional mechanical devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Huaishu Peng, Rundong Wu, Steve Marschner, and François Guimbretière. 2016. On-The-Fly Print: Incremental Printing While Modelling. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 887--896.  ",
      "doi": "10.1145/2858036.2858106"
    },
    {
      "text": "Huaishu Peng, Amit Zoran, and François V. Guimbretière. 2015. D-Coil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). 1807--1815.  ",
      "doi": "10.1145/2702123.2702381"
    },
    {
      "text": "Alec Rivers, Andrew Adams, and Frédo Durand. 2012. Sculpting by numbers. ACM Transactions on Graphics (TOG) 31, 6 (2012), 157.",
      "doi": "10.1145/2366145.2366176"
    },
    {
      "text": "Thijs Roumen, Bastian Kruck, Tobias Dürschmid, Tobias Nack, and Patrick Baudisch. 2016. Mobile Fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). 3--14.  ",
      "doi": "10.1145/2984511.2984586"
    },
    {
      "text": "Ryan Schmidt, Azam Khan, Karan Singh, and Gord Kurtenbach. 2009. Analytic Drawing of 3D Scaffolds. ACM Trans. Graph. 28, 5 (2009), 149:1--149:10.",
      "doi": "10.1145/1618452.1618495"
    },
    {
      "text": "Roy Shilkrot, Pattie Maes, Joseph A. Paradiso, and Amit Zoran. 2015. Augmented Airbrush for Computer Aided Painting (CAP). ACM Trans. Graph. 34, 2 (2015), 19:1--19:11.",
      "doi": "10.1145/2699649"
    },
    {
      "text": "Hyunyoung Song, François Guimbretière, Chang Hu, and Hod Lipson. 2006. ModelCraft: Capturing Freehand Annotations and Edits on Physical 3D Models. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3855--3864.  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Gerold Wesche and Hans-Peter Seidel. 2001. FreeDrawer: A Free-form Sketching System on the Responsive Workbench. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology. 167--174.  ",
      "doi": "10.1145/505008.505041"
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2011. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Rundong Wu, Huaishu Peng, François Guimbretière, and Steve Marschner. 2016. Printing Arbitrary Meshes with a 5DOF Wireframe Printer. ACM Trans. Graph. 35, 4 (2016), 101:1--101:9.",
      "doi": "10.1145/2897824.2925966"
    },
    {
      "text": "Baoxuan Xu, William Chang, Alla Sheffer, Adrien Bousseau, James McCrae, and Karan Singh. 2014. True2Form: 3D Curve Networks from 2D Sketches via Selective Regularization. ACM Trans. Graph. 33, 4 (2014), 131:1--131:13.",
      "doi": "10.1145/2601097.2601128"
    },
    {
      "text": "Amit Zoran and Joseph A. Paradiso. 2013. FreeD: A Freehand Digital Sculpting Tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). 2613--2616.  ",
      "doi": "10.1145/2470654.2481361"
    },
    {
      "text": "Amit Zoran, Roy Shilkrot, Pragun Goyal, Pattie Maes, and Joseph A. Paradiso. 2014a. The Wise Chisel: The Rise of the Smart Handheld Tool. IEEE Pervasive Computing 13, 3 (2014), 48--57. ",
      "doi": ""
    },
    {
      "text": "Amit Zoran, Roy Shilkrot, Suranga Nanyakkara, and Joseph Paradiso. 2014b. The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact. 21, 3 (2014), 15:1--15:29.",
      "doi": "10.1145/2617570"
    }
  ]
}