{
  "doi": "10.1145/3025453.3025786",
  "title": "Comparing Social Robot, Screen and Voice Interfaces for Smart-Home Control",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "580-628",
  "year": 2017,
  "badges": [],
  "abstract": "With domestic technology on the rise, the quantity and complexity of smart-home devices are becoming an important interaction design challenge. We present a novel design for a home control interface in the form of a social robot, commanded via tangible icons and giving feedback through expressive gestures. We experimentally compare the robot to three common smart-home interfaces: a voice-control loudspeaker; a wall-mounted touch-screen; and a mobile application. Our findings suggest that interfaces that rate higher on flow rate lower on usability, and vice versa. Participants' sense of control is highest using familiar interfaces, and lowest using voice control. Situation awareness is highest using the robot, and also lowest using voice control. These findings raise questions about voice control as a smart-home interface, and suggest that embodied social robots could provide for an engaging interface with high situation awareness, but also that their usability remains a considerable design challenge.",
  "authors": [
    {
      "name": "Michal Luria",
      "institution": "Interdisciplinary Center Herzliya, Herzliya, Israel",
      "img": "/do/10.1145/contrib-99658688561/rel-imgonly/michal_luria.jpg",
      "acmid": "99658688561",
      "orcid": "missing"
    },
    {
      "name": "Guy Hoffman",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100537802",
      "orcid": "missing"
    },
    {
      "name": "Oren Zuckerman",
      "institution": "Interdisciplinary Center Herzliya, Herzliya, Israel",
      "img": "/do/10.1145/contrib-81100224720/rel-imgonly/oren_h.jpg",
      "acmid": "81100224720",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Muhammad Raisul Alam, Mamun Bin Ibne Reaz, and Mohd Alauddin Mohd Ali. 2012. A review of smart homes-past, present, and future. Systems, Man, and Cybernetics, Part C: Applications and Reviews, IEEE Transactions on 42, 6 (2012), 1190--1203.",
      "doi": "10.1109/TSMCC.2012.2189204"
    },
    {
      "text": "Martha W Alibali, Sotaro Kita, and Amanda J Young. 2000. Gesture and the process of speech production: We think, therefore we gesture. Language and cognitive processes 15, 6 (2000), 593--613.",
      "doi": ""
    },
    {
      "text": "Roger Bakeman. 2005. Recommended effect size statistics for repeated measures designs. Behavior research methods 37, 3 (2005), 379--384. ",
      "doi": ""
    },
    {
      "text": "Gregory Baltus, Dieter Fox, Francine Gemperle, Jennifer Goetz, Tad Hirsch, Dimitris Magaritis, Mike Montemerlo, Joelle Pineau, Nicholas Roy, Jamie Schulte, and others. 2000. Towards personal service robots for the elderly. In Proc. of the Workshop on Interactive Robotics and Entertainment (WIRE-2000).",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Kerstin Dautenhahn, and Takayuki Kanda. 2016. Social Robotics. In Springer Handbook of Robotics. Springer, 1935--1972. ",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal and Paul Fitzpatrick. 2000. That certain look: Social amplification of animate vision. In Proceedings of the AAAI fall symposium on society of intelligence agents-the human in the loop.",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Barry Brumitt and Jonathan J Cadiz. 2001. Let there be light\" examining interfaces for homes of the future. In Human Computer Interaction. INTERACT'01. IFIP TC. 13 International Conference on Human Computer Interaction. IOS Press, Amsterdam, Netherlands; 2001; xxvii+ 897 pp. 375--82.",
      "doi": ""
    },
    {
      "text": "Wolfram Burgard, Armin B Cremers, Dieter Fox, Dirk Hähnel, Gerhard Lakemeyer, Dirk Schulz, Walter Steiner, and Sebastian Thrun. 1999. Experiences with an interactive museum tour-guide robot. Artificial intelligence 114, 1 (1999), 3--55.  ",
      "doi": "10.1016/S0004-3702%2899%2900070-3"
    },
    {
      "text": "Chia-Wei Chang, Kuan-Ting Chen, Hsiu-Li Lin, Chih-Kai Wang, and Jong-Hann Jean. 2007. Development of a patrol robot for home security with network assisted interactions. In SICE, 2007 Annual Conference. IEEE, 924--928. ",
      "doi": ""
    },
    {
      "text": "Michael Harris Cohen, James P Giangola, and Jennifer Balogh. 2004. Voice user interface design. Addison-Wesley Professional.",
      "doi": "10.5555/975074"
    },
    {
      "text": "Herbert A Colle and Keith J Hiszem. 2004. Standing at a kiosk: Effects of key size and spacing on touch screen numeric keypad performance and user preference. Ergonomics 47, 13 (2004), 1406--1423. ",
      "doi": ""
    },
    {
      "text": "Diane J Cook, G Michael Youngblood, Edwin O Heierman III, Karthik Gopalratnam, Sira Rao, Andrey Litvin, and Farhan Khawaja. 2003. MavHome: An Agent-Based Smart Home.. In PerCom, Vol. 3. 521--524.",
      "doi": ""
    },
    {
      "text": "Susan Wagner Cook, Zachary Mitchell, and Susan Goldin-Meadow. 2008. Gesturing makes learning last. Cognition 106, 2 (2008), 1047--1058. ",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 2000. Beyond boredom and anxiety. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Kerstin Dautenhahn, Sarah Woods, Christina Kaouri, Michael L Walters, Kheng Lee Koay, and Iain Werry. 2005. What is a robot companion-friend, assistant or butler?. In Intelligent Robots and Systems, 2005.(IROS 2005). 2005 IEEE/RSJ International Conference on. IEEE, 1192--1197.",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K Dey. 2006. Principles of smart home control. In UbiComp 2006: Ubiquitous Computing. Springer, 19--34.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "W Keith Edwards and Rebecca E Grinter. 2001. At home with ubiquitous computing: Seven challenges. In International Conference on Ubiquitous Computing. Springer, 256--272.",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Jodi Forlizzi and Carl DiSalvo. 2006. Service robots in the domestic environment: a study of the roomba vacuum in the home. In Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-robot interaction. ACM, 258--265.  ",
      "doi": "10.1145/1121241.1121286"
    },
    {
      "text": "Tony Gillie and Donald Broadbent. 1989. What makes interruptions disruptive? A study of length, similarity, and complexity. Psychological research 50, 4 (1989), 243--250. ",
      "doi": ""
    },
    {
      "text": "Susan Goldin-Meadow, Howard Nusbaum, Spencer D Kelly, and Susan Wagner. 2001. Explaining math: Gesturing lightens the load. Psychological Science 12, 6 (2001), 516--522. ",
      "doi": ""
    },
    {
      "text": "Guy Hoffman. 2012. Dumb robots, smart phones: A case study of music listening companionship. In RO-MAN. IEEE, 358--363. ",
      "doi": ""
    },
    {
      "text": "Guy Hoffman. 2016. OpenWoZ: A Runtime-Configurable Wizard-of-Oz Framework for Human-Robot Interaction. In 2016 AAAI Spring Symposium Series.",
      "doi": ""
    },
    {
      "text": "Guy Hoffman, Gurit E Birnbaum, Keinan Vanunu, Omri Sass, and Harry T Reis. 2014. Robot responsiveness to human disclosure affects social impression and appeal. In Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction. ACM, 1--8.",
      "doi": "10.1145/2559636.2559660"
    },
    {
      "text": "Guy Hoffman and Wendy Ju. 2014. Designing Robots With Movement in Mind. Journal of Human-Robot Interaction 3, 1 (2014), 89--122. ",
      "doi": "10.5898/JHRI.3.1.Hoffman"
    },
    {
      "text": "Guy Hoffman, Oren Zuckerman, Gilad Hirschberger, Michal Luria, and Tal Shani-Sherman. 2015. Design and Evaluation of a Peripheral Robotic Conversation Companion. In Proc. of the Tenth Annual ACM/IEEE Int'l Conf. on HRI. ACM, 3--10.  ",
      "doi": "10.1145/2696454.2696495"
    },
    {
      "text": "Caroline Hummels, Kees CJ Overbeeke, and Sietske Klooster. 2007. Move to get moved: a search for methods, tools and knowledge to design for expressive and rich movement-based interaction. Personal and Ubiquitous Computing 11, 8 (2007), 677--690.  ",
      "doi": "10.1007/s00779-006-0135-y"
    },
    {
      "text": "Stephen S Intille. 2002. Designing a home of the future. IEEE pervasive computing 1, 2 (2002), 76--82.",
      "doi": "10.1109/MPRV.2002.1012340"
    },
    {
      "text": "D Jones, K Hapeshi, and C Frankish. 1989. Design guidelines for speech recognition interfaces. Applied Ergonomics 20, 1 (1989), 47--52. ",
      "doi": ""
    },
    {
      "text": "Takayuki Kanda, Dylan F Glas, Masahiro Shiomi, Hiroshi Ishiguro, and Norihiro Hagita. 2008. Who will be the customer?: a social robot that anticipates people's behavior from their trajectories. In Proceedings of the 10th international conference on Ubiquitous computing. ACM, 380--389.  ",
      "doi": "10.1145/1409635.1409686"
    },
    {
      "text": "Cory D Kidd and Cynthia Breazeal. 2008. Robots at home: Understanding long-term human-robot interaction. In 2008 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 3230--3235. ",
      "doi": ""
    },
    {
      "text": "Scott R Klemmer, Björn Hartmann, and Leila Takayama. 2006. How bodies matter: five themes for interaction design. In Proceedings of the 6th conference on Designing Interactive systems. ACM, 140--149.",
      "doi": "10.1145/1142405.1142429"
    },
    {
      "text": "Tiiu Koskela and Kaisa Väänänen-Vainio-Mattila. 2004. Evolution towards smart home environments: empirical evaluation of three user interfaces. Personal and Ubiquitous Computing 8, 3--4 (2004), 234--240.",
      "doi": "10.1007/s00779-004-0283-x"
    },
    {
      "text": "Christine Kühnel, Tilo Westermann, Fabian Hemmert, Sven Kratz, Alexander Müller, and Sebastian Möller. 2011. I'm home: Defining and evaluating a gesture set for smart-home control. International Journal of Human-Computer Studies 69, 11 (2011), 693--704. ",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Jodi Forlizzi, Paul E Rybski, Frederick Crabbe, Wayne Chung, Josh Finkle, Eric Glaser, and Sara Kiesler. 2009. The snackbot: documenting the design of a robot for long-term human-robot interaction. In HRI, 2009 4th ACM/IEEE Int'l Conf. on HRI. IEEE, 7--14.",
      "doi": "10.1145/1514095.1514100"
    },
    {
      "text": "Michal Luria, Guy Hoffman, Benny Megidish, Oren Zuckerman, and Sung Park. 2016. Designing Vyo, a robotic Smart Home assistant: Bridging the gap between device and social agent. In Robot and Human Interactive Communication (RO-MAN), 2016 25th IEEE International Symposium on. IEEE, 1019--1025.",
      "doi": "10.1109/ROMAN.2016.7745234"
    },
    {
      "text": "Hiroshi Mizoguchi, Tomomasa Sato, Katsuyuki Takagi, Masayuki Nakao, and Yotaro Hatamura. 1997. Realization of expressive mobile robot. In Robotics and Automation, 1997. Proceedings., 1997 IEEE International Conference on, Vol. 1. IEEE, 581--586. ",
      "doi": ""
    },
    {
      "text": "Sebastian Möller, Jan Krebber, Alexander Raake, Paula Smeele, Martin Rajman, Mirek Melichar, Vincenzo Pallotta, Gianna Tsakou, Basilis Kladis, Anestis Vovos, and others. 2004. INSPIRE: Evaluation of a smart-home system for infotainment management and device control. arXiv preprint cs/0410063 (2004).",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Enhancing the explanatory power of usability heuristics. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 152--158.",
      "doi": "10.1145/191666.191729"
    },
    {
      "text": "Donald A Norman. 2013. The design of everyday things: Revised and expanded edition. Basic books.",
      "doi": ""
    },
    {
      "text": "Stephen Olejnik and James Algina. 2003. Generalized eta and omega squared statistics: measures of effect size for some common research designs. Psychological methods 8, 4 (2003), 434.",
      "doi": ""
    },
    {
      "text": "Kwang-Hyun Park, Hyong-Euk Lee, Youngmin Kim, and Z Zenn Bien. 2008. A steward robot for human-friendly human-machine interaction in a smart house environment. Automation Science and Engineering, IEEE Transactions on 5, 1 (2008), 21--25.",
      "doi": ""
    },
    {
      "text": "Erika Shehan Poole, Marshini Chetty, Rebecca E Grinter, and W Keith Edwards. 2008. More than meets the eye: transforming the user experience of home network management. In Proceedings of the 7th ACM conference on Designing interactive systems. ACM, 455--464.  ",
      "doi": "10.1145/1394445.1394494"
    },
    {
      "text": "Sara Price, Yvonne Rogers, Michael Scaife, Danae Stanton, and Helen Neale. 2003. Using \"tangibles\" to promote novel forms of playful learning. Interacting with computers 15, 2 (2003), 169--185. ",
      "doi": ""
    },
    {
      "text": "Pranav Rane, Varun Mhatre, and Lakshmi Kurup. 2014. Study of a home robot: Jibo. In International Journal of Engineering Research and Technology, Vol. 3. ESRSA Publications.",
      "doi": ""
    },
    {
      "text": "Parisa Rashidi and Diane J Cook. 2009. Keeping the resident in the loop: adapting the smart home to the user. IEEE Transactions on systems, man, and cybernetics-part A: systems and humans 39, 5 (2009), 949--959.  ",
      "doi": "10.1109/TSMCA.2009.2025137"
    },
    {
      "text": "Yvonne Rogers. 2006. Moving on from weiser's vision of calm computing: Engaging ubicomp experiences. In UbiComp 2006: Ubiquitous Computing. Springer, 404--421.  ",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Takanori Shibata, Toshihiro Tashima, and Kazuo Tanie. 1999. Emergence of emotional behavior through physical interaction between human and robot. In Robotics and Automation, 1999. Proceedings. 1999 IEEE International Conference on, Vol. 4. IEEE, 2868--2873. ",
      "doi": ""
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical ottoman: how robotic furniture offers and withdraws support. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 11--18.  ",
      "doi": "10.1145/2696454.2696461"
    },
    {
      "text": "Norbert Streitz and Paddy Nixon. 2005. The disappearing computer. Commun. ACM 48, 3 (2005), 32--35.  ",
      "doi": "10.1145/1047671.1047700"
    },
    {
      "text": "Ja-Young Sung, Lan Guo, Rebecca E Grinter, and Henrik I Christensen. 2007. \"My Roomba Is Rambo\": Intimate Home Appliances. Springer.",
      "doi": "10.5555/1771592.1771601"
    },
    {
      "text": "Ahmed Mohmmad Ullah, Md Rashedul Islam, Sayeda Farzana Aktar, and SK Alamgir Hossain. 2012. Remote-touch: Augmented reality based marker tracking for smart home control. In Computer and Information Technology (ICCIT), 2012 15th International Conference on. IEEE, 473--477.",
      "doi": ""
    },
    {
      "text": "Kazuyoshi Wada, Takanori Shibata, Tomoko Saito, Kayoko Sakamoto, and Kazuo Tanie. 2005. Psychological and social effects of one year robot assisted activity on elderly people at a health service facility for the aged. In Proceedings of the 2005 IEEE international conference on robotics and automation. IEEE, 2785--2790. ",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1991. The computer for the 21st century. Scientific american 265, 3 (1991), 94--104. ",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: it's like mixing technology and religion. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 527--536.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Lesley Xie, Alissa N Antle, and Nima Motamedi. 2008. Are tangibles more fun?: comparing children's enjoyment and engagement using physical, graphical and tangible user interfaces. In Proceedings of the 2nd international conference on Tangible and embedded interaction. ACM, 191--198.  ",
      "doi": "10.1145/1347390.1347433"
    },
    {
      "text": "Alexander Yates, Oren Etzioni, and Daniel Weld. 2003. A reliable natural language interface to household appliances. In Proceedings of the 8th international conference on Intelligent user interfaces. ACM, 189--196.  ",
      "doi": "10.1145/604045.604075"
    },
    {
      "text": "Steve Yohanan, Mavis Chan, Jeremy Hopkins, Haibo Sun, and Karon MacLean. 2005. Hapticat: exploration of affective touch. In Proceedings of the 7th international conference on Multimodal interfaces. ACM, 222--229.  ",
      "doi": "10.1145/1088463.1088502"
    },
    {
      "text": "Baris Yuksekkaya, A Alper Kayalar, M Bilgehan Tosun, M Kaan Ozcan, and Ali Ziya Alkar. 2006. A GSM, internet and speech controlled wireless interactive home automation system. IEEE Transactions on Consumer Electronics 52, 3 (2006), 837--843.  ",
      "doi": "10.1109/TCE.2006.1706478"
    },
    {
      "text": "Oren Zuckerman. 2015. Objects for change: A case study of a tangible user interface for behavior change. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 649--654.  ",
      "doi": "10.1145/2677199.2687906"
    },
    {
      "text": "Oren Zuckerman and Ayelet Gal-Oz. 2013. To TUI or not to TUI: Evaluating performance and preference in tangible vs. graphical user interfaces. Int'l Journal of Human-Computer Studies 71, 7 (2013), 803--820.  ",
      "doi": "10.1016/j.ijhcs.2013.04.003"
    }
  ]
}