{
  "doi": "10.1145/3025453.3025761",
  "title": "It wasn't really about the Pokémon: Parents' Perspectives on a Location-Based Mobile Game",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1483-1496",
  "year": 2017,
  "badges": [],
  "abstract": "Though prior work shows parents worry about screen media experiences displacing physical activity and time outdoors, this research does not account for location-based mobile games like Pokémon GO, which specifically facilitate outdoor activity. To fill this gap in the research, we surveyed and interviewed parents to understand (1) their values and perceptions of this type of gameplay and (2) how they co-play Pokémon GO with their children. Our findings provide empirical evidence that, in addition to appreciating the increased exercise and time outdoors, parents valued how play led to family bonding experiences. Furthermore, some traditional concerns about screen time persisted in this context, and new concerns about safety in real-world environments emerged. Parents mitigated these concerns with rules and gameplay choices, such as maintaining control of the mobile device, to ensure children were safe. This work contributes an empirical understanding of families as co-users of technology and offers a generative lens to study and design for joint media engagement among family members where gameplay differs from normative notions of screen time.",
  "authors": [
    {
      "name": "Kiley Sobel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557410456",
      "orcid": "missing"
    },
    {
      "name": "Arpita Bhattacharya",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130362",
      "orcid": "0000-0001-8890-5557"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    },
    {
      "name": "Jin Ha Lee",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332511159",
      "orcid": "0000-0002-9007-514X"
    },
    {
      "name": "Julie A. Kientz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548025762/rel-imgonly/kientz-headshot-small.png",
      "acmid": "81548025762",
      "orcid": "missing"
    },
    {
      "name": "Jason C. Yip",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    }
  ],
  "references": [
    {
      "text": "Pål André Aarsand. 2007. Computer and Video Games in Family Life: The digital divide as a resource in intergenerational interactions. Childhood 14, 2 (May 2007), 235--256. DOI: http://dx.doi.org/10.1177/0907568207078330 ",
      "doi": ""
    },
    {
      "text": "Rafael Ballagas, Thérèse E. Dugan, Glenda Revelle, Koichi Mori, Maria Sandberg, Janet Go, Emily Reardon, and Mirjana Spasojevic. 2013. Electric agents: fostering sibling joint media engagement through interactive television and augmented reality. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 225--236. DOI: http://dx.doi.org/10.1145/2441776.2441803  ",
      "doi": "10.1145/2441776.2441803"
    },
    {
      "text": "Shari Barkin, Edward Ip, Irma Richardson, Sara Klinepeter, Stacia Finch, and Marina Krcmar. 2006. Parental media mediation styles for children aged 2 to 11 years. Archives of Pediatrics & Adolescent Medicine 160, 4 (April 2006), 395--401. DOI: http://dx.doi.org/10.1001/archpedi.160.4.395 ",
      "doi": ""
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as learning partners in the development of technological fluency. International Journal of Learning and Media 1, 2 (May 2009), 55--77. DOI: http://dx.doi.org/10.1162/ijlm.2009.0021 ",
      "doi": ""
    },
    {
      "text": "Mindy Brooks, Ashley Fenwick-Naditch, and Erica Branch-Ridley. 2011. Electric Racer: An intergenerational gaming experience designed to promote literacy. In The New Coviewing: Designing for Learning through Joint Media, 30--33.",
      "doi": ""
    },
    {
      "text": "Ari Brown, Donald L. Shifrin, and David L. Hill. 2015. Beyond 'turn it off': How to advise families on media use. AAP News 36, 10 (October 2015).",
      "doi": ""
    },
    {
      "text": "Adrian David Cheok, Kok Hwee Goh, Wei Liu, Farzam Farbiz, Siew Wan Fong, Sze Lee Teo, Yu Li, and Xubo Yang. 2004. Human Pacman: A mobile, widearea entertainment system based on physical, social, and ubiquitous computing. Personal and Ubiquitous Computing 8, 2 (May 2004), 71--81. DOI: http://dx.doi.org/10.1007/s00779-004-0267-x  ",
      "doi": "10.1007/s00779-004-0267-x"
    },
    {
      "text": "Luca Chittaro and Riccardo Sioni. 2012. Turning the classic snake mobile game into a location-based exergame that encourages walking. In International Conference on Persuasive Technology, Springer Berlin Heidelberg, 43--54. DOI: http://dx.doi.org/10.1007/9783-642-31037-9_4",
      "doi": ""
    },
    {
      "text": "Dimitri A. Christakis. 2010. Internet addiction: A 21st century epidemic? BMC Medicine 8, 1 (2010). DOI: http://dx.doi.org/10.1186/1741-7015-8-61 ",
      "doi": ""
    },
    {
      "text": "Lynn Schofield Clark. 2011. Parental mediation theory for the digital age. Communication Theory 21, 4 (October 2011): 323--343. DOI: http://dx.doi.org/10.1111/j.1468-2885.2011.01391.x ",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2015. Basics of Qualitative Research (4th ed.) SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Entertainment Software Association. 2015. Essential Facts about the Computer and Video Game Industry. Retrieved September 15, 2016 from http://www.theesa.com/wpcontent/uploads/2015/04/ESA-Essential-Facts2015.pdf.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. Children's Online Privacy Protection Rule (\"COPPA\"). Retrieved on September 16, 2016 from https://www.ftc.gov/enforcement/rules/rulemaking-regulatory-reform-proceedings/childrens-online-privacy-protection-rule.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Hayes Raffle, Janet Go, Rafael Ballagas, and Hiroshi Ishii. 2010. Video play: playful interactions in video conferencing for long-distance families with young children. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC '10). ACM, New York, NY, USA, 49--58. DOI: http://dx.doi.org/10.1145/1810543.1810550  ",
      "doi": "10.1145/1810543.1810550"
    },
    {
      "text": "Michelle M. Garrison, Kimberly Liekweg, and Dimitri A. Christakis. 2011. Media use and child sleep: The impact of content, timing, and environment. Pediatrics 128, 1 (June 2011), 29--35. DOI: http://dx.doi.org/10.1542/peds.2010-3304 ",
      "doi": ""
    },
    {
      "text": "Douglas A. Gentile, Amy I. Nathanson, Eric E. Rasmussen, Rachel A. Reimer, and David A. Walsh. 2012. Do you see what I see Parent and child reports of parental monitoring of media. Family Relations 61, 3 (June 2012): 470--487. DOI: http://dx.doi.org/10.1111/j.1741-3729.2012.00709.x ",
      "doi": ""
    },
    {
      "text": "Janet Go, Rafael Ballagas, and Mirjana Spasojevic. 2012. Brothers and sisters at play: exploring game play with siblings. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 739--748. DOI: http://dx.doi.org/10.1145/2145204.2145316  ",
      "doi": "10.1145/2145204.2145316"
    },
    {
      "text": "Mark Hachman. 2016. Pokémon Go is coming to Apple Watch to get you outside and on the go. Macworld. Retrieved September 15, 2016 from http://www.macworld.com/article/3117338/iosapps/pokmon-go-is-coming-to-apple-watch-to-get-you-outside-and-on-the-go.html.",
      "doi": ""
    },
    {
      "text": "Megan K. Halpern, Max Evjen, Dan Cosley, Michael Lin, Stephen Tseou, Erica Horowitz, Tejaswi Peesapati, and Geri Gay. 2011. SunDial: embodied informal science education using GPS. MedieKultur: Journal of Media and Communication Research 27, 50 (June 2011), 48--65. DOI: http://dx.doi.org/10.7146/mediekultur.v27i50.3341 ",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Kiley Sobel, Hyewon Suh, Yi-Chen Sung, Charlotte P. Lee, and Julie A. Kientz. 2015. Texting while Parenting: How Adults Use Mobile Phones while Caring for Children at the Playground. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 727--736. DOI: http://dx.doi.org/10.1145/2702123.2702199  ",
      "doi": "10.1145/2702123.2702199"
    },
    {
      "text": "Alexis Hiniker, Hyewon Suh, Sabina Cao, and Julie A. Kientz. 2016. Screen Time Tantrums: How Families Manage Screen Media Experiences for Toddlers and Preschoolers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 648--660. DOI: http://dx.doi.org/10.1145/2858036.2858278  ",
      "doi": "10.1145/2858036.2858278"
    },
    {
      "text": "Tom Hope, Yoshiyuki Nakamura, Toru Takahashi, Atsushi Nobayashi, Shota Fukuoka, Masahiro Hamasaki, and Takuichi Nishimura. 2009. Familial collaborations in a museum. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 19631972. DOI: http://dx.doi.org/10.1145/1518701.1519000  ",
      "doi": "10.1145/1518701.1519000"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24. DOI: http://dx.doi.org/10.1145/642611.642616  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Sara Isola and Jerry Alan Fails. 2012. Family and design in the IDC and CHI communities. In Proceedings of the 11th International Conference on Interaction Design and Children (IDC '12). ACM, New York, NY, USA, 40--49. DOI: http://dx.doi.org/10.1145/2307096.2307102  ",
      "doi": "10.1145/2307096.2307102"
    },
    {
      "text": "Mizuko Ito, Sonja Baumer, Matteo Bittanti, danah boyd, Rachel Cody, Becky Herr, Heather A. Horst, Patricia G. Lange, Dilan Mahendran, Katynka Martinez, C. J. Pascoe, Dan Perkel, Laura Robinson, Christo Sims, and Lisa Tripp. 2010. Hanging Out, Messing Around, and Geeking Out. MIT Press.",
      "doi": ""
    },
    {
      "text": "Hilda K. Kabali, Matilde M. Irigoyen, Rosemary Nunez-Davis, Jennifer G. Budacki, Sweta H. Mohanty, Kristin P. Leister, Robert L. Bonner Jr. 2015. Exposure and use of mobile media devices by young children. Pediatrics 136, 6 (November 2015), 10441050. DOI: http://dx.doi.org/10.1542/peds.2015-2151 ",
      "doi": ""
    },
    {
      "text": "Jofish Kaye, Matti Nelimarkka, Riitta Kauppinen, Sini Vartiainen, and Pekka Isosomppi. 2011. Mobile family interaction: how to use mobile technology to bring trust, safety and wellbeing into families. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 721--724. DOI: http://dx.doi.org/10.1145/2037373.2037497  ",
      "doi": "10.1145/2037373.2037497"
    },
    {
      "text": "Konstantinos Kazakos, Elizabeth Bales, Carman Neustaedter, Svetlana Yarosh, Joseph 'Jofish' Kaye, and David Kirk. 2013. Exploring the diversity of families: designing technologies for the contemporary family life. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3255--3258. DOI: http://dx.doi.org/10.1145/2468356.2479660  ",
      "doi": "10.1145/2468356.2479660"
    },
    {
      "text": "John Keilman. 2016. 'Pokemon Go' can bring families together. The Chicago Tribune. Retrieved on August 20, 2016 from http://www.chicagotribune.com/news/columnists/ct-pokemon-go-keilman-column-hf-0720--20160714-column.html.",
      "doi": ""
    },
    {
      "text": "Brian Koerber. 2016. 'Pokémon GO' is actually bringing families together. Mashable. Retrieved on August 20, 2016 from http://mashable.com/2016/07/11/pokemon-go-family-bonding-dad/#sDU4uQJMIZqz.",
      "doi": ""
    },
    {
      "text": "Kevin M. Leander, Nathan C. Phillips, and Katherine Headrick Taylor. 2010. The changing social spaces of learning: Mapping new mobilities. Review of research in Education 34, 1 (March 2010), 329--394. DOI: http://dx.doi.org/10.3102/0091732x09358129 ",
      "doi": ""
    },
    {
      "text": "Jin Ha Lee, Rachel Ivy Clarke, and Yea-Seul Kim. 2015. Video game information needs and game organization: differences by sex and age. Information Research 20, 3 (September 2015), 1--24.",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart. 2015. A Majority of American Teens Report Access to a Computer, Game Console, Smartphone and a Tablet. Pew Research Center. Retrieved September 6, 2016 from http://www.pewinternet.org/2015/04/09/a-majority-of-american-teens-report-access-to-a-computer-game-console-smartphone-and-a-tablet/.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Ellen J. Helsper. 2008. Parental mediation of children's internet use. Journal of Broadcasting & Electronic Media 52, 4 (November 2008): 581--599. DOI: http://dx.doi.org/10.1080/08838150802437396 ",
      "doi": ""
    },
    {
      "text": "Kate Lund, Paul Coulton, and Andrew Wilson. 2011. Free All Monsters! a context-aware location based game. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 675--678. DOI: http://dx.doi.org/10.1145/2037373.2037482  ",
      "doi": "10.1145/2037373.2037482"
    },
    {
      "text": "Leilah Lyons, David Becker, and Jessica Roberts. 2010. Analyzing the affordances of mobile technologies for informal science learning. Museums & Social Issues 5, 1 (April 2010), 87--102. DOI: http://dx.doi.org/10.1179/msi.2010.5.1.87 ",
      "doi": ""
    },
    {
      "text": "Frank N. Magid Associates, Inc. 2015. Family Gaming Study. Retrieved September 15, 2016 from http://v.magid.com/video/mmf/Magid_Family_Gaming_Study_October_2015.pdf.",
      "doi": ""
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2013. Mobile interaction does not exist. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2069--2078. DOI: http://dx.doi.org/10.1145/2468356.2468725  ",
      "doi": "10.1145/2468356.2468725"
    },
    {
      "text": "Carman Neustaedter, Tejinder K. Judge, Steve Harrison, Abigail Sellen, Xiang Cao, David Kirk, and Joseph Kaye. 2010. Connecting families: new technologies, family communication, and the impact on domestic space. In Proceedings of the 16th ACM international conference on Supporting group work (GROUP '10). ACM, New York, NY, USA, 363--366. DOI: http://dx.doi.org/10.1145/1880071.1880152  ",
      "doi": "10.1145/1880071.1880152"
    },
    {
      "text": "Carman Neustaedter, Anthony Tang, and Tejinder K. Judge. 2013. Creating scalable location-based games: lessons from Geocaching. Personal and Ubiquitous Computing 17, 2 (February 2013), 335--349. DOI: http://dx.doi.org/10.1007/s00779-011-0497-7  ",
      "doi": "10.1007/s00779-011-0497-7"
    },
    {
      "text": "Niantic, Inc. 2016. Heads up! Retrieved September 18, 2016 from http://pokemongo.nianticlabs.com/en/post/headsup/.",
      "doi": ""
    },
    {
      "text": "Niantic, Inc. 2016. Pokémon GO Plus. Retrieved September 18, 2016 from http://www.pokemongo.com/en-us/pokemon-go-plus/.",
      "doi": ""
    },
    {
      "text": "Niantic, Inc. 2016. Pokémon GO Support. Retrieved September 15, 2016 from https://support.pokemongo.nianticlabs.com/hc/en-us.",
      "doi": ""
    },
    {
      "text": "Niantic, Inc. 2016. Pokémon GO Safety FAQs. Retrieved September 15, 2016 from https://support.pokemongo.nianticlabs.com/hc/enus/articles/226389207-Safety-FAQs.",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Jeroen Jansz. 2006. Parental mediation of children's videogame playing: A comparison of the reports by parents and children. Learning, media and technology 31, 2 (June 2006): 181--202. DOI: http://dx.doi.org/10.1080/17439880600756803 ",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Jeroen Jansz. 2013. Developing scales to measure parental mediation of young children's internet use. Learning, Media and Technology 39, 2 (March 2013), 250--266. DOI: http://dx.doi.org/10.1080/17439884.2013.782038 ",
      "doi": ""
    },
    {
      "text": "Peter Nikken, Jeroen Jansz, and Sanneke Schouwstra. 2007. Parents' interest in videogame ratings and content descriptors in relation to game mediation. European Journal of Communication 22, 3 (September 2007), 315--336. DOI: http://dx.doi.org/10.1177/0267323107079684 ",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Marjon Schols. 2015. How and why parents guide the media use of young children. Journal of child and family studies 24, 11 (February 2015), 3423--3435. DOI: http://dx.doi.org/10.1007/s10826015-0144-4",
      "doi": ""
    },
    {
      "text": "Mary Emily O'Hara. 2016. Meet the Pokémoms: Obsession with playing Pokémon Go has brought families closer together. Retrieved August 20, 2016 from http://www.salon.com/2016/08/14/meet-the-pokemoms-ob_partner/.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. Device Ownership Over Time. Retrieved September 6, 2016 from http://www.pewinternet.org/data-trend/mobile/device-ownership/.",
      "doi": ""
    },
    {
      "text": "Andy Robertson. 2016. The best way to enjoy Pokemon Go? Keep it in the family. The Telegraph. Retrieved August 20, 2016 from http://www.telegraph.co.uk/gaming/what-to-play/the-best-way-to-enjoy-pokemon-go-keep-it-in-the-family/.",
      "doi": ""
    },
    {
      "text": "Barbara Rogoff. 1990. Apprenticeship in thinking: Cognitive development in social context. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Ashwini Ranade, Geeta Kamarthi, Carmen Castaneda-Sceppa, Jessica A. Hoffman, Cathy Wirth, and Andrea G. Parker. 2015. Spaceship Launch: Designing a collaborative exergame for families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1776--1787. DOI: http://dx.doi.org/10.1145/2675133.2675159  ",
      "doi": "10.1145/2675133.2675159"
    },
    {
      "text": "Alexandra Samuel. 2015. Parents: Reject Technology Shame. The Atlantic. Retrieved September 15, 2016 from http://www.theatlantic.com/technology/archive/2015/1 1/why-parents-shouldnt-feel-technology-shame/414163/.",
      "doi": ""
    },
    {
      "text": "Alexandra Samuel. 2015. What kind of digital parent are you? @AlexandraSamuel. Retrieved on September 15, 2016 from http://alexandrasamuel.com/parenting/what-kind-of-digital-parent-are-you.",
      "doi": ""
    },
    {
      "text": "Jeremy Sarachan. 2011. Limiting Screen Time Is Not the Key to Parenting in the Digital Age. International Journal of Learning and Media 3, 4 (September 2011), 1--5. DOI: http://dx.doi.org/10.1162/ijlm_a_00082 ",
      "doi": ""
    },
    {
      "text": "Kelly L. Schmitt. 2000. Public policy, family rules and children's media use in the home. Annenberg Public Policy Center of the University of Pennsylvania.",
      "doi": ""
    },
    {
      "text": "Donald Shifrin, Ari Brown, David Hill, Laura Jana, and Susan K. Flinn. 2015. Growing up digital: Media research symposium. American Academy of Pediatrics (October 2015), 1--7.",
      "doi": ""
    },
    {
      "text": "Aric Sigman. 2012. Time for a view on screen time. Archives of disease in childhood 97, 11 (October 2012), 935--942. DOI: http://doi.org/10.1136/archdischild-2012-302196 ",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2015. U.S. Smartphone Use in 2015. Pew Research Center. Retrieved September 6, 2016 from http://www.pewinternet.org/2015/04/01/us-smartphone-use-in-2015/.",
      "doi": ""
    },
    {
      "text": "Nathalie Sonck, Peter Nikken, and Jos de Haan. 2013. Determinants of internet mediation: A comparison of the reports by Dutch parents and children. Journal of Children and Media 7, 1 (February 2013), 96--113. DOI: http://dx.doi.org/10.1080/17482798.2012.739806 ",
      "doi": ""
    },
    {
      "text": "Kevin G. Stanley, Ian Livingston, Alan Bandurka, Robert Kapiszka, and Regan L. Mandryk. 2010. PiNiZoRo: a GPS-based exercise game for families. In Proceedings of the International Academic Conference on the Future of Game Design and Technology (Futureplay '10). ACM, New York, NY, USA, 243--246. DOI: http://dx.doi.org/10.1145/1920778.1920817  ",
      "doi": "10.1145/1920778.1920817"
    },
    {
      "text": "Reed Stevens and William R. Penuel. 2010. Studying and fostering learning through joint media engagement. In Principal Investigators Meeting of the National Science Foundation's Science of Learning Centers, 1--75.",
      "doi": ""
    },
    {
      "text": "Reed Stevens, T. Satwicz, and L. McCarthy, L. 2008. In-game, in-room, in-world: Reconnecting video game play to the rest of kids' lives. The ecology of games: Connecting youth, games, and learning, 41--66. MIT Press.",
      "doi": ""
    },
    {
      "text": "Victor C. Strasburger. 2010. Media education. Pediatrics 126, 5 (September 2010), 1012--1017. DOI: http://doi.org/10.1542/peds.2010-1636 ",
      "doi": ""
    },
    {
      "text": "Victor C. Strasburger, Barbara J. Wilson, and Amy B. Jordan. 2009. Children, adolescents, and the media. Sage.",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi. 2011. Families Matter: Designing Media for a Digital Age. The Joan Ganz Cooney Center at Sesame Workshop, New York.",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi and Reed Stevens. 2011. The New Coviewing: Designing for Learning through Joint Media Engagement. The Joan Ganz Cooney Center at Sesame Workshop, New York.",
      "doi": ""
    },
    {
      "text": "Katie Headrick Taylor and Rogers Hall. 2013. Countermapping the neighborhood on bicycles: Mobilizing youth to reimagine the city. Technology, Knowledge and Learning 18, 1-2 (April 2013), 65--93. DOI: http://dx.doi.org/10.1007/s10758-013-9201-5 ",
      "doi": ""
    },
    {
      "text": "Michael Tscholl and Robb Lindgren. 2016. Designing for learning conversations: How parents support children's science Learning within an immersive simulation. Science Education 100, 5 (April 2016), 877--902. DOI: http://dx.doi.org/10.1002/sce.21228 ",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2011. Life on the Screen. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Patti M. Valkenburg, Marina Krcmar, Allerd L. Peeters, and Nies M. Marseille. 1999. Developing a scale to assess three styles of television mediation: \"Instructive mediation,\" \"restrictive mediation,\" and \"social coviewing.\" Journal of Broadcasting & Electronic Media 43, 1 (January 1999): 52--66. DOI: http://dx.doi.org/10.1080/08838159909364474 ",
      "doi": ""
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii all play: the console game as a computational meeting place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1559--1568. DOI: http://dx.doi.org/10.1145/1518701.1518940  ",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Lev S. Vygotsky. 1980. Mind in society: The development of higher psychological processes. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Lev S. Vygotsky. 1987. Thinking and speech. In L. S. Vygotsky, R. W. Rieber (Series Eds.), and A. S. Carton (Vol. Ed.), The collected works of L. S. Vygotsky. Vol. 1: Problems in general psychology (N. Minick, Trans.). New York: Plenum.",
      "doi": ""
    },
    {
      "text": "Ellen A. Wartella and Nancy Jennings. 2000. Children and computers: New technology. Old concerns. The future of children 10, 2 (2000), 31--43. DOI: http://dx.doi.org/10.2307/1602688 ",
      "doi": ""
    },
    {
      "text": "Barbara J. Wilson. 2008. Media and children's aggression, fear, and altruism. Future of Children 18, 1 (2008), 87--118. DOI: http://dx.doi.org/10.1353/foc.0.0005 ",
      "doi": ""
    },
    {
      "text": "Frederick J. Zimmerman and Dimitri A. Christakis. 2007. Associations between content types of early media exposure and subsequent attentional problems. Pediatrics 120, 5 (November 2007), 986--992. DOI: http://dx.doi.org/10.1542/peds.2006-3322 ",
      "doi": ""
    }
  ]
}