{
  "doi": "10.1145/3025453.3025883",
  "title": "Critique Style Guide: Improving Crowdsourced Design Feedback with a Natural Language Model",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4627-4639",
  "year": 2017,
  "badges": [],
  "abstract": "Designers are increasingly leveraging online crowds; yet, online contributors may lack the expertise, context, and sensitivity to provide effective critique. Rubrics help feedback providers but require domain experts to write them and may not generalize across design domains. This paper introduces and tests a novel semi-automated method to support feedback providers by analyzing feedback language. In our first study, 52 students from two design courses created design solutions and received feedback from 176 online providers. Instructors, students, and crowd contributors rated the helpfulness of each feedback response. From this data, an algorithm extracted a set of natural language features (e.g., specificity, sentiment etc.) that correlated with the ratings. The features accurately predicted the ratings and remained stable across different raters and design solutions. Based on these features, we produced a critique style guide with feedback examples - automatically selected for each feature - to help providers revise their feedback through self-assessment. In a second study, we tested the validity of the guide through a between-subjects experiment (n=50). Providers wrote feedback on design solutions with or without the guide. Providers generated feedback with higher perceived helpfulness when using our style-based guidance.",
  "tags": [
    "artificial intelligence",
    "machine learning",
    "online education",
    "review",
    "feedback",
    "natural language model",
    "peer feedback"
  ],
  "authors": [
    {
      "name": "Markus Krause",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81418598473/rel-imgonly/portrait.png",
      "acmid": "81418598473",
      "orcid": "missing"
    },
    {
      "name": "Tom Garncarz",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130910",
      "orcid": "missing"
    },
    {
      "name": "JiaoJiao Song",
      "institution": "Huazhong University of Science and Technology, Huazhong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163129",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth M. Gerber",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725085",
      "orcid": "0000-0001-8914-071X"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    },
    {
      "name": "Steven P. Dow",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    }
  ],
  "references": [
    {
      "text": "Amazon. Mechanical Turk. (2016). https://www.mturk.com",
      "doi": ""
    },
    {
      "text": "Behance. Behance. (2016). https://www.behance.net/",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Greg Little, Robert C. Miller, Bjorn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A Word Processor with a Crowd Inside. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Steven Bird, Ewan Klein, and Edward Loper. 2009. Natural Language Processing with Python. ",
      "doi": "10.5555/1717171"
    },
    {
      "text": "Leo Breiman. 2001. Random Forests. Machine learning 45, 1 (2001), 5--32.  ",
      "doi": "10.1023/A%3A1010933404324"
    },
    {
      "text": "Donald Chinn. 2005. Peer Assessment in the Algorithms Course. In Proceedings of the 10th Annual SIGCSE Conference on Innovation and Technology in Computer Science Education (ITiCSE '05). ACM, New York, NY, USA, 69--73.  ",
      "doi": "10.1145/1067445.1067468"
    },
    {
      "text": "Kwangsu Cho, Christian D. Schunn, and Davida Charney. 2006. Commenting on Writing Typology and Perceived Helpfulness of Comments from Novice Peer Reviewers and Subject Matter Experts. Written Communication 23, 3 (July 2006), 260--294.",
      "doi": ""
    },
    {
      "text": "Eric Cook, Stephanie D. Teasley, and Mark S. Ackerman. 2009. Contribution, commercialization & audience. In Proceedings of the ACM 2009 international conference on Supporting group work - GROUP '09. ACM Press, New York, New York, USA, 41.  ",
      "doi": "10.1145/1531674.1531681"
    },
    {
      "text": "E. M. Cramer and R. D. Bock. 1966. Multivariate Analysis. Review of Educational Research 36 (1966), 604--617. http://library.wur.nl/WebQuery/clc/1809603",
      "doi": ""
    },
    {
      "text": "Crowdflower. Crowdflower. (2016). https://crowdflower.com",
      "doi": ""
    },
    {
      "text": "Barbara De La Harpe, J. Fiona Peterson, Noel Frankham, Robert Zehner, Douglas Neale, Elizabeth Musgrave, and Ruth McDermott. 2009. Assessment Focus in Studio: What is Most Prominent in Architecture, Art and Design? International Journal of Art & Design Education 28, 1 (Feb. 2009), 37--51.",
      "doi": ""
    },
    {
      "text": "Steven Dow, Julie Fortuna, Dan Schwartz, Beth Altringer, Daniel Schwartz, and Scott Klemmer. 2011. Prototyping Dynamics: Sharing Multiple Designs Improves Exploration, Group Rapport, and Results. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2807--2816.  ",
      "doi": "10.1145/1978942.1979359"
    },
    {
      "text": "Steven Dow, Elizabeth Gerber, and Audris Wong. 2013. A Pilot Study of Using Crowds in the Classroom. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 227--236.  ",
      "doi": "10.1145/2470654.2470686"
    },
    {
      "text": "Steven Dow, Anand Kulkarni, Scott Klemmer, and Bjorn Hartmann. 2012. Shepherding the Crowd Yields Better Work. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 1013--1022.  ",
      "doi": "10.1145/2145204.2145355"
    },
    {
      "text": "Steven P. Dow, Kate Heddleston, and Scott R. Klemmer. 2009. The Efficacy of Prototyping Under Time Constraints. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (C&C '09). ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/1640233.1640260"
    },
    {
      "text": "Julie S. Downs, Mandy B. Holbrook, Steve Sheng, and Lorrie Faith Cranor. 2010. Are Your Participants Gaming the System?: Screening Mechanical Turk Workers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2399--2402.  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Edmund Burke Feldman. 1994. Practical Art Criticism. Pearson, Englewood Cliffs, N.J.",
      "doi": ""
    },
    {
      "text": "Christiane Fellbaum. 1998. WordNet: An Electronic Lexical Database. Bradford Books.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer, Kumiyo Nakakoji, Jonathan Ostwald, Gerry Stahl, and Tamara Sumner. 1993. Embedding Computer-based Critics in the Contexts of Design. In Proceedings of the INTERCHI '93 Conference on Human Factors in Computing Systems (INTERCHI '93). IOS Press, Amsterdam, The Netherlands, The Netherlands, 157--164. http://dl.acm.org/citation.cfm?id=164632.164891 ",
      "doi": "10.5555/164632.164891"
    },
    {
      "text": "Michael D. Greenberg, Matthew W. Easterday, and Elizabeth M. Gerber. 2015. Critiki: A Scaffolded Approach to Gathering Design Feedback from Paid Crowdworkers. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, New York, NY, USA, 235--244.  ",
      "doi": "10.1145/2757226.2757249"
    },
    {
      "text": "M.A. Hearst. 2000. The debate on automated essay grading. IEEE Intelligent Systems and their Applications 15, 5 (Sept. 2000), 22--37.  ",
      "doi": "10.1109/5254.889104"
    },
    {
      "text": "Tim Hesterberg, John M. Chambers, and Trevor J. Hastie. 1993. Statistical Models in S. Technometrics 35, 2 (may 1993), 227.",
      "doi": ""
    },
    {
      "text": "Catherine M. Hicks, Vineet Pandey, C. Ailie Fraser, and Scott Klemmer. 2016. Framing Feedback : Choosing Review Environment Features that Support High Quality Peer Assessment. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16. ACM Press, New York, New York, USA, 458--469.  ",
      "doi": "10.1145/2858036.2858195"
    },
    {
      "text": "Niklas Kilian, Markus Krause, Nina Runge, and Jan Smeddinck. 2012. Predicting Crowd-based Translation Quality with Language-independent Feature Vectors. In HComp'12 Proceedings of the AAAI Workshop on Human Computation. AAAI Press, Toronto, ON, Canada, 114--115. http://www.aaai.org/ocs/index.php/WS/AAAIW12/ paper/viewPDFInterstitial/5237/5611",
      "doi": ""
    },
    {
      "text": "J Peter Kincaid, Robert P Fishburne, Richard L Rogers, and Brad S Chissom. 1975. Derivation of New Readability Formulas (Automated Readability Index, Fog Count and Flesch Reading Ease Formula) for Navy Enlisted Personnel. Technical Report. Naval Technical Training Command, Naval Air Station Memphis-Millington, TN, USA. http://www.eric.ed.gov/ERICWebPortal/detail?accno=ED108134",
      "doi": ""
    },
    {
      "text": "Markus Krause. 2014. A behavioral biometrics based authentication method for MOOC's that is robust against imitation attempts. In Proceedings of the first ACM conference on Learning @ scale conference - L@S '14. ACM Press, Atlanta, GA, USA, 201--202.  ",
      "doi": "10.1145/2556325.2567881"
    },
    {
      "text": "Markus Krause. 2015a. A Method to automatically choose Suggestions to Improve Perceived Quality of Peer Reviews based on Linguistic Features. In HComp'15 Proceedings of the AAAI Conference on Human Computation: Works in Progress and Demonstration Abstracts. San Diego, CA, USA.",
      "doi": ""
    },
    {
      "text": "Markus Krause. 2015b. Bull-O-Meter : Predicting the Quality of Natural Language Responses. In HComp'15 Proceedings of the AAAI Conference on Human Computation: Works in Progress and Demonstration Abstracts. San Diego, CA, USA.",
      "doi": ""
    },
    {
      "text": "Markus Krause. 2015c. Stylometry-based Fraud and Plagiarism Detection for Learning at Scale. In Proceeding of the KSS Workshop'15. Karlsruhe, Germany.",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 1970. Estimating the Reliability, Systematic Error and Random Error of Interval Data. Educational and Psychological Measurement 30, 61 (1970), 61--70.",
      "doi": ""
    },
    {
      "text": "Chinmay Kulkarni, Koh Pang Wei, Huy Le, Daniel Chia, Kathryn Papadopoulos, Justin Cheng, Daphne Koller, and Scott R. Klemmer. 2013. Peer and Self Assessment in Massive Online Classes. ACM Trans. Comput.-Hum. Interact. 20, 6 (Dec. 2013), 33:1--33:31.  ",
      "doi": "10.1145/2505057"
    },
    {
      "text": "Chinmay E. Kulkarni, Michael S. Bernstein, and Scott R. Klemmer. 2015. PeerStudio: Rapid Peer Feedback Emphasizes Revision and Improves Performance. In Proceedings of the Second (2015) ACM Conference on Learning @ Scale - L@S '15. ACM Press, New York, New York, USA, 75--84.  ",
      "doi": "10.1145/2724660.2724670"
    },
    {
      "text": "Kurt Luther, Jari-Lee Tolentino, Wei Wu, Amy Pavel, Brian P. Bailey, Maneesh Agrawala, Bjorn Hartmann, and Steven P. Dow. 2015. Structuring, Aggregating, and Evaluating Crowdsourced Design Critique. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 473--485.  ",
      "doi": "10.1145/2675133.2675283"
    },
    {
      "text": "Jennifer Marlow and Laura Dabbish. 2014. From Rookie to All-star: Professional Development in a Graphic Design Social Networking Site. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 922--933.  ",
      "doi": "10.1145/2531602.2531651"
    },
    {
      "text": "LS Meyers, G Gamst, and AJ Guarino. 2006. Applied multivariate research: Design and interpretation. Sage Publishers, Thousand Oaks, CA, USA. http://scholar.google.com/scholar?hl=en",
      "doi": ""
    },
    {
      "text": "Geoff Norman. 2010. Likert scales, levels of measurement and the laws of statistics. Advances in Health Sciences Education 15, 5 (dec 2010), 625--632.",
      "doi": ""
    },
    {
      "text": "Melissa M. Patchan, Brandi Hawk, Christopher A. Stevens, and Christian D. Schunn. 2013. The effects of skill diversity on commenting and revisions. Instructional Science 41, 2 (mar 2013), 381--405.",
      "doi": ""
    },
    {
      "text": "Melissa M. Patchan and Christian D. Schunn. 2015. Understanding the benefits of providing peer feedback: how students respond to peers? texts of varying quality. Instructional Science 43, 5 (sep 2015), 591--614.",
      "doi": ""
    },
    {
      "text": "Mary L. Rucker and Stephanie Thomson. 2003. Assessing Student Learning Outcomes: An Investigation of the Relationship among Feedback Measures. College Student Journal 37, 3 (Sept. 2003), 400.",
      "doi": ""
    },
    {
      "text": "D. Royce Sadler. 1989. Formative assessment and the design of instructional systems. Instructional Science 18, 2 (June 1989), 119--144.",
      "doi": ""
    },
    {
      "text": "Christian Schunn, Amanda Godley, and Sara DeMartino. 2016. The Reliability and Validity of Peer Review of Writing in High School AP English Classes. Journal of Adolescent & Adult Literacy 60, 1 (jul 2016), 13--23.",
      "doi": ""
    },
    {
      "text": "Aaron D. Shaw, John J. Horton, and Daniel L. Chen. 2011. Designing Incentives for Inexpert Human Raters. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 275--284.  ",
      "doi": "10.1145/1958824.1958865"
    },
    {
      "text": "Mark D Shermis and Ben Hamner. 2013. Contrasting State-of-the-Art Automated Scoring of Essays: Analysis. Handbook of Automated Essay Evaluation: Current Applications and New Directions (2013), 313--346.",
      "doi": ""
    },
    {
      "text": "David Tinapple, Loren Olson, and John Sadauskas. 2013. CritViz: Web-based software supporting peer critique in large creative classrooms. Bulletin of the IEEE Technical Committee on Learning Technology 15, 1 (2013), 29. http://www.ieeetclt.org/issues/ january2013/Tinapple.pdf",
      "doi": ""
    },
    {
      "text": "Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. Getting the Right Design and the Design Right. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 1243--1252.  ",
      "doi": "10.1145/1124772.1124960"
    },
    {
      "text": "UpWork. UpWork. (2016). https://www.upwork.com/",
      "doi": ""
    },
    {
      "text": "Salvatore Valenti, Francesca Neri, and Alessandro Cucchiarelli. 2003. An overview of current research on automated essay grading. Journal of Information Technology Education 2 (2003). http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.101.5757",
      "doi": ""
    },
    {
      "text": "Anne Venables and Raymond Summit. 2003. Enhancing scientific essay writing using peer assessment. Innovations in Education and Teaching International 40, 3 (Aug. 2003), 281--290.",
      "doi": ""
    },
    {
      "text": "Wenting Xiong, Diane Litman, and Christian D Schunn. 2012. Natural Language Processing techniques for researching and improving peer feedback. Journal of Writing Research 4, 2 (2012), 155--176.",
      "doi": ""
    },
    {
      "text": "Wenting Xiong and Diane J. Litman. 2011. Understanding Differences in Perceived Peer-Review Helpfulness using Natural Language Processing. In IUNLPBEA '11 Proceedings of the 6th Workshop on Innovative Use of NLP for Building Educational Applications. Association for Computational Linguistics, Stroudsburg, PA, USA, 10--19. http://dl. acm.org/citation.cfm?id=2043132&picked=prox ",
      "doi": "10.5555/2043132.2043134"
    },
    {
      "text": "Anbang Xu and Brian Bailey. 2012. What Do You Think?: A Case Study of Benefit, Expectation, and Interaction in a Large Online Critique Community. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 295--304.  ",
      "doi": "10.1145/2145204.2145252"
    },
    {
      "text": "Anbang Xu, Shih-Wen Huang, and Brian Bailey. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-experts. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 1433--1444.  ",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Anbang Xu, Huaming Rao, Steven P. Dow, and Brian P. Bailey. 2015. A Classroom Study of Using Crowd Feedback in the Iterative Design Process. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1637--1648.  ",
      "doi": "10.1145/2675133.2675140"
    },
    {
      "text": "Alvin Yuan, Kurt Luther, Markus Krause, Sophie Vennix, Bjorn Hartmann, and Steven P. Dow. 2016. Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques. In The 19th ACM conference on Computer-Supported Cooperative Work and Social Computing (CSCW'16). to appear.  ",
      "doi": "10.1145/2818048.2819953"
    },
    {
      "text": "ZURB. Forrst. (2015). http://zurb.com/forrst",
      "doi": ""
    }
  ]
}