{
  "doi": "10.1145/3025453.3025538",
  "title": "Always On(line)?: User Experience of Smartwatches and their Role within Multi-Device Ecologies",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3557-3568",
  "year": 2017,
  "badges": [],
  "abstract": "Users have access to a growing ecosystem of devices (desktop, mobile and wearable) that can deliver notifications and help people to stay in contact. Smartwatches are gaining popularity, yet little is known about the user experience and their impact on our increasingly always online culture. We report on a qualitative study with existing users on their everyday use of smartwatches to understand both the added value and the challenges of being constantly connected at the wrist. Our findings show that users see a large benefit in receiving notifications on their wrist, especially in terms of helping manage expectations of availability. Moreover, we find that response rates after viewing a notification on a smartwatch change based on the other devices available: laptops prompt quicker replies than smartphones. Finally, there are still many costs associated with using smartwatches, thus we make a series of design recommendations to improve the user experience of smartwatches.",
  "authors": [
    {
      "name": "Marta E. Cecchinato",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81508705985/rel-imgonly/marta2.jpg",
      "acmid": "81508705985",
      "orcid": "0000-0002-0627-8658"
    },
    {
      "name": "Anna L. Cox",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81350567335/rel-imgonly/a.cox.png",
      "acmid": "81350567335",
      "orcid": "0000-0003-2231-2964"
    },
    {
      "name": "Jon Bird",
      "institution": "City University London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100566270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Yannick Bernaerts, Sebastiaan Steensels, and Jo Vermeulen. 2014. The Office Smartwatch: Development and Design of a Smartwatch App to Digitally Augment Interactions in an Office Environment. Proceedings of the 2014 companion publication on Designing interactive systems, 41--44.  ",
      "doi": "10.1145/2598784.2602777"
    },
    {
      "text": "Gerald Bieber, Thomas Kirste, and Bodo Urban. 2012. Ambient Interaction by Smart Watches. Proc. PETRA'12, 1--6.  ",
      "doi": "10.1145/2413097.2413147"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. ",
      "doi": ""
    },
    {
      "text": "Duncan P. Brumby, Anna L. Cox, and J Back. 2013. Recovering from an interruption: Investigating speedaccuracy tradeoffs in task resumption strategy. Journal of Experimental Psychology: Applied 19, 2: 95--107. ",
      "doi": ""
    },
    {
      "text": "Marta E. Cecchinato, Anna Cox, and Jon Bird. 2015. Smartwatches: The Good, the Bad and the Ugly? Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, 2133--2138.  ",
      "doi": "10.1145/2702613.2732837"
    },
    {
      "text": "Marta E. Cecchinato, Anna L Cox, and Jon Bird. 2014. \"I check my emails on the toilet\" Email Practices and Work-Home Boundary Management. MobileHCI 2014 Workshop on Socio-Technical Practices and WorkHome Boundaries.",
      "doi": ""
    },
    {
      "text": "Marta E Cecchinato, Anna L Cox, and Jon Bird. 2015. Working 9-5? Professional Differences in Email and Boundary Management Practices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3989--3998.",
      "doi": ""
    },
    {
      "text": "Sophie Charara. 2016. Semi-precious: The best smart jewellery. Retrieved September 7, 2016 from http://www.wareable.com/smart-jewellery/semi-precious-the-best-smart-jewelry-582",
      "doi": ""
    },
    {
      "text": "Xiang'Anthony Chen and Tovi Grossman. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 159--168.",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Anna Collinson. 2014. Blue ticks on WhatsApp: What they really mean. Retrieved September 7, 2016 from http://www.bbc.co.uk/newsbeat/article/29933261/blueticks-on-whatsapp-what-they-really-mean",
      "doi": ""
    },
    {
      "text": "Anna L Cox, Sandy Gould, Marta E. Cecchinato, Ioanna Iacovides, and Ian Renfree. 2016. Design Frictions for Mindful Interactions: The Case for Microboundaries. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, 1389--1397.",
      "doi": "10.1145/2851581.2892410"
    },
    {
      "text": "Sally Jo Cunningham and Matt Jones. 2005. Autoethnography: A tool for practice and education. Proceedings of the 6th ACM SIGCHI New Zealand chapter's international conference on Computer-human interaction, 1--8.  ",
      "doi": "10.1145/1073943.1073944"
    },
    {
      "text": "Joel E. Fischer, Chris Greenhalgh, and Steve Benford. 2011. Investigating episodes of mobile phone activity as indicators of opportune moments to deliver notifications. Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, 181--190.  ",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Nicola Fumo. 2016. Why Women Aren't Buying Smartwatches. Retrieved September 7, 2016 from http://www.racked.com/2016/1/12/10750446/smartwatches-women-apple-huawei-jawbone",
      "doi": ""
    },
    {
      "text": "Patricia I. Fusch and Lawrence R. Ness. 2015. Are we there yet? Data saturation in qualitative research. The Qualitative Report 20, 9: 1408--1416.",
      "doi": ""
    },
    {
      "text": "W. C. W. Giang, L. Hoekstra-Atwood, and B. Donmez. 2014. Driver Engagement in Notifications: A Comparison of Visual-Manual Interaction between Smartwatches and Smartphones. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 58, 1: 2161--2165. ",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Nadia Berthouze, Paul Marshall, and Jon Bird. 2014. Tracking physical activity: problems related to running longitudinal studies with commercial devices. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing Adjunct Publication, 699--702.  ",
      "doi": "10.1145/2638728.2641320"
    },
    {
      "text": "Daniel Harrison and Marta E. Cecchinato. \"Give me five minutes!\" Feeling Time Slip By. Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers, 45--48.  ",
      "doi": "10.1145/2800835.2800858"
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Bianchi-Berthouze, and Jon Bird. 2015. Activity Tracking Barriers, Workarounds, and Customisation. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 617--621.  ",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WatchConnect. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1247--1256.  ",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "IFTTT. If This Then That. Retrieved September 19, 2016 from https://ifttt.com/",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and Awareness: A Field Study of Alert Usage and Preferences. Proceedings of the 2010 ACM conference on Computer supported cooperative work, 27--30.  ",
      "doi": "10.1145/1718918.1718926"
    },
    {
      "text": "Tero Jokela, P O Box, Thomas Olsson, and P O Box. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3903--3912.",
      "doi": "10.1145/2702123.2702211"
    },
    {
      "text": "Haje Jan Kamps. Latest Pebble campaign snags third-most-funded slot on Kickstarter. Retrieved September 7, 2016 from https://techcrunch.com/2016/06/30/pebblekickstarter/",
      "doi": ""
    },
    {
      "text": "Ville Mäkelä and Jennifer Marlow. 2016. MixMeet Wear: Live Meetings at a Glance. Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion, 9--12.",
      "doi": ""
    },
    {
      "text": "Gloria J. Mark, Stephen Voida, and Armand V. Cardello. 2012. \"A Pace Not Dictated by Electrons\": An Empirical Study of Work Without Email. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 555--564.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Jeffrey Pierce, Harry Road, San Jose, and John Tang. 2009. No smartphone is an island: the impact of places, situation and other device on smart phone use. IBM RJ10452. 10452, 1--10.",
      "doi": ""
    },
    {
      "text": "Melissa Mazmanian and Ingrid Erickson. 2014. The product of availability: understanding the economic underpinnings of constant connectivity. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 763--772.  ",
      "doi": "10.1145/2556288.2557381"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People's Receptivity to Mobile Notifications. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems: 1021--1032.  ",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E. Blandford. 2014. Gaining empathy for non-routine mobile device use through autoethnography. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 987--990.  ",
      "doi": "10.1145/2556288.2557179"
    },
    {
      "text": "Antti Oulasvirta, Renaud Petit, Mika Raento, and Tiitta Sauli. 2007. Interpreting and Acting on Mobile Awareness Cues. Human-Computer Interaction 22, October 2012: 97--135.",
      "doi": "10.5555/1466595.1466599"
    },
    {
      "text": "Leslie A. Perlow. 1999. The time famine: Toward a sociology of work time. Administrative Science Quarterly 44, 1: 57--81. ",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Karen Church, and Rodrigo De Oliveira. 2014. An In-Situ Study of Mobile Phone Notifications. Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services, 233--242  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Martin Pielot and Luz Rello. 2015. The Do Not Disturb Challenge: A Day Without Notifications. Extended Abstracts of the ACM CHI'15 Conference on Human Factors in Computing Systems 2: 1761--1766.  ",
      "doi": "10.1145/2702613.2732704"
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in vivo. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 5456--5469.  ",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Henning Pohl, Justyna Medrek, and Michael Rohs. 2016. ScatterWatch: Subtle Notifications via Indirect Illumination Scattered in the Skin. Proceedings of the 18th international conference on Human-computer interaction with mobile devices and services companion.  ",
      "doi": "10.1145/2935334.2935351"
    },
    {
      "text": "Thijs Roumen, Simon T. Perrault, and Shengdong Zhao. 2015. NotiRing: A Comparative Study of Notification Channels for Wearable Interactive Rings. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2497--2500.  ",
      "doi": "10.1145/2702123.2702350"
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale assessment of mobile notifications. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 3055--3064.  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Steven Schirra and Frank R. Bentley. 2015. \"It's kind of like an extra screen for my phone\" Understanding Everyday Uses of Consumer Smartwatches. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, 2151--2156.  ",
      "doi": "10.1145/2702613.2732931"
    },
    {
      "text": "Alireza Sahami Shirazi and Niels Henze. 2015. Assessment of Notifications on Smartwatches. Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, 1111--1116.  ",
      "doi": "10.1145/2786567.2794338"
    },
    {
      "text": "Statista. 2014. Global smart watch unit shipments from 2014 to 2019. Retrieved September 7, 2016 from http://www.statista.com/statistics/525848/global-smartwatch-shipments/",
      "doi": ""
    },
    {
      "text": "The NPD Group. 2015. The Demographic Divide: Fitness Trackers and Smartwatches Attracting Very Different Segments of the Market. Retrieved September 7, 2016 from http://bit.ly/1IRegAj",
      "doi": ""
    },
    {
      "text": "Ofir Turel and Alexander Serenko. 2010. Is mobile email addiction overlooked? Communications of the ACM 53, 5: 41.",
      "doi": "10.1145/1735223.1735237"
    },
    {
      "text": "Cheng Xu and Kent Lyons. 2015. Shimmering Smartwatches: Exploring the Smartwatch Design Space. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14, 69--76.",
      "doi": "10.1145/2677199.2680599"
    }
  ]
}