{
  "doi": "10.1145/3025453.3025864",
  "title": "How Methods Make Designers",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "472-483",
  "year": 2017,
  "badges": [],
  "abstract": "Through their combination of lifestyle and method, Silicon Valley models for tech production such as design thinking, startup incubators, lean management, etc. are spreading across the globe. These paradigms are positioned by product designers, politicians, investors and corporations alike as replicable routes to individual and national empowerment. They are portrayed as universal templates, portable across national borders and applicable to local needs. We draw from our ethnographic engagements with tech entrepreneurial efforts in Ghana, China, and Jamaica to unpack the stakes involved in their uptake, showing that while local actors produce situated alternatives, their work nevertheless often results in a continued valorization of these seemingly universal methods. We argue that design methods shape not only use practices, but have consequences for the life worlds of professional designers. This includes how they impact personal and national identities, confer legitimacy in transnational innovation circles, and secure access to social and economic resources. Ultimately, we call for an inclusion of these factors in ongoing conversations about design and design methods.",
  "authors": [
    {
      "name": "Seyram Avle",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019835",
      "orcid": "missing"
    },
    {
      "name": "Silvia Lindtner",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343499217",
      "orcid": "0000-0002-8780-6087"
    },
    {
      "name": "Kaiton Williams",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640458",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Seyram Avle. 2014. Articulating and enacting development: Skilled returnees in Ghana's ICT industry. Information Technologies & International Development 10(4), 1--13.",
      "doi": ""
    },
    {
      "text": "Seyram Avle and Silvia Lindtner. 2016. Design(ing) \"here\" and \"there\": Tech Entrepreneurs, Global Markets, and Reflexivity in Design Processes. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 2233 - 2245.  ",
      "doi": "10.1145/2858036.2858509"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1301--1310. DOI=http://dx.doi.org/10.1145/1753326.1753521  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 675--684. DOI=http://dx.doi.org/10.1145/1978942.1979041  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Susanna Bodker. 2006. When second wave HCI meets third wave challenges. In proceedings of NordiCHI '06.",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Nellie Bowles. 2015. The real teens of Silicon Valley. The CA Sunday Magazine. Retrieved from https://stories.californiasunday.com/2015-06-07/realteenagers-silicon-valley",
      "doi": ""
    },
    {
      "text": "David Buckingham. 2015. Why children should NOT be taught to code. David Buckingham.net Retrieved from https://davidbuckingham.net/2015/07/13/whychildren-should-not-be-taught-to-code/",
      "doi": ""
    },
    {
      "text": "Anita Chan. 2014. Networking Peripheries. Technological Futures and the Myth of Digital Universalism. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Michael Costello. 1997. Occupational multiplicity and rural development patterns in the Third World. Philippine Sociological Review.",
      "doi": ""
    },
    {
      "text": "Michael Curtin and Kevin Sanson. 2016. Precarious creativity. University of CA Press.",
      "doi": ""
    },
    {
      "text": "Jerry Davis. 2016. The vanishing American corporation: Navigating the hazards of a new economy. Berrett-Koehler.",
      "doi": ""
    },
    {
      "text": "Greig De Peuter. 2011. Creative economy and labor precarity a contested convergence.\" Journal of communication inquiry 35.4, 417--425. ",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Scott D. Mainwaring. 2012. Ubicomp's Colonial Impulse. In Proceedings. of UbiComp'12, Springer, 133--142.  ",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Carla Freeman. 2014. Entrepreneurial Selves: Neoliberal Respectability and the Making of a Caribbean Middle Class. Duke University Press",
      "doi": ""
    },
    {
      "text": "Carla Freeman. 2000. High Tech and High Heels In the Global Economy: Women, Work, and Pink-collar Identities In the Caribbean. Duke University Press. ",
      "doi": ""
    },
    {
      "text": "Forlano, Laura and Anijo Mathew. 2014. \"From Design Fiction to Design Friction: Speculative and Participatory Design of Values-Embedded Urban Technology.\" Journal of Urban Technology 21(4):7-- 24. ",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 937946. DOI: http://dx.doi.org/10.1145/2207676.2208538  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Matt Haber. \"For Some Men, Mark Zuckerberg Is a Lifestyle Guru.\" 2016. Retrieved September 21 2016 from http://www.nytimes.com/2016/02/28/fashion/mensstyle/mark-zuckerberg-lifestyle-guru.html",
      "doi": ""
    },
    {
      "text": "Lilly Irani. 2015. \"Hackathons and the Making of Entrepreneurial Citizenship.\" Science, Technology & Human Values 1--26. ",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Paul Dourish, Melissa Mazmanian. 2010. Shopping for sharpies in Seattle. Mundane Infrastructures of Transnational Design. In Proc. of ICIC'10.  ",
      "doi": "10.1145/1841853.1841860"
    },
    {
      "text": "Lily Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Sheila Jasanoff. 2004. States of knowledge: the coproduction of science and the social order. Routledge. ",
      "doi": ""
    },
    {
      "text": "Michael Keane. 2007. Created in China: the Great New Leap Forward, London: Routledge.",
      "doi": ""
    },
    {
      "text": "Lee, M., Nam, T., Lee, Y., Row, Y., Lim, Y., Kim, D., Seok, J., Odom, W., Zimmerman, J., Forlizzi, J., Higuera, A., Marchitto, M., Canas, J., Moore, H. 2013. Bridging Research and Practice in Design: Reflections of the Project on Value Construction with Virtual Possessions. In proceedings of 5th International Congress of International Association of Societies of Design Research. Tokyo, Japan. IASDR '13",
      "doi": ""
    },
    {
      "text": "Emma Lewis. Jammin', Digitally: The Mentor. 2014. Retrieved September 21 2016 from https://petchary.wordpress.com/2014/02/07/jammindigitally-the-mentor/",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell and Jeffrey Bardzell. 2016. Reconstituting the utopian vision of making: HCI after technosolutionism. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems (CHI '16), CHI '16, 1390 - 1402.  ",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Silvia Lindtner. 2014. Hackerspaces and Internet of Things in China: How Makers are reinventing Industrial Production, Innovation & the Self. Journal of China Information, Special Issue on \"Political Contestation in Chinese Digital Spaces\" (ed. Guobin Yang), Vol. 28, No. 2, pp. 145--167.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Anna Greenspan, David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturers and Maker Entrepreneurs. In Proc. of Aarhus Series of Human Centered Computing, [S.I.}, v.1, n.1, p.12.",
      "doi": "10.7146/aahcc.v1i1.21265"
    },
    {
      "text": "Lindtner, S., Anderson, K., Dourish, P. 2012. Cultural Appropriation: Information Technologies as Sites of Transnational Imagination. Proc. ACM Conf. ComputerSupported Cooperative Work CSCW 2012 (Seattle, WA), 7786.",
      "doi": ""
    },
    {
      "text": "Isabell Lorey. 2015. State of Insecurity. Verso, London.",
      "doi": ""
    },
    {
      "text": "Lukens, Jonathan and Carl Disalvo. 2011. \"Speculative Design and Technological Fluency.\" International Journal of Learning and Media 3(4):23--40. ",
      "doi": ""
    },
    {
      "text": "George Marcus. 1995. Ethnography in/of the World System: The Emergence of Multi-sited Ethnography. Annu. Rev. Anthropol. 24:95--117. ",
      "doi": ""
    },
    {
      "text": "Angela McRobbie. 2016. Be Creative: Making a Living in the New Culture Industries. Polity Press.",
      "doi": ""
    },
    {
      "text": "Bill Maurer. 2001. Recharting the Caribbean. Univ of Michigan Press.",
      "doi": ""
    },
    {
      "text": "Bill Maurer. 2001. Islands in the Net: Rewiring Technological and Financial Circuits in the \"Offshore\" Caribbean. Comparative Studies in Society and History 43, 3, 467--501.",
      "doi": ""
    },
    {
      "text": "Beverley Mullings. 2004. Globalization and the territorialization of the new Caribbean service economy. Journal of Economic Geography, 4(3), 275-- 298. ",
      "doi": ""
    },
    {
      "text": "Gina Neff. 2012. Venture Labor. Work and the Burden of Risk in Innovation Industries. Cambridge, MA: MIT Press. ",
      "doi": ""
    },
    {
      "text": "Justin O'Connor. 2012. Shanghai Modern: Replaying Futures Past. Culture Unbound: Journal of Current Cultural Research, Vol 4, 15--34. ",
      "doi": ""
    },
    {
      "text": "Odom, W., Zimmerman, J., Forlizzi, J. (2011). Teenagers and Their Virtual Possessions: Design Opportunities and Issues. In proceedings of SIGCHI Conference on Human Factors in Computing Systems. Vancouver, Canada. CHI '11. ACM Press, 1491--1500.  ",
      "doi": "10.1145/1978942.1979161"
    },
    {
      "text": "Planning Institute of Jamaica. 2009. Vision 2030 Jamaica: National Development Plan. Planning Institute of Jamaica.",
      "doi": ""
    },
    {
      "text": "AnnaLee Saxenian 1996. Regional advantage. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "AnnaLee Saxenian. 2005. \"From brain drain to brain circulation: Transnational communities and regional upgrading in India and China.\" Studies in comparative international development 40.2 (2005): 35--61. ",
      "doi": ""
    },
    {
      "text": "AnnaLee Saxenian. 2007. The new argonauts: Regional advantage in a global economy. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility ACM, http://dx.doi.org/10.1145/1094562.1094569  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Alex Taylor. 2011. Out there. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'11), pp. 685--694.  ",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "The State Council. The People's Republic of China. 2015. Guideline to boost entrepreneurship and innovation. Source: http://english.gov.cn/policies/latest_releases/2015/03/1 1/content_281475069667730.htm, last accessed January 2017",
      "doi": ""
    },
    {
      "text": "Amanda Williams, Silvia Lindtner, Ken Anderson, Paul Dourish. 2013. Multi-sited Design: an Analytical Lens for Transnational HCI. Human-Computer Interaction, Vol. 29:1, 78--108.  ",
      "doi": "10.1080/07370024.2013.823819"
    },
    {
      "text": "The World Bank. Silicon Valley Casts Its Nets in the Caribbean. 2014. Retrieved September 21 2016 from http://www.worldbank.org/en/news/feature/2014/ 01/07/silicon-valley-casts-nets-in-caribbean",
      "doi": ""
    },
    {
      "text": "The World Bank. 2015. Tech hubs across Africa: Which will be the legacy-makers? The World Bank IC4D blog. Retrieved from http://blogs.worldbank.org/ic4d/tech-hubs-acrossafrica-which-will-be-legacy-makers",
      "doi": ""
    },
    {
      "text": "Fan Yang. 2015. Faked in China. Nation Branding, Counterfeit Culture, and Globalization. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 493--502. DOI http://dx.doi.org/10.1145/1240624.1240704  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}