{
  "doi": "10.1145/3025453.3025854",
  "title": "The Game of Performing Play: Understanding Streaming as Cultural Production",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4863-4874",
  "year": 2017,
  "badges": [],
  "abstract": "Live streaming has become pervasive in digital game culture. Previous work has focused largely on technological considerations in streaming platforms. However, little is known about how streamers enter the practice, gain skills, and operate as content producers. We present a qualitative study of an online forum dedicated to streaming. By observing the conversations between veterans and newcomers to the practice, we develop an understanding of how streamers must tie together technological, social, and gameplay-based skills to craft an appealing performance of play. We find that a key skill in streaming is the development of a unique attitude and persona as a gamer, which permeates into every element of a streamer's performance. As individual identity becomes important in streaming practice, design considerations for platform features such as community moderation and stream metrics may help improve equitable participation in this increasingly important aspect of game culture.",
  "authors": [
    {
      "name": "Anthony J. Pellicone",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019423",
      "orcid": "missing"
    },
    {
      "name": "June Ahn",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160734",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pierre Bourdieu and Loïc Wacquant. 1992. An invitation to reflexive sociology. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Benjamin Burroughs and Paul Rama. 2015. The eSports trojan horse: Twitch and streaming futures. Virtual Worlds Research 8, 2: 1--4.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. Sage, London; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Gifford Cheung and Jeff Huang. 2011. Starcraft from the stands: Understanding the game spectator. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 763 (CHI '11), 763-- 772.  ",
      "doi": "10.1145/1978942.1979053"
    },
    {
      "text": "Mia Consalvo. 2012. Confronting toxic gamer culture: A challenge for feminist game studies scholars. ADA: A Journal of Gender, New Media and Technology 1. Retrieved from http://adanewmedia.org/2012/11/issue1-consalvo/",
      "doi": ""
    },
    {
      "text": "Juliet M. Corbin and Anselm L. Strauss. 2008. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage Publications, Inc, Los Angeles, Calif.",
      "doi": ""
    },
    {
      "text": "Garry Crawford. 2012. Video gamers. Routledge, London?; New York.",
      "doi": ""
    },
    {
      "text": "John W. Creswell. 2013. Qualitative inquiry and research design: Choosing among five approaches. SAGE Publications, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Jon Dovey and Helen Kennedy. 2006. Game cultures: Computer games as new media. Open University Press, Maidenhead, Berkshire, England?; New York, NY.",
      "doi": ""
    },
    {
      "text": "James Gee. 2004. Situated language and learning: A critique of traditional schooling. Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "James Gee and Elizabeth Hayes. 2012. Nurturing affinity spaces and game-based learning. In Games, learning, and society: Learning and meaning in the digital age, Constance Steinkuehler, Kurt Squire and Sasha A. Barab (eds.). Cambridge University Press, Cambridge, 129--153.",
      "doi": ""
    },
    {
      "text": "Chris Georgsen. 2015. Well played & well watched: Dota 2, 167 spectatorship, and eSports. Well Played 4, 1: 167--179.",
      "doi": ""
    },
    {
      "text": "Michael Grenfell (ed.). 2008. Pierre Bourdieu: Key concepts. Acumen, Stocksfield.",
      "doi": ""
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: Fostering participatory communities of play within live mixed media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1315--1324.  ",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "B. Hutchins. 2008. Signs of meta-change in second modernity: The growth of e-sport and the World Cyber Games. New Media & Society 10, 6: 851--869.",
      "doi": ""
    },
    {
      "text": "Jesper Juul. 2010. A casual revolution: Reinventing video games and their players. MIT Press, Cambridge, Mass.; London. ",
      "doi": "10.5555/1667100"
    },
    {
      "text": "Mehdi Kaytoue, Arlei Silva, Loïc Cerf, Wagner Meira, and Chedy Raïssi. 2012. Watch me playing, i am a professional: A first study on video game live streaming. In Proceedings of the 21st International Conference on World Wide Web Pages (WWW '12), 1181--1188.  ",
      "doi": "10.1145/2187980.2188259"
    },
    {
      "text": "Graeme Kirkpatrick. 2013. Computer games and the social imaginary. Polity, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Robert V. Kozinets. 2010. Netnography: Ethnographic research in the age of the internet. Sage Publications Ltd, Thousand Oaks, CA. ",
      "doi": "10.5555/1823232"
    },
    {
      "text": "Esther MacCallum-Stewart. 2012. \"You No Take Candle\". Online games as different social spaces. In Online Gaming in Context: The Social and Cultural Significance of Online Games, Garry Crawford and Ben Light (eds.). Routledge, London.",
      "doi": ""
    },
    {
      "text": "Randy Nichols. 2013. Bourdieu's forms of captial and video game production. In The game culture reader, Jason Thompson and Marc Ouellette (eds.). Cambridge Scholars, Newcastle, 30--47.",
      "doi": ""
    },
    {
      "text": "Anthony Pellicone and June Ahn. 2015. Building worlds: A connective ethnography of play in Minecraft. Games and Culture. Published online before print.",
      "doi": ""
    },
    {
      "text": "Rui Pan, Lyn Bartram, and Carman Neustaedter. 2016. TwitchViz: A Visualization Tool for Twitch Chatrooms. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI '16), 1959--1965.  ",
      "doi": "10.1145/2851581.2892427"
    },
    {
      "text": "Hector Postigo. 2014. The socio-technical architecture of digital labor: Converting play into YouTube money. New Media & Society.",
      "doi": ""
    },
    {
      "text": "Quantcast. 2016. Twitch.tv traffic and demographics. Retrieved March 16, 2016 from https://www.quantcast.com/twitch.tv#demographicsCard",
      "doi": ""
    },
    {
      "text": "George Ritzer. 2000. Modern sociological theory. McGraw Hill, Boston.",
      "doi": ""
    },
    {
      "text": "Anita Sarkeesian and Katherine Cross. 2015. Your humanity is in another castle: Terror dreams and the harassment of women. In The State of Play: Creators and Critics on Video Game Culture, Daniel Goldberg and Linus Larsson (eds.). Seven Stories Press, New York City, 103--126.",
      "doi": ""
    },
    {
      "text": "Thomas Smith, Marianna Obrist, and Peter Wright. 2013. Live-streaming changes the (video) game. In Proceedings of the 11th european conference on Interactive TV and video (EITV '13), 131.  ",
      "doi": "10.1145/2465958.2465971"
    },
    {
      "text": "David Swartz. 1997. Culture & power: the Sociology of Pierre Bourdieu. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "T.L. Taylor. 2012. Raising the stakes: E-sports and the professionalization of computer gaming. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/2209770"
    },
    {
      "text": "Helen Thornham. 2011. Ethnographies of the videogame: Gender, narrative and praxis. Ashgate Pub. Company, Farnham, Surrey, England?; Burlington, VT.",
      "doi": ""
    },
    {
      "text": "Twitch.tv. 2016. Twitch.tv: Partnership Frequently Asked Questions. Retrieved September 21, 2016 from https://www.twitch.tv/p/partnerfaq",
      "doi": ""
    },
    {
      "text": "Austin Walker. 2014. Watching us play: Postures and platforms of live streaming. Surveillance and Society 12, 3: 437--442.",
      "doi": ""
    },
    {
      "text": "Jen Webb, Tony Schirato, and Geoff Danaher. 2002. Understanding bourdieu. SAGE Publications, London?; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Christopher Zoia. 2014. This Guy Makes Millions Playing Video Games on YouTube. The Atlantic. Retrieved November 24, 2015 from http://www.theatlantic.com/business/archive/2014/03/this-guy-makes-millions-playing-video-games-onyoutube/284402/",
      "doi": ""
    }
  ]
}