{
  "doi": "10.1145/3025453.3025937",
  "title": "Extracting Gait Velocity and Stride Length from Surrounding Radio Signals",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2116-2126",
  "year": 2017,
  "badges": [],
  "abstract": "Gait velocity and stride length are critical health indicators for older adults. A decade of medical research shows that they provide a predictor of future falls, hospitalization, and functional decline among seniors. However, currently these metrics are measured only occasionally during medical visits. Such infrequent measurements hamper the opportunity to detect changes and intervene early in the impairment process. In this paper, we develop a sensor that uses radio signals to continuously measure gait velocity and stride length at home. Our sensor hangs on a wall like a picture frame. It does not require the monitored person to wear or carry a device on her body. Our approach builds on recent advances in wireless systems which have shown that one can locate people based on how their bodies impact the surrounding radio signals. We demonstrate the accuracy of our method by comparing it to the gold standard in clinical tests, and the VICON motion tracking system. Our experience from deploying the sensor in 14 homes indicates comfort with the technology and a high acceptance rate.",
  "tags": [
    "stride length",
    "continuous monitoring",
    "device-free sensing",
    "gait velocity",
    "wireless sensing"
  ],
  "authors": [
    {
      "name": "Chen-Yu Hsu",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-99658756848/rel-imgonly/chen-yu_small.png",
      "acmid": "99658756848",
      "orcid": "missing"
    },
    {
      "name": "Yuchen Liu",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161787",
      "orcid": "missing"
    },
    {
      "name": "Zachary Kabelac",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88158948057",
      "orcid": "missing"
    },
    {
      "name": "Rumen Hristov",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162648",
      "orcid": "missing"
    },
    {
      "name": "Dina Katabi",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100360141/rel-imgonly/81100360141.jpg",
      "acmid": "81100360141",
      "orcid": "missing"
    },
    {
      "name": "Christine Liu",
      "institution": "Boston University School of Medicine, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163453",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. A Profile of Older Americans. http://www.aoa.acl.gov/aging_statistics/profile/2015/docs/2015-Profile.pdf. (2015). Administration on Aging and Administration for Community Living, U.S. Department of Health and Human Services.",
      "doi": ""
    },
    {
      "text": "2016. GAIRite. http://www.gaitrite.com/. (2016).",
      "doi": ""
    },
    {
      "text": "2016. VICON T-Series. http://www.vicon.com. (2016).",
      "doi": ""
    },
    {
      "text": "Fadel Adib, Chen-Yu Hsu, Hongzi Mao, Dina Katabi, and Frédo Durand. 2015a. Capturing the human figure through a wall. ACM Transactions on Graphics (TOG) 34, 6 (2015), 219.",
      "doi": "10.1145/2816795.2818072"
    },
    {
      "text": "Fadel Adib, Zachary Kabelac, and Dina Katabi. 2015b. Multi-person localization via RF body reflections. In 12th USENIX Symposium on Networked Systems Design and Implementation (NSDI 15). 279--292.",
      "doi": "10.5555/2789770.2789790"
    },
    {
      "text": "Fadel Adib, Zach Kabelac, Dina Katabi, and Robert C Miller. 2014. 3D tracking via body radio reflections. In 11th USENIX Symposium on Networked Systems Design and Implementation (NSDI 14). 317--329.",
      "doi": "10.5555/2616448.2616478"
    },
    {
      "text": "Fadel Adib and Dina Katabi. 2013. See through walls with wifi! In ACM SIGCOMM (2013). ACM.",
      "doi": ""
    },
    {
      "text": "Fadel Adib, Hongzi Mao, Zachary Kabelac, Dina Katabi, and Robert C. Miller. 2015. Smart homes that monitor breathing and heart rate. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI 15). ACM, 837--846.  ",
      "doi": "10.1145/2702123.2702200"
    },
    {
      "text": "A. Biderman, J. Cwikel, A. V. Fried, and D. Galinsky. 2002. Depression and falls among community dwelling elderly people: a search for common risk factors. Journal of Epidemiology and Community Health 56, 8 (2002), 631--636. ",
      "doi": ""
    },
    {
      "text": "Bor-rong Chen. 2011. LEGSys: wireless gait evaluation system using wearable sensors. In Proceedings of the 2nd Conference on Wireless Health. ACM, 20.",
      "doi": ""
    },
    {
      "text": "Stacy Fritz and Michelle Lusardi. 2009. White paper: \"walking speed: the sixth vital sign\". Journal of geriatric physical therapy 32, 2 (2009), 2--5. ",
      "doi": ""
    },
    {
      "text": "Hulya Gokalp and Malcolm Clarke. 2013. Monitoring activities of daily living of the elderly and the potential for its use in telecare and telehealth: A review. TELEMEDICINE and e-HEALTH 19, 12 (2013), 910--923. ",
      "doi": ""
    },
    {
      "text": "Stuart Hagler, Daniel Austin, Tamara L. Hayes, Jeffrey Kaye, and Misha Pavel. 2010. Unobtrusive and ubiquitous in-home monitoring: a methodology for continuous assessment of gait velocity in elders. IEEE transactions on biomedical engineering 57, 4 (2010), 813--820. ",
      "doi": ""
    },
    {
      "text": "Raul Igual, Carlos Medrano, and Inmaculada Plaza. 2013. Challenges, issues and trends in fall detection systems. Biomedical engineering online 12, 1 (2013), 1.",
      "doi": ""
    },
    {
      "text": "Kiran Joshi, Dinesh Bharadia, Manikanta Kotaru, and Sachin Katti. 2015. Wideo: Fine-grained device-free motion tracing using rf backscatter. In 12th USENIX Symposium on Networked Systems Design and Implementation (NSDI 15). 189--204.",
      "doi": ""
    },
    {
      "text": "Craig Karpman, Nathan K. LeBrasseur, Zachary S. DePew, Paul J. Novotny, and Roberto P. Benzo. 2013. Measuring gait speed in the outpatient clinic: methodology and feasibility. Respiratory care (2013), respcare-02688.",
      "doi": ""
    },
    {
      "text": "Jeffrey Kaye, Nora Mattek, Hiroko Dodge, Teresa Buracchio, Daniel Austin, Stuart Hagler, Michael Pavel, and Tamara Hayes. 2012. One walk a year to 1000 within a year: Continuous in-home unobtrusive gait assessment of older adults. Gait & posture 35, 2 (2012), 197--202. ",
      "doi": ""
    },
    {
      "text": "William D Kearns, James L. Fozard, Marion Becker, Jan M. Jasiewicz, Jeffrey D. Craighead, Lori Holtsclaw, and Charles Dion. 2012. Path tortuosity in everyday movements of elderly persons increases fall prediction beyond knowledge of fall history, medication use, and standardized gait and balance assessments. Journal of the American Medical Directors Association 13, 7 (2012), 665--e7.",
      "doi": ""
    },
    {
      "text": "Youngwook Kim and Hao Ling. 2009. Human activity classification based on micro-Doppler signatures using a support vector machine. IEEE Transactions on Geoscience and Remote Sensing 47, 5 (2009), 1328--1337. ",
      "doi": ""
    },
    {
      "text": "Samantha S. C. Kon, Sarah E. Jones, Susie J. Schofield, Winston Banya, Mandy J. Dickson, Jane L. Canavan, Claire M. Nolan, Brigitte M. Haselden, Michael I. Polkey, Paul Cullinan, and others. 2015. Gait speed and readmission following hospitalisation for acute exacerbations of COPD: a prospective study. Thorax 70, 12 (2015), 1131--1137. ",
      "doi": ""
    },
    {
      "text": "H.-K. Kuo, Suzanne G. Leveille, Y.-H. Yu, and William P. Milberg. 2006. Cognitive function, habitual gait speed, and late-life disability in the National Health and Nutrition Examination Survey (NHANES) 1999-2002. Gerontology 53, 2 (2006), 102--110. ",
      "doi": ""
    },
    {
      "text": "Nancy G. Kutner, Rebecca Zhang, Yijian Huang, and Patricia Painter. 2015. Gait speed and mortality, hospitalization, and functional status change among hemodialysis patients: A US renal data system special study. American Journal of Kidney Diseases 66, 2 (2015), 297--304. ",
      "doi": ""
    },
    {
      "text": "Hong Li, Wei Yang, Yang Xu, Jianxin Wang, and Liusheng Huang. 2016. WiCare: A Synthesized Healthcare Service System Based on WiFi Signals. 557--565.",
      "doi": ""
    },
    {
      "text": "Michelle M. Lusardi. 2012. Using walking speed in clinical practice: interpreting age-, gender-, and function-specific norms. Topics in Geriatric Rehabilitation 28, 2 (2012), 77--90. ",
      "doi": ""
    },
    {
      "text": "Grégoire Malandain and Jean-Daniel Boissonnat. 2002. Computing the diameter of a point set. International Journal of Computational Geometry & Applications 12, 06 (2002), 489--509. ",
      "doi": ""
    },
    {
      "text": "Kirsten Meyer. 2010. Gait Speed as a Fall Predictor for Elderly Patients in Rehabilitation. (2010).",
      "doi": ""
    },
    {
      "text": "Addie Middleton, Stacy L. Fritz, and Michelle Lusardi. 2015. Walking speed: the functional vital sign. Journal of aging and physical activity 23, 2 (2015), 314.",
      "doi": ""
    },
    {
      "text": "Nancye M. Peel, Suzanne S. Kuys, and Kerenaftali Klein. 2013. Gait speed as a measure in geriatric assessment in clinical settings: a systematic review. The Journals of Gerontology Series A: Biological Sciences and Medical Sciences 68, 1 (2013), 39--46. ",
      "doi": ""
    },
    {
      "text": "Subashan Perera, Samir H. Mody, Richard C. Woodman, and Stephanie A. Studenski. 2006. Meaningful change and responsiveness in common physical performance measures in older adults. Journal of the American Geriatrics Society 54, 5 (2006), 743--749. ",
      "doi": ""
    },
    {
      "text": "Giovanni Pulignano, Donatella Del Sindaco, Andrea Di Lenarda, Gianfranco Alunni, Michele Senni, Luigi Tarantini, Giovanni Cioffi, Maria Denitza Tinti, Giulia Barbati, Giovanni Minardi, and others. 2016. Incremental value of gait speed in predicting prognosis of older adults with heart failure: insights from the IMAGE-HF study. JACC: Heart Failure 4, 4 (2016), 289--298. ",
      "doi": ""
    },
    {
      "text": "Y. Schoon, K. Bongers, J. Van Kempen, R. Melis, and Rikkert M. Olde. 2014. Gait speed as a test for monitoring frailty in community-dwelling older people has the highest diagnostic value compared to step length and chair rise time. European journal of physical and rehabilitation medicine 50, 6 (2014), 693--701.",
      "doi": ""
    },
    {
      "text": "Robert Steele, Amanda Lo, Chris Secombe, and Yuk Kuen Wong. 2009. Elderly person's perception and acceptance of using wireless sensor networks to assist healthcare. International journal of medical informatics 78, 12 (2009), 788--801. ",
      "doi": ""
    },
    {
      "text": "Erik Stone and Marjorie Skubic. 2011. Evaluation of an inexpensive depth camera for in-home gait assessment. Journal of Ambient Intelligence and Smart Environments 3, 4 (2011), 349--361.",
      "doi": "10.5555/2336236.2336241"
    },
    {
      "text": "Erik E. Stone and Marjorie Skubic. 2013. Unobtrusive, continuous, in-home gait measurement using the Microsoft Kinect. IEEE Transactions on Biomedical Engineering 60, 10 (2013), 2925--2932. ",
      "doi": ""
    },
    {
      "text": "Stephanie Studenski, Subashan Perera, Kushang Patel, Caterina Rosano, Kimberly Faulkner, Marco Inzitari, Jennifer Brach, Julie Chandler, Peggy Cawthon, Elizabeth Barrett Connor, and others. 2011. Gait speed and survival in older adults. Jama 305, 1 (2011), 50--58. ",
      "doi": ""
    },
    {
      "text": "Stephanie Studenski, Subashan Perera, Dennis Wallace, Julie M. Chandler, Pamela W. Duncan, Earl Rooney, Michael Fox, and Jack M. Guralnik. 2003. Physical performance measures in the clinical setting. Journal of the American Geriatrics Society 51, 3 (2003), 314--322. ",
      "doi": ""
    },
    {
      "text": "Dave Tahmoush and Jerry Silvious. 2009. Radar micro-doppler for long range front-view gait recognition. In Proceedings of IEEE 3rd International Conference on Biometrics: Theory, Applications, and Systems (BTAS 09). IEEE, 1--6. ",
      "doi": ""
    },
    {
      "text": "Fang Wang, Erik Stone, Marjorie Skubic, James M. Keller, Carmen Abbott, and Marilyn Rantz. 2013. Toward a passive low-cost in-home gait assessment system for older adults. IEEE journal of biomedical and health informatics 17, 2 (2013), 346--355. ",
      "doi": ""
    },
    {
      "text": "Wei Wang, Alex X. Liu, and Muhammad Shahzad. 2016. Gait recognition using wifi signals. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp 16). ACM, 363--373.  ",
      "doi": "10.1145/2971648.2971670"
    },
    {
      "text": "Yan Wang, Jian Liu, Yingying Chen, Marco Gruteser, Jie Yang, and Hongbo Liu. 2014. E-eyes: device-free location-oriented activity identification using fine-grained WiFi signatures. In Proceedings of the 20th annual international conference on Mobile computing and networking. ACM, 617--628.  ",
      "doi": "10.1145/2639108.2639143"
    },
    {
      "text": "Michael G. Wing, Aaron Eklund, and Loren D. Kellogg. 2005. Consumer-grade global positioning system (GPS) accuracy and reliability. Journal of forestry 103, 4 (2005), 169--173.",
      "doi": ""
    },
    {
      "text": "Tong Xin, Bin Guo, Zhu Wang, Mingyang Li, and Zhiwen Yu. 2016. FreeSense: Indoor Human Identification with WiFi Signals. arXiv preprint arXiv:1608.03430 (2016).",
      "doi": ""
    }
  ]
}