{
  "doi": "10.1145/3025453.3025573",
  "title": "Improving Communication Between Pair Programmers Using Shared Gaze Awareness",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6245-6290",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Remote collaboration can be more difficult than collocated collaboration for a number of reasons, including the inability to easily determine what your collaborator is looking at. This impedes a pair's ability to efficiently communicate about on-screen locations and makes synchronous coordination difficult. We designed a novel gaze visualization for remote pair programmers which shows where in the code their partner is currently looking, and changes color when they are looking at the same thing. Our design is unobtrusive, and transparently depicts the imprecision inherent in eye tracking technology. We evaluated our design with an experiment in which pair programmers worked remotely on code refactoring tasks. Our results show that with the visualization, pairs spent a greater proportion of their time concurrently looking at the same code locations. Pairs communicated using a larger ratio of implicit to explicit references, and were faster and more successful at responding to those references.",
  "authors": [
    {
      "name": "Sarah D'Angelo",
      "institution": "Northwestern Univeristy, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658726495",
      "orcid": "missing"
    },
    {
      "name": "Andrew Begel",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100179596/rel-imgonly/andy-face-square.jpg",
      "acmid": "81100179596",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paul D Allopenna, James S Magnuson, and Michael K Tanenhaus. 1998. Tracking the time course of spoken word recognition using eye movements: Evidence for continuous mapping models. Journal of memory and language 38, 4 (1998), 419--439.",
      "doi": ""
    },
    {
      "text": "Reynold Bailey, Ann McNamara, Nisha Sudarsanam, and Cindy Grimm. 2009. Subtle gaze direction. ACM Transactions on Graphics (TOG) 28, 4 (2009), 100.  ",
      "doi": "10.1145/1559755.1559757"
    },
    {
      "text": "Ellen Gurman Bard, Robin L Hill, Mary Ellen Foster, and Manabu Arai. 2014. Tuning accessibility of referring expressions in situated dialogue. Language, Cognition and Neuroscience 29, 8 (2014), 928--949.",
      "doi": ""
    },
    {
      "text": "Kent Beck, Mike Beedle, Arie Van Bennekum, Alistair Cockburn, Ward Cunningham, Martin Fowler, James Grenning, Jim Highsmith, Andrew Hunt, Ron Jeffries, and others. 2001. Principles behind the Agile Manifesto. (2001). http://agilemanifesto.org/principles.html",
      "doi": ""
    },
    {
      "text": "Roman Bednarik, Andrey Shipilov, and Sami Pietinen. 2011. Bidirectional gaze in remote computer mediated collaboration: Setup and initial results from pair-programming. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 597--600.  ",
      "doi": "10.1145/1958824.1958923"
    },
    {
      "text": "Andrew Begel and Nachiappan Nagappan. 2008. Pair Programming: What's in It for Me?. In Proceedings of the Second ACM-IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '08). ACM, NY, NY, USA, 120--128.  ",
      "doi": "10.1145/1414004.1414026"
    },
    {
      "text": "Susan E Brennan, Xin Chen, Christopher A Dickinson, Mark B Neider, and Gregory J Zelinsky. 2008. Coordinating cognition: The costs and benefits of shared gaze during collaborative search. Cognition 106, 3 (2008), 1465--1477.",
      "doi": ""
    },
    {
      "text": "Teresa Busjahn, Roman Bednarik, Andrew Begel, Martha Crosby, James H. Paterson, Carsten Schulte, Bonita Sharif, and Sascha Tamm. 2015. Eye Movements in Code Reading: Relaxing the Linear Order. In Proceedings of the 2015 IEEE 23rd International Conference on Program Comprehension (ICPC '15). IEEE Computer Society, Washington, DC, USA, 255--265.  ",
      "doi": "10.1109/ICPC.2015.36"
    },
    {
      "text": "Mauro Cherubini, Marc-Antoine Nüssli, and Pierre Dillenbourg. 2008. Deixis and gaze in collaborative work at a distance (over a shared map): a computational model to detect misunderstandings. In Proceedings of the 2008 symposium on Eye tracking research & applications. ACM, 173--180.  ",
      "doi": "10.1145/1344471.1344515"
    },
    {
      "text": "Jan Chong and Rosanne Siino. 2006. Interruptions on Software Teams: A Comparison of Paired and Solo Programmers. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06). ACM, NY, NY, USA, 29--38.  ",
      "doi": "10.1145/1180875.1180882"
    },
    {
      "text": "Herbert H Clark and Susan E Brennan. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.",
      "doi": ""
    },
    {
      "text": "Alistair Cockburn and Laurie Williams. 2001. Extreme Programming Examined. Addison-Wesley Longman Publishing Co., Inc., Boston, MA, USA, Chapter The Costs and Benefits of Pair Programming, 223--243. ",
      "doi": "10.5555/377517.377531"
    },
    {
      "text": "Sarah D'Angelo and Darren Gergle. 2016. Gazed and Confused: Understanding and Designing Shared Gaze for Remote Collaboration. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2492--2496.  ",
      "doi": "10.1145/2858036.2858499"
    },
    {
      "text": "Dicolab. 2016. Dicolab - multi-user, multi-cursor collaboration. (2016). https://www.dicolab.com/products_teamplayer.html",
      "doi": ""
    },
    {
      "text": "Jörg Edelmann, Philipp Mock, Andreas Schilling, and Peter Gerjets. 2013. Preserving Non-verbal Features of Face-to-Face Communication for Remote Collaboration. In International Conference on Cooperative Design, Visualization and Engineering. Springer, 27--34.  ",
      "doi": "10.1007/978-3-642-40840-3_4"
    },
    {
      "text": "Ilenia Fronza, Alberto Sillitti, and Giancarlo Succi. 2009. An Interpretation of the Results of the Analysis of Pair Programming During Novices Integration in a Team. In Proceedings of the 2009 3rd International Symposium on Empirical Software Engineering and Measurement (ESEM '09). IEEE Computer Society, Washington, DC, USA, 225--235.  ",
      "doi": "10.1109/ESEM.2009.5315998"
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock, and Elizabeth M Parker. 2003. Where do helpers look? Gaze targets during collaborative physical tasks. In CHI'03 Extended Abstracts on Human Factors in Computing Systems. ACM, 768--769.  ",
      "doi": "10.1145/765891.765980"
    },
    {
      "text": "Darren Gergle and Alan T. Clark. 2011. See What I'M Saying?: Using Dyadic Mobile Eye Tracking to Study Collaborative Reference. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, NY, NY, USA, 435--444.  ",
      "doi": "10.1145/1958824.1958892"
    },
    {
      "text": "Darren Gergle, Robert E Kraut, and Susan R Fussell. 2013. Using visual information for grounding and awareness in collaborative tasks. Human--Computer Interaction 28, 1 (2013), 1--39.",
      "doi": ""
    },
    {
      "text": "Zenzi M Griffin and Kathryn Bock. 2000. What the eyes say about speaking. Psychological science 11, 4 (2000), 274--279.",
      "doi": ""
    },
    {
      "text": "Karl Gyllstrom and David Stotts. 2005. Facetop: Integrated semi-transparent video for enhanced natural pointing in shared screen collaboration. 15 (May 2005), 1--10.",
      "doi": ""
    },
    {
      "text": "Joy E Hanna and Susan E Brennan. 2007. Speakers' eye gaze disambiguates referring expressions early during face-to-face conversation. Journal of Memory and Language 57, 4 (2007), 596--615.",
      "doi": ""
    },
    {
      "text": "Jo E Hannay, Tore Dybå, Erik Arisholm, and Dag IK Sjøberg. 2009. The effectiveness of pair programming: A meta-analysis. Information and Software Technology 51, 7 (2009), 1110--1122.  ",
      "doi": "10.1016/j.infsof.2009.02.001"
    },
    {
      "text": "Keita Higuch, Ryo Yonetani, and Yoichi Sato. 2016. Can Eye Help You?: Effects of Visualizing Eye Fixations on Remote Collaboration Scenarios for Physical Tasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5180--5190.  ",
      "doi": "10.1145/2858036.2858438"
    },
    {
      "text": "William C. Hill, James D. Hollan, Dave Wroblewski, and Tim McCandless. 1992. Edit Wear and Read Wear. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond Being There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, NY, NY, USA, 119--125.  ",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Patrick Jermann, Darren Gergle, Roman Bednarik, and Susan Brennan. 2012. Duet 2012: Workshop on dual eye tracking in CSCW. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion. ACM, 23--24.  ",
      "doi": "10.1145/2141512.2141525"
    },
    {
      "text": "Patrick Jermann and Marc-Antoine Nüssli. 2012. Effects of sharing text selections on gaze cross-recurrence and interaction quality in a pair programming task. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 1125--1134.  ",
      "doi": "10.1145/2145204.2145371"
    },
    {
      "text": "Sasa Junuzovic, Prasun Dewan, and Yong Rui. 2007. Read, write, and navigation awareness in realistic multi-view collaborations. In International Conference on Collaborative Computing: Networking, Applications and Worksharing. IEEE, 494--503.  ",
      "doi": "10.1109/COLCOM.2007.4553880"
    },
    {
      "text": "Robert E Kraut, Darren Gergle, and Susan R Fussell. 2002. The use of visual information in shared visual spaces: Informing the development of virtual co-presence. In Proceedings of the 2002 ACM conference on Computer supported cooperative work. ACM, 31--40.  ",
      "doi": "10.1145/587078.587084"
    },
    {
      "text": "James C. McCroskey and Thomas A. McCain. 1974. The measurement of interpersonal attraction. Speech Monographs 41, 3 (1974), 261--266.",
      "doi": ""
    },
    {
      "text": "Ann McNamara, Reynold Bailey, and Cindy Grimm. 2009. Search task performance using subtle gaze direction with the presence of distractions. ACM Transactions on Applied Perception (TAP) 6, 3 (2009), 17.  ",
      "doi": "10.1145/1577755.1577760"
    },
    {
      "text": "Marc-Antoine Nüssli, Patrick Jermann, Mirweis Sangin, and Pierre Dillenbourg. 2009. Collaboration and abstract representations: towards predictive models based on raw speech and eye-tracking data. In Proceedings of the 9th international conference on Computer supported collaborative learning-Volume 1. International Society of the Learning Sciences, 78--82. ",
      "doi": "10.5555/1600053.1600065"
    },
    {
      "text": "Jiazhi Ou, Lui Min Oh, Susan R Fussell, Tal Blum, and Jie Yang. 2008. Predicting visual focus of attention from intention in remote collaborative tasks. IEEE Transactions on Multimedia 10, 6 (2008), 1034--1045.  ",
      "doi": "10.1109/TMM.2008.2001363"
    },
    {
      "text": "Christopher Palmer and Bonita Sharif. 2016. Towards Automating Fixation Correction for Source Code. In Proceedings of the Ninth Biennial ACM Symposium on Eye Tracking Research & Applications (ETRA '16). ACM, NY, NY, USA, 65--68.  ",
      "doi": "10.1145/2857491.2857544"
    },
    {
      "text": "Mauro C Pichiliani, Celso M Hirata, Fabricio S Soares, and Carlos HQ Forster. 2008. Teleeye: An awareness widget for providing the focus of attention in collaborative editing systems. In International Conference on Collaborative Computing: Networking, Applications and Worksharing. Springer, 258--270.",
      "doi": ""
    },
    {
      "text": "Sami Pietinen, Roman Bednarik, Tatiana Glotova, Vesa Tenhunen, and Markku Tukiainen. 2008. A method to study visual attention aspects of collaboration: eye-tracking pair programmers simultaneously. In Proceedings of the 2008 symposium on Eye tracking research & applications. ACM, 39--42.  ",
      "doi": "10.1145/1344471.1344480"
    },
    {
      "text": "Sami Pietinen, Roman Bednarik, and Markku Tukiainen. 2010. Shared visual attention in collaborative programming: a descriptive analysis. In proceedings of the 2010 ICSE workshop on cooperative and human aspects of software engineering. ACM, 21--24.  ",
      "doi": "10.1145/1833310.1833314"
    },
    {
      "text": "Laura Plonka and Janet van der Linden. 2012. Why developers don't pair more often. In Proceedings of the 5th International Workshop on Co-operative and Human Aspects of Software Engineering (CHASE '12). IEEE Press, Piscataway, NJ, USA, 123--125. ",
      "doi": "10.5555/2663638.2663664"
    },
    {
      "text": "George Powell. 2016. Flappy Clone. (2016).",
      "doi": ""
    },
    {
      "text": "https://github.com/georgepowell/flappy_clone",
      "doi": ""
    },
    {
      "text": "Daniel C Richardson and Rick Dale. 2005. Looking to understand: The coupling between speakers' and listeners' eye movements and its relationship to discourse comprehension. Cognitive science 29, 6 (2005), 1045--1060.",
      "doi": ""
    },
    {
      "text": "Daniel C Richardson, Rick Dale, and Natasha Z Kirkham. 2007. The art of conversation is coordination common ground and the coupling of eye movements during dialogue. Psychological science 18, 5 (2007), 407--413.",
      "doi": ""
    },
    {
      "text": "Stephan Salinger, Christopher Oezbek, Karl Beecher, and Julia Schenk. 2010. Saros: An Eclipse Plug-in for Distributed Party Programming. In Proceedings of the 2010 ICSE Workshop on Cooperative and Human Aspects of Software Engineering (CHASE '10). ACM, NY, NY, USA, 48--55.  ",
      "doi": "10.1145/1833310.1833319"
    },
    {
      "text": "Bertrand Schneider and Roy Pea. 2013. Real-time mutual gaze perception enhances collaborative learning and collaboration quality. International Journal of Computer-Supported Collaborative Learning 8, 4 (2013), 375--397.",
      "doi": "10.1007/s11412-013-"
    },
    {
      "text": "Kshitij Sharma, Patrick Jermann, Marc-Antoine Nüssli, and Pierre Dillenbourg. 2013. Understanding collaborative program comprehension: Interlacing gaze and dialogues. In Computer Supported Collaborative Learning (CSCL 2013).",
      "doi": ""
    },
    {
      "text": "Alberto Sillitti, Giancarlo Succi, and Jelena Vlasenko. 2012. Understanding the Impact of Pair Programming on Developers Attention: A Case Study on a Large Industrial Experimentation. In Proceedings of the 34th International Conference on Software Engineering (ICSE'12). IEEE Press, Piscataway, NJ, USA, 1094--1101. ",
      "doi": "10.5555/2337223.2337366"
    },
    {
      "text": "Randy Stein and Susan E Brennan. 2004. Another person's eye gaze as a cue in solving programming problems. In Proceedings of the 6th international conference on Multimodal interfaces. ACM, 9--15.  ",
      "doi": "10.1145/1027933.1027936"
    },
    {
      "text": "Josh Tenenberg, Wolff-Michael Roth, and David Socha. 2016. From I-Awareness to We-Awareness in CSCW. Computer Supported Cooperative Work 25, 4--5 (Oct. 2016), 235--278.  ",
      "doi": "10.1007/s10606-014-9215-0"
    },
    {
      "text": "Laurie A Williams and Robert R Kessler. 2000. All I really need to know about pair programming I learned in kindergarten. Commun. ACM 43, 5 (2000), 108--114.  ",
      "doi": "10.1145/332833.332848"
    }
  ]
}