{
  "doi": "10.1145/3025453.3025556",
  "title": "Better the Devil You Know: Exposing the Data Sharing Practices of Smartphone Apps",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5208-5220",
  "year": 2017,
  "badges": [],
  "abstract": "Most users of smartphone apps remain unaware of what data about them is being collected, by whom, and how these data are being used. In this mixed methods investigation, we examine the question of whether revealing key data collection practices of smartphone apps may help people make more informed privacy-related decisions. To investigate this question, we designed and prototyped a new class of privacy indicators, called Data Controller Indicators (DCIs), that expose previously hidden information flows out of the apps. Our lab study of DCIs suggests that such indicators do support people in making more confident and consistent choices, informed by a more diverse range of factors, including the number and nature of third-party companies that access users' data. Furthermore, personalised DCIs, which are contextualised against the other apps an individual already uses, enable them to reason effectively about the differential impacts on their overall information exposure.",
  "tags": [
    "privacy indicators",
    "personal data",
    "mobile apps",
    "decision-making"
  ],
  "authors": [
    {
      "name": "Max Van Kleek",
      "institution": "University of Oxford, Oxford,Oxfordshire, United Kingdom",
      "img": "/do/10.1145/contrib-81328490974/rel-imgonly/max-android.jpg",
      "acmid": "81328490974",
      "orcid": "0000-0003-3873-6366"
    },
    {
      "name": "Ilaria Liccardi",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100109867",
      "orcid": "missing"
    },
    {
      "name": "Reuben Binns",
      "institution": "University of Oxford, Oxfod, Oxfordshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959194057",
      "orcid": "missing"
    },
    {
      "name": "Jun Zhao",
      "institution": "University of Oxford, Oxford,Oxfordshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453639687",
      "orcid": "0000-0001-6935-9028"
    },
    {
      "name": "Daniel J. Weitzner",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320496017",
      "orcid": "missing"
    },
    {
      "name": "Nigel Shadbolt",
      "institution": "University of Oxford, Oxford, Oxfordshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100351241",
      "orcid": "0000-0002-5085-9724"
    }
  ],
  "references": [
    {
      "text": "George Akerlof. 1995. The market for \"lemons\": Quality uncertainty and the market mechanism. In Essential Readings in Economics. Springer, 175--188.",
      "doi": ""
    },
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your location has been shared 5,398 times!: A field study on mobile app privacy nudging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 787--796.  ",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Julio Angulo, Simone Fischer-Hübner, Tobias Pulls, and Erik Wästlund. 2015. Usable transparency with the data track: a tool for visualizing data disclosures. In Proceedings of the Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1803--1808.  ",
      "doi": "10.1145/2702613.2732701"
    },
    {
      "text": "Steven Arzt, Siegfried Rasthofer, Christian Fritz, Eric Bodden, Alexandre Bartel, Jacques Klein, Yves Le Traon, Damien Octeau, and Patrick McDaniel. 2014. Flowdroid: Precise context, flow, field, object-sensitive and lifecycle-aware taint analysis for android apps. ACM SIGPLAN Notices 49, 6 (2014), 259--269.  ",
      "doi": "10.1145/2666356.2594299"
    },
    {
      "text": "Rebecca Balebako and Lorrie Cranor. 2014. Improving app privacy: Nudging app developers to protect user privacy. IEEE Security & Privacy 12, 4 (2014), 55--58.",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Jaeyeon Jung, Wei Lu, Lorrie Faith Cranor, and Carolyn Nguyen. 2013. Little brothers watching you: Raising awareness of data leaks on smartphones. In Proceedings of the Symposium on Usable Privacy and Security. ACM, 12.  ",
      "doi": "10.1145/2501604.2501616"
    },
    {
      "text": "Rebecca Balebako, Pedro G Leon, Hazim Almuhimedi, Patrick Gage Kelley, Jonathan Mugan, Alessandro Acquisti, Lorrie Faith Cranor, and Norman Sadeh. 2011. Nudging users towards privacy on mobile devices. In Proceedings of Workshop on Persuasion, Nudge, Influence and Coercion.",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Florian Schaub, Idris Adjerid, Alessandro Acquisti, and Lorrie Cranor. 2015. The Impact of Timing on the Salience of Smartphone App Privacy Notices. In Proceedings of the ACM CCS Workshop on Security and Privacy in Smartphones and Mobile Devices. ACM, 63--74.  ",
      "doi": "10.1145/2808117.2808119"
    },
    {
      "text": "Leonid Batyuk, Markus Herpich, Seyit Ahmet Camtepe, Karsten Raddatz, Aubrey-Derrick Schmidt, and Sahin Albayrak. 2011. Using static analysis for automatic assessment and mitigation of unwanted and malicious activities within Android applications. In Malicious and Unwanted Software (MALWARE), 2011 6th International Conference on. IEEE, 66--72.  ",
      "doi": "10.1109/MALWARE.2011.6112328"
    },
    {
      "text": "Michael Benisch, Patrick Gage Kelley, Norman Sadeh, and Lorrie Faith Cranor. 2011. Capturing location-privacy preferences: quantifying accuracy and user-burden tradeoffs. Personal and Ubiquitous Computing 15, 7 (2011), 679--694.  ",
      "doi": "10.1007/s00779-010-0346-0"
    },
    {
      "text": "Jan Lauren Boyles, Aaron Smith, and Mary Madden. 2012. Privacy and Data Management on Mobile Devices. Pew's Report: Mobile Identity (September 5th 2012), 1--19.",
      "doi": ""
    },
    {
      "text": "Laura Brandimarte, Alessandro Acquisti, and George Loewenstein. 2013. Misplaced confidences privacy and the control paradox. Social Psychological and Personality Science 4, 3 (2013), 340--347.",
      "doi": ""
    },
    {
      "text": "Michael Brown, Tim Coughlan, Glyn Lawson, Murray Goulden, Robert J Houghton, and Richard Mortier. 2013. Exploring Interpretations of Data from the Internet of Things in the Home. Interacting with Computers 25, 3 (2013), 204--217.",
      "doi": ""
    },
    {
      "text": "A Cortesi and M Hils. 2013. mitmproxy: a man-in-the-middle proxy. (2013).",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor. 2006. What do they indicate?: evaluating security and privacy indicators. Interactions 13, 3 (2006), 45--47.  ",
      "doi": "10.1145/1125864.1125890"
    },
    {
      "text": "Manuel Egele, Christopher Kruegel, Engin Kirda, and Giovanni Vigna. 2011. PiOS: Detecting Privacy Leaks in iOS Applications.. In NDSS. 177--183.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Adrienne Porter Felt, and David Wagner. 2013. Choice architecture and smartphone privacy: There'sa price for that. In The economics of information security and privacy. Springer, 211--236.",
      "doi": ""
    },
    {
      "text": "William Enck, Peter Gilbert, Seungyeop Han, Vasant Tendulkar, Byung-Gon Chun, Landon P Cox, Jaeyeon Jung, Patrick McDaniel, and Anmol N Sheth. 2014. TaintDroid: an information-flow tracking system for realtime privacy monitoring on smartphones. ACM Transactions on Computer Systems (TOCS) 32, 2 (2014), 5.  ",
      "doi": "10.1145/2619091"
    },
    {
      "text": "Steven Englehardt and Arvind Narayanan. 2016. Online tracking: A 1-million-site measurement and analysis. In Proceedings of ACM Computer and Communications Security 2016.  ",
      "doi": "10.1145/2976749.2978313"
    },
    {
      "text": "Chris Evans, Chris Palmer, and Ryan Sleevi. 2015. Public key pinning extension for HTTP. RFC 7469. RFC Editor. https://tools.ietf.org/html/rfc7469",
      "doi": ""
    },
    {
      "text": "Adrienne Porter Felt, Elizabeth Ha, Serge Egelman, Ariel Haney, Erika Chin, and David Wagner. 2012. Android permissions: User attention, comprehension, and behavior. In Proceedings of Symposium on Usable Privacy and Security. ACM, 3.  ",
      "doi": "10.1145/2335356.2335360"
    },
    {
      "text": "Electronic Frontier Foundation. 2016. Coders' Rights Project Reverse Engineering FAQ. (2016). https: //www.eff.org/issues/coders/reverse-engineering-faq",
      "doi": ""
    },
    {
      "text": "Huiqing Fu, Yulong Yang, Nileema Shingte, Janne Lindqvist, and Marco Gruteser. 2014. A field study of run-time location access disclosures on android smartphones. Proceedings of USEC 14 (2014).",
      "doi": ""
    },
    {
      "text": "Sanford J Grossman and Oliver D Hart. 1983. An analysis of the principal-agent problem. Econometrica: Journal of the Econometric Society (1983), 7--45.",
      "doi": ""
    },
    {
      "text": "Hamza Harkous, Rameez Rahman, and Karl Aberer. 2016. Data-Driven Privacy Indicators. In Symposium on Usable Privacy and Security. USENIX Association.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. \"My Data Just Goes Everywhere:\" User Mental Models of the Internet and Implications for Privacy and Security. In Proceedings of Symposium On Usable Privacy and Security. 39--52.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Sunny Consolvo, Lorrie Faith Cranor, Jaeyeon Jung, Norman Sadeh, and David Wetherall. 2012. A conundrum of permissions: installing applications on an android smartphone. In International Conference on Financial Cryptography and Data Security. Springer, 68--79.  ",
      "doi": "10.1007/978-3-642-34638-5_6"
    },
    {
      "text": "Patrick Gage Kelley, Lorrie Faith Cranor, and Norman Sadeh. 2013. Privacy as part of the app decision-making process. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3393--3402.  ",
      "doi": "10.1145/2470654.2466466"
    },
    {
      "text": "Jennifer King. 2012. How Come I'm Allowing Strangers to Go Through My Phone? Smartphones and Privacy Expectations. Smartphones and Privacy Expectations (2012).",
      "doi": ""
    },
    {
      "text": "Pedro Giovanni Leon, Ashwini Rao, Florian Schaub, Abigail Marsh, Lorrie Faith Cranor, and Norman Sadeh. 2015. Privacy and Behavioral Advertising: Towards Meeting Users' Preferences. In Proceedings of the Symposium on Usable Privacy and Security.",
      "doi": ""
    },
    {
      "text": "Pedro Giovanni Leon, Blase Ur, Yang Wang, Manya Sleeper, Rebecca Balebako, Richard Shay, Lujo Bauer, Mihai Christodorescu, and Lorrie Faith Cranor. 2013. What matters to users?: factors that affect users' willingness to share information with online advertisers. In Proceedings of Symposium on Usable Privacy and Security. ACM, 1--7.  ",
      "doi": "10.1145/2501604.2501611"
    },
    {
      "text": "Ilaria Liccardi, Joseph Pato, and Daniel J. Weitzner. 2014a. Improving Mobile App Selection through Transparency and Better Permission Analysis. Journal of Privacy and Confidentiality: Vol. 5: Iss. 2, Article 1. (2014), 1--55.",
      "doi": ""
    },
    {
      "text": "Ilaria Liccardi, Joseph Pato, Daniel J. Weitzner, Hal Abelson, and David De Roure. 2014b. No Technical Understanding Required: Helping Users Make Informed Choices About Access to Their Personal Data. In Proceedings of International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services. 140--150.  ",
      "doi": "10.4108/icst.mobiquitous.2014.258066"
    },
    {
      "text": "Jialiu Lin, Shahriyar Amini, Jason I Hong, Norman Sadeh, Janne Lindqvist, and Joy Zhang. 2012. Expectation and purpose: understanding users' mental models of mobile app privacy through crowdsourcing. In Proceedings of Conference on Ubiquitous Computing. ACM, 501--510.  ",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Jialiu Lin, Bin Liu, Norman Sadeh, and Jason I Hong. 2014. Modeling users' mobile app privacy preferences: Restoring usability in a sea of permission settings. In Symposium On Usable Privacy and Security. 199--212.",
      "doi": ""
    },
    {
      "text": "Bin Liu, Mads Schaarup Andersen, Florian Schaub, Hazim Almuhimedi, Shikun Aerin Zhang, Norman Sadeh, Yuvraj Agarwal, and Alessandro Acquisti. 2016. Follow My Recommendations: A Personalized Assistant for Mobile App Permissions. In Proceedings of the Symposium on Usable Privacy and Security.",
      "doi": ""
    },
    {
      "text": "Kirsten Martin and Katie Shilton. 2016. Putting mobile application privacy in context: An empirical study of user privacy expectations for mobile devices. The Information Society 32, 3 (2016), 200--216.",
      "doi": "10.1080/01972243.2016.1153012"
    },
    {
      "text": "Akiva A Miller. 2014. What Do We Worry About When We Worry About Price Discrimination? The Law and Ethics of Using Personal Information for Pricing. Journal of Technology Law & Policy 19 (2014), 41.",
      "doi": ""
    },
    {
      "text": "Janni Nielsen, Torkil Clemmensen, and Carsten Yssing. 2002. Getting access to what goes on in people's heads?: reflections on the think-aloud technique. In Proceedings of the Nordic conference on Human-computer interaction. ACM, 101--110.  ",
      "doi": "10.1145/572020.572033"
    },
    {
      "text": "Kenneth Olmstead and Michelle Atkinson. 2015. App Permissions in the Google Play Store: Chapter 1: The Majority of Smartphone Owners Download Apps. Pew's Report: Numbers, fact and Trends Shaping the world (November 19th 2015), 1--19.",
      "doi": ""
    },
    {
      "text": "TNS Opinion. 2015. Special Eurobarometer 431, Data protection. (2015). http://ec.europa.eu/public_opinion/ archives/eb_special_439_420_en.htm#431",
      "doi": ""
    },
    {
      "text": "Paul Pearce, Adrienne Porter Felt, Gabriel Nunez, and David Wagner. 2012. Addroid: Privilege separation for applications and advertisers in android. In Proceedings of the Symposium on Information, Computer and Communications Security. ACM, 71--72.  ",
      "doi": "10.1145/2414456.2414498"
    },
    {
      "text": "Jeremy Pounder. 2015. For what it's worth - the future of personalised pricing. (2015).",
      "doi": ""
    },
    {
      "text": "Lingzhi Qiu, Zixiong Zhang, Ziyi Shen, and Guozi Sun. 2015. AppTrace: Dynamic trace on Android devices. In 2015 IEEE International Conference on Communications. IEEE, 7145--7150.",
      "doi": ""
    },
    {
      "text": "Ashwini Rao, Florian Schaub, Norman Sadeh, Alessandro Acquisti, and Ruogu Kang. Expecting the Unexpected: Understanding Mismatched Privacy Expectations Online.",
      "doi": ""
    },
    {
      "text": "Jingjing Ren, Ashwin Rao, Martina Lindorfer, Arnaud Legout, and David Choffnes. 2016. Demo: ReCon: Revealing and Controlling PII Leaks in Mobile Network Traffic. In Proceedings of the International Conference on Mobile Systems, Applications, and Services Companion (MobiSys '16 Companion). 117--117.  ",
      "doi": "10.1145/2938559.2938563"
    },
    {
      "text": "Fuming Shih, Ilaria Liccardi, and Daniel Weitzner. 2015. Privacy tipping points in smartphones privacy preferences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 807--816.  ",
      "doi": "10.1145/2702123.2702404"
    },
    {
      "text": "Irina Shklovski, Scott D Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and creepiness in app space: Perceptions of privacy and mobile app use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2347--2356.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Statistica. 2016. Number of smartphone users in the United States from 2010 to 2019 (in millions). (2016). http://www.statista.com/statistics/201182/ forecast-of-smartphone-users-in-the-us/",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. \"This has to be the cats\": Personal Data Legibility in Networked Sensing Systems. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 491--502.  ",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "Na Wang, Bo Zhang, Bin Liu, and Hongxia Jin. 2015. Investigating Effects of Control and Ads Awareness on Android Users' Privacy Behaviors and Perceptions. In Proceedings of Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 373--382.  ",
      "doi": "10.1145/2785830.2785845"
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A field trial of privacy nudges for facebook. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2367--2376.  ",
      "doi": "10.1145/2556288.2557413"
    },
    {
      "text": "Jason Watson, Heather Richter Lipford, and Andrew Besmer. 2015. Mapping user preference to privacy default settings. ACM Transactions on Computer-Human Interaction 22, 6 (2015), 32.  ",
      "doi": "10.1145/2811257"
    },
    {
      "text": "Jinyan Zang, Krysta Dummit, James Graves, Paul Lisker, and Latanya Sweeney. 2015. Who knows what about me? A survey of behind the scenes personal data sharing to third parties by mobile apps. Proceeding of Technology Science (2015).",
      "doi": ""
    },
    {
      "text": "Frederik J Zuiderveen Borgesius. 2015. Improving privacy protection in the area of behavioural targeting. SSRN 2654213 (2015).",
      "doi": ""
    }
  ]
}