{
  "doi": "10.1145/3025453.3026034",
  "title": "Tap the \"Make This Public\" Button: A Design-Based Inquiry into Issue Advocacy and Digital Civics",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6304-6316",
  "year": 2017,
  "badges": [],
  "abstract": "This paper examines the strategies of cycling advocates when deploying digital tools in their advocacy work as they support and create better cycling infrastructure and policies. Over the course of two years, we interviewed and conducted design-based fieldwork in two large U.S. cities with individuals and advocacy organizations, learning about the goals, motivations, and constraints that inform their work in their respective urban homes. Our design-based investigation and fieldwork advance a deeper, situated understanding of the role that computing technology plays when engaging across multiple sites of advocacy work. From this, we add detail to the connections across resources, identities, and issues and continue to advance the emerging area of digital civics, which seeks to design tools that support relational civic interactions across multiple categories of civic actors.",
  "tags": [
    "publics",
    "digital advocacy",
    "digital civics",
    "cycling.",
    "participatory design",
    "civic engagement",
    "community computing"
  ],
  "authors": [
    {
      "name": "Mariam Asad",
      "institution": "Georgia Institute of Technology, Atlanta, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688933",
      "orcid": "missing"
    },
    {
      "name": "Christopher A. Le Dantec",
      "institution": "Georgia Institute of Technology, Atlanta, USA",
      "img": "/do/10.1145/contrib-81367592039/rel-imgonly/le_dantec_-_light_-_small.jpg",
      "acmid": "81367592039",
      "orcid": "0000-0001-8338-4852"
    }
  ],
  "references": [
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec, 2014. Speculative Activist Technologies. In iConference 2014 Proceedings, iSchools, 229--243. http://hdl.handle.net/2142/47306.",
      "doi": ""
    },
    {
      "text": "Atlanta Regional Commission. (2013). 2013 Livable Centers Initiative Implementation Report.",
      "doi": ""
    },
    {
      "text": "Richard Bentley and Paul Dourish. (1995). Medium versus mechanism: supporting collaboration through customisation. In Proceedings of the fourth conference on European Conference on Computer-Supported Cooperative Work (ECSCW'95), Hans Marmolin, Yngve Sundblad, and Kjeld Schmidt (Eds.). Kluwer Academic Publishers, Norwell, MA, USA, 133--148. ",
      "doi": "10.5555/1241958.1241967"
    },
    {
      "text": "Binder, T., de De Michelis, G., Ehn, P., Jacucci, G., Linde, P., & Wagner, I. (2011). Design Things. MIT Press.",
      "doi": ""
    },
    {
      "text": "Shane R. Brady, Jimmy A. Young, and David A. McLeod. Utilizing Digital Advocacy in Community Organizing: Lessons Learned from Organizing in Virtual Spaces to Promote Worker Rights and Economic Justice. In Journal of Community Practice. 23, 2, (May 2015), 255--273.",
      "doi": ""
    },
    {
      "text": "Mark Brown. \"Street Bump\" Android app detects and reports potholes. Wired.co.uk, 2011. http://www.wired.co.uk/news/archive/2011-02/14/street-bump-app.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J. Bowen, Peter C. Wright, & Patrick Olivier. (2015). Contesting the City: Enacting the Political Through Digitally Supported Urban Walks (pp. 2853--2862). In CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM.  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Gilles Deleuze and Felix Guattari. A Thousand Plateaus: Capitalism and Schizophrenia. (B. Massumi, Trans.). University of Minnesota Press. (1987).",
      "doi": ""
    },
    {
      "text": "John Dewey. The Public and its Problems. 1929.",
      "doi": ""
    },
    {
      "text": "1Jill P. Dimond, Casey Fiesler, & Amy S. Bruckman. Domestic violence and information communication technologies. In Interacting with Computers. 23, 5. 413--421. 20  ",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Carl DiSalvo. Design and the Construction of Publics. In Design Issues. 25, 1 (Winter 2009), 48--63.",
      "doi": ""
    },
    {
      "text": "Dourish, P. (2010). HCI and environmental sustainability (pp. 1--10). The 8th ACM Conference on Designing Interactive Systems, ACM Press.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Heather R. Edwards and Richard Hoefer. Are Social Work Advocacy Groups Using Web 2.0 Effectively? In Journal of Policy Practice. 9, 3--4 (2010), 1558--8750.",
      "doi": ""
    },
    {
      "text": "Gil-Garcia, J.R., Pardo, T.A., and Aldama-Nalda, A. Smart Cities and Smart Governments: Using In- formation Technologies to Address Urban Challenges. Proceedings of the 14th Annual International Con- ference on Digital Government Research, ACM (2013), 296--297  ",
      "doi": "10.1145/2479724.2479728"
    },
    {
      "text": "Jeremy Goecks, Amy Voida, Stephen Voida, and Elizabeth D. Mynatt. 2008. Charitable technologies: opportunities for collaborative computing in nonprofit fundraising. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08). ACM, New York, NY, USA, 689--698.  ",
      "doi": "10.1145/1460563.1460669"
    },
    {
      "text": "Emilie Gomart & Antoine Hennion. (1999). A sociology of attachment: Music amateurs, drug users. In J. Law & J. Hassard (Eds.), Actor Network Theory and After (pp. 220--247). Blackwell Publishing.",
      "doi": ""
    },
    {
      "text": "Chao Guo and Gregory D. Saxton. Tweeting Social Change: How Social Media Are Changing Nonprofit Advocacy. In Nonprofit and Voluntary Sector Quarterly. (January 2013).",
      "doi": ""
    },
    {
      "text": "Darrene Hackler and Gregory D. Saxton. The Strategic Use of Information Technology by Nonprofit Organizations: Increasing Capacity and Untapped Potential. In Public Administration Review. 67, 3, (2007), 474--487.",
      "doi": ""
    },
    {
      "text": "Derek L. Hansen, Jes A. Koepfler, Paul T. Jaeger, John C. Bertot, and Tracy Viselli. 2014. Civic action brokering platforms: facilitating local engagement with ACTion Alexandria. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, NY, USA, 1308--1322.  ",
      "doi": "10.1145/2531602.2531714"
    },
    {
      "text": "2Javier C. Hernandez. Car-Free Streets, a Colombian Export, Inspire Debate. In The New York Times. (24 June 2008.). Retrieved August 14, 2015 from http://www.nytimes.com/2008/06/24/nyregion/24streets.html?_r=1&scp=1&sq=Ciclov%C3%ADa&st=cse",
      "doi": ""
    },
    {
      "text": "2Tom Jenkins, Christopher A. Le Dantec, Carl F. DiSalvo, Thomas Lodato, & Mariam Asad. (2016). Object-Oriented Publics (pp. 827--839). Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM.  ",
      "doi": "10.1145/2858036.2858565"
    },
    {
      "text": "David Karpf. Online Political Mobilization from the Advocacy Group's Perspective: Looking Beyond Clicktivism. In Policy & Internet. 2 (August 2012), 7--41.",
      "doi": ""
    },
    {
      "text": "Rob Kling. (1978). Automated information systems as social resources in policy making (pp. 666--674). ACM '78: Proceedings of the 1978 annual conference, ACM.  ",
      "doi": "10.1145/800178.810109"
    },
    {
      "text": "Dan Koeppel. How Low-Income Cyclists Go Unnoticed. In Bicycling. (9 November 2015.). Retrieved August 3, 2016 from http://www.bicycling.com/culture/advocacy/how-low-income-cyclists-go-unnoticed",
      "doi": ""
    },
    {
      "text": "Travis Kriplean, Ivan Beschastnikh, David W. McDonald, & Scott A. Golder. (2007). Community, consensus, coercion, control: cs*w or how policy mediates mass participation (pp. 167--176). GROUP '07: Proceedings of the 2007 international ACM conference on Supporting group work.  ",
      "doi": "10.1145/1316624.1316648"
    },
    {
      "text": "Stacey Kuznetsov, George Davis, Jian Cheung, and Eric Paulos. 2011. Ceci n'est pas une pipe bombe: authoring urban landscapes with air quality sensors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2375--2384.  ",
      "doi": "10.1145/1978942.1979290"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Participatory sensing in public spaces: activating urban surfaces with sensor probes. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 21--30.  ",
      "doi": "10.1145/1858171.1858175"
    },
    {
      "text": "Laird, F.N. Participatory Analysis, Democracy, and Technological Decision Making. Science, Technology & Human Values 18, 3 (1993)",
      "doi": ""
    },
    {
      "text": "Bruno Latour & Monique G. Stark. (1999). Factures/fractures: From the Concept of Network to the Concept of Attachment. Factura, 34(Autumn), 20--",
      "doi": ""
    },
    {
      "text": "3Christopher A. Le Dantec, Caroline Appleton, Mariam Asad, Robert Rosenberger, & Kari E. Watkins. (2016). Advocating Through Data: Community Visibility Through Crowdsourced Cycling Data. In A. Golub, M. Hoffmann, A. Lugo, & G. Sandoval (Eds.), Bicycle Justice and Urban Transformation Biking for All. Routledge Press.",
      "doi": ""
    },
    {
      "text": "3Le Dantec, C. A., Asad, M., Misra, A., & Watkins, K. E. (2015). Planning with Crowdsourced Data: Rhetoric and Representation in Transportation Planning (pp. 1717--1727). CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM Request Permissions.  ",
      "doi": "10.1145/2675133.2675212"
    },
    {
      "text": "3Christopher A. Le Dantec and Carl DiSalvo. Infrastructuring and the Formation of Publics in Participatory Design. In Social Studies of Science. 42, 2 (2013), 241--264.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec, Robert G. Farrell, Jim E. Christensen, Mark Bailey, Jason B. Ellis, Wendy A. Kellogg, and W. Keith Edwards. 2011. Publics in practice: ubiquitous computing at a shelter for homeless mothers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1687--1696.  ",
      "doi": "10.1145/1978942.1979189"
    },
    {
      "text": "Christopher A. Le Dantec and W. Keith Edwards. 2010. Across boundaries of influence and accountability: the multiple scales of public sector information systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 113--122.  ",
      "doi": "10.1145/1753326.1753345"
    },
    {
      "text": "Christopher A. Le Dantec. 2016. Designing Publics. MIT Press.",
      "doi": ""
    },
    {
      "text": "3Silvia Lindtner, Judy Chen, Gillian R. Hayes, & Paul Dourish. (2011). Towards a framework of publics: Re-encountering media sharing and its user. ACM Transactions on Computer-Human Interaction, 18, 5:1--5:23.  ",
      "doi": "10.1145/1970378.1970379"
    },
    {
      "text": "3Kristen Lovejoy and Gregory D. Saxton. Information, Community, and Action: How Nonprofit Organizations Use Social Media. In Journal of Computer-Mediated Communication. 17 (2012), 337--353.  ",
      "doi": "10.1111/j.1083-6101.2012.01576.x"
    },
    {
      "text": "3Noortje Marres. (2007). The Issues Deserve More Credit: Pragmatist Contributions to the Study of Public Involvement in Controversy. In Social Studies of Science, 37(5), 759--780.",
      "doi": ""
    },
    {
      "text": "40.Noortje Marres. 2012. Material Participation: Technology, the Environment and Everyday Publics. Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "4John McCarthy & Peter Wright. 2015. Taking {A}part. MIT Press.",
      "doi": ""
    },
    {
      "text": "4Nam, T. and Pardo, T.A. Conceptualizing Smart City with Dimensions of Technology, People, and Institutions. Proceedings of the 12th Annual International Digital Government Research Conference: Digital Government Innovation in Challenging Times, ACM (2011), 282--291.  ",
      "doi": "10.1145/2037556.2037602"
    },
    {
      "text": "4Nam, T. and Pardo, T.A. Smart City As Urban Innovation: Focusing on Management, Policy, and Con- text. Proceedings of the 5th International Conference on Theory and Practice of Electronic Governance, ACM (2011), 185--194  ",
      "doi": "10.1145/2072069.2072100"
    },
    {
      "text": "4Office of the Press Secretary. Administration Announces New \"Smart Cities\" Initiative to Help Communities Tackle Local Challenges and Improve City Services. (14 September 2015.). Retrieved September 16, 2015 from https://www.whitehouse.gov/the-press-office/2015/09/14/fact-sheet-administration-announces-new-%E2%80%9Csmart-cities%E2%80%9D-initiative-help.",
      "doi": ""
    },
    {
      "text": "4Jonathan A. Obar, Paul Zube, and Clifford Lampe. Advocacy 2.0: An Analysis of How Advocacy Groups in the United States Perceive and Use Social Media as Tools for Facilitating Civic Engagement and Collective Action. In Journal of Information Policy. 2 (2012), 1--25.",
      "doi": ""
    },
    {
      "text": "4Patrick Olivier & Peter Wright. (2015). Digital Civics: Taking a Local Turn. interactions, 22(4), 61--63.  ",
      "doi": "10.1145/2776885"
    },
    {
      "text": "4James Pierce and Eric Paulos. 2012. Beyond energy monitors: interaction, energy, and emerging energy systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 665--674.  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "4Ian G. Johnson, John Vines, Nick Taylor, Edward Jenkins, and Justin Marshall. 2016. Reflections on Deploying Distributed Consultation Technologies with Community Organisations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2945--2957.  ",
      "doi": "10.1145/2858036.2858098"
    },
    {
      "text": "4Kate Starbird and Leysia Palen. \"Voluntweeters\": Self-Organizing by Digital Volunteers in Times of Crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "50.Jennifer Stoll, W. Keith Edwards, and Kirsten A. Foot. 2012. Between us and them: building connectedness within civic networks. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 237--240.  ",
      "doi": "10.1145/2145204.2145240"
    },
    {
      "text": "5Taewoo Nam and Theresa A. Pardo. 2012. Transforming city government: a case study of Philly311. In Proceedings of the 6th International Conference on Theory and Practice of Electronic Governance (ICEGOV '12), J. Ramon Gil-Garcia, Natalie Helbig, and Adegboyega Ojo (Eds.). ACM, New York, NY, USA, 310--319.  ",
      "doi": "10.1145/2463728.2463787"
    },
    {
      "text": "5Sunil Rodger, John Vines, and Janice McLaughlin. 2016. Technology and the Politics of Mobility: Evidence Generation in Accessible Transport Activism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2417--2429.  ",
      "doi": "10.1145/2858036.2858146"
    },
    {
      "text": "5Transportation Research Board of the National Academies. (2013). Critical Issues in Transportation.",
      "doi": ""
    },
    {
      "text": "5Vlachokyriakos, V., Crivellaro, C., Le Dantec, C. A., Gordon, E., Wright, P., & Olivier, P. (2016). Digital Civics: Citizen Empowerment With and Through Technology (pp. 1096--1099). Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, ACM.  ",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "5Amy Voida, Lynn Dombrowski, Gillian R. Hayes, and Melissa Mazmanian. 2014. Shared values/conflicting logics: working around e-government systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3583--3592.  ",
      "doi": "10.1145/2556288.2556971"
    },
    {
      "text": "5Amy Voida, Ellie Harmon, and Ban Al-Ani. 2011. Homebrew databases: complexities of everyday information management in nonprofit organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 915--924.  ",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "5Amy Voida, Ellie Harmon, and Ban Al-Ani. 2012. Bridging between organizations and the public: volunteer coordinators' uneasy relationship with social computing (pp. 1967--1976). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1967--1976.  ",
      "doi": "10.1145/2207676.2208341"
    }
  ]
}