{
  "doi": "10.1145/3025453.3025548",
  "title": "Through the Looking Glass: The Effects of Feedback on Self-Awareness and Conversational Behaviour during Video Chat",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5271-5283",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Video chat is a popular form of computer-mediated communication in a range of contexts from online job interviews to chatting with friends. Although seeing your own video feedback is the predominant interface design, self-awareness research suggests that seeing oneself could induce self-consciousness and affect interaction. We created a custom video chat application and asked pairs of strangers to engage in an online personal information exchange task with or without video feedback. Feedback increased self-awareness and the use of socially-focused words, and decreased the use of words expressing certainty. In addition, mixed-gender dyads rated themselves as more socially orientated with feedback than without, which was reflected in an increased use of inclusive pronouns and affiliation words, and fewer words expressing discrepancy. However, with feedback, same-gender dyads reported greater task orientation than mixed-gender dyads reflected in increased use of task-relevant words. We discuss design implications in contexts from remote therapy to online dating.",
  "tags": [
    "self-awareness",
    "feedback",
    "video chat",
    "gender",
    "cmc",
    "cscw"
  ],
  "authors": [
    {
      "name": "Matthew K. Miller",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958615957",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    },
    {
      "name": "Max V. Birk",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557519856",
      "orcid": "missing"
    },
    {
      "name": "Ansgar E. Depping",
      "institution": "University of Sakatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022433",
      "orcid": "missing"
    },
    {
      "name": "Tushita Patel",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548039956",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Morgan G. Ames, Janet Go, Joseph 'Jofish' Kaye, and Mirjana Spasojevic. 2010. Making love in the network closet: the benefits and work of family videochat. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. 145--154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Roy F. Baumeister. 1984. Choking under pressure: selfconsciousness and paradoxical effects of incentives on skillful performance. Journal of personality and social psychology. 46, 3, 610--620.",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister, Debra G. Hutton, Kenneth J. Cairns 1990. Negative effects of praise on skilled performance. Basic and applied social psychology. 11, 2, 131--148.",
      "doi": ""
    },
    {
      "text": "E Bekkering and J.P Shim. 2006. Trust in videoconferencing. Communications of the ACM. 49, 7, 103--107.  ",
      "doi": "10.1145/1139922.1139925"
    },
    {
      "text": "Nikki Blacksmith, Jon C. Willford, and Tara S. Behrend. 2016. Technology in the Employment Interview: A Meta-Analysis and Future Research Agenda. Personnel Assessment and Decisions. 2, 1, 2.",
      "doi": ""
    },
    {
      "text": "Susan M. Bögels, Wendy Rijsemus, and Peter J. De Jong. 2002. Self-focused attention and social anxiety: The effects of experimentally heightened self-awareness on fear, blushing, cognitions, and social skills. Cognitive Therapy and Research. 26, 4, 461--472.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on shared experiences: moving beyond the camera in video communication. In Proceedings of the Designing Interactive Systems Conference. 96--105.  ",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Arnold H. Buss. 1980. Self-consciousness and social anxiety. Freeman.",
      "doi": ""
    },
    {
      "text": "Charles S. Carver. 1975. Physical aggression as a function of objective self-awareness and attitudes toward punishment. Journal of Experimental Social Psychology. 11, 6, 510--519.",
      "doi": ""
    },
    {
      "text": "Charles S. Carver and Michael F. Scheier. 1978. Selffocusing effects of dispositional self-consciousness, mirror presence, and audience presence. Journal of Personality and Social Psychology. 36, 3, 324--332.",
      "doi": ""
    },
    {
      "text": "Helen Christensen, Kathleen M. Griffiths, Andrew J. Mackinnon, Kanupriya Kalia, Philip J. Batterham, Justin Kenardy, Claire Eagleson, and Kylie Bennett. 2010. Protocol for a randomised controlled trial investigating the effectiveness of an online e health application for the prevention of Generalised Anxiety Disorder. BMC psychiatry. 10, 25.",
      "doi": ""
    },
    {
      "text": "Josh M. Cisler and Ernst HW Koster. 2010. Mechanisms of attentional biases towards threat in anxiety disorders: An integrative review. Clinical psychology review. 30, 2, 203--216.",
      "doi": ""
    },
    {
      "text": "Jose Eurico de Vasconcelos Filho, Kori M. Inkpen, Mary Czerwinski. 2009. Image, appearance and vanity in the use of media spaces and video conference systems. In Proceedings of the ACM 2009 international conference on Supporting group work. 253--262.  ",
      "doi": "10.1145/1531674.1531712"
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The \"what\" and \"why\" of goal pursuits: Human needs and the selfdetermination of behavior. Psychological inquiry. 11, 4, 227--268.",
      "doi": ""
    },
    {
      "text": "James Price Dillard, Denise Haunani Solomon, Mark T. Palmer. 1999. Structuring the concept of relational communication. Communications Monographs, 66, 1, 49--65.",
      "doi": ""
    },
    {
      "text": "Goffman Erving. 1959. The presentation of self in everyday life. Garden City, NY: Anchor. 1--17.",
      "doi": ""
    },
    {
      "text": "Allan Fenigstein, Michael F. Scheier, Arnold H. Buss. 1975. Public and private self-consciousness: Assessment and theory. Journal of consulting and clinical psychology. 43, 4, 522--527.",
      "doi": ""
    },
    {
      "text": "Allen Fenigstein. 1979. Self-consciousness, selfattention, and social interaction. Journal of Personality and Social Psychology. 37, 1, 75--86.",
      "doi": ""
    },
    {
      "text": "Luis López Fernández, Miguel París Díaz, Raúl Benítez Mejías, Francisco Javier López, José Antonio Santos. 2013. Kurento: a media server technology for convergent WWW/mobile real-time multimedia communications supporting WebRTC. In World of Wireless, Mobile and Multimedia Networks (WoWMoM). 1--6.",
      "doi": ""
    },
    {
      "text": "Ryoko Furukawa, and Martha Driessnack. 2012. Videomediated communication to support distant family connectedness. Clinical nursing research. 22, 1, 82--94.",
      "doi": ""
    },
    {
      "text": "John M. Govern and Lisa A. Marsch. 2001. Development and validation of the situational selfawareness scale. Consciousness and cognition. 10, 3, 366--378.",
      "doi": ""
    },
    {
      "text": "Samuel D. Gosling, Peter J. Rentfrow, William B. Swann. 2003. A very brief measure of the Big-Five personality domains. Journal of Research in personality. 37, 6, 504--528.",
      "doi": ""
    },
    {
      "text": "Zixiu Guo, John D'ambra, Tim Turner, and Huiying Zhang. 2009. Improving the effectiveness of virtual teams: A comparison of video-conferencing and face-toface communication in China. IEEE Transactions on Professional Communication. 52, 1, 1--16.",
      "doi": ""
    },
    {
      "text": "Yuko Hakamata, Shmuel Lissek, Yair Bar-Haim, Jennifer C. Britton, Nathan A. Fox, Ellen Leibenluft, Monique Ernst, Daniel S. Pine. 2010. Attention bias modification treatment: a meta-analysis toward the establishment of novel treatment for anxiety. Biological psychiatry. 68, 11, 982--990.",
      "doi": ""
    },
    {
      "text": "William John Ickes, Robert A. Wicklund, C. Brian Ferris. 1973. Objective self awareness and self esteem. Journal of Experimental Social Psychology. 9, 3, 202219.",
      "doi": ""
    },
    {
      "text": "Rick E. Ingram. 1990. Self-focused attention in clinical disorders: review and a conceptual model. Psychological bulletin. 107, 2, 156--176.",
      "doi": ""
    },
    {
      "text": "Adam N. Joinson. 2001. Self-disclosure in computer? mediated communication: The role of self-awareness and visual anonymity. European journal of social psychology. 31, 2, 177--192.",
      "doi": ""
    },
    {
      "text": "Kathleen Dodge Kelsey. 2000. Participant interaction in a course delivered by interactive compressed video technology. American Journal of Distance Education. 14, 1, 63--74.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, David Zubrow, Anne Marie Moses, Valerie Geller. 1985. Affect in computer-mediated communication: An experiment in synchronous terminal-to-terminal discussion. Human-Computer Interaction. 1, 1, 77--104.  ",
      "doi": "10.1207/s15327051hci0101_3"
    },
    {
      "text": "Richard D. Lennox and Raymond N. Wolfe. 1984. Revision of the self-monitoring scale. Journal of Personality and Social Psychology. 46, 6, 1349--1364.",
      "doi": ""
    },
    {
      "text": "Philip R. Magaletta, Thomas J. Fagan, Mark F. Peyrot. 2000. Telehealth in the Federal Bureau of Prisons: Inmates' perceptions. Professional Psychology: Research and Practice. 31, 5, 497--502.",
      "doi": ""
    },
    {
      "text": "Winter Mason, and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior research methods. 44, 1, 1--23.",
      "doi": ""
    },
    {
      "text": "Lisa McIntyre. 2013. The practical skeptic: Core concepts in sociology. McGraw-Hill Higher Education.",
      "doi": ""
    },
    {
      "text": "Paul McLaren, Chris J. Ball, A. B. Summerfield, J. P. Watson, M. Lipsedge. 1995. An evaluation of the use of interactive television in an acute psychiatric service. Journal of Telemedicine and Telecare. 1, 2, 79--85.",
      "doi": ""
    },
    {
      "text": "Adam W. Meade, and S. Bartholomew Craig. 2012. Identifying careless responses in survey data. Psychological methods. 17, 3, 437--455.",
      "doi": ""
    },
    {
      "text": "Tanna M.B. Mellings and Lynn E. Alden. 2000. Cognitive processes in social anxiety: The effects of self-focus, rumination and anticipatory processing. Behaviour Research and Therapy, 38, 3, 243--257.",
      "doi": ""
    },
    {
      "text": "April Slayden Mitchell, Mary G. Baker, Chen Wu, Ramin Samadani, Dan Gelb. 2010. How do I look? An evaluation of visual framing feedback in desktop video conferencing. Tech. Rep. HPL-2010--175, HP labs. http://www.hpl.hp.com/techreports/2010/HPL-2010175.pdf",
      "doi": ""
    },
    {
      "text": "Anthony Mulac. 1989. Men's and women's talk in samegender and mixed-gender dyads: Power or polemic?. Journal of Language and Social Psychology. 8, 3--4, 249--270.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Saul Greenberg. 2012. Intimacy in long-distance relationships over video chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 753--762.  ",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Chris Nodder, Gayna Williams, Deborah Dubrow. 1999. Evaluating the usability of an evolving collaborative product-changes in user type, tasks and evaluation methods over time. In Proceedings of the international ACM SIGGROUP conference on Supporting group work. 150--159.  ",
      "doi": "10.1145/320297.320314"
    },
    {
      "text": "Kenton O'Hara, Alison Black, and Matthew Lipson. 2006. Everyday practices with mobile video telephony. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 871--880.  ",
      "doi": "10.1145/1124772.1124900"
    },
    {
      "text": "Kenton O'hara, Jesper Kjeldskov, Jeni Paay. 2011. Blended interaction spaces for distributed team collaboration. ACM Transactions on Computer-Human Interaction (TOCHI). 18, 1, 3.  ",
      "doi": "10.1145/1959022.1959025"
    },
    {
      "text": "James W. Pennebaker, Ryan L. Boyd, Kayla Jordan, and Kate Blackburn. 2015. The development and psychometric properties of LIWC2015. UT Faculty/Researcher Works.",
      "doi": ""
    },
    {
      "text": "Robert W. Plant and Richard M. Ryan. 1985. Intrinsic motivation and the effects of self-consciousness, self awareness, and ego involvement: An investigation of internally controlling styles. Journal of Personality. 53, 3, 435--449.",
      "doi": ""
    },
    {
      "text": "Barbara A. Ritter. 2012. Say that to my face: Factors inherent to the online environment that increase the likelihood of harassing and prejudicial behavior. Cutting-edge Technologies in Higher Education. 5, 2542.",
      "doi": ""
    },
    {
      "text": "Nicolas Roulin. 2016. Individual Differences Predicting Impression Management Detection in Job Interviews. Personnel Assessment and Decisions. 2, 1, 1.",
      "doi": ""
    },
    {
      "text": "Victor Savicki, Merle Kelley, Dawn Lingenfelter. 1997. Gender, group composition, and task type in small task groups using computer-mediated communication. Computers in Human Behavior. 12, 4, 549--565.",
      "doi": ""
    },
    {
      "text": "Victor Savicki, Merle Kelley, Benjamin Ammon. 2002. Effects of training on computer-mediated communication in single or mixed gender small task groups. Computers in Human Behavior. 18, 3, 257269.",
      "doi": ""
    },
    {
      "text": "Michael F. Scheier and Charles S. Carver. 1985. The Self-Consciousness Scale: A Revised Version for Use with General Populations. Journal of Applied Social Psychology, 15, 8, 687--699.",
      "doi": ""
    },
    {
      "text": "Michael F. Scheier, Allan Fenigstein, Arnold H. Buss. 1974. Self-awareness and physical aggression. Journal of Experimental Social Psychology. 10, 3, 264--273.",
      "doi": ""
    },
    {
      "text": "Aaron Smith and Maeve Duggan. 2013. Online dating & relationships. Pew Internet & American Life Project.",
      "doi": ""
    },
    {
      "text": "Susan G. Straus, Jeffrey A. Miles, and Laurie L. Levesque. 2001. The effects of videoconference, telephone, and face-to-face media on interviewer and applicant judgments in employment interviews. Journal of management. 27, 3, 363--381.",
      "doi": ""
    },
    {
      "text": "Xiaoning Sun, Susan Wiedenbeck, Thippaya Chintakovid, Qiping Zhang. 2007. Gender talk: differences in interaction style in CMC. In IFIP Conference on Human-Computer Interaction. 215--218. ",
      "doi": "10.5555/1778331.1778353"
    },
    {
      "text": "Xiaoning Sun, Susan Wiedenbeck, Thippaya Chintakovid, Qiping Zhang. 2007. The effect of gender on trust perception and performance in computer mediated virtual environments. In Proceedings of the American Society for Information Science and Technology, 44, 1, 1--14.",
      "doi": ""
    },
    {
      "text": "Tandberg. 2005. Tandberg Tactical MXP User Manual.",
      "doi": ""
    },
    {
      "text": "Cameron Teoh, Holger Regenbrecht, David O'Hare. 2010. Investigating factors influencing trust in videomediated communication. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction. 312--319.  ",
      "doi": "10.1145/1952222.1952289"
    },
    {
      "text": "Cameron Teoh, Holger Regenbrecht, David O'Hare. 2012. How the other sees us: perceptions and control in videoconferencing. In Proceedings of the 24th Australian Computer-Human Interaction Conference. 572--578.  ",
      "doi": "10.1145/2414536.2414624"
    },
    {
      "text": "Bruce W. Tuckman and Mary Ann C. Jensen. 1977. Stages of small-group development revisited. Group & Organization Management. 2, 4, 419--427.",
      "doi": ""
    },
    {
      "text": "Shaojung Sharon Wang, Shin-Il Moon, Kyounghee Hazel Kwon, Carolyn A. Evans, Michael A. Stefanone. 2010. Face off: Implications of visual cues on initiating friendship on Facebook. Computers in Human Behavior. 26, 2, 226--234.  ",
      "doi": "10.1016/j.chb.2009.10.001"
    },
    {
      "text": "Jurgen Wegge. 2006. Communication via videoconference: Emotional and cognitive consequences of affective personality dispositions, seeing one's own picture, and disturbing events. HumanComputer Interaction, 21, 3, 273--318.  ",
      "doi": "10.1207/s15327051hci2103_1"
    },
    {
      "text": "Robert A. Wicklund and Shelley Duval. 1971. Opinion change and performance facilitation as a result of objective self-awareness. Journal of Experimental Social Psychology. 7, 3, 319--342.",
      "doi": ""
    }
  ]
}