{
  "doi": "10.1145/3025453.3025859",
  "title": "Navigating Relationships and Boundaries: Concerns around ICT-uptake for Elderly People",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "7057-7069",
  "year": 2017,
  "badges": [],
  "abstract": "Despite a proliferation of research in the use of ICTs to support active and healthy ageing, few have considered the privacy and security concerns particular to the elderly. We investigated the appropriation of tablet devices and a neighborhood portal as well as emerging privacy and security issues through ethnographic and action research in a long-term participatory design (PD) project with elderly participants. We discuss two major themes: a) the tensions related to perceived digital threats and the social pressures of online disclosure to the social environment; and b) the relation of these issues to the ICT appropriation process and the referring challenges we encountered. We argue that there is a need to understand the interleaving of physical and virtual habitats, the various ways resulting in discomfort and the senior citizens' actions -- which at first glance appear contradictory. We consider the implications of the issues observed for examining privacy and security concerns more broadly as well as discussing implications for the design of the portal and the shaping of social measures for appropriation support.",
  "tags": [
    "design case studies",
    "communities of practice",
    "privacy",
    "elderly people",
    "participatory design",
    "disclosure",
    "ethnography",
    "appropriation",
    "action research"
  ],
  "authors": [
    {
      "name": "Dominik Hornung",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658630578",
      "orcid": "missing"
    },
    {
      "name": "Claudia Müller",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659489824",
      "orcid": "missing"
    },
    {
      "name": "Irina Shklovski",
      "institution": "IT University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100288406/rel-imgonly/portraits_2019-2020_colour1.jpeg",
      "acmid": "81100288406",
      "orcid": "0000-0003-1874-0958"
    },
    {
      "name": "Timo Jakobi",
      "institution": "University of Siegen, Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458953357",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Rikke Aarhus and Stinne Aalokke Ballegaard. 2010. Negotiating Boundaries: Managing Disease at Home. Proceedings of the 28th International Conference on Human Factors in Computing Systems CHI '10, ACM, 1223--1232.  ",
      "doi": "10.1145/1753326.1753509"
    },
    {
      "text": "Anne Adams and Angela Sasse. 1999. Users Are Not The Enemy. Communications of the ACM 42, 12: 41-- 46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "I. Altman. 1975. The Environment and Social Behaviour: Privacy, Personal Space, Territory, and Crowding. Brooks/Cole Publishing Company, Monterey, CA.",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus. 2012. The Mismeasurement of Privacy: Using Contextual Integrity to Reconsider Privacy in HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems: 367--376.  ",
      "doi": "10.1145/2207676.2207727"
    },
    {
      "text": "Eva Brandt, Thomas Binder, L Malmborg, and T Sokoler. 2010. Communities of everyday practice and situated elderliness as an approach to co-design for senior interaction. Proc. of OZCHI '10: 400--403.  ",
      "doi": "10.1145/1952222.1952314"
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 2016. What is a participatory design result? Proceedings of the 14th Participatory Design Conference: Full papers 1: 141-- 150.  ",
      "doi": "10.1145/2940299.2940316"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3: 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 2007. Participatory design in community informatics. Design Studies 28, 3: 243--261.",
      "doi": ""
    },
    {
      "text": "Jane Chung, George Demiris, and Hilaire J. Thompson. 2016. Ethical Considerations Regarding the Use of Smart Home Technologies for Older Adults: An Integrative Review. Annual Review of Nursing Research 34: 155--181.",
      "doi": ""
    },
    {
      "text": "Sebastian Draxler, Gunnar Stevens, Martin Stein, Alexander Boden, and David Randall. 2012. Supporting the Social Context of Technology Appropriation?: On a Synthesis of Sharing Tools and Tool Knowledge. CHI '12: 2835--2844.  ",
      "doi": "10.1145/2207676.2208687"
    },
    {
      "text": "European Commission. 2015. Background Paper: Growing the European Silvereconomy.",
      "doi": ""
    },
    {
      "text": "European Commission. 2015. EU Summit on Innovation for Active and Healthy Ageing 2015.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer. 2000. Symmetry of Ignorance, Social Creativity, and Meta-Design. Knowledge-Based Systems 13, 7: 527--537.  ",
      "doi": "10.1016/S0950-7051%2800%2900065-4"
    },
    {
      "text": "Geraldine FItzpatrick and Gunnar Ellingsen. 2012. A Review of 25 Years of CSCW Research in Healthcare: Contributions, Challenges and Future Agendas. Computer Supported Cooperative Work (CSCW).  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Geraldine Fitzpatrick, Alina Huldtgren, Lone Malmborg, D Harley, and W Ijsselsteijn. 2015. Design for Agency, Adaptivity and Reciprocity: re-imagining AAL and telecare agendas. In Designing Socially Embedded Technologies in the Real-World, Dave Randall, Kjeld Schmidt and Volker Wulf (eds.). Springer Publishing Comany, 305--338.",
      "doi": ""
    },
    {
      "text": "Asbjorn Følstad. 2008. Living Labs for Innovation and Development of Information and Communication Technology: A Literature Review. eJOV 10, August: 99--131.",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. Interactions 6, Jan./Feb.: 21-- 29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Erving Goffman. 1959. The presentation of self in everyday life. Doubleday Anchor Books, Garden City, NY.",
      "doi": ""
    },
    {
      "text": "Jean D Hallewell Haslwanter and Geraldine Fitzpatrick. 2016. Why do few assistive technology systems make it to market? The case of the HandyHelper project. Universal Access in the Information Society.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction 18, 3: 1--20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "David Hung. 2005. Preserving Authenticity in CoLs and CoPs: Proposing an Agenda for CSCL. CSCL '05: 227--231. ",
      "doi": "10.5555/1149293.1149322"
    },
    {
      "text": "Suhas Govind Joshi and Tone Bratteteig. 2016. Designing for Prolonged Mastery. On involving old people in Participatory Design. Scandinavian Journal of Information Systems 28, 1: 3--36.",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Young S Lee, Joe Tullio, Nitya Narasimhan, Pallavi Kaushik, Jonathan R Engelsma, and Santosh Basapur. 2009. Investigating the Potential of In-Home Devices for Improving Medication Adherence. Pervasive Computing Technologies for Healthcare, 2009, IEEE, 1--8.",
      "doi": ""
    },
    {
      "text": "K Lewin. 1946. Action research and minority problems. Journal of Social Issues 2, 4: 34--46.",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Cas Ladha, Karim Ladha, Katie Brittain, and Patrick Olivier. 2012. Empathy, Participatory Design and People with Dementia. Proc. of CHI '12: 521--530.  ",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Guy Schofield, and Patrick Olivier. 2012. Engaging Older People using Participatory Design. Proc. of CHI '12: 1199--1208.  ",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Linda Little and Pam Briggs. 2009. Pervasive healthcare: the elderly perspective. Proc. of PETRA '09.  ",
      "doi": "10.1145/1579114.1579185"
    },
    {
      "text": "Lesa Lorenzen-Huber, Mary Boutain, L. Jean Camp, Kalpana Shankar, and Kay H. Connelly. 2011. Privacy, Technology, and Aging: A Proposed Framework. Ageing International 36, 2: 232--252.",
      "doi": ""
    },
    {
      "text": "Michael Massimi and Ronald Baecker. 2006. Participatory Design Process with Older Users. Proc. UbiCoomp2006 Workshop on future media.",
      "doi": ""
    },
    {
      "text": "Tracy L Mitzner, Julie B Boron, Cara Bailey Fausset, et al. 2011. Older Adults Talk Technology: Technology Usage and Attitudes. Computers in Human Behavior 26, 6: 1710--1721.  ",
      "doi": "10.1016/j.chb.2010.06.020"
    },
    {
      "text": "Claudia Müller. 2014. Praxisbasiertes Technologiedesign für die alternde Gesellschaft. Josef Eul Verlag, Lohmar.",
      "doi": ""
    },
    {
      "text": "Claudia Müller, Dominik Hornung, Theodor Hamm, and Volker Wulf. 2015. Practice - based Design of a Neighborhood Portal?: Focusing on Elderly Tenants in a City Quarter Living Lab. CHI '15.",
      "doi": "10.1145/2702123.2702449"
    },
    {
      "text": "Claudia Müller, Dominik Hornung, Theodor Hamm, and Volker Wulf. 2015. Measures and Tools for Supporting ICT Appropriation by Elderly and Non Tech-Savvy Persons in a Long-Term Perspective. Proceedings of the 14th Conference on Computer Supported Cooperative Work (ECSCW 2015).",
      "doi": ""
    },
    {
      "text": "Claudia Müller, Dominik Hornung, Theodor Hamm, and Volker Wulf. 2015. Appropriation of Tablet PCs by Non-Tech Savvy Seniors: Options and Obstacles of Sustainable, Practice-based Learning in the Elderly. Proceedings of The Computer Supported Collaborative Learning (CSCL) Conference 2015, International Society of the Learning Sciences, Inc. {ISLS}, 701--702.",
      "doi": ""
    },
    {
      "text": "Claudia Müller, Cornelius Neufeldt, David Randall, and Volker Wulf. 2012. ICT-Development in Residential Care Settings: Sensitizing Design to the Life Circumstances of the Residents of a Care Home. CHI '12, 2639--2648.  ",
      "doi": "10.1145/2207676.2208655"
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington Law Review 79, 1: 101--139.",
      "doi": ""
    },
    {
      "text": "Aisling A O'Kane, Helen M Mentis, and Eno Thereska. 2013. Non-Static Nature of Patient Consent?: Shifting Privacy Perspectives in Health Information Sharing. Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW-2013), ACM, 553--562.  ",
      "doi": "10.1145/2441776.2441838"
    },
    {
      "text": "Corinna Ogonowski, Benedikt Ley, Jan Hess, Lin Wan, and Volker Wulf. 2013. Designing for the Living Room?: Long-Term User Involvement in a Living Lab. Proc. of CHI '13: 1539--1548.  ",
      "doi": "10.1145/2470654.2466205"
    },
    {
      "text": "Maarten Overdijk and WV Diggelen. 2007. Appropriation of a graphical shared workspace: The learner-tool connection. Proc. of CSCL '07: 570--572. ",
      "doi": "10.5555/1599600.1599707"
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking \"privacy\" for a networked world. Proceedings of the conference on Human factors in computing systems CHI '03, 5: 129.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Sebastiaan T.M. Peek, Eveline J.M. Wouters, Joost van Hoof, Katrien G. Luijkx, Hennie R. Boeije, and Hubertus J.M. Vrijhoef. 2014. Factors influencing acceptance of technology for aging in place: A systematic review. International Journal of Medical Informatics 83, 4: 235--248.",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories as informal lessons about security. Proc. of SOUPS '12.  ",
      "doi": "10.1145/2335356.2335364"
    },
    {
      "text": "Karen Renaud and Judith Ramsay. 2007. Now what was that password again? A more flexible way of identifying and authenticating our seniors. Behaviour & Information Technology.  ",
      "doi": "10.1080/01449290601173770"
    },
    {
      "text": "Mark Rice and Alex Carmichael. 2011. Factors facilitating or impeding older adults' creative contributions in the collaborative design of a novel DTV-based application. Universal Access in the Information Society 12, 1: 5--19.  ",
      "doi": "10.1007/s10209-011-0262-8"
    },
    {
      "text": "Thomas Scheffler, Sven Schindler, Marcus Lewerenz, and Bettina Schnor. 2011. A privacy-aware localization service for healthcare environments. Proc. of PETRA '11: 1.  ",
      "doi": "10.1145/2141622.2141683"
    },
    {
      "text": "Irina Shklovski, Louise Barkhuus, Nis Bornoe, and Joseph 'Jofish' Kaye. 2015. Friendship Maintenance in the Digital Age: Applying a Relational Lens to Online Social Interaction. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15: 1477--1487.  ",
      "doi": "10.1145/2675133.2675294"
    },
    {
      "text": "Irina Shklovski, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and creepiness in app space: perceptions of privacy and mobile app use. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2347--2356.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Tom Sorell, Heather Draper, and T Sorell. 2014. Robot carers, ethics, and older people. Ethics and Information Technology 16, 3: 183--195.  ",
      "doi": "10.1007/s10676-014-9344-7"
    },
    {
      "text": "Gunnar Stevens, Volkmar Pipek, and Volker Wulf. 2010. Appropriation infrastructure: mediating appropriation and production work. Journal of Organizational and End User Computing 22, 2: 58-- 81.  ",
      "doi": "10.4018/joeuc.2010040104"
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunprhy, Andrew Monk, and Patrick Olivier. 2012. Questionable Concepts: Critique as Resource for Designing with Eighty Somethings. Proc. of CHI '12: 1169--1178.  ",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "Lev Vygotsky. 1978. Mind in Society: Development of Higher Psychological Processes. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Lin Wan, Claudia Müller, Volker Wulf, and DW Randall. 2014. Addressing the subtleties in dementia care: pre-study & evaluation of a GPS monitoring system. Proc. of CHI '14: 3987--3996.  ",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "David Wood, Jerome S Bruner, and Gail Ross. 1976. the Role of Tutoring in Problem Solving *. Journal of child psychology and psychiatry 17, September 1974: 89--100.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Claudia Müller, Volkmar Pipek, David Randall, and Markus Rohde. 2015. Practice-based Computing: Empirically-grounded Conceptualizations derived from Design Case Studies. Designing Socially Embedded Technologies in the Real-World.",
      "doi": ""
    },
    {
      "text": "Martina Ziefle, Simon Himmel, and Wiktoria Wilkowska. 2011. When Your Living Space Knows What You Do?: Acceptance of Medical Home Monitoring by Different Technologies. Symposium of the Austrian HCI and Usability Engineering Group: 607--624.  ",
      "doi": "10.1007/978-3-642-25364-5_43"
    }
  ]
}