{
  "doi": "10.1145/3025453.3026008",
  "title": "Commitment of Newcomers and Old-timers to Online Health Support Communities",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6363-6375",
  "year": 2017,
  "badges": [],
  "abstract": "For online communities to be successful, they must retain an adequate number of members who contribute to the community. The amount and type of communication members receive can play an important role in generating and sustaining members' commitment to it. However, the communication that members find valuable may change with their tenure in the community. This paper examines how the communication members receive in an health support community influences their commitment and how this influence changes with their tenure in the community. Commitment was operationalized with three measures: self-reported attachment, continued participation in the community, and responding to others. Results show that receiving communication was generally associated with increased commitment across the three measures, with its impact increasing with members' tenure. However, the average amount of informational and emotional support members received per message was associated with decreased commitment. Results have implications for interventions to encourage members' commitment to their communities throughout their history in the community.",
  "authors": [
    {
      "name": "Diyi Yang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87258642957",
      "orcid": "0000-0003-1220-3983"
    },
    {
      "name": "Robert Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "John M. Levine",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456625123",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Frederik Anseel, Adam S Beatty, Winny Shen, Filip Lievens, and Paul R Sackett. 2015. How are we doing after 30 years? A meta-analytic review of the antecedents and outcomes of feedback-seeking behavior. Journal of Management 41, 1 (2015), 318--348.",
      "doi": ""
    },
    {
      "text": "Jaime Arguello, Brian S Butler, Elisabeth Joyce, Robert Kraut, Kimberly S Ling, Carolyn Rosé, and Xiaoqing Wang. 2006. Talk to me: foundations for successful individual-group interactions in online communities. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 959--968.  ",
      "doi": "10.1145/1124772.1124916"
    },
    {
      "text": "Jo Armes, Maggie Crowe, Lynne Colbourne, Helen Morgan, Trevor Murrells, Catherine Oakley, Nigel Palmer, Emma Ream, Annie Young, and Alison Richardson. 2009. Patients' supportive care needs beyond the end of cancer treatment: a prospective, longitudinal survey. Journal of Clinical Oncology 27, 36 (2009), 6172--6179.",
      "doi": ""
    },
    {
      "text": "Blake E Ashforth, David M Sluss, and Alan M Saks. 2007. Socialization tactics, proactive behavior, and newcomer learning: Integrating socialization models. Journal of Vocational Behavior 70, 3 (2007), 447--462.",
      "doi": ""
    },
    {
      "text": "Blake K Ashforth and Alan M Saks. 1996. Socialization tactics: Longitudinal effects on newcomer adjustment. Academy of Management Journal 39, 1 (1996), 149--178.",
      "doi": ""
    },
    {
      "text": "Antonina Bambina. 2007. Online social support: the interplay of social networks and computer-mediated communication. Cambridge Press. ",
      "doi": "10.5555/1534606"
    },
    {
      "text": "Thomas S Bateman and Stephen Strasser. 1984. A longitudinal analysis of the antecedents of organizational commitment. Academy of Management Journal 27, 1 (1984), 95--112.",
      "doi": ""
    },
    {
      "text": "Talya N Bauer, Todd Bodner, Berrin Erdogan, Donald M Truxillo, and Jennifer S Tucker. 2007. Newcomer adjustment during organizational socialization: a meta-analytic review of antecedents, outcomes, and methods. Journal of Applied Psychology 92, 3 (2007), 707.",
      "doi": ""
    },
    {
      "text": "Prakhar Biyani, Cornelia Caragea, Prasenjit Mitra, and John Yen. 2014. Identifying Emotional and Informational Support in Online Health Communities.. In COLING. 827--836.",
      "doi": ""
    },
    {
      "text": "Robert D Caplan. 1987. Person-environment fit theory and organizations: Commensurate dimensions, time perspectives, and mechanisms. Journal of Vocational Behavior 31, 3 (1987), 248--267.",
      "doi": ""
    },
    {
      "text": "Wen-ying Sylvia Chou, Benmei Liu, Samantha Post, and Bradford Hesse. 2011. Health-related Internet use among cancer survivors: data from the Health Information National Trends Survey, 2003--2008. Journal of Cancer Survivorship 5, 3 (2011), 263--270.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen, Patricia Cohen, Stephen G West, and Leona S Aiken. 2013. Applied multiple regression/correlation analysis for the behavioral sciences. Routledge.",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen. 2004. Social relationships and health. American Psychologist 59, 8 (2004), 676.",
      "doi": ""
    },
    {
      "text": "Debra R Comer. 1991. Organizational newcomers' acquisition of information from peers. Management Communication Quarterly 5, 1 (1991), 64--89.",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Charles Steinfield, and Cliff Lampe. 2011. Connection strategies: Social capital implications of Facebook-enabled communication practices. New Media & Society (2011), 873--892.",
      "doi": ""
    },
    {
      "text": "Samer Faraj and Steven L Johnson. 2011. Network exchange patterns in online communities. Organization Science 22, 6 (2011), 1464--1480.  ",
      "doi": "10.1287/orsc.1100.0600"
    },
    {
      "text": "Rosta Farzan, Laura A. Dabbish, Robert E. Kraut, and Tom Postmes. 2011. Increasing Commitment to Online Communities by Designing for Social Presence. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 321--330.  ",
      "doi": "10.1145/1958824.1958874"
    },
    {
      "text": "Kathryn Greene, Valerian J Derlega, and Alicia Mathews. 2006. Self-disclosure in personal relationships. The Cambridge Handbook of Personal Relationships (2006), 409--427.",
      "doi": ""
    },
    {
      "text": "Jamie A Gruman, Alan M Saks, and David I Zweig. 2006. Organizational socialization tactics and newcomer proactive behaviors: An integrative study. Journal of Vocational Behavior 69, 1 (2006), 90--104.",
      "doi": ""
    },
    {
      "text": "Lisa K Gundry. 1993. Fitting into technical organizations: The socialization of newcomer engineers. IEEE Transactions on Engineering Management 40, 4 (1993), 335--345.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, and John Riedl. 2012. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist (2012), 0002764212469365.",
      "doi": ""
    },
    {
      "text": "David Huffaker. 2010. Dimensions of leadership and social influence in online communities. Human Communication Research 36, 4 (2010), 593--617.",
      "doi": ""
    },
    {
      "text": "Mary C Johannesen-Schmidt and Alice H Eagly. 2002. Diminishing returns: The effects of income on the content of stereotypes of wage earners. Personality and Social Psychology Bulletin 28, 11 (2002), 1538--1545.",
      "doi": ""
    },
    {
      "text": "Emil Kauder. 2015. History of Marginal Utility Theory. Princeton University Press (2015).",
      "doi": ""
    },
    {
      "text": "Luke Keele and Nathan J Kelly. 2006. Dynamic models for dynamic theories: The ins and outs of lagged dependent variables. Political Analysis 14, 2 (2006), 186--205.",
      "doi": ""
    },
    {
      "text": "Amy Jo Kim. 2000. Community building on the web: Secret strategies for successful online communities. Addison-Wesley Longman Publishing Co., Inc. ",
      "doi": "10.5555/518514"
    },
    {
      "text": "Robert Kraut, Moira Burke, John Riedl, and P Resnick. 2012. The challenges of dealing with newcomers. Building successful online communities: Evidence-based social design 1 (2012), 179--230.",
      "doi": ""
    },
    {
      "text": "Sophie Lebel, Zeev Rosberger, Linda Edgar, and Gerald M Devins. 2007. Comparison of four common stressors across the breast cancer trajectory. Journal of Psychosomatic Research 63, 3 (2007), 225--232.",
      "doi": ""
    },
    {
      "text": "Denis MS Lee and Thomas J Allen. 1982. Integrating new technical staff: Implications for acquiring new technology. Management Science 28, 12 (1982), 1405--1420.  ",
      "doi": "10.1287/mnsc.28.12.1405"
    },
    {
      "text": "Jeffrey A LePine, Amir Erez, and Diane E Johnson. 2002. The nature and dimensionality of organizational citizenship behavior: a critical review and meta-analysis. Journal of Applied Psychology 87, 1 (2002), 52.",
      "doi": ""
    },
    {
      "text": "John M Levine and Richard L Moreland. 1994. Group socialization: Theory and research. European Review of Social Psychology 5, 1 (1994), 305--336.",
      "doi": ""
    },
    {
      "text": "Michelle Elizabeth McDowell, Stefano Occhipinti, M Ferguson, Jeffrey Dunn, and SK Chambers. 2010. Predictors of change in unmet supportive care needs in cancer. Psycho-Oncology 19, 5 (2010), 508--516.",
      "doi": ""
    },
    {
      "text": "M Ann McFadyen and Albert A Cannella. 2004. Social capital and knowledge creation: Diminishing returns of the number and strength of exchange relationships. Academy of Management Journal 47, 5 (2004), 735--746.",
      "doi": ""
    },
    {
      "text": "Katelyn YA McKenna, Amie S Green, and Marci EJ Gleason. 2002. Relationship formation on the Internet: What's the big attraction? Journal of Social Issues 58, 1 (2002), 9--31.",
      "doi": ""
    },
    {
      "text": "Andrea Meier, Elizabeth J Lyons, Gilles Frydman, Michael Forlenza, and Barbara K Rimer. 2007. How cancer survivors provide support on cancer-related Internet mailing lists. J Med Internet Res 9, 2 (2007), e12.",
      "doi": ""
    },
    {
      "text": "Vernon D Miller and Fredric M Jablin. 1991. Information seeking during organizational entry: Influences, tactics, and a model of the process. Academy of Management Review 16, 1 (1991), 92--120.",
      "doi": ""
    },
    {
      "text": "Elizabeth Wolfe Morrison. 2002. Information seeking within organizations. Human Communication Research 28, 2 (2002), 229--242.",
      "doi": ""
    },
    {
      "text": "Richard T Mowday, Richard M Steers, and Lyman W Porter. 1979. The measurement of organizational commitment. Journal of Vocational Behavior 14, 2 (1979), 224--247.",
      "doi": ""
    },
    {
      "text": "Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians Are Born, Not Made: A Study of Power Editors on Wikipedia. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (GROUP '09). ACM, New York, NY, USA, 51--60.  ",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Katherine Panciera, Reid Priedhorsky, Thomas Erickson, and Loren Terveen. 2010. Lurking cyclopaths?: a quantitative lifecycle analysis of user behavior in a geowiki. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1917--1926.  ",
      "doi": "10.1145/1753326.1753615"
    },
    {
      "text": "Jenny Preece, Blair Nonnecke, and Dorine Andrews. 2004. The top five reasons for lurking: improving community experiences for everyone. Computers in Human Behavior 20, 2 (2004), 201--223.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece and Ben Shneiderman. 2009. The reader-to-leader framework: Motivating technology-mediated social participation. AIS Transactions on Human-Computer Interaction 1, 1 (2009), 13--32.",
      "doi": ""
    },
    {
      "text": "Deborah A Prentice, Dale T Miller, and Jenifer R Lightdale. 1994. Asymmetries in attachments to groups and to their members: Distinguishing between common-identity and common-bond groups. Personality & Social Psychology Bulletin 20, 5 (1994).",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, F Maxwell Harper, Sara Drenner, Loren Terveen, Sara Kiesler, John Riedl, and R Kraut. 2012. Increasing attachment to online communities: Evidence-based design. MIS Quarterly 36, 3 (2012), 841--864.",
      "doi": "10.5555/2481655.2481665"
    },
    {
      "text": "Yuqing Ren, Robert Kraut, and Sara Kiesler. 2007. Applying common identity and bond theory to design of online communities. Organization Studies 28, 3 (2007), 377--408.",
      "doi": ""
    },
    {
      "text": "Catherine M Ridings and David Gefen. 2004. Virtual community attraction: Why people hang out online. Journal of Computer-Mediated Communication 10, 1 (2004), 00--00.",
      "doi": ""
    },
    {
      "text": "Barbara K Rimer, Elizabeth J Lyons, Kurt M Ribisl, J Michael Bowling, Carol E Golin, Michael J Forlenza, and Andrea Meier. 2005. How new subscribers use cancer-related online mailing lists. Journal of Medical Internet Research 7, 3 (2005), e32.",
      "doi": ""
    },
    {
      "text": "Shelly Rodgers and Qimei Chen. 2005. Internet community group participation: Psychosocial benefits for women with breast cancer. Journal of Computer-Mediated Communication 10, 4 (2005), 00--00.",
      "doi": ""
    },
    {
      "text": "Keith Rollag. 2004. The impact of relative tenure on newcomer socialization dynamics. Journal of Organizational Behavior 25, 7 (2004), 853--872.",
      "doi": ""
    },
    {
      "text": "Alan Saks and Jamie A. Gruman. 2014. Making organizations more effective through organizational socialization. Journal of Organizational Effectiveness: People and Performance 1, 3 (2014), 261--280.",
      "doi": ""
    },
    {
      "text": "Kai Sassenberg. 2002. Common bond and common identity groups on the Internet: Attachment and normative behavior in on-topic and off-topic chats. Group Dynamics: Theory, Research, and Practice 6, 1 (2002), 27.",
      "doi": ""
    },
    {
      "text": "Benjamin Schneider, D Brent Smith, and Harold W Goldstein. 2000. Attraction--selection--attrition: Toward a person--environment psychology of organizations. Lawrence Erlbaum Associates Publishers.",
      "doi": ""
    },
    {
      "text": "Bret R Shaw, Fiona McTavish, Robert Hawkins, David H Gustafson, and Suzanne Pingree. 2000. Experiences of women with breast cancer: exchanging social support over the CHESS computer network. Journal of Health Communication 5, 2 (2000), 135--159.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Amela Sadagic, Martin Usoh, and Ralph Schroeder. 2000. Small-group behavior in a virtual and real environment: A comparative study. Presence 9, 1 (2000), 37--51.  ",
      "doi": "10.1162/105474600566600"
    },
    {
      "text": "LP StataCorp and others. 2007. Stata data analysis and statistical Software. Special Edition Release 10 (2007).",
      "doi": ""
    },
    {
      "text": "Yla R Tausczik, Laura A Dabbish, and Robert E Kraut. 2014. Building loyalty to online communities through bond and identity-based attachment to sub-groups. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 146--157.  ",
      "doi": "10.1145/2531602.2531688"
    },
    {
      "text": "Tatiana A Vlahovic, Yi-Chia Wang, Robert E Kraut, and John M Levine. 2014. Support matching and satisfaction in an online breast cancer support community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1625--1634.  ",
      "doi": "10.1145/2556288.2557108"
    },
    {
      "text": "Yi-Chia Wang, Robert Kraut, and John M Levine. 2012. To stay or leave?: the relationship of emotional and informational support to commitment in online health support groups. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 833--842.  ",
      "doi": "10.1145/2145204.2145329"
    },
    {
      "text": "Yi-Chia Wang, Robert E Kraut, and John M Levine. 2015. Eliciting and receiving online support: using computer-aided content analysis to examine the dynamics of online social support. Journal of Medical Internet Research 17, 4 (2015), e99.",
      "doi": ""
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA - a computer program for the study of natural language communication between man and machine. Commun. ACM 9, 1 (1966), 36--45.  ",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Haiyi Zhu, Robert Kraut, and Aniket Kittur. 2012. Effectiveness of shared leadership in online communities. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 407--416.  ",
      "doi": "10.1145/2145204.2145269"
    }
  ]
}