{
  "doi": "10.1145/3025453.3025455",
  "title": "GazeEverywhere: Enabling Gaze-only User Interaction on an Unmodified Desktop PC in Everyday Scenarios",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3034-3044",
  "year": 2017,
  "badges": [],
  "abstract": "Eye tracking is becoming more and more affordable, and thus gaze has the potential to become a viable input modality for human-computer interaction. We present the GazeEverywhere solution that can replace the mouse with gaze control by adding a transparent layer on top of the system GUI. It comprises three parts: i) the SPOCK interaction method that is based on smooth pursuit eye movements and does not suffer from the Midas touch problem; ii) an online recalibration algorithm that continuously improves gaze-tracking accuracy using the SPOCK target projections as reference points; and iii) an optional hardware setup utilizing head-up display technology to project superimposed dynamic stimuli onto the PC screen where a software modification of the system is not feasible. In validation experiments, we show that GazeEverywhere's throughput according to ISO 9241-9 was improved over dwell time based interaction methods and nearly reached trackpad level. Online recalibration reduced interaction target ('button') size by about 25%. Finally, a case study showed that users were able to browse the internet and successfully run Wikirace using gaze only, without any plug-ins or other modifications.",
  "tags": [
    "smooth pursuit",
    "mouse replacement",
    "gaze-based interaction",
    "eye tracking"
  ],
  "authors": [
    {
      "name": "Simon Schenk",
      "institution": "Technische Universität München, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162057",
      "orcid": "missing"
    },
    {
      "name": "Marc Dreiser",
      "institution": "Technische Universität München, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160924",
      "orcid": "missing"
    },
    {
      "name": "Gerhard Rigoll",
      "institution": "Technische Universität München, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100243533",
      "orcid": "missing"
    },
    {
      "name": "Michael Dorr",
      "institution": "Technische Universität München, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484681",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1. Hyunjin Ahn, Jaeseok Yoon, Gulji Chung, Kibum Kim, Jiyeon Ma, Hyunbin Choi, Donguk Jung, and Joongseek Lee. 2015. DOWELL: Dwell-time Based Smartphone Control Solution for People with Upper Limb Disabilities. In Proc. of the SIGCHI Conf. Ext. Abst. on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 887--892. DOI: http://dx.doi.org/10.1145/2702613.2732862  ",
      "doi": "10.1145/2702613.2732862"
    },
    {
      "text": "2. Patrick Bader, Niels Henze, Nora Broy, and Katrin Wolf. 2016. The Effect of Focus Cues on Separation of Information Layers. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 509--514. DOI: http://dx.doi.org/10.1145/2858036.2858312  ",
      "doi": "10.1145/2858036.2858312"
    },
    {
      "text": "3. Nikolaus Bee and Elisabeth André. 2008. Writing with Your Eye: A Dwell Time Free Writing System Adapted to the Nature of Human Eye Gaze. In Proc. of the 4th IEEE tutorial and research workshop on Perception and Interactive Technologies for Speech-Based Systems: Perception in Multimodal Dialogue Systems (PIT '08). Springer, 111--122.  ",
      "doi": "10.1007/978-3-540-69369-7_13"
    },
    {
      "text": "4. Darrell S. Best and Andrew T. Duchowski. 2016. A rotary dial for gaze-based PIN entry. In Proc. of the 9th Biennial ACM Symp. on Eye Tracking Research & Applications (ETRA '16). ACM, 69--76. DOI: http://dx.doi.org/10.1145/2857491.2857527  ",
      "doi": "10.1145/2857491.2857527"
    },
    {
      "text": "5. Dietlind Helene Cymek, Antje Christine Venjakob, Stefan Ruff, Otto Hans-Martin Lutz, Simon Hofmann, and Matthias Roetting. 2014. Entering PIN codes by smooth pursuit eye movements. Journal of Eye Movement Research 7, 4 (2014), 1--11.",
      "doi": ""
    },
    {
      "text": "6. Michael Dorr, Martin Böhme, Thomas Martinetz, and Erhardt Barth. 2007. Gaze beats mouse: A case study. In Proc. of the 3rd Conf. on Communication by Gaze Interaction (COGAIN '07). 16--19.",
      "doi": ""
    },
    {
      "text": "7. Sarah A. Douglas, Arthur E. Kirkpatrick, and I. Scott MacKenzie. 1999. Testing pointing device performance and user assessment with the ISO 9241, Part 9 standard. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 215--222. DOI: http://dx.doi.org/10.1145/302979.303042  ",
      "doi": "10.1145/302979.303042"
    },
    {
      "text": "8. Heiko Drewes and Albrecht Schmidt. 2007. Interacting with the Computer Using Gaze Gestures. In Proc. of the 11th IFIP Int. Conf. on Human-Computer Interaction. INTERACT '07, Vol. 4663. Springer, Berlin, 475--488. DOI:http://dx.doi.org/10.1007/978--3--540--74800--7{_}43",
      "doi": ""
    },
    {
      "text": "9. Augusto Esteves, Eduardo Velloso, Andreas Bulling, and Hans Gellersen. 2015. Orbits: Gaze Interaction for Smart Watches using Smooth Pursuit Eye Movements. In Proc. of the 28th Annual ACM Symp. on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 457--466. DOI: http://dx.doi.org/10.1145/2807442.2807499  ",
      "doi": "10.1145/2807442.2807499"
    },
    {
      "text": "10. Jens R. Helmert, Sebastian Pannasch, and Boris M. Velichkovsky. 2008. Influences of dwell time and cursor control on the performance in gaze driven typing. Journal of Eye Movement Research 2, 4 (2008), 1--8.",
      "doi": ""
    },
    {
      "text": "11. Anke Huckauf and Mario H. Urbina. 2011. Object Selection in Gaze Controlled Systems: What You Don't Look at is What You Get. ACM Transactions on Applied Perception 8, 2 (2011), 13:1--13:14. DOI: http://dx.doi.org/10.1145/1870076.1870081  ",
      "doi": "10.1145/1870076.1870081"
    },
    {
      "text": "12. Robert J. K. Jacob. 1990. What you look at is what you get: eye movement-based interaction techniques. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '90). ACM, New York, NY, USA, 11--18. DOI:http://dx.doi.org/10.1145/97243.97246  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "13. Chris Lankford. 2000. Effective Eye-gaze Input into Windows. In Proc. of the 1st Biennial Symp. on Eye Tracking Research & Applications (ETRA '00). ACM, New York, NY, USA, 23--27. DOI: http://dx.doi.org/10.1145/355017.355021  ",
      "doi": "10.1145/355017.355021"
    },
    {
      "text": "14. Christof Lutteroth, Moiz Penkar, and Gerald Weber. 2015. Gaze vs. Mouse: A Fast and Accurate Gaze-Only Click Alternative. In Proc. of the 28th Annual ACM Symp. on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 385--394. DOI: http://dx.doi.org/10.1145/2807442.2807461  ",
      "doi": "10.1145/2807442.2807461"
    },
    {
      "text": "15. I. Scott MacKenzie. 2010. An eye on input. In Proc. of the 6th Biennial ACM Symp. on Eye Tracking Research & Applications (ETRA '10). ACM, 11--12. DOI: http://dx.doi.org/10.1145/1743666.1743668  ",
      "doi": "10.1145/1743666.1743668"
    },
    {
      "text": "16. John Magee, Torsten Felzer, and I. Scott MacKenzie. 2015. Camera Mouse + ClickerAID: Dwell vs. Single-Muscle Click Actuation in Mouse-Replacement Interfaces. In Proc. of the 16th Int. Conf. on Human-Computer Interaction (LNCS), Vol. 9170. 74--84. ",
      "doi": ""
    },
    {
      "text": "17. Päivi Majaranta, Ulla-Kaija Ahola, and Oleg Špakov. 2009. Fast Gaze Typing with an Adjustable Dwell Time. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 357--360. DOI: http://dx.doi.org/10.1145/1518701.1518758  ",
      "doi": "10.1145/1518701.1518758"
    },
    {
      "text": "18. Päivi Majaranta, Anne Aula, and Kari-Jouko Räihä. 2004. Effects of Feedback on Eye Typing with a Short Dwell Time. In Proc. of the 3rd Biennial ACM Symp. on Eye Tracking Research & Applications (ETRA '04). ACM, 139--146. DOI:http://dx.doi.org/10.1145/968363.968390  ",
      "doi": "10.1145/968363.968390"
    },
    {
      "text": "19. Emilie Møllenbach, John Paulin Hansen, and Martin Lillholm. 2013. Eye Movements in Gaze Interaction. Journal of Eye Movement Research 6, 1 (2013), 1--15.",
      "doi": ""
    },
    {
      "text": "20. Emilie Møllenbach, John Paulin Hansen, Martin Lillholm, and Alastair G. Gale. 2009. Single Stroke Gaze Gestures. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 4555--4560. DOI: http://dx.doi.org/10.1145/1520340.1520699  ",
      "doi": "10.1145/1520340.1520699"
    },
    {
      "text": "21. Diogo Pedrosa, Maria da Graça Pimentel, and Khai N. Truong. 2015. Filteryedping: A Dwell-Free Eye Typing Technique. In Proc. of the SIGCHI Conf. Ext. Abst. on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 303--306. DOI: http://dx.doi.org/10.1145/2702613.2725458  ",
      "doi": "10.1145/2702613.2725458"
    },
    {
      "text": "22. Abdul Moiz Penkar, Christof Lutteroth, and Gerald Weber. 2012. Designing for the Eye: Design Parameters for Dwell in Gaze Interaction. In Proc. of the 24th Australian Computer-Human Interaction Conf. (OzCHI '12). ACM, New York, NY, USA, 479--488. DOI: http://dx.doi.org/10.1145/2414536.2414609  ",
      "doi": "10.1145/2414536.2414609"
    },
    {
      "text": "23. D. A. Ray. 1969. Head-Up Display. The Aeronautical Journal 73, 703 (1969), 622--624. DOI: http://dx.doi.org/10.1017/S0001924000052295",
      "doi": ""
    },
    {
      "text": "24. Dario D. Salvucci and John R. Anderson. 2000. Intelligent Gaze-added Interfaces. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 273--280. DOI: http://dx.doi.org/10.1145/332040.332444  ",
      "doi": "10.1145/332040.332444"
    },
    {
      "text": "25. Simon Schenk, Philipp Tiefenbacher, Gerhard Rigoll, and Michael Dorr. 2016. SPOCK: A Smooth Pursuit Oculomotor Control Kit. In Proc. of the SIGCHI Conf. Ext. Abst. on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2681--2687. DOI: http://dx.doi.org/10.1145/2851581.2892291  ",
      "doi": "10.1145/2851581.2892291"
    },
    {
      "text": "26. Donald Shepard. 1968. A Two-dimensional Interpolation Function for Irregularly-spaced Data. In Proc. of the 1968 23rd ACM Nat. Conf. (ACM '68). ACM, New York, NY, USA, 517--524. DOI: http://dx.doi.org/10.1145/800186.810616  ",
      "doi": "10.1145/800186.810616"
    },
    {
      "text": "27. Henrik Skovsgaard, Julio C. Mateo, John M. Flach, and John Paulin Hansen. 2010. Small-target Selection with Gaze Alone. In Proc. of the 6th Biennial ACM Symp. on Eye Tracking Research & Applications (ETRA '10). ACM, 145--148. DOI: http://dx.doi.org/10.1145/1743666.1743702  ",
      "doi": "10.1145/1743666.1743702"
    },
    {
      "text": "28. Mélodie Vidal, Andreas Bulling, and Hans Gellersen. 2013. Pursuits: spontaneous interaction with displays based on smooth pursuit eye movement and moving targets. In Proc. of the 2013 ACM Joint Conf. on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 439--448. DOI: http://dx.doi.org/10.1145/2493432.2493477  ",
      "doi": "10.1145/2493432.2493477"
    },
    {
      "text": "29. David J. Ward and David J. C. MacKay. 2002. Fast Hands-free Writing by Gaze Direction. Nature 418 (2002), 838. DOI:http://dx.doi.org/10.1038/418838a ",
      "doi": ""
    },
    {
      "text": "30. Jacob O. Wobbrock, Kristen Shinohara, and Alex Jansen. 2011. The effects of task dimensionality, endpoint deviation, throughput calculation, and experiment design on pointing measures and models. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1639--1648. DOI: http://dx.doi.org/10.1145/1978942.1979181  ",
      "doi": "10.1145/1978942.1979181"
    },
    {
      "text": "31. Xuan Zhang and I. Scott MacKenzie. 2007. Evaluating eye tracking with ISO 9241-part 9. In Proc. of the 12th Int. Conf. of HCI Intelligent Multimodal Interaction Environments, Part III (HCII '07). 779--788.",
      "doi": "10.5555/1769590.1769678"
    }
  ]
}