{
  "doi": "10.1145/3025453.3025755",
  "title": "Drone & Wo: Cultural Influences on Human-Drone Interaction Techniques",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6794-6799",
  "year": 2017,
  "badges": [],
  "abstract": "As drones become ubiquitous, it is important to understand how cultural differences impact human-drone interaction. A previous elicitation study performed in the USA illustrated how users would intuitively interact with drones. We replicated this study in China to gain insight into how these user-defined interactions vary across the two cultures. We found that as per the US study, Chinese participants chose to interact primarily using gesture. However, Chinese participants used multi-modal interactions more than their US counterparts. Agreement for many proposed interactions was high within each culture. Across cultures, there were notable differences despite similarities in interaction modality preferences. For instance, culturally-specific gestures emerged in China, such as a T-shape gesture for stopping the drone. Participants from both cultures anthropomorphized the drone, and welcomed it into their personal space. We describe the implications of these findings on designing culturally-aware and intuitive human-drone interaction.",
  "tags": [
    "gesture",
    "elicitation study",
    "quadcopter",
    "human-drone interaction",
    "cross-cultural design",
    "uav",
    "drone"
  ],
  "authors": [
    {
      "name": "Jane L. E",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-99658729422/rel-imgonly/janee_0148.jpg",
      "acmid": "99658729422",
      "orcid": "missing"
    },
    {
      "name": "Ilene L. E",
      "institution": "West Windsor-Plainsboro High School South, Princeton Junction, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162182",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    },
    {
      "name": "Jessica R. Cauchard",
      "institution": "Stanford University & Interdisciplinary Center Herzliya, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81490695001/rel-imgonly/2019_12_31_002.jpg",
      "acmid": "81490695001",
      "orcid": "0000-0002-8916-8787"
    }
  ],
  "references": [
    {
      "text": "Dane Archer. 1997. Unspoken Diversity: Cultural Differences in Gestures. Qualitative Sociology 20, 1 (1997), 79--105.",
      "doi": ""
    },
    {
      "text": "Jessica R. Cauchard, Jane L. E, Kevin Y. Zhai, and James A. Landay. 2015. Drone & Me: An Exploration into Natural Human-Drone Interaction. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 361--365.  ",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Jessica R. Cauchard, Kevin Y. Zhai, Marco Spadafora, and James A. Landay. 2016. Emotion Encoding in Human-Drone Interaction. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 263--270. http://dl.acm.org/citation.cfm?id=2906831.2906878 ",
      "doi": "10.5555/2906831.2906878"
    },
    {
      "text": "Nicholas Epley, Adam Waytz, and John T. Cacioppo. 2007. On seeing human: a three-factor theory of anthropomorphism. Psychological review 114, 4 (2007), 864.",
      "doi": ""
    },
    {
      "text": "Vanessa Evers, Heidy C. Maldonado, Talia L. Brodecki, and Pamela J. Hinds. 2008. Relational vs. group self-construal: Untangling the role of national culture in HRI. In Human-Robot Interaction (HRI), 2008 3rd ACM/IEEE International Conference on. ACM, NY, NY, USA, 255--262.  ",
      "doi": "10.1145/1349822.1349856"
    },
    {
      "text": "Susan R. Fussell, Sara Kiesler, Leslie D. Setlock, and Victoria Yew. 2008. How People Anthropomorphize Robots. In Proceedings of the 3rd ACM/IEEE International Conference on Human Robot Interaction (HRI '08). ACM, NY, NY, USA, 145--152.  ",
      "doi": "10.1145/1349822.1349842"
    },
    {
      "text": "Jennifer Goetz and Sara Kiesler. 2002. Cooperation with a Robotic Assistant. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 578--579.  ",
      "doi": "10.1145/506443.506492"
    },
    {
      "text": "Edward T. Hall. 1966. The hidden dimension. Doubleday & Co, Garden City, NY.",
      "doi": ""
    },
    {
      "text": "Edward T. Hall. 1989. Beyond culture. Anchor, NY, NY, USA.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 1991. Cultures and organizations: Software of the mind. McGraw-Hill, London, England.",
      "doi": ""
    },
    {
      "text": "Michiel Joosse, Manja Lohse, and Vanessa Evers. 2014. Lost in proxemics: spatial behavior for cross-cultural HRI. In HRI Workshop on Culture-Aware Robotics, Vol. 2014. ACM, NY, NY, USA, 184--185.",
      "doi": ""
    },
    {
      "text": "Frédéric Kaplan. 2004. Who is Afraid of the Humanoid? Investigating Cultural Differences in the Acceptance of Robots. International Journal of Humanoid Robotics 01, 03 (2004), 465--480.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2010. Receptionist or Information Kiosk: How Do People Talk with a Robot?. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, NY, NY, USA, 31--40.  ",
      "doi": "10.1145/1718918.1718927"
    },
    {
      "text": "Takahiko Masuda, Phoebe C. Ellsworth, Batja Mesquita, Janxin Leu, Shigehito Tanida, and Ellen Van de Veerdonk. 2008. Placing the face in context: cultural differences in the perception of facial emotion. Journal of personality and social psychology 94, 3 (2008), 365.",
      "doi": ""
    },
    {
      "text": "David Matsumoto and Hyisung C. Hwang. 2013. Cultural Similarities and Differences in Emblematic Gestures. Journal of Nonverbal Behavior 37, 1 (2013), 1--27.",
      "doi": ""
    },
    {
      "text": "Florian 'Floyd' Mueller and Matthew Muirhead. 2015. Jogging with a Quadcopter. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2023--2032.  ",
      "doi": "10.1145/2702123.2702472"
    },
    {
      "text": "Markus Neuhäuser. 2011. Wilcoxon--Mann--Whitney Test. Springer Berlin Heidelberg, Berlin, Heidelberg. 1656--1658 pages.",
      "doi": ""
    },
    {
      "text": "Richard E. Nisbett and Takahiko Masuda. 2003. Culture and point of view. Proceedings of the National Academy of Sciences 100, 19 (2003), 11163--11170.",
      "doi": ""
    },
    {
      "text": "T. Nomura, J. Burke, J. Han, K. Kato, N. Shin, T. Kanda, and T. Suzuki. 2007. What People Assume about Robots: Cross-Cultural Analysis Between Japan, Korea, and the USA. INTECH Open Access Publisher, Rijeka, Croatia. https://books.google.com/books?id=NRbEoAEACAAJ",
      "doi": ""
    },
    {
      "text": "Mohammad Obaid, Felix Kistler, Gabriele Kasparavičiute, Asim Evren Yantaç, and Morten Fjeld. 2016. How Would You Gesture Navigate a Drone?: A User-centered Approach to Control a Drone. In Proceedings of the 20th International Academic Mindtrek Conference (AcademicMindtrek '16). ACM, NY, NY, USA, 113--121.  ",
      "doi": "10.1145/2994310.2994348"
    },
    {
      "text": "Robert R. Sokal and James F. Rohlf. 1981. Biometry: The Principles and Practice of Statistics in Biological Research (second ed.). Freeman, NY, NY.",
      "doi": ""
    },
    {
      "text": "Dag Sverre Syrdal, Kheng Lee Koay, Michael L. Walters, and Kerstin Dautenhahn. 2007. A personalized robot companion-The role of individual differences on spatial preferences in HRI scenarios. In RO-MAN 2007-The 16th IEEE International Symposium on Robot and Human Interactive Communication. IEEE, Piscataway, NJ, USA, 1143--1148.",
      "doi": ""
    },
    {
      "text": "Daniel Szafir, Bilge Mutlu, and Terrence Fong. 2014. Communication of Intent in Assistive Free Flyers. In Proceedings of the 2014 ACM/IEEE International Conference on Human-robot Interaction (HRI '14). ACM, NY, NY, USA, 358--365.  ",
      "doi": "10.1145/2559636.2559672"
    },
    {
      "text": "Daniel Szafir, Bilge Mutlu, and Terry Fong. 2015. Communicating Directionality in Flying Robots. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). ACM, NY, NY, USA, 19--26.  ",
      "doi": "10.1145/2696454.2696475"
    },
    {
      "text": "Cristen Torrey, Aaron Powers, Matthew Marge, Susan R. Fussell, and Sara Kiesler. 2006. Effects of Adaptive Robot Dialogue on Information Exchange and Social Relations. In Proceedings of the 1st ACM SIGCHI/SIGART Conference on Human-robot Interaction (HRI '06). ACM, NY, NY, USA, 126--133.  ",
      "doi": "10.1145/1121241.1121264"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Lin Wang, Pei-Luen P. Rau, Vanessa Evers, Benjamin K. Robinson, and Pamela Hinds. 2010. When in Rome: The Role of Culture & Context in Adherence to Robot Recommendations. In Proceedings of the 5th ACM/IEEE International Conference on Human-robot Interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 359--366. http://dl.acm.org/citation.cfm?id=1734454.1734578 ",
      "doi": "10.5555/1734454.1734578"
    }
  ]
}