{
  "doi": "10.1145/3025453.3025836",
  "title": "Steering Through Sequential Linear Path Segments",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "232-243",
  "year": 2017,
  "badges": [],
  "abstract": "The steering law models human motor performance and has been verified to hold for a single linear and/or circular path. Some extensions investigated steering around corners. Yet, little is known about human performance in navigating joined linear paths, i.e., successions of path segments with different widths. Such operations appear in graphical user interface tasks, including lasso operations in illustration software. In this work, we conducted several experiments involving joined paths. The results show that users significantly changed their behavior, and that this strategy change can be predicted beforehand. A simple model summing the two indexes of difficulty (IDs) for each path predicts movement time well, but more sophisticated models were also evaluated. The best model in terms of both of R2 and AIC values includes the ID of the crossing operation to enter the second path.",
  "authors": [
    {
      "name": "Shota Yamanaka",
      "institution": "Meiji University & Japan Society for the Promotion of Science, Nakano, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059053057",
      "orcid": "0000-0001-9807-120X"
    },
    {
      "name": "Wolfgang Stuerzlinger",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100214718",
      "orcid": "0000-0002-7110-5024"
    },
    {
      "name": "Homei Miyashita",
      "institution": "Meiji University, Nakano, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81461654671/rel-imgonly/0f4c71c0.jpg",
      "acmid": "81461654671",
      "orcid": "0000-0001-7533-8709"
    }
  ],
  "references": [
    {
      "text": "Johnny Accot and Shumin Zhai. 1997. Beyond Fitts' law: models for trajectory-based HCI tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '97), 295--302. http://dx.doi.org/10.1145/258549.258760  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 1999. Performance evaluation of input devices in trajectory-based tasks: an application of the steering law. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 466--472. http://dx.doi.org/10.1145/302979.303133  ",
      "doi": "10.1145/302979.303133"
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 2001. Scale effects in steering law tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01), 1--8. http://dx.doi.org/10.1145/365024.365027  ",
      "doi": "10.1145/365024.365027"
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 2002. More than dotting the i's -- foundations for crossing-based interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02), 73--80. http://dx.doi.org/10.1145/503376.503390  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Scott Bateman, Andre Doucette, Robert Xiao, Carl Gutwin, Regan L. Mandryk, and Andy Cockburn. 2011. Effects of view, input device, and track width on video game driving. In Proceedings of Graphics Interface (GI '11), 207--214.",
      "doi": ""
    },
    {
      "text": "Kenneth P. Burnham and David R. Anderson. 1998. Model selection and multimodel inference: a practical information-theoretic approach. Springer. http://dx.doi.org/10.1002/sim.769 ",
      "doi": ""
    },
    {
      "text": "Géry Casiez, Patricia Plénacoste, and Christophe Chaillou. 2004. Does DOF separation on elastic devices improve user 3D steering task performance? In Proceedings of the Asia Pacific Conference on Computer Human Interaction (APCHI '04), 70--80. http://dx.doi.org/10.1007/978--3--540--27795--8_8",
      "doi": ""
    },
    {
      "text": "Olivier Chapuis and Pierre Dragicevic. 2011. Effects of motor scale, visual scale, and quantization on small target acquisition difficulty. ACM Transactions on Computer-Human Interaction (TOCHI), Vol.18, No.3, Article 13. http://dx.doi.org/10.1145/1993060.1993063  ",
      "doi": "10.1145/1993060.1993063"
    },
    {
      "text": "Jack Tigh Dennerlein, David B. Martin, and Christopher Hasser. 2000. Force-feedback improves performance for steering and combined steeringtargeting tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00), 423--429. http://dx.doi.org/10.1145/332040.332469  ",
      "doi": "10.1145/332040.332469"
    },
    {
      "text": "Heiko Drewes. 2013. A lecture on Fitts' law. http://www.cip.ifi.lmu.de/~drewes/science/fitts/A%20L ecture%20on%20Fitts%20Law.pdf",
      "doi": ""
    },
    {
      "text": "Colin G. Drury. 1971. Movements with lateral constraint. Ergonomics, Vo.14, No.2, 293--305. http://dx.doi.org/10.1080/00140137108931246 ",
      "doi": ""
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, Vol.47, No.6, 381--391. http://psycnet.apa.org/doi/10.1037/h0055392 ",
      "doi": ""
    },
    {
      "text": "Khai-Chung Gan and Errol R. Hoffmann. 1988. Geometrical conditions for ballistic and visually controlled movements. Ergonomics, Vol.31, No.5, 829--839. http://dx.doi.org/10.1080/00140138808966724 ",
      "doi": ""
    },
    {
      "text": "Takahiro Higuchi, Hajime Takada, Yoshifusa Matsuura, and Kuniyasu Imanaka. 2004. Visual estimation of spatial requirements for locomotion in novice wheelchair users. Journal of Experimental Psychology: Applied, Vol.10, No.1, 55--66. http://psycnet.apa.org/doi/10.1037/1076--898X.10.1.55 ",
      "doi": ""
    },
    {
      "text": "Errol R. Hoffmann. 1997. Movement time of right- and left-handers using their preferred and non-preferred hands. International Journal of Industrial Ergonomics, Vol.19, No.1, 49--57. http://dx.doi.org/10.1016/0169--8141(95)00092--5",
      "doi": ""
    },
    {
      "text": "Sergey Kulikov, I. Scott MacKenzie, and Wolfgang Stuerzlinger. 2005. Measuring the effective parameters of steering motions. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 1569--1572. http://dx.doi.org/10.1145/1056808.1056968  ",
      "doi": "10.1145/1056808.1056968"
    },
    {
      "text": "Sergey Kulikov and Wolfgang Stuerzlinger. 2006. Targeted steering motions. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 983--988. http://dx.doi.org/10.1145/1125451.1125640  ",
      "doi": "10.1145/1125451.1125640"
    },
    {
      "text": "Lei Liu, Jean-Bernard Martens, and Robert van Liere. 2011. Revisiting path steering for 3D manipulation tasks. International Journal of Human-Computer Studies, Vol.69, Issue 3, 170--181. http://dx.doi.org/10.1016/j.ijhcs.2010.11.006  ",
      "doi": "10.1016/j.ijhcs.2010.11.006"
    },
    {
      "text": "Robert L. Pastel. 2006. Measuring the difficulty of steering through corners. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 1087--1096. http://dx.doi.org/10.1145/1124772.1124934  ",
      "doi": "10.1145/1124772.1124934"
    },
    {
      "text": "Nicolas Rashevsky. 1959. Mathematical biophysics of automobile driving. Bulletin of Mathematical Biophysics, Vol.21, No.4, 375--385. http://dx.doi.org/10.1007/BF02477896 ",
      "doi": ""
    },
    {
      "text": "Nicolas Rashevsky. 1970. Mathematical biophysics of automobile driving IV. Bulletin of Mathematical Biophysics, Vol.32, No.1, 71--78. http://dx.doi.org/10.1007/BF02476794 ",
      "doi": ""
    },
    {
      "text": "Xiangshi Ren, Jing Kong, and Xing-Qi Jiang. 2005. SH-model: a model based on both system and human effects for pointing task evaluation. IPSJ Journal, Vol.46, No.5, 1343--1353. ",
      "doi": ""
    },
    {
      "text": "Xiangshi Ren and Xiaolei Zhou. 2011. An investigation of the usability of the stylus pen for various age groups on personal digital assistants. Behaviour & Information Technology, Vol.30, No.6, 709--726. http://dx.doi.org/10.1080/01449290903205437 ",
      "doi": ""
    },
    {
      "text": "Ransalu Senanayake, Errol R. Hoffmann, and Ravindra S. Goonetilleke. 2013. A model for combined targeting and tracking tasks in computer applications. Experimental Brain Research, Vol.231, No.3, 367-- 379. http://dx.doi.org/10.1007/s00221-013--3700--4",
      "doi": ""
    },
    {
      "text": "Ransalu Senanayake and Ravindra S. Goonetilleke. 2016. Pointing device performance in steering tasks. Perceptual and Motor Skills, Vol.122, No.3, 886--910. http://dx.doi.org/10.1177/0031512516649717 ",
      "doi": ""
    },
    {
      "text": "R. William Soukoreff, I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies, Vol.61, No.6, 751--789. https://doi.org/10.1016/j.ijhcs.2004.09.001  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Namal Thibbotuwawa, Ravindra S. Goonetilleke, and Errol R. Hoffmann. 2012. Constrained path tracking at varying angles in a mouse tracking task. Human Factors, Vol.54, No.1, 137--149. http://dx.doi.org/10.1177/0018720811424743 ",
      "doi": ""
    },
    {
      "text": "Namal Thibbotuwawa, Errol R. Hoffmann, and Ravindra S. Goonetilleke. 2012. Open-loop and feedback-controlled mouse cursor movements in linear paths. Ergonomics, Vol.55, No.4, 476--488. http://dx.doi.org/10.1080/00140139.2011.644587 ",
      "doi": ""
    },
    {
      "text": "William H. Warren Jr. and Suzanne Whang. 1987. Visual guidance of walking through apertures: bodyscaled information for affordances. Journal of Experimental Psychology: Human Perception and Performance, Vol.13, No.3, 371--383. http://psycnet.apa.org/doi/10.1037/0096--1523.13.3.371 ",
      "doi": ""
    },
    {
      "text": "Shota Yamanaka and Homei Miyashita. 2016. Modeling the steering time difference between narrowing and widening tunnels. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 1846--1856. http://dx.doi.org/10.1145/2858036.2858037  ",
      "doi": "10.1145/2858036.2858037"
    },
    {
      "text": "Shumin Zhai, Johnny Accot, and Rogier Woltjer. 2004. Human action laws in electronic virtual worlds: an empirical study of path steering performance in VR. Presence, Vol.13, No.2, 113--127. http://dx.doi.org/10.1162/1054746041382393  ",
      "doi": "10.1162/1054746041382393"
    },
    {
      "text": "Xiaolei Zhou, Xiangshi Ren, and Yue Hui. 2008. Effect of start position on human performance in steering tasks. In Proceedings of the International Conference on Computer Science and Software Engineering (CSSE '08), Vol.2, 1098--1101. http://dx.doi.org/10.1109/CSSE.2008.1310  ",
      "doi": "10.1109/CSSE.2008.1310"
    },
    {
      "text": "Xiaolei Zhou, Xiang Cao, and Xiangshi Ren. 2009. Speed-accuracy tradeoff in trajectory-based tasks with temporal constraint. In Proceedings of the IFIP International Conference on Human Computer Interaction (INTERACT '09), 906--919. http://dx.doi.org/10.1007/978--3--642-03655--2_99",
      "doi": ""
    },
    {
      "text": "Xiaolei Zhou and Xiangshi Ren. 2010. An investigation of subjective operational biases in steering tasks evaluation. Behaviour & Information Technology, Vol.29, No.2, 126--135. http://dx.doi.org/10.1080/01449290701773701  ",
      "doi": "10.1080/01449290701773701"
    }
  ]
}