{
  "doi": "10.1145/3025453.3025734",
  "title": "Movement Matters: Effects of Motion and Mimicry on Perception of Similarity and Closeness in Robot-Mediated Communication",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "325-335",
  "year": 2017,
  "badges": [],
  "abstract": "In face-to-face interaction, moving with and mimicking the body movements of communication partners has been widely demonstrated to affect interpersonal processes, including feel- ings of affiliation and closeness. In this paper, we examine effects of movement and mimicry in robot-mediated communication. Participants were instructed to get to know their partner, a confederate, who interacted with them via a telepresence robot. The robot either (a) mimicked the participant's body orientation (mimicry condition), (b) mimicked pre-recorded movements of another participant (random movement condition), or (c) did not move during the interaction (static condition). Results showed that mimicry and random movement had similar effects on participants' perceptions of similarity and closeness to their partners and that these effects depend on the participant's gender and level of self-monitoring. The findings suggest that the social movements of a telepresence robot affect interpersonal processes and that these effects are shaped by individual differences.",
  "authors": [
    {
      "name": "Mina Choi",
      "institution": "University of Wisconsin, Madison, Madison, WI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159086357",
      "orcid": "missing"
    },
    {
      "name": "Rachel Kornfield",
      "institution": "University of Wisconsin-Madison, Madison, WI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701819",
      "orcid": "0000-0001-8542-6913"
    },
    {
      "name": "Leila Takayama",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-81100499212/rel-imgonly/leila_recode_square.jpg",
      "acmid": "81100499212",
      "orcid": "missing"
    },
    {
      "name": "Bilge Mutlu",
      "institution": "University of Wisconsin-Madison, Madison, WI, USA",
      "img": "/do/10.1145/contrib-81310500023/rel-imgonly/mutlu.jpg",
      "acmid": "81310500023",
      "orcid": "0000-0002-9456-1495"
    }
  ],
  "references": [
    {
      "text": "Sigurdur O Adalgeirsson and Cynthia Breazeal. 2010. MeBot: a robotic platform for socially embodied presence. In Proceedings of the 5th ACM/IEEE international conference on Human-robot interaction. IEEE Press, 15--22.",
      "doi": "10.5555/1734454.1734467"
    },
    {
      "text": "David M Amodio and Carolin J Showers. 2005. \"Similarity breeds liking\" revisited: The moderating role of commitment. Journal of Social and Personal Relationships 22, 6 (2005), 817--836. ",
      "doi": ""
    },
    {
      "text": "Arthur Aron, Elaine N Aron, and Danny Smollan. 1992. Inclusion of Other in the Self Scale and the structure of interpersonal closeness. Journal of personality and social psychology 63, 4 (1992), 596--612. ",
      "doi": ""
    },
    {
      "text": "Claire E Ashton-James and Ana Levordashka. 2013. When the Wolf Wears Sheepâ A-Zs Clothing Individual Differences in the Desire to be Liked Influence Nonconscious Behavioral Mimicry. Social Psychological and Personality Science 4, 6 (2013), 643--648.",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson and Nick Yee. 2005. Digital chameleons automatic assimilation of nonverbal gestures in immersive virtual environments. Psychological science 16, 10 (2005), 814--819. ",
      "doi": ""
    },
    {
      "text": "Frank J Bernieri. 2005. The expression of rapport. The sourcebook of nonverbal measures: Going beyond words (2005), 347--359.",
      "doi": ""
    },
    {
      "text": "Mary Klein Buller and David B Buller. 1987. Physicians' communication style and patient satisfaction. Journal of health and social Behavior (1987), 375--388.",
      "doi": ""
    },
    {
      "text": "Linda L. Carli, Suzanne J. LaFleur, and Christopher C. Loeber. 1995. Nonverbal behavior, gender, and influence. Journal of personality and social psychology 68, 6 (1995), 1030--1041. ",
      "doi": ""
    },
    {
      "text": "Tanya L Chartrand and John A Bargh. 1999. The chameleon effect: The perception--behavior link and social interaction. Journal of personality and social psychology 76, 6 (1999), 893--910. ",
      "doi": ""
    },
    {
      "text": "Tanya L Chartrand and Rick Van Baaren. 2009. Human mimicry. Advances in experimental social psychology 41 (2009), 219--274. ",
      "doi": ""
    },
    {
      "text": "M Robin DiMatteo. 1979. A social-psychological analysis of physician-patient rapport: Toward a science of the art of medicine. Journal of Social Issues 35, 1 (1979), 12--33. ",
      "doi": ""
    },
    {
      "text": "Ulf Dimberg and Lars-Olov Lundquist. 1990. Gender differences in facial reactions to facial expressions. Biological psychology 30, 2 (1990), 151--159. ",
      "doi": ""
    },
    {
      "text": "P Duggan and L Parrott. 2001. Physicians' nonverbal rapport building and patients' talk about the subjective component of illness. Human Communication Research 27, 2 (2001), 299--311. ",
      "doi": ""
    },
    {
      "text": "Alice H Eagly. 2013. Sex differences in social behavior: A social-role interpretation. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Hall Edward and others. 1966. The hidden dimension. Doubleday, Garden City 14 (1966), 103--124.",
      "doi": ""
    },
    {
      "text": "Sarah Estow, Jeremy P Jamieson, and Jennifer R Yates. 2007. Self-monitoring and mimicry of positive and negative social behaviors. Journal of Research in Personality 41, 2 (2007), 425--433. ",
      "doi": ""
    },
    {
      "text": "Deborah I Fels, Judith K Waalen, Shumin Zhai, and P Weiss. 2001. Telepresence under exceptional circumstances: Enriching the connection to school for sick children. In Proceedings of the IFIP TC13 Interact '01. 617--624.",
      "doi": ""
    },
    {
      "text": "Andrew T Fiore and Judith S Donath. 2005. Homophily in online dating: when do you like someone like yourself?. In CHI'05 Extended Abstracts on Human Factors in Computing Systems. ACM, 1371--1374.",
      "doi": "10.1145/1056808.1056919"
    },
    {
      "text": "Mark G Frank and Thomas Gilovich. 1989. Effect of memory perspective on retrospective causal attributions. Journal of personality and social psychology 57, 3 (1989), 399--403. ",
      "doi": ""
    },
    {
      "text": "Robert Gifford. 1994. A lens-mapping framework for understanding the encoding and decoding of interpersonal dispositions in nonverbal behavior. Journal of Personality and Social Psychology 66, 2 (1994), 398.",
      "doi": ""
    },
    {
      "text": "Amy L Gonzales, Jeffrey T Hancock, and James W Pennebaker. 2009. Language style matching as a predictor of social dynamics in small groups. Communication Research (2009), 1--17.",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen, Angélique Martin, and Sébastien Meineri. 2011. Mimicry and helping behavior: An evaluation of mimicry on explicit helping request. The Journal of Social Psychology 151, 1 (2011), 1--4. ",
      "doi": ""
    },
    {
      "text": "Susan C Herring. 2000. Gender differences in CMC: Findings and implications. Computer Professionals for Social Responsibility Journal 18, 1 (2000), 0.",
      "doi": ""
    },
    {
      "text": "Cecilia Heyes. 2011. Automatic imitation. Psychological bulletin 137, 3 (2011), 463--483. ",
      "doi": ""
    },
    {
      "text": "Ted L Huston and George Levinger. 1978. Interpersonal attraction and relationships. Annual review of psychology 29, 1 (1978), 115--156. ",
      "doi": ""
    },
    {
      "text": "Steven Johnson, Irene Rae, Bilge Mutlu, and Leila Takayama. 2015. Can you see me now?: How field of view affects collaboration in robotic telepresence. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2397--2406.  ",
      "doi": "10.1145/2702123.2702526"
    },
    {
      "text": "Johan C Karremans and Thijs Verwijmeren. 2008. Mimicking attractive opposite-sex others: The role of romantic relationship status. Personality and Social Psychology Bulletin (2008), 1--12.",
      "doi": ""
    },
    {
      "text": "Ronald C Kessler and Jane D McLeod. 1984. Sex differences in vulnerability to undesirable life events. American sociological review (1984), 620--631.",
      "doi": ""
    },
    {
      "text": "Annica Kristoffersson, Silvia Coradeschi, and Amy Loutfi. 2013. A Review of Mobile Robotic Telepresence. Advances in Human-Computer Interaction 2013, Article 3 (Jan. 2013), 1 pages.",
      "doi": ""
    },
    {
      "text": "Annica Kristoffersson, Silvia Coradeschi, Amy Loutfi, and Kerstin Severinson-Eklundh. 2014. Assessment of interaction quality in mobile robotic telepresence: An elderly perspective. Interaction Studies 15, 2 (2014), 343--357. ",
      "doi": ""
    },
    {
      "text": "Annica Kristoffersson, Kerstin Severinson Eklundh, and Amy Loutfi. 2013. Measuring the quality of interaction in mobile robotic telepresence: A pilot's perspective. International Journal of Social Robotics 5, 1 (2013), 89--101. ",
      "doi": ""
    },
    {
      "text": "Wojciech Kulesza, Zofia Szypowska, Matthew S Jarman, and Dariusz Dolinski. 2014. Attractive Chameleons Sell: The Mimicry-Attractiveness Link. Psychology & Marketing 31, 7 (2014), 549--561. ",
      "doi": ""
    },
    {
      "text": "Hideaki Kuzuoka, Yuya Suzuki, Jun Yamashita, and Keiichi Yamazaki. 2010. Reconfiguring Spatial Formation Arrangement by Robot Body Orientation. In Proceedings of the 5th ACM/IEEE International Conference on Human-robot Interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 285--292. ",
      "doi": ""
    },
    {
      "text": "Jessica L Lakin, Valerie E Jefferis, Clara Michelle Cheng, and Tanya L Chartrand. 2003. The chameleon effect as social glue: Evidence for the evolutionary significance of nonconscious mimicry. Journal of nonverbal behavior 27, 3 (2003), 145--162. ",
      "doi": ""
    },
    {
      "text": "Mathis Lauckner, Dejan Pangercic, and Serkan Tuerker. 2015. Evaluation of a Mobile Robotic Telepresence System in a One-on-One Meeting Scenario. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts. ACM, 57--58.  ",
      "doi": "10.1145/2701973.2702047"
    },
    {
      "text": "Min Kyung Lee and Leila Takayama. 2011. Now, I have a body: Uses and social norms for mobile remote presence in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 33--42.",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Tamara Lorenz, Astrid Weiss, and Sandra Hirche. 2016. Synchrony and Reciprocity: Key Mechanisms for Social Companion Robots in Therapy and Care. International Journal of Social Robotics 8, 1 (2016), 125--143. ",
      "doi": ""
    },
    {
      "text": "James C McCroskey, Virginia P Richmond, and John A Daly. 1975. The development of a measure of perceived homophily in interpersonal communication. Human Communication Research 1, 4 (1975), 323--332.",
      "doi": ""
    },
    {
      "text": "Hideyuki Nakanishi, Yuki Murakami, Daisuke Nogami, and Hiroshi Ishiguro. 2008. Minimum movement matters: impact of robot-mounted cameras on social telepresence. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 303--312.  ",
      "doi": "10.1145/1460563.1460614"
    },
    {
      "text": "Carman Neustaedter, Gina Venolia, Jason Procyk, and Daniel Hawkins. 2016. To Beam or not to Beam: A study of remote telepresence attendance at an academic conference. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 418--431.  ",
      "doi": "10.1145/2818048.2819922"
    },
    {
      "text": "A Pentland, J Curhan, R Khilnani, M Martin, N Eagle, R Caneel, and A Madan. 2004. A negotiation advisor. In ACM Symposium on User Interface Software and Technology. Citeseer.",
      "doi": ""
    },
    {
      "text": "Tal-Chen Rabinowitch and Ariel Knafo-Noam. 2015. Synchronous rhythmic interaction enhances children's perceived similarity and closeness towards each other. PloS one 10, 4 (2015), e0120878.",
      "doi": ""
    },
    {
      "text": "Irene Rae, Bilge Mutlu, and Leila Takayama. 2014. Bodies in motion: mobility, presence, and task awareness in telepresence. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2153--2162.  ",
      "doi": "10.1145/2556288.2557047"
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2012. One of the gang: supporting in-group behavior for embodied mediated communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3091--3100.  ",
      "doi": "10.1145/2207676.2208723"
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2013a. In-body experiences: embodiment, control, and trust in robot-mediated communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1921--1930.  ",
      "doi": "10.1145/2470654.2466253"
    },
    {
      "text": "Irene Rae, Leila Takayama, and Bilge Mutlu. 2013b. The influence of height in robot-mediated communication. In Proceedings of the 8th ACM/IEEE international conference on Human-robot interaction. IEEE Press, 1--8. ",
      "doi": ""
    },
    {
      "text": "Lauren E Scissors, Alastair J Gill, and Darren Gergle. 2008. Linguistic mimicry and trust in text-based CMC. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 277--280.",
      "doi": "10.1145/1460563.1460608"
    },
    {
      "text": "John Short, Ederyn Williams, and Bruce Christie. 1976. The social psychology of telecommunications. (1976).",
      "doi": ""
    },
    {
      "text": "David Sirkin and Wendy Ju. 2012. Consistency in Physical and On-screen Action Improves Perceptions of Telepresence Robots. In Proceedings of the Seventh Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '12). ACM, New York, NY, USA, 57--64.  ",
      "doi": "10.1145/2157689.2157699"
    },
    {
      "text": "David Sirkin, Gina Venolia, John Tang, George Robertson, Taemie Kim, Kori Inkpen, Mara Sedlins, Bongshin Lee, and Mike Sinclair. 2011. Motion and attention in a kinetic videoconferencing proxy. In IFIP Conference on Human-Computer Interaction. Springer, 162--180. ",
      "doi": ""
    },
    {
      "text": "Mark Snyder. 1974. Self-monitoring of expressive behavior. Journal of personality and social psychology 30, 4 (1974), 526--537. ",
      "doi": ""
    },
    {
      "text": "Mark Snyder. 1987. Public appearances, private realities: The psychology of self-monitoring. WH Freeman/Times Books/Henry Holt & Co.",
      "doi": ""
    },
    {
      "text": "Susan Sprecher, Stanislav Treger, Joshua D Wondra, Nicole Hilaire, and Kevin Wallpe. 2013. Taking turns: Reciprocal self-disclosure promotes liking in initial interactions. Journal of Experimental Social Psychology 49, 5 (2013), 860--866. ",
      "doi": ""
    },
    {
      "text": "Ralph M Stogdill. 1948. Personal factors associated with leadership: A survey of the literature. The Journal of psychology 25, 1 (1948), 35--71. ",
      "doi": ""
    },
    {
      "text": "Leila Takayama. 2015. Telepresence and Apparent Agency in Human--Robot Interaction. The Handbook of the Psychology of Communication Technology (2015), 160--175.",
      "doi": ""
    },
    {
      "text": "Leila Takayama and Janet Go. 2012. Mixing metaphors in mobile remote presence. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 495--504.  ",
      "doi": "10.1145/2145204.2145281"
    },
    {
      "text": "Linda Tickle-Degnen and Robert Rosenthal. 1990. The nature of rapport and its nonverbal correlates. Psychological inquiry 1, 4 (1990), 285--293. ",
      "doi": ""
    },
    {
      "text": "Katherine M Tsui, Munjal Desai, Holly A Yanco, and Chris Uhlik. 2011. Exploring use cases for telepresence robots. In 2011 6th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 11--18.",
      "doi": "10.1145/1957656.1957664"
    },
    {
      "text": "Katherine M Tsui, Adam Norton, Daniel J Brooks, Eric McCann, Mikhail S Medvedev, Jordan Allspaw, Sompop Suksawat, James M Dalphond, Michael Lunderville, and Holly A Yanco. 2014. Iterative design of a semi-autonomous social telepresence robot research platform: a chronology. Intelligent Service Robotics 7, 2 (2014), 103--119.",
      "doi": ""
    },
    {
      "text": "Piercarlo Valdesolo and David DeSteno. 2011. Synchrony and the social tuning of compassion. Emotion 11, 2 (2011), 262--266. ",
      "doi": ""
    },
    {
      "text": "John Venn. 1880. I. On the diagrammatic and mechanical representation of propositions and reasonings. The London, Edinburgh, and Dublin Philosophical Magazine and Journal of Science 10, 59 (1880), 1--18.",
      "doi": ""
    },
    {
      "text": "Frank MF Verberne, Jaap Ham, Aditya Ponnada, and Cees JH Midden. 2013. Trusting digital chameleons: The effect of mimicry by a virtual social agent on user trust. In International Conference on Persuasive Technology. Springer, 234--245.",
      "doi": "10.1007/978-3-642-37157-8_28"
    },
    {
      "text": "Steve Whittaker, David Frohlich, and Owen Daly-Jones. 1994. Informal workplace communication: What is it like and how might we support it?. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 131--137.",
      "doi": ""
    },
    {
      "text": "Barbara Wild, Michael Erb, and Mathias Bartels. 2001. Are emotions contagious? Evoked emotions while viewing emotionally expressive faces: quality, quantity, time course and gender differences. Psychiatry research 102, 2 (2001), 109--124. ",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus effect: The effect of transformed self-representation on behavior. Human communication research 33, 3 (2007), 271--290. ",
      "doi": ""
    },
    {
      "text": "Thomas J Young and Laurence A French. 1996. Height and perceived competence of US presidents. Perceptual and Motor Skills 82, 3 (1996), 1002--1002. ",
      "doi": ""
    }
  ]
}