{
  "doi": "10.1145/3025453.3025721",
  "title": "\"Not another Z piece!\": Adaptive Difficulty in TETRIS",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5126-5131",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Difficulty in TETRIS is adjusted by adapting the speed with which blocks fall. In this contribution, we describe results of an exploratory study in which we investigated relationships between players' performance and their subjective assessment of difficulty and fun. We tested five different algorithms that, instead of adjusting game speed, adjust difficulty by choosing blocks based on the current game state. With our results, we establish pile height and bumpiness as parameters that indicate the performance of a player during a live game, discuss the inherent difficulty of different block choosing algorithms and show how the relationship between fun and perceived difficulty varies for distinct player groups. With regard to adapting difficulty, we argue that one can still teach an old dog such a TETRIS a lot of new tricks.",
  "tags": [
    "tetris",
    "user study",
    "fun",
    "perceived difficulty"
  ],
  "authors": [
    {
      "name": "Katta Spiel",
      "institution": "Vienna University of Technology & Bauhaus-Universität Weimar, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758673057",
      "orcid": "missing"
    },
    {
      "name": "Sven Bertel",
      "institution": "Bauhaus-Universität Weimar, Weimar, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636535",
      "orcid": "missing"
    },
    {
      "name": "Fares Kayali",
      "institution": "Vienna University of Technology, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658752490",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sami Abuhamdeh and Mihaly Csikszentmihalyi. 2012. The Importance of Challenge for the Enjoyment of Intrinsically Motivated, Goal-Directed Activities. Personality and Social Psychology Bulletin 38, 3 (2012), 317--330.",
      "doi": ""
    },
    {
      "text": "Richard Bartle. 1996. Hearts, clubs, diamonds, spades: Players who suit MUDs. Journal of MUD research 1, 1 (1996), 19.",
      "doi": ""
    },
    {
      "text": "Sven Bertel. 2014. Individual Cognitive Abilities and Styles in HCI: Three Main Challenges and a Tiered Adaption Model. In HCI Engineering 2014: Charting the Way towards Methods and Tools for Advanced Interactive Systems. Workshop at the 6th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Niko Böhm, Gabriella Kókai, and Stefan Mandl. 2005. An Evolutionary Approach to Tetris. In 6th Metaheuristics International Conference (6th Metaheuristics International Conference Wien August 22--26, 2005). MIC'05, Vienna, Austria, 1--6.",
      "doi": ""
    },
    {
      "text": "Heidi Burgiel. 1997. How to Lose at Tetris. Mathematical Gazette 81 (1997), 194--200.",
      "doi": ""
    },
    {
      "text": "Guillaume Chanel, Cyril Rebetez, Mireille Bétrancourt, and Thierry Pun. 2008. Boredom, Engagement and Anxiety As Indicators for Adaptation to Difficulty in Games. In Proceedings of the 12th International Conference on Entertainment and Media in the Ubiquitous Era (MindTrek '08). ACM, New York, NY, USA, 13--17.  ",
      "doi": "10.1145/1457199.1457203"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1991. Flow: The Psychology of Optimal Experience. Vol. 41. HarperPerennial, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Erik D Demaine, Susan Hohenberger, and David Liben-Nowell. 2003. Tetris is Hard, Even to Approximate. In Computing and Combinatorics. Springer, Heidelberg, Germany, 351--363. ",
      "doi": "10.5555/1756869.1756918"
    },
    {
      "text": "Colin Fahey. 2012. Tetris. (July 2012). http://colinfahey.com/tetris/tetris.html",
      "doi": ""
    },
    {
      "text": "Landon Flom and Cliff Robinson. 2005. Using a Genetic Algorithm to Weight an Evaluation Function for Tetris. (2005).",
      "doi": ""
    },
    {
      "text": "Robin Hunicke. 2005. The Case for Dynamic Difficulty Adjustment in Games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '05). ACM, New York, NY, USA, 429--433.  ",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "Wijnand IJsselsteijn, Karolien Poels, and Yvonne De Kort. 2008. The Game Experience Questionnaire: Development of a self-report measure to assess player experiences of digital games. (2008).",
      "doi": ""
    },
    {
      "text": "Mitu Khandaker. 2011. Column: \"Gambrian Explosion\": Games, Randomness, and The Problem with Being Human. (April 2011). http://www.gamesetwatch.com/2011/04/column_gambrian_explosion_game.php",
      "doi": ""
    },
    {
      "text": "David Kirsh and Paul Maglio. 1992. Reaction and Reflection in Tetris. In Artificial Intelligence Planning Systems: Proceedings of the First Annual International Conference (AIPS92. Morgan Kaufman. ",
      "doi": "10.5555/139492.139590"
    },
    {
      "text": "Robert Ladouceur, Anne Gaboury, Annie Bujold, Nadine Lachance, and Sarah Tremblay. 1991. Ecological Validity of Laboratory Studies of Videopoker Gaming. Journal of Gambling Studies 7, 2 (1991), 109--116.",
      "doi": ""
    },
    {
      "text": "John Lindstedt and Wayne Gray. 2013. Extreme Expertise: Exploring Expert Behavior in Tetris. In Proceedings of the 35th Annual Meeting of the Cognitive Science Society (Cooperative Minds: Social Interaction and Group Dynamics). Cognitive Science Society, Berlin, Germany, 912--917.",
      "doi": ""
    },
    {
      "text": "Derek Lomas, Kishan Patel, Jodi L. Forlizzi, and Kenneth R. Koedinger. 2013. Optimizing Challenge in an Educational Game Using Large-scale Design Experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 89--98.  ",
      "doi": "10.1145/2470654.2470668"
    },
    {
      "text": "Ricardo Lopes and Rafael Bidarra. 2011. Adaptivity Challenges in Games and Simulations: A Survey. IEEE Transactions on Computational Intelligence and AI in Games 3, 2 (June 2011), 85--99.",
      "doi": ""
    },
    {
      "text": "Brian Magerko, Carrie Heeter, Joe Fitzgerald, and Ben Medler. 2008. Intelligent Adaptation of Digital Game-based Learning. In Proceedings of the 2008 Conference on Future Play: Research, Play, Share (Future Play '08). ACM, New York, NY, USA, 200--203.  ",
      "doi": "10.1145/1496984.1497021"
    },
    {
      "text": "Frederico Poloni. 2012. Notes on the Bastet Algorithm. (January 2012). http://fph.altervista.org/prog/bastetalgo.html",
      "doi": ""
    },
    {
      "text": "Hua Qin, Pei-Luen Patrick Rau, and Gavriel Salvendy. 2010. Effects of different scenarios of game difficulty on player immersion. Interacting with Computers 22, 3 (2010), 230--239.  ",
      "doi": "10.1016/j.intcom.2009.12.004"
    },
    {
      "text": "Scott Rigby and Richard Ryan. 2007. The player experience of need satisfaction (PENS) model. Immersyve Inc. (2007).",
      "doi": ""
    },
    {
      "text": "Elad Shahar and Ross West. 2010. Evolutionary AI for Tetris. (2010). http://www.cs.uml.edu/ecg/pub/uploads/AIfall10/eshahar_rwest_GATetris.pdf",
      "doi": ""
    },
    {
      "text": "David Sheff. 1993. Game Over: How Nintendo Zapped an American Industry, Captured Your Dollars, and Enslaved Your Children. Random House Inc., New York, NY, USA. ",
      "doi": "10.5555/118613"
    },
    {
      "text": "Stefanie Wetzel, Katta Spiel, and Sven Bertel. 2014. Dynamically Adapting an AI Game Engine Based on Players' Eye Movements and Strategies. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 3--12. ",
      "doi": "10.1145/2607023.2607029"
    }
  ]
}