{
  "doi": "10.1145/3025453.3025907",
  "title": "Privacy Mechanisms for Drones: Perceptions of Drone Controllers and Bystanders",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6777-6788",
  "year": 2017,
  "badges": [],
  "abstract": "Drones pose privacy concerns such as surveillance and stalking. Many technology-based or policy-based mechanisms have been proposed to mitigate these concerns. However, it is unclear how drone controllers and bystanders perceive these mechanisms and whether people intend to adopt them. In this paper, we report results from two rounds of online survey with 169 drone controllers and 717 bystanders in the U.S. We identified respondents' perceived pros and cons of eight privacy mechanisms. We found that owner registration and automatic face blurring individually received most support from both controllers and bystanders. Our respondents also suggested using varied combinations of mechanisms under different drone usage scenarios, highlighting their context-dependent preferences. We outline a set of important questions for future privacy designs and public policies of drones.",
  "tags": [
    "UAS",
    "UAV",
    "drone",
    "perceptions",
    "privacy mechanisms"
  ],
  "authors": [
    {
      "name": "Yaxing Yao",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131392",
      "orcid": "missing"
    },
    {
      "name": "Huichuan Xia",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658735104",
      "orcid": "missing"
    },
    {
      "name": "Yun Huang",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658635613",
      "orcid": "0000-0003-0399-8032"
    },
    {
      "name": "Yang Wang",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82458950557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lisa C. Abrams, Rob Cross, Eric Lesser, and Daniel Z. Levin. 2003. Nurturing interpersonal trust in knowledge-sharing networks. The Academy of Management Executive 17, 4 (Nov. 2003), 64--77.",
      "doi": ""
    },
    {
      "text": "Rebecca Angeles. 2007. An empirical study of the anticipated consumer response to RFID product item tagging. Industrial Management & Data Systems 107, 4 (2007), 461--483.",
      "doi": ""
    },
    {
      "text": "Anirudha Majumdar and Russ Tedrake. 2016. Funnel Libraries for Real-Time Robust Feedback Motion Planning. Technical Report. Massachusetts Institute of Technology. http://groups.csail.mit.edu/ robotics-center/public_papers/Majumdar16.pdf",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Rupert Brown and Sam Gaertner (Eds.). 2002. Blackwell Handbook of Social Psychology: Intergroup Processes. Wiley-Blackwell, Malden, MA etc.",
      "doi": ""
    },
    {
      "text": "Daniel J. Butler, Justin Huang, Franziska Roesner, and Maya Cakmak. 2015. The Privacy-Utility Tradeoff for Remotely Teleoperated Robots. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). ACM, NY, NY, USA, 27--34.  ",
      "doi": "10.1145/2696454.2696484"
    },
    {
      "text": "Jessica R. Cauchard, Jane L. E, Kevin Y. Zhai, and James A. Landay. 2015. Drone & Me: An Exploration into Natural Human-drone Interaction. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, NY, NY, USA, 361--365.  ",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Reece A Clothier, Dominique A Greer, Duncan G Greer, and Amisha M Mehta. 2015. Risk perception and the public acceptance of drones. Risk analysis 35, 6 (2015), 1167--1183.",
      "doi": ""
    },
    {
      "text": "Mary J. Culnan and Pamela K. Armstrong. 1999. Information Privacy Concerns, Procedural Fairness, and Impersonal Trust: An Empirical Investigation. Organization Science 10, 1 (Jan. 1999), 104--115.  ",
      "doi": "10.1287/orsc.10.1.104"
    },
    {
      "text": "Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In situ with bystanders of augmented reality glasses: Perspectives on recording and privacy-mediating technologies. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2377--2386.  ",
      "doi": "10.1145/2556288.2557352"
    },
    {
      "text": "DJI. 2015. DJI Introduces New Geofencing System for its Drones. (2015). http://www.dji.com/newsroom/news/dji-fly-safe-system",
      "doi": ""
    },
    {
      "text": "Travis Dunlap. 2009. We've got our eyes on you: When surveillance by unmanned aircraft systems constitutes a Fourth Amendment search. S. Tex. L. Rev. 51 (2009), 173.",
      "doi": ""
    },
    {
      "text": "Mary Ann Eastlick, Sherry L. Lotz, and Patricia Warrington. 2006. Understanding online B-to-C relationships: An integrated model of privacy concerns, trust, and commitment. Journal of Business Research 59, 8 (Aug. 2006), 877--886.",
      "doi": ""
    },
    {
      "text": "Electronic Privacy Information Center (EPIC). 2016. EPIC Domestic Unmanned Aerial Vehicles (UAVs) and Drones. (2016). https://epic.org/privacy/drones/",
      "doi": ""
    },
    {
      "text": "Federal Aviation Administration (FAA). 2015a. B4UFLY Smartphone App. (2015). https://www.faa.gov/uas/b4ufly/",
      "doi": ""
    },
    {
      "text": "Federal Aviation Administration (FAA). 2015b. Unmanned Aircraft Systems. (2015). https://www.faa.gov/uas/",
      "doi": ""
    },
    {
      "text": "Federal Aviation Administration (FAA). 2016. Summary of the Small UAS Rule. Technical Report. https://www.faa.gov/uas/media/Part_107_Summary.pdf",
      "doi": ""
    },
    {
      "text": "Andrea Frome, German Cheung, Ahmad Abdulkader, Marco Zennaro, Bo Wu, Alessandro Bissacco, Hartwig Adam, Hartmut Neven, and Luc Vincent. 2009. Large-scale privacy protection in Google Street View. In 2009 IEEE 12th International Conference on Computer Vision. 2373--2380.",
      "doi": ""
    },
    {
      "text": "Future of Privacy Forum, Intel, and PrecisionHawk. 2016. Drones and Privacy by Design: Embedding Privacy Enhancing Technology in Unmanned Aircraft. Technical Report. https://fpf.org/wp-content/uploads/2016/08/Drones_and_ Privacy_by_Design_FPF_Intel_PrecisionHawk.pdf",
      "doi": ""
    },
    {
      "text": "Steve Hodges, Emma Berry, and Ken Wood. 2011. SenseCam: a wearable camera that stimulates and rehabilitates autobiographical memory. Memory (Hove, England) 19, 7 (Oct. 2011), 685--696.",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Robert Templeman, Steven Armes, Denise Anthony, David Crandall, and Apu Kapadia. 2014. Privacy behaviors of lifeloggers using wearable cameras. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 571--582.  ",
      "doi": "10.1145/2632048.2632079"
    },
    {
      "text": "Yoohwan Kim, Juyeon Jo, and Sanjeeb Shrestha. 2014. A server-based real-time privacy protection scheme against video surveillance by Unmanned Aerial Systems. In Unmanned Aircraft Systems (ICUAS), 2014 International Conference on. IEEE, 684--691.",
      "doi": ""
    },
    {
      "text": "Bastian Könings, Sebastian Thoma, Florian Schaub, and Michael Weber. 2014. Pripref broadcaster: Enabling users to broadcast privacy preferences in their physical proximity. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia. ACM, 133--142.  ",
      "doi": "10.1145/2677972.2677978"
    },
    {
      "text": "Marc Langheinrich. 2002. A privacy awareness system for ubiquitous computing environments. In international conference on Ubiquitous Computing. Springer, 237--245. ",
      "doi": "10.5555/647988.741491"
    },
    {
      "text": "LightCense. 2016. LightCense. (2016). http://www.lightcense.co/",
      "doi": ""
    },
    {
      "text": "National Telecommunications and Information Administration. 2016. Voluntary Best Practices for UAS Privacy, Transparency, and Accountability. Technical Report. https://www.ntia.doc.gov/files/ntia/ publications/voluntary_best_practices_for_uas_privacy_ transparency_and_accountability_0.pdf",
      "doi": ""
    },
    {
      "text": "David H. Nguyen and Gillian R. Hayes. 2010. Information Privacy in Institutional and End-user Tracking and Recording Technologies. Personal Ubiquitous Comput. 14, 1 (Jan. 2010), 53--72.  ",
      "doi": "10.1007/s00779-009-0229-4"
    },
    {
      "text": "NoFlyZone. 2016. NoFlyZone. (2016). https://www.noflyzone.org/",
      "doi": ""
    },
    {
      "text": "Franziska Roesner, David Molnar, Alexander Moshchuk, Tadayoshi Kohno, and Helen J Wang. 2014. World-driven access control for continuous sensing. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security. ACM, 1169--1181.  ",
      "doi": "10.1145/2660267.2660319"
    },
    {
      "text": "H Jeff Smith, Tamara Dinev, and Heng Xu. 2011. Information privacy research: an interdisciplinary review. MIS quarterly 35, 4 (2011), 989--1016. ",
      "doi": "10.5555/2208940.2208950"
    },
    {
      "text": "Sarah Spiekermann, Jens Grossklags, and Bettina Berendt. 2001. E-privacy in 2Nd Generation E-commerce: Privacy Preferences Versus Actual Behavior. In Proceedings of the 3rd ACM Conference on Electronic Commerce (EC '01). ACM, NY, NY, USA, 38--47.  ",
      "doi": "10.1145/501158.501163"
    },
    {
      "text": "Sijun Wang, Sharon E. Beatty, and William Foxx. 2004. Signaling the trustworthiness of small online retailers. Journal of Interactive Marketing 18, 1 (2004), 53--69.",
      "doi": ""
    },
    {
      "text": "David Wright, Rachel Finn, Raphael Gellert, Serge Gutwirth, Philip Schütz, Michael Friedewald, Silvia Venier, and Emilio Mordini. 2014. Ethical dilemma scenarios and emerging technologies. Technological Forecasting and Social Change 87 (2014), 325--336.",
      "doi": ""
    },
    {
      "text": "Yang Wang, Huichuan Xia, Yaxing Yao, and Yun Huang. 2016. Flying Eyes and Hidden Controllers: A Qualitative Study of People's Privacy Perceptions of Civilian Drones in the US. Proceedings on Privacy Enhancing Technologies (PoPETS) 3 (2016), 172--190.",
      "doi": ""
    }
  ]
}