{
  "doi": "10.1145/3025453.3025911",
  "title": "Can People Self-Report Security Accurately?: Agreement Between Self-Report and Behavioral Measures",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2228-2232",
  "year": 2017,
  "badges": [],
  "abstract": "It is common for researchers to use self-report measures (e.g. surveys) to measure people's security behaviors. In the computer security community, we don't know what behaviors people understand well enough to self-report accurately, or how well those self-reports correlate with what people actually do. In a six week field study, we collected both behavior data and survey responses from 122 subjects. We found that a relatively small number of behaviors -- mostly related to tasks that require users to take a specific, regular action -- have non-zero correlations. Since security is almost never a user's primary task for everyday computer users, several important security behaviors that we directly measured were not self-reported accurately. These results suggest that security research based on self-report is only reliable for certain behaviors. Additionally, a number of important security behaviors are not sufficiently salient to users that they can self-report accurately.",
  "authors": [
    {
      "name": "Rick Wash",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/do/10.1145/contrib-81328490992/rel-imgonly/rwash-full.jpg",
      "acmid": "81328490992",
      "orcid": "missing"
    },
    {
      "name": "Emilee Rader",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489766",
      "orcid": "missing"
    },
    {
      "name": "Chris Fennell",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159969",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. Block Shock. The Economist (June 6 2015). http://www.economist.com/node/21653644/print",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 1991. The theory of planned behavior. Organizational Behavior and Human Decision Processes 50, 2 (Dec. 1991), 179--211. DOI: http://dx.doi.org/10.1016/0749--5978(91)90020-T",
      "doi": "10.1016/0749-5978%2891%2990020-t"
    },
    {
      "text": "John R. Anderson. 2009. Cognitive Psychology and Its Limitations (7th ed.). Worth Publishers.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Marian Harbach, and Eyal Peer. 2016. Behavior Ever Follows Intention? A Validation of the Security Behavior Intentions Scale (SeBIS). In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5257--5261. DOI: http://dx.doi.org/10.1145/2858036.2858265  ",
      "doi": "10.1145/2858036.2858265"
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. Scaling the Security Wall: Developing a Security Behavior Intentions Scale. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI). 2873--2882. DOI: http://dx.doi.org/10.1145/2702123.2702249  ",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Dinei Florêncio and Cormac Herley. 2007. A large-scale study of web password habits. In Proceedings of the 16th International Conference on World Wide Web (WWW). 657--666. DOI: http://dx.doi.org/10.1145/1242572.1242661  ",
      "doi": "10.1145/1242572.1242661"
    },
    {
      "text": "Alain Forget, Sarah Pearman, Jeremy Thomas, Alessandro Acquisti, Nicolas Christin, Lorrie Faith Cranor, Serge Egelman, Marian Harbach, and Rahul Telang. 2016. Do or Do Not, There Is No Try: User Engagement May Not Improve Security Outcomes. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). 97--111.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and John Carlin. 2014. Beyond Power Calculations: Assessing Type S (Sign) and Type M (Magnitude) Errors. Perspectives on Psychological Science 9, 6 (2014), 641--651. DOI: http://dx.doi.org/10.1177/1745691614551642 ",
      "doi": ""
    },
    {
      "text": "Joel Hruska. 2016. Forbes forces readers to turn off ad blockers, promptly serves malware. (January 8 2016). http://www.extremetech.com/internet/220696-forbesforces-readers-to-turn-off-ad-blockers-promptlyserves-malware",
      "doi": ""
    },
    {
      "text": "Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. \"... no one can hack my mind\": Comparing Expert and Non-Expert Security Practices. ... On Usable Privacy and Security (SOUPS ... (2015).",
      "doi": ""
    },
    {
      "text": "Ivar Krumpal. 2013. Determinants of social desirability bias in sensitive surveys: a literature review. Quality & Quantity 47, 4 (2013), 2025--2047. DOI: http://dx.doi.org/10.1007/s11135-011--9640--9",
      "doi": ""
    },
    {
      "text": "Robert LaRose, Nora J Rifon, and Richard Enbody. 2008. Promoting personal responsibility for internet safety. Commun. ACM 51, 3 (March 2008), 71--76. DOI: http://dx.doi.org/10.1145/1325555.1325569  ",
      "doi": "10.1145/1325555.1325569"
    },
    {
      "text": "Paschal Sheeran. 2011. Intention-Behavior Relations: A Conceptual and Empirical Review. European Review of Social Psychology 12, 1 (2011), 1--36. DOI: http://dx.doi.org/10.1080/14792772143000003 ",
      "doi": ""
    },
    {
      "text": "Kami Vaniea, Emilee Rader, and Rick Wash. 2014. Betrayed by Updates: How Negative Experiences Affect Future Security. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2671--2674. DOI: http://dx.doi.org/10.1145/2556288.2557275  ",
      "doi": "10.1145/2556288.2557275"
    },
    {
      "text": "Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). Seattle, WA. DOI: http://dx.doi.org/10.1145/1837110.1837125  ",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Rick Wash and Emilee Rader. 2015. Too Much Knowledge? Security Beliefs and Protective Behaviors Among US Internet Users. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS).",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, Ruthie Berman, and Zac Wellmer. 2016. Understanding Password Choices: How Frequently Entered Passwords are Re-used Across Websites. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). Denver, CO.",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, Kami Vaniea, and Michelle Rizor. 2014. Out of the Loop: How Automated Software Updates Cause Unintended Security Consequences. In Proceedings of the Symposium on Usable Privacy and Security (SOUPS). 89--104.",
      "doi": ""
    },
    {
      "text": "Ryan West. 2008. The Psychology of Security. Commun. ACM 51, 4 (2008), 34--40. DOI: http://dx.doi.org/10.1145/1330311.1330320  ",
      "doi": "10.1145/1330311.1330320"
    }
  ]
}