{
  "doi": "10.1145/3025453.3025975",
  "title": "Supporting Cultures of Making: Technology, Policy, Visions, and Myths",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6523-6535",
  "year": 2017,
  "badges": [],
  "abstract": "Recent HCI research has linked social policy to design, e.g., in issues such as public safety, privacy, and social justice. One area where policy, technology, and design intersect is in the vision of the creative economy. In that vision, creativity, distinct local/regional cultural practices, technology, and entrepreneurship synergistically produce social innovation on a scale sufficient to drive economies. Culture and creative industries (CCI) policy specifies how governments intervene to support such clusters. Maker cultures are seen as central to this vision, but comparatively little is known about how makers produce culture. We offer a critical analysis of several encounters between CCI policy in Taiwan and its maker scene. These encounters reveal misalignments that undercut efforts intended to support making. We propose that supporting any creative culture, including making, entails a serious commitment to understanding its culture, including its cultural contents and their means of production. We further argue that scholarly rigor in cultivating cultural appreciation is just as fundamental as scholarly rigor in empirically representing cultural practices when it comes to pursuing such a cultural understanding.",
  "authors": [
    {
      "name": "Shaowen Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    },
    {
      "name": "Jeffrey Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057577",
      "orcid": "missing"
    },
    {
      "name": "Sarah Ng",
      "institution": "Indiana University Bloomington, Bloomington, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160808",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gloria Anzaldúa. 1987. Borderlands/La Frontera: The New Mestiza. San Francisco? Spinstgers/Aunt Lute.",
      "doi": ""
    },
    {
      "text": "Morgan Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David Mellis, and Daniela Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not? In CHI2014 EA. ACM Press (2014), pp. 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic HCI. Synthesis Lectures in Human-Centered Informatics. Morgan & Claypool Publishers.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Guo Zhang, and Tyler Pace. 2014. The lonely raccoon at the ball: Designing for intimacy, sociability, and selfhood. Proc. of CHI'2014. New York: ACM.  ",
      "doi": "10.1145/2556288.2557127"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, Carl DiSalvo, Ann Light, Daniela Rosner. 2014. Making Cultures Spotlight. Extended Abstracts of CHI'2014. New York: ACM.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, and Guo Zhang Freeman. 2017. Aspirational Design and Messy Democracy: Partisanship, Policy, and Hope in an Asian City. Proceedings of Computer-Supported Cooperative Work (CSCW'2017). New York: ACM.  ",
      "doi": "10.1145/2998181.2998291"
    },
    {
      "text": "Shaowen Bardzell, Daniela Rosner, and Jeffrey Bardzell. 2012. Crafting quality in design: Integrity, creativity, and public sensibility. In Proc. of the Designing Interactive Systems Conference, DIS 2012. ACM: New York, pp. 11--20.  ",
      "doi": "10.1145/2317956.2317959"
    },
    {
      "text": "Tom Boellstorff. 2008. The coming of age in Second Life: an anthropologist explores the virtually human. Princeton University Press. ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Tom Boellstorff, Bonnie Nardi, Celia Pearce, T.L. Taylor. (eds.). 2012. Ethnography and Virtual Worlds: A Handbook of Methods. Princeton UP.",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the wild: How hardware's long tail is supporting new engineering and design communities. In Proceedings of the Designing Interactive Systems Conference, DIS 2010. ACM: New York, pp. 199--207.  ",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Stanley Cavell. 2008. Must We Mean What We Say? Updated Edition. Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Hsiao-Ling Chung. 2012. Rebooting the dragon at the cross-roads? Divergence or convergence of cultural policy in Taiwan. International Journal of Cultural Policy. Vol. 18, No. 3, June 2012--340--355.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf and Daniela K. Rosner. 2015. Reimagining Digital Fabrication as Performance Art. In: Extended Abstracts of the ACM conference on Human Factors in Computing Systems (CHI'15), pp. 555--566.  ",
      "doi": "10.1145/2702613.2732507"
    },
    {
      "text": "Pelle Ehn, Elisabet M. Nilsson, Richard Topgaard (eds). 2014. Making Futures. Marginal Notes on Innovation, Design and Democracy. Cambridge, Massachusetts: MIT Press. ",
      "doi": "10.5555/2755188"
    },
    {
      "text": "Farr, N. (2009) \"Respect the Past, Examine the Present, Build the Future\". Hackerspaces Flux. http://blog.hackerspaces.org/2009/08/25/respectthe-past-examine-the-present-build-the-future/",
      "doi": ""
    },
    {
      "text": "Laura Forlano. 2016. Hacking the feminist disabled body. In Lily Nguyen, Sophie Toupin, and Shaowen Bardzell. (eds.). Special Issue \"Feminism and (Un)Hacking.\" Journal of Peer Production.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, Daniela Rosner. 2015. Hacking Culture, not Devices: Access and Recognition in Feminist Hackerspaces. In Proc. of CSCW'15, pp. 56--68.  ",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Manfred Tscheligi, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Andreas Reiter, Pernille Bjorn. 2016. Fabrication & HCI: Hobbyist Making, Industrial Production, and Beyond. CHI2016 EA.  ",
      "doi": "10.1145/2851581.2856491"
    },
    {
      "text": "Garnet Hertz. 2012. Critical Making. http://www.conceptlab.com/criticalmaking/ (Retrieved Sept 2016)",
      "doi": ""
    },
    {
      "text": "Christine Hine. 2000. Virtual Ethnography. Sage.",
      "doi": ""
    },
    {
      "text": "Edwin Honig. 1966. Dark Conceit: The Making of Allegory. Oxford: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Heather Horst and Daniel Miller. (eds.) Digital Anthropology. Bloomsbury Academic, 2012.",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J. Jackson, Maruf Zaber, Mehrab Bin Morshed, Md. Habibullah Bin Ismail, and Sharmin Afrose, \"Ecologies of Use and Design: Individual and Social Practices of Mobile Phone Use Within Low-Literate Rickshawpuller Communities in Urban Bangladesh,\" in Proceedings of the 2013 ACM Computing for Development Conference (ACM-DEV).  ",
      "doi": "10.1145/2537052.2537066"
    },
    {
      "text": "Steven J. Jackson and Syed Ishtiaque Ahmed, \"Learning, Innovation and Sustainability Among Mobile Phone Repairers in Dhaka, Bangladesh,\" in Proceedings of Designing Interactive Systems (DIS2014). ACM.  ",
      "doi": "10.1145/2598510.2598576"
    },
    {
      "text": "Steve J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. In Proc. of the ACM 2012 conference on Computer Supported Cooperative Work, pp.107--116.  ",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Steven J. Jackson, Stephanie B. Steinhardt, and Ayse Buyuktur. 2013. Why CSCW needs science policy (and vice versa). In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, 1113--1124.  ",
      "doi": "10.1145/2441776.2441902"
    },
    {
      "text": "Steven J. Jackson, Tarleton Gillespie, and Sandy Payette. 2014. The policy knot: re-integrating policy, practice and design in CSCW studies of social computing. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, New York, 588--602.  ",
      "doi": "10.1145/2531602.2531674"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proc. of NordiCHI2010. ACM Press.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Ann Light. 2015. Troubling Futures: can participatory design research provide a constitutive anthropology for the 21st century? Interaction Design and Architecture(s) Journal, 26, 81--94.",
      "doi": ""
    },
    {
      "text": "Lorraine Lim. 2012. Introduction for Special Issue on Cultural Policy in Asia. International Journal of Cultural Policy. Vol. 18, No. 3. June 2012, 261--264.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the Utopian Vision of Making: HCI after Technosolutionism. Proc. of CHI2016.  ",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Silvia Lindtner. 2015. Hacking with Chinese Characteristics: The Promises of the Maker Movement against China's Manufacturing Culture. Science, Technology & Human Values (Sage), Vol. 40, No. 5, pp.854--879.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Anna Greenspan, David Li. 2015. Designed in Shenzhen: Shanzhai Manufacturing and Maker Entrepreneurs. In Proc. of 5th Decennial Aarhus Conference on Critical Alternatives, Denmark, Aug 1721, 2015, pp. 85--96.  ",
      "doi": "10.7146/aahcc.v1i1.21265"
    },
    {
      "text": "Silvia Lindtner, Garnet Hertz, Paul Dourish. 2014. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Start-ups, Incubators. In Proc. of the ACM SIGCHI Conference on Human Factors in Computing Systems (Toronto, Canada), pp.439--448.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Silvia Lindtner. 2014. Hackerspaces and Internet of Things in China: How Makers are reinventing Industrial Production, Innovation & the Self. Journal of China Information, Special Issue on \"Political Contestation in Chinese Digital Spaces\" (ed. Guobin Yang), Vol. 28, No. 2, pp. 145--167.",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren. 2016. On the significance of making in interaction design research. Interaction. Vol. 23, Issue 3, May + June 2016.  ",
      "doi": "10.1145/2904376"
    },
    {
      "text": "Maxigas 2012. Hacklabs and Hackerspaces: Tracing two genealogies. JoPP. Issue 2: July 2012",
      "doi": ""
    },
    {
      "text": "David Mellis and Leah Buechley. 2014. Do-It-Yourself Cellphones: An Investigation into the Possibilities and Limits of High-Tech DIY. In Proceedings of the ACM SIGCHI conference on Human factors in computing systems, pp. 1723--1732.  ",
      "doi": "10.1145/2556288.2557309"
    },
    {
      "text": "Daniel Miller and Don Slater. 2000. The Internet: An Ethnographic Approach. Berg.",
      "doi": ""
    },
    {
      "text": "Stefanie Muller, Laura Devendorf, Stelian Coros, Madeline Gannon, Yoichi Ochiai, and Patrick Baudisch. 2016. CrossFAB workshop. CHI2016EA.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi. 2010. My Life as a Night Elf Priest: An Anthropological Account of World of Warcraft. U of Michigan Press.",
      "doi": ""
    },
    {
      "text": "David Newman. 2011. Contemporary research agendas in Border Studies: An overview. In Doris Wastl-Walter (ed.). The Ashgate Companion to Border Studies. Farnham, UK: Ashgate Publishing. 33--48.",
      "doi": ""
    },
    {
      "text": "Lily Nguyen, Sophie Toupin, and Shaowen Bardzell. 2016. Feminist Hacking/Making: Exploring New Gender Horizons of Possibility. Introduction to Special Issue \"Feminism and (Un)Hacking.\" Journal of Peer Production.",
      "doi": ""
    },
    {
      "text": "Charles Kay Ogden and Ivor Armstrong Richards. 1923. The Meaning of Meaning. Mariner Books, New York.",
      "doi": ""
    },
    {
      "text": "Aihwa Ong and Stephen J. Collier (eds.). 2004. Global Assemblages: Technology, Politics, and Ethics as Anthropological Problems. Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "Tyler Pace, Shaowen Bardzell, and Jeffrey Bardzell. 2010. The rogue in the lovely black dress: Intimacy in World of Warcraft. Proc. of CHI'10: World Conference on Human Factors in Computing Systems. 232242.  ",
      "doi": "10.1145/1753326.1753361"
    },
    {
      "text": "Eric Paulos, R. J. Honicky, and Ben Hooker. \"Citizen science: Enabling participatory urbanism.\" Handbook of Research on Urban Informatics (2008): 414--436.",
      "doi": ""
    },
    {
      "text": "Steven Peacock. 2014. Swedish Crime Fiction: Novel, Film, Television. Manchester, UK: Manchester University Press.",
      "doi": ""
    },
    {
      "text": "Kylie Peppler and Diane Glosson. 2012. Stitching Circuits: Learning About Circuitry Through E-textile Materials. Journal of Science Education and Technology, 1--13.",
      "doi": ""
    },
    {
      "text": "Maureen Quilligan. 1979. The Language of Allegory: Defining the Genre. Ithaca: Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Matt Ratto 2011. Critical Making: conceptual and material studies in technology and social life. The Information Society, 27(4), 252--260.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "Jennifer A. Rode, Anne Weibert, Andrea Marshall, Konstantin Aal, Thomas von Rekowski, Houda El Mimouni, & Jennifer Booker. 2015. From computational thinking to computational making. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. New York: ACM.  ",
      "doi": "10.1145/2750858.2804261"
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. Transactions on Computer-Human Interaction (ToCHI).  ",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Denise Segura and Patricia Zavella. Gendered Borderlands. Introduction to the special issue. Gender & Society, Vol.22. No. 5, October 2008. 537--544.",
      "doi": ""
    },
    {
      "text": "Philip Smith. 2001. Cultural Theory: An Introduction. Blackwell Publishing.",
      "doi": ""
    },
    {
      "text": "Oliver Stickel, Dominik Hornung, Konstantine Aal, Markus Rohde, and Volker Wulf. 2015. 3D Printing with Marginalized Children?An Exploration in a Palestinian Refugee Camp. ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work. Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Taipei Times 2013. Vietnamese students enjoy boisterous \"bando\" banquet. http://www.taipeitimes.com/News/taiwan/archives/201 3/04/15/2003559680. Retrieved Sept 2016.",
      "doi": ""
    },
    {
      "text": "Taiwan Ministry of Culture. 2010. Law for the Development of the Cultural and Creative Industries. law.moc.gov.tw/law/inc/GetFile.ashx?FileId=1643",
      "doi": ""
    },
    {
      "text": "Taiwan Ministry of Economic Affairs. 2004. The development of the cultural and creative industries in Taiwan and its significance for SMEs. http://www.moeasmea.gov.tw/ct.asp?xItem=353&ctNo de=307&mp=2",
      "doi": ""
    },
    {
      "text": "Austin Toombs, Shad Gross, Shaowen Bardzell, and Jeffrey Bardzell. 2016. From Empathy to Care: A Feminist Care Ethics Perspective on Long-Term Researcher-Subject Relations. Interacting with Computers.",
      "doi": ""
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proc. of ACM CHI'15, pp. 629--638.  ",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Sophie Toupin. 2014. Feminist hackerspaces: The synthesis of feminist and hacker cultures. JoPP. Issue 5, Oct. 2014.",
      "doi": ""
    },
    {
      "text": "UNESCO. 2013. Creative Economy Report: 2013 Special Edition: Widening Local Development Pathway.",
      "doi": ""
    },
    {
      "text": "Anne Weibert, Konstantin Aal, Andrea Marshall, Thomas von Rekowski, and Volker Wulf. 2015. Inclusive Making in the Neighborhood. https://hci.sbg.ac.at/wpcontent/uploads/2015/11/Inclusive_Making.pdf",
      "doi": ""
    },
    {
      "text": "Helen F. Wilson. 2016. On geography and encounter: Bodies, borders, and difference. Progress in Human Geography. 1--21.",
      "doi": ""
    },
    {
      "text": "Richmond Wong and Steven J. Jackson, \"Wireless Visions: Infrastructure, Imagination, and U.S. Spectrum Policy,\" in Proceedings of the 2015 Computer Supported Cooperative Work (CSCW) Conference, Vancouver, March 2015.  ",
      "doi": "10.1145/2675133.2675229"
    }
  ]
}