{
  "doi": "10.1145/3025453.3025796",
  "title": "\"Be Grateful You Don't Have a Real Disease\": Understanding Rare Disease Relationships",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1660-1673",
  "year": 2017,
  "badges": [],
  "abstract": "We characterize how people with rare diseases consider their support needs as being met or neglected by different sources. After a 22-week study with 11 participants, we found that people with rare diseases identify strongly with their conditions but demonstrate a range of outlooks on their condition (positive, negative, and accepting). We found that participants think of themselves as being in a separate \"Rare World\" from the \"normal\" people in their lives and that relationships with friends and family members are strained. On the other hand, online communities were described as valuable sources of many forms of support, but do not adequately compensate for the lack of tangible support in offline relationships. We propose an approach to facilitating tangible support that leverages existing research on social matching, towards facilitating support among people with different rare diseases to overcome geographic and symptomatic challenges of coordinating support between people with the same rare disease.",
  "authors": [
    {
      "name": "Haley MacLeod",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058732857",
      "orcid": "missing"
    },
    {
      "name": "Grace Bastin",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161648",
      "orcid": "missing"
    },
    {
      "name": "Leslie S. Liu",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481641570",
      "orcid": "missing"
    },
    {
      "name": "Katie Siek",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81311481394/rel-imgonly/dsc_0184-less1mb-1024x683.jpg",
      "acmid": "81311481394",
      "orcid": "missing"
    },
    {
      "name": "Kay Connelly",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100071662",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Phil Adams, Eric PS Baumer, and Geri Gay. 2014. Staccato Social Support in Mobile Health Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 653--662. DOI:http://dx.doi.org/ 10.1145/2556288.2557297  ",
      "doi": "10.1145/2556288.2557297"
    },
    {
      "text": "Terrance L. Albrecht and Mara B. Adelman. 1987. Communicating social support. Sage Publications, Newbury Park, CA.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked Empowerment on Facebook Groups for Parents of Children with Special Needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2805--2814. DOI:http://dx.doi.org/10.1145/ 2702123.2702324",
      "doi": "10.1145/2702123.2702324"
    },
    {
      "text": "Ingrid Arreola, Zan Morris, Matthew Francisco, Kay Connelly, Kelly Caine, and Ginger White. 2014. From Checking on to Checking in: Designing for Low Socio-economic Status Older Adults. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1933--1936. DOI:http://dx.doi.org/10.1145/ 2556288.2557084",
      "doi": "10.1145/2556288.2557084"
    },
    {
      "text": "Ségolène Aymé, Anna Kole, and Stephen Groft. 2008. Empowerment of patients: lessons from the rare diseases community. The Lancet 371, 9629 (June 2008), 2048--2051. DOI:http://dx.doi.org/10.1016/S01406736(08)60875--2",
      "doi": ""
    },
    {
      "text": "C. Daniel Batson and Adam A. Powell. 2003a. Altruism and Prosocial Behavior. In Handbook of Psychology, Irving B. Weiner (Ed.). John Wiley & Sons, Inc., Hoboken, NJ, USA. DOI:http://dx.doi.org/10. 1002/0471264385.wei0519",
      "doi": ""
    },
    {
      "text": "C. Daniel Batson and Adam A. Powell. 2003b. Altruism and Prosocial Behavior. In Handbook of Psychology, Irving B. Weiner (Ed.). John Wiley & Sons, Inc., Hoboken, NJ, USA. http://doi.wiley.com/10.1002/ 0471264385.wei0519",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Sherri Jean Katz, Jill E. Freeman, Phil Adams, Amy L. Gonzales, John Pollak, Daniela Retelny, Jeff Niederdeppe, Christine M. Olson, and Geri K. Gay. 2012. Prescriptive Persuasion and Open-ended Social Awareness: Expanding the Design Space of Mobile Health. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 475--484. DOI:http://dx. doi.org/10.1145/2145204.2145279  ",
      "doi": "10.1145/2145204.2145279"
    },
    {
      "text": "Victoria M.E. Bellotti, Sara Cambridge, Karen Hoy, Patrick C. Shih, Lisa Renery Handalian, Kyungsik Han, and John M. Carroll. 2014. Towards Community-centered Support for Peer-to-peer Service Exchange: Rethinking the Timebanking Metaphor. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 2975--2984. DOI:http://dx.doi. org/10.1145/2556288.2557061",
      "doi": ""
    },
    {
      "text": "Dawn O. Braithwaite, Vincent R. Waldron, and Jerry Finn. 1999. Communication of Social Support in Computer-Mediated Groups for People With Disabilities. Health Communication 11, 2 (April 1999), 123--151. DOI:http://dx.doi.org/10.1207/ s15327027hc1102_2",
      "doi": ""
    },
    {
      "text": "Alyssa T. Brooks, Shakira Washington, Bradley O. Boekeloo, Brian Gilchrist, and Min Qi Wang. 2013. Relationship of Personal Health Experiences with Interest in Health Careers Among Youth from an Underserved Area. Journal of allied health 42, 3 (Fall 2013), 135--40.",
      "doi": ""
    },
    {
      "text": "Stephanie L. Brown, Randolph M. Nesse, Amiram D. Vinokur, and Dylan M. Smith. 2003. Providing Social Support May Be More Beneficial Than Receiving It: Results From a Prospective Study of Mortality. Psychological Science 14, 4 (July 2003), 320--327. DOI: http://dx.doi.org/10.1111/1467--9280.14461",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L. Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1171--1184. DOI:http://dx.doi.org/10.1145/ 2818048.2819973",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for Caregivers: Designing for Integrality. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, NY, NY, USA, 91--102. DOI:http://dx.doi.org/10. 1145/2441776.2441789",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Robert B. Cialdini, Betty Lee Darby, and Joyce E. Vincent. 1973. Transgression and altruism: A case for hedonism. Journal of Experimental Social Psychology 9, 6 (Nov. 1973), 502--516. DOI:http://dx.doi.org/10. 1016/0022-1031(73)90031-0",
      "doi": ""
    },
    {
      "text": "Margaret S. Clark and Judson R. Mills. 1979. Interpersonal attraction in exchange and communal relationships. Journal of Personality and Social Psychology 37, 1 (1979), 12--24. DOI:http://dx.doi. org/10.1037/0022-3514.37.1.12 ",
      "doi": ""
    },
    {
      "text": "Margaret S. Clark and Judson R. Mills. 2011. A Theory of Communal (and Exchange) Relationships. In Handbook of Theories of Social Psychology: Volume Two, Paul A. M. Van Lange, Arie W. Kruglanski, and E. Tory Higgins (Eds.). SAGE.",
      "doi": ""
    },
    {
      "text": "Margaret S. Clark, Judson R. Mills, and David M. Corcoran. 1989. Keeping Track of Needs and Inputs of Friends and Strangers. Personality and Social Psychology Bulletin 15, 4 (Dec. 1989), 533--542. DOI: http://dx.doi.org/10.1177/0146167289154007 ",
      "doi": ""
    },
    {
      "text": "Margaret S. Clark, Judson R. Mills, and Martha C. Powell. 1986. Keeping track of needs in communal and exchange relationships. Journal of Personality and Social Psychology 51, 2 (1986), 333--338. DOI:http:// dx.doi.org/10.1037/0022--3514.51.2.333",
      "doi": ""
    },
    {
      "text": "Margaret S. Clark and Carolyn Taraban. 1991. Reactions to and willingness to express emotion in communal and exchange relationships. Journal of Experimental Social Psychology 27, 4 (July 1991), 324--336. DOI:http:// dx.doi.org/10.1016/0022-1031(91)90029-6 ",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen and Thomas A. Wills. 1985. Stress, social support, and the buffering hypothesis. Psychological Bulletin 98, 2 (1985), 310--357. DOI: http://dx.doi.org/10.1037/0033--2909.98.2.310",
      "doi": ""
    },
    {
      "text": "Ed Collom. 2008. Engagement of the Elderly in Time Banking: The Potential for Social Capital Generation in an Aging Society. Journal of Aging & Social Policy 20, 4 (2008), 414--436. ",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Peter. Roessler, Brett E. Shelton, Anthony LaMarca, Bill. Schilit, and Sara Bly. 2004. Technology for care networks of elders. IEEE Pervasive Computing 3, 2 (April 2004), 22--29. DOI:http://dx. doi.org/10.1109/MPRV.2004.1316814  ",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Neil S. Coulson, Heather Buchanan, and Aimee Aubeeluck. 2007. Social support in cyberspace: A content analysis of communication within a Huntington's disease online support group. Patient Education and Counseling 68, 2 (2007), 173--178. DOI: http://dx.doi.org/10.1016/j.pec.2007.06.002 ",
      "doi": ""
    },
    {
      "text": "H. L. Crimlisk and I. C. Mcanus. 1987. The effect of personal illness experience on career preference in medical students. Medical Education 21, 6 (Nov. 1987), 464--467. DOI:http://dx.doi.org/10.1111/j.13652923.1987.tb01403.x",
      "doi": ""
    },
    {
      "text": "Carolyn E. Cutrona. 1990. Stress and Social Support in Search of Optimal Matching. Journal of Social and Clinical Psychology 9, 1 (March 1990), 3--14. DOI: http://dx.doi.org/10.1521/jscp.1990.9.1.3 ",
      "doi": ""
    },
    {
      "text": "Carolyn E. Cutrona, B. Beth Cohen, and Surria Igram. 1990. Contextual Determinants of the Perceived Supportiveness of Helping Behaviors. Journal of Social and Personal Relationships 7, 4 (Nov. 1990), 553--562. DOI:http://dx.doi.org/10.1177/0265407590074011 ",
      "doi": ""
    },
    {
      "text": "Carolyn E. Cutrona and Julie A. Suhr. 1992. Controllability of Stressful Events and Satisfaction With Spouse Support Behaviors. Communication Research 19, 2 (1992), 154--174. ",
      "doi": ""
    },
    {
      "text": "Sara J. Czaja and Mark P. Rubert. 2002. Telecommunications Technology as an Aid to Family Caregivers of Persons With Dementia:. Psychosomatic Medicine 64, 3 (May 2002), 469--476. DOI:http://dx. doi.org/10.1097/00006842--200205000-00011",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J. Horvitz, and Aaron Hoff. 2014. Characterizing and Predicting Postpartum Depression from Shared Facebook Data. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 626--638. DOI:http://dx.doi.org/10.1145/2531602.2531675  ",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Mary Beth Deline, Eric P.S. Baumer, and Geri Gay. 2012. Normative Communication Processes and Associated Emotion in Mobile Health Groups. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work Companion (CSCW '12). ACM, NY, NY, USA, 75--78. DOI:http://dx. doi.org/10.1145/2141512.2141546  ",
      "doi": "10.1145/2141512.2141546"
    },
    {
      "text": "Bella M. DePaulo, Gregory L. Brittingham, and Mary K. Kaiser. 1983. Receiving competence-relevant help: Effects on reciprocity, affect, and sensitivity to the helper's nonverbally expressed needs. Journal of Personality and Social Psychology 45, 5 (1983), 1045--1060. DOI:http://dx.doi.org/10.1037/00223514.45.5.1045",
      "doi": ""
    },
    {
      "text": "Maya Doyle. 2015. Peer Support and Mentorship in a US Rare Disease Community: Findings from the Cystinosis in Emerging Adulthood Study. The Patient Patient-Centered Outcomes Research 8, 1 (Feb. 2015), 65--73. DOI:http://dx.doi.org/10.1007/s40271014-0085-9",
      "doi": ""
    },
    {
      "text": "Richard M. Emerson. 1976. Social Exchange Theory. Annual Review of Sociology 2 (1976), 335--362. ",
      "doi": ""
    },
    {
      "text": "Jordan Eschler, Zakariya Dehlawi, and Wanda Pratt. 2015. Self-characterized illness phase and information needs of participants in an online cancer forum (AAAI Conference on Web and Social Media). 101--109.",
      "doi": ""
    },
    {
      "text": "Francis J. Flynn and Vaness K. Lake. 2008. If you need help, just ask: underestimating compliance with direct requests for help. Journal of personality and social psychology 95 (2008), 128. ",
      "doi": ""
    },
    {
      "text": "Carolina Fuentes, Valeria Herskovic, Jurgen Heysen, and Monica Tentori. 2013. Towards a Technology for Caregivers? Emotional Expression and Self-reflection. In Ubiquitous Computing and Ambient Intelligence. Context-Awareness and Context-Driven Interaction, Gabriel Urzaiz, Sergio F. Ochoa, José Bravo, Liming Luke Chen, and Jonice Oliveira (Eds.). Lecture Notes in Computer Science, Vol. 8276. Springer, 143--150. ",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E. Grinter. 2008. EatWell: Sharing Nutrition-related Memories in a Low-income Community. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, NY, NY, USA, 87--96. DOI: http://dx.doi.org/10.1145/1460563.1460579  ",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Eva Grunfeld, Doug Coyle, Timothy Whelan, Jennifer Clinch, Leonard Reyno, Craig C. Earle, Andrew Willan, Raymond Viola, Marjorie Coristine, Teresa Janz, and Robert Glossop. 2004. Family caregiver burden: results of a longitudinal study of breast cancer patients and their principal caregivers. Canadian Medical Association Journal 170, 12 (June 2004), 1795--1801. DOI:http:// dx.doi.org/10.1503/cmaj.1031205 ",
      "doi": ""
    },
    {
      "text": "Tonje Gundersen. 2011. \"One wants to know what a chromosome is\": the internet as a coping resource when adjusting to life parenting a child with a rare genetic disorder: Parenting children with a rare genetic disorder. Sociology of Health & Illness 33, 1 (Jan. 2011), 81--95. DOI:http://dx.doi.org/10.1111/j.1467-9566. 2010.01277.x",
      "doi": ""
    },
    {
      "text": "Kyungsik Han, Patrick C. Shih, Victoria Bellotti, and John M. Carroll. 2015. It's Time There Was an App for That Too: A Usability Study of Mobile Timebanking. Int. J. Mob. Hum. Comput. Interact. 7, 2 (April 2015), 1--22. DOI:http://dx.doi.org/10.4018/ijmhci. ",
      "doi": ""
    },
    {
      "text": "Andrea L Hartzler, Megan N Taylor, Albert Park, Troy Griffiths, Uba Backonja, David W McDonald, Sam Wahbeh, Cory Brown, and Wanda Pratt. 2016. Leveraging cues from person-generated health data for peer matching in online communities. Journal of the American Medical Informatics Association (2016).",
      "doi": ""
    },
    {
      "text": "Stevan E. Hobfoll, Arie Nadler, and Joseph Leiberman. 1986. Satisfaction with social support during crisis: Intimacy and self-esteem as critical determinants. Journal of Personality and Social Psychology 51, 2 (1986), 296--304. DOI:http://dx.doi.org/10.1037/ 0022-3514.51.2.296",
      "doi": ""
    },
    {
      "text": "Hwajung Hong, Jennifer G. Kim, Gregory D. Abowd, and Rosa I. Arriaga. 2012. Designing a Social Network to Support the Independence of Young Adults with Autism. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, NY, NY, USA, 627-636. DOI:http://dx. doi.org/10.1145/2145204.2145300  ",
      "doi": "10.1145/2145204.2145300"
    },
    {
      "text": "Jina Huh. 2015. Clinical Questions in Online Health Communities: The Case of \"See Your Doctor\" Threads. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1488--1499. DOI:http://dx.doi.org/10.1145/ 2675133.2675259",
      "doi": "10.1145/2675133.2675259"
    },
    {
      "text": "Jina Huh and Wanda Pratt. 2014. Weaving Clinical Expertise in Online Health Communities. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1355--1364. DOI:http://dx.doi. org/10.1145/2556288.2557293  ",
      "doi": "10.1145/2556288.2557293"
    },
    {
      "text": "Amy Hwang, Khai Truong, and Alex Mihailidis. 2012. Using participatory design to determine the needs of informal caregivers for smart home user interfaces. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2012 6th International Conference on. IEEE. DOI:http://dx.doi.org/10.4108/icst. pervasivehealth.2012.248671",
      "doi": ""
    },
    {
      "text": "David E. Jacobson. 1986. Types and Timing of Social Support. Journal of Health and Social Behavior 27, 3 (1986), 250--264. ",
      "doi": ""
    },
    {
      "text": "R. Jay Turner John Taylor. 2001. A Longitudinal Study of the Role and Significance of Mattering to Others for Depressive Symptoms. Journal of Health and Social Behavior 42, 3 (2001), 310--325. http://www.jstor. org/stable/3090217 ",
      "doi": ""
    },
    {
      "text": "Marc Musick John Wilson. 1999. The Effects of Volunteering on the Volunteer. Law and Contemporary Problems 62, 4 (1999), 141--168. http://www.jstor. org/stable/1192270 ",
      "doi": ""
    },
    {
      "text": "Hyunggu Jung, Victoria Bellotti, Afsaneh Doryab, Dean Leitersdorf, Jiawei Chen, Benjamin V. Hanrahan, Sooyeon Lee, Dan Turner, Anind K. Dey, and John M. Carroll. 2016. \"MASTerful\" Matchmaking in Service Transactions: Inferred Abilities, Needs and Interests Versus Activity Histories. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1644--1655. DOI:http://dx.doi.org/10.1145/ 2858036.2858263",
      "doi": ""
    },
    {
      "text": "Judith Lasker, Ed Collom, Tara Bealer, Erin Niclaus, Jessica Young Keefe, Zane Kratzer, Lauren Baldasari, Ethan Kramer, Rachel Mandeville, Julia Schulman, Danielle Suchow, Abby Letcher, Anne Rogers, and Kathy Perlow. 2011. Time Banking and Health: The Role of a Community Currency Organization in Enhancing Well-Being. Health promotion practice 12, 1 (2011), 102--115. ",
      "doi": ""
    },
    {
      "text": "Paul F. Lazarsfeld, Robert K. Merton, and others. 1954. Friendship as a social process: A substantive and methodological analysis. Freedom and control in modern society 18, 1 (1954), 18--66.",
      "doi": ""
    },
    {
      "text": "Fiona Lee. 1997. When the Going Gets Tough, Do the Tough Ask for Help? Help Seeking and Power Motivation in Organizations. Organizational Behavior and Human Decision Processes 72, 3 (Dec. 1997), 336--363. DOI:http://dx.doi.org/10.1006/obhd. 1997.2746",
      "doi": ""
    },
    {
      "text": "Herbert M. Lefcourt, Rod A. Martin, and Wendy E. Saleh. 1984. Locus of control and social support: Interactive moderators of stress. Journal of Personality and Social Psychology 47, 2 (1984), 378--389. DOI: http://dx.doi.org/10.1037/0022--3514.47.2.378",
      "doi": ""
    },
    {
      "text": "Darrin R. Lehman, John H. Ellard, and Camille B. Wortman. 1986. Social support for the bereaved: Recipients' and providers' perspectives on what is helpful. Journal of Consulting and Clinical Psychology 54, 4 (1986), 438--446. DOI:http://dx.doi.org/10. 1037/0022-006X.54.4.438",
      "doi": ""
    },
    {
      "text": "Leslie S. Liu, Sen H. Hirano, Monica Tentori, Karen G. Cheng, Sheba George, Sun Young Park, and Gillian R. Hayes. 2011. Improving Communication and Social Support for Caregivers of High-risk Infants Through Mobile Technologies. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, NY, NY, USA, 475--484. DOI:http://dx.doi.org/10.1145/1958824.1958897  ",
      "doi": "10.1145/1958824.1958897"
    },
    {
      "text": "Leslie S. Liu, Jina Huh, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2013. Health Vlogger-viewer Interaction in Chronic Illness Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 49--58. DOI:http://dx.doi.org/10.1145/2470654.2470663  ",
      "doi": "10.1145/2470654.2470663"
    },
    {
      "text": "Diana MacLean, Sonal Gupta, Anna Lembke, Christopher Manning, and Jeffrey Heer. 2015. Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 1511--1526. DOI:http://dx.doi.org/10.1145/ 2675133.2675146",
      "doi": "10.1145/2675133.2675146"
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2016. Asynchronous Remote Communities (ARC) for Researching Distributed Populations. In 10th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM. DOI:http://dx. doi.org/10.4108/eai.16-5-2016.2263322 ",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1145--1154. DOI:http://dx.doi.org/10.1145/ 2702123.2702494",
      "doi": "10.1145/2702123.2702494"
    },
    {
      "text": "Haley MacLeod, Shuo Yang, Kim Oakes, Kay Connelly, and Sriraam Natarajan. 2016. Identifying Rare Diseases from Behavioural Data: A Machine Learning Approach. In Connected Health: Applications, Systems and Engineering Technologies (CHASE), 2016 IEEE First International Conference on. IEEE. DOI:http://dx. doi.org/10.1109/CHASE.2016.7 ",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth D. Mynatt, and David R. Kaufman. 2006. Investigating Health Management Practices of Individuals with Diabetes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 927--936. DOI:http://dx.doi.org/10.1145/ 1124772.1124910",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Michael Massimi, Jackie L. Bender, Holly O. Witteman, and Osman H. Ahmed. 2014. Life Transitions and Online Health Communities: Reflecting on Adoption, Use, and Disengagement. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, NY, NY, USA, 1491--1501. DOI:http://dx.doi.org/ 10.1145/2531602.2531622  ",
      "doi": "10.1145/2531602.2531622"
    },
    {
      "text": "Julia M. Mayer, Starr Roxanne Hiltz, Louise Barkhuus, Kaisa Väänänen, and Quentin Jones. 2016. Supporting Opportunities for Context-Aware Social Matching: An Experience Sampling Study. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2430--2441. DOI:http://dx.doi.org/10.1145/ 2858036.2858175",
      "doi": "10.1145/2858036.2858175"
    },
    {
      "text": "Julia M. Mayer, Starr Roxanne Hiltz, and Quentin Jones. 2015. Making Social Matching Context-Aware: Design Concepts and Open Challenges. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 545--554. DOI:http://dx.doi.org/10.1145/ 2702123.2702343",
      "doi": "10.1145/2702123.2702343"
    },
    {
      "text": "Julia M. Mayer, Sara Motahari, Richard P. Schuler, and Quentin Jones. 2010. Common Attributes in an Unusual Context: Predicting the Desirability of a Social Match. In Proceedings of the Fourth ACM Conference on Recommender Systems (RecSys '10). ACM, NY, NY, USA, 337--340. DOI:http://dx.doi.org/10. 1145/1864708.1864781",
      "doi": "10.1145/1864708.1864781"
    },
    {
      "text": "Elizabeth Midlarsky. 1991. Helping as Coping. In Prosocial behavior, Margaret Clark (Ed.). US: Sage Publications, Inc., Thousand Oaks, CA, 238--264.",
      "doi": ""
    },
    {
      "text": "James M. Cook Miller McPherson, Lynn Smith-Lovin. 2001. Birds of a Feather: Homophily in Social Networks. Annual Review of Sociology 27 (2001), 415--444. http://www.jstor.org/stable/2678628 ",
      "doi": ""
    },
    {
      "text": "R. J. V. Montgomery, J. G. Gonyea, and N. R. Hooyman. 1985. Caregiving and the Experience of Subjective and Objective Burden. Family Relations 34, 1 (Jan. 1985), 19. DOI:http://dx.doi.org/10.2307/583753 ",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With Most of It Being Pictures Now, I Rarely Use It\": Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5506--5516. DOI:http://dx.doi.org/10.1145/ 2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's Not That I Don't Have Problems, I'm Just Not Putting Them on Facebook: Challenges and Opportunities in Using Online Social Networks for Health. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, NY, NY, USA, 341--350. DOI:http://dx.doi.org/10.1145/ 1958824.1958876",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Allen M. Omoto and Mark Snyder. 1995. Sustained helping without obligation: Motivation, longevity of service, and perceived attitude change among AIDS volunteers. Journal of Personality and Social Psychology 68, 4 (1995), 671--686. DOI:http://dx. doi.org/10.1037/0022-3514.68.4.671 ",
      "doi": ""
    },
    {
      "text": "Federica Paganelli, Emilio Spinicci, and Dino Giuli. 2008. ERMHAN: A Context-aware Service Platform to Support Continuous Care Networks for Home-based Assistance. Int. J. Telemedicine Appl. 2008 (Jan. 2008), 4:1--4:13. DOI:http://dx.doi.org/10.1155/2008/",
      "doi": ""
    },
    {
      "text": "Naveen Pemmaraju, Vikas Gupta, Ruben Mesa, and Michael A. Thompson. 2015. Social Media and Myeloproliferative Neoplasms (MPN) Focus on Twitter and the Development of a Disease-specific Community: #MPNSM. Current Hematologic Malignancy Reports 10, 4 (2015), 413--420. ",
      "doi": ""
    },
    {
      "text": "Carolyn E Schwartz and Rabbi Meir Sendor. 1999. Helping others helps oneself: response shift effects in peer support. Social Science & Medicine 48, 11 (June 1999), 1563--1575. DOI:http://dx.doi.org/10.1016/ S0277-9536(99)00049-0",
      "doi": ""
    },
    {
      "text": "Patrick C. Shih, Victoria Bellotti, Kyungsik Han, and John M. Carroll. 2015. Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1075--1084. DOI:http://dx.doi.org/10.1145/ 2702123.2702560",
      "doi": ""
    },
    {
      "text": "Shire Human Genetic Therapies. 2013. Rare Disease Impact Report: Insights from patients and the medical community. Technical Report. Shire Human Genetic Therapies.",
      "doi": ""
    },
    {
      "text": "Katie A. Siek, Kay H. Connelly, and Yvonne Rogers. 2006. Pride and Prejudice: Learning How Chronically Ill People Think About Food. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 947--950. DOI:http://dx.doi.org/10.1145/1124772. ",
      "doi": "10.1145/1124772"
    },
    {
      "text": "Meredith M. Skeels, Kenton T. Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing Social Support for Breast Cancer Patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 173--182. DOI:http://dx.doi.org/10.1145/ 1753326.1753353",
      "doi": "10.1145/1753326.1753353"
    },
    {
      "text": "Bas Stroomer, Martijn H. Vastenburg, and David V. Keyson. 2011. CommunityNet: Mediating Care at the Local Community Level. Springer Berlin Heidelberg, Berlin, Heidelberg, 275--284. DOI:http://dx.doi. org/10.1007/978-3-642-25167-2_37",
      "doi": ""
    },
    {
      "text": "Karen Tang, Sen Hirano, Karen Cheng, and Gillian Hayes. 2012. Balancing Caregiver and Clinician Needs in a Mobile Health Informatics Tool for Preterm Infants. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2012 6th International Conference on. IEEE. DOI:http://dx.doi.org/10.4108/icst. pervasivehealth.2012.248716",
      "doi": ""
    },
    {
      "text": "Loren Terveen and David W. McDonald. 2005. Social Matching: A Framework and Research Agenda. ACM Trans. Comput.-Hum. Interact. 12, 3 (Sept. 2005), 401--434. DOI:http://dx.doi.org/10.1145/1096737.",
      "doi": "10.1145/1096737"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. \"Counting on the Group\": Reconciling Online and Offline Social Support Among Older Informal Caregivers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 3545--3558. DOI:http:// dx.doi.org/10.1145/2858036.2858477  ",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Karen B. Williams and Kipling D. Williams. 1983. Social inhibition and asking for help: The effects of number, strength, and immediacy of potential help givers. Journal of Personality and Social Psychology 44, 1 (1983), 67--77. DOI:http://dx.doi.org/10.1037/ 0022-3514.44.1.67",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the Confiicting Demands of Family Caregivers Caring for Depressed Family Members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2637--2646. DOI:http://dx.doi.org/10.1145/2470654.2481365  ",
      "doi": "10.1145/2470654.2481365"
    }
  ]
}