{
  "doi": "10.1145/3025453.3025498",
  "title": "ProtoMold: An Interactive Vacuum Forming System for Rapid Prototyping",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2106-2115",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we propose a novel fabrication machine called ProtoMold, which uses interactive vacuum forming system for rapid prototyping. ProtoMold combines a dynamical shape-changing surface that consists of 12 × 8 linear actuators and a vacuum forming system. According to the shape of the surface, this system can mold various 2.5 dimensional objects quickly. Another characteristic of this system is that users can reuse molded objects and change their design; by applying tension and heat to a molded object, the object becomes flat and can be molded again. We also designed user several interaction methods for manipulating ProtoMold. In addition to loading predesigned data, the user can control the shape of the pin display directly using gesture input or physical objects. We propose several use scenarios for ProtoMold: changing the design of a plate based on objects placed on it, fabricating a facemask with a printed texture, and fabricating electrical devices with printed electronic circuits. By using this system, we conducted a user test and discuss the known limitations and potential applications of our system.",
  "tags": [
    "design methods",
    "prototyping",
    "interactive fabrication"
  ],
  "authors": [
    {
      "name": "Junichi Yamaoka",
      "institution": "Keio University, Kanagawa, Japan",
      "img": "/do/10.1145/contrib-81442615273/rel-imgonly/yamaoka_220.jpg",
      "acmid": "81442615273",
      "orcid": "missing"
    },
    {
      "name": "Yasuaki Kakehi",
      "institution": "Keio University, Kanagawa, Japan",
      "img": "/do/10.1145/contrib-81100527572/rel-imgonly/kakehiyasuaki.jpg",
      "acmid": "81100527572",
      "orcid": "0000-0003-4063-9944"
    }
  ],
  "references": [
    {
      "text": "Junichi Yamaoka, Yasuaki Kakehi. 2016. DrawForming: An interactive fabrication method for vacuum forming. In Proceedings of the 10th International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16), pp. 615--620.  ",
      "doi": "10.1145/2839462.2856534"
    },
    {
      "text": "Gershenfeld, Neil. FAB: The coming revolution on your desktop - from personal computers to personal fabrication. Basic Books, 2005",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Dustin Beyer, Tobias Mohr, Serafima Gurevich, Alexander Teibrich, Lisa Pfistere, Kerstin Guenther, Johannes Frohnhofen, Hsiang-Ting Chen, Patrick Baudisch, Sangha Im, and François Guimbretière. 201 Low-fidelity fabrication: Speeding up design iteration of 3D objects. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, NY, NY, USA, pp. 327--330.",
      "doi": ""
    },
    {
      "text": "Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-fidelity fabrication of 3D objects by substituting 3D print with laser-cut plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, pp. 1799--1806.  ",
      "doi": "10.1145/2702123.2702225"
    },
    {
      "text": "Karl D. D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2010. Interactive fabrication: new interfaces for digital fabrication. In Proceedings of the 5th International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, NY, NY, USA, pp. 69--72.",
      "doi": ""
    },
    {
      "text": "Noztek Pro Filament Extruder, http://www.noztek.com/.",
      "doi": ""
    },
    {
      "text": "Sheng Kai Tang, Yusuke Sekikawa, Daniel Leithinger, Sean Follmer, Hiroshi Ishii. 20 Tangible CityScape. http://tangible.media.mit.edu/project/tangible-cityscape/",
      "doi": ""
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 20 ExtensionSticker: A proposal for a striped pattern sticker to extend touch interfaces and its assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, pp. 1851--1854.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, NY, NY, USA, pp. 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Johannes Braumann, Daniel Goldbach, and Elisa Lublasser. Single-point incremental forming. DADA 2015 Conference, in cooperation with Tongji University and FabUnion. https://vimeo.com/132981872.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014. WirePrint: 3D printed previews for fast prototyping. In Proceedings of the 27th Annual Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, pp. 273--280.  ",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. In Proceedings of the 32nd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, pp. 187--188.",
      "doi": ""
    },
    {
      "text": "Kentaro Yasu. \"MOR4R: microwave oven recipes for resins.\" In SIGGRAPH 2015: Studio. ACM, article 4, pp. 1.",
      "doi": ""
    },
    {
      "text": "Tavs Jorgensen. 2015. \"Neo-industrial biography, glass working, and re-configurable toolmaking.\" In SIGGRAPH 2015, Art Gallery.",
      "doi": ""
    },
    {
      "text": "Zhijian Wang, Yan Wang, and Nabil Gindy. July 2010. Planning and control of a hybrid vacuum-forming system based on screw-pin tooling. WSEAS Trans. Sys. Ctrl, vol. 5, no. 7, pp. 557--566.",
      "doi": "10.5555/1865428.1865434"
    },
    {
      "text": "Christian Schüller, Daniele Panozzo, Anselm Grundhöfer, Henning Zimmer, Evgeni Sorkine, and Olga Sorkine-Hornung. July 2016. Computational thermoforming. ACM Trans. Graph, vol. 35, no. 4, article 43, 9 pages.",
      "doi": "10.1145/2897824.2925914"
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal, Samuel Luescher, Akimitsu Hogge, Jinha Lee, and Hiroshi Ishii. 2013. Sublimate: state-changing virtual and physical rendering to augment interaction with shape displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, pp. 1441--1450.  ",
      "doi": "10.1145/2470654.2466191"
    }
  ]
}