{
  "doi": "10.1145/3025453.3025641",
  "title": "Gestures From the Point of View of an Audience: Towards Anticipatable Interaction of Presenters With 3D Content.",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5284-5294",
  "year": 2017,
  "badges": [],
  "abstract": "Presenting content to an audience is important in several fields, including education, marketing, and entertainment. Therefore, the main goal of the presenter is to transport messages to the audience. The paper aims to improve the process of message transportation by providing audience-friendly and anticipatable gestures for the presenter to be used for 3D interaction with the content. For this purpose, we first gathered input from a potential audience through a Wizard of Oz experiment and implemented three coherent gesture sets using the Kinect. We conducted an online survey to evaluate the hypotheses regarding the anticipation rate and perceived user experience. In particular, two of our three gesture sets show tendencies to be intuitively predictable by an untrained, uninformed audience. As the three sets differ significantly in the anticipation level, we conclude that future improvements of such gestures would enhance the audience's ability to predict the intended actions even further.",
  "authors": [
    {
      "name": "Andrey Krekhov",
      "institution": "University Duisburg-Essen, Duisburg, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658760231",
      "orcid": "missing"
    },
    {
      "name": "Katharina Emmerich",
      "institution": "University of Duisburg-Essen, Duisburg, North Rhine-Westphalia, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551044556",
      "orcid": "0000-0002-3198-6373"
    },
    {
      "name": "Maxim Babinski",
      "institution": "University Duisburg-Essen, Duisburg, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162393",
      "orcid": "missing"
    },
    {
      "name": "Jens Krüger",
      "institution": "University Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503661713",
      "orcid": "0000-0002-9197-0613"
    }
  ],
  "references": [
    {
      "text": "DesignDoll. http://terawell.net/. Accessed: 2016--21--19.",
      "doi": ""
    },
    {
      "text": "Alexander, T. C., Ahmed, H. S., and Anagnostopoulos, G. C. An Open Source Framework for Real-Time, Incremental, Static and Dynamic Hand Gesture Learning and Recognition. Springer Berlin Heidelberg, Berlin, Heidelberg, 2009, 123--130.  ",
      "doi": "10.1007/978-3-642-02577-8_14"
    },
    {
      "text": "Althoff, F., McGlaun, G., Lang, M., and Rigoll, G. Evaluating Multimodal Interaction Patterns in Various Application Scenarios. Springer Berlin Heidelberg, Berlin, Heidelberg, 2004, 421--435.",
      "doi": ""
    },
    {
      "text": "Batrinca, L., Stratou, G., Shapiro, A., Morency, L.-P., and Scherer, S. Cicero - Towards a Multimodal Virtual Audience Platform for Public Speaking Training. In International Conference on Intelligent Virtual Humans, Lecture Notes on Computer Science (Edinburgh, UK, Aug. 2013), 116--128.",
      "doi": ""
    },
    {
      "text": "Carter, M., Newn, J., Velloso, E., and Vetere, F. Remote gaze and gesture tracking on the microsoft kinect: Investigating the role of feedback. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, OzCHI '15, ACM (New York, NY, USA, 2015), 167--176.  ",
      "doi": "10.1145/2838739.2838778"
    },
    {
      "text": "Cuccurullo, S., Francese, R., Murad, S., Passero, I., and Tucci, M. A gestural approach to presentation exploiting motion capture metaphors. In Proceedings of the International Working Conference on Advanced Visual Interfaces, AVI '12, ACM (New York, NY, USA, 2012), 148--155.  ",
      "doi": "10.1145/2254556.2254584"
    },
    {
      "text": "Curtis, K., Jones, G. J. F., and Campbell, N. Speaker impact on audience comprehension for academic presentations. In Proceedings of the 18th ACM International Conference on Multimodal Interaction, ICMI 2016, ACM (New York, NY, USA, 2016), 129--136.  ",
      "doi": "10.1145/2993148.2993194"
    },
    {
      "text": "Dahlbäck, N., Jönsson, A., and Ahrenberg, L. Wizard of oz studies: Why and how. In Proceedings of the 1st International Conference on Intelligent User Interfaces, IUI '93, ACM (New York, NY, USA, 1993), 193--200.  ",
      "doi": "10.1145/169891.169968"
    },
    {
      "text": "Figueiredo, L. S., Gonçalves Maciel Pinheiro, M. G., Vilar Neto, E. X., and Teichrieb, V. An open catalog of hand gestures from sci- movies. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, CHI EA '15, ACM (New York, NY, USA, 2015), 1319--1324.  ",
      "doi": "10.1145/2702613.2732888"
    },
    {
      "text": "Fikkert, W., van der Vet, P., van der Veer, G., and Nijholt, A. Gestures for Large Display Control. Springer Berlin Heidelberg, Berlin, Heidelberg, 2010, 245--256.  ",
      "doi": "10.1007/978-3-642-12553-9_22"
    },
    {
      "text": "Gallo, L., Placitelli, A. P., and Ciampi, M. Controller-free exploration of medical image data: Experiencing the kinect. In Computer-Based Medical Systems (CBMS), 2011 24th International Symposium on (June 2011), 1--6.  ",
      "doi": "10.1109/CBMS.2011.5999138"
    },
    {
      "text": "Grandhi, S. A., Joue, G., and Mittelberg, I. Understanding naturalness and intuitiveness in gesture production: Insights for touchless gestural interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (New York, NY, USA, 2011), 821--824.  ",
      "doi": "10.1145/1978942.1979061"
    },
    {
      "text": "Grijincu, D., Nacenta, M. A., and Kristensson, P. O. User-defined interface gestures: Dataset and analysis. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces, ITS '14, ACM (New York, NY, USA, 2014), 25--34.  ",
      "doi": "10.1145/2669485.2669511"
    },
    {
      "text": "Haider, F., Cerrato, L., Campbell, N., and Luz, S. Presentation quality assessment using acoustic information and hand movements. In 2016 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) (March 2016), 2812--2816.",
      "doi": "10.1109/ICASSP.2016.7472190"
    },
    {
      "text": "Hartley, R., Elsayed, A., and Pesheva, M. Communication and design in multimodal presentations. In Seventh IEEE International Conference on Advanced Learning Technologies (ICALT 2007) (July 2007), 923--924.",
      "doi": ""
    },
    {
      "text": "Hespanhol, L., Tomitsch, M., Grace, K., Collins, A., and Kay, J. Investigating intuitiveness and effectiveness of gestures for free spatial interaction with large displays. In Proceedings of the 2012 International Symposium on Pervasive Displays, PerDis '12, ACM (New York, NY, USA, 2012), 6:1--6:6.  ",
      "doi": "10.1145/2307798.2307804"
    },
    {
      "text": "Hinderks, A., Schrepp, M., Rauschenberger, M., and Thomaschewski, J. Konstruktion eines Fragebogens fr jugendliche Personen zur Messung der User Experience. Usability Professionals 2012, September 2012.",
      "doi": ""
    },
    {
      "text": "Holman, D., Stojadinović, P., Karrer, T., and Borchers, J. Fly: An organic presentation tool. In CHI '06 Extended Abstracts on Human Factors in Computing Systems, CHI EA '06, ACM (New York, NY, USA, 2006), 863--868.  ",
      "doi": "10.1145/1125451.1125620"
    },
    {
      "text": "Hsieh, W., Chen, C., Wang, S., Chen, Y., Hwang, Y., and Lai, J. Combination of the kinect with virtual reality in balance training for the elderly. Engineering, 5 (2013), 171--175.",
      "doi": ""
    },
    {
      "text": "Iason Oikonomidis, N. K., and Argyros, A. Efficient model-based 3d tracking of hand articulations using kinect. In Proc. BMVC (2011), 101.1--101.11.",
      "doi": ""
    },
    {
      "text": "Laugwitz, B., Held, T., and Schrepp, M. Construction and Evaluation of a User Experience Questionnaire. Springer Berlin Heidelberg, Berlin, Heidelberg, 2008, 63--76.  ",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Maulsby, D., Greenberg, S., and Mander, R. Prototyping an intelligent agent through wizard of oz. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems, CHI '93, ACM (New York, NY, USA, 1993), 277--284.  ",
      "doi": "10.1145/169059.169215"
    },
    {
      "text": "Microsoft. Kinect hardware. https://dev.windows.com/en-us/kinect/hardware, 2016.",
      "doi": ""
    },
    {
      "text": "Microsoft. Kinect v2 plugin for unity. https://www.google.com/url'sa=t&rct=j&q=&esrc= s&source=web&cd=1&sqi=2&ved= 0ahUKEwiDjcft6szNAhXCtRQKHZobBlcQFggcMAA&url= http%3A%2F%2Fgo.microsoft.com%2Ffwlink%2F% 3FLinkID%3D513177&usg= AFQjCNGZ4Z6Jle9X99V18nodlsmaYQTQOQ&sig2= J6RXEWs-J0bfY9bM-t5tSw&bvm=bv.125801520,d.d24& cad=rja, 22.10.2014. Accessed: 2016--21--19.",
      "doi": ""
    },
    {
      "text": "Nebeling, M., Huber, A., Ott, D., and Norrie, M. C. Web on the wall reloaded: Implementation, replication and refinement of user-defined interaction sets. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces, ITS '14, ACM (New York, NY, USA, 2014), 15--24.  ",
      "doi": "10.1145/2669485.2669497"
    },
    {
      "text": "Nielsen, M., Strring, M., Moeslund, T. B., and Granum, E. A procedure for developing intuitive and ergonomic gesture interfaces for man-machine interaction (2003). 409--420.",
      "doi": ""
    },
    {
      "text": "Ren, Z., Meng, J., Yuan, J., and Zhang, Z. Robust hand gesture recognition with kinect sensor. In Proceedings of the 19th ACM International Conference on Multimedia, MM '11, ACM (New York, NY, USA, 2011), 759--760.  ",
      "doi": "10.1145/2072298.2072443"
    },
    {
      "text": "Roth, S., and Schulz, C. A pattern-based approach to presentations using slide facilities. In Proceedings of the 18th European Conference on Pattern Languages of Program, EuroPLoP '13, ACM (New York, NY, USA, 2015), 15:1--15:12.  ",
      "doi": "10.1145/2739011.2739026"
    },
    {
      "text": "Rovelo Ruiz, G. A., Vanacken, D., Luyten, K., Abad, F., and Camahort, E. Multi-viewer gesture-based interaction for omni-directional video. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, CHI '14, ACM (New York, NY, USA, 2014), 4077--4086.  ",
      "doi": "10.1145/2556288.2557113"
    },
    {
      "text": "Salber, D., and Coutaz, J. Human-Computer Interaction: Third International Conference, EWHCI '93 Moscow, Russia, August 3--7, 1993 Selected Papers. Springer Berlin Heidelberg, Berlin, Heidelberg, 1993, ch. Applying the Wizard of Oz technique to the study of multimodal systems, 219--230. ",
      "doi": "10.5555/646181.682732"
    },
    {
      "text": "Shedroff, N., and Noessel, C. Make it so: Learning from sci-fi interfaces. In Proceedings of the International Working Conference on Advanced Visual Interfaces, AVI '12, ACM (New York, NY, USA, 2012), 7--8.  ",
      "doi": "10.1145/2254556.2254561"
    },
    {
      "text": "Soh, J., Choi, Y., Park, Y., and Yang, H. S. User-friendly 3d object manipulation gesture using kinect. In Proceedings of the 12th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and Its Applications in Industry, VRCAI '13, ACM (New York, NY, USA, 2013), 231--234.  ",
      "doi": "10.1145/2534329.2534338"
    },
    {
      "text": "Song, P., Goh, W. B., Hutama, W., Fu, C.-W., and Liu, X. A handle bar metaphor for virtual object manipulation with mid-air interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '12, ACM (New York, NY, USA, 2012), 1297--1306.  ",
      "doi": "10.1145/2207676.2208585"
    },
    {
      "text": "Tan, K.-H., Gelb, D., Samadani, R., Robinson, I., Culbertson, B., and Apostolopoulos, J. Gaze awareness and interaction support in presentations. In Proceedings of the 18th ACM International Conference on Multimedia, MM '10, ACM (New York, NY, USA, 2010), 643--646.  ",
      "doi": "10.1145/1873951.1874041"
    },
    {
      "text": "Tang, T. Y., Winoto, P., and Wang, R. Y. Having fun over a distance: Supporting multiplayer online ball passing using multiple sets of kinect. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, CHI EA '15, ACM (New York, NY, USA, 2015), 1187--1192.  ",
      "doi": "10.1145/2702613.2732848"
    },
    {
      "text": "Tani, B. S., Maia, R. S., and Wangenheim, A. v. A gesture interface for radiological workstations. In Proceedings of the Twentieth IEEE International Symposium on Computer-Based Medical Systems, CBMS '07, IEEE Computer Society (Washington, DC, USA, 2007), 27--32.  ",
      "doi": "10.1109/CBMS.2007.6"
    },
    {
      "text": "Trinh, H., Yatani, K., and Edge, D. Pitchperfect: Integrated rehearsal environment for structured presentation preparation. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, CHI '14, ACM (New York, NY, USA, 2014), 1571--1580.  ",
      "doi": "10.1145/2556288.2557286"
    },
    {
      "text": "Unity. The leading global game industry software. https://unity3d.com/public-relations, 08.06.2016. Accessed: 2016--21--19.",
      "doi": ""
    },
    {
      "text": "Xiang Cao, Eyal Ofek, D. V. Evaluation of alternative presentation control techniques. In ACM SIG CHI 2005, ACM (January 2005).  ",
      "doi": "10.1145/1056808.1056888"
    },
    {
      "text": "Yang, Y., and Li, L. Turn a nintendo wiimote into a handheld computer mouse. IEEE Potentials Volume: 30, Issue: 1 (2011), 12--16.",
      "doi": ""
    },
    {
      "text": "Zobl, M., Geiger, M., Bengler, K., and Lang, M. A usability study on hand gesture controlled operation of in-car devices. In Poster Proceedings HCII 2001 (New (2001).",
      "doi": ""
    },
    {
      "text": "Zobl, M., Nieschulz, R., Geiger, M., Lang, M., and Rigoll, G. Gesture Components for Natural Interaction with In-Car Devices. Springer Berlin Heidelberg, Berlin, Heidelberg, 2004, 448--459.",
      "doi": ""
    }
  ]
}