{
  "doi": "10.1145/3025453.3025460",
  "title": "Stretching the Bounds of 3D Printing with Embedded Textiles",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "497-508",
  "year": 2017,
  "badges": [],
  "abstract": "Textiles are an old and well developed technology that have many desirable characteristics. They can be easily folded, twisted, deformed, or cut; some can be stretched; many are soft. Textiles can maintain their shape when placed under tension and can even be engineered with variable stretching ability. Conversely, 3D printing is a relatively new technology that can precisely produce functional, rigid objects with custom geometry. Combining 3D printing and textiles opens up new opportunities for rapidly creating rigid objects with embedded flexibility as well as soft materials imbued with additional functionality. In this paper, we introduce a suite of techniques for integrating 3D printing with textiles during the printing process, opening up a new design space that takes inspiration from both fields. We demonstrate how the malleability, stretchability and aesthetic qualities of textiles can enhance rigid printed objects, and how textiles can be augmented with functional properties enabled by 3D printing.",
  "tags": [
    "soft materials",
    "textiles",
    "additive manufacturing",
    "interactive devices",
    "3d printing"
  ],
  "authors": [
    {
      "name": "Michael L. Rivera",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99659160837/rel-imgonly/99659160837.png",
      "acmid": "99659160837",
      "orcid": "missing"
    },
    {
      "name": "Melissa Moukperian",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163250",
      "orcid": "missing"
    },
    {
      "name": "Daniel Ashbrook",
      "institution": "Rochester Institute of Technology, Rochester, NY, USA",
      "img": "/do/10.1145/contrib-81100147905/rel-imgonly/me-in-bw-new-crop2-small.jpg",
      "acmid": "81100147905",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "1. 3D Systems. 2015. How to create a fabricate 3D tech-style fashion. (2015). https://www.youtube.com/watch?v=qKiHso484vw",
      "doi": ""
    },
    {
      "text": "2. Lea Albaugh. 2015. Lea, making things: clothes that move: why, and how? (2015). http://www.instamatique.com/blog/clothes-that-move-why-and-how/",
      "doi": ""
    },
    {
      "text": "3. All3DP. 2016. 27 great 3D printer filament types (a guide). (2016). https://all3dp.com/best-3d-printer filament-types-pla-abs-pet-exotic-wood-metal/",
      "doi": ""
    },
    {
      "text": "4. David Baraff and Andrew Witkin. 1998. Large steps in cloth simulation. In Proceedings of the 25th annual conference on Computer graphics and interactive techniques - SIGGRAPH '98. ACM Press, New York, New York, USA, 43--54. DOI: http://dx.doi.org/10.1145/280814.280821  ",
      "doi": "10.1145/280814.280821"
    },
    {
      "text": "5. E.J.W. Barber. 1991. Prehistoric textiles: The development of cloth in the neolithic and bronze ages with special reference to the aegean. Princeton University Press. https://books.google.com/books?id=HnSlynSfeEIC",
      "doi": ""
    },
    {
      "text": "6. Benjamin Bridgens and Matthew Birchall. 2012. Form and function: The significance of material properties in the design of tensile fabric structures. Engineering Structures 44 (2012), 1 -- 12. DOI: http://dx.doi.org/10.1016/j.engstruct.2012.05.044 ",
      "doi": ""
    },
    {
      "text": "7. Robert Bridson, Ronald Fedkiw, and John Anderson. 2002. Robust treatment of collisions, contact and friction for cloth animation. In Proceedings of the 29th annual conference on Computer graphics and interactive techniques - SIGGRAPH '02, Vol. 21. ACM Press, New York, New York, USA, 594. DOI: http://dx.doi.org/10.1145/566570.566623  ",
      "doi": "10.1145/566570.566623"
    },
    {
      "text": "8. I-Ming Chen, Shusong Xing, R. Tay, and Song Huat Yeo. 2005. Many strings attached: from conventional to robotic marionette manipulation. IEEE Robotics Automation Magazine 12, 1 (Mar 2005), 59--74. DOI: http://dx.doi.org/10.1109/MRA.2005.1411420 ",
      "doi": ""
    },
    {
      "text": "9. Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Trans. Graph. 32, 4, Article 83 (Jul 2013), Article 83, 12 pages. DOI:http://dx.doi.org/10.1145/2461912.2461953  ",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "10. Erik D. Demaine and Martin L. Demaine. 2001. Recent results in computational origami. In Origami3: Proceedings of the 3rd International Meeting of Origami Science, Math, and Education (OSME 2001). A K Peters, Monterey, California, 3--16.",
      "doi": ""
    },
    {
      "text": "11. Stephen Eichhorn, John W.S. Hearle, Mike Jaffe, and Takeshi Kikutani. 2009. Handbook of textile fibre structure: Natural, regenerated, inorganic and specialist fibres. Vol. 2. Elsevier.",
      "doi": ""
    },
    {
      "text": "12. Michael Eisenberg. 2003. Mindstuff educational technology beyond the computer. Convergence: The International Journal of Research into New Media Technologies 9, 2 (2003), 29--53. ",
      "doi": ""
    },
    {
      "text": "13. John W.S. Hearle. 1967. The structural mechanics of fibers. In Journal of Polymer Science Part C: Polymer Symposia, Vol. 20. Wiley Online Library, 215--251. ",
      "doi": ""
    },
    {
      "text": "14. John W.S. Hearle, Percy Grosberg, and Stanley Backer. 1969. Structural mechanics of fibers, yarns, and fabrics. Wiley--Interscience.",
      "doi": ""
    },
    {
      "text": "15. John W.S. Hearle and William E. Morton. 2008. Physical properties of textile fibres. Elsevier.",
      "doi": ""
    },
    {
      "text": "16. Felix Heibeck, Basheer Tome, Clark Della Silva, and Hiroshi Ishii. 2015. uniMorph: Fabricating thin film composites for shape-changing interfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 233--242. DOI: http://dx.doi.org/10.1145/2807442.2807472  ",
      "doi": "10.1145/2807442.2807472"
    },
    {
      "text": "17. Scott E. Hudson. 2014. Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 459--468. DOI: http://dx.doi.org/10.1145/2556288.2557338  ",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "18. Instructables. 2016. How to 3D print onto fabric. (2016). http://www.instructables.com/id/How-to-3D-Print-OntoFabric/",
      "doi": ""
    },
    {
      "text": "19. Gierad Laput, Xiang 'Anthony' Chen, and Chris Harrison. 2015. 3D printed hair: fused deposition modeling of soft strands, fibers, and bristles. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 593--597. DOI: http://dx.doi.org/10.1145/2807442.2807484  ",
      "doi": "10.1145/2807442.2807484"
    },
    {
      "text": "20. R. Melnikova, A. Ehrmann, and K. Finsterbusch. 2014. 3D printing of textile-based structures by fused deposition modelling (FDM) with different polymer materials. In IOP Conference Series: Materials Science and Engineering, Vol. 62. IOP Publishing, 012018. ",
      "doi": ""
    },
    {
      "text": "21. Jussi Mikkonen, Reetta Myllymäki, Sari Kivioja, Santeri Vanhakartano, and Helena Suonsilta. 2013. Printed material and fabric. Nordes 1, 5 (2013).",
      "doi": ""
    },
    {
      "text": "22. Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014a. WirePrint: 3D printed previews for fast prototyping. In Proceedings of the 27th annual ACM Symposium on User Interface Software & Technology (UIST '14). ACM, 273--280.",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "23. Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, Kai-Adrian Rollmann, and Patrick Baudisch. 2014b. faBrickation: Fast 3D printing of functional objects by integrating construction kit building blocks. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 527--530. DOI: http://dx.doi.org/10.1145/2559206.2574779  ",
      "doi": "10.1145/2559206.2574779"
    },
    {
      "text": "24. Grace Ngai, Stephen C.F. Chan, Joey C.Y. Cheung, and Winnie W.Y. Lau. 2009. The TeeBoard: An Education-friendly Construction Platform for e-Textiles and Wearable Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 249--258. DOI: http://dx.doi.org/10.1145/1518701.1518742  ",
      "doi": "10.1145/1518701.1518742"
    },
    {
      "text": "25. Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital fabrication of interactive and shape-changing objects with foldable printed electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 223--232. DOI: http://dx.doi.org/10.1145/2807442.2807494  ",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "26. Eujin Pei, Jinsong Shen, and Jennifer Watling. 2015. Direct 3D printing of polymers onto textiles: experimental studies and applications. Rapid Prototyping Journal 21, 5 (Aug 2015), 556--571. DOI: http://dx.doi.org/10.1108/RPJ-09--2014-0126",
      "doi": ""
    },
    {
      "text": "27. Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A layered fabric 3D printer for soft interactive objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), Vol. 1. ACM Press, New York, New York, USA, 1789--1798. DOI: http://dx.doi.org/10.1145/2702123.2702327  ",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "28. Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting Textile Interfaces from a Kit-of-no-parts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 61--68. DOI:http://dx.doi.org/10.1145/1935701.1935715  ",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "29. Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive digital textiles at scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227. DOI: http://dx.doi.org/10.1145/2858036.2858176  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "30. Daniela K. Rosner and Kimiko Ryokai. 2008. Spyn: Augmenting knitting to support storytelling and reflection. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp '08). ACM, New York, NY, USA, 340--349. DOI: http://dx.doi.org/10.1145/1409635.1409682  ",
      "doi": "10.1145/1409635.1409682"
    },
    {
      "text": "31. Lilia Sabantina, Franziska Kinzel, Andrea Ehrmann, and Karin Finsterbusch. 2015. Combining 3D printed forms with textile structures-mechanical and geometrical properties of multi-material systems. In IOP Conference Series: Materials Science and Engineering, Vol. 87. IOP Publishing, 012005. ",
      "doi": ""
    },
    {
      "text": "32. Ashish Kumar Sen. 2007. Coated textiles: principles and applications. Crc Press. ",
      "doi": ""
    },
    {
      "text": "33. Michael J. Sinclair and Kerwin Wang. 2003. Thermal actuator improvements: tapering and folding. In Proceedings of SPIE - The International Society for Optical Engineering, Jung-Chih Chiao, Vijay K. Varadan, and Carles Can (Eds.). 237--251. DOI: http://dx.doi.org/10.1117/12.499129 ",
      "doi": ""
    },
    {
      "text": "34. Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch. 2015. Patching physical objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 83--91. DOI: http://dx.doi.org/10.1145/2807442.2807467  ",
      "doi": "10.1145/2807442.2807467"
    },
    {
      "text": "35. Cesar Torres, Tim Campbell, Neil Kumar, and Eric Paulos. 2015. HapticPrint: Designing feel aesthetics for 3D printing. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology UIST '15. ACM Press, New York, New York, USA, 583--591. DOI: http://dx.doi.org/10.1145/2807442.2807492  ",
      "doi": "10.1145/2807442.2807492"
    },
    {
      "text": "36. John T. Williams. 2009. Textiles for cold weather apparel. Elsevier. ",
      "doi": ""
    },
    {
      "text": "37. Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM Symposium on User Interface Software & Technology (UIST '13). ACM, ACM, 13--22.",
      "doi": "10.1145/2501988.2502037"
    }
  ]
}