{
  "doi": "10.1145/3025453.3025918",
  "title": "mHealth for Maternal Mental Health: Everyday Wisdom in Ethical Design",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2708-2756",
  "year": 2017,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Health and wellbeing applications increasingly raise ethical issues for design. User-centred and participatory design approaches, while grounded in everyday wisdom, cannot be expected to address ethical reflection consistently, as multiple value systems come into play. We explore the potential of phronesis, a concept from Aristotelian virtue ethics, for mHealth design. Phronesis describes wisdom and judgment garnered from practical experience of specific situations in context. Applied phronesis contributes everyday wisdom to challenging issues for vulnerable target users. Drawing on research into mHealth technologies for psychological wellbeing, we explore how phronesis can inform ethical design. Using a case study on an app for self-reporting symptoms of depression during pregnancy, we present a framework for incorporating a phronetic approach into design, involving: (a) a wide feedback net to capture phronetic input early in design; (b) observing the order of feedback, which directly affects value priorities in design; (c) ethical pluralism recognising different coexisting value systems; (d) acknowledging subjectivity in the disclosure and recognition of individual researcher and participant values. We offer insights into how a phronetic approach can contribute everyday wisdom to designing mHealth technologies to help designers foster the values that promote human flourishing.",
  "tags": [
    "psychological wellbeing",
    "mHealth",
    "ethical design",
    "human flourishing",
    "virtue ethics",
    "phronesis",
    "maternal mental health"
  ],
  "authors": [
    {
      "name": "Marguerite Barry",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659111692",
      "orcid": "missing"
    },
    {
      "name": "Kevin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-99659283723/rel-imgonly/profile_gray_round_resized.png",
      "acmid": "99659283723",
      "orcid": "missing"
    },
    {
      "name": "Jose Marcano Belisario",
      "institution": "Imperial College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161956",
      "orcid": "missing"
    },
    {
      "name": "Josip Car",
      "institution": "Imperial College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498658623",
      "orcid": "missing"
    },
    {
      "name": "Cecily Morrison",
      "institution": "Imperial College London & Microsoft Research, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959289057",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Abdullah, S., Matthews, M., Frank, E., Doherty, G., Gay, G. & Choudhury, T. (2016) Automatic detection of social rhythms in Bipolar Disorder. Journal of the American Medical Informatics Association. DOI 10.1093/jamia/ocv200 ",
      "doi": ""
    },
    {
      "text": "Andorno, R. (2012) Do Our Moral Judgements Need to Be Guided by Principles? Cambridge Quarterly of Healthcare Ethics, 21(4), 457--465 ",
      "doi": ""
    },
    {
      "text": "Aristotle (2011). Nicomachean Ethics. Translated by R.C. Bartlett and S.D. Collins. Chicago: University of Chicago Press. ",
      "doi": ""
    },
    {
      "text": "Bardzell, J., Bardzell, S. (2015). Humanistic HCI, Morgan & Claypool Publishers",
      "doi": ""
    },
    {
      "text": "Bardzell, J. (2009). Interaction Criticism and Aesthetics, CHI Proceedings of the ACM 2009",
      "doi": "10.1145/1518701.1519063"
    },
    {
      "text": "Barry, M (2014) Please do touch: Discourses on aesthetic interactivity in the exhibition space. Participations Vol.11 (1)",
      "doi": ""
    },
    {
      "text": "Barry, M., Doherty, G (2016) 'What we talk about when we talk about interactivity: Empowerment in public discourse', New Media & Society, online February 2, 2016 DOI:10.1177/1461444815625944 ",
      "doi": ""
    },
    {
      "text": "Bauer, A., Parsonage, M., Knapp, M., Iemmi, V., Adelaja, B. (2014). The cost of perinatal mental health problems. London: Centre for Mental Health, London School of Economics.",
      "doi": ""
    },
    {
      "text": "Belman, J., Flanagan, M., Nissenbaum, H., Diamond, J. Grow-A-Game: A tool for values conscious design and analysis of digital games. DiGRA 2011 Conference: Think Design Play, 14--17, 2011.",
      "doi": ""
    },
    {
      "text": "Bernstein, R. (1983) Beyond Objectivism and Relativism Philadelphia: University of PA Press",
      "doi": ""
    },
    {
      "text": "Bødker, S. When second wave HCI meets third wave challenges. Proceedings of NordiCHI, ACM (2006).",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Broadbent et al. (2014) The Onlife Manifesto: Being Human in a Hyperconnected Era, European Commission, available at https://ec.europa.eu/digitalsingle-market/en/onlife-manifesto",
      "doi": ""
    },
    {
      "text": "Brey, P. (2000) Disclosive Computer Ethics, Computers and Society, 30, 4:10--16, ACM  ",
      "doi": "10.1145/572260.572264"
    },
    {
      "text": "Brown, C (2012) The 'Practice Turn', Phronesis and Classical realism: Towards a Phronetic International Political Theory? Millennium Journal of International Studies 40, 3:439--456 ",
      "doi": ""
    },
    {
      "text": "Calvo, R.A., Peters, D (2014) Positive Computing: Technology for wellbeing and human potential, MIT Press",
      "doi": "10.5555/2627995"
    },
    {
      "text": "Carolan, M (2016) \"'Unborn child' has significant legal rights, judge rules\", Irish Times, August 2, 2016 [available at www.irishtimes.com]",
      "doi": ""
    },
    {
      "text": "Cox JL, Holden JM, Sagovsky, R (1987) Detection of post-natal depression: Development of the 10-item Edinburgh Postnatal Depression Scale, British Journal of Psychiatry Jun 150:782--786",
      "doi": ""
    },
    {
      "text": "De Choudhury, M., Counts, S., Horvitz, E (2013) Predicting Postpartum changes in emotion and behavior via social media, Proceedings of CHI 2013, ACM  ",
      "doi": "10.1145/2470654.2466447"
    },
    {
      "text": "Detweiler, C., Pommeranz, A. Stark, L. (2012) Methods to account for values in human-centered computing. CHI EA '12, 2735--2738  ",
      "doi": "10.1145/2212776.2212708"
    },
    {
      "text": "D'Ignazio, C., Hope, A., Michelson, B, Churchill, R., Zuckerman, E (2016) A Feminist HCI Approach to Designing Postpartum Technologies: \"When I first saw a breast pump I was wondering if it was a joke.\", Proceedings of CHI 2016, ACM  ",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Doherty, G., Coyle, D., Sharry, J. (2012). Engagement with Online Mental Health Interventions: An Exploratory Clinical Study of a Treatment for Depression, Proceedings of CHI '12  ",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Doherty, G., Coyle, D., Matthews, M., (2010a) Design and evaluation guidelines for mental health technologies, Interacting with Computers 22, 4: 243-",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Doherty, G., McKnight, J., Luz, S (2010b) Fieldwork for requirements: Frameworks for mobile healthcare applications, Int. J. of Human-Computer Studies 68:760--776  ",
      "doi": "10.1016/j.ijhcs.2010.06.005"
    },
    {
      "text": "Ess, C. (2013) Digital Media Ethics 2nd Edition, Cambridge: Polity.",
      "doi": ""
    },
    {
      "text": "Ess, C. (2015) The Good Life: Selfhood and virtue ethics in the digital age. In Communication and \"The Good Life\", International Communication Association (ICA) Annual Conference Theme Book, Hua Wang (Ed.), Peter Lang Publishing Group",
      "doi": ""
    },
    {
      "text": "Eubanks, V. (2012) 'Feminist phronesis and technologies of citizenship', in Flyvbjerg, B., Landman, T., and Schram, S. (eds.) Real Social Science: Applied Phronesis. Cambridge University Press, pp. 228--245. ",
      "doi": ""
    },
    {
      "text": "Fallman, D (2011) The New Good: Exploring the potential of philosophy of technology to contribute to Human-Computer Interaction, Proceedings of CHI 2011, ACM  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Fairclough, N. (2013) Critical Discourse Analysis: The Critical Study of Language, Routledge",
      "doi": ""
    },
    {
      "text": "Flanagan, M., Nissenbaum, H (2014) Values at Play in Digital Games, MIT Press, Cambridge",
      "doi": "10.5555/2635976"
    },
    {
      "text": "Flanagan, M., Howe, DC, Nissenbaum, H (2005) Values at play: design tradeoffs in socially-oriented game design, Proceedings of CHI 2005, ACM  ",
      "doi": "10.1145/1054972.1055076"
    },
    {
      "text": "Flyvbjerg, B., Landman, T., and Schram, S. (2012a) Real Social Science: Applied Phronesis. Cambridge University Press ",
      "doi": ""
    },
    {
      "text": "Flyvbjerg, B., Landman, T. and Schram, S. (2012b) 'Introduction: new directions in social science', in Flyvbjerg, B., Landman, T., and Schram, S. (eds.) Real Social Science: Applied Phronesis. Cambridge University Press, pp. 1--12. ",
      "doi": ""
    },
    {
      "text": "Friedman, Batya (1996) Value Sensitive Design, interactions, December 1996",
      "doi": ""
    },
    {
      "text": "Friedman, B., Kahn. PH. Jr., Borning, A. (2013) Value Sensitive Design and Information Systems. In Human-Computer Interaction in Management Information Systems: Foundations M.E. Sharpe Inc.",
      "doi": ""
    },
    {
      "text": "Friedman, B. and Nissenbaum, H. (1993) User autonomy: Who should control what and when? Proceedings of CHI '96 ACM, p. 433",
      "doi": ""
    },
    {
      "text": "Gadamer, H.G (1975) Truth and Method, London, Continuum",
      "doi": ""
    },
    {
      "text": "Goffman, E. (1981) Forms of Talk, University of PA Press, Philadelphia, PA",
      "doi": ""
    },
    {
      "text": "Hackett, EJ (2012) Science, Technology & Human Values at 40, Science, Technology & Human Values 37, 5:439--442 ",
      "doi": ""
    },
    {
      "text": "Hammelink C.J (2006) Rethinking ICTs: ICTs on a human scale. European Journal of Communication 21, 3: 389--396 ",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Tractinsky, N (2006) User experience -- a research agenda, Behavior & Information Technology 25, 2:91--97 ",
      "doi": ""
    },
    {
      "text": "Hekler EB., Klasnja, P., Froehlich, JE., Buman, MP (2013). Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of CHI 2013. ACM,  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Howarth, D. (2000) Discourse Open University Press",
      "doi": ""
    },
    {
      "text": "Johnson, J. (2014) Conceptual models: Core to Good Design, Extended Abstracts CHI '14, ACM",
      "doi": "10.1145/2559206.2567811"
    },
    {
      "text": "Kahneman, D., Riis, J., (2005) Living, and thinking about it: Two perspectives on life. The science of wellbeing, 285--304. ",
      "doi": ""
    },
    {
      "text": "Kamp, I., Desmet, P. (2014) Measuring Product Happiness, CHI EA '14: CHI '14 Extended Abstracts on Human Factors in Computing Systems, ACM",
      "doi": "10.1145/2559206.2581274"
    },
    {
      "text": "Kientz, J, Arriaga, RI, Abowd, GD (2009) Baby steps: evaluation of a system to support record-keeping for parents of young children, Proceedings of CHI 2009, ACM  ",
      "doi": "10.1145/1518701.1518965"
    },
    {
      "text": "Koepfler, JA., Stark, L., Dourish, P, Sengers, P, Shilton, K (2014) Values & Design in HCI Education, Workshop, CHI 2014, ACM",
      "doi": "10.1145/2559206.2559231"
    },
    {
      "text": "Knobel, C.P., Bowker, G.C. (2011) Values in design. Communications of the ACM, 54(7), pages 26--28,  ",
      "doi": "10.1145/1965724.1965735"
    },
    {
      "text": "Ko, J. Y., Farr, S. L., Dietz, P. M., Robbins, C. L. (2012). Depression and Treatment Among U.S. Pregnant and Nonpregnant Women of Reproductive Age, 2005 -- 2009. Journal of Women's Health; 21(8): 830 -- 836. doi: 10.1089/jwh.2011.3466. ",
      "doi": ""
    },
    {
      "text": "Kroenke, K., Spitzer RL., Williams, JBW (2001) The PHQ-9: Validity of a Brief Depression Severity Measure, J Gen Intern Med 16, 9: 606--613 ",
      "doi": ""
    },
    {
      "text": "Landman, T. (2012) 'Phronesis and narrative analysis', in Flyvbjerg, B., Landman, T., and Schram, S. (eds.) Real Social Science: Applied Phronesis. Cambridge University Press, pp. 27--47. ",
      "doi": ""
    },
    {
      "text": "Le Dantec, C.A. Poole, E.S. Wyche, S.P. (2009). Values as lived experience: evolving value sensitive design in support of value discovery. Proceedings of CHI '09, 1141--1150  ",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Light, A., and Luckin, R. (2008). Designing for social justice: People, technology, and learning. [available at Futurelab: www.futurelab.org.uk/openingeducation]",
      "doi": ""
    },
    {
      "text": "McCarthy, J., Wright, P. (2004) Technology as Experience MIT Press, Cambridge Mass.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "McCourt, D. (2012) Phronesis and Foreign Policy in theory and practice, e-International Relations, Nov 2012 [available at http://www.eir.info/2012/11/23/phronesis-and-foreign-policy-intheory-and-practice/]",
      "doi": ""
    },
    {
      "text": "Maguire, M. (2001) Methods to support human-centred design, Int J Human-Computer Studies, 55 587--634  ",
      "doi": "10.1006/ijhc.2001.0503"
    },
    {
      "text": "Matthews, M., Doherty, G (2009) The Invisible User, Interactions, Nov 2009, ACM",
      "doi": ""
    },
    {
      "text": "Matthews, M., Doherty, G. (2011) In the mood: engaging teenagers in psychotherapy using mobile phones. Proceedings of CHI 2011, 2947--2956.  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Meyer, J., Simske S., Siek, K., Gurrin, C., Hermens, HJ (2014) Beyond Quantified Self: Data for wellbeing, Workshop, CHI 2014, ACM  ",
      "doi": "10.1145/2559206.2560469"
    },
    {
      "text": "Moggridge, B [2007] Designing Interactions, MIT Press, Cambridge MA",
      "doi": ""
    },
    {
      "text": "Muller, MJ., Druin, A (2010) \"Participatory design: the third space in HCI.\" in Handbook of HCI 2nd Edition, Eds Sears, A., Jacko, J , Erlbaum, NJ",
      "doi": ""
    },
    {
      "text": "Perrier, T., Dell, N., DeRenzi, B., Anderson, R., Kinuthia, J., Unger, J., John-Stewart, G. (2015). Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System. CHI '15. ACM",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Peyton, T., Poole, E., Reddy, M., Kraschnewski, J., Chuang, C. (2014) \"Every pregnancy is different\": Designing mHealth interventions for the pregnancy ecology, DIS '14, ACM  ",
      "doi": "10.1145/2598510.2598572"
    },
    {
      "text": "Sandelowski, M (1994) Separate, but less unequal: Fetal ultrasonography and the transformation of expectant mother/fatherhood, Gender and Society 8:230--245 ",
      "doi": ""
    },
    {
      "text": "Sas, C., Whittaker, S., Dow, S., Forlizzi J., Zimmerman J (2014) Generating Implications for Design through Design Research, Proceedings of CHI '14, ACM  ",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Schram, S. (2012) 'Phronetic social science: an idea whose time has come', in Flyvbjerg, B., Landman, T., and Schram, S. (eds.) Real Social Science: Applied Phronesis. Cambridge University Press, pp. 15--26. ",
      "doi": ""
    },
    {
      "text": "Sengers, P., Boehner, L., David, S., and Kaye, JJ. (2005) Reflective Design. In CC '05: Proceedings of the 4th decennial conference on Critical computing, 4958, ACM 2005  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Shiffman, S., Stone, A. A., Hufford, M. R., (2008) Ecological momentary assessment. Annu. Rev. Clin. Psychol. 4, 1--32 ",
      "doi": ""
    },
    {
      "text": "Shilton, K. (2012). Values levers: building ethics into design. Science, Technology & Human Values 38, 3:374--397 ",
      "doi": ""
    },
    {
      "text": "Shilton, K., Anderson, S (2016) Blended not Bossy: Ethics, roles, responsibilities and expertise in design, Interacting with Computers, 2016 DOI 10.1093/iwc/iww002 ",
      "doi": ""
    },
    {
      "text": "Shilton, Koepfler and Fleischmann (2012) 'Chartering sociotechnical dimensions of values for design research' Information society -- 29 (5)",
      "doi": ""
    },
    {
      "text": "Siegel, M. A., and Beck, J. (2014) \"Slow change interaction design.\" Interactions 21.1 (2014): 28--35  ",
      "doi": "10.1145/2542649"
    },
    {
      "text": "Spiekermann, S. (2015). Ethical IT innovation: A Value-Based System Design Approach, Taylor & Francis ",
      "doi": ""
    },
    {
      "text": "Suh, H., Porter, JR., Hiniker, A., Kientz, JA. 2014. @BabySteps: Design and Evaluation of a System for using Twitter for Tracking Children's Developmental Milestones. Proceedings of CHI'14: 2279--2288  ",
      "doi": "10.1145/2556288.2557386"
    },
    {
      "text": "Thieme, A., Balaam, M., Wallace, J., Coyle, D., & Lindley, S. (2012). Designing wellbeing. Proceedings of the Designing Interactive Systems Conference, 789790. ACM.  ",
      "doi": "10.1145/2317956.2318075"
    },
    {
      "text": "Vallor, S. (2014) Moral Deskilling and Upskilling in a New Machine Age: Reflections on the Ambiguous Future of Character, Philosophy and Technology Vol. 28 107--124 ",
      "doi": ""
    },
    {
      "text": "Vallor, S (2012) Flourishing on facebook: virtue friendship & new social media, Ethics & Information Technology 14, 185--199 ",
      "doi": ""
    },
    {
      "text": "Van der Velden, M., Machniak Sommervold, M (2016) Moodline and MoodMap: Designing a mood function for a mobile application with and for young patients. Proceedings of eTELEMED 2016 : Conference on eHealth, Telemedicine, and Social Medicine, IARIA, ISBN - 978--1--61208--470--1",
      "doi": ""
    },
    {
      "text": "Verbeek, P.P. (2008) Obstetric Ultrasound and the Technological Mediation of Morality: a Postphenomenological Analysis, Human Studies 31:11-",
      "doi": ""
    },
    {
      "text": "Vines, J., Clarke, R., Wright, P., McCarthy, J., Olivier, P., (2013) Configuring participation: on how we involve people in design. Proceedings of CHI 2013. ACM",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Walsh, S., Golden, E., Priebe, S. 2015. Systematic review of patients' participation in and experiences of technology-based monitoring of mental health symptoms in the community, British Medical Journal (BMJ Open)",
      "doi": ""
    },
    {
      "text": "Wierckx, A., Shahid, S., Al Mahmud, A. (2014). Babywijzer: an application to support women during their pregnancy. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM  ",
      "doi": "10.1145/2559206.2581179"
    },
    {
      "text": "World Health Organization (2013) Investing in Mental Health: Evidence for Action, Geneva 2013 ISBN: 978 92 4 156461 8",
      "doi": ""
    },
    {
      "text": "World Health Organization (2011) mHealth: New horizons for health through mobile technologies, Geneva, Switzerland, 2011.",
      "doi": ""
    },
    {
      "text": "Yazici, E., Kirkan, T. S., Aslan, P. A., Aydin, N., Yazici, A. B. (2015). Untreated depression in the first trimester of pregnancy leads to postpartum depression: high rates from a natural follow-up study. Neuropsychiatric Disease and Treatment; 11: 405 -- ",
      "doi": ""
    },
    {
      "text": "Yoo, D., Huldtgren, A, Palzkill Woelfer, J., Hendry, DG, Friedman, B (2013) A Value Sensitive ActionReflection Model: Evolving a Co-Design Space with Stakeholder and Designer Prompts, Proceedings of CHI 2013, ACM",
      "doi": ""
    }
  ]
}