{
  "doi": "10.1145/3025453.3026010",
  "title": "Localized Haptic Texture: A Rendering Technique based on Taxels for High Density Tactile Feedback",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5006-5015",
  "year": 2017,
  "badges": [],
  "abstract": "We investigate the relevance of surface haptic rendering techniques for tactile devices. We focus on the two major existing techniques and show that they have complementary benefits. The first one, called textsc{S}urface textsc{H}aptic textsc{O}bject (textsc{SHO}), which is based on finger position, is shown to be more suitable to render sparse textures; while the second one, called textsc{S}urface textsc{H}aptic textsc{T}exture (textsc{SHT}), which is based on finger velocity, is shown to be more suitable for dense textures and fast finger movements. We hence propose a new rendering technique, called textsc{L}ocalized textsc{H}aptic textsc{T}exture (textsc{LHT}), which is based on the concept of textit{taxel} considered as an elementary tactile information that is rendered on the screen. By using a grid of taxels to encode a texture, textsc{LHT} is shown to provide a consistent tactile rendering across different velocities for high density textures, and is found to reduce user textit{error rate} by up to 77.68% compared to textsc{SHO}.",
  "authors": [
    {
      "name": "Yosra Rekik",
      "institution": "University of Lille Sci. & Tech, CNRS, & INRIA, Lille , France",
      "img": "/do/10.1145/contrib-89758883757/rel-imgonly/yosra.jpg",
      "acmid": "89758883757",
      "orcid": "missing"
    },
    {
      "name": "Eric Vezzoli",
      "institution": "University of Lille Sci. & Tech, CNRS, & INRIA, Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659048525",
      "orcid": "missing"
    },
    {
      "name": "Laurent Grisoni",
      "institution": "University of Lille Sci. & Tech, CNRS, & INRIA, Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100131444",
      "orcid": "missing"
    },
    {
      "name": "Frédéric Giraud",
      "institution": "University of Lille Sci. & Tech, CNRS, & INRIA, Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435596152",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michel Amberg, Frédéric Giraud, Betty Semail, Paolo Olivo, Géry Casiez, and Nicolas Roussel. 2011. STIMTAC : A Tactile Input Device with Programmable Friction. In Proceedings of the 24th Annual ACM Symposium Adjunct on User Interface Software and Technology (UIST '11 Adjunct). ACM, 7--8.  ",
      "doi": "10.1145/2046396.2046401"
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch : Electrovibration for Touch Surfaces. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Alan D. Berger and Pradeep K. Khosla. 1990. Using tactile data for real-time feedback. Springer Berlin Heidelberg, Berlin, Heidelberg, 474--496. ",
      "doi": "10.5555/645621.661421"
    },
    {
      "text": "M. Biet, G. Casiez, F. Giraud, and B. Lemaire-Semail. 2008. Discrimination of Virtual Square Gratings by Dynamic Touch on Friction Based Tactile Displays. In 2008 Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 41--48.  ",
      "doi": "10.1109/HAPTICS.2008.4479912"
    },
    {
      "text": "S. J. Bolanowski, G. A. Gescheider, R. T. Verrillo, and C. M. Checkosky. 1988. Four channels mediate the mechanical aspects of touch. The Journal of the Acoustical Society of America 84, 5 (1988), 1680--1694.",
      "doi": ""
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, Romuald Vanbelleghem, and Frédéric Giraud. 2011. Surfpad : Riding Towards Targets on a Squeeze Film Effect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2491--2500.  ",
      "doi": "10.1145/1978942.1979307"
    },
    {
      "text": "TPad Tablet Project. Tangible Haptic. 2016. T-Pad. Online available. http://www.thetpadphone.com. (2016).",
      "doi": ""
    },
    {
      "text": "Seung-Chan Kim, Ali Israr, and Ivan Poupyrev. 2013. Tactile Rendering of 3D Features on Touch Surfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 531--538.  ",
      "doi": "10.1145/2501988.2502020"
    },
    {
      "text": "Katherine J. Kuchenbecker, Joseph Romano, and William McMahan. 2011. Haptography : Capturing and Recreating the Rich Feel of Real Surfaces. Springer Berlin Heidelberg, Berlin, Heidelberg, 245--260.",
      "doi": ""
    },
    {
      "text": "Darren Leigh, Clifton Forlines, Ricardo Jota, Steven Sanders, and Daniel Wigdor. 2014. High Rate, Low-latency Multi-touch Sensing with Simultaneous Orthogonal Multiplexing. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 355--364.  ",
      "doi": "10.1145/2642918.2647353"
    },
    {
      "text": "Vincent Levesque, Louise Oram, Karon MacLean, Andy Cockburn, Nicholas D. Marchuk, Dan Johnson, J. Edward Colgate, and Michael A. Peshkin. 2011. Enhancing Physicality in Touch Interaction with Programmable Friction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2481--2490.  ",
      "doi": "10.1145/1978942.1979306"
    },
    {
      "text": "C. Muthukrishnan, D. Smith, D. Myers, J. Rebman, and A. Koivo. 1987. Edge detection in tactile images. In Proceedings. 1987 IEEE International Conference on Robotics and Automation, Vol. 4. 1500--1505.",
      "doi": ""
    },
    {
      "text": "Senseg Oy. 2016. Senseg feelscreen development kit. Online available. http://www.senseg.com. (2016).",
      "doi": ""
    },
    {
      "text": "Ludovic Potier, Thomas Pietrzak, Géry Casiez, and Nicolas Roussel. 2016. Designing Tactile Patterns with Programmable Friction. In Actes De La 28IÈMe ConfÉRence Francophone Sur L'Interaction Homme-Machine (IHM '16). ACM, New York, NY, USA, 1--7.  ",
      "doi": "10.1145/3004107.3004110"
    },
    {
      "text": "Anne Roudaut, Andreas Rau, Christoph Sterz, Max Plauth, Pedro Lopes, and Patrick Baudisch. 2013. Gesture Output : Eyes-free Output Using a Force Feedback Touch Surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2547--2556.  ",
      "doi": "10.1145/2470654.2481352"
    },
    {
      "text": "T. Scott Saponas, Chris Harrison, and Hrvoje Benko. 2011. PocketTouch : Through-fabric Capacitive Touch Input. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 303--308.  ",
      "doi": "10.1145/2047196.2047235"
    },
    {
      "text": "C. E. Shannon. 2001. A Mathematical Theory of Communication. SIGMOBILE Mob. Comput. Commun. Rev. 5, 1 (Jan. 2001), 3--55.  ",
      "doi": "10.1145/584091.584093"
    },
    {
      "text": "Lisa Skedung, Martin Arvidsson, Jun Young Chung, Christopher M Stafford, Birgitta Berglund, and Mark W Rutland. 2013. Feeling small : exploring the tactile perception limits. Scientific reports 3 (2013), 2617.",
      "doi": ""
    },
    {
      "text": "Eric Vezzoli, Thomas Sednaoui, Michel Amberg, Frédéric Giraud, and Betty Lemaire-Semail. 2016. Texture Rendering Strategies with a High Fidelity Capacitive Visual-Haptic Friction Control Device. Springer International Publishing, Cham, 251--260.",
      "doi": ""
    },
    {
      "text": "Alison I Weber, Hannes P Saal, Justin D Lieber, Ju-Wen Cheng, Louise R Manfredi, John F Dammann, and Sliman J Bensmaia. 2013. Spatial and temporal codes mediate the tactile perception of natural textures. Proceedings of the National Academy of Sciences 110, 42 (2013), 17107--17112.",
      "doi": ""
    },
    {
      "text": "Michaël Wiertlewski. 2013. The Spatial Spectrum of Tangential Skin Displacement. Springer London, London, 55--80.",
      "doi": ""
    },
    {
      "text": "Michaël Wiertlewski, Rebecca Fenton Friesen, and J Edward Colgate. 2016. Partial squeeze film levitation modulates fingertip friction. Proceedings of the National Academy of Sciences (2016), 201603908.",
      "doi": ""
    },
    {
      "text": "T. Yoshioka, S. J. Bensmaia, J. C. Craig, and S. S. Hsiao. 2007. Texture perception through direct and indirect touch : An analysis of perceptual space for tactile textures in two modes of exploration. Somatosensory & Motor Research 24, 1--2 (2007), 53--70.",
      "doi": ""
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2015. Quantifying the Targeting Performance Benefit of Electrostatic Haptic Feedback on Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 43--46.  ",
      "doi": "10.1145/2817721.2817730"
    }
  ]
}