{
  "doi": "10.1145/3025453.3025519",
  "title": "Watching 360° Videos Together",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4501-4506",
  "year": 2017,
  "badges": [],
  "abstract": "360° videos are made using omnidirectional cameras that capture a sphere around the camera. Viewers get an immersive experience by freely changing their field of view around the sphere. The problem is that current interfaces are designed for a single user, and we do not know what challenges groups of people will have when viewing these videos together. We report on the findings of a study where 16 pairs of participants watched 360° videos together in a \"guided tour\" scenario. Our findings indicate that while participants enjoyed the ability to view the scene independently, this caused challenges establishing joint references, leading to breakdowns in conversation. We conclude by discussing how gaze awareness widgets and gesturing mechanisms may support smoother collaborative interaction around collaborative viewing of 360° videos.",
  "authors": [
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Omid Fakourfar",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021307",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Karolina Buchner, Roman Lissermann, and Lars Erik Holmquist. 2014. Interaction techniques for co-located collaborative TV. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 1819--1824.  ",
      "doi": "10.1145/2559206.2581257"
    },
    {
      "text": "Sarah D'Angelo and Darren Gergle. 2016. Gazed and Confused: Understanding and Designing Shared Gaze for Remote Collaboration. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 24922496.  ",
      "doi": "10.1145/2858036.2858499"
    },
    {
      "text": "Jeff Dyck and Carl Gutwin. 2002. Groupspace: a 3D workspace supporting user awareness. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 502--503.  ",
      "doi": "10.1145/506443.506450"
    },
    {
      "text": "Hasan Shahid Ferdous, Bernd Ploderer, Hilary Davis, Frank Vetere, Kenton O'Hara, Geremy Farr-Wharton, and Rob Comber. 2016. TableTalk: integrating personal devices and content for commensal experiences at the family dinner table. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, NY, NY, USA, 132--143.  ",
      "doi": "10.1145/2971648.2971715"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk, and Tobias Höllerer. 2014. World-stabilized annotations and virtual scene navigation for remote collaboration. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, NY, NY, USA, 449--459.  ",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "Carl Gutwin, and Saul Greenberg. 2002. A Descriptive Framework of Workspace Awareness for Real-Time Groupware. Computer Supported Cooperative Work 11(3-4): 411--446.  ",
      "doi": "10.1023/A%3A1021271517844"
    },
    {
      "text": "Carl Gutwin and Saul Greenberg. 1998. Design for individuals, design for groups: tradeoffs between power and workspace awareness. In Proceedings of the 1998 ACM conference on Computer supported cooperative work (CSCW '98). ACM, NY, NY, USA, 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Jon Hindmarsh, Mike Fraser, Christian Heath, Steve Benford, and Chris Greenhalgh. 1998. Fragmented interaction: establishing mutual orientation in virtual environments. In Proceedings of the 1998 ACM conference on Computer supported cooperative work (CSCW '98). ACM, NY, NY, USA, 217226.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Jon Hindmarsh, Mike Fraser, Christian Heath, Steve Benford, and Chris Greenhalgh. 2000. Object-focused interaction in collaborative virtual environments. ACM Trans. Comput.-Hum. Interact. 7, 4 (December 2000), 477--509.  ",
      "doi": "10.1145/365058.365088"
    },
    {
      "text": "Brennan Jones, Anna Witcraft, Scott Bateman, Carman Neustaedter, and Anthony Tang. 2015. Mechanics of Camera Work in Mobile Video Collaboration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 957--966.  ",
      "doi": "10.1145/2702123.2702345"
    },
    {
      "text": "Shunichi Kasahara and Jun Rekimoto. 2014. JackIn: integrating first-person view with out-of-body vision generation for human-human augmentation. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, NY, NY, USA, Article 46, 8 pages.  ",
      "doi": "10.1145/2582051.2582097"
    },
    {
      "text": "Christian Licoppe and Julien Morel. 2009. The collaborative work of producing meaningful shots in mobile video telephony. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, NY, NY, USA, Article 35, 10 pages.  ",
      "doi": "10.1145/1613858.1613903"
    },
    {
      "text": "Andrés Lucero, Matt Jones, Tero Jokela, and Simon Robinson. 2013. Mobile collocated interactions: taking an offline break together. interactions 20, 2 (March 2013), 26--32.  ",
      "doi": "10.1145/2427076.2427083"
    },
    {
      "text": "Koji Miyauchi, Taro Sugahara, and Hiromi Oda. 2009. Relax or study? A qualitative user study on the usage of live mobile TV and mobile video. Comput. Entertain. 7, 3, Article 43 (September 2009), 20 pages.  ",
      "doi": "10.1145/1594943.1594955"
    },
    {
      "text": "Jýrg Mýller, Tobias Langlotz, and Holger Regenbrecht. 2016. PanoVC: Pervasive telepresence using mobile phones. In Proceedings of 2016 IEEE International Conference on Pervasive Computing and Communications (PerCom 2016). IEEE, 1--10.",
      "doi": ""
    },
    {
      "text": "Kenton O'Hara, April Slayden Mitchell, and Alex Vorbau. 2007. Consuming video on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 857--866.  ",
      "doi": "10.1145/1240624.1240754"
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, William Odom, Anthony Tang, Niala Moallem, Melanie Tory, and Pourang Irani. 2016. The Frustrations and Benefits of Mobile Device Usage in the Home when Co-Present with Family Members. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, NY, NY, USA, 13151327.  ",
      "doi": "10.1145/2901790.2901809"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, and Sarah Sharples. 2016. Using Mobile Phones in Pub Talk. InProceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, NY, NY, USA, 1649--1661.  ",
      "doi": "10.1145/2818048.2820014"
    },
    {
      "text": "Matthew Tait, and Mark Billinghurst. 2015. The Effect of View Independence in a Collaborative AR System. Computer Supported Cooperative Work 24: 563.  ",
      "doi": "10.1007/s10606-015-9231-8"
    },
    {
      "text": "Sherry Turkle. 2012. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books, NY. ",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Nelson Wong and Carl Gutwin. 2014. Support for deictic pointing in CVEs: still fragmented after all these years'. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM, NY, NY, USA, 1377--1387.  ",
      "doi": "10.1145/2531602.2531691"
    },
    {
      "text": "Nicola Yuill, Yvonne Rogers, and Jochen Rick. 2013. Pass the iPad: collaborative creating and sharing in family groups. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 941950.  ",
      "doi": "10.1145/2470654.2466120"
    }
  ]
}