{
  "doi": "10.1145/3025453.3025817",
  "title": "Quantifying Sources and Types of Smartwatch Usage Sessions",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3569-3581",
  "year": 2017,
  "badges": [],
  "abstract": "We seek to quantify smartwatch use, and establish differences and similarities to smartphone use. Our analysis considers use traces from 307 users that include over 2.8 million notifications and 800,000 screen usage events, and we compare our findings to previous work that quantifies smartphone use. The results show that smartwatches are used more briefly and more frequently throughout the day, with half the sessions lasting less than 5 seconds. Interaction with notifications is similar across both types of devices, both in terms of response times and preferred application types. We also analyse the differences between our smartwatch dataset and a dataset aggregated from four previously conducted smartphone studies. The similarities and differences between smartwatch and smartphone use suggest effect on usage that go beyond differences in form factor.",
  "tags": [
    "session",
    "smartwatches",
    "applications",
    "smartphones",
    "usage",
    "interactions"
  ],
  "authors": [
    {
      "name": "Aku Visuri",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/do/10.1145/contrib-99659071495/rel-imgonly/profile.jpg",
      "acmid": "99659071495",
      "orcid": "missing"
    },
    {
      "name": "Zhanna Sarsenbayeva",
      "institution": "University of Oulu & University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659071217",
      "orcid": "missing"
    },
    {
      "name": "Niels van Berkel",
      "institution": "University of Melbourne & University of Oulu, Oulu, Finland",
      "img": "/do/10.1145/contrib-99658743711/rel-imgonly/niels_van_berkel_2022.jpg",
      "acmid": "99658743711",
      "orcid": "0000-0001-5106-7692"
    },
    {
      "name": "Jorge Goncalves",
      "institution": "University of Melbourne & University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488650470",
      "orcid": "0000-0002-0117-0322"
    },
    {
      "name": "Reza Rawassizadeh",
      "institution": "Dartmouth College, Hanover, NH, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470653586",
      "orcid": "missing"
    },
    {
      "name": "Vassilis Kostakos",
      "institution": "University of Melbourne & University of Oulu, Oulu, Finland",
      "img": "/do/10.1145/contrib-81100283202/rel-imgonly/vassilis_kostakos2.jpg",
      "acmid": "81100283202",
      "orcid": "missing"
    },
    {
      "name": "Denzil Ferreira",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/do/10.1145/contrib-81488667228/rel-imgonly/denzilferreira_hires.jpg",
      "acmid": "81488667228",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eirik Årsand, Miroslav Muzny, Meghan Bradway, Jan Muzik and Gunnar Hartvigsen. 2015. Performance of the First Combined Smartwatch and Smartphone Diabetes Diary Application Study. Journal of Diabetes Science and Technology 9, 3, I556--563. http://dx.doi.org/10.1177/1932296814567708 ",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Christina Brant, Jennifer Mankoff and Anind Dey. 2014. ProactiveTasks: The Short of Mobile Device Use Sessions. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 243--25 http://dx.doi.org/10.1145/2628363.2628380  ",
      "doi": "10.1145/2628363.2628380"
    },
    {
      "text": "Matthias Böhmer, Christian Lander, Sven Gehring, Duncan D. P. Brumby and Antonio Krüger. 2014. Interrupted by a Phone Call: Exploring Designs for Lowering the Impact of Call Notifications for Smartphone Users. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3045--3054. http://dx.doi.org/10.1145/2556288.2557066  ",
      "doi": "10.1145/2556288.2557066"
    },
    {
      "text": "Barry Brown, Moira McGregor and Donald McMillan. 201 100 Days of iPhone Use: Understanding the Details of Mobile Device Use. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 223--232. http://dx.doi.org/10.1145/2628363.2628377  ",
      "doi": "10.1145/2628363.2628377"
    },
    {
      "text": "Andreas Bulling, Ulf Blanke and Bernt Schiele. 2014. A Tutorial on Human Activity Recognition Using Body-worn Inertial Sensors. ACM Comput. Surv. 46, 3, I33:1--33:33. http://dx.doi.org/10.1145/2499621  ",
      "doi": "10.1145/2499621"
    },
    {
      "text": "Marta M. E. Cecchinato, Anna A. L. Cox and Jon Bird. 2015. Smartwatches: The Good, the Bad and the Ugly? In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 2133--2138. http://dx.doi.org/10.1145/2702613.2732837  ",
      "doi": "10.1145/2702613.2732837"
    },
    {
      "text": "Yujie Dong, Jenna Scisco, Mike Wilson, Eric Muth and Adam Hoover. 2014. Detecting Periods of Eating During Free-Living by Tracking Wrist Motion. IEEE Journal of Biomedical and Health Informatics 18, 4, I1253--1260. http://dx.doi.org/10.1109/JBHI.2013.2282471 ",
      "doi": ""
    },
    {
      "text": "Hossein Falaki, Ratul Mahajan, Srikanth Kandula, Dimitrios Lymberopoulos, Ramesh Govindan and Deborah Estrin. 2010. Diversity in Smartphone Usage. In Proceedings of the 8th International Conference on Mobile Systems, Applications, and Services, ACM, 179--194. http://dx.doi.org/10.1145/1814433.1814453  ",
      "doi": "10.1145/1814433.1814453"
    },
    {
      "text": "Denzil Ferreira, Jorge Goncalves, Vassilis Kostakos, Louise Barkhuus and Anind A. K. Dey. 2014. Contextual Experience Sampling of Mobile Application Micro-Usage. In International Conference on Human-Computer Interaction with Mobile Devices and Services, ACM, 91--100. http://dx.doi.org/10.1145/2628363.2628367  ",
      "doi": "10.1145/2628363.2628367"
    },
    {
      "text": "Denzil Ferreira, Vassilis Kostakos, Alastair A. R. Beresford, Janne Lindqvist and Anind A. K. Dey. 2015. Securacy: An Empirical Investigation of Android Applications' Network Usage, Privacy and Security. In Conference on Security and Privacy in Wireless and Mobile Networks, ACM, 11:1--11:11. http://dx.doi.org/1145/2766498.2766506",
      "doi": ""
    },
    {
      "text": "First five things to know about the LG Watch Urbane 2nd Edition LTE. Retrieved August 31, 2016 from http://www.androidcentral.com/",
      "doi": ""
    },
    {
      "text": "Wayne W. C. Giang, Liberty Hoekstra-Atwood and Birsen Donmez. 2014. Driver Engagement in Notifications: A Comparison of Visual-Manual Interaction between Smartwatches and Smartphones. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 58, 1, I2161--2165. http://dx.doi.org/10.1177/1541931214581454 ",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Fábio Pereira, Evangelos Karapanos, Sean S. A. Munson and Marc Hassenzahl. 2016. Exploring the Design Space of Glanceable Feedback for Physical Activity Trackers. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 144--155. http://dx.doi.org/10.1145/2971648.2971754  ",
      "doi": "10.1145/2971648.2971754"
    },
    {
      "text": "Simo Hosio, Denzil Ferreira, Jorge Goncalves, Niels van Berkel, Chu Luo, Muzamil Ahmed, Huber Flores and Vassilis Kostakos. 2016. Monetary Assessment of Battery Life on Smartphones. In Conference on Human Factors in Computing Systems, ACM, 1869--1880. http://dx.doi.org/10.1145/2858036.2858285  ",
      "doi": "10.1145/2858036.2858285"
    },
    {
      "text": "Emil Jovanov. 20 Preliminary analysis of the use of smartwatches for longitudinal health monitoring. In Annual International Conference of the IEEE Engineering in Medicine and Biology Society, IEEE, 865--868. http://dx.doi.org/10.1109/EMBC.2015.7318499 ",
      "doi": ""
    },
    {
      "text": "Martin Kracheel, Walter Bronzi and Hamed Kazemi. 2014. A Wearable Revolution: Is the smartwatch the next small big thing? IT ONE Magazine 2014 7, 18--19.",
      "doi": ""
    },
    {
      "text": "LG launches Watch Urbane 2nd Edition with LTE connectivity, higher-resolution display. Retrieved August 31, 2016 from http://www.androidcentral.com/lg-launches-watch-urbane-2nd-edition-lte-connectivity-higher-resolution-display",
      "doi": ""
    },
    {
      "text": "Janosch Maier and Wolfgang Wörndl. 2015. Smartwatch Interaction - More than just Notifications. In Mensch und Computer 2015 - Workshopband Anette Weisbecker, Michael Burmester and Albrecht Schmidt (eds.). De Gruyter Oldenbourg, 299--303. ",
      "doi": ""
    },
    {
      "text": "Abhinav Mehrotra, Robert Hendley and Mirco Musolesi. 2016. PrefMiner: Mining Users Preferences for Intelligent Mobile Notification Management. In ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 1223--1234, http://dx.doi.org/ 10.1145/2971648.2971747  ",
      "doi": "10.1145/2971648.2971747"
    },
    {
      "text": "Chulhong Min, Seungwoo Kang, Chungkuk Yoo, Jeehoon Cha, Sangwon Choi, Younghan Oh and Junehwa Song. 2015. Exploring Current Practices for Battery Use and Management of Smartwatches. In Proceedings of the 2015 ACM International Symposium on Wearable Computers, ACM, 11--18. http://dx.doi.org/10.1145/2802083.2802085  ",
      "doi": "10.1145/2802083.2802085"
    },
    {
      "text": "Gary G. C. Moore and Izak Benbasat. 1991. Development of an Instrument to Measure the Perceptions of Adopting an Information Technology Innovation. Information Systems Research 2, 3, I192--222. http://dx.doi.org/10.1287/isre.2.3.192  ",
      "doi": "10.1287/isre.2.3.192"
    },
    {
      "text": "Bobak B. J. Mortazavi, Mohammad Pourhomayoun, Gabriel Alsheikh, Nabil Alshurafa, Sunghoon S. I. Lee and Majid Sarrafzadeh. 2014. Determining the Single Best Axis for Exercise Repetition Recognition and Counting on SmartWatches. In International Conference on Wearable and Implantable Body Sensor Networks, IEEE, 33--38. http://dx.doi.org/10.1109/BSN.2014.21  ",
      "doi": "10.1109/BSN.2014.21"
    },
    {
      "text": "Leysia Palen, Marilyn Salzman and Ed Youngs. 2000. Going Wireless: Behavior & Practice of New Mobile Phone Users. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work, ACM, 201--210. http://dx.doi.org/10.1145/358916.358991  ",
      "doi": "10.1145/358916.358991"
    },
    {
      "text": "Martin Pielot, Karen Church and Rodrigo de Oliveira. 2014. An In-situ Study of Mobile Phone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services, ACM, 233--242. http://dx.doi.org/10.1145/2628363.2628364  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Lee Rainie and Kathryn Zickuhr. 2015. Americans' Views on Mobile Etiquette. 1--39.",
      "doi": ""
    },
    {
      "text": "Raul R. I. Ramos-Garcia and Adam A. W. Hoover. 2013. A Study of Temporal Action Sequencing During Consumption of a Meal. In Proceedings of the International Conference on Bioinformatics, Computational Biology and Biomedical Informatics, ACM, 68:68--68:75. http://dx.doi.org/10.1145/2506583.2506596  ",
      "doi": "10.1145/2506583.2506596"
    },
    {
      "text": "Reza Rawassizadeh, Blaine B. A. Price and Marian Petre. 2015. Wearables: Has the Age of Smartwatches Finally Arrived? Communications of the ACM 58, 45--47. http://doi.acm.org/10.1145/2629633 http://dx.doi.org/10.1145/2629633.  ",
      "doi": "10.1145/2629633"
    },
    {
      "text": "Reza Rawassizadeh, Martin Tomitsch, Manouchehr Nourizadeh, Elaheh Momeni, Aaron Peery, Liudmila Ulanova and Michael Pazzani. 2015. Energy-Efficient Integration of Continuous Context Sensing and Prediction into Smartwatches. Sensors 15 (9), I22616 - 22645. http://dx.doi.org/10.3390/s150922616 ",
      "doi": ""
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber and Albrecht Schmidt. 2014. Large-scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3055--3064. http://dx.doi.org/10.1145/2556288.2557189  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Antti Salovaara, Antti Lindqvist, Tero Hasu and Jonna Häkkilä. 2011. The Phone Rings but the User Doesn't Answer: Unavailability in Mobile Communication. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, ACM, 503--512. http://dx.doi.org/10.1145/2037373.2037448  ",
      "doi": "10.1145/2037373.2037448"
    },
    {
      "text": "Philipp P. M. Scholl and Kristof K. V. Laerhoven. 2012. A Feasibility Study of Wrist-Worn Accelerometer Based Detection of Smoking Habits. In International Conference on Innovative Mobile and Internet Services in Ubiquitous Computing, IEEE, 886--891. http://dx.doi.org/10.1109/IMIS.2012.96  ",
      "doi": "10.1109/IMIS.2012.96"
    },
    {
      "text": "Alireza A. S. Shirazi and Niels Henze. 2015. Assessment of Notifications on Smartwatches. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, ACM, 1111--1116. http://dx.doi.org/10.1145/2786567.2794338  ",
      "doi": "10.1145/2786567.2794338"
    },
    {
      "text": "Muhammad Shoaib, Stephan Bosch, Hans Scholten, Paul P. J. M. Havinga and Ozlem O. D. Incel. 2015. Towards detection of bad habits by fusing smartphone and smartwatch sensors. In International Conference on Pervasive Computing and Communication Workshops, IEEE, 591--596. http://dx.doi.org/10.1109/PERCOMW.2015.7134104 ",
      "doi": ""
    },
    {
      "text": "Tapio Soikkeli, Juuso Karikoski and Heikki Hämmäinen. 2011. Diversity and End User Context in Smartphone Usage Sessions. In International Conference on Next Generation Mobile Applications, Services and Technologies, IEEE, 7--12. http://dx.doi.org/10.1109/NGMAST.2011.12  ",
      "doi": "10.1109/NGMAST.2011.12"
    },
    {
      "text": "Niels van Berkel, Chu Luo, Theodoros Anagnostopoulos, Denzil Ferreira, Jorge Goncalves, Simo Hosio and Vassilis Kostakos. 2016. A Systematic Assessment of Smartphone Usage Gaps. In Conference on Human Factors in Computing Systems, ACM, 4711--4721. http://dx.doi.org/10.1145/2858036.2858348  ",
      "doi": "10.1145/2858036.2858348"
    },
    {
      "text": "Viswanath Venkatesh, Michael M. G. Morris, Gordon G. B. Davis and Fred F. D. Davis. 2003. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly 27, 3, I425--478.",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Aku Visuri, Zhanna Sarsenbayeva, Jorge Goncalves, Evangelos Karapanos and Simon Jones. 2016. Impact of Mood Changes on Application Selection. In International Joint Conference on Pervasive and Ubiquitous Computing Adjunct, ACM. http://dx.doi.org/10.1145/2968219.2968317  ",
      "doi": "10.1145/2968219.2968317"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, Philipp Kratzer and Niels Henze. 2016. In-situ investigation of notifications in multi-device environments. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 1259--1264.  ",
      "doi": "10.1145/2971648.2971732"
    },
    {
      "text": "Liang-Hong Wu, Liang-Chuan Wu and Shou-Chi Chang. 2016. Exploring consumers' intention to accept smartwatch. Computers in Human Behavior 64, I383--392. http://dx.doi.org/10.1016/j.chb.2016.07.005 ",
      "doi": "10.1016/j.chb.2016.07.005"
    },
    {
      "text": "Taha Yalçin. 2015. Nutzerzentrierte Untersuchung von Benachrichtigungen auf intelligenten Uhren. Grin Verlag Gmbh.",
      "doi": ""
    },
    {
      "text": "Tingxin Yan, David Chu, Deepak Ganesan, Aman Kansal and Jie Liu. 2012. Fast app launching for mobile devices using predictive user context. In MobiSys, 113--126. http://dx.doi.org/10.1145/2307636.2307648  ",
      "doi": "10.1145/2307636.2307648"
    }
  ]
}