{
  "doi": "10.1145/3025453.3025481",
  "title": "Cinehacking Cape Town - Embracing Informality in Pursuit of High Quality Media",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4753-4764",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Although many common tools of media making such as video cameras have become more accessible in recent years, many remain inaccessible. Cinematography, lighting and sound-recording equipment for example can be prohibitively expensive to obtain, complex to configure, and/or require specialist knowledge to operate effectively. These barriers can prevent non-professionals who want to produce high-quality media from being able to. Cinehack is an ongoing project to research ways to overcome these barriers. In this paper, we specifically report on Cinehack: Cape Town, a participatory media making project. By co-producing hip hop videos within a community for whom media making is often a \"means-to-an-end\", we were able gain insights into the kinds of support needed to enable high quality media making by non-professionals. Specifically, we highlight ways to meet users' needs by embracing informal codes of practice via experimental making and peer-support.",
  "authors": [
    {
      "name": "David Philip Green",
      "institution": "Northumbria University & Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547262856",
      "orcid": "missing"
    },
    {
      "name": "Guy Schofield",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474697023",
      "orcid": "missing"
    },
    {
      "name": "Gary Pritchard",
      "institution": "University of Surrey, Guildford, Surrey, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556719056",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    },
    {
      "name": "Peter Wright",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making cultures: empowerment, participation, and democracy - or not? In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, NY, NY, USA, 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Payal Arora and Filip Vermeylen, The end of the art connoisseur? Experts and knowledge production in the visual arts in the digital age. In Information, Communication & Society, Volume 16, Issue 2, pp192214, March 2013.",
      "doi": ""
    },
    {
      "text": "Stefano Bocconi, Frank Nack, and Lynda Hardman. 2005. Vox Populi: A Tool for Automatically Generating Video Documentaries. In Proceedings of the sixteenth ACM conference on Hypertext and hypermedia (HYPERTEXT '05). ACM, NY, NY, USA, 292--294.  ",
      "doi": "10.1145/1083356.1083427"
    },
    {
      "text": "Harriet Bradley, Mark Erickson, Carol Stephenson and Steve Williams. 2001. Myths at Work, Wiley.",
      "doi": ""
    },
    {
      "text": "Alan Crawford, Ideas and Objects: The Arts and Crafts Movement in Britain, Design Issues, Vol. 13, No. 1, Designing the Modern Experience, 1885--1945 (Spring, 1997), pp. 15--26",
      "doi": ""
    },
    {
      "text": "Marc Davis. 2003. Editing out Video Editing. IEEE MultiMedia 10, 2 (March 2003), 54--64.  ",
      "doi": "10.1109/MMUL.2003.1195161"
    },
    {
      "text": "L. Dubé, A. Bourhis and R. Jacob. 2005. \"The Impact of Structuring Characteristics on the Launching of Virtual Communities of Practice\". Journal of Organizational Change Management. 18 (2): 145--166.",
      "doi": ""
    },
    {
      "text": "Richard Dunn , All by myself Official RICHARD DUNN -- Retrieved 10th Sept, 2016 https://www.youtube.com/watch?v=L1bGwGdFtjE",
      "doi": ""
    },
    {
      "text": "Film Riot, $10 DIY Slider -- Retrieved 10th Sept, 2016 https://www.youtube.com/watch?v=fR_-R2bS9ag",
      "doi": ""
    },
    {
      "text": "GoPro Music -- \"David Finlayson's Trombone Silliness, by GoPro\" -- Retrieved 10th Sept, 2016 https://www.youtube.com/watch?v=rNdXezVKeOA",
      "doi": ""
    },
    {
      "text": "David Philip Green, Simon J. Bowen, Christopher Newell, Guy Schofield, Tom Bartindale, Clara Crivellaro, Alia Sheikh, Peter Wright, and Patrick Olivier. 2015. Beyond Participatory Production: Digitally Supporting Grassroots Documentary. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3157--3166.  ",
      "doi": "10.1145/2702123.2702203"
    },
    {
      "text": "G. R. Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction, 18(3), 1--20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Md. Rakibul Hoque and Md. Mahfuz Ashraf. 2015. An ICT4D project for promoting health awareness programmes in indigenous community. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (ICTD '15). ACM, NY, NY, USA, , Article 42 , 4 pages.  ",
      "doi": "10.1145/2737856.2737858"
    },
    {
      "text": "Chris Jones and Genevieve Joliff. 2006. Guerilla Film Makers Handbook. Continuum International Publishing Group.",
      "doi": ""
    },
    {
      "text": "Matt Jones and Gary Marsden. 2006. Mobile Interaction Design. Wiley.",
      "doi": "10.5555/1204709"
    },
    {
      "text": "Oskar Juhlin, Arvid Engström, and Elin Önnevall. 2014. Long tail TV revisited: from ordinary camera phone use to pro-am video production. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1325--1334.  ",
      "doi": "10.1145/2556288.2557315"
    },
    {
      "text": "Yasmin B. Kafai, and Kylie A. Peppler. 2011\"Youth, Technology, and DIY Developing Participatory Competencies in Creative Media Production. Review of Research? in Education 35.1: 89--119.",
      "doi": ""
    },
    {
      "text": "David Kirk, Abigail Sellen, Richard Harper, and Ken Wood. 2007. Understanding Videowork. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 61--70.  ",
      "doi": "10.1145/1240624.1240634"
    },
    {
      "text": "Michele Knobel and Colin Lankshear (eds). 2010. DIY Media: Creating, Sharing and Learning with New Technologies. In New Literacies and Digital Epistemologies, Vol. 44. Peter Lang Publishing.",
      "doi": ""
    },
    {
      "text": "Robert Lee, Monsters - Budget - The Myth of the Micro Budget -- Retrieved 10th Sept, 2016 from https://www.youtube.com/watch?v=DvFAdgi7SoA",
      "doi": ""
    },
    {
      "text": "Alice McIntyre. Participatory Action Research. Vol. 52. Sage Publications, 2007.",
      "doi": ""
    },
    {
      "text": "Eric Paulos. 2013. The Rise of the Expert Amateur: DIY Culture and the Evolution of Computer Science. SIGARCH Comput. Archit. News 41, 1 (March 2013), 153--154.  ",
      "doi": "10.1145/2490301.2451133"
    },
    {
      "text": "No Film School - Retrieved 10th Sept, 2016 http://www.nofilmschool.com",
      "doi": ""
    },
    {
      "text": "OECD (The Organisation for Economic Co-operation and Development) http://www.oecd.org/dac/stats/daclist.htm",
      "doi": ""
    },
    {
      "text": "Dayo Olopade. 2014. The Bright Continent: Breaking Rules and Making Change in Modern Africa. Houghton Mifflin Harcourt,",
      "doi": ""
    },
    {
      "text": "Dayo Olopade, Opening Keynote. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, NY, NY, USA.",
      "doi": ""
    },
    {
      "text": "Gary Pritchard. Hip-hop heads: the social world of musical performers in post-apartheid Cape Town. 2011, PhD Thesis, Newcastle University.",
      "doi": ""
    },
    {
      "text": "Gary Pritchard. Cultural imperialism, Americanisation and Cape Town hip-hop culture: a discussion piece. in Social Dynamics 35.1 (2009): 51--55.",
      "doi": ""
    },
    {
      "text": "Gary W. Pritchard and John Vines. 2013. Digital apartheid: an ethnographic account of racialised hci in Cape Town hip-hop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2537--2546.  ",
      "doi": "10.1145/2470654.2481350"
    },
    {
      "text": "Marco Sá, David A. Shamma, and Elizabeth F. Churchill. 2014. Live mobile collaboration for video production: design, guidelines, and requirements. Personal Ubiquitous Comput. 18, 3 (March 2014), 693707.  ",
      "doi": "10.1007/s00779-013-0700-0"
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 767--776.  ",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "S. Revi Sterling and Nimmi Rangaswamy. 2010. Constructing informed consent in ICT4D research. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10). ACM, NY, NY, USA, , Article 46 , 9 pages.  ",
      "doi": "10.1145/2369220.2369264"
    },
    {
      "text": "Thomas, George E. William L. Price. 2000. Arts and Crafts to Modern Design. Princeton Architectural Press.",
      "doi": ""
    },
    {
      "text": "Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2603--2612.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Vasiliki Tsaknaki and Ylva Fernaeus. 2016. Expanding on Wabi-Sabi as a Design Resource in HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5970--5983.  ",
      "doi": "10.1145/2858036.2858459"
    },
    {
      "text": "Anja Venter. 2014. Creative participation and mobile ecologies among resource-constrained aspirant designers in Cape Town, South Africa. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts Volume 2 (PDC '14), Vol. 2. ACM, NY, NY, USA, 225--228.  ",
      "doi": "10.1145/2662155.2662241"
    },
    {
      "text": "McKenzie Wark. 2004. A Hacker Manifesto. Harvard University Press. ",
      "doi": "10.5555/993664"
    },
    {
      "text": "Alexandra Weilenmann, Roger Säljö, and Arvid Engström. 2014. Mobile video literacy: negotiating the use of a new visual technology. Personal Ubiquitous Comput. 18, 3 (March 2014), 737--752.  ",
      "doi": "10.1007/s00779-013-0703-x"
    }
  ]
}