{
  "doi": "10.1145/3025453.3025482",
  "title": "Chameleon Devices: Investigating More Secure and Discreet Mobile Interactions via Active Camouflaging",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5184-5196",
  "year": 2017,
  "badges": [],
  "abstract": "Many users value the ability to have quick and frequent sight of their mobiles when in public settings. However, in doing so, they expose themselves to potential risks, ranging from being targets of robbery to the more subtle social losses through being seen to be rude or inattentive to those around them. In nature, some animals can blend into their environments to avoid being eaten or to reduce their impact on the ecosystem around them. Taking inspiration from these evolved systems we investigate the notion of chameleon approaches for mobile interaction design. Our probes were motivated, inspired and refined through extended interactions with people drawn from contexts with differing ranges of security and privacy concerns. Through deployments on users' own devices, our prototypes show the value of the concept. The encouraging results motivate further research in materials and form factors that can provide more effective automatic plain-sight hiding.",
  "authors": [
    {
      "name": "Jennifer Pearson",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "Simon Robinson",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81371592031/rel-imgonly/profile-small-rect.jpg",
      "acmid": "81371592031",
      "orcid": "0000-0001-9228-006X"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    },
    {
      "name": "Anirudha Joshi",
      "institution": "IIT Bombay, Mumbai, India",
      "img": "/do/10.1145/contrib-81100643208/rel-imgonly/81100643208.jpg",
      "acmid": "81100643208",
      "orcid": "missing"
    },
    {
      "name": "Shashank Ahire",
      "institution": "IIT Bombay, Mumbai, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658659910",
      "orcid": "missing"
    },
    {
      "name": "Deepak Sahoo",
      "institution": "Swansea University & University of Sussex, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-99658704388/rel-imgonly/dsc_0054_413.jpeg",
      "acmid": "99658704388",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, Daniel Wigdor and George Fitzmaurice. 2015. Supporting subtlety with deceptive devices and illusory interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1489--1498.  ",
      "doi": "10.1145/2702123.2702336"
    },
    {
      "text": "Lyn Bartram, Colin Ware and Tom Calvert. 2003. Moticons: detection, distraction and task. Int. J. Hum.-Comput. Stud. 58, 5, 515--545.  ",
      "doi": "10.1016/S1071-5819%2803%2900021-1"
    },
    {
      "text": "Volkert Buchmann, Trond Nilsen and Mark Billinghurst. 2005. Interaction with partially transparent hands and objects. In Proceedings of the Sixth Australasian Conference on User Interface - Volume 40 (AUIC '05). Australian Computer Society, Inc., Darlinghurst, Australia, Australia, 17--20. http://dl.acm. org/citation.cfm?id=1082243.1082246. ",
      "doi": "10.5555/1082243.1082246"
    },
    {
      "text": "Christopher S. Campbell and Peter Tarasewich. 2004. What can you say with only three pixels? In Mobile Human-Computer Interaction - Mobile HCI 2004, 6th International Symposium, Glasgow, UK, September 13--16, 2004, Proceedings, 1--12.",
      "doi": ""
    },
    {
      "text": "Hongsheng Chen, Bin Zheng, Lian Shen, Huaping Wang, Xianmin Zhang, Nikolay I Zheludev and Baile Zhang. 2013. Ray-optics cloaking devices for large objects in incoherent natural light. Nature communications 4.",
      "doi": ""
    },
    {
      "text": "Xianzhong Chen, Yu Luo, Jingjing Zhang, Kyle Jiang, John B Pendry and Shuang Zhang. 2011. Macroscopic invisibility cloaking of visible light. Nature Communications 2, 176.",
      "doi": ""
    },
    {
      "text": "Joseph S. Choi and John C. Howell. 2014. Paraxial ray optics cloaking. Opt. Express 22, 24, 29465--29478.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, Elan Pavlov, Rebecca Allen and Pattie Maes. 2006. Eye-q: eyeglass peripheral display for subtle intimate notifications. In Proceedings of the 8th Conference on Humancomputer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, New York, NY, USA, 211-- 218.  ",
      "doi": "10.1145/1152215.1152261"
    },
    {
      "text": "Devanuj and Anirudha Joshi. 2013. Technology adoption by \"emergent\" users: the user-usage model. In Proceedings of the 11th Asia Pacific Conference on Computer Human Interaction (APCHI '13). ACM, New York, NY, USA, 28--38.  ",
      "doi": "10.1007/s00779-016-0982-0"
    },
    {
      "text": "1145/2525194.2525209. 10. Patricia Edmonds. 2015. The Colorful Language of Chameleons. http://ngm.nationalgeographic.com/2015/ 09/chameleons/edmonds-text.",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Tovi Grossman, Fraser Anderson, Justin Matejka and George Fitzmaurice. 2015. Candid interaction: revealing hidden mobile and wearable computing activities. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 467--476.  ",
      "doi": "10.1145/2807442.2807449"
    },
    {
      "text": "Majid Gharghi, Christopher Gladden, Thomas Zentgraf, Yongmin Liu, Xiaobo Yin, Jason Valentine and Xiang Zhang. 2011. A carpet cloak for visible light. Nano Letters 11, 7, 2825--2828.",
      "doi": ""
    },
    {
      "text": "Rebecca Hansson and Peter Ljungstrand. 2000. The reminder bracelet: subtle notification cues for mobile devices. In CHI '00 Extended Abstracts on Human Factors in Computing Systems (CHI EA '00). ACM, New York, NY, USA, 323--324.  ",
      "doi": "10.1145/633292.633488"
    },
    {
      "text": "Rebecca Hansson, Peter Ljungstrand and Johan Redström. 2001. Subtle and public notification cues for mobile devices. In Proceedings of the 3rd International Conference on Ubiquitous Computing (UbiComp '01). Springer-Verlag, London, UK, UK, 240--246. ",
      "doi": "10.5555/647987.741347"
    },
    {
      "text": "Richard Harper and Stuart Taylor. 2009. Glancephone: an exploration of human expression. In Proceedings of the 11th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, USA, 24:1--24:10.  ",
      "doi": "10.1145/1613858.1613890"
    },
    {
      "text": "Joyce Ho and Stephen S. Intille. 2005. Using contextaware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 909--918.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Eric Horvitz, Johnson Apacible and Muru Subramani. 2005. Balancing awareness and interruption: investigation of notification deferral policies. In Proceedings of the 10th International Conference on User Modeling (UM'05). Springer-Verlag, Berlin, Heidelberg, 433-- 437.  ",
      "doi": "10.1007/11527886_59"
    },
    {
      "text": "John C Howell and J Benjamin Howell. 2013. Simple, broadband, optical spatial cloaking of very large objects. Tech. rep. arXiv:1306.0863. https://cds.cern.ch/ record/1553460.",
      "doi": ""
    },
    {
      "text": "Giulio Iacucci, Kari Kuutti and Mervi Ranta. 2000. On the move with a magic thing: role playing in concept design of mobile services and devices. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '00). ACM, New York, NY, USA, 193--202.  ",
      "doi": "10.1145/347642.347715"
    },
    {
      "text": "H Ichikawa, M Oura and T Taoda. 2013. Invisibility cloaking based on geometrical optics for visible light. Journal of the European Optical Society-Rapid publications 8.",
      "doi": ""
    },
    {
      "text": "Masahiko Inami, Naoki Kawakami and Susumu Tachi. 2003. Optical camoufiage using retro-reflective projection technology. In Proceedings of the 2Nd IEEE/ACM International Symposium on Mixed and Augmented Reality (ISMAR '03). IEEE Computer Society, Washington, DC, USA, 348--. http://dl.acm.org/citation.cfm?id=946248.946825. ",
      "doi": "10.5555/946248.946825"
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and awareness: a field study of alert usage and preferences. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 27--30.  ",
      "doi": "10.1145/1718918.1718926"
    },
    {
      "text": "Hiroshi Ishii and Minoru Kobayashi. 1992. Clearboard: a seamless medium for shared drawing and conversation with eye contact. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, New York, NY, USA, 525--532.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Daisuke Iwai and Kosuke Sato. 2006. Limpid desk: see-through access to disorderly desktop in projectionbased mixed reality. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '06). ACM, New York, NY, USA, 112-- 115.  ",
      "doi": "10.1145/1180495.1180519"
    },
    {
      "text": "Mattias Jacobsson, Ylva Fernaeus and Stina Nylander. 2012. Mobile actdresses: programming mobile devices by accessorizing. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1071--1074.  ",
      "doi": "10.1145/2212776.2212388"
    },
    {
      "text": "Matt Jones, Simon Robinson, Jennifer Pearson, Manjiri Joshi, Dani Raju, Charity Chao Mbogo, Sharon Wangari, Anirudha Joshi, Edward Cutrell and Richard Harper. 2016. Beyond \"yesterday's tomorrow\": futurefocused mobile interaction design by and for emergent users. Personal and Ubiquitous Computing, 1--15.  ",
      "doi": "10.1007/s00779-016-0982-0"
    },
    {
      "text": "Oskar Juhlin and Yanqing Zhang. 2011. Unpacking social interaction that make us adore: on the aesthetics of mobile phones as fashion items. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 241--250.  ",
      "doi": "10.1145/2037373.2037410"
    },
    {
      "text": "Oskar Juhlin, Yanqing Zhang, Cristine Sundbom and Ylva Fernaeus. 2013. Fashionable shape switching: explorations in outfit-centric design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1353--1362.  ",
      "doi": "10.1145/2470654.2466178"
    },
    {
      "text": "Younghee Jung and Jan Chipchase. 2007. Nokia Open Studio: Engaging Communities. Tech. rep. Nokia Research. http://younghee.com/wp-content/uploads/2008/ 10/nokiaopenstudio_final_20081030.pdf.",
      "doi": ""
    },
    {
      "text": "Morvarid Kashanipour. 2011. \"Mobile Fashion\" Application. MA thesis. Stockholm University, Stockholm, Sweden: KTH, Royal Institute of Technology. http : / / www. diva - portal . se / smash / get / diva2 : 571546/FULLTEXT01.pdf.",
      "doi": ""
    },
    {
      "text": "Alexandra CN Kingston, Alan M Kuzirian, Roger T Hanlon and Thomas W Cronin. 2015. Visual phototransduction components in cephalopod chromatophores suggest dermal photoreception. Journal of Experimental Biology 218, 10, 1596--1602.",
      "doi": ""
    },
    {
      "text": "Alexander Koppelhuber and Oliver Bimber. 2013. Towards a transparent, flexible, scalable and disposable image sensor using thin-film luminescent concentrators. Optics express 21, 4, 4796--4810.",
      "doi": ""
    },
    {
      "text": "Seungyon \"Claire\" Lee and Thad Starner. 2010. Buzzwear: alert perception in wearable tactile displays on the wrist. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 433--442.  ",
      "doi": "10.1145/1753326.1753392"
    },
    {
      "text": "Jiannan Li, Saul Greenberg, Ehud Sharlin and Joaquim Jorge. 2014. Interactive two-sided transparent displays: designing for collaboration. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 395--404.  ",
      "doi": "10.1145/2598510.2598518"
    },
    {
      "text": "David Lindlbauer, Toru Aoki, Robert Walter, Yuji Uema, Anita Höchtl, Michael Haller, Masahiko Inami and Jörg Müller. 2014. Tracs: transparency-control for see-through displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 657--661.  ",
      "doi": "10.1145/2642918.2647350"
    },
    {
      "text": "David Lindlbauer, Klemen Lilija, Robert Walter and Jörg Müller. 2016. Influence of display transparency on background awareness and task performance. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1705--1716.  ",
      "doi": "10.1145/2858036.2858453"
    },
    {
      "text": "Andrés Lucero and Akos Vetek. 2014. Notifeye: using interactive glasses to deal with notifications while walking in public. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (ACE '14). ACM, New York, NY, USA, 17:1--17:10.  ",
      "doi": "10.1145/2663806.2663824"
    },
    {
      "text": "Jennifer Pearson, Simon Robinson and Matt Jones. 2015. It's about time: smartwatches as public displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1257--1266.  ",
      "doi": "10.1145/2702123.2702247"
    },
    {
      "text": "Martin Pielot, Karen Church and Rodrigo de Oliveira. 2014. An in-situ study of mobile phone notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 233--242.  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "M Desmond Ramirez and Todd H Oakley. 2015. Eyeindependent, light-activated chromatophore expansion (lace) and expression of phototransduction genes in the skin of octopus bimaculoides. Journal of Experimental Biology 218, 10, 1513--1520.",
      "doi": ""
    },
    {
      "text": "Simon Robinson, Matt Jones, Parisa Eslambolchilar, Roderick Murray-Smith and Mads Lindborg. 2010. \"i did it my way\": moving away from the tyranny of turnby-turn pedestrian navigation. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 341--344.  ",
      "doi": "10.1145/1851600.1851660"
    },
    {
      "text": "Thijs Roumen, Simon T. Perrault and Shengdong Zhao. 2015. Notiring: a comparative study of notification channels for wearable interactive rings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2497--2500.  ",
      "doi": "10.1145/2702123.2702350"
    },
    {
      "text": "Robert Schittny, Muamer Kadic, Tiemo Bückmann and Martin Wegener. 2014. Invisibility cloaking in a diffusive light scattering medium. Science.",
      "doi": ""
    },
    {
      "text": "Christina Medici Scolaro. 23 June 2015. Samsung tests trucks that you can see through. Found at: http: //www.cnbc.com/2015/06/23/samsung-tests-trucksthat-you-can-see-through.html.",
      "doi": ""
    },
    {
      "text": "Alexander L. Stubbs and Christopher W. Stubbs. 2016. Spectral discrimination in color blind animals via chromatic aberration and pupil shape. Proceedings of the National Academy of Sciences 113, 29, 8206--8211.",
      "doi": ""
    },
    {
      "text": "Jérémie Teyssier, Suzanne V Saenko, Dirk Van Der Marel and Michel C Milinkovitch. 2015. Photonic crystals cause active colour change in chameleons. Nature communications 6.",
      "doi": ""
    },
    {
      "text": "B. H. Thomas. 2002. Minimal social weight user interactions for wearable computers in business suits. In Proceedings of the 6th IEEE International Symposium on Wearable Computers (ISWC '02). IEEE Computer Society, Washington, DC, USA, 57--. http: //dl.acm.org/citation.cfm?id=862896.881088. ",
      "doi": "10.5555/862896.881088"
    },
    {
      "text": "Guoping Wang, Xuechen Chen, Sheng Liu, Chingping Wong and Sheng Chu. 2016. Mechanical chameleon through dynamic real-time plasmonic tuning. ACS Nano 10, 2, 1788--1794.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1991. The computer for the 21st century. Scientific american 265, 3, 94--104.",
      "doi": ""
    },
    {
      "text": "Susan P. Wyche, Thomas N. Smyth, Marshini Chetty, Paul M. Aoki and Rebecca E. Grinter. 2010. Deliberate interactions: characterizing technology use in Nairobi, Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2593--2602.  ",
      "doi": "10.1145/1753326.1753719"
    },
    {
      "text": "Takumi Yoshida, Kensei Jo, Kouta Minamizawa, Hideaki Nii, Naoki Kawakami and Susumu Tachi. 2007. Transparent cockpit. In ACM SIGGRAPH 2007 Emerging Technologies (SIGGRAPH '07). ACM, New York, NY, USA.  ",
      "doi": "10.1145/1278280.1278303"
    },
    {
      "text": "Cunjiang Yu, Yuhang Li, Xun Zhang, Xian Huang, Viktor Malyarchuk, Shuodao Wang, Yan Shi, Li Gao, Yewang Su, Yihui Zhang, Hangxun Xu, Roger T. Hanlon, Yonggang Huang and John A. Rogers. 2014. Adaptive optoelectronic camoufiage systems with designs inspired by cephalopod skins. Proceedings of the National Academy of Sciences of the United States of America 111, 36, 12998--13003.",
      "doi": ""
    },
    {
      "text": "Bin Zheng, Lian Shen, Zuozhu Liu, Huaping Wang, Xian-Min Zhang and Hongsheng Chen. 2014. A simple unidirectional optical invisibility cloak made of water. Progress In Electromagnetics Research 146, 1--5.",
      "doi": ""
    }
  ]
}