{
  "doi": "10.1145/3025453.3025472",
  "title": "Automated Detection of Facial Expressions during Computer-Assisted Instruction in Individuals on the Autism Spectrum",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6050-6055",
  "year": 2017,
  "badges": [],
  "abstract": "It has been suggested that computer-assisted instruction (CAI) is a promising method for educating students on the autism spectrum. We aimed to determine whether automated recognition of facial expressions aided in predicting CAI engagement and learning performance. Seven youth with autism (mean age = 12.7, SD = 4.2) interacted with a CAI program, TeachTown Basics, for 15 consecutive sessions. Video recordings of the participants' faces were collected during these sessions and facial expressions from these videos were analyzed using CERT, an algorithm that automatically outputs intensity values for each facial action unit (AU). Using these data, we attempted to operationally define two engagement indices: (1) behavioral engagement, the proportion of time a participant had their face oriented to the computer screen; and (2) emotional engagement, the activation of AUs previously associated with CAI. Our results suggest that both indices strongly correlated with one another, but that emotional (not behavioral) engagement predicted test performance. CAI knowledge domain, participant sex, and developmental age also contributed to the prediction.",
  "authors": [
    {
      "name": "Alex A. Ahmed",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261318",
      "orcid": "missing"
    },
    {
      "name": "Matthew S. Goodwin",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350573534",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hirotogu Akaike. 1998. Information Theory and an Extension of the Maximum Likelihood Principle. In Selected Papers of Hirotugu Akaike, Emanuel Parzen, Kunio Tanabe and Genshiro Kitagawa (eds.). Springer NY, NY, NY, 199--213.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. 2013. DSM 5. American Psychiatric Association.",
      "doi": ""
    },
    {
      "text": "Nigel Bosch, Sidney K D'Mello, Jaclyn Ocumpaugh, Ryan S Baker, and Valerie Shute. 2016. Using Video to Automatically Detect Learner Affect in ComputerEnabled Classrooms. Acm Transactions on Interactive Intelligent Systems 6, 2.  ",
      "doi": "10.1145/2946837"
    },
    {
      "text": "Christi Carnahan, Shobana Musti-Rao, and Jody Bailey. 2015. Promoting Active Engagement in Small Group Learning Experiences for Students with Autism and Significant Learning Needs. Education and Treatment of Children, 32, 1: 37--61.",
      "doi": ""
    },
    {
      "text": "Scotty D. Craig, Sidney D'Mello, Amy Witherspoon, and Art Graesser. 2008. Emote aloud during learning with AutoTutor: Applying the Facial Action Coding System to cognitive--affective states during learning. Cognition & Emotion 22, 5: 777--788.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace V. Friesen. 1978. Facial Action Coding System. Consulting Psychologists Press.",
      "doi": ""
    },
    {
      "text": "Joseph F. Grafsgaard, Joseph B. Wiggins, Kristy Elizabeth Boyer, Eric N. Wiebe, and James C. Lester. 2013. Automatically recognizing facial expression: Predicting engagement and frustration. International Conference on Educational Data Mining.",
      "doi": ""
    },
    {
      "text": "Ouriel Grynszpan, Patrice L. (Tamar) Weiss, Fernando Perez-Diaz, and Eynat Gal. 2014. Innovative technology-based interventions for autism spectrum disorders: A meta-analysis. Autism 18, 4: 346--361.",
      "doi": ""
    },
    {
      "text": "Curtis R. Henrie, Lisa R. Halverson, and Charles R. Graham. 2015. Measuring student engagement in technology-mediated learning: A review. Computers & Education 90: 36--53.  ",
      "doi": "10.1016/j.compedu.2015.09.005"
    },
    {
      "text": "Clifford M. Hurvich and Chih-Ling Tsai. 1989. Regression and time series model selection in small samples. Biometrika 76, 2: 297--307.",
      "doi": ""
    },
    {
      "text": "Michel Janosz. 2012. Part IV Commentary: Outcomes of Engagement and Engagement as an Outcome: Some Consensus, Divergences, and Unanswered Questions. In Handbook of Research on Student Engagement, L Sandra Christenson, L Amy Reschly and Cathy Wylie (eds.). Springer US, Boston, MA, 695--703.",
      "doi": ""
    },
    {
      "text": "Takeo Kanade, Jeffrey F. Cohn, and Yingli Tian. 2000. Comprehensive database for facial expression analysis. Proceedings Fourth IEEE International Conference on Automatic Face and Gesture Recognition (Cat. No. PR00580): 46--53. ",
      "doi": "10.5555/795661.796155"
    },
    {
      "text": "Connie Kasari, Nancy Brady, Catherine Lord, and Helen Tager-Flusberg. 2013. Assessing the minimally verbal school-aged child with autism spectrum disorder. Autism Research 6, 6: 479--493.",
      "doi": ""
    },
    {
      "text": "Jasna Legiša, Daniel S. Messinger, Enzo Kermol, and Luc Marlier. 2013. Emotional responses to odors in children with high-functioning autism: Autonomic arousal, facial behavior and self-report. Journal of Autism and Developmental Disorders 43, 4: 869--879.",
      "doi": ""
    },
    {
      "text": "James Jenn-Jier Lien, Takeo Kanade, Jeffrey F. Cohn, and Ching-Chung Li. 2000. Detection, Tracking, and Classification of Action Units in Facial Expression. Robotics and Autonomous Systems 31, 3: 131--146.",
      "doi": ""
    },
    {
      "text": "Gwen C. Littlewort, Marian Stewart Bartlett, and Kang Lee. 2009. Automatic coding of facial expressions displayed during posed and genuine pain. Image and Vision Computing 27, 12: 1797--1803.  ",
      "doi": "10.1016/j.imavis.2008.12.010"
    },
    {
      "text": "Gwen C. Littlewort, Jacob Whitehill, Tingfan Wu, et al. 2011. The computer expression recognition toolbox (CERT). IEEE International Conference on Automatic Face and Gesture Recognition and Workshops, FG 2011: 298--305.",
      "doi": ""
    },
    {
      "text": "Catherine Lord, Ann Wagner, Sally Rogers, et al. 2005. Challenges in Evaluating Psychosocial Interventions for Autistic Spectrum Disorders. Journal of Autism and Developmental Disorders 35, 6: 695--708.",
      "doi": ""
    },
    {
      "text": "Marc J. Mazerolle. 2016. AICcmodavg: Model selection and multimodel inference based on (Q)AIC(c). R package version 2.0--4. http://CRAN.Rproject.org/package=AICcmodavg.",
      "doi": ""
    },
    {
      "text": "David Moore and Jill Taylor. 2000. Interactive Multimedia Systems for Students with Autism. Journal of Educational Media 25, 3: 169--177.",
      "doi": ""
    },
    {
      "text": "Heather J. Nuske, Giacomo Vivanti, and Cheryl Dissanayake. 2013. Are emotion impairments unique to, universal, or specific in autism spectrum disorder? A comprehensive review. Cognition & Emotion 27, 6: 1042--1061.",
      "doi": ""
    },
    {
      "text": "Samuel L. Odom, Julie L. Thompson, Susan Hedges, et al. 2015. Technology-Aided Interventions and Instruction for Adolescents with Autism Spectrum Disorder. Journal of Autism and Developmental Disorders 45, 12: 3805--3819.",
      "doi": ""
    },
    {
      "text": "Robert C. Pennington. 2010. Computer-Assisted Instruction for Teaching Academic Skills to Students With Autism Spectrum Disorders: A Review of Literature. Focus on Autism and Other Developmental Disabilities 25, 4: 239--248.",
      "doi": ""
    },
    {
      "text": "Kathleen Ann Quill. 1995. Teaching Children with Autism: Strategies to Enhance Communication and Socialization. Delmar Publishers.",
      "doi": ""
    },
    {
      "text": "Sathiyaprakash Ramdoss, Wendy Machalicek, Mandy Rispoli, Austin Mulloy, Russell Lang, and Mark O'Reilly. 2012. Computer-based interventions to improve social and emotional skills in individuals with autism spectrum disorders: A systematic review. Developmental Neurorehabilitation 15, 2: 119--135.",
      "doi": ""
    },
    {
      "text": "Deborah M. Riby, Gwyneth Doherty-Sneddon, and Lisa Whittle. 2012. Face-to-face interference in typical and atypical development. Developmental Science 15, 2: 281--291.",
      "doi": ""
    },
    {
      "text": "Eric Schopler, Robert J. Reichler, and Barbara R. Renner. 1986. The childhood autism rating scale (CARS): for diagnostic screening and classification of autism. Irvington, NY.",
      "doi": ""
    },
    {
      "text": "Frederick Shic and Matthew S. Goodwin. 2015. Introduction to Technologies in the Daily Lives of Individuals with Autism. Journal of Autism and Developmental Disorders 45, 12: 3773--3776.",
      "doi": ""
    },
    {
      "text": "Karan Sikka, Alex A. Ahmed, Damaris Diaz, et al. 2015. Automated Assessment of Children's Postoperative Pain Using Computer Vision. Pediatrics 136, 1: 1--8.",
      "doi": ""
    },
    {
      "text": "Helen Tager-Flusberg, Daniela Plesa Skwerer, Robert M. Joseph, et al. 2016. Conducting research with minimally verbal participants with autism spectrum disorder. Autism: 1362361316654605.",
      "doi": ""
    },
    {
      "text": "Christina Whalen, et al. 2006. Positive behavioral changes associated with the use of computer-assisted instruction for young children. Journal of Speech and Language Pathology and Applied Behavior Analysis 1, 1: 11--26.",
      "doi": ""
    },
    {
      "text": "Christina Whalen, Debbie Moss, Aaron B. Ilan, et al. 2010. Efficacy of TeachTown: Basics computerassisted intervention for the Intensive Comprehensive Autism Program in Los Angeles Unified School District. Autism: the international journal of research and practice 14, 3: 179--197.",
      "doi": ""
    },
    {
      "text": "Jacob Whitehill, Zewelanji Serpell, Yi-Ching Yi-Ching Lin, Aysha Foster, and Javier R. Movellan. 2014. The Faces of Engagement: Automatic Recognition of Student Engagementfrom Facial Expressions. IEEE Transactions on Affective Computing 5, 1: 86--98.",
      "doi": ""
    }
  ]
}