{
  "doi": "10.1145/3025453.3025783",
  "title": "Efficient Typing on a Visually Occluded Physical Keyboard",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5457-5461",
  "year": 2017,
  "badges": [],
  "abstract": "The rise of affordable head-mounted displays (HMDs) has raised questions about how to best design user interfaces for this technology. This paper focuses on the use of HMDs for home and office applications that require substantial text input. A physical keyboard is a familiar and effective text input device in normal desktop computing. But without additional camera technology, an HMD occludes all visual feedback about a user's hand position over the keyboard. We describe a system that assists HMD users in typing on a physical keyboard. Our system has a virtual keyboard assistant that provides visual feedback inside the HMD about a user's actions on the physical keyboard. It also provides powerful automatic correction of typing errors by extending a state-of-the-art touchscreen decoder. In a study with 24 participants, we found our virtual keyboard assistant enabled users to type more accurately on a visually-occluded keyboard. We found users wearing an HMD could type at over 40 words-per-minute while obtaining an error rate of less than 5%.",
  "authors": [
    {
      "name": "James Walker",
      "institution": "Michigan Technological University, Houhgton, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81504683495",
      "orcid": "missing"
    },
    {
      "name": "Bochao Li",
      "institution": "Michigan Technological University, Houghton, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658629314",
      "orcid": "missing"
    },
    {
      "name": "Keith Vertanen",
      "institution": "Michigan Technological University, Houghton, MI, USA",
      "img": "/do/10.1145/contrib-81413602297/rel-imgonly/keith_cs.png",
      "acmid": "81413602297",
      "orcid": "missing"
    },
    {
      "name": "Scott Kuhl",
      "institution": "Michigan Technological University, Houghton, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153883",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bowman, D. A., Rhoton, C. J., and Pinho, M. S. Text input techniques for immersive virtual environments: An empirical comparison. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 46, 26 (2002), 2154--2158.",
      "doi": ""
    },
    {
      "text": "Budhiraja, P., Sodhi, R., Jones, B., Karsch, K., Bailey, B., and Forsyth, D. Where's my drink? Enabling peripheral real world interactions while using HMDs. arXiv preprint arXiv:1502.04744 (2015).",
      "doi": ""
    },
    {
      "text": "Lee, M., and Woo, W. ARKB: 3D vision-based augmented reality keyboard. In Proceeding of the 13th International Conference on Artificial Reality and Telexistence (2003).",
      "doi": ""
    },
    {
      "text": "McGill, M., Boland, D., Murray-Smith, R., and Brewster, S. A dose of reality: Overcoming usability challenges in VR head-mounted displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (New York, NY, USA, 2015), 2143--2152.  ",
      "doi": "10.1145/2702123.2702382"
    },
    {
      "text": "Vertanen, K., and Kristensson, P. O. A versatile dataset for text entry evaluations based on genuine mobile emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, MobileHCI '11, ACM (New York, NY, USA, 2011), 295--298.  ",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Vertanen, K., Memmi, H., Emge, J., Reyal, S., and Kristensson, P. O. VelociTap: Investigating fast mobile text entry using sentence-based decoding of touchscreen keyboard input. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, ACM (New York, NY, USA, 2015), 659--668.  ",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Walker, J., Kuhl, S., and Vertanen, K. Decoder-assisted typing using an HMD and a physical keyboard. In Extended Abstracts of the the ACM Conference on Human Factors in Computing Systems, CHI '16 workshop (New York, NY, USA, 2016).",
      "doi": ""
    },
    {
      "text": "Yi, X., Yu, C., Zhang, M., Gao, S., Sun, K., and Shi, Y. ATK: Enabling ten-finger freehand typing in air based on 3d hand tracking data. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, UIST '15, ACM (New York, NY, USA, 2015), 539--548.  ",
      "doi": "10.1145/2807442.2807504"
    }
  ]
}