{
  "doi": "10.1145/3025453.3025742",
  "title": "Implications for Adoption",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "265-277",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper we explore the motivations for, and practicalities of, incorporating \"implications for adoption\" into HCI research practice. Implications for adoption are speculations which may be used in research projects to scrutinize and explore the implications and requirements associated with a technology's potential adoption in the future. There is a rich tradition within the HCI community of implementing, demonstrating, and testing new interactions or technologies by building prototypes. User-centered design methods help us to develop prototypes to and move toward designs that are validated, efficient, and rewarding to use. However, these studies rarely shift their temporal focus to consider, in any significant detail, what it would mean for a technology to exist beyond its prototypical implementation, in other words how these prototypes might ultimately be adopted. Given the CHI community's increasing interest in technology-related human and social effects, the lack of attention paid to adoption represents a significant and relevant gap in current practices. It is this gap that the paper addresses and in doing so offers three contributions: (1) exploring and unpacking different notions of adoption from varying disciplinary perspectives; (2) discussing why considering adoption is relevant and useful, specifically in HCI research; (3) discussing methods for addressing this need, specifically design fiction, and understanding how utilizing these methods may provide researchers with means to better understand the myriad of nuanced, situated, and technologically-mediated relationships that innovative designs facilitate.",
  "tags": [
    "adoptability",
    "design fiction",
    "implications for adoption.",
    "prototyping"
  ],
  "authors": [
    {
      "name": "Joseph Lindley",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458634157",
      "orcid": "0000-0002-5527-3028"
    },
    {
      "name": "Paul Coulton",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81100461071/rel-imgonly/me.png",
      "acmid": "81100461071",
      "orcid": "missing"
    },
    {
      "name": "Miriam Sturdee",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-99658764620/rel-imgonly/99658764620.png",
      "acmid": "99658764620",
      "orcid": "0000-0002-8417-191X"
    }
  ],
  "references": [
    {
      "text": "Dennis A. Adams, R. Ryan Nelson, and Peter A. Todd. 1992. Perceived Usefulness , Ease of Use , and Usage of Information Technology?: A Replication. MIS Quarterly 16, 2: 227--247. http://doi.org/10.2307/249577  ",
      "doi": "10.2307/249577"
    },
    {
      "text": "Madeline Akrich. 1992. The De-scription of Technical Objects. In Shaping Technology/Building Society: Studies in Sociotechnical Change. The MIT Press, Cambridge, MA, 205--224.",
      "doi": ""
    },
    {
      "text": "Carla Alvial-Palavicino. 2016. The Future as Practice. A Framework to Understand Anticipation in Science and Technology. TECNOSCIENZA: Italian Journal of Science & Technology Studies 6, 2: 135--172.",
      "doi": ""
    },
    {
      "text": "James Auger. 2013. Speculative design: crafting the speculation. Digital Creativity 24, 1: 11--35. ",
      "doi": ""
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday's tomorrows: notes on ubiquitous computing's dominant vision. Personal and Ubiquitous Computing 11, 2: 133--143. http://doi.org/10.1007/s00779-006-0071-x  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Izak Benbasat and Henri Barki. 2007. Quo vadis, TAM Journal of the Association for Information Systems 8, 4: 211--218. http://doi.org/10.1586/erd.10.82 ",
      "doi": ""
    },
    {
      "text": "Alan Blackwell. 2015. Filling the big hole in HCI research. Interactions 22, 6: 37--4 http://doi.org/10.1145/2830317  ",
      "doi": "10.1145/2830317"
    },
    {
      "text": "Alan F Blackwell. 2015. HCI as an Inter-Discipline. Extended Abstracts of the ACM CHI'15 Conference on Human Factors in Computing Systems 2: 503--516. http://doi.org/10.1145/2702613.2732505",
      "doi": "10.1145/2702613.2732505"
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction. Near Future Laboratory.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2014. Research through design fiction. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, 703--712. http://doi.org/10.1145/2556288.2557098  ",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Mark Blythe and Enrique Encinas. 2016. The Co-ordinates of Design Fiction: Extrapolation, Irony, Ambiguity and Magic. Proc. GROUP'16: 345--354. http://doi.org/10.1145/2957276.2957299  ",
      "doi": "10.1145/2957276.2957299"
    },
    {
      "text": "Mark Blythe, Jamie Steane, Jenny Roe, and Caroline Oliver. 2015. Solutionism, the Game. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, ACM Press, 3849--3858. http://doi.org/10.1145/2702123.2702491  ",
      "doi": "10.1145/2702123.2702491"
    },
    {
      "text": "Mads Borup, Nick Brown, and Kornelia Konrad. 2006. The Sociology of Expectations in Science and Technology. Technology Analysis & Strategic Management 18, September: 285--298. ",
      "doi": ""
    },
    {
      "text": "Richard Buchanan. 1985. Declaration by Design: Rhetoric, Argument, and Demonstration in Design Practice. Design Issues, 2, 1: 4--22. ",
      "doi": ""
    },
    {
      "text": "Laura Buttrick and Conor Linehan. 2014. Fifty Shades of CHI?: The Perverse and Humiliating Human-Computer Relationship. 825--833. http://doi.org/10.1145/2559206.2578874",
      "doi": "10.1145/2559206.2578874"
    },
    {
      "text": "M. Callon, J. P. Courtial, and F. Laville. 1983. From translations to problematic networks: An introduction to co-word analysis. Social Science Information 22, 2: 191--235. ",
      "doi": ""
    },
    {
      "text": "Parmit K Chilana, Andrew J Ko, and Jacob Wobbrock. 2015. From User-Centered to Adoption-Centered Design. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15: 1749--1758. http://doi.org/10.1145/2702123.2702412",
      "doi": "10.1145/2702123.2702412"
    },
    {
      "text": "Paul Coulton, Dan Burnett, and Adrian Gradinar. 2016. Games as Speculative Design: Allowing Players to Consider Alternate Presents and Plausible Futures. Proceedings of the 50th Design Research Society Conference: 1--17.",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Joseph Lindley, and Haider Ali. 2016. Design Fiction: Does the search for plausibility lead to deception? Proceedings of DRS 2016, Design Research Society 50th Anniversary Conference.",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Joseph Lindley, Miriam Sturdee, and Michael Stead. 2017. Design Fiction as World Building. Proceedings of the 3nd Biennial Research Through Design Conference.",
      "doi": ""
    },
    {
      "text": "Aaron Crabtree, Alan Chamberlain, M Davies, et al. 2013. Doing Innovation in the Wild. Proceedings of the Biannual Conference of the Italian Chapter of SIGCHI: 1--9. http://doi.org/10.1145/2499149.2499150  ",
      "doi": "10.1145/2499149.2499150"
    },
    {
      "text": "Andrew Crabtree, Tom Rodden, Peter Tolmie, and Graham Button. 2009. Ethnography considered harmful. Proceedings of the 27th international conference on Human factors in computing systems - CHI 09, October 2015: 879. http://doi.org/10.1145/1518701.1518835  ",
      "doi": "10.1145/1518701.1518835"
    },
    {
      "text": "Nicholas S. Dalton, Rebecca Moreau, and Ross K. Adams. 2016. Resistance is Fertile: Design Fictions in Dystopian Worlds. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16: 365--374. http://doi.org/10.1145/2851581.2892572",
      "doi": "10.1145/2851581.2892572"
    },
    {
      "text": "Fred Davis, Richard Bagozzi, and Paul Warshaw. 1989. User Acceptance of Computer Technology: A Comparison of Two Theoretical Models. Management Science 35, 8: 982--1003.  ",
      "doi": "10.5555/70578.70583"
    },
    {
      "text": "Andrew Dillon and Michael G Morris. 1996. User Acceptance of Information Technology:Theories and Models. Annual Review of Information Science and Technology.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI '06: 541. http://doi.org/10.1145/1124772.1124855  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "James Duggan and Joseph Lindley. 2015. Sans Duty - Making Tax Visisble.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne. 2006. Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design. The MIT Press.",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything. The MIT Press, London.",
      "doi": ""
    },
    {
      "text": "Liz Edwards, Deborah Maxwell, Toby Pillatt, and Niamh Downing. 2016. Beebots-a-lula, Where's My Honey? Proceedings of the 9th Nordic Conference on Human-Computer Interaction - NordiCHI '16, ACM Press, 1--10. http://doi.org/10.1145/2971485.2993924",
      "doi": "10.1145/2971485.2993924"
    },
    {
      "text": "Enrique Encinas and Mark Blythe. 2016. The Solution Printer?: Magic Realist Design Fiction. CHI Extended Abstracts on Human Factors in Computing Systems, July 2015: 387--396.",
      "doi": "10.1145/2851581.2892589"
    },
    {
      "text": "M Fishbein and I Ajzen. 1975. ZEN, Belief, Attitude, Intention and Behavior: An Introduction to Theory and Research. Addison-Wesley, Reading, MA.",
      "doi": ""
    },
    {
      "text": "Foley, Jim. 1996. Technology Transfer from University to Industry. Communications of the ACM 39, 9. http://doi.org/10.1145/514236.514264  ",
      "doi": "10.1145/514236.514264"
    },
    {
      "text": "Bill Gaver and Heather Martin. 2000. Alternatives. Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '00, ACM Press, 209--216. http://doi.org/10.1145/332040.332433",
      "doi": "10.1145/332040.332433"
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability evaluation considered harmful (some of the time). Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08: 111. http://doi.org/10.1145/1357054.1357074",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Felix Heibeck, Alexis Hope, and Julie Legault. 2014. Sensory Fiction?: A Design Fiction of Emotional Computation. 35--40.",
      "doi": ""
    },
    {
      "text": "Ellen A Isaacs and John C Tang. 1996. Technology transfer: so much research, so few good products. Communications of the ACM 39, 9: 23--25. http://doi.org/10.1145/234215.234463  ",
      "doi": "10.1145/234215.234463"
    },
    {
      "text": "H. Järvenpää and S. J. Mäkinen. 2008. Empirically detecting the Hype Cycle with the life cycle indicators: An exploratory analysis of three technologies. 2008 IEEE International Conference on Industrial Engineering and Engineering Management, IEEM 2008: 12--16. http://doi.org/10.1109/IEEM.2008.4737823 ",
      "doi": ""
    },
    {
      "text": "D. Kirby. 2010. The Future is Now: Diegetic Prototypes and the Role of Popular Films in Generating Real-world Technological Development. Social Studies of Science 40, 1: 41--70. http://doi.org/10.1177/0306312709338325 ",
      "doi": ""
    },
    {
      "text": "Ben Kirman, Conor Linehan, Shaun Lawson, and Dan O'Hara. 2013. CHI and the future robot enslavement of humankind: a retrospective. CHI '13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA '13: 2199. http://doi.org/10.1145/2468356.2468740",
      "doi": "10.1145/2468356.2468740"
    },
    {
      "text": "Ronald Kline and Trevor Pinch. 1996. Users as Agents of Technological Change: The Social Construction of the Automobile in the Rural United States. Technology and Culture 37, 4: 763. http://doi.org/10.2307/3107097",
      "doi": ""
    },
    {
      "text": "Vassilis Kostakos. 2015. The big hole in HCI research. interactions 22, 2: 48--51. http://doi.org/10.1145/2729103",
      "doi": "10.1145/2729103"
    },
    {
      "text": "Shaun Lawson, Ben Kirman, Conor Linehan, et al. 2015. Problematising Upstream Technology through Speculative Design: The Case of Quantified Cats and Dogs. 2663--2672.",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Ben Kirman, and Conor Linehan. 2016. Power, participation, and the dog internet. interactions 23, 4: 37--41. http://doi.org/10.1145/2942442",
      "doi": "10.1145/2942442"
    },
    {
      "text": "Paul Legris, John Ingham, and Pierre Collerette. 2003. Why do people use information technology? A critical review of the technology acceptance model. Information & Management 40, 3: 191--204. http://doi.org/10.1016/S0378--7206(01)00143--4",
      "doi": ""
    },
    {
      "text": "Harro Van Lente, Charlotte Spitters, and Alexander Peine. 2013. Comparing technological hype cycles: Towards a theory. Technological Forecasting and Social Change 80, 8: 1615--1628. http://doi.org/10.1016/j.techfore.2012.12.004 ",
      "doi": ""
    },
    {
      "text": "Chien-Hsin Lin, Hsin-Yu Shih, and Peter J. Sher. 2007. Integrating technology readiness into technology acceptance: The TRAM model. Psychology and Marketing 24, 7: 641--657. http://doi.org/10.1002/mar.20177 ",
      "doi": ""
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Game of Drones. Proceedings of the second ACM SIGCHI annual symposium on Computer-human interaction in play.  ",
      "doi": "10.1145/2793107.2810300"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2016. Pushing the Limits of Design Fiction. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 4032--4043. http://doi.org/10.1145/2858036.2858446  ",
      "doi": "10.1145/2858036.2858446"
    },
    {
      "text": "Conor Linehan, Ben J. Kirman, Stuart Reeves, et al. 2014. Alternate endings. Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14, ACM Press, 45--48. http://doi.org/10.1145/2559206.2560472  ",
      "doi": "10.1145/2559206.2560472"
    },
    {
      "text": "Yong Liu, Jorge Goncalves, Denzil Ferreira, Bei Xiao, Simo Hosio, and Vassilis Kostakos. 2014. CHI 1994--2013: mapping two decades of intellectual progress through co-word analysis. CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3553--3562. http://doi.org/10.1145/2556288.2556969",
      "doi": "10.1145/2556288.2556969"
    },
    {
      "text": "Wendy E Mackay. 2000. Responding to cognitive overload?: Co-adaptation between users and technology. Intellectica 30: 177--193.",
      "doi": ""
    },
    {
      "text": "Thomas Markussen and Eva Knutz. 2013. The poetics of design fiction. Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces - DPPI '13: 231.  ",
      "doi": "10.1145/2513506.2513531"
    },
    {
      "text": "Eran May-Raz and Daniel Lazo. 2012. Sight. Retrieved October 27, 2014 from http://vimeo.com/46304267",
      "doi": ""
    },
    {
      "text": "Donald a. Norman. 2005. Human-centered design considered harmful. interactions 12, 4: 14. http://doi.org/10.1145/1070960.1070976",
      "doi": "10.1145/1070960.1070976"
    },
    {
      "text": "Donald A Norman and Roberto Verganti. 2014. Incremental and Radical Innovation: Design Research vs. Technology and Meaning Change. 30, 1. http://doi.org/10.1162/DESI",
      "doi": ""
    },
    {
      "text": "William Odom, Ron Wakkary, Youn-kyung Lim, Audrey Desjardins, Bart Hengeveld, and Richard Banks. 2016. From Research Prototype to Research Product. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16: 2549--2561. http://doi.org/10.1145/2858036.2858447  ",
      "doi": "10.1145/2858036.2858447"
    },
    {
      "text": "Nelly Oudshoorn and Trevor Pinch. 2003. How Users Matter: The Co-Construction of Users and Technology. The MIT Press, Cambridge, MA.",
      "doi": "10.5555/1044860"
    },
    {
      "text": "Garry D Peterson, Graeme S Cumming, and Stephen R Carpenter. 2003. Scenario Planning: a Tool for Conservation in an Uncertain World. Essay 358 Conservation Biology Conservation Biology 17, 2: 358--366. http://doi.org/10.1046/j.1523--1739.2003.01491.x",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2015. Making Multiple Uses of the Obscura 1C Digital Camera: Reflecting on the Design, Production, Packaging and Distribution of a Counterfunctional Device. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems: 2103--2112. http://doi.org/10.1145/2702123.2702405  ",
      "doi": "10.1145/2702123.2702405"
    },
    {
      "text": "Trevor J Pinch and Wiebe E Bijker. 1984. The Social Construction of Facts and Artefacts: or How the Sociology of Science and the Sociology of Technology might Benefit Each Other. Social Studies of Science 14, 3: 399--441. http://doi.org/10.1177/030631284014003004 ",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2015. Locating the -- Big Hole -- in Hci. August: 1--8.",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2015. Human-computer interaction as science. 5th Annunal Aarhus Conference on Critical Alternatives. http://doi.org/10.7146/aahcc.v1i1.21296  ",
      "doi": "10.7146/aahcc.v1i1.21296"
    },
    {
      "text": "Ahti Salo and Kerstin Cuhls. 2003. Technology foresight - Past and Future. Journal of Forecasting 22, 2--3: 79--82. http://doi.org/10.1002/for.846",
      "doi": ""
    },
    {
      "text": "Ahti Salo, Tommi Gustafsson, and Ramakrishnan Ramanathan. 2003. Multicriteria Methods for Techonology Foresight. Journal of Forecasting 22: 235--255. http://doi.org/10.1002/for.850 ",
      "doi": ""
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, ACM Press, 1971--1980. http://doi.org/10.1145/2556288.2557357  ",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Paul J H Schoemaker. 1995. Scenario Planning: A tool for Strategic Thinking. Sloan Management Review 36, 2: 25--40.",
      "doi": ""
    },
    {
      "text": "Albert H Segars and Varun Grover. 1993. Re-examining perceived ease of use and usefulness. MIS Quarterly 17, 4: 517--525.  ",
      "doi": "10.2307/249590"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective Design. Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility: 49--58. http://doi.org/10.1145/1094562.1094569",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Roger Silverstone. 2006. Domesticating domestication. Reflecting on the life of a concept. In Domestication Of Media And Technology, Thomas Berker, Maren Hartmann, Yves Punie and Katie Ward (eds.). Open University Press, 229--247.",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2016. PeriodShare. Proceedings of the 9th Nordic Conference on Human-Computer Interaction - NordiCHI '16, ACM Press, 1--6. http://doi.org/10.1145/2971485.2996748",
      "doi": "10.1145/2971485.2996748"
    },
    {
      "text": "Michael Stead. 2016. A Toaster For Life?: Using Design Fiction To Facilitate Discussion On The Creation Of A Sustainable Internet of Things. Proceedings of DRS 2016, Design Research Society 50th Anniversary Conference: 1--20.",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2005. Shaping Things. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Miriam Sturdee, Paul Coulton, Joseph G. Lindley, Mike Stead, Haider Ali, and Andy Hudson-Smith. 2016. Research Fiction: How to Build a Voight Kampff Machine. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16, ACM Press, 375--386. http://doi.org/10.1145/2851581.2892574",
      "doi": "10.1145/2851581.2892574"
    },
    {
      "text": "Lucy Suchman. 1987. Plans and situated actions: the problem of human-machine communication. Cambridge University Press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Superflux. Uninvited Guests. Retrieved September 17, 2015 from http://www.superflux.in/work/uninvited-guests",
      "doi": ""
    },
    {
      "text": "Stuart Walker. 2013. Imagination's Promise: Practice-Based Design, Research for Sustainability. In The Handbook for Design Sustainability, Stuart Walker and Jacques Giard (eds.). Bloomsbury, London & New York, 460--461.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1999. The computer for the 21 st century. ACM SIGMOBILE Mobile Computing and Communications Review 3, 3: 3--11. http://doi.org/10.1145/329124.329126  ",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Richmond Y Wong and Deirdre K Mulligan. 2016. When a Product Is Still Fictional?: Anticipating and Speculating Futures through Concept Videos. 121--133.",
      "doi": ""
    },
    {
      "text": "S Woolgar. 1991. Configuring the user: The case of usability trials. In A Sociology of Monsters, John Law (ed.). Routledge.",
      "doi": ""
    },
    {
      "text": "Richard M. Young and Phil Barnard. 1987. The use of scenarios in human-computer interaction research. ACM SIGCHI Bulletin 18, 4: 291--296. http://doi.org/10.1145/1165387.275645  ",
      "doi": "10.1145/1165387.275645"
    }
  ]
}