{
  "doi": "10.1145/3025453.3025609",
  "title": "Gender-Inclusiveness Personas vs. Stereotyping: Can We Have it Both Ways?",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6658-6671",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Personas often aim to improve product designers' ability to \"see through the eyes of\" target users through the empathy personas can inspire - but personas are also known to promote stereotyping. This tension can be particularly problematic when personas (who, of course as \"people\" have genders) are used to promote gender inclusiveness - because reinforcing stereotypical perceptions can run counter to gender inclusiveness. In this paper we explicitly investigate this tension through a new approach to personas: one that includes multiple photos (of males and females) for a single persona. We compared this approach to an identical persona with only one photo using a controlled laboratory study and an eye-tracking study. Our goal was to answer the following question: is it possible for personas to encourage product designers to engage with personas while at the same avoiding promoting gender stereotyping? Our results are encouraging about the use of personas with multiple pictures as a way to expand participants' consideration of multiple genders without reducing their engagement with the persona.",
  "authors": [
    {
      "name": "Charles G. Hill",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658973334",
      "orcid": "missing"
    },
    {
      "name": "Maren Haag",
      "institution": "Heilbronn University, Heilbronn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019563",
      "orcid": "missing"
    },
    {
      "name": "Alannah Oleson",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/do/10.1145/contrib-99659020818/rel-imgonly/avi_new_sq.jpg",
      "acmid": "99659020818",
      "orcid": "missing"
    },
    {
      "name": "Chris Mendez",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021291",
      "orcid": "missing"
    },
    {
      "name": "Nicola Marsden",
      "institution": "Heilbronn University, Heilbronn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414621160",
      "orcid": "missing"
    },
    {
      "name": "Anita Sarma",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143799",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tamara Adlin and John Pruitt. 2010. The Essential Persona Lifecycle: Your Guide to Building and Using Personas. Morgan Kaufmann/Elsevier, San Francisco, CA. ",
      "doi": "10.5555/1859509"
    },
    {
      "text": "Frank Asbrock. 2010. Stereotypes of social groups in Germany in terms of warmth and competence. Social Psychology 41, 2: 76--81.",
      "doi": ""
    },
    {
      "text": "John A. Bargh. 2013. Social psychology and the unconscious: The automaticity of higher mental processes. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Manuela Barreto, Naomi Ellemers. 2015. Detecting and Experiencing Prejudice: New Answers to Old Questions. Advances in Experimental Social Psychology 52: 139--219.",
      "doi": ""
    },
    {
      "text": "Laura Beckwith, Margaret Burnett, Susan Wiedenbeck, Curtis Cook, Shraddha Sorte, and Michelle Hastings. 2005. Effectiveness of end-user debugging software features: Are there gender issues? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 869--878.  ",
      "doi": "10.1145/1054972.1055094"
    },
    {
      "text": "Laura Beckwith, Cory Kissinger, Margaret Burnett, Susan Wiedenbeck, Joseph Lawrance, Alan Blackwell, and Curtis Cook. 2006. Tinkering and gender in enduser programmers' debugging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 231--240.  ",
      "doi": "10.1145/1124772.1124808"
    },
    {
      "text": "Sandra L. Bem. 1981. Bem Sex-Role Inventory: Professional Manual. Consulting Psychologists Press, Palo Alto, CA.",
      "doi": ""
    },
    {
      "text": "Marilynn B. Brewer. 1988. A dual process model of impression formation. In Advances in Social Cognition (Vol. 1), Thomas K. Srull and Robert S. Wyer (eds.). Psychology Press, NY, 1--36.",
      "doi": ""
    },
    {
      "text": "Margaret Burnett, Laura Beckwith, Susan Wiedenbeck, Scott D. Fleming, Jill Cao, Thomas H. Park, Valentina Grigoreanu, and Kyle Rector. 2011. Gender pluralism in problem-solving software. Interacting with Computers 23, 5: 450--460.  ",
      "doi": "10.1016/j.intcom.2011.06.004"
    },
    {
      "text": "Margaret Burnett, Simone Stumpf, Jamie Macbeth, Stephann Makri, Laura Beckwith, Irwin Kwan, Anicia Peters, and William Jernigan. 2016. GenderMag: A method for evaluating software's gender inclusiveness. Interacting with Computers, online January 2016.",
      "doi": ""
    },
    {
      "text": "Margaret Burnett, Anicia Peters, Charles Hill, and Noha Elarief. 2016. Finding gender inclusiveness software issues with GenderMag: A field investigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 2586--2598.  ",
      "doi": "10.1145/2858036.2858274"
    },
    {
      "text": "Margaret Burnett, Scott D. Fleming, Shamsi Iqbal, Gina Venolia, Viyda Rajaram, Umer Farooq, Valentina Grigoreanu, and Mary Czerwinski. 2010. Gender differences and programming environments: Across programming populations. In Proceedings of the 2010 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '10), 28.  ",
      "doi": "10.1145/1852786.1852824"
    },
    {
      "text": "Patricia Cafferata and Alice M. Tybout. 1989. Gender Differences in Information Processing: A Selectivity Interpretation, Cognitive and Affective Responses to Advertising. Lexington Books.",
      "doi": ""
    },
    {
      "text": "Jill Cao, Kyle Rector, Thomas H. Park, Scott D. Fleming, Margaret Burnett, and Susan Wiedenbeck. 2010. A debugging perspective on end-user mashup programming. In Proceedings of IEEE Symposium on Visual Languages and Human-Centric Computing (IEEE '10), 149--156.  ",
      "doi": "10.1109/VLHCC.2010.29"
    },
    {
      "text": "J. Cassell. 2002. Genderizing HCI. In The Handbook of Human-Computer Interaction, M.G. Helander, T.K. Landauer, and P.V. Prabhu (eds.). L. Erlbaum Associates Inc., Hillsdale, NJ, 402--411.",
      "doi": ""
    },
    {
      "text": "Shou Chang, Vikas Kumar, Eric Gilbert, and Loren Terveen. 2014. Specialization, homophily, and gender in a social curation site: findings from Pinterest. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14), 674--686.  ",
      "doi": "10.1145/2531602.2531660"
    },
    {
      "text": "Christopher N. Chapman and Russell Milham. 2006. The personas' new clothes: methodological and practical arguments against a popular method. Human Factors and Ergonomics Society Annual Meeting 50: 634637.",
      "doi": ""
    },
    {
      "text": "Gary Charness and Uri Gneezy. 2012. Strong evidence for gender differences in risk taking. Journal of Economic Behavior & Organization 83, 1: 50--58.",
      "doi": ""
    },
    {
      "text": "Andrew Colman, Claire Norris, and Carolyn Preston. 1997. Comparing rating scales of different lengths: Equivalence of scores from 5-point and 7-point scales. Psychological Reports 80: 355--362.",
      "doi": ""
    },
    {
      "text": "Alan Cooper. 2004. The Inmates Are Running the Asylum. Sams Publishing. ",
      "doi": "10.5555/553473"
    },
    {
      "text": "Constantinos K. Coursaris, Sarah J. Swierenga, and Ethan Watrall. 2008. An empirical investigation of color temperature and gender effects on web aesthetics. Journal of Usability Studies 3, 3: 103--117. ",
      "doi": "10.5555/2835567.2835569"
    },
    {
      "text": "Amy Cuddy, Susan Fiske, and Peter Glick. 2008. Warmth and competence as universal dimensions of social perception: The stereotype content model and the BIAS map. Advances in Experimental Social Psychology 40: 61--149.",
      "doi": ""
    },
    {
      "text": "Amy Cuddy, Susan Fiske, Virginia Kwan, Peter Glick, Stephanie Demoulin, Jacques-Philippe Leyens, et al. 2009. Stereotype content model across cultures: Towards universal similarities and some differences. British Journal of Social Psychology 48, 1: 1--33.",
      "doi": ""
    },
    {
      "text": "Soussan Djamasbi, Marisa Siegel, and Tom S. Tullis. 2012. Faces and viewing behavior: An exploratory investigation. AIS Transactions on Human-Computer Interaction 4, 3: 190--211.",
      "doi": ""
    },
    {
      "text": "Kristin Donnelly and Jean M. Twenge. 2016. Masculine and feminine traits on the Bem sex-role inventory, 1993--2012: A cross-temporal meta-analysis. Sex Roles: 1--10.",
      "doi": ""
    },
    {
      "text": "Thomas Dohmen, Armin Falk, David Huffman, Uwe Sunde, Jürgen Schupp, and Gert G. Wagner. 2011. Individual risk attitudes: Measurement, determinants, and behavioral consequences. Journal of the European Economic Association 9, 3: 522--550.",
      "doi": ""
    },
    {
      "text": "Alan Durndell and Zsolt Haag. 2002. Computer self efficacy, computer anxiety, attitudes towards the Internet and reported experience with the Internet, by gender, in an East European sample. Computers in Human Behavior 18, 5: 521--535.",
      "doi": ""
    },
    {
      "text": "Joel U. Eden. 2007. Distributed cognitive walkthrough (DCW): a walkthrough-style usability evaluation method based on theories of distributed cognition. In Proceedings of the 6th ACM SIGCHI conference on Creativity & cognition (C&C '07), 283--283  ",
      "doi": "10.1145/1254960.1255019"
    },
    {
      "text": "Will Evans. 2012. Eye-tracking online metacognition: cognitive complexity and recruiter decisionmaking. Retrieved September 9, 2015 from http://cdn.theladders.net/static/images/basicSite/pdfs/TheLadders-EyeTracking-StudyC2.pdf",
      "doi": ""
    },
    {
      "text": "Susan Fiske. 2000. Stereotyping, prejudice, and discrimination at the seam between the centuries: Evolution, culture, mind, and brain. European Journal of Social Psychology 30, 3: 299--322.",
      "doi": ""
    },
    {
      "text": "Susan Fiske. 2015. Intergroup biases: a focus on stereotype content. Current Opinion in Behavioral Sciences 3: 45--50.",
      "doi": ""
    },
    {
      "text": "Susan Fiske, Amy Cuddy, and Peter Glick. 2007. Universal dimensions of social cognition: Warmth and competence. Trends in Cognitive Sciences, 11, 2: 7783.",
      "doi": ""
    },
    {
      "text": "Susan Fiske, Amy Cuddy, Peter Glick, and Jun Xu. 2002. A model of (often mixed) stereotype content: competence and warmth respectively follow from perceived status and competition. Journal of Personality and Social Psychology 82, 6: 878--902.",
      "doi": ""
    },
    {
      "text": "Erin Friess. 2012. Personas and decision making in the design process: an ethnographic case study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1209--1218.  ",
      "doi": "10.1145/2207676.2208572"
    },
    {
      "text": "Kim Goodwin. 2009. Designing for the Digital Age: How to Create Human-Centered Products and Services. Wiley, Indianapolis, IN. ",
      "doi": "10.5555/1550878"
    },
    {
      "text": "Toni Granollers and J. Lorés. 2004. Incorporation of users in the evaluation of usability by cognitive walkthrough. In HCI Related Papers of Interacción. 243--255.",
      "doi": ""
    },
    {
      "text": "Anthony G Greenwald and Mahzarin R Banaji. 1995. Implicit social cognition: attitudes, self-esteem, and stereotypes. Psychological review 102, 1: 4.",
      "doi": ""
    },
    {
      "text": "Anthony G. Greenwald, T. Andrew Poehlman, Eric Luis Uhlmann, and Mahzarin R. Banaji. 2009. Understanding and using the Implicit Association Test: III. Meta-analysis of predictive validity. Journal of Personality and Social Psychology 97, 1: 17--41.",
      "doi": ""
    },
    {
      "text": "Valentina Grigoreanu and Manal Mohanna. 2013. Informal cognitive walkthroughs (ICW): paring down and pairing up for an agile world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3093--3096.  ",
      "doi": "10.1145/2470654.2466421"
    },
    {
      "text": "Jonathan Grudin. 2006. Why personas work: The psychological evidence. In The Persona LifeCycle: Keeping People in Mind Throughout Product Design, John Pruitt and Tamara Adlin (aut). Morgan Kaufmann Publishers.",
      "doi": ""
    },
    {
      "text": "Jonas Hallström, Helene Elvstrand, and Kristina Hellberg. 2015. Gender and technology in free play in Swedish early childhood education. International Journal of Technology and Design Education 25, 2: 137--149.",
      "doi": ""
    },
    {
      "text": "Kathleen Hartzel. 2003. How self-efficacy and gender issues affect software adoption and use. Communications of the ACM -- Why CS students need math 46, 9: 167--171.  ",
      "doi": "10.1145/903893.903933"
    },
    {
      "text": "E. Tory Higgins. 1996. Knowledge activation: Accessibility, applicability, and salience. In Social Psychology: Handbook of Basic Principles, Guilford Press, NY, 133--168.",
      "doi": ""
    },
    {
      "text": "Charles Hill, Shannon Ernst, Alannah Oleson, Amber Horvath and Margaret Burnett. 2016. GenderMag Experiences in the Field: The Whole, the Parts, and the Workload. In Proceedings of the IEEE Symposium on Visual Languages and Human-centric Computing (IEEE '16).",
      "doi": ""
    },
    {
      "text": "Karen Holtzblatt, Jessamyn B. Wendell, and Shelley Wood. 2004. Rapid Contextual design: A How-to Guide to Key Techniques for User-Centered Design. Morgan Kaufmann, San Francisco, CA. ",
      "doi": "10.5555/2891404"
    },
    {
      "text": "Weimin Hou, Manpreet Kaur, Anita Komlodi, Wayne G. Lutters, Lee Boot, Shelia R. Cotten, Claudia Morrell, A. Ant Ozok, and Zeynep Tufekci. 2006. Girls don't waste time: Pre-adolescent attitudes toward ICT. In Proceedings of the CHI EA Conference on Human Factors in Computing Systems (CHI '06), 875--880.  ",
      "doi": "10.1145/1125451.1125622"
    },
    {
      "text": "Ann H. Huffman, Jason Whetten, William H. Huffman. 2013. Using technology in higher education: The influence of gender roles on technology self-efficacy. Computers in Human Behavior 29, 4: 1779--1786.",
      "doi": ""
    },
    {
      "text": "Tejinder K. Judge, Tara Matthews, and Steve Whittaker. 2012. Comparing collaboration and individual personas for the design and evaluation of collaboration software. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1997--2000.  ",
      "doi": "10.1145/2207676.2208344"
    },
    {
      "text": "Caitlin Kelleher. 2009. Barriers to programming engagement. Advances in Gender and Education 1, 1: 510.",
      "doi": ""
    },
    {
      "text": "Mary E. Kite, Kay Deaux, and Elizabeth L. Haines. 2008. Gender stereotypes. In Psychology of women: A handbook of issues and theories (2nd ed.), Florence L. Denmark and Michele A. Paludi (eds.). Greenwood Publishing Group, 205--236.",
      "doi": ""
    },
    {
      "text": "J. Richard Landis and Gary G. Koch. 1977. The measurement of observer agreement for categorical data. Biometrics 33, 1: 159--174.",
      "doi": ""
    },
    {
      "text": "Clayton Lewis, Peter G. Polson, Cathleen Wharton, and John Rieman. 1990. Testing a walkthrough methodology for theory-based design of walk-up-and-use interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90), 235--242.  ",
      "doi": "10.1145/97243.97279"
    },
    {
      "text": "Thomas Mahatody, Mouldi Sagar, and Christophe Kolski. 2010. State of the art on the cognitive walkthrough method, its variants and evolutions. International Journal of Human-Computer Interaction 26, 8: 741--85.",
      "doi": ""
    },
    {
      "text": "Jane Margolis and Allan Fisher. 2003. Unlocking the Clubhouse: Women in Computing. MIT Press.",
      "doi": ""
    },
    {
      "text": "Nicola Marsden and Maren Haag. 2016. Stereotypes and politics: reflections on personas. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4017--4031.  ",
      "doi": "10.1145/2858036.2858151"
    },
    {
      "text": "Nicola Marsden and Maren Haag. 2016. Evaluation of gendermag personas based on persona attributes and persona gender. In HCI International 2016 -- Posters' Extended Abstracts: 18th International Conference, HCI International 2016, Toronto, Canada, July 17--22, 2016, Proceedings, Part I, Constantine Stephanidis (Ed.). Cham: Springer International Publishing, 122127.",
      "doi": ""
    },
    {
      "text": "Nicola Marsden, Jasmin Link, and Elisabeth Buff llesfeld. 2015. Geschlechterstereotype in PersonaBeschreibungen. In Mensch und Computer 2015 Tagungsband, Sarah Diefenbach, Niels Henze and Martin Pielot (eds.), Stuttgart: Oldenbourg Wissenschaftsverlag, 113--122.",
      "doi": ""
    },
    {
      "text": "Adrienne L. Massanari. 2010. Designing for imaginary friends: information architecture, personas, and the politics of user-centered design. New Media & Society 12, 3: 401--416.",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Tejinder Judge, and Steve Whittaker. 2012. How do designers and user experience professionals actually perceive and use personas? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1219--1228.  ",
      "doi": "10.1145/2207676.2208573"
    },
    {
      "text": "Philipp Mayring. 2014. Qualitative content analysis: theoretical foundation, basic procedures and software solution. Beltz, Klagenfurg.",
      "doi": ""
    },
    {
      "text": "Joan Meyers-Levy and Barbara Loken. 2015. Revisiting gender differences: What we know and what lies ahead. Journal of Consumer Psychology 25, 1: 129149.",
      "doi": ""
    },
    {
      "text": "Joan Meyers-Levy and Durairaj Maheswaran. 1991. Exploring differences in males' and females' processing strategies. Journal of Consumer Research 18, 1: 63--70.",
      "doi": ""
    },
    {
      "text": "Lene Nielsen and Kira S. Hansen. 2014. Personas is applicable: a study on the use of personas in Denmark. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1665--1674.  ",
      "doi": "10.1145/2556288.2557080"
    },
    {
      "text": "Lene Nielsen, Kira S. Hansen, Jan Stage, and Jane Billestrup. 2015. A Template for Design Personas: Analysis of 47 Persona Descriptions from Danish Industries and Organizations. International Journal of Sociotechnology and Knowledge Development 7, 1: 4561.  ",
      "doi": "10.4018/ijskd.2015010104"
    },
    {
      "text": "Anne O'Leary-Kelly, Bill Hardgrave, Vicki McKinney, and Darryl Wilson. 2004. The influence of professional identification on the retention of women and racial minorities in the IT workforce. In NSF Info. Tech. Workforce & Info. Tech. Res. PI Conf.: 65--69.",
      "doi": ""
    },
    {
      "text": "Piazza Blog. 2015. STEM confidence gap. Retrieved September 24th, 2015 from http://blog.piazza.com/stem-confidence-gap/",
      "doi": ""
    },
    {
      "text": "John Pruitt and Jonathan Grudin. 2003. Personas: practice and theory. In Proceedings of the 2003 conference on Designing for user experiences (DUX '03), 1--15.  ",
      "doi": "10.1145/997078.997089"
    },
    {
      "text": "René Riedl, Marco Hubert, and Peter Kenning. 2010. Are there neural gender differences in online trust? An fMRI study on the perceived trustworthiness of EBay offers. MIS Quarterly 34, 2: 397--428. ",
      "doi": "10.5555/2017458.2017469"
    },
    {
      "text": "Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA hacking: I'm not one to decoupage a tabletop and call it a day. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 419--422.  ",
      "doi": "10.1145/1518701.1518768"
    },
    {
      "text": "Hokyoung Ryu and Andrew F. Monk. 2004. Analysing interaction problems with cyclic interaction theory: Low-level interaction walkthrough. Psychology Journal 2, 3: 304--330.",
      "doi": ""
    },
    {
      "text": "Andrew Sears. 1997. Heuristic walkthroughs: finding the problems without the noise. International Journal of Human-Computer Interaction 9, 3: 213--234.",
      "doi": ""
    },
    {
      "text": "Steven J. Simon. 2001. The impact of culture and gender on web sites: an empirical study. The Data Base for Advances in Information Systems 32, 1: 18--37.  ",
      "doi": "10.1145/506740.506744"
    },
    {
      "text": "Anil Singh, Vikram Bhadauria, Anurag Jain, and Anil Gurung. 2013. Role of gender, self-efficacy, anxiety and testing formats in learning spreadsheets. Computers in Human Behavior 29, 3: 739--746.  ",
      "doi": "10.1016/j.chb.2012.11.009"
    },
    {
      "text": "Rick Spencer. 2000. The streamlined cognitive walkthrough method, working around social constraints encountered in a software development company. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI '00), 353359.  ",
      "doi": "10.1145/332040.332456"
    },
    {
      "text": "Phil Turner and Susan Turner. 2011. Is stereotyping inevitable when designing with personas? Design Studies 32, 1: 30--44.",
      "doi": ""
    },
    {
      "text": "Afshin Vafaei, Beatriz Alvarado, Concepcion Tomás, Carmen Muro, Beatriz Martinez, and Maria Victoria Zunzunegui. 2014. The validity of the 12-item Bem Sex Role Inventory in older Spanish population: An examination of the androgyny model. Archives of gerontology and geriatrics 59, 2: 257--263.",
      "doi": ""
    },
    {
      "text": "Gabriela Viana and Jean-Marc Robert. 2016. The practitioners' points of view on the creation and use of personas for user interface design. In Human-Computer Interaction. Theory, Design, Development and Practice: 18th International Conference, HCI International 2016, Toronto, ON, Canada, July 17--22, 2016. Proceedings, Part I, Masaaki Kurosu (Ed.). Cham: Springer International Publishing, 233--244.  ",
      "doi": "10.1007/978-3-319-39510-4_22"
    },
    {
      "text": "Elke U. Weber, Ann-Renée Blais, and Nancy E. Betz. 2002. A domain-specific risk-attitude scale: measuring risk perceptions and risk behaviors. Journal of Behavioral Decision Making 15, 4: 263--290.",
      "doi": ""
    },
    {
      "text": "Cathleen Wharton, John Rieman, Clayton Lewis, and Peter Polson. 1994. The cognitive walkthrough method: A practitioner's guide. In Usability Inspection Methods. John Wiley, NY, 105--140. ",
      "doi": "10.5555/189200.189214"
    }
  ]
}