{
  "doi": "10.1145/3025453.3025868",
  "title": "TagRefinery: A Visual Tool for Tag Wrangling",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2928-2939",
  "year": 2017,
  "badges": [],
  "abstract": "We present TagRefinery, an interactive visual application aiding the cleaning and processing of open tag spaces, such as those in Last.fm or YouTube. Our pre-design analysis showed a need to support a spectrum of user expertise from novice to advanced, which resulted in two distinct interface modes. Summative evaluations of TagRefinery showed that it could effectively guide the novice users through the workflow by giving them brief but helpful explanations on why each step was required, and providing visual and statistical aids to help them in making important decisions. This is while our more expert users greatly appreciated the amount of control and granularity over the workflow that our more advanced interface mode offered. Both the underlying tag cleaning workflow and the interface were designed iteratively in a participatory design process in collaboration with research on a music recommendation interface based on Last.fm tags.",
  "tags": [
    "data wrangling",
    "data cleaning",
    "visual data analysis",
    "graphical interface",
    "user centred design",
    "social tags",
    "folksonomy"
  ],
  "authors": [
    {
      "name": "Christoph Kralj",
      "institution": "University of Vienna, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987991",
      "orcid": "missing"
    },
    {
      "name": "Mohsen Kamalzadeh",
      "institution": "Simon Fraser University, Burnaby, BC, Canada",
      "img": "/do/10.1145/contrib-99658989198/rel-imgonly/sam_0279c.jpg",
      "acmid": "99658989198",
      "orcid": "missing"
    },
    {
      "name": "Torsten Möller",
      "institution": "University of Vienna, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332516480",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. J. Usability Studies 4, 3 (May 2009), 114--123. http://dl.acm.org/citation.cfm?id=2835587.2835589",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Dominikus Baur, Jennifer Bttgen, and Andreas Butz. 2012. Listening Factors: A Large-Scale Principal Components Analysis of Long-Term Music Listening Histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09). 1273--1276. http://dl.acm.org/citation.cfm?id=2208581",
      "doi": "10.1145/2207676.2208581"
    },
    {
      "text": "Thierry Bertin-Mahieux, Daniel P. W. Ellis, Brian Whitman, and Paul Lamere. 2011. The Million Song Dataset. In Proceedings of the International Society for Music Information Retrieval Conference (ISMIR'11). International Society for Music Information Retrieval, Miami, Florida, USA, 591--596. http://ismir2011.ismir.net/papers/OS6--1.pdf",
      "doi": ""
    },
    {
      "text": "Eric Brill and Robert C. Moore. 2000. An Improved Error Model for Noisy Channel Spelling Correction. In Proceedings of the Annual Meeting on Association for Computational Linguistics (ACL'00). Stroudsburg, PA, USA, 286--293. DOI: http://dx.doi.org/10.3115/1075218.1075255  ",
      "doi": "10.3115/1075218.1075255"
    },
    {
      "text": "John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7. http://hell.meiert.org/core/pdf/sus.pdf",
      "doi": ""
    },
    {
      "text": "Stefan Evert and Brigitte Krenn. 2005. Using small random samples for the manual evaluation of statistical association measures. Computer Speech and Language 19, 4 (2005), 450--466. DOI: http://dx.doi.org/10.1016/j.csl.2005.02.005  ",
      "doi": "10.1016/j.csl.2005.02.005"
    },
    {
      "text": "Afsaneh Fazly, Paul Cook, and Suzanne Stevenson. 2009. Unsupervised Type and Token Identification of Idiomatic Expressions. Computational Linguistics 35, May 2008 (2009), 61--103. DOI: http://dx.doi.org/10.1162/coli.08-010-R1-07-048  ",
      "doi": "10.1162/coli.08-010-R1-07-048"
    },
    {
      "text": "Davide Fossati and Barbara Di Eugenio. 2008. I saw TREE trees in the park: How to Correct Real-Word Spelling Mistakes. In Proceedings of the International Conference on Language Resources and Evaluation (LREC'08) (28--30). Marrakech, Morocco, 896--901. http://www.lrec-conf.org/proceedings/lrec2008/",
      "doi": ""
    },
    {
      "text": "Spence Green, Marie-Catherine de Marneffe, and Christopher D. Manning. 2012. Parsing Models for Identifying Multiword Expressions. Computational Linguistics 39, 1 (Nov 2012), 195--227. DOI: http://dx.doi.org/10.1162/COLI_a_00139  ",
      "doi": "10.1162/COLI_a_00139"
    },
    {
      "text": "Manish Gupta, Rui Li, Zhijun Yin, and Jiawei Han. 2010. Survey on social tagging techniques. ACM SigKDD Explorations Newsletter 12, 1 (2010), 58--72. DOI: http://dx.doi.org/10.1145/1882471.1882480  ",
      "doi": "10.1145/1882471.1882480"
    },
    {
      "text": "Graeme Hirst and Alexander Budanitsky. 2005. Correcting real-word spelling errors by restoring lexical cohesion. Natural Language Engineering 11, December 2003 (2005), 87--111. DOI: http://dx.doi.org/10.1017/S1351324904003560  ",
      "doi": "10.1017/S1351324904003560"
    },
    {
      "text": "Mohsen Kamalzadeh, Christoph Kralj, Torsten Möller, and Michael Sedlmair. 2016. TagFlip: Active Mobile Music Discovery with Social Tags. In Proceedings of the ACM International Conference on Intelligent User Interfaces (IUI'16). ACM Press, 19--30. DOI: http://dx.doi.org/10.1145/2856767.2856780  ",
      "doi": "10.1145/2856767.2856780"
    },
    {
      "text": "Yvonne Kammerer, Rowan Nairn, Peter Pirolli, and Ed H. Chi. 2009. Signpost from the Masses: Learning Effects in an Exploratory Social Tag Search Browser. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09). NY, NY, USA, 625--634. DOI: http://dx.doi.org/10.1145/1518701.1518797  ",
      "doi": "10.1145/1518701.1518797"
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive Visual Specification of Data Transformation Scripts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'011). ACM, NY, NY, USA, 3363--3372. DOI: http://dx.doi.org/10.1145/1978942.1979444  ",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "Paul Lamere. 2008. Social Tagging and Music Information Retrieval. Journal of New Music Research 37, 2 (2008), 101--114. http://www.tandfonline.com/doi/ abs/10.1080/09298210802479284 ",
      "doi": ""
    },
    {
      "text": "C. Laurier, M. Sordo, Joan Serrà, and Perfecto Herrera. 2009. Music Mood Representations from Social Tags. In Proceedings of the International Society of Music Information Retrieval Conference (ISMIR'09). Kobe, Japan, 381--386. http://mtg.upf.edu/node/1466",
      "doi": ""
    },
    {
      "text": "Mark Levy and Mark B. Sandler. 2007. A Semantic Space for Music Derived from Social Tags. In Proceedings of the International Society of Music Information Retrieval Conference (ISMIR'07). Vienna, Austria, 411--416. http://ismir2007.ismir.net/ proceedings/ISMIR2007_p411_levy.pdf",
      "doi": ""
    },
    {
      "text": "Emanuele Quintarelli. 2005. Folksonomies: Power to the People. (2005). http: //www-dimat.unipv.it/biblio/isko/doc/folksonomies.htm",
      "doi": ""
    },
    {
      "text": "Carlos Ramisch, Helena De Medeiros Caseli, Aline Villavicencio, Andre Machado, and Maria José Finatto. 2010. A hybrid approach for multiword expression identification. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 6001 LNAI (2010), 65--74. DOI: http://dx.doi.org/10.1007/978--3--642--12320--7_9",
      "doi": ""
    },
    {
      "text": "Christoph Ringlstetter, Klaus U. Schulz, and Stoyan Mihov. 2006. Orthographic Errors in Web Pages: Toward Cleaner Web Corpora. Computational Linguistics 3, December 2005 (2006), 295--340. DOI: http://dx.doi.org/10.1162/coli.2006.32.3.295  ",
      "doi": "10.1162/coli.2006.32.3.295"
    },
    {
      "text": "Ivan A. Sag, Timothy Baldwin, Francis Bond, Ann Copestake, and Dan Flickinger. 2002. Multiword Expressions: A Pain in the Neck for NLP. 1--15. DOI: http://dx.doi.org/10.1007/3--540--45715--1_1",
      "doi": ""
    },
    {
      "text": "Nathan Schneider, Emily Danchik, Chris Dyer, and Noah A. Smith. 2014. Discriminative lexical semantic segmentation with gaps: running the MWE gamut. Transactions of the Association for Computational Linguistics 2 (April 2014), 193--206. http: //www.transacl.org/wp-content/uploads/2014/04/51.pdf",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1996. The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations. In Proceedings of the IEEE Symposium on Visual Languages (VL'96). 336--343. http://dl.acm.org/citation.cfm?id=832277.834354",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Louise F. Spiteri. 2007. The structure and form of folksonomy tags: The road to the public library catalog. Information Technology and Libraries 26, 3 (2007), 13. http://ejournals.bc.edu/ojs/index.php/ital/article/ view/3272",
      "doi": ""
    },
    {
      "text": "Kristina Toutanova and Robert C. Moore. 2002. Pronunciation Modeling for Improved Spelling Correction. In Proceedings of the Annual Meeting on Association for Computational Linguistics (ACL'02). Association for Computational Linguistics, Stroudsburg, PA, USA, 144--151. DOI: http://dx.doi.org/10.3115/1073083.1073109  ",
      "doi": "10.3115/1073083.1073109"
    },
    {
      "text": "Tim Van de Cruys and Begoña Villada Moirón. 2007. Semantics-based Multiword Expression Extraction. In Proceedings of the Workshop on a Broader Perspective on Multiword Expressions (MWE'07). 25--32. http://dl.acm.org/citation.cfm?id=1613704.1613708",
      "doi": ""
    },
    {
      "text": "Jesse Vig, Shilad Sen, and John Riedl. 2011. Navigating the tag genome. In Proceedings of the ACM International Conference on Intelligent User Interfaces (IUI'11). 93--102. http://doi.acm.org/10.1145/1502650.1502661",
      "doi": "10.1145/1943403.1943418"
    },
    {
      "text": "Ju-Chiang Wang, Yu-Chin Shih, Meng-Sung Wu, Hsin-Min Wang, and Shyh-Kang Jeng. 2011. Colorizing Tags in Tag Cloud: A Novel Query-by-Tag Music Search System. In Proceedings of the ACM Conference on Multimedia (MM'11). DOI: http://dx.doi.org/10.1145/2072298.2072337  ",
      "doi": "10.1145/2072298.2072337"
    }
  ]
}