{
  "doi": "10.1145/3025453.3025688",
  "title": "Retargeting Video Tutorials Showing Tools With Surface Contact to Augmented Reality",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6547-6558",
  "year": 2017,
  "badges": [],
  "abstract": "A video tutorial effectively conveys complex motions, but may be hard to follow precisely because of its restriction to a predetermined viewpoint. Augmented reality (AR) tutorials have been demonstrated to be more effective. We bring the advantages of both together by interactively retargeting conventional, two-dimensional videos into three-dimensional AR tutorials. Unlike previous work, we do not simply overlay video, but synthesize 3D-registered motion from the video. Since the information in the resulting AR tutorial is registered to 3D objects, the user can freely change the viewpoint without degrading the experience. This approach applies to many styles of video tutorials. In this work, we concentrate on a class of tutorials which alter the surface of an object.",
  "authors": [
    {
      "name": "Peter Mohr",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699174",
      "orcid": "missing"
    },
    {
      "name": "David Mandl",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160439",
      "orcid": "missing"
    },
    {
      "name": "Markus Tatzgern",
      "institution": "Salzburg University of Applied Sciences, Salzburg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435607558",
      "orcid": "0000-0002-3900-4944"
    },
    {
      "name": "Eduardo Veas",
      "institution": "Know Center GmbH, Graz, Styria, Austria",
      "img": "/do/10.1145/contrib-81416603355/rel-imgonly/edu.jpg",
      "acmid": "81416603355",
      "orcid": "missing"
    },
    {
      "name": "Dieter Schmalstieg",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100091694",
      "orcid": "missing"
    },
    {
      "name": "Denis Kalkofen",
      "institution": "Graz University of Technology, Graz, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414597830",
      "orcid": "0000-0002-0359-206X"
    }
  ],
  "references": [
    {
      "text": "Maneesh Agrawala, Doantam Phan, Julie Heiser, John Haymaker, Jeff Klingner, Pat Hanrahan, and Barbara Tversky. 2003. Designing effective step-by-step assembly instructions. ACM Trans. Graph. 22, 3 (July 2003), 828--837.  ",
      "doi": "10.1145/882262.882352"
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: Enhancing Movement Training with an Augmented Reality Mirror. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 311--320.  ",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Tadas Baltrušaitis, Louis-Philippe Morency, and Peter Robinson. 2013. Constrained Local Neural Fields for robust facial landmark detection in the wild. In 300 Faces in-the-wild challenge, International Conference on Computer Vision.  ",
      "doi": "10.1109/ICCVW.2013.54"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114--123. ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Olivier Bau and Wendy E. Mackay. 2008. OctoPocus: A Dynamic Guide for Learning Gesture-based Command Sets. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "P. Breedveld. 1997. Observation, Manipulation, and Eye-Hand Coordination Problems in Minimally Invasive Surgery. In in Proc XVI European Annual Conference on Human Decision Making and Manual Control. 9--11.",
      "doi": ""
    },
    {
      "text": "John Brooke and others. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Andreas Butz. 1994. BETTY: Planning and Generating Animations for the Visualization of Movements and Spatial Relations. In Proc. of Advanced Visual Interfaces. 53--58.  ",
      "doi": "10.1145/192309.192324"
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: automatic generation of step-by-step mixed media tutorials. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 93--102.  ",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Mira Dontcheva, Li Li Wilmot, Daniel Vodel, and Björn Hartmann. 2016. Authoring Illustrations of Human Movements by Iterative Physical Demonstration. In Proceedings of the 29th Annual ACM Symposium on User Interface Software and Technology (UIST '16). to appear.  ",
      "doi": "10.1145/2984511.2984559"
    },
    {
      "text": "Yung-Yu Chuang, Aseem Agarwala, Brian Curless, David H. Salesin, and Richard Szeliski. 2002. Video Matting of Complex Scenes. In Proceedings of the 29th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '02). ACM, New York, NY, USA, 243--248.  ",
      "doi": "10.1145/566570.566572"
    },
    {
      "text": "J P Collomosse. 2003. Cartoon-style Rendering of Motion from Video. Vision Video and Graphics 67, 6 (2003), 549--564.",
      "doi": ""
    },
    {
      "text": "Dima Damen, Teesid Leelasawassuk, Osian Haines, Andrew Calway, and Walterio Mayol-Cuevas. 2014. You-Do, I-Learn: Discovering Task Relevant Objects and their Modes of Interaction from Multi-User Egocentric Video. In British Machine Vision Conference (BMVC). BMVA.",
      "doi": ""
    },
    {
      "text": "David H. Douglas and Thomas K. Peucker. 1973. Algorithms for the reduction of the number of points required to represent a digitized line or its caricature. Cartographica: The International Journal for Geographic Information and Geovisualization 10, 2 (1 Oct. 1973), 112--122.",
      "doi": ""
    },
    {
      "text": "Steven Feiner, Blair Macintyre, and Dorée Seligmann. 1993. Knowledge-based augmented reality. Commun. ACM 36 (July 1993), 53--62. Issue 7.  ",
      "doi": "10.1145/159544.159587"
    },
    {
      "text": "M. Goto, Y. Uematsu, H. Saito, S. Senda, and A. Iketani. 2010. Task support system by displaying instructional video onto AR workspace. In Mixed and Augmented Reality (ISMAR), 2010 9th IEEE International Symposium on. 83--90.",
      "doi": ""
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Wilmot Li, Mira Dontcheva, and Takeo Igarashi. 2009. Generating photo manipulation tutorials by demonstration. ACM Transactions on Graphics (TOG) 28, 3 (2009), 66.  ",
      "doi": "10.1145/1531326.1531372"
    },
    {
      "text": "Ankit Gupta, Dieter Fox, Brian Curless, and Michael Cohen. 2012. DuploTrack: A Real-time System for Authoring and Guiding Duplo Block Assembly. In Proceedings of ACM Symposium on User Interface Software and Technology (UIST '12). 389--402.  ",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Advances in psychology 52 (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Steven Henderson and Steven Feiner. 2011. Exploring the Benefits of Augmented Reality Documentation for Maintenance and Repair. IEEE Trans. Vis. Comp. Graph. 17, 10 (2011), 1355--1368.  ",
      "doi": "10.1109/TVCG.2010.245"
    },
    {
      "text": "Zdenek Kalal, Krystian Mikolajczyk, and Jiri Matas. 2012. Tracking-Learning-Detection. IEEE Trans. Pattern Anal. Mach. Intell. 34, 7 (July 2012), 1409--1422.  ",
      "doi": "10.1109/TPAMI.2011.239"
    },
    {
      "text": "Denis Kalkofen, Markus Tatzgern, and Dieter Schmalstieg. 2009. Explosion Diagrams in Augmented Reality. In Proc. of IEEE Virtual Reality (VR '09). IEEE, 71--78.  ",
      "doi": "10.1109/VR.2009.4811001"
    },
    {
      "text": "Denis Kalkofen, Eduardo E. Veas, Stefanie Zollmann, Markus Steinberger, and Dieter Schmalstieg. 2013. Adaptive ghosted views for Augmented Reality. In IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2013, Adelaide, Australia, October 1--4, 2013. IEEE, 1--9.",
      "doi": ""
    },
    {
      "text": "Bernhard Kerbl, Denis Kalkofen, Markus Steinberger, and Dieter Schmalstieg. 2015. Interactive Disassembly Planning for Complex Objects. Computer Graphics Forum (2015).  ",
      "doi": "10.1111/cgf.12560"
    },
    {
      "text": "B. Kim and I. Essa. 2005. Video-based nonphotorealistic and expressive illustration of motion. In Proc. of the Computer Graphics International 2005. 32--35. ",
      "doi": "10.5555/1251973.1252478"
    },
    {
      "text": "Vladislav Kraevoy, Alla Sheffer, and Michiel van de Panne. 2009. Modeling from Contour Drawings. In Proceedings of the 6th Eurographics Symposium on Sketch-Based Interfaces and Modeling (SBIM '09). ACM, New York, NY, USA, 37--44.  ",
      "doi": "10.1145/1572741.1572749"
    },
    {
      "text": "Tobias Langlotz, Mathäus Zingerle, Raphael Grasset, Hannes Kaufmann, and Gerhard Reitmayr. 2012. AR Record Replay: Situated Compositing of Video Content in Mobile Augmented Reality. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI '12). 318--326.  ",
      "doi": "10.1145/2414536.2414588"
    },
    {
      "text": "Florian Ledermann and Dieter Schmalstieg. 2005. APRIL A High-Level Framework for Creating Augmented Reality Presentations. In Proc. of IEEE Virtual Reality. 187--194.  ",
      "doi": "10.1109/VR.2005.8"
    },
    {
      "text": "V. Lepetit, F.Moreno-Noguer, and P.Fua. 2009. EPnP: An Accurate O(n) Solution to the PnP Problem. International Journal Computer Vision 81, 2 (2009).  ",
      "doi": "10.1007/s11263-008-0152-6"
    },
    {
      "text": "Wilmot Li, Maneesh Agrawala, Brian Curless, and David Salesin. 2008. Automated Generation of Interactive 3D Exploded View Diagrams. ACM Trans. Graph. 27, 3, Article 101 (Aug. 2008), 7 pages.  ",
      "doi": "10.1145/1360612.1360700"
    },
    {
      "text": "David G. Lowe. 2004. Distinctive Image Features from Scale-Invariant Keypoints. Int. J. Comput. Vision 60, 2 (Nov. 2004), 91--110.  ",
      "doi": "10.1023/B%3AVISI.0000029664.99615.94"
    },
    {
      "text": "Bruce D. Lucas and Takeo Kanade. 1981. An Iterative Image Registration Technique with an Application to Stereo Vision. In Proceedings of the 7th International Joint Conference on Artificial Intelligence - Volume 2 (IJCAI'81). 674--679. ",
      "doi": "10.5555/1623264.1623280"
    },
    {
      "text": "Peter Mohr, Bernhard Kerbl, Michael Donoser, Dieter Schmalstieg, and Denis Kalkofen. 2015. Retargeting Technical Documentation to Augmented Reality. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3337--3346.  ",
      "doi": "10.1145/2702123.2702490"
    },
    {
      "text": "G. Nebehay. 2012. Robust Object Tracking Based on Tracking-Learning-Detection. Master's thesis. Faculty of Informatics, TU Vienna.",
      "doi": ""
    },
    {
      "text": "Richard A. Newcombe, Shahram Izadi, Otmar Hilliges, David Molyneaux, David Kim, Andrew J. Davison, Pushmeet Kohli, Jamie Shotton, Steve Hodges, and Andrew Fitzgibbon. 2011. KinectFusion: Real-time Dense Surface Mapping and Tracking. In Proceedings of the 2011 10th IEEE International Symposium on Mixed and Augmented Reality (ISMAR '11). IEEE Computer Society, Washington, DC, USA, 127--136.  ",
      "doi": "10.1109/ISMAR.2011.6092378"
    },
    {
      "text": "Marc Nienhaus and Jürgen Döllner. 2003. Dynamic glyphs Depicting dynamics in images of 3D scenes. In Proc. of the 3rd international conference on Smart graphics (SG'03). Springer-Verlag, Berlin, Heidelberg, 102--111. ",
      "doi": "10.5555/1757492.1757504"
    },
    {
      "text": "Peter Ondruska, Pushmeet Kohli, and Shahram Izadi. 2015. MobileFusion: Real-time Volumetric Surface Reconstruction and Dense Tracking On Mobile Phones. In International Symposium on Mixed and Augmented Reality (ISMAR). Fukuoka, Japan.",
      "doi": ""
    },
    {
      "text": "M. Park, S. Serefoglou, L. Schmidt, K. Radermacher, C. Schlick, and H. Luczak. 2008. Hand-Eye Coordination Using a Video See-Through Augmented Reality System. The Ergonomics Open Journal 1 (2008), 46--53.",
      "doi": ""
    },
    {
      "text": "N. Petersen and D. Stricker. 2012. Learning task structure from video examples for workflow tracking and authoring. In Mixed and Augmented Reality (ISMAR), 2012 IEEE International Symposium on. 237--246.  ",
      "doi": "10.1109/ISMAR.2012.6402562"
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pause-and-play: Automatically Linking Screencast Video Tutorials with Applications. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 135--144.  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Dorée Duncan Seligmann and Steven Feiner. 1991. Automated Generation of Intent-Based 3D Illustrations. In Proc. of ACM SIGGRAPH. 123--132.  ",
      "doi": "10.1145/122718.122732"
    },
    {
      "text": "Jianchao Tan, Marek Dvorožňák, Daniel Sýkora, and Yotam Gingold. 2015. Decomposing Time-Lapse Paintings into Layers. ACM Transactions on Graphics (TOG) 34, 4, Article 61 (July 2015), 10 pages.  ",
      "doi": "10.1145/2766960"
    },
    {
      "text": "Richard Tang, Xing-Dong Yang, Scott Bateman, Joaquim Jorge, and Anthony Tang. 2015. Physio@Home: Exploring Visual Guidance and Feedback Techniques for Physiotherapy Exercises. In Proceedings of ACM CHI. 4123--4132.  ",
      "doi": "10.1145/2702123.2702401"
    },
    {
      "text": "Barbara Tversky, Julie Bauer Morrison Y, and Mireille Betrancourt. 2002. Animation: Can it facilitate. International Journal of Human-Computer Studies 57 (2002), 247--262.  ",
      "doi": "10.1006/ijhc.2002.1017"
    },
    {
      "text": "Sean White, David Feng, and Steven Feiner. 2009. Interaction and presentation techniques for shake menus in tangible augmented reality. In Proc. of the IEEE IISMAR. 39--48.  ",
      "doi": "10.1109/ISMAR.2009.5336500"
    },
    {
      "text": "Jürgen Zauner, Michael Haller, Alexander Brandl, and Werner Hartmann. 2003. Authoring of a Mixed Reality Assembly Instructor for Hierarchical Structures. In Proc. of IEEE/ACM ISMAR. 237--246. ",
      "doi": "10.5555/946248.946783"
    }
  ]
}