{
  "doi": "10.1145/3025453.3025954",
  "title": "MyriadHub: Efficiently Scaling Personalized Email Conversations with Valet Crowdsourcing",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "73-84",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Email has scaled our ability to communicate with large groups, but has not equivalently scaled our ability to listen and respond. For example, emailing many people for feedback requires either impersonal surveys or manual effort to hold many similar conversations. To scale personalized conversations, we introduce techniques that exploit similarities across conversations to recycle relevant parts of previous conversations. These techniques reduce the authoring burden, save senders' time, and maintain recipient engagement through personalized responses. We introduce MyriadHub, a mail client where users start conversations and then crowd workers extract underlying conversational patterns and rules to accelerate responses to future similar emails. In a within-subjects experiment comparing MyriadHub to existing mass email techniques, senders spent significantly less time planning events with MyriadHub. In a second experiment comparing MyriadHub to a standard email survey, MyriadHub doubled the recipients' response rate and tripled the number of words in their responses.",
  "authors": [
    {
      "name": "Nicolas Kokkalis",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553620356",
      "orcid": "missing"
    },
    {
      "name": "Chengdiao Fan",
      "institution": "Stanford University, Palo Alto, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130776",
      "orcid": "missing"
    },
    {
      "name": "Johannes Roith",
      "institution": "Stanford University, Stanford, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161086",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    },
    {
      "name": "Scott Klemmer",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark Steven Ackerman and Thomas W. Malone. 1990. Answer Garden: A tool for growing organizational memory. In Proceedings of the ACM SIGOIS and IEEE CS TC-OA conference on Office information systems (COCS '90).  ",
      "doi": "10.1145/91474.91485"
    },
    {
      "text": "Paul André, Aniket Kittur and Steven P. Dow. 2014. Crowd synthesis: Extracting categories and clusters from complex data. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (CSCW '14). ACM New York, NY, USA. 989--998.",
      "doi": ""
    },
    {
      "text": "William G. Axinn, Thomas E. Fricke and Arland Thornton. 1991. The Microdemographic CommunityStudy Approach Improving Survey Data by Integrating the Ethnographic Method. In Sociological Methods & Research 20.2 (1991): 187--217. ",
      "doi": ""
    },
    {
      "text": "Greg Barron and Eldad Yechiam. 2002. Private e-mail requests and the diffusion of responsibility. In Computers in Human Behavior 18.5 (2002): 507--520. ",
      "doi": ""
    },
    {
      "text": "Gerard Beenen, Kimberly Ling, Xiaoquin Wang, Klarissa Chang and Dan Frankowski. 2004. Using social psychology to motivate contributions to online communities. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW '04). ACM New York, NY, USA, 212--221.  ",
      "doi": "10.1145/1031607.1031642"
    },
    {
      "text": "Victoria Bellotti, Nicolas Ducheneaut, Mark Howard and Ian Smith. 2003. Taking email to task: the design and evaluation of a task management centered email tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM New York, NY, USA, 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Edward Benson and David R. Karger. 2014. End-users publishing structured information on the web: an observational study of what, why, and how. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM New York, NY, USA, 1265--1274.  ",
      "doi": "10.1145/2556288.2557036"
    },
    {
      "text": "Michael Bernstein, Max van Kleek, David Karger and MC Schraefel. 2008. Information scraps: How and why information eludes our personal information management tools. In ACM Transactions on Information Systems (TOIS) 26.4 (2008): 24.  ",
      "doi": "10.1145/1402256.1402263"
    },
    {
      "text": "John H. Boose. 1990. Knowledge acquisition tools, methods and mediating representations. In Knowledge Acquisition for Knowledge-Based Systems (Motoda, H. et al., Eds), IOS Press, Tokyo (1990): 123.",
      "doi": ""
    },
    {
      "text": "Simon H. Corston-Oliver, Eric Ringger, Michael Gamon and Richard Campbell. 2004. Integration of Email and Task Lists. In Proc. CEAS.",
      "doi": ""
    },
    {
      "text": "Laura A. Dabbish and Robert E. Kraut. 2006. Email overload at work: an analysis of factors associated with email strain. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM New York, NY, USA, 431--440.  ",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Judith Donath. 2007. Signals in social supernets. In JCMC 13.1 (2007): 231--251.",
      "doi": ""
    },
    {
      "text": "Danyel Fisher and A.J. Brush. 2006. Revisiting Whittaker & Sidner's email overload ten years later. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (CSCW '06). ACM New York, NY, USA, 309--312.  ",
      "doi": "10.1145/1180875.1180922"
    },
    {
      "text": "Fernando Flores, Michael Graves, Brad Hartfield, and Terry Winograd. 1988. Computer systems and the design of organizational interaction. In ACM Transactions on Information Systems (TOIS) 6.2 (1988):153172.  ",
      "doi": "10.1145/45941.45943"
    },
    {
      "text": "Catherine Grevet, David Choi, Debra Kumar and Eric Gilbert. 2014. Overload is overloaded: email in the age of Gmail. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM New York, NY, USA, 793--802.  ",
      "doi": "10.1145/2556288.2557013"
    },
    {
      "text": "Christine A. Halverson, Thomas Erickson and Mark S. Ackerman. 2004. Behind the help desk: evolution of a knowledge management system in a large organization. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW '04). ACM New York, NY, USA, 304--313.  ",
      "doi": "10.1145/1031607.1031657"
    },
    {
      "text": "Sudheendra Hangal, Monica S. Lam, and Jeffrey Heer. 2011. Muse: Reviving memories using email archives. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM New York, NY, USA, 75--84.",
      "doi": "10.1145/2047196.2047206"
    },
    {
      "text": "Björn Hartmann, Leslie Wu, Kevin Collins and Scott R. Klemmer. 2007. Programming by a sample: rapidly creating web applications with d. mix. In Proceedings of the 20th annual ACM symposium on User interface software and technology. ACM New York, NY, USA, 241--250.",
      "doi": ""
    },
    {
      "text": "Dirk Heerwegh, Tim Vanhove, Koen Matthijs and Geert Loosveldt. 2005. The effect of personalization on response rates and data quality in web surveys. In International Journal of Social Research Methodology 8.2.. ",
      "doi": ""
    },
    {
      "text": "Adam N. Joinson and Ulf-Dietrich Reips. 2007. Personalized salutation, power of sender and response rates to Web-based surveys. In Computers in Human Behavior 23.3 (2007): 1372--1383.  ",
      "doi": "10.1016/j.chb.2004.12.011"
    },
    {
      "text": "William Jones. 2007. Personal information management. In ASIST 41.1 (2007): 453--504.",
      "doi": ""
    },
    {
      "text": "Nicolas Kokkalis, Thomas Köhn, Carl Pfeiffer, Dima Chornyi, Michael S. Bernstein and Scott R. Klemmer. 2013. EmailValet: Managing email overload through private, accountable crowdsourcing. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM New York, NY, USA, 1291--1300.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Bella Manoim, Manas Mittal, George Hripcsak and Björn Hartmann. 2011. Design lessons from the fastest Q&A site in the west. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM New York, NY, USA, 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Donna McAuliffe. 2003. Challenging methodological traditions: Research by email. In The Qualitative Report 8.1 (2003): 57--69.",
      "doi": ""
    },
    {
      "text": "Kevin Kyung Nam, Mark S. Ackerman, and Lada A. Adamic. 2009. Questions in, knowledge in?: a study of naver's question answering community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM New York, NY, USA, 779--788.",
      "doi": ""
    },
    {
      "text": "Albert Oosterhof. 2000. Creating individualized e-mail to students. In Journal of Computing in Higher Education 11.2 (2000): 75--90. ",
      "doi": ""
    },
    {
      "text": "Adam Perer, Ben Shneiderman, and Douglas W. Oard. 2006. Using rhythms of relationships to understand email archives. In JASIST 57.14 (2006): 1936--1948.",
      "doi": ""
    },
    {
      "text": "Owen Rambow, Lokesh Shrestha, John Chen, and Chirsty Lauridsen. 2004. Summarizing email threads. In Proc. NAACL. ",
      "doi": ""
    },
    {
      "text": "Kim Sheehan, and Sally J. McMillan. 1999. Response variation in e-mail surveys: An exploration. In Journal of Advertising Research.",
      "doi": ""
    },
    {
      "text": "Amy Voida, Ellie Harmon and Ban Al-Ani. 2011. Homebrew databases: Complexities of everyday information management in nonprofit organizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM New York, NY, USA, 915--924.",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Herbert F. Weisberg, Jon A. Krosnick, and Bruce D. Bowen. 1996. An introduction to survey research, polling, and data analysis. Sage.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, and Julia Hirschberg. 2001. The character, value, and management of personal paper archives. In TOCHI 8.2 (2001): 150--170.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker and Candace Sidner. 1996. Email overload: exploring personal information management of email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96). ACM New York, NY, USA, 276--283.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Amy X. Zhang, Lea Verou and David Karger. 2017. Wikum: Bridging Discussion Forums and Wikis Using Recursive Summarization. In Proc. CSCW. ACM New York, NY, USA.",
      "doi": "10.1145/2998181.2998235"
    },
    {
      "text": "Amy X. Zhang, Mark S. Ackerman, and David R. Karger. 2015. Mailing Lists: Why Are They Still Here, What's Wrong With Them, and How Can We Fix Them?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM New York, NY, USA, 4009--4018.",
      "doi": ""
    }
  ]
}