{
  "doi": "10.1145/3025453.3025559",
  "title": "Community Conversational: Supporting and Capturing Deliberative Talk in Local Consultation Processes",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2320-2333",
  "year": 2017,
  "badges": [],
  "abstract": "The development of platforms for community decision-making has been of growing interest to the HCI community, yet the ways technology might be woven into traditional consultation processes has been under-studied. We conducted fieldwork at consultation events where residents were invited to discuss and map assets related to their neighbourhoods to inform community decision-making. The fieldwork highlighted problems with equality, turn taking, the evidencing and elaborating on opinions by residents, and challenges related to capturing and documenting the events. We developed Community Conversational-a hybrid table-top game and digital capture and review platform-in response to these issues. Community Conversational was designed to provide a flexible structure to consultation events related to 'place', and support the production, capture and review of deliberative 'talk' to support decision-making. We study how the platform was used in two consultation events, and discuss the implications of capturing and evidencing local people's opinions for the accountability of decision-makers and community organisations.",
  "authors": [
    {
      "name": "Ian G. Johnson",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659020768/rel-imgonly/1u6a8263.jpg",
      "acmid": "99659020768",
      "orcid": "missing"
    },
    {
      "name": "Alistair MacDonald",
      "institution": "Northumbria University & Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162651",
      "orcid": "missing"
    },
    {
      "name": "Jo Briggs",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81549187556/rel-imgonly/portrait-oxford-square.jpg",
      "acmid": "81549187556",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Manuel",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659160184/rel-imgonly/headshot.jpg",
      "acmid": "99659160184",
      "orcid": "missing"
    },
    {
      "name": "Karen Salt",
      "institution": "Nottingham University, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161681",
      "orcid": "missing"
    },
    {
      "name": "Emma Flynn",
      "institution": "Durham University, Durham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162673",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Hannah Arendt. 1958. The Human Condition. University of Cicago Press, Chicage.",
      "doi": ""
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Henry Bäck. 2002. Fragmentation and consolidation in the big city: Neighbourhood decentralisation in six Scandinavian cities. ECPR Joint Session of Workshops: 23--27.",
      "doi": ""
    },
    {
      "text": "Harry Blair. 2000. Participation and Accountability at the Periphery: Democratic Local Governance in Six Countries. World Development 28, 1: 21--39.",
      "doi": ""
    },
    {
      "text": "Harry C. Boyte. 2004. Everyday Politics: Reconnecting Citizens and Public Life. University of Pennsylvania Press.",
      "doi": ""
    },
    {
      "text": "Eva Brandt and Eva. 200 Designing exploratory design games. In Proceedings of the ninth conference on Participatory design Expanding boundaries in design - PDC '06, 57.  ",
      "doi": "10.1145/1147261.1147271"
    },
    {
      "text": "Eva Brandt and Jörn Messeter. 2004. Facilitating collaboration through design games. In Proceedings of the eighth conference on Participatory design Artful integration: interweaving media, materials and practices - PDC 04, 121.  ",
      "doi": "10.1145/1011870.1011885"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Michael M Burgess. 2014. From 'trust us' to participatory governance: Deliberative publics and science policy. Public understanding of science (Bristol, England) 23, 1: 48--52.",
      "doi": ""
    },
    {
      "text": "Simone Chambers. 2001. Constitutional Referendums and Democratic Deliberation. In Referendum Democracy. Palgrave Macmillan UK, London, 231--255.",
      "doi": ""
    },
    {
      "text": "1Fiorella De Cindio and Cristian Peraboni. 20 Building digital participation hives: towards a local public sphere. In From social butterfly to engaged citizen: urban informatics, social media, ubiquitous computing, and mobile technology to support citizen engagement, Marcus Foth, L Forlano, C Satchell and M Gibbs (eds.). MIT Press, MA.",
      "doi": ""
    },
    {
      "text": "Pamela Johnston Conover and Donald D Searing. 2005. Studying \"Everyday Political Talk\" in the Deliberative System. Acta Politica 40, 3: 269--283.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, John Bowers, Peter C. Wright, and Patrick Olivier. 2014. A pool of dreams. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, 3573--3582.  ",
      "doi": "10.1145/2556288.2557100"
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J. Bowen, Peter C. Wright, and Patrick Olivier. 2015. Contesting the City. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 2853--2862.  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Clara Crivellaro, Alex Taylor, Vasillis Vlachokyriakos, Rob Comber, Bettina Nissen, and Peter Wright. 2016. Re-Making Places. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, 2958--2969.  ",
      "doi": "10.1145/2858036.2858332"
    },
    {
      "text": "Christopher A. Le Dantec, Mariam Asad, Aditi Misra, and Kari E. Watkins. 2015. Planning with Crowdsourced Data. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, 1717--1727.  ",
      "doi": "10.1145/2675133.2675212"
    },
    {
      "text": "Christopher Le Dantec. 2012. Participation and publics. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, 1351--1360.  ",
      "doi": "10.1145/2207676.2208593"
    },
    {
      "text": "DCLG Department for Communities and Local Government. 2011. Localism Act. Local Government Association, Local Government House, Smith Square, London, SW1P 3HZ, 020 7664 3000, http://www.local.gov.uk, info@local.gov.uk.",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos and Mor Naaman. 2011. Towards quality discourse in online news comments. In Proceedings of the ACM 2011 conference on Computer supported cooperative work CSCW '11, 133.  ",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, Tanyoung Kim, Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, 2397--2406.  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "2James Fearon. 2000. Deliberation as Discussion. In Deliberative Democracy, Jon Elster (ed.). Cambridge University Press, Cambridge, 44--69.",
      "doi": ""
    },
    {
      "text": "2Frank Fischer. 2006. Participatory Governance as Deliberative Empowerment: The Cultural Politics of Discursive Space. The American Review of Public Administration 36, 1: 19--40.",
      "doi": ""
    },
    {
      "text": "Bent Flyvbjerg. 1998. Rationality and Power: Democracy in Practice. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Archon Fung. 2008. Minipublics: Deliberative Designs and Their Consequences. In Can the People Govern? Deliberation, Participation and Democracy, Shawn W. Rosenberg (ed.). Palgrave Macmillan, NY, 159--183.",
      "doi": ""
    },
    {
      "text": "Archon Fung and Erik Olin Wright. 2003. Thinking about empowered participatory governance. Deepening Democracy: Institutional Innovations in Empowered Participatory Governance: 3--42.",
      "doi": ""
    },
    {
      "text": "Sarah Gallacher, Connie Golsteijn, Lorna Wall, Lisa Koeman, Sami Andberg, Licia Capra, and Yvonne Rogers. 2015. Getting quizzical about physical. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '15, 263--273.  ",
      "doi": "10.1145/2750858.2807529"
    },
    {
      "text": "Connie Golsteijn, Sarah Gallacher, Licia Capra, and Yvonne Rogers. 2016. Sens-Us. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems DIS '16, 39--49.  ",
      "doi": "10.1145/2901790.2901877"
    },
    {
      "text": "Eric Gordon, Becky E. Michelson, and Jason Haas. 2016. @Stake: A Game to Facilitate the Process of Deliberative Democracy. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion CSCW '16 Companion, 269--272.  ",
      "doi": "10.1145/2818052.2869125"
    },
    {
      "text": "Amy Gutmann and Dennis Thompson. 2009. Why Deliberative Democracy? Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Mike Harding, Bran Knowles, Nigel Davies, and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 2833--2842.  ",
      "doi": "10.1145/2702123.2702255"
    },
    {
      "text": "3Gerard A. Hauser and Chantal Benoit-Barne. 2002. Reflections on Rhetoric, Deliberative Democracy, Civil Society, and Trust. Rhetoric & Public Affairs 5, 2: 261--275.",
      "doi": ""
    },
    {
      "text": "3Jens Villiam Hoff, Henrick Bang, and Katinka Hauxner. 2001. Bydelsrådene i København: En synkende skude lastet med nærdemokratiske udfordringer. Kbh.: Center for offentlig organisation og styring. 1.",
      "doi": ""
    },
    {
      "text": "3Craig. Johnson. 2003. Decentralisation in India: poverty, politics and Panchayati Raj. London: Overseas Development Institute.",
      "doi": ""
    },
    {
      "text": "Ian G. Johnson, John Vines, Nick Taylor, Edward Jenkins, and Justin Marshall. 2016. Reflections on Deploying Distributed Consultation Technologies with Community Organisations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, 2945--2957.  ",
      "doi": "10.1145/2858036.2858098"
    },
    {
      "text": "Juho Kim, Eun-Young Ko, Jonghyuk Jung, Chang Won Lee, Nam Wook Kim, and Jihee Kim. 2015. Factful. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 2843--2852.  ",
      "doi": "10.1145/2702123.2702352"
    },
    {
      "text": "Juho Kim, Eun-Young Ko, Jonghyuk Jung, Chang Won Lee, Nam Wook Kim, and Jihee Kim. 2015. Factful. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 2843--2852.  ",
      "doi": "10.1145/2702123.2702352"
    },
    {
      "text": "3Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. \"Everyone Is Talking about It!\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 3127--3136.  ",
      "doi": "10.1145/2702123.2702263"
    },
    {
      "text": "3Seunghyun \"Tina\" Lee, Yilin Elaine Liu, Ljilja Ruzic, and Jon Sanford. 2016. Universal Design Ballot Interfaces on Voting Performance and Satisfaction of Voters with and without Vision Loss. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, 4861--4871.  ",
      "doi": "10.1145/2858036.2858567"
    },
    {
      "text": "3Cristiano Maciel, Licínio Roque, and Ana Cristina Bicharra Garcia. 2009. Democratic citizenship community: a social network to promote e-deliberative process. In Proceedings from the 10th Digital Government Society of North America, 25--34. ",
      "doi": "10.5555/1556176.1556187"
    },
    {
      "text": "Jane Mansbridge. 1999. Everyday talk in the deliberative system. In Deliberative Politics: Essays on Democracy and Disagreement., Stephen Macedo (ed.). Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "4Jane Mansbridge, James Bohman, Simone Chambers, Thomas Christiano, Archon Fung, John Parkinson, Dennis Thompson, and Mark E Warren. 2012. A systemic approach to deliberative democracy. In Deliberative Systems: Deliberative Democracy at the Large Scale, John Parkinson and Jane Mansbridge (eds.). Cambridge University Press, Cambridge, 1--26.",
      "doi": ""
    },
    {
      "text": "4Matthew Marshall, David S. Kirk, and John Vines. 2016. Accountable. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, 1620--1631.  ",
      "doi": "10.1145/2858036.2858301"
    },
    {
      "text": "4Donald McMillan, Arvid Engström, Airi Lampinen, and Barry Brown. 2016. Data and the City. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, 2933--2944.  ",
      "doi": "10.1145/2858036.2858434"
    },
    {
      "text": "4Giles Moss and Stephen Coleman. 2013. Deliberative Manoeuvres in the Digital Darkness: e-Democracy Policy in the UK. The British Journal of Politics & International Relations 16: 410--427.",
      "doi": ""
    },
    {
      "text": "4Andreas Novy and Bernhard Leubolt. 2005. Participatory budgeting in Porto Alegre: Social innovation and the dialectical relationship of state and civil society. Urban Studies 42, 11: 2023--2036.",
      "doi": ""
    },
    {
      "text": "4Alenka Poplin. 2012. Playful public participation in urban planning: A case study for online serious games. Computers, Environment and Urban Systems 36, 3: 195--206.",
      "doi": ""
    },
    {
      "text": "4Lee Rainie and Aaron Smith. 2012. Politics on social networking sites. Pew Internet and American Life Project.",
      "doi": ""
    },
    {
      "text": "4Sunil Rodger, John Vines, and Janice McLaughlin. 2016. Technology and the Politics of Mobility. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16, 2417--2429.  ",
      "doi": "10.1145/2858036.2858146"
    },
    {
      "text": "4Joanna Saad-Sulonen. 2012. The Role of the Creation and Sharing of Digital Media Content in Participatory E-Planning. International Journal of E-Planning Research 1, 2: 1--22.",
      "doi": ""
    },
    {
      "text": "Joanna Saad-Sulonen and Liisa Horelli. 2010. The value of Community Informatics to participatory urban planning and design: a case-study in Helsinki. The Journal of Community Informatics 6, 2.",
      "doi": ""
    },
    {
      "text": "5Michael Saward. 2008. Representation and Democracy: Revisions and Possibilities. Sociology Compass 2, 3: 1000--1013.",
      "doi": ""
    },
    {
      "text": "5Michael Saward. 2008. Making Representations: Modes and Strategies of Political Parties. European Review 16, 3: 271--286.",
      "doi": ""
    },
    {
      "text": "5Sabrina Scherer and Maria A. Wimmer. 2014. Trust in e-participation. In Proceedings of the 8th International Conference on Theory and Practice of Electronic Governance - ICEGOV '14, 61--70.  ",
      "doi": "10.1145/2691195.2691237"
    },
    {
      "text": "5Ronald Schroeter. 2012. Engaging new digital locals with interactive urban screens to collaboratively improve the city. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, 227.  ",
      "doi": "10.1145/2145204.2145239"
    },
    {
      "text": "5Ronald Schroeter. 2012. Engaging new digital locals with interactive urban screens to collaboratively improve the city. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work CSCW '12, 227.  ",
      "doi": "10.1145/2145204.2145239"
    },
    {
      "text": "5Bryan C. Semaan, Scott P. Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, 1409--1421.  ",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "5Bryan C. Semaan, Scott P. Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing CSCW '14, 1409--1421.  ",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "5Bryan Semaan, Heather Faucett, Scott Robertson, Misa Maruyama, and Sara Douglas. 2015. Navigating Imagined Audiences. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15, 1158--1169.  ",
      "doi": "10.1145/2675133.2675187"
    },
    {
      "text": "5Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama, and Sara Douglas. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 3167--3176.  ",
      "doi": "10.1145/2702123.2702403"
    },
    {
      "text": "Keith Shaw and Mark Tewdwr-Jones. 2016. \"Disorganised Devolution\": Reshaping Metropolitan Governance in England in a Period of Austerity. Raumforschung und Raumordnung: 1--14.",
      "doi": ""
    },
    {
      "text": "6Marco R Steenbergen, André Bächtiger, Markus Spörndli, and Jürg Steiner. 2003. Measuring Political Deliberation: A Discourse Quality Index. Comparative European Politics 1, 1: 21--48.",
      "doi": ""
    },
    {
      "text": "6Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15, 2863--2872.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "6Nick Taylor, Justin Marshall, Alicia Blum-Ross, John Mills, Jon Rogers, Paul Egglestone, David M. Frohlich, Peter Wright, and Patrick Olivier. 2012. Viewpoint. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12, 1361.",
      "doi": ""
    },
    {
      "text": "6Vasilis Vlachokyriakos, Rob Comber, Karim Ladha, Nick Taylor, Paul Dunphy, Patrick McCorry, and Patrick Olivier. 2014. PosterVote: Expanding the Action Repertoire for Local Political Activism. In Proceedings of the 2014 conference on Designing interactive systems DIS '14, 795--804.  ",
      "doi": "10.1145/2598510.2598523"
    },
    {
      "text": "6Vasilis Vlachokyriakos, Paul Dunphy, Nick Taylor, Rob Comber, and Patrick Olivier. 2014. BallotShare: An exploration of the design space for digital voting in the workplace. Computers in Human Behavior 41: 433--443.  ",
      "doi": "10.1016/j.chb.2014.04.024"
    },
    {
      "text": "6Poornima Vyasulu and Vinod Vyasulu. 1999. Women in Panchayati Raj: Grass Roots Democracy. Economic and Political Weekly 34, 52: 3677--3686.",
      "doi": ""
    },
    {
      "text": "6C. W. Watson. 1999. Being There: Fieldwork in Anthropology. Pluto Press.",
      "doi": ""
    },
    {
      "text": "6Lu Xiao, Weiyu Zhang, Anna Przybylska, Anna De Liddo, Gregorio Convertino, Todd Davies, and Mark Klein. 2015. Design for Online Deliberative Processes and Technologies. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems CHI EA '15, 865--8  ",
      "doi": "10.1145/2702613.2727687"
    }
  ]
}