{
  "doi": "10.1145/3025453.3025572",
  "title": "Internet Search Roles of Adults in their Homes",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4948-4959",
  "year": 2017,
  "badges": [],
  "abstract": "Internet search is one of the major activities that American adults engage in online. Building on studies of youth Internet search roles, this paper investigates adults' online information seeking processes within the home. Through in-home interviews and observations of search task performance with 40 adult participants, we identify and describe characteristics of 9 search roles. By comparing these roles with those of youths, we explain how previously identified roles, such as Power Searcher and Social Searcher, have evolved in adult populations, and how new roles, such as Efficient Searcher and Interest-driven Searcher, have emerged. We also review the challenges and benefits associated with search roles and their potential impacts on search performance. The findings of this study provide a better understanding of how contextual factors influence search roles in relation to ELIS, what can be learned from search roles, and opportunities to support different search roles.",
  "tags": [
    "home internet search",
    "everyday life information seeking",
    "search strategies",
    "search roles",
    "adult searchers"
  ],
  "authors": [
    {
      "name": "Jinyoung Kim",
      "institution": "University of Maryland, College Park & Seoul National University, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502745529",
      "orcid": "missing"
    },
    {
      "name": "Brenna McNally",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81484654291/rel-imgonly/dsc_0056edit-full_small_squareish.jpg",
      "acmid": "81484654291",
      "orcid": "missing"
    },
    {
      "name": "Leyla Norooz",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-82259251157/rel-imgonly/img_20140309_190317.jpg",
      "acmid": "82259251157",
      "orcid": "missing"
    },
    {
      "name": "Allison Druin",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paul André, m.c. schraefel, Jamie Teevan, and Susan T. Dumais. 2009. Discovery is never by chance: Design for (un)serendipity. In Proceedings of the 7th ACM Conference on Creativity and Cognition (C&C '09). 305--314.  ",
      "doi": "10.1145/1640233.1640279"
    },
    {
      "text": "Carl Auerbach and Louise B. Silverstein. 2003. Qualitative Data: An Introduction to Coding and Analysis. NYU Press.",
      "doi": ""
    },
    {
      "text": "Anne Aula, Rehan M. Khan, and Zhiwei Guan. 2010. How does search behavior change as search becomes more difficult? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). 35--44.  ",
      "doi": "10.1145/1753326.1753333"
    },
    {
      "text": "Paul Bennett, Alexander Fishkov, and Emre Kiciman. 2015. Persona-ization: Searching on behalf of others. In SIGIR 2015 International Workshop on Social Personalisation & Search (SPS'15).",
      "doi": ""
    },
    {
      "text": "Dania Bilal and Joe Kirby. 2002. Differences and similarities in information seeking: Children and adults as Web users. Information Processing & Management, 38(5), 649--670.  ",
      "doi": "10.1016/S0306-4573%2801%2900057-7"
    },
    {
      "text": "Donald O. Case. 2007. Looking for Information: A Survey of Research on Information Seeking, Needs, and Behavior. Elsevier/Academic Press.",
      "doi": ""
    },
    {
      "text": "Chun Wei Choo, Brian Detlor, and Dan Turnbull. 2000. Information seeking on the Web: An integrated model of browsing and searching. First Monday, 5(2).",
      "doi": ""
    },
    {
      "text": "Allison Druin, Elizabeth Foss, Hilary Hutchinson, Evan Golub, and Leshell Hatley. 2010. Children's roles using keyword search interfaces at home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). 413--422.  ",
      "doi": "10.1145/1753326.1753388"
    },
    {
      "text": "Robert W. Fairlie. 2012. The effects of home access to technology on computer skills: Evidence from a field experiment. Information Economics and Policy, 24, 243--253.",
      "doi": ""
    },
    {
      "text": "Raya Fidel. 1991. Searchers' Selection of Search Keys: III. Searching Styles. Journal of the American Society for Information Science and Technology, 42(7), 515--527.",
      "doi": ""
    },
    {
      "text": "Karen E. Fisher and Charles M. Naumer. 2006. Information grounds: Theoretical basis and empirical findings on information flow in social settings. In New directions in human information behavior, Amanda Spink and Charles Cole (eds.). Springer, Dordrecht, Netherlands, 93--111.",
      "doi": ""
    },
    {
      "text": "Elizabeth Foss. 2014. Internet Searching in Children and Adolescents: A Longitudinal Framework of Youth Search Roles. Ph.D. dissertation, University of MD, College Park, MD.",
      "doi": ""
    },
    {
      "text": "Elizabeth Foss and Allison Druin. 2014. Children's Internet Search: Using Roles to Understand Children's Search Behavior. Morgan & Claypool Publishers.",
      "doi": ""
    },
    {
      "text": "Elizabeth Foss, Allison Druin, Robin Brewer, Phillip Lo, Luis Sanchez, Evan Golub, and Hilary Hutchinson. 2012. Children's search roles at home: Implications for designers, researchers, educators, and parents. Journal of the American Society for Information Science and Technology, 63(3), 558--573.  ",
      "doi": "10.1002/asi.21700"
    },
    {
      "text": "Elizabeth Foss, Allison Druin, Jason Yip, Whitney Ford, Evan Golub, and Hilary Hutchinson. 2013. Adolescent search roles. Journal of the American Society for Information Science and Technology, 64(1), 173--189.  ",
      "doi": "10.1002/asi.22809"
    },
    {
      "text": "Nigel Ford, Barry Eaglestone, Andrew Madden, and Martin Whittle. 2009. Web searching by the \"general public\": An individual differences perspective. Journal of Documentation, 65(4), 632--667.",
      "doi": ""
    },
    {
      "text": "Eric Gleave, Howard T. Welser, Thomas M. Lento, and Marc A. Smith. 2009. A conceptual and operational definition of 'social role' in online community. In Proceedings of the 42nd Hawaii International Conference on System Sciences (HICSS'09).  ",
      "doi": "10.1109/HICSS.2009.6"
    },
    {
      "text": "Elisheva F. Gross. 2004. Adolescent Internet use: What we expect, what teens report. Journal of Applied Developmental Psychology, 25(6), 633--649.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai. 2002. Second-level digital divide: Differences in people's online skills. First Monday, 7(4).",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Amanda Hinnant, A. 2005. Toward a social framework for information seeking. In New Directions in Human Information Behavior. Edited by Amanda Spink and Charles Cole. NY: Springer. 55--70.",
      "doi": ""
    },
    {
      "text": "Jannica Heinström. 2005. Fast surfing, broad scanning and deep diving: The influence of personality and study approach on students' information-seeking behavior. Journal of Documentation, 61 (2), 228--247",
      "doi": ""
    },
    {
      "text": "John B. Horrigan and Maeve Duggan. 2015. Home Broad Band 2015. Pew Research Center's Internet & American Life Project, WA, DC.",
      "doi": ""
    },
    {
      "text": "Ingrid Hsieh-Yee. 2001. Research on Web search behavior. Library & Information Science Research, 23(2), 167--185.",
      "doi": ""
    },
    {
      "text": "Bernard J. Jansen and Amanda Spink. 2006. How are we searching the world wide web? A comparison of nine search engine transaction logs. Information Processing and Management, 42(1), 248--263.  ",
      "doi": "10.5555/1138797.1710819"
    },
    {
      "text": "Bryan Kalms. 2008. Household information practices: How and why householders process and manage information. Information Research, 13(1).",
      "doi": ""
    },
    {
      "text": "Melanie Kellar, Carolyn Watters, and Michael Shepherd. 2007. A field study characterizing webbased information-seeking tasks. Journal of the American Society for Information Science and Technology, 58(7), 999--1018.  ",
      "doi": "10.5555/1241540.1241550"
    },
    {
      "text": "Jeonghyun Kim. 2009. Describing and predicting information-seeking behavior on the web. Journal of the American Society for Information Science and Technology, 60(4), 679--693.  ",
      "doi": "10.5555/1526645.1526663"
    },
    {
      "text": "Meredith Ringel Morris. 2013. Collaborative search revisited. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). 1181--1192.  ",
      "doi": "10.1145/2441776.2441910"
    },
    {
      "text": "Young Park and John B. Black. 2007. Identifying the impact of domain knowledge and cognitive style on web-based information search behavior. Journal of Educational Computing Research, 36(1), 15--37.",
      "doi": ""
    },
    {
      "text": "Karen E. Pettigrew. 1999. Waiting for chiropody: contextual results from an ethnographic study of the information behaviour among attendees at community clinics. Information Processing & Management, 35(6), 801--817.  ",
      "doi": "10.1016/S0306-4573%2899%2900027-8"
    },
    {
      "text": "Pew Research Center. 2010. Millennials: Confident. Connected. Open to Change. Pew Research Center's Social & Demographic Trends Project, WA, DC.",
      "doi": ""
    },
    {
      "text": "Kristen Purcell, Joanna Brenner, and Lee Rainie. 2012. Search Engine Use 2012. Pew Research Center's Internet & American Life Project, WA, DC.",
      "doi": ""
    },
    {
      "text": "Tye Rattenbury, Dawn Nafus, and ken anderson. 2008. Plastic: A metaphor for integrated technologies. In Proceedings of Ubiquotous Computing (UbiComp '08). 232--241.  ",
      "doi": "10.1145/1409635.1409667"
    },
    {
      "text": "Soo Young Rieh. 2004. On the web at home: Information seeking and Web searching in the home environment. Journal of The American Society for Information Science and Technology, 55(8), 743--753.  ",
      "doi": "10.1002/asi.20018"
    },
    {
      "text": "Johnny Saldana. 2012. The Coding Manual for Qualitative Researchers. SAGE.",
      "doi": ""
    },
    {
      "text": "Reijo Savolainen. 1995. Everyday Life Information Seeking: Approaching Information Seeking in the Context of \"Way of Life.\" Library & Information Science Research, 17(3), 259--294.",
      "doi": ""
    },
    {
      "text": "Reijo Savolainen. 2007. Information behaviour and information practice: reviewing the \"umbrella concepts\" of information-seeking studies. Library Quarterly, 77(2), 109--132.",
      "doi": ""
    },
    {
      "text": "Debra J. Slone. 2003. Internet search approaches: The influence of age, search goals, and experience. Library & Information Science Research, 25(4), 403--418.",
      "doi": ""
    },
    {
      "text": "Amanda Spink and Charles Cole. 2001. Introduction to the special issue: Everyday life information-seeking research. Library & Information Science Research, 23, 301--304.",
      "doi": ""
    },
    {
      "text": "Amanda Spink, Howard Greisdorf, and Judy Bateman. 1998. From highly relevant to not relevant: Examining different regions of relevance. Information Processing and Management, 34(5), 599--621.  ",
      "doi": "10.1016/S0306-4573%2898%2900025-9"
    },
    {
      "text": "Beth St. Jean, Soo Young Rieh, Young-Mi Kim, and Ji Yeon Yang. 2012. An analysis of the information behaviors, goals, and intentions of frequent Internet users: Findings from online activity diaries. First Monday, 17(2).",
      "doi": ""
    },
    {
      "text": "Alexander JAM van Deursen and Jan AGM van Dijk. 2010. Internet skills and the digital divide. New Media & Society, 13(6), 893--911.",
      "doi": ""
    },
    {
      "text": "Alladi Venkatesh. 1996. Computers and other interactive technologies for the home. Communications of the ACM, 39(12), 47--54.  ",
      "doi": "10.1145/240483.240491"
    },
    {
      "text": "Alladi Venkatesh, Norman Stolzoff, Eric Shih, and Sanjoy Mazumdar. 2001. The home of the future: An ethnographic study of new information technologies in the home. Advances in Consumer Research, 28(1), 8897.",
      "doi": ""
    },
    {
      "text": "Rong Wang, Suzanne M. Bianchi, Sara B. Raley. 2005. Teenagers? Internet use and family rules: A research note. Journal of Marriage and Family, 67(5), 12491258.",
      "doi": ""
    },
    {
      "text": "Ryen W. White and Steven M. Drucker. 2007. Investigating behavioral variability in web search. In Proceedings of the 16th International Conference on World Wide Web (WWW '07). 21--30.  ",
      "doi": "10.1145/1242572.1242576"
    }
  ]
}