{
  "doi": "10.1145/3025453.3025621",
  "title": "Conversational Chat Circles: Being All Here Without Having to Hear It All",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2394-2404",
  "year": 2017,
  "badges": [],
  "abstract": "Live streaming services are a growing form of social media. Most live streaming platforms allow viewers to communicate with each other and the broadcaster via a text chat. However, interaction in a text chat does not work well with too many users. Existing techniques to make text chat work with a larger number of participants often limit who can participate or how much users can participate. In this paper, we describe a new design for a text chat system that allows more people to participate without overwhelming users with too many messages. Our design strategically limits the number of messages a user sees based on the concept of neighborhoods, and emphasizes important messages through upvoting. We present a study comparing our system to a chat system similar to those found in commercial streaming services. Results of the study indicate that the Conversational Circle system is easier to understand and interact with, while supporting community among viewers and highlighting important content for the streamer.",
  "authors": [
    {
      "name": "Matthew K. Miller",
      "institution": "Microsoft Research & University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958615957",
      "orcid": "missing"
    },
    {
      "name": "John C. Tang",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81405592014/rel-imgonly/johntang_v2_cropped.jpg",
      "acmid": "81405592014",
      "orcid": "0000-0003-0603-3877"
    },
    {
      "name": "Gina Venolia",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100190815/rel-imgonly/ginav.jpg",
      "acmid": "81100190815",
      "orcid": "missing"
    },
    {
      "name": "Gerard Wilkinson",
      "institution": "Microsoft Resaerch & Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659021633/rel-imgonly/171423ad995c010ec17eddb1ec24e4ce.jpeg",
      "acmid": "99659021633",
      "orcid": "missing"
    },
    {
      "name": "Kori Inkpen",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    }
  ],
  "references": [
    {
      "text": "Jonathan Bishop. 2007. Increasing participation in online communities: A framework for human-- computer interaction. Computers in Human Behavior. 23 (2007), 1881--1893.  ",
      "doi": "10.1016/j.chb.2005.11.004"
    },
    {
      "text": "Susan E. Brennan. 1998. The Grounding Problem in Conversations With and Through Computers. In Social and cognitive psychological approaches to interpersonal communication. S. R. Fussell and R. J. Kreuz (Eds.) Lawrence Erlbaum, Hillsdale, NJ, pp. 201--225.",
      "doi": ""
    },
    {
      "text": "Arvid Engström, Mark Perry, and Oskar Juhlin. 2012. Amateur vision and recreational orientation: Creating live video together. In Proceedings of the SIGCHI conference on Computer Supported Cooperative Work (CSCW 2012), 651--660. http://doi.acm.org/10.1145/2145204.2145304",
      "doi": "10.1145/2145204.2145304"
    },
    {
      "text": "Baldo Faieta, Bernardo Huberman, and Paul Verhaeghe. 2006. Scalable online discussions as listening technology. In Proceedings of the 39th Annual Hawaii International Conference on System Sciences (HICSS'06), 15c-15c. http://doi.org/10.1109/HICSS.2006.427  ",
      "doi": "10.1109/HICSS.2006.427"
    },
    {
      "text": "Andy Field. 2013. Discovering statistics using IBM SPSS statistics. Sage.",
      "doi": "10.5555/2502692"
    },
    {
      "text": "Elodie Fichet, John Robinson, Dharma Daily, and Kate Starbird. 2016. Eyes on the Ground: Emerging Practices in Periscope Use during Crisis Events. In Proceedings of the 13th Annual Conference for Information Systems for Crisis Response and Management (ISCRAM 2016)",
      "doi": ""
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering participatory communities of play within live mixed media. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI 2014), 1315--1324. http://doi.acm.org/10.1145/2556288.2557048",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "William A. Hamilton, John C. Tang, Gina Venolia, Kori Inkpen, Jakob Zillner, and Derek Huang. 2016. Rivulet: Exploring Participation in Live Events through Multi-Stream Experiences. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX 2016), 31--42. http://doi.acm.org/10.1145/2932206.2932211",
      "doi": "10.1145/2932206.2932211"
    },
    {
      "text": "Brian McInnis and Gilly Leshed 2016. Running user studies with crowd workers. interactions. 23(5), 50--53. http://dx.doi.org/10.1145/2968077  ",
      "doi": "10.1145/2968077"
    },
    {
      "text": "Gustavo Nascimento, Manoel Ribeiro, Loic Cerf, Natalia Cesario, Mehdi Kaytoue, Chedy Raissi, Thiago Vasconcelos, Wagner Meira. 2014. Modeling and Analyzing the Video Game Live-Streaming Community. In Proceedings of the 9th Latin American Web Congress (LA-WEB 2014), 1--9. http://doi.ieeecomputersociety.org/10.1109/LAWeb.20 14.9",
      "doi": "10.1109/LAWeb.2014.9"
    },
    {
      "text": "Tasneem Nashrulla. 2016. We Blew Up A Watermelon And Everyone Lost Their Freaking Minds. (8 April 2016). Retrieved September 8, 2016 from https://www.buzzfeed.com/tasneemnashrulla/we-blewup-a-watermelon-and-everyone-lost-their-freaking-min",
      "doi": ""
    },
    {
      "text": "Frank Palotta. 2016. Trump Tower climber keeps media networks hanging on live. (10 August 2016). Retrieved August 17, 2016 from http://www.crossroadstoday.com/story/32732450/trum p-tower-climber-keeps-media-networks-hanging-onlive",
      "doi": ""
    },
    {
      "text": "Jenny Preece, Blair Nonnecke, and Dorine Andrews. 2004. The top five reasons for lurking: Improving community experiences for everyone. Computers in Human Behavior. 20 (2004), 201--223. ",
      "doi": ""
    },
    {
      "text": "Stuart Reeves, Christian Greiffenhagen, Martin Flintham, Steve Benford, Matt Adams, Ju Row-Farr, Nick Tandavanitj. 2015. I'd Hide You: Performing Live Broadcasting in Public. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI 2015), 2573--2582. http://doi.acm.org/10.1145/2702123.2702257",
      "doi": "10.1145/2702123.2702257"
    },
    {
      "text": "Martin Saveski, Sophie Chou, and Deb Roy. 2016. Tracking the Yak: An Empirical Study of Yik Yak. In Proceedings of the Tenth International AAAI Conference on Web and Social Media (ICWSM 2016), 671--674.",
      "doi": ""
    },
    {
      "text": "John C. Tang, Gina Venolia, and Kori Inkpen. 2016. Meerkat and Periscope: I Stream, You Stream, Apps Stream for Live Streams. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI 2016), 4770--4780. http://doi.acm.org/10.1145/2858036.2858374",
      "doi": "10.1145/2858036.2858374"
    },
    {
      "text": "Bogdan Vasilescu, Alexander Serebrenik, Prem Devanbu, Vladimir Filkov. 2014. How social Q&A sites are changing knowledge sharing in open source software communities. In Proceedings of the ACM conference on Computer Supported Cooperative Work (CSCW 2014), 342--354. http://doi.acm.org/10.1145/2531602.2531659",
      "doi": "10.1145/2531602.2531659"
    },
    {
      "text": "David Vronay, Marc Smith, and Steven Drucker. 1999. Alternative Interfaces for Chat. In Proceedings of the 12th annual ACM symposium on User interface software and technology (UIST 1999), 19--26. http://doi.acm.org/10.1145/320719.322579",
      "doi": "10.1145/320719.322579"
    },
    {
      "text": "Justin D. Weisz, Sara Kiesler, Hui Zhang, Yuqing Ren, Robert E. Kraut, and Joseph A. Konstan. 2007. Watching together: Integrating text chat with video. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI 2007), 877--886. http://doi.acm.org/10.1145/1240624.1240756",
      "doi": "10.1145/1240624.1240756"
    }
  ]
}