{
  "doi": "10.1145/3025453.3025924",
  "title": "AlterNail: Ambient, Batteryless, Stateful, Dynamic Displays at your Fingertips",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6754-6759",
  "year": 2017,
  "badges": [],
  "abstract": "Beyond phones, watches, and activity tracking devices, a new ecosystem of functional and fashionable wearable technologies can easily, safely, and economically be designed, prototyped, and integrated directly on the body. In this paper, we present AlterNail, a fingernail form factor, ambient, low-power, stateful, wireless, dynamic display with onboard vibrational sensing. AlterNail integrates a batteryless design using inductive coupling with e-ink technology to enable both quick dynamic and long-term static fingernail based visual designs without the need for power. We also detail the use of simple vibrational signals to uniquely identify everyday objects as they are handled using AlterNails. The intentionally limited interactional functionality of AlterNails, coupled with the rich personal and dynamic expressive potential, combine to present a compelling range of opportunities for designers of new interactive wearable technologies. We detail a range of practical and playful applications using this technology.",
  "tags": [
    "wearables",
    "ambient devices",
    "cosmetic computing",
    "fingernails"
  ],
  "authors": [
    {
      "name": "Christine Dierk",
      "institution": "University of California, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659022124/rel-imgonly/252295_10151135082961437_1588434457_n.jpg",
      "acmid": "99659022124",
      "orcid": "0000-0001-5456-8126"
    },
    {
      "name": "Tomás Vega Gálvez",
      "institution": "University of California, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659036052/rel-imgonly/img_3167.jpg",
      "acmid": "99659036052",
      "orcid": "missing"
    },
    {
      "name": "Eric Paulos",
      "institution": "University of California, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "2015. Wearable Usage Will Grow by Nearly 60% This Year. (2015). http://www.emarketer.com/Article/ Wearable-Usage-Will-Grow-by-Nearly-60-This-Year/ 1013159 {Online; posted 28-October-2015}.",
      "doi": ""
    },
    {
      "text": "2016. Pokemon Go. (2016). http://www.pokemongo.com/",
      "doi": ""
    },
    {
      "text": "2016. Ringly. (2016). https://ringly.com/",
      "doi": ""
    },
    {
      "text": "2016. Snapchat. (2016). https://www.snapchat.com/",
      "doi": ""
    },
    {
      "text": "2016. Takara Tomy A.R.T.S. (2016). http://www.takaratomy-arts.co.jp/specials/lumideco/",
      "doi": ""
    },
    {
      "text": "Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, Kai-Yin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen. 2013. FingerPad: private and subtle interaction using fingertips. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 1461--1464.  ",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Masaaki Fukumoto and Yasuhito Suenaga. 1994. \"FingeRing\": a full-time wearable interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 81--82.  ",
      "doi": "10.1145/259963.260056"
    },
    {
      "text": "E ink Corporation. 2012a. E Ink Segmented Displays: Evaluation Guide Version 2.0. (September 2012). http://www.eink.com/sell_sheets/segmented_evaluation_guide.pdf",
      "doi": ""
    },
    {
      "text": "E ink Corporation. 2012b. E Ink Segmented Displays: Prototype Display Design Rules Version 2.0. (Spring 2012). http://www.eink.com/sell_sheets/segmented_design_rules.pdf",
      "doi": ""
    },
    {
      "text": "Oskar Juhlin. 2015. Digitizing fashion: software for wearable devices. Interactions 22, 3 (2015), 44--47.  ",
      "doi": "10.1145/2754868"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Artem Dementyev, Joseph A. Paradiso, and Chris Schmandt. 2015. NailO: Fingernails as an Input Surface. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3015--3018.  ",
      "doi": "10.1145/2702123.2702572"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin: rapidly prototyping on-skin user interfaces using skin-friendly materials. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (ISWc '16). ACM, New York, NY, USA, 16--23.  ",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Jayong Kim, Thomas N. Cho, Gabriela Valdés-Ramírez, and Joseph Wang. 2016. A wearable fingernail chemical sensing platform: pH sensing at your fingertips. Talanta 150 (April 2016), 622--628.",
      "doi": ""
    },
    {
      "text": "John Kymissis, Clyde Kendall, Joseph Paradiso, and Neil Gershenfeld. 1998. Parasitic Power Harvesting in Shoes. In Proceedings of the 2nd IEEE International Symposium on Wearable Computers (ISWC '98). IEEE Computer Society, Washington, DC, USA, 132. http://dl.acm.org/citation.cfm?id=858024 ",
      "doi": "10.5555/857199.858024"
    },
    {
      "text": "Joanne Lo, Doris Jung Lin Lee, Nathan Wong, David Bui, and Eric Paulos. 2016. Skintillates: Designing and Creating Epidermal Interactions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 853--864.  ",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Deb Miller Landau. 2014. Smart Gloves from ProGlove Let Your Fingers do the Talking. (October 2014). https://iq.intel.com/smart-gloves-let-fingers-talking/ {Online; posted 20-October-2014}.",
      "doi": ""
    },
    {
      "text": "Lauren K. Ohnesorge. 2014. The latest weapon in the fight against date rape drugs? Nail polish. (August 2014). http://www.bizjournals.com/triangle/bizwomen/news/out-of-the-office/2014/08/the-latest-weapon-in-the-fight-against-daterape. html {Online; posted 26-August-2014}.",
      "doi": ""
    },
    {
      "text": "Kristina Oretega and Jenny Rodenhouse. 2014. Sensor Salon. (2014). http://cargocollective.com/futureofwearableservices",
      "doi": ""
    },
    {
      "text": "Aaron N. Parks, Alanson P. Sample, Yi Zhao, and Joshua R. Smith. 2013. A Wireless Sensing Platform Utilizing Ambient RF Energy. In Proceedings of the 2nd annual IEEE International Radio and Wireless Symposium (RWS '13). IEEE Computer Society, Washington, DC, USA, 331--333.",
      "doi": ""
    },
    {
      "text": "Babak A. Parviz. 2009. Augmented Reality in a Contact Lens. IEEE Spectrum (2009).",
      "doi": ""
    },
    {
      "text": "Eric Paulos. 2012. Energy Parasites. (2012). http://www.energyparasites.net/",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2010. Materializing Energy. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 113--122.  ",
      "doi": "10.1145/1858171.1858193"
    },
    {
      "text": "E. Rehmi Post and Margaret Orth. 1997. Smart Fabric, or \"Wearable Clothing\". In Proceedings of the 1st IEEE International Symposium on Wearable Computers (ISWC '97). IEEE Computer Society, Washington, DC, USA, 167--. http://dl.acm.org/citation.cfm?id=851036.856432 ",
      "doi": "10.5555/851036.856432"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Michael Sawh. 2016. Oyster card nails make travelling on the London Underground easier. (July 2016). http://www.wareable.com/wearable-tech/oyster-card-fingernails-for-contactless-payment-2981 {Online; posted 19-July-2016}.",
      "doi": ""
    },
    {
      "text": "Tarun Saxena and Ravi V. Bellamkonda. 2015. Implantable electronics: A sensor web for neurons. Nat Mater 14, 12 (Dec. 2015), 1190--1191.",
      "doi": ""
    },
    {
      "text": "Thad Starner, Steve Mann, Bradley Rhodes, Jeffrey Levine, Jennifer Healey, Dana Kirsch, Rosalind W Picard, and Alex Pentland. 1997. Augmented reality through wearable computing. Presence: Teleoperators and Virtual Environments 6, 4 (1997), 386--398.  ",
      "doi": "10.1162/pres.1997.6.4.386"
    },
    {
      "text": "Chao-Huai Su, Liwei Chan, Chien-Ting Weng, Rong-Hao Liang, Kai-Yin Cheng, and Bing-Yu Chen. 2013. NailDisplay: bringing an always available visual display to fingertips. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1461--1464.  ",
      "doi": "10.1145/2470654.2466193"
    },
    {
      "text": "Katia Vega and Hugo Fuks. 2014a. Beauty tech nails: interactive technology at your fingertips. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 61--64.  ",
      "doi": "10.1145/2540930.2540961"
    },
    {
      "text": "Katia Vega and Hugo Fuks. 2014b. Beauty Technology: Body Surface Computing. Computer 47, 4 (April 2014), 71--75.  ",
      "doi": "10.1109/MC.2014.81"
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2991--3000.  ",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel and Jürgen Steimle. 2013. Fingernail Displays: Handy Displays at your Fingertips. In In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 937--942.",
      "doi": ""
    },
    {
      "text": "Raphael Wimmer and Florian Echtler. 2013. Exploring the Benefits of Fingernail Displays. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 937--942.  ",
      "doi": "10.1145/2468356.2468524"
    },
    {
      "text": "Naomi Wolf. 1990. The Beauty Myth. Chatto & Windus. https://books.google.com/books?id=D0naAAAAMAAJ",
      "doi": ""
    }
  ]
}