{
  "doi": "10.1145/3025453.3025657",
  "title": "Evaluation of Korean Text Entry Methods for Smartwatches",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "722-726",
  "year": 2017,
  "badges": [],
  "abstract": "This paper presents results from a user study designed to evaluate the effectiveness of Korean text entry methods for smartwatches. Specifically, the study compares the four popular text entry methods for smartphones in the context of smartwatch use (three multi-tap 3x4 keypad methods and a QWERTY-like method). A distinctive feature of text entry in Korea is that traditionally different manufacturers have developed their own text entry methods starting with particular physical layouts on feature phones that are now available as soft keypads on smartphones. This research considers the next step in this progression by studying the viability of adopting these text entry methods on smartwatches. The results from the user study indicate that existing methods can be effective for text entry on smartwatches; analysis of the data offers suggestions for improving the effectiveness of the methods.",
  "authors": [
    {
      "name": "Ivaylo Ilinkin",
      "institution": "Gettysburg College, Gettysburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100627093",
      "orcid": "missing"
    },
    {
      "name": "Sunghee Kim",
      "institution": "Gettysburg College, Gettysburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659388954",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahmed Sabbir Arif and Ali Mazalek. 2016. A Survey of Text Entry Techniques for Smartwatches. Springer International Publishing, Cham, 255--267. DOI: http://dx.doi.org/10.1007/978-3-319-39516-6_24  ",
      "doi": "10.1007/978-3-319-39516-6_24"
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, NY, NY, USA, 251--260. DOI: http://dx.doi.org/10.1145/2371574.2371612  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Xiang 'Anthony' Chen, Tovi Grossman, and George Fitzmaurice. 2014. Swipeboard: A Text Entry Technique for Ultra-small Interfaces That Supports Novice to Expert Transitions. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, NY, NY, USA, 615--620. DOI: http://dx.doi.org/10.1145/2642918.2647354  ",
      "doi": "10.1145/2642918.2647354"
    },
    {
      "text": "Aakar Gupta and Ravin Balakrishnan. 2016. DualKey: Miniature Screen Text Entry via Finger Identification. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 59--70. DOI: http://dx.doi.org/10.1145/2858036.2858052  ",
      "doi": "10.1145/2858036.2858052"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139--183. DOI: http://dx.doi.org/10.1016/S0166-4115(08)62386-9 ",
      "doi": ""
    },
    {
      "text": "Niels Henze, Enrico Rukzio, and Susanne Boll. 2012. Observational and Experimental Investigation of Typing Behaviour Using Virtual Keyboards for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 2659--2668. DOI: http://dx.doi.org/10.1145/2207676.2208658  ",
      "doi": "10.1145/2207676.2208658"
    },
    {
      "text": "Jonggi Hong, Seongkook Heo, Poika Isokoski, and Geehyuk Lee. 2015. SplitBoard: A Simple Split Soft Keyboard for Wristwatch-sized Touch Screens. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1233--1236. DOI: http://dx.doi.org/10.1145/2702123.2702273  ",
      "doi": "10.1145/2702123.2702273"
    },
    {
      "text": "Ivaylo Ilinkin and Sunghee Kim. 2010. Evaluation of Text Entry Methods for Korean Mobile Phones, a User Study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2023--2026. DOI: http://dx.doi.org/10.1145/1753326.1753633  ",
      "doi": "10.1145/1753326.1753633"
    },
    {
      "text": "H. Kim and Kang B. 1997. Frequency analysis of Korean. Korea University Institute of Korean Culture.",
      "doi": ""
    },
    {
      "text": "Wonsup Lee, Sujin Kim, Sunghye Yoon, Jangwoon Park, Dalho Lee, Seikwon Park, Byunggil Kang, Jooho Uem, and Heecheon Yoo. 2008. Development of a comprehensive pilot workload assessment model for evaluation of helicopter cockpit design. In Proceedings of the Fall conference of the Ergonomics Society of Korea (ESK '08). 306--309.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, NY, NY, USA, 754--755. DOI: http://dx.doi.org/10.1145/765891.765971  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Stephen Oney, Chris Harrison, Amy Ogan, and Jason Wiese. 2013. ZoomBoard: A Diminutive Qwerty Soft Keyboard Using Iterative Zooming for Ultra-small Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2799--2802. DOI: http://dx.doi.org/10.1145/2470654.2481387  ",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2003. Metrics for Text Entry Research: An Evaluation of MSD and KSPC, and a New Unified Error Metric. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 113--120. DOI: http://dx.doi.org/10.1145/642611.642632  ",
      "doi": "10.1145/642611.642632"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, and Htet Htet Aung. 2004. Writing with a Joystick: A Comparison of Date Stamp, Selection Keyboard, and EdgeWrite. In Proceedings of Graphics Interface 2004 (GI '04). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 1--8. http://dl.acm.org/citation.cfm?id=1006058.1006059",
      "doi": ""
    }
  ]
}