{
  "doi": "10.1145/3025453.3025946",
  "title": "How Busy Are You?: Predicting the Interruptibility Intensity of Mobile Users",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5346-5360",
  "year": 2017,
  "badges": [],
  "abstract": "Smartphones frequently notify users about newly available messages or other notifications. It can be very disruptive when these notifications interrupt users while they are busy. Our work here is based on the observation that people usually exhibit different levels of busyness at different contexts. This means that classifying users' interruptibility as a binary status, interruptible or not interruptible, is not sufficient to accurately measure their availability towards smartphone interruptions. In this paper, we propose, implement and evaluate a two-stage hierarchical model to predict people's interruptibility intensity. Our work is the first to introduce personality traits into interruptibility prediction model, and we found that personality data improves the prediction significantly. Our model bootstraps the prediction with similar people's data, and provides a good initial prediction for users whose individual models have not been trained on their own data yet. Overall prediction accuracy of our model can reach 66.1%.",
  "authors": [
    {
      "name": "Fengpeng Yuan",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161093",
      "orcid": "missing"
    },
    {
      "name": "Xianyi Gao",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658635546",
      "orcid": "missing"
    },
    {
      "name": "Janne Lindqvist",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259030457",
      "orcid": "0000-0002-8659-2283"
    }
  ],
  "references": [
    {
      "text": "Piotr D. Adamczyk and Brian P. Bailey. 2004. If Not Now, when?: The Effects of Interruption at Different Moments Within Task Execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 271--278.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "David W. Aha, Dennis Kibler, and Marc K. Albert. 1991. Instance-Based Learning Algorithms. Mach. Learn. 6, 1 (Jan. 1991), 37--66.  ",
      "doi": "10.1023/A%3A1022689900470"
    },
    {
      "text": "Airtasker. 2017. Airtasker Application. (2017). https://www.airtasker.com.",
      "doi": ""
    },
    {
      "text": "Naomi S Altman. 1992. An introduction to kernel and nearest-neighbor nonparametric regression. The American Statistician 46, 3 (1992), 175--185.",
      "doi": ""
    },
    {
      "text": "Brian P Bailey and Joseph A Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in human behavior 22, 4 (2006), 685--708.",
      "doi": ""
    },
    {
      "text": "James \"Bo\" Begole, Nicholas E. Matsakis, and John C. Tang. 2004. Lilsys: Sensing Unavailability. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, New York, NY, USA, 511--514.  ",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "Frank Bentley. 2013. Investigating the Place Categories Where Location-Based Services Are Used. (2013).",
      "doi": ""
    },
    {
      "text": "Matthias Böhmer, Christian Lander, Sven Gehring, Duncan P. Brumby, and Antonio Krüger. 2014. Interrupted by a Phone Call: Exploring Designs for Lowering the Impact of Call Notifications for Smartphone Users. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3045--3054.  ",
      "doi": "10.1145/2556288.2557066"
    },
    {
      "text": "Chegg. 2017. Chegg Application. (2017). http://www.chegg.com.",
      "doi": ""
    },
    {
      "text": "Richard Cooper and Bradley Franks. 1993. Interruptibility as a constraint on hybrid systems. Minds and Machines 3, 1 (1993), 73--96.",
      "doi": ""
    },
    {
      "text": "Céline Coutrix and Nadine Mandran. 2012. Identifying Emotions Expressed by Mobile Users Through 2D Surface and 3D Motion Gestures. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 311--320.  ",
      "doi": "10.1145/2370216.2370265"
    },
    {
      "text": "Boele De Raad. 2000. The Big Five Personality Factors: The psycholexical approach to personality. Hogrefe & Huber Publishers.",
      "doi": ""
    },
    {
      "text": "Philippe AEG Delespaul. 1995. Assessing schizophrenia in daily life: The experience sampling method. Ph.D. Dissertation. Maastricht university.",
      "doi": ""
    },
    {
      "text": "Djellel Eddine Difallah, Gianluca Demartini, and Philippe Cudré-Mauroux. 2013. Pick-a-crowd: Tell Me What You Like, and I'll Tell You What to Do. In Proceedings of the 22nd International Conference on World Wide Web (WWW '13). ACM, New York, NY, USA, 367--374.  ",
      "doi": "10.1145/2488388.2488421"
    },
    {
      "text": "Pedro Domingos and Michael Pazzani. 1997. On the Optimality of the Simple Bayesian Classifier Under Zero-One Loss. Mach. Learn. 29, 2--3 (Nov. 1997), 103--130.  ",
      "doi": "10.1023/A%3A1007413511361"
    },
    {
      "text": "M. Brent Donnellan, Frederick L Oswald, Brendan M Baird, and Richard E Lucas. 2006. The mini-IPIP scales: tiny-yet-effective measures of the Big Five factors of personality. Psychological assessment 18, 2 (2006), 192.",
      "doi": ""
    },
    {
      "text": "Greg Dunn, Jurgen Wiersema, Jaap Ham, and Lora Aroyo. 2009. Evaluating Interface Variants on Personality Acquisition for Recommender Systems. In Proceedings of the 17th International Conference on User Modeling, Adaptation, and Personalization: Formerly UM and AH (UMAP '09). Springer-Verlag, Berlin, Heidelberg, 259--270.  ",
      "doi": "10.1007/978-3-642-02247-0_25"
    },
    {
      "text": "Joel E. Fischer, Chris Greenhalgh, and Steve Benford. 2011. Investigating Episodes of Mobile Phone Activity As Indicators of Opportune Moments to Deliver Notifications. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Joel E. Fischer, Nick Yee, Victoria Bellotti, Nathan Good, Steve Benford, and Chris Greenhalgh. 2010. Effects of Content and Time of Delivery on Receptivity to Mobile Interruptions. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 103--112.  ",
      "doi": "10.1145/1851600.1851620"
    },
    {
      "text": "Robert Fisher and Reid Simmons. 2011. Smartphone Interruptibility Using Density-Weighted Uncertainty Sampling with Reinforcement Learning. In Proceedings of the 2011 10th International Conference on Machine Learning and Applications and Workshops - Volume 01 (ICMLA '11). IEEE Computer Society, Washington, DC, USA, 436--441.  ",
      "doi": "10.1109/ICMLA.2011.128"
    },
    {
      "text": "James Fogarty and Scott E. Hudson. 2007. Toolkit Support for Developing and Deploying Sensor-based Statistical Models of Human Situations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 135--144.  ",
      "doi": "10.1145/1240624.1240645"
    },
    {
      "text": "James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. 2005a. Predicting Human Interruptibility with Sensors. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1 (March 2005), 119--146.  ",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "James Fogarty, Scott E. Hudson, and Jennifer Lai. 2004. Examining the Robustness of Sensor-based Statistical Models of Human Interruptibility. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 207--214.  ",
      "doi": "10.1145/985692.985719"
    },
    {
      "text": "James Fogarty, Andrew J. Ko, Htet Htet Aung, Elspeth Golden, Karen P. Tang, and Scott E. Hudson. 2005b. Examining Task Engagement in Sensor-based Statistical Models of Human Interruptibility. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "Foursquare. 2015. Foursquare API. (2015). https://developer.foursquare.com/.",
      "doi": ""
    },
    {
      "text": "Jerome H Friedman. 2002. Stochastic gradient boosting. Computational Statistics & Data Analysis 38, 4 (2002), 367--378.  ",
      "doi": "10.1016/S0167-9473%2801%2900065-2"
    },
    {
      "text": "Google. 2015. Google Activity Recognition API. (2015). https://developer.android.com/reference/com/google/android/gms/location/ActivityRecognitionApi.html.",
      "doi": ""
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA Data Mining Software: An Update. SIGKDD Explorations Newsletter 11, 1 (Nov. 2009), 10--18.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Rikard Harr and Victor Kaptelinin. 2012. Interrupting or Not: Exploring the Effect of Social Context on Interrupters' Decision Making. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 707--710.  ",
      "doi": "10.1145/2399016.2399124"
    },
    {
      "text": "Joel M Hektner, Jennifer A Schmidt, and Mihaly Csikszentmihalyi. 2007. Experience sampling method: Measuring the quality of everyday life. Sage.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley and Eric Horvitz. 2001. Toward More Sensitive Mobile Phones. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 191--192.  ",
      "doi": "10.1145/502348.502382"
    },
    {
      "text": "Joyce Ho and Stephen S. Intille. 2005. Using Context-aware Computing to Reduce the Perceived Burden of Interruptions from Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 909--918.  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "Eric Horvitz and Johnson Apacible. 2003. Learning and Reasoning About Interruption. In Proceedings of the 5th International Conference on Multimodal Interfaces (ICMI '03). ACM, New York, NY, USA, 20--27.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Eric Horvitz, Johnson Apacible, and Muru Subramani. 2005. Balancing Awareness and Interruption: Investigation of Notification Deferral Policies. In Proceedings of the 10th International Conference on User Modeling (UM'05). Springer-Verlag, Berlin, Heidelberg, 433--437.  ",
      "doi": "10.1007/11527886_59"
    },
    {
      "text": "Eric Horvitz, Paul Koch, and Johnson Apacible. 2004. BusyBody: Creating and Fielding Personalized Models of the Cost of Interruption. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, New York, NY, USA, 507--510.  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Scott Hudson, James Fogarty, Christopher Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny Lee, and Jie Yang. 2003. Predicting Human Interruptibility with Sensors: A Wizard of Oz Feasibility Study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 257--264.  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2006. Leveraging Characteristics of Task Structure to Predict the Cost of Interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 741--750.  ",
      "doi": "10.1145/1124772.1124882"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2008. Effects of Intelligent Notification Management on Users and Their Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/1357054.1357070"
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and Awareness: A Field Study of Alert Usage and Preferences. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 27--30.  ",
      "doi": "10.1145/1718918.1718926"
    },
    {
      "text": "Nicky Kern, Stavros Antifakos, Bernt Schiele, and Adrian Schwaninger. 2004. A Model for Human Interruptability: Experimental Evaluation and Automatic Estimation from Wearable Sensors. In Proceedings of the Eighth International Symposium on Wearable Computers (ISWC '04). IEEE Computer Society, Washington, DC, USA, 158--165.  ",
      "doi": "10.1109/ISWC.2004.3"
    },
    {
      "text": "SeungJun Kim, Jaemin Chun, and Anind K. Dey. 2015. Sensors Know When to Interrupt You in the Car: Detecting Driver Interruptibility Through Monitoring of Peripheral Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 487--496.  ",
      "doi": "10.1145/2702123.2702409"
    },
    {
      "text": "Ron Kohavi. 1995. A Study of Cross-validation and Bootstrap for Accuracy Estimation and Model Selection. In Proceedings of the 14th International Joint Conference on Artificial Intelligence - Volume 2 (IJCAI'95). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 1137--1143. http://dl.acm.org/citation.cfm?id=1643031.1643047 ",
      "doi": "10.5555/1643031.1643047"
    },
    {
      "text": "Vlaho Kostov, Takashi Tajima, Eiichi Naito, and Jun Ozawa. 2006. Analysis of appropriate timing for information notification based on indoor user's location transition. In Pervasive Computing and Communications, 2006. PerCom 2006. Fourth Annual IEEE International Conference on. IEEE, 6--pp.  ",
      "doi": "10.1109/PERCOM.2006.8"
    },
    {
      "text": "John Kruschke. 2014. Doing Bayesian data analysis: A tutorial with R, JAGS, and Stan. Academic Press.",
      "doi": ""
    },
    {
      "text": "Neal Lathia, Kiran K. Rachuri, Cecilia Mascolo, and Peter J. Rentfrow. 2013. Contextual Dissonance: Design Bias in Sensor-based Experience Sampling Methods. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 183--192.  ",
      "doi": "10.1145/2493432.2493452"
    },
    {
      "text": "Mary Kate Law, William Fleeson, Elizabeth Mayfield Arnold, and R Michael Furr. 2015. Using negative emotions to trace the experience of borderline personality pathology: Interconnected relationships revealed in an experience sampling study. Journal of Personality Disorders (2015), 1--19.",
      "doi": ""
    },
    {
      "text": "Kyungmin Lee, Jason Flinn, and Brian Noble. 2015. The Case for Operating System Management of User Attention. In Proceedings of the 16th International Workshop on Mobile Computing Systems and Applications (HotMobile '15). ACM, New York, NY, USA, 111--116.  ",
      "doi": "10.1145/2699343.2699362"
    },
    {
      "text": "Cha-Hwa Lin, Dennis McLeod, and others. 2002. Exploiting and Learning Human Temperaments for Customized Information Recommendation. In IMSA. 218--223.",
      "doi": ""
    },
    {
      "text": "Janne Lindqvist, Justin Cranshaw, Jason Wiese, Jason Hong, and John Zimmerman. 2011. I'm the Mayor of My House: Examining Why People Use Foursquare - a Social-driven Location Sharing Application. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2409--2418.  ",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "Hugo Lopez-Tovar, Andreas Charalambous, and John Dowell. 2015. Managing Smartphone Interruptions Through Adaptive Modes and Modulation of Notifications. In Proceedings of the 20th International Conference on Intelligent User Interfaces (IUI '15). ACM, New York, NY, USA, 296--299.  ",
      "doi": "10.1145/2678025.2701390"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The Cost of Interrupted Work: More Speed and Stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Santosh Mathan, Stephen Whitlow, Michael Dorneich, Patricia Ververs, and Gene Davis. 2007. Neurophysiological estimation of interruptibility: Demonstrating feasibility in a field context. In In Proceedings of the 4th International Conference of the Augmented Cognition Society.",
      "doi": ""
    },
    {
      "text": "John D Mayer and Yvonne N Gaschke. 1988. The experience and meta-experience of mood. Journal of personality and social psychology 55, 1 (1988), 102.",
      "doi": ""
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing Content-driven Intelligent Notification Mechanisms for Mobile Applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 813--824.  ",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People's Receptivity to Mobile Notifications. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1021--1032.  ",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "Martin Mühlenbrock, Oliver Brdiczka, Dave Snowdon, and Jean-Luc Meunier. 2004. Learning to Detect User Activity and Availability from a Variety of Sensor Data. In Proceedings of the Second IEEE International Conference on Pervasive Computing and Communications (PERCOM '04). IEEE Computer Society, Washington, DC, USA, 13--. http://dl.acm.org/citation.cfm?id=977406.978698 ",
      "doi": "10.5555/977406.978698"
    },
    {
      "text": "Fatma Nasoz, Kaye Alvarez, Christine L Lisetti, and Neal Finkelstein. 2004. Emotion recognition from physiological signals using wireless sensors for presence technologies. Cognition, Technology & Work 6, 1 (2004), 4--14.  ",
      "doi": "10.1007/s10111-003-0143-x"
    },
    {
      "text": "US Bureau of Labor Statistics. 2015. American Time Use Survey. (2015). http://www.bls.gov/tus/.",
      "doi": ""
    },
    {
      "text": "Tadashi Okoshi, Jin Nakazawa, and Hideyuki Tokuda. 2014. Attelia: Sensing User's Attention Status on Smart Phones. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, New York, NY, USA, 139--142.  ",
      "doi": "10.1145/2638728.2638802"
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey, and Hideyuki Tokuda. 2015. Reducing Users' Perceived Mental Effort Due to Interruptive Notifications in Multi-device Mobile Environments. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 475--486.  ",
      "doi": "10.1145/2750858.2807517"
    },
    {
      "text": "Veljko Pejovic and Mirco Musolesi. 2014. InterruptMe: Designing Intelligent Prompting Mechanisms for Pervasive Applications. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 897--908.  ",
      "doi": "10.1145/2632048.2632062"
    },
    {
      "text": "Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014. Didn't You See My Message?: Predicting Attentiveness to Mobile Instant Messages. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3319--3328.  ",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2014. Sensor-Based Identification of Opportune Moments for Triggering Notifications. IEEE Pervasive Computing 13, 1 (Jan. 2014), 22--29.  ",
      "doi": "10.1109/MPRV.2014.15"
    },
    {
      "text": "Ross J. Quinlan. 1992. Learning with Continuous Classes. In 5th Australian Joint Conference on Artificial Intelligence. World Scientific, Singapore, 343--348.",
      "doi": ""
    },
    {
      "text": "Karen Renaud, Judith Ramsay, and Mario Hair. 2006. \"You've got e-mail!\"... shall I deal with it now? Electronic mail from the recipient's perspective. International Journal of Human-Computer Interaction 21, 3 (2006), 313--332.",
      "doi": ""
    },
    {
      "text": "Stephanie Rosenthal, Anind K. Dey, and Manuela Veloso. 2011. Using Decision-theoretic Experience Sampling to Build Personalized Mobile Phone Interruption Models. In Proceedings of the 9th International Conference on Pervasive Computing (Pervasive'11). Springer-Verlag, Berlin, Heidelberg, 170--187. http://dl.acm.org/citation.cfm?id=2021975.2021991 ",
      "doi": "10.5555/2021975.2021991"
    },
    {
      "text": "Hillol Sarker, Moushumi Sharmin, Amin Ahsan Ali, Md. Mahbubur Rahman, Rummana Bari, Syed Monowar Hossain, and Santosh Kumar. 2014. Assessing the Availability of Users to Engage in Just-in-time Intervention in the Natural Environment. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 909--920.  ",
      "doi": "10.1145/2632048.2636082"
    },
    {
      "text": "Sachin Shah, J Narasimha Teja, and Samit Bhattacharya. 2015. Towards affective touch interaction: predicting mobile user emotion from finger strokes. Journal of Interaction Science 3, 1 (2015), 1.",
      "doi": ""
    },
    {
      "text": "Saul Shiffman, Arthur A Stone, and Michael R Hufford. 2008. Ecological momentary assessment. Annu. Rev. Clin. Psychol. 4 (2008), 1--32.",
      "doi": ""
    },
    {
      "text": "Jeremiah Smith and Naranker Dulay. 2014. Ringlearn: Long-term mitigation of disruptive smartphone interruptions. In Pervasive Computing and Communications Workshops (PERCOM Workshops), 2014 IEEE International Conference on. IEEE, 27--35.",
      "doi": ""
    },
    {
      "text": "Jeremiah Smith, Anna Lavygina, Jiefei Ma, Alessandra Russo, and Naranker Dulay. 2014. Learning to Recognise Disruptive Smartphone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 121--124.  ",
      "doi": "10.1145/2628363.2628404"
    },
    {
      "text": "Takahiro Tanaka and Kinya Fujita. 2011. Study of User Interruptibility Estimation Based on Focused Application Switching. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 721--724.  ",
      "doi": "10.1145/1958824.1958954"
    },
    {
      "text": "Justin Tang and Donald J Patterson. 2010. Twitter, sensors and UI: Robust context modeling for interruption management. In User Modeling, Adaptation, and Personalization. Springer, 123--134.  ",
      "doi": "10.1007/978-3-642-13470-8_13"
    },
    {
      "text": "Rannie Teodoro, Pinar Ozturk, Mor Naaman, Winter Mason, and Janne Lindqvist. 2014. The Motivations and Experiences of the On-demand Mobile Workforce. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 236--247.  ",
      "doi": "10.1145/2531602.2531680"
    },
    {
      "text": "Henri ter Hofte. 2007. Xensible Interruptions from Your Mobile Phone. In Proceedings of the 9th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '07). ACM, New York, NY, USA, 178--181.  ",
      "doi": "10.1145/1377999.1378003"
    },
    {
      "text": "Marko Tkalcic, Matevz Kunaver, Jurij Tasic, and Andrej Košir. 2009. Personality based user similarity measure for a collaborative recommender system. In Proceedings of the 5th Workshop on Emotion in Human-Computer Interaction-Real world challenges. 30--37.",
      "doi": ""
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2015. Interruptibility Prediction for Ubiquitous Systems: Conventions and New Directions from a Growing Field. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 801--812.  ",
      "doi": "10.1145/2750858.2807514"
    },
    {
      "text": "Jason Wiese, Patrick Gage Kelley, Lorrie Faith Cranor, Laura Dabbish, Jason I. Hong, and John Zimmerman. 2011. Are You Close with Me? Are You Nearby?: Investigating Social Groups, Closeness, and Willingness to Share. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, New York, NY, USA, 197--206.  ",
      "doi": "10.1145/2030112.2030140"
    },
    {
      "text": "Mao Ye, Dong Shou, Wang-Chien Lee, Peifeng Yin, and Krzysztof Janowicz. 2011. On the Semantic Annotation of Places in Location-based Social Networks. In Proceedings of the 17th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '11). ACM, New York, NY, USA, 520--528.  ",
      "doi": "10.1145/2020408.2020491"
    },
    {
      "text": "Xingquan Zhu. 2007. Knowledge Discovery and Data Mining: Challenges and Realities: Challenges and Realities. Igi Global. ",
      "doi": "10.5555/1206477"
    },
    {
      "text": "Manuela Züger and Thomas Fritz. 2015. Interruptibility of Software Developers and Its Prediction Using Psycho-Physiological Sensors. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2981--2990.  ",
      "doi": "10.1145/2702123.2702593"
    }
  ]
}