{
  "doi": "10.1145/3025453.3025848",
  "title": "Showing Objects: Holding and Manipulating Artefacts in Video-mediated Collaborative Settings",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5295-5306",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper we report on a pervasive practice in video-mediated communication: where participants show one another one or more objects. This is a distinct activity from others considered by researchers of video-mediated technologies that focus on a face-to-face orientation, or just on the support necessary to help people to refer to objects. We first present examples of this pervasive phenomenon in naturally occurring Skype conversations, revealing how this conduct is configured and organized within the interaction between participants. We reveal how the subtle adjustment of the position of the body, the head and gaze with respect to the handheld objects offers crucial resources for participants to achieve joint seeing. Then we report on a quite different setting, a naturalistic experiment where participants collaborate on a collective task with remote colleagues through maneuverable, orientable devices (Kubis). Again, in these experiments participants frequently show objects, and at times the devices provide additional resources to support these activities. But at other times they also involve some difficulties. We conclude by suggesting possible technological developments, some quite simple, others more radical, that might support participants to show objects, whether they are in domestic settings or undertaking work activities.",
  "tags": [
    "objects",
    "Skype",
    "embodied interaction",
    "video-mediated interaction",
    "domestic"
  ],
  "authors": [
    {
      "name": "Christian Licoppe",
      "institution": "Université Paris-Saclay, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100462633",
      "orcid": "missing"
    },
    {
      "name": "Paul K. Luff",
      "institution": "King's College, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100229533",
      "orcid": "missing"
    },
    {
      "name": "Christian Heath",
      "institution": "King's College, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100164455",
      "orcid": "missing"
    },
    {
      "name": "Hideaki Kuzuoka",
      "institution": "University of Tsukuba, Tsukuba, Ibaraki, Japan",
      "img": "/do/10.1145/contrib-81100072975/rel-imgonly/kuzuoka2006.jpg",
      "acmid": "81100072975",
      "orcid": "0000-0003-1252-7814"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Laboratories, Soraku-gun, Kyoto, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Sylvaine Tuncer",
      "institution": "Université Paris-Saclay, Paris , France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161293",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M.G., Go, J., Kaye, J., & Spazojevic, M. (2010). Making Love in the Network Closet: The Benefits and Work of Family VideoChat. In Proc. of CSCW 2010, 145154.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Brown, B., & Laurier, E. (2012). The Normal, Natural Troubles of Driving with GPS. In Proc. of CHI 2012, 16211630.  ",
      "doi": "10.1145/2207676.2208285"
    },
    {
      "text": "Brubaker, J., Venolia, G. & Tang, J. (2012). Focusing on Shared Experiences: Moving beyond the camera in video communication. In Proc. DIS 2012, 96--105.  ",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Card, S. K., Moran, T. and Newell, A. (1983). The Psychology of Human-Computer Interaction. Hillsdale, NJ.: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "De Fornel, Michel, 1994. Le cadre interactionnel de l'échange visiophonique. Réseaux 64, 107--132.",
      "doi": ""
    },
    {
      "text": "Egido, C. (1990). Teleconferencing as a technology to support cooperative work: Its possibilities and limitations. In R. E. Kraut, J. Galegher, & C. Egido (Eds.), Intellectual Teamwork: Social and Technological Foundations of Cooperative Work (pp. 351--373). New Jersey: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/117848.117953"
    },
    {
      "text": "Fraser, M., Glover, T., Vaghi, I., Benford, S., Greenhalgh, C., Hindmarsh, J. & Heath, C. 2000. Revealing the Reality of Collaborative Virtual Reality. In Proceedings of ACM Conference on Collaborative Virtual Environments (CVE 2000). ACM, San Francisco, CA, 29--37.  ",
      "doi": "10.1145/351006.351010"
    },
    {
      "text": "Gauglitz, S., Lee, C., Turk, M., & Hollerer, T. (2012). Integrating the Physical Environment into Mobile Remote Collaboration. In Proc. MobileHCI 2012, 241--250.  ",
      "doi": "10.1145/2371574.2371610"
    },
    {
      "text": "Gaver, W.W., G. Smets, and K. Overbeeke. (1995). A Virtual Window on media space. in Proc of CHI '95.: 257264.  ",
      "doi": "10.1145/223904.223937"
    },
    {
      "text": "Gaver, W. W., Sellen, A. Heath, C., & Luff, P. (1993). One is not enough : multiple views in a media space. Proc. of CHI 1993, 335--341. ",
      "doi": "10.5555/164632.164940"
    },
    {
      "text": "Goffman, E. (1971). Relations in Public. Microstructure of the Public Order. New York: Harper & Row.",
      "doi": ""
    },
    {
      "text": "Goodwin, C. (1981). Conversational Organisation: Interaction between a Speaker and Hearer. London: Academic Press.",
      "doi": ""
    },
    {
      "text": "Greatbatch, D., Heath, C., Campion, P. and Luff, P. (1995) \"How do desk-top computers affect the doctor-patient interaction\"? Family Practice, Vol,12, No 1. 32--36.",
      "doi": ""
    },
    {
      "text": "Harrison, S. (Ed.). (2009). Media Space 20 + Years of Mediated Life London: Springer-Verlag. ",
      "doi": "10.5555/1557625"
    },
    {
      "text": "Heath, C. C. , Hindmarsh, J., & Luff, P. (2010). Video in Qualitative Research: analyzing social interaction in everyday life. London: Sage.",
      "doi": ""
    },
    {
      "text": "Heath, C. & Luff, P. (1991). Disembodied Conduct: Communication through video in a multimedia office environment. In Proc of CHI 1991, 99--103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Hindmarsh, J., Fraser, M., Heath, C. C., Benford, S., & Greenhalgh, C. (1998). Fragmented Interaction: Establishing mutual orientation in virtual environments. Paper presented at the CSCW'98, Seattle, WA.  ",
      "doi": "10.1145/289444.289496"
    },
    {
      "text": "Inkpen, K., Taylor, B. Junuzovic, S., Tang, G. & Venolia, G. (2013). . Experiences2Go: Sharing Kid's Activities Outside the Home with Remote Family Members. CSCW 2013,  ",
      "doi": "10.1145/2441776.2441926"
    },
    {
      "text": "Ishii, H. and Kobayashi, M. (1992). 'Clearface: a seamless medium for sharing drawing and conversation with eye contact', in Proc. of CHI 92, Monterey, 525--32.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Jones, B., Witcraft, A., Bateman, S., Neustaedter, C., & Tang, A. (2015) Mechanics of Camera Work in Mobile Video Collaboration. Proc. of CHI 2015.  ",
      "doi": "10.1145/2702123.2702345"
    },
    {
      "text": "Judge, T., Neustaedter, C., Harrison, S. & Blose, A. (2011). Family portals. Connecting families through a multifamily media space. In Proc. of CHI 2011, 1205--1214.  ",
      "doi": "10.1145/1978942.1979122"
    },
    {
      "text": "Kirk, D., Rodden, T. & Fraser, D.S.(2007). Turn It This Way: Grounding Collaborative Action with Remote Gestures. In Proc. CHI 2007, 1039--1048.  ",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "Kirk, D., Sellen, A. & Xiang, C. (2010). Home Video Communication. Mediating \"Closeness\". In Proc. of CSCW 2010, 135--144.  ",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "Knoblauch, H. (2013). PowerPoint, Communication, and the Knowledge Society. Hubert Knoblauch. New York: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Kuzuoka, H., Yamashita, J., Yamazaki, K., & Yamazaki, A., A. (1999). Agora: A Remote Collaboration System that Enables Mutual Monitoring. Paper presented at the CHI'99 Extended Abstracts, Philadelphia, PA.  ",
      "doi": "10.1145/632716.632836"
    },
    {
      "text": "Li, Z,. Miyafuji, S., Sato, T. and H. Koike (2016 forthcoming). OmniEyeball: Spherical Display Embedded With Omnidirectional Camera Using Dynamic Spherical Mapping. Proc of IUST.  ",
      "doi": "10.1145/2984751.2984765"
    },
    {
      "text": "Licoppe, C., & Morel, J. (2009). The Collaborative Work of Producing Meaningful Shots in Mobile Video Telephony. In Proc. MobileHCI 2009, 254--263  ",
      "doi": "10.1145/1613858.1613903"
    },
    {
      "text": "Luff, P., Heath, C., Kuzuoka, H., Hindmarsh, J., Yamazaki, K., & Oyama, S. (2003). Fractured Ecologies: Creating Environments for Collaboration. Human-Computer Interaction 18, 51--84.  ",
      "doi": "10.1207/S15327051HCI1812_3"
    },
    {
      "text": "Luff, P., Heath, C., Kuzuoka, H., Yamazaki, K., & Yamashita, J. (2006). Handling Documents and Discriminating Objects in Hybrid Spaces Paper presented at the CHI 2006, Montreal.  ",
      "doi": "10.1145/1124772.1124858"
    },
    {
      "text": "Luff, P., Yamashita, N., Kuzuoka, H & Heath, C, (2011) Hands on Hitchcock: embodied reference to a moving scene, In Proc. CHI 2011, 43--52.  ",
      "doi": "10.1145/1978942.1978951"
    },
    {
      "text": "Nardi, B. A., Schwartz, H., Kuchinsky, A., Leichner, R., Whitakker, S. and Sclabassi, R. (1993). 'Turning Away from Talking Heads: The Use of Video-as-Data in Neurosurgery', in Proc. of INTERCHI'93, Amsterdam, 32734. ",
      "doi": "10.5555/164632.164937"
    },
    {
      "text": "Neustaedter, C., Yarosh, S. & Brush, A.S. (2009): Designing for families. In: Proceedings of ACM CHI 20092735--2738.  ",
      "doi": "10.1145/1520340.1520394"
    },
    {
      "text": "Neustaedter, C., Harrison, S. & Sellen, A.(2010): Connecting families: new technologies, family communication, and the impact on domestic life. Berlin: Springer.",
      "doi": ""
    },
    {
      "text": "Nevile, M., Haddington, P., Heinemann, T., & Rauniomaa, M. (Eds.). (2014). Interacting with Objects: Language, materiality and social activity. Amsterdam: John Benjamins Publishing Company.",
      "doi": ""
    },
    {
      "text": "NICT (2016) Ultra-realistic telework system. Oki, NEC, Sharp, Kyoto University, Tokyo University of Agriculture and Technology, and Rissho University",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Black, A., & Lipson, M. (2006). Everyday Practices with Mobile Video Telephony. Proc. of CHI 2006, 871--880.  ",
      "doi": "10.1145/1124772.1124900"
    },
    {
      "text": "Revove Robotics (2015) https://www.revolverobotics.com/ (accessed 19th Sepetmber 2016)",
      "doi": ""
    },
    {
      "text": "Statista (2016) https://www.statista.com/statistics/ (accessed 19th September 2016)",
      "doi": ""
    },
    {
      "text": "Tang, J., Xiao, R., Venolia, G., & Roseway, A. (2013). HomeProxy: Exploring a Physical Proxy for Video Communication in the Home. In Proc. of CHI 2013, 1339-  ",
      "doi": "10.1145/2470654.2466175"
    },
    {
      "text": "Wong, N. & Gutwin, C. (2014). Support for deictic pointing in CVEs: still fragmented after all these years'. Proc of CSCW 2014, 1377--1387.  ",
      "doi": "10.1145/2531602.2531691"
    },
    {
      "text": "Yarosh, S., Inkpen, K., & Bernheim Brush, A.J. (2010). Video playdate: towards free play across distance. In Proc. CHI 2010, 1251--1260.  ",
      "doi": "10.1145/1753326.1753514"
    }
  ]
}