{
  "doi": "10.1145/3025453.3025887",
  "title": "MakerWear: A Tangible Approach to Interactive Wearable Creation for Children",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "133-145",
  "year": 2017,
  "badges": [],
  "abstract": "Wearable construction toolkits have shown promise in broadening participation in computing and empowering users to create personally meaningful computational designs. However, these kits present a high barrier of entry for some users, particularly young children (K-6). In this paper, we introduce MakerWear, a new wearable construction kit for children that uses a tangible, modular approach to wearable creation. We describe our participatory design process, the iterative development of MakerWear, and results from single- and multi-session workshops with 32 children (ages 5-12; M=8.3 years). Our findings reveal how children engage in wearable design, what they make (and want to make), and what challenges they face. As a secondary analysis, we also explore age-related differences.",
  "authors": [
    {
      "name": "Majeed Kazemitabaar",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-99658613384/rel-imgonly/majeed-mirror.jpg",
      "acmid": "99658613384",
      "orcid": "0000-0001-6118-7938"
    },
    {
      "name": "Jason McPeak",
      "institution": "University of Maryland, College Park, College Park, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160319",
      "orcid": "missing"
    },
    {
      "name": "Alexander Jiao",
      "institution": "University of Maryland, College Park, College Park, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161283",
      "orcid": "missing"
    },
    {
      "name": "Liang He",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81548025594/rel-imgonly/liang-profile.jpg",
      "acmid": "81548025594",
      "orcid": "missing"
    },
    {
      "name": "Thomas Outing",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160533",
      "orcid": "missing"
    },
    {
      "name": "Jon E. Froehlich",
      "institution": "University of Maryland, College Park, College Park, USA",
      "img": "/do/10.1145/contrib-81331492504/rel-imgonly/81331492504.jpg",
      "acmid": "81331492504",
      "orcid": "0000-0001-8291-3353"
    }
  ],
  "references": [
    {
      "text": "Edith Ackermann. 1996. Perspective-taking and object construction. In Constructionism in practice: Designing, thinking, and learning in a digital world, Yasmin B. Kafai and Mitchel Resnick (eds.). Lawrence Erlbaum Associates, Mahwah, NJ, 107--123.",
      "doi": ""
    },
    {
      "text": "LLC Adafruit Industries. FLORA: A wearable Arduinocompatible electronics platform. Retrieved March 14, 2015 from https://www.adafruit.com/products/659",
      "doi": ""
    },
    {
      "text": "LLC Adafruit Industries. 2012. Announcing the FLORA, Adafruit's wearable electronics platform and accessories. Retrieved July 1, 2015 from https://blog.adafruit.com/2012/01/20/announcing-theflora-adafruits-wearable-electronics-platform-andaccessories/",
      "doi": ""
    },
    {
      "text": "Ayah Bdeir and Ted Ullrich. 2011. Electronics as material: littleBits. Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction - TEI '11, ACM Press, 341--344. Retrieved March 15, 2015 from http://dl.acm.org/citation.cfm?id=1935701.1935781",
      "doi": "10.1145/1935701.1935781"
    },
    {
      "text": "M. U. Bers and Michael S. Horn. 2010. Tangible programming in early childhood: Revisiting developmental assumptions through new technologies. In High-tech tots: Childhood in a digital world. Information Age Publishing, Greenwich, CT, 49--72.",
      "doi": ""
    },
    {
      "text": "Marina Umaschi Bers, Louise Flannery, Elizabeth R Kazakoff, and Amanda Sullivan. 2014. Computational Thinking and Tinkering: Exploration of an Early Childhood Robotics Curriculum. Comput. Educ. 72: 145-- 157. http://doi.org/10.1016/j.compedu.2013.10.020",
      "doi": ""
    },
    {
      "text": "Paulo Blikstein. 2013. Gears of Our Childhood: Constructionist Toolkits, Robotics, and Physical Computing, Past and Future. Proceedings of the 12th International Conference on Interaction Design and Children, ACM, 173--182. http://doi.org/10.1145/2485760.2485786  ",
      "doi": "10.1145/2485760.2485786"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. http://doi.org/10.1191/1478088706qp063oa ",
      "doi": ""
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. Proceedings of the 2012 annual meeting of the American Educational Research Association, Vancouver, Canada.",
      "doi": ""
    },
    {
      "text": "Leah Buechley and Michael Eisenberg. 2008. The LilyPad Arduino: Toward Wearable Engineering for Everyone. IEEE Pervasive Computing 7, 2: 12--15.  ",
      "doi": "10.1109/MPRV.2008.38"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems CHI '08, ACM Press, 423--432. Retrieved March 15, 2015 from http://dl.acm.org/citation.cfm?id=1357054.1357123",
      "doi": ""
    },
    {
      "text": "Leah Buechley, Nwanua Elumeze, Camille Dodson, and Michael Eisenberg. 2005. Quilt Snaps: A Fabric Based Computational Construction Kit. Proceedings of the IEEE International Workshop on Wireless and Mobile Technologies in Education, IEEE Computer Society, 219-- 221. http://doi.org/10.1109/WMTE.2005.55  ",
      "doi": "10.1109/WMTE.2005.55"
    },
    {
      "text": "Leah Buechley and Benjamin Mako Hill. 2010. LilyPad in the Wild: How Hardware's Long Tail is Supporting New Engineering and Design Communities. Proceedings of the 8th ACM Conference on Designing Interactive Systems DIS '10, ACM Press, 199--207. Retrieved March 15, 2015 from http://dl.acm.org/citation.cfm?id=1858171.1858206",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Carol Copple and Sue Bredekamp (eds.). 2009. Developmentally Appropriate Practice in Early Childhood Programs Serving Children from Birth through Age 8. National Association for the Education of Young Children, Washington, DC, USA.",
      "doi": ""
    },
    {
      "text": "fabrickit. Fabrick Kit. Retrieved June 1, 2016 from http://www.fabrick.it/index.html",
      "doi": ""
    },
    {
      "text": "Louise P Flannery, Brian Silverman, Elizabeth R Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: Support for Early Childhood Learning Through Computer Programming. Proceedings of the 12th International Conference on Interaction Design and Children, ACM, 1-- 10. http://doi.org/10.1145/2485760.2485785  ",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, and Jerry Alan Fails. 2013. Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational codesign. International Journal of Child-Computer Interaction 1, 1: 14--23. Retrieved February 4, 2015 from http://www.sciencedirect.com/science/article/pii/S221286 8912000049",
      "doi": ""
    },
    {
      "text": "Sibel Deren Guler and Michael Everett Rule. 2013. Invent-abling: Enabling Inventiveness Through Craft. Proceedings of the 12th International Conference on Interaction Design and Children, ACM, 368--371. http://doi.org/10.1145/2485760.2485801  ",
      "doi": "10.1145/2485760.2485801"
    },
    {
      "text": "Lynne Hall, Colette Hume, and Sarah Tazzyman. 2016. Five Degrees of Happiness: Effective Smiley Faced Likert Scales for Evaluating with Children. Proceedings of the ACM SIGCHI Interaction Design and Children Conference.  ",
      "doi": "10.1145/2930674.2930719"
    },
    {
      "text": "Michael S Horn, R Jordan Crouser, and Marina U Bers. 2012. Tangible Interaction and Learning: The Case for a Hybrid Approach. Personal Ubiquitous Comput. 16, 4: 379--389. http://doi.org/10.1007/s00779-011-0404--2",
      "doi": ""
    },
    {
      "text": "Michael S Horn and Robert J K Jacob. 2007. Designing Tangible Programming Languages for Classroom Use. Proceedings of the 1st International Conference on Tangible and Embedded Interaction, ACM, 159--162. http://doi.org/10.1145/1226969.1227003  ",
      "doi": "10.1145/1226969.1227003"
    },
    {
      "text": "Felix Hu, Ariel Zekelman, Michael Horn, and Frances Judd. 2015. Strawbies: Explorations in Tangible Programming. Proceedings of the 14th International Conference on Interaction Design and Children, ACM, 410--413. http://doi.org/10.1145/2771839.2771866  ",
      "doi": "10.1145/2771839.2771866"
    },
    {
      "text": "Jennifer Jacobs, Mitchel Resnick, and Leah Buechley. 2014. Dresscode: Supporting Youth in Computational Design and Making. Constructionism and Creativity. Retrieved from http://constructionism2014.ifs.tuwien.ac.at/papers/3.2_18520.pdf",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai, Deborah A. Fields, and Kristin A. Searle. 2012. Making Technology Visible: Connecting the Learning of Crafts, Circuitry and Coding in Youth eTextile Designs. Proceedings of the 10th International Conference of the Learning Sciences (ICLS), 188--195.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai, Eunkyoung Lee, Kristin Searle, Deborah Fields, Eliot Kaplan, and Debora Lui. 2014. A Crafts-Oriented Approach to Computing in High School. ACM Transactions on Computing Education 14, 1: 1--20. Retrieved January 31, 2015 from http://dl.acm.org/citation.cfm?id=2600089.2576874",
      "doi": "10.1145/2576874"
    },
    {
      "text": "Yasmin B. Kafai and Kylie A. Peppler. 2014. Transparency Reconsidered: Creative, Critical, and Connected Making with E-textiles. In DIY Citizenship: Critical Making and Social Media, Matt Ratto, Megan Boler and Ronald Deibert (eds.). MIT Press, 179--188.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai and Mitchel Resnick. 1996. Introduction. In Constructionism in Practice: Designing, Thinking, and Learning in A Digital World (1st Editio), Yasmin B. Kafai and Mitchel Resnick (eds.). Routledge, 1--8.",
      "doi": ""
    },
    {
      "text": "Yasmin Kafai, Deborah Fields, and Kristin Searle. 2014. Electronic Textiles as Disruptive Designs: Supporting and Challenging Maker Activities in Schools. Harvard Educational Review 84, 4: 532--556. Retrieved June 5, 2015 from http://hepgjournals.org/doi/abs/10.17763/haer.84.4.46m7372370214783?journalCode=haer ",
      "doi": ""
    },
    {
      "text": "Eva-Sophie Katterfeldt, Nadine Dittert, and Heidi Schelhowe. 2009. EduWear: Smart Textiles As Ways of Relating Computing Technology to Everyday Life. Proceedings of the 8th International Conference on Interaction Design and Children, ACM, 9--17. http://doi.org/10.1145/1551788.1551791  ",
      "doi": "10.1145/1551788.1551791"
    },
    {
      "text": "Elizabeth R Kazakoff and Marina Umaschi Bers. 2014. Put Your Robot in, Put Your Robot out: Sequencing through Programming Robots in Early Childhood. Journal of Educational Computing Research 50, 4: 553--573. http://doi.org/10.2190/EC.50.4.f ",
      "doi": ""
    },
    {
      "text": "Caitlin Kelleher and Randy Pausch. 2005. Lowering the Barriers to Programming: A Taxonomy of Programming Environments and Languages for Novice Programmers. ACM Comput. Surv. 37, 2: 83--137. http://doi.org/10.1145/1089733.1089734  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Winnie W Y Lau, Grace Ngai, Stephen C F Chan, and Joey C Y Cheung. 2009. Learning Programming Through Fashion and Design: A Pilot Summer Course in Wearable Computing for Middle School Students. Proceedings of the 40th ACM Technical Symposium on Computer Science Education, ACM, 504--508. http://doi.org/10.1145/1508865.1509041  ",
      "doi": "10.1145/1508865.1509041"
    },
    {
      "text": "littleBits Electronics Inc. littleBits. Retrieved June 25, 2015 from http://littlebits.cc",
      "doi": ""
    },
    {
      "text": "Modular Robotics. Cubelets. Retrieved July 1, 2015 from http://www.modrobotics.com/cubelets",
      "doi": ""
    },
    {
      "text": "Grace Ngai, Stephen C.F. Chan, Joey C.Y. Cheung, and Winnie W.Y. Lau. 2009. The TeeBoard: an education friendly construction platform for e-textiles and wearable computing. Proceedings of the 27th international conference on Human factors in computing systems CHI 09, ACM Press, 249. http://doi.org/10.1145/1518701.1518742  ",
      "doi": "10.1145/1518701.1518742"
    },
    {
      "text": "Grace Ngai, Stephen C.F. Chan, Hong Va Leong, and Vincent T.Y. Ng. 2013. Designing i*CATch: A multipurpose, education-friendly construction kit for physical and wearable computing. ACM Transactions on Computing Education 13, 2: 1--30. Retrieved February 17, 2015 from http://dl.acm.org/citation.cfm?id=2483710.2483712",
      "doi": "10.1145/2483710.2483712"
    },
    {
      "text": "Grace Ngai, Stephen C.F. Chan, Vincent T.Y. Ng, et al. 2010. i*CATch: a scalable plug-n-play wearable computing framework for novices and children. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 443--452. Retrieved March 16, 2015 from http://dl.acm.org/citation.cfm?id=1753326.1753393",
      "doi": "10.1145/1753326.1753393"
    },
    {
      "text": "Seymour Papert. 1993. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc., New York, New York.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting textile interfaces from a kit-of-noparts. Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction - TEI '11, ACM Press, 61. Retrieved March 16, 2015 from http://dl.acm.org.proxyum.researchport.umd.edu/citation.cfm?id=1935701.19357",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Jean Piaget. 1952. The origins of intelligence in children. International Universities Press, New York. ",
      "doi": ""
    },
    {
      "text": "Dylan J Portelance and Marina Umaschi Bers. 2015. Code and Tell: Assessing Young Children's Learning of Computational Thinking Using Peer Video Interviews with ScratchJr. Proceedings of the 14th International Conference on Interaction Design and Children, ACM, 271--274. http://doi.org/10.1145/2771839.2771894  ",
      "doi": "10.1145/2771839.2771894"
    },
    {
      "text": "Cyndi Rader, Cathy Brand, and Clayton Lewis. 1997. Degrees of Comprehension: Children's Understanding of a Visual Programming Environment. Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, ACM, 351--358. http://doi.org/10.1145/258549.258793  ",
      "doi": "10.1145/258549.258793"
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Robert Berg, et al. 1998. Digital manipulatives: new toys to think with. Proceedings of the SIGCHI conference on Human factors in computing systems CHI '98, ACM Press, 281--287. Retrieved March 3, 2014 from http://dl.acm.org/citation.cfm?id=274644.274684",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Mitchel Resnick and Eric Rosenbaum. 2013. Designing for Tinkerability. In Design, Make, Play?: Growing the Next Generation of STEM Innovators, Margaret Honey and David E Kanter (eds.). Routledge, 182--199.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Brian Silverman, Yasmin Kafai, et al. 2009. Scratch: Programming for All. Communications of the ACM 52, 11: 60. http://doi.org/10.1145/1592761.1592779",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mitchel Resnick and Brian Silverman. 2005. Some reflections on designing construction kits for kids. Proceeding of the 2005 conference on Interaction design and children - IDC '05, ACM Press, 117--122. Retrieved March 16, 2015 from http://dl.acm.org/citation.cfm?id=1109540.1109556",
      "doi": "10.1145/1109540.1109556"
    },
    {
      "text": "Eric Schweikardt and Mark D Gross. 2006. roBlocks: A Robotic Construction Kit for Mathematics and Science Education. Proceedings of the 8th International Conference on Multimodal Interfaces, ACM, 72--75. http://doi.org/10.1145/1180995.1181010  ",
      "doi": "10.1145/1180995.1181010"
    },
    {
      "text": "Kristin A. Searle, Deborah A. Fields, Debora A. Lui, and Yasmin B. Kafai. 2014. Diversifying high school students' views about computing with electronic textiles. Proceedings of the tenth annual conference on International computing education research - ICER '14, ACM Press, 75--82. Retrieved June 5, 2015 from http://dl.acm.org/citation.cfm?id=2632320.2632352",
      "doi": ""
    },
    {
      "text": "Robert S. Siegler, Judy S. DeLoache, and Nancy Eisenberg. 2010. How Children Develop. Worth Publishers.",
      "doi": ""
    },
    {
      "text": "David Canfield Smith, Allen Cypher, and Jim Spohrer. 1994. KidSim: Programming Agents Without a Programming Language. Commun. ACM 37, 7: 54--67. http://doi.org/10.1145/176789.176795  ",
      "doi": "10.1145/176789.176795"
    },
    {
      "text": "Amanda Strawhacker and Marina U. Bers. 2014. \"I want my robot to look for food\": Comparing Kindergartner's programming comprehension using tangible, graphic, and hybrid user interfaces. International Journal of Technology and Design Education: 1--27. http://doi.org/10.1007/s10798-014--9287--7",
      "doi": ""
    },
    {
      "text": "Amanda Strawhacker, Melissa Lee, Claire Caine, and Marina Bers. 2015. ScratchJr Demo: A Coding Language for Kindergarten. Proceedings of the 14th International Conference on Interaction Design and Children, ACM, 414--417. http://doi.org/10.1145/2771839.2771867  ",
      "doi": "10.1145/2771839.2771867"
    },
    {
      "text": "Amanda Sullivan and Marina Umaschi Bers. 2016. Robotics in the early childhood classroom: learning outcomes from an 8-week robotics curriculum in prekindergarten through second grade. International Journal of Technology and Design Education 26, 1: 3--20. http://doi.org/10.1007/s10798-015--9304--5",
      "doi": ""
    },
    {
      "text": "Heather Biggar Tomlinson. 2009. Developmentally Appropriate Practice in the Kindergarten Year-Ages 5--6. In Developmentally Appropriate Practice in Early Childhood Programs Serving Children from Birth through Age 8 (Third Edit), Carol Copple and Sue Bredekamp (eds.). National Association for the Education of Young Children, Washington, DC, USA, 187--216.",
      "doi": ""
    },
    {
      "text": "Shirin Vossoughi and Bronwyn Bevan. 2014. Making and Tinkering: A Review of the Literature. Retrieved from http://www.sesp.northwestern.edu/docs/publications/1926 024546baba2b73c7.pdf",
      "doi": ""
    },
    {
      "text": "Peta Wyeth and Gordon F Wyeth. 2001. Electronic blocks: Tangible programming elements for preschoolers. IFIP TC. 13 International Conference on Human-Computer Interaction, 496--503.",
      "doi": ""
    },
    {
      "text": "Peta Wyeth. 2008. How Young Children Learn to Program With Sensor, Action, and Logic Blocks. Journal of the Learning Sciences 17, 4: 517--550. http://doi.org/10.1080/10508400802395069 ",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman, Saeed Arida, and Mitchel Resnick. 2005. Extending Tangible Interfaces for Education: Digital Montessori-inspired Manipulatives. Proceedings of the SIGCHI conference on Human factors in computing systems CHI '05, ACM Press, 859--868. http://doi.org/10.1145/1054972.1055093  ",
      "doi": "10.1145/1054972.1055093"
    }
  ]
}