{
  "doi": "10.1145/3025453.3025683",
  "title": "ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4021-4033",
  "year": 2017,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Virtual reality (VR) head-mounted displays (HMD) allow for a highly immersive experience and are currently becoming part of the living room entertainment. Current VR systems focus mainly on increasing the immersion and enjoyment for the user wearing the HMD (HMD user), resulting in all the bystanders (Non-HMD users) being excluded from the experience. We propose ShareVR, a proof-of-concept prototype using floor projection and mobile displays in combination with positional tracking to visualize the virtual world for the Non-HMD user, enabling them to interact with the HMD user and become part of the VR experience. We designed and implemented ShareVR based on the insights of an initial online survey (n=48) with early adopters of VR HMDs. We ran a user study (n=16) comparing ShareVRto a baseline condition showing how the interaction using ShareVR led to an increase of enjoyment, presence and social interaction. In a last step we implemented several experiences for ShareVR, exploring its design space and giving insights for designers of co-located asymmetric VR experiences.",
  "tags": [
    "sharevr",
    "co-located virtual reality",
    "multi-user virtual reality",
    "asymmetric virtual reality",
    "consumer virtual reality"
  ],
  "authors": [
    {
      "name": "Jan Gugenheimer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Evgeny Stemasov",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-99659161755/rel-imgonly/mitarbeiterportrait-e-s-sq.jpg",
      "acmid": "99659161755",
      "orcid": "missing"
    },
    {
      "name": "Julian Frommel",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-88159458857/rel-imgonly/jf_2020_12_17_400x400.jpg",
      "acmid": "88159458857",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Hrvoje Benko, Edward W Ishak, and Steven Feiner. 2004. Collaborative mixed reality visualization of an archaeological excavation. In Mixed and Augmented Reality, 2004. ISMAR 2004. Third IEEE and ACM International Symposium on. IEEE, 132--140.",
      "doi": "10.1109/ISMAR.2004.23"
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 2002. Collaborative Augmented Reality. Commun. ACM 45, 7 (July 2002), 64--70. DOI:http://dx.doi.org/10.1145/514236.514265  ",
      "doi": "10.1145/514236.514265"
    },
    {
      "text": "Mark Billinghurst, Ivan Poupyrev, Hirokazu Kato, and Richard May. 2000. Mixing realities in shared space: An augmented reality interface for collaborative computing. In Multimedia and Expo, 2000. ICME 2000. 2000 IEEE International Conference on, Vol. 3. IEEE, 1641--1644.",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman and Ryan P. McMahan. 2007. Virtual Reality: How Much Immersion Is Enough? Computer 40, 7 (July 2007), 36--43. DOI: http://dx.doi.org/10.1109/MC.2007.257  ",
      "doi": "10.1109/MC.2007.257"
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1 (1994), 49--59. ",
      "doi": ""
    },
    {
      "text": "Raffaello Brondi, Leila Alem, Giovanni Avveduto, Claudia Faita, Marcello Carrozzino, Franco Tecchia, and Massimo Bergamasco. 2015. Evaluating the Impact of Highly Immersive Technologies and Natural Interaction on Player Engagement and Flow Experience in Games. Springer International Publishing, Cham, 169--181. DOI: http://dx.doi.org/10.1007/978--3--319--24589--8_13",
      "doi": ""
    },
    {
      "text": "Andreas Butz, Tobias Hollerer, Steven Feiner, Blair MacIntyre, and Clifford Beshers. 1999. Enveloping users and computers in a collaborative 3D augmented reality. In Augmented Reality, 1999.(IWAR'99) Proceedings. 2nd IEEE and ACM International Workshop on. IEEE, 35--44.",
      "doi": "10.5555/857202.858143"
    },
    {
      "text": "Christer Carlsson and Olof Hagsand. 1993. DIVE A multi-user virtual reality system. In Virtual Reality Annual International Symposium, 1993., 1993 IEEE. IEEE, 394--400.  ",
      "doi": "10.1109/VRAIS.1993.380753"
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic Turk: A Motion Platform Based on People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3463--3472. DOI: http://dx.doi.org/10.1145/2556288.2557101  ",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. TurkDeck: Physical Virtual Reality Based on People. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 417--426. DOI: http://dx.doi.org/10.1145/2807442.2807463  ",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Elizabeth F Churchill and Dave Snowdon. 1998. Collaborative virtual environments: an introductory review of issues and systems. Virtual Reality 3, 1 (1998), 3--15. ",
      "doi": "10.1007/BF01409793"
    },
    {
      "text": "K. Coninx, F. Van Reeth, and E. Flerackers. 1997. A Hybrid 2D / 3D User Interface for Immersive Object Modeling. In Proceedings of the 1997 Conference on Computer Graphics International (CGI '97). IEEE Computer Society, Washington, DC, USA, 47--. http://dl.acm.org/citation.cfm?id=792756.792856 ",
      "doi": ""
    },
    {
      "text": "HTC Corporation. 2016a. HTC Vive. https://www.htcvive.com. (2016). Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "Sony Corporation. 2016b. PlayStation VR. https: //www.playstation.com/en-us/explore/playstation-vr/. (2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "N. J. Dedual, O. Oda, and S. K. Feiner. 2011. Creating hybrid user interfaces with a 2D multi-touch tabletop and a 3D see-through head-worn display. In 2011 10th IEEE International Symposium on Mixed and Augmented Reality. 231--232. DOI: http://dx.doi.org/10.1109/ISMAR.2011.6092391  ",
      "doi": "10.1109/ISMAR.2011.6092391"
    },
    {
      "text": "Die Gute Fabrik. 2016. Johann Sebastian Joust. Game [PlayStation 4]. (2016). Die Gute Fabrik, Copenhagen, DK.",
      "doi": ""
    },
    {
      "text": "Thierry Duval and Cédric Fleury. 2009. An asymmetric 2d pointer/3d ray for 3d interaction within collaborative virtual environments. In Proceedings of the 14th international Conference on 3D Web Technology. ACM, 33--41.",
      "doi": "10.1145/1559764.1559769"
    },
    {
      "text": "Kevin Fan, Liwei Chan, Daiya Kato, Kouta Minamizawa, and Masahiko Inami. 2016. VR Planet: Interface for Meta-view and Feet Interaction of VR Contents. In ACM SIGGRAPH 2016 VR Village (SIGGRAPH '16). ACM, New York, NY, USA, Article 24, 2 pages. DOI: http://dx.doi.org/10.1145/2929490.2931001  ",
      "doi": "10.1145/2929490.2931001"
    },
    {
      "text": "Foreign VR. 2016. Ruckus Ridge VR Party. Game [HTC Vive]. (2016). Foreign VR, Palo Alto, USA.",
      "doi": ""
    },
    {
      "text": "Brian Gajadhar, Yvonne de Kort, and Wijnand IJsselsteijn. 2008. Influence of Social Setting on Player Experience of Digital Games. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 3099--3104. DOI: http://dx.doi.org/10.1145/1358628.1358814  ",
      "doi": "10.1145/1358628.1358814"
    },
    {
      "text": "Yue Gao and Regan Mandryk. 2012. The Acute Cognitive Benefits of Casual Exergame Play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1863--1872. DOI: http://dx.doi.org/10.1145/2207676.2208323  ",
      "doi": "10.1145/2207676.2208323"
    },
    {
      "text": "Chaim Gartenberg. 2015. The future of gaming is lonely (and online only). (June 2015). http://www.theverge.com/ 2015/6/25/8844073/goodbye-local-multiplayer-we-willmiss-you-and-the-goldeneye-days-of-yore Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "Google. 2016. Tilt Brush. https://www.tiltbrush.com/. (2016). Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer. 2016. Nomadic Virtual Reality: Exploring New Interaction Concepts for Mobile Virtual Reality Head-Mounted Displays. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, New York, NY, USA, 9--12. DOI: http://dx.doi.org/10.1145/2984751.2984783  ",
      "doi": "10.1145/2984751.2984783"
    },
    {
      "text": "Jan Gugenheimer, David Dobbelstein, Christian Winkler, Gabriel Haas, and Enrico Rukzio. 2016a. FaceTouch: Enabling Touch Interaction in Display Fixed UIs for Mobile Virtual Reality. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 49--60. DOI: http://dx.doi.org/10.1145/2984511.2984576  ",
      "doi": "10.1145/2984511.2984576"
    },
    {
      "text": "Jan Gugenheimer, Frank Honold, Dennis Wolf, Felix Schüssel, Julian Seifert, Michael Weber, and Enrico Rukzio. 2016b. How Companion-Technology can Enhance a Multi-Screen Television Experience: A Test Bed for Adaptive Multimodal Interaction in Domestic Environments. KI - Künstliche Intelligenz 30, 1 (2016), 37--44. DOI:http://dx.doi.org/10.1007/s13218-015-0395--7",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016c. GyroVR: Simulating Inertia in Virtual Reality Using Head Worn Flywheels. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 227--232. DOI: http://dx.doi.org/10.1145/2984511.2984535  ",
      "doi": "10.1145/2984511.2984535"
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Gabriel Haas, Sebastian Krebs, and Enrico Rukzio. 2016d. SwiVRChair: A Motorized Swivel Chair to Nudge Users' Orientation for 360 Degree Storytelling in Virtual Reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1996--2000. DOI: http://dx.doi.org/10.1145/2858036.2858040  ",
      "doi": "10.1145/2858036.2858040"
    },
    {
      "text": "Roland Holm, Erwin Stauder, Roland Wagner, Markus Priglinger, and Jens Volkert. 2002. A combined immersive and desktop authoring tool for virtual environments. In Virtual Reality, 2002. Proceedings. IEEE. IEEE, 93--100. ",
      "doi": ""
    },
    {
      "text": "Hikaru Ibayashi, Yuta Sugiura, Daisuke Sakamoto, Natsuki Miyata, Mitsunori Tada, Takashi Okuma, Takeshi Kurata, Masaaki Mochimaru, and Takeo Igarashi. 2015. Dollhouse VR: a multi-view, multi-user collaborative design workspace with VR technology. In SIGGRAPH Asia 2015 Emerging Technologies. ACM, 8.  ",
      "doi": "10.1145/2818466.2818480"
    },
    {
      "text": "WA IJsselsteijn, YAW De Kort, and K Poels. 2013. The Game Experience Questionnaire: Development of a self-report measure to assess the psychological impact of digital games. (2013).",
      "doi": ""
    },
    {
      "text": "Wijnand IJsselsteijn, Yvonne De Kort, Karolien Poels, Audrius Jurgelionis, and Francesco Bellotti. 2007. Characterising and measuring user experiences in digital games. In International conference on advances in computer entertainment technology, Vol. 2. 27.",
      "doi": ""
    },
    {
      "text": "Robert Johansen. 1988. Groupware: Computer support for business teams. The Free Press.",
      "doi": "10.5555/542298"
    },
    {
      "text": "Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-camera Units. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 637--644. DOI:http://dx.doi.org/10.1145/2642918.2647383  ",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: Peripheral Projected Illusions for Interactive Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 869--878. DOI: http://dx.doi.org/10.1145/2470654.2466112  ",
      "doi": "10.1145/2470654.2466112"
    },
    {
      "text": "Matthew Kay and Jacob O. Wobbrock. 2016. ARTool: Aligned Rank Transform for Nonparametric Factorial ANOVAs. https://github.com/mjskay/ARTool R package version 0.10.2.",
      "doi": ""
    },
    {
      "text": "J Matias Kivikangas, Guillaume Chanel, Ben Cowley, Inger Ekman, Mikko Salminen, Simo Järvelä, and Niklas Ravaja. 2011. A review of the use of psychophysiological methods in game research. Journal of Gaming & Virtual Worlds 3, 3 (2011), 181--199.",
      "doi": ""
    },
    {
      "text": "Pascal Knierim, Markus Funk, Thomas Kosch, Anton Fedosov, Tamara Müller, Benjamin Schopf, Marc Weise, and Albrecht Schmidt. 2016. UbiBeam++: Augmenting Interactive Projection with Head-Mounted Displays. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 112, 6 pages. DOI: http://dx.doi.org/10.1145/2971485.2996747  ",
      "doi": "10.1145/2971485.2996747"
    },
    {
      "text": "Siân E. Lindley, James Le Couteur, and Nadia L. Berthouze. 2008. Stirring Up Experience Through Movement in Game Play: Effects on Engagement and Social Behaviour. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 511--514. DOI: http://dx.doi.org/10.1145/1357054.1357136  ",
      "doi": "10.1145/1357054.1357136"
    },
    {
      "text": "Regan L. Mandryk and M. Stella Atkins. 2007. A Fuzzy Physiological Approach for Continuously Modeling Emotion During Interaction with Play Technologies. Int. J. Hum.-Comput. Stud. 65, 4 (April 2007), 329--347. DOI: http://dx.doi.org/10.1016/j.ijhcs.2006.11.011  ",
      "doi": "10.1016/j.ijhcs.2006.11.011"
    },
    {
      "text": "Joe Marshall, Conor Linehan, and Adrian Hazzard. 2016. Designing brutal multiplayer video games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2669--2680.  ",
      "doi": "10.1145/2858036.2858080"
    },
    {
      "text": "Florian Mueller, Stefan Agamanolis, and Rosalind Picard. 2003. Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 561--568. DOI: http://dx.doi.org/10.1145/642611.642709  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Haruo Noma, Tsutomu Miyasato, and Fumio Kishino. 1996. A Palmtop Display for Dextrous Manipulation with Haptic Sensation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96). ACM, New York, NY, USA, 126--133. DOI: http://dx.doi.org/10.1145/238386.238454  ",
      "doi": "10.1145/238386.238454"
    },
    {
      "text": "Ohan Oda, Carmine Elvezio, Mengu Sukan, Steven Feiner, and Barbara Tversky. 2015. Virtual Replicas for Remote Assistance in Virtual and Augmented Reality. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 405--415. DOI: http://dx.doi.org/10.1145/2807442.2807497  ",
      "doi": "10.1145/2807442.2807497"
    },
    {
      "text": "Jauvane C Oliveira, Xiaojun Shen, and Nicolas D Georganas. 2000. Collaborative virtual environment for industrial training and e-commerce. IEEE VRTS 288 (2000).",
      "doi": ""
    },
    {
      "text": "Mat Ombler. 2015. Why Split-Screen Gaming is Dying (And Why We Should Mourn It). http://www.highsnobiety.com/2015/09/09/split-screengaming-dead/. (Sept. 2015). Accessed: 2016-09--15.",
      "doi": ""
    },
    {
      "text": "Oliver Otto, Dave Roberts, and Robin Wolff. 2006. A review on effective closely-coupled collaboration using immersive CVE's. In Proceedings of the 2006 ACM international conference on Virtual reality continuum and its applications. ACM, 145--154.  ",
      "doi": "10.1145/1128923.1128947"
    },
    {
      "text": "Robin Parker. 2014. Opinion: Is Split-Screen Dead? http://www.godisageek.com/2014/06/opinion-split-screendead/. (June 2014). Accessed: 2016-09--15.",
      "doi": ""
    },
    {
      "text": "Danakorn Nincarean Eh Phon, Mohamad Bilal Ali, and Noor Dayana Abd Halim. 2014. Collaborative Augmented Reality in Education: A Review. In Teaching and Learning in Computing and Engineering (LaTiCE), 2014 International Conference on. IEEE, 78--83.",
      "doi": "10.1109/LaTiCE.2014.23"
    },
    {
      "text": "Ramesh Raskar, Jeroen van Baar, Paul Beardsley, Thomas Willwacher, Srinivas Rao, and Clifton Forlines. 2003. iLamps: Geometrically Aware and Self-configuring Projectors. ACM Trans. Graph. 22, 3 (July 2003), 809--818. DOI:http://dx.doi.org/10.1145/882262.882349  ",
      "doi": "10.1145/882262.882349"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, and Henry Fuchs. 1998. Spatially augmented reality. In First IEEE Workshop on Augmented Reality (IWAR'98). Citeseer, 11--20.",
      "doi": "10.5555/322690.322696"
    },
    {
      "text": "SCE Japan Studio. 2016. The Playroom VR. Game [PS4/PS VR]. (2016). SCCE, London, UK.",
      "doi": ""
    },
    {
      "text": "Dieter Schmalstieg, Anton Fuhrmann, Gerd Hesina, Zsolt Szalavári, L Miguel Encarnaçao, Michael Gervautz, and Werner Purgathofer. 2002. The studierstube augmented reality project. Presence: Teleoperators and Virtual Environments 11, 1 (2002), 33--54.  ",
      "doi": "10.1162/105474602317343640"
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of presence in virtual environments. Presence: Teleoperators & Virtual Environments 3, 2 (1994), 130--144.  ",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Aaron Stafford, Wayne Piekarski, and Bruce Thomas. 2006. Implementation of God-like Interaction Techniques for Supporting Collaboration Between Outdoor AR and Indoor Tabletop Users. In Proceedings of the 5th IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR '06). IEEE Computer Society, Washington, DC, USA, 165--172. DOI: http://dx.doi.org/10.1109/ISMAR.2006.297809  ",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "Steel Crate Games. 2015. Keep Talking And Nobody Explodes. Game [HTC Vive]. (2015). Steel Crate Games, Ottawa, CA.",
      "doi": ""
    },
    {
      "text": "Team Future. 2016. Black Hat Cooperative. Game [HTC Vive]. (2016). Team Future, Boston, USA.",
      "doi": ""
    },
    {
      "text": "TomorrowTodayLabs. 2016. NewtonVR. https://github.com/TomorrowTodayLabs/NewtonVR. (2016). Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "Valve. 2016. Valve Data Suggests Developers Should Seriously Consider Room-Scale VR. http://uploadvr.com/steamvr-usage-data-room-scale/. (2016). Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "VALVE. 2016. Virtual Reality - SteamVR featuring the HTC Vive. https://www.youtube.com/watch?v=qYfNzhLXYGc. (2016). Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "Alladi Venkatesh, Erik Kruse, and Eric Chuan-Fong Shih. 2003. The networked home: an analysis of current developments and future trends. Cognition, Technology & Work 5, 1 (2003), 23--32. DOI: http://dx.doi.org/10.1007/s10111-002-0113--8",
      "doi": ""
    },
    {
      "text": "Amy Voida, Sheelagh Carpendale, and Saul Greenberg. 2010. The individual and the group in console gaming. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 371--380.  ",
      "doi": "10.1145/1718918.1718983"
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii all play: the console game as a computational meeting place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1559--1568.  ",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Wikipedia. 2016. Statues (game). https://en.wikipedia.org/wiki/Statues_(game). (2016). Accessed: 2016-09-07.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 143--146.",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}