{
  "doi": "10.1145/3025453.3025512",
  "title": "Showing People Behind Data: Does Anthropomorphizing Visualizations Elicit More Empathy for Human Rights Data?",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5462-5474",
  "year": 2017,
  "badges": [],
  "abstract": "We investigate the impact of using anthropomorphized data graphics over standard charts on viewers' empathy for, and prosocial behavior toward suffering populations, in the context of human rights narratives. We present a series of experiments conducted on Amazon Mechanical Turk, in which we compare various forms of anthropomorphized data graphics-ranging from a single human figure that \"fills up\" to show proportional data, to separated groups of individual human beings-with a standard chart baseline. Each experiment uses two carefully crafted human rights data-driven stories to present the graphics. Contrary to our expectations, we consistently find that anthropomorphized data graphics and standard charts have very similar effects on empathy and prosocial behavior.",
  "authors": [
    {
      "name": "Jeremy Boy",
      "institution": "United Nations, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707753",
      "orcid": "missing"
    },
    {
      "name": "Anshul Vikram Pandey",
      "institution": "New York University, Brooklyn, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550925956",
      "orcid": "missing"
    },
    {
      "name": "John Emerson",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161882",
      "orcid": "missing"
    },
    {
      "name": "Margaret Satterthwaite",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699937",
      "orcid": "missing"
    },
    {
      "name": "Oded Nov",
      "institution": "New York University, Brooklyn, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339520089",
      "orcid": "missing"
    },
    {
      "name": "Enrico Bertini",
      "institution": "New York University, Brooklyn, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100628712",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A Collection of anthropographics. http://myjyby.github.io/Athropographics/www/.",
      "doi": ""
    },
    {
      "text": "A Hommage to Gerd Arntz. http://www.gerdarntz.org/.",
      "doi": ""
    },
    {
      "text": "World Humanitarian Data and Trends. http://online.fliphtml5.com/srhi/mtgf/#p=35, 2015.",
      "doi": ""
    },
    {
      "text": "American Psychological Association. The Publication manual of the American psychological association (6th ed.). Washington, DC, 2010.",
      "doi": ""
    },
    {
      "text": "D. M. Bartels and R. C. Burnett. A group construal account of drop-in-the-bucket thinking in policy preference and moral judgment. Journal of Experimental Social Psychology, 47(1):50--57, 2011.",
      "doi": ""
    },
    {
      "text": "S. Bateman, R. L. Mandryk, C. Gutwin, A. Genest, D. McDine, and C. Brooks. Useful Junk?: The Effects of Visual Embellishment on Comprehension and Memorability of Charts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, pages 2573--2582, New York, NY, USA, 2010. ACM.  ",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "C. D. Batson. Prosocial Motivation: Is it ever Truly Altruistic? volume 20 of Advances in Experimental Social Psychology, pages 65--122. Academic Press, 1987.",
      "doi": ""
    },
    {
      "text": "C. D. Batson. The Altruism Question: Toward a Social Psychological Answer. L. Erlbaum, 1991.",
      "doi": ""
    },
    {
      "text": "C. D. Batson. Empathy-Induced Altruistic Motivation. Prosocial motives, emotions, and behavior: The better angels of our nature, pages 15--34, 2010.",
      "doi": ""
    },
    {
      "text": "D. Bischof-Köhler. The development of empathy in infants. In Infant Development: Perspectives from German Speaking Countries, chapter 12, pages 245--273. Lawrence Erlbaum Associates, Inc, 1991.",
      "doi": ""
    },
    {
      "text": "P. Bloom. Against Empathy. http: //bostonreview.net/forum/paul-bloom-against-empathy, 2014.",
      "doi": ""
    },
    {
      "text": "R. Borgo, A. Abdul-Rahman, F. Mohamed, P. W. Grant, I. Reppa, L. Floridi, and M. Chen. An Empirical Study on Using Visual Embellishments in Visualization. IEEE Transactions on Visualization and Computer Graphics, 18(12):2759--2768, Dec 2012.  ",
      "doi": "10.1109/TVCG.2012.197"
    },
    {
      "text": "M. A. Borkin, Z. Bylinskii, N. W. Kim, C. M. Bainbridge, C. S. Yeh, D. Borkin, H. Pfister, and A. Oliva. Beyond Memorability: Visualization Recognition and Recall. IEEE Transactions on Visualization and Computer Graphics, 22(1):519--528, Jan 2016.",
      "doi": "10.1109/TVCG.2015.2467732"
    },
    {
      "text": "M. A. Borkin, A. A. Vo, Z. Bylinskii, P. Isola, S. Sunkavalli, A. Oliva, and H. Pfister. What Makes a Visualization Memorable? IEEE Transactions on Visualization and Computer Graphics, 19(12):2306--2315, 2013.  ",
      "doi": "10.1109/TVCG.2013.234"
    },
    {
      "text": "J. Boy, L. Eveillard, F. Detienne, and J. D. Fekete. Suggested Interactivity: Seeking Perceived Affordances for Information Visualization. IEEE Transactions on Visualization and Computer Graphics, 22(1):639--648, 2016.",
      "doi": "10.1109/TVCG.2015.2467201"
    },
    {
      "text": "C. Burke, E. Kindel, and S. Walker. Isotype: Design and Contexts 1925--1971. Princeton Architectural Press, 2014.",
      "doi": ""
    },
    {
      "text": "A. Cairo. Empathy and Visualization. http://www.thefunctionalart.com/2016/02/ empathy-and-visualization.html, 2016.",
      "doi": ""
    },
    {
      "text": "M. Chalabi. https://www.instagram.com/mona_chalabi/.",
      "doi": ""
    },
    {
      "text": "F. Chevalier, R. Vuillemot, and G. Gali. Using Concrete Scales: A Practical Framework for Effective Visual Depiction of Complex Measures. IEEE Transactions on Visualization and Computer Graphics, 19(12):2426--2435, 2013.  ",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "G. Cumming. The New Statistics: Why and How. Psychological science, 25(1):7--29, 2014.",
      "doi": ""
    },
    {
      "text": "M. H. Davis. Measuring individual differences in empathy: Evidence for a multidimensional approach. Journal of Personality and Social Psychology, 44(1):113--126, 1983.",
      "doi": ""
    },
    {
      "text": "P. Dragicevic. Fair Statistical Communication in HCI. In Modern Statistical Methods for HCI, pages 291--330. Springer, 2016.",
      "doi": ""
    },
    {
      "text": "S. M. Drucker and R. Fernandez. A Unifying Framework for Animated and Interactive Unit Visualizations. Technical Report MSR-TR-2015--65, 2015.",
      "doi": ""
    },
    {
      "text": "C. J. Einolf. Empathic concern and prosocial behaviors: A test of experimental results using survey data. Social Science Research, 37, 2008.",
      "doi": ""
    },
    {
      "text": "N. Eisenberg. Empathy-Related Responding: Links with Self-Regulation, Moral Judgment, and Moral Behavior. Prosocial motives, emotions, and behavior: The better angels of our nature, pages 129--148, 2010.",
      "doi": ""
    },
    {
      "text": "N. Eisenberg, A. Cumberland, I. K. Guthrie, B. C. Murphy, and S. A. Shepard. Age Changes in Prosocial Responding and Moral Reasoning in Adolescence and Early Adulthood. Journal of Research on Adolescence, 15(3):235--260, 2005.",
      "doi": ""
    },
    {
      "text": "N. Eisenberg and P. A. Miller. The Relation of Empathy to Prosocial and Related Behaviors. Psychological Bulletin, 101(1):91--119, 1987.",
      "doi": ""
    },
    {
      "text": "J. Emerson. Ten Challenges to the Use of Data Visualization in Human Rights. http://backspace.com/notes/2016/02/ten-challenges.php, 2016.",
      "doi": ""
    },
    {
      "text": "B. L. G. D. Feng, C. Beyond Data: Abstract Motionscape as Affective Visualization. Leonardo/ISAST, 2014.",
      "doi": ""
    },
    {
      "text": "A. Genevsky, D. Västfjäll, P. Slovic, and B. Knutson. Neural Underpinnings of the Identiflable Victim Effect: Affect Shifts Preferences for Giving. The Journal of Neuroscience, 33(43):17188--17196, 2013.",
      "doi": ""
    },
    {
      "text": "C. C. Gould. Globalizing Democracy and Human Rights. Cambridge University Press, 2006.",
      "doi": ""
    },
    {
      "text": "T. Grodal. Visual Communication as Textsigns and as Embodied Mental Processes. In Nordic Visual Communication Conference, Oslo, 1994.",
      "doi": ""
    },
    {
      "text": "N. Halloran. The Fallen of World War II. http://www.fallen.io/ww2/.",
      "doi": ""
    },
    {
      "text": "K. Haramundanis. Why icons cannot stand alone. SIGDOC Asterisk J. Comput. Doc., 20(2):1--8, May 1996.  ",
      "doi": "10.1145/381815.381819"
    },
    {
      "text": "S. Haroz, R. Kosara, and S. L. Franconeri. Isotype visualization: Working memory, performance, and engagement with pictographs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, pages 1191--1200, New York, NY, USA, 2015. ACM.  ",
      "doi": "10.1145/2702123.2702275"
    },
    {
      "text": "J. Harris. Connecting with the Dots. https: //source.opennews.org/en-US/learning/connecting-dots/, 2015.",
      "doi": ""
    },
    {
      "text": "M. A. Harrison and A. Hall. Anthropomorphism, Empathy, and Perceived Communicative Ability Vary with Phylogenetic Relatedness to Humans. Journal of Social, Evolutionary, and Cultural Psychology, 4(1), 2010.",
      "doi": ""
    },
    {
      "text": "M. Hoffman. Prosocial Behavior and Empathy: Developmental Processes. In N. J. S. B. Baltes, editor, International Encyclopedia of the Social & Behavioral Sciences, pages 12230--12233. Pergamon, Oxford, 2001.",
      "doi": ""
    },
    {
      "text": "K. Jenni and G. Loewenstein. Explaining the Identi?able Victim Effect. Journal of Risk and Uncertainty, 14(3):235--257, 1997.",
      "doi": ""
    },
    {
      "text": "S. Keen. Narrative Empathy. http://wikis.sub. uni-hamburg.de/lhn/index.php/Narrative_Empathy, 2013.",
      "doi": ""
    },
    {
      "text": "M. Krzywinski and N. Altman. Points of Signi?cance: Error bars. Nature Methods, 10:921--922, 2013.",
      "doi": ""
    },
    {
      "text": "S. Lambert. And What Do I Do Now? Using Data Visualization for Social Change. http://artisticactivism. org/2016/01/data-visualization-for-what/, 2016.",
      "doi": ""
    },
    {
      "text": "S. Lee, K. P. Winterich, and W. T. Ross. I'm moral, but I won't help you: The distinct roles of empathy and justice in donations. Journal of Consumer Research, 41(3):678--696, 2014.",
      "doi": ""
    },
    {
      "text": "J. C. Lester, S. A. Converse, S. E. Kahler, S. T. Barlow, B. A. Stone, and R. S. Bhogal. The persona effect: Affective impact of animated pedagogical agents. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems, CHI '97, pages 359--366, New York, NY, USA, 1997. ACM.  ",
      "doi": "10.1145/258549.258797"
    },
    {
      "text": "S. McCloud. Understanding Comics. A Kitchen Sink book. HarperCollins, 1994.",
      "doi": ""
    },
    {
      "text": "S. McCloud. Making Comics. HarperCollins, 2011.",
      "doi": ""
    },
    {
      "text": "N. M. McDonald and D. S. Messinger. The Development of Empathy: How, When, and Why. In A. A., L. J. A, and S. J. J., editors, Free Will, Emotions, and Moral Actions: Philosophy and Neuroscience in Dialogue, pages 341--368. IF-Press Morolo, 2011.",
      "doi": ""
    },
    {
      "text": "J. Miksatko, K. H. Kipp, and M. Kipp. The persona zero-effect: Evaluating virtual character benefits on a learning task with repeated interactions. In International Conference on Intelligent Virtual Agents, pages 475--481. Springer, 2010. ",
      "doi": "10.5555/1889075.1889133"
    },
    {
      "text": "S. E. Moriarty. Abduction: A Theory of Visual Interpretation. Communication Theory, 6(2):167--187, 1996.",
      "doi": ""
    },
    {
      "text": "A. V. Pandey, A. Manivannan, O. Nov, M. Satterthwaite, and E. Bertini. The persuasive power of data visualization. Visualization and Computer Graphics, IEEE Transactions on, 20(12):2211--2220, 2014.",
      "doi": ""
    },
    {
      "text": "A. V. Pandey, K. Rall, M. L. Satterthwaite, O. Nov, and E. Bertini. How Deceptive Are Deceptive Visualizations?: An Empirical Analysis of Common Distortion Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, CHI '15, pages 1469--1478, 2015.  ",
      "doi": "10.1145/2702123.2702608"
    },
    {
      "text": "C. S. Peirce. Peirce on signs.",
      "doi": ""
    },
    {
      "text": "Periscopic. U.S. Gun Deaths. http://guns.periscopic.com/?year=2013.",
      "doi": ""
    },
    {
      "text": "L. D. Riek, T.-C. Rabinowitch, B. Chakrabarti, and P. Robinson. How Anthropomorphism Affects Empathy Toward Robots. In Proceedings of the 4th ACM/IEEE International Conference on Human Robot Interaction, HRI '09, pages 245--246, 2009.  ",
      "doi": "10.1145/1514095.1514158"
    },
    {
      "text": "J. Schwabish. Policyviz Podcast Episode #31: Rees & Mushon on DataViz Empathy. http://policyviz.com/rees-mushon-on-dataviz-empathy/, 2016.",
      "doi": ""
    },
    {
      "text": "E. Segel and J. Heer. Narrative Visualization: Telling Stories with Data. IEEE Transactions on Visualization and Computer Graphics, 16(6):1139--1148, 2010.  ",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "J. Shang, A. R. II, and R. Croson. Identity Congruency Effects on Donations. Journal of Marketing Research, 45(3):351--361, 2008.",
      "doi": ""
    },
    {
      "text": "S. Slobin. What if the Data Visualization is Actually People? https://source.opennews.org/en-US/learning/ what-if-data-visualization-actually-people/, 2014.",
      "doi": ""
    },
    {
      "text": "P. Slovic, M. L. Finucane, E. Peters, and D. G. MacGregor. The Affect Heuristic. European Journal of Operational Research, 177(3):1333--1352, 2007.",
      "doi": ""
    },
    {
      "text": "P. Slovic and D. Zionts. Can International Law Stop Genocide when our Moral Intuitions Fail Us? In D. J. Ryan Goodman and A. K. Woods, editors, Understanding Social Action, Promoting Human Rights, pages 100--128. 2012.",
      "doi": ""
    },
    {
      "text": "The New York Times. Death in Syria. http://www.nytimes.com/interactive/2015/09/14/world/ middleeast/syria-war-deaths.html?action=click& contentCollection=Middle%20East&#174;ion=Footer&module= WhatsNext&version=WhatsNext&contentID=WhatsNext& moduleDetail=undefined&pgtype=Multimedia&_r=0.",
      "doi": ""
    },
    {
      "text": "E. R. Tufte. The Visual Display of Quantitative Information. Graphics Press, Cheshire, CT, USA, 1986. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "A. Tversky and D. Kahneman. Availability: A heuristic for judging frequency and probability. Cognitive Psychology, 5(2):207--232, 1973.",
      "doi": ""
    },
    {
      "text": "G. A. Verhaert and D. V. den Poel. Empathy as added value in predicting donation behavior. Journal of Business Research, 64(12):1288--1295, 2011.",
      "doi": ""
    },
    {
      "text": "A. Waytz, J. Cacioppo, and N. Epley. Who Sees Human? The Stability and Importance of Individual Differences in Anthropomorphism. Perspectives on psychological science : a journal of the Association for Psychological Science, 5:219--232, 2014.",
      "doi": ""
    },
    {
      "text": "M. Zer-Aviv. DataViz--The UnEmpathic Art. https: //responsibledata.io/dataviz-the-unempathetic-art/, 2015.",
      "doi": ""
    },
    {
      "text": "M. Zer-Aviv. Responsible Data Forum: Visualization. https://responsibledata.io/forums/data-visualization/, 2016.",
      "doi": ""
    }
  ]
}