{
  "doi": "10.1145/3025453.3025583",
  "title": "EnseWing: Creating an Instrumental Ensemble Playing Experience for Children with Limited Music Training",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4326-4330",
  "year": 2017,
  "badges": [],
  "abstract": "While instrumental ensemble playing can benefit children's music education and collaboration skill development, it requires extensive training on music and instruments, which many school children lack. To help children with limited music training experience instrumental ensemble playing, we created EnseWing, an interactive system that offers such an experience. In this paper, we report the design of the EnseWing experience and a two-month field study. Our results show that EnseWing preserves the music and ensemble skills from traditional instrumental ensemble and provides more collaboration opportunities for children.",
  "tags": [
    "children",
    "collaboration",
    "instrumental ensemble",
    "music"
  ],
  "authors": [
    {
      "name": "Fei Lyu",
      "institution": "Chinese Academy of Sciences & Beijing University of Posts and Telecommunications, Beijing, China",
      "img": "/do/10.1145/contrib-81484645699/rel-imgonly/feilyu-120px.jpg",
      "acmid": "81484645699",
      "orcid": "missing"
    },
    {
      "name": "Feng Tian",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106876",
      "orcid": "0000-0002-6598-419X"
    },
    {
      "name": "Wenxin Feng",
      "institution": "Boston University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-81488664482/rel-imgonly/img_1604.jpg",
      "acmid": "81488664482",
      "orcid": "missing"
    },
    {
      "name": "Xiang Cao",
      "institution": "Xiaoxiaoniu Creative Technologies, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100130420",
      "orcid": "missing"
    },
    {
      "name": "Xiaolong (Luke) Zhang",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491376",
      "orcid": "missing"
    },
    {
      "name": "Guozhong Dai",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100172122",
      "orcid": "missing"
    },
    {
      "name": "Hongan Wang",
      "institution": "Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100220294",
      "orcid": "0000-0002-9320-4920"
    }
  ],
  "references": [
    {
      "text": "Datavyu. http://datavyu.org",
      "doi": ""
    },
    {
      "text": "PLOrk. http://plork.cs.princeton.edu",
      "doi": ""
    },
    {
      "text": "Rock Band. http://www.rockband.com/international",
      "doi": ""
    },
    {
      "text": "SLOrk http://slork.stanford.edu",
      "doi": ""
    },
    {
      "text": "Wii Music. http://en.wikipedia.org/wiki/Wii_music",
      "doi": ""
    },
    {
      "text": "Anthony, L., Kim, Y. and Findlater, L. 2013. Analyzing user-generated youtube videos to understand touchscreen use by people with motor impairments. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Bakker, S., Antle, A. N. and Hoven, E. v. d. 2009. Identifying embodied metaphors in children's sound-action mappings. Proceedings of the 8th International Conference on Interaction Design and Children, 140149.  ",
      "doi": "10.1145/1551788.1551812"
    },
    {
      "text": "Beaton, B., Harrison, S. and Tatar, D. 2010. Digital drumming: a study of co-located, highly coordinated, dyadic collaboration. Proceedings of the 28th international conference on Human factors in computing systems, 1417--1426.  ",
      "doi": "10.1145/1753326.1753538"
    },
    {
      "text": "Blaine, T. and Perkis, T. 2000. The Jam-O-Drum interactive music system: a study in interaction design. Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, 165--173.  ",
      "doi": "10.1145/347642.347705"
    },
    {
      "text": "Gurevich, M. 2006. JamSpace: a networked real-time collaborative music environment. CHI '06 extended abstracts on Human factors in computing systems, 821826.",
      "doi": "10.1145/1125451.1125613"
    },
    {
      "text": "Hailpern, J., Karahalios, K., Halle, J., Dethorne, L. and Coletto, M.-K. 2009. A3: HCI Coding Guideline for Research Using Video Annotation to Assess Behavior of Nonverbal Subjects with Computer-Based Intervention. ACM Trans. Access. Comput., 2,2, 1--29.  ",
      "doi": "10.1145/1530064.1530066"
    },
    {
      "text": "Halpern, M. K., Tholander, J., Evjen, M., Davis, S., Ehrlich, A., Schustak, K., Baumer, E. P. S. and Gay, G. 2011. MoBoogie: creative expression through whole body musical interaction. Proceedings of the 2011 annual conference on Human factors in computing systems, 557--560.  ",
      "doi": "10.1145/1978942.1979020"
    },
    {
      "text": "Haselbach, B. 2014. Texts on Theory and Practice of Orff-Schulwerk. Central Conservatory of Music Press.",
      "doi": ""
    },
    {
      "text": "Kusunoki, F., Sugimoto, M. and Hashizume, H. 2002. Symphony-Q: a support system for learning music through collaboration. Proceedings of the Conference on Computer Support for Collaborative Learning: Foundations for a CSCL Community, 491--492. ",
      "doi": ""
    },
    {
      "text": "Li, D., Xiu, H. and Yin., A. 2014. Thought and Practice of Orff music education. Shanghai Education Press.",
      "doi": ""
    },
    {
      "text": "Mead, V. H. 1996. More than Mere Movement Dalcroze Eurhythmics. Music Educators Journal, 82, 4, 38--41. ",
      "doi": ""
    },
    {
      "text": "Piao, D. 2007. Instrumental Ensemble and Conductor. Shanghai Conservatory of Music Press.",
      "doi": ""
    },
    {
      "text": "Yang, L. and Cai, J. 2016. Theory and Practice of Dalcroze music education. Shanghai Education Press.",
      "doi": ""
    },
    {
      "text": "Zhou, Y., Percival, G., Wang, X., Wang, Y. and Zhao, S. 2011. MOGCLASS: evaluation of a collaborative system of mobile devices for classroom music education of young children. Proceedings of the 2011 annual conference on Human factors in computing systems, 523--532.  ",
      "doi": "10.1145/1978942.1979016"
    },
    {
      "text": "Zigelbaum, J., Millner, A., Desai, B. and Ishii, H. 2006. BodyBeats: whole-body, musical interfaces for children. CHI '06 extended abstracts on Human factors in computing systems, 1595--1600.",
      "doi": ""
    }
  ]
}