{
  "doi": "10.1145/3025453.3025835",
  "title": "Understanding Grip Shifts: How Form Factors Impact Hand Movements on Mobile Phones",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4680-4691",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper we present an investigation into how hand usage is affected by different mobile phone form factors. Our initial (qualitative) study explored how users interact with various mobile phone types (touchscreen, physical keyboard and stylus). The analysis of the videos revealed that each type of mobile phone affords specific handgrips and that the user shifts these grips and consequently the tilt and rotation of the phone depending on the context of interaction. In order to further investigate the tilt and rotation effects we conducted a controlled quantitative study in which we varied the size of the phone and the type of grips (Symmetric bimanual, Asymmetric bimanual with finger, Asymmetric bimanual with thumb and Single handed) to better understand how they affect the tilt and rotation during a dual pointing task. The results showed that the size of the phone does have a consequence and that the distance needed to reach action items affects the phones' tilt and rotation. Additionally, we found that the amount of tilt, rotation and reach required corresponded with the participant's grip preference. We finish the paper by discussing the design lessons for mobile UI and proposing design guidelines and applications for these insights.",
  "authors": [
    {
      "name": "Rachel Eardley",
      "institution": "Cardiff Metropolitan University, Cardiff, United Kingdom",
      "img": "/do/10.1145/contrib-81320489242/rel-imgonly/me.png",
      "acmid": "81320489242",
      "orcid": "0000-0002-4838-3413"
    },
    {
      "name": "Anne Roudaut",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    },
    {
      "name": "Steve Gill",
      "institution": "Cardiff Metropolitan University, Cardiff, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414616855",
      "orcid": "missing"
    },
    {
      "name": "Stephen J. Thompson",
      "institution": "Cardiff Metropolitan University, Cardiff, Wales, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068693",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Guiard, Y. (1987). Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. J. Motor Behavior, 19(4), 486--517.",
      "doi": ""
    },
    {
      "text": "iOS App Anatomy Retrieved February 9, 2016 from https://developer.apple.com/library/ios/documentation/ UserExperience/Conceptual/MobileHIG/Anatomy.html #//apple_ref/doc/uid/TP40006556-CH24-SW1",
      "doi": ""
    },
    {
      "text": "K. Kim, W. Chang, S. Cho, J. Shim, H. Lee, J. Park, Y. Lee, and S. Kim. Hand Grip Pattern Recognition for Mobile User Interfaces. In Proceedings of the National Conference on Artificial Intelligence, vol 21, page 1789. Menlo Park, CA; Cambridge, MA; London; AAAI Press; MIT Press; 1999, 2006. ",
      "doi": "10.5555/1597122.1597138"
    },
    {
      "text": "Lung-Pan Cheng, Fang-I Hsiao, Yen-Ting Liu, and Mike Y. Chen. 2012. iRotate: automatic screen rotation based on face orientation. In Proc. (CHI '12). ACM, New York, NY, USA, 2203--2210.  ",
      "doi": "10.1145/2207676.2208374"
    },
    {
      "text": "Lung-Pan Cheng, Hsiang-Sheng Liang, Che-Yang Wu, and Mike Y. Chen. 2013. iGrasp: grasp-based adaptive keyboard for mobile devices. In Proc. (CHI EA '13). ACM, New York, NY, USA, 2791--2792.  ",
      "doi": "10.1145/2468356.2479514"
    },
    {
      "text": "Matei Negulescu , Joanna McGrenere, Grip Change as an Information Side Channel for Mobile Touch Interaction, Proc. 33rd Annual ACM Conference on Human Factors in Computing Systems, April 18--23, 2015, Seoul, Republic of Korea.  ",
      "doi": "10.1145/2702123.2702185"
    },
    {
      "text": "Mohd Noor, M.F., Ramsay, A., Hughes, S., Rogers, S., Williamson, J., and Murray-Smith, R. 28 Frames Later: Predicting Screen Touches from Back-of-device Grip Changes. In Proc. CHI'14, ACM (2014), 2005--2008.  ",
      "doi": "10.1145/2556288.2557148"
    },
    {
      "text": "Napier, J., (1993) Hands, Published by Princeton University Press.",
      "doi": ""
    },
    {
      "text": "R. Wimmer, S. Boring, HandSense: discriminating different ways of grasping and holding a tangible user interface, Proc. 3rd International Conference on Tangible and Embedded Interaction, February 16--18, 2009, Cambridge, United Kingdom  ",
      "doi": "10.1145/1517664.1517736"
    },
    {
      "text": "Youli Chang, Sehi L'Yi, Kyle Koh, and Jinwook Seo. 2015. Understanding Users' Touch Behavior on Large Mobile Touch-Screens and Assisted Targeting by Tilting Gesture. In Proc. CHI '15. ACM, New York, NY, USA, 1499--1508.  ",
      "doi": "10.1145/2702123.2702425"
    },
    {
      "text": "Tactus Retrieved May 3, 2016 from http://tactustechnology.com/technology/",
      "doi": ""
    },
    {
      "text": "Sebastian Boring, David Ledo, Xiang 'Anthony' Chen, Nicolai Marquardt, Anthony Tang, Saul Greenberg The Fat Thumb: Using the Thumb's Contact Size for Single-Handed Mobile Interaction",
      "doi": ""
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the functional area of the thumb on mobile touchscreen surfaces. In Proc. (CHI '14). ACM, New York,USA, 1991--2000.  ",
      "doi": "10.1145/2556288.2557354"
    },
    {
      "text": "Rachel Eardley, Steve Gill, Anne Roudaut, Stephen Thompson, and Joanna Hare. 2016. Investigating how the hand interacts with different mobile phones. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM,  ",
      "doi": "10.1145/2957265.2961840"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. In Proc. (CHI '10). ACM, New York, NY, USA, 581590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Huy Viet Le, Sven Mayer, Katrin Wolf, and Niels Henze. 2016. Finger Placement and Hand Grasp during Smartphone Interaction. In Proc. (CHI EA '16). ACM, New York, NY, USA, 2576--2584.  ",
      "doi": "10.1145/2851581.2892462"
    },
    {
      "text": "Kee-Eung Kim, Wook Chang, Sung-Jung Cho, Junghyun Shim, Hyunjeong Lee, Joonah Park, Youngbeom Lee, and Sangryong Kim. 2006. Hand grip pattern recognition for mobile user interfaces. In Proc. (IAAI'06), Bruce Porter (Ed.), Vol. 2. AAAI Press 1789--1794. ",
      "doi": "10.5555/1597122.1597138"
    },
    {
      "text": "Hyunjin Yoo, Jungwon Yoon, and Hyunsoo Ji. 2015. Index Finger Zone: Study on Touchable Area Expandability Using Thumb and Index Finger. In Proc. (MobileHCI '15). ACM, New York, USA, 803--810.  ",
      "doi": "10.1145/2786567.2793704"
    },
    {
      "text": "Heads-Up webcam viewer Retrieved May 3, 2016 from https://itunes.apple.com/gb/app/headsup-webcamviewer/id583912513?mt=12",
      "doi": ""
    },
    {
      "text": "Silverback 2 Retrieved May 3, 2016 from https://silverbackapp.com/",
      "doi": ""
    },
    {
      "text": "Frameless web browser Retrieved May 3, 2016 from http://stakes.github.io/Frameless/",
      "doi": ""
    },
    {
      "text": "Karsten Seipp and Kate Devlin. 2014. Backpat: improving one-handed touchscreen operation by patting the back of the device. In Proc. (CHI EA '14). ACM, New York, NY, USA, 555--558.  ",
      "doi": "10.1145/2559206.2574811"
    },
    {
      "text": "Ken Hinckley, Seongkook Heo, Michel Pahud, Christian Holz, Hrvoje Benko, Abigail Sellen, Richard Banks, Kenton O'Hara, Gavin Smyth, and William Buxton. 2016. Pre-Touch Sensing for Mobile Interaction. In Proc. (CHI '16). ACM, New York, NY, USA, 2869--2881.  ",
      "doi": "10.1145/2858036.2858095"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, and Htet Htet Aung. 2008. The performance of hand postures in front- and back-of-device interaction for mobile computing. Int. J. Hum.-Comput. Stud. 66, 12 (December 2008), 857--875.  ",
      "doi": "10.1016/j.ijhcs.2008.03.004"
    },
    {
      "text": "Keith B. Perry and Juan Pablo Hourcade. 2008. Evaluating one handed thumb tapping on mobile touchscreen devices. In Proc. (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 57--64. ",
      "doi": "10.5555/1375714.1375725"
    },
    {
      "text": "Kee-Eung Kim, Wook Chang, Sung-Jung Cho, Junghyun Shim, Hyunjeong Lee, Joonah Park, Youngbeom Lee, and Sangryong Kim. 2006. Hand grip pattern recognition for mobile user interfaces. In Proc. (IAAI'06), Bruce Porter (Ed.), Vol. 2. AAAI Press 1789--1794. ",
      "doi": "10.5555/1597122.1597138"
    },
    {
      "text": "Endo, Y., Kanai, S., Kishinami, T., Miyata, N., Kouchi, M. and Mochimaru, M., 2007. Virtual grasping assessment using 3D digital hand model. In Annual Applied Ergonomics Conference: Celebrating the PastShaping the Future.",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch behavior with different postures on soft smartphone keyboards. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12). ACM, New York, NY, USA, 251--260.  ",
      "doi": "10.1145/2371574.2371612"
    }
  ]
}