{
  "doi": "10.1145/3025453.3025571",
  "title": "Leveraging Human Routine Models to Detect and Generate Human Behaviors",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6683-6694",
  "year": 2017,
  "badges": [],
  "abstract": "An ability to detect behaviors that negatively impact people's wellbeing and show people how they can correct those behaviors could enable technology that improves people's lives. Existing supervised machine learning approaches to detect and generate such behaviors require lengthy and expensive data labeling by domain experts. In this work, we focus on the domain of routine behaviors, where we model routines as a series of frequent actions that people perform in specific situations. We present an approach that bypasses labeling each behavior instance that a person exhibits. Instead, we weakly label instances using people's demonstrated routine. We classify and generate new instances based on the probability that they belong to the routine model. We illustrate our approach on an example system that helps drivers become aware of and understand their aggressive driving behaviors. Our work enables technology that can trigger interventions and help people reflect on their behaviors when those behaviors are likely to negatively impact them.",
  "authors": [
    {
      "name": "Nikola Banovic",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81490690455/rel-imgonly/nikola_banovic_portrait_2018_small.jpg",
      "acmid": "81490690455",
      "orcid": "0000-0002-2790-3264"
    },
    {
      "name": "Anqi Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160627",
      "orcid": "missing"
    },
    {
      "name": "Yanfeng Jin",
      "institution": "Middlebury College, Middlebury, VT & Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162786",
      "orcid": "missing"
    },
    {
      "name": "Christie Chang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161150",
      "orcid": "missing"
    },
    {
      "name": "Julian Ramos",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488651069",
      "orcid": "missing"
    },
    {
      "name": "Anind Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    }
  ],
  "references": [
    {
      "text": "Pieter Abbeel and Andrew Y. Ng. 2004. Apprenticeship learning via inverse reinforcement learning. In Proceedings of the twenty-first international conference on Machine learning (ICML '04). ACM, New York, NY, USA, 1--.  ",
      "doi": "10.1145/1015330.1015430"
    },
    {
      "text": "American Automobile Association. 2009. Aggressive driving: Research update. American Automobile Association Foundation for Traffic Safety.",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Tofi Buzali, Fanny Chevalier, Jennifer Mankoff, and Anind K. Dey. 2016. Modeling and Understanding Human Routine Behavior. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 248--260.  ",
      "doi": "10.1145/2858036.2858557"
    },
    {
      "text": "Richard Bellman. 1957. A Markovian decision process. Journal of Mathematics and Mechanics, 6, 679--684.",
      "doi": ""
    },
    {
      "text": "Christopher M. Bishop. 2006. Pattern Recognition and Machine Learning (Information Science and Statistics). Springer-Verlag New York, Inc., Secaucus, NJ, USA. ",
      "doi": "10.5555/1162264"
    },
    {
      "text": "Oliver Brdiczka, Norman Makoto Su, and James Bo Begole. 2010. Temporal task footprinting: identifying routine tasks by their temporal patterns. In Proceedings of the 15th international conference on Intelligent user interfaces (IUI '10). ACM, New York, NY, USA, 281284.  ",
      "doi": "10.1145/1719970.1720011"
    },
    {
      "text": "Paolo Buono, Aleks Aris, Catherine Plaisant, Amir Khella, and Ben Shneiderman. 2005. Interactive pattern search in time series. In Electronic Imaging 2005, 175186.",
      "doi": ""
    },
    {
      "text": "Senaka Buthpitiya, Anind K. Dey, and Martin Griss. 2014. Soft authentication with low-cost signatures. In Proceedings of IEEE International Conference on Pervasive Computing and Communications (PerCom), 2014, IEEE, 172--180.",
      "doi": ""
    },
    {
      "text": "Olivier Chapelle, Bernhard Schlkopf, and Alexander Zien. 2010. Semi-Supervised Learning (1st ed.). The MIT Press. ",
      "doi": "10.5555/1841234"
    },
    {
      "text": "Scott Davidoff, Brian D. Ziebart, John Zimmerman, and Anind K. Dey. 2011. Learning patterns of pick-ups and drop-offs to support busy family coordination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1175--1184.  ",
      "doi": "10.1145/1978942.1979119"
    },
    {
      "text": "Anind K. Dey. 2001. Understanding and Using Context. Personal Ubiquitous Comput. 5, 1 (January 2001), 4--7.  ",
      "doi": "10.1007/s007790170019"
    },
    {
      "text": "Nathan Eagle and Alex S. Pentland. 2009. Eigenbehaviors: identifying structure in routine. Behav. Ecol. Sociobiol., vol. 63, no. 7, 1057--1066.",
      "doi": ""
    },
    {
      "text": "Katayoun Farrahi and Daniel Gatica-Perez. 2012. Extracting Mobile Behavioral Patterns with the Distant N-Gram Topic Model. In Proceedings of the 2012 16th Annual International Symposium on Wearable Computers (ISWC) (ISWC '12). IEEE Computer Society, Washington, DC, USA, 1--8.  ",
      "doi": "10.1109/ISWC.2012.20"
    },
    {
      "text": "Martha S. Feldman and Brian T. Pentland. 2003. Reconceptualizing organizational routines as a source of flexibility and change. Administrative Science Quarterly, 48 (1), 94--118.",
      "doi": ""
    },
    {
      "text": "Pei-Yun Hsueh, Prem Melville, and Vikas Sindhwani. 2009. Data quality from crowdsourcing: a study of annotation selection criteria. In Proceedings of the NAACL HLT 2009 Workshop on Active Learning for Natural Language Processing (HLT '09). Association for Computational Linguistics, Stroudsburg, PA, USA, 27--35. ",
      "doi": "10.5555/1564131.1564137"
    },
    {
      "text": "Edward McFowland, Skyler Speakman, and Daniel B. Neill. 2013. Fast generalized subset scan for anomalous pattern detection. Journal of Machine Learning Research 14, 1 (January 2013), 1533--1561. ",
      "doi": "10.5555/2567709.2567713"
    },
    {
      "text": "Geoffrey M. Hodgson. 1997. The ubiquity of habits and rules. Cambridge Journal of Economics, 21(6), 663--684.",
      "doi": ""
    },
    {
      "text": "Jin-Hyuk Hong, Ben Margines, and Anind K. Dey. 2014. A smartphone-based sensing platform to model aggressive driving behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 40474056.  ",
      "doi": "10.1145/2556288.2557321"
    },
    {
      "text": "Yuri A. Ivanov, Bruce Blumberg, and Alex Pentland. 2001. Expectation maximization for weakly labeled data. In Proceedings of the Eighteenth International Conference on Machine Learning, 218--225. Morgan Kaufmann Publishers Inc. ",
      "doi": "10.5555/645530.655656"
    },
    {
      "text": "Edwin T. Jaynes. 1957. Information theory and statistical mechanics. Physical review, 106(4), 620.",
      "doi": ""
    },
    {
      "text": "Magnus S. Magnusson. 2000. Discovering hidden time patterns in behavior: T-patterns and their detection. Behavior Research Methods, Instruments, & Computers, 32(1), 93--110.",
      "doi": ""
    },
    {
      "text": "Gideon S. Mann and Andrew McCallum. 2010. Generalized Expectation Criteria for Semi-Supervised Learning with Weakly Labeled Data. The Journal of Machine Learning Research 11 (March 2010), 955984. ",
      "doi": "10.5555/1756006.1756038"
    },
    {
      "text": "Andrew Y. Ng and Stuart J. Russell. 2000. Algorithms for Inverse Reinforcement Learning. In Proceedings of the Seventeenth International Conference on Machine Learning (ICML '00), Pat Langley (Ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 663--670. ",
      "doi": "10.5555/645529.657801"
    },
    {
      "text": "Martin L. Puterman. 2014. Markov decision processes: discrete stochastic dynamic programming. John Wiley & Sons, Inc., New York, NY, USA.",
      "doi": "10.5555/528623"
    },
    {
      "text": "James Reason, Antony Manstead, Stephen Stradling, James Baxter, and Karen Campbell. 1990. Errors and violations on the roads: a real distinction? Ergonomics 33(10-11), 1315--1332.",
      "doi": ""
    },
    {
      "text": "Ruslan Salakhutdinov (2015) Learning deep generative models. Annual Review of Statistics and Its Application 2. 361--385.",
      "doi": ""
    },
    {
      "text": "David Shinar and Richard Compton. 2004. Aggressive driving: an observational study of driver, vehicle, and situational variables, Accident Analysis & Prevention, Volume 36, Issue 3, May 2004, 429--437.",
      "doi": ""
    },
    {
      "text": "Xiaojin Zhu, Zoubin Ghahramani, and John Lafferty. 2003. Semi-supervised learning using Gaussian fields and harmonic functions. In Proceedings of the 20th International Conference on Machine Learning (ICML-2003) Volume 2, vol. 2, 912--919. ",
      "doi": "10.5555/3041838.3041953"
    },
    {
      "text": "Brian D. Ziebart, J. Andrew Bagnell, and Anind K. Dey. 2010. Modeling interaction via the principle of maximum causal entropy. In Proceedings of the 27th international conference on Machine learning (ICML '10). ACM, New York, NY, USA., 1247--1254.",
      "doi": ""
    },
    {
      "text": "Brian D. Ziebart. 2010. Modeling purposeful adaptive behavior with the principle of maximum causal entropy. (Doctoral dissertation, Carnegie Mellon University). ",
      "doi": "10.5555/2049078"
    }
  ]
}