{
  "doi": "10.1145/3025453.3025631",
  "title": "PersaLog: Personalization of News Article Content",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3188-3200",
  "year": 2017,
  "badges": [],
  "abstract": "Content personalization automatically modifying text and multimedia features within articles based on the reader's individual features'is evolving as a new form of journalism. Informed by constraints articulated through a survey of journalists, we have implemented PersaLog, a novel system for creating personalized content (e.g., text and interactive visualizations). Because crafting, and validating, personalized content can be challenging to scale across articles (unlike feed personalization), we offer a simple Domain Specific Language (DSL), and editing environment, to support this task. PersaLog is particularly designed to support the personalization of existing text and visualizations. Our work provides guidelines for personalization as well as a system that allows for both subtle and dramatic personalization-driven content changes. We validate PersaLog using case and lab studies.",
  "authors": [
    {
      "name": "Eytan Adar",
      "institution": "University of Michigan, Ann Arbor, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589033",
      "orcid": "missing"
    },
    {
      "name": "Carolyn Gearig",
      "institution": "University of Michigan, Ann Arbor, Ann Arbor, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163229",
      "orcid": "missing"
    },
    {
      "name": "Ayshwarya Balasubramanian",
      "institution": "Deloitte, Arlington, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162938",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hullman",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657387",
      "orcid": "0000-0001-6826-3550"
    }
  ],
  "references": [
    {
      "text": "Gregor Aisch, Quoctrung Bui, Amanda Cox, and Kevin Quealy. 2016. Where the Poor Live Longer: How Your Area Compares. The New York Times, April 11, Available: http://nyti.ms/1SryMtT. (2016).",
      "doi": ""
    },
    {
      "text": "Gregor Aisch, Eric Buth, Matthew Block, Amanda Cox, and Kevin Quealy. 2015. The Best and Worst Places to Grow Up: How Your Area Compares. The New York Times, May 4, 2015, Available: http://nyti.ms/1KGrkJM. (2015).",
      "doi": ""
    },
    {
      "text": "Jon Bentley. 1986. Programming Pearls: Little Languages. Commun. ACM 29, 8 (Aug. 1986), 711--721. DOI:http://dx.doi.org/10.1145/6424.315691  ",
      "doi": "10.1145/6424.315691"
    },
    {
      "text": "Michael Bolin, Matthew Webber, Philip Rha, Tom Wilson, and Robert C. Miller. 2005. Automation and Customization of Rendered Web Pages. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (UIST '05). ACM, New York, NY, USA, 163--172. DOI: http://dx.doi.org/10.1145/1095034.1095062  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Engin Bozdag. 2013. Bias in algorithmic filtering and personalization. Ethics and Information Technology 15, 3 (2013), 209--227.  ",
      "doi": "10.1007/s10676-013-9321-6"
    },
    {
      "text": "Paul De Bra, Evgeny Knutov, David Smits, Natalia Stash, and Vinicius F. C. Ramos. 2013. GALE: a generic open source extensible adaptation engine. New Review of Hypermedia and Multimedia 19, 2 (2013), 182--212. DOI: http://dx.doi.org/10.1080/13614568.2013.806961  ",
      "doi": ""
    },
    {
      "text": "Paul De Bra, Natalia Stash, David Smits, Cristóbal Romero, and Sebastián Ventura. 2007. Authoring and Management Tools for Adaptive Educational Hypermedia Systems: The AHA! Case Study. Springer Berlin Heidelberg, Berlin, Heidelberg, 285--308. DOI: http://dx.doi.org/10.1007/978--3--540--71974--8_11",
      "doi": ""
    },
    {
      "text": "Peter Brusilovsky and Eva Millán. 2007. User Models for Adaptive Hypermedia and Adaptive Educational Systems. Springer Berlin Heidelberg, Berlin, Heidelberg, 3--53. DOI:http://dx.doi.org/10.1007/978--3--540--72079--9_1",
      "doi": ""
    },
    {
      "text": "Darla Cameron and Denise Lu. 2016. Personal interview, July 12. (2016).",
      "doi": ""
    },
    {
      "text": "Gina Masullo Chen, T Makana Chock, Hillary Gozigian, Ryan Rogers, Arushi Sen, Valarie N Schweisberger, Joseph Steinhardt, and Yi Wang. 2011. Personalizing news websites attracts young readers. Newspaper Research J. 32, 4 (2011), 22--38.",
      "doi": ""
    },
    {
      "text": "Pascal R Chesnais, Matthew J Mucklo, Jonathan Sheena, and others. 1995. The Fishwrap personalized news system. In 2nd International Workshop Community Networking, 1995. IEEE, New York, NY, 275--282.",
      "doi": ""
    },
    {
      "text": "Kevyn Collins-Thompson, Paul N. Bennett, Ryen W. White, Sebastian de la Chica, and David Sontag. 2011. Personalizing Web Search Results by Reading Level. In Proceedings of the 20th ACM International Conference on Information and Knowledge Management (CIKM '11). ACM, New York, NY, USA, 403--412. DOI: http://dx.doi.org/10.1145/2063576.2063639  ",
      "doi": "10.1145/2063576.2063639"
    },
    {
      "text": "Diana I Cordova and Mark R Lepper. 1996. Intrinsic motivation and the process of learning: Beneficial effects of contextualization, personalization, and choice. J. of Educational Psychology 88, 4 (1996), 715.",
      "doi": ""
    },
    {
      "text": "Allen Cypher, Mira Dontcheva, Tessa Lau, and Jeffrey Nichols. 2010. No Code Required: Giving Users Tools to Transform the Web. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/1805911"
    },
    {
      "text": "Nada Dabbagh and Anastasia Kitsantas. 2012. Personal Learning Environments, social media, and self-regulated learning: A natural formula for connecting formal and informal learning. The Internet and higher education 15, 1 (2012), 3--8. ",
      "doi": ""
    },
    {
      "text": "Judy Davis-Dorsey, Steven M Ross, and Gary R Morrison. 1991. The role of rewording and context personalization in the solving of mathematical word problems. J. of Educational Psychology 83, 1 (1991), 61.",
      "doi": ""
    },
    {
      "text": "Chrysanne Di Marco, Peter Bray, H Dominic Covvey, Donald D Cowan, Vic Di Ciccio, Eduard Hovy, Joan Lipa, and Cathy Yang. 2006. Authoring and generation of individualized patient education materials. In AMIA Annual Symposium Proceedings, Vol. 2006. American Medical Informatics Association, Bethesda, MD, 195.",
      "doi": ""
    },
    {
      "text": "Paula J Durlach and Alan M Lesgold. 2012. Adaptive technologies for training and education. Cambridge University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Facebook. 2017. Ads Guide. https://www.facebook.com/business/ads-guide/. (2017).",
      "doi": ""
    },
    {
      "text": "Leah Findlater and Joanna McGrenere. 2008. Impact of Screen Size on Performance, Awareness, and User Satisfaction with Adaptive Graphical User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1247--1256. DOI: http://dx.doi.org/10.1145/1357054.1357249  ",
      "doi": "10.1145/1357054.1357249"
    },
    {
      "text": "Jonathan G.K. Foss and Alexandra I. Cristea. 2010. The Next Generation Authoring Adaptive Hypermedia: Using and Evaluating the MOT3.0 and PEAL Tools. In Proceedings of the 21st ACM Conference on Hypertext and Hypermedia (HT '10). ACM, New York, NY, USA, 83--92. DOI:http://dx.doi.org/10.1145/1810617.1810633  ",
      "doi": "10.1145/1810617.1810633"
    },
    {
      "text": "Evgeniy Gabrilovich, Susan Dumais, and Eric Horvitz. 2004. Newsjunkie: Providing Personalized Newsfeeds via Analysis of Information Novelty. In Proceedings of the 13th International Conference on World Wide Web (WWW '04). ACM, New York, NY, USA, 482--490. DOI: http://dx.doi.org/10.1145/988672.988738  ",
      "doi": "10.1145/988672.988738"
    },
    {
      "text": "Krzysztof Z. Gajos, Mary Czerwinski, Desney S. Tan, and Daniel S. Weld. 2006. Exploring the Design Space for Adaptive Graphical User Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, New York, NY, USA, 201--208. DOI: http://dx.doi.org/10.1145/1133265.1133306  ",
      "doi": "10.1145/1133265.1133306"
    },
    {
      "text": "Krzysztof Z. Gajos, Katherine Everitt, Desney S. Tan, Mary Czerwinski, and Daniel S. Weld. 2008. Predictability and Accuracy in Adaptive User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1271--1274. DOI: http://dx.doi.org/10.1145/1357054.1357252  ",
      "doi": "10.1145/1357054.1357252"
    },
    {
      "text": "Arline T Geronimus, John Bound, and Lisa J Neidert. 1996. On the validity of using census geocode characteristics to proxy individual socioeconomic characteristics. J. Amer. Statist. Assoc. 91, 434 (1996), 529--537.",
      "doi": ""
    },
    {
      "text": "Stefan Göbel, Sandro Hardy, Viktor Wendel, Florian Mehm, and Ralf Steinmetz. 2010. Serious Games for Health: Personalized Exergames. In Proceedings of the 18th ACM International Conference on Multimedia (MM '10). ACM, New York, NY, USA, 1663--1666. DOI: http://dx.doi.org/10.1145/1873951.1874316  ",
      "doi": "10.1145/1873951.1874316"
    },
    {
      "text": "Google. 2017. Google Ads. https://www.google.com/ads/. (2017).",
      "doi": ""
    },
    {
      "text": "T.R.G. Green and M. Petre. 1996. Usability Analysis of Visual Programming Environments: A \"Cognitive Dimensions\" Framework. Journal of Visual Languages & Computing 7, 2 (1996), 131 -- 174. DOI: http://dx.doi.org/10.1006/jvlc.1996.0009 ",
      "doi": ""
    },
    {
      "text": "Jonathan Harper and Maneesh Agrawala. 2014. Deconstructing and Restyling D3 Visualizations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 253--262. DOI: http://dx.doi.org/10.1145/2642918.2647411  ",
      "doi": "10.1145/2642918.2647411"
    },
    {
      "text": "Kashmir Hill. 2016. How an internet mapping glitch turned a random Kansas farm into a digital hell. Fusion, April 10, Available: http://fusion.net/story/287592/internet-mapping-glitchkansas-farm/. (2016).",
      "doi": ""
    },
    {
      "text": "Graeme Hirst, Chrysanne DiMarco, Eduard Hovy, and Kimberley Parsons. 1997. Authoring and Generating Health-Education Documents That Are Tailored to the Needs of the Individual Patient. Springer Vienna, Vienna, 107--118. DOI: http://dx.doi.org/10.1007/978--3--7091--2670--7_14",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2000. Steps to take before intelligent user interfaces become real. Interacting with computers 12, 4 (2000), 409--426. ",
      "doi": ""
    },
    {
      "text": "B. Huffaker, M. Fomenkov, and k. claffy. 2011. Geocompare: a comparison of public and commercial geolocation databases - Technical Report . Technical Report. Cooperative Association for Internet Data Analysis (CAIDA).",
      "doi": ""
    },
    {
      "text": "Chris J. Hughes, Mike Armstrong, Rhianne Jones, and Michael Crabb. 2015. Responsive Design for Personalised Subtitles. In Proceedings of the 12th Web for All Conference (W4A '15). ACM, New York, NY, USA, Article 8, 4 pages. DOI: http://dx.doi.org/10.1145/2745555.2746650  ",
      "doi": "10.1145/2745555.2746650"
    },
    {
      "text": "Judy Kay. 2000. Stereotypes, Student Models and Scrutability. In Proceedings of the 5th International Conference on Intelligent Tutoring Systems (ITS '00). Springer-Verlag, London, UK, UK, 19--30. http://dl.acm.org/citation.cfm?id=648030.745813 ",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Jessica Hullman, and Maneesh Agrawala. 2016. Generating Personalized Spatial Analogies for Distances and Areas. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 38--48. DOI: http://dx.doi.org/10.1145/2858036.2858440  ",
      "doi": "10.1145/2858036.2858440"
    },
    {
      "text": "Aleksandra Klašnja-Milićević, Boban Vesin, Mirjana Ivanović, and Zoran Budimac. 2011. E-Learning personalization based on hybrid recommendation strategy and learning style identification. Computers & Education 56, 3 (2011), 885--899.  ",
      "doi": "10.1016/j.compedu.2010.11.001"
    },
    {
      "text": "Scott Klein. 2013. How To Edit 52,000 Stories at Once. ProPublica Nerd Blog, Jan. 24, 2013, Available: https://goo.gl/5QipBA. (2013).",
      "doi": ""
    },
    {
      "text": "Evgeny Knutov, Paul De Bra, and Mykola Pechenizkiy. 2009. AH 12 years later: a comprehensive survey of adaptive hypermedia methods and techniques. New Review of Hypermedia and Multimedia 15, 1 (2009), 5--38.  ",
      "doi": "10.1080/13614560902801608"
    },
    {
      "text": "Andrew J. Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, Mary Beth Rosson, Gregg Rothermel, Mary Shaw, and Susan Wiedenbeck. 2011. The State of the Art in End-user Software Engineering. ACM Comput. Surv. 43, 3, Article 21 (April 2011), 44 pages. DOI: http://dx.doi.org/10.1145/1922649.1922658  ",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Gilly Leshed, Eben M. Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: Automating & Sharing How-to Knowledge in the Enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1719--1728. DOI: http://dx.doi.org/10.1145/1357054.1357323  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Yuping Liu and LJ Shrum. 2002. What is interactivity and is it always such a good thing? Implications of definition, person, and situation for the influence of interactivity on advertising effectiveness. J. of Advertising 31, 4 (2002), 53--64. ",
      "doi": ""
    },
    {
      "text": "Catherine McLoughlin and Mark JW Lee. 2010. Personalised and self regulated learning in the Web 2.0 era: International exemplars of innovative pedagogy using social software. Australasian Journal of Educational Technology 26, 1 (2010), 28--43. ",
      "doi": ""
    },
    {
      "text": "MediumEditor Open Source Team. 2016. MediumEditor. https://yabwe.github.io/medium-editor/. (2016).",
      "doi": ""
    },
    {
      "text": "Ted Mellnik, Darla Cameron, Denise Lu, Emily Badger, and Kat Downs. 2016. America's great housing divide: Are you a winner or loser? Washington Post, April 28, 2016, Available: http://wapo.st/housing. (2016).",
      "doi": ""
    },
    {
      "text": "Maria Milosavljevic. 1997. Augmenting the User's Knowledge via Comparison. Springer Vienna, Vienna, 119--130. DOI: http://dx.doi.org/10.1007/978--3--7091--2670--7_15",
      "doi": ""
    },
    {
      "text": "Alejandro Montes García, Paul De Bra, George H.L. Fletcher, and Mykola Pechenizkiy. 2014. A DSL Based on CSS for Hypertext Adaptation. In Proceedings of the 25th ACM Conference on Hypertext and Social Media (HT '14). ACM, New York, NY, USA, 313--315. DOI: http://dx.doi.org/10.1145/2631775.2631782  ",
      "doi": "10.1145/2631775.2631782"
    },
    {
      "text": "Dan Murray and Kevan Durrell. 2000. Inferring Demographic Attributes of Anonymous Internet Users. Springer Berlin Heidelberg, Berlin, Heidelberg, 7--20. DOI:http://dx.doi.org/10.1007/3--540--44934--5_1",
      "doi": ""
    },
    {
      "text": "Reinhard Oppermann and R Rasher. 1997. Adaptability and adaptivity in learning systems. Knowledge transfer 2 (1997), 173--179.",
      "doi": ""
    },
    {
      "text": "Shahida M. Parvez and Glenn D. Blank. 2008. Individualizing Tutoring with Learning Style Based Feedback. Springer Berlin Heidelberg, Berlin, Heidelberg, 291--301. DOI: http://dx.doi.org/10.1007/978--3--540--69132--7_33",
      "doi": ""
    },
    {
      "text": "Paul A Pavlou and David W Stewart. 2000. Measuring the effects and effectiveness of interactive advertising: A research agenda. J. of Interactive Advertising 1, 1 (2000), 61--77. ",
      "doi": ""
    },
    {
      "text": "Kevin Quealy. 2016. Personal interview, July 1. (2016).",
      "doi": ""
    },
    {
      "text": "Kevin Quealy and Margot Sanger-Katz. 2015. The Experts Were Wrong About the Best Places for Better and Cheaper Health Care. The New York Times, December 15, 2016, Available: http://nyti.ms/1IRnP6J. (2015).",
      "doi": ""
    },
    {
      "text": "Ehud Reiter, Robert Dale, and Zhiwei Feng. 2000. Building natural language generation systems. MIT Press, Cambridge, MA. ",
      "doi": ""
    },
    {
      "text": "Mark Christopher Roberts. 2007. Measuring the relationship between journalistic transparency and credibility. Ph.D. Dissertation. University of South Carolina.",
      "doi": ""
    },
    {
      "text": "Celette Sugg Skinner, Victor J Strecher, and Harm Hospers. 1994. Physicians' recommendations for mammography: do tailored messages make a difference? American Journal of Public Health 84, 1 (1994), 43--49. ",
      "doi": ""
    },
    {
      "text": "Michael Strickland, Archie Tse, Matthew Ericson, and Tom Giratikanon. 2016. ArchieML. http://archieml.org/. (2016).",
      "doi": ""
    },
    {
      "text": "Margaret Sullivan. 2015. When News Gets (Too?) Personal. The New York Times, Public Editor's Journal, Dec. 17, http://nyti.ms/1T3H9hs. (2015).",
      "doi": ""
    },
    {
      "text": "The New York Times. 2015. Innovation. May 24, 2015. (2015).",
      "doi": ""
    },
    {
      "text": "Theophanis Tsandilas and m. c. schraefel. 2005. An Empirical Assessment of Adaptation Techniques. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 2009--2012. DOI: http://dx.doi.org/10.1145/1056808.1057079  ",
      "doi": "10.1145/1056808.1057079"
    },
    {
      "text": "Blase Ur, Melwyn Pak Yong Ho, Stephen Brawner, Jiyun Lee, Sarah Mennicken, Noah Picard, Diane Schulze, and Michael L. Littman. 2016. Trigger-Action Programming in the Wild: An Analysis of 200,000 IFTTT Recipes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3227--3231. DOI: http://dx.doi.org/10.1145/2858036.2858556  ",
      "doi": "10.1145/2858036.2858556"
    },
    {
      "text": "Shan Wang. 2016. The Los Angeles Times built its own journalist-friendly story editor, and it's now rolling out to all of Tronc. Nieman Lab, August 10, 2016, Available: goo.gl/c7wFVm. (2016).",
      "doi": ""
    },
    {
      "text": "Jeffrey Wong and Jason I. Hong. 2007. Making Mashups with Marmite: Towards End-user Programming for the Web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1435--1444. DOI: http://dx.doi.org/10.1145/1240624.1240842  ",
      "doi": "10.1145/1240624.1240842"
    }
  ]
}