{
  "doi": "10.1145/3025453.3025823",
  "title": "Youth Perspectives on Critical Data Literacies",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "919-930",
  "year": 2017,
  "badges": [],
  "abstract": "As contemporary youth learn, play, and socialize online, their activities are often being recorded and analyzed. What should young people know about these data collection and analysis efforts? Although critiques of these new forms of data collection and analysis have grown increasingly loud, the voices of users, and particularly youth, have largely been absent. This paper explores the critical perspectives of youth who are programming with public data about their own learning and social interaction in the Scratch online community. Using a bottom-up approach based on ethnographic observation of discussions among these young users, we identify a series of themes in how these youth critique, question, and debate the implications of data analytics. We connect these themes-framed in terms of critical data literacies-to expert critiques and discuss the implications of these findings for education and design.",
  "tags": [
    "big data",
    "learning",
    "critical data literacy",
    "youth",
    "data science",
    "data literacy"
  ],
  "authors": [
    {
      "name": "Samantha Hautea",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162446",
      "orcid": "missing"
    },
    {
      "name": "Sayamindu Dasgupta",
      "institution": "University of Washington & Massachusetts Institute of Technology, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484641200",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hal Abelson, Ken Ledeen, and Harry Lewis. 2008. Blown to Bits: Your Life, Liberty, and Happiness After the Digital Explosion (1 edition ed.). Addison-Wesley Professional, Upper Saddle River, NJ. x978-0--13--713559--2",
      "doi": ""
    },
    {
      "text": "Marie Bienkowski, Minguy Feng, and Barbara Means. 2012. Enhancing teaching and learning through educational data mining and learning analytics: An issue brief. Technical Report. US Department of Education, Office of Educational Technology.",
      "doi": ""
    },
    {
      "text": "Geoffrey C. Bowker. 2005. Memory Practices in the Sciences. MIT Press. x978-0--262-02589--8",
      "doi": ""
    },
    {
      "text": "danah boyd. 2014. It's Complicated: The Social Lives of Networked Teens. Yale University Press. x978-0--300--16643--9",
      "doi": "10.5555/2584525"
    },
    {
      "text": "danah boyd and Kate Crawford. 2012. Critical Questions for Big Data. Information, Communication & Society 15, 5 (2012), 662--679. 1369--118X http://dx.doi.org/10.1080/1369118X.2012.678878 ",
      "doi": ""
    },
    {
      "text": "danah boyd, Urs Gasser, and John Palfrey. 2010. How the COPPA, as Implemented, Is Misinterpreted by the Public: A Research Perspective. (April 2010). http://cyber.harvard.edu/sites/cyber.harvard.edu/files/COPPA_Hearing_Statement_boyd_Gasser_Palfrey_4--29--10.pdf",
      "doi": ""
    },
    {
      "text": "danah boyd, Alice Marwick, and others. 2011. Social Privacy in Networked Publics: Teens Attitudes, Practices, and Strategies. (2011).",
      "doi": ""
    },
    {
      "text": "Jerome S. Bruner. 1996. The Culture of Education. Harvard University Press. x978-0--674--17953-0",
      "doi": ""
    },
    {
      "text": "Finn Brunton and Helen Nissenbaum. 2011. Vernacular resistance to data collection and analysis: A political theory of obfuscation. First Monday 16, 5 (2011). ",
      "doi": ""
    },
    {
      "text": "Donald T. Campbell. 1979. Assessing the impact of planned social change. Evaluation and Program Planning 2, 1 (Jan. 1979), 67--90. 0149--7189 http://dx.doi.org/10.1016/0149--7189(79)90048-X",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Sage Publications, London. x0--7619--7352--4",
      "doi": ""
    },
    {
      "text": "Juliet M. Corbin and Anselm C. Strauss. 2007. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory (3rd ed.). Sage Publications, Inc. x1--4129-0644-X",
      "doi": ""
    },
    {
      "text": "Kate Crawford, Mary Gray, and Kate Miltner. 2014. Big Data Critiquing Big Data: Politics, Ethics, Epistemologytextbar Special Section Introduction. International Journal of Communication 8, 0 (2014). 1932--8036 http://ijoc.org/index.php/ijoc/article/view/2167",
      "doi": ""
    },
    {
      "text": "Sayamindu Dasgupta, William Hale, Andrés Monroy-Hernández, and Benjamin Mako Hill. 2016. Remixing as a Pathway to Computational Thinking. In Proceedings of the 19th Conference on Computer Supported Cooperative Work & Social Computing (CSCW '16). ACM.  ",
      "doi": "10.1145/2818048.2819984"
    },
    {
      "text": "Sayamindu Dasgupta and Benjamin Mako Hill. 2017. Scratch Community Blocks: Supporting Children as Data Scientists. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA. x978--1--4503--4655--9 http://dx.doi.org/10.1145/3025453.3025847 (forthcoming).",
      "doi": "10.1145/3025453.3025847"
    },
    {
      "text": "Åse Dragland. 2013. Big Data--for better or worse. Technical Report. Sintef. http://www.sintef.no/en/latest-news/big-data--for-better-or-worse/",
      "doi": ""
    },
    {
      "text": "DRL. 2013. Data-Intensive Research to Improve Teaching and Learning - An Ideas Lab to Foster Transformative Approaches to Teaching and Learning. Program Solicitation 13--565. National Science Foundation. https://www.nsf.gov/pubs/2013/nsf13565/nsf13565.htm",
      "doi": ""
    },
    {
      "text": "Paul du Gay and Michael Pryke. 2002. Cultural Economy: An Introduction. In Cultural Economy: Cultural Analysis and Commercial Life Cultural economy: Cultural analysis and commercial life. SAGE Publications Ltd, London, UK, 1--20. x978-0--7619--5993--9 978--1--4462--1844-0 http://sk.sagepub.com/books/cultural-economy/n12.xml",
      "doi": ""
    },
    {
      "text": "Elizabeth Dwoskin. 2014. Big Data's High-Priests of Algorithms; 'Data Scientists' Meld Statistics and Software for Find Lucrative High-Tech Jobs. Wall Street Journal (Online) (Aug. 2014). http://search.proquest.com/newsstand/docview/1552020409/abstract/D70B27FC5DA74D5APQ/1",
      "doi": ""
    },
    {
      "text": "Catherine D'Ignazio and Rahul Bhargava. 2015. Approaches to Building Big Data Literacy. In Proceedings of the Bloomberg Data for Good Exchange Conference 2015. New York, N.Y. https://dam-prod.media.mit.edu/x/2016/10/20/Edu_D'Ignazio_52.pdf",
      "doi": ""
    },
    {
      "text": "Liran Einav and Jonathan D. Levin. 2013. The Data Revolution and Economic Analysis. Working Paper 19035. National Bureau of Economic Research. http://www.nber.org/papers/w19035",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2016. Big Data: A Tool for Inclusion or Exclusion? Understanding the Issues. Technical Report. https://www.ftc.gov/system/files/documents/reports/big-data-tool-inclusion-or-exclusion-understanding-issues/160106big-data-rpt.pdf",
      "doi": ""
    },
    {
      "text": "Paulo Freire. 2000. Pedagogy of the oppressed. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2014. The Relevance of Algorithms. In Media technologies: Essays on communication, materiality, and society, Pablo J. Boczkowski and Kirsten A. Foot Tarleton Gillespie (Ed.). MIT Press, Cambridge, MA, 167. 978-0--262--52537--4 ",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman. 2013. Raw Data Is an Oxymoron. MIT Press. x978-0--262--51828--4",
      "doi": ""
    },
    {
      "text": "Scott A. Golder and Michael W. Macy. 2014. Digital Footprints: Opportunities and Challenges for Online Social Research. Annual Review of Sociology 40, 1 (July 2014), 129--152. 0360-0572, 1545--2115 http://dx.doi.org/10.1146/annurev-soc-071913-043145 ",
      "doi": ""
    },
    {
      "text": "John Caldwell Holt. 1982. How Children Fail. Da Capo Press. x978-0--201--48402--1",
      "doi": ""
    },
    {
      "text": "NSF-NIH Interagency Initiative and others. 2012. Core techniques and technologies for advancing big data science and engineering (BIGDATA).",
      "doi": ""
    },
    {
      "text": "Iain Johnstone and Fred Roberts. 2014. Data Science at NSF. Technical Report. National Science Foundation. http://www.nsf.gov/attachments/129788/public/Final_StatSNSFJan14.pdf",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai. 2006. Constructionism. In The Cambridge Handbook of the Learning Sciences (1st ed.), Keith R. Sawyer (Ed.). Cambridge University Press, 35--46. x978--1--139--45247--2",
      "doi": ""
    },
    {
      "text": "Lauren Kirchner. 2015. When Discrimination Is Baked Into Algorithms. The Atlantic (Sept. 2015). 1072--7825 http://www.theatlantic.com/business/archive/2015/09/discrimination-algorithms-disparate-impact/403969/",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2007. Beware, your imagination leaves digital traces. Times Higher Literary Supplement (April 2007). http://bruno-latour.fr/sites/default/files/P-129-THES-GB.pdf",
      "doi": ""
    },
    {
      "text": "David Lazer, Ryan Kennedy, Gary King, and Alessandro Vespignani. 2014. The Parable of Google Flu: Traps in Big Data Analysis. Science 343, 6176 (March 2014), 1203--1205. 0036--8075, 1095--9203 http://dx.doi.org/10.1126/science.1248506 ",
      "doi": ""
    },
    {
      "text": "Caitlin Lustig, Katie Pine, Bonnie Nardi, Lilly Irani, Min Kyung Lee, Dawn Nafus, and Christian Sandvig. 2016. Algorithmic Authority: The Ethics, Politics, and Economics of Algorithms That Interpret, Decide, and Manage. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1057--1062. x978--1--4503--4082--3 http://dx.doi.org/10.1145/2851581.2886426  ",
      "doi": "10.1145/2851581.2886426"
    },
    {
      "text": "Mary Madden, Susannah Fox, Aaron Smith, and Jessica Vitak. 2007. Digital Footprints: Online identity management and search in the age of transparency. Pew Internet & American Life Project, Washington, DC. http://www.pewinternet.org/files/old-media/Files/Reports/2007/PIP_Digital_Footprints.pdf.pdf",
      "doi": ""
    },
    {
      "text": "Jeffrey Mervis. 2016. NSF director unveils big ideas, with an eye on the next president and Congress. Science (May 2016). 0036--8075, 1095--9203 http://dx.doi.org/10.1126/science.aaf5713 ",
      "doi": ""
    },
    {
      "text": "Andrés Monroy-Hernández. 2007. ScratchR: sharing user-generated programmable media. In Proceedings of the 6th international conference on Interaction design and children (IDC '07). ACM, New York, NY, USA, 167--168. x978--1--59593--747--6 http://dx.doi.org/10.1145/1297277.1297315  ",
      "doi": "10.1145/1297277.1297315"
    },
    {
      "text": "Dale Neef. 2014. Digital Exhaust: What Everyone Should Know About Big Data, Digitization and Digitally Driven Innovation (1 edition ed.). Pearson FT Press, Indianapolis, IN. x978-0--13--383796--4",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Oceans of Data Institute staff. 2016. Building Global Interest in Data Literacy: A Dialogue. Technical Report. Oceans of Data Institute, Education Development Center, Inc. 24 pages. http://oceansofdata.org/our-work/building-global-interest-data-literacy-dialogue-workshop-report",
      "doi": ""
    },
    {
      "text": "Cathy O'Neil. 2016. Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy. Crown/Archetype. x978-0--553--41882--8",
      "doi": ""
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc., New York, NY, USA. x0--465-04627--4",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Seymour Papert and Idit Harel. 1991. Situating constructionism. In Constructionism. Vol. 36. Ablex Publishing, New York, NY, US, 1--11.",
      "doi": ""
    },
    {
      "text": "Chanda Phelan, Cliff Lampe, and Paul Resnick. 2016. It's Creepy, But It Doesn't Bother Me. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5240--5251. x978--1--4503--3362--7 http://dx.doi.org/10.1145/2858036.2858381  ",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "Thomas M. Philip, Sarah Schuler-Brown, and Winmar Way. 2013. A Framework for Learning About Big Data with Mobile Technologies for Democratic Participation: Possibilities, Limitations, and Unanticipated Obstacles. Technology, Knowledge and Learning 18, 3 (2013), 103--120. 2211--1670 http://dx.doi.org/10.1007/s10758-013--9202--4",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1970. Genetic epistemology. Trans. E. Duckworth. Columbia University Press, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "John Podesta. 2014. Big Data: Seizing Opportunities, Preserving Values. Technical Report. Executive Office of the President, United States of America.",
      "doi": ""
    },
    {
      "text": "Jake Porway. 2013. You can't just hack your way to social change. Harvard Business Review 7 (2013).",
      "doi": ""
    },
    {
      "text": "Foster Provost and Tom Fawcett. 2013. Data Science and its Relationship to Big Data and Data-Driven Decision Making. Big Data 1, 1 (Feb. 2013), 51--59. 2167--6461 http://dx.doi.org/10.1089/big.2013.1508 ",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60--67. http://dx.doi.org/10.1145/1592761.1592779  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Susan Jo Russell and Rebecca B. Corwin. 1989. Statistics: The Shape of the Data. Used Numbers: Real Data in the Classroom. Grades 4--6. Dale Seymour Publications, Palo Alto, CA. x0--86651--514--3 http://eric.ed.gov/?id=ED328451",
      "doi": ""
    },
    {
      "text": "Douglas Thomas and John Seely Brown. 2011. A New Culture of Learning: Cultivating the Imagination for a World of Constant Change (1 edition ed.). CreateSpace Independent Publishing Platform, Lexington, Ky. x978--1--4564--5888--1",
      "doi": ""
    },
    {
      "text": "Matthew A. Waller and Stanley E. Fawcett. 2013. Data Science, Predictive Analytics, and Big Data: A Revolution That Will Transform Supply Chain Design and Management. Journal of Business Logistics 34, 2 (June 2013), 77--84. 2158--1592 http://dx.doi.org/10.1111/jbl.12010 ",
      "doi": ""
    }
  ]
}