{
  "doi": "10.1145/3025453.3025646",
  "title": "FLight: A Low-Cost Reading and Writing System for Economically Less-Privileged Visually-Impaired People Exploiting Ink-based Braille System",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "531-540",
  "year": 2017,
  "badges": [],
  "abstract": "Reading printed documents and writing on a paper pose a great challenge for visually-impaired people. Existing studies that attempt to solve these challenges are expensive and not feasible in low-income context. Moreover, these studies solve reading and writing problems separately. On the contrary, in this study, we propose FLight, a low-cost reading and writing system for economically less-privileged people. FLight uses ink-based Braille characters as the medium of textual representation. This helps in keeping a compact spatial representation of texts, yet achieving a low-cost status. Additionally, FLight utilizes a low-cost wearable device to enhance ease of reading by visually-impaired people. We conduct a participatory design and iterative evaluation involving five visually-impaired children in Bangladesh for more than 18 months. Our user evaluation reveals that FLight is easy-to-use, and exhibits a potential low-cost solution for economically less-privileged visually-impaired people.",
  "tags": [
    "assistive technology",
    "wearable device",
    "economically less-privileged people",
    "braille"
  ],
  "authors": [
    {
      "name": "Tusher Chakraborty",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/do/10.1145/contrib-99659049608/rel-imgonly/1469824_811208672259864_7327079059807599741_n.jpg",
      "acmid": "99659049608",
      "orcid": "missing"
    },
    {
      "name": "Taslim Arefin Khan",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/do/10.1145/contrib-99659051887/rel-imgonly/cam_photo.png",
      "acmid": "99659051887",
      "orcid": "missing"
    },
    {
      "name": "A. B. M. Alim Al Islam",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548031070",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S. Azenkot and N. B. Lee. 2013. Exploring the Use of Speech Input by Blind People on Mobile Devices. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 11.  ",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "S. Azenkot, J. O. Wobbrock, S. Prasain, and R. E. Ladner. 2012. Input Finger Detection for Nonvisual Touch Screen Text Entry in Perkinput. In Proceedings of Graphics Interface 2012. Canadian Information Processing Society, 121--129.",
      "doi": "10.5555/2305276.2305297"
    },
    {
      "text": "American Foundation for the Blind. 2015. School Experience for Children and Youth with Vision Loss. (January 2015). Retrieved February 21, 2016 from http://goo.gl/1Np4m2.",
      "doi": ""
    },
    {
      "text": "M. N Bonner, J. T Brudvik, G. D Abowd, and W K. Edwards. 2010. No-look notes: Accessible Eyes-free Multi-touch Text Entry. In International Conference on Pervasive Computing. Springer, 409--426.",
      "doi": ""
    },
    {
      "text": "M. C. Buzzi, M. Buzzi, B. Leporini, and A. Trujillo. 2014. Designing a Text Entry Multimodal Keypad for Blind Users of Touchscreen Mobile Phones. In Proceedings of the 16th international ACM SIGACCESS Conference on Computers & Accessibility. ACM, 131--136.  ",
      "doi": "10.1145/2661334.2661354"
    },
    {
      "text": "Media Center. 2014. Visual impairment and blindness. (August 2014). Retrieved February 15, 2016 from http://goo.gl/BG8XTG.",
      "doi": ""
    },
    {
      "text": "T. Chakraborty, T. A. Khan, and ABM Islam. 2016. EyePen: Ease of Reading for Less-Privileged Visually-Impaired People. In Proceedings of the 7th Annual Symposium on Computing for Development. ACM, 13.  ",
      "doi": "10.1145/3001913.3001915"
    },
    {
      "text": "DocScanner. 2010. SayText. (June 2010). Retrieved March 23, 2016 from http://goo.gl/aLvPBS.",
      "doi": ""
    },
    {
      "text": "Be My Eyes. 2016. Be My Eyes - Lend your eyes to the blind. (2016). Retrieved September 15, 2016 from http://goo.gl/wiBP0B.",
      "doi": ""
    },
    {
      "text": "American Foundation for the Blind. 2016. Braille Printers. (2016). Retrieved September 18, 2016 from https://goo.gl/C14WYk.",
      "doi": ""
    },
    {
      "text": "B. Frey, C. Southern, and M. Romero. 2011. Brailletouch: Mobile Texting for the Visually Impaired. In International Conference on Universal Access in Human-Computer Interaction. Springer, 19--25. ",
      "doi": ""
    },
    {
      "text": "T. Fukuda, H. Morita, F. Arai, H. Ishihara, and H. Matsuura. 1997. Micro Resonator Using Electromagnetic Actuator for Tactile Display. In Micromechatronics and Human Science, 1997. Proceedings of the 1997 International Symposium on. IEEE, 143--148. ",
      "doi": ""
    },
    {
      "text": "Carl Haub. 2012. Fact Sheet: World Population Trends 2012. (2012). Retrieved September 18, 2016 from https://goo.gl/LvZ2Hr.",
      "doi": ""
    },
    {
      "text": "Mansura Hussain. 2012. Delayed supply of books for visually-impaired. (2012). Retrieved September 15, 2016 from https://goo.gl/4xzrnP.",
      "doi": ""
    },
    {
      "text": "C. Jayant, C. Acuario, W. Johnson, J. Hollier, and R. Ladner. 2010. V-braille: Haptic Braille Perception Using a Touch-screen and Vibration on Mobile Phones. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 295--296.  ",
      "doi": "10.1145/1878803.1878878"
    },
    {
      "text": "S. K Kane, M. R. Morris, and J. O Wobbrock. 2013. Touchplates: Low-cost Tactile Overlays for Visually Impaired Touch Screen Users. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 22.  ",
      "doi": "10.1145/2513383.2513442"
    },
    {
      "text": "R. M. Leonard. 2001. Statistics on vision impairment: A resource manual (5th ed.). Lighthouse International.",
      "doi": ""
    },
    {
      "text": "Vincent Lévesque. 2005. Blindness, Technology and Haptics. Center for Intelligent Machines (2005), 19--21.",
      "doi": ""
    },
    {
      "text": "I. M. Thies. 2015. User interface design for low-literate and novice users: past, present and future. Foundations and Trends in Human-Computer Interaction 8, 1 (2015), 1--72.  ",
      "doi": "10.1561/1100000047"
    },
    {
      "text": "S. Mascetti, C. Bernareggi, and M. Belotti. 2012. TypeInBraille: Quick Eyes-free Typing on Smartphones. In International Conference on Computers for Handicapped Persons. Springer, 615--622.  ",
      "doi": "10.1007/978-3-642-31534-3_90"
    },
    {
      "text": "I. Medhi, M. Jain, A. Tewari, M. Bhavsar, M. Matheke-Fischer, and E. Cutrell. 2012. Combating Rural Child Malnutrition Through Inexpensive Mobile Phones. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. ACM, 635--644.  ",
      "doi": "10.1145/2399016.2399113"
    },
    {
      "text": "L. Newman, M. Wagner, R. Cameto, A. Knokey, J. A. Buckley, and D. Malouf. 2009. The Post-High School Outcomes of Youth With Disabilities up to 4 Years After High School. (2009). Retrieved September 18, 2016 from https://goo.gl/eLOaxg.",
      "doi": ""
    },
    {
      "text": "H. Nicolau, J. Guerreiro, T. Guerreiro, and L. Carriço. 2013. UbiBraille: Designing and Evaluating a Vibrotactile Braille-reading Device. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 23.  ",
      "doi": "10.1145/2513383.2513437"
    },
    {
      "text": "OrCam. 2016. OrCam - See for Yourself. (2016). Retrieved February 20, 2016 from www.orcam.com.",
      "doi": ""
    },
    {
      "text": "B. Plimmer, A. Crossan, S. A Brewster, and R. Blagojevic. 2008. Multimodal Collaborative Handwriting Training for Visually-Impaired People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 393--402.  ",
      "doi": "10.1145/1357054.1357119"
    },
    {
      "text": "D. Radojichikj and D. Blagoj. 2015. Students with visual impairments: Braille reading rate. International Journal of Cognitive Research in Science, Engineering and Education (IJCRSEE) 3, 1 (2015), 1--5.",
      "doi": ""
    },
    {
      "text": "Ruby Ryles. 1996. The Impact of Braille Reading Skills on Employment, Income, Education, and Reading Habits. Journal of Visual Impairment and Blindness 90 (1996), 219--226.",
      "doi": ""
    },
    {
      "text": "Ruby Ryles. 1999. New Research Study: Early Braille Education Vital in Establishing Lifelong Literacy. Future Reflections 18, 2 (1999).",
      "doi": ""
    },
    {
      "text": "H. Shen and J. M. Coughlan. 2012. Towards a Real-Time System for Finding and Reading Signs for Visually Impaired Users.. In ICCHP (2), Vol. 7383. Springer, 41--47.  ",
      "doi": "10.1007/978-3-642-31534-3_7"
    },
    {
      "text": "R. Shilkrot, J. Huber, W. Meng Ee, P. Maes, and S. Nanayakkara. 2015. FingerReader: A Wearable Device to Explore Printed Text on The Go. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2363--2372.  ",
      "doi": "10.1145/2702123.2702421"
    },
    {
      "text": "Ai Squared. 2016. ZoomText. (2016). Retrieved on March 22, 2016 from http://goo.gl/LFLQSj.",
      "doi": ""
    },
    {
      "text": "L. Stearns, R. Du, U. Oh, C. Jou, L. Findlater, D. A Ross, and J. E. Froehlich. 2016. Evaluating Haptic and Auditory Directional Guidance to Assist Blind People in Reading Printed Text Using Finger-Mounted Cameras. (2016).",
      "doi": ""
    },
    {
      "text": "H. Ye, M. Malu, U. Oh, and L. Findlater. 2014. Current and future mobile and wearable device use by people with visual impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3123--3132.  ",
      "doi": "10.1145/2556288.2557085"
    }
  ]
}