{
  "doi": "10.1145/3025453.3026038",
  "title": "Self-Experimentation for Behavior Change: Design and Formative Evaluation of Two Approaches",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6837-6849",
  "year": 2017,
  "badges": [],
  "abstract": "Desirable outcomes such as health are tightly linked to behaviors, thus inspiring research on technologies that support people in changing those behaviors. Many behavior-change technologies are designed by HCI experts but this approach can make it difficult to personalize support to each user's unique goals and needs. This paper reports on the iterative design of two complementary support strategies for helping users create their own personalized behavior-change plans via self-experimentation: One emphasized the use of interactive instructional materials, and the other additionally introduced context-aware computing to enable user creation of \"just in time\" home-based interventions. In a formative trial with 27 users, we compared these two approaches to an unstructured sleep education control. Results suggest great promise in both strategies and provide insights on how to develop personalized behavior-change technologies.",
  "tags": [
    "just-in-time interventions",
    "behavior change",
    "self-experimentation",
    "context-aware computing"
  ],
  "authors": [
    {
      "name": "Jisoo Lee",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458859757",
      "orcid": "missing"
    },
    {
      "name": "Erin Walker",
      "institution": "ASU, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491129",
      "orcid": "0000-0002-0976-9065"
    },
    {
      "name": "Winslow Burleson",
      "institution": "New York University, NY City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81366590839",
      "orcid": "missing"
    },
    {
      "name": "Matthew Kay",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81350579902/rel-imgonly/me.jpg",
      "acmid": "81350579902",
      "orcid": "missing"
    },
    {
      "name": "Matthew Buman",
      "institution": "Arizona State University, Phoenix, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556412456",
      "orcid": "missing"
    },
    {
      "name": "Eric B. Hekler",
      "institution": "Arizona State University, Phoenix, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482658489",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Thomas Attin and E. Hornecker. 2005. Tooth brushing and oral health: how frequently and when should tooth brushing be performed?. Oral health & preventive dentistry, 3, 3: 135--40.",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Martin Maechler, Ben Bolker, and Steve Walker. 2015. Fitting Linear Mixed-Effects Models Using lme4. Journal of Statistical Software, 67, 1: 148.",
      "doi": ""
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Trans. Comput.-Hum. Interact. 20, 5, Article 30, 27 pages.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Paul-Christian Buerkner. brms: An R Package for Bayesian Multilevel Models using Stan. Journal of Statistical Software (in press).",
      "doi": ""
    },
    {
      "text": "Daniel J. Buysse, Charles F. Reynolds, Timothy H. Monk, Susan R. Berman, and David J. Kupfer. 1989. The Pittsburgh Sleep Quality Index: a new instrument for psychiatric practice and research. Psychiatry research 28, 2: 193--213.",
      "doi": ""
    },
    {
      "text": "Taj Campbell, Brian Ngo, and James Fogarty. 2008. Game design principles in everyday fitness applications. In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08), 249--252.  ",
      "doi": "10.1145/1460563.1460603"
    },
    {
      "text": "Bob Carpenter, Andrew Gelman, Matt Hoffman, Daniel Lee, Ben Goodrich, Michael Betancourt, Michael A. Brubaker, Jiqiang Guo, Peter Li, and Allen Riddell. 2016. Stan: A probabilistic programming language. Journal of Statistical Software (in press).",
      "doi": ""
    },
    {
      "text": "Jeannette S. Chin, Victor Callaghan, and Graham Clarke. 2006. An end-user programming paradigm for pervasive computing applications. In 2006 ACS/IEEE International Conference on Pervasive Services, 325328.  ",
      "doi": "10.1109/PERSER.2006.1652254"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity sensing in the wild: a field trial of ubifit garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Allen Cypher and Daniel Conrad Halbert. Watch what I do: programming by demonstration. MIT press, 1993. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Siddharth Dalal, Majd Alwan, Reza Seifrafi, Steve Kell, and Donald Brown. 2005. A rule-based approach to the analysis of elders activity data: Detection of health and possible emergency conditions. In AAAI Fall 2005 Symposium, pp. 2545--2552.",
      "doi": ""
    },
    {
      "text": "Nediyana Daskalova, Danaë Metaxa-Kakavouli, Adrienne Tran, Nicole Nugent, Julie Boergers, John McGeary, and Jeff Huang. 2016. SleepCoacher: A Personalized Automated Self-Experimentation System for Sleep Recommendations. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 347--358.  ",
      "doi": "10.1145/2984511.2984534"
    },
    {
      "text": "Anind K. Dey, Timothy Sohn, Sara Streng, and Justin Kodama. 2006. iCAP: Interactive prototyping of context-aware applications. In International Conference on Pervasive Computing, 254--271.  ",
      "doi": "10.1007/11748625_16"
    },
    {
      "text": "Brian J. Fogg. 2002. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann. ",
      "doi": "10.5555/2821581"
    },
    {
      "text": "Brian J. Fogg. 2009. A behavior model for persuasive design. In Proceedings of the 4th international Conference on Persuasive Technology, 40.  ",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Martha M. Funnell, Tammy L. Brown, Belinda P. Childs, Linda B. Haas, Gwen M. Hosey, Brian Jensen, Melinda Maryniuk et al. 2009. National standards for diabetes self-management education. Diabetes care 32, no. Supplement 1: S87-S94.",
      "doi": ""
    },
    {
      "text": "Manuel García-Herranz, Pablo A. Haya, and Xavier Alamán. 2010. Towards a Ubiquitous End-User Programming System for Smart Spaces. J. UCS 16, 12: 1633--1649.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and David Weakliem. 2009. Of beauty, sex and power: Too little attention has been paid to the statistical challenges in estimating small effects. American Scientist 97, 4: 310--316.",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and John Carlin. 2014. Beyond Power Calculations: Assessing Type S (Sign) and Type M (Magnitude) Errors. Perspectives on Psychological Science 9, 6: 641--651.",
      "doi": ""
    },
    {
      "text": "Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the theoretical gap: interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3307--3316.  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Eric B. Hekler, Susan Michie, Misha Pavel, Daniel E. Rivera, Linda M. Collins, Holly B. Jimison, Claire Garnett, Skye Parral, Donna Spruijt-Metz. 2016. Advancing Models and Theories for Digital Behavior Change Interventions. American Journal of Preventive Medicine, 51,5: 825--832.",
      "doi": ""
    },
    {
      "text": "George S. Howard, Scott E. Maxwell, and Kevin J. Fleming. 2000. The proof of the pudding: An illustration of the relative strengths of null hypothesis, metaanalysis, and Bayesian analysis. Psychological methods 5, 3: 315--332.",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R. Mishra, James Fogarty, Sean A. Munson, and Julie A. Kientz. 2015. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association: ocv150.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Gregory L. Nelson, and Eric B. Hekler. 2016. Researcher-Centered Design of Statistics: Why Bayesian Statistics Better Fit the Culture and Incentives of HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4521--4532.  ",
      "doi": "10.1145/2858036.2858465"
    },
    {
      "text": "Abby C. King, Eric B. Hekler, Lauren A. Grieco, Sandra J. Winter, Jylana L. Sheats, Matthew P. Buman, Banny Banerjee, Thomas N. Robinson, and Jesse Cirimele. 2013. Harnessing different motivational frames via mobile phones to promote daily physical activity and reduce sedentary behavior in aging adults. PloS one 8, 4: e62613.",
      "doi": ""
    },
    {
      "text": "Vladimir J. Konečni. 2008. Does music induce emotion? A theoretical and methodological analysis. Psychology of Aesthetics, Creativity, and the Arts 2, 2: 115.",
      "doi": ""
    },
    {
      "text": "Richard L. Kravitz, Naihua Duan, eds, and the DEcIDE Methods Center N-of-1 Guidance Panel. Design and Implementation of N-of-1 Trials: A User's Guide. AHRQ Publication No. 13(14)-EHC122-EF. Rockville, MD: Agency for Healthcare Research and Quality; February 2014. www.effectivehealthcare.ahrq.gov/N1-Trials.cfm.",
      "doi": ""
    },
    {
      "text": "Patricia Lacks and Monique Rotert. Knowledge and practice of sleep hygiene techniques in insomniacs and good sleepers. Behaviour research and therapy 24, 3: 365--368.",
      "doi": ""
    },
    {
      "text": "Gary P. Latham. 2003. Goal Setting: A Five-Step Approach to Behavior Change. Organizational Dynamics 32, 3: 309--318.",
      "doi": ""
    },
    {
      "text": "Jisoo Lee, Erin Walker, Winslow Burleson, and Eric B. Hekler. 2014. Exploring users' creation of personalized behavioral plans. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct), 703--706.  ",
      "doi": "10.1145/2638728.2641318"
    },
    {
      "text": "Jisoo Lee, Erin Walker, Winslow Burleson, and Eric B. Hekler. 2015. Understanding Users' Creation of Behavior Change Plans with Theory-Based Support. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 2301--2306.  ",
      "doi": "10.1145/2702613.2732870"
    },
    {
      "text": "John K Kruschke. 2013. Bayesian estimation supersedes the t test. Journal of Experimental Psychology: General 142, 2: 573--603.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining behavioral economics to design persuasive technology for healthy choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 325--334.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: supporting self-reflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11), 405--414.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Ian Li. 2011. Personal Informatics and Context: Using Context to Reveal Factors that Affect Behavior. Ph.D Dissertation. Carnegie Mellon University, Pittsburgh, PA.. ",
      "doi": "10.5555/2520311"
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-user development: An emerging paradigm. In End user development, 1--8.",
      "doi": ""
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish-n-Steps: Encouraging physical activity with an interactive computer game. In International Conference on Ubiquitous Computing, 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Helen Lindner, David Menzies, Jill Kelly, Sonya Taylor, and Marianne Shearer. 2003. Coaching for behaviour change in chronic disease: a review of the literature and the implications for coaching as a selfmanagement intervention. Australian Journal of Primary Health 9, 3: 177--185.",
      "doi": ""
    },
    {
      "text": "Steven R. Livingstone, Ralf Mühlberger, Andrew R. Brown, and Andrew Loch. 2007. Controlling musical emotionality: An affective computational architecture for influencing musical emotions. Digital Creativity 18, 1: 43--53.",
      "doi": ""
    },
    {
      "text": "Edwin A. Locke and Gary P. Latham. 2002. Building a practically useful theory of goal setting and task motivation: A 35-year odyssey. American psychologist 57, 9: 705.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 477486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Richard McElreath. 2016. Statistical rethinking: A Bayesian course with examples in R and Stan. Vol. 122. CRC Press.",
      "doi": ""
    },
    {
      "text": "Susan Michie, Maartje M. van Stralen, and Robert West. 2011. The behaviour change wheel: a new method for characterising and designing behaviour change interventions. Implementation Science 6, 1: 1.",
      "doi": ""
    },
    {
      "text": "Susan Michie, Michelle Richardson, Marie Johnston, Charles Abraham, Jill Francis, Wendy Hardeman, Martin P. Eccles, James Cane, and Caroline E. Wood. 2013. The behavior change technique taxonomy (v1) of 93 hierarchically clustered techniques: building an international consensus for the reporting of behavior change interventions. Annals of behavioral medicine 46, 1: 81--95.",
      "doi": ""
    },
    {
      "text": "Susan Michie, Lou Atkins, & Robert West. 2014. The Behaviour Change Wheel: A Guide To Designing Interventions. Silverback Publishing.",
      "doi": ""
    },
    {
      "text": "Mark Muraven and Roy F. Baumeister. 2000. Selfregulation and depletion of limited resources: Does self-control resemble a muscle?. Psychological bulletin 126, 2: 247.",
      "doi": ""
    },
    {
      "text": "Inbal Nahum-Shani, Eric B. Hekler, and Donna Spruijt-Metz. 2015. Building health behavior models to guide the development of just-in-time adaptive interventions: A pragmatic framework. Health Psychology 34, S: 1209.",
      "doi": ""
    },
    {
      "text": "Jason Nawyn, Stephen S. Intille, and Kent Larson. 2006. Embedding behavior modification strategies into a consumer electronic device: a case study. In Proceedings of the 8th international conference on Ubiquitous Computing (UbiComp'06), 297--314.  ",
      "doi": "10.1007/11853565_18"
    },
    {
      "text": "Miriam E. Nelson, W. Jack Rejeski, Steven N. Blair, Pamela W. Duncan, James O. Judge, Abby C. King, Carol A. Macera, and Carmen Castaneda-Sceppa. 2007. Physical activity and public health in older adults: recommendation from the American College of Sports Medicine and the American Heart Association. Circulation 116, 9: 1094.",
      "doi": ""
    },
    {
      "text": "Virpi Oksman and Pirjo Rautiainen. 2003. \"Perhaps it is a Body Part?: How the Mobile Phone Became an Organic Part of the Everyday Lives of Finnish Children and Teenagers. Machines that become us: The social context of communication technology: 293--308.",
      "doi": ""
    },
    {
      "text": "Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2014. Sensor-based identification of opportune moments for triggering notifications. IEEE Pervasive Computing 13, 1: 22--29.  ",
      "doi": "10.1109/MPRV.2014.15"
    },
    {
      "text": "Mashfiqui Rabbi, Min Hane Aung, Mi Zhang, and Tanzeem Choudhury. 2015. MyBehavior: automatic personalized health feedback from user behaviors and preferences using smartphones. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 707718.  ",
      "doi": "10.1145/2750858.2805840"
    },
    {
      "text": "Paschal Sheeran. 2002. Intention-behavior relations: A conceptual and empirical review. European review of social psychology 12, 1: 1--36.",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Kristina Höök, Martin Svensson, Alex S. Taylor, and Marco Combetto. 2009. Experiencing the affective diary. Personal and Ubiquitous Computing 13, 5: 365--378.  ",
      "doi": "10.1007/s00779-008-0202-7"
    },
    {
      "text": "Edward J. Stepanski and James K. Wyatt. 2003. Use of sleep hygiene in the treatment of insomnia. Sleep medicine reviews 7, 3: 215--225.",
      "doi": ""
    },
    {
      "text": "Tammy Toscos, Anne Faber, Shunying An, and Mona Praful Gandhi. 2006. Chick clique: persuasive technology to motivate teenage girls to exercise. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06), 1873--1878.  ",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "Khai N. Truong, Elaine M. Huang, and Gregory D. Abowd. 2004. CAMP: A magnetic poetry interface for end-user programming of capture applications for the home. In International Conference on Ubiquitous Computing, 143--160.",
      "doi": ""
    },
    {
      "text": "Van Dantzig, Saskia, Gijs Geleijnse, and Aart Tijmen van Halteren. 2013. Toward a persuasive mobile application to reduce sedentary behavior.Personal and ubiquitous computing 17, 6: 1237--1246.  ",
      "doi": "10.1007/s00779-012-0588-0"
    },
    {
      "text": "Fang Xu, Machell Town, Lina S. Balluz, William P. Bartoli, Wilmon Murphy, Pranesh P. Chowdhury, William S. Garvin et al. 2013. Surveillance for certain health behaviors among States and selected local areas-United States, 2010. MMWR Surveill Summ 62, 1: 1--247.",
      "doi": ""
    }
  ]
}