{
  "doi": "10.1145/3025453.3025894",
  "title": "Passive yet Expressive TouchTokens",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3741-3745",
  "year": 2017,
  "badges": [],
  "abstract": "TouchTokens are passive tokens that can be recognized on any capacitive surface based on the spatial configuration of the fingers that hold them. However, interaction with these tokens is confined to the basic two-state model of touch interaction as the system only knows the tokens' position and cannot detect tokens that are not touched. We increase the expressive power of TouchTokens by introducing laser-cut lattice hinges in their design, so as to make them flexible. A new recognizer, that analyzes the micro-movements of the fingers that hold the tokens, enables the system to detect when a token is left on the surface rather than taken off it. It can also detect bend events that can be mapped to command triggers, and a squeezed state that can be used for quasi-modal interaction.",
  "authors": [
    {
      "name": "Rafael Morales González",
      "institution": "Université Paris-Saclay, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021549",
      "orcid": "missing"
    },
    {
      "name": "Caroline Appert",
      "institution": "Université Paris-Saclay, Orsay, France",
      "img": "/do/10.1145/contrib-81311484266/rel-imgonly/id-appert.jpg",
      "acmid": "81311484266",
      "orcid": "0000-0002-3050-9284"
    },
    {
      "name": "Gilles Bailly",
      "institution": "Université Paris-Saclay & Sorbonne Universités, Paris, France",
      "img": "/do/10.1145/contrib-81309498332/rel-imgonly/bailly.jpg",
      "acmid": "81309498332",
      "orcid": "missing"
    },
    {
      "name": "Emmanuel Pietriga",
      "institution": "Université Paris-Saclay, Orsay, France",
      "img": "/do/10.1145/contrib-81100222004/rel-imgonly/id2013.jpg",
      "acmid": "81100222004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch, Torsten Becker, and Frederik Rudeck. 2010. Lumino: Tangible Blocks for Tabletop Computers Based on Glass Fiber Bundles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 1165--1174. DOI: http://dx.doi.org/10.1145/1753326.1753500  ",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "David Bonnet, Caroline Appert, and Michel Beaudouin-Lafon. 2013. Extending the Vocabulary of Touch Events with ThumbRock. In Proceedings of Graphics Interface 2013 (GI '13). Canadian Information Processing Society, 221--228. http://dl.acm.org/citation.cfm?id=2532129.2532166",
      "doi": "10.5555/2532129.2532166"
    },
    {
      "text": "Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 2189--2192. DOI: http://dx.doi.org/10.1145/2207676.2208371  ",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Hans-Christian Jetter, Jens Gerken, Michael Zöllner, Harald Reiterer, and Natasa Milic-Frayling. 2011. Materializing the Query with Facet-streams: A Hybrid Surface for Collaborative Search on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 3013--3022. DOI: http://dx.doi.org/10.1145/1978942.1979390  ",
      "doi": "10.1145/1978942.1979390"
    },
    {
      "text": "Sergi Jordà, Günter Geiger, Marcos Alonso, and Martin Kaltenbrunner. 2007. The reacTable: Exploring the Synergy Between Live Music Performance and Tabletop Tangible Interfaces. In Proc. TEI '07. ACM, 139--146. DOI:http://dx.doi.org/10.1145/1226969.1226998  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Jakob Leitner and Michael Haller. 2011. Geckos: Combining Magnets and Pressure Images to Enable New Tangible-object Design and Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 2985--2994. DOI: http://dx.doi.org/10.1145/1978942.1979385  ",
      "doi": "10.1145/1978942.1979385"
    },
    {
      "text": "Rong-Hao Liang, Liwei Chan, Hung-Yu Tseng, Han-Chih Kuo, Da-Yuan Huang, De-Nian Yang, and Bing-Yu Chen. 2014. GaussBricks: Magnetic Building Blocks for Constructive Tangible Interactions on Portable Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 3153--3162. DOI: http://dx.doi.org/10.1145/2556288.2557105  ",
      "doi": "10.1145/2556288.2557105"
    },
    {
      "text": "Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-free Near-surface Interactions. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, 2837--2838. DOI: http://dx.doi.org/10.1145/2468356.2479537  ",
      "doi": "10.1145/2468356.2479537"
    },
    {
      "text": "Rafael Morales González, Caroline Appert, Gilles Bailly, and Emmanuel Pietriga. 2016. TouchTokens: Guiding Touch Patterns with Passive Tokens. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 4189--4202. DOI: http://dx.doi.org/10.1145/2858036.2858041  ",
      "doi": "10.1145/2858036.2858041"
    },
    {
      "text": "Anne Roudaut, Eric Lecolinet, and Yves Guiard. 2009. MicroRolls: Expanding Touch-screen Input Vocabulary by Distinguishing Rolls vs. Slides of the Thumb. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, 927--936. DOI:http://dx.doi.org/10.1145/1518701.1518843  ",
      "doi": "10.1145/1518701.1518843"
    },
    {
      "text": "Pranab Kumar Sen. 1968. Estimates of the Regression Coefficient Based on Kendall's Tau. J. Amer. Statist. Assoc. 63, 324 (1968), 1379--1389. DOI: http://dx.doi.org/10.1080/01621459.1968.10480934 ",
      "doi": ""
    },
    {
      "text": "Simon Voelker, Christian Cherek, Jan Thar, Thorsten Karrer, Christian Thoresen, Kjell Ivar Øvergård, and Jan Borchers. 2015. PERCs: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays. In Proc. UIST '15. ACM, 351--356. DOI: http://dx.doi.org/10.1145/2807442.2807466  ",
      "doi": "10.1145/2807442.2807466"
    },
    {
      "text": "Simon Voelker, Kosuke Nakajima, Christian Thoresen, Yuichi Itoh, Kjell Ivar Øvergård, and Jan Borchers. 2013. PUCs: Detecting Transparent, Passive Untouched Capacitive Widgets on Unmodified Multi-touch Displays. In Proc. ITS '13. ACM, 101--104. DOI: http://dx.doi.org/10.1145/2512349.2512791  ",
      "doi": "10.1145/2512349.2512791"
    },
    {
      "text": "Cary Williams, Xing Dong Yang, Grant Partridge, Joshua Millar-Usiskin, Arkady Major, and Pourang Irani. 2011. TZee: Exploiting the Lighting Properties of Multi-touch Tabletops for Tangible 3D Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 1363--1372. DOI: http://dx.doi.org/10.1145/1978942.1979143  ",
      "doi": "10.1145/1978942.1979143"
    }
  ]
}