{
  "doi": "10.1145/3025453.3025763",
  "title": "Understanding the Effects of Endorsements in Scientific Crowdfunding",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2376-2381",
  "year": 2017,
  "badges": [],
  "abstract": "Understanding the factors that persuade backers to donate to research projects has become increasingly important with the rising popularity of scientific crowdfunding. Although there are many similarities between enterprise and scientific crowdfunding, some factors differentiate these two forms of crowdfunding. One such factor is the use of endorsements. The endorsement helps backers gain trust based on expert opinions about the competency of the researchers and the usefulness of the projects. We analyzed 810 endorsements from scientific campaigns posted on Experiment.com and derived a taxonomy of topics discussed in the endorsements. A regression analysis revealed that when endorsers explained the skills of the campaign owners, the probability of success of the campaign improved; on the contrary, when endorsers reiterated the goal of the project, the campaign was less likely to succeed. We conclude with design implications formulated from our findings to better support scientific crowdfunding.",
  "tags": [
    "endorsement",
    "crowdfunding",
    "scientific crowdfunding"
  ],
  "authors": [
    {
      "name": "Sanorita Dey",
      "institution": "University of Illinois at Urbana-Champaign, Champaign, IL, USA",
      "img": "/do/10.1145/contrib-99658693184/rel-imgonly/capture.png",
      "acmid": "99658693184",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "University of Illinois at Urbana-Champaign & Adobe Systems, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    },
    {
      "name": "Wai-Tat Fu",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244379",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mathieu Bastian, Matthew Hayes, William Vaughan, Sam Shah, Peter Skomoroch, Hyungjin Kim, Sal Uryasev, and Christopher Lloyd. 2014. LinkedIn skills: large-scale topic extraction and inference. In Proceedings of the 8th ACM Conference on Recommender systems. ACM, 1--8. DOI:http://dx.doi.org/10.1145/2645710.2645729  ",
      "doi": "10.1145/2645710.2645729"
    },
    {
      "text": "Experiment Blog. 2014. http://blog.experiment.com/post/102283938857/endorsementsexplained. (22 Jan 2014).",
      "doi": ""
    },
    {
      "text": "J Cohen. 1960. A coefficient of agreement for nominal scales. Educational and Psychosocial Measurement, 20, 37--46. (1960). ",
      "doi": ""
    },
    {
      "text": "crowdfunder. 2016. https://www.crowdfunder.com/. (2016).",
      "doi": ""
    },
    {
      "text": "crowd.science. 2016. https://crowd.science/. (2016).",
      "doi": ""
    },
    {
      "text": "Judith Donath. 2007. Signals in social supernets. Journal of Computer-Mediated Communication 13, 1 (2007), 231--251.  ",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Vincent Etter, Matthias Grossglauser, and Patrick Thiran. 2013. Launch hard or go home!: predicting the success of kickstarter campaigns. In Proceedings of the first ACM conference on Online social networks. ACM, 177--182. DOI:http://dx.doi.org/10.1145/2512938.2512957  ",
      "doi": "10.1145/2512938.2512957"
    },
    {
      "text": "Experiment. 2016. https://experiment.com/. (2016).",
      "doi": ""
    },
    {
      "text": "Fundable. 2016. https://www.fundable.com/. (2016).",
      "doi": ""
    },
    {
      "text": "Michael D Greenberg and Elizabeth M Gerber. 2014. Learning to fail: experiencing public failure online through crowdfunding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 581--590. DOI: http://dx.doi.org/10.1145/2556288.2557110  ",
      "doi": "10.1145/2556288.2557110"
    },
    {
      "text": "Michael D Greenberg, Bryan Pardo, Karthic Hariharan, and Elizabeth Gerber. 2013. Crowdfunding support tools: predicting success & failure. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1815--1820. DOI: http://dx.doi.org/10.1145/2468356.2468682  ",
      "doi": "10.1145/2468356.2468682"
    },
    {
      "text": "A Gerson Greenburg, Jennifer Doyle, and DK McClure. 1994. Letters of recommendation for surgical residencies: what they say and what they mean. Journal of Surgical Research 56, 2 (1994), 192--198. DOI: http://dx.doi.org/10.1006/jsre.1994.1031 ",
      "doi": ""
    },
    {
      "text": "Robert M Guion. 2011. Assessment, measurement, and prediction for personnel decisions. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Julie S Hui and Elizabeth M Gerber. 2015. Crowdfunding Science: Sharing Research with an Extended Audience. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM press, 31--43. DOI: http://dx.doi.org/10.1145/2675133.2675188  ",
      "doi": "10.1145/2675133.2675188"
    },
    {
      "text": "Jennifer G Kim, Ha Kyung Kong, Karrie Karahalios, Wai-Tat Fu, and Hwajung Hong. 2016. The Power of Collective Endorsements: Credibility Factors in Medical Crowdfunding Campaigns. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4538--4549.",
      "doi": "10.1145/2858036.2858289"
    },
    {
      "text": "Bennett Klusas. 2016. https://medium.com/@bklusas/freedom-throughcrowdfunding-35a01b0fca14. (25 Feb 2016).",
      "doi": ""
    },
    {
      "text": "Mike Lauer. 2016. Grant Renewal Success Rates: Then and Now. (2016). https://nexus.od.nih.gov/all/2016/05/ 26/grant-renewal-success-rates-then-and-now/.",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra and Eric Gilbert. 2014. The language that gets people to give: Phrases that predict success on kickstarter. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 49--61. DOI: http://dx.doi.org/10.1145/2531602.2531656  ",
      "doi": "10.1145/2531602.2531656"
    },
    {
      "text": "Ethan Mollick. 2014. The dynamics of crowdfunding: An exploratory study. Journal of Business Venturing 29, 1 (2014), 1--16. DOI: http://dx.doi.org/10.1016/j.jbusvent.2013.06.005 ",
      "doi": ""
    },
    {
      "text": "Thomas Müllerleile and Dieter William Joenssen. 2015. Key success-determinants of crowdfunded projects: An exploratory analysis. In Data Science, Learning by Latent Structures, and Knowledge Discovery. Springer, 271--281.",
      "doi": ""
    },
    {
      "text": "Nico JD Nagelkerke. 1991. A note on a general definition of the coefficient of determination. Biometrika 78, 3 (1991), 691--692. ",
      "doi": ""
    },
    {
      "text": "NSF. 2015. Report to the National Science Board on the National Science FoundationaAZs Merit Review Process Fiscal Year 2014. (2015). http: //www.nsf.gov/nsb/publications/2015/nsb201514.pdf.",
      "doi": ""
    },
    {
      "text": "Vineeth Rakesh, Jaegul Choo, and Chandan K Reddy. 2015. Project recommendation using heterogeneous traits in crowdfunding. In Ninth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Lillian M Range, Andrea Menyhert, Michael L Walsh, Kimeron N Hardin, Jon B Ellis, and Ray Craddick. 1991. Letters of recommendation: Perspectives, recommendations, and ethics. Professional Psychology: Research and Practice 22, 5 (1991), 389. DOI: http://dx.doi.org/10.1037/0735--7028.22.5.389",
      "doi": ""
    },
    {
      "text": "Rockethub. 2016. https://www.rockethub.com/. (2016).",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237--246. ",
      "doi": ""
    },
    {
      "text": "Carolyn Tripp, Thomas D Jensen, and Les Carlson. 1994. The effects of multiple product endorsements by celebrities on consumers' attitudes and intentions. Journal of consumer research 20, 4 (1994), 535--547. DOI:http://dx.doi.org/10.1086/209368 ",
      "doi": ""
    },
    {
      "text": "Rachel E Wheat, Yiwei Wang, Jarrett E Byrnes, and Jai Ranganathan. 2013. Raising money for scientific research through crowdfunding. Trends in ecology & evolution 28, 2 (2013), 71--72. DOI: http://dx.doi.org/10.1016/j.tree.2012.11.001 ",
      "doi": ""
    },
    {
      "text": "Anbang Xu, Xiao Yang, Huaming Rao, Wai-Tat Fu, Shih-Wen Huang, and Brian P Bailey. 2014. Show me the money!: An analysis of project updates during crowdfunding campaigns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 591--600. DOI: http://dx.doi.org/10.1145/2556288.2557045  ",
      "doi": "10.1145/2556288.2557045"
    }
  ]
}