{
  "doi": "10.1145/3025453.3025898",
  "title": "Printflatables: Printing Human-Scale, Functional and Dynamic Inflatable Objects",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3669-3680",
  "year": 2017,
  "badges": [],
  "abstract": "Printflatables is a design and fabrication system for human-scale, functional and dynamic inflatable objects. We use inextensible thermoplastic fabric as the raw material with the key principle of introducing folds and thermal sealing. Upon inflation, the sealed object takes the expected three dimensional shape. The workflow begins with the user specifying an intended 3D model which is decomposed to two dimensional fabrication geometry. This forms the input for a numerically controlled thermal contact iron that seals layers of thermoplastic fabric. In this paper, we discuss the system design in detail, the pneumatic primitives that this technique enables and merits of being able to make large, functional and dynamic pneumatic artifacts. We demonstrate the design output through multiple objects which could motivate fabrication of inflatable media and pressure-based interfaces.",
  "authors": [
    {
      "name": "Harpreet Sareen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161013",
      "orcid": "0000-0002-0897-8105"
    },
    {
      "name": "Udayan Umapathi",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707463",
      "orcid": "missing"
    },
    {
      "name": "Patrick Shin",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162149",
      "orcid": "missing"
    },
    {
      "name": "Yasuaki Kakehi",
      "institution": "Keio University, Kanagawa, Japan",
      "img": "/do/10.1145/contrib-81100527572/rel-imgonly/kakehiyasuaki.jpg",
      "acmid": "81100527572",
      "orcid": "0000-0003-4063-9944"
    },
    {
      "name": "Jifei Ou",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498656343",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusettes Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    },
    {
      "name": "Pattie Maes",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319638",
      "orcid": "0000-0002-7722-6038"
    }
  ],
  "references": [
    {
      "text": "Joanna Berzowska and Marcelo Coelho. 2005. Kukkia and vilkas: Kinetic electronic garments. In Proceedings of Ninth IEEE International Symposium on Wearable Computers. DOI: http://dx.doi.org/10.1109/ISWC.2005.29  ",
      "doi": "10.1109/ISWC.2005.29"
    },
    {
      "text": "Andrew Bolton. 2002. The supermodern wardrobe. V&A Publications London.",
      "doi": ""
    },
    {
      "text": "Fergal B Coulter and Anton Ianakiev. 2015. 4D Printing Inflatable Silicone Structures. 3D Printing and Additive Manufacturing (2015). DOI: http://dx.doi.org/10.1.1/jpb001",
      "doi": ""
    },
    {
      "text": "Furuta et al. 2010. A film balloon design system integrated with shell element simulation. Proc. of EUROGRAPHICS 2010 (2010). DOI: http://dx.doi.org/10.2312/egsh.20101041",
      "doi": ""
    },
    {
      "text": "Yao et al. 2013. PneUI: Pneumatically actuated soft composite materials for shape changing interfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology. DOI: http://dx.doi.org/10.1145/2501988.2502037  ",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology. DOI: http://dx.doi.org/10.1145/2380116.2380181  ",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "Grasshopper. 2016. Grasshopper for Rhino. (2016). http://www.grasshopper3d.com/",
      "doi": ""
    },
    {
      "text": "Grasshopper3D. 2016. Kangaroo for Grasshopper. (2016). http://www.grasshopper3d.com/group/kangaroo",
      "doi": ""
    },
    {
      "text": "Fumio Hara and Rolf Pfeifer. 2003. Morpho-functional machines: The new species: Designing embodied intelligence. Springer Science & Business Media. DOI: http://dx.doi.org/10.1007/978--4--431--67869--4",
      "doi": ""
    },
    {
      "text": "Thomas Herzog, Gernot Minke, and Hans Eggers. 1976. Pneumatic structures: A handbook of inflatable architecture. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Hovding. 2016. Hovding Airbag for Cyclists. (2016). http://www.hovding.com [Online; accessed 18-September-2016].",
      "doi": ""
    },
    {
      "text": "Yuki Igarashi and Takeo Igarashi. 2008. Pillow: Interactive flattening of a 3D model for plush toy design. In Smart Graphics. Springer, 1--7. DOI: http://dx.doi.org/10.1007/978--3--540--85412--8_1",
      "doi": ""
    },
    {
      "text": "Filip Ilievski, Aaron D Mazzeo, Robert F Shepherd, Xin Chen, and George M Whitesides. 2011. Soft robotics for chemists. Angewandte Chemie International Edition (2011). DOI: http://dx.doi.org/10.1002/anie.201006464 ",
      "doi": ""
    },
    {
      "text": "Jacno Inc. 2016. Janco Inflatables Manufacturing. (2016). http://www.janco-inc.com/manufacturing-services/rf-sealing.html [Online; accessed 18-December-2016].",
      "doi": ""
    },
    {
      "text": "Sangbae Kim, Cecilia Laschi, and Barry Trimmer. 2013. Soft robotics: a bioinspired evolution in robotics. Trends in biotechnology (2013). DOI: http://dx.doi.org/10.1016/j.tibtech.2013.03.002 ",
      "doi": ""
    },
    {
      "text": "Ellen Lupton. 2002. Skin: New Design Organics. Skin: Surface, Substance and Design. NY: Princeton Architectural Press (2002).",
      "doi": ""
    },
    {
      "text": "Ramses V Martinez et al. 2012. Elastomeric Origami: Programmable Paper-Elastomer Composites as Pneumatic Actuators. Advanced Functional Materials 22, 7 (2012), 1376--1384. DOI: http://dx.doi.org/10.1002/adfm.201102978 ",
      "doi": ""
    },
    {
      "text": "Ramses V Martinez et al. 2013. Robotic tentacles with three-dimensional mobility based on flexible elastomers. Advanced Materials 25, 2 (2013), 205--212. DOI: http://dx.doi.org/10.1002/adma.201203002 ",
      "doi": ""
    },
    {
      "text": "Yuki Mori and Takeo Igarashi. 2007. Plushie: an interactive design system for plush toys. In ACM Transactions on Graphics (TOG). DOI: http://dx.doi.org/10.1145/1276377.1276433  ",
      "doi": "10.1145/1276377.1276433"
    },
    {
      "text": "Ryuma Niiyama, Daniela Rus, and Sangbae Kim. 2014. Pouch motors: Printable/inflatable soft actuators for robotics. In 2014 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 6332--6337. DOI:http://dx.doi.org/10.1089/3dp.2015.0017 ",
      "doi": ""
    },
    {
      "text": "Ryuma Niiyama, Xu Sun, Cynthia Sung, Byoungkwon An, Daniela Rus, and Sangbae Kim. 2015a. Pouch motors: Printable soft actuators integrated with computational design. Soft Robotics 2, 2 (2015), 59--70. DOI:http://dx.doi.org/10.1089/soro.2014.0023 ",
      "doi": ""
    },
    {
      "text": "Ryuma Niiyama, Xu Sun, Lining Yao, Hiroshi Ishii, Daniela Rus, and Sangbae Kim. 2015b. Sticky Actuator: Free-Form Planar Actuators for Animated Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 77--84. DOI: http://dx.doi.org/10.1145/2677199.2680600  ",
      "doi": "10.1145/2677199.2680600"
    },
    {
      "text": "Jifei Ou et al. 2014. jamSheets: thin interfaces with tunable stiffness enabled by layer jamming. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM. DOI:http://dx.doi.org/10.1145/2540930.2540971  ",
      "doi": "10.1145/2540930.2540971"
    },
    {
      "text": "Jifei Ou et al. 2016. aeroMorph-Heat-sealing Inflatable Shape-change Materials for Interaction Design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 121--132. DOI:http://dx.doi.org/10.1145/2984511.2984520  ",
      "doi": "10.1145/2984511.2984520"
    },
    {
      "text": "Laura Perovich, Philippa Mothersill, and Jennifer Broutin Farah. 2014. Awakened apparel: embedded soft actuators for expressive fashion and functional garments. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. DOI: http://dx.doi.org/10.1145/2540930.2540958  ",
      "doi": "10.1145/2540930.2540958"
    },
    {
      "text": "Panagiotis Polygerinos, Kevin C Galloway, Emily Savage, Maxwell Herman, Kathleen O'Donnell, and Conor J Walsh. 2015. Soft robotic glove for hand rehabilitation and task specific training. In 2015 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 2913--2919. DOI: http://dx.doi.org/10.1109/ICRA.2015.7139597 ",
      "doi": ""
    },
    {
      "text": "Panagiotis Polygerinos, Stacey Lyne, Zheng Wang, Luis Fernando Nicolini, Bobak Mosadegh, George M Whitesides, and Conor J Walsh. 2013. Towards a soft pneumatic glove for hand rehabilitation. In 2013 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 1512--1517. DOI: http://dx.doi.org/10.1109/IROS.2013.6696549 ",
      "doi": ""
    },
    {
      "text": "Panagiotis Polygerinos, Zheng Wang, Kevin C Galloway, Robert J Wood, and Conor J Walsh. 2015. Soft robotic glove for combined assistance and at-home rehabilitation. Robotics and Autonomous Systems 73 (2015), 135--143. DOI: http://dx.doi.org/10.1016/j.robot.2014.08.014  ",
      "doi": "10.1016/j.robot.2014.08.014"
    },
    {
      "text": "Dong Qin, Younan Xia, and George M Whitesides. 2010. Soft lithography for micro-and nanoscale patterning. Nature protocols (2010). DOI: http://dx.doi.org/10.1038/nprot.2009.234 ",
      "doi": ""
    },
    {
      "text": "Radio frequency welding. 2016. Heat Sealing using RF. (2016). http://radiofrequencywelding.com/ services/heat-sealing/ [Online; accessed 18-December-2016].",
      "doi": ""
    },
    {
      "text": "Sabine Seymour. 2008. Fashionable technology: The intersection of design, fashion, science, and technology. Springer Publishing Company, Incorporated. ",
      "doi": ""
    },
    {
      "text": "Mélina Skouras, Bernhard Thomaszewski, Peter Kaufmann, Akash Garg, Bernd Bickel, Eitan Grinspun, and Markus Gross. 2014. Designing inflatable structures. ACM Transactions on Graphics (TOG) 33, 4 (2014), 63. DOI:http://dx.doi.org/10.1145/2601097.2601166  ",
      "doi": "10.1145/2601097.2601166"
    },
    {
      "text": "Courtenay Smith and Sean Topham. 2005. Xtreme fashion. Prestel Pub.",
      "doi": ""
    },
    {
      "text": "Vijay K Stokes. 1989. Joining methods for plastics and plastic composites: an overview. Polymer Engineering & Science 29, 19 (1989), 1310--1324. DOI: http://dx.doi.org/10.1002/pen.760291903 ",
      "doi": ""
    },
    {
      "text": "Barry A Trimmer, Ann E Takesian, Brian M Sweet, Chris B Rogers, Daniel C Hake, and Daniel J Rogers. 2006. Caterpillar locomotion: a new model for soft-bodied climbing and burrowing robots. In 7th International Symposium on Technology and the Mine Problem, Vol. 1. Mine Warfare Association Monterey, CA, 1--10. DOI:http://dx.doi.org/10.1.1.84.4419",
      "doi": ""
    },
    {
      "text": "Deepak Trivedi, Christopher D Rahn, William M Kier, and Ian D Walker. 2008. Soft robotics: Biological inspiration, state of the art, and future research. Applied Bionics and Biomechanics (2008). DOI: http://dx.doi.org/10.1080/11762320802557865  ",
      "doi": "10.1080/11762320802557865"
    },
    {
      "text": "Human UI. 2016. Human UI for Grasshopper. (2016). http://www.food4rhino.com/app/human-ui",
      "doi": ""
    },
    {
      "text": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E Hudson. 2015. 3d printing pneumatic device controls with variable activation force capabilities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1295--1304. DOI: http://dx.doi.org/10.1145/2702123.2702569  ",
      "doi": "10.1145/2702123.2702569"
    },
    {
      "text": "Roel Vertegaal and Ivan Poupyrev. 2008. Organic user interfaces. Commun. ACM (2008). DOI: http://dx.doi.org/10.1145/1349026.1349033  ",
      "doi": "10.1145/1349026.1349033"
    }
  ]
}