{
  "doi": "10.1145/3025453.3025504",
  "title": "Tobiko: A Contact Array for Self-Configuring, Surface-Powered Sensors",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2024-2028",
  "year": 2017,
  "badges": [],
  "abstract": "This paper describes a contact array that outputs the maximum and minimum voltages at its contacts. The goal is to extract power for a detachable touch sensor, display, or other human-computer interaction (HCI) device that is attached to a surface by a user, and that does not have its own power source. Experimental results are shown for an array that has positive and negative outputs and a pass-through at each contact position. It solves the startup problem for a randomly-placed batteryless sensor patch or sticker, which can scan its ports to discover neighboring devices only after it obtains power. Applications include user-configurable electronic textile circuits, and new methods for prototyping and repairing large-area flexible circuits. This note describes construction of a 7x7 array, provides design rules, and examines the signal quality on two kinds of electronic surfaces.",
  "tags": [
    "wearables",
    "contact array",
    "e-textiles",
    "self-configuring"
  ],
  "authors": [
    {
      "name": "Cindy K. Harnett",
      "institution": "University of Louisville, Louisville, KY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160351",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Leah Buechley, David Mellis, Hannah Perner-Wilson, Emily Lovell, Bonifaz Kaufmann. 2010. Living wall: programmable wallpaper for interactive spaces. In Proceedings of the 18th ACM International Conference on Multimedia, 1401--1402.  ",
      "doi": "10.1145/1873951.1874226"
    },
    {
      "text": "Wataru Honda, Shingo Harada, Takayuki Arie, Seiji Akita, Kuniharu Takei. 2014. Wearable, Human-Interactive, Health-Monitoring, Wireless Devices Fabricated by Macroscale Printing Techniques. Advanced Functional Materials 24, 22 (2014), 3299--3304. ",
      "doi": ""
    },
    {
      "text": "Guido Gioberto, Lucy E. Dunne. 2013. Overlockstitched stretch sensors: characterization and effect of fabric property. Journal of Textile and Apparel, Technology and Management 8, 3 (2013), 1--14.",
      "doi": ""
    },
    {
      "text": "Asimina Kiourti, John L. Volakis. 2015. Highgeometrical-accuracy embroidery process for textile antennas with fine details. IEEE Antennas and Wireless Propagation Letters 14 (2015), 1474--1477. ",
      "doi": ""
    },
    {
      "text": "Thomas Vervust, Guy Buyle, Frederick Bossuyt, Jan Vanfleteren. 2012. Integration of stretchable and washable electronic modules for smart textile applications. Journal of The Textile Institute 103, 10 (2012), 1127--1138. ",
      "doi": ""
    },
    {
      "text": "Mary Ellen Berglund, Julia Duvall, Cory Simon, Lucy E. Dunne. 2015. Surface-mount component attachment for e-textiles. In Proceedings of the 2015 ACM International Symposium on Wearable Computers, 65--66.  ",
      "doi": "10.1145/2802083.2808413"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Nicholas Farrow, Naren Sivagnanadasan, Nikolaus Correll. 2014. Gesture based distributed user interaction system for a reconfigurable self-organizing smart wall. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction, 245--246.",
      "doi": "10.1145/2540930.2540967"
    },
    {
      "text": "Cindy K. Harnett. 2012. Trilife: A Kit for Large Group Workshops. Demonstration at Open Hardware Summit, NY, NY, September 27. Retrieved September 19, 2016 from http://issuu.com/harnettlab/docs/trilifeposter",
      "doi": ""
    },
    {
      "text": "Andreas Mehmann, Matija Varga, Karl Gönner, Gerhard Tröster. 2015. A ball-grid-array-like electronics-to-textile pocket connector for wearable electronics. In Proceedings of the 2015 ACM International Symposium on Wearable Computers, 57--60.  ",
      "doi": "10.1145/2802083.2802093"
    },
    {
      "text": "Open Dots project http://opendotsalliance.org/technicalinformation/application-notes/",
      "doi": ""
    },
    {
      "text": "Hoffmann, Frank, James Scott, Mike Addlesee, Glenford Mapp, Andy Hopper. \"Data transport on the networked surface.\" In Local Computer Networks, 2001. Proceedings. LCN 2001. 26th Annual IEEE Conference on, pp. 269--277. IEEE, 2001 ",
      "doi": ""
    },
    {
      "text": "Scott, James, Frank Hoffmann, Mike Addlesee, Glenford Mapp, Andy Hopper. \"Networked surfaces: a new concept in mobile networking.\" Mobile Networks and Applications 7, no. 5 (2002): 353--364.  ",
      "doi": "10.1023/A%3A1016539632660"
    },
    {
      "text": "Hoffmann, Frank, and James Scott. \"Location of mobile devices using Networked Surfaces.\" In International Conference on Ubiquitous Computing, pp. 281--298. Springer Berlin Heidelberg, 2002. ",
      "doi": ""
    },
    {
      "text": "Steurer, Philipp, and Mani B. Srivastava. \"System design of smart table.\" In Pervasive Computing and Communications, 2003.(PerCom 2003). Proceedings of the First IEEE International Conference on, pp. 473--480. IEEE, 2003. ",
      "doi": ""
    },
    {
      "text": "John A. Rogers, Takao Someya, Yonggang Huang. 2010. Materials and mechanics for stretchable electronics. Science 327, 5973 (2010), 1603--1607. ",
      "doi": ""
    },
    {
      "text": "Leonard S. Buchoff, Joseph P. Kosiarski, Chris A. Dalamangas. 1976. Method of making electrically conductive connector. U.S. Patent No. 3,982,320. WA, DC: U.S. Patent and Trademark Office.",
      "doi": ""
    },
    {
      "text": "Myung-Jin Yim, Kyung-Wook Paik. 1997. Design and understanding of anisotropic conductive films (ACFs) for LCD packaging. In Proceedings of the First IEEE International Symposium on Polymeric Electronics Packaging, 233--242.",
      "doi": ""
    },
    {
      "text": "Etienne Palleau, Stephen Reece, Sharvil C. Desai, Michael E. Smith, Michael D. Dickey. 2013. Self-healing stretchable wires for reconfigurable circuit wiring and 3D microfluidics. Advanced Materials 25, 11 (2013), 15891592.",
      "doi": ""
    },
    {
      "text": "Manero, R. B., J. Grewal, B. Michael, A. Shafti, K. Althoefer, J. Ll Fernandez, and M. J. Howard. \"Wearable Embroidered Muscle Activity Sensing Device for the Human Upper Leg.\" arXiv preprint arXiv:1602.04841 (2016).",
      "doi": ""
    },
    {
      "text": "Standards for placing sensors for each muscle group: http://www.seniam.org",
      "doi": ""
    },
    {
      "text": "V. Postrel, \"Why Nobody's Wearing Wearables,\" Bloomberg, March 3, 2016. Online: https://www.bloomberg.com/view/articles/2016-0303/why-nobody-s-wearing-wearables",
      "doi": ""
    },
    {
      "text": "Repository for scoring and plotting contacts: https://github.com/harnettlab/iPythonNotebookRepo/tree/m aster/Tobiko",
      "doi": ""
    }
  ]
}