{
  "doi": "10.1145/3025453.3025639",
  "title": "Starting Online Communities: Motivations and Goals of Wiki Founders",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6376-6380",
  "year": 2017,
  "badges": [],
  "abstract": "Why do people start new online communities? Previous research has studied what helps communities to grow and what motivates contributors, but the reasons that people create new communities in the first place remain unclear. We present the results of a survey of over 300 founders of new communities on the online wiki hosting site Wikia.com. We analyze the motivations and goals of wiki creators, finding that founders have diverse reasons for starting wikis and diverse ways of defining their success. Many founders see their communities as occupying narrow topics, and neither seek nor expect a large group of contributors. We also find that founders with differing goals approach community building differently. We argue that community platform designers can create interfaces that support the diverse goals of founders more effectively.",
  "authors": [
    {
      "name": "Jeremy Foote",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163254",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    },
    {
      "name": "Aaron Shaw",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81479644451/rel-imgonly/shaw_aaron-nu-headshot-2012-cropped2.jpg",
      "acmid": "81479644451",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Judd Antin, Coye Cheshire, and Oded Nov. 2012. Technology-mediated contributions: editing behaviors among new wikipedians. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 373--382.  ",
      "doi": "10.1145/2145204.2145264"
    },
    {
      "text": "Susan L. Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: Transformation of Participation in a Collaborative Online Encyclopedia. In Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work (GROUP '05). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Arnold C. Cooper, F. Javier Gimeno-Gascon, and Carolyn Y. Woo. 1994. Initial human and financial capital as predictors of new venture performance. Journal of Business Venturing 9, 5 (Sept. 1994), 371--395.",
      "doi": ""
    },
    {
      "text": "Kevin Crowston, Hala Annabi, and James Howison. 2003. Defining Open Source Software Project Success. In ICIS 2003 Proceedings. Seattle, Washington, USA, 327--340. http://aisel.aisnet.org/icis2003/28",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Yuli Patrick Hsieh. 2012. Succinct Survey Measures of Web-Use Skills. Social Science Computer Review 30, 1 (Feb. 2012), 95--107.  ",
      "doi": "10.1177/0894439310397146"
    },
    {
      "text": "Guido Hertel, Sven Niedner, and Stefanie Herrmann. 2003. Motivation of software developers in Open Source projects: an Internet-based survey of contributors to the Linux kernel. Research policy 32, 7 (2003), 1159--1177. http://www.sciencedirect.com/science/article/pii/S0048733303000477",
      "doi": ""
    },
    {
      "text": "Henry F. Kaiser and John Rice. 1974. Little Jiffy, Mark IV. Educational and Psychological Measurement 34, 1 (1974), 111--117.",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut and Andrew T. Fiore. 2014. The Role of Founders in Building Online Groups. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, Baltimore, Maryland, USA, 722--732.  ",
      "doi": "10.1145/2531602.2531648"
    },
    {
      "text": "Robert E. Kraut, Paul Resnick, and Sara Kiesler. 2011. Building successful online communities evidence-based social design. MIT Press, Cambridge, Mass. http://site.ebrary.com/id/10539250 ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Cliff Lampe, Rick Wash, Alcides Velasquez, and Elif Ozkaya. 2010. Motivations to participate in online communities. In Proceedings of the 28th international conference on Human factors in computing systems. ACM, Atlanta, Georgia, USA, 1927--1936.  ",
      "doi": "10.1145/1753326.1753616"
    },
    {
      "text": "Oded Nov. 2007. What motivates Wikipedians? Commun. ACM 50, 11 (2007), 60--64.  ",
      "doi": "10.1145/1297797.1297798"
    },
    {
      "text": "Tone A. Ostgaard and Sue Birley. 1996. New venture growth and personal networks. Journal of Business Research 36, 1 (May 1996), 37--50.",
      "doi": ""
    },
    {
      "text": "Joachim Schroer and Guido Hertel. 2009. Voluntary Engagement in an Open Web-Based Encyclopedia: Wikipedians and Why They Do It. Media Psychology 12 (Jan. 2009), 96--120(25).",
      "doi": ""
    },
    {
      "text": "Charles M. Schweik and Robert C. English. 2012. Internet Success: A Study of Open-source Software Commons. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/2339410"
    },
    {
      "text": "Georg von Krogh, Stefan Haefliger, Sebastian Spaeth, and Martin W. Wallin. 2012. Carrots and Rainbows: Motivation and Social Practice in Open Source Software Development. MIS Quarterly 36, 2 (June 2012), 649--676. ",
      "doi": "10.5555/2481639.2481654"
    }
  ]
}