{
  "doi": "10.1145/3025453.3025514",
  "title": "Supporting Community Health Workers in India through Voice- and Web-Based Feedback",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2770-2781",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Our research aims to support community health workers (CHWs) in low-resource settings by providing them with personalized information regarding their work. This information is delivered through a combination of voice- and web-based feedback that is derived from data already collected by CHWs. We describe the in situ participatory design approach used to create usable and appropriate feedback for low-literate CHWs and present usage data from a 12-month study with 71 CHWs in India. We show how the system supported and motivated CHWs, and how they used both the web- and voice-based systems, and each of the visualizations, for different reasons. We also show that the comparative feedback provided by the system introduced elements of competition that discouraged some CHWs while motivating others. Taken together, our findings suggest that providing personalized voice- and web-based feedback could be an effective way to support and motivate CHWs in low-resource settings.",
  "tags": [
    "chw",
    "mhealth",
    "community health",
    "hci4d",
    "asha",
    "ictd"
  ],
  "authors": [
    {
      "name": "Brian DeRenzi",
      "institution": "University of Cape Town, Cape Town, Western Cape, South Africa",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316488426",
      "orcid": "missing"
    },
    {
      "name": "Nicola Dell",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656510",
      "orcid": "0000-0002-6119-705X"
    },
    {
      "name": "Jeremy Wacksman",
      "institution": "Dimagi, Inc, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027525",
      "orcid": "missing"
    },
    {
      "name": "Scott Lee",
      "institution": "Harvard University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027490",
      "orcid": "missing"
    },
    {
      "name": "Neal Lesh",
      "institution": "Dimagi, Inc, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469781",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2011. Census of India. http://censusindia.gov.in/2011-prov-results/ paper2/data_files/UP/7-pop-12--22.pdf. (2011).",
      "doi": ""
    },
    {
      "text": "2012. Uttar Pradesh State Profile. http://nrhm.gov.in/nrhm-in-state/ state-wise-information/uttar-pradesh.html. (2012).",
      "doi": ""
    },
    {
      "text": "2013. Baseline Study Summary: ReMiND. Technical Report. Catholic Relief Services.",
      "doi": ""
    },
    {
      "text": "Matt Berg, James Wariero, and Vijay Modi. 2009. Every child counts: The use of SMS in Kenya to support the community based management of acute malnutrition and malaria in children under five. Columbia University.",
      "doi": ""
    },
    {
      "text": "Evan Borkum, Anitha Sivasankaran, Swetha Sridharan, Dana Rotz, Sukhmani Sethi, Mercy Manoranjini, Lakshmi Ramakrishnan, and Anu Rangarajan. 2015. Evaluation of the Information and Communication Technology (ICT) Continuum of Care Services (CCS) Intervention in Bihar. Technical Report. Mathematica Policy Research.",
      "doi": ""
    },
    {
      "text": "C Bourne, V Knight, R Guy, H Wand, H Lu, and A McNulty. 2011. Short message service reminder intervention doubles sexually transmitted infection/HIV retesting rates among men who have sex with men. Sexually transmitted infections 87, 3 (2011), 229--231. ",
      "doi": ""
    },
    {
      "text": "Marshini Chetty and Rebecca E. Grinter. 2007. HCI4D: HCI Challenges in the Global South. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). 2327--2332.",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The Ins and Outs of HCI for Development. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). 2220--2232.  ",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. \"Yours is Better!\": Participant Response Bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 1321--1330.  ",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Brian DeRenzi, Leah Findlater, Jonathan Payne, Benjamin Birnbaum, Joachim Mangilima, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving Community Health Worker Performance Through Automated SMS. In International Conference on Information and Communication Technologies and Development (ICTD '12). 25--34.  ",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Brian DeRenzi, Neal Lesh, Tapan Parikh, Clayton Sims, Werner Maokla, Mwajuma Chemba, Yuna Hamisi, Marc Mitchell, and Gaetano Borriello. 2008. e-IMCI: Improving pediatric health care in low-income countries. In SIGCHI conference on human factors in computing systems. ACM, 753--762.",
      "doi": "10.1145/1357054.1357174"
    },
    {
      "text": "Brian DeRenzi, Clayton Sims, Jonatham Jackson, Gaetano Borriello, and Neal Lesh. 2011. A framework for case-based community health information systems. In Global Humanitarian Technology Conference (GHTC), 2011 IEEE. IEEE, 377--382.  ",
      "doi": "10.1109/GHTC.2011.59"
    },
    {
      "text": "Brian DeRenzi, Jeremy Wacksman, Nicola Dell, Neal Lesh, Gaetano Borriello, and Scott Lee. 2016. Closing the Feedback Loop: A 12-month Evaluation of ASTA, a Self-Tracking Application for ASHAs. In International Conference on Information and Communication Technologies and Development (ICTD '16).  ",
      "doi": "10.1145/2909609.2909652"
    },
    {
      "text": "Leah Findlater, Ravin Balakrishnan, and Kentaro Toyama. 2009. Comparing Semiliterate and Illiterate Users' Ability to Transition from Audio+Text to Text-only Interaction. In SIGCHI Conference on Human Factors in Computing Systems (CHI '09). 1751--1760.  ",
      "doi": "10.1145/1518701.1518971"
    },
    {
      "text": "Jose F Florez-Arango, M Sriram Iyengar, Kim Dunn, and Jiajie Zhang. 2011. Performance factors of mobile rich media job aids for community health workers. Journal of the American Medical Informatics Association 18, 2 (2011), 131--137.",
      "doi": ""
    },
    {
      "text": "Carl Hartung, Yaw Anokwa, Waylon Brunette, Adam Lerer, Clint Tseng, and Gaetano Borriello. 2010. Open Data Kit: Building Information Services for Developing Regions. In International Conference on Information and Communication Technologies and Development (ICTD). 10.  ",
      "doi": "10.1145/2369220.2369236"
    },
    {
      "text": "Guido Hertel, Udo Konradt, and Borris Orlikowski. 2004. Managing distance by interdependence: Goal setting, task interdependence, and team-based rewards in virtual teams. European Journal of work and organizational psychology 13, 1 (2004), 1--28. ",
      "doi": ""
    },
    {
      "text": "M Sriram Iyengar, Jose F Florez-Arango, and Carlos A Garcia. 2009. GuideView: a system for developing structured, multimodal, multi-platform persuasive applications. In International Conference on Persuasive Technology. ACM, 31.",
      "doi": "10.1145/1541948.1541990"
    },
    {
      "text": "Timothy A Judge and Remus Ilies. 2002. Relationship of personality to performance motivation: a meta-analytic review. Journal of applied psychology 87, 4 (2002), 797.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 427--436.  ",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, and Richard Anderson. 2015. Projecting Health: Community-led Video Education for Maternal Health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (ICTD '15). ACM, NY, NY, USA, Article 17, 10 pages.  ",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Walley J. Katabira E. Muchuro S. Balidawa H. Namagala E. Ikoona E. Kunutsor, S. 2010. Using mobile phones to improve clinic attendance amongst an antiretroviral treatment cohort in rural Uganda: a crosssectional and prospective study. AIDS and behavior 14, 6 (2010), 1347--1352. ",
      "doi": ""
    },
    {
      "text": "Indrani Medhi, Somani Patnaik, Emma Brunskill, S.N. Nagasena Gautama, William Thies, and Kentaro Toyama. 2011. Designing Mobile Interfaces for Novice and Low-literacy Users. ACM Trans. Comput.-Hum. Interact. 18, 1 (May 2011).  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Indrani Medhi, Aman Sagar, and Kentaro Toyama. 2006. Text-free user interfaces for illiterate and semi-literate users. In Information and Communication Technologies and Development, 2006. ICTD'06. International Conference on. IEEE, 72--82. ",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo and Gary Marsden. 2013. Software Support for Creating Digital Health Training Materials in the Field. In International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (ICTD '13). 205--214.  ",
      "doi": "10.1145/2516604.2516632"
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S. Parikh. 2010. Avaaj Otalo: A Field Study of an Interactive Voice Forum for Small Farmers in Rural India. In SIGCHI Conference on Human Factors in Computing Systems (CHI '10). 733--742.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010a. Mobile-izing Health Workers in Rural India. In SIGCHI Conference on Human Factors in Computing Systems (CHI '10). 1889--1898.  ",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Divya Ramachandran, Vivek Goswami, and John Canny. 2010b. Research and Reality: Using Mobile Messages to Promote Maternal Health in Rural India. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10). ACM, NY, NY, USA, 35:1--35:10.  ",
      "doi": "10.1145/2369220.2369253"
    },
    {
      "text": "Catholic Relief Services. 2016. www.crs.org. (2016).",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2010. Human-Computer Interaction and Global Development. Foundations and Trends in Human-Computer Interaction 4, 1 (2010), 1--79.  ",
      "doi": "10.1561/1100000021"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet Swara: A Community-Moderated Voice Forum in Rural India. In SIGCHI Conference on Human Factors in Computing Systems (CHI '15).  ",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Vatsalya. 2016. www.vatsalya.org. (2016).",
      "doi": ""
    }
  ]
}