{
  "doi": "10.1145/3025453.3026047",
  "title": "A Good Reason to Die: How Avatar Death and High Challenges Enable Positive Experiences",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5087-5097",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Appropriate challenges and challenge-skill balance are usually key to positive player experiences. However, some games such as the successful series Dark Souls are notorious for their excessive difficulty. Yet, there has been little empirical investigation of why players enjoy games they constantly struggle and fail with. We surveyed 95 participants right after the release of Dark Souls III about their experiences with the game, employing both open questions and different player experience measures. Players generally enjoyed challenging play sessions and mostly reported positive experiences, with achievement and learning moments strongly contributing to positive experiences. However, these factors themselves were enabled by negative events such as difficulties and avatar death. Our findings showcase that negative events bear a potential for forming positive and meaningful experiences, thus expanding previous knowledge about the role of challenge and failing in games. Moreover, the significance of hard-earned achievements extends present design conventions.",
  "authors": [
    {
      "name": "Serge Petralito",
      "institution": "University of Basel, Basel, Basel-Stadt, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160670",
      "orcid": "missing"
    },
    {
      "name": "Florian Brühlmann",
      "institution": "University of Basel, Basel, Switzerland",
      "img": "/do/10.1145/contrib-81557646656/rel-imgonly/photofunia-1603985913.jpg",
      "acmid": "81557646656",
      "orcid": "missing"
    },
    {
      "name": "Glena Iten",
      "institution": "University of Basel, Basel, Basel-Stadt, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958697257",
      "orcid": "missing"
    },
    {
      "name": "Elisa D. Mekler",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549460056",
      "orcid": "0000-0003-0076-6703"
    },
    {
      "name": "Klaus Opwis",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048343",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Justin T. Alexander, John Sear, and Andreas Oikonomou. 2013. An investigation of the effects of game difficulty on player enjoyment. Entertainment Computing 4, 1 (2013), 53--62. http://www.sciencedirect.com/science/article/ pii/S1875952112000134",
      "doi": ""
    },
    {
      "text": "Fraser Allison, Marcus Carter, and Martin Gibbs. 2015. Good Frustrations: The Paradoxical Pleasure of Fearing Death in DayZ. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. ACM, 119--123. http://dl.acm.org/citation.cfm?id=2838810  ",
      "doi": "10.1145/2838739.2838810"
    },
    {
      "text": "Maria-Virginia Aponte, Guillaume Levieux, and Stéphane Natkin. 2011. Difficulty in videogames: an experimental validation of a formal definition. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology. ACM, 49. http://dl.acm.org/citation.cfm?id=2071484  ",
      "doi": "10.1145/2071423.2071484"
    },
    {
      "text": "Scott Bateman, Regan L. Mandryk, Tadeusz Stach, and Carl Gutwin. 2011. Target assistance for subtly balancing competitive play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2355--2364. http://dl.acm.org/citation.cfm?id=1979287  ",
      "doi": "10.1145/1978942.1979287"
    },
    {
      "text": "Julia Ayumi Bopp, Elisa D. Mekler, and Klaus Opwis. 2016. Negative Emotion, Positive Experience? Emotionally Moving Moments in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2996--3006. http://dl.acm.org/citation.cfm?id=2858227  ",
      "doi": "10.1145/2858036.2858227"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Marcus Carter, Martin Gibbs, and Greg Wadley. 2013. Death and dying in DayZ. In Proceedings of The 9th Australasian Conference on Interactive Entertainment: Matters of Life and Death. ACM, 22. http://dl.acm.org/citation.cfm?id=2513013  ",
      "doi": "10.1145/2513002.2513013"
    },
    {
      "text": "Jared E. Cechanowicz, Carl Gutwin, Scott Bateman, Regan Mandryk, and Ian Stavness. 2014. Improving player balancing in racing games. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play. ACM, 47--56. http://dl.acm.org/citation.cfm?id=2658701  ",
      "doi": "10.1145/2658537.2658701"
    },
    {
      "text": "Jenova Chen. 2007. Flow in games (and everything else). Commun. ACM 50, 4 (2007), 31--34. http://dl.acm.org/citation.cfm?id=1232769  ",
      "doi": "10.1145/1232743.1232769"
    },
    {
      "text": "Amra Copcic, Sophie McKenzie, and Michael Hobbs. 2013. Permadeath: A review of literature. In 2013 IEEE International Games Innovation Conference (IGIC). IEEE, 40--47. http://ieeexplore.ieee.org/xpls/abs_all. jsp?arnumber=6659156",
      "doi": ""
    },
    {
      "text": "M. Csikszentmihalyi. 1990. Flow. The Psychology of Optimal Experience. New York: Harper Perennial.",
      "doi": ""
    },
    {
      "text": "Emily Flynn-Jones. 2015. Don't Forget to Die: A Software Update is Available for the Death Drive. In The Dark Side of Game Play: Controversial Issues in Playful Environments, T. Mortensen, J. Linderoth, and A. Brown (Eds.). London: Routledge, 50--66.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Christianne Rooke, Andy Cockburn, Regan L. Mandryk, and Benjamin Lafreniere. 2016. Peak-End Effects on Player Experience in Casual Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5608--5619. http://dl.acm.org/citation.cfm?id=2858419  ",
      "doi": "10.1145/2858036.2858419"
    },
    {
      "text": "Robin Hunicke. 2005. The case for dynamic difficulty adjustment in games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology. ACM, 429--433. http://dl.acm.org/citation.cfm?id=1178573  ",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "Ioanna Iacovides, Anna L. Cox, Patrick McAndrew, James Aczel, and Eileen Scanlon. 2015. Game-play breakdowns and breakthroughs: exploring the relationship between action, understanding, and involvement. Human-computer interaction 30, 3--4 (2015), 202--231.  ",
      "doi": "10.1080/07370024.2014.987347"
    },
    {
      "text": "Wijnand IJsselsteijn, Wouter Van Den Hoogen, Christoph Klimmt, Yvonne De Kort, Craig Lindley, Klaus Mathiak, Karolien Poels, Niklas Ravaja, Marko Turpeinen, and Peter Vorderer. 2008. Measuring the experience of digital game enjoyment. In Proceedings of Measuring Behavior. Noldus Information Technology Wageningen, Netherlands, 88--89.",
      "doi": ""
    },
    {
      "text": "Seung-A. Annie Jin. 2012. Toward integrative models of flow: Effects of performance, skill, challenge, playfulness, and presence on flow in video games. Journal of Broadcasting & Electronic Media 56, 2 (2012), 169--186.",
      "doi": ""
    },
    {
      "text": "Jesper Juul. 1999. A clash between game and narrative. Master's thesis. University of Copenhagen. http://www.jesperjuul.net/thesis/ AClashBetweenGameAndNarrative.pdf",
      "doi": ""
    },
    {
      "text": "Jesper Juul. 2009. Fear of failing? The many meanings of difficulty in video games. In The Video Game Theory Reader, Mark J. P. Wolf and Bernard Perron (Eds.), Vol. 2. New York: Routledge, 237--252.",
      "doi": ""
    },
    {
      "text": "Jesper Juul. 2010. A casual revolution: Reinventing video games and their players. Cambridge, Mass: MIT Press. ",
      "doi": "10.5555/1667100"
    },
    {
      "text": "Jesper Juul. 2011. Half-real: Video games between real rules and fictional worlds. Cambridge, Mass: MIT Press. ",
      "doi": "10.5555/1076823"
    },
    {
      "text": "Jesper Juul. 2013. The art of failure: An essay on the pain of playing video games. Cambridge, Mass: MIT Press. ",
      "doi": "10.5555/2470023"
    },
    {
      "text": "Madison Klarkowski, Daniel Johnson, Peta Wyeth, Mitchell McEwan, Cody Phillips, and Simon Smith. 2016. Operationalising and Evaluating Sub-Optimal and Optimal Play Experiences through Challenge-Skill Manipulation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5583--5594. http://dl.acm.org/citation.cfm?id=2858563  ",
      "doi": "10.1145/2858036.2858563"
    },
    {
      "text": "Lisbeth Klastrup. 2007. Telling & sharing? Understanding mobile stories & future of narratives. In 7th international digital arts and culture conference the future of digital media culture. Perth, Australia. http://www.leonardo.info/LEA/perthDAC/LKlastrup_ LEA160203.pdf",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Christopher Blake, Dorothée Hefner, Peter Vorderer, and Christian Roth. 2009. Player performance, satisfaction, and video game enjoyment. In International Conference on Entertainment Computing. Springer, 1--12. http://link.springer.com/chapter/10. 1007/978--3--642-04052--8_1  ",
      "doi": "10.1007/978-3-642-04052-8_1"
    },
    {
      "text": "Raph Koster. 2013. Theory of fun for game design. Sebastopol, CA: O'Reilly Media. ",
      "doi": "10.5555/2601678"
    },
    {
      "text": "Nicole Lazzaro. 2004. Why we play games: Four keys to more emotion without story. Presentation at the Game Developers Conference. http://www.xeodesign.com/ whyweplaygames/xeodesign_whyweplaygames.pdf. (2004). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver and Anne Bartsch. 2010. Appreciation as Audience Response: Exploring Entertainment Gratifications Beyond Hedonism. Human Communication Research 36, 1 (Jan. 2010), 53--81.",
      "doi": ""
    },
    {
      "text": "Wei Peng, Jih-Hsuan Lin, Karin A. Pfeiffer, and Brian Winn. 2012. Need satisfaction supportive game features as motivational determinants: An experimental study of a self-determination theory guided exergame. Media Psychology 15, 2 (2012), 175--196.",
      "doi": ""
    },
    {
      "text": "Felipe Pepe. 2016. The history of the Quest Compass & its dreadful convenience. http://www.gamasutra.com/ blogs/FelipePepe/20160412/270100/The_history_of_the_ Quest_Compass__its_dreadful_convenience.php. (April 2016). Accessed: 2016-09--21.",
      "doi": ""
    },
    {
      "text": "Helmut Prendinger, Kamthorn Puntumapon, and Marconi Madruga. 2016. Extending Real-Time Challenge Balancing to Multiplayer Games: A Study on Eco-Driving. IEEE Transactions on Computational Intelligence and AI in Games 8, 1 (2016), 27--32. http:// ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=6932459",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, C. Scott Rigby, and Richard M. Ryan. 2010. A motivational model of video game engagement. Review of general psychology 14, 2 (2010), 154. http://psycnet.apa.org/journals/gpr/14/2/154/",
      "doi": ""
    },
    {
      "text": "Ute Ritterfeld, Michael Cody, and Peter Vorderer. 2009. Serious games: Mechanisms and effects. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan, C. Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344--360. http: //link.springer.com/article/10.1007/s11031-006--9051--8",
      "doi": ""
    },
    {
      "text": "Mike Schmierbach, Mun-Young Chung, Mu Wu, and Keunyeong Kim. 2014. No One Likes to Lose. Journal of Media Psychology 26, 3 (2014), 105--110.",
      "doi": ""
    },
    {
      "text": "John L. Sherry. 2004. Flow and media enjoyment. Communication theory 14, 4 (2004), 328--347.",
      "doi": ""
    },
    {
      "text": "Jan D. Smeddinck, Regan L. Mandryk, Max V. Birk, Kathrin M. Gerling, Dietrich Barsilowski, and Rainer Malaka. 2016. How to Present Game Difficulty Choices? Exploring the Impact on Player Experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5595--5607.  ",
      "doi": "10.1145/2858036.2858574"
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3, 3 (2005), 3--3. http://dl.acm.org/citation.cfm?id=1077253  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Chin Hiong Tan, Kay Chen Tan, and Arthur Tay. 2011. Dynamic game difficulty scaling using adaptive behavior-based AI. IEEE Transactions on Computational Intelligence and AI in Games 3, 4 (2011), 289--301. http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=",
      "doi": ""
    },
    {
      "text": "Edmund R. Thompson. 2007. Development and validation of an internationally reliable short-form of the positive and negative affect schedule (PANAS). Journal of cross-cultural psychology 38, 2 (2007), 227--242. http://jcc.sagepub.com/content/38/2/227.short",
      "doi": ""
    },
    {
      "text": "Rodrigo Vicencio-Moreira, Regan L. Mandryk, and Carl Gutwin. 2015. Now you can compete with anyone: Balancing players of different skill levels in a first-person shooter game. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2255--2264. http://dl.acm.org/citation.cfm?id=2702242  ",
      "doi": "10.1145/2702123.2702242"
    },
    {
      "text": "Peter Vorderer, Christoph Klimmt, and Ute Ritterfeld. 2004. Enjoyment: At the heart of media entertainment. Communication theory 14, 4 (2004), 388--408.",
      "doi": ""
    },
    {
      "text": "Douglas Wilson and Miguel Sicart. 2010. Now it's personal: on abusive game design. In Proceedings of the International Academic Conference on the Future of Game Design and Technology. ACM, 40--47. http://dl.acm.org/citation.cfm?id=1920785  ",
      "doi": "10.1145/1920778.1920785"
    },
    {
      "text": "Chang Yun, Philip Trevino, William Holtkamp, and Zhigang Deng. 2010. PADS: enhancing gaming experience using profile-based adaptive difficulty system. In Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games. ACM, 31--36. http://dl.acm.org/citation.cfm?id=1836140  ",
      "doi": "10.1145/1836135.1836140"
    }
  ]
}