{
  "doi": "10.1145/3025453.3025505",
  "title": "MuEns: A Multimodal Human-Machine Music Ensemble for Live Concert Performance",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4290-4301",
  "year": 2017,
  "badges": [],
  "abstract": "Musical ensemble between human musicians and computers is a challenging task. We achieve this with a concert-quality synchronization using machine learning. Our system recognizes the position in a given song from the human performance using the microphone and camera inputs, and responds in real-time with audio and visual feedback as a music ensemble. We address three crucial requirements in a musical ensemble system. First, our system interacts with human players through both audio and visual cues, the conventional modes of coordination for musicians. Second, our system synchronizes with human performances while retaining its intended musical expression. Third, our system prevents failures during a concert due to bad tracking, by displaying an internal confidence measure and allowing a backstage human operator to \"intervene\" if the system is unconfident. We show the feasibility of the system with several experiments, including a professional concert.",
  "authors": [
    {
      "name": "Akira Maezawa",
      "institution": "Yamaha Corporation, Iwata, Shizuoka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453662557",
      "orcid": "missing"
    },
    {
      "name": "Kazuhiko Yamamoto",
      "institution": "Yamaha Corporation & The University of Tokyo, Iwata, Shizuoka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659058661",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Takashi Baba, Mitsuyo Hashida, and Haruhiro Katayose. 2010. \"VirtualPhilharmony:\" A Conducting System with Heuristics of Conducting an Orchestra. In Proc. New Interfaces for Music Expression, Vol. 2010. 263--270.",
      "doi": ""
    },
    {
      "text": "Julio José Carabias-Orti, Francisco J. Rodríguez-Serrano, Pedro Vera-Candeas, Nicolás Ruiz-Reyes, and Francisco J. Cañadas-Quesada. 2015. An Audio to Score Alignment Framework Using Spectral Factorization and Dynamic Time Warping. In Proc. International Conference on Music Information Retrieval. 742--748.",
      "doi": ""
    },
    {
      "text": "Ali T. Cemgil. 2009. Bayesian Inference for Nonnegative Matrix Factorisation Models. Computational Intelligence and Neuroscience 2009 (2009).  ",
      "doi": "10.1155/2009/785152"
    },
    {
      "text": "Marcelo Cicconet, Mason Bretan, and Gil Weinberg. 2012. Visual Cues-based Anticipation for Percussionist-Robot Interaction. In Proc. of the International Conference on Human-Robot Interaction. 117--118.  ",
      "doi": "10.1145/2157689.2157713"
    },
    {
      "text": "Arshia Cont. 2008. ANTESCOFO: Anticipatory Synchronization and Control of Interactive Parameters in Computer Music. In Proc. International Computer Music Conference. 33--40.",
      "doi": ""
    },
    {
      "text": "Arshia Cont. 2010. A Coupled Duration-Focused Architecture for Real-Time Music-to-Score Alignment. IEEE Transactions on Pattern Analysis and Machine Intelligence 32, 6 (2010), 974--987.  ",
      "doi": "10.1109/TPAMI.2009.106"
    },
    {
      "text": "Arshia Cont, Diemo Schwarz, Norbert Schnell, and Christopher Raphael. 2007. Evaluation of Real-Time Audio-to-Score Alignment. In Proc. International Conference on Music Information Retrieval. Vienna, Austria, 315--316.",
      "doi": ""
    },
    {
      "text": "Roger B Dannenberg. 1984. An On-line Algorithm for Real-time Accompaniment. In Proc. International Computer Music Conference. 193--198.",
      "doi": ""
    },
    {
      "text": "Roger B. Dannenberg. 2011. A Virtual Orchestra for Human-Computer Music Performance. In Proc. International Computer Music Conference. 185--188.",
      "doi": ""
    },
    {
      "text": "Roger B. Dannenberg and Christopher Raphael. 2006. Music Score Alignment and Computer Accompaniment. Commun. ACM 49, 8 (2006), 38--43.  ",
      "doi": "10.1145/1145287.1145311"
    },
    {
      "text": "Sebastian Ewert and Meinard Müller. 2012. Using Score-Informed Constraints for NMF-based Source Separation. In Proc. International Conference on Acoustics, Speech and Signal Processing. 129--132. ",
      "doi": ""
    },
    {
      "text": "Dorottya Fabian, Renee Timmers, and Emery Schubert (Eds.). 2014. Expressiveness in Music Performance. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Nicolas E. Gold, Octav-Emilian Sandu, Praneeth N. Palliyaguru, Roger B. Dannenberg, Zeyu Jin, Andrew Robertson, Adam Stark, and Rebecca Kleinberger. 2013. Human-Computer Music Performance: From Synchronized Accompaniment to Musical Partner. In Proc. Sound and Music Computing Conference. 277--283.",
      "doi": ""
    },
    {
      "text": "Lorin Grubb and Roger B. Dannenberg. 1997. A Stochastic Method of Tracking a Vocal Performer. In Proc. International Computer Music Conference. 301--308.",
      "doi": ""
    },
    {
      "text": "Ning Hu, Roger B. Dannenberg, and George Tzanetakis. 2003. Polyphonic Audio Matching and Alignment for Music Retrieval. In Proc. Workshop on Applications of Signal Processing to Audio and Acoustics. 185--188.",
      "doi": ""
    },
    {
      "text": "Tatsuhiko Itohara, Kazuhiro Nakadai, Tetsuya Ogata, and Hiroshi G. Okuno. 2012. Improvement of Audio-Visual Score Following in Robot Ensemble with Human Guitarist. In Proc. International Conference on Humanoid Robots. 574--579. ",
      "doi": ""
    },
    {
      "text": "Takayuki Iwasaki. 2016. AI Piano to Ningen ga Gassou - Kyoshou no Ensou, Saigen he Daiippo [AI Piano and Humans Plays in an Ensemble - One Step Forward for Recuperating Past Legend's Performance]. The Nikkei [In Japanese] (23 May 2016).",
      "doi": ""
    },
    {
      "text": "Cyril Joder, Slim Essid, and Gaël Richard. 2010. A Conditional Random Field Viewpoint of Symbolic Audio-to-Score Matching. In Proc. ACM Multimedia. 871--874.  ",
      "doi": "10.1145/1873951.1874100"
    },
    {
      "text": "Rudolph E. Kalman. 1960. A New Approach to Linear Filtering and Prediction Problems. Journal of Basic Engineering 82, 1 (1960), 35--45. ",
      "doi": ""
    },
    {
      "text": "Peter E. Keller. 2001. Attentional Resource Allocation in Musical Ensemble Performance. Psychology of Music 29, 1 (2001), 20--38. ",
      "doi": ""
    },
    {
      "text": "Angelica Lim, Takeshi Mizumoto, Louis-Kenzo Cahier, Takuma Otsuka, Toru Takahashi, Kazunori Komatani, Tetsuya Ogata, and Hiroshi G. Okuno. 2010. Robot Musical Accompaniment: Integrating Audio and Visual Cues for Real-time Synchronization with a Human Flutist. In Proc. Intelligent Robots and Systems. 1964--1969.",
      "doi": ""
    },
    {
      "text": "Akira Maezawa, Katsutoshi Itoyama, Kazuyoshi Yoshii, and Hiroshi G. Okuno. 2015. Unified Inter- and Intra-Recording Duration Model for Multiple Music Audio Alignment. In Proc. Workshop on Applications of Signal Processing to Audio and Acoustics. 1--5. ",
      "doi": ""
    },
    {
      "text": "Nicola Montecchio and Arshia Cont. 2011. Accelerating the Mixing Phase in Studio Recording Productions By Automatic Audio Alignment. In Proc. International Conference on Music Information Retrieval. 627--632.",
      "doi": ""
    },
    {
      "text": "Takuma Otsuka, Kazuhiro Nakadai, Tetsuya Ogata, and Hiroshi G. Okuno. 2011. Incremental Bayesian Audio-to-Score Alignment with Flexible Harmonic Structure Models. In Proc. International Conference on Music Information Retrieval. 525--530.",
      "doi": ""
    },
    {
      "text": "François Pachet. 2002. The Continuator: Musical Interaction with Style. In Proc. International Computer Music Conference. 211--218.",
      "doi": ""
    },
    {
      "text": "Miller Puckette and Cort Lippe. 1992. Score Following in Practice. In Proc. International Computer Music Conference. 182--182.",
      "doi": ""
    },
    {
      "text": "Christopher Raphael. 2001. A Bayesian Network for Real-Time Musical Accompaniment. In Proc. Advances in Neural Information Processing Systems. 1433--1439.",
      "doi": ""
    },
    {
      "text": "Christopher Raphael. 2004. A Hybrid Graphical Model for Aligning Polyphonic Audio with Musical Scores. In Proc. International Conference on Music Information Retrieval. 387--394.",
      "doi": ""
    },
    {
      "text": "Christopher Raphael. 2010. Music Plus One and Machine Learning. In Proc. International Conference on Machine Learning. 21--28.",
      "doi": ""
    },
    {
      "text": "Bruno H. Repp. 2005. Sensorimotor Synchronization: a Review of the Tapping Literature. Psychonomic Bulletin & Review 12, 6 (2005), 969--992. ",
      "doi": ""
    },
    {
      "text": "Bogdan Vera, Elaine Chew, and Patrick G. T. Healey. 2013. A Study of Ensemble Synchronisation Under Restricted Line of Sight. In Proc. International Conference on Music Information Retrieval. 293--298.",
      "doi": ""
    },
    {
      "text": "Guangyu Xia and Roger B. Dannenberg. 2015. Duet Interaction: Learning Musicianship for Automatic Accompaniment. In Proc. New Interfaces for Music Expression. 259--264.",
      "doi": ""
    },
    {
      "text": "Guangyu Xia, Yun Wang, Roger B. Dannenberg, and Geoffrey Gordon. 2015. Spectral Learning for Expressive Interactive Ensemble Music Performance. In Proc. International Conference on Music Information Retrieval. 816--822.",
      "doi": ""
    },
    {
      "text": "Xiao Xiao and Hiroshi Ishii. 2011. Duet for solo piano: MirrorFugue for Single User Playing with Recorded Performances. In CHI Extended Abstracts. 1285--1290.  ",
      "doi": "10.1145/1979742.1979762"
    },
    {
      "text": "Ryuichi Yamamoto, Shinji Sako, and Tadashi Kitamura. 2013. Robust On-line Algorithm for Real-time Audio-to-Score Alignment based on a Delayed Decision and Anticipation Framework. In Proc. International Conference on Acoustics, Speech and Signal Processing. 191--195. ",
      "doi": ""
    }
  ]
}