{
  "doi": "10.1145/3025453.3025872",
  "title": "Interactive Vectorization",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6695-6705",
  "year": 2017,
  "badges": [],
  "abstract": "Vectorization turns photographs into vector art. Manual vectorization, where the artist traces over the image by hand, requires skill and time. On the other hand, automatic approaches allow users to generate a result by setting a few global parameters. However, global settings often leave too much detail/complexity in some parts of the image while missing important details in others. We propose interactive vectorization tools that offer more local control than automatic systems, but are more powerful and high-level than simple curve editing. Our system enables novices to vectorize images significantly faster than even experts with state-of-the-art tools.",
  "authors": [
    {
      "name": "Jun Xie",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658641674",
      "orcid": "missing"
    },
    {
      "name": "Holger Winnemöller",
      "institution": "Adobe Systems Inc., Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314495028",
      "orcid": "missing"
    },
    {
      "name": "Wilmot Li",
      "institution": "Adobe Systems Inc., San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100480929",
      "orcid": "missing"
    },
    {
      "name": "Stephen Schiller",
      "institution": "Adobe Systems, Inc., Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99658669329/rel-imgonly/stephen-schiller.jpg",
      "acmid": "99658669329",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Pablo Arbelaez, Michael Maire, Charless Fowlkes, and Jitendra Malik. 2011. Contour Detection and Hierarchical Image Segmentation. IEEE Trans. Pattern Anal. Mach. Intell. 33, 5 (May 2011), 898--916.  ",
      "doi": "10.1109/TPAMI.2010.161"
    },
    {
      "text": "P. Baudelaire and M. Gangnet. 1989. Planar Maps: An Interaction Paradigm for Graphic Design. In Proceedings of SIGCHI 1989. ACM, 313--318.  ",
      "doi": "10.1145/67449.67511"
    },
    {
      "text": "Yuri Boykov, Olga Veksler, and Ramin Zabih. 2001. Fast Approximate Energy Minimization via Graph Cuts. IEEE Trans. Pattern Anal. Mach. Intell. 23, 11 (Nov. 2001), 1222--1239.  ",
      "doi": "10.1109/34.969114"
    },
    {
      "text": "Piotr Dollár and C. Lawrence Zitnick. 2013. Structured Forests for Fast Edge Detection. In ICCV. International Conference on Computer Vision.  ",
      "doi": "10.1109/ICCV.2013.231"
    },
    {
      "text": "Jean-Dominique Favreau, Florent Lafarge, and Adrien Bousseau. 2016. Fidelity vs. Simplicity: A Global Approach to Line Drawing Vectorization. ACM Trans. Graph. 35, 4, Article 120 (July 2016), 10 pages.  ",
      "doi": "10.1145/2897824.2925946"
    },
    {
      "text": "Pedro F. Felzenszwalb and Daniel P. Huttenlocher. 2004. Distance Transforms of Sampled Functions. Technical Report. Cornell Computing and Information Science.",
      "doi": ""
    },
    {
      "text": "Peter Ilbery, Luke Kendall, Cyril Concolato, and Michael McCosker. 2013. Biharmonic Diffusion Curve Images from Boundary Elements. ACM Trans. Graph. 32, 6, Article 219 (Nov. 2013), 12 pages.  ",
      "doi": "10.1145/2508363.2508426"
    },
    {
      "text": "Michael Kass, Andrew Witkin, and Demetri Terzopoulos. 1988. Snakes: Active Contour Models. International Journal of Computer Vision 1, 4 (1988), 321--331.",
      "doi": ""
    },
    {
      "text": "Yu-Kun Lai, Shi-Min Hu, and Ralph R. Martin. 2009. Automatic and Topology-preserving Gradient Mesh Generation for Image Vectorization. ACM Trans. Graph. 28, 3, Article 85 (July 2009), 8 pages.  ",
      "doi": "10.1145/1531326.1531391"
    },
    {
      "text": "Alex Limpaecher, Nicolas Feltman, Adrien Treuille, and Michael Cohen. 2013. Real-time Drawing Assistance Through Crowdsourcing. ACM Trans. Graph. 32, 4, Article 54 (July 2013), 8 pages.  ",
      "doi": "10.1145/2461912.2462016"
    },
    {
      "text": "Eric N Mortensen and William A Barrett. 1995. Intelligent Scissors for Image Composition. In Proceedings of the 22nd annual conference on Computer Graphics and Interactive Techniques. ACM, 191--198.  ",
      "doi": "10.1145/218380.218442"
    },
    {
      "text": "Gioacchino Noris, Alexander Hornung, Robert W. Sumner, Maryann Simmons, and Markus Gross. 2013. Topology-driven Vectorization of Clean Line Drawings. ACM Trans. Graph. 32, 1, Article 4 (Feb. 2013), 11 pages.  ",
      "doi": "10.1145/2421636.2421640"
    },
    {
      "text": "Alexandrina Orzan, Adrien Bousseau, Holger Winnemöller, Pascal Barla, Joëlle Thollot, and David Salesin. 2008. Diffusion Curves: A Vector Representation for Smooth-shaded Images. ACM Trans. Graph. 27, 3, Article 92 (Aug. 2008), 8 pages.  ",
      "doi": "10.1145/1360612.1360691"
    },
    {
      "text": "C. Richardt, J. Lopez-Moreno, A. Bousseau, M. Agrawala, and G. Drettakis. 2014. Vectorising Bitmaps into Semi-transparent Gradient Layers. In Proceedings of the 25th Eurographics Symposium on Rendering (EGSR '14). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 11--19.  ",
      "doi": "10.1111/cgf.12408"
    },
    {
      "text": "Carsten Rother, Vladimir Kolmogorov, and Andrew Blake. 2004. \"GrabCut\": Interactive Foreground Extraction Using Iterated Graph Cuts. ACM Trans. Graph. 23, 3 (Aug. 2004), 309--314.  ",
      "doi": "10.1145/1015706.1015720"
    },
    {
      "text": "Peter Selinger. 2001--2015. http://potrace.sourceforge.net/. (2001--2015).",
      "doi": ""
    },
    {
      "text": "Qingkun Su, Wing Ho Andy Li, Jue Wang, and Hongbo Fu. 2014. EZ-sketching: Three-level Optimization for Error-tolerant Image Tracing. ACM Trans. Graph. 33, 4, Article 54 (July 2014), 9 pages.  ",
      "doi": "10.1145/2601097.2601202"
    },
    {
      "text": "Jian Sun, Lin Liang, Fang Wen, and Heung-Yeung Shum. 2007. Image Vectorization Using Optimized Gradient Meshes. ACM Trans. Graph. 26, 3, Article 11 (July 2007).  ",
      "doi": "10.1145/1276377.1276391"
    },
    {
      "text": "Tian Xia, Binbin Liao, and Yizhou Yu. 2009. Patch-based Image Vectorization with Automatic Curvilinear Feature Alignment. ACM Trans. Graph. 28, 5, Article 115 (Dec. 2009), 10 pages.  ",
      "doi": "10.1145/1618452.1618461"
    },
    {
      "text": "Guofu Xie, Xin Sun, Xin Tong, and Derek Nowrouzezahrai. 2014b. Hierarchical Diffusion Curves for Accurate Automatic Image Vectorization. ACM Trans. Graph. 33, 6, Article 230 (Nov. 2014), 11 pages.  ",
      "doi": "10.1145/2661229.2661275"
    },
    {
      "text": "Jun Xie, Aaron Hertzmann, Wilmot Li, and Holger Winnemöller. 2014a. PortraitSketch: Face Sketching Assistance for Novices. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 407--417.  ",
      "doi": "10.1145/2642918.2647399"
    }
  ]
}