{
  "doi": "10.1145/3025453.3025756",
  "title": "Sensitizing Concepts for Socio-spatial Literacy in HCI",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6449-6460",
  "year": 2017,
  "badges": [],
  "abstract": "People inherently share spaces with other people. Congenitally, interactive technologies and ubiquitous environments shape our opportunities for enacting social relations. Proxemics and Spatial Sharing have been suggested as foundations for our understanding of the socio-spatial aspects of computing. By tandeming these theoretical perspectives in a set of cases in the office domain, we develop a contribution comprised of 3 key sensitizing concepts: Proxemic Malleability, Proxemic Threshold and Proxemic Gravity articulating socio-spatial qualities at the interplay between interactive systems, spaces, interior elements and co-located people. The sensitizing concepts qualify interaction designers in considering proxemic consequences of technology design; they serve both as analytic lenses and as generative instruments in a design process. The proposed sensitizing concepts and the theoretical work of the paper contribute to enhanced Socio-spatial literacy in HCI.",
  "tags": [
    "space",
    "literacy",
    "interaction design",
    "spatiality",
    "proxemics",
    "ubiquitous computing",
    "socio-spatial",
    "architecture."
  ],
  "authors": [
    {
      "name": "Peter Gall Krogh",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100021191",
      "orcid": "missing"
    },
    {
      "name": "Marianne Graves Petersen",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100348029",
      "orcid": "missing"
    },
    {
      "name": "Kenton O'Hara",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Jens Emil Groenbaek",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-99659020791/rel-imgonly/jens_emil_72dpi_sh.png",
      "acmid": "99659020791",
      "orcid": "0000-0002-9566-7195"
    }
  ],
  "references": [
    {
      "text": "Anderson, R.E. (1992) Social impacts of computing: Codes of professional ethics. Soc Sci Comput Rev 10, 2: 453--469.",
      "doi": ""
    },
    {
      "text": "Awan N., Schneider T., Till J. (2011): Spatial Agency: Other Ways of Doing Architecture, Routledge, ISBN: 9780415571920",
      "doi": ""
    },
    {
      "text": "Bjerrum E:(2010): Enabling Organisational Learning and Knowledge Sharing through Employee Involvement. Tech. rep., June 2010.",
      "doi": ""
    },
    {
      "text": "Buxton, W., Sellen, A., and Sheasby, M. 1997. Interfaces for Multiparty Videoconferencing. In Finn, K., Sellen, A., Wilber, S. (Eds.). Video Mediated Communication, Hillsdale, N.J., Erlbaum, 385--400.",
      "doi": ""
    },
    {
      "text": "Buxton, W. (2009) Mediaspace - Meaningspace Meetingspace. In Harrison, S. (Ed) Media Space: 20+ Years of Mediated Life, Springer, London, pp. 217--231.",
      "doi": ""
    },
    {
      "text": "Cavender, A., Trewin, S. and Hanson, V. 2(014) Accessible Writing Guide. Retrieved August 22, 2014 from http://www.sigaccess.org/welcome-tosigaccess/resources/accessible-writing-guide/",
      "doi": ""
    },
    {
      "text": "Chattopadhyay, D., O'Hara, K., Rintel, S. and Rädle, R. (2016) Office Social: Presentation Interactivity for Nearby Devices. In Proceedings of CHI '16, San Jose, CA.  ",
      "doi": "10.1145/2858036.2858337"
    },
    {
      "text": "De Souza e Silva, A. and Frith, J. (2012) Mobile Interface Theory: Locational Privacy, Control, and Urban Sociability London: Routledge.",
      "doi": ""
    },
    {
      "text": "Dingler, T., Funk, M. and Alt, F. (2015) Interaction Proxemics: Combining Physical Spaces for Seamless Gesture Interaction. In Proceedings of the 4th International Symposium on Pervasive Displays (PerDis '15). ACM, New York, NY, USA, pp. 107--114.  ",
      "doi": "10.1145/2757710.2757722"
    },
    {
      "text": "Dourish, P. (2001) Where the Action Is: The Foundations of Embodied Interaction, MIT Press, Cambridge. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Dourish, P. (2006) Re-Space-ing Place: Place and Space Ten Years On. In Proceedings of ACM Conf. ComputerSupported Cooperative Work CSCW 2006, pp. 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Dunne, T. and Raby, F. (1995) Fields and Thresholds. In Architects in Cyberspace, Architectural Design, Neil Spiller (ed), No 118, pp. 61--66.",
      "doi": ""
    },
    {
      "text": "Fitzpatrick, G. (2003) The Locales Framework: Understanding and Designing for Wicked Problems, Kluwer Academic Publishers. ",
      "doi": "10.5555/862186"
    },
    {
      "text": "Fogtman, M. H., Krogh, P. G., Markussen, T. (2011) Spatial Sharing Designing Computational Artefacts as Architecture. In Proceedings of DPPI 2011, ACM, Milano.",
      "doi": ""
    },
    {
      "text": "Gane, N. and Beer, D. (2008) New Media: The Key Concepts. Oxford: Berg.",
      "doi": ""
    },
    {
      "text": "Goodwin, C. (2003) Pointing as Situated Practice. In Kita, S. (Ed) Pointing: Where Language, Culture and Cognition Meet. Mahwah, NJ: Lawrence Erlbaum Associates, pp. 217--241.",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Kuzuoka, H. (2000) Using Digital but Physical Surrogates to Mediate Awareness, Communication and Privacy in Media Spaces. In Personal Technologies, 4(1), pp. 182--198.",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Marquardt, N., Ballendat, T., DiazMarino, R. and Wang, M. (2011) Proxemic interactions: the new ubicomp?. In Interactions, 18(1), pp. 42--50.  ",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Grønbæk, J. E., Korsgaard, H., Petersen, M. G., Birk, M. H., Krogh, P. G. (2017) Proxemic Transitions: Designing Shape-Changing Furniture for Informal Meetings. In Proceedings of CHI '17, Denver, USA.  ",
      "doi": "10.1145/3025453.3025487"
    },
    {
      "text": "Hall, E. T. (1966) The Hidden Dimension, Doubleday, New York.",
      "doi": ""
    },
    {
      "text": "Harrison, S. and Dourish, P. (1996) Re-Place-ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of the ACM Conference on ComputerSupported Cooperative Work CSCW'96, ACM, pp. 6776.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Heath, C. and Luff, P. (1991) Disembodied conduct: Communication through video in a multi-media environment. In Proceedings of CHI '91, pp. 99--103.  ",
      "doi": "10.1145/108844.108859"
    },
    {
      "text": "Heath, C. and Luff, P. (1992) Media Space and Communicative Asymmetries: Preliminary Observations of Video-Mediated Interaction. Human-Computer Interaction, 7, pp. 315--346.  ",
      "doi": "10.1207/s15327051hci0703_3"
    },
    {
      "text": "Heath, C. and Luff, P. (2000) Technology in Action, Cambridge University Press, Cambridge. ",
      "doi": "10.5555/556346"
    },
    {
      "text": "Hornecker, E. and Buur, J. (2006) Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proceedings of CHI 2006, ACM, pp. 437--446.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Hornecker, E. (2005) A Design Theme for Tangible Interaction: Embodied Facilitation. In Proceedings of ECSCW '05, 9th European Conference on Computer Supported Cooperative Work, pp. 23--43. ",
      "doi": "10.5555/1242029.1242031"
    },
    {
      "text": "Kendon, A. (1990). Spatial Organization in Social Encounters: the F-formation System. A. Kendon, A. (Ed) Conducting Interaction: Patterns of Behavior in Focused Encounters, Cambridge University Press, pp. 209--237.",
      "doi": ""
    },
    {
      "text": "Kinch S. (2011), Articulating Atmospheres -- Through Middle Ground Experience in Interaction Design, Ambience 2011, pp. 214--221.",
      "doi": ""
    },
    {
      "text": "Krogh, P. G. and Petersen, M. G. (2008) Collective Interaction -- Let's join forces. Presented at COOP'08 the 8th International Conference on the Design of Cooperative Systems. Provence, France May 20--23. (An expanded version to be published in \"From CSCW to Web 2.0: European Developments in Collaborative Design\". Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Krogh, P.G., Ludvigsen, M., Lykke-Olesen, A. (2004) \"Help me pull that cursor\" - A Collaborative Interactive Floor Enhancing Community Interaction. In Proceedings of OZCHI 2004, 22--24 November, 2004 at the University of Wollongong, Australia. CD-ROM. ISBN:1 74128 079.",
      "doi": ""
    },
    {
      "text": "Manovich, L. (2001) The Language of New Media. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Marquardt, N. and Greenberg. S. (2012) Informing the Design of Proxemic Interactions. IEEE Pervasive Computing 11(2), pp. 14--23.  ",
      "doi": "10.1109/MPRV.2012.15"
    },
    {
      "text": "Marquardt, N. Hinckley, K. and Greenberg. S. (2012) Cross-device interaction via micro-mobility and fformations. In Proceedings of UIST '12, 25th annual ACM symposium on User interface software and technology, pp. 13--22.  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Marquardt, N., Ballendat, T. Boring, S., Greenberg, S. and Hinckley, K. (2012) Gradual engagement: facilitating information exchange between digital devices as a function of proximity. In Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (ITS '12). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/2396636.2396642"
    },
    {
      "text": "McCullough, M. (2004) Digital Ground. MIT Press, Cambridge, Massachusetts, USA.",
      "doi": "10.5555/983677"
    },
    {
      "text": "Mentis, H., O'Hara, K., Sellen, A. and Trivedi, R. (2012) Interaction Proxemics and Image use in Neurosurgery. In Proceedings of CHI 2012.  ",
      "doi": "10.1145/2207676.2208536"
    },
    {
      "text": "Mueller-Tomfelde, C. and O'Hara, K. (2010) Horizontal Surfaces in Media Space Assemblies. In MuellerTomfelde, C. (Ed) Tabletops - Horizontal Interactive Displays. Spinger Verlag.",
      "doi": ""
    },
    {
      "text": "O'Hara, K., Kjeldskov, J. and Paay, J. (2011) Blended Interaction Spaces. In ACM Transactions on ComputerHuman Interaction, 18(1).  ",
      "doi": "10.1145/1959022.1959025"
    },
    {
      "text": "Okada, K., Maeda, F., Ichikawaa, Y., and Matsushita, Y. 1994. Multiparty Videoconferencing at Virtual Social Distance: MAJIC Design. In Proceedings of CSCW '94, pp. 385--393.  ",
      "doi": "10.1145/192844.193054"
    },
    {
      "text": "Petersen M.G, Krogh P.G, Mortensen M.B., MøllerLassen T., Mortensen D. H. (2010): Collective interaction by design collective controllers for social navigation on digital photos. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 353--362  ",
      "doi": "10.1145/1868914.1868956"
    },
    {
      "text": "Rädle, R., Jetter, H-C., Marquardt, N., Reiterer, H. and Yvonne Rogers, Y. (2014) HuddleLamp: SpatiallyAware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14), pp. 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Rogers, Y., Lim, Y-K., Hazlewood, W., and Marshall, P. (2009) Equal Opportunities: Do Shareable Interfaces Promote More Group Participation Than Single User Displays' Human-Computer Interaction, 24(2), pp. 79116.",
      "doi": ""
    },
    {
      "text": "Russell, J.C. Firestone, I.R. and Baron, R.M. (1980) Seating Arrangement and Social Influence: Moderated by Reinforcement Meaning and Internal-External Control. In Social Psychology Quarterly, 43(1), pp103109.",
      "doi": ""
    },
    {
      "text": "Sellen, A. J., Buxton, W., and Arnott, J. 1992. Using spatial cues to improve videoconferencing. In Proceedings of CHI '92, pp. 651--652.  ",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "Sommer, R. (1969) Personal Space, Prentice-Hall, Englewood Cliffs, N.J.",
      "doi": ""
    },
    {
      "text": "Sommer, R. and Ross, H. (1958) Social Interaction on a Geriatric Ward. International Journal of Social Psychology, 4, pp. 123--133.",
      "doi": ""
    },
    {
      "text": "Sørensen, H. and Jesper Kjeldskov. J. (2013) Moving Beyond Weak Identifiers for Proxemic Interaction. In Proceedings of International Conference on Advances in Mobile Computing & Multimedia (MoMM '13). ACM, New York, NY, USA, pp. 18  ",
      "doi": "10.1145/2536853.2536910"
    },
    {
      "text": "Sorensen, H., O'Hara, K., Gosset, P. and Kjeldskov, J. (2015) Wireless SmartPhone Mirroring in Video Calls. In Proceedings of Interact 2015, Bamberg, Germany.",
      "doi": "10.1007/978-3-319-22698-9_28"
    },
    {
      "text": "Steen, Jesper (2009): Spacial and Social Configurations in Offices. In Proceedings of the 7th International Space Syntax Symposium, Stockholm, KTH.",
      "doi": ""
    },
    {
      "text": "Wang, M. Boring, S. and Greenberg. S. (2012) Proxemic peddler: a public advertising display that captures and preserves the attention of a passerby. In Proceedings of the 2012 International Symposium on Pervasive Displays (PerDis '12). ACM, New York, NY, USA, Article 3  ",
      "doi": "10.1145/2307798.2307801"
    },
    {
      "text": "Yamashita, N., Hirata, K., Aoyagi, S., Kuzuoka, H., and Yasunori Harada, Y. (2008) Impact of Seating Positions on Group Video Communication. In Proceedings of CSCW '08, pp. 177--186.  ",
      "doi": "10.1145/1460563.1460591"
    },
    {
      "text": "Zimmerman, J. Forlizzi J., Stolterman E. (2010): An Analysis and Critique of Research through Design: towards a formalization of a research approach. In Proceedings of the Conference on Designing Interactive Systems. ACM Press: 310--319.  ",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}