{
  "doi": "10.1145/3025453.3025634",
  "title": "Using Advisory 3D Sound Cues to Improve Drivers' Performance and Situation Awareness",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2814-2825",
  "year": 2017,
  "badges": [],
  "abstract": "Within vehicle Human Machine Interface design, visual displays are predominant, taking up more and more of the visual channel for each new system added to the car, e.g. navigation systems, blind spot information and forward collision warnings. Sounds however, are mainly used to alert or warn drivers together with visual information. In this study we investigated the design of auditory displays for advisory information, by designing a 3D auditory advisory traffic information system (3DAATIS) which was evaluated in a drive simulator study with 30 participants. Our findings indicate that overall, drivers' performance and situation awareness improved when using this system. But, more importantly, the results also point towards the advantages and limitations of the use of advisory 3D-sounds in cars, e.g. attention capture vs. limited auditory resolution. These findings are discussed and expressed as design implications.",
  "authors": [
    {
      "name": "MinJuan Wang",
      "institution": "Chalmers University of Technology, Goteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549369256",
      "orcid": "missing"
    },
    {
      "name": "Sus Lundgren Lyckvi",
      "institution": "Chalmers University of Technology & University of Gothenburg, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068440",
      "orcid": "missing"
    },
    {
      "name": "Chenhui Chen",
      "institution": "Chalmers University of Technology, Goteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160584",
      "orcid": "missing"
    },
    {
      "name": "Palle Dahlstedt",
      "institution": "Chalmers University of Technology & University of Gothenburg, Goteborg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461649284",
      "orcid": "missing"
    },
    {
      "name": "Fang Chen",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651159",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tan, A. K. and Lerner, Neil D. 1996. Acoustic localization of in-vehicle crash avoidance warnings as a cue to hazard direction. U.S. Dept. of Transportation National Highway Traffic Safety Administration. Retrieved from http://trid.trb.org/view.aspx?id=474030",
      "doi": ""
    },
    {
      "text": "David Beattie, Lynne Baillie, Martin Halvey, and Rod Mccall. 2014. What's around the corner? Enhancing Driver Awareness in Autonomous Vehicles via InVehicle Spatial Auditory Displays. Proceedings of the 8th Nordic Conference on Human-Computer Interaction Fun, Fast, Foundational - NordiCHI '14: 189--198. http://doi.org/10.1145/2639189.2641206  ",
      "doi": "10.1145/2639189.2641206"
    },
    {
      "text": "Durand R. Begault. 1993. Head-up auditory displays for traffic collision avoidance system advisories: A preliminary investigation. Human Factors: The Journal of the Human Factors and Ergonomics Society 35, 4: 707--717. http://doi.org/10.1177/001872089303500409",
      "doi": ""
    },
    {
      "text": "Durand R. Begault. 1999. Auditory and non-auditory factors that potentially influence virtual acoustic imagery. Audio Engineering Society Conference: 16th International Conference: Spatial Sound Reproduction. Retrieved from http://www.aes.org/elib/browse.cfm?elib=8052",
      "doi": ""
    },
    {
      "text": "Meera M. Blattner, Denise A. Sumikawa, Robert M. Greenberg, et al. 1989. Earcons and icons: Their structure and common design principles. Human-Computer Interaction 4, 1: 11--44.  ",
      "doi": "10.1207/s15327051hci0401_1"
    },
    {
      "text": "Sara Bly. 1982. Presenting information in sound. Proceedings of the 1st Conference on Human Factors in Computing Systems (CHI '82), 371--375. http://doi.org/10.1145/800049.801814  ",
      "doi": "10.1145/800049.801814"
    },
    {
      "text": "Warren Brodsky. 2015. Driving with music: cognitive-behavioural implications. Ashgate Publishing, Ltd.",
      "doi": ""
    },
    {
      "text": "Inger Ekman, Laura Ermi, Jussi Lahti, Jani Nummela, Petri Lankoski, and Frans Mäyrä. 2005. Designing sound for a pervasive mobile game. Proceedings of the 2005 ACM SIGCHI International Conference on Advances in computer entertainment technology, 110-- 116.  ",
      "doi": "10.1145/1178477.1178492"
    },
    {
      "text": "Mica R. Endsley. 1988. Design and evaluation for situation awareness enhancement. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 32, 2: 97--101. http://doi.org/10.1177/154193128803200221",
      "doi": ""
    },
    {
      "text": "Mica R. Endsley. 1988. Situation awareness global assessment technique (SAGAT). Aerospace and Electronics Conference, 1988. NAECON 1988., Proceedings of the IEEE 1988 National, 789--795. Retrieved November 6, 2014 from http://scholar.google.com/scholar?hl=en&btnG=Search&q=intitle:A+methodology+for+the+objective+measurement+of+pilot+situation+awareness#0",
      "doi": ""
    },
    {
      "text": "Mark A. Ericson and Richard L. McKinley. 2001. The intelligibility of multiple talkers spatially separated in noise(No. AFRL-HE-WP-SR-2001-0009).",
      "doi": ""
    },
    {
      "text": "Johan Fagerlonn and Alm Håkan. 2010. Auditory signs to support traffic awareness. IET Intelligent Transport Systems 4, 4: 262--269. http://doi.org/10.1049/ietits.2009.0144",
      "doi": ""
    },
    {
      "text": "Rob Gray. 2011. Looming auditory collision warnings for driving. Human Factors: The Journal of the Human Factors and Ergonomics Society 53, 1: 63--74. http://doi.org/10.1177/0018720810397833 ",
      "doi": ""
    },
    {
      "text": "Philip Kortum. 2008. HCI beyond the GUI: Design for haptic, speech, olfactory, and other nontraditional interfaces. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Jason Kurczak, T. C. Nicholas Graham, Claire Joly, and Regan L. Mandryk. 2011. Hearing is believing: evaluating ambient audio for location-based games. Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology, 32. http://doi.org/10.1145/2071423.2071463  ",
      "doi": "10.1145/2071423.2071463"
    },
    {
      "text": "Van Der Laan, Jinke D., Adriaan Heino, and Dick De Waard. 1997. A simple procedure for the assessment of acceptance of advanced transport telematics. Transportation Research Part C: Emerging Technologies 5, 1: 1--10.",
      "doi": ""
    },
    {
      "text": "John D. Lee, Joshua D. Hoffman, and Elizabeth Hayes. 2004. Collision warning design to mitigate driver distraction. Proceedings of the SIGCHI Conference on Human factors in Computing Systems, 65--72. Retrieved March 24, 2012 from http://dl.acm.org/citation.cfm?id=985701",
      "doi": "10.1145/985692.985701"
    },
    {
      "text": "Fabrizio Leo, Vincenzo Romei, Elliot Freeman, Elisabetta Ladavas, and Jon Driver. 2011. Looming sounds enhance orientation sensitivity for visual stimuli on the same side as such sounds. Experimental brain research 213, 2-3: 193--201. http://doi.org/10.1007/s00221-011-2742-8",
      "doi": ""
    },
    {
      "text": "Yung-Ching Liu and Jing-Wun Jhuang. 2011. Effects of in-vehicle warning information displays with or without spatial compatibility on driving behaviors and response performance. Applied ergonomics: 1--8. http://doi.org/10.1016/j.apergo.2011.10.005 ",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Tye Rattenbury, and Scott Carter. 2007. Defining, designing, and evaluating peripheral displays: An analysis using activity theory. Human-Computer Interaction 22, 1--2: 221--261. http://doi.org/10.1080/07370020701307997",
      "doi": ""
    },
    {
      "text": "David K McGookin and Stephen A Brewster. 2004. Understanding concurrent earcons: applying auditory scene analysis principles to concurrent earcon recognition. ACM Transactions on Applied Perception (TAP) 1, 2: 130--155. http://doi.org/10.1145/1024083.1024087",
      "doi": "10.1145/1024083.1024087"
    },
    {
      "text": "Natasa Paterson, Katsiaryna Naliuka, Soren Kristian Jensen, Tara Carrigy, Mads Haahr, and Fionnuala Conway. 2010. Design, implementation and evaluation of audio for a location aware augmented reality game. Proceedings of the 3rd International Conference on Fun and Games - Fun and Games '10, 149--156. http://doi.org/10.1145/1823818.1823835  ",
      "doi": "10.1145/1823818.1823835"
    },
    {
      "text": "Miguel a. Recarte and Luis M. Nunes. 2003. Mental workload while driving: Effects on visual search, discrimination, and decision making. Journal of Experimental Psychology: Applied 9, 2: 119--137. http://doi.org/10.1037/1076-898X.9.2.119",
      "doi": ""
    },
    {
      "text": "Nash Stanton, Roger Lew, Nolan Boyle, et al. 2011. An Implementation of a Graded Deceleration Display in Brake Light Warning Systems. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 55, 1: 1573--1577. http://doi.org/10.1177/1071181311551328 ",
      "doi": ""
    },
    {
      "text": "Heikki Summala. 2007. Towards understanding motivational and emotional factors in driver behaviour: Comfort through satisficing. In Modelling driver behaviour in automotive environments. Springer London, 189--207. Retrieved November 17, 2014 from http://link.springer.com/chapter/10.1007/978-1-84628618-6_11",
      "doi": ""
    },
    {
      "text": "MinJuan Wang, Yi Ci Li, and Fang Chen. 2012. How can we design 3D auditory interfaces which enhance traffic safety for Chinese drivers? Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, ACM Press, 77--83. http://doi.org/10.1145/2390256.2390268  ",
      "doi": "10.1145/2390256.2390268"
    },
    {
      "text": "Minjuan Wang, Sus Lundgren Lyckvi, and Fang Chen. 2016. Same, Same but Different: How Design Requirements for an Auditory Advisory Traffic Information System Differ Between Sweden and China. 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications.  ",
      "doi": "10.1145/3003715.3005450"
    },
    {
      "text": "Minjuan Wang, Sus Lundgren Lyckvi, and Fang Chen. 2016. Why and How Traffic Safety Cultures Matter when Designing Advisory Traffic Information Systems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. http://doi.org/10.1145/2858036.2858467  ",
      "doi": "10.1145/2858036.2858467"
    },
    {
      "text": "Marcus O. Watson and Penelope M. Sanderson. 2007. Designing for attention with sound: challenges and extensions to ecological interface design. Human Factors: The Journal of the Human Factors and Ergonomics Society 49, 2: 331--346. ",
      "doi": ""
    },
    {
      "text": "Deborah Withington. 2000. The Use of Directional Sound to Improve the Safety of Auditory Warnings. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 44, 22: 726--729. http://doi.org/10.1177/154193120004402260 ",
      "doi": ""
    }
  ]
}