{
  "doi": "10.1145/3025453.3025686",
  "title": "Understanding the Cost of Driving Trips",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "430-434",
  "year": 2017,
  "badges": [],
  "abstract": "Driving is the second highest expense for the average American household. Yet few people know the total cost of owning and operating their vehicles, and most cannot estimate accurately how much a common driving trip (like a daily commute) costs. There are an increasing number of viable alternatives for personal transportation, such as car services (e.g. Uber, Lyft), in addition to ridesharing, transit, biking, and walking. Cost is one factor in transportation mode choice, and awareness of the cost of driving is useful in making better informed decisions. To bridge this awareness gap, we built and deployed a system that makes the total cost of each driving trip (including depreciation, maintenance, insurance, and fuel) visible to the user. After this intervention, participants were able to more accurately and confidently estimate costs of their driving commutes, and transfer this knowledge to other trips for which they had not seen a cost.",
  "authors": [
    {
      "name": "Caleb Southern",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488671961",
      "orcid": "missing"
    },
    {
      "name": "Yunnuo Cheng",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162273",
      "orcid": "missing"
    },
    {
      "name": "Cheng Zhang",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81488647680/rel-imgonly/cheng_pic.jpeg",
      "acmid": "81488647680",
      "orcid": "0000-0002-5079-5927"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    }
  ],
  "references": [
    {
      "text": "Bureau of Labor Statistics. 2016. CONSUMER EXPENDITURES - 2015. Retrieved September 21, 2016 from http://www.bls.gov/news.release/pdf/cesan.pdf",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742. http://dx.doi.org/10.1145/2750858.2804250  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "E. Ferguson. 1990. Transportation Demand Management Planning, Development, and Implementation. Journal of the American Planning Association 56, 4: 442--456. ",
      "doi": ""
    },
    {
      "text": "Brian Ferris, Kari Watkins, and Alan Borning. 2010. OneBusAway: results from providing real-time arrival information for public transit. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1807--1816. http://dx.doi.org/10.1145/1753326.1753597  ",
      "doi": "10.1145/1753326.1753597"
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2009. UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1043--1052. http://dx.doi.org/10.1145/1518701.1518861  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Ian Hawkins. 2016. Torque - OBD Performance and Diagnostics for your Vehicle. Retrieved September 21, 2016 from https://torque-bhp.com/",
      "doi": ""
    },
    {
      "text": "Jin-Hyuk Hong, Ben Margines, and Anind K. Dey. 2014. A smartphone-based sensing platform to model aggressive driving behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 4047--4056. http://dx.doi.org/10.1145/2556288.2557321  ",
      "doi": "10.1145/2556288.2557321"
    },
    {
      "text": "Kelley Blue Book Co. 2016. Kelley Blue Book - New and Used Car Price Values, Expert Car Reviews. Retrieved September 21, 2016 from http://www.kbb.com/",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566. http://dx.doi.org/10.1145/1753326.1753409  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "M. D. Meyer. 1999. Demand management as an element of transportation policy: using carrots and sticks to influence travel behavior. Transportation research. Part A, Policy and practice 33, 7-8: 575--599.",
      "doi": ""
    },
    {
      "text": "James O. Prochaska and Wayne F. Velicer. 1997. The transtheoretical model of health behavior change. American journal of health promotion 12,1: 38--48. ",
      "doi": ""
    },
    {
      "text": "Richard H. Thaler and Cass R Sunstein. 2008. Nudge: Improving Decisions about Health, Wealth, and Happiness. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Johannes Tulusan, Thorsten Staake, and Elgar Fleisch. 2012. Providing eco-driving feedback to corporate car drivers: what impact does a smartphone application have on their fuel efficiency? In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12), 212--215. http://dx.doi.org/10.1145/2370216.2370250  ",
      "doi": "10.1145/2370216.2370250"
    },
    {
      "text": "M. Wachs. 1991. Policy Implications of Recent Behavioral Research in Transportation Demand Management. Journal of Planning Literature 5.4: 333--341. ",
      "doi": ""
    },
    {
      "text": "P. L. Winters. 2000. Transportation Demand Management. Retrieved September 21, 2016 from http://onlinepubs.trb.org/onlinepubs/millennium/00123.pdf",
      "doi": ""
    }
  ]
}