{
  "doi": "10.1145/3025453.3025569",
  "title": "Itchtector: A Wearable-based Mobile System for Managing Itching Conditions",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "893-905",
  "year": 2017,
  "badges": [],
  "abstract": "Severe itching conditions such as eczema or atopic dermatitis can have a significant impact on one's quality of life. Unfortunately, many of these conditions cannot be cured, and the focus is often on properly controlling or managing the condition. Thus, it is important to understand or objectively monitor how one's scratching behavior changes, based on medication or treatment or environmental conditions. In this work, we explore how wearable devices can support people with itching conditions to better manage their conditions. We carried out a three-phase study with 40 participants and 2 dermatologists to understand the implications of various system features and designs. Based on interviews with patients and doctors, we incorporated medical guidelines for treatment and patients' needs in the proposed Itchtector - a smartwatch-based mobile system to monitor itching behaviors and provide objective information about the user's scratching behaviors. Using the Itchtector prototype, we evaluated performance and possible acceptance with subjects.",
  "tags": [
    "nocturnal scratching",
    "itching management",
    "mobile system"
  ],
  "authors": [
    {
      "name": "Jongin Lee",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458874257",
      "orcid": "missing"
    },
    {
      "name": "Daeki Cho",
      "institution": "NEC Laboratories America, Inc., Princeton, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705555",
      "orcid": "missing"
    },
    {
      "name": "Junhong Kim",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162481",
      "orcid": "missing"
    },
    {
      "name": "Eunji Im",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704248",
      "orcid": "missing"
    },
    {
      "name": "JinYeong Bak",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548986456",
      "orcid": "missing"
    },
    {
      "name": "Kyung ho Lee",
      "institution": "The Catholic University of Korea, Bucheon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162710",
      "orcid": "missing"
    },
    {
      "name": "Kwan Hong Lee",
      "institution": "AcademicMerit, South Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162762",
      "orcid": "missing"
    },
    {
      "name": "John Kim",
      "institution": "Korea Advanced Institute of Science & Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100664577",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cezmi A Akdis, Mübeccel Akdis, Thomas Bieber, Carsten Bindslev-Jensen, Mark Boguniewicz, Philippe Eigenmann, Qutayba Hamid, Alexander Kapp, Donald YM Leung, Jasna Lipozencic, and others. 2006. Diagnosis and treatment of atopic dermatitis in children and adults: European Academy of Allergology and Clinical Immunology/American Academy of Allergy, Asthma and Immunology/PRACTALL Consensus Report. Allergy 61, 8 (2006), 969--987. DOI: http://dx.doi.org/10.1016/j.jaci.2006.03.045 ",
      "doi": ""
    },
    {
      "text": "Elske Ammenwerth, Stefan Gräber, Gabriele Herrmann, Thomas Bürkle, and Jochem König. 2003. Evaluation of health information systems-problems and challenges. International journal of medical informatics 71, 2 (2003), 125--135. DOI: http://dx.doi.org/10.1016/S1386--5056(03)00131-X",
      "doi": ""
    },
    {
      "text": "Peter D. Arkwright, Cassim Motala, Hamsa Subramanian, Jonathan Spergel, Lynda C. Schneider, and Andreas Wollenberg. 2013. Management of difficult-to-treat atopic dermatitis. Journal of Allergy and Clinical Immunology: In Practice 1, 2 (2013), 142--151. DOI: http://dx.doi.org/10.1016/j.jaip.2012.09.002 ",
      "doi": ""
    },
    {
      "text": "Eirik Arsand, Ragnhild Varmedal, and Gunnar Hartvigsen. 2007. Usability of a mobile self-help tool for people with diabetes: the easy health diary. In 2007 IEEE International Conference on Automation Science and Engineering. IEEE, 863--868. DOI: http://dx.doi.org/10.1109/COASE.2007.4341807 ",
      "doi": ""
    },
    {
      "text": "Oresti Banos, Juan-Manuel Galvez, Miguel Damas, Hector Pomares, and Ignacio Rojas. 2014. Window size impact in human activity recognition. Sensors (Basel, Switzerland) 14, 4 (2014), 6474--99. DOI: http://dx.doi.org/10.3390/s140406474 ",
      "doi": ""
    },
    {
      "text": "Bruce G. Bender, Robert Ballard, Beth Canono, James R. Murphy, and Donald Y M Leung. 2008. Disease severity, scratching, and sleep quality in patients with atopic dermatitis. Journal of the American Academy of Dermatology 58, 3 (2008), 415--420. DOI: http://dx.doi.org/10.1016/j.jaad.2007.10.010 ",
      "doi": ""
    },
    {
      "text": "Bruce G. Bender, Susan B. Leung, and D. Y M Leung. 2003. Actigraphy assessment of sleep disturbance in patients with atopic dermatitis: An objective life quality measure. Journal of Allergy and Clinical Immunology 111, 3 (2003), 598--602. DOI: http://dx.doi.org/10.1067/mai.2003.174 ",
      "doi": ""
    },
    {
      "text": "Kenneth Benjamin, Karen Waterston, Margaret Russell, Olivia Schofield, Brian Diffey, and Jonathan L. Rees. 2004. The development of an objective method for measuring scratch in children with atopic dermatitis suitable for clinical use. Journal of the American Academy of Dermatology 50, 1 (2004), 33--40. DOI: http://dx.doi.org/10.1016/S0190--9622(03)02480-0",
      "doi": ""
    },
    {
      "text": "Bruce R Bistrian, George L Blackburn, NS Scrimshaw, and JP Flatt. 1975. Cellular immunity in semistarved states in hospitalized adults. The American journal of clinical nutrition 28, 10 (1975), 1148--1155.",
      "doi": ""
    },
    {
      "text": "Pierluigi Casale, Oriol Pujol, and Petia Radeva. 2011. Human activity recognition from accelerometer data using a wearable device. In Iberian Conference on Pattern Recognition and Image Analysis. Springer, 289--296. DOI: http://dx.doi.org/10.1007/978--3--642--21257--4_36",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, and Sean A Munson. 2015. More than telemonitoring: Health provider use and nonuse of life-log data in irritable bowel syndrome and weight management. Journal of medical Internet research 17, 8 (2015), e203. DOI: http://dx.doi.org/10.2196/jmir.4364 ",
      "doi": ""
    },
    {
      "text": "Lilian de Greef, Mayank Goel, Min Joon Seo, Eric C Larson, James W. Stout, James A Taylor, and Shwetak N Patel. 2014. Bilicam: Using Mobile Phones to Monitor Newborn Jaundice. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '14 Adjunct. 331--342. DOI:http://dx.doi.org/10.1145/2632048.2632076  ",
      "doi": "10.1145/2632048.2632076"
    },
    {
      "text": "Marco de Sá and Luís Carriço. 2008. Lessons from early stages design of mobile applications. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services. ACM, 127--136. DOI: http://dx.doi.org/10.1145/1409240.1409255  ",
      "doi": "10.1145/1409240.1409255"
    },
    {
      "text": "ActiGraph Devices. 2016a. (Sept. 2016). Retrieved August 22, 2014 from http://actigraphcorp.com.",
      "doi": ""
    },
    {
      "text": "Actiwatch Devices. 2016b. (Sept. 2016). Retrieved August 22, 2014 from http://www.usa.philips.com/.",
      "doi": ""
    },
    {
      "text": "Cathy A Eastwood, Lucille Travis, Tanya T Morgenstern, and Erin K Donaho. 2007. Weight and symptom diary for self-monitoring in heart failure clinic patients. Journal of Cardiovascular Nursing 22, 5 (2007), 382--389. DOI: http: //dx.doi.org/10.1097/01.JCN.0000287027.49628.a7 ",
      "doi": ""
    },
    {
      "text": "Toshiya Ebata, H. Aizawa, R. Kamide, and M. Niimura. 1999. The characteristics of nocturnal scratching in adults with atopic dermatitis. British Journal of Dermatology 141, 1 (1999), 82--86. DOI:http: //dx.doi.org/10.1046/j.1365--2133.1999.02924.x",
      "doi": ""
    },
    {
      "text": "Johanna Feuerstein, Daniel Austin, Robert Sack, and Tamara L. Hayes. 2011. Wrist actigraphy for scratch detection in the presence of confounding activities. In Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS. 3652--3655. DOI: http://dx.doi.org/10.1109/IEMBS.2011.6090615 ",
      "doi": ""
    },
    {
      "text": "Rebat Halder. 2005. Dermatology and dermatological therapy of pigmented skins. CRC Press.",
      "doi": ""
    },
    {
      "text": "Sen H Hirano, Karen P Tang, Karen G Cheng, and Gillian R Hayes. 2012. The estrellita system: A health informatics tool to support caregivers of preterm infants. In 2012 6th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth) and Workshops. IEEE, 195--196. DOI: http://dx.doi.org/10.4108/icst.pervasivehealth. 2012.248718",
      "doi": ""
    },
    {
      "text": "K. L E Hon, M. C A Lam, T. F. Leung, W. Y C Kam, K. C K Lee, M. C A Li, T. F. Fok, and P. C. Ng. 2006. Nocturnal wrist movements are correlated with objective clinical scores and plasma chemokine levels in children with atopic dermatitis. British Journal of Dermatology 154, 4 (2006), 629--635. DOI:http: //dx.doi.org/10.1111/j.1365--2133.2006.07213.x",
      "doi": ""
    },
    {
      "text": "JM Hopkin. 1997. Mechanisms of enhanced prevalence of asthma and atopy in developed countries. Current opinion in immunology 9, 6 (1997), 788--792. DOI: http://dx.doi.org/10.1016/S0952--7915(97)80179--3",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Sookyoung Ji, Hyunjeong Lee, Jeong-Whun Kim, Sooyoung Yoo, and Joongseek Lee. 2016. My Doctor is Keeping an Eye on Me!: Exploring the Clinical Applicability of a Mobile Food Logger. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5620--5631. DOI: http://dx.doi.org/10.1145/2858036.2858145  ",
      "doi": "10.1145/2858036.2858145"
    },
    {
      "text": "Ross M King and George V Wilson. 1991. Use of a diary technique to investigate psychosomatic relations in atopic dermatitis. Journal of psychosomatic research 35, 6 (1991), 697--706. DOI: http://dx.doi.org/10.1016/0022--3999(91)90120-D",
      "doi": ""
    },
    {
      "text": "Sotiris B. Kotsiantis. 2007. Supervised machine learning: A review of classification techniques. Informatica 31 (2007), 249--268. DOI: http://dx.doi.org/10.1115/1.1559160 ",
      "doi": ""
    },
    {
      "text": "Olivier Lartillot, Tuomas Eerola, Petri Toiviainen, and Jose Fornari. 2008. Multi-feature modeling of pulse clarity: design, validation, and optimization. In The International Society of Music Information Retrieval ISMIR 2008. 521--526. http://ismir2008.ismir.net/papers/ISMIR2008",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Sue Jamison-Powell, Andrew Garbett, Conor Linehan, Erica Kucharczyk, Sanne Verbaan, Duncan A Rowland, and Kevin Morgan. 2013. Validating a mobile phone application for the everyday, unobtrusive, objective measurement of sleep. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2497--2506. DOI: http://dx.doi.org/10.1145/2470654.2481345  ",
      "doi": "10.1145/2470654.2481345"
    },
    {
      "text": "Jongin Lee, Dae-ki Cho, Seokwoo Song, SeungHo Kim, Eunji Im, and John Kim. 2015. Mobile System Design for Scratch Recognition. In Extended Abstracts of the ACM CHI'15 Conference on Human Factors in Computing Systems, Vol. 2. 1567--1572. DOI: http://dx.doi.org/10.1145/2702613.2732820  ",
      "doi": "10.1145/2702613.2732820"
    },
    {
      "text": "Elina Mattila, Juha Pärkkä, Marion Hermersdorf, Jussi Kaasinen, Janne Vainio, Kai Samposalo, Juho Merilahti, Juha Kolari, Minna Kulju, Raimo Lappalainen, and others. 2008. Mobile diary for wellness management-results on usage and usability in two user studies. IEEE Transactions on information technology in biomedicine 12, 4 (2008), 501--512. DOI: http://dx.doi.org/10.1109/TITB.2007.908237  ",
      "doi": "10.1109/TITB.2007.908237"
    },
    {
      "text": "Andrew D Miller, Sonali R Mishra, Logan Kendall, Shefali Haldar, Ari H Pollack, and Wanda Pratt. 2016. Partners in care: design considerations for caregivers and patients during a hospital stay. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 756--769. DOI: http://dx.doi.org/10.1145/2818048.2819983  ",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "Dan Morris, T Scott Saponas, Andrew Guillory, and Ilya Kelner. 2014. RecoFit: using a wearable sensor to find, recognize, and count repetitive exercises. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14 (2014), 3225--3234. DOI: http://dx.doi.org/10.1145/2556288.2557116  ",
      "doi": "10.1145/2556288.2557116"
    },
    {
      "text": "Johanna Petersen, Daniel Austin, Robert Sack, and Tamara L. Hayes. 2013. Actigraphy-based scratch detection using logistic regression. IEEE Journal of Biomedical and Health Informatics 17, 2 (2013), 277--283. DOI: http://dx.doi.org/10.1109/TITB.2012.2204761 ",
      "doi": ""
    },
    {
      "text": "Health Data Exploration Project. 2014. Personal Data for the Public Good: New Opportunities to Enrich Understanding of Individual and Population Health. In Calit2, San Diego. Calit2, San Diego. Retrieved Dec. 18, 2016 from http://www.rwjf.org/content/dam/farm/ reports/reports/2014/rwjf411080.",
      "doi": ""
    },
    {
      "text": "Luís Rosado, Maria João M Vasconcelos, Fernando Correia, and Nuno Costa. 2015. A novel framework for supervised mobile assessment and risk triage of skin lesions. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare. 266--267. http: //dl.acm.org/citation.cfm?id=2826165.2826213",
      "doi": "10.5555/2826165.2826213"
    },
    {
      "text": "PC Sanger, Andrea Hartzler, William B Lober, Heather L Evans, and Wanda Pratt. 2014. Design considerations for post-acute care mHealth: patient perspectives. In Proceedings of AMIA Annual Symposium. 1920--1929.",
      "doi": ""
    },
    {
      "text": "Walter B Shelley. 1981. Dermatitis artefacta induced in a patient by one of her multiple personalities. British Journal of Dermatology 105, 5 (1981), 587--589. ",
      "doi": ""
    },
    {
      "text": "J-F Stalder, S Barbarot, A Wollenberg, EA Holm, L De Raeve, S Seidenari, Arnold Oranje, M Deleuran, F Cambazard, A Svensson, and others. 2011. Patient-Oriented SCORAD (PO-SCORAD): a new self-assessment scale in atopic dermatitis validated in Europe. Allergy 66, 8 (2011), 1114--1121. DOI:http: //dx.doi.org/10.1111/j.1398--9995.2011.02577.x",
      "doi": ""
    },
    {
      "text": "Dennis L Stevens, Alan L Bisno, Henry F Chambers, E Dale Everett, Patchen Dellinger, Ellie JC Goldstein, Sherwood L Gorbach, Jan V Hirschmann, Edward L Kaplan, Jose G Montoya, and others. 2005. Practice guidelines for the diagnosis and management of skin and soft-tissue infections. Clinical Infectious Diseases 41, 10 (2005), 1373--1406. DOI: http://dx.doi.org/10.1086/497143 ",
      "doi": ""
    },
    {
      "text": "Erich P Stuntebeck, John S Davis Ii, Gregory D Abowd, and Marion Blount. 2008. HealthSense : Classification of Health-related Sensor Data through User-Assisted Machine Learning. Hotmobile 2008 (2008), 1--5. DOI: http://dx.doi.org/10.1145/1411759.1411761  ",
      "doi": "10.1145/1411759.1411761"
    },
    {
      "text": "M. M. Tollefson and a. L. Bruckner. 2014. Atopic Dermatitis: Skin-Directed Management. Pediatrics 134, 6 (2014), e1735--e1744. DOI: http://dx.doi.org/10.1542/peds.2014--2812",
      "doi": ""
    },
    {
      "text": "P Warschburger, H Buchholz, and F Petermann. 2004. Psychological adjustment in parents of young children with atopic dermatitis: which factors predict parental quality of life? British Journal of Dermatology 150, 2 (2004), 304--311. DOI:http: //dx.doi.org/10.1111/j.1365--2133.2004.05743.x",
      "doi": ""
    },
    {
      "text": "William Wu-Shyong Wei. 1994. Time series analysis. Addison-Wesley publ Reading.",
      "doi": ""
    },
    {
      "text": "Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing health data for better outcomes on PatientsLikeMe. Journal of medical Internet research 12, 2 (2010), e19. DOI: http://dx.doi.org/10.2196/jmir.1549 ",
      "doi": ""
    },
    {
      "text": "Anja Wittkowski, Helen L Richards, Christopher EM Griffiths, and Chris J Main. 2004. The impact of psychological and clinical factors on quality of life in individuals with atopic dermatitis. Journal of psychosomatic research 57, 2 (2004), 195--200. DOI: http://dx.doi.org/10.1016/S0022--3999(03)00572--5",
      "doi": ""
    },
    {
      "text": "CI Wootton, K Koller, S Lawton, C O'Leary, and KS Thomas. 2012. Are accelerometers a useful tool for measuring disease activity in children with eczema? Validity, responsiveness to change, and acceptability of use in a clinical trial setting. British Journal of Dermatology 167, 5 (2012), 1131--1137. DOI:http: //dx.doi.org/10.1111/j.1365--2133.2012.11184.x",
      "doi": ""
    },
    {
      "text": "Gil Yosipovitch and Alexandru DP Papoiu. 2008. What causes itch in atopic dermatitis? Current allergy and asthma reports 8, 4 (2008), 306--311. DOI: http://dx.doi.org/10.1007/s11882-008-0049-z ",
      "doi": ""
    }
  ]
}