{
  "doi": "10.1145/3025453.3025997",
  "title": "To Three or not to Three: Improving Human Computation Game Onboarding with a Three-Star System",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5034-5039",
  "year": 2017,
  "badges": [],
  "abstract": "While many popular casual games use three-star systems, which give players up to three stars based on their performance in a level, this technique has seen limited application in human computation games (HCGs). This gives rise to the question of what impact, if any, a three-star system will have on the behavior of players in HCGs. In this work, we examined the impact of a three-star system implemented in the protein folding HCG Foldit. We compared the basic game's introductory levels with two versions using a three-star system, where players were rewarded with more stars for completing levels in fewer moves. In one version, players could continue playing levels for as many moves as they liked, and in the other, players were forced to reset the level if they used more moves than required to achieve at least one star on the level. We observed that the three-star system encouraged players to use fewer moves, take more time per move, and replay completed levels more often. We did not observe an impact on retention. This indicates that three-star systems may be useful for re-enforcing concepts introduced by HCG levels, or as a flexible means to encourage desired behaviors.",
  "tags": [
    "human computation",
    "design",
    "analytics",
    "games"
  ],
  "authors": [
    {
      "name": "Jacqueline Gaston",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160234",
      "orcid": "missing"
    },
    {
      "name": "Seth Cooper",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-81314493529/rel-imgonly/81314493529.jpg",
      "acmid": "81314493529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Luis von Ahn and Laura Dabbish. 2004. Labeling Images with a Computer Game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Erik Andersen, Yun-En Liu, Richard Snider, Roy Szeto, Seth Cooper, and Zoran Popović. 2011. On the Harmfulness of Secondary Game Objectives. In Proceedings of the 6th International Conference on the Foundations of Digital Games. 30--37.  ",
      "doi": "10.1145/2159365.2159370"
    },
    {
      "text": "Erik Andersen, Eleanor O'Rourke, Yun-En Liu, Rich Snider, Jeff Lowdermilk, David Truong, Seth Cooper, and Zoran Popović. 2012. The Impact of Tutorials on Games of Varying Complexity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 59--68.  ",
      "doi": "10.1145/2207676.2207687"
    },
    {
      "text": "Richard Bartle. 1996. Hearts, Clubs, Diamonds, Spades: Players who Suit MUDs. The Journal of Virtual Environments 1, 1 (1996).",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popović, and Foldit Players. 2010a. Predicting Protein Structures with a Multiplayer Online Game. Nature 466, 7307 (2010), 756--760.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Adrien Treuille, Janos Barbero, Andrew Leaver-Fay, Kathleen Tuite, Firas Khatib, Alex Cho Snyder, Michael Beenen, David Salesin, David Baker, Zoran Popović, and Foldit Players. 2010b. The Challenge of Designing Scientific Discovery Games. In Proceedings of the 5th International Conference on the Foundations of Digital Games. 40--47.  ",
      "doi": "10.1145/1822348.1822354"
    },
    {
      "text": "Dion Hoe-Lian Goh, Ei Pa Pa Pe-Than, and Chei Sian Lee. 2015. An Investigation of Reward Systems in Human Computation Games. In Human-Computer Interaction: Interaction Technologies, Masaaki Kurosu (Ed.). Number 9170 in Lecture Notes in Computer Science. 596--607.",
      "doi": ""
    },
    {
      "text": "Neal Hallford and Jana Hallford. 2001. Swords and Circuitry: A Designer's Guide to Computer Role-Playing Games. Premier Press, Incorporated. ",
      "doi": "10.5555/558350"
    },
    {
      "text": "Jinseop S. Kim, Matthew J. Greene, Aleksandar Zlateski, Kisuk Lee, Mark Richardson, Srinivas C. Turaga, Michael Purcaro, Matthew Balkam, Amy Robinson, Bardia F. Behabadi, Michael Campos, Winfried Denk, H. Sebastian Seung, and EyeWirers. 2014. Space-Time Wiring Specificity Supports Direction Selectivity in the Retina. Nature 509, 7500 (2014), 331--336.",
      "doi": ""
    },
    {
      "text": "King. 2012. Candy Crush. Game. (2012).",
      "doi": ""
    },
    {
      "text": "Edith Law and Luis von Ahn. 2009. Input-Agreement: A New Mechanism for Collecting Data Using Human Computation Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1197--1206.  ",
      "doi": "10.1145/1518701.1518881"
    },
    {
      "text": "Andrew Leaver-Fay, Michael Tyka, Steven M. Lewis, Oliver F. Lange, James Thompson, Ron Jacak, Kristian Kaufman, P. Douglas Renfrew, Colin A. Smith, Will Sheffier, Ian W. Davis, Seth Cooper, Adrien Treuille, Daniel J. Mandell, Florian Richter, Yih-En Andrew Ban, Sarel J. Fleishman, Jacob E. Corn, David E. Kim, Sergey Lyskov, Monica Berrondo, Stuart Mentzer, Zoran Popović, James J. Havranek, John Karanicolas, Rhiju Das, Jens Meiler, Tanja Kortemme, Jeffrey J. Gray, Brian Kuhlman, David Baker, and Philip Bradley. 2011. ROSETTA3: An Object-Oriented Software Suite for the Simulation and Design of Macromolecules. Methods in Enzymology 487 (2011), 545--574.",
      "doi": ""
    },
    {
      "text": "Jeehyung Lee, Wipapat Kladwang, Minjae Lee, Daniel Cantu, Martin Azizyan, Hanjoo Kim, Alex Limpaecher, Sungroh Yoon, Adrien Treuille, Rhiju Das, and EteRNA Participants. 2014. RNA Design Rules from a Massive Open Laboratory. Proceedings of the National Academy of Sciences 111, 6 (2014), 2122--2127.",
      "doi": ""
    },
    {
      "text": "Derek Lomas, Kishan Patel, Jodi L. Forlizzi, and Kenneth R. Koedinger. 2013. Optimizing Challenge in an Educational Game using Large-Scale Design Experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 89--98.  ",
      "doi": "10.1145/2470654.2470668"
    },
    {
      "text": "Andrew Mao, Ece Kamar, and Eric Horvitz. 2013. Why Stop Now? Predicting Worker Engagement in Online Crowdsourcing. In Proceedings of the 1st Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Kerry Moffitt, John Ostwald, Ron Watro, and Eric Church. 2015. Making Hard Fun in Crowdsourced Model Checking: Balancing Crowd Engagement and Efficiency to Maximize Output in Proof by Games. In Proceedings of the Second International Workshop on CrowdSourcing in Software Engineering. 30--31. ",
      "doi": "10.5555/2820116.2820122"
    },
    {
      "text": "Allen Newell and Paul S. Rosenbloom. 1981. Mechanisms of Skill Acquisition and the Law of Practice. Cognitive Skills and their Acquisition 1 (1981), 1--55.",
      "doi": ""
    },
    {
      "text": "Cody Phillips, Daniel Johnson, and Peta Wyeth. 2013. Videogame Reward Types. In Proceedings of the First International Conference on Gameful Design, Research, and Applications. 103--106.  ",
      "doi": "10.1145/2583008.2583025"
    },
    {
      "text": "Carol A. Rohl, Charlie E. M. Strauss, Kira M. S. Misura, and David Baker. 2004. Protein Structure Prediction using Rosetta. Methods in Enzymology 383 (2004), 66--93.",
      "doi": ""
    },
    {
      "text": "Rovio. 2009. Angry Birds. Game. (2009).",
      "doi": ""
    },
    {
      "text": "Henry Sauermann and Chiara Franzoni. 2015. Crowd Science User Contribution Patterns and their Implications. Proceedings of the National Academy of Sciences 112, 3 (2015), 679--684.",
      "doi": ""
    },
    {
      "text": "Kristin Siu and Mark O. Riedl. 2016. Reward Systems in Human Computation Games. In Proceedings of the SIGCHI Annual Symposium on Computer-Human Interaction in Play.  ",
      "doi": "10.1145/2967934.2968083"
    },
    {
      "text": "Kristin Siu, Alexander Zook, and Mark O. Riedl. 2014. Collaboration versus Competition: Design and Evaluation of Mechanics for Games with a Purpose. In Proceedings of the 9th International Conference on the Foundations of Digital Games.",
      "doi": ""
    },
    {
      "text": "Tobias Sturn, Michael Wimmer, Carl Salk, Christoph Perger, Linda See, and Steffen Fritz. 2015. Cropland Capture -- A Game for Improving Global Cropland Maps. In Proceedings of the 10th International Conference on the Foundations of Digital Games.",
      "doi": ""
    },
    {
      "text": "Gustavo F. Tondello, Rina R. Wehbe, Lisa Diamond, Marc Busch, Andrzej Marczewski, and Lennart E. Nacke. 2016. The Gamification User Types Hexad Scale. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. 229--243.  ",
      "doi": "10.1145/2967934.2968082"
    },
    {
      "text": "WeWantToKnow. 2012. DragonBox Algebra. Game. (2012).",
      "doi": ""
    },
    {
      "text": "Nick Yee. 2006. Motivations for Play in Online Games. Cyberpsychology and Behavior 9, 6 (2006), 772--775.",
      "doi": ""
    },
    {
      "text": "ZeptoLab. 2010. Cut the Rope. Game. (2010).",
      "doi": ""
    }
  ]
}