{
  "doi": "10.1145/3025453.3025713",
  "title": "Tunneled In: Drivers with Active Secondary Tasks Need More Time to Transition from Automation",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2840-2844",
  "year": 2017,
  "badges": [],
  "abstract": "In partially automated driving, rapid transitions of control present a severe hazard. How long does it take a driver to take back control of the vehicle when engaged with other non-driving tasks? In this driving simulator study, we examined the performance of participants (N=30) after an abrupt loss of automated vehicle control. We tested three transition time conditions, with an unstructured transition of control occurring 2s, 5s, or 8s before entering a curve. As participants were occupied with an active secondary task (playing a game on a tablet) while the automated driving mode was enabled, they needed to disengage from the task and regain control of the car when the transition occurred. Few drivers in the 2 second condition were able to safely negotiate the road hazard situation, while the majority of drivers in the 5 or 8 second conditions were able to navigate the hazard situation safely.",
  "tags": [
    "transition of control",
    "autonomous vehicles",
    "human machine interaction",
    "car simulator",
    "controlled study"
  ],
  "authors": [
    {
      "name": "Brian Mok",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358860957",
      "orcid": "missing"
    },
    {
      "name": "Mishel Johns",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658641708",
      "orcid": "missing"
    },
    {
      "name": "David Miller",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640107",
      "orcid": "missing"
    },
    {
      "name": "Wendy Ju",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81100098733/rel-imgonly/wendy_headshot.jpg",
      "acmid": "81100098733",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arie P. van den Beukel and Mascha C. van der Voort. 2013. The influence of time-criticality on Situation Awareness when retrieving human control after automated driving. In 16th International IEEE Conference on Intelligent Transportation Systems (ITSC 2013), 2000--2005.",
      "doi": ""
    },
    {
      "text": "Myra Blanco, Jon Atwood, Holland M. Vasquez, Tammy E. Trimble, Vikki L. Fitchett, Josh Radlbeck, Gregory M. Fitch, Sheldon M. Russell, Charles A. Green, Brian Cullinane, and others. 2013. Human Factors Evaluation of Level 2 and Level 3 Automated Driving Concepts. Vergina Tech, Automated Vehicle Systems Group Research.",
      "doi": ""
    },
    {
      "text": "Avinoam Borowsky and Tal Oron-Gilad. 2016. The effects of automation failure and secondary task on drivers' ability to mitigate hazards in highly or semiautomated vehicles. Advances in Transportation Studies, 1.",
      "doi": ""
    },
    {
      "text": "Karel A. Brookhuis, Gerbrand de Vries, and Dick de Waard. 1991. The effects of mobile telephoning on driving performance. Accident Analysis & Prevention 23, 4: 309--316.",
      "doi": ""
    },
    {
      "text": "Daniel Damböck and Klaus Bengler. Übernahmezeiten beim hochautomatisierten Fahren.",
      "doi": ""
    },
    {
      "text": "Christian Gold, Daniel Dambock, Lutz Lorenz, and Klaus Bengler. 2013. \"Take over!\" How long does it take to get the driver back into the loop? Proceedings of the Human Factors and Ergonomics Society Annual Meeting 57, 1: 1938--1942.",
      "doi": ""
    },
    {
      "text": "Toshio Ito, Arata Takata, and Kenta Oosawa. 2016. Time Required for Take-over from Automated to Manual Driving.",
      "doi": ""
    },
    {
      "text": "Tyron Louw, Natasha Merat, and Andrew Hamish Jamson. 2015. Engaging With Highly Automated Driving: To Be Or Not To Be In The Loop? In 8th International Driving Symposium on Human Factors in Driver Assessment, Training and Vehicle Design, 189-- 195.",
      "doi": ""
    },
    {
      "text": "Brian Mok, Mishel Johns, Key Jung Lee, Hillary Ive, David Miller, and Wendy Ju. 2015. Timing of unstructured transitions of control in automated driving. In 2015 IEEE Intelligent Vehicles Symposium (IV), 1167--1172.",
      "doi": ""
    },
    {
      "text": "Brian Mok, Mishel Johns, Key Jung Lee, David Miller, David Sirkin, Hillary Ive, and Wendy Ju. 2015. Emergency, Automation Off: Unstructured Transition Timing for Distracted Drivers of Automated Vehicles. In Intelligent Transportation Systems (ITSC), 2015 IEEE 18th International Conference on, 2458--2464.  ",
      "doi": "10.1109/ITSC.2015.396"
    },
    {
      "text": "Frederik Naujoks, Christoph Mai, and Alexandra Neukum. 2014. The effect of urgency of take-over requests during highly automated driving under distraction conditions. Advances in Human Aspects of Transportation, Part I: 431.",
      "doi": ""
    },
    {
      "text": "NHTSA. 2013. U.S. Dept. of Transportation Releases Policy on Automated Vehicle Development | National Highway Traffic Safety Administration (NHTSA). Retrieved August 6, 2014 from http://www.nhtsa.gov/About+NHTSA/Press+Releases/U.S.+Department+of+Transportation+Releases+Policy+on+Automated+Vehicle+Development",
      "doi": ""
    },
    {
      "text": "Jonas Radlmayr, Christian Gold, Lutz Lorenz, Mehdi Farid, and Klaus Bengler. 2014. How traffic situations and non-driving related tasks affect the take-over quality in highly automated driving. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 2063--2067.",
      "doi": ""
    },
    {
      "text": "Joris C. Verster and Thomas Roth. 2011. Standard operation procedures for conducting the on-the-road driving test, and measurement of the standard deviation of lateral position (SDLP). International Journal of General Medicine 4: 359--371.",
      "doi": ""
    },
    {
      "text": "Kathrin Zeeb, Axel Buchner, and Michael Schrauf. 2015. What determines the take-over time? An integrated model approach of driver take-over after automated driving. In Accident Analysis & Prevention 78: 212--221.",
      "doi": ""
    },
    {
      "text": "J2944: Operational Definitions of Driving Performance Measures and Statistics SAE International. Retrieved September 18, 2016 from http://standards.sae.org/j2944_201506/",
      "doi": ""
    }
  ]
}