{
  "doi": "10.1145/3025453.3025869",
  "title": "Quantifying the Body and Caring for the Mind: Self-Tracking in Multiple Sclerosis",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6889-6901",
  "year": 2017,
  "badges": [],
  "abstract": "Consumer health technologies have an enormous potential to transform the self-management of chronic conditions. However, it is unclear how individuals use self-tracking technologies to manage them. This in-depth interview study explores self-tracking practices in multiple sclerosis (MS), a complex neurological disease that causes physical, cognitive, and psychological symptoms. Our findings illustrate that when faced the unpredictable and degenerative nature of MS, individuals regained a sense of control by intertwining self-care practices with different self-tracking technologies. They engaged in disease monitoring, fitness tracking, and life journaling to quantify the body and care for the mind. We focus attention on the role of emotional wellbeing and the experience of control in self-tracking and managing MS. Finally, we discuss in which ways self-tracking technologies could support the experiential nature of control and foster mindful experiences rather than focusing only on tracking primary disease indicators.",
  "tags": [
    "chronic conditions",
    "perceived control",
    "self-care technologies",
    "personal informatics",
    "self-tracking",
    "multiple sclerosis"
  ],
  "authors": [
    {
      "name": "Amid Ayobi",
      "institution": "University College London, London, WC1E 6EA, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020909",
      "orcid": "0000-0003-1104-0043"
    },
    {
      "name": "Paul Marshall",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    },
    {
      "name": "Anna L. Cox",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81350567335/rel-imgonly/a.cox.png",
      "acmid": "81350567335",
      "orcid": "0000-0003-2231-2964"
    },
    {
      "name": "Yunan Chen",
      "institution": "University of California, Irvine, Irvine, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131427",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jessica S Ancker, Holly O Witteman, Baria Hafeez, Thierry Provencher, Mary Van de Graaf, and Esther Wei. 2015. \"You Get Reminded You're a Sick Person\": Personal Data Tracking and Patients With Multiple Chronic Conditions. Journal of Medical Internet Research 17, 8.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L. Cox. 2016. Reflections on 5 Years of Personal Informatics: Rising Concerns and Emerging Directions. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16), 2774--2781.  ",
      "doi": "10.1145/2851581.2892406"
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing Mobile Health Technology for Bipolar Disorder: A Field Trial of the Monarca System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 2627--2636.  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI Research: Going Behind the Scenes. Synthesis Lectures on Human-Centered Informatics 9, 1: 1--115. ",
      "doi": "10.5555/3019315"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Yunan Chen. 2010. Take It Personally: Accounting for Individual Difference in Designing Diabetes Management Systems. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10), 252--261.  ",
      "doi": "10.1145/1858171.1858218"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding Quantified-selfers' Practices in Collecting and Exploring Personal Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogarty. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 1159--1162.  ",
      "doi": "10.1145/2702123.2702155"
    },
    {
      "text": "A. L. Cox, J. Bird, and R. Fleck. 2013. Digital Epiphanies: how self-knowledge can change habits and our attitudes towards them. In Presented at: The 27th International British Computer Society Human Computer Interaction Conference: The Internet of things, Brunel University, London, UK. (2013). http://www.digitalepiphanies.org/publications.html",
      "doi": ""
    },
    {
      "text": "Andrea Döring, Caspar F. Pfueller, Friedemann Paul, and Jan Dörr. 2013. Exercise in Multiple Sclerosis -- An Integral Component of Disease Management. In Neurodegenerative Diseases: Integrative PPPM Approach as the Medicine of the Future, Silvia Mandel (ed.). Springer Netherlands, 277--299.",
      "doi": ""
    },
    {
      "text": "Martin Duddy, Martin Lee, Owen Pearson, Esmaeil Nikfekr, Abhijit Chaudhuri, Fran Percival, Megan Roberts, and Carolyn Whitlock. 2014. The UK patient experience of relapse in Multiple Sclerosis treated with first disease modifying therapies. Multiple Sclerosis and Related Disorders 3, 4: 450--456.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, and David S. Kirk. 2016. It's just my History isn't it?: Understanding Smart Journaling Practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 2819--2831.  ",
      "doi": "10.1145/2858036.2858103"
    },
    {
      "text": "Nikki Embrey. 2014. Multiple sclerosis: managing a complex neurological disease. Nursing Standard 29, 11: 49--58.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Jennifer H. Kang, Laura R. Pina, James Fogarty, and Sean A. Munson. 2016. Reconsidering the device in the drawer: lapses as a design opportunity in personal informatics. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 829--840.  ",
      "doi": "10.1145/2971648.2971656"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Ramesh Farzanfar, Sophie Frishkopf, Robert Friedman, and Kevin Ludena. 2007. Evaluating an automated mental health care system: making meaning of human--computer interaction. Computers in Human Behavior 23, 3: 1167--1182.  ",
      "doi": "10.1016/j.chb.2004.11.015"
    },
    {
      "text": "Sergio Felipe, Aneesha Singh, Caroline Bradley, Amanda CdeC Williams, and Nadia BianchiBerthouze. 2015. Roles for Personal Informatics in Chronic Pain. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (Pervasive Health '15), 161--168. http://dl.acm.org/citation.cfm?id=2826165.2826189 ",
      "doi": "10.5555/2826165.2826189"
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Bianchi Berthouze, and Jon Bird. 2015. Activity Tracking: Barriers, Workarounds and Customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 617--621.  ",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "Ravi Karkar, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia. 2015. Opportunities and Challenges for Self-experimentation in Self-tracking. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct), 991--996.  ",
      "doi": "10.1145/2800835.2800949"
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R. Mishra, James Fogarty, Sean A. Munson, and Julie A. Kientz. 2015. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association: ocv150.",
      "doi": ""
    },
    {
      "text": "Karina Kusk, Dorthe B. Nielsen, Troels Thylstrup, Niels Holm Rasmussen, Jacob Jorvang, Christian F. Pedersen, and Steffen Wagner. 2013. Feasibility of using a lightweight context-aware system for facilitating reliable home blood pressure self measurements. In Pervasive Computing Technologies for Healthcare (Pervasive Health), 2013 7th International Conference on, 236--239.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252107"
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why we use and abandon smart devices. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 635--646.  ",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-based Model of Personal Informatics Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Wanyu Liu, Bernd Ploderer, and Thuong Hoang. 2015. In Bed with Technology: Challenges and Opportunities for Sleep Tracking. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), 142--151.  ",
      "doi": "10.1145/2838739.2838742"
    },
    {
      "text": "Deborah Lupton and Annemarie Jutel. 2015. \"It's like having a physician in your pocket!\" A critical analysis of self-diagnosis smartphone apps. Social Science & Medicine 133: 128--135.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare world: Towards technology for rare diseases. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1145--1154.  ",
      "doi": "10.1145/2702123.2702494"
    },
    {
      "text": "Haley MacLeod, Anthony Tang, and Sheelagh Carpendale. 2013. Personal informatics in chronic illness management. In Proceedings of Graphics Interface 2013, 149--156. http://dl.acm.org/citation.cfm?id=2532155 ",
      "doi": "10.5555/2532129.2532155"
    },
    {
      "text": "Lena Mamykina, Andrew D. Miller, Elizabeth D. Mynatt, and Daniel Greenblatt. 2010. Constructing identities through storytelling in diabetes management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1203--1212. http://dl.acm.org/citation.cfm?id=1753507  ",
      "doi": "10.1145/1753326.1753507"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of Social Scaffolding for Reflective Thinking in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as experience. interactions 11, 5: 42--43.  ",
      "doi": "10.1145/1015530.1015549"
    },
    {
      "text": "James McIninch, Shoibal Datta, Pronabesh DasMahapatra, Emil Chiauzzi, Rishi Bhalerao, Alicia Spector, Sherrie Goldstein, Liz Morgan, and Jane Relton. 2015. Remote Tracking of Walking Activity in MS Patients in a Real-World Setting (P3.209). Neurology 84, 14 Supplement: P3.209.",
      "doi": ""
    },
    {
      "text": "Cecily Morrison, Peter Culmer, Helena Mentis, and Tamar Pincus. 2014. Vision-based body tracking: turning Kinect into a clinical tool. Disability and Rehabilitation: Assistive Technology: 1--5.",
      "doi": ""
    },
    {
      "text": "Joseph W. Newbold, Nadia Bianchi-Berthouze, Nicolas E. Gold, Ana Tajadura-Jiménez, and Amanda CdC Williams. 2016. Musically Informed Sonification for Chronic Pain Rehabilitation: Facilitating Progress & Avoiding Over-doing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 5698--5703.  ",
      "doi": "10.1145/2858036.2858302"
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Trans. Comput. Hum. Interact. 22, 6: 33:1--33:45.  ",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Johanna Renny Octavia, Karin Coninx, and Peter Feys. 2012. As i am not you: accommodating user diversity through adaptive rehabilitation training for multiple sclerosis patients. In Proceedings of the 24th Australian Computer-Human Interaction Conference, 424--432. http://dl.acm.org/citation.cfm?id=2414603  ",
      "doi": "10.1145/2414536.2414603"
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E. Blandford. 2015. Concealing or Revealing Mobile Medical Devices?: Designing for Onstage and Offstage Presentation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems, 1689--1698.  ",
      "doi": "10.1145/2702123.2702453"
    },
    {
      "text": "Francesco Pagnini, Katherine Bercovitz, and Ellen Langer. 2016. Perceived control and mindfulness: Implications for clinical practice. Journal of Psychotherapy Integration 26, 2: 91.",
      "doi": ""
    },
    {
      "text": "Sun Young Park and Yunan Chen. 2015. Individual and Social Recognition: Challenges and Opportunities in Migraine Management. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work; Social Computing (CSCW '15), 1540--1551.  ",
      "doi": "10.1145/2675133.2675248"
    },
    {
      "text": "Lukasz Piwek, David A. Ellis, Sally Andrews, and Adam Joinson. 2016. The Rise of Consumer Health Wearables: Promises and Barriers. PLOS Med 13, 2: e1001953.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal Tracking As Lived Informatics. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Layal Shammas, Tom Zentek, Birte von Haaren, Stefan Schlesinger, Stefan Hey, and Asarnusch Rashid. 2014. Home-based system for physical activity monitoring in patients with multiple sclerosis (Pilot study). BioMedical Engineering OnLine 13, 1: 1--15.",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2013. Design challenges for ubiquitous and personal computing in chronic disease care and patient empowerment: a case study rethinking diabetes self-monitoring. Personal and Ubiquitous Computing 18, 5: 1277--1290.  ",
      "doi": "10.1007/s00779-013-0707-6"
    },
    {
      "text": "Kenneth A. Wallston, Barbara Strudler Wallston, Shelton Smith, and Carolyn J. Dobbins. 1987. Perceived control and health. Current Psychology 6, 1: 5--25.",
      "doi": ""
    },
    {
      "text": "T. J. Yun, H. Y. Jeong, H. R. Lee, R. I. Arriaga, and G. D. Abowd. 2010. Assessing asthma management practices through in-home technology probes. In 2010 4th International Conference on Pervasive Computing Technologies for Healthcare, 1--9.",
      "doi": ""
    }
  ]
}