{
  "doi": "10.1145/3025453.3026002",
  "title": "Jackknife: A Reliable Recognizer with Few Samples and Many Modalities",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5850-5861",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Despite decades of research, there is yet no general rapid prototyping recognizer for dynamic gestures that can be trained with few samples, work with continuous data, and achieve high accuracy that is also modality-agnostic. To begin to solve this problem, we describe a small suite of accessible techniques that we collectively refer to as the Jackknife gesture recognizer. Our dynamic time warping based approach for both segmented and continuous data is designed to be a robust, go-to method for gesture recognition across a variety of modalities using only limited training samples. We evaluate pen and touch, Wii Remote, Kinect, Leap Motion, and sound-sensed gesture datasets as well as conduct tests with continuous data. Across all scenarios we show that our approach is able to achieve high accuracy, suggesting that Jackknife is a capable recognizer and good first choice for many endeavors.",
  "tags": [
    "user evaluation",
    "gesture customization",
    "dynamic time warping",
    "rapid prototyping",
    "gesture recognition"
  ],
  "authors": [
    {
      "name": "Eugene M. Taranta II",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89558635157",
      "orcid": "0000-0001-5615-2597"
    },
    {
      "name": "Amirreza Samiei",
      "institution": "University of Central Florda, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160792",
      "orcid": "missing"
    },
    {
      "name": "Mehran Maghoumi",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081148",
      "orcid": "missing"
    },
    {
      "name": "Pooya Khaloo",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159927",
      "orcid": "missing"
    },
    {
      "name": "Corey R. Pittman",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259189657",
      "orcid": "missing"
    },
    {
      "name": "Joseph J. LaViola Jr.",
      "institution": "University of Central Florida, Orlando, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283513",
      "orcid": "0000-0003-1186-4130"
    }
  ],
  "references": [
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2010. A Lightweight Multistroke Recognizer for User Interface Prototypes. In Proceedings of Graphics Interface 2010 (GI '10). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 245--252. ",
      "doi": "10.5555/1839214.1839258"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2012. $N-protractor: A Fast and Accurate Multistroke Recognizer. In Proceedings of Graphics Interface 2012 (GI '12). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 117--120. ",
      "doi": "10.5555/2305276.2305296"
    },
    {
      "text": "Anthony Bagnall, Aaron Bostrom, James Large, and Jason Lines. 2016. The Great Time Series Classification Bake Off: An Experimental Evaluation of Recently Proposed Algorithms. Extended Version. arXiv preprint arXiv:1602.01711 (2016).",
      "doi": ""
    },
    {
      "text": "Gustavo E.A.P.A. Batista, Xiaoyue Wang, and Eamonn J. Keogh. 2011. A Complexity-Invariant Distance Measure for Time Series. Chapter 60, 699--710.",
      "doi": ""
    },
    {
      "text": "Saša Bodiroža, Guillaume Doisy, and Verena Vanessa Hafner. 2013. Position-invariant, Real-time Gesture Recognition Based on Dynamic Time Warping. In Proceedings of the 8th ACM/IEEE International Conference on Human-robot Interaction (HRI '13). IEEE Press, Piscataway, NJ, USA, 87--88. ",
      "doi": "10.5555/2447556.2447580"
    },
    {
      "text": "Sait Celebi, Ali Selman Aydin, Talha Tarik Temiz, and Tarik Arici. 2013. Gesture Recognition using Skeleton Data with Weighted Dynamic Time Warping.. In VISAPP (1). 620--625.",
      "doi": ""
    },
    {
      "text": "Salman Cheema, Michael Hoffman, and Joseph J. LaViola Jr. 2013. 3D Gesture classification with linear acceleration and angular velocity sensing devices for video games. Entertainment Computing 4, 1 (2013), 11--24.",
      "doi": ""
    },
    {
      "text": "Heng Du and TszHang To. 2011. Hand gesture recognition using Kinect. Techical Report, Boston University (2011).",
      "doi": ""
    },
    {
      "text": "Chris Ellis, Syed Zain Masood, Marshall F. Tappen, Joseph J. Laviola, Jr., and Rahul Sukthankar. 2013. Exploring the Trade-off Between Accuracy and Observational Latency in Action Recognition. International Journal of Computer Vision 101, 3 (Feb. 2013), 420--436.  ",
      "doi": "10.1007/s11263-012-0550-7"
    },
    {
      "text": "Rafael Giusti and Gustavo E. A. P. A. Batista. 2013. An Empirical Comparison of Dissimilarity Measures for Time Series Classification. In Proceedings of the 2013 Brazilian Conference on Intelligent Systems (BRACIS '13). IEEE Computer Society, Washington, DC, USA, 82--88.  ",
      "doi": "10.1109/BRACIS.2013.22"
    },
    {
      "text": "Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. Soundwave: using the doppler effect to sense gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1911--1914.  ",
      "doi": "10.1145/2207676.2208331"
    },
    {
      "text": "Noor A. Ibraheem and Rafiqul Z. Khan. 2012. Survey on Various Gesture Recognition Technologies and Techniques. International Journal of Computer Applications 50, 7 (2012).",
      "doi": ""
    },
    {
      "text": "Eamonn Keogh and Chotirat Ann Ratanamahatana. 2005. Exact indexing of dynamic time warping. Knowledge and information systems 7, 3 (2005), 358--386.  ",
      "doi": "10.5555/2993953.2994027"
    },
    {
      "text": "Sven Kratz and Michael Rohs. 2010. The $3 recognizer: simple 3D gesture recognition on mobile devices. In Proceedings of the 15th international conference on Intelligent user interfaces. ACM, 419--420.  ",
      "doi": "10.1145/1719970.1720051"
    },
    {
      "text": "Sven Kratz and Michael Rohs. 2011. Protractor3D: a closed-form solution to rotation-invariant 3D gestures. In Proceedings of the 16th international conference on Intelligent User Interfaces. ACM, 371--374.  ",
      "doi": "10.1145/1943403.1943468"
    },
    {
      "text": "Joseph J LaViola. 2013. 3d gestural interaction: The state of the field. International Scholarly Research Notices 2013 (2013).",
      "doi": ""
    },
    {
      "text": "Yang Li. 2010. Protractor: A Fast and Accurate Gesture Recognizer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2169--2172.  ",
      "doi": "10.1145/1753326.1753654"
    },
    {
      "text": "Jiayang Liu, Lin Zhong, Jehan Wickramasuriya, and Venu Vasudevan. 2009. uWave: Accelerometer-based personalized gesture recognition and its applications. Pervasive and Mobile Computing 5, 6 (2009), 657--675. PerCom 2009.  ",
      "doi": "10.1016/j.pmcj.2009.07.007"
    },
    {
      "text": "Xiao-Hui Liu and Chin-Seng Chua. 2010. Rejection of non-meaningful activities for HMM-based activity recognition system. Image and Vision Computing 28, 6 (2010), 865--871.  ",
      "doi": "10.1016/j.imavis.2009.11.001"
    },
    {
      "text": "Robert Macrae and Simon Dixon. 2010. Accurate real-time windowed time warping. In in ISMIR, 2010. 423--428.",
      "doi": ""
    },
    {
      "text": "S. Mitra and T. Acharya. 2007. Gesture Recognition: A Survey. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 37, 3 (May 2007), 311--324.  ",
      "doi": "10.1109/TSMCC.2007.893280"
    },
    {
      "text": "Corey Pittman, Pamela Wisniewski, Conner Brooks, and Joseph J. LaViola Jr. 2016. Multiwave: Doppler Effect Based Gesture Recognition in Multiple Dimensions. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1729--1736.  ",
      "doi": "10.1145/2851581.2892286"
    },
    {
      "text": "Thanawin Rakthanmanon, Bilson Campana, Abdullah Mueen, Gustavo Batista, Brandon Westover, Qiang Zhu, Jesin Zakaria, and Eamonn Keogh. 2012. Searching and mining trillions of time series subsequences under dynamic time warping. In Proceedings of the 18th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 262--270.  ",
      "doi": "10.1145/2339530.2339576"
    },
    {
      "text": "Chotirat Ann Ratanamahatana and Eamonn Keogh. 2004. Everything you know about dynamic time warping is wrong. In Third Workshop on Mining Temporal and Sequential Data.",
      "doi": ""
    },
    {
      "text": "Siddharth S. Rautaray and Anupam Agrawal. 2015. Vision based hand gesture recognition for human computer interaction: a survey. Artificial Intelligence Review 43, 1 (2015), 1--54.  ",
      "doi": "10.1007/s10462-012-9356-9"
    },
    {
      "text": "Douglas A Reynolds, Thomas F Quatieri, and Robert B Dunn. 2000. Speaker verification using adapted Gaussian mixture models. Digital signal processing 10, 1 (2000), 19--41.  ",
      "doi": "10.1006/dspr.1999.0361"
    },
    {
      "text": "Wenjie Ruan, Quan Z Sheng, Lei Yang, Tao Gu, Peipei Xu, and Longfei Shangguan. 2016. AudioGest: enabling fine-grained hand gesture detection by decoding echo signal. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 474--485.  ",
      "doi": "10.1145/2971648.2971736"
    },
    {
      "text": "Dean Rubine. 1991. Specifying Gestures by Example. SIGGRAPH Computer Graphics 25, 4 (July 1991), 329--337.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "Hiroaki Sakoe and Seibi Chiba. 1978. Dynamic programming algorithm optimization for spoken word recognition. IEEE transactions on acoustics, speech, and signal processing 26, 1 (1978), 43--49.",
      "doi": ""
    },
    {
      "text": "Arpita R. Sarkar, G. Sanyal, and S. Majumder. 2013. Hand Gesture Recognition Systems: A Survey. International Journal of Computer Applications 71, 15 (2013).",
      "doi": ""
    },
    {
      "text": "J. Suarez and R. R. Murphy. 2012. Hand gesture recognition with depth images: A review. In 2012 IEEE RO-MAN: The 21st IEEE International Symposium on Robot and Human Interactive Communication. 411--417.",
      "doi": ""
    },
    {
      "text": "Eugene M. Taranta, II, Mehran Maghoumi, Corey R. Pittman, and Joseph J. LaViola, Jr. 2016. A Rapid Prototyping Approach to Synthetic Data Generation for Improved 2D Gesture Recognition. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 873--885.  ",
      "doi": "10.1145/2984511.2984525"
    },
    {
      "text": "Eugene M. Taranta II, Andrés N. Vargas, and Joseph J. LaViola Jr. 2016. Streamlined and accurate gesture recognition with Penny Pincher. Computers & Graphics 55 (2016), 130 -- 142.  ",
      "doi": "10.1016/j.cag.2015.10.011"
    },
    {
      "text": "Radu-Daniel Vatavu. 2011. The Effect of Sampling Rate on the Performance of Template-based Gesture Recognizers. In Proceedings of the 13th International Conference on Multimodal Interfaces (ICMI '11). ACM, New York, NY, USA, 271--278.  ",
      "doi": "10.1145/2070481.2070531"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2012. Gestures As Point Clouds: A $P Recognizer for User Interface Prototypes. In Proceedings of the 14th ACM International Conference on Multimodal Interaction (ICMI '12). ACM, New York, NY, USA, 273--280.  ",
      "doi": "10.1145/2388676.2388732"
    },
    {
      "text": "Sharad Vikram, Lei Li, and Stuart Russell. 2013. Writing and Sketching in the Air, Recognizing and Controlling on the Fly. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1179--1184.  ",
      "doi": "10.1145/2468356.2468567"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures Without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "J. Wu, J. Konrad, and P. Ishwar. 2013. Dynamic time warping for gesture-based user identification and authentication with Kinect. In 2013 IEEE International Conference on Acoustics, Speech and Signal Processing. 2371--2375.",
      "doi": ""
    },
    {
      "text": "Yaodong Zhang and James R Glass. 2011. An inner-product lower-bound estimate for dynamic time warping. In 2011 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP). IEEE, 5660--5663.",
      "doi": ""
    }
  ]
}