{
  "doi": "10.1145/3025453.3025995",
  "title": "A Simple Nod of the Head: The Effect of Minimal Robot Movements on Children's Perception of a Low-Anthropomorphic Robot",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "336-341",
  "year": 2017,
  "badges": [],
  "abstract": "In this note, we present minimal robot movements for robotic technology for children. Two types of minimal gaze movements were designed: social-gaze movements to communicate social engagement and deictic-gaze movements to communicate task-related referential information. In a two (social-gaze movements vs. none) by two (deictic-gaze movements vs. none) video-based study (n=72), we found that social-gaze movements significantly increased children's perception of animacy and likeability of the robot. Deictic-gaze and social-gaze movements significantly increased children's perception of helpfulness. Our findings show the compelling communicative power of social-gaze movements, and to a lesser extent deictic-gaze movements, and have implications for designers who want to achieve animacy, likeability and helpfulness with simple and easily implementable minimal robot movements. Our work contributes to human-robot interaction research and design by providing a first indication of the potential of minimal robot movements to communicate social engagement and helpful referential information to children.",
  "tags": [
    "human-robot interaction design",
    "non-anthropomorphic robot",
    "robot behavior",
    "children",
    "nonverbal communication"
  ],
  "authors": [
    {
      "name": "Cristina Zaga",
      "institution": "Universiteit Twente, Enschede, Overijssel, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658993011",
      "orcid": "missing"
    },
    {
      "name": "Roelof A.J. de Vries",
      "institution": "University of Twente, Enschede, Overijssel, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482640976",
      "orcid": "missing"
    },
    {
      "name": "Jamy Li",
      "institution": "University of Twente, Enschede, Overijssel, Netherlands",
      "img": "/do/10.1145/contrib-84458764957/rel-imgonly/fpe_200402_0611.jpg",
      "acmid": "84458764957",
      "orcid": "missing"
    },
    {
      "name": "Khiet P. Truong",
      "institution": "University of Twente, Enschede, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324494265",
      "orcid": "missing"
    },
    {
      "name": "Vanessa Evers",
      "institution": "University of Twente, Enschede, Netherlands",
      "img": "/do/10.1145/contrib-81100133286/rel-imgonly/vanessa-1.jpg",
      "acmid": "81100133286",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Edith K Ackermann. 2005. Playthings that do things: a young kid's incredibles!. In Proceedings of the 2005 conference on Interaction design and children. ACM, 1--8.",
      "doi": "10.1145/1109540.1109541"
    },
    {
      "text": "Sean Andrist, Bilge Mutlu, and Adriana Tapus. 2015. Look Like Me: Matching Robot Personality via Gaze to Increase Motivation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3603--3612. DOI: http://dx.doi.org/10.1145/2702123.2702592  ",
      "doi": "10.1145/2702123.2702592"
    },
    {
      "text": "Sean Andrist, Tomislav Pejsa, Bilge Mutlu, and Michael Gleicher. 2012. Designing Effective Gaze Mechanisms for Virtual Agents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 705--714. DOI: http://dx.doi.org/10.1145/2207676.2207777  ",
      "doi": "10.1145/2207676.2207777"
    },
    {
      "text": "Christoph Bartneck, Elizabeth Croft, and Dana Kulic. 2009. Measurement instruments for the anthropomorphism, animacy, likeability, perceived intelligence, and perceived safety of robots. International Journal of Social Robotics 1, 1 (2009), 71--81. DOI: http://dx.doi.org/10.1007/s12369-008-0001--3",
      "doi": "10.1007/s12369-008-0001-3"
    },
    {
      "text": "Tony Belpaeme, Paul Baxter, Joachim de Greeff, James Kennedy, Robin Read, Rosemarijn Looije, Mark Neerincx, Ilaria Baroni, and Mattia Coti Zelati. 2013. Child-Robot Interaction: Perspectives and Challenges. Springer International Publishing, Cham, 452--459. DOI: http://dx.doi.org/10.1007/978-3-319-02675-6_45  ",
      "doi": "10.1007/978-3-319-02675-6_45"
    },
    {
      "text": "Allison Bruce, Illah Nourbakhsh, and Reid Simmons. 2002. The role of expressiveness and attention in human-robot interaction. In Robotics and Automation, 2002. Proceedings. ICRA'02. IEEE International Conference on, Vol. 4. IEEE, 4138--4142. ",
      "doi": ""
    },
    {
      "text": "Álvaro Castro-González, Henny Admoni, and Brian Scassellati. 2016. Effects of form and motion on judgments of social robots's animacy, likability, trustworthiness and unpleasantness. International Journal of Human-Computer Studies 90 (2016), 27--38.  ",
      "doi": "10.1016/j.ijhcs.2016.02.004"
    },
    {
      "text": "David Feil-Seifer and Maja Matarić. 2008. Robot-assisted Therapy for Children with Autism Spectrum Disorders. In Proceedings of the 7th International Conference on Interaction Design and Children (IDC '08). ACM, New York, NY, USA, 49--52. DOI:http://dx.doi.org/10.1145/1463689.1463716  ",
      "doi": "10.1145/1463689.1463716"
    },
    {
      "text": "Ylva Fernaeus, Maria Håkansson, Mattias Jacobsson, and Sara Ljungblad. 2010. How Do You Play with a Robotic Toy Animal?: A Long-term Study of Pleo. In Proceedings of the 9th International Conference on Interaction Design and Children (IDC '10). ACM, New York, NY, USA, 39--48. DOI:http://dx.doi.org/10.1145/1810543.1810549  ",
      "doi": "10.1145/1810543.1810549"
    },
    {
      "text": "Julia Fink, Séverin Lemaignan, Pierre Dillenbourg, Philippe Rétornaz, Florian Vaussard, Alain Berthoud, Francesco Mondada, Florian Wille, and Karmen Franinović. 2014. Which Robot Behavior Can Motivate Children to Tidy Up Their Toys?: Design and Evaluation of \"Ranger\". In Proceedings of the 2014 ACM/IEEE International Conference on Human-robot Interaction (HRI '14). ACM, New York, NY, USA, 439--446. DOI: http://dx.doi.org/10.1145/2559636.2559659  ",
      "doi": "10.1145/2559636.2559659"
    },
    {
      "text": "Maia Garau, Mel Slater, Simon Bee, and Martina Angela Sasse. 2001. The Impact of Eye Gaze on Communication Using Humanoid Avatars. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 309--316. DOI: http://dx.doi.org/10.1145/365024.365121  ",
      "doi": "10.1145/365024.365121"
    },
    {
      "text": "Victor Girotto, Cecil Lozano, Kasia Muldner, Winslow Burleson, and Erin Walker. 2016. Lessons Learned from In-School Use of rTAG: A Robo-Tangible Learning Environment. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 919--930. DOI: http://dx.doi.org/10.1145/2858036.2858454  ",
      "doi": "10.1145/2858036.2858454"
    },
    {
      "text": "Guy Hoffman and Wendy Ju. 2014. Designing robots with movement in mind. Journal of Human-Robot Interaction 3, 1 (2014), 89--122. DOI: http://dx.doi.org/10.5898/JHRI.3.1.Hoffman ",
      "doi": "10.5898/JHRI.3.1.Hoffman"
    },
    {
      "text": "Sooyeon Jeong, Kristopher Dos Santos, Suzanne Graca, Brianna O'Connell, Laurel Anderson, Nicole Stenquist, Katie Fitzpatrick, Honey Goodenough, Deirdre Logan, Peter Weinstock, and Cynthia Breazeal. 2015. Designing a Socially Assistive Robot for Pediatric Care. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, New York, NY, USA, 387--390. DOI: http://dx.doi.org/10.1145/2771839.2771923  ",
      "doi": "10.1145/2771839.2771923"
    },
    {
      "text": "Carey Jewitt. 2012. An introduction to using video for research. (2012).",
      "doi": ""
    },
    {
      "text": "Susan C Johnson. 2003. Detecting agents. Philosophical Transactions of the Royal Society B: Biological Sciences 358, 1431 (2003), 549--559.",
      "doi": ""
    },
    {
      "text": "Peter H Kahn, Heather E Gary, and Solace Shen. 2013. Children's Social Relationships With Current and Near-Future Robots. Child Development Perspectives 7, 1 (2013), 32--37. DOI: http://dx.doi.org/10.1111/cdep.12011 ",
      "doi": ""
    },
    {
      "text": "Heather Knight and Reid Simmons. 2014. Expressive motion with x, y and theta: Laban effort features for mobile robots. In The 23rd IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 267--273.",
      "doi": ""
    },
    {
      "text": "Heather Knight, Ravenna Thielstrom, and Reid Simmons. 2016. Expressive path shape (swagger): Simple features that illustrate a robot's attitude toward its goal in real time. In Intelligent Robots and Systems (IROS), 2016 IEEE/RSJ International Conference on. IEEE, 1475--1482.",
      "doi": "10.1109/IROS.2016.7759240"
    },
    {
      "text": "Hagen Lehmann, Joan Saez-Pons, Dag Sverre Syrdal, and Kerstin Dautenhahn. 2015. In Good Company? Perception of Movement Synchrony of a Non-Anthropomorphic Robot. PloS one 10, 5 (2015), e0127747. DOI: http://dx.doi.org/10.1371/journal.pone.0127747 ",
      "doi": ""
    },
    {
      "text": "Daniel Leyzberg, Samuel Spaulding, Mariya Toneva, and Brian Scassellati. 2012. The physical presence of a robot tutor increases cognitive learning gains. (2012).",
      "doi": ""
    },
    {
      "text": "Manja Lohse, Niels van Berkel, Elisabeth MAG van Dijk, Michiel P Joosse, Daphne E Karreman, and Vanessa Evers. 2013. The influence of approach speed and functional noise on users' perception of a robot. In 2013 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 1670--1675. ",
      "doi": ""
    },
    {
      "text": "Panos Markopoulos, Janet C Read, Stuart MacFarlane, and Johanna Hoysniemi. 2008. Evaluating children's interactive products: principles and practices for interaction designers. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Masahiro Mori, Karl F MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics & Automation Magazine 19, 2 (2012), 98--100. ",
      "doi": ""
    },
    {
      "text": "Bilge Mutlu, Toshiyuki Shiwa, Takayuki Kanda, Hiroshi Ishiguro, and Norihiro Hagita. 2009. Footing in Human-robot Conversations: How Robots Might Shape Participant Roles Using Gaze Cues. In Proceedings of the 4th ACM/IEEE International Conference on Human Robot Interaction (HRI '09). ACM, New York, NY, USA, 61--68. DOI:http://dx.doi.org/10.1145/1514095.1514109  ",
      "doi": "10.1145/1514095.1514109"
    },
    {
      "text": "Sandra Y Okita and Daniel L Schwartz. 2006. Young children's understanding of animacy and entertainment robots. International Journal of Humanoid Robotics 3, 03 (2006), 393--412. ",
      "doi": ""
    },
    {
      "text": "David H Rakison and Diane Poulin-Dubois. 2001. Developmental origin of the animate-inanimate distinction. Psychological bulletin 127, 2 (2001), 209. DOI:http://dx.doi.org/10.1037/0033-2909.127.2.209 ",
      "doi": ""
    },
    {
      "text": "Janet C. Read, SJ MacFarlane, and Chris Casey. 2002. Endurability, engagement and expectations: Measuring children's fun. In Interaction design and children, Vol. 2. Shaker Publishing Eindhoven, 1--23.",
      "doi": ""
    },
    {
      "text": "Martin Saerbeck, Tom Schut, Christoph Bartneck, and Maddy D. Janse. 2010. Expressive Robots in Education: Varying the Degree of Social Supportive Behavior of a Robotic Tutor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1613--1622. DOI: http://dx.doi.org/10.1145/1753326.1753567  ",
      "doi": "10.1145/1753326.1753567"
    },
    {
      "text": "Leonhard Schilbach, Bert Timmermans, Vasudevi Reddy, Alan Costall, Gary Bente, Tobias Schlicht, and Kai Vogeley. 2013. Toward a second-person neuroscience. Behavioral and Brain Sciences 36, 04 (2013), 393--414. ",
      "doi": ""
    },
    {
      "text": "David Sirkin and Wendy Ju. 2014. Using embodied design improvisation as a design research tool. In Proceedings of the international conference on Human Behavior in Design (HBiD 2014), Ascona, Switzerland.",
      "doi": ""
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical Ottoman: How Robotic Furniture Offers and Withdraws Support. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). ACM, New York, NY, USA, 11--18. DOI: http://dx.doi.org/10.1145/2696454.2696461  ",
      "doi": "10.1145/2696454.2696461"
    },
    {
      "text": "Vasant Srinivasan and Leila Takayama. 2016. Help Me Please: Robot Politeness Strategies for Soliciting Help From Humans. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4945--4955.  ",
      "doi": "10.1145/2858036.2858217"
    },
    {
      "text": "Megan Strait, Cody Canning, and Matthias Scheutz. 2014. Let Me Tell You! Investigating the Effects of Robot Communication Strategies in Advice-giving Situations Based on Robot Appearance, Interaction Modality and Distance. In Proceedings of the 2014 ACM/IEEE International Conference on Human-robot Interaction (HRI '14). ACM, New York, NY, USA, 479--486. DOI: http://dx.doi.org/10.1145/2559636.2559670  ",
      "doi": "10.1145/2559636.2559670"
    },
    {
      "text": "Megan Strait, Lara Vujovic, Victoria Floerke, Matthias Scheutz, and Heather Urry. 2015. Too Much Humanness for Human-Robot Interaction: Exposure to Highly Humanlike Robots Elicits Aversive Responding in Observers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3593--3602. DOI: http://dx.doi.org/10.1145/2702123.2702415  ",
      "doi": "10.1145/2702123.2702415"
    },
    {
      "text": "Leila Takayama, Doug Dooley, and Wendy Ju. 2011. Expressing Thought: Improving Robot Readability with Animation Principles. In Proceedings of the 6th International Conference on Human-robot Interaction (HRI '11). ACM, New York, NY, USA, 69--76. DOI: http://dx.doi.org/10.1145/1957656.1957674  ",
      "doi": "10.1145/1957656.1957674"
    },
    {
      "text": "Michael Tomasello. 1999. The cultural ecology of young children's interactions with objects and artifacts. Ecological approaches to cognition: Essays in honor of Ulric Neisser (1999), 153--170.",
      "doi": ""
    },
    {
      "text": "Ryan Wistort. 2010. Only Robots on the Inside. interactions 17, 2 (March 2010), 72--74. DOI: http://dx.doi.org/10.1145/1699775.1699792  ",
      "doi": "10.1145/1699775.1699792"
    },
    {
      "text": "Sarah Woods, Kerstin Dautenhahn, and Joerg Schulz. 2004. The design space of robots: Investigating children's views. In Robot and Human Interactive Communication, 2004. ROMAN 2004. 13th IEEE International Workshop on. IEEE, 47--52.",
      "doi": ""
    },
    {
      "text": "Sarah N Woods, Michael L Walters, Kheng Lee Koay, and Kerstin Dautenhahn. 2006. Methodological issues in HRI: A comparison of live and video-based methods in robot to human approach direction trials. In ROMAN 2006-The 15th IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 51--58. DOI:http://dx.doi.org/10.1109/ROMAN.2006.314394 ",
      "doi": ""
    },
    {
      "text": "Selma Yilmazyildiz, Robin Read, Tony Belpeame, and Werner Verhelst. 2016. Review of Semantic-Free Utterances in Social Human--Robot Interaction. International Journal of Human-Computer Interaction 32, 1 (2016), 63--85. DOI: http://dx.doi.org/10.1080/10447318.2015.1093856 ",
      "doi": ""
    }
  ]
}