{
  "doi": "10.1145/3025453.3025808",
  "title": "Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3293-3315",
  "year": 2017,
  "badges": [],
  "abstract": "For more than two decades, capacitive sensing has played a prominent role in human-computer interaction research. Capacitive sensing has become ubiquitous on mobile, wearable, and stationary devices - enabling fundamentally new interaction techniques on, above, and around them. The research community has also enabled human position estimation and whole-body gestural interaction in instrumented environments. However, the broad field of capacitive sensing research has become fragmented by different approaches and terminology used across the various domains. This paper strives to unify the field by advocating consistent terminology and proposing a new taxonomy to classify capacitive sensing approaches. Our extensive survey provides an analysis and review of past research and identifies challenges for future work. We aim to create a common understanding within the field of human-computer interaction, for researchers and practitioners alike, and to stimulate and facilitate future research in capacitive sensing.",
  "authors": [
    {
      "name": "Tobias Grosse-Puppendahl",
      "institution": "Microsoft Research, Cambridge, United Kingdom & Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81500664021/rel-imgonly/img_9828_small.jpg",
      "acmid": "81500664021",
      "orcid": "missing"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Cambridge, United Kingdom & Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Gabe Cohn",
      "institution": "Microsoft Research, Cambridge, United Kingdom & Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470655150",
      "orcid": "missing"
    },
    {
      "name": "Raphael Wimmer",
      "institution": "University of Regensburg, Regensburg, Germany",
      "img": "/do/10.1145/contrib-81317502421/rel-imgonly/81317502421.jpg",
      "acmid": "81317502421",
      "orcid": "missing"
    },
    {
      "name": "Oskar Bechtold",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658724645",
      "orcid": "missing"
    },
    {
      "name": "Steve Hodges",
      "institution": "Microsoft Research, Cambridge, United Kingdom & Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320490166",
      "orcid": "0000-0001-9314-7762"
    },
    {
      "name": "Matthew S. Reynolds",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469264",
      "orcid": "missing"
    },
    {
      "name": "Joshua R. Smith",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-82659111457/rel-imgonly/josh127_v2_headshot.jpg",
      "acmid": "82659111457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fatemeh Aezinia, YiFan Wang, and Behraad Bahreyni. 2011. Touchless capacitive sensor for hand gesture detection. In IEEE SENSORS Proceedings. IEEE. DOI: http://dx.doi.org/10.1109/icsens.2011.6127321 ",
      "doi": ""
    },
    {
      "text": "Fatemeh Aezinia, Yifan Wang, and Behraad Bahreyni. 2012. Three dimensional touchless tracking of objects using integrated capacitive sensors. IEEE Transactions on Consumer Electronics 58, 3 (2012), 886--890. DOI: http://dx.doi.org/10.1109/tce.2012.6311332 ",
      "doi": ""
    },
    {
      "text": "Alireza Ramezani Akhmareh, Mihai Teodor Lazarescu, Osama Bin Tariq, and Luciano Lavagno. 2016. A Tagless Indoor Localization System Based on Capacitive Sensing Technology. Sensors 16(9) (2016).",
      "doi": ""
    },
    {
      "text": "Alan D. Aronoff. 1965. Electrostatic Means for Intrusion Detection and Ranging. Technical Report. National Technical Information System.",
      "doi": ""
    },
    {
      "text": "Atmel. 2016. mXTS220 maXStylus multiSense: One sensor to implement both a stylus and touch simultaneously. http://www.atmel.com/products/ touchsolutions/touchscreens/active_stylus.aspx. (2016). Accessed 2016-09--18.",
      "doi": ""
    },
    {
      "text": "Ryan Aylward and Joseph A. Paradiso. 2007. A Compact, High-Speed, Wearable Sensor Network for Biomotion Capture and Interactive Media. In 2007 6th International Symposium on Information Processing in Sensor Networks. IEEE. DOI: http://dx.doi.org/10.1109/ipsn.2007.4379698 ",
      "doi": ""
    },
    {
      "text": "Heribert Baldus, Steven Corroy, Alberto Fazzi, Karin Klabunde, and Tim Schenk. 2009. Human-centric connectivity enabled by body-coupled communications. IEEE Commun. Mag. 47, 6 (jun 2009), 172--178. DOI: http://dx.doi.org/10.1109/mcom.2009.5116816  ",
      "doi": "10.1109/mcom.2009.5116816"
    },
    {
      "text": "Rebecca Baldwin, Stan Bobovych, Ryan Robucci, Chintan Patel, and Nilanjan Banerjee. 2015. Gait analysis for fall prediction using hierarchical textile-based capacitive sensor arrays. In 2015 Design, Automation Test in Europe Conference Exhibition (DATE). 1293--1298. DOI: http://dx.doi.org/10.7873/DATE.2015.0943 ",
      "doi": ""
    },
    {
      "text": "Gary Barrett and Ryomei Omote. 2010. Projected-capacitive touch technology. Information Display 26, 3 (2010), 16--21.",
      "doi": ""
    },
    {
      "text": "Larry K. Baxter. 1997. Capacitive Sensors: Design and Applications. IEEE Press.",
      "doi": ""
    },
    {
      "text": "Frank Beck and Bent Stumpe. 1973. Two devices for operator interaction in the central control of the new CERN accelerator. Technical Report. CERN.",
      "doi": ""
    },
    {
      "text": "Ray Bittner and Mike Sinclair. 2009. VersaPatch: A Low Cost 2.5D Capacitive Touch Sensor. In Human-Computer Interaction. Novel Interaction Methods and Techniques. Springer Science + Business Media, 407--416. DOI: http://dx.doi.org/10.1007/978--3--642-02577--8_44",
      "doi": ""
    },
    {
      "text": "Florian Block, Hans Gellersen, and Nicolas Villar. 2010. Touch-display keyboards. In Proceedings of the 28th international conference on Human factors in computing systems CHI '10. ACM. DOI: http://dx.doi.org/10.1145/1753326.1753498  ",
      "doi": "10.1145/1753326.1753498"
    },
    {
      "text": "Andreas Braun and Pascal Hamisu. 2011. Designing a multi-purpose capacitive proximity sensing input device. In Proceedings of the 4th International Conference on PErvasive Technologies Related to Assistive Environments - PETRA '11. ACM. DOI: http://dx.doi.org/10.1145/2141622.2141641  ",
      "doi": "10.1145/2141622.2141641"
    },
    {
      "text": "Andreas Braun, Henning Heggen, and Reiner Wichert. 2012. CapFloor -- A Flexible Capacitive Indoor Localization System. In Evaluating AAL Systems Through Competitive Benchmarking. Indoor Localization and Tracking. Springer Science + Business Media, 26--35. DOI: http://dx.doi.org/10.1007/978--3--642--33533--4_3",
      "doi": ""
    },
    {
      "text": "Andreas Braun, Stefan Krepp, and Arjan Kuijper. 2015. Acoustic Tracking of Hand Activities on Surfaces. In Proceedings of the 2Nd International Workshop on Sensor-based Activity Recognition and Interaction (WOAR '15). ACM, Article 9, 5 pages. DOI: http://dx.doi.org/10.1145/2790044.2790052  ",
      "doi": "10.1145/2790044.2790052"
    },
    {
      "text": "Andreas Braun, Stephan Neumann, Sönke Schmidt, Reiner Wichert, and Arjan Kuijper. 2014. Towards interactive car interiors. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction Fun, Fast, Foundational - NordiCHI '14. ACM. DOI: http://dx.doi.org/10.1145/2639189.2670191  ",
      "doi": "10.1145/2639189.2670191"
    },
    {
      "text": "Leah Buechley, David Mellis, Hannah Perner-Wilson, Emily Lovell, and Bonifaz Kaufmann. 2010. Living wall. In Proceedings of the international conference on Multimedia - MM '10. ACM. DOI: http://dx.doi.org/10.1145/1873951.1874226  ",
      "doi": "10.1145/1873951.1874226"
    },
    {
      "text": "William Buller and Brian Wilson. 2006. Measuring the Capacitance of Electrical Wiring and Humans for Proximity Sensing with Existing Electrical Infrastructure. In 2006 IEEE International Conference on Electro/Information Technology. IEEE. DOI: http://dx.doi.org/10.1109/eit.2006.252172 ",
      "doi": ""
    },
    {
      "text": "Jesse Burstyn, Nicholas Fellion, Paul Strohmeier, and Roel Vertegaal. 2015. PrintPut: Resistive and Capacitive Input Widgets for Interactive 3D Prints. Springer International Publishing, Cham, 332--339. DOI: http://dx.doi.org/10.1007/978--3--319--22701--6_25",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2016. Multi-Touch Systems that I Have Known and Loved. (2016). http: //www.billbuxton.com/multitouchOverview.html [Online; accessed 21-September-2016].",
      "doi": ""
    },
    {
      "text": "Maria Amparo Callejon, David Naranjo-Hernandez, Javier Reina-Tosina, and Laura M Roa. 2013. A comprehensive study into intrabody communication measurements. IEEE Transactions on Instrumentation and Measurement 62, 9 (2013), 2446--2455. ",
      "doi": ""
    },
    {
      "text": "G.S.P. Castle. 1997. Contact charging between insulators. Journal of Electrostatics 40/41 (1997), 13--20. ",
      "doi": ""
    },
    {
      "text": "Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12. ACM. DOI:http://dx.doi.org/10.1145/2207676.2208371  ",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Wook Chang, Kee Kim, Hyunjeong Lee, Joon Cho, Byung Soh, Jung Shim, Gyunghye Yang, Sung jung Cho, and Joonah Park. 2006. Recognition of Grip-Patterns by Using Capacitive Touch Sensors. In 2006 IEEE International Symposium on Industrial Electronics. IEEE. DOI: http://dx.doi.org/10.1109/isie.2006.296083 ",
      "doi": ""
    },
    {
      "text": "Ranajit Chatterjee and Fumtoshi Matsuno. 2006. Design of A Touch Sensor Based Single Finger Operated Wearable User-Interface Terminal. In 2006 SICE-ICASE International Joint Conference. IEEE. DOI: http://dx.doi.org/10.1109/sice.2006.314614 ",
      "doi": ""
    },
    {
      "text": "Ranajit Chatterjee and Fumtoshi Matsuno. 2008. Capacitive touch sensor based user-interface : Generic design considerations and development of an wearable input device. In SICE Annual Conference, 2008. 2299--2303. DOI: http://dx.doi.org/10.1109/SICE.2008.4655048 ",
      "doi": ""
    },
    {
      "text": "Ke-Yu Chen, Gabe A. Cohn, Sidhant Gupta, and Shwetak N. Patel. 2013. uTouch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM. DOI: http://dx.doi.org/10.1145/2470654.2481356  ",
      "doi": "10.1145/2470654.2481356"
    },
    {
      "text": "Bernard Cheng, Antonio Gomes, Paul Strohmeier, and Roel Vertegaal. 2014. Mood fern. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology - ACE '14. ACM. DOI: http://dx.doi.org/10.1145/2663806.2663818  ",
      "doi": "10.1145/2663806.2663818"
    },
    {
      "text": "Jingyuan Cheng, Oliver Amft, and Paul Lukowicz. 2010. Active Capacitive Sensing: Exploring a New Wearable Sensing Modality for Activity Recognition. In Lecture Notes in Computer Science. Springer Science + Business Media, 319--336. DOI: http://dx.doi.org/10.1007/978--3--642--12654--3_19",
      "doi": ""
    },
    {
      "text": "Jingyuan Cheng and Paul Lukowicz. 2008. Towards wearable capacitive sensing of physiological parameters. In 2008 Second International Conference on Pervasive Computing Technologies for Healthcare. IEEE. DOI: http: //dx.doi.org/10.1109/pcthealth.2008.4571087 ",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Meng Han Lee, Che-Yang Wu, Fang-I Hsiao, Yen-Ting Liu, Hsiang-Sheng Liang, Yi-Ching Chiu, Ming-Sui Lee, and Mike Y. Chen. 2013a. IrotateGrasp. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM. DOI: http://dx.doi.org/10.1145/2470654.2481424  ",
      "doi": "10.1145/2470654.2481424"
    },
    {
      "text": "Lung-Pan Cheng, Hsiang-Sheng Liang, Che-Yang Wu, and Mike Y. Chen. 2013b. iGrasp. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM. DOI: http://dx.doi.org/10.1145/2470654.2481422  ",
      "doi": "10.1145/2470654.2481422"
    },
    {
      "text": "Namjun Cho, Jerald Yoo, Seong-Jun Song, Jeabin Lee, Seonghyun Jeon, and Hoi-Jun Yoo. 2007. The human body characteristics as a signal transmission medium for intrabody communication. IEEE transactions on microwave theory and techniques 55, 5 (2007), 1080--1086. ",
      "doi": ""
    },
    {
      "text": "Tanay Choudhary, Saurabh Kulkarni, and Pradyumna Reddy. 2015. A Braille-based mobile communication and translation glove for deaf-blind people. In 2015 International Conference on Pervasive Computing (ICPC). IEEE. DOI:http: //dx.doi.org/10.1109/pervasive.2015.7087033 ",
      "doi": ""
    },
    {
      "text": "Gabe Cohn, Sidhant Gupta, Tien-Jui Lee, Dan Morris, Joshua R. Smith, Matthew S. Reynolds, Desney S. Tan, and Shwetak N. Patel. 2012. An ultra-low-power human body motion sensor using static electric field sensing. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing - UbiComp '12. ACM. DOI: http://dx.doi.org/10.1145/2370216.2370233  ",
      "doi": "10.1145/2370216.2370233"
    },
    {
      "text": "Gabe Cohn, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. Humantenna. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12. ACM. DOI: http://dx.doi.org/10.1145/2207676.2208330  ",
      "doi": "10.1145/2207676.2208330"
    },
    {
      "text": "Gabe Cohn, Daniel Morris, Shwetak N. Patel, and Desney S. Tan. 2011. Your noise is my command. In Proceedings of the 2011 annual conference on Human factors in computing systems CHI '11. ACM. DOI: http://dx.doi.org/10.1145/1978942.1979058  ",
      "doi": "10.1145/1978942.1979058"
    },
    {
      "text": "Max Cremer. 1907. Ueber die Registrierung mechanischer Vorgänge auf electrischem Wege, speziell mit Hilfe des Saitengalvanometers und Saitenelectrometers. Münchner Medizinische Wochenschrift 54 (August 1907), 1629--1630.",
      "doi": ""
    },
    {
      "text": "Paul Dietz and Darren Leigh. 2001. DiamondTouch. In Proceedings of the 14th annual ACM symposium on User interface software and technology - UIST '01. ACM. DOI: http://dx.doi.org/10.1145/502348.502389  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Paul Dietz, Jonathan Westhues, John Barnwell, Jefferson Y. Han, and William Yerazunis. 2006. Submerging technologies. In ACM SIGGRAPH 2006 Emerging technologies on - SIGGRAPH '06. ACM. DOI:http://dx.doi.org/10.1145/1179133.1179164  ",
      "doi": "10.1145/1179133.1179164"
    },
    {
      "text": "Maxim Djakow, Andreas Braun, and Alexander Marinc. 2014. MoviBed - Sleep Analysis Using Capacitive Sensors. Springer International Publishing, Cham, 171--181. DOI: http://dx.doi.org/10.1007/978--3--319-07509--9_17",
      "doi": ""
    },
    {
      "text": "David Dobbelstein, Philipp Hock, and Enrico Rukzio. 2015. Belt. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15. ACM. DOI: http://dx.doi.org/10.1145/2702123.2702450  ",
      "doi": "10.1145/2702123.2702450"
    },
    {
      "text": "Collin B. Eaker and Michael D. Dickey. 2015. Liquid metals as ultra-stretchable, soft, and shape reconfigurable conductors. In SPIE Defense+ Security. International Society for Optics and Photonics, 946708--946708.",
      "doi": ""
    },
    {
      "text": "H. M. Elfekey and H. A. Bastawrous. 2013. Design and implementation of a new thin cost effective AC hum based touch sensing keyboard. In 2013 IEEE International Conference on Consumer Electronics (ICCE). IEEE. DOI: http://dx.doi.org/10.1109/icce.2013.6487036 ",
      "doi": ""
    },
    {
      "text": "Christoph Endres, Tim Schwartz, and Christian A. Müller. 2011. Geremin?. In Proceedings of the 15th international conference on Intelligent user interfaces IUI '11. ACM. DOI: http://dx.doi.org/10.1145/1943403.1943457  ",
      "doi": "10.1145/1943403.1943457"
    },
    {
      "text": "T. Ficker. 2006. Electrification of human body by walking. Journal of Electrostatics 64 (2006), 10--16. ",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Micah Johnson, Edward Adelson, and Hiroshi Ishii. 2011. deForm. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11. ACM. DOI: http://dx.doi.org/10.1145/2047196.2047265  ",
      "doi": "10.1145/2047196.2047265"
    },
    {
      "text": "Kenneth R Foster and Henry C Lukaski. 1996. Whole-body impedance--what does it measure? The American journal of clinical nutrition 64, 3 (1996), 388S--396S.",
      "doi": ""
    },
    {
      "text": "Masaaki Fukumoto and Mitsuru Shinagawa. 2005. CarpetLAN: A Novel Indoor Wireless(-like) Networking and Positioning System. In Lecture Notes in Computer Science. Springer Science + Business Media, 1--18. DOI:http://dx.doi.org/10.1007/11551201_1  ",
      "doi": "10.1007/11551201_1"
    },
    {
      "text": "S. Gabriel, R.W. Lau, and C. Gabriel. 1996. The dielectric properties of biological tissues: II. Measurements in the frequency range 10 Hz to 20 GHz. Physics in Medicine and Biology 41, 11 (1996), 2251--2269. ",
      "doi": ""
    },
    {
      "text": "Steven Gelineck, Dan Overholt, Morten Büchert, and Jesper Andersen. 2013. Towards an Interface for Music Mixing based on Smart Tangibles and Multitouch. In New Interfaces for Musical Expression. Association for Computing Machinery.",
      "doi": ""
    },
    {
      "text": "E.R. Generazio. 2015. Electric Potential and Electric Field Imaging with Applications. Materials Evaluation 73, 11 (Nov. 2015).",
      "doi": ""
    },
    {
      "text": "Boby George, Hubert Zangl, and Thomas Bretterklieber. 2009. Seat Occupancy Detection Based on Capacitive Sensing. IEEE Trans. Instrum. Meas. 58, 5 (may 2009), 1487--1494. DOI: http://dx.doi.org/10.1109/tim.2009.2009411 ",
      "doi": ""
    },
    {
      "text": "Boby George, Hubert Zangl, Thomas Bretterklieber, and Georg Brasseur. 2010. A Combined Inductive--Capacitive Proximity Sensor for Seat Occupancy Detection. IEEE Trans. Instrum. Meas. 59, 5 (may 2010), 1463--1470. DOI: http://dx.doi.org/10.1109/tim.2010.2040910 ",
      "doi": ""
    },
    {
      "text": "Albert Glinsky. 2000. Theremin: Ether Music and Espionage. University of Illinois Press. http://books.google.de/books?id=6DHlQJcMpBQC",
      "doi": ""
    },
    {
      "text": "Nan-Wei Gong, Steve Hodges, and Joseph A. Paradiso. 2011. Leveraging conductive inkjet technology to build a scalable and versatile surface for ubiquitous sensing. In Proceedings of the 13th international conference on Ubiquitous computing - UbiComp '11. ACM. DOI: http://dx.doi.org/10.1145/2030112.2030120  ",
      "doi": "10.1145/2030112.2030120"
    },
    {
      "text": "Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Edward Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14. ACM. DOI:http://dx.doi.org/10.1145/2556288.2557173  ",
      "doi": "10.1145/2556288.2557173"
    },
    {
      "text": "Nan-Wei Gong, Nan Zhao, and Joseph A. Paradiso. 2011. A Customizable Sensate Surface for Music Control. In Proceedings NIME'11 (NIME'11).",
      "doi": ""
    },
    {
      "text": "Daniel Gotsch, Xujing Zhang, Jesse Burstyn, and Roel Vertegaal. 2016. HoloFlex: A Flexible Holographic Smartphone with Bend Input. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, 3675--3678. DOI: http://dx.doi.org/10.1145/2851581.2890258  ",
      "doi": "10.1145/2851581.2890258"
    },
    {
      "text": "Daniel Groeger, Elena Chong Loo, and Jürgen Steimle. 2016. HotFlex: Post-print Customization of 3D Prints Using Embedded State Change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 420--432. DOI: http://dx.doi.org/10.1145/2858036.2858191  ",
      "doi": "10.1145/2858036.2858191"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Sebastian Beck, and Daniel Wilbers. 2014a. Rainbowfish. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems CHI EA '14. ACM. DOI: http://dx.doi.org/10.1145/2559206.2574787  ",
      "doi": "10.1145/2559206.2574787"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Sebastian Beck, Daniel Wilbers, Steeven Zeiß, Julian von Wilmsdorff, and Arjan Kuijper. 2014b. Ambient Gesture-Recognizing Surfaces with Visual Feedback. In Distributed, Ambient, and Pervasive Interactions. Springer Science + Business Media, 97--108. DOI: http://dx.doi.org/10.1007/978--3--319-07788--8_10",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Yannick Berghoefer, Andreas Braun, Raphael Wimmer, and Arjan Kuijper. 2013. OpenCapSense: A rapid prototyping toolkit for pervasive interaction using capacitive sensing. In 2013 IEEE International Conference on Pervasive Computing and Communications (PerCom). IEEE. DOI: http://dx.doi.org/10.1109/percom.2013.6526726 ",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Eugen Berlin, and Marko Borazio. 2012. Enhancing Accelerometer-Based Activity Recognition with Capacitive Proximity Sensing. In Ambient Intelligence. Lecture Notes in Computer Science, Vol. 7683. Springer Berlin Heidelberg, 17--32. DOI: http://dx.doi.org/10.1007/978--3--642--34898--3_2",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Andreas Braun, Felix Kamieth, and Arjan Kuijper. 2013. Swiss-cheese extended. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. ACM. DOI:http://dx.doi.org/10.1145/2470654.2466186  ",
      "doi": "10.1145/2470654.2466186"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Xavier Dellangnol, Christian Hatzfeld, Biying Fu, Mario Kupnik, Arjan Kuijper, Matthias R. Hastall, James Scott, and Marco Gruteser. 2016. Platypus: Indoor Localization and Identification Through Sensing of Electric Potential Changes in Human Bodies. In Proceedings of the 14th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '16). ACM, 17--30. DOI:http://dx.doi.org/10.1145/2906388.2906402  ",
      "doi": "10.1145/2906388.2906402"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Sebastian Herber, Raphael Wimmer, Frank Englert, Sebastian Beck, Julian von Wilmsdorff, Reiner Wichert, and Arjan Kuijper. 2014. Capacitive near-field communication for ubiquitous interaction and perception. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '14 Adjunct. ACM. DOI:http://dx.doi.org/10.1145/2632048.2632053  ",
      "doi": "10.1145/2632048.2632053"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Alexander Marinc, and Andreas Braun. 2011. Classification of User Postures with Capacitive Proximity Sensors in AAL-Environments. In Lecture Notes in Computer Science. Springer Science + Business Media, 314--323. DOI: http://dx.doi.org/10.1007/978--3--642--25167--2_43",
      "doi": ""
    },
    {
      "text": "Enric Guaus, Tan Hakan Ozaslan, Eric Palacios, and Josep Lluis Arcos. 2010. A Left Hand Gesture Caption System for Guitar Based on Capacitive Sensors. In International Conference on New Interfaces for Musical Expression (NIME). 238--243.",
      "doi": ""
    },
    {
      "text": "ICNIRP Guideline. 1998. Guidelines for limiting exposure to time-varying electric, magnetic, and electromagnetic fields (up to 300 GHz). Health Phys 74, 4 (1998), 494--522.",
      "doi": ""
    },
    {
      "text": "Sidhant Gupta, Ke-Yu Chen, Matthew S. Reynolds, and Shwetak N. Patel. 2011. LightWave. In Proceedings of the 13th international conference on Ubiquitous computing - UbiComp '11. ACM. DOI: http://dx.doi.org/10.1145/2030112.2030122  ",
      "doi": "10.1145/2030112.2030122"
    },
    {
      "text": "Iman Habib, Niklas Berggren, Erik Rehn, Gustav Josefsson, Andreas Kunz, and Morten Fjeld. 2009. DGTS: Integrated Typing and Pointing. In Human-Computer Interaction -- INTERACT 2009. Springer Science + Business Media, 232--235. DOI: http://dx.doi.org/10.1007/978--3--642-03658--3_30",
      "doi": ""
    },
    {
      "text": "Keisuke Hachisuka, Yusuke Terauchi, Yoshinori Kishi, Ken Sasaki, Terunao Hirota, Hiroshi Hosaka, Katsuyuki Fujii, Masaharu Takahashi, and Koichi Ito. 2006. Simplified circuit modeling and fabrication of intrabody communication devices. Sensors and Actuators A: Physical 130--131 (aug 2006), 322--330. DOI: http://dx.doi.org/10.1016/j.sna.2006.04.044 ",
      "doi": ""
    },
    {
      "text": "Marian Haescher, Denys J. C. Matthies, Gerald Bieber, and Bodo Urban. 2015. CapWalk: A Capacitive Recognition of Walking-based Activities As a Wearable Assistive Technology. In Proceedings of the 8th ACM International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '15). ACM, Article 35, 8 pages. DOI: http://dx.doi.org/10.1145/2769493.2769500  ",
      "doi": "10.1145/2769493.2769500"
    },
    {
      "text": "Marius Hagan and Horia-Nicolai Teodorescu. 2013. Intelligent clothes with a network of painted sensors. In 2013 E-Health and Bioengineering Conference (EHB). IEEE. DOI: http://dx.doi.org/10.1109/ehb.2013.6707390 ",
      "doi": ""
    },
    {
      "text": "Jaehyun Han, Jiseong Gu, and Geehyuk Lee. 2014. Trampoline: A Double-sided Elastic Touch Device for Creating Reliefs. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 383--388. DOI: http://dx.doi.org/10.1145/2642918.2647381  ",
      "doi": "10.1145/2642918.2647381"
    },
    {
      "text": "Seungju Han and Joonah Park. 2013. Grip-Ball: A spherical multi-touch interface for interacting with virtual worlds. In 2013 IEEE International Conference on Consumer Electronics (ICCE). IEEE. DOI: http://dx.doi.org/10.1109/icce.2013.6487035 ",
      "doi": ""
    },
    {
      "text": "C. J. Harland, T. D. Clark, and R. J. Prance. 2002. Electric potential probes - new directions in the remote sensing of the human body. Measurement Science and Technology 13, 2 (2002), 163. http://stacks.iop.org/0957-0233/13/i=2/a=304",
      "doi": ""
    },
    {
      "text": "Chris Harrison, Munehiko Sato, and Ivan Poupyrev. 2012. Capacitive fingerprinting. In Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST '12. ACM. DOI: http://dx.doi.org/10.1145/2380116.2380183  ",
      "doi": "10.1145/2380116.2380183"
    },
    {
      "text": "Takahiro Hashizume, Takuya Sasatani, Koya Narumi, Yoshiaki Narusue, Yoshihiro Kawahara, and Tohru Asami. 2016. Passive and Contactless Epidermal Pressure Sensor Printed with Silver Nano-particle Ink. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, 190--195. DOI: http://dx.doi.org/10.1145/2971648.2971705  ",
      "doi": "10.1145/2971648.2971705"
    },
    {
      "text": "Yuki Hayashida, Ryo Sugiyama, Yusuke Ido, Akito Suzuki, Yasuaki Takizawa, Mitsuru Shinagawa, Yuichi Kado, and Nozomi Haga. 2014. Capacitance Model of Embedded Transciever for Intra-body Communication. In Proceedings of the 9th International Conference on Body Area Networks. Institute for Computer Sciences, Social Informatics and Telecommunications Engineering (ICST). DOI:http: //dx.doi.org/10.4108/icst.bodynets.2014.258238  ",
      "doi": "10.4108/icst.bodynets.2014.258238"
    },
    {
      "text": "Junwen He, Ralph G Nuzzo, and John A Rogers. 2015. Inorganic materials and assembly techniques for flexible and stretchable electronics. Proc. IEEE 103, 4 (2015), 619--632. ",
      "doi": ""
    },
    {
      "text": "W. Heiligenberg. 1977. Principles of electrolocation and jamming avoidance in electric fish: a neuroethological approach. Springer-Verlag. http://books.google.de/books?id=cKpqAAAAMAAJ",
      "doi": ""
    },
    {
      "text": "Mehrdad Hessar, Vikram Iyer, and Shyamnath Gollakota. 2016. Enabling On-body Transmissions with Commodity Devices. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, 1100--1111. DOI: http://dx.doi.org/10.1145/2971648.2971682  ",
      "doi": "10.1145/2971648.2971682"
    },
    {
      "text": "Ken Hinckley, William Buxton, Seongkook Heo, Michel Pahud, Christian Holz, Hrvoje Benko, Abigail Sellen, Richard Banks, Kenton O'Hara, and Gavin Smyth. 2016. Pre-Touch Sensing for Mobile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI '16. ACM. DOI: http://dx.doi.org/10.1145/2858036.2858095  ",
      "doi": "10.1145/2858036.2858095"
    },
    {
      "text": "Ken Hinckley and Mike Sinclair. 1999. Touch-sensing input devices. In Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit CHI '99. ACM. DOI: http://dx.doi.org/10.1145/302979.303045  ",
      "doi": "10.1145/302979.303045"
    },
    {
      "text": "Ken Hinckley, Andrew Wilson, Michel Pahud, Hrvoje Benko, Pourang Irani, Francçois Guimbreti'ere, Marcel Gavriliu, Xiang 'Anthony' Chen, Fabrice Matulic, and William Buxton. 2014. Sensing techniques for tablet+stylus interaction. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14. ACM. DOI: http://dx.doi.org/10.1145/2642918.2647379  ",
      "doi": "10.1145/2642918.2647379"
    },
    {
      "text": "Shigeyuki Hirai, Yoshinobu Sakakibara, and Hironori Hayashi. 2013. Enabling Interactive Bathroom Entertainment Using Embedded Touch Sensors in the Bathtub. In Lecture Notes in Computer Science. Springer Science + Business Media, 544--547. DOI: http://dx.doi.org/10.1007/978--3--319-03161--3_49",
      "doi": ""
    },
    {
      "text": "Nguyen Huy Hoang Huy, Gihan Hettiarachchi, Youngki Lee, and Rajesh Krishna Balan. 2016. Small Scale Deployment of Seat Occupancy Detectors. In Proceedings of the 3rd International on Workshop on Physical Analytics (WPA '16). ACM, 25--30. DOI: http://dx.doi.org/10.1145/2935651.2935660  ",
      "doi": "10.1145/2935651.2935660"
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit stickers. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14. ACM. DOI: http://dx.doi.org/10.1145/2556288.2557150  ",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Paul Holleis, Albrecht Schmidt, Susanna Paasovaara, Arto Puikkonen, and Jonna Häkkilä. 2008. Evaluating capacitive touch input on clothes. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services MobileHCI '08. ACM. DOI: http://dx.doi.org/10.1145/1409240.1409250  ",
      "doi": "10.1145/1409240.1409250"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2010. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 581--590. DOI: http://dx.doi.org/10.1145/1753326.1753413  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Christian Holz and Frank R. Bentley. 2016. On-Demand Biometrics: Fast Cross-Device Authentication. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3761--3766. DOI: http://dx.doi.org/10.1145/2858036.2858139  ",
      "doi": "10.1145/2858036.2858139"
    },
    {
      "text": "Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15. ACM. DOI: http://dx.doi.org/10.1145/2702123.2702518  ",
      "doi": "10.1145/2702123.2702518"
    },
    {
      "text": "Christian Holz, Tovi Grossman, George Fitzmaurice, and Anne Agur. 2012. Implanted User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 503--512. DOI: http://dx.doi.org/10.1145/2207676.2207745  ",
      "doi": "10.1145/2207676.2207745"
    },
    {
      "text": "Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology UIST '15. ACM. DOI: http://dx.doi.org/10.1145/2807442.2807458  ",
      "doi": "10.1145/2807442.2807458"
    },
    {
      "text": "Cindy Hsin-Liu Kao, Christian Holz, Asta Roseway, Andres Calvo, and Chris Schmandt. 2016. DuoSkin: Rapidly Prototyping On-Skin User Interfaces Using Skin-Friendly Materials. In Proceedings of the International Symposium on Wearable Computers 2016 (ISWC'16) (ISWC'16). ACM.",
      "doi": ""
    },
    {
      "text": "Manh Huynh, Phuc Nguyen, Marco Gruteser, and Tam Vu. 2015. POSTER: Mobile Device Identification by Leveraging Built-in Capacitive Signature. In Proceedings of the 22Nd ACM SIGSAC Conference on Computer and Communications Security (CCS '15). ACM, 1635--1637. DOI: http://dx.doi.org/10.1145/2810103.2810118  ",
      "doi": "10.1145/2810103.2810118"
    },
    {
      "text": "J. H. Hwang, T. W. Kang, and S. W. Kang. 2011. Measurement results of human body's signal loss with multiple subjects for human body communication. In 2011 IEEE International Symposium on Antennas and Propagation (APSURSI). IEEE. DOI: http://dx.doi.org/10.1109/aps.2011.5996624 ",
      "doi": ""
    },
    {
      "text": "Kohei Ikeda and Koji Tsukada. 2015. CapacitiveMarker. In Proceedings of the 6th Augmented Human International Conference on - AH '15. ACM. DOI:http://dx.doi.org/10.1145/2735711.2735783  ",
      "doi": "10.1145/2735711.2735783"
    },
    {
      "text": "ISO 10012--1:1992-01 1992. ISO/TC 176/SC 3. Quality assurance requirements for measuring equipment - Part 1: Metrological confirmation system for measuring equipment (ISO 10012--1:1992-01, withdrawn). (1992).",
      "doi": ""
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Artem Dementyev, Joseph A. Paradiso, and Chris Schmandt. 2015. NailO. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems CHI '15. ACM. DOI:http://dx.doi.org/10.1145/2702123.2702572  ",
      "doi": "10.1145/2702123.2702572"
    },
    {
      "text": "N. Karlsson, B. Karlsson, and P. Wide. A glove equipped with finger flexion sensors as a command generator used in a fuzzy control system. In IMTC/98 Conference Proceedings. IEEE Instrumentation and Measurement Technology Conference (Cat. No.98CH36222). IEEE. DOI: http://dx.doi.org/10.1109/imtc.1998.679825 ",
      "doi": ""
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant inkjet circuits. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing - UbiComp '13. ACM. DOI: http://dx.doi.org/10.1145/2493432.2493486  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Behailu Kibret, MirHojjat Seyedi, Daniel T. H. Lai, and Micheal Faulkner. 2014. Investigation of Galvanic-Coupled Intrabody Communication Using the Human Body Circuit Model. IEEE Journal of Biomedical and Health Informatics 18, 4 (jul 2014), 1196--1206. DOI: http://dx.doi.org/10.1109/jbhi.2014.2301165 ",
      "doi": ""
    },
    {
      "text": "Kee-Eung Kim, Wook Chang, Sung-Jung Cho, Junghyun Shim, Hyunjeong Lee, Joonah Park, Youngbeom Lee, and Sangryong Kim. 2006. Hand Grip Pattern Recognition for Mobile User Interfaces. In Proceedings of the 18th Conference on Innovative Applications of Artificial Intelligence - Volume 2 (IAAI'06). AAAI Press, 1789--1794. http: //dl.acm.org/citation.cfm?id=1597122.1597138",
      "doi": "10.5555/1597122.1597138"
    },
    {
      "text": "Sangkil Kim, Yoshihiro Kawahara, Apostolos Georgiadis, Ana Collado, and Manos M. Tentzeris. 2013. Low-cost inkjet-printed fully passive RFID tags using metamaterial-inspired antennas for capacitive sensing applications. In 2013 IEEE MTT-S International Microwave Symposium Digest (MTT). IEEE. DOI: http://dx.doi.org/10.1109/mwsym.2013.6697644 ",
      "doi": ""
    },
    {
      "text": "Yuhwan Kim, Seungchul Lee, Inseok Hwang, Hyunho Ro, Youngki Lee, Miri Moon, and Junehwa Song. 2014. High5. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '14 Adjunct. ACM. DOI: http://dx.doi.org/10.1145/2632048.2632072  ",
      "doi": "10.1145/2632048.2632072"
    },
    {
      "text": "Sauli Kivikunnas, Esko Strommer, Marko Korkalainen, Tapio Heikkila, and Mikko Haverinen. 2010. Sensing sofa and its ubiquitous use. In 2010 International Conference on Information and Communication Technology Convergence (ICTC). IEEE. DOI: http://dx.doi.org/10.1109/ictc.2010.5674767 ",
      "doi": ""
    },
    {
      "text": "Tero Kivimaki, Timo Vuorela, Miika Valtonen, and Jukka Vanhala. 2013. Reliability of the TileTrack capacitive user tracking system in smart home environment. In ICT 2013. IEEE. DOI: http://dx.doi.org/10.1109/ictel.2013.6632162 ",
      "doi": ""
    },
    {
      "text": "Heather Knight, Jae-Kyu Lee, and Hongshen Ma. 2008. Chair Alarm for patient fall prevention based on Gesture Recognition and Interactivity. In 2008 30th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE. DOI: http://dx.doi.org/10.1109/iembs.2008.4650012 ",
      "doi": ""
    },
    {
      "text": "Sven Kratz, Tilo Westermann, Michael Rohs, and Georg Essl. 2011. CapWidgets: Tangible Widgets Versus Multi-touch Controls on Mobile Devices. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, 1351--1356. DOI: http://dx.doi.org/10.1145/1979742.1979773  ",
      "doi": "10.1145/1979742.1979773"
    },
    {
      "text": "Paul G. Kry and D. K. Pai. 2006. Grasp recognition and manipulation with the tango. In International Symposium on Experimental Robotics, Vol. 10. Springer.",
      "doi": ""
    },
    {
      "text": "K. Kurita. 2010. New Approach to Touch Sensing Technique Based on Measurement of Current Generated by Electrostatic Induction. In iSAIRAS.",
      "doi": ""
    },
    {
      "text": "K. Kurita, R. Takizawa, and H. Kumon. 2009. Detection of human walking motion based on measurement system of current generated by electrostatic induction. In ICCAS-SICE, 2009. 5485--5488.",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Chouchang Yang, Robert Xiao, Alanson Sample, and Chris Harrison. 2015. EM-Sense: Touch Recognition of Uninstrumented, Electrical and Electromechanical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, 157--166. DOI: http://dx.doi.org/10.1145/2807442.2807481  ",
      "doi": "10.1145/2807442.2807481"
    },
    {
      "text": "Mathieu Le Goc, Pierre Dragicevic, Samuel Huron, Jeremy Boy, and Jean-Daniel Fekete. 2015. SmartTokens: Embedding Motion and Grip Sensing in Small Tangible Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, 357--362. DOI: http://dx.doi.org/10.1145/2807442.2807488  ",
      "doi": "10.1145/2807442.2807488"
    },
    {
      "text": "Mathieu Le Goc, Stuart Taylor, Shahram Izadi, and Cem Keskin. 2014. A low-cost transparent electric field sensor for 3d interaction on mobile devices. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14. ACM. DOI:http://dx.doi.org/10.1145/2556288.2557331  ",
      "doi": "10.1145/2556288.2557331"
    },
    {
      "text": "Chia-Hsun Lee and Ted Selker. 2004. iSphere: A Proximity-based 3D Input Device. In ACM SIGGRAPH 2004 Posters (SIGGRAPH '04). ACM, 72--. DOI: http://dx.doi.org/10.1145/1186415.1186499  ",
      "doi": "10.1145/1186415.1186499"
    },
    {
      "text": "S. K. Lee, W. Buxton, and K. C. Smith. 1985. A Multi-touch Three Dimensional Touch-sensitive Tablet. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '85). ACM, 21--25. DOI:http://dx.doi.org/10.1145/317456.317461  ",
      "doi": "10.1145/317456.317461"
    },
    {
      "text": "Darren Leigh, Clifton Forlines, Ricardo Jota, Steven Sanders, and Daniel Wigdor. 2014. High Rate, Low-latency Multi-touch Sensing with Simultaneous Orthogonal Multiplexing. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 355--364. DOI: http://dx.doi.org/10.1145/2642918.2647353  ",
      "doi": "10.1145/2642918.2647353"
    },
    {
      "text": "Simon J. Leigh, Robert J. Bradley, Christopher P. Purssell, Duncan R. Billson, and David A. Hutchins. 2012. A Simple, Low-Cost Conductive Composite Material for 3D Printing of Electronic Sensors. PLoS ONE 7, 11 (11 2012), 1--6. DOI: http://dx.doi.org/10.1371/journal.pone.0049365 ",
      "doi": ""
    },
    {
      "text": "Hanchuan Li, Eric Brockmeyer, Elizabeth J. Carter, Josh Fromm, Scott E. Hudson, Shwetak N. Patel, and Alanson Sample. 2016. PaperID: A Technique for Drawing Functional Battery-Free Wireless Interfaces on Paper. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16",
      "doi": "10.1145/2858036.2858249"
    }
  ]
}