{
  "doi": "10.1145/3025453.3025590",
  "title": "Designing Digital Mindfulness: Presence-In and Presence-With versus Presence-Through",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2685-2695",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The digital health and wellbeing movement has led to development of digital mindfulness applications that aim to help people to become mindful. In this paper we suggest a broad scheme for classifying and ordering apps intended to support mindfulness. This scheme consists of four levels of what we here term digital mindfulness. One crucial aspect of the fourth level is that artifacts at this level allow for what we term as presence-with and presence-in as opposed to presence-through, which occurs at the first three levels. We articulate our four levels along with specific design qualities through concrete examples of existing mindfulness apps and through research through design (RtD) work conducted with design fiction examples. We then use a working design case prototype to further illustrate the possibilities of presence-with and presence-in. We hope our four levels of digital mindfulness framework will be found useful by other researchers in discussing and planning the design of their own mindfulness apps and digital artifacts.",
  "authors": [
    {
      "name": "Bin Zhu",
      "institution": "KTH Royal Institute of Technology & China Academy of Art, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358824257",
      "orcid": "missing"
    },
    {
      "name": "Anders Hedman",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332503491",
      "orcid": "0000-0002-2161-6395"
    },
    {
      "name": "Haibo Li",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319496033",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Antonio, Damasio. 1994. Descartes' Error: Emotion, Reason, and the Human Brain. GP Putnam's Sons, NY.",
      "doi": ""
    },
    {
      "text": "Aristotle, Ross, W. D., and Lesley Brown. 2009. The Nicomachean ethics. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Beck, Aaron T. 1997. The past and future of cognitive therapy. The Journal of psychotherapy practice and research 6, no. 4 (1997): 276.",
      "doi": ""
    },
    {
      "text": "Carr, Nicholas. 2010. What the Internet is doing to our brains. Raodshow.",
      "doi": ""
    },
    {
      "text": "Chittaro, Luca, and Andrea Vianello. 2014. Computer-supported mindfulness: Evaluation of a mobile thought distancing application on naive meditators. International Journal of Human-Computer Studies 72, no. 3 (2014): 337--348.  ",
      "doi": "10.1016/j.ijhcs.2013.11.001"
    },
    {
      "text": "Foerde, Karin, Barbara J. Knowlton, and Russell A. Poldrack. 2006. Modulation of competing memory systems by distraction. Proceedings of the National Academy of Sciences 103.31 (2006): 11778--11783. http://dx.doi.org/10.1073/pnas.0602659103 ",
      "doi": ""
    },
    {
      "text": "Höök, Kristina; Anna Ståhl, Petra Sundström, and Jarmo Laaksolaahti. 2008. Interactional empowerment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '08). ACM, NY, NY, USA, 647--656. http://dx.doi.org/10.1145/1357054.1357157  ",
      "doi": "10.1145/1357054.1357157"
    },
    {
      "text": "Höök, Kristina. 2009. Affective loop experiences: designing for interactional embodiment. Philosophical Transactions of the Royal Society of London B: Biological Sciences 364.1535 (2009): 3585--3595. http://dx.doi.org/10.1098/rstb.2009.0202 ",
      "doi": ""
    },
    {
      "text": "Kabat-Zinn, Jon. 2009. Wherever you go, there you are: Mindfulness meditation in everyday life. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Kajitani, Shinya, Colin McKenzie, and Kei Sakata. 2016. Use It Too Much and Lose It? The Effect of Working Hours on Cognitive Ability.",
      "doi": ""
    },
    {
      "text": "Kosunen, Ilkka, Mikko Salminen, Simo Järvelä, Antti Ruonala, Niklas Ravaja, and Giulio Jacucci. 2016. RelaWorld: Neuroadaptive and Immersive Virtual Reality Meditation System. In Proceedings of the 21st International Conference on Intelligent User Interfaces (IUI '16). ACM, NY, NY, USA, 208217. http://dx.doi.org/10.1145/2856767.2856796  ",
      "doi": "10.1145/2856767.2856796"
    },
    {
      "text": "Langer, Ellen J. 1989. Mindfulness. AddisonWesley/Addison Wesley Longman.",
      "doi": ""
    },
    {
      "text": "Levy, David M. 2016. Mindful Tech: How to Bring Balance to Our Digital Lives. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Ligo, Larry LeRoy. 1984. The concept of function in twentieth-century architectural criticism. Vol. 2. UMI Research Press.",
      "doi": ""
    },
    {
      "text": "Mahatera, Nyanaponika. 1970. The Heart of Buddhist Meditation. London: Rider & Co.",
      "doi": ""
    },
    {
      "text": "Nichols, Moire, and Christopher Janaway. 1999. The Cambridge Companion to Schopenhauer.",
      "doi": ""
    },
    {
      "text": "Niedderer, Kristina. 2007. Designing mindful interaction: the category of performative object.Design issues 23.1 (2007): 3--17. http://dx.doi.org/10.1162/desi.2007.23.1.3 ",
      "doi": ""
    },
    {
      "text": "Ophir, Eyal, Clifford Nass, and Anthony D. Wagner. 2009. Cognitive control in media multitaskers. Proceedings of the National Academy of Sciences106.37 (2009): 15583--15587. http://dx.doi.org/10.1073/pnas.0903620106 ",
      "doi": ""
    },
    {
      "text": "Sanches, Pedro, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body!: Designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, NY, NY, USA, 47--56. http://dx.doi.org/10.1145/1858171.1858182  ",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Schopenhauer, Arthur. 1966. The World as Will and Representation, NY: Dover Publications.",
      "doi": ""
    },
    {
      "text": "SCOL. 2014. A Consensus on the Brain Training Industry from the Scientific Community. Stanford Center of Longevity. http://longevity3.stanford.edu/blog/2014/10/15/the-consensus-on-the-brain-training-industry-from-the-scientific-community/ Accessed sept. 5 2016.",
      "doi": ""
    },
    {
      "text": "Sharf, Robert H. 1995. Buddhist modernism and the rhetoric of meditative experience. Numen 42.3 (1995): 228--283. http://dx.doi.org/10.1163/1568527952598549 ",
      "doi": ""
    },
    {
      "text": "Sharf, Robert. 2014. Mindfulness and mindlessness in early Chan. Philosophy East and West 64.4 (2014): 933--964. ",
      "doi": ""
    },
    {
      "text": "Udall, Nick. 1996. An investigation into the heuristics of mindfulness in higher art and design education. Diss. University of Surrey.",
      "doi": ""
    },
    {
      "text": "Zhu, Bin, Yanqing Zhang, Xiaojuan Ma, and Haibo Li. Bringing Chinese Aesthetics into Designing the Experience of Personal Informatics for Wellbeing. In Proceedings of the Conference on Design and semantics of form and movement (DeSForM 2015). 289--298.",
      "doi": ""
    },
    {
      "text": "Zimmerman, John; Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 493--502. http://dx.doi.org/10.1145/1240624.1240704  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}