{
  "doi": "10.1145/3025453.3025622",
  "title": "Gains from Participatory Design Team Membership as Perceived by Child Alumni and their Parents",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5730-5741",
  "year": 2017,
  "badges": [],
  "abstract": "The direct gains children perceive from their membership on Participatory Design (PD) teams are seldom the focus of research studies. Yet, how HCI practitioners choose to include children in PD methods may influence the value participants see in their participation, and thereafter the outcomes of PD processes. To understand what gains former child members of a PD team perceive from their participation we conducted a two-part study. In Study 1 we surveyed and interviewed child alumni of a PD team to determine gains that are perceived first-hand. In Study 2 we obtained a secondary perspective by surveying and interviewing parents of alumni. We report on the perceived gains to former participants that were identified and described in these two studies-including collaboration, communication, design process knowledge, and confidence. We reflect on our findings through discussions of the continued applicability of gains, new opportunities, and implications for PD practitioners and methods.",
  "authors": [
    {
      "name": "Brenna McNally",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81484654291/rel-imgonly/dsc_0056edit-full_small_squareish.jpg",
      "acmid": "81484654291",
      "orcid": "missing"
    },
    {
      "name": "Matthew Louis Mauriello",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81502788966/rel-imgonly/untitled-1_reasonably_small.jpg",
      "acmid": "81502788966",
      "orcid": "0000-0001-5359-6520"
    },
    {
      "name": "Mona Leigh Guha",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100549032",
      "orcid": "missing"
    },
    {
      "name": "Allison Druin",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365303",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "June Ahn, Michael Gubbels, Jinyoung Kim, and Johnny Wu. 2012. SINQ: Scientific INQuiry learning using social media. In CHI'12 Extended Abstracts on Human Factors in Computing Systems (CHI '12).  ",
      "doi": "10.1145/2212776.2223756"
    },
    {
      "text": "Wolmet Barendregt, Tilde M. Bekker, Peter Börjesson, Eva Eriksson, and Olof Torgersson. 2016. Legitimate Participation in the Classroom Context: Adding Learning Goals to Participatory Design. In Proceedings of The 15th International Conference on Interaction Design and Children (IDC '16), 167--174.  ",
      "doi": "10.1145/2930674.2930686"
    },
    {
      "text": "Ahmet Baytak and Susan M. Land. 2010. A case study of educational game design by kids and for kids. In Procedia-Social and Behavioral Sciences. 2,2: 52425246.",
      "doi": ""
    },
    {
      "text": "Laura Benton, Hilary Johnson, Emma Ashwin, Mark Brosnan, and Beate Grawemeyer. 2012. Developing IDEAS: Supporting children with autism within a participatory design team. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2599--2608.  ",
      "doi": "10.1145/2207676.2208650"
    },
    {
      "text": "Gro Bjerknes, Pelle Ehn, Morten Kyng, and Kristen Nygaard. 1987. Computers and democracy: A Scandinavian challenge. Gower Publishing Ltd.",
      "doi": ""
    },
    {
      "text": "Elizabeth Bonsignore, June Ahn, Tamara Clegg, Mona Leigh Guha, J. Yip, Allison Druin, and J. P. Hourcade. 2013. Embedding Participatory Design into Designs for Learning: An Untapped Interdisciplinary Resource? In CSCL 2013 Conference Proceedings Volume 1 -- Full Papers & Symposia (CSCL 2013), 549--556.",
      "doi": ""
    },
    {
      "text": "Claus Bossen, Claus, Christian Dindler, and Ole Sejer Iversen. 2010. User gains and PD aims: assessment from a participatory design project. In Proceedings of the 11th Biennial Participatory Design Conference (PDC '10), 141--150.  ",
      "doi": "10.1145/1900441.1900461"
    },
    {
      "text": "Claus Bossen, Christian Dindler, and Ole Sejer Iversen. 2012. Impediments to user gains: experiences from a critical participatory design project. In Proceedings of the 12th Biennial Participatory Design Conference (PDC '12), 31--40.  ",
      "doi": "10.1145/2347635.2347641"
    },
    {
      "text": "Luca Colombo, Monica Landoni, and Elisa Rubegni. 2014. Design guidelines for more engaging electronic books: insights from a cooperative inquiry study. In Proceedings of the 15th International Conference on Interaction Design and Children (IDC '14), 281--284.  ",
      "doi": "10.1145/2593968.2610472"
    },
    {
      "text": "Nigel Cross. 2006. Designerly ways of knowing. Springer London.",
      "doi": ""
    },
    {
      "text": "Chris Dede. 2010. Comparing frameworks for 21st century skills: 21st century skills: Rethinking how students learn. 20: 51--76.",
      "doi": ""
    },
    {
      "text": "Christian Dindler, Eva Eriksson, Ole Sejer Iversen, Andreas Lykke-Olesen, and Martin Ludvigsen. 2005. Mission from Mars: a method for exploring user requirements for children in a narrative space. In Proceedings of The 2005 International Conference on Interaction Design and Children (IDC '05), 40--47.  ",
      "doi": "10.1145/1109540.1109546"
    },
    {
      "text": "Betsy DiSalvo and Carl DiSalvo. 2014. Designing for Democracy in Education: Participatory Design and the Learning Sciences. In Proceedings of the Eleventh International Conference of the Learning Sciences (ICLS '14).",
      "doi": ""
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry: developing new technologies for children with children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'99), 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Allison Druin. 2002. The role of children in the design of new technology. Behaviour and Information Technology. 21,1: 1--25.",
      "doi": ""
    },
    {
      "text": "Allison Druin and Carina Fast. 2002. The child as learner, critic, inventor, and technology design partner: An analysis of three years of Swedish student journals. International Journal of Technology and Design Education. 12,3: 189--213.",
      "doi": ""
    },
    {
      "text": "R. Darin Ellis and Sri H. Kurniawan. 2000. Increasing the usability of online information for older users: A case study in participatory design. International Journal of Human-Computer Interaction (IJ HCI). 12,2: 263--276.",
      "doi": ""
    },
    {
      "text": "Elizabeth Foss, Mona Leigh Guha, Panagis Papadatos, Tamara Clegg, Jason Yip, and Greg Walsh. 2013. Cooperative Inquiry extended: Creating technology with middle school students with learning differences. Journal of Special Education Technology. 28,3: 33--46.",
      "doi": ""
    },
    {
      "text": "Julia A. Garde and Mascha C. van der Voort. 2014. Participants' view on personal gains and PD process. In Proceedings of the 13th Participatory Design Conference (PDC'13), 79--82.  ",
      "doi": "10.1145/2662155.2662194"
    },
    {
      "text": "Franca Garzotto. 2008. Broadening children's involvement as design partners: From technology to \"experience\". In Proceedings of the 7th International Conference on Interaction Design and Children (IDC'08), 186--193.  ",
      "doi": "10.1145/1463689.1463755"
    },
    {
      "text": "Judith Gregory. 2003. Scandinavian approaches to participatory design. International Journal of Engineering Education. 19,1: 62--74.",
      "doi": ""
    },
    {
      "text": "Mona Leigh Guha. 2010. Understanding the Social and Cognitive Experiences of Children Involved in Technology Design Processes. PhD Dissertation. University of Maryland, College Park, MD.",
      "doi": ""
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, Gene Chipman, Jerry Alan Fails, Sante Simms, and Allison Farber. 2004. Mixing ideas: A new technique for working with young children as design partners. In Proceedings of the 2004 Conference on Interaction Design and Children (IDC'04), 35--42.  ",
      "doi": "10.1145/1017833.1017838"
    },
    {
      "text": "Mona Leigh Guha, Allison Druin, and Jerry Alan Fails. 2013. Cooperative Inquiry revisited: Reflections of the past and guidelines for the future of intergenerational co-design. In International Journal of Child-Computer Interaction (IJCCI). 1,1: 14--23.",
      "doi": ""
    },
    {
      "text": "Elin Irene Hansen and Ole Sejer Iversen. 2013. You are the real experts!: Studying teenagers' motivation in participatory design. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC'13), 328--331.  ",
      "doi": "10.1145/2485760.2485826"
    },
    {
      "text": "Juan Pablo Hourcade. 2008. Interaction design and children. In Foundations and Trends in HumanComputer Interaction. 1,4: 277--392.  ",
      "doi": "10.1561/1100000006"
    },
    {
      "text": "Yasmin B. Kafai. 2003. Children designing software for children: what can we learn?. In Proceedings of the 2003 Conference on Interaction Design and Children (IDC'03), 11--12.  ",
      "doi": "10.1145/953536.953539"
    },
    {
      "text": "Andrew Large, Valerie Nesset, Jamshid Beheshti, and Leanne Bowler. 2006. \"Bonded design\": A novel approach to intergenerational information technology design. In Library & Information Science Research. 28,1: 64--82.",
      "doi": ""
    },
    {
      "text": "Tak Yeon Lee, Matthew Louis Mauriello, June Ahn, and Benjamin B. Bederson. 2014. CTArcade: Computational thinking with games in school age children. In International Journal of Child- Computer Interaction (IJCCI). 2,1:v26--33.  ",
      "doi": "10.1016/j.ijcci.2014.06.003"
    },
    {
      "text": "Stephan Lindsay, Daniel Jackson, Guy Schofield, and Patrick Olivier. 2012. Engaging older people using participatory design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 1199--1208.  ",
      "doi": "10.1145/2207676.2208570"
    },
    {
      "text": "Brenna McNally, Mona Leigh Guha, Matthew Louis Mauriello, and Allison Druin. Children's Perspectives on Ethical Issues Surrounding Their Past Involvement on a Participatory Design Team. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16), pp. 3595--3606.  ",
      "doi": "10.1145/2858036.2858338"
    },
    {
      "text": "Brenna McNally, Mona Leigh Guha, Leyla Norooz, Emily Rhodes, and Leah Findlater. 2014. Incorporating peephole interactions into children's second language learning activities on mobile devices. In Proceedings of the 2014 Conference on Interaction Design and Children (IDC'14), 115--124.  ",
      "doi": "10.1145/2593968.2593982"
    },
    {
      "text": "Karyn Moffatt, Joanna McGrenere, Barbara Purves, and Maria Klawe. 2004. The participatory design of a sound and image enhanced daily planner for people with aphasia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'04), 407--414.  ",
      "doi": "10.1145/985692.985744"
    },
    {
      "text": "Jamie Montemayor, Allison Druin, Allison Farber, Sante Simms, Wayne Churaman, and Allison D'Amour. 2002. Physical programming: designing tools for children to create physical interactive environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'02), 299--306.  ",
      "doi": "10.1145/503376.503430"
    },
    {
      "text": "Neema Moraveji, Jason Li, Jiarong Ding, Patrick O'Kelley, and Suze Woolf. 2007. Comicboarding: Using comics as proxies for participatory design with children. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (CHI'07), 1371--1374.  ",
      "doi": "10.1145/1240624.1240832"
    },
    {
      "text": "Michael J Muller. 2003. Participatory design: The third space in HCI. In Human-Computer Interaction: Development Process. 4235: 165--185.",
      "doi": ""
    },
    {
      "text": "Leyla Norooz, Matthew Louis Mauriello, Anita Jorgensen, Brenna McNally, and Jon E. Froehlich. 2015. BodyVis: A New Approach to Body Learning Through Wearable Sensing and Visualization. In Proceedings of the Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 1025--1034.  ",
      "doi": "10.1145/2702123.2702299"
    },
    {
      "text": "Partnership for 21st Century Learning (P21). 2016. Framework for 21st Century Learning. Retrieved September 16, 2016 from www.p21.org",
      "doi": ""
    },
    {
      "text": "Alex Quinn, Benjamin B. Bederson, Elizabeth Bonsignore, and Allison Druin. 2009. StoryKit: Designing a Mobile Application for Story Creation By Children and Older Adults. Tech. rep. HCIL-2009--22, Human Computer Interaction Lab, University of Maryland, College Park.",
      "doi": ""
    },
    {
      "text": "Karen Rust, Elizabeth Foss, Elizabeth Bonsignore, Brenna McNally, Chelsea Hordatt, Meethu Malu, Bie Mei, and Hubert Kofi Gumbs. 2014. Interactive and live performance design with children. In Proceedings of the 2014 conference on Interaction Design and Children (IDC'14), 305--308.  ",
      "doi": "10.1145/2593968.2610478"
    },
    {
      "text": "Michael Scaife, Yvonne Rogers, Frances Aldrich, and Matt Davies. 1997. Designing For or Designing With? Informant Design for interactive learning environments. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI'97), 343--350.  ",
      "doi": "10.1145/258549.258789"
    },
    {
      "text": "Mike Scaife, and Yvonne Rogers. 1999. Kids as informants: Telling us what we didn't know or confirming what we knew already. The Design of Children's Technology, 27--50. ",
      "doi": "10.5555/303430.303434"
    },
    {
      "text": "Anthony J. Viera and Joanne M. Garrett. 2005. Understanding interobserver agreement: the kappa statistic. Fam Med. 37,5: 360--363.",
      "doi": ""
    },
    {
      "text": "Greg Walsh, Allison Druin, Mona Leigh Guha, Elizabeth Foss, Evan Golub, Leshell Hatley, Elizabeth Bonsignore, and Sonia Franckel. 2010. Layered Elaboration: A new technique for co-design with children. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10), 1237--1240.  ",
      "doi": "10.1145/1753326.1753512"
    },
    {
      "text": "Greg Walsh, Elizabeth Foss, Jason Yip, and Allison Druin. 2013. FACIT PD: a framework for analysis and creation of intergenerational techniques for participatory design. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13), 2893--2902.  ",
      "doi": "10.1145/2470654.2481400"
    }
  ]
}