{
  "doi": "10.1145/3025453.3025962",
  "title": "Malleable Embodiment: Changing Sense of Embodiment by Spatial-Temporal Deformation of Virtual Human Body",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6438-6448",
  "year": 2017,
  "badges": [],
  "abstract": "We hypothesize that replacing the visual perception of one's body with a spatial-temporal deformed state would change sensations associated with the body. We developed a system that captures full-body movement and generates estimated past and future body movement by deformation. With a head mounted display, people could see their bodies as slightly deformed. We then investigated 1) how human movement is physically changed, and 2) how humans feel about the change in physical and emotional views of the body due to virtual body deformation. Our results show that spatial-temporal deformation of a virtual body actually changes the sense of body as well as physical movement. For instance, a body image generated at approximately 25-100 ms in the future induced a \"lighter weight\" sensation. On the basis of our findings, we discuss the design implication of computational control for the physical and emotional sense of body.",
  "authors": [
    {
      "name": "Shunichi Kasahara",
      "institution": "SonyCSL, Shinagawa, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556774656",
      "orcid": "0000-0002-4353-7620"
    },
    {
      "name": "Keina Konno",
      "institution": "Yamaguchi Center for Arts and Media, Yamaguchi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658985833",
      "orcid": "missing"
    },
    {
      "name": "Richi Owaki",
      "institution": "Yamaguchi Center for Arts and Media, Yamaguchi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658985231",
      "orcid": "missing"
    },
    {
      "name": "Tsubasa Nishi",
      "institution": "Yamaguchi Center for Arts and Media, Yamaguchi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658985416",
      "orcid": "missing"
    },
    {
      "name": "Akiko Takeshita",
      "institution": "Yamaguchi Center for Arts and Media, Yamaguchi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658984903",
      "orcid": "missing"
    },
    {
      "name": "Takayuki Ito",
      "institution": "Yamaguchi Center for Arts and Media, Yamaguchi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658985414",
      "orcid": "missing"
    },
    {
      "name": "Shoko Kasuga",
      "institution": "Keio University, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161243",
      "orcid": "missing"
    },
    {
      "name": "Junichi Ushiba",
      "institution": "Keio University, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162044",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "K Carrie Armel and Vilayanur S Ramachandran. 2003. Projecting sensations to external objects: evidence from skin conductance response. Proceedings of the Royal Society of London B: Biological Sciences 270, 1523 (2003), 1499--1506.",
      "doi": ""
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1968--1979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Domna Banakou, Raphaela Groten, and Mel Slater. 2013. Illusory ownership of a virtual child body causes overestimation of object sizes and implicit attitude changes. Proceedings of the National Academy of Sciences 110, 31 (2013), 12846--12851.",
      "doi": ""
    },
    {
      "text": "Ilias Bergstrom, Konstantina Kilteni, and Mel Slater. 2016. First-Person Perspective Virtual Body Posture Influences Stress: A Virtual Reality Body Ownership Study. PLoS ONE 11, 2 (02 2016), 1--21.",
      "doi": ""
    },
    {
      "text": "Marco Bertamini, Nausicaa Berselli, Carole Bode, Rebecca Lawson, and Li Ting Wong. 2011. The rubber hand illusion in a mirror. Consciousness and cognition 20, 4 (2011), 1108--1119.",
      "doi": ""
    },
    {
      "text": "Corey J Bohil, Bradly Alicea, and Frank A Biocca. 2011. Virtual reality in neuroscience research and therapy. Nature reviews neuroscience 12, 12 (2011), 752--762.",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick, Jonathan Cohen, and others. 1998. Rubber hands' feel'touch that eyes see. Nature 391, 6669 (1998), 756--756.",
      "doi": ""
    },
    {
      "text": "Timothy Dummer, Alexandra Picot-Annand, Tristan Neal, and Chris Moore. 2009. Movement and the rubber hand illusion. Perception 38, 2 (2009), 271--280.",
      "doi": ""
    },
    {
      "text": "Michael SA Graziano. 1999. Where is my arm? The relative role of vision and proprioception in the neuronal representation of limb position. Proceedings of the National Academy of Sciences 96, 18 (1999), 10418--10421.",
      "doi": ""
    },
    {
      "text": "Denise YP Henriques and Erin K Cressman. 2012. Visuomotor adaptation and proprioceptive recalibration. Journal of motor behavior 44, 6 (2012), 435--444.",
      "doi": ""
    },
    {
      "text": "Ludovic Hoyet, Ferran Argelaguet, Corentin Nicole, and Anatole Lecuyer. 2016. \"Wow! I Have Six Fingers!\": Would You Accept Structural Changes of Your Hand in VR? Frontiers in Robotics and AI 3 (2016), 27.",
      "doi": ""
    },
    {
      "text": "D. A. G. Jauregui, F. Argelaguet, A. H. Olivier, M. Marchal, F. Multon, and A. Lecuyer. 2014. Toward \"Pseudo-Haptic Avatars\": Modifying the Visual Animation of Self-Avatar Can Simulate the Perception of Weight Lifting. IEEE Transactions on Visualization and Computer Graphics 20, 4 (April 2014), 654--661.  ",
      "doi": "10.1109/TVCG.2014.45"
    },
    {
      "text": "K. Kilteni, I. Bergstrom, and M. Slater. 2013. Drumming in Immersive Virtual Reality: The Body Shapes the Way We Play. IEEE Transactions on Visualization and Computer Graphics 19, 4 (April 2013), 597--605.  ",
      "doi": "10.5555/2478535.2478597"
    },
    {
      "text": "Konstantina Kilteni, Antonella Maselli, Konrad P. Kording, and Mel Slater. 2015. Over my fake body: body ownership illusions for studying the multisensory basis of own-body perception. Frontiers in Human Neuroscience 9 (2015), 141.",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Jean-Marie Normand, Maria V. Sanchez-Vives, and Mel Slater. 2012. Extending Body Space in Immersive Virtual Reality: A Very Long Arm Illusion. PLoS ONE 7, 7 (07 2012), 1--15.",
      "doi": ""
    },
    {
      "text": "Elena Kokkinara, Mel Slater, and Joan López-Moliner. 2015. The Effects of Visuomotor Calibration to the Perceived Space and Body, Through Embodiment in Immersive Virtual Reality. ACM Trans. Appl. Percept. 13, 1, Article 3 (Oct. 2015), 22 pages.  ",
      "doi": "10.1145/2818998"
    },
    {
      "text": "John W Krakauer, Zachary M Pine, Maria-Felice Ghilardi, and Claude Ghez. 2000. Learning of visuomotor transformations for vectorial planning of reaching trajectories. The Journal of neuroscience 20, 23 (2000), 8916--8924.",
      "doi": ""
    },
    {
      "text": "Matteo Martini, D Perez-Marcos, and MV Sanchez-Vives. 2014. Modulation of pain threshold by virtual body ownership. European Journal of Pain 18, 7 (2014), 1040--1048.",
      "doi": ""
    },
    {
      "text": "Antonella Maselli and Mel Slater. 2013. The building blocks of the full body ownership illusion. Frontiers in human neuroscience 7 (2013), 83.",
      "doi": ""
    },
    {
      "text": "Antonella Maselli and Mel Slater. 2014. Sliding perspectives: dissociating ownership from self-location during full body illusions in virtual reality. Frontiers in Human Neuroscience 8 (2014), 693.",
      "doi": ""
    },
    {
      "text": "Pietro Mazzoni and John W Krakauer. 2006. An implicit plan overrides an explicit strategy during visuomotor adaptation. The Journal of neuroscience 26, 14 (2006), 3642--3645.",
      "doi": ""
    },
    {
      "text": "W. A. McNeely. 1993. Robotic graphics: a new approach to force feedback for virtual reality. In Virtual Reality Annual International Symposium, 1993., 1993 IEEE. 336--341.  ",
      "doi": "10.1109/VRAIS.1993.380761"
    },
    {
      "text": "Jean-Marie Normand, Elias Giannopoulos, Bernhard Spanlang, and Mel Slater. 2011. Multisensory stimulation can induce an illusion of larger belly size in immersive virtual reality. PloS one 6, 1 (2011), e16128.",
      "doi": ""
    },
    {
      "text": "Tabitha C. Peck, Sofia Seinfeld, Salvatore M. Aglioti, and Mel Slater. 2013. Putting yourself in the skin of a black avatar reduces implicit racial bias. Consciousness and Cognition 22, 3 (2013), 779 -- 787.",
      "doi": ""
    },
    {
      "text": "Daniel Perez-Marcos, Massimiliano Solazzi, Will Steptoe, Oyewole Oyekoya, Antonio Frisoli, Tim Weyrich, Anthony Steed, Franco Tecchia, Mel Slater, and Maria V. Sanchez-Vives. 2012a. A Fully Immersive Set-up for Remote Interaction and Neurorehabilitation based on Virtual Body Ownership. Frontiers in Neurology 3, 110 (2012), 1--9.",
      "doi": ""
    },
    {
      "text": "Daniel Perez-Marcos, Massimiliano Solazzi, Will Steptoe, Wole Oyekoya, Antonio Frisoli, Tim Weyrich, Anthony Steed, Franco Tecchia, Mel Slater, and Maria V Sanchez-Vives. 2012b. A fully immersive set-up for remote interaction and neurorehabilitation based on virtual body ownership. Frontiers in neurology 3 (2012), 110.",
      "doi": ""
    },
    {
      "text": "Valeria I. Petkova and H. Henrik Ehrsson. 2008. If I Were You: Perceptual Illusion of Body Swapping. PLoS ONE 3, 12 (12 2008), 1--9.",
      "doi": ""
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C Whitton. 2001. Redirected walking. In Proceedings of EUROGRAPHICS. Citeseer.",
      "doi": ""
    },
    {
      "text": "Reza Shadmehr, Maurice A Smith, and John W Krakauer. 2010. Error correction, sensory prediction, and adaptation in motor control. Annual review of neuroscience 33 (2010), 89--108.",
      "doi": ""
    },
    {
      "text": "Sotaro Shimada, Yuan Qi, and Kazuo Hiraki. 2010. Detection of visual feedback delay in active and passive self-body movements. Experimental brain research 201, 2 (2010), 359--364.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Perez Marcos, Henrik Ehrsson, and Maria Sanchez-Vives. 2008. Towards a digital body: the virtual arm illusion. Frontiers in Human Neuroscience 2 (2008), 6.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Perez Marcos, Henrik Ehrsson, and Maria Sanchez-Vives. 2009. Inducing illusory ownership of a virtual body. Frontiers in Neuroscience 3 (2009), 29.",
      "doi": ""
    },
    {
      "text": "Anthony Steed, Sebastian Frlston, Maria Murcia Lopez, Jason Drummond, Ye Pan, and David Swapp. 2016a. An 'In the Wild'; Experiment on Presence and Embodiment Using Consumer Virtual Reality Equipment. IEEE Transactions on Visualization and Computer Graphics 22, 4 (April 2016), 1406--1414.  ",
      "doi": "10.1109/TVCG.2016.2518135"
    },
    {
      "text": "A. Steed, Y. Pan, F. Zisch, and W. Steptoe. 2016b. The impact of a self-avatar on cognitive load in immersive virtual reality. In 2016 IEEE Virtual Reality (VR). 67--76.",
      "doi": ""
    },
    {
      "text": "Manos Tsakiris. 2010. My body in the brain: A neurocognitive model of body-ownership. Neuropsychologia 48, 3 (2010), 703 -- 712. The Sense of Body.",
      "doi": ""
    },
    {
      "text": "Hermann von Helmholtz and James Powell Cocke Southall. 2005. Treatise on physiological optics. Vol. 3. Courier Corporation.",
      "doi": ""
    },
    {
      "text": "Y. Yuan and A. Steed. 2010. Is the rubber hand illusion induced by immersive virtual reality?. In 2010 IEEE Virtual Reality Conference (VR). 95--102.  ",
      "doi": "10.1109/VR.2010.5444807"
    }
  ]
}