{
  "doi": "10.1145/3025453.3025586",
  "title": "Supporting People with Dementia in Digital Social Sharing",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2149-2162",
  "year": 2017,
  "badges": [],
  "abstract": "Sharing online is an important way in which people across the lifespan express themselves, maintain relationships, and connect with others. Yet, people with dementia are often not supported in engaging to the full extent of their abilities, particularly in their interaction with online technology. This paper presents a design case study that examines what it means to design for agency in online sharing involving individuals with dementia. Our work is situated in the context of art therapy for adults with dementia. We present the design and exploration of Moments, a system that allows individuals to share through artwork by manipulating their physical environment. We discuss how designing for agency calls attention to the ways in which the material workspace, including the tools we introduce, and the surrounding social context participate in the creation of agency.",
  "authors": [
    {
      "name": "Amanda Lazar",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262040",
      "orcid": "0000-0001-8110-4239"
    },
    {
      "name": "Caroline Edasis",
      "institution": "Mather LifeWays, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987311",
      "orcid": "missing"
    },
    {
      "name": "Anne Marie Piper",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316490036",
      "orcid": "0000-0003-3085-3277"
    }
  ],
  "references": [
    {
      "text": "Norman Alm, Richard Dye, Gary Gowans, Jim Campbell, Arlene Astell, and Maggie Ellis. 2003. Designing an interface usable by people with dementia. Proceedings of the 2003 conference on Universal usability (CUU '03), ACM Press, 156--157. http://doi.org/10.1145/957205.957237  ",
      "doi": "10.1145/957205.957237"
    },
    {
      "text": "Alzheimer's Association. Legal Documents. Retrieved January 1, 2016 from https://www.alz.org/care/alzheimers-dementialegal-documents.asp",
      "doi": ""
    },
    {
      "text": "Claire Ancient, Alice Good, Clare Wilson, and Tineke Fitch. 2013. Can ubiquitous devices utilising reminiscence therapy be used to promote well-being in dementia patients' an exploratory study. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 426--435. http://doi.org/10.1007/978-3-642-39194-1-50",
      "doi": ""
    },
    {
      "text": "N. Armstrong, C. D. Nugent, G. Moore, and D. D Finlay. 2010. Developing smartphone applications for people with Alzheimer's disease. Proceedings of the 10th IEEE International Conference on Information Technology and Applications in Biomedicine: 1--5. http://doi.org/10.1109/ITAB.2010.5687795 ",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2003. Posthumanist Performativity: Toward an Understanding of How Matter Comes to Matter. Signs: Journal of Women in Culture and Society 28, 3. ",
      "doi": ""
    },
    {
      "text": "Ruth Bartlett and Deborah O'Connor. 2007. From personhood to citizenship: Broadening the lens for dementia practice and research. Journal of Aging Studies 21, 2: 107--118. http://doi.org/10.1016/j.jaging.2006.09.002 ",
      "doi": ""
    },
    {
      "text": "Raewyn Bassett and Janice E. Graham. 2007. Memorabilities: enduring relationships, memories and abilities in dementia. Ageing and Society 27, 4: 533. http://doi.org/10.1017/S0144686X07005971",
      "doi": ""
    },
    {
      "text": "Anne Davis Basting. 2003. Looking back from loss: Views of the self in Alzheimer's disease. Journal of Aging Studies 17, 1: 87--99. http://doi.org/10.1016/S0890-4065(02)00092-0 ",
      "doi": ""
    },
    {
      "text": "Rachel Batchelor, Ania Bobrowicz, Robin Mackenzie, and Alisoun Milne. 2012. Challenges of ethical and legal responsibilities when technologies' uses and users change: Social networking sites, decision-making capacity and dementia. Ethics and Information Technology 14, 2: 99--108. http://doi.org/10.1007/s10676-012-9286-x  ",
      "doi": "10.1007/s10676-012-9286-x"
    },
    {
      "text": "Rakel Berenbaum, Yehudit Lange, and Leah Abramowitz. 2011. Augmentative alternative communication for Alzheimer's patients and families' using SAVION. Proceedings of the 4th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '11). http://doi.org/10.1145/2141622.2141677  ",
      "doi": "10.1145/2141622.2141677"
    },
    {
      "text": "Geraldine Boyle. 2013. \"She's usually quicker than the calculator\": Financial management and decisionmaking in couples living with dementia. Health and Social Care in the Community 21, 5: 554--562. http://doi.org/10.1111/hsc.12044 ",
      "doi": ""
    },
    {
      "text": "Dawn Brooker. 2007. Person-Centred Dementia Care: Making Services Better. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Bernheim A. J. Brush, Kori M. Inkpen, and Tee Kimberly. 2008. SPARCS: exploring sharing suggestions to enhance family connectedness. Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW '08): 629--638. http://doi.org/http://doi.acm.org/10.1145/1460563.1",
      "doi": "10.1145/1460563.1460661"
    },
    {
      "text": "Kathy Charmaz. 2008. Constructionism and the Grounded Theory Method. In Handbook of Constructionist Research, James A. Holstein and Jaber F. Gubrium (eds.). Guilford Press, 397--412.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. Sage Publications, London.",
      "doi": ""
    },
    {
      "text": "Jiska Cohen-Mansfield. 2001. Nonpharmacologic interventions for inappropriate behaviors in dementia: a review, summary, and critique. The American Journal of Geriatric Psychiatry 9, 4: 361--381. http://doi.org/10.1176/appi.ajgp.9.4.361 ",
      "doi": ""
    },
    {
      "text": "Raymundo Cornejo, Robin Brewer, Caroline Edasis, and Anne Marie Piper. 2016. Vulnerability, Sharing, and Privacy: Analyzing Art Therapy for Older Adults with Dementia. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16), ACM Press, 1572--1583.  ",
      "doi": "10.1145/2818048.2819960"
    },
    {
      "text": "Raymundo Cornejo, Jesús Favela, and Mónica Tentori. 2010. Ambient Displays for Integrating Older Adults into Social Networking Sites. In Collaboration and Technology, G. Kolfschoten, T. Herrmann and S. Lukosch (eds.). Springer Berlin, Heidelberg, 321--336. ",
      "doi": ""
    },
    {
      "text": "David Coyle, James Moore, Per Ola, Kristensson Paul, and C. Fletcher Alan. 2012. I did that! Measuring Users' Experience of Agency in their own Actions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2025--2034.",
      "doi": ""
    },
    {
      "text": "Claire Craig. 2004. Reaching Out with the Arts: Meeting with the Person with Dementia. In Dementia and Social Inclusion: Marginalised groups and marginalised areas of dementia research, care and practice, Anthea Innes and Carole Archibald (eds.). Jessica Kingsley Publishers, 184--198.",
      "doi": ""
    },
    {
      "text": "David A. Crocker and Ingrid Robeyns. 2009. Capability and Agency. In Amartya Sen. 60--90. ",
      "doi": ""
    },
    {
      "text": "Betsy van Dijk, Pavan Dadlani, Aart van Halteren, and Margit Biemans. 2010. Life changes, connection stays: Photo Sharing and Social Connectedness for People with Special Needs. Proceedings of the 28th Annual European Conference on Cognitive Ergonomics (ECCE '10), August: 135--142. http://doi.org/10.1145/1962300.1962327",
      "doi": "10.1145/1962300.1962327"
    },
    {
      "text": "Ellen Dissanayake. 1999. \"Making special\": An undescribed human universal and the core of a behavior of art. In Biopoetics. Evolutionary explorations in the arts, B. Cooke and F. Turner (eds.). Lexington: ICUS, 27--46.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action is: The Foundations of Embodied Interaction. MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Sherry L. Dupuis, Jennifer Gillies, Jennifer Carson, et al. 2011. Moving beyond patient and client approaches: Mobilizing \"authentic partnerships\" in dementia care, support and services. Dementia 11, 4: 427--452. http://doi.org/10.1177/1471301211421063 ",
      "doi": ""
    },
    {
      "text": "Charlotte Emmett, Marie Poole, John Bond, and Julian C. Hughes. 2013. Homeward bound or bound for a home? Assessing the capacity of dementia patients to make decisions about hospital discharge: Comparing practice with legal standards. International Journal of Law and Psychiatry 36: 73--82. http://doi.org/10.1016/j.ijlp.2012.11.009 ",
      "doi": ""
    },
    {
      "text": "Aline C. Gubrium, Amy L. Hill, and Sarah Flicker. 2014. A situated practice of ethics for participatory visual and digital methods in public health research and practice: A focus on digital storytelling. American Journal of Public Health 104, 9: 1606--1614. http://doi.org/10.2105/AJPH.2013.301310 ",
      "doi": ""
    },
    {
      "text": "Nancy Harding and Colin Palfrey. 1997. The Social Construction of Dementia: Confused Professionals? Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins. 1995. Cognition in the Wild. MIT Press.",
      "doi": ""
    },
    {
      "text": "Emily R. Johnson. Patient Art Exhibitions in Health Care Setting. In Art Therapy and Health Care, Cathy A. Malchiodi (ed.). The Guilford Press.",
      "doi": ""
    },
    {
      "text": "Anu Kankainen and Vilma Lehtinen. 2011. Creative personal projects of the elderly as active engagements with interactive media technology. Proceedings of the 8th ACM conference on Creativity and cognition (C&C '11): 175--184. http://doi.org/10.1145/2069618.2069648  ",
      "doi": "10.1145/2069618.2069648"
    },
    {
      "text": "Noriaki Kuwahara, Shinji Abe, Kiyoshi Yasuda, and Kazuhiro Kuwabara. 2006. Networked reminiscence therapy for individuals with dementia by using photo and video sharing. Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility (Assets '06), ACM Press, 125. http://doi.org/10.1145/1168987.1169010  ",
      "doi": "10.1145/1168987.1169010"
    },
    {
      "text": "Amanda Lazar, Raymundo Cornejo, Caroline Edasis, and Anne Marie Piper. 2016. Designing for the Third Hand: Empowering Older Adults with Cognitive Impairments through Creating and Sharing. Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 1047--1058.  ",
      "doi": "10.1145/2901790.2901854"
    },
    {
      "text": "Hannah Limerick, David Coyle, and James W. Moore. 2014. The experience of agency in human-computer interactions: a review. Frontiers in Human Neuroscience 8: Article 643. http://doi.org/10.3389/fnhum.2014.00643 ",
      "doi": ""
    },
    {
      "text": "Siân E. Lindley. 2012. Shades of lightweight: Supporting cross-generational communication through home messaging. Universal Access in the Information Society 11, 1: 31--43. http://doi.org/10.1007/s10209-011-0231-2  ",
      "doi": "10.1007/s10209-011-0231-2"
    },
    {
      "text": "Nancy L. Mace. 1987. Principles of activities for persons with dementia. Physical & Occupational Therapy in Geriatrics 5, 3: 13--27. http://doi.org/http://dx.doi.org/10.1300/J148v05n03_03 ",
      "doi": ""
    },
    {
      "text": "Robin Mackenzie and John Watts. 2011. Including Emotionality in Tests of Competence: How Does Neurodiversity Affect Measures of Free Will and Agency in Medical Decision Making? AJOB Neuroscience 2, 3: 27--36. http://doi.org/10.1080/21507740.2011.580491 ",
      "doi": ""
    },
    {
      "text": "Sarah MacPherson, Michael Bird, Katrina Anderson, Terri Davis, and Annaliese Blair. 2009. An art gallery access programme for people with dementia: \"you do it for the moment\". Aging & Mental health 13, 5: 744--752. http://doi.org/10.1080/13607860902918207 ",
      "doi": ""
    },
    {
      "text": "Marshall McLuhan. 1964. Understanding Media: The extensions of Man. MIT Press.",
      "doi": ""
    },
    {
      "text": "Kellie Morrissey and John Mccarthy. 2015. Creative and Opportunistic Use of Everyday Music Technologies in a Dementia Care Unit. Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15), 295--298.  ",
      "doi": "10.1145/2757226.2757228"
    },
    {
      "text": "Kellie Morrissey, Gavin Wood, David Green, Nadia Pantidi, and John Mccarthy. 2016. \"I'm a rambler, I'm a gambler, I'm a long way from home\": The Place of Props, Music, and Design in Dementia Care. Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16): 1008--1020.  ",
      "doi": "10.1145/2901790.2901798"
    },
    {
      "text": "Maurice Mulvenna, Stefan Sävenstedt, Franka Meiland, Rose Marie, and David Craig. 2010. Designing & Evaluating a Cognitive Prosthetic for People with Mild Dementia. Proceedings of the ECCE 2010 Congerence, 11--18.  ",
      "doi": "10.1145/1962300.1962306"
    },
    {
      "text": "Aisling Ann O'Kane, Helena M. Mentis, and Eno Thereska. 2013. Non-Static Nature of Patient Consent: Shifting Privacy Perspectives in Health Information Sharing. Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13), 553--562.  ",
      "doi": "10.1145/2441776.2441838"
    },
    {
      "text": "William Odom, Richard Banks, Richard Harper, David Kirk, Siân Lindley, and Abigail Sellen. 2012. Technology Heirlooms? Considerations for Passing Down and Inheriting Digital Materials. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12): 337--346. http://doi.org/10.1145/2207676.2207723  ",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "Jonathan Parker. 2005. Constructing Dementia and Dementia Care: Daily Practices in a Day Care Setting. Journal of Social Work 5, 3: 261--278. http://doi.org/10.1177/1468017305058935 ",
      "doi": ""
    },
    {
      "text": "T. Perrin. 1997. The Positive Response Schedule for Severe Dementia. Aging & mental health 1, 2: 184--191. http://doi.org/10.1080/13607869757290 ",
      "doi": ""
    },
    {
      "text": "Andrew Pickering. 1995. The Mangle of Practice: Time, Agency, and Science. The University of Chicago Press, Chicago and London. ",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16): 5311--5323. http://doi.org/10.1145/2858036.2858260  ",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Gloria Puurveen, A. Phinney, S. Cox, and B. Purvest. 2015. Ethical issues in the use of video observations with people with advanced dementia and their caregivers in nursing home environments. Visual Methodologies 3, 2: 1--39.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never Too Old: Engaging Retired People Inventing the Future with MaKey MaKey. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), ACM Press, 3913--3922.  ",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Daniela K Rosner. 2012. The Material Practices of Collaboration. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12), 1155--1164.",
      "doi": "10.1145/2145204.2145375"
    },
    {
      "text": "Steven R. Sabat, Lisa Napolitano, and Heather Fath. 2004. Barriers to the construction of a valued social identity: A case study of Alzheimer's disease. American Journal of Alzheimer's Disease and Other Dementias 19, 3: 177--185. http://doi.org/10.1177/153331750401900311 ",
      "doi": ""
    },
    {
      "text": "Amartya Sen. 1999. Development as Freedom. New York, New York. http://doi.org/10.1215/0961754X9-2-350",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1997. Designing the User Interface: Strategies for Effective Human-Computer Interaction. Addison-Wesley Longman Publishing Co., Inc., Boston, MA.",
      "doi": "10.5555/3033040"
    },
    {
      "text": "Carol Bowlby Sifton. 2000. Well-Being and Doing: Enabling Occupation with Persons with Dementia. Alzheimer's Care Quarterly 1, 2: 7--28.",
      "doi": ""
    },
    {
      "text": "Emma Snelling, Denise Gregson, and Mike Bender. 2000. Restoring the give and take in a relationship. Journal of Dementia Care 8, 1. http://doi.org/10.1017/CBO9781107415324.004 ",
      "doi": ""
    },
    {
      "text": "Robert S Stewart, Peter Bartlett, and Rowan H Harwood. 2005. Mental capacity assessments and discharge A way forward. Age and ageing 34: 549--550. http://doi.org/10.1093/ageing/afi185",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. Agencies in Technology Design: Feminist Reconfigurations. Online Proceedings of the 5th European Symposium on Gender & ICT. http://doi.org/10.1017/CBO9781107415324.004",
      "doi": ""
    },
    {
      "text": "Janelle S. Taylor. 2008. On Recognition, Caring, and Dementia. Medical Anthropology Quarterly 22, 4: 313--335. http://doi.org/10.1111/j.15481387.2008.00036.x",
      "doi": ""
    },
    {
      "text": "Jakob Tholander, Maria Normark, and Chiara Rossitto. 2012. Understanding agency in interaction design materials. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12).  ",
      "doi": "10.1145/2207676.2208417"
    },
    {
      "text": "Päivi Topo. 2008. Technology Studies to Meet the Needs of People With Dementia and Their Caregivers: A Literature Review. Journal of Applied Gerontology 28, 1: 5--37. http://doi.org/10.1177/0733464808324019 ",
      "doi": ""
    },
    {
      "text": "P. Topo, M. Jylhä, and J. Laine. 2002. Can the telephone-using abilities of people with dementia be promoted? An evaluation of a simple-to-use telephone. Technology & Disability 14: 3--13. Retrieved from http://search.ebscohost.com/login.aspx?direct=true&db=cin20&AN=2002135544&site=ehost-live",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: on how we involve people in design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM Press, 429--438. http://doi.org/10.1016/S0142694X(98)00026-X",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia: An Enquiry into Design in a Hospital Setting. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), ACM Press, 2629--2638. http://doi.org/10.1145/2207676.2208654  ",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), ACM Press, 2617--2626. http://doi.org/10.1145/2470654.2481363  ",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Lin Wan, Claudia Müller, Volker Wulf, and David William Randall. 2014. Addressing the subtleties in dementia care: Pre-study & Evaluation of a GPS Monitoring System. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14): 3987--3996. http://doi.org/10.1145/2556288.2557307  ",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, et al. 2013. Older adults as digital content producers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 39--48. http://doi.org/10.1145/2470654.2470662  ",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Chiara Zaccarelli, Giulio Cirillo, Simone Passuti, Roberta Annicchiarico, and Francesco Barban. 2013. Computer-based cognitive intervention for dementia. Sociable: motivating platform for elderly networking, mental reinforcement and social interaction. Proceedings of the 2013 7th International Conference on Pervasive Computing Technologies for Healthcare (Pervasive Health), Ieee, 430--435. http://doi.org/10.4108/pervasivehealth.2013.252155 ",
      "doi": ""
    },
    {
      "text": "TopCodes: Tangible Object Placement Codes. Retrieved from http://users.eecs.northwestern.edu/~mhorn/topcodes /",
      "doi": ""
    }
  ]
}