{
  "doi": "10.1145/3025453.3025730",
  "title": "Demand Around the Clock: Time Use and Data Demand of Mobile Devices in Everyday Life",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5361-5372",
  "year": 2017,
  "badges": [],
  "abstract": "Motivated by mobile devices' growing demand for connectivity, and concern in HCI with the energy intensity and sustainability of networked services, in this paper we reveal the impact of applications on smartphones and tablets in terms of network demand and time use. Using a detailed mixed methods study with eight participants, we first provide an account of how data demand has meaning and utility in our participants' social practices, and the timing and relative impacts of these. We then assess the scale of this demand by drawing comparison between our fine-grained observations and a more representative dataset of 398 devices from the Device Analyzer corpus. Our results highlight the significant categories of data demanding practice, and the identification of where changes in app time and duration of use might reduce or shift demand to reduce services' impacts.",
  "tags": [
    "ict",
    "sustainability",
    "demand designed into practices",
    "data demand"
  ],
  "authors": [
    {
      "name": "Kelly Widdicks",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162014",
      "orcid": "missing"
    },
    {
      "name": "Oliver Bates",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81556332556/rel-imgonly/oliver_bates_bw.jpg",
      "acmid": "81556332556",
      "orcid": "missing"
    },
    {
      "name": "Mike Hazas",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100484405",
      "orcid": "missing"
    },
    {
      "name": "Adrian Friday",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533743",
      "orcid": "missing"
    },
    {
      "name": "Alastair R. Beresford",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319488715",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Morgan G Ames. 2013. Managing mobile multitasking: the culture of iPhones on stanford campus. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1487--1498.  ",
      "doi": "10.1145/2441776.2441945"
    },
    {
      "text": "Oliver Bates, Mike Hazas, Adrian Friday, Janine Morley, and Adrian K. Clear. 2014. Towards an Holistic View of the Energy and Environmental Impacts of Domestic Media and IT. In Proc. CHI. 10.  ",
      "doi": "10.1145/2556288.2556968"
    },
    {
      "text": "Mike Berners-Lee. 2011. How bad are bananas?: the carbon footprint of everything. Greystone Books.",
      "doi": ""
    },
    {
      "text": "Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling asleep with Angry Birds, Facebook and Kindle: a large scale study on mobile application usage. In Proceedings of the 13th international conference on Human computer interaction with mobile devices and services. ACM, 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Marshini Chetty, Richard Banks, A.J. Brush, Jonathan Donner, and Rebecca Grinter. 2012. You're capped: understanding the effects of bandwidth caps on broadband use in the home. In Proc. of CHI. 10.  ",
      "doi": "10.1145/2207676.2208714"
    },
    {
      "text": "Cisco. May 29, 2013. Cisco Visual Networking Index: Forecast and Methodology, 2012--2017. Technical Report.",
      "doi": ""
    },
    {
      "text": "Ericsson. June 2015. Europe: Ericsson Mobility Report Appendix. Technical Report. Ericsson.",
      "doi": ""
    },
    {
      "text": "Ericsson. June 2016. Ericsson mobility report. Technical Report. Ericsson.",
      "doi": ""
    },
    {
      "text": "Hossein Falaki, Ratul Mahajan, Srikanth Kandula, Dimitrios Lymberopoulos, Ramesh Govindan, and Deborah Estrin. 2010. Diversity in smartphone usage. In Proceedings of the 8th international conference on Mobile systems, applications, and services. ACM, 179--194.  ",
      "doi": "10.1145/1814433.1814453"
    },
    {
      "text": "Denzil Ferreira, Jorge Goncalves, Vassilis Kostakos, Louise Barkhuus, and Anind K Dey. 2014. Contextual experience sampling of mobile application micro-usage. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. ACM, 91--100.  ",
      "doi": "10.1145/2628363.2628367"
    },
    {
      "text": "Silke Gegenbauer and Elaine M. Huang. 2012. iPods, Ataris, and Polaroids: A Personal Inventories Study of Out-of-use Electronics in Swiss Households. In Proc. UbiComp. 5.  ",
      "doi": "10.1145/2370216.2370294"
    },
    {
      "text": "Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow design for meaningful interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3431--3440.  ",
      "doi": "10.1145/2470654.2466472"
    },
    {
      "text": "Kristin Hanks, William Odom, David Roedl, and Eli Blevis. 2008. Sustainable millennials: attitudes towards sustainability and the material effects of interactive technologies. In Proc. of CHI. 10.  ",
      "doi": "10.1145/1357054.1357111"
    },
    {
      "text": "Lorenz M Hilty. 2011. Information technology and sustainability: Essays on the relationship between information technology and sustainable development. BoD--Books on Demand.",
      "doi": ""
    },
    {
      "text": "Roland Hischier, Vlad C Coroama, Daniel Schien, and Mohammad Ahmadi Achachlouei. 2015. Grey energy and environmental impacts of ICT hardware. In ICT Innovations for Sustainability. Springer, 171--189.",
      "doi": ""
    },
    {
      "text": "Simon L Jones, Denzil Ferreira, Simo Hosio, Jorge Goncalves, and Vassilis Kostakos. 2015. Revisitation analysis of smartphone app use. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 1197--1208.  ",
      "doi": "10.1145/2750858.2807542"
    },
    {
      "text": "Fahim Kawsar and A.J. Bernheim Brush. 2013. Home computing unplugged: why, where and when people use different connected devices at home. In Proc. UbiComp. 10.  ",
      "doi": "10.1145/2493432.2493494"
    },
    {
      "text": "Gilly Leshed and Phoebe Sengers. 2011. \"I Lie to Myself That I Have Freedom in My Own Schedule\": Productivity Tools and Experiences of Busyness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 905--914.  ",
      "doi": "10.1145/1978942.1979077"
    },
    {
      "text": "Carolynne Lord, Mike Hazas, Adrian K. Clear, Oliver Bates, Janine Morley, and Adrian Friday. 2015. Demand in my pocket: mobile devices and the data connectivity marshalled in support of everyday practice. In Proc. CHI.  ",
      "doi": "10.1145/2702123.2702162"
    },
    {
      "text": "Gloria Mark, Stephen Voida, and Armand Cardello. 2012. A pace not dictated by electrons: an empirical study of work without email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 555--564.  ",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Ofcom. 2015. Connected Nations Report 2015. Technical Report.",
      "doi": ""
    },
    {
      "text": "Ofcom. December 2014. Infrastructure Report 2014: Ofcom's second full analysis of the UK's communications infrastructure. Technical Report. Ofcom.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Sakari Tamminen, Virpi Roto, and Jaana Kuorelahti. 2005. Interaction in 4-second bursts: the fragmented nature of attentional resources in mobile HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Chris Preist, Daniel Schien, and Eli Blevis. 2016. Understanding and Mitigating the Effects of Device and Cloud Service Design Decisions on the Environmental Footprint of Digital Infrastructure. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1324--1337.  ",
      "doi": "10.1145/2858036.2858378"
    },
    {
      "text": "C. Preist and P. Shabajee. 2010. Energy Use in the Media Cloud: Behaviour Change, or Technofix?. In Cloud Computing Technology and Science (CloudCom), 2010 IEEE Second International Conference on. 581--586.  ",
      "doi": "10.1109/CloudCom.2010.40"
    },
    {
      "text": "Christian Remy, Silke Gegenbauer, and Elaine M. Huang. 2015. Bridging the Theory-Practice Gap: Lessons and Challenges of Applying the Attachment Framework for Sustainable HCI Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1305--1314.  ",
      "doi": "10.1145/2702123.2702567"
    },
    {
      "text": "Neil Robinson, Jon Freeman, Jan Gaspers, Veronika Horvath, Tess Hellgren, and Alex Hull. 2014. Living Room Connected Devices. (2014).",
      "doi": ""
    },
    {
      "text": "Inge Røpke and Toke Haunstrup Christensen. 2012. Energy impacts of ICT -- Insights from an everyday life perspective. Telematics and Informatics 29, 4 (2012).  ",
      "doi": "10.1016/j.tele.2012.02.001"
    },
    {
      "text": "Sandvine. 1h 2014. Global internet phenomena report. Technical Report. Sandvine Incorporated ULC.",
      "doi": ""
    },
    {
      "text": "Sandvine. 2015. Global internet phenomena report. Asia-Pacific and Europe. Technical Report. Sandvine Incorporated ULC.",
      "doi": ""
    },
    {
      "text": "Daniel Schien, Vlad C Coroama, Lorenz M Hilty, and Chris Preist. 2015. The energy intensity of the Internet: edge and core networks. In ICT Innovations for Sustainability. Springer, 157--170.",
      "doi": ""
    },
    {
      "text": "Daniel Schien and Chris Preist. 2014. A review of top-down models of internet network energy intensity. In ICT for Sustainability 2014 (ICT4S-14). Atlantis Press.",
      "doi": ""
    },
    {
      "text": "Daniel Schien, Paul Shabajee, Mike Yearworth, and Chris Preist. 2013. Modeling and Assessing Variability in Energy Consumption During the Use Stage of Online Multimedia Services. Journal of Industrial Ecology (2013), n/a--n/a.",
      "doi": ""
    },
    {
      "text": "A. Fleming Seay and Robert E. Kraut. 2007. Project Massive: Self-regulation and Problematic Use of Online Gaming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 829--838.  ",
      "doi": "10.1145/1240624.1240749"
    },
    {
      "text": "Phoebe Sengers. 2011. What I learned on Change Islands: reflections on IT and pace of life. interactions 18, 2 (2011), 40--48.  ",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "Elizabeth Shove, Mika Pantzar, and Matt Watson. 2012. The Dynamics of Social Practice: Everyday life and how it changes. Sage.",
      "doi": ""
    },
    {
      "text": "Tapio Soikkeli, Juuso Karikoski, and Heikki Hammainen. 2011. Diversity and end user context in smartphone usage sessions. In 2011 Fifth International Conference on Next Generation Mobile Applications, Services and Technologies. IEEE, 7--12.  ",
      "doi": "10.1109/NGMAST.2011.12"
    },
    {
      "text": "Yolande A.A. Strengers. 2011. Designing eco-feedback systems for everyday life. In Proc. of CHI. 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Sherry Turkle. 2012. Alone together: Why we expect more from technology and less from each other. Basic books. ",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Niels van Berkel, Chu Luo, Theodoros Anagnostopoulos, Denzil Ferreira, Jorge Goncalves, Simo Hosio, and Vassilis Kostakos. 2016. A Systematic Assessment of Smartphone Usage Gaps. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4711--4721.  ",
      "doi": "10.1145/2858036.2858348"
    },
    {
      "text": "Sha Zhao, Julian Ramos, Jianrong Tao, Ziwen Jiang, Shijian Li, Zhaohui Wu, Gang Pan, and Anind K Dey. 2016. Discovering different kinds of smartphone users through their application usage behaviors. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 498--509.  ",
      "doi": "10.1145/2971648.2971696"
    }
  ]
}