{
  "doi": "10.1145/3025453.3025669",
  "title": "EngageMeter: A System for Implicit Audience Engagement Sensing Using Electroencephalography",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5114-5119",
  "year": 2017,
  "badges": [],
  "abstract": "Obtaining information about audience engagement in presentations is a valuable asset for presenters in many domains. Prior literature mostly utilized explicit methods of collecting feedback which induce distractions, add workload on audience and do not provide objective information to presenters. We present EngageMeter - a system that allows fine-grained information on audience engagement to be obtained implicitly from multiple brain-computer interfaces (BCI) and to be fed back to presenters for real time and post-hoc access. Through evaluation during an HCI conference (Naudience=11, Npresenters=3) we found that EngageMeter provides value to presenters (a) in real-time, since it allows reacting to current engagement scores by changing tone or adding pauses, and (b) in post-hoc, since presenters can adjust their slides and embed extra elements. We discuss how EngageMeter can be used in collocated and distributed audience sensing as well as how it can aid presenters in long term use.",
  "authors": [
    {
      "name": "Mariam Hassib",
      "institution": "LMU Munich & University of Stuttgart, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958747857",
      "orcid": "missing"
    },
    {
      "name": "Stefan Schneegass",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81503680798/rel-imgonly/stefan_wide.png",
      "acmid": "81503680798",
      "orcid": "0000-0002-0132-4934"
    },
    {
      "name": "Philipp Eiglsperger",
      "institution": "LMU Munich, Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163070",
      "orcid": "missing"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    },
    {
      "name": "Florian Alt",
      "institution": "LMU Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Yomna Abdelrahman, Mariam Hassib, Maria Guinea Marquez, Markus Funk, and Albrecht Schmidt. 2015. Implicit Engagement Detection for Interactive Museums Using Brain-Computer Interfaces. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '15). ACM, New York, NY, USA, 838--845.  ",
      "doi": "10.1145/2786567.2793709"
    },
    {
      "text": "Marvin Andujar and Juan E. Gilbert. 2013. Let's Learn!: Enhancing User's Engagement Levels Through Passive Brain-computer Interfaces. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 703--708.  ",
      "doi": "10.1145/2468356.2468480"
    },
    {
      "text": "Louise Barkhuus and Tobias Jørgensen. 2008. Engaging the Crowd: Studies of Audience-performer Interaction. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 2925--2930.  ",
      "doi": "10.1145/1358628.1358785"
    },
    {
      "text": "Chris Berka, Daniel J. Levendowski, Michelle N. Lumicao, Alan Yau, Gene Davis, Vladimir T. Zivkovic, Richard E. Olmstead, Patrice D. Tremoulet, and Patrick L. Craven. 2007. EEG correlates of task engagement and mental workload in vigilance, learning, and memory tasks. Aviation, space, and environmental medicine 78, Supplement 1 (2007), B231--B244.",
      "doi": ""
    },
    {
      "text": "Laurent George and Anatole Lécuyer. 2010. An overview of research on \"passive\" brain-computer interfaces for implicit human-computer interaction. In International Conference on Applied Bionics and Biomechanics ICABB 2010 - Workshop W1 \"Brain-Computer Interfacing and Virtual Reality\". Venice, Italy. https://hal.inria.fr/inria-00537211",
      "doi": ""
    },
    {
      "text": "Alan Gevins, Michael E Smith, Harrison Leong, Linda McEvoy, Susan Whitfield, Robert Du, and Georgia Rush. 1998. Monitoring working memory load during computer-based tasks with EEG pattern recognition methods. Human Factors: The Journal of the Human Factors and Ergonomics Society 40, 1 (1998), 79--91.",
      "doi": ""
    },
    {
      "text": "J. Hernandez, Zicheng Liu, G. Hulten, D. DeBarr, K. Krum, and Z. Zhang. 2013. Measuring the engagement level of TV viewers. In 2013 10th IEEE International Conference and Workshops on Automatic Face and Gesture Recognition (FG). 1--7.",
      "doi": ""
    },
    {
      "text": "Jin Huang, Chun Yu, Yuntao Wang, Yuhang Zhao, Siqi Liu, Chou Mo, Jie Liu, Lie Zhang, and Yuanchun Shi. 2014. FOCUS: Enhancing Children's Engagement in Reading by Using Contextual BCI Training Sessions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1905--1908.  ",
      "doi": "10.1145/2556288.2557339"
    },
    {
      "text": "Johnny Chung Lee and Desney S. Tan. 2006. Using a Low-cost Electroencephalograph for Task Classification in HCI Research. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 81--90.  ",
      "doi": "10.1145/1166253.1166268"
    },
    {
      "text": "Marco Marchesi and Bruno Riccò. 2013. BRAVO: A Brain Virtual Operator for Education Exploiting Brain-computer Interfaces. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3091--3094.  ",
      "doi": "10.1145/2468356.2479618"
    },
    {
      "text": "R. Navarathna, P. Lucey, P. Carr, E. Carter, S. Sridharan, and I. Matthews. 2014. Predicting movie ratings from audience behaviors. In IEEE Winter Conference on Applications of Computer Vision. 1058--1065.",
      "doi": ""
    },
    {
      "text": "Anton Nijholt, Boris Reuderink, and Danny Oude Bos. In Proceedings of the Third International Conference on Intelligent Technologies for Interactive Entertainment, Vol. 9.",
      "doi": ""
    },
    {
      "text": "Alan T. Pope, Edward H. Bogart, and Debbie S. Bartolome. 1995. Biocybernetic system evaluates indices of operator engagement in automated task. Biological psychology 40, 1 (1995), 187--195.",
      "doi": ""
    },
    {
      "text": "Fernando Silveira, Brian Eriksson, Anmol Sheth, and Adam Sheppard. 2013. Predicting Audience Responses to Movie Content from Electro-dermal Activity Signals. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 707--716.  ",
      "doi": "10.1145/2493432.2493508"
    },
    {
      "text": "Daniel Szafir and Bilge Mutlu. 2012. Pay Attention! Designing Adaptive Agents That Monitor and Improve User Engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/2207676.2207679"
    },
    {
      "text": "Daniel Szafir and Bilge Mutlu. 2013. ARTFul: Adaptive Review Technology for Flipped Learning. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1001--1010.  ",
      "doi": "10.1145/2470654.2466128"
    },
    {
      "text": "Chi Thanh Vi, Jason Alexander, Pourang Irani, Behrad Babaee, and Sriram Subramanian. 2014. Quantifying EEG Measured Task Engagement for use in Gaming Applications. (nov 2014).",
      "doi": ""
    },
    {
      "text": "Chi Thanh Vi, Kazuki Takashima, Hitomi Yokoyama, Gengdai Liu, Yuichi Itoh, Sriram Subramanian, and Yoshifumi Kitamura. D-FLIP: Dynamic and Flexible Interactive PhotoShow. In Proceedings of the 10th International Conference on Advances in Computer Entertainment. (ACE'13).",
      "doi": ""
    },
    {
      "text": "Chen Wang, Erik N. Geelhoed, Phil P. Stenton, and Pablo Cesar. 2014. Sensing a Live Audience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1909--1912.  ",
      "doi": "10.1145/2556288.2557154"
    },
    {
      "text": "Shuo Yan, GangYi Ding, Hongsong Li, Ningxiao Sun, Yufeng Wu, Zheng Guan, Longfei Zhang, and Tianyu Huang. 2016. Enhancing Audience Engagement in Performing Arts Through an Adaptive Virtual Environment with a Brain-Computer Interface. In Proceedings of the 21st International Conference on Intelligent User Interfaces (IUI '16). ACM, New York, NY, USA, 306--316.  ",
      "doi": "10.1145/2856767.2856768"
    },
    {
      "text": "Beste F. Yuksel, Kurt B. Oleson, Lane Harrison, Evan M. Peck, Daniel Afergan, Remco Chang, and Robert J. K. Jacob. 2016. Learn Piano with BACh: An Adaptive Learning Interface That Adjusts Task Difficulty Based on Brain State. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5372--5384.  ",
      "doi": "10.1145/2858036.2858388"
    }
  ]
}