{
  "doi": "10.1145/3025453.3025773",
  "title": "Synthetic Sensors: Towards General-Purpose Sensing",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3986-3999",
  "year": 2017,
  "badges": [],
  "abstract": "The promise of smart environments and the Internet of Things (IoT) relies on robust sensing of diverse environmental facets. Traditional approaches rely on direct and distributed sensing, most often by measuring one particular aspect of an environment with a special purpose sensor. This approach can be costly to deploy, hard to maintain, and aesthetically and socially obtrusive. In this work, we explore the notion of general purpose sensing, wherein a single enhanced sensor can indirectly monitor a large context, without direct instrumentation of objects. Further, through what we call Synthetic Sensors, we can virtualize raw sensor data into actionable feeds, whilst simultaneously mitigating immediate privacy issues. A series of structured, formative studies informed the development of our new sensor hardware and accompanying information architecture. We deployed our system across many months and environments, the results of which show the versatility, accuracy and potential utility of our approach.",
  "tags": [
    "smart home",
    "universal sensor",
    "IoT",
    "internet-of-things"
  ],
  "authors": [
    {
      "name": "Gierad Laput",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "Yang Zhang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81548025596/rel-imgonly/yang.jpg",
      "acmid": "81548025596",
      "orcid": "0000-0003-2472-6968"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "R.E Abbott and S.C. Hadden. 1990. Product Specification for a Nonintrusive Appliance Load Monitoring System. EPRI Report #NI-101, 1990.",
      "doi": ""
    },
    {
      "text": "Ernesto Arroyo, Leonardo Bonanni, and Ted Selker. 2005. Waterbot: exploring feedback and persuasive techniques at the sink. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 631--639. DOI=http://dx.doi.org/10.1145/1054972.1055059  ",
      "doi": "10.1145/1054972.1055059"
    },
    {
      "text": "Chris Beckmann, Sunny Consolvo, and Anthony LaMarca. 2004. Some Assembly Required: Supporting End-User Sensor Installation in Domestic Ubiquitous Computing Environments. In Proceedings of Ubiquitous Computing (UbiComp '04), Nottingham, UK, September 7--10, 2004. 107--124. DOI=http://dx.doi.org/10.1007/978--3--540--30119--6_7",
      "doi": ""
    },
    {
      "text": "Alex Beltran, Varick L. Erickson, and Alberto E. Cerpa. 2013. ThermoSense: Occupancy Thermal Based Sensing for HVAC Control. In Proceedings of the 5th ACM Workshop on Embedded Systems For EnergyEfficient Buildings (BuildSys'13). ACM, NY, NY, USA. Article 11 , 8 pages. DOI=http://dx.doi.org/10.1145/2528282.2528301  ",
      "doi": "10.1145/2528282.2528301"
    },
    {
      "text": "Ari Ben-Menahem. 1995. \"A Concise History of Mainstream Seismology: Origins, Legacy, and Perspectives\". In Bulletin of the Seismological Society of America, Seismological Society of America, 85 (4): 1202-- 1225.",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST '10). ACM, NY, NY, USA, 333342. DOI=http://dx.doi.org/10.1145/1866029.1866080  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Michael Boyle and Saul Greenberg. 2005. The language of privacy: Learning from video media space analysis and design. In ACM Trans. Comput.-Hum. Interact. 12, 2 (June 2005), 328--370. DOI=http://dx.doi.org/10.1145/1067860.1067868  ",
      "doi": "10.1145/1067860.1067868"
    },
    {
      "text": "Michael Boyle, Christopher Edwards, and Saul Greenberg. 2000. The effects of filtered video on awareness and privacy. In Proceedings of the 2000 ACM conference on Computer supported cooperative work (CSCW '00). ACM, NY, NY, USA, 1--10. DOI=http://dx.doi.org/10.1145/358916.358935  ",
      "doi": "10.1145/358916.358935"
    },
    {
      "text": "Cao Wireless Sensor Tags: Monitor and Find Everything from the Internet. Last accessed: January 20, 2017. http://www.caogadgets.com/",
      "doi": ""
    },
    {
      "text": "Gabe Cohn, Sidhant Gupta, Jon Froehlich, Eric Larson, and Shwetak N. Patel. 2010. GasSense: ApplianceLevel, Single-Point Sensing of Gas Activity in the Home. In Pervasive Computing: 8th International Conference, Pervasive 2010, Helsinki, Finland, May 17--20, 2010. Springer. 265--282. DOI=http://dx.doi.org/10.1007/978--3--642--12654--3_16",
      "doi": ""
    },
    {
      "text": "Anind K. Dey, Raffay Hamid, Chris Beckmann, Ian Li, and Daniel Hsu. 2004. a CAPpella: programming by demonstration of context-aware applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 33--40. DOI=http://dx.doi.org/10.1145/985692.985697  ",
      "doi": "10.1145/985692.985697"
    },
    {
      "text": "Dialog Semiconductor. IoT Sensor Development Kit. Last accessed: January 20, 2017. http://www.dialog-semiconductor.com/iotsensor",
      "doi": ""
    },
    {
      "text": "EchoFlex: Clean Tech Lighting & Temperature Controls. Last accessed: January 20, 2017. http://www.echoflexsolutions.com/",
      "doi": ""
    },
    {
      "text": "Enlightened. Redefining Smart Buildings. Last accessed: January 20, 2017. http://www.enlightedinc.com",
      "doi": ""
    },
    {
      "text": "Jerry Fails and Dan Olsen. 2003. A design tool for camera-based interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 449456. DOI=http://dx.doi.org/10.1145/642611.642690  ",
      "doi": "10.1145/642611.642690"
    },
    {
      "text": "James Fogarty, Carolyn Au, and Scott E. Hudson. 2006. Sensing from the basement: a feasibility study of unobtrusive and low-cost home activity recognition. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06). ACM, NY, NY, USA, 91--100. DOI=http://dx.doi.org/10.1145/1166253.1166269  ",
      "doi": "10.1145/1166253.1166269"
    },
    {
      "text": "Jon E. Froehlich, Eric Larson, Tim Campbell, Conor Haggerty, James Fogarty, and Shwetak N. Patel. 2009. HydroSense: infrastructure-mediated single-point sensing of whole-home water activity. In Proceedings of the 11th international conference on Ubiquitous computing (UbiComp '09). ACM, NY, NY, USA, 235--244. DOI=http://dx.doi.org/10.1145/1620545.1620581  ",
      "doi": "10.1145/1620545.1620581"
    },
    {
      "text": "Anhong Guo, Xiang 'Anthony' Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P. Bigham. 2016. VizLens: A Robust and Interactive Screen Reader for Interfaces in the Real World. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 651--664. DOI: https://doi.org/10.1145/2984511.2984518",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Sidhant Gupta, Ke-Yu Chen, Matthew S. Reynolds, and Shwetak N. Patel. 2011. LightWave: using compact fluorescent lights as sensors. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, NY, NY, USA, 65--74. DOI=http://dx.doi.org/10.1145/2030112.2030122  ",
      "doi": "10.1145/2030112.2030122"
    },
    {
      "text": "Sidhant Gupta, Matthew S. Reynolds, and Shwetak N. Patel. 2010. ElectriSense: single-point sensing using EMI for electrical event detection and classification in the home. In Proceedings of the 12th ACM international conference on Ubiquitous computing (UbiComp '10). ACM, NY, NY, USA, 139--148. DOI=http://dx.doi.org/10.1145/1864349.1864375  ",
      "doi": "10.1145/1864349.1864375"
    },
    {
      "text": "Mark Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, Ian H. Witten (2009); The WEKA Data Mining Software: An Update; In SIGKDD Explorations, Volume 11, Issue 1.",
      "doi": ""
    },
    {
      "text": "George Hart. Advances in Nonintrusive Appliance Load Monitoring. In Proceedings of EPRI Information and Automation Conference '91.",
      "doi": ""
    },
    {
      "text": "George Hart. Nonintrusive Appliance Load Monitoring. 1992. In Proceedings of the IEEE EPRI Information and Automation Technology Conference, Washington, DC, June 26--28, 1992. 80(12), 1870--1891. DOI=http://dx.doi.org/10.1109/MIM.2016.7477956 ",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Leith Abdulla, Manas Mittal, and Scott R. Klemmer. 2007. Authoring sensor-based interactions by demonstration with direct manipulation and pattern recognition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 145--154. DOI=http://dx.doi.org/10.1145/1240624.1240646  ",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Björn Hartmann, Leslie Wu, Kevin Collins, and Scott R. Klemmer. 2007. Programming by a sample: rapidly creating web applications with d.mix. In Proceedings of the 20th annual ACM symposium on User interface software and technology (UIST '07). ACM, NY, NY, USA, 241--250. DOI=http://dx.doi.org/10.1145/1294211.1294254  ",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Jason Hill, Mike Horton, Ralph Kling, and Lakshman Krishnamurthy. 2004. The platforms enabling wireless sensor networks. In Communications of the ACM 47, 6 (June 2004), 41--46. DOI=http://dx.doi.org/10.1145/990680.990705  ",
      "doi": "10.1145/990680.990705"
    },
    {
      "text": "Geoffrey Hinton, and Ruslan Salakhutdinov. 2006. Reducing the Dimensionality of Data with Neural Networks. In Science 313 (5786): 504--507 (July 2006). DOI= http://dx.doi.org/10.1126/science.1127647 ",
      "doi": ""
    },
    {
      "text": "Scott E. Hudson and Ian Smith. 1996. Techniques for addressing fundamental privacy and disruption tradeoffs in awareness support systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work (CSCW '96), Mark S. Ackerman (Ed.). ACM, NY, NY, USA, 248--257. DOI=http://dx.doi.org/10.1145/240080.240295  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Younghun Kim, Thomas Schmid, Zainul M. Charbiwala, and Mani B. Srivastava. 2009. ViridiScope: design and implementation of a fine grained power monitoring system for homes. In Proceedings of the 11th international conference on Ubiquitous computing (UbiComp '09). ACM, NY, NY, USA, 245--254. DOI=http://dx.doi.org/10.1145/1620545.1620582  ",
      "doi": "10.1145/1620545.1620582"
    },
    {
      "text": "Neil Klingensmith, Joseph Bomber, and Suman Banerjee. 2014. Hot, cold and in between: enabling fine-grained environmental control in homes for efficiency and comfort. In Proceedings of the 5th international conference on Future energy systems (e-Energy '14). ACM, NY, NY, USA, 123--132. DOI=http://dx.doi.org/10.1145/2602044.2602049  ",
      "doi": "10.1145/2602044.2602049"
    },
    {
      "text": "Knocki: Turn Any Surface into a Remote Control. http://knocki.com/",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. UpStream: motivating water conservation with low-cost water flow sensing and persuasive displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 1851--1860. DOI=http://dx.doi.org/10.1145/1753326.1753604  ",
      "doi": "10.1145/1753326.1753604"
    },
    {
      "text": "Gierad Laput, Robert Xiao, and Chris Harrison. 2016. ViBand: High-Fidelity Bio-Acoustic Sensing Using Commodity Smartwatch Accelerometers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, NY, NY, USA, 321--333. DOI: https://doi.org/10.1145/2984511.2984582",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Gierad Laput, Walter S. Lasecki, Jason Wiese, Robert Xiao, Jeffrey P. Bigham, and Chris Harrison. 2015. Zensors: Adaptive, Rapidly Deployable, HumanIntelligent Sensor Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1935--1944. DOI: http://dx.doi.org/10.1145/2702123.2702416  ",
      "doi": "10.1145/2702123.2702416"
    },
    {
      "text": "Walter S. Lasecki, Young Chol Song, Henry Kautz, and Jeffrey P. Bigham. 2013. Real-time crowd labeling for deployable activity recognition. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, NY, NY, USA, 1203--1212. DOI=http://dx.doi.org/10.1145/2441776.2441912  ",
      "doi": "10.1145/2441776.2441912"
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2015. Sensor-based observations of daily living for aging in place. In Personal Ubiquitous Computing. 19, 1 (January 2015), 2743. DOI: http://dx.doi.org/10.1007/s00779-014-0810--3",
      "doi": ""
    },
    {
      "text": "Libelium. WaspMote Event Module. Last accessed: January 20, 2017. http://www.libelium.com/products/waspmote/",
      "doi": ""
    },
    {
      "text": "Felix Xiaozhu Lin, Daniel Ashbrook, and Sean White. 2011. RhythmLink: securely pairing I/O-constrained devices by tapping. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, NY, NY, USA, 263272. DOI=http://dx.doi.org/10.1145/2047196.2047231  ",
      "doi": "10.1145/2047196.2047231"
    },
    {
      "text": "Matrix One. The World's First IoT App Ecosystem. Last accessed: January 20, 2017. http://matrix.one/",
      "doi": ""
    },
    {
      "text": "Dan Maynes-Aminzade, Terry Winograd, and Takeo Igarashi. 2007. Eyepatch: prototyping camera-based interaction through examples. In Proceedings of the 20th annual ACM symposium on User interface software and technology (UIST '07). ACM, NY, NY, USA, 33--42. DOI=http://dx.doi.org/10.1145/1294211.1294219  ",
      "doi": "10.1145/1294211.1294219"
    },
    {
      "text": "Notion. Wireless Home Monitoring System. Last accessed: January 20, 2017. http://getnotion.com/",
      "doi": ""
    },
    {
      "text": "Shwetak N. Patel, Matthew S. Reynolds, and Gregory D. Abowd. 2009. Detecting Human Movement by Differential Air Pressure Sensing in HVAC System Ductwork: An Exploration in Infrastructure Mediated Sensing. In Proceedings of Pervasive '08. Springer-Verlag, Berlin, Heidelberg, 1--18. DOI=http://dx.doi.org/10.1007/978--3--540--79576--6_1",
      "doi": ""
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel, Peter Prettenhofer, Ron Weiss, Vincent Dubourg, Jake Vanderplas, Alexandre Passos, David Cournapeau, Matthieu Brucher, Matthieu Perrot, and Édouard Duchesnay. 2011. Scikit-learn: Machine Learning in Python. J. Mach. Learn. Res. 12 (November 2011), 2825--2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Mike Perkowitz, Matthai Philipose, Kenneth Fishkin, and Donald J. Patterson. 2004. Mining models of human activities from the web. In Proceedings of the 13th international conference on World Wide Web (WWW '04). ACM, NY, NY, USA, 573--582. DOI=http://dx.doi.org/10.1145/988672.988750  ",
      "doi": "10.1145/988672.988750"
    },
    {
      "text": "Nishkam Ravi, Nikhil Dandekar, Preetham Mysore, and Michael L. Littman. 2005. Activity recognition from accelerometer data. In Proceedings of the 17th conference on Innovative applications of artificial intelligence - Volume 3 (IAAI'05), Bruce Porter (Ed.), Vol. 3. AAAI Press 1541--1546.",
      "doi": ""
    },
    {
      "text": "Relayr Wunderbar. Last accessed: January 20, 2017. https://relayr.io/wunderbar/",
      "doi": ""
    },
    {
      "text": "Anthony Rowe, Vikram Gupta, and Ragunathan (Raj) Rajkumar. 2009. Low-power clock synchronization using electromagnetic energy radiating from AC power lines. In Proceedings of the 7th ACM Conference on Embedded Networked Sensor Systems (SenSys '09). ACM, NY, NY, USA, 211--224. DOI=http://dx.doi.org/10.1145/1644038.1644060  ",
      "doi": "10.1145/1644038.1644060"
    },
    {
      "text": "Gerard Salton and Christopher Buckley. 1988. Termweighting approaches in automatic text retrieval. In Information Processing & Management. 24 (5): 513--523. DOI=http://dx.doi.org/10.1016/0306--4573(88)90021-0",
      "doi": ""
    },
    {
      "text": "Samsung Electronics. SmartThings: Smart Home, Intelligent Living. Last accessed: January 20, 2017. https://www.smartthings.com",
      "doi": ""
    },
    {
      "text": "James Scott, A.J. Bernheim Brush, John Krumm, Brian Meyers, Michael Hazas, Stephen Hodges, and Nicolas Villar. 2011. PreHeat: controlling home heating using occupancy prediction. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, NY, NY, USA, 281--290. DOI=http://dx.doi.org/10.1145/2030112.2030151  ",
      "doi": "10.1145/2030112.2030151"
    },
    {
      "text": "Sears WallyHome: Smart Home Sensing and Moisture Detection. Last accessed: January 20, 2017. https://www.wallyhome.com/",
      "doi": ""
    },
    {
      "text": "Sen.se Mother. The Universal Monitoring Solution. Last accessed: January 20, 2017. https://sen.se/mother/",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Saul Greenberg, and Sidney Fels. 2008. Exploring video streams using slit-tear visualizations. In Proceedings of the working conference on Advanced visual interfaces (AVI '08). ACM, NY, NY, USA, 191--198. DOI=http://dx.doi.org/10.1145/1385569.1385601  ",
      "doi": "10.1145/1385569.1385601"
    },
    {
      "text": "Emmanuel Munguia Tapia, Stephen S. Intille, and Kent Larson. 2004. Activity Recognition in the Home Using Simple and Ubiquitous Sensors. In Pervasive Computing: Second International Conference, PERVASIVE 2004, Linz/Vienna, Austria, April 21--23, 2004. Springer. 158--175. DOI=http://dx.doi.org/10.1007/978--3--54024646--6_10",
      "doi": ""
    },
    {
      "text": "Emmanuel Munguia Tapia, Stephen S. Intille, and Kent Larson. 2007. Portable wireless sensors for object usage sensing in the home: challenges and practicalities. In Proceedings of the 2007 European conference on Ambient intelligence (AmI'07). Springer-Verlag, Berlin, Heidelberg, 19--37.",
      "doi": "10.5555/1775401.1775404"
    },
    {
      "text": "Texas Instruments. SimpleLink SensorTag. Last accessed: January 20, 2017. http://www.ti.com/ww/en/wireless_connectivity/sensort ag2015/gettingStarted.html",
      "doi": ""
    },
    {
      "text": "Theano Development Team. \"Theano: A Python framework for fast computation of mathematical expressions\". In arXiv e-prints, abs/1605.02688.",
      "doi": ""
    },
    {
      "text": "Eduardo Torres-Martinez, Granville Paules, Mark Schoeberl, and Mike Kalb. 2003. \"A Web of Sensors: Enabling the Earth Science Vision\". In Acta Astronautica, Volume 53, Issues 4--10. pp. 423--428. ",
      "doi": ""
    },
    {
      "text": "Jamie A. Ward, Paul Lukowicz, Gerhard Tröster, and Thad E. Starner. 2006. Activity recognition of assembly tasks using body-worn microphones and accelerometers. In IEEE Transactions on Pattern Analysis and Machine Intelligence. 28, 10 (2006), 1553--1567.  ",
      "doi": "10.1109/TPAMI.2006.197"
    },
    {
      "text": "Peter Willet. 1988. Recent trends in hierarchic document clustering: A critical review. In Information Processing & Management. 24 (5): 577--597. DOI=http://dx.doi.org/10.1016/0306--4573(88)90027--1",
      "doi": ""
    },
    {
      "text": "Daniel. H. Wilson and Chris. Atkeson. 2005. Simultaneous tracking and activity recognition (STAR) using many anonymous, binary sensors. In Proceedings of the Third international conference on Pervasive Computing (PERVASIVE'05), Hans-W. Gellersen, Roy Want, and Albrecht Schmidt (Eds.). Springer-Verlag, Berlin, Heidelberg, 62--79. DOI=http://dx.doi.org/10.1007/11428572_5  ",
      "doi": "10.1007/11428572_5"
    },
    {
      "text": "Danny Wyatt, Matthai Philipose, and Tanzeem Choudhury. 2005. Unsupervised activity recognition using automatically mined common sense. In Proceedings of the 20th national conference on Artificial intelligence - Volume 1 (AAAI'05), Anthony Cohn (Ed.), Vol. 1. AAAI Press 21--27.",
      "doi": "10.5555/1619332.1619338"
    },
    {
      "text": "Fang Zheng, Guoliang Zhang and Zhanjiang Song (2001), \"Comparison of Different Implementations of MFCC,\" J. In Computer Science & Technology, 16(6): 582--589  ",
      "doi": "10.1007/BF02943243"
    }
  ]
}