{
  "doi": "10.1145/3025453.3025719",
  "title": "GhostID: Enabling Non-Persistent User Differentiation in Frequency-Division Capacitive Multi-Touch Sensors",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "15-27",
  "year": 2017,
  "badges": [],
  "abstract": "Current touch devices are adept at tracking finger touches, but cannot distinguish if multiple touches are caused by different fingers on a single hand, by fingers from both hands of a single user, or by different users. This limitation significantly reduces the possibilities for interaction techniques in touch interfaces. We present GhostID, a capacitive sensor that can differentiate the origins of multiple simultaneous touches. Our approach analyzes the signal ghosting, already present as an artifact in a frequency-division touch controller, to differentiate touches from the same hand or different hands of a single user (77% reliability at 60 fps) or from two different users (95% reliability at 60 fps). In addition to GhostID, we also develop a framework of user-differentiation capabilities for touch input devices, and illustrate a set of interaction techniques enabled by GhostID.",
  "authors": [
    {
      "name": "Sidharth Sahdev",
      "institution": "University of Toronto & Tactual Labs, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022408",
      "orcid": "missing"
    },
    {
      "name": "Clifton Forlines",
      "institution": "Tactual Labs, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584798",
      "orcid": "missing"
    },
    {
      "name": "Ricardo Jota",
      "institution": "Tactual Labs, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81416594286/rel-imgonly/img_0133.jpg",
      "acmid": "81416594286",
      "orcid": "missing"
    },
    {
      "name": "Bruno De Araujo",
      "institution": "University of Toronto & Tactual Labs, Toronto, Canada",
      "img": "/do/10.1145/contrib-81310488636/rel-imgonly/brunohead.jpg",
      "acmid": "81310488636",
      "orcid": "missing"
    },
    {
      "name": "Braon Moseley",
      "institution": "Tactual Labs, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163105",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Deber",
      "institution": "Tactual Labs, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556766756",
      "orcid": "missing"
    },
    {
      "name": "Steven Sanders",
      "institution": "Tactual Labs, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533740",
      "orcid": "missing"
    },
    {
      "name": "Darren Leigh",
      "institution": "Tactual Labs, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100491228",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "Christopher Ackad, Andrew Clayphan, Roberto Martinez Maldonado, and Judy Kay. 2012. Seamless and Continuous User Identification for Interactive Tabletops Using Personal Device Handshaking and Body Tracking. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1775--1780. http://dx.doi.org/10.1145/2212776.2223708  ",
      "doi": "10.1145/2212776.2223708"
    },
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2011. Medusa: A Proximity-aware Multi-touch Tabletop. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 337--346. http://dx.doi.org/10.1145/2047196.2047240  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Hrvoje Benko, Meredith Ringel Morris, A. J. Brush, and Andy Wilson. 2009. Insights on Interactive Tabletops: A Survey of Researchers and Developers. Technical Report. Microsoft Research.",
      "doi": ""
    },
    {
      "text": "Bojan Blazicaa, Daniel Vladušica, and Dunja Mladenić. 2013. MTi: A Method for User Identification for Multitouch Displays. International Journal of Human-Computer Studies 71, 6 (2013), 691--702. http://dx.doi.org/10.1016/j.ijhcs.2013.03.002  ",
      "doi": "10.1016/j.ijhcs.2013.03.002"
    },
    {
      "text": "Andrew Clayphan, Roberto Martinez-Maldonado, Christopher Ackad, and Judy Kay. 2013. An Approach for Designing and Evaluating a Plug-in Vision-based Tabletop Touch Identification System. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13). ACM, New York, NY, USA, 373--382. http://dx.doi.org/10.1145/2541016.2541019  ",
      "doi": "10.1145/2541016.2541019"
    },
    {
      "text": "Padraig Cunningham and Sarah Jane Delany. 2007. k Nearest Neighbour Classifiers. Technical Report UCD-CSI-2007-4. University College Dublin.",
      "doi": ""
    },
    {
      "text": "Paul Dietz and Darren Leigh. 2001. DiamondTouch: A Multi-user Touch Technology. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 219--226. http://dx.doi.org/10.1145/502348.502389  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "K. C. Dohse, Thomas Dohse, Jeremiah D. Still, and Derrick J. Parkhurst. 200 Enhancing Multi-user Interaction with Multi-touch Tabletop Displays Using Hand Tracking. In Proceedings of the First International Conference on Advances in Computer-Human Interaction (ACHI 2008). IEEE Computer Society, Washington, DC, USA, 297--302. http://dx.doi.org/10.1109/ACHI.2008.11  ",
      "doi": "10.1109/ACHI.2008.11"
    },
    {
      "text": "Philipp Ewerling, Alexander Kulik, and Bernd Froehlich. 2012. Finger and Hand Detection for Multi-touch Interfaces Based on Maximally Stable Extremal Regions. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 173--182. http://dx.doi.org/10.1145/2396636.2396663  ",
      "doi": "10.1145/2396636.2396663"
    },
    {
      "text": "Clifton Forlines and Chia Shen. 2005. DTLens: Multi-user Tabletop Spatial Data Exploration. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (UIST '05). ACM, New York, NY, USA, 119--122. http://dx.doi.org/1145/1095034.1095055  ",
      "doi": "10.1145/1095034.1095055"
    },
    {
      "text": "Anhong Guo, Robert Xiao, and Chris Harrison. 2015. CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 59--62. http://dx.doi.org/10.1145/2817721.2817722  ",
      "doi": "10.1145/2817721.2817722"
    },
    {
      "text": "Jefferson Y. Han. 2005. Low-cost Multi-touch Sensing Through Frustrated Total Internal Reflection. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (UIST '05). ACM, New York, NY, USA, 115--118. http://dx.doi.org/10.1145/1095034.1095054  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Chris Harrison, Munehiko Sato, and Ivan Poupyrev. 2012. Capacitive Fingerprinting: Exploring User Differentiation by Sensing Electrical Properties of the Human Body. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 537--544. http://dx.doi.org/10.1145/2380116.2380183  ",
      "doi": "10.1145/2380116.2380183"
    },
    {
      "text": "Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, François Guimbretière, Marcel Gavriliu, Xiang 'Anthony' Chen, Fabrice Matulic, William Buxton, and Andrew Wilson. 20 Sensing Techniques for Tablet+Stylus Interaction. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 605--614. http://dx.doi.org/10.1145/2642918.2647379  ",
      "doi": "10.1145/2642918.2647379"
    },
    {
      "text": "Ken Hinckley, Seongkook Heo, Michel Pahud, Christian Holz, Hrvoje Benko, Abigail Sellen, Richard Banks, Kenton O'Hara, Gavin Smyth, and William Buxton. 2016. Pre-Touch Sensing for Mobile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2869--2881. http://dx.doi.org/10.1145/2858036.2858095  ",
      "doi": "10.1145/2858036.2858095"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2013. Fiberio: A Touchscreen That Senses Fingerprints. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 41--50. http://dx.doi.org/10.1145/2501988.2502021  ",
      "doi": "10.1145/2501988.2502021"
    },
    {
      "text": "Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3011--3014. http://dx.doi.org/10.1145/2702123.2702518  ",
      "doi": "10.1145/2702123.2702518"
    },
    {
      "text": "Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 303--312. http://dx.doi.org/10.1145/2807442.2807458  ",
      "doi": "10.1145/2807442.2807458"
    },
    {
      "text": "Gierad Laput, Chouchang Yang, Robert Xiao, Alanson Sample, and Chris Harrison. 2015. EM-Sense: Touch Recognition of Uninstrumented, Electrical and Electromechanical Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 157--166. http://dx.doi.org/10.1145/2807442.2807481  ",
      "doi": "10.1145/2807442.2807481"
    },
    {
      "text": "Darren Leigh, Clifton Forlines, Ricardo Jota, Steven Sanders, and Daniel Wigdor. 2014. High Rate, Low-latency Multi-touch Sensing with Simultaneous Orthogonal Multiplexing. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 355--364. http://dx.doi.org/10.1145/2642918.2647353  ",
      "doi": "10.1145/2642918.2647353"
    },
    {
      "text": "Nicolai Marquardt, Johannes Kiemer, David Ledo, Sebastian Boring, and Saul Greenberg. 2011. Designing User-, Hand-, and Handpart-aware Tabletop Interactions with the TouchID Toolkit. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '11). ACM, New York, NY, USA, 21--30. http://dx.doi.org/10.1145/2076354.2076358  ",
      "doi": "10.1145/2076354.2076358"
    },
    {
      "text": "Paul McAvinney. 1986. The Sensor Frame - A Gesture-Based Device for the Manipulation of Graphic Objects. Carnegie-Mellon University.",
      "doi": ""
    },
    {
      "text": "Tobias Meyer and Dominik Schmidt. 2010. IdWristbands: IR-based User Identification on Multi-touch Surfaces. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, New York, NY, USA, 277--278. http://dx.doi.org/10.1145/1936652.1936714  ",
      "doi": "10.1145/1936652.1936714"
    },
    {
      "text": "Philipp Mock, Jörg Edelmann, Andreas Schilling, and Wolfgang Rosenstiel. 2014. User Identification Using Raw Sensor Data from Typing on Interactive Displays. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, New York, NY, USA, 67--72. http://dx.doi.org/10.1145/2557500.2557503  ",
      "doi": "10.1145/2557500.2557503"
    },
    {
      "text": "Meredith Ringel Morris. 2006. Supporting Effective Interaction with Tabletop Groupware. Ph.D. Dissertation. Stanford University.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Anthony Cassanego, Andreas Paepcke, Terry Winograd, Ann Marie Piper, and Anqi Huang. 2006. Mediating Group Dynamics through Tabletop Interface Design. IEEE Computer Graphics and Applications 26, 5 (Sept 2006), 65--73. http://dx.doi.org/10.1109/MCG.2006.114  ",
      "doi": "10.1109/MCG.2006.114"
    },
    {
      "text": "Meredith Ringel Morris, Anqi Huang, Andreas Paepcke, and Terry Winograd. 2006. Cooperative Gestures: Multi-user Gestural Interactions for Co-located Groupware. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 1201--1210. http://dx.doi.org/10.1145/1124772.1124952  ",
      "doi": "10.1145/1124772.1124952"
    },
    {
      "text": "Sundar Murugappan, Vinayak, Niklas Elmqvist, and Karthik Ramani. 2012. Extended Multitouch: Recovering Touch Posture and Differentiating Users Using a Depth Camera. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 487--496. http://dx.doi.org/10.1145/2380116.2380177  ",
      "doi": "10.1145/2380116.2380177"
    },
    {
      "text": "Raf Ramakers, Davy Vanacken, Kris Luyten, Karin Coninx, and Johannes Schöning. 2012. Carpus: A Non-intrusive User Identification Technique for Interactive Surfaces. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 35--44. http://dx.doi.org/10.1145/2380116.2380123  ",
      "doi": "10.1145/2380116.2380123"
    },
    {
      "text": "Stephan Richter, Christian Holz, and Patrick Baudisch. 2012. Bootstrapper: Recognizing Tabletop Users by Their Shoes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1249--1252. http://dx.doi.org/10.1145/2207676.2208577  ",
      "doi": "10.1145/2207676.2208577"
    },
    {
      "text": "Volker Roth, Philipp Schmidt, and Benjamin Güldenring. 2010. The IR Ring: Authenticating Users' Touches on a Multi-touch Display. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 259--262. http://dx.doi.org/10.1145/1866029.1866071  ",
      "doi": "10.1145/1866029.1866071"
    },
    {
      "text": "Kathy Ryall, Clifton Forlines, Chia Shen, Meredith Ringel Morris, and Katherine Everitt. 2006. Experiences with and Observations of Direct-Touch Tabletops. In Proceedings of the First IEEE International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP '06). IEEE Computer Society, Washington, DC, USA, 89--96. http://dx.doi.org/10.1109/TABLETOP.2006.12  ",
      "doi": "10.1109/TABLETOP.2006.12"
    },
    {
      "text": "Napa Sae-Bae, Kowsar Ahmed, Katherine Isbister, and Nasir Memon. 2012. Biometric-rich Gestures: A Novel Approach to Authentication on Multi-touch Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 977--986. http://dx.doi.org/10.1145/2207676.2208543  ",
      "doi": "10.1145/2207676.2208543"
    },
    {
      "text": "Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: Enhancing Touch Interaction on Humans, Screens, Liquids, and Everyday Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 483--492. http://dx.doi.org/10.1145/2207676.2207743  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Dominik Schmidt, Fadi Chehimi, Enrico Rukzio, and Hans Gellersen. 2010. PhoneTouch: A Technique for Direct Phone Interaction on Surfaces. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 13--16. http://dx.doi.org/10.1145/1866029.1866034  ",
      "doi": "10.1145/1866029.1866034"
    },
    {
      "text": "Dominik Schmidt, Ming Ki Chong, and Hans Gellersen. 2010. HandsDown: Hand-contour-based User Identification for Interactive Surfaces. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 432--441. http://dx.doi.org/10.1145/1868914.1868964  ",
      "doi": "10.1145/1868914.1868964"
    },
    {
      "text": "Chia Shen, Katherine Everitt, and Kathleen Ryall. 2003. UbiTable: Impromptu Face-to-Face Collaboration on Horizontal Interactive Surfaces. In Proceedings of Ubiquitous Computing: 5th Inter-national Conference (UbiComp 2003). Springer Berlin Heidelberg, Berlin, Germany, 281--288. http://dx.doi.org/10.1007/978-3-540-39653-6_22 ",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive Public Ambient Displays: Transitioning from Implicit to Explicit, Public to Personal, Interaction with Multiple Users. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, New York, NY, USA, 137--146. http://dx.doi.org/10.1145/1029632.1029656  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Ulrich von Zadow, Patrick Reipschläger, Daniel Bösel, Anita Sellent, and Raimund Dachselt. 2016. YouTouch! Low-Cost User Identification at an Interactive Display Wall. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, New York, NY, USA, 144--151. http://dx.doi.org/10.1145/2909132.2909258  ",
      "doi": "10.1145/2909132.2909258"
    },
    {
      "text": "Tam Vu, Akash Baid, Simon Gao, Marco Gruteser, Richard Howard, Janne Lindqvist, Predrag Spa-sojevic, and Jeffrey Walling. 2012. Distinguishing Users with Capacitive Touch Communication. In Proceedings of the 18th Annual International Conference on Mobile Computing and Networking (MobiCom '12). ACM, New York, NY, USA, 197--208. http://dx.doi.org/10.1145/2348543.2348569  ",
      "doi": "10.1145/2348543.2348569"
    },
    {
      "text": "Cody Watts, Ehud Sharlin, and Peter Woytiuk. 2009. Matchmaker: Interpersonal Touch in Gaming. In Proceedings of the 4th International Conference on E-Learning and Games (Edutainment 2009). Springer Berlin Heidelberg, Berlin, Germany, 13--24. http://dx.doi.org/10.1007/978-3-642-03364-3_2  ",
      "doi": "10.1007/978-3-642-03364-3_2"
    },
    {
      "text": "Wayne Westerman. 1999. Hand Tracking, Finger Identification, and Chordic Manipulation on a Multi-touch Surface. Ph.D. Dissertation. University of Delaware.",
      "doi": ""
    },
    {
      "text": "Daniel Wigdor, Sarah Williams, Michael Cronin, Robert Levy, Katie White, Maxim Mazeev, and Hrvoje Benko. 2009. Ripples: Utilizing Per-contact Visualizations to Improve User Interaction with Touch Displays. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology (UIST '09). ACM, New York, NY, USA, 3--12. http://dx.doi.org/10.1145/1622176.1622180  ",
      "doi": "10.1145/1622176.1622180"
    },
    {
      "text": "Daniel Wigdor and Dennis Wixon. 2011. Brave NUI World: Designing Natural User Interfaces for Touch and Gesture. Elsevier, New York, NY, USA.",
      "doi": "10.5555/1995309"
    },
    {
      "text": "Andrew D. Wilson. 2010. Using a Depth Camera as a Touch Sensor. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, New York, NY, USA, 69--72. http://dx.doi.org/10.1145/1936652.1936665  ",
      "doi": "10.1145/1936652.1936665"
    },
    {
      "text": "Hong Zhang, Xing-Dong Yang, Barrett Ens, Hai-Ning Liang, Pierre Boulanger, and Pourang Irani. 2012. See Me, See You: A Lightweight Method for Discriminating User Touches on Tabletop Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2327--2336. http://dx.doi.org/10.1145/2207676.2208392  ",
      "doi": "10.1145/2207676.2208392"
    },
    {
      "text": "Zhensong Zhang, Fengjun Zhang, Hui Chen, Jiasheng Liu, Hongan Wang, and Guozhong Dai. 2014. Left and Right Hand Distinction for Multi-touch Tabletop Interactions. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, New York, NY, USA, 47--56. http://dx.doi.org/10.1145/2557500.2557525  ",
      "doi": "10.1145/2557500.2557525"
    }
  ]
}