{
  "doi": "10.1145/3025453.3025507",
  "title": "Priming Drivers before Handover in Semi-Autonomous Cars",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "392-404",
  "year": 2017,
  "badges": [],
  "abstract": "Semi-autonomous vehicles occasionally require control to be handed over to the driver in situations where the vehicle is unable to operate safely. Currently, such handover requests require the driver to take control almost instantaneously. We investigate how auditory pre-alerts that occur well before the handover request impact the success of the handover in a dual task scenario. In a study with a driving simulator, drivers perform tasks on their phone while the car is in an autonomous mode. They receive a repeated burst audio pre-alert or an increasing pulse audio pre-alert preceding the standard warning for immediate handover. Results show that pre-alerts caused people to look more at the road before the handover occurred, and to disengage from the secondary task earlier, compared to when there was no pre-alert. This resulted in safer handover situations. Increasing pulse pre-alerts show particular promise due to their communication of urgency. Our detailed analysis informs the design and evaluation of alerts in safety-critical systems with automation.",
  "tags": [
    "multitasking",
    "handover",
    "autonomous cars",
    "automation"
  ],
  "authors": [
    {
      "name": "Remo M.A. van der Heiden",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/do/10.1145/contrib-99659161893/rel-imgonly/fotoremo.jpeg",
      "acmid": "99659161893",
      "orcid": "missing"
    },
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Christian P. Janssen",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/do/10.1145/contrib-81100599716/rel-imgonly/logo_site2.jpg",
      "acmid": "81100599716",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hakan Alm and Lena Nilsson. 1995. The effects of a mobile telephone task on driver behavior in a car following situation. Accident Analysis and Prevention, 27(5), 707--715. http://doi.org/ 10.1016/00014575(95)00026-V",
      "doi": ""
    },
    {
      "text": "Erik M. Altmann and J. Gregory Trafton. 2002. Memory for goals: An activation-based model. Cognitive Science, 26(1), 39--83. http://doi.org/10.1016/S0364-0213(01)00058--1",
      "doi": ""
    },
    {
      "text": "Brian P. Bailey and Shamsi T. Iqbal. 2008. Understanding changes in mental workload during execution of goal-directed tasks and its application for interruption management. ACM Transactions on Computer-Human Interaction (TOCHI), 14(4), 1--28. http://doi.org/10.1145/1314683.1314689  ",
      "doi": "10.1145/1314683.1314689"
    },
    {
      "text": "Brian P. Bailey and John Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior, 22(4), 685--708. http://doi.org/10.1016/j.chb.2005.12.009 ",
      "doi": ""
    },
    {
      "text": "David Beattie, Lynne Baillie, and Martin Halvey. 2015. A comparison of artificial driving sounds for automated vehicles. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). NY, NY: ACM, 451--462. http://doi.org/10.1145/2750858.2807519  ",
      "doi": "10.1145/2750858.2807519"
    },
    {
      "text": "Deborah A. Boehm-Davis and Roger W. Remington. 2009. Reducing the disruptive effects of interruption: a cognitive framework for analysing the costs and benefits of intervention strategies. Accident Analysis & Prevention, 41(5), 1124--1129. http://doi.org/10.1016/j.aap.2009.06.029 ",
      "doi": ""
    },
    {
      "text": "Jelmer P. Borst, Niels A. Taatgen, Hedderik van Rijn. 2010. The Problem State: A Cognitive Bottleneck in Multitasking. Journal of Experimental Psychology. Learning, Memory, and Cognition, 36(2), 363--382. http://doi.org/10.1037/a0018106 ",
      "doi": ""
    },
    {
      "text": "Jelmer P. Borst, Niels A. Taatgen, Hedderik van Rijn. 2015. What Makes Interruptions Disruptive?: A Process-Model Account of the Effects of the Problem State Bottleneck on Task Interruption and Resumption. In Proceedings of the ACM Conference on Human Factors in Computing Systems, NY, NY: ACM, 2971--2980. http://doi.org/10.1145/2702123.2702156  ",
      "doi": "10.1145/2702123.2702156"
    },
    {
      "text": "Valdimar Briem and Leif R. Hedman. 1995. Behavioral effects of mobile telephone use during simulated driving. Ergonomics, 38, 2536--2562. http://doi.org/10.1080/00140139508925285 ",
      "doi": ""
    },
    {
      "text": "Karel Brookhuis, Gerbrand De Vries, Dick De Waard, 1991. The effects of mobile telephoning on driving performance. Accident Analysis and Prevention, 23, 309--316. http://doi.org/10.1016/0001--4575(91)90008-S",
      "doi": ""
    },
    {
      "text": "Duncan P. Brumby, Andrew Howes, Dario D. Salvucci. 2007. A cognitive constraint model of dualtask trade-offs in a highly dynamic driving task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, NY, NY: ACM, 233--242. http://doi.org/10.1145/1240624.1240664  ",
      "doi": "10.1145/1240624.1240664"
    },
    {
      "text": "Duncan P. Brumby, Dario D. Salvucci, Andrew Howes. 2009. Focus on Driving: How Cognitive Constraints Shape the Adaptation of Strategy when Dialing while Driving, In Proceedings of the SIGCHI conference on Human factors in computing systems, NY, NY: ACM, 1629--1638. http://doi.org/10.1145/1518701.1518950  ",
      "doi": "10.1145/1518701.1518950"
    },
    {
      "text": "Jeff K Caird, Chelsea R Willness, Piers Steel, Chip T Scialfa. 2008. A meta-analysis of the effects of cell phones on driver performance. Accident Analysis & Prevention, 40(4), 1282--1293. http://doi.org/10.1016/j.aap.2008.01.009",
      "doi": ""
    },
    {
      "text": "Yujia Cao, Sandro Castronovo, Angela Mahr, Christian Müller. 2016. On timing and modality choice with local danger warnings for drivers, In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications, Essen, Germany, 75--78. http://doi.org/10.1145/1620509.1620524  ",
      "doi": "10.1145/1620509.1620524"
    },
    {
      "text": "Geoff Cumming. 2013. Understanding the new statistics: Effect sizes, confidence intervals, and metaanalysis. NY, NY: Routledge.",
      "doi": ""
    },
    {
      "text": "Joost de Winter, Riender Happee, Marieke Martens, Neville Stanton. 2014. Effects of adaptive cruise control and highly automated driving on workload and situation awareness: A review of the empirical evidence. Transportation Research Part F: Traffic Psychology and Behaviour, 27, 196--217. http://doi.org/10.1016/j.trf.2014.06.016 ",
      "doi": ""
    },
    {
      "text": "Thomas A. Dingus, Feng Guo, Suzie Lee, Jonathan F. Antin, Miguel Perez, Mindy Buchanan-King, Jonathan Hankey. 2016. Driver crash risk factors and prevalence evaluation using naturalistic driving data. In Proceedings of the National Academy of Sciences, 2636--2641. http://doi.org/10.1073/pnas.1513271113 ",
      "doi": ""
    },
    {
      "text": "Johan Fagerlönn, Stefan Lindberg, and Anna Sirkka. 2012. Graded auditory warnings during in-vehicle use: using sound to guide drivers without additional noise. In Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '12). NY, NY: ACM, 85--91. http://doi.org/10.1145/2390256.2390269  ",
      "doi": "10.1145/2390256.2390269"
    },
    {
      "text": "Tom M. Gasser and Daniel Westhoff. 2012. BAStstudy: Definitions of automation and legal issues in Germany. Presented at the Presentation at the Road Vehicle Automation Workshop, Irvine, CA.",
      "doi": ""
    },
    {
      "text": "Christian Gold, Daniel Dambock, Lutz Lorenz and Klaus Bengler. 2013. \"Take over!\" How long does it take to get the driver back into the loop? Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 57(1), 1938--1942. http://doi.org/10.1177/1541931213571433 ",
      "doi": ""
    },
    {
      "text": "Ellen C. Haas and John G. Casali. 1993. The perceived urgency and detection time of multi-tone and frequency modulated warning signals. In Proceedings of the human factors and ergonomics society 37th annual meeting, Santa Monica, CA, USA, 544548. http://doi.org/10.1080/00140139508925270 ",
      "doi": ""
    },
    {
      "text": "Peter A. Hancock. 2013. Driven to distraction and back again. In M. A. Regan, J. D. Lee, & T. W. Victor (Eds.), Driver distraction and inattention advances in research and countermeasures. Chichester, UK, 9--25.",
      "doi": ""
    },
    {
      "text": "William J. Horrey and Chris D. Wickens. 2006. Examining the impact of cell phone conversations on driving using meta-analytic techniques. Human Factors, 48(1), 196--205. http://doi.org/10.1518/001872006776412135 ",
      "doi": ""
    },
    {
      "text": "Barbara Illowsky and Susan L. Dean. 2008. Collaborative Statistics, Connexions.",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal, Eric Horvitz, Yun-Cheng Ju, Ella Mathews. 2011. Hang on a sec!: effects of proactive mediation of phone conversations while driving. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, NY, NY: ACM, 463--472. http://doi.org/10.1145/1978942.1979008  ",
      "doi": "10.1145/1978942.1979008"
    },
    {
      "text": "Shamsi T. Iqbal, Yun-Cheng Ju, Eric Horvitz. 2010. Cars, calls, and cognition: investigating driving and divided attention In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, NY, NY: ACM, 1281--1290. http://doi.org/10.1145/1753326.1753518  ",
      "doi": "10.1145/1753326.1753518"
    },
    {
      "text": "Christian P. Janssen and Duncan P. Brumby. 2010. Strategic Adaptation to Performance Objectives in a Dual-Task Setting. Cognitive Science, 34(8), 15481560. http://doi.org/10.1111/j.1551--6709.2010.01124.x",
      "doi": ""
    },
    {
      "text": "Christian P. Janssen, Duncan P. Brumby, Rae Garnett. 2012. Natural Break Points The Influence of Priorities and Cognitive and Motor Cues on Dual-Task Interleaving. Journal of Cognitive Engineering and Decision Making, 6(1), 5--29. http://doi.org/10.1177/1555343411432339 ",
      "doi": ""
    },
    {
      "text": "Christian P. Janssen, Shamsi T. Iqbal, Yuncheng Ju. 2014. Sharing a Driver's Context with a Caller via Continuous Audio Cues to Increase Awareness about Driver State. Journal of Experimental Psychology: Applied, 20(3), 270. http://doi.org/10.1037/xap0000020 ",
      "doi": ""
    },
    {
      "text": "Myounghoon Jeon, Thomas M Gable, Benjamin K Davison, Michael A Nees, Jeff Wilson and Bruce N. Walker. 2015. Menu navigation with in-vehicle technologies: Auditory menu cues improve dual task performance, preference, and workload. International Journal of Human-Computer Interaction, 31(1), 1--16. http://doi.org/10.1080/10447318.2014.925774",
      "doi": ""
    },
    {
      "text": "Sheila G. Klauer, Feng Guo, Bruce G. SimonsMorton, Marie Claude Ouimet, Suzanne E. Lee and Thomas A. Dingus. 2014. Distracted Driving and Risk of Road Crashes among Novice and Experienced Drivers. New England Journal of Medicine, 370(1), 5459. http://doi.org/10.1056/NEJMsa1204142",
      "doi": ""
    },
    {
      "text": "Jeamin Koo, Jungsuk Kwac, Wendy Ju, Martin Steinert, Larry Leifer and Clifford Nass. 2014. Why did my car just do that? Explaining semiautonomous driving actions to improve driver understanding, trust, and performance. International Journal on Interactive Design and Manufacturing, 1--7. http://doi.org/ 10.1007/s12008-014-0227--2",
      "doi": ""
    },
    {
      "text": "John D Lee, Brent Caven, Steven Haake and Timothy L Brown. 2001. Speech-based Interaction with Invehicle Computers: The Effect of Speech-based E-mail on Driver's attention to the Roadway. Human Factors, 43, 631--640. http://doi.org/10.1518/001872001775870340",
      "doi": ""
    },
    {
      "text": "Angela Mahr, Margarita Pentcheva, Christian Müller. 2009. Towards system-mediated car passenger communication, Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications, Essen, Germany 79--80. http://doi.org/10.1145/1620509.1620525  ",
      "doi": "10.1145/1620509.1620525"
    },
    {
      "text": "Daniel C. McFarlane. 2002. Comparison of four primary methods for coordinating the interruption of people in human-computer interaction. Human Computer Interaction, 17(1), 63--139. http://doi.org/10.1207/S15327051HCI1701_2  ",
      "doi": "10.1207/S15327051HCI1701_2"
    },
    {
      "text": "Alexander Meschtscherjakov, David Wilfinger, Thomas Scherndl, Manfred Tscheligi. 2009. Acceptance of future persuasive in-car interfaces towards a more economic driving behaviour, In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications, Essen, Germany, 8188. http://doi.org/10.1145/1620509.1620526  ",
      "doi": "10.1145/1620509.1620526"
    },
    {
      "text": "Bruce Mehler, Bryan Reimer and Joseph F Coughlin. 2012. Sensitivity of physiological measures for detecting systematic variations in cognitive demand from a working memory task: an on-road study across three age groups. Human Factors, 54(3), 396--412.",
      "doi": ""
    },
    {
      "text": "Todd A. Mondor and G.A. Finley. 2013. The perceived urgency of auditory warning alarms used in the hospital operating room is inappropriate. Candian Journal of anaesthesia, 50, 221--228. http://doi.org/10.1007/BF03017788",
      "doi": ""
    },
    {
      "text": "National Highway Traffic Safety Administration. 2013. Preliminary statement of policy concerning automated vehicles, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Frederik Naujoks, Christoph Mai and Alexandra Neukum. 2014.The effect of urgency of take-over requests during highly automated driving under distraction conditions. In Proceedings of the 5th International Conference on Applied Human Factors and Ergonomics AHFE 2014, 431--438.",
      "doi": ""
    },
    {
      "text": "Ioannis Politis, Stephen Brewster, Frank Pollick. 2014. Evaluating multimodal driver displays under varying situational urgency. In Proceedings of the 32nd annual SIGCHI conference on Human Factors in Computing System, NY, NY: ACM, 2067--4076. http://doi.org/10.1145/2556288.2556988  ",
      "doi": "10.1145/2556288.2556988"
    },
    {
      "text": "Ioannis Politis, Stephen Brewster, Frank Pollick. 2014. Speech tactons improve speech warnings for drivers. In Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, NY, NY: ACM, 1--8. http://doi.org/10.1145/2667317.2667318  ",
      "doi": "10.1145/2667317.2667318"
    },
    {
      "text": "Ioannis Politis, Stephen Brewster, Frank Pollick. 2013. Evaluating multimodal driver displays of varying urgency. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, NY, NY: ACM, 92--99. http://doi.org/10.1145/2516540.2516543  ",
      "doi": "10.1145/2516540.2516543"
    },
    {
      "text": "Ioannis Politis, Stephen Brewster, Frank Pollick. 2015. Language-based multimodal displays for the handover of control in autonomous cars. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '15), NY, NY: ACM, 3--10. http://doi.org/10.1145/2799250.2799262  ",
      "doi": "10.1145/2799250.2799262"
    },
    {
      "text": "Donald A. Redelmeier and Robert J. Tibshirani. 2009. Association between cellular-telephone calls and motor vehicle collisions. New England Journal of Medicine, 336(7), 453--458. http://doi.org/10.1056/NEJM199702133360701 ",
      "doi": ""
    },
    {
      "text": "Nick Reed and R. Robbins. 2008. The Effect of Text Messaging on Driver Behavior: A Simulator Study Transport Research Lab Report, PPR 367.",
      "doi": ""
    },
    {
      "text": "SAE International. 2014. J3016: Taxonomy and Definitions for Terms Related to On-Road Motor Vehicle Automated Driving Systems. Retrieved from http://standards.sae.org/j3016_201401/.",
      "doi": ""
    },
    {
      "text": "Dario D. Salvucci. 2005. A Multitasking General Executive for Compound Continuous Tasks. Cognitive Science, 29(3), 457--492. http://doi.org/10.1207/s15516709cog0000_19 ",
      "doi": ""
    },
    {
      "text": "Dario D. Salvucci and Peter Bogunovich. 2010. Multitasking and Monotasking: The Effects of Mental Workload on Deferred Task Interruptions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, NY, NY: ACM, 85--88. http://doi.org/ 10.1145/1753326.1753340  ",
      "doi": "10.1145/1753326.1753340"
    },
    {
      "text": "Dario D. Salvucci and Niels A. Taatgen. 2011. The Multitasking Mind. NY, NY: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Dario D. Salvucci, Daniel Markley, Mark Zuber, Duncan P. Brumby, 2007. iPod distraction: effects of portable music-player use on driver performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, NY, NY: ACM, 243--250. http://doi.org/10.1145/1240624.1240665  ",
      "doi": "10.1145/1240624.1240665"
    },
    {
      "text": "David L Strayer, Joel M Cooper, Jonna Turrill, James R Coleman and Rachel J Hopman. 2015. Measuring Cognitive Distraction in the Automobile III: A Comparison of Ten 2015 In-Vehicle Information Systems, 1--46.",
      "doi": ""
    },
    {
      "text": "Chris Urmson, (2015, May 11). The View from the Front Seat of the Google Self-Driving Car. Medium.com. Retrieved from https://medium.com/backchannel/the-view-from-thefront-seat-of-the-google-self-driving-car-46fc9f3e6088",
      "doi": ""
    },
    {
      "text": "Marcel Walch, Kristin Lange, Martin Baumann and Michael Weber. 2015. Autonomous driving: investigating the feasibility of car-driver handover assistance. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications, NY, NY: ACM 11--18. http://doi.org/10.1145/2799250.2799268  ",
      "doi": "10.1145/2799250.2799268"
    },
    {
      "text": "Chris D. Wickens. 2008. Multiple Resources and Mental Workload. Human Factors, 50(3), 449--455. http://doi.org/10.1518/001872008X288394 ",
      "doi": ""
    },
    {
      "text": "Wolfe M. Jeremy, Todd S. Horowitz, Michael J. Van Wert, Naomi M. Kenner, Skyler S. Place, and Nour Kibbi. 2007. Low target prevalence is a stubborn source of errors in visual search tasks. Journal of Experimental Psychology: General 136(4), 623. http://doi.org/10.1037/0096--3445.136.4.623",
      "doi": ""
    }
  ]
}