{
  "doi": "10.1145/3025453.3025945",
  "title": "Older Adults Learning Computer Programming: Motivations, Frustrations, and Design Opportunities",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "7070-7083",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Computer programming is a highly in-demand skill, but most learn-to-code initiatives and research target some of the youngest members of society: children and college students. We present the first known study of older adults learning computer programming. Using an online survey with 504 respondents aged 60 to 85 who are from 52 different countries, we discovered that older adults were motivated to learn to keep their brains challenged as they aged, to make up for missed opportunities during youth, to connect with younger family members, and to improve job prospects. They reported frustrations including a perceived decline in cognitive abilities, lack of opportunities to interact with tutors and peers, and trouble dealing with constantly-changing software technologies. Based on these findings, we propose a learner-centered design of techniques and tools for motivating older adults to learn programming and discuss broader societal implications of a future where more older adults have access to computer programming -- not merely computer literacy -- as a skill set.",
  "authors": [
    {
      "name": "Philip J. Guo",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488891",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2016. About Scratch. https://scratch.mit.edu/about. (2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "2016. Lumosity: Brain Games & Brain Training. https://www.lumosity.com/. (2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Amjad Altadmri and Neil C.C. Brown. 2015. 37 Million Compilations: Investigating Novice Programming Mistakes in Large-Scale Student Data. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGCSE '15). ACM, NY, NY, USA, 522--527.  ",
      "doi": "10.1145/2676723.2677258"
    },
    {
      "text": "Continuum Analytics. 2016. Anaconda Distribution Open Data Science Core. https://docs.continuum.io/anaconda/. (2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Ingrid Arreola, Zan Morris, Matthew Francisco, Kay Connelly, Kelly Caine, and Ginger White. 2014. From Checking on to Checking in: Designing for Low Socio-economic Status Older Adults. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1933--1936.  ",
      "doi": "10.1145/2556288.2557084"
    },
    {
      "text": "Andrew Begel and Beth Simon. 2008. Struggles of New College Graduates in Their First Software Development Job. In Proceedings of the 39th SIGCSE Technical Symposium on Computer Science Education (SIGCSE '08). ACM, NY, NY, USA, 226--230.  ",
      "doi": "10.1145/1352135.1352218"
    },
    {
      "text": "Lori Breslow, David E Pritchard, Jennifer DeBoer, Glenda S Stump, Andrew D Ho, and Daniel T Seaton. 2013. Studying learning in the worldwide classroom: Research into edX's first MOOC. Research & Practice in Assessment 8 (2013).",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. \"Why Would Anybody Do This\"?: Understanding Older Adults' Motivations and Challenges in Crowd Work. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 2246--2257.  ",
      "doi": "10.1145/2858036.2858198"
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. \"Tell It Like It Really Is\": A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5529--5542.  ",
      "doi": "10.1145/2858036.2858379"
    },
    {
      "text": "Bo Brinkman and Amanda Diekman. 2016. Applying the Communal Goal Congruity Perspective to Enhance Diversity and Inclusion in Undergraduate Computing Degrees. In Proceedings of the 47th ACM Technical Symposium on Computing Science Education (SIGCSE '16). ACM, NY, NY, USA, 102--107.  ",
      "doi": "10.1145/2839509.2844562"
    },
    {
      "text": "Kevin Casey. 2013. Are You Too Old For IT? http://www.informationweek.com/strategic-cio/ team-building-and-staffing/ are-you-too-old-for-it/d/d-id/1006268. (Nov 2013). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Parmit K. Chilana, Rishabh Singh, and Philip J. Guo. 2016. Understanding Conversational Programmers: A Perspective from the Software Industry. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1462--1472.  ",
      "doi": "10.1145/2858036.2858323"
    },
    {
      "text": "Juliet M. Corbin and Anselm L. Strauss. 2008. Basics of qualitative research: techniques and procedures for developing grounded theory. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Brian Dorn and Mark Guzdial. 2010. Learning on the Job: Characterizing the Programming Knowledge and Learning Strategies of Web Designers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 703--712.  ",
      "doi": "10.1145/1753326.1753430"
    },
    {
      "text": "Stuart Dredge. 2014. Coding at school: a parent's guide to England's new computing curriculum. The Guardian: https: //www.theguardian.com/technology/2014/sep/04/ coding-school-computing-children-programming. (Sep 2014). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Barbara Ericson and Mark Guzdial. 2014. Measuring Demographics and Performance in Computer Science Education at a Nationwide Scale Using AP CS Data. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14). ACM, NY, NY, USA, 217--222.  ",
      "doi": "10.1145/2538862.2538918"
    },
    {
      "text": "Barbara J. Ericson, Kantwon Rogers, Miranda Parker, Briana Morrison, and Mark Guzdial. 2016. Identifying Design Principles for CS Teacher Ebooks Through Design-Based Research. In Proceedings of the 2016 ACM Conference on International Computing Education Research (ICER '16). ACM, NY, NY, USA, 191--200.  ",
      "doi": "10.1145/2960310.2960335"
    },
    {
      "text": "Deborah A. Fields, Michael Giang, and Yasmin Kafai. 2014. Programming in the Wild: Trends in Youth Computational Participation in the Online Scratch Community. In Proceedings of the 9th Workshop in Primary and Secondary Computing Education (WiPSCE '14). ACM, NY, NY, USA, 2--11.  ",
      "doi": "10.1145/2670757.2670768"
    },
    {
      "text": "Robert Bruce Findler. 2013. DrRacket: The Racket Programming Environment. http://mirror.racket-lang.org/releases/6.4/ pdf-doc/drracket.pdf. (2013). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Louise P. Flannery, Brian Silverman, Elizabeth R. Kazakoff, Marina Umaschi Bers, Paula Bontá, and Mitchel Resnick. 2013. Designing ScratchJr: Support for Early Childhood Learning Through Computer Programming. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, NY, NY, USA, 1--10.  ",
      "doi": "10.1145/2485760.2485785"
    },
    {
      "text": "National Science Foundation. 2016. Broadening Participation in Computing (BPC). http://www.nsf.gov/funding/pgm_summ.jsp?pims_ id=13510&org=CISE&from=fund. (2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Lorna Gibson, Wendy Moncur, Paula Forbes, John Arnott, Christopher Martin, and Amritpal S. Bhachu. 2010. Designing Social Networking Sites for Older Adults. In Proceedings of the 24th BCS Interaction Specialist Group Conference (BCS '10). British Computer Society, Swinton, UK, UK, 186--194. http: //dl.acm.org/citation.cfm?id=2146303.2146331 ",
      "doi": "10.5555/2146303.2146331"
    },
    {
      "text": "Paul A. Gross, Micah S. Herstand, Jordana W. Hodges, and Caitlin L. Kelleher. 2010. A Code Reuse Interface for Non-programmer Middle School Students. In Proceedings of the 15th International Conference on Intelligent User Interfaces (IUI '10). ACM, NY, NY, USA, 219--228.  ",
      "doi": "10.1145/1719970.1720001"
    },
    {
      "text": "Philip J. Guo. 2013. Online Python Tutor: Embeddable Web-based Program Visualization for CS Education. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (SIGCSE '13). ACM, NY, NY, USA, 579--584.  ",
      "doi": "10.1145/2445196.2445368"
    },
    {
      "text": "Mark Guzdial. 2015. Learner-Centered Design of Computing Education: Research on Computing for Everyone. Synthesis Lectures on Human-Centered Informatics 8, 6 (2015), 1--165.",
      "doi": ""
    },
    {
      "text": "Mark Guzdial and Andrea Forte. 2005. Design Process for a Non-majors Computing Course. In Proceedings of the 36th SIGCSE Technical Symposium on Computer Science Education (SIGCSE '05). ACM, NY, NY, USA, 361--365.  ",
      "doi": "10.1145/1047344.1047468"
    },
    {
      "text": "Toshiyuki Hagiya, Toshiharu Horiuchi, and Tomonori Yazaki. 2016. Typing Tutor: Individualized Tutoring in Text Entry for Older Adults Based on Input Stumble Detection. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 733--744.  ",
      "doi": "10.1145/2858036.2858455"
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. The weirdest people in the world? Behavioral and brain sciences 33, 2--3 (2010), 61--83.",
      "doi": ""
    },
    {
      "text": "Andrew Dean Ho, Isaac Chuang, Justin Reich, Cody Austun Coleman, Jacob Whitehill, Curtis G Northcutt, Joseph Jay Williams, John D Hansen, Glenn Lopez, and Rebecca Petersen. 2015. HarvardX and MITx: Two years of open online courses fall 2012-summer 2014. Available at SSRN 2586847 (2015).",
      "doi": ""
    },
    {
      "text": "Alexis Hope, Ted Schwaba, and Anne Marie Piper. 2014. Understanding Digital and Material Social Communications for Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3903--3912.  ",
      "doi": "10.1145/2556288.2557133"
    },
    {
      "text": "Carol Hymowitz and Robert Burnson. 2016. It's Tough Being Over 40 in Silicon Valley. Bloomberg Businessweek. (Sep 2016).",
      "doi": ""
    },
    {
      "text": "Jeff Immelt. 2016. Why GE is giving up employee ratings, abandoning annual reviews and rethinking the role of HQ. LinkedIn Pulse interview. (Aug 2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Caitlin Kelleher, Randy Pausch, and Sara Kiesler. 2007. Storytelling Alice Motivates Middle School Girls to Learn Computer Programming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 1455--1464.  ",
      "doi": "10.1145/1240624.1240844"
    },
    {
      "text": "Eric Klopfer, Hal Scheintaub, Wendy Huang, and Daniel Wendel. 2009. StarLogo TNG. In Artificial Life Models in Software. Springer, 151--182.",
      "doi": ""
    },
    {
      "text": "Celine Latulipe, Amy Gatto, Ha T. Nguyen, David P. Miller, Sara A. Quandt, Alain G. Bertoni, Alden Smith, and Thomas A. Arcury. 2015. Design Considerations for Patient Portal Adoption by Low-Income, Older Adults. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3859--3868.  ",
      "doi": "10.1145/2702123.2702392"
    },
    {
      "text": "Rock Leung, Charlotte Tang, Shathel Haddad, Joanna Mcgrenere, Peter Graf, and Vilia Ingriany. 2012. How Older Adults Learn to Use Mobile Devices: Survey and Field Investigations. ACM Trans. Access. Comput. 4, 3, Article 11 (Dec. 2012), 33 pages.  ",
      "doi": "10.1145/2399193.2399195"
    },
    {
      "text": "Q. Vera Liao and Wai-Tat Fu. 2014. Age Differences in Credibility Judgments of Online Health Information. ACM Trans. Comput.-Hum. Interact. 21, 1, Article 2 (Feb. 2014), 23 pages.  ",
      "doi": "10.1145/2534410"
    },
    {
      "text": "Siân E. Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to Be in Touch in a Changing Communications Landscape: Attitudes of Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1693--1702.  ",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Johanna Meurer, Martin Stein, David Randall, Markus Rohde, and Volker Wulf. 2014. Social Dependency and Mobile Autonomy: Supporting Older Adults' Mobility with Ridesharing ICT. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 1923--1932.  ",
      "doi": "10.1145/2556288.2557300"
    },
    {
      "text": "Nancy Morrow-Howell, Jim Hinterlong, Philip A Rozario, and Fengyan Tang. 2003. Effects of volunteering on the well-being of older adults. The Journals of Gerontology Series B: Psychological Sciences and Social Sciences 58, 3 (2003), S137--S145.",
      "doi": ""
    },
    {
      "text": "United Nations. 2015. World Population Ageing Report. http: //www.un.org/en/development/desa/population/ publications/pdf/ageing/WPA2015_Report.pdf. (2015). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Hugo Nicolau and Joaquim Jorge. 2012. Elderly Text-entry Performance on Touchscreens. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12). ACM, NY, NY, USA, 127--134.  ",
      "doi": "10.1145/2384916.2384939"
    },
    {
      "text": "Galit Nimrod. 2011. The fun culture in seniors' online communities. The Gerontologist 51, 2 (2011), 226--237.",
      "doi": ""
    },
    {
      "text": "Chris Norval, John L. Arnott, and Vicki L. Hanson. 2014. What's on Your Mind?: Investigating Recommendations for Inclusive Social Networking and Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3923--3932.  ",
      "doi": "10.1145/2556288.2556992"
    },
    {
      "text": "British Columbia Ministry of Health. 2004. Social Isolation Among Seniors: An Emerging Issue. http: //www.health.gov.bc.ca/library/publications/ year/2004/Social_Isolation_Among_Seniors.pdf. (Mar 2004). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "The White House: Office of the Press Secretary. 2016. FACT SHEET: President Obama Announces Computer Science For All Initiative. (Jan 2016).",
      "doi": ""
    },
    {
      "text": "International Labour Organization. 2008. International Standard Classification of Occupations. http://www.ilo.org/public/english/bureau/stat/ isco/isco08/. (2008). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc., NY, NY, USA. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Annie Murphy Paul. 2014. Bill Gates Is an Autodidact. You're Probably Not. Ed tech promoters need to understand how most of us learn. Slate (July 2014).",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological Caregiving: Supporting Online Activity for Adults with Cognitive Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 5311--5323.  ",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Leo Porter, Dennis Bouvier, Quintin Cutts, Scott Grissom, Cynthia Lee, Robert McCartney, Daniel Zingaro, and Beth Simon. 2016. A Multi-institutional Study of Peer Instruction in Introductory Computing. In Proceedings of the 47th ACM Technical Symposium on Computing Science Education (SIGCSE '16). ACM, NY, NY, USA, 358--363.  ",
      "doi": "10.1145/2839509.2844642"
    },
    {
      "text": "Laura Ramos, Elise van den Hoven, and Laurie Miller. 2016. Designing for the Other \"Hereafter\": When Older Adults Remember About Forgetting. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 721--732.  ",
      "doi": "10.1145/2858036.2858162"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate L. Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never Too Old: Engaging Retired People Inventing the Future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 3913--3922.  ",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Jason Scott. 2014. Aging Australians Balk at World's Oldest Retirement Age. Bloomberg News. (Jun 2014).",
      "doi": ""
    },
    {
      "text": "The Yomiuri Shimbun. 2016. Plan to make programming mandatory at schools a step to foster creativity. http: //the-japan-news.com/news/article/0002951918. (May 2016). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Sarah Stevenson. 2014. 20 Facts about Senior Isolation That Will Stun You. http://www.aplaceformom.com/ blog/10--17--14-facts-about-senior-isolation/. (Oct 2014). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Trans. Comput.-Hum. Interact. 22, 1, Article 2 (Feb. 2015), 27 pages.  ",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Amy Voida, Sheelagh Carpendale, and Saul Greenberg. 2010. The Individual and the Group in Console Gaming. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, NY, NY, USA, 371--380.  ",
      "doi": "10.1145/1718918.1718983"
    },
    {
      "text": "Todd Wasserman. 2014. Old Coders: When Programming Is a Second Career. Mashable Business: http://mashable.com/2014/08/21/ programming-as-a-second-career/. (Aug 2014). Accessed: 2016-09--19.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner, and John Downs. 2013. Older Adults As Digital Content Producers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 39--48.  ",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Uri Wilensky, Corey E. Brady, and Michael S. Horn. 2014. Fostering Computational Literacy in Science Classrooms. Commun. ACM 57, 8 (Aug. 2014), 24--28.  ",
      "doi": "10.1145/2633031"
    },
    {
      "text": "David Wolber, Hal Abelson, Ellen Spertus, and Liz Looney. 2011. App Inventor. -- O'Reilly Media, Inc.",
      "doi": ""
    }
  ]
}