{
  "doi": "10.1145/3025453.3025968",
  "title": "Factors in Fairness and Emotion in Online Case Resolution Systems",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2511-2522",
  "year": 2017,
  "badges": [],
  "abstract": "Courts are increasingly adopting online information and communication technology, creating a need to consider the potential consequences of these tools for the justice system. Using survey responses from 209 litigants who had recently used an online case resolution system, we investigate factors that influenced litigants' experiences of fairness and emotional feelings toward court officials. Our results show that ease of using the online case resolution system, the outcome of the case, and a litigant's perceptions of procedural justice are positively associated both with whether the litigant views the process as fair and whether the litigant ultimately feels positive emotions toward court officials. We also analyze the online explanations litigants offer in their arguments to courts and litigant answers to an open-ended question about their court experiences, and highlight design and practical implications for online systems seeking to improve access to justice.",
  "tags": [
    "e-government",
    "fairness",
    "procedural justice",
    "courts",
    "cscw",
    "judicial systems",
    "justice"
  ],
  "authors": [
    {
      "name": "Youyang Hou",
      "institution": "University of Michigan, Ann Arbor, USA",
      "img": "/do/10.1145/contrib-99658695768/rel-imgonly/15232091_10157881703080341_886167485469996778_n.jpg",
      "acmid": "99658695768",
      "orcid": "missing"
    },
    {
      "name": "Cliff Lampe",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659334068",
      "orcid": "missing"
    },
    {
      "name": "Maximilian Bulinski",
      "institution": "University of Michigan, Ann Arbor, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161562",
      "orcid": "missing"
    },
    {
      "name": "J.J. Prescott",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160810",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gerald G. Ashdown and Michael A. Menzel. 2002. Convenience of the Guillotine: Video Proceedings in Federal Prosecutions, The. Denv. UL Rev. 80, 63.",
      "doi": ""
    },
    {
      "text": "John H. Barton. 1975. Behind the legal explosion. Stanford Law Review, 567--584. ",
      "doi": ""
    },
    {
      "text": "France Bélanger and Lemuria Carter. 2009. The impact of the digital divide on e-government use. Communications of the ACM 52, 132--132.  ",
      "doi": "10.1145/1498765.1498801"
    },
    {
      "text": "Nathan Bomey. 2015. Traffic court goes digital: Start-up fosters settlements. Retrieved August 9, 2016 from http://www.freep.com/story/money/business/2015/03/1 5/court-innovations-university-of-michigan-law-school-spinoff/24447787/",
      "doi": ""
    },
    {
      "text": "Rebecca Brennan. 2011. Mismatch. com: Online Dispute Resolution and Divorce. Cardozo J. Conflict Resol. 13, 197.",
      "doi": ""
    },
    {
      "text": "Maximilian A. Bulinski and J.J. Prescott. 2016. Online Case Resolution Systems: Enhancing Access, Fairness, Accuracy, and Efficiency. Michigan Journal of Race & Law 21, 205.",
      "doi": ""
    },
    {
      "text": "Kevin Burke, Steve Leben and Procedural Fairness. 2008. Procedural Fairness: A Key Ingredient in Public Satisfaction. Court Review 44, 4.",
      "doi": ""
    },
    {
      "text": "Chao-Min Chiu, Hua-Yang Lin, Szu-Yuan Sun and Meng-Hsiang Hsu. 2009. Understanding customers' loyalty intentions towards online shopping: an integration of technology acceptance model and fairness theory. Behaviour & Information Technology 28, 4: 347--360. ",
      "doi": ""
    },
    {
      "text": "Jason A. Colquitt, Donald E. Conlon, Michael J. Wesson, Christopher O. L. H. Porter and K. Yee Ng. 2001. Justice at the millenium: A meta-analytic review of 25 years of organizational justice research. Journal of Applied Psychology 86, 3: 425--445. ",
      "doi": ""
    },
    {
      "text": "Fred D. Davis. 2011. Perceived Usefulness, Perceived Ease of Use, and User Acceptance of Information Technology. MIS Quarterly 13, 3: 319--340.  ",
      "doi": "10.2307/249008"
    },
    {
      "text": "Alan R. Dennis and Susan T Kinney. 1998. Testing media richness theory in the new media: The effects of cues, feedback, and task equivocality. Information Systems Research 9, 3: 256--274.",
      "doi": "10.1287/isre.9.3.256"
    },
    {
      "text": "Lynn Dombrowski, Gillian R. Hayes and Melissa Mazmanian. 2014. E-Government Intermediaries and the Challenges of Access and Trust. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 2: 1--22.  ",
      "doi": "10.1145/2559985"
    },
    {
      "text": "Anthony G. Greenwald and Linda Hamilton Krieger. 2006. Implicit bias: Scientific foundations. California Law Review 94, 4: 945--967. ",
      "doi": ""
    },
    {
      "text": "Meredith Johnson Harbach. 2012. Outsourcing Childcare. Yale JL & Feminism 24, 254. ",
      "doi": ""
    },
    {
      "text": "Mike Harding, Bran Knowles, Nigel Davies and Mark Rouncefield. 2015. HCI, Civic Engagement & Trust. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 2833--2842.  ",
      "doi": "10.1145/2702123.2702255"
    },
    {
      "text": "Eszter Hargittai. 2008. An Update on Survey Measures of Web-Oriented Digital Literacy. Social Science Computer Review 27, 1: 130--137.  ",
      "doi": "10.1177/0894439308318213"
    },
    {
      "text": "Michael E. Heintz. 2001. Digital Divide and Courtroom Technology: Can David Keep Up with Goliath, The. Fed. Comm. LJ 54, 567.",
      "doi": ""
    },
    {
      "text": "Natalie Helbig, J. R. Gil-García and Enrico Ferro. 2009. Understanding the complexity of electronic government: Implications from the digital divide literature. Government Information Quarterly 26, 1: 89--97.",
      "doi": ""
    },
    {
      "text": "Shin-Yuan Hung, Chia-Ming Chang and Ting-Jing Yu. 2006. Determinants of user acceptance of the e-Government services: The case of online tax filing and payment system. Government Information Quarterly 23, 1: 97--122. ",
      "doi": ""
    },
    {
      "text": "M. Ethan Katsh. 1995. Dispute resolution in cyberspace. Conn. L. Rev. 28, 953.",
      "doi": ""
    },
    {
      "text": "Stephanie Kimbro. 2013. Using Technology to Unbundle in the Legal Services Community. Harvard Journal of Law and Technology Occasional Paper Series, February.",
      "doi": ""
    },
    {
      "text": "Stephanie Kimbro. 2015. Increasing online engagement between the public and the legal profession with gamification. SSRN, 1--30.",
      "doi": ""
    },
    {
      "text": "Rene Kizilcec. 2016. How Much Information? Effects of Transparency on Trust in an Algorithmic Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16).",
      "doi": ""
    },
    {
      "text": "Legal Design Lab. 2016. Hack for justice: a design sprint to make Callifornia's criminal justice system more user-friendly. Retrieved August 9, 2016 from http://www.legaltechdesign.com/hack-for-justice-write -up/-1",
      "doi": ""
    },
    {
      "text": "Melissa Labriola. 2013. Innovation in the Criminal Justice System. Center for Court Innovation.",
      "doi": ""
    },
    {
      "text": "Robert Bennett Lubic. 2004. Reducing costs and inconveniences in international commercial arbitration and other forms of alternative resolution through online dispute resolution. The American Review of International Arbitration 15: 507--639.",
      "doi": ""
    },
    {
      "text": "Hara Noriko and Rob Kling. 2007. Information Technology Support for Communities of Practice: How Public Defenders Learn about Winning and Losing in Court. Journal of the American Society for Information Science and Technology 58, 1: 76--87. ",
      "doi": ""
    },
    {
      "text": "Gary M. Olson and Judith S. Olson. 2000. Distance matters. Human-computer interaction 15, 2: 139--178.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Judith S. Olson and Stephanie Teasley. 1996. Groupware in the wild: Lessons learned from a year of virtual collocation. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '96), 419--427.  ",
      "doi": "10.1145/240080.240353"
    },
    {
      "text": "Charles Owen and Ronald Staudt. 2004. Access to justice: meeting the needs of self-represented litigants. Pearson Custom Publication",
      "doi": ""
    },
    {
      "text": "Ronald W. Staudt and Paula L. Hannaford. 2002. Access to Justice for the Self-Represented Litigant : An Interdisciplinary Investigation by Designers and Lawyers. Syracuse L. Rev., 52, 1017.",
      "doi": ""
    },
    {
      "text": "John Thibaut and Laurens Walker. 1978. A theory of procedure. California Law Review, 541--566. ",
      "doi": ""
    },
    {
      "text": "Tom R. Tyler. 1988. What is procedural justice? criteria used by citizens to assess the fairness of legal procedures. Law and Society Review 1, 103--135. ",
      "doi": ""
    },
    {
      "text": "Tom R. Tyler. 1989. The psychology of procedural justice: A test of the group-value model. Journal of Personality and Social Psychology 57, 5: 830--838. ",
      "doi": ""
    },
    {
      "text": "Tom R. Tyler. 2000. Social Justice : Outcome and Procedure. International Journal of Psychology 35, 2: 117--125. ",
      "doi": ""
    },
    {
      "text": "Amy Voida, Lynn Dombrowski, Gillian R. Hayes and Melissa Mazmanian. 2014. Shared Values / Conflicting Logics : Working Around E - Government Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3583--3592.  ",
      "doi": "10.1145/2556288.2556971"
    },
    {
      "text": "Sivaporn Wangpipatwong, Wichian Chutimaskul and Borworn Papasratorn. 2008. Understanding Citizen's Continuance Intention to Use e- Government Website : a Composite View of Technology Acceptance Model and Computer Self-Efficacy. The Electronic Journal of e-government 6, 1: 55--64.",
      "doi": ""
    }
  ]
}