{
  "doi": "10.1145/3025453.3025470",
  "title": "Uncovering the Values and Constraints of Real-time Ridesharing for Low-resource Populations",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2757-2769",
  "year": 2017,
  "badges": [],
  "abstract": "Real-time ridesharing services (e.g., Uber and Lyft) are often touted as sharing-economy leaders and dramatically lower the cost of transportation. However, how to make these services work better among low-income and transportation-scarce households, how these individuals experience these services, and whether they encounter barriers in enlisting these services is unknown. To address these questions, we onboarded 13 low-income individuals living in transportation-scarce environments to Uber as passengers. Our participants found these services to be reliable and benefited from rich social interactions with drivers; however, barriers such as cost, limited payment methods, and low digital literacy can make such services infeasible. We contribute platform designs that could lead to increased digital literacy and application transparency. To be more inclusive and to reach critical mass, we suggest that these companies foster belief in commons and community trust by coordinating with local businesses in low-resource areas with lower digital literacy.",
  "tags": [
    "low-income populations",
    "mobility",
    "transportation scarcity",
    "sharing economy",
    "uber",
    "real-time ridesharing services"
  ],
  "authors": [
    {
      "name": "Tawanna R. Dillahunt",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606961",
      "orcid": "0000-0002-1155-8507"
    },
    {
      "name": "Vaishnav Kameswaran",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027270",
      "orcid": "missing"
    },
    {
      "name": "Linfeng Li",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160960",
      "orcid": "missing"
    },
    {
      "name": "Tanya Rosenblat",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163000",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2012. Detroit, MI. City-Data.com. http://www.city-data.com/city/Detroit-Michigan.html. (2012). Accessed: May 16, 2016.",
      "doi": ""
    },
    {
      "text": "2015. Help Us Test Cash Payments. (2015). https://newsroom.uber.com/'s=cash+payment/",
      "doi": ""
    },
    {
      "text": "2016. How Walk Score Works. (2016). https://www.redfin.com/how-walk-score-works",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Nicola J Bidwell, Himanshu Zade, Srihari H Muralidhar, Anupama Dhareshwar, Baneen Karachiwala, Tandong Neba Cedrick, and Jacki O'Neill. 2016. Peer-to-peer in the workplace: A view from the road. In Proceedings of the 34th Annual ACM Conference on Human Factors in Computing Systems, CHI 2016, San Jose, U.S. ACM Association for Computing Machinery. DOI: http://dx.doi.org/10.1145/2858036.2858393  ",
      "doi": "10.1145/2858036.2858393"
    },
    {
      "text": "Syed M Ahmed, Jeanne P Lemkau, Nichol Nealeigh, and Barbara Mann. 2001. Barriers to healthcare access in a non-elderly urban poor American population. Health & Social Care in the Community 9, 6 (2001), 445--453.",
      "doi": ""
    },
    {
      "text": "Monica Anderson. 2015. Technology Device Ownership. (2015). http://www.pewinternet.org/2015/10/29/ technology-device-ownership-2015/",
      "doi": ""
    },
    {
      "text": "Thomas A Arcury, John S Preisser, Wilbert M Gesler, and James M Powers. 2005. Access to transportation and health care utilization in a rural region. The Journal of Rural Health 21, 1 (2005), 31--38.",
      "doi": ""
    },
    {
      "text": "Fleura Bardhi and Giana M. Eckhardt. 2012. Access-Based Consumption: The Case of Car Sharing. Journal of Consumer Research 39, 4 (2012), 881--898. DOI:http://dx.doi.org/10.1086/666376 ",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti, Alexander Ambard, Daniel Turner, Christina Gossmann, Kamila Demkova, and John M. Carroll. 2015. A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1085--1094. DOI: http://dx.doi.org/10.1145/2702123.2702272  ",
      "doi": "10.1145/2702123.2702272"
    },
    {
      "text": "Rachel Botsman and Ro Rogers. 2010. What's mine is yours: the rise of collaborative consumption. HarperCollins Publisher. http://www.harpercollins.com/ book/index.aspx?isbn=9780061963544",
      "doi": ""
    },
    {
      "text": "Mikayla Bouchard. 2015a. Transportation Emerges as Crucial to Escaping Poverty. http://www.nytimes.com/2015/05/07/upshot/ transportation-emerges-as-crucial-to-escaping-poverty. html. (7 May 2015). Accessed:2016-04--23.",
      "doi": ""
    },
    {
      "text": "Mikayla Bouchard. 2015b. Transportation Emerges as Crucial to Escaping Poverty. The NY Times (May 7) (2015).",
      "doi": ""
    },
    {
      "text": "Campbell Mithun. 2012. National Study quantifies the \"Sharing Economy\" movement. (2012). http: //www.prnewswire.com/news-releases/national-study-/ /quantifies-the-sharing-economy-movement-138949069. html",
      "doi": ""
    },
    {
      "text": "Noel Cass, Elizabeth Shove, and John Urry. 2005. Social exclusion, mobility and access1. The Sociological Review 53, 3 (2005), 539--555. DOI: http://dx.doi.org/10.1111/j.1467--954X.2005.00565.x",
      "doi": ""
    },
    {
      "text": "Raj Chetty, Nathaniel Hendren, and Lawrence F Katz. 2015. The Effects of Exposure to Better Neighborhoods on Children: New Evidence from the Moving to Opportunity Experiment. American Economic Review 106, August (2015), 90. DOI: http://dx.doi.org/10.3386/w21156 ",
      "doi": ""
    },
    {
      "text": "Raj Chetty, Nathaniel. Hendren, Patrick Kline, and Emmanuel Saez. 2014. Where is the land of Opportunity? The Geography of Intergenerational Mobility in the USA. The Quarterly Journal of Economics 129, 4 (September 2014), 1553--1623. DOI: http://dx.doi.org/10.1093/qje/qju022 ",
      "doi": ""
    },
    {
      "text": "Data Driven Detroit. 2015. Uphill Both Ways: Where are the Jobs in Metro Detroit? (March 2015). http://blog.datadrivendetroit.org/2015/03/04/ uphill-both-ways-where-are-the-jobs-in-metro-detroit Retrieved 12/16/2015.",
      "doi": ""
    },
    {
      "text": "Tawanna Dillahunt, Airi Lampinen, Jacki O'Neill, Loren Terveen, and Cory Kendrick. 2016. Does the Sharing Economy Do Any Good?. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW '16 Companion). ACM, NY, NY, USA, 197--200. DOI: http://dx.doi.org/10.1145/2818052.2893362  ",
      "doi": "10.1145/2818052.2893362"
    },
    {
      "text": "Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy Among Disadvantaged Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2285--2294. DOI: http://dx.doi.org/10.1145/2702123.2702189  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Kate Donahue. 2014. UberACCESS: Expanding Transportation Options. (2014). https: //newsroom.uber.com/us-california/uberaccess-sd/",
      "doi": ""
    },
    {
      "text": "Benjamin G. Edelman and Michael Luca. 2014. Digital Discrimination: The Case of Airbnb.com. SSRN Electronic Journal (jan 2014). DOI: http://dx.doi.org/10.2139/ssrn.2377353 ",
      "doi": ""
    },
    {
      "text": "FDIC. 2013. FDIC National Survey of Unbanked and Underbanked Households. Technical Report.",
      "doi": ""
    },
    {
      "text": "Shannon Firth. 2016. Q&A With Detroit's New Director of Public Health | Medpage Today. (27 January 2016). http://www.medpagetoday.com/PublicHealthPolicy/ PublicHealth/55883",
      "doi": ""
    },
    {
      "text": "Yanbo Ge, Christopher R. Knittel, Don MacKenzie, and Stephen Zoepf. 2016. Racial and gender discrimination in transportation network companies. (2016). DOI: http://dx.doi.org/10.3386/w22776 ",
      "doi": ""
    },
    {
      "text": "Mareike Glöss, Moira McGregor, and Barry Brown. 2016. Designing for Labour: Uber and the On-Demand Mobile Workforce. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1632--1643. DOI: http://dx.doi.org/10.1145/2858036.2858476  ",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Tapio Ikkala and Airi Lampinen. 2014. Defining the Price of Hospitality: Networked Hospitality Exchange via Airbnb. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM Association for Computing Machinery, 173--176. DOI: http://dx.doi.org/10.1145/2556420.2556506  ",
      "doi": "10.1145/2556420.2556506"
    },
    {
      "text": "Dean Karlan, Markus Mobius, Tanya Rosenblat, and Adam Szeidl. 2009. Trust and Social Collateral. The Quarterly Journal of Economics 124, 3 (2009), 1307--1361. DOI: http://dx.doi.org/10.1162/qjec.2009.124.3.1307 ",
      "doi": ""
    },
    {
      "text": "Esther Keymolen. 2013. Trust and technology in collaborative consumption. Why it is not just about you and me. Bridging distances in technology and regulation (2013), 135--150. https://pure.uvt.nl/portal/files/1519132/TP2013",
      "doi": ""
    },
    {
      "text": "Airi Lampinen, Victoria Bellotti, Coye Cheshire, and Mary L. Gray. 2015a. Studying the \"Sharing Economy\": Perspectives to peer-to-peer exchange. CSCW'15 Companion (2015), 117--121. DOI: http://dx.doi.org/10.1145/2685553.2699339",
      "doi": "10.1145/2685553.2699339"
    },
    {
      "text": "Airi Lampinen, Victoria Bellotti, Andrés Monroy-Hernández, Coye Cheshire, and Alexandra Samuel. 2015b. Studying the \"Sharing Economy\": Perspectives to peer-to-peer exchange. CSCW'15 Companion (2015), 117--121. DOI: http://dx.doi.org/10.1145/2685553.2699339  ",
      "doi": "10.1145/2685553.2699339"
    },
    {
      "text": "Airi Lampinen, Kai Huotari, and Coye Cheshire. 2015c. Challenges to Participation in the Sharing Economy : The Case of Local Online Peer- to-Peer Exchange in a Single Parents' Network. Interaction Design and Architecture(s) Journal 24 (2015), 16--32.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1603--1612. DOI: http://dx.doi.org/10.1145/2702123.2702548  ",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Sara Lichtenwalter, Gary Koeske, and Esther Sales. 2006. Examining Transportation and Employment Outcomes: Evidence for Moving Beyond The Bus Pass. Journal of Poverty 10, 1 (2006), 93--115. DOI: http://dx.doi.org/10.1300/J134v10n01_05 ",
      "doi": ""
    },
    {
      "text": "Rick Mathews. 2013. Detroit bankrupt: To see Detroit's decline, look at 40 years of federal policy. Policy.Mic 27 (2013). http://goo.gl/WXAQ1o Retrieved May 12, 2016.",
      "doi": ""
    },
    {
      "text": "Kelly McLaughlin. 2015. Detroit has become such an \"economic desert\" that residents now commute up to four-hours each day just to find work. (March 2015). http://www.dailymail.co.uk/news/article-2975237/ Dearth-jobs-barrier-post-bankruptcy-Detroits-growth. html Retrieved 12/16/2015.",
      "doi": ""
    },
    {
      "text": "Michelle O'Reilly and Nicola Parker. 2012. \"Unsatisfactory Saturation\": a critical exploration of the notion of saturated sample sizes in qualitative research. Qualitative Research (2012), 1468794112446106.",
      "doi": ""
    },
    {
      "text": "Lisa Rayle, Danielle Dai, Nelson Chan, Robert Cervero, and Susan Shaheen. 2016. Just a better taxi? A survey-based comparison of taxis, transit, and ridesourcing services in San Francisco. Transport Policy 45 (2016), 168--178. ",
      "doi": ""
    },
    {
      "text": "Jens Riegelsberger, M. Angela Sasse, and John D. McCarthy. 2005. The mechanics of trust: A framework for research and design. International Journal of Human-Computer Studies 62, 3 (2005), 381 -- 422. DOI: http://dx.doi.org/10.1016/j.ijhcs.2005.01.001  ",
      "doi": "10.1016/j.ijhcs.2005.01.001"
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2015. Uber's Drivers: Information Asymmetries and Control in Dynamic Work. (2015), 1--17. DOI: http://dx.doi.org/10.2139/ssrn.2686227 ",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2012. The Coding Manual for Qualitative Researchers (2 ed.). Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated Technology Use in Developing Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 2583--2592. DOI: http://dx.doi.org/10.1145/1753326.1753718  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Jean J Schensul and Margaret D LeCompte. 1999. Essential Ethnographic Methods: A Mixed Methods Approach. AltaMira Press. 386 pages.",
      "doi": ""
    },
    {
      "text": "Michael J Smart and Nicholas J Klein. 2015. A Longitudinal Analysis of Cars, Transit, and Employment Outcomes. Publication MNTRC Report 12--49 (2015).",
      "doi": ""
    },
    {
      "text": "Rosanna Smart, Brad Rowe, Angela Hawken, Mark Kleiman, Nate Mladenovic, Peter Gehred, and Clarissa Manning. 2015. Faster and Cheaper: How Ride-Sourcing Fills a Gap in Low-Income Los Angeles Neighborhoods. BOTEC Analysis Corporation (July 2015).",
      "doi": ""
    },
    {
      "text": "Jennifer Stark and Nicholas Diakopoulos. 2016. Uber seems to offer better service in areas with more white people. That raises some tough questions. (2016). https: //www.washingtonpost.com/news/wonk/wp/2016/03/10/ uber-seems-to-offer-better-service-in-areas-with-more-white-peoplutm",
      "doi": ""
    },
    {
      "text": "Arun Sundararajan. 2016. The Sharing Economy: The End of Employment and the Rise of Crowd-Based Capitalism. MIT Press.",
      "doi": "10.5555/3002839"
    },
    {
      "text": "Jacob Thebault-Spieker, Loren G. Terveen, and Brent Hecht. 2015. Avoiding the South Side and the Suburbs: The Geography of Mobile Crowdsourcing Markets. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 265--275. DOI: http://dx.doi.org/10.1145/2675133.2675278  ",
      "doi": "10.1145/2675133.2675278"
    },
    {
      "text": "Kentaro Toyama. 2015. Geek Heresy: Rescuing Social Change from the Cult of Technology. (2015). http://www.amazon.com/ Geek-Heresy-Rescuing-Social-Technology/dp/161039528X",
      "doi": ""
    },
    {
      "text": "Iis P. Tussyadiah and Juho Pesonen. 2016. Drivers and barriers of peer-to-peer accommodation stay: An exploratory study with American and Finnish travellers. Current Issues in Tourism 3500, April (2016), 1--18. DOI: http://dx.doi.org/10.1080/13683500.2016.1141180 ",
      "doi": ""
    },
    {
      "text": "John Urry. 2012. Social networks, mobile lives and social inequalities. Journal of Transport Geography 21 (2012), 24 -- 30. DOI: http://dx.doi.org/10.1016/j.jtrangeo.2011.10.003 Social Impacts and Equity Issues in Transport. ",
      "doi": ""
    },
    {
      "text": "Gill Valentine. 1997. \"Tell Me About...\" Using Interviews as a Research Methodology? (second ed.). Routledge, NY, NY, USA. 110--126 pages.",
      "doi": ""
    },
    {
      "text": "P.B. van de Glind. 2013. The consumer potential of Collaborative Consumption: Identifying the motives of Dutch Collaborative Consumers & Measuring the consumer potential of Collaborative Consumption within the municipality of Amsterdam. (aug 2013). http://dspace.library.uu.nl/handle/1874/280661",
      "doi": ""
    },
    {
      "text": "Renee E. Walker, Christopher R. Keane, and Jessica G. Burke. 2010. Disparities and access to healthy food in the USA: A review of food deserts literature. Health & Place 16, 5 (2010), 876--884. DOI: http://dx.doi.org/10.1016/j.healthplace.2010.04.013 ",
      "doi": ""
    },
    {
      "text": "Gillian B. White. 2015. Stranded: How America's Failing Public Transportation Increases Inequality. The Atlantic. (May 2015).",
      "doi": ""
    }
  ]
}