{
  "doi": "10.1145/3025453.3025909",
  "title": "A Social Media Based Index of Mental Well-Being in College Campuses",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1634-1646",
  "year": 2017,
  "badges": [],
  "abstract": "Psychological distress in the form of depression, anxiety and other mental health challenges among college students is a growing health concern. Dearth of accurate, continuous, and multi-campus data on mental well-being presents significant challenges to intervention and mitigation efforts in college campuses. We examine the potential of social media as a new \"barometer\" for quantifying the mental well-being of college populations. Utilizing student-contributed data in Reddit communities of over 100 universities, we first build and evaluate a transfer learning based classification approach that can detect mental health expressions with 97% accuracy. Thereafter, we propose a robust campus-specific Mental Well-being Index: MWI. We find that MWI is able to reveal meaningful temporal patterns of mental well-being in campuses, and to assess how their expressions relate to university attributes like size, academic prestige, and student demographics. We discuss the implications of our work for improving counselor efforts, and in the design of tools that can enable better assessment of the mental health climate of college campuses.",
  "authors": [
    {
      "name": "Shrey Bagroy",
      "institution": "IIIT-Delhi, New Delhi, Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161506",
      "orcid": "missing"
    },
    {
      "name": "Ponnurangam Kumaraguru",
      "institution": "IIIT-Delhi, Delhi, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489236",
      "orcid": "missing"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "Georgia Tech, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    }
  ],
  "references": [
    {
      "text": "Reda Abouserie. 1994. Sources and levels of stress in relation to locus of control and self esteem in university students. Educational psychology 14, 3 (1994), 323--330. ",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2015. Depression-related Imagery on Instagram. In Proc. CSCW'15 Companion. 231--234.  ",
      "doi": "10.1145/2685553.2699014"
    },
    {
      "text": "Aaron Antonovsky. 1979. Health, stress, and coping. (1979).",
      "doi": ""
    },
    {
      "text": "American College Health Association and others. 2009. American College Health Association-National College Health Assessment Spring 2008 Reference Group Data Report (abridged): the American College Health Association. Journal of American college health: J of ACH 57, 5 (2009), 477.",
      "doi": ""
    },
    {
      "text": "American College Health Association and others. 2012. American College Health Association-National College Health Assessment II: Reference Group Data Report Spring 2012. Linthicum, MD: American College Health Association (2012).",
      "doi": ""
    },
    {
      "text": "American College Health Association and others. 2013. National College Health Assessment II: Reference Group Executive Summary Fall 2012. Hanover, MD: American College Health Association (2013).",
      "doi": ""
    },
    {
      "text": "Roger C Bailey and Christy Miller. 1998. Life satisfaction and life demands in college students. Social Behavior and Personality: an international journal 26, 1 (1998), 51--56. ",
      "doi": ""
    },
    {
      "text": "Sairam Balani and Munmun De Choudhury. 2015. Detecting and Characterizing Mental Health Related Self-Disclosure in Social Media. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1373--1378.  ",
      "doi": "10.1145/2702613.2732733"
    },
    {
      "text": "David H Barlow, Paul M Lehrer, Robert L Woolfolk, and Wesley E Sime. 2007. Principles and practice of stress management. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Dror Ben-Zeev, Emily A Scherer, Rui Wang, Haiyi Xie, and Andrew T Campbell. 2015. Next-Generation Psychiatric Assessment: Using Smartphone Sensors to Monitor Behavior and Mental Health. (2015).",
      "doi": ""
    },
    {
      "text": "Google BigQuery. 2015. Reddit Archive on Google BigQuery. https://bigquery.cloud.google.com/table/fh-bigquery:redditposts.fullcorpus201512?pli=1. (2015). Accessed: 2016-09-03.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1171--1184.  ",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Fanglin Chen, Rui Wang, Xia Zhou, and Andrew T Campbell. 2014. My smartphone knows i am hungry. In Proceedings of the 2014 workshop on physical analytics. ACM, 9--14.",
      "doi": "10.1145/2611264.2611270"
    },
    {
      "text": "Glen Coppersmith, Mark Dredze, and Craig Harman. 2014. Quantifying mental health signals in twitter. In ACL Workshop on Computational Linguistics and Clinical Psychology. ",
      "doi": ""
    },
    {
      "text": "Paul C Cozby. 1973. Self-disclosure: a literature review. Psychological bulletin 79, 2 (1973), 73.",
      "doi": ""
    },
    {
      "text": "Wenyuan Dai, Qiang Yang, Gui-Rong Xue, and Yong Yu. 2007. Boosting for transfer learning. In Proceedings of the 24th international conference on Machine learning. ACM, 193--200.  ",
      "doi": "10.1145/1273496.1273521"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013a. Social media as a measurement tool of depression in populations. In Proceedings of the 5th Annual ACM Web Science Conference. ACM, 47--56.  ",
      "doi": "10.1145/2464464.2464480"
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-disclosure, Social Support, and Anonymity. In International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013b. Predicting depression via social media. In AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental health content in social media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Peter Sheridan Dodds, Kameron Decker Harris, Isabel M Kloumann, Catherine A Bliss, and Christopher M Danforth. 2011. Temporal patterns of happiness and information in a global social network: Hedonometrics and Twitter. PloS one 6, 12 (2011), e26752.",
      "doi": ""
    },
    {
      "text": "Diana A Drysdale, William Modzeleski, Andre B Simons, Janet Napolitano, Mark Sullivan, Arne Duncan, Kevin Jennings, Eric Holder, Robert S. Mueller III, and others. 2010. Targeted Violence Affecting Institutions of Higher Education. https://www.fbi.gov/stats-services/publications/campus-attacks. (2010). Accessed: 2010-09--30.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan and Aaron Smith. 2013. 6% of Online Adults are reddit Users. http://www.pewinternet.org/2013/07/03/ 6-of-online-adults-are-reddit-users/. (2013). Accessed: 2016-09-03.",
      "doi": ""
    },
    {
      "text": "Daniel Eisenberg, Ezra Golberstein, and Sarah E Gollust. 2007. Help-seeking and access to mental health care in a university student population. Medical care 45, 7 (2007), 594--601. ",
      "doi": ""
    },
    {
      "text": "Daniel Eisenberg, Justin Hunt, and Nicole Speer. 2013. Mental health in American colleges and universities: variation across student subgroups and across campuses. The Journal of nervous and mental disease 201, 1 (2013), 60--67. ",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Charles Steinfield, and Cliff Lampe. 2007. The benefits of Facebook \"friends\": Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication 12, 4 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Robert P Gallagher and Al Gill. 2004. National survey of counseling center directors. Alexandria, VA: International Association of Counseling Services (2004).",
      "doi": ""
    },
    {
      "text": "Martin Gjoreski, Hristijan Gjoreski, Mitja Lutrek, and Matja Gams. 2015. Automatic detection of perceived stress in campus students using smartphones. In Intelligent Environments (IE), 2015 International Conference on. IEEE, 132--135.  ",
      "doi": "10.1109/IE.2015.27"
    },
    {
      "text": "Scott A Golder and Michael W Macy. 2011. Diurnal and seasonal mood vary with work, sleep, and daylength across diverse cultures. Science 333, 6051 (2011), 1878--1881. ",
      "doi": ""
    },
    {
      "text": "Keith Hampton, Lauren Sessions Goulet, Lee Rainie, and Kristen Purcell. 2011. Social networking sites and our lives. Retrieved July 12, 2011 from (2011).",
      "doi": ""
    },
    {
      "text": "Suzanne Hudd, Jennifer Dumlao, Diane Erdmann-Sager, Daniel Murray, Emily Phan, Nicholas Soukas, and Nori Yokozuka. 2000. Stress at college: Effects on health habits, health status and self-esteem. College Student Journal (2000).",
      "doi": ""
    },
    {
      "text": "Justin Hunt and Daniel Eisenberg. 2010. Mental health problems and help-seeking behavior among college students. Journal of Adolescent Health 46, 1 (2010), 3--10. ",
      "doi": ""
    },
    {
      "text": "Sidney M Jourard. 1959. Healthy personality and self-disclosure. Mental Hygiene. New York (1959).",
      "doi": ""
    },
    {
      "text": "Sepandar D Kamvar and Jonathan Harris. 2011. We feel fine and searching the emotional web. In Proceedings of the fourth ACM international conference on Web search and data mining. ACM, 117--126.",
      "doi": "10.1145/1935826.1935854"
    },
    {
      "text": "Martha Anne Kitzrow. 2003. The mental health needs of today's college students: Challenges and recommendations. NASPA journal 41, 1 (2003), 167--181. ",
      "doi": ""
    },
    {
      "text": "Funda Kivran-Swaine, Jeremy Ting, Jed R Brubaker, Rannie Teodoro, and Mor Naaman. 2014. Understanding Loneliness in Social Awareness Streams: Expressions and Responses.. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Adam DI Kramer. 2010. An unobtrusive behavioral model of gross national happiness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 287--290.",
      "doi": "10.1145/1753326.1753369"
    },
    {
      "text": "Kurt Kroenke, Robert L Spitzer, and Janet BW Williams. 2001. The Phq-9. Journal of general internal medicine 16, 9 (2001), 606--613. ",
      "doi": ""
    },
    {
      "text": "Mrinal Kumar, Mark Dredze, Glen Coppersmith, and Munmun De Choudhury. 2015. Detecting Changes in Suicide Content Manifested in Social Media Following Celebrity Suicides. In Proceedings of the 26th ACM Conference on Hypertext & Social Media. ACM, 85--94.  ",
      "doi": "10.1145/2700171.2791026"
    },
    {
      "text": "Amanda Lenhart, Kristen Purcell, Aaron Smith, and Kathryn Zickuhr. 2010. Social media and young adults. Pew Internet & American Life Project 3 (2010).",
      "doi": ""
    },
    {
      "text": "Diana MacLean, Sonal Gupta, Anna Lembke, Christopher Manning, and Jeffrey Heer. 2015. Forum77: An Analysis of an Online Health Forum Dedicated to Addiction Recovery. In Computer-Supported Cooperative Work and Social Computing (CSCW).",
      "doi": ""
    },
    {
      "text": "Adriana M Manago, Tamara Taylor, and Patricia M Greenfield. 2012. Me and my 400 friends: the anatomy of college students? Facebook networks, their communication patterns, and well-being. Developmental psychology 48, 2 (2012), 369.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Yiran Wang, Melissa Niiya, and Stephanie Reich. 2016. Sleep Debt in Student Life: Online Attention Focus, Facebook, and Mood. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5517--5528.  ",
      "doi": "10.1145/2858036.2858437"
    },
    {
      "text": "M Kyle Matsuba. 2006. Searching for self and relationships online. CyberPsychology & Behavior 9, 3 (2006), 275--284. ",
      "doi": ""
    },
    {
      "text": "Rumi Matsushima and Kunio Shiomi. 2003. Social self-efficacy and interpersonal stress in adolescence. Social Behavior and Personality: an international journal 31, 4 (2003), 323--332. ",
      "doi": ""
    },
    {
      "text": "Gilad Mishne and Maarten De Rijke. 2006. Capturing Global Mood Levels using Blog Posts.. In AAAI spring symposium: computational approaches to analyzing weblogs. 145--152.",
      "doi": ""
    },
    {
      "text": "Elizabeth L Murnane and Scott Counts. 2014. Unraveling abstinence and relapse: smoking cessation reflected in social media. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1345--1354.",
      "doi": "10.1145/2556288.2557145"
    },
    {
      "text": "US News. 2015. US News University Rankings. http://colleges.usnews.rankingsandreviews.com/ best-colleges. (2015). Accessed: 2016-09-03.",
      "doi": ""
    },
    {
      "text": "Sinno Jialin Pan and Qiang Yang. 2010. A survey on transfer learning. IEEE Transactions on knowledge and data engineering 22, 10 (2010), 1345--1359.  ",
      "doi": "10.1109/TKDE.2009.191"
    },
    {
      "text": "Umashanthi Pavalanathan and Munmun De Choudhury. 2015. Identity Management and Mental Health Discourse in Social Media. In Proceedings of the 24th International Conference on World Wide Web Companion. International World Wide Web Conferences Steering Committee, 315--321.",
      "doi": "10.1145/2740908.2743049"
    },
    {
      "text": "Leonard I Pearlin. 1999. Stress and mental health: A conceptual overview. (1999).",
      "doi": ""
    },
    {
      "text": "Tiffany A Pempek, Yevdokiya A Yermolayeva, and Sandra L Calvert. 2009. College students' social networking experiences on Facebook. Journal of applied developmental psychology 30, 3 (2009), 227--238.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker, Matthias R Mehl, and Kate G Niederhoffer. 2003. Psychological aspects of natural language use: Our words, our selves. Annual review of psychology 54, 1 (2003), 547--577.",
      "doi": ""
    },
    {
      "text": "Andrea Dixon Rayle and Kuo-Yi Chung. 2007. Revisiting first-year college students' mattering: Social support, academic stress, and the mattering experience. Journal of College Student Retention: Research, Theory & Practice 9, 1 (2007), 21--37. ",
      "doi": ""
    },
    {
      "text": "Hansen Andrew Schwartz, Johannes C Eichstaedt, Margaret L Kern, and Lukasz et al. Dziurzynski. 2013. Characterizing Geographic Variation in Well-Being Using Tweets. In Proc. ICWSM.",
      "doi": ""
    },
    {
      "text": "Johanna Soet and Todd Sevig. 2006. Mental health issues facing a diverse sample of college students: Results from the College Student Mental Health Survey. NASPA journal 43, 3 (2006), 410--431. ",
      "doi": ""
    },
    {
      "text": "C Ward Struthers, Raymond P Perry, and Verena H Menec. 2000. An examination of the relationship among academic stress, coping, motivation, and performance in college. Research in higher education 41, 5 (2000), 581--592. ",
      "doi": ""
    },
    {
      "text": "Priceonomics Data Studio. 2016. Ranking the Most (and Least) Diverse Colleges in America. https://priceonomics.com/ranking-the-most-and-least-diverse-colleges-in/. (2016). Accessed: 2016-09-03.",
      "doi": ""
    },
    {
      "text": "Lynn C Towbes and Lawrence H Cohen. 1996. Chronic stress in the lives of college students: Scale development and prospective prediction of distress. Journal of youth and adolescence 25, 2 (1996), 199--217. ",
      "doi": ""
    },
    {
      "text": "Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing Depression from Twitter Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3187--3196.  ",
      "doi": "10.1145/2702123.2702280"
    },
    {
      "text": "Patti M Valkenburg, Jochen Peter, and Alexander P Schouten. 2006. Friend networking sites and their relationship to adolescents' well-being and social self-esteem. CyberPsychology & Behavior 9, 5 (2006), 584--590.",
      "doi": ""
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T Campbell. 2014. StudentLife: assessing mental health, academic performance and behavioral trends of college students using smartphones. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 3--14.  ",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "Rui Wang, Gabriella Harari, Peilin Hao, Xia Zhou, and Andrew T Campbell. 2015. SmartGPA: how smartphones can assess and predict academic performance of college students. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 295--306.  ",
      "doi": "10.1145/2750858.2804251"
    },
    {
      "text": "Jun-ichiro Watanabe, Saki Matsuda, and Kazuo Yano. 2013a. Using wearable sensor badges to improve scholastic performance. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication. ACM, 139--142.",
      "doi": ""
    },
    {
      "text": "Jun-Ichiro Watanabe, Kazuo Yano, and Saki Matsuda. 2013b. Relationship between physical behaviors of students and their scholastic performance. In Ubiquitous Intelligence and Computing, 2013 IEEE 10th International Conference on and 10th International Conference on Autonomic and Trusted Computing (UIC/ATC). IEEE, 170--177.  ",
      "doi": "10.1109/UIC-ATC.2013.86"
    },
    {
      "text": "Anna Zajacova, Scott M Lynch, and Thomas J Espenshade. 2005. Self-efficacy, stress, and academic success in college. Research in higher education 46, 6 (2005), 677--706. ",
      "doi": ""
    },
    {
      "text": "Kara Zivin, Daniel Eisenberg, Sarah E Gollust, and Ezra Golberstein. 2009. Persistence of mental health problems and needs in a college student population. Journal of affective disorders 117, 3 (2009), 180--185. ",
      "doi": ""
    }
  ]
}