{
  "doi": "10.1145/3025453.3025870",
  "title": "Narratives in Crowdsourced Evaluation of Visualizations: A Double-Edged Sword?",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5475-5484",
  "year": 2017,
  "badges": [],
  "abstract": "We explore the effects of providing task context when evaluating visualization tools using crowdsourcing. We gave crowdsource workers i) abstract information visualization tasks without any context, ii) tasks where we added semantics to the dataset, and iii) tasks with two types of backstory narratives: an analytic narrative and a decision-making narrative. Contrary to our expectations, we did not find evidence that adding data semantics increases accuracy, and further found that our backstory narratives can even decrease accuracy. Adding dataset semantics can however increase attention and provide subjective benefits in terms of confidence, perceived easiness, task enjoyability and perceived usefulness of the visualization. Nevertheless, our backstory narratives did not appear to provide additional subjective benefits. These preliminary findings suggest that narratives may have complex and unanticipated effects, calling for more studies in this area.",
  "authors": [
    {
      "name": "Evanthia Dimara",
      "institution": "INRIA, Saclay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658633082",
      "orcid": "missing"
    },
    {
      "name": "Anastasia Bezerianos",
      "institution": "Univ Paris Sud, CNRS & INRIA, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659165855",
      "orcid": "0000-0002-7142-2548"
    },
    {
      "name": "Pierre Dragicevic",
      "institution": "Inria, Orsay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723138",
      "orcid": "0000-0002-1854-5899"
    }
  ],
  "references": [
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. IEEE, 111--117.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Toshiyuki Asahi, David Turo, and Ben Shneiderman. 1995. Using treemaps to visualize the analytic hierarchy process. Information Systems Research 6, 4 (1995), 357--375.  ",
      "doi": "10.1287/isre.6.4.357"
    },
    {
      "text": "Bon Adriel Aseniero, Tiffany Wun, David Ledo, Guenther Ruhe, Anthony Tang, and Sheelagh Carpendale. 2015. STRATOS: Using Visualization to Support Decisions in Strategic Software Release Planning. In Proc. of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1479--1488.  ",
      "doi": "10.1145/2702123.2702426"
    },
    {
      "text": "Benjamin Bach, Natalie Kerracher, Kyle Wm Hall, Sheelagh Carpendale, Jessie Kennedy, and Nathalie Henry Riche. 2016. Telling Stories about Dynamic Networks with Graph Comics. In Proc. of the Conference on Human Factors in Information Systems (CHI). ACM, New York, USA.  ",
      "doi": "10.1145/2858036.2858387"
    },
    {
      "text": "Jeanette Bautista and Giuseppe Carenini. 2008. An empirical evaluation of interactive visualizations for preferential choice. In Proc. of the working conference on Advanced visual interfaces. ACM, 207--214.  ",
      "doi": "10.1145/1385569.1385603"
    },
    {
      "text": "Michael S Bernstein, Greg Little, Robert C Miller, Björn Hartmann, Mark S Ackerman, David R Karger, David Crowell, and Katrina Panovich. 2015. Soylent: a word processor with a crowd inside. Commun. ACM 58, 8 (2015), 85--94.  ",
      "doi": "10.1145/2791285"
    },
    {
      "text": "Sarah E Bonner, Reid Hastie, Geoffrey B Sprinkle, and S Mark Young. 2000. A review of the effects of ?nancial incentives on performance in laboratory tasks: Implications for management accounting. Journal of Management Accounting Research 12, 1 (2000), 19--64.",
      "doi": ""
    },
    {
      "text": "Nadia Boukhelifa, Anastasia Bezerianos, Tobias Isenberg, and Jean-Daniel Fekete. 2012. Evaluating Sketchiness as a Visual Variable for the Depiction of Qualitative Uncertainty. TVCG 18, 12 (2012), 2769--2778.  ",
      "doi": "10.1109/TVCG.2012.220"
    },
    {
      "text": "Liliana Bounegru, Tommaso Venturini, Jonathan Gray, and Mathieu Jacomy. 2016. Narrating Networks: Exploring the affordances of networks as storytelling devices in journalism. Digital Journalism (2016), 1--32.",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Francoise Detienne, and Jean-Daniel Fekete. 2015. Storytelling in Information Visualizations: Does it Engage Users to Explore Data?. In Proc. of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1449--1458.  ",
      "doi": "10.1145/2702123.2702452"
    },
    {
      "text": "J. Boy, R.A. Rensink, E. Bertini, and J.-D. Fekete. 2014. A Principled Way of Assessing Visualization Literacy. TVCG 20, 12 (Dec 2014), 1963--1972.",
      "doi": ""
    },
    {
      "text": "Shenghui Cheng and Klaus Mueller. 2016. The Data Context Map: Fusing Data and Attributes into a Unified Display. TVCG 22, 1 (2016), 121--130.",
      "doi": "10.1109/TVCG.2015.2467552"
    },
    {
      "text": "Mohammad Daradkeh, Clare Churcher, and Alan McKinnon. 2013. Supporting informed decision-making under uncertainty and risk through interactive visualisation. In Proc. of the Fourteenth Australasian User Interface Conference-Volume 139. Australian Computer Society, Inc., 23--32. ",
      "doi": "10.5555/2525493.2525496"
    },
    {
      "text": "Evanthia Dimara, Anastasia Bezerianos, and Pierre Dragicevic. 2017. The Attraction Effect in Information Visualization. TVCG 23, 1 (2017).  ",
      "doi": "10.1109/TVCG.2016.2598594"
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. In Modern Statistical Methods for HCI. Springer, 291--330.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Ed H Chi, and Steven Dow. 2014. Crowdsourcing in HCI Research. In Ways of Knowing in HCI. Springer, 267--289.",
      "doi": ""
    },
    {
      "text": "Fabian Fischer and Daniel Keim. 2013. Vacs: Visual analytics suite for cyber security-visual exploration of cyber security datasets. In IEEE VIS.",
      "doi": ""
    },
    {
      "text": "Samuel Gratzl, Alexander Lex, Nils Gehlenborg, Hanspeter Pfister, and Marc Streit. 2013. Lineup: Visual analysis of multi-attribute rankings. TVCG 19, 12 (2013), 2277--2286.  ",
      "doi": "10.1109/TVCG.2013.173"
    },
    {
      "text": "Melanie C Green and Timothy C Brock. 2000. The role of transportation in the persuasiveness of public narratives. JPSP 79, 5 (2000), 701.",
      "doi": ""
    },
    {
      "text": "Melanie C Green, Jeffrey J Strange, and Timothy C Brock. 2003. Narrative impact: Social and cognitive foundations. Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Jeffrey Heer, Fernanda B Viégas, and Martin Wattenberg. 2007. Voyagers and voyeurs: supporting asynchronous collaborative information visualization. In Proc. of the SIGCHI conference on Human factors in computing systems. ACM, 1029--1038.  ",
      "doi": "10.1145/1240624.1240781"
    },
    {
      "text": "Thomas Hollt, Ahmed Magdy, Peng Zhan, Guoning Chen, Ganesh Gopalakrishnan, Ibrahim Hoteit, Charles D Hansen, and Markus Hadwiger. 2014. Ovis: A framework for visual analysis of ocean forecast ensembles. TVCG 20, 8 (2014), 1114--1126.  ",
      "doi": "10.1109/TVCG.2014.2307892"
    },
    {
      "text": "John Joseph Horton and Lydia B Chilton. 2010. The labor economics of paid crowdsourcing. In Proc. of the 11th ACM conference on Electronic commerce. ACM, 209--218.  ",
      "doi": "10.1145/1807342.1807376"
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization rhetoric: Framing effects in narrative visualization. TVCG 17, 12 (2011), 2231--2240.  ",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Jessica Hullman, Nicholas Diakopoulos, and Eytan Adar. 2013a. Contextifier: Automatic generation of annotated stock visualizations. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2707--2716.  ",
      "doi": "10.1145/2470654.2481374"
    },
    {
      "text": "Jessica Hullman, Steven Drucker, Nathalie Henry Riche, Bongshin Lee, Danyel Fisher, and Eytan Adar. 2013b. A deeper understanding of sequence in narrative visualization. TVCG 19, 12 (2013), 2406--2415.  ",
      "doi": "10.1109/TVCG.2013.119"
    },
    {
      "text": "Jessica R Hullman. 2011. Not All HITs Are Created Equal: Controlling for Reasoning and Learning Processes in MTurk. In Proc. of the ACM CHI Workshop on Crowdsourcing and Human Computation. Citeseer.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman. 2011. Thinking, fast and slow. Macmillan.",
      "doi": ""
    },
    {
      "text": "Graham Kalton and Howard Schuman. 1982. The effect of the question on survey responses: A review. Journal of the Royal Statistical Society. Series A (General) (1982), 42--73.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proc. of the SIGCHI conference on human factors in computing systems. ACM, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Ron Kohavi, Randal M Henne, and Dan Sommerfield. 2007. Practical guide to controlled experiments on the web: listen to your customers not to the hippo. In Proc. of the 13th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 959--967.  ",
      "doi": "10.1145/1281192.1281295"
    },
    {
      "text": "Martin Krzywinski and Naomi Altman. 2013. Points of significance: error bars. Nature methods 10, 10 (2013), 921--922.",
      "doi": ""
    },
    {
      "text": "Bongshin Lee, Rubaiat Habib Kazi, and Greg Smith. 2013. SketchStory: Telling more engaging stories with data through freeform sketching. TVCG 19, 12 (2013), 2416--2425.  ",
      "doi": "10.1109/TVCG.2013.191"
    },
    {
      "text": "Kwan-Liu Ma, Isaac Liao, Jennifer Frazier, Helwig Hauser, and Helen-Nicole Kostis. 2012. Scientific storytelling using visualization. IEEE Computer Graphics and Applications 32, 1 (2012), 12--19.  ",
      "doi": "10.1109/MCG.2012.24"
    },
    {
      "text": "Winter Mason and Duncan J Watts. 2010. Financial incentives and the performance of crowds. ACM SigKDD Explorations Newsletter 11, 2 (2010), 100--108.  ",
      "doi": "10.1145/1809400.1809422"
    },
    {
      "text": "Luana Micallef, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Assessing the effect of visualizations on bayesian reasoning through crowdsourcing. TVCG 18, 12 (2012), 2536--2545.  ",
      "doi": "10.1109/TVCG.2012.199"
    },
    {
      "text": "Hendrik Müller, Aaron Sedley, and Elizabeth Ferrall-Nunge. 2014. Survey research in HCI. In Ways of Knowing in HCI. Springer, 229--266.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC Press.",
      "doi": ""
    },
    {
      "text": "Daniel M Oppenheimer, Tom Meyvis, and Nicolas Davidenko. 2009a. Instructional manipulation checks: Detecting satisficing to increase statistical power. JESP 45, 4 (2009), 867--872.",
      "doi": ""
    },
    {
      "text": "Daniel M Oppenheimer, Tom Meyvis, and Nicolas Davidenko. 2009b. Instructional manipulation checks: Detecting satisficing to increase statistical power. JESP 45, 4 (2009), 867--872.",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on amazon mechanical turk. Judgment and Decision making 5, 5 (2010), 411--419.",
      "doi": ""
    },
    {
      "text": "Steven F Roth and Joe Mattis. 1990. Data characterization for intelligent graphics presentation. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 193--200.  ",
      "doi": "10.1145/97243.97273"
    },
    {
      "text": "Purvi Saraiya, Chris North, and Karen Duca. 2005. An Insight-Based Methodology for Evaluating Bioinformatics Visualizations. TVCG 11, 4 (July 2005), 443--456.  ",
      "doi": "10.1109/TVCG.2005.53"
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014. Authoring Narrative Visualizations with Ellipsis. In Proc. of the 16th Eurographics Conference on Visualization (EuroVis '14). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 361--370.  ",
      "doi": "10.5555/2854210.2854260"
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. TVCG 16, 6 (2010), 1139--1148.  ",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Fernanda B Viégas, Danah Boyd, David H Nguyen, Jeffrey Potter, and Judith Donath. 2004. Digital artifacts for remembering and storytelling: Posthistory and social network fragments. In System Sciences, 2004. Proc. of the 37th Annual Hawaii International Conference on. IEEE, 10--pp. ",
      "doi": "10.5555/962752.962966"
    },
    {
      "text": "Stephen Wehrend and Clayton Lewis. 1990. A problem-oriented classification of visualization techniques. In Proc. of Visualization'90. IEEE Computer Society Press, 139--143. ",
      "doi": "10.5555/949531.949553"
    },
    {
      "text": "Bernard E Whitley Jr and Irene Hanson Frieze. 1986. Measuring causal attributions for success and failure: A meta-analysis of the effects of question-wording style. Basic and Applied Social Psychology 7, 1 (1986), 35--51.",
      "doi": ""
    },
    {
      "text": "Christopher Williamson and Ben Shneiderman. 1992. The Dynamic HomeFinder: Evaluating Dynamic Queries in a Real-estate Information Exploration System. In Proc. of the 15th Annual International ACM SIGIR Conference (SIGIR '92). ACM, New York, NY, USA, 338--346.  ",
      "doi": "10.1145/133160.133216"
    },
    {
      "text": "Ji Soo Yi, Rachel Melton, John Stasko, and Julie A Jacko. 2005. Dust & magnet: multivariate information visualization using a magnet metaphor. Information Visualization 4, 4 (2005), 239--256.  ",
      "doi": "10.1057/palgrave.ivs.9500099"
    }
  ]
}