{
  "doi": "10.1145/3025453.3026001",
  "title": "Memory in Motion: The Influence of Gesture- and Touch-Based Input Modalities on Spatial Memory",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "1899-1910",
  "year": 2017,
  "badges": [],
  "abstract": "People's ability to remember and recall spatial information can be harnessed to improve navigation and search performances in interactive systems. In this paper, we investigate how display size and input modality influence spatial memory, especially in relation to efficiency and user satisfaction. Based on an experiment with 28 participants, we analyze the effect of three input modalities (trackpad, direct touch, and gesture-based motion controller) and two display sizes (10.6\" and 55\") on people's ability to navigate to spatially spread items and recall their positions. Our findings show that the impact of input modality and display size on spatial memory is not straightforward, but characterized by trade-offs between spatial memory, efficiency, and user satisfaction.",
  "tags": [
    "output device",
    "input modality",
    "spatial memory"
  ],
  "authors": [
    {
      "name": "Johannes Zagermann",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-99659020601/rel-imgonly/99659020601.jpg",
      "acmid": "99659020601",
      "orcid": "0000-0002-6757-9753"
    },
    {
      "name": "Ulrike Pfeil",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489771",
      "orcid": "missing"
    },
    {
      "name": "Daniel Fink",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160167",
      "orcid": "missing"
    },
    {
      "name": "Philipp von Bauer",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162215",
      "orcid": "missing"
    },
    {
      "name": "Harald Reiterer",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-81100236830/rel-imgonly/reiterer_2021.jpeg",
      "acmid": "81100236830",
      "orcid": "0000-0001-8528-8928"
    }
  ],
  "references": [
    {
      "text": "Gary L Allen. 2004. Human spatial memory: Remembering where. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Ruth Rosenholtz. 2003. Halo: A Technique for Visualizing Off-screen Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 481--488. DOI: http://dx.doi.org/10.1145/642611.642695  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Simon Butscher and Harald Reiterer. 2016. Applying Guidelines for the Design of Distortions on Focus+Context Interfaces. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, NY, NY, USA, 244--247. DOI: http://dx.doi.org/10.1145/2909132.2909284  ",
      "doi": "10.1145/2909132.2909284"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2009. A Review of Overview+Detail, Zooming, and Focus+Context Interfaces. ACM Comput. Surv. 41, 1, Article 2 (Jan. 2009), 31 pages. DOI: http://dx.doi.org/10.1145/1456650.1456652  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Sean Gustafson, Patrick Baudisch, Carl Gutwin, and Pourang Irani. 2008. Wedge: Clutter-free Visualization of Off-screen Locations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 787--796. DOI: http://dx.doi.org/10.1145/1357054.1357179  ",
      "doi": "10.1145/1357054.1357179"
    },
    {
      "text": "Sandra G. Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. Human mental workload 1, 3 (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk. 2006. Current Practice in Measuring Usability: Challenges to Usability Studies and Research. Int. J. Hum.-Comput. Stud. 64, 2 (Feb. 2006), 79--102.  ",
      "doi": "10.1016/j.ijhcs.2005.06.002"
    },
    {
      "text": "Kasper Hornbæk, Benjamin B. Bederson, and Catherine Plaisant. 2002. Navigation Patterns and Usability of Zoomable User Interfaces with and Without an Overview. ACM Trans. Comput.-Hum. Interact. 9, 4 (Dec. 2002), 362--389. DOI:http://dx.doi.org/10.1145/586081.586086  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "Kasper Hornbæk and Effie Lai-Chong Law. 2007. Meta-analysis of Correlations Among Usability Measures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, NY, NY, USA, 617--626. DOI: http://dx.doi.org/10.1145/1240624.1240722  ",
      "doi": "10.1145/1240624.1240722"
    },
    {
      "text": "Mikkel R. Jakobsen, Yvonne Jansen, Sebastian Boring, and Kasper Hornbæk. 2015. Should I Stay or Should I Go? Selecting Between Touch and Mid-Air Gestures for Large-Display Interaction. Springer International Publishing, Cham, 455--473. DOI: http://dx.doi.org/10.1007/978--3--319--22698--9_31",
      "doi": ""
    },
    {
      "text": "Hans-Christian Jetter, Svenja Leifert, Jens Gerken, Sören Schubert, and Harald Reiterer. 2012. Does (Multi-)Touch Aid Users' Spatial Memory and Navigation in \"Panning\" and in \"Zooming & Panning\" UIs?. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, NY, NY, USA, 83--90. DOI:http://dx.doi.org/10.1145/2254556.2254575  ",
      "doi": "10.1145/2254556.2254575"
    },
    {
      "text": "Bonifaz Kaufmann and David Ahlström. 2013. Studying Spatial Memory and Map Navigation Performance on Projector Phones with Peephole Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 3173--3176. DOI: http://dx.doi.org/10.1145/2470654.2466434  ",
      "doi": "10.1145/2470654.2466434"
    },
    {
      "text": "Daniel Klinkhammer, Jan Oke Tennie, Paula Erdoes, and Harald Reiterer. 2013. Body Panning: A Movement-based Navigation Technique for Large Interactive Surfaces. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, NY, NY, USA, 37--40. DOI:http://dx.doi.org/10.1145/2512349.2512822  ",
      "doi": "10.1145/2512349.2512822"
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and evaluation of a user experience questionnaire. In Symposium of the Austrian HCI and Usability Engineering Group. Springer, 63--76.  ",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Svenja Leifert. 2011. The Influence of Grids on Spatial and Content Memory. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, NY, NY, USA, 941--946. DOI: http://dx.doi.org/10.1145/1979742.1979522  ",
      "doi": "10.1145/1979742.1979522"
    },
    {
      "text": "Jens Müller, Roman Rädle, Hans-Christian Jetter, and Harald Reiterer. 2015. An Experimental Comparison of Vertical and Horizontal Dynamic Peephole Navigation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1523--1526. DOI: http://dx.doi.org/10.1145/2702123.2702227  ",
      "doi": "10.1145/2702123.2702227"
    },
    {
      "text": "Jens Müller, Roman Rädle, and Harald Reiterer. 2016. Virtual Objects As Spatial Cues in Collaborative Mixed Reality Environments: How They Shape Communication Behavior and User Task Load. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1245--1249. DOI: http://dx.doi.org/10.1145/2858036.2858043  ",
      "doi": "10.1145/2858036"
    },
    {
      "text": "Jakob Nielsen and Jonathan Levy. 1994. Measuring Usability: Preference vs. Performance. Commun. ACM 37, 4 (April 1994), 66--75. DOI: http://dx.doi.org/10.1145/175276.175282  ",
      "doi": "10.1145/175276.175282"
    },
    {
      "text": "Kenton O'Hara, Abigail Sellen, and Richard Bentley. 1999. Supporting Memory for Spatial Location While Reading from Small Displays. In CHI '99 Extended Abstracts on Human Factors in Computing Systems (CHI EA '99). ACM, NY, NY, USA, 220--221.  ",
      "doi": "10.1145/632716.632853"
    },
    {
      "text": "Henri Palleis and Heinrich Hussmann. 2016. Indirect 2D Touch Panning: How Does It Affect Spatial Memory and Navigation Performance?. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, NY, NY, USA, 1947--1951. DOI: http://dx.doi.org/10.1145/2858036.2858334  ",
      "doi": "10.1145/2858036.2858334"
    },
    {
      "text": "Kathrin Probst. 2016. Peripheral Interaction in Desktop Computing: Why It's Worth Stepping Beyond Traditional Mouse and Keyboard. Springer International Publishing, Cham, 183--205. DOI: http://dx.doi.org/10.1007/978--3--319--29523--7_9",
      "doi": ""
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Simon Butscher, and Harald Reiterer. 2013. The Effect of Egocentric Body Movements on Users' Navigation Performance and Spatial Memory in Zoomable User Interfaces. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, NY, NY, USA, 23--32. DOI: http://dx.doi.org/10.1145/2512349.2512811  ",
      "doi": "10.1145/2512349.2512811"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Jens Müller, and Harald Reiterer. 2014. Bigger is Not Always Better: Display Size, Performance, and Task Load During Peephole Map Navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, NY, USA, 4127--4136. DOI: http://dx.doi.org/10.1145/2556288.2557071  ",
      "doi": "10.1145/2556288.2557071"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, and Carl Gutwin. 2012. Supporting and exploiting spatial memory in user interfaces. Interaction 6, 1 (2012), 1--84.  ",
      "doi": "10.1561/1100000046"
    },
    {
      "text": "Amy Skopik and Carl Gutwin. 2005. Improving Revisitation in Fisheye Views with Visit Wear. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 771--780. DOI: http://dx.doi.org/10.1145/1054972.1055079  ",
      "doi": "10.1145/1054972.1055079"
    },
    {
      "text": "Desney S. Tan, Darren Gergle, Peter Scupelli, and Randy Pausch. 2003. With Similar Visual Angles, Larger Displays Improve Spatial Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 217--224. DOI:http://dx.doi.org/10.1145/642611.642650  ",
      "doi": "10.1145/642611.642650"
    },
    {
      "text": "Desney S. Tan, Darren Gergle, Peter G. Scupelli, and Randy Pausch. 2004. Physically Large Displays Improve Path Integration in 3D Virtual Navigation Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 439--446. DOI: http://dx.doi.org/10.1145/985692.985748  ",
      "doi": "10.1145/985692.985748"
    },
    {
      "text": "Desney S. Tan, Randy Pausch, Jeanine K. Stefanucci, and Dennis R. Proffitt. 2002. Kinesthetic Cues Aid Spatial Memory. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, NY, NY, USA, 806--807. DOI: http://dx.doi.org/10.1145/506443.506607  ",
      "doi": "10.1145/506443.506607"
    },
    {
      "text": "F. Tyndiuk, G. Thomas, V. Lespinet-Najib, and C. Schlick. 2005. Cognitive Comparison of 3D Interaction in Front of Large vs. Small Displays. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '05). ACM, NY, NY, USA, 117--123. DOI: http://dx.doi.org/10.1145/1101616.1101641  ",
      "doi": "10.1145/1101616.1101641"
    },
    {
      "text": "Norman G. Vinson. 1999. Design Guidelines for Landmarks to Support Navigation in Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, NY, NY, USA, 278--285. DOI: http://dx.doi.org/10.1145/302979.303062  ",
      "doi": "10.1145/302979.303062"
    },
    {
      "text": "Daniel Wigdor and Dennis Wixon. 2011. Brave NUI World: Designing Natural User Interfaces for Touch and Gesture (1st ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/1995309"
    }
  ]
}