{
  "doi": "10.1145/3025453.3025938",
  "title": "StretchEBand: Enabling Fabric-based Interactions through Rapid Fabrication of Textile Stretch Sensors",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2617-2627",
  "year": 2017,
  "badges": [],
  "abstract": "The increased interest in interactive soft materials, such as smart clothing and responsive furniture, means that there is a need for flexible and deformable electronics. In this paper, we focus on stitch-based elastic sensors, which have the benefit of being manufacturable with textile craft tools that have been used in homes for centuries. We contribute to the understanding of stitch-based stretch sensors through four experiments and one user study that investigate conductive yarns from textile and technical perspectives, and analyze the impact of different stitch types and parameters. The insights informed our design of new stretch-based interaction techniques that emphasize eyes-free or causal interactions. We demonstrate with StretchEBand how soft, continuous sensors can be rapidly fabricated with different parameters and capabilities to support interaction with a wide range of performance requirements across wearables, mobile devices, clothing, furniture, and toys.",
  "authors": [
    {
      "name": "Anita Vogl",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Upper Austria, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021229",
      "orcid": "missing"
    },
    {
      "name": "Patrick Parzer",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640102",
      "orcid": "missing"
    },
    {
      "name": "Teo Babic",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Upper Austria, Austria",
      "img": "/do/10.1145/contrib-99659020809/rel-imgonly/13317071_10208296213716957_168111287432533580_o.jpg",
      "acmid": "99659020809",
      "orcid": "missing"
    },
    {
      "name": "Joanne Leong",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Upper Austria, Austria",
      "img": "/do/10.1145/contrib-89558862057/rel-imgonly/joanne-grey-square-640.jpg",
      "acmid": "89558862057",
      "orcid": "0000-0001-5422-1018"
    },
    {
      "name": "Alex Olwal",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81309497296/rel-imgonly/alex.png",
      "acmid": "81309497296",
      "orcid": "0000-0001-7772-0530"
    },
    {
      "name": "Michael Haller",
      "institution": "University of Applied Sciences Upper Austria, Hagenberg, Upper Austria, Austria",
      "img": "/do/10.1145/contrib-81100048383/rel-imgonly/michael_-_closeup640.jpg",
      "acmid": "81100048383",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adafruit Knit Conductive Fabric Silver 20cm square. http://www.adafruit.com/products/1167. 24Sep-2015.",
      "doi": ""
    },
    {
      "text": "Ashbrook, D. L. Enabling mobile microinteractions. Georgia Institute of Technology. 2010.",
      "doi": "10.5555/1970601"
    },
    {
      "text": "Bernina B330. http://www.bernina.com/enUS/Products-US/BERNINA-products/SewingQuilting-and-Embroidery/BERNINA-3Series/BERNINA-330. 24-Sep-2015.",
      "doi": ""
    },
    {
      "text": "ten Bhömer, M. and van Dongen, P. Vigour. Interactions. vol. 21, no. 5. pp. 12--13.  ",
      "doi": "10.1145/2641396"
    },
    {
      "text": "Buechley, L. SensorMania - Notes from e-Fashion day2008. http://www.mediamatic.net/36637/en/sensormania. 23-Sep-2015.",
      "doi": ""
    },
    {
      "text": "Buechley, L., Kafai, Y., Eisenberg, M., and Peppler, K. Textile Messages: Dispatches From the World of E-Textiles and Education. Peter Lang International Academic Publishers. 2013. ",
      "doi": ""
    },
    {
      "text": "Butler, A., Izadi, S., and Hodges, S. SideSight: multi-touch? interaction around small devices. in UIST. 2008. pp. 201--204.",
      "doi": ""
    },
    {
      "text": "Corsten, C., Avellino, I., Möllers, M., and Borchers, J. Instant user interfaces. in ITS. 10AD. pp. 71--80.",
      "doi": ""
    },
    {
      "text": "Dunne, L. E., Bibeau, K., Mulligan, L., Frith, A., and Simon, C. Multi-layer e-textile circuits. in UbiComp. 2012. p. 649.",
      "doi": "10.1145/2370216.2370348"
    },
    {
      "text": "Freeman, E., Brewster, S., and Lantz, V. Towards Usable and Acceptable Above-Device Interactions. in MobileHCI Posters. 2014.",
      "doi": "10.1145/2628363.2634215"
    },
    {
      "text": "Funk, M., Sahami, A., Henze, N., and Schmidt, A. Using a Touch-Sensitive Wristband for Text Entry on Smart Watches. in CHI. 2014. pp. 2305--2310.",
      "doi": ""
    },
    {
      "text": "Glazzard, M. and Kettley, S. Knitted stretch sensors for sound output. in TEI. 2010. p. 391.",
      "doi": ""
    },
    {
      "text": "Holman, D. and Vertegaal, R. Organic user interfaces. Commun. ACM. vol. 51, no. 6. 2008. p. 48.  ",
      "doi": "10.1145/1349026.1349037"
    },
    {
      "text": "Huang, C. T., Tang, C. F., Lee, M. C., and Chang, S. H. Parametric design of yarn-based piezoresistive sensors for smart textiles. Sensors and Actuators. vol. 148. 2008. pp. 10--15. ",
      "doi": ""
    },
    {
      "text": "Karrer, T., Wittenhagen, M., Lichtschlag, L., Heller, F., and Borchers, J. Pinstripe: Eyes-free Continuous Input on Interactive Clothing. in CHI. 2011. pp. 1313--1322.",
      "doi": ""
    },
    {
      "text": "Kratz, S. and Rohs, M. Hoverflow. in MobileHCI. 2009. no. Figure 1. p. 1.",
      "doi": ""
    },
    {
      "text": "Lyons, K., Nguyen, D., Ashbrook, D., and White, S. Facet. in UIST. 2012. p. 123.",
      "doi": ""
    },
    {
      "text": "Meyer, J., Arnrich, B., Schumm, J., and Troster, G. Design and Modeling of a Textile Pressure Sensor for Sitting Posture Classification. IEEE Sens. J. vol. 10, no. 8. Aug. 2010. pp. 1391--1398. ",
      "doi": ""
    },
    {
      "text": "Oney, S., Harrison, C., Ogan, A., and Wiese, J. ZoomBoard. in CHI. 2013. p. 2799.",
      "doi": ""
    },
    {
      "text": "Perrault, S. T., Lecolinet, E., Eagan, J., and Guiard, Y. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. in CHI. 2013. p. 1451.",
      "doi": ""
    },
    {
      "text": "Ramos, G., Boulos, M., and Balakrishnan, R. Pressure widgets. in CHI. 2004. pp. 487--494.",
      "doi": ""
    },
    {
      "text": "Rendl, C., Greindl, P., Probst, K., Behrens, M., and Haller, M. Presstures. in CHI. 2014. pp. 431--434.",
      "doi": "10.1145/2556288.2557146"
    },
    {
      "text": "Riek, K. A., Rogers, Y., and Connelley, K. H. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. in INTERACT. 2005. pp. 267--280.",
      "doi": ""
    },
    {
      "text": "Satomi, M. and Perner-Wilson, H. KOBAKANT. How to get what you want. http://www.kobakant.at/DIY/?cat=26. 23-Sep-2015.",
      "doi": ""
    },
    {
      "text": "Schmidt, D., Seifert, J., Rukzio, E., and Gellersen, H. A Cross-device Interaction Style for Mobiles and Surfaces. in DIS. 2012. pp. 318--327.",
      "doi": ""
    },
    {
      "text": "Wijesiriwardana, R., Dias, T., and Mukhopadhyay, S. Resistive fibre-meshed transducers. in ISWC. 2003.",
      "doi": ""
    },
    {
      "text": "Zhang, H., Tao, X., Yu, T., and Wang, S. Conductive knitted fabric as large-strain gauge under high temperature. Sensors and Actuators. vol. 126. 2006. pp. 129--140. ",
      "doi": ""
    },
    {
      "text": "Stretch Sense. https://www.stretchsense.com/. 29Dec-2016.",
      "doi": ""
    }
  ]
}