{
  "doi": "10.1145/3025453.3025485",
  "title": "What Happened in my Home?: An End-User Development Approach for Smart Home Data Visualization",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "853-866",
  "year": 2017,
  "badges": [],
  "abstract": "Smart home systems change the way we experience the home. While there are established research fields within HCI for visualizing specific use cases of a smart home, studies targeting user demands on visualizations spanning across multiple use cases are rare. Especially, individual data-related demands pose a challenge for usable visualizations. To investigate potentials of an end-user development (EUD) approach for flexibly supporting such demands, we developed a smart home system featuring both pre-defined visualizations and a visualization creation tool. To evaluate our concept, we installed our prototype in 12 households as part of a Living Lab study. Results are based on three interview studies, a design workshop and system log data. We identified eight overarching interests in home data and show how participants used pre-defined visualizations to get an overview and the creation tool to not only address specific use cases but also to answer questions by creating temporary visualizations.",
  "authors": [
    {
      "name": "Nico Castelli",
      "institution": "Bonn-Rhein-Sieg University of Applied Sciences & University of Siegen, Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658636227",
      "orcid": "missing"
    },
    {
      "name": "Corinna Ogonowski",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/do/10.1145/contrib-81464675868/rel-imgonly/corinna_ogonowski.jpg",
      "acmid": "81464675868",
      "orcid": "missing"
    },
    {
      "name": "Timo Jakobi",
      "institution": "Bonn-Rhein-Sieg University of Applied Sciences & University of Siegen, Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458953357",
      "orcid": "missing"
    },
    {
      "name": "Martin Stein",
      "institution": "University of Siegen & Fraunhofer Institute for Applied Information Technology (FIT), Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757281",
      "orcid": "missing"
    },
    {
      "name": "Gunnar Stevens",
      "institution": "Bonn-Rhein-Sieg University of Applied Sciences & University of Siegen, Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100661746",
      "orcid": "missing"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen & Fraunhofer Institute for Applied Information Technology (FIT), Siegen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Wolfgang Aigner, Silvia Miksch, Heidrun Schumann, and Christian Tominski. 2011. Visualization of TimeOriented Data. Springer London, London. ",
      "doi": ""
    },
    {
      "text": "Abdullah Al Mahmud, Omar Mubin, Suleman Shahid, James F. Juola, and Boris de Ruyter. 2008. EZ phone: persuading mobile users to conserve energy. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, InteractionVolume 2, 7--10.",
      "doi": ""
    },
    {
      "text": "Frances K. Aldrich. 2003. Smart Homes: Past, Present and Future. In Inside the Smart Home, Richard Harper (ed.). Springer London, 17--39. https://doi.org/10.1007/185233--854--7_2",
      "doi": ""
    },
    {
      "text": "M. Balestrini, T. Diez, P. Marshall, A. Gluhak, and Y. Rogers. 2015. IoT Community Technologies: Leaving Users to Their Own Devices or Orchestration of Engagement? EAI Endorsed Transactions on Internet of Things 1, 1: 150601. https://doi.org/10.4108/eai.26--102015.150601",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti and Keith Edwards. 2001. Intelligibility and Accountability: Human Considerations in Contextaware Systems. Hum.-Comput. Interact. 16, 2: 193--212. https://doi.org/10.1207/S15327051HCI16234_05  ",
      "doi": "10.1207/S15327051HCI16234_05"
    },
    {
      "text": "Regina Bernhaupt, Marianna Obrist, Astrid Weiss, Elke Beck, and Manfred Tscheligi. 2008. Trends in the living room and beyond: results from ethnographic studies using creative and playful probing. Computers in Entertainment (CIE) 6, 1: 5.",
      "doi": "10.1145/1350843.1350848"
    },
    {
      "text": "Christoffer Björkskog, Giulio Jacucci, Topi Mikkola, Massimo Bertoncini, Luciano Gamberini, Carin Torstensson, Tatu Nieminen, Luigi Briguglio, Pasquale Andriani, and Giampaolo Fiorentino. 2010. Beaware: A framework for residential services on energy awareness. In UBICOMM 2010, The Fourth International Conference on Mobile Ubiquitous Computing, Systems, Services and Technologies, 294--300.",
      "doi": ""
    },
    {
      "text": "K. Borner, Unkown, and Unknown. InfoVis CyberInfrastructure- Spring Embedding Algorithm. Retrieved September 5, 2016 from http://iv.slis.indiana.edu/sw/toolkit.html",
      "doi": ""
    },
    {
      "text": "L. Borodulkin, H. Ruser, and H. R. Trankler. 2002. 3D virtual \"smart home\" user interface. In 2002 IEEE International Symposium on Virtual and Intelligent Measurement Systems, 2002. VIMS '02, 111--115. https://doi.org/10.1109/VIMS.2002.1009367",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2: 77--101. ",
      "doi": ""
    },
    {
      "text": "A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home Automation in the Wild: Challenges and Opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2115-- 2124. https://doi.org/10.1145/1978942.1979249",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 423--432. https://doi.org/10.1145/1357054.1357123",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Stuart K. Card, Jock D. Mackinlay, and Ben Shneiderman. 1999. Readings in Information Visualization: Using Vision to Think. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Nico Castelli, Gunnar Stevens, Timo Jakobi, and Niko Schönau. 2016. Beyond Eco-feedback: Using Room as a Context to Design New Eco-support Features at Home. In Advances and New Trends in Environmental and Energy Informatics, Jorge Marx Gomez, Michael Sonnenschein, Ute Vogel, Andreas Winter, Barbara Rapp and Nils Giesen (eds.). Springer International Publishing, 177--195. https://doi.org/10.1007/978--3--319--23455--7_10",
      "doi": ""
    },
    {
      "text": "Marshini Chetty, Ja-Young Sung, and Rebecca E. Grinter. 2007. How Smart Homes Learn: The Evolution of the Networked Home and Household. In Proceedings of the 9th International Conference on Ubiquitous Computing (UbiComp '07), 127--144. ",
      "doi": ""
    },
    {
      "text": "Ricardo Costa, Davide Carneiro, Paulo Novais, Luís Lima, José Machado, Alberto Marques, and José Neves. 2009. Ambient assisted living. In 3rd Symposium of Ubiquitous Computing and Ambient Intelligence 2008, 86-- 94. ",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2012. Understanding domestic energy consumption through interactive visualisation: a field study. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, 216--225.  ",
      "doi": "10.1145/2370216.2370251"
    },
    {
      "text": "Sarah Darby. 2006. The effectiveness of feedback on energy consumption. A Review for DEFRA of the Literature on Metering, Billing and direct Displays 486: 2006.",
      "doi": ""
    },
    {
      "text": "Luigi De Russis and Fulvio Corno. 2015. HomeRules: A Tangible End-User Programming Interface for Smart Homes. 2109--2114. https://doi.org/10.1145/2702613.2732795",
      "doi": "10.1145/2702613.2732795"
    },
    {
      "text": "Anind K. Dey, Timothy Sohn, Sara Streng, and Justin Kodama. 2006. iCAP: Interactive Prototyping of ContextAware Applications. In Pervasive Computing, Kenneth P. Fishkin, Bernt Schiele, Paddy Nixon and Aaron Quigley (eds.). Springer Berlin Heidelberg, 254--271. https://doi.org/10.1007/11748625_16",
      "doi": "10.1007/11748625_16"
    },
    {
      "text": "Sebastian Draxler, Gunnar Stevens, Martin Stein, Alexander Boden, and David Randall. 2012. Supporting the social context of technology appropriation: on a synthesis of sharing tools and tool knowledge. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2835--2844.  ",
      "doi": "10.1145/2207676.2208687"
    },
    {
      "text": "W. Keith Edwards and Rebecca E. Grinter. 2001. At Home with Ubiquitous Computing: Seven Challenges. In Proceedings of the 3rd International Conference on Ubiquitous Computing (UbiComp '01), 256--272. ",
      "doi": ""
    },
    {
      "text": "Mats Eriksson and Seija Kulkki. 2005. State-of-the-Art in Utilizing Living Labs Approach to User-centric ICT innovation -- a European approach. ResearchGate 15.",
      "doi": ""
    },
    {
      "text": "Jean-Daniel Fekete. 2004. The InfoVis Toolkit. In Proceedings of the IEEE Symposium on Information Visualization (INFOVIS '04), 167--174. https://doi.org/10.1109/INFOVIS.2004.64",
      "doi": ""
    },
    {
      "text": "Stephen Few. 2006. Information Dashboard Design: The Effective Visual Communication of Data. O'Reilly Media, Beijing?; Cambride MA.",
      "doi": "10.5555/1206491"
    },
    {
      "text": "Joel E. Fischer, Andy Crabtree, Tom Rodden, James A. Colley, Enrico Costanza, Michael O. Jewell, and Sarvapali D. Ramchurn. 2016. \"Just Whack It on Until It Gets Hot\": Working with IoT Data in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5933--5944. https://doi.org/10.1145/2858036.2858518",
      "doi": "10.1145/2858036.2858518"
    },
    {
      "text": "Geraldine Fitzpatrick and Greg Smith. 2009. Technology-enabled feedback on domestic energy consumption: Articulating a set of design concerns. Pervasive Computing, IEEE 8, 1: 37--44.  ",
      "doi": "10.1109/MPRV.2009.17"
    },
    {
      "text": "Asbjørn Følstad, Petter Bae Brandtzæg, Jan Gulliksen, Mikael Börjeson, and Pirjo Näkki. 2009. Towards a Manifesto for Living Lab Co-creation. In Human-Computer Interaction -- INTERACT 2009, Tom Gross, Jan Gulliksen, Paula Kotzé, Lars Oestreicher, Philippe Palanque, Raquel Oliveira Prates and Marco Winckler (eds.). Springer Berlin Heidelberg, 979--980. https://doi.org/10.1007/978--3--64203658--3_140",
      "doi": ""
    },
    {
      "text": "Jon Froehlich. 2011. Sensing and Feedback of Everyday Activities to Promote Environmental Behaviors. University of Washington.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The Design of Eco-feedback Technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1999--2008. https://doi.org/10.1145/1753326.1753629",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Catherine Grevet, Jennifer Mankoff, and Scott D. Anderson. 2010. Design and evaluation of a social visualization aimed at encouraging sustainable behavior. In System Sciences (HICSS), 2010 43rd Hawaii International Conference on, 1--8.  ",
      "doi": "10.1109/HICSS.2010.135"
    },
    {
      "text": "Rebecca E. Grinter, W. Keith Edwards, Mark W. Newman, and Nicolas Ducheneaut. 2005. The Work to Make a Home Network Work. In Proceedings of the Ninth Conference on European Conference on Computer Supported Cooperative Work (ECSCW'05), 469--488. ",
      "doi": ""
    },
    {
      "text": "Yukang Guo, Matt Jones, Benjamin Cowan, and Russell Beale. 2013. Take it personally: personal accountability and energy consumption in domestic households. In CHI'13 Extended Abstracts on Human Factors in Computing Systems, 1467--1472.  ",
      "doi": "10.1145/2468356.2468618"
    },
    {
      "text": "Helen Ai He, Saul Greenberg, and Elaine M. Huang. 2010. One size does not fit all: applying the transtheoretical model to energy feedback technology design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 927--936.  ",
      "doi": "10.1145/1753326.1753464"
    },
    {
      "text": "Jeffrey Heer, Stuart K. Card, and James A. Landay. 2005. Prefuse: A Toolkit for Interactive Information Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05), 421--430. https://doi.org/10.1145/1054972.1055031",
      "doi": "10.1145/1054972.1055031"
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. 1608--1619. https://doi.org/10.1145/2858036.2858059",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Jan Humble, Andy Crabtree, Terry Hemmings, KarlPetter Åkesson, Boriana Koleva, Tom Rodden, and Pär Hansson. 2003. \"Playing with the Bits\" User-Configuration of Ubiquitous Domestic Environments. In UbiComp 2003: Ubiquitous Computing, Anind K. Dey, Albrecht Schmidt and Joseph F. McCarthy (eds.). Springer Berlin Heidelberg, 256--263. https://doi.org/10.1007/978--3--540--39653--6_20",
      "doi": ""
    },
    {
      "text": "IFTTT. IFTTT. IFTTT / Connect the apps you love. Retrieved September 18, 2016 from https://ifttt.com/recipes",
      "doi": ""
    },
    {
      "text": "T. Jakobi and T. Schwartz. 2012. Putting the user in charge: End user development for eco-feedback technologies. In Sustainable Internet and ICT for Sustainability (SustainIT), 2012, 1--4.",
      "doi": ""
    },
    {
      "text": "Li Jönsson, Loove Broms, and Cecilia Katzeff. 2010. Watt-Lite: Energy Statistics Made Tangible. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10), 240--243. https://doi.org/10.1145/1858171.1858214",
      "doi": "10.1145/1858171.1858214"
    },
    {
      "text": "Ben Kirman, Conor Linehan, Shaun Lawson, Derek Foster, and Mark Doughty. 2010. There's a monster in my kitchen: using aversive feedback to motivate behaviour change. In CHI'10 Extended Abstracts on Human Factors in Computing Systems, 2685--2694.  ",
      "doi": "10.1145/1753846.1753852"
    },
    {
      "text": "Jesper Kjeldskov, Mikael B. Skov, Jeni Paay, and Rahuvaran Pathmanathan. 2012. Using mobile phones to support sustainability: a field study of residential electricity consumption. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, 2347--2356.  ",
      "doi": "10.1145/2207676.2208395"
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-User Development: An Emerging Paradigm. In End User Development, Henry Lieberman, Fabio Paternò and Volker Wulf (eds.). Springer Netherlands, 1--8. https://doi.org/10.1007/1--4020--5386-X_1 ",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim, Anind K. Dey, and Daniel Avrahami. 2009. Why and Why Not Explanations Improve the Intelligibility of Context-aware Intelligent Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 2119--2128. https://doi.org/10.1145/1518701.1519023",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Jörn Loviscach. 2011. The design space of personal energy conservation assistants. PsychNology Journal 9, 1: 29--41.",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken and Elaine M. Huang. 2012. Hacking the Natural Habitat: An In-the-wild Study of Smart Homes, Their Development, and the People Who Live in Them. In Proceedings of the 10th International Conference on Pervasive Computing (Pervasive'12), 143--160. https://doi.org/10.1007/978--3--642--31205--2_10",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken, David Kim, and Elaine May Huang. 2016. Integrating the Smart Home into the Digital Calendar. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5958--5969. https://doi.org/10.1145/2858036.2858168",
      "doi": "10.1145/2858036.2858168"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From Today's Augmented Houses to Tomorrow's Smart Homes: New Directions for Home Automation Research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 105--115. https://doi.org/10.1145/2632048.2636076",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Maurice Mulvenna, William Carswell, Paul Mccullagh, Juan Augusto, Huiru Zheng, Paul Jeffers, Haiying Wang, and Suzanne Martin. 2011. Visualization of data for ambient assisted living services. IEEE Communications Magazine 49, 1: 110--117. https://doi.org/10.1109/MCOM.2011.5681023  ",
      "doi": "10.1109/MCOM.2011.5681023"
    },
    {
      "text": "Mark W. Newman. Now We're Cooking: Recipes for End-User Service Composition in the Digital Home. ResearchGate.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Usability engineering. Morgan Kaufmann Publishers, San Francisco, Calif.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Torkel Ödegaard. The leading graph and dashboard builder for visualizing time series metrics. Grafana.org. Retrieved September 18, 2016 from http://grafana.org/",
      "doi": ""
    },
    {
      "text": "Corinna Ogonowski, Benedikt Ley, and Jan Hess. 2013. Designing for the living room: long-term user involvement in a living lab. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2470654.2466205"
    },
    {
      "text": "Petromil Petkov, Felix Köbler, Marcus Foth, and Helmut Krcmar. 2011. Motivating domestic energy conservation through comparative, community-based feedback in mobile and social media. In Proceedings of the 5th International Conference on Communities and Technologies, 21--30.  ",
      "doi": "10.1145/2103354.2103358"
    },
    {
      "text": "James Pierce, William Odom, and Eli Blevis. 2008. Energy Aware Dwelling: A Critical Survey of Interaction Design for Eco-visualizations. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08), 1--8. https://doi.org/10.1145/1517744.1517746",
      "doi": "10.1145/1517744.1517746"
    },
    {
      "text": "J. Rodgers and L. Bartram. 2011. Exploring Ambient and Artistic Visualization for Residential Energy Use Feedback. IEEE Transactions on Visualization and Computer Graphics 17, 12: 2489--2497. https://doi.org/10.1109/TVCG.2011.196  ",
      "doi": "10.1109/TVCG.2011.196"
    },
    {
      "text": "Ana Rosselló-Busquet and José Soler. Towards Efficient Energy Management: Defining HEMS and Smart Grid Objectives. ResearchGate.",
      "doi": ""
    },
    {
      "text": "Tobias Schwartz, Sebastian Denef, Gunnar Stevens, Timo Jakobi, Volker Wulf, and Leonardo Ramirez. 2014. What People Do with Consumption Feedback: A LongTerm Living Lab Study of a Home Energy Management System, in: Interacting with Computers, 27 (6), 2015, 551-",
      "doi": ""
    },
    {
      "text": "Tobias Schwartz, Sebastian Denef, Gunnar Stevens, Leonardo Ramirez, and Volker Wulf. 2013. Cultivating energy literacy: results from a longitudinal living lab study of a home energy management system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 1193--1202. https://doi.org/10.1145/2470654.2466154",
      "doi": "10.1145/2470654.2466154"
    },
    {
      "text": "Anneli Selvefors, M. Karlsson, and Ulrike Rahe. 2013. Use and Adoption of Interactive Energy Feedback Systems. Proceedings of IASDR: 1771--1782. ",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1996. The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations. In Proceedings of the 1996 IEEE Symposium on Visual Languages (VL '96), 336--.",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Ben Shneiderman. 2004. Designing the User Interface: Strategies for Effective Human-Computer Interaction. Addison Wesley, Boston.",
      "doi": "10.5555/3033040"
    },
    {
      "text": "Martin Stein, Alexander Boden, Dominik Hornung, and Volker Wulf. 2016. Third Spaces in the Age of IoT: A Study on Participatory Design of Complex Systems. In Symposium on Challenges and experiences in designing for an ageing society, 12th International Conference on Designing Interactive Systems (COOP).",
      "doi": ""
    },
    {
      "text": "Gunnar Stevens, Volkmar Pipek, and Volker Wulf. 2009. Appropriation Infrastructure: Supporting the Design of Usages. . Springer Berlin Heidelberg, 50--69.  ",
      "doi": "10.1109/ITNG.2009.169"
    },
    {
      "text": "Hong Sun, Vincenzo De Florio, Ning Gui, and Chris Blondia. 2009. Promises and challenges of ambient assisted living systems. In Information Technology: New Generations, 2009. ITNG'09. Sixth International Conference on, 1201--1207.",
      "doi": "10.1109/ITNG.2009.169"
    },
    {
      "text": "Vasughi Sundramoorthy, Qi Liu, Grahame Cooper, Nigel Linge, and Joshua Cooper. 2010. DEHEMS: A userdriven domestic energy monitoring system. In Internet of Things (IOT), 2010, 1--8.",
      "doi": ""
    },
    {
      "text": "Barnabás Takács and Dávid Hanák. 2006. A mobile system for assisted living with ambient facial interfaces. ResearchGate 2: 33--50.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. \"This Has to Be the Cats\": Personal Data Legibility in Networked Sensing Systems. In Proceedings of the 19th ACM Conference on ComputerSupported Cooperative Work & Social Computing (CSCW '16), 491--502. https://doi.org/10.1145/2818048.2819992",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "C. Tominski, G. Fuchs, and H. Schumann. 2008. TaskDriven Color Coding. In Information Visualisation, 2008. IV '08. 12th International Conference, 373--380. https://doi.org/10.1109/IV.2008.24",
      "doi": "10.1109/IV.2008.24"
    },
    {
      "text": "Khai N. Truong, Elaine M. Huang, and Gregory D. Abowd. 2004. CAMP: A Magnetic Poetry Interface for End-User Programming of Capture Applications for the Home. In UbiComp 2004: Ubiquitous Computing, Nigel Davies, Elizabeth D. Mynatt and Itiro Siio (eds.). Springer Berlin Heidelberg, 143--160. https://doi.org/10.1007/978--3540--30119--6_9  ",
      "doi": ""
    },
    {
      "text": "Michael B. Twidale. 2005. Over the Shoulder Learning: Supporting Brief Informal Learning. Computer Supported Cooperative Work (CSCW) 14, 6: 505--547. https://doi.org/10.1007/s10606-005--9007--7",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User Experience in Do-it-yourself-style Smart Homes. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 779--790. https://doi.org/10.1145/2750858.2806063",
      "doi": "10.1145/2750858.2806063"
    },
    {
      "text": "Volker Wulf, Claudia Müller, Volkmar Pipek, David Randall, Markus Rohde, and Gunnar Stevens. 2015. Practice-Based Computing: Empirically Grounded Conceptualizations Derived from Design Case Studies. In Designing Socially Embedded Technologies in the RealWorld. Springer London, 111--150.",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Markus Rohde, V Pipek, and G Stevens. 2011. Engaging with practices: design case studies as a research framework in CSCW. Proceedings of the ACM 2011 conference on Computer supported cooperative work: 505--512.  ",
      "doi": "10.1145/1520340.1520676"
    },
    {
      "text": "Tae-Jung Yun. 2009. Investigating the impact of a minimalist in-home energy consumption display. In CHI'09 Extended Abstracts on Human Factors in Computing Systems, 4417--4422.  ",
      "doi": "10.1080/01449290701573978"
    },
    {
      "text": "Bin Zhang, Pei-Luen Patrick Rau, and Gavriel Salvendy. 2009. Design and evaluation of smart home user interface: effects of age, tasks and intelligence level. Behaviour & Information Technology 28, 3: 239--249. https://doi.org/10.1080/01449290701573978",
      "doi": "10.1080/01449290701573978"
    },
    {
      "text": "openHAB. Retrieved January 1, 2017 from http://www.openhab.org/",
      "doi": ""
    }
  ]
}