{
  "doi": "10.1145/3025453.3026014",
  "title": "ProCom: Designing and Evaluating a Mobile and Wearable System to Support Proximity Awareness for People with Autism",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "2865-2877",
  "year": 2017,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "People with autism are at risk for social isolation due to differences in their perception and engagement with the social world. In this work, we aim to address one specific concern related to socialization the understanding, awareness, and use of interpersonal space. Over the course of a year, we iteratively designed and tested a series of concepts for supporting children with autism in perceiving, understanding, and responding to physical proximity with other people. During this process, we developed ProCom, a prototype system for measuring proximity without requiring instrumentation of the environment or another person. We used a variety of low and high fidelity prototypes, culminating in ProCom, to assess the feasibility, utility, and challenges of this approach. The results of these iterative design engagements indicate that wearable assistive technologies can support people in developing awareness of physical proximity in social settings. However, challenges related to both personal and collective use remain",
  "tags": [
    "social skills",
    "autism",
    "wearable computing",
    "parallel design",
    "self-monitoring",
    "children",
    "proximity"
  ],
  "authors": [
    {
      "name": "LouAnne E. Boyd",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460647791",
      "orcid": "0000-0002-9244-6581"
    },
    {
      "name": "Xinlong Jiang",
      "institution": "University of Chinese Academy of Sciences, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658636175",
      "orcid": "missing"
    },
    {
      "name": "Gillian R. Hayes",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592620",
      "orcid": "0000-0003-0966-8739"
    }
  ],
  "references": [
    {
      "text": "Bretagne Abirached, Yan Zhang, and Ji Hyun Park. 2012. Understanding User Needs for Serious Games for Teaching Children with Autism Spectrum Disorders Emotions. In EdMedia: World Conference on Educational Media and Technology, vol. 2012, no. 1, pp. 1054--1063.",
      "doi": ""
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10), 121--130. DOI:http://dx.doi.org/10.1145/1936652.1936676  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Nirit Bauminger and Connie Kasari. 2000. Loneliness and friendship in high-functioning children with autism. Child development 71, 2: 447--456. ",
      "doi": ""
    },
    {
      "text": "Scott Bellini. 2007. Building Social Relationships: A Systematic Approach to Teaching Social Interaction Skills to Children And Adolescents With Autism Spectrum Disorders and Other Social Difficulties. AAPC Publishing.",
      "doi": ""
    },
    {
      "text": "Sofiane Boucenna, Antonio Narzisi, Elodie Tilmont, Filippo Muratori, Giovanni Pioggia, David Cohen, and Mohamed Chetouani. 2014. Interactive Technologies for Autistic Children: A Review. Cognitive Computation 6, 4: 722--740. DOI:http://dx.doi.org/10.1007/s12559-014-9276-x ",
      "doi": ""
    },
    {
      "text": "LouAnne Boyd, Christina McReynolds, and Karen Chanin. 2013. The Social Compass Curriculum: a story-based intervention package for students with autism spectrum disorders. Brookes Publishing Co.",
      "doi": ""
    },
    {
      "text": "LouAnne Boyd, Alejandro Rangel, Helen Tomimbang, Andrea Toldeo-Conejo, Kanika Patel, Monica Tentori, and Gillian R. Hayes. 2016. SayWAT: Augmenting Face-to-Face Conversations for Adults with Autism. In Proceedings of the ACM CHI conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA. DOI:http://dx.doi.org/10.1145%2F2858036.2858215",
      "doi": ""
    },
    {
      "text": "Brandt Chamberlain, Connie Kasari, and Erin Rotheram-Fuller. 2007. Involvement or isolation? The social networks of children with autism in regular classrooms. Journal of Autism and Developmental Disorders 37, 2: 230--242. DOI:http://dx.doi.org/10.1007/s10803-006-0164-4 ",
      "doi": ""
    },
    {
      "text": "David Dearman, Richard Guy, and Khai Truong. 2012. Determining the Orientation of Proximate Mobile Devices Using Their Back Facing Camera. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2231--2234. DOI:http://dx.doi.org/10.1145/2207676.2208377  ",
      "doi": "10.1145/2207676.2208377"
    },
    {
      "text": "Justin A. Ehrlich and James R. Miller. 2009. A Virtual Environment for Teaching Social Skills: AViSSS. IEEE Computer Graphics and Applications 29, 4: 10-- 16. DOI:http://dx.doi.org/10.1109/MCG.2009.57  ",
      "doi": ""
    },
    {
      "text": "Pier L. Emiliani and Constantine Stephanidis. 2005. Universal access to ambient intelligence environments: Opportunities and challenges for people with disabilities. IBM Systems Journal 44, 3: 605--619. DOI:http://dx.doi.org/10.1147/sj.443.0605  ",
      "doi": "10.1147/sj.443.0605"
    },
    {
      "text": "Lizbeth Escobedo, David H. Nguyen, LouAnne Boyd, Sen Hirano, Alejandro Rangel, Daniel Garcia-Rosas, Monica Tentori, and Gillian Hayes. 2012. MOSOCO: A Mobile Assistive Tool to Support Children with Autism Practicing Social Skills in Real-life Situations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 2589--2598. DOI:http://dx.doi.org/10.1145/2207676.2208649  ",
      "doi": "10.1145/2207676.2208649"
    },
    {
      "text": "David Feil-Seifer and Maja Mataric. 2011. Automated Detection and Classification of Positive vs. Negative Robot Interactions with Children with Autism Using Distance-based Features. In Proceedings of the 6th International Conference on Human-robot Interaction (HRI '11), 323--330. DOI:http://dx.doi.org/10.1145/1957656.1957785  ",
      "doi": "10.1145/1957656.1957785"
    },
    {
      "text": "David Feil-Seifer and Maja Mataric. 2012. DistanceBased Computational Models for Facilitating Robot Interaction with Children. Journal of Human-Robot Interaction 1, 1.",
      "doi": ""
    },
    {
      "text": "Deborah G. Garfin and Catherine Lord. 1986. Communication as a Social Problem in Autism. In Social Behavior in Autism, Eric Schopler and Gary B. Mesibov (eds.). Springer US, 133--151. ",
      "doi": ""
    },
    {
      "text": "Daniel Gatica-Perez. 2009. Automatic nonverbal analysis of social interaction in small groups: A review. Image and Vision Computing 27, 12: 1775--1787. DOi:http://dx.doi.org/10.1016/j.imavis.2009.01.004  ",
      "doi": "10.1016/j.imavis.2009.01.004"
    },
    {
      "text": "Peter F. Gerhardt and Ilene Lainer. 2011. Addressing the Needs of Adolescents and Adults with Autism: A Crisis on the Horizon. Journal of Contemporary Psychotherapy 41, 1: 37--45. DOI:http://dx.doi.org/10.1007/s10879-010--9160--2",
      "doi": ""
    },
    {
      "text": "Erica Gessaroli, Erica Santelli, Giuseppe di Pellegrino, and Francesca Frassinetti. 2013. Personal Space Regulation in Childhood Autism Spectrum Disorders. PLOS ONE 8, 9: e74959. DOT:http://dx.doi.org/10.1371/journal.pone.0074959 ",
      "doi": ""
    },
    {
      "text": "Edward T. Hall. 1963. A System for the Notation of Proxemic Behavior1. American Anthropologist 65, 5: 1003--1026. DOI:http://dx.doi.org/10.1525/aa.1963.65.5.02a00020 ",
      "doi": ""
    },
    {
      "text": "Edward T. Hall, Ray L. Birdwhistell, Bernhard Bock, Paul Bohannan, A. Richard Diebold, Marshall Durbin, Munro S. Edmonson, J. L. Fischer, Dell Hymes, Solon T. Kimball, Weston La Barre, S. J. Frank Lynch, J. E. McClellan, Donald S. Marshall, G. B. Milner, Harvey B. Sarles, George L Trager, and Andrew P. Vayda. 1968. Proxemics [and Comments and Replies]. Current Anthropology 9, 2/3: 83--108.",
      "doi": ""
    },
    {
      "text": "Edward Twitchell Hall. 1966. The hidden dimension (1st ed.). Doubleday & Co, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Owen Hargie, Christine Saunders, and David Dickson. 1994. Social Skills in Interpersonal Communication. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Tina Iachini, Yann Coello, Francesca Frassinetti, and Gennaro Ruggiero. 2014. Body Space in Social Interactions: A Comparison of Reaching and Comfort Distance in Immersive Virtual Reality. PLOS ONE 9, 11: e111511. DOI:http://dx.doi.org/10.1371/journal.pone.0111511 ",
      "doi": ""
    },
    {
      "text": "Xinlong Jiang, LouAnne E. Boyd, Yiqiang Chen, and Gillian R. Hayes. 2016. ProCom: Designing a Mobile and Wearable System to Support Proximity Awareness for People with Autism. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16), 93-- 96. DOI:http://dx.doi.org/10.1145/2968219.2971445  ",
      "doi": "10.1145/2968219.2971445"
    },
    {
      "text": "R. el Kaliouby, A. Teeters, and R. W. Picard. 2006. An exploratory social-emotional prosthetic for autism spectrum disorders. In International Workshop on Wearable and Implantable Body Sensor Networks, 2006. BSN 2006, 2 pp.--4. DOI:http://dx.doi.org/10.1109/BSN.2006.34  ",
      "doi": "10.1109/BSN.2006.34"
    },
    {
      "text": "Adam Kendon. 1990. Conducting interaction: Patterns of behavior in focused encounters. CUP Archive.",
      "doi": ""
    },
    {
      "text": "Daniel P. Kennedy and Ralph Adolphs. 2014. Violations of Personal Space by Individuals with Autism Spectrum Disorder. PLOS ONE 9, 8: e103369. DOI:http://dx.doi.org/10.1371/journal.pone.0103369 ",
      "doi": ""
    },
    {
      "text": "D. P. Kennedy, J. N. Constantino, and R. Adolphs. 2010. Personal space and interpersonal distance in autism: insights from the SRS. In International Meeting for Autism Research (IMFAR). Philadelphia.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler and Jonathon N. Cummings. 2002. What do we know about proximity and distance in work groups?: a legacy of research. Distributed work 1 (2002) 57--80.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stagebased model of personal informatics systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 557--566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Jacob Lomranz, Ariela Shapira, Netta Choresh, and Yitzchak Gilat. 1975. Children's personal space as a function of age and sex. Developmental Psychology 11, 5: 541.",
      "doi": ""
    },
    {
      "text": "Miriam Madsen, Rana El Kaliouby, Matthew Goodwin, and Rosalind Picard. 2008. Technology for just-in-time in-situ learning of facial affect for persons diagnosed with an autism spectrum disorder. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility, 19--26.  ",
      "doi": "10.1145/1414471.1414477"
    },
    {
      "text": "Ross Mead, Amin Atrash, and Maja J. Matarić. 2011. Proxemic Feature Recognition for Interactive Robots: Automating Metrics from the Social Sciences. In Social Robotics, Bilge Mutlu, Christoph Bartneck, Jaap Ham, Vanessa Evers and Takayuki Kanda (eds.). Springer Berlin Heidelberg, 52--61.  ",
      "doi": "10.1007/978-3-642-25504-5_6"
    },
    {
      "text": "Prasant Misra, Salil S. Kanhere, Sanjat Jha, and Wen Hu. 2015. Sparse representation based acoustic rangefinders: from sensor platforms to mobile devices. IEEE Communications Magazine 53, 1: 249--257. DOI:http://dx.doi.org/10.1109/MCOM.2015.7010542 ",
      "doi": "10.1109/MCOM.2015.7010542"
    },
    {
      "text": "Peter R. Monge and Kenneth K. Kirste. 1980. Measuring Proximity in Human Organization. Social Psychology Quarterly 43, 1: 110--115. DOI:http://dx.doi.org/10.2307/3033753 ",
      "doi": ""
    },
    {
      "text": "Peter R. Monge, Lynda White Rothman, Eric M. Eisenberg, Katherine I. Miller, and Kenneth K. Kirste. 1985. The Dynamics of Organizational Proximity. Management Science 31, 9: 1129--1141. DOI:http://dx.doi.org/10.1287/mnsc.31.9.1129 ",
      "doi": "10.1287/mnsc.31.9.1129"
    },
    {
      "text": "Brenda Smith Myles, Melissa Trautman, and Ronda L Schelvan. 2004. The hidden curriculum: practical solutions for understanding unstated rules in social situations. Autism Asperger Pub. Co., Shawnee Mission, KS.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen and Jan M. Faber. 1996. Improving system usability through parallel design. Computer 29, 2: 29--35. DOI:http://dx.doi.org/10.1109/2.485844  ",
      "doi": "10.1109/2.485844"
    },
    {
      "text": "Anat Perry, Nikolay Nichiporuk, and Robert T. Knight. 2015. Where does one stand: a biological account of preferred interpersonal distance. Social Cognitive and Affective Neuroscience: nsv115. DOI:http://dx.doi.org/10.1093/scan/nsv115 ",
      "doi": ""
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 4884--4895. DOI:http://dx.doi.org/10.1145/2858036.2858130  ",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Dan Saffer. 2013. Microinteractions: Designing with Details. O'Reilly Media, Inc.",
      "doi": "10.5555/2531374"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective Design. In Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility (CC '05), 49--58. DOI:http://dx.doi.org/10.1145/1094562.1094569  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "James Stanfield. Social Boundaries: The Circles Curriculum. Santa Barbara, CA 2017",
      "doi": ""
    },
    {
      "text": "Monica Tentori and Gillian R. Hayes. 2010. Designing for interaction immediacy to enhance social skills of children with autism. 51. DOI:http://dx.doi.org/10.1145/1864349.1864359  ",
      "doi": "10.1145/1864349.1864359"
    },
    {
      "text": "Jorge Torres-Solis, Tiago H. Falk, and Tom Chau. 2010. A review of indoor localization technologies: towards navigational assistance for topographical disorientation. INTECH Open Access Publisher.",
      "doi": ""
    },
    {
      "text": "Xianhui Wang, James Laffey, Wanli Xing, Yanfei Ma, and Janine Stichter. 2016. Exploring embodied social presence of youth with Autism in 3D collaborative virtual learning environment: A case study. Computers in Human Behavior 55, Part A: 310--321. DOI:http://dx.doi.org/10.1016/j.chb.2015.09.006  ",
      "doi": "10.1016/j.chb.2015.09.006"
    },
    {
      "text": "Susan Williams White, Kathleen Keonig, and Lawrence Scahill. 2006. Social Skills Development in Children with Autism Spectrum Disorders: A Review of the Intervention Research. Journal of Autism and Developmental Disorders 37, 10: 1858--1868. DOI:http://dx.doi.org/10.1007/s10803-006-0320-x ",
      "doi": ""
    },
    {
      "text": "Zhengyou Zhang. 2012. Microsoft Kinect Sensor and Its Effect. IEEE MultiMedia 19, 2: 4--10. DOI:http://dx.doi.org/10.1109/MMUL.2012.24  ",
      "doi": "10.1109/MMUL.2012.24"
    }
  ]
}