{
  "doi": "10.1145/3025453.3025814",
  "title": "Understanding Blind People's Experiences with Computer-Generated Captions of Social Media Images",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "5988-5999",
  "year": 2017,
  "badges": [],
  "abstract": "Research advancements allow computational systems to automatically caption social media images. Often, these captions are evaluated with sighted humans using the image as a reference. Here, we explore how blind and visually impaired people experience these captions in two studies about social media images. Using a contextual inquiry approach (n=6 blind/visually impaired), we found that blind people place a lot of trust in automatically generated captions, filling in details to resolve differences between an image's context and an incongruent caption. We built on this in-person study with a second, larger online experiment (n=100 blind/visually impaired) to investigate the role of phrasing in encouraging trust or skepticism in captions. We found that captions emphasizing the probability of error, rather than correctness, encouraged people to attribute incongruence to an incorrect caption, rather than missing details. Where existing research has focused on encouraging trust in intelligent systems, we conclude by challenging this assumption and consider the benefits of encouraging appropriate skepticism.",
  "tags": [
    "automatic image captioning",
    "alt text",
    "accessibility",
    "twitter",
    "social media",
    "blindness"
  ],
  "authors": [
    {
      "name": "Haley MacLeod",
      "institution": "Indiana University, Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83058732857",
      "orcid": "missing"
    },
    {
      "name": "Cynthia L. Bennett",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358692957",
      "orcid": "0000-0003-1036-2497"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    }
  ],
  "references": [
    {
      "text": "Stavros Antifakos, Nicky Kern, Bernt Schiele, and Adrian Schwaninger. 2005. Towards Improving Trust in Context-aware Systems by Displaying System Confidence. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices & Services (MobileHCI '05), 9--14.  ",
      "doi": "10.1145/1085777.1085780"
    },
    {
      "text": "Johannes Beller, Matthias Heesen, and Mark Vollrath. 2013. Improving the driver--automation interaction an approach using automation uncertainty. Human Factors: The Journal of the Human Factors and Ergonomics Society 55, 6: 1130--1141.",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. 2010. VizWiz: Nearly Real-time Answers to Visual Questions. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10), 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P. Bigham, Ryan S. Kaminsky, Richard E. Ladner, Oscar M. Danielsson, and Gordon L. Hempton. 2006. WebInSight:: Making Web Images Accessible. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '06), 181--188.  ",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Erin L. Brady, Yu Zhong, Meredith Ringel Morris, and Jeffrey P. Bigham. 2013. Investigating the Appropriateness of Social Network Question Asking As a Resource for Blind Users. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), 1225--1236.  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Michele A. Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P. Bigham, and Amy Hurst. 2012. Crowdsourcing Subjective Fashion Advice Using VizWiz: Challenges and Opportunities. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12), 135--142.  ",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Eun Kyoung Choe, Jaeyeon Jung, Bongshin Lee, and Kristie Fisher. 2013. Nudging People Away from Privacy-Invasive Mobile Apps through Visual Framing. In Human-Computer Interaction -- INTERACT 2013: 14th IFIP TC 13 International Conference, Cape Town, South Africa, September 2--6, 2013, Proceedings, Part III, Paula Kotzé, Gary Marsden, Gitte Lindgaard, Janet Wesson and Marco Winckler (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 74--91. Retrieved from",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Sean Munson, Wanda Pratt, and Julie A. Kientz. 2013. Persuasive Performance Feedback: The Effect of Framing on Self-Efficacy. AMIA Annual Symposium Proceedings 2013: 825--833.",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Hao Cheng, Hao Fang, Saurabh Gupta, Li Deng, Xiaodong He, Geoffrey Zweig, and Margaret Mitchell. 2015. Language Models for Image Captioning: The Quirks and What Works. In ACL -- Association for Computational Linguistics, 100.",
      "doi": ""
    },
    {
      "text": "Jeff Donahue, Lisa Anne Hendricks, Sergio Guadarrama, Marcus Rohrbach, Subhashini Venugopalan, Trevor Darrell, and Kate Saenko. 2015. Long-term recurrent convolutional networks for visual recognition and description. 2625--2634.",
      "doi": ""
    },
    {
      "text": "Jack Dorsey. 2011. search+photos. Twitter Blogs. Retrieved August 12, 2016 from https://blog.twitter.com/2011/searchphotos",
      "doi": ""
    },
    {
      "text": "Hao Fang, Saurabh Gupta, Forrest Iandola, Rupesh K. Srivastava, Li Deng, Piotr Dollar, Jianfeng Gao, Xiaodong He, Margaret Mitchell, John C. Platt, C. Lawrence Zitnick, and Geoffrey Zweig. 2015. From captions to visual concepts and back. In Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on, 1473--1482.",
      "doi": ""
    },
    {
      "text": "Morten Goodwin, Deniz Susar, Annika Nietzio, Mikael Snaprud, and Christian S. Jensen. 2011. Global Web Accessibility Analysis of National Government Portals and Ministry Web Sites. Journal of Information Technology & Politics 8, 1: 41--67.",
      "doi": ""
    },
    {
      "text": "Jan Hartmann, Antonella De Angeli, and Alistair Sutcliffe. 2008. Framing the User Experience: Information Biases on Website Quality Judgement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 855--864.  ",
      "doi": "10.1145/1357054.1357190"
    },
    {
      "text": "Tove Helldin, Göran Falkman, Maria Riveiro, and Staffan Davidsson. 2013. Presenting System Uncertainty in Automotive UIs for Supporting Trust Calibration in Autonomous Driving. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13), 210--217.  ",
      "doi": "10.1145/2516540.2516554"
    },
    {
      "text": "Ting-Hao Kenneth Huang, Francis Ferraro, Nasrin Mostafazadeh, Ishan Misra, Aishwarya Agrawal, Jacob Devlin, Ross Girshick, Xiaodong He, Pushmeet Kohli, Dhruv Batra, and others. 2016. Visual Storytelling. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies.",
      "doi": ""
    },
    {
      "text": "Andrej Karpathy and Li Fei-Fei. 2015. Deep visual semantic alignments for generating image descriptions. In Computer Vision and Pattern Recognition (CVPR), 2015 IEEE Conference on, 3128--3137.",
      "doi": ""
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 272--283.  ",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Todd Kloots. 2016. Accessible images for everyone. Twitter Blogs. Retrieved August 12, 2016 from https://blog.twitter.com/2016/accessible-images-foreveryone",
      "doi": ""
    },
    {
      "text": "Theresa M. Marteau. 1989. Framing of information: Its influence upon decisions of doctors and patients. British Journal of Social Psychology 28, 1: 89--94.",
      "doi": ""
    },
    {
      "text": "Valerie S. Morash, Yue-Ting Siu, Joshua A. Miele, Lucia Hasty, and Steven Landau. 2015. Guiding Novice Web Workers in Making Image Descriptions Using Templates. ACM Transactions on Accessible Computing 7, 4: 1--21.  ",
      "doi": "10.1145/2764916"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With Most of It Being Pictures Now, I Rarely Use It\": Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5506--5516.  ",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Nasrin Mostafazadeh, Ishan Misra, Jacob Devlin, Larry Zitnick, Margaret Mitchell, Xiaodong He, and Lucy Vanderwende. 2016. Generating Natural Questions About an Image. Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics.",
      "doi": ""
    },
    {
      "text": "D. Prelec. 2004. A Bayesian Truth Serum for Subjective Data. Science 306, 5695: 462--466.",
      "doi": ""
    },
    {
      "text": "Krishnan Ramnath, Simon Baker, Lucy Vanderwende, Motaz El-Saban, Sudipta N. Sinha, Anitha Kannan, Noran Hassan, Michel Galley, Yi Yang, Deva Ramanan, Alessandro Bergamo, and Lorenzo Torresani. 2014. AutoCaption: Automatic caption generation for personal photos. In Applications of Computer Vision (WACV), 2014 IEEE Winter Conference on, 1050--1057.",
      "doi": ""
    },
    {
      "text": "Y. Shi. 2006. E-Government Web Site Accessibility in Australia and China: A Longitudinal Study. Social Science Computer Review 24, 3: 378--385.",
      "doi": ""
    },
    {
      "text": "Kenneth Tran, Xiaodong He, Lei Zhang, Jian Sun, Cornelia Carapcea, Chris Thrasher, Chris Buehler, and Chris Sienkiewicz. 2016. Rich Image Captioning in the Wild. Proceedings of CVPR 2016.",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1985. The Framing of Decisions and the Psychology of Choice. In Environmental Impact Assessment, Technology Assessment, and Risk Analysis: Contributions from the Psychological and Decision Sciences, Vincent T. Covello, Jeryl L. Mumpower, Pieter J. M. Stallen and V. R. R. Uppuluri (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 107--129. Retrieved from",
      "doi": ""
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '16), 1584--1595.  ",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "Michael Wagner and Philip Koopman. 2015. A Philosophy for Developing Trust in Self-driving Cars. In Road Vehicle Automation 2, Gereon Meyer and Sven Beiker (eds.). Springer International Publishing, Cham, 163--171. Retrieved from",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 143-- 146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Shaomei Wu and Lada A. Adamic. 2014. Visually Impaired Users on an Online Social Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3133--3142.  ",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Jill Schiller. 2017. Automatic Alt-text: Computer-generated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 20th ACM Conference on Computer Supported Cooperative Work and Social Computing.  ",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Kelvin Xu, Jimmy Ba, Ryan Kiros, Kyunghyun Cho, Aaron Courville, Ruslan Salakhudinov, Rich Zemel, and Yoshua Bengio. 2015. Show, Attend and Tell: Neural Image Caption Generation with Visual Attention. In Proceedings of The 32nd International Conference on Machine Learning, 2048--2057. ",
      "doi": "10.5555/3045118.3045336"
    },
    {
      "text": "Sean Young and Daniel M. Oppenheimer. 2009. Effect of communication strategy on personal risk perception and treatment adherence intentions. Psychology, Health & Medicine 14, 4: 430--442.",
      "doi": ""
    },
    {
      "text": "Microsoft Cognitive Services - Computer Vision API. Retrieved August 24, 2016 from https://www.microsoft.com/cognitive-services/enus/computer-vision-api",
      "doi": ""
    },
    {
      "text": "Microsoft Cognitive Services. Retrieved August 24, 2016 from https://www.microsoft.com/cognitive-services",
      "doi": ""
    },
    {
      "text": "CaptionBot - For pictures worth the thousand words. Retrieved August 24, 2016 from https://www.captionbot.ai/",
      "doi": ""
    }
  ]
}