{
  "doi": "10.1145/3025453.3025523",
  "title": "Modeling Cumulative Arm Fatigue in Mid-Air Interaction based on Perceived Exertion and Kinetics of Arm Motion",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3328-3339",
  "year": 2017,
  "badges": [],
  "abstract": "Quantifying cumulative arm muscle fatigue is a critical factor in understanding, evaluating, and optimizing user experience during prolonged mid-air interaction. A reasonably accurate estimation of fatigue requires an estimate of an individual's strength. However, there is no easy-to-access method to measure individual strength to accommodate inter-individual differences. Furthermore, fatigue is influenced by both psychological and physiological factors, but no current HCI model provides good estimates of cumulative subjective fatigue. We present a new, simple method to estimate the maximum shoulder torque through a mid-air pointing task, which agrees with direct strength measurements. We then introduce a cumulative fatigue model informed by subjective and biomechanical measures. We evaluate the performance of the model in estimating cumulative subjective fatigue in mid-air interaction by performing multiple cross-validations and a comparison with an existing fatigue metric. Finally, we discuss the potential of our approach for real-time evaluation of subjective fatigue as well as future challenges.",
  "authors": [
    {
      "name": "Sujin Jang",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/do/10.1145/contrib-89758686657/rel-imgonly/89758686657.jpeg",
      "acmid": "89758686657",
      "orcid": "missing"
    },
    {
      "name": "Wolfgang Stuerzlinger",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100214718",
      "orcid": "0000-0002-7110-5024"
    },
    {
      "name": "Satyajit Ambike",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161679",
      "orcid": "missing"
    },
    {
      "name": "Karthik Ramani",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502255",
      "orcid": "0000-0001-8639-5135"
    }
  ],
  "references": [
    {
      "text": "Biodex dynamometer. http://www.biodex.com/ physical-medicine/products/dynamometers.",
      "doi": ""
    },
    {
      "text": "Gorilla arm. http://www.computer-dictionary-online.org/?q=gorilla%20arm.",
      "doi": ""
    },
    {
      "text": "Amann, M., Romer, L. M., Pegelow, D. F., Jacques, A. J., Hess, C. J., and Dempsey, J. A. Effects of arterial oxygen content on peripheral locomotor muscle fatigue. Journal of Applied Physiology 101, 1 (2006), 119--127. ",
      "doi": ""
    },
    {
      "text": "Astrand, P.-O. Textbook of work physiology: physiological bases of exercise. Human Kinetics, 2003.",
      "doi": ""
    },
    {
      "text": "Audet, C., and Dennis Jr, J. E. Analysis of generalized pattern searches. SIAM Journal on Optimization 13, 3 (2002), 889--903.  ",
      "doi": "10.1137/S1052623400378742"
    },
    {
      "text": "Bachynskyi, M., Oulasvirta, A., Palmas, G., and Weinkauf, T. Is motion capture-based biomechanical simulation valid for hci studies?: study and implications. In Proceedings of the 32nd annual conference on Human factors in computing systems, ACM (2014), 3215--3224.  ",
      "doi": "10.1145/2556288.2557027"
    },
    {
      "text": "Bachynskyi, M., Palmas, G., Oulasvirta, A., Steimle, J., and Weinkauf, T. Performance and ergonomics of touch surfaces: A comparative study using biomechanical simulation. In Proceedings of the 33rd Annual Conference on Human Factors in Computing Systems, ACM (2015), 1817--1826.  ",
      "doi": "10.1145/2702123.2702607"
    },
    {
      "text": "Bachynskyi, M., Palmas, G., Oulasvirta, A., and Weinkauf, T. Informing the design of novel input methods with muscle coactivation clustering. ACM Trans. Comput.-Hum. Interact. 21, 6 (Jan. 2015), 30:1--30:25.",
      "doi": "10.1145/2687921"
    },
    {
      "text": "Bijur, P. E., Silver, W., and Gallagher, E. J. Reliability of the visual analog scale for measurement of acute pain. Academic emergency medicine 8, 12 (2001), 1153--1157. ",
      "doi": ""
    },
    {
      "text": "Borg, G. Psychophysical scaling with applications in physical work and the perception of exertion. Scandinavian journal of work, environment & health (1990), 55--58. ",
      "doi": ""
    },
    {
      "text": "Borg, G. Borg's perceived exertion and pain scales. Human kinetics, 1998.",
      "doi": ""
    },
    {
      "text": "Borg, G. A. Psychophysical bases of perceived exertion. Med sci sports exerc 14, 5 (1982), 377--381. ",
      "doi": ""
    },
    {
      "text": "Carifio, J., and Perla, R. J. Ten common misunderstandings, misconceptions, persistent myths and urban legends about likert scales and likert response formats and their antidotes. Journal of Social Sciences 3, 3 (2007), 106--116. ",
      "doi": ""
    },
    {
      "text": "Cifrek, M., Medved, V., Tonković, S., and Ostojić, S. Surface emg based muscle fatigue evaluation in biomechanics. Clinical Biomechanics 24, 4 (2009), 327--340. ",
      "doi": ""
    },
    {
      "text": "Craig, J. J. Introduction to robotics: mechanics and control, vol. 3. Pearson Prentice Hall Upper Saddle River, 2005.",
      "doi": "10.5555/534661"
    },
    {
      "text": "De Leva, P. Adjustments to zatsiorsky-seluyanov's segment inertia parameters. Journal of biomechanics 29, 9 (1996), 1223--1230. ",
      "doi": ""
    },
    {
      "text": "Dedering, A., Nemeth, G., and Harms-Ringdahl, K. Correlation between electromyographic spectral changes and subjective assessment of lumbar muscle fatigue in subjects without pain from the lower back. Clinical Biomechanics 14, 2 (1999), 103--111. ",
      "doi": ""
    },
    {
      "text": "Denavit, J., and Hartenberg, R. S. A kinematic notation for lower-pair mechanisms based on matrices. Trans. ASME, J. Appl. Mech. 22, 2 (1965), 215 -- 221.",
      "doi": ""
    },
    {
      "text": "Enoka, R. M., and Duchateau, J. Muscle fatigue: what, why and how it influences muscle function. The Journal of physiology 586, 1 (2008), 11--23. ",
      "doi": ""
    },
    {
      "text": "Enoka, R. M., and Stuart, D. G. Neurobiology of muscle fatigue. Journal of applied physiology 72, 5 (1992), 1631--1648.",
      "doi": ""
    },
    {
      "text": "Eston, R. Use of ratings of perceived exertion in sports. International journal of sports physiology and performance 7, 2 (2012), 175--182. ",
      "doi": ""
    },
    {
      "text": "Freivalds, A. Biomechanics of the upper limbs: mechanics, modeling and musculoskeletal injuries. CRC press, 2011.",
      "doi": ""
    },
    {
      "text": "Frey-Law, L. A., and Avin, K. G. Endurance time is joint-specific: a modelling and meta-analysis investigation. Ergonomics 53, 1 (2010), 109--129. ",
      "doi": ""
    },
    {
      "text": "Frey-Law, L. A., Looft, J. M., and Heitsman, J. A three-compartment muscle fatigue model accurately predicts joint-specific maximum endurance times for sustained isometric tasks. Journal of biomechanics 45, 10 (2012), 1803--1808. ",
      "doi": ""
    },
    {
      "text": "Haga, S., Shinoda, H., and Kokubun, M. Effects of task difficulty and time-on-task on mental workload. Japanese Psychological Research 44, 3 (2002), 134--143. ",
      "doi": ""
    },
    {
      "text": "Harrison, C., Ramamurthy, S., and Hudson, S. E. On-body interaction: armed and dangerous. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction, ACM (2012), 69--76.  ",
      "doi": "10.1145/2148131.2148148"
    },
    {
      "text": "Hart, S. G., and Staveland, L. E. Development of nasa-tlx (task load index): Results of empirical and theoretical research. Advances in psychology 52 (1988), 139--183. ",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., and Tractinsky, N. User experience-a research agenda. Behaviour & information technology 25, 2 (2006), 91--97. ",
      "doi": ""
    },
    {
      "text": "Hayes, K., Walton, J. R., Szomor, Z. L., and Murrell, G. A. Reliability of 3 methods for assessing shoulder strength. Journal of Shoulder and Elbow surgery 11, 1 (2002), 33--39. ",
      "doi": ""
    },
    {
      "text": "Hincapié-Ramos, J. D., Guo, X., Moghadasian, P., and Irani, P. Consumed endurance: A metric to quantify arm fatigue of mid-air interactions. In Proceedings of the 32nd annual conference on Human factors in computing systems, ACM (2014), 1063--1072.  ",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Hofmann, M., Brger, R., Frost, N., Karremann, J., Keller-Bacher, J., Kraft, S., Bruder, G., and Steinicke, F. Comparing 3d interaction performance in comfortable and uncomfortable regions. In Proceedings of the GI-Workshop VR/AR (2013), 3--14.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K., and Law, E. L.-C. Meta-analysis of correlations among usability measures. In Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2007), 617--626.  ",
      "doi": "10.1145/1240624.1240722"
    },
    {
      "text": "Höysniemi, J., Hämäläinen, P., and Turkki, L. Wizard of oz prototyping of computer vision based action games for children. In Proceedings of the 2004 conference on Interaction design and children: building a community, ACM (2004), 27--34.  ",
      "doi": "10.1145/1017833.1017837"
    },
    {
      "text": "Hunter, S. K., Duchateau, J., and Enoka, R. M. Muscle fatigue and the mechanisms of task failure. Exercise and sport sciences reviews 32, 2 (2004), 44--49. ",
      "doi": ""
    },
    {
      "text": "ISO, I. 9241--9 ergonomic requirements for office work with visual display terminals (vdts)-part 9: Requirements for non-keyboard input devices (fdis-final draft international standard), 2000. International Organization for Standardization.",
      "doi": ""
    },
    {
      "text": "Jacob, M. G., and Wachs, J. P. Context-based hand gesture recognition for the operating room. Pattern Recognition Letters 36 (2014), 196--203.  ",
      "doi": "10.1016/j.patrec.2013.05.024"
    },
    {
      "text": "Kaiser, E., Olwal, A., McGee, D., Benko, H., Corradini, A., Li, X., Cohen, P., and Feiner, S. Mutual disambiguation of 3d multimodal interaction in augmented and virtual reality. In Proceedings of the 5th international conference on Multimodal interfaces, ACM (2003), 12--19.  ",
      "doi": "10.1145/958432.958438"
    },
    {
      "text": "Liu, J. Z., Brown, R. W., and Yue, G. H. A dynamical model of muscle activation, fatigue, and recovery. Biophysical journal 82, 5 (2002), 2344--2359. ",
      "doi": ""
    },
    {
      "text": "Lloyd, A., Gandevia, S., and Hales, J. Muscle performance, voluntary activation, twitch properties and perceived effort in normal subjects and patients with the chronic fatigue syndrome. Brain 114, 1 (1991), 85--98.",
      "doi": ""
    },
    {
      "text": "Malik, S., McDonald, C., and Roth, G. Hand tracking for interactive pattern-based augmented reality. In Proceedings of the 1st International Symposium on Mixed and Augmented Reality, IEEE (2002), 117--126. ",
      "doi": ""
    },
    {
      "text": "Mathiassen, S. E., and Ahsberg, E. Prediction of shoulder flexion endurance from personal factors. International Journal of Industrial Ergonomics 24, 3 (1999), 315--329. ",
      "doi": ""
    },
    {
      "text": "Morishita, S., Yamauchi, S., Fujisawa, C., and Domen, K. Rating of perceived exertion for quantification of the intensity of resistance exercise. International Journal of Physical Medicine & Rehabilitation 2013 (2014).",
      "doi": ""
    },
    {
      "text": "Noble, B. J. Clinical applications of perceived exertion. Medicine and science in sports and exercise 14, 5 (1981), 406--411.",
      "doi": ""
    },
    {
      "text": "Öberg, T., Sandjö, L., and Kadefors, R. Subjective and objective evaluation of shoulder muscle fatigue. Ergonomics 37, 8 (1994), 1323--1333. ",
      "doi": ""
    },
    {
      "text": "Raikova, R. A general approach for modelling and mathematical investigation of the human upper limb. Journal of biomechanics 25, 8 (1992), 857--867. ",
      "doi": ""
    },
    {
      "text": "Rohmert, W. Ermittlung von erholungspausen für statische arbeit des menschen. European Journal of Applied Physiology and Occupational Physiology 18, 2 (1960), 123--164. ",
      "doi": ""
    },
    {
      "text": "Roy, J.-S., Ma, B., MacDermid, J. C., and Woodhouse, L. J. Shoulder muscle endurance: the development of a standardized and reliable protocol. BMC Sports Science, Medicine and Rehabilitation 3, 1 (2011), 1.",
      "doi": ""
    },
    {
      "text": "Segerstrom, S. C., and Nes, L. S. Heart rate variability reflects self-regulatory strength, effort, and fatigue. Psychological science 18, 3 (2007), 275--281. ",
      "doi": ""
    },
    {
      "text": "Sjøgaard, G., Savard, G., and Juel, C. Muscle blood flow during isometric activity and its relation to muscle fatigue. European journal of applied physiology and occupational physiology 57, 3 (1988), 327--335. ",
      "doi": ""
    },
    {
      "text": "Sonne, M. W., and Potvin, J. R. A modified version of the three-compartment model to predict fatigue during submaximal tasks with complex force-time histories. Ergonomics 59, 1 (2016), 85--98. ",
      "doi": ""
    },
    {
      "text": "Spielholz, P. Calibrating borg scale ratings of hand force exertion. Applied Ergonomics 37, 5 (2006), 615--618. ",
      "doi": ""
    },
    {
      "text": "Teather, R., and Stuerzlinger, W. Pointing at 3D targets in a stereo head-tracked virtual environment. In Proceedings of the Symposium on 3D User Interfaces, IEEE (2011), 87--94.",
      "doi": ""
    },
    {
      "text": "Troiano, A., Naddeo, F., Sosso, E., Camarota, G., Merletti, R., and Mesin, L. Assessment of force and fatigue in isometric contractions of the upper trapezius muscle by surface emg signal and perceived exertion scale. Gait & posture 28, 2 (2008), 179--186. ",
      "doi": ""
    },
    {
      "text": "Vinayak, Murugappan, S., Liu, H., Ramani, K., et al. Shape-it-up: Hand gesture based creative expression of 3d shapes using intelligent generalized cylinders. Computer-Aided Design 45, 2 (2013), 277--287.",
      "doi": "10.1016/j.cad.2012.10.011"
    },
    {
      "text": "Westerblad, H., Allen, D. G., and Lännergren, J. Muscle fatigue: lactic acid or inorganic phosphate the major cause? Physiology 17, 1 (2002), 17--21.",
      "doi": ""
    },
    {
      "text": "Xia, T., and Law, L. A. F. A theoretical approach for modeling peripheral muscle fatigue and recovery. Journal of biomechanics 41, 14 (2008), 3046--3052. ",
      "doi": ""
    },
    {
      "text": "Zhao, W., Feng, H., Lun, R., Espy, D. D., and Reinthal, M. A. A kinect-based rehabilitation exercise monitoring and guidance system. In Software Engineering and Service Science (ICSESS), 2014 5th IEEE International Conference on, IEEE (2014), 762--765. ",
      "doi": ""
    }
  ]
}