{
  "doi": "10.1145/3025453.3025685",
  "title": "Interactive Visual Calibration of Volumetric Head-Tracked 3D Displays",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3943-3953",
  "year": 2017,
  "badges": [],
  "abstract": "Head-tracked 3D displays can provide a compelling 3D effect, but even small inaccuracies in the calibration of the participant's viewpoint to the display can disrupt the 3D illusion. We propose a novel interactive procedure for a participant to easily and accurately calibrate a head-tracked display by visually aligning patterns across a multi-screen display. Head-tracker measurements are then calibrated to these known viewpoints. We conducted a user study to evaluate the effectiveness of different visual patterns and different display shapes. We found that the easiest to align shape was the spherical display and the best calibration pattern was the combination of circles and lines. We performed a quantitative camera-based calibration of a cubic display and found visual calibration outperformed manual tuning and generated viewpoint calibrations accurate to within a degree. Our work removes the usual, burdensome step of manual calibration when using head-tracked displays and paves the way for wider adoption of this inexpensive and effective 3D display technology.",
  "tags": [
    "visual perception",
    "head tracking",
    "fish tank virtual reality",
    "calibration"
  ],
  "authors": [
    {
      "name": "Andrew John Wagemakers",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161736",
      "orcid": "missing"
    },
    {
      "name": "Dylan Brodie Fafard",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161486",
      "orcid": "missing"
    },
    {
      "name": "Ian Stavness",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-81319501712/rel-imgonly/ianstavness.jpg",
      "acmid": "81319501712",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kevin W. Arthur, Kellogg S. Booth, and Colin Ware. 1993. Evaluating 3d task performance for fish tank virtual worlds. ACM Transactions on Information Systems (TOIS) 11, 3 (1993), 239--265.  ",
      "doi": "10.1145/159161.155359"
    },
    {
      "text": "K. Somani Arun, Thomas S. Huang, and Steven D. Blostein. Least-squares fitting of two 3-D point sets. IEEE Transactions on pattern analysis and machine intelligence 5 (1987), 698--700.  ",
      "doi": "10.1109/TPAMI.1987.4767965"
    },
    {
      "text": "Ronald Azuma and Gary Bishop. 1994. Improving static and dynamic registration in an optical seethrough HMD. In Proceedings of the 21st annual conference on Computer graphics and interactive techniques. ACM, 197--204.",
      "doi": "10.1145/192161.192199"
    },
    {
      "text": "Michael Bajura and Ulrich Neumann. 1995. Dynamic Registration Correction in Video-Based Augmented Reality Systems. IEEE Computer Graphics and Applications 15, 5 (1995), 52--60.  ",
      "doi": "10.1109/38.403828"
    },
    {
      "text": "John Bolton, Kibum Kim, and Roel Vertegaal. 2011. SnowGlobe: a spherical fish-tank VR display. In CHI '11 Extended Abstracts on Human Factors in Computing Systems. ACM, 1159--1164.  ",
      "doi": "10.1145/1979742.1979719"
    },
    {
      "text": "Christoph W. Borst. 2004. Tracker calibration using tetrahedral mesh and tricubic spline models of warp. In Virtual Reality, 2004. Proceedings. IEEE. IEEE, 1926. ",
      "doi": ""
    },
    {
      "text": "Luca Cosmo, Andrea Albarelli, Filippo Bergamasco, and Andrea Torsello. 2014. Design and Evaluation of a Viewer-Dependent Stereoscopic Display. In ICPR. 2861--2866.  ",
      "doi": "10.1109/ICPR.2014.493"
    },
    {
      "text": "Carolina Cruz-Neira, Daniel J. Sandin, and Thomas A. DeFanti. 1993. Surround-screen projection-based virtual reality: the design and implementation of the CAVE. In Proceedings of the 20th annual conference on Computer graphics and interactive techniques. ACM, 135--142.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Marek Czernuszenko, Daniel Sandin, Thomas DeFanti. 1998. Line of sight method for tracker calibration in projection-based VR systems. In Proceedings of 2nd international immersive projection technology workshop. Citeseer, 11--12.",
      "doi": ""
    },
    {
      "text": "Tom J. P. Djajadiningrat, Gerda J. F. Smets, and Kees C. J. Overbeeke. 1997. Cubby: a multiscreen movement parallax display for direct manual manipulation. Displays 17, 3 (1997), 191--197. ",
      "doi": ""
    },
    {
      "text": "Fernando Ferreira, Marcio Cabral, Olavo Belloc, Gregor Miller, Celso Kurashima, Roseli de Deus Lopes, Ian Stavness, Junia Anacleto, Marcelo Zuffo, and Sydney Fels. 2014. Spheree: a 3D perspectivecorrected interactive spherical scalable display. In ACM SIGGRAPH 2014 Posters. ACM, 86.",
      "doi": "10.1145/2614217.2630585"
    },
    {
      "text": "Anton Fuhrmann, Dieter Schmalstieg, and Werner Purgathofer. 1999. Fast calibration for augmented reality. In Proceedings of the ACM symposium on Virtual reality software and technology. ACM, 166--167.  ",
      "doi": "10.1145/323663.323692"
    },
    {
      "text": "S. Garrido-Jurado, Rafael Muñoz-Salinas, Francisco José Madrid-Cuevas, and Manuel Jesús Marín-Jiménez. 2014. Automatic generation and detection of highly reliable fiducial markers under occlusion. Pattern Recognition, 47, 6 (2014), 2280--2292.  ",
      "doi": "10.1016/j.patcog.2014.01.005"
    },
    {
      "text": "John G. Hagedorn, Steven G. Satterfield, John T. Kelso, Whitney Austin, Judith E. Terrill, and Adele P. Peskin. 2007. Correction of location and orientation errors in electromagnetic motion tracking. Presence: Teleoperators and Virtual Environments 16,4 (2007): 352--366.  ",
      "doi": "10.1162/pres.16.4.352"
    },
    {
      "text": "Otmar Hilliges, David Kim, Shahram Izadi, Malte Weiss, and Andrew Wilson. 2012. HoloDesk: direct 3d interactions with a situated see-through display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2421--2430.  ",
      "doi": "10.1145/2207676.2208405"
    },
    {
      "text": "Richard L. Holloway. 1997. Registration error analysis for augmented reality. Presence: Teleoperators and Virtual Environments 6,4 (1997), 413--432.  ",
      "doi": "10.1162/pres.1997.6.4.413"
    },
    {
      "text": "Masahiko Inami. 1997. Media3: the virtual hologram. In ACM SIGGRAPH 97 Visual Proceedings: The art and interdisciplinary programs of SIGGRAPH '97. ACM, 107.  ",
      "doi": "10.1145/259081.270083"
    },
    {
      "text": "Hirokazu Kato and Mark Billinghurst. 1999. Marker tracking and hmd calibration for a video-based augmented reality conferencing system. In Augmented Reality, 1999.(IWAR'99) Proceedings. 2nd IEEE and ACM International Workshop on. IEEE, 1999. ",
      "doi": ""
    },
    {
      "text": "Kibum Kim, John Bolton, Audrey Girouard, Jeremy Cooperstock, and Roel Vertegaal. 2012. TeleHuman: effects of 3d perspective on gaze and pose estimation with a life-size cylindrical telepresence pod. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2531--2540.  ",
      "doi": "10.1145/2207676.2208640"
    },
    {
      "text": "Volodymyr V. Kindratenko. 2000. A survey of electromagnetic position tracker calibration techniques. Virtual Reality 5, 3 (2000), 169--182. ",
      "doi": "10.1007/BF01409422"
    },
    {
      "text": "Arun Kulshreshth and Joseph J. LaViola, Jr. 2013. Evaluating performance benefits of head tracking in modern video games. In Proceedings of the 1st symposium on Spatial user interaction. ACM, 53--60.  ",
      "doi": "10.1145/2491367.2491376"
    },
    {
      "text": "Arun Kulshreshth and Joseph J. LaViola, Jr. 2016. Dynamic Stereoscopic 3D Parameter Adjustment for Enhanced Depth Discrimination. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 177--187.  ",
      "doi": "10.1145/2858036.2858078"
    },
    {
      "text": "Franz Madritsch, Franz Leberl, and Michael Gervautz. 1996. Camera based beacon tracking: accuracy and applications. In VRST, Vol. 96. 101--108.",
      "doi": "10.1145/3304181.3304202"
    },
    {
      "text": "Kenneth Moser, Yuta Itoh, Kohei Oshima, J. Edward Swan, Gudrn Klinker, and Christian Sandor. 2015. Subjective evaluation of a semi-automatic optical seethrough head-mounted display calibration technique. IEEE transactions on visualization and computer graphics 21, 4 (2015), 491--500. ",
      "doi": "10.1109/TVCG.2015.2391856"
    },
    {
      "text": "Kazuhisa Nakada, Masahiko Nakamoto, Yoshinobu Sato, Kozo Konishi, Makoto Hashizume, and Shinishi Tamura. 2003. A rapid method for magnetic tracker calibration using a magneto-optic hybrid tracker. In International Conference on Medical Image Computing and Computer-Assisted Intervention. Springer, 285--293. ",
      "doi": ""
    },
    {
      "text": "Alexander Plopski, Yuta Itoh, Christian Nitschke, Kiyoshi Kiyokawa, Gudrun Klinker, and Haru Takemura. Corneal-imaging calibration for optical see-through head-mounted displays. IEEE transactions on visualization and computer graphics 21, 4 (2015), 481490.",
      "doi": "10.1109/TVCG.2015.2391857"
    },
    {
      "text": "Behzad Sajadi, and Aditi Majumder. 2011. Automatic Registration of Multi-Projector Domes Using a Single Uncalibrated Camera. In Computer Graphics Forum, Vol. 30. Wiley Online Library, 1161--1170.  ",
      "doi": "10.1111/j.1467-8659.2011.01965.x"
    },
    {
      "text": "Ian Stavness, Billy Lam, and Sidney Fels. 2010. pCubee: a perspective-corrected handheld cubic display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1381--1390.  ",
      "doi": "10.1145/1753326.1753535"
    },
    {
      "text": "Yichen Tang, Billy Lam, Ian Stavness, and Sidney Fels. 2011. Kinect-based augmented reality projection with perspective correction. In ACM SIGGRAPH 2011 Posters. ACM, 79.  ",
      "doi": "10.1145/2037715.2037804"
    },
    {
      "text": "Robert J. Teather and Wolfgang Stuerzlinger. 2013. Pointing at 3d target projections with one-eyed and stereo cursors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 159--168.  ",
      "doi": "10.1145/2470654.2470677"
    },
    {
      "text": "Mihran Tuceryan and Nassir Navab. 2000. Single point active alignment method (SPAAM) for optical see-through HMD calibration for AR. In Augmented Reality, 2000.(ISAR 2000). Proceedings. IEEE and ACM International Symposium on. IEEE, 149--158.",
      "doi": ""
    },
    {
      "text": "Andrejs Vorozcovs, Wolfgang Stürzlinger, Andrew Hogue, and Robert S. Allison. 2006. The hedgehog: a novel optical tracking method for spatially immersive displays. Presence 15, 1 (2016), 108--121.  ",
      "doi": "10.1162/pres.2006.15.1.108"
    },
    {
      "text": "Colin Ware, Kevin Arthur, and Kellogg S. Booth. 1993. Fish tank virtual reality. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems. ACM, 37--42.  ",
      "doi": "10.1145/169059.169066"
    },
    {
      "text": "Joshua T. Weinhandl, Brian S. R. Armstring, Todd P. Kusik, Robb T. Barows, and Kristian M. O'Connor. 2010. Validation of a single camera three-dimensional motion tracking system. Journal of biomechanics 43, 7 (2010), 1437--1440. ",
      "doi": ""
    },
    {
      "text": "Björn Wöldecke, Dionysios Marinos, and Christian Geiger. 2014. Flexible Registration of Multiple Displays. In Proceedings of The International Symposium on Pervasive Displays. ACM, 86.  ",
      "doi": "10.1145/2611009.2611030"
    },
    {
      "text": "Qian Zhou, Gregor Miller, Kai Wu, Ian Stavness, and Sidney Fels. 2016. Analysis and Practical Minimization of Registration Error in a Spherical Fish Tank Virtual Reality System. In Proceedings of the Asian Conference on Computer Vision (ACCV), to appear.",
      "doi": ""
    },
    {
      "text": "Qian Zhou, Gregor Miller, Kai Wu, Daniela Correa, and Sidney Fels. 2017. Automatic Calibration of a Multiple-Projector Spherical Fish Tank VR Display. In Proceedings of the IEEE Winter Conference on Applications of Computer Vision (WAVC), to appear.",
      "doi": ""
    }
  ]
}