{
  "doi": "10.1145/3025453.3025575",
  "title": "Foreign-language Reviews: Help or Hindrance?",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "4430-4442",
  "year": 2017,
  "badges": [],
  "abstract": "The number and quality of user reviews greatly affects consumer purchasing decisions. While reviews in all languages are increasing, it is still often the case (especially for non-English speakers) that there are only a few reviews in a person's first language. Using an online experiment, we examine the value that potential purchasers receive from interfaces showing additional reviews in a second language. The results paint a complicated picture with both positive and negative reactions to the inclusion of foreign-language reviews. Roughly 26-28% of subjects clicked to see translations of the foreign-language content when given the opportunity, and those who did so were more likely to select the product with foreign-language reviews than those who did not.",
  "tags": [
    "user-generated content",
    "internationalization and localization",
    "bilingualism",
    "multilingualism",
    "e-commerce",
    "product reviews",
    "experiment"
  ],
  "authors": [
    {
      "name": "Scott A. Hale",
      "institution": "University of Oxford & The Alan Turing Institute, Oxford, Oxon, United Kingdom",
      "img": "/do/10.1145/contrib-81502689334/rel-imgonly/me.jpg",
      "acmid": "81502689334",
      "orcid": "missing"
    },
    {
      "name": "Irene Eleta",
      "institution": "ISGlobal Barcelona Institute for Global Health, (CIBERESP) & Universitat Pompeu Fabra, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81498658724/rel-imgonly/irene-1.jpg",
      "acmid": "81498658724",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Khalid I. AlSulaiti and Michael J. Baker. 1998. Country of origin effects: A literature review. Marketing Intelligence & Planning 16, 3 (1998), 150--199.",
      "doi": ""
    },
    {
      "text": "Winfred Arthur and Winston Bennett. 1995. The International Assignee: The Relative Importance Of Factors Perceived To Contribute To Success. Personnel Psychology 48, 1 (1995), 99--114.",
      "doi": ""
    },
    {
      "text": "Adam J. Berinsky, Gregory A. Huber, and Gabriel S. Lenz. 2012. Evaluating Online Labor Markets for Experimental Research: Amazon.com's Mechanical Turk. Political Analysis 20, 3 (2012), 351--368.",
      "doi": ""
    },
    {
      "text": "Stanley Budner. 1962. Intolerance of ambiguity as a personality variable. Journal of Personality 30, 1 (1962), 29--50.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet High-Quality, Data? Perspectives on Psychological Science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Paula M. Caligiuri. 2000a. The Big Five Personality Characteristics As Predictors Of Expatriate's Desire To Terminate The Assignment And Supervisor-Rated Performance. Personnel Psychology 53, 1 (2000), 67--88.",
      "doi": ""
    },
    {
      "text": "Paula M. Caligiuri. 2000b. Selecting Expatriates for Personality Characteristics: A Moderating Effect of Personality on the Relationship Between Host National Contact and Cross-cultural Adjustment. MIR: Management International Review 40, 1 (2000), 61--80. http://www.jstor.org/stable/40835867",
      "doi": ""
    },
    {
      "text": "Paula M Caligiuri, Rick R Jacobs, and James L Farr. 2000. The Attitudinal and Behavioral Openness Scale: Scale development and construct validation. International Journal of Intercultural Relations 24, 1 (2000), 27--46.",
      "doi": ""
    },
    {
      "text": "Eurobarometer. 2011. User language preferences online: Analytical report. Technical Report. Survey conducted by The Gallup Organization, Hungary upon the request of Directorate-General Information Society and Media, European Commission.",
      "doi": ""
    },
    {
      "text": "M. Freyd. 1923. The Graphic Rating Scale. Journal of Educational Psychology 14, 2 (1923), 83--102.",
      "doi": ""
    },
    {
      "text": "Joseph K. Goodman, Cynthia E. Cryder, and Amar Cheema. 2013. Data Collection in a Flat World: The Strengths and Weaknesses of Mechanical Turk Samples. Journal of Behavioral Decision Making 26, 3 (2013), 213--224.",
      "doi": ""
    },
    {
      "text": "Samuel D Gosling, Peter J Rentfrow, and William B Swann Jr. 2003. A very brief measure of the Big-Five personality domains. Journal of Research in Personality 37, 6 (2003), 504--528.",
      "doi": ""
    },
    {
      "text": "Mark Graham, Scott A. Hale, and Monica Stephens. 2012. Featured graphic: Digital Divide: The Geography of Internet Access. Environment and Planning A 44, 5 (2012), 1009--1010. http: //www.envplan.com/epa/fulltext/a44/a44497.pdf",
      "doi": ""
    },
    {
      "text": "François Grosjean. 2010. Bilingual: Life and Reality. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Scott A. Hale. 2014a. Global Connectivity and Multilinguals in the Twitter Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, NY, 833--842.  ",
      "doi": "10.1145/2556288.2557203"
    },
    {
      "text": "Scott A. Hale. 2014b. Multilinguals and Wikipedia Editing. In Proceedings of the 6th Annual ACM Web Science Conference (WebSci'14). ACM, NY. http://www.scotthale.net/pubs/?websci2014  ",
      "doi": "10.1145/2615569.2615684"
    },
    {
      "text": "Scott A. Hale. 2016. User Reviews and Language: How Language Influences Ratings. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, NY, NY, USA, 1208--1214.  ",
      "doi": "10.1145/2851581.2892466"
    },
    {
      "text": "M. H. Hayes and D. G. Patterson. 1921. Experimental development of the graphic rating method. Psychological Bulletin 18 (1921), 98--99.",
      "doi": ""
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2010. The Tower of Babel meets Web 2.0: User-generated content and its applications in a multilingual context. In Proceedings of the 28th International Conference on Human Factors in Computing Systems (CHI '10). ACM, NY, NY, USA, 291--300.  ",
      "doi": "10.1145/1753326.1753370"
    },
    {
      "text": "Nan Hu, Ling Liu, and Jie Jennifer Zhang. 2008. Do online reviews affect product sales? The role of reviewer characteristics and temporal effects. Information Technology and Management 9, 3 (2008), 201--214.  ",
      "doi": "10.1007/s10799-008-0041-2"
    },
    {
      "text": "Oliver P John and Sanjay Srivastava. 1999. The Big Five trait taxonomy: History, measurement, and theoretical perspectives. In Handbook of Personality: Theory and Research (2nd ed.), Lawrence A. Pervin and Oliver P. John (Eds.). Number 1999. Guilford Press, 102--138.",
      "doi": ""
    },
    {
      "text": "C. R. B. Joyce, D. W. Zutshi, V. Hrubes, and R. M. Mason. 1975. Comparison of fixed interval and visual analogue scales for rating chronic pain. European Journal of Clinical Pharmacology 8, 6 (1975), 415--420.",
      "doi": ""
    },
    {
      "text": "Jill Gabrielle Klein. 2002. Us versus Them, or Us versus Everyone? Delineating Consumer Aversion to Foreign Goods. Journal of International Business Studies 33, 2 (2002), 345--363. http://www.jstor.org/stable/3069548",
      "doi": ""
    },
    {
      "text": "Lisa R. Klein. 1998. Evaluating the Potential of Interactive Media through a New Lens: Search versus Experience Goods. Journal of Business Research 41, 3 (1998), 195--203.",
      "doi": ""
    },
    {
      "text": "Nikolaos Korfiatis, Elena Garcá-Bariocanal, and Salvador Sánchez-Alonso. 2012. Evaluating content quality and helpfulness of online product reviews: The interplay of review helpfulness vs. review content. Electronic Commerce Research and Applications 11, 3 (2012), 205--217.  ",
      "doi": "10.1016/j.elerap.2011.10.003"
    },
    {
      "text": "France Leclerc, Bernd H. Schmitt, and Laurette Dubé. 1994. Foreign Branding and Its Effects on Product Perceptions and Attitudes. Journal of Marketing Research 31, 2 (1994), 263--270. http://www.jstor.org/stable/3152198",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1 (2012), 1--23.",
      "doi": ""
    },
    {
      "text": "Heather M. McCormack, David J. de L. Horne, and Simon Sheather. 2009. Clinical applications of visual analogue scales: A critical review. Psychological Medicine 18, 4 (2009), 1007--1019.",
      "doi": ""
    },
    {
      "text": "Phillip Nelson. 1970. Information and Consumer Behavior. Journal of Political Economy 78, 2 (1970), 311--329. http://www.jstor.org/stable/1830691",
      "doi": ""
    },
    {
      "text": "Do-Hyung Park, Jumin Lee, and Ingoo Han. 2007. The Effect of On-Line Consumer Reviews on Consumer Purchasing Intention: The Moderating Role of Involvement. International Journal of Electronic Commerce 11, 4 (2007), 125--148. 2009. Twelve years of measuring linguistic diversity in the Internet: Balance and perspectives. (2009)  ",
      "doi": "10.5555/1481722.1481728"
    },
    {
      "text": "Daniel Pimienta, Daniel Prado, and Alvaro Blanco. http://unesdoc.unesco.org/ulis/cgi-bin/ulis.pl?catno=187016",
      "doi": ""
    },
    {
      "text": "Ulf-Dietrich Reips. 2000. The Web Experiment Method: Advantages, Disadvantages, and Solutions. In Psychology Experiments on the Internet, M. H. Birnbaum (Ed.). Academic Press, San Diego, CA.",
      "doi": ""
    },
    {
      "text": "Ulf-Dietrich Reips and Frederik Funke. 2008. Interval-level measurement with visual analogue scales in Internet-based research: VAS Generator. Behavior Research Methods 40, 3 (2008), 699--704.",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who Are the Crowdworkers?: Shifting Demographics in Mechanical Turk. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, NY, NY, USA, 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "S.W. Sen, H. Ford, D.R. Musicant, M. Graham, Oliver S.B. Keyes, and Brent Hecht. 2015a. Barriers to the Localness of Volunteered Geographic Information. In Proceedings of the 29th International Conference on Human Factors in Computing Systems (CHI 2015).  ",
      "doi": "10.1145/2702123.2702170"
    },
    {
      "text": "Shilad Sen, Margaret E. Giesel, Rebecca Gold, Benjamin Hillmann, Matt Lesicko, Samuel Naden, Jesse Russell, Zixiao (Ken) Wang, and Brent Hecht. 2015b. Turkers, Scholars, \"Arafat\" and \"Peace\": Cultural Communities and Algorithmic Gold Standards. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, NY, NY, USA, 826--838.  ",
      "doi": "10.1145/2675133.2675285"
    },
    {
      "text": "Ben Steichen, M.Rami Ghorab, Alexander O'Connor, Séamus Lawless, and Vincent Wade. 2014. Towards Personalized Multilingual Information Access Exploring the Browsing and Search Behavior of Multilingual Users. In User Modeling, Adaptation, and Personalization, Vania Dimitrova, Tsvi Kuflik, David Chin, Francesco Ricci, Peter Dolog, and Geert-Jan Houben (Eds.). Lecture Notes in Computer Science, Vol. 8538. Springer International Publishing, 435--446.",
      "doi": ""
    },
    {
      "text": "Qiang Ye, Rob Law, and Bin Gu. 2009. The impact of online user reviews on hotel room sales. International Journal of Hospitality Management 28, 1 (2009), 180--182.",
      "doi": ""
    }
  ]
}