{
  "doi": "10.1145/3025453.3025980",
  "title": "EdiPulse: Investigating a Playful Approach to Self-monitoring through 3D Printed Chocolate Treats",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "6593-6607",
  "year": 2017,
  "badges": [],
  "abstract": "Self-monitoring offers benefits in facilitating awareness about physical exercise, but such data-centric activity may not always lead to an enjoyable experience. We introduce EdiPulse a novel system that creates activity treats to offer playful reflections on everyday physical activity through the appealing medium of chocolate. EdiPulse translates self-monitored data from physical activity into small 3D printed chocolate treats. These treats (< 20 grams of chocolate in total) embody four forms: Graph, Flower, Slogan and Emoji. We deployed our system across 7 households and studied its use with 13 participants for 2 weeks per household. The field study revealed positive aspects of our approach along with some open challenges, which we disseminate across five themes: Reflection, Positivity, Determination, Affection, and Co-experience. We conclude by highlighting key implications of our work for future playful food-based technology design in supporting the experience of being physically active",
  "tags": [
    "chocolate printing",
    "self-monitoring",
    "playful interactions",
    "quantified self",
    "physical activity",
    "human food interaction",
    "food printing"
  ],
  "authors": [
    {
      "name": "Rohit Ashok Khot",
      "institution": "Royal Melbourne Institute of Techonology, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453659882",
      "orcid": "missing"
    },
    {
      "name": "Deepti Aggarwal",
      "institution": "University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501672387",
      "orcid": "missing"
    },
    {
      "name": "Ryan Pennings",
      "institution": "Royal Melbourne Institute of Techonology University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658708124",
      "orcid": "missing"
    },
    {
      "name": "Larissa Hjorth",
      "institution": "Royal Melbourne Institute of Techonology University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418594660",
      "orcid": "missing"
    },
    {
      "name": "Florian 'Floyd' Mueller",
      "institution": "Royal Melbourne Institute of Techonology University, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    }
  ],
  "references": [
    {
      "text": "Ala'A. Alkerwi, Nicolas Sauvageot, Georgina E. Crichton, Merrill F. Elias, and Saverio Stranges. 2016. Daily chocolate consumption is inversely associated with insulin resistance and liver enzymes in the Observation of Cardiovascular Risk Factors in Luxembourg study. British Journal of Nutrition 115, no. 09 (2016): 1661--1668.",
      "doi": ""
    },
    {
      "text": "Judith E. Allgrove, Emily Farrell, Michael Gleeson, Gary Williamson, and Karen Cooper. 2011. Regular dark chocolate consumption's reduction of oxidative stress and increase of free-fatty-acid mobilization in response to prolonged cycling. International journal of sport nutrition and exercise metabolism 21, no. 2: 113.",
      "doi": ""
    },
    {
      "text": "American College of Sports Medicine. 2013. ACSM's guidelines for exercise testing and prescription. Lippincott Williams & Wilkins.",
      "doi": ""
    },
    {
      "text": "Swamy Ananthanarayan, Katie Siek, and Michael Eisenberg. 2016. A Craft Approach to Health Awareness in Children. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, 724--735.  ",
      "doi": "10.1145/2901790.2901888"
    },
    {
      "text": "Stephanie Ashford, Jemma Edmunds, and David P. French 2010. What is the best way to change selfefficacy to promote lifestyle and recreational physical activity? A systematic review with metaanalysis. British journal of health psychology, 15(2), 265--288.",
      "doi": ""
    },
    {
      "text": "Stephen Barrass and Gregory Kramer 1999. Using sonification. Multimedia systems 7, no. 1, 23--31.  ",
      "doi": "10.1007/s005300050108"
    },
    {
      "text": "Eric P.S. Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 585--594.  ",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Trans. Comput.-Hum. Interact. 20, 5, 30, 27 pages.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Shlomo Berkovsky, Jill Freyne, and Mac Coombe. 2012. Physical Activity Motivating Games: Be Active and Get Your Own Reward. ACM Trans. Comput.Hum. Interact. 19, 4, Article 32 (2012), 41 pages.  ",
      "doi": "10.1145/2395131.2395139"
    },
    {
      "text": "Iain R. Black and Charles S. Areni 2016. Anticipatory Savoring and Consumption: Just Thinking about That First Bite of Chocolate Fills You Up Faster. Psychology & Marketing 33, no. 7 (2016): 516--524.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology, 3(2), pp.77--101.",
      "doi": ""
    },
    {
      "text": "Jean Anthelme Brillat-Savarin. Physiologie du Goût {The Philosopher in the Kitchen / The Physiology of Taste}; 1835. Translated by A. Lalauze: A Handbook of Gastronomy. London: Nimmo & Bain; 1884.",
      "doi": ""
    },
    {
      "text": "Fred B. Bryant and Joseph Veroff 2007. Savoring: A new model of positive experience. Lawrence Erlbaum Associates Publishers.",
      "doi": ""
    },
    {
      "text": "Bocusini http://www.bocusini.com/",
      "doi": ""
    },
    {
      "text": "Michel Cabanac. 2009. The dialectics of pleasure. In Kringelbach & Berridge (eds.), Pleasures of the brain (pp. 113--124). Oxford University Press.",
      "doi": ""
    },
    {
      "text": "ChocEdge. http://chocedge.com/",
      "doi": ""
    },
    {
      "text": "Rob Comber, Jaz Hee-Jeong Choi, Jettie Hoonhout, and Kenton O'hara. 2014. Editorial: Designing for human-food interaction: An introduction to the special issue on 'food and interaction design'.Int. J. Hum.Comput. Stud. 72, 2 (2014), 181--184.  ",
      "doi": "10.1016/j.ijhcs.2013.09.001"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay 2014. Designing for healthy lifestyles: Design considerations for mobile technologies to encourage consumer health and wellness. Foundations and Trends in Human Computer Interaction, 6(34): 167--315.  ",
      "doi": "10.1561/1100000040"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity sensing in the wild: a field trial of ubifit garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, and James A. Landay. 2009. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, 405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Georgina E. Crichton, Merrill F. Elias, and Ala'A. Alkerwi. 2016. Chocolate intake is associated with better cognitive function: The Maine-Syracuse Longitudinal Study. Appetite 100 (2016): 126--132.",
      "doi": ""
    },
    {
      "text": "Lieve Doucé, Karolien Poels, Wim Janssens, and Charlotte De Backer. 2013. Smelling the books: The effect of chocolate scent on purchase-related behavior in a bookstore. Journal of Environmental Psychology 36 (2013): 65--69.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Mark Selby, Abigail Durrant, and David Kirk. 2016. Fitter, happier, more productive: what to ask of a data-driven life. interactions 23, 5 (August 2016), 45--45.  ",
      "doi": "10.1145/2975388"
    },
    {
      "text": "Daniel A. Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A. Munson. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 1109--1113.  ",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Jordan Etkin. 2016. The hidden cost of personal quantification. Journal of Consumer Research 42: 967-- 984.",
      "doi": ""
    },
    {
      "text": "Chloe Fan, Jodi Forlizzi, and Anind K. Dey. 2012. A spark of activity: exploring informative art as visualization for physical activity. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, 81--84.  ",
      "doi": "10.1145/2370216.2370229"
    },
    {
      "text": "Grace Farhat, Sandra Drummond, Lorna Fyfe, and Emad AS Al-Dujaili. 2014. Dark chocolate: an obesity paradox or a culprit for weight gain? Phytotherapy Research 28, no. 6 (2014): 791--797.",
      "doi": ""
    },
    {
      "text": "Foodini. https://www.naturalmachines.com/.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi and Katja Battarbee. 2004. Understanding experience in interactive systems. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). ACM, 261--268.  ",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The design of eco-feedback technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 19992008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, 233240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers?: a longitudinal study of Habito. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, 1305--1316.  ",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Andrea Grimes and Richard Harper. 2008. Celebratory technology: new directions for food research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, 467476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow design for meaningful interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, 34313440.  ",
      "doi": "10.1145/2470654.2466472"
    },
    {
      "text": "Marc Hassenzahl, Kai Eckold, Sarah Diefenbach, Matthias Laschke, Eva Len, and Joonhwan Kim. 2013. Designing moments of meaning and pleasure. Experience design and happiness. International Journal of Design, 7(3), 21--31.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl and Matthias Laschke 2015. Pleasurable Troublemakers. In S. Walz and S. Deterding, eds., The Gameful World: Approaches, Issues, Applications, 167--195.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Matthias Laschke, and Julian Praest. 2016. On the stories activity trackers tell. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, 582--587.  ",
      "doi": "10.1145/2968219.2968325"
    },
    {
      "text": "Sander Hermsen, Jeana Frost, Reint Jan Renes, and Peter Kerkhof 2016. Using feedback through digital technology to disrupt and change habitual behavior: A critical review of current literature. Computers in Human Behavior, 57, 61--74.  ",
      "doi": "10.1016/j.chb.2015.12.023"
    },
    {
      "text": "Victoria Hollis, Artie Konrad, and Steve Whittaker. 2015. Change of Heart: Emotion Tracking to Promote Behavior Change. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2643--2652.  ",
      "doi": "10.1145/2702123.2702196"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 3227--3236.  ",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Susanne Jaschko and Moritz Stefaner. 2014. Data cuisine. http://data-cuisine.net/.",
      "doi": ""
    },
    {
      "text": "Vaiva Kalnikaite, Yvonne Rogers, Jon Bird, Nicolas Villar, Khaled Bachour, Stephen Payne, Peter M. Todd, Johannes Schöning, Antonio Krüger, and Stefan Kreitmayer. 2011. How to nudge in Situ: designing lambent devices to deliver salient information in supermarkets. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, 11--20.  ",
      "doi": "10.1145/2030112.2030115"
    },
    {
      "text": "Flavius Kehr, Marc Hassenzahl, Matthias Laschke, and Sarah Diefenbach. 2012. A transformational product to improve self-control strength: the chocolate machine. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, 689694.  ",
      "doi": "10.1145/2207676.2207774"
    },
    {
      "text": "Chelsey L. Keeler, Richard D. Mattes, and Sze-Yen Tan. 2015. Anticipatory and reactive responses to chocolate restriction in frequent chocolate consumers. Obesity 23, no. 6 (2015): 1130--1135.",
      "doi": ""
    },
    {
      "text": "Rohit Ashok Khot, Larissa Hjorth, and Florian 'Floyd' Mueller. 2014. Understanding physical activity through 3D printed material artifacts. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, 3835--3844.  ",
      "doi": "10.1145/2556288.2557144"
    },
    {
      "text": "Rohit Ashok Khot, Jeewon Lee, Deepti Aggarwal, Larissa Hjorth, and Florian 'Floyd' Mueller. 2015. TastyBeats: Designing Palatable Representations of Physical Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2933--2942.  ",
      "doi": "10.1145/2702123.2702197"
    },
    {
      "text": "Rohit Ashok Khot, Ryan Pennings, and Florian 'Floyd' Mueller. 2015. EdiPulse: Supporting Physical Activity with Chocolate Printed Messages. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, 1391--1396.  ",
      "doi": "10.1145/2702613.2732761"
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why we use and abandon smart devices. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, 635646.  ",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Moon-Hwan Lee, Seijin Cha, and Tek-Jin Nam. 2015. Patina Engraver: Visualizing Activity Logs as Patina in Fashionable Trackers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 1173--1182.  ",
      "doi": "10.1145/2702123"
    },
    {
      "text": "Steve Leffer, Chocolate 101: About Tempering -- What It Is, How To Temper Chocolate and The Alternative. http://www.chocoley.com/resources/about-temperingchocolate.",
      "doi": ""
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish'n'Steps: encouraging physical activity with an interactive computer game. In Proceedings of the 8th international conference on Ubiquitous Computing (UbiComp'06), Springer-Verlag, Heidelberg, 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Edwin A. Locke and Gary P. Latham. 2002. Building a practically useful theory of goal setting and task motivation: A 35-year odyssey. American psychologist 57, no. 9 (2002): 705.",
      "doi": ""
    },
    {
      "text": "George Loewenstein, 1987. Anticipation and the valuation of delayed consumption. The Economic Journal 97, no. 387 (1987): 666--684.",
      "doi": ""
    },
    {
      "text": "Geke DS Ludden, Hendrik NJ Schifferstein, and Paul Hekkert 2006. Sensory incongruity: comparing vision to touch, audition and olfaction. In 5th International Conference on Design and Emotion, Göteborg, Sweden. 1--17.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. Food, the Body and the Self. London: SAGE Publications Ltd., 1998.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton 2016. The Quantified Self: A Sociology of Self-Tracking Cultures. Polity press. ",
      "doi": "10.5555/3052450"
    },
    {
      "text": "Dan Maynes-Aminzade 2005. Edible Bits: Seamless Interfaces between People, Data and Food. CHI 2005.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler and Kasper Hornbæk. 2016. Momentary Pleasure or Lasting Meaning?: Distinguishing Eudaimonic and Hedonic User Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 4509--4520.  ",
      "doi": "10.1145/2858036.2858225"
    },
    {
      "text": "Martin Murer, Ilhan Aslan, and Manfred Tscheligi. 2013. LOLLio: exploring taste as playful modality. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, 299--302.  ",
      "doi": "10.1145/2460625.2460675"
    },
    {
      "text": "Ine Mols, Elise van den Hoven, and Berry Eggen. 2016. Technologies for Everyday Life Reflection: Illustrating a Design Space. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, 53--61.  ",
      "doi": "10.1145/2839462.2839466"
    },
    {
      "text": "Carey K Morewedge, Young Eun Huh, and Joachim Vosgerau. 2010. Thought for food: Imagined consumption reduces actual consumption. Science 330, no. 6010 (2010): 1530--1533.",
      "doi": ""
    },
    {
      "text": "Gina Neff and Dawn Nafus. The Self-Tracking. MIT Press, 2016. ",
      "doi": "10.5555/3056035"
    },
    {
      "text": "Scott Nicholson 2015. A recipe for meaningful gamification. In Gamification in education and business, pp. 1--20. Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Takuji Narumi, Takashi Kajinami, Tomohiro Tanikawa, and Michitaka Hirose. 2010, Meta cookie. In ACM SIGGRAPH 2010 Emerging Technologies (SIGGRAPH '10). ACM, Article 18, 1 pages.  ",
      "doi": "10.1145/1836821.1836839"
    },
    {
      "text": "Stina Nylander, Mattias Jacobsson, and Jakob Tholander. 2014. Runright: real-time visual and audio feedback on running. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, 583--586.  ",
      "doi": "10.1145/2559206.2574806"
    },
    {
      "text": "Marianna Obrist, Carlos Velasco, Chi Vi, Nimesha Ranasinghe, Ali Israr, Adrian Cheok, Charles Spence, and Ponnampalam Gopalakrishnakone. 2016. Sensing the future of HCI: touch, taste, and smell user interfaces. interactions 23, 5 (2016), 40--49.  ",
      "doi": "10.1145/2973568"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "OpenJSCAD, http://openjscad.org",
      "doi": ""
    },
    {
      "text": "Polar Heart rate monitors, http://www.polar.com/products/accessories/H7_heart_r ate_sensor",
      "doi": ""
    },
    {
      "text": "Printrun http://www.pronterface.com/",
      "doi": ""
    },
    {
      "text": "Qkies http://qkies.de/",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2011. Interaction design gone wild: striving for wild theory. Interactions 18, 4, 58- 62.  ",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Herman Saksono, Ashwini Ranade, Geeta Kamarthi, Carmen Castaneda-Sceppa, Jessica A. Hoffman, Cathy Wirth, and Andrea G. Parker. 2015. Spaceship Launch: Designing a Collaborative Exergame for Families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1776--1787.  ",
      "doi": "10.1145/2675133.2675159"
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, 1971--1980.  ",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Johannes Schoning, Yvonne Rogers, Antonio Kruger, 2012. Digitally Enhanced Food, IEEE Pervasive Computing, vol. 11, no. 3, pp. 4--6, July-September, 2012.  ",
      "doi": "10.1109/MPRV.2012.40"
    },
    {
      "text": "Wesley P. Schultz, Jessica M. Nolan, Robert B. Cialdini, Noah J. Goldstein, and Vladas Griskevicius. 2007. The constructive, destructive, and reconstructive power of social norms. Psychological science 18, no. 5 (2007): 429--434.",
      "doi": ""
    },
    {
      "text": "Smoothfood. http://smoothfood.de/foodforms/?lang=en",
      "doi": ""
    },
    {
      "text": "Charles Spence 2002. Multisensory attention and tactile information-processing. Behavioural brain research, 135(1), 57--64.",
      "doi": ""
    },
    {
      "text": "Charles Spence, Katsunori Okajima, Adrian David Cheok, Olivia Petit, and Charles Michel. 2015, Eating with our eyes: from visual hunger to digital satiation. Brain and cognition.",
      "doi": ""
    },
    {
      "text": "Charles Spence and Betina Piqueras-Fiszman. 2013. The Perfect Meal: The Multisensory Science of Food and Dining, Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "Tadeusz Stach, T. C. Nicholas Graham, Jeffrey Yim, and Ryan E. Rhodes. 2009. Heart rate control of exercise video games. In Proceedings of Graphics Interface 2009 (GI '09). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 125--132. ",
      "doi": "10.5555/1555880.1555912"
    },
    {
      "text": "Simon Stusak, Aurelién Tabard, Franziska Sauka, Rohit Ashok Khot, and Andreas Butz. 2014. Activity sculptures: exploring the impact of physical visualizations on running activity. TVCG 20, 12 (2014), 2201--2210.",
      "doi": ""
    },
    {
      "text": "Jie Sun, Weibiao Zhou, Dejian Huang, Jerry YH Fuh, and Geok Soon Hong. 2015. An Overview of 3D Printing Technologies for Food Fabrication. Food and Bioprocess Technology (2015), 1--11.",
      "doi": ""
    },
    {
      "text": "Jakob Tholander and Stina Nylander 2015, Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2913--2922.  ",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Stewart G Trost, Neville Owen, Adrian E Bauman, James F Sallis, and Wendy Brown. 2002. Correlates of adults' participation in physical activity: review and update. Medicine & Science in Sports & Exercise 34, 12: 1996--2001.",
      "doi": ""
    },
    {
      "text": "Greg Walsh and Jennifer Golbeck. 2014. StepCity: a preliminary investigation of a personal informaticsbased social game on behavior change. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2371--2376.  ",
      "doi": "10.1145/2559206.2581326"
    },
    {
      "text": "Yun Wang, Xiaojuan Ma, Qiong Luo, and Huamin Qu. 2016. Data Edibilization: Representing Data with Food. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, USA, 409--422.  ",
      "doi": "10.1145/2851581.2892570"
    },
    {
      "text": "Jun Wei, Xiaojuan Ma, and Shengdong Zhao. 2014. Food messaging: using edible medium for social messaging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, 2873--2882.  ",
      "doi": "10.1145/2556288.2557026"
    },
    {
      "text": "Oren Zuckerman and Ayelet Gal-Oz. 2014. Deconstructing gamification: evaluating the effectiveness of continuous measurement, virtual rewards, and social comparison for promoting physical activity. Personal Ubiquitous Comput. 18, 7 (October 2014), 1705--1719.  ",
      "doi": "10.1007/s00779-014-0783-2"
    }
  ]
}