{
  "doi": "10.1145/3025453.3025847",
  "title": "Scratch Community Blocks: Supporting Children as Data Scientists",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "3620-3631",
  "year": 2017,
  "badges": [],
  "abstract": "In this paper, we present Scratch Community Blocks, a new system that enables children to programmatically access, analyze, and visualize data about their participation in Scratch, an online community for learning computer programming. At its core, our approach involves a shift in who analyzes data: from adult data scientists to young learners themselves. We first introduce the goals and design of the system and then demonstrate it by describing example projects that illustrate its functionality. Next, we show through a series of case studies how the system engages children in not only representing data and answering questions with data but also in self-reflection about their own learning and participation.",
  "authors": [
    {
      "name": "Sayamindu Dasgupta",
      "institution": "Massachusetts Institute of Technology & University of Washington, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484641200",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Harold Abelson and Andrea diSessa. 1986. Turtle Geometry: The Computer as a Medium for Exploring Mathematics. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Efthimia Aivaloglou and Felienne Hermans. 2016. How Kids Code and How We Know: An Exploratory Study on the Scratch Repository. In Proceedings of the 2016 ACM Conference on International Computing Education Research (ICER '16). ACM, NY, NY, USA, 53--61. DOI:http://dx.doi.org/10.1145/2960310.2960325  ",
      "doi": "10.1145/2960310.2960325"
    },
    {
      "text": "Scott W Ambler. 2000. Mapping objects to relational databases: What you need to know and why. (July 2000). https://www.ibm.com/developerworks/library/wsmapping-to-rdb/",
      "doi": ""
    },
    {
      "text": "Jana Beck. 2013. iPancreas. (2013). https://github.com/jebeck/iPancreas-archive",
      "doi": ""
    },
    {
      "text": "Dani Ben-Zvi and Keren Aridor-Berger. 2016. Children's Wonder How to Wander Between Data and Context. In The Teaching and Learning of Statistics: International Perspectives, Dani Ben-Zvi and Katie Makar (Eds.). Springer International Publishing, Cham, 25--36. http://dx.doi.org/10.1007/978--3--319--23470-0_3",
      "doi": ""
    },
    {
      "text": "Yochai Benkler. 2006. The Wealth of Networks: How Social Production Transforms Markets and Freedom. Yale University Press, New Haven, CT.",
      "doi": "10.5555/1214507"
    },
    {
      "text": "Rahul Bhargava and Catherine D'Ignazio. 2015. Designing Tools and Activities for Data Literacy Learners. (2015).",
      "doi": ""
    },
    {
      "text": "Marie Bienkowski, Minguy Feng, and Barbara Means. 2012. Enhancing teaching and learning through educational data mining and learning analytics: An issue brief. Technical Report. US Department of Education, Office of Educational Technology.",
      "doi": ""
    },
    {
      "text": "David Boud, Rosemary Keogh, and David Walker. 1985. Reflection: Turning Experience Into Learning. Routledge, NY, NY.",
      "doi": ""
    },
    {
      "text": "Karen Brennan. 2013. Best of both worlds: Issues of structure and agency in computational creation, in and out of school. Ph.D. Dissertation. MA Institute of Technology.",
      "doi": "10.5555/2519999"
    },
    {
      "text": "Jerome S. Bruner. 1986. Actual Minds, Possible Worlds. Harvard University Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Richard Catrambone and Mark Guzdial. 2012. Answering Questions with Internet Data: Computational Tools for Social Studies Analysis. (2012). http://swiki.cc.gatech.edu/compfreak",
      "doi": ""
    },
    {
      "text": "Community Data Science Collective. 2015. Community Data Science Collective. (2015). http://wiki.communitydata.cc/",
      "doi": ""
    },
    {
      "text": "Drew Conway. 2010. The data science Venn diagram. (2010). http://www.dataists.com/2010/09/the-datascience-venn-diagram/",
      "doi": ""
    },
    {
      "text": "Sayamindu Dasgupta. 2013. From Surveys to Collaborative Art: Enabling Children to Program with Online Data. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, NY, NY, USA, 28--35. DOI: http://dx.doi.org/10.1145/2485760.2485784  ",
      "doi": "10.1145/2485760.2485784"
    },
    {
      "text": "Sayamindu Dasgupta, Shane M. Clements, Abdulrahman Y. Idlbi, Chris Willis-Ford, and Mitch Resnick. 2015. Extending Scratch: New pathways into programming. In 2015 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, Atlanta, GA, 165--169. DOI: http://dx.doi.org/10.1109/VLHCC.2015.7357212 ",
      "doi": ""
    },
    {
      "text": "Noleine Fitzallen and Jane Watson. 2010. Developing statistical reasoning facilitated by TinkerPlots. In Data and context in statistics education: Towards an evidence-based society. Proceedings of the Eighth International Conference on Teaching Statistics (ICOTS8, July, 2010), Ljubljana, Slovenia., Chris Reading (Ed.). International Statistical Institute, Voorburg, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Hector Gonzalez, Alon Y. Halevy, Christian S. Jensen, Anno Langen, Jayant Madhavan, Rebecca Shapley, Warren Shen, and Jonathan Goldberg-Kidon. 2010. Google fusion tables: web-centered data management and collaboration. In Proceedings of the 2010 ACM SIGMOD International Conference on Management of data (SIGMOD '10). ACM, NY, NY, USA, 1061--1066. DOI:http://dx.doi.org/10.1145/1807167.1807286  ",
      "doi": "10.1145/1807167.1807286"
    },
    {
      "text": "Sudheendra Hangal, Monica S. Lam, and Jeffrey Heer. 2011. MUSE: Reviving Memories Using Email Archives. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, NY, NY, USA, 75--84. DOI: http://dx.doi.org/10.1145/2047196.2047206  ",
      "doi": "10.1145/2047196.2047206"
    },
    {
      "text": "Jonathon David Hellmann. 2015. DataSnap: Enabling Domain Experts and Introductory Programmers to Process Big Data in a Block-Based Programming Language. Thesis. Virginia Tech. https: //vtechworks.lib.vt.edu//handle/10919/54544",
      "doi": ""
    },
    {
      "text": "Deepak Jagdish. 2014. IMMERSION : a platform for visualization and temporal analysis of email data. Thesis. MA Institute of Technology. http://dspace.mit.edu/handle/1721.1/95606",
      "doi": ""
    },
    {
      "text": "Iain Johnstone and Fred Roberts. 2014. Data Science at NSF. Technical Report. National Science Foundation. http://www.nsf.gov/attachments/129788/public/ Final_StatSNSFJan14.pdf",
      "doi": ""
    },
    {
      "text": "Khan Academy. 2013. Introducing...the Learning Dashboard. (Aug. 2013). https://www.khanacademy.org/about/blog/post/ 58354379257/introducingthe-learning-dashboard",
      "doi": ""
    },
    {
      "text": "Vasiliki Laina and Michelle Wilkerson. 2016. Distributions, Trends, and Contradictions: A Case Study in Sensemaking with Interactive Data Visualizations. In Proceedings of the 12th International Conference of the Learning Sciences. The International Society of the Learning Sciences, Singapore.",
      "doi": ""
    },
    {
      "text": "Victor Lee. 2013. The Quantified Self (QS) Movement and Some Emerging Opportunities for the Educational Technology Field. Educational Technology November-December 2013 (Oct. 2013), 39--42. http://digitalcommons.usu.edu/itls_facpub/480",
      "doi": ""
    },
    {
      "text": "John Maloney, Mitchel Resnick, Natalie Rusk, Brian Silverman, and Evelyn Eastmond. 2010. The Scratch Programming Language and Environment. Trans. Comput. Educ. 10, 4 (Nov. 2010), 16:1--16:15. DOI: http://dx.doi.org/10.1145/1868358.1868363  ",
      "doi": "10.1145/1868358.1868363"
    },
    {
      "text": "Fred Martin, Sarah Kuhn, Michelle Scribner-MacLean, Christopher Corcoran, James Dalphond, John Fertitta, Michael McGuiness, Sam Christy, and Ivan Rudnicki. 2010. iSENSE: A Web Environment and Hardware Platform for Data Sharing and Citizen Science. AAAI Spring Symposium Series; 2010 AAAI Spring Symposium Series (2010). http://www.aaai.org/ocs/index.php/ SSS/SSS10/paper/view/1099",
      "doi": ""
    },
    {
      "text": "Andrés Monroy Hernández. 2007. ScratchR: sharing user-generated programmable media. In Proceedings of the 6th international conference on Interaction design and children (IDC '07). ACM, NY, NY, USA, 167--168. DOI: http://dx.doi.org/10.1145/1297277.1297315  ",
      "doi": "10.1145/1297277.1297315"
    },
    {
      "text": "Dawn Nafus. 2006. Quantified: Biosensing Technologies in Everyday Life. The MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, Computers, and Powerful Ideas. Basic Books, Inc., NY, NY, USA.",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Seymour Papert and Idit Harel. 1991. Situating constructionism. In Constructionism. Ablex Publishing, NY, NY, US, 1--11.",
      "doi": ""
    },
    {
      "text": "Seymour A. Papert. 1971. Teaching Children to be Mathematicians vs. Teaching About Mathematics. Technical Report 249. MA Institute of Technology, Cambridge, MA. http://dspace.mit.edu/handle/1721.1/5837",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1970. Genetic epistemology. Trans. E. Duckworth. Columbia University Press, NY, NY, US.",
      "doi": ""
    },
    {
      "text": "John Podesta. 2014. Big Data: Seizing Opportunities, Preserving Values. Technical Report. Executive Office of the President, USA of America.",
      "doi": ""
    },
    {
      "text": "Hans Poldoja. 2010. EduFeedr - following and supporting learners in open blog-based courses. In Open ED 2010 Proceedings. Barcelona. http://openaccess.uoc.edu/ webapps/o2/handle/10609/4861",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick. 2008. Sowing the Seeds for a More Creative Society. Learning & Leading with Technology 35, 4 (2008), 18--22.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: Programming for All. Commun. ACM 52, 11 (Nov. 2009), 60--67. DOI: http://dx.doi.org/10.1145/1592761.1592779  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mitchel Resnick and Brian Silverman. 2005. Some reflections on designing construction kits for kids. In Proceedings of the 2005 conference on Interaction design and children (IDC '05). ACM, NY, NY, USA, 117--122. DOI: http://dx.doi.org/10.1145/1109540.1109556  ",
      "doi": "10.1145/1109540.1109556"
    },
    {
      "text": "Verónica Rivera-Pelayo, Valentin Zacharias, Lars Müller, and Simone Braun. 2012. Applying Quantified Self Approaches to Support Reflective Learning. In Proceedings of the 2Nd International Conference on Learning Analytics and Knowledge (LAK '12). ACM, NY, NY, USA, 111--114. DOI: http://dx.doi.org/10.1145/2330601.2330631  ",
      "doi": "10.1145/2330601.2330631"
    },
    {
      "text": "Eric (Eric Ross) Rosenbaum. 2009. Jots : Cultivating reflective learning in Scratch. Thesis. MA Institute of Technology. http://dspace.mit.edu/handle/1721.1/55197",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1983. The reflective practitioner: How professionals think in action. Basic books, NY, NY, USA.",
      "doi": ""
    },
    {
      "text": "R. Benjamin Shapiro, Annie Kelly, Matthew Ahrens, and Rebecca Fiebrink. 2016. BlockyTalky: A Physical and Distributed Computer Music Toolkit for Kids. In Proceedings of the 16th International Conference on New Interfaces for Musical Expression. Brisbane, Australia. http://research.gold.ac.uk/18635/",
      "doi": ""
    },
    {
      "text": "Sarah Van Wart and Tapan S Parikh. 2013. Increasing Youth and Community Agency in GIS. In GeoHCI Workshop at CHI 2013.",
      "doi": ""
    },
    {
      "text": "Katrien Verbert, Erik Duval, Joris Klerkx, Sten Govaerts, and José Luis Santos. 2013. Learning Analytics Dashboard Applications. American Behavioral Scientist 57, 10 (Oct. 2013), 1500--1509. DOI: http://dx.doi.org/10.1177/0002764213479363 ",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viegas, Martin Wattenberg, Frank van Ham, Jesse Kriss, and Matt McKeon. 2007. ManyEyes: a Site for Visualization at Internet Scale. IEEE Transactions on Visualization and Computer Graphics 13, 6 (2007), 1121--1128. DOI: http://dx.doi.org/10.1109/TVCG.2007.70577  ",
      "doi": "10.1109/TVCG.2007.70577"
    },
    {
      "text": "Fernanda B. Viégas, Scott Golder, and Judith Donath. 2006. Visualizing Email Content: Portraying Relationships from Conversational Histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, NY, USA, 979--988. DOI: http://dx.doi.org/10.1145/1124772.1124919  ",
      "doi": "10.1145/1124772.1124919"
    },
    {
      "text": "Karen E Willcox, Sanjay Sarma, and Philip H Lippel. 2016. Online Education: A Catalyst for Higher Education Reforms. Technical Report. MA Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Wolfram Research. 2015. Wolfram|Alpha Personal Analytics for Facebook: Last Chance to Analyze Your Friend Network. (April 2015). http://company.wolfram.com/news/2015/ wolframalpha-personal-analytics-for-facebooklast-chance-to-analyze-your-friend-network/",
      "doi": ""
    }
  ]
}