{
  "doi": "10.1145/3025453.3026031",
  "title": "Pause: A Multi-lifespan Design Mechanism",
  "published": "2017-05-02",
  "proctitle": "CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems",
  "pages": "460-464",
  "year": 2017,
  "badges": [],
  "abstract": "At times, inaction may be a wise course of action. This insight lies at the heart of the design mechanism of pause. In this note, we explore the construct of pause, its rhythms, and nuances of enacting pause. Throughout, we draw on our experience engaging with pause in the multi-lifespan design of information systems for transitional justice. Five rhythms are identified: periodic hiatus, pending future event, responding to the socio-political climate, (temporary) closure, and laying fallow. In addition, we provide heuristics for managing pause and then restarting the design process. We then explore the scalability of pause from longer (e.g., multi-lifespan design) to shorter timeframes. We conclude with reflections on the potential benefits and open questions about pause as a design mechanism.",
  "tags": [
    "pause",
    "design mechanism",
    "multi-lifespan design"
  ],
  "authors": [
    {
      "name": "Batya Friedman",
      "institution": "University of Washington, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100636215",
      "orcid": "missing"
    },
    {
      "name": "Daisy Yoo",
      "institution": "University of Washington, Seattle, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556772856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eric P. S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2271--2274. http://doi.acm.org/ 10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Batya Friedman and Lisa P. Nathan. 2010. Multilifespan information system design: a research initiative for the HCI community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 2242--2246. http://doi.acm.org/10.1145/1753326.1753665",
      "doi": ""
    },
    {
      "text": "Batya Friedman,.Lisa P. Nathan, and Daisy Yoo. 2016. Multi-lifespan information system design in support of transitional justice: evolving situated design principles for the long(er) term. Interacting with Computers, iwv045. http://doi.org/10.1093/iwc/iwv045 ",
      "doi": ""
    },
    {
      "text": "Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow design for meaningful interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 3431--3440. http://doi.acm.org/10.1145/2470654.2466472",
      "doi": "10.1145/2470654.2466472"
    },
    {
      "text": "Lars Hallnäs and Johan Redstörm. 2001. Slow technology -- designing for reflection. Personal and Ubiquitous Computing 5: 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Lisa P. Nathan, Nell Carden Grey, Milli Lake, Trond Nilsen, Elizabeth Utter, Robert F. Utter, Mark Ring, Zoe Kahn, and Batya Friedman. 2011. Multi-lifespan information system design: investigating a new design approach in Rwanda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 591--597. http://doi.acm.org/10.1145/1753326.1753665",
      "doi": "10.1145/1940761.1940841"
    },
    {
      "text": "Never Again Rwanda website. 2016. Retrieved September 19, 2016 from http://neveragainrwanda.org",
      "doi": ""
    },
    {
      "text": "William Odom. 2015. Understanding long-term interactions with a slow technology: an investigation of experiences with FutureMe. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 575--584. http://doi.acm.org/10.1145/2702123.2702221",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "Carolyn F. Strause and Alastair Fuad-Luke. 2008. The slow design principles: a new interrogative and reflexive tool for design research and practice. In Proceedings of Changing the Change (2008).",
      "doi": ""
    },
    {
      "text": "Voices from the Rwanda Tribunal website. 2016. Retrieved September 19, 2016 from http://www.tribunalvoices.org",
      "doi": ""
    },
    {
      "text": "Daisy Yoo, Milli Lake, Trond Nilsen, Molly E. Utter, Robert Alsdorf, Theoneste Bizimana, Lisa P. Nathan, Mark Ring, Elizabeth J. Utter, Robert F. Utter, and Batya Friedman. 2013. Envisioning Across Generations: A Multi-lifespan Information System for International Justice in Rwanda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2013), 2527--2536. http://doi.acm.org/10.1145/2470654.2481349",
      "doi": "10.1145/2470654.2481349"
    },
    {
      "text": "Daisy Yoo, Katie Derthick, K., Shaghayegh Ghassemian, Jean Hakizimana, Brian Gill, and Batya Friedman. 2016. Multi-lifespan design thinking: two methods and a case study with the Rwandan diaspora. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16), 4423--4434. http://doi.acm.org/10.1145/2858036.2858366",
      "doi": "10.1145/2858036.2858366"
    }
  ]
}