{
  "doi": "10.1145/317456.317474",
  "title": "The use of logging data in the design of a new text editor",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "93-97",
  "year": 1985,
  "badges": [],
  "abstract": "Many different human factors techniques are available to the designer of a new computer system. This case study examines how one technique, the use of logging data, was used throughout the design of a new text editor which is measurably easy to learn and easy to use. Logging data was used in four areas: keyboard design, the initial design of the editor's command set, refinements made later in the design cycle, and the construction of a system performance benchmark.",
  "tags": [],
  "authors": [
    {
      "name": "Michael Good",
      "institution": "Digital Equipment Corporation",
      "img": "/do/10.1145/contrib-81100090422/rel-imgonly/michael-formal-square2.png",
      "acmid": "81100090422",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Digital Equipment Corporation. EDT Editor Manual. Order No. AA-J726A-TC, Maynard, Mass., October 1980.",
      "doi": ""
    },
    {
      "text": "Hanson, Stephen Jos~, Kraut, Robert E. and Farber, James M. Interface design and multivariate analysis of UNIX command use. A CM Transactions on O~ce Information Systems 2, 1 (January 1984), 42-57.  ",
      "doi": "10.1145/357417.357421"
    },
    {
      "text": "Ledgard, Henry, Singer, Andrew and Whiteside, John. Directions in Human Factors for Interactive Systems. Springer-Verlag, New York, 1981.",
      "doi": ""
    },
    {
      "text": "Roberts, Teresa L. Evaluation of computer text editors. Xerox PARC Report SSL-79-9, November 1979. Stanford Ph.D. dissertation. ",
      "doi": "10.5555/909448"
    },
    {
      "text": "Roberts, Teresa L. and Moran, Thomas P. The evaluation of text editors: methodology and empirical results. Communications of the A CM 26, 4 (April 1983}, 265-283.  ",
      "doi": "10.1145/2163.2164"
    },
    {
      "text": "Stallman, Richard M. EMACS, the extensible, customizable self-documenting display editor. SIG- PLAN Notices 16, 6 (June 1981), 147-156.  ",
      "doi": "10.1145/800209.806466"
    },
    {
      "text": "Whiteside, John, Archer, Norman, Wixon, Dennis and Good, Michael. How do people really use text editors? SIGOA Newsletter 3, 1 (June 1982), pp. 29- 40.  ",
      "doi": "10.1145/800210.806474"
    },
    {
      "text": "Wood, Steven R. Z - the 95~7o program editor. SIG- PLAN Notices 16, 6 (June 1981}, pp. 1-7.  ",
      "doi": "10.1145/800209.806447"
    },
    {
      "text": "Wood, Steven R. Data distributed over ARPANET, October 24, 1982.",
      "doi": ""
    },
    {
      "text": "Zimmerman, Steve. Data distributed over ARPA- NET, May 27, 1982.",
      "doi": ""
    }
  ]
}