{
  "doi": "10.1145/317456.317475",
  "title": "The evaluation of text editors: a critical review of the Roberts and Morgan methodology based on new experiments",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "99-105",
  "year": 1985,
  "badges": [],
  "abstract": "Three text editors were studied using the editor evaluation methodology developed by Roberts and Moran [3, 4]. The results are presented as an extension of the studies by Roberts and Moran, with comparisons to the editors they studied earlier. In addition, supplementary measurements were taken that suggest minor flaws in the Roberts and Moran methodology. Further problems with the methodology are discussed, with an eye toward improving the methodology for future use. Although three significant problems with the methodology are reported, the problems are interesting primarily as lessons for the design of future evaluation methodologies. The Roberts and Moran methodology remains largely useful for the purposes for which it was designed.",
  "authors": [
    {
      "name": "Nathaniel S. Borenstein",
      "institution": "Department of Computer Science, Carnegie-Mellon University, Pittsburgh, Pennsylvania",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100065714",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gosling, James. Unix Emacs Carnegie.Mellon University, 1983.",
      "doi": ""
    },
    {
      "text": "Wyllie, Jim, et al. IBM Personal Editor First edition, IBM, 1982.",
      "doi": ""
    },
    {
      "text": "Roberts, Teresa L. Evaluation of Computer Text Editors. PhD thesis, Stanford University, 1979. ",
      "doi": "10.5555/909448"
    },
    {
      "text": "Roberts, Teresa L. and Thomas P. Moran. The Evaluation of Text Editors: Methodology and Empirical Results. Communications of the ACM , April, 1983.  ",
      "doi": "10.1145/2163.2164"
    },
    {
      "text": "Roberts, Teresa L. Private communication, November 1983.",
      "doi": ""
    },
    {
      "text": "IBM Virtual Machine/System Product: CMS Primer First edition, IBM, 1982.",
      "doi": ""
    }
  ]
}