{
  "doi": "10.1145/317456.317471",
  "title": "Designing a menu-based interface to an operating system",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "79-84",
  "year": 1985,
  "badges": [],
  "abstract": "The development of a large menu-based interface to an operating system posed a number of interesting user interface questions. Among those were how to determine the user's view of the relationships among the myriad of functions in the system, and how to reflect those relationships in a menu hierarchy. An experiment utilizing a sorting technique and hierarchical cluster analysis was quite effective in learning the user's perception of the relationships among the system functions. A second experiment comparing a “broad” menu hierarchy to a “deep” menu hierarchy showed that users made significantly fewer inappropriate menu selections with the broad hierarchy.",
  "authors": [
    {
      "name": "Thomas S. Tullis",
      "institution": "Burroughs Corporation, Irvine, California",
      "img": "/do/10.1145/contrib-81100355455/rel-imgonly/tomtullis.jpg",
      "acmid": "81100355455",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Johnson, S. C. (1967). Hierarchical clustering schemes. P~ychometrika, 32, p. 241-254.",
      "doi": ""
    },
    {
      "text": "Kiger, J. I. (1984). The depth/breadth trade-off in the design of menu-driven user interfaces. International Journal of Man-Machine Studies, 20 p. 201-213-  ",
      "doi": ""
    },
    {
      "text": "Miller, D. P. (1981). The depth/breadth tradeoff in hierarchical computer menu's. Proceedings of the 25th Annual Meeting of the Human Factors Society, p. 296-300.",
      "doi": ""
    },
    {
      "text": "Rosenberg, S. and Kim, M. P. (1975). The method of sorting as a data-gathering procedure in multivariate research. Multivariate Behavioral Research, IO, p. 489- 502.",
      "doi": ""
    },
    {
      "text": "Snowberry, K., Parkinson, S. R., and Sisson, N. (1983). Computer display menus. Ergonomics, 26, p. 699-712.",
      "doi": ""
    }
  ]
}