{
  "doi": "10.1145/317456.317459",
  "title": "The importance of percent-done progress indicators for computer-human interfaces",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "11-17",
  "year": 1985,
  "badges": [],
  "abstract": "A “percent-done progress indicator” is a graphical technique which allows the user to monitor the progress through the processing of a task. Progress indicators can be displayed on almost all types of output devices, and can be used with many different kinds of programs. Practical experience and formal experiments show that prograss indicators are an important and useful user-interface tool, and that they enhance the attractiveness and effectiveness of programs that incorporate them. This paper discusses why progress indicators are important. It includes the results of a formal experiment with progress indicators. One part of the experiment demonstrates that people prefer to have progress indicators. Another part attempted to replicate earlier findings to show that people prefer constant to variable response time in general, and then to show that this effect is reversed with progress indicators, but the results were not statistically significant. In fact, no significant preference for constant response time was shown, contrary to previously published results.",
  "tags": [
    "user interfaces",
    "progress indicators",
    "window managers"
  ],
  "authors": [
    {
      "name": "Brad A. Myers",
      "institution": "Department of Computer Science, University of Toronto, Toronto, Ontario, M5S 1A4, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474653951",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Carbonelle, Jaime, Elkind, Jerome I., and Nickerson, Raymond S. (1968). On the Psychological Importance of Time in a Time Sharing System. Human Factors 10(2), April 1968. 135-142.",
      "doi": ""
    },
    {
      "text": "Foley, James D. (1974). The Art of Natural Graphic Man-Machine Conversation. Proceedings of the 1EEE 62(4), April 1974. 462-471.",
      "doi": ""
    },
    {
      "text": "Miller, Lawrence H. (1977). A Stuc~y in Man-Machine Interaction. Proceedings of the National Computer Conference 46. AFIPS Press, 1977. 409-421.",
      "doi": ""
    },
    {
      "text": "Miller, Robert B. (1968). Response Time in Man- Computer Conversational Transactions. Proceedings Fall Joint Computer Conference 33(part 1). AFIPS Press, 1968. 267-277.",
      "doi": "10.1145/1476589.1476628"
    },
    {
      "text": "Myers, Brad A. (1983). Incense: A System for Displaying Data Structures. Computer Graphics\" SIG- GRAPH '83 Conference Proceedings 17(3), July 1983. 115-125.  ",
      "doi": "10.1145/800059.801140"
    },
    {
      "text": "Myers, Brad A. (1984). The User Interface for Sapphire: A Screen Allocation Package Providing Helpful Icons and Rectangular Environments. IEEE Computer Graphics and Applications. 4(I2), December 1984. 13-23.",
      "doi": ""
    },
    {
      "text": "PERQ POS Operating System Manual. (1983). PERQ System Software Reference Manual, POS Version G3. PERO Systems Corporation, Pittsburgh, PA. May 1983.",
      "doi": ""
    },
    {
      "text": "Pike, Rob. (1983). Graphics in Overlapping Bitmap Layers. ACM Transactions on Graphics. 2(2), April 1983. 135-160.  ",
      "doi": "10.1145/357318.357322"
    },
    {
      "text": "Rashid, R. and Robertson, G. (1981). Accent: A Communication Oriented Network Operating System Kernel. Proceedings of the 8th Symposium on Operating Systems Principles. Asilomar, CA, December 1981.64-75.  ",
      "doi": "10.1145/800216.806593"
    },
    {
      "text": "Rosen, Brian. (1980). PERQ: A Commercially Available Personal Scientific Computer. IEEE Comp- Con Digest. Spring 1980.",
      "doi": ""
    },
    {
      "text": "SAS. (1984). The Statistical Analysis System, Release 82.4. SAS Institute Inc. SAS Circle, PO Box 8000, Cary, N.C. 27511-8000.",
      "doi": ""
    },
    {
      "text": "Spence, Robert. (1976). Human Factors in Interactive Graphics. Computer Aided Design g(l), January 1976.49-53.",
      "doi": ""
    },
    {
      "text": "Weisberg, David E. (1984). The Impact of Network System Architecture on CAD/CAM Productivity. IEEE Computer Graphics and Applications 4(8), August 1984. 36-40.",
      "doi": ""
    },
    {
      "text": "Williams, Gregg. (1984). The Apple Macintosh Computer. Byte Magazine. 9(2), February 1984. 30-54.",
      "doi": ""
    }
  ]
}