{
  "doi": "10.1145/317456.317478",
  "title": "When does an abbreviation become a word? and related questions",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "121-125",
  "year": 1985,
  "badges": [],
  "abstract": "An experiment is reported in which subjects previously naive to text editing learned to use a set of editing commands. Some subjects used abbreviations from the beginning. Others began by using full command names, then switched to the (optional) use of abbreviations, either of their own devising or of our selection. We found significant differences in the number and nature of the errors produced by subjects in the different conditions. People who created their own abbreviations did most poorly, and did not appear to learn from this experience. Those who used abbreviations from the start were more likely to fall into error through misrecalling the referent names. The results suggest aspects of the underlying cognitive representations, with implications for the design of software interfaces.",
  "authors": [
    {
      "name": "Jonathan Grudin",
      "institution": "Wang Laboratories, Lowell, Mass.",
      "img": "/do/10.1145/contrib-81100031531/rel-imgonly/jonathan_grudin.jpg",
      "acmid": "81100031531",
      "orcid": "missing"
    },
    {
      "name": "Phil Barnard",
      "institution": "MRC Applied Psychology Unit, Cambridge, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469779",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barnard, P.3., Hammond, N.V., MaeLean, A., and Morton, J. Learning and remembering interaetive eommands in a text-editing task. Behaviour &amp; Information Technology, 1982, 1, 347-358.",
      "doi": ""
    },
    {
      "text": "Black, J. and Moran, T. Learning and remembering command names. In: Proceedings of the Conference on Human Factors in Computer Systems, Gaithersburg, Maryland, ACM: Washington, 1982, 8-11.  ",
      "doi": "10.1145/800049.801745"
    },
    {
      "text": "C arroll, J.M. Learning, using, and designing filenames and eommm~d paradigms. Behaviour &amp; Information Technology, 1982, l, 327-346.",
      "doi": ""
    },
    {
      "text": "Grudin, J. aild Barnard, P. The cognitive demands of learning and representing eommand names for text-editing with varying struetural and semantic attributes. Human Factors, 1984(a), 26, 407-422.",
      "doi": ""
    },
    {
      "text": "Grudin, J. and Barlmrd, P. The role of prior task experience in command name abbreviation. In: Interact '84 Conference Papers, 1984(b), {FIP, 1.439-1.443.",
      "doi": ""
    },
    {
      "text": "Hirsh-Pasek, K., Nudelmml, S., and Sctmeider, M.L. An experimental evaluation of abbreviation schemes in limited lexicons. Behaviour &amp; Information Technology, 1982, l, 359-370.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K., Galotti, K.M., and Hartwell, S. Natural eomlnaJld names aJid initial learning: A study of text editii~g terms. Comm. ACM, 1983, 26.  ",
      "doi": "10.1145/358150.358157"
    },
    {
      "text": "Seapin, D.L. Generation effect, structuring and computer commands. Behaviour &amp; Information Technology, 1982, l, 401-410.",
      "doi": ""
    },
    {
      "text": "Streeter, L.A., Aekroff, J.M., .and Taylor, G.A. On abbreviating comm:md names. The Bell System Technical Journai, 1983, 62, 1807- t826.",
      "doi": ""
    }
  ]
}