{
  "doi": "10.1145/317456.317480",
  "title": "Experience with an adaptive indexing scheme",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "131-135",
  "year": 1985,
  "badges": [],
  "abstract": "Previous work has shown that there is a major vocabulary barrier for new or intermittent users of computer systems. The barrier can be substantially lowered with a rich, empirically defined, frequency weighted index. This paper discusses experience with an adaptive technique for constructing such an index. In addition to being an easy way for system designers to collect the necessary data, an adaptive system has the additional advantage that data is collected from real users in real situations, not in some laboratory approximation. Implementation considerations, preliminary results and future theoretical directions are discussed.",
  "tags": [],
  "authors": [
    {
      "name": "George W. Furnas",
      "institution": "Bell Communications Research, Morristown, New Jersey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100649937",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Furna~, G. W., Landauer, T. K., Gomez, L. M., Dumais, S. T., (1983) \"Statistical semantics: Analysis of the potential performance of keyword information access systems.\" Bell System Technical Journal. (Special Issue on Human Factors in Computer Systems), 62, 1753-1806. Reprinted in: Thomas, J.C., and Schneider, M.L, eds.(1984) ltuman Factors in Computer Systems. Norwood, New Jersey: Ablex Publishing Corp., 187-242. ",
      "doi": "10.5555/818.826"
    },
    {
      "text": "Gomez, L.M., and Lochbaum, C.C. (1984) \"People can Retrieve More Objects with Enriched Key-Word Vocabularies. But is there a Human Performance Cost?\" In the Proceedings of INTERACT '84, First IFIP Conference on Human Computer interaction, London, England, September 4-6, 1984.",
      "doi": ""
    },
    {
      "text": "Reisner, P. (1966) \"Construction of a growing the saurus by conversational interaction in a manmachine system.\" Proceedings of the American Documentation Institute. 26th Annual Meeting, Chicago, III. October 1963. (Automation and Scientific Communication, Topic 4: Symbolization, Transformation and Translation of Scientific information).",
      "doi": ""
    },
    {
      "text": "Reisner, P. (1966), *Evaluation of a 'Growing Thesaurus\" Paper presented at the Center for the Information Sciences, Seminar in the Information Sciences, Lehigh University, Bethlehem, Pa., March 10, 1966. Available as Research Paper RC-1662, August 9,1966, IBM Watson Research Center, Yorklown Heights, New York.",
      "doi": ""
    }
  ]
}