{
  "doi": "10.1145/317456.317465",
  "title": "Where the bugs are",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "47-53",
  "year": 1985,
  "badges": [],
  "abstract": "In this paper we propose one explanation of why some novice programs are buggier than others. Central to our explanation is the notion of merged goals/plans in which multiple goals are achieved in a single integrated plan. Our arguments are based on our theory of the knowledge — plans and goals — used by a novice in creating a program, and an analysis of actual buggy novice programs.",
  "tags": [],
  "authors": [
    {
      "name": "James C. Spohrer",
      "institution": "Department of Computer Science, Cognition and Programming Project, Yale University, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452612201",
      "orcid": "missing"
    },
    {
      "name": "Elliot Soloway",
      "institution": "Department of Computer Science, Cognition and Programming Project, Yale University, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528788",
      "orcid": "missing"
    },
    {
      "name": "Edgar Pope",
      "institution": "Department of Computer Science, Cognition and Programming Project, Yale University, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430599265",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bonar, j., Soloway, E. (1983) Uncovering Principles of Novice Programming, SIGPLAN-SIGACT Tenth Annual Symposium on Principles of Programming Languages, Austin, Tx.  ",
      "doi": "10.1145/567067.567069"
    },
    {
      "text": "Bonar. J. (1984) Underetanding the Bugs of Novice Proorarnmers. Ph.D. Dissertation, in press.",
      "doi": ""
    },
    {
      "text": "Brown, J.S. and Burton, R.R. (1078) \"Diagnostic Models for Procedural Bugs in Mathematics.~ Coonitive Science Y, (June}, 155-102.",
      "doi": ""
    },
    {
      "text": "Johnson, L. and Soloway, E. (1983) PROUST: Knowledge-Based 13.~gram Understanding. Technical Report 285, Dept. of Computer Science, Yale University, August.",
      "doi": ""
    },
    {
      "text": "Johnson, L., Soloway, E., Cutler, B. and Draper, S. (1983) BUG CATALOGUE: I. Technical Report 286, Dept. of Computer Science, Yale University, October.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K., Bonar, J., Greenspan, J. (1082) What Do Novices Know About Programming?, In Directions in Human-Computer Interactions, B. Shneiderman and A. Badre, Eds., Abhx, Inc.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K. (1984) Empirical Studies of Programming Knowledge, IEEE Transactions on Software Engineering, September.",
      "doi": "10.1109/TSE.1984.5010283"
    },
    {
      "text": "Spohrer, J., Pope, E., Lipman, M., Sack, W., Freiman, S., Littman, D., Johnson, L., and Soloway, E. (1984a) BUG CATALOGUE: II~lIl, IE. In preparation.",
      "doi": ""
    },
    {
      "text": "Spohrer, J., Pope, E., Lipman, M., Sack, W., Freiman, S., Littman, D., Johnson, L., Soloway, E.(lg84b) Iiule in Novice Prolrarno and Misconceptions in Novice Proorammers. Submitted for pubfication.",
      "doi": ""
    }
  ]
}