{
  "doi": "10.1145/317456.317472",
  "title": "Connecting theory and practice: a case study of achieving usability goals",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "85-88",
  "year": 1985,
  "badges": [],
  "abstract": "This paper describes a case study of the Human Factors design, development, and testing of a computer-based financial analysis package. The project applied the “usability goals” method proposed by Bennett (1984) to structure the definition, design, and testing of the new system. Learnability was defined as a key attribute in the product concept because of its salience in users' perception of system quality. The learnability attribute was assigned an operational definition in terms of time to mastery and error avoidance/recovery. The “back-to-front” strategy of Didner & Butler (1982) was applied for designing the menus. Empirical testing of user performance on sample problems in the alpha stage indicated that the new system surpassed the learnability objective. Lessons learned from this case study concern leverage in getting better managerial attention for Human Factors considerations in development projects, and clearer structure to direct needed research.",
  "tags": [],
  "authors": [
    {
      "name": "Keith A. Butler",
      "institution": "Boeing Computer Services, Advanced Technology Applications Division, Seattle, Washington",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100548093",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bennett, J. Managing to meet usability requirements- establishing and meeting software development goals. In J. Bennett, D. Case, J. Sandelin, &amp; M. Smith (Ed.s) Visual Display Terminals\" Usability Issues and Health Concerns. Englewood Cliffs, N. J.\" Prentice-Hall, 1984.",
      "doi": ""
    },
    {
      "text": "Didner, R. S. &amp; Butler, K. A. Information requirements for user decision support\" designing systems from back to front. In Proceedings of the International Conference on CybJernetics and Society (Seattle, Octo~er~ 1982), IEEE, pp.- 415-419.",
      "doi": ""
    },
    {
      "text": "Dzida, W., Herda, S., &amp; Itzfeldt, W. D.Userperceived quality of interactive systems. IEEE Transactions on Software Enqineering, vol. SE-4(4), (July, 1978), pp. 270-276.",
      "doi": "10.1109/TSE.1978.231511"
    },
    {
      "text": "Engel, S. E. &amp; Granda, R. E. Guidelines for man/display interfaces. IBM Techt~ical Report TR 00.2720, December 19, 1975.",
      "doi": ""
    },
    {
      "text": "Gilb, T. Software Metrics. Cambridge, Mass.\" Winthrop, 1977.",
      "doi": ""
    },
    {
      "text": "Gould, J. D. Designing for usability-key principles and what 6esigners think. In Proc. CHI'83 Human Factors in Computing Systems (Boston, December 12-15, 1983), ACIVi, New York, pp. 50-53.  ",
      "doi": "10.1145/800045.801579"
    },
    {
      "text": "Miller, D. P. The depth/breadth tradeoff in hierarchical computer menus. In Proc. of the Human Factors Society- 25th Annual Meeting, 1981.",
      "doi": ""
    },
    {
      "text": "Milne, F. &amp; Weber, R. The economics of designing generalized software. Communications of the ACM, 26(8), (Aug. 1983), 582-589.  ",
      "doi": "10.1145/358161.358169"
    },
    {
      "text": "Norman, D. Design principles for human-computer interfaces. In Proc. CHI'83 Human Factors in Computing Systems (Boston, December 12-15, 1983), ACM, New York, pp. 1-18.  ",
      "doi": "10.1145/800045.801571"
    },
    {
      "text": "Peterson, D. Screen design guidelines. Small Systems World, (Feb, 1981) pp. 19-21; 34-37.",
      "doi": ""
    },
    {
      "text": "Raduchel, W. A professional's perspective on user-friendliness. Byte, (May, 1984), 101-106.",
      "doi": ""
    },
    {
      "text": "Root, R. W. &amp; Draper, S. Questionnaires as a software evaluation tool. In Proc. CHI'83 Human Factors in Computing Systems ~(Bosi~on, December 12-15T 1983~, ACM, New York, pp. 83-87.  ",
      "doi": "10.1145/800045.801586"
    },
    {
      "text": "Wind, ~. W.; Grashof, J. F.; &amp; Goldhar, J. D. Market-based guidelines for design of industrial products. Journal of Marketinq, 42 (july, 1978) pp. 27-37.",
      "doi": ""
    }
  ]
}