{
  "doi": "10.1145/317456.317479",
  "title": "A comparison of symbolic and spatial filing",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "127-130",
  "year": 1985,
  "badges": [],
  "abstract": "The traditional and still dominant form of object reference in computing systems is symbolic - data files, programs, etc. are initially labeled and subsequently referred to by name. This approach is being supplemented on some systems by a spatial alternative which is often driven by an office or desktop metaphor (e.g. Apple's Lisa and MacIntosh systems, or Bolt's 1979 Spatial Data Management System). In such systems, an object is placed in a simulated two- or three-dimensional space, and can later be retrieved by pointing to its location. In order to begin to understand the relative merits of spatial and symbolic filing schemes for representing and organizing information, we compared four ways of filing computer objects. We found location information to be of limited utility, either by itself or in combination with symbolic information. This calls into question the generality and efficacy of the desktop metaphor for information retrieval.",
  "tags": [],
  "authors": [
    {
      "name": "Susan T. Dumais",
      "institution": "Bell Communications Research",
      "img": "/do/10.1145/contrib-81100134501/rel-imgonly/sdumais02.jpg",
      "acmid": "81100134501",
      "orcid": "missing"
    },
    {
      "name": "William P. Jones",
      "institution": "MCC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100554899",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolt, R. A. (1979). Filing and retrieving in the future - spatial data management. Paper presented at lnfotech 'User Friendly Systems\" State of the Art Conference, London.",
      "doi": ""
    },
    {
      "text": "Cole, I. (1982). Human aspects of office filing: implications for the electronic office. In Proceedings of the Human Factors Society - 26th Annual Meeting, Seattle, Wa.",
      "doi": ""
    },
    {
      "text": "Cristie, J. and Just, M. A. (1976). Remembering the location and content of sentences in a prose passage. Journal of Educational Psychology, 68, 702-710.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. (1983). How do people organize their desks? Implications for the design of office information systems. ACM Transactions on Office Information Systems, 1, 99-112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Mandler, J. M., Seegmiller, D. and Day, J. (1977). On the coding of spatial information. Memory and Cognition, 5, 1 O- 16.",
      "doi": ""
    },
    {
      "text": "Rothkopf, E. Z. (1971). Incidental memory for location of information in text. Journal of Verbal Learning and Verbal Behavior, 10, 608-613.",
      "doi": ""
    },
    {
      "text": "Zechmeister, E. B. and McKillip, J. (1971). Recall of place on a page. Journal of Educational Psychology, 63, 446-453.",
      "doi": ""
    }
  ]
}