{
  "doi": "10.1145/317456.317470",
  "title": "Selection from alphabetic and numeric menu trees using a touch screen: breadth, depth, and width",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "73-78",
  "year": 1985,
  "badges": [],
  "abstract": "Goal items were selected by a series of touch-menu choices among sequentially subdivided ranges of integers or alphabetically ordered words. The number of alternatives at each step, b, was varied, and, inversely, the size of the target area for the touch. Mean response time for each screen was well described by T = k+clogb, in agreement with the Hick-Hyman and Fitts' laws for decision and movement components in series. It is shown that this function favors breadth over depth in menus, whereas others might not. Speculations are offered as to when various functions could be expected.",
  "authors": [
    {
      "name": "T. K. Landauer",
      "institution": "Bell Communications Research, Morristown, N.J.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100552367",
      "orcid": "missing"
    },
    {
      "name": "D. W. Nachbar",
      "institution": "Bell Communications Research, Morristown, N.J.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100515133",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barnard, P.J., Morton, J., Long, J., and Ottley, E.A. Planning Menus For Display: Some Effects of Their Structure on User Performance. international Conference on Displays for Man.Machine Systems, London, April 1977, IEEE Publication 150. pp. 130-133.",
      "doi": ""
    },
    {
      "text": "Brosey, M., and Shneiderman, B. Two Experimental Comparisons of Relational and HierarchicaJ Data Models. IntemaUonal JoumaJ of Man-Machine Studies, 1978, 10, 625-637.",
      "doi": ""
    },
    {
      "text": "Card, S. K. User Perceptual Mechanisms in The Search of Computer Command Menus. Proceedings cf Human Factors In Computer Systems. Gaithersburg, MD, March 15-17, 1982. pp. 190-196.  ",
      "doi": "10.1145/800049.801779"
    },
    {
      "text": "Dumais, S.T. and Landausr, T.K., Describing Categories of Objects for Menu Retrieval Systems. Research Methods, Instruments and Computers, 1984, 16(2), 242-248.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. The Information Capacity of The Human Mote; System in Controlling The Amplitude of Movement. Jeurnal of Experimental Psychology, 1954, 47, 381-391.",
      "doi": ""
    },
    {
      "text": "Hyman, R. Stimulus Information as a Determinant of Reaction Time. Journal of Experimental Psychology, 1953, 45, 188-196.",
      "doi": ""
    },
    {
      "text": "KJger, J.l. The Depth/Breadth Tradeoff in The Design of Menu Driven User Interfaces. Intgmationai Journal of Man-Mach!ne Studies, 1984, 20, 201- 213.  ",
      "doi": "10.1016/S0020-7373%2884%2980018-8"
    },
    {
      "text": "Miller, D.P. The Depth/Breadth Tradeoff in Hierarchical Computer Menus. Proceedings of the Human Factors Society, 1981, 296-300.",
      "doi": ""
    },
    {
      "text": "Moyer, R.S. and Landauer, T.K. The Time Required for Judgments of Numerical Inequality. Nature, 1967, 215, 1519-1520.",
      "doi": ""
    },
    {
      "text": "Perlman, G. Making the Right Choices with Menus. Proceedings of INTERACT 84, 1984, pp. 291- 295.",
      "doi": ""
    },
    {
      "text": "Posner, M.I. Abstraction and The Process of Recognition. In J.T. Spence and G.H. Bower (Eds) Advances In Learning and Mob'vat/on, Vol. 3, NY Academic Press, 1969.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Design Issues and Experimental Results for Menu Selection Systems. CS Technical Report, University of Maryland Computer Science Department, July, 1983.",
      "doi": ""
    },
    {
      "text": "Snowbc:ry, K., Parkinson, S.R. and Sisson, N. Computer Display Menus. Ergonomics, 1983, 26, 699-712.",
      "doi": ""
    },
    {
      "text": "Welford, A.T. Choice Reaction Time: Basic Concepts. In A.T. Wefford (Ed) Reaction T/me, Academic Press, NY, 1980.",
      "doi": ""
    }
  ]
}