{
  "doi": "10.1145/317456.317493",
  "title": "Why is synthetic speech harder to remember than natural speech?",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "201-206",
  "year": 1985,
  "badges": [],
  "abstract": "Previous research has demonstrated that synthetic speech is less well recalled than natural speech. Luce et al (1983) concluded that this was because synthetic speech increases the effort involved in encoding and/or rehearsal of presented information. Results of the experiments described here, which involved ordered recall of lists of ten words spoken in either a synthetic or a natural voice, with repetition of the words as a measure of successful encoding, indicate that most of the memory deficit with synthetic speech is due to encoding difficulties, rather than problems with item retention. There is evidence that encoding synthetic speech involves more processing capacity than does encoding natural speech, but that once it is encoded it is stored just as efficiently.",
  "authors": [
    {
      "name": "John A. Waterworth",
      "institution": "Human Factors Division, British Telecom Research Laboratories, Martlesham Heath, IPSWICH, UK",
      "img": "/do/10.1145/contrib-81100397259/rel-imgonly/2014-08-0412.22.54.jpg",
      "acmid": "81100397259",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, J, \"Synthesis of speech from unrestricted speech\". Proceedings of the 7RFR, 4, 433-442 (1976).",
      "doi": ""
    },
    {
      "text": "Dailett, K M, \"Intelligibility and short-term memory in the repetition of digit strings.\" Journal of Speech and Hearing Research, 7, 362- 368 (1964).",
      "doi": ""
    },
    {
      "text": "House, A S, Williams, C E, Hecker, M H L, and Kryter, K D, \"Articulation-testing methods: Consonantal differentiation with a closedresponse set\". Journal of the Acoustical Society of America, 37, 158-166 (1965).",
      "doi": ""
    },
    {
      "text": "Luce, P A, Feustel, T C, and Pisoni, D B, \"Capacity Demands in Short-Term Memory for Synthetic and Natural Speech\". su,mn Factors, 25, 17-32 (1983).",
      "doi": ""
    },
    {
      "text": "Nooteboum, S G, \"The temporal organization of speech and the process of spoken-word recognition\". IPO Annual Progress ~port, 18, 32-36 (1983).",
      "doi": ""
    },
    {
      "text": "Pisoni, D B, \"Speeded classification of natural and synthetic speech in a lexical decision task\". Journal of the Acoustical Society of America, 70, $98 (1981).",
      "doi": ""
    },
    {
      "text": "Rabbitt, P, \"Recognition: Memory for words correctly heard in noise\". Psy(~c Science, 6, 383-384 (1966).",
      "doi": ""
    },
    {
      "text": "Rabbitt, P, \"Channel -capacity, intelligibility and immediate memory\". Quarterly Journal of Experimpntal Psychology, 20, 241-248 (1968).",
      "doi": ""
    },
    {
      "text": "Waterworth, J A, \"Interaction with machines by voice: a telecommunications perspective\". Behaviour and InformationTechnology, 3, 163- 177 (1984).",
      "doi": ""
    }
  ]
}