{
  "doi": "10.1145/317456.317469",
  "title": "Designing organizational interfaces",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "66-71",
  "year": 1985,
  "badges": [],
  "abstract": "This paper argues that it will become increasingly important to extend our concept of user interfaces for individual users of computers to include organizational interfaces for groups of users. A number of suggestions are given for how to develop a theoretical base for designing such interfaces. For instance, examples are used to illustrate how traditional cognitive points of view can be extended to include information processing by multiple agents in organizations. Examples of design implications from other perspectives such as motivational, economic, and political are also included.",
  "authors": [
    {
      "name": "Thomas W. Malone",
      "institution": "Sloan School of Management, Massachusetts Institue of Technology",
      "img": "/do/10.1145/contrib-81100548740/rel-imgonly/oct2010.jpg",
      "acmid": "81100548740",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyris, C. Some limits of rational man organizational theory, Public Administration Review, 1973, 253-267.",
      "doi": ""
    },
    {
      "text": "Brachman, R. J. &amp; Schmolze, J. G. An overview of the KL-ONE Knowledge Representation System, Cognitive Science, in press.",
      "doi": ""
    },
    {
      "text": "Cyert, R.M. &amp; March, J.G. A behavioral theory of the firm. Englewood Cliffs, N.J.: Prentice-Hall, 1963.",
      "doi": ""
    },
    {
      "text": "Corkill, D.D. &amp; Lesser, V.R. The use of meta-level control for coordination in a distributed problem solving network. Proceedings of the International Joint Conference on Artifical Intelligence, 1983.",
      "doi": ""
    },
    {
      "text": "Croft, W. B. &amp; Lefkowitz, L. S. Task support in an office system. Technical report, Department of Computer and Information Science, University of Massachusetts, Amherst, MA, 1984.",
      "doi": ""
    },
    {
      "text": "Denning, P. J. Electronic junk. Communications of the ACM, 1982, 25, 163-165.  ",
      "doi": "10.1145/358453.358454"
    },
    {
      "text": "Emmet, R. VNET or Gripenet? Datamation, November 1981, 27, 48-58.",
      "doi": ""
    },
    {
      "text": "Engelbart, D.C. Collaboration support provisions in Augment. Proceedings of the AFIPS 1984 Office Automation Conference, Los Angeles, CA, February, 1984.",
      "doi": ""
    },
    {
      "text": "Erman, L.D., Hayes-Roth, F., Lesser, V. R., &amp; Reddy, D.R. The Hearsay-II speech-understanding system: Integrating knowledge to resolve uncertainty. Computing Surveys, 1980, 12,213-253.  ",
      "doi": "10.1145/356810.356816"
    },
    {
      "text": "Fox, M., Greenberg, M., Sathi, A., Mattis, J., &amp; Rychener, M. \"Callisto: An intelligent Project Management System.\" Technical Report, Intelligent Systems Laboratory, Robotics Institute, Carnegie Mellon University, Pittsburgh, PA, November 1983.",
      "doi": ""
    },
    {
      "text": "Fernandez, E., Summers, R., &amp; Wood, C. Database security and integrity. Reading, M_A: Addison-Wesley, 1981. ",
      "doi": "10.5555/578277"
    },
    {
      "text": "Galbraith, J. Designing complex organizations. Reading, MA: Addison-Wesley, 1973. ",
      "doi": "10.5555/540368"
    },
    {
      "text": "Goldstein, I.P. &amp; Bobrow, D. Descriptions for a programming environment. Proceedings of the 1st Annual National Conference on Artificial Intelligence, Stanford, CA, August, 1980.",
      "doi": ""
    },
    {
      "text": "Hackman, J. R. &amp; Oldham, G.R. Work Redesign. Reading, MA: Addison-Wesley, 1980.",
      "doi": ""
    },
    {
      "text": "Herzberg, F. One more time: How do you motivate employees. Harvard Business Review, January/February, 1968, 53-62.",
      "doi": ""
    },
    {
      "text": "Hiltz, S. R. &amp; Turoff, M. The Network Nation: Human Communication via Computer. Reading, Mass.: Addison-Wesley, 1978. ",
      "doi": "10.5555/151072"
    },
    {
      "text": "Hurwicz, L. The design of resource allocation mechanisms. American Economic Review Papers and Proceedings, May 1973, 58, 1-30.",
      "doi": ""
    },
    {
      "text": "Kedzierski, B. \"Communication and Management Support in System Development Environments.\" Proceedings of the Conference on Human Factors in Computer Systems, Gaithersburg, MD, March, 1982.  ",
      "doi": "10.1145/800049.801775"
    },
    {
      "text": "Keen, P.G.W. &amp; Scott Morton, M.S. Decision support systems: An organizational perspective. Reading, Mass.: Addison-Wesley, 1978.",
      "doi": ""
    },
    {
      "text": "Kling, R. Social analyses of computing: Theoretical perspectives in recent empirical research. Computing Surveys, 1980, 12, 61-110.  ",
      "doi": "10.1145/356802.356806"
    },
    {
      "text": "Kornfeld, W. A. &amp; Hewitt, C. The scientific community metaphor. IEEE Transactions on Systems, Man. and Cybernetics, 1981, SMC-11, 24-33.",
      "doi": ""
    },
    {
      "text": "Likert, R. New Patterns of Management. McGraw-Hill, 1961.",
      "doi": ""
    },
    {
      "text": "dLowe, D. \"The Representation of Debate as a Basis for Information Storage and Retrieval.\" Unpublished Technical Report, Computer Science Dept., Stanford University, Stanford, CA January 1984.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. Heuristics for designing enjoyable user interfaces: Lessons from computer games. Proceedings of the Conference on Human Factors in Computer Systems. Gaithersburg, MD, March 15-17, 1982 (Reprinted in J. C. Thomas &amp; M. L. Schneider (Eds.) Human Factors in Computer Systems. Norwood, N.J. Ablex, 1984, pp. 1-12). ",
      "doi": "10.5555/818.819"
    },
    {
      "text": "Malone, T. W. Organizing Information Processing Systems: Parallels between Human Organizations and Computer Systems. Xerox Palo Alto Research Center Working Paper, Palo Alto, CA, August, 1982.",
      "doi": ""
    },
    {
      "text": "Malone, T.W. Organizational interfaces. In J. Carroll (Ed.), Cognitive Aspects of Human Computer Interaction. Cambridge, MA: MIT Press, in press.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. &amp; Lepper, M. R. Making learning fun: A taxonomy of intrinsic motivations for learning. In R. E. Snow &amp; M.J. Farr (Eds.), Aptitude, Learning, and Instruction III: Cognitive and Affective Process Analyses. Hillsdale, N.J.: Erlbaum, in press.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. &amp; Smith, S.A. Tradeoffs in designing organizations.\" Implications for new forms of human organizations and computer systems. Massachusetts Institute of Technology, Center for Information Systems Research Working Paper # 112, Sloan WP # 1541-84, March 1984.",
      "doi": ""
    },
    {
      "text": "March, J. G. &amp; Simon, H. A. Organizations. New York: Wiley, 1958.",
      "doi": ""
    },
    {
      "text": "Markus, L. Power, politics, and MIS implementation. Communications of the ACM. June 1983, pp. 430-444.  ",
      "doi": "10.1145/358141.358148"
    },
    {
      "text": "Marschak, J. &amp; Radner, R. Economic theory of teams. New Haven: Yale University Press, 1972.",
      "doi": ""
    },
    {
      "text": "McGregor, D. The Human Side of Enterprise. New York: McGraw-Hill, 1960.",
      "doi": ""
    },
    {
      "text": "Mintzberg, H. Power in and around organizations. Englewood Cliffs, N.J.: Prentice Hall, 1983.",
      "doi": ""
    },
    {
      "text": "Newell, A. Reasoning, Problem solving, and decision processes: The problem space as a fundamental category. In R. Nickerson ted.) Attention and Performance VIH, Hillsdale, N.J.: Erlbaum, 1980.",
      "doi": ""
    },
    {
      "text": "Newell, A. &amp; Simon, H.A. Human problem solving. Englewood Cliffs, N.J.: Prentice-Hall, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Norman, D.A. Design principles for human-computer interfaces. Proceedings of the CHI'83 Conference on Human Factors in Computing Systems. Boston, MA, December 12-15, 1983.  ",
      "doi": "10.1145/800045.801571"
    },
    {
      "text": "Pfeffer, J. P~wer in organizations. Marshfield, MA; l~i tman. 1981.",
      "doi": ""
    },
    {
      "text": "Rice, R. E. Impacts of computer-mediated organizational and interpersonal communication. In M. Williams (Ed.) Annual Review of Information Science and Technology, White Plains, N.Y.: Knowledge Industry Publications, 1980.",
      "doi": ""
    },
    {
      "text": "Rockart, J.F. Chief executives define their own data needs. Harvard Business Review, March/April 1979.",
      "doi": ""
    },
    {
      "text": "Roethlisberger, F. J. &amp; Dickson, W.J. Management and the Worker: An Account of a Research Program Conducted by the Western Electric Company, Hawthorne Works, Chicago. Cambridge, Ma.: Harvard University Press, 1939.",
      "doi": ""
    },
    {
      "text": "Saltzer, J. &amp; Schroeder, M. The protection of information in computer systems. Proceedings of the IEEE, September 1975, 63, 1278-1308.",
      "doi": ""
    },
    {
      "text": "Sarin, S. K. and Greif, I. \"Software for Interactive On- Line Conference.\" Proceedings of the ACM -SIGOA Conference on Office Information Systems, Toronto, Canada, June 1984.  ",
      "doi": "10.1145/800023.808333"
    },
    {
      "text": "Simon, H.A. The sciences of the artificial. Cambridge, MA: MIT Press, 1981. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Sirbu, M., Schoichet, S., Kunin, J.S., Hammer, M., &amp; Sutherland, J. OAM: An office analysis methodology. Behaviour and Information Technology, 1984, 3, 25-39.",
      "doi": ""
    },
    {
      "text": "Sluizer, S. and Cashman, P. \"XCP: An Experimental Tool for Managing Cooperative Activity.\" Proceedings of the ACM Computer Science Conference, New Orleans, LA, March 1985.  ",
      "doi": "10.1145/320599.320686"
    },
    {
      "text": "Smith R. G. &amp; Davis, R. Frameworks for Cooperation in distributed problem solving. IEEE Transactions on Systems.Man, and Cybernetics, 1981, SMC-I1, 61-69.",
      "doi": ""
    },
    {
      "text": "Trigg, R.H., and Weiser, M. \"TEXTNET: A Network- Based Approach to Text Handling.\" Unpublished Technical Report, Dept. of Computer Science, University of Maryland, College Park, MD, 1984.",
      "doi": ""
    },
    {
      "text": "Turoff, M. Information, value, and the internal marketplace. N.J. Institute of Technology, Unpublished manuscript, September, 1983.",
      "doi": ""
    },
    {
      "text": "Williamson, O. E. Markets and hierarchies. New York: Free Press, 1975.",
      "doi": ""
    },
    {
      "text": "Wilson, P. A., Maude, T. I., Marshall, C. J., &amp; Heaton, N. O. The active mailbox--Your on-line secretary. Proceedings of the IFIP 6.5 Working Conference on Computer-based Message Services, 'Nottingham, England, North Holland Publications, 1984. ",
      "doi": "10.5555/3586.3596"
    },
    {
      "text": "Zuboff, S. New worlds of computer-mediated work. Harvard Business Review, September-October 1982, 60, 142-152.",
      "doi": ""
    }
  ]
}