{
  "doi": "10.1145/317456.317485",
  "title": "Prompting, feedback and error correction in the design of a scenario machine",
  "published": "1985-04-01",
  "proctitle": "CHI '85: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "149-153",
  "year": 1985,
  "badges": [],
  "abstract": "The recent technical literature abounds with a variety of studies documenting and analyzing the problems people encounter in learning to use contemporary computer equipment. This has been a major focus of the recent work in our laboratory ([6], [9]). The project such work must entrain is the development of design approaches to these problems. We have been and are developing alternate designs for training manuals and for in-system training ([2], [4], [5], [7]).This paper is a report of work in progress in this area. We describe a design approach to in-system training referred to as the Scenario Machine, and describe some initial results from an empirical learning study of four scenario machines.",
  "authors": [
    {
      "name": "John M. Carroll",
      "institution": "User Interface Institute, IBM Thomas J. Watson Research Center, Yorktown Heights, NY",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    },
    {
      "name": "Dana S. Kay",
      "institution": "Department of Psychology, Yale University, Box 11A, Yale Station, New Haven, CT and User Interface Institute, IBM Thomas J. Watson Research Center, Yorktown Heights, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100544690",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Carroll, J.M. Designing MINIMALIST training material. Datamation, November 1, 1984, 30/18, 125-136.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. and Carrithers, C. Training wheels in a user interface. Communications of the ACM, 1984, 2 7, 800-806.  ",
      "doi": "10.1145/358198.358218"
    },
    {
      "text": "Carroll, J.M. and Carrithers, C. Blocking learner errors in a training wheels system. Human Factors, 1984, 26, 377-389.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., Ford, J.R., Smith-Kerker, P.A., and Mazur, S.A. Learning to use a word processor with the Minimal Manual. Psychonomics Society Annual Meeting, San Antonio TX, November 1984.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., Mack, R.L., Lewis, C.H., Grischkowsky, N.L., and Robertson, S.R. Learning to use a word processor by guided exploration. IBM Research Report, R C 10428, 1984 (submitted to Human-Computer Interaction).",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. and Mazur, S.A. Learning to use an office system with an on-line tutorial. IBM Research Report, R C 10644, 1984 (submitted to IEEE Transactions on Systems, Man and Cybernetics).",
      "doi": ""
    },
    {
      "text": "Galambos, J.A., Sebrechts, M.M., Wikler, E., and Black, J.B. A diagrammatic language for instruction of a menu-based word processing system. In S. Williams (Ed.) Humans and machines: The interface through language. Abtex: Norwood, NJ, 1984.",
      "doi": ""
    },
    {
      "text": "Hillen, J.R.C. Comparison of four different self-paced manuals. IBM Hursley Human Factors Laboratory, HF04 7, 1981.",
      "doi": ""
    },
    {
      "text": "Mack, R.L., Lewis, C.H., and Carroll, J.M. Learning to use office systems: Problems and prospects. ,4 CM Transactions on Office Information Systems, 1983, 1, 254-271.  ",
      "doi": "10.1145/357436.357440"
    },
    {
      "text": "Mayer, R.E.Elaboration techniques for technical text. Journal of Educational Psychology, 1980, 72, 770-784.",
      "doi": ""
    }
  ]
}