{
  "doi": "10.1145/1054972.1054987",
  "title": "Who gets to know what when: configuring privacy permissions in an awareness application",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "101-110",
  "year": 2005,
  "badges": [],
  "abstract": "We report on a study (N=36) of user preferences for balancing awareness with privacy. Participants defined permissions for sharing of location, availability, calendar information and instant messaging (IM) activity within an application called mySpace. MySpace is an interactive visualization of the physical workplace that provides dynamic information about people, places and equipment. We found a significant preference for defining privacy permissions at the group level. While \"family\" received high levels of awareness sharing, interestingly, \"team\" was granted comparable levels during business hours at work. Surprisingly, presenting participants with a detailed list of all pieces of personal context to which the system had access, did not result in more conservative privacy settings. Although location was the most sensitive aspect of awareness, participants were comfortable disclosing room-level location information to their team members at work. Our findings suggest utilizing grouping mechanisms to balance privacy control with configuration burden, and argue for increased system transparency to build trust.",
  "authors": [
    {
      "name": "Sameer Patil",
      "institution": "University of California, Irvine, CA",
      "img": "/do/10.1145/contrib-81100485151/rel-imgonly/81100485151.jpg",
      "acmid": "81100485151",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Lai",
      "institution": "IBM T. J. Watson Research Center, Hawthorne, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452599499",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, V., and Sellen, A., \"Design for Privacy in Ubiquitous Computing Environments\", In Proc. ECSCW 1993, pp. 75--90 (1993).]] ",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Boyle, M., Edwards, C, and Greenberg, S., \"The Effects of Filtered Video on Awareness and Privacy\", In Proc. CSCW 2000, pp. 1--10 (2000).]]  ",
      "doi": "10.1145/358916.358935"
    },
    {
      "text": "Bly, S.A., Harrison, S.R. and Irwin, S., \"Media Spaces: Bringing People Together in a Video, Audio, and Computing Environment\", Communications of the ACM, 36 (1), pp. 28--46 (1993).]]  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Cranor L. F., Reagle J., and Ackerman M. S., \"Beyond concern: Understanding Net Users' Attitudes About Online Privacy\", AT&T Labs Research Technical Report TR 99.4.3 (1999) http://www.research.att.com/projects/privacystudy/]]",
      "doi": ""
    },
    {
      "text": "Dourish P., and Bly, S., \"Portholes: Supporting Awareness in a Distributed Work Group\", In Proc. CHI 1992, pp. 541--547 (1992).]]  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Fogarty, J., Lai, J., and Christensen, J., \"Presence and Availability in a Context Aware Communication Client\", International Journal of Human Computer Studies, 61 (3), pp. 299--317 (2004).]]  ",
      "doi": "10.1016/j.ijhcs.2003.12.016"
    },
    {
      "text": "Gaver, W., Moran, T., MacLean, A., Lövstrand, L., Dourish, P., Carter, K., and Buxton, W., \"Realizing a Video Environment: EuroPARC's RAVE System\", In Proc. CHI 1992, pp. 27--35 (1992).]]  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Goffman, E., The Presentation of Self in Everyday Life, Doubleday, Garden City, NY (1959).]]",
      "doi": ""
    },
    {
      "text": "Greenburg, S., \"Peepholes: Low Cost Awareness of One's Community\", In Conf. Companion CHI 1996, pp. 206--207 (1996).]]  ",
      "doi": "10.1145/257089.257283"
    },
    {
      "text": "Grudin, J., \"Why CSCW Applications Fail: Problems in the Design and Evaluation of Organizational Interfaces\", In Proc. CSCW 1988, pp. 85--93 (1988).]]  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Harris, L. & Associates, and Westin A. F., \"E-commerce & Privacy: What Net Users Want\" Privacy & American Business, Hackensack, NJ (1998).]]",
      "doi": ""
    },
    {
      "text": "Herbsleb, J. D., Atkins, D. L., Boyer, D. G., Handel, M. and Finholt T. A., \"Introducing Instant Messaging and Chat in the Workplace\", In Proc. CHI 2002, pp. 171--178 (2002).]]  ",
      "doi": "10.1145/503376.503408"
    },
    {
      "text": "Hindus, D., Ackerman, M. S., Mainwaring, S., and Starr, B., \"Thunderwire: A Field Study of an Audio-only Media Space\", In Proc. CSCW 1996, pp. 238--247 (1996).]]  ",
      "doi": "10.1145/240080.240262"
    },
    {
      "text": "Hudson, S.E., and Smith, I. \"Techniques for Addressing Fundamental Privacy and Disruption Tradeoffs in Awareness Support Systems\", In Proc. CSCW 1996, pp. 248--257 (1996).]]  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Jarvenpaa, S.L., and Leidner, D., \"Communication and Trust in Global Virtual Teams\", Journal of Computer Mediated Communication, 3 (1998) http://www.ascusc.org/jcmc/vol3/issue4/jarvenpaa.html]]",
      "doi": ""
    },
    {
      "text": "Lederer, S., Beckmann, C., Dey, A. K., and Mankoff, J., \"Managing Personal Information Disclosure in Ubiquitous Computing Environments\", University of California, Berkeley, Computer Science Division Technical Report UCB-CSD-03-1257 (2003).]]",
      "doi": ""
    },
    {
      "text": "Lederer, S, Hong, J. I., Dey A. K., and Landay, J. A., \"Personal Privacy through Understanding and Action: Five Pitfalls for Designers\", Personal and Ubiquitous Computing, 8 (6), pp. 440--454 (2004).]]  ",
      "doi": ""
    },
    {
      "text": "Mark, G., Fuchs, L., and Sohlenkamp, M., \"Supporting Groupware Conventions through Contextual Awareness\" In Proc. ECSCW 1997, pp. 253--268 (1997).]] ",
      "doi": "10.5555/1241980.1241997"
    },
    {
      "text": "Moore, D. A., Kurtzberg, T. R., Thompson, L. L., and Morris, M. W., \"Long and Short Routes to Success in Electronically Mediated Negotiations: Group Affiliations and Good Vibrations\", Organizational Behavior and Human Decision Processes, 77 (1), pp. 22--43 (1999).]]",
      "doi": ""
    },
    {
      "text": "Palen, L., \"Social, Individual & Technological Issues for Groupware Calendar Systems\", In Proc. CHI 1999, pp. 17--24 (1999).]]  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Smith, I., and Hudson, S.E., \"Low Disturbance Audio for Awareness and Privacy in Media Space Applications\", In Proc. Multimedia 1995, pp. 91--97 (1995).]]  ",
      "doi": "10.1145/217279.215253"
    },
    {
      "text": "Richards, J., and Christensen J., \"People in Our Software\", ACM Queue, Feb. 2004 (2004).]]  ",
      "doi": "10.1145/971564.971596"
    },
    {
      "text": "Rotter, J., \"A New Scale for the Measurement of Interpersonal Trust. Journal of Personality\", 35, pp. 615--665 (1967).]]",
      "doi": ""
    },
    {
      "text": "Tang, J., Yankelovich, N., Begole, J., Van Kleek, M., and Li, F., \"ConNexus to Awarenex: Extending Awareness to Mobile Users\", In Proc. CHI 2001, pp. 221--228 (2001).]]  ",
      "doi": "10.1145/365024.365105"
    },
    {
      "text": "Want, R., Hopper, A., Falcão V., and Gibbons, J., \"The Active Badge Location System\", ACM Transactions on Information Systems, 10(1), pp. 91--102 (1992).]]  ",
      "doi": "10.1145/128756.128759"
    }
  ]
}