{
  "doi": "10.1145/1054972.1055090",
  "title": "Camera talk: making the camera a partial participant",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "839-848",
  "year": 2005,
  "badges": [],
  "abstract": "In this paper, we describe how encouraging children to talk to the camera can structure their behavior and provide them opportunity for reflection. Encouraging \"camera talk,\" interactions directed at the camera, can effectively elicit verbal comments from children participants. We describe a study in which children participants were told that they could tell the camera anything they wanted to about the designs they were making using a piece of educational software, but not to behave in a disruptive manner for the camera. By allowing children to interact with the camera in a particular way, rather than encouraging them to ignore its presence, we were able to elicit information about some children's design activities, thoughts, and struggles. The camera became an integral part of the socio-technical system for some children. This method may be useful to researchers interested in what children are thinking about in-the-moment as they work with software.",
  "authors": [
    {
      "name": "Kristin Kaster Lamberty",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/do/10.1145/contrib-81100168814/rel-imgonly/z-square-kk-headshot.jpg",
      "acmid": "81100168814",
      "orcid": "missing"
    },
    {
      "name": "Janet L. Kolodner",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452618006",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dourish, P. (2001). Where the Action Is: The Foundations of Embodied Interaction. Cambridge, MA: MIT Press. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Goldman-Segall, R. (1998). Points of Viewing Children's Thinking: A Digital Ethnographer's Journey. Mahwah, New Jersey: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Hiebert, J. and Carpenter, T. P. (1992). Learning and Teaching With Understanding. Handbook of Research on Mathematics Teaching and Learning. D. A. Grouws. New York, Macmillan Publishing Company: 65--97.",
      "doi": ""
    },
    {
      "text": "Hutchins, E. L., Hollan, J. D., and Norman, D. A. (1986). Direct Manipulation Interfaces. In Norman, D.A. and Draper, S.W. (eds.), User-Centered System Design: New Perspectives on Human-Computer Interaction. Erlbaum, Hillsdale, NJ, USA, 87--124.",
      "doi": ""
    },
    {
      "text": "Lamberty, K. K. and Kolodner, J. L. (2002). Exploring digital quilt design using manipulatives as a math learning tool. In Bell, P., Stevens, R., and Satwicz, T., editors, Keeping Learning Complex: The Proceedings of the Fifth International Conference of the Learning Sciences (ICLS), pp. 552--553, Mahwah, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Lamberty, K. K. & Kolodner, J. L. (2004). Towards a New Kind of Computational Manipulative: Children Learning Math and Designing Quilts with Manipulatives That Afford Both. Proc. IDC 2004, 143--144.  ",
      "doi": "10.1145/1017833.1017861"
    },
    {
      "text": "Meyrowitz, J. (1985). No Sense of Place: The Impact of Electronic Media on Social Behavior. New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Mishra, P. and Hershey, K. A. (2004). Human-computer etiquette: managing expectations with intentional agents: Etiquette and the design of educational technology. Communications of the ACM, 47(4).  ",
      "doi": "10.1145/975817.975843"
    },
    {
      "text": "Roschelle, J. (2000). Choosing and Using Video Equipment for Data Collection. Handbook of Research Design in Mathematics and Science Education. A.E. Kelly and R.A. Lesh. Mahwah, New Jersey, Lawrence Erlbaum Associates: 761--776.",
      "doi": ""
    },
    {
      "text": "Schön, D. A. (1987). Educating the Reflective Practitioner: Toward a New Design For Teaching and Learning in the Professions. San Francisco: Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "van Kesteren, I. E. H., Bekker, M.M., Vermeeren, A.P.O.S., and Lloyd, P.A. (2003). Assessing Usability Evaluation Methods On Their Effectiveness To Elicit Verbal Comments From Children Subjects. Proc. IDC 2003, 41--49.van Kesteren, I. E. H., Bekker, M.M., Vermeeren, A.P.O.S., and Lloyd, P.A. (2003). Assessing Usability Evaluation Methods On Their Effectiveness To Elicit Verbal Comments From Children Subjects. Proc. IDC 2003, 41--49.  ",
      "doi": "10.1145/953536.953544"
    },
    {
      "text": "Wildman, D. (1995). Getting the Most from Paired-User Testing. Interactions. July, 1995.  ",
      "doi": "10.1145/208666.208675"
    }
  ]
}