{
  "doi": "10.1145/1054972.1055062",
  "title": "Applying the lessons of the attack on the world trade center, 11th September 2001, to the design and use of interactive evacuation simulations",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "651-660",
  "year": 2005,
  "badges": [],
  "abstract": "The collapse of buildings, such as terminal 2E at Paris' Charles de Gaule Airport, and of fires, such as the Rhode Island, Station Night Club tragedy, has focused public attention on the safety of large public buildings. Initiatives in the United States and in Europe have led to the development of interactive simulators that model evacuation from these buildings. The tools avoid some of the ethical and legal problems from simulating evacuations; many people were injured during the 1993 evacuation of the World Trade Center (WTC) complex. They also use many concepts that originate within the CHI communities. For instance, some simulators use simple task models to represent the occupants' goal structures as they search for an available exit. However, the recent release of the report from the National Commission on Terrorist Attacks upon the United States (the '9/11 commission') has posed serious questions about the design and use of this particular class of interactive systems. This paper argues that simulation research needs to draw on insights from the CHI communities in order to meet some the challenges identified by the 9/11 commission.",
  "authors": [
    {
      "name": "C. W. Johnson",
      "institution": "University of Glasgow, Glasgow, Scotland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100451083",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "UK Atomic Energy Authority, A Technical Summary of the AEA Egress Code, AET/NOIL/27812001/002(2), Issue 1, Warrington UK, 2002.",
      "doi": ""
    },
    {
      "text": "W. Baker, J. Barnett, C. Marrion, J. Milke and H. Nelson, Chapter 2: WTC1 and WTC2. In Federal Emergency Management Agency, WTC Building Performance Study: Data Collection, Preliminary Observations and Recommendations. Washington D.C., 2002.",
      "doi": ""
    },
    {
      "text": "M. Batty, J. Desyllas, and E. Duxbury. Safety in Numbers? Modeling Crowds and Designing Control for the Notting Hill Carnival. Urban Studies, (40)8:1573--1590, 2003.",
      "doi": ""
    },
    {
      "text": "UK Building Research Establishment, Evacuation Modeling: GridFlow and CRISP, Watford, UK, 2004. Available on: http://www.bre.co.uk/frs/",
      "doi": ""
    },
    {
      "text": "P.J. Camp, J.M. Hudson, R.B. Keldorph, S. Lewis and E.D. Mynatt, Supporting communication and collaboration practices in safety-critical situations. ACM CHI 2000, v.2:249--250, 2000.  ",
      "doi": "10.1145/633292.633438"
    },
    {
      "text": "J.M. Carroll, Making Use: Scenario-Based Design of Human-Computer Interactions. MIT Press, Boston, 2000. ",
      "doi": "10.5555/517699"
    },
    {
      "text": "J.M. Carroll, R.L. Mack, S.P. Robertson and M.B. Rosson, Binding Objects to Scenarios of Use. Int. Journal of Human-Computer Studies, (41)1:243--276, 1994.  ",
      "doi": "10.1006/ijhc.1994.1058"
    },
    {
      "text": "H.H. Clark and S.E. Brennan. Grounding in communication. In L. B. Resnick, J. M. Levine, and S. D. Teasley, editors, Perspectives on Socially Shared Cognition, pages 127--149. American Psychological Association, Washington, DC, 1991.",
      "doi": ""
    },
    {
      "text": "K.H. Drager, G. Lovas, J. Wiklund, H. Soma, D. Duong, A. Violas and V. Laneres, EVACSIM - A comprehensive evacuation simulation tool. In Proc. of the 1992 Emergency Management and Engineering Conf., Soc. for Computer Simulation, Orlando, Florida, 101--108, 1992.",
      "doi": ""
    },
    {
      "text": "G. Fischer, A.C. Lemke, T. Mastaglio and A. I. Morch, Critiquing in Cooperative Problem Solving. ACM Trans on Information Systems, (9)2:123--151, 1991.  ",
      "doi": "10.1145/123078.128727"
    },
    {
      "text": "S.R. Fussell, R. E. Kraut, F.J.Lerch, W.L. Scherlis, M.M. McNally and J.J. Cadiz (1998). Coordination, overload and team performance. In Proc. of ACM CSCW'98, Seattle, Washington, 275--284, 1998.  ",
      "doi": "10.1145/289444.289502"
    },
    {
      "text": "S. Goldenstein, M. Karavelas, D. Metaxas, L. Guibas, E. Aaron and A. Goswami, Scalable nonlinear dynamical systems for agent steering and crowd simulation. Computers & Graphics (25)6:983--998, 2001.",
      "doi": ""
    },
    {
      "text": "J. Grudin, Groupware and Social Dynamics, Comms. of the ACM, (37)1:93--105, 1994.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "T. Haynes and S. Sen, Cases to Resolve Conflicts and Improve Group Behavior. Int. Journal of Human-Computer Studies, (48)1:31--49, 1998.  ",
      "doi": "10.1006/ijhc.1997.0159"
    },
    {
      "text": "B.D. Jacobs and P. Hart, Disaster at Hillsborough stadium. In D.J. Parker & J.W. Handmer (eds.), Hazard Management and Emergency Planning, James & James Science, London, 1992.",
      "doi": ""
    },
    {
      "text": "N. Latman, TCPP Personality Profile, In 4th Triennial International Fire and Cabin Safety Research Conference, Parque das Natoes, Lisbon, Portugal, 2004.",
      "doi": ""
    },
    {
      "text": "D. Laurillard, Interactive Media, Ellis Horwood, London, UK, 1987.",
      "doi": ""
    },
    {
      "text": "W.E. Mackay, Users and Customizable Software: A Co-Adaptive Phenomenon, MIT, 1990.",
      "doi": ""
    },
    {
      "text": "M. Mantei, R.M. Baecker, A. Sellen, W.A.S. Buxton, and T. Milligan, Experiences in the Use of Media Spaces. ACM CHI 1991, 203--208, 1991.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "H.A. Murray, Explorations in Personality, Oxford University Press, Oxford, UK, 1938.",
      "doi": ""
    },
    {
      "text": "B.A. Nardi, Context and Consciousness: Activity Theory and HCI, MIT Press, Boston, 1996. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "US National Commission on Terrorist Attacks Upon the United States, 9/11 Commission Report, Washington DC, 2004. Available on: http://www.9-11commission.gov.",
      "doi": ""
    },
    {
      "text": "P.A. Thompson and E.W. Marchant, Computer and fluid modeling of evacuation. Safety Science, (18)277--289, 1995.",
      "doi": ""
    },
    {
      "text": "K.D. Wu and L.A. Clark, Relations between personality traits and self-reports of daily behavior. Journal of Research in Personality, (37)231--256, 2003.",
      "doi": ""
    }
  ]
}