{
  "doi": "10.1145/1054972.1055064",
  "title": "A qualitative cross-national study of cultural influences on mobile data service design",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "661-670",
  "year": 2005,
  "badges": [],
  "abstract": "As the use of mobile data services has spread across the globe, the effect of cultural differences on user requirements has become important issue. To date, however, little research has been conducted on the role cultural factors play in the design of mobile data services. This paper proposes a set of critical design attributes for mobile data services that takes cross-cultural differences into account. To determine these attributes, we devised a qualitative method and conducted in-depth long interviews in Korea, Japan, and Finland. We found 52 attributes considered important by mobile data service users, and 11 critical attributes that showed a clear correlation with characteristics of the user's culture. The paper concludes with a discussion of limitations and of implications for developers of mobile data services.",
  "authors": [
    {
      "name": "Boreum Choi",
      "institution": "Yonsei University, Seoul, Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350594298",
      "orcid": "missing"
    },
    {
      "name": "Inseong Lee",
      "institution": "Yonsei University, Seoul, Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452593533",
      "orcid": "missing"
    },
    {
      "name": "Jinwoo Kim",
      "institution": "Yonsei University, Seoul, Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406599725",
      "orcid": "missing"
    },
    {
      "name": "Yunsuk Jeon",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414597360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cho, B., Kwon, U., Gentry, J.W., Jun, S., and Kropp, F. Cultural Values Reflected in Theme and Execution: A Comparative Study of U.S. and Korean Television Commercials. Journal of Advertising, 28, 4 (1999), 59--73.",
      "doi": ""
    },
    {
      "text": "Choong, Y.Y. and Salvendy, G. Design of icons for use by Chinese in mainland China. Interacting with Computers, 9, 4 (1998), 417--430.",
      "doi": ""
    },
    {
      "text": "De Angeli, A., Athavankar, U., Joshi, A., Coventry, L., and Johnson, G.I. Introducing ATMs in India: A Contextual Inquiry. Interacting with Computers, 16, 1 (2004), 29--44.",
      "doi": ""
    },
    {
      "text": "de Mooij, M. Consumer Behavior and Culture: Consequences for Global Marketing and Advertising. Sage Publications, Thousand Oaks, CA, 2003.",
      "doi": ""
    },
    {
      "text": "Evers, V. Human-Computer Interfaces: Designing for Culture. http://www.swi.psy.uva.nl/usr/evers/.",
      "doi": ""
    },
    {
      "text": "Ford, D.P., Connelly, C.E., and Meister, D.B. Information Systems Research and Hofstede's Culture's Consequences: An Uneasy and Incomplete Partnership. IEEE Transactions on Engineering Management, 50, 1 (2003), 8--25.",
      "doi": ""
    },
    {
      "text": "Hall, E.T. The Silent Language. Anchor Doubleday Press, Garden City, NY, 1959.",
      "doi": ""
    },
    {
      "text": "Hall, E.T. Beyond Culture. Anchor Doubleday Press, Garden City, NY, 1976.",
      "doi": ""
    },
    {
      "text": "Hiltunen, M., Laukka, M., and Luomala, J. Professional Mobile User Experience. IT Press, Edita, Finland, 2002.",
      "doi": ""
    },
    {
      "text": "Hofstede, G. Culture's Consequences: International Differences in Work-Related Values. Sage Publications, Beverly Hills, CA, 1980.",
      "doi": ""
    },
    {
      "text": "Hoft, N. Developing a Cultural Model. in Del Galdo E.M. and Nielsen J. eds. International User Interfaces, John Wiley & Sons, New York, NY, 1996, 41--73. ",
      "doi": "10.5555/241952.241954"
    },
    {
      "text": "Honold, P. Learning How to Use a Cellular Phone: Comparison Between German and Chinese Users. Technical Communication, 46, 2 (1999), 196--205.",
      "doi": ""
    },
    {
      "text": "Khaslavsky, J. Integrating culture into interface design. In Proc. CHI 98 conference summary on Human factors in computing systems, ACM Press (1998), 365--366.  ",
      "doi": "10.1145/286498.286830"
    },
    {
      "text": "Kuniavsky, M. Observing the User Experience: A Practitioner's Guide to User Research. Morgan Kaufmann, San Francisco, CA, 2003. ",
      "doi": "10.5555/1197887"
    },
    {
      "text": "Marcus, A. and Gould, E.W. Crosscurrents: Cultural Dimensions and Global Web User-Interface Design. Interactions, 7, 4 (2000), 32--46.  ",
      "doi": "10.1145/345190.345238"
    },
    {
      "text": "Miles, M.B. and Huberman, M. Qualitative Data Analysis: An Expanded Sourcebook. Sage Publications, Thousand Oaks, CA, 1994.",
      "doi": ""
    },
    {
      "text": "Nakakoji, K. Beyond Language Translation: Crossing the Cultural Divide. IEEE Software, 13, 6 (1996), 42--46.  ",
      "doi": "10.1109/52.542293"
    },
    {
      "text": "Rose, G.M., Evaristo, R., and Straub, D. Culture and Consumer Responses to Web Download Time: A Four-Continent Study of Mono-and Polychronism. IEEE Transactions on Engineering Management, 50, 1 (2002), 31--44.",
      "doi": ""
    },
    {
      "text": "Russo, P. and Boor, S. How Fluent is Your Interface? Designing for International Users. In Proc. the SIGCHI Conference on Human Factors in Computing Systems, ACM Press (1993), 342--347.  ",
      "doi": "10.1145/169059.169274"
    },
    {
      "text": "Straub, D.W., Loch, W., Aristo, R., Karahanna, E., and Strite, M. Toward a Theory-Based Measurement of Culture. Journal of Global Information Management, 10, 1 (2002), 13--23.",
      "doi": ""
    },
    {
      "text": "Van Someren, M.W., Barnard, Y.F., and Sandberg, J.A.C. The Think Aloud Method: A Practical Guide to Modelling Cognitive Processes. Academic Press, San Diego, CA, 1994.",
      "doi": ""
    },
    {
      "text": "Zakaria, N. and Stanton, J.M. Designing and Implementing Culturally-Sensitive IT Applications. Information Technology & People, 16, 1 (2003), 49--75.",
      "doi": ""
    }
  ]
}