{
  "doi": "10.1145/1054972.1055012",
  "title": "The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "281-290",
  "year": 2005,
  "badges": [],
  "abstract": "We present the bubble cursor - a new target acquisition technique based on area cursors. The bubble cursor improves upon area cursors by dynamically resizing its activation area depending on the proximity of surrounding targets, such that only one target is selectable at any time. We also present two controlled experiments that evaluate bubble cursor performance in 1D and 2D target acquisition tasks, in complex situations with multiple targets of varying layout densities. Results show that the bubble cursor significantly outperforms the point cursor and the object pointing technique [7], and that bubble cursor performance can be accurately modeled and predicted using Fitts' law.",
  "authors": [
    {
      "name": "Tovi Grossman",
      "institution": "University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. (2003). Refining Fitts' law models for bivariate pointing. ACM CHI Conference on Human Factors in Computing Systems. p. 193--200.  ",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "Aurenhammer, F. and Klein, R. (2000). Voronoi Diagrams. Chapter 5 in, in Handbook of computational geometry, J. Sack and J. Urrutia, Editors. North-Holland: Amsterdam, Netherlands. p. 201--290.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B., and Zierlinger, A. (2003). Drag-and-pop and drag-and-pick: Techniques for accessing remote screen content on touch- and pen-operated systems. Proceedings of Interact. p. 57--64.",
      "doi": ""
    },
    {
      "text": "Blanch, R., Guiard, Y., and Beaudouin-Lafon, M. (2004). Semantic pointing: improving target acquisition with control-display ratio adaptation. ACM CHI Conference on Human Factors in Computing Systems. p. 519--525.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Cockburn, A. and Firth, A. (2003). Improving the acquisition of small targets. British HCI Conference. p. 181--196.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47. p. 381--391.",
      "doi": ""
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. (2005 - in press). A probabilistic approach to modeling 2D pointing. To appear in ACM Transactions on Compute Human Interaction.  ",
      "doi": "10.1145/1096737.1096741"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. (2004). Object pointing: a complement to bitmap pointing in GUIs. Graphics Interface. p. 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Kabbash, P. and Buxton, W. (1995). The \"Prince\" technique: Fitts' law and selection using area cursors. ACM CHI Conference on Human Factors in Computing Systems. p. 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Keyson, D. (1997). Dynamic cursor gain and tactual feedback in the capture of cursor movements. Ergonomics, 12. p. 1287--1298.",
      "doi": ""
    },
    {
      "text": "MacKenzie, S. (1992). Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 7. p. 91--139.",
      "doi": ""
    },
    {
      "text": "MacKenzie, S. and Buxton, W. (1992). Extending Fitts' law to two-dimensional tasks. ACM CHI Conference on Human Factors in Computing Systems. p. 219--226.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "McGuffin, M. (2002). Fitts' law and expanding targets: an experimental study and applications to user interface design, M.Sc. Thesis, Department of Computer Science, University of Toronto.",
      "doi": ""
    },
    {
      "text": "McGuffin, M. and Balakrishnan, R. (2002). Acquisition of expanding targets. ACM CHI Conference on Human Factors in Computing Systems. p. 57--64.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., and Hudson, S. (1997). Making computers easier for older adults to use: area cursors and sticky icons. ACM CHI Conference on Human Factors in Computing Systems. p. 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Zhai, S., Buxton, W., and Milgram, P. (1994). The \"Silk Cursor\": Investigating transparency for 3D target acquisition. ACM CHI Conference on Human Factors in Computing Systems. p. 459--464.  ",
      "doi": "10.1145/191666.191822"
    },
    {
      "text": "Zhai, S., Conversy, S., Beaudouin-Lafon, M., and Guiard, Y. (2003). Human on-line response to target expansion. ACM CHI Conference on Human Factors in Computing Systems. p. 177--184.  ",
      "doi": "10.1145/642611.642644"
    }
  ]
}