{
  "doi": "10.1145/1054972.1055029",
  "title": "Supporting efficient development of cognitive models at multiple skill levels: exploring recent advances in constraint-based modeling",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "411-420",
  "year": 2005,
  "badges": [],
  "abstract": "This paper presents X-PRT, a new cognitive modeling tool supporting activities ranging from interface design to basic cognitive research. X-PRT provides a graphical model development environment for the CORE constraint-based cognitive modeling engine [7,13,21]. X-PRT comprises a novel feature set: (a) it supports the automatic generation of predictive models at multiple skill levels from a single task-specification, (b) it supports a comprehensive set of modeling activities, and (c) it supports compositional reuse of existing cognitive/perceptual/motor skills by transforming high-level, hierarchical task descriptions into detailed performance predictions. Task hierarchies play a central role in X-PRT, serving as the organizing construct for task knowledge, the locus for compositionality, and the cognitive structures over which the learning theory is predicated. Empirical evidence supports the role of task hierarchies in routine skill acquisition.",
  "authors": [
    {
      "name": "Irene Tollinger",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100374934",
      "orcid": "missing"
    },
    {
      "name": "Richard L. Lewis",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100350115",
      "orcid": "missing"
    },
    {
      "name": "Michael McCurdy",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100329457",
      "orcid": "missing"
    },
    {
      "name": "Preston Tollinger",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100374936",
      "orcid": "missing"
    },
    {
      "name": "Alonso Vera",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100219909",
      "orcid": "missing"
    },
    {
      "name": "Andrew Howes",
      "institution": "Cardiff University, Cardiff, UK",
      "img": "/do/10.1145/contrib-81100489674/rel-imgonly/mypicture.jpg",
      "acmid": "81100489674",
      "orcid": "0000-0003-4251-1127"
    },
    {
      "name": "Laura Pelton",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023369",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R., Bothell, D., Byrne, M. D., Douglass, S., Lebiere, C., & Qin, Y. (in press). An integrated theory of mind. Psychological Review.",
      "doi": ""
    },
    {
      "text": "Baskin, J. D., John, B. E. (1998). Comparison of GOMS Analysis Methods Late Breaking Results: Ubiquitous Usability Engineering. Proceedings of Conference on Human Factors in Computing Systems, v.2 p.261--262.  ",
      "doi": "10.1145/286498.286742"
    },
    {
      "text": "Beyer, H., Holtzblatt, K. Contextual Design. Contextual Design: A Customer-Centered Approach to Systems Designs, Morgan Kaufman, 1998. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Card, S. K., Moran, T.P. and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, USA (1983). ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Gong, R. (1993). Validating and refining the GOMS model methodology for software user interface design and evaluation. Ph.D. dissertation, University of Michigan. ",
      "doi": "10.5555/194400"
    },
    {
      "text": "Gray, W. D., John, B. E., & Atwood, M. E. (1993). Project Ernestine: Validating GOMS for predicting and explaining real-world task performance. Human Computer Interaction., 8(3), 237--309.",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "Howes, A., Vera, A. H., Lewis, R. L., and McCurdy, M. (2004). Cognitive constraint modeling: A formal approach to supporting reasoning about behavior. Proceedings of the Twenty Fifth Conference of the Cognitive Science Society, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "John, B., E., Kieras, D., E. (1996). The GOMS family of user interface analysis techniques: comparison and contrast. ACM Transactions on Computer-Human Interaction, Volume 3, Issue 4 pg. 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D. D., Koedinger, K. (2004). Predictive Human Performance Modeling Made Easy. Proceedings of the conference on Human factors in computing systems, Vienna, Austria.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "John, B. E., Vera, A., Matessa, M., Freed, M., Remington, R., (2002). Automating CPM-GOMS. Proceedings of the Conference on Human factors in computing systems, Minneapolis, MN.  ",
      "doi": "10.1145/503376.503404"
    },
    {
      "text": "Kieras, D. E., Wood, S. D., Abotel, K., and Hornof, A. (1995). GLEAN: A Computer-Based Tool for Rapid GOMS Model Usability Evaluation of User Interface. Proceedings of the ACM Symposium on User Interface Software and Technology, ACM Press, pg 91--100.  ",
      "doi": "10.1145/215585.215700"
    },
    {
      "text": "Koedinger, K. R., Aleven, V., Heffernan, N., McLaren, B. M., and Hockenberry, M. (2004). Opening the Door to Non-Programmers: Authoring Intelligent Tutor Behavior by Demonstration. Proceeding of Intelligent Tutoring Systems Conference, Maceio, Brazil.",
      "doi": ""
    },
    {
      "text": "Lewis, R.L., Vera, A. H., and Howes, A. (2004). A constraint-based approach to understanding the composition of skill. Proceedings of the Sixth International Conference on Cognitive Modeling, Pittsburgh, PA.",
      "doi": ""
    },
    {
      "text": "Matessa, M. (2004) An ACT-R Framework for Interleaving Templates of Human Behavior. Proceedings of the Twenty-sixth Annual Conference of the Cognitive Science Society, Chicago IL.",
      "doi": ""
    },
    {
      "text": "Meyer, D. E., & Kieras, D. E. (1997). A computational theory of executive cognitive processes and multiple-task performance: Part 1. Basic mechanisms. Psychological Review, 104, 3--65.",
      "doi": ""
    },
    {
      "text": "Ritter, F. E., Van Rooy, D., & St. Amant, R. (2002). A user modeling design tool based on a cognitive architecture for comparing interfaces. Proceedings of the 4th International Conference on Computer-Aided Design of User Interfaces 111--118. Dordrecht, NL.",
      "doi": ""
    },
    {
      "text": "Ritter, F. E., & Young, R. M. (2001). Embodied models as simulated users: Introduction to this special issue on using cognitive models to improve interface design. International Journal of Human-Computer Studies, 55, 1--14.",
      "doi": "10.1006/ijhc.2001.0471"
    },
    {
      "text": "Salvucci, D. D., & Lee, F. J. (2003). Simple cognitive modeling in a complex cognitive architecture. Proceedings of the conference on Human Factors in Computing Systems (pg. 265--272). New York, NY.  ",
      "doi": "10.1145/642611.642658"
    },
    {
      "text": "St. Amant, R., & Ritter, F. E. (2004). Automated GOMS to ACT-R model generation. In submitted to the International Conference on Cognitive Modeling. 26--31. Mahwah, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Taatgen, N.A. & Lee, F.J. (2003). Production Compilation: A simple mechanism to model Complex Skill Acquisition. Human Factors, 45(1), 61--76.",
      "doi": ""
    },
    {
      "text": "Vera, A. H., Howes, A., McCurdy, M., and Lewis, R. L. (2004). A constraint satisfaction approach to predicting skilled interactive cognition. Proceedings of the Conference on Human Factors in Computing Systems, Vienna, Austria.  ",
      "doi": "10.1145/985692.985708"
    },
    {
      "text": "G.R. Yost, Taql: A Problem Space Tool for Expert-System Development, doctoral dissertation, Carnegie Mellon Univ., Pittsburgh, Pa., 1992. ",
      "doi": "10.5555/171449"
    }
  ]
}