{
  "doi": "10.1145/1054972.1055052",
  "title": "Distract-R: rapid prototyping and evaluation of in-vehicle interfaces",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "581-589",
  "year": 2005,
  "badges": [],
  "abstract": "As driver distraction from in-vehicle devices increasingly becomes a concern on our roadways, researchers have searched for better scientific understanding of distraction along with better engineering tools to build less distracting devices. This paper presents a new system, Distract-R, that allows designers to rapidly prototype and evaluate new in-vehicle interfaces. The core engine of the system relies on a rigorous cognitive model of driver performance, which the system integrates with models of behavior on the prototyped interfaces to generate predictions of distraction. Distract-R allows a designer to prototype basic interfaces, demonstrate possible tasks on these interfaces, specify relevant driver characteristics and driving scenarios, and finally simulate, visualize, and analyze the resulting behavior as generated by the cognitive model. The paper includes two sample studies that demonstrate the system's ability to account for effects of input modality and driver age on performance.",
  "authors": [
    {
      "name": "Dario D. Salvucci",
      "institution": "Drexel University, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100289294",
      "orcid": "missing"
    },
    {
      "name": "Mark Zuber",
      "institution": "Drexel University, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328491196",
      "orcid": "missing"
    },
    {
      "name": "Ekaterina Beregovaia",
      "institution": "Drexel University, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100070891",
      "orcid": "missing"
    },
    {
      "name": "Daniel Markley",
      "institution": "Drexel University, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100421673",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R., & Lebiere, C. (1998). The atomic components of thought. Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T.P. and Newell, A. (1983). The psychology of human-computer interaction. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Green, P. (1999). The 15-second rule for driver information systems. In ITS America Ninth Annual Meeting Conference Proceedings. Washington, D.C.: Intelligent Transportation Society of America.",
      "doi": ""
    },
    {
      "text": "Hendricks, D. L., Freedman, M., Zador, P. L., & Fell, J. C. (2001). The relative frequency of unsafe driving acts in serious traffic crashes. Report for Contract No. DTNH22-94-C-05020, National Highway Traffic Safety Administration, U.S. Department of Transportation.",
      "doi": ""
    },
    {
      "text": "Hudson, S. E., John, B. E., Knudsen, K., and Byrne, M. D. (1999). A tool for creating predictive performance models from user interface demonstrations. CHI Letters 1 (1), 93--102.",
      "doi": ""
    },
    {
      "text": "IVIS DEMAnD Prototype Software User's Manual, pub. No. 00-136, USDOT, Aug. 2000, http://www.tfhrc.gov/humanfac/00-136.pdf.",
      "doi": ""
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D. D., & Koedinger, K. (2004). Predictive human performance modeling made easy. In Human Factors in Computing Systems: CHI 2004 Conference Proceedings (pp. 455--462). New York: ACM Press.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "John, B. E., Salvucci, D. D., Centgraf, P., & Prevas, K. (2004). Integrating models and tools in the context of driving and in-vehicle devices. In Proceedings of the Sixth International Conference on Cognitive Modeling.",
      "doi": ""
    },
    {
      "text": "Landay, J. A., & Myers, B. A. (1995). Interactive sketching for the early stages of user interface design. In Proceedings of Human Factors in Computing Systems: CHI 95 (pp. 43--50). New York: ACM Press.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "Paganelli, L., & Paternòò, F. (2003). A tool for creating design models from web site code. International Journal of Software Engineering and Knowledge Engineering, 13, 169--189.",
      "doi": ""
    },
    {
      "text": "Reed, M. P & Green, P. A. (1999). Comparison of driving performance on-road and in a low-cost driving simulator using a concurrent telephone dialing task. Ergonomics, 42, 1015--1037.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. D. (2001). Predicting the effects of in-car interface use on driver performance: An integrated model approach. International Journal of Human-Computer Studies, 55, 85--107.",
      "doi": "10.1006/ijhc.2001.0472"
    },
    {
      "text": "Salvucci, D. D. (2002). Modeling driver distraction from cognitive tasks. In Proceedings of the 24th Annual Conference of the Cognitive Science Society (pp. 792--797). Mahwah, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. D. (to appear). Modeling driver behavior in a cognitive architecture. Human Factors.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. D., Chavez, A. K., & Lee, F. J. (2004). Modeling effects of age in complex tasks: A case study in driving. To appear in Proceedings of the 26th Annual Conference of the Cognitive Science Society.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. D., John, B. E., Prevas, K., & Centgraf, P. (2005). Rapid development of keystroke-level models for on- and off-the-desktop interfaces. Manuscript in preparation.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. D., & Lee, F. J. (2003). Simple cognitive modeling in a complex cognitive architecture. In CHI 2003 Conference Proceedings (pp. 265--272). New York: ACM Press.  ",
      "doi": "10.1145/642611.642658"
    },
    {
      "text": "St. Amant, R., & Ritter, F. E. (2005). Specifying ACT-R models of user interaction with a GOMS language. Cognitive Systems Research. 6, 71--88.  ",
      "doi": "10.1016/j.cogsys.2004.09.008"
    },
    {
      "text": "Tijerina, L., Johnston, S., Parmer, E., Winterbottom, M.D., and Goodman, M. (2000). Driver Distraction with Route Guidance Systems (Technical Report DOT HS 809 069), East Liberty, OH: National Highway Traffic Safety Administration.",
      "doi": ""
    }
  ]
}