{
  "doi": "10.1145/1054972.1055046",
  "title": "Livenotes: a system for cooperative and augmented note-taking in lectures",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "531-540",
  "year": 2005,
  "badges": [],
  "abstract": "We describe Livenotes, a shared whiteboard system and educational practice that uses wireless communication and tablet computing to support real-time conversations within small groups of students during lectures, independent of class size. We present an interface design that enables group members to interact with one another by taking lecture notes cooperatively, as well as to augment student note-taking by providing instructor slides in the background to annotate over. Livenotes was designed to facilitate more efficient, stimulating modes of learning that other collaborative approaches do not. We report how the system impacts cooperative learning in an undergraduate class and how students interacted with background slides in the workspace. We conclude with directions for improving the system and learning practice.",
  "authors": [
    {
      "name": "Matthew Kam",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100222950",
      "orcid": "missing"
    },
    {
      "name": "Jingtao Wang",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81490672860/rel-imgonly/jingtaow_full.jpg",
      "acmid": "81490672860",
      "orcid": "missing"
    },
    {
      "name": "Alastair Iles",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100098292",
      "orcid": "missing"
    },
    {
      "name": "Eric Tse",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100271605",
      "orcid": "missing"
    },
    {
      "name": "Jane Chiu",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328487987",
      "orcid": "missing"
    },
    {
      "name": "Daniel Glaser",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430599887",
      "orcid": "missing"
    },
    {
      "name": "Orna Tarshish",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100424146",
      "orcid": "missing"
    },
    {
      "name": "John Canny",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415489",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrahamson, A. L. Teaching With Classroom Communication System - What It Involves and Why It Works. Presented at the 7th International Workshop New Trends in Physics Teaching, Puebla, Mexico, May 27-30, 1999.]]",
      "doi": ""
    },
    {
      "text": "Anderson, R. J., Hoyer, C., Wolfman, S., and Anderson, R. A Study of Digital Ink in Lecture Presentation. In Proceedings of CHI 2004 (Vienna, Austria), April 24-29, 2004.]]  ",
      "doi": "10.1145/985692.985764"
    },
    {
      "text": "Bell, P. Designing for Students' Conceptual Change in Science Using Argumentation and Classroom Debate. Graduate School of Education, University of California, Berkeley (1998).]] ",
      "doi": "10.5555/928669"
    },
    {
      "text": "Bransford, J, Brown, A., and Cocking, R. (Eds.). How People Learn: Mind, Experience and School. National Academy of Sciences (1999). http://bob.nap.edu/html/howpeople1/]]",
      "doi": ""
    },
    {
      "text": "Davis, R., et al. NotePals: Lightweight Note Sharing by the Group, for the Group. In Proceedings of CHI '99. ACM Press, pp. 338--345.]]  ",
      "doi": "10.1145/302979.303107"
    },
    {
      "text": "Dillenbourg, P. Collaborative Learning: Cognitive and Computational Approaches. Elsevier Science Ltd, Oxford, UK (1999).]]",
      "doi": ""
    },
    {
      "text": "Dufresne, R. J., Gerace, W. J., Leonard, W. J., Mestre, J. P., and Wenk, L. Classtalk: A Classroom Communication System for Active Learning. In Journal of Computing in Higher Education, 7, 3--47, 1996.]]",
      "doi": ""
    },
    {
      "text": "Hartley, J. Note-Taking: A Critical Review. Programmed Learning and Educational Technology (1978), 15, 207--224.]]",
      "doi": ""
    },
    {
      "text": "Iles, A., Glaser, D., Kam, M., and Canny, J. Learning via Distributed Dialogue: Livenotes and Handheld Wireless Technology. In Proceedings of Computer Support for Collaborative Learning '02 (Boulder, CO, January 2002), Lawrence Erlbaum Associates, New Jersey NY, 408--417.]] ",
      "doi": "10.5555/1658616.1658673"
    },
    {
      "text": "Iles, A., Kam, M., and Glaser, D. Dimensions of Identity in Open Educational Settings. In Adjunct Proceedings of the 5th International Conference on Ubiquitous Computing (Seattle, WA, October 2003), 175--176.]]",
      "doi": ""
    },
    {
      "text": "Johnson, D., and Johnson, R. Cooperation and Competition: Theory and Research. Interaction Book Company, Minnesota (1989).]]",
      "doi": ""
    },
    {
      "text": "Johnson, D., Johnson, R., and Smith, K. Active Learning: Cooperation in the College Classroom. Interaction Book Company, Minnesota (1998).]]",
      "doi": ""
    },
    {
      "text": "Kam, M., Tarshish, O., Glaser, D., Iles, A., and Canny, J. Communicating through Handheld Wireless Tablets: Livenotes and Shared Group Awareness. In Supplemental Proceedings of ACM Conference on CSCW '02 (New Orleans, LA, November 2002). ACM Press.]]",
      "doi": ""
    },
    {
      "text": "Kiewra, K.A., Dubois, N.F., Christian, D., and McShane, A. Providing Study Notes: Comparison of Three Types of Notes for Review. Journal of Educational Psychology (1988), 80, 595--597.]]",
      "doi": ""
    },
    {
      "text": "Koschmann, T. Toward a Dialogic Theory of Learning: Bakhtin's Contribution to Understanding Learning in Settings of Collaboration. In Proceedings of Conference on Computer Support for Collaborative Learning (December 1999).]] ",
      "doi": "10.5555/1150240.1150278"
    },
    {
      "text": "Mazur, E. Peer Instruction: A User's Manual. Prentice-Hall, New Jersey, 1997.]]",
      "doi": ""
    },
    {
      "text": "Ploetzner, R., Dillenbourg, P., Preier, M., and Traum, D. Learning by Explaining to Oneself and to Others. Dillenbourg, P. (Ed). Collaborative Learning: Cognitive and Computational Approaches. Elsevier Science Ltd (1999), Oxford, UK, 103--121.]]",
      "doi": ""
    },
    {
      "text": "Scardamalia, M., and Bereiter, C. Text-based and Knowledge-based Questioning by Children. Cognition and Instruction (1992), 9, 177--199.]]",
      "doi": ""
    },
    {
      "text": "Singh, G., Denoue, L., and Das, A. Collaborative Note-Taking. In Proceedings of the International Workshop on Wireless and Mobile Technologies in Education (Taiwan), 2004.]] ",
      "doi": "10.5555/977408.978767"
    },
    {
      "text": "Smith, R., Sipusic, M., and Pannoni, R. Distributed Tutored Video Instruction: Experiments Comparing Face-to-Face with Virtual Collaborative Learning. In Proceedings of Conference on Computer Support for Collaborative Learning (December 1999), 558--566.]] ",
      "doi": "10.5555/1150240.1150308"
    },
    {
      "text": "Truong, K.N., and Abowd, G.D. StuPad: Integrating Student Notes with Class Lectures. Extended Abstracts of CHI, ACM Press (1999), 208--209.]]  ",
      "doi": "10.1145/632716.632846"
    },
    {
      "text": "Wenger, E., Pea, R. et al, Communities of Practice: Learning, Meaning, and Identity, Cambridge University Press, ISBN: 0521663636, 1998.]]",
      "doi": ""
    },
    {
      "text": "Wittrock, M. Generative Processes of Comprehension. Educational Psychologist, 1990, 345--376.]]",
      "doi": ""
    }
  ]
}