{
  "doi": "10.1145/1054972.1055050",
  "title": "Calling while driving: effects of providing remote traffic context",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "561-569",
  "year": 2005,
  "badges": [],
  "abstract": "Cell phone conversations distract drivers. This research explores the possibility of reducing distracting by providing callers with remote information about the driver's traffic. We asked whether providing such contextual information would change the caller's conversation such that drivers would be less distracted. In Experiment 1 we examined this question in a low-fidelity driving simulator; in Experiment 2 we examined this question in a higher fidelity simulator. In both experiments, remote callers and passengers were distracting. Providing traffic information to the remote caller significantly reduced crashes in the low fidelity tests and significantly reduced passing in the high fidelity tests, compared with the control conditions. We consider the implications for development of remote displays or signals to promote driving safety.",
  "tags": [
    "cognitive load",
    "attention",
    "contextual information",
    "driving",
    "contextual displays",
    "distraction",
    "cell phones",
    "interruption"
  ],
  "authors": [
    {
      "name": "Mike Schneider",
      "institution": "Carnegie Mellon University, Pittsburgh PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100156639",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon University, Pittsburgh PA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AAA Foundation for Traffic Safety. (2003). Distractions in everyday driving. Downloaded from http://www.aaafoundation.org/home/",
      "doi": ""
    },
    {
      "text": "Baddeley, A. D. (1996). Exploring the central executive. Quarterly Journal of Experimental Psychology, 49A, 5--28.",
      "doi": ""
    },
    {
      "text": "Bavelas, J. B., Chovil, N., Coates, L., & Roe, L. (1995). Gestures specialized for dialogue. Personality & Social Psychology Bulletin, 21, 394--405.",
      "doi": ""
    },
    {
      "text": "Cellular-news.com (2004). Countries that ban cell phones while driving. Downloaded from: http://www.cellular news.com/car_bans/",
      "doi": ""
    },
    {
      "text": "Clark, H. H., & Brennan, S. E. (1990). Grounding in communication. In L. B. Resnick, R. M. Levine, and S. D. Teasley (eds.), Perspectives on socially shared cognition (127--149). Washington, D.C.: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Clark, H. H. & Marshall, C. R. (1981). Definite reference and mutual knowledge. In A. K. Joshi, B. L. Webber, & I. A. Sag (eds.), Elements of discourse understanding (10--63). Cambridge: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Fairclough, S.H., Ashby, M. C., Ross, T., & Parkes, A. M. (1991). Effects of handsfree telephone use on driving behavior. Proceedings of the ISATA Conference, Florence, Italy. ISBN 0-947719458, 403--408.",
      "doi": ""
    },
    {
      "text": "Fiorentino, D. D., and Parseghian, Z. (1997). Time-to collision: A sensitive measure of driver interaction with traffic in a simulated driving task. Proceedings of the Human Factors and Ergonomics Society, 41st Annual Meeting (1028--1031). Albuquerque, New Mexico.",
      "doi": ""
    },
    {
      "text": "Haigney, D., & Westerman, S. J. (2001). Mobile (cellular) phone use and driving: A critical review of research methodology, Ergonomics, 44, 132--143.",
      "doi": ""
    },
    {
      "text": "Hopkins, J., Parseghian, Z. and Allen, W, (1997). A driving simulator evaluation of active warning signs (921--925). Proceedings of the Human Factors and Ergonomics Society, 41st Annual Meeting, Albuquerque, New Mexico.",
      "doi": ""
    },
    {
      "text": "Insurance Information Institute. (2003). Cell phones and driving. Downloaded from http://www.iii.org/media/hottopics/insurance/cellphones",
      "doi": ""
    },
    {
      "text": "Isaacs, E. A., & Clark, H. H. (1987). References in conversation between experts and novices. Journal of Experimental Psychology, 116, 26--37.",
      "doi": ""
    },
    {
      "text": "Kames, A. J. (1978). A study of the effects of mobile telephone use and control unit design on driving performance. IEEE Transactions on Vehicular Technology, VT-27, 282--287.",
      "doi": ""
    },
    {
      "text": "Manalavan, P., Samar, A., Schneider, M., Kiesler, S., & Siewiorek, D. (2002). In-car cell phone use: Mitigating risk by signaling remote callers (790-791). CHI 2002 Conference on Human Factors in Computing Systems: Extended Abstracts. Minneapolis.  ",
      "doi": "10.1145/506443.506599"
    },
    {
      "text": "McKnight, A. J., & McKnight, A. S. (1993). The effect of cellular phone use upon driver attention. Accident Analysis and Prevention, 25, 259--265.",
      "doi": ""
    },
    {
      "text": "Nunes, L. M., & Recarte, M. A. (2002). Cognitive demands of hands-free-phone conversation while driving. Transportation Research, Part F, 133--144.",
      "doi": ""
    },
    {
      "text": "Recarte, M. A., & Nunes, L. M. Mental workload while driving: Effects on visual search, discrimination, and decision making. Journal of Experimental Psychology, Applied, 9, 119--137.",
      "doi": ""
    },
    {
      "text": "Redelmeier, D.A., & Tibshirani, R. J. (1997). Association between cellular telephone calls and motor vehicle collisions. New England Journal of Medicine, 336, 453--458.",
      "doi": ""
    },
    {
      "text": "StiSim Drive: http://www.systemstech.com/stidrsm2.htm.",
      "doi": ""
    },
    {
      "text": "Strayer, D. L., Drews, F. A., & Johnston, W. A. (2003). Cell phone-induced failures of visual attention during simulated driving. Journal of Experimental Psychology: Applied, 9, 23--32.",
      "doi": ""
    },
    {
      "text": "Strayer, D. L., & Johnston, W. A. (2001). Driven to distraction: Dual task studies of simulated driving and conversing on a cellular telephone. Psychological Science, 12, 462--466.",
      "doi": ""
    },
    {
      "text": "Trbovich, P., & Harbluk, J. (2003). Cell phone communication and driver visual behavior: The impact of cognitive distraction. CHI 2003 Conference on Human Factors in Computer Systems: Extended abstracts (728--729). April, Ft. Lauderdale.  ",
      "doi": "10.1145/765891.765954"
    },
    {
      "text": "Vollrath, M., & Totzke, I. (2004). In-vehicle communication and driving: An attempt to overcome their interference. Downloaded from http://www.nrd.nhtsa.dot.gov/departments/nrd-13/driverdistraction/Topics043100033.htm.",
      "doi": ""
    }
  ]
}