{
  "doi": "10.1145/1054972.1055008",
  "title": "tranSticks: physically manipulatable virtual connections",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "251-260",
  "year": 2005,
  "badges": [],
  "abstract": "A virtually connected medium called tranStick is described that functions both as a \"virtual wire\" and as a \"memory card\" containing a shared space. A user can connect two networked devices by simply placing one of a pair of tranSticks with the same identifier into each device. The tranSticks provide feedback indicating that the devices are connected; the connection to be closed or changed in the same way it would be if the devices were connected by a physical cable. A user can also access to a shared space on a network as if the space were in the tranStick. Since tranSticks contain long secret keys, the process of finding another tranStick with the same identifier can be encrypted. The tranStick approach differs from other approaches in that it provides feedback from the connection as well as serving as a medium for establishing a connection, and it enables disconnection and switchover to be done intuitively because the operations are reversible.",
  "tags": [
    "connection control",
    "tangible user interface"
  ],
  "authors": [
    {
      "name": "Yuji Ayatsuka",
      "institution": "Sony Computer Science Laboratories, Inc., Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100046144",
      "orcid": "missing"
    },
    {
      "name": "Jun Rekimoto",
      "institution": "Sony Computer Science Laboratories, Inc., Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100008564/rel-imgonly/p2.png",
      "acmid": "81100008564",
      "orcid": "0000-0002-3629-2514"
    }
  ],
  "references": [
    {
      "text": "Yuji Ayatsuka, Nobuyuki Matsushita, and Jun Rekimoto. Gaze-link: A new metaphor of real-world oriented user interface. IPSJ Journal, 42(6):1330--1337, June 2001.",
      "doi": ""
    },
    {
      "text": "Rob Barrett and Paul P. Maglio. Informative Things: How to attach information to the real world. In UIST '98, pages 81--88, November 1998.  ",
      "doi": "10.1145/288392.288576"
    },
    {
      "text": "Scott Brave, Hiroshi Ishii, and Andrew Dahley. Tangible interfaces for remote collaboration and communication. In Computer Supported Cooperative Work (CSCW'98), pages 169--178, 1998.  ",
      "doi": "10.1145/289444.289491"
    },
    {
      "text": "Sony Music Entertainment. ConnecteD. http://www.sonymusic.com/thelab/ConnecteD.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley. Synchronous gestures for multiple persons and computers. In UIST 2003, pages 149--158, November 2003.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Yohei Iwasaki, Nobuo Kawaguchi, and Yasuyoshi Inagaki. Touch-and-Connect : A connection request framework for ad-hoc networks and the pervasive computing environment. In First IEEE Annual Conference on Pervasive Computing and Communications (PerCom 2003), pages 20--29. IEEE, Mar 2003. ",
      "doi": "10.5555/826025.826372"
    },
    {
      "text": "Jun Rekimoto. Pick-and-drop: A direct manipulation technique for multiple computer environments. In UIST '97, pages 31--39, October 1997.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Jun Rekimoto, Yuji Ayatsuka, and Michimune Kohno. SyncTap: An interaction technique for mobile networking. In Mobile HCI 2003, pages 104--115, September 2003.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto, Yuji Ayatsuka, Michimune Kohno, and Haruo Oba. Proximal interactions: A direct manipulation technique for wireless networking. In Ninth IFIP TC13 International Conference on Human-Computer Interaction (INTERACT 2003), pages 511--518. IFIP, September 2003.",
      "doi": ""
    },
    {
      "text": "Tristan Richardson, Questin Stafford-Fraser, Kenneth R. Wood, and Andy Hopper. Virtual network computing. IEEE Internet Computing, 2(1):33--38, 1998.  ",
      "doi": "10.1109/4236.656066"
    },
    {
      "text": "Dairoku Sekiguchi, Masahiko Inami, and Susumu Tachi. RobotPHONE: Rui for interpersonal communication. In Conference Extended Abstracts on Human Factors in Computer Systems (ACM CHI 2001), pages 277--278. ACM, April 2001.  ",
      "doi": "10.1145/634067.634231"
    },
    {
      "text": "Itiro Siio and Noyuri Mima. Meeting Pot: Coffee aroma transmitter (poster/demonstration). In ACM UbiComp 2001. ACM, ACM, Sep 2001.",
      "doi": ""
    },
    {
      "text": "Itiro Siio and Yoshiaki Mima. IconStickers: Converting computer icons into real paper icons. In Human-Computer Interaction, Ergonomics and User Interfaces, Volume 1 (HCI International '99), pages 271--275. Lawrence Erlbaum Associates, August 1999. ",
      "doi": "10.5555/647943.743296"
    },
    {
      "text": "Itiro Siio, James Rawan, and Elizabeth Mynatt. Peek-A-Drawer: communication by furniture. In Conference Extended Abstracts on Human Factors in Computer Systems (ACM CHI 2002), pages 582--583. ACM, April 2002.  ",
      "doi": "10.1145/506443.506494"
    },
    {
      "text": "Colin Swindells, Kori M. Inkpen, John C. Dill, and Melanie Tory. That one there! pointing to establish device identity. In UIST 2002, pages 151--160, October 2002.  ",
      "doi": "10.1145/571985.572007"
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Dylan Glas. mediaBlocks: Physical Containers,Transports, and Controls for Online Media. In SIGGRAPH '98 Proceedings, pages 379--386, 1998.  ",
      "doi": "10.1145/280814.280940"
    },
    {
      "text": "Roy Want, Kenneth P. Fishkin, Anuj Gujar, and Beverly L. Harrison. Bridging Physical and Virtual World with Electronic Tags. In Proceedings of CHI '99 Conference on Human Factors in Computing Systems, pages 370--377. ACM, May 1999.  ",
      "doi": "10.1145/302979.303111"
    },
    {
      "text": "Mark Weiser. The computer for the twenty-first century. Scientific American, pages 94--104, September 1991.",
      "doi": ""
    }
  ]
}