{
  "doi": "10.1145/1054972.1055081",
  "title": "Martial arts in artificial reality",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "781-790",
  "year": 2005,
  "badges": [],
  "abstract": "This paper presents Kick Ass Kung-Fu, a martial arts game installation where the player fights virtual enemies with kicks and punches as well as acrobatic moves such as cartwheels. Using real-time image processing and computer vision, the video image of the user is embedded inside 3D graphics. Compared to previous work, our system uses a profile view and two displays, which allows an improved view of many martial arts techniques. We also explore exaggerated motion and dynamic slow-motion effects to transform the aesthetic of kung-fu movies into an interactive, embodied experience. The system is described and analyzed based on results from testing the game in a theater, in a television show, and in a user study with 46 martial arts practitioners.",
  "tags": [
    "artificial reality",
    "computer vision",
    "kung-fu",
    "martial arts"
  ],
  "authors": [
    {
      "name": "Perttu Hämäläinen",
      "institution": "Helsinki University of Technology, HUT, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100307069",
      "orcid": "0000-0001-7764-3459"
    },
    {
      "name": "Tommi Ilmonen",
      "institution": "Helsinki University of Technology, HUT, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100391905",
      "orcid": "missing"
    },
    {
      "name": "Johanna Höysniemi",
      "institution": "University of Tampere, UTA, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619329",
      "orcid": "missing"
    },
    {
      "name": "Mikko Lindholm",
      "institution": "Animaatiokone Industries Co-op, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100574122",
      "orcid": "missing"
    },
    {
      "name": "Ari Nykänen",
      "institution": "Animaatiokone Industries Co-op, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100535232",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Konami Annual Report 1999, http://www.konami.co.jp/en/ir/financialinfo/annualreport/report1999/am01.html, link checked 4 th Jan 2005.",
      "doi": ""
    },
    {
      "text": "Sony Eye-Toy, http://www.eyetoy.com, link checked 9th Sep 2004.",
      "doi": ""
    },
    {
      "text": "OpenCV, http://sourceforge.net/projects/opencvlibrary/, link checked 9th Sep 2004.",
      "doi": ""
    },
    {
      "text": "Ajdari, J., Aulaskari, I., Brown, J., Edutainment in learning environments, http://www.helsinki.fi/~jbrown/tao/rap7.html, link checked 4th Jan 2005.",
      "doi": ""
    },
    {
      "text": "Baecker, R., Miller, D., and Reeves, W. Towards a Laboratory Instrument for Motion Analysis. Computer Graphics, vol. 15, No. 3, August 1981, pp. 191--197.  ",
      "doi": "10.1145/965161.806806"
    },
    {
      "text": "Blake, A., Isard, M., Active Contours The Application of Techniques from Graphics, Vision, Control Theory and Statistics to Visual Tracking of Shapes in Motion, Springer-Verlag London Limited (1998). ",
      "doi": "10.5555/551406"
    },
    {
      "text": "Chi, E.H., Song, J., Corbin, G., \"Killer App\" of wearable computing: wireless force sensing body protectors for martial arts, Proc. UIST 2004, ACM Press (2004), pp. 277--285.  ",
      "doi": "10.1145/1029632.1029680"
    },
    {
      "text": "Philo Tan Chua, Crivella, R., Daly, B., Ning Hu, Schaaf, R., Ventura, D., Camill, T., Hodgins, J., Pausch, R. Training for Physical Tasks in Virtual Environments: Tai Chi, Proc. IEEE Virtual Reality 2003, pp. 87--94. ",
      "doi": "10.5555/832289.835983"
    },
    {
      "text": "Crowley, J.L., Coutaz, J., Bérard, F., Things That See, Communications of the ACM, Vol. 43, No. 3, March 2000.  ",
      "doi": "10.1145/330534.330540"
    },
    {
      "text": "Cruz-Neira, C., Sandin, D.J., DeFanti, T.A. Surround-screen projection-based virtual reality: the design and implementation of the CAVE, Proc. SIGGRAPH'93, ACM Press (1993), pp. 135--142.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Freeman, W.T., Beardsley, P.A., Kage, H., Tanake, K., Kyuma, K., Weissman, C.D., Computer Vision for Computer Interaction, SIGGRAPH Computer Graphics Newsletter, Vol. 33, No. 4, November 1999, ACM SIGGRAPH.  ",
      "doi": "10.1145/345370.345417"
    },
    {
      "text": "Ishii, H., Wisneski, C., Orbanes, J., Chun, B., Paradiso, J., PingPongPlus: design of an athletic-tangible interface for computer-supported cooperative play, Proc. CHI'99, ACM Press (1999), pp. 394--401.  ",
      "doi": "10.1145/302979.303115"
    },
    {
      "text": "Hämäläinen, P., Interactive Video Mirrors for Sports training. Proc. nordiCHI 2004, ACM Press (2004), pp. 199--202.  ",
      "doi": "10.1145/1028014.1028044"
    },
    {
      "text": "Hämäläinen, P., and Höysniemi, J. A Computer Vision and Hearing Based User Interface for a Computer Game for Children. Proc. 7th ERCIM Workshop \"User Interfaces For All\" (2002).",
      "doi": ""
    },
    {
      "text": "Hämäläinen, P, Mäki-Patola, T. Pulkki, V. Airas, M. Musical Computer Games Played by Singing. Proc. 7th International Conference on Digital Audio Effects (DAFx'04), 2004, pp. 367--371.",
      "doi": ""
    },
    {
      "text": "Iredale, F., Farrington, T., and Jaques, M., Global, fine and hidden sports data: applications of 3-D vision analysis and a specialised data glove for an athlete biomechanical analysis system, Proc. Mechatronics and Machine Vision in Practice (1997), pp. 260--264. ",
      "doi": "10.5555/523984.823482"
    },
    {
      "text": "Krueger, M., Gionfriddo, T., Hinrichsen, K. VIDEOPLACE - An Artificial Reality, Proc. CHI'85, ACM Press (1985), pp. 35--40.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Mueller, F., Agamanolis, S., Picard, R., Exertion interfaces: sports over a distance for social bonding and fun, Proc. CHI'03, ACM Press (2003), pp. 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Oblinger, D.G. The Next Generation of Educational Engagement, Journal of Interactive Media in Education, 2004 (8).",
      "doi": ""
    },
    {
      "text": "Perš, J., Bon, M., Kova è i è, S., Šibila, M., De + man, B. Observation and Analysis of Large-scale Human Motion, Human Movement Science, 21(2), 295--311, July 2002.",
      "doi": ""
    },
    {
      "text": "Plänkers, R. and Fua, P. Tracking and Modeling People in Video Sequences. Computer Vision and Image Understanding, 81(3), March 2001.  ",
      "doi": "10.1006/cviu.2000.0891"
    },
    {
      "text": "Polar A3 heart rate monitor user's manual, Polar Electro (2004).",
      "doi": ""
    },
    {
      "text": "Press, W.H., Teukolsky, S.A., Vetterling, V.T., Flannery, B.P. Numerical Recipes in C++, 2 nd ed., Cambridge University Press (2002).",
      "doi": ""
    },
    {
      "text": "Sidenbladh, H., Black, M.J., Sigal, L. Implicit Probabilistic Models of Human Motion for Synthesis and Tracking, Proc. 7 th European Conference on Computer Vision - Part I, Springer-Verlag (2002). ",
      "doi": "10.5555/645315.649172"
    },
    {
      "text": "Toyama, K., Krumm, J., Brumitt, B., and Meyers, B. Wallflower: Principles and Practice of Background Maintenance, Proc. International Conference on Computer Vision (1999).",
      "doi": ""
    },
    {
      "text": "Yamamoto, M., Kondo, T., Yamagiwa, T., Yamanaka, K. Skill recognition, Proc. Automatic Face and Gesture Recognition (1998), pp. 604--609. ",
      "doi": "10.5555/520809.796119"
    },
    {
      "text": "Wilson, C., & Blostein, J. (1998) Pros and cons of co-participation in usability studies. Usability Interface, 4 (4), April 1998.",
      "doi": ""
    },
    {
      "text": "Wren, C.R., Spacarino, F., Azarbayejani, A., Darrel, T., Davis, J., Starner, Kotani, A.,Chao, C., Hlavac, M., Russel, K., Bobick, A., Pentland, A., Perceptive Spaces for Performance and Entertainment (Revised), Applied Artificial Intelligence, Vol. 11, No. 4, June 1997.",
      "doi": ""
    },
    {
      "text": "Wren, C.R., Azarbayejani, A., Darrel, Pentland, A. Pfinder: Real-Time Tracking of the Human Body, IEEE Transactions on Pattern Analysis and Machine Intelligence, July 1997, Vol. 19, No. 7, pp. 780--785.  ",
      "doi": "10.1109/34.598236"
    }
  ]
}