{
  "doi": "10.1145/1054972.1055020",
  "title": "Urban probes: encountering our emerging urban atmospheres",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "341-350",
  "year": 2005,
  "badges": [],
  "abstract": "Urban Atmospheres captures a unique, synergistic moment - expanding urban populations, rapid adoption of Bluetooth mobile devices, tiny ad hoc sensor networks, and the widespread influence of wireless technologies across our growing urban landscapes. The United Nations recently reported that 48 percent of the world's population current live in urban areas and that this number is expected to exceed the 50 percent mark world wide by 2007 [1]. In developed nations the number of urban dwellers is even more dramatic - expected to exceed 75%. Current studies project Bluetooth-enabled devices to reach 5.4 billion units by 2005 - five times the number of mobile phones or Internet connections [2]. Mobile phone penetration already exceeds 80% of the population in places like the European Union (EU) and parts of Asia [3]. WiFi hardware is being deployed at the astonishing rate of one every 4 seconds globally [4]. We argue that now is the time to initiate inspirational research into the very essence of these newly emerging technological urban spaces. We desire to move towards an improved understanding of the emotional experience of urban life. This paper describes Urban Probes - a lightweight, provocative, intervention methodology designed to rapidly deconstruct urban situations, reveal new opportunities for technology in urban spaces, and guide future long term research in urban computing. We also describe a completed Urban Probe exploring urban trash.",
  "authors": [
    {
      "name": "Eric Paulos",
      "institution": "Intel Research, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    },
    {
      "name": "Tom Jenkins",
      "institution": "The Royal College of Art, London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "United Nations. Dept. of International Economic and Social Affairs., United Nations. Dept. for Economic and Social Information and Policy Analysis., and United Nations. Dept. of Economic and Social Affairs. Population Division., \"World urbanization prospects:The 2003 Revision.\" New York: United Nations Dept. of International Economic and Social Affairs, 2003.",
      "doi": ""
    },
    {
      "text": "\"Merrill Lynch Report: Bluetooth Handbook,\" 29 June 2000.",
      "doi": ""
    },
    {
      "text": "\"eMarketer Chart: Mobile Phone Penetration Rate for Select Countries in the Asia-Pacific Region,\" 2002.",
      "doi": ""
    },
    {
      "text": "G. Paulo, \"4Q 2002 WLAN Market Analysis,\" Cahners In-Stat Group 19 March 2003.",
      "doi": ""
    },
    {
      "text": "M. Foucault, \"Of other space,\" in The visual culture reader, N. Mirzoeff, Ed. London ; New York: Routledge, 1998, pp. xvi, 530.",
      "doi": ""
    },
    {
      "text": "W. H. Whyte, The social life of small urban spaces. Washington, D.C.: Conservation Foundation, 1980.",
      "doi": ""
    },
    {
      "text": "K. Lynch, The image of the city. Cambridge Mass.: Technology Press, 1960.",
      "doi": ""
    },
    {
      "text": "S. Milgram, The individual in a social world : essays and experiments. Reading, Mass.: Addison-Wesley Pub. Co., 1977.",
      "doi": ""
    },
    {
      "text": "J. Jacobs, The death and life of great American cities. New York: Random House, 1961.",
      "doi": ""
    },
    {
      "text": "S. Jain, \"Urban Errands: The Means of Mobility,\" Journal of Consumer Culture, vol. 2, 2002.",
      "doi": ""
    },
    {
      "text": "E. Paulos and E. Goodman, \"The Familiar Stranger: Anxiety, Comfort, and Play in Public Places,\" presented at ACM SIGCHI, 2004.  ",
      "doi": "10.1145/985692.985721"
    },
    {
      "text": "M. Moss and A. Townsend, \"How Telecommunication Systems are Transforming Urban Spaces,\" in Fractured Geographies: Cities in the Telecommunications Age, J. Wheeler and Y. Aoyama, Eds. New York: Routledge, 1999.",
      "doi": ""
    },
    {
      "text": "G. Debord, The society of the spectacle. New York: Zone Books, 1994.",
      "doi": ""
    },
    {
      "text": "C. Alexander, S. Ishikawa, and M. Silverstein, A pattern language : towns, buildings, construction. New York: Oxford University Press, 1977.",
      "doi": ""
    },
    {
      "text": "E. Paulos, \"Street Talk: An Urban Computing Happening http://www.urban-atmospheres.net/StreetTalk,\" 2004.",
      "doi": ""
    },
    {
      "text": "E. Paulos, K. Anderson, and A. Townsend, \"UbiComp in the Urban Frontier,\" presented at Workshop at Ubiquitous Computing, 2004.",
      "doi": ""
    },
    {
      "text": "W. Gaver, \"Designing for Homo Ludens,\" in i3 Magazine, 2002, pp. 2--5.",
      "doi": ""
    },
    {
      "text": "B. Gaver, T. Dunne, and E. Pacenti, \"Design: Cultural Probes,\" ACM Interactions, vol. 6, pp. 21--29, 1999.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "H. Hutchinson, W. Mackay, B. Westerlund, B. B. Bederson, A. Druin, C. Plaisant, M. Beaudouin-Lafon, S. Conversy, H. Evans, H. Hansen, N. Roussel, B. Eiderbäck, S. Lindquist, and Y. Sundblad, \"Technoloy Probes: Inspiring Design for and with Families,\" presented at ACM SIGCHI, 2003.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "A. Henri, Total Art: Environments, Happenings and Performance: W.W. Norton & Company, 1974.",
      "doi": ""
    },
    {
      "text": "http://www.proboscis.org.uk/urbantapestries/index.html, \"Urban Tapestries reference,\" 2003.",
      "doi": ""
    },
    {
      "text": "\"Traces of Fire,\" http://www.traces-of-fire.org/.",
      "doi": ""
    },
    {
      "text": "W. L. Rathje and C. Murphy, Rubbish!: the archaeology of garbage. Tucson, AZ: University of Arizona Press, 2001.",
      "doi": ""
    },
    {
      "text": "S. Saar and V. Thomas, \"Towards Trash That Thinks,\" Journal of Industrial Ecology, vol. 6, pp. 133--146, 2003.",
      "doi": ""
    },
    {
      "text": "B. Feder, \"How to Find That Needle Hopelessly Lost In the Haystack,\" in New York Times, Final ed. New York, 2003, pp. 1.",
      "doi": ""
    },
    {
      "text": "W. H. Whyte, City : rediscovering the center, 1st ed. New York: Doubleday, 1988.",
      "doi": ""
    }
  ]
}