{
  "doi": "10.1145/1054972.1055082",
  "title": "Spotlight: directing users' attention on large displays",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "791-798",
  "year": 2005,
  "badges": [],
  "abstract": "We describe a new interaction technique, called a spotlight, for directing the visual attention of an audience when viewing data or presentations on large wall-sized displays. A spotlight is simply a region of the display where the contents are displayed normally while the remainder of the display is somewhat darkened. In this paper we define the behavior of spotlights, show unique affordances of the technique, and discuss design characteristics. We also report on experiments that show the benefit of using the spotlight a large display and standard desktop configuration. Our results suggest that the spotlight is preferred over the standard cursor and outperforms it by a factor of 3.4 on a wall-sized display.",
  "authors": [
    {
      "name": "Azam Khan",
      "institution": "Alias, Toronto, Ontario, Canada",
      "img": "/do/10.1145/contrib-81100345201/rel-imgonly/azamcirclew-500a.png",
      "acmid": "81100345201",
      "orcid": "missing"
    },
    {
      "name": "Justin Matejka",
      "institution": "Alias, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153192",
      "orcid": "missing"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Alias, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Gordon Kurtenbach",
      "institution": "Alias, Toronto, Ontario, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332510496",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baecker, R., Small, I. and Mander, R. (1991) Bringing icons to life, In Proceedings of ACM CHI'91, pp. 1--6.  ",
      "doi": "10.1145/108844.108845"
    },
    {
      "text": "Bartram, L. (1997) Perceptual and interpretative properties of motion for information visualization, In Proceedings 1997 workshop on New paradigms in information visualization and manipulation, pp.3--7, November 10--14, 1997, Las Vegas, Nevada.  ",
      "doi": "10.1145/275519.275520"
    },
    {
      "text": "Barzel R. (1997) Lighting Controls for Computer Cinematography, Journal of Graphics Tools, 2(1), pp. 1--20.  ",
      "doi": "10.1080/10867651.1997.10487467"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P. Bederson, B., and Zierlinger, A. (2003) Drag-and-Pop and Drag-and-Pick: Techniques for Accessing Remote Screen Content on Touch- and Pen-operated Systems. Proceedings of Interact 2003, pp. 57--64.",
      "doi": ""
    },
    {
      "text": "Baudisch, P. and Rosenholtz, R. (2003) Halo: a Technique for Visualizing Off-Screen Locations, In Proceedings of ACM CHI 2003, pp. 481--488.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Baudisch, P., Good, N., and Stewart, P. (2001) Focus Plus Context Screens: Combining Display Technology with Visualization Techniques, In Proceedings of ACM UIST '01, pp.31--40.  ",
      "doi": "10.1145/502348.502354"
    },
    {
      "text": "Baudisch, P., Cutrell, E. and Robertson, G. (2003) High-density cursor: a visualization technique that helps users keep track of fast-moving mouse cursor, Proceedings of Interact 2003, pp. 236--243.",
      "doi": ""
    },
    {
      "text": "Baudisch, P. Cutrell, E., Hinckley, K. and Gruen, R. (2004) Mouse Ether: Accelerating the Acquisition of Targets Across Multi-Monitor Displays, In Proceedings of CHI 2004, pp. 1379--1382.  ",
      "doi": "10.1145/985921.986069"
    },
    {
      "text": "Box, H.C. (1997) Set Lighting Technician's Handbook, Film Lighting Equipment, Practice, and Electrical Distribution, Second Ed., Focal Press, Boston.",
      "doi": ""
    },
    {
      "text": "Buxton, W., Fitzmaurice, G.W., Balakrishnan, R. and Kurtenbach, G. (2000) Large displays in automotive design, IEEE Computer Graphics and Applications, July/August 2000, pp. 68--75.  ",
      "doi": "10.1109/38.851753"
    },
    {
      "text": "Cadiz, J.J., Venolia, G., Jancke, G. and Gupta, A. (2002) Designing and Deploying an Information Awareness Interface, In Proceedings of CSCW 2002, pp. 314--323.  ",
      "doi": "10.1145/587078.587122"
    },
    {
      "text": "Chang, B-W and Ungar, D. (1993) Animation: from cartoons to the user interface, In Proceedings of ACM UIST 1993, pp 45--55.  ",
      "doi": "10.1145/168642.168647"
    },
    {
      "text": "Chapman, D. and Ware, C. (1992) Manipulating the Future: Predictor Based Feedback for Velocity Control in Virtual Environment Navigation. Special Issue of Computer Graphics. Proceedings of ACM 1992 Symposium on Interactive 3D Graphics, Cambridge Mass, 63--66.  ",
      "doi": "10.1145/147156.147165"
    },
    {
      "text": "Czerwinski, M., Tan, D.S. and Robertson, G.G. (2002) Women Take a Wider View, Proceedings of CHI 2002, pp. 195--202.  ",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Elrod, S., Bruce, R., Gold, R., Goldberg, D., Halasz, F., Janssen, W., Lee, D., McCall, K., Pedersen, E., Pier, K., Tang, J., and Welch, B. (1992) Liveboard: a large interactive display supporting group meetings, presentations, and remote collaboration, Proceedings of CHI 1992, pp. 599--607.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Fass, A., Forlizzi, J. and Pausch, R. (2002). MesyDesk and MessyBoard: two designs inspired by the goal of improving human memory. In Proceedings of ACM DIS 2002, pp. 303--311.  ",
      "doi": "10.1145/778712.778754"
    },
    {
      "text": "Fitzmaurice, G., Khan, A., Pieke, R., Buxton, B. and Kurtenbach, G. (2003) Tracking Menus, In Proceedings of ACM UIST 2003, pp. 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "Geiβler, J. (1998) Shuffle, Throw or Take It! Working Efficiently with an Interactive Wall. In ACM Conference Companion to CHI 1998, pp. 265--266.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Grudin, J. (2001) Partitioning Digital Worlds: Focal and Peripheral Awareness in Multiple Monitor Use, Proc. CHI 2001, pp. 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Guimbretière, F., Stone, M. & Winograd, T. (2001) Fluid Interaction with High-resolution Wall-size Displays, Proceedings of ACM UIST 2001, pp. 21--30.  ",
      "doi": "10.1145/502348.502353"
    },
    {
      "text": "Hascoët, M. (2003) Throwing models for large displays, Proceedings of HCI'2003, Designing for Society, Volume 2, pp. 73--77, British HCI Group.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P. and Smith, M. (2004) Stitching: Pen Gestures that Span Multiple Displays, In Proceedings of AVI'04, pp. 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Horvitz, E., Kadie, C., Paek, T. and Hovel, D. (2003) Model of Attention in Computing and Communication: From principles to applications, Communications of the ACM, 46 (3), pp. 52--59.  ",
      "doi": "10.1145/636772.636798"
    },
    {
      "text": "Humphreys, G., Eldridge, M., Buck, I., Stoll, G., Everett, M. and Hanrahan, P. (2001) WireGL: a scalable graphics system for clusters, Proceedings of SIGGRAPH 2001, pp. 129--140.  ",
      "doi": "10.1145/383259.383272"
    },
    {
      "text": "Hutchings, D.R., Smith, G. and Meyers, B. (2004) Display space usage and window management operation comparisons between single monitor and multiple monitor users. In Proceedings of AVI 2004, pp. 32--39.  ",
      "doi": "10.1145/989863.989867"
    },
    {
      "text": "Johanson, B., Hutchins, G., Winograd, T., and Stone, M. (2002) PointRight: Experience with Flexible Input Redirection in Interactive Workspaces. Proceedings of UIST 2002, pp. 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Jung, T., Gross, M.D. and Do, E.Y.-L. (2003) Light Pen - Sketching light in 3D, Proceedings of 10th International Conference on Computer Aided Architectural Design Futures, Tainan, Taiwan.",
      "doi": ""
    },
    {
      "text": "MacIntyre, B., Mynatt, E.D., Voida, S., Hansen, K.M., Tullio, J., Corso and G.M. (2001) Support for Multitasking and Background Awareness Using Interactive Peripheral Displays, UIST'01, 41--50.  ",
      "doi": "10.1145/502348.502355"
    },
    {
      "text": "Mackinlay, J.D. and Heer, J. (2004) Wideband Displays: Mitigating Multiple Monitor Seams, In Proceedings of CHI 2004, pp. 1521--1524.  ",
      "doi": "10.1145/985921.986105"
    },
    {
      "text": "Maglio, P.P., Campbell, C. (2000) Tradeoffs in Displaying Peripheral Information, Proceedings of CHI 2000, pp. 241--248.  ",
      "doi": "10.1145/332040.332438"
    },
    {
      "text": "Pashler, H.E. (1998) The Psychology of Attention, \"A Bradford book\" Publisher.",
      "doi": ""
    },
    {
      "text": "Pellacini, F., Tole, P. and Greenberg, D.P. (2002) A User Interface for Interactive Cinematic Shadow Design, In ACM Transactions on Graphics (TOG), 21 (3), July 2002 pp. 563--566.  ",
      "doi": "10.1145/566654.566617"
    },
    {
      "text": "Rekimoto, J. and Saitoh, M. (1999) Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments, In Proceedings of CHI 1999, pp. 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Shell, J.S., Vertegaal, R. and Skaburskis, A.W. (2003) EyePliances: Attention-Seeking Devices that Respond to Visual Attention, In Proceedings of CHI 2003, pp. 770--771.  ",
      "doi": "10.1145/765891.765981"
    },
    {
      "text": "Streitz, N.A., Geiβler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P., Steinmetz, R. (1999) i-LAND: an interactive landscape for creativity and innovation, Proceedings of ACM CHI 1999, pp.120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Swaminathan, K., and Sato, S. (1997) Interaction Design for Large Displays. Interactions 4(1). pp. 15--24.  ",
      "doi": "10.1145/242388.242395"
    },
    {
      "text": "Tan, D.S. and Czerwinski, M. (2003) Effects of Visual Separation and Physical Discontinuities when Distributing Information across Multiple Displays. In Proceedings of Interact 2003, pp. 252--255.",
      "doi": ""
    },
    {
      "text": "Tan, D.S., Czerwinski, M. and Robertson, G. (2003) Women Go With the (Optical) Flow, Proceedings of CHI 2003, pp. 209--215.  ",
      "doi": "10.1145/642611.642649"
    },
    {
      "text": "Tan, D.S., Gergle, D., Scupelli, P.G., and Pausch, R. (2003) With Similar Visual Angles, Larger Displays Improve Spatial Performance, Proceedings of CHI 2003, 217--224.  ",
      "doi": "10.1145/642611.642650"
    },
    {
      "text": "Tani, M., Horita, M., Yamaashi, K., and Tanikoshi, K. (1994) Courtyard: Integrating Shared Overview on a Large Screen and Per-user Detail on Individual Screens, Proceedings of CHI'94, pp. 44--50.  ",
      "doi": "10.1145/191666.191690"
    },
    {
      "text": "Tsang, M., Fitzmaurice, G., Kurtenbach, G., Khan, A., Buxton, B. (2002). Boom Chameleon: Simultaneous capture of 3D viewpoint, voice and gesture annotations on a spatially-aware display. ACM CHI Letters, 4(2). p. 111--120. ACM UIST 2002.  ",
      "doi": "10.1145/571985.572001"
    },
    {
      "text": "Vogel, D. Balakrishnan, R. (in press, 2004). Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. To appear in UIST 2004.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Zellweger, P.T., Mackinlay, J.D., Good, L., Stefik, M., Baudisch, P. (2003) City Lights: Contextual views in minimal space, In Proceedings of CHI 2003, pp. 838--839.  ",
      "doi": "10.1145/765891.766022"
    }
  ]
}