{
  "doi": "10.1145/1054972.1055048",
  "title": "StudioBRIDGE: using group, location, and event information to bridge online and offline encounters for co-located learning groups",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "551-560",
  "year": 2005,
  "badges": [],
  "abstract": "StudioBRIDGE is an awareness system, based on instant messaging (IM), developed for students working in open studio spaces in the Architecture Department at the Massachusetts Institute of Technology (MIT). The goal of StudioBRIDGE is to help students initiate online and offline interactions by giving them an awareness of nearby people, groups, locations, and events of the community. Even when students are working in close proximity to each other, they are often not aware of the activities and expertise of their colleagues nearby. We believe that this integrated awareness could lead to increased peer learning and expertise sharing by encouraging informal social communication, particularly in groups whose members have existing social and physical ties. In this paper, we describe the user community and the motivation, design, and initial pilot deployment of StudioBRIDGE.",
  "authors": [
    {
      "name": "Susan Yee",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100560047",
      "orcid": "missing"
    },
    {
      "name": "Kat S. Park",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100159425",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, V., Bly, S. Walking away from the desktop computer: distributed collaboration and mobility in a product design team. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '96) (Boston, MA). ACM Press, New York, NY 1996, 209--218.]]  ",
      "doi": "10.1145/240080.240256"
    },
    {
      "text": "Bly, S., Harrison, S., Irwin, S. Media spaces: Bringing people together in video, audio, and computing environment. In Communications of the ACM, Vol. 36, No. 1. ACM Press, New York, NY 1993, 28--45.]]  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Bradner, E., Kellogg, W.A., Erickson, T. The adoption and use of Babble: A field study of chat in the workplace. In Proceedings of the Sixth European conference on Computer supported cooperative work (ECSCW '99). (Copenhagen, Denmark). Kluwer Academic Publishers, 1999, 139--158.]] ",
      "doi": "10.5555/351689.351698"
    },
    {
      "text": "Bradner, E., Kellogg, W.A., Erickson, T. Babble: Supporting Conversation in the Workplace. In SIGGROUP Bulletin, December 1998, Vol.19, No.3, 8--10.]]  ",
      "doi": "10.1145/307736.307754"
    },
    {
      "text": "Boyer, E.L., Mitgang, L.D. Building Community: A New Future for Architecture Education and Practice: A Special Report. The Carnegie Foundation for the Advancement of Teaching, New Jersey, 1996, 17]]",
      "doi": ""
    },
    {
      "text": "Cadiz, J.J., Venolia, G., Jancke, G., Gupta, A. Designing and deploying an information awareness interface. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '02) (New Orleans, LA). ACM Press, New York, NY 2002, 314--323.]]  ",
      "doi": "10.1145/587078.587122"
    },
    {
      "text": "Churchill, E.F., Nelson, L., Denoue, L., Girgensohn, A. The Plasma Poster Network: Posting Multimedia Content in Public Places. In Proceedings of INTERACT 2003. (Zurich, Switzerland). IOS Press, Amsterdam, The Netherlands 2003, 599--606.]]",
      "doi": ""
    },
    {
      "text": "Cuff, D. Architecture: The Story of Practice. MIT Press, Cambridge, MA 1991, 43.]]",
      "doi": ""
    },
    {
      "text": "Dodgeball software. http://dodgeball.com/social/index.php]]",
      "doi": ""
    },
    {
      "text": "Dourish, P., Bly, S. Portholes: supporting awareness in a distributed work group. In Proceedings of the SIGCHI conference on Human factors in computing systems. (Monterey, CA). ACM Press, New York, NY 1992, 541--547.]]  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Erickson, T., Smith, D.N., Kellogg, W.A., Laff, M. Richards, J.T., Bradner, E. Socially Translucent Systems: Social Proxies, Persistent Conversation, and the Design of \"Babble.\" In Proceedings of the SIGCHI conference on Human factors in computing systems. (Pittsburgh, PA). ACM Press, New York, NY 1999, 72--79.]]  ",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "Fitzpatrick, G., Mansfield, T., Kaplan, S., Arnold, D., Phelps, T., Segall, B. Augmenting the Workaday World with Elvin. In Proceedings of the Sixth European conference on Computer supported cooperative work (ECSCW '99). (Copenhagen, Denmark). Kluwer Academic Publishers, 1999, 431--450.]] ",
      "doi": "10.5555/351689.351713"
    },
    {
      "text": "Goecks, J., Cosley, D. NuggetMine: Intelligent Groupware for Opportunistically Sharing Information Nuggets. In Proceedings of the 7th international conference on Intelligent user interfaces.. (San Francisco, CA). ACM Press, New York, NY 2002, 87--94.]]  ",
      "doi": "10.1145/502716.502732"
    },
    {
      "text": "Greenberg, S., Rounding, M. The Notification Collage: Posting Information to Public and Personal Displays. In Proceedings of the SIGCHI conference on Human factors in computing systems. (Seattle, WA). ACM Press, New York, NY 2001, 514--521.]]  ",
      "doi": "10.1145/365024.365339"
    },
    {
      "text": "Griswold, W.G., Shanahan, P., Brown, S.W., Boyer, R., Ratto, M., Shapiro, R.B., Truong, T.M. ActiveCampus - Experiments in Community-Oriented Ubiquitous Computing. Technical Report CS2003-0750, Computer Science and Engineering, UC San Diego, June 2003.]]",
      "doi": ""
    },
    {
      "text": "Huang, E.M., Russell, D.M., Sue, A.E. IM: Public Instant Messaging on Large, Shared Displays for Workgroup Interactions. In Proceedings of the SIGCHI conference extended abstracts on Human factors in computing systems (Vienna, Austria). ACM Press, New York, NY 2004, 279--286.]]  ",
      "doi": "10.1145/985692.985728"
    },
    {
      "text": "Isaacs, E., Walendowski, A., Ranganthan, D. Hubbub: a sound-enhanced mobile instant messenger that supports awareness and opportunistic interactions. In Proceedings of the SIGCHI conference on Human factors in computing systems: Changing our world, changing ourselves. (Minneapolis, MN). ACM Press, New York, NY 2002, 179--186.]]  ",
      "doi": "10.1145/503376.503409"
    },
    {
      "text": "Kraut, R., Egido, C., Galegher, J. Patterns of contact and communication in scientific research collaboration. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '88) (Portland, OR). ACM Press, New York, NY 1988, 1--12.]]  ",
      "doi": "10.1145/62266.62267"
    },
    {
      "text": "Lederer, S., Heer, J. All Together Now: Visualizing Local and Remote Actors of Localized Activity. In Proceedings of the SIGCHI conference extended abstracts on Human factors in computing systems (Vienna, Austria). ACM Press, New York, NY 2004, 1107--1110.]]  ",
      "doi": "10.1145/985921.986000"
    },
    {
      "text": "Lederer, S., Mankoff, J., Dey, A.K. Who Wants to Know What When? Privacy Preference Determinants in Ubiquitous Computing. In Proceedings of the SIGCHI conference extended abstracts on Human factors in computing systems: New Horizons. (Fort Lauderdale, FL). ACM Press, New York, NY 2003, 724--725.]]  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "McCarthy, J.F., Costa. T.J., Liongosari, E.S. UniCast, OutCast & GroupCast: Three Steps Toward Ubiquitous, Peripheral Displays. In Proceedings of Ubiquitous Computing: Third International Conference (Ubicomp 2001). (Atlanta, GA). Springer Verlag Heidelberg, 2001, 332--345.]] ",
      "doi": "10.5555/647987.741333"
    },
    {
      "text": "McCarthy, J.F., Meidel, E.S. ActiveMAP: A visualization Tool for Location Awareness to Support Informal Interactions. In Proceedings of the International Symposium on Handheld and Ubiquitous Computing (HUC '99). (Karlsruhe, Germany). Springer Verlag Heidelberg, 1999, 158--170.]] ",
      "doi": "10.5555/647985.743868"
    },
    {
      "text": "Nardi, B., Whittaker, S., Bradner, E. Interaction and outeraction: Instant messaging in action. In Proceedings of the ACM conference on Computer supported cooperative work (CSCW '02) (Philadelphia, PA). ACM Press, New York, NY 2002, 79--88.]]  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Tang, J., Yankelovich, N., Begole, J., Van Kleek, M., Li, F., Bhalodia, J. ConNexus to Awarenex: Extending awareness to mobile users. In Proceedings of the SIGCHI conference on Human factors in computing systems. (Seattle, WA). ACM Press, New York, NY 2001, 221--228.]]  ",
      "doi": "10.1145/365024.365105"
    },
    {
      "text": "Voida, A., Newstetter, W.C., Mynatt, E.D. When Conventions Collide: The Tensions of Instant Messaging Attributed. In Proceedings of the SIGCHI conference on Human factors in computing systems. (Minneapolis, MN). ACM Press, New York, NY 2002, 187--194.]]  ",
      "doi": "10.1145/503376.503410"
    },
    {
      "text": "Zhao, Q. A., Stasko, J.T. What's Happening?: Promoting Community Awareness through Opportunistic, Peripheral Interfaces. In Proceedings for the Working Conference on Advanced Visual Interfaces (AVI 2002) (Trento, Italy). May 2002, 69--74.]]  ",
      "doi": "10.1145/1556262.1556271"
    },
    {
      "text": "Zhao, Q. A., Stasko, J.T. What's Happening?: The Community Awareness Application. In CHI '00 extended abstracts on Human factors in computing systems. ACM Press, New York, NY 2000, 253--254.]]  ",
      "doi": "10.1145/633292.633440"
    }
  ]
}