{
  "doi": "10.1145/1054972.1055016",
  "title": "Towards an index of opportunity: understanding changes in mental workload during task execution",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "311-320",
  "year": 2005,
  "badges": [],
  "abstract": "To contribute to systems that reason about human attention, our work empirically demonstrates how a user's mental workload changes during task execution. We conducted a study where users performed interactive, hierarchical tasks while mental workload was measured through the use of pupil size. Results show that (i) different types of subtasks impose different mental workload, (ii) workload decreases at subtask boundaries, (iii) workload decreases more at boundaries higher in a task model and less at boundaries lower in the model, (iv) workload changes among subtask boundaries within the same level of a task model, and (v) effective understanding of why changes in workload occur requires that the measure be tightly coupled to a validated task model. From the results, we show how to map mental workload onto a computational Index of Opportunity that systems can use to better reason about human attention.",
  "authors": [
    {
      "name": "Shamsi T. Iqbal",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Piotr D. Adamczyk",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100324367",
      "orcid": "missing"
    },
    {
      "name": "Xianjun Sam Zheng",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100580845",
      "orcid": "missing"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P.D. and B.P. Bailey. If Not Now When? The Effects of Interruptions at Various Moments within Task Execution. CHI, 2004, 271--278.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Bailey, B.P., J.A. Konstan and J.V. Carlis. The Effects of Interruptions on Task Performance, Annoyance, and Anxiety in the User Interface. INTERACT, 2001, 593--601.",
      "doi": ""
    },
    {
      "text": "Beatty, J. Task-Evoked Pupillary Responses, Processing Load, and the Structure of Processing Resources. Psychological Bulletin, 91 (2), 276--292, 1982.",
      "doi": ""
    },
    {
      "text": "Bradshaw, J.L. Pupil Size as a Measure of Arousal During Information Processing. Nature, 216, 515--516, 1967.",
      "doi": ""
    },
    {
      "text": "Card, S., T. Moran and A. Newell. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Cutrell, E., M. Czerwinski and E. Horvitz. Notification, Disruption and Memory: Effects of Messaging Interruptions on Memory and Performance. INTERACT, 2001, 263--269.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., E. Cutrell and E. Horvitz. Instant Messaging and Interruption: Influence of Task Type on Performance. Proc. OZCHI, 2000, 356--361.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., E. Cutrell and E. Horvitz. Instant Messaging: Effects of Relevance and Timing. In People and Computers XIV: Proceedings of HCI, 2000, 71--76.",
      "doi": ""
    },
    {
      "text": "Gillie, T. and D. Broadbent. What Makes Interruptions Disruptive? A Study of Length, Similarity, and Complexity. Psychological Research, 50, 243--250, 1989.",
      "doi": ""
    },
    {
      "text": "Hess, E.H. and J.M. Polt. Pupil Size in Relation to Mental Activity During Simple Problem Solving. Science, 132, 1190--1192, 1964.",
      "doi": ""
    },
    {
      "text": "Hoecks, B. and W. Levelt. Pupillary Dilation as a Measure of Attention: A Quantitative System Analysis. Behavior Research Methods, Instruments, & Computers, 25, 16--26, 1993.",
      "doi": ""
    },
    {
      "text": "Horvitz, E. and J. Apacible. Learning and Reasoning About Interruption. In Proceedings of the Fifth ACM International Conference on Multimodal Interfaces, 2003, 20--27.  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Horvitz, E., J. Breese, D. Heckerman, D. Hovel and K. Rommelse. The Lumiere Project: Bayesian User Modeling for Inferring the Goals and Needs of Software Users. Proc. Uncertainty in Artificial Intelligence, 1998, 256--265. ",
      "doi": "10.5555/2074094.2074124"
    },
    {
      "text": "Horvitz, E., A. Jacobs and D. Hovel. Attention-Sensitive Alerting. Proc. Uncertainty in Artificial Intelligence, 1999, 305--313. ",
      "doi": "10.5555/2073796.2073831"
    },
    {
      "text": "Hudson, S.E., J. Fogarty, C.G. Atkeson, D. Avrahami, J. Forlizzi, S. Kiesler, J.C. Lee and J. Yang. Predicting Human Interruptibility with Sensors: A Wizard of Oz Feasibility Study. CHI, 2003, 257--264.  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Hytintk, J., J. Tommola and A. Alaja. Pupil Dilation as a Measure of Processing Load in Simultaneous Interpretation and Other Language Tasks. The Quarterly Journal of Experimental Psychology, 48A (3), 598--612, 1995.",
      "doi": ""
    },
    {
      "text": "Iqbal, S.T., X.S. Zheng and B.P. Bailey. Task-Evoked Pupillary Response to Mental Workload in Human-Computer Interaction. CHI, 2004, 1477--1480.  ",
      "doi": "10.1145/985921.986094"
    },
    {
      "text": "Jackson, T.W., R.J. Dawson and D. Wilson. The Cost of Email Interruption. Journal of Systems and Information Technology, 5 (1), 81--92, 2001.",
      "doi": ""
    },
    {
      "text": "John, B., A. Vera, M. Matessa, M. Freed and R. Remington. Automating CPM-Goms. CHI, 2002, 147--154.  ",
      "doi": "10.1145/503376.503404"
    },
    {
      "text": "Juris, M. and M. Velden. The Pupillary Response to Mental Overload. Physiological Psychology, 5 (4), 421--424, 1977.",
      "doi": ""
    },
    {
      "text": "Kahneman, D. Pupillary Responses in a Pitch-Discrimination Task. Perception & Psychophysics, 2, 101--105, 1967.",
      "doi": ""
    },
    {
      "text": "Kramer, A.F. Physiological Metrics of Mental Workload: A Review of Recent Progress. In Damos, D.L. ed. Multiple-Task Performance, Taylor and Francis, London, 1991, 279--328.",
      "doi": ""
    },
    {
      "text": "Kreifeldt, J.G. and M.E. McCarthy. Interruption as a Test of the User-Computer Interface. In Proceedings of the 17th Annual Conference on Manual Control, Jet Propulsion Laboratory, California Institute of Technology, JPL Publication 81-95, 1981, 655--667.",
      "doi": ""
    },
    {
      "text": "Maes, P. Agents That Reduce Work and Information Overload. Communications of the ACM, 37 (7), 30--40, 1994.  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Marshall, S.P. New Techniques for Evaluating Innovative Interfaces with Eye Tracking. UIST, 2003, Keynote Talk.  ",
      "doi": "10.1145/958432.958434"
    },
    {
      "text": "McFarlane, D.C. Coordinating the Interruption of People in Human-Computer Interaction. INTERACT, 1999, 295--303.",
      "doi": ""
    },
    {
      "text": "Miyata, Y. and D.A. Norman. The Control of Multiple Activities. In Norman, D.A. and Draper, S.W. (eds.) User Centered System Design: New Perspectives on Human-Computer Interaction, Lawrence Erlbaum Associates, Hillsdale, NJ, 1986.",
      "doi": ""
    },
    {
      "text": "Nakayama, M. and K. Takahashi. The Act of Task Difficulty and Eye-Movement Frequency for the Ocul-Motor Indices. In Proceedings of Eye Tracking Research and Application, 2002, 37--42.  ",
      "doi": "10.1145/507072.507080"
    },
    {
      "text": "Picard, R.W. Affective Computing. MIT Press, 1997. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Rowe, D.W., J. Sibert and D. Irwin. Heart Rate Variability: Indicator of User State as an Aid to Human-Computer Interaction. CHI, 1998, 480--487.  ",
      "doi": "10.1145/274644.274709"
    },
    {
      "text": "Shell, J.S., T. Selker and R. Vertegaal. Interacting with Groups of Computers. CACM, 46 (3), 40--46, 2003.  ",
      "doi": "10.1145/636772.636796"
    },
    {
      "text": "Speier, C., J.S. Valacich and I. Vessey. The Influence of Task Interruption on Individual Decision Making: An Information Overload Perspective. Decision Sciences, 30 (2), 337--360, 1999.",
      "doi": ""
    },
    {
      "text": "Takahashi, K., M. Nakayama and Y. Shimizu. The Response of Eye-Movement and Pupil Size to Audio Instruction While Viewing a Moving Target. Proc. Eye Tracking Research & Applications, 2000.  ",
      "doi": "10.1145/355017.355043"
    },
    {
      "text": "Tobii-Systems. http://www.tobii.se/",
      "doi": ""
    },
    {
      "text": "Wilson, G.M. and M.A. Sasse. The Head or the Heart?: Measuring the Impact of Media Quality. CHI, 2000, 117--118.  ",
      "doi": "10.1145/633292.633360"
    },
    {
      "text": "Zijlstra, F.R.H., R.A. Roe, A.B. Leonora and I. Krediet. Temporal Factors in Mental Work: Effects of Interrupted Activities. Journal of Occupational and Organizational Psychology, 72, 163--185, 1999.",
      "doi": ""
    }
  ]
}