{
  "doi": "10.1145/1054972.1054979",
  "title": "Is your web page accessible?: a comparative study of methods for assessing web page accessibility for the blind",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "41-50",
  "year": 2005,
  "badges": [],
  "abstract": "Web access for users with disabilities is an important goal and challenging problem for web content developers and designers. This paper presents a comparison of different methods for finding accessibility problems affecting users who are blind. Our comparison focuses on techniques that might be of use to Web developers without accessibility experience, a large and important group that represents a major source of inaccessible pages. We compare a laboratory study with blind users to an automated tool, expert review by web designers with and without a screen reader, and remote testing by blind users. Multiple developers, using a screen reader, were most consistently successful at finding most classes of problems, and tended to find about 50% of known problems. Surprisingly, a remote study with blind users was one of the least effective methods. All of the techniques, however, had different, complementary strengths and weaknesses.",
  "tags": [
    "assistive technologies",
    "evaluation",
    "web accessibility",
    "disability"
  ],
  "authors": [
    {
      "name": "Jennifer Mankoff",
      "institution": "CMU, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Holly Fait",
      "institution": "Exploratorium, San Francisco, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100253314",
      "orcid": "missing"
    },
    {
      "name": "Tu Tran",
      "institution": "UC Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100264872",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bobby Worldwide, http://bobby.watchfire.com/bobby/html/en/index.jsp]]",
      "doi": ""
    },
    {
      "text": "Bureau of the Census, \"Survey of Income and Program Participation,\" 1994--95, http://www.census.go v/hhes/www/disable/dissipp.html]]",
      "doi": ""
    },
    {
      "text": "Clark, J., Building accessible websites, New Riders, IN, 2002.]] ",
      "doi": "10.5555/940648"
    },
    {
      "text": "Cockton, G., Lavery, D. and Woolrych, A., \"Inspection-based evaluations,\" The Human Computer-Interaction Handbook, Jacko, J. A. and Sears, A. (editors), pp. 1118--1138.]] ",
      "doi": "10.5555/772072.772142"
    },
    {
      "text": "Cockton, G. and Woolrych, A., \"Understanding inspection methods: Lessons from an assessment of heuristic evaluation,\" In A. Blandford and J. Vanderdonckt, (Eds.), People & Computers XV, Springer-Verlag, pp. 171--192, 2001.]]",
      "doi": ""
    },
    {
      "text": "Colwell, C. and Petrie, H., \"Evaluation of guidelines for designing accessible web content,\" In C. Bühler & H. Knops (Eds), Assistive technology on the threshold of the new millennium, IOS press, 1999.]]",
      "doi": ""
    },
    {
      "text": "Coyne, K. P. and Nielsen, J., \"Beyond ALT Text: Making the web easy to use for users with disabilities,\" Nielsen, Norman Group, October, 2001, Available at: http://www.nngroup.com/reports/accessibility/]]",
      "doi": ""
    },
    {
      "text": "Coyne, K. P. and Nielsen, J., \"How to conduct usability evaluations for accessibility: Methodology guidelines for testing websites and intranets with users who use assistive technology,\" Nielsen Norman Group, October, 2001, Available at: http://www.nngroup.com/reports/accessibility/testing/]]",
      "doi": ""
    },
    {
      "text": "Diaper, D. and Worman, L., \"Two falls out of three in automated accessibility assessment of world wide web sites: A-prompt vs. Bobby,\" In Johnson, P. and Palanque, P. (Eds.), People and Computers XVII, Springer-Verlag.]]",
      "doi": ""
    },
    {
      "text": "Gray, W.D, and Salzman, M.C., \"Damaged merchandise? A review of experiments that compare usability evaluation methods,\" Human-Computer Interaction, 13(3):203--261, 1998.]]  ",
      "doi": "10.1207/s15327051hci1303_2"
    },
    {
      "text": "Hartson, H. R., Andre, T. S. and Williges, R. C., \"Criteria for evaluating usability evaluation methods,\" International Journal of Human Computer Interaction, 13(4):373--410, 2001.]]",
      "doi": ""
    },
    {
      "text": "Hertzum, M. and Jacobsen, N. E., \"The Evaluator Effect: A Chilling Fact about Usability Evaluation Methods,\" International Journal of Human Computer Interaction, 13(4):412--443, 2001.]]",
      "doi": ""
    },
    {
      "text": "Ivory, M. and Chevalier, A., \"A Study of Automated Web Site Evaluation Tools,\" Technical Report UW-CSE-02-10-01, University of Washington, Department of Computer Science and Engineering, 2002.]]",
      "doi": ""
    },
    {
      "text": "LIFT, http://www.usablenet.com/]]",
      "doi": ""
    },
    {
      "text": "National Center for Health Statistics, \"National health interview survey - disability supplement,\" 1994 and 1995.]]",
      "doi": ""
    },
    {
      "text": "Nielsen, J. and Molich, R., \"Heuristic Evaluation of User Interfaces,\" In Proc. of CHI'90, pp. 249--256, ACM Press, 1990.]]  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Paciello, M. G., Web accessibility for people with disabilities, CMP Books, KA, 2000.]] ",
      "doi": "10.5555/557400"
    },
    {
      "text": "Petrie, H. and Colwell, C., \"Tool to assist authors in creating accessible web pages,\" In Proc. of NTEVH 98: Telematics in the education of the visually handicapped, 1998. http://www.snv.jussieu.fr/inova/publi/ntevh/tools.htm]]",
      "doi": ""
    },
    {
      "text": "Rowan, M., et al., \"Evaluating web resources for disability access,\" In Proc. of ASSETS '00, pp. 80--84, ACM Press, 2000.]]  ",
      "doi": "10.1145/354324.354346"
    },
    {
      "text": "Sears, A., \"Heuristic Walkthroughs: Finding the problems without the noise,\" International Journal of Human-Computer Interaction, 9:213--234.]]",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. and Plaisant, C., Designing the user interface, 4th Edition, Pearson Education.]] ",
      "doi": "10.5555/61963"
    },
    {
      "text": "Sloan, D. et al., \"Accessible accessibility,\" In Proc. of CUU'00, pp.96--101, ACM Press, 2000.]]  ",
      "doi": "10.1145/355460.355480"
    },
    {
      "text": "Sullivan, T. and Matson, R., \"Barriers to use: Usability and content accessibility on the web's most popular sites,\" In Proc. of CUU'00, pp. 139--144, ACM Press, 2000.]]  ",
      "doi": "10.1145/355460.355549"
    },
    {
      "text": "Thatcher, J. et al., Accessible web sites, Springer-Verlag, NY, 2002.]] ",
      "doi": "10.5555/863710"
    },
    {
      "text": "Woolrych, A. and Cockton, G., \"Assessing Heuristic Evaluation: Mind the quality, not just the percentages,\" in Proc. of HCI 2000, pp. 35--36, 2000.]]",
      "doi": ""
    },
    {
      "text": "W3C Markup Validation Service, http://validator.w3.org/]]",
      "doi": ""
    },
    {
      "text": "W3C Web Content Accessibility Guidelines 1.0, http://www.w3.org/TR/WAI-WEBCONTENT]]",
      "doi": ""
    }
  ]
}