{
  "doi": "10.1145/1054972.1055031",
  "title": "prefuse: a toolkit for interactive information visualization",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "421-430",
  "year": 2005,
  "badges": [],
  "abstract": "Although information visualization (infovis) technologies have proven indispensable tools for making sense of complex data, wide-spread deployment has yet to take hold, as successful infovis applications are often difficult to author and require domain-specific customization. To address these issues, we have created prefuse, a software framework for creating dynamic visualizations of both structured and unstructured data. prefuse provides theoretically-motivated abstractions for the design of a wide range of visualization applications, enabling programmers to string together desired components quickly to create and customize working visualizations. To evaluate prefuse we have built both existing and novel visualizations testing the toolkit's flexibility and performance, and have run usability studies and usage surveys finding that programmers find the toolkit usable and effective.",
  "tags": [
    "user interfaces",
    "2D graphics",
    "toolkits",
    "interaction",
    "navigation",
    "graphs",
    "information visualization",
    "trees"
  ],
  "authors": [
    {
      "name": "Jeffrey Heer",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    },
    {
      "name": "Stuart K. Card",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81406592524/rel-imgonly/card_5x7.jpg",
      "acmid": "81406592524",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of Washington, Seattle, WA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Ahlberg, C. and B. Shneiderman. Visual Information Seeking: Tight Coupling of Dynamic Query Filters with Starfield Displays. CHI'94. pp. 313--317, April 1994.  ",
      "doi": "10.1145/191666.191775"
    },
    {
      "text": "Barnes, J. and P. Hut, A Hierarchical O(N Log N) Force Calculation Algorithm. Nature, 1986. 324(4).",
      "doi": ""
    },
    {
      "text": "Batagelj, V. and A. Mrvar, Pajek: Analysis and Visualization of Large Networks, in Graph Drawing Software, Springer. p. 77--103, 2003.",
      "doi": ""
    },
    {
      "text": "Battista, G.D., P. Eades, R. Tamassia, and I.G. Tollis, Graph Drawing: Algorithms for the Visualization of Graphs. Upper Saddle River, NJ: Prentice Hall, 1999. ",
      "doi": "10.5555/551884"
    },
    {
      "text": "Baudel, Thomas. Canonical Representation of Data-Linear Visualization Algorithms and its Applications. ILOG Report. http://www2.ilog.com/preview/Discovery/technology/DiscoveryResearchPaper.pdf",
      "doi": ""
    },
    {
      "text": "Bederson, B.B. Fisheye Menus. UIST'00. pp. 217--225, 2000.  ",
      "doi": "10.1145/354401.354782"
    },
    {
      "text": "Bederson, B. B., J. Grosjean, & J. Meyer. Toolkit Design for Interactive Structured Graphics, IEEE Transactions on Software Engineering, 30 (8), pp. 535--546, 2004.  ",
      "doi": "10.1109/TSE.2004.44"
    },
    {
      "text": "Bederson, B.B., J. Meyer, and L. Good. Jazz: An Extensible Zoomable User Interface Graphics Toolkit in Java. UIST'00. pp. 171--180 2000.  ",
      "doi": "10.1145/354401.354754"
    },
    {
      "text": "Borner, K. et al. The XML Toolkit. Project Webpage. 2003. http://iv.slis.indiana.edu/sw/toolkit/.html",
      "doi": ""
    },
    {
      "text": "Bruls, M., K. Huizing, and J.J. van Wijk. Squarified TreeMaps. In Proceedings of Joint Eurographics and IEEE TCVG Symp. on Visualization (TCVG 2000): IEEE Press. pp. 33--42, 2000.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Information Visualization, in The Human-Computer Interaction Handbook. Lawrence Erlbaum Associates, 2002.",
      "doi": ""
    },
    {
      "text": "Card, S.K., J.D. Mackinlay, and B. Shneiderman, Readings in Information Visualization: Using Vision to Think. San Francisco, California: Morgan-Kaufmann, 1999. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Card, S.K. and D. Nation. Degree-of-Interest Trees: A Component of an Attention-Reactive User Interface. Advanced Visual Interfaces. 2002.  ",
      "doi": "10.1145/1556262.1556300"
    },
    {
      "text": "Card, S.K., G.G. Robertson, and J.D. Mackinlay. The Information Visualizer, an Information Workspace. CHI'91. pp. 181--188 1991.  ",
      "doi": "10.1145/108844.108874"
    },
    {
      "text": "Chi, E.H. A Taxonomy of Visualization Techniques Using the Data State Reference Model. InfoVis '00. pp. 69--75 2000. ",
      "doi": "10.5555/857190.857691"
    },
    {
      "text": "Chi, E.H. Expressiveness of the Data Flow and Data State Models in Visualization Systems. Advanced Visual Interfaces. Trento, Italy, May 2002.  ",
      "doi": "10.1145/1556262.1556327"
    },
    {
      "text": "Fekete, J.-D. The InfoVis Toolkit, InfoVis '04, pp. 167--174, 2004.  ",
      "doi": "10.5555/1038262.1038796"
    },
    {
      "text": "Furnas, G.W., The Fisheye View: A New Look at Structured Files, in Readings in Information Visualization: Using Vision to Think, S.K. Card, et al, Editors. Morgan Kaufmann: San Francisco, 1981. ",
      "doi": "10.5555/300679.300769"
    },
    {
      "text": "Graphviz. http://www.research.att.com/sw/tools/graphviz/",
      "doi": ""
    },
    {
      "text": "Grokking the Infoviz, Economist Technology Quarterly, June 2003.",
      "doi": ""
    },
    {
      "text": "Heer, J. Vizster: Visualizing Online Social Networks. April 2004. http://www.cs.berkeley.edu/~jheer/infovis/final",
      "doi": ""
    },
    {
      "text": "Heer, J. and S.K. Card. DOITrees Revisited: Scalable, Space-Constrained Visualization of Hierarchical Data. Advanced Visual Interfaces. Gallipoli, Italy, May 2004.  ",
      "doi": "10.1145/989863.989941"
    },
    {
      "text": "Henry, T.R. and S.E. Hudson. Interactive Graph Layout. UIST'91. pp. 55--64, November 1991.  ",
      "doi": "10.1145/120782.120788"
    },
    {
      "text": "Hudson, S. and J.T. Stasko. Animation Support in a User Interface Toolkit: Flexible, Robust, and Reusable Abstractions. UIST'93. pp. 57--67, 1993.  ",
      "doi": "10.1145/168642.168648"
    },
    {
      "text": "Igarashi, T. and K. Hinckley. Speed-Dependent Automatic Zooming for Browsing Large Documents. UIST'00. pp. 139--148, 2000.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Karrer, A. and W. Scacchi. Requirements for an Extensible Object-Oriented Tree/Graph Editor. UIST'90. pp. 84--91, October 1990.  ",
      "doi": "10.1145/97924.97934"
    },
    {
      "text": "The Visualization Toolkit User's Guide: Kitware, Inc., 2003.",
      "doi": ""
    },
    {
      "text": "Klemmer, S.R., J. Li, J. Lin, and J.A. Landay. Papier-Mâché: Toolkit Support for Tangible Input. CHI'04, Vienna, Austria 2004.  ",
      "doi": "10.1145/985692.985743"
    },
    {
      "text": "Krasner, G.E. and S.T. Pope, A Description of the Model-View-Controller User Interface Paradigm in the Smalltalk-80 System. Journal of Object-Oriented Programming, 1988. 1(3): p. 26--49. ",
      "doi": "10.5555/50757.50759"
    },
    {
      "text": "Lamping, J. and R. Rao, The Hyperbolic Browser: A Focus + Context Technique for Visualizing Large Hierarchies. Journal of Visual Languages and Computing, 1996. 7(1): p. 33--55.",
      "doi": ""
    },
    {
      "text": "Lee, B., C.S. Parr, D. Campbell, and B. Bederson. How Users Interact with Biodiversity Information Using Taxontree. Advanced Visual Interfaces. Gallipoli, Italy 2004.  ",
      "doi": "10.1145/989863.989918"
    },
    {
      "text": "Leung, Y.K. and M.D. Apperley, A Review and Taxonomy of Distortion-Oriented Presentation Techniques. ACM Transactions on Computer-Human Interaction, 1994. 1(2): p. 126--160.  ",
      "doi": "10.1145/180171.180173"
    },
    {
      "text": "Mackinlay, J.D., S.K. Card, and G.G. Robertson, Rapid, Controlled Movement through a Virtual 3d Workspace. Computer Graphics, 1990. 42(4): p. 1971--1976.  ",
      "doi": "10.1145/97880.97898"
    },
    {
      "text": "Mackinlay, J.D., G. Robertson, and S.K. Card. The Perspective Wall: Detail and Context Smoothly Integrated. CHI91. pp. 173--179 1991.  ",
      "doi": "10.1145/108844.108870"
    },
    {
      "text": "Marshall, M.S., I. Herman, and G. Melancon, An Object-Oriented Design for Graph Visualization. Software: Practice and Experience, 2001. 31(8): p. 739--756.",
      "doi": ""
    },
    {
      "text": "Myers, B.A., A New Model for Handling Input. ACM Transactions on Information Systems, 1990. 8(3): p. 289--320.  ",
      "doi": "10.1145/98188.98204"
    },
    {
      "text": "Myers, B.A., S.E. Hudson, and R.F. Pausch, Past, Present, and Future of User Interface Software Tools. ACM Transactions on Computer-Human Interaction, 2000. 7(1): p. 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Perlin, K. and D. Fox. Pad: An Alternative Approach to the Computer Interface. SIGGRAPH'93. pp. 57--64, 1993.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Plaisant, C., J. Grosjean, and B. Bederson. Spacetree: Supporting Exploration in Large Node Link Tree, Design Evolution and Empirical Evaluation. InfoVis'02. Boston, MA. pp. 57--64, October 2002. ",
      "doi": "10.5555/857191.857752"
    },
    {
      "text": "Reingold, E.M. and J.S. Tilford, Tidier Drawings of Trees. IEEE Transactions of Software Engineering, 1981. SE-7: p. 21--28.",
      "doi": ""
    },
    {
      "text": "Robertson, G.G., M. Czerwinski, K. Larson, D.C. Robbins, D. Thiel, and M.v. Dantzich. Data Mountain: Using Spatial Memory for Document Management. UIST'98. pp. 153--162 1998.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Robertson, G.G., J.D. Mackinlay, and S.K. Card. Cone Trees: Animated 3D Visualizations of Hierarchical Information. CHI'91. pp. 189--194, 1991.  ",
      "doi": "10.1145/108844.108883"
    },
    {
      "text": "Sarkar, M. and M.H. Brown. Graphical Fisheye Views of Graphs. CHI'92. pp. 83--91, May 1992.  ",
      "doi": "10.1145/142750.142763"
    },
    {
      "text": "Treemaps for Space-Constrained Visualization of Hierarchies. 1998. http://www.cs.umd.edu/hcil/treemap-history/",
      "doi": ""
    },
    {
      "text": "Stolte, C., D. Tang, and P. Hanrahan, Polaris: A System for Query, Analysis and Visualization of Multi-Dimensional Relational Databases. IEEE Transactions on Visualization and Computer Graphics, 2002. 8(1).  ",
      "doi": "10.1109/2945.981851"
    },
    {
      "text": "Tufte, The Visual Display of Quantitative Information. Graphics Press, 1983. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Visual Thesaurus. http://www.visualthesaurus.com",
      "doi": ""
    },
    {
      "text": "Yee, K.-P., D. Fisher, R. Dhamija, and M.A. Hearst. Animated Exploration of Dynamic Graphs with Radial Layout. InfoVis'01. pp. 43--50 2001. ",
      "doi": "10.5555/580582.857705"
    }
  ]
}