{
  "doi": "10.1145/1054972.1055092",
  "title": "The syntax or the story behind it?: a usability study of student work with computer-based programming environments in elementary science",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "849-858",
  "year": 2005,
  "badges": [],
  "abstract": "This is a descriptive case study investigating the use of two computer-based programming environments (CPEs), MicroWorlds™ Logo (MW) and Stagecast Creator™ (SC) for collaborative scientific modeling. The purpose of the study was to investigate and comparatively describe student approaches to scientific modeling through the use of textual or graphical program languages (PL). I analyzed student activities and conversations in two after-school clubs, one working with MW and the other with SC, using contextual inquiry, analysis of student conversation and artifact analysis. The findings suggest that student work with CPEs differed between different PL. Students used SC to create games (focusing on the overall story) whereas MW students used MW through a frame of formal programming. Programming in SC was much easier than MW, whereas reading code in MW was more tangible. Findings suggest that differences in student approaches to scientific modeling through programming need to be considered by educators seeking to engage students in such activities and software developers seeking to develop CPEs for young learners.",
  "tags": [
    "procedural programming",
    "scientific modeling",
    "object-oriented interface",
    "computer-based programming environments"
  ],
  "authors": [
    {
      "name": "Loucas Louca",
      "institution": "University of Cyprus, Nicosia, Cyprus",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584026",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ball, L., D. (1993). With an eye on the mathematical horizon: dilemmas of teaching elementary school mathematics. The elementary school journal, 93 (4), 373--397.",
      "doi": ""
    },
    {
      "text": "Bogdan, R., C. & Bilken,S., K. (1998). Qualitative research for education: An introduction to theory and methods. MA: Allyn & Bacon.",
      "doi": ""
    },
    {
      "text": "Colella, V., A., Klopfer, E., & Resnick, M. (2000). Adventures in modeling: Exploring Complex, Dynamic systems with Starlogo. NY: Teachers College Press. ",
      "doi": "10.5555/558772"
    },
    {
      "text": "Creswell, W. J. (1988). Qualitative inquiry and research design: Choosing among five traditions. Thousands Oaks, CA: Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "diSessa, A. A., Abelson, H., & Ploger, D. (1991). An overview of Boxer. Journal of Mathematical Behavior, 10, 3--15.",
      "doi": ""
    },
    {
      "text": "Cypher, A., & Smith, D. (1995). KidSim: End user programming of simulations. In Proceedings of CHI' 95, ACM Press, NY, p. 27--34.  ",
      "doi": "10.1145/223904.223908"
    },
    {
      "text": "Druin, A., Bederson, B., Boltman, A., Miura, A., Knotts-Callahn, D. & Plat, M. (1999). Children as our technology design partners. In A. Druin (Ed.). The Design of Children's Technology. San Francisco: Morgan Kaufmann Publishers, Inc. ",
      "doi": "10.5555/303430.303435"
    },
    {
      "text": "Edwards, D. & Mercer, N. (1995). Common knowledge: The development of understanding in the classroom. NY: Routtedge.",
      "doi": ""
    },
    {
      "text": "Gallas, K. (1995). Talking their way into science: hearing children's questions and theories, responding with curricula. NY: Teachers College Press.",
      "doi": ""
    },
    {
      "text": "Hammer, D. M., & Elby, A. (2003). Tapping epistemological resources for learning physics. Journal of the Learning Sciences, 12(1), 53--90.",
      "doi": ""
    },
    {
      "text": "Louca, L. & Constantinou, C. (1999, June). The use of Stagecast Creator in constructing modeling skills in physical science: The case of the single lens camera. Proceedings of the Forth International Conference on Computer-Based Learning in Science, University of Twente, Enschede, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Louca, L., Druin, A., Hammer, D., & Dreher, D. (2003). Students' collaborative use of computer-based programming tools in science: A Descriptive Study. In B. Wasson, St. Ludvigsen, & Ul. Hoppe (Eds.). Designing for Change in Networked Learning Environments: Proceedings of the International Conference on Computer Support for Collaborative Learning 2003 (CSCL) (pp. 109--118) The Netherlands: Kluwer Academic Publishers.",
      "doi": ""
    },
    {
      "text": "Louca, L (to appear). What does it take to teach programming at early elementary level in Cyprus? The cases of SC and MW.",
      "doi": ""
    },
    {
      "text": "Louca, L. (2004). Case studies of fifth-grade student modeling in science through programming: comparison of modeling practices and conversations. Unpublished doctoral dissertation, University of Maryland, College Park.",
      "doi": ""
    },
    {
      "text": "Merriam, B. S. (1988). Case studies research in education. A qualitative approach. San Francisco, CA: Jossey-Bass, Inc., Publishers.",
      "doi": ""
    },
    {
      "text": "Papert, S. (1993). The Children's machine: Rethinking school in the age of the computer. NY: Basic Books. ",
      "doi": "10.5555/139395"
    },
    {
      "text": "Pea, R. (1984). Intergrading human and computer intelligence. Technical Report no. 32. Banks Street College of Education: New York, NY.",
      "doi": ""
    },
    {
      "text": "Rader, C., Brand, C., & Lewis, Cl. (1997). Degrees of comprehension: children's understanding of visual programming environment, Communications of the ACM, 351--358.  ",
      "doi": "10.1145/258549.258793"
    },
    {
      "text": "Redish, E. F. & Wilson, J. M. (1993). Student programming in the introductory physics course: M.U.P.P.E.T. American Journal of Physics, 61 (3), 222--232.",
      "doi": ""
    },
    {
      "text": "Schoenfeld, A. H. (1989). Teaching mathematical thinking and problem solving. In L. B. Resnick & B. L. Klopfer (Eds.), Towards the thinking curriculum: Current cognitive research (pp. 83-103). Washington DC: ASCD.",
      "doi": ""
    },
    {
      "text": "Sherin, Br. (1996). The Symbolic Basis of Physical Intuition. A Study of Two Symbol Systems in Physics Instruction. Unpublished dissertation Thesis.",
      "doi": ""
    },
    {
      "text": "Sherin, Br., diSessa, A. A., & Hammer, D. (1993). Dynaturtle revisited: Learning physics through collaborative design of a computer model. Interactive Learning Environments, 3 (2), 91--118.",
      "doi": ""
    },
    {
      "text": "Sinclair J. McH., & Coulthard, R., M. (1975). Towards an analysis of discourse: The English used by teachers and pupils. London: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Smith, D., C. & Cypher, Al. (1999). Making programming easier for children. In A. Druin (Ed.). The Design of Children's Technology. San Francisco: Morgan Kaufmann Publishers, Inc. ",
      "doi": "10.5555/303430.303441"
    },
    {
      "text": "Smith, D., C., Cypher, A., & Telser, L. (2000). Novice programming comes of Age. Communications of the ACM, 43 (3), 75--81.  ",
      "doi": "10.1145/330534.330544"
    },
    {
      "text": "Stake, R. E. (2000) Case Studies. In N. K. Denzin & Y. S. Lincoln (Eds.), Handbook of qualitative research. (435--454). Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Strauss, A., & Corbin, J. (1998). Basics of qualitative research. Techniques and procedures for developing grounded theory. Thousand Oaks, CA: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Underwood, G., Underwood, J., Pheasey, K., & Gilmore, D. (1996). Collaboration and discourse while programming the KidSim microworld simulation. Computers & Education, 26, 143--151.",
      "doi": ""
    },
    {
      "text": "White, B. Y. and Frederiksen, J. R. (1998). Inquiry, modeling and metacognition: Making science accessible to all students. Cognition & Instruction, 16 (11), 3--118.",
      "doi": ""
    },
    {
      "text": "Wilensky, Ur., & Resnick, M. (1999). Thinking in Levels: A Dynamic Systems Approach to Making Sense of the World. Journal of Science Education and Technology, 8 (1), 3--19.",
      "doi": ""
    }
  ]
}