{
  "doi": "10.1145/1054972.1055074",
  "title": "Designing the spectator experience",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "741-750",
  "year": 2005,
  "badges": [],
  "abstract": "Interaction is increasingly a public affair, taking place in our theatres, galleries, museums, exhibitions and on the city streets. This raises a new design challenge for HCI - how should spectators experience a performer's interaction with a computer? We classify public interfaces (including examples from art, performance and exhibition design) according to the extent to which a performer's manipulations of an interface and their resulting effects are hidden, partially revealed, fully revealed or even amplified for spectators. Our taxonomy uncovers four broad design strategies: 'secretive,' where manipulations and effects are largely hidden; 'expressive,' where they tend to be revealed enabling the spectator to fully appreciate the performer's interaction; 'magical,' where effects are revealed but the manipulations that caused them are hidden; and finally 'suspenseful,' where manipulations are apparent but effects are only revealed as the spectator takes their turn.",
  "tags": [
    "magic",
    "spectators",
    "expression",
    "galleries",
    "museums",
    "art",
    "performance",
    "design framework",
    "public experiences"
  ],
  "authors": [
    {
      "name": "Stuart Reeves",
      "institution": "The University of Nottingham, Nottingham, UK",
      "img": "/do/10.1145/contrib-81100228688/rel-imgonly/headshot2-2016.jpg",
      "acmid": "81100228688",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "The University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Claire O'Malley",
      "institution": "The University of Nottingham, Nottingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593242",
      "orcid": "missing"
    },
    {
      "name": "Mike Fraser",
      "institution": "The University of Bristol, Bristol, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100364452",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agre, P. E., Changing Places, Contexts of Awareness in Computing. In Human Computer Interaction, 16 (2-4), pp. 177--192, 2001.  ",
      "doi": "10.1207/S15327051HCI16234_04"
    },
    {
      "text": "Aoki, P.M., Grinter, R.E., Hurst, A., Szymanski, M.H., Thornton, J.D. and Woodruff, A. Sotto Voce: exploring the interplay of conversation and mobile audio spaces. In Proc. CHI 2002, pp. 431--438, ACM Press.  ",
      "doi": "10.1145/503376.503454"
    },
    {
      "text": "Bellotti, V., Back, M., Edwards, W.K., Grinter, R.E., Henderson, A. and Lopes, C. Making sense of sensing systems: Five questions for designers and researchers. In Proc. CHI 2002, pp. 415--422, ACM Press.  ",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Benford, S., Flintham, M., Drozd, A., Anastasi, R., Rowland, D., Tandavanitj, N., Adams, M., Row-Farr, J., Oldroyd, A. and Sutton, J. Uncle Roy All Around You: Implicating the City in a Location-Based Performance. In Proc. Advances in Computer Entertainment (ACE 2004), ACM Press.",
      "doi": ""
    },
    {
      "text": "Borchers, J. A Pattern Approach to Interaction Design. John Wiley & Sons, Inc., 2001. ",
      "doi": "10.5555/558433"
    },
    {
      "text": "Bowers, J., TONETABLE: A Multi-User, Mixed Media, Interactive Installation. In Proc. COST G-6 Conference on Digital Audio Effects (DAFX-01), 2001.",
      "doi": ""
    },
    {
      "text": "Bowers, J. and Hellström, S.O., Simple interfaces to complex sound in improvised music. In Proc. CHI 2000 Extended Abstracts, pp. 125--126, ACM Press.  ",
      "doi": "10.1145/633292.633364"
    },
    {
      "text": "Davies, C. and Harrison, J. \"Osmose: Towards Broadening the Aesthetics of Virtual Reality,\" ACM Computer Graphics: Virtual Reality, Vol. 30 (4) (1996).  ",
      "doi": "10.1145/240806.240808"
    },
    {
      "text": "Drozd, A., Bowers, J., Benford, S., Greenhalgh, C. and Fraser, M. Collaboratively Improvising Magic: An Approach to Managing Participation in an On-Line Drama. In Proc. European Conference on Computer-Supported Cooperative Work (ECSCW), pp. 159--178, Kluwer, 2001. ",
      "doi": "10.5555/1241867.1241876"
    },
    {
      "text": "Fraser, M., Stanton, D., Ng, K. H., Benford, S., O'Malley, S., Bowers, J., Taxén, G., Ferris, K. and Hindmarsh, J. Assembling history: Achieving coherent experiences with diverse technologies. In Proc. of European Conference on Computer Supported Cooperative Work (ECSCW), pp. 179--198. Oulu University Press, 2003. ",
      "doi": "10.5555/1241889.1241899"
    },
    {
      "text": "Gaver, W. W., Beaver, J. and Benford, S, Ambiguity as a Resource for Design. In Proc. CHI 2003, pp. 233--240, ACM Press.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Geser, H., Towards a Sociological Theory of the Mobile Phone, University of Zürich, 2001.",
      "doi": ""
    },
    {
      "text": "Heath, C. and Luff, P. K. Collaboration and Control: Crisis management and multimedia technology in London Underground Line Control Rooms. In Journal of Computer Supported Cooperative Work, 1 (1-2), pp. 69--94, Kluwer, 1992.",
      "doi": ""
    },
    {
      "text": "Heath, C., Luff, P. K., vom Lehn, D., Hindmarsh, J., and Cleverly, J. Crafting participation: Designing ecologies, configuring experience. In Visual Communication, 1(1), 2002, pp. 9--34.",
      "doi": ""
    },
    {
      "text": "Koleva, B., Schnädelbach, H., Benford, S., Greenhalgh, C. Traversable interfaces between real and virtual worlds. In Proc. CHI 2000, pp. 233--240, ACM Press.  ",
      "doi": "10.1145/332040.332437"
    },
    {
      "text": "Koleva, B., Taylor, I., Benford, S., Fraser, M., Greenhalgh, C., Schnådelbach, H., Lehn, D.v., Heath, C., Row-Farr J., and Adams, M. Orchestrating a mixed reality performance. In Proc. CHI 2001, pp. 38--45, ACM Press.  ",
      "doi": "10.1145/365024.365033"
    },
    {
      "text": "Lamont, P. and Wiseman, R. Magic in Theory: An introduction to the theoretical and psychological elements of conjouring. University of Hertfordshire Press, 1999.",
      "doi": ""
    },
    {
      "text": "Laurel, B., Computers as Theatre, Addison-Wesley, 1993. ",
      "doi": "10.5555/529145"
    },
    {
      "text": "vom Lehn, D., Heath, C. and Hindmarsh, J. Exhibiting interaction: Conduct and collaboration in museums and galleries. In Symbolic Interaction, 24(2), pp. 189--216.",
      "doi": ""
    },
    {
      "text": "Maynes-Aminzade, D., Pausch, R. and Seitz, S. Techniques for Interactive Audience Participation. In Proc. IEEE International Conference on Multimodal Interfaces (ICMI), 2002.  ",
      "doi": "10.1109/ICMI.2002.1166962"
    },
    {
      "text": "Reeves, S., Fraser. M. and Benford, S., Engaging Augmented Reality, Presentation at alt.chi2005, in Adjunct Proceedings of CHI 2005, Portland, Oregon, 2005, ACM.",
      "doi": ""
    },
    {
      "text": "Rosen, C. Piano Notes: The Hidden World of the Pianist. Penguin Press, 2002.",
      "doi": ""
    },
    {
      "text": "Sanneblad, J. and Holmquist, L. E. \"Why is everyone inside me?!\" Using Shared Displays in Mobile Computer Games. In Proc. of International Conference on Entertainment Computing (ICEC), 2004.",
      "doi": ""
    },
    {
      "text": "Schnädelbach, H., Koleva, B., Flintham, M., Fraser, M., Izadi, S., Chandler, P., Foster, M., Benford, S., Greenhalgh, C. and Rodden, T. The Augurscope: A mixed reality interface for outdoors. In Proc. CHI 2002, pp. 9--16, ACM Press.  ",
      "doi": "10.1145/503376.503379"
    },
    {
      "text": "Sheridan, J., Dix, A., Lock, S. and Bayliss, A. Understanding Interaction in Ubiquitous Guerrilla Performances in Playful Arenas. In Proc. British HCI Conference, 2004.",
      "doi": ""
    },
    {
      "text": "Stewart, J., Bederson, B. and Druin, A., Single Display Groupware: a Model for Co-present Collaboration. In Proc. CHI 1999, pp. 286--293, ACM Press.  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Sudnow, D., Ways of the Hand: The Organization of Improvised Conduct, Routledge & Kegan Paul, 1978.",
      "doi": ""
    },
    {
      "text": "Wilson, S., Information Arts: Intersections of art, science and technology, The MIT Press, 2002.",
      "doi": ""
    },
    {
      "text": "Z, P., Audible Image/Visible Sound: Donald Swearingen's Living off the List. 21st Century Music, 8 (1).",
      "doi": ""
    }
  ]
}