{
  "doi": "10.1145/1054972.1055094",
  "title": "Effectiveness of end-user debugging software features: are there gender issues?",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "869-878",
  "year": 2005,
  "badges": [],
  "abstract": "Although gender differences in a technological world are receiving significant research attention, much of the research and practice has aimed at how society and education can impact the successes and retention of female computer science professionals-but the possibility of gender issues within software has received almost no attention. If gender issues exist with some types of software features, it is possible that accommodating them by changing these features can increase effectiveness, but only if we know what these issues are. In this paper, we empirically investigate gender differences for end users in the context of debugging spreadsheets. Our results uncover significant gender differences in self-efficacy and feature acceptance, with females exhibiting lower self-efficacy and lower feature acceptance. The results also show that these differences can significantly reduce females' effectiveness.",
  "authors": [
    {
      "name": "Laura Beckwith",
      "institution": "Oregon State University, Corvallis, Oregon",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022759",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, Oregon",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Susan Wiedenbeck",
      "institution": "Drexel University, Philadelphia, Pennsylvania",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100387125",
      "orcid": "missing"
    },
    {
      "name": "Curtis Cook",
      "institution": "Oregon State University, Corvallis, Oregon",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452601376",
      "orcid": "missing"
    },
    {
      "name": "Shraddha Sorte",
      "institution": "Oregon State University, Corvallis, Oregon",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100522442",
      "orcid": "missing"
    },
    {
      "name": "Michelle Hastings",
      "institution": "Oregon State University, Corvallis, Oregon",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100061557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allwood, C. Error detection processes in statistical problem solving. Cognitive Science 8, 4 (1984), 413--437.",
      "doi": ""
    },
    {
      "text": "Bandura, A. Self-efficacy: Toward a unifying theory of behavioral change. Psychological Review 8, 2 (1977), 191--215.",
      "doi": ""
    },
    {
      "text": "Bandura, A. Social Foundations of Thought and Action. Prentice Hall, Englewood Cliffs NJ, 1986.",
      "doi": ""
    },
    {
      "text": "Beckwith, L. and Burnett M. Gender: An important factor in end-user programming environments? In Proc. IEEE Symposium on Visual Languages and Human-Centric Computing (2004), 107--114.  ",
      "doi": "10.1109/VLHCC.2004.28"
    },
    {
      "text": "Beyer, S., DeKeuster, M., Rynes, K., Kostman, A., and DeGregorio, N. Barriers to women's success in Management Information Systems courses. In Proc. American Psychological Society (2004).",
      "doi": ""
    },
    {
      "text": "Blackwell, A. First steps in programming: a rationale for attention investment models. In Proc. IEEE Human-Centric Computing Languages and Environments (2002), 2--10. ",
      "doi": "10.5555/795687.797842"
    },
    {
      "text": "Burnett, M., Atwood, J., Djang, R., Gottfried, H., Reichwein, J. and Yang, S. Forms/3: A first-order visual language to explore the boundaries of the spreadsheet paradigm. Journal of Functional Programming 11, 2 (2001), 155--206. ",
      "doi": "10.5555/968486.968487"
    },
    {
      "text": "Burnett, M., Cook, C. and Rothermel G. End-user software engineering. Communications of the ACM 47, 9 (2004), 53--58.  ",
      "doi": "10.1145/1015864.1015889"
    },
    {
      "text": "Busch, T. Gender differences in self-efficacy and attitudes toward computers. Journal of Educational Computing Research 12, 2 (1995), 147--158.",
      "doi": ""
    },
    {
      "text": "Byrnes, J. P., Miller, D. C. and Schafer W. D. Gender differences in risk taking: A meta-analysis. Psychological Bulletin 125, (1999), 367--383.",
      "doi": ""
    },
    {
      "text": "Camp, T. The incredible shrinking pipeline. Communications of the ACM 40, 10 (1997), 103--110.  ",
      "doi": "10.1145/262793.262813"
    },
    {
      "text": "Compeau, D. and Higgins, C. Computer self-efficacy: development of a measure and initial test. MIS Quarterly 19, 2 (1995), 189--211.  ",
      "doi": "10.2307/249688"
    },
    {
      "text": "Compeau, D., Higgins, C. A. and Huff, S. Social cognitive theory and individual reactions to computing technology: a longitudinal study. MIS Quarterly 23, 2 (1999), 145--158.  ",
      "doi": "10.2307/249749"
    },
    {
      "text": "Czerwinski, M., Tan, D. S. and Robertson, G. G. Women take a wider view. In Proc. CHI 2002, ACM Press (2002), 195--202.  ",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Davis, F. D. Perceived usefulness, perceived ease of use, and user acceptance of information technology. MIS Quarterly 13, 3 (1989), 319--340.",
      "doi": "10.2307/249008"
    },
    {
      "text": "Finucane, M., Slovic, P., Merz., C-K., Flynn, J. and Satterfield, T. Gender, race and perceived risk: the white male effect. Health, Risk and Society 2, 2 (2000), 159--172.",
      "doi": ""
    },
    {
      "text": "Fisher, A., Margolis, J. and Miller, F. Undergraduate women in computer science: Experience, motivation, and culture. In Proc. SIGCSE Technical Symposium on Computer Science Education, ACM Press (1997), 106--110.  ",
      "doi": "10.1145/268084.268127"
    },
    {
      "text": "Hartzel, K. How self-efficacy and gender issues affect software adoption and use. Communications of the ACM 46, 9 (2003), 167--171.  ",
      "doi": "10.1145/903893.903933"
    },
    {
      "text": "Huff, C. Gender, software design, and occupational equity. ACM SIGCSE Bulletin 34, 2 (2002), 112--115.  ",
      "doi": "10.1145/543812.543842"
    },
    {
      "text": "Jiankoplos, N. A. and Bernasek, A. Are women more risk averse? Economic Inquiry 36, 4 (1998), 620--630.",
      "doi": ""
    },
    {
      "text": "Margolis, J., Fisher, A., Miller, F., Caring about connections: Gender and computing, IEEE Technology and Society Magazine 18, 4 (1999), 13--20.",
      "doi": ""
    },
    {
      "text": "Nass, C., Moon, Y., and Green, C. Are machines gender-neutral? Gender-stereotypic responses to computers with voices. Journal of Applied Social Psychology 27, (1997), 864--876.",
      "doi": ""
    },
    {
      "text": "Panko, R. What we know about spreadsheet errors. Journal of End User Computing 10, 2 (1998), 15--21. ",
      "doi": "10.5555/287893.287899"
    },
    {
      "text": "Robertson, T. J., Prabhakararao, S., Burnett, M., Cook, C., Ruthruff, J., Beckwith, L. and Phalgune, A. Impact of interruption style on end-user debugging. In Proc. CHI 2004, ACM Press (2004), 287--294.  ",
      "doi": "10.1145/985692.985729"
    },
    {
      "text": "Rothermel G., Burnett M., Li L., Dupuis, C. and Sheretov, A. A methodology for testing spreadsheets, ACM Transactions on Software Engineering and Methodology 10, 1 (2001), 110--147.  ",
      "doi": "10.1145/366378.366385"
    },
    {
      "text": "Ruthruff, J., Burnett, M. and Rothermel, G. An empirical study of fault localization for end-user programmers, In Proc. International Conference on Software Engineering (2005), to appear.  ",
      "doi": "10.1145/1062455.1062523"
    },
    {
      "text": "Ruthruff, J., Phalgune, A., Beckwith, L., Burnett, M. and Cook, C. Rewarding 'good' behavior: End-user debugging and rewards. In Proc. IEEE Visual Languages and Human-Centric Computing (2004), 115--122.  ",
      "doi": "10.1109/VLHCC.2004.44"
    },
    {
      "text": "Tan D. S., Czerwinski, M., and Robertson, G. G. Women go with the (optical) flow. In Proc. CHI 2003, ACM Press (2003), 209--215.  ",
      "doi": "10.1145/642611.642649"
    },
    {
      "text": "Torkzadeh, G. and Koufteros, X. Factorial validity of a computer self-efficacy scale and the impact of computer training. Educational and Psychological Measurement 54, 3 (1994), 813--821.",
      "doi": ""
    },
    {
      "text": "Torkzadeh, G. and Van Dyke, T. Effects of training on internet self-efficacy and computer user attitudes. Computers in Human Behavior 18, (2002), 479--494.",
      "doi": ""
    },
    {
      "text": "Venkatesh, V. and Morris M. G. Why don't men ever stop to ask for directions? Gender, social influence, and their role in technology acceptance and usage behavior. MIS Quarterly 24, 1 (2000), 115--139.  ",
      "doi": "10.2307/3250981"
    },
    {
      "text": "Whitworth, J. E., Price, B. A. and Randall, C. H. Factors that affect college of business student opinion of teaching and learning. Journal of Education for Business 77, 5 (2002), 282--289.",
      "doi": ""
    },
    {
      "text": "Wilson, A., Burnett, M., Beckwith, L., Granatir, O., Casburn, L., Cook, C., Durham, M. and Rothermel, G. Harnessing curiosity to increase correctness in end-user programming. In Proc. CHI 2003, ACM Press (2003), 305--312.  ",
      "doi": "10.1145/642611.642665"
    }
  ]
}