{
  "doi": "10.1145/1054972.1055076",
  "title": "Values at play: design tradeoffs in socially-oriented game design",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "751-760",
  "year": 2005,
  "badges": [],
  "abstract": "Significant work in the CHI community has focused on designing systems that support human values. Designers and engineers have also become increasingly aware of ways in which the artifacts they create can embody political, social, and ethical values. Despite such an awareness, there has been little work towards producing practical methodologies that systematically incorporate values into the design process. Many designers struggle to find a balance between their own values, those of users and other stakeholders, and those of the surrounding culture. In this paper, we present the RAPUNSEL project as a case study of game design in a values-rich context and describe our efforts toward navigating the complexities this entails. Additionally, we present initial steps toward the development of a systematic methodology for discovery, analysis, and integration of values in technology design in the hope that others may both benefit from and build upon this work.",
  "tags": [
    "gender and computing",
    "programming pedagogy",
    "social issues",
    "values"
  ],
  "authors": [
    {
      "name": "Mary Flanagan",
      "institution": "Film & Media Hunter College, New York, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100538614",
      "orcid": "missing"
    },
    {
      "name": "Daniel C. Howe",
      "institution": "New York University, New York, NY",
      "img": "/do/10.1145/contrib-81100308687/rel-imgonly/_dhowesq.png",
      "acmid": "81100308687",
      "orcid": "missing"
    },
    {
      "name": "Helen Nissenbaum",
      "institution": "New York University, New York, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104436",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S., & Cranor, L. Privacy critics: UI components to safeguard users' privacy. In Ex. Ab. CHI 1999, ACM Press (1999), 258--259.  ",
      "doi": "10.1145/632716.632875"
    },
    {
      "text": "Agre, P.E. Introduction. In P.E. Agre & M. Rotenberg (eds.), Technology and Privacy: The New Landscape. MIT Press, Cambridge, MA, USA (1997), 1--28. ",
      "doi": "10.5555/275283.275284"
    },
    {
      "text": "American Assn of Univ, Woman (AAUW).Tech-Savvy: Educating Girls in the New Computer Age. (April 2000). Available Online: http://www. aauw.org/2000/techsavvy.html",
      "doi": ""
    },
    {
      "text": "Beck, K. Extreme Programming Explained: Embrace Change. Addison-Wesley, Boston, MA, USA (1999). ",
      "doi": "10.5555/318762"
    },
    {
      "text": "Bødker, S., & Grøønbæk, K. Design in action: From prototyping by demonstration to cooperative prototyping.\" In J. Greenbaum & M. Kyng (eds.), Design at Work: Cooperative Design of Computer Systems. Erlbaum, Hillsdale, NJ, USA (1991).",
      "doi": ""
    },
    {
      "text": "Brunner, C. Opening technology to girls: The approach computer-using teachers take may make the difference. Electronic Learning, 16:4 (February 1997), 55.",
      "doi": ""
    },
    {
      "text": "Brey, P. (2000) Disclosive Computer Ethics, Computers and Society, Vol. 30: 4 (2000) 10--16.  ",
      "doi": "10.1145/572260.572264"
    },
    {
      "text": "Catsambis, S. The path to math: Gender and racial-ethnic differences in mathematics participation from middle to high school. In Sociology of Education 67 (1994), 199--215.",
      "doi": ""
    },
    {
      "text": "Chaika, M. Ethical Considerations in gender-oriented entertainment technology. In Crossroads of the ACM. (November 1995). Available Online: http://www.acm. org/crossroads/ xrds2-2/gender.html  ",
      "doi": "10.1145/332180.332183"
    },
    {
      "text": "Chmielewski, D.C. Kids turning to instant messaging. Knight Ridder, (25 Feb 2004). Available Online: http://www.azcentral.com/families/articles/0225faminstantmessage.html",
      "doi": ""
    },
    {
      "text": "Chu Clewell, B. Breaking the barriers: The critical middle school years. In The Jossey-Bass Reader on Gender in Education. Jossey-Bass, San Francisco, CA, USA (2002), 301--313.",
      "doi": ""
    },
    {
      "text": "Crawford, C. The Art of Computer Game Design. Available Online: http://www.mindsim.com/MindSim/ Corporate/artCGD.pdf (1982). ",
      "doi": "10.5555/538111"
    },
    {
      "text": "Druin, A. Cooperative inquiry: Developing new technologies for children with children. In Proc. CHI 1999. ACM Press (1999), 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Farnham, S., Zaner, M., Cheng, L. Supporting Sociability in a Shared Browser. In Proceedings of Interact Conference, Tokyo, Japan (July 2001).",
      "doi": ""
    },
    {
      "text": "Flanagan, M. Next Level: Women's Digital Activism through Gaming. In A. Morrison, G. Liestøl & T. Rasmussen (eds.), Digital Media Revisited. MIT Press, Cambridge, MA, USA, (2003), 359--388. ",
      "doi": "10.5555/778062.778076"
    },
    {
      "text": "Fogg, B.J., & Tseng, H. The elements of computer credibility. In Proc CHI 1999, ACM Press (1999), 80--87.  ",
      "doi": "10.1145/302979.303001"
    },
    {
      "text": "Freeman-Benson, B., & Borning, A. YP and urban simulation: Applying an agile programming methodology in a politically tempestuous domain. In Proc. 2003 Agile Dev. Conf., Salt Lake City, Utah (June 2003), 2--11. ",
      "doi": "10.5555/942789.942829"
    },
    {
      "text": "Friedman, B. Value-sensitive design. In Interactions. 3:6 (1996), 17--23.  ",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Friedman, B., Howe, D.C., & Felten, E. Informed consent in the Mozilla browser: Implementing value-sensitive design. In Proc. of 35th Annual Hawaii Intl. Conf. on System Sciences (Jan 2002), 247. ",
      "doi": "10.5555/820746.821279"
    },
    {
      "text": "Friedman, B., & Kahn, P. Human values, ethics, and design. In The human-computer interaction handbook. Erlbaum, Mahwah, NJ, USA (2002), 1177--1201. ",
      "doi": "10.5555/772072.772147"
    },
    {
      "text": "Friedman, B., Kahn, P. & Borning, A. Value Sensitive Design: Theory and methods. Technical Report 02-12-01, Comp. Sci. & E., UW, Seattle, WA, USA (2002). Available Online: http://www.urbansim.org/papers",
      "doi": ""
    },
    {
      "text": "Friedman, B., Kahn, P. & Howe, D.C. Trust online. Commun. ACM, 43:12 (2000), 34--40.  ",
      "doi": "10.1145/355112.355120"
    },
    {
      "text": "Friedman, B., & Nissenbaum, H. Bias in computer systems. ACM Transactions on Information Systems (TOIS). 14:3 (1996), 330--347.  ",
      "doi": "10.1145/230538.230561"
    },
    {
      "text": "Glass, R. L. Facts and Fallacies of Software Engineering. Addison Wesley, Reading, MA, USA, (2000).",
      "doi": ""
    },
    {
      "text": "Greenbaum, J., & Kyng, M. Design at work: Cooperative design of computer systems. Erlbaum, Mahwah, NJ, USA (1991). ",
      "doi": "10.5555/574738"
    },
    {
      "text": "Grinter, R. & Palen, L. Instant messaging in teen life. In Proc. 2002 Computer Supported Cooperative Work (CSCW '02), New Orleans, LA (2002) 21--30.  ",
      "doi": "10.1145/587078.587082"
    },
    {
      "text": "Hughes, T. Human-built world: how to think about technology and culture. University of Chicago, Chicago, IL, USA (2004).",
      "doi": ""
    },
    {
      "text": "Inkpen, K., Booth, K.S., Klawe, M. & Upitis, R. Playing together beats playing apart, especially for girls. In Proc. of Computer Support for Collaborative Learning (CSCL '95), Bloomington, IN, USA (1995), 177--181.  ",
      "doi": "10.3115/222020.222164"
    },
    {
      "text": "Kafai, Y.B. Minds in Play: Computer Game Design as a Context for Children's Learning. Erlbaum Associates, Hillsdale, N.J., USA, (1995). ",
      "doi": "10.5555/527173"
    },
    {
      "text": "Kirkup, G. & Abbot, J. The Gender Gap. A Gender Analysis of the 1996 Computing Access Survey. PLUM Paper #80. (Programme on Learner Use of Media) The Open University: Milton Keynes, UK (1997).",
      "doi": ""
    },
    {
      "text": "Latour, B. Where Are the Missing Masses? The Sociology of a Few Mundane Artifacts. In W. Bijker and J. Law (eds.) Shaping Technology/ Building Society. MIT Press, Cambridge, MA, USA (1992) 225--258.",
      "doi": ""
    },
    {
      "text": "Laurel, B. The Utopian Entrepreneur. MIT Press, Cambridge, MA, USA (2001).",
      "doi": ""
    },
    {
      "text": "Mubireek, K.A. Gender-oriented vs. gender neutral computer games in education. Dissertation, Ohio State University, Educational Policy and Leadership (2003). ",
      "doi": "10.5555/1023471"
    },
    {
      "text": "Muller, M.J., & Kuhn, S. (eds.) Commun. ACM, Special issue on participatory design. 36:6 (June 1993).  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Mumford, L. Authoritarian and Democratic Technics. In E. Katz, A. Light, & W. Thompson (eds.) Controlling Technology: Contemporary Issues, 2nd ed., Prometheus Books, NY, USA (2003).",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Paper versus computer implementations as mockup scenarios for heuristic evaluation. In Proc. IFIP TC13 Third International Conf. on Human-Computer Interaction (1990), 315--320. ",
      "doi": "10.5555/647402.725312"
    },
    {
      "text": "Nissenbaum, H. Values in the design of computer systems. In Computers in Society (1998), 38--39.",
      "doi": ""
    },
    {
      "text": "Palen, L., & Grudin, J. Discretionary adoption of group support software: Lessons from calendar applications. In B. E. Munkvoldv(ed.) Implementing Collaboration Technologies in Industry. Springer Verlag, London,UK (2002). ",
      "doi": "10.5555/885846.885855"
    },
    {
      "text": "Papert, S. The Children's Machine: Rethinking School in the Age of the Computer. Basic Books, NY, USA (1993). ",
      "doi": "10.5555/139395"
    },
    {
      "text": "Resnick, M. Rethinking learning in the digital age. In The Global Information Technology Report 2001-02: Readiness for the Networked World (2002). Available Online: http://www.cid.harvard.edu/cr/pdf/gitrr2002 _ch03.pdf",
      "doi": ""
    },
    {
      "text": "Rettig, M. Prototyping for tiny fingers. In Commun. ACM (April 1994) 21--7.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Richardson, H. S. Practical Reasoning about Final Ends, Cambridge University Press, Cambridge, MA, USA (1994).",
      "doi": ""
    },
    {
      "text": "Salen, K. & Zimmerman, E. Rules of Play. MIT Press, Cambridge, MA, USA (2003).",
      "doi": ""
    },
    {
      "text": "Schön, D. The Reflective Practitioner. Basic Books, NY, USA (1983).",
      "doi": ""
    },
    {
      "text": "Shannon, V. The end user: Playing to a new audience. International Herald Tribune (11 JUNE 2004), http://www.iht.com/articles/524535.html",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Universal usability. In Commun. ACM, 43:5 (2000), 84--91.  ",
      "doi": "10.1145/332833.332843"
    },
    {
      "text": "Soloway, E., Guzdial, M., & Hay, K. Learner-centered design. In Interactions of the ACM. 1:2 (1996), 37--48.  ",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "Suchman, L. Do categories have politics? The language/action perspective reconsidered. In CSCW Journal, 2:3 (1994), 177--190.",
      "doi": ""
    },
    {
      "text": "Von Prummer, C. Women-friendly perspectives in distance education. In Open Learning, 9:1 (1994), 3--12.",
      "doi": ""
    },
    {
      "text": "Winner, L. Do Artifacts Have Politics? In The Whale and the Reactor: A Search for Limits in an Age of High Technology. University of Chicago Press, Chicago, IL, USA (1986), 19--39.",
      "doi": ""
    },
    {
      "text": "Zimmerman, E. Play as research: the iterative design process. In B. Laurel (ed.) Design Research. Cambridge: MIT Press (2003). Available Online: http://www.gmlb.com/articles/iterativedesign.html",
      "doi": ""
    }
  ]
}