{
  "doi": "10.1145/1054972.1055059",
  "title": "Waterbot: exploring feedback and persuasive techniques at the sink",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "631-639",
  "year": 2005,
  "badges": [],
  "abstract": "This paper presents an exploration of user interfaces, persuasive interfaces and feedback techniques in the domain of the sink. Waterbot is a system to inform and motivate behavior at the sink for the purpose of increasing safety and functionality and ultimately motivating behavior change. Waterbot can be adapted to many current sink scenarios and demonstrates the breadth of interaction possible at the point of use of water. It functions as a platform for experimenting with safety, hygiene and water conservation in a sink. This paper presents the feedback and persuasion techniques of augmented physical interfaces with value-added design, automation, just-in-time prompts, positive and negative reinforcement, social validation and adaptive interfaces. Four design iterations are presented to affect behavior at the increasing cognitive levels of safety, functionality and behavior change.",
  "tags": [
    "persuasive environments",
    "ubiquitous computing",
    "context-aware computing",
    "water conservation",
    "behavior change",
    "captology",
    "product design"
  ],
  "authors": [
    {
      "name": "Ernesto Arroyo",
      "institution": "MIT Media Laboratory, Cambridge, MA",
      "img": "/do/10.1145/contrib-81100017972/rel-imgonly/ernesto-gti-photo.jpg",
      "acmid": "81100017972",
      "orcid": "missing"
    },
    {
      "name": "Leonardo Bonanni",
      "institution": "MIT Media Laboratory, Cambridge, MA",
      "img": "/do/10.1145/contrib-81100186035/rel-imgonly/leoinindia100x100.jpg",
      "acmid": "81100186035",
      "orcid": "missing"
    },
    {
      "name": "Ted Selker",
      "institution": "MIT Media Laboratory, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100525482",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aitken, C.K., McMahon, T. A., Wearing, A. J. & Finlayson, B. L. Residential water use: Predicting and reducing consumption. Journal of Applied Social Psychology, 24 (2).1994, 136--158.",
      "doi": ""
    },
    {
      "text": "Aronson, E.O.L., M. The relative effectiveness of models and prompts on energy conservation: A field experiment in a shower room. Journal of Environmental Systems, 12 (3).1982, 219--224.",
      "doi": ""
    },
    {
      "text": "Beumer, R., Bloomfield, S., Exner, M., Fara, Gaetano., Scott, E. Guidelines for Prevention of Infection and Cross Infection in the Domestic Environment. Intramed Communications s.r.l., Milan, Italy, 1998.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. Influence: Science and Practice. Allyn & Bacon, Boston, 2001.",
      "doi": ""
    },
    {
      "text": "Cialdini, R. The science of persuasion Scientific American, 2001, 76--81.",
      "doi": ""
    },
    {
      "text": "Compliance Control, I. HyGenius. Access Date: January 10th, 2004. http://www.hygenius.com.",
      "doi": ""
    },
    {
      "text": "Costanzo, M., Archer, D., Aronson, E., & Pettigrew, T. Energy conservation behavior: The difficult path from information to action. American Psychologist (41).1986, 521--528.",
      "doi": ""
    },
    {
      "text": "DeOreo, W.B., P.W. Mayer, and P. Lander., Evaluating Conservation Retrofit Savings with Precise End Use Data. in 1996 AWWA Annual Conference, (Toronto, Ont, 1996).",
      "doi": ""
    },
    {
      "text": "Energy, U.S.D.o. Residential conservation service evaluation report. Office, U.S.G.P. ed. Hearings before the Committee on Energy and Natural Resources of the United States Senate, Ninety-Eighth Congress, World Resources Institute, Washington, D.C, 1984, Chapter 12.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J., Persuasive computers: perspectives and research directions. in CHI 98, (1998), 225--232.  ",
      "doi": "10.1145/274644.274677"
    },
    {
      "text": "Fogg, B.J. Persuasive Technology: Using Computers to Change What we Think and Do. Morgan Kaufmann, 2002. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Geller, E.S. Evaluating energy conservation programs: Is verbal report enough? Journal of Consumer Research (8).1981, 331--335.",
      "doi": ""
    },
    {
      "text": "Geller, E.S., Erickson, J. B., & Buttram, B. A Attempts to promote residential water conservation with educational, behavioral and engineering strategies. Population and Environment (6).1983, 96--112.",
      "doi": ""
    },
    {
      "text": "Grigorovici, D., Russill, C., Pearce, J., & Constantin, C. Persuasive Environments: Consequences of Virtual Environments on Effectiveness of Persuasive Messages. PRESENCE 2003, 6th Annual International Workshop on Presence.2003.",
      "doi": ""
    },
    {
      "text": "Hirst, E., Berry, L., & Soderstrom, J. Review of utility home energy audit programs. Energy (6).1981, 621--630.",
      "doi": ""
    },
    {
      "text": "Incorporated, M. PureTouch. Access Date: January 10th, www.moen.com.",
      "doi": ""
    },
    {
      "text": "Intille S.S. A new research challenge: persuasive technology to motivate healthy aging. Transactions on Information Technology in Biomedicine, 8 (3).2004.  ",
      "doi": "10.1109/TITB.2004.835531"
    },
    {
      "text": "Intille S.S., K.C., Farzanfar R., and Bakr W., Just-in-Time Technology to Encourage Incremental, Dietary Behavior Change. in AMIA 2003 Symposium, (2003).",
      "doi": ""
    },
    {
      "text": "King, P.a.J.T. The Landscape of Persuasive Technologies,. Communications of the ACM, 42 (5).1999, 31--38.  ",
      "doi": "10.1145/301353.301398"
    },
    {
      "text": "Mayer, P.W., W.B. DeOreo, E. Opitz, J. Kiefer, B. Dziegielewski, W. Davis, J.O. Nelson. Residential End Uses of Water, American Water Works Association Research Foundation, Denver, CO, 1999.",
      "doi": ""
    },
    {
      "text": "McKenzie-Mohr Doug, S.W. Fostering Sustainable Behavior: An Introduction to Community-Based Social Marketing. New Society Publishers, Gabriola Island, British Columbia, 1999.",
      "doi": ""
    },
    {
      "text": "Microchip. PIC16f876 microcontroller Data Sheet. Access Date: January, 30, 2004. http://www.microchip.com/1010/pline/picmicro/category/embctrl/14kbytes/devices/16f876/index.htm.",
      "doi": ""
    },
    {
      "text": "Midden, C.J., Meter, J. E., Weenig, M. H., & Zieverink, H. J. Using feedback, reinforcement and information to reduce energy consumption in households: A field-experiment. Journal of Economic Psychology, 3.1983, 65--86.",
      "doi": ""
    },
    {
      "text": "Office, C.o.A.W.C. Water Conservation Programs. Access Date: January 1, 2004. http://www.cabq.gov/waterconservation.",
      "doi": ""
    },
    {
      "text": "Pryor, K. Don't Shoot the Dog! : The New Art of Teaching and Training.--Revised Edition. Bantam Books, 1999.",
      "doi": ""
    },
    {
      "text": "Russell, W.D., Dzewaltowski, D.A., and Ryan G.J The effectiveness of a point-of-decision prompt in deterring sedentary behavior. American Journal of Health Promotion: AJHP.1999.",
      "doi": ""
    },
    {
      "text": "Selker, T. Attentive User Interfaces. in Berkshire Encyclopedia of Human-Computer Interaction, Berkshire Publishing Group, 2004, 51--54.",
      "doi": ""
    },
    {
      "text": "Selker T., W.B. Context-Aware Design and Interaction in Computer Systems. IBM Systems Journal, 39 (4).2000.  ",
      "doi": "10.1147/sj.393.0880"
    },
    {
      "text": "Semiconductor, D. MAX6957 Data Sheet. Access Date: January 30, 2004. http://www.maxim-ic.com/quick_view2.cfm/qv_pk/3365/ln/en.",
      "doi": ""
    },
    {
      "text": "Shojania KG, D.B., McDonald KM, et al, eds. Evidence Report/Technology Assessment No. 43, AHRQ Publication No. 01-E058. Making health care safer: a critical analysis of patient safety practices, Agency for Healthcare Research and Quality (AHRQ), Rockville, 2001.",
      "doi": ""
    },
    {
      "text": "Skinner, B.F. The Behavior of Organisms: An Experimental Analysis. B. F. Skinner Foundation, New York, 1991.",
      "doi": ""
    },
    {
      "text": "Southwell, B.S., Reva Turning minds on and faucets off: Water conservation education in Jordanian schools. Journal of Environmental Education, 32 (2).2001, 37--45.",
      "doi": ""
    },
    {
      "text": "Syme, G.J.N., Blair E.; Seligman, Clive The evaluation of information campaigns to promote voluntary household water conservation. Evaluation Review, 24 (6).2000, 539--578.",
      "doi": ""
    },
    {
      "text": "Velicer, W.F., Prochaska, J. O., Fava, J. L., Norman, G. J., & Redding, C. A. Smoking cessation and stress management: Applications of the Transtheoretical Model of behavior change. Homeostasis (38).1998, 216--233.",
      "doi": ""
    },
    {
      "text": "Winbond. ISD4003 Specification Data Sheet. Access Date: January 30. http://www.winbond-usa.com/products/isd_products/chipcorder/portfolio/index.shtml.",
      "doi": ""
    }
  ]
}