{
  "doi": "10.1145/1054972.1055084",
  "title": "MultiView: spatially faithful group video conferencing",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "799-808",
  "year": 2005,
  "badges": [],
  "abstract": "MultiView is a new video conferencing system that supports collaboration between remote groups of people. MultiView accomplishes this by being spatially faithful. As a result, MultiView preserves a myriad of nonverbal cues, includ-ing gaze and gesture, in a way that should improve com-munication. Previous systems fail to support many of these cues because a single camera perspective warps spatial char-acteristics in group-to-group meetings. In this paper, we present a formal definition of spatial faithfulness. We then apply a metaphor-based design methodology to help us spec-ify and evaluate MultiView's support of spatial faithfulness. We then present results from a low-level user study to mea-sure MultiView's effectiveness at conveying gaze and ges-ture perception. MultiView is the first practical solution to spatially faithful group-to-group conferencing, one of the most common applications of video conferencing.",
  "tags": [
    "deixis",
    "gaze",
    "video conferencing",
    "eye contact",
    "spatial faithfulness"
  ],
  "authors": [
    {
      "name": "David Nguyen",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81410594440",
      "orcid": "missing"
    },
    {
      "name": "John Canny",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415489",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M., Lalljee, M., and Cook, M. The effects of visibility on interaction in a dyad. Human Relations, 21, (1968), 3--17.",
      "doi": ""
    },
    {
      "text": "Bos, N., Olson, J., Gergle, D., Olson, G., and Wright, Z. Effects of four computer-mediated communications channels on trust development. Proc. CHI 2002, ACM Press (2002), 135--140.  ",
      "doi": "10.1145/503376.503401"
    },
    {
      "text": "Chen, M. Leveraging the asymmetric sensitivity of eye contact for videoconference. Proc. CHI 2002, ACM Press (2002), 49--56.  ",
      "doi": "10.1145/503376.503386"
    },
    {
      "text": "Connell, J. and Mendelsohn, J. and Robins, R. and Canny, J. Dont hang up on the phone, yet! ACM GROUP (Conf. on Group support), Sept 2001, 117--124.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Adler, A., Bellotti, V., and Henderson, A. Your place or mine? learning from long-term use of audio-video communication. Computer-Supported Cooperative Work 5, 1 (1996), 33--62. ",
      "doi": "10.1007/BF00141935"
    },
    {
      "text": "Ekman, P. Telling Lies: Clues to Deceit in the Marketplace, Marriage, and Politics, Third edition, W.W. Norton, 2002.",
      "doi": ""
    },
    {
      "text": "Ishii, H., and Kobayashi, M. Clearboard: a seamless medium for shared drawing and conversation with eye contact. Proc. CHI 1992, ACM Press (1992), 525--532.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Kendon, A. Some functions of gaze-direction in social interaction. Acta Psychologica 26 (1967), 22--63.",
      "doi": ""
    },
    {
      "text": "Lipton, L., and Feldman, M. A new autostereoscopic display techology: The synthagram. http://www.stereographics.com/.",
      "doi": ""
    },
    {
      "text": "Monk, A., and Gale, C. A look is worth a thousand words: Full gaze awareness in video-mediated conversation. Discourse Processes 33, 3 (2002), 257--278.",
      "doi": ""
    },
    {
      "text": "Okada, K., Maeda, F., Ichikawaa, Y., and Matsushita, Y. Multiparty videoconferencing at virtual social distance: MAJIC design. Proc. CSCW 1994, ACM Press (1994), 385--393.  ",
      "doi": "10.1145/192844.193054"
    },
    {
      "text": "Paulos, E. and Canny, J. Prop: Personal roving presence. ACM SIGCHI, 1998. Los Angeles, pp 296--303.  ",
      "doi": "10.1145/274644.274686"
    },
    {
      "text": "Perrett, D. I. Organization and Functions of Cells Responsive to Faces in the Temporal Cortex. Phil. Trans.: Biological Sciences 335, 1274 (1992), 23--30.",
      "doi": ""
    },
    {
      "text": "Reeves, B., and Nass, C. The media equation: how people treat computers, television, and new media like real people and places. Cambridge University Press, 1998. ",
      "doi": "10.5555/286930"
    },
    {
      "text": "Schmidt, A., and Grasnick, A. MultiViewpoint autostereoscopic dispays from 4d-vision gmbh. Stereoscopic Displays and Virtual Reality Systems IX 4660, 1 (2002), 212--221.",
      "doi": ""
    },
    {
      "text": "Sellen, A., Buxton, B., and Arnott, J. Using spatial cues to improve videoconferencing. Proc. CHI 1992, ACM Press (1992), 651--652.  ",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. The social psychology of telecommunications. Wiley & Sons, London, 1967.",
      "doi": ""
    },
    {
      "text": "Slabaugh, G. G., Culbertson, W. B., Malzbender, T., Stevens, M. R., and Schafer, R. W. Methods for volumetric reconstruction of visual scenes. Int. J. Comput. Vision 57, 3 (2004), 179--199.  ",
      "doi": "10.1023/B%3AVISI.0000013093.45070.3b"
    },
    {
      "text": "Upstream Engineering, Inc. http://www.upstream.fi/.",
      "doi": ""
    },
    {
      "text": "Vertegaal, R., Van der Veer, G. and Vons, H. Effects of Gaze on Multiparty Mediated Communication. Proc. Graphics Interface 2000, (2000), 95--102.",
      "doi": ""
    },
    {
      "text": "Vertegaal, R., Weevers, I., Sohn, C., and Cheung, C. Gaze-2: conveying eye contact in group video conferencing using eye-controlled camera direction. Proc. CHI 2003, ACM Press (2003), 521--528.  ",
      "doi": "10.1145/642611.642702"
    }
  ]
}