{
  "doi": "10.1145/1054972.1055036",
  "title": "Experimental analysis of mode switching techniques in pen-based user interfaces",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "461-470",
  "year": 2005,
  "badges": [],
  "abstract": "Inking and gesturing are two central tasks in pen-based user interfaces. Switching between modes for entry of uninterpreted ink and entry of gestures is required by many pen-based user interfaces. Without an appropriate mode switching technique, pen-based interactions in such situations may be inefficient and cumbersome. In this paper, we investigate five techniques for switching between ink and gesture modes in pen interfaces, including a pen-pressure based mode switching technique that allows implicit mode transition. A quantitative experimental study was conducted to evaluate the performance of these techniques. The results suggest that pressing a button with the non-preferred hand offers the fastest performance, while the technique of holding the pen still is significantly slower and more prone to error than the other techniques. Pressure, while promising, did not perform as well as the non-preferred hand button with our current implementation.",
  "tags": [
    "mode switching",
    "gestures",
    "mode errors",
    "pen interfaces",
    "ink"
  ],
  "authors": [
    {
      "name": "Yang Li",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580013",
      "orcid": "0000-0001-7808-5524"
    },
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Zhiwei Guan",
      "institution": "University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659506259",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of Washington, Seattle, WA and Intel Research Seattle, Seattle, WA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Apitz, G. and Guimbretiere, F., CrossY: A Crossing-Based Drawing Application. In UIST'04, CHI Letters, 2004. 6(2): pp. 3--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Compaq. Virtual Book: Lectrice Tablet. http://research.compaq.com/SRC/virtualbook/",
      "doi": ""
    },
    {
      "text": "Davis, R. Sketch Understanding in Design: Overview of Work at the MIT AI Lab. In AAAI Spring Symposium - Sketch Understanding. 2002: AAAI. pp. 24--31.",
      "doi": ""
    },
    {
      "text": "Dillon, R.F., Eday, J.D., and Tombaugh, J.W. Measuring the true cost of command selection: techniques and results. In CHI'90. New York, NY. pp. 19--26.  ",
      "doi": "10.1145/97243.97247"
    },
    {
      "text": "Forsberg, A., Dieterich, M., and Zeleznik, R. The Music Notepad. In UIST'98. San Francisco, CA. pp. 203--210.  ",
      "doi": "10.1145/288392.288608"
    },
    {
      "text": "Guiard, Y. and Ferrand, T., Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model. Journal of Motor Behavior, 1987. 19(4): pp. 486--517.",
      "doi": ""
    },
    {
      "text": "Kabbash, P., Buxton, W., and Sellen, A.G. Two-Handed Input in a Compound Task. In CHI'94. Boston, Massachusetts. pp. 417--423.  ",
      "doi": "10.1145/191666.191808"
    },
    {
      "text": "Kurtenbach, G. and Buxton, W. User learning and performance with marking menus. In CHI'94. pp. 258--264.  ",
      "doi": "10.1145/191666.191759"
    },
    {
      "text": "Lin, J., et al., DENIM: finding a tighter fit between tools and practice for Web site design. In CHI'00, CHI Letters, 2000. 2(1): pp. 510--517.  ",
      "doi": "10.1145/332040.332486"
    },
    {
      "text": "Microsoft. Windows CE. www.microsoft.com/windowsce/",
      "doi": ""
    },
    {
      "text": "Microsoft. Windows XP Tablet PC Edition. http://www.microsoft.com/windowsxp/tabletpc/",
      "doi": ""
    },
    {
      "text": "Moran, T.P., Chiu, P., and Melle, W.v. Pen-based interaction techniques for organizing material on an electronic whiteboard. UIST'97. Banff, Alberta. pp. 45--54.  ",
      "doi": "10.1145/263407.263508"
    },
    {
      "text": "Ramos, G. and Balakrishnan, R., Fluid Interaction Techniques for the Control and Annontation of Digital Video. In UIST'03, CHI Letters, 2003. 5(2): pp. 105--114.  ",
      "doi": "10.1145/964696.964708"
    },
    {
      "text": "Ramos, G., Boulos, M., and Balakrishnan, R., Pressure Widgets. In CHI'04, CHI Letters, 2004. 6(1): pp. 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Raskin, J., Meanings, Modes, Monotony, and Myths, In The Humane Interface, Addison Wesley.",
      "doi": ""
    },
    {
      "text": "Saund, E. and Lank, E., Stylus Input and Editing Without Prior Selection of Mode. In UIST'03, CHI Letters, 2003. 5(2): pp. 213--216.  ",
      "doi": "10.1145/964696.964720"
    },
    {
      "text": "Sellen, A.G., Kurtenbach, G.P., and Buxton, W., The Prevention of Mode Errors through Sensory Feedback. Human-Computer Interaction, 1992. 7(2): pp. 141--164.",
      "doi": ""
    },
    {
      "text": "Stifelman, L., Arons, B., and Schmandt, C., The audio notebook: paper and pen interaction with structured speech. In CHI'01, CHI Letters, 2001. 3(1): pp. 182--189.  ",
      "doi": "10.1145/365024.365096"
    }
  ]
}