{
  "doi": "10.1145/1054972.1055047",
  "title": "Stencils-based tutorials: design and evaluation",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "541-550",
  "year": 2005,
  "badges": [],
  "abstract": "Users of traditional tutorials and help systems often have difficulty finding the components described or pictured in the procedural instructions. Users also unintentionally miss steps, and perform actions that the documentation's authors did not intend, moving the application into an unknown state. We introduce Stencils, an interaction technique for presenting tutorials that uses translucent colored stencils containing holes that direct the user's attention to the correct interface component and prevent the user from interacting with other components. Sticky notes on the stencil's surface provide necessary tutorial material in the context of the application. In a user study comparing a Stencils-based and paper-based version of the same tutorial in Alice, a complex software application designed to teach introductory computer programming, we found that users of a Stencils-based tutorial were able complete the tutorial 26% faster, with fewer errors, and less reliance on human assistance. Users of the Stencils-based and paper-based tutorials attained statistically similar levels of learning.",
  "authors": [
    {
      "name": "Caitlin Kelleher",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100607695/rel-imgonly/ckelleher.jpg",
      "acmid": "81100607695",
      "orcid": "missing"
    },
    {
      "name": "Randy Pausch",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alice. http://www.alice.org",
      "doi": ""
    },
    {
      "text": "Baecker, R., Showing Instead of Telling. In Proc. Of SIGDOC 2002, ACM Press (2002), 10--16.  ",
      "doi": "10.1145/584955.584957"
    },
    {
      "text": "Bartlett, J. Transparent Controls for Interactive Graphics. WRL Technical Note TN-30, Digital Equipment Corporation, Palo Alto, CA, July 1992.",
      "doi": ""
    },
    {
      "text": "Bier, E., Stone, M., Pier, K. et al. Toolglass and Magic Lenses: The See-Through Interface. In Proc Computer Graphics and Interactive Techniques 1993. ACM Press (1993), 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bier, E. Stone, M. Fishkin, K. et al. A Taxonomy of See-Through Tools. In Proc CHI 1994. ACM Press (1994), 358--364.  ",
      "doi": "10.1145/191666.191786"
    },
    {
      "text": "Booher, H.R., Relative comprehensibility of pictorial information and printed words in proceduralized instructions. Human Factors 17, 3 (1975), 266--277.",
      "doi": ""
    },
    {
      "text": "Carroll, J. and Carrithers, C. Training Wheels in a User Interface. Communications of the ACM 27, 8 (1984), 800--806.  ",
      "doi": "10.1145/358198.358218"
    },
    {
      "text": "Carroll, J. and Rosson, M. The Paradox of the Active User. In J.M. Carroll (Ed.), Interfacing Thought: Cognitive Aspects of Human-Computer Interaction. MIT Press, Cambridge, 1987. ",
      "doi": "10.5555/28446.28451"
    },
    {
      "text": "Carroll, J., Smith-Kerker, P., Ford, J., and Mazur, S. The Minimal Manual. IBM RC 11637, 1986.",
      "doi": ""
    },
    {
      "text": "Catrambone, R. and Carroll, J. Learning a Word Processing System with Training Wheels and Guided Exploration. In Proc CHI/GI 1987, ACM Press (1987), 169--174.  ",
      "doi": "10.1145/29933.275625"
    },
    {
      "text": "Conway, M., Audia, S., Burnette, T., et al. Alice: lessons learned from building a system for novices. In Proc CHI 2000, ACM Press (2000), 486--493.  ",
      "doi": "10.1145/332040.332481"
    },
    {
      "text": "Dann, W., Cooper, S. and Pausch, R. Learning to Program with Alice: Beta Version. Pearson Prentice Hall, Upper Saddle River, NJ, USA, 2005.",
      "doi": ""
    },
    {
      "text": "Designing Coachmarks. http://www.developer.apple.com/techpubs/mac/AppleGuide/AppleGuide-24.html",
      "doi": ""
    },
    {
      "text": "Fishkin, K. and Stone, M. Enhanced Dynamic Queries via Movable Filters. In Proc CHI 1995. ACM Press (1995), 415--420.  ",
      "doi": "10.1145/223904.223960"
    },
    {
      "text": "Goodall, S. Online Help: A Part of Documentation. In Proc SIGDOC 1992, ACM Press (1992), 169--174.  ",
      "doi": "10.1145/147001.147024"
    },
    {
      "text": "Goodall, S. Online Help in the Real World. In Proc. SIGDOC 1991, ACM Press (1991), 21--29.  ",
      "doi": "10.1145/122778.122783"
    },
    {
      "text": "Guzdial, M. Software-Realized Scaffolding to Facilitate Programming for Science Learning. Interactive Learning Environments 4, 1 (1995), 1--44.",
      "doi": ""
    },
    {
      "text": "Harrison, S. A Comparison of Still, Animated, or Nonillustrated On-Line Help with Written of Spoken Instructions in a Graphical User Interface. In Proc CHI 1995, ACM Press (1995), 82--89.  ",
      "doi": "10.1145/223904.223915"
    },
    {
      "text": "Hudson, S., Rodenstein, R., and Smith, I. Debugging Lenses: A New Class of Transparent Tools for User Interface Debugging. In Proc UIST 1997, ACM Press (1997), 179--187.  ",
      "doi": "10.1145/263407.263542"
    },
    {
      "text": "Jackson, J., Krajcik, J. and Soloway, E. The Design of Guided Learner-Adaptable Scaffolding in Interactive Learning Environments. In Proc CHI 1998, ACM Press (1998), 187--194.  ",
      "doi": "10.1145/274644.274672"
    },
    {
      "text": "Knabe, K. Apple Guide: A Case Study in User-Aided Design of Online Help. In Proc CHI 1995, ACM Press (1995), 286--287.  ",
      "doi": "10.1145/223355.223677"
    },
    {
      "text": "Kramer, A. Translucent Patches. In Proc UIST 1994, ACM Press (1994), 121--130.  ",
      "doi": "10.1145/192426.192474"
    },
    {
      "text": "Looser, J., Billinghurst, M., and Cockburn, A. Through the Looking Glass: The User of Lenses as an Interface Tool for Augmented Reality Interfaces. In Proc Computer Graphics and Interactive Techniques. ACM Press (2004), 204--211.  ",
      "doi": "10.1145/988834.988870"
    },
    {
      "text": "Palmiter, S. and Elkerton, J. An Evaluation of Animated Demonstrations for Learning Computer-based Tasks. In Proc. CHI 1991, ACM Press (1991), 257--263.  ",
      "doi": "10.1145/108844.108906"
    },
    {
      "text": "Palmiter, S., Elkerton, J., and Baggett, P. Animated demonstrations vs. written instructions for learning procedural tasks: A preliminary investigation. International Journal of Man-Machine Studies, 34 (1991), 687--701.  ",
      "doi": "10.1016/0020-7373%2891%2990019-4"
    },
    {
      "text": "Quintana, C., Eng, J., Carra, A. et al. Symphony: A Case Study in Extending Learner-Centered Design through Process Space Analysis. In Proc of CHI 1999, ACM Press (1999), 473--480.  ",
      "doi": "10.1145/302979.303136"
    },
    {
      "text": "Rieman, J. A Field Study of Exploratory Learning Strategies. Transactions on Computer-Human Interaction 3, 3 (1996). 189--218.  ",
      "doi": "10.1145/234526.234527"
    },
    {
      "text": "Schneiderman, B. Direct manipulation: A step beyond programming languages. IEEE Computer 16, 8 (1983), 57--69.",
      "doi": ""
    },
    {
      "text": "Selker, T., Barber, R., and Kelley, R. Effective, Selective Presentation of Help Material in a Graphical Environment: Experience with COACH/2, a graphical adaptive help system. IBM Tech Report, 1996.",
      "doi": ""
    },
    {
      "text": "Shashaani, L. Gender-Differences in Computer Experience and its Influence on Computer Attitudes. Journal of Educational Computing Research 11, 4 (1994), 347--367.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Guzdial, M., and Hay, K. Learner-Centered Design: The Challenge for HCI in the 21st Century. Interactions 1, 2 (1994), 36--48.  ",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "Sukaviriya, P., Isaacs, E., and Bharat, K. Multimedia Help: A Prototype and an Experiment. Ext. Abstracts CHI 1992, ACM Press (1992), 433--434.  ",
      "doi": "10.1145/142750.142889"
    },
    {
      "text": "Wallace, R. Soloway, E., Krajcik, J. et al. ARTEMIS: Learner-Centered Design of an Information Seeking Environment for K-12 Education. In Proc CHI 1998, ACM Press (1998), 195--202.  ",
      "doi": "10.1145/274644.274673"
    },
    {
      "text": "Windows Family. http://www.windows.com.",
      "doi": ""
    }
  ]
}