{
  "doi": "10.1145/1054972.1055001",
  "title": "AppLens and launchTile: two designs for one-handed thumb use on small devices",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "201-210",
  "year": 2005,
  "badges": [],
  "abstract": "We present two interfaces to support one-handed thumb use for PDAs and cell phones. Both use Scalable User Interface (ScUI) techniques to support multiple devices with different resolutions and aspect ratios. The designs use variations of zooming interface techniques to provide multiple views of application data: AppLens uses tabular fisheye to access nine applications, while LaunchTile uses pure zoom to access thirty-six applications. We introduce two sets of thumb gestures, each representing different philosophies for one-handed interaction. We conducted two studies to evaluate our designs. In the first study, we explored whether users could learn and execute the AppLens gesture set with minimal training. Participants performed more accurately and efficiently using gestures for directional navigation than using gestures for object interaction. In the second study, we gathered user reactions to each interface, as well as comparative preferences. With minimal exposure to each design, most users favored AppLens's tabular fisheye interface.",
  "tags": [
    "piccolo",
    "notification",
    "thumb navigation",
    "one-handed",
    "mobile devices",
    "zoomable user interfaces (ZUIs)",
    "gestures"
  ],
  "authors": [
    {
      "name": "Amy K. Karlson",
      "institution": "University of Maryland, College Park, MD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100168208",
      "orcid": "0000-0001-8934-7761"
    },
    {
      "name": "Benjamin B. Bederson",
      "institution": "University of Maryland, College Park, MD",
      "img": "/do/10.1145/contrib-81100083927/rel-imgonly/bederson.jpg",
      "acmid": "81100083927",
      "orcid": "missing"
    },
    {
      "name": "John SanGiovanni",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100631185",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bederson, B. B., Meyer, J. and Good, L. Jazz: An Extensible Zoomable User Interface Graphics Toolkit in Java. Proc. UIST (2000), 171--180.  ",
      "doi": "10.1145/354401.354754"
    },
    {
      "text": "Bederson, B. B. PhotoMesa: A Zoomable Image Browser using Quatnum Treemaps and Bubblemaps. Proc. UIST, ACM Press (2001), 71--80.  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Bederson, B. B., Clamage, A., Czerwinski, M. and Robertson, G. DateLens: A Fisheye Calendar Interface for PDAs. ACM Trans. Comput.-Hum. Interact. 10, 4 (2003).  ",
      "doi": "10.1145/972648.972652"
    },
    {
      "text": "Bederson, B. B. Interfaces for staying in the flow. Ubiquity 5, 7 (2004).  ",
      "doi": "10.1145/1029383.1074069"
    },
    {
      "text": "Bederson, B. B., Grosjean, J. and Meyer, J. Toolkit Design for Interactive Structured Graphics. IEEE Trans. Soft-Eng. 30, 8 (2004), 535--546.  ",
      "doi": "10.1109/TSE.2004.44"
    },
    {
      "text": "Blickenstorfer, C. H. Graffiti: Wow! Pen Computing Magazine (1995), 30--31.",
      "doi": ""
    },
    {
      "text": "Buyukkokten, O., Garcia-Molina, H., Paepcke, A. and Winograd, T. Power browser: efficient Web browsing for PDAs. Proc. CHI, ACM Press (2000), 430--437.  ",
      "doi": "10.1145/332040.332470"
    },
    {
      "text": "Furnas, G. W. Generalized fisheye views. Proc. CHI, ACM Press (1986), 16--23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Guimbretiere, F., Stone, M. and Winograd, T. Fluid interaction with high-resolution wall-size displays. Proc. UIST, ACM Press (2001), 21--30.  ",
      "doi": "10.1145/502348.502353"
    },
    {
      "text": "Hinckley, K., Pierce, J., Sinclair, M. and Horvitz, E. Sensing techniques for mobile interaction. Proc. UIST, ACM Press (2000), 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Hirotaka, N. Reassessing current cell phone designs: using thumb input effectively. Extended Abstracts CHI, ACM Press (2003), 938--939.  ",
      "doi": "10.1145/765891.766081"
    },
    {
      "text": "Hornbæk, K. and Frøkjær, E. Reading of electronic documents: the usability of linear, fisheye, and overview+detail interfaces. Proc. CHI, ACM Press (2001), 293--300.  ",
      "doi": "10.1145/365024.365118"
    },
    {
      "text": "iPod. www.apple.com/ipod/, Apple Computer.",
      "doi": ""
    },
    {
      "text": "Jackito PDA. http://www.jackito-pda.com/.",
      "doi": ""
    },
    {
      "text": "Long, A. C., Landay, J. A., Lawrence, R. A. and Michiels, J. Visual similarity of pen gestures. Proc. CHI, ACM Press (2000), 360--367.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Lyons, K., Starner, T., Plaisted, D., Fusia, J., Lyons, A., Drew, A. and Looney, E. W. Twiddler typing: one-handed chording text entry for mobile phones. Proc. CHI, ACM Press (2004), 671--678.  ",
      "doi": "10.1145/985692.985777"
    },
    {
      "text": "Perlin, K. Quikwriting: continuous stylus-based text entry. Proc. UIST, ACM Press (1998), 215--216.  ",
      "doi": "10.1145/288392.288613"
    },
    {
      "text": "Piccolo.Net. http://www.cs.umd.edu/hcil/piccolo/, Univ. of Maryland Human-Computer Interaction Lab.",
      "doi": ""
    },
    {
      "text": "Potter, R. L., Weldon, L. J. and Shneiderman, B. Improving the accuracy of touch screens: an experimental evaluation of three strategies. Proc. CHI (1988), 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Rao, R. and Card, S. K. The table lens: merging graphical and symbolic representations in an interactive focus + context visualization for tabular information. Proc. CHI, ACM Press (1994), 318--322.  ",
      "doi": "10.1145/191666.191776"
    },
    {
      "text": "Rekimoto, J. Tilting operations for small screen interfaces. Proc. UIST, ACM Press (1996), 167--168.  ",
      "doi": "10.1145/237091.237115"
    },
    {
      "text": "Robbins, D. C., Cutrell, E., Sarin, R. and Horvitz, E. Zone Zoom: Map Navigation for Smartphones with Recursive View Segmentation. Proc. AVI, ACM Press (2004), 231--234.  ",
      "doi": "10.1145/989863.989901"
    },
    {
      "text": "Robertson, G. G. and Mackinlay, J. D. The Document Lens. Proc. UIST, ACM Press (1993), 101--108.  ",
      "doi": "10.1145/168642.168652"
    },
    {
      "text": "Sarkar, M. and Brown, M. H. Graphical Fisheye Views of Graphs. Proc. CHI, ACM Press (1992), 83--91.  ",
      "doi": "10.1145/142750.142763"
    },
    {
      "text": "Sazawal, V., Want, R. and Borriello, G. The unigesture approach. Proceedings of the 4th International Symposium on Mobile Human-Computer Interaction, Springer-Verlag (2002), 256--270. ",
      "doi": "10.5555/645739.666599"
    },
    {
      "text": "Schaffer, D., Zuo, Z., Greenberg, S., Bartram, L., Dill, J., Dubs, S. and Roseman, M. Navigating hierarchically clustered networks through fisheye and full-zoom methods. ACM Trans. Comput.-Hum. Interact. 3, 2 (1996), 162--188.  ",
      "doi": "10.1145/230562.230577"
    },
    {
      "text": "Spence, R. and Apperley, M. D. An Office Environment for the Professional. Behaviour & Information Technology 1, 1 (1982), 43--54.",
      "doi": ""
    },
    {
      "text": "Strachan, S., Murray-Smith, R., Oakley, I. and Angesleva, J. Dynamic Primitives for Gestural Interaction. Proc. Mobile HCI, Springer Verlag (2004).",
      "doi": ""
    },
    {
      "text": "Weberg, L., Torbjorn, B. and Hansson, A. W. A piece of butter on the PDA display. Extended Abstracts CHI (2001), 435--436.  ",
      "doi": "10.1145/634067.634320"
    },
    {
      "text": "Wigdor, D. and Balakrishnan, R. TiltText: using tilt for text input to mobile phones. Proc. UIST, ACM Press (2003), 81--90.  ",
      "doi": "10.1145/964696.964705"
    },
    {
      "text": "Wobbrock, J. O., Forlizzi, J., Hudson, S. E. and Myers, B. A. WebThumb: interaction techniques for small-screen browsers. Proc. UIST, ACM Press (2002).  ",
      "doi": "10.1145/571985.572014"
    },
    {
      "text": "Wobbrock, J. O., Myers, B. A. and Kembell, J. A. EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. Proc. UIST, ACM Press (2003), 61--70.  ",
      "doi": "10.1145/964696.964703"
    }
  ]
}