{
  "doi": "10.1145/1054972.1055035",
  "title": "Design and analysis of delimiters for selection-action pen gesture phrases in scriboli",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "451-460",
  "year": 2005,
  "badges": [],
  "abstract": "We present a quantitative analysis of delimiters for pen gestures. A delimiter is \"something different\" in the input stream that a computer can use to determine the structure of input phrases. We study four techniques for delimiting a selection-action gesture phrase consisting of lasso selection plus marking-menu-based command activation. Pigtail is a new technique that uses a small loop to delimit lasso selection from marking (Fig. 1). Handle adds a box to the end of the lasso, from which the user makes a second stroke for marking. Timeout uses dwelling with the pen to delimit the lasso from the mark. Button uses a button press to signal when to delimit the gesture. We describe the role of delimiters in our Scriboli pen interaction testbed, and show how Pigtail supports scope selection, command activation, and direct manipulation all in a single fluid pen gesture.",
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    },
    {
      "name": "Gonzalo Ramos",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100092787/rel-imgonly/badge-square.jpg",
      "acmid": "81100092787",
      "orcid": "missing"
    },
    {
      "name": "Francois Guimbretiere",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100301845/rel-imgonly/81100301845.jpg",
      "acmid": "81100301845",
      "orcid": "0000-0002-5510-6799"
    }
  ],
  "references": [
    {
      "text": "Accot, J., Zhai, S. More than dotting the i's-- Foundations for crossing-based interfaces. CHI 2002, 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Apitz, G., Guimbretiere, F. CrossY: A crossing based drawing application. UIST 2004, 3--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Buxton, W., Lexical and Pragmatic Considerations of Input Structure. Computer Graphics, 1983. 17(1): p. 31--37.  ",
      "doi": "10.1145/988584.988586"
    },
    {
      "text": "Buxton, W. Chunking and Phrasing and the Design of Human-Computer Dialogues. IFIP Information Processing`86, Amsterdam: North Holland, 475--480.",
      "doi": ""
    },
    {
      "text": "Buxton, W. A three-state model of graphical input. Proc. INTERACT'90, Amsterdam: Elsevier Science, 449--456. ",
      "doi": "10.5555/647402.725582"
    },
    {
      "text": "Buxton, W., Fiume, E., Hill, R., Lee, A., Woo, C. Continuous hand-gesture driven input. Graphics Interface '83, 191--195.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G., Khan, A., Pieke, R., Buxton, B., Kurtenbach, G. Tracking Menus. UIST 2003, 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "Guimbretiere, F., Fluid Interaction for High Resolution Wall-size Displays. 2002, Ph.D. Thesis, Stanford University. ",
      "doi": "10.5555/935625"
    },
    {
      "text": "Guimbretiere, F., Stone, M. C., Winograd, T. Fluid Interaction with High-resolution Wall-size Displays. Proc. UIST 2001, 21--30.  ",
      "doi": "10.1145/502348.502353"
    },
    {
      "text": "Guimbretiere, F., Winograd, T. FlowMenu: Combining Command, Text, and Data Entry. UIST 2000, 213--216.  ",
      "doi": "10.1145/354401.354778"
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P., Smith, M. Stitching: Pen Gestures that Span Multiple Displays. Advanced Visual Interfaces (AVI 2004), 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Kurtenbach, G., Buxton, W. Issues in Combining Marking and Direct Manipulation Techniques. UIST'91, 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Kurtenbach, G., Buxton, W. The Limits of Expert Performance Using Hierarchic Marking Menus. INTERCHI'93, 482--487. ",
      "doi": "10.5555/164632.164977"
    },
    {
      "text": "Kurtenbach, G., Moran, T., Buxton, W. Contextual Animation of Gestural Commands. Proc. Graphics Interface'94, 83--90.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G., Sellen, A., Buxton, W., An emprical evaluation of some articulatory and cognitive aspects of 'marking menus'. J. Human Computer Interaction, 1993. 8(1).",
      "doi": ""
    },
    {
      "text": "Li, Y., Hinckley, K., Guan, Z., Landay, J. A. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. CHI 2005.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Mizobuchi, S., Yasumura, M. Tapping vs. Circling Selections on Pen-based Devices: Evidence for Different Performance-Shaping Factors. CHI 2004, 607--614.  ",
      "doi": "10.1145/985692.985769"
    },
    {
      "text": "Moran, T., Chiu, P., van Melle, W. Pen-Based Interaction Techniques for Organizing Material on an Electronic Whiteboard. UIST'97, 45--54.  ",
      "doi": "10.1145/263407.263508"
    },
    {
      "text": "Mynatt, E. D., Igarashi, T., Edwards, W. K., LaMarca, A. Flatland: New Dimensions in Office Whiteboards. CHI'99, 346--353.  ",
      "doi": "10.1145/302979.303108"
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G., Barillot, E. Control Menus: Execution and Control in a Single Interactor. CHI 2000 Extended Abstracts, 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Saund, E., Lank, E. Stylus Input and Editing Without Prior Selection of Mode. UIST'03, 213--216.  ",
      "doi": "10.1145/964696.964720"
    },
    {
      "text": "Wilson, F. R., The Hand: How its use shapes the brain, language, and human culture. 1998, New York: Pantheon.",
      "doi": ""
    },
    {
      "text": "Zeleznik, R., Miller, T., Holden, L., LaViola, J., Fluid Inking: Using Punctuation to Allow Modeless Combination of Marking and Gesturing. 2004, Brown University, TR CS-04-11, ftp.cs.brown.edu/pub/techreports/04/cs04-11.ps.Z.",
      "doi": ""
    },
    {
      "text": "Zhao, S., Balakrishnan, R. Simple vs. Compound Mark Hierarchical Marking Menus. UIST 2004, 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}