{
  "doi": "10.1145/1054972.1055040",
  "title": "Emotions and heart rate while sitting on a chair",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "491-499",
  "year": 2005,
  "badges": [],
  "abstract": "New methods for unobtrusive monitoring of computer users' emotion psychophysiology are very much needed in human-computer interaction research. The present aim was to study heart rate changes during emotionally provocative stimulation. Six-second long auditory, visual, and audiovisual emotionally negative, neutral, and positive stimuli were presented to 24 participants. Heart rate responses were measured with a regular office chair embedded with electromechanical film (the EMFi chair) and with traditional earlobe photoplethysmography (PPG). Ratings of the stimuli were also collected. The results showed that the two heart rate measurements were significantly correlated, r = 0.99. In line with other studies the results showed that, in general, heart rate decelerated in response to emotional stimulation and it decelerated the most in response to negative stimuli as compared with responses to positive and neutral stimuli. Especially, emotional stimulation caused significant changes in heart rate at the 6th second from the stimulus onset. We suggest that the EMFi chair could be used in human-computer interaction for unobtrusive measurement of the user's emotional reactions.",
  "tags": [
    "wireless monitoring",
    "human-computer interaction",
    "affective computing",
    "physiological user interfaces",
    "psychophysiology",
    "emotion"
  ],
  "authors": [
    {
      "name": "Jenni Anttonen",
      "institution": "University of Tampere, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384603768",
      "orcid": "missing"
    },
    {
      "name": "Veikko Surakka",
      "institution": "University of Tampere, Tampere, Finland and Tampere University Hospital, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339531194",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allanson, J. (2002). Electrophysiologically interactive computer systems. IEEE Computers, 35, 3, 60--65.  ",
      "doi": "10.1109/2.989931"
    },
    {
      "text": "Aula, A. and Surakka, V. (2002). Auditory Emotional Feedback Facilitates Human-Computer Interaction. Proc. HCI 2002, Springer-Verlag, 337--349.",
      "doi": ""
    },
    {
      "text": "Bradley, M. M., Cuthbert, B. N., and Lang, P. J. (1996). Picture media and emotion: effects of a sustained affective context. Psychophysiology, 33, 662--670.",
      "doi": ""
    },
    {
      "text": "Bradley, M. M. and Lang, P. J. (1994). Measuring emotion: the self-assessment manikin and the semantic differential. Journal of Behaviol Therapy and Experimental Psychiatry, 25, 1, 49--59.",
      "doi": ""
    },
    {
      "text": "Bradley, M. M. and Lang, P. J. (1999). The international affective digitized sounds (IADS): stimuli, instruction manual and affective ratings. Technical Report B-2, The Center for Research in Psychophysiology, University of Florida.",
      "doi": ""
    },
    {
      "text": "Bradley, M. M. and Lang, P. J. (2000). Affective reactions to acoustic stimuli. Psychophysiology, 37, 204--215.",
      "doi": ""
    },
    {
      "text": "Brosschot, J. F. and Thayer, J. F. (2003). Heart rate response is longer after negative emotions than after positive emotions. International Journal of Psychophysiology, 50, 3, 181--187.",
      "doi": ""
    },
    {
      "text": "Caccioppo, J. T., Berntson, G. G., Larsen, J. T., Poehlmann, K. M., and Ito, T. A. (2000). The Psychophysiology of Emotion. In Lewis, M. and Haviland, J. M. (eds.). Handbook of Emotions (pp. 173-191), 2nd Edition. The Guilford Press, New York.",
      "doi": ""
    },
    {
      "text": "Davidson, R. J. (2003). Seven sins in the study of emotion: correctives from affective neuroscience. Brain and Cognition, 52, 129--132.",
      "doi": ""
    },
    {
      "text": "Davidson, R. J. and Cacioppo, J. T. (1992). New developments in the scientific study of emotion: an introduction to the special section. Psychological Science, 3, 1, 21--22.",
      "doi": ""
    },
    {
      "text": "Harland, C. J., Clark, T. D., and Prance, R. J. (2002). Electric potential probes - new directions in the remote sensing of the human body. Measurement Science and Technology, 13, 163--169.",
      "doi": ""
    },
    {
      "text": "Isen, A. M., Daubman, K. A., and Nowicki, G. P. (1987). Positive affect facilitates creative problem solving. Journal of Personality and Social Psychology, 52, 6, 1122--1131.",
      "doi": ""
    },
    {
      "text": "Kapoor, A., Mota, S., and Picard, R. W. (2001). Towards a Learning Companion that Recognizes Affect. Proc. Emotional and Intelligent II: The Tangled Knot of Social Cognition, AAAI Fall Symposium 2001.",
      "doi": ""
    },
    {
      "text": "Klein, J., Moon, Y., and Picard, R. W. (2002). This computer responds to user frustration: theory, design and results. Interacting with computers, 14, 119--140.",
      "doi": ""
    },
    {
      "text": "Lang, P. J., Bradley. M.M., and Cuthbert, B.N. (1992). A motivational analysis of emotion: Reflex-cortex connections. Psychological Science, 3, 1, 44--49.",
      "doi": ""
    },
    {
      "text": "Lang, P. J., Bradley. M.M., and Cuthbert, B.N. (1999). International Affective Picture System (IAPS): instruction manual and affective ratings. Technical Report A-4, The Center for Research in Psychophysiology, University of Florida.",
      "doi": ""
    },
    {
      "text": "Nass, C., Steuer, J., and Tauber, E.R. (1994). Computers are social actors. Proc. CHI 1994, ACM Press, 72--78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Norman, D.A. (2002). Emotion & design: attractive things work better. Interactions, 9, 4, 36--42.  ",
      "doi": "10.1145/543434.543435"
    },
    {
      "text": "Paajanen, M., Lekkala, J., and Kirjavainen, K. (2000) ElectroMechanical Film (EMFi) - a new multipurpose electret material. Sensors and Actuators, 84, 95--102.",
      "doi": ""
    },
    {
      "text": "Palomba D., Angrilli A., and Mini A. (1997). Visual evoked potentials, heart rate responses and memory to emotional pictorial stimuli. International Journal of Psychophysiology, 27, 1, 55--67.",
      "doi": ""
    },
    {
      "text": "Partala, T., Aula, A., and Surakka, V. (2001). Combined Voluntary Gaze Direction and Facial Muscle Activity as a New Pointing Technique. Proc. INTERACT 2001, IOS Press, 100--107.",
      "doi": ""
    },
    {
      "text": "Partala, T. and Surakka, V. (2004). The effects of affective interventions in human-computer interaction. Interacting with Computers, 16, 2, 295--309.",
      "doi": ""
    },
    {
      "text": "Partala, T., Surakka, V., and Vanhala, T. (2005). Person-independent estimation of emotional experiences from facial expressions. Proceedings of IUI 2005, Accepted.  ",
      "doi": "10.1145/1040830.1040883"
    },
    {
      "text": "Picard, R. W. (1997). Affective Computing. MIT Press, Cambridge. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Picard, R. W. and Healey, J. (1997). Affective Wearables. Personal Technologies, 1, 4, 231--240.",
      "doi": ""
    },
    {
      "text": "Picard, R. W., Vyzas, E., and Healey, J. (2001). Towards machine emotional intelligence: analysis of affective physiological state. IEEE Transactions on Pattern Analysis and Machine Intelligence, 23, 10, 1175--1190.  ",
      "doi": "10.1109/34.954607"
    },
    {
      "text": "Reeves, B. and Nass, C. (1996). The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Cambridge University Press, New York. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Scheirer, J., Fernandez, R., Klein, J., and Picard, R. W. (2002). Frustrating the user on purpose: a step toward building an affective computer. Interacting with computers, 14, 2, 93--118.",
      "doi": ""
    },
    {
      "text": "Schneider, W., Eschman, A., and Zuccolotto, A. (2002). E-Prime User's Guide. Psychology Software Tools, Inc, Pittsburgh.",
      "doi": ""
    },
    {
      "text": "Schulkin, J., Thompson, B. L., and Rosen, J. B. (2003). Demythologizing the emotions: adaptation, cognition, and visceral representations of emotion in the nervous system. Brain and Cognition, 52, 15--23.",
      "doi": ""
    },
    {
      "text": "Surakka, V. (2005). Socially and emotionally significant human-computer interaction. To appear in Kappas, A. (ed.). Multi-channel communication on the Internet. Cambridge University Press, New York.",
      "doi": ""
    },
    {
      "text": "Surakka, V., Illi, M. & Isokoski, P. (2004). Gazing and Frowning As a New Technique for Human-Computer Interaction. ACM Transactions on Applied Perception, 1, 1, 40--56.  ",
      "doi": "10.1145/1008722.1008726"
    },
    {
      "text": "Turk, M. and Robertson, G. (2000). Perceptual User Interfaces. Communications of the ACM, 43, 3, 33--34.  ",
      "doi": "10.1145/330534.330535"
    },
    {
      "text": "Zajonc, R. B. (1980) Feeling and thinking: preferences need no inferences. American Psychologist, 35, 151--175.",
      "doi": ""
    }
  ]
}