{
  "doi": "10.1145/1054972.1055021",
  "title": "DeDe: design and evaluation of a context-enhanced mobile messaging system",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "351-360",
  "year": 2005,
  "badges": [],
  "abstract": "This paper presents the design, implementation and validation of an enhanced mobile phone messaging system (DeDe), allowing the sender to define the context in which the message will be delivered to the recipient. A field trial among a socially tight group of teenagers showed that the DeDe feature was incorporated as part of the participants' existing messaging culture. 11,4% of their total messaging output made use of the DeDe feature. The most frequently used context parameters were location (based on network cell-ID) and time. Novel message practices emerged, as compared to 'normal' messaging, both in terms of timing of message sending, as well as creating content that specifically exploited the DeDe feature. Some use barriers were recognized, the most important being the sender's uncertainty of delivery success. Implications for design are discussed.",
  "authors": [
    {
      "name": "Younghee Jung",
      "institution": "Nokia Corporation, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318489912",
      "orcid": "missing"
    },
    {
      "name": "Per Persson",
      "institution": "Nokia Corporation, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100558662",
      "orcid": "missing"
    },
    {
      "name": "Jan Blom",
      "institution": "Nokia Research Center, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100402263",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Burrell, J., Gay, G., Kubo, K., & Farina, N., Context-Aware computing: A test case. In G. Borriello & L.E. Holmquist (Eds.), Ubicomp 2002, 1--15. ",
      "doi": "10.5555/647988.741474"
    },
    {
      "text": "Erickson, T., Smith, D.N., Kellogg, W.A., Laff, M.R., Richards, J.T., and Bradner, E. Socially translucent systems: Social proxies, persistent conversation, and the design of 'Babble', Proceedings of CHI '99, ACM, New York, pp. 72--9.  ",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "Milewski, A.E. & Smith, T.M. Providing Presence Cues to Telephone Users, Proceedings of the Conference on Computer-Supported Cooperative Work (CSCW) 2000, pp. 89--96.  ",
      "doi": "10.1145/358916.358978"
    },
    {
      "text": "Mäntyjärvi, J., Tuomela, U., Känsälä, I. & Hääkkilä, J. Context Studio - Tool for Personalizing Context - Aware Applications in Mobile Terminals, OZCHI 2003.",
      "doi": ""
    },
    {
      "text": "Nardi, B., Whittaker, S., and Bradner, E. Interaction and Outeraction: Instant Messaging in Action, Proceedings of the Conference on Computer-Supported Cooperative Work (CSCW) 2000, Philadelphia, pp. 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Nokia Presence Solution (2003). URL: http://www.nokia.com/nokia/0,8764,43089,00.html",
      "doi": ""
    },
    {
      "text": "Rantanen, M., Oulasvirta, A., Blom, J., Tiitta, S., & Määntylä, M. (2004). Proceedings of NordiCHI 2004, 23-27th October 2004, Finland.",
      "doi": ""
    },
    {
      "text": "Tang, J.C., Yankelovich, N., Begole J., Kleek M., Li F. and Bhalodia, J. ConNexus to Awarenex: extending awareness to mobile users, Proceedings of the SIGCHI conference on Human factors in computing systems, 2001, pp.221--228.  ",
      "doi": "10.1145/365024.365105"
    },
    {
      "text": "Kasesniemi, E., & Rautiainen, P. (2002). Mobile culture of children and teenagers in Finland. In M. Aakhus & J. Katz (Eds.), Perpetual contact: mobile communication, private talk, and public performance, CUP, pp. 170--192. ",
      "doi": "10.5555/644547.644559"
    }
  ]
}