{
  "doi": "10.1145/1054972.1054975",
  "title": "How oversight improves member-maintained communities",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "11-20",
  "year": 2005,
  "badges": [],
  "abstract": "Online communities need regular maintenance activities such as moderation and data input, tasks that typically fall to community owners. Communities that allow all members to participate in maintenance tasks have the potential to be more robust and valuable. A key challenge in creating member-maintained communities is building interfaces, algorithms, and social structures that encourage people to provide high-quality contributions. We use Karau and Williams' collective effort model to predict how peer and expert editorial oversight affect members' contributions to a movie recommendation website and test these predictions in a field experiment with 87 contributors. Oversight increased both the quantity and quality of contributions while reducing antisocial behavior, and peers were as effective at oversight as experts. We draw design guidelines and suggest avenues for future work from our results.",
  "authors": [
    {
      "name": "Dan Cosley",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/do/10.1145/contrib-81100288358/rel-imgonly/3435035874_f9b2a1d423_o.jpg",
      "acmid": "81100288358",
      "orcid": "0000-0001-8108-1954"
    },
    {
      "name": "Dan Frankowski",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100071523",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    },
    {
      "name": "Loren Terveen",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/do/10.1145/contrib-81100276946/rel-imgonly/my_mcknight_photo_2017.jpg",
      "acmid": "81100276946",
      "orcid": "missing"
    },
    {
      "name": "John Riedl",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/do/10.1145/contrib-81100096968/rel-imgonly/dsc_0133_riedl1_small.jpg",
      "acmid": "81100096968",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "G. Beenen, K. Ling, X. Wang, K. Chang, D. Frankowski, P. Resnick, and R. E. Kraut. Using social psychology to motivate contributions to online communities. Proceedings of CSCW2004, Chicago, IL, November 2004.  ",
      "doi": "10.1145/1031607.1031642"
    },
    {
      "text": "B. Butler, L. Sproull, S. Kiesler, and R. Kraut. Community Building in Online Communities: Who Does the Work and Why? Leadership at a Distance. Lawrence Erlbaum Publishers, Inc., Mahwah, NJ, 2005.",
      "doi": ""
    },
    {
      "text": "D. Cosley, S. K. Lam, I. Albert, J. A. Konstan, and J. Riedl. Is seeing believing?: how recommender system interfaces affect users' opinions. Proceedings of SIGCHI, pages 585--592, Ft. Lauderdale, 2003.  ",
      "doi": "10.1145/642611.642713"
    },
    {
      "text": "R. M. Dawes. Social dilemmas. Annual Review of Psychology, 31:169--193, 1980.",
      "doi": ""
    },
    {
      "text": "R. M. Dawes and R. H. Thaler. Anomalies: Cooperation. The Journal of Economic Perspectives, 2(3):187--197, 1988.",
      "doi": ""
    },
    {
      "text": "T. Erickson et al. Socially translucent systems: social proxies, persistent conversation, and the design of babble. In Proc. SIGCHI, pages 72--79, 1999.  ",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "A. Graycar. Graffiti: Implications for law enforcement, local government and the community. In Graffiti and Disorder: Local Government, Law Enforcement and Community Responses, Brisbane, August 2003.",
      "doi": ""
    },
    {
      "text": "G. Hardin. The tragedy of the commons. Science, 162:1243--1248, 1968.",
      "doi": ""
    },
    {
      "text": "R. Hardin. Collective Action. Johns Hopkins, Baltimore, 1982.",
      "doi": ""
    },
    {
      "text": "S. G. Harkins. Social loafing and social facilitation. Journal of Experimental Social Psych., 23:1--18, 1987.",
      "doi": ""
    },
    {
      "text": "S. J. Karau and K. D. Williams. Social loafing: A meta-analytic review and theoretical integration. Journal of Personality and Social Psychology, 65(4):681--706, 1993.",
      "doi": ""
    },
    {
      "text": "N. L. Kerr. Motivation losses in small groups: a social dilemma analysis. Journal of Personality and Social Psychology, 45:819--828, 1983.",
      "doi": ""
    },
    {
      "text": "C. Lampe and P. Resnick. Slash(dot) and burn: distributed moderation in a large online conversation space. In Proceedings of SIGCHI, pages 543--550, Vienna, Austria, 2004. ACM Press.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "J. Lave. Situating Learning in Communities of Practice. Perspectives on Socially Shared Cognition. APA, 1993.",
      "doi": ""
    },
    {
      "text": "P. J. Ludford, D. Cosley, D. Frankowski, and L. Terveen. Think different: increasing online community participation using uniqueness and group dissimilarity. In Proceedings of SIGCHI, pages 631--638, Vienna, Austria, 2004. ACM Press.  ",
      "doi": "10.1145/985692.985772"
    },
    {
      "text": "J. Preece. Online Communities: Designing Usability, Supporting Sociability. John Wiley & Sons, Ltd, 2000. ",
      "doi": "10.5555/517688"
    },
    {
      "text": "R. Putnam. Bowling Alone: The Collapse and Revival of American Community. Simon & Schuster, 2000.  ",
      "doi": "10.1145/358916.361990"
    },
    {
      "text": "A. M. Rashid, I. Albert, D. Cosley, S. K. Lam, S. M. McNee, J. A. Konstan, and J. Riedl. Getting to know you: learning new user preferences in recommender systems. In Proc. IUI, pages 127--134, San Francisco, 2002.  ",
      "doi": "10.1145/502716.502737"
    },
    {
      "text": "P. Resnick, N. Iacovou, M. Suchak, P. Bergstrom, and J. Riedl. Grouplens: an open architecture for collaborative filtering of netnews. In Proceedings of CSCW, pages 175--186, Chapel Hill, NC, 1994.  ",
      "doi": "10.1145/192844.192905"
    },
    {
      "text": "P. Resnick, K. Kuwabara, R. Zeckhauser, and E. Friedman. Reputation systems. Communications of the ACM, 43(12):45--48, 2000.  ",
      "doi": "10.1145/355112.355122"
    },
    {
      "text": "M. Smith. Tools for navigating large social cyberspaces. Communications of the ACM, 45(4):51--55, 2002.  ",
      "doi": "10.1145/505248.505272"
    },
    {
      "text": "B. K. Thorn and T. Connolly. Discretionary data bases: A theory and some experimental findings. Communication Research, 14:512--528, 1987.",
      "doi": ""
    },
    {
      "text": "F. B. Viégas, M. Wattenberg, and K. Dave. Studying cooperation and conflict between authors with history flow visualizations. In Proceedings of SIGCHI, pages 575--582, Vienna, Austria, 2004. ACM Press.  ",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "V. H. Vroom. Work and Motivation. Wiley, N.Y., 1964.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Wikipedia:about - wikipedia. http://en.wikipedia.org/wiki/Wikipedia:About, 2004.",
      "doi": ""
    }
  ]
}