{
  "doi": "10.1145/1054972.1055033",
  "title": "Improving aviation safety with information visualization: a flight simulation study",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "441-450",
  "year": 2005,
  "badges": [],
  "abstract": "Many aircraft accidents each year are caused by encounters with invisible airflow hazards. Recent advances in aviation sensor technology offer the potential for aircraft-based sensors that can gather large amounts of airflow velocity data in real-time. With this influx of data comes the need to study how best to present it to the pilot - a cognitively overloaded user focused on a primary task other than that of information visualization.We focus on one particular aviation application, but the results may be relevant to user interfaces in other operationally stressful environments.",
  "authors": [
    {
      "name": "Cecilia R. Aragon",
      "institution": "University of California, Berkeley and NASA Ames Research Center, Berkeley, CA",
      "img": "/do/10.1145/contrib-81502659190/rel-imgonly/cecilia_aragon_feb_2020_110x110.jpg",
      "acmid": "81502659190",
      "orcid": "missing"
    },
    {
      "name": "Marti A. Hearst",
      "institution": "University of California, Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Advanced Rotorcraft Technology, Inc., 1685 Plymouth St., Suite 250, Mountain View, CA, USA 94043, http://www.flightlab.com.",
      "doi": ""
    },
    {
      "text": "Alter, K.W., Barrows, A.K., Jennings, C., Powell, J.D. 3-D Perspective Primary Flight Displays for Aircraft. Proceedings of Human Factors and Ergonomics Society, (2000).",
      "doi": ""
    },
    {
      "text": "Aragon, C. Usability Evaluation of a Flight-Deck Airflow Hazard Visualization System. 23rd Digital Avionics Systems Conference (2004).",
      "doi": ""
    },
    {
      "text": "Bailey, R.E., Parrish, R.V., Kramer, L J., Harrah, S.D., Arthur, J.J. III. Technical Challenges In the Development of a NASA Synthetic Vision System Concept. NATO RTA (2003).",
      "doi": ""
    },
    {
      "text": "Brita, C. L., Kelly, C. W. User's Guide for an Airborne Doppler Weather Radar Simulation (ADWRS), NASA TPAWS (2002).",
      "doi": ""
    },
    {
      "text": "Buning, P. Numerical algorithms in CFD post-processing, Computer Graphics and Flow Visualization in Computational Fluid Dynamics, von Karman Institute for Fluid Dynamics Lecture Series 1989-07.",
      "doi": ""
    },
    {
      "text": "Chambers, J. Concept to Reality, NASA SP-2003-4529, http://oea.larc.nasa.gov/PAIS/Concept2Reality/wind_shear.html.",
      "doi": ""
    },
    {
      "text": "Endsley, M.R. Designing for Situation Awareness in Complex Systems, Proceedings of the Second International Workshop on symbiosis of humans, artifacts and environment, Kyoto, Japan (2001).",
      "doi": ""
    },
    {
      "text": "FAA National Aviation Safety Analysis Center, https://www.nasdac.faa.gov/.",
      "doi": ""
    },
    {
      "text": "Furmanski, C., Azuma, R. and Daily, M., Augmented-reality visualizations guided by cognition: Perceptual heuristics for combining visible and obscured information. Proceedings of IEEE and ACM International Symposium on Mixed and Augmented Reality (ISMAR 2002), 2002, 215--224. ",
      "doi": "10.5555/850976.854989"
    },
    {
      "text": "He, C. and Goericke, J., Army ART TR 2011 - DAAH10-03-C-0001, FLIGHTLAB UH-60L Simulation Model Validation, 2004.",
      "doi": ""
    },
    {
      "text": "Holforty, W. Flight-Deck Display of Neighboring Aircraft Wake Vortices, Ph.D. dissertation, Stanford University (2003).",
      "doi": ""
    },
    {
      "text": "Julier, S., Lanzagorta, M., Baillot, Y. and Brown, D. Information Filtering for Mobile Augmented Reality. IEEE Computer Graphics and Applications, 22 (5), 2002, 12--15.  ",
      "doi": "10.1109/MCG.2002.1028721"
    },
    {
      "text": "Kao, C.-Y. J., Cooper, D.I., Reisner, J.M., Eichinger, W.E., and Ghil, M. Probing Atmospheric Turbulence with High-Resolution Lidar and Models, J. Geophys. Res. (2002) 107(D9): 7 1--7.10.",
      "doi": ""
    },
    {
      "text": "Lane, D.A. Visualizing Time-Varying Phenomena in Numerical Simulations of Unsteady Flows, NASA NAS Technical Report NAS-96-001 (1996).",
      "doi": ""
    },
    {
      "text": "Latorella, K., Chamberlain, J. Graphical Weather Information System Evaluation: Usability, Perceived Utility, and Preferences from General Aviation Pilots, NASA AWIN technical report (2002).",
      "doi": ""
    },
    {
      "text": "Lee, A.T. Aircrew Decision-Making Behavior in Hazardous Weather Avoidance, Aviation, Space, and Environmental Medicine (1991).",
      "doi": ""
    },
    {
      "text": "Max, N., Becker, B., Crawfis, R. Flow Volumes for Interactive Vector Field Visualization, Proceedings of Visualization 93, IEEE Computer Society Press (1993), 19--23. ",
      "doi": "10.5555/949845.949854"
    },
    {
      "text": "McCann, R.S., Foyle, D.C. Superimposed symbology: Attentional problems and design solutions, SAE Transactions: Journal of Aerospace, 103 (1994), 2009--2016.",
      "doi": ""
    },
    {
      "text": "Mewhinney, M. Flow over helicopter carriers, NASA Ames Astrogram, October 30, 1998.",
      "doi": ""
    },
    {
      "text": "Milgram, P. and Kishino, F. A Taxonomy of Mixed Reality Visual Displays. IEICE Transactions on Information Systems, E77-D (12), 1994.",
      "doi": ""
    },
    {
      "text": "NASA Marshall Space Flight Center Lidar Tutorial, http://www.ghcc.msfc.nasa.gov/sparcle/sparcle_tutorial.html.",
      "doi": ""
    },
    {
      "text": "Naval Safety Center Aviation Data Analysis Division, http://www.safetycenter.navy.mil/aviation/aviationdata/default.htm.",
      "doi": ""
    },
    {
      "text": "Orlady, H.W. The professional airline pilot of today: All the old skills--and more. International Airline Pilot Training Seminar, Caracas, Venezuela (1989).",
      "doi": ""
    },
    {
      "text": "Particle Image Velocimetry at NASA Glenn, http://www.grc.nasa.gov/WWW/OptInstr/piv/background.htm.",
      "doi": ""
    },
    {
      "text": "Post, F., van Wijk, J. Visual representation of vector fields: recent developments and research directions, Scientific Visualization Advances and Challenges, Academic Press (1993), 367--390.",
      "doi": ""
    },
    {
      "text": "Prinzel, L. Head-Up Displays and Attention Capture, NASA Technical Memorandum 2004-213000.",
      "doi": ""
    },
    {
      "text": "Roscoe, S.N. Airborne displays for flight and navigation, Human Factors, 10 (1968), 321--322.",
      "doi": ""
    },
    {
      "text": "Shaw, C.D., Jiang, F.T., Parry, R.M., Plale, B., Wasilewski, A., Ribarsky, W., Faust, N.L. Real-Time Weather Data on Terrain, NASA AWIN, SPIE Vol. #4368, Radar Sensor Technology and Data Visualization (2001).",
      "doi": ""
    },
    {
      "text": "Spence, R. Information Visualization, Addison-Wesley/ACM Press (2001).",
      "doi": ""
    },
    {
      "text": "Spirkovska, L., Lodha, S.K. AWE: Aviation weather data visualization environment, Computers and Graphics, 26 (2002), 169.",
      "doi": ""
    },
    {
      "text": "Spitzer, C. R., Parrish, R.V., Baize, D.G., Lewis, M.S. The Avionics Handbook: Synthetic Vision, NASA Aviation Safety Program (2001).",
      "doi": ""
    },
    {
      "text": "Strid, T., Rizzi, A., Oppelstrup, J. Development and use of some flow visualization algorithms, Computer Graphics and Flow Visualization in Computational Fluid Dynamics, von Karman Institute for Fluid Dynamics Lecture Series 1989-07 (1989).",
      "doi": ""
    },
    {
      "text": "Strope, K., Borden, C. and Harding, J., Verification and Validation of a UH-60 FLIGHTLAB model in support of the UH-60M Limited User Test. American Helicopter Society 60th Annual Forum (2004).",
      "doi": ""
    },
    {
      "text": "Sujudi, D., Haimes, R. Identification of Swirling Flow in 3D Vector Fields, AIAA Paper 95-1715, San Diego, CA, USA (1995).",
      "doi": ""
    },
    {
      "text": "Switzer, G., Britt, C. Performance of the NASA Airborne Radar with the Windshear Database for Forward-Looking Systems, NASA CR 201607 (1996).",
      "doi": ""
    },
    {
      "text": "Turner, B., Leclerc, M.Y., Gauthier, M., Moore, K., and Fitzjarrald, D. Identification of Turbulence Structures above a Forest Canopy using the Wavelet Transform, J. Geophys. Res. 99 D1 (1994), 1919--1926.",
      "doi": ""
    },
    {
      "text": "Uenking, M.D., Hughes, M.F. The Efficacy of Using Synthetic Vision Terrain-Textured Images to Improve Pilot Situation Awareness, SAE World Aviation Congress (2002).",
      "doi": ""
    },
    {
      "text": "United States Department of Commerce, 1986, The Crash of Delta Flight 191 at Dallas-Fort Worth International Airport on 2 August 1985: Multiscale Analysis of Weather Conditions, National Oceanic and Atmospheric Administration, Boulder, CO, USA.",
      "doi": ""
    },
    {
      "text": "United States Navy, A1-H60BB-NFM-000, NATOPS Flight Manual - Navy Model SH-60B Aircraft (2004).",
      "doi": ""
    },
    {
      "text": "Wallace, L. Airborne Trailblazer, NASA Langley Wind Shear Program (1993), http://oea.larc.nasa.gov/trailblazer/SP-4216/.",
      "doi": ""
    },
    {
      "text": "Wickens, C.D., Carbonari, R., Merwin, D., Morphew, E., O'Brien, J. Cockpit Displays to Support Hazard Awareness in Free Flight. NASA Technical Report ARL-97-7/NASA-97-4 (1997).",
      "doi": ""
    },
    {
      "text": "Wilkinson, C.H., Zan, S.J., Gilbert, N.E., Funk, J.D. Modelling and Simulation of Ship Air Wakes for Helicopter Operations. Fluid Dynamics Problems of Vehicles Operating Near or in the Air-Sea Interface RTO-MP-15 (1999).",
      "doi": ""
    },
    {
      "text": "Williams, S.L., Long, K.R. Dynamic Interface Flight Tests and the Pilot Rating Scale. American Helicopter Soc. 53rd Annual Forum (1997).",
      "doi": ""
    }
  ]
}