{
  "doi": "10.1145/1054972.1055066",
  "title": "Summary thumbnails: readable overviews for small screen web browsers",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "681-690",
  "year": 2005,
  "badges": [],
  "abstract": "In order to display web pages designed for desktop-sized monitors, some small-screen web browsers provide single-column or thumbnail views. Both have limitations. Single-column views affect page layouts and require users to scroll significantly more. Thumbnail views tend to reduce contained text beyond readability, so differentiating visually similar areas requires users to zoom. In this paper, we present Summary Thumbnails-thumbnail views enhanced with readable text fragments. Summary Thumbnails help users identify viewed material and distinguish between visually similar areas. In our user study, participants located content in web pages about 41% faster and with 71% lower error rates when using the Summary Thumbnail interface than when using the Single-Column interface, and zoomed 59% less than when using the Thumbnail interface. Nine of the eleven participants preferred Summary Thumbnails over both the Thumbnail and Single-Column interfaces.",
  "authors": [
    {
      "name": "Heidi Lam",
      "institution": "University of British Columbia, Vancouver, BC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659798478",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P., Lee, B., and Hanna, L. Fishnet, a fisheye web browser with search term popouts: a comparative evaluation with overview and linear view. In Proc. AVI 2004, pp 133--140.  ",
      "doi": "10.1145/989863.989883"
    },
    {
      "text": "Baudisch, P., Xie, X, Wang, C., and Ma, W-Y. Collapse-to-Zoom: Viewing Web Pages on Small Screen Devices by Interactively Removing Irrelevant Content. To appear in Proc. UIST 2004.  ",
      "doi": "10.1145/1029632.1029647"
    },
    {
      "text": "Bederson, B.B., Hollan, J.D., Perlin, K., Meyer, J., Bacon, D., and Furnas, G., Pad++: a zoomable graphical sketchpad for exploring alternate interface physics, Journal of Visual Languages and Computation, 7, 1996, p3--31.",
      "doi": ""
    },
    {
      "text": "Bickmore, T., and Schilit, B, Digestor: Device-Independent Access to the World Wide Web. In Proc. Seventh Intl. WWW Conference 1997, pp. 655--663. ",
      "doi": "10.5555/283554.283349"
    },
    {
      "text": "Bjork, S., Bretan, I., Danielsson, R., and Karlgren, J. WEST: A Web Browser for Small Terminals. In Proc. UIST'99, pp. 187--196.  ",
      "doi": "10.1145/320719.322601"
    },
    {
      "text": "Buyukkokten, O., Gracia-Molina, H., Paepcke, and Winograd, T. Power Browser: Efficient Web Browsing for PDAs. In Proc. CHI 2000, pp. 430--437.  ",
      "doi": "10.1145/332040.332470"
    },
    {
      "text": "Chen, L., Xie, X., Ma, Y. W., Zhang, H-J., Zhou, H. Feng, H. DRESS: A Slicing Tree Based Web Representation for Various Display Sizes. Technical Report MSR-TR-2002-126, December 2002.",
      "doi": ""
    },
    {
      "text": "Czerwinski, M. P., van Dantzich, M., Robertson, G., and Hoffman, H. The Contribution of Thumbnail Image, Mouse-over Text and Spatial Location Memory to Web Page Retrieval in 3D. In Proc INTERACT'99, pp. 163--170.",
      "doi": ""
    },
    {
      "text": "Dziadosz, S., and Chandrasekar, R. Do Thumbnail Previews Help Users Make Better Relevance Decisions about Web Search Results? Proc SIGIR'02, pp. 365--366.  ",
      "doi": "10.1145/564376.564446"
    },
    {
      "text": "Gajos, K. and Weld, D. SUPPLE: Automatically Generating User Interfaces. In Proc. IUI'04, pp. 93--101.  ",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Gomes, P., Tostao, S., Goncalives, D., and Jorge, J. Web Clipping: Compression Heuristics for Displaying Text on a PDA. Mobile HCI '01 (poster paper), 2001.",
      "doi": ""
    },
    {
      "text": "Good, L., Bederson, B., Stefik, M., and Baudisch, P. Automatic Text Reduction For Changing Size Constraints. In CHI'02 Extended Abstracts, pp. 798--799.  ",
      "doi": "10.1145/506443.506603"
    },
    {
      "text": "Hanson, V. L. and Richards, J. T. A Web Accessibility Service: Update and Findings. In Proc. SIGACCESS '04, pp.169--176.  ",
      "doi": "10.1145/1028630.1028661"
    },
    {
      "text": "Jacobs, C., Li, W., Schrier, E., Bargeron, D., and Salesin, D. Adaptive Grid-Based Document Layout. In Proc. SIGGRAPH'03, pp. 838--847.  ",
      "doi": "10.1145/1201775.882353"
    },
    {
      "text": "Jones, M. Marsden, G., Mohd-Nasir, N., Boone, K. Buchanon, G. Improving Web Interaction on Small Displays. In Proc. WWW8 conference, pp. 1129--1137. ",
      "doi": "10.1016/S1389-1286%2899%2900013-4"
    },
    {
      "text": "Lawton, D. T. and Feigin, E. J. Streaming Thumbnails: Combining Low Resolution Navigation and RSVP Displays. In Proc. CHI'00, pp. 159--160.  ",
      "doi": "10.1145/633292.633381"
    },
    {
      "text": "Lee, K. B., Grice, R. A. Getting and Giving Information: An Adaptive Viewing Application for the Web on Personal Digital Assistants. In Proc. 21st annual international conference on Documentation, pp. 125--132.  ",
      "doi": "10.1145/944868.944895"
    },
    {
      "text": "Milic-Frayling, N. and Sommerer, R. Smartview: Enhanced document viewer for mobile devices. Technical Report MSR-TR-2002-114, Microsoft Research, Cambridge, UK, November 2002.",
      "doi": ""
    },
    {
      "text": "Nygren, E., Lind, M., Johnson M., and Sandblad, B. The Art of the Obvious. In Proc. CHI '92, pp. 235--239.  ",
      "doi": "10.1145/142750.142800"
    },
    {
      "text": "O'Hara, K., Sellen, A. and Bentley, R. Supporting Memory for Spatial Location while Reading from Small Displays. In Proc CHI'99, pp. 220--221.  ",
      "doi": "10.1145/632716.632853"
    },
    {
      "text": "Salton, G. and McGill, M.J. Introduction to Modern Information Retrieval. New York: McGraw-Hill, 1983. ",
      "doi": "10.5555/576628"
    },
    {
      "text": "Stone, M. C., Fishkin, K., and Bier, E. A. The Movable Filter as a User Interface Tool. In Proc. CHI'94, pp. 306--312.  ",
      "doi": "10.1145/191666.191774"
    },
    {
      "text": "Suh, B., and Woodruff, A. Popout Prism: Adding Perceptual Principles to Overview + Detail Document Interfaces. In Proc. CHI'02, pp. 251--258.  ",
      "doi": "10.1145/503376.503422"
    },
    {
      "text": "Suh, B., Ling, H., Bederson, B. B., and Jacobs, D. W. Automatic Thumbnail Cropping and Its Effectiveness, In Proc. UIST'03, pp. 95--104.  ",
      "doi": "10.1145/964696.964707"
    },
    {
      "text": "Wobbrock, J., Forlizzi, J., Hudson, S., Myers, B. WebThumb: Interaction Techniques for Small-Screen Browsers. In Proc. UIST'02, pp. 205--208.  ",
      "doi": "10.1145/571985.572014"
    },
    {
      "text": "Woodruff, A., Faulring, A., Rosenholtz, R., Morrison, J., and Pirolli, P. Using Thumbnails to Search the Web. In Proc. CHI'01, pp. 198--205.  ",
      "doi": "10.1145/365024.365098"
    },
    {
      "text": "Word frequency list from http://www.comp.lancs.ac.uk/ ucrel/bncfreq/lists/6_1_1_all_tag.txt",
      "doi": ""
    }
  ]
}