{
  "doi": "10.1145/1054972.1055056",
  "title": "A study on the manipulation of 2D objects in a projector/camera-based augmented reality environment",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "611-620",
  "year": 2005,
  "badges": [],
  "abstract": "Are the object manipulation techniques traditionally used in head-mounted displays (HMDs) applicable to augmented reality based projection systems? This paper examines the differences between HMD- and projector/camera-based AR interfaces in the light of a manipulation task involving documents and applications projected on common office surfaces such as tables, walls, cabinets, and floor. We report a Wizard of Oz study where subjects were first asked to create gesture/voice commands to move 2D objects on those surfaces and then exposed to gestures created by the authors. Among the options, subjects could select the object to be manipulated using voice command; touching, pointing, and grabbing gesture; or a virtual mouse. The results show a strong preference for a manipulation interface based on pointing gestures using small hand movements and involving minimal body movement. Direct touching of the object was also common when the object being manipulated was within the subjects' arm reach. Based on these results, we expect that the preferred interface resembles, in many ways, the egocentric model traditionally used in AR.",
  "authors": [
    {
      "name": "Stephen Voida",
      "institution": "Georgia Institute of Technology, Atlanta, Georgia",
      "img": "/do/10.1145/contrib-81100147302/rel-imgonly/steve_-_interactions__cropped_close_.png",
      "acmid": "81100147302",
      "orcid": "missing"
    },
    {
      "name": "Mark Podlaseck",
      "institution": "IBM Research, T.J. Watson, Hawthorne, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100011274",
      "orcid": "missing"
    },
    {
      "name": "Rick Kjeldsen",
      "institution": "IBM Research, T.J. Watson, Hawthorne, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100449782",
      "orcid": "missing"
    },
    {
      "name": "Claudio Pinhanez",
      "institution": "IBM Research, T.J. Watson, Hawthorne, New York",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100364954",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azuma, R., Baillot, Y., Behringer, R., Feiner, S., Julier, S. and MacIntyre, B. Recent Advances in Augmented Reality. IEEE Computer Graphics and Applications, 25, 6 (2001), 24--35.  ",
      "doi": "10.1109/38.963459"
    },
    {
      "text": "Bobick, A.F. and Bolles, R.C. The Representation Space Paradigm of Concurrent Evolving Object Descriptions. IEEE Trans. on Pattern Analysis and Machine Intelligence, 14, 2 (1992), 146--156.  ",
      "doi": "10.1109/34.121786"
    },
    {
      "text": "Bolt, R. Put That There: Voice and Gesture at the Graphics Interface. ACM Computer Graphics, 14, 3 (1980), 262--270.  ",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Bowman, D.A. and Hodges, L.F. An Evaluation of Techniques for Grabbing and Manipulating Remote Objects in Immersive Virtual Environments. In Proc. 1997 Symposium on Interactive 3D Graphics, (1997), 35--38.  ",
      "doi": "10.1145/253284.253301"
    },
    {
      "text": "Cao, X. and Balakrishnan, R. VisionWand: Interaction Techniques for Large Displays Using a Passive Wand Tracked in 3D. In Proc. UIST 2003, ACM Press (2003), 193--202.  ",
      "doi": "10.1145/964696.964716"
    },
    {
      "text": "Corradini, A. and Cohen, P.R. O the Relationships Among Speech, Gestures, and Object Manipulation in Virtual Environments: Initial Evidence. In Proc. of the International CLASS Workshop on Natural, Intelligent and Effective Interaction in Multimodal Dialogue Systems, Copenhagen, Denmark, (2002).",
      "doi": ""
    },
    {
      "text": "Dahlbäck, N., Jönsson, A. and Ahrenberg, L. Wizard of Oz Studies: Why and How. In Proc. IUI 1993, ACM Press (1993), 193--200.  ",
      "doi": "10.1145/169891.169968"
    },
    {
      "text": "Drucker, P.F. Management: Tasks, Responsibilities, Practices. 1st ed. Harper & Row, New York (1974).",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J.C. and Kassell, N.F. A Survey of Design Issues in Spatial Input. In Proc. UIST 1994, ACM Press (1994), 213--222.  ",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Kidd, A. The Marks are on the Knowledge Worker. In Proc. CHI 1994, ACM Press (1994), 186--191.  ",
      "doi": "10.1145/191666.191740"
    },
    {
      "text": "Kjeldsen, R., Levas, A. and Pinhanez, C. Dynamically Reconfigurable Vision-Based User Interfaces. In Proc. Third International Conference on Vision Systems (ICVS 2003), Springer-Verlag (2003), 323--332. ",
      "doi": "10.5555/1765473.1765510"
    },
    {
      "text": "Koons, D.B., Sparrell, C.J. and Thorrison, K.R. Integrating Simultaneous Input from Speech, Gaze, and Hand Gestures. In Intelligent Multimedia Interfaces, M. Maybury, ed., AAAI/MIT Press, Menlo Park, California, (1993), 257--276. ",
      "doi": "10.5555/162477.162508"
    },
    {
      "text": "Lai, J., Levas, A., Chou, P., Pinhanez, C. and Viveros, M. BlueSpace: Personalizing Workspace through Awareness and Adaptability. International Journal of Human-Computer Studies, 57, (2002), 415--428.  ",
      "doi": "10.5555/637454.637456"
    },
    {
      "text": "MacIntyre, B., Mynatt, E.D., Voida, S., Hansen, K.M., Tullio, J. and Corso, G.M. Support for Multitasking and Task Awareness Using Interactive Peripheral Displays. In Proc. UIST 2001, ACM Press, (2001), 41--50.  ",
      "doi": "10.1145/502348.502355"
    },
    {
      "text": "Mackinlay, J.D., Card, S.K. and Robertson, G.G. Rapid Controlled Movement through a Virtual 3D Workspace. ACM Computer Graphics, 24, 4 (1990), 171--176.  ",
      "doi": "10.1145/97880.97898"
    },
    {
      "text": "Malone, T.W. How Do People Organize Their Desks? Implications for the Design of Office Information Systems. ACM Trans. on Office Information Systems, 1, 1, (1983) 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Oviatt, S. Mutual Disambiguation of Recognition Error in a Multimodal Architecture. In Proc. CHI 1999, ACM Press (1999), 576--583.  ",
      "doi": "10.1145/302979.303163"
    },
    {
      "text": "Pingali, G., Pinhanez, C., Levas, A., Kjeldsen, R., Podlaseck, M., Chen, H. and Sukaviriya, N. Steerable Interfaces for Pervasive Computing Spaces. In Proc. First IEEE International Conference on Pervasive Computing and Communications (PerCom'03), IEEE, (2003), 315--322. ",
      "doi": "10.5555/826025.826330"
    },
    {
      "text": "Pinhanez, C. The Everywhere Displays Projector: A Device to Create Ubiquitous Graphics Interfaces. In Proc. 3rd International Conference on Ubiquitous Computing 2001 (UbiComp'01), Springer-Verlag (2001), 315--331. ",
      "doi": "10.5555/647987.741324"
    },
    {
      "text": "Podlaseck, M., Pinhanez, C., Alvorado, N., Chan, M. and Dejesus, E. On Interfaces Projected onto Real-World Objects. In Ext. Abstracts CHI 2003, ACM Press (2003), 802--803.  ",
      "doi": "10.1145/765891.766001"
    },
    {
      "text": "Poupyrev, I., Weghorst, S., Billinghurst, M. and Ichikawa, T. Egocentric Object Manipulation in Virtual Environments: Empirical Evaluation of Interaction Techniques. Computer Graphics Forum, EUROGRAPHICS'98 Issue, 17, 3 (1998), 41--52.",
      "doi": ""
    },
    {
      "text": "Raskar, R., van Baar, J., Beardsley, P., Willwacher, T., Rao, S. and Forlines, C. iLamps: Geometrically Aware and Self-Configuring Projectors. ACM Trans. on Graphics, 22, 3, (2003), 809--818.  ",
      "doi": "10.1145/882262.882349"
    },
    {
      "text": "Raskar, R., Welch, G., Cutts, M., Lake, A. and Stesin, L. The Office of the Future: A Unified Approach to Image-Based Modeling and Spatially Immersive Displays. In Proc. SIGGRAPH 1998, ACM Press (1998), 179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Raskar, R., Welch, G., Low, K. and Bandyopadhyay, D. Shader Lamps: Animating Real Objects with Image-Based Illumination. In Proc. 12th EUROGRAPHICS Workshop on Rendering Techniques, Springer-Verlag, (2001), 89--102. ",
      "doi": "10.5555/647653.732300"
    },
    {
      "text": "Rekimoto, J. and Saitoh, M. Augmented Surfaces: A Spatially Continuous Workspace for Hybrid Computing Environments. In Proc. of CHI 1999, ACM Press (1999), 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Streitz, N.A., Geißler, J., Holmer, T., Konomi, S. Mnller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P. and Steinmetz, R. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proc. CHI 1999, ACM Press, (1999), 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Ware, C. and Balakrishnan, R. Reaching for Objects in VR Displays: Lag and Frame Rate. ACM Trans. on Computer-Human Interaction, 1, 4, (1994), 331--356.  ",
      "doi": "10.1145/198425.198426"
    },
    {
      "text": "Ware, C. and Rose, J. Rotating Virtual Objects with Real Handles. ACM Trans. on Computer-Human Interaction, 6, 2, (1999), 162--180.  ",
      "doi": "10.1145/319091.319102"
    },
    {
      "text": "Wellner, P. Interacting with Paper on the DigitalDesk. Communications of the ACM, 36, 7, (1993), 86--97.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Wilson, A. and Shafer, S. XWand: UI for Intelligent Spaces. In Proc. CHI 2003, ACM Press (2003), 545--552.  ",
      "doi": "10.1145/642611.642706"
    },
    {
      "text": "Wingrave, C.A., Bowman, D.A. and Ramakrishnan, N. Towards Preferences in Virtual Environment Interfaces. In Proceedings of the EUROGRAPHICS Workshop on Virtual Environments, (2002), 63--72. ",
      "doi": "10.5555/509709.509720"
    }
  ]
}