{
  "doi": "10.1145/1054972.1054995",
  "title": "EyeDraw: enabling children with severe motor impairments to draw with their eyes",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "161-170",
  "year": 2005,
  "badges": [],
  "abstract": "EyeDraw is a software program that, when run on a computer with an eye tracking device, enables children with severe motor disabilities to draw pictures by just moving their eyes. This paper discusses the motivation for building the software, how the program works, the iterative development of two versions of the software, user testing of the two versions by people with and without disabilities, and modifications to the software based on user testing. Feedback from both children and adults with disabilities, and from their caregivers, was especially helpful in the design process. The project identifies challenges that are unique to controlling a computer with the eyes, and unique to writing software for children with severe motor impairments.",
  "authors": [
    {
      "name": "Anthony J. Hornof",
      "institution": "University of Oregon, Eugene, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100426680",
      "orcid": "missing"
    },
    {
      "name": "Anna Cavender",
      "institution": "University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100369055",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolt, R. A. (1982). Eyes at the interface. Proceedings of Human Factors in Computing Systems, New York: ACM, 360--362.  ",
      "doi": "10.1145/800049.801811"
    },
    {
      "text": "Escobedo, T. H., & Bhargava, A. (1991). A study of children's computer-generated graphics. Journal of Computing in Childhood Education, 2(4), 3--25. ",
      "doi": "10.5555/116961.116962"
    },
    {
      "text": "Gips, J., & Olivieri, P. (1996). EagleEyes: An Eye Control System for Persons with Disabilities. The Eleventh International Conference on Technology and Persons with Disabilities.",
      "doi": ""
    },
    {
      "text": "Hornof, A. J., Cavender, A., & Hoselton, R. (2004). EyeDraw: A system for drawing pictures with eye movements. Proceedings of ASSETS 2004: The Sixth International ACM SIGACCESS Conference on Computers and Accessibility, New York: ACM, 86--93.  ",
      "doi": "10.1145/1028630.1028647"
    },
    {
      "text": "Jacob, R. J. K. (1990). What you look at is what you get: Eye movement-based interaction techniques. Proceedings of ACM CHI '90: Conference on Human Factors in Computing Systems, ACM: New York, 11--18.  ",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Jacob, R. J. K., & Karn, K. S. (2003). Eye tracking in human-computer interaction and usability research: Ready to deliver the promises (Section commentary). In J. Hyona, R. Radach, & H. Deubel (Eds.), The Mind's Eyes: Cognitive and Applied Aspects of Eye Movements. Oxford: Elsevier Science.",
      "doi": "10.5555/772072.772084"
    },
    {
      "text": "Kellogg, R. (1970). Analyzing Children's Art. Palo Alto, Calif., Mayfield Pub. Co.",
      "doi": ""
    },
    {
      "text": "Majaranta, P., & Rääihä, K.-J. (2002). Twenty years of eye typing: systems and design issue. Proceedings of the Symposium on Eye Tracking Research and Applications: ETRA 2002, New York: ACM Press, 15--22.  ",
      "doi": "10.1145/507072.507076"
    },
    {
      "text": "Tchalenko, J. (2001). Free-eye drawing. Point: Art and Design Research Journal, 11, 36--41.",
      "doi": ""
    },
    {
      "text": "Vertegaal, R. (2003). \"Attentive User Interfaces\" Editorial, Special Issue on Attentive User Interfaces. Communications of the ACM, 46(3).  ",
      "doi": "10.1145/636772.636794"
    },
    {
      "text": "Ware, C., & Mikaelian, H. (1987). An evaluation of an eye tracker as a device for computer input. Proceedings of ACM CHI+GI, New York: ACM, 183--188.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Zhai, S., Morimoto, C., & Ihde, S. (1999). Manual and gaze input cascaded (MAGIC) pointing. Proceedings of ACM CHI '99: Conference on Human Factors in Computing Systems, New York: ACM, 246--25.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}