{
  "doi": "10.1145/1054972.1054986",
  "title": "Privacy and proportionality: adapting legal evaluation techniques to inform design in ubiquitous computing",
  "published": "2005-04-02",
  "proctitle": "CHI '05: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "91-100",
  "year": 2005,
  "badges": [],
  "abstract": "We argue that an analytic proportionality assessment balancing usefulness and burden on individual or group privacy must be conducted throughout the design process to create acceptable ubiquitous computing (ubicomp) applications and services. We introduce the principle of proportionality, which originates within the legal and data protection communities. Inspired by this principle, we develop a design method for ubicomp applications, based on our own experience, and aimed at HCI practitioners and designers. We discuss the method in relation to real-world examples, user inquiry techniques and requirements engineering models. Finally, we report a sample application of the method, involving a ubiquitous, personal memory aid tool.",
  "authors": [
    {
      "name": "Giovanni Iachello",
      "institution": "Georgia Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100415680",
      "orcid": "missing"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "Georgia Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S., Cranor, L.F., Reagle, J. Privacy in E-Commerce: Examining User Scenarios and Privacy Preferences. Proc. E-Commerce '99, ACM Press (1999) 1--8.]]  ",
      "doi": "10.1145/336992.336995"
    },
    {
      "text": "Barkhuus, L., Dey, A. Location-Based Services for Mobile Telephony: a study of users' privacy concerns. Proc. Interact 2003, IOS Press, (2003) 709--712.]]",
      "doi": ""
    },
    {
      "text": "Belair, R., Bock, C. Police Use of Remote Camera Systems for Surveillance of Public Streets. Surveillance, Dataveillance and Personal Freedoms: Use and Abuse of Information Technology, Columbia Human Rights Law Review, Burdick, Fair Lawn, NJ, USA (1973). ISBN 0-913638-03-X.]]",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Sellen, A. Design for Privacy in Ubiquitous Computing Environments. Proc. ECSCW '93, Kluwer A.P., Dordrecht, The Netherlands (1993).]] ",
      "doi": "10.5555/1241934.1241940"
    },
    {
      "text": "Berleur, J., Brunnstein, K., Eds., Ethics of Computing: Codes, spaces for discussion and law. Chapman & Hall, London, England (1996). ISBN 0-412-72620-3.]] ",
      "doi": "10.5555/273748"
    },
    {
      "text": "Boehm B.W., Bose, P., Horowitz, E., Lee, M.J. Software Requirements As Negotiated Win Conditions, in Proc. First International Conference on Requirements Engineering, IEEE Press (1994), 74--83.]]",
      "doi": ""
    },
    {
      "text": "Boyle, M., Edwards, C., Greenberg, S. The effects of filtered video on awareness and privacy. Proc. ACM CSCW 2000, ACM Press (2000), 1--10.]]  ",
      "doi": "10.1145/358916.358935"
    },
    {
      "text": "British Institute of International and Comparative Law, The implementation of Directive 95/46/EC to the Processing of Sound and Image Data (2003). http://europa.eu.int/comm/internal_market/privacy.]]",
      "doi": ""
    },
    {
      "text": "Chung, E., Hong J., Lin, J., Prabaker, M., Landay, J., Liu, A. Development and Evaluation of Emerging Design Patterns for Ubiquitous Computing. Proc. ACM DIS 2004, ACM Press (2004), 233--242.]]  ",
      "doi": "10.1145/1013115.1013148"
    },
    {
      "text": "Electronic Privacy Information Center, Privacy Guidelines for the National Information Infrastructure - A Review of the Proposed Principles of the Privacy Working Group, Report 94-1 (1994). http://www.epic.org]]",
      "doi": ""
    },
    {
      "text": "European Commission Article 29 Working Party. Opinion 4/2004 on the Processing of Personal Data by means of Video Surveillance. 11750/02/EN WP89 (2004). http://europa.eu.int.]]",
      "doi": ""
    },
    {
      "text": "European Commission Article 29 Working Party. Working Document on Biometrics. 12168/02/EN WP80 (2003). http://europa.eu.int.]]",
      "doi": ""
    },
    {
      "text": "Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data. European Union Official Journal L281 (1995), 31--50.]]",
      "doi": ""
    },
    {
      "text": "Garfinkel, S. Adopting Fair Information Practices to Low Cost RFID Systems. Presented at Ubicomp 2002 Privacy Workshop (2002).]]",
      "doi": ""
    },
    {
      "text": "Geason S., Wilson, P. Preventing graffiti and vandalism. Australian Institute of Criminology, Canberra, Australia (1990). ISBN 0-642-14936-4.]]",
      "doi": ""
    },
    {
      "text": "Hall, E. The Hidden Dimension: Man's use of Space in Public and Private. Doubleday, New York, NY (1966).]]",
      "doi": ""
    },
    {
      "text": "Hayes G., Patel, S.N., Truong, K.N., Iachello, G., Kientz, J.A., Farmer, R., Abowd, G.D. The Personal Audio Loop: Designing a Ubiquitous Audio-Based Memory Aid, Proc. Mobile HCI 2004.]]",
      "doi": ""
    },
    {
      "text": "Hong, J., Ng, J.D., Lederer, S., Landay, J.A. Privacy Risk Models for Designing Privacy-Sensitive Ubiquitous Computing Systems. Proc. DIS 2004, ACM Press, (2004) 91--100.]]  ",
      "doi": "10.1145/1013115.1013129"
    },
    {
      "text": "Hudson, S., Smith, I. Techniques for Addressing Fundamental Privacy and Disruption Tradeoffs in Awareness Support Systems. Proc. CSCW '96, ACM Press (1996), 248--257.]]  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Jacobs, A., Abowd, G.D. A framework for comparing perspectives on privacy and pervasive technologies. IEEE Pervasive Computing, 2, 4 (2003), 78--84.]]  ",
      "doi": "10.1109/MPRV.2003.1251171"
    },
    {
      "text": "Jiang, X., Hong, J.I., Landay, J.A. Approximate Information Flows: Socially-Based Modeling of Privacy in Ubiquitous Computing. Proc. Ubicomp 2002, LNCS 2498, Springer Verlag (2002), 176--193.]] ",
      "doi": "10.5555/647988.741485"
    },
    {
      "text": "Katz v. United States. 389 U.S. 347; 88 S.Ct. 507 (1967).]]",
      "doi": ""
    },
    {
      "text": "Langheinrich, M. Privacy by Design - Principles of Privacy-Aware Ubiquitous Systems. Proc. Ubicomp 2001, LNCS 2201, Springer Verlag (2001), 273--291.]] ",
      "doi": "10.5555/647987.741336"
    },
    {
      "text": "Latour, B. We Have Never Been Modern, Harvard University Press (1993).]]",
      "doi": ""
    },
    {
      "text": "Lessig, L. The Architecture of Privacy. Vanderbilt Journal of Entertainment Law & Practice, 1, Spring 1999; 1 Vand. J. Ent. L. & Prac. 56.]]",
      "doi": ""
    },
    {
      "text": "Melenhorst, A.S., Fisk, A.D., Mynatt, E.D., Rogers, W.A. Potential intrusiveness of aware home technology: Perceptions of older adults. Proc. Human Factors and Ergonomics Society 48th Annual Meeting, HFES Press (2004), 266--270.]]",
      "doi": ""
    },
    {
      "text": "Müller, G., Rannenberg, K., eds. Multilateral Security in Communications - Technology, Infrastructure, Economy. Addison-Wesley-Longmann, München, (1999). ISBN 3-8273-1360-0.]]",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., Greenberg, S. The Design of a Context-Aware Home Media Space for Balancing Privacy and Awareness. Proc. Ubicomp 2003, LNCS 2864, Springer Verlag (2003), 297--314.]]",
      "doi": ""
    },
    {
      "text": "Norris, C., Armstrong, G. The maximum surveillance society: The rise of CCTV. Berg, Oxford, England (1999). ISBN 1-85973-226-7.]]",
      "doi": ""
    },
    {
      "text": "Organization for Economic Cooperation and Development. Guidelines on the Protection of Privacy and Transborder Flows of Personal Data (1980).]]",
      "doi": ""
    },
    {
      "text": "Palen, L., Dourish, P. Unpacking \"Privacy\" for a Networked World. Proc. CHI 2003, ACM Press (2003), 129--136.]]  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Rannenberg, K. Multilateral Security: A Concept and Examples for Balanced Security. Proc. 2000 New Security Paradigms Workshop, ACM Press (2001), 151--162.]]  ",
      "doi": "10.1145/366173.366208"
    },
    {
      "text": "Terrell, T., Jacobs A. Privacy, technology, and terrorism: Bartnicki, Kyllo, and the normative struggle behind competing claims to solitude and security. Emory Law Journal, 51, 4, Fall 2002, 1469--1511; 51 Emory L.J. 1469.]]",
      "doi": ""
    },
    {
      "text": "United Kingdom Information Commissioner, Data Protection Act 1998 Legal Guidance, http://www.dataprotection.gov.uk]]",
      "doi": ""
    },
    {
      "text": "United States Department of Health, Education and Welfare. Records, Computers and the Rights of Citizens, Report of the Secretary's Advisory Committee on Automated Personal Data Systems (1973).]]",
      "doi": ""
    },
    {
      "text": "United States Department of Health and Human Services. Standards for Privacy of Individually Identifiable Health Information; Final Rule, 45 CFR Parts 160 and 164 (2002).]]",
      "doi": ""
    },
    {
      "text": "Venkatesh, V., Morris, M.G., Davis, G.B., Davis, F.D. User Acceptance of Information Technology: Toward a Unified View. MIS Quarterly, 27, 3 (2003), 425--478.]] ",
      "doi": "10.5555/2017197.2017202"
    }
  ]
}