{
  "doi": "10.1145/2556288.2556992",
  "title": "What's on your mind?: investigating recommendations for inclusive social networking and older adults",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3923-3932",
  "year": 2014,
  "badges": [],
  "abstract": "Social networking sites (SNSs) are becoming increasingly popular as a method for social interaction. While research has reported benefits associated with components of SNS usage, a digital divide has emerged between younger and older users. SNSs can be useful for communicating with family members and helping one feel digitally included; however, there are a wide range of reasons why many older adults choose not to use this kind of technology. We present a series of user studies investigating the barriers and challenges that SNSs can present to older users. These user studies led to the derivation of user recommendations to mitigate these barriers. The recommendations were then evaluated within a comparative evaluation which involved 25 older adults completing tasks on two interface versions of a simulation SNS. We present the recommendations and the methods of their creation and evaluation. Implications for developers of SNSs are discussed.",
  "tags": [
    "older adults",
    "inclusive design",
    "social networking sites",
    "recommendations",
    "comparative evaluation"
  ],
  "authors": [
    {
      "name": "Chris Norval",
      "institution": "University of Dundee, Dundee, Scotland, United Kingdom",
      "img": "/do/10.1145/contrib-81496690794/rel-imgonly/cnorval.jpg",
      "acmid": "81496690794",
      "orcid": "missing"
    },
    {
      "name": "John L. Arnott",
      "institution": "University of Dundee, Dundee, Scotland, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100117616",
      "orcid": "missing"
    },
    {
      "name": "Vicki L. Hanson",
      "institution": "Rochester Institute of Technology & University of Dundee (UK), Rochester, NY, USA",
      "img": "/do/10.1145/contrib-81100646151/rel-imgonly/vicki-1-square.jpg",
      "acmid": "81100646151",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blit-Cohen, E., and Litwin, H. Elder participation in cyberspace: A qualitative analysis of Israeli retirees. J. of Aging Studies 18, 4 (2004), 385--398.",
      "doi": ""
    },
    {
      "text": "Braun, V., and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Brenner, J., and Smith, A. 72% of online adults are social networking site users. Tech. rep., Pew Internet & American Life Project, 2013.",
      "doi": ""
    },
    {
      "text": "Brooke, J. SUS: A quick and dirty usability scale. In Usability evaluation in industry. Taylor and Francis, London, 1996.",
      "doi": ""
    },
    {
      "text": "Burke, M., Marlow, C., and Lento, T. Social network activity and social well-being. In Proc. CHI 2010, ACM Press (2010), 1909--1912.  ",
      "doi": "10.1145/1753326.1753613"
    },
    {
      "text": "Chen, Y. Usability analysis on online social networks for the elderly. Tech. rep., Helsinki University of Technology, 2009.",
      "doi": ""
    },
    {
      "text": "Chou, W. H., Lai, Y.-T., and Liu, K.-H. User requirements of social media for the elderly: A case study in Taiwan. Beh. & Inf. Tech. 32, 9 (Sept. 2013), 920--937.  ",
      "doi": "10.1080/0144929X.2012.681068"
    },
    {
      "text": "Cornejo, R., Favela, J., and Tentori, M. Ambient displays for integrating older adults into social networking sites. In Collaboration and Technology, vol. 6257 of LNCS. Springer, 2010, 321--336. ",
      "doi": "10.5555/1887532.1887563"
    },
    {
      "text": "Gibson, L., Moncur, W., Forbes, P., Arnott, J., Martin, C., and Bhachu, A. S. Designing social networking sites for older adults. In Proc. HCI 2010, BCS (2010), 186--194. ",
      "doi": "10.5555/2146303.2146331"
    },
    {
      "text": "Hoofnagle, C., King, J., Li, S., and Turow, J. How different are young adults from older adults when it comes to information privacy attitudes and policies' UC Berkeley Center for Law and Technology (2010).",
      "doi": ""
    },
    {
      "text": "Karahasanović, A., Brandtzæg, P. B., Heim, J., Lüders, M., Vermeir, L., Pierson, J., Lievens, B., Vanattenhoven, J., and Jans, G. Co-creation and user-generated content-elderly peoples user requirements. Computers in Human Behavior 25, 3 (2009), 655--678.  ",
      "doi": "10.1016/j.chb.2008.08.012"
    },
    {
      "text": "Kurniawan, S., and Zaphiris, P. Research-derived web design guidelines for older people. In Proc. ASSETS 2005, ACM Press (2005), 129--135.  ",
      "doi": "10.1145/1090785.1090810"
    },
    {
      "text": "Lehtinen, V., Näsänen, J., and Sarvas, R. A little silly and empty-headed: older adults' understandings of social networking sites. In Proc. HCI 2009, BCS (2009), 45--54. ",
      "doi": "10.5555/1671011.1671017"
    },
    {
      "text": "Lewis, S., and Ariyachandra, T. Seniors and online social network use. In Proc. CONISAR 2010 (2010).",
      "doi": ""
    },
    {
      "text": "Lipford, H. R., Besmer, A., and Watson, J. Understanding privacy settings in Facebook with an audience view. In Proc. UPSEC 2008 (2008), 2:1'2:8. ",
      "doi": "10.5555/1387649.1387651"
    },
    {
      "text": "Mikkola, K., and Halonen, R. 'Nonsense' ICT perceived by the elderly. In the European, Mediterranean & Middle Eastern Conference on Information Systems (2011), 306--317.",
      "doi": ""
    },
    {
      "text": "Nyemba, E. S. F., Mukwasi, C. M., Mhakure, S., Mosiane, S., and Chigona, W. Golden baby boomers' perceptions of online social networking sites. Int. J. Comp. Tech. App 2, 3 (2011), 695--703.",
      "doi": ""
    },
    {
      "text": "Ofcom. Adults' media use and attitudes report 2013. Tech. rep., Ofcom, 2013.",
      "doi": ""
    },
    {
      "text": "Pullin, G., and Newell, A. Focussing on extra-ordinary users. In Universal Access in HCI. Coping with Diversity. Springer, 2007, 253--262. ",
      "doi": "10.5555/1766311.1766341"
    },
    {
      "text": "Sundar, S. S., Oeldorf-Hirsch, A., Nussbaum, J., and Behr, R. Retirees on Facebook: can online social networking enhance their health and wellness' In Proc. CHI EA 2011, ACM Press (2011), 2287--2292.  ",
      "doi": "10.1145/1979742.1979931"
    },
    {
      "text": "Valenzuela, S., Park, N., and Kee, K. F. Is there social capital in a social network site': Facebook use and college students' life satisfaction, trust, and participation. JCMC 14, 4 (2009), 875--901.",
      "doi": ""
    },
    {
      "text": "Watson, P., Hanson, V., Olivier, P., Tanaka, A., Li, F., Arnott, J., Gregor, P., and van Moorsel, A. Social inclusion through the digital economy. In Digital Futures 2010 (2010).",
      "doi": ""
    },
    {
      "text": "Wherton, J., and Prendergast, D. The building bridges project: Involving older adults in the design of a communication technology to support peer-to-peer social engagement. In HCI and Usability for e-Inclusion, vol. 5889 of LNCS. Springer, 2009, 111--134.  ",
      "doi": "10.1007/978-3-642-10308-7_8"
    },
    {
      "text": "Xie, B., Watkins, I., Golbeck, J., and Huang, M. Understanding and changing older adults' perceptions and learning of social media. Educational Gerontology 38, 4 (2012), 282--296.",
      "doi": ""
    }
  ]
}