{
  "doi": "10.1145/2556288.2557420",
  "title": "Practical trigger-action programming in the smart home",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "803-812",
  "year": 2014,
  "badges": [],
  "abstract": "We investigate the practicality of letting average users customize smart-home devices using trigger-action (\"if, then\") programming. We find trigger-action programming can express most desired behaviors submitted by participants in an online study. We identify a class of triggers requiring machine learning that has received little attention. We evaluate the uniqueness of the 67,169 trigger-action programs shared on IFTTT.com, finding that real users have written a large number of unique trigger-action interactions. Finally, we conduct a 226-participant usability test of trigger-action programming, finding that inexperienced users can quickly learn to create programs containing multiple triggers or actions.",
  "authors": [
    {
      "name": "Blase Ur",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    },
    {
      "name": "Elyse McManus",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490651588",
      "orcid": "missing"
    },
    {
      "name": "Melwyn Pak Yong Ho",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959118457",
      "orcid": "missing"
    },
    {
      "name": "Michael L. Littman",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406601119",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brush, A. B., Lee, B., Mahajan, R., Agarwal, S., Saroiu, S., and Dixon, C. Home automation in the wild: Challenges and opportunities. In Proc. CHI (2011).  ",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Dahl, Y., and Svendsen, R.-M. End-user composition interfaces for smart environments: A preliminary study of usability factors. In Design, User Experience, and Usability. Theory, Methods, Tools and Practice. 2011, 118--127.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., Lee, M. K., Yiu, C., Zimmerman, J., and Dey, A. K. Principles of smart home control. In Proc. Ubicomp (2006).  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Davidoff, S., Lee, M. K., Zimmerman, J., and Dey, A. Socially-aware requirements for a smart home. In Proc. ISIE (2006).",
      "doi": ""
    },
    {
      "text": "Dey, A. K., Sohn, T., Streng, S., and Kodama, J. iCAP: Interactive prototyping of context-aware applications. In Proc. Pervasive (2006).  ",
      "doi": "10.1007/11748625_16"
    },
    {
      "text": "Dixon, C., Mahajan, R., Agarwal, S., Brush, A., Lee, B., Saroiu, S., and Bahl, P. An operating system for the home. In Proc. NSDI (2012). ",
      "doi": "10.5555/2228298.2228332"
    },
    {
      "text": "Gale, W. A., and Sampson, G. Good-turing frequency estimation without tears. Journal of Quantitative Linguistics 2 (1995), 217--237.",
      "doi": ""
    },
    {
      "text": "García-Herranz, M., Haya, P., and Alamn, X. Towards a ubiquitous end-user programming system for smart spaces. Journal of Universal Computer Science 16, 12 (2010), 1633--1649.",
      "doi": ""
    },
    {
      "text": "Koskela, T., and Väänänen-Vainio-Mattila, K. Evolution towards smart home environments: Empirical evaluation of three user interfaces. Personal Ubiquitous Comput. 8, 3-4 (July 2004), 234--240.  ",
      "doi": "10.1007/s00779-004-0283-x"
    },
    {
      "text": "Litvinova, E., and Vuorimaa, P. Engaging end users in real smart space programming. In Proc. Ubicomp (2012).  ",
      "doi": "10.1145/2370216.2370447"
    },
    {
      "text": "Mennicken, S., and Huang, E. M. Hacking the natural habitat: An in-the-wild study of smart homes, their development, and the people who live in them. In Proc. Pervasive (2012).  ",
      "doi": "10.1007/978-3-642-31205-2_10"
    },
    {
      "text": "Newman, M. W. Now we're cooking: Recipes for end-user service composition in the digital home. Position Paper - CHI 2006 Workshop IT@Home, 2006.",
      "doi": ""
    },
    {
      "text": "Newman, M. W., Elliott, A., and Smith, T. F. Providing an integrated user experience of networked media, devices, and services through end-user composition. In Proc. Pervasive (2008).  ",
      "doi": "10.1007/978-3-540-79576-6_13"
    },
    {
      "text": "Pane, J. F., Ratanamahatana, C. A., and Myers, B. A. Studying the language and structure in non-programmers' solutions to programming problems. Int. J. Human-Computer Studies 54, 2 (2001), 237--264.  ",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "Philips. Hue. https://www.meethue.com, 2013.",
      "doi": ""
    },
    {
      "text": "Rashidi, P., and Cook, D. J. Keeping the resident in the loop: Adapting the smart home to the user. IEEE Transactions on Systems, Man, and Cybernetics - Part A 39, 5 (2009), 949--959.  ",
      "doi": "10.1109/TSMCA.2009.2025137"
    },
    {
      "text": "Supermechanical. Twine. http://supermechanical.com/twine/, 2013.",
      "doi": ""
    },
    {
      "text": "Truong, K. N., Huang, E. M., and Abowd, G. D. CAMP: A magnetic poetry interface for end-user programming of capture applications for the home. In Proc. Ubicomp (2004).",
      "doi": ""
    },
    {
      "text": "Wigwag. Wigwag. http://www.wigwag.com/, 2013.",
      "doi": ""
    }
  ]
}