{
  "doi": "10.1145/2556288.2557074",
  "title": "Spending real money: purchasing patterns of virtual goods in an online social game",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3359-3368",
  "year": 2014,
  "badges": [],
  "abstract": "Researchers have found that 'social' factors contribute to purchasing intentions of virtual goods in an online social game, but little is known about actual purchasing behavior. Study 1 examined the relationship between social factors and virtual goods purchasing patterns using large scale data obtained by server logs of an online social game. Exchange of virtual goods and number of friends increased the likelihood of spending real money compared to no spending. Among those who did spend real money, giving virtual goods to others was the strongest factor associated with the amount of spending. Study 2 examined purchasing patterns of players who spent real money: high real-money spenders were buying items for visual customization while low spenders were buying consumable items necessary to sustain playing the game.",
  "tags": [
    "customization",
    "virtual goods",
    "consumer behavior",
    "big data",
    "social exchange",
    "e-commerce",
    "social game"
  ],
  "authors": [
    {
      "name": "Donghee Yvette Wohn",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81481649423/rel-imgonly/yvettesmall.jpg",
      "acmid": "81481649423",
      "orcid": "0000-0001-5583-4430"
    }
  ],
  "references": [
    {
      "text": "Animesh, A., Pinsonneault, A., Yang, S.-B., and Oh, W. An odyssey into virtual worlds: exploring the impacts of technological and spatial environments on intention to purchase virtual products. MIS Quarterly 35, 3 (2011), 789--810. ",
      "doi": "10.5555/2208923.2208939"
    },
    {
      "text": "Campbell, C. Free-to-play's the future but not as we know it, says former Zynga and EA COO. Polygon, 2013. http://www.polygon.com/2013/9/11/4717122/free-toplays-the-future-but-not-as-we-know-it.",
      "doi": ""
    },
    {
      "text": "Castronova, E., Williams, D., Shen, C., et al. As real as real? Macroeconomic behavior in a large-scale virtual world. New Media & Society 11, (2009), 685--707.",
      "doi": ""
    },
    {
      "text": "Castronova, E. Synthetic worlds: The business and culture of online games. University of Chicago Press, Chicago, IL, 2005. ",
      "doi": "10.5555/1076839"
    },
    {
      "text": "Chung, D. Something for nothing: understanding purchasing behaviors in social virtual environments. Cyberpsychology & behavior 8, 6 (2005), 538--54.",
      "doi": ""
    },
    {
      "text": "Companies and Markets. Global virtual goods market 2012--2016. 2012.",
      "doi": ""
    },
    {
      "text": "Dibbell, J. The Life of the Chinese Gold Farmer. The New York Times, 2007.",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N., Wen, M., Yee, N., and Wadley, G. Body and mind: A study of avatar personalization in three virtual worlds. In Proc. CHI 2009, (2009), 1151-- 60.  ",
      "doi": "10.1145/1518701.1518877"
    },
    {
      "text": "Greengard, S. Social games, virtual goods. Commmunications of the ACM 54 (April), (2011), 19--21.  ",
      "doi": "10.1145/1924421.1924429"
    },
    {
      "text": "Guo, Y. and Barnes, S. Why people buy virtual items in virtual worlds with real money. The Database for Advances in Information Systems 38, (2007), 69--74.  ",
      "doi": "10.1145/1314234.1314247"
    },
    {
      "text": "Guo, Y. and Barnes, S. Purchase behavior in virtual worlds: An empirical investigation in Second Life. Information & Management 48, 7 (2011), 303--312.  ",
      "doi": "10.1016/j.im.2011.07.004"
    },
    {
      "text": "Hamari, J. and Lehdonvirta, V. Game design as marketing: How game mechanics create demand for virtual goods. International Journal of Business Science and Applied Management 5, (2010), 14--29.",
      "doi": ""
    },
    {
      "text": "Heeter, C. Being there: The subjective experience of presence. Presence 1, (1992), 262--271. ",
      "doi": "10.5555/196564.196589"
    },
    {
      "text": "Jin, S.-A.A. Modality effects in Second Life: The mediating role of social presence and the moderating role of product involvement. CyberPsychology & Behavior 12, (2009), 717--721.",
      "doi": ""
    },
    {
      "text": "Kim, H.-W., Chan, H.C., and Kankanhalli, A. What Motivates People to Purchase Digital Items on Virtual Community Websites? The Desire for Online SelfPresentation. Information Systems Research 23, 4 (2012), 1232--1245.  ",
      "doi": "10.1287/isre.1110.0411"
    },
    {
      "text": "Lee, Y.-H. and Wohn, D.Y. Are there cultural differences in how we play? Examining cultural effects on playing social network games. Computers in Human Behavior 28, 4 (2012), 1307--1314.  ",
      "doi": "10.1016/j.chb.2012.02.014"
    },
    {
      "text": "Lehdonvirta, V. Virtual item sales as a revenue model: Identifying attributes that drive purchase decisions. Electronic Commerce Research 9, (2009), 97--113.  ",
      "doi": "10.1007/s10660-009-9028-2"
    },
    {
      "text": "Mantymaki, M. and Salo, J. Teenagers in social virtual worlds: Continuous use and purchasing behavior in Habbo Hotel. Computers in Human Behavior 27, (2011), 2088--97.  ",
      "doi": "10.1016/j.chb.2011.06.003"
    },
    {
      "text": "Mäntymäki, M. and Salo, J. Teenagers in social virtual worlds: Continuous use and purchasing behavior in Habbo Hotel. Computers in Human Behavior 27, 6 (2011), 2088--2097.  ",
      "doi": "10.1016/j.chb.2011.06.003"
    },
    {
      "text": "Nojima, M. Pricing models and motivations for MMO play. In Proc. DiGRA 2007, (2007), 672--81.",
      "doi": ""
    },
    {
      "text": "Oh, G. and Ryu, T. Game design on item-selling based payment model in Korean online games. In Proc. DiGRA 2007, (2007), 651--657.",
      "doi": ""
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. The social psychology of telecommunications. John Wiley & Sons, London, UK, 1976.",
      "doi": ""
    },
    {
      "text": "Takahashi, D. Free-to-play, virtual goods business models gain steam in games. VentureBeat, 2009.",
      "doi": ""
    },
    {
      "text": "Wohn, D.Y. and Lee, Y.-H. Players of Facebook Games and How They Play. Entertainment Computing 4, 3 (2013), 178--171.",
      "doi": ""
    },
    {
      "text": "Wohn, D.Y. The role of habit in social network game play. Communication Research Reports 29, 1 (2012), 74--79.",
      "doi": ""
    }
  ]
}