{
  "doi": "10.1145/2556288.2557351",
  "title": "Understanding multitasking through parallelized strategy exploration and individualized cognitive modeling",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3885-3894",
  "year": 2014,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Human multitasking often involves complex task interactions and subtle tradeoffs which might be best understood through detailed computational cognitive modeling, yet traditional cognitive modeling approaches may not explore a sufficient range of task strategies to reveal the true complexity of multitasking behavior. This study proposes a systematic approach for exploring a large number of strategies using a computer-cluster-based parallelized modeling system. The paper demonstrates the efficacy of the approach for investigating and revealing the effects of different microstrategies on human performance, both within and across individuals, for a time-pressured multimodal dual task. The modeling results suggest that multitasking performance is not simply a matter of interleaving cognitive and sensorimotor processing but is instead heavily influenced by the selection of subtask microstrategies.",
  "tags": [
    "task strategies.",
    "high performance computing",
    "cognitive modeling",
    "multimodal",
    "multitasking",
    "model comparison"
  ],
  "authors": [
    {
      "name": "Yunfeng Zhang",
      "institution": "University of Oregon, Eugene, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658899757",
      "orcid": "missing"
    },
    {
      "name": "Anthony J. Hornof",
      "institution": "University of Oregon, Eugene, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100426680",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ballas, J., Heitmeyer, C., and Perez-Quinones, M. (1992). Evaluating two aspects of direct manipulation in advanced cockpits. In Proceedings of CHI, 127--134.  ",
      "doi": "10.1145/142750.142770"
    },
    {
      "text": "Brumby, D. P., Salvucci, D. D., and Howes, A. (2009). Focus on driving: How cognitive constraints shape the adaptation of strategy when dialing while driving. In Proceedings of CHI, 1629--1638.  ",
      "doi": "10.1145/1518701.1518950"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. (1983). The psychology of human-computer interaction. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Gluck, K. A., Stanley, C. T., Moore, L. R., Reitter, D., and Halbrügge, M. (2010). Exploration for understanding in cognitive modeling. Journal of Arti'cial General Intelligence, 2(2), 88--107.",
      "doi": ""
    },
    {
      "text": "Gray, W. D. and Boehm-Davis, D. A. (2000). Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. J. Exp. Psychol.: Applied, 6(4), 322--335.",
      "doi": ""
    },
    {
      "text": "Halverson, T. and Hornof, A. J. (2011). A computational model of \"active vision\" for visual search in human-computer interaction. HumanComputer Interaction, 26, 285--314.  ",
      "doi": "10.5555/2499325.2499326"
    },
    {
      "text": "Hornof, A. J. and Zhang, Y. (2010). Task-constrained interleaving of perceptual and motor processes in a time-critical dual task as revealed through eye tracking. In Proceedings of the 10th International Conference on Cognitive Modeling, 97--102.",
      "doi": ""
    },
    {
      "text": "Hornof, Zhang, and Halverson (2010). Knowing where and when to look in a time-critical multimodal dual task. In Proceedings of CHI, 2103--2112.  ",
      "doi": "10.1145/1753326.1753647"
    },
    {
      "text": "Howes, A., Lewis, R. L., and Vera, A. (2009). Rational adaptation under task and processing constraints: Implications for testing theories of cognition and action. Psychological Review, 116(4), 717--751.",
      "doi": ""
    },
    {
      "text": "Janssen, C., Brumby, D., Dowell, J., Chater, N., and Howes, A. (2011). Identifying optimum performance trade-offs using a cognitively bounded rational analysis model of discretionary task interleaving. Topics in Cognitive Science, 3(1), 123--139.",
      "doi": ""
    },
    {
      "text": "Kieras, D. E. and Meyer, D. E. (1997). An overview of the EPIC architecture for cognition and performance with application to human-computer interaction. Human-Computer Interaction, 12(4), 391--438.  ",
      "doi": "10.1207/s15327051hci1204_4"
    },
    {
      "text": "Kieras, D. E. and Meyer, D. E. (2000). The role of cognitive task analysis in the application of predictive models of human performance. In J. M. Schraagen, S. F. Chipman, V. L. Shalin, & V. Shalin (Eds.), Cognitive task analysis (pp. 237--260). Mahwah, NJ: Erlbsum.",
      "doi": ""
    },
    {
      "text": "Olson, R. L., Hanowski, R. J., Hickman, J. S., and Bocanegra, J. (2009). Driver distraction in commercial vehicle operations. Technical report #FMCSARRR-09-045. U.S. Dept. of Transportation.",
      "doi": ""
    },
    {
      "text": "Roberts, S. and Pashler, H. (2000). How persuasive is a good 't' A comment on theory testing. Psychological Review, 107(2), 358--367.",
      "doi": ""
    },
    {
      "text": "Richtel, M. (2009, December 6). Promoting the car phone, despite risks. New York Times. Retrieved from http://www.nytimes.com.",
      "doi": ""
    },
    {
      "text": "Salvucci, D. and Taatgen, N. (2008). Threaded cognition: An integrated theory of concurrent multitasking. Psychological Review, 115(1), 101--130.",
      "doi": ""
    },
    {
      "text": "Sanford, E. C. (1888). Personal equation. The American Journal of Psychology, 2(1), pp. 3--38.",
      "doi": ""
    },
    {
      "text": "Wickens, C. D. (2002). Multiple resources and performance prediction. Theoretical Issues in Ergonomics Science, 3(2), 159--177.",
      "doi": ""
    },
    {
      "text": "Williams, A. F. and Lund A. K. (1986). Seat belt use laws and occupant crash protection in the USA. Am. J. Public Health, 76(12), 1438--1442.",
      "doi": ""
    },
    {
      "text": "Zhang, Y. and Hornof, A. (2012). A discrete movement model for cursor tracking derived from moment-tomoment tracking data and the modeling of a dual-task experiment. In Proceedings of the 56th Human Factors and Ergonomics Society Annual Meeting, 1000--1024.",
      "doi": ""
    }
  ]
}