{
  "doi": "10.1145/2556288.2557369",
  "title": "Watching the footwork: second screen interaction at a dance and music performance",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1305-1314",
  "year": 2014,
  "badges": [],
  "abstract": "Interactive mobile technologies have become part of audience experiences of live performances in terms of both general media sharing and specific (sometimes official) extra content. At the same time, high bandwidth affords streaming of live events to mobile devices. We take advantage of these technologies in our high resolution, panoramic image video stream and study a scenario of audience members viewing the very same live event they are watching on a tablet. The video stream on the tablet is navigational and enables audience members to pan and zoom in the real-time video feed. We studied audience interaction and impressions in three performances of a dance and music show and found distinct uses of the second screen video stream. We emphasize that despite initial reluctance, the observed utilization of the technology opened up for new potential practices. Our study shows how working with perceived conflict in technology can still open up design space for interactive technologies.",
  "authors": [
    {
      "name": "Louise Barkhuus",
      "institution": "Stockholm University, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331488921",
      "orcid": "0000-0003-1306-249X"
    },
    {
      "name": "Arvid Engström",
      "institution": "Mobile Life @ Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371594557",
      "orcid": "missing"
    },
    {
      "name": "Goranka Zoric",
      "institution": "ABB Corporate Research, Västerås, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384615447",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Auslander, P. Liveness: Performance in a networked culture, 2nd ed. New York, US, Rutledge, 2008.",
      "doi": ""
    },
    {
      "text": "Barkhuus, L. and Jørgensen, T.. Engaging the crowd: studies of audience-performer interaction. Ext. Abstracts CHI 2008, ACM Press (2008), 2925--2930.  ",
      "doi": "10.1145/1358628.1358785"
    },
    {
      "text": "Barkhuus, L., and Polichar, V. E. Empowerment through seamfulness: smart phones in everyday life. Personal and Ubiquitous Computing 15 (6), 2011, 629--639.  ",
      "doi": "10.1007/s00779-010-0342-4"
    },
    {
      "text": "Basapur, S., Harboe, G., Mandalia, H., Novak, A., Vuong, V. and Metcalf, C. Field trial of a dual device user experience for iTV. In Proc. EuroITV 2011, ACM Press (2011), 127--136.  ",
      "doi": "10.1145/2000119.2000145"
    },
    {
      "text": "Basapur, S., Mandalia, H., Chaysinh, S., Lee, Y., Venkitaraman, N. and Metcalf, C. 2012. FANFEEDS: evaluation of socially generated information feed on second screen as a TV show companion. In Proc. EuroITV 2012. ACM Press (2012), 87--96.  ",
      "doi": "10.1145/2325616.2325636"
    },
    {
      "text": "Bedwell, B., Schnädelbach, H., Benford, S., Rodden, T., and Koleva, B. In Support of City Exploration. In Proc. CHI 2009. ACM Press (2009), 1171--1180.  ",
      "doi": "10.1145/1518701.1518879"
    },
    {
      "text": "Brown, B., Reeves, S. and Sherwood, S. Into the wild: challenges and opportunities for field trial methods. In Proc. CHI 2011, ACM Press (2011), 1657--1666.  ",
      "doi": "10.1145/1978942.1979185"
    },
    {
      "text": "Chalmers, M. and Galani, A. Seamful interweaving: heterogeneity in the theory and design of interactive systems. In Proc. DIS 2004, ACM Press (2004), 243--252.  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Courtois, C. and D'heer, E. Second screen applications and tablet users: constellation, awareness, experience, and interest. In Proc. EuroITV 2012, ACM Press (2012), 153--156.  ",
      "doi": "10.1145/2325616.2325646"
    },
    {
      "text": "Dayan, D. and Katz, E. Media events: the live broadcasting of history. Harvard University Press, 1992.",
      "doi": ""
    },
    {
      "text": "D'heer, E., Courtois, C. and Paulussen, S. Everyday life in (front of) the screen: the consumption of multiple screen technologies in the living room context. In Proc. EuroITV 2012, ACM Press (2012), 195--198.  ",
      "doi": "10.1145/2325616.2325654"
    },
    {
      "text": "De Sá, M., Shamma, D. A., Churchill, E. Live Mobile Collaboration for Video Production Design, Guidelines, and Requirements. Personal Ubiquitous Computing, Special issue on Video Interaction, 2013, 1--15.",
      "doi": ""
    },
    {
      "text": "Engström, A. and Perry, M. 2011. \"Liveness\" in live TV: production, experience and future design. Ext. Abstracts CHI 2011, ACM Press (2011).",
      "doi": ""
    },
    {
      "text": "Esbjörnsson, M., Brown, B., Juhlin, O., Normark, D., Östergren, M. and Laurier. E. Watching the cars go round and round: designing for active spectating. In Proc. CHI 2006, ACM Press (2006) , 1221--1224.  ",
      "doi": "10.1145/1124772.1124955"
    },
    {
      "text": "Ganhör, R. ProPane: fast and precise video browsing on mobile phones. In Proc MUM 2012, ACM Press (2012), article 20, 8 pages.  ",
      "doi": "10.1145/2406367.2406392"
    },
    {
      "text": "Holmes, M. E., Josephson, S. and Carney, R. E. Visual Attention to Television Programs With a Second-Screen Application. In Proc ETRA 2012, ACM Press, (2012), 397--400.  ",
      "doi": "10.1145/2168556.2168646"
    },
    {
      "text": "Hudelist, M. A. Schoeffmann, K. and Boeszoermenyi, L. Mobile video browsing with a 3D filmstrip. In Proc. ICMR 2013, ACM Press (2013), 299--300.  ",
      "doi": "10.1145/2461466.2461515"
    },
    {
      "text": "Jacucci, G. Oulasvirta, A., Ilmonen, T., Evans, T. and Salovaara, A. Comedia: mobile group media for active spectatorship. In Proc. CHI 2007, ACM Press (2007), 1273--1282.  ",
      "doi": "10.1145/1240624.1240817"
    },
    {
      "text": "Jiang, J., Köhler, J., Williams, C. M., Zaletelj, J., Güntner, G., Horstmann, H., Ren, J., Löffler, J. and Weng, Y. Live: An integrated production and feedback system for intelligent and interactive TV broadcasting. IEEE transactions on broadcasting, first, 2011.",
      "doi": ""
    },
    {
      "text": "Karrer, T., Weiss, M., Lee, E. and Borchers, J. DRAGON: a direct manipulation interface for frame-accurate in-scene video navigation. In Proc. CHI 2008, ACM Press (2008), 247--25.  ",
      "doi": "10.1145/1357054.1357097"
    },
    {
      "text": "Kennedy, L. and Naaman, M. Less talk, more rock: automated organization of community-contributed collections of concert videos. In Proc WWW 2009, ACM Press (2009), 311--320.  ",
      "doi": "10.1145/1526709.1526752"
    },
    {
      "text": "Lombard, M., Reich, R. D., Grabe, M. E., Bracken, C. C. and Ditton, T. B. Presence and Television. The Role of Screen Size. Human Communication Research, 26(1), January 2000, 75--98.",
      "doi": ""
    },
    {
      "text": "Ludvigsen, M. and Veerasawmy. R. Designing technology for active spectator experiences at sporting events. In Proc. OZCHI 2010, ACM Press (2010), 96--103.  ",
      "doi": "10.1145/1952222.1952243"
    },
    {
      "text": "Macq, J.-F., Verzijp, N., Aerts, M., Vandeputte; F. and Six, E. 2011. Demo: Omnidirectional video navigation on a tablet PC using a camera-based orientation tracker. In Proc. Distributed Smart Cameras (ICDSC 2011), IEEE (2011) , 1--2.",
      "doi": ""
    },
    {
      "text": "Olsen, D. R., Partridge, B. and Lynn, S. Time warp sports for internet television, ACM Transactions on Computer-Human Interaction, 17 (4) December 2010, article no. 16.  ",
      "doi": "10.1145/1879831.1879834"
    },
    {
      "text": "Oppermann, L., Flintham, M., Reeves, S., Benford, S. Greenhalgh, C., Marshall, J., Adams, Farr, J. R. and Tandavanitj, N.. Lessons from Touring a Location-Based Experience. In Proc. of Pervasive Computing, (2011). 232--249. ",
      "doi": "10.5555/2021975.2021996"
    },
    {
      "text": "Patrikakis, C., Papaoulakis, N., Papageorgiou, P., Pnevmatikakis, A., Chippendale, P., Nunes, M., Cruz, R., Poslad, S. and Zhenchen, W. Personalized Coverage of Large Athletic Events, Multimedia, IEEE, 18 (4), 2012, 18--29.  ",
      "doi": "10.1109/MMUL.2010.69"
    },
    {
      "text": "Rondao-Alface, P., Macq, J.-F. and Verzijp, N. Interactive Omnidirectional Video Delivery: A Bandwidth-Effective Approach. In Bell Labs Technical Journal 16 (4), 2012, 135--147.  ",
      "doi": "10.1002/bltj.20538"
    },
    {
      "text": "Saltz, D. Z. Live Media: Interactive Technology and Theater. Theatre Topics, 11(2), September 2001, 107--130.",
      "doi": ""
    },
    {
      "text": "Schreer, O. Thomas, G., Niamut, O. A. Macq, J.-F., Kochale, A., Batke, J.-M., Ruiz Hidalgo, J. Oldfield, R., Shirley, B. and Thallinger, G. Format-agnostic Approach for Production, Delivery and Rendering of Immersive Media, NEM Summit 2011, Torino, Italy, Sept. 27-29, 2011.",
      "doi": ""
    },
    {
      "text": "Thompson, J. The media and modernity: a social theory of the media. Cambridge, Polity, 1995.",
      "doi": ""
    },
    {
      "text": "Vihavainen, S., Mate, S., Liikkanen, L and Curcio, I.. Video as memorabilia: user needs for collaborative automatic mobile video production. In Proc. CHI 2012, ACM Press (2012), 651--654.  ",
      "doi": "10.1145/2207676.2207768"
    },
    {
      "text": "Vihavainen, S. Mate, S., Seppälä, L., Cricri, F. and Curcio, I. D. D.. We want more: human-computer collaboration in mobile social video remixing of music concerts. In Proc. CHI 2011, ACM Press (2011), 287--296.  ",
      "doi": "10.1145/1978942.1978983"
    },
    {
      "text": "Wurtzler, S. 1992. She Sang Live, But The Microphone Was Turned Off: The Live, the Recorded and the Subject of Representation. In Altman (Ed.), Sound Theory Sound Practice, New York, Routledge, 1992.",
      "doi": ""
    },
    {
      "text": "Yonezawa, T. and Tokuda, H. Enhancing communication and dramatic impact of online live performance with cooperative audience control. In Proc. of the UbiComp 2012, ACM Press (2012), 103--112.  ",
      "doi": "10.1145/2370216.2370234"
    },
    {
      "text": "Zoric, G., Engstrom, A., Barkhuus, L., Önnevall, E. 2013. Panoramic video: design challenges and implications for content interaction. In Proc. EuroITV, ACM Press (2013),153--162.  ",
      "doi": "10.1145/2465958.2465959"
    }
  ]
}