{
  "doi": "10.1145/2556288.2557417",
  "title": "Social media participation and performance at work: a longitudinal study",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "115-118",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The use of social media at work is gaining traction, and there is evidence to suggest that various benefits accrue from its use. Yet the relationship between using social media at work and employee performance is not clear. Through a study of 75,747 employees of a large global company over the course of 3 years, we find that some social media usage (number of forum posts, forum post length, and status update length) was positively associated with performance ratings. This study is one of the first to show the relationship among different forms of social media use and employee performance ratings.",
  "authors": [
    {
      "name": "N. Sadat Shami",
      "institution": "IBM Corporate Headquarters, Armonk, NY, USA",
      "img": "/do/10.1145/contrib-81100499118/rel-imgonly/sadat_shami.png",
      "acmid": "81100499118",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Nichols",
      "institution": "IBM Research -- Almaden, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81100204766/rel-imgonly/jeffhead2021-square.jpeg",
      "acmid": "81100204766",
      "orcid": "0000-0002-6880-8546"
    },
    {
      "name": "Jilin Chen",
      "institution": "IBM Research -- Almaden, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487940",
      "orcid": "0000-0002-0513-7474"
    }
  ],
  "references": [
    {
      "text": "Aral, S., Brynjolfsson, E. and Van Alstyne, M. Productivity Effects of Information Diffusion in Networks. In Proc. ICIS 2007, (2007).",
      "doi": ""
    },
    {
      "text": "Archambault, A. and Grudin, J. A longitudinal study of facebook, linkedin, and twitter use. In Proc. CHI 2012.  ",
      "doi": "10.1145/2207676.2208671"
    },
    {
      "text": "DiMicco, J., Millen, D. R., Geyer, W., Dugan, C., Brownholtz, B. and Muller, M. Motivations for social networking at work. In Proc. CSCW 2008.  ",
      "doi": "10.1145/1460563.1460674"
    },
    {
      "text": "Liang, K. Y. and Zeger, S. L. Longitudinal data analysis using generalized linear models. Biometrika, 73, 1 (1986), 13--22.",
      "doi": ""
    },
    {
      "text": "Norton, E. C., Bieler, G. S., Ennett, S. T. and Zarkin, G. A. Analysis of prevention program effectiveness with clustered data using generalized estimating equations. Journal of Consulting and Clinical Psych., 64, 5 (1996).",
      "doi": ""
    },
    {
      "text": "O'Mahony, S. and Barley, S. R. Do telecommunications technologies affect work and organizations? The state of our knowledge. In B. Staw and R. Sutton (Eds.), Research in organizational behavior (Vol. 21, pp. 125161). Greenwich, CT: JAI Press, 1999.",
      "doi": ""
    },
    {
      "text": "Treem, J. and Leonardi, P. M. Social media use in organizations: Exploring the affordances of visibility, editability, persistence, and association. Communication Yearbook, 36 (2012), 143--189.",
      "doi": ""
    },
    {
      "text": "Wu, L., Waber, B., Aral, S., Brynjolfsson, E. and Pentland, A. Mining face-to-face interaction networks using sociometric badges: Predicting productivity in an IT configuration task. In Proc. ICIS 2008, (2008).",
      "doi": ""
    }
  ]
}