{
  "doi": "10.1145/2556288.2557143",
  "title": "Share your view: impact of co-navigation support and status composition in collaborative online shopping",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3299-3308",
  "year": 2014,
  "badges": [],
  "abstract": "Collaborative online shopping, an emerging paradigm in e-commerce, allows remote shoppers to extend purchase-oriented social interactions into the digital environment. Online vendors have been experimenting ways to facilitate this activity. However, more research needs to be done on identifying what feature can create a pleasing shopping experience and ultimately encourage spending. In this paper, we present an exploration of the impact of co-navigation supports, including location cue, split screen, and shared view, on the experiences and performance of 60 co-shopper dyads. We also studied if status composition of shopping companions played a role in this process. By analyzing about 1800 minutes of eye-tracking data, video footages, and web logs, we found that split screen encouraged more diverse product search, shared view enabled better coordination, and location cue was the least distracting. Co-buyers achieved better factual and inference understanding, though buyer-advisor dyads were more likely to stay together.",
  "tags": [
    "location cue",
    "status composition",
    "co-navigation",
    "shared view",
    "buyer-advisor",
    "eye-tracking",
    "collaborative online shopping",
    "split screen",
    "co-buyers"
  ],
  "authors": [
    {
      "name": "Yanzhen Yue",
      "institution": "National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059126557",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Noah's Ark Lab, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    },
    {
      "name": "Zhenhui Jiang",
      "institution": "National University of Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545419656",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnold, M.J. and Reynolds, K.E. Hedonic Shopping Motivations. Journal of Retailing. 79, (2003).77--95.",
      "doi": ""
    },
    {
      "text": "Balakrishnan, A.D., Fussell, S.R. and Kiesler, S. Do Visualizations Improve Synchronous Remote Collaboration? In Proc. CHI'08, (2008). 1227--1236.  ",
      "doi": "10.1145/1357054.1357246"
    },
    {
      "text": "BevyUp. www.bevyup.com. (accessed in 2013).",
      "doi": ""
    },
    {
      "text": "Brennan, S. E. The Grounding Problem in Conversations with and through Computers. In S. R. Fussell & R. J. Kreuz (Eds.) Social and Cognitive Approaches to Interpersonal Communication. Mahwal, NJ: Erlbaum, (1998). 201--225.",
      "doi": ""
    },
    {
      "text": "BuddyShopping. http://www.ecommerceguide.com/article.php/3648641/Whos-Your-Buddy-ANew-Social-Shopping-Site.htm. (2006).",
      "doi": ""
    },
    {
      "text": "Carroll, J. M., Neale, D. C., Isenhour, P. L., Rosson, M. B., and McCrickard, D. S. Notification and Awareness: Synchronizing Task-Oriented Collaborative Activity, Internation Journal of Human-Computer Studies 58(5). (2003). 605--632.  ",
      "doi": "10.1016/S1071-5819%2803%2900024-7"
    },
    {
      "text": "Clark, H. H., & Brennan, S. E. Grounding in communication. In L. B. Resnick, J. M. Levine & S. D. Teasley (Eds.), Perspectives on socially shared cognition. American Psychological Association. (1991).",
      "doi": ""
    },
    {
      "text": "Clark, H.H. & Wilkes-Gibbs, D. Referring as a collaborative process. Cognition, 22 (1986): 1--39.",
      "doi": ""
    },
    {
      "text": "Corfman, K. P., and Lehmann, D. R. Models of Cooperative Group Decision-Making and Relative Influence: An Experimental Investigation of Family Purchase Decisions. Journal of Consumer Research. 14(1987): 1--13.",
      "doi": ""
    },
    {
      "text": "Cramton, C. The Mutual Knowledge Problem and Its Consequences for Distributed Collaboration. Organization Science 12(3), (2001). 346--371.  ",
      "doi": "10.1287/orsc.12.3.346.10098"
    },
    {
      "text": "Cuevas, M. Collaborative Online Shopping: The Next Wave in E-Commerce. E-Commerce Times. (2013).",
      "doi": ""
    },
    {
      "text": "Dabbish, L., and Kraut, R. Awareness Displays and Social Motivation for Coordinating Communication. Information Systems Research 19(2), (2008). 221--238.  ",
      "doi": "10.1287/isre.1080.0175"
    },
    {
      "text": "DecisionStep. http://socialcommercetoday.com/socialshopping-test-15-sales-50-average-order-value/. (2010).",
      "doi": ""
    },
    {
      "text": "European Travel Commission. Consumer Trends. http://etc-digital.org/digital-trends/consumerbehaviour/consumer-trends/. (2013).",
      "doi": ""
    },
    {
      "text": "Evans, P.F, Carini, A., Simposon, M., and Zeidler, B. What Stops Consumers from Buying Online: Inhibitors of Online Shopping Behavior in Europe. Forrester Research, Inc. (2010).",
      "doi": ""
    },
    {
      "text": "Forrester Research, Inc. US Online Retail Forecast, 2012 To 2017. (2013).",
      "doi": ""
    },
    {
      "text": "Gibson, C.B. From knowledge accumulation to accommodation: Cycles of collective cognition in work groups. J. of Org. Behavior, 22(2001). 121--134.",
      "doi": ""
    },
    {
      "text": "Greer, L. L., & Jehn, K. A. The pivotal role of negative affect in understanding the effects of process conflict on group performance. In E. A. Mannix,M. A. Neale, & C. Anderson (Eds.), Research on managing groups and teams. 10: 23--45. Stanford, CT: JAI. (2007).",
      "doi": ""
    },
    {
      "text": "Gutwin, C., and Greenberg, S. Workspace Awareness for Groupware Companion. In Proc. CHI'96, ACM Press, (1996). 208--209.  ",
      "doi": "10.1145/257089.257284"
    },
    {
      "text": "Hill J. and Gutwin, C. The MAUI Toolkit: Groupware Widgets for Group Awareness. Proc.CSCW'04. (2004).  ",
      "doi": "10.1007/s10606-004-5063-7"
    },
    {
      "text": "Hinsz, V.B., Tindale, R.S., and Vollrath, D.A. The Emerging Conceptualization of Groups as information Processor. Psychological Bulletin, 121(1997): 43--64.",
      "doi": ""
    },
    {
      "text": "Jiang, Z. and Benbasat, I. Investigating the Influence of the Functional Mechanisms of Online Product Presentations. Information Systems Research, 18(4), (2007). 454--470.  ",
      "doi": "10.1287/isre.1070.0124"
    },
    {
      "text": "Jiang, Z., Chan, J., Tan, B.C.Y., and Chua, W.S. Effects of Interactivity on Website Involvement and Purchase Intention. Journal of the Association for Information Systems, 11(1), (2010). 34--59.",
      "doi": ""
    },
    {
      "text": "Jiang, J. and Klein, G. A Discrepancy Model of Information Systems Personnel Turnover. Journal of Management Information Systems, 19(2002):249--272. ",
      "doi": "10.1080/07421222.2002.11045722"
    },
    {
      "text": "Kottemann, J.E., Davis, F.D., and Remus, W.E. Computer-Assisted Decision Making: Performance, Beliefs, and the Illusion of Control. Org. Behavior and Human Decision Processes 57, (1994). 26--37.",
      "doi": ""
    },
    {
      "text": "Limayem, M., Khalifa, M., and Frini, A. What Makes Consumers Buy from Internet? A Longitudinal Study of Online Shopping. IEEE Trans. on Sys., Man, and Cyber., Part A: Systems and Humans. 30(4). (2000).  ",
      "doi": "10.1109/3468.852436"
    },
    {
      "text": "Lowet, D. and Goergen, D. Co-Browsing Dynamic Web Pages. In Proc. WWW'09, ACM Press, (2009). 941--950.  ",
      "doi": "10.1145/1526709.1526836"
    },
    {
      "text": "Morris, M.R., Teevan, J. and Bush, S. Enhancing Collaborative Web Search with Personalization: Groupization, Smart Splitting, and Group HitHighlighting. Proc.CSCW'08. (2008).  ",
      "doi": "10.1145/1460563.1460640"
    },
    {
      "text": "Paul, S.A. and Morris, M.R. CoSense: Enhancing Sensemaking for Collaborative Web Search. In Proc. CHI'09, ACM Press, (2009). 1771--1780.  ",
      "doi": "10.1145/1518701.1518974"
    },
    {
      "text": "plurchase. http://mashable.com/2009/10/13/plurchase/.",
      "doi": ""
    },
    {
      "text": "Propp, K.M. Collective information processing in groups. In L. Frey, D. Gouran, & MS Poole (Eds.), Handbook of group communication theory and research Thousand Oaks, CA: Sage. (1999). 225--250.",
      "doi": ""
    },
    {
      "text": "Puglia, S., Carter, R., and Jain, R. MultECommerce: A Distributed Architecture for Collaborative Shopping on the WWW. In Proc. EC'00, (2000).  ",
      "doi": "10.1145/352871.352895"
    },
    {
      "text": "Tauber, E. M. Why Do People Shop? Journal of Marketing (36). (1972). 46--49.",
      "doi": ""
    },
    {
      "text": "Yue, Y & Jiang, Z. Enhancing Shared Understanding in Collaborative Online Shopping.In Proc. ICIS'13.(2013).",
      "doi": ""
    },
    {
      "text": "Zhu, L., I. Benbasat, and Z. Jiang. Let's shop online together: An empirical investigation of collaborative online shopping support. Information Systems Research, 21(4), (2010). 872--89  ",
      "doi": "10.1287/isre.1080.0218"
    }
  ]
}