{
  "doi": "10.1145/2556288.2557321",
  "title": "A smartphone-based sensing platform to model aggressive driving behaviors",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "4047-4056",
  "year": 2014,
  "badges": [],
  "abstract": "Driving aggressively increases the risk of accidents. Assessing a person's driving style is a useful way to guide aggressive drivers toward having safer driving behaviors. A number of studies have investigated driving style, but they often rely on the use of self-reports or simulators, which are not suitable for the real-time, continuous, automated assessment and feedback on the road. In order to understand and model aggressive driving style, we construct an in-vehicle sensing platform that uses a smartphone instead of using heavyweight, expensive systems. Utilizing additional cheap sensors, our sensing platform can collect useful information about vehicle movement, maneuvering and steering wheel movement. We use this data and apply machine learning to build a driver model that evaluates drivers' driving styles based on a number of driving-related features. From a naturalistic data collection from 22 drivers for 3 weeks, we analyzed the characteristics of drivers who have an aggressive driving style. Our model classified those drivers with an accuracy of 90.5% (violation-class) and 81% (questionnaire-class). We describe how, in future work, our model can be used to provide real-time feedback to drivers using only their current smartphone.",
  "tags": [
    "driving assessment",
    "smartphone",
    "in-vehicle sensing platform"
  ],
  "authors": [
    {
      "name": "Jin-Hyuk Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81333488723",
      "orcid": "missing"
    },
    {
      "name": "Ben Margines",
      "institution": "Carnegie-Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959454957",
      "orcid": "missing"
    },
    {
      "name": "Anind K. Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aggressive driving: research update, American Automobile Assoc. Foundation for Traffic Safety, (2009).",
      "doi": ""
    },
    {
      "text": "Amditis, A., Pagle, K., Joshi, S., and Bekiaris, E. Drivervehicle-environment monitoring for on-board driver support systems: lessons learned from design and implementation. Applied Ergonomics 41, 2 (2010), 225235.",
      "doi": ""
    },
    {
      "text": "Barkley, R.A. and Cox, C. A review of driving risks and impairments associated with attentiondeficit/hyperactivity disorder and the effects of stimulant medication on driving performance. Journal of Safety Research 38, 1 (2007), 113'128.",
      "doi": ""
    },
    {
      "text": "Berdoulat, E., Vavassori, D., and Sastre, M. Driving anger, emotional and instrumental aggressiveness, and impulsiveness in the prediction of aggressive and transgressive driving. Accident Analysis and Prevention 50, (2013), 758--767.",
      "doi": ""
    },
    {
      "text": "Boyce, T.E. and Geller, E.S. An instrumented vehicle assessment of problem behavior and driving style: Do younger males really take more risks' Accident Analysis and Prevention 34, 1 (2002), 51--64.",
      "doi": ""
    },
    {
      "text": "Cambridge Systematics. 2011. Crashes vs Congestion: What's the Cost to Society' American Automobile Association, (November 2011). Retrieved Sept. 5, 2013, http://newsroom.aaa.com/wp-content/uploads/ 2011/11/2011_AAA_CrashvCongUpd.pdf",
      "doi": ""
    },
    {
      "text": "Chilaoutakis, J.E., Demakakos, P., Tzamalouka, G., Bakou, V., Koumaki, M., and Darviri, C. Aggressive behavior while driving as predictor of self-reported car crashes. Journal of Safety Research 33, 4 (2002), 431443.",
      "doi": ""
    },
    {
      "text": "Coughlin, J.F., Reimer, B., and Mehler, B. Monitoring, managing, and motivating driver safety and well-being. Pervasive Computing IEEE 10, 3 (2011), 14--21.  ",
      "doi": "10.1109/MPRV.2011.54"
    },
    {
      "text": "Countermeasures that work: A highway safety countermeasure guide for state highway safety offices. National Highway Traffic Safety Administration Fourth Edition. (2009).",
      "doi": ""
    },
    {
      "text": "Dahlen, E.R., Edwards, B.D., Tubre, T., Zyphur, M.J., and Warren, C.R. Taking a look behind the wheel: An investigation into the personality predictors of aggressive driving. Accident Analysis & Prevention 45, (2012), 1--9.",
      "doi": ""
    },
    {
      "text": "Deffenbacher, J.L., Oetting, E.R., and Lynch, R.S. Development of a driving anger scale. Psychological Reports 74, 1 (1994), 83--91.",
      "doi": ""
    },
    {
      "text": "Deffenbacher, J.L., Oetting, E.R., and Swaim, R.C. The Driving Anger Expression Inventory: A measure of how people express their anger on the road. Behavior Research and Therapy 40, 6 (2002), 7--737.",
      "doi": ""
    },
    {
      "text": "Dey, A.K., Wac, K., Ferreira, D., Tassini, K., Hong, J.H., and Ramos, J. Getting closer: an empirical investigation of the proximity of user to their smart phones. Ubicomp'11, (2011), 163--172.  ",
      "doi": "10.1145/2030112.2030135"
    },
    {
      "text": "Espinosa, F., Jimenez, J.A., Santiso, E., Gardel, A., Perez, D., Casanova, J. and Santos, C. Design and implementation of a portable electronic system for vehicle-driver-route activity measurement. Measurement 44, 2 (2011), 326--337.",
      "doi": ""
    },
    {
      "text": "Evans, L. 1991. Traffic Safety and the Driver. Van Nostrand, New York, NY.",
      "doi": ""
    },
    {
      "text": "Hennessey, D. and Weisenthal, D.L. Traffic congestion, driver stress, and driver aggression. Aggressive Behavior 25, 6 (1999). 409--423",
      "doi": ""
    },
    {
      "text": "Houston, J.M., Farris, P.B., and Norman, M. The aggressive driving behavior scale: developing a selfreport measure of unsafe driving practices. North American Journal of Psychology 5, 2 (2003), 269--278.",
      "doi": ""
    },
    {
      "text": "Jensen, M., Wagner, J., and Alexander, K. Analysis of in-vehicle driver behaviour data for improved safety. Int'l Journal of Vehicle Safety 5, 3 (2011), 197--212.",
      "doi": ""
    },
    {
      "text": "Johnson, D.A. and Trivedi, M.M. Driving style recognition using a smartphone as a sensor platform. In Proc. 11th Int. Conf. Mobile and Ubiquitous Multimedia, (2011), 1609--1615.",
      "doi": ""
    },
    {
      "text": "Kee, S., Shamsul, B, and Goh, Y Differences of drivers' driving performance in simulated driving. Research Journal of Applied Sciences 4, 6 (2009), 230--237.",
      "doi": ""
    },
    {
      "text": "Lawton, R., Parker, D., Manstead, A.S.R., and Stradling, S.G. The role of affect in predicting social behaviors: the case of road traffic violations. Journal of Applied Social Psychology 27, 14 (1997), 1258--1276.",
      "doi": ""
    },
    {
      "text": "Li, K., Lu, M., Lu, F., Lv, Q., Shang, L., and Maksimovic, D. Personalized driving behavior monitoring and analysis and emerging hybrid vehicles. Pervasive (LNCS 7319), (2012), 1--19.  ",
      "doi": "10.1007/978-3-642-31205-2_1"
    },
    {
      "text": "Malta, L., Miyajima, C. and Takeda, K. A study of driver behavior under potential threats in vehicle traffic. IEEE Transactions on Intelligent Transportation Systems 10, 2 (2009), 201--210.  ",
      "doi": "10.1109/TITS.2009.2018321"
    },
    {
      "text": "Miyajima, C., Nishiwaki, Y., Ozawa, K., Wakita, T., Itou, K.,Takeda, K., and Itakura, F. Driver modeling based on driving behavior and its evaluation in driver identification. Proceedings of the IEEE 95, 2 (2007), 427--437.",
      "doi": ""
    },
    {
      "text": "Mohan, P., PadManabhan, V.N., and Ramjee, R. Nericell: rich monitoring of road and traffic conditions using mobile smartphones. SenSys'08, (2008), 323.  ",
      "doi": "10.1145/1460412.1460444"
    },
    {
      "text": "Mynttinen, S., Sundstrom, A., Vissers, J. Koivukoski, M., Hakuli, K., and Keskinen, E. Self-assessed driver competence among novice drivers ' a comparison of driving test candidate assessments and examiner assessments in a Dutch and Finnish sample. Journal of Safety Research 40, 4 (2009), 301--309.",
      "doi": ""
    },
    {
      "text": "Neale, V.L., Dingus, T.A., Klauer, S., Sudweeks, J. and Goodman, M. An overview of the 100-car naturalistic study and findings. ESV Paper 05-0400, (2005).",
      "doi": ""
    },
    {
      "text": "Nichols, J. 1998. New opportunities: Can behavior analysis help with traffic safety' Panel discussion (panel session). 24th Annual Convention of the Association for Behavior Analysis, Orlando, FL.",
      "doi": ""
    },
    {
      "text": "Owsley, C. Driving mobility, older adults, and quality of life. Gerontechnology 1, 4 (2002), 220--230.",
      "doi": ""
    },
    {
      "text": "Özkan, T., Lajunen, T., Chliaoutakis, J.E., Parker, D., and Summala, H. Cross-cultural differences in driving behaviours: A comparison of six countries. Transportation Research Part F: Traffic Psychology and Behaviour 9, 3 (2006), 227'242.",
      "doi": ""
    },
    {
      "text": "Paefgen, J., Kehr, F., Zhi, Y., and Michaelles, F. Driving behavior analysis with smartphones: insights from a controlled field study. In Proc. 11th Int. Conf. Mobile and Ubiquitous Multimedia, (2012), 36.  ",
      "doi": "10.1145/2406367.2406412"
    },
    {
      "text": "Reason, J., Manstead, A., Stradling, S., Baxter, J., and Campbell, K. Errors and violations on the roads: a real distinction' Ergonomics 33, 10--11 (1990), 1315--1332.",
      "doi": ""
    },
    {
      "text": "Shinar, D. and Compton, R. Aggressive driving: an observational study of driver, vehicle, and situational variables, Accident Analysis and Prevention 36, 3 (2004), 429--437.",
      "doi": ""
    },
    {
      "text": "Sundstr'm, A. Self-assessment of driving skill ' A review from a measurement perspective. Transportation Research Part F, 11 (2008), 1--9.",
      "doi": ""
    },
    {
      "text": "Tasca, L. A review of the literature on aggressive driving research. Aggressive Driving Issues Conf, (2000).",
      "doi": ""
    },
    {
      "text": "Toledo, T., Musicant, O., Lotan, T. In-vehicle data recorders for monitoring and feedback on drivers' behavior. Transportation Research Part C 16, 3 (2008), 320--331.",
      "doi": ""
    },
    {
      "text": "Wiesenthal, D.L., Hennessy, D., and Gibson, P.M. The Driving Vengeance Questionnaire (DVQ): The development of a scale to measure deviant drivers' attitudes. Violence and Victims 15, 2 (2000), 115--136.",
      "doi": ""
    },
    {
      "text": "Winter, J. and Dodou, D. The driver behavior questionnaire as a predictor of accidents: a meta-analysis. Journal of Safety Research 41, 6 (2010), 463--470.",
      "doi": ""
    },
    {
      "text": "You, C.-W., Montes-de-Oca, M., Bao, T.J., Lane, N.D., Lu H., Cardone, G., Torresani, L., and Campbell, A.T. CarSafe: a driver safety app that detects dangerous driving behavior using dual-cameras on smartphones. Ubicomp'12, (2012), 671--672.  ",
      "doi": "10.1145/2370216.2370360"
    },
    {
      "text": "Zhang, Y., Lin, W.C., and Chin, Y.-K. A patternrecognition approach for driving skill characterization. IEEE Transactions on Intelligent Transportation Systems 11, 4 (2010), 905--916.  ",
      "doi": "10.1109/TITS.2010.2055239"
    }
  ]
}