{
  "doi": "10.1145/2556288.2557284",
  "title": "Design insights for the next wave ontology authoring tools",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1555-1558",
  "year": 2014,
  "badges": [],
  "abstract": "Ontologies have been employed across scientific and business domains for some time, and the proliferation of linked data means the number and range of potential authors is set to increase significantly. Ontologies using the Web Ontology Language (OWL) are complex artefacts, however: the authoring process requires not only knowledge of the application domain, but also skills in programming and logics. To date, there has been no systematic attempt to understand the effectiveness of existing tools, or explore what users really require to build successful ontologies. Here we address this shortfall, presenting insights from an interview study with 15 ontology authors. We identify the problems reported by authors, and the strategies they employ to solve them. We map the data to a set of design recommendations, which describe how tools of the future can support ontology authoring. A key challenge is dealing with information overload: improving the user's ability to navigate, populate and debug large ontologies will revolutionise the engineering process, and open ontology authoring up to a new generation of users.",
  "tags": [
    "ontologies",
    "authoring tools",
    "semantic web"
  ],
  "authors": [
    {
      "name": "Markel Vigo",
      "institution": "The University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329492781",
      "orcid": "missing"
    },
    {
      "name": "Caroline Jay",
      "institution": "The University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100091861",
      "orcid": "missing"
    },
    {
      "name": "Robert Stevens",
      "institution": "The University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408598120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Braun, V., and Clarke, V. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Cardoso, J. The semantic web vision: Where are we? IEEE Intelligent Systems 22, 5 (2007), 84--88.  ",
      "doi": "10.5555/1304060.1304523"
    },
    {
      "text": "Randall, D., Procter, R., Lin, Y., Poschen, M., Sharrock, W., and Stevens, R. Distributed ontology building as practical work. International Journal of Human-Computer Studies 69, 4 (2011), 220--233.  ",
      "doi": "10.1016/j.ijhcs.2010.12.011"
    },
    {
      "text": "W3C OWL Working Group. OWL 2 Web Ontology Language Document Overview, 2012. http://www.w3.org/TR/owl2-overview/.",
      "doi": ""
    }
  ]
}