{
  "doi": "10.1145/2556288.2557042",
  "title": "Cloudy forecast: an exploration of the factors underlying shared repository use",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2461-2470",
  "year": 2014,
  "badges": [],
  "abstract": "Many teams are now adopting shared repositories for their work. Such adoption is paradoxical, however, as past research has repeatedly shown major co-organizational barriers; teams cannot agree a common organizational scheme, making it difficult to retrieve information organized by others. Another barrier is email competition; email provides a reliable alternative for distributing files that are then personally organized. To address this paradox, we explored how 27 participants actively using shared repositories overcome these barriers in a qualitative study. We found teams addressed co-organization using 4 strategies. First they create ContentMaps that provide explicit structure to organize shared information. Participants also co-organize using implicit strategies based on task structure, expertise, and tool affordances. Greater shared repository use also leads to a changed role for email. Versioning problems mean email is not used for distributing attachments, instead for task management. We present technical implications suggesting how new tools might be better integrated with email facilitating these continued email uses.",
  "authors": [
    {
      "name": "Charlotte Massey",
      "institution": "University of California, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958647557",
      "orcid": "missing"
    },
    {
      "name": "Thomas Lennig",
      "institution": "Imimtek, Inc, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81556859056/rel-imgonly/aaeaaqaaaaaaaaxuaaaajduzymy5mzvhltayodktndhjms04odcxltm5mdgzzmiznmu0oq.jpg",
      "acmid": "81556859056",
      "orcid": "missing"
    },
    {
      "name": "Steve Whittaker",
      "institution": "University of California at Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "http://reviews.cnet.com/8301-13970_7-5757151378/dropbox-clears-1-billion-file-uploads-per-day/",
      "doi": ""
    },
    {
      "text": "http://techcrunch.com/2012/06/28/google-drive-now-has-10-million-users-available-on-ios-and-chrome-os-offline-editing-in-docs/",
      "doi": ""
    },
    {
      "text": "Abrams, D., Baecker, R., & Chignell, M. Information archiving with bookmarks. Proc CHI, ACM Press (1998) p. 41--48.  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Ackerman, M. S., & Halverson, C. Organizational memory as objects, processes, and trajectories. Proc CSCW, 13(2) (2004) p. 155--189.",
      "doi": ""
    },
    {
      "text": "Aula, A., Jhaveri, N., & Käki, M. Information search and reaccess strategies of experienced web users. In Proc WWW, ACM Press (2005) p. 583--592.  ",
      "doi": "10.1145/1060745.1060831"
    },
    {
      "text": "Bannon, L. and S. Bødker Constructing Common Information Spaces. Proc CSCW, ACM Press (1997) p. 81--96. ",
      "doi": "10.5555/1241980.1241986"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., & Smith, I. Taking email to task. In Proc. CHI 2003, ACM Press (2003), 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., Smith, I., & Grinter, R. E. Quality versus quantity: E-mail-centric task management and its relation with overload. HCI, 20(1) (2005) p 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Bergman, O., Beyth-Marom, R., Nachmias, R., Gradovitch, N., & Whittaker, S. Improved search engines and navigation preference in personal information management. ACM TOIS, 26(40) (2008).  ",
      "doi": "10.1145/1402256.1402259"
    },
    {
      "text": "Bergman, O., Whittaker, S., Sanderson, M., Nachmias, R., Ramamoorthy, A. The effect of folder structure on personal file navigation. JASIST, 61(12) (2010) p. 2426--2441.  ",
      "doi": "10.5555/1890706.1890712"
    },
    {
      "text": "Berlin, L. M., Jeffries, R., O'Day, V. L., Paepcke, A., & Wharton, C. Where did you put it' Issues in the design and use of a group memory. In Proc. CHI 1993. New York: ACM Press (1993) pp. 23--30.  ",
      "doi": "10.1145/169059.169063"
    },
    {
      "text": "Cutrell, E., Dumais, S. T., & Teevan, J. Searching to eliminate personal information management. Communications of the ACM, 49(1) (2006) p. 58--64.  ",
      "doi": "10.1145/1107458.1107492"
    },
    {
      "text": "Dabbish, L. A., & Kraut, R. E. Email overload at work: an analysis of factors associated with email strain. In Proc CSCW, ACM Press. (2006) p. 431--440.  ",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Ducheneaut, N., & Bellotti, V. E-mail as habitat. Interactions, 8(5) (2001) p. 30--38.  ",
      "doi": "10.1145/382899.383305"
    },
    {
      "text": "Dumais, S., Cutrell, E., Cadiz, J. J., Jancke, G., Sarin, R., & Robbins, D. C. Stuff I've seen: a system for personal information retrieval and re-use. In Proc SIGIR, ACM Press (2003) p. 72--79.  ",
      "doi": "10.1145/860435.860451"
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: eight challenges for developers. CACM, 37(1) (1994) p. 92--105.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Jones, W. Keeping Found Things Found. Morgan Kaufmann, 2010.",
      "doi": ""
    },
    {
      "text": "Kushmerick, N., Lau, T., Dredze, M., & Khoussainov, R. (2006, July). Activity-centric email: A machine learning approach. In Proc AAAI 21(2) (2006) p. 1634. ",
      "doi": "10.5555/1597348.1597459"
    },
    {
      "text": "Lutters, W. G., Ackerman, M. S., & Zhou, X. Group Information Management. In W. Jones & J. Teevan (Eds.), Personal Information Management Seattle: University of Washington Press. (pp. 236--248), 2007.",
      "doi": ""
    },
    {
      "text": "Mahmud, J., Matthews, T., Whittaker, S., Moran, T., & Lau, T. Topika: integrating collaborative sharing with email. In Proc CHI, ACM Press. (2011) p. 3161--3164.  ",
      "doi": "10.1145/1978942.1979410"
    },
    {
      "text": "Malone, T. How do people organize their desks' Implications for the design of office information systems. ACM TOIS, 1(1) (1983) p. 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Marshall, C., & Tang, J. C. That Syncing Feeling: Early user experiences with the cloud. In Proc DIS, ACM Press (2012) p. 544--553.  ",
      "doi": "10.1145/2317956.2318038"
    },
    {
      "text": "Nardi, B. A., Whittaker, S., Isaacs, E., Creech, M., Johnson, J., & Hainsworth, J. Integrating communication and information through ContactMap. CACM, 45(4) (2002) p. 89--95.  ",
      "doi": "10.1145/505248.505251"
    },
    {
      "text": "Rader, E. Yours, Mine, and (Not) Ours. Proc CHI, ACM Press (2009) 2095--2098.  ",
      "doi": "10.1145/1518701.1519019"
    },
    {
      "text": "Russell, D., & Lawrence, S. Search everything. Personal information management, (2007) 153--166.",
      "doi": ""
    },
    {
      "text": "Shami, N. S., Muller, M., & Millen, D. Browse and discover. Proc CSCW, ACM Press (2011) p. 295--304.  ",
      "doi": "10.1145/1958824.1958868"
    },
    {
      "text": "Voida, A., Olson, J. S. & Olson. G. M. Turbulence in the Clouds. In Proc CHI ACM Press (2013).",
      "doi": ""
    },
    {
      "text": "Wegner, D. M. Transactive memory: A contemporary analysis of the group mind. In Theories of group behavior (pp. 185--208). Springer New York. (1987).",
      "doi": ""
    },
    {
      "text": "Whittaker, S., & Sidner, C. Email overload: exploring personal information management of email. In Proc CHI, ACM Press (1996) p. 276--283.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Whittaker, S. Supporting collaborative task management in email. Human Computer Interaction, 20(1-2) (2005) p. 49--88.  ",
      "doi": "10.1207/s15327051hci2001%25262_3"
    },
    {
      "text": "Whittaker, S. Personal information management: from information consumption to curation. ARIST, 45(2011) p. 3--62.",
      "doi": ""
    }
  ]
}