{
  "doi": "10.1145/2556288.2557355",
  "title": "Modeling the perception of user performance",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1747-1756",
  "year": 2014,
  "badges": [],
  "abstract": "This paper studies how users perceive their own performance in two alternative user interfaces. We extend methodology from psychophysics to the study of interactive performance and conduct two experiments in order to create a model of users' perception of their own performance. In our studies, two interfaces are sequentially used in a pointing task, and users are asked to rate in which interface their performance was higher. We first differentiate the effects of objective performance (speed and accuracy) versus interface qualities (distance between elements and width of elements) on perceived performance. We then derive a model that predicts the amount of change required in an interface for users to reliably detect a difference. The model is useful as a heuristic for predicting if a new interface design is better enough for users to reliably appreciate the obtained gain in user performance. We validate the model via a separate user study, and conclude by discussing how to apply our findings to design problems.",
  "authors": [
    {
      "name": "Max Nicosia",
      "institution": "University of St Andrews, St Andrews, Fife, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959301557",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Max Planck Institute for Informatics & Saarland University, Saarbruecken, Germany",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "University of St Andrews, St Andrews, Fife, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Accot, J., and Zhai, S. Beyond Fitts' law: models for trajectory-based HCI tasks. In Proc. CHI 1997, ACM Press (1997), 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Biggs, S. J., and Srinivasan, M. A. Haptic interfaces. In Handbook of Virtual Environments, K. M. Stanney, Ed. Lawrence Earlbaum, 2002, 93--116.",
      "doi": ""
    },
    {
      "text": "Block, F., and Gellersen, H. The impact of cognitive load on the perception of time. In Proc. NordiCHI 2010, ACM Press (2010), 607--610.  ",
      "doi": "10.1145/1868914.1868985"
    },
    {
      "text": "Brewer, B. R., Fagan, M., Klatzky, R. L., and Matsuoka, Y. Perceptual limits for a robotic rehabilitation environment using visual feedback distortion. IEEE Transactions on Neural Systems and Rehabilitation Engineering 13, 1 (2005), 1--11.",
      "doi": ""
    },
    {
      "text": "Cunningham, D., and Wallraven, C. Experimental Design: From User Studies to Psychophysics. AK Peters, Ltd., 2011. ",
      "doi": "10.5555/2161896"
    },
    {
      "text": "Ganel, T., Chajut, E., and Algom, D. Visual coding for action violates fundamental psychophysical principles. Current Biology 18, 14 (2008), R599--R601.",
      "doi": ""
    },
    {
      "text": "Gephstein, S., and Banks, M. S. Viewing geometry determines how vision and haptics combine in size perception. Current Biology 13, 6 (2003), 483--488.",
      "doi": ""
    },
    {
      "text": "Grondin, S. Timing and time perception: a review of recent behavioral and neuroscience findings and theoretical directions. Attention, Perception, & Psychophysics 72, 3 (2010), 561--582.",
      "doi": ""
    },
    {
      "text": "Guiard, Y., and Olafsdottir, H. B. On the measurement of movement difficulty in the standard approach to Fitts' law. PloS ONE 6, 10 (2011), e24389.",
      "doi": ""
    },
    {
      "text": "Hamada, K., Yoshida, K., Ohnishi, K., and Koppen, M. Color effect on subjective perception of progress bar speed. In Proc. INCoS 2011, IEEE Press (2011), 863--866.  ",
      "doi": "10.1109/INCoS.2011.65"
    },
    {
      "text": "Hassenzahl, M. The thing and I: understanding the relationship between user and product. Funology (2005), 31--42. ",
      "doi": "10.5555/1139008.1139015"
    },
    {
      "text": "Law, E. L.-C., Roto, V., Hassenzahl, M., Vermeeren, A. P. O. S., and Kort, J. Understanding, scoping and defining user experience: A survey approach. In Proc. CHI 2009, ACM Press (2009), 719--728.  ",
      "doi": "10.1145/1518701.1518813"
    },
    {
      "text": "Le Gall, D. MPEG: A video compression standard for multimedia applications. Communications of the ACM 34, 4 (1991), 46--58.  ",
      "doi": "10.1145/103085.103090"
    },
    {
      "text": "Lidwell, W., Holden, K., and Butler, J. Universal Principles of Design. Rockport Publishers, 2010.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S. Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction 7, 1 (1992), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Maury, S., Athénes, S., and Chatty, S. Rhythmic menus: toward interaction based on rhythm. In Ext. Abstr. CHI 1999, ACM Press (1999), 254--255.  ",
      "doi": "10.1145/632716.632873"
    },
    {
      "text": "Nadenau, M. J., Winkler, S., Alleysson, D., and Kunt, M. Human vision models for perceptually optimized image processing - a review, 2000. Unpublished manuscript.",
      "doi": ""
    },
    {
      "text": "Rank, M., Shi, Z., J. Müller, H., and Hirche, S. Perception of delay in haptic telepresence systems. Presence: Teleoperators and Virtual Environments 19, 5 (2010), 389--399.  ",
      "doi": "10.1162/pres_a_00021"
    },
    {
      "text": "Reddy, M. Perceptually optimized 3D graphics. IEEE Computer Graphics and Applications 21, 5 (2001), 68--75.  ",
      "doi": "10.1109/38.946633"
    },
    {
      "text": "Sanders, A. F. Elements of Human Performance: Reaction Processes and Attention in Human Skill. Lawrence Erlbaum, 1998.",
      "doi": ""
    },
    {
      "text": "Seow, S. C. Designing and Engineering Time: The Psychology of Time Perception in Software. Addison-Wesley, 2008. ",
      "doi": "10.5555/1377538"
    },
    {
      "text": "Shi, Z., Hirche, S., Schneider, W. X., and Muller, H. influence of visuomotor action on visual-haptic simultaneous perception: A psychophysical study. In Proc. Haptics 2008, IEEE Press (2008), 65--70.  ",
      "doi": "10.1109/HAPTICS.2008.4479915"
    },
    {
      "text": "Soukoreff, R. W., and MacKenzie, I. S. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies 61, 6 (2004), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Stevens, S. S. On the psychophysical law. Psychological Review 64, 3 (1957), 153--181.",
      "doi": ""
    },
    {
      "text": "Yang, X. D., Bischof, W. F., and Boulanger, P. Perception of haptic force magnitude during hand movements. In Proc. ICRA 2008, IEEE Press (2008), 2061--2066.",
      "doi": ""
    },
    {
      "text": "Zanker, J. M. Does motion perception follow Weber's law? Perception 24 (1995), 363--372.",
      "doi": ""
    },
    {
      "text": "Zwicker, E., and Zwicker, U. T. Audio engineering and psychoacoustics: Matching signals to the final receiver, the human auditory system. Journal of the Audio Engineering Society 39, 3 (1991), 115--126.",
      "doi": ""
    }
  ]
}