{
  "doi": "10.1145/2556288.2557169",
  "title": "Remote handshaking: touch enhances video-mediated social telepresence",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2143-2152",
  "year": 2014,
  "badges": [],
  "abstract": "Since past studies on haptic and visual communication have tended to be isolated from each other, it has remained unclear whether a touch channel can still enrich mediated communication where video and audio channels are already available. To clarify this, we analyzed remote handshaking in which a robot hand that was attached just under a videoconferencing terminal's display moved according to the opening and closing motion of a conversation partner's hand. Combining touch and video channels raises a question as to whether the partner's action of touching a haptic device should be visible to the user. If it can be invisible, the action may be unnecessary, and a unilaterally controlled device may be enough to establish an effective touch channel. Our analysis revealed that the feeling of being close to the partner can be enhanced by mutual touch in which the partner's action needs to occur but should be invisible.",
  "authors": [
    {
      "name": "Hideyuki Nakanishi",
      "institution": "Osaka University, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100225472",
      "orcid": "missing"
    },
    {
      "name": "Kazuaki Tanaka",
      "institution": "Osaka University & Japan Science and Technology Agency, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959118857",
      "orcid": "missing"
    },
    {
      "name": "Yuya Wada",
      "institution": "Osaka University, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959341057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailenson, J.N., Yee, N., Brave, S., Merget, D. and Koslow, D. Virtual Interpersonal Touch: Expressing and Recognizing Emotions through Haptic Devices. HumanComputer Interaction, 22(3), (2007), 325--353. ",
      "doi": "10.5555/1466603.1466606"
    },
    {
      "text": "Bardeen, J.P. Interpersonal Perception through the Tactile, Verbal, and Visual Modes. International Communication Association Convention, (1971).",
      "doi": ""
    },
    {
      "text": "Basdogan, C., Ho, C., Srinivasan, M.A. and Slater, M. An Experimental Study on the Role of Touch in Shared Virtual Environments. Human-Computer Interaction, 7(4), (2000), 443--460.  ",
      "doi": "10.1145/365058.365082"
    },
    {
      "text": "Bondareva, Y. and Bouwhuis, D. Determinants of Social Presence in Videoconferencing. Proc. AVI 2004 Workshop on Environments for Personalized Information Access, (2004), 1--9.",
      "doi": ""
    },
    {
      "text": "Brave, S., Ishii, H. and Dahley, A. Tangible Interfaces for Remote Collaboration and Communication. Proc. CSCW 98, (1998), 169--178.  ",
      "doi": "10.1145/289444.289491"
    },
    {
      "text": "Brown, L.M., Sellen, A., Krishna, R. and Harper, R. Exploring the Potential of Audio-Tactile Messaging for Remote Interpersonal Communication, Proc. CHI2009, (2009), 1527--1530.  ",
      "doi": "10.1145/1518701.1518934"
    },
    {
      "text": "Caggiano, V., Fogassi, L., Rizzolatti, G., Thier, P. and Casile, A. Mirror Neurons Differentially Encode the Peripersonal and Extrapersonal Space of Monkeys. Science, 324(5925), (2009), 403--406.",
      "doi": ""
    },
    {
      "text": "Chang, A., O'Modhrain, S., Jacob, R., Gunther, E. and Ishii, H. ComTouch: Design of a Vibrotactile Communication Device. Proc. DIS 2002, (2002), 312320.  ",
      "doi": "10.1145/778712.778755"
    },
    {
      "text": "Chaplin, W.F., Phillips, J.B., Brown, J.D., Clanton, N.R. and Stein, J.L. Handshaking, Gender, Personality, and First Impressions. Journal of Personality and Social Psychology, 79(1), (2000), 110--117.",
      "doi": ""
    },
    {
      "text": "de Greef, P. and IJsselsteijn, W. Social Presence in a Home Tele-Application. CyberPsychology & Behavior, 4(2), (2001), 307--315.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J., Cutler, L.D., Arnold, P. and Eisbach, C. HandJive: A Device for Interpersonal Haptic Entertainment, Proc. CHI 98, (1998), 57--64.  ",
      "doi": "10.1145/274644.274653"
    },
    {
      "text": "Furukawa, M., Kajimoto, H. and Tachi, S. KUSUGURI: A Shared Tactile Interface for Bidirectional Tickling. Proc. AH 2012, (2012), 9:1--9:8  ",
      "doi": "10.1145/2160125.2160134"
    },
    {
      "text": "Gaver, W.W., Smets, G. and Overbeeke, K. A Virtual Window on Media Space. Proc. CHI 95, (1995), 257--264.  ",
      "doi": "10.1145/223904.223937"
    },
    {
      "text": "Haans, A. and IJsselsteijn, W Mediated Social Touch: a Review of Current Research and Future Directions. Virtual Reality, 9(2), (2006), 149--159.  ",
      "doi": "10.5555/1124635.1124640"
    },
    {
      "text": "Hashimoto, H. and Manoratkul, S. Tele-Handshake through the Internet. Proc. ROMAN 96, (1996), 90--95.",
      "doi": ""
    },
    {
      "text": "Isaacs, E.A. and Tang, J.C. What Video Can and Can't Do for Collaboration: a Case Study. Multimedia Systems, 2(2), (1994), 63--73.  ",
      "doi": "10.1007/BF01274181"
    },
    {
      "text": "Lee, M.K. and Takayama, L. 'Now, I Have a Body': Uses and Social Norms for Mobile Remote Presence in the Workplace. Proc. CHI 2011, (2011), 33--42.  ",
      "doi": "10.1145/1978942.1978950"
    },
    {
      "text": "Morikawa, O., Hashimoto, S., Munakata, T. and Okunaka, J. Embrace System for Remote Counseling. Proc. ICMI 2006, (2006), 318--325.  ",
      "doi": "10.1145/1180995.1181055"
    },
    {
      "text": "Nakanishi, H., Murakami, Y., Nogami, D. and Ishiguro, H. Minimum Movement Matters: Impact of RobotMounted Cameras on Social Telepresence. Proc. CSCW 2008, (2008), 303--312.  ",
      "doi": "10.1145/1460563.1460614"
    },
    {
      "text": "Nakanishi, H., Murakami, Y. and Kato, K. Movable Cameras Enhance Social Telepresence in Media Spaces. Proc. CHI 2009, (2009), 433--442.  ",
      "doi": "10.1145/1518701.1518771"
    },
    {
      "text": "Nakanishi, H., Kato, K. and Ishiguro, H. Zoom Cameras and Movable Displays Enhance Social Telepresence. Proc. CHI2011, (2011), 63--72.  ",
      "doi": "10.1145/1978942.1978953"
    },
    {
      "text": "Nguyen, D.T. and Canny, J. Multiview: Improving Trust in Group Video Conferencing through Spatial Faithfulness. Proc. CHI 2007, (2007), 1465--1474.  ",
      "doi": "10.1145/1240624.1240846"
    },
    {
      "text": "Nguyen, D.T. and Canny, J. More than Face-to-Face: Empathy Effects of Video Framing. Proc. CHI 2009, (2009), 423--432.  ",
      "doi": "10.1145/1518701.1518770"
    },
    {
      "text": "O'Brien, S. and Mueller, F. Holding Hands Over a Distance: Technology Probes in an Intimate, Mobile Context. Proc. OZCHI 2006, (2006), 293--296.  ",
      "doi": "10.1145/1228175.1228226"
    },
    {
      "text": "Park, Y.W., Baek, K.M. and Nam, T.J. The Roles of Touch during Phone Conversations: Long-Distance Couples' Use of POKE in Their Homes. Proc. CHI 2013, (2013), 1679--1688.  ",
      "doi": "10.1145/2470654.2466222"
    },
    {
      "text": "Prussog, A., Muhlbach, L. and Bocker, M. Telepresence in Videocommunications. Proc. Annual Meeting of Human Factors and Ergonomics Society, (1994), 25--38.",
      "doi": ""
    },
    {
      "text": "Sakamoto, D., Kanda, T., Ono, T., Ishiguro, H. and Hagita, N. Android as a Telecommunication Medium with a Human-like Presence. Proc. HRI 2007, (2007), 193--200.  ",
      "doi": "10.1145/1228716.1228743"
    },
    {
      "text": "Sallnas, E.-L., Rassmus-Grohn, K. and Sjostrom, C. Supporting Presence in Collaborative Environments by Haptic Force Feedback. Transactions on ComputerHuman Interaction, 7(4), (2000), 461--476.  ",
      "doi": "10.1145/365058.365086"
    },
    {
      "text": "Samani, H.A., Parsani, R., Rodriguez, L.T., Saadatian, E., Dissanayake, K.H. and Cheok, A.D. Kissenger: Design of a Kiss Transmission Device. Proc. DIS 2012, (2012), 48--57.  ",
      "doi": "10.1145/2317956.2317965"
    },
    {
      "text": "Shipps, E.M. and Freeman H.R. Handshake: Its Relation to First Impressions and Measured Personality Traits. Psi Chi Journal of Undergraduate Research, 8(4), (2003), 144--148.",
      "doi": ""
    },
    {
      "text": "Smith, J. and MacLean, K. Communicating Emotion through a Haptic Link: Design Space and Methodology. International Journal of Human-Computer Studies, 65(4), (2007), 376--387.  ",
      "doi": "10.1016/j.ijhcs.2006.11.006"
    },
    {
      "text": "Suhonen K., Vaananen-Vainio-Mattila, K. and Makela, K. User Experiences and Expectations of Vibrotactile, Thermal and Squeeze Feedback in Interpersonal Communication. Proc. BCS-HCI 2012, (2012), 205--214. ",
      "doi": "10.5555/2377916.2377939"
    },
    {
      "text": "Vetere, F., Gibbs, M.R., Kjeldskov, J., Howard, S., Mueller, F., Pedell, S., Mecoles, K. and Bunyan, M. Mediating Intimacy: Designing Technologies to Support Strong-Tie Relationships. Proc. CHI 2005, (2005), 471480.  ",
      "doi": "10.1145/1054972.1055038"
    },
    {
      "text": "Wang, R., Quek, F., Tatar, D., Teh, J.K.S. and Cheok, A.D. Keep in Touch: Channel, Expectation and Experience. Proc. CHI 2012, (2012), 139--148.  ",
      "doi": "10.1145/2207676.2207697"
    },
    {
      "text": "Wesson, D.A. The Handshake as Non-verbal Communication in Business. Marketing Intelligence & Planning, 10(9), (1992), 41--46.",
      "doi": ""
    }
  ]
}