{
  "doi": "10.1145/2556288.2557062",
  "title": "Offline painted media for digital animation authoring",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "321-330",
  "year": 2014,
  "badges": [],
  "abstract": "We present an animation creation workflow for integrating offline physical, painted media into the digital authoring of Flash-style animations. Generally, animators create animations with standardized digital authoring software. However, the results tend to lack the individualism or atmosphere of physical media. In contrast, illustrators have skills in painting physical media but have limited experience in animation. To incorporate their skills, we present a workflow that integrates the offline painting and digital animation creation processes in a labor-saving manner. First, a user makes a rough sketch of the visual elements and defines their movements using our digital authoring software with a sketch interface. Then these images are exported to printed pages, and users can paint using offline physical media. Finally, the work is scanned and imported back into the digital content, forming a composite animation that combines digital and physical media. We present an implementation of this system to demonstrate its workflow. We also discuss the advantages of using physical media in digital animations through design evaluations.",
  "authors": [
    {
      "name": "Makoto Nakajima",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959120057",
      "orcid": "missing"
    },
    {
      "name": "Daisuke Sakamoto",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81329491765/rel-imgonly/____________.jpg",
      "acmid": "81329491765",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "The University of Tokyo, Bunkyo-ku, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amati, C., and Brostow, G. J. Modeling 2.5d plants from ink paintings. In Proc. SBIM '10, Eurographics Association (2010), 41--48. ",
      "doi": "10.5555/1923363.1923371"
    },
    {
      "text": "Andrews, D., Baber, C., Efremov, S., and Komarov, M. Creating and using interactive narratives: reading and writing branching comics. In Proc. CHI '12, ACM (2012), 1703--1712.  ",
      "doi": "10.1145/2207676.2208298"
    },
    {
      "text": "Arai, T., Aust, D., and Hudson, S. E. Paperlink: a technique for hyperlinking from real paper to electronic content. In Proc. CHI '97, ACM (1997), 327--334.  ",
      "doi": "10.1145/258549.258782"
    },
    {
      "text": "Baecker, R. M. Picture-driven animation. In Proc. AFIPS '69 (Spring), ACM (1969), 273--288.  ",
      "doi": "10.1145/1476793.1476838"
    },
    {
      "text": "Barnes, C., Jacobs, D. E., Sanders, J., Goldman, D. B., Rusinkiewicz, S., Finkelstein, A., and Agrawala, M. Video puppetry: a performative interface for cutout animation. In Proc. SIGGRAPH Asia '08, ACM (2008), 124:1--124:9.  ",
      "doi": "10.1145/1457515.1409077"
    },
    {
      "text": "Davis, R. C., Colwell, B., and Landay, J. A. K-sketch: A 'kinetic' sketch pad for novice animators. In Proc. CHI '08, ACM (2008), 413--422.  ",
      "doi": "10.1145/1357054.1357122"
    },
    {
      "text": "Digital animation production technology society. Digital Anime Manual for Professionals. Tokyo University of Technology, 2009.",
      "doi": ""
    },
    {
      "text": "Garcia, J., Tsandilas, T., Agon, C., and Mackay, W. Interactive paper substrates to support musical creation. In Proc. CHI '12, ACM (2012), 1825--1828.  ",
      "doi": "10.1145/2207676.2208316"
    },
    {
      "text": "Garvey, G. P. Retrofitting fine art and design education in the age of computer technology. SIGGRAPH Comput. Graph. 31, 3 (Aug. 1997), 29--32.  ",
      "doi": "10.1145/262171.262184"
    },
    {
      "text": "Guimbretière, F. Paper augmented digital documents. In Proc. UIST '03, ACM (2003), 51--60.  ",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Held, R., Gupta, A., Curless, B., and Agrawala, M. 3d puppetry: a kinect-based interface for 3d animation. In Proc. UIST '12, ACM (2012), 423--434.  ",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Hertzmann, A. Tutorial: A survey of stroke-based rendering. IEEE Comput. Graph. Appl. 23, 4 (July 2003), 70--81.  ",
      "doi": "10.1109/MCG.2003.1210867"
    },
    {
      "text": "Hettiarachchi, A., Nanayakkara, S., Yeo, K. P., Shilkrot, R., and Maes, P. Fingerdraw: more than a digital paintbrush. In Proc. AH '13, ACM (2013), 1--4.  ",
      "doi": "10.1145/2459236.2459237"
    },
    {
      "text": "Hourcade, J. P., Perry, K. B., and Moore, J. L. Vuelta: creating animated characters and props using real-world objects. In Ext. Abst. of CHI '07, ACM (2007), 2429--2434.  ",
      "doi": "10.1145/1240866.1241019"
    },
    {
      "text": "Igarashi, T., Moscovich, T., and Hughes, J. F. As-rigidas-possible shape manipulation. In Proc. SIGGRAPH '05, ACM (2005), 1134--1141.  ",
      "doi": "10.1145/1186822.1073323"
    },
    {
      "text": "Johnson, W., Jellinek, H., Klotz, Jr., L., Rao, R., and Card, S. K. Bridging the paper and electronic worlds: the paper user interface. In Proc. CHI '93, ACM (1993), 507--512.  ",
      "doi": "10.1145/169059.169445"
    },
    {
      "text": "Kakehi, Y., Yamaoka, J., Akatsuka, D., and Naemura, T. Tablescape animation: a support system for making animations using tabletop physical objects. In SIGGRAPH '09 Talks, ACM (2009), 70:1--70:1.  ",
      "doi": "10.1145/1597990.1598060"
    },
    {
      "text": "Kazi, R. H., Igarashi, T., Zhao, S., and Davis, R. Vignette: interactive texture design and manipulation with freeform gestures for pen-and-ink illustration. In Proc. CHI '12, ACM (2012), 1727--1736.  ",
      "doi": "10.1145/2207676.2208302"
    },
    {
      "text": "Koga, N. Satsuei, VFX/CG Anarogu Kiso Kouza I. Special FX Studio Co. Ltd., 2012, 2.",
      "doi": ""
    },
    {
      "text": "Lee, W., Lee, G., Song, J., Lee, B., and Kim, H. Digital decal. In SIGGRAPH '09 Emerging Technologies, ACM (2009), 8:1--8:1.  ",
      "doi": "10.1145/1597956.1597964"
    },
    {
      "text": "Li, Y., Cao, X., Everitt, K., Dixon, M., and Landay, J. A. Framewire: a tool for automatically extracting interaction logic from paper prototyping tests. In Proc. CHI '10, ACM (2010), 503--512.  ",
      "doi": "10.1145/1753326.1753401"
    },
    {
      "text": "Lockwood, N., and Singh, K. Finger walking: motion editing with contact-based hand performance. In Proc. SCA '12, Eurographics Association (2012), 43--52.  ",
      "doi": "10.5555/2421731.2421739"
    },
    {
      "text": "Lu, F., Tian, F., Jiang, Y., Cao, X., Luo, W., Li, G., Zhang, X., Dai, G., and Wang, H. Shadowstory: creative and collaborative digital storytelling inspired by cultural heritage. In Proc. CHI '11, ACM (2011), 1919--1928.  ",
      "doi": "10.1145/1978942.1979221"
    },
    {
      "text": "Lu, J., Barnes, C., DiVerdi, S., and Finkelstein, A. Realbrush: painting with examples of physical media. ACM Trans. Graph. 32, 4 (July 2013), 117:1--117:12.  ",
      "doi": "10.1145/2461912.2461998"
    },
    {
      "text": "Maeda, J. Desktop, 2004. http://www.maedastudio.com/2004/desktop/.",
      "doi": ""
    },
    {
      "text": "Otsuki, M., Sugihara, K., Kimura, A., Shibata, F., and Tamura, H. Mai painting brush: an interactive device that realizes the feeling of real painting. In Proc. UIST '10, ACM (2010), 97--100.  ",
      "doi": "10.1145/1866029.1866045"
    },
    {
      "text": "Rother, C., Kolmogorov, V., and Blake, A. 'GrabCut': interactive foreground extraction using iterated graph cuts. In Proc. SIGGRAPH '04, ACM (2004), 309--314.  ",
      "doi": "10.1145/1186562.1015720"
    },
    {
      "text": "Ryokai, K., Marti, S., and Ishii, H. I/o brush: drawing with everyday objects as ink. In Proc. CHI '04, ACM (2004), 303--310.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Ryokai, K., Marti, S., and Ishii, H. Designing the world as your palette. In Ext. Abst. of CHI '05, ACM (2005), 1037--1049.  ",
      "doi": "10.1145/1056808.1056816"
    },
    {
      "text": "Schwarz, M., Isenberg, T., Mason, K., and Carpendale, S. Modeling with rendering primitives: an interactive non-photorealistic canvas. In Proc. NPAR '07, ACM (2007), 15--22.  ",
      "doi": "10.1145/1274871.1274874"
    },
    {
      "text": "Song, H., Guimbretière, F., Hu, C., and Lipson, H. Modelcraft: capturing freehand annotations and edits on physical 3d models. In Proc. UIST '06, ACM (2006), 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Stasko, J. T. Using direct manipulation to build algorithm animations by demonstration. In Proc. CHI '91, ACM (1991), 307--314.  ",
      "doi": "10.1145/108844.108930"
    },
    {
      "text": "Thomas, F., and Johnston, O. Disney Animation: The Illusion of Life. Abbeville Press, 1987.",
      "doi": ""
    },
    {
      "text": "Vandoren, P., Claesen, L., Van Laerhoven, T., Taelman, J., Raymaekers, C., Flerackers, E., and Van Reeth, F. Fluidpaint: an interactive digital painting system using real wet brushes. In Proc. ITS '09, ACM (2009), 53--56.  ",
      "doi": "10.1145/1731903.1731914"
    },
    {
      "text": "Vaucelle, C., and Ishii, H. Picture this!: film assembly using toy gestures. In Proc. UbiComp '08, ACM (2008), 350--359.  ",
      "doi": "10.1145/1409635.1409683"
    }
  ]
}