{
  "doi": "10.1145/2556288.2557046",
  "title": "3D printed interactive speakers",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1733-1742",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We propose technology for designing and manufacturing interactive 3D printed speakers. With the proposed technology, sound reproduction can easily be integrated into vari-ous objects at the design stage and little assembly is required. The speaker can take the shape of anything from an abstract spiral to a rubber duck, opening new opportunities in product design. Furthermore, both audible sound and inaudible ultrasound can be produced with the same design, allowing for identifying and tracking 3D printed objects in space using common integrated microphones. The design of 3D printed speakers is based on electrostatic loudspeaker technology first explored in the early 1930s but not broadly applied until now. These speakers are simpler than common electromagnetic speakers, while allowing for sound reproduction at 60 dB levels with arbitrary directivity ranging from focused to omnidirectional. Our research of 3D printed speakers contributes to the growing body of work exploring functional 3D printing in interactive applications.",
  "authors": [
    {
      "name": "Yoshio Ishiguro",
      "institution": "Disney Research, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461654997",
      "orcid": "missing"
    },
    {
      "name": "Ivan Poupyrev",
      "institution": "Disney Research, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593278",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, J. A., Dunphy, K., Leadbetter, J. R., Adamson, R. B. A., and Beslin, O. Fabrication and performance of a single-crystal lead magnesium niobate-lead titanate cylindrical hydrophone. The Journal of the Acoustical Society of America 134, 2 (2013), 1031--1038.",
      "doi": ""
    },
    {
      "text": "Calì, J., Calian, D. A., Amati, C., et al. 3D-printing of non-assembly, articulated models. ACM Trans. on Graphics 31, 6 (2012), 1--8.  ",
      "doi": "10.1145/2366145.2366149"
    },
    {
      "text": "Clemens, W., Fix, W., Ficker, J., Knobloch, A., and Ullmann, A. From polymer transistors toward printed electronics. Journal of Materials Research 19, 07 (2011), 1963--1973.",
      "doi": ""
    },
    {
      "text": "Economist. Print me a Stradivarius. Economist, 2011. http://www.economist.com/.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Carr, D., Lovell, E., and Ishii, H. CopyCAD: remixing physical objects with copy and paste from the real world. In Adjunct proc. UIST '10, ACM Press (2010), 381--382.  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Gong, N. W., Hodges, S., and Paradiso, J. A. Leveraging conductive inkjet technology to build a scalable and versatile surface for ubiquitous sensing. In Proc. UbiComp '11, ACM Press (2011), 45--54.  ",
      "doi": "10.1145/2030112.2030120"
    },
    {
      "text": "Gupta, S., Morris, D., Patel, S., Tan, D. SoundWave: using the doppler effect to sense gestures. In Proc. CHI '12, ACM Press (2012), 1911--1914.  ",
      "doi": "10.1145/2207676.2208331"
    },
    {
      "text": "Hanna, C. R. Theory of the electrostatic loud speaker. The Journal of the Acoustical Society of America 2, 2 (1930), 143--149.",
      "doi": ""
    },
    {
      "text": "Hodges, S., Taylor, S., Villar, N., Scott, J., and Helmes, J. Exploring physical prototyping techniques for functional devices using .NET gadgeteer. In Proc. TEI '13, ACM Press (2013), 271--274.  ",
      "doi": "10.1145/2460625.2460670"
    },
    {
      "text": "Kawahara, Y., Hodges, S., Cook, B. S., Zhang, C., and Abowd, G. D. Instant inkjet circuits. In Proc. UbiComp '13, ACM Press (2013), 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Keplinger, C., Sun, J. Y., Foo, C. C., Rothemund, P., Whitesides, G. M., Suo, Z. Stretchable, Transparent, Ionic Conductors. Science 341, 6149 (2013), 984--987.",
      "doi": ""
    },
    {
      "text": "Langevin, R. A. The Electro-Acoustic Sensitivity of Cylindrical Ceramic Tubes. The Journal of the Acoustical Society of America 26, 3 (1954), 421--427.",
      "doi": ""
    },
    {
      "text": "Lau, M., Mitani, J., and Igarashi, T. Digital Fabrication. Computer 45, 12 (2012), 76--79.  ",
      "doi": "10.1109/MC.2012.407"
    },
    {
      "text": "Leigh, S. J., Bradley, R. J., Purssell, C. P., Billson, D. R., and Hutchins, D. A. A simple, low-cost conductive composite material for 3D printing of electronic sensors. PloS one 7, 11 (2012), e49365: 1--6.",
      "doi": ""
    },
    {
      "text": "LLoyd, B., Goldman, R. B., and Roop, R. W. Design and Performance of a High-Frequency Electrostatic Speaker. The Journal of the Acoustical Society of America 27, 6 (1955), 1128--1133.",
      "doi": ""
    },
    {
      "text": "Lopes, A. J., MacDonald, E., and Wicker, R. B. Integrating stereolithography and direct print technologies for 3D structural electronics fabrication. Rapid Prototyping Journal 18, 2 (2012), 129--143.",
      "doi": ""
    },
    {
      "text": "Malone, E. and Lipson, H. Freeform fabrication of ionomeric polymer-metal composite actuators. Rapid Prototyping Journal 12, 5 (2006), 244--253.",
      "doi": ""
    },
    {
      "text": "Malone, E. and Lipson, H. Multi-material freeform fabrication of active systems. ESDA'08, ASME (2008), 1--9.",
      "doi": ""
    },
    {
      "text": "Medley, A. P., Billson, D. R., Hutchins, D. A., and Davis, L. A. J. Properties of an electrostatic transducer. The Journal of the Acoustical Society of America 120, 5 (2006), 2658--2667.",
      "doi": ""
    },
    {
      "text": "Mueller, S., Lopes, P., and Baudisch, P. Interactive construction: interactive fabrication of functional mechanical devices. In Proc. UIST '12, ACM Press (2012), 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Peek, F. W. Dielectric Phenomena in High Voltage Engineering. McGraw-Hill, 1929.",
      "doi": ""
    },
    {
      "text": "Saul, G., Lau, M., Mitani, J., and Igarashi, T. SketchChair: An All-in-one Chair Design System for End Users. In Proc. TEI '11, ACM Press (2011), 73--80.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Savage, V., Chang, C., and Hartmann, B. Sauron: Embedded Single-Camera Sensing of Printed Physical User Interfaces | EECS at UC Berkeley.",
      "doi": ""
    },
    {
      "text": "Sayin, U., Artís, P., and Guasch, O. Realization of an omnidirectional source of sound using parametric loudspeakers. The Journal of the Acoustical Society of America 134, 3 (2013), 1899--1907.",
      "doi": ""
    },
    {
      "text": "Sugimoto, T., Ono, K., Ando, A., Morita, Y., Hosoda, K., and Ishii, D. Semicylindrical acoustic transducer from a dielectric elastomer film with compliant electrodes. The Journal of the Acoustical Society of America 130, 2 (2011), 744--752.",
      "doi": ""
    },
    {
      "text": "TTPgroup. Chemical, ceramic and even biological 3D printing is now a reality as TTP unveils new multi-material breakthrough. http://www.ttpgroup.com/news/press/.",
      "doi": ""
    },
    {
      "text": "Vidimce, K., Wang, S. P., Ragan-Kelley, J., and Matusik, W. OpenFab: A programmable pipeline for multi-material fabrication. SIGGRAPH 2013, ACM Press (2013), Article 136.  ",
      "doi": "10.1145/2461912.2461993"
    },
    {
      "text": "Willis, K., Brockmeyer, E., Hudson, S., and Poupyrev, I. Printed optics. In Proc. UIST '12, ACM Press (2012), 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "STAX Ltd., http://www.stax.co.jp/.",
      "doi": ""
    }
  ]
}