{
  "doi": "10.1145/2556288.2557107",
  "title": "Jump and shoot!: prioritizing primary and alternative body gestures for intense gameplay",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "951-954",
  "year": 2014,
  "badges": [],
  "abstract": "Motion gestures enable natural and intuitive input in video games. However, game gestures designed by developers may not always be the optimal gestures for players. A key challenge in designing appropriate game gestures lies in the interaction-intensive nature of video games, i.e., several actions/commands may need to be executed concurrently using different body parts. This study analyzes user preferences in game gestures, with the aim of accommodating high interactivity during gameplay. Two user-elicitation studies were conducted: first, to determine user preferences, participants were asked to define gestures for common game actions/commands; second, to develop effective combined-gestures, participants were asked to define possible game gestures using each body part (one and two hands, one and two legs, head, eyes, and torso). Our study presents a set of suitable and alternative body parts for common game actions/commands. We also present some simultaneously applied game gestures that assist interaction in highly interactive game situations (e.g., selecting a weapon with the feet while shooting with the hand). Interesting design implications are further discussed, e.g., transferability between hand and leg gestures.",
  "authors": [
    {
      "name": "Chaklam Silpasuwanchai",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/do/10.1145/contrib-87958919157/rel-imgonly/mypersonalphoto.jpg",
      "acmid": "87958919157",
      "orcid": "missing"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kami, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bianchi-Berthouze, N. Understanding the role of body movement in player engagement. Human Computer Interaction 28, 1 (2013), 40--75.",
      "doi": ""
    },
    {
      "text": "Fothergill, S., Mentis, H., Kohli, P., and Nowozin, S. Instructing people for training gestural interactive systems. In Proc. CHI 2012, ACM (2012), 1737--1746.  ",
      "doi": "10.1145/2207676.2208303"
    },
    {
      "text": "Freeman, D., LaPierre, N., Chevalier, F., and Reilly, D. Tweetris: A study of whole-body interaction during a public art event. In Proc. C&C 2013, ACM (2013), 224--233.  ",
      "doi": "10.1145/2466627.2466650"
    },
    {
      "text": "Gamespot. Rise of Nightmares Review, 2011. http://www.gamespot.com/rise-of-nightmares/reviews/.",
      "doi": ""
    },
    {
      "text": "Gerling, K., Livingston, I., Nacke, L., and Mandryk, R. Full-body motion-based game interaction for older adults. In Proc. CHI 2012, ACM (2012), 1873--1882.  ",
      "doi": "10.1145/2207676.2208324"
    },
    {
      "text": "Isbister, K., and DiMauro, C. Waggling the Form Baton: Analyzing Body- Movement-Based Design Patterns in Nintendo Wii Games, Toward Innovation of New Possibilities for Social and Emotional Experience. In Whole Body Interaction, Springer (2011).",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Wobbrock, J. O., and Wilson, A. D. Understanding users' preferences for surface gestures. In Proc. GI 2010, CIPS (2010), 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Müller, J., Walter, R., Bailly, G., Nischt, M., and Alt, F. Looking glass: A field study on noticing interactivity of a shop window. In Proc. CHI 2012, ACM (2012), 297--306.  ",
      "doi": "10.1145/2207676.2207718"
    },
    {
      "text": "Nielsen, M., Störing, M., Moeslund, T. B., and Granum, E. A procedure for developing intuitive and ergonomic gesture interfaces for hci. In Gesture-Based Communication in Human-Computer Interaction, vol. 2915, Springer (2004), 409--420.",
      "doi": ""
    },
    {
      "text": "Nijhar, J., Bianchi-Berthouze, N., and Boguslawski, G. Does movement recognition precision affect the player experience in exertion games' In Proc. INTETAIN 2011. Springer, 2012, 73--82.",
      "doi": ""
    },
    {
      "text": "Pasch, M., Bianchi-Berthouze, N., van Dijk, B., and Nijholt, A. Movement-based sports video games: Investigating motivation and gaming experience. Entertainment Computing 1, 2 (2009), 49--61.",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O., Aung, H. H., Rothrock, B., and Myers, B. A. Maximizing the guessability of symbolic input. In Proc. CHI EA 2005, ACM (2005), 1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In Proc. CHI 2009, ACM (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    }
  ]
}