{
  "doi": "10.1145/2556288.2557089",
  "title": "Depth perception with gaze-contingent depth of field",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "217-226",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Blur in images can create the sensation of depth because it emulates an optical property of the eye; namely, the limited depth of field created by the eye's lens. When the human eye looks at an object, this object appears sharp on the retina, but objects at different distances appear blurred. Advances in gaze-tracking technologies enable us to reproduce dynamic depth of field in regular displays, providing an alternative way of conveying depth. In this paper we investigate gaze-contingent depth of field as a method to produce realistic 3D images, and analyze how effectively people can use it to perceive depth. We found that GC DOF increases subjective perceived realism and depth and can contribute to the perception of ordinal depth and distance between objects, but it is limited in its accuracy.",
  "authors": [
    {
      "name": "Michael Mauderer",
      "institution": "University of St. Andrews, St. Andrews, Fife, United Kingdom",
      "img": "/do/10.1145/contrib-86158705157/rel-imgonly/michaelmauderer.jpg",
      "acmid": "86158705157",
      "orcid": "missing"
    },
    {
      "name": "Simone Conte",
      "institution": "University of St. Andrews, St. Andrews, Fife, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959078657",
      "orcid": "missing"
    },
    {
      "name": "Miguel A. Nacenta",
      "institution": "University of St. Andrews, St. Andrews, Fife, United Kingdom",
      "img": "/do/10.1145/contrib-81100377766/rel-imgonly/dsc_7149-small.png",
      "acmid": "81100377766",
      "orcid": "missing"
    },
    {
      "name": "Dhanraj Vishwanath",
      "institution": "University of St Andrews, St Andrews, Fife, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100451836",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blum, T., Wieczorek, M., Aichert, A., Tibrewal, R., and Navab, N. The effect of out-of-focus blur on visual discomfort when using stereo displays. In Proc. ISMAR, IEEE (2010), 13--17.",
      "doi": ""
    },
    {
      "text": "Brooker, J. P., and Sharkey, P. M. Operator performance evaluation of controlled depth of field in a stereographically displayed virtual environment. In Proc of Electronic Imaging, SPIE (2001), 408--417.",
      "doi": ""
    },
    {
      "text": "Cook, R. L., Porter, T., and Carpenter, L. Distributed ray tracing. In Proc. SIGGRAPH, vol. 18, ACM (1984), 137--145.  ",
      "doi": "10.1145/800031.808590"
    },
    {
      "text": "Cutting, J. E., and Vishton, P. M. Perceiving layout and knowing distances: The integration, relative potency, and contextual use of different information about depth. In Perception of Space and Motion. AP, 1995, 69--117.",
      "doi": ""
    },
    {
      "text": "Georgiev, Todor and Yu, Zhan and Lumsdaine, Andrew and Goma, S. Lytro camera technology: Theory, algorithms, performance analysis. In Proc. of Electronic Imaging, SPIE (2013), 86671J--86671J.",
      "doi": ""
    },
    {
      "text": "Held, R. T., Cooper, E. a., and Banks, M. S. Blur and disparity are complementary cues to depth. Current Biology 22, 5 (2012), 426--31.",
      "doi": ""
    },
    {
      "text": "Held, R. T., Cooper, E. A., Banks, M. S., and O'Brien, J. F. Using blur to affect perceived distance and size. In Transactions on Graphics, ACM (2010), 19.  ",
      "doi": "10.1145/1731047.1731057"
    },
    {
      "text": "Hillaire, S., Lécuyer, A., Cozot, R., and Casiez, G. Depth-of-field blur effects for first-person navigation in virtual environments. CG&A (2008), 47--55.  ",
      "doi": "10.1109/MCG.2008.113"
    },
    {
      "text": "Hillaire, S., Lecuyer, A., Cozot, R., and Casiez, G. Using an eye-tracking system to improve camera motions and depth-of-field blur effects in virtual environments. In Proc. VR, IEEE (2008), 47--50.",
      "doi": ""
    },
    {
      "text": "Jung, Y., Sohn, H., Lee, S.-i., Speranza, F., and Ro, Y. Visual importance - and discomfort region-selective low-pass filtering for reducing visual discomfort in stereoscopic displays. In TCSVT, IEEE (2013).",
      "doi": ""
    },
    {
      "text": "Kolb, C., Mitchell, D., and Hanrahan, P. A realistic camera model for computer graphics. In Proc. SIGGRAPH, ACM (1995), 317--324.  ",
      "doi": "10.1145/218380.218463"
    },
    {
      "text": "Kosara, R., Miksch, S., and Hauser, H. Semantic depth of field. In Proc. InfoVis, IEEE (2001), 97. ",
      "doi": "10.5555/580582.857724"
    },
    {
      "text": "Lambooij, M., IJsselsteijn, W., Fortuin, M., and Heynderickx, I. Visual discomfort and visual fatigue of stereoscopic displays: A review. Journal of Imaging Science and Technology 53, 3 (2009), 30201--1.",
      "doi": ""
    },
    {
      "text": "Leroy, L., Fuchs, P., and Moreau, G. Real-time adaptive blur for reducing eye strain in stereoscopic displays. In TAP, ACM (2012), 9.  ",
      "doi": "10.1145/2207216.2207220"
    },
    {
      "text": "Leroy, L., Fuchs, P., and Moreau, G. Visual fatigue reduction for immersive stereoscopic displays by disparity, content, and focus-point adapted blur. In TIE, IEEE (2012), 3998--4004.",
      "doi": ""
    },
    {
      "text": "Mantiuk, R., Bazyluk, B., and Tomaszewska, A. Gaze-dependent depth-of-field effect rendering in virtual environments. In Proc. SGDA, vol. 6944, Springer (2011), 1--12.  ",
      "doi": "10.1007/978-3-642-23834-5_1"
    },
    {
      "text": "Marshall, J. a., Burbeck, C. a., Ariely, D., Rolland, J. P., and Martin, K. E. Occlusion edge blur: A cue to relative visual depth. JOSA A 13, 4 (1996), 681--8.",
      "doi": ""
    },
    {
      "text": "Mather, G. Image blur as a pictorial depth cue. Royal Society of London Proceedings Series B 263, 1367 (1996), 169--72.",
      "doi": ""
    },
    {
      "text": "Mather, G. The use of image blur as a depth cue. Perception 26, 9 (1997), 1147--58.",
      "doi": ""
    },
    {
      "text": "Mather, G., and Smith, D. R. Combining depth cues: Effects upon accuracy and speed of performance in a depth-ordering task. Vision Research 44, 6 (2004), 557--562.",
      "doi": ""
    },
    {
      "text": "Mather, G., and Smith, D. R. R. Blur discrimination and its relation to blur-mediated depth perception. Perception 31, 10 (2002), 1211--1219.",
      "doi": ""
    },
    {
      "text": "Nefs, H. T. Depth of field affects perceived depth-width ratios in photographs of natural scenes. Seeing and Perceiving 25, 6 (2012), 577--595.",
      "doi": ""
    },
    {
      "text": "O'Shea, R. P., Govan, D. G., and Sekuler, R. Blur and contrast as pictorial depth cues. Perception 26, 5 (1997), 599--612.",
      "doi": ""
    },
    {
      "text": "Otani, K., Yoshida, T., Nii, H., and Kawakami, N. Active focus control with eye gaze detection for depth cognition. In Proc. ASIAGRAPH (2008).",
      "doi": ""
    },
    {
      "text": "Potmesil, M., and Chakravarty, I. A lens and aperture camera model for synthetic image generation. In Proc. SIGGRAPH, ACM (1981), 297--305.  ",
      "doi": "10.1145/800224.806818"
    },
    {
      "text": "Richards, W. Stereopsis and stereoblindness. Experimental Brain Research 10, 4 (1970), 380--8.",
      "doi": ""
    },
    {
      "text": "Rokita, P. Generating depth of-field effects in virtual reality applications. CG&A (1996), 18--21.  ",
      "doi": "10.1109/38.486676"
    },
    {
      "text": "Schaeffel, F., Wilhelm, H., and Zrenner, E. Inter-individual variability in the dynamics of natural accommodation in humans: relation to age and refractive errors. The Journal of Physiology 32 (1993), 301--320.",
      "doi": ""
    },
    {
      "text": "Sun, G., and Holliman, N. Evaluating methods for controlling depth perception in stereoscopic cinematography. In Proc. SD&A, SPIE (2009).",
      "doi": ""
    },
    {
      "text": "Temme, L. A., and Morris, A. Speed of accommodation and age. Optometry & Vision Science (1989).",
      "doi": ""
    },
    {
      "text": "Toyoura, M., Kashiwagi, K., Sugiura, A., and Mao, X. Mono-glass for providing distance information for people losing sight in one eye. In Proc. VRCAI, ACM (2012), 39.  ",
      "doi": "10.1145/2407516.2407526"
    },
    {
      "text": "Vishwanath, D., and Blaser, E. Retinal blur and the perception of egocentric distance. Journal of Vision 10 (2010), 1--16.",
      "doi": ""
    },
    {
      "text": "Vishwanath, D., and Hibbard, P. B. Seeing in 3-D with just one eye: Stereopsis without binocular vision. Psychological Science (2013).",
      "doi": ""
    },
    {
      "text": "Wang, J., Barkowsky, M., Ricordel, V., and Le Callet, P. Quantifying how the combination of blur and disparity affects the perceived depth. In Proc. Electronic Imaging, SPIE (2011).",
      "doi": ""
    },
    {
      "text": "Watt, S. J., Akeley, K., Ernst, M. O., and Banks, M. S. Focus cues affect perceived depth. Journal of Vision 5, 10 (2005), 834--62.",
      "doi": ""
    },
    {
      "text": "Witt, J. K., Proffitt, D. R., and Epstein, W. Tool use affects perceived distance, but only when you intend to use it. Journal of Experimental Psychology: Human Perception and Performance 31, 5 (2005), 880.",
      "doi": ""
    }
  ]
}