{
  "doi": "10.1145/2556288.2557218",
  "title": "MotionMontage: a system to annotate and combine motion takes for 3D animations",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2017-2026",
  "year": 2014,
  "badges": [],
  "abstract": "We present MotionMontage, a system for recording multiple motion takes of a rigid virtual object and compositing them together into a montage. Our system incorporates a Kinect-based performance capture setup that allows animators to create 3D animations by tracking the motion of a rigid physical object and mapping it in realtime onto a virtual object. The animator then temporally annotates the best parts of each take. MotionMontage merges the annotated motions into a single composite montage using a combination of dynamic time warping and optimization of a Semi-Markov Conditional Random Field. Our system also supports the creation of layered animations in which multiple objects are moving at the same time. To aid the animator in coordinating the motions of the objects we provide spatial markers which indicate the positions of previously recorded objects at user-specified points in time. We perform a user study to evaluate the perceived quality of the montages created with our system and find that viewers (including both the original animators and new viewers) generally prefer the animation montage to any individual take.",
  "tags": [
    "montage",
    "animation",
    "active visual feedback",
    "depth camera"
  ],
  "authors": [
    {
      "name": "Ankit Gupta",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548841956",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Brian Curless",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100587184",
      "orcid": "missing"
    },
    {
      "name": "Michael Cohen",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406592138",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Human benchmark - reaction time statistics. www.humanbenchmark.com/tests/reactiontime.",
      "doi": ""
    },
    {
      "text": "Agarwala, A., Dontcheva, M., Agrawala, M., Drucker, S., Colburn, A., Curless, B., Salesin, D., and Cohen, M. Interactive digital photomontage. In ACM SIGGRAPH 2004 Papers, SIGGRAPH '04, ACM (New York, NY, USA, 2004), 294--302.  ",
      "doi": "10.1145/1186562.1015718"
    },
    {
      "text": "Arikan, O., Forsyth, D. A., and O'Brien, J. F. Motion synthesis from annotations. ACM Trans. Graph. 22, 3 (July 2003), 402--408.  ",
      "doi": "10.1145/882262.882284"
    },
    {
      "text": "Barnes, C., Jacobs, D. E., Sanders, J., Goldman, D. B., Rusinkiewicz, S., Finkelstein, A., and Agrawala, M. Video puppetry: a performative interface for cutout animation. In ACM SIGGRAPH Asia 2008 papers, SIGGRAPH Asia '08, ACM (New York, NY, USA, 2008), 124:1--124:9.  ",
      "doi": "10.1145/1457515.1409077"
    },
    {
      "text": "Boykov, Y., Veksler, O., and Zabih, R. Fast approximate energy minimization via graph cuts. IEEE Trans. Pattern Anal. Mach. Intell. 23, 11 (Nov. 2001), 1222--1239.  ",
      "doi": "10.1109/34.969114"
    },
    {
      "text": "Dontcheva, M., Yngve, G., and Popović, Z. Layered acting for character animation. In ACM SIGGRAPH 2003 Papers, SIGGRAPH '03, ACM (New York, NY, USA, 2003), 409--416.  ",
      "doi": "10.1145/1201775.882285"
    },
    {
      "text": "Gleicher, M. Motion editing with spacetime constraints. In Proceedings of the 1997 symposium on Interactive 3D graphics, I3D '97, ACM (New York, NY, USA, 1997), 139--ff.  ",
      "doi": "10.1145/253284.253321"
    },
    {
      "text": "Gupta, A., Fox, D., Curless, B., and Cohen, M. Duplotrack: a real-time system for authoring and guiding duplo block assembly. In Proceedings of the 25th annual ACM symposium on User interface software and technology, UIST '12, ACM (New York, NY, USA, 2012), 389--402.  ",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Held, R., Gupta, A., Curless, B., and Agrawala, M. 3d-puppetry: a kinect-based interface for 3d animation. In Proceedings of the 25th annual ACM symposium on User interface software and technology, UIST '12, ACM (New York, NY, USA, 2012), 423--434.  ",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Koller, D., and Friedman, N. Probabilistic Graphical Models: Principles and Techniques. MIT Press, 2009. ",
      "doi": "10.5555/1795555"
    },
    {
      "text": "Kovar, L., and Gleicher, M. Flexible automatic motion blending with registration curves. In Proceedings of the 2003 ACM SIGGRAPH/Eurographics symposium on Computer animation, SCA '03, Eurographics Association (Aire-la-Ville, Switzerland, Switzerland, 2003), 214--224. ",
      "doi": "10.5555/846276.846307"
    },
    {
      "text": "Kovar, L., Gleicher, M., and Pighin, F. Motion graphs. In Proceedings of the 29th annual conference on Computer graphics and interactive techniques, SIGGRAPH '02, ACM (New York, NY, USA, 2002), 473--482.  ",
      "doi": "10.1145/566570.566605"
    },
    {
      "text": "LoBrutto, V. Stanley kubrick: a biography. Da Capo Press, Incorporated (1999), page 430.",
      "doi": ""
    },
    {
      "text": "Myers, C. S., and Rabiner, L. R. Comparative Study of Several Dynamic Time-Warping Algorithms for Connected-Word Recognition. The Bell System Technical Journal 60, 7 (1981).",
      "doi": ""
    },
    {
      "text": "Pérez, P., Gangnet, M., and Blake, A. Poisson image editing. In ACM SIGGRAPH 2003 Papers, SIGGRAPH '03, ACM (New York, NY, USA, 2003), 313--318.  ",
      "doi": "10.1145/1201775.882269"
    },
    {
      "text": "Rubin, S., Berthouzoz, F., Mysore, G. J., Li, W., and Agrawala, M. Content-based tools for editing audio stories. In Proceedings of the 26th annual ACM symposium on User interface software and technology, ACM (2013), 113--122.  ",
      "doi": "10.1145/2501988.2501993"
    },
    {
      "text": "Ruegg, J., Wang, O., Smolic, A., Gross, M., Auzinger, T., Guthe, M., and Jeschke, S. Ducttake: Spatiotemporal video compositing. Computer Graphics Forum (Proceedings of EUROGRAPHICS 2013) 32, 2 (May 2013).",
      "doi": ""
    },
    {
      "text": "Sarawagi, S., and Cohen, W. W. Semi-markov conditional random fields for information extraction. In In Advances in Neural Information Processing Systems 17 (2004), 1185--1192.",
      "doi": ""
    },
    {
      "text": "Shoemake, K. Animating rotation with quaternion curves. In Proceedings of the 12th annual conference on Computer graphics and interactive techniques, SIGGRAPH '85, ACM (New York, NY, USA, 1985), 245--254.  ",
      "doi": "10.1145/325334.325242"
    },
    {
      "text": "Shotton, J., Fitzgibbon, A., Cook, M., Sharp, T., Finocchio, M., Moore, R., Kipman, A., and Blake, A. Real-time human pose recognition in parts from single depth images. In Proceedings of the 2011 IEEE Conference on Computer Vision and Pattern Recognition, CVPR '11, IEEE Computer Society (Washington, DC, USA, 2011), 1297--1304.  ",
      "doi": "10.1109/CVPR.2011.5995316"
    },
    {
      "text": "Sturman, D. J. Computer puppetry. IEEE Comput. Graph. Appl. 18, 1 (Jan. 1998), 38--45.  ",
      "doi": "10.1109/38.637269"
    }
  ]
}