{
  "doi": "10.1145/2556288.2557367",
  "title": "HCI as a means to prosociality in the economy",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2955-2964",
  "year": 2014,
  "badges": [],
  "abstract": "HCI research often involves intervening in the economic lives of people, but researchers only rarely give explicit consideration to what actually constitutes prosociality in the economy. Much has been said previously regarding sustainability but this has largely focused on environmental rather than interpersonal relations. This paper provides an analysis of how prosocial HCI has been discussed and continues to be defined as a research field. Based on a corpus of published works, we describe a variety of genres of work relating to prosocial HCI. Key intellectual differences are explored, including the epistemological and ethical positions involved in designing for prosocial outcomes as well as how HCI researchers posit economic decision-making. Finally, emerging issues and opportunities for further debate and collaboration are discussed in turn.",
  "tags": [
    "prosocial",
    "economic anthropology",
    "hci"
  ],
  "authors": [
    {
      "name": "John Harvey",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959331357",
      "orcid": "missing"
    },
    {
      "name": "David Golightly",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100587672",
      "orcid": "missing"
    },
    {
      "name": "Andrew Smith",
      "institution": "The University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958768357",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, R. E., Brunette, W., Johnson, E., Lustig, C. Poon, A., Putnam, C., Salihbaeva, O., Kolko, B.E. and Borriello, G. (2010) Experiences with a transportation information system that uses only GPS and SMS. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10).  ",
      "doi": "10.1145/2369220.2369223"
    },
    {
      "text": "Anokwa, Y., Smyth, T.N., Ramachandran, D., Sherwani, J., Schwartzman, Y., Luk, R., Ho, M.R., Moraveji, N. and DeRenzi, B. (2009) Stories from the Field: Reflections on HCI4D Experiences. Information Technologies and International Development. 5, 101--116",
      "doi": ""
    },
    {
      "text": "J. Antin, E. H. Chi, J. Howison, S. Paul, A. Shaw, and J. Yew. (2011) Apples to oranges : comparing across studies of open collaboration/peer production. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration, WikiSym '11, pages 227--228,  ",
      "doi": "10.1145/2038558.2038610"
    },
    {
      "text": "Aoki, P. M., Honicky, R. J., Mainwaring, A., Myers, C., Paulos, E., Subramanian, S., and Woodruff, A. (2009). A vehicle for research: using street sweepers to explore the landscape of environmental community action. Proc CHI'09. ACM, 375--384.  ",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Bardzell, J., Bardzell, S., DiSalvo, C., Gaver, W. and Sengers, P. (2012) The humanities and/in HCI. In CHI '12 Extended Abstracts on Human Factors in Computing Systems(CHI EA '12). ACM, New York, NY, USA, 1135-1138  ",
      "doi": "10.1145/2212776.2212405"
    },
    {
      "text": "Bardzell, S. (2010) Feminist HCI: taking stock and outlining an agenda for design. In Proc. CHI '10, ACM, NY, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Batson, C. D., and Shaw, L.L. (1991) Encouraging words concerning the evidence for altruism. Psychological Inquiry, 2, 159--168.",
      "doi": ""
    },
    {
      "text": "Bell, G., M. Blythe, and P. Sengers. (2005) Making by making strange: Defamiliarization and the design of domestic technology. ACM Transactions on Computer Human Interaction (TOCHI), 12, 2, 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Bell, G., Blythe, M., Sengers, P., Wright, P. (2003). \"Designing culturally situated technologies for the home.\" CHI Extended Conference Abstracts. ACM Press, 1062--1063.  ",
      "doi": "10.1145/765891.766149"
    },
    {
      "text": "Blevis, E. (2007) \"Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse,\" in Proceedings of the SICCHI Conference on Human Factors in Computing Systems, San Jose, CA, April 28-May 3, pp. 503--512  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Boehner, K. DePaula, R., Dourish, P. & Sengers, P. (2005). Affect: from information to interaction. In Bertelsen, O. et al. (eds). Critical Computing Between sense and sensibility, ACM, pp. 59--68  ",
      "doi": "10.1145/1094562.1094570"
    },
    {
      "text": "Botsman, R. & Rogers, R. (2010) What's mine is yours: The rise of Collaborative Consumption, Harper Business",
      "doi": ""
    },
    {
      "text": "Brynjarsdottir, H., Håkansson, M., Pierce, J., Baumer, E., DiSalvo, C. and Sengers, P. (2012) Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, 947--956  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Buchenau, M. and Suri, J. F. (2000) Experience prototyping. In Proc. DIS 2000, ACM Press, 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Buechley, L., Rosner, D. K., Paulos, E. and Williams, A. (2009) DIY for CHI: methods, communities, and values of reuse and customization. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, 4823--4826.  ",
      "doi": "10.1145/1520340.1520750"
    },
    {
      "text": "Busse, D.K., Borning, A., Mann, S., Hirsch, T., Nathan, L.P., Parker, A.G., Shneiderman, B. and Nunez, B. (2013) CHI at the barricades: an activist agenda? CHI '13 Extended Abstracts on Human Factors in Computing Systems 2407--2412.  ",
      "doi": "10.1145/2468356.2468787"
    },
    {
      "text": "Cervantes, R., Warschauer, M., Nardi, B. and Sambasivan, N. (2011) Infrastructures for low-cost laptop use in Mexican schools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11) 945--954.  ",
      "doi": "10.1145/1978942.1979082"
    },
    {
      "text": "Chambers, R. (2006) Participatory mapping and geographic information systems: whose map? Who is empowered and who disempowered? Who gains and who loses? The Electronic Journal of Information Systems in Developing Countries",
      "doi": ""
    },
    {
      "text": "Choe, E.K., Jung, J., Lee, B., Fisher, K. (2013). Nudging People Away From Privacy-Invasive Mobile Apps Through Visual Framing. In the Proceedings of the 14th IFIP TC13 International Conference on Human-Computer Interaction",
      "doi": ""
    },
    {
      "text": "Cialdini, R. B., Schaller, M., Houlihan, D., Arps, K. Fultz, J. (1987) Empathy based helping: Is it selflessly or selfishly motivated?, Journal of Personality and Social Psychology, Vol. 52, No. 4, 749--758",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Klasnja, P., McDonald, D.W., Avrahami, D., Froehlich, J., LeGrand, L., Libby, R., Mosher, K., & Landay, J.A. (2008) Flowers or a Robot Army? Encouraging Awareness & Activity with Personal, Mobile Displays, Proceedings of UbiComp 2008, 54--63.  ",
      "doi": "10.1145/1409635.1409644"
    },
    {
      "text": "Consolvo, S., McDonald, D.W., and Landay, J. (2009) Theory driven design strategies for technologies that support behavior change in everyday life. CHI'09, 405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Cruikshank, B. (1999) The will to empower: Democratic citizens and other subjects, Cornell University Press",
      "doi": ""
    },
    {
      "text": "Deterding, S., Sicart, M., Nacke, L., O'Hara, K., Dixon, D. (2011) Gamification. using game-design elements in nongaming contexts, Proc of the 2011 annual conference extended abstracts on Human factors in computing systems  ",
      "doi": "10.1145/1979742.1979575"
    },
    {
      "text": "DiSalvo, C., Sengers, P. and Brynjarsdóttir, H. (2010) Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "DiSalvo, C., Boehner, K., Knouf, N. A., and Sengers, P. 2009. Nourishing the ground for sustainable HCI: considerations from ecologically engaged art. Proc CHI '09. ACM, 385--394.  ",
      "doi": "10.1145/1518701.1518763"
    },
    {
      "text": "Dombrowski, L., Brubaker, J.R., Hirano, S.H., Mazmanian, M. and Hayes, G.R. (2013) It takes a network to get dinner: designing location-based systems to address local food needs. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13). ACM, New York, NY, USA, 519--528  ",
      "doi": "10.1145/2493432.2493493"
    },
    {
      "text": "Dourish, P. (2010) HCI and environmental sustainability:The politics of design and the design of politics. Proc DIS '10. ACM, 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Eisenberg, N., Miller, P. A. (1987) The relation of empathy to prosocial and related behaviors. Psychological Bulletin, Vol. 101(1) 91--119",
      "doi": ""
    },
    {
      "text": "Erete, S.L. (2013) Protecting the home: exploring the roles of technology and citizen activism from a burglar's perspective. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13)ACM, New York, 2507--2516.  ",
      "doi": "10.1145/2470654.2481347"
    },
    {
      "text": "Escobedo, M. A., and Best, M. L. (2003). Convivo Communicator: An interface-adaptive VoIP system for poor quality networks. Journal of Information Communication and Ethics in Society, 1,167--180.",
      "doi": ""
    },
    {
      "text": "Flatla, D.R., Gutwin, C., Nacke, L.E., Bateman, S. and Mandryk, R.L. (2011) Calibration games: making calibration tasks enjoyable by adding motivating game elements. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11) 403--412.  ",
      "doi": "10.1145/2047196.2047248"
    },
    {
      "text": "Fogg, B.J. (2003). Persuasive technology: Using computers to change what we think and do. Morgan Kaufmann. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Forlizzi, J. and DiSalvo, C. (2006). \"Assistive Robots and Domestic Environments: A Study of the Roomba Vacuum in the Home.\" Proceedings of HRI06, 258--265  ",
      "doi": "10.1145/1121241.1121286"
    },
    {
      "text": "Fuchs, C. and Obrist, M. (2010) HCI and society: Towards a typology of universal design principles. In: International Journal of HCI, 638--656.",
      "doi": ""
    },
    {
      "text": "Geertz, C. (1957) Ritual and Social Change: A Javanese Example. American Anthropologist, 59(1), 32--54.",
      "doi": ""
    },
    {
      "text": "Geertz, C. (1963) Peddlers and Princes. University of Chicago Press, Chicago",
      "doi": ""
    },
    {
      "text": "Gitau, S., Plattiga, P., & Diga, K. (2010). ICTD Research by Africans: Origins, Interests, and Impact. Proceedings of ICTD 2010.",
      "doi": ""
    },
    {
      "text": "Goecks, J., Voida, A., Voida, S. and Mynatt, E.D. (2008) Charitable Technologies: Opportunities for Collaborative Computing in Nonprofit Fundraising, Proc. CSCW 2008  ",
      "doi": "10.1145/1460563.1460669"
    },
    {
      "text": "Gomez, R., Bayo, I., Reed, P.J., Wang, C. and Silva, M. (2013) Fearless cards: addressing emotional barriers to computer learning among extremely marginalized populations. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM 631--636.  ",
      "doi": "10.1145/2468356.2468468"
    },
    {
      "text": "Goodman, E. (2009). Three environmental discourses in human-computer interaction. Proc CHI EA '09. ACM, New York, NY, 2535--2544.  ",
      "doi": "10.1145/1520340.1520358"
    },
    {
      "text": "Graeber, D. (2001) Toward an anthropological theory of value: The false coin of our own dreams. Palgrave Macmillan",
      "doi": ""
    },
    {
      "text": "Hanks, K., Odom, W., Roedl, D. and Blevis, E. (2008) Sustainable millennials: attitudes towards sustainability and the material effects of interactive technologies. InProceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 333--342.  ",
      "doi": "10.1145/1357054.1357111"
    },
    {
      "text": "Hann, C. (2010) 'Moral economy' in Keith Hart, JeanLouis Laville and Antonio David Cattani (eds.), The Human Economy; A Citizen's Guide. Cambridge: Polity, pp. 187--98.",
      "doi": ""
    },
    {
      "text": "Hann, K. & Hart, K. (2011) Economic Anthropology, Polity Press, Cambridge",
      "doi": ""
    },
    {
      "text": "Hart, K. (1973) Informal income opportunities and urban employment in Ghana. Journal of Modern African Studies 11, 61--89",
      "doi": ""
    },
    {
      "text": "Harvey, J., Golightly, D., Smith, A. (2013) Sharing and Human-Computer Interaction, Proceedings of 27th International British Computer Society Human Computer Interaction Conference:.",
      "doi": ""
    },
    {
      "text": "Harvey, J., Golightly, D., & Rahemtulla, H., (2011). The role of Intermediaries in designing effective Participatory GIS: a Usability Investigation in partnership with Mapping for Change. AGI GeoCommunity 2011.",
      "doi": ""
    },
    {
      "text": "Hekler, E., Klasnja, P., Froehlich, J., and Buman, M. (2013) Mind the Theoretical Gap: Interpreting, Using, and Developing Behavioral Theory in HCI Research. In ACM CHI (Paris, France, 2013).  ",
      "doi": "10.1145/2470654.2466452"
    },
    {
      "text": "Ho, M., Smyth, T., Kam, M. and Dearden, A., (2010) Human-Computer Interaction for Development: The Past, Present and Future, Information Technologies and International Development 5, 4",
      "doi": ""
    },
    {
      "text": "Huh, J., Nathan, L.P., Silberman, S. Blevis, E., Tomlinson, B., Sengers, P. and Busse, D. (2010) Examining appropriation, re-use, and maintenance for sustainability. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, New York, NY, USA, 4457--4460.  ",
      "doi": "10.1145/1753846.1754173"
    },
    {
      "text": "Huh, J., Nam, K., & Sharma, N. (2010) Finding the lost treasure: understanding reuse of used computing devices. In Proc. CHI '10. 1875--1878  ",
      "doi": "10.1145/1753326.1753607"
    },
    {
      "text": "IJsselsteijn et al, (2006) Preface, Proceedings of the First international conference on Persuasive technology for human well-being ",
      "doi": "10.5555/1986822"
    },
    {
      "text": "Irani, L. and Silberman, M. (2013) Turkopticon: Interrupting worker invisibility in amazon mechanical turk. In Proceeding of the Annual ACM SIGCHI Conference on Human Factors in Computing Systems  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K. and Grinter, R.E. (2010) Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Judge, T.K., Neustaedter, C. and Kurtz, A.F. (2010) The Family Window: The Design and Evaluation of a Domestic Media Space,\" Proc. of CHI'10, ACM, 2361--2370.  ",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Kahneman, D. (2003). Maps of bounded rationality: Psychology for behavioral economics. American Economic Review, 1449--1475.",
      "doi": ""
    },
    {
      "text": "Kleine, D. and Unwin, T. (2009). Technological revolution, evolution and new dependencies: What's new about ICT4D? Third World Quarterly, 30(5), 1045--1067.",
      "doi": ""
    },
    {
      "text": "Korn O. (2012) Industrial playgrounds: how gamification helps to enrich work for elderly or impaired persons in production. In Proceedings of the 4th ACM SIGCHI symposium on Engineering interactive computing systems (EICS '12). ACM, New York, NY, USA, 313--316  ",
      "doi": "10.1145/2305484.2305539"
    },
    {
      "text": "Le Dantec, C.A., Farrell, R.G., Christensen, J.E., (2011) Publics in practice: Ubiquitous computing at a shelter for homeless mothers. In Proc. CHI 2011, ACM , 1687--1696.  ",
      "doi": "10.1145/1978942.1979189"
    },
    {
      "text": "Le Dantec, C.A. and Edwards, W.K. (2008) Designs on dignity: Perceptions of technology among the homeless. In Proc. CHI 2008, ACM, 627--636.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Le Dantec, C.A. Participation and publics: supporting community engagement. (2012) In Proc. of the SIGCHI conf.on Human Factors in Computing Systems (CHI '12). 2012. ACM, New York, NY, USA, 1351--1360  ",
      "doi": "10.1145/2207676.2208593"
    },
    {
      "text": "Lee, M., Kiesler, S., and Forlizzi, J. (2011). Mining behavioral economics to design persuasive technology for healthy choices. CHI'11, 325--334.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Lindtner, S., Anderson, K. and Dourish, P. (2012) Cultural appropriation: information technologies as sites of transnational imagination. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 77--86.  ",
      "doi": "10.1145/2145204.2145220"
    },
    {
      "text": "Ling, K., G. Beenen, P. Ludford, X. Wang, K. Chang, X. Li, D. Cosley, D. Frankowski, L. Terveen, A. M. Rashid, P. Resnick, R. Kraut. (2005) Using social psychology to motivate contribution to online communities. J. Comput.Mediated Comm.10(4).",
      "doi": ""
    },
    {
      "text": "Lomas, D., Kumar, A., Patel, K., Ching, D. Lakshmanan, M., Kam, M. and Forlizzi, J.L. (2013) The power of play: design lessons for increasing the lifespan of outdated computers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13) ACM, New York,2735--2744.  ",
      "doi": "10.1145/2470654.2481379"
    },
    {
      "text": "Ma, M., R. Agarwal. 2007. Through a glass darkly: Information technology design, identity verification, and knowledge contribution in online communities. Inform. Systems Res. 18(1) 42--67.  ",
      "doi": "10.1287/isre.1070.0113"
    },
    {
      "text": "Mahelaqua, Basson, S., Rajput, N., Shrivastava, K., Srivastava, S. and Thomas, J.C. (2013) Communityoriented spoken web browser for low iiterate users. InProceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM,  ",
      "doi": "10.1145/2441776.2441833"
    },
    {
      "text": "Marcoux J.S. (2009), \"Escaping the Gift Economy,\" Journal of Consumer Research, 40 (December)",
      "doi": ""
    },
    {
      "text": "Norman, D. (2004) Emotional Design: Why We Love (or Hate) Everyday Things. Basic Books",
      "doi": ""
    },
    {
      "text": "Obrist, M.,Fuchs, C. (2010) Broadening the View: HumanComputer Interaction & Critical Theory, CHI '10, Atlanta, GA, USA",
      "doi": ""
    },
    {
      "text": "Paruthi, G. and Thies, W. (2011) Utilizing DVD players as low-cost offline internet browsers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI '11). ACM, New York, NY, USA, 955--958.  ",
      "doi": "10.1145/1978942.1979083"
    },
    {
      "text": "Philip, K., Irani, L., and Dourish, P. (2012) Postcolonial Computing: A Tactical Survey. Science, Technology, and Human Values. 37(1), 3--29",
      "doi": ""
    },
    {
      "text": "Polanyi, K. (1944) The great transformation: The political and economic origins of our times. Beacon, Boston.",
      "doi": ""
    },
    {
      "text": "Purpura, S., Schwanda, V., Williams, K., et al.(2011). Fit4Life: The design of a persuasive technology promoting healthy behavior and ideal weight. CHI'11, 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Raiti, G. The lost sheep of ICT4D Research, Information Technologies and International Development, Volume 3, Number 4, Summer 2006, 1--7  ",
      "doi": "10.1162/itid.2007.3.4.1"
    },
    {
      "text": "Ramchurn, S. D., Huynh, T.D., Venanzi, M. and Shi, B. (2013) Collabmap: crowdsourcing maps for emergency planning. In, ACM Web Science, Paris, 10pp.  ",
      "doi": "10.1145/2464464.2464508"
    },
    {
      "text": "Rashid, A.M., Ling, K., Tassone, R.D., Resnick, P., Kraut, R., and Riedl, J. (2006) Motivating participation by displaying the value of contribution. Proc. CHI 2006, ACM Press  ",
      "doi": "10.1145/1124772.1124915"
    },
    {
      "text": "Revelle, G., A. Fenwick-Naditch, et al. (2010). CHI 2010 special interest group: Creating prosocial media for children. CHI 2010, Atlanta, ACM Press  ",
      "doi": "10.1145/1753846.1753952"
    },
    {
      "text": "Roberson, J. and Nardi, B. (2010) Survival needs and social inclusion: Technology use among the homeless. In Proc. CSCW 2010, ACM 445--448.  ",
      "doi": "10.1145/1718918.1718993"
    },
    {
      "text": "Rodden, T. (1991) A survey of CSCW systems, interacting with Computers, Volume 3, Issue 3, Pages 319--353",
      "doi": ""
    },
    {
      "text": "Rode, J.A. (2011) A Theoretical Agenda for Feminist HCI. Interacting with Computers. 23, 5, 393--400  ",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Rotman, D., Vieweg, S. Yardi, S., Chi, E., Preece, J., Shneiderman, B., Pirolli, P. and Glaisyer, T. (2011) From slacktivism to activism: participatory culture in the age of social media. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 819--822  ",
      "doi": "10.1145/1979742.1979543"
    },
    {
      "text": "Sambasivan, N., Weber, S. and Cutrell, E. (2011) Designing a phone broadcasting system for urban sex workers in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 267--276.  ",
      "doi": "10.1145/1978942.1978980"
    },
    {
      "text": "Sambasivan, N. and Cutrell, E. (2012) Understanding negotiation in airtime sharing in low-income microenterprises. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, 791--800.  ",
      "doi": "10.1145/2207676.2207791"
    },
    {
      "text": "Sen, A. (1999). Development as Freedom (p. 384). New York: Alfred A. Knopf.",
      "doi": ""
    },
    {
      "text": "Schumacher, E. F. (1973). Small is beautiful: A study of economics as if people mattered. London:Harper & Row.",
      "doi": ""
    },
    {
      "text": "Shroff, G. and Kam, M. (2011) Towards a design model for women's empowerment in the developing world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11) ACM, New York, 2867--2876.  ",
      "doi": "10.1145/1978942.1979368"
    },
    {
      "text": "Starbird, K. (2013) Delivering patients to sacré coeur: collective intelligence in digital volunteer communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, 801--810.  ",
      "doi": "10.1145/2470654.2470769"
    },
    {
      "text": "Starbird, K. and Palen, L. (2011) \"Voluntweeters\": selforganizing by digital volunteers in times of crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11) ACM, New York, 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Sterling, R., O'Brien, J., & Bennett, J. K. (2007). Advancement through interactive radio. Proceedings of the international conference on information and communication technologies and development,68--75.",
      "doi": ""
    },
    {
      "text": "Taylor, A., Swann, L. (2005). \"Artful Systems in The Home\". CHI 2005 Conference Proceedings. New York: ACM Press, 641--650  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Thaler, R.H. & Sunstein, C.R. (2008) Nudge: Improving decisions about health, wealth, and happiness",
      "doi": ""
    },
    {
      "text": "Torrey, C., Burke, M., Lee, M., Dey, A., Fussell, S. and Kiesler, S. (2007) Connected Giving: Ordinary People Coordinating Disaster Relief on the Internet, HumanComputer Interaction Institute. Paper 51.",
      "doi": ""
    },
    {
      "text": "Tscheligi, M. and Reitberger, W. (2007) Persuasion as an ingredient of societal interfaces. interactions, 14(5), 41--43.  ",
      "doi": "10.1145/1288515.1288538"
    },
    {
      "text": "UN Dept. for Social and Economic Affairs. (2007). Compendium of ICT Applications on Electronic Government, Volume 1: Mobile Applications on Health & Learning, ST/ESA/PAD/SER.E/113, 1, p. 35.",
      "doi": ""
    },
    {
      "text": "Vasalou, A., Joinson, A., & Pitt, J. (2006). The role of shame, guilt and embarrassment in online social dilemmas.",
      "doi": ""
    },
    {
      "text": "Vasalou, A., Hopfensitz, A., & Pitt, J. V. (2008). In praise of forgiveness: Ways for repairing trust breakdowns in oneoff online interactions. International Journal of HumanComputer Studies, 66, 466--480.  ",
      "doi": "10.1016/j.ijhcs.2008.02.001"
    },
    {
      "text": "Vasalou, A., Riegelsberger, J., & Joinson, A. (2009) The application of forgiveness in social system design. Conference on Human Factors in Computing Systems  ",
      "doi": "10.1145/1518701.1518738"
    },
    {
      "text": "Vertesi, J., Lindtner, S., and Shklovski, I. (2011) Transnational HCI: humans, computers, and interactions in transnational contexts. In CHI '11 Extended Abstracts on Human Factors in Computing Systems NY, 61--64.  ",
      "doi": "10.1145/1979742.1979584"
    },
    {
      "text": "Wilson, Ernest J. (2004). The information revolution and developing countries. Cambridge, Mass.: MIT Press. ",
      "doi": "10.5555/861471"
    },
    {
      "text": "Wright, P. and McCarthy, J. (2008) Empathy and experience in HCI. In Proc. of CHI 2008, ACM Press  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "Woelfer, J.P. and Hendry, D.G. Homeless young people's experiences with information systems: Life and work in a community technology center. In Proc. CHI 2010, ACM (2010), 1291--1300.  ",
      "doi": "10.1145/1753326.1753520"
    },
    {
      "text": "Woelfer, J.P., Iverson, A., Hendry, D.G., Friedman, B., and Gill, B.T. Improving the safety of homeless young people with mobile phones: Values, form and function. In Proc. CHI 2011, ACM (2011), 1707--1716.  ",
      "doi": "10.1145/1978942.1979191"
    },
    {
      "text": "Wyche, S. P. and Chetty, M. (2013) \"I want to imagine how that place looks\": designing technologies to support connectivity between africans living abroad and home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2755--2764.  ",
      "doi": "10.1145/2470654.2481381"
    },
    {
      "text": "Wyche, S. P. and Murphy. L.L. (2013) Powering the cellphone revolution: findings from mobile phone charging trials in off-grid Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1959--1968.  ",
      "doi": "10.1145/2470654.2466260"
    },
    {
      "text": "Yarosh, S., Cuzzort, S., Müller, H. and Abowd, G. Developing a Media Space for Remote Synchronous Parent-Child Interaction Proc. of Interaction Design and Children (IDC '09), ACM, 2009, 97--105.  ",
      "doi": "10.1145/1551788.1551806"
    },
    {
      "text": "Chiou, W. B. and Wan, P. H. (2012) A new look at software piracy: Soft lifting primes an inauthentic sense of self, prompting further unethical behavior, International Journal of Human-Computer Studies, Volume 70 Issue  ",
      "doi": "10.1016/j.ijhcs.2011.09.001"
    }
  ]
}