{
  "doi": "10.1145/2556288.2557405",
  "title": "Permulin: mixed-focus collaboration on multi-view tabletops",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3191-3200",
  "year": 2014,
  "badges": [],
  "abstract": "We contribute Permulin, an integrated set of interaction and visualization techniques for multi-view tabletops to support co-located collaboration across a wide variety of collaborative coupling styles. These techniques (1) provide support both for group work and for individual work, as well as for the transitions in-between, (2) contribute sharing and peeking techniques to support mutual awareness and group coordination during phases of individual work, (3) reduce interference during group work on a group view, and (4) directly integrate with conventional multi-touch input. We illustrate our techniques in a proof-of-concept implementation with the two example applications of map navigation and photo collages. Results from two user studies demonstrate that Permulin supports fluent transitions between individual and group work and exhibits unique awareness properties that allow participants to be highly aware of each other during tightly coupled collaboration, while being able to unobtrusively perform individual work during loosely coupled collaboration.",
  "authors": [
    {
      "name": "Roman Lissermann",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81467669368/rel-imgonly/profilbild.jpg",
      "acmid": "81467669368",
      "orcid": "missing"
    },
    {
      "name": "Jochen Huber",
      "institution": "MIT Media Lab & Singapore University of Technology and Design, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81435602593/rel-imgonly/hp1.png",
      "acmid": "81435602593",
      "orcid": "missing"
    },
    {
      "name": "Martin Schmitz",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-87958634757/rel-imgonly/martin_foto.jpg",
      "acmid": "87958634757",
      "orcid": "0000-0002-7332-3287"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Max Planck Institute for Informatics, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Technische Universität Darmstadt, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    }
  ],
  "references": [
    {
      "text": "Agrawala, M. et al. The two-user Responsive Workbench: support for collaboration through individual views of a shared space. In Proc. SIGGRAPH '97, 327--332.  ",
      "doi": "10.1145/258734.258875"
    },
    {
      "text": "Bolton, J. et al. A comparison of competitive and cooperative task performance using spherical and flat displays. In Proc. CSCW '12, 529--538.  ",
      "doi": "10.1145/2145204.2145286"
    },
    {
      "text": "Gutwin, C. and Greenberg, S. Design for individuals, design for groups. In Proc. CSCW '98, 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Isenberg, P. et al. Co-located collaborative visual analytics around a tabletop display. IEEE transactions on visualization and computer graphics. 18, 5 (May. 2012), 689--702.  ",
      "doi": "10.1109/TVCG.2011.287"
    },
    {
      "text": "Izadi, S. et al. Going beyond the display: a surface technology with an electronically switchable diffuser. In Proc. UIST '08, 269--278.  ",
      "doi": "10.1145/1449715.1449760"
    },
    {
      "text": "Kakehi, Y. and Naemura, T. UlteriorScape: Interactive optical superimposition on a view-dependent tabletop display. In IEEE TABLETOP '08, 189--192.",
      "doi": ""
    },
    {
      "text": "Karnik, A. MUSTARD: a multi user see through AR display. In Proc. CHI '12, 2541--2550.  ",
      "doi": "10.1145/2207676.2208641"
    },
    {
      "text": "Karnik, A. et al. PiVOT : Personalized View-Overlays for Tabletops. In Proc. UIST '12, 271--280.  ",
      "doi": "10.1145/2380116.2380151"
    },
    {
      "text": "Kiesler, S. and Cummings, J.N. 2002. What Do We Know about Proximity and Distance in Work Groups? A Legacy of Research. P.J. Hinds & S. Kiesler (Eds), Distributed work. MIT Press.",
      "doi": ""
    },
    {
      "text": "Kim, S. et al. Enabling concurrent dual views on common LCD screens. In Proc. CHI '12, 2175--2184.  ",
      "doi": "10.1145/2207676.2208369"
    },
    {
      "text": "Kitamura, Y. et al. A display table for strategic collaboration preserving private and public information. In Proc. ICEC'05, 167--179.  ",
      "doi": "10.1007/11558651_17"
    },
    {
      "text": "Kitamura, Y. et al. Interactive stereoscopic display for three or more users. In Proc. SIGGRAPH '01, 231--240.  ",
      "doi": "10.1145/383259.383285"
    },
    {
      "text": "Kulik, A. et al. C1x6: A Stereoscopic Six-User Display for Co-located Collaboration in Shared Virtual Environments. In Proc. SA '11, 188:1--188:12.  ",
      "doi": "10.1145/2024156.2024222"
    },
    {
      "text": "Lissermann, R. et al. Permulin: Collaboration on Interactive Surfaces with Personal In- and Output. In Proc. CHI EA '13 , 1533--1538.  ",
      "doi": "10.1145/2468356.2468630"
    },
    {
      "text": "Matsushita, M. et al. Lumisight Table:A face-to-face collaboration support system that optimizes direction of projected information to each stakeholder. In Proc. CSCW '04, 274--283.  ",
      "doi": "10.1145/1031607.1031653"
    },
    {
      "text": "Matusik, W. et al. Multiview user interfaces with an automultiscopic display. In Proc. AVI '08, 363--366.  ",
      "doi": "10.1145/1385569.1385634"
    },
    {
      "text": "Mistry, P. ThirdEye: a technique that enables multiple viewers to see different content on a single display screen. In Proc. SA '09, 1--1.  ",
      "doi": "10.1145/1666778.1666807"
    },
    {
      "text": "Morris, M.R. et al. Mediating group dynamics through tabletop interface design. IEEE Computer Graphics and Applications. 26, 5 (2006), 65--73.  ",
      "doi": "10.1109/MCG.2006.114"
    },
    {
      "text": "Peterka, T. et al. Dynallax: solid state dynamic parallax barrier autostereoscopic VR display. In Proc. IEEE Virtual Reality '07, 155--162.",
      "doi": ""
    },
    {
      "text": "Ryall, K. et al. Exploring the effects of group size and table size on interactions with tabletop shared-display groupware. In Proc. CSCW '04, 284--293.  ",
      "doi": "10.1145/1031607.1031654"
    },
    {
      "text": "Sakurai, S. et al. 2008. Visibility control using revolving polarizer. In IEEE Workshop on Horizontal Interactive Human Computer Systems, 161--168.",
      "doi": ""
    },
    {
      "text": "Schmidt, K. and Simonee, C. Coordination mechanisms: Towards a conceptual foundation of CSCW systems design. In Proc. CSCW '96, 155--200.  ",
      "doi": "10.1007/BF00133655"
    },
    {
      "text": "Scott, S.D. et al. Territoriality in collaborative tabletop workspaces. In Proc. CSCW '04, 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Shoemaker, G.B.D. and Inkpen, K.M. Single Display Privacyware: Augmenting Public Displays with Private Information. In Proc. CHI '01, 522--529.  ",
      "doi": "10.1145/365024.365349"
    },
    {
      "text": "Sugimoto, M. et al. Caretta: a system for supporting face-to-face collaboration by integrating personal and shared spaces. In Proc. CHI '04, 41--48.  ",
      "doi": "10.1145/985692.985698"
    },
    {
      "text": "Tang, A. et al. Collaborative coupling over tabletop displays. In Proc. CHI '06, 1181--1190.  ",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "Tse, E. et al. Avoiding Interference: How People Use Spatial Separation and Partitioning in SDG Workspaces. In Proc. CSCW '04, 252--261.  ",
      "doi": "10.1145/1031607.1031647"
    },
    {
      "text": "Wigdor, D. et al. WeSpace: the design development and deployment of a walk-up and share multi-surface visual collaboration system. In Proc. CHI 09, 1237-- 1246.  ",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Wu, X. and Zhai, G. 2012. Temporal Psychovisual Modulation: a new paradigm of information display. CoRR.",
      "doi": ""
    },
    {
      "text": "Xiao, Y. Artifacts and collaborative work in healthcare: methodological, theoretical, and technological implications of the tangible. Journal of Biomedical Informatics. 38, 1 (2005), 26--33.  ",
      "doi": "10.1016/j.jbi.2004.11.004"
    },
    {
      "text": "Zanella, A. and Greenberg, S. Reducing interference in single display groupware through transparency. In Proc. ECSCW'01, 339--358. ",
      "doi": "10.5555/1241867.1241885"
    }
  ]
}