{
  "doi": "10.1145/2556288.2556986",
  "title": "Crowdsourcing step-by-step information extraction to enhance existing how-to videos",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "4017-4026",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Millions of learners today use how-to videos to master new skills in a variety of domains. But browsing such videos is often tedious and inefficient because video player interfaces are not optimized for the unique step-by-step structure of such videos. This research aims to improve the learning experience of existing how-to videos with step-by-step annotations. We first performed a formative study to verify that annotations are actually useful to learners. We created ToolScape, an interactive video player that displays step descriptions and intermediate result thumbnails in the video timeline. Learners in our study performed better and gained more self-efficacy using ToolScape versus a traditional video player. To add the needed step annotations to existing how-to videos at scale, we introduce a novel crowdsourcing workflow. It extracts step-by-step structure from an existing video, including step times, descriptions, and before and after images. We introduce the Find-Verify-Expand design pattern for temporal and visual annotation, which applies clustering, text processing, and visual analysis algorithms to merge crowd output. The workflow does not rely on domain-specific customization, works on top of existing videos, and recruits untrained crowd workers. We evaluated the workflow with Mechanical Turk, using 75 cooking, makeup, and Photoshop videos on YouTube. Results show that our workflow can extract steps with a quality comparable to that of trained annotators across all three domains with 77% precision and 81% recall.",
  "tags": [
    "video annotation.",
    "crowdsourcing",
    "how-to videos"
  ],
  "authors": [
    {
      "name": "Juho Kim",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    },
    {
      "name": "Phu Tran Nguyen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557618556",
      "orcid": "missing"
    },
    {
      "name": "Sarah Weir",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959018657",
      "orcid": "missing"
    },
    {
      "name": "Philip J. Guo",
      "institution": "University of Rochester & Massachusetts Institute of Technology, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315488891",
      "orcid": "missing"
    },
    {
      "name": "Robert C. Miller",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100162232",
      "orcid": "missing"
    },
    {
      "name": "Krzysztof Z. Gajos",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Altman, D. G. Practical statistics for medical research, vol. 12. CRC Press, 1991.",
      "doi": ""
    },
    {
      "text": "Bandura, A. Self-ef'cacy: toward a unifying theory of behavioral change. Psychological review 84, 2 (1977), 191.",
      "doi": ""
    },
    {
      "text": "Banovic, N., Grossman, T., Matejka, J., and Fitzmaurice, G. Waken: Reverse engineering usage information and interface structure from software videos. In UIST'12 (2012).  ",
      "doi": "10.1145/2380116.2380129"
    },
    {
      "text": "Bernstein, M. S., Brandt, J., Miller, R. C., and Karger, D. R. Crowds in two seconds: Enabling realtime crowd-powered interfaces. In UIST'11, ACM (2011).  ",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., Crowell, D., and Panovich, K. Soylent: a word processor with a crowd inside. In UIST'10 (2010), 313'322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Bernstein, M. S., Teevan, J., Dumais, S., Liebling, D., and Horvitz, E. Direct answers for search queries in the long tail. In CHI'12 (2012), 237'246.  ",
      "doi": "10.1145/2207676.2207710"
    },
    {
      "text": "Catrambone, R. The subgoal learning model: Creating better examples so that students can solve novel problems. Journal of Experimental Psychology: General 127, 4 (1998), 355.",
      "doi": ""
    },
    {
      "text": "Chi, P.-Y., Ahn, S., Ren, A., Dontcheva, M., Li, W., and Hartmann, B. Mixt: Automatic generation of step-by-step mixed media tutorial. In UIST'12 (2012).  ",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Chi, P.-Y. P., Liu, J., Linder, J., Dontcheva, M., Li, W., and Hartmann, B. Democut: generating concise instructional videos for physical demonstrations. In UIST'13, ACM (2013).  ",
      "doi": "10.1145/2501988.2502052"
    },
    {
      "text": "Dow, S. P., Glassco, A., Kass, J., Schwarz, M., Schwartz, D. L., and Klemmer, S. R. Parallel prototyping leads to better design results, more divergence, and increased self-ef'cacy. ACM Trans. Comput.-Hum. Interact. 17, 4 (Dec. 2010), 18:1--18:24.  ",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Eiriksdottir, E., and Catrambone, R. Procedural instructions, principles, and examples: how to structure instructions for procedural tasks to enhance performance, learning, and transfer. Hum Factors 53, 6 (2011), 749--70.",
      "doi": ""
    },
    {
      "text": "Ester, M., Kriegel, H.-P., Sander, J., and Xu, X. A density-based algorithm for discovering clusters in large spatial databases with noise. In KDD, vol. 96 (1996).",
      "doi": "10.5555/3001460.3001507"
    },
    {
      "text": "Ferguson, E. L., and Hegarty, M. Learning with real machines or diagrams: application of knowledge to real-world problems. Cognition and Instruction 13, 1 (1995), 129--160.",
      "doi": ""
    },
    {
      "text": "Grabler, F., Agrawala, M., Li, W., Dontcheva, M., and Igarashi, T. Generating photo manipulation tutorials by demonstration. In SIGGRAPH'09 (2009), 1--9.  ",
      "doi": "10.1145/1576246.1531372"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. Chronicle: capture, exploration, and playback of document workflow histories. In UIST'10 (2010).  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Hadidi, R., and Sung, C.-H. Students' acceptance of web-based course offerings: an empirical assessment. AMCIS 1998 (1998).",
      "doi": ""
    },
    {
      "text": "Jaro, M. A. Advances in record-linkage methodology as applied to matching the 1985 census of tampa, 'orida. Journal of the American Statistical Association 84, 406 (1989), 414--420.",
      "doi": ""
    },
    {
      "text": "Kim, J. Toolscape: enhancing the learning experience of how-to videos. In CHI EA'13 (2013), 2707--2712.  ",
      "doi": "10.1145/2468356.2479497"
    },
    {
      "text": "Kuhn, H. W. The hungarian method for the assignment problem. Naval research logistics quarterly 2, 1--2 (1955), 83--97.",
      "doi": ""
    },
    {
      "text": "Lafreniere, B., Grossman, T., and Fitzmaurice, G. Community enhanced tutorials: improving tutorials with multiple demonstrations. In CHI'13 (2013), 1779--1788.  ",
      "doi": "10.1145/2470654.2466235"
    },
    {
      "text": "Lasecki, W. S., Song, Y. C., Kautz, H., and Bigham, J. P. Real-time crowd labeling for deployable activity recognition. In CSCW'13 (2013), 1203--1212.  ",
      "doi": "10.1145/2441776.2441912"
    },
    {
      "text": "Li, F. C., Gupta, A., Sanocki, E., He, L.-w., and Rui, Y. Browsing digital video. In CHI'00, ACM (2000).  ",
      "doi": "10.1145/332040.332425"
    },
    {
      "text": "Nguyen, P., Kim, J., and Miller, R. C. Generating annotations for how-to videos using crowdsourcing. In CHI EA'13, ACM (2013), 835--840.  ",
      "doi": "10.1145/2468356.2468506"
    },
    {
      "text": "Noronha, J., Hysen, E., Zhang, H., and Gajos, K. Z. Platemate: crowdsourcing nutritional analysis from food photographs. In UIST'11 (2011), 1--12.  ",
      "doi": "10.1145/2047196.2047198"
    },
    {
      "text": "Park, S., Mohammadi, G., Artstein, R., and Morency, L.-P. Crowdsourcing micro-level multimedia annotations: The challenges of evaluation and interface. In CrowdMM Workshop (2012).  ",
      "doi": "10.1145/2390803.2390816"
    },
    {
      "text": "Pongnumkul, S., Dontcheva, M., Li, W., Wang, J., Bourdev, L., Avidan, S., and Cohen, M. Pause-and-play: Automatically linking screencast video tutorials with applications. In UIST 2011 (2011).  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Schunk, D. Goal setting and self-ef'cacy during self-regulated learning. Educational psychologist 25, 1 (1990), 71--86.",
      "doi": ""
    },
    {
      "text": "Tversky, B., Morrison, J. B., and Betrancourt, M. Animation: can it facilitate' International journal of human-computer studies 57, 4 (2002), 247--262.  ",
      "doi": "10.1006/ijhc.2002.1017"
    },
    {
      "text": "van der Meij, H., Blijleven, P., and Jansen, L. What makes up a procedure' Content & Complexity (2003).",
      "doi": ""
    },
    {
      "text": "Vondrick, C., Ramanan, D., and Patterson, D. Ef'ciently scaling up video annotation with crowdsourced marketplaces. In ECCV 2010. Springer, 2010, 610--623. ",
      "doi": "10.5555/1888089.1888136"
    },
    {
      "text": "Yuen, J., Russell, B., Liu, C., and Torralba, A. Labelme video: Building a video database with human annotations. In ICCV 2009, IEEE (2009), 1451--1458.",
      "doi": ""
    },
    {
      "text": "Zhang, D., Zhou, L., Briggs, R. O., and Jr., J. F. N. Instructional video in e-learning: Assessing the impact of interactive video on learning effectiveness. Information & Management 43, 1 (2006), 15--27.  ",
      "doi": "10.5555/1140892.1709370"
    },
    {
      "text": "Zimmerman, B. J., Bandura, A., and Martinez-Pons, M. Self-motivation for academic attainment: The role of self-ef'cacy beliefs and personal goal setting. American Educational Research Journal 29, 3 (1992), 663--676.",
      "doi": ""
    }
  ]
}