{
  "doi": "10.1145/2556288.2557172",
  "title": "Mechanical force redistribution: enabling seamless, large-format, high-accuracy surface interaction",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "4137-4146",
  "year": 2014,
  "badges": [],
  "abstract": "We present Mechanical Force Redistribution (MFR): a method of sensing which creates an anti-aliased image of forces applied to a surface. This technique mechanically focuses the force from a surface onto adjacent discrete forcels (force sensing cells) by way of protrusions (small bumps or pegs), allowing for high-accuracy interpolation between adjacent discrete forcels. MFR works with any force transducing technique or material, including force variable resistive inks, piezoelectric materials and capacitive force plates. MFR sensors can be tiled such that the signal is continuous across contiguous tiles. By minimizing active materials and computational complexity, MFR makes large-format interactive walls, collaborative tabletops and high-resolution floor tiles possible and economically feasible.",
  "authors": [
    {
      "name": "Alex M. Grau",
      "institution": "Tactonic Technologies LLC, Long Island City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416604520",
      "orcid": "missing"
    },
    {
      "name": "Charles Hendee",
      "institution": "Tactonic Technologies LLC, Long Island City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416609292",
      "orcid": "missing"
    },
    {
      "name": "John-Ross Rizzo",
      "institution": "Tactonic Technologies LLC, Long Island City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959085557",
      "orcid": "missing"
    },
    {
      "name": "Ken Perlin",
      "institution": "New York University, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100250413",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AARP. Digital health insights report for the 50+ market. Startup + Health (2013).",
      "doi": ""
    },
    {
      "text": "Addlesee, M., Jones, A., Livesey, F., and Samaria, F. The orl active 'oor {sensor system}. Personal Communications, IEEE 4, 5 (1997), 35'41.",
      "doi": ""
    },
    {
      "text": "Ashby, M., and Johnson, K. Materials and Design: The Art and Science of Material Selection in Product Design. Elsevier Science, 2009.",
      "doi": ""
    },
    {
      "text": "Augsten, T., Kaefer, K., Meusel, R., Fetzer, C., Kanitz, D., Stoff, T., Becker, T., Holz, C., and Baudisch, P. Multitoe: high-precision interaction with back-projected 'oors based on high-resolution multi-touch input. In Proceedings of the 23nd annual ACM symposium on User interface software and technology, UIST '10, ACM (New York, NY, USA, 2010), 209'218.  ",
      "doi": "10.1145/1866029.1866064"
    },
    {
      "text": "Baker, R. Gait analysis methods in rehabilitation. Journal of NeuroEngineering and Rehabilitation 3'4 (2006).",
      "doi": ""
    },
    {
      "text": "Brand, R. A. Can biomechanics contribute to clinical orthopaedic assessments. Iowa Orthopaedic Journal 9:61'64 (1987).",
      "doi": ""
    },
    {
      "text": "Branzel, A., Holz, C., Hoffmann, D., Schmidt, D., Knaust, M., Luhne, P., Meusel, R., Richter, S., and Baudisch, P. Gravityspace: Tracking users and their poses in a smart room using a 2d pressure-sensing 'oor. In CHI '13 Extended Abstracts on Human Factors in Computing Systems, CHI '13 (2013).  ",
      "doi": "10.1145/2470654.2470757"
    },
    {
      "text": "Davidson, P. L., and Han, J. Y. Extending 2d object arrangement with pressure-sensitive layering cues. In Proceedings of the 21st annual ACM symposium on User interface software and technology, UIST '08, ACM (New York, NY, USA, 2008), 87'90.  ",
      "doi": "10.1145/1449715.1449730"
    },
    {
      "text": "Dietz, P., Raskar, R., Booth, S., van Baar, J., Wittenburg, K., and Knep, B. Multi-projectors and implicit interaction in persuasive public displays. In Proceedings of the working conference on Advanced visual interfaces, AVI '04, ACM (New York, NY, USA, 2004), 209'217.  ",
      "doi": "10.1145/989863.989898"
    },
    {
      "text": "Eventoff, F. Electronic pressure sensitive transducer apparatus. US Patent No. 4314227 (1979).",
      "doi": ""
    },
    {
      "text": "Gong, N.-W., Hodges, S., and Paradiso, J. A. Leveraging conductive inkjet technology to build a scalable and versatile surface for ubiquitous sensing. In Proceedings of the 13th international conference on Ubiquitous computing, UbiComp '11, ACM (New York, NY, USA, 2011), 45'54.  ",
      "doi": "10.1145/2030112.2030120"
    },
    {
      "text": "Han, J. Y. Low-cost multi-touch sensing through frustrated total internal re'ection. In Proceedings of the 18th annual ACM symposium on User interface software and technology, UIST '05, ACM (New York, NY, USA, 2005), 115'118.  ",
      "doi": "10.1145/1095034.1095054"
    },
    {
      "text": "Hillis, W. D. A high resolution imaging touch sensor. International Journal of Robotics Research (1982), 1, 2, 33'44.",
      "doi": ""
    },
    {
      "text": "Moeller, J., and Kerne, A. Zerotouch: an optical multi-touch and free-air interaction architecture. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, CHI '12, ACM (New York, NY, USA, 2012), 2165'2174.  ",
      "doi": "10.1145/2207676.2208368"
    },
    {
      "text": "Papakostas, T., Lima, J., and Lowe, M. A large area force sensor for smart skin applications. In Sensors, 2002. Proceedings of IEEE, vol. 2 (2002), 1620'1624 vol.2.",
      "doi": ""
    },
    {
      "text": "Paradiso, J., Abler, C., Hsiao, K.-y., and Reynolds, M. The magic carpet: physical sensing for immersive environments. In CHI '97 Extended Abstracts on Human Factors in Computing Systems, CHI EA '97, ACM (New York, NY, USA, 1997), 277'278.  ",
      "doi": "10.1145/1120212.1120391"
    },
    {
      "text": "Puers, R. Capacitive sensors: when and how to use them. Sensors and Actuators 37'38 (1993), 93'105.",
      "doi": ""
    },
    {
      "text": "Rangarajan, S., Kidane, A., Qian, G., Rajko, S., and Birchfield, D. The design of a pressure sensing 'oor for movement-based human computer interaction. In Proceedings of the 2nd European conference on Smart sensing and context, EuroSSC'07, Springer-Verlag (Berlin, Heidelberg, 2007), 46'61. ",
      "doi": "10.5555/1775377.1775382"
    },
    {
      "text": "Rekimoto, J. Smartskin: an infrastructure for freehand manipulation on interactive surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '02, ACM (New York, NY, USA, 2002), 113'120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Rendl, C., Greindl, P., Haller, M., Zirkl, M., Stadlober, B., and Hartmann, P. Pyzo'ex: printed piezoelectric pressure sensing foil. In Proceedings of the 25th annual ACM symposium on User interface software and technology, UIST '12, ACM (New York, NY, USA, 2012), 509'518.  ",
      "doi": "10.1145/2380116.2380180"
    },
    {
      "text": "Richardson, B., Leydon, K., Fernstrom, M., and Paradiso, J. A. Z-tiles: building blocks for modular, pressure-sensing 'oorspaces. In CHI '04 Extended Abstracts on Human Factors in Computing Systems, CHI EA '04, ACM (New York, NY, USA, 2004), 1529'1532.  ",
      "doi": "10.1145/985921.986107"
    },
    {
      "text": "Rosenberg, I., and Perlin, K. The unmousepad: an interpolating multi-touch force-sensing input pad. ACM Trans. Graph. 28, 3 (July 2009), 65:1'65:9.  ",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "Rottler, N., and Kemps, B. Synaptics forcepad technology chosen for prestigious uist contest. Synaptics Press Release (2012).",
      "doi": ""
    },
    {
      "text": "Slobodin, D. E., and Westhues, J. Projected capacitive touch sensing. US Patent No. 20110096025 (2010).",
      "doi": ""
    },
    {
      "text": "Wilson, A. D., and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology, UIST '10, ACM (New York, NY, USA, 2010), 273'282.  ",
      "doi": "10.1145/1866029.1866073"
    }
  ]
}