{
  "doi": "10.1145/2556288.2557285",
  "title": "Does content determine information popularity in social media?: a case study of youtube videos' content and their popularity",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "979-982",
  "year": 2014,
  "badges": [],
  "abstract": "We here investigate what drives the popularity of information on social media platforms. Focusing on YouTube, we seek to understand the extent to which content by itself determines a video's popularity. Using mechanical turk as experimental platform, we asked users to evaluate pairs of videos, and compared users' relative perception of the videos' content against their relative popularity reported by YouTube. We found that in most evaluations users could not reach consensus on which video had better content as their perceptions tend to be very subjective. Nevertheless, when consensus was reached, the video with preferred content almost always achieved greater popularity on YouTube, highlighting the importance of content in driving information popularity on social media.",
  "authors": [
    {
      "name": "Flavio Figueiredo",
      "institution": "Universidade Federal de Minas Gerais, Belo Horizonte, Minas Gerais, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447593431",
      "orcid": "missing"
    },
    {
      "name": "Jussara M. Almeida",
      "institution": "Universidade Federal de Minas Gerais, Belo Horizonte, MG, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100613403",
      "orcid": "missing"
    },
    {
      "name": "Fabrício Benevenuto",
      "institution": "Universidade Federal de Minas Gerais, Belo Horizonte, MG, Brazil",
      "img": "/do/10.1145/contrib-81100593412/rel-imgonly/fabriciobenevenuto.jpg",
      "acmid": "81100593412",
      "orcid": "missing"
    },
    {
      "name": "Krishna P. Gummadi",
      "institution": "Max Planck Institute for Software Systems, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100334131",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bernstein, M. S., Bakshy, E., Burke, M., and Karrer, B. Quantifying the Invisible Audience in Social Networks. In Proc. CHI (2013).  ",
      "doi": "10.1145/2470654.2470658"
    },
    {
      "text": "Borghol, Y., Ardon, S., Carlsson, N., Eager, D., and Mahanti, A. The Untold Story of the Clones: Content-Agnostic Factors that Impact YouTube Video Popularity. In Proc. KDD (2012).  ",
      "doi": "10.1145/2339530.2339717"
    },
    {
      "text": "Bretz, F., Hothorn, T., and Westfall, P. Multiple Comparisons Using R, 1 ed. CRC Press, 2010.",
      "doi": ""
    },
    {
      "text": "Figueiredo, F., Benevenuto, F., and Almeida, J. The Tube Over Time: Characterizing Popularity Growth of YouTube Videos. In Proc. WSDM (2011).  ",
      "doi": "10.1145/1935826.1935925"
    },
    {
      "text": "Filippova, K., and Hall, K. B. Improved Video Categorization from Text Metadata and User Comments. In Proc. SIGIR (2011).  ",
      "doi": "10.1145/2009916.2010028"
    },
    {
      "text": "Fleiss, J. L., and Levin, B. Statistical Methods for Rates and Proportions, 3 ed. Wiley-Interscience, 2003.",
      "doi": ""
    },
    {
      "text": "Lakkaraju, H., McAuley, J., and Leskovec, J. What's in a Name? Understanding the Interplay between Titles, Content, and Communities in Social Media. In Proc. ICWSM (2013).",
      "doi": ""
    },
    {
      "text": "Matsubara, Y., Sakurai, Y., Prakash, B. A., Li, L., and Faloutsos, C. Rise and Fall Patterns of Information Diffusion. In Proc. KDD. (2012).  ",
      "doi": "10.1145/2339530.2339537"
    },
    {
      "text": "Salganik, M., Dodds, P., and Watts, D. Experimental Study of Inequality and Unpredictability in an Artificial Cultural Market. Science 311, 5762 (2006), 854--856.",
      "doi": ""
    },
    {
      "text": "Shamma, D. A., Kennedy, L., and Churchill, E. F. Peaks and Persistence: Modeling the Shape of Microblog Conversations. In Proc. CSCW (2011).  ",
      "doi": "10.1145/1958824.1958878"
    },
    {
      "text": "Yano, T., and Smith, N. A. Whats Worthy of Comment? Content and Comment Volume in Political Blogs. In Proc. ICWSM (2010).",
      "doi": ""
    }
  ]
}