{
  "doi": "10.1145/2556288.2557206",
  "title": "SonicExplorer: fluid exploration of audio parameters",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "237-246",
  "year": 2014,
  "badges": [],
  "abstract": "In digital music production, the phrase \"in the box\" refers to the increasing replacement of extraneous hardware devices with compatible software components. As controls move from hard to soft, we have seen an increase in usability issues for musicians and sound engineers dealing with a large number of temporal inputs and both continuous and discrete controls. We present the SonicExplorer application, which we developed to give users a new interface for exploring and manipulating audio. SonicExplorer leverages users' spatial and color perception to enhance exploration by visualizing the parameter space and providing implicit memory cues. The application also leverages bimanual input to aid in fluid exploration of multidimensional audio parameter spaces, and to minimize the need for switching between parameters.",
  "tags": [
    "spatial memory cues",
    "parameter exploration",
    "color memory cues",
    "bimanual interaction",
    "audio"
  ],
  "authors": [
    {
      "name": "Alexander Travis Adams",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556747956",
      "orcid": "missing"
    },
    {
      "name": "Berto Gonzalez",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/do/10.1145/contrib-81447599274/rel-imgonly/8166feca-6158-4db8-b871-828a25fb76af.jpeg",
      "acmid": "81447599274",
      "orcid": "missing"
    },
    {
      "name": "Celine Latulipe",
      "institution": "University of North Carolina at Charlotte, Charlotte, NC, USA",
      "img": "/do/10.1145/contrib-81100323202/rel-imgonly/celine-1657_sm.jpg",
      "acmid": "81100323202",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Core MIDI Framework. https://developer.apple.com/.",
      "doi": ""
    },
    {
      "text": "MIDI Manufacturers Association. http://www.MIDI.org.",
      "doi": ""
    },
    {
      "text": "Adams, A., and Latulipe, C. Survey of audio programming tools. In CHI '13 EA (2013).  ",
      "doi": "10.1145/2468356.2468495"
    },
    {
      "text": "Balakrishnan, R., and Hinckley, K. Symmetric bimanual interaction. In Proc. SIGCHI, ACM (2000), 33--40.  ",
      "doi": "10.1145/332040.332404"
    },
    {
      "text": "Bevans, A. Investigating the effects of bimanual multitouch interaction on creativity. In Proc. C&C '11, ACM (New York, NY, USA, 2011), 451--452.  ",
      "doi": "10.1145/2069618.2069746"
    },
    {
      "text": "Blaine, T., and Perkis, T. The jam-o-drum interactive music system: a study in interaction design. In Proc. DIS '00, ACM (2000), 165--173.  ",
      "doi": "10.1145/347642.347705"
    },
    {
      "text": "Braun, V., and Clarke, V. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Buxton, W., and Myers, B. A study in two-handed input. In Proc. CHI '86, ACM Press (1986), 321--326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Cook, P. R., and Scavone, G. P. The synthesis toolkit (stk). In Proc. ICMC '99 (1999).",
      "doi": ""
    },
    {
      "text": "Fels, S., Gadd, A., and Mulder, A. Mapping transparency through metaphor: Towards more expressive musical instruments. Organised Sound 7, 2 (August 2002), 109--126.  ",
      "doi": "10.1017/S1355771802002042"
    },
    {
      "text": "Fiebrink, R., Wang, G., and Cook, P. R. Don't forget the laptop: using native input capabilities for expressive musical control. In Proc. NIME '07, ACM (2007), 164--167.  ",
      "doi": "10.1145/1279740.1279771"
    },
    {
      "text": "Gonzalez, B., and Latulipe, C. BiCEP: bimanual color exploration plugin. In Proc. CHI '11 EA, ACM (2011), 1483--1488.  ",
      "doi": "10.1145/1979742.1979795"
    },
    {
      "text": "Guiard, Y. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of motor behavior 19 (1987), 486--517.",
      "doi": ""
    },
    {
      "text": "Hunt, A., and Wanderley, M. M. Mapping performer parameters to synthesis engines. Organised Sound 7, 2 (August 2002), 97--108.  ",
      "doi": "10.1017/S1355771802002030"
    },
    {
      "text": "Jordá, S., Geiger, G., Alonso, M., and Kaltenbrunner, M. The reacTable: exploring the synergy between live music performance and tabletop tangible interfaces. In Proc. TEI '07, no. 8, ACM (New York, NY, USA, 2007), 139--146.  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Kin, K., Agrawala, M., and DeRose, T. Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation. In Proc. GI '09, GI '09, Canadian Information Processing Society (Toronto, Ont., Canada, Canada, 2009), 119--124. ",
      "doi": "10.5555/1555880.1555910"
    },
    {
      "text": "Latulipe, C. A Model for Symmetric Bimanual Interaction. PhD thesis, PhD Thesis, The University of Waterloo, 2006.",
      "doi": ""
    },
    {
      "text": "Latulipe, C., Mann, S., Kaplan, C., and Clarke, C. symSpline: symmetric two-handed spline manipulation. In Proc. CHI '06, ACM (2006), 349--358.  ",
      "doi": "10.1145/1124772.1124825"
    },
    {
      "text": "Latulipe, C., Youngblood, M., Bell, I., and Orlando, C. ToneZone: image exploration with spatial memory cues. In Proc. C&C '09, ACM (New York, NY, USA, 2009), 427--428.  ",
      "doi": "10.1145/1640233.1640335"
    },
    {
      "text": "Leganchuk, A., Zhai, S., and Buxton, W. Manual and cognitive benefits of two-handed input: an experimental study. ACM Transactions on Computer-Human Interaction (TOCHI) 5, 4 (1998), 326--359.  ",
      "doi": "10.1145/300520.300522"
    },
    {
      "text": "Levin, G., and Lieberman, Z. Sounds from shapes: Audiovisual performance with hand silhouette contours in the manual input sessions. In Proc. NIME '05, NIME '05, National University of Singapore (Singapore, Singapore, 2005), 115--120. ",
      "doi": "10.5555/1085939.1085972"
    },
    {
      "text": "Lopes, P. A., Ferreira, A., and Pereira, J. A. M. Multitouch interactive DJing surface. In Proc. ACE '10, Departamento Engenharia Informática INESC-ID/IST/Universidade Técnica de Lisboa R. Alves Redol, 9, 1000-029 Lisboa, Portugal, ACM (2010), 3.  ",
      "doi": "10.1145/1971630.1971639"
    },
    {
      "text": "Moog, R. A. Midi; musical instrument digital interface. The Journal of the Audio Engineering Society 34, 5 (1986), 394--404.",
      "doi": ""
    },
    {
      "text": "Moscovich, T., and Hughes, J. F. Indirect mappings of multi-touch input using one and two hands. In Proc. CHI '08, CHI '08, ACM (New York, NY, USA, 2008), 1275--1284.  ",
      "doi": "10.1145/1357054.1357254"
    },
    {
      "text": "Simon, H. A. Theories of bounded rationality. Decision and organization 1 (1972), 161--176.",
      "doi": ""
    },
    {
      "text": "Singer, E. Sonic banana: A novel bend-sensor-based midi controller. In Proc. NIME '03, NIME '03, National University of Singapore (Singapore, Singapore, 2003), 220--221. ",
      "doi": "10.5555/1085714.1085771"
    },
    {
      "text": "Staff, A. Midi and musical instrument control. Journal of the Audio Engineering Society 51, 4 (2003), 272--276.",
      "doi": ""
    },
    {
      "text": "Trueman, D. Why a laptop orchestra? Organised Sound 12, 02 (2007), 171--179.  ",
      "doi": "10.1017/S135577180700180X"
    },
    {
      "text": "Verplank, B., Gurevich, M., and Mathews, M. The plank: Designing a simple haptic controller. In Proc. NIME '02, NIME '02, National University of Singapore (Singapore, Singapore, 2002), 1--4. ",
      "doi": "10.5555/1085171.1085180"
    },
    {
      "text": "Wagner, J., Huot, S., and Mackay, W. BiTouch and biPad: designing bimanual interaction for hand-held tablets. In Proc. CHI '12, CHI '12, ACM (New York, NY, USA, 2012), 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    },
    {
      "text": "Wright, M. Open sound control: an enabling technology for musical networking. Organised Sound 10, 03 (2005), 193--200.  ",
      "doi": "10.1017/S1355771805000932"
    },
    {
      "text": "Zadel, M., and Scavone, G. Different strokes: A prototype software system for laptop performance and improvisation. In Proc. NIME '06, IRCAM - Centre Pompidou (Paris, France, 2006), 168--171. ",
      "doi": "10.5555/1142215.1142255"
    }
  ]
}