{
  "doi": "10.1145/2556288.2557290",
  "title": "Captioned photographs in psychosocial aged care: relationship building and boundary work",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "4167-4176",
  "year": 2014,
  "badges": [],
  "abstract": "In this paper we examine the use of a novel social technology to support the provision of formal aged care services to clients who live in their own homes. Social technologies offer enormous potential for enhancing aged care, but research on their use in aged care has largely focused on institutional or informal care settings, rather than formal care in the home. Meanwhile, technologies for aging in place typically focus on monitoring and security, rather than psychosocial support. We conducted a field study in which aged care managers used a photo and message-sharing tool to communicate with clients living in their own homes. Our findings demonstrate that visual and social forms of communication are valuable for supporting psychosocial care-giving, but there are barriers to effectively adopting new communication tools in this setting. Time constraints inhibited care managers' use of the technology, which was also influenced by their efforts to carefully maintain boundaries between their personal and professional lives.",
  "authors": [
    {
      "name": "Jenny Waycott",
      "institution": "The University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-81100550581/rel-imgonly/jwaycottheadshot2.jpg",
      "acmid": "81100550581",
      "orcid": "0000-0002-4634-0532"
    },
    {
      "name": "Hilary Davis",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483723",
      "orcid": "missing"
    },
    {
      "name": "Frank Vetere",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    },
    {
      "name": "Amee Morgans",
      "institution": "Benetas Aged Care Services, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958801057",
      "orcid": "missing"
    },
    {
      "name": "Alan Gruner",
      "institution": "Benetas Aged Care Services, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482653712",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Ozanne",
      "institution": "The University of Melbourne, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482660502",
      "orcid": "missing"
    },
    {
      "name": "Lars Kulik",
      "institution": "The University of Melbourne, Parkville, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100419795",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aarhus, R. and Ballegaard, S. A. Negotiating boundaries: Managing disease at home. In Proc. CHI 2010, ACM Press (2010), 1223--1232.  ",
      "doi": "10.1145/1753326.1753509"
    },
    {
      "text": "Ames, M., Eckles, D., Naaman, M., Spasojevic, M. and Van House, N. Requirements for mobile photoware. Pers. and Ubiq. Comp., 14 (2010), 95--109.  ",
      "doi": "10.1007/s00779-009-0237-4"
    },
    {
      "text": "Ballegaard, S. A., Hansen, T. R. and Kyng, M. Healthcare in everyday life Designing healthcare services for daily life. In Proc. CHI 2008, ACM Press (2008), 1807--1816.  ",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Bratteteig, T. and Wagner, I. Moving healthcare to the home: The work to make homecare work. In Proc. ECSCW 2013, Springer-Verlag (2013).",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Roessler, P., Shelton, B. E., LaMarca, A., Schilit, B. and Bly, S. Technology for care networks of elders. IEEE Pervasive Computing, 3, 2 (2004), 22--29.  ",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Gaver, W., Boucher, A., Bowers, J., Blythe, M., Jarvis, N., Cameron, D., Kerridge, T., Wilkie, A., Philliips, R. and Wright, P. The Photostroller: Supporting diverse care home residents in engaging with the world. In Proc. CHI 2011, ACM Press (2011), 1757--1766.  ",
      "doi": "10.1145/1978942.1979198"
    },
    {
      "text": "Graham, C., Laurier, E., O'Brien, V. and Rouncefield, M. New visual technologies: shifting boundaries, shared moments. Visual Studies, 26, 2 (2011), 87--91.",
      "doi": ""
    },
    {
      "text": "Hammersley, M. and Atkinson, P. Ethnography: Principles in Practice. Routledge, 2007.",
      "doi": ""
    },
    {
      "text": "King, D. It's frustrating! Managing emotional dissonance in aged care work. Aust. Journal of Social Issues, 47, 1 (2012), 51--70.",
      "doi": ""
    },
    {
      "text": "Lindley, S. E. Shades of lightweight: supporting crossgenerational communication through home messaging. Univ. Acc. in the Inf. Soc., 11, 1 (2012), 31--43.  ",
      "doi": "10.1007/s10209-011-0231-2"
    },
    {
      "text": "Lindley, S. E., Randall, D., Sharrock, W., Glancy, M., Smyth, N. and Harper, R. Narrative, memory and practice: Tensions and choices in the use of a digital artefact. In Proc. HCI 2009, BCS (2009). ",
      "doi": "10.5555/1671011.1671012"
    },
    {
      "text": "Mears, J. Blurred boundaries: how paid careworkers and care managers negotiate work relationships. In Paid Care in Australia: Politics, Profits, Practices, Sydney University Press, Sydney, AUS (2009), 145--166.",
      "doi": ""
    },
    {
      "text": "Mears, J. and Garcia, E. Transformations of Care: Living the Consequences of Changing Public Policies in Australia. University of Western Sydney (2011)",
      "doi": ""
    },
    {
      "text": "Mort, M., Roberts, C. and Callen, B. Ageing with telecare: Care or coercion in austerity' Sociology of Health & Illness, 35, 6 (2013), 799--812.",
      "doi": ""
    },
    {
      "text": "Nippert-Eng, C. E. Home and Work: Negotiating Boundaries Through Everday Life. The University of Chicago Press, Chicago, 1996.",
      "doi": ""
    },
    {
      "text": "Pedell, S., Vetere, F., Kulik, L., Ozanne, E. and Gruner, A. Social isolation of older people: the role of domestic technologies. In Proc. OzCHI 2010, ACM Press (2010), 167--170.  ",
      "doi": "10.1145/1952222.1952255"
    },
    {
      "text": "Perry, M., O'Hara, K., Sellen, A., Brown, B. and Harper, R. Dealing with mobility: Understanding access anytime, anywhere. ACM Trans. Comput.-Hum. Interact., 8, 4 (2001), 323--347.  ",
      "doi": "10.1145/504704.504707"
    },
    {
      "text": "Roberts, C. and Mort, M. Reshaping what counts as care: Older people, work and new technologies. ALTER, Eur. Journ. of Dis. Res., 3 (2009), 138--158.",
      "doi": ""
    },
    {
      "text": "Rowan, J. and Mynatt, E. D. Digital family portrait field trial: support for aging in place. In Proc. CHI 2005, ACM Press (2005), 521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Stone, D. Caring by the book. In Care Work: Gender, Class, and the Welfare State, Routledge, NY (2000).",
      "doi": ""
    },
    {
      "text": "Thom-Santelli, J. and Millen, D. R. Learning by seeing: Photo viewing in the workplace. In Proc. CHI 2009, ACM Press (2009), 2081--2090.  ",
      "doi": "10.1145/1518701.1519017"
    },
    {
      "text": "van Dijk, B., Dadlani, P., van Halteren, A. and Biemans, M. Life changes, connection stays: Photo sharing and social connectedness for people with special needs. In Proc. ECCE, ACM Press (2010), 135--142.  ",
      "doi": "10.1145/1962300.1962327"
    },
    {
      "text": "Vargheese, J. P. Persuasive dialogue for older adults: promoting and encouraging social interaction. In Ext. Abstracts CHI 2013, ACM Press (2013), 877--882.  ",
      "doi": "10.1145/2468356.2468513"
    },
    {
      "text": "Vetere, F., Davis, H., Gibbs, M. and Howard, S. The Magic Box and Collage: Responding to the challenge of distributed intergenerational play. Int. J. Hum.-Comput. Stud., 67, 2 (2009), 165--178.  ",
      "doi": "10.1016/j.ijhcs.2008.09.004"
    },
    {
      "text": "Waycott, J., Vetere, F., Pedell, S., Kulik, L., Ozanne, E., Gruner, A. and Downs, J. Older adults as digital content producers. In Proc. CHI 2013, ACM (2013), 39--48.  ",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Webster, G., Fels, D. I., Gowans, G., & Hanson, V. L. Portraits of individuals with dementia: Views of care managers. In Proc. HCI 2011, British Computer Society (2011), 331--340. ",
      "doi": "10.5555/2305316.2305374"
    },
    {
      "text": "You, E. C., Dunt, D., Doyle, C., Hsueh, A. (2012). Effects of case management in community aged care on client and carer outcomes: a systematic review of randomized trials and comparative observational studies. BMC Health Services Research, 12, 395.",
      "doi": ""
    }
  ]
}