{
  "doi": "10.1145/2556288.2556984",
  "title": "Exploring the use of hand-to-face input for interacting with head-worn displays",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3181-3190",
  "year": 2014,
  "badges": [],
  "abstract": "We propose the use of Hand-to-Face input, a method to interact with head-worn displays (HWDs) that involves contact with the face. We explore Hand-to-Face interaction to find suitable techniques for common mobile tasks. We evaluate this form of interaction with document navigation tasks and examine its social acceptability. In a first study, users identify the cheek and forehead as predominant areas for interaction and agree on gestures for tasks involving continuous input, such as document navigation. These results guide the design of several Hand-to-Face navigation techniques and reveal that gestures performed on the cheek are more efficient and less tiring than interactions directly on the HWD. Initial results on the social acceptability of Hand-to-Face input allow us to further refine our design choices, and reveal unforeseen results: some gestures are considered culturally inappropriate and gender plays a role in selection of specific Hand-to-Face interactions. From our overall results, we provide a set of guidelines for developing effective Hand-to-Face interaction techniques.",
  "tags": [
    "hmd",
    "input techniques",
    "head-worn display",
    "hwd",
    "mobile interfaces",
    "body interaction"
  ],
  "authors": [
    {
      "name": "Marcos Serrano",
      "institution": "University of Manitoba & IRIT-University of Toulouse (FR), Winnipeg, Manitoba, Canada",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Barrett M. Ens",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    },
    {
      "name": "Pourang P. Irani",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Han, T., Judd, W., Irani, P. Subramanian, S. 2012. Putting your best foot forward: investigating real-world mappings for foot-based gestures. In Proc. of CHI '12. ACM, 1229--1238.  ",
      "doi": "10.1145/2207676.2208575"
    },
    {
      "text": "Bailly, G., Müller, J., Rohs, M., Wigdor, D., Kratz, S. 2012. ShoeSense: a new perspective on gestural interaction and wearable applications. In Proc. of CHI '12. ACM, 1239--1248.  ",
      "doi": "10.1145/2207676.2208576"
    },
    {
      "text": "Borg, G. Borg's Perceived Exertion and Pain Scales. Human Kinetics (1998), viii 104pp.",
      "doi": ""
    },
    {
      "text": "Epson Moverio, http://www.epson.com/moverio",
      "doi": ""
    },
    {
      "text": "GlobalWebIndex, https://www.globalwebindex.net/Topglobal-smartphone-apps",
      "doi": ""
    },
    {
      "text": "Google Glass, Project Glass One Day video, http://www.google.com/glass",
      "doi": ""
    },
    {
      "text": "Gustafson, S.,Rabe, B., and Baudisch, P.. 2013. Understanding palm-based imaginary interfaces. In Proc. of CHI '13. ACM, 889--898.  ",
      "doi": "10.1145/2470654.2466114"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. 2010. Skinput: appropriating the body as an input surface. In Proc. of CHI '10. ACM, 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Harrison, C., Benko, H. and Wilson, A. 2011. OmniTouch: wearable multitouch interaction everywhere. In Proc of UIST'11. ACM, 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Hidayat, A. Flick list with its momentum scrolling and deceleration. http://ariya.ofilabs.com/",
      "doi": ""
    },
    {
      "text": "Hincapie-Ramos, J-D,. Guo, X., Moghadasian, P. and Irani, P. 2014. Consumed Endurance: a metric to quantify arm fatigue of mid-air interactions. In Proc. of CHI'14. ACM, to appear.  ",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Hinckley, K., Wigdor, D., Input Technologies and Techniques. Chap. 9 in The HCI Handbook, 3rd Edition, Taylor & Francis. ",
      "doi": "10.5555/772072.772085"
    },
    {
      "text": "Holz, C. Grossman, T., Frizmaurice, G and Agur, A. 2012. Implanted user interfaces. In Proc. of CHI '12. ACM, 503--512.  ",
      "doi": "10.1145/2207676.2207745"
    },
    {
      "text": "Kim, D. Hilliges, O., Izadi, S., Butler, A., Chen, J., Oikonomidis, I. and Olivier, P.. 2012. Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor. In Proc. of UIST '12. ACM, 167--176.  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Kimura, S., Fukuomoto, M., and Horikoshi, T. 2013. Eyeglass-based hands-free videophone. In Proc. of ISWC '13. ACM, 117--124.  ",
      "doi": "10.1145/2493988.2494330"
    },
    {
      "text": "Lissermann, R.Huber, J., Hadjakos, A. and Mühlhäuser, M. 2013. EarPut: augmenting behind-the-ear devices for ear-based interaction. In CHI '13EA. ACM, 1323--28.  ",
      "doi": "10.1145/2468356.2468592"
    },
    {
      "text": "Lucero, A. Lyons, K., Vetek, A., Järvenpää, T., White, S. and Salmimaa, M. 2013. Exploring the interaction design space for interactive glasses. In CHI '13 EA. ACM, 1341--1346.  ",
      "doi": "10.1145/2468356.2468595"
    },
    {
      "text": "Mahmoud, M. and Robinson, P. 2011. Interpreting Hand-Over-Face Gestures. In Proc. of Affective Computing, Springer, 248--255. ",
      "doi": "10.5555/2062850.2062879"
    },
    {
      "text": "Malacria, S., Lecolinet, E. and Guiard, Y. 2010. Clutchfree panning and integrated pan-zoom control on touchsensitive surfaces: the cyclostar approach. In Proc. of CHI '10. ACM, 2615--2624.  ",
      "doi": "10.1145/1753326.1753724"
    },
    {
      "text": "Nicas, M. and Best, D. 2008. A Study Quantifying the Hand-to-Face Contact Rate and Its Potential Application to Predicting Respiratory Tract Infection. In J. Occup. Env. Hyg., 347--352.",
      "doi": ""
    },
    {
      "text": "Perrault, S., Lecolinet, E., Eagan, J., Guiard, Y. 2013. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. In Proc. of CHI'13. ACM, 1451--1460.  ",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Profita, H., Clawson, J., Gilliland, S., Zeagler, C., Starner, T., Budd, J. and Do, E. 2013. Don't mind me touching my wrist: a case study of interacting with onbody technology in public. In Proc. of ISWC '13. ACM, 89--96.  ",
      "doi": "10.1145/2493988.2494331"
    },
    {
      "text": "Rico, J. and Brewster, S. 2010. Usable gestures for mobile interfaces: evaluating social acceptability. In Proc. of CHI '10. ACM, 887--896.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Ruiz, J, Li, Y., Lank, E. 2011. User-defined motion gestures for mobile interaction. In Proc. of CHI '11. ACM, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Saponas, T., Kelly, D., Parviz, B. and Tan, D. 2009. Optically sensing tongue gestures for computer input. In Proc.of UIST '09. ACM, 177--180.  ",
      "doi": "10.1145/1622176.1622209"
    },
    {
      "text": "Serrano, M., Lecolinet, E., and Guiard, Y. 2013. BezelTap gestures: quick activation of commands from sleep mode on tablets. In Proc. of CHI'13. ACM, 3027--3036.  ",
      "doi": "10.1145/2470654.2481421"
    },
    {
      "text": "Seyed, T., Burns, C., Costa, M, Maurer, F. and Tang, A. 2012. Eliciting usable gestures for multi-display environments. In Proc. of ITS '12. ACM, 41--50.  ",
      "doi": "10.1145/2396636.2396643"
    },
    {
      "text": "Spakov, O. and Majaranta, P. 2012. Enhanced gaze interaction using simple head gestures. In Proc. of UbiComp '12. ACM, 705--710.  ",
      "doi": "10.1145/2370216.2370369"
    },
    {
      "text": "Tamaki, E. Miyak, T. and Rekimoto, J. 2010. BrainyHand: a wearable computing device without HMD and its interaction techniques. In Proc. of AVI '10. ACM, 387--388.  ",
      "doi": "10.1145/1842993.1843070"
    },
    {
      "text": "Telepathy, http://tele-pathy.org",
      "doi": ""
    },
    {
      "text": "Vuzix M100, http://www.vuzix.com",
      "doi": ""
    },
    {
      "text": "Wagner, J. Nancel, M., Gustafson, S., Huot, S. and Mackay, W. 2013. Body-centric design space for multisurface interaction. In Proc. of CHI '13. ACM, 12991308.  ",
      "doi": "10.1145/2470654.2466170"
    },
    {
      "text": "Wobbrock, J., Ringel Morris, M. and Wilson, A. 2009. User-defined gestures for surface computing. In Proc. of CHI '09. ACM, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Yang, X-D. Grossman, T., Wigdor, D. and Fitzmaurice, G. 2012. Magic finger: always-available input through finger instrumentation. In Proc. of UIST '12. ACM, 147156.  ",
      "doi": "10.1145/2380116.2380137"
    }
  ]
}