{
  "doi": "10.1145/2556288.2556972",
  "title": "Novice use of a predictive human performance modeling tool to produce UI recommendations",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2251-2254",
  "year": 2014,
  "badges": [],
  "abstract": "This note describes two studies of the use of a performance modeling tool, CogTool, for making recommendations to improve a user interface. The first study replicates findings by Bonnie John [7]: the rates at which novice modelers made correct recommendations (88.1%) and supported them (68.2%) are close to the values in John's study (91.7% and 75.1%, respectively). A follow-on study of novice modelers on the same task without CogTool produced sig-nificantly lower values. CogTool improves the UI design recommendations made by novices.",
  "tags": [
    "usability analysis",
    "cogtool",
    "interface design"
  ],
  "authors": [
    {
      "name": "Kyung Wha Hong",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500657781",
      "orcid": "missing"
    },
    {
      "name": "Robert St. Amant",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452610940",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellamy, R., John, B. E., Kogan, S. Deploying CogTool: Integrating quantitative usability assessment into realworld software development. In Proc. ICSE, ACM (2011), 691--700.  ",
      "doi": "10.1145/1985793.1985890"
    },
    {
      "text": "Card, S. K., Moran, T. P., & Newell, A. The keystroke-level model for user performance time with interactive systems. CACM 23, 7 (1980), 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Couix, S., and Burkhardt, J.-M. Task descriptions using academic oriented modelling languages: A survey of actual practices across the SIGCHI community. In LNCS (HCI-INTERACT), 6948, Springer (2011), 555--570. ",
      "doi": "10.5555/2042182.2042232"
    },
    {
      "text": "Heim, S. The Resonant Interface: HCI Foundations for Interaction Design, Addison Wesley, 2007. ",
      "doi": "10.5555/1215602"
    },
    {
      "text": "Hertzum, M., and Jacobsen, N. E. The evaluator effect: A chilling fact about usability evaluation methods. IJHCI 13, 4 (2001), 421--443.",
      "doi": ""
    },
    {
      "text": "John, B. E., Prevas, K., Salvucci, D., and Koedinger, K. Predictive human performance modeling made easy. In Proc. CHI, ACM (2004), 455--462.  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "John, B. E. Using predictive human performance models to inspire and support UI design recommendations. In Proc. CHI, ACM (2011), 983--986.  ",
      "doi": "10.1145/1978942.1979088"
    },
    {
      "text": "Wilson, M. L., Mackay, W., Chi, E., Bernstein, M., Russell, D., and Thimbleby, H. RepliCHI - CHI should be replicating and validating results more: Discuss. In Ext. Abstracts CHI, ACM (2011), 463--46.  ",
      "doi": "10.1145/1979742.1979491"
    }
  ]
}