{
  "doi": "10.1145/2556288.2557223",
  "title": "BodyDiagrams: improving communication of pain symptoms through drawing",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1153-1162",
  "year": 2014,
  "badges": [],
  "abstract": "Thousands of people use the Internet to discuss pain symptoms. While communication between patients and physicians involves both verbal and physical interactions, online discussions of symptoms typically comprise text only. We present BodyDiagrams, an online interface for expressing symptoms via drawings and text. BodyDiagrams augment textual descriptions with pain diagrams drawn over a reference body and annotated with severity and temporal metadata. The resulting diagrams can easily be shared to solicit feedback and advice. We also conduct a two-phase user study to assess BodyDiagrams' communicative efficacy. In the first phase, users describe pain symptoms using BodyDiagrams and a text-only interface; in the second phase, medical professionals evaluate these descriptions. We find that patients are significantly more confident that their BodyDiagrams will be correctly interpreted, while medical professionals rated BodyDiagrams as significantly more informative than text descriptions. Both groups indicated a preference for using diagrams to communicate physical symptoms in the future.",
  "tags": [
    "health",
    "pain diagrams",
    "drawing",
    "symptom communication"
  ],
  "authors": [
    {
      "name": "Amy Jang",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556540356",
      "orcid": "missing"
    },
    {
      "name": "Diana L. MacLean",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81481641916",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Heer",
      "institution": "University of Washington & Stanford University, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100465553/rel-imgonly/jeff-heer.jpg",
      "acmid": "81100465553",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bostock, M., Ogievetsky, V., and Heer, J. D3: Data-Driven Documents. IEEE Trans. on Visualization and Computer Graphics 17, 12 (2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Bui, A. A., Aberle, D. R., and Kangarloo, H. Timeline: visualizing integrated patient records. IEEE Trans. on Information Tech. in Biomedicine 11, 4 (2007), 462--473.  ",
      "doi": "10.1109/TITB.2006.884365"
    },
    {
      "text": "Dreyfuss, P., Michaelsen, M., Fletcher, D., et al. Atlanto-occipital and lateral atlanto-axial joint pain patterns. SPINE 19, 10 (1994), 1125.",
      "doi": ""
    },
    {
      "text": "Dreyfuss, P., Tibiletti, C., Dreyer, S., et al. Thoracic zygapophyseal joint pain patterns. a study in normal volunteers. SPINE 19, 7 (1994), 807.",
      "doi": ""
    },
    {
      "text": "Felix, E., Galoian, K., Aarons, C., Brown, M., Kearing, S., and Heiss, U. Utility of quantitative computerized pain drawings in a sample of spinal stenosis patients. Pain Medicine 11, 3 (2010), 382--389.",
      "doi": ""
    },
    {
      "text": "Fortin, J., Aprill, C., Ponthieux, B., Pier, J., et al. Sacroiliac joint: pain referral maps upon applying a new injection/arthrography technique. Part II: Clinical evaluation. SPINE 19, 13 (1994), 1483.",
      "doi": ""
    },
    {
      "text": "Fox, S., and Duggan, M. Health Online. Pew Internet & American Life Project, 2013. {Online; accessed 2-April-2013}.",
      "doi": ""
    },
    {
      "text": "Ghinea, G., Gill, D., Frank, A., and De Souza, L. Using geographical information systems for management of back-pain data. Management in Medicine 16, 2/3 (2002), 219--237.",
      "doi": ""
    },
    {
      "text": "Jamison, R., Fanciullo, G., and Baird, J. Usefulness of pain drawings in identifying real or imagined pain: accuracy of pain professionals, nonprofessionals, and a decision model. Pain 5, 9 (2004), 476--482.",
      "doi": ""
    },
    {
      "text": "Jang, A., MacLean, D., and Heer, J. Designing a prototype interface for visual communication of pain. In Ext. Abstracts CHI 2013, ACM (2013), 427--432.  ",
      "doi": "10.1145/2468356.2468432"
    },
    {
      "text": "MedHelp. MedHelp Pain Tracker. http://www.medhelp.org/land/pain- tracker. {Online; accessed 10-December-2012}.",
      "doi": ""
    },
    {
      "text": "Melzack, R. The McGill Pain Questionnaire: major properties and scoring methods. Pain 1, 3 (1975), 277--299.",
      "doi": ""
    },
    {
      "text": "Pain, P. A. Partners Against Pain: Tracking Solutions.",
      "doi": ""
    },
    {
      "text": "http://www.partnersagainstpain.com/ tracking-pain/management.aspx. {Online; accessed 10-December-2012}.",
      "doi": ""
    },
    {
      "text": "14. Plaisant, C., Milash, B., Rose, A., Widoff, S., and Shneiderman, B. Lifelines: visualizing personal histories. In Proc. CHI 1996, ACM (1996), 221--227.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "15. Plaisant, C., Mushlin, R., Snyder, A., Li, J., Heller, D., and Shneiderman, B. Lifelines: using visualization to enhance navigation and analysis of patient records. In Proc. AMIA Symposium (1998), 76.",
      "doi": ""
    },
    {
      "text": "16. Powell, R. A., Downing, J., Ddungu, H., and Mwangi-Powell, F. N. Pain history and pain assessment. In Guide to Pain Management in Low-Resource Settings, IASP (2010), 67--68.",
      "doi": ""
    },
    {
      "text": "17. Spyridonis, F., and Ghinea, G. 2D vs. 3D pain visualization: User preferences in a spinal cord injury cohort. Design, User Experience, and Usability. Theory, Methods, Tools and Practice (2011), 315--322.",
      "doi": ""
    },
    {
      "text": "18. WebMD. WebMD Symptom Tracker. http://symptoms.webmd.com/symptomchecker. {Online; accessed 10-January-2013}.",
      "doi": ""
    }
  ]
}