{
  "doi": "10.1145/2556288.2557124",
  "title": "Interface design for older adults with varying cultural attitudes toward uncertainty",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1913-1922",
  "year": 2014,
  "badges": [],
  "abstract": "This work reports on the design and evaluation of culturally appropriate technology for older adults. Our design context was Cognitive Testing on a Computer (C-TOC): a self-administered computerized test under development, intended to screen older adults for cognitive impairments. Using theory triangulation of cultural attitudes toward uncertainty, we designed two interfaces (one minimal and one rich) for one C-TOC subtest and hypothesized they would be culturally appropriate for older adult Caucasians and East Asians respectively. We ran an experiment with 36 participants to investigate cultural differences in performance, preference and anxiety. We found that Caucasians preferred the interface with minimal elements (i.e. those essential for the primary task) or had no preference. By contrast, East Asians preferred the rich interface augmented with security and learning support and felt less anxious with it than the minimal.",
  "tags": [
    "computerized cognitive assessment",
    "cultural design",
    "experiment",
    "older adults",
    "uncertainty avoidance"
  ],
  "authors": [
    {
      "name": "Shathel Haddad",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502690616",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Claudia Jacova",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502795037",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barber, W., & Badre, A. (1998). Culturability: The merging of culture and usability. Proc. of the 4th Conference on Human Factors and the Web, 1--14.",
      "doi": ""
    },
    {
      "text": "Brehmer, M. M. (2011). Usability and the effects of interruption in C-TOC: Self-Administered Cognitive Testing on a Computer. M. Sc thesis. University of British Columbia.",
      "doi": ""
    },
    {
      "text": "Carver, C. S., & White, T. L. (1994). Behavioral inhibition, behavioral activation, and affective responses to impending reward and punishment: The BIS/BAS Scales. Journal of Personality and Social Psychology, 67 (2), 319--333.",
      "doi": ""
    },
    {
      "text": "Cheung, B. Y., Chudek, M., & Heine, S. J. (2011). Evidence for a sensitive period for acculturation: Younger immigrants report acculturating at a faster rate. Psychological Science, 22 (2), 147--152.",
      "doi": ""
    },
    {
      "text": "Choi, B., Lee, I., Kim, J., & Jeon, Y. (2005). A qualitative cross-national study of cultural influences on mobile data service design. In Proc. of CHI 2005 (pp. 661--670).  ",
      "doi": "10.1145/1054972.1055064"
    },
    {
      "text": "Clemmensen, T., Hertzum, M., Hornbæk, K., Shi, Q., & Yammiyavar, P. (2009). Cultural cognition in usability evaluation. Interacting with Computers, 21 (3), 212--220.  ",
      "doi": "10.1016/j.intcom.2009.05.003"
    },
    {
      "text": "Cohen, J. (1973). Eta-squared and partial eta-squared in communication science. Human Communication Research, 28, 473--490.",
      "doi": ""
    },
    {
      "text": "Cyr, D., Bonanni, C., & ilsever, J. (2004). Design and e-loyalty across cultures in electronic commerce. In Proc. of 6th Int'l Conference on Electronic Commerce (pp. 351-- 360).  ",
      "doi": "10.1145/1052220.1052265"
    },
    {
      "text": "Darke, S. (1988). Anxiety and working memory capacity. Cognition & Emotion, 2(2), 145--154.",
      "doi": ""
    },
    {
      "text": "De Angeli, A., & Kyriakoullis, L. (2006). Globalisation vs. localisation in e-commerce: cultural-aware interaction design. In Proc. of the Working Conference on Advanced Visual Interfaces (pp. 250--253).  ",
      "doi": "10.1145/1133265.1133314"
    },
    {
      "text": "Frandsen-Thorlacius, O., Hornbæk, K., Hertzum, M.,& Clemmensen, T. (2009). Non-universal usability : A survey of how usability is understood by Chinese and Danish users. In Proc. of CHI 2009 (pp. 41--50).  ",
      "doi": "10.1145/1518701.1518708"
    },
    {
      "text": "Heine, S. J. (2007). Cultural Psychology (1sted.). W. W. Norton & Company.",
      "doi": ""
    },
    {
      "text": "Hofstede, G. (1980). Cultures Consequences: International Differences in Work-Related Values (Abridged). SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Jhangiani, I., & Smith-Jackson, T. (2007). Comparison of mobile phone user interface design preferences: perspectives from nationality and disability culture. In Proc. of the 4th Int'l Conference on Mobile Technology, Applications, and Systems (pp. 512--519).  ",
      "doi": "10.1145/1378063.1378146"
    },
    {
      "text": "Kitayama, S., Duffy, S., Kawamura, T., & Larsen, J. T. (2003). Perceiving an object and its context in different cultures: A cultural look at new look. Psychological Science, 14(3), 201--206.",
      "doi": ""
    },
    {
      "text": "Lee, I., Choi, G. W., Kim, J., Kim, S., Lee, K., Kim, D., Han, M., Park, S., An, Y. (2008). Cultural dimensions for user experience: cross-country and cross-product analysis of users' cultural characteristics. In Proc. of the 22nd British HCI Group Annual Conferenceon People and Computers: Culture, Creativity, Interaction - Volume 1 (pp. 3--12). ",
      "doi": "10.5555/1531514.1531516"
    },
    {
      "text": "Marcus, A. (2010). Cross-cultural user-interface design for work, ho play, and on the way. In ACM SIGGRAPH ASIA 2010 Courses (pp. 5:1--5:160).  ",
      "doi": "10.1145/1900520.1900525"
    },
    {
      "text": "Merritt, S., & Bardzell, S. (2011). Post colonial language and culture theory for HCI4D. In Proc. of CHI 2011, Extended Abstracts (pp. 1675--1680).  ",
      "doi": "10.1145/1979742.1979827"
    },
    {
      "text": "Miyamoto, Y., Nisbett, R. E., & Masuda, T. (2006). Culture and the physical environment. Psychological Science, 17(2), 113--119.",
      "doi": ""
    },
    {
      "text": "Nekrasovski, D., Bodnar, A., McGrenere, J., Guimbretière, F., & Munzner, T. (2006). An evaluation of pan & zoom and rubber sheet navigation with and without an overview. In Proc. of CHI 2006 (pp. 11--20).  ",
      "doi": "10.1145/1124772.1124775"
    },
    {
      "text": "Owen, A. M., McMillan, K. M., Laird, A. R., & Bullmore, E. (2005). N-back working memory paradigm: A meta-analysis of normative functional neuroimaging studies. Human Brain Mapping, 25(1), 46--59.",
      "doi": ""
    },
    {
      "text": "Reinecke, K., & Bernstein, A. (2011). Improving performance, perceived usability, and aesthetic swith culturally adaptive user interfaces. ACM Trans. Comput. Hum. Interact.,1 8(2), 8:1--8:29.  ",
      "doi": "10.1145/1970378.1970382"
    },
    {
      "text": "Shuper, P. A., Sorrentino, R. M., Otsubo, Y., Hodson, G., & Walker, A. M. (2004). A theory of uncertainty orientation. Journal of Cross-Cultural Psychology, 35(4), 460--480.",
      "doi": ""
    },
    {
      "text": "Spielberger, C. D., Gorsuch, R. L., & Lushene, R. E. (1970). Manual for the state-trait anxiety inventory. Retrieved from http://ubir.buffalo.edu/xmlui/handle/10477/2895",
      "doi": ""
    },
    {
      "text": "Tanaka, A., & Yamauchi, H. (2004). Cultural self-construal and achievement goal. Hellenic Journal of Psychology, 1, 221--237.",
      "doi": ""
    },
    {
      "text": "Venkatesh, V., Morris, M. G., Gordon B. Davis, & Davis, F. D. (2003). User acceptance of information technology: Toward a unified view. MIS Quarterly, 27(3), 425--478. ",
      "doi": "10.5555/2017197.2017202"
    },
    {
      "text": "Walsh, T., Nurkka, P., & Walsh, R. (2010). Cultural differences in smartphone user experience evaluation. In Proc. of the 9th International Conference on Mobile and Ubiquitous Multimedia (pp. 24:1--24:9).  ",
      "doi": "10.1145/1899475.1899499"
    },
    {
      "text": "Wobbrock, J. O., Findlater, L., Gergle, D., & Higgins, J. J. (2011). The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proc. of CHI 2011 (pp. 143--146).  ",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}