{
  "doi": "10.1145/2556288.2557242",
  "title": "Direct drawing on 3D shapes with automated camera control",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2047-2050",
  "year": 2014,
  "badges": [],
  "abstract": "We present ACCD, an interaction technique that allows direct drawing of long curves on 3D shapes with a tablet display over both multiple depth layers and multiple viewpoints. ACCD reduces the number of explicit viewpoint manipulations by combining self-occlusion management and automated camera control. As such it enables drawing on occluded faces but also around a 3D shape while keeping a constant drawing precision. Our experimental results indicates the efficacy of ACCD over conventional techniques.",
  "tags": [
    "camera controls",
    "3d interaction technique",
    "3d painting"
  ],
  "authors": [
    {
      "name": "Michaël Ortega",
      "institution": "CNRS, Grenoble, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342506548",
      "orcid": "missing"
    },
    {
      "name": "Thomas Vincent",
      "institution": "UJF-Grenoble1, Grenoble, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490654351",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bae, S.-H., Balakrishnan, R., and Singh, K. Ilovesketch: as-natural as-possible sketching system for creating 3d curve models. In Proc. of UIST, ACM (2008), 151--160.  ",
      "doi": "10.1145/1449715.1449740"
    },
    {
      "text": "Balakrishnan, R., and Kurtenbach, G. Exploring bimanual camera control and object manipulation in 3d graphics interfaces. In Proc. of CHI, ACM (1999), 56--62.  ",
      "doi": "10.1145/302979.302991"
    },
    {
      "text": "Chen, X., Golovinskiy, A., and Funkhouser, T. A benchmark for 3d mesh segmentation. In Proc. of SIGGRAPH, ACM (2009), 73:1--73:12.  ",
      "doi": "10.1145/1576246.1531379"
    },
    {
      "text": "Foskey, M., Otaduy, M. A., and Lin, M. C. Artnova: Touch-enabled 3d model design. In Proc. of VR, IEEE (2002), 119--. ",
      "doi": "10.5555/580130.835880"
    },
    {
      "text": "Fu, C.-W., Xia, J., and He, Y. Layerpaint: a multi-layer interactive 3d painting interface. In Proc. of CHI, ACM (2010), 811--820.  ",
      "doi": "10.1145/1753326.1753445"
    },
    {
      "text": "Hagedorn, B., and Döllner, J. Sketch-based navigation in 3d virtual environments. In Proc. of SG, Springer-Verlag (2008), 239--246.  ",
      "doi": "10.1007/978-3-540-85412-8_23"
    },
    {
      "text": "Hormann, K., Levy, B., and Sheffer, A. Mesh parameterization: Theory and practice. In SIGGRAPH Course Notes (2007).  ",
      "doi": "10.1145/1281500.1281510"
    },
    {
      "text": "Khan, A., Komalo, B., Stam, J., Fitzmaurice, G., and Kurtenbach, G. Hovercam: interactive 3d navigation for proximal object inspection. In Proc. of Interactive 3D graphics and games, ACM (2005), 73--80.  ",
      "doi": "10.1145/1053427.1053439"
    },
    {
      "text": "Ortega, M. 3D object position using automatic viewpoint transitions. In Proc. of CHI, ACM (2013), 193--196.  ",
      "doi": "10.1145/2470654.2470681"
    },
    {
      "text": "Owada, S., Nielsen, F., Nakazawa, K., and Igarashi, T. A sketching interface for modeling the internal structures of 3d shapes. In Proc. of Smart graphics, Springer-Verlag (2003), 49--57. ",
      "doi": "10.5555/1757492.1757498"
    },
    {
      "text": "Phillips, C. B., Badler, N. I., and Granieri, J. Automatic viewing control for 3d direct manipulation. In Proc. of I3D, ACM (1992), 71--74.  ",
      "doi": "10.1145/147156.147167"
    },
    {
      "text": "Schmidt, R., Khan, A., Kurtenbach, G., and Singh, K. On expert performance in 3d curve-drawing tasks. In Proc. of SBIM, ACM (2009), 133--140.  ",
      "doi": "10.1145/1572741.1572765"
    },
    {
      "text": "Veit, M., Capobianco, A., and Bechmann, D. Cros: A touch screen interaction for cursor manipulation on 2-manifolds. In Proc. of VRST, ACM (2012), 97--100.  ",
      "doi": "10.1145/2407336.2407355"
    },
    {
      "text": "ZBrush. http://pixologic.com/zbrush.",
      "doi": ""
    },
    {
      "text": "Zeleznik, R., and Forsberg, A. Unicam - 2d gestural camera controls for 3d environments. In Proc. of I3D, ACM (1999), 169--173.  ",
      "doi": "10.1145/300523.300546"
    }
  ]
}