{
  "doi": "10.1145/2556288.2557397",
  "title": "Crossing-based selection with direct touch input",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2627-2636",
  "year": 2014,
  "badges": [],
  "abstract": "Fundamental performance results for crossing-based selec-tion tasks with direct touch input are presented. A close adaptation of Accot and Zhai's indirect stylus crossing ex-periment reveals similar trends for direct touch input: touch crossing task time is faster or equivalent to touch pointing; continuous selection of large orthogonal crossing targets is most effective; and continuous selection of small collinear targets is least effective. Unlike indirect stylus and mouse crossing, not every kind of direct touch pointing perfor-mance is modeled accurately with standard Fitts' law. Instead, Fitts' law, used previously for touch pointing with small targets, is used to more accurately model discrete touch crossing with a directionally constrained target. In addition, visual touch feedback is shown to have a strong effect on absolute accuracy. Our work empirically validates touch crossing as a practical and efficient selection technique, and motivates the exploration of novel forms of expressive multi-touch crossing.",
  "authors": [
    {
      "name": "Yuexing Luo",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959240057",
      "orcid": "missing"
    },
    {
      "name": "Daniel Vogel",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. Beyond Fitts' law: models for trajectory-based HCI tasks. Proc. of the SIGCHI conference on Human factors in computing systems, ACM (1997), 295'302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Accot, J. and Zhai, S. Scale effects in steering law tasks. Proc. of the SIGCHI conference on Human factors in computing systems, ACM (2001), 1'8.  ",
      "doi": "10.1145/365024.365027"
    },
    {
      "text": "Accot, J. and Zhai, S. More than dotting the i's --foundations for crossing-based interfaces. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM (2002), 73'80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Apitz, G., Guimbretière, F., and Zhai, S. Foundations for designing and evaluating user interfaces based on the crossing paradigm. ACM Trans. Comput.-Hum. Interact. 17, 2 (2008), 9:1'9:42.  ",
      "doi": "10.1145/1746259.1746263"
    },
    {
      "text": "Apitz, G. and Guimbretière, F. CrossY: a crossingbased drawing application. Proceedings of the 17th annual ACM symposium on User interface software and technology, ACM (2004), 3'12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Baudisch, P. Don't click, paint! Using toggle maps to manipulate sets of toggle switches. Proc. of the 11th annual ACM symposium on User interface software and technology, ACM (1998), 65'66.  ",
      "doi": "10.1145/288392.288574"
    },
    {
      "text": "Benko, H. and Wigdor, D. Imprecision, Inaccuracy, and Frustration: The Tale of Touch Input. In C. Müller-Tomfelde, ed., Tabletops - Horizontal Interactive Displays. Springer London, 2010, 249'275.",
      "doi": ""
    },
    {
      "text": "Benko, H., Wilson, A.D., and Baudisch, P. Precise selection techniques for multi-touch screens. Proc. of the SIGCHI conference on Human Factors in computing systems, ACM (2006), 1263'1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Bi, X., Li, Y., and Zhai, S. FFitts law: modeling finger touch with fitts' law. Proc. of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2013), 1363'1372.  ",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Buxton, W.A.S., Hill, R., and Rowley, P. Issues and techniques in touch-sensitive tablet input. SIGGRAPH Comput. Graph 19, 3 (1985), 215'224.  ",
      "doi": "10.1145/325165.325239"
    },
    {
      "text": "Cockburn, A. Understanding performance in touch selections: Tap, drag and radial pointing drag with finger, stylus and mouse. International Journal of Human Computer Studies 70, 3 (2012), 218'233.  ",
      "doi": "10.1016/j.ijhcs.2011.11.002"
    },
    {
      "text": "Dixon, M., Guimbretière, F., and Chen, N. Optimal parameters for efficient crossing-based dialog boxes. Proc. of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2008), 1623'1632.  ",
      "doi": "10.1145/1357054.1357307"
    },
    {
      "text": "Dragicevic, P. Combining crossing-based and paperbased interaction paradigms for dragging and dropping between overlapping windows. Proc. of the 17th annual ACM symposium on User interface software and technology, ACM (2004), 193'196.  ",
      "doi": "10.1145/1029632.1029667"
    },
    {
      "text": "Forlines, C. and Balakrishnan, R. Evaluating tactile feedback and direct vs. indirect stylus input in pointing and crossing selection tasks. Proc. of the twenty-sixth annual SIGCHI conference on Human factors in computing systems, ACM (2008), 1563'1572.  ",
      "doi": "10.1145/1357054.1357299"
    },
    {
      "text": "Forlines, C., Wigdor, D., Shen, C., and Balakrishnan, R. Direct-touch vs. mouse input for tabletop displays. Proc. of the SIGCHI conference on Human factors in computing systems, ACM (2007), 647'656.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "Guerreiro, T., Nicolau, H., Jorge, J., and Gonçalves, D. Towards accessible touch interfaces. Proc. of the 12th international ACM SIGACCESS conference on Computers and accessibility, ACM (2010), 19'26.  ",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "Holz, C. and Baudisch, P. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. Proc. of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2010), 581'590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Holz, C. and Baudisch, P. Understanding touch. Proc. of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2011), 2501'2510.  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "MacKenzie, I.S. Fitts' Law as a Research and Design Tool in Human-Computer Interaction. HumanComputer Interaction 7, 1 (1992), 91'139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Nakamura, T., Takahashi, S., and Tanaka, J. DoubleCrossing: A New Interaction Technique for Hand Gesture Interfaces. Proc. of the 8th Asia-Pacific conference on Computer-Human Interaction, SpringerVerlag (2008), 292'300.  ",
      "doi": "10.1007/978-3-540-70585-7_33"
    },
    {
      "text": "Roth, V. and Turner, T. Bezel swipe: conflict-free scrolling and multiple selection on mobile touch screen devices. Proc. of SIGCHI Conf. on Human Factors in Computing Systems, ACM (2009), 1523'1526.  ",
      "doi": "10.1145/1518701.1518933"
    },
    {
      "text": "Sasangohar, F., MacKenzie, I.S., and Scott, S.D. Evaluation of Mouse and Touch Input for a Tabletop Display Using Fitts' Reciprocal Tapping Task. Proc. of the Human Factors and Ergonomics Society Annual Meeting 53, 12 (2009), 839'843.",
      "doi": ""
    },
    {
      "text": "Sulaiman, A.N. and Olivier, P. Attribute gates. Proc. of the 21st annual ACM symposium on User interface software and technology, ACM (2008), 57'66.  ",
      "doi": "10.1145/1449715.1449726"
    },
    {
      "text": "Vogel, D. and Baudisch, P. Shift: a technique for operating pen-based interfaces using touch. Proc. of the SIGCHI conference on Human factors in computing systems, ACM (2007), 657'666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Wigdor, D., Williams, S., Cronin, M., et al. Ripples: utilizing per-contact visualizations to improve user interaction with touch displays. Proc. of the 22nd annual ACM symposium on User interface software and technology, ACM (2009), 3'12.  ",
      "doi": "10.1145/1622176.1622180"
    },
    {
      "text": "Wobbrock, J.O. and Gajos, K.Z. Goal Crossing with Mice and Trackballs for People with Motor Impairments: Performance, Submovements, and Design Directions. ACM Trans. Access. Comput. 1, 1 (2008), 4:1'4:37.  ",
      "doi": "10.1145/1361203.1361207"
    },
    {
      "text": "Yoshikawa, T., Shizuki, B., and Tanaka, J. HandyWidgets: local widgets pulled-out from hands. Proc. of the 2012 ACM international conference on Interactive tabletops and surfaces, ACM (2012), 197' 200.  ",
      "doi": "10.1145/2396636.2396667"
    }
  ]
}