{
  "doi": "10.1145/2556288.2557238",
  "title": "Structured labeling for facilitating concept evolution in machine learning",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3075-3084",
  "year": 2014,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Labeling data is a seemingly simple task required for training many machine learning systems, but is actually fraught with problems. This paper introduces the notion of concept evolution, the changing nature of a person's underlying concept (the abstract notion of the target class a person is labeling for, e.g., spam email, travel related web pages) which can result in inconsistent labels and thus be detrimental to machine learning. We introduce two structured labeling solutions, a novel technique we propose for helping people define and refine their concept in a consistent manner as they label. Through a series of five experiments, including a controlled lab study, we illustrate the impact and dynamics of concept evolution in practice and show that structured labeling helps people label more consistently in the presence of concept evolution than traditional labeling.",
  "authors": [
    {
      "name": "Todd Kulesza",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/do/10.1145/contrib-81413606637/rel-imgonly/basement.jpg",
      "acmid": "81413606637",
      "orcid": "missing"
    },
    {
      "name": "Saleema Amershi",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323487634",
      "orcid": "missing"
    },
    {
      "name": "Rich Caruana",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100100877",
      "orcid": "0000-0002-6383-7786"
    },
    {
      "name": "Danyel Fisher",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81309487122/rel-imgonly/fn5a3561-copy.jpg",
      "acmid": "81309487122",
      "orcid": "missing"
    },
    {
      "name": "Denis Charles",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309501685",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amershi, S., Cakmak, M., Knox, W. B., & Kulesza, T. Power to the people: The role of humans in interactive machine learning. AI Magazine (under review).",
      "doi": ""
    },
    {
      "text": "Amershi, S., Lee, B., Kapoor, A., Mahajan, R., & Christian, B. CueT: Human-guided fast and accurate network alarm triage. In Proc. CHI, ACM (2011), 157--166.  ",
      "doi": "10.1145/1978942.1978966"
    },
    {
      "text": "Basu, S., Fisher, D., Drucker, S. M., & Lu, H. Assisting users with clustering tasks by combining metric learning and classification. In Proc. AAAI (2010), 394--400.",
      "doi": ""
    },
    {
      "text": "Bennett, P. N., Chickering, D. M., & Mityagin, A. Learning consensus opinion: mining data from a labeling game. In Proc. of WWW (2009), 121--130.  ",
      "doi": "10.1145/1526709.1526727"
    },
    {
      "text": "Billsus, D., & Pazzani, M. J. A hybrid user model for news story classification. In Proc. UM (1999), 99--108. ",
      "doi": "10.5555/317328.317338"
    },
    {
      "text": "Blackwell, A. F. First steps in programming: A rationale for attention investment models. In Proc. HCC, IEEE (2002), 2--10. ",
      "doi": "10.5555/795687.797842"
    },
    {
      "text": "Borlund, P. The concept of relevance in IR. Journal of the American Society for information Science and Technology 54, 10 (2003), 913--925.  ",
      "doi": "10.1002/asi.10286"
    },
    {
      "text": "Brain, D., & Webb, G. On the effect of data set size on bias and variance in classification learning. In D. Richards, G. Beydoun, A. Hoffmann, & P. Compton (Eds.), Proc. of the Fourth Australian Knowledge Acquisition Workshop (1999), 117--128.",
      "doi": ""
    },
    {
      "text": "Brodley, C. E., & Friedl, M. A. Identifying mislabeled training data. Journal of Artificial Intelligence Research 11 (1999), 131--167.",
      "doi": "10.5555/3013545.3013548"
    },
    {
      "text": "Bshouty, N. H., Eiron, N., & Kushilevitz, E. PAC learning with nasty noise. Theoretical Computer Science 288, 2 (2002), 255--275.  ",
      "doi": "10.1016/S0304-3975%2801%2900403-0"
    },
    {
      "text": "Carterette, B., Bennett, P. N., Chickering, D. M., & Dumais, S. T. Here or there. Advances in Information Retrieval (2008), 16--27. ",
      "doi": "10.5555/1793274.1793281"
    },
    {
      "text": "Conway, D., & White, J. M. Machine Learning for Email: Spam Filtering and Priority Inbox. O'Reilly (2011). ",
      "doi": "10.5555/2161683"
    },
    {
      "text": "Cunningham, P., Nowlan, N., Delany, S. J., & Haahr, M. A case-based approach to spam filtering that can track concept drift. The ICCBR 3 (2003).",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Dumais, S., Robertson, G., Dziadosz, S., Tiernan, S., & Van Dantzich, M. Visualizing implicit queries for information management and retrieval. In Proc.CHI, ACM (1999), 560--567.  ",
      "doi": "10.1145/302979.303158"
    },
    {
      "text": "Gabrilovich, E., Dumais, E., & Horvitz, E. NewsJunkie: Providing personalized newsfeeds via analysis of information novelty. In Proc. WWW (2004), 482--490.  ",
      "doi": "10.1145/988672.988738"
    },
    {
      "text": "Google. Search quality rating guidelines. Online: http://google.com/insidesearch/howsearchworks/assets/searchqualityevaluatorguidelines.pdf (2012).",
      "doi": ""
    },
    {
      "text": "Hubert, L., & Arabie, P. Comparing partitions. Journal of classification 2, 1 (1985), 193--218.",
      "doi": ""
    },
    {
      "text": "Kotsiantis, S. B., Zaharakis, I. D., & Pintelas, P. E. Supervised machine learning: A review of classification techniques. Informatica 31 (2007), 249--268.",
      "doi": ""
    },
    {
      "text": "Law, E., Settles, B., & Mitchell, T. Learning to tag using noisy labels. In Proc. ECML (2010), 1--29.",
      "doi": ""
    },
    {
      "text": "McGee, M. A look inside Bing's human search rater guidelines. Online: http://searchengineland.com/bing-search-quality-rating-guidelines-130592 (2012).",
      "doi": ""
    },
    {
      "text": "Paul, S. A., & Morris, M. R. Sensemaking in collaborative web search. Human-Computer Interaction 26, 1-2 (2011), 72--122.",
      "doi": ""
    },
    {
      "text": "Rajaraman, A. & Ullman, J. D. \"Data Mining\". Mining of Massive Datasets (2011), 1--17.",
      "doi": ""
    },
    {
      "text": "Russell, D. M., Stefik, M. J., Pirolli, P., & Card, S. K. The cost structure of sensemaking. In Proc. of INTERACT and CHI, ACM (1993), 269--276.  ",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D. C., Thiel, D., & Van Dantzich, M. Data mountain: using spatial memory for document management. In Proc. UIST, ACM (1998), 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Santos, J. M., & Embrechts, M. On the use of the adjusted rand index as a metric for evaluating supervised classification. In Artificial Neural Networks - ICANN (2009), 175--184.  ",
      "doi": "10.1007/978-3-642-04277-5_18"
    },
    {
      "text": "Sheng, V. S., Provost, F., & Ipeirotis, P. G. Get another label? Improving data quality and data mining using multiple, noisy labelers. In Proc. KDD (2008), 614--622.  ",
      "doi": "10.1145/1401890.1401965"
    },
    {
      "text": "Stanley, K. O. Learning concept drift with a committee of decision trees. Tech. Report UT-AI-TR-03-302, University of Texas at Austin (2003).",
      "doi": ""
    },
    {
      "text": "Teevan, J., Cutrell, E., Fisher, D., Drucker, S. M., Ramos, G., André, P., & Hu, C. Visual snippets: summarizing web pages for search and revisitation. In Proc. CHI, ACM (2009), 2023--2032.  ",
      "doi": "10.1145/1518701.1519008"
    },
    {
      "text": "Tsymbal, A. The problem of concept drift: definitions and related work. Computer Science Dept., Trinity College Dublin (2004).",
      "doi": ""
    },
    {
      "text": "Valiant, L. G. Learning disjunctions of conjunctions. In IJCAI (1985), 560--566. ",
      "doi": "10.5555/1625135.1625242"
    },
    {
      "text": "Westergren, T. The music genome project. Online: http://pandora.com/mgp (2007).",
      "doi": ""
    },
    {
      "text": "Whittaker, S., & Hirschberg, J. The character, value, and management of personal paper archives. ACM TOCHI 8, 2 (2001), 150--170.  ",
      "doi": "10.1145/376929.376932"
    },
    {
      "text": "Widmer, G., & Kubat, M. Learning in the presence of concept drift and hidden contexts. Machine learning 23, 1 (1996), 69--101.  ",
      "doi": "10.1023/A%3A1018046501280"
    },
    {
      "text": "Yih, W. & Jiang, N. Similarity models for ad relevance measures. In MLOAD - NIPS Workshop on online advertising (2010).",
      "doi": ""
    },
    {
      "text": "Yoshii, K., Goto, M., Komatani, K., Ogata, T., & Okuno, H. G. An efficient hybrid music recommender system using an incrementally trainable probabilistic generative model. IEEE Transactions on Audio, Speech, and Language Processing 16, 2 (2008), 435--447.  ",
      "doi": "10.1109/TASL.2007.911503"
    }
  ]
}