{
  "doi": "10.1145/2556288.2557095",
  "title": "The implicit fan cursor: a velocity dependent area cursor",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "753-762",
  "year": 2014,
  "badges": [],
  "abstract": "We present the Implicit Fan Cursor (IFC) - a novel target pointing technique using a cursor with a fan-shape activation area. The IFC couples the cursor's activation area with its velocity, i.e., the speed and direction of the mouse motion, behaving like a 2D spotlight cursor at low speed and a circular area cursor at high speed. Thus, it enables the user to precisely acquire distant targets at low speed and easily acquire nearest targets at high speed, without explicit mode switching. This technique minimizes cursor movement, while taking into consideration of the precision of cursor movement at different speeds. It also ensures that only one target is captured at any time. The results of our controlled experiments show that the IFC outperforms the point cursor and the area cursor techniques, particularly in terms of cursor moving distance, and that its performance can be accurately modeled using the Fitts' law.",
  "tags": [
    "area cursor",
    "implicit fan cursor",
    "velocity-aware pointing",
    "fitts' law"
  ],
  "authors": [
    {
      "name": "Xiaojun Su",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959033857",
      "orcid": "missing"
    },
    {
      "name": "Oscar Kin-Chung Au",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451593010",
      "orcid": "missing"
    },
    {
      "name": "Rynson W.H. Lau",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451597133",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Asano, T., Sharlin, E., Kitamura, Y., Takashima, K., and Kishino, F. Predictive interaction using the delphian desktop. In Proc. ACM UIST (2005), 133--141.  ",
      "doi": "10.1145/1095034.1095058"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B., and Zierlinger, A. Drag-and-pop and drag-and-pick: Techniques for accessing remote screen content on touch-and pen-operated systems. In Proc. INTERACT (2003), 57--64.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Zotov, A., Cutrell, E., and Hinckley, K. Starburst: a target expansion algorithm for non-uniform target distributions. In Proc. AVI (2008), 129--137.  ",
      "doi": "10.1145/1385569.1385592"
    },
    {
      "text": "Bezerianos, A., and Balakrishnan, R. The vacuum: facilitating the manipulation of distant objects. In Proc. ACM CHI (2005), 361--370.  ",
      "doi": "10.1145/1054972.1055023"
    },
    {
      "text": "Blanch, R., Guiard, Y., and Beaudouin-Lafon, M. Semantic pointing: improving target acquisition with control-display ratio adaptation. In Proc. ACM CHI (2004), 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Blanch, R., and Ortega, M. Rake cursor: improving pointing performance with concurrent input channels. In Proc. ACM CHI (2009), 1415--1418.  ",
      "doi": "10.1145/1518701.1518914"
    },
    {
      "text": "Blanch, R., and Ortega, M. Benchmarking pointing techniques with distractors: Adding a density factor to fitts' pointing paradigm. In Proc. ACM CHI (2011), 1629--1638.  ",
      "doi": "10.1145/1978942.1979180"
    },
    {
      "text": "Chapuis, O., Labrune, J.-B., and Pietriga, E. Dynaspot: speed-dependent area cursor. In Proc. ACM CHI (2009), 1391--1400.  ",
      "doi": "10.1145/1518701.1518911"
    },
    {
      "text": "Cockburn, A., and Brock, P. Human on-line response to visual and motor target expansion. In Proc. GI (2006), 81--87. ",
      "doi": "10.5555/1143079.1143093"
    },
    {
      "text": "Cockburn, A., and Firth, A. Improving the acquisition of small targets. In Proc. People and Computers XVII: BCS Conf. on Human Computer Interaction (2003), 181--196.",
      "doi": ""
    },
    {
      "text": "Grossman, T., and Balakrishnan, R. The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. ACM CHI (2005), 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. Object pointing: a complement to bitmap pointing in guis. In Proc. GI (2004), 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Gutwin, C. Improving focus targeting in interactive fisheye views. In Proc. ACM CHI (2002), 267--274.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "Hertzum, M., and Hornbaek, K. Input techniques that dynamically change their cursor activation area: A comparison of bubble and cell cursors. International Journal of Human-Computer Studies 65, 10 (2007), 833--851.  ",
      "doi": "10.1016/j.ijhcs.2007.05.001"
    },
    {
      "text": "Igarashi, T., and Hinckley, K. Speed-dependent automatic zooming for browsing large documents. In Proc. ACM UIST (2000), 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Kabbash, P., and Buxton, W. The \"prince\" technique: Fitts' law and selection using area cursors. In Proc. CHI (1995), 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Kobayashi, M., and Igarashi, T. Ninja cursors: using multiple cursors to assist target acquisition on large screens. In Proc. ACM CHI (2008), 949--958.  ",
      "doi": "10.1145/1357054.1357201"
    },
    {
      "text": "Lank, E., Cheng, Y., and Ruiz, J. Endpoint prediction using motion kinematics. In Proc. ACM CHI (2007), 637--646.  ",
      "doi": "10.1145/1240624.1240724"
    },
    {
      "text": "Laukkanen, J., Isokoski, P., and Räihä, K. The cone and the lazy bubble: two efficient alternatives between the point cursor and the bubble cursor. In Proc. ACM CHI (2008), 309--312.  ",
      "doi": "10.1145/1357054.1357107"
    },
    {
      "text": "MacKenzie, I. Fitts' law as a research and design tool in human-computer interaction. Human Computer Interaction 7, 1 (1992), 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "McGuffin, M., and Balakrishnan, R. Fitts' law and expanding targets: Experimental studies and designs for user interfaces. ACM Trans. on Computer Human Interaction 12, 4 (Dec. 2005), 388--422.  ",
      "doi": "10.1145/1121112.1121115"
    },
    {
      "text": "Moscovich, T., and Hughes, J. Multi-finger cursor techniques. In Proc. GI (2006), 1--7. ",
      "doi": "10.5555/1143079.1143081"
    },
    {
      "text": "Pietriga, E., and Appert, C. Sigma lenses: focus-context transitions combining space, time and translucence. In Proc. ACM CHI (2008), 1343--1352.  ",
      "doi": "10.1145/1357054.1357264"
    },
    {
      "text": "Soukoreff, R., and MacKenzie, I. Towards a standard for pointing device evaluation, perspectives on 27 years of fitts' law research in hci. International Journal of Human-Computer Studies 61, 6 (Dec. 2004), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., and Hudson, S. Making computers easier for older adults to use: area cursors and sticky icons. In Proc. ACM CHI (1997), 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Yin, J., and Ren, X. The beam cursor: A pen-based technique for enhancing target acquisition. In Proc. HCI (2006), 119--134.",
      "doi": ""
    }
  ]
}