{
  "doi": "10.1145/2556288.2557138",
  "title": "Interaction on the edge: offset sensing for small devices",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "169-178",
  "year": 2014,
  "badges": [],
  "abstract": "The touch screen interaction paradigm, currently dominant in mobile devices, begins to fail when very small systems are considered. Specifically, \"fat fingers\", a term referring to the fact that users' extremities physically obstruct their view of screen content and feedback, become particularly problematic. This paper presents a novel solution for this issue based on sensing touches to the perpendicular edges of a device featuring a front-mounted screen. The use of such offset contact points ensures that both a user's fingers and the device screen remain clearly in view throughout a targeting operation. The configuration also supports a range of novel interaction scenarios based on the touch, grip and grasp patterns it affords. To explore the viability of this concept, this paper describes EdgeTouch, a small (6 cm) hardware prototype instantiating this multi-touch functionality. User studies characterizing targeting performance, typical user grasps and exploring input affordances are presented. The results show that targets of 7.5-22.5 degrees in angular size are acquired in 1.25-1.75 seconds and with accuracy rates of 3%-18%, promising results considering the small form factor of the device. Furthermore, grasps made with between two and five fingers are robustly identifiable. Finally, we characterize the types of input users envisage performing with EdgeTouch, and report occurrence rates for key interactions such as taps, holds, strokes and multi-touch and compound input. The paper concludes with a discussion of the interaction scenarios enabled by offset sensing.",
  "tags": [
    "pointing",
    "touch",
    "edge-of-device input",
    "mobile devices"
  ],
  "authors": [
    {
      "name": "Ian Oakley",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367387",
      "orcid": "0000-0001-5834-8577"
    },
    {
      "name": "Doyoung Lee",
      "institution": "Ulsan National Institute of Science and Technology, Ulsan, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959094857",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashbrook, D. Lyons, K., and Starner, T. 2008. An investigation into round touchscreen wristwatch interaction. In Proc. of MobileHCI'08, 311--314.  ",
      "doi": "10.1145/1409240.1409276"
    },
    {
      "text": "Baudisch, P. and Chu, G. 2009. Back-of-device interaction allows creating very small touch devices. In Proc. of CHI '09. ACM, NY, USA, 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Blasko, G. and Feiner, S. 2004. An Interaction System for Watch Computers Using Tactile Guidance and Bidirectional Segmented Strokes. Proc. ISWC'04. IEEE.  ",
      "doi": "10.1109/ISWC.2004.6"
    },
    {
      "text": "Butler, A., Izadi, S. and Hodges, S. 2008. SideSight: multi-\"touch\" interaction around small devices. In Proc. of UIST '08. ACM, New York, NY, USA, 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Cheng, L.-P., Liang, H.-S., Wu, C. Y., and Chen, M. Y. 2013. iGrasp: grasp-based adaptive keyboard for mobile devices. In Proceedings CHI '13. ACM, 3037--3046.  ",
      "doi": "10.1145/2470654.2481422"
    },
    {
      "text": "De Luca, A., von Zezschwitz, E., Nguyen, N. D. H, Maurer, M. E., Rubegni, E., Scipioni, M. P. and Langheinrich, M. 2013. Back-of-device authentication on smartphones. In Proceedings of CHI '13. ACM Press.  ",
      "doi": "10.1145/2470654.2481330"
    },
    {
      "text": "Gemperle, F., Kasabach, C., Stivoric, J., Bauer, M. and Martin, R. 1998. Design for Wearability. In Proceedings of ISWC '98. IEEE Computer Society. ",
      "doi": "10.5555/857199.857998"
    },
    {
      "text": "Harrison, C. and Hudson, S. E. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proc. UIST '09. 121--124.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Kelion, L. and Lee, D. \"Samsung unveils Galaxy Gear smartwatch accessory\", BBC News, accessed Sept 2013, http://www.bbc.co.uk/news/technology-23961692",
      "doi": ""
    },
    {
      "text": "Lee, S. S., Kim, S., Jin, B., Choi, E., Kim, B., Jia, X., Kim, D. and Lee, K. 2010. How users manipulate deformable displays as input devices. In Proceedings of CHI '10. ACM, New York, NY, USA, 1647--1656.  ",
      "doi": "10.1145/1753326.1753572"
    },
    {
      "text": "Roudaut, A., Huot, S. and Lecolinet, E. 2008. TapTap and MagStick: improving one-handed target acquisition on small touch-screens. In Proc. of AVI '08. 146--153.  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Sato, M., Poupyrev, I. and Harrison, C. 2012. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proc. of CHI '12. 483--492.  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Siek, K. A., Rogers, Y., and Connelly, K. H. Fat Finger Worries: How Older and Younger Users Physically Interact with PDAs. In Proc. INTERACT'05, 267--280.  ",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Song, H., Benko, H., Guimbretiere, F., Izadi, S., Cao, X., and Hinckley, K. 2011. Grips and gestures on a multi-touch pen. In Proc. of CHI '11. ACM, NY, USA.  ",
      "doi": "10.1145/1978942.1979138"
    },
    {
      "text": "Spelmezan, D., Appert, C., Chapuis, O., and Pietriga E. 2013. Side pressure for bidirectional navigation on small devices. In Proceedings of MobileHCI '13. 11--20.  ",
      "doi": "10.1145/2493190.2493199"
    },
    {
      "text": "Taylor, B. T. and Bove, Jr. V. M. 2009. Graspables: grasp-recognition as a user interface. In Proc. CHI '09. ACM, New York, NY, USA, 917--926.  ",
      "doi": "10.1145/1518701.1518842"
    },
    {
      "text": "Vogel, D. & Baudisch, P. Shift: A Technique for Operating Pen-Based Interfaces Using Touch. In Proc. CHI'07, pp. 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Wolf, K., Müller-Tomfelde, C., Cheng, K. and Wechsung, I. 2012. PinchPad: performance of touchbased gestures while grasping devices. In Proceedings of TEI '12. ACM, New York, NY, USA, 103--110.  ",
      "doi": "10.1145/2148131.2148155"
    },
    {
      "text": "Yu, N. H., Tsai, S. S., Hsiao, I. C., Tsai, D. J., Lee, M. H., Chen, M. Y., and Hung, Y. P. 2011. Clip-on gadgets: expanding multi-touch interaction area with unpowered In Proc. of UIST '11, 367--372.  ",
      "doi": "10.1145/2047196.2047243"
    }
  ]
}