{
  "doi": "10.1145/2556288.2557303",
  "title": "Effects of public vs. private automated transcripts on multiparty communication between native and non-native english speakers",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "843-852",
  "year": 2014,
  "badges": [],
  "abstract": "Real-time transcripts generated by automated speech recognition (ASR) technologies have the potential to facilitate communication between native speakers (NS) and non-native speakers (NNS). Previous studies of ASR have focused on how transcripts aid NNS speech comprehension. In this study, we examine whether transcripts benefit multiparty real-time conversation between NS and NNS. We hypothesized that ASR transcripts would be more beneficial when the transcripts were publicly shared by all group members as opposed to when they were seen only by the NNS. To test our hypothesis, we conducted a lab experiment in which 14 groups of native and non-native speakers engaged in a story-telling task. Half of the groups received private transcripts that were available only to the NNS; the other half received publicly shared transcripts that were available to all group members. NS spoke more clearly, and both NS and NNS rated the quality of communication higher, when transcripts were publicly shared. These findings inform the design of future tools to support multilingual group communication.",
  "authors": [
    {
      "name": "Ge Gao",
      "institution": "NTT Communication Science Labs, Kyoto, Kyoto, Japan & Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81498646640/rel-imgonly/ge_photo.png",
      "acmid": "81498646640",
      "orcid": "0000-0003-2733-2681"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Labs, Kyoto, Kyoto, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Ari MJ Hautasaari",
      "institution": "NTT Communication Science Labs, Kyoto, Kyoto, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467668347",
      "orcid": "0000-0002-5351-4035"
    },
    {
      "name": "Andy Echenique",
      "institution": "NTT Communication Science Lab, Kyoto, Kyoto, Japan & University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593075",
      "orcid": "missing"
    },
    {
      "name": "Susan R. Fussell",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benzeghiba, M., De Mori, R., Deroo, O., Dupont, S., Erbes, T., Jouvet, D., & Wellekens, C. (2007). Automatic speech recognition and speech variability: A review. Speech Communication, 49(10), 763--786.  ",
      "doi": "10.1016/j.specom.2007.02.006"
    },
    {
      "text": "Bradlow, A. R., & Bent, T. (2002). The clear speech effect for non-native listeners. The Journal of the Acoustical Society of America, 112, 272--284.",
      "doi": ""
    },
    {
      "text": "Bradlow, A. R., & Bent, T. (2008). Perceptual adaptation to non-native speech. Cognition, 106(2), 707--729.",
      "doi": ""
    },
    {
      "text": "Clark, H. H. & Brennan, S. E. (1991). Grounding in communication. In L. B. Resnick, R. M. Levine, & S. D. Teasley (Eds.). Perspectives on socially shared cognition (pp. 127--149). Washington, DC: APA.",
      "doi": ""
    },
    {
      "text": "Crookes, G., Rulon, K. A., & Enright, D. S. (1988). Topic and feedback in native-speaker and non-native-speaker conversation. TESOL Quarterly, 22(4), 675--681.",
      "doi": ""
    },
    {
      "text": "Desanctis, G., & Monge, P. (1998). Communication processes for virtual organizations. Journal of Computer-Mediated Communication, 3(4), 1--16.",
      "doi": ""
    },
    {
      "text": "Dunkel, P. (1991). Listening in the native and second/foreign language: Toward an integration of research and practice. Tesol Quarterly, 25(3), 431--457.",
      "doi": ""
    },
    {
      "text": "Dragon Natually Speaking (DNS): Dragon Solutions Field Report. Full text accessible at: http://www.nuance.com/naturallyspeaking/pdf/wp_DNS_Field_Reporting.pdf.",
      "doi": ""
    },
    {
      "text": "Feely, A.-J., & Harzing, A. W. K. (2003). Language management in multinational companies. Cross-Cultural Management: An Int'l Journal, 10, 37--52.",
      "doi": ""
    },
    {
      "text": "Hart, S. G. & Staveland, L. E. (1988). Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In P. A. Hancock and N. Meshkati (Eds.) Human Mental Workload. Amsterdam: North Holland Press.",
      "doi": ""
    },
    {
      "text": "Krause, J. C., & Braida, L. D. (1995). The effects of speaking rate on the intelligibility of speech for various speaking modes. The Journal of the Acoustical Society of America, 98, 2982.",
      "doi": ""
    },
    {
      "text": "Kurhila, S. (2001). Correction in talk between native and non-native speaker. Journal of Pragmatics, 33(7), 1083--1110.",
      "doi": ""
    },
    {
      "text": "Li, N., & Rosson, M. B. (2012). At a different tempo: what goes wrong in online cross-cultural group chat? In Proc. of the 17th ACM International Conference on Supporting Group Work, 145--154.  ",
      "doi": "10.1145/2389176.2389200"
    },
    {
      "text": "Li, N., & Rosson, M. B. (2012). Instant annotation: early design experiences in supporting cross-cultural group chat. In Proc. of the 30th ACM International Conference on Design of Communication, 147--156.  ",
      "doi": "10.1145/2379057.2379088"
    },
    {
      "text": "Luisa, M., Lecumberri, G., Cooke, M., Culter, A. (2010). Nonnative speech perception in adverse conditions: A Review. Speech Communication, 52, 2010, 864--886.  ",
      "doi": "10.1016/j.specom.2010.08.014"
    },
    {
      "text": "Nabelek, A. K., Donahue, A. M. (1984). Perception of consonants in reverberation by native and non-native listeners. Journal of Acoustical Society of America, 75, 1984, 632--634.",
      "doi": ""
    },
    {
      "text": "One Thousand Most Frequent Words by British National Corpus. Full list accessible at: http://simple.wiktionary.org/wiki/Wiktionary:Most_frequent_1000_words_in_English.",
      "doi": ""
    },
    {
      "text": "Pan, Y., Jiang, D., Picheny, M., & Qin, Y. (2009, April). Effects of real-time transcription on non-native speaker's comprehension in computer-mediated communications. In Proc. of CHI 2009, 2353--2356.  ",
      "doi": "10.1145/1518701.1519061"
    },
    {
      "text": "Pan, Y., Jiang, D., Yao, L., Picheny, M., & Qin, Y. (2010, April). Effects of automated transcription quality on non-native speakers' comprehension in real-time computer-mediated communication. In Proc. of CHI 2010, 1725--1734.  ",
      "doi": "10.1145/1753326.1753584"
    },
    {
      "text": "Picheny, M. A., Durlach, N. I., & Braida, L. D. (1989), Speaking clearly for the hard of hearing III: An attempt to determine the contribution of speaking rate to difference in intelligibility between clear and conversational speech. Journal of Speech and Hearing Research, 32, 600--603.",
      "doi": ""
    },
    {
      "text": "Rubin, J. (1994). A review of second language listening comprehension research. The Modern Language Journal, 78(2), 199--221.",
      "doi": ""
    },
    {
      "text": "Shachaf, P. (2008). Cultural diversity and information and communication technology impacts on global virtual teams: An exploratory study. Information & Management, 45(2), 131--142.  ",
      "doi": "10.1016/j.im.2007.12.003"
    },
    {
      "text": "Shimogori, N., Ikeda, T., & Tsuboi, S. (2010). Automatically generated captions: will they help nonnative speakers communicate in English? In Proc. of the 3rd International Conference on Intercultural Collaboration, 79--86.  ",
      "doi": "10.1145/1841853.1841865"
    },
    {
      "text": "Takano, Y. & Noda, A. (1995). Interlanguage dissimilarity enhances the decline of thinking ability during foreign language processing. Lang. Learn., 45, 657--681.",
      "doi": ""
    },
    {
      "text": "Van Compernolle, D. (2001). Recognizing speech of goats, wolves, sheep and non-natives. Speech Communication, 35(1), 71--79.  ",
      "doi": "10.1016/S0167-6393%2800%2900096-0"
    },
    {
      "text": "Vigil, N., & Oller, J. (1976). Rule fossilization: A tentative model. Language Learning, 26, 281--295.",
      "doi": ""
    },
    {
      "text": "Yamashita, N., Echenique, A., Ishida, T., & Hautasaari, A. (2013, February). Lost in transmittance: how transmission lag enhances and deteriorates multilingual collaboration. In Proc. of CSCW 2013, 923--934.  ",
      "doi": "10.1145/2441776.2441881"
    },
    {
      "text": "Yao, L., Pan, Y. X., & Jiang, D. N. (2011). Effects of Automated Transcription Delay on Non-native Speakers' Comprehension in Real-Time Computer-Mediated Communication. In Human-Computer Interaction - INTERACT 2011, 207--214. ",
      "doi": "10.5555/2042053.2042077"
    },
    {
      "text": "Yuan, C. W., Setlock, L. D., Cosley, D., & Fussell, S. R. (2013). Understanding informal communication in multilingual contexts. In Proc. of CSCW 2013, 909--9.  ",
      "doi": "10.1145/2441776.2441880"
    }
  ]
}