{
  "doi": "10.1145/2556288.2557168",
  "title": "Evaluation of hear-through sound localization",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "267-270",
  "year": 2014,
  "badges": [],
  "abstract": "Listening and interacting with audio commonly relies on using earphones which limit the ability of users to perceive their auditory environment. Earphone sets that integrate miniature microphones on their exterior can, however, be used to hear-through the auditory environment. We present an evaluation study in which sound localization when wearing such a hear-through system is compared to normal earphones, open headphones and unblocked ears. Although localization performance is improved compared to open headphones, we find that it is compromised in comparison to listening without earphones because confusions of sound direction increase and localization judgment distributions are more dispersed and show a weaker correlation to the test directions. The implications of the results to human computer interaction and possible improvements to hear-through system design are discussed.",
  "tags": [
    "hear-through systems",
    "auditory augmented reality"
  ],
  "authors": [
    {
      "name": "Georgios Marentakis",
      "institution": "Institute for Electronic Music and Acoustics, University of Music and Performing Arts Graz, Österreich, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100642927",
      "orcid": "missing"
    },
    {
      "name": "Rudolfs Liepins",
      "institution": "Institute for Electronic Music and Acoustics, University of Music and Performing Arts Graz, Österreich, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959260557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albrecht, R., Lokki, T., and Saviola, L. A mobile augmented reality audio system with binaural microphones. In Proceedings of IWS (Stockholm, Sweden, 2011), 7--11.  ",
      "doi": "10.1145/2019335.2019337"
    },
    {
      "text": "Brewster, S., Lumsden, J., Bell, M., Hall, M., and Tasker, S. Multimodal 'eyes-free' interaction techniques for wearable devices. In CHI '03, ACM (2003), 473--480.  ",
      "doi": "10.1145/642611.642694"
    },
    {
      "text": "Carlile, S., Leong, P., and Hyams, S. The nature and distribution of errors in sound localization by human listeners. Hearing Research 114, 1-2 (1997), 179--96.",
      "doi": ""
    },
    {
      "text": "Christensen, F., Hoffmann, P. F., and Hammershøi, D. Measuring directional characteristics of in-ear recording devices. In Audio Engineering Society Convention 134 (May 2013).",
      "doi": ""
    },
    {
      "text": "Cohen, M., and Ludwig, L. F. Computer-supported cooperative work and groupware. Academic Press Ltd., London, UK, UK, 1991, ch. Multidimensional Audio Window Management, 193--210. ",
      "doi": "10.5555/122825.122813"
    },
    {
      "text": "Fisher, N. I., Embleton, B. J. J., and Lewis, T. Statistical analysis of spherical data / N.I. Fisher, T. Lewis, B. J. J. Embleton. Cambridge University Press, Cambridge {England}; Melbourne, 1987.",
      "doi": ""
    },
    {
      "text": "Hammershøi, D., and Møller, H. Sound transmission to and within the human ear canal. The Journal of the Acoustical Society of America 100, 1 (1996), 408--427.",
      "doi": ""
    },
    {
      "text": "8. Härmä, A., Jakka, J., Tikander, M., Karjalainen, M., Lokki, T., Hiipakka, J., and Lorho, G. Augmented reality audio for mobile and wearable appliances. J. Audio Eng. Soc 52, 6 (2004), 618--639.",
      "doi": ""
    },
    {
      "text": "Hiipakka, M. Estimating pressure at the eardrum for binaural reproduction. PhD thesis, Dept. of Signal Processing and Acoustics, Aalto University, Finland, 2012.",
      "doi": ""
    },
    {
      "text": "Lichenstein, R., Smith, D. C., Ambrose, J. L., and Moody, L. A. Headphone use and pedestrian injury and death in the USA: 2004 - 2011. Injury Prevention (2012).",
      "doi": ""
    },
    {
      "text": "Meng, L.-X., Rosental, R., and Rubin, D. Comparing correlated correlation coefficients. Psychological Bulletin 111, 1 (1992), 172--175.",
      "doi": ""
    },
    {
      "text": "Mueller, F., and Karau, M. Transparent hearing. In CHI 2002 (2002), 730--731.  ",
      "doi": "10.1145/506443.506569"
    },
    {
      "text": "Pralong, D., and Carlile, S. The role of individualized headphone calibration for the generation of high fidelity virtual auditory space. The Journal of the Acoustical Society of America 100, 6 (1996), 3785--3793.",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Leichtenstern, K., Callaghan, V., Holleis, P., Schmidt, A., and Chin, J. An experimental comparison of physical mobile interaction techniques: Touching, pointing and scanning. In UbiComp'06, Springer-Verlag (Berlin, Heidelberg, 2006), 87--104.  ",
      "doi": "10.1007/11853565_6"
    },
    {
      "text": "Strachan, S., Eslambolchilar, P., Murray-Smith, R., Hughes, S., and O'Modhrain, S. Gpstunes: Controlling navigation via audio feedback. In MobileHCI '05, ACM (2005), 275--278.  ",
      "doi": "10.1145/1085777.1085831"
    },
    {
      "text": "Tikander, M. Development and Evaluation of Augmented Reality Audio Systems. PhD thesis, Helsinki University of Technology, 2009.",
      "doi": ""
    },
    {
      "text": "Vazquez-Alvarez, Y., Oakley, I., and Brewster, S. A. Auditory display design for exploration in mobile audio-augmented reality. Personal and Ubiquitous Computing 16, 8 (2012), 987--999.  ",
      "doi": "10.1007/s00779-011-0459-0"
    },
    {
      "text": "Wightman, F. L., and Kistler, D. J. The dominant role of low-frequency interaural time differences in sound localization. The Journal of the Acoustical Society of America 91, 3 (1992), 1648--1661.",
      "doi": ""
    },
    {
      "text": "Zhao, S., Dragicevic, P., Chignell, M., Balakrishnan, R., and Baudisch, P. Earpod: Eyes-free menu selection using touch input and reactive audio feedback. In CHI '07, ACM (New York, NY, USA, 2007), 1395--1404.  ",
      "doi": "10.1145/1240624.1240836"
    }
  ]
}