{
  "doi": "10.1145/2556288.2557288",
  "title": "On the selection of 2D objects using external labeling",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2255-2258",
  "year": 2014,
  "badges": [],
  "abstract": "We present an external labeling laid over small and/or overlapping 2D objects as an efficient representation for their selection. The approximation of objects with points allows us to transform the labeling problem to graph layout problem, which we solve by means of force-based algorithm. The input parameters allow us to influence the resulting layout of label boxes (e.g. to adapt their distance for imprecise input devices). In a study with 15 participants two implementations of our algorithm were compared against labeling method, where all label boxes share the same offset from corresponding objects. The results of the study show that implementation using a special functionality (temporary freezing of the label box position recalculation) was 14% faster with a comparable accuracy. The subjective evaluation revealed that the implementation with temporary freezing is perceived as most comfortable, fastest and most accurate. The implementation without temporary freezing showed much higher error rate and cannot be recommended.",
  "tags": [
    "visualization",
    "external labeling",
    "object selection",
    "user study"
  ],
  "authors": [
    {
      "name": "Jan Balata",
      "institution": "Czech Technical University in Prague, Prague, Czech Republic",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458774657",
      "orcid": "missing"
    },
    {
      "name": "Ladislav Cmolik",
      "institution": "Czech Technical University in Prague, Prague, Czech Republic",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384604716",
      "orcid": "missing"
    },
    {
      "name": "Zdenek Mikovec",
      "institution": "Czech Technical University in Prague, Prague, Czech Republic",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100161531",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bertini, E., Rigamonti, M., and Lalanne, D. Extended excentric labeling. Computer Graphics Forum 28, 3 (2009), 927--934.  ",
      "doi": "10.1111/j.1467-8659.2009.01456.x"
    },
    {
      "text": "Fekete, J.-D., and Plaisant, C. Excentric labeling: Dynamic neighborhood labeling for data visualization. In CHI '99, ACM (1999), 512--519.  ",
      "doi": "10.1145/302979.303148"
    },
    {
      "text": "Fink, M., Haunert, J.-H., Schulz, A., Spoerhase, J., and Wolff, A. Algorithms for labeling focus regions. Visualization and Computer Graphics, IEEE Trans. on 18, 12 (2012), 2583--2592.",
      "doi": ""
    },
    {
      "text": "Fruchterman, T. M. J., and Reingold, E. M. Graph drawing by force-directed placement. Software Practice & Experience 21, 11 (1991), 1129--1164.  ",
      "doi": "10.1002/spe.4380211102"
    },
    {
      "text": "Götzelmann, T., Hartmann, K., and Strothotte, T. Agent-based annotation of interactive 3D vis.s. In SG '06, vol. 4073/2006 of LNCS (2006), 24--35.",
      "doi": ""
    },
    {
      "text": "Hajri, A., Fels, S., Miller, G., and Ilich, M. Moving target selection in 2d graphical user interfaces. In INTERACT 2011, vol. 6947 of LNCS (2011), 141--161. ",
      "doi": "10.5555/2042118.2042134"
    },
    {
      "text": "Hartmann, K., Götzelmann, T., Ali, K., and Strothotte, T. Metrics for functional and aesth. label layouts. In SG '05, vol. 3638/2005 of LNCS (2005), 115--126.  ",
      "doi": "10.1007/11536482_10"
    },
    {
      "text": "Hasan, K., Grossman, T., and Irani, P. Comet and target ghost: Techniques for selecting moving targets. In CHI '11, ACM (2011), 839--848.  ",
      "doi": "10.1145/1978942.1979065"
    },
    {
      "text": "Kamada, T., and Kawai, S. An algorithm for drawing general undirected graphs. Inf. Proc. Letters 31, 1 (1989), 7--15.  ",
      "doi": "10.1016/0020-0190%2889%2990102-6"
    },
    {
      "text": "Microsoft. Design Guidlines: Mouse and Pointers. Available at: msdn.microsoft.com/library/windows/desktop/bb545459.aspx.",
      "doi": ""
    },
    {
      "text": "Stein, T., and Decoret, X. Dynamic label placement for improved interactive exploration. In NPAR '08 (2008), 15--21.  ",
      "doi": "10.1145/1377980.1377986"
    },
    {
      "text": "Vokrinek, J., Novak, P., and Komenda, A. Ground tactical mission support by multi-agent control of UAV operations. In HoloMAS '11 (2011), 225--234. ",
      "doi": "10.5555/2035507.2035535"
    }
  ]
}