{
  "doi": "10.1145/2556288.2557155",
  "title": "Cognitively inspired task design to improve user performance on crowdsourcing platforms",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3665-3674",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Recent research in human computation has focused on improving the quality of work done by crowd workers on crowdsourcing platforms. Multiple approaches have been adopted like filtering crowd workers through qualification tasks, and aggregating responses from multiple crowd workers to obtain consensus. We investigate here how improving the presentation of the task itself by using cognitively inspired features affects the performance of crowd workers. We illustrate this with a case-study for the task of extracting text from scanned images. We generated six task-presentation designs by modifying two parameters - visual saliency of the target fields and working memory requirements - and conducted experiments on Amazon Mechanical Turk (AMT) and with an eye-tracker in the lab setting. Our results identify which task-design parameters (e.g. highlighting target fields) result in improved performance, and which ones do not (e.g. reducing the number of distractors). In conclusion, we claim that the use of cognitively inspired features for task design is a powerful technique for maximizing the performance of crowd workers.",
  "tags": [
    "eye tracking",
    "cognitive psychology",
    "visual saliency",
    "working memory",
    "task design",
    "mechanical turk",
    "crowdsourcing"
  ],
  "authors": [
    {
      "name": "Harini Alagarai Sampath",
      "institution": "International institute of Information Technology, Hyderabad, Andhra Pradesh, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959080157",
      "orcid": "missing"
    },
    {
      "name": "Rajeev Rajeshuni",
      "institution": "International Institute of Information Technology, Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959447257",
      "orcid": "missing"
    },
    {
      "name": "Bipin Indurkhya",
      "institution": "International Institute of Information Technology, Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100070843",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baddeley, A. Working memory: Looking back and looking forward. Nature Reviews Neuroscience 4, 10 (2003), 829--839.",
      "doi": ""
    },
    {
      "text": "Ballard, D. H., Hayhoe, M. M., Pook, P. K., and Rao, R. P. Deictic codes for the embodiment of cognition. Behavioral and Brain Sciences 20, 04 (1997), 723--742.",
      "doi": ""
    },
    {
      "text": "Bates, D., Maechler, M., and Bolker, B. lme4: Linear mixed-effects models using s4 classes.",
      "doi": ""
    },
    {
      "text": "Biewald, L., and Van Pelt, C. Distributing a task to multiple workers over a network for completion while providing quality control, 2011. WO Patent 2,011,159,434.",
      "doi": ""
    },
    {
      "text": "Chen, K., Kannan, A., Yano, Y., Hellerstein, J. M., and Parikh, T. S. Shreddr: pipelined paper digitization for low-resource organizations. In Proceedings of the 2nd ACM Symposium on Computing for Development, ACM (2012), 3.  ",
      "doi": "10.1145/2160601.2160605"
    },
    {
      "text": "Clark, A. Supersizing the Mind: Embodiment, Action, and Cognitive Extension: Embodiment, Action, and Cognitive Extension. Oxford University Press, USA, 2008.",
      "doi": ""
    },
    {
      "text": "Deshpande, Y. Adaptivity and Interface Design: A Human-Computer Interaction Study in E-Learning Applications. PhD thesis, Indian Institute of Technology, Guwahati, January 2014.",
      "doi": ""
    },
    {
      "text": "Fisher, D. L., and Tan, K. C. Visual displays: The highlighting paradox. Human Factors: The Journal of the Human Factors and Ergonomics Society 31, 1 (1989), 17--30. ",
      "doi": "10.1177/001872088903100102"
    },
    {
      "text": "Gamow, G., and Stern, M. Puzzle-math. Macmillan, 1958.",
      "doi": ""
    },
    {
      "text": "Gray, W. D., Sims, C. R., Fu, W.-T., and Schoelles, M. J. The soft constraints hypothesis: a rational analysis approach to resource allocation for interactive behavior. Psychological review 113, 3 (2006), 461.",
      "doi": ""
    },
    {
      "text": "Green, S., Heer, J., and Manning, C. D. The efficacy of human post-editing for language translation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2013), 439--448.  ",
      "doi": "10.1145/2470654.2470718"
    },
    {
      "text": "Heer, J., and Bostock, M. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2010), 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Huang, E., Zhang, H., Parkes, D. C., Gajos, K. Z., and Chen, Y. Toward automatic task design: A progress report. In Proceedings of the ACM SIGKDD workshop on human computation, ACM (2010), 77--85.  ",
      "doi": "10.1145/1837885.1837908"
    },
    {
      "text": "Ipeirotis, P. G., Provost, F., and Wang, J. Quality management on amazon mechanical turk. In Proceedings of the ACM SIGKDD workshop on human computation, ACM (2010), 64--67.  ",
      "doi": "10.1145/1837885.1837906"
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with mechanical turk. In Proceedings of the SIGCHI conference on human factors in computing systems, ACM (2008), 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Komarov, S., Reinecke, K., and Gajos, K. Z. Crowdsourcing performance evaluations of user interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2013), 207--216.  ",
      "doi": "10.1145/2470654.2470684"
    },
    {
      "text": "Korf, R. E. Toward a model of representation changes. Artificial intelligence 14, 1 (1980), 41--78.",
      "doi": ""
    },
    {
      "text": "Landauer, T. K. Latent semantic analysis. Encyclopedia of Cognitive Science (2006).",
      "doi": ""
    },
    {
      "text": "Law, E., and Ahn, L. v. Human computation. Synthesis Lectures on Artificial Intelligence and Machine Learning 5, 3 (2011), 1--121. ",
      "doi": "10.5555/2049960"
    },
    {
      "text": "Little, G., Chilton, L. B., Goldman, M., and Miller, R. C. Exploring iterative and parallel human computation processes. In Proceedings of the ACM SIGKDD workshop on human computation, ACM (2010), 68--76.  ",
      "doi": "10.1145/1837885.1837907"
    },
    {
      "text": "Mason, W., and Watts, D. J. Financial incentives and the performance of crowds. ACM SigKDD Explorations Newsletter 11, 2 (2010), 100--108.  ",
      "doi": "10.1145/1809400.1809422"
    },
    {
      "text": "Miller, G. The magical number seven, plus or minus two: Some limits on our capacity for processing information. The psychological review 63 (1956), 81--97.",
      "doi": ""
    },
    {
      "text": "Morris, R., Dontcheva, M., and Gerber, E. Priming for better performance in microtask crowdsourcing environments. Internet Computing, IEEE 16, 5 (2012), 13--19.  ",
      "doi": "10.1109/MIC.2012.68"
    },
    {
      "text": "Olesen, P. J., Westerberg, H., and Klingberg, T. Increased prefrontal and parietal activity after training of working memory. Nature neuroscience 7, 1 (2003), 75--79.",
      "doi": ""
    },
    {
      "text": "Paolacci, G., Chandler, J., and Ipeirotis, P. Running experiments on amazon mechanical turk. Judgment and Decision Making 5, 5 (2010), 411--419.",
      "doi": ""
    },
    {
      "text": "Parent, G., and Eskenazi, M. Speaking to the crowd: Looking at past achievements in using crowdsourcing for speech and predicting future challenges. In INTERSPEECH (2011), 3037--3040.",
      "doi": ""
    },
    {
      "text": "Toomim, M. Economic utility of interaction in crowdsourcing. In Workshop on Crowdsourcing and Human Computation at CHI (2011).",
      "doi": ""
    },
    {
      "text": "Treisman, A. Perceptual grouping and attention in visual search for features and for objects. Journal of Experimental Psychology: Human Perception and Performance 8, 2 (1982), 194--214.",
      "doi": ""
    },
    {
      "text": "Wickens, C. D., Ambinder, M. S., Alexander, A. L., and Martens, M. The role of highlighting in visual search through maps. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, vol. 48 (2004), 1895--1899.",
      "doi": ""
    },
    {
      "text": "Wolfe, J. M. Guided search 2.0 a revised model of visual search. Psychonomic bulletin and review 1, 2 (1994), 202--238.",
      "doi": ""
    }
  ]
}