{
  "doi": "10.1145/2556288.2556964",
  "title": "Vulture: a mid-air word-gesture keyboard",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1073-1082",
  "year": 2014,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Word-gesture keyboards enable fast text entry by letting users draw the shape of a word on the input surface. Such keyboards have been used extensively for touch devices, but not in mid-air, even though their fluent gestural input seems well suited for this modality. We present Vulture, a word-gesture keyboard for mid-air operation. Vulture adapts touch based word-gesture algorithms to work in mid-air, projects users' movement onto the display, and uses pinch as a word delimiter. A first 10-session study suggests text-entry rates of 20.6 Words Per Minute (WPM) and finds hand-movement speed to be the primary predictor of WPM. A second study shows that with training on a few phrases, participants do 28.1 WPM, 59% of the text-entry rate of direct touch input. Participants' recall of trained gestures in mid-air was low, suggesting that visual feedback is important but also limits performance. Based on data from the studies, we discuss improvements to Vulture and some alternative designs for mid-air text entry.",
  "tags": [
    "word-gesture keyboard",
    "freehand interaction",
    "shape writing",
    "mid-air interaction",
    "in-air interaction",
    "text entry"
  ],
  "authors": [
    {
      "name": "Anders Markussen",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959333557",
      "orcid": "missing"
    },
    {
      "name": "Mikkel Rønne Jakobsen",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81311485639/rel-imgonly/mrj-portrait.jpg",
      "acmid": "81311485639",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Amma, C., Georgi, M., and Schultz, T., Airwriting: Hands-Free Mobile Text Input by Spotting and Continuous Recognition of 3d-Space Handwriting with Inertial Sensors. In Proc. ISWC, (2012), 52--59.  ",
      "doi": "10.1109/ISWC.2012.21"
    },
    {
      "text": "Banerjee, A., Burstyn, J., Girouard, A., and Vertegaal, R., MultiPoint: Comparing laser and manual pointing as remote input in large display interactions. Int. J. Hum. Comput. Stud. 70, 10 (2012), 690--702.  ",
      "doi": "10.1016/j.ijhcs.2012.05.009"
    },
    {
      "text": "Bi, X., Chelba, C., Ouyang, T., Partridge, K., and Zhai, S., Bimanual gesture keyboard. In Proc. UIST, ACM (2012), 137--146.  ",
      "doi": "10.1145/2380116.2380136"
    },
    {
      "text": "Casiez, G., Roussel, N., and Vogel, D., 1 -- filter: a simple speed-based low-pass filter for noisy input in interactive systems. In Proc. CHI, ACM (2012), 2527--2530.  ",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Castellucci, S. J. and MacKenzie, I. S., Graffiti vs. unistrokes: an empirical comparison. In Proc. CHI, ACM (2008), 305--308.  ",
      "doi": "10.1145/1357054.1357106"
    },
    {
      "text": "Cockburn, A., Quinn, P., Gutwin, C., Ramos, G., and Looser, J., Air pointing: Design and evaluation of spatial target acquisition with and without visual feedback. Int. J. Hum.-Comput. Stud. 69, 6 (2011), 401--414.  ",
      "doi": "10.1016/j.ijhcs.2011.02.005"
    },
    {
      "text": "Devoe, D. B., Alternatives to Handprinting in the Manual Entry of Data. IEEE Transactions on Human Factors in Electronics HFE-8, 1 (1967), 21--32.",
      "doi": ""
    },
    {
      "text": "Gustafson, S., Bierwirth, D., and Baudisch, P., Imaginary interfaces: spatial interaction with empty hands and without visual feedback. In Proc. UIST, ACM (2010), 3--12.  ",
      "doi": "10.1145/1866029.1866033"
    },
    {
      "text": "Jones, B., Sodhi, R., Forsyth, D., Bailey, B., and Maciocci, G., Around device interaction for multiscale navigation. In Proc. MobileHCI, ACM (2012), 83--92.  ",
      "doi": "10.1145/2371574.2371589"
    },
    {
      "text": "Jota, R., Nacenta, M. A., Jorge, J. A., Carpendale, S., and Greenberg, S., A comparison of ray pointing techniques for very large displays. In Proc. GI, Canadian Information Processing Society (2010), 269--276. ",
      "doi": "10.5555/1839214.1839261"
    },
    {
      "text": "Kristensson, P. O., 2007. Discrete and Continuous Shape Writing for Text Entry and Control, Doctoral dissertation, Linköping University, Sweden.",
      "doi": ""
    },
    {
      "text": "Kristensson, P. O., Nicholson, T., and Quigley, A., Continuous recognition of one-handed and two-handed gestures using 3D full-body motion tracking sensors. In Proc. IUI, ACM (2012), 89--92.  ",
      "doi": "10.1145/2166966.2166983"
    },
    {
      "text": "Kristensson, P. O. and Zhai, S., SHARK2: a large vocabulary shorthand writing system for pen-based computers. In Proc. UIST, ACM (2004), 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "MacKenzie, I. S., Chen, J., and Oniszczak, A., Unipad: single stroke text entry with language-based acceleration. In Proc. NordiCHI, ACM (2006), 78--85.  ",
      "doi": "10.1145/1182475.1182484"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W., A character-level error analysis technique for evaluating text entry methods. In Proc. NordiCHI, ACM (2002), 243--246.  ",
      "doi": "10.1145/572020.572056"
    },
    {
      "text": "MacKenzie, I. S. and Soukoreff, R. W., Phrase sets for evaluating text entry techniques. In Proc. CHI, ACM (2003), 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "MacKenzie, I. S. and Tanaka-Ishii, K., Text entry systems: mobility, accessibility, universality. Boston: Morgan Kaufmann, Amsterdam, 2007. ",
      "doi": "10.5555/1296062"
    },
    {
      "text": "Markussen, A., Jakobsen, M., and Hornbæk, K., Selection-Based Mid-Air Text Entry on Large Displays. In Proc. INTERACT, Springer Berlin Heidelberg (2013), 401--418.",
      "doi": ""
    },
    {
      "text": "McGuire, R. M., Hernandez-Rebollar, J., Starner, T., Henderson, V., Brashear, H., and Ross, D. S., Towards a one-way American sign language translator. In Proc. AFGR, (2004), 620--625. ",
      "doi": "10.5555/1949767.1949876"
    },
    {
      "text": "Nancel, M., Wagner, J., Pietriga, E., Chapuis, O., and Mackay, W., Mid-air pan-and-zoom on wall-sized displays. In Proc. CHI, ACM (2011), 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "Ni, T., Bowman, D. A., and North, C., AirStroke: bringing unistroke text entry to freehand gesture interfaces. In Proc. CHI, ACM (2011), 2473--2476.  ",
      "doi": "10.1145/1978942.1979303"
    },
    {
      "text": "Oddities in words, pictures and figures. Reader's Digest, London, 1975.",
      "doi": ""
    },
    {
      "text": "Piumsomboon, T., Clark, A., Billinghurst, M., and Cockburn, A., 2013. User-Defined Gestures for Augmented Reality. In INTERACT, P. Kotzé, G. Marsden, G. Lindgaard, J. Wesson and M. Winckler Eds. Springer Berlin Heidelberg, 282--299.",
      "doi": ""
    },
    {
      "text": "Proctor, R. W. and Vu, K. P. L., Stimulus-Response Compatibility Principles: Data, Theory, and Application. Taylor & Francis, 2006.",
      "doi": ""
    },
    {
      "text": "Schick, A., Morlock, D., Amma, C., Schultz, T., and Stiefelhagen, R., Vision-based handwriting recognition for unrestricted text input in mid-air. In Proc. ICMI, ACM (2012), 217--220.  ",
      "doi": "10.1145/2388676.2388719"
    },
    {
      "text": "Shengli, Z., Zhuxin, D., Li, W. J., and Chung Ping, K., Hand-written character recognition using MEMS motion sensing technology. In Proc. AIM, (2008), 1418--1423.",
      "doi": ""
    },
    {
      "text": "Shoemaker, G., Findlater, L., Dawson, J. Q., and Kellogg, B. S., Mid-air text input techniques for very large wall displays. In Proc. GI, Canadian Information Processing Society (2009), 231--238. ",
      "doi": "10.5555/1555880.1555931"
    },
    {
      "text": "Shoemaker, G., Tang, A., and Booth, K. S., Shadow reaching: a new perspective on interaction for large displays. In Proc. UIST, ACM (2007), 53--56.  ",
      "doi": "10.1145/1294211.1294221"
    },
    {
      "text": "Sutton, J., Air painting with Corel Painter Freestyle and the leap motion controller: a revolutionary new way to paint! In Proc. ACM SIGGRAPH Studio Talks, ACM (2013).  ",
      "doi": "10.1145/2503673.2503694"
    },
    {
      "text": "Vogel, D. and Balakrishnan, R., Distant freehand pointing and clicking on very large, high resolution displays. In Proc. UIST, ACM (2005), 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Wigdor, D. and Wixon, D., Brave NUI World: Designing Natural User Interfaces for Touch and Gesture. Morgan Kaufmann Publishers Inc., 2011. ",
      "doi": "10.5555/1995309"
    },
    {
      "text": "Witt, H., Lawo, M., and Drugge, M., Visual feedback and different frames of reference: the impact on gesture interaction techniques for wearable computing. In Proc. MobileHCI, ACM (2008), 293--300.  ",
      "doi": "10.1145/1409240.1409272"
    },
    {
      "text": "Wobbrock, J. O., Myers, B. A., and Chau, D. H., In-stroke word completion. In Proc. UIST, ACM (2006), 333--336.  ",
      "doi": "10.1145/1166253.1166305"
    },
    {
      "text": "Wobbrock, J. O., Wilson, A. D., and Li, Y., Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. In Proc. UIST, ACM (2007), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Zhai, S. and Kristensson, P. O., Shorthand writing on stylus keyboard. In Proc. CHI, ACM (2003), 97--104.  ",
      "doi": "10.1145/642611.642630"
    },
    {
      "text": "Zhai, S. and Kristensson, P. O., The word-gesture keyboard: reimagining keyboard interaction. Commun. ACM 55, 9 (2012), 91--101.  ",
      "doi": "10.1145/2330667.2330689"
    },
    {
      "text": "Zhai, S., Kristensson, P. O., Gong, P., Greiner, M., Peng, S. A., Liu, L. M., and Dunnigan, A., Shapewriter on the iphone: from the laboratory to the real world. In Proc. CHI, ACM (2009), 2667--2670.  ",
      "doi": "10.1145/1520340.1520380"
    }
  ]
}