{
  "doi": "10.1145/2556288.2557414",
  "title": "Both complete and correct?: multi-objective optimization of touchscreen keyboard",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2297-2306",
  "year": 2014,
  "badges": [],
  "abstract": "Correcting erroneous input (i.e., correction) and completing a word based on partial input (i.e., completion) are two important \"smart\" capabilities of a modern intelligent touchscreen keyboard. However little is known whether these two capabilities are conflicting or compatible with each other in the keyboard parameter tuning. Applying computational optimization methods, this work explores the optimality issues related to them. The work demonstrates that it is possible to simultaneously optimize a keyboard algorithm for both correction and completion. The keyboard simultaneously optimized for both introduces no compromise to correction and only a slight compromise to completion when compared to the keyboards exclusively optimized for one objective. Our research also demonstrates the effectiveness of the proposed optimization method in keyboard algorithm design, which is based on the Pareto multi-objective optimization and the Metropolis algorithm. For the development and test datasets used in our experiments, computational optimization improved the correction accuracy rate by 8.3% and completion power by 17.7%.",
  "tags": [
    "mobile",
    "keyboard algorithm",
    "optimization",
    "smart touch screen keyboard",
    "correction",
    "completion",
    "text input",
    "intelligent user interfaces"
  ],
  "authors": [
    {
      "name": "Xiaojun Bi",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485662",
      "orcid": "0000-0002-9716-7709"
    },
    {
      "name": "Tom Ouyang",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442610252",
      "orcid": "missing"
    },
    {
      "name": "Shumin Zhai",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    }
  ],
  "references": [
    {
      "text": "Android Open Source Project http://source.android.com/",
      "doi": ""
    },
    {
      "text": "Azenkot, S. and Zhai, S. (2012). Touch Behavior with Different Postures on Soft Smart Phone Keyboards. Proc. of MobileHCI'12. 251--260.  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Bi, X., Azenkot, S., Partridge, K., Zhai, S. (2013) Octopus: Evaluating Touchscreen Keyboard Correction and Recognition Algorithms via Remulation, Proc. of CHI'13, 543--552.  ",
      "doi": "10.1145/2470654.2470732"
    },
    {
      "text": "Bi, X., Smith, B., Zhai. S. (2010) Quasi-Qwerty Soft Keyboard Optimization, Proc. of CHI'10, 283--286.  ",
      "doi": "10.1145/1753326.1753367"
    },
    {
      "text": "Bi, X., Smith, B., Zhai. S. (2012) Multilingual Touchscreen Keyboard Design and Optimization. Human-Computer Interaction, Volume 27, Issue 4, 352--382.",
      "doi": ""
    },
    {
      "text": "Dunlop, M. and Levine, J. (2012) Multidimensional pareto optimization of touchscreen keyboards for speed, familiarity and improved spell checking. Proc. of CHI'12, 2669--2678.  ",
      "doi": "10.1145/2207676.2208659"
    },
    {
      "text": "Matthias Ehrgott (2005). Multicriteria Optimization. Birkhäuser. ISBN 978-3-540-21398-7. ",
      "doi": "10.5555/1121732"
    },
    {
      "text": "Findlater, L., and Wobbrock, J. O. (2012). Personalized input: improving ten-finger touchscreen typing through automatic adaptation. Proc. of CHI '12. 815--824.  ",
      "doi": "10.1145/2207676.2208520"
    },
    {
      "text": "Getschow, C. O., Rosen, M. J., and Goodenough-Trepagnier, C. (1986). A systematic approach to design a minimum distance alphabetical keyboard. Proc. of RESNA (Rehabilitation Engineering Society of North America) 9th Annual Conference, 396--398.",
      "doi": ""
    },
    {
      "text": "Goel, M., Findlater, L. and Wobbrock, J. (2012) WalkType: using accelerometer data to accomodate situational impairments in mobile touch screen text entry. In Proc. of CHI '12. 2687--2696.  ",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Goel, M., Jansen, A., Mandel, T., Patel, S., and Wobbrock. J. (2013) ContextType: using hand posture information to improve mobile touch screen text entry. Proc. of CHI '13, 2795--2798.  ",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Goodman, J., Venolia, G., Steury, K., and Parker, C. (2002). Language modeling for soft keyboards. Proc. of AAAI '02, 419--424. ",
      "doi": "10.5555/777092.777159"
    },
    {
      "text": "Higginbotham, J. (1992) Evaluation of keystroke savings across five assistive communication technologies Augmentative and Alternative Communication Vol. 8, No. 4, 258--272.",
      "doi": ""
    },
    {
      "text": "Kane, K. S, Wobbrock, J., Harniss, M., and Johnson, K. (2008) TrueKeys: identifying and correcting typing errors for people with motor impairments. Proc. of IUI'08, 349--352.  ",
      "doi": "10.1145/1378773.1378827"
    },
    {
      "text": "Koester, H. H., Levine, S. P. (1994) Modeling the speed of text entry with a word prediction interface, IEEE Transactions on Rehabilitation Engineering, Volume: 2 Issue: 3 177--187.",
      "doi": ""
    },
    {
      "text": "Kristensson, P.-O., Zhai, S. (2005) Relaxing Stylus Typing Precision by Geometric Pattern Matching. Proc. IUI'05, 151--158,  ",
      "doi": "10.1145/1040830.1040867"
    },
    {
      "text": "MacKenzie, I. S., and Soukoreff, R. W. (2003). Phrase sets for evaluating text entry techniques. Proc. of CHI EA '03, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "MacKenzie, I. S., and Tanaka-Ishii, K. (Eds.). (2007). Text Entry Systems: Mobility, Accessibility, Universality: Morgan Kaufmann Publishers. ",
      "doi": "10.5555/1296062"
    },
    {
      "text": "MacKenzie, I. S., and Zhang, S. X. (1999) The design and evaluation of a high-performance soft keyboard. Proc. of CHI '99, 25--31.  ",
      "doi": "10.1145/302979.302983"
    },
    {
      "text": "Nielsen. nielsen.com/us/en/newswire/2010/u-s-teen-mobile-report-calling-yesterday-texting-today-using-apps-tomorrow.html",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A., Reichel, A., Li, W., Zhang, Y., Bachnynskyi, M., Vertanen, K. and Kristensson, P. O. (2013) Improving two-thumb text entry on touchscreen devices. Proc of CHI. 2765--2774.  ",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Time.com techland.time.com/2011/07/21/study-fewer-than-50-of-smartphone-users-make-calls/",
      "doi": ""
    },
    {
      "text": "Wobbrock, J. O. (2007). Measures of text entry performance. Chapter 3 in I. S. MacKenzie and K. Tanaka-Ishii (eds.), Text Entry Systems: Mobility, Accessibility, Universality. San Francisco: Morgan Kaufmann, pp. 47--74.",
      "doi": ""
    },
    {
      "text": "Yin, Y., Ouyang, T., Partridge, K., and Zhai, S. (2013) Making touchscreen keyboards adaptive to keys, hand postures, and individuals: a hierarchical spatial backoff model approach. Proc. of CHI '13. 2775--2784.  ",
      "doi": "10.1145/2470654.2481384"
    },
    {
      "text": "Zhai, S., Hunter, M., & Smith, B. A. (2000). The Metropolis Keyboard - an exploration of quantitative techniques for virtual keyboard design. Proc. of UIST'00. 119--218.  ",
      "doi": "10.1145/354401.354424"
    },
    {
      "text": "Zhai, S., Hunter, M., & Smith, B. A. (2002). Performance optimization of virtual keyboards. Human-Computer Interaction, 17(2,3), 89--129.",
      "doi": ""
    }
  ]
}