{
  "doi": "10.1145/2556288.2557017",
  "title": "Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "193-196",
  "year": 2014,
  "badges": [],
  "abstract": "Smartwatches promise to bring enhanced convenience to common communication, creation and information retrieval tasks. Due to their prominent placement on the wrist, they must be small and otherwise unobtrusive, which limits the sophistication of interactions we can perform. This problem is particularly acute if the smartwatch relies on a touchscreen for input, as the display is small and our fingers are relatively large. In this work, we propose a complementary input approach: using the watch face as a multi-degree-of-freedom, mechanical interface. We developed a proof of concept smartwatch that supports continuous 2D panning and twist, as well as binary tilt and click. To illustrate the potential of our approach, we developed a series of example applications, many of which are cumbersome -- or even impossible -- on today's smartwatch devices.",
  "tags": [
    "wearable computing",
    "on-body interfaces",
    "touchscreens",
    "buttons",
    "watch",
    "smart clothing"
  ],
  "authors": [
    {
      "name": "Robert Xiao",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81548910156/rel-imgonly/img_6433x_cropped_large.jpeg",
      "acmid": "81548910156",
      "orcid": "0000-0003-4306-8825"
    },
    {
      "name": "Gierad Laput",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Ashbrook, D., Lyons, K. and Starner, T. An investigation into round touchscreen wristwatch interaction. In Proc. of MobileHCI '08. 311--314.  ",
      "doi": "10.1145/1409240.1409276"
    },
    {
      "text": "Baudisch, P. and Chu, G. Back-of-device interaction allows creating very small touch devices. In Proc. CHI '09. 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Blasko, G. and Feiner, S. An interaction system for watch computers using tactile guidance and bidirectional segmented strokes. In Proc. ISWC '04. 120--123.  ",
      "doi": "10.1109/ISWC.2004.6"
    },
    {
      "text": "Harrison, C. and Hudson, S. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In Proc. UIST '09. 121--124.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Harrison, C. and Hudson, S. Using shear as a supplemental two-dimensional input channel for rich touchscreen interaction. In Proc. CHI '12. 3149--3152.  ",
      "doi": "10.1145/2207676.2208730"
    },
    {
      "text": "Heo, S. and Lee, G. Force gestures: augmenting touch screen gestures with normal and tangential forces. In Proc. UIST '11. 621--626.  ",
      "doi": "10.1145/2047196.2047278"
    },
    {
      "text": "Hinckley K. and Song, H. Sensor synaesthesia: touch in motion, and motion in touch. In Proc. CHI '11. 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Kim, J., He, J., Lyons, K. and Starner, T. The Gesture Watch: a wireless contact-free gesture based wrist interface. In Proc. ISWC '07. 11--13.  ",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "Kratz, S. and Rohs, M. Hoverflow: exploring around-device interaction with IR distance sensors. Proc. MobileHCI '09. 1--4.  ",
      "doi": "10.1145/1613858.1613912"
    },
    {
      "text": "Lyons, K., Nguyen, D., Ashbrook, D. and White, S.. Facet: a multi-segment wrist worn system. In Proc. UIST '12. 123--130.  ",
      "doi": "10.1145/2380116.2380134"
    },
    {
      "text": "Masui, T., Tsukada, K. and Siio, I. MouseField: a simple and versatile input device for ubiquitous computing. In Proc. UbiComp '04. 319--328.",
      "doi": ""
    },
    {
      "text": "Miner, C. S., Chan, D. M. and Campbell, C. Digital jewelry: wearable technology for everyday life. In CHI EA '01. 45--46.  ",
      "doi": "10.1145/634067.634098"
    },
    {
      "text": "Miyaki, T. and Rekimoto, J. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. In Proc. MobileHCI '09. Article 11.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Mooser, J., You, S. and Neumann, U. Large document, small screen: a camera driven scroll and zoom control for mobile devices. In Proc. I3D '08. 27--34.  ",
      "doi": "10.1145/1342250.1342254"
    },
    {
      "text": "Ni, T. and Baudisch, P. Disappearing mobile devices. In Proc. UIST '09. 101--110.  ",
      "doi": "10.1145/1622176.1622197"
    },
    {
      "text": "Oney, S., Harrison, C., Ogan, A. and Wiese, J. ZoomBoard: a diminutive QWERTY soft keyboard using iterative zooming for ultra-small devices. In Proc. CHI '13. 2799--2802.  ",
      "doi": "10.1145/2470654.2481387"
    },
    {
      "text": "Pasquero, J., Stobbe, S. and Stonehouse, N. A haptic wristwatch for eyes-free interactions. In Proc. CHI '11. 3257--3266.  ",
      "doi": "10.1145/1978942.1979425"
    },
    {
      "text": "Perrault, S., Lecolinet, E., Eagan, J. and Guiard, Y. Watchit: simple gestures and eyes-free interaction for wristwatches and bracelets. In Proc. CHI '13. 1451--1460.  ",
      "doi": "10.1145/2470654.2466192"
    },
    {
      "text": "Quinn, P. and Cockburn. A. Zoofing!: faster list selections with pressure-zoom-flick-scrolling. In Proc. OZCHI '09. 185--192.  ",
      "doi": "10.1145/1738826.1738856"
    },
    {
      "text": "Raghunath, M. T. and Narayanaswami, C. User interfaces for applications on a wrist watch. Personal Ubiquitous Computing, 6 (January 2002), 17--30.  ",
      "doi": "10.1007/s007790200002"
    },
    {
      "text": "Rahman, M., Gustafson, S., Irani P. and Subramanian, S. Tilt techniques: investigating the dexterity of wrist-based input. In Proc. CHI '09. 1943--1952.  ",
      "doi": "10.1145/1518701.1518997"
    },
    {
      "text": "Ren, L. and Crawford, J. Coordinate transformations for handguided saccades. Exp. Brain Research. 195 (3), 2009. 455--465.",
      "doi": ""
    },
    {
      "text": "Selker, T. and Rutledge, J. Finger Force Precision for Computer Pointing. IBM RC 17342, October 1991.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The computer for the 21st century. SIGMOBILE Mob. Comput. Commun. Rev. 3, 3 (July 1999), 3--11.  ",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Wobbrock, J., Wilson, A. and Li, Y. Gestures without libraries, toolkits or training: A $1 recognizer for user interface prototypes. In Proc. UIST '07. 159--168. Figure 9. Doom running on our smartwatch prototype.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}