{
  "doi": "10.1145/2556288.2557191",
  "title": "Edit distance modulo bisimulation: a quantitative measure to study evolution of user models",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1757-1766",
  "year": 2014,
  "badges": [],
  "abstract": "When a user learns to use a new device, her understanding of it evolves. A progressive comparison of the evolving user models towards the device target model, for analysing learning, involves determining the behavioral proximity between them. To quantify the gap between a user model and a target model, we introduce an edit distance metric for measuring their behavioral proximity using a bisimulation-based equivalence relation. We define edit distance to be the minimum number of edges and states with incident edges required to be deleted from and/or added to a user model to make it bisimilar to the target model. We propose an algorithm to compute edit distance between two models and employ the heuristic procedure on experimental data for computing edit distance between target and user models. The data is organised into two experiments depending on the device the user interacted with: (a) a simple device resembling a vending machine and (b) a close to real-world vehicle transmission model. The results validate our proposed metric as edit distance converges with progressive user learning, increases for erroneous learning, and remains unchanged indicating no learning.",
  "authors": [
    {
      "name": "Himanshu Zade",
      "institution": "IIIT-H (International Institute of Information Technology - Hyderabad) & Carnegie Mellon University (USA), Hyderabad, Andhra Pradesh, INDIA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958668557",
      "orcid": "0000-0003-1755-7780"
    },
    {
      "name": "Santosh Arvind Adimoolam",
      "institution": "IIIT-H (International Institute of Information Technology - Hyderabad), Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958918757",
      "orcid": "missing"
    },
    {
      "name": "Sai Gollapudi",
      "institution": "IIIT-H (International Institute of Information Technology - Hyderabad), Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82858657457",
      "orcid": "missing"
    },
    {
      "name": "Anind K. Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Venkatesh Choppella",
      "institution": "IIIT-H (International Institute of Information Technology - Hyderabad), Hyderabad, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490670939",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. Dix, J. F., and Beale, R. Analysis of user behaviour as time series. In HCI'92: People and Computers VII, Cambridge University Press (1992), 429--444. ",
      "doi": "10.5555/164592.164659"
    },
    {
      "text": "Anderson, J. R., Corbett, A. T., Koedinger, K. R., and Pelletier, R. Cognitive tutors: Lessons learned. The Journal of the Learning Sciences 4, 2 (1995), 167--207.",
      "doi": ""
    },
    {
      "text": "Baecker, R., Booth, K., Jovicic, S., McGrenere, J., and Moore, G. Reducing the gap between what users know and what they need to know. In CUU '00, 17--23.  ",
      "doi": "10.1145/355460.355467"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. The keystroke level model for user performance time with interactive systems. Commun. ACM 23, 7 (1980), 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Carley, K., and Palmquist, M. Extracting, representing, and analyzing mental models. Social Forces 70, 3 (1992), 601--636.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M., and Olson, J. R., Eds. Mental models in human-computer interaction: research issues about what the user of software knows. National Academy Press, Washington, DC, USA, 1987. ",
      "doi": "10.5555/64799"
    },
    {
      "text": "Combés, S., and Pecheur, C. A bisimulation-based approach to the analysis of human-computer interaction. In EICS '09, ACM (2009), 101--110.  ",
      "doi": "10.1145/1570433.1570454"
    },
    {
      "text": "Dhawan, R., M. O., and Borman, M. Mental models and dynamic decision making: an experimental approach for testing system methodologies. In 24th International Conference of the System Dynamics Society (2006).",
      "doi": ""
    },
    {
      "text": "Doherty, G., Campos, J. C., and Harrison, M. D. Representational reasoning and verification. Formal Aspects of Computing 12 (1998), 260--277.",
      "doi": "10.1007/PL00003934"
    },
    {
      "text": "Dong, Q. A bisimulation approach to verification of molecular implementations of formal chemical reaction networks, 2012.",
      "doi": ""
    },
    {
      "text": "Falb, J., Popp, R., Rock, T., Jelinek, H., Arnautovic, E., and Kaindl, H. Fully-automatic generation of user interfaces for multiple devices from a high-level model based on communicative acts. In HICSS (2007), 26--26.  ",
      "doi": "10.1109/HICSS.2007.236"
    },
    {
      "text": "Fischer, G. User modeling in humancomputer interaction. User Modeling and User-Adapted Interaction 11, 1--2 (2001), 65--86.  ",
      "doi": "10.1023/A%3A1011145532042"
    },
    {
      "text": "Gentner, D., and Stevens, A. Mental models. Cognitive Science - Lawrence Erlbaum Associates. Lawrence Erlbaum Associates, Incorporated, 1983.",
      "doi": ""
    },
    {
      "text": "Harrison, M. Modelling user structures within system Specifications. In Formal Methods in HCI: III, IEE Colloquium on (1989), 1/1--1/4.",
      "doi": ""
    },
    {
      "text": "Harrison, M., and Thimbleby, H. Formal Methods in Human Computer Interactions. Cambridge Middle East Library. Cambridge University Press, 1990. ",
      "doi": "10.5555/575325"
    },
    {
      "text": "Hermann, M., and Weber, M. When three worlds collide: a model of the tangible interaction process. In OZCHI '09, ACM (2009), 341--344.  ",
      "doi": "10.1145/1738826.1738892"
    },
    {
      "text": "Heymann, M., and Degani, A. Formal analysis and automatic generation of user interfaces: approach, methodology, and an algorithm. Human Factors 49, 2 (Apr. 2007), 311--30.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Cutrell, E., Bathiche, S., and Muss, T. Quantitative analysis of scrolling techniques. In CHI '02, ACM (2002), 65--72.  ",
      "doi": "10.1145/503376.503389"
    },
    {
      "text": "Ippel, M. J., and Beem, A. L. Mental models as finite-state machines: Examples and computational methods. Tech. Rep. 9911, United State Air Force Armstrong Laboratory, October 1998.",
      "doi": ""
    },
    {
      "text": "John, B. E., and Kieras, D. E. The goms family of analysis techniques: Tools for design and evaluation. Tech. rep., Carnegie Mellon University, 1994. ",
      "doi": "10.5555/865122"
    },
    {
      "text": "Johnson-Laird, P. N. Mental models: Towards a cognitive science of language, inference, and consciousness, vol. 6. 1983. ",
      "doi": "10.5555/7909"
    },
    {
      "text": "Kieras, D. E. Towards a practical goms model methodology for user interface design. Handbook of human-computer interaction (1988), 135--158.",
      "doi": ""
    },
    {
      "text": "Kieras, D. E., and Bovair, S. The role of a mental model in learning to operate a device. Cognitive Science 8, 3 (1984), 255--273.",
      "doi": ""
    },
    {
      "text": "Long, J., and Dowell, J. Formal methods: the broad and the narrow view. In Formal Methods and HCI: II, IEE Colloquium on (1988), 5/1--5/8.",
      "doi": ""
    },
    {
      "text": "Milner, R. A Calculus of Communicating Systems. Springer-Verlag New York, Inc., 1982. ",
      "doi": "10.5555/539036"
    },
    {
      "text": "Norman, D. Some observations on mental models. Mental models 7 (1983).",
      "doi": ""
    },
    {
      "text": "Payne, S. J., and Green, T. R. G. Task-action grammars: a model of the mental representation of task languages. Human-Computer Interaction 2, 2 (June 1986), 93--133.  ",
      "doi": "10.1207/s15327051hci0202_1"
    },
    {
      "text": "Popp, R., Falb, J., Raneburger, D., and Kaindl, H. A transformation engine for model-driven ui generation. In EICS '12, ACM (2012), 281--286.  ",
      "doi": "10.1145/2305484.2305532"
    },
    {
      "text": "Qian, X., Yang, Y., and Gong, Y. The art of metaphor: a method for interface design based on mental models. In VRCAI '11, ACM (2011), 171--178.  ",
      "doi": "10.1145/2087756.2087780"
    },
    {
      "text": "Read, J. C., MacFarlane, S., and Casey, C. What's going on?: discovering what children understand about handwriting recognition interfaces. In IDC '03, 135--140.  ",
      "doi": "10.1145/953536.953555"
    },
    {
      "text": "Reeves, S. Principled formal methods in hci research. In Formal Methods in HCI: III, IEE Colloquium on (1989), 2/1--2/3.",
      "doi": ""
    },
    {
      "text": "Romera, M. E. Using finite automata to represent mental models. Master's thesis, San Jose State University, 2000.",
      "doi": ""
    },
    {
      "text": "Rushby, J. Using model checking to help discover mode confusions and other automation surprises. In Reliability Engineering and System Safety, vol. 75 (2002), 167--177.",
      "doi": ""
    },
    {
      "text": "Santosh, and Himanshu. Restrcting edit operations to generate bisimilar fsms. Tech. Rep. xxxx, IIIT-Hyderabad, January 2014.",
      "doi": ""
    },
    {
      "text": "Schneider, K., and Cordy, J. Abstract user interfaces: A model and notation to support plasticity in interactive systems. In Interactive Systems: Design, Specification, and Verification, vol. 2220. Springer, 2001, 28--48. ",
      "doi": "10.5555/646166.680970"
    },
    {
      "text": "Thimbleby, B., Blandford, A., Cairns, P., Curzon, P., and Jones, M. User interface design as systems design. In People and Computers XVI - Memorable yet Invisible, Springer (2002), 281--301.",
      "doi": ""
    },
    {
      "text": "Thimbleby, H. Press On Principles of Interaction Programming. MIT Press, 2007. ",
      "doi": "10.5555/1324793"
    },
    {
      "text": "Thimbleby, H. Contributing to safety and due diligence in safety-critical interactive systems development by generating and analyzing finite state models. In EICS '09, ACM (2009), 221--230.  ",
      "doi": "10.1145/1570433.1570474"
    },
    {
      "text": "Tullio, J., Dey, A. K., Chalecki, J., and Fogarty, J. How it works: a field study of non-technical users interacting with an intelligent system. In CHI '07, 31--40.  ",
      "doi": "10.1145/1240624.1240630"
    },
    {
      "text": "Zade, H., and Choppella, V. Functionality or user interface: Which is easier to learn when changed? In IHCI '12 (2012), 1--6.",
      "doi": ""
    }
  ]
}