{
  "doi": "10.1145/2556288.2556959",
  "title": "Odin: contextual document opinions on the go",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1525-1534",
  "year": 2014,
  "badges": [],
  "abstract": "Information overload is a systemic problem for knowledge workers in enterprise. For a long time, information was scarce and therefore valuable. While, the explosion of digital information has made information plentiful, time to read and process that content is now scarce. This problem is only exacerbated by our increased mobility, and the expectation to be \"on top\" of the continuous barrage of documents while on the go. Knowledge workers in enterprise need solutions that are designed with quick methods for finding what to read in a large collection of documents (e.g. financial reports, legal documents, news), and ways of presenting it within small visual real estate. Unlike reviews, document collections are long, more varied, and context is extremely important. In response, we present Odin, a mobile web-based window onto a user's document corpus. Rather than performing corpus summarization, Odin users can quickly find opinions and documents that are Aligned or Divergent from the corpus' consensus, or those that are the most Relevant given the overall corpus' of opinions. Odin presents this information through a simple and intuitive mobile interface. To the authors' knowledge, this is the first UI/system (and support algorithm) to allow mobile users to place documents and their opinions in context through alignment rather than raw word count or sentiment. Positive results from two evaluations are also presented.",
  "authors": [
    {
      "name": "Joshua M. Hailpern",
      "institution": "Hewlett Packard, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81351599207/rel-imgonly/81351599207.jpg",
      "acmid": "81351599207",
      "orcid": "missing"
    },
    {
      "name": "Bernardo A. Huberman",
      "institution": "Hewlett Packard, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100561780",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "E. Adar and B. A. Huberman. The economics of surfing. Quarterly Journal of Electronic Commerce, 2000.",
      "doi": ""
    },
    {
      "text": "F. Ahmed, Y. Borodin, A. Soviak, M. Islam, I. V. Ramakrishnan, and T. Hedgpeth. Accessible skimming: faster screen reading of web pages. In UIST '12. ACM Request Permissions, Oct. 2012.  ",
      "doi": "10.1145/2380116.2380164"
    },
    {
      "text": "N. Archak, A. Ghose, and P. G. Ipeirotis. Show me the money!: deriving the pricing power of product features by mining consumer reviews. In KDD '07. ACM Request Permissions, Aug. 2007.  ",
      "doi": "10.1145/1281192.1281202"
    },
    {
      "text": "S. Baccianella, A. Esuli, and F. Sebastiani. Sentiwordnet 3.0: An enhanced lexical resource for sentiment analysis and opinion mining. In Proceedings of the 7th Conference on Language Resources and Evaluation, 2010.",
      "doi": ""
    },
    {
      "text": "A. Bangor, P. Kortum, and J. Miller. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies, 2009.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "P. Baudisch, B. Lee, and L. Hanna. Fishnet, a fisheye web browser with search term popouts: a comparative evaluation with overview and linear view. In AVI '04: Proceedings of the working conference on Advanced visual interfaces. ACM, May 2004.  ",
      "doi": "10.1145/989863.989883"
    },
    {
      "text": "D. Billsus, D. M. Hilbert, and D. Maynes-Aminzade. Improving proactive information systems. In the 10th international conference, pages 159--166, New York, New York, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1040830.1040869"
    },
    {
      "text": "J. Brooke. SUS-A quick and dirty usability scale. Usability evaluation in industry, 1996.",
      "doi": ""
    },
    {
      "text": "A. J. B. Brush, D. Bargeron, A. Gupta, and J. J. Cadiz. Robust Annotation Positioning in Digital Documents . In the SIGCHI conference, pages 285--292, New York, New York, USA, 2001. ACM Press.  ",
      "doi": "10.1145/365024.365117"
    },
    {
      "text": "G. Carenini, R. T. Ng, and A. Pauls. Interactive Multimedia Summaries of Evaluative Text . In the 11th International Conference, page 124, New York, New York, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1111449.1111480"
    },
    {
      "text": "M. Chakravarthy and P. Ciravegna. Cross-media document annotation and enrichment. 2006.",
      "doi": ""
    },
    {
      "text": "Y. Cui and V. Roto. How people use the web on mobile devices. In WWW '08. ACM, Apr. 2008.  ",
      "doi": "10.1145/1367497.1367619"
    },
    {
      "text": "S. Davies, S. Allen, J. Raphaelson, E. Meng, J. Engleman, R. King, and C. Lewis. Popcorn: the personal knowledge base. In the 6th ACM conference, pages 150--159, New York, New York, USA, 2006. ACM Press.  ",
      "doi": "10.1145/1142405.1142431"
    },
    {
      "text": "M. C. De Marneffe and B. MacCartney. Generating typed dependency parses from phrase structure parses. In Proceedings of LREC '06, 2006.",
      "doi": ""
    },
    {
      "text": "J. R. Finkel, T. Grenager, and C. Manning. Incorporating non-local information into information extraction systems by gibbs sampling. ACL'05, 2005.  ",
      "doi": "10.3115/1219840.1219885"
    },
    {
      "text": "K. A. Ganesan, N. Sundaresan, and H. Deo. Mining tag clouds and emoticons behind community feedback. In WWW '08. ACM, Apr. 2008.  ",
      "doi": "10.1145/1367497.1367716"
    },
    {
      "text": "V. Giller, R. Melcher, J. Schrammel, R. Sefelin, and M. Tscheligi. Usability Evaluations for Multi-device Application Development Three Example Studies, volume 2795 of Verena Giller, Rudolf Melcher, Johann Schrammel, Reinhard Sefelin and Manfred Tscheligi. Lecture Notes in Computer Science, Berlin, Heidelberg, 2003.",
      "doi": ""
    },
    {
      "text": "J. Hailpern and B. A. Huberman. Echo: the editor's wisdom with the elegance of a magazine. In EICS '13: Proceedings of the 5th ACM SIGCHI symposium on Engineering interactive computing systems. ACM Request Permissions, June 2013.  ",
      "doi": "10.1145/2494603.2480315"
    },
    {
      "text": "M. J. Halvey and M. T. Keane. An Assessment of Tag Presentation Techniques . In the 16th international conference, page 1313, New York, New York, USA, 2007. ACM Press.  ",
      "doi": "10.1145/1242572.1242826"
    },
    {
      "text": "M. A. Hearst. User interfaces and visualization. Modern information retrieval, 1999.",
      "doi": ""
    },
    {
      "text": "M. A. Hearst and D. Rosner. Tag clouds: Data analysis tool or social signaller ... on System Sciences, 2008.  ",
      "doi": "10.1109/HICSS.2008.422"
    },
    {
      "text": "J. Huang, O. Etzioni, L. Zettlemoyer, K. Clark, and C. Lee. RevMiner: an extractive interface for navigating reviews on a smartphone. In UIST '12. ACM Request Permissions, Oct. 2012.  ",
      "doi": "10.1145/2380116.2380120"
    },
    {
      "text": "B. A. Huberman and F. Wu. The economics of attention: Maximizing user value in information-rich environments. Advances in Complex Systems, 2008.",
      "doi": ""
    },
    {
      "text": "B. Kim and B. Aeschliman. Experimental assessment of a visual interface designed for web documents on mobile devices. ICCIT 2011, pages 231--236, 2011.",
      "doi": ""
    },
    {
      "text": "T. Kriplean, J. Morgan, D. Freelon, A. Borning, and L. Bennett. Supporting reflective public thought with considerit. In CSCW '12. ACM Request Permissions, Feb. 2012.  ",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "B. Y.-L. Kuo, T. Hentrich, B. M. Good, and M. D. Wilkinson. Tag clouds for summarizing web search results. In the 16th international conference. ACM, May 2007.  ",
      "doi": "10.1145/1242572.1242766"
    },
    {
      "text": "S. E. Lee, T. Chun, and S. S. Han. Using Qtag to Extract Dominant Public Opinion in Very Large-Scale Conversation. In 2009 International Conference on Computational Science & Engineering, pages 753--758. IEEE, 2009.  ",
      "doi": "10.1109/CSE.2009.453"
    },
    {
      "text": "S. E. Lee, D. K. Son, and S. S. Han. Qtag: tagging as a means of rating, opinion-expressing, sharing and visualizing. In SIGDOC '07. ACM Request Permissions, Oct. 2007.  ",
      "doi": "10.1145/1297144.1297184"
    },
    {
      "text": "B. Liu, M. Hu, and J. Cheng. Opinion observer: analyzing and comparing opinions on the Web. In the 14th international conference, page 342, New York, New York, USA, 2005. ACM Press.  ",
      "doi": "10.1145/1060745.1060797"
    },
    {
      "text": "A. K. McCallum. Mallet: A machine learning for language toolkit. 2002.",
      "doi": ""
    },
    {
      "text": "K. O'Hara and A. Sellen. A Comparison of Reading Paper and On-Line Documents. In the SIGCHI conference, pages 335--342, New York, New York, USA, 1997. ACM Press.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "J. Otterbacher, D. Radev, and O. Kareem. News to go: hierarchical text summarization for mobile devices. In SIGIR '06, 2006.  ",
      "doi": "10.1145/1148170.1148271"
    },
    {
      "text": "B. Pang and L. Lee. Opinion Mining and Sentiment Analysis. Foundations and Trends in Information Retrieval, 2(1--2), Jan. 2008.  ",
      "doi": "10.1561/1500000011"
    },
    {
      "text": "S. Park, M. Ko, J. Kim, and H. Choi. NewsCube2. 0: An Exploratory Design of a Social News Website for Media Bias Mitigation. In Workshop on Social Recommender Systems, Mar. 2011.",
      "doi": ""
    },
    {
      "text": "A. W. Rivadeneira, D. M. Gruen, M. J. Muller, and D. R. Millen. Getting our head in the clouds: toward evaluation studies of tagclouds. In CHI '07: Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Request Permissions, Apr. 2007.  ",
      "doi": "10.1145/1240624.1240775"
    },
    {
      "text": "B. Sereno, S. B. Shum, and E. Motta. ClaimSpotter: an environment to support sensemaking with knowledge triples. In the 10th international conference. ACM Request Permissions, Jan. 2005.  ",
      "doi": "10.1145/1040830.1040875"
    },
    {
      "text": "S. Shrestha. Mobile Web Browsing: Usability Study. In the 4th international conference on mobile technology, applications, and systems and the 1st international symposium, page 187, New York, New York, USA, 2007. ACM Press.  ",
      "doi": "10.1145/1378063.1378094"
    },
    {
      "text": "H. A. Simon. Designing organizations for an information-rich world. Computers, Communication, and the Public Interest, (The Johns Hopkins Press), 1969.",
      "doi": ""
    },
    {
      "text": "B. Suh, A. Woodruff, R. Rosenholtz, and A. Glass. Popout prism: adding perceptual principles to overview+detail document interfaces. In CHI '02: Proceedings of the SIGCHI conference on Human factors in computing systems: Changing our world, changing ourselves. ACM Request Permissions, Apr. 2002.  ",
      "doi": "10.1145/503376.503422"
    },
    {
      "text": "J.-T. Sun, X. Wang, D. Shen, H.-J. Zeng, and Z. Chen. CWS: a comparative web search system. In WWW '06. ACM, May 2006.  ",
      "doi": "10.1145/1135777.1135846"
    },
    {
      "text": "The Stanford Natural Language Processing Group. Stanford CoreNLP.",
      "doi": ""
    },
    {
      "text": "T. Weninger, W. H. Hsu, and J. Han. CETR: content extraction via tag ratios. WWW 2010, 2010.  ",
      "doi": "10.1145/1772690.1772789"
    },
    {
      "text": "X. Xie, G. Miao, R. Song, J.-R. Wen, and W.-Y. Ma. Efficient Browsing of Web Search Results on Mobile Devices Based on Block Importance Model. In PERCOM '05. IEEE Computer Society, Mar. 2005.  ",
      "doi": "10.1109/PERCOM.2005.16"
    },
    {
      "text": "K. Yatani, M. Novati, A. Trusty, and K. N. Truong. Review Spotlight: A User Interface for Summarizing User-generated Reviews Using Adjective-Noun Word Pairs . In the 2011 annual conference, page 1541, New York, New York, USA, 2011. ACM Press.  ",
      "doi": "10.1145/1978942.1979167"
    },
    {
      "text": "X. Yin and W. S. Lee. Using link analysis to improve layout on mobile devices. In WWW '04. ACM, May 2004.  ",
      "doi": "10.1145/988672.988718"
    }
  ]
}