{
  "doi": "10.1145/2556288.2557043",
  "title": "Wave to me: user identification using body lengths and natural gestures",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3453-3462",
  "year": 2014,
  "badges": [],
  "abstract": "We introduce a body-based identification system that leverages individual differences in body segment lengths and hand waving gesture patterns. The system identifies users based on a two-second hand waving gesture captured by a Microsoft Kinect. To evaluate our system, we collected 8640 gesture measurements from 75 participants through two lab studies and a field study. In the first lab study, we evaluated the feasibility of our concept and basic properties of features to narrow down the design space. In the second lab study, our system achieved a 1% equal error rate in user identification among seven registered users after two weeks following initial registration. We also found that our system was robust even when lower body segments could not be measured because of occlusions. In the field study, our system achieved 0.5 to 1.6% equal error rates, demonstrating that the system also works well in ecologically valid situations. Lastly, throughout the studies, our participants were positive about the system.",
  "authors": [
    {
      "name": "Eiji Hayashi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371593190",
      "orcid": "missing"
    },
    {
      "name": "Manuel Maas",
      "institution": "Karlsruhe Institute of Technology, Karlsruhe, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959175157",
      "orcid": "missing"
    },
    {
      "name": "Jason I. Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    }
  ],
  "references": [
    {
      "text": "BioLab University of Bologna. Finger Print Verification Competition. Retrieved Sep. 13, 2013. https://biolab.csr. unibo.it/fvcongoing/UI/Form/IJCB2011.aspx",
      "doi": ""
    },
    {
      "text": "Douglas Gantenbein. Helping Kinect Recognize Faces. Retrieved Sep. 13, 2013. http://research.microsoft.com/ en-us/news/features/kinectfacereco-103111.aspx",
      "doi": ""
    },
    {
      "text": "Microsoft. Kinect for Windows SDK. Retrieved Sep. 13, 2013. http://msdn.microsoft.com/enus/library/ hh855347",
      "doi": ""
    },
    {
      "text": "Corlett N.E., and Clark S.T. 1995. The Ergonomics of Wrokspaces and Machines: A Design Manual. CRC Press. 1995.",
      "doi": ""
    },
    {
      "text": "Gafurov, D. A Survey of Biometric Gait Recognition: Approaches, Security and Challenges, NIK-2007 Conference. 2007.",
      "doi": ""
    },
    {
      "text": "Guillaume,H., and Sébastien M. A novel statistical generative model dedicated to face recognition. Image and Vision Computing. vol. 28, Issue 1, 2010, 101--110.  ",
      "doi": "10.1016/j.imavis.2009.05.001"
    },
    {
      "text": "Jain, A., Nandakumar, K., and Ross, A. Score normalization in multimodal biometric systems, Pattern Recognition, vol. 38, Issue 12, 2005, 2270--2285.  ",
      "doi": "10.1016/j.patcog.2005.01.012"
    },
    {
      "text": "Jain, A., Bolle, M.R., and Pankanti, S. Biometrics: Personal Identification in Networked Society. Springer. 2005. ",
      "doi": "10.5555/1207058"
    },
    {
      "text": "Jiayang, L., Lin, Z., Jehan, W., and Venu V. User evaluation of lightweight user authentication with a single tri-axis accelerometer. In Proc. of MobileHCI. 2009.  ",
      "doi": "10.1145/1613858.1613878"
    },
    {
      "text": "Kam L., Konrad, J., Ishwar, P., Towards Gesture-Based User Authentication, Advanced Video and Signal-Based Surveillance, 2012, 282--287.  ",
      "doi": "10.1109/AVSS.2012.77"
    },
    {
      "text": "Leyvand, T., Meekhof, C., Wei, Y., Sun, J. and Guo, B. Kinect identity: Technology and experience. IEEE Computer Society. Computer Magaznine, April, 2011, 94--96.  ",
      "doi": "10.1109/MC.2011.114"
    },
    {
      "text": "Cranor L. F. and Garfinkel S. Security and Usability Designing Secure System That People Can Use. O'Reilly Media. 2005. ",
      "doi": "10.5555/1098730"
    },
    {
      "text": "Mäntyjärvi, J., Lindholm, M., Vildjiounaite, E., Makela, S.M., and Ailisto, H. Identifying users of portable devices from gait pattern with accelerometers. In Proc. of ICASSP. vol. 2, 2005, 973--976.",
      "doi": ""
    },
    {
      "text": "Maltoni, D., Maio, D., Jain, K.A., and Prabhakar, S. 2005. Handbook of Fingerprint Recognition. Springer.",
      "doi": ""
    },
    {
      "text": "Maurer, M. E., Waxenberger, R., and Hausen, D. BroAuth: evaluating different levels of visual feedback for 3D gesture-based authentication. In Proc. of the International Working Conference on Advanced Visual Interfaces. 2012, 737--740.  ",
      "doi": "10.1145/2254556.2254697"
    },
    {
      "text": "Mayrhofer, R. and Gellersen, H. Shake well before use: two implementations for implicit context authentication. IEEE Transactions on Mobile Computing, vol.8, no.6, 2009, 792--806.  ",
      "doi": "10.1109/TMC.2009.51"
    },
    {
      "text": "Napa, S.B., Kowsar, A., Katherine, I., and Nasir, M. Biometric-rich gestures: a novel approach to authentication on multi-touch devices. In Proc. of SIGCHI. 2012, 977--986.  ",
      "doi": "10.1145/2207676.2208543"
    },
    {
      "text": "Patel, S.N., Pierce, J.S., and Abowd, G.D. A gesturebased authentication scheme for untrusted public terminals. In Proc. of UIST , 2004, 157--160.  ",
      "doi": "10.1145/1029632.1029658"
    },
    {
      "text": "Peacock, A., Ke, X., and Wilkerson, M. Typing patterns: A key to user identification. IEEE Security & Privacy, vol. 2, Issue 5, 2004, 40--47.  ",
      "doi": "10.1109/MSP.2004.89"
    },
    {
      "text": "Pheasant, S., and Haslegrave, M.C. Bodyspace: Authropometry, Ergonomics and the Design of Work. CRC Press. 2005.",
      "doi": ""
    },
    {
      "text": "Schmidt, D., Chong, M.K., and Gellersen, H. HandsDown: hand-contour-based user identification for interactive surfaces. In Proc. of NordiCHI, 2010, 432--441.  ",
      "doi": "10.1145/1868914.1868964"
    },
    {
      "text": "Snelick, R., Uludag, U., Mink, A., Indovina, M., and Jain, A. Large-scale evaluation of multimodal biometric authentication using state-of-the-art systems. IEEE Transactions on Pattern Analysis and Machine Intelligence, vol.27, no.3, 2005, 450--455.  ",
      "doi": "10.1109/TPAMI.2005.57"
    },
    {
      "text": "Tian, J., Qu, C., Xu, W., and Wang, S. KinWrite: Handwriting-Based Authentication Using Kinect. In Proc. of Annual Network & Distributed System Security Symposium, 2013.",
      "doi": ""
    },
    {
      "text": "Wan, V., and Renals, S. Speaker verification using sequence discriminant support vector machines. IEEE Transactions on Speech and Audio Processing. vol.13, no.2, 2005, 203--210 - 10 -",
      "doi": ""
    }
  ]
}