{
  "doi": "10.1145/2556288.2557338",
  "title": "Printing teddy bears: a technique for 3D printing of soft interactive objects",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "459-468",
  "year": 2014,
  "badges": [],
  "abstract": "This paper considers the design, construction, and example use of a new type of 3D printer which fabricates three-dimensional objects from soft fibers (wool and wool blend yarn). This printer allows the substantial advantages of additive manufacturing techniques (including rapid turn-around prototyping of physical objects and support for high levels of customization and configuration) to be employed with a new class of material. This material is a form of loose felt formed when fibers from an incoming feed of yarn are entangled with the fibers in layers below it. The resulting objects recreate the geometric forms specified in the solid models which specify them, but are soft and flexible -- somewhat reminiscent in character to hand knitted materials. This extends 3D printing from typically hard and precise forms into a new set of forms which embody a different aesthetic of soft and imprecise objects, and provides a new capability for researchers to explore the use of this class of materials in interactive devices.",
  "authors": [
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University & Disney Research Pittsburgh, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Berglin, L. (2005) 'Spookies: Combining smart materials and information technology in an interactive toy', In Proc. of Interactive Design and Children (IDC '05), pp.17--23.  ",
      "doi": "10.1145/1109540.1109543"
    },
    {
      "text": "Buechley, L., Eisenberg, M., Catchen, J. and Crockett, A. (2008) \"The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education\", In Proc. of the SIGCHI on Human factors in Computing Systems (CHI '08), pp. 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "K. Cherenack, C. Zysset, T. Kinkeldei, N. Münzenrieder, and G. Tröster (2010) \"Woven Electronic Fibers with Sensing and Display Functions for Smart Textiles,\" Advanced Materials, vol. 22, no. 45, pp. 5178--5182.",
      "doi": ""
    },
    {
      "text": "Crump S. (1992) \"Apparatus and method for creating three-dimensional objects\", US Patent 5121329A.",
      "doi": ""
    },
    {
      "text": "Holleis, P., Schmidt, A., Paasovaara, S., Puikkonen, A., and Häkkilä, J., (2008) \"Evaluating capacitive touch input on clothes\", In Proc. of the Conf. on Human Computer Interaction with Mobile Devices and Services, pp. 81--91.  ",
      "doi": "10.1145/1409240.1409250"
    },
    {
      "text": "Johnson, J. S., Hawley, J. (2004) Technology's impact on creative traditions: Pieceful co-existence in quilting. In Clothing and Textiles Research Journal, 22(1/2), pp. 6978.",
      "doi": ""
    },
    {
      "text": "Jones, R., Haufe, P., Sells, E., Iravani, P., Olliver, V., Palmer, C. and Bowyer, A., (2011) \"RepRap -- the replicating rapid prototyper\", Robotica, 29, pp. 177--191.  ",
      "doi": "10.1017/S026357471000069X"
    },
    {
      "text": "Kramer, T., Proctor, F., Messina, E. (2000) \"The NIST RS274NGC Interpreter - Version 3\", National Institute of Standards and Technology Interagency/Internal Report (NISTIR) -- 6556. Available from: http://www.nist.gov/ manuscript-publicationsearch.cfm?pub_id=823374",
      "doi": ""
    },
    {
      "text": "Mueller, S., Kruck, B., and Baudisch, P. (2013) \"LaserOrigami: laser-cutting 3D objects\", In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems (CHI '13), pp. 2585--2592.  ",
      "doi": "10.1145/2470654.2481358"
    },
    {
      "text": "Perner-Wilson, H. and Buechley, L. (2010) \"Making textile sensors from scratch. In Proc. of the International Conf. on Tangible, Embedded, and Embodied Interaction (TEI '10), pp. 349--352.  ",
      "doi": "10.1145/1709886.1709972"
    },
    {
      "text": "Pfeifer, R., Lungarella, M., and Iida, F. (2012) \"The challenges ahead for bio-inspired 'soft' robotics\". Commun. ACM 55, 11, pp. 76--87.  ",
      "doi": "10.1145/2366316.2366335"
    },
    {
      "text": "Rosner, D., and Ryokai, K. (2008) \"Spyn: augmenting knitting to support storytelling and reflection\", In Proc. of the International Conf. on Ubiquitous Computing, pp.340--349  ",
      "doi": "10.1145/1409635.1409682"
    },
    {
      "text": "Rosner , D., and Ryokai, K., (2009) \"Reflections on craft: probing the creative process of everyday knitters\", In Proc. of the ACM Conf. on Creativity and Cognition, pp. 195--204.  ",
      "doi": "10.1145/1640233.1640264"
    },
    {
      "text": "Saakes, D., Cambazard, T., Mitani, J., and Igarashi, T. (2013) \"PacCAM: material capture and interactive 2D packing for efficient material usage on CNC cutting machines\". In Proc. of the ACM Symposium on User Interface Software and Technology (UIST '13), pp. 441446.  ",
      "doi": "10.1145/2501988.2501990"
    },
    {
      "text": "Savage, V., Zhang, X. and Hartmann, B. (2012) \"Midas: fabricating custom capacitive touch sensors to prototype interactive objects\", In Proceedings of the ACM Symposium on User Interface Software and Technology, pp. 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Slyper, R., Poupyrev, I., and Hodgins, J. (2010) \"Sensing through structure: designing soft silicone sensors\", In Proc. of the International Conf. on Tangible, Embedded, and Embodied Interaction (TEI '11), pp. 213--220.  ",
      "doi": "10.1145/1935701.1935744"
    },
    {
      "text": "Trivedi, D., Rahn, C., Kier,W, and Walker, I (2008) \"Soft robotics: Biological inspiration, state of the art, and future research\", Applied Bionics and Biomechanics, v5, n3, pp. 99--117.  ",
      "doi": "10.1080/11762320802557865"
    },
    {
      "text": "Willis, K., Brockmeyer, E., Hudson, S. and Poupyrev, I. (2012) \"Printed optics: 3D printing of embedded optical elements for interactive devices\". In Proc. of the ACM Symposium on User interface Software and Technology (UIST '12), pp. 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Yoshikai, T., Fukushima, H., Hayashi, M., and Inaba, M. (2009) \"Development of soft stretchable knit sensor for humanoids' whole-body tactile sensibility\", In Proc. of the IEEE-RAS International Conf. on Humanoid Robots. pp. 624--631.",
      "doi": ""
    },
    {
      "text": "Zoran, A., Shilkrot, R., and Paradiso, J. (2013) \"Humancomputer interaction for hybrid carving\". In Proc. of the ACM Symposium on User Interface Software and Technology (UIST '13) pp. 433--440.  ",
      "doi": "10.1145/2501988.2502023"
    }
  ]
}