{
  "doi": "10.1145/2556288.2557166",
  "title": "Wrigglo: shape-changing peripheral for interpersonal mobile communication",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3973-3976",
  "year": 2014,
  "badges": [],
  "abstract": "We introduce Wrigglo, a shape-changing smart phone peripheral that allows pairs of users to share wriggling movements with one another. Attached to a smart phone, Wrigglo captures the sender's motions and activates the receiver's Wrigglo which repeats the motion simultaneously. The result of our in-lab use observation with twelve couples showed that Wrigglo supported emotional and functional roles of body gestures and postures, creating vocabularies related to the motion of specific body parts and, to some extent, reflected the connected user's presence through the device's movement. Through its peripheral anthropomorphization, Wrigglo can deliver new forms of telepresence by embodied posturing and gesturing in mobile communication.",
  "authors": [
    {
      "name": "Joohee Park",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958899357",
      "orcid": "missing"
    },
    {
      "name": "Young-Woo Park",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81413599235/rel-imgonly/untitled-1.jpg",
      "acmid": "81413599235",
      "orcid": "0000-0003-2257-9394"
    },
    {
      "name": "Tek-Jin Nam",
      "institution": "KAIST (Korea Advanced Institute of Science and Technology), Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320511",
      "orcid": "0000-0002-7942-0766"
    }
  ],
  "references": [
    {
      "text": "Brave, S., Ishii, H. and Dahley, A. (1998) Tangible interfaces for remote collaboration and communication. In Proc. CSCW '98, 169--178.  ",
      "doi": "10.1145/289444.289491"
    },
    {
      "text": "Cassell J. & Thorisson, K.R.(1999) The power of anodandaglance: Envelope vs. emotional feedback inanimated conversational agents, Applied Artificial Intelligence 13,4--5, 519--538.",
      "doi": ""
    },
    {
      "text": "Chang, A., O'Modhrain, S., Jacob, R., Gunther, E., and Ishii, H. (2002) Comtouch: Design of a vibrotactile communication device. In Proc. DIS 2002, 312--320.  ",
      "doi": "10.1145/778712.778755"
    },
    {
      "text": "Dael, N., Mortillaro, M. & Scherer, K.R. (2012) Emotion Expression in Body Action and Posture. Emotion 12(5), 1085--1101.",
      "doi": ""
    },
    {
      "text": "Gomes, A., Nesbitt, A. & Vertegaal, R. (2013) MorePhone: a study of actuated shape deformations for flexible thin-film smartphone notifications. In Proc. CHI'13, 583--592.  ",
      "doi": "10.1145/2470654.2470737"
    },
    {
      "text": "Hemmert, F., Löwe, M., Wohlauf, A. & Joost, G. (2013) Animate Mobiles: Proxemically Reactive Posture Actuation as a Means of Relational Interaction with Mobile Phones. In Proc. TEI'13, 267--270.  ",
      "doi": "10.1145/2460625.2460669"
    },
    {
      "text": "Kaye, J. J. (2006) I just clicked to say I love you: rich evaluations of minimal communication. Ext. Abs. CHI'06, 363--368.  ",
      "doi": "10.1145/1125451.1125530"
    },
    {
      "text": "Knapp, M. L. & Hall, J. A. (1997) Nonverbal Communication in Human Interaction. Thomson Wadsworth Press, 6th Edit.",
      "doi": ""
    },
    {
      "text": "Nakagawa, Y., Kamimura, A. & Kawaguchi, Y. (2012) MimicTile: a variable stiffness deformable user interface for mobile devices. In Proc. CHI'12, 745--748.  ",
      "doi": "10.1145/2207676.2207782"
    },
    {
      "text": "Quintanilha, M. (2008) Buddy Wall: a tangible user interface for wireless remote communication. Ext. Abs. CHI'08, 3711--3716.  ",
      "doi": "10.1145/1358628.1358918"
    },
    {
      "text": "Raffle, H.,Wang, R., Seada, K. & Ishii, H. (2011) Communiclay: a modular system for tangible telekinetic communication. Ext. Abs. CHI'11, 233--242.  ",
      "doi": "10.1145/1979742.1979612"
    },
    {
      "text": "Rasmussen, R. K., Lehoux, N., Ocnarescu, I. & Krogh, P. G. (2012) I'll knock you when I'm ready...: reflecting on media richness beyond bandwidth and imitation. In Proc. DIS 2012, 106--115.  ",
      "doi": "10.1145/2317956.2317974"
    },
    {
      "text": "Walters, P. & McGoran, D. (2011) Digital fabrication of smart structures and mechanism: Creative applications in art and design. In Proc. IS&T 2011, 185--188.",
      "doi": ""
    },
    {
      "text": "Witmer, D. F. and Katzman, S. L., (1997) On-Line Smiles: Does Gender Make a Difference in the Use of Graphic Accents' Computer-Mediated Communication 2, 4.",
      "doi": ""
    },
    {
      "text": "Yim, J-D. & Shaw, C.D. (2011) Design Considerations of Expressive Bidirectional Telepresence Robots. Ext. Abs. CHI'11, 781--790.  ",
      "doi": "10.1145/1979742.1979633"
    }
  ]
}