{
  "doi": "10.1145/2556288.2557342",
  "title": "Between theory and practice: bridging concepts in HCI research",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1635-1644",
  "year": 2014,
  "badges": [],
  "abstract": "We present the notion of \"bridging concepts\" as a particular form of intermediary knowledge in HCI research, residing between theory and practice. We argue that bridging concepts address the challenge of facilitating exchange between theory and practice in HCI, and we compare it to other intermediary forms of knowledge such as strong concepts and conceptual constructs. We propose that bridging concepts have three defining constituents: a theoretical foundation, a set of design articulations and a range of exemplars that demonstrate the scope and potential of their application. These constituents specify how bridging concepts, as a form of knowledge, are accountable to both theory and practice. We present an analysis of the concept of \"peepholes\" as an example of a bridging concept aimed at spurring user curiosity and engagement.",
  "authors": [
    {
      "name": "Peter Dalsgaard",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81100468838/rel-imgonly/peter.jpeg",
      "acmid": "81100468838",
      "orcid": "missing"
    },
    {
      "name": "Christian Dindler",
      "institution": "Aarhus University, Aarthus, Denmark",
      "img": "/do/10.1145/contrib-81309504065/rel-imgonly/81309504065.jpg",
      "acmid": "81309504065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. A Pattern Language: Towns, Buildings, Construction. USA: Oxford University Press (1977).",
      "doi": ""
    },
    {
      "text": "Bowers, J. The logic of annotated portfolios: communicating the value of \"research through design\". In Proc. DIS 2012. ACM Press (2012), 68--77.  ",
      "doi": "10.1145/2317956.2317968"
    },
    {
      "text": "Bærentsen, C., Trettvik, J. An activity theory approach to affordace. Proc. NordiCHI 2002, ACM Press (2002).  ",
      "doi": "10.1145/572020.572028"
    },
    {
      "text": "Cao, X., Li, J.J., Balakrishnan, R. Peephole pointing: modeling acquisition of dynamically revealed targets. Proc. CHI 2008, ACM Press (2008), 1699--1708.  ",
      "doi": "10.1145/1357054.1357320"
    },
    {
      "text": "Dalsgaard, P. 2009. Designing Engaging Interactive Environments: A Pragmatist Perspective. Aarhus University, Denmark.",
      "doi": ""
    },
    {
      "text": "Dalsgaard, P., Dindler, C. 2009. Peepholes as means of engagement in interaction design, Proc. of Nordes 2009, Oslo, Norway.",
      "doi": ""
    },
    {
      "text": "Dalsgaard, P., Halskov, K. 2012. Tangible 3D Tabletops: Combining Tangible Tabletop Interaction and 3D Projection, Proc. of NordiCHI 2012, ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/2399016.2399033"
    },
    {
      "text": "Dalsgaard, P. Designing for Inquisitive Use. Proc. DIS 2008, ACM Press (2008), 21--30.  ",
      "doi": "10.1145/1394445.1394448"
    },
    {
      "text": "Dalsgaard, P. Pragmatism and Design Thinking. International Journal of Design 8,1 (2014).",
      "doi": ""
    },
    {
      "text": "Deckers, E. Perceptive Qualities in Systems of Interactive Products. Eindhoven University of Technology (2013).",
      "doi": ""
    },
    {
      "text": "Dindler, C., Krogh, P.G., Beck, S., Stenfeldt, L., Nielsen, K.R., Grønbæk, K. 2007. Peephole Experiences - Field Experiments with Mixed Reality Hydroscopes in a Marine Center, in Proc. of DUX 2007, ACM, New York, NY.  ",
      "doi": "10.1145/1389908.1389934"
    },
    {
      "text": "Dewey, J. The middle works. 15 volumes, 1976--83 Edition (Boydston, J.A. eds.) Southern Illinois University Press, Carbondale, 1899--1924.",
      "doi": ""
    },
    {
      "text": "Dewey, J. The later works. 16 volumes. 1981--1990 Edition (Boydston, J.A. eds.), Southern Illinois University Press, Carbondale, 1925--1953.",
      "doi": ""
    },
    {
      "text": "Dewey, J. Art as Experience. 2005 edition, Perigree, New York, 1934.",
      "doi": ""
    },
    {
      "text": "Dewey, J. Logic: the theory of inquiry. Holt, Rinehart and Winston, New York, 1938.",
      "doi": ""
    },
    {
      "text": "Dewey, J. The Essential Dewey: Ethics, logic, psychology. (Hickman, L., Alexander, T. eds.). Indiana University Press, Bloomington, 1998.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G. Situated information spaces and spatially aware palmtop computers. Communications of the ACM 36, 7 (1993), 39--49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Forlizzi, J., Battarbee, K. Understanding experience in interactive systems. Proc. DIS 2004, ACM Press (2004), 261--268.  ",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Gaver, W.W., Bowers, J., Boucher, A., Gellerson, H., Pennington, S., Schmidt, A., Steed, A., Villars, N., Walker, B. The Drift Table: Designing for Ludic Engagement. Proc. CHI 2004, ACM Press (2004), 885--900.  ",
      "doi": "10.1145/985921.985947"
    },
    {
      "text": "Hume, N. Listen Here!, http://www.nicolahume.co.uk/listen-here/, accessed on September 17th 2013.",
      "doi": ""
    },
    {
      "text": "Höök, K., Löwgren, J. Strong concepts: Intermediatelevel knowledge in interaction design research, ACM TOCHI 19, 3 (2012).  ",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Kaptelinin, V., Nardi, B.A. Activity theory: basic concepts and applications. Proc. CHI 1997, ACM Press (1997).  ",
      "doi": "10.1145/1120212.1120321"
    },
    {
      "text": "Kaptelinin, V., Nardi, B. Affordances in HCI: toward a mediated action perspective. Proc. CHI 2013, ACM Press (2013), 967--976.  ",
      "doi": "10.1145/2207676.2208541"
    },
    {
      "text": "Kaufmann, B. Ahlström, D. Studying spatial memory and map navigation performance on projector phones with peephole interaction. Proc. CHI 2013, ACM Press (2013), 211--220.  ",
      "doi": "10.1145/2470654.2466434"
    },
    {
      "text": "Kay, A. A personal computer for children of all ages. Palo Alto, CA: Xerox Palo Alto Research Center, 1972.",
      "doi": ""
    },
    {
      "text": "Koskinen, I., Zimmerman, J., Binder, T., Redstrom, J., & Wensveen, S. Design Research Through Practice: From the Lab, Field, and Showroom. Morgan Kaufmann (2011). ",
      "doi": "10.5555/2132674"
    },
    {
      "text": "Krippendorff, K. On the Essential Contexts of Artifacts or on the Proposition That \"Design Is Making Sense (Of Things)\". Design Issues 5, 2 (1989), 9--39.",
      "doi": ""
    },
    {
      "text": "Krippendorff, K. The Semantic Turn: A New Foundation for Design. Taylor and Francis, Boca Raton, 2006.",
      "doi": ""
    },
    {
      "text": "Krogh, P. G., Petersen, M.G. Design Articulations for Aesthetics of Interaction. Proc. DPPI 2009, ACM Press (2009).",
      "doi": ""
    },
    {
      "text": "Lim, Y.K., Stolterman, E., Jung, H., Donalson, J. Interaction gestalt and the design of aesthetic interactions. Proc. DPPI 2007, ACM Press (2007), 239254.  ",
      "doi": "10.1145/1314161.1314183"
    },
    {
      "text": "Locher, P., Overbeeke, K., Wensveen, S. Aesthetic Interaction: A Framework, Design Issues 26, 2 (2010), 70--79.",
      "doi": ""
    },
    {
      "text": "McCarthy, J, Wright, P. Technology as Experience, MIT Press, Cambridge, 2004. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Mehra, S., Werkhoven, P., Worring, M. Navigating on handheld displays: Dynamic versus static peephole navigation, TOCHI 13, 4 (2006), 448--457.  ",
      "doi": "10.1145/1188816.1188818"
    },
    {
      "text": "Norman, D. The Psychology of Everyday Things, Basic Books, NY, USA, 1988.",
      "doi": ""
    },
    {
      "text": "Ofishea, C. Out of Bounds. 2007, http://www.chrisoshea.org/projects/out-of-bounds/, accessed on September 17th 2013.",
      "doi": ""
    },
    {
      "text": "Overbeeke, K., Wensveen, S. From Perception to Experience, from Affordances to Irresistible. Proc. DPPI 2003, ACM Press (2003), 92--97.  ",
      "doi": "10.1145/782896.782919"
    },
    {
      "text": "Petersen, M.G., Iversen, O.S., Krogh, P.G., Ludvigsen, M. Aesthetic interaction: a pragmatist's aesthetics of interactive systems. Proc. DIS 2004, ACM Press (2004), 269--276.  ",
      "doi": "10.1145/1013115.1013153"
    },
    {
      "text": "Rohs, M., Essl, G., Schöning, J. Naumann, A., Schleicher, R., Krüger, A. 2009. Impact of item density on magic lens interactions. Proc. MobileCHI 2009, ACM Press (2009).  ",
      "doi": "10.1145/1613858.1613907"
    },
    {
      "text": "Rogers, Y. New Theoretical Approaches for HCI, Annual Review of Information Science and Technology 38, 1 (2004), 87--143.",
      "doi": ""
    },
    {
      "text": "Stolerman, E. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design 2, 1 (2008).",
      "doi": ""
    },
    {
      "text": "Stolterman, E., Wiberg, M. Concept-Driven Interaction Design Research. Human-Computer Interaction 25, 2 (2010), 95--118.",
      "doi": ""
    },
    {
      "text": "Tidwell, J. Designing Interfaces: Patterns for Effective Interaction Design. O'Reilly and Associates, 2005. ",
      "doi": "10.5555/1203417"
    },
    {
      "text": "Yee, K.P. Peephole displays: pen interaction on spatially aware handheld computers. Proc. CHI 2003, ACM Press (2003), 1--8.  ",
      "doi": "10.1145/642611.642613"
    },
    {
      "text": "Zimmerman, J. \"Designing for the self: making products that help people become the person they desire to be.\" In Proc. CHI 2009, ACM, (2009), 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}