{
  "doi": "10.1145/2556288.2557005",
  "title": "faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3827-3834",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present a new approach to rapid prototyping of functional objects, such as the body of a head-mounted display. The key idea is to save 3D printing time by automatically substituting sub-volumes with standard building blocks'in our case Lego bricks. When making the body for a head-mounted display, for example, getting the optical path right is paramount. Users thus mark the lens mounts as \"high-resolution\" to indicate that these should later be 3D printed. faBrickator then 3D prints these parts. It also generates instructions that show users how to create everything else from Lego bricks. If users iterate on the design later, faBrickator offers even greater benefit as it allows re-printing only the elements that changed. We validated our system at the example of three 3D models of functional objects. On average, our system fabricates objects 2.44 times faster than traditional 3D printing while requiring only 14 minutes of manual assembly.",
  "authors": [
    {
      "name": "Stefanie Mueller",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    },
    {
      "name": "Tobias Mohr",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959097757",
      "orcid": "missing"
    },
    {
      "name": "Kerstin Guenther",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959215757",
      "orcid": "missing"
    },
    {
      "name": "Johannes Frohnhofen",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958706057",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Brockmeyer, E., Poupyrev, I., Hudson, S. PAPILLON: Designing Curved Display Surfaces With Printed Optics. Proc. UIST'13, 457--462.  ",
      "doi": "10.1145/2501988.2502027"
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann, '07. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The Psychology of Optimal Experience. Harper Perennial Modern Classics, '08.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Carr, D., Lovell, E., Hiroshi, I. CopyCAD: remixing physical objects with copy and paste from the real world. Adjunct Proc. UIST '10, 381--382.  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Gower, R., Heydtmann, A., Petersen, H. LEGO: Automated Model Construction. European Study Group with Industry. Study Report '98, 81'94.",
      "doi": ""
    },
    {
      "text": "Hansen, C. J., Saksena, R., Kolesky, D. B., Vericella, J. J., Kranz, S. J., Muldowney, G. P., Christensen, K. T., Lewis, J. A. High-Throughput Printing via Microvascular Multinozzle Arrays. Advanced Materials '13, Vol. 25, Issue 1.",
      "doi": ""
    },
    {
      "text": "Hiller, J., Lipson, H. Methods of Parallel Voxel Manipulation for 3D Digital Printing. Proc. SFF Symposium '07, 200--211.",
      "doi": ""
    },
    {
      "text": "Gershenfeld, N. Fab: The Coming Revolution on Your Desktop--From Personal Computers to Personal Fabrication. Basic Books, '07. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Lego Assembler, 2010. http://mikeshouts.com/Legomade-3D-printer-that-builds-Lego-out-of-Lego/",
      "doi": ""
    },
    {
      "text": "Mori, Y., Igarashi, T. Plushie: an interactive design system for plush toys. SIGGRAPH '07, No. 45.  ",
      "doi": "10.1145/1276377.1276433"
    },
    {
      "text": "Mueller, S., Lopes, P., Baudisch, P. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. Proc. UIST '12, 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Mueller, S., Kruck, B., Baudisch, P. LaserOrigami: Laser-Cutting 3D Objects. Proc. CHI'13, 2585--2592.  ",
      "doi": "10.1145/2470654.2481358"
    },
    {
      "text": "Oh, Y., Johnson, G., Gross, M., Do, E.Y. The Designosaur and the Furniture Factory. Proc. DCC'06, 123--140.",
      "doi": ""
    },
    {
      "text": "Petchkovsky, G. Mixing Digital Sculpture with Real Objects. '12.",
      "doi": ""
    },
    {
      "text": "Petrovic, P. Solving the LEGO brick layout problem using evolutionary algorithms. Tech. rep., Norwegian University of Science and Technology '01.",
      "doi": ""
    },
    {
      "text": "Rivers, A., Moyer, I.E., Durand, F. Position-correcting tools for 2D digital fabrication. Proc. SIGGRAPH'12 (TOG), Vol. 31, Issue 4, No. 88.  ",
      "doi": "10.1145/2185520.2185584"
    },
    {
      "text": "Savage, V., Zhang, X., Hartmann, B. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. Proc. UIST '12, 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Savage, V., Chang, C., Hartmann, B. Sauron: Embedded Single-Camera Sensing of Printed Physical User Interfaces. Proc. UIST'13, 447--456.  ",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Saul, G., Lau, M., Mitani, J., Igarashi, T. SketchChair: an all-in-one chair design system for end users. Proc. TEI '11, 73--80.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Science News, skull implant, 2013. https://www.sciencenews.org/article/plastic-implantreplaces-three-quarters-mans-skull",
      "doi": ""
    },
    {
      "text": "Song, H., Guimbretière, F., Lipson, H., Hu, C. ModelCraft: Capturing Freehand Annotations and Edits on Physical 3D Models. Proc. UIST '06, 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Testuz, R., Schwartzburg, Y., Pauly, M. Automatic Generation of Constructable Brick Sculptures. Proc. Eurographics '13, 81--84.",
      "doi": ""
    },
    {
      "text": "Van Zijl, L., Smal, E. Cellular automata with cell clustering. Proc. Automata '08, 425--441.",
      "doi": ""
    },
    {
      "text": "Wibowo, A., Sakamoto, D., Mitani, J., Igarashi, T. DressUp: a 3D interface for clothing design with a physical mannequin. Proc. TEI '12, 99--102.  ",
      "doi": "10.1145/2148131.2148153"
    },
    {
      "text": "Willis, K.D.D., Brockmeyer, E., Hudson, S.E., Poupyrev, I. Printed Optics: 3D Printing of Embedded Optical Elements for Interactive Devices. Proc. UIST '12, 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Willis, K.D.D., Lin, J., Mitani, J., Igarashi, T. Spatial sketch: bridging between movement & fabrication. Proc. TEI '10, 5--12.  ",
      "doi": "10.1145/1709886.1709890"
    },
    {
      "text": "Willis, K.D.D., Xu, C., Wu, J.K., Levin, G., Gross, M.D. Interactive fabrication: new interfaces for digital fabrication. Proc. TEI '11, 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Winkler, D.: Automated brick layout. BrickFest, 2005.",
      "doi": ""
    },
    {
      "text": "Zoran, A., Buechley, L. Hybrid reAssemblage: An Exploration of Craft, Digital Fabrication and Artifact Uniqueness. Leonardo Journal '13, Vol. 46, Issue 1.",
      "doi": ""
    },
    {
      "text": "Zoran, A., Paradiso, J.A. FreeD: a freehand digital sculpting tool. Proc. CHI'13, 2613--2616.  ",
      "doi": "10.1145/2470654.2481361"
    }
  ]
}