{
  "doi": "10.1145/2556288.2557237",
  "title": "Wearables and chairables: inclusive design of mobile input and output techniques for power wheelchair users",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3103-3112",
  "year": 2014,
  "badges": [],
  "abstract": "Power wheelchair users often use and carry multiple mobile computing devices. Many power wheelchair users have some upper body motor impairment that can make using these devices difficult. We believe that mobile device accessibility could be improved through designs that take into account users' functional abilities and take advantage of available space around the wheelchair itself. In this paper we present findings from multiple design sessions and interviews with 13 power wheelchair users and 30 clinicians, exploring the placement and form factor possibilities for input and output on a power wheelchair. We found that many power wheelchair users could benefit from chairable technology that is designed to work within the workspace of the wheelchair, whether worn on the body or mounted on he wheelchair frame. We present participants' preferences for chairable input and output devices, and identify possible design configurations for wearable and chairable devices.",
  "authors": [
    {
      "name": "Patrick Carrington",
      "institution": "University of Maryland, Baltimore County, Baltimore, MD, USA",
      "img": "/do/10.1145/contrib-81549308756/rel-imgonly/199a1731.jpg",
      "acmid": "81549308756",
      "orcid": "0000-0001-8923-0803"
    },
    {
      "name": "Amy Hurst",
      "institution": "University of Maryland, Baltimore County, Baltimore, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659692402",
      "orcid": "missing"
    },
    {
      "name": "Shaun K. Kane",
      "institution": "University of Maryland, Baltimore County, Baltimore, MD, USA",
      "img": "/do/10.1145/contrib-81329489903/rel-imgonly/kane-headshot.jpg",
      "acmid": "81329489903",
      "orcid": "0000-0002-0276-9417"
    }
  ],
  "references": [
    {
      "text": "Anthony, L., Kim, Y., and Findlater, L. Analyzing User-Generated YouTube Videos to Understand Touchscreen Use by People with Motor Impairments. Proc. CHI 2013, ACM Press (2013) p. 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Ashbrook, D. L., Clawson, J. R., Lyons, K., Starner, T. E., & Patel, N. (2008). Quickdraw: the impact of mobility and on-body placement on device access time. Proc. CHI 2008, ACM Press (2008) pp. 219--222.  ",
      "doi": "10.1145/1357054.1357092"
    },
    {
      "text": "Bailly, G., Müller, J., Rohs, M., Wigdor, D., & Kratz, S. ShoeSense: a new perspective on gestural interaction and wearable applications. Proc. CHI 2012, ACM Press (2012) pp. 1239--1248.  ",
      "doi": "10.1145/2207676.2208576"
    },
    {
      "text": "Bispo, R., & Branco, R. Designing out stigma: the role of objects in the construction of disabled people's identity. Proc. International Design & Emotion Conference (2008).",
      "doi": ""
    },
    {
      "text": "Braga, R. A., Petry, M., Reis, L. P., & Moreira, A. P. (2011). IntellWheels: modular development platform for intelligent wheelchairs. Journal of rehabilitation research and development, 48(9), 1061.",
      "doi": ""
    },
    {
      "text": "Brewster, S., Lumsden, J., Bell, M., Hall, M., & Tasker, S. Multimodal 'eyes-free' interaction techniques for wearable devices. Proc. CHI 2003, ACM Press (2003) pp. 473--480.  ",
      "doi": "10.1145/642611.642694"
    },
    {
      "text": "Buechley, L., & Hill, B. M. LilyPad in the wild: how hardware's long tail is supporting new engineering and design communities. Proc. DIS'2010, ACM Press (2010) pp. 199--207.  ",
      "doi": "10.1145/1858171.1858206"
    },
    {
      "text": "Cook, A. M., & Polgar, J. M. (2007). Cook and Hussey's Assistive Technologies: Principles and Practice, 3rd ed. St. Louis, MO. Mosby Elsevier.",
      "doi": ""
    },
    {
      "text": "Elliott, G. C., Ziegler, H. L., Altman, B. M., & Scott, D. R. (1982). Understanding stigma: Dimensions of deviance and coping. Deviant Behavior, 3(3), 275--300.",
      "doi": ""
    },
    {
      "text": "Fox, S. (2011). Americans living with disability and their technology profile. Pew Research Center's Internet & American Life Project.",
      "doi": ""
    },
    {
      "text": "Froehlich, J., Wobbrock, J. O., & Kane, S. K. Barrier pointing: using physical edges to assist target acquisition on mobile device touch screens. Proc. ASSETS 2007, ACM Press (2007) p. 19--26.  ",
      "doi": "10.1145/1296843.1296849"
    },
    {
      "text": "Guerreiro, T., Nicolau, H., Jorge, J., & Gonçalves, D. Towards accessible touch interfaces. Proc. ASSSETS 2010, ACM Press (2010) p. 19--26.  ",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "Harrison, C., Tan, D., & Morris, D. Skinput: appropriating the body as an input surface. Proc. CHI'2010, ACM Press (2010) pp. 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Kane, S. K., Jayant, C., Wobbrock, J. O., & Ladner, R. E. Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. Proc. ASSETS 2009, ACM Press (2009) pp. 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Kaye, H. S. (2000). Computer and Internet use among people with disabilities (Vol. 13). Washington, DC: US Dept. of Education, National Institute on Disability and Rehabilitation Research.",
      "doi": ""
    },
    {
      "text": "Kim, J., Cho, S., & Kim, S. J. (2008). Preliminary studies to develop a ubiquitous computing and healthmonitoring system for wheelchair users. Proc. ICST BodyNets 2008 (p. 3). ",
      "doi": "10.5555/1460257.1460262"
    },
    {
      "text": "Kim, J., & Smith, P. (2008). Survey Study to Develop a Wheelchair-worn Computing and Health-monitoring System. Proc. RESNA 2008.",
      "doi": ""
    },
    {
      "text": "Lin, C. T., Euler, C., Wang, P. J., & Mekhtarian, A. (2012). Indoor and outdoor mobility for an intelligent autonomous wheelchair. Proc. ICCHP 2012. (pp. 172--179). Springer Berlin Heidelberg.  ",
      "doi": "10.1007/978-3-642-31534-3_26"
    },
    {
      "text": "Nischelwitzer, A. K., Sproger, B., Mahr, M., & Holzinger, A. (2006). MediaWheelie - a best practice example for research in multimodal user interfaces (MUIs). Proc. ICCHP 2006 pp. 999--1005.  ",
      "doi": "10.1007/11788713_146"
    },
    {
      "text": "O'Connor, T. J., Cooper, R. A., Fitzgerald, S. G., Dvorznak, M. J., Boninger, M. L., VanSickle, D. P., & Glass, L. (2000). Evaluation of a manual wheelchair interface to computer games. Neurorehabilitation and Neural Repair, 14(1), 21--31.",
      "doi": ""
    },
    {
      "text": "Parette, P., & Scherer, M. (2004). Assistive technology use and stigma. Education and Training in Developmental Disabilities, 39(3), 217--226.",
      "doi": ""
    },
    {
      "text": "Saponas, T. S., Tan, D. S., Morris, D., Balakrishnan, R., Turner, J., & Landay, J. A. Enabling always-available input with muscle-computer interfaces. Proc. UIST 2009, ACM Press (2009) pp. 167--176.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Saponas, T. S., Kelly, D., Parviz, B. A., & Tan, D. S. Optically sensing tongue gestures for computer input. Proc. UIST 2009, ACM Press (2009) pp. 177--180.  ",
      "doi": "10.1145/1622176.1622209"
    },
    {
      "text": "Saponas, T. S., Harrison, C., & Benko, H. PocketTouch: Through-fabric capacitive touch input. Proc. UIST 2011, ACM Press (2011) pp. 303--308.  ",
      "doi": "10.1145/2047196.2047235"
    },
    {
      "text": "Sears, A., Lin, M., Jacko, J., & Xiao, Y. (2003). When computers fade: Pervasive computing and situationally-induced impairments and disabilities. Proc. HCI International 2003. Vol. 2, pp. 1298--1302.",
      "doi": ""
    },
    {
      "text": "Sears, A., & Young, M. (2002). Physical disabilities and computing technologies: an analysis of impairments. In The human-computer interaction handbook (pp. 482--503). L. Erlbaum Associates Inc. ",
      "doi": "10.5555/772072.772105"
    },
    {
      "text": "Shinohara, K., & Wobbrock, J. O. In the shadow of misperception: assistive technology use and social interactions. Proc. CHI 2011, ACM Press (2011) pp. 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Wakita, A., & Shibutani, M. Mosaic textile: wearable ambient display with non-emissive color-changing modules. In Proc. CHI 2006. ACM Press (2006) p. 48.  ",
      "doi": "10.1145/1178823.1178880"
    },
    {
      "text": "Wobbrock, J. O., Myers, B. A., Aung, H. H., & LoPresti, E. F. Text entry from power wheelchairs: edgewrite for joysticks and touchpads. Proc. ASSETS 2004, ACM Press (2004) pp. 110--117.  ",
      "doi": "10.1145/1028630.1028650"
    },
    {
      "text": "Xiao, R., Harrison, C., & Hudson, S. E. WorldKit: rapid and easy creation of ad-hoc interactive applications on everyday surfaces. Proc. CHI 2013, ACM Press (2013) pp. 879--888.  ",
      "doi": "10.1145/2470654.2466113"
    }
  ]
}