{
  "doi": "10.1145/2556288.2557025",
  "title": "Smart photo selection: interpret gaze as personal interest",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2065-2074",
  "year": 2014,
  "badges": [],
  "abstract": "Manually selecting subsets of photos from large collections in order to present them to friends or colleagues or to print them as photo books can be a tedious task. Today, fully automatic approaches are at hand for supporting users. They make use of pixel information extracted from the images, analyze contextual information such as capture time and focal aperture, or use both to determine a proper subset of photos. However, these approaches miss the most important factor in the photo selection process: the user. The goal of our approach is to consider individual interests. By recording and analyzing gaze information from the user's viewing photo collections, we obtain information on user's interests and use this information in the creation of personal photo selections. In a controlled experiment with 33 participants, we show that the selections can be significantly improved over a baseline approach by up to 22% when taking individual viewing behavior into account. We also obtained significantly better results for photos taken at an event participants were involved in compared with photos from another event.",
  "authors": [
    {
      "name": "Tina Caroline Walber",
      "institution": "Institute WeST, Koblenz, Germany",
      "img": "/do/10.1145/contrib-81501680722/rel-imgonly/tinawalber.png",
      "acmid": "81501680722",
      "orcid": "missing"
    },
    {
      "name": "Ansgar Scherp",
      "institution": "Kiel University & Leibniz Information Center for Economics, Kiel, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100037789",
      "orcid": "missing"
    },
    {
      "name": "Steffen Staab",
      "institution": "University of Koblenz-Landau, Koblenz, Germany",
      "img": "/do/10.1145/contrib-81409593685/rel-imgonly/akademiepreis-portrait-staab.png",
      "acmid": "81409593685",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bradley, M. M., Miccoli, L., Escrig, M. A., and Lang, P. J. The pupil as a measure of emotional arousal and autonomic activation. Psychophysiology 45, 4 (2008), 602--607.",
      "doi": ""
    },
    {
      "text": "Brumby, D. P., and Howes, A. Strategies for guiding interactive search: An empirical investigation into the consequences of label relevance for assessment and selection. Human-Computer Interaction 23, 1 (2008), 1--46.",
      "doi": ""
    },
    {
      "text": "Chu, W.-T., and Lin, C.-H. Automatic selection of representative photo and smart thumbnailing using near-duplicate detection. In MULTIMEDIA, ACM (2008), 829.  ",
      "doi": "10.1145/1459359.1459498"
    },
    {
      "text": "Fan, R.-E., Chang, K.-W., Hsieh, C.-J., Wang, X.-R., and Lin, C.-J. LIBLINEAR: A library for large linear classification. JMLR 9 (2008), 1871--1874. ",
      "doi": "10.5555/1390681.1442794"
    },
    {
      "text": "Frohlich, D., Kuchinsky, A., Pering, C., Don, A., and Ariss, S. Requirements for photoware. In Computer supported cooperative work, ACM (2002), 166--175.  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Hajimirza, S., and Izquierdo, E. Gaze movement inference for implicit image annotation. In Image Analysis for Multimedia Interactive Services, IEEE (2010).",
      "doi": ""
    },
    {
      "text": "Kirk, D., Sellen, A., Rother, C., and Wood, K. Understanding photowork. In CHI, ACM (2006), 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Klami, A., Saunders, C., De Campos, T., and Kaski, S. Can relevance of images be inferred from eye movements' In MIR, ACM (2008), 134--140.  ",
      "doi": "10.1145/1460096.1460120"
    },
    {
      "text": "Kozma, L., Klami, A., and Kaski, S. GaZIR: gaze-based zooming interface for image retrieval. In Multimodal interfaces, ACM (2009).  ",
      "doi": "10.1145/1647314.1647379"
    },
    {
      "text": "Li, J., Lim, J. H., and Tian, Q. Automatic summarization for personal digital photos. In Pacific Rim Conf. on Multimedia, IEEE (2003), 1536--1540.",
      "doi": ""
    },
    {
      "text": "Mollenbach, E., Stefansson, T., and Hansen, J. P. All eyes on the monitor: gaze based interaction in zoomable, multi-scaled information-spaces. In Intelligent user interfaces, ACM (2008), 373--376.  ",
      "doi": "10.1145/1378773.1378833"
    },
    {
      "text": "Naaman, M., Yeh, R. B., Garcia-Molina, H., and Paepcke, A. Leveraging context to resolve identity in photo albums. In JCDL, M. Marlino, T. Sumner, and F. M. S. III, Eds., ACM (2005), 178--187.  ",
      "doi": "10.1145/1065385.1065430"
    },
    {
      "text": "Neustaedter, C., and Fedorovskaya, E. Understanding and improving flow in digital photo ecosystems. In Proceedings of Graphics Interface 2009, Canadian Information Processing Society (2009), 191--198. ",
      "doi": "10.5555/1555880.1555922"
    },
    {
      "text": "Pasupa, K., Saunders, C., Szedmak, S., Klami, A., Kaski, S., and Gunn, S. Learning to rank images from eye movements. In Workshops on Human-Computer Interaction (2009).",
      "doi": ""
    },
    {
      "text": "Rabbath, M., Sandhaus, P., and Boll, S. Automatic creation of photo books from stories in social media. TOMCCAP 7, 1 (2011), 27.  ",
      "doi": "10.1145/2037676.2037684"
    },
    {
      "text": "Rodden, K., and Wood, K. How do people manage their digital photographs? In CHI, ACM (2003), 409--416.  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "San Agustin, J., Skovsgaard, H., Hansen, J., and Hansen, D. Low-cost gaze interaction: ready to deliver the promises. In Extended abstracts on Human factors in computing systems, ACM (2009), 4453--4458.  ",
      "doi": "10.1145/1520340.1520682"
    },
    {
      "text": "Sandhaus, P., and Boll, S. Social aspects of photobooks: Improving photobook authoring from large-scale multimedia analysis. In Social Media Modeling and Computing. Springer, 2011, 257--277.",
      "doi": ""
    },
    {
      "text": "Santella, A., Agrawala, M., DeCarlo, D., Salesin, D., and Cohen, M. Gaze-based interaction for semi-automatic photo cropping. In CHI, ACM (2006), 771--780.  ",
      "doi": "10.1145/1124772.1124886"
    },
    {
      "text": "Savakis, A. E., Etz, S. P., and Loui, A. C. Evaluation of image appeal in consumer photography. In Electronic Imaging, SPIE (2000), 111--120.",
      "doi": ""
    },
    {
      "text": "Sibert, L. E., and Jacob, R. J. Evaluation of eye gaze interaction. In CHI, ACM (2000), 281--288.  ",
      "doi": "10.1145/332040.332445"
    },
    {
      "text": "Sinha, P., Mehrotra, S., and Jain, R. Summarization of personal photologs using multidimensional content and context. Multimedia Retrieval (2011), 1--8.  ",
      "doi": "10.1145/1991996.1992000"
    },
    {
      "text": "Tan, T., Chen, J., and Mulhem, P. Smartalbum - towards unification of approaches for image retrieval. In ICPR (3) (2002), 983--986. ",
      "doi": "10.5555/839291.842948"
    },
    {
      "text": "Wenyin, L., Sun, Y., and Zhang, H. Mialbum - a system for home photo managemet using the semi-automatic image annotation approach. In MULTIMEDIA, ACM (2000), 479--480.  ",
      "doi": "10.1145/354384.379011"
    },
    {
      "text": "Xiao, J., Zhang, X., Cheatle, P., Gao, Y., and Atkins, C. B. Mixed-initiative photo collage authoring. In MULTIMEDIA, ACM (2008), 509--518.  ",
      "doi": "10.1145/1459359.1459427"
    },
    {
      "text": "Zhao, M., Teo, Y. W., Liu, S., Chua, T.-S., and Jain, R. Automatic person annotation of family photo album. In Image and Video Retrieval. Springer, 2006, 163--172.  ",
      "doi": "10.1007/11788034_17"
    }
  ]
}