{
  "doi": "10.1145/2556288.2557271",
  "title": "How carat affects user behavior: implications for mobile battery awareness applications",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1029-1038",
  "year": 2014,
  "badges": [],
  "abstract": "Mobile devices have limited battery life, and numerous battery management applications are available that aim to improve it. This paper examines a large-scale mobile battery awareness application, called Carat, to see how it changes user behavior with long-term use. We conducted a survey of current Carat Android users and analyzed their interaction logs. The results show that long-term Carat users save more battery, charge their devices less often, learn to manage their battery with less help from Carat, have a better understanding of how Carat works, and may enjoy competing against other users. Based on these findings, we propose a set of guidelines for mobile battery awareness applications: battery awareness applications should make the reasoning behind their recommendations understandable to the user, be tailored to retain long-term users, take the audience into account when formulating feedback, and distinguish third-party and system applications.",
  "authors": [
    {
      "name": "Kumaripaba Athukorala",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500651305",
      "orcid": "missing"
    },
    {
      "name": "Eemil Lagerspetz",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384592830",
      "orcid": "missing"
    },
    {
      "name": "Maria von Kügelgen",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959362357",
      "orcid": "missing"
    },
    {
      "name": "Antti Jylhä",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416607141",
      "orcid": "missing"
    },
    {
      "name": "Adam J. Oliner",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81492648918",
      "orcid": "missing"
    },
    {
      "name": "Sasu Tarkoma",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502696798",
      "orcid": "missing"
    },
    {
      "name": "Giulio Jacucci",
      "institution": "Aalto University, Southern Finland, & University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100644548/rel-imgonly/81100644548.png",
      "acmid": "81100644548",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrahamse, W., Steg, L., Vlek, C., and Rothengatter, T. The effect of tailored information, goal setting, and tailored feedback on household energy use, energy-related behaviors, and behavioral antecedents. J. Environmental Psych. 27, 4 (2007), 265--276.",
      "doi": ""
    },
    {
      "text": "Banerjee, N., Rahmati, A., Corner, M. D., Rollins, S., and Zhong, L. Users and batteries: Interactions and adaptive energy management in mobile systems. In Proc. UbiComp 2007. Springer, 2007, 217--234. ",
      "doi": "10.5555/1771592.1771605"
    },
    {
      "text": "Chetty, M., Tran, D., and Grinter, R. E. Getting to green: understanding resource consumption in the home. In Proc. UbiComp, ACM (2008), 242--251.  ",
      "doi": "10.1145/1409635.1409668"
    },
    {
      "text": "Creus, G., and Kuulusa, M. Optimizing mobile software with built-in power profiling. In Proc. Mobile Phone Programming, F. Fitzek and F. Reichert, Eds. Springer Netherlands, 2007, 449--462.",
      "doi": ""
    },
    {
      "text": "Darby, S. The effectiveness of feedback on energy consumption. A Review for DEFRA of the Literature on Metering, Billing and direct Displays 486 (2006), 1--21.",
      "doi": ""
    },
    {
      "text": "Datta, S. K., Bonnet, C., and Nikaein, N. Minimizing energy expenditure in smart devices. In Proc. ICT, IEEE (2013), 712--717.",
      "doi": ""
    },
    {
      "text": "Ferreira, D., Dey, A. K., and Kostakos, V. Understanding human-smartphone concerns: a study of battery life. In Proc. Pervasive Computing. Springer, 2011, 19--33. ",
      "doi": "10.5555/2021975.2021978"
    },
    {
      "text": "Ferreira, D., Ferreira, E., Goncalves, J., Kostakos, V., and Dey, A. K. Revisiting human-battery interaction with an interactive battery interface. In Proc. UbiComp, ACM (2013).  ",
      "doi": "10.1145/2493432.2493465"
    },
    {
      "text": "Froehlich, J., Findlater, L., and Landay, J. The design of eco-feedback technology. In Proc. CHI, ACM (2010), 1999--2008.  ",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Gamberini, L., Spagnolli, A., Corradi, N., Jacucci, G., Tusa, G., Mikkola, T., Zamboni, L., and Hoggan, E. Tailoring feedback to users actions in a persuasive game for household electricity conservation. In Persuasive Technology. Design for Health and Safety. Springer, 2012, 100--111.  ",
      "doi": "10.1007/978-3-642-31037-9_9"
    },
    {
      "text": "Henryson, J., Håkansson, T., and Pyrko, J. Energy efficiency in buildings through information - swedish perspective. J. Energy Policy 28, 3 (2000), 169--180.",
      "doi": ""
    },
    {
      "text": "Liu, X., Shenoy, P., and Corner, M. Chameleon: application level power management with performance isolation. In Proc. Intl. Conf. on Multimedia, ACM (2005), 839--848.  ",
      "doi": "10.1145/1101149.1101332"
    },
    {
      "text": "Midden, C. J., Meter, J. F., Weenig, M. H., and Zieverink, H. J. Using feedback, reinforcement and information to reduce energy consumption in households: A field-experiment. J. Econ. Psych. 3, 1 (1983), 65--86.",
      "doi": ""
    },
    {
      "text": "Oliner, A., Iyer, A., Lagerspetz, E., Tarkoma, S., and Stoica, I. Collaborative energy debugging for mobile devices. Proc. USENIX HotDep (2012). ",
      "doi": "10.5555/2387858.2387864"
    },
    {
      "text": "Oliner, A. J., Iyer, A. P., Stoica, I., Lagerspetz, E., and Tarkoma, S. Carat: Collaborative energy diagnosis for mobile devices. In Proc. SenSys (2013).  ",
      "doi": "10.1145/2517351.2517354"
    },
    {
      "text": "Pathak, A., Hu, Y. C., and Zhang, M. Where is the energy spent inside my app? fine grained energy accounting on smartphones with eprof. In Proc. European Conf. on Computer Systems, ACM (2012), 29--42.  ",
      "doi": "10.1145/2168836.2168841"
    },
    {
      "text": "Pierce, J., Fan, C., Lomas, D., Marcu, G., and Paulos, E. Some consideration on the (in) effectiveness of residential energy feedback systems. In Proc. DIS, ACM (2010), 244--247.  ",
      "doi": "10.1145/1858171.1858215"
    },
    {
      "text": "Pierce, J., and Paulos, E. Beyond energy monitors: interaction, energy, and emerging energy systems. In Proc. CHI, ACM (2012), 665--674.  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "Pierce, J., Schiano, D. J., and Paulos, E. Home, habits, and energy: examining domestic interactions and energy consumption. In Proc. CHI, ACM (2010), 1985--1994.  ",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "Rahmati, A., Qian, A., and Zhong, L. Understanding human-battery interaction on mobile phones. In Proc. MobileHCI, ACM (2007), 265--272.  ",
      "doi": "10.1145/1377999.1378017"
    },
    {
      "text": "Rahmati, A., Tossell, C., Shepard, C., Kortum, P., and Zhong, L. Exploring iphone usage: The influence of socioeconomic differences on smartphone adoption, usage and usability. In Proc. MobileHCI, ACM (2012), 11--20.  ",
      "doi": "10.1145/2371574.2371577"
    },
    {
      "text": "Rahmati, A., and Zhong, L. Human-battery interaction on mobile phones. J. Pervasive and Mobile Comp. 5, 5 (2009), 465--477.  ",
      "doi": "10.1016/j.pmcj.2008.08.003"
    },
    {
      "text": "Riche, Y., Dodge, J., and Metoyer, R. A. Studying always-on electricity feedback in the home. In Proc. CHI, ACM (2010), 1995--1998.  ",
      "doi": "10.1145/1753326.1753628"
    },
    {
      "text": "Rodgers, J., and Bartram, L. Exploring ambient and artistic visualization for residential energy use feedback. J. IEEE Trans. Visualization and Comp. Graphics 17, 12 (2011), 2489--2497.  ",
      "doi": "10.1109/TVCG.2011.196"
    },
    {
      "text": "Zhang, L., Tiwana, B., Qian, Z., Wang, Z., Dick, R. P., Mao, Z. M., and Yang, L. Accurate online power estimation and automatic battery behavior based power model generation for smartphones. In Proc. Int. Conf. on Hardware/Software Codesign and System Synthesis, ACM (2010), 105--114.  ",
      "doi": "10.1145/1878961.1878982"
    }
  ]
}