{
  "doi": "10.1145/2556288.2556998",
  "title": "Emergent, crowd-scale programming practice in the IDE",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2491-2500",
  "year": 2014,
  "badges": [],
  "abstract": "While emergent behaviors are uncodified across many domains such as programming and writing, interfaces need explicit rules to support users. We hypothesize that by codifying emergent programming behavior, software engineering interfaces can support a far broader set of developer needs. To explore this idea, we built Codex, a knowledge base that records common practice for the Ruby programming language by indexing over three million lines of popular code. Codex enables new data-driven interfaces for programming systems: statistical linting, identifying code that is unlikely to occur in practice and may constitute a bug; pattern annotation, automatically discovering common programming idioms and annotating them with metadata using expert crowdsourcing; and library generation, constructing a utility package that encapsulates and reflects emergent software practice. We evaluate these applications to find Codex captures a broad swatch of programming practice, statistical linting detects problematic code snippets, and pattern annotation discovers nontrivial idioms such as basic HTTP authentication and database migration templates. Our work suggests that operationalizing practice-driven knowledge in structured domains such as programming can enable a new class of user interfaces.",
  "authors": [
    {
      "name": "Ethan Fast",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466647178",
      "orcid": "missing"
    },
    {
      "name": "Daniel Steffee",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959059157",
      "orcid": "missing"
    },
    {
      "name": "Lucy Wang",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959395657",
      "orcid": "missing"
    },
    {
      "name": "Joel R. Brandt",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81351596282/rel-imgonly/joel-brandt-adobe.jpg",
      "acmid": "81351596282",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    }
  ],
  "references": [
    {
      "text": "Ahmadzadeh, M., Elliman, D., and Higgins, C. An analysis of patterns of debugging among novice computer science students. In Proc. ITiCSE 2005.  ",
      "doi": "10.1145/1067445.1067472"
    },
    {
      "text": "Ayewah, N., et al. Using static analysis to find bugs. In IEEE Software 2008.  ",
      "doi": "10.1109/MS.2008.130"
    },
    {
      "text": "Baxter, I.D., et al. Clone detection using abstract syntax trees. In Proc. ICSM 1998. ",
      "doi": "10.5555/850947.853341"
    },
    {
      "text": "Bernstein, M.S., et al. Direct answers for search queries in the long tail. In Proc. CHI 2012.  ",
      "doi": "10.1145/2207676.2207710"
    },
    {
      "text": "Brandt, J., Dontcheva, M., Weskamp, M., and Klemmer, S.R. Example-centric programming: integrating web search into the development environment. In Proc. CHI 2010.  ",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Brandt, J., et al. Opportunistic programming: Writing code to prototype, ideate, and discover. In IEEE Software 2009.  ",
      "doi": "10.1109/MS.2009.147"
    },
    {
      "text": "Brandt, J., et al. Two studies of opportunistic programming: interleaving web foraging, learning, and writing code. In Proc. CHI 2009.  ",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "Buse, R.P.L. and Weimer, W. Synthesizing api usage examples. In Proc. ICSE 2012. ",
      "doi": "10.5555/2337223.2337316"
    },
    {
      "text": "Ducasse, S., Rieger, M., and Demeyer, S. A language independent approach for detecting duplicated code. In Proc. ICSM 1999. ",
      "doi": "10.5555/519621.853389"
    },
    {
      "text": "Engler, D., et al. Bugs as deviant behavior: a general approach to inferring errors in systems code. In Proc. SOSP 2001.  ",
      "doi": "10.1145/502034.502041"
    },
    {
      "text": "Fourney, A., Mann, R., and Terry, M. Query-feature graphs: bridging user vocabulary and system functionality. In Proc. UIST 2011.  ",
      "doi": "10.1145/2047196.2047224"
    },
    {
      "text": "Gabel, M. and Su, Z. A study of the uniqueness of source code. In Proc. FSE 2010.  ",
      "doi": "10.1145/1882291.1882315"
    },
    {
      "text": "Gamma, E., Helm, R., Johnson, R., and Vlissides, J. Design Patterns: Elements of Reusable Object-Oriented Software. 1994. ",
      "doi": "10.5555/186897"
    },
    {
      "text": "Goldman, M., Little, G., and Miller, R.C. Collabode: collaborative coding in the browser. In Proc. CHASE 2011.  ",
      "doi": "10.1145/1984642.1984658"
    },
    {
      "text": "Goldman, M. and Miller, R.C. Codetrail: Connecting source code and web resources. In Proc. VL/HCC 2009J.  ",
      "doi": "10.1109/VLHCC.2008.4639060"
    },
    {
      "text": "Grechanik, M., et al. Exemplar: Executable examples archive. In Proc. ICSE 2010.  ",
      "doi": "10.1145/1810295.1810347"
    },
    {
      "text": "Greenberg, S. and Witten, I.H. How users repeat their actions on computers: Principles for design of history mechanisms. In Proc. CHI '88.  ",
      "doi": "10.1145/57167.57196"
    },
    {
      "text": "Hartmann, B., MacDougall, D., Brandt, J., and Klemmer, S.R. What would other programmers do: suggesting solutions to error messages. In Proc. of CHI 2010.  ",
      "doi": "10.1145/1753326.1753478"
    },
    {
      "text": "Hartmann, B., Wu, L., Collins, K., and Klemmer, S.R. Programming by a sample: rapidly creating web applications with d.mix. In Proc. UIST 2007.  ",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Hindle, A., et al. On the naturalness of software. In Proc. ICSE 2012. ",
      "doi": "10.5555/2337223.2337322"
    },
    {
      "text": "Holmes, R., Walker, R.J., and Murphy, G.C. Strathcona example recommendation tool. In Proc. FSE 2005.  ",
      "doi": "10.1145/1081706.1081744"
    },
    {
      "text": "Hummel, O., Janjic, W., and Atkinson, C. Code conjurer: Pulling reusable software out of thin air. IEEE Software 2008.  ",
      "doi": "10.1109/MS.2008.110"
    },
    {
      "text": "Kim, M., Bergman, L., Lau, T., and Notkin, D. An ethnographic study of copy and paste programming practices in oopl. In Proc. ISESE 2004.  ",
      "doi": "10.5555/1018434.1021568"
    },
    {
      "text": "Ko, A.J. and Myers, B.A. Designing the whyline: a debugging interface for asking questions about program behavior. In Proc. the CHI 2004.  ",
      "doi": "10.1145/985692.985712"
    },
    {
      "text": "Kumar, R., et al. Webzeitgeist: Design Mining the Web. In Proc. CHI 2013.  ",
      "doi": "10.1145/2470654.2466420"
    },
    {
      "text": "Mandelin, D., Xu, L., Bodík, R., and Kimelman, D. Jungloid mining: helping to navigate the api jungle. In Proc. PLDI 2005.  ",
      "doi": "10.1145/1065010.1065018"
    },
    {
      "text": "Matejka, J., Li, W., Grossman, T., and Fitzmaurice, G. CommunityCommands. In Proc. UIST 2009.",
      "doi": ""
    },
    {
      "text": "Mooty, M., Faulring, A., Stylos, J., and Myers, B.A. Calcite: Completing code completion for constructors using crowds. In Proc. VL/HCC 2010.  ",
      "doi": "10.1109/VLHCC.2010.12"
    },
    {
      "text": "Sahavechaphan, N. and Claypool, K. Xsnippet: mining for sample code. In Proc. OOPSLA 2006.  ",
      "doi": "10.1145/1167473.1167508"
    },
    {
      "text": "Seacord, R.C., Plakosh, D., and Lewis, G.A. Modernizing Legacy Systems: Software Technologies, Engineering Process and Business Practices. 2003. ",
      "doi": "10.5555/599767"
    },
    {
      "text": "Simon, I., Morris, D., and Basu, S. MySong: automatic accompaniment generation for vocal melodies. In Proc. CHI 2008.  ",
      "doi": "10.1145/1357054.1357169"
    },
    {
      "text": "Stylos, J. and Myers, B.A. Mica: A web-search tool for finding api components and examples. In Proc. VL/HCC 2006.  ",
      "doi": "10.1109/VLHCC.2006.32"
    },
    {
      "text": "Thummalapenta, S. and Xie, T. Parseweb: a programmer assistant for reusing open source code on the web. In Proc. ASE 2007.  ",
      "doi": "10.1145/1321631.1321663"
    },
    {
      "text": "Urma, R.G. and Mycroft, A. Programming language evolution via source code query languages. In Proc. PLATEAU 2012.  ",
      "doi": "10.1145/2414721.2414728"
    },
    {
      "text": "Ye, Y. and Fischer, G. Supporting reuse by delivering task-relevant and personalized information. In Proc. ICSE 2002.  ",
      "doi": "10.1145/581339.581402"
    }
  ]
}