{
  "doi": "10.1145/2556288.2557347",
  "title": "Effects of security warnings and instant gratification cues on attitudes toward mobile websites",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "111-114",
  "year": 2014,
  "badges": [],
  "abstract": "In order to address the increased privacy and security concerns raised by mobile communications, designers of mobile applications and websites have come up with a variety of warnings and appeals. While some interstitials warn about potential risk to personal information due to an untrusted security certificate, others attempt to take users' minds away from privacy concerns by making tempting, time-sensitive offers. How effective are they? We conducted an online experiment (N = 220) to find out. Our data show that both these strategies raise red flags for users - appeals to instant gratification make users more leery of the site and warnings make them perceive greater threat to personal data. Yet, users tend to reveal more information about their social media accounts when warned about an insecure site. This is probably because users process these interstitials based on cognitive heuristics triggered by them. These findings hold important implications for the design of cues in mobile interfaces.",
  "authors": [
    {
      "name": "Bo Zhang",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557387056",
      "orcid": "missing"
    },
    {
      "name": "Mu Wu",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548023974",
      "orcid": "missing"
    },
    {
      "name": "Hyunjin Kang",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556673956",
      "orcid": "missing"
    },
    {
      "name": "Eun Go",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558249956",
      "orcid": "missing"
    },
    {
      "name": "S. Shyam Sundar",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    }
  ],
  "references": [
    {
      "text": "Bellur, S. and Sundar, S. S. How can we tell when a heuristic has been used? Annual Conference of International Comm. Association (ICA), (2010).",
      "doi": ""
    },
    {
      "text": "Boyles, J. L., Smith, A., and Madden, M. Privacy and data management on mobile devices. Pew Internet & American Life Project, (2012).",
      "doi": ""
    },
    {
      "text": "Culnan, M. J. and Bies, J. R., Consumer privacy: Balancing economic and justice considerations, Journal of Social Issues 59, 2 (2003), 323--342.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J., Lee, E., and Marshall, J. Interactive technology and persuasion. In J. P. Dillard and M. Pfau, eds., The persuasion handbook: Developments in theory and practice. Sage Publications, Thousand Oaks, CA, USA, 2002, 765--788.",
      "doi": ""
    },
    {
      "text": "Iachello, G., Smith, I., Consolvo, S., et al. Control, deception, and communication: Evaluating the deployment of a location-enhanced messaging service. In Proc. UbiComp 2005, Springer Heidelberg (2005), 213--231.  ",
      "doi": "10.1007/11551201_13"
    },
    {
      "text": "Kalyanaraman, S. and Sundar, S. S. The psychological appeal of personalized content in web portals: Does customization affect attitudes and behavior? Journal of Communication 56, 1 (2006), 110--132.",
      "doi": ""
    },
    {
      "text": "Marathe, S. S., Sundar, S. S., Bijvank, M. N., van Vugt, H., and Veldhuis, J. Who are these power users anyway? Building a psychological profile. Annual Conference of International Comm. Association (ICA), (2007).",
      "doi": ""
    },
    {
      "text": "Meade, T. L. I want it now: Do new media affect ability to delay gratification? Doctoral dissertation, The University of Alabama, Tuscaloosa, (2012).",
      "doi": ""
    },
    {
      "text": "Metzger, M. J. Effects of site, vendor, and consumer characteristics on Web site trust and disclosure. Communication Research 33, 3 (2006), 155--179.",
      "doi": ""
    },
    {
      "text": "Norberg, P. A., Horne, D. R. and Horne, D. A. The privacy paradox: Personal information disclosure intentions versus behaviors. The Journal of Consumer Affairs 41, 1 (2007), 100--127.",
      "doi": ""
    },
    {
      "text": "Ruggiero, T. E. Uses and gratifications theory in the 21st century. Mass Communication & Society 3, 1 (2000), 3--37.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S. The MAIN model: A heuristic approach to understanding technology effects on credibility. In M. J. Metzger, ed., Digital media, youth, and credibility. The MIT Press, Cambridge, MA, USA, 2008, 72--100.",
      "doi": ""
    },
    {
      "text": "Sundar, S. S., Kang, H., Wu, M., Go, E., and Zhang, B. Unlocking the privacy paradox: Do cognitive heuristics hold the key? In Proc. CHI 2013, ACM Press (2013), 811--816.  ",
      "doi": "10.1145/2468356.2468501"
    },
    {
      "text": "Xu, H., Luo, X., Carroll, J. M., and Rosson, M. B. The personalization privacy paradox: An exploratory study of decision making process for location-aware marketing. Decision Support Systems 51, 1(2010), 4252.  ",
      "doi": "10.1016/j.dss.2010.11.017"
    },
    {
      "text": "Zarmpou, T., Saprikis, V., Markos, A., and Vlachopoulou, M. Modeling users' acceptance of mobile services. Electronic Commerce Research 12, 2 (2012), 225--248.  ",
      "doi": "10.1007/s10660-012-9092-x"
    }
  ]
}