{
  "doi": "10.1145/2556288.2557220",
  "title": "Toss 'n' turn: smartphone as sleep and sleep quality detector",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "477-486",
  "year": 2014,
  "badges": [],
  "abstract": "The rapid adoption of smartphones along with a growing habit for using these devices as alarm clocks presents an opportunity to use this device as a sleep detector. This adds value to UbiComp and personal informatics in terms of user context and new performance data to collect and visualize, and it benefits healthcare as sleep is correlated with many health issues. To assess this opportunity, we collected one month of phone sensor and sleep diary entries from 27 people who have a variety of sleep contexts. We used this data to construct models that detect sleep and wake states, daily sleep quality, and global sleep quality. Our system classifies sleep state with 93.06% accuracy, daily sleep quality with 83.97% accuracy, and overall sleep quality with 81.48% accuracy. Individual models performed better than generally trained models, where the individual models require 3 days of ground truth data and 3 weeks of ground truth data to perform well on detecting sleep and sleep quality, respectively. Finally, the features of noise and movement were useful to infer sleep quality.",
  "tags": [
    "smartphone",
    "sensors",
    "sleep",
    "machine learning"
  ],
  "authors": [
    {
      "name": "Jun-Ki Min",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236294",
      "orcid": "missing"
    },
    {
      "name": "Afsaneh Doryab",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81442619192/rel-imgonly/photoon2-23-12at10.39am.jpg",
      "acmid": "81442619192",
      "orcid": "missing"
    },
    {
      "name": "Jason Wiese",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81467645911/rel-imgonly/jason-190.jpg",
      "acmid": "81467645911",
      "orcid": "0000-0002-8766-3557"
    },
    {
      "name": "Shahriyar Amini",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81477642257",
      "orcid": "missing"
    },
    {
      "name": "John Zimmerman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81406592256/rel-imgonly/headshot2010.jpg",
      "acmid": "81406592256",
      "orcid": "missing"
    },
    {
      "name": "Jason I. Hong",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81408598366/rel-imgonly/81408598366.png",
      "acmid": "81408598366",
      "orcid": "0000-0002-9856-9654"
    }
  ],
  "references": [
    {
      "text": "Aliakseyeu, D., Du, J., Zwartkruis-Pelgrim, E., & Subramanian, S. Exploring interaction strategies in the context of sleep. In Proc. INTERACT '11, (2011) 19--36. ",
      "doi": "10.5555/2042182.2042185"
    },
    {
      "text": "Altena, E., van der Werf, Y., Strijers, R. L. M., & van Someren, E. J. W., Sleep loss affects vigilance: Effects of chronic insomnia and sleep therapy. Journal of Sleep Research 17 (3), (2008) 335--343.",
      "doi": ""
    },
    {
      "text": "Alvarez, G. G. & Ayas, N. T. The impact of daily sleep duration on health: A review of the literature, Progress in Cardiovascular Nursing 19(2), (2004) 56--59.",
      "doi": ""
    },
    {
      "text": "Ancoli-Israel, S. et al. The role of actigraphy in the study of sleep and circadian rhythms. Sleep 26(3), (2003) 342--392.",
      "doi": ""
    },
    {
      "text": "Ayas, N. T. et al. A Prospective Study of Sleep Duration and Coronary Heart Disease in Women. Arch. Intern. Med., 163(11), (2003) 205--209.",
      "doi": ""
    },
    {
      "text": "Bai, Y., Xu, B., Ma, Y., Sun, G., & Zhao, Y. Will you have a good sleep tonight?: Sleep quality prediction with mobile phone. In Proc. Int. Conf. BodyNets '12, (2012) 124--130. ",
      "doi": "10.5555/2442691.2442720"
    },
    {
      "text": "Bauer, J. S. et al. ShutEye: Encouraging awareness of healthy sleep recommendations with a mobile, peripheral display. In Proc. CHI '12, (2012) 1401--1410.  ",
      "doi": "10.1145/2207676.2208600"
    },
    {
      "text": "Bootzin, R. R. & Engle-Friedman M. The assessment of insomnia. Behavioral Assessment 3, (1981) 107--126.",
      "doi": ""
    },
    {
      "text": "Borazio, M. & Van Laerhoven, K. Predicting sleeping behaviors in long-term studies with wrist-worn sensor data. Ambient Intelligence, LNCS 7040, (2011) 151--156.  ",
      "doi": "10.1007/978-3-642-25167-2_18"
    },
    {
      "text": "Buysse, D. J., Reynolds, C. F., Monk, T. H., Berman, S. R., & Kupfer, D. J. The Pittsburgh Sleep Quality Index: A new instrument for psychiatric practice and research. Psychiatry Res. 28(2), (1989) 193--213.",
      "doi": ""
    },
    {
      "text": "Buysse, D. J. et al. Quantification of subjective sleep quality in healthy elderly men and women using the PSQI, Sleep 14(4), (1991) 331--338.",
      "doi": ""
    },
    {
      "text": "Carskadon, M. A. et al. Self-reports versus sleep laboratory findings in 122 drug-free subjects with complaints of chronic insomnia. Am J Psychiatry 133(12), (1976) 1382--1388.",
      "doi": ""
    },
    {
      "text": "Chandola, T., Ferrie, J. E., Perski, A., Akbaraly, T., & Marmot, M. G. The effect of short sleep duration on coronary heart disease risk is greatest among those with sleep disturbance. Sleep 33 (6) (2010) 739--744.",
      "doi": ""
    },
    {
      "text": "Chen, Z. et al. Unobtrusive sleep monitoring using smartphones, Proc. Int. Conf. PervasiveHealth '13, (2013) 145--152.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252148"
    },
    {
      "text": "Choe, E. K., Consolvo, S., Watson, N. F., & Kientz, J. A. Opportunities for Computing Technologies to Support Healthy Sleep Behaviors. Proc. CHI '11, (2011) 3053--3062.  ",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "De, S. Subjective assessment of quality of sleep in chronic obstructive pulmonary disease patient and its relationship with associated depression. Lung India. 29(4) (2012) 332--335.",
      "doi": ""
    },
    {
      "text": "Drake, C. L., Roehrs, T., & Roth, T. Insomnia causes, consequences, and therapeutics: An overview. Depress Anxiety 18, (2003) 163--176.",
      "doi": ""
    },
    {
      "text": "Espie, C. A. et al. Use of the sleep assessment device to validate insomniacs' self-report of sleep pattern. J. Psychopathology and Behavioral Assessment 11, (1989) 71--79.",
      "doi": ""
    },
    {
      "text": "FitBit, http://www.fitbit.com",
      "doi": ""
    },
    {
      "text": "Fogg, B. J. Persuasive Technology: Using Computers to Change What We Think and Do. Science & Technology Books (2002). ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Gottlieb, D. J. et al. Association of sleep time with diabetes mellitus and impaired glucose tolerance. Arch. Intern. Med. 165(8), (2005) 863--867.",
      "doi": ""
    },
    {
      "text": "Hall, M. A. Correlation-based Feature Subset Selection for Machine Learning. Hamilton, New Zealand (1998).",
      "doi": ""
    },
    {
      "text": "Jawbone, https://jawbone.com",
      "doi": ""
    },
    {
      "text": "Johns, M. W. A new method for measuring daytime sleepiness: The Epworth sleepiness scale. Sleep 14(6), (1991) 540--545.",
      "doi": ""
    },
    {
      "text": "Kay, M. et al. Lullaby: A capture & access system for understanding the sleep environment. In Proc. UbiComp '12, (2012) 226--234.  ",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Krejcar, O., Jirka, J., & Janckulik, D. Use of mobile phones as intelligent sensors for sound input analysis and sleep state detection. J. Sensors 11(6), (2011) 6037--6055.",
      "doi": ""
    },
    {
      "text": "Lawson, S. et al. Validating a mobile phone application for the everyday, unobtrusive, objective measurement of sleep. In Proc. CHI '13, (2013) 2497--2506.  ",
      "doi": "10.1145/2470654.2481345"
    },
    {
      "text": "Li, I., Dey, A., Forlizzi, J., Höök, K. & Medynskiy, Y. Personal informatics and HCI: Design, theory, and social implications. In. Ext. Abstracts CHI '11, (2011) 2417--2420.  ",
      "doi": "10.1145/1979742.1979573"
    },
    {
      "text": "Livingston, G., Blizard, B. & Mann, A. Does sleep disturbance predict depression in elderly people? A Study in inner London. The British Journal of General Practice 43(376), (1993) 445--448.",
      "doi": ""
    },
    {
      "text": "Maquet, P. The role of sleep in learning and memory. Science 294(5544), (2001) 1048--1051.",
      "doi": ""
    },
    {
      "text": "Mattila, E. Mobile diary for wellness management-Results on usage and usability in two user studies. IEEE Trans. Inf. Technol. Biomed. 12(4), (2008) 501--512.  ",
      "doi": "10.1109/TITB.2007.908237"
    },
    {
      "text": "Monk, T. H., Buysse, D. J., Rose, L. R., Hall, J. A., & Kupfer, D. J. The sleep of healthy people - A diary study. Chronobiol Int. 17, (2000) 49--60.",
      "doi": ""
    },
    {
      "text": "Monk, T. H. et al. Measuring sleep habits without using a diary: the sleep timing questionnaire, Sleep 26(2), (2003) 208--212.",
      "doi": ""
    },
    {
      "text": "Moturu, S. T., Khayal, I., Aharony, N., Pan, W., & Pentland, A. Using social sensing to understand the links between sleep, mood, and sociability. In Proc. IEEE Int. Conf. SocialCom '11, (2011) 9--11.",
      "doi": ""
    },
    {
      "text": "Muze, A., Environmental noise, sleep and health. Sleep Medicine Reviews 11(2), (2007) 135--142.",
      "doi": ""
    },
    {
      "text": "Pew Internet and American Life Project. http://pewinternet.org",
      "doi": ""
    },
    {
      "text": "Rogers, A. E., Caruso, C. C., & Aldrich, M. S. Reliability of sleep diaries for assessment of sleep/wake patterns. Nurs. Res. 42(6), (1993) 368--372.",
      "doi": ""
    },
    {
      "text": "Shirazi, A. S. et al. Already up? Using mobile phones to track & share sleep behavior. Int. J. Human-Computer Studies 71(9), (2013) 878--888.  ",
      "doi": "10.1016/j.ijhcs.2013.03.001"
    },
    {
      "text": "Sleep as Android. https://sites.google.com/site/ sleepasandroid/",
      "doi": ""
    },
    {
      "text": "Sleep Journal App. http://sleeptrackerapp.blogspot.com",
      "doi": ""
    },
    {
      "text": "SleepBot. http://mysleepbot.com",
      "doi": ""
    },
    {
      "text": "SleepCycle. http://www.sleepcycle.com",
      "doi": ""
    },
    {
      "text": "Tylenol PM Sleep Tracker. http://www.tylenol.com/pain-sleeplessness/sleeptracker",
      "doi": ""
    },
    {
      "text": "Vgontzas, A. N. et al. Insomnia with objective short sleep duration is associated with type 2 diabetes: a population-based study. Diabetes Care 32(11), (2009) 1980--1985.",
      "doi": ""
    },
    {
      "text": "Wagner, U., Gais, S., Haider, H., Verleger, R., & Born, J. Sleep inspires insight. Nature 427(6972), (2004) 352--355.",
      "doi": ""
    },
    {
      "text": "WakeMate. http://www.wakemate.com",
      "doi": ""
    },
    {
      "text": "Wilson, K. G. et al. Daily diary and ambulatory activity monitoring of sleep in patients with insomnia associated with chronic musculoskeletal pain. Pain 75, (1998) 75--84.",
      "doi": ""
    },
    {
      "text": "YawnLog. http://beta.yawnlog.com",
      "doi": ""
    }
  ]
}