{
  "doi": "10.1145/2556288.2557111",
  "title": "The turn to practice in HCI: towards a research agenda",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3543-3552",
  "year": 2014,
  "badges": [],
  "abstract": "This paper argues that a new paradigm for HCI research, which we label the 'practice' perspective, has been emerging in recent years. This stands in contrast to the prevailing mainstream HCI paradigm, which we term the 'interaction' perspective. The 'practice turn', as it has been dubbed in the social sciences, provides a conceptual frame to organize a variety of issues emerging in more recent HCI research. While this approach has been present in certain strands of HCI research for some time, it has not been articulated fully to date. In this paper, we provide a short account of the main tenets of this perspective, and then show how it can illuminate some of the recent debates within HCI. Our argument is one which does not seek to replace extant HCI theories, but rather to provide an alternative, complementary theoretical lens which may illuminate the present confusion among both researchers and practitioners as to the direction of HCI. The paper articulates a set of issues which can help direct HCI research programs, as well as highlighting the potential contribution of the HCI field to this practice approach itself, in terms of a more nuanced understanding of emerging practices.",
  "authors": [
    {
      "name": "Kari Kuutti",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100368227",
      "orcid": "missing"
    },
    {
      "name": "Liam J. Bannon",
      "institution": "University of Limerick & Trento RISE, Limerick, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100465973",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bannon, L. J. Reimagining HCI: Toward a More Humancentered Perspective. interactions 18 (4) (July): 50--57. (2011).  ",
      "doi": "10.1145/1978822.1978833"
    },
    {
      "text": "Bannon, L., & S. Bødker, S. Beyond the interface: Encountering artifacts. In J. Carroll (Ed.), Designing Interaction: Psychology at the Human Computer Interface (pp. 227--253). New York: Cambridge University Press (1991). ",
      "doi": "10.5555/120352.120364"
    },
    {
      "text": "Bentley, R., J. A. Hughes, D. Randall, T. Rodden, P. Sawyer, D. Shapiro, & Sommerville, I. \"Ethnographically-Informed Systems Design for Air Traffic Control.\" In Proc. of ACM CSCW'92, pp. 123--129. (1992)  ",
      "doi": "10.1145/143457.143470"
    },
    {
      "text": "Beyer, H. and Holtzblatt, K. Contextual design: Defining customer-centered systems. Morgan Kaufmann, San Francisco. (1997) ",
      "doi": "10.5555/523184"
    },
    {
      "text": "Bjerknes, G., Ehn, P. & Kyng, M. ed. Computers and Democracy - a Scandinavian Challenge. Gower Publishing Ltd., Avebury, (1987).",
      "doi": ""
    },
    {
      "text": "Bødker, S. A human activity approach to user interfaces. Human Computer Interaction 4: 171--195. (1989)  ",
      "doi": "10.1207/s15327051hci0403_1"
    },
    {
      "text": "Bødker, S. \"When Second Wave HCI Meets Third Wave Challenges.\" In Proc. of the 4th NordiCHI Conference, 1--8. (2006).  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Bødker, S. & Andersen, P. B. \"Complex Mediation.\" Human-Computer Interaction 20 (4): 353--402. (2005).  ",
      "doi": "10.1207/s15327051hci2004_1"
    },
    {
      "text": "Carroll, J. M. (Ed.). Designing interaction: Psychology at the human-computer interface (Vol. 4). Cambridge Univ. Press, New York (1991). ",
      "doi": "10.5555/532784"
    },
    {
      "text": "Dourish, P. Where the action is: the foundations of embodied interaction. The MIT Press, Cambridge, Mass. (2004).",
      "doi": ""
    },
    {
      "text": "Ehn, P. Work-Oriented Design of Computer Artifacts. Arbetslivscentrum, Stockholm. (1988).",
      "doi": ""
    },
    {
      "text": "Forlizzi, J. The product ecology: Understanding social product use and supporting design culture. International Journal of Design, 2(1), 11--20. (2007).",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T., & Pacenti, E. Design: cultural probes. interactions, 6(1), 21--29. (1999).  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Gross, S., Bardzell, J., & Bardzell, S. Structures, forms, and stuff: the materiality and medium of interaction. Personal and Ubiquitous Computing, 1--13. (2013).  ",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Jung, H., Stolterman, E., Ryan, W., Thompson, T., & Siegel, M. Toward a framework for ecologies of artifacts: how are digital artifacts interconnected within a personal life?. In Proc. of the 5th NordiCHI Conference (pp. 201--210). ACM. (2008).  ",
      "doi": "10.1145/1463160.1463182"
    },
    {
      "text": "Kaptelinin, V. & Bannon, L. J. Interaction Design Beyond the Product: Creating Technology-Enhanced Activity Spaces. Human-Computer Interaction, vol 27, no. 3, pp. 277--309, (2012)",
      "doi": ""
    },
    {
      "text": "Kaptelinin, V., & Nardi, B. Activity theory in HCI: Fundamentals and Reflections. Synthesis Lectures Human-Centered Informatics, 5(1), 1--105. (2012). ",
      "doi": "10.5555/2361921"
    },
    {
      "text": "Kuhn, T.S. The Structure of Scientific Revolutions. Chicago: University of Chicago Press, (1962).",
      "doi": ""
    },
    {
      "text": "Kuutti, K., Activity Theory as a potential framework for human-computer interaction research, in B. Nardi (Ed.) Context and Consciousness: Activity Theory and Human Computer Interaction, MIT Press: Cambridge. p. 17--44. (1996). ",
      "doi": "10.5555/223826.223828"
    },
    {
      "text": "Kuutti, K. \"The Concept of Activity as a Basic Unit of Analysis for CSCW Research.\" In Proc. of the 2nd ECSCW Conference, pp. 249--264. (1991). ",
      "doi": "10.5555/1241910.1241929"
    },
    {
      "text": "Landauer, T.K. \"Let's Get Real: A Position Paper on the Role of Cognitive Psychology in the Design of Humanly Useful and Usable Systems.\" In J. M. Carroll (Ed.) Designing Interaction, 60--73. Cambridge University Press, New York. (1991). ",
      "doi": "10.5555/120352.120357"
    },
    {
      "text": "Light, A., & Wright, P. The panopticon and the performance arena: HCI reaches within. In HumanComputer Interaction-INTERACT 2009 (pp. 201--204). Springer Berlin Heidelberg. (2009).  ",
      "doi": "10.1007/978-3-642-03658-3_26"
    },
    {
      "text": "Lyytinen, K.J., and O.K. Ngwenyama. \"What Does Computer Support for Cooperative Work Mean\" A Structurational Analysis of Computer Supported Cooperative Work.? Accounting, Management and Information Technologie 2 (1): 19--37. (1992).",
      "doi": ""
    },
    {
      "text": "Macy, M.W. & Flache, A. Beyond Rationality in Models of Choice. Ann. Rev. Sociol., vol 21, pp. 73--91. (1995).",
      "doi": ""
    },
    {
      "text": "March, J. G. How Decisions Happen in Organizations. Human-Computer Interaction, Vol. 6, pp. 95--117. (1991)  ",
      "doi": "10.1207/s15327051hci0602_1"
    },
    {
      "text": "Miettinen, R., Samra-Fredericks, D. & Yanow, D. \"Re-Turn to Practice: An Introductory Essay.\" Organization Studies 30 (12): 1309--1327. 2009.",
      "doi": ""
    },
    {
      "text": "Nicolini, D. Practice Theory, Work, & Organization. An Introduction. Oxford University Press, Oxford, UK. (2013).",
      "doi": ""
    },
    {
      "text": "Orlikowski, W.J. \"The Duality of Technology: Rethinking the Concept of Technology in Organizations.\" Organization Science 3 (3): 398--427. (1992).",
      "doi": "10.1287/orsc.3.3.398"
    },
    {
      "text": "Orlikowski, W.J., and S.V. Scott. \"Sociomateriality: Challenging the Separation of Technology, Work and Organization.\" Annals of the Academy of Management 2 (1): 433--474. (2008).",
      "doi": ""
    },
    {
      "text": "Pierce, J., Strengers, Y., Sengers, P., and Bødker, S. Introduction to the special issue on practice-oriented approaches to sustainable HCI. ACM Trans. ComputerHuman Interaction 20, 4, Article 20 (September 2013), 8 pages. (2013).  ",
      "doi": "10.1145/2494260"
    },
    {
      "text": "Reckwitz, A. \"Toward a Theory of Social Practices: A Development in Culturalist Theorizing.\" European Journal of Social Theory 5 (2): 243--263. (2002).",
      "doi": ""
    },
    {
      "text": "Rogers, Y. HCI Theory. Morgan & Claypool Publishers, San Rafael, Ca. (2012).",
      "doi": ""
    },
    {
      "text": "Salovaara, A., Höök, K., Cheverst, K., Twidale, M., Chalmers, M., & Sas, C. Appropriation and creative use: linking user studies and design. In Proc. of CHI 2011 Extended Abstracts (pp. 37--40). ACM. (2011).  ",
      "doi": "10.1145/1979742.1979585"
    },
    {
      "text": "Schatzki, T. R., Knorr-Cetina, K. & Savigny, E. Von. The Practice Turn in Contemporary Theory. Routledge, London. (2001).",
      "doi": ""
    },
    {
      "text": "Schmidt, K. The concept of 'practice': What's the point? To be published in the Proc. of 11th International Conference on the Design of Cooperative Systems (COOP 2014). (forthcoming 2014)",
      "doi": ""
    },
    {
      "text": "Schmidt, K. Cooperative Work and Coordinative Practices. Contributions to the Conceptual Foundations of Computer-Supported Cooperative Work (CSCW). Springer, London. (2011) ",
      "doi": "10.5555/1964887"
    },
    {
      "text": "Schmidt, K. & Simone, C. \"Coordination Mechanisms: Towards a Conceptual Foundation of CSCW Systems Design.\" Computer Supported Cooperative Work 5 (2/3): 155--200. (1996).  ",
      "doi": "10.1007/BF00133655"
    },
    {
      "text": "Thomas, J. C., & Kellogg, W. A. Minimizing ecological gaps in interface design. Software, IEEE, 6 (1), 78--86. (1989).  ",
      "doi": "10.1109/52.16905"
    },
    {
      "text": "Stevens, G., Pipek, V., & Wulf, V. Appropriation infrastructure: mediating appropriation and production work. Journal of Organizational and End User Computing (JOEUC), 22(2), 58--81. (2010).  ",
      "doi": "10.4018/joeuc.2010040104"
    },
    {
      "text": "Vines, B. W., Wanderley, M. M., Krumhansl, C. L., Nuzzo, R. L., & Levitin, D. J. Performance gestures of musicians: What structural and emotional information do they convey?. In Gesture-based communication in human-computer interaction (pp. 468--478). Springer Berlin Heidelberg. (2004).",
      "doi": ""
    },
    {
      "text": "Wiberg, M., Ishii, H., Dourish, P., Vallgårda, A., Kerridge, T., Sundström, P., & Rolston, M. Materiality matters -- experience materials. interactions, 20(2), 5457. (2013).  ",
      "doi": "10.1145/2427076.2427087"
    },
    {
      "text": "Wulf, V., M. Rohde, V. Pipek, and G. Stevens. \"Engaging with Practices: Design Case Studies as a Research Framework in CSCW.\" In Proceedigns of CSCW 2011, ACM, pp. 505--512. (2011).  ",
      "doi": "10.1145/1958824.1958902"
    }
  ]
}