{
  "doi": "10.1145/2556288.2557266",
  "title": "Studying digital graffiti as a location-based social network",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3269-3278",
  "year": 2014,
  "badges": [],
  "abstract": "Increasing amounts of geo-tagged social media have led to interest in how that media can be re-integrated into the physical environment. Yet, although location information is often automatically appended to media, little is know about how users consider location in its creation and viewing. Using Graffiti as a design meme, we developed a novel social media service to investigate these issues. A two week field study showed how users incorporated both utilitarian and playful aspects of location into their social media creation, as well as revealing a disconnect between the location-media relationship intended by creators and perceived by viewers. We outline implications of our work for services that seek to repurpose existing geo-tagged social media in the design of novel services.",
  "tags": [
    "geo-social media",
    "pico projection",
    "digigraff",
    "graffiti"
  ],
  "authors": [
    {
      "name": "David K. McGookin",
      "institution": "Heriot-Watt University, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100295790",
      "orcid": "missing"
    },
    {
      "name": "Stephen A. Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Georgi Christov",
      "institution": "Proxiad Bulgaria, Sofia, Bulgaria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812161",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1. Chaniotis, A. Graffiti in Aphrodisias: Images-Text-Contexts. In Ancient Graffiti in Context, J. Baird and C. Taylor, Eds., 1 ed. Routledge, New York, 2011, ch. 10, 191--207.",
      "doi": ""
    },
    {
      "text": "2. Cowan, L. G., Weibel, N., Griswold, W. G., Pina, L. R., and Hollan, J. D. Projector phone use: practices and social implications. Personal and Ubiquitous Computing 16, 1 (2012), 53--63.  ",
      "doi": "10.1007/s00779-011-0377-1"
    },
    {
      "text": "3. Cramer, H., Rost, M., and Holmquist, L. E. Performing a check-in: emerging practices, norms and 'conflicts' in location-sharing using foursquare. In Proc. MobileHCI 2011, ACM (Stockholm, Sweden, 2011), 57--66.  ",
      "doi": "10.1145/2037373.2037384"
    },
    {
      "text": "4. Dalsgaard, P., and Halskov, K. 3D Projection on Physical Objects: Design Insights from Five Real Life Cases. In Proc. CHI 2011, ACM Press (Vancouver, Canada, 2011), 1041--1050.  ",
      "doi": "10.1145/1978942.1979097"
    },
    {
      "text": "5. Espinoza, F., Persson, P., Sandin, A., Nyström, H., Cacciatore, E., and Bylund, M. GeoNotes: Social and Navigational Aspects of Location-Based Information Systems. In Proc. Ubicomp 2001, Springer-Verlag (Berlin, 2001), 2--17. ",
      "doi": "10.5555/647987.741330"
    },
    {
      "text": "6. Fischer, P. T., Hornecker, E., and Zoellner, C. SMSlingshot: An Expert Amateur DIY Case Study. In Proc. TEI 2013, ACM (Barcelona, Spain, 2013), 9--16.  ",
      "doi": "10.1145/2460625.2460627"
    },
    {
      "text": "7. Harrison, C., Benko, H., and Wilson, A. D. OmniTouch: wearable multitouch interaction everywhere. In Proc. UIST 2011, ACM (Santa Barbara, CA, USA, 2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "8. Harrison, S., and Dourish, P. Re-place-ing space: the roles of place and space in collaborative systems. In Proc. of CSCW 96, ACM (1996), 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "9. Lee, R., and Sumiya, K. Measuring Geographical Regularities of Crowd Behaviors for Twitter-Based Geo-Social Event Detection. In Proc. Workshop on Advances in Geographic Information Systems, ACM (New York, NY, USA, 2010), 1--10.  ",
      "doi": "10.1145/1867699.1867701"
    },
    {
      "text": "10. Lindqvist, J., Cranshaw, J., Wiese, J., Hong, J., and Zimmerman, J. I'm the mayor of my house: examining why people use foursquare - a social-driven location sharing application. In Proc. CHI 2011, ACM (Vancouver, Canada, 2011), 2409--2418.  ",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "11. McGookin, D., and Brewster, S. PULSE: the design and evaluation of an auditory display to provide a social vibe. In Proc. CHI 2012, ACM (Austin, TX, USA, 2012), 1263--1272.  ",
      "doi": "10.1145/2207676.2208580"
    },
    {
      "text": "12. Rico, J., and Brewster, S. Usable gestures for mobile interfaces: evaluating social acceptability. In Proc. CHI 2010, ACM, ACM (Atlanta, Georgia, USA, 2010), 887--896.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "13. Ritchie, J., and Spencer, L. Qualitative Data Analysis for Applied Policy Research. In Analysing Qualitative Data, A. Bryman and R. Burgess, Eds. Routledge, London, 1993, 173--194.",
      "doi": ""
    },
    {
      "text": "14. Rost, M., Cramer, H., and Holmquist, L. Mobile Exploration of Geotagged Photographs. Personal and Ubiquitous Computing, 1--12.  ",
      "doi": "10.1007/s00779-011-0433-x"
    },
    {
      "text": "15. Seeburger, J. No cure for curiosity: linking physical and digital urban layers. In Proc. NordiCHI 2012, ACM (Copenhagen, Denmark, 2012), 247--256.  ",
      "doi": "10.1145/2399016.2399054"
    },
    {
      "text": "16. Seeburger, J., and Foth, M. Content sharing on public screens: experiences through iterating social and spatial contexts. In Proc. OzCHI 2012, ACM (Melbourne, Victoria, 2012), 530--539.  ",
      "doi": "10.1145/2414536.2414618"
    }
  ]
}