{
  "doi": "10.1145/2556288.2557215",
  "title": "\"Maybe it was a joke\": emotion detection in text-only communication by non-native english speakers",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3715-3724",
  "year": 2014,
  "badges": [],
  "abstract": "Previous studies have shown that people can effectively detect emotions in text-only messages written in their native languages. But is this the same for non-native speakers' In this paper, we conduct an experiment where native English speakers (NS) and Japanese non-native English speakers (NNS) rate the emotional valence in text-only messages written by native English-speaking authors. They also annotate all emotional cues (words, symbols and emoticons) that affected their rating. Accuracy of NS and NNS ratings and annotations are calculated by comparing their average correlations with author ratings and annotations used as a gold standard. Our results conclude that NNS are significantly less accurate at detecting the emotional valence of messages, especially when the messages include highly negative words. Although NNS are as accurate as NS at detecting emotional cues, they are not able to make use of symbols (exclamation marks) and emoticons to detect the emotional valence of text-only messages.",
  "tags": [
    "emotion",
    "text-only communication",
    "computer-mediated communication",
    "non-native speaker"
  ],
  "authors": [
    {
      "name": "Ari MJ Hautasaari",
      "institution": "NTT Communication Science Labs, Kyoto, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467668347",
      "orcid": "0000-0002-5351-4035"
    },
    {
      "name": "Naomi Yamashita",
      "institution": "NTT Communication Science Labs, Kyoto, Japan",
      "img": "/do/10.1145/contrib-81309484665/rel-imgonly/photo2.png",
      "acmid": "81309484665",
      "orcid": "0000-0003-0643-6262"
    },
    {
      "name": "Ge Gao",
      "institution": "NTT Communication Science Labs & Cornell University (USA), Kyoto, Japan",
      "img": "/do/10.1145/contrib-81498646640/rel-imgonly/ge_photo.png",
      "acmid": "81498646640",
      "orcid": "0000-0003-2733-2681"
    }
  ],
  "references": [
    {
      "text": "Aman, S. and Szpakowicz, S. Identifying expressions of emotion in text. In Proc. TSD 2007 (LNCS 4629), Springer (2007), 196--205. ",
      "doi": "10.5555/1776334.1776363"
    },
    {
      "text": "Benson, M.J. Attitudes and motivation towards English: A survey of Japanese freshmen. RELC Journal 22, 1 (1991), 34--48.",
      "doi": ""
    },
    {
      "text": "Derks, D., Bos, A.E.R. and von Grumbkow, J. Emoticons and online message interpretation. Social Science Computer Review, 26, 3 (2008), 379--388.  ",
      "doi": "10.1177/0894439307311611"
    },
    {
      "text": "Dewaele, J-M. The emotional weight of I love you in multilinguals' languages. Journal of Pragmatics 40, 10 (2008), 1753--1780.",
      "doi": ""
    },
    {
      "text": "Ekman, P. An argument for basic emotions. Cognition and Emotion 6 (1992), 169'200.",
      "doi": ""
    },
    {
      "text": "Esuli, A. and Sebastiani, F. SentiWordNet: A publicly available lexical resource for opinion mining. In Proc. LREC 2006, 2006, 417--422.",
      "doi": ""
    },
    {
      "text": "Gill, A.J., French, R.M., Gergle, D. and Oberlander, J. The language of emotion in short blog texts. In Proc. CSCW 2008, ACM (2008), 299--302.  ",
      "doi": "10.1145/1460563.1460612"
    },
    {
      "text": "Gill, A.J., Gergle, D., French, R.M. and Oberlander, J. Emotion rating from short blog texts. In Proc. CHI 2008, ACM (2008), 1121--1124.  ",
      "doi": "10.1145/1357054.1357229"
    },
    {
      "text": "Hancock, J.T., Gee, K., Ciaccio, K. and Lin, J.M-H. I'm sad you're sad: emotional contagion in CMC. In Proc. CSCW 2008, ACM (2008), 295--298.  ",
      "doi": "10.1145/1460563.1460611"
    },
    {
      "text": "Hancock, J.T., Landrigan, C. and Silver, C. Expressing emotion in text-only communication. In Proc. CHI 2007, ACM (2007), 929--923.  ",
      "doi": "10.1145/1240624.1240764"
    },
    {
      "text": "Hyland, F. Learning autonomously: Contextualising outof-class English language learning. Language Awareness 13, 3 (2004), 180--202.",
      "doi": ""
    },
    {
      "text": "Kato, Y., Kato, S. and Akahori, K. Effects of emotional cues transmitted in e-mail communication on the emotions experienced by senders and receivers. Computers in Human Behavior, 23, 4 (2007), 18941905.  ",
      "doi": "10.5555/1224812.1225107"
    },
    {
      "text": "Miyake, K. How young Japanese express their emotions visually in mobile phone messages: A sociolinguistic analysis. Japanese Studies 27, 1 (2007), 53--72.",
      "doi": ""
    },
    {
      "text": "Mok, D., Carrasco, J.A. and Wellman, B. Does Distance Still Matter in the Age of the Internet'. Urban Studies 46, 13 (2009), 2747--2783.",
      "doi": ""
    },
    {
      "text": "Murphy, K. L. and Collins, M. P. Development of communication conventions in instructional electronic chats. Journal of Distance Education 12, 1'2 (1997), 177--200.",
      "doi": ""
    },
    {
      "text": "Nishimura, Y. Linguistic innovations and interactional features of casual online communication in Japanese. Journal of Computer-Mediated Communication 9, 1 (2006) http://onlinelibrary.wiley.com/doi/10.1111 /j.1083 - 6101.2003.tb00356.x/full (accessed: 15.9.2013).",
      "doi": ""
    },
    {
      "text": "Olson, G.M. and Olson, J.S. Distance matters. HumanComputer Interaction 15, 2 (2000), 139--178.  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Park. J., Barash, V., Fink, C. and Cha. M. Emoticon style: Interpreting differences in emoticons across cultures. In Proc. ICWSM 2013, AAAI Press (2013), 466'475.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Francis, M. E. and Booth, R. J. Linguistic inquiry and word count. Mahwah, NJ: Erlbaum Publishers (2001).",
      "doi": ""
    },
    {
      "text": "Plutchik, R. The Psychology and Biology of Emotion. New York: HarperCollins (1994).",
      "doi": ""
    },
    {
      "text": "Provine, R.R., Spencer, R.J. and Mandell, D.L. Emotional expression online: Emoticons punctuate website text messages. Journal of Language and Social Psychology 26, 3 (2007), 299--307.",
      "doi": ""
    },
    {
      "text": "Romney, A.K., Moore, C.C. and Rusch, C.D. Cultural universals: Measuring the semantic structure of emotion terms in English and Japanese. In Proc. National Academy of Sciences 94, 10 (1997), 5489--5494.",
      "doi": ""
    },
    {
      "text": "Russell, J.A. Pancultural aspects of the human conceptual organization of emotions. Journal of Personality and Social Psychology 45, 6 (1983), 12811288.",
      "doi": ""
    },
    {
      "text": "Short, J., Williams, E. and Christie, B. The Social Psychology of Telecommunications. New York: Wiley (1976).",
      "doi": ""
    },
    {
      "text": "Walther, J. Interpersonal effects in computer-mediated interaction: A relational perspective. Communication Research 19 (1992), 52--90.",
      "doi": ""
    },
    {
      "text": "Walther, J. and D'Addario, K.P. The impacts of emoticons on message interpretation in computer' mediated communication. Social Science Computer Review 19 (2001), 324--347.",
      "doi": ""
    },
    {
      "text": "Walther, J.B., Loh, T. and Granka, L. Let me count the ways: The interchange of verbal and nonverbal cues in computer-mediated and face-to-face affinity. Journal of Language and Social Psychology 24, 1 (2005), 36--65.",
      "doi": ""
    },
    {
      "text": "Yuasa, M., Saito, K. and Mukawa, N. Emoticons convey emotions without cognition of faces: An fMRI study. In Proc. CHI 2006, ACM (2006), 1565--1570.  ",
      "doi": "10.1145/1125451.1125737"
    }
  ]
}