{
  "doi": "10.1145/2556288.2557110",
  "title": "Learning to fail: experiencing public failure online through crowdfunding",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "581-590",
  "year": 2014,
  "badges": [],
  "abstract": "Online crowdfunding platforms like Kickstarter are gaining attention among novice creatives as an effective platform for funding their ventures and engaging in creative work with others. However, a focus on financial success of crowdfunding has obscured the fact that over 58% of crowdfunding projects fail to achieve their funding goals. This population of failed creatives however, gives us an audience to study public creative failure in an online environment. We draw inspiration from work in organizational behavior on failure, and work in Human Computer Interaction (HCI) on online behavior, to study online public failure. Using a mixed-methods approach with data scraped from Kickstarter and interview data with failed crowdfunding project creators, we answer the following question: What do project creators on crowdfunding platforms learn and change through the process of failing? We find that creators who relaunch their projects succeed 43% of the time, and that most individuals find failure to be a positive experience. We conclude the paper with a series of design implications for future creative platforms where public failure is part of the creative process.",
  "tags": [
    "feedback",
    "crowdfunding",
    "failure",
    "crowdsourcing"
  ],
  "authors": [
    {
      "name": "Michael D. Greenberg",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557145356",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth M. Gerber",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725085",
      "orcid": "0000-0001-8914-071X"
    }
  ],
  "references": [
    {
      "text": "Crowd-funding turns amateurs into inventors | wired business | wired.com. http://www.wired.com/business/2012/07/st_essay_inventors/.",
      "doi": ""
    },
    {
      "text": "Crowdfunding industry report: Market trends, composition and crowdfunding platforms. http://www.crowdsourcing.org/document/crowdfunding-industry-report-abridged-version-market-trends-composition-and-crowdfunding-platforms/14277.",
      "doi": ""
    },
    {
      "text": "The kickback machine. http://www.thekickbackmachine.com/.",
      "doi": ""
    },
    {
      "text": "Pebble smartwatch pre-orders are sold out, $10 million pledged | techland | TIME.com. http://techland.time.com/2012/05/10/pebble-smartwatch-pre-orders-sold-out/?cnn=yes.",
      "doi": ""
    },
    {
      "text": "Stats kickstarter. http://www.kickstarter.com/help/stats.",
      "doi": ""
    },
    {
      "text": "Welcome. http://getpebble.com.",
      "doi": ""
    },
    {
      "text": "Agrawal, A. K., Catalini, C., and Goldfarb, A. The geography of crowdfunding. Tech. rep., National Bureau of Economic Research, 2011.",
      "doi": ""
    },
    {
      "text": "Bailey, B. P., and Horvitz, E. What's your idea? a case study of a grassroots innovation pipeline within a large software company. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (New York, NY, USA, 2010), 2065--2074.  ",
      "doi": "10.1145/1753326.1753641"
    },
    {
      "text": "Brown, J. D., and Gallagher, F. M. Coming to terms with failure: Private self-enhancement and public self-effacement. Journal of Experimental Social Psychology 28, 1 (1992), 3--22.",
      "doi": ""
    },
    {
      "text": "Cannon, M. D., and Edmondson, A. C. Failing to learn and learning to fail (intelligently): How great organizations put failure to work to innovate and improve. Long Range Planning 38, 3 (2005), 299--319.",
      "doi": ""
    },
    {
      "text": "Cope, J. Entrepreneurial learning from failure: An interpretative phenomenological analysis. Journal of Business Venturing 26, 6 (2011), 604--623.",
      "doi": ""
    },
    {
      "text": "Corbin, J. M., and Strauss, A. L. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage Publications, Inc, 2008.",
      "doi": ""
    },
    {
      "text": "Cross, N. Creative cognition in design: processes of exceptional designers. In Proceedings of the 4th conference on Creativity & cognition, C&C '02, ACM (New York, NY, USA, 2002), 14--19.  ",
      "doi": "10.1145/581710.581714"
    },
    {
      "text": "Edmondson, A. Psychological safety and learning behavior in work teams. Administrative science quarterly 44, 2 (1999), 350--383.",
      "doi": ""
    },
    {
      "text": "Ellison, N. B., Steinfield, C., and Lampe, C. The benefits of facebook friends: social capital and college students use of online social network sites. Journal of Computer-Mediated Communication 12, 4 (2007), 1143--1168.",
      "doi": ""
    },
    {
      "text": "Gerber, E. M., Hui, J. S., and Kuo, P.-Y. Crowdfunding: Why people are motivated to post and fund projects on crowdfunding platforms.",
      "doi": ""
    },
    {
      "text": "Greenberg, M. D., Hui, J., and Gerber, E. Crowdfunding: a resource exchange perspective. In CHI'13 Extended Abstracts on Human Factors in Computing Systems (2013), 883--888.  ",
      "doi": "10.1145/2468356.2468514"
    },
    {
      "text": "Greenberg, M. D., Pardo, B., Hariharan, K., and Gerber, E. Crowdfunding support tools: predicting success & failure. In CHI'13 Extended Abstracts on Human Factors in Computing Systems (2013), 1815--1820.  ",
      "doi": "10.1145/2468356.2468682"
    },
    {
      "text": "Hui, J., Greenberg, M., and Gerber, E. Understanding the role of community in crowdfunding work. In Proceedings of the ACM 2014 conference on Computer Supported Cooperative Work, CSCW '14 (2014).  ",
      "doi": "10.1145/2531602.2531715"
    },
    {
      "text": "Lambert, T., and Schwienbacher, A. An empirical analysis of crowdfunding. In Social Science Research Network, vol. 1578175 (2010).",
      "doi": ""
    },
    {
      "text": "Mollick, E. The dynamics of crowdfunding: Determinants of success and failure. Available at SSRN 2088298 (2012).",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Teevan, J., and Panovich, K. What do people ask their social networks, and why?: a survey study of status message q&a behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '10, ACM (New York, NY, USA, 2010), 1739--1748.  ",
      "doi": "10.1145/1753326.1753587"
    },
    {
      "text": "Muller, M., Geyer, W., Soule, T., Daniels, S., and Cheng, L.-T. Crowdfunding inside the enterprise: employee-initiatives for innovation and collaboration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), 503--512.  ",
      "doi": "10.1145/2470654.2470727"
    },
    {
      "text": "Needleman, S. E. Raise cash on crowdfunding sites.",
      "doi": ""
    },
    {
      "text": "Singh, S., Corner, P., and Pavlovich, K. Coping with entrepreneurial failure. Journal of Management & Organization 13, 4 (2007), 331--344.",
      "doi": ""
    },
    {
      "text": "Ward, C., and Ramachandran, V. Crowdfunding the next hit: Microfunding online experience goods. In Workshop on Computational Social Science and the Wisdom of Crowds at NIPS2010 (2010).",
      "doi": ""
    },
    {
      "text": "Wood, R., and Bandura, A. Social cognitive theory of organizational management. Academy of management Review (1989), 361--384.",
      "doi": ""
    },
    {
      "text": "Wortham, J. Success of crowdfunding puts pressure on entrepreneurs.",
      "doi": ""
    },
    {
      "text": "Zhao, X., Salehi, N., Naranjit, S., Alwaalan, S., Voida, S., and Cosley, D. The many faces of facebook: experiencing social media as performance, exhibition, and personal archive. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), 1--10.  ",
      "doi": "10.1145/2470654.2470656"
    }
  ]
}