{
  "doi": "10.1145/2556288.2557075",
  "title": "SurfacePhone: a mobile projection device for single- and multiuser everywhere tabletop interaction",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3513-3522",
  "year": 2014,
  "badges": [],
  "abstract": "To maintain a mobile form factor, the screen real estate of a mobile device canIn this paper we present SurfacePhone; a novel configuration of a projector phone which aligns the projector to project onto a physical surface to allow tabletop-like interaction in a mobile setup. The projection is created behind the upright standing phone and is touch and gesture-enabled. Multiple projections can be merged to create shared spaces for multi-user collaboration. We investigate this new setup, starting with the concept that we evaluated with a concept prototype. Furthermore we present our technical prototype, a mobile phone case with integrated projector that allows for the aforementioned interaction. We discuss its technical requirements and evaluate the accuracy of interaction in a second user study. We conclude with lessons learned and design guidelines.",
  "authors": [
    {
      "name": "Christian Winkler",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-81100186414/rel-imgonly/81100186414.jpg",
      "acmid": "81100186414",
      "orcid": "missing"
    },
    {
      "name": "Markus Löchtefeld",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarbrucken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608347",
      "orcid": "missing"
    },
    {
      "name": "David Dobbelstein",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658737357",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University & Lancaster University (UK), Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Bachl, S., Tomitsch, M., Kappel, K., and Grechenig, T. The effects of personal displays and transfer techniques on collaboration strategies in multi-touch based multi-display environments. In Proc. of, INTERACT'11, Springer (2011), 373--390. ",
      "doi": "10.5555/2042182.2042216"
    },
    {
      "text": "Cauchard, J. R., Löchtefeld, M., Irani, P., Schoening, J., Krüger, A., Fraser, M., and Subramanian, S. Visual separation in mobile multi-display environments. In Proc. of, UIST '11, ACM (New York, NY, USA, 2011), 451--460.  ",
      "doi": "10.1145/2047196.2047256"
    },
    {
      "text": "Chen, N., Guimbretiere, F., Dixon, M., Lewis, C., and Agrawala, M. Navigation techniques for dual-display e-book readers. In Proc. of, CHI '08, ACM (New York, NY, USA, 2008), 1779--1788.  ",
      "doi": "10.1145/1357054.1357331"
    },
    {
      "text": "Greenberg, S., Boyle, M., and Laberge, J. PDAs and shared public displays: Making personal information public, and public information personal. Personal Technologies 3, 1--2 (Mar. 1999), 54--64.",
      "doi": ""
    },
    {
      "text": "Hang, A., Rukzio, E., and Greaves, A. Projector phone: a study of using mobile phones with integrated projector for interaction with maps. In Proc. of, MobileHCI '08, ACM (New York, NY, USA, 2008), 207--216.  ",
      "doi": "10.1145/1409240.1409263"
    },
    {
      "text": "Harrison, C., Benko, H., and Wilson, A. D. OmniTouch: wearable multitouch interaction everywhere. In Proc. of, UIST '11, ACM (New York, NY, USA, 2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Henze, N., Rukzio, E., and Boll, S. 100,000,000 taps: analysis and improvement of touch performance in the large. In Proc. of, MobileHCI '11, ACM (New York, NY, USA, 2011), 133--142.  ",
      "doi": "10.1145/2037373.2037395"
    },
    {
      "text": "Hinckley, K., Dixon, M., Sarin, R., Guimbretiere, F., and Balakrishnan, R. Codex: a dual screen tablet computer. In Proc. of, CHI '09, ACM (New York, NY, USA, 2009), 1933--1942.  ",
      "doi": "10.1145/1518701.1518996"
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P., and Smith, M. Stitching: pen gestures that span multiple displays. In Proc. of, AVI '04, ACM (New York, NY, USA, 2004), 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Kane, S. K., Avrahami, D., Wobbrock, J. O., Harrison, B., Rea, A. D., Philipose, M., and LaMarca, A. Bonfire: a nomadic system for hybrid laptop-tabletop interaction. In Proc. of, UIST '09, ACM (New York, NY, USA, 2009), 129--138.  ",
      "doi": "10.1145/1622176.1622202"
    },
    {
      "text": "Kauko, J., and Häkkilä, J. Shared-screen social gaming with portable devices. In Proc. of, MobileHCI '10, ACM (New York, NY, USA, 2010), 317--326.  ",
      "doi": "10.1145/1851600.1851657"
    },
    {
      "text": "Lewis, James R. IBM computer usability satisfaction questionnaires: Psychometric evaluation and instructions for use. Technical 54.786, Human Factors Group.",
      "doi": ""
    },
    {
      "text": "Lyons, K., Pering, T., Rosario, B., Sud, S., and Want, R. Multi-display composition: Supporting display sharing for collocated mobile devices. In Proc. of, vol. 5726 of INTERACT '09. Springer, Berlin, Germany, 2009, 758--771.  ",
      "doi": "10.1007/978-3-642-03655-2_83"
    },
    {
      "text": "Matsumoto, T., Horiguchi, D., Nakashima, S., and Okude, N. Z-agon: mobile multi-display browser cube. In Extended Abstracts of, CHI '06, ACM (New York, NY, USA, 2006), 351--356.  ",
      "doi": "10.1145/1125451.1125528"
    },
    {
      "text": "Molyneaux, D., Izadi, S., Kim, D., Hilliges, O., Hodges, S., Cao, X., Butler, A., and Gellersen, H. Interactive environment-aware handheld projectors for pervasive computing spaces. In Pervasive Computing, vol. 7319. Springer, Berlin, Heidelberg, 2012, 197--215.  ",
      "doi": "10.1007/978-3-642-31205-2_13"
    },
    {
      "text": "Schmidt, D., Seifert, J., Rukzio, E., and Gellersen, H. A cross-device interaction style for mobiles and surfaces. In Proc. of, DIS '12, ACM (New York, NY, USA, 2012), 318--327.  ",
      "doi": "10.1145/2317956.2318005"
    },
    {
      "text": "Seifert, J., Simeone, A., Schmidt, D., Holleis, P., Reinartz, C., Wagner, M., Gellersen, H., and Rukzio, E. MobiSurf: improving co-located collaboration through integrating mobile devices and interactive surfaces. In Proc. of, ITS '12, ACM (New York, NY, USA, 2012), 51--60.  ",
      "doi": "10.1145/2396636.2396644"
    },
    {
      "text": "Shirazi, A. S., Döring, T., Parvahan, P., Ahrens, B., and Schmidt, A. Poker surface: combining a multi-touch table and mobile phones in interactive card games. In Proc. of, MobileHCI '09, ACM (New York, NY, USA, 2009), 73:1--73:2.  ",
      "doi": "10.1145/1613858.1613945"
    },
    {
      "text": "Wilson, A. D. PlayAnywhere: a compact interactive tabletop projection-vision system. In Proc. of, UIST'05, ACM (New York, NY, USA, 2005), 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Wilson, A. D., and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. of, UIST '10, ACM (New York, NY, USA, 2010), 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Winkler, C., Seifert, J., Reinartz, C., Krahmer, P., and Rukzio, E. Penbook: Bringing pen+paper interaction to a tablet device to facilitate paper-based workflows in the hospital domain. In Proc. of, ITS '13, ACM (New York, NY, USA, 2013), 283--286.  ",
      "doi": "10.1145/2512349.2512797"
    },
    {
      "text": "Wobbrock, J. O., Wilson, A. D., and Li, Y. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. In Proc. of, UIST '07, ACM (New York, NY, USA, 2007), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    }
  ]
}