{
  "doi": "10.1145/2556288.2557310",
  "title": "Supporting the design and fabrication of physical visualizations",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3845-3854",
  "year": 2014,
  "badges": [],
  "abstract": "Physical visualizations come in increasingly diverse forms, and are used in domains including art and entertainment, business analytics, and scientific research. However, creating physical visualizations requires laborious craftsmanship and demands expertise in both data visualization and digital fabrication. We present three case studies that illustrate limitations of current visualization fabrication workflows. We then present MakerVis, a prototype tool that integrates the entire process of creating physical visualizations, from data filtering to physical fabrication. Design sessions with three end users demonstrate how tools such as MakerVis can dramatically lower the barriers to producing physical visualizations. Observations and interviews from these sessions highlighted future research areas, including customization support, using material properties to represent data variables, and allowing the reuse of physical data objects in new visualizations.",
  "authors": [
    {
      "name": "Saiganesh Swaminathan",
      "institution": "Inria, Saclay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659824278",
      "orcid": "missing"
    },
    {
      "name": "Conglei Shi",
      "institution": "Hong Kong University of Science and Technology, Hong Kong , Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490668299",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Jansen",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81414616215/rel-imgonly/isir_photo_booth_dec_2019_carre_e.jpg",
      "acmid": "81414616215",
      "orcid": "missing"
    },
    {
      "name": "Pierre Dragicevic",
      "institution": "INRIA, Saclay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723138",
      "orcid": "0000-0002-1854-5899"
    },
    {
      "name": "Lora A. Oehlberg",
      "institution": "Inria, Saclay, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436599468",
      "orcid": "missing"
    },
    {
      "name": "Jean-Daniel Fekete",
      "institution": "INRIA, Saclay, France",
      "img": "/do/10.1145/contrib-81100194446/rel-imgonly/81100194446.jpg",
      "acmid": "81100194446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, M. Embodied cognition: A field guide. Arti'cial Intelligence 149, 1 (2003), 91'130.  ",
      "doi": "10.1016/S0004-3702%2803%2900054-7"
    },
    {
      "text": "Bertin, J. Graphique et mathématique : généralisation du traitement graphique de l'information. Annales. Économies, Sociétés, Civilisations., 1 (1969), 70'101.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Mackinlay, J. D., and Shneiderman, B. Readings in Information Visualization: Using Vision to Think. Morgan Kaufmann, Jan. 1999. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Chevalier, F., Vuillemot, R., and Gali, G. Using concrete scales: A practical framework for effective visual depiction of complex measures. Visualization and Computer Graphics, IEEE Transactions on 19, 12 (2013), 2426'2435.  ",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "Dragicevic, P., and Jansen, Y. List of physical visualizations. tinyurl.com/physvis, 2013. {Online; accessed 04-Sep-2013}.",
      "doi": ""
    },
    {
      "text": "Dwyer, T. Two-and-a-half-dimensional Visualisation of Relational Networks. PhD thesis, School of Information Technologies, Faculty of Science, University of Sydney, 2005.",
      "doi": ""
    },
    {
      "text": "Gaines, B. R. Modeling and forecasting the information sciences. Information Sciences 57 (1991), 3'22. ",
      "doi": "10.5555/106027.106028"
    },
    {
      "text": "Genc, S., Messler Jr, R. W., and Gabriele, G. A. A systematic approach to integral snap--t attachment design. Research in Engineering Design 10, 2 (1998), 84'93.",
      "doi": ""
    },
    {
      "text": "Gwilt, I., Yoxall, A., and Sano, K. Enhancing the understanding of statistical data through the creation of physical objects. In Proc. ICDC2012 (2012), 117'126.",
      "doi": ""
    },
    {
      "text": "Heer, J., Card, S. K., and Landay, J. Prefuse: A toolkit for interactive information visualization. In ACM Human Factors in Computing Systems (CHI) (2005), 421'430.  ",
      "doi": "10.1145/1054972.1055031"
    },
    {
      "text": "Hildebrand, K., Bickel, B., and Alexa, M. crdbrd: Shape fabrication by sliding planar slices. Comp. Graph. Forum 31, 2pt3 (May 2012), 583'592.  ",
      "doi": "10.1111/j.1467-8659.2012.03037.x"
    },
    {
      "text": "Jansen, Y., and Dragicevic, P. An interaction model for visualizations beyond the desktop. IEEE TVCG (Nov. 2013). To appear.  ",
      "doi": "10.1109/TVCG.2013.134"
    },
    {
      "text": "Jansen, Y., Dragicevic, P., and Fekete, J.-D. Evaluating the ef'ciency of physical visualizations. In Proc. of CHI 2013, ACM (2013), 2593'2602.  ",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Jean-Daniel Fekete. The InfoVis Toolkit. In Proc. InfoVis 2004, IEEE Press (October 2004), 167'174.  ",
      "doi": "10.5555/1038262.1038796"
    },
    {
      "text": "Kosara, R. Visualization criticism-the missing link between information visualization and art. In Proc. of Information Visualization, IV'07, IEEE (2007), 631'636.  ",
      "doi": "10.1109/IV.2007.130"
    },
    {
      "text": "Lau, M., Ohgawara, A., Mitani, J., and Igarashi, T. Converting 3d furniture models to fabricatable parts and connectors. In Proc. of ACM SIGGRAPH 2011, SIGGRAPH '11, ACM (2011), 85:1'85:6.  ",
      "doi": "10.1145/1964921.1964980"
    },
    {
      "text": "Lee, B., Isenberg, P., Riche, N., Carpendale, S., et al. Beyond mouse and keyboard: Expanding design considerations for information visualization interactions. IEEE TVCG 18, 12 (2012).",
      "doi": ""
    },
    {
      "text": "Luo, L., Baran, I., Rusinkiewicz, S., and Matusik, W. Chopper: partitioning models into 3d-printable parts. ACM Trans. Graph. 31, 6 (Nov. 2012), 129:1'129:9.  ",
      "doi": "10.1145/2366145.2366148"
    },
    {
      "text": "Moere, A. Beyond the tyranny of the pixel: Exploring the physicality of information visualization. In Proc. IV'08, IEEE (2008), 469'474.  ",
      "doi": "10.1109/IV.2008.84"
    },
    {
      "text": "Mueller, S., Lopes, P., and Baudisch, P. Interactive construction: interactive fabrication of functional mechanical devices. In Proc. of UIST 2012, ACM (2012), 599'606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Pousman, Z., Stasko, J., and Mateas, M. Casual information visualization: Depictions of data in everyday life. IEEE TVCG 13, 6 (2007).  ",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Prévost, R., Whiting, E., Lefebvre, S., and Sorkine-Hornung, O. Make it stand: balancing shapes for 3d fabrication. ACM Transactions on Graphics (TOG) 32, 4 (2013), 81.  ",
      "doi": "10.1145/2461912.2461957"
    },
    {
      "text": "Saul, G., Lau, M., Mitani, J., and Igarashi, T. Sketchchair: an all-in-one chair design system for end users. In Proc. TEI 2011, ACM (2011), 73'80.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Savage, V., Zhang, X., and Hartmann, B. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proc. of UIST 2012, ACM (2012), 579'588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Schmandt-Besserat, D. How writing came about. University of Texas Press, 1996.",
      "doi": ""
    },
    {
      "text": "Shah, J. J. Parametric and feature-based CAD/CAM: concepts, techniques, and applications. Wiley. com, 1995. ",
      "doi": "10.5555/546488"
    },
    {
      "text": "Stefaner, M., Hemment, D., and Studio NAND. Emoto. tinyurl.com/emotovis, 2012. {accessed 2013-03--30}.",
      "doi": ""
    },
    {
      "text": "Stolte, C., and Hanrahan, P. Polaris: A system for query, analysis and visualization of multi-dimensional relational databases. IEEE TVCG 8 (2002), 52'65.  ",
      "doi": "10.1109/2945.981851"
    },
    {
      "text": "Stusak, S., Tabard, A., and Butz, A. Can physical visualizations support analytical tasks' Vis '2013 (poster) (Nov. 2013). In press.",
      "doi": ""
    },
    {
      "text": "Tanenbaum, J. G., Williams, A. M., Desjardins, A., and Tanenbaum, K. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. In Proc. CHI 2013, ACM (2013), 2603'2612.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Victor, B. Drawing dynamic visualizations. vimeo.com/66085662, 2013. {Online; accessed 18-Sep-2013}.",
      "doi": ""
    },
    {
      "text": "Viegas, F. B., Wattenberg, M., van Ham, F., Kriss, J., and McKeon, M. Manyeyes: a site for visualization at internet scale. IEEE TVCG 13, 6 (Nov. 2007), 1121'1128.  ",
      "doi": "10.1109/TVCG.2007.70577"
    }
  ]
}