{
  "doi": "10.1145/2556288.2556993",
  "title": "AudioCanvas: internet-free interactive audio photos",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3735-3738",
  "year": 2014,
  "badges": [],
  "abstract": "In this paper we present a novel interaction technique that helps to make textual information more accessible to those with low or no textual literacy skills. AudioCanvas allows cameraphone users to interact directly with their own photos of printed media to receive audio feedback or narration. The use of a remote telephone-based service also allows our design to be used over a standard phone line, removing the need for data connections, which can be problematic in developing regions. We show the value of the technique via user evaluations in both a rural Indian village and a South African township.",
  "tags": [
    "developing regions",
    "camera phones",
    "audio",
    "qr codes"
  ],
  "authors": [
    {
      "name": "Simon Robinson",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81371592031/rel-imgonly/profile-small-rect.jpg",
      "acmid": "81371592031",
      "orcid": "0000-0001-9228-006X"
    },
    {
      "name": "Jennifer S. Pearson",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    }
  ],
  "references": [
    {
      "text": "Back, M., Cohen, J., Gold, R., Harrison, S. and Minneman, S. Listen reader: an electronically augmented paper-based book. In Proc. CHI'01, ACM (2001), 23--29.  ",
      "doi": "10.1145/365024.365031"
    },
    {
      "text": "Costanza, E., Giaccone, M., Kueng, O., Shelley, S. and Huang, J. Ubicomp to the masses: a large-scale study of two tangible interfaces. In Proc. UbiComp'10, ACM (2010), 173--182.  ",
      "doi": "10.1145/1864349.1864388"
    },
    {
      "text": "Frohlich, D. Audiophotography. Springer (2004).",
      "doi": ""
    },
    {
      "text": "Klemmer, S., Graham, J., Wolff, G. and Landay, J. Books with voices: paper transcripts as a physical interface to oral histories. In Proc. CHI'03, ACM (2003), 89--96.  ",
      "doi": "10.1145/642611.642628"
    },
    {
      "text": "Kumar, A., Rajput, N., Chakraborty, D., Agarwal, S. and Nanavati, A. WWTW: the world wide telecom web. In NSDR workshop, SIGCOMM'07, ACM (2007).  ",
      "doi": "10.1145/1326571.1326582"
    },
    {
      "text": "Medhi, I., Gautama, N. and Toyama, K. A comparison of mobile money-transfer UIs for non-literate and semiliterate users. In Proc. CHI'09, ACM (2009), 1741--1750.  ",
      "doi": "10.1145/1518701.1518970"
    },
    {
      "text": "Mistry, P., Maes, P. and Chang, L. WUW ' wear ur world: a wearable gestural interface. In Proc. CHI'09: Extended Abstracts, ACM (2009), 4111--4116.  ",
      "doi": "10.1145/1520340.1520626"
    },
    {
      "text": "Parikh, T., Javid, P., K, S., Ghosh, K. and Toyama, K. Mobile phones and paper documents: evaluating a new approach for capturing micro'nance data in rural India. In Proc. CHI'06, ACM (2006), 551--560.  ",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Seifert, J., P'eging, B., Hermes, M., Rukzio, E. and Schmidt, A. Mobidev: a tool for creating apps on mobile phones. In Proc. MobileHCI'11, ACM (2011), 109--112.  ",
      "doi": "10.1145/2037373.2037392"
    },
    {
      "text": "Smith, G. and Marsden, G. Providing media download services in African taxis. In Proc. SAICSIT'11, ACM (2011), 215--223.  ",
      "doi": "10.1145/2072221.2072246"
    },
    {
      "text": "Suzuki, G., Aoki, S., Iwamoto, T., Maruyama, D., Koda, T., Kohtake, N., Takashio, K. and Tokuda, H. u-Photo: interacting with pervasive services using digital still images. In LNCS, vol. 3468. Springer (2005), 190--207.  ",
      "doi": "10.1007/11428572_12"
    },
    {
      "text": "Wellner, P. Interacting with paper on the digitaldesk. Communications of the ACM 36.7 (1993), 87--96.  ",
      "doi": "10.1145/159544.159630"
    }
  ]
}