{
  "doi": "10.1145/2556288.2557217",
  "title": "Combining crowdsourcing and learning to improve engagement and performance",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3379-3388",
  "year": 2014,
  "badges": [],
  "abstract": "Crowdsourcing complex creative tasks remains difficult, in part because these tasks require skilled workers. Most crowdsourcing platforms do not help workers acquire the skills necessary to accomplish complex creative tasks. In this paper, we describe a platform that combines learning and crowdsourcing to benefit both the workers and the requesters. Workers gain new skills through interactive step-by-step tutorials and test their knowledge by improving real-world images submitted by requesters. In a series of three deployments spanning two years, we varied the design of our platform to enhance the learning experience and improve the quality of the crowd work. We tested our approach in the context of LevelUp for Photoshop, which teaches people how to do basic photograph improvement tasks using Adobe Photoshop. We found that by using our system workers gained new skills and produced high-quality edits for requested images, even if they had little prior experience editing images.",
  "tags": [
    "crowdsourcing",
    "games",
    "training"
  ],
  "authors": [
    {
      "name": "Mira Dontcheva",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100654713",
      "orcid": "missing"
    },
    {
      "name": "Robert R. Morris",
      "institution": "MIT Media Lab, Cambirdge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472646929",
      "orcid": "missing"
    },
    {
      "name": "Joel R. Brandt",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81351596282/rel-imgonly/joel-brandt-adobe.jpg",
      "acmid": "81351596282",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth M. Gerber",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502725085",
      "orcid": "0000-0001-8914-071X"
    }
  ],
  "references": [
    {
      "text": "Amabile, T. M. Creativity and innovation in organizations. Harvard Business School, 1996.",
      "doi": ""
    },
    {
      "text": "Bergman, L., Castelli, V., Lau, T., and Oblinger, D. Docwizards: a system for authoring follow-me documentation wizards. In Proceedings of UIST (2005), 191--200.  ",
      "doi": "10.1145/1095034.1095067"
    },
    {
      "text": "Bernstein, M. S., Brandt, J., Miller, R. C., and Karger, D. R. Crowds in two seconds: enabling realtime crowd-powered interfaces. In Proceedings of UIST (2011), 33--42.  ",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., Crowell, D., and Panovich, K. Soylent: a word processor with a crowd inside. In Proceedings of UIST (2010), 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Cohen, J. A coefficient of agreement for nominal scales. Educational and psychological measurement, 1 (1960), 37--46.",
      "doi": ""
    },
    {
      "text": "Cooper, S., Khatib, F., Treuille, A., Barbero, J., Lee, J., Beenen, M., Leaver-Fay, A., Baker, D., Popovic, Z., and players, F. Predicting protein structures with a multiplayer online game. Nature 446 (2010), 756--760.",
      "doi": ""
    },
    {
      "text": "Dong, T., Dontcheva, M., Joseph, D., Karahalios, K., Newman, M., and Ackerman, M. Discovery-based games for learning software. In Proceedings of SIGCHI (2012), 2083--2086.  ",
      "doi": "10.1145/2207676.2208358"
    },
    {
      "text": "Dow, S., Kulkarni, A., Klemmer, S., and Hartmann, B. Shepherding the crowd yields better work. In Proceedings of CSCW (2012), 1013--1022.  ",
      "doi": "10.1145/2145204.2145355"
    },
    {
      "text": "Guilford, J. P. The nature of human intelligence. McGraw-Hill, 1967.",
      "doi": ""
    },
    {
      "text": "Heer, J., and Bostock, M. Crowdsourcing graphical perception: Using mechanical turk to assess visualization design. In Proceedings of SIGCHI (2010), 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Kaufman, J. C., Plucker, J. A., and Baer, J. Essentials of creativity assessment, vol. 53. Wiley, 2008.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Smus, B., Khamkar, S., and Kraut, R. E. Crowdforge: crowdsourcing complex work. In Proceedings of UIST (2011), 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Kulkarni, A., Can, M., and Hartmann, B. Collaboratively crowdsourcing workflows with turkomatic. In Proceedings of the CSCW (2012), 1003--1012.  ",
      "doi": "10.1145/2145204.2145354"
    },
    {
      "text": "Lewis, S., Dontcheva, M., and Gerber, E. Affective computational priming and creativity. In Proceedings of SIGCHI (2011), 735--744.  ",
      "doi": "10.1145/1978942.1979048"
    },
    {
      "text": "Li, W., Grossman, T., and Fitzmaurice, G. Gamicad: A gamified tutorial system for first time autocad users. In Proceedings of UIST (2012), 103--112.  ",
      "doi": "10.1145/2380116.2380131"
    },
    {
      "text": "Morris, R. R., Dontcheva, M., Finkelstein, A., and Gerber, E. Affect and creative performance on crowdsourcing platforms. In Proceedings of ACII (2013).  ",
      "doi": "10.1109/ACII.2013.18"
    },
    {
      "text": "Pongnumkul, S., Dontcheva, M., Li, W., Wang, J., Bourdev, L., Avidan, S., and Cohen, M. F. Pause-and-play: automatically linking screencast video tutorials with applications. In Proceedings of UIST (2011), 135--144.  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Puccio, G., and Murdock, Mary, E. Creativity Assessment: Readings and Resources. Creative Education Foundation Press, Buffalo, NY, USA, 1999.",
      "doi": ""
    },
    {
      "text": "von Ahn, L., and Dabbish, L. Labeling images with a computer game. In Proceedings of the SIGCHI (2004), 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Zhang, H., Dow, S., Kraut, R., and Kittur, A. Reviewing versus doing: Learning and performance in crowd assessment. In Proceedings of CSCW (2014).  ",
      "doi": "10.1145/2531602.2531718"
    }
  ]
}