{
  "doi": "10.1145/2556288.2557234",
  "title": "Expanding touch input vocabulary by using consecutive distant taps",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2597-2606",
  "year": 2014,
  "badges": [],
  "abstract": "In recent years, touch screens have emerged and matured as the main input interface for mobile and tablet computers calling for extended touch input possibilities. In this paper, we explore the use of consecutive distant taps to expand the touch screen input vocabulary. We analyzed time intervals and distances between consecutive taps during common applications on a tablet and verified that consecutive distant taps can be used conflict-free with existing touch gestures. We designed the two interaction techniques Ta-tap and Ta-Ta-tap that utilize consecutive distant taps. Ta-tap uses two consecutive distant taps to invoke alternative touch operations for multi-touch emulation, whereas Ta-Ta-tap uses a series of consecutive distant taps to define a spatial gesture. We verified the feasibility of both interaction techniques through a series of experiments and a user study. The high recognition rate of Ta-tap and Ta-Ta-tap gestures, the few conflicts with existing gestures, and the positive feedback from the participants assert the potential of consecutive distant taps as a new design space to enrich touch screen interactions.",
  "authors": [
    {
      "name": "Seongkook Heo",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81484643096/rel-imgonly/81484643096.jpg",
      "acmid": "81484643096",
      "orcid": "0000-0003-2004-4812"
    },
    {
      "name": "Jiseong Gu",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958867857",
      "orcid": "missing"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A. and Cox, A. L. Questionnaires, in-depth interviews and focus groups. In P. Cairns and A. L. Cox, eds., Research Methods for Human Computer Interaction. Cambridge University Press (2008), 17--34.",
      "doi": ""
    },
    {
      "text": "Benko, H., Wilson, A., and Baudisch, P. Precise selection techniques for multi-touch screens. In proc. CHI '06, ACM (2006), 1263--1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Bonnet, D., Appert, C., and Beaudouin-Lafon, M. Extending the Vocabulary of Touch Events with ThumbRock. In proc. GI '13, ACM (2013). ",
      "doi": "10.5555/2532129.2532166"
    },
    {
      "text": "Boring, S., Ledo, D., Chen, X., Marquardt, N., Tang, A., and Greenberg, S. The Fat Thumb: Using the Thumb's Contact Size for Single-Handed Mobile Interaction. In proc. MobileHCI '12, ACM (2012), 39--48.  ",
      "doi": "10.1145/2371574.2371582"
    },
    {
      "text": "Davidson, P. L. and Han, J. Y. Extending 2D object arrangement with pressure-sensitive layering cues. In proc. UIST '08, ACM (2008), 87--90.  ",
      "doi": "10.1145/1449715.1449730"
    },
    {
      "text": "Findlater, L., Wobbrock, J. O. and Wigdor, D. Typing on flat glass: examining ten-finger expert typing patterns on touch surfaces. In proc. CHI '11, ACM (2011), 2453--2462.  ",
      "doi": "10.1145/1978942.1979301"
    },
    {
      "text": "Forlines, C., Wigdor, D., Shen, C., and Balakrishnan, R. Direct-touch vs. mouse input for tabletop displays. In proc. CHI '07, ACM (2007), 647--656.  ",
      "doi": "10.1145/1240624.1240726"
    },
    {
      "text": "Goel, M., Wobbrock, J. O., and Patel, S. N. GripSense: Using Built-In Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones. In proc. UIST '12, ACM (2012), 545--554.  ",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Gustafson, S., Holz, C., and Baudisch, P. Imaginary Phone: learning imaginary interfaces by transferring spatial memory from a familiar device. In proc. UIST '11, ACM (2011), 283--292.  ",
      "doi": "10.1145/2047196.2047233"
    },
    {
      "text": "Harrison, C. and Hudson, S. Using Shear as a Supplemental Two-Dimensional Input Channel for Rich Touchscreen Interaction. In proc. CHI '12, ACM (2012), 3149--3152.  ",
      "doi": "10.1145/2207676.2208730"
    },
    {
      "text": "Harrison, C., Schwarz, J. and Hudson, S. E. TapSense: enhancing finger interaction on touch surfaces. In proc. UIST '11, ACM (2011), 627--634.  ",
      "doi": "10.1145/2047196.2047279"
    },
    {
      "text": "Heo, S. and Lee, G. Force gestures: augmenting touch screen gestures with normal and tangential forces. In proc. UIST '11, ACM (2011), 621--626.  ",
      "doi": "10.1145/2047196.2047278"
    },
    {
      "text": "Heo, S. and Lee, G. ForceTap: extending the input vocabulary of mobile touch screens by adding tap gestures. In proc. MobileHCI '11, ACM (2011), 113--122.  ",
      "doi": "10.1145/2037373.2037393"
    },
    {
      "text": "Heo, S. and Lee, G. Indirect shear force estimation for multi-point shear force operations. In proc. CHI '13, ACM (2013), 281--284.  ",
      "doi": "10.1145/2470654.2470693"
    },
    {
      "text": "Hinckley, K. and Song, H. Sensor synaesthesia: touch in motion, and motion in touch. In proc. CHI '11, ACM (2011), 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Karat, J., McDonald, J. E., and Anderson, M. A comparison of menu selection techniques: touch panel, mouse and keyboard. International Journal of ManMachine Studies 25, 1 (1986), 73--88.  ",
      "doi": "10.1016/S0020-7373%2886%2980034-7"
    },
    {
      "text": "Kin, K., Agrawala, M., and DeRose, T. Determining the benefits of direct-touch, bimanual, and multifinger input on a multitouch workstation. In proc. GI '09, Canadian Information Processing Society (2009), 119--124. ",
      "doi": "10.5555/1555880.1555910"
    },
    {
      "text": "Microsoft MSDN, http://msdn.microsoft.com/enus/library/windows/desktop/bb760404(v=vs.85).aspx",
      "doi": ""
    },
    {
      "text": "Miyaki, T. and Rekimoto, J. GraspZoom: zooming and scrolling control model for single-handed mobile interaction. In proc. MobileHCI '09, ACM (2009), 11:1--11:4.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Müller, H., Gove, J., and Webb, J. Understanding Tablet Use: A Multi-Method Exploration. In proc. MobileHCI '12, ACM (2012), 1--10.  ",
      "doi": "10.1145/2371574.2371576"
    },
    {
      "text": "Myers, C. S. and Rabiner, L. R. A comparative study of several dynamic time-warping algorithms for connected word recognition. The Bell System Technical J. 60, 7 (1981), 1389--1409.",
      "doi": ""
    },
    {
      "text": "Research In Motion™ , SurePress™ Technology. http://us.blackberry.com/specifications/communication/surepress-touch-screen.html",
      "doi": ""
    },
    {
      "text": "Roth, V. and Turner, T., Bezel swipe: conflict-free scrolling and multiple selection on mobile touch screen devices. In proc. CHI '09, ACM (2009), 1523--1526.  ",
      "doi": "10.1145/1518701.1518933"
    },
    {
      "text": "Roudaut, A., Lecolinet, E., and Guiard, Y. MicroRolls: expanding touch-screen input vocabulary by distinguishing rolls vs. slides of the thumb. In proc. CHI '09, ACM (2009), 927--936.  ",
      "doi": "10.1145/1518701.1518843"
    },
    {
      "text": "Rubine, D. Specifying gestures by example. In proc. SIGGRAPH '91, ACM (1991), 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "Sears, A. and Shneiderman, B. High precision touchscreens: design strategies and comparisons with a mouse. International Journal of Man-Machine Studies 34, 4 (1991), 593--613.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "Serrano, M., Lecolinet, E., and Guiard, Y. Bezel-Tap gestures: quick activation of commands from sleep mode on tablets. In proc. CHI '13, ACM (2013), 3027--3036.  ",
      "doi": "10.1145/2470654.2481421"
    },
    {
      "text": "Wagner, J., Huot, S., and Mackay, W. BiTouch and BiPad: designing bimanual interaction for hand-held tablets. In proc. CHI '12, ACM (2012), 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    },
    {
      "text": "Wang, F., and Ren, X. Empirical evaluation for finger input properties in multi-touch interaction. In proc. CHI '09, ACM (2009), 1063--1072.  ",
      "doi": "10.1145/1518701.1518864"
    },
    {
      "text": "Wang, F., Cao, X., Ren, X., and Irani, P. Detecting and leveraging finger orientation for interaction with directtouch surfaces, In proc. UIST '09, ACM (2009), 23--32.  ",
      "doi": "10.1145/1622176.1622182"
    },
    {
      "text": "Wobbrock, J., Wilson, A., and Li, Y. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. In Proc. UIST '07, ACM (2007), 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Zhao, S., Maneesh, A., and Hinckley, K. Zone and polygon menus: using relative position to increase the breadth of multi-stroke marking menus, In Proc. CHI '06, ACM (2006), 1077--1086.  ",
      "doi": "10.1145/1124772.1124933"
    }
  ]
}