{
  "doi": "10.1145/2556288.2557203",
  "title": "Global connectivity and multilinguals in the Twitter network",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "833-842",
  "year": 2014,
  "badges": [],
  "abstract": "This article analyzes the global connectivity of the Twitter retweet and mentions network and the role of multilingual users engaging with content in multiple languages. The network is heavily structured by language with most mentions and retweets directed to users writing in the same language. Users writing in multiple languages are more active, authoring more tweets than monolingual users. These multilingual users play an important bridging role in the global connectivity of the network. The mean level of insularity from speakers in each language does not correlate straightforwardly with the size of the user base as predicted by previous research. Finally, the English language does play more of a bridging role than other languages, but the role played collectively by multilingual users across different languages is the largest bridging force in the network.",
  "authors": [
    {
      "name": "Scott A. Hale",
      "institution": "Oxford Internet Institute, University of Oxford, Oxford, Oxon, United Kingdom",
      "img": "/do/10.1145/contrib-81502689334/rel-imgonly/me.jpg",
      "acmid": "81502689334",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bakshy, E., Hofman, J. M., Mason, W. A., and Watts, D. J. Everyone's an influencer: Quantifying influence on Twitter. In Proceedings of the Fourth ACM International Conference on Web Search and Data Mining, WSDM '11, ACM (New York, NY, USA, 2011), 65--74.  ",
      "doi": "10.1145/1935826.1935845"
    },
    {
      "text": "Bao, P., Hecht, B., Carton, S., Quaderi, M., Horn, M., and Gergle, D. Omnipedia: Bridging the Wikipedia language gap. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '12, ACM (New York, NY, USA, 2012), 1075--1084.  ",
      "doi": "10.1145/2207676.2208553"
    },
    {
      "text": "Barnett, G. A., and Choi, Y. Physical distance and language as determinants of the international telecommunications network. International Political Science Review 16, 3 (1995), 249--265.",
      "doi": ""
    },
    {
      "text": "Carter, S., Tsagkias, M., and Weerkamp, W. Semi-supervised priors for microblog language identification. In Dutch-Belgian Information Retrieval Workshop (DIR 2011) (2011).",
      "doi": ""
    },
    {
      "text": "Crystal, D. English as a Global Language, 2nd ed. Cambridge University Press, Cambridge, 2003.",
      "doi": ""
    },
    {
      "text": "Durham, M. Language choice on a Swiss mailing list. Journal of Computer-Mediated Communication 9, 1 (2003).",
      "doi": ""
    },
    {
      "text": "Eleta, I., and Golbeck, J. Bridging languages in social networks: How multilingual users of Twitter connect language communities. Proceedings of the American Society for Information Science and Technology 49, 1 (2012), 1--4.",
      "doi": ""
    },
    {
      "text": "Etling, B., Kelly, J., Faris, R., and Palfrey, J. Mapping the Arabic blogosphere: Politics and dissent online. New Media & Society 12, 8 (2010), 1225--1243.",
      "doi": ""
    },
    {
      "text": "Graham, M., Hale, S. A., and Gaffney, D. Where in the world are you? Geolocation and language identification in Twitter. Professional Geographer (2013).",
      "doi": ""
    },
    {
      "text": "Granovetter, M. The strength of weak ties. The American Journal of Sociology 78, 6 (1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "Hale, S. A. Impact of platform design on cross-language information exchange. In Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems Extended Abstracts, CHI EA '12, ACM (New York, NY, USA, 2012), 1363--1368.  ",
      "doi": "10.1145/2212776.2212456"
    },
    {
      "text": "Hale, S. A. Net increase Cross-lingual linking in the blogosphere. Journal of Computer-Mediated Communication 17, 2 (2012), 135--151.  ",
      "doi": "10.1111/j.1083-6101.2011.01568.x"
    },
    {
      "text": "Hecht, B., and Gergle, D. The Tower of Babel meets Web 2.0: User-generated content and its applications in a multilingual context. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, CHI '10, ACM (New York, NY, USA, 2010), 291--300.  ",
      "doi": "10.1145/1753326.1753370"
    },
    {
      "text": "Herring, S. C., Paolillo, J. C., Ramos-Vielba, I., Kouper, I., Wright, E., Stoerger, S., Scheidt, L. A., and Clark, B. Language networks on LiveJournal. In Proceedings of the 40th Annual Hawaii International Conference on System Sciences, HICSS '07, IEEE Computer Society (Washington, DC, USA, 2007).  ",
      "doi": "10.1109/HICSS.2007.320"
    },
    {
      "text": "Hong, L., Convertino, G., and Chi, E. Language matters in Twitter: A large scale study. In International AAAI Conference on Weblogs and Social Media (2011), 518--521.",
      "doi": ""
    },
    {
      "text": "Kulshrestha, J., Kooti, F., Nikravesh, A., and Gummadi, K. P. Geographic dissection of the Twitter network. In Proceedings of the Sixth International Conference on Weblogs and Social Media (ICWSM-2012), The AAAI Press (Dublin, Ireland, 2012).",
      "doi": ""
    },
    {
      "text": "Newman, M. E. J., and Girvan, M. Finding and evaluating community structure in networks. Phys. Rev. E 69, 2 (2004).",
      "doi": ""
    },
    {
      "text": "Nordenstreng, K., and Varis, T. Television traffic: A one-way street? A survey and analysis of the international flow of television programme material. Reports and Papers on Mass Communication, 70 (1974).",
      "doi": ""
    },
    {
      "text": "Raghavan, U. N., Albert, R., and Kumara, S. Near linear time algorithm to detect community structures in large-scale networks. Phys. Rev. E 76, 3 (Sept. 2007), 36106.",
      "doi": ""
    },
    {
      "text": "State, B., Park, P., Weber, I., Mejova, Y., and Macy, M. The mesh of civilizations and international email flows. http://arxiv.org/abs/1303.0045, 2013.",
      "doi": ""
    },
    {
      "text": "Takhteyev, Y., Gruzd, A., and Wellman, B. Geography of Twitter networks. Social Networks (2011), 1--26.",
      "doi": ""
    },
    {
      "text": "Viger, F., and Latapy, M. Efficient and simple generation of random simple connected graphs with prescribed degree sequence. In Computing and Combinatorics, L. Wang, Ed., vol. 3595 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2005, 440--449.  ",
      "doi": "10.5555/2958119.2958125"
    },
    {
      "text": "Warschauer, M., Said, G. R. E., and Zohry, A. Language choice online: Globalization and identity in Egypt. Journal of Computer-Mediated Communication 7, 4 (2002).",
      "doi": ""
    },
    {
      "text": "Wei, C. Y., and Kolko, B. E. Resistance to globalization: Language and Internet diffusion patterns in Uzbekistan. New Review of Hypermedia and Multimedia 11, 2 (2005), 205--220.",
      "doi": ""
    },
    {
      "text": "Wilkinson, D., and Thelwall, M. Trending Twitter topics in English: An international comparison. Journal of the American Society for Information Science and Technology 63, 8 (2012), 1631--1646.  ",
      "doi": "10.1002/asi.22713"
    },
    {
      "text": "Zuckerman, E. Rewire: Digital Cosmopolitans in the Age of Connection. W. W. Norton & Company, London, 2013.",
      "doi": ""
    }
  ]
}