{
  "doi": "10.1145/2556288.2557301",
  "title": "Balancing design tensions: iterative display design to support ad hoc and multidisciplinary medical teamwork",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3777-3786",
  "year": 2014,
  "badges": [],
  "abstract": "In this paper, we describe how we developed an information display prototype for trauma resuscitation teams based on design ideas and feedback from clinicians. Our approach is grounded in participatory design, emphasizing the importance of gaining long-term commitment from clinicians in system development. Through a series of participatory design workshops, heuristic evaluation, and simulated resuscitation sessions, we identified the main information features to include on our display. Our results focus on how we balanced the design tensions that emerged when addressing the ad hoc, hierarchical, and multidisciplinary nature of trauma teamwork. We discuss the implications of balancing role-based differences for each information feature, as well as two major design tensions: process-based vs. state-based designs and role-based vs. team-based displays.",
  "tags": [
    "trauma resuscitation",
    "design tensions",
    "information displays",
    "teamwork",
    "healthcare",
    "participatory design"
  ],
  "authors": [
    {
      "name": "Diana S. Kusunoki",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496685851",
      "orcid": "missing"
    },
    {
      "name": "Aleksandra Sarcevic",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/do/10.1145/contrib-81100413266/rel-imgonly/profile.jpg",
      "acmid": "81100413266",
      "orcid": "missing"
    },
    {
      "name": "Nadir Weibel",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/do/10.1145/contrib-81100240198/rel-imgonly/nadirweibel_small.jpg",
      "acmid": "81100240198",
      "orcid": "0000-0002-3457-4227"
    },
    {
      "name": "Ivan Marsic",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100245090",
      "orcid": "missing"
    },
    {
      "name": "Zhan Zhang",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548670456",
      "orcid": "missing"
    },
    {
      "name": "Genevieve Tuveson",
      "institution": "Children's National Medical Center, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959407257",
      "orcid": "missing"
    },
    {
      "name": "Randall S. Burd",
      "institution": "Children's National Medical Center, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580884",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American College of Surgeons. Advanced Trauma Life Support® (ATLS®), 8th Edition, Chicago, IL, 2008.",
      "doi": ""
    },
    {
      "text": "Barach, P. and Weinger, M.B. Trauma team performance. In Trauma: Emergency resuscitation, perioperative anesthesia, surgical management, Informa Healthcare USA, Inc., New York, NY, 2007.",
      "doi": ""
    },
    {
      "text": "Bardram, J.E., Hansen, T.R., and Soegaard, M. AwareMedia: A shared interactive display supporting social, temporal and spatial awareness in surgery. Proc. CSCW 2006, ACM Press (2006), 109--118.  ",
      "doi": "10.1145/1180875.1180892"
    },
    {
      "text": "Bowers, J.M. and Martin, D. Informing collaborative information visualization through an ethnography of ambulance control. Proc. ECSCW 1999, 309--330. ",
      "doi": "10.5555/351689.351707"
    },
    {
      "text": "Burns, C.M. and Hajdukiewicz, J.R. Ecological Interface Design. CRC Press, 2004. ",
      "doi": "10.5555/993940"
    },
    {
      "text": "Fitzpatrick, G. and Ellingsen, G. A review of 25 years of CSCW research in healthcare. Computer Supported Cooperative Work 22, 4--6 (2013), 609--665.  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Gross, T. Supporting effortless coordination. Computer Supported Cooperative Work 22, 4--6 (2013), 425--474.  ",
      "doi": "10.1007/s10606-013-9190-x"
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. Proc. CHI 2001, ACM Press (2001), 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Gutwin, C. and Greenberg, S. Design for individuals, design for groups: tradeoffs between power and workspace awareness. Proc. CSCW 1998, ACM Press (1998), 207--216.  ",
      "doi": "10.1145/289444.289495"
    },
    {
      "text": "Heath, C.C. and Luff, P. Collaborative activity and technological design: Task coordination in London underground control rooms. Proc. ECSCW 1991, 65--80. ",
      "doi": "10.5555/1241910.1241915"
    },
    {
      "text": "Holzman, T.G. Computer-human interface solutions for emergency medical care. interactions 6, 3 (1999), 13--24.  ",
      "doi": "10.1145/301153.301160"
    },
    {
      "text": "Kensing, F. and Blomberg, J. Participatory design: Issues and concerns. Computer Supported Cooperative Work 7, 3--4 (1998), 167'185.  ",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Kristensen, M., Kyng, M., and Palen, L. Participatory design in emergency medical service: designing for future practice. Proc. CHI 2006, ACM Press (2006), 161--170.  ",
      "doi": "10.1145/1124772.1124798"
    },
    {
      "text": "Kyng, M., Nielsen, E.T., and Kristensen, M. Challenges in designing interactive systems for emergency response. Proc. DIS 2006, ACM Press (2006), 301--310.  ",
      "doi": "10.1145/1142405.1142450"
    },
    {
      "text": "Mankoff, J., Dey, A.K., Hsieh, G., Kientz, J., Lederer, S., and Ames, M. Heuristic evaluation of ambient displays. Proc. CHI 2003, ACM Press (2003), 169--176.  ",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Matthews, T., Rattenbury, T., and Carter, S. Defining, designing, and evaluating peripheral displays: An analysis using activity theory. Human-Computer Interaction 22, (2007), 221--261. ",
      "doi": "10.5555/1466595.1466602"
    },
    {
      "text": "Muller, M.J. PICTIVE: Democratizing the dynamics of the design session. In Participatory Design: Principles and Practices. Erlbaum Associates Inc., Hillsdale, NJ, 1993, 211'239.",
      "doi": ""
    },
    {
      "text": "Muller, M.J. Participatory design: the third space in HCI. In Human-Computer Interaction: Development Process. CRC Press, Boca Raton, FL, 2003, 165'185.",
      "doi": ""
    },
    {
      "text": "Parush, A., Kramer, C., Foster-Hunt, T., Momtahan, K., Hunter, A., and Sohmer, B. Communication and team situation awareness in the OR. Journal of Biomedical Informatics 44, (2011), 477--485.  ",
      "doi": "10.1016/j.jbi.2010.04.002"
    },
    {
      "text": "Sarcevic, A., Marsic, I., and Burd, R. S. Teamwork errors in trauma resuscitation. ToCHI 19, 2 (2012), article 13.  ",
      "doi": "10.1145/2240156.2240161"
    },
    {
      "text": "Wallace, J.R., Scott, S.D., Lai, E. and Jajalla, D. Investigating the role of a large, shared display in multidisplay environments. Computer Supported Cooperative Work 20, 6 (2011), 529--561.  ",
      "doi": "10.1007/s10606-011-9149-8"
    }
  ]
}