{
  "doi": "10.1145/2556288.2557127",
  "title": "The lonely raccoon at the ball: designing for intimacy, sociability, and selfhood",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3943-3952",
  "year": 2014,
  "badges": [],
  "abstract": "Designing for sociable systems requires, among other abilities, a sensitivity to the meanings, structures, and nuances of technology-mediated experiences that are simultaneously felt by users to be intimate and also social. Such a sensitivity is not easily acquired, and design researchers have recommended the use of social theories to guide designers' readings of technology-mediated social experiences. We use philosopher Michel Foucault's theory of identity (and social power, discourse, sexuality, creativity, and style) known as \"the care of the self,\" as a scaffold with which to produce a sensitive interpretation of the intimacy (and expert social creative) practices of adult users of the virtual world Second Life (SL). This reading sheds light on several skilled and creative intimacy practices in SL. It also offers a philosophically grounded hermeneutic strategy for designers interested in analyzing intimate experiences.",
  "tags": [
    "intimacy",
    "maker culture",
    "making",
    "amateurs",
    "sexuality",
    "creativity",
    "sociability",
    "user experience",
    "hci",
    "identity",
    "design"
  ],
  "authors": [
    {
      "name": "Jeffrey Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057577",
      "orcid": "missing"
    },
    {
      "name": "Shaowen Bardzell",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    },
    {
      "name": "Guo Zhang",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490664217",
      "orcid": "missing"
    },
    {
      "name": "Tyler Pace",
      "institution": "Indiana University Bloomington, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502722044",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bardzell, J., & Bardzell, S. (2011). Pleasure is your birthright: Digitally enabled designer sex toys as a case of third-wave HCI. In Proc CHI'1 ACM, 257--266.  ",
      "doi": "10.1145/1978942.1978979"
    },
    {
      "text": "Bardzell, S., & Bardzell, J. (2007). Docile avatars: Aesthetics, experience, and sexual interaction in Second Life. In Proc. BCS HCI'07. British Computer Society. ",
      "doi": "10.5555/1531294.1531296"
    },
    {
      "text": "Bardzell, S., & Odom, W. (2008). The experience of embodied space in virtual worlds: An ethnography of a Second Life community. Space and Culture, 11(3), 239--259.",
      "doi": ""
    },
    {
      "text": "Batterbee, K. & Koskinen, I. Co-experience: Product experience as social interaction. In Schifferstein & Hekkert (eds.), Product Experience. Elsevier, 461--476.",
      "doi": ""
    },
    {
      "text": "Baym, N. (2010). Personal connections in the digital age: Digital media and society. Cambridge, UK: Polity.",
      "doi": ""
    },
    {
      "text": "Bell, G., Blythe, M., & Sengers, P. (2005). Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI), 12(2), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Bertelsen, O. W., & Petersen, M. G. (2007). Erotic life as a new frontier in HCI. In Proc. BCS HCI'0 British Computer Society. ",
      "doi": "10.5555/1531407.1531410"
    },
    {
      "text": "Bhandari, S., & Bardzell, S. (2008). Bridging gaps: Affective communication in long distance relationships. In CHI'08 EA. New York: ACM, 2763--276  ",
      "doi": "10.1145/1358628.1358758"
    },
    {
      "text": "Boellstorff, T. (2008). Coming of age in second life: An anthropologist explores the virtually human. Princeton: Princeton UP. ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Brewer, J., Kaye, J. J., Williams, A., & Wyche, S. (2006). Sexual interactions: why we should talk about sex in HCI. In CHI'06 EA. New York, ACM, 1695--1698.  ",
      "doi": "10.1145/1125451.1125765"
    },
    {
      "text": "Bucholtz, M., & Hall, K. (2004). Theorizing identity in language and sexuality research. Language in Society, 33(4), 469--516.",
      "doi": ""
    },
    {
      "text": "Croon Fors, A. (2013). The ontology of the subject in digitalization. In R. Luppicini (Ed.), Handbook of research on technoself: Identity in a technological society. Hershey, PA: Information Science Reference, 45--63.",
      "doi": ""
    },
    {
      "text": "Eissler, K. R. (1958). Problems of identity. Journal of the American Psychoanalytic Association, 6, 131--142.",
      "doi": ""
    },
    {
      "text": "Elliott, A. (2007). Concepts of the Self. Malden, MA: Polity.",
      "doi": ""
    },
    {
      "text": "Foucault, M. (1990). The History of Sexuality. Three vols. Trans. Robert Hurley. Vintage.",
      "doi": ""
    },
    {
      "text": "Foucault, M. (1989 {1984}). Foucault Live. S. Lotringer (Ed.). New York: Semiotext(e).",
      "doi": ""
    },
    {
      "text": "Giddens, A. (1992). The transformation of intimacy: Sexuality, love, and eroticism in modem societies. Stanford, CA: Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Goodman, E., & Rosner, D. 2011. From garments to gardens: negotiating material relationships online and 'by hand'. Proc. CHI'11. New York: ACM, 2257--2266.  ",
      "doi": "10.1145/1978942.1979273"
    },
    {
      "text": "Goodman, E., & Vertesi, J. 2012. Design for X': distribution choices and ethical design. In CHI '12 EA. New York: ACM, 81--90.  ",
      "doi": "10.1145/2212776.2212786"
    },
    {
      "text": "Hall, S. (1996). Who needs identity. Questions of cul-tural identity, 16(2), 1--17.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M., Heidecker, S., Eckoldt, K., Diefenbach, S., & Hillmann, U. (2012). All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology. ACM TOCHI 19(4), Article 30.  ",
      "doi": "10.1145/2395131.2395137"
    },
    {
      "text": "Hebdige, D. (1979). Subcultures: The Meaning of Style. Routledge.",
      "doi": ""
    },
    {
      "text": "Howard, S., Vetere, F., Gibbs, M., Kjeldskov, J., Pedell, S., Mecoles, K., Bunyan, M., & Murphy, J. (2004). Mediating Intimacy: digital kisses and cut and paste hugs. In Proc. CHI'04. New York: ACM.",
      "doi": ""
    },
    {
      "text": "Kaye, J. J., Levitt, M. K., Nevins, J., Golden, J., & Schmidt, V. (2005). Communicating intimacy one bit at a time. In Proc. CHI'05. New York: ACM, 1529--1532.  ",
      "doi": "10.1145/1056808.1056958"
    },
    {
      "text": "Kannabiran, G., Bardzell, J., & Bardzell, S. (2011). How HCI talks about sexuality: discursive strategies, blind spots, and opportunities for future research. In Proc. CHI'11. New York: ACM, 695--704.  ",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Koefoed Hansen, L., & Kozel, S. (2007). Embodied imagination: a hybrid method of designing for intimacy. Digital Creativity, 18(4), 207--220.",
      "doi": ""
    },
    {
      "text": "Kolotkin, R., Williams, M., Lloyd, C., & Hallford, E. (2012). Does loving an avatar threaten real life marriage' Journal of Virtual Worlds Research, 5(3).",
      "doi": ""
    },
    {
      "text": "Kuznetsov, S. and Paulos, E. Rise of the expert amateur: DIY projects, communities, and cultures. Proc. of NordiCHI 2010, ACM Press (2010), 295--304.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Lichtenstein, H. (1977). The dilemma of human identity. New York: Jason Aronson.",
      "doi": ""
    },
    {
      "text": "Light, A. (2011). HCI as heterodoxy: Technologies of identity and the queering of interaction with computers. Interacting with Computers, 23(5), 430--438.  ",
      "doi": "10.1016/j.intcom.2011.02.002"
    },
    {
      "text": "Nakamura, L. (2002). Cybertypes: Race, Ethnicity, and Identity on the Internet. Routledge. ",
      "doi": "10.5555/515277"
    },
    {
      "text": "Malaby, T. M. (2007). Contriving constraints (the gameness of Second Life and the persistence of scarcity). Innovations: Technology, Governance, Globalization, 2(3), 62--67.",
      "doi": ""
    },
    {
      "text": "McCarthy, J., & Wright, P. (2004). Technology as experience. Cambridge, MA: The MIT Press. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Meadows, M. (2008). I, avatar: The culture and consequences of having a second life. Berkeley, CA: New Riders.",
      "doi": ""
    },
    {
      "text": "Ogden, C. K., & Richards, I. A. (1923). The meaning of meaning. New York: Mariner Books.",
      "doi": ""
    },
    {
      "text": "Pace, T. Bardzell, J., and Bardzell, S.. (2010). The rogue in the lovely black dress: Intimacy in World of Warcraft. Proc. CHI'10. New York: ACM, 233--242.  ",
      "doi": "10.1145/1753326.1753361"
    },
    {
      "text": "Person, E. S. (1980). Sexuality as the mainstay of identity: Psychoanalytic perspectives. Signs, 5(4), 605--630.",
      "doi": ""
    },
    {
      "text": "Register, L. M., & Henley, T. B. (1992). The phenomenology of intimacy. Journal of Social and Personal Relationships, 9(4), 467--481.",
      "doi": ""
    },
    {
      "text": "Robinson, L. (2007). The cyberself: The selfing project goes online, symbolic interaction in the digital age. New Media & Society, 9(1), 93--110.",
      "doi": ""
    },
    {
      "text": "Ross, M. W. (2005). Typing, doing, and being: Sexuality and the Internet. Journal of sex research, 42(4), 342--352.",
      "doi": ""
    },
    {
      "text": "Russon, J. (2003). Human experience: Philosophy, neurosis, and the elements of everyday life. Albany: State University of New York Press.",
      "doi": ""
    },
    {
      "text": "Schiphorst, T., et al. (2007). PillowTalk: Can we afford intimacy' Proc. TEI'07. New York: ACM, 23--30.  ",
      "doi": "10.1145/1226969.1226975"
    },
    {
      "text": "Subrahmanyam, K., Greenfield, P. M., & Tynes, B. (2004). Constructing sexuality and identity in an online teen chat room. Journal of Applied Developmental Psychology, 25(6), 651--666.",
      "doi": ""
    },
    {
      "text": "Vetere, F., Gibbs, M. R., Kjeldskov, J., Howard, S., Mueller, F. F., Pedell, S., Mecoles, K., & Bunyan, M. (2005). Mediating intimacy: designing technologies to support strong-tie relationships. In Proc. CHI'05. New York: ACM, 471--480.  ",
      "doi": "10.1145/1054972.1055038"
    },
    {
      "text": "Tanenbaum, J., Tanenbaum, K., Wakkary, R. Steam- punk as design fiction. Proc. of CHI 2012, ACM Press (2012), 1583--1592.  ",
      "doi": "10.1145/2207676.2208279"
    },
    {
      "text": "Zimmerman, J. (2009). Designing for the self: making products that help people become the person they desire to be. In Proc. CHI'09. New York: ACM, 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}