{
  "doi": "10.1145/2556288.2557396",
  "title": "Canine-centered interface design: supporting the work of diabetes alert dogs",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3757-3766",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Many people with Diabetes live with the continuous threat of hypoglycemic attacks and the danger of going into coma. Diabetes Alert Dogs are trained to detect the onset of an attack before the condition of the human handler they are paired with deteriorates, giving them time to take action. We investigated requirements for designing an alarm system allowing dogs to remotely call for help when their human falls unconscious before being able to react to an alert. Through a multispecies ethnographic approach we focus on the requirements for a physical canine user interface, involving dogs, their handlers and specialist dog trainers in the design process. We discuss tensions between the requirements for canine and the human users, argue the need for increased sensitivity towards the needs of individual dogs that goes beyond breed specific physical characteristics, and reflect on how we can move from designing for dogs to designing with dogs.",
  "authors": [
    {
      "name": "Charlotte L. Robinson",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959312357",
      "orcid": "missing"
    },
    {
      "name": "Clara Mancini",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100207640",
      "orcid": "missing"
    },
    {
      "name": "Janet van der Linden",
      "institution": "The Open University, Milton Keynes, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650091",
      "orcid": "missing"
    },
    {
      "name": "Claire Guest",
      "institution": "Medical Detection Dogs, Great Horwood, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958634157",
      "orcid": "missing"
    },
    {
      "name": "Robert Harris",
      "institution": "Medical Detection Dogs, Great Horwood, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959446557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alwan, M., Dalal, S., Mack, D., Kell, S., Turner, B., Leachtenauer, J., & Felder, R. (2006). Impact of monitoring technology in assisted living: outcome pilot. Information Technology in Biomedicine, IEEE Transactions on, 10(1), 192--198.  ",
      "doi": "10.1109/TITB.2005.855552"
    },
    {
      "text": "Bergenstal, R. M et al. (2010). Effectiveness of sensoraugmented insulin-pump therapy in type 1 diabetes. New England Journal of Medicine, 363(4), 311--320.",
      "doi": ""
    },
    {
      "text": "Bilous, R., Donnelly, R. (2010) Handbook of Diabetes. 4th Edition. John Wiley & Sons Ltd., Chichester, 96'97.",
      "doi": ""
    },
    {
      "text": "Britt, W. R., Miller, J., Waggoner, P., Bevly, D. M., & Hamilton Jr, J. A. (2011). An embedded system for realtime navigation and remote command of a trained canine. Personal and Ubiquitous Computing, 15(1), 61--74.  ",
      "doi": "10.1007/s00779-010-0298-4"
    },
    {
      "text": "Chen, M., Daly, M., Williams, N., Williams, S., Williams, C., & Williams, G. (2000). Non-invasive detection of hypoglycaemia using a novel, fully biocompatible and patient friendly alarm system. BMJ: British Medical Journal, 321(7276), 1565.",
      "doi": ""
    },
    {
      "text": "Corstjens, A. M., Ligtenberg, J. J., van der Horst, I. C., Spanjersberg, R., Lind, J. S., Tulleken, J. E., Meertens, J., & Zijlstra, J. G. (2006). Accuracy and feasibility of pointof-care and continuous blood glucose analysis in critically ill ICU patients. Critical Care, 10(5), R135.",
      "doi": ""
    },
    {
      "text": "Helton, W. S. (2009). Overview of Scent Detection Work. Canine Ergonomics: The Science of Working Dogs, 83.",
      "doi": ""
    },
    {
      "text": "iPetCompanion: ipetcompanion.com/",
      "doi": ""
    },
    {
      "text": "Jackson, M. M., Zeagler, C., Valentin, G., Martin, A., Martin, V., Delawalla, A., Blount, W., Eiring, S., Hollis, R., & Starner, T. (2013). FIDO-facilitating interactions for dogs with occupations: wearable dog-activated interfaces. In Proceedings of the 17th annual international symposium on International symposium on wearable computers (pp. 81--88). ACM.  ",
      "doi": "10.1145/2493988.2494334"
    },
    {
      "text": "Joseph, J. I., Hipszer, B., Mraovic, B., Chervoneva, I., Joseph, M., & Grunwald, Z. (2009). Challenges in Glycemic Control in Perioperative and Critically Ill Patients: Clinical Need for Continuous Glucose Monitoring in the Hospital. Journal of diabetes science and technology, 3(6), 1309.",
      "doi": ""
    },
    {
      "text": "Lee, P., Cheok, D., James, S., Debra, L., Jie, W., Chuang, W., & Farbiz, F. (2006). A mobile pet wearable computer and mixed reality system for human'poultry interaction through the internet. Personal and Ubiquitous Computing, 10(5), 301--317.  ",
      "doi": "10.1007/s00779-005-0051-6"
    },
    {
      "text": "Loc8tor Pet: loc8tor.com/uk/pets/",
      "doi": ""
    },
    {
      "text": "Mancini, C. (2011). Animal-computer interaction: a manifesto. Interactions, 18(4), 69--73.  ",
      "doi": "10.1145/1978822.1978836"
    },
    {
      "text": "Mancini, C., van der Linden, J., Bryan, J., & Stuart, A. (2012). Exploring interspecies sensemaking: dog tracking semiotics and multispecies ethnography. Proceedings ACM UbiComp, 143--152.  ",
      "doi": "10.1145/2370216.2370239"
    },
    {
      "text": "Mancini, C. (2013). Animal-computer interaction (ACI): changing perspective on HCI, participation and sustainability. In ACM CHI'13 EA, 2227--2236.  ",
      "doi": "10.1145/2468356.2468744"
    },
    {
      "text": "Miskelly, F. G. (2001). Assistive technology in elderly care. Age and ageing, 30(6), 455--458.",
      "doi": ""
    },
    {
      "text": "PawTrax: pawtrax.co.uk/",
      "doi": ""
    },
    {
      "text": "PetCube: petcube.net/",
      "doi": ""
    },
    {
      "text": "Pet Doorbell Mat: petdoorbellmat.net/",
      "doi": ""
    },
    {
      "text": "PintoFeed Intelligent PetFeeder: pintofeed.com/",
      "doi": ""
    },
    {
      "text": "Pryor, K. (2002). Clicker training for dogs. Ringpress.",
      "doi": ""
    },
    {
      "text": "Resner, B.I. (2001). Rover@Home: Computer Mediated Remote Interaction for Dogs. Media Arts and Sciences MS, Cambridge, Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Rooney, N. J., Morant, S., & Guest, C. (2013). Investigation into the Value of Trained Glycaemia Alert Dogs to Clients with Type I Diabetes. PloS One, 8(8), e69921.",
      "doi": ""
    },
    {
      "text": "Schuler, D., & Namioka, A. (Eds.). (1993). Participatory design: Principles and practices. Routledge. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Shaw, J. E., Sicree, R. A., & Zimmet, P. Z. (2010). Global estimates of the prevalence of diabetes for 2010 and 2030. Diabetes research and clinical practice, 87(1), 4--14.",
      "doi": ""
    },
    {
      "text": "Stamp Dawkins, M. (2012). Why Animals Matter: Animal Consciousness, Animal Welfare and Human WellBeing. Oxford University Press, Oxford-NY.",
      "doi": ""
    },
    {
      "text": "Stanford, V. (2002). Using pervasive computing to deliver elder care. Pervasive Computing, IEEE, 1(1), 10--13.  ",
      "doi": "10.1109/MPRV.2002.993139"
    },
    {
      "text": "Track My Cat: trackmycat.com/",
      "doi": ""
    },
    {
      "text": "Tractive: tractive.com/",
      "doi": ""
    },
    {
      "text": "van der Linden, J., Rogers, Y., Waights, V and Taylor, C. (2012). A blended design approach for pervasive healthcare: bringing together users, experts and technology. Health Informatics Journal, 18(3), 212'218.",
      "doi": ""
    },
    {
      "text": "van Belle, T. L., Coppieters, K. T., & Von Herrath, M. G. (2011). Type 1 diabetes: etiology, immunology, and therapeutic strategies. Physiological reviews, 91(1), 79--118.",
      "doi": ""
    },
    {
      "text": "Weilenmann, A., & Juhlin, O. (2011, May). Understanding people and animals: the use of a positioning system in ordinary human-canine interaction. Proc. ACM CHI'11, 2631--2640  ",
      "doi": "10.1145/1978942.1979328"
    },
    {
      "text": "Westerlaken, M., & Gualeni, S. (2013). Digitally complemented zoomorphism: a theoretical foundation for human-animal interaction design. Proc. ACM DPPI'13, 193--200.  ",
      "doi": "10.1145/2513506.2513527"
    },
    {
      "text": "Wells D, Lawson SW, Siriwardena N (2008) Canine responses to hypoglycaemia in patients with Type 1 diabetes. Altern Complem Med14: 1235'1241.",
      "doi": ""
    },
    {
      "text": "Wingrave, C.A., Rose, J., Langston, T., LaViola Jr, J.J. (2010). Early Explorations of CAT: Canine Amusement and Training. In CHI 2010: Monsters Attack! Proc. CHI'10, ACM Press, 2661--2664.  ",
      "doi": "10.1145/1753846.1753849"
    }
  ]
}