{
  "doi": "10.1145/2556288.2556979",
  "title": "Pixel-based methods for widget state and style in a runtime implementation of sliding widgets",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2231-2240",
  "year": 2014,
  "badges": [],
  "abstract": "Pixel-based methods offer unique potential for modifying existing interfaces independent of their underlying implementation. Prior work has demonstrated a variety of modifications to existing interfaces, including accessibility enhancements, interface language translation, testing frameworks, and interaction techniques. But pixel-based methods have also been limited in their understanding of the interface and therefore the complexity of modifications they can support. This work examines deeper pixel-level understanding of widgets and the resulting capabilities of pixel-based runtime enhancements. Specifically, we present three new sets of methods: methods for pixel-based modeling of widgets in multiple states, methods for managing the combinatorial complexity that arises in creating a multitude of runtime enhancements, and methods for styling runtime enhancements to preserve consistency with the design of an existing interface. We validate our methods through an implementation of Moscovich et al.'s Sliding Widgets, a novel runtime enhancement that could not have been implemented with prior pixel-based methods.",
  "tags": [
    "pixel-based runtime modification",
    "hybrid touch and mouse interaction",
    "sliding widgets",
    "prefab",
    "real-world interfaces"
  ],
  "authors": [
    {
      "name": "Morgan Dixon",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350581254",
      "orcid": "missing"
    },
    {
      "name": "Gierad Laput",
      "institution": "Carnegie Mellon University & University of Washington, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "James Fogarty",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142271",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albinsson, P.-A. and Zhai, S. High Precision Touch Screen Interaction. CHI 2003, 105--112.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Banovic, N., Grossman, T., Matejka, J., and Fitzmaurice, G. Waken: Reverse Engineering Usage Information and Interface Structure from Software Videos. UIST 2012, 83--92.  ",
      "doi": "10.1145/2380116.2380129"
    },
    {
      "text": "Baudisch, P. and Chu, G. Back-of-Device Interaction Allows Creating Very Small Touch Devices. CHI 2009, 1923--1932.  ",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Benko, H., Wilson, A.D., and Baudisch, P. Precise Selection Techniques for Multi-Touch Screens. CHI 2006, 1263--1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Bolin, M., Webber, M., Rha, P., Wilson, T., and Miller, R.C. Automation andCustomizationofRenderedWebPages.UIST2005, 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "Chang, T.-H., Yeh, T., and Miller, R. Associating the Visual Representation of User Interfaces with Their Internal Structures and Metadata. UIST 2011, 245--254.  ",
      "doi": "10.1145/2047196.2047228"
    },
    {
      "text": "Chang, T.-H., Yeh, T., and Miller, R.C. GUI Testing Using Computer Vision. CHI 2010, 1535--1544.  ",
      "doi": "10.1145/1753326.1753555"
    },
    {
      "text": "Dixon, M., Fogarty, J., and Wobbrock, J. A General-Purpose Target-Aware Pointing Enhancement Using Pixel-Level Analysis of Graphical Interfaces. CHI 2012, 3167--3176.  ",
      "doi": "10.1145/2207676.2208734"
    },
    {
      "text": "Dixon, M. and Fogarty, J. Prefab Layers and Prefab Annotations: Extensible Pixel-Based Interpretation of Graphical Interfaces. In Preparation.",
      "doi": ""
    },
    {
      "text": "Dixon, M. and Fogarty, J. Prefab : Implementing Advanced Behaviors Using Pixel-Based Reverse Engineering of Interface Structure. CHI 2010, 1525--1534.  ",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Dixon, M., Leventhal, D., and Fogarty, J. Content and Hierarchy in Pixel-Based Methods for Reverse Engineering Interface Structure. CHI 2011, 969--978.  ",
      "doi": "10.1145/1978942.1979086"
    },
    {
      "text": "Eagan, J.R., Beaudouin-Lafon, M., and Mackay, W.E. Cracking the Cocoa Nut: User Interface Programming at Runtime. UIST 2011, 225--234.  ",
      "doi": "10.1145/2047196.2047226"
    },
    {
      "text": "Edwards, W.K., Hudson, S.E., Marinacci, J., Rodenstein, R., Rodriguez, T., and Smith, I. Systematic Output Modification in a 2D User Interface Toolkit. UIST 1997, 151--158.  ",
      "doi": "10.1145/263407.263537"
    },
    {
      "text": "Fujima, J., Lunzer, A., Hornbæk, K., and Tanaka, Y. Clip, Connect, Clone: Combining Application Elements to Build Custom Interfaces for Information Access. UIST 2004, 175.  ",
      "doi": "10.1145/1029632.1029664"
    },
    {
      "text": "Gajos, K.Z., Wobbrock, J.O., and Weld, D.S. Automatically Generating User Interfaces Adapted To Users' Motor and Vision Capabilities. UIST 2007, 231--240.  ",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. The Bubble Cursor : Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. CHI 2005, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Grossman, T., Matejka, J., and Fitzmaurice, G. Chronicle: Capture, Exploration, and Playback of Document Workflow Histories. UIST 2010, 143--152.  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Hartmann, B., Wu, L., Collins, K., and Klemmer, S.R. Programming by a Sample: Rapidly Creating Web Applications with d.mix. UIST 2007, 241--250.  ",
      "doi": "10.1145/1294211.1294254"
    },
    {
      "text": "Hudson, S.E. and Smith, I. Supporting Dynamic Downloadable Appearances in an Extensible User Interface toolkit. UIST 1997, 159--168.  ",
      "doi": "10.1145/263407.263539"
    },
    {
      "text": "Hudson, S.E. and Tanaka, K. Providing Visually Rich Resizable Images for User Interface Components. UIST 2000, 227--235.  ",
      "doi": "10.1145/354401.354783"
    },
    {
      "text": "Hurst, A., Hudson, S.E., and Mankoff, J. Automatically Identifying Targets Users Interact with During Real World Tasks. IUI 2010, 11--20.  ",
      "doi": "10.1145/1719970.1719973"
    },
    {
      "text": "Kumar, R., Talton, J.O., Ahmad, S., and Klemmer, S.R. Bricolage : Example-Based Retargeting for Web Design. CHI 2011, 2197--2206.  ",
      "doi": "10.1145/1978942.1979262"
    },
    {
      "text": "Little, G., Lau, T.A., Cypher, A., Lin, J., Haber, E.M., and Kandogan, E. Koala: Capture, Share, Automate, Personalize Business Processes on the Web. CHI 2007, 943--952.  ",
      "doi": "10.1145/1240624.1240767"
    },
    {
      "text": "Moscovich, T. Contact Area Interaction with Sliding Widgets. UIST, (2009), 13--22.  ",
      "doi": "10.1145/1622176.1622181"
    },
    {
      "text": "Nichols, J., Hua, Z., and Barton, J. Highlight: A System for Creating and Deploying Mobile Web Applications. UIST 2008, 249--258.  ",
      "doi": "10.1145/1449715.1449757"
    },
    {
      "text": "Nichols, J. and Lau, T. Mobilization by Demonstration: Using Traces to Re-author Existing Web Sites. IUI 2008, 149--160.  ",
      "doi": "10.1145/1378773.1378793"
    },
    {
      "text": "Nichols, J., Myers, B. a., and Litwack, K. Improving Automatic Interface Generation with Smart Templates. IUI 2004, 286--288.  ",
      "doi": "10.1145/964442.964507"
    },
    {
      "text": "Olsen, D.R., Hudson, S.E., Verratti, T., Heiner, J.M., and Phelps, M. Implementing Interface Attachments Based on Surface Representations. CHI 1999, 191--198.  ",
      "doi": "10.1145/302979.303038"
    },
    {
      "text": "Olsen, D.R., Taufer, T., and Fails, J.A. ScreenCrayons: Annotating Anything. UIST 2004, 165--174.  ",
      "doi": "10.1145/1029632.1029663"
    },
    {
      "text": "Olwal, A., Feiner, S., and Heyman, S. Rubbing and Tapping for Precise and Rapid Selection on Touch-Screen Displays. CHI 2008, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Pongnumkul, S., Dontcheva, M., Li, W., Wang, J., Bourdev, L., Avidan, S., and Cohen, M.F. Pause-and-Play: Automatically Linking Screencast Video Tutorials with Applications. UIST 2011, 135--144.  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Potter, R. Triggers: Guiding Automation with Pixels to Achieve Data Access. A. Cypher, eds. MIT Press.",
      "doi": ""
    },
    {
      "text": "Savva, M., Kong, N., Chhajta, A., Fei-fei, L., Agrawala, M., and Heer, J. ReVision : Automated Classification , Analysis and Redesign of Chart Images. UIST 2011, 393--402.  ",
      "doi": "10.1145/2047196.2047247"
    },
    {
      "text": "St Amant, R., Lieberman, H., and Potter, R. Visual Generalization in Programming by Example. Communications of the ACM 43, 3 (2000), 107--114.  ",
      "doi": "10.1145/330534.330549"
    },
    {
      "text": "St Amant, R., Riedl, R., Ritter, F.E., and Reifers, A. Image Processing in Cognitive Models with SegMan. HCII 2005.",
      "doi": ""
    },
    {
      "text": "Stuerzlinger, W., Chapuis, O., Phillips, D., and Roussel, N. User Interface Façades: Towards Fully Adaptable User Interfaces. UIST 2006, 309--318.  ",
      "doi": "10.1145/1166253.1166301"
    },
    {
      "text": "Tan, D.S., Meyers, B., and Czerwinski, M. WinCuts : Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. CHI 2004, 1525--1528.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Vogel, D. and Baudisch, P. Shift : A Technique for Operating Pen-Based Interfaces Using Touch. CHI 2007, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Waldner, M., Steinberger, M., Grasset, R., and Schmalstieg, D. Importance-Driven Compositing Window Management: CHI 2011, 959--968.  ",
      "doi": "10.1145/1978942.1979085"
    },
    {
      "text": "Weldon, J. and Shneidermanss, B. Improving the Accuracy of Touch Screens: An Experimental Evaluation of Three Strategies. CHI 1988, 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Wigdor, D., Forlines, C., Baudisch, P., Barnwell, J., and Shen, C. LucidTouch : A See-Through Mobile Device. CHI 2007, 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Yeh, T., Chang, T.-H., and Miller, R.C. Sikuli: Using GUI Screenshots for Search and Automation. UIST 2009, 183--194.  ",
      "doi": "10.1145/1622176.1622213"
    },
    {
      "text": "Yeh, T., Chang, T.-H., Xie, B., Walsh, G., Watkins, I., Wongsuphasawat, K., Huang, M., Davis, L.S., and Bederson, B.B. Creating Contextual Help for GUIs Using Screenshots. UIST 2011, 145--154.  ",
      "doi": "10.1145/2047196.2047214"
    },
    {
      "text": "Zettlemoyer, L.S. and St. Amant, R. A Visual Medium for Programmatic Control of Interactive Applications. CHI 1999, 199--206.  ",
      "doi": "10.1145/302979.303039"
    },
    {
      "text": "Zettlemoyer, L.S., Amant, R.S., and Dulberg, M.S. IBOTS : Agent Control Through the User Interface. IUI 1999.  ",
      "doi": "10.1145/291080.291087"
    }
  ]
}