{
  "doi": "10.1145/2556288.2556976",
  "title": "The usability of CommandMaps in realistic tasks",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2241-2250",
  "year": 2014,
  "badges": [],
  "abstract": "CommandMaps are a promising interface technique that flattens command hierarchies and exploits human spatial memory to provide rapid access to commands. CommandMaps have performed favorably in constrained cued-selection studies, but have not yet been tested in the context of real tasks. In this paper we present two real-world implementations of CommandMaps: one for Microsoft Word and one for an image editing program called Pinta. We use these as our experimental platforms in two experiments. In the first, we show that CommandMaps demonstrate performance and subjective advantages in a realistic task. In the second, we observe naturalistic use of CommandMaps over the course of a week, and gather qualitative data from interviews, questionnaires, and conversations. Our results provide substantial insight into users' reactions to CommandMaps, showing that they are positively received by users and allowing us to provide concrete recommendations to designers regarding when and how they should be implemented in real applications.",
  "authors": [
    {
      "name": "Joey Scarr",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/do/10.1145/contrib-81442602505/rel-imgonly/profilepic.jpg",
      "acmid": "81442602505",
      "orcid": "missing"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Andrea Bunt",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232130",
      "orcid": "0000-0002-7374-7629"
    },
    {
      "name": "Jared E. Cechanowicz",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314481613",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Chapuis, O. and Roussel, N. Metisse is not a 3D desktop! in UIST '05, ACM, NY, USA, 2005, 13--22.  ",
      "doi": "10.1145/1095034.1095038"
    },
    {
      "text": "Cockburn, A. and Gutwin, C. A Predictive Model of Human Performance with Scrolling and Hierarchical Lists. Hum.-Comp. Interaction 24, 3 (2009), 273--314.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Gutwin, C. and Alexander, J. Faster Document Navigation with Space-Filling Thumbnails. in Proc. CHI '06, ACM Press, (2006), 1--10.  ",
      "doi": "10.1145/1124772.1124774"
    },
    {
      "text": "Cockburn, A., Gutwin, C. and Greenberg, S. A Predictive Model of Menu Performance. in Proc. CHI '07, ACM Press, (2007), 627--636.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "Duh, H.B.-L., Tan, G.C.B. and Chen, V.H.-h. Usability evaluation for mobile device: a comparison of laboratory and field tests. in MobileHCI '06, 181--186.  ",
      "doi": "10.1145/1152215.1152254"
    },
    {
      "text": "Gutwin, C. and Cockburn, A. Improving List Revistation with ListMaps. in Proc. AVI '06, 396--403.  ",
      "doi": "10.1145/1133265.1133347"
    },
    {
      "text": "Hart, S. and Staveland, L. Development of NASA-TLX. in Human Mental Workload, 1988, 139--183.",
      "doi": ""
    },
    {
      "text": "Hertzum, M. User testing in industry: A case study of laboratory, workshop, and field tests. in User interfaces for all. Proc. 5. ERCIM workshop, (1999), 59--72.",
      "doi": ""
    },
    {
      "text": "Hochheiser, H. and Shneiderman, B. Performance Benefits of Simultaneous Over Sequential Menus. IJHCI 12, 2 (2000), 173--192.",
      "doi": ""
    },
    {
      "text": "Kabay, M.E. A discussion of the Microsoft office fluent user interface. Ubiquity 2008, March (2008), 1--4.  ",
      "doi": "10.1145/1366313.1361365"
    },
    {
      "text": "Kaptelinin, V. Item Recognition in Menu Selection: The Effect of Practice. in InterCHI '93, 183--184.  ",
      "doi": "10.1145/259964.260196"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G.W., Owen, R.N. and Baudel, T. The Hotbox: efficient access to a large number of menu-items. in CHI '99, ACM, 231--237.  ",
      "doi": "10.1145/302979.303047"
    },
    {
      "text": "Lafreniere, B., Bunt, A., Whissell, J.S., Clarke, C.L.A. and Terry, M. Characterizing large-scale use of a direct manipulation application in the wild. in GI 2010, 11--18. ",
      "doi": "10.5555/1839214.1839218"
    },
    {
      "text": "Mackay, W.E. and Fayard, A.-L. HCI, natural science and design: a framework for triangulation across disciplines. in DIS '97, ACM, Amsterdam, 223--234.  ",
      "doi": "10.1145/263552.263612"
    },
    {
      "text": "MacKenzie, I.S. HCI: An Empirical Research Perspective. Elsevier Science, 2012. ",
      "doi": "10.5555/2501707"
    },
    {
      "text": "Malacria, S., Bailly, G., Harrison, J., Cockburn, A. and Gutwin, C. Promoting hotkey use through rehearsal with ExposeHK. in CHI '13, ACM, Paris, 573--582.  ",
      "doi": "10.1145/2470654.2470735"
    },
    {
      "text": "McGrath, J. Methodology Matters: Doing Research in the Behavioral and Social Sciences. in Readings in Hum.-Comp. Interaction: Towards the Year 2000, 1995. ",
      "doi": "10.5555/212925.212940"
    },
    {
      "text": "Miller, D. The depth/breadth tradeoff in hierarchical computer menus. in Proc. HFES, (1981), 296--300.",
      "doi": ""
    },
    {
      "text": "Newell, A. and Rosenbloom, P.S. Mechanisms of Skill Acquisition and the Law of Practice. in Anderson, J. ed. Cog. Skills & Acquisition, Erlbaum, 1981, 1--55.",
      "doi": ""
    },
    {
      "text": "Nielsen, C.M., Overgaard, M., Pedersen, M.B., Stage, J. and Stenild, S. It's worth the hassle!: the added value of evaluating the usability of mobile systems in the field. in NordiCHI '06, ACM, Oslo, Norway, 2006, 272--280.  ",
      "doi": "10.1145/1182475.1182504"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D. and van Dantzich, M. Data Mountain. In UIST '98, (1998), 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Scarr, J., Cockburn, A. and Gutwin, C. Supporting and exploiting spatial memory in user interfaces. Foundations and Trends® in HCI 6, 1 (2013), 1--84. ",
      "doi": "10.5555/2601957"
    },
    {
      "text": "Scarr, J., Cockburn, A., Gutwin, C. and Bunt, A. Improving command selection with CommandMaps. in CHI '12, ACM, Austin, Texas, USA, 2012, 257--266.  ",
      "doi": "10.1145/2207676.2207713"
    },
    {
      "text": "Shneiderman, B. Direct Manipulation: A Step Beyond Programming Languages (excerpt). in Readings in HCI: A Multidisciplinary Approach, 1987, 461--467. ",
      "doi": "10.5555/58076.58115"
    }
  ]
}