{
  "doi": "10.1145/2556288.2557113",
  "title": "Multi-viewer gesture-based interaction for omni-directional video",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "4077-4086",
  "year": 2014,
  "badges": [],
  "abstract": "Omni-directional video (ODV) is a novel medium that offers viewers a 360º panoramic recording. This type of content will become more common within our living rooms in the near future, seeing that immersive displaying technologies such as 3D television are on the rise. However, little attention has been given to how to interact with ODV content. We present a gesture elicitation study in which we asked users to perform mid-air gestures that they consider to be appropriate for ODV interaction, both for individual as well as collocated settings. We are interested in the gesture variations and adaptations that come forth from individual and collocated usage. To this end, we gathered quantitative and qualitative data by means of observations, motion capture, questionnaires and interviews. This data resulted in a user-defined gesture set for ODV, alongside an in-depth analysis of the variation in gestures we observed during the study.",
  "authors": [
    {
      "name": "Gustavo Alberto Rovelo Ruiz",
      "institution": "Universitat Politècnica de València & Hasselt University - tUL - iMinds (BE), Valencia, Valencia, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959176257",
      "orcid": "missing"
    },
    {
      "name": "Davy Vanacken",
      "institution": "Hasselt University - tUL - iMinds, Diepenbeek, Belgium",
      "img": "/do/10.1145/contrib-81460658146/rel-imgonly/acm_dv.jpg",
      "acmid": "81460658146",
      "orcid": "missing"
    },
    {
      "name": "Kris Luyten",
      "institution": "Hasselt University - tUL - iMinds, Diepenbeek, Belgium",
      "img": "/do/10.1145/contrib-81309493252/rel-imgonly/luyten_k.png",
      "acmid": "81309493252",
      "orcid": "0000-0002-4194-1101"
    },
    {
      "name": "Francisco Abad",
      "institution": "Universitat Politècnica de València, Valencia, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317490787",
      "orcid": "missing"
    },
    {
      "name": "Emilio Camahort",
      "institution": "Universitat Politècnica de València, Valencia, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100070252",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Axel, C., Ravindra, G., and Tsang, O. W. Towards characterizing users' interaction with zoomable video. In Proc. of the ACM Workshop on Social, Adaptive and Personalized Multimedia Interaction and Access, SAPMIA (2010), 21--24.  ",
      "doi": "10.1145/1878061.1878069"
    },
    {
      "text": "Baudel, T., and Beaudouin-Lafon, M. Charade: remote control of objects using free-hand gestures. Communications of the ACM 36, 7 (1993), 28--35.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Benko, H. Beyond 'at surface computing: challenges of depth-aware and curved interfaces. In Proc. of the ACM Int. Conference on Multimedia, MM (2009), 935--944.  ",
      "doi": "10.1145/1631272.1631462"
    },
    {
      "text": "Benko, H., and Wilson, A. D. Multi-point interactions with immersive omnidirectional visualizations in a dome. In Proc. of the ACM Int. Conference on Interactive Tabletops and Surfaces, ITS (2010), 19--28.  ",
      "doi": "10.1145/1936652.1936657"
    },
    {
      "text": "Benko, H., and Wilson, A. D. Pinch-the-sky dome: freehand multi-point interactions with immersive omni-directional data. In CHI Extended Abstracts on Human Factors in Computing Systems (2010), 3045--3050.  ",
      "doi": "10.1145/1753846.1753915"
    },
    {
      "text": "Bleumers, L., den Broeck, W. V., Lievens, B., and Pierson, J. Seeing the bigger picture: a user perspective on 360° TV. In Proc. of the European Conference on Interactive TV and Video, EuroiTV (2012), 115--124.  ",
      "doi": "10.1145/2325616.2325640"
    },
    {
      "text": "Fikkert, W., van der Vet, P., van der Veer, G., and Nijholt, A. Gestures for large display control. In Proc. of the Int. Gesture Workshop, GW (2010), 245--256.  ",
      "doi": "10.1007/978-3-642-12553-9_22"
    },
    {
      "text": "Freeman, W. T., and Weissman, C. D. Television control by hand gestures. In Proc. of the Int. Workshop on Automatic Face and Gesture Recognition, FG (1995), 179--183.",
      "doi": ""
    },
    {
      "text": "Grandhi, S. A., Joue, G., and Mittelberg, I. Understanding naturalness and intuitiveness in gesture production: insights for touchless gestural interfaces. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2011), 821--824.  ",
      "doi": "10.1145/1978942.1979061"
    },
    {
      "text": "Haythornthwaite, C., and Wellman, B. Work, friendship, and media use for information exchange in a networked organization. Journal of the American Society for Information Science 49, 12 (1998), 1101--1114.  ",
      "doi": "10.5555/288155.288176"
    },
    {
      "text": "Henze, N., Löcken, A., Boll, S., Hesselmann, T., and Pielot, M. Free-hand gestures for music playback: deriving gestures with a user-centred process. In Proc. of the Int. Conference on Mobile and Ubiquitous Multimedia, MUM (2010), 1--10.  ",
      "doi": "10.1145/1899475.1899491"
    },
    {
      "text": "Hespanhol, L., Tomitsch, M., Grace, K., Collins, A., and Kay, J. Investigating intuitiveness and effectiveness of gestures for free spatial interaction with large displays. In Proc. of the Int. Symposium on Pervasive Displays, PerDis (2012), 1--6.  ",
      "doi": "10.1145/2307798.2307804"
    },
    {
      "text": "Hinrichs, U., and Carpendale, S. Gestures in the wild: Studying multi-touch gesture sequences on interactive tabletop exhibits. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2011), 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Hoggan, E., Williamson, J., Oulasvirta, A., Nacenta, M., Kristensson, P. O., and Lehtiö, A. Multi-touch rotation gestures: performance and ergonomics. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2013), 3047--3050.  ",
      "doi": "10.1145/2470654.2481423"
    },
    {
      "text": "Jones, B., Benko, H., Ofek, E., and Wilson, A. IllumiRoom: peripheral projected illusions for interactive experiences. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2013), 869--878.  ",
      "doi": "10.1145/2470654.2466112"
    },
    {
      "text": "Macq, J.-F., Verzijp, N., Aerts, M., Vandeputte, F., and Six, E. Demo: omnidirectional video navigation on a tablet pc using a camera-based orientation tracker. In Proc. of the ACM/IEEE Int. Conference on Distributed Smart Cameras, ICDSC (2011), 1--2.",
      "doi": ""
    },
    {
      "text": "Microsoft. Kinect for Windows Human Interface Guidelines v1.8.0 (2013). Retrieved Jan. 2014, from: msdn.microsoft.com/en-us/library/jj663791.aspx.",
      "doi": ""
    },
    {
      "text": "Morris, M. R., Wobbrock, J. O., and Wilson, A. D. Understanding users' preferences for surface gestures. In Proc. of Graphics Interface, GI (2010), 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Nancel, M., Wagner, J., Pietriga, E., Chapuis, O., and Mackay, W. Mid-air pan-and-zoom on wall-sized displays. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2011), 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "Neng, L. A. R., and Chambel, T. Get around 360° hypervideo. In Proc. of the Int. Academic MindTrek Conference, MindTrek (2010), 119--122.  ",
      "doi": "10.1145/1930488.1930512"
    },
    {
      "text": "Nielsen, M., Störring, M., Moeslund, T. B., and Granum, E. A procedure for developing intuitive and ergonomic gesture interfaces for HCI. Gesture Based Communication in Human-Computer Interaction 2915 (2004), 409--420.",
      "doi": ""
    },
    {
      "text": "Park, W., and Han, S. H. Intuitive multi-touch gestures for mobile web browsers. Interacting with Computers 25, 5 (2013), 335--350.",
      "doi": ""
    },
    {
      "text": "Peltonen, P., Kurvinen, E., Salovaara, A., Jacucci, G., Ilmonen, T., Evans, J., Oulasvirta, A., and Saarikko, P. It's mine, don't touch!: interactions at a large multi-touch display in a city centre. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2008), 1285--1294.  ",
      "doi": "10.1145/1357054.1357255"
    },
    {
      "text": "Stellmach, S., Jttner, M., Nywelt, C., Schneider, J., and Dachselt, R. Investigating freehand pan and zoom. In Mensch & Computer (2012), 303--312.",
      "doi": ""
    },
    {
      "text": "Walter, R., Bailly, G., and Müller, J. StrikeAPose: revealing mid-air gestures on public displays. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2013), 841--850.  ",
      "doi": "10.1145/2470654.2470774"
    },
    {
      "text": "Wobbrock, J. O., Aung, H. H., Rothrock, B., and Myers, B. A. Maximizing the guessability of symbolic input. In CHI Extended Abstracts on Human Factors in Computing Systems (2005), 1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Wobbrock, J. O., Morris, M. R., and Wilson, A. D. User-defined gestures for surface computing. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems, CHI (2009), 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Zoric, G., Engström, A., Barkhuus, L., Hidalgo, J. R., and Kochale, A. Gesture interaction with rich TV content in the social setting. In CHI workshop on Exploring and Enhancing the User Experience for TV, TVUX (2013).",
      "doi": ""
    }
  ]
}