{
  "doi": "10.1145/2556288.2557241",
  "title": "Extracting references between text and charts via crowdsourcing",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "31-40",
  "year": 2014,
  "badges": [],
  "abstract": "News articles, reports, blog posts and academic papers often include graphical charts that serve to visually reinforce arguments presented in the text. To help readers better understand the relation between the text and the chart, we present a crowdsourcing pipeline to extract the references between them. Specifically, we give crowd workers paragraph-chart pairs and ask them to select text phrases as well as the corresponding visual marks in the chart. We then apply automated clustering and merging techniques to unify the references generated by multiple workers into a single set. Comparing the crowdsourced references to a set of gold standard references using a distance measure based on the F1 score, we find that the average distance between the raw set of references produced by a single worker and the gold standard is 0.54 (out of a max of 1.0). When we apply clustering and merging techniques the average distance between the unified set of references and the gold standard reduces to 0.39; an improvement of 27%. We conclude with an interactive document viewing application that uses the extracted references; readers can select phrases in the text and the system highlights the related marks in the chart.",
  "tags": [
    "crowdsourcing",
    "interactive documents",
    "visualization"
  ],
  "authors": [
    {
      "name": "Nicholas Kong",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489071",
      "orcid": "missing"
    },
    {
      "name": "Marti A. Hearst",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahmad, S., Battle, A., Malkani, Z., and Kamvar, S. The jabberwocky programming environment for structured social computing. In Proc. of UIST (2011), 53--64.  ",
      "doi": "10.1145/2047196.2047203"
    },
    {
      "text": "Bernstein, M. S., Little, G., Miller, R. C., Hartmann, B., Ackerman, M. S., Karger, D. R., Crowell, D., and Panovich, K. Soylent: A word processor with a crowd inside. In Proc. of UIST (2010), 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Bernstein, M. S., Teevan, J., Dumais, S., Liebling, D., and Horvitz, E. Direct answers for search queries in the long tail. In Proc. of SIGCHI (2012), 237--246.  ",
      "doi": "10.1145/2207676.2207710"
    },
    {
      "text": "Bird, S. NLTK: The natural language toolkit. In Proc. of COLING/ACL Interactive Presentations (2006), 69--72.  ",
      "doi": "10.3115/1225403.1225421"
    },
    {
      "text": "Cairo, A. The Functional Art: An introduction to information graphics and visualization. New Riders, 2012. ",
      "doi": "10.5555/2432449"
    },
    {
      "text": "Callison-Burch, C., and Dredze, M. Creating speech and language data with amazon's mechanical turk. In Proc. of NAACL HLT Workshop on Creating Speech and Language with Amazon's Mechanical Turk (2010), 1--12. ",
      "doi": "10.5555/1866696.1866697"
    },
    {
      "text": "Card, S. K., Mackinlay, J. D., and Shneiderman, B., Eds. Readings in information visualization: Using vision to think. Morgan Kaufmann Publishers Inc., 1999. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Chilton, L. B., Little, G., Edge, D., Weld, D. S., and Landay, J. A. Cascade: Crowdsourcing taxonomy creation. In Proc. of SIGCHI (2013), 1999--2008.  ",
      "doi": "10.1145/2470654.2466265"
    },
    {
      "text": "Cleveland, W. S. Elements of graphing data. ",
      "doi": "10.5555/4084"
    },
    {
      "text": "Economist Graphic Detail. http://www.economist.com/blogs/graphicdetail. Retrieved Sep 17, 2013.",
      "doi": ""
    },
    {
      "text": "Guardian DataBlog. http://www.theguardian.com/datablog. Retrieved Sep 17, 2013.",
      "doi": ""
    },
    {
      "text": "Heer, J., and Bostock, M. Crowdsourcing graphical perception: Using mechanical turk to assess visualization design. In Proc. of SIGCHI (2010), 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Hsueh, P.-Y., Melville, P., and Sindhwani, V. Data quality from crowdsourcing: A study of annotation selection criteria. In Proc. of NAACL HLT Workshop on Active Learning for Natural Language Processing (2009), 27--35. ",
      "doi": "10.5555/1564131.1564137"
    },
    {
      "text": "Hullman, J., Adar, E., and Shah, P. The impact of social information on visual judgments. In Proc. of SIGCHI (2011), 1461--1470.  ",
      "doi": "10.1145/1978942.1979157"
    },
    {
      "text": "Hullman, J., and Diakopoulos, N. Visualization rhetoric: Framing effects in narrative visualization. IEEE TVCG 17, 12 (2011), 2231--2240.  ",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Hullman, J., Diakopoulos, N., and Adar, E. Contextifier: Automatic generation of annotated stock visualizations. In Proc. of SIGCHI (2013), 2707--2716.  ",
      "doi": "10.1145/2470654.2481374"
    },
    {
      "text": "Kandogan, E. Just-in-time annotation of clusters, outliers, and trends in point-based data visualizations. In IEEE VAST (2012), 73--82.  ",
      "doi": "10.1109/VAST.2012.6400487"
    },
    {
      "text": "Kittur, A., Smus, B., Khamkar, S., and Kraut, R. E. Crowdforge: Crowdsourcing complex work. In Proc. of UIST (2011), 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Kong, N., and Agrawala, M. Graphical overlays: Using layered elements to aid chart reading. IEEE TVCG 18, 12 (2012), 2631--2638.",
      "doi": ""
    },
    {
      "text": "Kong, N., Heer, J., and Agrawala, M. Perceptual guidelines for creating rectangular treemaps. IEEE TVCG 16, 6 (2010), 990--998.  ",
      "doi": "10.1109/TVCG.2010.186"
    },
    {
      "text": "Kulkarni, A., Can, M., and Hartmann, B. Collaboratively crowdsourcing workflows with turkomatic. In Proc. CSCW (2012), 1003--1012.  ",
      "doi": "10.1145/2145204.2145354"
    },
    {
      "text": "Le, J., Edmonds, A., Hester, V., and Biewald, L. Ensuring quality in crowdsourced search relevance evaluation: The effects of training question distribution. In SIGIR 2010 workshop on crowdsourcing for search evaluation (2010), 21--26.",
      "doi": ""
    },
    {
      "text": "Little, G., Chilton, L. B., Goldman, M., and Miller, R. C. TurKit: Human computation algorithms on mechanical turk. In Proc. of UIST (2010), 57--66.  ",
      "doi": "10.1145/1866029.1866040"
    },
    {
      "text": "Manning, C. D., Raghavan, P., and Schütze, H. Introduction to Information Retrieval. Cambridge University Press, 2008. ",
      "doi": "10.5555/1394399"
    },
    {
      "text": "Mayfield, J., Lawrie, D., McNamee, P., and Oard, D. Building a cross-language entity linking collection in twenty-one languages. In Multilingual and Multimodal Information Access Evaluation. Springer, 2011, 3--13. ",
      "doi": "10.5555/2045274.2045279"
    },
    {
      "text": "Nakov, P. Noun compound interpretation using paraphrasing verbs: Feasibility study. In Artificial Intelligence: Methodology, Systems, and Applications. Springer, 2008, 103--117.  ",
      "doi": "10.1007/978-3-540-85776-1_10"
    },
    {
      "text": "Oleson, D., Sorokin, A., Laughlin, G., Hester, V., Le, J., and Biewald, L. Programmatic gold: Targeted and scalable quality assurance in crowdsourcing. Proc. of HComp (2011).",
      "doi": "10.5555/2908698.2908706"
    },
    {
      "text": "Pew Research. http://www.pewresearch.org/. Retrieved Sep 17, 2013.",
      "doi": ""
    },
    {
      "text": "Savva, M., Kong, N., Chhajta, A., Fei-Fei, L., Agrawala, M., and Heer, J. Revision: Automated classification, analysis and redesign of chart images. In Proc. of UIST (2011), 393--402.  ",
      "doi": "10.1145/2047196.2047247"
    },
    {
      "text": "Segel, E., and Heer, J. Narrative visualization: Telling stories with data. IEEE TVCG 16, 6 (2010), 1139--1148.  ",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Snow, R., O'Connor, B., Jurafsky, D., and Ng, A. Y. Cheap and fast - but is it good?: Evaluating non-expert annotations for natural language tasks. In Proc. of EMNLP (2008), 254--263. ",
      "doi": "10.5555/1613715.1613751"
    },
    {
      "text": "Substance Abuse and Mental Health Services Administration. http://www.samhsa.gov/. Retrieved Sep 17, 2013.",
      "doi": ""
    },
    {
      "text": "Willett, W., Heer, J., and Agrawala, M. Strategies for crowdsourcing social data analysis. In Proc. of SIGCHI (2012), 227--236.  ",
      "doi": "10.1145/2207676.2207709"
    }
  ]
}