{
  "doi": "10.1145/2556288.2557392",
  "title": "Towards automatic experimentation of educational knowledge",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3349-3358",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present a general automatic experimentation and hypothesis generation framework that utilizes a large set of users to explore the effects of different parts of an intervention parameter space on any objective function. We also incorporate importance sampling, allowing us to run these automatic experiments even if we cannot give out the exact intervention distributions that we want. To show the utility of this framework, we present an implementation in the domain of fractions and numberlines, using an online educational game as the source of players. Our system is able to automatically explore the parameter space and generate hypotheses about what types of numberlines lead to maximal short-term transfer; testing on a separate dataset shows the most promising hypotheses are valid. We briefly discuss our results in the context of the wider educational literature, showing that one of our results is not explained by current research on multiple fraction representations, thus proving our ability to generate potentially interesting hypotheses to test.",
  "tags": [
    "games",
    "datamining",
    "education"
  ],
  "authors": [
    {
      "name": "Yun-En Liu",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81464664813",
      "orcid": "missing"
    },
    {
      "name": "Travis Mandel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500657257",
      "orcid": "missing"
    },
    {
      "name": "Emma Brunskill",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443595937",
      "orcid": "missing"
    },
    {
      "name": "Zoran Popović",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620346",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ainsworth, S. E., Bibby, P. A., and Wood, D. J. Analysing the costs and benefits of multi-representational learning environments. Learning with multiple representations (1998), 120--134.",
      "doi": ""
    },
    {
      "text": "Andersen, E., Liu, Y.-E., Snider, R., Szeto, R., Cooper, S., and Popović, Z. On the harmfulness of secondary game objectives. In FDG (2011).  ",
      "doi": "10.1145/2159365.2159370"
    },
    {
      "text": "Andersen, E., Liu, Y.-E., Snider, R., Szeto, R., and Popović, Z. Placing a value on aesthetics in online casual games. In CHI (2011).  ",
      "doi": "10.1145/1978942.1979131"
    },
    {
      "text": "Andersen, E., O'Rourke, E., Liu, Y.-E., Snider, R., Lowdermilk, J., Truong, D., Cooper, S., and Popović, Z. The impact of tutorials on games of varying complexity. In CHI (2012).  ",
      "doi": "10.1145/2207676.2207687"
    },
    {
      "text": "Anderson, J. R., Corbett, A. T., Koedinger, K. R., and Pelletier, R. Cognitive tutors: Lessons learned. The Journal of the Learning Sciences 4, 2 (1995), 167--207.",
      "doi": ""
    },
    {
      "text": "Ansari, D. Effects of development and enculturation on number representation in the brain. Nature Reviews Neuroscience 9, 4 (2008), 278--291.",
      "doi": ""
    },
    {
      "text": "Arbreton, A. Student goal orientation and help-seeking strategy use.",
      "doi": ""
    },
    {
      "text": "Berman, F., Fox, G., and Hey, A. J. Grid computing: making the global infrastructure a reality, vol. 2. Wiley. com, 2003. ",
      "doi": "10.5555/861919"
    },
    {
      "text": "BrainPOP. http://www.brainpop.com/.",
      "doi": ""
    },
    {
      "text": "Buhrmester, M., Kwang, T., and Gosling, S. D. Amazon's mechanical turk: A new source of inexpensive, yet high-quality, data Perspectives on Psychological Science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Churchill, Gilbert A., J. A paradigm for developing better measures of marketing constructs. Journal of Marketing Research 16, 1 (1979), pp. 64--73.",
      "doi": ""
    },
    {
      "text": "Efron, B., and Tibshirani, R. An introduction to the bootstrap, vol. 57. CRC press, 1993.",
      "doi": ""
    },
    {
      "text": "Gagatsis, A., and Elia, I. The effects of different modes of representations on mathematical problem solving. In IGPME, vol. 2 (2004), 447--454.",
      "doi": ""
    },
    {
      "text": "Hastings, W. K. Monte carlo sampling methods using markov chains and their applications. Biometrika 57, 1 (1970), 97--109.",
      "doi": ""
    },
    {
      "text": "Henrich, J., Heine, S. J., and Norenzayan, A. The weirdest people in the world. Behavioral and Brain Sciences 33, 2--3 (2010), 61--83.",
      "doi": ""
    },
    {
      "text": "Hume, G., Michael, J., Rovick, A., and Evens, M. Hinting as a tactic in one-on-one tutoring. Journal of the Learning Sciences 5, 1 (1996), 23--49.",
      "doi": ""
    },
    {
      "text": "King, R. D., Rowland, J., Oliver, S. G., Young, M., Aubrey, W., Byrne, E., Liakata, M., Markham, M., Pir, P., Soldatova, L. N., Sparkes, A., Whelan, K. E., and Clare, A. The automation of science. Science 324, 5923 (2009), 85--89.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with mechanical turk. In CHI (2008).  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kohavi, R., Crook, T., Longbotham, R., Frasca, B., Henne, R., Ferres, J. L., and Melamed, T. Online experimentation at microsoft. In Third Workshop on Data Mining Case Studies and Practice Prize (2009).",
      "doi": ""
    },
    {
      "text": "Kohavi, R., Henne, R. M., and Sommerfield, D. Practical guide to controlled experiments on the web: listen to your customers not to the hippo. In KDD (2007).  ",
      "doi": "10.1145/1281192.1281295"
    },
    {
      "text": "Langley, P. Scientific discovery: Computational explorations of the creative processes. MIT press, 1987. ",
      "doi": "10.5555/29379"
    },
    {
      "text": "Larson, C. N. Locating proper fractions on number lines: Effect of length and equivalence. School Science and Mathematics 80, 5 (1980), 423--428.",
      "doi": ""
    },
    {
      "text": "Lee, Y., Buchanan, B., and Aronis, J. Knowledge-based learning in exploratory science: Learning rules to predict rodent carcinogenicity. Machine Learning 30, 2--3 (1998), 217--240.  ",
      "doi": "10.1023/A%3A1007404308006"
    },
    {
      "text": "Lesh, R., Post, T., and Behr, M. Representations and translations among representations in mathematics learning and problem solving. Problems of representation in the teaching and learning of mathematics (1987), 33--40.",
      "doi": ""
    },
    {
      "text": "Li, L., Chu, W., Langford, J., and Schapire, R. E. A contextual-bandit approach to personalized news article recommendation. In Proceedings of the 19th International Conference on World Wide Web, WWW '10, ACM (New York, NY, USA, 2010), 661--670.  ",
      "doi": "10.1145/1772690.1772758"
    },
    {
      "text": "Lomas, D., Patel, K., Forlizzi, J. L., and Koedinger, K. R. Optimizing challenge in an educational game using large-scale design experiments. In CHI (2013).  ",
      "doi": "10.1145/2470654.2470668"
    },
    {
      "text": "Moss, J., and Case, R. Developing children's understanding of the rational numbers: A new model and an experimental curriculum. Journal for Research in Mathematics Education 30, 2 (1999), pp. 122--147.",
      "doi": ""
    },
    {
      "text": "Quinlan, J. R. C4. 5: programs for machine learning, vol. 1. Morgan kaufmann, 1993. ",
      "doi": "10.5555/152181"
    },
    {
      "text": "Rau, M. A., Aleven, V., and Rummel, N. Intelligent tutoring systems with multiple representations and self-explanation prompts support learning of fractions. In AIED (2009). ",
      "doi": "10.5555/1659450.1659517"
    },
    {
      "text": "Siegler, R. S., Thompson, C. A., and Schneider, M. An integrated theory of whole number and fractions development. Cognitive Psychology 62, 4.",
      "doi": ""
    },
    {
      "text": "Sierpinska, A. On understanding the notion of function. The concept of function: Aspects of epistemology and pedagogy 25 (1992), 23--58.",
      "doi": ""
    },
    {
      "text": "Singh, K., and Xie, M. Bootstrap: A statistical method, 2008.",
      "doi": ""
    },
    {
      "text": "Stamper, J. C., Lomas, D., Ching, D., Ritter, S., Koedinger, K. R., and Steinhart, J. The rise of the super experiment. In EDM (2012), 196--200.",
      "doi": ""
    }
  ]
}