{
  "doi": "10.1145/2556288.2556981",
  "title": "Non-intrusive tongue machine interface",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2555-2558",
  "year": 2014,
  "badges": [],
  "abstract": "There has been recent interest in designing systems that use the tongue as an input interface. Prior work however either require surgical procedures or in-mouth sensor placements. In this paper, we introduce TongueSee, a non-intrusive tongue machine interface that can recognize a rich set of tongue gestures using electromyography (EMG) signals from the surface of the skin. We demonstrate the feasibility and robustness of TongueSee with experimental studies to classify six tongue gestures across eight participants. TongueSee achieves a classification accuracy of 94.17% and a false positive probability of 0.000358 per second using three-protrusion preamble design.",
  "authors": [
    {
      "name": "Qiao Zhang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959349057",
      "orcid": "missing"
    },
    {
      "name": "Shyamnath Gollakota",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81336489396/rel-imgonly/81336489396.jpg",
      "acmid": "81336489396",
      "orcid": "missing"
    },
    {
      "name": "Ben Taskar",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100453688",
      "orcid": "missing"
    },
    {
      "name": "Raj P.N. Rao",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100591880",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Krishnamurthy, G., and Ghovanloo, M. Tongue drive: A tongue operated magnetic sensor based wireless assistive technology for people with severe disabilities. In Circuits and Systems, 2006. ISCAS 2006. Proceedings. 2006 IEEE International Symposium on, IEEE (2006), 4 pp.",
      "doi": ""
    },
    {
      "text": "Lee, B., Cripps, R., Fitzharris, M., and Wing, P. The global map for traumatic spinal cord injury epidemiology: update 2011, global incidence rate. Spinal cord (2013).",
      "doi": ""
    },
    {
      "text": "Saponas, T. S., Kelly, D., Parviz, B. A., and Tan, D. S. Optically sensing tongue gestures for computer input. In UIST '09 (2009), 177--180.  ",
      "doi": "10.1145/1622176.1622209"
    },
    {
      "text": "Saponas, T. S., Tan, D. S., Morris, D., and Balakrishnan, R. Demonstrating the feasibility of using forearm electromyography for muscle-computer interfaces (2008).",
      "doi": ""
    },
    {
      "text": "Sasaki, M., Arakawa, T., Nakayama, A., Obinata, G., and Yamaguchi, M. Estimation of tongue movement based on suprahyoid muscle activity (2011). 433--438.",
      "doi": ""
    },
    {
      "text": "Sasaki, M., Onishi, K., Arakawa, T., Nakayama, A., Stefanov, D., and Yamaguchi, M. Real-time estimation of tongue movement based on suprahyoid muscle activity. In Engineering in Medicine and Biology Society (EMBC), 2013 35th Annual International Conference of the IEEE (2013), 4605--4608.",
      "doi": ""
    }
  ]
}