{
  "doi": "10.1145/2556288.2557287",
  "title": "Personalisation and privacy in future pervasive display networks",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2357-2366",
  "year": 2014,
  "badges": [],
  "abstract": "There is increasing interest in using digital signage to deliver highly personalised content. However, display personalization presents a number of architectural design challenges in particular, how best to provide personalisation without unduly compromising viewers' privacy. While previous research has focused on understanding specific elements of the overall vision, our work presents details of the first significant attempt at a system that integrates future pervasive display networks and mobile devices to support display personalisation. We describe a series of usage models and design goals for display personalisation and then present Tacita, a system that supports these models and goals. Our architecture includes mobile, display and cloud-based elements and provides comprehensive personalisation features while preventing the creation of user profiles within the display infrastructure, thus helping to preserve users' privacy. An initial evaluation of our prototype implementation of the architecture is also included and demonstrates the viability of the Tacita approach.",
  "authors": [
    {
      "name": "Nigel Davies",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81100185417/rel-imgonly/nigel.jpg",
      "acmid": "81100185417",
      "orcid": "missing"
    },
    {
      "name": "Marc Langheinrich",
      "institution": "University of Lugano, Lugano, TI, Switzerland",
      "img": "/do/10.1145/contrib-81100638267/rel-imgonly/langheinrichcolo.jpeg",
      "acmid": "81100638267",
      "orcid": "missing"
    },
    {
      "name": "Sarah Clinch",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81488646780/rel-imgonly/sarah.png",
      "acmid": "81488646780",
      "orcid": "missing"
    },
    {
      "name": "Ivan Elhart",
      "institution": "University of Lugano, Lugano, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488670195",
      "orcid": "missing"
    },
    {
      "name": "Adrian Friday",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533743",
      "orcid": "missing"
    },
    {
      "name": "Thomas Kubitza",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom & University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470655251",
      "orcid": "missing"
    },
    {
      "name": "Bholanathsingh Surajbali",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351606663",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Addlesee, M., Curwen, R., Hodges, S., Newman, J., Steggles, P., Ward, A., and Hopper, A. Implementing a sentient computing system. Computer 34, 8 (Aug. 2001), 50--56.  ",
      "doi": "10.1109/2.940013"
    },
    {
      "text": "Beresford, A., and Stajano, F. Location privacy in pervasive computing. Pervasive Computing 2, 1 (2003).  ",
      "doi": "10.1109/MPRV.2003.1186725"
    },
    {
      "text": "Clinch, S., Harkes, J., Friday, A., Davies, N., and Satyanarayanan, M. How close is close enough' understanding the role of cloudlets in supporting display appropriation by mobile users. In PerCom (2012).",
      "doi": ""
    },
    {
      "text": "Cox, D., Kindratenko, V., and Pointer, D. Intellibadge: Towards providing location-aware value-added services at academic conferences. In UbiComp (2003).",
      "doi": ""
    },
    {
      "text": "Davies, N., Friday, A., Newman, P., Rutlidge, S., and Storz, O. Using bluetooth device names to support interaction in smart environments. In Mobisys (2009).  ",
      "doi": "10.1145/1555816.1555832"
    },
    {
      "text": "Dearman, D., and Truong, K. BlueTone: A framework for interacting with public displays using dual-tone multi-frequency through bluetooth. In UbiComp (2009).  ",
      "doi": "10.1145/1620545.1620561"
    },
    {
      "text": "Duckham, M., and Kulik, L. A formal model of obfuscation and negotiation for location privacy. In Pervasive (2005).  ",
      "doi": "10.1007/11428572_10"
    },
    {
      "text": "Finney, J., Wade, S., Davies, N., and Friday, A. Flump: The FLexible Ubiquitous Monitor Project. In Cabernet Radicals Workshop (1996).",
      "doi": ""
    },
    {
      "text": "Friday, A., Davies, N., and Efstratiou, C. Reflections on long-term experiments with public displays. Computer, IEEE 45, 5 (2012).  ",
      "doi": "10.1109/MC.2012.155"
    },
    {
      "text": "Goffman, E. Behavior in Public Places. Glencoe, 1963.",
      "doi": ""
    },
    {
      "text": "José, R., Otero, N., Izadi, S., and Harper, R. Instant Places: Using Bluetooth for situated interaction in public displays. Pervasive Computing 7 (2008).  ",
      "doi": "10.1109/MPRV.2008.74"
    },
    {
      "text": "José, R., Pinto, H., Silva, B., and Melro, A. Instant places: Using pins and posters as paradigms for content publication for situated displays. Computer Graphics and Applications, IEEE (2013).  ",
      "doi": "10.1109/MCG.2013.16"
    },
    {
      "text": "Krumm, J. A survey of computational location privacy. Personal Ubiquitous Computing 13, 6 (2009).  ",
      "doi": "10.1007/s00779-008-0212-5"
    },
    {
      "text": "Kubitza, T., Clinch, S., Davies, N., and Langheinrich, M. Using mobile devices to personalize pervasive displays. ACM SIGMOBILE Mobile Computing and Communications Review 16, 4 (October 2012), 26--27.  ",
      "doi": "10.1145/2436196.2436211"
    },
    {
      "text": "Langheinrich, M. A privacy awareness system for ubiquitous computing environments. In UbiComp (2002). ",
      "doi": "10.5555/647988.741491"
    },
    {
      "text": "McCarthy, J. F. Using public displays to create conversation opportunities. In Public, Community and Situated Displays (Workshop at CSCW 2002) (2002).",
      "doi": ""
    },
    {
      "text": "Müller, J., Wilmsmann, D., Exeler, J., Buzeck, M., Schmidt, A., Jay, T., and Krüger, A. Display blindness: The effect of expectations on attention towards digital signage. In Pervasive (2009).",
      "doi": "10.1007/978-3-642-01516-8_1"
    },
    {
      "text": "Roecker, C. Providing personalized privacy support in public places. In 3rd Conf. on Privacy, Security, and Trust (2005).",
      "doi": ""
    },
    {
      "text": "Shariff, M., Payne, T., and David, E. Public display advertising based on bluetooth device presence. In MIRW (2006).",
      "doi": ""
    },
    {
      "text": "Shoemaker, G. B. D., and Inkpen, K. M. Single display privacyware: Augmenting public displays with private information. In CHI (2001).  ",
      "doi": "10.1145/365024.365349"
    },
    {
      "text": "Strohbach, M., Kovacs, E., and Martin, M. Towards pervasively adapting display networks. In 1st International Workshop on Pervasive Advertising (at Pervasive) (2009).",
      "doi": ""
    },
    {
      "text": "Villar, N., Schmidt, A., Kortuem, G., and Gellersen, H.-W. Interacting with proactive public displays. Computers & Graphics 27, 6 (2003).",
      "doi": ""
    },
    {
      "text": "Weiser, M. The Computer for the 21st Century. Scientific American 265, 3 (1991).",
      "doi": ""
    }
  ]
}