{
  "doi": "10.1145/2556288.2557096",
  "title": "LinearDragger: a Linear Selector for One-finger Target Acquisition",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2607-2616",
  "year": 2014,
  "badges": [],
  "abstract": "Touch input is increasingly popular nowadays, especially for mobile devices such as smartphones and tablet computers. However, the human finger has considerably large fingertip size and finger input is imprecise. As such, acquiring small targets on a touch screen is still a challenging task. In this paper, we present the LinearDragger, a new and integrated one-finger target acquisition technique for small and clustered targets. The proposed method has three advantages. First, it allows users to select targets in dense clustered groups easily with a single touch-drag-release operation. Second, it maps the 2D selection problem into a more precise 1D selection problem, which is independent of the target distribution. Third, it avoids finger occlusion and does not create visual distraction. As a result, it is particularly suitable for applications with dense targets and rich visual elements. Results of our controlled experiments show that when selecting small targets, LinearDragger takes about 70% and 30% less selection time than target acquisition without using any techniques and with the state-of-the-art target acquisition technique that involves a single touch operation, respectively, while maintaining a reasonable error rate.",
  "authors": [
    {
      "name": "Oscar Kin-Chung Au",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451593010",
      "orcid": "missing"
    },
    {
      "name": "Xiaojun Su",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959033857",
      "orcid": "missing"
    },
    {
      "name": "Rynson W.H. Lau",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451597133",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albinsson, P.-A., and Zhai, S. High precision touch screen interaction. In Proc. ACM SIGCHI (2003), 105--112.  ",
      "doi": "10.1145/642611.642631"
    },
    {
      "text": "Baudisch, P., Zotov, A., Cutrell, E., and Hinckley, K. Starburst: a target expansion algorithm for non-uniform target distributions. In Proc. Working Conference on Advanced Visual Interfaces (2008), 129--137.  ",
      "doi": "10.1145/1385569.1385592"
    },
    {
      "text": "Benko, H., Wilson, A., and Baudisch, P. Precise selection techniques for multi-touch screens. In Proc. ACM SIGCHI (2006), 1263--1272.  ",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Bi, X., Li, Y., and Zhai, S. Fitts law: Modeling finger touch with fitts' law. In Proc. ACM SIGCHI (2013), 1363--1372.  ",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Blanch, R., Guiard, Y., and Beaudouin-Lafon, M. Semantic pointing: improving target acquisition with control-display ratio adaptation. In Proc. ACM SIGCHI (2004), 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Chapuis, O., Labrune, J.-B., and Pietriga, E. Dynaspot: speed-dependent area cursor. In Proc. ACM SIGCHI (2009), 1391--1400.  ",
      "doi": "10.1145/1518701.1518911"
    },
    {
      "text": "Fekete, J.-D., and Plaisant, C. Excentric labeling: Dynamic neighborhood labeling for data visualization. In Proc. ACM SIGCHI (1999), 512--519.  ",
      "doi": "10.1145/302979.303148"
    },
    {
      "text": "Findlater, L., Jansen, A., Shinohara, K., Dixon, M., Kamb, P., Rakita, J., and Wobbrock, J. Enhanced area cursors: reducing fine pointing demands for people with motor impairments. In Proc. ACM UIST (2010), 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Grossman, T., and Balakrishnan, R. The bubble cursor: enhancing target acquisition by dynamic resizing of the cursor's activation area. In Proc. ACM SIGCHI (2005), 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Gutwin, C. Improving focus targeting in interactive fisheye views. In Proc. ACM SIGCHI (2002), 267--274.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "Karlson, A., and Bederson, B. Thumbspace: generalized one-handed input for touchscreen-based mobile devices. In Proc. INTERACT, Springer (2007), 324--338. ",
      "doi": "10.5555/1776994.1777034"
    },
    {
      "text": "Käser, D., Agrawala, M., and Pauly, M. Fingerglass: efficient multiscale interaction on multitouch screens. In Proc. ACM SIGCHI (2011), 1601--1610.  ",
      "doi": "10.1145/1978942.1979175"
    },
    {
      "text": "Kopper, R., Bacim, F., and Bowman, D. Rapid and accurate 3D selection by progressive refinement. In Proc. IEEE Symp. 3D User Interfaces (2011), 67--74. ",
      "doi": "10.5555/2013881.2014213"
    },
    {
      "text": "Moscovich, T. Contact area interaction with sliding widgets. In Proc. ACM UIST (2009), 13--22.  ",
      "doi": "10.1145/1622176.1622181"
    },
    {
      "text": "Moscovich, T., and Hughes, J. Multi--nger cursor techniques. In Proc. Graphics Interface (2006), 1--7. ",
      "doi": "10.5555/1143079.1143081"
    },
    {
      "text": "Olwal, A., Feiner, S., and Heyman, S. Rubbing and tapping for precise and rapid selection on touch-screen displays. In Proc. ACM SIGCHI (2008), 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Parhi, P., Karlson, A., and Bederson, B. Target size study for one-handed thumb use on small touchscreen devices. In Proc. MobileHCI (2006), 203--210.  ",
      "doi": "10.1145/1152215.1152260"
    },
    {
      "text": "Parker, J., Mandryk, R., Nunes, M., and Inkpen, K. Improving target acquisition for pointing input on tabletop displays. In Proc. INTERACT (2005), 80--93.  ",
      "doi": "10.1007/11555261_10"
    },
    {
      "text": "Pietriga, E., and Appert, C. Sigma lenses: focus-context transitions combining space, time and translucence. In Proc. ACM SIGCHI (2008), 1343--1352.  ",
      "doi": "10.1145/1357054.1357264"
    },
    {
      "text": "Potter, R., Weldon, L., and Shneiderman, B. Improving the accuracy of touch screens: an experimental evaluation of three strategies. In Proc. ACM SIGCHI (1988), 27--32.  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Roudaut, A., Huot, S., and Lecolinet, E. Taptap and magstick: improving one-handed target acquisition on small touch-screens. In Proc. Working Conference on Advanced Visual Interfaces (2008), 146--153.  ",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Sears, A., and Shneiderman, B. High precision touchscreens: design strategies and comparisons with a mouse. International Journal of Man-Machince Studies 34, 4 (Apr. 1991), 593--613.  ",
      "doi": "10.1016/0020-7373%2891%2990037-8"
    },
    {
      "text": "Vogel, D., and Baudisch, P. Shift: a technique for operating pen-based interfaces using touch. In Proc. ACM SIGCHI (2007), 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., and Hudson, S. Making computers easier for older adults to use: area cursors and sticky icons. In Proc. ACM SIGCHI (1997), 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Yatani, K., Partridge, K., Bern, M., and Newman, M. Escape: a target selection technique using visually-cued gestures. In Proc. ACM SIGCHI (2008), 285--294.  ",
      "doi": "10.1145/1357054.1357104"
    }
  ]
}