{
  "doi": "10.1145/2556288.2557379",
  "title": "A table!: improving temporal navigation in soccer ranking tables",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "887-896",
  "year": 2014,
  "badges": [],
  "abstract": "This article introduces A Table!, an enhanced soccer ranking table providing temporal navigation by combining two novel interaction techniques. Ranking tables order soccer teams represented as rows, according to values of columns containing attributes e.g., accumulated points, or number of scored goals. Because they represent a snapshot of a championship at a time t, tables are regularly updated with new results. Such updates usually change the rows order, which makes the tracking of a specified team over time difficult. We observed that the tables available on the web do not support tracking such changes very well, are generally hard to read, and lack interactions. This contrasts with the extensive use of comments on temporal trends found in soccer analysts articles. To better support such analyzes, the two interactive techniques presented allow exploration of time, and are designed to preserve users' flow: DRAG-CELL is based on direct manipulation of values to browse ranks; VIZ-RANK uses a transient line chart of team ranks to visually explore a championship. An on-line evaluation with 143 participants shows that each technique efficiently supports a set of important temporal tasks not supported by current ranking tables. This paves the way for introducing efficient advanced visual exploration techniques to millions of soccer enthusiasts who use tables everyday.",
  "tags": [
    "soccer",
    "visualization",
    "ranking tables",
    "temporal navigation"
  ],
  "authors": [
    {
      "name": "Charles Perin",
      "institution": "INRIA & University of Paris-Sud, Saclay, Ile de France, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557576356",
      "orcid": "missing"
    },
    {
      "name": "Romain Vuillemot",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81361609844/rel-imgonly/romain_vuillemot_lyon_120x160.png",
      "acmid": "81361609844",
      "orcid": "missing"
    },
    {
      "name": "Jean-Daniel Fekete",
      "institution": "INRIA, Saclay, Ile-de-france, France",
      "img": "/do/10.1145/contrib-81100194446/rel-imgonly/81100194446.jpg",
      "acmid": "81100194446",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amar, R., Eagan, J., and Stasko, J. Low-level components of analytic activity in information visualization. TVCG (2005), 15.",
      "doi": ""
    },
    {
      "text": "Anderson, J. R. Learning and memory, vol. 86. John Wiley New York, 2000.",
      "doi": ""
    },
    {
      "text": "Andrienko, N., and Andrienko, G. Exploratory Analysis of Spatial and Temporal Data: A Systematic Approach. Springer, Dec. 2005. ",
      "doi": "10.5555/1121625"
    },
    {
      "text": "Bederson, B. B. Interfaces for staying in the flow. Ubiquity 2004, September (2004), 1--1.  ",
      "doi": "10.1145/1029383.1074069"
    },
    {
      "text": "Bostock, M., Ogievetsky, V., and Heer, J. D",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Consultancy, S. R. Academic ranking of world universities 2013. Shanghai: Center for World Class Universities and Institute of Higher Education of Shanghai Jiao Tong University 66 (2013), 2013--06.",
      "doi": ""
    },
    {
      "text": "Elmqvist, N., Dragicevic, P., and Daniel Fekete, J. Rolling the dice: Multidimensional visual exploration using scatterplot matrix navigation visualization. TVCG (2008).",
      "doi": ""
    },
    {
      "text": "Elmqvist, N., Henry, N., Riche, Y., and Fekete, J.-D. Melange: space folding for multi-focus interaction. In Proc. CHI'08, ACM (2008), 1333--1342.  ",
      "doi": "10.1145/1357054.1357263"
    },
    {
      "text": "Gratzl, S., Lex, A., Gehlenborg, N., Pfister, H., and Streit, M. Lineup: Visual analysis of multi-attribute rankings. TVCG 19, 12 (2013), 2277--2286.  ",
      "doi": "10.1109/TVCG.2013.173"
    },
    {
      "text": "Heer, J., and Robertson, G. G. Animated transitions in statistical data graphics. TVCG 13, 6 (2007), 1240--1247.  ",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Kreher, D. L., and Stinson, D. R. Combinatorial algorithms: Generation. Enumeration, and Search (1999).  ",
      "doi": "10.1145/309739.309744"
    },
    {
      "text": "Lin, S., Fortuna, J., Kulkarni, C., Stone, M., and Heer, J. Selecting semantically-resonant colors for data visualization. Computer Graphics Forum (Proc. EuroVis) (2013).  ",
      "doi": "10.5555/2600534.2600590"
    },
    {
      "text": "Playfair, W. Playfair's commercial and political atlas and statistical breviary. Cambridge University Press, 2005.",
      "doi": ""
    },
    {
      "text": "Quinn, A., and Bederson, B. Human computation: a survey and taxonomy of a growing field. In Proc. CHI'11, ACM (2011), 1403--1412.  ",
      "doi": "10.1145/1978942.1979148"
    },
    {
      "text": "Rao, R., and Card, S. K. The table lens: merging graphical and symbolic representations in an interactive focus+ context visualization for tabular information. In Proc. CHI'94, ACM (1994), 318--322.  ",
      "doi": "10.1145/191666.191776"
    },
    {
      "text": "Seo, J., and Shneiderman, B. A rank-by-feature framework for interactive exploration of multidimensional data. Information Visualization 4, 2 (2005), 96--113.  ",
      "doi": "10.1057/palgrave.ivs.9500091"
    },
    {
      "text": "Shi, C., Cui, W., Liu, S., Xu, P., Chen, W., and Qu, H. Rankexplorer: Visualization of ranking changes in large time series data. TVCG 18, 12 (2012), 2669--2678.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. 1.1 direct manipulation: a step beyond programming languages. Sparks of Innovation in Human-Computer Interaction (1993), 17.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Dynamic queries for visual information seeking. Software, IEEE 11, 6 (1994), 70--77.  ",
      "doi": "10.1109/52.329404"
    },
    {
      "text": "Sopan, A., Freire, M., Plaisant, C., Golbeck, J., and Shneiderman, B. Distribution column overviews in tabular visualizations. Tech. rep., HCIL, 2010.",
      "doi": ""
    },
    {
      "text": "Tufte, E. R., and Graves-Morris, P. The visual display of quantitative information, vol. 2. Graphics press Cheshire, CT, 1983.",
      "doi": ""
    },
    {
      "text": "Victor, B. Tangle: a javascript library for reactive documents, 2013. http://worrydream.com/Tangle/.",
      "doi": ""
    },
    {
      "text": "Wikipedia. Pivot table, 2013. http://en.wikipedia.org/wiki/Pivot_table.",
      "doi": ""
    }
  ]
}