{
  "doi": "10.1145/2556288.2557179",
  "title": "Gaining empathy for non-routine mobile device use through autoethnography",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "987-990",
  "year": 2014,
  "badges": [],
  "abstract": "In this paper, we report on autoethnography as a method to access non-routine usage of mobile devices, such as during business trips, vacations, etc. Autoethnography, a self-study method with the researcher as participant, was employed for the evaluation of a wrist blood pressure monitor used by people with conditions such as hypertension. The findings from the study were surprising, especially with respect to the environmental and social impact on the use of the technology. Although the autoethnographic method can be disruptive for the researcher, it enables them to understand and empathize with the experiences mobile device users can face in difficult to access contexts. This method allows HCI researchers to better understand user experiences with mobile devices, including mobile medical technology, especially during non-routine times that can be difficult to study in-situ with traditional user studies.",
  "tags": [
    "empathy",
    "healthcare.",
    "mobile",
    "autoethnography",
    "context"
  ],
  "authors": [
    {
      "name": "Aisling Ann O'Kane",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81484657437/rel-imgonly/headshot.jpg",
      "acmid": "81484657437",
      "orcid": "0000-0001-8219-8126"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    },
    {
      "name": "Ann E. Blandford",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100644401/rel-imgonly/p1010038.jpg",
      "acmid": "81100644401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ANSI. Medical devices - Application of usability engineering to medical devices. ANSI/AAMI/IEC 62366:2007, 2007.",
      "doi": ""
    },
    {
      "text": "Banks, S.P. and Banks, A. Reading \"the critical life\": Autoethnography as pedagogy. Communication Education 49, 3 (2000), 233--238.",
      "doi": ""
    },
    {
      "text": "Bergman, E. Designing the PalmPilot: a conversation with Rob Haitani. Information appliances and beyond: interaction dsign for consumer products, Morgan Kaufmann, San Francisco, CA, (2000), 81--102. ",
      "doi": "10.5555/555986"
    },
    {
      "text": "Brandt, J., Weiss, N., and Klemmer, S.R. txt 4 l8r: lowering the burden for diary studies under mobile conditions. Ext. Abstracts CHI 2007, ACM Press (2007), 2303--2308.  ",
      "doi": "10.1145/1240866.1240998"
    },
    {
      "text": "Braun, V. and Clarke, V. Using thematic analysis in psychology. Qual. Res. in Psych. 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Buchenau, M. and Suri, J.F. Experience prototyping. Proc. DIS 2000, ACM Press (2000), 424--433.  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Cunningham, S.J. and Jones, M. Autoethnography: a tool for practice and education. Proc. OZCHI 2005, ACM Press (2005), 1--8.  ",
      "doi": "10.1145/1073943.1073944"
    },
    {
      "text": "FDA. Draft Guidance for Industry and Food and Drug Administration Staff - Applying Human Factors and Usability Engineering to Optimize Medical Device Design. 1757 (2011).",
      "doi": ""
    },
    {
      "text": "Graham, F. MHealth: Mobile technology brings healthcare home. 2010. http://www.bbc.co.uk/news/business-12068754.",
      "doi": ""
    },
    {
      "text": "Höök, K. Transferring qualities from horseback riding to design. Proc. NORDCHI 2010, ACM Press (2010), 226--235.  ",
      "doi": "10.1145/1868914.1868943"
    },
    {
      "text": "Neustaedter, C. and Sengers, P. Autobiographical design: what you can learn from designing for yourself. Interactions 19, 6 (2012), 28--33.  ",
      "doi": "10.1145/2377783.2377791"
    },
    {
      "text": "Omron. R7 (HEM-637-E7). 2012. http://www.omronhealthcare.com/en/product/blood_pressure_monitors/All /HEM-637-E.html.",
      "doi": ""
    },
    {
      "text": "Owen, T., Buchanan, G., and Thimbleby, H. Understanding user requirements in take-home diabetes management technologies. Proc. BCS People and Computers, BCS Press (2012), 268--273. ",
      "doi": "10.5555/2377916.2377950"
    },
    {
      "text": "Rogers, Y. Interaction design gone wild: striving for wild theory. Interactions 18, 4 (2011), 58.  ",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "Segal, L.D. and Suri, J.F. The empathic practitioner: Measurement and interpretation of user experience. Proc. HFES 2007, (1997), 451--454.",
      "doi": ""
    },
    {
      "text": "Wright, P. and McCarthy, J. Empathy and experience in HCI. Proc. CHI 2008, ACM Press (2008), 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    }
  ]
}