{
  "doi": "10.1145/2556288.2557132",
  "title": "Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "439-448",
  "year": 2014,
  "badges": [
    "Best Paper"
  ],
  "abstract": "In this paper, we discuss how a flourishing scene of DIY makers is turning visions of tangible and ubiquitous computing into products. Drawing on long-term multi-sited ethnographic research and active participation in DIY making, we provide insights into the social, material, and economic processes that undergird this transition from prototypes to products. The contribution of this paper is three-fold. First, we show how DIY maker practice is illustrative of a broader \"return to\" and interest in physical materials. This has implications for HCI research that investigates questions of materiality. Second, we shed light on how hackerspaces and hardware start-ups are experimenting with new models of manufacturing and entrepreneurship. We argue that we have to take seriously these maker practices, not just as hobbyist or leisure practice, but as a professionalizing field functioning in parallel to research and industry labs. Finally, we end with reflections on the role of HCI researchers and designers as DIY making emerges as a site of HCI innovation. We argue that HCI is positioned to provide critical reflection, paired with a sensibility for materials, tools and design methods.",
  "authors": [
    {
      "name": "Silvia Lindtner",
      "institution": "Fudan University, Shanghai, China & University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343499217",
      "orcid": "0000-0002-8780-6087"
    },
    {
      "name": "Garnet D. Hertz",
      "institution": "University of California Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81464675213/rel-imgonly/81464675213.jpg",
      "acmid": "81464675213",
      "orcid": "missing"
    },
    {
      "name": "Paul Dourish",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-81100521529/rel-imgonly/paul-headshot-square.jpg",
      "acmid": "81100521529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, C. Makers. The New Industrial Revolution. Crown Publishing Group, New York, 2012.",
      "doi": ""
    },
    {
      "text": "Baichtal, J. 2012. Hack This! 24 Incredible Hackerspace Projects from the DIY Movement. Que Publishing. ",
      "doi": "10.5555/2132774"
    },
    {
      "text": "Bardzell, J. and Bardzell, S. 2013. What is \"Critical\" about Critical Design? Proc. of ACM Conf. Human Factors in Computing Systems CHI'13 (Paris, France), 3297--3306.  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Blanchette, J.-F. 2012. A Material History of Bits. Presented at Epistemic Engines: Media Technology and Cultural History Conference.",
      "doi": ""
    },
    {
      "text": "Buechley, L. and Perner-Wilson, H. 2012. Crafting Technology: Reimagining the Processes, Materials, and Cultures of Electronics. ACM Transactions in Computer-Human Interaction, Vol. 19, No. 2.  ",
      "doi": "10.1145/2362364.2362369"
    },
    {
      "text": "Chesborough, H., Vanhaverbeke, W. and West, J. Open Innovation: Researching a New Paradigm. Oxford: Oxford University Press, 2006.",
      "doi": ""
    },
    {
      "text": "Coleman, G. 2012. Coding Freedom: The Ethics and Aesthetics of Hacking. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Collins, H. and Evans, R. 2002. The Third Wave of Science Studies: Studies of Expertise and Experience, Social Studies of Science, 32(2), 235--296.",
      "doi": ""
    },
    {
      "text": "Cooper, G. and Bowers, J. 1995. Representing the User: Notes on the Disciplinary Rhetoric of HCI. Thomas, P. (ed.) The Social and Interactional Dimensions of Human-Computer Interfaces. Cambridge University Press. ",
      "doi": "10.5555/214811.214821"
    },
    {
      "text": "Currie Sivek, S. 2011. \"We Need a Showing of All Hands\": Technological Utopianism in MAKE magazine. Journal of Communication Inquiry, 35: 187.",
      "doi": ""
    },
    {
      "text": "Dourish, P. and Mazmanian, M. 2011. Media as Material: Information Representations as Material Foundations for Organizational Practice. Third International Symposium on Process Organization Studies (Corfu, Greece).",
      "doi": ""
    },
    {
      "text": "Douglas, D. 2002. Hacker Culture. Minneapolis, MN: University of Minnesota Press. ",
      "doi": "10.5555/940596"
    },
    {
      "text": "Dourish, P. and Bell, G. 2011. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Faubion, J. D. and Marcus, G. E. (eds) 2009. Fieldwork is not what it used to be. New York: Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Gaver, W., Bowers, J., Boehner, K., Boucher, A., Cameraon, D., Hauenstein, M., Jarvis, N., Pennington, S. 2013. Indoor Weather Stations: Investigating a Ludic Approach to Environmental HCI through Batch Prototyping. In Proc. of ACM Conf. Human Factors in Computing Systems CHI'13 (Paris, France), 3451--3460.  ",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "Hartman, B., Doorley, S., Klemmer, S. Hacking, Mashing, Gluing: Understanding Opportunistic Design. IEEE Journal of Pervasive Computing, 2008, Vol. 7, No. 3, pp. 46--54.  ",
      "doi": "10.1109/MPRV.2008.54"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between people, bits, and atoms. In Proc. of ACM Conf. CHI'97, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Ito, M. 2009. Engineering Play. A Cultural History of Children's Software. Cambridge, MA: MIT Press. ",
      "doi": "10.5555/1708065"
    },
    {
      "text": "Kay, A. C. 1972. A Personal Computer for Children of All Ages. Proc. of ACM '72, Vol. 1, No. 1.  ",
      "doi": "10.1145/800193.1971922"
    },
    {
      "text": "Kelty, C. 2008. Two Bits: The Cultural Significance of Free Software and the Internet. Durham, NC: Duke University Press. ",
      "doi": "10.5555/1481673"
    },
    {
      "text": "Kensing, F. and Blomberg, J. 1998. Participatory Design: Issues and Concerns. Journal of Computer-Supported Cooperative Work, 7, 167--185.  ",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Kim, S. and Paulos, E. Practices in Creative Reuse of eWaste. Proc. of ACM Conf. Human Factors in Computing Systems CHI'11, 2395--2404.  ",
      "doi": "10.1145/1978942.1979292"
    },
    {
      "text": "Kolko, B., Hope, A., Sattler, B., MacCorkle, K., Sirjani, B. Hackademia: Building Functional Rather than Accredited Engineers. Proc. of PDC'12.  ",
      "doi": "10.1145/2347635.2347654"
    },
    {
      "text": "Kuznetsov, S., Taylor, A. S., Regan, T., Villar, N., Paulos, E. At the Seams: DIYbio and Opportunities for HCI. Proc. of DIS 2012, pp. 258--267.  ",
      "doi": "10.1145/2317956.2317997"
    },
    {
      "text": "Levy, S. 1994. Hackers: Heroes of the Computer Revolution. New York: Anchor Press. ",
      "doi": "10.5555/528472"
    },
    {
      "text": "Lindtner, S., 2012. Cultivating Creative China: Making and Remaking Cities, Citizens, Work, and Innovation. Phd Diss., University of California, Irvine.",
      "doi": ""
    },
    {
      "text": "Lindtner, S. and Li, D. 2012. Created in China. The Makings of China's Hackerspace Community. ACM Interactions, XIX. 6 November - December.  ",
      "doi": "10.1145/2377783.2377789"
    },
    {
      "text": "MacLean, A., Carter, K., Moran, T., and Lövstrand, L. 1990. User-Tailorable Systems: Pressing the Issues with Buttons. Proc. of ACM Conf. Human Factors in Computing Systems CHI'90 (Seattle, WA), 175--182.  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "Nguyen, J. MAKE Magazine and the Gendered Domestication of DIY Science. Currently under the review for: Perspectives on Science.",
      "doi": ""
    },
    {
      "text": "Maxigas. 2012. Hacklabs and Hackersapces - Tracing two genealogies. Journal of Peer Production, Issue 2: Bio/Hardware hacking.",
      "doi": ""
    },
    {
      "text": "Paulos, E. The Rise of the Expert Amateur. DIY Culture and Citizen Science. Keynote at UIST'09.  ",
      "doi": "10.1145/1622176.1622211"
    },
    {
      "text": "Ratto, M. 2011. Critical Making: Conceptual and Material Studies in Technology and Social Life, The Information Society: An International Journal, 27:4.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "Robles, E. and Wiberg, M. 2011. From Materials to Materiality: Thinking of Computation from within and Icehotel. ACM Interactions, January - February 2011, pp. 32--37.  ",
      "doi": "10.1145/1897239.1897248"
    },
    {
      "text": "Rosner, D., Blanchette, J.-F., Buechley, L., Dourish, P., Mazmanian, M. 2012. From Materials to Materiality: Connecting Practice and Theory in HCI, Extended Abstracts CHI'12 (Austin, Texas), 2787--2790.  ",
      "doi": "10.1145/2212776.2212721"
    },
    {
      "text": "Rosner, D. and Taylor, A. S. 2011. Antiquarian answers: book restoration as a resource for design. Proc. of ACM Conf. Human Factors in Computing Systems CHI '11 (Vancouver, BC), 2665--2668.  ",
      "doi": "10.1145/1978942.1979332"
    },
    {
      "text": "Tanenbaum, J., Williams, A., Desjardins, A., Tanenbaum, K. Democratizing Technology: Pleasure, utility and expressiveness in DIY and maker practice. Proc. of ACM Conf. Human Factors in Computing Systems. CHI'13, 2603--2612.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Turner, V. 2006. From Counterculture to Cyberculture: Stewart Brand, the Whole Earth Catalogue, and the Rise of Digital Utopianism. Chicago: University of Chicago Press, 2006. ",
      "doi": "10.5555/1210100"
    },
    {
      "text": "Vallgårda, A. and Redstöm, J. 2007. Computational Composites. Proc. ACM Conf. Human Factors in Computing Systems CHI'07 (San Jose, CA), 513--522.  ",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Von Hippel, E. Democratizing Innovation. Cambridge, Mass: MIT Press.",
      "doi": ""
    },
    {
      "text": "Wakkary, R. And Maestri, L. The Resourcefulness of Everyday Design. Proc. ACM C&C 2007, 163--172.  ",
      "doi": "10.1145/1254960.1254984"
    },
    {
      "text": "Wang, T. and Kaye, J., 2011. Inventive Leisure Practice, Proc. of ACM Conf Human Factors in Computing Systems CHI'11 (Vancouver, BC), 263--272.  ",
      "doi": "10.1145/1979742.1979615"
    },
    {
      "text": "Weiser, M. 1999. The Computer of the 21st century. ACM SIGMOBILE, Mobile Computing and Communications Review, Vol. 3, Issue 3, 3--11.  ",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "West, J. and Gallagher, S. 2006. Challenges of Open Innovation: The Paradox of Firm Investment in Open Source Software,\" R&D Management, 36, 3, 315--32.",
      "doi": ""
    }
  ]
}