{
  "doi": "10.1145/2556288.2557145",
  "title": "Unraveling abstinence and relapse: smoking cessation reflected in social media",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1345-1354",
  "year": 2014,
  "badges": [],
  "abstract": "Analysis of smokers' posts and behaviors on Twitter reveals factors impacting abstinence and relapse during cessation attempts. Combining automatic and crowdsourced techniques, we detect users trying to quit smoking and analyze tweet and network data from a sample of 653 individuals over a two-year window of quitting. Guided by theory and practice, we derive behavioral, social, and emotional measures to compare users who abstain and relapse. We also examine the cessation process, demonstrating that Twitter can help chronicle how some people go about quitting. Among other results, we show that those who fail in their smoking cessation are far heavier posters and use relatively less positive language, while those who succeed are more social in both network ties and in directed communication. We conclude with insights on how intelligent intervention systems can harness these signals to provide tailored behavior change support.",
  "tags": [
    "cessation",
    "behavior",
    "social media",
    "twitter",
    "health",
    "smoking"
  ],
  "authors": [
    {
      "name": "Elizabeth L. Murnane",
      "institution": "Microsoft Research, Redmond, WA & Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81381605773/rel-imgonly/murnane2020-for-circle.png",
      "acmid": "81381605773",
      "orcid": "missing"
    },
    {
      "name": "Scott Counts",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100398596",
      "orcid": "0000-0003-1507-5200"
    }
  ],
  "references": [
    {
      "text": "Abroms, L., Padmanabhan, N., Thaweethai, L., Phillips, T. iPhone Apps for Smoking Cessation: A Content Analysis. American Journal of Preventive Medicine (2011), 279--285.",
      "doi": ""
    },
    {
      "text": "Alderman, M. Goals and goal setting. Motivation for achievement (1999), 88--111.",
      "doi": ""
    },
    {
      "text": "American Cancer Society. Cancer Facts and Figures. (2012).",
      "doi": ""
    },
    {
      "text": "Aveyard, P., Massey, L., Parsons, A., Manaseki, S., Griffin, C. The effect of Transtheoretical Model based interventions on smoking cessation. Social Science & Medicine 68, 3 (2009), 397--403.",
      "doi": ""
    },
    {
      "text": "Bahr, D. B., Browning, R. C., Wyatt, H. R., & Hill, J. O. Exploiting social networks to mitigate the obesity epidemic. Obesity 17, 4 (2009), 723--728.",
      "doi": ""
    },
    {
      "text": "Bandura, A. Self-efficacy: The exercise of control.(1997).",
      "doi": ""
    },
    {
      "text": "Bandura, A. & Locke, E. A. Negative self-efficacy and goal effects revisited. Applied psychology 88, 1 (2003), 87.",
      "doi": ""
    },
    {
      "text": "Borland, R., Partos, T., Yong, H., Cummings, K., Hyland, A. How much unsuccessful quitting activity is going on among adult smokers' Addiction 107 (2012), 673--682.",
      "doi": ""
    },
    {
      "text": "Bradley, M. M. & Lang, P. J. Affective norms for English words (ANEW). Technical Report C-1 (1999).",
      "doi": ""
    },
    {
      "text": "Campbell, R. S. & Pennebaker, J. W. The secret life of pronouns: flexibility in writing style and physical health. Psychological Science 14, 1 (2003), 60--65.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control. Current Cigarette Smoking Among Adults - USA. (2011).",
      "doi": ""
    },
    {
      "text": "Chase, C. Public Policy Statement on Nicotine Dependence and Tobacco. American Society of Addiction Medicine (2010).",
      "doi": ""
    },
    {
      "text": "De Choudhury, M., Counts, S., & Horvitz, E. Major life changes and behavioral markers in social media: case of childbirth. In Proc. CSCW (2013), 1431--1442.  ",
      "doi": "10.1145/2441776.2441937"
    },
    {
      "text": "DiClemente, C. C., Fairhurst, S. K., & Piotrowski, N. A. Self-efficacy and addictive behaviors. (1995), 109--141.",
      "doi": ""
    },
    {
      "text": "DiClemente, C. C., Prochaska, J. O., Fairhurst, S. K., Velicer, W. F., Velasquez, M., & Rossi, J. The process of smoking cessation: an analysis of precontemplation, contemplation, and preparation stages of change. Journal of consulting and clinical psychology 59,2 (1991), 295.",
      "doi": ""
    },
    {
      "text": "Fiore, M. Treating tobacco use and dependence: Clinical practice guideline. (2008).",
      "doi": ""
    },
    {
      "text": "Fowler, J. H. & Christakis, N. A. Dynamic spread of happiness in a large social network. BMJ: British medical journal 337 (2008).",
      "doi": ""
    },
    {
      "text": "Gulliver, S. B., Hughes, J. R., Solomon, L. J., & Dey, A. N. An investigation of self-efficacy, partner support and daily stresses as predictors of relapse to smoking in self quitters. Addiction 90,6 (1995), 767--772.",
      "doi": ""
    },
    {
      "text": "Heatherton, T., Kozlowski, L., Frecker, R., Fagerstrom, K. The Fagerstrom test for nicotine dependence. British journal of addiction 86,9 (1991), 1119--1127.",
      "doi": ""
    },
    {
      "text": "Howard, K. I., Kopta, S. M., Krause, M. S., & Orlinsky, D. E. The dose-effect relationship in psychotherapy. American Psychologist 41, 2 (1986), 159.",
      "doi": ""
    },
    {
      "text": "Hughes, J., Stead, L., Lancaster, T. Antidepressants for smoking cessation. Cochrane Database Syst Rev 1.1 (2007).",
      "doi": ""
    },
    {
      "text": "Hunt, W. A. & Matarazzo, J. D. Habit mechanisms in smoking. Learning mechanisms in smoking (1970), 65--90.",
      "doi": ""
    },
    {
      "text": "Hutto, C., Yardi, S., Gilbert, E. A longitudinal study of follow predictors on twitter. In Proc. CHI (2013), 821--830.  ",
      "doi": "10.1145/2470654.2470771"
    },
    {
      "text": "Jamison-Powell, S., Linehan, C., Daley, L., Garbett, A., & Lawson, S. I can't get no sleep: discussing #insomnia on twitter. In Proc. CHI (2012), 1501--1510.  ",
      "doi": "10.1145/2207676.2208612"
    },
    {
      "text": "Kouloumpis, E., Wilson, T., Moore, J. Twitter sentiment analysis:The Good the Bad and the OMG! In ICWSM (2011).",
      "doi": ""
    },
    {
      "text": "Lemmens, V., Oenema, A., Knut, I. K., & Brug, J. Effectiveness of smoking cessation interventions among adults: a systematic review of reviews. EJCP (2008).",
      "doi": ""
    },
    {
      "text": "Locke, E. A. & Latham, G. P. Building a practically useful theory of goal setting and task motivation: A 35-year odyssey. American psychologist 57, 9 (2002), 705.",
      "doi": ""
    },
    {
      "text": "Locke, E. A., Shaw, K. N., Saari, L. M., & Latham, G. P. Goal setting and task performance: 1969--1980. Psychological bulletin 90, 1 (1981), 125.",
      "doi": ""
    },
    {
      "text": "Manchón Walsh, P., Carrillo, P., Flores, G., Masuet, C., Morchon, S., Ramon, J. Effects of partner smoking status & gender on long term abstinence rates of patients receiving smoking cessation treatment. Addictive behaviors (2007).",
      "doi": ""
    },
    {
      "text": "Oettingen, G., Pak, H., Schnetter, K. Self-regulation of goal-setting. Personality & social psych. 80, 5 (2001), 736.",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Chung, C. K., Ireland, M., Gonzales, A., & Booth, R. J. The development and psychometric properties of LIWC2007. (2007).",
      "doi": ""
    },
    {
      "text": "Pennebaker, J. W., Francis, M. E., & Booth, R. J. Linguistic inquiry and word count: LIWC 2001. (2001), 71.",
      "doi": ""
    },
    {
      "text": "Prochaska, J. J., Pechmann, C., Kim, R., & Leonhardt, J. M. Twitter-quitter? An analysis of Twitter quit smoking social networks. Tobacco control 21,4 (2012), 447--449.",
      "doi": ""
    },
    {
      "text": "Prochaska, J. O., DiClemente, C. C., & Norcross, J. C. In search of how people change: Applications to addictive behaviors. Journal of Addictions Nursing 5, 1 (1993), 2--16.",
      "doi": ""
    },
    {
      "text": "Prochaska, J. O. & Velicer, W. F. The transtheoretical model of health behavior change. American journal of health promotion 12, 1 (1997), 38--48.",
      "doi": ""
    },
    {
      "text": "Prochaska, J. O., Velicer, W. F., DiClemente, C. C., & Fava, J. Measuring processes of change: applications to the cessation of smoking. Journal of consulting and clinical psychology 56, 4 (1988), 520.",
      "doi": ""
    },
    {
      "text": "Redding, C. A., Prochaska, J. O., Paiva, A., Rossi, J. S., Velicer, W., Blissmer, B. J., Greene, G. W., Robbins, M. L., & Sun, X. Baseline stage, severity, and effort effects differentiate stable smokers from maintainers and relapsers. Substance use & misuse 46, 13 (2011), 1664--1674.",
      "doi": ""
    },
    {
      "text": "Robinson, L. M. & Vail, S. R. An Integrative Review of Adolescent Smoking Cessation Using the Transtheoretical Model of Change. Journal of Pediatric Health Care 26, 5 (2012), 336--345.",
      "doi": ""
    },
    {
      "text": "Rude, S., Gortner, E.-M., & Pennebaker, J. Language use of depressed and depression-vulnerable college students. Cognition & Emotion 18, 8 (2004), 1121--1133.",
      "doi": ""
    },
    {
      "text": "Teodoro, R. & Naaman, M. Fitter with Twitter: Understanding Personal Health and Fitness Activity in Social Media. In ICWSM (2013).",
      "doi": ""
    },
    {
      "text": "Velicer, W. F., Redding, C. A., Sun, X., & Prochaska, J. O. Demographic variables, smoking variables, and outcome across five studies. Health Psychology 26, 3 (2007), 278.",
      "doi": ""
    }
  ]
}