{
  "doi": "10.1145/2556288.2557331",
  "title": "A low-cost transparent electric field sensor for 3d interaction on mobile devices",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3167-3170",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We contribute a thin, transparent, and low-cost design for electric field sensing, allowing for 3D finger and hand tracking and gestures on mobile devices. Our approach requires no direct instrumentation of the hand or body, and is non-optical, allowing for a compact form-factor that is resilient to ambient illumination. Our simple driver electronics are based on an off-the-shelf chip that removes the need for building custom analog electronics. We describe the design of our transparent electrode array, and present a machine learning algorithm for mapping from signal measurements at the receivers to 3D positions. We demonstrate non-contact motion gestures, and precise 3D hand and finger localization. We conclude by discussing limitations and future work.",
  "authors": [
    {
      "name": "Mathieu Le Goc",
      "institution": "INRIA & Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81504683791",
      "orcid": "missing"
    },
    {
      "name": "Stuart Taylor",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81381590706",
      "orcid": "missing"
    },
    {
      "name": "Shahram Izadi",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488768",
      "orcid": "missing"
    },
    {
      "name": "Cem Keskin",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438593393",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Breiman, L. Random Forests. Machine Learning 45, 1 (Oct. 2001), 5--32.  ",
      "doi": "10.1023/A%3A1010933404324"
    },
    {
      "text": "Butler, A., Izadi, S., and Hodges, S. Sidesight: multi-touch interaction around small devices. In UIST'08, ACM (2008), 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Chen, K., Lyons, K., White, S., Patel, S. utrack: 3d input using two magnetic sensors. In UIST'13, ACM (2013).  ",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Cohn, G., Gupta, S., Lee, T.-J., Morris, D., Smith, J. R., Reynolds, M. S., Tan, D. S., and Patel, S. N. An ultra-lowpower human body motion sensor using static electric field sensing. In Ubicomp'12, ACM (2012), 99--102.  ",
      "doi": "10.1145/2370216.2370233"
    },
    {
      "text": "Cohn, G., Morris, D., Patel, S., and Tan, D. Humantenna: using the body as an antenna for real-time whole-body interaction. In CHI'12, ACM (2012), 1901--1910.  ",
      "doi": "10.1145/2207676.2208330"
    },
    {
      "text": "Cohn, G., Morris, D., Patel, S. N., and Tan, D. S. Your noise is my command: sensing gestures using the body as an antenna. In CHI'11, ACM (2011), 791--800.  ",
      "doi": "10.1145/1978942.1979058"
    },
    {
      "text": "Dietz, P., and Leigh, D. Diamondtouch: a multi-user touch technology. In UIST'01, ACM (2001), 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Glinsky, A. Theremin: ether music and espionage. University of Illinois Press, 2000.",
      "doi": ""
    },
    {
      "text": "Grosse-Puppendahl, T., Braun, A., Kamieth, F., and Kuijper, A. Swiss-cheese extended: an object recognition method for ubiquitous interfaces based on capacitive proximity sensing. In CHI'13, ACM (2013), 1401--1410.  ",
      "doi": "10.1145/2470654.2466186"
    },
    {
      "text": "Han, X., Seki, H., and Hikizu, M. Wearable handwriting input device using magnetic field. In SICE'07, IEEE (2007), 365--368.",
      "doi": ""
    },
    {
      "text": "Harrison, C., and Hudson, S. E. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices. In UIST'09, ACM (2009), 121--124.  ",
      "doi": "10.1145/1622176.1622199"
    },
    {
      "text": "Inc, M. http://www.microchip.com/gestic, 2013.",
      "doi": ""
    },
    {
      "text": "Kim, D., Izadi, S., et al. Floodlight: 3d silhouette sensing for high-precision input on and above physical surfaces. In CHI'14, ACM (2014), Forthcoming.  ",
      "doi": "10.1145/2556288.2557336"
    },
    {
      "text": "Kim, J., He, J., Lyons, K., and Starner, T. The gesture watch: A wireless contact-free gesture based wrist interface. In ISWC'07, IEEE (2007), 15--22.  ",
      "doi": "10.1109/ISWC.2007.4373770"
    },
    {
      "text": "Kratz, S., and Rohs, M. Hoverflow: expanding the design space of around-device interaction. In MobileHCI'09, ACM (2009).  ",
      "doi": "10.1145/1613858.1613864"
    },
    {
      "text": "Lanman, D., and Taubin, G. Build your own 3d scanner: 3d photography for beginners. In ACM SIGGRAPH 2009 Courses, ACM (2009), 8.  ",
      "doi": "10.1145/1667239.1667247"
    },
    {
      "text": "Lee, J., Park, K. S., and Hahn, M. The 3d sensor table for bare hand tracking and posture recognition. In Advances in Multimedia Modeling. Springer, 2006, 138--146.  ",
      "doi": "10.1007/978-3-540-69423-6_14"
    },
    {
      "text": "Lee, S. C., Li, B., and Starner, T. Airtouch: Synchronizing in-air hand gesture and on-body tactile feedback to augment mobile gesture interaction. In ISWC'11, IEEE (2011), 3--10.  ",
      "doi": "10.1109/ISWC.2011.27"
    },
    {
      "text": "Metzger, C., Anderson, M., and Starner, T. Freedigiter: A contact-free device for gesture control. In ISWC'04, vol. 1, 18--21.  ",
      "doi": "10.1109/ISWC.2004.23"
    },
    {
      "text": "Mujibiya, A., and Rekimoto, J. Mirage: exploring interaction modalities using off-body static electric field sensing. In UIST'13, ACM (2013), 211--220.  ",
      "doi": "10.1145/2501988.2502031"
    },
    {
      "text": "Paradiso, J. A., and Gershenfeld, N. Musical applications of electric field sensing. Computer music journal 21, 2 (1997), 69--89.",
      "doi": ""
    },
    {
      "text": "Sato, M., Poupyrev, I., and Harrison, C. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In CHI'12, ACM (2012), 483--492.  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Smith, J. R. Field mice: Extracting hand geometry from electric field measurements. IBM systems journal 35, 3.4 (1996), 587--608.  ",
      "doi": "10.1147/sj.353.0587"
    },
    {
      "text": "Smith, J. R. Electric field imaging. PhD thesis, MIT, 1998. ",
      "doi": "10.5555/929818"
    },
    {
      "text": "Unidym. http://www.unidym.com/, 2013.",
      "doi": ""
    },
    {
      "text": "Valtonen, M., Maentausta, J., and Vanhala, J. Tiletrack: Capacitive human tracking using floor tiles. In Percom'09, IEEE (2009), 1--10.  ",
      "doi": "10.1109/PERCOM.2009.4912749"
    },
    {
      "text": "Wimmer, R. Capacitive sensors for whole body interaction. In Whole Body Interaction. Springer, 2011.",
      "doi": ""
    },
    {
      "text": "Zimmerman, T. G. Personal area networks: near-field intrabody communication. IBM systems Journal 35, 3.4 (1996), 609--617.  ",
      "doi": "10.1147/sj.353.0609"
    },
    {
      "text": "Zimmerman, T. G., Smith, J. R., Paradiso, J. A., Allport, D., and Gershenfeld, N. Applying electric field sensing to human-computer interfaces. In CHI'95 (1995), 280--287.  ",
      "doi": "10.1145/223904.223940"
    }
  ]
}