{
  "doi": "10.1145/2556288.2557365",
  "title": "Pervasive information through constant personal projection: the ambient mobile pervasive display (AMP-D)",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "4117-4126",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The vision of pervasive ambient information displays which show relevant information has not yet come true. One of the main reasons is the limited number of available displays in the environment which is a fundamental requirement of the original vision. We introduce the concept of an Ambient Mobile Pervasive Display AMP-D which is a wearable projector system that constantly projects an ambient information display in front of the user. The floor display provides serendipitous access to public and personal information. The display is combined with a projected display on the user's hand, forming a continuous interaction space that is controlled by hand gestures. The paper introduces this novel device concept, discusses its interaction design, and explores its advantages through various implemented application examples. Furthermore, we present the AMP-D prototype which illustrates the involved challenges concerning hardware, sensing, and visualization.",
  "tags": [
    "pervasive displays",
    "personal projection",
    "ambient displays",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "Christian Winkler",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/do/10.1145/contrib-81100186414/rel-imgonly/81100186414.jpg",
      "acmid": "81100186414",
      "orcid": "missing"
    },
    {
      "name": "Julian Seifert",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442596607",
      "orcid": "missing"
    },
    {
      "name": "David Dobbelstein",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658737357",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Ulm University & Lancaster University (UK), Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Arth, C., Reitmayr, G., and Schmalstieg, D. Full 6dof pose estimation from geo-located images. In Proc. of, Computer Vision'ACCV 2012. Springer, 2013, 705--717.  ",
      "doi": "10.1007/978-3-642-37431-9_54"
    },
    {
      "text": "Billinghurst, M., Bowskill, J., Dyer, N., and Morphett, J. Spatial information displays on a wearable computer. IEEE Computer Graphics and Applications 18, 6 (1998), 24--31.  ",
      "doi": "10.1109/38.734976"
    },
    {
      "text": "Cauchard, J. R., Fraser, M., Han, T., and Subramanian, S. Steerable projection: exploring alignment in interactive mobile displays. Personal Ubiquitous Comput. 16, 1 (Jan. 2012), 27--37.  ",
      "doi": "10.1007/s00779-011-0375-3"
    },
    {
      "text": "Chung, J., Kim, I.-J., and Schmandt, C. Guiding light: Navigation assistance system using projection based augmented reality. In Proc. of, ICCE'11 (Jan. 2011), 881--882.",
      "doi": ""
    },
    {
      "text": "Costanza, E., Inverso, S. A., Pavlov, E., Allen, R., and Maes, P. eye-q: eyeglass peripheral display for subtle intimate noti'cations. In Proc. of, MobileHCI'06, ACM (2006), 211--218.  ",
      "doi": "10.1145/1152215.1152261"
    },
    {
      "text": "Feiner, S., MacIntyre, B., Haupt, M., and Solomon, E. Windows on the world: 2 d windows for 3 d augmented reality. In Proc. of, UIST'93, ACM (1993), 145--155.  ",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Feiner, S., MacIntyre, B., Hollerer, T., and Webster, A. A touring machine: Prototyping 3D mobile augmented reality systems for exploring the urban environment. Personal Technologies 1, 4 (1997), 208--217.",
      "doi": ""
    },
    {
      "text": "Google Inc. Google glass - home. http://www.google.com/glass/start/. Accessed: 2013-03--21.",
      "doi": ""
    },
    {
      "text": "Harrison, C., Benko, H., and Wilson, A. D. OmniTouch: wearable multitouch interaction everywhere. In Proc. of, UIST'11, ACM (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Harrison, C., Tan, D., and Morris, D. Skinput: appropriating the body as an input surface. In Proc. of, CHI'10, ACM (2010), 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Karitsuka, T., and Sato, K. A wearable mixed reality with an on-board projector. In Proc. of, ISMAR'03, IEEE Computer Society (2003), 321--322. ",
      "doi": "10.5555/946248.946820"
    },
    {
      "text": "Ladetto, Q., and Merminod, B. Digital magnetic compass and gyroscope integration for pedestrian navigation. In 9th International Conference on Integrated Navigation Systems, St. Petersburg (2002), 111--120.",
      "doi": ""
    },
    {
      "text": "Leung, M., Tomitsch, M., and Vande Moere, A. Designing a personal visualization projection of online social identity. In Extended Abstracts, CHI EA'11, ACM (2011), 1843--1848.  ",
      "doi": "10.1145/1979742.1979882"
    },
    {
      "text": "Linneweber, T. JigLibX physics engine. http://jiglibx.codeplex.com/. 2013-03--27.",
      "doi": ""
    },
    {
      "text": "McFarlane, D. C., and Wilder, S. M. Interactive dirt: increasing mobile work performance with a wearable projector-camera system. In Proc. of, Ubicomp'09, ACM (2009), 205--214.  ",
      "doi": "10.1145/1620545.1620577"
    },
    {
      "text": "Microsoft. Quickstart game engine. http://quickstartengine.codeplex.com/, 2013. (Last Access: 2013/03/25).",
      "doi": ""
    },
    {
      "text": "Mistry, P., Maes, P., and Chang, L. WUW - wear ur world: a wearable gestural interface. In Extended Abstracts, CHI EA'09, ACM (2009), 4111--4116.  ",
      "doi": "10.1145/1520340.1520626"
    },
    {
      "text": "Molyneaux, D., Izadi, S., Kim, D., Hilliges, O., Hodges, S., Cao, X., Butler, A., and Gellersen, H. Interactive environment-aware handheld projectors for pervasive computing spaces. In Proc. of, Pervasive 2012, Springer (June 2012), 197--215.  ",
      "doi": "10.1007/978-3-642-31205-2_13"
    },
    {
      "text": "Ota, S., Takegawa, Y., Terada, T., and Tsukamoto, M. A method for wearable projector selection that considers the viewability of projected images. Computers in Entertainment (CIE) 8 (Dec. 2010), 17:1'17:16. ACM ID: 1902596.  ",
      "doi": "10.1145/1902593.1902596"
    },
    {
      "text": "Pousman, Z., and Stasko, J. A taxonomy of ambient information systems: Four patterns of design. In Proc. of, AVI'06, ACM (New York, NY, USA, 2006), 67--74.  ",
      "doi": "10.1145/1133265.1133277"
    },
    {
      "text": "Rapp, S. Spotlight navigation: a pioneering user interface for mobile projection. In Ubiprojection Workshop at Pervasive'10 (2010).",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Holleis, P., and Gellersen, H. Personal projectors for pervasive computing. IEEE Pervasive Computing 11, 2 (Feb. 2011), 30--37.  ",
      "doi": "10.1109/MPRV.2011.17"
    },
    {
      "text": "Sodhi, R., Benko, H., and Wilson, A. LightGuide: projected visualizations for hand movement guidance. In Proc. of, CHI'12, ACM (2012), 179--188.  ",
      "doi": "10.1145/2207676.2207702"
    },
    {
      "text": "Torning, K., and Oinas-Kukkonen, H. Persuasive system design: state of the art and future directions. In Proc. of, Persuasive'09, ACM (2009), 30:1--30:8.  ",
      "doi": "10.1145/1541948.1541989"
    },
    {
      "text": "Treisman, A. Preattentive processing in vision. Computer Vision, Graphics, and Image Processing 31, 2 (Aug. 1985), 156--177.  ",
      "doi": "10.1016/S0734-189X%2885%2980004-9"
    },
    {
      "text": "Wilson, A., Benko, H., Izadi, S., and Hilliges, O. Steerable augmented reality with the beamatron. In Proc. of, UIST'12, ACM (2012), 413--422.  ",
      "doi": "10.1145/2380116.2380169"
    },
    {
      "text": "Wilson, A. D., and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proc. of, UIST'10, ACM (2010), 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Winkler, C., Pfeuffer, K., and Rukzio, E. Investigating mid-air pointing interaction for projector phones. In Proc. of, ITS'12, ACM (New York, NY, USA, 2012), 85--94.  ",
      "doi": "10.1145/2396636.2396650"
    },
    {
      "text": "Xiao, R., Harrison, C., and Hudson, S. E. Worldkit: Rapid and easy creation of ad-hoc interactive applications on everyday surfaces. In Proc. of, CHI'13, ACM (New York, NY, USA, 2013), 879--888.  ",
      "doi": "10.1145/2470654.2466113"
    }
  ]
}