{
  "doi": "10.1145/2556288.2557320",
  "title": "A gaze-preserving situated multiview telepresence system",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2173-2176",
  "year": 2014,
  "badges": [],
  "abstract": "Gaze, attention, and eye contact are important aspects of face to face communication, but some subtleties can be lost in videoconferencing because participants look at a single planar image of the remote user. We propose a low-cost cylindrical videoconferencing system that preserves gaze direction by providing perspective-correct images for multiple viewpoints around a conference table. We accomplish this by using an array of cameras to capture a remote person, and an array of projectors to present the camera images onto a cylindrical screen. The cylindrical screen reflects each image to a narrow viewing zone. The use of such a situated display allows participants to see the remote person from multiple viewing directions. We compare our system to three alternative display configurations. We demonstrate the effectiveness of our system by showing it allows multiple participants to simultaneously tell where the remote person is placing their gaze.",
  "tags": [
    "gaze",
    "non-planar displays",
    "camera arrays"
  ],
  "authors": [
    {
      "name": "Ye Pan",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958918957",
      "orcid": "missing"
    },
    {
      "name": "Anthony Steed",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501447",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anstis, S. M., Mayhew, J. W., and Morley, T. The perception of where a face or television portrait is looking. The American journal of psychology (1969).",
      "doi": ""
    },
    {
      "text": "Kim, K., Bolton, J., Girouard, A., Cooperstock, J., and Vertegaal, R. Telehuman: effects of 3d perspective on gaze and pose estimation with a life-size cylindrical telepresence pod. In SIGCHI, ACM (2012), 2531--2540.  ",
      "doi": "10.1145/2207676.2208640"
    },
    {
      "text": "Lincoln, P., Welch, G., Nashel, A., Ilie, A., and Fuchs, H. Animatronic shader lamps avatars. VR (2011).  ",
      "doi": "10.5555/3113186.3113336"
    },
    {
      "text": "Nguyen, D., and Canny, J. Multiview: spatially faithful group video conferencing. In SIGCHI (2005), 799--808.  ",
      "doi": "10.1145/1054972.1055084"
    },
    {
      "text": "Okada, K., Maeda, F., Ichikawaa, Y., and Matsushita, Y. Multiparty videoconferencing at virtual social distance: Majic design. In CSCW (1994), 385--393.  ",
      "doi": "10.1145/192844.193054"
    },
    {
      "text": "Oyekoya, O., Steptoe, W., and Steed, A. Sphereavatar: A situated display to represent a remote collaborator. In SIGCHI (Austin, Texas, USA, 2012), 2551--2560.  ",
      "doi": "10.1145/2207676.2208642"
    },
    {
      "text": "Pan, Y., and Steed, A. Preserving gaze direction in teleconferencing using a camera array and a spherical display. In 3DTV-CON, IEEE (2012), 1--4.",
      "doi": ""
    },
    {
      "text": "Prince, S., Cheok, A. D., Farbiz, F., Williamson, T., Johnson, N., Billinghurst, M., and Kato, H. 3-d live: real time interaction for mixed reality. In CSCW (2002).  ",
      "doi": "10.1145/587078.587129"
    },
    {
      "text": "Schreer, O., Kauff, P., and Sikora, T. 3D videocommunication. Wiley Online Library, 2005.",
      "doi": ""
    },
    {
      "text": "Sellen, A., Buxton, B., and Arnott, J. Using spatial cues to improve videoconferencing. In SIGCHI (Monterey, California, USA, 1992), 651--652.  ",
      "doi": "10.1145/142750.143070"
    },
    {
      "text": "Vertegaal, R., Weevers, I., Sohn, C., and Cheung, C. Gaze-2: conveying eye contact in group video conferencing using eye-controlled camera direction. In SIGCHI (Ft. Lauderdale, Florida, USA, 2003), 521--528.  ",
      "doi": "10.1145/642611.642702"
    }
  ]
}