{
  "doi": "10.1145/2556288.2557186",
  "title": "I can wait a minute: uncovering the optimal delay time for pre-moderated user-generated content on public displays",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1435-1438",
  "year": 2014,
  "badges": [],
  "abstract": "Public displays have advanced from isolated and non interactive \"ad\" displays which show images and videos to displays that are networked, interactive, and open to a wide variety of content and applications. Prior work has shown large potential of user-generated content on public displays. However, one of the problems with user-generated content on public displays is moderation as content may be explicit or troublesome for a particular location. In this work we explore the expectations of users with regard to content moderation on public displays. An online survey revealed that people not only think that display content should be moderated but also that a delay of up to 10 minutes is acceptable if display content is moderated. In a subsequent in the wild deployment we compared different moderation delays. We found that a moderation delay significantly decreases the number of user-generated posts while at the same time there is no significant effect on users' decision to repeatedly post on the display.",
  "tags": [
    "public displays",
    "twitter",
    "content moderation"
  ],
  "authors": [
    {
      "name": "Miriam Greis",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548014779",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "University of Munich, München, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    },
    {
      "name": "Nemanja Memarovic",
      "institution": "Universita della Svizzera Italiana, Lugano, TI, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597925",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alt, F., Kubitza, T., Bial, D., Zaidan, F., Ortel, M., Zurmaar, B., Lewen, T., Shirazi, A. S., and Schmidt, A. Digifieds: insights into deploying digital public notice areas in the wild. In Proc. MUM'11, ACM (2011).  ",
      "doi": "10.1145/2107596.2107618"
    },
    {
      "text": "Churchill, E., Nelson, L., Denoue, L., Murphy, P., and Helfman, J. The plasma poster network. In Public and Situated Displays. Kluwer, 2003.",
      "doi": ""
    },
    {
      "text": "Davies, N., Langheinrich, M., Jose, R., and Schmidt, A. Open display networks: A 21st century communications medium. IEEE Computer (2012).  ",
      "doi": "10.1109/MC.2012.114"
    },
    {
      "text": "Elhart, I., Memarovic, N., Langheinrich, M., and Rubegni, E. Control and scheduling interface for public displays. In Adjunct Proc. UbiComp'13 (2013).  ",
      "doi": "10.1145/2494091.2494106"
    },
    {
      "text": "Kostakos, V., and Ojala, T. Public displays invade urban spaces. Pervasive Computing (2013).  ",
      "doi": "10.1109/MPRV.2013.15"
    },
    {
      "text": "Memarovic, N., Langheinrich, M., Rubegni, E., David, A., and Elhart, I. Designing \"interacting places\" for a student community using a communicative ecology approach. In Proc. MUM'12, ACM (2012).  ",
      "doi": "10.1145/2406367.2406420"
    },
    {
      "text": "Munson, S. A., Rosengren, E., and Resnick, P. Thanks and tweets: comparing two public displays. In Proc. CSCW '11, ACM (2011).  ",
      "doi": "10.1145/1958824.1958875"
    },
    {
      "text": "Schroeter, R. Engaging new digital locals with interactive urban screens to collaboratively improve the city. In Proc. CSCW '12, ACM (2012).  ",
      "doi": "10.1145/2145204.2145239"
    },
    {
      "text": "Storz, O., Friday, A., Davies, N., Finney, J., Sas, C., and Sheridan, J. Public ubiquitous computing systems: Lessons from the e-campus display deployments. Pervasive Computing (2006).  ",
      "doi": "10.1109/MPRV.2006.56"
    },
    {
      "text": "Taylor, N., Cheverst, K., Fitton, D., Race, N. J., Rouncefield, M., and Graham, C. Probing communities: study of a village photo display. In Proc. OzCHI (2007).  ",
      "doi": "10.1145/1324892.1324896"
    },
    {
      "text": "Wise, K., Hamman, B., and Thorson, K. Moderation, response rate, and message interactivity: Features of online communities and their effects on intent to participate. Comp.-Med. Comm. 12, 1 (2006).",
      "doi": ""
    }
  ]
}