{
  "doi": "10.1145/2556288.2557171",
  "title": "Improving machine translation by showing two outputs",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3743-3746",
  "year": 2014,
  "badges": [],
  "abstract": "We propose to improve real-time communication between people who do not share a common language by foregrounding potential problems in machine translation. We developed a prototype chat tool that displays two parallel translations of each chat turn, with the thought that comparing the translations might both highlight problems and provide resources for resolving them. We conducted a user study to investigate how people use and like such an interface compared to a standard one-translation interface. On balance, users preferred two translations to one, using them to both notice differences and infer meaning from uncertain translations, with no increase in workload. This suggests that this interface may help improve cross-lingual communication in practical applications and lays the groundwork for a larger design space around systems that highlight possible errors to support communication.",
  "authors": [
    {
      "name": "Bin Xu",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558437356",
      "orcid": "missing"
    },
    {
      "name": "Ge Gao",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81498646640/rel-imgonly/ge_photo.png",
      "acmid": "81498646640",
      "orcid": "0000-0003-2733-2681"
    },
    {
      "name": "Susan R. Fussell",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    },
    {
      "name": "Dan Cosley",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100288358/rel-imgonly/3435035874_f9b2a1d423_o.jpg",
      "acmid": "81100288358",
      "orcid": "0000-0001-8108-1954"
    }
  ],
  "references": [
    {
      "text": "Chevrier, S. Cross-cultural management in multinational project groups. J. World Business, 38, (2003), 141'149.",
      "doi": ""
    },
    {
      "text": "Finch, A., Song, W., Tanaka-Ishii, K., & Sumita, E. Picotrans. Using pictures as input for machine translation on mobile devices. In Proc. IJCAI 2011. AAAI Press (2011), 2614'2619.  ",
      "doi": "10.5555/2283696.2283831"
    },
    {
      "text": "Gao, G., Wang, H.-C., Cosley, D., & Fussell, S. R. Same translation but different experience: the effects of highlighting on machine-translated conversations. In Proc. CHI 2013, ACM Press (2013), 449'458.  ",
      "doi": "10.1145/2470654.2470719"
    },
    {
      "text": "Hart, S. G., & Staveland, L. E. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. Human mental workload, 1, (1988), 139'183.",
      "doi": ""
    },
    {
      "text": "Hu, C., Bederson, B. B., Resnik, P., & Kronrod, Y. Monotrans2: A new human computation system to support monolingual translation. In Proc. CHI 2011, ACM Press (2011), 1133'1136.  ",
      "doi": "10.1145/1978942.1979111"
    },
    {
      "text": "Sengers, P., & Gaver, B. Staying open to interpretation: engaging multiple meanings in design and evaluation. In Proc. DIS 2006, ACM Press (2006), 99'108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Shigenobu, T. Evaluation and usability of back translation for intercultural communication. Usability and Internationalization. Global and Local User Interfaces. Springer (2007), 259'265. ",
      "doi": "10.5555/1783969.1784001"
    },
    {
      "text": "Yamashita, N., & Ishida, T. Effects of machine translation on collaborative work. In Proc. CSCW 2006, ACM Press (2006), 515'524.  ",
      "doi": "10.1145/1180875.1180955"
    },
    {
      "text": "Zhang, R. P., Pan, Y., & Yang, Y. (2012). A comparative case study of Google and Bing translation. In Proc. ICERI2012, 3669'3673.",
      "doi": ""
    }
  ]
}