{
  "doi": "10.1145/2556288.2557211",
  "title": "Customization bias in decision support systems",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3065-3074",
  "year": 2014,
  "badges": [],
  "abstract": "Many Decision Support Systems (DSS) afford customization of inputs or algorithms before generating recommendations to a decision maker. This paper describes an experiment in which users make decisions assisted by recommendations of a DSS in a fantasy baseball game. This experiment shows that the act of customizing a DSS can lead to biased decision making. I show that users who believe they have customized a DSS's recommendation algorithm are more likely to follow the recommendations regardless of their accuracy. I also show that this customization bias is the result of using a DSS to seek confirmatory information in a recommendation.",
  "authors": [
    {
      "name": "Jacob Solomon",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/do/10.1145/contrib-81472649992/rel-imgonly/jacob-web.jpg",
      "acmid": "81472649992",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "http://lcs.mgh.harvard.edu/projects/dxplain.html.",
      "doi": ""
    },
    {
      "text": "Simpson v. cotton creek circles, llc, 2008.",
      "doi": ""
    },
    {
      "text": "E. Alberdi, A. Povyakalo, L. Strigini, and P. Ayton. Effects of incorrect computer-aided detection (CAD) output on human decision-making in mammography. Academic Radiology, 11(8):909--918, 2004.",
      "doi": ""
    },
    {
      "text": "T. J. Bright, A. Wong, R. Dhurjati, E. Bristow, L. Bastian, R. R. Coeytaux, G. Samsa, V. Hasselblad, J. W. Williams, M. D. Musty, L. Wing, A. S. Kendrick, G. D. Sanders, and D. Lobach. Effect of clinical decision-support systems: A systematic review. Annals of Internal Medicine, 2012.",
      "doi": ""
    },
    {
      "text": "E. Coiera, J. Westbrook, and J. Wyatt. The safety and quality of decision support systems. Methods of Information in Medicine, 45(1):S20--5, 2006.",
      "doi": ""
    },
    {
      "text": "D. Coyle, J. Moore, P. O. Kristensson, P. Fletcher, and A. Blackwell. I did that!: measuring users' experience of agency in their own actions. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems, pages 2025--2034. ACM, 2012.  ",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "M. Cummings. Automation bias in intelligent time critical decision support systems. In AIAA 1st Intelligent Systems Technical Conference, volume 2, pages 557--562, 2004.",
      "doi": ""
    },
    {
      "text": "F. D. Davis and J. E. Kottemann. User perceptions of decision support effectiveness: Two production planning experiments. Decision Sciences, 25(1):57--76, Jan. 1994.",
      "doi": ""
    },
    {
      "text": "K. Ehrlich, S. E. Kirk, J. Patterson, J. C. Rasmussen, S. I. Ross, and D. M. Gruen. Taking advice from intelligent systems. In Proceedings of the 15th international conference on Intelligent user interfaces IUI '11, page 125, New York, New York, USA, Feb. 2011. ACM Press.  ",
      "doi": "10.1145/1943403.1943424"
    },
    {
      "text": "B. R. Forer. The fallacy of personal validation: A classroom demonstration of gullibility. Journal of Abnormal and Social Psychology, 44(1):118--123, 1949.",
      "doi": ""
    },
    {
      "text": "J. L. Herlocker, J. A. Konstan, L. G. Terveen, and J. T. Riedl. Evaluating collaborative filtering recommender systems. ACM Transactions on Information Systems, 22(1):5--53, 2004.  ",
      "doi": "10.1145/963770.963772"
    },
    {
      "text": "Y. Hijikata, Y. Kai, and S. Nishida. The relation between user intervention and user satisfaction for information recommendation. In SAC '12 Proceedings of the 27th Annual ACM Symposium on Applied Computing, pages 2002--2007, 2012.  ",
      "doi": "10.1145/2245276.2232109"
    },
    {
      "text": "H.-H. Huang, J. S.-C. Hsu, and C.-Y. Ku. Understanding the role of computer-mediated counter-argument in countering confirmation bias. Decision Support Systems, 53(3):438--447, June 2012.  ",
      "doi": "10.1016/j.dss.2012.03.009"
    },
    {
      "text": "E. J. Langer. The illusion of control. Journal of Personality and Social Psychology, 32(2):311--328, 1975.",
      "doi": ""
    },
    {
      "text": "G. Lindgaard, C. Pyper, M. Frize, and R. Walker. Does bayes have it? decision support systems in diagnostic medicine. International Journal of Industrial Ergonomics, 39(3):524--532, 2009.",
      "doi": ""
    },
    {
      "text": "P. Madhavan and R. R. Phillips. Effects of computer self-efficacy and system reliability on user interaction with decision support systems. Computers in Human Behavior, 26(2):199--204, 2010.  ",
      "doi": "10.1016/j.chb.2009.10.005"
    },
    {
      "text": "E. K. Muthard and C. D. Wickens. Factors that mediate flight plan monitoring and errors in plan revision: Planning under automated and high workload conditions. In Proceedings of the 12th international symposium on aviation psychology, pages 857--62, 2003.",
      "doi": ""
    },
    {
      "text": "R. S. Nickerson. Confirmation bias: A ubiquitous phenomenon in many guises. Review of General Psychology, 2(2):175--220, 1998.",
      "doi": ""
    },
    {
      "text": "M. Norton, D. Mochon, and D. Ariely. The 'IKEA effect': When labor leads to love. Harvard Business School Marketing Unit Working Paper, (11-091), 2011.",
      "doi": ""
    },
    {
      "text": "L. J. Skitka, K. L. Mosier, and M. Burdick. Does automation bias decision-making? International Journal of Human-Computer Studies, 51(5):991--1006, 1999.  ",
      "doi": "10.1006/ijhc.1999.0252"
    },
    {
      "text": "S. S. Sundar. Self-as-source. In E. Konijn, S. Utz, M. Tanis, and S. B. Barnes, editors, Mediated Interpersonal Communication, pages 58--74. Routledge, New York, 2008.",
      "doi": ""
    },
    {
      "text": "S. S. Sundar, J. Oh, S. Bellur, H. Jia, and H.-S. Kim. Interactivity as self-expression. In Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems CHI '12, page 395, New York, New York, USA, May 2012. ACM Press.  ",
      "doi": "10.1145/2207676.2207731"
    },
    {
      "text": "S. Ward. Decision support for what-if analysis and the confirmation bias. Journal of Computer Information Systems, 40(4):84--92, 2000.",
      "doi": ""
    },
    {
      "text": "T. Y. Yang and T. Swartz. A two-stage bayesian model for predicting winners in major league baseball. Journal of Data Science, 2(1):61--73, 2004.",
      "doi": ""
    }
  ]
}