{
  "doi": "10.1145/2556288.2557198",
  "title": "Exploring video streaming in public settings: shared geocaching over distance using mobile video chat",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2163-2172",
  "year": 2014,
  "badges": [],
  "abstract": "Our research explores the use of mobile video chat in public spaces by people participating in parallel experiences, where both a local and remote person are doing the same activity together at the same time. We prototyped a wearable video chat experience and had pairs of friends and family members participate in 'shared geocaching' over distance. Our results show that video streaming works best for navigation tasks but is more challenging to use for fine-grained searching tasks. Video streaming also creates a very intimate experience with a remote partner, but this can lead to distraction from the 'real world' and even safety concerns. Overall, privacy concerns with streaming from a public space were not typically an issue; however, people tended to rely on assumptions of what were acceptable. The implications are that designers should consider appropriate feedback, user disembodiment, and asymmetry when designing for parallel experiences.",
  "tags": [
    "geocaching",
    "shared experiences",
    "video communication"
  ],
  "authors": [
    {
      "name": "Jason Procyk",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556720356",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Carolyn Pang",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81558581656/rel-imgonly/personal-image.jpg",
      "acmid": "81558581656",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Tejinder K. Judge",
      "institution": "Google Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655970",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M. G., Go, J., Kaye, J. J., & Spasojevic, M. Making love in the network closet: the benefits and work of family videochat, Proc. CSCW, ACM Press (2010).  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Bellotti, V. Design for Privacy in Multimedia Computing and Communications Environments, in Technology and Privacy: The New Landscape, MIT Press (1998) 63--98. ",
      "doi": "10.5555/275283.275286"
    },
    {
      "text": "Boyle, M., Neustaedter, C., and Greenberg, S. Privacy Factors in Video-based Media Spaces, Media Space: 20+ Years of Mediated Life, Springer (2009).",
      "doi": ""
    },
    {
      "text": "Brubaker, J., Venolia, G., and Tang, J. Focusing on Shared Experiences: Moving Beyond the Camera in Video Communication, Proc. DIS, ACM Press (2012).  ",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Buhler, T., Neustaedter, C., and Hillman, S. How and Why Teenagers Use Video Chat, Proc. CSCW, (2012).  ",
      "doi": "10.1145/2441776.2441861"
    },
    {
      "text": "Chavez, D. J., Courtright, R., and Schneider, I. Over the River and through the Woods, Parks & Recreation, 39, 4 (2004), 68--72.",
      "doi": ""
    },
    {
      "text": "Chavez, D. J., Schneider, I., and Powell, T. The Social Psychology of a Technology Driven Outdoor Trend: Geocaching in the USA, Proc. HICSS 2004, ACM Press (2004).",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Everitt, K., Smith, I., Landay, J. A. Design Requirements for Technologies that Encourage Physical Activity, Proc. CHI, ACM Press (2006), 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "de Sá, M., Shamma, D. A., Churchill, E. F. Live mobile collaboration for video production: design, guidelines, and requirements, Personal and Ubiquitous Computing, Springer (2013).",
      "doi": ""
    },
    {
      "text": "Engström, A., Zoric, G., Juhlin O., and Toussi, R. The mobile vision mixer: a mobile network based live video broadcasting system in your mobile phone, Proc. Mobile and Ubiquitous Multimedia (MUM '12).  ",
      "doi": "10.1145/2406367.2406390"
    },
    {
      "text": "Inkpen, K., Du, H., Roseway, A., Hoff, A., and Johns, P. Video Kids: Augmenting Close Friendships with Asynchronous Video Conversations in VideoPal, Proc. CHI, ACM Press (2012).  ",
      "doi": "10.1145/2207676.2208400"
    },
    {
      "text": "Inkpen, K., Taylor, B., Junuzovic, S., Tang, J., and Venolia, G. Experiences2Go: Sharing Kids' Activities Outside the Home with Remote Family Members, Proc. CSCW, ACM Press (2013).  ",
      "doi": "10.1145/2441776.2441926"
    },
    {
      "text": "Judge, T. K., and Neustaedter, C., Sharing Conversations and Sharing Life: Video Conferencing in the Home, Proc. of CHI, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753422"
    },
    {
      "text": "Judge, T. K., Neustaedter, C. and Kurtz, A., The Family Window: The Design and Evaluation of a Domestic Media Space. Proc. CHI, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "Judge, T. K., Neustaedter, C., Harrison, S., and Blose, A., The Family Portals: Connecting Families Through a Multifamily Media Space. Proc. ACM CHI, (2011).  ",
      "doi": "10.1145/1978942.1979122"
    },
    {
      "text": "Kelley, M. A. Local Treasures: Geocaching across America. Santa Fe: Center for American Places (2006).",
      "doi": ""
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., Roussel, N., Eiderbäck, B. Technology probes: Inspiring design for and with families, Proc. CHI, ACM Press (2003), 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Mueller, F., O'Brien, S., and Thorogood, A. Jogging over a Distance, Proc. CHI, ACM Press (2007).",
      "doi": ""
    },
    {
      "text": "Mueller, F., Vetere, F., Gibbs, M., Edge, D., Agamonlis, S., and Sheridan, J. Jogging over a Distance Between Europe and Australia, Proc. UIST, ACM Press (2010), 189--198.  ",
      "doi": "10.1145/1866029.1866062"
    },
    {
      "text": "Mueller, F., Agamanolis, S., and Picard, R., Exertion interfaces: sports over a distance for social bonding and fun, Proc. CHI, ACM Press (2003), 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Neustaedter, C. and Judge, T. Peek-A-Boo: The Design of a Mobile Family Media Space, Video Proc. Ubicomp, Springer (2010).  ",
      "doi": "10.1145/1864431.1864482"
    },
    {
      "text": "Neustaedter, C., and Greenberg, S., Intimacy in Long-Distance Relationships over Video Chat, Proc. CHI, ACM Press (2012).  ",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Neustaedter, C., Tang, A., and Judge, T., The Role of Community and Groupware in Geocache Creation and Maintenance, Proc. CHI 2010, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753590"
    },
    {
      "text": "O'Brien, S., and Mueller, F. Jogging the Distance, Proc. CHI, ACM Press (2007).  ",
      "doi": "10.1145/1240624.1240708"
    },
    {
      "text": "O'Hara, K. Understanding Geocaching Practices and Motivations, Proc. CHI 2008, ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357239"
    },
    {
      "text": "O'Hara, K., Black, A., Lipson, M. Everyday Practices with Mobile Video Telephony, Proc. CHI, ACM Press (2006), 871--880.  ",
      "doi": "10.1145/1124772.1124900"
    },
    {
      "text": "Raffle, H., Ballagas, R., Revelle, G., Horii, H., Follmer, S., Go, J., Reardon, E., Mori, K., Kaye, J., and Spasojevic, M. Family story play: reading with children, Proc. CHI, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Salovaara, A., Johnson, M., Toiskallio, K., Tiitta, S., and Turpeinen, M. Playmakers in Multiplayer Game Communities, Proc. ACE 2005, ACM Press (2005).  ",
      "doi": "10.1145/1178477.1178540"
    },
    {
      "text": "Stanley, K., Livingston, I., Bandurka, A., Kapiszka, R., Mandryk, R. (2010) PiNiZoRo: A GPS-based Exercise Game for Families, Proc. Future Play, (2010), 276--279.  ",
      "doi": "10.1145/1920778.1920817"
    },
    {
      "text": "Tang, A., Neustaedter, C., and Greenberg, S. Embodiments in Mixed Presence Groupware, British HCI, ACM Press (2006).",
      "doi": ""
    },
    {
      "text": "Virtual Photo Walks, www.virtualphotowalks.org",
      "doi": ""
    },
    {
      "text": "Voida, A., Voida, S., Greenberg, S., and He, H. A. Asymmetry in media spaces, Proc. CSCW, (2008).  ",
      "doi": "10.1145/1460563.1460615"
    },
    {
      "text": "Yarosh, S., Cuzzort, S., Mueller, H., and Abowd, G. D., Developing a Media Space for Remote Synchronous Parent-Child Interaction, Proc IDC, ACM Press (2009).  ",
      "doi": "10.1145/1551788.1551806"
    },
    {
      "text": "Yarosh, S., Inkpen, K., and Brush, A. J., Video Playdate: Toward Free Play Across Distance, Proc. CHI, ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753514"
    }
  ]
}