{
  "doi": "10.1145/2556288.2557063",
  "title": "In-your-face, yet unseen?: improving head-stabilized warnings to reduce reaction time",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3201-3204",
  "year": 2014,
  "badges": [],
  "abstract": "One unique property of head-mounted displays (HMDs) is that content can easily be displayed at a fixed position within the user's field of view (head-stabilized). This ensures that critical information (e.g. warnings) is continuously visible and can, in principle, be perceived as quickly as possible. We examined this strategy with a physically and visually distracted driver. We ran two consecutive studies in a driving simulator, comparing different warning visualizations in a head-up display (HUD) and a HMD. In an initial study, we found no significant effects of warning type or display technology on the reaction times. In a second study, after modifying our visualization to include a visual reference marker, we found that with only this minor change, reaction times were significantly lower in the HMD when compared to the HUD. Our insights can help others design better head-stabilized notifications.",
  "authors": [
    {
      "name": "Felix Lauber",
      "institution": "University of Munich (LMU), Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502795716",
      "orcid": "missing"
    },
    {
      "name": "Andreas Butz",
      "institution": "University of Munich (LMU), Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100266654",
      "orcid": "0000-0002-9007-9888"
    }
  ],
  "references": [
    {
      "text": "Baber, C., Knight, J., Haniff, D. and Cooper, L. Ergonomics of wearable computers. Mobile Networks and Applications 4.1, 1999. 15--21.  ",
      "doi": "10.1023/A%3A1019165908249"
    },
    {
      "text": "Billinghurst, M., Bowskill, M., Jessop, M. and Morphett, J. A wearable spatial conferencing space. Proc. Wearable Computers, IEEE (1998). 76--83. ",
      "doi": "10.5555/857199.858019"
    },
    {
      "text": "Bock, T., Maurer, M. and Färber, G. Vehicle in the Loop (VIL) - A new simulator set-up for testing Advanced Driving Assistance Systems. Driving Simulation Conference, 2007.",
      "doi": ""
    },
    {
      "text": "Höllerer, T., Feiner, S. and Paylik, J. Situated documentaries: Embedding multimedia presentations in the real world. In Wearable Computers 1999. IEEE, 79--86. ",
      "doi": "10.5555/519309.856460"
    },
    {
      "text": "Laschinsky, Y., von Neumann-Cosel, K., Gonter, M., Wegwerth, C., Dubitzky, R. and Knoll, A. Evaluation of an Active Safety Light using Virtual Test Drive within Vehicle in the Loop. In ICIT 2010, IEEE, 1119--1112.",
      "doi": ""
    },
    {
      "text": "Mattes, S. and Hallén, A. Surrogate Distraction Measurement Techniques: The lane change test. Driver Distraction: theory, effects and mitigation. CRC Press (2009). 107--121.",
      "doi": ""
    },
    {
      "text": "Notice on Visual-Manual NHTSA Driver Distraction Guidelines for In-Vehicle Electronic Devices, Dept. of Transportation, Federal Register 77.37, 2012.",
      "doi": ""
    },
    {
      "text": "Rensink, R.A., O'Regan, J.K. and Clark, J.J. To see or not to see: The need for attention to perceive changes in scenes. Psychological Science 8.5, 1997, 368--373.",
      "doi": ""
    },
    {
      "text": "Shaw, Robert L. Helmet-Mounted Display (HMD) Interface Design for Head-Up Display (HUD). Replacement Exploratory Development-NTL, Inc. NTI DAYTON, OH, 2002.",
      "doi": ""
    },
    {
      "text": "Tönnis, M. and Klinker, G. Effective control of a car driver's attention for visual and acoustic guidance towards the direction of imminent dangers. In Proc. ISMAR 2006, IEEE (2006). 13--22.  ",
      "doi": "10.1109/ISMAR.2006.297789"
    },
    {
      "text": "Tönnis, M., Sandor, C., Klinker, G., Lange, C. and Bubb, H. Experimental evaluation of an augmented reality visualization for directing a car driver's attention. Proc. ISMAR 2005. IEEE (2005). 56--5.  ",
      "doi": "10.1109/ISMAR.2005.31"
    }
  ]
}