{
  "doi": "10.1145/2556288.2557212",
  "title": "The presentation effect on graphical passwords",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2947-2950",
  "year": 2014,
  "badges": [],
  "abstract": "We provide a simple yet powerful demonstration of how an unobtrusive change to a graphical password interface can modify the distribution of user chosen passwords, and thus possibly the security it provides. The only change to the interface is how the background image is presented to the user in the password creation phase--we call the effect of this change the \"presentation effect\". We demonstrate the presentation effect by performing a comparative user study of two groups using the same background image, where the image is presented in two different ways prior to password creation. Our results show a statistically different distribution of user's graphical passwords, with no observed usability consequences.",
  "authors": [
    {
      "name": "Julie Thorpe",
      "institution": "University of Ontario Institute of Technology, Oshawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81315492475",
      "orcid": "missing"
    },
    {
      "name": "Muath Al-Badawi",
      "institution": "University of Ontario Institute of Technology, Oshawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958951557",
      "orcid": "missing"
    },
    {
      "name": "Brent MacRae",
      "institution": "University of Ontario Institute of Technology, Oshawa, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82459190857",
      "orcid": "missing"
    },
    {
      "name": "Amirali Salehi-Abari",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363606582",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Biddle, R., Chiasson, S., and Oorschot, P. C. van. Graphical Passwords: Learning from the First Twelve Years. ACM Computing Surveys 44(4) (2012).  ",
      "doi": "10.1145/2333112.2333114"
    },
    {
      "text": "Bulling, A., Alt, F., and Schmidt, A. Increasing the Security of Gaze-based Cued-recall Graphical Passwords Using Saliency Masks. In CHI (2012).  ",
      "doi": "10.1145/2207676.2208712"
    },
    {
      "text": "Chiasson, S., Stobert, E., Forget, A., Biddle, R., and Oorschot, P. C. van. Persuasive Cued Click-Points: Design, Implementation, and Evaluation of a Knowledge-Based Authentication Mechanism. IEEE TDSC 9(2) (2011), 222--235.  ",
      "doi": "10.1109/TDSC.2011.55"
    },
    {
      "text": "Dirik, A., Memon, N., and Birget, J.-C. Modeling User Choice in the PassPoints Graphical Password Scheme. In SOUPS (2007).  ",
      "doi": "10.1145/1280680.1280684"
    },
    {
      "text": "Dunphy, P., and Yan, J. Do Background Images Improve Draw-A-Secret Graphical Passwords? In ACM CCS (2007).  ",
      "doi": "10.1145/1315245.1315252"
    },
    {
      "text": "Forget, A., Chiasson, S., and Biddle, R. Shoulder-Surfing Resistance with Eye-Gaze Entry in Cued-Recall Graphical Passwords. In CHI (2010).  ",
      "doi": "10.1145/1753326.1753491"
    },
    {
      "text": "Hayashi, E., and Hong, J. A Diary Study of Password Usage in Daily Life. In CHI (2011).  ",
      "doi": "10.1145/1978942.1979326"
    },
    {
      "text": "Kim, S., Cao, X., Zhang, H., and Tan, D. Enabling Concurrent Dual Views on Common LCD Screens. In CHI (2012).  ",
      "doi": "10.1145/2207676.2208369"
    },
    {
      "text": "Oorschot, P. C. van, Salehi-Abari, A., and Thorpe, J. Purely Automated Attacks on Passpoints-Style Graphical Passwords. IEEE TIFS 5, 3 (2010), 393--405.  ",
      "doi": "10.1109/TIFS.2010.2053706"
    },
    {
      "text": "Oorschot, P. C. van, and Thorpe, J. Exploiting Predictability in Click-Based Graphical Passwords. JCS 19, 4 (2011), 669--702. ",
      "doi": "10.5555/2011216.2011218"
    },
    {
      "text": "Song Yeoh, K. (Photograph Courtesy of), 2013.",
      "doi": ""
    },
    {
      "text": "Thorpe, J., MacRae, B., and Salehi-Abari, A. Usability and Security Evaluation of GeoPass: a Geographic Location-Password Scheme. In SOUPS (2013).  ",
      "doi": "10.1145/2501604.2501618"
    },
    {
      "text": "Thorpe, J., Salehi-Abari, A., and Burden, R. Video-passwords: Advertising while authenticating. In NSPW (2012).  ",
      "doi": "10.1145/2413296.2413308"
    },
    {
      "text": "Wiedenbeck, S., Waters, J., Birget, J., Brodskiy, A., and Memon, N. PassPoints: Design and Longitudinal Evaluation of a Graphical Password System. Int. J. of Human-Computer Studies 63, 1--2 (2005), 102--127.  ",
      "doi": "10.1016/j.ijhcs.2005.04.010"
    }
  ]
}