{
  "doi": "10.1145/2556288.2557265",
  "title": "Designing usable web forms: empirical evaluation of web form improvement guidelines",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1275-1284",
  "year": 2014,
  "badges": [],
  "abstract": "This study reports a controlled eye tracking experiment (N = 65) that shows the combined effectiveness of 20 guidelines to improve interactive online forms when applied to forms found on real company websites. Results indicate that improved web forms lead to faster completion times, fewer form submission trials, and fewer eye movements. Data from subjective questionnaires and interviews further show increased user satisfaction. Overall, our findings highlight the importance for web designers to improve their web forms using UX guidelines.",
  "authors": [
    {
      "name": "Mirjam Seckler",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460656877",
      "orcid": "missing"
    },
    {
      "name": "Silvia Heinz",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442604791",
      "orcid": "missing"
    },
    {
      "name": "Javier A. Bargas-Avila",
      "institution": "Google, Inc., Zurich, ZH, Switzerland",
      "img": "/do/10.1145/contrib-81327487482/rel-imgonly/javierbargas.jpg",
      "acmid": "81327487482",
      "orcid": "missing"
    },
    {
      "name": "Klaus Opwis",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048343",
      "orcid": "missing"
    },
    {
      "name": "Alexandre N. Tuch",
      "institution": "University of Copenhagen & University of Basel (CH), Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597649",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aeberhard, A. (2011). FUS - Form Usability Scale. Development of a Usability Measuring Tool for Online Forms. Unpublished master's thesis. University of Basel, Switzerland.",
      "doi": ""
    },
    {
      "text": "Al-Saleh, M., Al-Wabil, A., Al-Attas, E., AlAbdulkarim, A., Chaurasia, M., Alfaifi, R. (2012). Inline immediate feedback in arabic web forms: An eye tracking study of transactional tasks. In Proc. IIT 2012, 333--338.",
      "doi": ""
    },
    {
      "text": "Bargas-Avila, J. A., Brenzikofer, O., Tuch, A. N., Roth, S. P., & Opwis, K. (2011a). Working towards usable forms on the World Wide Web: Optimizing date entry input fields. Advances in Human Computer Interaction, Article ID 202701.  ",
      "doi": "10.1155/2011/202701"
    },
    {
      "text": "Bargas-Avila, J. A., Brenzikofer, O., Tuch, A. N., Roth, S. P., & Opwis, K. (2011b). Working towards usable forms on the World Wide Web: Optimizing multiple selection interface elements. Advances in Human Computer Interaction, Article ID 347171.  ",
      "doi": "10.1155/2011/347171"
    },
    {
      "text": "Bargas-Avila, J.A., Oberholzer, G., Schmutz, P., de Vito, M. & Opwis, K. (2007). Usable Error Message Presentation in the World Wide Web: Don't Show Errors Right Away. Interacting with Computers, 19, 330--341.  ",
      "doi": "10.1016/j.intcom.2007.01.003"
    },
    {
      "text": "Bargas-Avila, J. A., Orsini, S., Piosczyk, H., Urwyler, D., & Opwis, K. (2010a). Enhancing online forms: Use format Specifications for fields with format restrictions to help respondents, Interacting with Computers, 23(1), 33--39.  ",
      "doi": "10.1016/j.intcom.2010.08.001"
    },
    {
      "text": "Bargas-Avila, J. A, Brenzikofer, O., Roth, S., Tuch, A. N., Orsini, S., & Opwis, K. (2010b). Simple but Crucial User Interfaces in the World Wide Web: Introducing 20 Guidelines for Usable Web Form Design. In: R. Matrai (Ed.), User Interfaces, 1--10. InTech.",
      "doi": ""
    },
    {
      "text": "Brooke, J. (1996). SUS: A Quick and Dirty Usability Scale. In: P. W. Jordan, B. Thomas, B. A. Weerdmeester & I. L. McClelland (Eds.), Usability Evaluation in Industry (pp. 189--194). London: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T. P., & Newell, A. (Eds.) (1983). The psychology of human computer interaction. Routledge. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Christian, L., Dillman, D., & Smyth, J. (2007). Helping respondents get it right the first time: the influence of words, symbols, and graphics in web surveys. Public Opinion Quarterly, 71(1), 113 - 125.",
      "doi": ""
    },
    {
      "text": "Couper, M., Tourangeau, R., Conrad, F., & Crawford, S. (2004). What they see is what we get: response options for web surveys. Social Science Computer Review, 22(1), 111--127.  ",
      "doi": "10.1177/0894439303256555"
    },
    {
      "text": "Field, A. (2009). Non-parametric tests. In Discovering statistics using SPSS (third edition., pp. 539--583). London: SAGE.",
      "doi": ""
    },
    {
      "text": "Duchowski, A. T. (2007). Eye tracking methodology: Theory and practice (Vol. 373). Springer. ",
      "doi": "10.5555/1215838"
    },
    {
      "text": "Harms, J. (2013). Research Goals for Evolving the \"Form\" User Interface Metaphor towards more Interactivity. Lecture Notes in Computer Science, 7946, 819--822.",
      "doi": ""
    },
    {
      "text": "Hart, S., & Staveland, L. (1988). Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. P. A. Hancock & N. Meshkati (Eds.). Human mental workload (pp. 139--183). Amsterdam: Elsevier Science.",
      "doi": ""
    },
    {
      "text": "Holmqvist, K., Nyström, M., Andersson, R., Dewhurst, R., Jarodzka, H., & Van de Weijer, J. (2011). Eye tracking: A comprehensive guide to methods and measures. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Idrus, Z., Razak, N. H. A., Talib, N. H. A., & Tajuddin, T. (2010). Using Three Layer Model (TLM) in web form design: WeFDeC checklist development. Computer Engineering and Applications (ICCEA), 385389.  ",
      "doi": "10.1109/ICCEA.2010.81"
    },
    {
      "text": "James, J., Beaumont, A., Stephens, J., Ullman, C. (2002). Usable Forms for the Web. Glasshaus, Krefeld.",
      "doi": ""
    },
    {
      "text": "Jarrett, C. & Ganey, G. (2008). Forms that work: Designing web forms for usability. Morgan Kaufmann. ",
      "doi": "10.5555/1522332"
    },
    {
      "text": "Karousos, N., Katsanos, C., Tselios, N., & Xenos, M. (2013). Effortless tool-based evaluation of web form filling tasks using keystroke level model and fitts law. In CHI'13 Extended Abstracts on Human Factors in Computing Systems, 1851--1856. ACM.  ",
      "doi": "10.1145/2468356.2468688"
    },
    {
      "text": "Koyani, S. (2006). Research-based web design & usability guidelines. US General Services Administration, Washington. ",
      "doi": "10.5555/1199496"
    },
    {
      "text": "Lewis, J. R. (1991). Psychometric evaluation of an after-scenario questionnaire for computer usability studies: The ASQ. SIGCHI Bulletin, 23(1), 78--81.  ",
      "doi": "10.1145/122672.122692"
    },
    {
      "text": "Money, A. G., Fernando, S., Elliman, T., & Lines, L. (2010). A trial protocol for evaluating assistive online forms for older adults. Proc. ECIS, Paper 90.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. (2005). Sixty Guidelines From 1986 Revisited. http://www.nngroup.com/articles/ sixty-guidelines-from-1986-revisited/",
      "doi": ""
    },
    {
      "text": "Nielsen, J., & Pernice, K. (2010). Eyetracking web usability. New Riders. ",
      "doi": "10.5555/1823564"
    },
    {
      "text": "Pauwels, S. L., Hübscher, C., Leuthold, S., BargasAvila, J. A. & Opwis, K. (2009). Error prevention in online forms: Use color instead of asterisks to mark required fields. Interacting with Computers, 21(4), 257262.  ",
      "doi": "10.1016/j.intcom.2009.05.007"
    },
    {
      "text": "Rukzio, E., Hamard, J., Noda, C., & De Luca, A. (2006). Visualization of Uncertainty in Context Aware Mobile Applications. In Proc. MobileHCI'06, 247--250.  ",
      "doi": "10.1145/1152215.1152267"
    },
    {
      "text": "Seckler, M., Heinz, S., Bargas-Avila, J.A., Opwis, K., & Tuch, A.N. (2013). Empirical evaluation of 20 web form optimization guidelines. In Proc. CHI '13, 18931898.  ",
      "doi": "10.1145/2468356.2468695"
    },
    {
      "text": "Seckler, M., Tuch, A. N., Opwis, K., & Bargas-Avila, J. A. (2012). User-friendly Locations of Error Messages in Web Forms: Put them on the right side of the erroneous input field. Interacting with Computers, 24(3), 107--118.  ",
      "doi": "10.1016/j.intcom.2012.03.002"
    },
    {
      "text": "Tullis, T., Pons, A., 1997. Designating required vs. optional input fields. In: Conference on Human Factors in Computing Systems. ACM New York, NY, USA, pp. 259--26  ",
      "doi": "10.1145/1120212.1120381"
    },
    {
      "text": "Wroblewski, L. (2008). Web Form Design: Filling in the Blanks. Rosenfeld Media. ",
      "doi": "10.5555/1386682"
    }
  ]
}