{
  "doi": "10.1145/2556288.2557185",
  "title": "Binding the material and the discursive with a relational approach of affordances",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3533-3542",
  "year": 2014,
  "badges": [],
  "abstract": "As Norman's vision of affordances developed twenty-six years ago is unable to address complex challenges faced by today's designers, we outline a view of affordances as discursive relations in HCI design. This argument is framed in the discussion of a larger trend of work beyond the HCI field, the scholarship on relational affordances from the fields of communication and organization studies. Through comparison and interrogation, we maintain a relational approach of affordances that bind the material and the discursive will help us to address design issues such as discursive power, cultural values, performed identities, mediated agency, and articulated voices in this increasingly globalized world and design culturally sensitive technology for transformation and emancipation. With a few cases, this paper deciphers the hidden power relationship of interaction design and suggests ways of we should design for social affordances.",
  "tags": [
    "materiality",
    "hci4d",
    "culture",
    "affordance",
    "critical design",
    "identity",
    "cross-cultural design",
    "discursive",
    "hci",
    "ideology"
  ],
  "authors": [
    {
      "name": "Huatong Sun",
      "institution": "University of Washington Tacoma, Tacoma, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442606389",
      "orcid": "missing"
    },
    {
      "name": "William F. Hart-Davidson",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498199",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albrechtsen, H., Andersen, H. H. K., Bødker, S., & Pejtersen, A. M. (2001). Affordances in Activity Theory and Cognitive Systems Engineering: Riso National Laboratory, Roskilde.",
      "doi": ""
    },
    {
      "text": "Bakhtin, M., M. (1981). The Dialogic Imagination Four Essays. Austin: University of Texas Press.",
      "doi": ""
    },
    {
      "text": "Baym, N. (2010). Personal connections in the digital age. UK, Polity.",
      "doi": ""
    },
    {
      "text": "Baerentsen, K., & Trettvik, J. (2002). An Activity Theory Approach to Affordance. In Proc. NordiCHI '02, ACM, 51--60.  ",
      "doi": "10.1145/572020.572028"
    },
    {
      "text": "Bardzell, J., and Bardzell, S. (2013). What is 'critical' about critical design? In Proc. CHI '13, ACM, 32973306.  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Bardzell, S. (2010). Feminist HCI: Taking stock and outlining an agenda for design. In Proc. CHI '10, ACM, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Bardzell, S. & Bardzell, J. (2011). Towards a feminist HCI methodology: social science, feminism, and HCI. In Proc. CHI '11, ACM, 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Bardzell, S., Bardzell, J., Forlizzi, J., Zimmerman, J., & Antanitis, J. (2012). Critical design and critical theory: the challenge of designing for provocation. In Proc. DIS '12, ACM, 288--297.  ",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Bloomfield, B, Latham, Y, & Vurdubakis, (2010). Bodies, Technologies and Action Possibilities: When is an Affordance? Sociology 44(3). 415--433.",
      "doi": ""
    },
    {
      "text": "Bødker, S. (2006). When second wave HCI meets third wave challenges. Proc. of NordiCHI'06, ACM Press.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Borning, A. and Muller, M. (2012). Next Steps for Value Sensitive Design. In Proc. CHI '12, ACM, 11251134.  ",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Chilana, P., Holsberry, C., Oliveira, F., Ko, A. (2012).Designing for a billion users: A case study of Facebook. In Proc. CHI '12, ACM, 419--431.  ",
      "doi": "10.1145/2212776.2212819"
    },
    {
      "text": "Christen, K. (2012). Does Information Really Want to be Free? Indigenous Knowledge Systems and the Question of Openness. International Journal of Communication, 6, 2870--2893.",
      "doi": ""
    },
    {
      "text": "Choudry, A., Majavu, M., & Wood, L. (May 2013). Struggles, strategies and analysis of anticolonial and postcolonial social movements. Interface, 5(1),1--10.",
      "doi": ""
    },
    {
      "text": "Cosenza, V. (December 2013). World map of social networks. http://vincos.it/world-map-of-social-networks/",
      "doi": ""
    },
    {
      "text": "DeSanctis, G., and Poole, M. S. (1994). \"Capturing the Complexityin Advanced Technology Use: Adaptive Structuration Theory,\" Organization Science (5:2), pp. 121--147.",
      "doi": "10.1287/orsc.5.2.121"
    },
    {
      "text": "Dourish, P. (2001). Where the action is. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "eMarketer. (August 3, 2012). US to Top Japan as World's Biggest Mobile Ad Market. http://www.emarketer.com/newsroom/index.php/topjapan-worlds-biggest-mobile-ad-market/",
      "doi": ""
    },
    {
      "text": "Faraj, S. & Azad, B. The materiality of technology: An affordance perspective. In Leonardi, P., Nardi, B. & Kallinikos, J. (eds), Materiality and Organizing: Social Interaction in a Technological World (pp, 237--258). New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Friedman, B. (Ed.). (1997). Human values and the design of computer technology. New York: Cambridge UP. ",
      "doi": "10.5555/278213"
    },
    {
      "text": "Friedman, B., and Nathan, L.P. (2010). Multi-lifespan information system design: A research initiative for the HCI community. In Proc. CHI '10, ACM, 2243--2246.  ",
      "doi": "10.1145/1753326.1753665"
    },
    {
      "text": "Fuchs, C. (2012). The political economy of privacy on Facebook. Television & New Media 13 (2): 139--159.",
      "doi": ""
    },
    {
      "text": "Gibson, J. J. (1979). The Ecological Approach to Visual Perception. Boston: Houghton Mifflin.",
      "doi": ""
    },
    {
      "text": "Giddens, A. (1984). The Constitution of Society. Berkeley, CA: University of California Press.",
      "doi": ""
    },
    {
      "text": "Graves, L. (2007). The affordances of blogging: A case study in culture and technological effects. Journal of Communication Inquiry 31, 4, 331--346.",
      "doi": ""
    },
    {
      "text": "Harrison, S. Tatar, D. and Sengers, P. (2007). The three paradigms of HCI. Ext. Abstracts CHI 2007, ACM.",
      "doi": ""
    },
    {
      "text": "Ho, M., Smyth, T., Kam, M., & Dearden, A. (2009). Human-computer interaction for development: The past, present, and future, Information Technologies & International Development, 5(4), URL: http://itidjournal.org/itid/article/view/420/188.",
      "doi": ""
    },
    {
      "text": "Hutchby, I. (2001a). \"Technologies, Texts and Affordances,\" Sociology (35:2), pp. 441--456.",
      "doi": ""
    },
    {
      "text": "Hutchby, I. (2001b). Conversation and technology: From the telephone to the Internet. Cambridge, UK: Polity Press.",
      "doi": ""
    },
    {
      "text": "Jung H, & Stolterman E. (2012). Digital form and materiality: propositions for a new approach to interaction design research. In Proc. NordiCHI '12, ACM, 645- 654.  ",
      "doi": "10.1145/2399016.2399115"
    },
    {
      "text": "Irani, L. Dourish, P. (2009) Postcolonial interculturality. In Proc. IWIC 2009, ACM Press, 249--252.  ",
      "doi": "10.1145/1499224.1499268"
    },
    {
      "text": "Irani, L., Vertesi, J. Dourish, P., Philip, K., Grinter, R. (2010). Postcolonial Computing: A Lens on Design and Development. In Proc. CHI '10, ACM, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Kaptelinin, V., and Nardi, B. (2012).Affordances in HCI: Toward a mediated perspective. In Proc. of CHI'12, ACM, 967--976.  ",
      "doi": "10.1145/2207676.2208541"
    },
    {
      "text": "Leonardi, P. M. (2010). Digital materiality? How artifacts without matter, matter. First Monday, 15(6). Retrieved from http://firstmonday.org",
      "doi": ""
    },
    {
      "text": "Leonardi, P. M. (2011). When flexible routines meet flexible technologies: Affordance, constraint, and the imbrication of human and material agencies. MIS Quarterly, 35, 147--167. ",
      "doi": "10.5555/2017483.2017492"
    },
    {
      "text": "Leonardi, P., Nardi, B. & Kallinikos, J. (2013). Materiality and Organizing: Social Interaction in a Technological World. New York: Oxford UP. ",
      "doi": "10.5555/2502638"
    },
    {
      "text": "Lewis, S. (2012). The tension between professional control and open participation. Information, Communication & Society; 15(6) 836--866.",
      "doi": ""
    },
    {
      "text": "Markus, ML, & Silver, MS. (2008). A Foundation for the Study of IT Effects: A New Look at DeSanctis and Poole's Concepts of Structural Features and Spirit. Journal of the Association for Information Systems, 9(10/11), 609--632.",
      "doi": ""
    },
    {
      "text": "Merritt, S. & Stolterman, E. (2012). Cultural hybridity and participatory design. PDC' 2012, 73--76.  ",
      "doi": "10.1145/2348144.2348168"
    },
    {
      "text": "Miller, C. R. (1984). Genre as Social Action. Quarterly Journal of Speech, 70(2), 151--167.",
      "doi": ""
    },
    {
      "text": "Nathan, L. P., & Friedman, B. (2010). Interacting with policy in a political world: Reflections from the Voices of the Rwanda Tribunal project. interactions, 17(5), 5659.  ",
      "doi": "10.1145/1836216.1836231"
    },
    {
      "text": "Neff, G., Jordan, T., & McVeigh-Schultz, J. (2012). Affordances, Technical Agency, and the Politics of Technologies of Cultural Production. Journal of Broadcasting & Electronic Media 56(2), pp. 299--313,",
      "doi": ""
    },
    {
      "text": "Nissenbaum, H. (2005). Values in Technical Design. In Encyclopedia of Science, Technology and Ethics. New York: Macmillan.",
      "doi": ""
    },
    {
      "text": "Norman, D. A. (1988). The Design of Everyday Things. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Orlikowski, W. J. (1992). The Duality of Technology: Rethinking the Concept of Technology in Organizations. Organization Science, 3(3), 398--427.",
      "doi": "10.1287/orsc.3.3.398"
    },
    {
      "text": "Orita, A., & Hada, H. (2009). Is that really you?: an approach to assure identity without revealing real-name online. In Proc. of the 5th ACM workshop on Digital identity management, ACM, 17--20.  ",
      "doi": "10.1145/1655028.1655034"
    },
    {
      "text": "Philip, K., Irani, L., Dourish, P. (2012). Postcolonial Computing: A Tactical Survey. Science, Technology, & Human Values, 7(3), 3--29.",
      "doi": ""
    },
    {
      "text": "Rau, P., Plocher, T., & Choong, Y. (2012). Crosscultural design for IT products and services. Boca Raton, FL: CRC Press.",
      "doi": ""
    },
    {
      "text": "Robles, E., and Wiberg, M. (2010). Texturing the \"Material Turn\" in interaction design. In Proc TEI'10, ACM, 137--144.  ",
      "doi": "10.1145/1709886.1709911"
    },
    {
      "text": "Selfe, C. L., & Richard J. Selfe, J. (1994). The Politics of the Interface: Power and Its Exercise in Electronic Contact Zones. College Composition and Communication, 45(4), 480--504.",
      "doi": ""
    },
    {
      "text": "Slack, J. D., & Wise, J. M. (2005). Culture + Technology: A primer. New York: Peter Lang.",
      "doi": ""
    },
    {
      "text": "Spinuzzi, C. (2003). Tracing Genres through Organizations: A Sociocultural Approach to Information Design. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Sun, H. (2004). Expanding the scope of localization: A cultural usability perspective on mobile text messaging use in American and Chinese contexts. Doctoral dissertation, Rensselaer Polytechnic Institute, Troy, NY. http://www.localisation.ie/resources/Awards/Theses/sun _diss.pdf.",
      "doi": ""
    },
    {
      "text": "Sun, H. (2006). The triumph of users: Achieving cultural usability goals with user localization. Technical Communication Quarterly, 15(4), 457--481.",
      "doi": ""
    },
    {
      "text": "Sun, H. (2009) Designing for a dialogic view of interpretation in cross-cultural IT design. In Proc. HCI International 2009, 4, Springer-Verlag, 108--116.  ",
      "doi": "10.1007/978-3-642-02767-3_12"
    },
    {
      "text": "Sun, H. (2012). Cross-cultural technology design: Creating culture-sensitive technology for local users. New York: Oxford UP.",
      "doi": ""
    },
    {
      "text": "Tayoma, K. (2010). Human-Computer Interaction and Global Development. Foundations and Trends in Human-Computer Interaction, 4(1), 1--79.  ",
      "doi": "10.1561/1100000021"
    },
    {
      "text": "Torres, I. (June 6, 2013). Japanese netizens seen moving away from Facebook. Available at http://japandailypress.com/japanese-netizens-seenmoving-away-from-facebook-0630137/",
      "doi": ""
    },
    {
      "text": "Treem, J.W. & Leonardi, P.M. (2012). Social Media Use in Organizations: Exploring the Affordances of Visibility, Editability, Persistence, and Association. Communication Yearbook, 36, 143--189.",
      "doi": ""
    },
    {
      "text": "van Dijck, J. (2013). 'You have one identity': performing the self on Facebook and LinkedIn. Media, culture, & society, 35(2), 199--215.",
      "doi": ""
    },
    {
      "text": "Vyas, D., Chisalita, C., & van de Veer, G. (2006). Affordance in interaction. In Proc. of the 13th Eurpoean conference on Cognitive ergonomics, ACM, 92--99.  ",
      "doi": "10.1145/1274892.1274907"
    },
    {
      "text": "Wiberg, M., Ishii, H., Dourish, P., Vallgårda, A., Kerridge, T., Sundström, P, Rosner, D., and Rolston, M. (2013). Materiality Matters. Interactions 20, 2, 54--57.  ",
      "doi": "10.1145/2427076.2427087"
    },
    {
      "text": "Wellman, B., Hasse, A., Boase, J., Chen, W., Hampton, K., Diaz, I., & Miyata, K. (2003). The Social Affordances of the Internet for Networked Individualism. Journal of Computer-Mediated Communication, 8, 3, 0-0.",
      "doi": ""
    },
    {
      "text": "Winner, L. (1980). Do Artifacts Have Politics? Daedalus, 109(1), 121--136.",
      "doi": ""
    }
  ]
}