{
  "doi": "10.1145/2556288.2557098",
  "title": "Research through design fiction: narrative in real and imaginary abstracts",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "703-712",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper reflects on the uses of prototypes in \"Research through Design\" and considers \"Design Fiction\" as a technique for exploring the potential value of new design work. It begins with an analysis of Research through Design abstracts in the ACM digital library and identifies an emerging language and structure of papers in this emerging field. The abstracts: frame a problem space, introduce a study, often involving the deployment of a prototype, and conclude with considerations, reflections and discussion. This format is then pastiched in a series of design fictions written for a project investigating new and emerging forms of reproduction in Art. The fictions take the form of \"imaginary abstracts\" which summarize findings of papers that have not been written about prototypes that do not exist. It is argued that framing concept designs as fictional studies can provide a space for research focused critique and development.",
  "authors": [
    {
      "name": "Mark Blythe",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100208849",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bakker, S., van den Hoven, E., and Eggen, B. (2013) FireFlies: physical peripheral interaction design for the everyday routine of primary school teachers. Proc. Of TEI '13. 57--64.  ",
      "doi": "10.1145/2460625.2460634"
    },
    {
      "text": "Bardzell, J., and Bardzell, S. (2013). What is \"critical\" about critical design? Proc. of CHI'2013. ACM: New York.  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Bardzell, S., Gross, S., Wain, J., Toombs, A., and Bardzell, J., (2011). The significant screwdriver: care, domestic masculinity, and interaction design. In Proc. of (BCSHCI '11). ",
      "doi": "10.5555/2305316.2305379"
    },
    {
      "text": "Bleecker, J.( 2009). \"Design Fiction: A Short Essay on Design, Science, Fact and Fiction\". http://drbfw5wfjlxon.cloudfront.net/writing/DesignFiction_WebEdition.pdf",
      "doi": ""
    },
    {
      "text": "Blythe, M. (2013) The Hitch Hiker's Guide to Ubikomp: using techniques from literary and critical theory to reframe scientific agendas. Personal and Ubiquitous Computing 2013  ",
      "doi": "10.1007/s00779-013-0679-6"
    },
    {
      "text": "Blythe, M., Briggs, J., Olivier, P. and Hook, J., 'Digital originals: reproduction as a space for design.' In Procs. of NordiCHI '12, ACM Press (2012), 1--10.  ",
      "doi": "10.1145/2399016.2399018"
    },
    {
      "text": "Blythe, M., and Dearden, A., (2009) Representing older people: towards meaningful images of the user in design scenarios. Universal Access in the Information Society. Vol. 8, Issue1 (2009), Page 21--32.  ",
      "doi": "10.1007/s10209-008-0128-x"
    },
    {
      "text": "Blythe M., and Wright P., (2006) Pastiche Scenarios: Fiction as a Resource for Experience Centred Design. Interacting with Computers. Volume 18, Issue 5 , September 2006, Pages 1139--1164.  ",
      "doi": "10.1016/j.intcom.2006.02.001"
    },
    {
      "text": "Boucher, A., Cameron, D., and Jarvis, N. (2012) Power to the people: dynamic energy management through communal cooperation. In Proc. Of DIS '12. ACM, New York, NY, USA, 612--620.  ",
      "doi": "10.1145/2317956.2318048"
    },
    {
      "text": "Branigan, E., (1992) Narrative Comprehension and Film, Routledge, London and New York.",
      "doi": ""
    },
    {
      "text": "Briggs, J. and Blythe ,M., 'Apps for art's sake: resistance and innovation'. In Procs. of Mobile HCI '13, ACM Press (2013), 45--54.  ",
      "doi": "10.1145/2493190.2493205"
    },
    {
      "text": "Briggs, P., Blythe, M., Vines, J., Lindsay, S., Dunphy, P., Nicholson, J., Green, D., Kitson, J., Monk, A., Olivier, P. (2012) Invisible Design: Exploring Insights and Ideas through Ambiguous Film Scenarios. In: DIS 2012, Newcastle upon Tyne, UK, 11-15 July.  ",
      "doi": "10.1145/2317956.2318036"
    },
    {
      "text": "Budd, J. M.. The Stapel Case: An Object Lesson in Research Integrity and Its Lapses. Synesis A Journal of Science, Technology, Ethics and Policy. 2013.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M. (1997) Scenario-based design. In: Helander, M., Landauer, T. K., and Prabhu, P., Editors, Handbook of Human-Computer Interaction, Elsevier.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M. (2000) Making Use: scenario based design of human-computer interactions. Cambridge. Mass MIT Press. ",
      "doi": "10.5555/517699"
    },
    {
      "text": "Carroll, J. M. and Rosson, M. B. (2003) Usability Engineering: Scenario Based Development of Human Computer Interaction. Morgan Kaufman. ",
      "doi": "10.5555/501581"
    },
    {
      "text": "Cooper, A. L. (1999) The Inmates Are Running the Asylum: Why High-Tech Products Drive Us Crazy and How to Restore the Sanity. Sams. Indianapolis. ",
      "doi": "10.5555/553473"
    },
    {
      "text": "DiSalvo, Carl. (2012) \"Spectacles and Tropes: Speculative Design and Contemporary Food Cultures.\" Fibreculture: Special Issue on Networked Utopias and Speculative Futures, Issue 20.",
      "doi": ""
    },
    {
      "text": "Dourish, P., and Bell, G., (2009) Resistance is Futile: Reading Science Fiction Alongside Ubiquitous Computing. http://www.dourish.com/publications/2009/scifi-pucdraft.pdf",
      "doi": ""
    },
    {
      "text": "Dunne, T. and Raby, F. (2013) United Micro Kingdoms (UMK) Design Fiction. The Design Museum.",
      "doi": ""
    },
    {
      "text": "Foucault, M. (1972) The Archaeology of Knowledge and the Discourse of Language. Pantheon.",
      "doi": ""
    },
    {
      "text": "Gayford, M. (2007) A Bigger Message: Conversations with David Hockney Thames and Hudson.",
      "doi": ""
    },
    {
      "text": "Gaver, W. (2012) What Should We Expect from Research Through Design. CHI 2012 pp. 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Gerber, E. (2011). Tech break up: a research method for understanding people's attachment to their technology. In ProProc. Of (C&C '11). ACM, New York, NY, USA, 137--146.  ",
      "doi": "10.1145/2069618.2069642"
    },
    {
      "text": "Goldacre, B. (2012) Bad Pharma: How drug companies mislead doctors and harm patients. Fourth Estate. London.",
      "doi": ""
    },
    {
      "text": "Gonzattoa, R. F., van Amstela, F., Merkleb, L. and Hartmann, T., (2013) The Ideology of the Future in Design Fictions. Digital Creativity vol. 24 no. 1.",
      "doi": ""
    },
    {
      "text": "Hales, D. Design Fictions an Introduction and Partial Taxonomy. Digital Creativity. Vol. 24, Issue 1. 2013. Special Issue: Design Fictions 30 Apr 2013.",
      "doi": ""
    },
    {
      "text": "Hengeveld, B., Voort, R., Hummels, C., de Moor, J., van Balkom, H., Overbeeke, K., and van der Helm, A. ( 2008) The development of LinguaBytes. Adv. in Hum.-Comp. Int. 2008.  ",
      "doi": "10.1155/2008/381086"
    },
    {
      "text": "Hook, J., Briggs, J., Blythe, M., Walsh, N. and Olivier, P., 'Repentir: digital exploration beneath the surface of an oil painting.' In Extended Abstracts of CHI '13, ACM Press (2013), 2947--2950.  ",
      "doi": "10.1145/2468356.2479581"
    },
    {
      "text": "Johnson, B. 2011. Science Fiction for Prototyping: Designing the Future with Science Fiction. San Francisco: Morgan and Claypool.",
      "doi": ""
    },
    {
      "text": "Kirman, B,. Linehan, C., Lawson, S. and O'Hara, D., (2013) CHI and the future Robot Enslavement of Mankind: A Retrospective. AltCHI CHI 2013.  ",
      "doi": "10.1145/2468356.2468740"
    },
    {
      "text": "Kim, Y. K., Row, Y. K., and Nam, T. J. (2012). Knoby: pet-like interactive door knob. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1685--1690.  ",
      "doi": "10.1145/2212776.2223693"
    },
    {
      "text": "Lem, S. (1973) Imaginary Magnitude. A Harvester book. New York.",
      "doi": ""
    },
    {
      "text": "Li, F., Blythe, M., Briggs, J., Hook, J. and Olivier, P., 'From \"digital originals\" to \"unlimited editions\": exploring new business models for digital art through case studies, research prototypes and design fictions.' 27th Annual British Academy of Management Conference, BAM2013.",
      "doi": ""
    },
    {
      "text": "Ludvigsen, M., and Veerasawmy, R. (2010). Designing technology for active spectator experiences at sporting events. In Proc. of OZCHI '10. ACM, New York, NY, USA, 96--103.  ",
      "doi": "10.1145/1952222.1952243"
    },
    {
      "text": "Markussen, T., and Knutz, E., (2013) The Poetics of Design Fiction. Proc of DPPI 2013. Newcastle.  ",
      "doi": "10.1145/2513506.2513531"
    },
    {
      "text": "Microsoft Office Labs. (2012). Website. Available at http://www.microsoft.com/office/labs/index.html (accessed 9 May 2012).",
      "doi": ""
    },
    {
      "text": "Morozov, E. (2013) To Save Everything Click Here: Technology, Solutionism and the Urge to Fix Problems That Don't Exist. Allen Lane Penguin Books.",
      "doi": ""
    },
    {
      "text": "Monk, A. F. (1998). Lightweight techniques to encourage innovative user interface design. In L. Wood (Ed.), User interface design: Bridging the gap from user requirements to design, Boca Raton: CRC Press. pp. 109--129.",
      "doi": ""
    },
    {
      "text": "Newell, A., Carmichael, A., Morgan, M., Dickinson, A. (2006) The use of theatre in requirements gathering and usability studies. Interacting with Computers, 18, Elsevier Science, 996--1011.  ",
      "doi": "10.1016/j.intcom.2006.05.003"
    },
    {
      "text": "Nielsen, L. (2002) From user to character: An investigation into user descriptions in scenarios. In proceedings of designing Interactive Systems (DIS '02). ACM Press pp. 99--104.  ",
      "doi": "10.1145/778712.778729"
    },
    {
      "text": "Odom, W., Zimmerman, J., Forlizzi, J., Choi, H., Meier, S., and Park, A., (2012). Investigating the presence, form and behavior of virtual possessions in the context of a teen bedroom. In Proc. of (CHI '12). ACM, New York, NY, USA, 327--336.  ",
      "doi": "10.1145/2207676.2207722"
    },
    {
      "text": "Ozenc, K. F., Brommer, J. P., Jeong, B.K., Shih, N., Au, K., and Zimmerman, J.. (2007). Reverse alarm clock: a research through design example of designing for the self. In Proc. of DPPI '07. ACM, New York, NY, USA, 392--406.  ",
      "doi": "10.1145/1314161.1314196"
    },
    {
      "text": "Park, S. Y. and Zimmerman, J. (2010). Investigating the opportunity for a smart activity bag. In proc. of CHI '10). ACM, New York, NY, USA, 2543--2552.  ",
      "doi": "10.1145/1753326.1753712"
    },
    {
      "text": "Pierce, J. and Paulos, E. (2013). Electric materialities and interactive technology. In Procs of CHI '13. ACM, New York, NY, USA, 119--128.  ",
      "doi": "10.1145/2470654.2470672"
    },
    {
      "text": "Schechner, R. (1988) Performance Theory. New York, London, Routledge.",
      "doi": ""
    },
    {
      "text": "Schön, D. A. (1992). Designing as reflective conversation with the materials of a design situation. Knowledge-Based Systems, 5(1), 3--14.",
      "doi": "10.1016/0950-7051%2892%2990020-G"
    },
    {
      "text": "Seligman, M., (2011) Flourish. Nicholas Brealey Publishing. London Boston.",
      "doi": ""
    },
    {
      "text": "Sterling, B. (2005) Shaping Things. MIT Press. Cambridge Massachusetts.",
      "doi": ""
    },
    {
      "text": "Sterling, B. (2009) Design Fictions. Interactions. Vol 16. Issue 3.  ",
      "doi": "10.1145/1516016.1516021"
    },
    {
      "text": "Sterling, B. 2013 Fantasy Prototypes and Real Disruption. Keynote NEXT Berlin 2013. http://www.youtube.com/watch?v=2VIoRYPZk68",
      "doi": ""
    },
    {
      "text": "Uriu, D., Namai, M., Tokuhisa, S., Kashiwagi, R., Inami, M., and Okude, N. (2012). panavi: recipe medium with a sensors-embedded pan for domestic users to master professional culinary arts. In Proc. of CHI '12. ACM, New York, NY, USA, 129--13.  ",
      "doi": "10.1145/2207676.2207695"
    },
    {
      "text": "Vidyarthi, J. Riecke B. E, and Gromala D. (2012). Sonic Cradle: designing for an immersive experience of meditation by connecting respiration to music. In Proc. of DIS '12. ACM, New York, NY, USA, 408--417  ",
      "doi": "10.1145/2317956.2318017"
    },
    {
      "text": "Vines, J., Thieme, A., Comber, R., Blythe, M., Wright, P., and Olivier, P. (2013). HCI in the Press: Online Public Reactions to Mass Media Portrayals of HCI Research. CHI 2013 Paris, France.  ",
      "doi": "10.1145/2470654.2466247"
    },
    {
      "text": "Weiser, M. (1991). The Computer of the 21st Century. Scientific American Special Issue on Communication, Computers and Networks.",
      "doi": ""
    },
    {
      "text": "Wright, P. C. and McCarthy, J. C. (2004) The value of the novel in designing for experience. In A. Pirhonen, C. Roast, P. Saariluoma, H. Isom (eds.). Future Interaction Design. Springer, Amsterdam, 9--30, 2004.",
      "doi": ""
    },
    {
      "text": "Wyche, S., and Chetty, M. (2013). \"I want to imagine how that place looks\": designing technologies to support connectivity between Africans living abroad and home. In Proc. of CHI '13. ACM, New York, NY, USA, 2755-2764.  ",
      "doi": "10.1145/2470654.2481381"
    },
    {
      "text": "Zimmerman, J. & Forlizzi, J. (2008). The Role of Design Artifacts in Design Theory Construction. Human Computer Interaction Institute. Paper 37.",
      "doi": ""
    }
  ]
}