{
  "doi": "10.1145/2556288.2557002",
  "title": "Help beacons: design and evaluation of an ad-hoc lightweight s.o.s. system for smartphones",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1485-1494",
  "year": 2014,
  "badges": [],
  "abstract": "We present the design and evaluation of a lightweight mobile S.O.S. system that facilitates ad-hoc communication between first responders and victims in emergency situations. Our approach leverages established protocols and standards in unforeseen ways to provide a platform supporting the creation of short-lived communication links. The system comprises two mobile applications: one victim application that allows the broadcasting of distress signals by a novel use of Wi-Fi SSIDs; and a responder application that allows first responders to discover and trace the people broadcasting the signals. The main difference of our system with other platforms enabling communication in crisis situations is that our system is independent from existing network infrastructure and runs on off-the-shelf, commercially available smartphones. We describe the results of our evaluation process in the context of both a design evaluation during a real-world emergency response exercise and of two user workshops in preparation for an upcoming large-scale exercise.",
  "authors": [
    {
      "name": "Amro Al-Akkad",
      "institution": "Fraunhofer Institute for Applied Information Technology (FIT), Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500656387",
      "orcid": "missing"
    },
    {
      "name": "Leonardo Ramirez",
      "institution": "Fraunhofer Headquarters, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363601116",
      "orcid": "missing"
    },
    {
      "name": "Alexander Boden",
      "institution": "Fraunhofer Institute for Applied Information Technology (FIT) & University of Siegen, Sankt Augustin, North-Rhine-Westfalia, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339490557",
      "orcid": "missing"
    },
    {
      "name": "Dave Randall",
      "institution": "University of Siegen, Siegen, NRW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659489828",
      "orcid": "0000-0001-8613-3477"
    },
    {
      "name": "Andreas Zimmermann",
      "institution": "Fraunhofer Institute for Applied Information Technology (FIT), Sankt Augustin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100591670",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Al-Akkad, A., et al. Reconstructing normality: The use of infrastructure leftovers in crisis situations as inspiration for the design of resilient technology. Proc. OzCHI'13, ACM Press (2013), 457--466.  ",
      "doi": "10.1145/2541016.2541051"
    },
    {
      "text": "Android Issue 30880: Wi-Fi Direct API for connection acceptance. http://bit.ly/ZTbwLM",
      "doi": ""
    },
    {
      "text": "Bambuser. http://bambuser.com/",
      "doi": ""
    },
    {
      "text": "Battlemesh mailing list Still no ad-hoc in Android 4.0 \"Ice Cream Sandwich\"? http://bit.ly/Z0pVDA",
      "doi": ""
    },
    {
      "text": "Camps-Mur, D., Garcia-Saavedra, A., and Serrano, P. Device-to-device communications with Wi-Fi Direct: overview and experimentation. IEEE Wireless Communications 20, 3 (2013), 96--104.",
      "doi": ""
    },
    {
      "text": "Conti, G. Guest Editor's Introduction. CACM 49, 6 (2006), 32--36.  ",
      "doi": "10.1145/1132469.1132497"
    },
    {
      "text": "Convertino, G., et al. Supporting common ground and awareness in emergency management planning: A design research project. ACM TOCHI 18, 4 (2011), 134.  ",
      "doi": "10.1145/2063231.2063236"
    },
    {
      "text": "Edwards, W.K., et al. The challenges of user-centered design and evaluation for infrastructure. Proc. CHI 2003, ACM Press (2003), 297--304.  ",
      "doi": "10.1145/642611.642664"
    },
    {
      "text": "Federal Emergency Management Agency (FEMA) FEMA App, USA.gov http://1.usa.gov/P8V5sf",
      "doi": ""
    },
    {
      "text": "HackHut Emergency S.O.S. Beacon. http://bit.ly/X2PEvE",
      "doi": ""
    },
    {
      "text": "Hossmann, T., et al. Twitter in disaster mode: Opportunistic Communication and Distribution of Sensor Data in Emergencies. Proc. ExtremeCom 2011, ACM Press (2011), 1--6.  ",
      "doi": "10.1145/2414393.2414394"
    },
    {
      "text": "Jones, C. Android Solidifies Smartphone Market Share, Forbes.com, 2013. http://onforb.es/X3u5wt",
      "doi": ""
    },
    {
      "text": "Krishnamoorthy, S. and Agrawala, A. Context-aware, technology enabled social contribution for public safety using M-Urgency. Proc. MobileHCI 2012, ACM Press (2012), 123--132.  ",
      "doi": "10.1145/2371574.2371594"
    },
    {
      "text": "Lien, Y.N., Li-Cheng, C., and Chih-Chieh, H. A Multihop Walkie-Talkie-Like Emergency Communication System for Catastrophic Natural Disasters. Proc. ICPPW 2010, (2010), 527--532.  ",
      "doi": "10.1109/ICPPW.2010.77"
    },
    {
      "text": "Lukowicz, P., Baker, M.G., and Paradiso, J. Guest Editors' Introduction: Hostile Environments. IEEE Pervasive Computing 9, 4 (2010), 13--15.  ",
      "doi": "10.1109/MPRV.2010.80"
    },
    {
      "text": "Martin-Campillo, A., et al. Using Haggle to create an electronic triage tag. Proc. MobiOpp Workshop 2010, ACM Press (2010), 167--170.  ",
      "doi": "10.1145/1755743.1755775"
    },
    {
      "text": "Network Working Group RFC 3748 - Extensible Authentication Protocol (EAP), 2004. http://tools.ietf.org/html/rfc3748",
      "doi": ""
    },
    {
      "text": "NowForce Inc. http://www.nowforce.com/",
      "doi": ""
    },
    {
      "text": "Open Garden Inc. http://opengarden.com/",
      "doi": ""
    },
    {
      "text": "Palen, L. and Liu, S.B. Citizen communications in crisis: anticipating a future of ICT-supported public participation. Proc. CHI 2007, ACM Press (2007), 727736.  ",
      "doi": "10.1145/1240624.1240736"
    },
    {
      "text": "Ramirez, L., et al. Landmarke: an ad hoc deployable ubicomp infrastructure to support indoor navigation of firefighters. PUC 16, 8 (2012), 1025--1038.  ",
      "doi": "10.1007/s00779-011-0462-5"
    },
    {
      "text": "SafeCity Get live information from the society. http://www.safecity.nl/english/",
      "doi": ""
    },
    {
      "text": "Shanshan, L., et al. Device discovery and connection establishment approach using Ad-Hoc Wi-Fi for opportunistic networks. Proc. PERCOM 2011 Workshops, (2011), 461--466.",
      "doi": ""
    },
    {
      "text": "Shklovski, I., Palen, L., and Sutton, J. Finding community through information and communication technology in disaster response. Proc. CSCW 2008, ACM Press (2008), 127--136.  ",
      "doi": "10.1145/1460563.1460584"
    },
    {
      "text": "Simpson, P.V. Internet savvy Swedes launch \"Angry note 2.0\". The Local (Swedish News). http://bit.ly/bGnhsM",
      "doi": ""
    },
    {
      "text": "Starbird, K. and Stamberger, J. Tweak the Tweet: Leveraging Microblogging Proliferation with a Prescriptive Syntax to Support Citizen Reporting. Proc. ISCRAM 2010, ISCRAM Press.",
      "doi": ""
    },
    {
      "text": "Starbird, K. and Palen, L. \"Voluntweeters\": selforganizing by digital volunteers in times of crisis. Proc. CHI 2011, ACM Press (2011), 1071--1080.  ",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Su, J., et al. Haggle: seamless networking for mobile applications. Proc. UbiComp 2007, Springer Press (2007), 391--408. ",
      "doi": "10.5555/1771592.1771615"
    },
    {
      "text": "Toups, Z.O., et al. Zero-fidelity simulation of fire emergency response: improving team coordination learning. Proc. CHI 2011, ACM Press (2011), 19591968.  ",
      "doi": "10.1145/1978942.1979226"
    },
    {
      "text": "Trifunovic, S., et al. WiFi-Opp: ad-hoc-less opportunistic networking. Proc. CHANTS 2011, ACM Press (2011), 37--42.  ",
      "doi": "10.1145/2030652.2030664"
    },
    {
      "text": "Turoff, M. Past and future emergency response information systems. CACM 45, 4 (2002), 29--32.  ",
      "doi": "10.1145/505248.505265"
    },
    {
      "text": "Ushahidi Ushahidi Crowdmap. http://www.ushahidi.com/",
      "doi": ""
    },
    {
      "text": "Wong, M.P., A; Clement, A. Reading Service Set Identifiers (SSIDs): Marking and Locating for Public and Private Wireless Spaces. Proc. AOIR'07, (2007).",
      "doi": ""
    },
    {
      "text": "Yau, N. Political allegiance via wireless network SSIDs, mapped, FlowingData. http://bit.ly/LulXy2",
      "doi": ""
    },
    {
      "text": "Yu, H. The power of thumbs: the politics of SMS in urban China. Graduate Journal of Asia-Pacific Studies 2, 2 (2004), 30--43.",
      "doi": ""
    }
  ]
}