{
  "doi": "10.1145/2556288.2557187",
  "title": "Let me catch this!: experiencing interactive 3D cinema through collecting content with a mobile phone",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1011-1020",
  "year": 2014,
  "badges": [],
  "abstract": "The entertainment industry is going through a transformation, and technology development is affecting how we can enjoy and interact with the entertainment media content in new ways. In our work, we explore how to enable interaction with content in the context of 3D cinemas. This allows viewers to use their mobile phone to retrieve, for example, information on the artist of the soundtrack currently playing or a discount coupon on the watch the main actor is wearing. We are particularly interested in the user experience of the interactive 3D cinema concept, and how different interactive elements and interaction techniques are perceived. We report on the development of a prototype application utilizing smart phones and on an evaluation in a cinema context with 20 participants. Results emphasize that designing for interactive cinema experiences should drive for holistic and positive user experiences. Interactive content should be tied together with the actual video content, but integrated into contexts where it does not conflict with the immersive experience with the movie.",
  "authors": [
    {
      "name": "Jonna R. Häkkilä",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/do/10.1145/contrib-81100417488/rel-imgonly/prof_jonna_hakkila.png",
      "acmid": "81100417488",
      "orcid": "missing"
    },
    {
      "name": "Maaret Posti",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550039856",
      "orcid": "missing"
    },
    {
      "name": "Stefan Schneegass",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81503680798/rel-imgonly/stefan_wide.png",
      "acmid": "81503680798",
      "orcid": "0000-0002-0132-4934"
    },
    {
      "name": "Florian Alt",
      "institution": "University of Munich, München, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    },
    {
      "name": "Kunter Gultekin",
      "institution": "University of Oulu, Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958865657",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Alt, F., Schneegass, S., Girgis, M., and Schmidt, A. Cognitive effects of interactive public display applications. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays, PerDis '13, ACM (New York, NY, USA, 2013), 13--18.  ",
      "doi": "10.1145/2491568.2491572"
    },
    {
      "text": "Alt, F., Shirazi, A. S., Kubitza, T., and Schmidt, A. Interaction techniques for creating and exchanging content with public displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), 1709--1718.  ",
      "doi": "10.1145/2470654.2466226"
    },
    {
      "text": "Atkinson, S. Crossed lines. In Proceedings of the 3rd International Conference on Digital Interactive Media in Entertainment and Arts, DIMEA '08, ACM (New York, NY, USA, 2008), 537--538.  ",
      "doi": "10.1145/1413634.1413744"
    },
    {
      "text": "Benedek, J., and Miner, T. Measuring desirability: New methods for evaluating desirability in a usability lab setting. Proceedings of Usability Professionals Association 2003 (2002), 8--12.",
      "doi": ""
    },
    {
      "text": "Broy, N., Alt, F., Schneegass, S., Henze, N., and Schmidt, A. Perceiving layered information on 3d displays using binocular disparity. In Proceedings of the 2Nd ACM International Symposium on Pervasive Displays, PerDis '13, ACM (New York, NY, USA, 2013), 61--66.  ",
      "doi": "10.1145/2491568.2491582"
    },
    {
      "text": "Finamore, A., Mellia, M., Munafò, M. M., Torres, R., and Rao, S. G. Youtube everywhere: Impact of device and infrastructure synergies on user experience. In Proceedings of the 2011 ACM SIGCOMM Conference on Internet Measurement Conference, IMC '11, ACM (New York, NY, USA, 2011), 345--360.  ",
      "doi": "10.1145/2068816.2068849"
    },
    {
      "text": "Forlizzi, J., and Battarbee, K. Understanding experience in interactive systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, DIS '04, ACM (New York, NY, USA, 2004), 261--268.  ",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Häkkinen, J., Kawai, T., Takatalo, J., Mitsuya, R., and Nyman, G. What do people look at when they watch stereoscopic movies' In IS&T/SPIE Electronic Imaging, International Society for Optics and Photonics (2010), 75240E--75240E.",
      "doi": ""
    },
    {
      "text": "Hassenzahl, M. User experience (ux): Towards an experiential perspective on product quality. In Proceedings of the 20th International Conference of the Association Francophone D'Interaction Homme-Machine, IHM '08, ACM (New York, NY, USA, 2008), 11--15.  ",
      "doi": "10.1145/1512714.1512717"
    },
    {
      "text": "Hassenzahl, M., and Tractinsky, N. User experience - a research agenda. Behaviour & Information Technology 25, 2 (2006), 91--97.",
      "doi": ""
    },
    {
      "text": "Jumisko-Pyykkö, S., Weitzel, M., and Strohmeier, D. Designing for user experience: What to expect from mobile 3d tv and video' In Proceedings of the 1st International Conference on Designing Interactive User Experiences for TV and Video, UXTV '08, ACM (New York, NY, USA, 2008), 183--192.  ",
      "doi": "10.1145/1453805.1453841"
    },
    {
      "text": "Karukka, M., Nisula, P., Häkkilä, J., and Kangasoja, J. Charting the audience perceptions of projected 3d media installations. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia, MUM '12, ACM (New York, NY, USA, 2012), 48:1--48:2.  ",
      "doi": "10.1145/2406367.2406426"
    },
    {
      "text": "Kooi, F. L., and Toet, A. Visual comfort of binocular and 3d displays. Displays 25, 2 (2004), 99--108.",
      "doi": ""
    },
    {
      "text": "Lambooij, M. T., IJsselsteijn, W. A., Heynderickx, I., et al. Visual discomfort in stereoscopic displays: a review. Stereoscopic Displays and Virtual Reality Systems XIV 6490, 1 (2007).",
      "doi": ""
    },
    {
      "text": "Law, E., Roto, V., Vermeeren, A. P., Kort, J., and Hassenzahl, M. Towards a shared definition of user experience. In CHI '08 Extended Abstracts on Human Factors in Computing Systems, CHI EA '08, ACM (New York, NY, USA, 2008), 2395--2398.  ",
      "doi": "10.1145/1358628.1358693"
    },
    {
      "text": "Law, E. L.-C., Roto, V., Hassenzahl, M., Vermeeren, A. P., and Kort, J. Understanding, scoping and defining user experience: A survey approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '09, ACM (New York, NY, USA, 2009), 719--728.  ",
      "doi": "10.1145/1518701.1518813"
    },
    {
      "text": "Mizobuchi, S., Terasaki, S., Häkkinen, J., Heinonen, E., Bergquist, J., and Chignell, M. The effect of stereoscopic viewing in a word-search task with a layered background. Journal of the Society for Information Display 16, 11 (2008), 1105--1113.",
      "doi": ""
    },
    {
      "text": "Nakatsu, R., Rauterberg, M., and Vorderer, P. A new framework for entertainment computing: From passive to active experience. In Proceedings of Entertainment Computing, ICEC 2005. Springer Berlin Heidelberg, 2005, 1--12.  ",
      "doi": "10.1007/11558651_1"
    },
    {
      "text": "Pakanen, M., Arhippainen, L., Vatjus-Anttila, J., and Pakanen, O.-P. Visual indication while sharing items from a private 3d portal room ui to public virtual environments. In Proceedings of INTERACT 2013. Springer Berlin Heidelberg, 2013, 737--744.",
      "doi": "10.1007/978-3-642-40498-6_68"
    },
    {
      "text": "Pölönen, M., Järvenpää, T., and Bilcu, B. Stereoscopic 3d entertainment and its effect on viewing comfort: Comparison of children and adults. Applied Ergonomics 44, 1 (2013), 151--160.",
      "doi": ""
    },
    {
      "text": "Pölönen, M., Salmimaa, M., Takatalo, J., and Häkkinen, J. Subjective experiences of watching stereoscopic avatar and u2 3d in a cinema. Journal of Electronic Imaging 21, 1 (2012), 011006--1.",
      "doi": ""
    },
    {
      "text": "Rashid, U., Kauko, J., Häkkilä, J., and Quigley, A. Proximal and distal selection of widgets: Designing distributed ui for mobile interaction with large display. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services, MobileHCI '11, ACM (New York, NY, USA, 2011), 495--498.  ",
      "doi": "10.1145/2037373.2037446"
    },
    {
      "text": "Ronkainen, S., Häkkilä, J., Kaleva, S., Colley, A., and Linjama, J. Tap input as an embedded interaction method for mobile devices. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction, TEI '07, ACM (New York, NY, USA, 2007), 263--270.  ",
      "doi": "10.1145/1226969.1227023"
    },
    {
      "text": "Roto, V. Temporal and granular nature of user experience. In Proceedings of the Nordic Conference on Experience (2008).",
      "doi": ""
    },
    {
      "text": "Sahami Shirazi, A., Rohs, M., Schleicher, R., Kratz, S., Müller, A., and Schmidt, A. Real-time nonverbal opinion sharing through mobile phones during sports events. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (New York, NY, USA, 2011), 307--310.  ",
      "doi": "10.1145/1978942.1978985"
    },
    {
      "text": "Strothoff, S., Valkov, D., and Hinrichs, K. Triangle cursor: Interactions with objects above the tabletop. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces, ITS '11, ACM (New York, NY, USA, 2011), 111--119.  ",
      "doi": "10.1145/2076354.2076377"
    },
    {
      "text": "Sunnari, M., Arhippainen, L., Pakanen, M., and Hickey, S. Studying user experiences of autostereoscopic 3d menu on touch screen mobile device. In Proceedings of the 24th Australian Computer-Human Interaction Conference, OzCHI '12, ACM (New York, NY, USA, 2012), 558--561.  ",
      "doi": "10.1145/2414536.2414622"
    },
    {
      "text": "Teather, R. J., and Stuerzlinger, W. Pointing at 3d target projections with one-eyed and stereo cursors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), 159--168.  ",
      "doi": "10.1145/2470654.2470677"
    },
    {
      "text": "Verdugo, R., Nussbaum, M., Corro, P., Nunnez, P., and Navarrete, P. Interactive films and coconstruction. ACM Trans. Multimedia Comput. Commun. Appl. 7, 4 (Dec. 2011), 39:1--39:24.  ",
      "doi": "10.1145/2043612.2043617"
    }
  ]
}