{
  "doi": "10.1145/2556288.2557281",
  "title": "A game-based learning approach to road safety: the code of everand",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3389-3398",
  "year": 2014,
  "badges": [],
  "abstract": "Game and gamification elements are increasingly seeing use as part of interface designs for applications seeking to engage and retain users whilst transferring information. This paper presents an evaluation of a game-based approach seeking to improve the road safety behaviour amongst children aged 9-15 within the UK, made available outside of a classroom context as an online, browser-based, free-to-play game. The paper reports on data for 99,683 players over 315,882 discrete logins, supplemented by results from a nationally-representative survey of children at UK schools (n=1,108), an incentivized survey of the player-base (n=1,028), and qualitative data obtained through a series of one-to-one interviews aged 9-14 (n=28). Analysis demonstrates the reach of the game to its target demographic, with 88.13% of players within the UK. A 3.94 male/female ratio was observed amongst players surveyed, with an age distribution across the target range of 9-15. Noting mean and median playtimes of 93 and 31 minutes (n=99,683), it is suggested such an approach to user engagement and retention can surpass typical contact times obtained through other forms of web-based content. The size of the player-base attracted to the game and players' qualitative feedback demonstrates the potential for serious games deployed on a national scale.",
  "authors": [
    {
      "name": "Ian Dunwell",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461649040",
      "orcid": "missing"
    },
    {
      "name": "Sara de Freitas",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314488313",
      "orcid": "missing"
    },
    {
      "name": "Panagiotis Petridis",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320493987",
      "orcid": "missing"
    },
    {
      "name": "Maurice Hendrix",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659775510",
      "orcid": "missing"
    },
    {
      "name": "Sylvester Arnab",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384602181",
      "orcid": "missing"
    },
    {
      "name": "Petros Lameras",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84458720257",
      "orcid": "missing"
    },
    {
      "name": "Craig Stewart",
      "institution": "Coventry University, Coventry, West Midlands, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387604937",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "C. Kapp, \"WHO acts on road safety to reverse accident trends.,\" Lancet 362 (2003), 1125--1130.",
      "doi": ""
    },
    {
      "text": "T. B. Cole, \"Global road safety crisis remedy sought: 1.2 million killed, 50 million injured annually,\" Journal of the American Medical Association (JAMA) 291 (2004), 2531--2532.",
      "doi": ""
    },
    {
      "text": "P. M. Kato, S. W. Cole, A. S. Bradlyn, and B. H. Pollock, \"A Video Game Improves Behavioral Outcomes in Adolescents and Young Adults With Cancer: A Randomized Trial,\" Pediatrics 122 (2008), 305--317.",
      "doi": ""
    },
    {
      "text": "M. S. Zeedyk and L. Wallace, \"Tackling children's road safety through edutainment: An evaluation of effectiveness.,\" Health Education Research: Theory and Practice, 18 (2003), 493--503.",
      "doi": ""
    },
    {
      "text": "E. H. C. Gámez, P. Cairns, J. Gow, J. Back, and E. Capstick, \"Video games as research instruments,\" in Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems, Atlanta, Georgia, USA (2010), 4493--4496.  ",
      "doi": "10.1145/1753846.1754182"
    },
    {
      "text": "C. V. Platt, A. B. Clayton, S. M. Pringle, G. Butler, and M. A. Colgan, Road safety education for children transferring to secondary school. London, UK: Department for Transport (2003).",
      "doi": ""
    },
    {
      "text": "M. A. Elliott and C. J. Baughan, Adolescent road user behaviour: A survey of 11--16 year olds. Crowthorne, UK: Transport Research Laboratory Ltd. (2003).",
      "doi": ""
    },
    {
      "text": "D. J. Terry, M. A. Hogg, and K. M. White, \"The theory of planned behaviour: self-identity, social identity and group norms,\" British Journal of Social Psychology, 38 (1999), 225--244.",
      "doi": ""
    },
    {
      "text": "V. J. Stretcher, J. A. Baumeister, J. Shope, C. Chang, M. H. Newport-Berra, A. Giroux, and E. Guay, \"Intervention modalities to address relevant psychosocial predictors of driving behaviour among adolescents: Primary report, road safety research No. 70,\" London, UK: Department for Transport (2007).",
      "doi": ""
    },
    {
      "text": "K. Ampofo-Boateng and J. A. Thomson, \"Children's perception of safety and danger on the road,\" British Journal of Psychology, 82 (1991), 487--505.",
      "doi": ""
    },
    {
      "text": "R. Pratchett, \"Gamers in the UK: Digital play, digital lifestyles.\" London, UK: British Broadcasting Corporation (2005).",
      "doi": ""
    },
    {
      "text": "L. A. Annetta, M. R. Murray, S. G. Laird, S. C. Bohr, and J. C. Park, \"Serious Games: Incorporating Video Games in the Classroom,\" EDUCAUSE Quarterly, 29 (2006).",
      "doi": ""
    },
    {
      "text": "P. Backlund, H. Engstrom, M. Johannesson, and M. Lebram, \"Games for traffic education: An experimental study of a game-based driving simulator,\" Simulation and Gaming, 41 (2010), 145--169.  ",
      "doi": "10.1177/1046878107311455"
    },
    {
      "text": "L. Renaud and S. Suissa, \"Evaluation of the efficacy of simulation games in traffic safety education of kindergarten children,\" American Journal of Public Health, 79 (1989), 307--309.",
      "doi": ""
    },
    {
      "text": "M. Zyda, \"From Visual Simulation to Virtual Reality to Games,\" Computer, 38 (2005), 25--32.  ",
      "doi": "10.1109/MC.2005.297"
    },
    {
      "text": "A. Bandura, Social Learning Theory. Englewood Cliffs, NJ: Prentice-Hall (1977).",
      "doi": ""
    },
    {
      "text": "K. J. Klauer, \"Teaching for analogical transfer as a means of improving problem-solving, thinking and learning,\" Instructional Science, 18 (1989), 179--192.",
      "doi": ""
    },
    {
      "text": "M. G. Bradford, B. T. Robson, and R. Tye, \"Constructing an urban deprivation index: a way of meeting the need for flexibility\", Environmental Planning A, 27 (1995), 519--533.",
      "doi": ""
    },
    {
      "text": "R. Bartle, Designing Virtual Worlds. Berkeley, CA: New Riders (2003). ",
      "doi": "10.5555/1196681"
    },
    {
      "text": "J. Dyck, D. Pinelle, B. Brown and C. Gutwin, \"Learning from Games: HCI Design Innovations in Entertainment Software\". in Proceedings of Graphics Interface (2003), 237--246.",
      "doi": ""
    },
    {
      "text": "A. H. Jørgensen, \"Marrying HCI/Usability and computer games: a preliminary look\", in Proceedings of the third Nordic conference on Human-computer interaction, ACM (2004), 393--396.  ",
      "doi": "10.1145/1028014.1028078"
    },
    {
      "text": "C. Liu, R. W. White, S. Dumais, \"Understanding web browsing behaviors through Weibull analysis of dwell time\", in Proceedings of the 33rd International ACM SIGIR Conference on Research and Development in Information Retrieval, SIGIR. ACM (2010) 379--386.  ",
      "doi": "10.1145/1835449.1835513"
    },
    {
      "text": "H. Weinreich, H. Obendorf, E. Herder, M. Mayer, M., \"Not quite the average: An empirical study of Web use\". ACM Transactions on the Web, 2 (2008), 5:1--5:31.  ",
      "doi": "10.1145/1326561.1326566"
    }
  ]
}