{
  "doi": "10.1145/2556288.2557363",
  "title": "Understanding user adaptation strategies for the launching of facebook timeline",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2421-2430",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "This paper applies coping theory to understand user adaptation strategies to major interface changes on Social Networking Sites (SNSs). Specifically, we qualitatively examine 1,149 user comments posted to the Facebook's official Timeline blog in order to get a large and unobtrusive sample of real Facebook users' perceptions about the launch of Timeline. Our data suggests a high level of stress associated with the transition to the new interface introduced by Timeline. We also found evidence which suggests that increasing users' perceptions of control over major interface changes may help facilitate user adaptation to these changes. This study offers valuable insights to SNSs for mitigating user stress and facilitating successful adaptation during major interface changes.",
  "authors": [
    {
      "name": "Pamela Wisniewski",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81498641142/rel-imgonly/wisniewski.jpg",
      "acmid": "81498641142",
      "orcid": "0000-0002-6223-1029"
    },
    {
      "name": "Heng Xu",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414616940",
      "orcid": "missing"
    },
    {
      "name": "Yunan Chen",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131427",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baumer, E., Adams, P., Khovanskaya, V., Liao, T., Smith, M., Sosik, V. S. and Williams, K. Limiting, Leaving, and (re)Lapsing: An Exploratoration of Facebook Non-Use Practices and Experiences. In Proc. Conference on Human Factors in Computing Systems (2013).  ",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Beaudry, A. and Pinsonneault, A. Understanding User Responses to Information Technology: A Coping Model of User Adaptation. MIS Quarterly, 29, 3 (2005), 493--524. ",
      "doi": "10.5555/2017264.2017271"
    },
    {
      "text": "boyd, D. Friends, friendsters, and myspace top 8: Writing community into being on social network sites. First Monday, 11, 2 (2006).",
      "doi": ""
    },
    {
      "text": "DeNinno, N. Facebook Timeline Mandatory Date Set for May 21. 2012, http://www.ibtimes.com/facebook-timeline-mandatory-date-set-may-21-final-rollout-coming-next-week-report-698346.",
      "doi": ""
    },
    {
      "text": "Facebook. The Facebook Blog. 2011, https://blog.facebook.com/blog.php'post=10150408488962131.",
      "doi": ""
    },
    {
      "text": "Facebook. Introducing Timeline: Tell your life story with a new kind of profile. 2011, https://www.facebook.com/about/timeline.",
      "doi": ""
    },
    {
      "text": "Facebook. Timeline. 2013, http://newsroom.fb.com/Timeline.",
      "doi": ""
    },
    {
      "text": "Horney, K. Our Inner Conflicts: A Constructive Theory of Neurosis. W. W. Norton & Company Inc, New York, 1945.",
      "doi": ""
    },
    {
      "text": "Kincaid, J. Facebook News Feed Gets Smarter - And the Ticker Makes Its Big Debut. 2011, http://techcrunch.com/2011/09/20/facebook-news-feedgets-smarter%E2%80%94%C2%A0and-the-tickermakes-its-big-debut/.",
      "doi": ""
    },
    {
      "text": "Lampe, C., Ellison, N. B. and Steinfield, C. Changes in use and perception of facebook. In Proc. Proceedings of the 2008 ACM conference on Computer supported cooperative work (2008), 721--730.  ",
      "doi": "10.1145/1460563.1460675"
    },
    {
      "text": "Lazarus, R. S. and Folkman, S. Stress, Appraisal, and Coping. Springer Publishing Company, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Perez, S. Rolls Out Changes to Chat, Other Experiments, Leads to Problems. 2011, http://techcrunch.com/2011/08/11/facebook-rolls-out-changes-to-chat-other-experiments-leads-to-problems/.",
      "doi": ""
    },
    {
      "text": "Shi, P., Xu, H. and Chen, Y. Using contextual integrity to examine interpersonal information boundary on social network sites. In Proc. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2013), 35--38.  ",
      "doi": "10.1145/2470654.2470660"
    },
    {
      "text": "SodaHead. Public Opinion Rejects Facebook's Changes. 2011, http://www.sodahead.com/united-states/public-opinion-rejects-facebooks-changes-infographic/question-2175115/.",
      "doi": ""
    },
    {
      "text": "Solove, D. J. A Taxonomy of Privacy. University of Pennsylvania Law Review, 154, 3 (2003).",
      "doi": ""
    },
    {
      "text": "Wisniewski, P., Lipford, H. and Wilson, D. Fighting for My Space: Coping Mechanisms for SNS Boundary Regulation. In Proc. Conference on Human Factors in Computing Systems (2012).  ",
      "doi": "10.1145/2207676.2207761"
    },
    {
      "text": "Zheng, S., Shi, P., Xu, H. and Zhang, C. Launching the new profile on facebook: understanding the triggers and outcomes of users' privacy concerns. In Proc. Proceedings of the 5th international conference on Trust and Trustworthy Computing, Springer-Verlag (2012), 325--339.  ",
      "doi": "10.1007/978-3-642-30921-2_19"
    }
  ]
}