{
  "doi": "10.1145/2556288.2557157",
  "title": "Brain points: a growth mindset incentive structure boosts persistence in an educational game",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3339-3348",
  "year": 2014,
  "badges": [],
  "abstract": "There is great interest in leveraging video games to improve student engagement and motivation. However, educational games are not uniformly effective, and little is known about how in-game rewards affect children's learning-related behavior. In this work, we argue that educational games can be improved by fundamentally changing their incentive structures to promote the growth mindset, or the belief that intelligence is malleable. We present \"brain points,\" a system that encourages the development of growth mindset behaviors by directly incentivizing effort, use of strategy, and incremental progress. Through a study of 15,000 children, we show that the \"brain points\" system encourages more low-performing students to persist in the educational game Refraction when compared to a control, and increases overall time played, strategy use, and perseverance after challenge. We believe that this growth mindset incentive structure has great potential in many educational environments.",
  "tags": [
    "educational games",
    "incentive structures",
    "growth mindset"
  ],
  "authors": [
    {
      "name": "Eleanor O'Rourke",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466642470",
      "orcid": "missing"
    },
    {
      "name": "Kyla Haimovitz",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959376957",
      "orcid": "missing"
    },
    {
      "name": "Christy Ballweber",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259429257",
      "orcid": "missing"
    },
    {
      "name": "Carol Dweck",
      "institution": "Stanford University, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959313557",
      "orcid": "missing"
    },
    {
      "name": "Zoran Popović",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100620346",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aronson, J., Fried, C. B., and Good, C. Reducing the Effects of Stereotype Threat on African American College Students by Shaping Theories of Intelligence. Journal of Experimental Social Psychology 38 (2002), 113--125.",
      "doi": ""
    },
    {
      "text": "Baker, R., Walonoski, J., Heffernan, N., Roll, I., Corbett, A., and Koedinger, K. R. Why students engage in 'gaming the system' behavior in interactive learning environments. Journal of Interactive Learning Research 19, 2 (2008), 185--224.",
      "doi": ""
    },
    {
      "text": "Blackwell, L. S., Trzesniewski, K. H., and Dweck, C. S. Implicit Theories of Intelligence Predict Achievement Across an Adolescent Transition: A Longitudinal Study and an Intervention. Child Development 78, 1 (2007), 246--263.",
      "doi": ""
    },
    {
      "text": "Brainology. http://www.mindsetworks.com/webnav/program.aspx.",
      "doi": ""
    },
    {
      "text": "BrainPOP. http://www.brainpop.com/.",
      "doi": ""
    },
    {
      "text": "BrainPOP Educators. http://www.brainpop.com/educators/home//.",
      "doi": ""
    },
    {
      "text": "Chase, C. The interplay of chance and skill: Exploiting a common game mechanic to enhance learning and persistence. In Proceedings of the 2012 International Conference of the Learning Sciences (2012).",
      "doi": ""
    },
    {
      "text": "Corbett, A. T., and Anderson, J. R. Knowledge tracing: Modeling the acquisition of procedural knowledge. User Modeling and User-Adapted Interaction 4, 4 (1995), 253--278.",
      "doi": ""
    },
    {
      "text": "Dweck, C. S. Mindset: The new psychology of success. New York: Random House, 2006.",
      "doi": ""
    },
    {
      "text": "Gee, J., and Shaffer, D. Looking where the light is bad: Video games and the future of assessment. (Epistemic Games Group Working Paper No. 2010-02), Madison: University of Wisconsin-Madison (2010).",
      "doi": ""
    },
    {
      "text": "Gee, J. P. What Video Games Have to Teach Us About Learning and Literacy. St. Martin's Press, 2008. ",
      "doi": "10.5555/983348"
    },
    {
      "text": "Good, C., Aronson, J., and Inzlicht, M. Improving adolescents standardized test performance: An intervention to reduce the effects of stereotype threat. Journal of Applied Developmental Psychology 24 (2003), 645--662.",
      "doi": ""
    },
    {
      "text": "Gunderson, E. A., Gripshover, S. J., Romero, C., and Dweck, C. S. Parent Praise to 1- to 3-Year-Olds Predicts Children's Motivational Frameworks 5 Years Later. Child Development 84, 5 (2013), 1526--1541.",
      "doi": ""
    },
    {
      "text": "Harpstead, E., Myers, B. A., and Aleven, V. In search of learning: facilitating data analysis in educational games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '13, ACM (New York, NY, USA, 2013), 79--88.  ",
      "doi": "10.1145/2470654.2470667"
    },
    {
      "text": "Heyman, G. D., and Dweck, C. S. Children's Thinking about Traits: Implications for Judgments of the Self and Others. Child Development 64, 2 (1998), 391--403.",
      "doi": ""
    },
    {
      "text": "Kaiser Family Foundation. Key Facts: Children and Video Games, 2002. http://kaiserfamilyfoundation. files.wordpress.com/2013/04/5959.pdf.",
      "doi": ""
    },
    {
      "text": "Kamins, M. L., and Dweck, C. S. Person versus process praise and criticism: Implications for contingent self-worth and coping. Developmental Psychology 35, 3 (1999), 835--847.",
      "doi": ""
    },
    {
      "text": "Kapp, K. M. The gamification of learning and instruction: game-based methods and strategies for training and education. San Francisco, CA: Pfeiffer, 2012. ",
      "doi": "10.5555/2378737"
    },
    {
      "text": "Khan Academy. http://www.khanacademy.org/.",
      "doi": ""
    },
    {
      "text": "Lee, J., Luchini, K., Michael, B., Norris, C., and Soloway, E. More than just fun and games: assessing the value of educational video games in the classroom. In CHI '04 Extended Abstracts on Human Factors in Computing Systems, CHI EA '04, ACM (New York, NY, USA, 2004), 1375--1378.  ",
      "doi": "10.1145/985921.986068"
    },
    {
      "text": "Linehan, C., Kirman, B., Lawson, S., and Chan, G. Practical, appropriate, empirically-validated guidelines for designing educational games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '11, ACM (New York, NY, USA, 2011), 1979--1988.  ",
      "doi": "10.1145/1978942.1979229"
    },
    {
      "text": "Martin, T., Smith, C. P., Andersen, E., Liu, Y.-E., and Popović, Z. Refraction time: Making split decisions in an online fraction game. In American Educational Research Association Annual Meeting, AERA (2012).",
      "doi": ""
    },
    {
      "text": "Mayo, M. J. Video Games: A Route to Large-Scale STEM Education Science 323 (2009), 79--82.",
      "doi": ""
    },
    {
      "text": "Mueller, C. M., and Dweck, C. S. Praise for Intelligence Can Undermine Children's Motivation and Performance. Journal of Personality and Social Psychology 75, 1 (1998), 33--52.",
      "doi": ""
    },
    {
      "text": "O'Neil, H. F., Wainess, R., and Baker, E. L. classification of learning outcomes: evidence from the computer games literature. The Curriculum Journal 16, 4 (2005), 455--474.",
      "doi": ""
    },
    {
      "text": "O'Rourke, E., Butler, E., Liu, Y., Ballwebber, C., and Popović, Z. The effects of age on player behavior in educational games. In Foundations of Digital Games, FDG '13 (2013).",
      "doi": ""
    },
    {
      "text": "Ricci, K. E., Salas, E., and Cannon-Bowers, J. A. Do computer-based games facilitate knowledge acquisition and retention? Military Psychology 8, 4 (1996), 295--307.",
      "doi": ""
    },
    {
      "text": "Schell, J. The Art of Game Design: A Book of Lenses. Morgan Kaufmann Publishers, Burlington, MA, 2008, p.120. ",
      "doi": "10.5555/2167319"
    },
    {
      "text": "Yeager, D. S., Paunesku, D., Walton, G. M., and Dweck, C. S. How Can We Instill Productive Mindsets at Scale? A Review of the Evidence and an Initial R&D Agenda. A White Paper prepared for the White House meeting on Excellence in Education: The Importance of Academic Mindsets, 2013.",
      "doi": ""
    }
  ]
}