{
  "doi": "10.1145/2556288.2556962",
  "title": "The effects of embodied persuasive games on player attitudes toward people using wheelchairs",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3413-3422",
  "year": 2014,
  "badges": [],
  "abstract": "People using wheelchairs face barriers in their daily lives, many of which are created by people who surround them. Promoting positive attitudes towards persons with disabilities is an integral step in removing these barriers and improving their quality of life. In this context, persuasive games offer an opportunity of encouraging attitude change. We created a wheelchair-controlled persuasive game to study how embodied interaction can be applied to influence player attitudes over time. Our results show that the game intervention successfully raised awareness for challenges that people using wheelchairs face, and that embodied interaction is a more effective approach than traditional input in terms of retaining attitude change over time. Based on these findings, we provide design strategies for embodied interaction in persuasive games, and outline how our findings can be leveraged to help designers create effective persuasive experiences beyond games.",
  "authors": [
    {
      "name": "Kathrin Maria Gerling",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    },
    {
      "name": "Max Valentin Birk",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557519856",
      "orcid": "missing"
    },
    {
      "name": "Matthew Miller",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958615957",
      "orcid": "missing"
    },
    {
      "name": "Rita Orji",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/do/10.1145/contrib-81548037192/rel-imgonly/ritaheadshot.jpg",
      "acmid": "81548037192",
      "orcid": "0000-0001-6152-8034"
    }
  ],
  "references": [
    {
      "text": "Alhabash, S. and Wise, K. PeaceMaker: Changing Students' Attitudes Toward Palestinians and Israelis Through Video Game Play. International Journal of Communication 6, (2012), 356--380.",
      "doi": ""
    },
    {
      "text": "Bang, M., Torstensson, C. and Katzeff, C. The PowerHouse: A Persuasive Computer Game Designed to Raise Awareness of Domestic Energy Consumption. Persuasive Technology. (2006), 123--132. ",
      "doi": "10.5555/1986822.1986843"
    },
    {
      "text": "Baranowski, T., Baranowski, J., Cullen, K. W., Marsh, T., Islam, N., Zakeri, I., Honess-Morreale, L., & demoor, C. (2003). Squire's Quest!: dietary outcome evaluation of a multimedia game. American journal of preventive medicine, 24(1), 52--61.",
      "doi": ""
    },
    {
      "text": "Barsalou, L. W. Perceptual Symbol Systems. Behavioral and Brain Sciences 22, 4 (1999), 577--660.",
      "doi": ""
    },
    {
      "text": "Bem, D. J. Self-perception: An alternative interpretation of cognitive dissonance phenomena. Psychological Review 74, 3 (1967), 183.",
      "doi": ""
    },
    {
      "text": "Bogost, I. Persuasive Games on Mobile Devices. Fogg, B.J. Eckles, D.(eds): Mobile Persuasion, (2007).",
      "doi": ""
    },
    {
      "text": "Briñol, P. and Petty, R.E. Embodied Persuasion. In: Semin, G.R. & Smith, E.R. (Eds.): Embodied grounding. Cambridge University Press, Cambridge (2008).",
      "doi": ""
    },
    {
      "text": "Brown, A. Q&A: Littleloud talks guilt and gaming with Sweatshop. 2011. http://www.wired.co.uk/news/archive/201107/22/sweatshop-q-and-a/viewgallery/269289.",
      "doi": ""
    },
    {
      "text": "Columna, L., Yang, S., Arndt, K., and Lieberman, L. Using Online Videos for Disability Awareness. Journal of Physical Education, Recreation & Dance 80, 8 (2009), 19--24.",
      "doi": ""
    },
    {
      "text": "Dourish, P. Where the Action is. The Foundations of Embodied Interaction. MIT Press (2004).",
      "doi": ""
    },
    {
      "text": "Flower, A., Burns, M.K., Bottsford-Miller, N.A. MetaAnalysis of Disability Simulation Research. Remedial and Special Education 28, 2 (2007), 72--79.",
      "doi": ""
    },
    {
      "text": "Fogg, B.J. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann, 2003. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "French, S. Simulation Exercises in Disability Awareness Training: a critique. Disability, Handicap & Society 7, 3 (1992), 257--266.",
      "doi": ""
    },
    {
      "text": "Gerling, K.M., Kalyn, M.R., and Mandryk, R.L. KINECTWheels : Wheelchair-Accessible Motion-Based Game Interaction. In: EA of CHI 2013, ACM (2013).  ",
      "doi": "10.1145/2468356.2479609"
    },
    {
      "text": "Grayson, E. and Marini, I. Simulated disability exercises and their impact on attitudes toward persons with disabilities. International Journal of Rehabilitation Research 19, (1996), 123--131.",
      "doi": ""
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. In: Proc. of CHI 1997, ACM (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Khaled, R., Barr, P., Noble, J., Fischer, R. and Biddle, R. 2007. Fine tuning the persuasion in persuasive games. Persuasive Technology. (2007), 36--47. ",
      "doi": "10.5555/1780402.1780409"
    },
    {
      "text": "Krahé, B. and Altwasser, C. Changing Negative Attitudes Towards Persons with Physical Disabilities: An Experimental Intervention. Journal of Community & Applied Social Psychology 16, (2006), 56--69.",
      "doi": ""
    },
    {
      "text": "Lewis, J., Brown, D., Cranton, W., and Mason, R. Simulating visual impairments using the Unreal Engine 3 game engine. In: Proc. of SeGAH 2011, IEEE (2011).  ",
      "doi": "10.1109/SeGAH.2011.6165430"
    },
    {
      "text": "Loke, L. and Robertson, T. Moving and Making Strange: An Embodied Approach To Movement-Based Interaction Design. ACM TOCHI 20, 1 (2013).  ",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Lyons, L., Slattery, B., Jimenez, P., Lopez, B., and Moher, T. Don't Forget about the Sweat: Effortful Embodied Interaction in Support of Learning. In: Proc. of TEI 2012, ACM (2012), 77--84.  ",
      "doi": "10.1145/2148131.2148149"
    },
    {
      "text": "Marshall, C. and Rossman, G.B. 2011. Designing Qualitative Research. Sage Publishers: Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Meyers, A.R., Anderson, J.J., Miller, D.R., Shipp, K., and Hoenig, H. Barriers, facilitators, and access for wheelchair users: substantive and methodologic lessons from a pilot study of environmental effects. Social Science & Medicine 55, (2002), 1435--1446.",
      "doi": ""
    },
    {
      "text": "Miller, S.R. Attitudes toward Individuals with Disabilities: Does Empathy Explain the Difference in Scores between Men and Women Annals of Behavioral Science and Medical Education 16, 1 (2010), 3--6.",
      "doi": ""
    },
    {
      "text": "Mueller, F., Edge, D., Vetere, F., Gibbs, M.R., Agamanolis, S., Bongers, B., and Sheridan, J.G. 2011. Designing Sports: A Framework for Exertion Games. In: Proc. of CHI 2011, ACM (2011), 2651--2660.  ",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Niedenthal, P. M., Barsalou, L. W., Winkielman, P., Krauth-Gruber, S., and Ric, F. Embodiment in attitudes, social perception, and emotion. Personality and Social Psychology Review 9, 3 (2005), 184--211.",
      "doi": ""
    },
    {
      "text": "Oinas-Kukkonen, H. and Harjumaa, M. A systematic framework for designing and evaluating persuasive systems. Persuasive Technology, (2008), 164--176.  ",
      "doi": "10.1007/978-3-540-68504-3_15"
    },
    {
      "text": "Orji, R., Mandryk, R.L., Vassileva, J., and Gerling, K.M. Tailoring persuasive health games to gamer type. In: Proc. of CHI 2013, ACM (2013), 2467--2476.  ",
      "doi": "10.1145/2470654.2481341"
    },
    {
      "text": "Orji, R., Vassileva, J., and Mandryk R. L. Modeling the Efficacy of Persuasive Strategies for Different Gamer Types in Serious Games for Health. User Modeling and User-Adapted Interaction: Special Issue on Personalization and Behaviour Change (in press).",
      "doi": ""
    },
    {
      "text": "Power, M., & Green, A. The WHOQOL-DIS Group The Attitudes to Disability Scale (ADS): development and psychometric properties. Journal of Intellectual Disability Research 54, 9 (2010), 860--874.",
      "doi": ""
    },
    {
      "text": "Petty, R. E. and Cacioppo, J. T. The elaboration likelihood model of persuasion. Communication and Persuasion, Springer (1986), 1--24.",
      "doi": ""
    },
    {
      "text": "Pivik, J., McComas, J., Macfarlane, I., and Laflamme, M. Using Virtual Reality to Teach Disability Awareness. J. Educational Computing Research 26, 2 (2002), 203--218.",
      "doi": ""
    },
    {
      "text": "Przybylski, A.K., Weinstein, N., Murayama, K., Lynch, M.F., & Ryan, R.M., The ideal-self at play: The appeal of video games that let you be all you can be. Psychological Science, 2011, 23 (1), 69--76.",
      "doi": ""
    },
    {
      "text": "Ruiz, S., York, A., Stein, M., Keating, N., Santiago, K. Darfur is Dying. 2009. http://www.darfurisdying.com/.",
      "doi": ""
    },
    {
      "text": "Ryan, R. M., Rigby, C. S., & Przybylski, A. K., Motivational pull of video games: A self-determination theory approach. Motivation and Emotion 30, (2006).",
      "doi": ""
    },
    {
      "text": "Sherman, D.K., Gangi, C., and White, M.L. Embodied cognition and health persuasion: Facilitating intentionbehavior consistency via motor manipulations. Journal of Experimental Social Psychology 46, (2010), 461--464.",
      "doi": ""
    },
    {
      "text": "Stokes, B. Videogames have changed: time to consider 'Serious Games' The Development Education Journal, (2005), 6--13.",
      "doi": ""
    },
    {
      "text": "Watson, D., & Clark, L. A. The PANAS-X: Manual for the positive and negative affect schedule-Expanded Form. Iowa City: University of Iowa (1994).",
      "doi": ""
    },
    {
      "text": "Wilson, S. and Lieberman, L. Disability awareness in physical education. Strategies 13, 6 (2000), 29--33.",
      "doi": ""
    }
  ]
}