{
  "doi": "10.1145/2556288.2557049",
  "title": "Coding livecoding",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1021-1024",
  "year": 2014,
  "badges": [],
  "abstract": "Livecoding is an artistic programming practice in which an artist's low-level interaction can be observed with sufficiently high fidelity to allow for transcription and analysis. This paper presents the first reported \"coding\" of livecoding videos. From an identified corpus of videos available on the web, we coded performances of two different livecoding artists, recording both the (textual) programming edit events and the musical effect of these edits. Our analysis includes a novel, transition-matrix visualisation of the textual and musical dimensions of this data to create a \"performer fingerprint\". We show how detailed transcriptions of livecoding videos can be made which, we hope, will provide a foundation for further research into describing and understanding livecoding.",
  "tags": [
    "end-user programming",
    "creativity support tools"
  ],
  "authors": [
    {
      "name": "Ben Swift",
      "institution": "Australian National University, Canberra, ACT, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342513190",
      "orcid": "missing"
    },
    {
      "name": "Andrew Sorensen",
      "institution": "Queensland University of Technology, Brisbane, QLD, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331504369",
      "orcid": "missing"
    },
    {
      "name": "Michael Martin",
      "institution": "Australian National University, Canberra, ACT, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100426121",
      "orcid": "missing"
    },
    {
      "name": "Henry Gardner",
      "institution": "Australian National University, Canberra, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100521514",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "TOPLAP Manifesto. http://toplap.org/wiki/ManifestoDraft.",
      "doi": ""
    },
    {
      "text": "Blackwell, A., and Collins, N. The programming language as a musical instrument. Proceedings of PPIG05 (Psychology of Programming Interest Group) (2005).",
      "doi": ""
    },
    {
      "text": "Collins, N., McLean, A., Rohrhuber, J., and Ward, A. Live coding in laptop performance. Organised Sound 8, 03 (2003), 321--330.  ",
      "doi": "10.1017/S135577180300030X"
    },
    {
      "text": "Hook, J., Green, D., McCarthy, J., Taylor, S., Wright, P., and Olivier, P. A vj centered exploration of expressive interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2011), 1265--1274.  ",
      "doi": "10.1145/1978942.1979130"
    },
    {
      "text": "Hook, J., McCarthy, J., Wright, P., and Olivier, P. Waves: exploring idiographic design for live performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2013), 2969--2978.  ",
      "doi": "10.1145/2470654.2481412"
    },
    {
      "text": "Nichols, E., Morris, D., and Basu, S. Data-driven exploration of musical chord sequences. In IUI '09: Proceedings of the 14th international conference on Intelligent user interfaces, ACM Request Permissions (Feb. 2009).  ",
      "doi": "10.1145/1502650.1502683"
    },
    {
      "text": "Nilson, C. Live coding practice. Proceedings of the 7th international conference on New interfaces for musical expression (2007), 112--117.  ",
      "doi": "10.1145/1279740.1279760"
    },
    {
      "text": "Sorensen, A., and Gardner, H. Programming with time: cyber-physical programming with impromptu. In OOPSLA '10: Proceedings of the ACM international conference on Object oriented programming systems languages and applications (2010), 822--834.  ",
      "doi": "10.1145/1869459.1869526"
    }
  ]
}