{
  "doi": "10.1145/2556288.2557065",
  "title": "The influence of emotion on number entry errors",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2293-2296",
  "year": 2014,
  "badges": [],
  "abstract": "Given the proliferation of devices like infusion pumps in hospitals, number entry and in particular number entry error is an emerging important concern in HCI. There are clearly design features that could greatly improve accuracy in entering numbers but the context of the task could also play an important role. In particular, the emotional state of a person is known to strongly influence their response to a difficult situation and hence the errors that they make. In this paper, we consider the impact of the emotional state of the user on the accuracy with which people enter numbers. Our experiment shows that participants who are in a more positive emotional state are more accurate. The effect is small but could be very important when considering the potentially highly-charged emotional contexts where many healthcare devices are used.",
  "authors": [
    {
      "name": "Paul Cairns",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100099774",
      "orcid": "missing"
    },
    {
      "name": "Pratyush Pandab",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958676457",
      "orcid": "missing"
    },
    {
      "name": "Christopher Power",
      "institution": "University of York, York, North Yorkshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100082155",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aleccia, J. (2011) Nurse's suicide highlights twin tragedy of medical errors. NBCNews.com, 27th June, 2011. http://www.nbcnews.com/id/43529641",
      "doi": ""
    },
    {
      "text": "Ashby, F. G., Isen, A., Turken, A., A neuropsychological theory of positive affect and its influence on cognition. Psychological Review, 106, 3 (1999), 529--550.",
      "doi": ""
    },
    {
      "text": "Aula, A. and Surakka, V. Auditory emotional feedback facilitates human-computer interaction, People and Computers, (2002) 337--350.",
      "doi": ""
    },
    {
      "text": "Barrett, L., Haviland-Jones, J. and Lewis, M. (Eds.), Handbook of Emotions, Third. Guilford Publications, 2008.",
      "doi": ""
    },
    {
      "text": "Bradley, M. M. and Lang, P. J. Measuring emotion: the self-assessment manikin and the semantic differential, J. of behavior therapy and experimental psychiatry, 25, 1 (1994), 49--59.",
      "doi": ""
    },
    {
      "text": "Causse, M., Dehais, F., Péran, P., Sabatini, U. and Pastor, J. The effects of emotion on pilot decision-making: A neuroergonomic approach to aviation safety. Transportation Research Part C: Emerging Technologies, 33, 0 (2013), 272--281.",
      "doi": ""
    },
    {
      "text": "Jeon, M., Yim, J.-B. and Walker, B. An angry driver is not the same as a fearful driver: effects of specific negative emotions on risk perception, driving performance, and workload. In Proc of AutomotiveUI '11, ACM, New York, NY, USA (2011), 137--142.  ",
      "doi": "10.1145/2381416.2381438"
    },
    {
      "text": "Kim, S. H., Schneider, S., Bevans, M., Kravitz, L., Mermier, C., Qualls, C. and Burge, M. PTSD Symptom Reduction With Mindfulness-Based Stretching and Deep Breathing Exercise: Randomized Controlled Clinical Trial of Efficacy, J. of Clinical Endocrinology & Metabolism, May, (2013), online.",
      "doi": ""
    },
    {
      "text": "Klein, J., Moon, Y. and Picard, R. W. This computer responds to frustration: theory, design and results. Interacting with Computers, 14 (2002), 119--140.",
      "doi": ""
    },
    {
      "text": "Lang, P. J. and Bradley, M. M. International affective picture system (IAPS): Technical manual and affective ratings. Technical Report, 2001.",
      "doi": ""
    },
    {
      "text": "Oladimeji, P., Thimbleby, H. and A. Cox. Number entry interfaces and their effects on error detection, Proc. Interact 2011, (2011), 178--185 ",
      "doi": "10.5555/2042283.2042302"
    },
    {
      "text": "Peters, E., Slovic, P., Hibbard, J. H., & Tusler, M. Why worry' Worry, risk perceptions, and willingness to act to reduce medical errors. Health Psychology, 25, 2 (2006), 144.",
      "doi": ""
    },
    {
      "text": "Soboczenski, F., Cairns, P., Cox, A. Increasing accuracy by decreasing presentation quality in transcription tasks. Proc. Interact 2013, Springer LNCS 8118 (2013) 380--394.",
      "doi": ""
    },
    {
      "text": "Thimbleby, H. and Cairns, P. Reducing number entry errors: solving a widespread, serious problem, J. of the Royal Society Interface, 7 (2010), 1429--1439.",
      "doi": ""
    },
    {
      "text": "Vicente, K. J., Kada-Bekhaled, K., Hillel, G., Cassano, A. and Orser, B. A. Programming errors contribute to death from patient-controlled analgesia: case report and estimate of probability. Canadian. J. of Anesthesiology, 50 (2003), 328--332.",
      "doi": ""
    },
    {
      "text": "Wiseman, S., Cairns, P. and Cox, A. A taxonomy of number entry error, Proc. BCS HCI (2011), 187--196. ",
      "doi": "10.5555/2305316.2305352"
    },
    {
      "text": "Wiseman, S. E. M., Cox, A. L., Brumby, D. P. Designing Devices With the Task in Mind: Which Numbers Are Really Used in Hospitals' Human Factors, 55, 1 (2013a), 61--74.",
      "doi": ""
    },
    {
      "text": "Wiseman, S., Cox, A. L., Brumby, D. P., Gould, S. J. J., O'Carroll, S. Using checksums to detect number entry error. Proc. ACM CHI 2013, (2013 b) 2403--2406.  ",
      "doi": "10.1145/2470654.2481332"
    },
    {
      "text": "Zhang, J., Patel, V. L., Johnson, T. R. and Shortliffe, E. H. A cognitive taxonomy of medical errors, J. of Biomedical Informatics, 37, 3 (2004), 193--20.  ",
      "doi": "10.1016/j.jbi.2004.04.004"
    }
  ]
}