{
  "doi": "10.1145/2556288.2557180",
  "title": "Improving social presence in human-agent interaction",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1449-1458",
  "year": 2014,
  "badges": [],
  "abstract": "Humans have a tendency to consider media devices as social beings. Social agents and artificial opponents can be examined as one instance of this effect. With today's technology it is already possible to create artificial agents that are perceived as socially present. In this paper, we start by identifying the factors that influence perceptions of social presence in human-agent interactions. By taking these factors into account and by following previously defined guidelines for building socially present artificial opponents, a case study was created in which a social robot plays the Risk board game against three human players. An experiment was performed to ascertain whether the agent created in this case study is perceived as socially present. The experiment suggested that by following the guidelines for creating socially present artificial board game opponents, the perceived social presence of users towards the artificial agent improves.",
  "tags": [
    "social presence",
    "artificial opponents",
    "board games",
    "human-robot interaction (hri)"
  ],
  "authors": [
    {
      "name": "André Pereira",
      "institution": "Instituto Superior Técnico - University of Lisbon, Porto Salvo, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367593336",
      "orcid": "missing"
    },
    {
      "name": "Rui Prada",
      "institution": "Instituto Superior Técnico - University of Lisbon, Porto Salvo, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100194770",
      "orcid": "missing"
    },
    {
      "name": "Ana Paiva",
      "institution": "Instituto Superior Técnico - University of Lisbon, Porto Salvo, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436595004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adalgeirsson, S., and Breazeal, C. Mebot: a robotic platform for socially embodied presence. In Proceeding of the ACM/IEEE international conference on Human-robot interaction (2010), 15--22. ",
      "doi": "10.5555/1734454.1734467"
    },
    {
      "text": "Biocca, F., Burgoon, J., Harms, C., and Stoner, M. Criteria and scope conditions for a theory and measure of social presence. Presence: Teleoperators and virtual environments (2001).",
      "doi": ""
    },
    {
      "text": "Biocca, F., Harms, C., and Burgoon, J. Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence: Teleoperators & Virtual Environments 12, 5 (2003), 456--480.  ",
      "doi": "10.1162/105474603322761270"
    },
    {
      "text": "Biocca, F., Harms, C., and Gregg, J. The networked minds measure of social presence: Pilot test of the factor structure and concurrent validity. In 4th annual International Workshop on Presence (2001), 9--11.",
      "doi": ""
    },
    {
      "text": "Deshmukh, A., Castellano, G., Kappas, A., Barendregt, W., Nabais, F., Paiva, A., Ribeiro, T., Leite, I., and Aylett, R. Towards empathic artificial tutors. In Proc. of the 8th ACM/IEEE int. conference on Human-robot interaction (2013), 113--114. ",
      "doi": "10.5555/2447556.2447593"
    },
    {
      "text": "Eriksson, D., Peitz, J., and Björk, S. Socially adaptable games. In Proceedings of DiGRA Conference: Changing Views-Worlds in Play (2005).",
      "doi": ""
    },
    {
      "text": "Garau, M., Widenfeld, H., Antley, A., Friedman, D., Brogni, A., and Slater, M. Temporal and spatial variations in presence: A qualitative analysis. In Proc. of Int. Workshop on Presence (2004), 232--239.",
      "doi": ""
    },
    {
      "text": "Gockley, R., Bruce, A., Forlizzi, J., Michalowski, M., Mundell, A., Rosenthal, S., Sellner, B., Simmons, R., Snipes, K., Schultz, A., et al. Designing robots for long-term social interaction. In Intelligent Robots and Systems, IEEE (2005), 1338--1343.",
      "doi": ""
    },
    {
      "text": "Harms, C., and Biocca, F. Internal consistency and reliability of the networked minds social presence measure. Exploring the sense of presence (2004), 246.",
      "doi": ""
    },
    {
      "text": "Heerink, M., Ben, K., Evers, V., and Wielinga, B. The influence of social presence on acceptance of a companion robot by older people. Journal of Physical Agents 2, 2 (2008), 33--40.",
      "doi": ""
    },
    {
      "text": "Heeter, C. Being there: The subjective experience of presence. Presence: Teleoperators and virtual environments 1, 2 (1992), 262--271. ",
      "doi": "10.5555/196564.196589"
    },
    {
      "text": "Heider, F. The Psychology of Interpersonal Relations. Lawrence Erlbaum Associates, 1958.",
      "doi": ""
    },
    {
      "text": "Johansson, S. On using multi-agent systems in playing board games. In Proceedings of the 5th International joint conference on Autonomous agents and multiagent systems, ACM (2006), 569--576.  ",
      "doi": "10.1145/1160633.1160737"
    },
    {
      "text": "Karapanos, E., Zimmerman, J., Forlizzi, J., and Martens, J.-B. User experience over time: an initial framework. ACM, 2009, 729--738.  ",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Kedzierski, J., Muszynski, R., Zoll, C., Oleksy, A., and Frontkiewicz, M. Emys-emotive head of a social robot. IJ Social Robotics 5, 2 (2013), 237--249.",
      "doi": ""
    },
    {
      "text": "Koda, T., and Maes, P. Agents with faces: The effect of personification. In Robot and Human Communication, IEEE (1996), 189--194.",
      "doi": ""
    },
    {
      "text": "Leite, I., Hajishirzi, H., Andrist, S., and Lehman, J. Managing chaos: models of turn-taking in character-multichild interactions. In Proc. of the 15th ACM on Int. conference on multimodal interaction (2013), 43--50.  ",
      "doi": "10.1145/2522848.2522871"
    },
    {
      "text": "Leite, I., Martinho, C., Pereira, A., and Paiva, A. As time goes by: Long-term evaluation of social presence in robotic companions. In Robot and Human Interactive Communication, IEEE (2009), 669--674.",
      "doi": ""
    },
    {
      "text": "Leite, I., Mascarenhas, S., Pereira, A., Martinho, C., Prada, R., and Paiva, A. \"why can't we be friends?\" an empathic game companion for long-term interaction. In Intelligent Virtual Agents, Springer (2010), 315--321. ",
      "doi": "10.5555/1889075.1889112"
    },
    {
      "text": "Lombard, M., and Ditton, T. At the heart of it all: The concept of presence. Journal of Computer-Mediated Communication 3, 2 (1997), 0--0.",
      "doi": ""
    },
    {
      "text": "Martinho, C., and Paiva, A. Using anticipation to create believable behavior. In Proceedings of the national conference on Artificial Intelligence, vol. 21, Menlo Park, CA; Cambridge, MA; London; AAAI Press; MIT Press; 1999 (2006), 175. ",
      "doi": "10.5555/1597538.1597567"
    },
    {
      "text": "Mori, M. The uncanny valley. Energy 7, 4 (1970), 33--35.",
      "doi": ""
    },
    {
      "text": "Pereira, A., Martinho, C., Leite, I., and Paiva, A. icat, the chess player: the influence of embodiment in the enjoyment of a game. In Proceedings of the 7th international joint conference on Autonomous agents and multiagent systems - Vol 3 (2008), 1253--1256. ",
      "doi": "10.5555/1402821.1402844"
    },
    {
      "text": "Pereira, A., Prada, R., and Paiva, A. Towards the next generation of board game opponents. In FDG'11: Proceedings of the Sixth International Conference on Foundations of Digital Games (June 2011).  ",
      "doi": "10.1145/2159365.2159410"
    },
    {
      "text": "Pereira, A., Prada, R., and Paiva, A. Socially present board game opponents. In Advances in Computer Entertainment, vol. 7624 of Lecture Notes in Computer Science. Springer Berlin Heidelberg, 2012, 101--116.  ",
      "doi": "10.1007/978-3-642-34292-9_8"
    },
    {
      "text": "Reeves, B. The media equation: how people treat computers, television, and new media. Stanford, Calif.: Center for the Study of Language and Information; Cambridge, 1996. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Ribeiro, T., and Paiva, A. The illusion of robotic life: principles and practices of animation for robots. In Proceeding of the ACM/IEEE international conference on Human-robot interaction (2012), 383--390.  ",
      "doi": "10.1145/2157689.2157814"
    },
    {
      "text": "Rogers, Y., and Lindley, S. Collaborating around vertical and horizontal large interactive displays: which way is best? Interacting with Computers 16, 6 (2004), 1133--1152.",
      "doi": ""
    },
    {
      "text": "Ryall, K., Morris, M., Everitt, K., Forlines, C., and Shen, C. Experiences with and observations of directtouch tabletops. In Proceedings of IEEE TableTop the International Workshop on Horizontal Interactive Human Computer Systems (2006), 89--96.  ",
      "doi": "10.1109/TABLETOP.2006.12"
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. The social psychology of telecommunications.",
      "doi": ""
    },
    {
      "text": "Slater, M. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3549.",
      "doi": ""
    },
    {
      "text": "Sodian, B., and Kristen, S. Theory of mind. Towards a theory of thinking (2010), 189--201.",
      "doi": ""
    },
    {
      "text": "Toney, A., and Thomas, B. Considering reach in tangible and table top design. In Int. Workshop on Horizontal Interactive Human-Computer Systems (2006).  ",
      "doi": "10.1109/TABLETOP.2006.9"
    },
    {
      "text": "Yankelovich, N., Levow, G., and Marx, M. Designing speechacts: Issues in speech user interfaces. In Proc. of the SIGCHI conference on Human factors in computing systems (1995), 369--376.  ",
      "doi": "10.1145/223904.223952"
    },
    {
      "text": "Yoshikawa, Y., Shinozawa, K., Ishiguro, H., Hagita, N., and Miyamoto, T. Responsive robot gaze to interaction partner. In Robotics: Science and systems (2006).",
      "doi": ""
    }
  ]
}