{
  "doi": "10.1145/2556288.2557119",
  "title": "Reflection through design: immigrant women's self-reflection on managing health and wellness",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1605-1614",
  "year": 2014,
  "badges": [],
  "abstract": "Women comprise nearly half of the immigrant population worldwide and are susceptible to a wider range of health challenges compared to immigrant men. We present the findings of four participatory design sessions with immigrant women from the Caribbean to identify health and wellness challenges they faced and to conceptualize technologies to help them manage these issues. Stress, dietary challenges (specifically obesity), mental health, and domestic abuse, as identified by the women, form the focal themes for the design sessions. Their design approaches emphasized rebuilding the support structure, reducing stressors through entertainment and relaxation and encouraging positive gradational lifestyle changes. In conceiving health and wellness technologies for immigrant women, our work highlights opportunities for HCI to consider the role of others (and who benefits) and to reflect on the role of design and the underlying values and themes designs encompass. Finally, we emphasize how the technologies conceived by these women support rather than replace social solutions to the health and wellness challenges faced by these and other immigrant women.",
  "authors": [
    {
      "name": "Deana Brown",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645888",
      "orcid": "missing"
    },
    {
      "name": "Victoria Ayo",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556410356",
      "orcid": "missing"
    },
    {
      "name": "Rebecca E. Grinter",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    }
  ],
  "references": [
    {
      "text": "Asgary, R., Charpentier, B., and Burnett, D. C. Socio-Medical Challenges of Asylum Seekers Prior and After Coming to the US. Journal of immigrant and minority health / Center for Minority Public Health 15, 5 (2013), 961--8.",
      "doi": ""
    },
    {
      "text": "Baumer, E. P. S. and Silberman, M. S. When the Implication is Not to Design (Technology). CHI '11 - Proceedings of the 2011 annual conference on Human factors in computing systems, ACM Press (2011), 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Boujarwah, F. A., Nazneen, Hong, H., Abowd, G. D., and Arriaga, R. Towards a framework to situate assistive technology design in the context of culture. Assets, ACM Press (2011).  ",
      "doi": "10.1145/2049536.2049542"
    },
    {
      "text": "Carballo, M. and Mboup, M. International Migration and Health. Global Commission on International Migration (2005).",
      "doi": ""
    },
    {
      "text": "Clarke, R., Wright, P., and McCarthy, J. Sharing narrative and experience. Proceedings of the 2012 ACM conference on Human Factors in Computing Systems, Extended Abstracts, ACM Press (2012), 1505.  ",
      "doi": "10.1145/2212776.2223663"
    },
    {
      "text": "Collins, E., Shakya, Y. B., Guruge, S., and Santos, E. J. Services for Women: Access, Equity and Quality. In Working with Women: Issues and Strategies for Mental Health. 2008, 119--133.",
      "doi": ""
    },
    {
      "text": "Collins, E. Recognizing Spirituality as a Vital Component in Mental Health Care. In Working with Women: Issues and Strategies for Mental Health. 2008, 89--102.",
      "doi": ""
    },
    {
      "text": "Coyle, D., Doherty, G., Matthews, M., and Sharry, J. Computers in talk-based mental health interventions. Interacting with Computers 19, 4 (2007), 545--562.  ",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "Doherty, G., Coyle, D., and Matthews, M. Design and evaluation guidelines for mental health technologies. Interacting with Computers 22, 4 (2010), 243--252.  ",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Dumont, J.-C., Spielvogel, G., and Widmaier, S. International Migrants in Developed, Emerging and Developing Countries: An extended Profile. 2010.",
      "doi": ""
    },
    {
      "text": "Elliott, S.J . and Gillie, J. Moving Experiences: A Qualitative Analysis of Health and Migration. Health & Place 4, 4 (1998), 327--39.",
      "doi": ""
    },
    {
      "text": "Grimes, A., Bednar, M., Bolter, J. D., and Grinter, R. E. EatWell: sharing nutrition-related memories in a low-income community. Cell, ACM (2008), 87--96.  ",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Grimes, A. and Harper, R. Celebratory Technology: New Directions for Food Research in HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2008).  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Guha, M. L., Druin, A., Chipman, G., Fails, J. A., Simms, S., and Farber, A. Mixing Ideas: A New Technique for Working with Young Children as Design Partners. Interaction Design and Children, (2004), 35--42.  ",
      "doi": "10.1145/1017833.1017838"
    },
    {
      "text": "Hirsch, T. and Liu, J. Speakeasy. Proceedings of the 2004 conference on Designing interactive systems processes, practices, methods, and techniques DIS '04, ACM Press (2004), 345.  ",
      "doi": "10.1145/1013115.1013176"
    },
    {
      "text": "Meyer, J., Boll, S., Lee, Y., Mayora, O., Siek, K. A., and Röcker, C. Wellness interventions and HCI: theory, practice, and technology. ACM SIGHIT... 2, 2 (2012), 2--4.  ",
      "doi": "10.1145/2384556.2384564"
    },
    {
      "text": "Popovic-Lipovac, A. and Strasser, B. A Review on Changes in Food Habits Among Immigrant Women and Implications for Health. Journal of immigrant and minority health (2013).",
      "doi": ""
    },
    {
      "text": "Prochaska, J. O., Redding, C. A., and Evers, K. E. The Transtheoretical model and stages of change. Health Behavior and Health Education, (2008), 97--121.",
      "doi": ""
    },
    {
      "text": "Quintanilha, M. S. and Design, V. C. BuddyWall: A Tangible User Interface for Wireless Remote Communication. (2008), 3711--3716.  ",
      "doi": "10.1145/1358628.1358918"
    },
    {
      "text": "Sakpal, R. Virtual patients to teach cultural competency. Proceedings of ICMI '12, (2012), 349.  ",
      "doi": "10.1145/2388676.2388754"
    },
    {
      "text": "Seidman, I. Interviewing as Qualitative Research. Teachers College Press, 2005.",
      "doi": ""
    },
    {
      "text": "Siek, K. A., LaMarche, J. S., and Maitland, J. Bridging the information gap: Collaborative Technology Design with Low-income At-risk Families to Engender Healthy Behaviors. Proceedings of the 21st Australia conference on Computer-Human Interaction, (2009).  ",
      "doi": "10.1145/1738826.1738841"
    },
    {
      "text": "Sisley, E. J., Hutton, J. M., Louise Goodbody, C., and Brown, J. S. L. An interpretative phenomenological analysis of African Caribbean women's experiences and management of emotional distress. Health & social care in the community 19, 4 (2011), 392--402.",
      "doi": ""
    },
    {
      "text": "Skeels, M. M., Unruh, K. T., Powell, C., and Pratt, W. Catalyzing Social Support for Breast Cancer Patients. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2010), 173--182.  ",
      "doi": "10.1145/1753326.1753353"
    },
    {
      "text": "Turner, R. J. Social Support and Coping. In A. V. Horwitz and T. L. Scheid, eds., Handbook of coping Theory research applications. Cambridge University Press, 1999, 198--210.",
      "doi": ""
    },
    {
      "text": "Wyche, S. P., Hayes, G. R., Harvel, L. D., and Grinter, R. E. Technology in Spiritual Formation: An Exploratory Study of Computer Mediated Religious Communications. CSCW '06 Proceedings of the 2006 Conference on Computer Supported Cooperative Work, (2006), 199--208.  ",
      "doi": "10.1145/1180875.1180908"
    },
    {
      "text": "Zallman, L., Himmelstein, D. H., Woolhandler, S., et al. Undiagnosed and Uncontrolled Hypertension and Hyperlipidemia among Immigrants in the US. Journal of immigrant and minority health / Center for Minority Public Health 15, 5 (2013), 858--65.",
      "doi": ""
    },
    {
      "text": "Withings Scale. http://www.withings.com/.",
      "doi": ""
    },
    {
      "text": "National African HIV/AIDS Initiative NAHI Summit Reports. Atlanta, GA, 2007.",
      "doi": ""
    }
  ]
}