{
  "doi": "10.1145/2556288.2557305",
  "title": "Documentscape: intertextuality, sequentiality, & autonomy at work",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2451-2460",
  "year": 2014,
  "badges": [],
  "abstract": "On the basis of an ethnographic field study, this article introduces the concept of documentscape to the analysis of document-centric work practices. The concept of documentscape refers to the entire ensemble of documents in their mutual intertextual interlocking. Providing empirical data from a global software development case, we show how hierarchical structures and sequentiality across the interlocked documents are critical to how actors make sense of the work of others and what to do next in a geographically distributed setting. Furthermore, we found that while each document is created as part of a quasi-sequential order, this characteristic does not make the document, as a single entity, into a stable object. Instead, we found that the documents were malleable and dynamic while suspended in intertextual structures. Our concept of documentscape points to how the hierarchical structure, sequentiality, and authorless nature of documents serve as a constitutive platform for the development of iterative and emergent work practices, making it possible for highly distributed actors to collaborate with limited communication, as the documentscape serves as a vehicle of coordination.",
  "tags": [
    "global software development",
    "\"documents",
    "global interaction\"",
    "documentscape"
  ],
  "authors": [
    {
      "name": "Lars Rune Christensen",
      "institution": "Aalborg University, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406600924",
      "orcid": "missing"
    },
    {
      "name": "Pernille Bjorn",
      "institution": "IT University of Copenhagen & University of California, Irvine, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309489973",
      "orcid": "0000-0001-7049-1173"
    }
  ],
  "references": [
    {
      "text": "Appadurai, A., Disjuncture and Difference in the Global Cultural Economy. Public Culture, 1990. 2(2): p. 1--24.",
      "doi": ""
    },
    {
      "text": "Bakhtin, M.M. and V.N. Volosinov, Marxism and the Philosophy of Language.1986, Cambridge MA and London.: Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Bardram, J. and C. Bossen. A web of coordinative artefacts: Collaborative work in a hospital ward. in GROUP. 2005. Sanible Island: ACM.  ",
      "doi": "10.1145/1099203.1099235"
    },
    {
      "text": "Bjørn, P. and M. Hertzum, Artefactual Multiplicity: A Study of Emergency-Department Whiteboards. Computer Supported Cooperative Work (CSCW): An International Journal, 2011. 20(1): p. 93.  ",
      "doi": "10.1007/s10606-010-9126-7"
    },
    {
      "text": "Cabitza, F. and C. Simone, \"...and do it the usual way\": Fostering awareness of work conventions in document-mediated collarboration, in ECSCW2007, Springer: Limerick, Ireland. p. 119--138.",
      "doi": ""
    },
    {
      "text": "Christensen, L.R., Practices of Stigmergy in Architectural Work., in Proceedings of the 2007 international ACM conference on Supporting group work.2007, ACM: Sanibel Island, Florida, USA. p. 11--20.  ",
      "doi": "10.1145/1316624.1316627"
    },
    {
      "text": "Frohmann, B., Multiplicity, Materiality, and Autonomous Agency of Documentation, in A Document (Re)turn: contributions from a research field in transition, R. Skare, N.W. Lund, and A.Varheim, Editors. 2007, Peter Lang GmbH: Frankfurt am Main p. 27--39.",
      "doi": ""
    },
    {
      "text": "Grinter, R., Recomposition: Coordinating a web of software dependencies. Computer Supported Cooperative Work (CSCW): An International Journal, 2003. 12: p. 297--327.  ",
      "doi": "10.1023/A%3A1025012916465"
    },
    {
      "text": "Harper, R., Inside The IMF: An ethnography of Documents, Technology and Organizational Action1998, San Diego: Academic Press. ",
      "doi": "10.5555/522687"
    },
    {
      "text": "Hertzum, M. Six Roles of Documents in Professionals' Work. in Sixth European Conference on Computer Supported Cooperative Work. 1999. Copenhagen, Denmark, September 12--16: Kluwer Academic Publisher. ",
      "doi": "10.5555/351689.351693"
    },
    {
      "text": "Jensen, C.B. and P. Lauritsen, Reading digital Denmark: IT reports as material-semiotic actors. Science, Technology & Human Values 2005. 30(3): p. 352--373.",
      "doi": ""
    },
    {
      "text": "Jensen, R.E. and P. Bjørn, Divergence and convergence in global software development: Cultural complextities as societal structures, in COOP: Design of cooperative systems2012, Springer: France. p. 123--136.",
      "doi": ""
    },
    {
      "text": "Kristeva, J., The Kristeva Reader, ed. T.M. (ed.)1986, Oxford.: Blackwell.",
      "doi": ""
    },
    {
      "text": "Luff, P., C. Heath, and D. Greatbatch, Tasks-ininteraction: Paper and Screen based Documentation in Collaborative Activity., in Proceedings of the Conference on Computer Supported Cooperative Work. 1992, ACM.  ",
      "doi": "10.1145/143457.143475"
    },
    {
      "text": "Lund, N.W., Document theory. Annual Review of Information Science and Technology, 2009. 43(1): p. 1--55.  ",
      "doi": "10.1002/aris.2009.1440430116"
    },
    {
      "text": "Malone, T., How do people organize their desks' Implications for the design of office information systems. ACM Transactioins on Information Systems, 1983. 1: p. 99--112.  ",
      "doi": "10.1145/357423.357430"
    },
    {
      "text": "Matthiesen, S., P. Bjørn, and L.M. Petersen, Figure Out How to Code with the Hands of Others: Recognizing Cultural Blind Spots in Global Software Development, in Computer Supported Cooperative Work (CSCW)2014, ACM: Baltimore, USA.  ",
      "doi": "10.1145/2531602.2531612"
    },
    {
      "text": "Saussure, F.d., Course in General Linguistics1974, London: Fontana. ",
      "doi": "10.5555/1594067"
    },
    {
      "text": "Schmidt, K. and L. Bannon, Taking CSCW Seriously: Supporting Articulation Work. Computer Supported Cooperative Work (CSCW). An International Journal., 1992. 1(1--2): p. 7--40.",
      "doi": ""
    },
    {
      "text": "Schmidt, K. and I. Wagner, Ordering systems: Coordinative practices and artifacts in architectural design and planning. Computer Supported Cooperative Work (CSCW): The Journal of Collaborative Computing, 2004. 13(5--6): p. 349--408.  ",
      "doi": "10.5555/1045432.1045434"
    },
    {
      "text": "Søderberg, A.M., S. Krishna, and P. Bjørn, Global Software Development: Commitment, Trust and Cultural Sensitivity in Strategic Partnerships. International journal of Management, 2013.",
      "doi": ""
    },
    {
      "text": "Star, S.L., The ethnography of infrastructure. American Behavioral Scientist, 1999. 43: p. 377--391.",
      "doi": ""
    },
    {
      "text": "Xiao, Y., et al. Cognitive properties of a whiteboard: A case study in a trauma centre. in Seventh European Conference on Computer Supported Cooperative work. 2001. Bonn, Germany: Kluwer Academic Publisher. ",
      "doi": "10.5555/1241867.1241881"
    },
    {
      "text": "Zacklad, M., Documentarisation Processes in Documents for Action (DofA): The Status of Annotations and Associated Cooperation Technologies. Computer Supported Cooperative Work, 2006. 15(205): p. 205--228.  ",
      "doi": "10.1007/s10606-006-9019-y"
    }
  ]
}