{
  "doi": "10.1145/2556288.2557105",
  "title": "GaussBricks: magnetic building blocks for constructive tangible interactions on portable displays",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3153-3162",
  "year": 2014,
  "badges": [],
  "abstract": "This work describes a novel building block system for tangible interaction design, GaussBricks, which enables real-time constructive tangible interactions on portable displays. Given its simplicity, the mechanical design of the magnetic building blocks facilitates the construction of configurable forms. The form constructed by the magnetic building blocks, which are connected by the magnetic joints, allows users to stably manipulate with various elastic force feedback mechanisms. With an analog Hall-sensor grid mounted to its back, a portable display determines the geometrical configuration and detects various user interactions in real time. This work also introduce several methods to enable shape changing, multi-touch input, and display capabilities in the construction. The proposed building block system enriches how individuals interact with the portable displays physically.",
  "authors": [
    {
      "name": "Rong-Hao Liang",
      "institution": "National Taiwan University & Academia Sinica, Taipei, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321494894",
      "orcid": "0000-0003-3239-8749"
    },
    {
      "name": "Liwei Chan",
      "institution": "National Taiwan University, Taipei, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659142992",
      "orcid": "missing"
    },
    {
      "name": "Hung-Yu Tseng",
      "institution": "National Taiwan University, Taipei, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958763057",
      "orcid": "missing"
    },
    {
      "name": "Han-Chih Kuo",
      "institution": "National Taiwan University, Taipei, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959346357",
      "orcid": "missing"
    },
    {
      "name": "Da-Yuan Huang",
      "institution": "National Taiwan University, Taipei, Taiwan",
      "img": "/do/10.1145/contrib-81551198756/rel-imgonly/81551198756.jpg",
      "acmid": "81551198756",
      "orcid": "missing"
    },
    {
      "name": "De-Nian Yang",
      "institution": "Academia Sinica, Taipei, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100353194",
      "orcid": "missing"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taipei, Taiwan",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    }
  ],
  "references": [
    {
      "text": "Anderson, D., Frankel, J. L., Marks, J., Agarwala, A., Beardsley, P., Hodgins, J., Leigh, D., Ryall, K., Sullivan, E., and Yedidia, J. S. Tangible interaction + graphical interpretation: a new approach to 3d modeling. In Proc. SIGGRAPH '00 (2000), 393--402.  ",
      "doi": "10.1145/344779.344960"
    },
    {
      "text": "Avrahami, D., Wobbrock, J. O., and Izadi, S. Portico: tangible interaction on and around a tablet. In Proc. UIST '11 (2011), 347--356.  ",
      "doi": "10.1145/2047196.2047241"
    },
    {
      "text": "Baudisch, P., Becker, T., and Rudeck, F. Lumino: tangible blocks for tabletop computers based on glass fiber bundles. In Proc. CHI '10 (2010), 1165--1174.  ",
      "doi": "10.1145/1753326.1753500"
    },
    {
      "text": "Bianchi, A., and Oakley, I. Designing tangible magnetic appcessories. In Proc. TEI '13 (2013), 255--258.  ",
      "doi": "10.1145/2460625.2460667"
    },
    {
      "text": "Brockmeyer, E., Poupyrev, I., and Hudson, S. Papillon: Designing curved display surfaces with printed optics. In Proc. UIST '13 (2013), 457--462.  ",
      "doi": "10.1145/2501988.2502027"
    },
    {
      "text": "Chan, L., Müller, S., Roudaut, A., and Baudisch, P. CapStones and ZebraWidgets: sensing stacks of building blocks, dials and sliders on capacitive touch screens. In Proc. CHI '12 (2012), 2189--2192.  ",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Fitzmaurice, G. W., Ishii, H., and Buxton, W. A. S. Bricks: laying the foundations for graspable user interfaces. In Proc. CHI '95 (1995), 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Gorbet, M. G., Orth, M., and Ishii, H. Triangles: tangible interface for manipulation and exploration of digital information topography. In Proc. CHI '98 (1998), 49--56.  ",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "Gupta, A., Fox, D., Curless, B., and Cohen, M. Duplotrack: a real-time system for authoring and guiding duplo block assembly. In Proc. UIST '12 (2012), 389--402.  ",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Hodges, S., Izadi, S., Butler, A., Rrustemi, A., and Buxton, B. ThinSight: versatile multi-touch sensing for thin form-factor displays. In Proc. UIST '07 (2007), 259--268.  ",
      "doi": "10.1145/1294211.1294258"
    },
    {
      "text": "Ishii, H. Tangible bits: beyond pixels. In Proc. TEI '08 (2008), xv--xxv.  ",
      "doi": "10.1145/1347390.1347392"
    },
    {
      "text": "Ishii, H., and Ullmer, B. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proc. CHI '97 (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Leitner, J., and Haller, M. Geckos: combining magnets and pressure images to enable new tangible-object design and interaction. In Proc. CHI '11 (2011), 2985--2994.  ",
      "doi": "10.1145/1978942.1979385"
    },
    {
      "text": "Leitner, J., and Haller, M. PUCs: Detecting transparent, passive untouched capacitive widgets on unmodified multi-touch displays. In Proc. ITS '13 (2013), 101--104.  ",
      "doi": "10.1145/2512349.2512791"
    },
    {
      "text": "Liang, R.-H., Cheng, K.-Y., Chan, L., Peng, C.-X., Chen, M. Y., Liang, R.-H., Yang, D.-N., and Chen, B.-Y. GaussBits: Magnetic tangible bits for portable and occlusion-free near-surface tangible interactions. In Proc. CHI '13 (2013), 1391--1400.  ",
      "doi": "10.1145/2470654.2466185"
    },
    {
      "text": "Liang, R.-H., Cheng, K.-Y., Su, C.-H., Weng, C.-T., Chen, B.-Y., and Yang, D.-N. GaussSense: Attachable stylus sensing using magnetic sensor grid. In Proc. UIST '12 (2012), 319--326.  ",
      "doi": "10.1145/2380116.2380157"
    },
    {
      "text": "Merrill, D., Kalanithi, J., and Maes, P. Siftables: towards sensor network user interfaces. In Proc. TEI '07 (2007), 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Oschuetz, L., Wessolek, D., and Sattler, W. Constructing with movement: kinematics. In Proc. TEI '10 (2010), 257--260.  ",
      "doi": "10.1145/1709886.1709938"
    },
    {
      "text": "Parkes, A., and Ishii, H. Bosu: a physical programmable design tool for transformability with soft mechanics. In Proc. DIS '10 (2010), 189--198.  ",
      "doi": "10.1145/1858171.1858205"
    },
    {
      "text": "Piper, B., Ratti, C., and Ishii, H. Illuminating clay: a 3-d tangible interface for landscape analysis. In Proc. CHI '02 (2002), 355--362.  ",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Prasad, L. Morphological analysis of shapes. CNLS Newsletter 139 (1997), 1--18.",
      "doi": ""
    },
    {
      "text": "Prévost, R., Whiting, E., Lefebvre, S., and Sorkine-Hornung, O. Make It Stand: Balancing shapes for 3D fabrication. ACM TOG 32, 4 (2013), 81:1--81:10.  ",
      "doi": "10.1145/2461912.2461957"
    },
    {
      "text": "Raffle, H. S., Parkes, A. J., and Ishii, H. Topobo: a constructive assembly system with kinetic memory. In Proc. CHI '04 (2004), 647--654.  ",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Rekimoto, J. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In Proc. CHI '02 (2002), 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Resnick, M., Martin, F., Berg, R., Borovoy, R., Colella, V., Kramer, K., and Silverman, B. Digital manipulatives: new toys to think with. In Proc. CHI '98 (1998), 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Rosenberg, I., and Perlin, K. The UnMousePad: an interpolating multi-touch force-sensing input pad. ACM TOG 28, 3 (2009), 65:1--65:9.  ",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "Vertegaal, R., and Poupyrev, I. Introduction. Commun. ACM 51, 6 (2008), 26--30.  ",
      "doi": "10.1145/1349026.1349033"
    },
    {
      "text": "Watanabe, R., Itoh, Y., Asai, M., Kitamura, Y., Kishino, F., and Kikuchi, H. The soul of activecube: implementing a flexible, multimodal, three-dimensional spatial tangible interface. Comput. Entertain. 2, 4 (2004), 15--15.  ",
      "doi": "10.1145/1037851.1037874"
    },
    {
      "text": "Weiss, M., Wagner, J., Jansen, Y., Jennings, R., Khoshabeh, R., Hollan, J. D., and Borchers, J. SLAP widgets: bridging the gap between virtual and physical controls on tabletops. In Proc. CHI '09 (2009), 481--490.  ",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "Willis, K., Brockmeyer, E., Hudson, S., and Poupyrev, I. Printed optics: 3d printing of embedded optical elements for interactive devices. In Proc. UIST '12 (2012), 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Yao, L., Niiyama, R., Ou, J., Follmer, S., Della Silva, C., and Ishii, H. PneUI: Pneumatically actuated soft composite materials for shape changing interfaces. In Proc. UIST '13 (2013), 13--22.  ",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Yu, N.-H., Chan, L.-W., Lau, S. Y., Tsai, S.-S., Hsiao, I.-C., Tsai, D.-J., Hsiao, F.-I., Cheng, L.-P., Chen, M., Huang, P., and Hung, Y.-P. TUIC: enabling tangible interaction on capacitive multi-touch displays. In Proc. CHI '11 (2011), 2995--3004.  ",
      "doi": "10.1145/1978942.1979386"
    }
  ]
}