{
  "doi": "10.1145/2556288.2557041",
  "title": "OJAS: open source bi-directional inductive power link",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1049-1058",
  "year": 2014,
  "badges": [],
  "abstract": "We present the design, development and evaluation of a bi-directional inductive power transfer circuit for prototyping purposes in the watt-range. Our device does not require any configuration and is intended for the development of wearable and tangible systems. Our approach allows a bi-directional power flow without any change in the circuit, such that the same circuit can be used for charging and discharging a battery. The contribution of this work is an enabling technology for researchers and practitioners in the fields of Wearable Electronics, Ubiquitous Computing and Human-Computer Interaction interested in exploring new interactions powered by watt-range inductive links. It enables smaller battery sizes, and therefore lighter devices, as the power can be distributed in a way that has not been feasible before. We discuss the motivations, technical details and the workshop evaluating our inductive approach.",
  "authors": [
    {
      "name": "Jussi Mikkonen",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314494677",
      "orcid": "missing"
    },
    {
      "name": "Ramyah Gowrishankar",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458625057",
      "orcid": "missing"
    },
    {
      "name": "Miia Oksanen",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958619457",
      "orcid": "missing"
    },
    {
      "name": "Harri Raittinen",
      "institution": "Icraft oy, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958873157",
      "orcid": "missing"
    },
    {
      "name": "Arto Kolinummi",
      "institution": "iCraft Oy, Tampere, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958688457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arshad, A., Khan, S., Alam, A. H. M. Z. and Tasnim, R. Investigation of inductive coupling approach for non-contact bidirectional transfer of power and signal, In Proc. ICCCE (2012), 570--573.",
      "doi": ""
    },
    {
      "text": "Bao, L., Li, X. Towards Textile Energy Storage from Cotton T-Shirts. Advanced Materials, (2012) 3246--3252.",
      "doi": ""
    },
    {
      "text": "Berzowska, J. and Coelho, M. Kukkia and Vilkas: kinetic electronic garments. In Proc. ISWC, (2005), 82--85.  ",
      "doi": "10.1109/ISWC.2005.29"
    },
    {
      "text": "Berzowska, J. Constellation Dresses and the Leeches: Questions of Power for Electronic Garments. In Anonymous International Foundation of Fashion Technology Institutes Conference, 2007.",
      "doi": ""
    },
    {
      "text": "Buechley, L., Eisenberg, M., Catchen, J., and Crockett, A. The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education. In Proc. CHI 2008. ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Buxton, B. Sketching User Experiences: Getting the Design Right and the Right Design: Getting the Design Right and the Right Design. Morgan Kaufmann, 2007. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Deyle, T. and Reynolds, M. PowerPACK: A wireless power distribution system for wearable devices, In Proc. ISWC, 2008.  ",
      "doi": "10.1109/ISWC.2008.4911592"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible bits: Towards seamless interfaces between people, bits, and atoms. In Proc. CHI. ACM Press, (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Iso-Ketola P., Karinsalo T., Myry M., Hahto L., Karhu H., Malmivaara M. and Vanhala J. A Mobile Device as User Interface for Wearable Applications. In Proc. PERMID, 2005.",
      "doi": ""
    },
    {
      "text": "Margot J., and Worbin L. Reach: dynamic textile patterns for communication and social expression. In Extended Abstracts CHI. (2005), 1493--1496.  ",
      "doi": "10.1145/1056808.1056949"
    },
    {
      "text": "Koskinen, I., Mikkonen, J., Ahde, P., Eckoldt, K., Helgason, T., Hänninen, R., Jiang, J., Niskanen, T. and Schultz B. Hacking a Car: Re-Embodying the Design Classroom. In Proc. NORDES, 2009.",
      "doi": ""
    },
    {
      "text": "Koskinen, I., Zimmerman, J., Binder, T., Redstrom, J. and Wensveen, S. Design research through practice: from the lab, field, and showroom. Waltham, MA: Morgan Kaufmann/Elsevier, 2011. ",
      "doi": "10.5555/2132674"
    },
    {
      "text": "Kuznetsov, S., Trutoiu, L., Kute, C., Howley, I., Paulos, E., and Siewiorek, D. Breaking boundaries: strategies for mentoring through textile computing workshops. In Proc. CHI 2011, ACM Press (2011).  ",
      "doi": "10.1145/1978942.1979380"
    },
    {
      "text": "Linz, T., Kallmayer, C., Aschenbrenner, R. and Reichl, H. Embroidering electrical interconnects with conductive yarn for the integration of flexible electronic modules into fabric, In Proc. ISWC, (2005), 86--89.  ",
      "doi": "10.1109/ISWC.2005.19"
    },
    {
      "text": "Mikkonen J. Flowcards - a communication tool, In Proc. DRS, (2012), 1215--1229.",
      "doi": ""
    },
    {
      "text": "Mikkonen, J., Kivioja, S., Suonsilta, H., Myllymäki, R. and Vanhakartano, S. Printed Material as Fabric, In Proc. NORDES, 2013.",
      "doi": ""
    },
    {
      "text": "Perner-Wilson, H., Buechley, L. and Satomi, M. Handcrafting textile interfaces from a kit-of-no-parts. In Proc. TEI, 2011.  ",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Royer, G. H., A switching transistor D-C to A-C converter having an output frequency proportional to the D-C input voltage, American Institute of Electrical Engineers, Part I: Communication and Electronics, Transactions of the, (1955), 322--326.",
      "doi": ""
    },
    {
      "text": "Schuessler, J. E., Bi-directional wireless charger, US Patent 20120229071. (2012)",
      "doi": ""
    },
    {
      "text": "Starner T. The challenges of wearable computing: Part 1, IEEE Micro, (2001), 44--52.  ",
      "doi": "10.1109/40.946681"
    },
    {
      "text": "Tanaka, T., Sonoda, K., Okochi, S., Chan, A., Nii, M., Kanda, K., Fujita, T., Higuchi, K. and Maenaka, K. Wearable Health Monitoring System and Its Applications, In Proc. ICETET, (2011), 143--146.  ",
      "doi": "10.1109/ICETET.2011.34"
    },
    {
      "text": "Tanenbaum, K., Tanenbaum, J., Antle, A., Bizzocchi, J., el-Nasr, M. and Hatala, M. Experiencing the reading glove. In Proc. TEI, 2011.  ",
      "doi": "10.1145/1935701.1935728"
    },
    {
      "text": "Thorp, E. O. The Invention of the First. Wearable Computer. In Proc. ISWC, IEEE CS Press (1998). ",
      "doi": "10.5555/857199.858031"
    },
    {
      "text": "Thrimawithana, D. J., Madawala, U. K. and Neath, M. A steady-state analysis of bi-directional inductive power transfer systems, In Proc. ICIT, (2013), 1618--1623.",
      "doi": ""
    },
    {
      "text": "Toney, A. P., Thomas, B. H. and Marais, W. Managing Smart Garments, In Proc. ISWC, (2006), 91--94.",
      "doi": ""
    },
    {
      "text": "Waffenschmidt, E. and Staring, T. Limitation of inductive power transfer for consumer applications, In Proc. EPE, (2009), 1--10.",
      "doi": ""
    },
    {
      "text": "Weiser, M. The Computer for the 21st Century. Scientific American, (1991), 94--104.",
      "doi": ""
    },
    {
      "text": "5W Bi-directional wireless charging solution, http://www.idealez.com/80520355/product-detail/en_US/70714, Cited 20th Dec. 2013",
      "doi": ""
    },
    {
      "text": "Inductive charging set, http://www.adafruit.com/products/1407, Cited 9th Sept. 2013.",
      "doi": ""
    },
    {
      "text": "Wireless Power Charger!, http://www.instructables.com/id/Wireless-Ipod-Charger/, Cited 9th Sept. 2013.",
      "doi": ""
    }
  ]
}