{
  "doi": "10.1145/2556288.2557308",
  "title": "The effectiveness (or lack thereof) of aim-assist techniques in first-person shooter games",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "937-946",
  "year": 2014,
  "badges": [],
  "abstract": "Aim-assistance techniques have been shown to work for player balancing in 2D environments, but little information exists about how well these techniques will work in a 3D FPS game. We carried out three studies of the performance of five different aim assists in an Unreal-based game world. The assists worked well in a target-range scenario (study 1), but their performance was reduced when game elements were introduced in a walkthrough map (study 2). We systematically examined the relationships between realistic game elements and assist performance (study 3). These studies show that two techniques -- bullet magnetism and area cursor -- worked well in a wide variety of situations. Other techniques that worked well were too perceptible, and some previously-successful techniques did not work well in any game-like scenario. Our studies are the first to provide empirical evidence of the performance of aim assist techniques in 3D environments, and the first to identify the complexities in using these techniques in real FPS games.",
  "authors": [
    {
      "name": "Rodrigo Vicencio-Moreira",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958834557",
      "orcid": "missing"
    },
    {
      "name": "Regan L. Mandryk",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Scott Bateman",
      "institution": "University of Prince Edward Island, Charlottetown, Prince Edward Island, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361599570",
      "orcid": "0000-0003-3592-2163"
    }
  ],
  "references": [
    {
      "text": "Adams, E. Fundamentals of Game Design. New Riders, 2010. ",
      "doi": "10.5555/1804572"
    },
    {
      "text": "Adams, E. Difficulty Modes and Dynamic Difficulty Adjustment. Gamasutra: The Art & Business of Making Games Blog. Published May 2008, gamasutra.com/ view/feature/3660/the_designers_notebook_.php",
      "doi": ""
    },
    {
      "text": "Balakrishnan, R. \"Beating\" Fitt's law: virtual enhancements for pointing facilitation. IJHCS, 61, (2004), 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Bateman, S., Mandryk, R.L., Stach, T. and Gutwin, C. Target assistance for subtly balancing competitive play. In CHI 2011, 2355--2364.  ",
      "doi": "10.1145/1978942.1979287"
    },
    {
      "text": "Blanch, R., Guiard Y., and Beaudouin-Lafon, M. Semantic Pointing: Improving Target Acquisition with Control-Display Ratio Adaptation. In CHI 2004, 24--29.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Bostan, B., and Ögüt, S. Game challenges and difficulty levels: lessons learned From RPGs. In International Simulation and Gaming Association Conference, 2009.",
      "doi": ""
    },
    {
      "text": "Cockburn, A, and Firth, A. Improving the Acquisition of Small Targets. In HCI03 Conference on People and Computers XVII, 2003. 181--196.",
      "doi": ""
    },
    {
      "text": "Csíkszentmihályi, M. Flow: The Psychology of Optimal Experience. Harper and Row, 1990.",
      "doi": ""
    },
    {
      "text": "Elmqvist, N., and Fekete, J. Semantic Pointing for Object Picking in Complex 3D Environments. In GI 2008, 243--250. ",
      "doi": "10.5555/1375714.1375755"
    },
    {
      "text": "Entertainment Software Association. 2013 Essential Facts About the Computer and Video Game Industry www.theesa.com/facts/pdfs/ESA_EF_2013.pdf",
      "doi": ""
    },
    {
      "text": "Falstein, N. Understanding fun -- the Theory of Natural Funativity. In Introduction to Game Development, Rabin, S. (ed.), 71--98. Charles River Media, 2005.",
      "doi": ""
    },
    {
      "text": "Findlater, L, Jansen, A., Shinohara, K., Dixon, M., Kamb, P., Rakita. J., and Wobbrock, J.O. Enhanced Area Cursors Reducing Fine Pointing Demands for People with Motor Impairments. In UIST 2010, 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Fitts, P.M. (1954). The information capacity of the human motor system in controlling the amplitude of movement. J.Exp. Psych., 47, 381--391.",
      "doi": ""
    },
    {
      "text": "Flatla, D., Gutwin, C., Nacke, L.E., Bateman, S., and Mandryk, R.L. Calibration Games: Making Calibration Tasks Enjoyable by Adding Motivating Game Elements. In UIST 2011, 403--412.  ",
      "doi": "10.1145/2047196.2047248"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. Object pointing: a complement to bitmap pointing in GUIs. In GI 2004, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Herbrich, R., Minka, T., and Graepel, T. TrueSkill(TM): A Bayesian skill rating system. In Advances in Neural Information Processing Systems, 20, 569--576, 2007.",
      "doi": ""
    },
    {
      "text": "Hunicke, R. The case for dynamic difficulty adjustment in games. In ACE 2005, vol. 265, 429--433.  ",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "Kabbash, P. and Buxton, W. The \"Prince\" Technique: Fitts' Law and Selection Using Area Cursors. In CHI 1995, 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Looser, J., Cockburn, A. and Savage, J. On the Validity of Using First-Person Shooters for Fitts' Law Studies. In HCI 2005, 33--36.",
      "doi": ""
    },
    {
      "text": "Mandryk, R.L., Gutwin, C. Perceptibility and Utility of Sticky Targets. In GI 2008, 65--72. ",
      "doi": "10.5555/1375714.1375726"
    },
    {
      "text": "Natapov, D., Castellucci, S. J., and MacKenzie, I. S. (2009). ISO 9241--9 evaluation of video game controllers. In GI 2009. 223--230. ",
      "doi": "10.5555/1555880.1555930"
    },
    {
      "text": "Newheiser, Mark. Playing Fair: A Look at Competition in Gaming. Strange Horizons, www.strangehorizons. com/2009/20090309/newheiser-a.shtml",
      "doi": ""
    },
    {
      "text": "Sweetser, P. and Wyeth, P. GameFlow: a model for evaluating player enjoyment in games. Computers in Entertainment, 3, 3--3, 205.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Vorderer, P., Hartmann, T., and Klimmt, C. Explaining the enjoyment of playing video games: the role of competition. In Entertainment Computing'03, 1--9. ",
      "doi": "10.5555/958720.958735"
    },
    {
      "text": "Wobbrock, J.O., Fogarty, J., Liu, S., Kimuro, S., Harada, S. The Angle Mouse: Target-Agnostic Dynamic Gain Adjustment Based on Angular Deviation. In CHI 2009, 1401--1410.  ",
      "doi": "10.1145/1518701.1518912"
    },
    {
      "text": "Worden A, Walker N, Bharat K, Hudson S. Making Computers Easier for Older Adults to Use: Area Cursors and Sticky Icons. In CHI 1997, 266--271  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Youssef, A. and Cossell, S. Thoughts on adjusting perceived difficulty in games. In Australasian Conference on Interactive Entertainment, 1--4, 2009.  ",
      "doi": "10.1145/1746050.1746064"
    }
  ]
}