{
  "doi": "10.1145/2556288.2557208",
  "title": "Exploiting thermal reflection for interactive systems",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3483-3492",
  "year": 2014,
  "badges": [],
  "abstract": "Thermal cameras have recently drawn the attention of HCI researchers as a new sensory system enabling novel interactive systems. They are robust to illumination changes and make it easy to separate human bodies from the image background. Far-infrared radiation, however, has another characteristic that distinguishes thermal cameras from their RGB or depth counterparts, namely thermal reflection. Common surfaces reflect thermal radiation differently than visual light and can be perfect thermal mirrors. In this paper, we show that through thermal reflection, thermal cameras can sense the space beyond their direct field-of-view. A thermal camera can sense areas besides and even behind its field-of-view through thermal reflection. We investigate how thermal reflection can increase the interaction space of projected surfaces using camera-projection systems. We moreover discuss the reflection characteristics of common surfaces in our vicinity in both the visual and thermal radiation bands. Using a proof-of-concept prototype, we demonstrate the increased interaction space for hand-held camera-projection system. Furthermore, we depict a number of promising application examples that can benefit from the thermal reflection characteristics of surfaces.",
  "tags": [
    "reflection",
    "heat",
    "thermal imaging",
    "roughness",
    "camera-projector system"
  ],
  "authors": [
    {
      "name": "Alireza Sahami Shirazi",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548021084",
      "orcid": "missing"
    },
    {
      "name": "Yomna Abdelrahman",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-87959289757/rel-imgonly/yomna.jpg",
      "acmid": "87959289757",
      "orcid": "0000-0002-2859-7297"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    },
    {
      "name": "Stefan Schneegass",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81503680798/rel-imgonly/stefan_wide.png",
      "acmid": "81503680798",
      "orcid": "0000-0002-0132-4934"
    },
    {
      "name": "Mohammadreza Khalilbeigi",
      "institution": "Darmstadt University of Technology, Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81460658361/rel-imgonly/khalilbeigi.jpg",
      "acmid": "81460658361",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Beckmann, P., and Spizzichino, A. The scattering of electromagnetic waves from rough surfaces. Artech House Radar Library, 1987.",
      "doi": ""
    },
    {
      "text": "Bennett, H., and Porteus, J. Relation between surface roughness and specular reflectance at normal incidence. Journal of the Optical Society of America 51 (1961).",
      "doi": ""
    },
    {
      "text": "Blasko, G., Feiner, S., and Coriand, F. Exploring interaction with a simulated wrist-worn projection display. In Proceedings of the International Symposium on Wearable Computers (2005), 2--9.  ",
      "doi": "10.1109/ISWC.2005.21"
    },
    {
      "text": "Cao, X., and Balakrishnan, R. Interacting with dynamically defined information spaces using a handheld projector and a pen. In Proceedings of the Symposium on User interface software and technology (2006), 225--234.  ",
      "doi": "10.1145/1166253.1166289"
    },
    {
      "text": "Cao, X., Forlines, C., and Balakrishnan, R. Multi-user interaction using handheld projectors. In Proceedings of the Symposium on User interface software and technology (2007), 43--52.  ",
      "doi": "10.1145/1294211.1294220"
    },
    {
      "text": "Ciaramello, F. M., and Hemami, S. S. Real-time face and hand detection for videoconferencing on a mobile device. In Proceedings of the Workshop on Video Processing and Quality Metrics for Consumer Electronics (2009).",
      "doi": ""
    },
    {
      "text": "Cohen, C. J., Beach, G., and Foulk, G. A basic hand gesture control system for pc applications. In Proceedings of the Workshop on Applied Imagery Pattern Recognition (2001), 74--79. ",
      "doi": "10.5555/872018.872309"
    },
    {
      "text": "Cowan, L. G., and Li, K. A. Shadowpuppets: supporting collocated interaction with mobile projector phones using hand shadows. In Proceedings of the Conference on Human Factors in Computing Systems (2011).  ",
      "doi": "10.1145/1978942.1979340"
    },
    {
      "text": "Duda, R. O., and Hart, P. E. Use of the hough transformation to detect lines and curves in pictures. Communications of the ACM 15, 1 (1972), 11--15.  ",
      "doi": "10.1145/361237.361242"
    },
    {
      "text": "Greaves, A., and Rukzio, E. Evaluation of picture browsing using a projector phone. In Proceedings of the Conference on Human computer interaction with mobile devices and services (2008), 351--354.  ",
      "doi": "10.1145/1409240.1409286"
    },
    {
      "text": "Harrison, C., Benko, H., and Wilson, A. D. Omnitouch: wearable multitouch interaction everywhere. In Proceedings of the Symposium on User interface software and technology (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Henze, N., Löcken, A., Boll, S., Hesselmann, T., and Pielot, M. Free-hand gestures for music playback: deriving gestures with a user-centred process. In Proceedings of the Conference on Mobile and Ubiquitous Multimedia (2010), 16:1--16:10.  ",
      "doi": "10.1145/1899475.1899491"
    },
    {
      "text": "Hilliges, O., Izadi, S., Wilson, A. D., Hodges, S., Garcia-Mendoza, A., and Butz, A. Interactions in the air: adding further depth to interactive tabletops. In Proceedings of the Symposium on User interface software and technology (2009), 139--148.  ",
      "doi": "10.1145/1622176.1622203"
    },
    {
      "text": "Iwai, D., and Sato, K. Heat sensation in image creation with thermal vision. In Proceedings of the Conference on Advances in computer entertainment technology (2005), 213--216.  ",
      "doi": "10.1145/1178477.1178510"
    },
    {
      "text": "Iwai, D., and Sato, K. Limpid desk: see-through access to disorderly desktop in projection-based mixed reality. In Proceedings of the Symposium on Virtual reality software and technology (2006), 112--115.  ",
      "doi": "10.1145/1180495.1180519"
    },
    {
      "text": "Iwai, Y., Watanabe, K., Yagi, Y., and Yachida, M. Gesture recognition by using colored gloves. In Proceedings of the Conference on Systems, Man, and Cybernetics (1996), 76--81.",
      "doi": ""
    },
    {
      "text": "Izadi, S., Hodges, S., Taylor, S., Rosenfeld, D., Villar, N., Butler, A., and Westhues, J. Going beyond the display: a surface technology with an electronically switchable diffuser. In Proceedings of the Symposium on User interface software and technology (2008), 269--278.  ",
      "doi": "10.1145/1449715.1449760"
    },
    {
      "text": "Kane, S. K., Avrahami, D., Wobbrock, J. O., Harrison, B., Rea, A. D., Philipose, M., and LaMarca, A. Bonfire: a nomadic system for hybrid laptop-tabletop interaction. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (2009), 129--138.  ",
      "doi": "10.1145/1622176.1622202"
    },
    {
      "text": "Khan, M. M., Ingleby, M., and Ward, R. D. Automated facial expression classification and affect interpretation using infrared measurement of facial skin temperature variations. ACM Transactions on Autonomous Adaptive Systems 1, 1 (2006), 91--113.  ",
      "doi": "10.1145/1152934.1152939"
    },
    {
      "text": "Kim, D., Hilliges, O., Izadi, S., Butler, A. D., Chen, J., Oikonomidis, I., and Olivier, P. Digits: freehand 3d interactions anywhere using a wrist-worn gloveless sensor. In Proceedings of the Symposium on User interface software and technology (2012), 167--176.  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Koike, H., Sato, Y., and Kobayashi, Y. Integrating paper and digital information on enhanceddesk: a method for realtime finger tracking on an augmented desk system. ACM Transactions on Computer-Human Interaction 8, 4 (2001), 307--322.  ",
      "doi": "10.1145/504704.504706"
    },
    {
      "text": "Kong, S. G., Heo, J., Boughorbel, F., Zheng, Y., Abidi, B. R., Koschan, A., Yi, M., and Abidi, M. A. Multiscale fusion of visible and thermal ir images for illumination-invariant face recognition. International Journal of Computer Vision 71, 2 (2007), 215--233.  ",
      "doi": "10.1007/s11263-006-6655-0"
    },
    {
      "text": "Larson, E., Cohn, G., Gupta, S., Ren, X., Harrison, B., Fox, D., and Patel, S. Heatwave: thermal imaging for surface user interaction. In Proceedings of the Conference on Human Factors in Computing Systems (2011), 2565--2574.  ",
      "doi": "10.1145/1978942.1979317"
    },
    {
      "text": "Lyda, W., Zimmermann, J., Burla, A., Regin, J., Osten, W., Sawodny, O., and Westkämper, E. Sensor and actuator conditioning for multiscale measurement systems on example of confocal microscopy. In SPIE Europe Optical Metrology, vol. 7389 (2009).",
      "doi": ""
    },
    {
      "text": "Manresa, C., Varona, J., Mas, R., and Perales, F. Hand tracking and gesture recognition for human-computer interaction. Electronic letters on computer vision and image analysis 5, 3 (2005), 96--104.",
      "doi": ""
    },
    {
      "text": "Mistry, P., Maes, P., and Chang, L. Wuw - wear ur world: a wearable gestural interface. In Proceedings of the Conference on Human Factors in Computing Systems (extended abstracts) (2009), 4111--4116.  ",
      "doi": "10.1145/1520340.1520626"
    },
    {
      "text": "Murugappan, S., Vinayak, Elmqvist, N., and Ramani, K. Extended multitouch: recovering touch posture and differentiating users using a depth camera. In Proceedings of the Symposium on User interface software and technology (2012), 487--496.  ",
      "doi": "10.1145/2380116.2380177"
    },
    {
      "text": "Otsu, N. A threshold selection method from gray-level histograms. Automatica 11, 285--296 (1975), 23-27.",
      "doi": "10.1016/0005-1098%2875%2990044-8"
    },
    {
      "text": "Pham, Q.-C., Gond, L., Begard, J., Allezard, N., and Sayd, P. Real-time posture analysis in a crowd using thermal imaging. In Proceedings of the Conference on Computer Vision and Pattern Recognition (2007), 1--8.",
      "doi": ""
    },
    {
      "text": "Puri, C., Olson, L., Pavlidis, I., Levine, J., and Starren, J. Stresscam: non-contact measurement of users' emotional states through thermal imaging. In Proceedings of the Conference on Human Factors in Computing Systems (extended abstracts) (2005), 1725--1728.  ",
      "doi": "10.1145/1056808.1057007"
    },
    {
      "text": "Raheja, J. L., Das, K., and Chaudhary, A. Fingertip detection: A fast method with natural hand. arXiv preprint arXiv:1212.0134 (2012).",
      "doi": ""
    },
    {
      "text": "Rukzio, E., Holleis, P., and Gellersen, H. Personal projectors for pervasive computing. IEEE Pervasive Computing 11, 2 (2012), 30--37.  ",
      "doi": "10.1109/MPRV.2011.17"
    },
    {
      "text": "Schmidt, D., Molyneaux, D., and Cao, X. Picontrol: using a handheld projector for direct control of physical devices through visible light. In Proceedings of the Symposium on User interface software and technology (2012), 379--388.  ",
      "doi": "10.1145/2380116.2380166"
    },
    {
      "text": "Stenger, B., Thayananthan, A., Torr, P. H., and Cipolla, R. Model-based hand tracking using a hierarchical bayesian filter. Transactions on Pattern Analysis and Machine Intelligence 28, 9 (2006), 1372--1384.  ",
      "doi": "10.1109/TPAMI.2006.189"
    },
    {
      "text": "Tiziani, H., Haist, T., and Reuter, S. Optical inspection and characterization of microoptics using confocal microscopy. Optics and lasers in engineering 36, 5 (2001), 403--415.",
      "doi": ""
    },
    {
      "text": "Velten, A., Willwacher, T., Gupta, O., Veeraraghavan, A., Bawendi, M. G., and Raskar, R. Recovering three-dimensional shape around a corner using ultrafast time-of--ight imaging. Nature Communications 3 (2012).",
      "doi": ""
    },
    {
      "text": "Vollmer, M., Henke, S., Karstädt, D., Möllmann, K., and Pinno, F. Identification and suppression of thermal reflections in infrared thermal imaging. In Proceedings of Inframation, vol. 5 (2004), 287--298.",
      "doi": ""
    },
    {
      "text": "Wang, R. Y., and Popović, J. Real-time hand-tracking with a color glove. In ACM Transactions on Graphics, vol. 28 (2009), 63:1--63:8.  ",
      "doi": "10.1145/1531326.1531369"
    },
    {
      "text": "Willis, K. D., Poupyrev, I., and Shiratori, T. Motionbeam: a metaphor for character interaction with handheld projectors. In Proceedings of the Conference on Human Factors in Computing Systems (2011), 1031--1040.  ",
      "doi": "10.1145/1978942.1979096"
    },
    {
      "text": "Wilson, A. D. Touchlight: an imaging touch screen and display for gesture-based interaction. In Proceedings of the Conference on Multimodal interfaces (2004), 69--76.  ",
      "doi": "10.1145/1027933.1027946"
    },
    {
      "text": "Wilson, A. D. Playanywhere: a compact interactive tabletop projection-vision system. In Proceedings of the Symposium on User interface software and technology (2005), 83--92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Wilson, A. D. Depth sensing video cameras for 3d tangible tabletop interaction. In Proceedings of Workshop on Horizontal Interactive Human-Computer Systems (2007).",
      "doi": ""
    },
    {
      "text": "Wilson, A. D. Using a depth camera as a touch sensor. In Proceedings of the Conference on Interactive Tabletops and Surfaces (2010), 69--72.  ",
      "doi": "10.1145/1936652.1936665"
    },
    {
      "text": "Wilson, A. D., and Benko, H. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proceedings of the Symposium on User interface software and technology (2010), 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Winkler, C., Pfeuffer, K., and Rukzio, E. Investigating mid-air pointing interaction for projector phones. In Proceedings of the Conference on Interactive tabletops and surfaces (2012), 85--94.  ",
      "doi": "10.1145/2396636.2396650"
    },
    {
      "text": "Winkler, C., Reinartz, C., Nowacka, D., and Rukzio, E. Interactive phone call: synchronous remote collaboration and projected interactive surfaces. In Proceedings of the Conference on Interactive Tabletops and Surfaces (2011), 61--70.  ",
      "doi": "10.1145/2076354.2076367"
    },
    {
      "text": "Wong, W. K., Lim, H. L., Loo, C. K., and Lim, W. S. Home alone faint detection surveillance system using thermal camera. In Proceedings of the Conference on Computer Research and Development (2010), 747--751.  ",
      "doi": "10.1109/ICCRD.2010.163"
    },
    {
      "text": "Wong, W. K., Tan, P. N., Loo, C. K., and Lim, W. S. An effective surveillance system using thermal camera. In Proceedings of the Conference on Signal Acquisition and Processing (2009), 13--17.  ",
      "doi": "10.1109/ICSAP.2009.12"
    }
  ]
}