{
  "doi": "10.1145/2556288.2557354",
  "title": "Modeling the functional area of the thumb on mobile touchscreen surfaces",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1991-2000",
  "year": 2014,
  "badges": [],
  "abstract": "We present a predictive model for the functional area of the thumb on a touchscreen surface: the area of the interface reachable by the thumb of the hand that is holding the device. We derive a quadratic formula by analyzing the kinematics of the gripping hand. Model fit is high for the thumb-motion trajectories of 20 participants. The model predicts the functional area for a given 1) surface size, 2) hand size, and 3) position of the index finger on the back of the device. Designers can use this model to ensure that a user interface is suitable for interaction with the thumb. The model can also be used inversely - that is, to infer the grips assumed by a given user interface layout.",
  "tags": [
    "touchscreen",
    "predictive model",
    "thumb",
    "functional area"
  ],
  "authors": [
    {
      "name": "Joanna Bergstrom-Lehtovirta",
      "institution": "Helsinki Institute for Information Technology HIIT, Aalto University & University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81453655512/rel-imgonly/blogpic_joanna.png",
      "acmid": "81453655512",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Max Planck Institute for Informatics & Saarland University, Saarbruecken, Germany",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "Azenkot, S., Wobbrock, J. O., Prasain, S., and Ladner, R. E. Input finger detection for nonvisual touch screen text entry in Perkinput. In Proc. GI '12, Canadian Information Processing Society (2012), 121--129. ",
      "doi": "10.5555/2305276.2305297"
    },
    {
      "text": "Azenkot, S., and Zhai, S. Touch behavior with different postures on soft smartphone keyboards. In Proc. MobileHCI '12, ACM (2012), 251--260.  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Bergstrom-Lehtovirta, J., Oulasvirta, A., and Brewster, S. The effects of walking speed on target acquisition on a touchscreen interface. In Proc. MobileHCI '11, ACM (2011), 143--146.  ",
      "doi": "10.1145/2037373.2037396"
    },
    {
      "text": "Cheng, L.-P., Liang, H.-S., Wu, C.-Y., and Chen, M. Y. iGrasp: Grasp-based adaptive keyboard for mobile devices. In Proc. CHI '13, ACM (2013), 3037--3046.  ",
      "doi": "10.1145/2470654.2481422"
    },
    {
      "text": "Clark, J. Designing for touch (section \"Rule of thumb\"). http://www.netmagazine.com/features/designing-touch.",
      "doi": ""
    },
    {
      "text": "Curtis, D. 3.5 inches. http://dcurt.is/3-point-5-inches.",
      "doi": ""
    },
    {
      "text": "Dept. of Defense, Human Factors Engineering Technical Advisory Group. Human engineering design data digest. http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA467401.",
      "doi": ""
    },
    {
      "text": "Garrett, J. W. The adult human hand: Some anthropometric and biomechanical considerations. Human Factors: The Journal of the Human Factors and Ergonomics Society 13, 2 (1971), 117--131.",
      "doi": ""
    },
    {
      "text": "Goel, M., Jansen, A., Mandel, T., Patel, S. N., and Wobbrock, J. O. ContextType: Using hand posture information to improve mobile touch screen text entry. In Proc. CHI '13, ACM (2013), 2795--2798.  ",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Goel, M., Wobbrock, J., and Patel, S. GripSense: Using built-in sensors to detect hand posture and pressure on commodity mobile phones. In Proc. UIST '12, ACM (2012), 545--554.  ",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Guiard, Y. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior 19 (1987), 486--517.",
      "doi": ""
    },
    {
      "text": "Holz, C., and Baudisch, P. Understanding touch. In Proc. CHI '11, ACM (2011), 2501--2510.  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Hoober, S. How do users really hold mobile devices' http://www.uxmatters.com/mt/archives/2013/02/how-do-users-really-hold-mobile-devices.php.",
      "doi": ""
    },
    {
      "text": "Jones, L. A., and Lederman, S. J. Human Hand Function. Oxford University Press, 2006.",
      "doi": ""
    },
    {
      "text": "Karlson, A., Bederson, B., and Contreras-Vidal, J. Understanding single-handed mobile device interaction. Handbook of research on user interface design and evaluation for mobile technology (2006), 86--101.",
      "doi": ""
    },
    {
      "text": "Kim, K.-E., Chang, W., Cho, S.-J., Shim, J., Lee, H., Park, J., Lee, Y., and Kim, S. Hand grip pattern recognition for mobile user interfaces. In Proc. AAAI '06, vol. 21 (2006), 1789--1794. ",
      "doi": "10.5555/1597122.1597138"
    },
    {
      "text": "Kuo, L.-C., Chiu, H.-Y., Chang, C.-W., Hsu, H.-Y., and Sun, Y.-N. Functional workspace for precision manipulation between thumb and fingers in normal hands. Journal of Electromyography and Kinesiology 19, 5 (2009), 829--839.",
      "doi": ""
    },
    {
      "text": "Li, Z.-M., and Tang, J. Coordination of thumb joints during opposition. Journal of Biomechanics 40, 3 (2007), 502--510.",
      "doi": ""
    },
    {
      "text": "Napier, J. R. The prehensile movements of the human hand. Journal of Bone and Joint Surgery 38, 4 (1956), 902--913.",
      "doi": ""
    },
    {
      "text": "Neumann, D. Kinesiology of the Musculoskeletal System: Foundations for Rehabilitation. Mosby Elsevier, 2010.",
      "doi": ""
    },
    {
      "text": "Ng, A., Brewster, S. A., and Williamson, J. The impact of encumbrance on mobile interactions. In Proc. INTERACT 2013, Springer (2013), 92--109.",
      "doi": ""
    },
    {
      "text": "Odell, D., and Chandrasekaran, V. Enabling comfortable thumb interaction in tablet computers: A windows 8 case study. In Proc. HFES '12, vol. 56, SAGE Publications (2012), 1907--1911.",
      "doi": ""
    },
    {
      "text": "Oulasvirta, A., and Bergstrom-Lehtovirta, J. Ease of juggling: Studying the effects of manual multitasking. In Proc. CHI '11, ACM (2011), 3103--3112.  ",
      "doi": "10.1145/1978942.1979402"
    },
    {
      "text": "Oulasvirta, A., Reichel, A., Li, W., Zhang, Y., Bachynskyi, M., Vertanen, K., and Kristensson, P. O. Improving two-thumb text entry on touchscreen devices. In Proc. CHI '13, ACM (2013), 2765--2774.  ",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Parhi, P., Karlson, A. K., and Bederson, B. B. Target size study for one-handed thumb use on small touchscreen devices. In Proc. MobileHCI '06, ACM (2006), 203--210.  ",
      "doi": "10.1145/1152215.1152260"
    },
    {
      "text": "Park, Y. S., and Han, S. H. Touch key design for one-handed thumb interaction with a mobile phone: Effects of touch key size and touch key location. International Journal of Industrial Ergonomics 40, 1 (2010), 68--76.",
      "doi": ""
    },
    {
      "text": "Taylor, B. T., and Bove, V. M. The bar of soap: A grasp recognition system implemented in a multi-functional handheld device. In CHI '08 Extended Abstracts, ACM (2008), 3459--3464.  ",
      "doi": "10.1145/1358628.1358874"
    },
    {
      "text": "Trudeau, M. B., Young, J. G., Jindrich, D. L., and Dennerlein, J. T. Thumb motor performance varies with thumb and wrist posture during single-handed mobile phone use. Journal of Biomechanics 45 (2012), 2349--2354.",
      "doi": ""
    },
    {
      "text": "Wagner, J., Huot, S., and Mackay, W. BiTouch and BiPad: Designing bimanual interaction for hand-held tablets. In Proc. CHI '12, ACM (2012), 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    },
    {
      "text": "Wroblewski, L. Responsive navigation: Optimizing for touch across devices. http://www.lukew.com/ff/entry.asp?1649.",
      "doi": ""
    },
    {
      "text": "Yin, Y., Ouyang, T. Y., Partridge, K., and Zhai, S. Making touchscreen keyboards adaptive to keys, hand postures, and individuals - a hierarchical spatial backoff model approach. In Proc. CHI '13, ACM (2013), 2775--2784.  ",
      "doi": "10.1145/2470654.2481384"
    }
  ]
}