{
  "doi": "10.1145/2556288.2557410",
  "title": "Beating the bubble: using kinematic triggering in the bubble lens for acquiring small, dense targets",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "733-742",
  "year": 2014,
  "badges": [],
  "abstract": "We present the Bubble Lens, a new target acquisition technique that remedies the limitations of the Bubble Cursor to increase the speed and accuracy of acquiring small, dense targets--precisely those targets for which the Bubble Cursor degenerates to a point cursor. When targets are large and sparse, the Bubble Lens behaves like the Bubble Cursor. But when targets are small and dense, the Bubble Lens automatically magnifies nearby targets, making them larger in both visual- and motor-space. Importantly, magnification is not governed by an explicit user-invoked mode-switch. Rather, magnification is activated through kinematic triggering, a technique that continuously examines an unfolding velocity profile to automatically trigger mode changes based on observed features. In a first study, we found the Bubble Cursor performed poorly when targets had an effective size smaller than 10 pixels. Using this threshold for the Bubble Lens in a second study, we found that the Bubble Lens significantly outperformed the Bubble Cursor, decreasing movement time by 10.2% and error rates by 37.9%, making the Bubble Lens the fastest current pointing technique.",
  "tags": [
    "bubble cursor",
    "magnification",
    "mouse pointing",
    "lensing",
    "target acquisition",
    "kinematics",
    "zooming",
    "pointing facilitation",
    "pointing techniques"
  ],
  "authors": [
    {
      "name": "Martez E. Mott",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81472645021/rel-imgonly/mott_headshot_2019.jpg",
      "acmid": "81472645021",
      "orcid": "0000-0003-4711-7268"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Accot, J. and Zhai, S. (1997). Beyond Fitts' law: Models for trajectory-based HCI tasks. Proc. CHI '97. New York: ACM Press, 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Accot, J. and Zhai, S. (2002). More than dotting the i's? Foundations for crossing-based interfaces. Proc. CHI '02. New York: ACM Press, 73--80.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Appert, C., Chapuis, O., and Pietriga, E. (2010). Highprecision magnification lenses. Proc CHI '10. New York: ACM Press, 273--282.  ",
      "doi": "10.1145/1753326.1753366"
    },
    {
      "text": "Asano, T., Sharlin, E., Kitamura, Y., Takashima, K., and Kishino, F. (2005). Predictive interaction using the delphian desktop. Proc UIST '05. New York: ACM Press, 133--141.  ",
      "doi": "10.1145/1095034.1095058"
    },
    {
      "text": "Balakrishnan, R. (2004). \"Beating\" Fitts' law: Virtual enhancements for pointing facilitation. Int'l J. Human Computer Studies 61 (6), 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Baudisch, P., Zotov, A., Cutrell, E., and Hinckley, K. (2008). Starburst: A target expansion algorithm for nonuniform target distributions. Proc. AVI '08. New York: ACM Press, 129--137.  ",
      "doi": "10.1145/1385569.1385592"
    },
    {
      "text": "Blanch, R., Guiard, Y., and Beaudouin-Lafon, M. (2004). Semantic pointing: Improving target acquisition with control-display ratio adaptation. Proc. CHI '04. ACM Press, 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Chapuis, O. and Dragicevic, P. (2011). Effects of motor scale, visual scale, and quantization on small target acquisition difficulty. ACM TOCHI 18 (3), 1--32.  ",
      "doi": "10.1145/1993060.1993063"
    },
    {
      "text": "Chapuis, O., Labrune, J.-B., and Pietriga, E. (2009). DynaSpot: Speed-dependent area cursor. Proc. CHI '09. New York: ACM Press, 1391--1400.  ",
      "doi": "10.1145/1518701.1518911"
    },
    {
      "text": "Cockburn, A. and Brewster, S. (2005). Multimodal feedback for the acquisition of small targets. Ergonomics 48 (9), 1129--1150.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and Firth, A. (2003). Improving the acquisition of small targets. Proc. BCS-HCI '03. Swindon, England: British Computer Society, 181--196.",
      "doi": ""
    },
    {
      "text": "Dixon, M., Fogarty, J., and Wobbrock, J.O. (2012). A general-purpose target-aware pointing enhancement using pixel-level analysis of graphical interfaces. Proc. CHI '12. New York: ACM Press, 3167--3176.  ",
      "doi": "10.1145/2207676.2208734"
    },
    {
      "text": "Dixon, M. and Fogarty, J. (2010). Prefab: Implementing advanced behaviors using pixel-based reverse engineering of interface structure. Proc. CHI '10. New York: ACM Press, 1525--1534.  ",
      "doi": "10.1145/1753326.1753554"
    },
    {
      "text": "Dixon, M., Leventhal, D., and Fogarty, J. (2011). Content and hierarchy in pixel-based methods for reverse engineering interface structure. Proc. CHI '11. New York: ACM Press, 969--978.  ",
      "doi": "10.1145/1978942.1979086"
    },
    {
      "text": "Findlater, L., Jansen, A., Shinohara, K., Dixon, M., Kamb, P., Rakita, J. and Wobborck, J.O. (2010). Enhanced area cursors: Reducing fine pointing demands for people with motor impairments. Proc. UIST '10. New York: ACM Press, 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Fisher, R., Perkins, S., Walker, A., and Wolfart, E. (2003). Gaussian smoothing. Hypermedia Image Processing Reference. University of Edinburgh.",
      "doi": ""
    },
    {
      "text": "Furnas, G.W. Generalized fisheye views. (1986). Proc. CHI '86. New York: ACM Press, 16--23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Grossman, T. and Balakrishnan, R. (2005). The Bubble Cursor: Enhancing target acquisition by dynamic resizing of the cursor's activation area. Proc. CHI '05. New York: ACM Press, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Guiard, Y., Blanch, R., and Beaudouin-Lafon, M. (2004). Object Pointing: A complement to bitmap pointing in GUIs. Proc. GI '04. Toronto: CIPS, 9--16. ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Gutwin, C. (2002). Improving focus targeting in interactive fisheye views. Proc. CHI '02. New York: ACM Press, 267--274.  ",
      "doi": "10.1145/503376.503424"
    },
    {
      "text": "Hart, S.G. and Staveland, L.E. (1998). Development of NASA-TLX (Task Load Index): Results of emperical and theoretical research. In Human Mental Workload, Hancock and Meshkati (eds). Amersterdam: North Holland, 139--183.",
      "doi": ""
    },
    {
      "text": "Higgins, J.J. and Tashtoush, S. (1994). An Aligned Rank Transform test for interaction. Nonlinear World 1, (2), 2011--211.",
      "doi": ""
    },
    {
      "text": "Holm, S. (1979). A simple sequentially rejective multiple test procedure. Scandinavian J. Statistics 6 (2), 65--70.",
      "doi": ""
    },
    {
      "text": "Hourcade, J.P., Perry, K.B., and Sharma, A. (2008). PointAssist: Helping four year olds point with ease. Proc. IDC '08. New York: ACM Press, 202--209.  ",
      "doi": "10.1145/1463689.1463757"
    },
    {
      "text": "Igarashi, T. and Hinckley, K. (2000). Speed-dependent automatic zooming for browsing large documents. Proc. UIST '00. New York: ACM Press, 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Jansen, A., Findlater, L., and Wobbrock, J.O. (2011). From the Lab to the world: Lessons from extending a pointing technique for real-world use. Proc. CHI EA '11. New York: ACM Press, 1867--1872.  ",
      "doi": "10.1145/1979742.1979888"
    },
    {
      "text": "Kabbash, P. and Buxton, W.A.S. The \"Prince\" Technique: Fitts' law and selection using area cursors. Proc. CHI '95. New York: ACM Press, 273--279.  ",
      "doi": "10.1145/223904.223939"
    },
    {
      "text": "Kobayashi, M. and Igarashi, T. (2008). Ninja Cursors: Using multiple cursors to assist target acquisition on large screens. Proc. CHI '08. New York: ACM Press, 949--958.  ",
      "doi": "10.1145/1357054.1357201"
    },
    {
      "text": "Lank, E., Cheng, Y.N., and Ruiz, J. (2007). Endpoint prediction using motion kinematics. Proc. CHI '07. New York: ACM Press, 637--646.  ",
      "doi": "10.1145/1240624.1240724"
    },
    {
      "text": "Laukkanen, J., Isokoski, P., and Räihä, K.-J. (2008). The Cone and the Lazy Bubble: Two efficient alternatives between the point cursor and the Bubble Cursor. Proc. CHI '08. New York: ACM, 309--312.  ",
      "doi": "10.1145/1357054.1357107"
    },
    {
      "text": "Littell, R.C., Henery, P.R., and Ammerman, C.B. (1998). Statistical analysis of repeated measures data using SAS procedures. J. Animal Science 76 (4), 1216--1231.",
      "doi": ""
    },
    {
      "text": "Mankoff, J., Hudson, S.E., and Abowd, G.D. (2000). Interaction techniques for ambiguity resolution in recognition-based interfaces. Proc. UIST '00. New York: ACM Press, 11--20.  ",
      "doi": "10.1145/354401.354407"
    },
    {
      "text": "McGuffin, M. and Balakrishnan, R. (2002). Acquisition of expanding targets. Proc. CHI '02. New York: ACM Press, 57--64.  ",
      "doi": "10.1145/503376.503388"
    },
    {
      "text": "Meyer, D.E., Smith, J.E.K., Kornblum, S., Abrams, R.A., and Wright, C.E. (1990). Speed-accuracy tradeoffs in aimed movements: Toward a theory of rapid voluntary action. Attention and Performance 13 (23), 173--226.",
      "doi": ""
    },
    {
      "text": "Moffatt, K. and McGrenere, J. (2010). Steadied Bubbles: Combining techniques to address pen-based pointing errors for younger and older adults. Proc. CHI '10. New York: ACM Press, 1125--1134.  ",
      "doi": "10.1145/1753326.1753495"
    },
    {
      "text": "Pasqual, P.T. and Wobbrock, J.O. (2014). Mouse pointing endpoint prediction using kinematic template matching. Proc. CHI '2014. New York: ACM Press. To appear.  ",
      "doi": "10.1145/2556288.2557406"
    },
    {
      "text": "Pietriga, E. and Appert, C. (2008). Sigma lenses: focus-context transitions combining space, time and translucence. Proc. CHI '08. New York: ACM Press, 1343--1352.  ",
      "doi": "10.1145/1357054.1357264"
    },
    {
      "text": "Pietriga, E., Bau, O., and Appert, C. (2009). Representation-independent in-place magnification with sigma lenses. IEEE TVCG 16 (3), 455--467.  ",
      "doi": "10.1109/TVCG.2009.98"
    },
    {
      "text": "Ramos, G., Cockburn, A., Balakrishnan, R., and Beaudouin-Lafon, M. (2007). Pointing lenses: Facilitating stylus input through visual- and motor-space magnification. Proc. CHI '07. New York:ACM Press, 757--766.  ",
      "doi": "10.1145/1240624.1240741"
    },
    {
      "text": "Ruiz, J. and Lank, E. (2010). Speeding pointing in tiled widgets: Understanding the effects of target expansion and misprediction. Proc. IUI '10. New York: ACM Press, 229--238.  ",
      "doi": "10.1145/1719970.1720002"
    },
    {
      "text": "Trewin, S., Keates, S., and Moffatt, K. (2006). Developing Steady Clicks: A method of cursor assistance for people with motor impairments. Proc. ASSETS '06. New York: ACM Press, 26--33.  ",
      "doi": "10.1145/1168987.1168993"
    },
    {
      "text": "Wobbrock, J.O., Findlater, L., Gergle, D., and Higgins, J.J. (2011). The Aligned Rank Transform for nonparametric factorial analyses using only ANOVA procedures. Proc. CHI '11. New York: ACM Press, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Wobbrock, J.O., Fogarty, J., Liu, S.-Y. (Sean), Kimuro, S., and Harada, S. (2009). The Angle Mouse: Target-agnostic dynamic gain adjustment based on angular deviation. Proc. CHI '09. New York: ACM Press, 1401--1410.  ",
      "doi": "10.1145/1518701.1518912"
    },
    {
      "text": "Worden, A., Walker, N., Bharat, K., and Hudson, S. (1997). Making computers easier for older adults to use: Area cursors and sticky icons. Proc. CHI '97. New York: ACM Press, 266--271.  ",
      "doi": "10.1145/258549.258724"
    },
    {
      "text": "Ziebart, B., Dey, A., and Bagnell, J.A. (2012). Probabilistic pointing target prediction via inverse optimal control. Proc. IUI '12. New York: ACM Press, 1--10.  ",
      "doi": "10.1145/2166966.2166968"
    }
  ]
}