{
  "doi": "10.1145/2556288.2556973",
  "title": "Didn't you see my message?: predicting attentiveness to mobile instant messages",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3319-3328",
  "year": 2014,
  "badges": [],
  "abstract": "Mobile instant messaging (e.g., via SMS or WhatsApp) often goes along with an expectation of high attentiveness, i.e., that the receiver will notice and read the message within a few minutes. Hence, existing instant messaging services for mobile phones share indicators of availability, such as the last time the user has been online. However, in this paper we not only provide evidence that these cues create social pressure, but that they are also weak predictors of attentiveness. As remedy, we propose to share a machine-computed prediction of whether the user will view a message within the next few minutes or not. For two weeks, we collected behavioral data from 24 users of mobile instant messaging services. By the means of machine-learning techniques, we identified that simple features extracted from the phone, such as the user's interaction with the notification center, the screen activity, the proximity sensor, and the ringer mode, are strong predictors of how quickly the user will attend to the messages. With seven automatically selected features our model predicts whether a phone user will view a message within a few minutes with 70.6% accuracy and a precision for fast attendance of 81.2%",
  "authors": [
    {
      "name": "Martin Pielot",
      "institution": "Telefonica Research, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81385591697/rel-imgonly/cv_shirt.jpg",
      "acmid": "81385591697",
      "orcid": "missing"
    },
    {
      "name": "Rodrigo de Oliveira",
      "institution": "Telefonica Research & Google Inc., Barcelona, Spain",
      "img": "/do/10.1145/contrib-81310493550/rel-imgonly/rodrigo-photo3.jpg",
      "acmid": "81310493550",
      "orcid": "missing"
    },
    {
      "name": "Haewoon Kwak",
      "institution": "Telefonica Research, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81452618313/rel-imgonly/haewoon_kwak_informal.jpg",
      "acmid": "81452618313",
      "orcid": "missing"
    },
    {
      "name": "Nuria Oliver",
      "institution": "Telefonica Research, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81100082450/rel-imgonly/nuriaoliver.jpg",
      "acmid": "81100082450",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P. D., and Bailey, B. P. If not now, when?: the effects of interruption at different moments within task execution. In Proc. CHI '04, ACM (2004).  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Avrahami, D., Fussell, S. R., and Hudson, S. E. IM waiting: timing and responsiveness in semi-synchronous communication. In Proc. CSCW '08, ACM (2008).  ",
      "doi": "10.1145/1460563.1460610"
    },
    {
      "text": "Avrahami, D., and Hudson, S. E. Responsiveness in instant messaging: predictive models supporting inter-personal communication. In Proc. CHI '06, ACM (2006).  ",
      "doi": "10.1145/1124772.1124881"
    },
    {
      "text": "Begole, J. B., Matsakis, N. E., and Tang, J. C. Lilsys: Sensing unavailability. In Proc. CSCW '04, ACM (2004).  ",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "Breiman, L. Random forests. Machine Learning 45, 1 (2001), 5--32.  ",
      "doi": "10.1023/A%3A1010933404324"
    },
    {
      "text": "Church, K., and de Oliveira, R. What's up with whatsapp? comparing mobile instant messaging behaviors with traditional sms. In Proc. MobileHCI '13, ACM (2013).  ",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Czerwinski, M., Horvitz, E., and Wilhite, S. A diary study of task switching and interruptions. In Proc. CHI '04, ACM (2004).  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Dabbish, L. A., Kraut, R. E., Fussell, S., and Kiesler, S. Understanding email use: Predicting action on a message. In Proc. CHI '05, ACM (2005).  ",
      "doi": "10.1145/1054972.1055068"
    },
    {
      "text": "De Guzman, E. S., Sharmin, M., and Bailey, B. P. Should i call now? understanding what context is considered when deciding whether to initiate remote communication via mobile devices. In Proc GI '07, ACM (2007).  ",
      "doi": "10.1145/1268517.1268542"
    },
    {
      "text": "Fogarty, J., Hudson, S. E., Atkeson, C. G., Avrahami, D., Forlizzi, J., Kiesler, S., Lee, J. C., and Yang, J. Predicting human interruptibility with sensors. ACM Trans. Comput.-Hum. Interact. 12, 1 (Mar 2005), 119--146.  ",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "Gonzalez, M. C., Hidalgo, C. A., and Barabasi, A.-L. Understanding individual human mobility patterns. Nature 453 (2008), 779--782.",
      "doi": ""
    },
    {
      "text": "Hall, M., Frank, E., Holmes, G., Pfahringer, B., Reutemann, P., and Witten, I. H. The weka data mining software: an update. ACM SIGKDD Explorations Newsletter 11, 1 (2009), 10--18.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Harper, R., and Taylor, S. Glancephone: an exploration of human expression. In Proc. MobileHCI '09, ACM (2009).  ",
      "doi": "10.1145/1613858.1613890"
    },
    {
      "text": "Horvitz, E., Koch, P., and Apacible, J. Busybody: creating and fielding personalized models of the cost of interruption. In Proc. CSCW '04, ACM (2004).  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Hudson, S., Fogarty, J., Atkeson, C., Avrahami, D., Forlizzi, J., Kiesler, S., Lee, J., and Yang, J. Predicting human interruptibility with sensors: a wizard of oz feasibility study. In Proc. CHI '03, ACM (2003).  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Nardi, B. A., Whittaker, S., and Bradner, E. Interaction and outeraction: instant messaging in action. In CSCW '00, ACM (2000).  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Oulasvirta, A., Rattenbury, T., Ma, L., and Raita, E. Habits make smartphone use more pervasive. Personal Ubiquitous Comput. 16, 1 (Jan 2012), 105--114.  ",
      "doi": "10.1007/s00779-011-0412-2"
    },
    {
      "text": "Reynolds, L., Smith, M. E., Birnholtz, J. P., and Hancock, J. T. Butler lies from both sides: actions and perceptions of unavailability management in texting. In Proc. CSCW '13, ACM (2013).  ",
      "doi": "10.1145/2441776.2441862"
    },
    {
      "text": "Rosenthal, S., Dey, A. K., and Veloso, M. Using decision-theoretic experience sampling to build personalized mobile phone interruption models. In Proc. Pervasive '11, Springer-Verlag (2011). ",
      "doi": "10.5555/2021975.2021991"
    },
    {
      "text": "Sahami Shirazi, A., Henze, N., Pielot, M., Weber, D., and Schmidt, A. Large-scale assessment of mobile notifications. In Proc. CHI '14, ACM (2014).  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Shin, C., and Dey, A. K. Automatically detecting problematic use of smartphones. In Proc. UbiComp '13, ACM (2013).  ",
      "doi": "10.1145/2493432.2493443"
    },
    {
      "text": "Teevan, J., and Hehmeyer, A. Understanding how the projection of availability state impacts the reception incoming communication. In Proc. CSCW '13, ACM (2013).  ",
      "doi": "10.1145/2441776.2441860"
    },
    {
      "text": "Tyler, J. R., and Tang, J. C. When can i expect an email response? a study of rhythms in email usage. In Proc. ECSCW '03, Kluwer Academic Publishers (2003). ",
      "doi": "10.5555/1241889.1241902"
    }
  ]
}