{
  "doi": "10.1145/2556288.2557201",
  "title": "Goals and perceived success of online enterprise communities: what is important to leaders & members?",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "291-300",
  "year": 2014,
  "badges": [],
  "abstract": "Online communities are successful only if they achieve their goals, but there has been little direct study of goals. We analyze novel data characterizing the goals of enterprise online communities, assessing the importance of goals for leaders, how goals influence member perceptions of community value, and how goals relate to success measures proposed in the literature. We find that most communities have multiple goals and common goals are learning, reuse of resources, collaboration, networking, influencing change, and innovation. Leaders and members agree that all of these goals are important, but their perceptions of success on goals do not align with each other, or with commonly used behavioral success measures. We conclude that simple behavioral measures and leader perceptions are not good success metrics, and propose alternatives based on specific goals members and leaders judge most important.",
  "authors": [
    {
      "name": "Tara Matthews",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Jilin Chen",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487940",
      "orcid": "0000-0002-0513-7474"
    },
    {
      "name": "Steve Whittaker",
      "institution": "University of California at Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "Aditya Pal",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459556257",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    },
    {
      "name": "Hernan Badenes",
      "institution": "IBM, Buenos Aires, Argentina",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81413603985",
      "orcid": "missing"
    },
    {
      "name": "Barton Smith",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100079617",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, S. I., Tilton, A., and Woodside, D. M. The case for online communities. McKinsey Quarterly 1, (2002).",
      "doi": ""
    },
    {
      "text": "Butler, B., et al. Community effort in online groups: Who does the work and why? In Leadership at a distance. Erlbaum, '02.",
      "doi": ""
    },
    {
      "text": "Cothrel, J. P. Measuring the success of an online community. Strategy & Leadership 28, 2 (2000), 17--21.",
      "doi": ""
    },
    {
      "text": "Durant, K. T., McCray, A. T., Safran, C. Modeling the temporal evolution of an online cancer forum. Proc. of Health Inf. '10.  ",
      "doi": "10.1145/1882992.1883042"
    },
    {
      "text": "Ebrahim, N. A., et al. Virtual R&D teams in small and medium enterprises: A literature review. SSRN eLibrary, (2009).",
      "doi": ""
    },
    {
      "text": "Gastwirth, J. L. The Estimation of the Lorenz Curve and Gini Index. The Rev. of Economics & Statistics 54, 3 (1972), 306.",
      "doi": ""
    },
    {
      "text": "Harper, F. M., Moy, D., and Konstan, J. A. Facts or friends?: distinguishing informational and conversational questions in social Q&A sites. (2009), 759--768.  ",
      "doi": "10.1145/1518701.1518819"
    },
    {
      "text": "Iriberri, A., Leroy, G. A life-cycle perspective on online community success. ACM Comput. Surv. 41, 2 (2009), 1--29.  ",
      "doi": "10.1145/1459352.1459356"
    },
    {
      "text": "Johnson, C. M. A survey of current research on online communities of practice. The Internet & Higher Ed. 4,1 '01, 45--60.",
      "doi": ""
    },
    {
      "text": "Kaufman, L., Rousseeuw, P. J. Finding groups in data: an introduction to cluster analysis. Wiley, 2005.",
      "doi": ""
    },
    {
      "text": "Kraut, R. E., Resnick, P. Building successful online communities: Evidence-based social design. MIT, 2012. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Lazar, J., Preece, J. Classification schema for online communities. Proc. of AISAC, (1998), 84--86.",
      "doi": ""
    },
    {
      "text": "Leimeister, J. M., Sidiras, P., Krcmar, H. Success factors of virtual communities from the perspective of members and operators: An empirical study. Proc. of HICSS, (2004). ",
      "doi": "10.5555/962755.963096"
    },
    {
      "text": "Lin, H., Fan, W., Wallace, L., Zhang, Z. An empirical study of web-based knowledge community success. Proc. of HICSS 07.  ",
      "doi": "10.1109/HICSS.2007.65"
    },
    {
      "text": "Lithium Technologies, Inc. Community health index for online communities. 2011.",
      "doi": ""
    },
    {
      "text": "Matthews, T., Whittaker, S., Badenes, H., et al. Community insights: helping community leaders enhance the value of enterprise online communities. Proc. of CHI, (2013), 513--522.  ",
      "doi": "10.1145/2470654.2470728"
    },
    {
      "text": "Millen, D. R., et al. Understanding the benefit and costs of communities of practice. Commun. ACM 45, 4 (2002), 69--73.  ",
      "doi": "10.1145/505248.505276"
    },
    {
      "text": "Muller, M., Ehrlich, K., Matthews, et al. Diversity among enterprise online communities: collaborating, teaming, and innovating through social media. Proc. of CHI '12, 2815--24.  ",
      "doi": "10.1145/2207676.2208685"
    },
    {
      "text": "Pal, A., et al. Early detection of potential experts in question answering communities. In J. A. Konstan, et al. eds., User Modeling, Adaption and Personalization. Springer (2011) 231. ",
      "doi": "10.5555/2021855.2021876"
    },
    {
      "text": "Pal, A., Margatan, J., Konstan, J. A. Question temporality: identification and uses. (2012), 257--260.  ",
      "doi": "10.1145/2145204.2145246"
    },
    {
      "text": "Porter, C. E. A typology of virtual communities: A multi-disciplinary foundation for future research. J. of CMC 10, 1 '04.",
      "doi": ""
    },
    {
      "text": "Preece, J., Nonnecke, B., Andrews, D. The top five reasons for lurking: improving community experiences for everyone. Computers in Human Behavior 20, 2 (2004), 201--223.",
      "doi": ""
    },
    {
      "text": "Preece, J. Online communities: Designing usability and supporting sociability. Wiley, 2000. ",
      "doi": "10.5555/517688"
    },
    {
      "text": "Seidman, I. Interviewing as qualitative research: a guide for researchers in education and the social sciences. Teachers College Press, New York, 2006.",
      "doi": ""
    },
    {
      "text": "Wenger, E., et al. Cultivating communities of practice: A guide to managing knowledge. Harvard Business, 2002. ",
      "doi": "10.5555/560383"
    },
    {
      "text": "Whittaker, S., Terveen, L., Hill, W., Cherny, L. The dynamics of mass interaction. Proc. of CSCW, (1998), 257--264.  ",
      "doi": "10.1145/289444.289500"
    }
  ]
}