{
  "doi": "10.1145/2556288.2557381",
  "title": "The product of availability: understanding the economic underpinnings of constant connectivity",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "763-772",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Constant connectivity and total availability to clients is the rule rather than the exception in many contemporary workplaces. Enabled by developments in information and communication technologies (ICTs), total availability of employees is possible and presumed. Scholars have explored how new technological affordances, cultural shifts, individual personality traits, and/or the development of social expectations that reinforce norms of constant connectivity have led to this state of affairs. We argue that a key factor has been overlooked in current scholarship about stress, intensive work, and constant connectivity. That is, current economic conditions are creating a marketplace in which firms increasing sell the availability of their employees as part of the services offered by the firm. In this paper we use qualitative data to illustrate how total availability is an integral aspect of the 'product' offered by professional service firms and is becoming increasingly prevalent in other service industries. We conclude with a discussion of how the HCI community might address this situation as a design challenge. Drawing on the work of Goffman and Perlow, we suggest that designers attend to the ways in which organizations might maintain front stage impressions of total availability while collectively managing individual time to restrict total availability behind the scenes.",
  "authors": [
    {
      "name": "Melissa Mazmanian",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467671821",
      "orcid": "missing"
    },
    {
      "name": "Ingrid Erickson",
      "institution": "Rutgers University, New Brunswick, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444599030",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agger, B. iTime: Labor and life in a smartphone era. Time and Society, 20 (1). 119--136.",
      "doi": ""
    },
    {
      "text": "Ames, M. G., Managing mobile multitasking: the culture of iPhones on stanford campus. in Computer supported cooperative work (2013), 1487--1498.  ",
      "doi": "10.1145/2441776.2441945"
    },
    {
      "text": "Barker, J. R. Tightening the Iron Cage: Concertive Control in Self-Managing Teams. Administrative Science Quarterly, 38. 408--437.",
      "doi": ""
    },
    {
      "text": "Barley, S. R. and Kunda, G. Gurus, Hired Guns, and Warm Bodies: Itinerant experts in a knowledge economy. Princeton University Press, Princeton, NJ, 2004.",
      "doi": "10.5555/1206446"
    },
    {
      "text": "Barley, S. R., Meyerson, D. and Grodal, S. Email as a Symbol: A Sociomaterial Account of How Communication Technologies Produce Stress. Organization Science, 22 (4). 887--906.  ",
      "doi": "10.1287/orsc.1100.0573"
    },
    {
      "text": "Bass, B. L., Butler, A. B., Grzywacz, J. G. and Linney, K. D. Do Job Demands Undermine Parenting? A Daily Analysis of Spillover and Crossover Effects. Family Relations, 58. 201--215.",
      "doi": ""
    },
    {
      "text": "Castells, M. The Rise of the Network Society. Blackwell Publishers Ltd, 1996. ",
      "doi": "10.5555/524435"
    },
    {
      "text": "Charmaz, K. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Sage, London, 2006.",
      "doi": ""
    },
    {
      "text": "Chesley, N. Blurring Boundaries' Linking Technology Use, Spillover, Individual Distress, and Family Satisfaction. Journal of Marriage and Family, 67. 1237--1248.",
      "doi": ""
    },
    {
      "text": "Ciulla, J. B. The Working Life: The promise and betrayal of modern work. Three Rivers Press, Random House, NY, NY, 2000.",
      "doi": ""
    },
    {
      "text": "Coser, L. A. Greedy institutions; patterns of undivided commitment. Free Press, 1974.",
      "doi": ""
    },
    {
      "text": "Cotte, J. and Ratneshwar, S. Juggling and hopping: what does it mean to work polychronically? Journal of Managerial Psychology, 14 (3/4). 184--205.",
      "doi": ""
    },
    {
      "text": "Dembe, A. E. Ethical Issues Relating to the Health Effects of Long Working Hours. Journal of Business Ethics, 84 (2). 195--208.",
      "doi": ""
    },
    {
      "text": "Dourish, P., Anderson, K. and Nafus, D., Cultural Mobilities: Diversity and Agency in Urban Computing. in IFIP Conf. Human-Computer Interaction, (Rio de Janeiro, Brazil, 2007). ",
      "doi": "10.5555/1778331.1778342"
    },
    {
      "text": "Dourish, P. and Bell, G. Divining A Digital Future: Mess and Mythology in Ubiquitous Computing. The MIT Press, 2011. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Edwards, P. N. and Wajcman, J. The politics of working life, Oxford, 2005.",
      "doi": ""
    },
    {
      "text": "Elsbach, K. D., Cable, D. M. and Sherman, J. W. How passive 'face time' affects perceptions of employees: Evidence of spontaneous trait inference. Human Relations, 63 (6). 735--760.",
      "doi": ""
    },
    {
      "text": "Evans, J. A., Kunda, G. and Barley, S. R. Beach Time, Bridge Time, and Billable Hours: The Temporal Structure of Technical Contracting. Administrative Science Quarterly, 49. 1--38.",
      "doi": ""
    },
    {
      "text": "Fassel, D. Working Ourselves to Death: The high cost of workaholicism and the rewards of recovery. Harper Collins, New York, NY, 1990.",
      "doi": ""
    },
    {
      "text": "Fraser, J. A. White Collar Sweat-Shop: The Deterioration of Work and its Rewards in Corporate America. W. W. Norton & Co, NY, New York, 2001.",
      "doi": ""
    },
    {
      "text": "Fuller, J. A., Stanton, J. M., Fisher, G. G., Spitzmüller, C., Russell, S. S. and Smith, P. C. A Lengthy Look at the Daily Grind: Time Series Analysis of Events, Mood, Stress and Satisfaction. Journal of Applied Psychology, 88 (6). 1019--1033.",
      "doi": ""
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Anchor Books, Doubleday, New York, NY, 1959.",
      "doi": ""
    },
    {
      "text": "Golden, L. A Brief History of Long Work Time and the Contemporary Sources of Overwork. Journal of Business Ethics, 84 (2). 217--227.",
      "doi": ""
    },
    {
      "text": "Golden, L. and Altman, M. Why do people overwork? Oversupply of Hours and Labor, Labor Market Forces and Adaptive Preferences. in Burke, R. J. and Cooper, C. L. eds. The Long Work Hours Culture: Causes, Consequences and Choices, Emerald Group Publishing Ltd., Bingley, UK, 2008, 61--84.",
      "doi": ""
    },
    {
      "text": "Gonzalez, V. M. and Mark, G., Constant, Constant, Multi-tasking Craziness: Managing Multiple Working Spheres. in SIGCHI Conference on Human Factors in Computing Systems, (Vienna, Austria., 2004), 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Greenhaus, J. H., Allen, T. D. and Spector, P. E. Health Consequences of Work-Family Conflict: The Dark Side of the Work - Family Interface. in Perrewé, P. and Ganster, D. eds. Research in Occupational Stress and Well-being, Emerald Group Publishing Limited, 2006.",
      "doi": ""
    },
    {
      "text": "Harr, R. and Kaptelinin, V., Unpacking the social dimension of external interruptions. in International ACM conference on Supporting group work, (2007), 399--408.  ",
      "doi": "10.1145/1316624.1316686"
    },
    {
      "text": "Hassan, R. Network Time and the New Knowledge Epoch. Time & Society, 12. 225--241.",
      "doi": ""
    },
    {
      "text": "Hincapié-Ramos, J. D., Voida, S. and Mark, G., A design space analysis of availability-sharing systems. in 24th annual ACM symposium on User interface software and technology, (2011), 85--96.  ",
      "doi": "10.1145/2047196.2047207"
    },
    {
      "text": "Hincapié-Ramos, J. D., Voida, S. and Mark, G., Sharing availability information with InterruptMe. in 13th international conference on Ubiquitous computing, (2011), 477--478.  ",
      "doi": "10.1145/2030112.2030179"
    },
    {
      "text": "Hörning, K. H., Ahrens, D. and Gerhard, A. Do Technologies Have Time? New practices of time and the transformation of communication technologies. Time & Society, 8 (2). 293--308.",
      "doi": ""
    },
    {
      "text": "Kanai, A. \"Karoshi (Work to Death)\" in Japan. Journal of Business Ethics, 84 (2). 209--216.",
      "doi": ""
    },
    {
      "text": "Kaufman, C. F., Lane, P. M. and Lindquist, J. D. Exploring More than 24 Hours a Day: A Preliminary Investigation of Polychronic Time Use. The Journal of Consumer Research, 18 (3). 392--401.",
      "doi": ""
    },
    {
      "text": "Kraft, J. C. Students at Stanford Work on Apps that Alleviate Stress The New York Times, 2012.",
      "doi": ""
    },
    {
      "text": "Kunda, G. Engineering Culture: Control and Commitment in a High-Tech Corporation. Temple University Press, Philadelphia, PA, (1992) 2006.",
      "doi": ""
    },
    {
      "text": "Lee, H. and Whitley, E. A. Time and Information Technology: Temporal Impacts on Individuals, Organizations, and Society. The Information Society, 18. 235--240.",
      "doi": ""
    },
    {
      "text": "Ljungberg, F. Exploring CSCW mechanisms to realize constant accessibility without inappropriate interaction. Scandinavian Journal of Information Systems, 11 (2). 115--135. ",
      "doi": "10.5555/350717.350746"
    },
    {
      "text": "Mark, G., Gonzalez, V. M. and Harris, J., No Task Left Behind? Examining the nature of fragmented work. in SIGCHI Conference on Human Factors in Computing Systems, (Portland, OR, 2005), 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Mark, G., Grudith, D. and Klocke, U. The Cost of Interrupted Work: More Speed and Stress. SIGCHI Conference on Human Factors in Computing Systems, Florence, Italy, 2008, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Mark, G., Voida, S. and Cardello, A. \"A Pace Not Dictated by Electrons\": An Empirical Study of Work Without Email CHI, ACM, Austin, TX, 2012.  ",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Mazmanian, M. Avoiding the trap of constant connectivity: When congruent frames allow for heterogeneous practices. Academy of Management Journal, 56 (5). 1225--1250.",
      "doi": ""
    },
    {
      "text": "Mazmanian, M. Predictable Time off? Leveraging personal needs to change the micro dynamics of teamwork U.C. Davis Qualitative Research Conference, Best Paper, Davis, CA, 2012.",
      "doi": ""
    },
    {
      "text": "Mazmanian, M., Orlikowski, W. J. and Yates, J. The Autonomy Paradox: The Implications of Mobile Email Devices for Knowledge Professionals. Organization Science, 24 (5). 1337--1357.",
      "doi": ""
    },
    {
      "text": "McMillan, L., H. W. and O'Driscoll, M. P. The Wellsprings of Workaholism: A Comparative Analysis of the Explanatory Theories. in Burke, R. J. and Cooper, C. L. eds. The Long Work Hours Culture: Causes, Consequences and Choices, Emerald Group Publishing Ltd., Bingley, UK, 2008, 85--114.",
      "doi": ""
    },
    {
      "text": "Michel, A. Transcending Socialization: A Nine-Year Ethnography of the Body's Role in Organizational Control and Knowledge Workers' Transformation. Administrative Science Quarterly, 56 (3). 325--368.",
      "doi": ""
    },
    {
      "text": "Murray, W. C. and Rostis, A. \"Who's Running the Machine?\" A theoretical exploration of work stress and burnout of technologically tethered workers. Journal of Employment Rights, 12 (3). 249--263.",
      "doi": ""
    },
    {
      "text": "Nardi, B. A., Whittaker, S. and Bradner, E., Interaction and Outeraction: Instant Messaging in Action. in CSCW Conference on Computer Supported Cooperative Work, (2000), 1--10.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Nelsen, B. J. and Barley, S. R. For Love or Money? Commodification and the Construction of an Occupational Mandate. Administrative Science Quarterly, 42 (4). 619--653.",
      "doi": ""
    },
    {
      "text": "Orlikowski, W. J. and Yates, J. It's About Time: Temporal Structuring in Organizations. Organization Science, 13 (6). 684--700.  ",
      "doi": "10.1287/orsc.13.6.684.501"
    },
    {
      "text": "Palmer, D. K. and Schoorman, F. D. Unpackaging the multiple aspects of time in polychronicity. Journal of Managerial Psychology, 14 (3/4). 323--345.",
      "doi": ""
    },
    {
      "text": "Pammer, V., Edler, S. and Stern, H., Visualising the fragmentation of knowledge work. in 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design, (2012), 779--780.  ",
      "doi": "10.1145/2399016.2399143"
    },
    {
      "text": "Perlow, L. A. Sleeping with Your Smartphone: How to Break the 24/7 Habit and Change the Way You Work. Harvard Business School Publishing, Boston, Massachussetts, 2012.",
      "doi": ""
    },
    {
      "text": "Perlow, L. A. and Porter, J. L. Making Time Off Predictable - and Required. Harvard Business Review, 84 (10).",
      "doi": ""
    },
    {
      "text": "Porter, G. and Kakabadse, N. K. HRM Perspectives on addiction to technology and work. Journal of Management Development, 25 (6). 535--560.",
      "doi": ""
    },
    {
      "text": "Prasopoulou, E., Pouloud, A. and Panteli, N. Enacting new temporal boundaries: the role of mobile phones European Journal of Information Systems 15. 277--284.",
      "doi": ""
    },
    {
      "text": "Schaufeli, W. B., Taris, T. W. and Bakker, A. B. It Takes Two to Tango: Workaholism is Working Excessively and Working Compulsively. in Burke, R. J. and Cooper, C. L. eds. The Long Work Hours Culture: Causes, Consequences and Choices, Emerald Group Publishing Ltd., Bingley, UK, 2008, 203--226.",
      "doi": ""
    },
    {
      "text": "Schor, J. The Overworked American: The unexpected decline of leisure, 1992.",
      "doi": ""
    },
    {
      "text": "Semaan, B. and Mark, G. Technology-mediated social arrangements to resolve breakdowns in infrastructure during ongoing disruption. ACM Transactions on Computer Human Interaction, 18 (4). 21:21--21:21.  ",
      "doi": "10.1145/2063231.2063235"
    },
    {
      "text": "Sengers, P. What I Learned on Change Islands: Reflections on IT and pace of life. Interactions, 18 (2). 40--48.  ",
      "doi": "10.1145/1925820.1925830"
    },
    {
      "text": "Sengers, P., Boehner, K., David, S. and Kaye, J. J., Reflective Design. in Critical Computing, (Århus, Denmark, 2005), ACM, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Sennett, R. The Corrosion of Character: The Personal Consequences of Work in the New Capitalism. W. W. Norton & Co., New York, NY, 1998.",
      "doi": ""
    },
    {
      "text": "Smith, M. R. and Marx, L. (eds.). Does technology drive history? The dilemma of technological determinism. MIT Press, Cambridge, MA, 1994.",
      "doi": ""
    },
    {
      "text": "Starwarz, K., Cox, A. L., Bird, J. and Benedyk, R. \"I'd sit at home and do work emails\": how tablets affect the work-life balance of office workers CHI '13 Extended Abstracts on Human Factors in Computing Systems, 2013, 1383--1388.  ",
      "doi": "10.1145/2468356.2468603"
    },
    {
      "text": "Strauss, A. and Corbin, J. M. Basics of Qualitative Reserach: Techniques and Procedures for Developing Grounded Theory. Sage Publications Inc., 1998.",
      "doi": ""
    },
    {
      "text": "Tarafdar, M., Tu, Q., Ragu-Nathan, B. S. and RaguNathan, T. S. Crossing to the dark side: examining creators, outcomes, and inhibitors of technostress. Communications of the ACM, 54 (9). 113--120.  ",
      "doi": "10.1145/1995376.1995403"
    },
    {
      "text": "Thompson, J. B. The Media and Modernity: A social theory of the media. The Stanford University Press, Stanford, California, 1995.",
      "doi": ""
    },
    {
      "text": "Tomlinson, J. The Culture of Speed: The Coming of Immediacy. Sage, London, 2007.",
      "doi": ""
    },
    {
      "text": "Towers, I., Duxbury, L., Higgins, C. and Thomas, J. Time thieves and space invaders: technology, work and the organization. Journal of Organizational Change Management, 19 (5). 593--618.",
      "doi": ""
    },
    {
      "text": "Turel, O., Serenko, A. and Bontis, N., Blackberry Addiction: Symptoms and Outcomes in Proceedings of the Fourteenth Americas Conference on Information Systems, (Toronto, ON, Canada, 2008).",
      "doi": ""
    },
    {
      "text": "Wajcman, J. Life in the fast lane? Towards a sociology of technology and time The British Journal of Sociology, 59 (1). 59--77.",
      "doi": ""
    },
    {
      "text": "Wajcman, J. and Rose, E. Constant Connectivity: Rethinking Interruptions at Work. Organization Studies, 32 (7). 941--961.",
      "doi": ""
    },
    {
      "text": "Wiberg, M. and Whitaker, S. Managing Availability: Supporting Lightweight Negotiations to Handle Interruptions. ACM Transactions on Computer-Human Interaction, 12 (4). 356--387.  ",
      "doi": "10.1145/1121112.1121114"
    },
    {
      "text": "Wright, T. A., Cropanzano, R., Bonett, D. G. and Diamond, W. J. The role of employee psychological wellbeing in cardiovascular health: when the twain shall meet. Journal of Organizational Behavior, 30. 193--208.",
      "doi": ""
    },
    {
      "text": "Zerubavel, E. The Standardization of Time: A Sociohistorical Perspective. The American Journal of Sociology, 88 (1). 1--23.",
      "doi": ""
    }
  ]
}