{
  "doi": "10.1145/2556288.2557282",
  "title": "Quantitative measurement of virtual vs. physical object embodiment through kinesthetic figural after effects",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2903-2912",
  "year": 2014,
  "badges": [],
  "abstract": "Over the past decade, multi-touch surfaces have become commonplace, with many researchers and practitioners describing the benefits of their natural, physical-like interactions. We present a pair of studies that empirically investigates the psychophysical effects of direct interaction with both physical and virtual artefacts. We use the phenomenon of Kinesthetic Figural After Effects-a change in understanding of the physical size of an object after a period of exposure to an object of different size. Our studies show that, while this effect is robustly reproducible when using physical artefacts, this same effect does not manifest when manipulating virtual artefacts on a direct, multi-touch tabletop display. We contribute quantitative evidence suggesting a psychophysical difference in our response to physical vs. virtual objects, and discuss future research directions to explore measurable phenomena to evaluate the presence of physical-like changes from virtual on-screen objects.",
  "tags": [
    "tangible user interfaces",
    "tabletop displays",
    "physical interaction",
    "multi-touch",
    "embodied interaction"
  ],
  "authors": [
    {
      "name": "Ayman Alzayat",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-87958762457/rel-imgonly/20141117_145743.jpg",
      "acmid": "87958762457",
      "orcid": "missing"
    },
    {
      "name": "Mark Hancock",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100211996/rel-imgonly/acm.jpg",
      "acmid": "81100211996",
      "orcid": "missing"
    },
    {
      "name": "Miguel Nacenta",
      "institution": "University of St Andrews, St Andrews, United Kingdom",
      "img": "/do/10.1145/contrib-81100377766/rel-imgonly/dsc_7149-small.png",
      "acmid": "81100377766",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arzy, S., Thut, G., Mohr, C., Michel, C.M., and Blanke, O. Neural basis of embodiment: distinct contributions of temporoparietal junction and extrastriate body area. Journal of Neuroscience 26, 31 (2006), 8074--8081.",
      "doi": ""
    },
    {
      "text": "Benford, S., Browers, J., Fahlen, E.L., Greenhalgh, C., Snowdon, D. User embodiment in collaborative virtual environments. In Proc. CHI, ACM Press (1995), 242249.  ",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Benko, H., Harrison, C., Wilson, A.D. OmniTouch: Wearable Multitouch Interaction Everywhere. In Proc. UIST, ACM Press (2011), 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Botvinick, M. & Cohen, J. Rubber hands 'feel' touch that eyes see. Nature 391, 6669 (1998), 756.",
      "doi": ""
    },
    {
      "text": "Brozzoli, C., Cardinali L., Pavani F., and Farnè A. Action-specific remapping of peripersonal space. Neuropsychologia 48, 3 (2010), 796--802.",
      "doi": ""
    },
    {
      "text": "Buxton, B., Multi-touch Systems that I Have Known and Loved. http://www.billbuxton.com/multitouchOverview.html. Original: 2007. Last retrieved: Jan 2014.",
      "doi": ""
    },
    {
      "text": "Cardinali, L., Frassinetti, F., Brozzoli, C., Urquizar, C., Roy, A. C., Farnè, A. Tool-use induces morphological updating of the body schema. Current Biology 19, 12 (2009), R478--R479.",
      "doi": ""
    },
    {
      "text": "Churchill, A.V. Quantitative Tactual-Kinesthetic Judgment. Perceptual and Motor Skills 20 (1965), 1147--1148.",
      "doi": ""
    },
    {
      "text": "Coyle, D., Moore, J. Kristensson, P.O., Fletcher, P.C., Blackwell, A.F. I did that! Measuring Users-Experience of Agency in their own Actions. In Proc. CHI'12.  ",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Dourish, P. Where the Action Is: The Foundations of Embodied Interaction. MIT Press, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Durgin, F.H., Evans, L., Dunphy, N., Klostermann, S., Simmons, K. Rubber hands feel the touch of light. Psychological Science 18, 2 (2007), 152--157.",
      "doi": ""
    },
    {
      "text": "Gibson, J. J. The visual perception of objective motion and subjective movement. Psychol. Rev 61 (1954), 304--314.",
      "doi": ""
    },
    {
      "text": "Gibson, J. J., & Backlund, F. An aftereffect in haptic space perception. Quart. J. Exp. Psychol, (1963).",
      "doi": ""
    },
    {
      "text": "Gibson, J. J. The perception of visual surfaces. Amer. J. Psychol, 43 (1950), 367--384.",
      "doi": ""
    },
    {
      "text": "Hancock, M., Cate, T.T., and Carpendale, S. Sticky tools: Full 6DOF force-based interaction for multi-touch tables. In Proc. ITS, ACM Press (2009), 133--140.  ",
      "doi": "10.1145/1731903.1731930"
    },
    {
      "text": "Heinemann, E.G. Figural after effects in kinesthesis: Effects of object width and repeated presentations. Journal of Experimental Psychology 61, 1 (1961), 51--56.",
      "doi": ""
    },
    {
      "text": "Holmes, N.P. and Spence, C. Beyond the body schema: Visual, prosthetic, and technological contributions tobodily perception and awareness. Human body perception from the inside out, (2006), 15--64.",
      "doi": ""
    },
    {
      "text": "Ishii, H., Lakatos, D., Bonanni, L., Labrune, J.B. Radical atoms: beyond tangible bits, toward transformable materials. Interactions 19 (2012), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Jordà, S., Geiger, G. Alonso, M., Kaltenbrunner, M., The reacTable: exploring the synergy between live music performance and tabletop tangible interfaces. In Proc. TEI, ACM Press (2007), 139--146.  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Kelvin, R. P. Discrimination of size by sight and touch. Quart. J. exp. Psychol 69, 6 (1954), 23--34.",
      "doi": ""
    },
    {
      "text": "Kidd, A.H., Beere, D.B. Relationship between kinaesthetic figural aftereffect and certain personality variables. Perceptual and Motor Skills 26 (1968) 577--587.",
      "doi": ""
    },
    {
      "text": "Kohler, W., and Dinnerstein, D. Figural after-effects in kinaesthesis. Miscellanea psychologica Albert Michotte. Louvain: Editions de 1'Institut Superieur de Philosophie, (1949), 196--220.",
      "doi": ""
    },
    {
      "text": "Leap Motion. http://www.leapmotion.com. Last retrieved: Jan 2014.",
      "doi": ""
    },
    {
      "text": "Maravita, A. and Iriki, A. Tools for the body (schema). TRENDS in Cognitive Sciences 8, 2 (2004), 79--86.",
      "doi": ""
    },
    {
      "text": "Marino, B., Stucchi, N., Nava, E., Haggard, P., and Maravita, A. Distorting the visual size of the hand affects hand pre-shaping during grasping. Experimental Brain Research 202, 2 (2010), 499--505.",
      "doi": ""
    },
    {
      "text": "McDonnell, P.M., Scott, R.N., Dickison, J., Theriault, R.A., Wood, B. Do artificial limbs become part of the user? New evidence. Journal of Rehabilitation Research and Development 26, 2 (1989), 17--24.",
      "doi": ""
    },
    {
      "text": "Nacenta, M.A., Pinelle, D., Gutwin, C., Mandryk, R. Individual and group support in tabletop interaction techniques. In Tabletops -- Horizontal Interactive Displays, C. Müller-Tomfelde, Ed. Springer (2010), 303--333.",
      "doi": ""
    },
    {
      "text": "Patel, H. and Morreale, P. 2014. Education and learning: electronic books or traditional printed books? J. Comput. Sci. Coll. 29, 3 (2014), 21--28. ",
      "doi": "10.5555/2544322.2544328"
    },
    {
      "text": "Petrie, A. Individuality in pain and suffering (2nd ed.). U. Chicago Press, 1978, 107--127.",
      "doi": ""
    },
    {
      "text": "Phelan J.G, Brooks R., Brashears G.C. Relationship of kinesthetic figural aftereffect to masculinity-femininity and expectation for internal versus external control of reinforcement. Perceptual and Motor Skills 31 (1970), 863--866.",
      "doi": ""
    },
    {
      "text": "Platt, D., Holzman, P.S., Larson, D. Individual consistencies in kinesthetic figural aftereffects. Perceptual and Motor Skills 32 (1971), 787--795.",
      "doi": ""
    },
    {
      "text": "Polanyi, M. The tacit dimension. Anchor Books, Garden City, N.Y, 1966.",
      "doi": ""
    },
    {
      "text": "Processing. http://processing.org. Last retrieved: Jan 2014.",
      "doi": ""
    },
    {
      "text": "Reactable Systems S.L., Reactable Mobile. http://reactable.com/products/mobile/. Last retrieved: Jan 2014.",
      "doi": ""
    },
    {
      "text": "Sheridan, T.B. Further musings on the psychophysics of presence. Systems, Man, and Cybernetics 2 (1994), 1073--1077.",
      "doi": ""
    },
    {
      "text": "Tang, A., Neustaedter, C., Greenberg, S. VideoArms: Embodiments for mixed presence groupware. In People and Computers XX -- Engage, N. Bryann-Kinns, A. Blanford, P. Curzon, L. Nigay, Eds., Springer (2010), 85--102.",
      "doi": ""
    },
    {
      "text": "Ullmer, B., Ishii, H. Emerging frameworks for tangible user interfaces. IBM Systems Journal 39 (2000), 915--931.  ",
      "doi": "10.1147/sj.393.0915"
    },
    {
      "text": "de Vignemont, F. Embodiment, ownership and disownership. Consciousness and Cognition 20 (2010), 82--93.",
      "doi": ""
    },
    {
      "text": "Welch, R.B. and Warren, D.H. Immediate perceptual response to intersensory discrepancy. Psychological Bulletin 88, 3 (1980), 638--667.",
      "doi": ""
    }
  ]
}