{
  "doi": "10.1145/2556288.2557069",
  "title": "Choice-based preference elicitation for collaborative filtering recommender systems",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3085-3094",
  "year": 2014,
  "badges": [],
  "abstract": "We present an approach to interactive recommending that combines the advantages of algorithmic techniques with the benefits of user-controlled, interactive exploration in a novel manner. The method extracts latent factors from a matrix of user rating data as commonly used in Collaborative Filtering, and generates dialogs in which the user iteratively chooses between two sets of sample items. Samples are chosen by the system for low and high values of each latent factor considered. The method positions the user in the latent factor space with few interaction steps, and finally selects items near the user position as recommendations. In a user study, we compare the system with three alternative approaches including manual search and automatic recommending. The results show significant advantages of our approach over the three competing alternatives in 15 out of 24 possible parameter comparisons, in particular with respect to item fit, interaction effort and user control. The findings corroborate our assumption that the proposed method achieves a good trade-off between automated and interactive functions in recommender systems.",
  "authors": [
    {
      "name": "Benedikt Loepp",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/do/10.1145/contrib-87958660357/rel-imgonly/benedikt_loepp.jpg",
      "acmid": "87958660357",
      "orcid": "missing"
    },
    {
      "name": "Tim Hussein",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456611765",
      "orcid": "missing"
    },
    {
      "name": "Jüergen Ziegler",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100445374",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amatriain, X., Pujol, J. M., Tintarev, N., and Oliver, N. Rate it again: Increasing recommendation accuracy by user re-rating. In Proc. RecSys 2009, ACM (2009), 173--180.  ",
      "doi": "10.1145/1639714.1639744"
    },
    {
      "text": "Bell, R. M., Koren, Y., and Volinsky, C. Modeling relationships at multiple scales to improve accuracy of large recommender systems. In Proc. KDD 2007, ACM (2007), 95--104.  ",
      "doi": "10.1145/1281192.1281206"
    },
    {
      "text": "Bennett, J., and Lanning, S. The netflix prize. In Proc. KDD Cup and Workshop 2007, ACM (2007), 3--6.",
      "doi": ""
    },
    {
      "text": "Bostandjiev, S., O'Donovan, J., and Höllerer, T. TasteWeights: A visual interactive hybrid recommender system. In Proc. RecSys 2012, ACM (2012), 35--42.  ",
      "doi": "10.1145/2365952.2365964"
    },
    {
      "text": "Cantador, I., Brusilovsky, P., and Kuflik, T. 2nd workshop on information heterogeneity and fusion in recommender systems (HetRec 2011). In Proc. RecSys 2011, ACM (2011).  ",
      "doi": "10.1145/2043932.2044016"
    },
    {
      "text": "Chen, L., and Pu, P. Critiquing-based recommenders: Survey and emerging trends. User Modeling and UserAdapted Interaction 22, 1--2 (2012), 125--150.  ",
      "doi": "10.1007/s11257-011-9108-6"
    },
    {
      "text": "Chi, E. H. Transient user profiling. In Proc. Workshop on User Profiling (2004), 521--523.",
      "doi": ""
    },
    {
      "text": "Davidson, J., Liebald, B., Liu, J., Nandy, P., van Vleet, T., Gargi, U., Gupta, S., He, Y., Lambert, M., Livingston, B., and Sampath, D. The YouTube video recommendation system. In Proc. RecSys 2010, ACM (2010), 293--296.  ",
      "doi": "10.1145/1864708.1864770"
    },
    {
      "text": "Feuerverger, A., He, Y., and Khatri, S. Statistical significance of the netflix challenge. Statistical Science 27, 2 (2012), 202--231.",
      "doi": ""
    },
    {
      "text": "Gantner, Z., Rendle, S., Freudenthaler, C., and Schmidt-Thieme, L. MyMediaLite: A free recommender system library. In Proc. RecSys 2011, ACM (2011), 305--308.  ",
      "doi": "10.1145/2043932.2043989"
    },
    {
      "text": "Ge, M., Delgado-Battenfeld, C., and Jannach, D. Beyond accuracy: Evaluating recommender systems by coverage and serendipity. In Proc. RecSys 2010, ACM (2010), 257--260.  ",
      "doi": "10.1145/1864708.1864761"
    },
    {
      "text": "Green, P. E., and Srinivasan, V. Conjoint analysis in consumer research: Issues and outlook. Journal of Consumer Research 5, 2 (1978), 103--123.",
      "doi": ""
    },
    {
      "text": "Gretarsson, B., O'Donovan, J., Bostandjiev, S., Hall, C., and Höllerer, T. SmallWorlds: Visualizing social recommendations. Computer Graphics Forum 29, 3 (2010), 833--842.  ",
      "doi": "10.1111/j.1467-8659.2009.01679.x"
    },
    {
      "text": "Herlocker, J. L., Konstan, J. A., Terveen, L. G., and Riedl, J. Evaluating collaborative filtering recommender systems. ACM Transactions on Information Systems 22, 1 (2004), 5--53.  ",
      "doi": "10.1145/963770.963772"
    },
    {
      "text": "Iacobelli, F., Birnbaum, L., and Hammond, K. J. Tell me more, not just more of the same. In Proc. IUI 2010, ACM (2010), 81--90.  ",
      "doi": "10.1145/1719970.1719982"
    },
    {
      "text": "Jones, N., Brun, A., and Boyer, A. Comparison instead of ratings: Towards more stable preferences. In Proc. WI-IAT 2011, IEEE (2011), 451--456.  ",
      "doi": "10.1109/WI-IAT.2011.13"
    },
    {
      "text": "Karimi, R., Freudenthaler, C., Nanopoulos, A., and Schmidt-Thieme, L. Exploiting the characteristics of matrix factorization for active learning in recommender systems. In Proc. RecSys 2012, ACM (2012), 317--320.  ",
      "doi": "10.1145/2365952.2366031"
    },
    {
      "text": "Konstan, J. A., and Riedl, J. Recommender systems: From algorithms to user experience. User Modeling and User-Adapted Interaction 22, 1--2 (2012), 101--123.  ",
      "doi": "10.1007/s11257-011-9112-x"
    },
    {
      "text": "Koren, Y., Bell, R. M., and Volinsky, C. Matrix factorization techniques for recommender systems. IEEE Computer 42, 8 (2009), 30--37.  ",
      "doi": "10.1109/MC.2009.263"
    },
    {
      "text": "Linden, G., Smith, B., and York, J. Amazon.com recommendations: Item-to-item collaborative filtering. IEEE Internet Computing 7, 1 (2003), 76--80.  ",
      "doi": "10.1109/MIC.2003.1167344"
    },
    {
      "text": "Mahmood, T., and Ricci, F. Improving recommender systems with adaptive conversational strategies. In Proc. HT 2009, ACM (2009), 73--82.  ",
      "doi": "10.1145/1557914.1557930"
    },
    {
      "text": "McNee, S., Riedl, J., and Konstan, J. A. Being accurate is not enough: How accuracy metrics have hurt recommender systems. In Ext. Abstracts CHI 2006, ACM (2006), 1097--1101.  ",
      "doi": "10.1145/1125451.1125659"
    },
    {
      "text": "Pariser, E. The Filter Bubble: What the Internet is Hiding From You. Penguin Press, 2011. ",
      "doi": "10.5555/2029079"
    },
    {
      "text": "Pu, P., Chen, L., and Hu, R. Evaluating recommender systems from the users perspective: Survey of the state of the art. User Modeling and User-Adapted Interaction 22, 4--5 (2012), 317--355.  ",
      "doi": "10.1007/s11257-011-9115-7"
    },
    {
      "text": "Ricci, F., Rokach, L., and Shapira, B. Recommender Systems Handbook. Springer, 2010, ch. Introduction to Recommender Systems Handbook, 1--35.",
      "doi": "10.5555/1941884"
    },
    {
      "text": "Salton, G., and Buckley, C. Improving retrieval performance by relevance feedback. In Readings in Information Retrieval. Morgan Kaufmann, 1997, 355--364. ",
      "doi": "10.5555/275537.275712"
    },
    {
      "text": "Senecal, S., and Nantel, J. The influence of online product recommendations on consumers online choices. Journal of Retailing 80, 2 (2004), 159--169.",
      "doi": ""
    },
    {
      "text": "Sinha, R., and Swearingen, K. The role of transparency in recommender systems. In Ext. Abstracts CHI 2002, ACM (2002), 830--831.  ",
      "doi": "10.1145/506443.506619"
    },
    {
      "text": "Su, X., and Khoshgoftaar, T. M. A survey of collaborative filtering techniques. Advances in Artificial Intelligence 2009 (2009), 1--19.  ",
      "doi": "10.1155/2009/421425"
    },
    {
      "text": "Tintarev, N., and Masthoff, J. Recommender Systems Handbook. Springer, 2010, ch. Designing and Evaluating Explanations for Recommender Systems, 479--510.",
      "doi": ""
    },
    {
      "text": "Vargas, S., and Castells, P. Rank and relevance in novelty and diversity metrics for recommender systems. In Proc. RecSys 2011, ACM (2011), 109--116.  ",
      "doi": "10.1145/2043932.2043955"
    },
    {
      "text": "Vig, J., Sen, S., and Riedl, J. Navigating the tag genome. In Proc. IUI 2011, ACM (2011), 93--102.  ",
      "doi": "10.1145/1943403.1943418"
    },
    {
      "text": "Xiao, B., and Benbasat, I. E-commerce product recommendation agents: Use, characteristics, and impact. MIS Quarterly 31, 1 (2007), 137--209. ",
      "doi": "10.5555/2017327.2017335"
    },
    {
      "text": "Zhao, X., Zhang, W., and Wang, J. Interactive collaborative filtering. In Proc. CIKM 2013, ACM (2013), 1411--1420.  ",
      "doi": "10.1145/2505515.2505690"
    },
    {
      "text": "Zhou, K, Yang, S.-H., and Zha, H. Functional matrix factorizations for cold-start recommendation. In Proc. SIGIR 2011, ACM (2011), 315--324.  ",
      "doi": "10.1145/2009916.2009961"
    }
  ]
}