{
  "doi": "10.1145/2556288.2557376",
  "title": "Protibadi: A platform for fighting sexual harassment in urban Bangladesh",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2695-2704",
  "year": 2014,
  "badges": [],
  "abstract": "Public sexual harassment has emerged as a large and growing concern in urban Bangladesh, with deep and damaging implications for gender security, justice, and rights of public participation. In this paper we describe an integrated program of ethnographic and design work meant to understand and address such problems. For one year we conducted surveys, interviews, and focus groups around sexual harassment with women at three different universities in Dhaka. Based on this input, we developed \"Protibadi\", a web and mobile phone based application designed to report, map, and share women's stories around sexual harassment in public places. In August 2013 the system launched, user studies were conducted, and public responses were monitored to gauge reactions, strengths, and limits of the system. This paper describes the findings of our ethnographic and design-based work, and suggests lessons relevant to other HCI efforts to understand and design around difficult and culturally sensitive problems.",
  "tags": [
    "design",
    "postcolonial computing",
    "hci4d",
    "ictd",
    "ethnography",
    "bangladesh",
    "sexual harassment"
  ],
  "authors": [
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "Cornell University, Ithca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    },
    {
      "name": "Steven J. Jackson",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100096023",
      "orcid": "0000-0002-4426-1320"
    },
    {
      "name": "Nova Ahmed",
      "institution": "North South University, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958813457",
      "orcid": "0000-0002-7715-1742"
    },
    {
      "name": "Hasan Shahid Ferdous",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659428894",
      "orcid": "0000-0002-2439-2462"
    },
    {
      "name": "Md. Rashidujjaman Rifat",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958779157",
      "orcid": "missing"
    },
    {
      "name": "A.S.M Rizvi",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959234257",
      "orcid": "missing"
    },
    {
      "name": "Shamir Ahmed",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659833018",
      "orcid": "missing"
    },
    {
      "name": "Rifat Sabbir Mansur",
      "institution": "Bangladesh University of Engineering and Technology, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660185240",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alam N, Roy S. K., Ahmed T., Sexually harassing behavior against adolescent girls in rural Bangladesh: implications for achieving millennium development goals. Interpersonal Violence; 25(3), 443--56, 2010.",
      "doi": ""
    },
    {
      "text": "Bangladesh telecommunication Regulatory Commission Report, 2013.",
      "doi": ""
    },
    {
      "text": "Bardzell, S. Feminist HCI: taking stock and outlining an agenda for design. In Proc. CHI '10, pp. 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Bowman, C, L. A. Rudman, Street harassment and the informal ghettoization of women, Harvard Law Review, 106(3), 517--580, 1993.",
      "doi": ""
    },
    {
      "text": "Brewer, E., Demmer, M., Du, B., Ho, M., Kam, M., Nedevschi, S., Pal, J., Patra, R., Surana, S., Fall, K. The case for technology in developing regions, Computer, 38(6), 25--38, 2005.  ",
      "doi": "10.1109/MC.2005.204"
    },
    {
      "text": "Clarke, R., Wright, P., Balaam, M., & McCarthy, J. (2013, April). Digital portraits: photo-sharing after domestic violence. In Proc. CHI '13, pp. 2517--2526.  ",
      "doi": "10.1145/2470654.2481348"
    },
    {
      "text": "Circleof6 website: http://www.circleof6app.com/",
      "doi": ""
    },
    {
      "text": "ComfortZone Checkin: http://www.comfortzonecheckin.com/",
      "doi": ""
    },
    {
      "text": "DeRenzi, B., Lesh, N., Parikh, T., Sims, C., Mitchell, M., Maokola, W., Chemba, M., Hamisi, Y., Schellenbe, D., Borriello, G. e-IMCI: Improving Pediatric Health Care in Low-Income Countries. In Proc. CHI '08, pp. 753--762.  ",
      "doi": "10.1145/1357054.1357174"
    },
    {
      "text": "DiSalvo, C. Adversarial Design, MIT Press, 2012. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Fairchild, K. M., Rudman, L. A., \"Everyday stranger harassment and women's objectification\", Social Justice Research, 21(3), 338--357, 2008.",
      "doi": ""
    },
    {
      "text": "Fightback App: http://www.comfortzonecheckin.com/",
      "doi": ""
    },
    {
      "text": "Hasan, O. \"Street Harassment is Still Serious: The violation of women in Dhaka's public realm\". The Daily Star, Forum, 5:11, 2011.",
      "doi": ""
    },
    {
      "text": "Harassmap website: http://harassmap.org/en/",
      "doi": ""
    },
    {
      "text": "Haque, M., Kawsar, F., Adibuzzaman, M., Ahamed, S., Love, R., Dowla, R., Roe, D., Hossain, S., and Selim S. Findings of e-ESAS: a mobile based symptom monitoring system for breast cancer patients in rural Bangladesh. In Proc. CHI '12, pp. 899--908.  ",
      "doi": "10.1145/2207676.2208532"
    },
    {
      "text": "Hollaback! website: http://www.ihollaback.org/",
      "doi": ""
    },
    {
      "text": "Irani, L., Vertesi, J., Dourish, P., Philip, K., and Grinter, B. 2010. Postcolonial Computing: A Lens on Design and Development. In Proc. CHI '10, pp. 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Kannabiran, G., Bardzell, J., and Bardzell, S. How HCI talks about sexuality: discursive strategies, blind spots, and opportunities for future research. In Proc. CHI '10, pp. 695--704.  ",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Lahsaeizadeh, A., and Yousefinejad, E., Social Aspects of Women's Experiences of Sexual Harassment in Public Places in Iran, Sexuality & Culture (16), 17--37, 2012.",
      "doi": ""
    },
    {
      "text": "Luk, R., Ho, M., and Aoki, M. P. Asynchronous remote medical consultation for Ghana. In Proc. CHI '08, pp. 743--752.  ",
      "doi": "10.1145/1357054.1357173"
    },
    {
      "text": "Madu, C. N. Transferring technology to developing countries - Critical factors for success, Long Range Planning, 22(4), 115--124, 1989.",
      "doi": ""
    },
    {
      "text": "Marcus, A. and Gould, E. W. Crosscurrents: cultural dimensions and global Web user-interface design. Interactions 7(4), 32--46, 2000.  ",
      "doi": "10.1145/345190.345238"
    },
    {
      "text": "Mitchell, M., Lesh, N., Crammer, H., Fraser, H., Haivas, I. Wolf, K. Improving Care - Improving Access: The Use of Electronic Decision Support with AIDS patients in South Africa. Intl. J. of Healthcare Technology and Management. 10(3), 156--168, 2009.",
      "doi": ""
    },
    {
      "text": "Nahar, P., Reeuwijk, M., and Reis, R., Contextualising sexual harassment of adolescent girls in Bangladesh. Reproductive Health Matters, 21(41), 78--86, 2013.",
      "doi": ""
    },
    {
      "text": "OnWatch website: http://www.onwatchoncampus.com/",
      "doi": ""
    },
    {
      "text": "Patel, N., Shah, K., Savani, S., R. Klemmer, P. Dave, and T. S. Parikh. Power to the peers: authority of source effects for a voice-based agricultural information service in rural India. In Proc. ICTD '12, pp. 169--178.  ",
      "doi": "10.1145/2160673.2160696"
    },
    {
      "text": "Patel, N., Chittamuru, D., Jain, A., Dave, P., and Parikh, T. 2010. Avaaj Otalo: a field study of an interactive voice forum for small farmers in rural India. In Proc. CHI '10, 733--742.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Pryor, J. B., Giedd, J. L., and Williams, K. B. A social psychological model for predicting sexual harassment. Journal of Social Issues, 51(1), 1995.",
      "doi": ""
    },
    {
      "text": "Richard, H. Sexism, sexual harassment and sexual assault: Toward conceptual clarity. Report submitted to Defense Equal Opportunity Management Institute, 2007.",
      "doi": ""
    },
    {
      "text": "Safetipin App: http://safetipin.com/",
      "doi": ""
    },
    {
      "text": "Sambasivan, N., Weber, J., and Cutrell, E. Designing a phone broadcasting system for urban sex workers in India. In Proc. CHI '11, pp. 267--276.  ",
      "doi": "10.1145/1978942.1978980"
    },
    {
      "text": "Sambasivan, N., Cutrell, E., Toyama, K., and Nardi. Intermediated technology use in developing communities. In Proc. CHI '10, pp. 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Satchell, C., and Foth, M. Welcome to the jungle: HCI after dark. In Proc. CHI '11, pp.753--762.  ",
      "doi": "10.1145/1979742.1979630"
    },
    {
      "text": "Satchell, C., and Foth. M. Fear and danger in nocturnal urban environments. In Proc. CHI '10, pp. 380--383.  ",
      "doi": "10.1145/1952222.1952308"
    },
    {
      "text": "Shimira, K., Mukasa, O., Schellenberg, A. J., Manzi, F., John, D., Mushi, A., Mrisho, M., Tanner, M., Mshinda, H., Schellenberg, D. The use of personal digital assistants for data entry at the point of collection in a large household survey in southern Tanzania. Emerging Themes in Epidemiology (2007), 4:5.",
      "doi": ""
    },
    {
      "text": "UNICEF Report: \"UNICEF supports efforts to end sexual harassment of girls and women in Bangladesh\", July 21, 2010.",
      "doi": ""
    },
    {
      "text": "Walker, L. E., Psychology and domestic violence around the world, American Psychologist, 54, 21--29, 1999.",
      "doi": ""
    },
    {
      "text": "William, O. Sexual harassment: Theory, research, and treatment. Allyn & Bacon, 1997.",
      "doi": ""
    },
    {
      "text": "Woelfer, J. P., Iverson, A., Hendry, D. G, Friedman, B., and Gill, B. Improving the safety of homeless young people with mobile phones: values, form and function. In Proc. CHI '11, pp. 1707--1716.  ",
      "doi": "10.1145/1978942.1979191"
    }
  ]
}