{
  "doi": "10.1145/2556288.2556966",
  "title": "Interactively stylizing camera motion",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2051-2054",
  "year": 2014,
  "badges": [],
  "abstract": "Movie directors and cinematographers impart style onto video using techniques that are learned through years of experience: camera movement, framing, color, lighting, etc. Without this experience and expensive equipment, it is very difficult to control stylistic aspects of a video. We introduce a novel approach for post-hoc editing of one specific aspect of cinematography -- camera motion style -- via an equalizer-like set of controls that manipulates the power spectra of a video's apparent motion path. We explore free manipulation of apparent camera motion as well as the transfer of motion styles from an example video to a new video to create a wide range of stylistic variations. We report on a user study confirming the ability of non-expert users to create motion styles.",
  "authors": [
    {
      "name": "Neel S. Joshi",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81330493210",
      "orcid": "missing"
    },
    {
      "name": "Dan Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81405594249/rel-imgonly/dan_bass_brightened.jpg",
      "acmid": "81405594249",
      "orcid": "missing"
    },
    {
      "name": "Michael F. Cohen",
      "institution": "Microsoft Research & University of Washington, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406592138",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dragicevic, P., Ramos, G., Bibliowitcz, J., Nowrouzezahrai, D., Balakrishnan, R., and Singh, K. Video browsing by direct manipulation. In Proceedings of CHI '08 (2008), 237--246.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Grundmann, M., Kwatra, V., and Essa, I. Auto-directed video stabilization with robust l1 optimal camera paths. In Proc IEEE CVPR 2011 (2011).  ",
      "doi": "10.1109/CVPR.2011.5995525"
    },
    {
      "text": "Hsu, E., Pulli, K., and Popovic, J. Style translation for human motion. ACM Trans. Graph. 24, 3 (July 2005), 1082--1089.  ",
      "doi": "10.1145/1073204.1073315"
    },
    {
      "text": "Neff, M., and Kim, Y. Interactive editing of motion style using drives and correlations. In Proceedings of the 2009 ACM SIGGRAPH/Eurographics SCA (2009).  ",
      "doi": "10.1145/1599470.1599484"
    }
  ]
}