{
  "doi": "10.1145/2556288.2557251",
  "title": "Designing for movement: evaluating computational models using LMA effort qualities",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "991-1000",
  "year": 2014,
  "badges": [],
  "abstract": "While single-accelerometers are a common consumer embedded sensors, their use in representing movement data as an intelligent resource remains scarce. Accelerometers have been used in movement recognition systems, but rarely to assess expressive qualities of movement. We present a prototype of wearable system for the real-time detection and classification of movement quality using acceleration data. The system applies Laban Movement Analysis (LMA) to recognize Laban Effort qualities from acceleration input using a Machine Learning software that generates classifications in real time. Existing LMA-recognition systems rely on motion capture data and video data, and can only be deployed in controlled settings. Our single-accelerometer system is portable and can be used under a wide range of environmental conditions. We evaluate the performance of the system, present two applications using the system in the digital arts and discuss future directions.",
  "tags": [
    "movement recognition",
    "movement-based interaction.",
    "laban effort analysis",
    "movement analysis"
  ],
  "authors": [
    {
      "name": "Diego Silang Maranan",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100583793",
      "orcid": "missing"
    },
    {
      "name": "Sarah Fdili Alaoui",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656800",
      "orcid": "0000-0003-1775-213X"
    },
    {
      "name": "Thecla Schiphorst",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409594757",
      "orcid": "missing"
    },
    {
      "name": "Philippe Pasquier",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81100317855/rel-imgonly/yourfrontalfacephoto.jpg",
      "acmid": "81100317855",
      "orcid": "missing"
    },
    {
      "name": "Pattarawut Subyen",
      "institution": "Simon Fraser University, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488670715",
      "orcid": "missing"
    },
    {
      "name": "Lyn Bartram",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100230578",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amstutz, R., Amft, O., French, B., Smailagic, A., Siewiorek, D., and Troster, G. Performance Analysis of an HMM-Based Gesture Recognition Using a Wristwatch Device. Proceedings of the International Conference on Computational Science and Engineering. (CSE), IEEE (2009), 303--309.  ",
      "doi": "10.1109/CSE.2009.58"
    },
    {
      "text": "Barakova, E.I. and Lourens, T. Expressing and interpreting emotional movements in social games with robots. Proceedings of the Personal Ubiquitous Comput. 14, 5 (2010), 457--467.  ",
      "doi": "10.1007/s00779-009-0263-2"
    },
    {
      "text": "Bartenieff, I. and Lewis, D. Body Movement: Coping with the Environment. Routledge, 1980.",
      "doi": ""
    },
    {
      "text": "Bergson, H. Matter and Memory. Zone Books, New York, 1988.",
      "doi": ""
    },
    {
      "text": "Bindiganavale, R.N. Building parameterized action representations from observation. Doctoral dissertation University of Pennsylvania Philadelphia, PA, USA, 2000. ",
      "doi": "10.5555/931865"
    },
    {
      "text": "Bott, J.N., Crowley, J.G., and LaViola,Jr., J.J. Exploring 3D gestural interfaces for music creation in video games. Proceedings of the 4th International Conference on Foundations of Digital Games, ACM (2009), 18--25.  ",
      "doi": "10.1145/1536513.1536527"
    },
    {
      "text": "Bouchard, D. and Badler, N. Semantic segmentation of motion capture using Laban Movement Analysis. Proceedings of the international conference o Intelligent Virtual Agents, Springer (2007), 37--44.  ",
      "doi": "10.1007/978-3-540-74997-4_4"
    },
    {
      "text": "Chi, D., Costa, M., Zhao, L., and Badler, N. The EMOTE model for Effort-Shape. Proceedings of the conference on computer graphics and interactive techniques, ACM (2000), 173--182.  ",
      "doi": "10.1145/344779.352172"
    },
    {
      "text": "Djajadiningrat, T., Matthews, B., and Stienstra, M. Easy doesn't do it: skill and expression in tangible aesthetics. Personal and Ubiquitous Computing 11, 8 (2007), 657676.  ",
      "doi": "10.1007/s00779-006-0137-9"
    },
    {
      "text": "Farella, E., O'Modhrain, S., Benini, L., and Riccó, B. Gesture Signature for Ambient Intelligence Applications: A Feasibility Study. In K.P. Fishkin, B. Schiele, P. Nixon and A. Quigley, eds., Pervasive Computing. Springer Berlin Heidelberg, 2006, 288--304.  ",
      "doi": "10.1007/11748625_18"
    },
    {
      "text": "Fdili Alaoui, S., Caramiaux, B., Serrano, M. and Bevilacqua, F., Dance Movement Quality as Interaction Modality. Proceedings of the International Conference on Designing Interactive Systems (DIS), ACM (2012) 761--769.  ",
      "doi": "10.1145/2317956.2318071"
    },
    {
      "text": "Hashim, W.N.W., Noor, N.L.M., and Adnan, W.A.W. The design of aesthetic interaction: towards a graceful interaction framework. Proceedings of the International Conference on Interaction Sciences: Information Technology, Culture and Human, ACM (2009), 69--75.  ",
      "doi": "10.1145/1655925.1655938"
    },
    {
      "text": "Jones, E., Alexander, J., Andreou, A., Irani, P., and Subramanian, S. GesText: accelerometer-based gestural text-entry systems. Proceedings of the International Conference on Human Factors in Computing Systems (SIGCHI), ACM (2010), 2173--2182.  ",
      "doi": "10.1145/1753326.1753655"
    },
    {
      "text": "Khoshhal, K., Aliakbarpour, H., Quintas, J., Drews, P., and Dias, J. Probabilistic LMA-based classification of human behaviour understanding using Power Spectrum technique. Proceedings of the 13th Conference on Information Fusion (FUSION), IEEE (2010), 1--7.",
      "doi": ""
    },
    {
      "text": "Laban, R. and Lawrence, F.C. Effort: Economy of Human Movement. Macdonald and Evans, Plymouth, 1974.",
      "doi": ""
    },
    {
      "text": "Laban, R. Effort. Macdonald & Evans, London, 1947.",
      "doi": ""
    },
    {
      "text": "Loke, L., Larssen, A.T., Robertson, T., and Edwards, J. Understanding movement for interaction design: frameworks and approaches. Personal and Ubiquitous Computing 11, (2007), 691--701.  ",
      "doi": "10.1007/s00779-006-0132-1"
    },
    {
      "text": "Mentis, H., and Johansson, C. Seeing movement qualities. Proceedings of the International Conference on Human Factors in Computing Systems (SIGCHI), ACM (2013), 3375--3384. n  ",
      "doi": "10.1145/2470654.2466462"
    },
    {
      "text": "Moore, C.L. and Yamamoto, K. Beyond Words: Movement Observation and Analysis. Gordon & Breach Science Publishers, New York, U.S.A, 1988.",
      "doi": ""
    },
    {
      "text": "Nakata, T., Mori, T., and Sato, T. Analysis of impression of robot bodily expression. Journal of Robotics and Mechatronics 14, 1 (2002), 27--36.",
      "doi": ""
    },
    {
      "text": "Pietrowicz, M., Garnett, G., McGrath, R., and Toenjes, J. Multimodal gestural interaction in performance. Proceedings of the International Conference on Human Factors in Computing Systems (SIGCHI), ACM (2010).",
      "doi": ""
    },
    {
      "text": "Rett, J., Dias, J., and Ahuactzin, J.-M. Bayesian reasoning for Laban Movement Analysis used in humanmachine interaction. International Journal of Reasoning-based Intelligent Systems 2, 1 (2010), 13--35.",
      "doi": ""
    },
    {
      "text": "Roudaut, A., Baglioni, M., and Lecolinet, E. TimeTilt: Using Sensor-Based Gestures to Travel through Multiple Applications on a Mobile Device. Proceedings of INTERACT International Conference on HumanComputer Interaction, Springer-Verlag (2009), 830--834.  ",
      "doi": "10.1007/978-3-642-03655-2_90"
    },
    {
      "text": "Santos, L., Prado, J.A., and Dias, J. Human Robot interaction studies on Laban human movement analysis and dynamic background segmentation. Proceedings of the IEEE/RSJ international conference on Intelligent robots and systems (2009), 4984--4989. ",
      "doi": "10.5555/1732643.1732859"
    },
    {
      "text": "Schiphorst, T., Nack, F., KauwATjoe, M., et al. PillowTalk: can we afford intimacy? Proceedings of the 1st international conference on Tangible and embedded interaction, ACM (2007), 23--30.  ",
      "doi": "10.1145/1226969.1226975"
    },
    {
      "text": "Schiphorst, T. Self-evidence: applying somatic connoisseurship to experience design. Proceedings of the International Conference on Human Factors in Computing Systems (SIGCHI), ACM (2011), 145--160.  ",
      "doi": "10.1145/1979742.1979640"
    },
    {
      "text": "Scoditti, A., Blanch, R., and Coutaz, J. A novel taxonomy for gestural interaction techniques based on accelerometers. Proceedings of the 16th international conference on Intelligent user interfaces, ACM (2011), 63--72.  ",
      "doi": "10.1145/1943403.1943414"
    },
    {
      "text": "Sheets-Johnstone, M. The Primacy of Movement. John Benjamins Publishing Company, Amsterdam, 1999.",
      "doi": ""
    },
    {
      "text": "Swaminathan, D., Thornburg, H., Mumford, J., Rajko, S., James, J., Ingalls, T., Campana, E., Qian, G., Sampath, P., Peng, B., A dynamic Bayesian approach to computational Laban shape quality analysis. Advances in Human Computer Interaction, (2009), 1--17.  ",
      "doi": "10.1155/2009/362651"
    },
    {
      "text": "Widmer, G., Kubat, M., Learning in the presence of concept drift and hidden contexts, Machine Learning, 23, 1 (1996), 69--101.  ",
      "doi": "10.1023/A%3A1018046501280"
    },
    {
      "text": "Wilson, A. and Shafer, S. XWand: UI for intelligent spaces. Proceedings of the International Conference on Human Factors in Computing Systems (SIGCHI), ACM (2003), 545--552.  ",
      "doi": "10.1145/642611.642706"
    },
    {
      "text": "Zhao, L. and Badler, N. Acquiring and validating motion qualities from live limb gestures. Graphical Models 67, 1 (2005), 1--16.  ",
      "doi": "10.1016/j.gmod.2004.08.002"
    }
  ]
}