{
  "doi": "10.1145/2556288.2557164",
  "title": "Evaluating the effectiveness of physical shape-change for in-pocket mobile device notifications",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2589-2592",
  "year": 2014,
  "badges": [],
  "abstract": "Audio and vibrotactile output are the standard mechanisms mobile devices use to attract their owner's attention. Yet in busy and noisy environments, or when the user is physically active, these channels sometimes fail. Recent work has explored the use of physical shape-change as an additional method for conveying notifications when the device is in-hand or viewable. However, we do not yet understand the effectiveness of physical shape-change as a method for communicating in-pocket notifications. This paper presents three robustly implemented, mobile-device sized shape-changing devices, and two user studies to evaluate their effectiveness at conveying notifications. The studies reveal that (1) different types and configurations of shape-change convey different levels of urgency and; (2) fast pulsing shape-changing notifications are missed less often and recognised more quickly than the standard slower vibration pulse rates of a mobile device.",
  "tags": [
    "shape-change",
    "mobile devices",
    "notifications"
  ],
  "authors": [
    {
      "name": "Panteleimon Dimitriadis",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959119657",
      "orcid": "missing"
    },
    {
      "name": "Jason Alexander",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019697",
      "orcid": "0000-0001-6093-6116"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Lucero, A., and Subramanian, S. Tilt Displays: Designing Display Surfaces with Multi-axis Tilting and Actuation. in MobileHCI '12. 2012: ACM.  ",
      "doi": "10.1145/2371574.2371600"
    },
    {
      "text": "Brewster, S. and Brown, L.M. Tactons: Structured Tactile Messages for Non-visual Information Display. in AUIC '04. 2004. Australian Computer Society, Inc. ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "Coelho, M. and Zigelbaum, J., Shape-changing Interfaces. PUC, 2011. 15(2): p. 161--173.  ",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Gomes, A., Nesbitt, A., and Vertegaal, R. MorePhone: a study of actuated shape deformations for flexible thinfilm smartphone notifications. in CHI '13. 2013: ACM.  ",
      "doi": "10.1145/2470654.2470737"
    },
    {
      "text": "Hemmert, F., Hamann, S., Löwe, M., Zeipelt, J., and Joost, G. Shape-Changing Mobiles: Tapering in Twodimensional Deformational Displays in Mobile Phones. in CHI EA '10. 2010: ACM.  ",
      "doi": "10.1145/1753846.1753920"
    },
    {
      "text": "Horev, O. Talking to the hand'The interactive potential of shape-behavior in objects and tangible interface. in DeSForM '06. 2006.",
      "doi": ""
    },
    {
      "text": "Ichikawa, F., Chipchase, J., and Grignani, R. Where's The Phone' A Study of Mobile Phone Location in Public Spaces. in MTAS '05. 2005.",
      "doi": ""
    },
    {
      "text": "Ling, R., One Can Talk about Common Manners! The Use of Mobile Telephones in Inappropriate Situations. Telektronikk, 1998. 94: p. 65--78.",
      "doi": ""
    },
    {
      "text": "McCrickard, D.S. and Chewar, C.M., Attuning notification design to user goals and attention costs. Commun. ACM, 2003. 46(3): p. 67--72.  ",
      "doi": "10.1145/636772.636800"
    },
    {
      "text": "Rasmussen, M.K., Pedersen, E.W., Petersen, M.G., and Hornbæk, K. Shape-Changing Interfaces: A Review of the Design Space and Open Research Questions. in CHI '12. 2012: ACM.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Roudaut, A., Karnik, A., Löchtefeld, M., and Subramanian, S. Morphees: Toward High \"Shape Resolution\" in Self-Actuated Flexible Mobile Devices. in CHI '13. 2013: ACM.  ",
      "doi": "10.1145/2470654.2470738"
    }
  ]
}