{
  "doi": "10.1145/2556288.2556991",
  "title": "Designing tangible video games: lessons learned from the sifteo cubes",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3163-3166",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "In this paper, we present a collaborative game designed for Sifteo Cubes, a new tangible interface for multiplayer games. We discuss how this game exploits the platform's interface to transfer some of the game mechanics into the non-digital world, and how this approach affects both the player's experience and the design process. We present the technical limitations encountered during game development and analyze video recordings of play sessions with regard to the play strategies developed by the players. Then, we identify two properties that this game shares with many other games on tangible platforms and discuss how these properties influence both the game design process and the player experience. We advocate that these properties provide players with more freedom and relatedness, while helping to create an easy-to-learn and customizable gameplay, despite their own design limitations.",
  "tags": [
    "mixed-reality games",
    "tangible video game",
    "video game design",
    "sifteo cubes",
    "tangible user interface",
    "player strategies"
  ],
  "authors": [
    {
      "name": "Clément Pillias",
      "institution": "CNAM, Paris, France",
      "img": "/do/10.1145/contrib-81484655350/rel-imgonly/photo.jpg",
      "acmid": "81484655350",
      "orcid": "missing"
    },
    {
      "name": "Raphaël Robert-Bouchard",
      "institution": "CNAM, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959007657",
      "orcid": "missing"
    },
    {
      "name": "Guillaume Levieux",
      "institution": "CNAM, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339512044",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aponte, M., Levieux, G., and Natkin, S. Measuring the level of difficulty in single player video games. Entertainment Computing 2, 4 (2011), 205--213.",
      "doi": ""
    },
    {
      "text": "Benford, S. et al. Expected, sensed, and desired: A framework for designing sensing-based interaction. ACM Trans. Comput.-Hum. Interact. 12, 1 (Mar. 2005), 3--30.  ",
      "doi": "10.1145/1057237.1057239"
    },
    {
      "text": "Hunter, S., Kalanithi, J., and Merrill, D. Make a riddle and telestory: designing children's applications for the siftables platform. In Proc. of IDC '10, ACM (New York, NY, USA, 2010), 206--209.  ",
      "doi": "10.1145/1810543.1810572"
    },
    {
      "text": "Jacob, R. J., Girouard, A., Hirshfield, L. M., Horn, M. S., Shaer, O., Solovey, E. T., and Zigelbaum, J. Reality-based interaction: a framework for post-wimp interfaces. In Proc. of CHI '08, ACM (New York, NY, USA, 2008).  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Juul, J. The magic circle and the puzzle piece. In Proc. of The Philosophy of Computer Games (2008), 56.",
      "doi": ""
    },
    {
      "text": "Merrill, D., Kalanithi, J., and Maes, P. Siftables: towards sensor network user interfaces. In Proc. of TEI '07, ACM (New York, NY, USA, 2007), 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Merrill, D., Sun, E., and Kalanithi, J. Sifteo cubes. In Proc. of CHI EA '12, ACM (New York, NY, USA, 2012).  ",
      "doi": "10.1145/2212776.2212374"
    },
    {
      "text": "Ryan, R. M., Rigby, C. S., and Przybylski, A. The motivational pull of video games: A self-determination theory approach. Motivation and Emotion 30, 4 (2006).",
      "doi": ""
    },
    {
      "text": "Wilson, D. Brutally unfair tactics totally ok now: On self-effacing games and unachievements. Game Studies 11, 1 (2011).",
      "doi": ""
    }
  ]
}