{
  "doi": "10.1145/2556288.2557382",
  "title": "WaaZam!: supporting creative play at a distance in customized video environments",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1197-1206",
  "year": 2014,
  "badges": [],
  "abstract": "We present the design, and evaluation of WaaZam, a video mediated communication system designed to support creative play in customized environments. Users can interact together in virtual environments composed of digital assets layered in 3D space. The goal of the project is to support creative play and increase social engagement during video sessions of geographically separated families. We try to understand the value of customization for individual families with children ages 6-12. We present interviews with creativity experts, a pilot study and a formal evaluation of families playing together in four conditions: separate windows, merged windows, digital play sets, and customized digital environments. We found that playing in the same video space enables new activities and increases social engagement for families. Customization allows families to modify scenes for their needs and support more creative play activities that embody the imagination of the child.",
  "authors": [
    {
      "name": "Seth E. Hunter",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453642942",
      "orcid": "missing"
    },
    {
      "name": "Pattie Maes",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100086306",
      "orcid": "missing"
    },
    {
      "name": "Anthony Tang",
      "institution": "University of Calgary, Calgary, Alberta, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640680",
      "orcid": "0000-0003-4293-4082"
    },
    {
      "name": "Kori M. Inkpen",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    },
    {
      "name": "Susan M. Hessey",
      "institution": "BT Plc, Ipswich, Suffolk, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82858805057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ames, M. G., Go, J., Kaye, J., and Spasojevic, M., \"Making Love in the Network Closet: The Benefits and Work of Family Videochat,\" CSCW, 2010.  ",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Ballagas, R., Kaye, J. J., Ames, M., Go, J., and Raffle, H., \"Family communication: phone conversations with children,\" in Proc. of IDC, pp. 321--324, ACM, 2009.  ",
      "doi": "10.1145/1551788.1551874"
    },
    {
      "text": "Bekoff, M and Byers J.,(Ed.s) (1998) Animal Play: Brown, S. Play as an Organizing Principle, p. 243--259",
      "doi": ""
    },
    {
      "text": "Benko, H., Jota, R., and Wilson, A.D. MirageTable: freehand interaction on a projected augmented reality desktop. In Proc. of ACM SIGCHI, 2012, 199--208.  ",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "Clark, H. H., & Brennan, S. E. (1991). Grounding in communication. Perspectives on social shared cognition. Washington, DC: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Crawley, S. B., and Spiker, D. (1983) Mother child interactions, Child Development, 54, 1312--1323",
      "doi": ""
    },
    {
      "text": "Cullinan, C. and Agamanolis, S. Reflexion: a responsive virtual mirror. Conference Companion, UIST 2002, (2002).",
      "doi": ""
    },
    {
      "text": "Dewey, J. (1938). Experience and education. New York: Collier Books.",
      "doi": ""
    },
    {
      "text": "Fish, R. Kraut, R and Chalfonte, B. 1990. The VideoWindow system in informal communication. (CSCW '90). ACM, New York, NY, USA, 1--11.  ",
      "doi": "10.1145/99332.99335"
    },
    {
      "text": "Follmer, S., Raffle, H., Go, J., Ballagas, R., and Ishii, H., \"Video play: playful interactions in video conferencing for long-distance families with young children,\" in Proc. of IDC, pp. 49--58, 2010.  ",
      "doi": "10.1145/1810543.1810550"
    },
    {
      "text": "Garvey, C. Play. Cambridge, Mass.: Harvard University Press, 1977",
      "doi": ""
    },
    {
      "text": "Isaacs, E.A. and Tang, J.C. (1993). What video can and can't do for collaboration. Multimedia, ACM, N.Y.  ",
      "doi": "10.1145/166266.166289"
    },
    {
      "text": "Ishii, H. and Miyake, N., \"Toward an open shared workspace: computer and video fusion approach of TeamWorkStation,\" Commun. ACM, pp. 37--50, 1991.  ",
      "doi": "10.1145/125319.125321"
    },
    {
      "text": "Judge, T. K. and Neustaedter, C., fisharing conversation and sharing life: video conferencing in the home, in Proc. of CHI, ACM, 2010.  ",
      "doi": "10.1145/1753326.1753422"
    },
    {
      "text": "Junuzovic S., Inkpen K., Blank, T and Gupta, A \"IllumiShare: Sharing Any Surface\", in CHI 2012, ACM, May 2012  ",
      "doi": "10.1145/2207676.2208333"
    },
    {
      "text": "Kirk, D. S., Sellen, A., and Cao, X., \"Home video communication: mediating \"closeness\",\" in Proc. of CSCW, pp. 135--144, ACM, 2010.  ",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "Krueger, Myron: Artificial Reality, Addison-Westly,",
      "doi": ""
    },
    {
      "text": "Ledo, D., Aseniero, B.A. Greenberg S. Boring, S. and Tang, A (2103) OneSpace: Shared Depth-Corrected Video Interaction. In Proc. ACM CHI 2013 April 27May 3. A CHI Work in Progress.  ",
      "doi": "10.1145/2468356.2468534"
    },
    {
      "text": "Levin, Golan, Messa di Voce, 2003 http://www.flong.com",
      "doi": ""
    },
    {
      "text": "Mehrabian, A. (1972). Nonverbal communication. Chicago: Aldine-Atherton.",
      "doi": ""
    },
    {
      "text": "Morikawa, O. and Maesako. T 1998. HyperMirror: toward pleasant-to-use video mediated communication system. (CSCW '98). ACM, New York, NY, USA  ",
      "doi": "10.1145/289444.289489"
    },
    {
      "text": "National Institute for Play: http://www.nifplay.org/",
      "doi": ""
    },
    {
      "text": "Nescher, T., & Kunz, A. (2011). An interactive whiteboard for immersive telecollaboration. The Visual Computer: International Journal of Computer Graphics Special Issue on Cyberworlds 2010 , 27 (4), 311--320.  ",
      "doi": "10.1007/s00371-011-0546-2"
    },
    {
      "text": "Neustaedter, Oduor, Venolia, Judge. 2012. Moving beyond talking heads to shared experiences: the future of personal video communication. CSCW, New York, NY, USA, 327--330.",
      "doi": ""
    },
    {
      "text": "Nikolopolou, A. (1993): Play, cognitive development, and the social world: Piaget, Vygotsky, and beyond. Human Development 36:1--23.",
      "doi": ""
    },
    {
      "text": "Papert, S. (1980). Mindstorms: Children, Computers, and Powerful Ideas. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Piaget, Jean The construction of reality in the child (New York: Basic Books, 1954)",
      "doi": ""
    },
    {
      "text": "Rainie, L. and Zickuhr, K., \"Video calling and video chat,\" in Pew Internet & American Life Project, http://pewinternet.org/Reports/2010 , 2010.",
      "doi": ""
    },
    {
      "text": "Raffle, H., Ballagas, R., \"Family Story Play: Reading with Young Children (and Elmo) Over a Distance,\" in Proc. of CHI, ACM, 2010.  ",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Raffle, H., Revelle, G., Mori, K., Ballagas, R. \"StoryVisit : Family Video Chat and Connected EBooks,\" in Proc. of CHI 2011.  ",
      "doi": "10.1145/1978942.1979121"
    },
    {
      "text": "Sermon, Paul, Telematic Artworks: http://www.paulsermon.org/",
      "doi": ""
    },
    {
      "text": "Snibbe, Scott: Deep Walls, 2002: http://www.snibbe.com/projects/",
      "doi": ""
    },
    {
      "text": "Tang, A., Neustaedter, C., & Greenberg, S. (2007). VideoArms: Embodiments for Mixed Presence Groupware. In People and Computers XX",
      "doi": ""
    },
    {
      "text": "Tang, J. C. and Minneman, S. L., \"Videodraw: a video interface for collaborative drawing,\" ACM Trans. Inf. Syst., vol. 9, no. 2, pp. 170--184, 1991.  ",
      "doi": "10.1145/123078.128729"
    },
    {
      "text": "Von Kapri, A, Wong, K, Hunter, S, Gillian, Maes, P \"InReach: Manipulating 3D Objects Remotely Using your Body\" (CHI 2013), Workshop paper.",
      "doi": ""
    },
    {
      "text": "Vygotsky, L.S. (1977): Play and its role in the mental development of the child. New York, Basic Books.",
      "doi": ""
    },
    {
      "text": "W.M. Keck Center for Active Visualization in the Earth Sciences. KeckCAVES. Retrieved April 20, 2013",
      "doi": ""
    },
    {
      "text": "Watson, Theo: Knee Deep, 2009: http://www.theowatson.com/",
      "doi": ""
    },
    {
      "text": "WaaZam network protocol: https://github.com/arturoc/ofxGstRTP",
      "doi": ""
    },
    {
      "text": "Yarosh, S., Cuzzort, S., Muller, H., and Abowd, G. D., \"Developing a media space for remote synchronous parent-child interaction,\" in Proc. of IDC, 2009.  ",
      "doi": "10.1145/1551788.1551806"
    },
    {
      "text": "Yarosh, S., Chew, D., Abowd, G. \"Supporting parentchild communication in divorced families. Journal of Human Computing Studies, 2009, 192--203  ",
      "doi": "10.1016/j.ijhcs.2008.09.005"
    },
    {
      "text": "Yarosh, S., Inkpen, K., and Brush, A., \"Video playdate: toward free play across distance,\" in Proc. of CHI, (Atlanta, GA), pp. 1251--1260, ACM, 2010.  ",
      "doi": "10.1145/1753326.1753514"
    },
    {
      "text": "Zsombori, et al. 2011. Automatic generation of video narratives from shared UGC. (HT '11)  ",
      "doi": "10.1145/1995966.1996009"
    }
  ]
}