{
  "doi": "10.1145/2556288.2557189",
  "title": "Large-scale assessment of mobile notifications",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3055-3064",
  "year": 2014,
  "badges": [],
  "abstract": "Notifications are a core feature of mobile phones. They inform users about a variety of events. Users may take immediate action or ignore them depending on the importance of a notification as well as their current context. The nature of notifications is manifold, applications use them both sparsely and frequently. In this paper we present the first large-scale analysis of mobile notifications with a focus on users' subjective perceptions. We derive a holistic picture of notifications on mobile phones by collecting close to 200 million notifications from more than 40,000 users. Using a data-driven approach, we break down what users like and dislike about notifications. Our results reveal differences in importance of notifications and how users value notifications from messaging apps as well as notifications that include information about people and events. Based on these results we derive a number of findings about the nature of notifications and guidelines to effectively use them.",
  "tags": [
    "large-scale",
    "in the wild",
    "apps",
    "notification",
    "mobile phone",
    "mobile hci"
  ],
  "authors": [
    {
      "name": "Alireza Sahami Shirazi",
      "institution": "University of Stuttgart, Stuttgart, BW, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548021084",
      "orcid": "missing"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Stuttgart, Stuttgart, Baden-Württemberg, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    },
    {
      "name": "Tilman Dingler",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81472653974/rel-imgonly/lichtbild.jpg",
      "acmid": "81472653974",
      "orcid": "0000-0001-6180-7033"
    },
    {
      "name": "Martin Pielot",
      "institution": "Telefonica Research, Barcelona, Spain",
      "img": "/do/10.1145/contrib-81385591697/rel-imgonly/cv_shirt.jpg",
      "acmid": "81385591697",
      "orcid": "missing"
    },
    {
      "name": "Dominik Weber",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-87959271257/rel-imgonly/dominik.jpg",
      "acmid": "87959271257",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P. D., and Bailey, B. P. If not now, when?: the effects of interruption at different moments within task execution. In Proc. CHI (2004).  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Böhmer, M., Hecht, B., Schöning, J., Krüger, A., and Bauer, G. Falling asleep with angry birds, facebook and kindle: a large scale study on mobile application usage. In Proc. of MobileHCI (2011).  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Church, K., and de Oliveira, R. What's up with whatsapp? comparing mobile instant messaging behaviors with traditional sms. In Proc. MobileHCI (2013).  ",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Cutrell, E., Czerwinski, M., and Horvitz, E. Notification, disruption, and memory: Effects of messaging interruptions on memory and performance. In Proc. Interact (2001).",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Cutrell, E., and Horvitz, E. Instant messaging and interruption: influence of task type on performance. In Proc. OZCHI (2000).",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., Horvitz, E., and Wilhite, S. A diary study of task switching and interruptions. In Proc. CHI (2004).  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Felt, A. P., Egelman, S., and Wagner, D. Ifive got 99 problems, but vibration ain't one: a survey of smartphone users' concerns. In Proc. SPSM (2012).  ",
      "doi": "10.1145/2381934.2381943"
    },
    {
      "text": "Fischer, J. E., Greenhalgh, C., and Benford, S. Investigating episodes of mobile phone activity as indicators of opportune moments to deliver notifications. In Proc. MobileHCI (2011).  ",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Fischer, J. E., Yee, N., Bellotti, V., Good, N., Benford, S., and Greenhalgh, C. Effects of content and time of delivery on receptivity to mobile interruptions. In Proc. MobileHCI (2010).  ",
      "doi": "10.1145/1851600.1851620"
    },
    {
      "text": "Henze, N., and Pielot, M. App stores: external validity for mobile hci. interactions 20, 2 (2013).  ",
      "doi": "10.1145/2427076.2427084"
    },
    {
      "text": "Henze, N., Pielot, M., Poppinga, B., Schinke, T., and Boll, S. My app is an experiment: Experience from user studies in mobile app stores. IJMHCI (2011).  ",
      "doi": "10.4018/jmhci.2011100105"
    },
    {
      "text": "Ichikawa, F., Chipchase, J., and Grignani, R. Where's the phone? a study of mobile phone location in public spaces. In Proc. Mobility (2005).",
      "doi": ""
    },
    {
      "text": "Iqbal, S. T., and Horvitz, E. Notifications and awareness: a field study of alert usage and preferences. In Proc. CSCW (2010).  ",
      "doi": "10.1145/1718918.1718926"
    },
    {
      "text": "Kim, H., Kim, G. J., Park, H. W., and Rice, R. E. Configurations of relationships in different media: Ftf, email, instant messenger, mobile phone, and sms. Computer-Mediated Communication (2007).",
      "doi": ""
    },
    {
      "text": "Leiva, L., Böhmer, M., Gehring, S., and Krüger, A. Back to the app: the costs of mobile application interruptions. In Proc. MobileHCI (2012).  ",
      "doi": "10.1145/2371574.2371617"
    },
    {
      "text": "Mark, G., Voida, S., and Cardello, A. \"a pace not dictated by electrons\": an empirical study of work without email. In Proc. CHI (2012).  ",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "McMillan, D., Morrison, A., Brown, O., Hall, M., and Chalmers, M. Further into the wild: Running worldwide trials of mobile systems. In Proc. Pervasive (2010).  ",
      "doi": "10.1007/978-3-642-12654-3_13"
    },
    {
      "text": "Oulasvirta, A., Rattenbury, T., Ma, L., and Raita, E. Habits make smartphone use more pervasive. Personal Ubiquitous Computing (2012).  ",
      "doi": "10.1007/s00779-011-0412-2"
    },
    {
      "text": "Pielot, M., de Oliveira, R., Kwak, H., and Oliver, N. Didn't you see my message? predicting attentiveness to mobile instant messages. In Proc. CHI (2014).  ",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Tukey, J. W. Exploratory data analysis. 1977.",
      "doi": ""
    },
    {
      "text": "Wiese, J., Saponas, T. S., and Brush, A. Phoneprioception: enabling mobile phones to infer where they are kept. In Proc. CHI (2013).  ",
      "doi": "10.1145/2470654.2481296"
    }
  ]
}