{
  "doi": "10.1145/2556288.2557100",
  "title": "A pool of dreams: facebook, politics and the emergence of a social movement",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3573-3582",
  "year": 2014,
  "badges": [],
  "abstract": "In this paper we present insights from an empirical analysis of data from an emergent social movement primarily located on a Facebook page to contribute understanding of the conduct of everyday politics in social media and through this open up research agendas for HCI. The analysis focuses on how interactions and contributions facilitated the emergence of a collective with political will. We lay out an exploration of the intrinsic relationship between cultural memories, cultural expression and everyday politics and show how diverging voices co-constructed dynamic collectives capable of political action. We look at how interactions through the Facebook page challenge traditional ways for conceiving politics and the political. We outline possible research agendas in the field of everyday politics, which are sensitive to the everyday acts of resistance enclosed in the ordinary.",
  "authors": [
    {
      "name": "Clara Crivellaro",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    },
    {
      "name": "Rob Comber",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "John Bowers",
      "institution": "Newcastle University, Newcastle Upon Tyne , United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260889",
      "orcid": "missing"
    },
    {
      "name": "Peter C. Wright",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Aoki, P.M., Honicky, R.J., Mainwaring, A., et al. A vehicle for research: using street sweepers to explore the landscape of environmental community action. In Proc CHI 2009, ACM (2009), 375--384.  ",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Bennett, W.L. and Segerberg, A. Digital media and the personalization of collective action. Information, Communication & Society 14, 6 (2011), 770--799.",
      "doi": ""
    },
    {
      "text": "Bennett, W.L. and Segerberg, A. The Logic of Connective Action. Information, Communication & Society 15, 5 (2012), 739--768.",
      "doi": ""
    },
    {
      "text": "Björgvinsson, E., Ehn, P., and Hillgren, P.A. Participatory design and 'democratizing innovation'. In Proc. PDC 2010, ACM (2010), 41--50.  ",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Dearden, A. and Light, A. Designing for e-Social Action An Application Taxonomy. In Proc Design Reaserch Society Conference 2008, Sheffield Hallam University (2008)",
      "doi": ""
    },
    {
      "text": "Dimond, J.P., Dye, M., Larose, D., and Bruckman, A.S. Hollaback : The Role of Collective Storytelling Online in a Social Movement Organization, In Proc. CSCW 2013, ACM (2013), 477--489.  ",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Disalvo, C., Maki, J., and Martin, N. MapMover : A Case Study of Design-Oriented Research into Collective Expression and Constructed Publics. In Proc. CHI 2007, ACM (2007), 1249--1252.  ",
      "doi": "10.1145/1240624.1240813"
    },
    {
      "text": "Disalvo, C., Nourbakhsh, I., Holstius, D., Akin, A., and Louw, M. The neighborhood networks project: a case study of critical engagement and creative expression through participatory design, In Proc. PDC 2008, ACM (2008), 41--50. ",
      "doi": "10.5555/1795234.1795241"
    },
    {
      "text": "DiSalvo, C. Adversarial Design (Design Thinking, Design Theory). The MIT Press, 2012. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Dourish, P. HCI and environmental sustainability: the politics of design and the design of politics, In Proc. DIS 2010, ACM(2010), 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Foucault, M. The Archeology of knowledge. Tavistock, 1972.",
      "doi": ""
    },
    {
      "text": "Foucault, M. Power/Knowledge : Selected interviews and selected writings 1972--1977. C.Gordon Edition, New York: Harvester WheatSheaf, 1980.",
      "doi": ""
    },
    {
      "text": "Fraser, N. Rethinking the public sphere: a contribution to the critique of actually existing democracy. Social Text 25--26, (1990), 56--80",
      "doi": ""
    },
    {
      "text": "Halpern, D. and Gibbs, J. Social media as a catalyst for online deliberation? Exploring the affordances of Facebook and YouTube for political expression. Computers in Human Behavior 29, 3, (2013), 1159--  ",
      "doi": "10.1016/j.chb.2012.10.008"
    },
    {
      "text": "Hauser, G.A., Vernacular voices: the rhetoric of publics and public spheres. University of South Carolina Press, 1999.",
      "doi": ""
    },
    {
      "text": "Hauser, G., A., McClellan, D., E., Vernacular Rhetoric and Social Movements: Performances of Resistance in the Rhetoric of the Everyday. In Stevens, Mckenzie, S. and Malesh,P., Active voices : composing a rhetoric for social movements, SUNY Press, 2010.",
      "doi": ""
    },
    {
      "text": "Ingold, T., Lines : A Brief History, Routledge, 2007.",
      "doi": ""
    },
    {
      "text": "Kuznetsov, S., Paulos, E., and Gross, M. WallBots: interactive wall-crawling robots in the hands of public artists and political activists. In Proc DIS 2010, ACM (2010), 208--217.  ",
      "doi": "10.1145/1858171.1858208"
    },
    {
      "text": "Kuznetsov, S. and Paulos, E., HCI , Politics and the city : engaging with urban grassroots movements for reflection and action. Ext. Abtracts CHI 2011, ACM (2011), 2409--2412.  ",
      "doi": "10.1145/1979742.1979568"
    },
    {
      "text": "Langlois, G. and Elmer, G. The research politics of social media platforms. Culture Machine 14, (2013), 1--",
      "doi": ""
    },
    {
      "text": "Latour, B., Weibel,P., Making Things Public: Athmosphere of Democracy, MIT Press, 2005.",
      "doi": ""
    },
    {
      "text": "Lee, Y.-H. and Hsieh, G. Does slacktivism hurt activism?: the effects of moral balancing and consistency in online activism. In Proc. CHI 2013, ACM (2013), 811--820.  ",
      "doi": "10.1145/2470654.2470770"
    },
    {
      "text": "Light, A. The Unit of Analysis in Understanding the Politics of Participatory Practice, In Proc PDC 2010, ACM (2010), 183--186.  ",
      "doi": "10.1145/1900441.1900473"
    },
    {
      "text": "Mainsah, H. and Morrison, A. Social media, design and civic engagement by youth: a cultural view. In Proc. PDC 2012, ACM (2012), 1--9.  ",
      "doi": "10.1145/2347635.2347637"
    },
    {
      "text": "Mascaro, C.M. and Goggins, S.P. Brewing up citizen engagement: the coffee party on facebook. In Proc. C&T 2011, ACM (2011), 11--20.  ",
      "doi": "10.1145/2103354.2103357"
    },
    {
      "text": "Massung, E., Coyle, D., Cater, K.F., et al. Using crowdsourcing to support pro-environmental community activism. In Proc. CHI 2013, ACM (2013), 371--380  ",
      "doi": "10.1145/2470654.2470708"
    },
    {
      "text": "McCafferty, D. Activism vs. slacktivism. Communications ACM 54, 12 (2011), 17--19.  ",
      "doi": "10.1145/2043174.2043182"
    },
    {
      "text": "Monroy-Hernández, A., Farnham, S., Kiciman,E., et al. Smart societies: from citizens as sensors to collective action, Interactions 20, 4 (2013), 16--19.  ",
      "doi": "10.1145/2486227.2486249"
    },
    {
      "text": "Parker, A., Kantroo, V., Lee, H.R., et al. Health promotion as activism: building community capacity to effect social change. In Proc CHI 2012, ACM, (2012), 99--108.  ",
      "doi": "10.1145/2207676.2207692"
    },
    {
      "text": "Pietrucci, P., Poetic publics: agency and rhetorics of 'netroots' activism in post-earthquake L -- Aquila, The Journal of Community Informatics 6, 3 (2013), 1--13.",
      "doi": ""
    },
    {
      "text": "Rotman, D., Vieweg, S., Yardi, S., et al. From slacktivism to activism: participatory culture in the age of social media. In Proc CHI 2011, ACM (2011), 819--822.  ",
      "doi": "10.1145/1979742.1979543"
    },
    {
      "text": "Saeed, S., Rohde, M., and Wulf, V. Analyzing political activists' organization practices: findings from a long term case study of the european social forum. CSCW 20, 4--5 (2011), 265--304.  ",
      "doi": "10.1007/s10606-011-9144-0"
    },
    {
      "text": "Segerberg, A. and Bennett, W.L. Social Media and the Organization of Collective Action: Using Twitter to Explore the Ecologies of Two Climate Change Protests. The Communication Review 14, 3 (2011), 197--215.",
      "doi": ""
    },
    {
      "text": "Tarrow, S., Power in Movement, Cambridge University Press, 1994.",
      "doi": ""
    },
    {
      "text": "Tayebi, A. Planning activism: using social media to claim marginalized citizens' right to the city. Cities 32, (2013), 88--93",
      "doi": ""
    },
    {
      "text": "Uldam, J. and Askanius, T. Online civic cultures: debating climate change activism on youtube. International Journal of Communication 7, (2013), 1185--1204.",
      "doi": ""
    },
    {
      "text": "Varnelis, K. Networked Publics. The MIT Press, 2008 ",
      "doi": "10.5555/1468060"
    },
    {
      "text": "Wodak, R., Krzyzanowski, M., Qualitative Discourse Analysis in the Social Sciences, Palgrave Macmillan Press, 2008.",
      "doi": ""
    },
    {
      "text": "Wulf, V., Aal, K., Ktesh, I.A., et al. Fighting against the wall: social media use by political activists in a palestinian village, In Proc CHI 2013, ACM (2013), 1979--1988  ",
      "doi": "10.1145/2470654.2466262"
    },
    {
      "text": "Wulf, V., Misaki, K., Atam, M., et al., 'On the ground' in Sidi Bouzid: investigating social media use during the tunisian revolution, In Proc CSCW 2013, ACM (2013), 1409--141.  ",
      "doi": "10.1145/2441776.2441935"
    }
  ]
}