{
  "doi": "10.1145/2556288.2556995",
  "title": "You read what you value: understanding personal values and reading interests",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "983-986",
  "year": 2014,
  "badges": [],
  "abstract": "This paper presents an experiment on the relationship between personal values and reading interests of online articles. Results suggest that individuals' values can predict their topical interests. For example, holding stronger universalism values predict interests towards environmental articles, whereas holding stronger achievement values predict interest towards work-related articles. Findings demonstrate the possibility of targeting based on individuals' personal values, but also highlight certain challenges and limitations when applying this approach for online content.",
  "tags": [
    "personal values",
    "reading interest",
    "twitter",
    "content targeting"
  ],
  "authors": [
    {
      "name": "Gary Hsieh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    },
    {
      "name": "Jilin Chen",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487940",
      "orcid": "0000-0002-0513-7474"
    },
    {
      "name": "Jalal U. Mahmud",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319496986",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Nichols",
      "institution": "IBM Research, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81100204766/rel-imgonly/jeffhead2021-square.jpeg",
      "acmid": "81100204766",
      "orcid": "0000-0002-6880-8546"
    }
  ],
  "references": [
    {
      "text": "Chen, J., Hsieh, G., Mahmud, J., Nichols, J. To appear. Understanding Individuals' Personal Values from Social Media Word Use. Proc. of CSCW.  ",
      "doi": "10.1145/2531602.2531608"
    },
    {
      "text": "Jannach, D., Zanker, M., Felfernig, A., & Friedrich, G. 2010. Recommender systems: an introduction. Cambridge University Press. ",
      "doi": "10.5555/1941904"
    },
    {
      "text": "Java, A., Song, X., Finin, T., and Tseng, B. 2007. Why we twitter: understanding microblogging usage and communities. In Proc. of the WebKDD and SNAKDD Workshop on Web Mining and Social Network Analysis, 56--65.  ",
      "doi": "10.1145/1348549.1348556"
    },
    {
      "text": "Schwartz, S. H. 1994. Are There Universal Aspects in the Structure and Contents of Human Values' Journal of Social Issues, 50(4), 19--45",
      "doi": ""
    },
    {
      "text": "Schwartz, S. H. 2002. A Proposal for Measuring Value Orientations across Nations. Chapter 7 in the Questionnaire Development Package of the European Social Survey.",
      "doi": ""
    },
    {
      "text": "Templeton, T. C., Fleischmann, K. R., & Boyd-Graber, J. 2011. Simulating audiences: Automating analysis of values, attitudes, and sentiment. In Proc. Of PASSAT/SocialCom, pp. 734--737",
      "doi": ""
    },
    {
      "text": "Verplanken, B., Holland, R. W. 2002. Motivated decision making: Effects of activation and self-centrality of values on choices and behavior. Journal of Personality and Social Psychology, 82(3) 434--447",
      "doi": ""
    }
  ]
}