{
  "doi": "10.1145/2556288.2557159",
  "title": "Crowd storage: storing information on existing memories",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "601-604",
  "year": 2014,
  "badges": [],
  "abstract": "This paper introduces the concept of crowd storage, the idea that digital files can be stored and retrieved later from the memories of people in the crowd. Similar to human memory, crowd storage is ephemeral, which means that storage is temporary and the quality of the stored information degrades over time. Crowd storage may be preferred over storing information directly in the cloud, or when it is desirable for information to degrade inline with normal human memories. To explore and validate this idea, we created WeStore, a system that stores and then later retrieves digital files in the existing memories of crowd workers. WeStore does not store information directly, but rather encrypts the files using details of the existing memories elicited from individuals within the crowd as cryptographic keys. The fidelity of the retrieved information is tied to how well the crowd remembers the details of the memories they provided. We demonstrate that crowd storage is feasible using an existing crowd marketplace (Amazon Mechanical Turk), explore design considerations important for building systems that use crowd storage, and outline ideas for future research in this area.",
  "authors": [
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Walter S. Lasecki",
      "institution": "University of Rochester, Rochester, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490695200",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baddeley, A., Eysenck, M. W., and Anderson, M. C. Memory. London: Psychology Press. 2009.",
      "doi": ""
    },
    {
      "text": "Caimei, W. and Zhengmao, L., \"Self-selecting Sub-secret Keys Sharing Scheme Based on Polynomials over Elliptic Curve,\" IAS 2009.  ",
      "doi": "10.1109/IAS.2009.250"
    },
    {
      "text": "Geambasu, R., Kohno, T., Levy, A., Levy, H. M. Vanish: Increasing Data Privacy with Self-Destructing Data. USENIX Security Symposium. 2009. ",
      "doi": "10.5555/1855768.1855787"
    },
    {
      "text": "Gulotta, R., Odom, W., Forlizzi, J., and Haakon, F. \"Digital artifacts as legacy: exploring the lifespan and value of digital data.\" CHI 2013. 1813--1822.  ",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Hollan, J., Hutchins, E., and Kirsh, D. \"Distributed cognition: toward a new foundation for human-computer interaction research.\" TOCHI 2000.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Lasecki, W. S., White, S. C., Murray, K. I., Bigham, J. P. \"Crowd Memory: Learning in the Collective. CI 2012.",
      "doi": ""
    },
    {
      "text": "Lasecki, W. S., Miller, C., Sadilek, A. Abumoussa, A., Borrello, D., Kushalnagar, R., Bigham, J. P. \"Real-time captioning by groups of non-experts.\" UIST 2012.  ",
      "doi": "10.1145/2380116.2380122"
    },
    {
      "text": "Sadilek, A., Krumm, J., and Horvitz, E. \"Crowdphysics: Planned and Opportunistic Crowdsourcing for Physical Tasks.\" ICWSM 2013.",
      "doi": ""
    },
    {
      "text": "Shamir, Adi. \"How to share a secret,\" CACM 1979.  ",
      "doi": "10.1145/359168.359176"
    },
    {
      "text": "Toomim, M., Zhang, X, Fogarty, J., Landay, J. A. \"Access control by testing for shared knowledge.\" CHI 2008. 193--196.  ",
      "doi": "10.1145/1357054.1357086"
    },
    {
      "text": "Wolchok, S., Hofmanny, O. S., Heninger, N., Felten, E. W., Halderman, J. A., Rossbach, C. J., Waters, B., and Witchel, E. \"Defeating Vanish with Low-Cost Sybil Attacks Against Large DHTs.\" NDSS 2010.",
      "doi": ""
    },
    {
      "text": "Yan, J., Blackwell, A., Anderson, R., and Grant, A. \"Password memorability and security: empirical results,\" Security & Privacy, IEEE, 2:5, 25--31, 2004.  ",
      "doi": "10.1109/MSP.2004.81"
    }
  ]
}