{
  "doi": "10.1145/2556288.2557129",
  "title": "Stimulating a blink: reduction of eye fatigue with visual stimulus",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2055-2064",
  "year": 2014,
  "badges": [],
  "abstract": "Computers make incredible amounts of information available at our fingertips. As computers become integral parts of our lives, we spend more time staring at computer monitor than ever before, sometimes with negative effects. One major concern is the increasing number of people suffering from Computer Vision Syndrome (CVS). CVS is caused by extensive use of computers, and its symptoms include eye fatigue, frequent headaches, dry eyes, and blurred vision. It is possible to partially alleviate CVS if we can remind users to blink more often. We present a prototype system that uses a camera to monitor a user's blink rate, and when the user has not blinked in a while, the system triggers a blink stimulus. We investigated four different types of eye-blink stimulus: screen blurring, screen flashing, border flashing, and pop-up notifications. Users also rated each stimulus type in terms of effectiveness, intrusiveness, and satisfaction. Results from our user studies show that our stimuli are effective in increasing user blink rate with screen blurring being the best.",
  "tags": [
    "blink detection",
    "blink stimulus",
    "cvs",
    "user study"
  ],
  "authors": [
    {
      "name": "Tarik Crnovrsanin",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442615473",
      "orcid": "missing"
    },
    {
      "name": "Yang Wang",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958702857",
      "orcid": "missing"
    },
    {
      "name": "Kwan-Liu Ma",
      "institution": "University of California at Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452595774",
      "orcid": "0000-0001-8086-0366"
    }
  ],
  "references": [
    {
      "text": "Protect your vision. http://www.protectyourvision.org/.",
      "doi": ""
    },
    {
      "text": "Acosta, M., Gallar, J., and Belmonte, C. The influence of eye solutions on blinking and ocular comfort at rest and during work at video display terminals. Experimental Eye Research 68, 6 (1999), 663--669.",
      "doi": ""
    },
    {
      "text": "Arai, K., and Mardiyanto, R. Eye based hci with moving keyboard for reducing fatigue effects. In 2011 Eighth International Conference on Information Technology: New Generations, IEEE (Apr. 2011), 417--422.  ",
      "doi": "10.1109/ITNG.2011.80"
    },
    {
      "text": "Bacher, L. F., and Smotherman, W. P. Spontaneous eye blinking in human infants: a review. Developmental psychobiology 44, 2 (Mar. 2004), 95--102.",
      "doi": ""
    },
    {
      "text": "Birch, L., Juul-Kristensen, B., Jensen, C., Finsen, L., and Christensen, H. Acute response to precision, time pressure and mental demand during simulated computer work. Scandinavian Journal of Work, Environment & Health 26, 4 (Aug. 2000), 299--305.",
      "doi": ""
    },
    {
      "text": "Biswas, N. R., Nainiwal, S. K., Das, G. K., Langan, U., Dadeya, S. C., Mongre, P. K., Ravi, A. K., and Baidya, P. Comparative randomised controlled clinical trial of a herbal eye drop with artificial tear and placebo in computer vision syndrome. Journal of the Indian Medical Association 101, 3 (Mar. 2003), 208--9, 212.",
      "doi": ""
    },
    {
      "text": "Blehm, C., Vishnu, S., Khattak, A., Mitra, S., and Yee, R. W. Computer vision syndrome: a review. Survey of ophthalmology 50, 3 (2005), 253--62.",
      "doi": ""
    },
    {
      "text": "Bologna, M., Agostino, R., Gregori, B., Belvisi, D., Ottaviani, D., Colosimo, C., Fabbrini, G., and Berardelli, A. Voluntary, spontaneous and reflex blinking in patients with clinically probable progressive supranuclear palsy. Brain: A Journal of Neurology 132, Pt 2 (Feb. 2009), 502--10.",
      "doi": ""
    },
    {
      "text": "Bradski, G. Dr. Dobb's Journal of Software Tools (2000).",
      "doi": ""
    },
    {
      "text": "Caffier, P. P., Erdmann, U., and Ullsperger, P. Experimental evaluation of eye-blink parameters as a drowsiness measure. European journal of applied physiology 89, 3-4 (May 2003), 319--25.",
      "doi": ""
    },
    {
      "text": "Cardona, G., and Quevedo, N. Blinking and Driving: the influence of Saccades and Cognitive Workload. Current eye research (Oct. 2013), 1--6.",
      "doi": ""
    },
    {
      "text": "CRC Press, Anshel, J. Visual Ergonomics Handbook. 2005.",
      "doi": ""
    },
    {
      "text": "Divjak, M., and Bischof, H. Eye Blink Based Fatigue Detection for Prevention of Computer Vision Syndrome. MVA2009 IAPR Conference on Machine Vision Applications (2009), 350--353.",
      "doi": ""
    },
    {
      "text": "Doughty, M. J. Consideration of Three Types of Spontaneous Eyeblink Activity in Normal Humans: during Reading and Video Display Terminal Use, in Primary Gaze, and while in Conversation. Optometry and Vision Science 78, 10 (2001), 712--725.",
      "doi": ""
    },
    {
      "text": "Dumery, B., Grounauer, P., and Toi, V. V. Eyestrain, Blink Rate and Dry Eye Syndromes of Video Display Terminal Users. The Third International Conference on the Development of Biomedical Engineering in Vietnam (2010), 270--273.",
      "doi": ""
    },
    {
      "text": "Evinger, C., Manning, K., and Sibony, P. Eyelid Movements Mechanisms and Normal Data. Investigative ophthalmology & visual science 32, 2 (1991), 387--400.",
      "doi": ""
    },
    {
      "text": "Fenety, A., and Walker, J. Short-Term Effects of Workstation Exercises on Musculoskeletal Discomfort and Postural Changes in Seated Video Display Unit Workers. Physical Therapy (2002), 578--589.",
      "doi": ""
    },
    {
      "text": "Folk, C. L., Leber, A. B., and Egeth, H. E. Made you blink! contingent attentional capture produces a spatial blink. Perception & psychophysics 64, 5 (July 2002), 741--53.",
      "doi": ""
    },
    {
      "text": "Freudenthaler, N., Neuf, H., Kadner, G., and Schlote, T. Characteristics of spontaneous eyeblink activity during video display terminal use in healthy volunteers. Graefe's archive for clinical and experimental ophthalmology 241, 11 (Nov. 2003), 914--20.",
      "doi": ""
    },
    {
      "text": "Han, S., Yang, S., Kim, J., and Gerla, M. Eyeguardian: a framework of eye tracking and blink detection for mobile device users. In HOTMOBILE'12 (2012), 6--6.  ",
      "doi": "10.1145/2162081.2162090"
    },
    {
      "text": "Heishman, R., and Duric, Z. Using eye blinks as a tool for augmented cognition. Foundations of Augmented Cognition (2007), 84--93. ",
      "doi": "10.5555/1763088.1763099"
    },
    {
      "text": "Helland, M., Horgen, G., Kvikstad, T., and Aars, A. Do Background Luminance Levels or Character Size Effect the Eye Blink Rate During Visual Display Unit (VDU) Work Comparing Young Adults with Presbyopes vol. 4566. Springer Berlin Heidelberg, 2007. ",
      "doi": "10.5555/1784356.1784366"
    },
    {
      "text": "Karson, C. N., Berman, K. F., Donnelly, E. F., Mendelson, W. B., Kleinman, J. E., and Wyatt, R. J. Speaking, thinking, and blinking. Psychiatry research 5, 3 (Dec. 1981), 243--6.",
      "doi": ""
    },
    {
      "text": "Królak, A., and Strumio, P. Eye-blink detection system for human-computer interaction. Universal Access in the Information Society 11, 4 (Oct. 2011), 409--419.",
      "doi": ""
    },
    {
      "text": "Mark, G., Gudith, D., and Klocke, U. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '08, ACM (New York, NY, USA, 2008), 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Mclean, L., Tingley, M., Scott, R. N., and Rickards, J. Computer terminal work and the benefit of microbreaks. Applied ergonomics 32, 3 (June 2001), 225--37.",
      "doi": ""
    },
    {
      "text": "Miljanović, B., Dana, R., Sullivan, D. a., and Schaumberg, D. a. Impact of dry eye syndrome on vision-related quality of life. American journal of ophthalmology 143, 3 (Mar. 2007), 409--15.",
      "doi": ""
    },
    {
      "text": "Miura, D. L., Hazarbassanov, R. M., Yamasato, C. K. N., Silva, F. B. E., Godinho, C. J., and Gomes, J. A. P. Effect of a light-emitting timer device on the blink rate of non-dry eye individuals and dry eye patients. The British journal of ophthalmology 97, 8 (Aug. 2013), 965--967.",
      "doi": ""
    },
    {
      "text": "Nakamori, K., Odawara, M., Nakajima, T., Mizutani, T., and Tsubota, K. Blinking is controlled primarily by ocular surface conditions. American journal of ophthalmology 124, 1 (July 1997), 24--30.",
      "doi": ""
    },
    {
      "text": "Pampana, V., and Chandran, R. Eye pro. http://classlesoft.in/eye-pro.",
      "doi": ""
    },
    {
      "text": "Rushworth, G. Observations on blink reflexes. Journal of neurology, neurosurgery, and psychiatry, 1906 (1962).",
      "doi": ""
    },
    {
      "text": "Schaumberg, D. a., Sullivan, D. a., Buring, J. E., and Dana, M. Prevalence of dry eye syndrome among US women. American Journal of Ophthalmology 136, 2 (Aug. 2003), 318--326.",
      "doi": ""
    },
    {
      "text": "Schlote, T., Kadner, G., and Freudenthaler, N. Marked reduction and distinct patterns of eye blinking in patients with moderately dry eyes during video display terminal use. Graefe's archive for clinical and experimental ophthalmology 242, 4 (Apr. 2004), 306--12.",
      "doi": ""
    },
    {
      "text": "Shelter Publications, I. http://www.stretchware.com/.",
      "doi": ""
    },
    {
      "text": "Skotte, J. H., Nøjgaard, J. K., Jørgensen, L. V., Christensen, K. B., and Sjøgaard, G. Eye blink frequency during different computer tasks quantified by electrooculography. European journal of applied physiology 99, 2 (Jan. 2007), 113--9.",
      "doi": ""
    },
    {
      "text": "Thomas, L., and Irwin, D. Voluntary eyeblinks disrupt iconic memory. Perception & psychophysics 68, 3 (04 2006), 475--488.",
      "doi": ""
    },
    {
      "text": "Trutoiu, L. C., Carter, E. J., Matthews, I., and Hodgins, J. K. Modeling and animating eye blinks. ACM Trans. Appl. Percept. 8, 3 (Aug. 2011), 1--17.  ",
      "doi": "10.1145/2010325.2010327"
    },
    {
      "text": "Tsubota, K. Tear dynamics and dry eye. Progress in Retinal and Eye Research 17, 4 (1998), 565--596.",
      "doi": ""
    },
    {
      "text": "Wolkoff, P., Nøjgaard, J. K., Troiano, P., and Piccoli, B. Eye complaints in the Office environment: precorneal tear film integrity influenced by eye blinking efficiency. Occupational and environmental medicine 62, 1 (Jan. 2005), 4--12.",
      "doi": ""
    },
    {
      "text": "Wolkoff, P., Skov, P., Franck, C., and Petersen, L. N. Eye irritation and environmental factors in the Office environment-hypotheses, causes and a physiological model. Scandinavian Journal of Work, Environment & Health 29, 6 (dec 2003), 411--430.",
      "doi": ""
    },
    {
      "text": "Yan, Z., Hu, L., Chen, H., and Lu, F. Computer Vision Syndrome: A widely spreading but largely unknown epidemic among computer users. Computers in Human Behavior 24, 5 (Sept. 2008), 2026--2042.  ",
      "doi": "10.1016/j.chb.2007.09.004"
    },
    {
      "text": "Yang, F., Yu, X., Huang, J., Yang, P., and Metaxas, D. Robust eyelid tracking for fatigue detection. In Image Processing (ICIP), 2012 19th IEEE International Conference on (2012), 1829--1832.",
      "doi": ""
    }
  ]
}