{
  "doi": "10.1145/2556288.2557359",
  "title": "Making public things: how HCI design can express matters of concern",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2397-2406",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Science studies scholar Bruno Latour suggests that contemporary democracy is shifting from \"matters of fact\"to \"matters of concern\": contentious conditions entwined with everyday life. What is the role of human-computer interaction (HCI) design in this shift' In this paper we draw from five design projects to explore how design can express matters of concern by communicating the factors and consequences of issues. In the process, we consider the role of design in contributing to the formation of publics and discuss an emerging orientation to publics in HCI design.",
  "authors": [
    {
      "name": "Carl DiSalvo",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258547",
      "orcid": "0000-0002-7344-8741"
    },
    {
      "name": "Jonathan Lukens",
      "institution": "University of Tennessee, Knoxville, TN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958839657",
      "orcid": "missing"
    },
    {
      "name": "Thomas Lodato",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959351257",
      "orcid": "missing"
    },
    {
      "name": "Tom Jenkins",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81554259456/rel-imgonly/tomj_big.jpg",
      "acmid": "81554259456",
      "orcid": "0000-0001-6135-410X"
    },
    {
      "name": "Tanyoung Kim",
      "institution": "Nokio, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959404757",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baumer, E. and M. Six Silberman. When the implication is not to design (technology). In Proc CHI 2011, ACM Press (2011), 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Beck, U. Risk Society: Towards a New Modernity. Sage, London, 1992.",
      "doi": ""
    },
    {
      "text": "Binder, T., De Michelis, G., Ehn, P., Jacucci, G., Linde, P., Wagner, I. Design Things, MIT Press, Cambridge, MA, 2012.",
      "doi": ""
    },
    {
      "text": "Björgvinsson, E., Ehn, P., and P. A. Hillgren. Participatory Design and \"Democratizing Innovation\". In Proc PDC 2010. ACM Press (2010), 41--50.  ",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Dewey, J. The Public and its Problems. Swallow Press, Chicago, 1954.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C. Design and the Construction of Publics. Design Issues 25, 1 (2009), 48--63.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C. Adversarial Design. MIT Press, Cambridge, MA, 2012. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Dourish, P., Finlay, J., Sengers, P., and P Wright. Reflective HCI: towards a critical technical practice. CHI '04 extended abstracts on Human factors in computing systems, ACM (2004), 1727--1728.  ",
      "doi": "10.1145/985921.986203"
    },
    {
      "text": "Dunne, A. and Raby, F. Design Noir: The Secret Life of Electronic Objects. Birkhäuser, Berlin, 2001.",
      "doi": ""
    },
    {
      "text": "Dunne, A. Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design. MIT Press: Cambridge, MA, 2006. ",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Ehn, P. Participation in design things. In Proc. PDC 2008, ACM Press (2008), 92--101. ",
      "doi": "10.5555/1795234.1795248"
    },
    {
      "text": "Fallman, D. Design-oriented Human-Computer Interaction. In Proc CHI 2003, ACM Press (2003), 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Feld, R. 'John Dewey,' Internet Encyclopedia of Philosophy. July 14, 2005. (Accessed Sept 17, 2013).",
      "doi": ""
    },
    {
      "text": "Gaver, G. 2012. What should we expect from research through design' In Proc CHI 2012, ACM Press (2012). AC Press, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Kim, T. and C. DiSalvo. Speculative Visualization: A New Rhetoric for Communicating Public Concerns. In Proc DRS 2010, Design Research Society (2010), n.p.",
      "doi": ""
    },
    {
      "text": "Kuznetsov, S. and E. Paulos, Participatory Sensing in Public Spaces: Activating Urban Surfaces with Sensor Probes. Proc DIS 2010, ACM Press (2010), 21--30.  ",
      "doi": "10.1145/1858171.1858175"
    },
    {
      "text": "Latour, B. \"From Realpolitik to Dingpolitik.\" In Making Things Public: Atmospheres of Democracy, Weibel, P. and B. Latour, eds. MIT Press: Cambridge MA (2005), 14--44.",
      "doi": ""
    },
    {
      "text": "Lausen, Marcia. Design for democracy: Ballot and election design. University of Chicago Press, 2008.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C. 2012. Participation and Publics: Supporting Community Engagement. In Proc CHI 2012, ACM Press (2012), 1351--1360.  ",
      "doi": "10.1145/2207676.2208593"
    },
    {
      "text": "Le Dantec, C. A., J. E. Christensen, M. Bailey, R. G. Farrell, J. B. Ellis, C. M. Danis, W. A. Kellogg, and W. K. Edwards. A tale of Two Publics: Democratizing design at the margins. In Proc DIS 2010, ACM Press (2010), 11--20.  ",
      "doi": "10.1145/1858171.1858174"
    },
    {
      "text": "Lindtner, S., and D. Li. \"Created in China: The Makings of China's Hackerspace Community.\" interactions 19.6 (2012): 18--22.  ",
      "doi": "10.1145/2377783.2377789"
    },
    {
      "text": "Lindtner, S., J. Chen, G. R. Hayes, and P. Dourish. 2011. Towards a Framework of Publics: ReEncountering Media sharing and its User. ACM Trans. Comput.-Hum. Interact. 18, 2, Article 5 (July 2011).  ",
      "doi": "10.1145/1970378.1970379"
    },
    {
      "text": "Marres, N. Material participation: Technology, the Environment and Everyday Publics. Palgrave Macmillan, New York, 2012.",
      "doi": ""
    },
    {
      "text": "Martin, A. and M. Lynch, M. (2009). Counting things and people: The practices and politics of counting. Social Problems, 56(2): 243--266.",
      "doi": ""
    },
    {
      "text": "Munson, S. and P. Resnick. 2010. Presenting Diverse Political Opinions: How and How much. In Proc CHI 2010, ACM Press (2010), 1457--1466.  ",
      "doi": "10.1145/1753326.1753543"
    },
    {
      "text": "Olander, S., Lenskjold, T., Yndigegn, S., and M. Foverskov. 2011. Mobilizing for Community Building and Everyday Innovation. interactions 18, 4: 28--32.  ",
      "doi": "10.1145/1978822.1978829"
    },
    {
      "text": "Paulos, E. 2013. The Rise of the Expert Amateur: DIY Culture and the Evolution of Computer Science. SIGPLAN Not. 48, 4 (March 2013): 153--154.  ",
      "doi": "10.1145/2490301.2451133"
    },
    {
      "text": "Sengers, P., Boehner, K., David, S., and 'Jofish' Kaye, Reflective Design. In Proc 4th Decennial Conference on Critical Computing ACM Press (2005), 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Seravalli, A. 2012. Infrastructuring for opening production, from participatory design to participatory making' In Proc PDC 2012, ACM Press (2102), 53--56.  ",
      "doi": "10.1145/2348144.2348161"
    },
    {
      "text": "Tanenbaum, J., Williams, A. Desjardins, A. and K. Tanenbaum. Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proc CHI 2013, ACM Press (2013) 2603--2612.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Wang, T. and J. 'Jofish' Kaye. 2011. Inventive leisure practices: understanding hacking communities as sites of sharing and innovation. In CHI '11 Extended Abstracts, ACM Press (2011), 263--272.  ",
      "doi": "10.1145/1979742.1979615"
    },
    {
      "text": "Warner, M. Publics and Counterpublics. Zone Books, MIT Press, Cambridge, MA, 2001.",
      "doi": ""
    },
    {
      "text": "Weibel, P. and B. Latour, eds. Making Things Public: Atmospheres of Democracy MIT Press, Cambridge, MA, 2005.",
      "doi": ""
    },
    {
      "text": "Zimmerman, J., Forlizzi, J. and Evenson, S. 2007. Research through Design as a Method for Interaction Design esearch in HCI. In Proc CHI 2007, ACM Press (2007), 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}