{
  "doi": "10.1145/2556288.2557058",
  "title": "The personal cockpit: a spatial interface for effective task switching on head-worn displays",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3171-3180",
  "year": 2014,
  "badges": [],
  "abstract": "As wearable computing goes mainstream, we must improve the state of interface design to keep users productive with natural-feeling interactions. We present the Personal Cockpit, a solution for mobile multitasking on head-worn displays. We appropriate empty space around the user to situate virtual windows for use with direct input. Through a design-space exploration, we run a series of user studies to fine-tune our layout of the Personal Cockpit. In our final evaluation, we compare our design against two baseline interfaces for switching between everyday mobile applications. This comparison highlights the deficiencies of current view-fixed displays, as the Personal Cockpit provides a 40% improvement in application switching time. We demonstrate of several useful implementations and a discussion of important problems for future implementation of our design on current and near-future wearable devices.",
  "authors": [
    {
      "name": "Barrett M. Ens",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    },
    {
      "name": "Rory Finnegan",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959288457",
      "orcid": "missing"
    },
    {
      "name": "Pourang P. Irani",
      "institution": "University of Manitoba, Winnipeg, Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Ankrum, D.R. Visual ergonomics in the office -- Guidelines. Occupational Health & Safety, 68, 7 (1999), 64--74.",
      "doi": ""
    },
    {
      "text": "Ball, R. and North, C. The effects of peripheral vision and physical navigation on large scale visualization. Proc. GI '08, (2008), 9--16. ",
      "doi": "10.5555/1375714.1375717"
    },
    {
      "text": "Bell, B.A. and Feiner, S.K. Dynamic space management for user interfaces. Proc. UIST '00, ACM (2000), 239--248.  ",
      "doi": "10.1145/354401.354790"
    },
    {
      "text": "Bell, B., Feiner, S. and Höllerer, T. View management for virtual and augmented reality. Proc. UIST '01, ACM (2001), 101--110.  ",
      "doi": "10.1145/502348.502363"
    },
    {
      "text": "Billinghurst, M., Bowskill, J., Jessop, M. and Morphett, J. A wearable spatial conferencing space. Proc. ISWC '98, IEEE (1998), 76--83. ",
      "doi": "10.5555/857199.858019"
    },
    {
      "text": "Billinghurst, M., Bowskill, J., Dyer, N. and Morphett, J. An evaluation of wearable information spaces. Proc. VRAIS '98, IEEE (1998), 20--27. ",
      "doi": "10.5555/522258.836113"
    },
    {
      "text": "Böhmer, M., Hecht, B., Schöning, J., Krüger, A. and Bauer, G. Falling asleep with Angry Birds, Facebook and Kindle -- A large scale study on mobile application usage. Proc. MobileHCI '11, (2011), 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Cao, X. and Balakrishnan, R. Interacting with dynamically defined information spaces using a handheld projector and a pen. Proc. UIST '06. ACM (2006), 225--234.  ",
      "doi": "10.1145/1166253.1166289"
    },
    {
      "text": "Cauchard, J., Löchtfeld, M., Fraser, M., Krüger, A. and Subramanian, S. m+pSpaces: Virtual workspaces in the spatially-aware mobile environment. Proc. MobileHCI '12, ACM (2012), 171--180.  ",
      "doi": "10.1145/2371574.2371601"
    },
    {
      "text": "Chan, L.W., Kao, H.S., Chen, M.Y., Lee, M.S., Hsu, J. and Hung, Y.P. Touching the void: Direct-touch interaction for intangible displays. Proc. CHI '10, ACM (2010), 2625--2634.  ",
      "doi": "10.1145/1753326.1753725"
    },
    {
      "text": "Czerwinski, M., Tan, D.S., and Robertson, G.G. Women take a wider view. Proc.CHI '02, ACM (2002), 195--202.  ",
      "doi": "10.1145/503376.503412"
    },
    {
      "text": "Feiner, S. MacIntyre, B., Haupt, M. and Solomon, E. Windows on the world: 2D windows for 3D augmented reality. Proc. UIST '93. ACM (1993), 145--155.  ",
      "doi": "10.1145/168642.168657"
    },
    {
      "text": "Fitzmaurice, G.W. Situated information spaces and spatially aware computers. Communications of the ACM 36, 7, ACM (1993), 39--49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. Proc. CHI '01, ACM (2001), 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Ha, V., Ziola, R., Wallace, J. and Inkpen, K. My MDE: Configuring virtual workspaces in multi-display environments. CHI '06 Extended Abstracts. ACM (2006), 1481--1486.  ",
      "doi": "10.1145/1125451.1125723"
    },
    {
      "text": "Hezel, P.J. and Veron, H. Head mounted displays for virtual reality. Proc. SPIE, 2218 (1994), 41--50.",
      "doi": ""
    },
    {
      "text": "Hincapié-Ramos, J.D., Guo, X., Moghadasian, P. and Irani, P. Consumed Endurance: A metric to quantify arm fatigue of mid-air interactions. Proc. CHI '14, ACM (2014), 10 pages.  ",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Hoffman, D.M., Girshick, A.R., Akeley, K. and Banks, M.S. Vergence-accomodation conflicts hinder visual performance and cause visual fatigue. Vision, 8, 3, Art. 33 (2008), 30 pages.",
      "doi": ""
    },
    {
      "text": "Kang, Y. and Stasko, J. Lightweight task/application performance using single versus multiple monitors: A comparative study. Proc. GI '08, CIPS (2008), 17--24. ",
      "doi": "10.5555/1375714.1375718"
    },
    {
      "text": "Laster SmartVision. www.laster.fr",
      "doi": ""
    },
    {
      "text": "Levia, L.A., Böhmer, M., Gehring, S. and Krüger, A. Back to the app: The costs of mobile application interrruptions. Proc. MobileHCI '12, ACM (2012), 291--294.  ",
      "doi": "10.1145/2371574.2371617"
    },
    {
      "text": "Li, F.C.Y, Dearman, D. and Truong, K.N. Virtual shelves: Interactions with orientation aware devices. Proc.UIST '09, ACM (2009), 125--128.  ",
      "doi": "10.1145/1622176.1622200"
    },
    {
      "text": "Lin, J., Duh, H. Parker, D., Abi-Rached, H and Furness, T. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. Proc. VI '02, EEEI (2002), 164--171. ",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Mayer, T., Brady, S., Bovasso, E., Pope, P. and Gatchel, R.J. Noninvasive measurement of cervical tri-planar motion in normal subjects. Spine, 18, 15 (1993), 2191--2195.",
      "doi": ""
    },
    {
      "text": "NASA-STD-3000 Man-Systems Integration Standards. Rev B, 1995.",
      "doi": ""
    },
    {
      "text": "Ni, T., Bowman, D.A, and Chen, J. Increased display size and resolution improve task performance in information-rich virtual environments. Proc. GI '06, CIPS (2006), 139--146. ",
      "doi": "10.5555/1143079.1143102"
    },
    {
      "text": "Noble, B.J., Gunnar, A.V.B., Jacobs, I., Ceci, R. and Kaiser, P. A category-ratio perceived exertion scale: Relationship to blood and muscle lactates and heart rate. Medicine and Science in Sports and Exercise, 15, 5 (1983), 523--528.",
      "doi": ""
    },
    {
      "text": "Patterson, R., Winterbottom, M. and Pierce, B. Perceptual issues in the use of head-mounted visual displays. Human Factors, 48, 3, 555--573.",
      "doi": ""
    },
    {
      "text": "Rashid, U., Nacenta, M.A. and Quigley, A. The cost of display switching: A comparison of mobile, large display and hybrid UI configurations. Proc.AVI '12, ACM (2012), 99--106.  ",
      "doi": "10.1145/2254556.2254577"
    },
    {
      "text": "Rekimoto, J. and Nagao, K. The world through the computer: Computer augmented interaction with real world environments. Proc. UIST '95, ACM (1995), 29--36.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Robertson, G. van Dantzich, M, Robbins, D., Czerwinski, M., Hinckley, K., Risden, K., Thiel, D. and Gorokhovsky, V. The task gallery: A 3D window manager. Proc. CHI '00, (2000), 494--501.  ",
      "doi": "10.1145/332040.332482"
    },
    {
      "text": "Shneiderman, B. Direct manipulation: a step beyond programming languages. IEEE Computer, 16, 8 (1983), 57--69.  ",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "Shibita, T., Kim, J., Hoffman, D.M. and Banks, M.S. The zone of comfort: Predicting visual discomfort with stereo displays. Vision, 11, 8, Art. 11 (2011), 29 pages.",
      "doi": ""
    },
    {
      "text": "Shupp, L., Ball, R., Yost, B., Booker, J. and North, C. Evaluation of viewport size and curvature of large, high-resolution displays. Proc. GI '06. CIPS (2006), 123--130. ",
      "doi": "10.5555/1143079.1143100"
    },
    {
      "text": "St. John, M., Harris, W. and Osga, G.A. Designing for multi-tasking environments: Multiple monitors versus multiple windows. Proc. HFES, SAGE (1997), 1313--1317.",
      "doi": ""
    },
    {
      "text": "Stoakley, R., Conway, M.J. and Pausch, R. Virtual reality on a WIM: Interactive worlds in miniature. Proc. CHI '95, ACM (2005), 265--272.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Su, R.E. and Bailey, B.P. Put them where? Towards guidelines for positioning large displays in interactive workspaces. Proc. INTERACT '05, Springer (2005), 337--349.  ",
      "doi": "10.1007/11555261_29"
    },
    {
      "text": "Tak, S., Cockburn, A., Humm, K., Ahlström, D., Gutwin, G. and Scarr, J. Improving window switching interfaces. Proc. INTERACT '09, Springer (2009), 187--200.  ",
      "doi": "10.1007/978-3-642-03658-3_25"
    },
    {
      "text": "Tan, D. and Czerwinski, M. Effects of visual separation and physical discontinuities when distributing information across multiple displays. Proc. INTERACT'03, (2003) 252--260.",
      "doi": ""
    },
    {
      "text": "Toet, A., Jansen, S.E.M., and Delleman, N.J. Effects of field-of-view restrictions on speed and accuracy of manoeuvring. Perceptual and Motor Skills, 105 (2008), 1245--1256.",
      "doi": ""
    },
    {
      "text": "Treisman, A. M. and Gelade, G. A feature-integration theory of attention. Cognitive psychology, 12 (1980), 97--136.",
      "doi": ""
    },
    {
      "text": "Valkov, D., Steinicke, F., Bruder, G., Schöning, J., Daiber, F. and Krüger, A. Touching floating objects in projection-based virtual reality environments. Proc. EGVE-JVRC '10, Eurographics (2010), 17--24.  ",
      "doi": "10.5555/2386062.2386066"
    },
    {
      "text": "Willemsen, P., Colton, M.B., Creem-Regehr, C. and Thompson, W.B. The effects of head-mounted display mechanical properties and field of view on distance judgments in virtual environments. Applied Perception, 6, 2, Art. 8 ACM (2009), 14 pages.  ",
      "doi": "10.1145/1498700.1498702"
    },
    {
      "text": "Yang, X.D., Mak, E., McCallum, D., Irani, P. Cao, X. and Izadi, S. LensMouse: Augmenting the mouse with an interactive touch display. Proc. CHI '10, ACM (2010), 2431--2440.  ",
      "doi": "10.1145/1753326.1753695"
    },
    {
      "text": "Yee, K. Peephole Displays: Pen interaction on spatially aware handheld computers. Proc. CHI '03, ACM (2003), 1--8.  ",
      "doi": "10.1145/642611.642613"
    }
  ]
}