{
  "doi": "10.1145/2556288.2557083",
  "title": "Monadic exploration: seeing the whole through its parts",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1535-1544",
  "year": 2014,
  "badges": [],
  "abstract": "Monadic exploration is a new approach to interacting with relational information spaces that challenges the distinction between the whole and its parts. Building on the work of sociologists Gabriel Tarde and Bruno Latour we turn to the concept of the monad as a useful lens on online communities and collections that expands the possibility for creating meaning in their navigation. While existing interfaces tend to emphasize either the structure of the whole or details of a part, monadic exploration brings these opposing perspectives closer together in continuous movements between partially overlapping points of view. We present a visualization that reflects a given node's relative position within a network using radial displacements and visual folding. To investigate the potential of monadic exploration we report on an iterative design process of a web-based visualization of a highly cross-referenced book and its six-month deployment.",
  "authors": [
    {
      "name": "Marian Dörk",
      "institution": "University of Applied Sciences Potsdam, Potsdam, Germany & Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81414607074/rel-imgonly/fhp_2019_portrait_closeup.jpg",
      "acmid": "81414607074",
      "orcid": "missing"
    },
    {
      "name": "Rob Comber",
      "institution": "Newcastle University, Newcastle Upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "Martyn Dade-Robertson",
      "institution": "School of Architecture, Planning, and Landscape, University of Newcastle, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416609218",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boyd, A., and Mitchell, D. O., Eds. Beautiful Trouble: A Toolbox For Revolution. OR Books, 2012.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Karlson, A., and Bederson, B. A review of overview+detail, zooming, and focus+context interfaces. CSUR: ACM Computing Surveys 41, 1 (2008), 1--31.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Donath, J., and boyd, d. Public displays of connection. BT Technology Journal 24 (2004), 71--82.  ",
      "doi": "10.1023/B%3ABTTJ.0000047585.06264.cc"
    },
    {
      "text": "Dörk, M., Carpendale, S., and Williamson, C. The information aneur: A fresh look at information seeking. In CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2011), 1215--1224.  ",
      "doi": "10.1145/1978942.1979124"
    },
    {
      "text": "Dörk, M., Riche, N. H., Ramos, G., and Dumais, S. Pivotpaths: Strolling through faceted information spaces. TVCG: Transactions on Visualization and Computer Graphics 18, 12 (2012), 2710--2719.",
      "doi": "10.1109/TVCG.2012.252"
    },
    {
      "text": "Fisher, D. Using egocentric networks to understand communication. Internet Computing, IEEE 9, 5 (sept.-oct. 2005), 20--28.  ",
      "doi": "10.1109/MIC.2005.114"
    },
    {
      "text": "Freeman, L. Visualizing social networks. Journal of Social Structure 1 (2000).",
      "doi": ""
    },
    {
      "text": "Frisby, D. Simmel and Since: Essays on Georg Simmel's Social Theory. Sociology: Cultural studies. Routledge, 1992.",
      "doi": ""
    },
    {
      "text": "Fruchterman, T. M., and Reingold, E. M. Graph drawing by force-directed placement. Software: Practice and experience 21, 11 (1991), 1129--1164.  ",
      "doi": "10.1002/spe.4380211102"
    },
    {
      "text": "Heer, J., and d. boyd. Vizster: Visualizing online social networks. In InfoVis 2005: Symposium on Information Visualization, IEEE (2005), 32--39.  ",
      "doi": "10.1109/INFOVIS.2005.39"
    },
    {
      "text": "Henry, N., Fekete, J., and McGuffin, M. NodeTrix: A hybrid visualization of social networks. TVCG: Transactions on Visualization and Computer Graphics (2007), 1302--1309.  ",
      "doi": "10.1109/TVCG.2007.70582"
    },
    {
      "text": "Kairam, S., MacLean, D., Savva, M., and Heer, J. Graphprism: Compact visualization of network structure. In AVI 2012: Advanced Visual Interfaces, ACM (2012), 498--505.  ",
      "doi": "10.1145/2254556.2254651"
    },
    {
      "text": "Latour, B. From aggregation to navigation: A few challenges for social theory. Closing Plenary Keynote at CHI '13, Paris, May 2, 2013.",
      "doi": ""
    },
    {
      "text": "Latour, B., Jensen, P., Venturini, T., Grauwin, S., and Boullier, D. The whole is always smaller than its parts - a digital test of Gabriel Tardes' monads. British Journal of Sociology 63, 4 (Dec 2012), 590--615.",
      "doi": ""
    },
    {
      "text": "Marchionini, G. Exploratory search: From finding to understanding. Communications of the ACM 49, 4 (2006), 41--46.  ",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Shneiderman, B. The eyes have it: A task by data type taxonomy for information visualizations. In Proc. of the IEEE Symposium on Visual Languages (1996), 336--343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Tarde, G. Monadology and Sociology. re.press, January 2012. Originally published 1893. Edited and translated by Theo Lorenc.",
      "doi": ""
    },
    {
      "text": "Thudt, A., Hinrichs, U., and Carpendale, S. The bohemian bookshelf: Supporting serendipitous book discoveries through information visualization. In CHI '12: Proc. of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2012), 1461--1470.  ",
      "doi": "10.1145/2207676.2208607"
    },
    {
      "text": "Turkle, S. Life on the Screen. Simon & Schuster, 2011.",
      "doi": ""
    },
    {
      "text": "van Ham, F., and Perer, A. \"search, show context, expand on demand\": Supporting large graph exploration with degree-of-interest. TVCG: Transactions on Visualization and Computer Graphics 15, 6 (Nov/Dec 2009), 953--960.  ",
      "doi": "10.1109/TVCG.2009.108"
    },
    {
      "text": "Wasserman, S., and Faust, K. Social network analysis: methods and applications. Cambridge University Press, 1994.",
      "doi": ""
    },
    {
      "text": "Wattenberg, M. Visual exploration of multivariate graphs. In CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2006), 811--819.  ",
      "doi": "10.1145/1124772.1124891"
    },
    {
      "text": "Wellman, B. Little boxes, glocalization, and networked individualism. In Digital cities II: Computational and sociological approaches. Springer, 2002, 10--25. ",
      "doi": "10.5555/646700.701697"
    },
    {
      "text": "Wexelblat, A., and Maes, P. Footprints: history-rich tools for information foraging. In CHI '99: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (1999), 270--277.  ",
      "doi": "10.1145/302979.303060"
    },
    {
      "text": "White, R. W., Kules, B., Drucker, S. M., and m. c. schraefel. Supporting exploratory search: Introduction. Communications of the ACM 49, 4 (2006), 36--39.  ",
      "doi": "10.1145/1121949.1121978"
    },
    {
      "text": "Yee, K.-P., Fisher, D., Dhamija, R., and Hearst, M. Animated exploration of dynamic graphs with radial layout. In InfoVis 2001: Symposium on Information Visualization (2001). ",
      "doi": "10.5555/580582.857705"
    }
  ]
}