{
  "doi": "10.1145/2556288.2557327",
  "title": "Juxtapoze: supporting serendipity and creative expression in clipart compositions",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "341-350",
  "year": 2014,
  "badges": [],
  "abstract": "Juxtapoze is a clipart composition workflow that supports creative expression and serendipitous discoveries in the shape domain. We achieve creative expression by supporting a workflow of searching, editing, and composing: the user queries the shape database using strokes, selects the desired search result, and finally modifies the selected image before composing it into the overall drawing. Serendipitous discovery of shapes is facilitated by allowing multiple exploration channels, such as doodles, shape filtering, and relaxed search. Results from a qualitative evaluation show that Juxtapoze makes the process of creating image compositions enjoyable and supports creative expression and serendipity.",
  "authors": [
    {
      "name": "William Benjamin",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501648106",
      "orcid": "missing"
    },
    {
      "name": "Senthil Chandrasegaran",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549216656",
      "orcid": "0000-0003-0561-2148"
    },
    {
      "name": "Devarajan Ramanujan",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959196257",
      "orcid": "missing"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    },
    {
      "name": "SVN Vishwanathan",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100528901",
      "orcid": "missing"
    },
    {
      "name": "Karthik Ramani",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502255",
      "orcid": "0000-0001-8639-5135"
    }
  ],
  "references": [
    {
      "text": "Ades, D. Photomontage. Society 14, 1 (1976), 13--18.",
      "doi": ""
    },
    {
      "text": "Agarwala, A., Dontcheva, M., Agrawala, M., Drucker, S., Colburn, A., Curless, B., Salesin, D., and Cohen, M. Interactive digital photomontage. ACM Transactions on Graphics 23, 3 (Aug. 2004), 294--302.  ",
      "doi": "10.1145/1015706.1015718"
    },
    {
      "text": "Bawden, D. Information systems and the stimulation of creativity. Information Science 12, 5 (1986), 203--216.  ",
      "doi": "10.1177/016555158601200501"
    },
    {
      "text": "Boyd, D., Golder, S., and Lotan, G. Tweet, tweet, retweet: Conversational aspects of retweeting on twitter. In Proceedings of the Hawaii International Conference on System Sciences (2010), 1--10.  ",
      "doi": "10.1109/HICSS.2010.412"
    },
    {
      "text": "Bruns, A. Produsage. In Proceedings of the ACM Conference on Creativity and Cognition (2007), 99--106.  ",
      "doi": "10.1145/1254960.1254975"
    },
    {
      "text": "Buxton, B. Sketching User Experiences. Morgan Kaufmann, 2007.",
      "doi": ""
    },
    {
      "text": "Chen, T., Cheng, M.-M., Tan, P., Shamir, A., and Hu, S.-M. Sketch2Photo: internet image montage. ACM Transactions on Graphics 28, 5 (2009).  ",
      "doi": "10.1145/1618452.1618470"
    },
    {
      "text": "Cobbledick, S. The information-seeking behavior of artists: Exploratory interviews. The Library Quarterly (1996), 343--372.",
      "doi": ""
    },
    {
      "text": "Eitz, M., Richter, R., Boubekeur, T., Hildebrand, K., and Alexa, M. Sketch-based shape retrieval. ACM Transactions on Graphics 31, 4 (2012).  ",
      "doi": "10.1145/2185520.2185527"
    },
    {
      "text": "Eitz, M., Richter, R., Hildebrand, K., Boubekeur, T., and Alexa, M. Photosketcher: Interactive sketch-based image synthesis. IEEE Computer Graphics and Applications 31, 6 (2011), 56--66.  ",
      "doi": "10.1109/MCG.2011.67"
    },
    {
      "text": "Erdelez, S. Information encountering: It's more than just bumping into information. Bulletin of the American Society for Information Science 25, 3 (1999), 25--29.",
      "doi": ""
    },
    {
      "text": "Foster, A. E., and Ford, N. Serendipity and information seeking: an empirical study. Journal of Documentation 59, 3 (2003), 321--340.",
      "doi": ""
    },
    {
      "text": "Gal, R., Sorkine, O., Popa, T., Sheffer, A., and Cohen-Or, D. 3D collage: expressive non-realistic modeling. In Proc. Symposium on Non-Photorealistic Animation and Rendering (2007), 7--14.  ",
      "doi": "10.1145/1274871.1274873"
    },
    {
      "text": "Gavilan, D., Saito, S., and Nakajima, M. Query-by-sketch based image synthesis. IEICE Trans. Inform. and Syst. E91-D, 9 (2008), 2341--2352.  ",
      "doi": "10.1093/ietisy/e91-d.9.2341"
    },
    {
      "text": "Hawkins, E. The complete guide to remixing. Berklee Press, 2004. ",
      "doi": "10.5555/1203602"
    },
    {
      "text": "Hemphill, C. S., and Suk, J. Remix and cultural production. Stanford Law Review 61 (2008), 1227.",
      "doi": ""
    },
    {
      "text": "Huang, H., Zhang, L., and Zhang, H.-C. Arcimboldo-like collage using internet images. ACM Transactions on Graphics 30, 6 (2011).  ",
      "doi": "10.1145/2070781.2024189"
    },
    {
      "text": "Joshi, N., Mehta, S., Drucker, S. M., Stollnitz, E. J., Hoppe, H., Uyttendaele, M., and Cohen, M. F. Cliplets: juxtaposing still and dynamic imagery. In Proceedings of the ACM Symposium on User Interface Software and Technology (2012), 251--260.  ",
      "doi": "10.1145/2380116.2380149"
    },
    {
      "text": "Kazi, R. H., Igarashi, T., Zhao, S., and Davis, R. C. Vignette: interactive texture design and manipulation with freeform gestures for pen-and-ink illustration. In Proceedings of the ACM Conference on Human Factors in Computing Systems (2012), 1727--1736.  ",
      "doi": "10.1145/2207676.2208302"
    },
    {
      "text": "Lalonde, J.-F., Hoiem, D., Efros, A. A., Rother, C., Winn, J., and Criminisi, A. Photo clip art. ACM Transactions on Graphics 26, 3 (2007), 3.  ",
      "doi": "10.1145/1276377.1276381"
    },
    {
      "text": "Lee, Y. J., Zitnick, C. L., and Cohen, M. F. ShadowDraw: real-time user guidance for freehand drawing. ACM Transactions on Graphics 30, 4 (2011).  ",
      "doi": "10.1145/2010324.1964922"
    },
    {
      "text": "Liestman, D. Chance in the midst of design: approaches to library research serendipity. Renaissance Quarterly 31, 4 (1992), 524--532.",
      "doi": ""
    },
    {
      "text": "Lowe, D. G. Object recognition from local scale-invariant features. In Proceedings of the IEEE international Conference on Computer Vision, vol. 2 (1999), 1150--1157. ",
      "doi": "10.5555/850924.851523"
    },
    {
      "text": "Marchionini, G. Exploratory search: from finding to understanding. Communications of the ACM 49, 4 (2006), 41--46.  ",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Muja, M., and Lowe, D. G. Fast approximate nearest neighbors with automatic algorithm configuration. In International Conference on Computer Vision Theory and Application (2009), 331--340.",
      "doi": ""
    },
    {
      "text": "Nehring, K., and Puppe, C. A theory of diversity. Econometrica 70, 3 (2002), 1155--1198.",
      "doi": ""
    },
    {
      "text": "Nemhauser, G. L., Wolsey, L. A., and Fisher, M. L. An analysis of approximations for maximizing submodular set functions-i. Mathematical Programming 14, 1 (1978), 265--294.",
      "doi": "10.1007/BF01588971"
    },
    {
      "text": "O'Connor, B. Fostering creativity: enhancing the browsing environment. International Journal of Information Management 8, 3 (1988), 203--210.  ",
      "doi": "10.1016/0268-4012%2888%2990063-1"
    },
    {
      "text": "Smith, A. R. Digital paint systems: An anecdotal and historical overview. IEEE Annals of the History of Computing 23, 2 (Apr. 2001), 4--30.  ",
      "doi": "10.1109/85.929908"
    },
    {
      "text": "Sutherland, I. Sketchpad: a man-machine graphical communication system. In Proceedings of the Spring Joint Computer Conference (1963), 329--346.  ",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "Thudt, A., Hinrichs, U., and Carpendale, S. The Bohemian Bookshelf: supporting serendipitous book discoveries through information visualization. In Proceedings of the ACM Conference on Human Factors in Computing Systems (2012), 1461--1470.  ",
      "doi": "10.1145/2207676.2208607"
    },
    {
      "text": "Ullman, D. G., Wood, S., and Craig, D. The importance of drawing in the mechanical design process. Computers & Graphics 14, 2 (1990), 263--274.",
      "doi": ""
    },
    {
      "text": "Wang, C., Zhang, J., Yang, B., and Zhang, L. Sketch2Cartoon: composing cartoon images by sketching. In Proceedings of the ACM Conference on Multimedia (2011), 789--790.  ",
      "doi": "10.1145/2072298.2072458"
    },
    {
      "text": "Xie, X., Xu, K., Mitra, N. J., Cohen-Or, D., Su, Q., Gong, W., and Chen, B. Sketch-to-design: Context-based part assembly. Computer Graphics Forum 32, 8 (2013), 233--245.",
      "doi": ""
    },
    {
      "text": "Zitnick, C. Binary coherent edge descriptors. In Computer Vision, K. Daniilidis, P. Maragos, and N. Paragios, Eds., vol. 6312 of Lecture Notes in Computer Science. Springer, 2010, 170--182. ",
      "doi": "10.5555/1888028.1888042"
    }
  ]
}