{
  "doi": "10.1145/2556288.2557072",
  "title": "Designing information savvy societies: an introduction to assessability",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2471-2480",
  "year": 2014,
  "badges": [],
  "abstract": "This paper provides first steps toward an empirically grounded design vocabulary for assessable design as an HCI response to the global need for better information literacy skills. We present a framework for synthesizing literatures called the Interdisciplinary Literacy Framework and use it to highlight gaps in our understanding of information literacy that HCI as a field is particularly well suited to fill. We report on two studies that lay a foundation for developing guidelines for assessable information system design. The first is a study of Wikipedians', librarians', and laypersons' information assessment practices from which we derive two important features of assessable designs: information provenance and stewardship. The second is an experimental study in which we operationalize these concepts in designs and test them using Amazon Mechanical Turk (MTurk).",
  "authors": [
    {
      "name": "Andrea Forte",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/do/10.1145/contrib-81100401804/rel-imgonly/forte150x150.jpg",
      "acmid": "81100401804",
      "orcid": "0000-0002-2941-339X"
    },
    {
      "name": "Nazanin Andalibi",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958798457",
      "orcid": "0000-0002-3257-2527"
    },
    {
      "name": "Thomas Park",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453650258",
      "orcid": "missing"
    },
    {
      "name": "Heather Willever-Farr",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496690679",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adler, B. T., Chatterjee, K., Alfaro, L. d., Faella, M., Pye, I., and Raman, V. Assigning trust to Wikipedia content. WikiSym 2008. ACM Press (2008), 1--12.  ",
      "doi": "10.1145/1822258.1822293"
    },
    {
      "text": "American Association of School Librarians, Standards for the 21st-century learner in action. American Association of School Librarians, Chicago, 2009.",
      "doi": ""
    },
    {
      "text": "Chi, E., Pirolli, P., and Pitkow, J. The scent of a site: a system for analyzing and predicting information scent, usage, and usability of a Web site. CHI (2000), 161--168.  ",
      "doi": "10.1145/332040.332423"
    },
    {
      "text": "Choi, B., Alexander, K., Kraut, R. E., and Levine, J. M. Socialization tactics in wikipedia and their effects. CSCW, ACM (2010), 107--116.  ",
      "doi": "10.1145/1718918.1718940"
    },
    {
      "text": "Cosley, D., Frankowski, D., Terveen, L., and Riedl, J. SuggestBot: using intelligent task routing to help people find work in wikipedia. in Proceedings of the 12th international conference on Intelligent user interfaces. ACM (2007), 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Erickson, T. and Kellogg, W. A., Social translucence: an approach to designing systems that support social processes. ACM Trans. Comput.-Hum. Interact., 7, 1, (2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Ericsson, K. and Simon, H., Protocol analysis: Verbal reports as data. MIT Press, Cambridge, 1993.",
      "doi": ""
    },
    {
      "text": "Farzan, R. and Kraut, R. E. Wikipedia classroom experiment: bidirectional benefits of students' engagement in online production communities. CHI. ACM (2013), 783--792.  ",
      "doi": "10.1145/2470654.2470765"
    },
    {
      "text": "Flanagin, A. and Metzger, M., The role of site features, user attributes, and information verification behaviors on the perceived credibility of web-based information. New Media and Society, 9, 2, (2007), 319--342.",
      "doi": ""
    },
    {
      "text": "Flanagin, A. and Metzger, M., Digital media and youth: unparalleled opportunity and unprecedented responsibility, in Digital Media, Youth, and Credibility, M. Metzger and A. Flanagin, Editors., MIT Press, Cambridge, MA, 2008, 5--28.",
      "doi": ""
    },
    {
      "text": "Fogg, B. J., Soohoo, C., Danielson, D. R., Marable, L., Stanford, J., and Tauber, E. R. How do users evaluate the credibility of Web sites' a study with over 2,500 participants. Proceedings of the 2003 conference on Designing for user experiences. ACM (2003), 1--15.  ",
      "doi": "10.1145/997078.997097"
    },
    {
      "text": "Forte, A. and Bruckman, A., Citing, writing and participatory media: wikis as learning environments in the high school classroom. International Journal of Learning and Media, 1, 4, (2009), 23--44.",
      "doi": ""
    },
    {
      "text": "Forte, A. and Lampe, C., Defining, Understanding and Supporting Open Collaboration: Lessons from the Literature. Am Behav Scientist, 57, 5, (2013), 535--547.",
      "doi": ""
    },
    {
      "text": "Glaser, B. and Strauss, A., The Discovery of Grounded Theory: strategies for qualitative research. Transaction Publishers, New Brunswick, 1967.",
      "doi": ""
    },
    {
      "text": "Google. Search Education. {cited Jan 4, 2014}; http://www.google.com/insidesearch/searcheducation.",
      "doi": ""
    },
    {
      "text": "IFLA and UNESCO. Information Literacy International Resources Dir. http://infolitglobal.net/directory/en/.",
      "doi": ""
    },
    {
      "text": "Jenkins, H., Purushotma, R., Weigel, M., K., C., and Robinson, A. J., Confronting the challenges of participatory culture: Media education for the 21st century. MIT Press, Cambridge, MA, 2009.",
      "doi": ""
    },
    {
      "text": "Kittur, A., Chi, E., and Suh, B. Can you ever trust a wiki' Impacting perceived trustworthiness in Wikipedia. in CSCW, ACM (2008), 477--480.  ",
      "doi": "10.1145/1460563.1460639"
    },
    {
      "text": "Kittur, A., Chi, E. H., and Suh, B. Crowdsourcing user studies with Mechanical Turk. CHI, ACM, 2008, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kuiper, E., Volman, M., and Terwel, J., The Web as an Information Resource in K-12 Education: Strategies for Supporting Students in Searching and Processing Information. Rev of Ed Research, 75, 3, (2005), 285--328.",
      "doi": ""
    },
    {
      "text": "Lampe, C., Obar, J., Ozkaya, E., Zube, P., and Velasquez, A. Classroom Wikipedia participation effects on future intentions to contribute. CSCW, ACM (2012), 403--406.  ",
      "doi": "10.1145/2145204.2145267"
    },
    {
      "text": "Lucassen, T. and Schraagen, J. M. Trust in wikipedia: how users trust information from an unknown source. in Proceedings of the 4th workshop on Information credibility. ACM (2010), 19--26.  ",
      "doi": "10.1145/1772938.1772944"
    },
    {
      "text": "McDonald, D. W., Gokhman, S., and Zachry, M. Building for social translucence: a domain analysis and prototype system. CSCW, ACM (2012), 637--646.  ",
      "doi": "10.1145/2145204.2145301"
    },
    {
      "text": "Menchen-Trevino, E. and Hargittai, E., Young Adults' Credibility Assessment of Wikipedia. Information, Communication & Society, 14, 1, (2011), 24--51.",
      "doi": ""
    },
    {
      "text": "Nielsen, J., Usability Engineering. Morgan Kaufmann, San Diego, CA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Obama, B. National Information Literacy Awareness Month, A Proclamation. 2009; Available from: http://www.whitehouse.gov/the_press_office/Presidential-Proclamation-National-Information-Literacy-Awareness-Month.",
      "doi": ""
    },
    {
      "text": "Panciera, K., Priedhorsky, R., Erickson, T., and Terveen, L. Lurking' cyclopaths': a quantitative lifecycle analysis of user behavior in a geowiki. CHI, ACM (2010), 1917--1926.  ",
      "doi": "10.1145/1753326.1753615"
    },
    {
      "text": "Peppler, K. and Kafai, Y., From SuperGoo to Scratch: Exploring creative digital media production in informal learning. Learning, Media and Tech, 32, 2, (2007), 17.",
      "doi": ""
    },
    {
      "text": "Peres, S. C., Nguyen, V., Kortum, P. T., Akladios, M., Wood, S. B., and Muddimer, A. Software ergonomics: relating subjective and objective measures. CHI, ACM (2009), 3949--3954.  ",
      "doi": "10.1145/1520340.1520599"
    },
    {
      "text": "Petrie, H. and Kheir, O. The relationship between accessibility and usability of websites. CHI, ACM (2007), 397--406.  ",
      "doi": "10.1145/1240624.1240688"
    },
    {
      "text": "Pirolli, P. and Card, S., Information Foraging. Psychological Review, 106, 4, (1999), 32.",
      "doi": ""
    },
    {
      "text": "Schwarz, J. and Morris, M. Augmenting web pages and search results to support credibility assessment. CHI, ACM (2011), 1245--1254.  ",
      "doi": "10.1145/1978942.1979127"
    },
    {
      "text": "Seidman, I., Interviewing as Qualitative Research: a guide for researchers in education and the social sciences. Teachers College Press, New York, 2006.",
      "doi": ""
    },
    {
      "text": "Singh, V., Johri, A., and Mitra, R. Types of newcomers in an online developer community. Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM (2011), 717--720.  ",
      "doi": "10.1145/1958824.1958953"
    },
    {
      "text": "Sormunen, E., Eriksson, H., and Kurkipää, T., Wikipedia and wikis as forums of information literacy instruction in schools, in The Road to Information Literacy: Librarians as facilitators of learning, R. Gwyer, R. Stubbings, and G. Walton, Editors, International Federation of Library Associations and Institutions, 2012, 311--330.",
      "doi": ""
    },
    {
      "text": "St. Jean, B., Rieh, S. Y., Yang, J. Y., and Kim, Y.-., How content contributors assess and establish credibility on the web. ASIS&T, 48, 1, (2011), 1--11.",
      "doi": ""
    },
    {
      "text": "Suh, B., Chi, E., Kittur, A., and Pendleton, B. A. Lifting the veil: improving accountability and social transparency in Wikipedia with WikiDashboard. CHI, ACM (2008), 1037--1040.  ",
      "doi": "10.1145/1357054.1357214"
    },
    {
      "text": "Sundar, S. S., The MAIN model: A heuristic approach to understanding technology effects on credibility. Digital media, youth, and credibility, (2008), 73--100.",
      "doi": ""
    },
    {
      "text": "Towne, W. B., Kittur, A., Kinnaird, P., and Herbsleb, J. Your process is showing: controversy management and perceived quality in wikipedia. CSCW, ACM (2013), 1059--1068.  ",
      "doi": "10.1145/2441776.2441896"
    },
    {
      "text": "Wales, J. Opening Remarks. Wikimania (2006).",
      "doi": ""
    },
    {
      "text": "Yamamoto, Y. and Tanaka, K. Enhancing credibility judgment of web search results. CHI, ACM (2011), 1235--1244.  ",
      "doi": "10.1145/1978942.1979126"
    }
  ]
}