{
  "doi": "10.1145/2556288.2556978",
  "title": "Using personal examples to improve risk communication for security & privacy decisions",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "2647-2656",
  "year": 2014,
  "badges": [],
  "abstract": "IT security systems often attempt to support users in taking a decision by communicating associated risks. However, a lack of efficacy as well as problems with habituation in such systems are well known issues. In this paper, we propose to leverage the rich set of personal data available on smartphones to communicate risks using personalized examples. Examples of private information that may be at risk can draw the users' attention to relevant information for a decision and also improve their response. We present two experiments that validate this approach in the context of Android app permissions. Private information that becomes accessible given certain permissions is displayed when a user wants to install an app, demonstrating the consequences this installation might have. We find that participants made more privacy-conscious choices when deciding which apps to install. Additionally, our results show that our approach causes a negative affect in participants, which makes them pay more attention.",
  "authors": [
    {
      "name": "Marian Harbach",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440615669",
      "orcid": "missing"
    },
    {
      "name": "Markus Hettig",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959363057",
      "orcid": "missing"
    },
    {
      "name": "Susanne Weber",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959436257",
      "orcid": "missing"
    },
    {
      "name": "Matthew Smith",
      "institution": "Leibniz University Hannover, Hannover, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81485645929",
      "orcid": "0000-0002-2724-1379"
    }
  ],
  "references": [
    {
      "text": "Au, K. W. Y., Zhou, Y. F., Huang, Z., and Lie, D. PScout: Analyzing the Android Permission Specification. In Proc. CCS (2012).  ",
      "doi": "10.1145/2382196.2382222"
    },
    {
      "text": "Besmer, A., Lipford, H. R., Shehab, M., and Cheek, G. Social Applications: Exploring A More Secure Framework. In Proc. SOUPS (2009).  ",
      "doi": "10.1145/1572532.1572535"
    },
    {
      "text": "Blackwell, A. F., Church, L., and Green, T. The Abstract is 'an Enemy'. In Proc. Psychology of Programming Interest Group (PPIG) Workshop (2008).",
      "doi": ""
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L., Downs, J., and Komanduri, S. What Is Still Wrong With Security Warnings: A Mental Models Approach. In Proc. SOUPS (2010).",
      "doi": ""
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L., Downs, J., and Komanduri, S. Bridging the Gap in Computer Security Warnings: A Mental Model Approach. Security Privacy, IEEE 9, 2 (2011), 18--26.  ",
      "doi": "10.1109/MSP.2010.198"
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L. F., Downs, J., Komanduri, S., Reeder, R. W., Schechter, S., and Sleeper, M. Your Attention Please: Designing Security-Decision UIs to Make Genuine Risks Harder to Ignore. In Proc. SOUPS (2013).  ",
      "doi": "10.1145/2501604.2501610"
    },
    {
      "text": "Bravo-Lillo, C., Cranor, L. F., Downs, J., Komanduri, S., and Sleeper, M. Improving Computer Security Dialogs. In Proc. INTERACT (2011). ",
      "doi": "10.5555/2042283.2042286"
    },
    {
      "text": "Cranor, L. A Framework for Reasoning About the Human in the Loop. UPSEC (2008). ",
      "doi": "10.5555/1387649.1387650"
    },
    {
      "text": "De Paula, R., Ding, X., Dourish, P., Nies, K., Pillet, B., Redmiles, D., Ren, J., Rode, J., et al. Two Experiences Designing for Effective Security. In Proc. SOUPS (2005).  ",
      "doi": "10.1145/1073001.1073004"
    },
    {
      "text": "Egelman, S. My Profile Is My Password, Verify Me! The Privacy/Convenience Tradeoff of Facebook Connect. In Proc. CHI (2013).  ",
      "doi": "10.1145/2470654.2481328"
    },
    {
      "text": "Egelman, S., Cranor, L. F., and Hong, J. Youfive Been Warned: An Empirical Study of the Effectiveness of Web Browser Phishing Warnings. In Proc. CHI (2008).  ",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "Felt, A. P., Chin, E., Hanna, S., and Wagner, D. Android Permissions Demystified. In Proc. CCS (2011).  ",
      "doi": "10.1145/2046707.2046779"
    },
    {
      "text": "Felt, A. P., Ha, E., Egelman, S., Haney, A., Chin, E., and Wagner, D. Android Permissions: User Attention, Comprehension, and Behavior. In Proc. SOUPS (2012).  ",
      "doi": "10.1145/2335356.2335360"
    },
    {
      "text": "Harbach, M., Fahl, S., Yakovleva, P., and Smith, M. Sorry, I Don't Get It: An Analysis of Warning Message Texts. In Proc USEC (2013).",
      "doi": ""
    },
    {
      "text": "Hayashi, E., Riva, O., Strauss, K., Brush, A. J. B., and Schechter, S. Goldilocks and the Two Mobile Devices: Going Beyond All-Or-Nothing Access to a Device's Applications. In Proc. SOUPS (2012).  ",
      "doi": "10.1145/2335356.2335359"
    },
    {
      "text": "Inglesant, P., Sasse, M. A., Chadwick, D., and Shi, L. L. Expressions of Expertness. In Proc. SOUPS (2008).",
      "doi": "10.1145/1408664.1408675"
    },
    {
      "text": "Karat, C.-M., Karat, J., Brodie, C., and Feng, J. Evaluating Interfaces for Privacy Policy Rule Authoring. In Proc. CHI (2006).  ",
      "doi": "10.1145/1124772.1124787"
    },
    {
      "text": "Kelley, P. G., Cranor, L. F., and Sadeh, N. Privacy as Part of the App Decision-Making Process. In Proc. CHI (2013).  ",
      "doi": "10.1145/2470654.2466466"
    },
    {
      "text": "Kumaraguru, P., and Cranor, L. F. Privacy indexes: A Survey of Westin's Studies. Tech. Rep. Carnegie Mellon University-ISRI-5--138, Carnegie Mellon University, 2005.",
      "doi": ""
    },
    {
      "text": "Pandita, R., Xiao, X., Yang, W., Enck, W., and Xie, T. WHYPER: Towards Automating Risk Assessment of Mobile Applications. In Proc. USENIX Security Symposium (2013). ",
      "doi": "10.5555/2534766.2534812"
    },
    {
      "text": "Rader, E., Wash, R., and Brooks, B. Stories as Informal Lessons About Security. In Proc. SOUPS (2012).  ",
      "doi": "10.1145/2335356.2335364"
    },
    {
      "text": "Raja, F., Hawkey, K., Hsu, S., Wang, K., and Beznosov, K. A Brick Wall, a Locked Door, and a Bandit: A Physical Security Metaphor for Firewall Warnings. In Proc. SOUPS (2011).  ",
      "doi": "10.1145/2078827.2078829"
    },
    {
      "text": "Sunshine, J., Egelman, S., Almuhimedi, H., Atri, N., and Cranor, L. F. Crying Wolf: An Empirical Study of SSL Warning Effectiveness. In Proc. USENIX Security Symposium (2009). ",
      "doi": "10.5555/1855768.1855793"
    },
    {
      "text": "Wogalter, M., Dejoy, D. M., and Laughery, K. R. A Consolidated Communication-Human Information Processing (C-HIP) Model. Warnings and Risk Communication (1999), 15'23.",
      "doi": ""
    },
    {
      "text": "Wogalter, M. S., Racicot, B. M., Kalsher, M. J., and Noel Simpson, S. Personalization of Warning Signs: The Role of Perceived Relevance on Behavioral Compliance. International Journal of Industrial Ergonomics 14, 3 (1994).",
      "doi": ""
    }
  ]
}