{
  "doi": "10.1145/2556288.2557013",
  "title": "Overload is overloaded: email in the age of Gmail",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "793-802",
  "year": 2014,
  "badges": [],
  "abstract": "The term email overload has two definitions: receiving a large volume of incoming email, and having emails of different status types (to do, to read, etc). Whittaker and Sidner proposed the latter definition in 1996, noticing that email inboxes were far more complex than simply containing incoming messages. Sixteen years after Whittaker and Sidner, we replicate and extend their work with a qualitative analysis of Google's Gmail. We find that email overload, both in terms of volume and of status, is still a problem today. Our contributions are 1) updating the state of email overload, 2) extending our understanding of overload in the context of Gmail and 3) comparing personal with work email accounts: while work email tends to be status overloaded, personal email is also type overloaded. These comparisons between work and personal email suggest new avenues for email research.",
  "tags": [
    "email overload",
    "organization",
    "management strategies",
    "work and personal email",
    "qualitative study"
  ],
  "authors": [
    {
      "name": "Catherine Grevet",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460650719",
      "orcid": "missing"
    },
    {
      "name": "David Choi",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502733881",
      "orcid": "missing"
    },
    {
      "name": "Debra Kumar",
      "institution": "Google, Inc., Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958779057",
      "orcid": "missing"
    },
    {
      "name": "Eric Gilbert",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489255",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., and Smith, I. Taking email to task: The design and evaluation of a task management centered email tool. Proc. CHI, 2003. 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M., Smith, I., and Grinter, R. Quality vs. quantity: Email-centric task- management and its relationship with overload. Human-Computer Interaction, 2005. 20(1-2): 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Civan, A., Jones, W., Klasnja, P., and Bruce, H. Better to organize personal information by folders or by tags : The devil is in the details. Proc. ASIS&T, 2008.",
      "doi": ""
    },
    {
      "text": "comScore, It's a Social World: Top 10 Need-to-Knows About Social Networking and Where It's Headed, in comScore Whitepaper. December 2011.",
      "doi": ""
    },
    {
      "text": "comScore, Digital Omnivores: How Tablets, Smartphones and Connected Devices are Changing U.S. Digital Media Consumption Habits, in comScore Whitepaper. October 2011.",
      "doi": ""
    },
    {
      "text": "Dabbish, L. A., Kraut, R. E. Email Overload at Work: An Analysis of Factors Associated with Email Strain. Proc. CSCW, 2006. 431--440.  ",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Donath, J. 2004. Visualizing Email Archives (Draft).",
      "doi": ""
    },
    {
      "text": "Ducheneaut, N., Belloti, V. Email as a Habitat: an exploration of embedded personal information management. Interactions. September 2001. 30--38.  ",
      "doi": "10.1145/382899.383305"
    },
    {
      "text": "Fisher, D., Brush, A. J., Gleave, E., and Smith, M. Revisiting Whittaker & Sidner's \"Email Overload\" Ten Years Later. Proc. CSCW, 2006. 309--312.  ",
      "doi": "10.1145/1180875.1180922"
    },
    {
      "text": "Hogan, B., Fisher, D., A Scale for Measuring Email Overload. Microsoft Research Technical Report. 2006.",
      "doi": ""
    },
    {
      "text": "Kaye, J., Vertesi, J., Avery, S., Dafoe, A., David, S., Onaga, L., Rosero, I., and Pinch, T. To have and to hold: Exploring personal archive. Proc. CHI, 2006. 275--284.  ",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "Mackay, W. More than Just a Communication System: Diversity in the Use of Electronic Mail. Proc. CSCW, 1998. 344--353.  ",
      "doi": "10.1145/62266.62293"
    },
    {
      "text": "Pichai, S. Chrome & Apps @ Google I/O: Your web, everywhere. Google Official Blog. 2012.",
      "doi": ""
    },
    {
      "text": "Renaud, K., Ramsay, J., and Hair, M. \"You've Got EMail!\"... Shall I Deal With It Now? Electronic Mail From the Recipient's Perspective. International Journal Of Human-Computer Interaction, 2006. 21: 313--332.",
      "doi": ""
    },
    {
      "text": "Rodden, K., Leggett, M. Best of Both Worlds: Improving Gmail Labels with the Affordances of Folders. In Proc. CHI Extended Abstracts, 2010.  ",
      "doi": "10.1145/1753846.1754199"
    },
    {
      "text": "Shen, J., O. Brdiczka, and Y. Ruan, A comparison study of user behavior on Facebook and Gmail. Computers in Human Behavior, 2013. 29: 2650--2655.  ",
      "doi": "10.1016/j.chb.2013.06.043"
    },
    {
      "text": "Venolia, G., Neustaedter, C. Understanding sequence and reply relationships within email conversations: A mixed-model visualization. Proc. CHI, 2003. 361--368.  ",
      "doi": "10.1145/642611.642674"
    },
    {
      "text": "Wellman, B., Quan Haase, A., Witte, J., and Hampton, K. Does the Internet Increase, Decrease, or Supplement Social Capital American Behavioral Scientist, 2001. 45: 436--455.",
      "doi": ""
    },
    {
      "text": "Whittaker, S., Matthews, T., Cerruti, J., Badenes, H., and Tang, J. Am I wasting my time organizing email? A study of email refinding. Proc. CHI, 2001. 3449--3458.  ",
      "doi": "10.1145/1978942.1979457"
    },
    {
      "text": "Whittaker, S., Sidner, C. Email overload, exploring personal information management of email. Proc. CHI, 1996. 276--283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}