{
  "doi": "10.1145/2556288.2557103",
  "title": "Taking part: role-play in the design of therapeutic systems",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "643-652",
  "year": 2014,
  "badges": [],
  "abstract": "Gaining an understanding of user needs is a central component of HCI design approaches such as user-centred design and participatory design. In some settings, such as mental health care, access to end-users is often constrained. This is a particular difficulty given that the experience of those with mental illness can be difficult for researchers to understand, and is further complicated by its associated stigma. In addition, the therapeutic setting is outside the common experience of most people and protected from outside intrusion. Although role-play has been used in varied ways in HCI, rarely has it been defined with sufficient clarity to enable others to deploy it in a nuanced manner. We argue that role-play is particularly suited for use in mental healthcare settings and, when used judiciously, can address some of the difficulties associated with working in this setting. This paper details a range of role-play formats appropriated from therapeutic role-play, drawing upon the HCI and mental health literature, therapist input and our experience of using role-play for a number of purposes at different stages of the development process. We consider how and why role-play can be used to generate empathy, gain understanding of therapy, provide feedback on designs before clinical use and help train therapists in using technology in the treatment room.",
  "authors": [
    {
      "name": "Mark Matthews",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339516407",
      "orcid": "missing"
    },
    {
      "name": "Geri Gay",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367597457",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College, The University of Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Boess, S. U., First steps in role playing. In Proc. CHI '08, ACM Press (2008).  ",
      "doi": "10.1145/1358628.1358632"
    },
    {
      "text": "Boyd-Graber, J. L., et al., Participatory design with proxies: developing a desktop-PDA system to support people with aphasia. In Proc. CHI 2006, ACM Press (2006).  ",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Brandt, E. and C. Grunnet, Evoking the Future: Drama and Props in User Centered Design. In Proc. Participatory Design Conference (2000).",
      "doi": ""
    },
    {
      "text": "Buchenau, M. and J. Fulton Suri, Experience Prototyping. In Proc. DIS2000. ACM Press (2000).  ",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Burns, C., E. Dishman, W. Verplank, and B. Lassiter, Actors, hairdos & videotape; informance design. In Proc. CHI 1994, ACM Press (1994).  ",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Corsini, R. J., Role playing in psychotherapy. 2010: Transaction Books.",
      "doi": ""
    },
    {
      "text": "Darroch, R. K. and I. D. Steiner, Role-playing: An alternative to laboratory research? Journal of Personality, 1970. 38(2): p. 302--311.",
      "doi": ""
    },
    {
      "text": "Davidoff, S., M. Lee, A. Dey, and J. Zimmerman, Rapidly exploring application design through speed dating. In Proc. UbiComp 2007, p. 429--446 (2007). ",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Doherty, G., D. Coyle, and M. Matthews, Design and evaluation guidelines for mental health technologies. Interacting With Computers, 2010. 22(4): p. 243--252.  ",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "Gallagher, M. S. and O. D. W. Hargie, An investigation into the validity of role play as a procedure for counsellor skill assessment. British Journal of Guidance & Counselling, 1989. 17(2): p. 155--165.",
      "doi": ""
    },
    {
      "text": "Hancock, M., T. ten Cate, S. Carpendale, and T. Isenberg, Supporting sandtray therapy on an interactive tabletop. In Proc. CHI 2010. ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753651"
    },
    {
      "text": "Iacucci, G., C. Iacucci, and K. Kuutti. Imagining and experiencing in design, the role of performances. In Proc. NordiCHI '02. ACM Press (2002).  ",
      "doi": "10.1145/572020.572040"
    },
    {
      "text": "Janis, I. L. and B. T. King, The influence of role playing on opinion change. The Journal of Abnormal and Social Psychology, 1954. 49(2): p. 211--218.",
      "doi": ""
    },
    {
      "text": "Kendall, P. C., et al., Considering CBT with anxious youth? Think exposures. Cognitive and Behavioral Practice, 2005. 12(1): p. 136--148.",
      "doi": ""
    },
    {
      "text": "Kuutti, K., G. Iacucci, and C. Iacucci. Acting to Know: Improving Creativity in the Design of Mobile Services by Using Performances. In Proc. Creativity & Cognition '02. ACM (2002).  ",
      "doi": "10.1145/581710.581726"
    },
    {
      "text": "Liddle, H. A., D. C. Breunlin, and R. C. Schwartz, eds. Handbook of family therapy training and supervision 1988, The Guilford Press.",
      "doi": ""
    },
    {
      "text": "Matthews, M. and G. Doherty, In the mood: engaging teenagers in psychotherapy using mobile phones. In Proc. CHI 2008. ACM Press (2011).  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Matthews, M., G. Doherty, and J. Sharry. My Mobile Story: supporting content creation and analysis in mental health interventions. In Proc. CHI 2008. ACM Press (2008).",
      "doi": ""
    },
    {
      "text": "Medler, B. and B. Magerko, The implications of improvisational acting and role-playing on design methodologies. In Proc. CHI 2010. ACM Press (2010).  ",
      "doi": "10.1145/1753326.1753398"
    },
    {
      "text": "Moreno, J. L., Who shall survive?: A new approach to the problem of human interrelations. 1934: Nervous and Mental Disease Publishing Co.",
      "doi": ""
    },
    {
      "text": "Newell, A. F., A. Carmichael, M. Morgan, and A. Dickinson, The use of theatre in requirements gathering and usability studies. Interacting with Computers, 2006. 18(5): p. 996--1011.  ",
      "doi": "10.1016/j.intcom.2006.05.003"
    },
    {
      "text": "Nikendei, C., et al., Integration of role-playing into technical skills training: a randomized controlled trial. Medical Teacher, 2007. 29 (9-10): p. 956--960.",
      "doi": ""
    },
    {
      "text": "Pykhtina, O., et al., Magic land: the design and evaluation of an interactive tabletop supporting therapeutic play with children. In Proc. DIS 2012. ACM Press (2012).  ",
      "doi": "10.1145/2317956.2317978"
    },
    {
      "text": "Sato, S. and T. Salvador, Methods & tools: Playacting and focus troupes: theater techniques for creating quick, intense, immersive, and engaging focus group sessions. interactions, 1999. 6(5): p. 35--41.  ",
      "doi": "10.1145/312683.312715"
    },
    {
      "text": "Simsarian, K. T., Take it to the next stage: the roles of role playing in the design process. In Proc. CHI 03. ACM Press (2003).  ",
      "doi": "10.1145/765891.766123"
    },
    {
      "text": "Wolpe, J., The practice of behavior therapy. 1973: Pergamon.",
      "doi": ""
    },
    {
      "text": "Wright, P. and J. McCarthy, Empathy and experience in HCI. In Proc. CHI 2008. ACM Press (2008).  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "Yardley-Matwiejczuk, K. M., Role play: theory and practice. 1997: Sage Publications Ltd.",
      "doi": ""
    }
  ]
}