{
  "doi": "10.1145/2556288.2557419",
  "title": "The influence of aesthetics in usability testing: the case of dual-domain products",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "21-30",
  "year": 2014,
  "badges": [],
  "abstract": "An experimental study examined whether the effects of aesthetic appeal on usability test outcomes are moderated by usage domain. The aesthetic appeal of a cell phone was experimentally manipulated in both home- and work-based usage domains. The two usage domains were modeled in a usability laboratory. 60 participants completed a series of typical cell phone user tasks. Dependent measures such as performance, perceived usability, and emotion were taken. The results showed that aesthetic appeal had a positive effect on perceived usability but a negative effect on performance. The effects of aesthetic appeal on usability test outcomes were not moderated by usage domain. The results of this study imply that it may be sufficient to test dual-domain products in only one of their usage domains.",
  "tags": [
    "usability test",
    "usage domain",
    "user performance",
    "perceived usability",
    "product aesthetics"
  ],
  "authors": [
    {
      "name": "Andreas Sonderegger",
      "institution": "University of Fribourg, Fribourg, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458852357",
      "orcid": "missing"
    },
    {
      "name": "Andreas Uebelbacher",
      "institution": "University of Fribourg, Fribourg, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958734257",
      "orcid": "missing"
    },
    {
      "name": "Manuela Pugliese",
      "institution": "University of Fribourg, Fribourg, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959292957",
      "orcid": "missing"
    },
    {
      "name": "Juergen Sauer",
      "institution": "University of Fribourg, Fribourg, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81464669857",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beatty, J. E., Torbert, W. R. (2003) The false duality of work and leisure. J Manage Inq 12 (3): 239--252.",
      "doi": ""
    },
    {
      "text": "Ben-Bassat, T., Meyer, J., Tractinsky, N. (2006) Economic and subjective measures of the perceived value of aesthetics and usability. ACM T Comput-Hum Int 13 (2): 210--234.  ",
      "doi": "10.1145/1165734.1165737"
    },
    {
      "text": "Bevan, N. (2006) Practical issues in usability measurement. Interact 13 (6): 42--43.  ",
      "doi": "10.1145/1167948.1167976"
    },
    {
      "text": "Brady, L., Phillips, C. (2003) Aesthetics and usability: a look at color and balance. Usability News 5(1).",
      "doi": ""
    },
    {
      "text": "Brave, S., Nass, C. (2003) Emotion in human computer interaction. In: Sears, A., Jacko, J. A. (eds.) The human computer interaction handbook: fundamentals, evolving technologies and emerging applications. Lawrence Erlbaum Associates, New Jersey, pp. 81--96. ",
      "doi": "10.5555/772072.772081"
    },
    {
      "text": "Chang, H. C., Lai, H. H., Chang, Y. M. (2007) A measurement scale for evaluating the attractiveness of a passenger car form aimed at young consumers. Int J Ind Ergonom 37 (1): 21--30.",
      "doi": ""
    },
    {
      "text": "Chawda, B., Craft, B., Cairns, P., Rüger, S., Heesch, D. (2005). Do \"Attractive Things Work Better\"? An Exploration of Search Tool Visualisations. In N. McKinnon, L., Bertelsen, O. B. (eds), Proceedings of 19th British HCI Group Annual Conference (HCI2005). Edinburgh, UK, pp. 2--5.",
      "doi": ""
    },
    {
      "text": "Connell, I. W., Blandford, A. E., Green, T. R. G. (2004) CASSM and cognitive walkthrough: usability issues with ticket vending machines. Behav Inform Technol 23 (5): 307--320.",
      "doi": ""
    },
    {
      "text": "Crilly, N., Moultrie, J., Clarkson, P. J. (2004) Seeing things: consumer response to the visual domain in product design. Des Stud 25 (6): 547--577.",
      "doi": ""
    },
    {
      "text": "Csíkszentmihályi, M. (1997) Finding flow: The psychology of engagement with everyday life. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Dedeoglu, A. O. (2004) The symbolic use of mobile telephone among Turkish consumers. J Euro-Mark, 13: 143--162.",
      "doi": ""
    },
    {
      "text": "Desmet, P. M. A., Hekkert, P. (2002) The basis of product emotions. In: Green, W. S., Jordan, P. W. (eds) Pleasure with Products: Beyond Usability. Taylor & Francis, London, pp. 60--68.",
      "doi": ""
    },
    {
      "text": "Dion, K., Berscheid, E., Walster, E. (1972) What is beautiful is good. J Exp Soc Psychol, 24 (3): 285--290.",
      "doi": ""
    },
    {
      "text": "Garrett, J. J. (2002) Elements of user experience. New Riders Press, Indianapolis. ",
      "doi": "10.5555/1014891"
    },
    {
      "text": "Hartmann, J., Sutcliffe, A., de Angeli, A. (2007). Investigating Attractiveness in Web User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, San Jose, April 28-May 3. San Jose, USA: ACM New York, USA, pp. 387--396.  ",
      "doi": "10.1145/1240624.1240687"
    },
    {
      "text": "Hassenzahl, M., Monk, A. (2010) The Inference of Perceived Usability From Beauty. Hum-Comput Interact 25(3): 235--260.",
      "doi": ""
    },
    {
      "text": "Haworth, J. T., Vea, A. J. (2004) Work and leisure. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Hekkert, P., Snelders, D., van Wieringen, P. C. W. (2003) Most advanced, yet acceptable: typicality and novelty as joint predictors of aesthetic preference. Brit J Psychol, 94: 111--124.",
      "doi": ""
    },
    {
      "text": "Helander, M. G., Khalid, H. M. (2006) Affective and pleasurable design. In: Salvendy, G. (ed) Handbook of Human Factors and Ergonomics. Wiley Interscience, New York, pp. 543--572.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K., Law, EL-C. (2007) Meta-analysis of correlations among usability measures. In Proceedings of the SIGCHI conference on Human factors in computing systems CHI '07, San Jose, USA. ACM: New York, pp. 617--626.  ",
      "doi": "10.1145/1240624.1240722"
    },
    {
      "text": "Jordan, P. W. (2000) Designing Pleasurable Products. Taylor & Francis, London.",
      "doi": ""
    },
    {
      "text": "Krohne, H. W., Egloff, B., Kohlmann, C. W., Tausch, A. (1996) Untersuchungen mit einer deutschen Version der \"Positive and Negative Affective Schedule\" (PANAS). Diagnostica 42 (2): 139--156.",
      "doi": ""
    },
    {
      "text": "Kurosu, M., Kashimura, K. (1995) Apparent usability vs. inherent usability: experimental analysis on the determinants of the apparent usability. Conference companion on human factors in computing systems. ACM, New York, pp. 292--293.  ",
      "doi": "10.1145/223355.223680"
    },
    {
      "text": "Lavie, T., Tractinsky, N. (2004) Assessing dimensions of perceived visual aesthetics of web sites. Int J HumComput St 60 (3): 269--298.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "Leder, H., Belke, B., Oeberst, A., Augustin, D. (2004) A model of aesthetic appreciation and aesthetic judgments. British journal of psychology, 95(4) 489--508.",
      "doi": ""
    },
    {
      "text": "Lewis, J. R. (2002) Psychometric evaluation of the PSSUQ: Using data from five years of usability studies. J Hum-Comput Interact 14 (3-4): 463--488.",
      "doi": ""
    },
    {
      "text": "Liu, Y. (2003) Engineering aesthetics and aesthetic ergonomics: theoretical foundations and a dual-process research methodology. Ergonomics 46 (13-14): 1273--1292.",
      "doi": ""
    },
    {
      "text": "Maguire, M. (2001) Methods to support human-centred design. Int J Comput St 55: 587--634.  ",
      "doi": "10.1006/ijhc.2001.0503"
    },
    {
      "text": "Moshagen, M., Musch, J., Göritz, A. S. (2009) A blessing, not a curse: Experimental evidence for beneficial effects of visual aesthetics on performance. Ergonomics 52 (10): 1311--1320.",
      "doi": ""
    },
    {
      "text": "Nakarada-Kordic, I., Lobb, B. (2005) Effect of perceived attractiveness of web interface design on visual search of web sites. In Proceedings of the 6th ACM SIGCHI CHINZ '05. ACM: New York, pp. 25--27.  ",
      "doi": "10.1145/1073943.1073949"
    },
    {
      "text": "Ngo, D. C. L., Teo, L. S., Byrne, J. G. (2003) Modelling interface aesthetics. Inf Sci 152: 25---46.  ",
      "doi": "10.1016/S0020-0255%2802%2900404-8"
    },
    {
      "text": "Norman, D. A. (2004) Emotional design: why we love (or hate) everyday things. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Porat, T., Tractinsky, N. (2012) It's a pleasure buying here: The effects of web-store design on consumer's emotions and attitudes. Hum-Comput Interact 27(3), 235--276.",
      "doi": ""
    },
    {
      "text": "Postrel, V. (2003) The substance of style: how the rise of aesthetic value is remaking a commerce, culture and consciousness. Harper Collins Publishing, New York.",
      "doi": ""
    },
    {
      "text": "Prentice, D. A. (1987) Psychological correspondence of possessions, attitudes, and values. J Pers Soc Psychol 53: 993--1003.",
      "doi": ""
    },
    {
      "text": "Prümper, J., Heinbokel, T., & Küting, H. J. (1993) Virtuelle Prototypen als Werkzeuge zur benutzerzentrierten Produktentwicklung. Anwendung einer handlungstheoretischen Fehlertaxonomie auf reale und simulierte Oberflächen von Waschmaschinen. Z Arbwiss 4:160--167.",
      "doi": ""
    },
    {
      "text": "Reinecke, K., Yeh, T., Miratrix, L., Mardiko, R., Zhao, Y., Liu, J., Gajos, K. Z. (2013) Predicting users' first impressions of website aesthetics with a quantification of perceived visual complexity and colorfulness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI'13. ACM: New York, pp. 2049--2058.  ",
      "doi": "10.1145/2470654.2481281"
    },
    {
      "text": "Rheinberg, F., Manig, Y., Kliegl, R., Engeser, S., Vollmeyer, R. (2007) Flow bei der Arbeit, doch Glück in der Freizeit. Z Arb Organ Psychol 51 (3): 105--115.",
      "doi": ""
    },
    {
      "text": "Rafaeli, A., Vilnai-Yavetz, I. (2004) Instrumentality, aesthetics and symbolism of physical artefacts as triggers of emotion. Theor Issue in Ergonomics Sci 5 (1): 91--112.",
      "doi": ""
    },
    {
      "text": "Sauer, J., Wastell, D., Schmeink, C. (2009) Designing for the home: a comparative study of support aids for central heating systems. Appl Ergonomics 40: 165--174.",
      "doi": ""
    },
    {
      "text": "Sauer, J., Sonderegger, A. (2009) The influence of prototype fidelity and aesthetics of design in usability tests: effects on user behaviour, subjective evaluation and emotion. Appl Ergonomics 40: 670--677.",
      "doi": ""
    },
    {
      "text": "Sauer, J., Sonderegger, A. (2011) The influence of product aesthetics and user state in usability testing. Behav Inform Technol 30: 787--796.",
      "doi": ""
    },
    {
      "text": "Schenkman, B. N., Jönsson, F. U. (2000) Aesthetics and preferences of web pages. Behav Inform Technol19 (5): 367--377.",
      "doi": ""
    },
    {
      "text": "Sonderegger, A., Sauer, J. (2010) The influence of design aesthetics in usability testing: effects on user performance and perceived usability. Appl Ergonomics 41: 403--410.",
      "doi": ""
    },
    {
      "text": "Sonderegger, A., Sauer, J. (2013) The influence of sociocultural background and product value in usability testing. Appl Ergonomics 44: 341--349.",
      "doi": ""
    },
    {
      "text": "Sonderegger, A., Sauer, J., Eichenberger, J. (in press) Expressive and classical aesthetics: two distinct concepts with highly similar effect patterns in userartefact interaction. Behav Inform Technol.",
      "doi": ""
    },
    {
      "text": "Sonderegger, A., Zbinden, G., Uebelbacher, A., Sauer, J. (2012) The influence of product aesthetics and usability over the course of time: a longitudinal field experiment. Ergonomics 55(7), 713--730.",
      "doi": ""
    },
    {
      "text": "Thielsch, M. T., Blotenberg, I., Jaron, R. (2013) User Evaluation of Websites: From First Impression to Recommendation. Interact. Comput., 26(1): 89--102.",
      "doi": ""
    },
    {
      "text": "Thüring, M., Mahlke, S. (2007) Usability, aesthetics and emotions in human-technology interaction. Int J Psychol 42: 253--264.",
      "doi": ""
    },
    {
      "text": "Tinsley, H. E. A., Hinson, J. A., Tinsley, D. J., Holt, M. S. (1993) Attributes of leisure and work experiences. J Couns Psychol 40 (4): 447--455.",
      "doi": ""
    },
    {
      "text": "Tractinsky, N. (1997) Aesthetics and apparent usability: empirically assessing cultural and methodological issues. In: Proceedings of the SIGCHI conference on human factors in computing systems. ACM: New York, pp. 115--122.  ",
      "doi": "10.1145/258549.258626"
    },
    {
      "text": "Tractinsky, N., Katz, A. S., Ikar, D. (2000) What is beautiful is usable. Inter Comput 13 (2): 127--145.",
      "doi": ""
    },
    {
      "text": "Tuch, A. N., Bargas-Avila, J. A., Opwis, K. (2010) Symmetry and aesthetics in website design: it's a man's business. Comput Hum Behav 26 (6): 1831--1837.  ",
      "doi": "10.1016/j.chb.2010.07.016"
    },
    {
      "text": "Tuch, A. N., Roth, S. P., Hornbæk, K., Opwis, K., Bargas-Avila, J. A. (2012) Is beautiful really usable? Toward understanding the relation between usability, aesthetics, and affect in HCI. Comput Human Behavior 28(5), 1596--1607.  ",
      "doi": "10.1016/j.chb.2012.03.024"
    },
    {
      "text": "Tzou, R. C., Lu, H. P. (2009) Exploring the emotional, aesthetic, and ergonomic facets of innovative product on fashion technology acceptance model. Behav Inform Technol 28: 311--322.",
      "doi": ""
    },
    {
      "text": "Van der Heijden, H. (2003) Factors influencing the usage of websites: the case of a generic portal in The Netherlands. Information & Management 40(6): 541--549.  ",
      "doi": "10.1016/S0378-7206%2802%2900079-4"
    },
    {
      "text": "van Schaik, P., Hassenzahl, M., Ling, J. (2012). Userexperience from an inference perspective. ACM Trans. Comput.-Hum. Interact. 19(2): 1--25.  ",
      "doi": "10.1145/2240156.2240159"
    },
    {
      "text": "van Schaik, P., Ling, J. (2009). The role of context in perceptions of the aesthetics of web pages over time. Int J Hum Comput St 67(1): 79--89.  ",
      "doi": "10.1016/j.ijhcs.2008.09.012"
    },
    {
      "text": "Watson, D., Clark, L. A., Tellegen, A. (1988) Development and validation of brief measures of positive and negative affect: The PANAS scales. J Pers Soc Psychol 54: 1063--1070.",
      "doi": "10.1037//0022-3514.54.6.1063"
    },
    {
      "text": "Yamamoto, M., Lambert, D. R. (1994) The impact of product aesthetics on the evaluation of industrial products. J Prod Innov Manage 11: 309--324.",
      "doi": ""
    },
    {
      "text": "Zeng, L., Proctor, R. W., Salvendy, G. (2012) User-based assessment of website creativity: a review and appraisal. Behav Inform Technol, 31(4), 383--400.  ",
      "doi": "10.1080/01449291003686203"
    }
  ]
}