{
  "doi": "10.1145/2556288.2557036",
  "title": "End-users publishing structured information on the web: an observational study of what, why, and how",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1265-1274",
  "year": 2014,
  "badges": [],
  "abstract": "End-users are accustomed to filtering and browsing styled collections of data on professional web sites, but they have few ways to create and publish such information architectures for themselves. This paper presents a full-lifecycle analysis of the Exhibit framework - an end-user tool which provides such functionality - to understand the needs, capabilities, and practices of this class of users. We include interviews, as well as analysis of over 1,800 visualizations and 200,000 web interactions with these visualizations. Our analysis reveals important findings about this user population which generalize to the task of providing better end-user structured content publication tools.",
  "authors": [
    {
      "name": "Edward Benson",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100477052",
      "orcid": "missing"
    },
    {
      "name": "David R. Karger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100337812/rel-imgonly/square-photo-2.0569-17-centered.jpg",
      "acmid": "81100337812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Altinas, I., Berkley, C., Jaegar, E., Jones, M., Ludaescher, B., and Mock, S. Kepler: An extensible system for design and execution of scientific workflows. In Proc. Future of Grid Data Environments, Global Grid Forum (2004).",
      "doi": ""
    },
    {
      "text": "Bailis, P., Venkataraman, S., Franklin, M. J., Hellerstein, J. M., and Stoica, I. Probabilistically bounded staleness for practical partial quorums. In Proc. VLDB (2012). ",
      "doi": "10.14778/2212351.2212359"
    },
    {
      "text": "Bakke, E., Karger, D. R., and Miller, R. C. A spreadsheet-based user interface for managing plural relationships in structured data. In Proc. CHI (2011).  ",
      "doi": "10.1145/1978942.1979313"
    },
    {
      "text": "Bostock, M., and Heer, J. A graphical toolkit for visualization. In IEEE Trans Vis and Comp Graphics (2009).  ",
      "doi": "10.1109/TVCG.2009.174"
    },
    {
      "text": "Bostock, M., Ogievetsky, V., and Heer, J. D3: Data driven documents. In IEEE Trans Vis and Comp Graphics (2011).  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Bostock, Michael and Heer, Jeffrey. Declarative language design for interactive visualization. In IEEE Trans Vis and Comp Graphics (2010).  ",
      "doi": "10.1109/TVCG.2010.144"
    },
    {
      "text": "Branch, J. Snow fall: The avalanche at tunnel creek. In The New York Times (2013).",
      "doi": ""
    },
    {
      "text": "Cooley, R. and Mobasher, B. and Srivastava, J. \"Data Preparation for Mining World Wide Web Browsing Patterns.\" Journal of Knowledge and Information System (1999).",
      "doi": ""
    },
    {
      "text": "Gantt, M., and Nardi, B. A. Gardeners and gurus: Patterns of cooperation among cad users. In Proc. CHI (1992).  ",
      "doi": "10.1145/142750.142767"
    },
    {
      "text": "Gross, P., Herstand, M., Hodges, J., and Kelleher, C. A code reuse interface for non-programmer middle school students. In Proc. IUI (2010).  ",
      "doi": "10.1145/1719970.1720001"
    },
    {
      "text": "Hartmann, B., Doorley, S., and Klemmer, S. R. Understanding opportunistic design. In IEEE Pervasive Computing (2008).  ",
      "doi": "10.1109/MPRV.2008.54"
    },
    {
      "text": "Herman, I., Adida, B., Sporny, M., and Birbeck, M. Rdfa 1.1 primer: Rich structured data markup for web documents. In W3C Working Group Note (2013).",
      "doi": ""
    },
    {
      "text": "Herring, S. R., Chang, C.-C., Krantzler, J., and Bailey, B. P. Getting inspired! understanding how and why examples are used in creative design practice. In Proc. CHI (2009).  ",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Huynh, D. F., Karger, D. R., and Miller, R. C. Exhibit: Lightweight structured data publishing. In Proc. WWW (2007).  ",
      "doi": "10.1145/1242572.1242672"
    },
    {
      "text": "Jones, M. C., and Churchill, E. F. Conversations in developer communities: A preliminary analysis of the yahoo! pipes community. In Proc. C&T (2009).  ",
      "doi": "10.1145/1556460.1556489"
    },
    {
      "text": "Karger, D. Standards opportunities around data-bearing web pages. In Proc. HCIR (2012).",
      "doi": ""
    },
    {
      "text": "Kelleher, C., Pausch, R., and Kiesler, S. Storytelling alice motivates middle school girls to learn computer programming. In Proc. CHI (2007).  ",
      "doi": "10.1145/1240624.1240844"
    },
    {
      "text": "Kraska, T., Pang, G., Franklin, M. J., Madden, S., and Feketey, A. Mdcc: Multi-data center consistency. In Proc. Eurosys (2013).  ",
      "doi": "10.1145/2465351.2465363"
    },
    {
      "text": "Lee, B., Srivastava, S., Kuar, R., Brafman, R., and Klemmer, S. R. Designing with interactive example galleries. In Proc. CHI (2010).  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Newman, M., and Landay, J. Sitemaps, storyboards, and Specifications: a sketch of web site design practice. In Proc. DIS (2000).  ",
      "doi": "10.1145/347642.347758"
    },
    {
      "text": "Niu, X., and Hemminger, B. Beyond text querying and ranking list: How people are searching through faceted catalogs in two library environments. In Proc. ASIS&T (2010). ",
      "doi": "10.5555/1920331.1920373"
    },
    {
      "text": "Voida, A., Harmon, E., and Al-Ani, B. Homebrew databases: Complexities of everyday information management in nonprofit organizations. In Proc. CHI (2011).  ",
      "doi": "10.1145/1978942.1979078"
    },
    {
      "text": "Völkel, M., Krötzsch, M., Vrandecic, D., Haller, H., and Studer, R. Semantic wikipedia. In Proc. WWW (2006).  ",
      "doi": "10.1145/1135777.1135863"
    },
    {
      "text": "Weiss, M., and Sari, S. Evolution of the mashup ecosystem by copying. In International Workshop on Web APIs and Services Mashups (2010).  ",
      "doi": "10.1145/1944999.1945010"
    },
    {
      "text": "Witten, I. H., Bainbridge, D., and Boddie, S. J. Greenstone open source digital library software. In D-Lib Magazine (2001).",
      "doi": ""
    }
  ]
}