{
  "doi": "10.1145/2556288.2557078",
  "title": "A systematic review of quantitative studies on the enjoyment of digital entertainment games",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "927-936",
  "year": 2014,
  "badges": [],
  "abstract": "Enjoyment has been identified as a central component of the player experience (PX), but various, overlapping concepts within PX make it difficult to develop valid measures and a common understanding of game enjoyment. We conducted a systematic review of 87 quantitative studies, analyzing different operationalizations and measures of game enjoyment, its determinants, and how these were related to other components of PX, such as flow, presence and immersion. Results suggest that game enjoyment describes the positive cognitive and affective appraisal of the game experience, and may in part be associated with the support of player needs and values. Further, we outline that enjoyment is distinct from flow in that it may occur independently of challenge and cognitive involvement, and argue that enjoyment may be understood as the valence of the player experience. We conclude with a discussion of methodological challenges and point out opportunities for future research on game enjoyment.",
  "tags": [
    "flow",
    "player experience",
    "enjoyment",
    "digital games"
  ],
  "authors": [
    {
      "name": "Elisa D. Mekler",
      "institution": "University of Basel, Basel, Basel-Stadt, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549460056",
      "orcid": "0000-0003-0076-6703"
    },
    {
      "name": "Julia Ayumi Bopp",
      "institution": "University of Basel, Basel, Basel-Stadt, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958818057",
      "orcid": "missing"
    },
    {
      "name": "Alexandre N. Tuch",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597649",
      "orcid": "missing"
    },
    {
      "name": "Klaus Opwis",
      "institution": "University of Basel, Basel, BS, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048343",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Essential facts about the computer and video game industry. Tech. rep., Entertainment Software Association, 2013. Retrieved June 1, 2013 from http://www.theesa.com/facts/pdfs/ESA_EF_2013.pdf.",
      "doi": ""
    },
    {
      "text": "Abuhamdeh, S., and Csikszentmihalyi, M. Intrinsic and extrinsic motivational orientations in the competitive context: An examination of person--situation interactions. Journal of personality 77, 5 (2009), 1615--1635.",
      "doi": ""
    },
    {
      "text": "Abuhamdeh, S., and Csikszentmihalyi, M. The importance of challenge for the enjoyment of intrinsically motivated, goal-directed activities. Personality and Social Psychology Bulletin 38, 3 (2012), 317--330.",
      "doi": ""
    },
    {
      "text": "Anderson, C. A., and Carnagey, N. L. Causal effects of violent sports video games on aggression: Is it competitiveness or violent content? Journal of Experimental Social Psychology 45, 4 (2009), 731--739.",
      "doi": ""
    },
    {
      "text": "Bargas-Avila, J. A., and Hornbæk, K. Old wine in new bottles or novel challenges: a critical analysis of empirical studies of user experience. In Proc. CHI '11, ACM (2011), 2689--2698.  ",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Bastian, B., Jetten, J., and Radke, H. R. Cyber-dehumanization: Violent video game play diminishes our humanity. Journal of Experimental Social Psychology 48, 2 (2012), 486--491.",
      "doi": ""
    },
    {
      "text": "Bateman, S., Doucette, A., Xiao, R., Gutwin, C., Mandryk, R. L., and Cockburn, A. Effects of view, input device, and track width on video game driving. In Proc. GI '11, Canadian Human-Computer Communications Society (2011), 207--214. ",
      "doi": "10.5555/1992917.1992952"
    },
    {
      "text": "Bernhaupt, R. User experience evaluation in entertainment. In Evaluating User Experience in Games. Springer, 2010, 3--7.",
      "doi": ""
    },
    {
      "text": "Beznosyk, A., Quax, P., Coninx, K., and Lamotte, W. The influence of cooperative game design patterns for remote play on player experience. In Proc. APCHI '12, ACM (2012), 11--20.  ",
      "doi": "10.1145/2350046.2350051"
    },
    {
      "text": "Bharambe, A., Douceur, J. R., Lorch, J. R., Moscibroda, T., Pang, J., Seshan, S., and Zhuang, X. Donnybrook: enabling large-scale, high-speed, peer-to-peer games. In Proc. SIGCOMM '08, vol. 38, ACM (2008), 389--400.  ",
      "doi": "10.1145/1402958.1403002"
    },
    {
      "text": "Blythe, M., and Hassenzahl, M. The semantics of fun: Differentiating enjoyable experiences. In Funology. Springer, 2005, 91--100. ",
      "doi": "10.5555/1139008.1139020"
    },
    {
      "text": "Bogost, I. How to Do Things with Video Games. University of Minnesota Press, 2011.",
      "doi": ""
    },
    {
      "text": "Boyle, E. A., Connolly, T. M., Hainey, T., and Boyle, J. M. Engagement in digital entertainment games: A systematic review. Computers in Human Behavior (2011).  ",
      "doi": "10.1016/j.chb.2011.11.020"
    },
    {
      "text": "Brockmyer, J. H., Fox, C. M., Curtiss, K. A., McBroom, E., Burkhart, K. M., and Pidruzny, J. N. The development of the game engagement questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624--634.",
      "doi": ""
    },
    {
      "text": "Browne, K., and Anand, C. An empirical evaluation of user interfaces for a mobile video game. Entertainment Computing 3, 1 (2012), 1--10.",
      "doi": ""
    },
    {
      "text": "Calvillo-Gámez, E. H., Cairns, P., and Romero, P. Catching the game: multi-method approaches to understanding gaming experiences. In Game User Research Workshop CHI '12 (2012).",
      "doi": ""
    },
    {
      "text": "Cassidy, G., and MacDonald, R. A. The effects of music on time perception and performance of a driving game. Scandinavian journal of psychology 51, 6 (2010), 455--464.",
      "doi": ""
    },
    {
      "text": "Chanel, G., Kivikangas, J. M., and Ravaja, N. Physiological compliance for social gaming analysis: Cooperative versus competitive play. Interacting with Computers 24, 4 (2012), 306--316.  ",
      "doi": "10.1016/j.intcom.2012.04.012"
    },
    {
      "text": "Charbonneau, E., Miller, A., Wingrave, C., and LaViola Jr, J. J. Understanding visual interfaces for the next generation of dance-based rhythm video games. In Proc. Sandbox '09, ACM (2009), 119--126.  ",
      "doi": "10.1145/1581073.1581092"
    },
    {
      "text": "De Simone, J., Verbruggen, T., Kuo, L.-H., and Mutlu, B. Is cheating a human function? the roles of presence, state hostility, and enjoyment in an unfair video game. Computers in Human Behavior (2012), 2351--2358.  ",
      "doi": "10.1016/j.chb.2012.07.005"
    },
    {
      "text": "Dias, R., and Martinho, C. Adapting content presentation and control to player personality in videogames. In Proc. ACE '11, ACM (2011), 18.  ",
      "doi": "10.1145/2071423.2071446"
    },
    {
      "text": "Dimas, J., Pereira, G., Santos, P. A., Prada, R., and Paiva, A. I'm happy if you are happy.: a model for emotional contagion in game characters. In Proc. ACE '11, ACM (2011), 2.  ",
      "doi": "10.1145/2071423.2071426"
    },
    {
      "text": "Downs, E., and Sundar, S. S. \"we won\" vs.\"they lost\": Exploring ego-enhancement and self-preservation tendencies in the context of video game play. Entertainment Computing 2, 1 (2011), 23--28.",
      "doi": ""
    },
    {
      "text": "Drachen, A., Nacke, L. E., Yannakakis, G., and Pedersen, A. L. Correlation between heart rate, electrodermal activity and player experience in first-person shooter games. In Proc. Sandbox '10, ACM (2010), 49--54.  ",
      "doi": "10.1145/1836135.1836143"
    },
    {
      "text": "Duh, H. B.-L., Yew Yee, S. L. C., Gu, Y. X., and Chen, V. H.-H. A narrative-driven design approach for casual games with children. In Proc. Sandbox '10, ACM (2010), 19--24.  ",
      "doi": "10.1145/1836135.1836138"
    },
    {
      "text": "Elliott, L., Golub, A., Ream, G., and Dunlap, E. Video game genre as a predictor of problem use. Cyberpsychology, Behavior, and Social Networking 15, 3 (2012), 155--161.",
      "doi": ""
    },
    {
      "text": "Fang, X., Chan, S., Brzezinski, J., and Nair, C. Development of an instrument to measure enjoyment of computer game play. Intl. Journal of Human-Computer Interaction 26, 9 (2010), 868--886.",
      "doi": ""
    },
    {
      "text": "Fang, X., and Zhao, F. Personality and enjoyment of computer game play. Computers in Industry 61, 4 (2010), 342--349.  ",
      "doi": "10.1016/j.compind.2009.12.005"
    },
    {
      "text": "Gajadhar, B. J., Nap, H. H., de Kort, Y. A., and IJsselsteijn, W. A. Out of sight, out of mind: co-player effects on seniors' player experience. In Proc. FnG '10, ACM (2010), 74--83.  ",
      "doi": "10.1145/1823818.1823826"
    },
    {
      "text": "Gollwitzer, M., and Melzer, A. Macbeth and the joystick: Evidence for moral cleansing after playing a violent video game. Journal of Experimental Social Psychology (2012), 1356--1360.",
      "doi": ""
    },
    {
      "text": "Gualeni, S., Janssen, D., and Calvi, L. How psychophysiology can aid the design process of casual games: A tale of stress, facial muscles, and paper beasts. In Proc. FDG '12, ACM (2012), 149--155.  ",
      "doi": "10.1145/2282338.2282369"
    },
    {
      "text": "Gürkök, H., Hakvoort, G., Poel, M., and Nijholt, A. User expectations and experiences of a speech and thought controlled computer game. In Proc. ACE '11, ACM (2011), 53.  ",
      "doi": "10.1145/2071423.2071490"
    },
    {
      "text": "Hagelbäck, J., and Johansson, S. J. Measuring player experience on runtime dynamic difficulty scaling in an rts game. In Proc. CIG '09, IEEE (2009), 46--52. ",
      "doi": "10.5555/1719293.1719311"
    },
    {
      "text": "Hartmann, T., and Vorderer, P. It's okay to shoot a character: Moral disengagement in violent video games. Journal of Communication 60, 1 (2010), 94--119.",
      "doi": ""
    },
    {
      "text": "Heeter, C., Sarkar, C. D., Palmer-Scott, B., and Zhang, S. Engineering sociability: Friendship drive, visibility, and social connection in anonymous co-located local wi-- multiplayer online gaming. Intl. J. of Gaming and Computer-Mediated Simulations 4, 2 (2012), 1--18.",
      "doi": ""
    },
    {
      "text": "Hornbæk, K. Current practice in measuring usability: Challenges to usability studies and research. Intl. journal of human-computer studies 64, 2 (2006), 79--102.  ",
      "doi": "10.1016/j.ijhcs.2005.06.002"
    },
    {
      "text": "Jefferson, C., Moncur, W., and Petrie, K. E. Combination: Automated generation of puzzles with constraints. In Proc. SAC '11, ACM (2011), 907--912.  ",
      "doi": "10.1145/1982185.1982383"
    },
    {
      "text": "Jegers, K. Pervasive game flow: understanding player enjoyment in pervasive gaming. Computers in Entertainment 5, 1 (2007), 9.  ",
      "doi": "10.1145/1236224.1236238"
    },
    {
      "text": "Jennett, C., Cox, A. L., Cairns, P., Dhoparee, S., Epps, A., Tijs, T., and Walton, A. Measuring and defining the experience of immersion in games. Intl. journal of human-computer studies 66, 9 (2008), 641--661.  ",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Jin, S.-A. A. \"i feel present. therefore, i experience flow:\" a structural equation modeling approach to flow and presence in video games. Journal of Broadcasting & Electronic Media 55, 1 (2011), 114--136.",
      "doi": ""
    },
    {
      "text": "Jin, S.-A. A. \"toward integrative models of flow\": Effects of performance, skill, challenge, playfulness, and presence on flow in video games. Journal of Broadcasting & Electronic Media 56, 2 (2012), 169--186.",
      "doi": ""
    },
    {
      "text": "Jörg, S., Normoyle, A., and Safonova, A. How responsiveness affects players' perception in digital games. In Proc. SAP '12, ACM (2012), 33--38.  ",
      "doi": "10.1145/2338676.2338683"
    },
    {
      "text": "Klasen, M., Weber, R., Kircher, T. T., Mathiak, K. A., and Mathiak, K. Neural contributions to flow experience during video game playing. Social cognitive and affective neuroscience 7, 4 (2012), 485--495.",
      "doi": ""
    },
    {
      "text": "Klimmt, C., Hefner, D., Vorderer, P., Roth, C., and Blake, C. Identification with video game characters as automatic shift of self-perceptions. Media Psychology 13, 4 (2010), 323--338.",
      "doi": ""
    },
    {
      "text": "Kuikkaniemi, K., Laitinen, T., Turpeinen, M., Saari, T., Kosunen, I., and Ravaja, N. The influence of implicit and explicit biofeedback in first-person shooter games. In Proc. CHI '10, ACM (2010), 859--868.  ",
      "doi": "10.1145/1753326.1753453"
    },
    {
      "text": "Lai, J.-H., Chen, C.-L., Wu, P.-C., Kao, C.-C., and Chien, S.-Y. Tennis real play: an interactive tennis game with models from real videos. In Proc. MM '11, ACM (2011), 483--492.  ",
      "doi": "10.1145/2072298.2072361"
    },
    {
      "text": "Lazzaro, N. The four fun keys. Game Usability: Advancing the Player Experience (K. Isbister and N. Schaffer, Eds.). Burlington: Elsevier (2008), 315--344.",
      "doi": ""
    },
    {
      "text": "Limperos, A. M., Schmierbach, M. G., Kegerise, A. D., and Dardis, F. E. Gaming across different consoles: exploring the influence of control scheme on game-player enjoyment. Cyberpsychology, Behavior, and Social Networking 14, 6 (2011), 345--350.",
      "doi": ""
    },
    {
      "text": "Lin, A., Gregor, S., and Ewing, M. Understanding the nature of online emotional experiences: a study of enjoyment as a web experience. In Proc. ICEC '09, ACM (2009), 259--268.  ",
      "doi": "10.1145/1593254.1593294"
    },
    {
      "text": "Lin, S.-F. Gender differences and the effect of contextual features on game enjoyment and responses. Cyberpsychology, Behavior, and Social Networking 13, 5 (2010), 533--537.",
      "doi": ""
    },
    {
      "text": "Macret, M., Antle, A. N., and Pasquier, P. Can a paper-based sketching interface improve the gamer experience in strategy computer games? In Proc. IHCI '12, IEEE (2012), 1--6.",
      "doi": ""
    },
    {
      "text": "Maruyama, Y., Masoodian, M., and Rogers, B. A survey of japanese gamers' ratings of experience elements for different game genres. In Proc. ACE '11, ACM (2011), 47.  ",
      "doi": "10.1145/2071423.2071482"
    },
    {
      "text": "Mellecker, R., Lyons, E. J., and Baranowski, T. Disentangling fun and enjoyment in exergames using an expanded design, play, experience framework: A narrative review. GAMES FOR HEALTH: Research, Development, and Clinical Applications (2013).",
      "doi": ""
    },
    {
      "text": "Merritt, T., McGee, K., Chuah, T. L., and Ong, C. Choosing human team-mates: perceived identity as a moderator of player preference and enjoyment. In Proc. FDG '11, ACM (2011), 196--203.  ",
      "doi": "10.1145/2159365.2159392"
    },
    {
      "text": "Mirza-Babaei, P., Nacke, L. E., Gregory, J., Collins, N., and Fitzpatrick, G. How does it play better?: exploring user testing and biometric storyboards in games user research. In Proc. CHI '13, ACM (2013), 1499--1508.  ",
      "doi": "10.1145/2470654.2466200"
    },
    {
      "text": "Moser, C., Fuchsberger, V., and Tscheligi, M. Rapid assessment of game experiences in public settings. In Proc. FnG '12, ACM (2012), 73--82.  ",
      "doi": "10.1145/2367616.2367625"
    },
    {
      "text": "Nabi, R. L., and Krcmar, M. Conceptualizing media enjoyment as attitude: Implications for mass media effects research. Communication Theory 14, 4 (2004), 288--310.",
      "doi": ""
    },
    {
      "text": "Nacke, L., and Drachen, A. Towards a framework of player experience research. In EPEX '11 (2011).",
      "doi": ""
    },
    {
      "text": "Nacke, L., and Lindley, C. A. Flow and immersion in first-person shooters: measuring the player's gameplay experience. In Proc. Future Play '08, ACM (2008), 81--88.  ",
      "doi": "10.1145/1496984.1496998"
    },
    {
      "text": "Nacke, L. E., Grimshaw, M. N., and Lindley, C. A. More than a feeling: Measurement of sonic user experience and psychophysiology in a first-person shooter game. Interacting with Computers 22, 5 (2010), 336--343.  ",
      "doi": "10.1016/j.intcom.2010.04.005"
    },
    {
      "text": "Nakamura, J., and Csikszentmihalyi, M. The concept of flow. Handbook of positive psychology (2002), 89--105.",
      "doi": ""
    },
    {
      "text": "Obaid, M., Han, C., and Billinghurst, M. Feed the fish: an affect-aware game. In Proc. IE '08, ACM (2008), 6.  ",
      "doi": "10.1145/1514402.1514408"
    },
    {
      "text": "Obrist, M., Igelsböck, J., Beck, E., Moser, C., Riegler, S., and Tscheligi, M. Now you need to laugh!: investigating fun in games with children. In Proc. ACE '09, ACM (2009), 81--88.  ",
      "doi": "10.1145/1690388.1690403"
    },
    {
      "text": "Park, N., Min Lee, K., Jin, S.-A. A., and Kang, S. Effects of pre-game stories on feelings of presence and evaluation of computer games. Intl. journal of human-computer studies 68, 11 (2010), 822--833.  ",
      "doi": "10.1016/j.ijhcs.2010.07.002"
    },
    {
      "text": "Piselli, P., Claypool, M., and Doyle, J. Relating cognitive models of computer games to user evaluations of entertainment. In Proc. FDG '09, ACM (2009), 153--160.  ",
      "doi": "10.1145/1536513.1536545"
    },
    {
      "text": "Poels, K., Hoogen, W. v. d., Ijsselsteijn, W., and de Kort, Y. Pleasure to play, arousal to stay: The effect of player emotions on digital game preferences and playing time. CyberPsychology, Behavior, and Social Networking 15, 1 (2012), 1--6.",
      "doi": ""
    },
    {
      "text": "Przybylski, A. K., Ryan, R. M., and Rigby, C. S. The motivating role of violence in video games. Personality and Social Psychology Bulletin 35, 2 (2009), 243--259.",
      "doi": ""
    },
    {
      "text": "Quick, J. M., Atkinson, R. K., and Lin, L. Empirical taxonomies of gameplay enjoyment: Personality and video game preference. Intl. Journal of Game-Based Learning 2, 3 (2012), 11--31.",
      "doi": ""
    },
    {
      "text": "Reinecke, L., Klatt, J., and Krämer, N. C. Entertaining media use and the satisfaction of recovery needs: Recovery outcomes associated with the use of interactive and noninteractive entertaining media. Media Psychology 14, 2 (2011), 192--215.",
      "doi": ""
    },
    {
      "text": "Reinecke, L., Tamborini, R., Grizzard, M., Lewis, R., Eden, A., and Bowman, N. D. Characterizing mood management as need satisfaction: The effects of intrinsic needs on selective exposure and mood repair. Journal of Communication (2012), 437--453.",
      "doi": ""
    },
    {
      "text": "Schild, J., LaViola, J., and Masuch, M. Understanding user experience in stereoscopic 3d games. In Proc. CHI '12, ACM (2012), 89--98.  ",
      "doi": "10.1145/2207676.2207690"
    },
    {
      "text": "Schmierbach, M., Limperos, A. M., and Woolley, J. K. Feeling the need for (personalized) speed: How natural controls and customization contribute to enjoyment of a racing game through enhanced immersion. Cyberpsychology, Behavior, and Social Networking (2012), 364--369.",
      "doi": ""
    },
    {
      "text": "Schmierbach, M., Xu, Q., Oeldorf-Hirsch, A., and Dardis, F. E. Electronic friend or virtual foe: Exploring the role of competitive and cooperative multiplayer video game modes in fostering enjoyment. Media Psychology 15, 3 (2012), 356--371.",
      "doi": ""
    },
    {
      "text": "Seif El-Nasr, M., Aghabeigi, B., Milam, D., Erfani, M., Lameman, B., Maygoli, H., and Mah, S. Understanding and evaluating cooperative games. In Proc. CHI '10, ACM (2010), 253--262.  ",
      "doi": "10.1145/1753326.1753363"
    },
    {
      "text": "Shafer, D. M. Causes of state hostility and enjoyment in player versus player and player versus environment video games. Journal of Communication (2012), 719--737.",
      "doi": ""
    },
    {
      "text": "Shim, K. J., Srivastava, J., and Hsu, K.-W. An exploratory study of player performance, motivation, and enjoyment in massively multiplayer online role-playing games. In Proc. PASSAT SocialCom '11, IEEE (2011), 135--140.",
      "doi": ""
    },
    {
      "text": "Sweetser, P., and Wyeth, P. Gameflow: a model for evaluating player enjoyment in games. Computers in Entertainment (CIE) 3, 3 (2005), 3--3.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Takatalo, J., Häkkinen, J., Kaistinen, J., and Nyman, G. Presence, involvement, and flow in digital games. In Evaluating user experience in games. Springer, 2010, 23--46.",
      "doi": ""
    },
    {
      "text": "Tamborini, R., Bowman, N. D., Eden, A., Grizzard, M., and Organ, A. Defining media enjoyment as the satisfaction of intrinsic needs. Journal of Communication 60, 4 (2010), 758--777.",
      "doi": ""
    },
    {
      "text": "Tamborini, R., Grizzard, M., Bowman, N. D., Reinecke, L., Lewis, R. J., and Eden, A. Media enjoyment as need satisfaction: The contribution of hedonic and nonhedonic needs. Journal of Communication 61, 6 (2011), 1025--1042.",
      "doi": ""
    },
    {
      "text": "Trepte, S., and Reinecke, L. The pleasures of success: game-related efficacy experiences as a mediator between player performance and game enjoyment. Cyberpsychology, Behavior, and Social Networking 14, 9 (2011), 555--557.",
      "doi": ""
    },
    {
      "text": "van den Hoogen, W., Poels, K., IJsselsteijn, W., and de Kort, Y. Between challenge and defeat: Repeated player-death and game enjoyment. Media Psychology 15, 4 (2012), 443--459.",
      "doi": ""
    },
    {
      "text": "Vorderer, P., Klimmt, C., and Ritterfeld, U. Enjoyment: At the heart of media entertainment. Communication theory 14, 4 (2004), 388--408.",
      "doi": ""
    },
    {
      "text": "Weaver, A. J., and Lewis, N. Mirrored morality: An exploration of moral choice in video games. Cyberpsychology, Behavior, and Social Networking 15, 11 (2012), 610--614.",
      "doi": ""
    },
    {
      "text": "Weber, R., Tamborini, R., Westcott-Baker, A., and Kantor, B. Theorizing flow and media enjoyment as cognitive synchronization of attentional and reward networks. Communication Theory 19, 4 (2009), 397--422.",
      "doi": ""
    },
    {
      "text": "Weibel, D., and Wissmath, B. Immersion in computer games: The role of spatial presence and flow. Intl. Journal of Computer Games Technology (2011), 6.  ",
      "doi": "10.1155/2011/282345"
    },
    {
      "text": "Weibel, D., Wissmath, B., Habegger, S., Steiner, Y., and Groner, R. Playing online games against computer- vs. human-controlled opponents: Effects on presence, flow, and enjoyment. Computers in Human Behavior 24, 5 (2008), 2274--2291.  ",
      "doi": "10.1016/j.chb.2007.11.002"
    },
    {
      "text": "Weibel, D., Wissmath, B., and Mast, F. W. influence of mental imagery on spatial presence and enjoyment assessed in different types of media. Cyberpsychology, Behavior, and Social Networking 14, 10 (2011), 607--612.",
      "doi": ""
    },
    {
      "text": "Wyeth, P., Johnson, D. M., and Sweetser, P. Conceptualising, operationalising and measuring the player experience in videogames. In Extended Proc. FnG '12, IRIT Press (2012), 90--93.",
      "doi": ""
    },
    {
      "text": "Yun, C., Shastri, D., Pavlidis, I., and Deng, Z. O'game, can you feel my frustration?: improving user's gaming experience via stresscam. In Proc. CHI '09, ACM (2009), 2195--2204.  ",
      "doi": "10.1145/1518701.1519036"
    }
  ]
}