{
  "doi": "10.1145/2556288.2557309",
  "title": "Do-it-yourself cellphones: an investigation into the possibilities and limits of high-tech diy",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1723-1732",
  "year": 2014,
  "badges": [],
  "abstract": "This paper describes our do-it-yourself cellphone and our use of it to investigate the possibilities and limits of high-tech DIY practice. We describe our autobiographical approach -- making the phone and using it in our daily lives -- and our work disseminating the cellphone in workshops and online. This informs a discussion of the implications of technology for DIY practice. We suggest an understanding of DIY as an individual's ability to combine existing technologies into a desired product, enabled and limited by ecosystems of industrial actors and individuals. We distinguish different pathways into high-tech DIY practice, consider the relationship between prototyping and production, and discuss the effect of technology on DIY's relevance and tools, and on notions of transparency. We conclude by reflecting on the relationship between DIY and empowerment: the extent to which making devices gives people control over the technology in their lives.",
  "tags": [
    "cellphone",
    "prototyping",
    "electronics",
    "digital fabrication",
    "toolkits",
    "diy",
    "microcontrollers"
  ],
  "authors": [
    {
      "name": "David A. Mellis",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453610811",
      "orcid": "missing"
    },
    {
      "name": "Leah Buechley",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81309510031/rel-imgonly/leahb_2.jpg",
      "acmid": "81309510031",
      "orcid": "0000-0003-2661-2761"
    }
  ],
  "references": [
    {
      "text": "Buechley, L., and Perner-Wilson, H. Crafting technology: Reimagining the processes, materials, and cultures of electronics. ACM Trans. Comput.-Hum. Interact. 19, 3 (Oct. 2012), 21:1--21:21.  ",
      "doi": "10.1145/2362364.2362369"
    },
    {
      "text": "Buechley, L., Rosner, D. K., Paulos, E., and Williams, A. Diy for chi: methods, communities, and values of reuse and customization. In CHI EA '09, ACM (2009), 4823--4826.  ",
      "doi": "10.1145/1520340.1520750"
    },
    {
      "text": "Dourish, P., and Bell, G. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. The MIT Press, 2011. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Follmer, S., Carr, D., Lovell, E., and Ishii, H. Copycad: remixing physical objects with copy and paste from the real world. In UIST '10, ACM (2010), 381--382.  ",
      "doi": "10.1145/1866218.1866230"
    },
    {
      "text": "Follmer, S., and Ishii, H. Kidcad: digitally remixing toys through tangible tools. In CHI '12, ACM (2012), 2401--2410.  ",
      "doi": "10.1145/2207676.2208403"
    },
    {
      "text": "Gershenfeld, N. Fab: The Coming Revolution on Your Desktop from Personal Computers to Personal Fabrication. Basic Books, Inc., 2007. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "Goodman, E., and Rosner, D. From garments to gardens: negotiating material relationships online and \"by hand\". In CHI '11, ACM (2011), 2257--2266.  ",
      "doi": "10.1145/1978942.1979273"
    },
    {
      "text": "Greenberg, S., and Fitchett, C. Phidgets: easy development of physical interfaces through physical widgets. In UIST '01, ACM (2001), 209--218.  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Hartmann, B., Klemmer, S. R., Bernstein, M., Abdulla, L., Burr, B., Robinson-Mosher, A., and Gee, J. Reflective physical prototyping through integrated design, test, and analysis. In UIST '06, ACM (2006), 299--308.  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Jacobs, J., and Buechley, L. Codeable objects: computational design and digital fabrication for novice programmers. In CHI '13, ACM (2013), 1589--1598.  ",
      "doi": "10.1145/2470654.2466211"
    },
    {
      "text": "Knörig, A., Wettach, R., and Cohen, J. Fritzing: a tool for advancing electronic prototyping for designers. In TEI '09, ACM (2009), 351--358.  ",
      "doi": "10.1145/1517664.1517735"
    },
    {
      "text": "Kuznetsov, S., Davis, G. N., Paulos, E., Gross, M. D., and Cheung, J. C. Red balloon, green balloon, sensors in the sky. In UbiComp '11, ACM (2011), 237--246.  ",
      "doi": "10.1145/2030112.2030145"
    },
    {
      "text": "Kuznetsov, S., and Paulos, E. Rise of the expert amateur: Diy projects, communities, and cultures. In NordiCHI '10, ACM (2010), 295--304.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Lim, Y.-K., Stolterman, E., and Tenenberg, J. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Trans. Comput.-Hum. Interact. 15, 2 (July 2008), 7:1--7:27.  ",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Maestri, L., and Wakkary, R. Understanding repair as a creative process of everyday design. In C&C '11, ACM (2011), 81--90.  ",
      "doi": "10.1145/2069618.2069633"
    },
    {
      "text": "Mellis, D., Follmer, S., Hartmann, B., Buechley, L., and Gross, M. D. Fab at chi: digital fabrication tools, design, and community. In CHI EA '13, ACM (2013), 3307--3310.  ",
      "doi": "10.1145/2468356.2479673"
    },
    {
      "text": "Mellis, D. A., and Buechley, L. Case studies in the personal fabrication of electronic products. In DIS '12, ACM (2012), 268--277.  ",
      "doi": "10.1145/2317956.2317998"
    },
    {
      "text": "Mellis, D. A., Gordon, D., and Buechley, L. Fab fm: the design, making, and modification of an open-source electronic product. In TEI '11, ACM (2011), 81--84.  ",
      "doi": "10.1145/1935701.1935718"
    },
    {
      "text": "Mueller, S., Lopes, P., and Baudisch, P. Interactive construction: interactive fabrication of functional mechanical devices. In UIST '12, ACM (2012), 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Neustaedter, C., and Sengers, P. Autobiographical design in hci research: Designing and learning through use-it-yourself. In DIS '12, ACM (2012), 514--523.  ",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Resnick, M. Behavior construction kits. Commun. ACM 36, 7 (July 1993), 64--71.  ",
      "doi": "10.1145/159544.159593"
    },
    {
      "text": "Resnick, M., Martin, F., Berg, R., Borovoy, R., Colella, V., Kramer, K., and Silverman, B. Digital manipulatives: new toys to think with. In CHI '98, ACM (1998), 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Rosner, D., and Bean, J. Learning from ikea hacking: i'm not one to decoupage a tabletop and call it a day. In CHI '09, ACM (2009), 419--422.  ",
      "doi": "10.1145/1518701.1518768"
    },
    {
      "text": "Saul, G., Lau, M., Mitani, J., and Igarashi, T. Sketchchair: an all-in-one chair design system for end users. In TEI '11, ACM (2011), 73--80.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Savage, V., Zhang, X., and Hartmann, B. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In UIST '12, ACM (2012), 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Sivek, S. C. \"we need a showing of all hands\" technological utopianism in make magazine. Journal of Communication Inquiry 35, 3 (2011), 187--209.",
      "doi": ""
    },
    {
      "text": "Tanenbaum, J. G., Williams, A. M., Desjardins, A., and Tanenbaum, K. Democratizing technology: pleasure, utility and expressiveness in diy and maker practice. In CHI '13, ACM (2013), 2603--2612.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Villar, N., Scott, J., Hodges, S., Hammil, K., and Miller, C. .net gadgeteer: a platform for custom devices. In Pervasive '12, Springer-Verlag (2012), 216--233.  ",
      "doi": "10.1007/978-3-642-31205-2_14"
    },
    {
      "text": "Willis, K., Brockmeyer, E., Hudson, S., and Poupyrev, I. Printed optics: 3d printing of embedded optical elements for interactive devices. In UIST '12, ACM (2012), 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Zoran, A., and Paradiso, J. A. Freed: a freehand digital sculpting tool. In CHI '13, ACM (2013), 2613--2616.  ",
      "doi": "10.1145/2470654.2481361"
    }
  ]
}