{
  "doi": "10.1145/2556288.2557333",
  "title": "An assistive robotic table for older and post-stroke adults: results from participatory design and evaluation activities with clinical staff",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "673-682",
  "year": 2014,
  "badges": [],
  "abstract": "An inevitable new frontier for the CHI community is the development of complex, larger-scale, cyber-physical artifacts where advancements in design, computing and robotics converge. Presented here is a design exemplar: the Assistive, Robotic Table (ART), the key component of our envisioned home suite of networked, robotic furnishings for hospitals and homes, promoting wellbeing and independent living. We begin with the motivations for ART, and present our iterative, five-phase, participatory design-and-evaluation process involving clinicians at a rehabilitation hospital, focusing here on the final usability study. From our wide-ranging design-research activities, which may be characterized as research through design, we found ART to be promising but also challenging. As a design exemplar, ART offers invaluable lessons to the CHI community as it comes to design larger-scale, cyber-physical artifacts cultivating interactions across people and their surroundings that define places of social, cultural and psychological significance.",
  "tags": [
    "eldercare",
    "design research",
    "human-robot interaction design",
    "healthcare",
    "ethnography",
    "assistive robotics"
  ],
  "authors": [
    {
      "name": "Anthony L. Threatt",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657041",
      "orcid": "missing"
    },
    {
      "name": "Jessica Merino",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482650219",
      "orcid": "missing"
    },
    {
      "name": "Keith Evan Green",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/do/10.1145/contrib-81414598364/rel-imgonly/81414598364.jpg",
      "acmid": "81414598364",
      "orcid": "0000-0003-3326-2907"
    },
    {
      "name": "Ian Walker",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423501",
      "orcid": "missing"
    },
    {
      "name": "Johnell O. Brooks",
      "institution": "Clemson University, Clemson, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414613101",
      "orcid": "missing"
    },
    {
      "name": "Stan Healy",
      "institution": "Greenville Health System, Greenville, SC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959442257",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, G., Blyth, M. and Sengers, P. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction 12 2, ACM Press (2005), 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Benedek, J., & Miner, T. Measuring Desirability: New methods for evaluating desirability in a usability lab setting. www.microsoft.com/usability/UEPostings/DesirabilityT oolkit.doc.",
      "doi": ""
    },
    {
      "text": "Brooke, J. SUS: A \"quick and dirty\" usability scale. In P. W. Jordan, B. Thomas, I. L. McClelland & B. Weerdmeester (Eds.), Usability Evaluation in Industry. Bristol, PA: Taylor & Francis, Inc, 1996.",
      "doi": ""
    },
    {
      "text": "Brooks, J. O., Smolentzov, L., DeArment, A., Logan, W., Green, K. E., Walker, I., . . . Yanik, P. Toward a \"smart\" nightstand prototype: An examination of nightstand table contents and preferences. Health Environments Research and Design Journal 4, 2 (2011), 91--108.",
      "doi": ""
    },
    {
      "text": "Brooks, J. O., Smolentzov, L., Mossey, M. E., Carroll, C., Kendrick, K., Sprogis, K., . . . Green, K. \"Group Differences in Preferences for a Novel Nightstand. Health Environments Research and Design Journal 5, 4 (2011), 86--95.",
      "doi": ""
    },
    {
      "text": "Fong, T., Nourbakhsh, I., and Dautenhahn, K., A Survey of Socially Interactive Robots. Robotics and Autonomous Systems 42 (2003), 143--166.",
      "doi": ""
    },
    {
      "text": "Manganelli, J., Threatt, A., Brooks, J. O., Smolentzov, L., Mossey, M., Healy, S., . . . Green, K. Examination of overbed tables: Health care provider & user preferences. Health Environments Research and Design Journal 6, 3 (2013), 9--29.",
      "doi": ""
    },
    {
      "text": "Manganelli, J., Threatt, A., Brooks, J. O., Healy, S., Merino, J., Yanik, P., Walker, I. D., Green, K. E. Examination of how and why over-the-bed tables are used: Use cases and needs from healthcare providers. Health Environments Research and Design Journal, Manuscript submitted for publication, (2013).",
      "doi": ""
    },
    {
      "text": "Manganelli, J., Threatt, A., Brooks, J. O., Merino, J., Yanik, P., Healy, S., Walker, I., Green, K. Validating over-the-bed tables use cases & need statements: Health care providers assessment. Health Environments Research and Design Journal, Manuscript submitted for publication, (2013).",
      "doi": ""
    },
    {
      "text": "McCullough, M. Digital Ground. MIT Press, Cambridge, MA, USA, 2004.",
      "doi": ""
    },
    {
      "text": "Merino, J., Threatt, A. L., Walker, I. D., & Green, K. E. Forward Kinematic Model for Continuum Robotic Surfaces. Proc. IROS 2012 (2012), 3453--3460.",
      "doi": ""
    },
    {
      "text": "Mitchell, W. J., e-topia. MIT Press, Cambridge, MA, USA, 2000.",
      "doi": ""
    },
    {
      "text": "National Institute of Health. Post-Stroke Rehabilitation Fact Sheet: National Institute of Neurological Disorders and Stroke (NINDS). http://www.ninds.nih.gov/disorders/stroke/poststrokereh ab.htm#whatis.",
      "doi": ""
    },
    {
      "text": "National Stroke Association. www.stroke.org.",
      "doi": ""
    },
    {
      "text": "National Stroke Association. Paralysis - Hemiparesis National Stroke Association. http://www.stroke.org/site/PageServer?pagename=hemi paresis.",
      "doi": ""
    },
    {
      "text": "National Stroke Association. Stroke 101 Fact Sheet. http://www.stroke.org/site/DocServer/STROKE_101_Fa ct_Sheet.pdf?docID=4541.",
      "doi": ""
    },
    {
      "text": "Negroponte, N., Soft Architecture Machines. MIT Press, Cambridge, MA, USA, 1975.",
      "doi": ""
    },
    {
      "text": "Norman, D. A. The Next UI Breakthrough, Part 2: Physicality. Interactions 14, 4 ACM Press (July & August 2007), 46--47.  ",
      "doi": "10.1145/1273961.1273986"
    },
    {
      "text": "Park, K., Bien, Z., Lee, J., Byung, K., Lim, J., Kim, J., et. al. Robotic smart house to assist people with movement disabilities. Auton Robot 22 (2007) 183--198.  ",
      "doi": "10.1007/s10514-006-9012-9"
    },
    {
      "text": "Smolentzov, L. Desired Characteristics of 'Smart' Nightstands for Higher and Lower Functioning Older Adults. Master's thesis, Clemson University, ProQuest LLC (2010).",
      "doi": ""
    },
    {
      "text": "Teasell, R., McClure, A., Katherine, Salter, & MurieFernandez, M. Evidence-Based Review of Stroke Rehabilitation D. Cognitive Recovery Post-Stroke Educational Supplement. http://www.ebrsr.com/~ebrsr/uploads/D_Cognitive_Dis orders_(PR).pdf.",
      "doi": ""
    },
    {
      "text": "Threatt, A. L., Merino, J., Green, K. E., Walker, I. D., Brooks, J. O., Ficht, S., . . . Yanik, P. A Vision of the Patient Room as an Architectural-Robotic Ecosystem. Proc. IROS 2012 (2012), archival video and 3322--3323.",
      "doi": ""
    },
    {
      "text": "Travis, D. \"Measuring satisfaction: Beyond the usability questionnaire.\" http://www.userfocus.co.uk/articles/satisfaction.html.",
      "doi": ""
    },
    {
      "text": "Tsui, K. M., Abu-Zahra, K., Casipe, R., M'Sadoques, J., & Drury, J. L. A process for developing specialized heuristics: Case study in assistive robotics. Technical Report 2009 11, University of Massachusetts Lowell, (2009).",
      "doi": ""
    },
    {
      "text": "Yanik, P., Manganelli, J., Merino, Threatt, T., Brooks, J. O., Green, K. E. and Walker, I. D. A Gesture Learning Interface for Simulated Robot Path Shaping with a Human Teacher. IEEE Transactions on Human Machine Systems. Journal article in-press (2014).",
      "doi": ""
    },
    {
      "text": "Zimmerman, J.; Forlizzi, J.; and Evenson, S., Research Through Design as a Method for Interaction Design Research in HCI. Proc. CHI 2007, ACM Press (2007) 493--50.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}