{
  "doi": "10.1145/2556288.2557280",
  "title": "Conversing with children: cartoon and video people elicit similar conversational behaviors",
  "published": "2014-04-26",
  "proctitle": "CHI '14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1787-1796",
  "year": 2014,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Interactive animated characters have the potential to engage and educate children, but there is little research on children's interactions with animated characters and real people. We conducted an experiment with 69 children between the ages of 4 and 10 years to investigate how they might engage in conversation differently if their interactive partner appeared as a cartoon character or as a person. A subset of the participants interacted with characters that displayed exaggerated and damped facial motion. The children completed two conversations with an adult confederate who appeared once as herself through video and once as a cartoon character. We measured how much the children spoke and compared their gaze and gesture patterns. We asked them to rate their conversations and indicate their preferred partner. There was no difference in children's conversation behavior with the cartoon character and the person on video, even among those who preferred the person and when the cartoon exhibited altered motion. These results suggest that children will interact with animated characters as they would another person.",
  "tags": [
    "children",
    "conversation",
    "facial motion",
    "avatar",
    "behavior",
    "animated character",
    "agent"
  ],
  "authors": [
    {
      "name": "Jennifer Hyde",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959130257",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    },
    {
      "name": "Jessica K. Hodgins",
      "institution": "Carnegie Mellon University & Disney Research, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100049661",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth J. Carter",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466641562",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrist, S., Pejsa, T., Mutlu, B., and Gleicher, M. Designing effective gaze mechanisms for virtual agents. In Proc. CHI 2012, ACM Press (2012), 705--714.  ",
      "doi": "10.1145/2207676.2207777"
    },
    {
      "text": "Baldwin, D., and Tomasello, M. Word learning: A window on early pragmatic understanding. In Proc. Child Language Research Forum. Chicago, IL, 2001, 3--23.",
      "doi": ""
    },
    {
      "text": "Bartneck, C., and Reichenbach, J. Subtle emotional expressions of synthetic characters. International Journal of Human-Computer Studies 62, 2 (2005), 179--192.  ",
      "doi": "10.1016/j.ijhcs.2004.11.006"
    },
    {
      "text": "Black, M., Chang, J., Chang, J., and Narayanan, S. Comparison of child-human and child-computer interactions based on manual annotations. In Proc. Workshop on Child, Computer and Interaction 2009 (2009).  ",
      "doi": "10.1145/1640377.1640379"
    },
    {
      "text": "Boker, S. M., Cohn, J. F., Theobald, B.-J., Matthews, I., Brick, T. R., and Spies, J. R. Effects of damping head movement and facial expression in dyadic conversation using real-time facial expression tracking and synthesized avatars. Phil. Trans. R. Soc. B 364, 1535 (2009), 3485--3495.",
      "doi": ""
    },
    {
      "text": "Borgers, N., de Leeuw, E., and Hox, J. Children as respondents in survey research: Cognitive development and response quality 1. Bulletin de Méthodologie Sociologique 66, 1 (2000), 60--75.",
      "doi": ""
    },
    {
      "text": "Borgers, N., Hox, J., and Sikkel, D. Response effects in surveys on children and adolescents: The effect of number of response options, negative wording, and neutral mid-point. Quality & Quantity 38, 1 (2004), 17--33.",
      "doi": ""
    },
    {
      "text": "Burleson, W., and Picard, R. W. Gender-Specific approaches to developing emotionally intelligent learning companions. IEEE Intelligent Systems 22, 4 (2007), 62--69.  ",
      "doi": "10.1109/MIS.2007.69"
    },
    {
      "text": "Calder, A. J., Rowland, D., Young, A. W., Nimmo-Smith, I., Keane, J., and Perrett, D. I. Caricaturing facial expressions. Cognition 76, 2 (2000), 105--146.",
      "doi": ""
    },
    {
      "text": "Calder, A. J., Young, A. W., Rowland, D., and Perrett, D. I. Computer-enhanced emotion in facial expressions. Phil. Trans. R. Soc. B 264 (1997), 919--925.",
      "doi": ""
    },
    {
      "text": "Cassell, J. Embodied conversational agents: representation and intelligence in user interfaces. AI Magazine 22, 4 (2001), 67. ",
      "doi": "10.5555/567363.567368"
    },
    {
      "text": "Cassell, J., and Tartaro, A. Intersubjectivity in human-agent interaction. Interaction Studies 8, 3 (2007), 391--410.",
      "doi": ""
    },
    {
      "text": "Cootes, T. F., Edwards, G. J., and Taylor, C. J. Active appearance models. IEEE Trans. on Pattern Analysis and Machine Intelligence 23, 6 (2001), 681--685.  ",
      "doi": "10.1109/34.927467"
    },
    {
      "text": "Cootes, T. F., Wheeler, G., Walker, K., and Taylor, C. J. View-based active appearance models. Image and Vision Computing 20, 9-10 (2002), 657--664.",
      "doi": ""
    },
    {
      "text": "Costa, P. T., and MacCrae, R. R. Revised NEO Personality Inventory (NEO PI-R) and NEO Five-Factor Inventory (NEO FFI): Professional Manual. Psychological Assessment Resources, 1992.",
      "doi": ""
    },
    {
      "text": "Coulston, R., Oviatt, S., and Darves, C. Amplitude convergence in children's conversational speech with animated personas. In Proc. International Conference on Spoken Language Processing, vol. 4 (2002), 2689--2692.",
      "doi": ""
    },
    {
      "text": "Darves, C., Oviatt, S., and Coulston, R. Adaptation of users' spoken dialogue patterns in a conversational interface. In Proc. International Conference on Spoken Language Processing, vol. 1 (2002), 561--564.",
      "doi": ""
    },
    {
      "text": "de Melo, C. M., Carnevale, P., and Gratch, J. The impact of emotion displays in embodied agents on emergence of cooperation with people. Presence 20, 5 (2011), 449--465.  ",
      "doi": "10.1162/PRES_a_00062"
    },
    {
      "text": "Grist, C. L., Socha, A., and McCord, D. M. The M5-PS-35: A five-factor personality questionnaire for preschool children. Journal of Personality Assessment 94, 3 (2012), 287--295.",
      "doi": ""
    },
    {
      "text": "Guadagno, R. E., Swinth, K. R., and Blascovich, J. Social evaluations of embodied agents and avatars. Computers in Human Behavior 27, 6 (2011), 2380--2385.  ",
      "doi": "10.1016/j.chb.2011.07.017"
    },
    {
      "text": "Hayes, D. Anytime Playdate: Inside the Preschool Entertainment Boom, or How Television Became My Baby's Best Friend. Free Press, New York, NY, 2008.",
      "doi": ""
    },
    {
      "text": "Hess, U., Blairy, S., and Kleck, R. E. The intensity of emotional facial expressions and decoding accuracy. Journal of Nonverbal Behavior 21, 4 (1997), 241--257.",
      "doi": ""
    },
    {
      "text": "Hyde, J., Carter, E. J., Kiesler, S., and Hodgins, J. K. Perceptual effects of damped and exaggerated facial motion in animated characters. In Proc. IEEE International Conference on Automatic Face and Gesture Recognition 2013 (2013).",
      "doi": ""
    },
    {
      "text": "Kirkorian, H. L., Wartella, E. A., and Anderson, D. R. Media and young children's learning. Children and Electronic Media 18, 1 (2008), 39--61.",
      "doi": ""
    },
    {
      "text": "Knowles, A. D., and Nixon, M. C. Children's comprehension of expressive states depicted in a television cartoon. Australian Journal of Psychology 41, 1 (1989), 17--24.",
      "doi": ""
    },
    {
      "text": "Linebarger, D. L., and Walker, D. Infants' and toddlers' television viewing and language outcomes. American Behavioral Scientist 46, X (2004), 1--21.",
      "doi": ""
    },
    {
      "text": "Matthews, I., and Baker, S. Active appearance models revisited. International Journal of Computer Vision 60 (2004), 135--164.  ",
      "doi": "10.1023/B%3AVISI.0000029666.37597.d3"
    },
    {
      "text": "Max Planck Institute for Psycholinguistics, The Language Archive, Nijmegen, The Netherlands. ELAN. http://tla.mpi.nl/tools/tla-tools/elan.",
      "doi": ""
    },
    {
      "text": "Oviatt, S. Talking to thimble jellies: Children's conversational speech with animated characters. In Proc. INTERSPEECH 2000 (2000), 877--880.",
      "doi": ""
    },
    {
      "text": "Read, J. C., and MacFarlane, S. Using the fun toolkit and other survey methods to gather opinions in child computer interaction. In Proc. IDC 2006, ACM Press (2006), 81--88.  ",
      "doi": "10.1145/1139073.1139096"
    },
    {
      "text": "Rideout, V. J., Vandewater, E. A., and Wartella, E. A. Zero to six: Electronic media in the lives of infants, toddlers and preschoolers. Tech. rep., The Henry J. Kaiser Family Foundation, 2003.",
      "doi": ""
    },
    {
      "text": "Scheck, A. M., L. Alvin Malesky, J., Grist, C. L., and McCord, D. M. Personality in preschool children: Preliminary psychometrics of the M5-PS questionnaire. American Journal of Psychological Research 6, 1 (2010), 134--156.",
      "doi": ""
    },
    {
      "text": "Sloetjes, H., and Wittenburg, P. Annotation by category: ELAN and ISO DCR. In Proc. LREC (2008).",
      "doi": ""
    },
    {
      "text": "Tam, J., Carter, E., Kiesler, S., and Hodgins, J. Video increases the perception of naturalness during remote interactions with latency. In Proc. CHI EA 2012, ACM Press (2012), 2045--2050.  ",
      "doi": "10.1145/2212776.2223750"
    },
    {
      "text": "Theobald, B.-J., Matthews, I., Mangini, M., Spies, J. R., Brick, T. R., Cohn, J. F., and Boker, S. M. Mapping and manipulating facial expression. Language and Speech 52 (2009), 369--386.",
      "doi": ""
    },
    {
      "text": "Troseth, G. L., Saylor, M. M., and Archer, A. H. Young children's use of video as a source of socially relevant information. Child Development 77, 3 (2006), 786--799.",
      "doi": ""
    },
    {
      "text": "Widen, S. C., and Russell, J. A. Children acquire emotion categories gradually. Cognitive Development 23, 2 (2008), 291--312.",
      "doi": ""
    },
    {
      "text": "Zaman, B., Abeele, V. V., and Grooff, D. D. Measuring product liking in preschool children: An evaluation of the Smileyometer and this or that methods. International Journal of Child-Computer Interaction 1, 1 (2013), 61--70.",
      "doi": ""
    }
  ]
}