{
  "doi": "10.1145/3290605.3300829",
  "title": "Emotion and Experience in Negotiating HIV-Related Digital Resources: \"It's not just a runny nose!\"",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "While digital technologies are increasingly being used to provide support and diagnoses remotely, it is unclear whether they offer adequate emotional support and appropriate messages in navigating complex, stigmatised and sensitive conditions that can have a momentous impact on people's lives. In this paper, we investigate how and why people access existing HIV resources, and their experiences of using these resources through a survey with 197 respondents and an interview and think-aloud study with 28 participants. Our findings indicate that many HIV-related resources do not address the anxiety-provoking reasons for access, reinforce stigma and neglect to provide important information and emotional support. We finally discuss potential ways of addressing these issues in the current environment where more sexual health services are being delivered online.",
  "authors": [
    {
      "name": "Aneesha Singh",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81502753265/rel-imgonly/aneeshalinkedinphoto.jpg",
      "acmid": "81502753265",
      "orcid": "0000-0003-0835-5802"
    },
    {
      "name": "Jo Gibbs",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259197357",
      "orcid": "0000-0001-5696-0260"
    },
    {
      "name": "Ann Blandford",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100644401/rel-imgonly/p1010038.jpg",
      "acmid": "81100644401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ann Blandford and Simon Attfield. 2010. Interacting with Information. Synthesis Lectures on Human-Centered Informatics 3, 1: 1--99. ",
      "doi": "10.5555/1824367"
    },
    {
      "text": "M Brady, G Carpenter, and B Bard. 2016. Self-testing for HIV: initial experience of the UK's first kit. 22nd Annual Conference of the British HIV.",
      "doi": ""
    },
    {
      "text": "M Brady, W Howells, C James, D Edwardes, B Bard, and G Carpenter. 2017. HIV self-testing: Feasibility and acceptability of a large scale national service. HIV Medicine 18: 5.",
      "doi": ""
    },
    {
      "text": "Dale E. Brashers, Judith L. Neidig, and Daena J. Goldsmith. 2004. Social Support and the Management of Uncertainty for People Living With HIV or AIDS. Health Communication 16, 3: 305--331.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Johanna Brewer, Joseph \"Jofish\" Kaye, Amanda Williams, and Susan Wyche. 2006. Sexual interactions: why we should talk about sex in HCI. In CHI '06 extended abstracts on Human factors in computing systems - CHI EA '06, 1695.  ",
      "doi": "10.1145/1125451.1125765"
    },
    {
      "text": "Alison Brown, Colin Campbell, Cuong Chau, Sara Croxford, Maciej Czachorowski, Jennifer Davidson, Valerie Delpech, Rachel Glass, Luis Guerra, Viv Hope, Gwenda Hughes, Georgina Ireland, Peter Kirwan, Maeve Lalor, Louise Logan, Sema Mandal, Holly Mitchell, Hamish Mohammed, Anthony Nardone, Eamonn O 'moore, Claire Reynolds, Ruth Simmons, Bhavita Vishram, John Were, and Dominik Zenner. 2016. HIV testing in England: 2016 report. Retrieved April 28, 2017 from www.gov.uk/phe",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and John Bird. 2016. Disclose-ItYourself: Security and Privacy for People Living with HIV. In CHI EA '16: Proceedings of the 2016 ACM annual conference on Human Factors in Computing Systems Extended Abstracts, 1--4.",
      "doi": ""
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and George Buchanan. 2016. It Feels Like I'M Managing Myself: HIV+ People Tracking Their Personal Health Information. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16), 55:1-- 55:10.  ",
      "doi": "10.1145/2971485.2971542"
    },
    {
      "text": "Rose G. Campbell and Austin S. Babrow. 2009. Health Communication The Role of Empathy in Responses to Persuasive Risk Communication: Overcoming Resistance to HIV Prevention Messages. Health Communication 16, 2: 159--182.",
      "doi": ""
    },
    {
      "text": "Soazig Clifton, Anthony Nardone, Nigel Field, Catherine H Mercer, Clare Tanton, Wendy Macdowall, Anne M Johnson, and Pam Sonnenberg. 2016. HIV testing, risk perception, and behaviour in the British population. AIDS (London, England) 30, 6: 943--52.",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen, Gary Evans, Daniel Stokols, and David Krantz. 1986. Behavior, health, and environmental stress. Plenum Press.",
      "doi": ""
    },
    {
      "text": "J. R. Dale, S. M. Williams, and V. Bowyer. 2012. What is the effect of peer support on diabetes outcomes in adults? A systematic review. Diabetic Medicine 29, 11: 1361--1377.",
      "doi": ""
    },
    {
      "text": "J. Deblonde, P. De Koker, F. F. Hamers, J. Fontaine, S. Luchters, and M. Temmerman. 2010. Barriers to HIV testing in Europe: a systematic review. The European Journal of Public Health 20, 4: 422--432.",
      "doi": ""
    },
    {
      "text": "J. Deblonde, P. De Koker, F. F. Hamers, J. Fontaine, S. Luchters, and M. Temmerman. 2010. Barriers to HIV testing in Europe: a systematic review. The European Journal of Public Health 20, 4: 422--432.",
      "doi": ""
    },
    {
      "text": "Brenda Dervin and CD Reinhard. 2007. How emotional dimensions of situated information seeking relate to user evaluations of help from sources: an exemplar study informed by sense-making. In Information and emotion?: the emergent affective paradigm in information behavior research and theory, Diane Nahl and Dania Bilal (eds.). Information Today, 51--84.",
      "doi": ""
    },
    {
      "text": "Public Health England. 2015. HIV in the UK -- Situation Report 2015 Incidence, prevalence and prevention. Protecting and Improving the Nations Health 1, 1: 1--20. Retrieved September 3, 2016 from www.gov.uk/phe",
      "doi": ""
    },
    {
      "text": "P Flowers, J Riddell, C Park, B Ahmed, I Young, J Frankis, M Davis, M Gilbert, C Estcourt, L Wallace, and L. M. McDaid. 2017. Preparedness for use of the rapid result HIV self-test by gay men and other men who have sex with men (MSM): a mixed methods exploratory study among MSM and those involved in HIV prevention and care. HIV Medicine 18, 4: 245--255.",
      "doi": ""
    },
    {
      "text": "Paul Flowers, Claudia Estcourt, Pam Sonnenberg, and Fiona Burns. 2017. HIV testing intervention development among men who have sex with men in the developed world. Sexual Health 14, 1: 80--88.",
      "doi": ""
    },
    {
      "text": "B J Fogg. 2009. A behavior model for persuasive design. In the 4th International Conference on Persuasive Computing, 40:1--40:7. http://portal.acm.org/citation.cfm?doid=1541948.1541999  ",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Shelagh K. Genuis. 2012. Constructing \"sense\" from evolving health information: A qualitative investigation of information seeking and sense making across sources. Journal of the American Society for Information Science and Technology 63, 8: 1553--1566.  ",
      "doi": "10.1002/asi.22691"
    },
    {
      "text": "Natalya Godbold. 2013. An information need for emotional cues: unpacking the role of emotions in sense making. Information Research 18, 1.",
      "doi": ""
    },
    {
      "text": "Sarit A. Golub and Kristi E. Gamarel. 2013. The Impact of Anticipated HIV Stigma on Delays in HIV Testing Behaviors: Findings from a Community-Based Sample of Men Who Have Sex with Men and Transgender Women in New York City. AIDS Patient Care and STDs 27, 11: 621--627.",
      "doi": ""
    },
    {
      "text": "Emma Harding-Esch, Anthony Nardone, Jo Gibbs, Lorna Sutcliffe, Pam Sonnenberg, Claudia Estcourt, Gwenda Hughes, Hamish Mohammed, Noel Gill, S Tariq Sadiq, and Catherine Lowndes. 2015. Can remote STI/HIV testing and eClinical Care be compatible with robust public health surveillance? In DH'15: proceedings of the 5th International Conference on Digital Health 2015?: May 18--20, 2015: 129--130.  ",
      "doi": "10.1145/2750511.2750517"
    },
    {
      "text": "Ford Hickson, Keith Tomlin, James Hargreaves, Chris Bonell, David Reid, and Peter Weatherburn. 2015. Internet-based cohort study of HIV testing over 1 year among men who have sex with men living in England and exposed to a social marketing intervention promoting testing. Sexually transmitted infections 91, 1: 24--30.",
      "doi": ""
    },
    {
      "text": "Randolph D. Hubach, Brian Dodge, Michael J. Li, Vanessa Schick, Debby Herbenick, William D. Ramos, Thea Cola, and Michael Reece. 2015. Loneliness, HIV-Related Stigma, and Condom Use Among a Predominantly Rural Sample of HIV-Positive Men Who Have Sex With Men (MSM). AIDS Education and Prevention 27, 1: 72--83.",
      "doi": ""
    },
    {
      "text": "Heidi Julien and Ina Fourie. 2015. Reflections of affect in studies of information behavior in HIV/AIDS contexts: An exploratory quantitative content analysis. Library & Information Science Research 37, 1: 3--9.",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI talks about sexuality. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, 695.",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Lisa W. Kimbrough, Holly E. Fisher, Kenneth T. Jones, Wayne Johnson, Sekhar Thadiparthi, and Samuel Dooley. 2009. Accessing Social Networks With High Rates of Undiagnosed HIV Infection: The Social Networks Demonstration Project. American Journal of Public Health 99, 6: 1093--1099.",
      "doi": ""
    },
    {
      "text": "Tassaneewan Laksanasopin, Tiffany W. Guo, Samiksha Nayak, Archana A. Sridhara, Shi Xie, Owolabi O. Olowookere, Paolo Cadinu, Fanxing Meng, Natalie H. Chee, Jiyoon Kim, Curtis D. Chin, Elisaphane Munyazesa, Placidie Mugwaneza, Alex J. Rai, Veronicah Mugisha, Arnold R. Castro, David Steinmiller, Vincent Linder, Jessica E. Justman, Sabin Nsanzimana, and Samuel K. Sia. 2015. Supplementary Information: A smartphone dongle for diagnosis of infectious diseases at the point of care. Science translational medicine 7, 273: 273re1.",
      "doi": ""
    },
    {
      "text": "C P Langford, J Bowsher, J P Maloney, and P P Lillis. 1997. Social support: a conceptual analysis. Journal of advanced nursing 25, 1: 95-- 100. http://www.ncbi.nlm.nih.gov/pubmed/9004016",
      "doi": ""
    },
    {
      "text": "Carolyn Lauckner and Gary Hsieh. 2013. The presentation of healthrelated search results and its impact on negative emotional outcomes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 333.  ",
      "doi": "10.1145/2470654.2470702"
    },
    {
      "text": "Ramon Lee, Rosa R. Cui, Kathryn E. Muessig, Harsha Thirumurthy, and Joseph D. Tucker. 2014. Incentivizing HIV/STI testing: A systematic review of the literature. AIDS and Behavior 18, 905--912.",
      "doi": ""
    },
    {
      "text": "Duncan A. MacKellar, Su-I Hou, Christopher C. Whalen, Karen Samuelsen, Travis Sanchez, Amanda Smith, Damian Denson, Amy Lansky, and Patrick Sullivan. 2011. Reasons for Not HIV Testing, Testing Intentions, and Potential Use of an Over-the-Counter Rapid HIV Test in an Internet Sample of Men Who Have Sex With Men Who Have Never Tested for HIV. Sexually Transmitted Diseases 38, 5: 419--428.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Arlene M. Smaldone, and Suzanne R. Bakken. 2015. Adopting the sensemaking perspective for chronic disease selfmanagement. Journal of Biomedical Informatics 56: 406--417.  ",
      "doi": "10.1016/j.jbi.2015.06.006"
    },
    {
      "text": "Gabriela Marcu, Nadia Dowshen, Shuvadittya Saha, Ressa Reneth Sarreal, and Nazanin Andalibi. 2016. TreatYoSelf: Empathy-driven behavioral intervention for marginalized youth living with HIV. In Proceedings of the International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth 2016), 1--8. ",
      "doi": "10.5555/3021319.3021330"
    },
    {
      "text": "Omar Martinez, Elwin Wu, Ethan C. Levine, Miguel Muñoz-Laboy, M. Isabel Fernandez, Sarah Bauerle Bass, Eva M. Moya, Timothy Frasca, Silvia Chavez-Baray, Larry D. Icard, Hugo Ovejero, Alex Carballo-Diéguez, and Scott D. Rhodes. 2016. Integration of Social, Cultural, and Biomedical Strategies into an Existing Couple-Based Behavioral HIV/STI Prevention Intervention: Voices of Latino Male Couples. PLOS ONE 11, 3: e0152361.",
      "doi": ""
    },
    {
      "text": "Marifran Mattson. 1999. Toward a reconceptualization of communication cues to action in the health belief model: HIV test counseling. Communication Monographs 66, 3: 240--265.",
      "doi": ""
    },
    {
      "text": "Chrysta C Meadowbrooke, Tiffany C Veinot, Jimena Loveluck, Andrew Hickok, and José A Bauermeister. 2014. Information Behavior and HIV Testing Intentions Among Young Men at Risk for HIV/AIDS. Journal of the Association for Information Science and Technology 65, 3: 609--620.  ",
      "doi": "10.1002/asi.23001"
    },
    {
      "text": "Susan Michie, Stefanie Ashford, Falko F Sniehotta, Stephan U Dombrowski, Alex Bishop, and David P French. 2011. A refined taxonomy of behaviour change techniques to help people change their physical activity and healthy eating behaviours: The CALO-RE taxonomy. Psychology & Health: 1--20.",
      "doi": ""
    },
    {
      "text": "Kathryn E Muessig, Cedric H Bien, Chongyi Wei, Elaine J Lo, Min Yang, Joseph D Tucker, Ligang Yang, Gang Meng, and Lisa B Hightow-Weidman. 2015. A Mixed-Methods Study on the Acceptability of Using eHealth for HIV Prevention and Sexual Health Care Among Men Who Have Sex With Men in China. J Med Internet ResJ Med Internet Res 1717, 414.",
      "doi": ""
    },
    {
      "text": "Kathryn E Muessig, Emily C Pike, Sara LeGrand, and Lisa B Hightow-Weidman. 2013. Mobile Phone Applications for the Care and Prevention of HIV and Other Sexually Transmitted Diseases: A Review. Journal of Medical Internet Research 15, 1: e1.",
      "doi": ""
    },
    {
      "text": "E D Mynatt, G D Abowd, L Mamykina, and J A Kientz. 2010. Understanding the Potential of Ubiquitous Computing for Chronic Disease Management. Health Informatics: A Patient-Centered Approach to Diabetes: 85--106.",
      "doi": ""
    },
    {
      "text": "Diane. Nahl and Dania Bilal. 2007. Information and emotion?: the emergent affective paradigm in information behavior research and theory. Information Today.",
      "doi": ""
    },
    {
      "text": "Kimberly M. Nelson, Hanne Thiede, Richard A. Jenkins, James W. Carey, Rebecca Hutcheson, and Matthew R. Golden. 2014. Personal and Contextual Factors Related to Delayed HIV Diagnosis Among Men Who Have Sex With Men. AIDS Education and Prevention 26, 2: 122--133.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Transactions on Computer-Human Interaction 22, 6: 1--45.  ",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E. Blandford. 2014. Gaining empathy for non-routine mobile device use through autoethnography. Proc ACM CHI '14: 987--990.  ",
      "doi": "10.1145/2556288.2557179"
    },
    {
      "text": "Carla Makhlouf Obermeyer and Michelle Osborn. 2007. The utilization of testing and counseling for HIV: a review of the social and behavioral evidence. American journal of public health 97, 10: 1762--74.",
      "doi": ""
    },
    {
      "text": "Patrick Cheong-Iao Pang, Shanton Chang, Karin Verspoor, and Jon Pearce. 2016. Designing Health Websites Based on Users' WebBased Information-Seeking Behaviors: A Mixed-Method Observational Study. Journal of medical Internet research 18, 6: e145.",
      "doi": ""
    },
    {
      "text": "Patrick Cheong-Iao Pang, Karin Verspoor, Jon Pearce, and Shanton Chang. 2015. Better Health Explorer. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction on - OzCHI '15, 588--597.",
      "doi": "10.1145/2838739.2838772"
    },
    {
      "text": "Pennpstar.org. 2017. Getting to Know Get Connected | Penn HIV | LGBT Public Health | PSTAR | Philadelphia. Retrieved December 30, 2018 from https://www.pennpstar.org/single-post/Getting-to-KnowGet-Connected",
      "doi": ""
    },
    {
      "text": "plainlanguage.gov. Repurpose print material for the web | plainlanguage.gov. Retrieved December 26, 2018 from https://plainlanguage.gov/guidelines/web/repurpose-print-material/",
      "doi": ""
    },
    {
      "text": "Public Health England. 2017. HIV testing in England: 2017 report. Retrieved December 30, 2018 from https://assets.publishing.service.gov.uk/government/uploads/system/ uploads/attachment_data/file/759270/HIV_testing_in_England_2017 _report.pdf",
      "doi": ""
    },
    {
      "text": "Yangyang Qiu, Dan Luo, Rui Cheng, Yi Xiao, Xi Chen, Zhulin Huang, and Shuiyuan Xiao. 2014. {Emotional problems and related factors in patients with HIV/AIDS}. Zhong nan da xue xue bao. Yi xue ban = Journal of Central South University. Medical sciences 39, 8: 835--41.",
      "doi": ""
    },
    {
      "text": "Irwin M Rosenstock. 1974. Historical Origins of the Health Belief Model. Health Education Monographs 2, 4: 328--335. http://heb.sagepub.com/content/2/4/328.short.",
      "doi": ""
    },
    {
      "text": "Daniel M. Russell, Mark J. Stefik, Peter Pirolli, and Stuart K. Card. 1993. The cost structure of sensemaking. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '93, 269--276.  ",
      "doi": "10.1145/169059.169209"
    },
    {
      "text": "Daniel M Russell, Gregorio Convertino, Aniket Kittur, Peter Pirolli, and Elizabeth Anne Watkins. 2018. Sensemaking in a Senseless World. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--7.  ",
      "doi": "10.1145/3170427.3170636"
    },
    {
      "text": "R Savolainen. 2015. Approaching the affective factors of information seeking: The viewpoint of the lnformation search process model. In Proceedings of ISIC, the Information Behaviour Conference.",
      "doi": ""
    },
    {
      "text": "Hyman M. Scott, Lance Pollack, Gregory M. Rebchook, David M. Huebner, John Peterson, and Susan M. Kegeles. 2014. Peer Social Support is Associated with Recent HIV Testing Among Young Black Men Who Have Sex with Men. AIDS and Behavior 18, 5: 913--920.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Nadia Bianchi-berthouze, and Amanda Cdec Williams. 2017. Supporting Everyday Function in Chronic Pain Using Wearable Technology. In Chi 2017, 3903--3915.  ",
      "doi": "10.1145/3025453.3025947"
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, Claudia Estcourt, Pam Sonnenberg, and Ann Blandford. 2017. Are HIV Smartphone Apps and Online Interventions Fit for Purpose? In Proceedings of the 2017 International Conference on Digital Health - DH '17, 6--15.  ",
      "doi": "10.1145/3079452.3079469"
    },
    {
      "text": "Freya Spielberg, Bernard M Branson, Gary M Goldbaum, David Lockhart, Ann Kurth, Connie L Celum, Anthony Rossini, Cathy W Critchlow, and Robert W Wood. 2003. Overcoming barriers to HIV testing: preferences for new strategies among clients of a needle exchange, a sexually transmitted disease clinic, and sex venues for men who have sex with men. Journal of acquired immune deficiency syndromes (2003) 32, 3: 318--27.",
      "doi": ""
    },
    {
      "text": "Tiffany C. Veinot, Ebony Caldwell, Jimena Loveluck, Michael P. Arnold, and José Bauermeister. 2016. HIV Testing Behavior and Social Network Characteristics and Functions Among Young Men Who have Sex with Men (YMSM) in Metropolitan Detroit. AIDS and Behavior 20, 11: 2739--2761.",
      "doi": ""
    },
    {
      "text": "Tiffany Christine Veinot, Chrysta Cathleen Meadowbrooke, Jimena Loveluck, Andrew Hickok, and Jose Artruro Bauermeister. 2013. How \"Community\" Matters for How People Interact With Information: Mixed Methods Study of Young Men Who Have Sex With Other Men. Journal of Medical Internet Research 15, 2: e33.",
      "doi": ""
    },
    {
      "text": "WHO. 2016. WHO | HIV/AIDS. WHO. Retrieved April 28, 2017 from http://www.who.int/features/qa/71/en/%0D",
      "doi": ""
    },
    {
      "text": "WHO, UNICEF, and UNAIDS. 2011. Towards universal access. Vasa: 1--233. https://doi.org/ISBN 978 92 4 150298 6",
      "doi": ""
    },
    {
      "text": "Matthew Wood, Andrew Garbett, Kellie Morrissey, Peter Hopkins, and Madeline Balaam. 2018. \" Protection on that Erection??\": Discourses of Accountability & Compromising Participation in Digital Sexual Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1--12.  ",
      "doi": "10.1145/3173574.3174238"
    },
    {
      "text": "Wendy Wood and David T Neal. 2007. A new look at habits and the habit-goal interface. Psychological review 114, 4: 843--863.",
      "doi": ""
    }
  ]
}