{
  "doi": "10.1145/3290605.3300833",
  "title": "Voice as a Design Material: Sociophonetic Inspired Design Strategies in Human-Computer Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "While there is a renewed interest in voice user interfaces (VUI) in HCI, little attention has been paid to the design of VUI voice output beyond intelligibility and naturalness. We draw on the field of sociophonetics - the study of the social factors that influence the production and perception of speech - to highlight how current VUIs are based on a limited and homogenised set of voice outputs. We argue that current systems do not adequately consider the diversity of peoples' speech, how that diversity represents sociocultural identities, and how voices have the potential to shape user perceptions and experiences. Ultimately, as other technological developments have influenced the ideologies of language, the voice outputs of VUIs will influence the ideologies of speech. Based on our argument, we pose three design strategies for VUI voice output design - individualisation, context awareness, and diversification - to motivate new ways of conceptualising and designing these technologies.",
  "tags": [
    "sociophonetics",
    "voice user interface",
    "computer synthesized speech",
    "experience-centered design",
    "design material"
  ],
  "authors": [
    {
      "name": "Selina Jeanne Sutton",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705326",
      "orcid": "missing"
    },
    {
      "name": "Paul Foulkes",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658736437",
      "orcid": "missing"
    },
    {
      "name": "David Kirk",
      "institution": "Northumbria Univeristy, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accentism Project. 2018. Accentism Project. https://accentism.org/",
      "doi": ""
    },
    {
      "text": "Adapt Centre. 2018. ADAPT Associate Professor Sole Irish Recipient of the Google Faculty Research Award. https://www.adaptcentre.ie/news/ adapt-associate-professor-sole-irish-recipient-of-the-google-faculty-resear",
      "doi": ""
    },
    {
      "text": "Amazon. 2018. Echo & Alexa Devices. https://www.amazon.co.uk/b? ie=UTF8&node=14100223031",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Siri. https://www.apple.com/siri/",
      "doi": ""
    },
    {
      "text": "Matthew P. Aylett, Per Ola Kristensson, Steve Whittaker, and Yolanda Vazquez-Alvarez. 2014. None of a CHInd. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14. ACM Press, New York, New York, USA, 749--760.  ",
      "doi": "10.1145/2559206.2578868"
    },
    {
      "text": "Alex Baratta. 2017. Accent and Linguistic Prejudice within British Teacher Training. Journal of Language, Identity & Education 16, 6 (nov 2017), 416--423.",
      "doi": ""
    },
    {
      "text": "Allan Bell and Andy Gibson. 2008. Stopping and Fronting in New Zealand Pasifika English. University of Pennsylvania Working Papers in Linguistics 14, 2 (2008), 44--53. https://repository.upenn.edu/pwpl/ vol14/iss2/7/",
      "doi": ""
    },
    {
      "text": "Wiebe E. Bijker, Thomas P. Hughes, and Trevor J. Pinch. 1987. The Social Construction of Technological Systems: New Directions in the Sociology and History of Technology. MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Holly P. Branigan, Martin J. Pickering, Jamie Pearson, Janet F. McLean, and Ash Brown. 2011. The role of beliefs in lexical alignment: Evidence from dialogs with humans and computers. Cognition 121, 1 (oct 2011), 41--57.",
      "doi": ""
    },
    {
      "text": "Hadumod Bussmann. 1998. 'speech'. In Routledge Dictionary of Language and Linguistics. Taylor & Francis, London, UK, 1106.",
      "doi": ""
    },
    {
      "text": "Paulo João Cabral, Benjamin R. Cowan, Katja Zibrek, and Rachel McDonnell. 2017. The Influence of Synthetic Voice on the Evaluation of a Virtual Character. In Proceedings of INTERSPEECH 2017, the 18th conference of the International Speech Communication Association. 229--233.",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Phillip Doyle, Diego Garaialde, Emer Gilmartin, Stephan Schlögl, Jens Edlund, Matthew Aylett, João Cabral, Cosmin Munteanu, and Benjamin Cowan. In press. The State of Speech in HCI: Trends, Themes and Challenges. Interacting with Computers (In press). http: //arxiv.org/abs/1810.06828",
      "doi": ""
    },
    {
      "text": "Sandra Clarke. 2006. Nooz or nyooz?: The Complex Construction of Canadian Identity. Canadian Journal of Linguistics/Revue canadienne de linguistique 51, 2--3 (nov 2006), 225--246.",
      "doi": ""
    },
    {
      "text": "Michael H. Cohen, James P. Giangola, and Jennifer Balogh. 2004. Voice user interface design. Addison-Wesley Publishers. ",
      "doi": "10.5555/975074"
    },
    {
      "text": "Nikolas Coupland and Hywel Bishop. 2007. Ideologised values for British accents. Journal of Sociolinguistics 11, 1 (feb 2007), 74--93.",
      "doi": ""
    },
    {
      "text": "Benjamin R. Cowan, Holly Branigan, Habiba Begum, Lucy McKenna, and Eva Szekely. 2017. They Know as Much as We Do: Knowledge Estimation and Partner Modelling of Artificial Partners. In Proceedings of the 39th Annual Meeting of the Cognitive Science Society (CogSci2017), London, UK, 26--29 July 2017. 1836 -- 1841. https://mindmodeling.org/ cogsci2017/papers/0355/index.html",
      "doi": ""
    },
    {
      "text": "Benjamin R. Cowan, Derek Gannon, Jenny Walsh, Justin Kinneen, Eanna O'Keefe, and Linxin Xie. 2016. Towards Understanding How Speech Output Affects Navigation System Credibility. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 2805--2812.  ",
      "doi": "10.1145/2851581.2892469"
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. \"What can i help you with?\". In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '17. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "David Crystal. 2008. A dictionary of linguistics and phonetics (6th ed.). Blackwell Publishing, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Nils Dahlbäck, Seema Swamy, Clifford Nass, Fredrik Arvidsson, and Jörgen Skågeby. 2001. Spoken Interaction with Computers in a Native or Non-Native Language - Same of Different?. In Proceedings of INTERACT 2001 - International Conference on Human-Computer Interaction, Tokyo, Japan, July 9--13, 2001. 294--301.",
      "doi": ""
    },
    {
      "text": "Nils Dahlbäck, QianYing Wang, Clifford Nass, and Jenny Alwin. 2007. Similarity is more important than expertise. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 1553.  ",
      "doi": "10.1145/1240624.1240859"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. MIT Press, Cambridge, Massachusetts. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "John A. Dixon, Berenice Mahoney, and Roger Cocks. 2002. Accents of Guilt? Journal of Language and Social Psychology 21, 2 (jun 2002), 162--168.",
      "doi": ""
    },
    {
      "text": "Rob Drummond. 2016. Leave off, will you? Britain should celebrate 'regional' accents. http://theconversation.com/ leave-off-will-you-britain-should-celebrate-regional-accents-67952",
      "doi": ""
    },
    {
      "text": "Penelope. Eckert. 1989. Jocks and burnouts : social categories and identity in the high school. Teachers College Press, New York, USA.",
      "doi": ""
    },
    {
      "text": "Penelope Eckert. 2008. Variation and the indexical field1. Journal of Sociolinguistics 12, 4 (sep 2008), 453--476.",
      "doi": ""
    },
    {
      "text": "Paul Foulkes, James M. Scobbie, and Dominic J. L. Watt. 2010. Sociophonetics. In Handbook of Phonetic Sciences (2nd ed.), William J. Hardcastle, John Laver, and Fiona E. Gibbon (Eds.). Blackwell, Oxford, UK, 703--754.",
      "doi": ""
    },
    {
      "text": "Google. 2018. Google Assistant. https://assistant.google.com/{#} modal{_}active=none",
      "doi": ""
    },
    {
      "text": "Randy Allen. Harris. 2005. Voice interaction design : crafting the new conversational speech systems. Morgan Kaufmann Publishers, San Fransisco, California, USA. ",
      "doi": "10.5555/2821573"
    },
    {
      "text": "Arthur Hughes, Peter Trudgill, and Dominic J. L. Watt. 2013. English accents & dialects : an introduction to social and regional varieties of English in the British Isles (5th ed.).",
      "doi": ""
    },
    {
      "text": "Oliver Kamm. 2017. Lay off the yod-droppers -- all accents are 'bootiful'. https://www.thetimes.co.uk/article/ oliver-kamm-the-pedant-695wj30hk",
      "doi": ""
    },
    {
      "text": "Scott Fabius Kiesling. 1998. Men's Identities and Sociolinguistic Variation: The Case of Fraternity Men. Journal of Sociolinguistics 2, 1 (feb 1998), 69--99.",
      "doi": ""
    },
    {
      "text": "Simon King. 2015. A Reading list of recent advances in speech synthesis. In Proceedings of the 18th International Congress of Phonetic Sciences. Glasgow, UK, Paper number 1043. https://www.internationalphoneticassociation.org/ icphs-proceedings/ICPhS2015/Papers/ICPHS1043.pdf",
      "doi": ""
    },
    {
      "text": "William Labov. 1997. The Social Stratification of (r) in New York City Department Stores. In Sociolinguistics: A Reader, Nikolas Coupland and Adam Jaworski (Eds.). Springer, New York, USA, 168--178.",
      "doi": ""
    },
    {
      "text": "William Labov. 2001. The anatomy of style-shifting. In Style and Sociolinguistic Variation, Penelope Eckert and John Rickford (Eds.). Cambridge University Press, Cambridge, UK, 85--108.",
      "doi": ""
    },
    {
      "text": "John. Laver. 1994. Principles of phonetics. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Dick Leith. 1997. A social history of English (2nd ed.). Routledge, Oxon, UK.",
      "doi": ""
    },
    {
      "text": "Erez Levon. 2007. Sexuality in context: Variation and the sociolinguistic perception of identity. Language in Society 36, 4 (2007), 533--554.",
      "doi": ""
    },
    {
      "text": "Erez Levon. 2014. Categories, stereotypes, and the linguistic perception of sexuality. Language in Society 43, 5 (2014), 539--566.",
      "doi": ""
    },
    {
      "text": "Sue Ellen Linville. 1998. Acoustic correlates of perceived versus actual sexual orientation in men's speech. Folia phoniatrica et logopaedica : official organ of the International Association of Logopedics and Phoniatrics (IALP) 50, 1 (1998), 35--48.",
      "doi": ""
    },
    {
      "text": "Rosina Lippi-Green. 1997. Teaching children how to discriminate: What we learn from the Big Bad Wolf. In English with an Accent: Language, ideology, and discrimination in the United States. Routledge, New York, USA, 79--103.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\". In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Sara Mack and Benjamin Munson. 2012. The influence of /s/ quality on ratings of men's sexual orientation: Explicit and implicit measures of the 'gay lisp' stereotype. Journal of Phonetics 40, 1 (jan 2012), 198--212.",
      "doi": ""
    },
    {
      "text": "Jonathan Matusitz. 2012. Relationship between knowledge, stereotyping, and prejudice in interethnic communication. Journal of Tourism and Cultural Heritage 10, 1 (2012), 89--98.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as experience. MIT Press, Cambridge, Massachusetts. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "John McWhorter. 2013. Txtngiskillinglanguage. JK!!! https://www. ted.com/talks/john_mcwhorter_txtng_is_killing_language_jk",
      "doi": ""
    },
    {
      "text": "Microsoft. 2017. Cortana. https://www.microsoft.com/en-gb/ windows/cortana",
      "doi": ""
    },
    {
      "text": "Matthew Mills and Gillie Stoneham. 2017. The voice book for trans and non-binary people : a practical guide to creating and sustaining authentic voice and communication. Jessica Kingsley Publishers, London, UK.",
      "doi": ""
    },
    {
      "text": "James Milroy and Lesley Milroy. 1978. Belfast: change and variation in an urban vernacular. In Sociolinguistic patterns in British English, Peter Trudgill (Ed.). University Park Press, USA, 19--36.",
      "doi": ""
    },
    {
      "text": "James Milroy and Lesley Milroy. 2012. Authority in Language: Investigating Standard English. Taylor & Francis, Oxon, UK.",
      "doi": ""
    },
    {
      "text": "Roger K. Moore. 2017. Appropriate Voices for Artefacts: Some Key Insights. In Proceedings of the 1st International Workshop on Vocal Interactivity in-and-between Humans, Animals and Robots (VIHAR) Skvöde, Sweden, 25--26 Aug 2017. 7--11. http://vihar-2017.vihar.org/ assets/vihar2017_proceedings.pdf",
      "doi": ""
    },
    {
      "text": "Roger K. Moore. 2017. Is Spoken Language All-or-Nothing? Implications for Future Speech-Based Human-Machine Interaction. In Dialogues with Social Robots: Enablements, Analyses. and Evaluation, Kristina Jokinen and Graham Wilcock (Eds.). Springer, Singapore, 281-- 291.",
      "doi": ""
    },
    {
      "text": "Benjamin Munson, Elizabeth C. McDonald, Nancy L. DeBoe, and Aubrey R. White. 2006. The acoustic and perceptual bases of judgments of women and men's sexual orientation from read speech. Journal of Phonetics 34, 2 (apr 2006), 202--240.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Ben Cowan, Keisuke Nakamura, Pourang Irani, Sharon Oviatt, Matthew Aylett, Gerald Penn, Shimei Pan, Nikhil Sharma, Frank Rudzicz, and Randy Gomez. 2017. Designing Speech, Acoustic and Multimodal Interactions. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM Press, New York, New York, USA, 601--608.  ",
      "doi": "10.1145/3027063.3027086"
    },
    {
      "text": "Cosmin Munteanu, Matt Jones, Sharon Oviatt, Stephen Brewster, Gerald Penn, Steve Whittaker, Nitendra Rajput, and Amit Nanavati. 2013. We need to talk. In CHI '13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA '13. ACM Press, New York, New York, USA, 2459.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Keisuke Nakamura, Kazuhiro Nakadai, Pourang Irani, Sharon Oviatt, Matthew Aylett, Gerald Penn, Shimei Pan, Nikhil Sharma, Frank Rudzicz, and Randy Gomez. 2016. Designing Speech and Multimodal Interactions for Mobile, Wearable, and Pervasive Applications. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 3612--3619.  ",
      "doi": "10.1145/2851581.2856506"
    },
    {
      "text": "Cosmin Munteanu and Gerald Penn. 2015. Speech-based Interaction. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '15. ACM Press, New York, New York, USA, 2483--2484.  ",
      "doi": "10.1145/2702613.2706679"
    },
    {
      "text": "Cosmin Munteanu and Gerald Penn. 2016. Speech-based Interaction. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 992--995.  ",
      "doi": "10.1145/2851581.2856689"
    },
    {
      "text": "Cosmin Munteanu and Gerald Penn. 2017. Speech-based Interaction. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM Press, New York, New York, USA, 1196--1199.  ",
      "doi": "10.1145/3027063.3027117"
    },
    {
      "text": "Cosmin Munteanu, Gerald Penn, Cosmin Munteanu, and Gerald Penn. 2014. Speech-based interaction. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14. ACM Press, New York, New York, USA, 1035--1036.  ",
      "doi": "10.1145/2559206.2567826"
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--7.  ",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Clifford Nass and Scott Brave. 2005. Wired for speech : how voice activates and advances the human-computer relationship. MIT Press, Cambridge, Massachusetts. ",
      "doi": "10.5555/1088925"
    },
    {
      "text": "Clifford Nass and Li Gong. 2000. Speech interfaces from an evolutionary perspective. Commun. ACM 43, 9 (sep 2000), 36--43.  ",
      "doi": "10.1145/348941.348976"
    },
    {
      "text": "Clifford Nass and Kwan Min Lee. 2000. Does computer-generated speech manifest personality? an experimental test of similarityattraction. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '00. ACM Press, New York, New York, USA, 329--336.  ",
      "doi": "10.1145/332040.332452"
    },
    {
      "text": "Cifford Nass and Kwan Min Lee. 2001. Does Computer-Synthesized Speech Manifest Personality? Experimental Tests of Recognition, Similarity- Attraction, and Consistency Attraction. Journal of Experimental Psychology: Applied 7, 3 (2001), 171--181.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Youngme Moon, B.J. Fogg, Byron Reeves, and D.Christopher Dryer. 1995. Can computer personalities be human personalities? International Journal of Human-Computer Studies 43, 2 (aug 1995), 223--239.  ",
      "doi": "10.1006/ijhc.1995.1042"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R. Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems celebrating interdependence - CHI '94. ACM Press, New York, New York, USA, 72--78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Andreea Niculescu, George M. White, See Swee Lan, Ratna Utari Waloejo, and Yoko Kawaguchi. 2008. Impact of English regional accents on user acceptance of voice user interfaces. In Proceedings of the 5th Nordic conference on Human-computer interaction building bridges - NordiCHI '08. ACM Press, New York, New York, USA, 523.  ",
      "doi": "10.1145/1463160.1463235"
    },
    {
      "text": "Arika Okrent. 2010. In the land of invented languages : a celebration of linguistic creativity, madness, and genius. Spiegel & Grau Trade Paperbacks, New York, USA.",
      "doi": ""
    },
    {
      "text": "Pierre W. Orelus. 2017. Accentism Exposed: An anticolonial analysis of accent discrimination with some implications for minority languages. In Language, Race, and Power in Schools: A Critical Discourse Analysis. Routledge, London, UK, 127--137.",
      "doi": ""
    },
    {
      "text": "Cathy Pearl. 2016. Designing Voice User Interfaces : Principles of Conversational Experiences. O'Reilly Media, Boston, USA. ",
      "doi": "10.5555/3086829"
    },
    {
      "text": "James Pfrehm. 2018. Technolingualism : the mind and the machine. Bloomsbury, Cambridge, Massachusetts. https://www.bloomsbury. com/uk/technolingualism-9781472578365/",
      "doi": ""
    },
    {
      "text": "Janet B. Pierrehumbert, Tessa Bent, Benjamin Munson, Ann R. Bradlow, and J. Michael Bailey. 2004. The influence of sexual orientation on vowel production (L). The Journal of the Acoustical Society of America 116, 4 (oct 2004), 1905--1908.",
      "doi": ""
    },
    {
      "text": "Ian Pitt and Alistair Edwards. 2003. Design of Speech-based Devices. Springer London, London, UK. ",
      "doi": "10.5555/640621"
    },
    {
      "text": "Robert J. Podesva. 2007. Phonation type as a stylistic variable: The use of falsetto in constructing a persona. Journal of Sociolinguistics 11, 4 (sep 2007), 478--504.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Eva Reinares-Lara, Josefa D. Martín-Santana, and Clara Muela-Molina. 2016. The Effects of Accent, Differentiation, and Stigmatization on Spokesperson Credibility in Radio Advertising. Journal of Global Marketing 29, 1 (jan 2016), 15--28.",
      "doi": ""
    },
    {
      "text": "Henry Rogers, Ron Syth, and Greg Jacobs. 2000. Vowel and sibilant duration in gay- and straight- sounding male speech. International Gender and Language Association 1 (2000).",
      "doi": ""
    },
    {
      "text": "Debbie A. Rowe. 2010. From Wood to Bits to Silicon Chips: A History of Developments in Computer Synthesized Speech. In Computer Synthesized Speech Technologies: Tools for Aiding Impairment: Tools for Aiding Impairment, John Mullennix and Steven Stern (Eds.). IGI Global, New York, USA, 9--27.",
      "doi": ""
    },
    {
      "text": "Anara Sandygulova and Gregory M.P. O'Hare. 2015. Children's Responses to Genuine Child Synthesized Speech in Child-Robot Interaction. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts - HRI'15 Extended Abstracts. ACM Press, New York, New York, USA, 81--82.  ",
      "doi": "10.1145/2701973.2702058"
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18. ACM Press, New York, New York, USA, 869--880.",
      "doi": ""
    },
    {
      "text": "Aaron Springer and Henriette Cramer. 2018. \"Play PRBLMS\": Identifying and Correcting Less Accessible Content in Voice Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 296, 13 pages.  ",
      "doi": "10.1145/3173574.3173870"
    },
    {
      "text": "Jane Stuart-Smith. 2007. Empirical evidence for gendered speech production: /s/ in Glaswegian. In Laboratory Phonology 9, Jennifer Cole and José Ignacio Hualde (Eds.). De Gruyter, New York, USA, 65--86.",
      "doi": ""
    },
    {
      "text": "Rie Tamagawa, Catherine I. Watson, I. Han Kuo, Bruce A. MacDonald, and Elizabeth Broadbent. 2011. The Effects of Synthesized Voice Accents on User Perceptions of Robots. International Journal of Social Robotics 3, 3 (aug 2011), 253--262.",
      "doi": ""
    },
    {
      "text": "Andrew R Timming. 2017. The effect of foreign accent on employability: a study of the aural dimensions of aesthetic labour in customerfacing and non-customer-facing jobs. Work, Employment and Society 31, 3 (jun 2017), 409--428.",
      "doi": ""
    },
    {
      "text": "James Tompkinson. 2015. Accent evaluation and the perception of spoken threats. In Proceedings of the third Postgraduate and Academic Researchers in Linguistics at York conference (PARLAY 2015). University of York, UK, 115--131. https://yorkpapersinlinguistics.files.wordpress. com/2016/06/james-tompkinson-parlay-proceedings-2015.pdf",
      "doi": ""
    },
    {
      "text": "TomTom. 2018. Navigation Voices. https://www.tomtom.com/en_gb/ sat-nav/maps-services/shop/navigation-voices/",
      "doi": ""
    },
    {
      "text": "Rachelle Waksler. 2001. Pitch range and women's sexual orientation. WORD 52, 1 (apr 2001), 69--77.",
      "doi": ""
    },
    {
      "text": "Paul Warren. 2016. Uptalk. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "John C. Wells. 1982. Accents of English 1: An Introduction. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Nick Wingfield. 2017. 'Cortana, Open Alexa,' Amazon Says. And Microsoft Agrees. https://www.nytimes.com/2017/08/30/technology/ amazon-alexa-microsoft-cortana.html",
      "doi": ""
    },
    {
      "text": "Jessica Wormald. 2016. Regional Variation in Punjabi-English. Ph.D. Dissertation. Universty of York, York, UK. http://etheses.whiterose.ac. uk/13188/",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2010. Experience-Centered Design: Designers, Users, and Communities in Dialogue. Morgan and Claypool Publishers. ",
      "doi": "10.5555/1855065"
    },
    {
      "text": "Dong Yu and Li Deng. 2015. Automatic Speech Recognition. Springer, London, UK.",
      "doi": ""
    },
    {
      "text": "Qing Zhang. 2005. A Chinese yuppie in Beijing: Phonological variation and the construction of a new professional identity. Language in Society 34, 3 (2005), 431--466.",
      "doi": ""
    }
  ]
}