{
  "doi": "10.1145/3290605.3300823",
  "title": "Engaging Low-Income African American Older Adults in Health Discussions through Community-based Design Workshops",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Community-based approaches to participatory design, such as the design workshop, promise to engage underserved populations in collaborative dialog and provide a platform for promoting the views of communities who are not typically given a space to engage in design. Yet, we know little about how design workshops as a research site can engage underserved individuals (i.e., due to class, race, or age status) or address personal concerns (e.g., health). As a way of exploring these issues, we conducted a series of five design workshops with low-income African-American older adults to understand their health experiences. Our findings reveal three insights associated with the design workshop and the topic of health: comfort with community versus personal health; the sociocultural configuration of interaction; and empowerment in the context of systematic inequality of opportunity. We discuss the importance of understanding the situated nature of design workshops, particularly when engaging underserved groups in the topic of health, and the potential of the design workshop as a mechanism for activism.",
  "authors": [
    {
      "name": "Christina N. Harrington",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659201505",
      "orcid": "0000-0003-1850-6459"
    },
    {
      "name": "Katya Borgos-Rodriguez",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365456",
      "orcid": "missing"
    },
    {
      "name": "Anne Marie Piper",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316490036",
      "orcid": "0000-0003-3085-3277"
    }
  ],
  "references": [
    {
      "text": "African American Health: 2017.",
      "doi": ""
    },
    {
      "text": "Andrea, V.D.' and Teli, M. 2010. Teaching Participatory Design: A Participatory Approach. PDC '10: Proceedings of the 11th Biennial Participatory Design Conference (2010), 223--226.  ",
      "doi": "10.1145/1900441.1900486"
    },
    {
      "text": "Angel, J.L. and Angel, R.J. 2006. Minority Group Status and Healthful Aging: Social Structure Still Matters. American Journal of Public Health. 96, 7 (2006), 1152-- 1159.",
      "doi": ""
    },
    {
      "text": "Banerjee, D. et al. 2010. Self-reported Health, Functional Status and Chronic Disease in Community Dwelling Older Adults: Untangling the Role of Demographics. Journal of Community Health. 35, 2 (2010), 135--141.",
      "doi": ""
    },
    {
      "text": "Banks, K.H. and Kohn-Wood, L.P. 2002. Gender, Ethnicity and Depression: Intersectionality in Mental Health Research with African American Women. African American Research Perspectives. 6, (2002), 174--184.",
      "doi": ""
    },
    {
      "text": "Binder, T. and Brandt, E. 2008. The Design?: Lab as platform in participatory design research. CoDesign. 4, 2 (2008), 115--129.",
      "doi": ""
    },
    {
      "text": "Bjerknes, G. et al. 1987. Computers and democracy: A Scandanavian challenge. Gower Pub Co.",
      "doi": ""
    },
    {
      "text": "Björgvinsson, E. et al. 2010. Participatory design and \"democratizing innovation\" PDC '10: Proceedings of the 11th Biennial Participatory Design Conference (2010), 41--50.  ",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Bossen, C. et al. 2010. User gains and PD aims: Assessment from a participatory design project. PDC '10: Proceedings of the 11th Biennial Participatory Design Conference (Sydney, Australia, 2010), 141--150.  ",
      "doi": "10.1145/1900441.1900461"
    },
    {
      "text": "Botero, A. and Hyysalo, S. 2013. Ageing together: Steps towards evolutionary co-design in everyday practices. CoDesign. 9, 1 (2013), 37--54.",
      "doi": ""
    },
    {
      "text": "Braa, J. 1996. Community-based Participatory Design in the third world. PDC'96: Proceedings of the Participatory Design Conference (1996), 15--24.",
      "doi": ""
    },
    {
      "text": "Bratteteig, T. and Wagner, I. 2016. What is a participatory design result? Proceedings of the 14th Participatory Design Conference on Full papers - PDC '16 (2016), 141--150.  ",
      "doi": "10.1145/2940299.2940316"
    },
    {
      "text": "Carroll, J.M. 2001. Community computing as human computer interaction. Behaviour & Information Technology. 20, 5 (2001), 307--314.",
      "doi": ""
    },
    {
      "text": "Correia, A.-P. and Yusop, F.D. 2008. \"I Don't Want to be Empowered:\" The Challenge of Involving Real-world Clients in Instructional Design Experiences. PDC '08 Proceedings of the Tenth Anniversary Conference on Participatory Design 2008 (Bloomington, IN, 2008), 214--216. ",
      "doi": "10.5555/1795234.1795278"
    },
    {
      "text": "Le Dantec, C. and Edwars, K. 2008. Designs on dignity: Perceptions of technology among the homeless. CHI '08. Proceedings of the Twenty Sixth Annual SIGCHI Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Le Dantec, C.A. and Fox, S. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada, 2015), 1348--1358.  ",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Davidson, J.L. and Jensen, C. 2013. Participatory Design with Older Adults?: An Analysis of Creativity in the Design of Mobile Healthcare Applications. Proceedings of the 9th ACM Conference on Creativity & Cognition C&C 13 (Sydney, 2013), 114--123.  ",
      "doi": "10.1145/2466627.2466652"
    },
    {
      "text": "Davidson, J.L. and Jensen, C. 2013. What health topics older adults want to track. Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '13 (2013), 1--8.  ",
      "doi": "10.1145/2513383.2513451"
    },
    {
      "text": "Erete, S. and Burrell, J. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, 2017), 2307-- 2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Ertner, M. et al. 2010. Five Enunciations of Empowerment in Participatory Design. PDC '10: Proceedings of the 11th Biennial Participatory Design Conference (2010), 191--194.  ",
      "doi": "10.1145/1900441.1900475"
    },
    {
      "text": "Galliers, J. et al. 2012. Words Are Not Enough: Empowering People With Aphasia In The Design Process. PDC '12: Proceedings of the 12th Participatory Design Conference (2012), 51--60.  ",
      "doi": "10.1145/2347635.2347643"
    },
    {
      "text": "Garde, J.A. and Van Der Voort, M.C. 2014. Participants' view on personal gains and PD process. PDC '14: Proceedings of the 13th Participatory Design Conference (Windhoek, Nambia, 2014), 79--82.  ",
      "doi": "10.1145/2662155.2662194"
    },
    {
      "text": "Ginossar, T. and Nelson, S. 2010. Reducing the Health and Digital Divides: A Model for Using CommunityBased Participatory Research Approach to E-Health Interventions in Low-Income Hispanic Communities Introduction and Background. Journal of ComputerMediated Communication. 15, (2010), 530--551.",
      "doi": ""
    },
    {
      "text": "Harrington, C. et al. 2018. Designing Health and Fitness Apps with Older Adults: Examining the Value of Experience-Based Co-Design. PervasiveHealth '18: 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (New York, 2018).  ",
      "doi": "10.1145/3240925.3240929"
    },
    {
      "text": "Horowitz, C.R. et al. 2009. Community-Based Participatory Research from the Margin to the Mainstream: Are Researchers Prepared? Circulation. 119, 19 (2009).",
      "doi": ""
    },
    {
      "text": "Hussain, S. et al. 2012. Participatory Design with Marginalized People in Developing Countries?: Challenges and Opportunities Experienced in a Field Study in Cambodia. International Journal of Design. 6, 2 (2012), 91--109.",
      "doi": ""
    },
    {
      "text": "Joseph, R.P. et al. 2017. Designing Culturally Relevant Physical Activity Programs for African-American Women: A Framework for Intervention Development. Journal of Racial and Ethnic Health Disparities. 4, 3 (Jun. 2017), 397--409.",
      "doi": ""
    },
    {
      "text": "Joshi, S.G. and Bratteteig, T. 2016. Designing for Prolonged Mastery. On involving old people in Participatory Design. Scandinavian Journal of Information Systems. 28, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Kapuire, G. et al. 2014. Community-based co-design in Okomakuara A contribution to \"Design in the wild.\" Proceedings of the 13th Participatory Design Conference (2014), 207--208.  ",
      "doi": "10.1145/2662155.2662204"
    },
    {
      "text": "Kreuter, M.W. et al. 2003. Sociocultural Characteristics and Responses to Cancer Education Materials among African American Women. Cancer Control. 10, 5_suppl (Sep. 2003), 69--80.",
      "doi": ""
    },
    {
      "text": "Kreuter, M.W. and McClure, S.M. 2004. The Role of Culture in Health Communication. Annual Review of Public Health. 25, 1 (Apr. 2004), 439--455.",
      "doi": ""
    },
    {
      "text": "Larson, C. et al. 2009. Community Participation in Health Initiatives for Marginalized Populations. Journal of Ambulatory Care Management. 32, 4 (Oct. 2009), 264-- 270.",
      "doi": ""
    },
    {
      "text": "Laverack, G. and Wallerstein, N. 2001. Measuring community empowerment: a fresh look at organizational domains.",
      "doi": ""
    },
    {
      "text": "Lazar, A. et al. 2016. Designing for the Third Hand?: Empowering Older Adults with Cognitive Impairments through Creating and Sharing. (2016), 1047--1058.  ",
      "doi": "10.1145/2901790.2901854"
    },
    {
      "text": "Lazar, A. et al. 2018. Making as Expression: Informing Design with People with Complex Communication Needs through Art Therapy. CHI '18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal, 2018).  ",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Lee, H. et al. 2013. Cardiovascular disease among Black Americans: comparisons between the U.S. Virgin Islands and the 50 U.S. states. Public health reports (Washington, D.C.: 1974). 128, 3 (2013), 170--8.",
      "doi": ""
    },
    {
      "text": "Lee, J.M. et al. 2016. A Patient-Designed Do-It-Yourself Mobile Technology System for Diabetes Promise and Challenges for a New Era in Medicine. Jama. 315, 14 (2016), 1447--1448.",
      "doi": ""
    },
    {
      "text": "Mann, P. 2005. Design for Design: Support for Creative Practice in Computer-Supported Collaborative Work (CSCW) in Design. C&C '05: Proceedings of the 5th conference on Creativity & cognition (London, UK, 2005), 240--243.  ",
      "doi": "10.1145/1056224.1056261"
    },
    {
      "text": "Marshall, A. and Rode, J. 2018. Deconstructing Sociotechnical Identity in Maker Cultures. GenderIT '18: Proceedings of the 4th Conference on Gender & IT (Heilbronn, Germany, 2018), 91--100.  ",
      "doi": "10.1145/3196839.3196855"
    },
    {
      "text": "Metzler, M.M. et al. 2003. Addressing Urban Health in Detroit, New York City, and Seattle Through CommunityBased Participatory Research Partnerships.",
      "doi": ""
    },
    {
      "text": "Muller, M.J. and Druin, A. 2002. Hybridity and Participatory Design-1-DRAFT: Publisher has final version Participatory Design: The Third Space in HCI. The Human Computer Interaction Handbook: Fundamentals, Evolving Technologies and Emerging Applications. 1051--1068. ",
      "doi": "10.5555/772072.772138"
    },
    {
      "text": "Orsi, J.M. et al. 2010. Black-White health disparities in the United States and Chicago: a 15-year progress analysis. American journal of public health. 100, 2 (Feb. 2010), 349--56.",
      "doi": ""
    },
    {
      "text": "Parker, A.G. and Grinter, R.E. 2014. Collectivistic health promotion tools: Accounting for the relationship between culture, food and nutrition. International Journal of Human Computer Studies. 72, 2 (2014), 185--206.  ",
      "doi": "10.1016/j.ijhcs.2013.08.008"
    },
    {
      "text": "Racadio, R. et al. 2014. Research at the Margin: Participatory Design and Community Based Participatory Research. In Proceedings of the 13th Participatory Design Conference (2014), 49--52.  ",
      "doi": "10.1145/2662155.2662188"
    },
    {
      "text": "Rodil, K. et al. 2012. Enhancing Cross-Cultural Participation through Creative Visual Exploration. PDC '12: Proceedings of the 12th Participatory Design Conference (Roskilde, Denmark, 2012), 81--90.  ",
      "doi": "10.1145/2347635.2347647"
    },
    {
      "text": "Rosner, D.K. et al. 2016. Out of Time, Out of Place: Reflections on Design Workshops as a Research Method. Proceedings of the 19th ACM Conference on ComputerSupported Cooperative Work & Social Computing CSCW '16 (2016), 1129--1139.  ",
      "doi": "10.1145/2818048.2820021"
    },
    {
      "text": "Rothmann, M. et al. 2016. Participatory Design in Health Care-Participation, power and knowledge. PDC '16: Proceedings of the 14th Participatory Design Conference (2016), 127--128.  ",
      "doi": "10.1145/2948076.2948106"
    },
    {
      "text": "Sabiescu, A.G. et al. 2014. Emerging spaces in community-based participatory design. Proceedings of the 13th Participatory Design Conference on Research Papers - PDC '14.  ",
      "doi": "10.1145/2661435.2661446"
    },
    {
      "text": "Sabiescu, A.G. and Memarovic, N. 2013. Participatory Design for Cultural Representation: A Cultural Transparency Perspective. IFIP Conference on HumanComputer Interaction (Berlin, 2013), 611--618.  ",
      "doi": "10.1007/978-3-642-40498-6_52"
    },
    {
      "text": "Sanders, E. and Westerlund, B. 2011. Experience, exploring and experimenting in and with co-design spaces. Nordic Design Research Conference (Helsinki, 2011), 1--5.",
      "doi": ""
    },
    {
      "text": "Schlesinger, A. et al. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17.  ",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Schneider, H. et al. 2018. Empowerment in HCI - A Survey and Framework. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems CHI '18 (2018), 1--14.  ",
      "doi": "10.1145/3173574.3173818"
    },
    {
      "text": "Skogan, W. 2006. Police and Community in Chicago: A Tale of Three Cities - Wesley G. Skogan - Google Books. Oxford.",
      "doi": ""
    },
    {
      "text": "Smith, M. et al. 2014. Development of a Culturally Relevant Consumer Health Information Website for Harlem, New York. Health Promotion Practice. 15, 5 (2014), 664--674.",
      "doi": ""
    },
    {
      "text": "Steen, M. 2011. Cooperation, Curiosity and Creativity as Virtues in Participatory Design. DESIRE '11: Procedings of the Second Conference on Creativity and Innovation in Design (Eindhoven, Netherlands, 2011), 171--174.  ",
      "doi": "10.1145/2079216.2079240"
    },
    {
      "text": "Toombs, A. 2015. Enacting Care Through Collaboration in Communities of Makers. CSCW'15 Companion: Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, 2015), 81--81.  ",
      "doi": "10.1145/2685553.2699326"
    },
    {
      "text": "Toombs, A.L. 2017. Hackerspace Tropes, Identities, and Community Values. DIS '17: Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, 2017), 1079--1091.  ",
      "doi": "10.1145/3064663.3064760"
    },
    {
      "text": "Unertl, K.M. et al. 2016. Integrating community-based participatory research and informatics approaches to improve the engagement and health of underserved populations. Journal of American Medical Informatics Association. 23, (2016), 60--73.",
      "doi": ""
    },
    {
      "text": "Vacca, R. 2017. Bicultural: Examining Teenage Latinas' Perspectives on Technologies for Emotional Support. IDC '17: Proceedings of the 2017 Conference on Interaction Design and Children (Stanford, CA, 2017), 117--125.  ",
      "doi": "10.1145/3078072.3079742"
    },
    {
      "text": "Vines, J. et al. 2013. Configuring Participation: On How We Involve People In Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, 2013), 429--438.  ",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Viruell-Fuentes, E.A. et al. 2012. More than culture: Structural racism, intersectionality theory, and immigrant health. Social Science and Medicine. 75, 12 (2012), 2099--2106.",
      "doi": ""
    },
    {
      "text": "Wallerstein, N.B. and Duran, B. 2006. Using Community-Based Participatory Research to Address Health Disparities. Health Promotion Practice. 7, 3 (2006), 312--323.",
      "doi": ""
    },
    {
      "text": "Wang, C. and Burris, M.A. 1997. Photovoice: Concept, Methodology, and Use for Participatory Needs Assessment. Health Education and Behavior. 24, 3 (1997), 369--387.",
      "doi": ""
    },
    {
      "text": "Weitzer, R. et al. 2008. Police-Community Relations in a Majority-Black City. Journal of Research in Crime and Delinquincy. 45, 4 (2008), 398--428.",
      "doi": ""
    },
    {
      "text": "Winschiers-Theophilus, H. et al. 2010. Being Participated-A Community Approach. In Proceedings of the 11th Biennial Participatory Design Conference (Sydney, Australia, 2010), 1--10.  ",
      "doi": "10.1145/1900441.1900443"
    },
    {
      "text": "Wong- Villacres, M. et al. 2018. Designing for Intersections. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 (Hong Kong, 2018), 45--58.  ",
      "doi": "10.1145/3196709.3196794"
    },
    {
      "text": "Xie, B. et al. 2012. Co-designing an e-health tutorial for older adults. Proceedings of the 2012 iConference on iConference '12 (2012), 240--247.  ",
      "doi": "10.1145/2132176.2132207"
    },
    {
      "text": "Zimmerman, M.A. 1995. Psychological Empowerment: Issues and Illustrations 1. American Journal of Community Psychology. 23, 5 (1995), 581--599.",
      "doi": ""
    }
  ]
}