{
  "doi": "10.1145/3290605.3300258",
  "title": "MindDot: Supporting Effective Cognitive Behaviors in Concept Map-Based Learning Environments",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "While prior research has revealed the promising impact of concept mapping on learning, few have comprehensively modeled different cognitive behaviors during concept mapping. In addition, existing concept mapping tools lack effective feedback to support better learning behaviors. This work presents MindDot, a concept map-based learning environment that facilitates the cognitive process of comparing and integrating related concepts via two forms of support. A hyperlink support and an expert template. Study results suggested that both types of support had positive impact on the development of comparative strategies and that hyperlink support enhanced learning. We further evaluated the cognitive learning progress at a fine-grained level with two forms of visualizations. We then extracted several behavioral patterns that provided insights about the cognitive progress in learning. Lastly, we derive design recommendations that we hope will inspire future intelligent tutoring systems that automatically evaluate students' learning behaviors and foster them in developing effective learning behaviors",
  "tags": [
    "data visualization",
    "concept mapping",
    "hyperlink navigation",
    "behavioral patterns",
    "expert template",
    "comparative strategy"
  ],
  "authors": [
    {
      "name": "Shang Wang",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365736",
      "orcid": "missing"
    },
    {
      "name": "Deniz Sonmez Unal",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365791",
      "orcid": "0000-0003-3389-2466"
    },
    {
      "name": "Erin Walker",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491129",
      "orcid": "0000-0002-0976-9065"
    }
  ],
  "references": [
    {
      "text": "Lynne, Anderson-Inman, Leslie A. Ditson, and Mary T. Ditson. 1998. Computerbased concept mapping: Promoting meaningful learning in science for students with disabilities. Information Technology and Disabilities, 5(1--2).",
      "doi": ""
    },
    {
      "text": "John R. Anderson, Albert T. Corbett, Kenneth R. Koedinger, and Ray Pelletier. 1995. Cognitive tutors: Lessons learned. The journal of the learning sciences, 4(2), pp.167--207.",
      "doi": ""
    },
    {
      "text": "Thushari Atapattu, Katrina Falkner, and Nickolas Falkner. 2015, June. Educational question answering motivated by question-specific concept maps. In International Conference on Artificial Intelligence in Education (pp. 13--22). Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Alberto J. Cañas, Greg Hill, Roger Carff, Niranjan Suri, James Lott, Gloria Gómez, Thomas C. Eskridge, Mario Arroyo, and Rodrigo Carvajal. 2004. CmapTools: A knowledge modeling and sharing environment.",
      "doi": ""
    },
    {
      "text": "Kuo-En Chang, Yao-Ting Sung, and Sung-Fang Chen. 2001. Learning through computer-based concept mapping with scaffolding aid. Journal of computer assisted learning, 17(1), pp.21--33.",
      "doi": ""
    },
    {
      "text": "Pasana Chularut, and Teresa K. DeBacker. 2004. The influence of concept mapping on achievement, self-regulation, and self-efficacy in students of English as a second language. Contemporary Educational Psychology, 29(3), pp.248--263.",
      "doi": ""
    },
    {
      "text": "Martin Davies. 2011. Concept mapping, mind mapping and argument mapping: what are the differences and do they matter?. Higher education, 62(3), pp.279--301.",
      "doi": ""
    },
    {
      "text": "Paul Denny, Fiona McDonald, Ruth Empson, Philip Kelly, and Andrew Petersen. 2018, April. Empirical Support for a Causal Relationship Between Gamification and Learning Outcomes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 311). ACM.  ",
      "doi": "10.1145/3173574.3173885"
    },
    {
      "text": "Jeanie C. Dumestre. 2004, September. Using CmapTools software to assist in performing job task analysis. In Concept Maps: Theory, Methodology, Technology. Proceedings of the First International Conference on Concept Mapping. Pamplona: Universidad Pública de Navarra.",
      "doi": ""
    },
    {
      "text": "Brittany Garcia, Sharon Lynn Chu, Beth Nam, and Colin Banigan. 2018, April. Wearables for Learning: Examining the Smartwatch as a Tool for Situated Science Reflection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 256). ACM.  ",
      "doi": "10.1145/3173574.3173830"
    },
    {
      "text": "Tsukasa Hirashima, Kazuya Yamasaki, Hiroyuki Fukuda, and Hideo Funaoi. 2011, June. Kit-build concept map for automatic diagnosis. In International conference on artificial intelligence in education(pp. 466--468). Springer, Berlin, Heidelberg. ",
      "doi": "10.5555/2026506.2026580"
    },
    {
      "text": "Phillip B. Horton, Andrew A. McConney, Michael Gallo, Amanda L. Woods, Gary J. Senn, and Denis Hamelin. 1993. An investigation of the effectiveness of concept mapping as an instructional tool. Science Education, 77(1), pp.95--111.",
      "doi": ""
    },
    {
      "text": "Gwo-Jen Hwang, Chih-Hsiang Wu, and Kuo Fan-Ray. 2013. Effects of touch technology-based concept mapping on students' learning attitudes and perceptions. Journal of Educational Technology & Society, 16(3), p.274.",
      "doi": ""
    },
    {
      "text": "Ian M. Kinchin. 2001. If concept mapping is so helpful to learning biology, why aren't we all doing it?. International Journal of Science Education, 23(12), pp.12571269.",
      "doi": ""
    },
    {
      "text": "Leelawong, Krittaya, and Gautam Biswas. Designing learning by teaching agents: The Betty's Brain system. International Journal of Artificial Intelligence in Education, 18(3), pp.181--208. ",
      "doi": "10.5555/1454278.1454280"
    },
    {
      "text": "Kyu Yon Lim, Hyeon Woo Lee, and Barbara Grabowski. 2009. Does concept? mapping strategy work for everyone? The levels of generativity and learners' self? regulated learning skills. British Journal of Educational Technology, 40(4), pp.606618.",
      "doi": ""
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018, April. ConceptScape: Collaborative Concept Mapping for Video Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 387). ACM.  ",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Sarah Manlove, Ard W. Lazonder, and Ton de Jong. 2007. Software scaffolds to promote regulation during scientific inquiry learning. Metacognition and Learning, 2(2--3), pp.141--155.",
      "doi": ""
    },
    {
      "text": "Gary Marchionini. 1997. Information seeking in electronic environments (No. 9). Cambridge university press. ",
      "doi": "10.5555/265164"
    },
    {
      "text": "Roberto Martínez Maldonado, Judy Kay, and Kalina Yacef. 2010, November. Collaborative concept mapping at the tabletop. In ACM International Conference on Interactive Tabletops and Surfaces (pp. 207--210). ACM.  ",
      "doi": "10.1145/1936652.1936690"
    },
    {
      "text": "George Miller, and Scott Spoolman. 2011. Living in the environment: principles, connections, and solutions. Nelson Education.",
      "doi": ""
    },
    {
      "text": "Mind Vector. 2018. https://www.mindvectorweb.com",
      "doi": ""
    },
    {
      "text": "MindMaple. 2018. http://www.mindmaple.com",
      "doi": ""
    },
    {
      "text": "B. Moon, A. J. Pino, and C. A. Hedberg. 2006. Studying Transformation: The Use of Cmap-Tools in Surveying the Integration of Intelligence and Operations. In Proc. 2nd Int'l Conf. Concept Mapping (pp. 527--533).",
      "doi": ""
    },
    {
      "text": "Joseph D. Novak and Alberto J. Cañas. \"The theory underlying concept maps and how to construct and use them.\" (2008).",
      "doi": ""
    },
    {
      "text": "Peter Akinsola Okebukola. 1992. Can Good Concept Mappers be Good Problem Solvers in Science'. Research in Science & Technological Education, 10(2), pp.153--170.",
      "doi": ""
    },
    {
      "text": "Hector R. Ponce and Richard E. Mayer. 2014. Qualitatively different cognitive processing during online reading primed by different study activities. Computers in human behavior, 30, pp.121--130.  ",
      "doi": "10.1016/j.chb.2013.07.054"
    },
    {
      "text": "Sadhana Puntambekar and Agni Stylianou. 2005. Designing navigation support in hypertext systems based on navigation patterns. Instructional science, 33(5--6), pp.451--481.",
      "doi": ""
    },
    {
      "text": "Steve Sizmur and Jonathan Osborne. 1997. Learning processes and collaborative concept mapping. International Journal of Science Education, 19(10), pp.11171135.",
      "doi": ""
    },
    {
      "text": "C.C. Tsai, Sunny SJ Lin, and Shyan-Ming Yuan. 2001. Students' use of web-based concept map testing and strategies for learning. Journal of Computer Assisted Learning, 17(1), pp.72--84.",
      "doi": ""
    },
    {
      "text": "Kurt Vanlehn. 2006. The behavior of tutoring systems. International journal of artificial intelligence in education, 16(3), pp.227--265. ",
      "doi": "10.5555/1435351.1435353"
    },
    {
      "text": "Shang Wang, Erin Walker, and Ruth Wylie. 2017, June. What Matters in Concept Mapping? Maps Learners Create or How They Create Them. In International Conference on Artificial Intelligence in Education (pp. 406--417). Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Romain Zeiliger, Thérèse Reggers, and Robert Peeters. 1996. Concept-map based navigation in educational hypermedia: a case study. In Proceedings of ED-MEDIA (Vol. 96).",
      "doi": ""
    }
  ]
}