{
  "doi": "10.1145/3290605.3300232",
  "title": "\"They Don't Leave Us Alone Anywhere We Go\": Gender and Digital Abuse in South Asia",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "South Asia faces one of the largest gender gaps online globally, and online safety is one of the main barriers to gender-equitable Internet access [GSMA, 2015]. To better understand the gendered risks and coping practices online in South Asia, we present a qualitative study of the online abuse experiences and coping practices of 199 people who identified as women and 6 NGO staff from India, Pakistan, and Bangladesh, using a feminist analysis. We found that a majority of our participants regularly contended with online abuse, experiencing three major abuse types: cyberstalking, impersonation, and personal content leakages. Consequences of abuse included emotional harm, reputation damage, and physical and sexual violence. Participants coped through informal channels rather than through technological protections or law enforcement. Altogether, our findings point to opportunities for designs, policies, and algorithms to improve women's safety online in South Asia.",
  "authors": [
    {
      "name": "Nithya Sambasivan",
      "institution": "Google, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81350582954/rel-imgonly/nithya_coorg.jpg",
      "acmid": "81350582954",
      "orcid": "missing"
    },
    {
      "name": "Amna Batool",
      "institution": "Information Technology University, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658766961",
      "orcid": "0000-0001-5207-5352"
    },
    {
      "name": "Nova Ahmed",
      "institution": "North South University, Dhaka, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958813457",
      "orcid": "0000-0002-7715-1742"
    },
    {
      "name": "Tara Matthews",
      "institution": "Independent Researcher, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Kurt Thomas",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470648756",
      "orcid": "0000-0002-3762-5851"
    },
    {
      "name": "Laura Sanely Gaytán-Lugo",
      "institution": "Universidad de Colima, Colima, Mexico",
      "img": "/do/10.1145/contrib-99658628421/rel-imgonly/23331483_10154735197116612_2743068313400816313_o.jpg",
      "acmid": "99658628421",
      "orcid": "0000-0002-7007-7500"
    },
    {
      "name": "David Nemer",
      "institution": "University of Kentucky, Lexington, KY, USA",
      "img": "/do/10.1145/contrib-84459762757/rel-imgonly/profile.jpg",
      "acmid": "84459762757",
      "orcid": "missing"
    },
    {
      "name": "Elie Bursztein",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387610021",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Churchill",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81100143170/rel-imgonly/elizabethchurchill.jpeg",
      "acmid": "81100143170",
      "orcid": "missing"
    },
    {
      "name": "Sunny Consolvo",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459425",
      "orcid": "0000-0001-5337-328X"
    }
  ],
  "references": [
    {
      "text": "2017. Hamara Internet: Measuring Pakistani women's experiences of online violence. Technical Report.",
      "doi": ""
    },
    {
      "text": "2017. Hindustan Times: Stalkers' delight: Mobile numbers of girls for sale in UP recharge shops. https://goo.gl/bfVEDk",
      "doi": ""
    },
    {
      "text": "2017. How 'Doxxing' Became a Mainstream Tool in the Culture Wars - The New York Times. https://www.nytimes.com/2017/08/30/technology/doxxingprotests.html. (Accessed on 09/15/2018).",
      "doi": ""
    },
    {
      "text": "2017. Legal action on cyber violence against women. (12 2017).",
      "doi": ""
    },
    {
      "text": "2018. Definitions - Cyber Civil Rights Initiative. https://www.cybercivilrights.org/definitions/. (Accessed on 09/15/2018).",
      "doi": ""
    },
    {
      "text": "2018. Sexual Harassment. https://www.eeoc.gov/laws/types/sexualharassment.cfm",
      "doi": ""
    },
    {
      "text": "Lila Abu-Lughod. 2002. Do Muslim women really need saving? Anthropological reflections on cultural relativism and its others. American anthropologist 104, 3 (2002), 783--790.",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Shion Guha, Md Rashidujjaman Rifat, and Nicola Dell. 2017. Privacy, security, and surveillance in the Global South: A study of biometric mobile SIM registration in Bangladesh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 906--918.  ",
      "doi": "10.1145/3025453.3025961"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md Rashidujjaman Rifat, ASM Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A platform for fighting sexual harassment in urban Bangladesh. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 2695--2704.  ",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Chang Ailsa. 2017. Familiar-Looking Numbers Are The Latest Twist In Robocalls. NPR (2017).",
      "doi": ""
    },
    {
      "text": "Eileen M Alexy, Ann W Burgess, Timothy Baker, and Shirley A Smoyak. 2005. Perceptions of cyberstalking among college students. Brief treatment and crisis intervention 5, 3 (2005), 279.",
      "doi": ""
    },
    {
      "text": "Ferenak Amidi. 2018. Giving Social Media in Iran and Afghanistan a More Gender Balanced Voice. https://www.youtube.com/watch?v=BwhdA6Q1xQE",
      "doi": ""
    },
    {
      "text": "Dascalescu Ana. 2018. Doxxing Can Ruin Your life. Here's How (You Can Avoid It). Heimdal security (2018).",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3906--3918.  ",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "John Ashcroft. 2001. Stalking and domestic violence: A report to Congress. No. NCJ 186157, Washington, DC: U.S. Department of Justice 13 (2001).",
      "doi": ""
    },
    {
      "text": "Sethi Ashpreet. 2012. Getting Aadhaar card big challenge for transgenders | Deccan Herald. https://www.deccanherald.com/content/250353/gettingaadhaar-card-big-challenge.html. (Accessed on 09/17/2018).",
      "doi": ""
    },
    {
      "text": "Shreya Bhandari and Jennifer C Hughes. 2017. Lived Experiences of Women Facing Domestic Violence in India. Journal of Social Work in the Global Community 2, 1 (2017), 2.",
      "doi": ""
    },
    {
      "text": "Ananya Bhattacharya. 2018. In India, the internet is a place for urban dwellers, men and youngsters Quartz India. https://qz.com/india/1211218/in-indiathe-internet-is-a-place-for-urban-dwellers-men-and-youngsters/. (Accessed on 01/04/2019).",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill P Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. PACMHCI 1, CSCW (2017), 24--1.  ",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Jan Blom, Divya Viswanathan, Mirjana Spasojevic, Janet Go, Karthik Acharya, and Robert Ahonius. 2010. Fear and the city: role of mobile services in harnessing safety and security in urban use contexts. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1841--1850.  ",
      "doi": "10.1145/1753326.1753602"
    },
    {
      "text": "danah boyd. 2012. Truth, Lies, and 'Doxxing': The Real Moral of the Gawker/Reddit Story. Wired (2012).",
      "doi": ""
    },
    {
      "text": "Wanda Cassidy, Margaret Jackson, and Karen N Brown. 2009. Sticks and stones can break my bones, but how can pixels hurt me? Students experiences with cyber-bullying. School psychology international 30, 4 (2009), 383--402.",
      "doi": ""
    },
    {
      "text": "Maitrayee Chaudhuri. 2004. Feminism in India. (2004).",
      "doi": ""
    },
    {
      "text": "Radhika Chopra. 2003. Rethinking Pro-Feminism: Men, Work and Family in India. (2003).",
      "doi": ""
    },
    {
      "text": "Danielle Keats Citron. 2014. Hate crimes in cyberspace. Harvard University Press.",
      "doi": "10.5555/3051927"
    },
    {
      "text": "Danielle Keats Citron and Mary Anne Franks. 2014. Criminalizing revenge porn. Wake Forest L. Rev. 49 (2014), 345.",
      "doi": ""
    },
    {
      "text": "Danielle J Corple. 2016. Beyond the Gender Gap: Understanding Women's Participation in Wikipedia. (2016).",
      "doi": ""
    },
    {
      "text": "Chhaya Datar. 1993. The struggle against violence. Calcutta: Stree (1993).",
      "doi": ""
    },
    {
      "text": "Jill P Dimond, Michaelanne Dye, Daphne LaRose, and Amy S Bruckman. 2013. Hollaback!: the role of storytelling online in a social movement organization. Proceedings of the 2013 conference on Computer supported cooperative work, 477-- 490.  ",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Jill P Dimond, Casey Fiesler, and Amy S Bruckman. 2011. Domestic violence and information communication technologies. Interacting with Computers 23, 5 (2011), 413--421.  ",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Karthik Dinakar, Birago Jones, Catherine Havasi, Henry Lieberman, and Rosalind Picard. 2012. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS) 2, 3 (2012), 18.  ",
      "doi": "10.1145/2362394.2362400"
    },
    {
      "text": "David Finkelhor, Kimberly Mitchell, and Janis Wolak. {n. d.}. Highlights of the Youth Internet Safety Survey. Juvenile Justice Fact Sheet - FS200104 (pgs. 1--2). Technical Report. Washingtion, DC.",
      "doi": ""
    },
    {
      "text": "Jerry Finn. 2004. A survey of online harassment at a university campus. Journal of Interpersonal violence 19, 4 (2004), 468--483.",
      "doi": ""
    },
    {
      "text": "World Economic Forum. 2017. The Global Gender Gap Report 2017. (2017). https://www.weforum.org/reports/the-global-gender-gap-report-2017",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2017. Women's experiences with general and sexual harassment in online video games: Rumination, organizational responsiveness, withdrawal, and coping strategies. New Media & Society 19, 8 (2017), 1290--1307.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2017. Digital technologies and intimate partner violence: a qualitative analysis with multiple stakeholders. PACM: Human-Computer Interaction: Computer-Supported Cooperative Work and Social Computing (CSCW) Vol 1 (2017).  ",
      "doi": "10.1145/3134681"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. \"A Stalker's Paradise\": How Intimate Partner Abusers Exploit Technology. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 667.  ",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "FTC. 2017. Phishing. FTC (2017).",
      "doi": ""
    },
    {
      "text": "Imran Gabol and Taser Subhani. 2016. Qandeel Baloch murdered by brother in Multan. Dawn. https://www.dawn.com/news/1271213",
      "doi": ""
    },
    {
      "text": "Oana Goga, Giridhari Venkatadri, and Krishna P Gummadi. 2015. The doppelg´ 'anger bot attack: Exploring identity impersonation in online social networks. In Proceedings of the 2015 Internet Measurement Conference. ACM, 141-- 153.  ",
      "doi": "10.1145/2815675.2815699"
    },
    {
      "text": "GSMA. 2015. Bridging the gender gap: Mobile access and usage in low-and middle-income countries. (2015).",
      "doi": ""
    },
    {
      "text": "GSMA. 2018. The Mobile Gender Gap Report. (2018).",
      "doi": ""
    },
    {
      "text": "Debarati Halder and K Jaishankar. 2013. Revenge porn by teens in the United States and India: A socio-legal analysis. International Annals of Criminology 51, 1--2 (2013), 85--111.",
      "doi": ""
    },
    {
      "text": "Michael James Heron, Pauline Belford, and Ayse Goker. 2014. Sexism in the circuitry: female participation in male-dominated popular computer culture. ACM SIGCAS Computers and Society 44, 4 (2014), 18--29.  ",
      "doi": "10.1145/2695577.2695582"
    },
    {
      "text": "The Hindu. 2018. The Right To Love. (09 2018). https://www.thehindu.com/opinion/editorial/the-right-to-love/article24885401.ece",
      "doi": ""
    },
    {
      "text": "Saroop Ijaz. 2018. Another Transgender Woman Killed in Pakistan. Human Rights Watch. https://www.hrw.org/news/2018/05/08/another-transgenderwoman-killed-pakistan",
      "doi": ""
    },
    {
      "text": "Mayank Jain. 2016. India's internet population is exploding but women are not logging in. Scroll.in (26 9 2016). https://scroll.in/article/816892/indias-internetpopulation-is-exploding-but-women-are-not-logging-inia",
      "doi": ""
    },
    {
      "text": "Lakshman Jeyaseelan, Shuba Kumar, Nithya Neelakantan, Abraham Peedicayil, Rajamohanam Pillai, and Nata Duvvury. 2007. Physical spousal violence against women in India: some risk factors. Journal of biosocial science 39, 5 (2007), 657--670.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Sucheta Ghoshal, Amy Bruckman, and Eric Gilbert. 2018. Online harassment and content moderation: The case of blocklists. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 2 (2018), 12.  ",
      "doi": "10.1145/3185593"
    },
    {
      "text": "Heidi Bart Johnston and Ruchira Tabassum Naved. 2008. Spousal violence in Bangladesh: a call for a public-health response. Journal of health, population, and nutrition 26, 3 (2008), 366.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala and Neha Kumar. 2017. Women's Safety in Public Spaces: Examining the Efficacy of Panic Buttons in New Delhi. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 3340--3351.  ",
      "doi": "10.1145/3025453.3025532"
    },
    {
      "text": "Colleen M Koch. 2017. To Catch a Catfish: A Statutory Solution for Victims of Online Impersonation. U. Colo. L. Rev. 88 (2017), 233.",
      "doi": ""
    },
    {
      "text": "Michael A Koenig, Rob Stephenson, Saifuddin Ahmed, Shireen J Jejeebhoy, and Jacquelyn Campbell. 2006. Individual and contextual determinants of domestic violence in North India. American journal of public health 96, 1 (2006), 132--138.",
      "doi": ""
    },
    {
      "text": "Anja Kovacs, Richa Kaul Padte, and Shobha SV. 2013. Don't let it stand: An Exploratory Study of Women and Verbal Online Abuse in India. (4 2013).",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart, Michele Ybarra, Kathryn Zickuhr, and Myeshia Price-Feeney. 2016. Online harassment, digital abuse, and cyberstalking in America. Data and Society Research Institute.",
      "doi": ""
    },
    {
      "text": "Ania Loomba and Ritty A Lukose. 2012. South Asian Feminisms. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Shadma Malik. 2017. The spectre of online sexual harassment | The Daily Star. The Daily Star. https://www.thedailystar.net/opinion/society/the-spectreonline-sexual-harassment-1510252",
      "doi": ""
    },
    {
      "text": "Alice Marwick and Ross Miller. 2014. Online harassment, defamation, and hateful speech: A primer of the legal landscape. (2014).",
      "doi": ""
    },
    {
      "text": "Christina Masden and W Keith Edwards. 2015. Understanding the role of community in online dating. Proceedings of the 33rd annual ACM conference on human factors in computing systems, 535--544.  ",
      "doi": "10.1145/2702123.2702417"
    },
    {
      "text": "Tara Matthews, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F Churchill, and Sunny Consolvo. 2017. Stories from survivors: Privacy & security practices when coping with intimate partner abuse. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2189--2201.  ",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Mary Meeker. {n. d.}. 2015 Internet Trends. http://www.kpcb.com/blog/2015internet-trends 00000.",
      "doi": ""
    },
    {
      "text": "Niveditha Menon. 2008. Domestic violence in India: Identifying types of control and coping mechanisms in violent relationships. (2008).",
      "doi": ""
    },
    {
      "text": "Nivedita Menon. 2015. Is Feminism about'Women'? Economic and Political Weekly 50, 17 (2015), 37--44.",
      "doi": ""
    },
    {
      "text": "Chandra Talpade Mohanty. 1988. Under Western eyes: Feminist scholarship and colonial discourses. Feminist review 30 (1988), 61--88.",
      "doi": ""
    },
    {
      "text": "Ellen Nakashima. 2007. Sexual Threats Stifle Some Female Bloggers. Washington Post (30 4 2007).",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi, Ravi Vatrapu, and Torkil Clemmensen. 2011. Comparative informatics. interactions 18, 2 (2011), 28--33.  ",
      "doi": "10.1145/1925820.1925828"
    },
    {
      "text": "Express news service. 2016. Girl commits suicide after morphed pics appear on Facebook. (2016). http://www.newindianexpress.com/states/tamilnadu/Girl-commits-suicide-after-morphed-pics-appear-on-Facebook/2016/06/28/ article3503206.ece",
      "doi": ""
    },
    {
      "text": "Market Research Society of India. 2011. The New SEC system. (5 2011). http://mruc.net/uploads/posts/b17695616c422ec8d9dadafc1c3eec26.pdf",
      "doi": ""
    },
    {
      "text": "FE online. 2018. Muzaffarpur shelter home case: Major crackdown by Bihar government - The Financial Express. https://www.financialexpress.com/india-news/muzaffarpur-shelter-home-case-major-crackdown-by-bihargovernment/1267581/",
      "doi": ""
    },
    {
      "text": "Tim Owen, Wayne Noble, and Faye Christabel Speed. 2017. Silenced by Free Speech: How cyberabuse affects debate and democracy. In New Perspectives on Cybercrime. Springer, 159--174.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Tawfiq Ammari, Ramaswami Mahalingam, Ana Maria Huaita Alfaro, and Meera Lakshmanan. 2013. Marginality, aspiration and accessibility in ICTD. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. ACM, 68-- 78.  ",
      "doi": "10.1145/2516604.2516623"
    },
    {
      "text": "Hanna Papanek. 1971. Purdah in Pakistan: seclusion and modern occupations for women. Journal of Marriage and the Family (1971), 517--530.",
      "doi": ""
    },
    {
      "text": "Justin W Patchin and Sameer Hinduja. 2006. Bullies move beyond the schoolyard: A preliminary look at cyberbullying. Youth violence and juvenile justice 4, 2 (2006), 148--169.",
      "doi": ""
    },
    {
      "text": "Jessica A Pater, Moon K Kim, Elizabeth D Mynatt, and Casey Fiesler. 2016. Characterizations of online harassment: Comparing policies across social media platforms. Proceedings of the 19th International Conference on Supporting Group Work, 369--374.  ",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "JW Pennebaker. 2011. The secret life of pronouns: How our words reflect who we are. New York, NY: Bloomsbury (2011).",
      "doi": ""
    },
    {
      "text": "Fauzia Rabbani, F Qureshi, and Narjis Rizvi. 2008. Perspectives on domestic violence: case study from Karachi, Pakistan. (2008).",
      "doi": ""
    },
    {
      "text": "Raad Rahman. 2017. No Country for Bangladesh's Gay Men. New York Times. https://www.nytimes.com/2017/06/30/opinion/bangladesh-lgbt-gay.html",
      "doi": ""
    },
    {
      "text": "Lee Rainie. 2017. PEW survey: Online harassment. (2017).",
      "doi": ""
    },
    {
      "text": "Srila Roy. 2012. New south Asian feminisms: Paradoxes and possibilities. Zed Books Ltd.",
      "doi": ""
    },
    {
      "text": "Rebecca Ruiz. 2018. Deepfakes are about to make revenge porn so much worse. Mashable (24 6 2018). https://mashable.com/2018/06/24/deepfakes-revengeporn-domestic-violence/#KSN0cUpieOqc",
      "doi": ""
    },
    {
      "text": "Kohn Sally. 2015. I Got Doxxed So You Don't Have To. Daily Beast (2015).",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Nova Ahmed, and Amna Batool. 2017. Gender equity in technologies: considerations for design in the global south. interactions 25, 1 (2017), 58--61.  ",
      "doi": "10.1145/3155050"
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laurely Gaytan-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. {n. d.}. \"Privacy is not for me, it's for those rich women\": Performative Privacy Practices on Mobile Phones by Women in South Asia. SOUPS 2018. ",
      "doi": "10.5555/3291228.3291240"
    },
    {
      "text": "Nithya Sambasivan and Jess Holbrook. 2018. Toward responsible AI for the next billion users. Interactions 26, 1 (2018), 68--71.  ",
      "doi": "10.1145/3298735"
    },
    {
      "text": "Nithya Sambasivan, Nimmi Rangaswamy, Ed Cutrell, and Bonnie Nardi. 2009. Ubicomp4D: infrastructure and interaction for international development--the case of urban indian slums. In Proceedings of the 11th international conference on Ubiquitous computing. ACM, 155--164.  ",
      "doi": "10.1145/1620545.1620570"
    },
    {
      "text": "Doug Shadel and David Dudley. 2015. 'Are You Real?' - Inside an Online Dating Scam. AARP.",
      "doi": ""
    },
    {
      "text": "Ranjit Singh and Steven J Jackson. 2017. From Margins to Seams: Imbrication, Inclusion, and Torque in the Aadhaar Identification Project. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4776-- 4824.  ",
      "doi": "10.1145/3025453.3025910"
    },
    {
      "text": "Sushma Sood. 1990. Violence against women. Arihant Pub.",
      "doi": ""
    },
    {
      "text": "Cynthia Southworth, Jerry Finn, Shawndell Dawson, Cynthia Fraser, and Sarah Tucker. 2007. Intimate partner violence, technology, and stalking. Violence against women 13, 8 (2007), 842--856.",
      "doi": ""
    },
    {
      "text": "Newsweek staff. 2018. Suicide spurs web regulation in North Korea. (2018). https://www.newsweek.com/suicide-spurs-web-regulation-southkorea-92485",
      "doi": ""
    },
    {
      "text": "Michele Stephanie. 2015. I Was Catfished: This Is What I Decided to Do About It. Huffington Post (2015).",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "Patricia Godeke Tjaden and Nancy Thoennes. 1998. Stalking in America: Findings from the national violence against women survey. (1998).",
      "doi": ""
    },
    {
      "text": "Michael Trice. 2015. Putting GamerGate in context: how group documentation informs social media activity. Proceedings of the 33rd Annual International Conference on the Design of Communication, 37.  ",
      "doi": "10.1145/2775441.2775471"
    },
    {
      "text": "Aditya Vashistha, Richard Anderson, and Shrirang Mare. 2018. Examining Security and Privacy Research in Developing Regions. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, 25.  ",
      "doi": "10.1145/3209811.3209818"
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women's Experiences With and Strategies for Mitigating Negative Effects of Online Harassment. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 1231--1245.  ",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Laura Vitis and Fairleigh Gilmour. 2017. Dick pics on blast: A woman's resistance to online sexual harassment using humour, art and Instagram. Crime, media, culture 13, 3 (2017), 335--355.",
      "doi": ""
    },
    {
      "text": "Nancy E Willard. 2007. Cyberbullying and cyberthreats: Responding to the challenge of online social aggression, threats, and distress. Research Press. ",
      "doi": "10.5555/1396222"
    },
    {
      "text": "Benjamin Wittes, Cody Poplin, Quinta Jurecic, and Clara Spera. 2016. Sextortion: Cybersecurity, teenagers, and remote sexual assault. Center for Technology at Brookings. https://www.brookings.edu/wpcontent/uploads/2016/05/sextortion1--1.pdf. Accessed 16 (2016).",
      "doi": ""
    },
    {
      "text": "Janis Wolak and David Finkelhor. 2016. Sextortion: Findings from a survey of 1,631 victims. (2016).",
      "doi": ""
    },
    {
      "text": "Delanie Woodlock. 2017. The abuse of technology in domestic violence and stalking. Violence against women 23, 5 (2017), 584--602.",
      "doi": ""
    },
    {
      "text": "Rubeena Zakar, Muhammad Zakria Zakar, and Alexander Krämer. 2012. Voices of strength and struggle: Women's coping strategies against spousal violence in Pakistan. Journal of interpersonal violence 27, 16 (2012), 3268--3298.",
      "doi": ""
    }
  ]
}