{
  "doi": "10.1145/3290605.3300785",
  "title": "Improving Early Navigation in Time-Lapse Video with Spread-Frame Loading",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Time-lapse videos are often navigated by scrubbing with a slider. When networks are slow or images are large, however, even thumbnail versions load so slowly that scrubbing is limited to the start of the video. We developed a frame-loading technique called spread-loading that enables scrubbing regardless of delivery rate. Spread-loading orders frame delivery to maximize coverage of the entire sequence; this provides a temporal overview of the entire video that can be fully navigated at any time during delivery. The overview initially has a coarse temporal resolution, becoming finer-grained with each new frame. We compared spread-loading with traditional linear loading in a study where participants were asked to find specific episodes in a long time-lapse sequence, using three views with increasing levels of detail. Results show that participants found target episodes significantly and substantially faster with spread-loading, regardless of whether they could click to change the load point. Users rated spread-loading as requiring less effort, and strongly preferred the new technique.",
  "authors": [
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Michael van der Kamp",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366589",
      "orcid": "missing"
    },
    {
      "name": "Md. Sami Uddin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-99659021202/rel-imgonly/sami.jpg",
      "acmid": "99659021202",
      "orcid": "missing"
    },
    {
      "name": "Kevin Stanley",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339530000",
      "orcid": "missing"
    },
    {
      "name": "Ian Stavness",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-81319501712/rel-imgonly/ianstavness.jpg",
      "acmid": "81319501712",
      "orcid": "missing"
    },
    {
      "name": "Sally Vail",
      "institution": "Agriculture and Agri-Food Canada, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365639",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saamer Akhshabi, Ali C Begen, and Constantine Dovrolis. 2011. An experimental evaluation of rate-adaptation algorithms in adaptive streaming over HTTP. In Proceedings of the second annual ACM conference on Multimedia systems. ACM, 157--168.  ",
      "doi": "10.1145/1943552.1943574"
    },
    {
      "text": "John G Apostolopoulos, Wai-tian Tan, and Susie J Wee. 2002. Video streaming: Concepts, algorithms, and systems. HP Laboratories, report HPL-2002--260 (2002).",
      "doi": ""
    },
    {
      "text": "Mauro Barbieri, Gerhard Mekenkamp, Marco Ceccarelli, and Jan Nesvadba. 2001. The color browser: a content driven linear video browsing tool. In null. IEEE, 160.",
      "doi": ""
    },
    {
      "text": "Connelly Barnes, Dan B Goldman, Eli Shechtman, and Adam Finkelstein. 2010. Video tapestries with continuous temporal zoom. In ACM Transactions on Graphics (TOG), Vol. 29. ACM, 89.  ",
      "doi": "10.1145/1778765.1778826"
    },
    {
      "text": "Eric P Bennett and Leonard McMillan. 2007. Computational time-lapse video. In ACM Transactions on Graphics (TOG), Vol. 26. ACM, 102.  ",
      "doi": "10.1145/1276377.1276505"
    },
    {
      "text": "John Boreczky, Andreas Girgensohn, Gene Golovchinsky, and Shingo Uchihashi. 2000. An interactive comic book presentation for exploring video. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 185--192.  ",
      "doi": "10.1145/332040.332428"
    },
    {
      "text": "Linjun Chang, Yichen Yang, and Xian-Sheng Hua. 2008. Smart video player. In Multimedia and Expo, 2008 IEEE International Conference on. IEEE, 1605--1606.",
      "doi": ""
    },
    {
      "text": "Sarah Cohen, Werner Nutt, and Yehoshua Sagic. 2007. Deciding equivalances among conjunctive aggregate queries. J. ACM 54, 2, Article 5 (April 2007), 50 pages.  ",
      "doi": "10.1145/1219092.1219093"
    },
    {
      "text": "Oscar De Bruijn and Robert Spence. 2000. Rapid serial visual presentation: a space-time trade-off in information presentation. In Advanced visual interfaces. 189--192.  ",
      "doi": "10.1145/345513.345309"
    },
    {
      "text": "Pierre Dragicevic, Gonzalo Ramos, Jacobo Bibliowitcz, Derek Nowrouzezahrai, Ravin Balakrishnan, and Karan Singh. 2008. Video browsing by direct manipulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 237--246.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Beverly L Harrison, Russell Owen, and Ronald M Baecker. 1994. Timelines: an interactive system for the collection and visualization of temporal data. In Graphics Interface. Canadian Information Processing Society, 141--141.",
      "doi": ""
    },
    {
      "text": "Liwei He, Elizabeth Sanocki, Anoop Gupta, and Jonathan Grudin. 1999. Auto-summarization of audio-video presentations. In Proceedings of the seventh ACM international conference on Multimedia (Part 1). ACM, 489--498.  ",
      "doi": "10.1145/319463.319691"
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. 2017. The autobiographical design and long term usage of an always-on video recording system for the home. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 675--687.  ",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Wolfgang Hürst. 2006. Interactive audio-visual video browsing. In Proceedings of the 14th ACM international conference on Multimedia. ACM, 675--678.  ",
      "doi": "10.1145/1180639.1180781"
    },
    {
      "text": "Damir Isovic, Gerhard Fohler, and Tomas Lennvall. 2002. Analysis of mpeg-2 video streams. Mtrc report. Mardalen Real-time Research Center, Mardalen University, Sweden (2002).",
      "doi": ""
    },
    {
      "text": "Dan Jackson, James Nicholson, Gerrit Stoeckigt, Rebecca Wrobel, Anja Thieme, and Patrick Olivier. 2013. Panopticon: A parallel video overview system. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 123--130.  ",
      "doi": "10.1145/2501988.2502038"
    },
    {
      "text": "Haojian Jin, Yale Song, and Koji Yatani. 2017. ElasticPlay: Interactive Video Summarization with Dynamic Time Budgets. In Proceedings of the 2017 ACM on Multimedia Conference. ACM, 1164--1172.  ",
      "doi": "10.1145/3123266.3123393"
    },
    {
      "text": "Neel Joshi, Wolf Kienzle, Mike Toelle, Matt Uyttendaele, and Michael F Cohen. 2015. Real-time hyperlapse creation via optimal frame selection. ACM Transactions on Graphics (TOG) 34, 4 (2015), 63.  ",
      "doi": "10.1145/2766954"
    },
    {
      "text": "Juho Kim, Philip J Guo, Carrie J Cai, Shang-Wen Daniel Li, Krzysztof Z Gajos, and Robert C Miller. 2014. Data-driven interaction techniques for improving navigation of educational videos. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 563--572.  ",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Baochun Li, Zhi Wang, Jiangchuan Liu, and Wenwu Zhu. 2013. Two decades of internet video streaming: A retrospective view. ACM transactions on multimedia computing, communications, and applications (TOMM) 9, 1s (2013), 33.  ",
      "doi": "10.1145/2505805"
    },
    {
      "text": "Francis C Li, Anoop Gupta, Elizabeth Sanocki, Li-wei He, and Yong Rui. 2000. Browsing digital video. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 169--176.  ",
      "doi": "10.1145/332040.332425"
    },
    {
      "text": "João Martinho and Teresa Chambel. 2009. ColorsInMotion: interactive visualization and exploration of video spaces. In Proceedings of the 13th International MindTrek Conference: Everyday Life in the Ubiquitous Era. ACM, 190--197.  ",
      "doi": "10.1145/1621841.1621876"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2012. Swift: reducing the effects of latency in online video scrubbing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 637--646.  ",
      "doi": "10.1145/2207676.2207766"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2013. Swifter: improved online video scrubbing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1159--1168.  ",
      "doi": "10.1145/2470654.2466149"
    },
    {
      "text": "Chong-Wah Ngo, Yu-Fei Ma, and Hong-Jiang Zhang. 2005. Video summarization and scene detection by graph modeling. IEEE Transactions on Circuits and Systems for Video Technology 15, 2 (2005), 296--305.  ",
      "doi": "10.1109/TCSVT.2004.841694"
    },
    {
      "text": "Michael Nunes, Saul Greenberg, Sheelagh Carpendale, and Carl Gutwin. 2007. What did I miss? Visualizing the past through video traces. In ECSCW 2007. Springer, 1--20.",
      "doi": ""
    },
    {
      "text": "Amy Pavel, Dan B Goldman, Björn Hartmann, and Maneesh Agrawala. 2015. Sceneskim: Searching and browsing movies using synchronized captions, scripts and plot summaries. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 181-- 190.  ",
      "doi": "10.1145/2807442.2807502"
    },
    {
      "text": "Dulce Ponceleon, Savitha Srinivasan, Arnon Amir, Dragutin Petkovic, and Dan Diklic. 1998. Key to effective video retrieval: effective cataloging and browsing. In Proceedings of the sixth ACM international conference on Multimedia. ACM, 99--107.  ",
      "doi": "10.1145/290747.290760"
    },
    {
      "text": "Suporn Pongnumkul, Jue Wang, Gonzalo Ramos, and Michael Cohen. 2010. Content-aware dynamic timeline for video browsing. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 139--142.  ",
      "doi": "10.1145/1866029.1866053"
    },
    {
      "text": "Gonzalo Ramos and Ravin Balakrishnan. 2003. Fluid interaction techniques for the control and annotation of digital video. In Proceedings of the 16th annual ACM symposium on User interface software and technology. ACM, 105--114.  ",
      "doi": "10.1145/964696.964708"
    },
    {
      "text": "Alex Rav-Acha, Yael Pritch, and Shmuel Peleg. 2006. Making a long video short: Dynamic video synopsis. In Computer Vision and Pattern Recognition, 2006 IEEE Computer Society Conference on, Vol. 1. IEEE, 435--441.  ",
      "doi": "10.1109/CVPR.2006.179"
    },
    {
      "text": "Klaus Schoeffmann, Marco A Hudelist, and Jochen Huber. 2015. Video interaction tools: a survey of recent work. ACM Computing Surveys (CSUR) 48, 1 (2015), 14.  ",
      "doi": "10.1145/2808796"
    },
    {
      "text": "Conglei Shi, Siwei Fu, Qing Chen, and Huamin Qu. 2015. VisMOOC: Visualizing video clickstream data from massive open online courses. In Visualization Symposium (PacificVis), 2015 IEEE Pacific. IEEE, 159-- 166.",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Saul Greenberg, and Sidney Fels. 2009. Exploring video streams using slit-tear visualizations. In CHI'09 Extended Abstracts on Human Factors in Computing Systems. ACM, 3509--3510.  ",
      "doi": "10.1145/1520340.1520516"
    },
    {
      "text": "Shingo Uchihashi, Jonathan Foote, Andreas Girgensohn, and John Boreczky. 1999. Video manga: generating semantically meaningful CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk C. Gutwin et al. video summaries. In Proceedings of the seventh ACM international conference on Multimedia (Part 1). ACM, 383--392.  ",
      "doi": "10.1145/319463.319654"
    },
    {
      "text": "Md Sami Uddin, Carl Gutwin, and Alix Goguey. 2017. Using artificial landmarks to improve revisitation performance and spatial learning in linear control widgets. In Proceedings of the 5th Symposium on Spatial User Interaction. ACM, 48--57.  ",
      "doi": "10.1145/3131277.3132184"
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Dapeng Wu, Yiwei Thomas Hou, Wenwu Zhu, Ya-Qin Zhang, and Jon M Peha. 2001. Streaming video over the Internet: approaches and directions. IEEE Transactions on circuits and systems for video technology 11, 3 (2001), 282--300.  ",
      "doi": "10.1109/76.911156"
    },
    {
      "text": "Baoquan Zhao, Shujin Lin, Xiaonan Luo, Songhua Xu, and Ruomei Wang. 2017. A Novel System for Visual Navigation of Educational Videos Using Multimodal Cues. In Proceedings of the 2017 ACM on Multimedia Conference. ACM, 1680--1688.  ",
      "doi": "10.1145/3123266.3123406"
    }
  ]
}