{
  "doi": "10.1145/3290605.3300775",
  "title": "Serpentine: A Self-Powered Reversibly Deformable Cord Sensor for Human Input",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "We introduce Serpentine, a self-powered sensor that is a reversibly deformable cord capable of sensing a variety of human input. The material properties and structural design of Serpentine allow it to be flexible, twistable, stretchable and squeezable, enabling a broad variety of expressive input modalities. The sensor operates using the principle of Triboelectric Nanogenerators (TENG), which allows it to sense mechanical deformation without an external power source. The affordances of the cord include six interactions---Pluck, Twirl, Stretch, Pinch, Wiggle and Twist. Serpentine demonstrates the ability to simultaneously recognize these inputs through a single physical interface. A 12-participant user study illustrates 95.7% accuracy for a user-dependent recognition model using a realtime system and 92.17% for user-independent offline detection. We conclude by demonstrating how Serpentine can be employed in everyday ubiquitous computing applications.",
  "authors": [
    {
      "name": "Fereshteh Shahmiri",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659284789",
      "orcid": "missing"
    },
    {
      "name": "Chaoyu Chen",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365665",
      "orcid": "missing"
    },
    {
      "name": "Anandghan Waghmare",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-89758877757/rel-imgonly/llmmjaw3_400x400.jpg",
      "acmid": "89758877757",
      "orcid": "0000-0003-3022-071X"
    },
    {
      "name": "Dingtian Zhang",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658692421",
      "orcid": "missing"
    },
    {
      "name": "Shivan Mittal",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365781",
      "orcid": "missing"
    },
    {
      "name": "Steven L. Zhang",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659284489",
      "orcid": "missing"
    },
    {
      "name": "Yi-Cheng Wang",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366855",
      "orcid": "missing"
    },
    {
      "name": "Zhong Lin Wang",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81547594056",
      "orcid": "missing"
    },
    {
      "name": "Thad E. Starner",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100175439",
      "orcid": "missing"
    },
    {
      "name": "Gregory D. Abowd",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100251687",
      "orcid": "0000-0002-3408-587X"
    }
  ],
  "references": [
    {
      "text": "Morteza Amjadi, Ki-Uk Kyung, Inkyu Park, and Metin Sitti. 2016. Stretchable, Skin-Mountable, and Wearable Strain Sensors and Their Potential Applications: A Review. Advanced Functional Materials 26, 11 (March 2016), 1678--1698.",
      "doi": ""
    },
    {
      "text": "Nivedita Arora and Gregory D. Abowd. 2018. ZEUSSS: Zero Energy Ubiquitous Sound Sensing Surface Leveraging Triboelectric Nanogenerator and Analog Backscatter Communication. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST '18 Adjunct). ACM, New York, NY, USA, 81--83.  ",
      "doi": "10.1145/3266037.3266108"
    },
    {
      "text": "Nivedita Arora, Steven L. Zhang, Fereshteh Shahmiri, Diego Osorio, YiCheng Wang, Mohit Gupta, Zhengjun Wang, Thad Starner, Zhong Lin Wang, and Gregory D. Abowd. 2018. SATURN: A Thin and Flexible Self-powered Microphone Leveraging Triboelectric Nanogenerator. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (July 2018), 1--28.  ",
      "doi": "10.1145/3214263"
    },
    {
      "text": "Ravin Balakrishnan, George Fitzmaurice, Gordon Kurtenbach, and Karan Singh. 1999. Exploring Interactive Curve and Surface Manipulation Using a Bend and Twist Sensitive Input Strip. In Proceedings of the 1999 Symposium on Interactive 3D Graphics (I3D '99). ACM, New York, NY, USA, 111--118.  ",
      "doi": "10.1145/300523.300536"
    },
    {
      "text": "Gabor Blasko, Chandra Narayanaswami, and Steven Feiner. 2006. Prototyping Retractable String-based Interaction Techniques for Dualdisplay Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 369--372.  ",
      "doi": "10.1145/1124772.1124827"
    },
    {
      "text": "Victor Cheung, Alexander Keith Eady, and Audrey Girouard. 2018. Deformable Controllers: Fabrication and Design to Promote Novel Hand Gestural Interaction Mechanisms. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 732--735.  ",
      "doi": "10.1145/3173225.3173332"
    },
    {
      "text": "Ho-Hsiu Chou, Amanda Nguyen, Alex Chortos, John W. F. To, Chien Lu, Jianguo Mei, Tadanori Kurosawa, Won-Gyu Bae, Jeffrey B.-H. Tok, and Zhenan Bao. 2015. A chameleon-inspired stretchable electronic skin with interactive colour changing controlled by tactile sensing. Nature Communications 6 (Aug. 2015), 8011.",
      "doi": ""
    },
    {
      "text": "Wenting Dang, Vincenzo Vinciguerra, Leandro Lorenzelli, and Ravinder Dahiya. 2017. Printable stretchable interconnects. Flexible and Printed Electronics 2, 1 (2017), 013003.",
      "doi": ""
    },
    {
      "text": "Spyridon Nektarios Daskalakis, Ricardo Correia, George Goussetis, Manos M Tentzeris, Nuno Borges Carvalho, and Apostolos Georgiadis. 2018. Four-PAM Modulation of Ambient FM Backscattering for Spectrally Efficient Low-Power Applications. IEEE Transactions on Microwave Theory and Techniques 66, 12 (2018), 5909--5921.",
      "doi": ""
    },
    {
      "text": "Spyridon Nektarios Daskalakis, George Goussetis, Stylianos D Assimonis, Manos M Tentzeris, and Apostolos Georgiadis. 2018. A uW Backscatter-Morse-Leaf Sensor for Low-Power Agricultural Wireless Sensor Networks. IEEE Sensors Journal 18, 19 (2018), 7889--7898.",
      "doi": ""
    },
    {
      "text": "Artem Dementyev, Hsin-Liu (Cindy) Kao, and Joseph A. Paradiso. 2015. SensorTape: Modular and Programmable 3D-Aware Dense Sensor Network on a Tape. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 649--658.  ",
      "doi": "10.1145/2807442.2807507"
    },
    {
      "text": "Kai Dong, Jianan Deng, Wenbo Ding, Aurelia C. Wang, Peihong Wang, Chaoyu Cheng, Yi-Cheng Wang, Limin Jin, Bohong Gu, Baozhong Sun, and Zhong Lin Wang. {n. d.}. Versatile Core--Sheath Yarn for Sustainable Biomechanical Energy Harvesting and Real-Time Human-Interactive Sensing. Advanced Energy Materials 8, 23 ({n. d.}), 1801114. arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/aenm.201801114",
      "doi": ""
    },
    {
      "text": "Kai Dong, Jianan Deng, Wenbo Ding, Aurelia C. Wang, Peihong Wang, Chaoyu Cheng, Yi-Cheng Wang, Limin Jin, Bohong Gu, Baozhong Sun, and Zhong Lin Wang. 2018. Versatile Core--Sheath Yarn for Sustainable Biomechanical Energy Harvesting and Real-Time HumanInteractive Sensing. Advanced Energy Materials 8, 23 (Aug. 2018), 1801114.",
      "doi": ""
    },
    {
      "text": "Nicholas Fellion, Alexander Keith Eady, and Audrey Girouard. 2016. Flexstylus: A deformable stylus for digital art. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2482--2489.  ",
      "doi": "10.1145/2851581.2892444"
    },
    {
      "text": "S. Gilliland, N. Komor, T. Starner, and C. Zeagler. 2010. The Textile Interface Swatchbook: Creating graphical user interfacelike widgets with conductive embroidery. In International Symposium on Wearable Computers (ISWC) 2010. 1--8.",
      "doi": ""
    },
    {
      "text": "A Gomes, C Rodrigues, AM Pereira, and J Ventura. 2018. Influence of Thickness and Contact Area on the Performance of PDMS-Based Triboelectric Nanogenerators. arXiv preprint arXiv:1803.10070 (2018).",
      "doi": ""
    },
    {
      "text": "Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Edward Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense: A Versatile Sensing Technique to Support Multimodal Flexible Surface Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1407--1410.  ",
      "doi": "10.1145/2556288.2557173"
    },
    {
      "text": "Hana Han, Andreas M. Reichmuth, Aline F. Renz, Flurin Stauffer, Moritz Thielen, and Janos Voros. 2017. Trends in Epidermal Stretchable Electronics for Noninvasive Long-term Healthcare Applications. International Journal of Automation and Smart Technology 7, 2 (June 2017), 37--52.",
      "doi": ""
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2008. Scratch Input: Creating Large, Inexpensive, Unpowered and Mobile Finger Input Surfaces. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 205--208.  ",
      "doi": "10.1145/1449715.1449747"
    },
    {
      "text": "Florian Heller, Stefan Ivanov, Chat Wacharamanotham, and Jan Borchers. 2014. FabriTouch: Exploring Flexible Touch Input on Textiles. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, New York, NY, USA, 59--62.  ",
      "doi": "10.1145/2634317.2634345"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: Eyes-free Continuous Input on Interactive Clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1313--1322.  ",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Ji-Eun Kim, John Sunwoo, Yong-Ki Son, Dong-Woo Lee, and Il-Yeon Cho. 2007. A Gestural Input Through Finger Writing on a Textured Pad. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, New York, NY, USA, 2495--2500.  ",
      "doi": "10.1145/1240866.1241030"
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2015. Elasticcon: Elastic Controllers for Casual Interaction. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 410--419.  ",
      "doi": "10.1145/2785830.2785849"
    },
    {
      "text": "E. Koch and H. Witt. 2008. Prototyping a chest-worn stringbased wearable input device. In 2008 International Symposium on a World of Wireless, Mobile and Multimedia Networks. 1--6.  ",
      "doi": "10.1109/WOWMOM.2008.4594882"
    },
    {
      "text": "Ying-Chih Lai, Jianan Deng, Simiao Niu, Wenbo Peng, Changsheng Wu, Ruiyuan Liu, Zhen Wen, and Zhong Lin Wang. 2016. Electric Eel-SkinInspired Mechanically Durable and Super-Stretchable Nanogenerator for Deformable Power Source and Fully Autonomous Conformable Electronic-Skin Applications. Advanced Materials 28, 45 (Dec. 2016), 10024--10032.",
      "doi": ""
    },
    {
      "text": "Christopher KY Leung, Kai Tai Wan, Daniele Inaudi, Xiaoyi Bao, Wolfgang Habel, Zhi Zhou, Jinping Ou, Masoud Ghandehari, Hwai Chung Wu, and Michio Imai. 2015. Optical fiber sensors for civil engineering applications. Materials and Structures 48, 4 (2015), 871--906.",
      "doi": ""
    },
    {
      "text": "Sumin Lim, Donghee Son, Jaemin Kim, Young Bum Lee, Jun-Kyul Song, Suji Choi, Dong Jun Lee, Ji Hoon Kim, Minbaek Lee, Taeghwan Hyeon, and Dae-Hyeong Kim. 2015. Transparent and Stretchable Interactive Human Machine Interface Based on Patterned Graphene Heterostructures. Advanced Functional Materials 25, 3 (Jan. 2015), 375--383.",
      "doi": ""
    },
    {
      "text": "Jhe-Wei Lin, Chiuan Wang, Yi Yao Huang, Kuan-Ting Chou, HsuanYu Chen, Wei-Luan Tseng, and Mike Y. Chen. 2015. BackHand: Sensing Hand Gestures via Back of the Hand. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 557--564.  ",
      "doi": "10.1145/2807442.2807462"
    },
    {
      "text": "Darren J. Lipomi, Michael Vosgueritchian, Benjamin C.-K. Tee, Sondra L. Hellstrom, Jennifer A. Lee, Courtney H. Fox, and Zhenan Bao. 2011. Skin-like pressure and strain sensors based on transparent elastic films of carbon nanotubes. Nature Nanotechnology 6, 12 (Dec. 2011), 788--792.",
      "doi": ""
    },
    {
      "text": "D. Marculescu, R. Marculescu, N. H. Zamora, P. Stanley-Marbell, P. K. Khosla, S. Park, S. Jayaraman, S. Jung, C. Lauterbach, W. Weber, T. Kirstein, D. Cottet, J. Grzyb, G. Troster, M. Jones, T. Martin, and Z. Nakad. 2003. Electronic textiles: A platform for pervasive computing. Proc. IEEE 91, 12 (Dec 2003), 1995--2018.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 333--339.  ",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Alex Olwal, Jon Moeller, Greg Priest-Dorman, Thad Starner, and Ben Carroll. 2018. I/O Braid: Scalable Touch-Sensitive Lighted Cords Using Spiraling, Repeating Sensing Textiles and Fiber Optics. In Proceedings of the 31st Annual Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3242587.3242638"
    },
    {
      "text": "Chan Woo Park, Soon Won Jung, Sang Chul Lim, Ji-Young Oh, Bock Soon Na, Sang Seok Lee, Hye Yong Chu, and Jae Bon Koo. 2013. Stretchable copper interconnects with three-dimensional coiled structures. Journal of Micromechanics and Microengineering 23, 12 (2013), 127002.",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal, and Michael Haller. 2016. FlexTiles: A Flexible, Stretchable, Formable, Pressure-Sensitive, Tactile Input Sensor. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3754--3757.  ",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: Real-time Sensing of Surface and Deformation Gestures on Flexible, Interactive Textiles, Using a Hybrid Gesture Detection Pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 565--577.  ",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Vaishnavi Ranganathan, Sidhant Gupta, Jonathan Lester, Joshua R Smith, and Desney Tan. 2018. RF Bandaid: A Fully-Analog and Passive Wireless Interface for Wearable Sensors. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (2018), 79.  ",
      "doi": "10.1145/3214282"
    },
    {
      "text": "Eun Roh, Byeong-Ung Hwang, Doil Kim, Bo-Yeong Kim, and NaeEung Lee. 2015. Stretchable, Transparent, Ultrasensitive, and Patchable Strain Sensor for Human--Machine Interfaces Comprising a Nanohybrid of Carbon Nanotubes and Conductive Elastomers. ACS Nano 9, 6 (June 2015), 6252--6261.",
      "doi": ""
    },
    {
      "text": "Philipp Schoessler, Sang-won Leigh, Krithika Jagannath, Patrick van Hoof, and Hiroshi Ishii. 2015. Cord UIs: Controlling Devices with Augmented Cables. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 395--398.  ",
      "doi": "10.1145/2677199.2680601"
    },
    {
      "text": "Julia Schwarz, Chris Harrison, Scott Hudson, and Jennifer Mankoff. 2010. Cord Input: An Intuitive, High-accuracy, Multi-degreeof-freedom Input Method for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1657--1660.  ",
      "doi": "10.1145/1753326.1753573"
    },
    {
      "text": "Paul Strohmeier, Jarrod Knibbe, Sebastian Boring, and Kasper Hornbæk. 2018. zPatch: Hybrid Resistive/Capacitive eTextile Input. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '18. ACM Press, Stockholm, Sweden, 188-- 198.  ",
      "doi": "10.1145/3173225.3173242"
    },
    {
      "text": "Vamsi Talla, Bryce Kellogg, Shyamnath Gollakota, and Joshua R. Smith. 2017. Battery-Free Cellphone. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2 (June 2017), 25:1--25:20.  ",
      "doi": "10.1145/3090090"
    },
    {
      "text": "Zhumei Tian, Jian He, Xi Chen, Tao Wen, Cong Zhai, Zengxing Zhang, Jundong Cho, Xiujian Chou, and Chenyang Xue. 2018. Core--shell coaxially structured triboelectric nanogenerator for energy harvesting and motion sensing. RSC Advances 8, 6 (Jan. 2018), 2950--2957.",
      "doi": ""
    },
    {
      "text": "Celeste To, Tess Lee Hellebrekers, and Yong-Lae Park. 2015. Highly stretchable optical sensors for pressure, strain, and curvature measurement. In Intelligent Robots and Systems (IROS), 2015 IEEE/RSJ International Conference on. IEEE, 5898--5903.",
      "doi": ""
    },
    {
      "text": "Ambuj Varshney, Andreas Soleiman, Luca Mottola, and Thiemo Voigt. 2017. Battery-free visible light sensing. In Proceedings of the 4th ACM Workshop on Visible Light Communication Systems. ACM, 3--8.  ",
      "doi": "10.1145/3129881.3129890"
    },
    {
      "text": "Jiangxin Wang, Meng-Fang Lin, Sangbaek Park, and Pooi See Lee. 2018. Deformable conductors for human--machine interface. Materials Today 21, 5 (June 2018), 508--526.",
      "doi": ""
    },
    {
      "text": "Yue Wang, Cherry Gregory, and Mark A. Minor. 2018. Improving Mechanical Properties of Molded Silicone Rubber for Soft Robotics Through Fabric Compositing. Soft Robotics 5, 3 (March 2018), 272--290.",
      "doi": ""
    },
    {
      "text": "Zhong Lin Wang. 2015. Triboelectric nanogenerators as new energy technology and self-powered sensors - Principles, problems and perspectives. Faraday Discussions 176, 0 (March 2015), 447--458.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21st Century. Scientific American 265, 3 (1991), 94--105.",
      "doi": ""
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E. Mackay. 2016. Stretchis: Fabricating Highly Stretchable User Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 697--704.  ",
      "doi": "10.1145/2984511.2984521"
    },
    {
      "text": "Yulim Won, Areum Kim, Wooseok Yang, Sunho Jeong, and Jooho Moon. 2014. A highly stretchable, helical copper nanowire conductor exhibiting a stretchability of 700%. NPG Asia Materials 6, 9 (Sept. 2014), e132--e132.",
      "doi": ""
    },
    {
      "text": "Fang Wu, Jiyun Jeon, Seung Ki Moon, Hae-Jin Choi, and Hungsun Son. 2016. Voice coil navigation sensor for flexible silicone intubation. IEEE/ASME Transactions on Mechatronics 21, 2 (2016), 851--859.",
      "doi": ""
    },
    {
      "text": "Xinghai Yu, Jian Pan, Jing Zhang, Hao Sun, Sisi He, Longbin Qiu, Huiqing Lou, Xuemei Sun, and Huisheng Peng. 2017. A coaxial triboelectric nanogenerator fiber for energy harvesting and sensing under deformation. Journal of Materials Chemistry A 5, 13 (March 2017), 6032--6037.",
      "doi": ""
    },
    {
      "text": "Alla M. Zamarayeva, Aminy E. Ostfeld, Michael Wang, Jerica K. Duey, Igal Deckman, Balthazar P. Lechêne, Greg Davies, Daniel A. Steingart, and Ana Claudia Arias. 2017. Flexible and stretchable power sources for wearable electronics. Science Advances 3, 6 (June 2017), e1602051.",
      "doi": ""
    }
  ]
}