{
  "doi": "10.1145/3290605.3300923",
  "title": "HapTwist: Creating Interactive Haptic Proxies in Virtual Reality Using Low-cost Twistable Artefacts",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "In this paper, we present a series of studies on using Rubik's Twist, a type of low-cost twistable artefact, to create haptic proxies for various hand-graspable VR objects. Our pilot studies validated the feasibility and effectiveness of Rubik's-Twist-based haptic proxies. The pilot results also revealed user challenges in the physical shape creation, motivating the development of the HapTwist toolkit. The toolkit consists of the shape-generation algorithm, the software interface for shape-construction guidance and interaction authoring, and the hardware modules for constructing interactive haptic proxies. The user studies showed that HapTwist was easy to learn and use, and it significantly improved user performance in creating interactive haptic proxies with Rubik's Twist. Furthermore, HapTwist-generated haptic proxies achieved similar VR experience as the real objects.",
  "authors": [
    {
      "name": "Kening Zhu",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81455605722",
      "orcid": "0000-0001-6740-4921"
    },
    {
      "name": "Taizhou Chen",
      "institution": "City University of Hong Kong, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659224595",
      "orcid": "missing"
    },
    {
      "name": "Feng Han",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/do/10.1145/contrib-99659223541/rel-imgonly/99659223541.jpg",
      "acmid": "99659223541",
      "orcid": "missing"
    },
    {
      "name": "Yi-Shiun Wu",
      "institution": "EPFL, Lausanne, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659225383",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abtahi, P., & Follmer, S. (2018, April). Visuo-Haptic Illusions for Improving the Perceived Performance of Shape Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 150). ACM.  ",
      "doi": "10.1145/3173574.3173724"
    },
    {
      "text": "Aguerreche, L., Duval, T., & Lécuyer, A. (2010, November). Reconfigurable tangible devices for 3D virtual object manipulation by single or multiple users. In Proceedings of the 17th ACM Symposium on Virtual Reality Software and Technology (pp. 227--230). ACM.  ",
      "doi": "10.1145/1889863.1889913"
    },
    {
      "text": "Azmandian, M., Hancock, M., Benko, H., Ofek, E., & Wilson, A. D. (2016, May). Haptic retargeting: Dynamic repurposing of passive haptics for enhanced virtual reality experiences. In Proceedings of the 2016 chi conference on human factors in computing systems (pp. 1968--1979). ACM.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Benko, H., Holz, C., Sinclair, M., & Ofek, E. (2016, October). Normaltouch and texturetouch: High-fidelity 3d haptic shape rendering on handheld virtual reality controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (pp. 717--728). ACM.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Bouzit, M., Burdea, G., Popescu, G., & Boian, R. (2002). The Rutgers Master II-new design force-feedback glove. IEEE/ASME Transactions on mechatronics, 7(2), 256--263.",
      "doi": ""
    },
    {
      "text": "Cheng, L. P., Chang, L., Marwecki, S., & Baudisch, P. (2018, April). iTurk: Turning Passive Haptics into Active Haptics by Making Users Reconfigure Props in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 89). ACM.  ",
      "doi": "10.1145/3173574.3173663"
    },
    {
      "text": "Cheng, L. P., Roumen, T., Rantzsch, H., Köhler, S., Schmidt, P., Kovacs, R., ... & Baudisch, P. (2015, November). Turkdeck: Physical virtual reality based on people. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (pp. 417--426). ACM.  ",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Choi, I., Culbertson, H., Miller, M. R., Olwal, A., & Follmer, S. (2017, October). Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (pp. 119--130). ACM.  ",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Choi, I., Hawkes, E. W., Christensen, D. L., Ploch, C. J., & Follmer, S. (2016, October). Wolverine: A wearable haptic interface for grasping in virtual reality. In Intelligent Robots and Systems (IROS), 2016 IEEE/RSJ International Conference on(pp. 986--993). IEEE.",
      "doi": "10.1109/IROS.2016.7759169"
    },
    {
      "text": "Choi, I., Ofek, E., Benko, H., Sinclair, M., & Holz, C. (2018, April). CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 654). ACM.  ",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Craik, F. I., Klix, F., & Hagendorf, H. (2016). A functional account of age differences in memory. Memory, Attention, and Aging: Selected Works of Fergus I. M. Craik (pp. 409--422). Routledge.",
      "doi": ""
    },
    {
      "text": "Dell, N., Vaidyanathan, V., Medhi, I., Cutrell, E., & Thies, W. (2012, May). Yours is better!: participant response bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 1321--1330). ACM.  ",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Feix, T., Romero, J., Schmiedmayer, H. B., Dollar, A. M., & Kragic, D. (2016). The grasp taxonomy of human grasp types. IEEE Transactions on Human-Machine Systems, 46(1), 66--77.",
      "doi": ""
    },
    {
      "text": "Fiore, A. (1981). Shaping Rubik's Snake. Penguin Australia.",
      "doi": ""
    },
    {
      "text": "Follmer, S., Leithinger, D., Olwal, A., Hogge, A., & Ishii, H. (2013, October). inFORM: dynamic physical affordances and constraints through shape and object actuation. In Uist (Vol. 13, pp. 417--426).  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Fujinawa, E., Yoshida, S., Koyama, Y., Narumi, T., Tanikawa, T., & Hirose, M. (2017, November). Computational design of hand-held VR controllers using haptic shape illusion. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (p. 28). ACM.  ",
      "doi": "10.1145/3139131.3139160"
    },
    {
      "text": "Hart, S. G., & Staveland, L. E. (1988). Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology (Vol. 52, pp. 139--183). North-Holland.",
      "doi": ""
    },
    {
      "text": "Heo, S., Chung, C., Lee, G., & Wigdor, D. (2018, April). Thor's Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 525). ACM.  ",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Hettiarachchi, A., & Wigdor, D. (2016, May). Annexing Reality: Enabling Opportunistic Use of Everyday Objects as Tangible Proxies in Augmented Reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (pp. 1957--1967). ACM.  ",
      "doi": "10.1145/2858036.2858134"
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J. C., & Kassell, N. F. (1994, April). Passive real-world interface props for neurosurgical visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems (pp. 452--458). ACM.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Holman, D., & Vertegaal, R. (2008). Organic user interfaces: designing computers in any way, shape, or form. Communications of the ACM, 51(6), 48--55.  ",
      "doi": "10.1145/1349026.1349037"
    },
    {
      "text": "Strasnick, E., Holz, C., Ofek, E., Sinclair, M., & Benko, H. (2018, April). Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stiffness Actuation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 644). ACM.  ",
      "doi": "10.1145/3173574.3174218"
    },
    {
      "text": "Huang, D. Y., Guo, R., Gong, J., Wang, J., Graham, J., Yang, D. N., & Yang, X. D. (2017, October). RetroShape: Leveraging Rear-Surface Shape Displays for 2.5 D Interaction on Smartwatches. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (pp. 539--551). ACM.  ",
      "doi": "10.1145/3126594.3126610"
    },
    {
      "text": "Insko, B. E., Meehan, M., Whitton, M., & Brooks, F. (2001). Passive haptics significantly enhances virtual environments(Doctoral dissertation, University of North Carolina at Chapel Hill). ",
      "doi": "10.5555/933178"
    },
    {
      "text": "Ishii, H. (2008). The tangible user interface and its evolution. Communications of the ACM, 51(6), 32--36.  ",
      "doi": "10.1145/1349026.1349034"
    },
    {
      "text": "Ishii, H., Lakatos, D., Bonanni, L., & Labrune, J. B. (2012). Radical atoms: beyond tangible bits, toward transformable materials. interactions, 19(1), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Jackson, B., Lau, T. Y., Schroeder, D., Toussaint, K. C., & Keefe, D. F. (2013). A lightweight tangible 3D interface for interactive visualization of thin fiber structures. IEEE transactions on visualization and computer graphics, 19(12), 2802--2809.  ",
      "doi": "10.1109/TVCG.2013.121"
    },
    {
      "text": "Jang, S., Kim, L. H., Tanner, K., Ishii, H., & Follmer, S. (2016, May). Haptic edge display for mobile tactile interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (pp. 3706--3716). ACM.  ",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Kim, H., Coutrix, C., & Roudaut, A. (2018, April). Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 619). ACM.  ",
      "doi": "10.1145/3173574.3174193"
    },
    {
      "text": "Lindeman, R. W., Sibert, J. L., & Hahn, J. K. (1999, March). Handheld windows: towards effective 2D interaction in immersive virtual environments. In Virtual Reality, 1999. Proceedings., IEEE (pp. 205--212). IEEE. ",
      "doi": "10.5555/554230.835715"
    },
    {
      "text": "Lo, J. Y., Huang, D. Y., Sun, C. K., Hou, C. E., & Chen, B. Y. RollingStone: Using Single Slip Taxel for Enhancing Active Finger Exploration with a Virtual Reality Controller. In Proceedings of UIST 2018. ACM.  ",
      "doi": "10.1145/3242587.3242627"
    },
    {
      "text": "MacKenzie, C. L., & Iberall, T. (1994). The grasping hand (Vol. 104). Elsevier.",
      "doi": ""
    },
    {
      "text": "McClelland, J. C., Teather, R. J., & Girouard, A. (2017, October). HaptoBend: shape-changing passive haptic feedback in virtual reality. In Proceedings of the 5th Symposium on Spatial User Interaction (pp. 82--90). ACM.  ",
      "doi": "10.1145/3131277.3132179"
    },
    {
      "text": "Möller, T., & Trumbore, B. (2005, July). Fast, minimum storage ray/triangle intersection. In ACM SIGGRAPH 2005 Courses (p. 7). ACM.  ",
      "doi": "10.1145/1198555.1198746"
    },
    {
      "text": "Mueller, S., Mohr, T., Guenther, K., Frohnhofen, J., & Baudisch, P. (2014, April). faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 3827--3834). ACM.  ",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Perry, J. C., Rosen, J., & Burns, S. (2007). Upper-limb powered exoskeleton design. IEEE/ASME transactions on mechatronics, 12(4), 408--417.",
      "doi": ""
    },
    {
      "text": "Provancher, W. (2014). Creating greater VR immersion by emulating force feedback with ungrounded tactile feedback. IQT Quarterly, 6(2), 18--21.",
      "doi": ""
    },
    {
      "text": "Rasmussen, M. K., Pedersen, E. W., Petersen, M. G., & Hornbæk, K. (2012, May). Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 735--744). ACM.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Reniers, D., & Telea, A. (2007, June). Skeleton-based hierarchical shape segmentation. In Shape Modeling and Applications, 2007. SMI'07. IEEE International Conference on (pp. 179--188). IEEE.  ",
      "doi": "10.1109/SMI.2007.33"
    },
    {
      "text": "Schweikardt, E., & Gross, M. D. (2008, February). The robot is the program: interacting with roBlocks. In Proceedings of the 2nd international conference on Tangible and embedded interaction (pp. 167--168). ACM.  ",
      "doi": "10.1145/1347390.1347427"
    },
    {
      "text": "Sheng, J., Balakrishnan, R., & Singh, K. (2006, November). An interface for virtual 3D sculpting via physical proxy. In GRAPHITE (Vol. 6, pp. 213--220).  ",
      "doi": "10.1145/1174429.1174467"
    },
    {
      "text": "Simeone, A. L., Velloso, E., & Gellersen, H. (2015, April). Substitutional reality: Using the physical environment to design virtual reality experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (pp. 3307--3316). ACM.  ",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Strobel, J. (2010). All the better to see you with: A comparison of approaches to delivering instructions for Lego construction tasks (Doctoral dissertation, Bowling Green State University).",
      "doi": ""
    },
    {
      "text": "Strohmeier, P., & Hornbæk, K. (2017, May). Generating Haptic Textures with a Vibrotactile Actuator. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (pp. 4994--5005). ACM.  ",
      "doi": "10.1145/3025453.3025812"
    },
    {
      "text": "Teng, S. Y., Kuo, T. S., Wang, C., Chiang, C. H., Huang, D. Y., Chan, L., & Chen, B. Y. PuPoP: Pop-up Prop on Palm for Virtual Reality. In Proceedings of UIST 2018. ACM.  ",
      "doi": "10.1145/3242587.3242628"
    },
    {
      "text": "Weller, M. P., Gross, M. D., & Do, E. Y. L. (2009, April). Tangible sketching in 3d with posey. In CHI'09 Extended Abstracts on Human Factors in Computing Systems (pp. 3193--3198). ACM.  ",
      "doi": "10.1145/1520340.1520455"
    },
    {
      "text": "Whitmire, E., Benko, H., Holz, C., Ofek, E., & Sinclair, M. (2018, April). Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfigurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 86). ACM.  ",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "Witmer, B. G., & Singer, M. J. (1998). Measuring presence in virtual environments: A presence questionnaire. Presence, 7(3), 225--240.  ",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Yem, V., & Kajimoto, H. (2017, March). Wearable tactile device using mechanical and electrical stimulation for fingertip interaction with virtual world. In Virtual Reality (VR), 2017 IEEE (pp. 99--104). IEEE.",
      "doi": ""
    },
    {
      "text": "Zenner, A., & Krüger, A. (2017). Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE transactions on visualization and computer graphics, 23(4), 12851294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "Zhao, Y., Kim, L. H., Wang, Y., Le Goc, M., & Follmer, S. (2017, October). Robotic Assembly of Haptic Proxy Objects for Tangible Interaction and Virtual Reality. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (pp. 82--91). ACM.  ",
      "doi": "10.1145/3132272.3134143"
    }
  ]
}