{
  "doi": "10.1145/3290605.3300832",
  "title": "Emotion Work in Experience-Centered Design",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Experience Centered Design (ECD) implores us to develop empathic relationships and understanding of participants, to actively work with our senses and emotions within the design process. However, theories of experience-centered design do little to account for emotion work undertaken by design researchers when doing this. As a consequence, how a design researcher's emotions are experienced, navigated and used as part of an ECD process are rarely published. So, while emotion is clearly a tool that we use, we don't share with one another how, why and when it gets used. This has a limiting effect on how we understand design processes, and opportunities for training. Here, we share some of our experiences of working with ECD. We analyse these using Hochschild's framework of emotion work to show how and where this work occurs. We use our analysis to question current ECD practices and provoke debate.",
  "authors": [
    {
      "name": "Madeline Balaam",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448600301",
      "orcid": "0000-0001-9472-3805"
    },
    {
      "name": "Rob Comber",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502812584",
      "orcid": "0000-0002-3127-1917"
    },
    {
      "name": "Rachel E. Clarke",
      "institution": "Northumbria University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/do/10.1145/contrib-81501686180/rel-imgonly/people-rachel-clarke-medium.jpg",
      "acmid": "81501686180",
      "orcid": "missing"
    },
    {
      "name": "Charles Windlin",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-99659085919/rel-imgonly/charles_windlin_square.jpg",
      "acmid": "99659085919",
      "orcid": "missing"
    },
    {
      "name": "Anna Ståhl",
      "institution": "RISE, Research Institutes of Sweden, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100377942",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "KTH Royal Institute of Technology, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Geraldine Fitzpatrick",
      "institution": "Technische Universität Wien, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336489057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2017. Social Computing Researchers As Vulnerable Populations. In In Proc. The Ethics for Studying Online Sociotechnical Systems in a Big Data World Workshop at CSCW 2015.",
      "doi": ""
    },
    {
      "text": "L Axelrod, M Balaam, J Burridge, P P Smith, G Fitzpatrick, S Mawson, I Ricketts, and T Rodden. 2011. A Toolkit to Explore Lived Experience of Motivation: When Words are not Enough. In 5th International Conference on Pervasive Computing Technologies for Healthcare. IEEE, IEEE, New York, New York, USA, 32--39.",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, S Rennick Egglestone, Geraldine Fitzpatrick, Tom Rodden, Ann-Marie Hughes, Anna Wilkinson, Thomas Nind, Lesley Axelrod, Eric Harris, I Ricketts, S Mawson, and J Burridge. 2011. Motivating mobility: designing for lived motivation in stroke rehabilitation. In Proceedings of the .... 3073--3082. http://dl.acm.org/citation.cfm? id=1979397  ",
      "doi": "10.1145/1978942.1979397"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2093--2102.  ",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Katja Battarbee and Ilpo Koskinen. 2005. Co-Experience: User Experience as Interaction. CoDesign 1, 1 (mar 2005), 5--18.",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Jo Briggs, Ann Light, and Pete Wright. 2016. Situated Encounters with Socially Engaged Art in Community-based Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 521--532.  ",
      "doi": "10.1145/2901790.2901882"
    },
    {
      "text": "Rachel Clarke, Peter Wright, Madeline Balaam, and John McCarthy. 2013. Digital portraits: photo-sharing after domestic violence. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 2517--2526.  ",
      "doi": "10.1145/2470654.2481348"
    },
    {
      "text": "CA Le Dantec and WK Edwards. 2008. Designs on Dignity: Perceptions of Technology among Homeless. In CHI '08 Proceedings of the twentysixth annual SIGCHI conference on Human factors in computing systems. ACM Press., New York, USA, 627--636. http://www.cc.gatech.edu/fac/ keith/pubs/chi2008-homeless.pdf  ",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "V. Dickson-Swift, E. L. James, S. Kippen, and P. Liamputtong. 2009. Researching sensitive topics: qualitative research as emotion work. Qualitative Research 9, 1 (feb 2009), 61--79.",
      "doi": ""
    },
    {
      "text": "Carolyn Ellis and Arthur P Bochner. 1999. Bringing Emotion and Personal Narrative into Medical Social Science. Health 3, 2 (1999), 229--237.",
      "doi": ""
    },
    {
      "text": "Robert Ferguson, Emily Crist, and Karyn Moffatt. 2017. A framework for negotiating ethics in sensitive settings: Hospice as a case study. Interacting with Computers 29, 1 (2017), 11--26.",
      "doi": ""
    },
    {
      "text": "Linda Finlay. 2008. Reflecting on 'Reflective practice'. Technical Report. The Open University. 1--27 pages. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "G Fitzpatrick, M Balaam, L Axelrod, E Harris, G McAllister, A M Hughes, J Burridge, T Nind, I Ricketts, A Wilkinson, and Others. 2010. Designing for rehabilitation at home. (2010).",
      "doi": ""
    },
    {
      "text": "Arthur W.: Frank. 1997. The wounded storyteller : body, illness, and ethics. University of Chicago Press, Chicago, IL.",
      "doi": ""
    },
    {
      "text": "William W. Gaver. 2004. Cultural probes and the value of uncertainty. Interactions 11, 5 (sep 2004), 53.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Matthew Gibson. 2018. The Role of Pride, Shame, Guilt, and Humiliation in Social Service Organizations: A Conceptual Framework from a Qualitative Case Study.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1967. On Face-Work. An Analysis of Ritual Elements in Social Interaction. 5--45 pages.",
      "doi": ""
    },
    {
      "text": "a Henderson. 2001. Emotional Labor and Nursing: an UnderAppreciated Aspect of Caring Work. Nursing inquiry 8, 2 (jun 2001), 130--8. http://www.ncbi.nlm.nih.gov/pubmed/11882211",
      "doi": ""
    },
    {
      "text": "A Hochschild. 1983. The Managed Heart: The Commercialization of Human Feeling. University of California Press, Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "David Holman, David Martinez-Iñigo, and Peter Totterdell. 2008. Emotional Labour and Employee Well-being: An Integrative Review. In New horizons in management. Research companion to emotion in organizations. Number January. 301--315.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Müller, Marianne Petersen, Thecla Schiphorst, Elena Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1 (2018), 8.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Phoebe Sengers, and Gerd Andersson. 2003. Sense and Sensibility: Evaluation and Interactive Art. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 241--248.  ",
      "doi": "10.1145/642611.642654"
    },
    {
      "text": "C. E. Izard, E. M. Woodburn, K. J. Finlon, E. S. Krauthamer-Ewing, S. R. Grossman, and a. Seidenfeld. 2011. Emotion Knowledge, Emotion Utilization, and Emotion Regulation. Emotion Review 3, 1 (jan 2011), 44--52.",
      "doi": ""
    },
    {
      "text": "Eric B Larson and Xin Yao. 2005. Clinical empathy as emotional labor in the patient-physician relationship. Journal of the American Medical Association 293, 9 (mar 2005), 1100--1106.",
      "doi": ""
    },
    {
      "text": "Sandi Mann. 2004. 'People-Work': Emotion Management, Stress and Coping. British Journal of Guidance & Counselling 32, 2 (may 2004), 205--221.",
      "doi": ""
    },
    {
      "text": "Michael Massimi, William Odom, Richard Banks, and David Kirk. 2011. Matters of Life and Death : Locating the End of Life in LifespanOriented HCI Research. (2011), 987--996.  ",
      "doi": "10.1145/1978942.1979090"
    },
    {
      "text": "Wendy Moncur. 2013. The emotional wellbeing of researchers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (2013), 1883.  ",
      "doi": "10.1145/2470654.2466248"
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 1326--1338.  ",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Lisa P. Nathan, Anja Thieme, Deborah Tatar, and Stacy Branham. 2017. Disruptions, dilemmas and paradoxes: Ethical matter(S) in design research. Interacting with Computers 29, 1 (2017), 1--9.",
      "doi": ""
    },
    {
      "text": "Claudia Núñez Pacheco and Lian Loke. 2017. Tacit Narratives: Surfacing Aesthetic Meaning by Using Wearable Props and Focusing. In Proc. TEI '17 (2017), 233--242.  ",
      "doi": "10.1145/3024969.3024979"
    },
    {
      "text": "Kate Eliza O'Connor. 2008. \"You Choose to Care\": Teachers, Emotions and Professional Identity. Teaching and Teacher Education 24, 1 (jan 2008), 117--126.",
      "doi": ""
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E. Blandford. 2014. Gaining empathy for non-routine mobile device use through autoethnography. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14 (2014), 987--990.  ",
      "doi": "10.1145/2556288.2557179"
    },
    {
      "text": "Karen Pugliesi. 1999. The Consequences of Emotional Labor : Effects on Work Stress, Job Satisfaction, and Well-Being. Motivation and Emotion 23, 2 (1999), 125 -- 154.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Emeline Brulé, Christopher Frauenberger, Gilles Bailly, and Geraldine Fitzpatrick. 2018. Micro-Ethics for Participatory Design with Marginalised Children. In In Proc. PDC 2018. ACM Press.  ",
      "doi": "10.1145/3210586.3210603"
    },
    {
      "text": "Kerstin Tomiak. 2019. Fieldwork and Emotions: Positionality, Method Choices and a Radio Program in South Sudan. In The Politics of Conducting Research in Africa. Springer International Publishing, 97--113.",
      "doi": ""
    },
    {
      "text": "Austin Toombs, Shad Gross, Shaowen Bardzell, and Jeffrey Bardzell. 2017. From empathy to care: A feminist care ethics perspective on long-term researcher-participant relations. Interacting with Computers 29, 1 (2017), 45--57.",
      "doi": ""
    },
    {
      "text": "Jessica L Tracy and Richard W Robins. 2004. Keeping the Self in SelfConscious Emotions : Further Arguments for a Theoretical Model. 15, 2 (2004), 171--177.",
      "doi": ""
    },
    {
      "text": "John Vines, Róisín McNaney, Amey Holden, Ivan Poliakov, Peter Wright, and Patrick Olivier. 2017. Our year with the glass: Expectations, letdowns and ethical dilemmas of technology trials with vulnerable people. Interacting with Computers 29, 1 (2017), 27--44.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Peter C Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (2013), 2617.  ",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Maria K. Wolters, Zawadhafsa Mkulo, and Petra M. Boynton. 2017. The Emotional Work of Doing eHealth Research. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17 (2017), 816--826.  ",
      "doi": "10.1145/3027063.3052764"
    },
    {
      "text": "Peter Wright and John Mccarthy. 2008. Empathy and Experience in HCI. In CHI 2008. ACM Press, 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "Peter Wright and John McCarthy. 2010. Experience-Centered Design: Designers, Users, and Communities in Dialogue. Vol. 3. 1--123 pages. ",
      "doi": "10.5555/1855065"
    }
  ]
}