{
  "doi": "10.1145/3290605.3300466",
  "title": "Bring the Outside In: Providing Accessible Experiences Through VR for People with Dementia in Locked Psychiatric Hospitals",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Many people with dementia (PWD) residing in long-term care may face barriers in accessing experiences beyond their physical premises; this may be due to location, mobility constraints, legal mental health act restrictions, or offence-related restrictions. In recent years, there have been research interests towards designing non-pharmacological interventions aiming to improve the Quality of Life (QoL) for PWD within long-term care. We explored the use of Virtual Reality (VR) as a tool to provide 360°-video based experiences for individuals with moderate to severe dementia residing in a locked psychiatric hospital. We discuss at depth the appeal of using VR for PWD, and the observed impact of such interaction. We also present the design opportunities, pitfalls, and recommendations for future deployment in healthcare services. This paper demonstrates the potential of VR as a virtual alternative to experiences that may be difficult to reach for PWD residing within locked setting.",
  "tags": [
    "virtual reality",
    "locked psychiatric hospital",
    "long-term care",
    "patient-centred design",
    "dementia",
    "person-centred care"
  ],
  "authors": [
    {
      "name": "Luma Tabbaa",
      "institution": "University of Kent, Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235197",
      "orcid": "0000-0002-0947-4988"
    },
    {
      "name": "Chee Siang Ang",
      "institution": "University of Kent, Canterbury, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319487778",
      "orcid": "0000-0002-1109-9689"
    },
    {
      "name": "Vienna Rose",
      "institution": "St. Andrew's Healthcare, Northampton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366318",
      "orcid": "missing"
    },
    {
      "name": "Panote Siriaraya",
      "institution": "Kyoto Sangyo University, Kyoto, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488667918",
      "orcid": "0000-0002-4695-6417"
    },
    {
      "name": "Inga Stewart",
      "institution": "St Andrew's Healthcare, Northampton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365276",
      "orcid": "missing"
    },
    {
      "name": "Keith G. Jenkins",
      "institution": "St Andrew's Healthcare, Northampton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365546",
      "orcid": "missing"
    },
    {
      "name": "Maria Matsangidou",
      "institution": "University of Kent, Canterbury, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235202",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. A. Kane, \"Long-Term Care and a Good Quality of Life,\" The Gerontologist, vol. 41, pp. 293--304, 2001.",
      "doi": ""
    },
    {
      "text": "C. Nieuwenhuizen and H. Nijman, \"Qualify of Life of Forensic Psychiatric Inpatients,\" International Journal of Forensic Mental Health, vol. 8, pp. 9--15, 2009.",
      "doi": ""
    },
    {
      "text": "L. Chenoweth, M. T. King, Y.-H. Jeon, H. Brodaty, J. Stein-Parbury, R. Norman, M. Haas and G. Luscombe, \"Caring for Aged Dementia Care Resident Study (CADRES) of person-centred care, dementiacare mapping, and usual care in dementia: a cluster-randomised trial,\" The Lancet Neurology, vol. 8, pp. 317--325, 2009.",
      "doi": ""
    },
    {
      "text": "J. A. Anguera, J. Boccanfuso, J. L. Rintoul, O. Al-Hashimi, F. Faraji, J. Janowich, E. Kong, Y. Larraburo, C. Rolle and E. e. a. Johnston, \"Video game training enhances cognitive control in older adults,\" Nature, vol. 501, pp. 97--101, 2013.",
      "doi": ""
    },
    {
      "text": "V. Manera, P.-D. Petit, A. Derreumaux, I. Orvieto, M. Romagnoli, G. Lyttle, R. David and P. H. Robert, \"_Kitchen and cooking,_ a serious game for mild cognitive impairment and Alzheimer_s disease: a pilot study,\" Frontiers in Aging Neuroscience, vol. 7, 2015.",
      "doi": ""
    },
    {
      "text": "A. J. Bharucha, V. Anand, J. Forlizzi, M. A. Dew, C. F. Reynolds, S. Stevens and H. Wactlar, \"Intelligent Assistive Technology Applications to Dementia Care: Current Capabilities, Limitations, and Future Challenges,\" The American Journal of Geriatric Psychiatry, vol. 17, pp. 88--104, 2009.",
      "doi": ""
    },
    {
      "text": "A. Bankole, M. Anderson, T. Smith-Jackson, A. Knight, K. Oh, J. Brantley, A. Barth and J. Lach, \"Validation of Noninvasive Body Sensor Network Technology in the Detection of Agitation in Dementia,\" American Journal of Alzheimer's Disease & Other Dementiasr, vol. 27, pp. 346--354, 2012.",
      "doi": ""
    },
    {
      "text": "H. Jimison, M. Pavel, J. McKanna and J. Pavel, \"Unobtrusive Monitoring of Computer Interactions to Detect Cognitive Status in Elders,\" IEEE Transactions on Information Technology in Biomedicine, vol. 8, pp. 248--252, 2004.  ",
      "doi": "10.1109/TITB.2004.835539"
    },
    {
      "text": "N. Kuwahara, S. Abe, K. Yasuda and K. Kuwabara, \"Networked Reminiscence Therapy for Individuals with Dementia by using Photo and Video Sharing,\" Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility, pp. 125--132, 2006.  ",
      "doi": "10.1145/1168987.1169010"
    },
    {
      "text": "G. Gowans, J. Campbell, N. Alm, R. Dye, A. Astell and M. Ellis, \"Designing a Multimedia Conversation Aid for Reminiscence Therapy in Dementia Care Environments,\" Designing a multimedia conversation aid for reminiscence therapy in dementia care environments, vol. CHI '04 Extended Abstracts on Human Factors in Computing Systems, pp. 825--836, 2004.  ",
      "doi": "10.1145/985921.985943"
    },
    {
      "text": "B. Kikhia, J. Hallberg, J. E. Bengtsson, S. Savenstedt and K. Synnes, \"Building digital life stories for memory support,\" International Journal of Computers in Healthcare, vol. 1, p. 161, 2010.  ",
      "doi": "10.1504/IJCIH.2010.037460"
    },
    {
      "text": "K. K. Zakzanis, G. Quintin, S. J. Graham and R. Mraz, \"Age and dementia related differences in spatial navigation within an immersive virtual environment,\" Medical Science Monitor, vol. 15, pp. 140--150, 2009.",
      "doi": ""
    },
    {
      "text": "T. Yamaguchi, D. A. Foloppe, P. Richard, E. Richard and P. Allain, \"A Dual-Modal Virtual Reality Kitchen for (Re)Learning of Everyday Cooking Activities in Alzheimer's Disease,\" Presence: Teleoperators and Virtual Environments, vol. 21, pp. 43--57, 2012.  ",
      "doi": "10.1162/PRES_a_00080"
    },
    {
      "text": "D. Sonntag, \"Kognit: Intelligent Cognitive Enhancement Technology by Cognitive Models and Mixed Reality for Dementia Patients,\" Cognitive Assistance in Government Papers from the AAAI 2015 Fall Symposium, 2015.",
      "doi": ""
    },
    {
      "text": "L. A. Cushman, K. Stein and C. J. Duffy, \"Detecting navigational deficits in cognitive aging and Alzheimer disease using virtual reality,\" Neurology, vol. 71, pp. 888--895, 2008.",
      "doi": ""
    },
    {
      "text": "M. Prince, M. Knapp, M. Guerchet, P. McCrone, M. Prina, A. ComasHerrera, R. Wittenberg, B. Adelaja, B. Hu and D. e. a. King, \"Dementia UK: update,\" Alzheimer_s Society, 2014.",
      "doi": ""
    },
    {
      "text": "M. Prince, A. Wimo, M. Guerchet,. G.-C. Ali, Y.-T. Wu and M. Prina, \"World Alzheimer Report 2015: The Global Impact of Dementia, An analysis of prevalence, incidence, cost and trends,\" Alzheimer's Disease International (ADI), London, 2015.",
      "doi": ""
    },
    {
      "text": "L. Garcia, A. Kartolo and E. Methot-Curtis, A Discussion of the Use of Virtual Reality in Dementia, INTECH Open Access Publisher, 2012.",
      "doi": ""
    },
    {
      "text": "C. Beck, L. Frank, N. R. Chumbler, P. O'Sullivan, T. S. Vogelpohl, J. Rasin, R. Walls and B. Baldwin, \"Correlates of Disruptive Behavior in Severely Cognitively Impaired Nursing Home Residents,\" The Gerontologist, vol. 38, pp. 189--198, 1998.",
      "doi": ""
    },
    {
      "text": "J. Cohen-Mansfield, \"Nonpharmacologic Interventions for Inappropriate Behaviors in Dementia: A Review, Summary, and Critique,\" American Journal of Geriatric Psychiatry, vol. 9, pp. 361381, 2001.",
      "doi": ""
    },
    {
      "text": "H. Verbeek, S. M. G. Zwakhalen, E. Rossum, T. Ambergen, G. I. J. M. Kempen and J. P. H. Hamers, \"Dementia Care Redesigned: Effects of Small-Scale Living Facilities on Residents, Their Family Caregivers, and Staff,\" Journal of the American Medical Directors Association, vol. 11, pp. 662--670, 2010.",
      "doi": ""
    },
    {
      "text": "A. Girardi, P. Snyman, M. Natarajan and C. Griffiths, \"Older adults in secure mental health care: health, social wellbeing and security needs measured with HoNOS-secure across different age groups,\" The Journal of Forensic Psychiatry & Psychology, pp. 1--20, 2018.",
      "doi": ""
    },
    {
      "text": "M. H. Act, 2007. {Online}. Available: http://www.opsi.gov.uk/acts/acts2007/ukpga_20070012_en_1.",
      "doi": ""
    },
    {
      "text": "A. S. Schreiner, E. Yamamoto and H. Shiotani, \"Positive affect among nursing home residents with Alzheimer's dementia: The effect of recreational activity,\" Aging & Mental Health, vol. 9, pp. 129--134, 2005.",
      "doi": ""
    },
    {
      "text": "D. Kitching, \"Depression in dementia,\" Australian Prescriber, vol. 38, pp. 209--211, 2015.",
      "doi": ""
    },
    {
      "text": "C. Long, A. McLean, A. Boothby and C. Hollin, \"Factors associated with quality of life in a cohort of forensic psychiatric in-patients,\" The British Journal of Forensic Practice, vol. 10, pp. 4--11, 2008.",
      "doi": ""
    },
    {
      "text": "J. G. Beck, S. A. Palyo, E. H. Winer, B. E. Schwagler and E. J. Ang, \"Virtual Reality Exposure Therapy for PTSD Symptoms After a Road Accident: An Uncontrolled Case Series,\" Behavior Therapy, vol. 38, pp. 39--48, 2007.",
      "doi": ""
    },
    {
      "text": "B. O. Rothbaum, L. F. Hodges, D. Ready, K. Graap and R. D. Alarcon, \"Virtual Reality Exposure Therapy for Vietnam Veterans With Posttraumatic Stress Disorder,\" The Journal of Clinical Psychiatry, vol. 62, pp. 617--622, 2001.",
      "doi": ""
    },
    {
      "text": "J. Difede, H. Hoffman and N. Jaysinghe, \"Multimedia Reviews: Innovative Use of Virtual Reality Technology in the Treatment of PTSD in the Aftermath of September 11,\" Psychiatric Services, vol. 53, pp. 1083--1085, 2002.",
      "doi": ""
    },
    {
      "text": "G. Riva, M. Bacchetta, M. Baruffi and E. Molinari, \"Virtual-realitybased multidimensional therapy for the treatment of body image disturbances in binge eating disorders: a preliminary controlled study,\" IEEE Transactions on Information Technology in Biomedicine, vol. 6, pp. 224--234, 2002.  ",
      "doi": "10.1109/TITB.2002.802372"
    },
    {
      "text": "G. Riva, M. Bacchetta, M. Baruffi, S. Rinaldi and E. Molinari, \"Virtual reality based experiential cognitive treatment of anorexia nervosa,\" Journal of Behavior Therapy and Experimental Psychiatry, vol. 30, pp. 221--230, 1999.",
      "doi": ""
    },
    {
      "text": "B. O. Rothbaum, L. Hodges, S. Smith, J. H. Lee and L. Price, \"A controlled study of virtual reality exposure therapy for the fear of flying.,\" Journal of Consulting and Clinical Psychology, vol. 68, pp. 1020--1026, 2000.",
      "doi": ""
    },
    {
      "text": "A. Garcia-Palacios, H. Hoffman, A. Carlin, T. A. Furness and C. Botella, \"Virtual reality in the treatment of spider phobia: a controlled study,\" Behaviour Research and Therapy, vol. 40, pp. 983993, 2002.",
      "doi": ""
    },
    {
      "text": "M. R. Kandalaft, N. Didehbani, D. C. Krawczyk, T. T. Allen and S. B. Chapman, \"Virtual Reality Social Cognition Training for Young Adults with High-Functioning Autism,\" Journal of Autism and Developmental Disorders, vol. 43, pp. 34--44, 2012.",
      "doi": ""
    },
    {
      "text": "L. E. Boyd, S. Gupta, S. B. Vikmani, C. M. Gutierrez, J. Yang, E. Linstead and G. R. Hayes, \"vrSocial: Toward Immersive Therapeutic VR Systems for Children with Autism,\" in CHI, 2018.  ",
      "doi": "10.1145/3173574.3173778"
    },
    {
      "text": "D. Freeman, \"Studying and Treating Schizophrenia Using Virtual Reality: A New Paradigm,\" Schizophrenia Bulletin, vol. 34, pp. 605610, 2007.",
      "doi": ""
    },
    {
      "text": "P. L. Weiss, R. Kizony, U. Feintuch and N. Katz, \"Virtual reality in neurorehabilitation,\" Textbook of neural repair and rehabilitation, vol. 51, pp. 182--97, 2006.",
      "doi": ""
    },
    {
      "text": "G. M. Doniger, M. S. Beeri, A. Bahar-Fuchs, A. Gottlieb, A. Tkachov, H. Kenan, A. Livny, Y. Bahat, H. Sharon and O. e. a. Ben-Gal, \"Virtual reality-based cognitive-motor training for middle-aged adults at high Alzheimer's disease risk: A randomized controlled trial,\" Alzheimer's & Dementia: Translational Research & Clinical Interventions, vol. 4, pp. 118--129, 2018.",
      "doi": ""
    },
    {
      "text": "V. Manera, E. Chapoulie, J. Bourgeois, R. Guerchouche, R. David, J. Ondrej, G. Drettakis and P. Robert, \"A Feasibility Study with ImageBased Rendered Virtual Reality in Patients with Mild Cognitive Impairment and Dementia,\" PLOS ONE, vol. 11, p. e0151487, 2016.",
      "doi": ""
    },
    {
      "text": "G. Optale, C. Urgesi, V. Busato, S. Marin, L. Piron, K. Priftis, L. Gamberini, S. Capodieci and A. Bordin, \"Controlling Memory Impairment in Elderly Adults Using Virtual Reality Memory Training: A Randomized Controlled Pilot Study,\" Neurorehabilitation and Neural Repair, vol. 24, pp. 348--357, 2009.",
      "doi": ""
    },
    {
      "text": "D. A. Foloppe, P. Richard, T. Yamaguchi, F. Etcharry-Bouyx and P. Allain, \"The potential of virtual reality-based training to enhance the functional autonomy of Alzheimer's disease patients in cooking activities: A single case study,\" Neuropsychological Rehabilitation, vol. 28, pp. 709--733, 2015.",
      "doi": ""
    },
    {
      "text": "J. Hodge, M. Balaam, S. Hastings and K. Morrissey, \"Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia,\" Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 2018.  ",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "P. Siriaraya and C. S. Ang, Recreating living experiences from past memories through virtual worlds for people with dementia, 2014.",
      "doi": "10.1145/2556288.2557035"
    },
    {
      "text": "M. C. Act, \"Mental Capacity Act,\" 2005. {Online}. Available: http://www.legislation.gov.uk/ukpga/2005/9/part/1/crossheading/res earch..",
      "doi": ""
    },
    {
      "text": "V. Rose, I. Stewart, K. Jenkins, C. Ang and M. Matsangidou, \"A Systematic Literature Review Exploring the Feasibility of Virtual Reality Interventions with Individuals Living with Dementia,\" ICATEGVE, 2018.",
      "doi": ""
    },
    {
      "text": "B. Reisberg, S. H. Ferris, M. J. Leon and T. Crook, \"The Global Deterioration Scale for assessment of primary degenerative dementia,\" American Journal of Psychiatry, vol. 139, pp. 1136--1139, 1982.",
      "doi": ""
    },
    {
      "text": "N. Alderman, C. Knight and C. Morgan, \"Use of a modified version of the Overt Aggression Scale in the measurement and assessment of aggressive behaviours following brain injury,\" Brain Injury, vol. 11, pp. 503--523, 1997.",
      "doi": ""
    },
    {
      "text": "M. P. Lawton, K. Van Haitsma and J. Klapper, \"Observed Emotion Rating Scale,\" Journal of Mental Health and Aging, vol. 5, pp. 69--82, 1999.",
      "doi": ""
    },
    {
      "text": "J. Brooke, \"SUS: a _quick and dirty_ usability scale. In P.W.Jordan, B. Thomas, B.A. Weerdmeester, & I.L. McClelland (Eds.), Usability Evaluation in Industry (pp. 189 194). London: Taylor and Francis.,\" 2018.",
      "doi": ""
    },
    {
      "text": "S. Nichols, C. Haldane & J.R Wilson, \"Measurement of presence and its consequences in virtual environments,\" International Journal of Human-Computer Studies, vol. 52, pp. 471--491, 2000.  ",
      "doi": "10.1006/ijhc.1999.0343"
    },
    {
      "text": "V. Braun and V. Clarke, \"Using thematic analysis in psychology,\" Qualitative Research in Psychology, vol. 3, pp. 77--101, 2006.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "M. E. Johnson and P. M. Hauser, \"The Practices of Expert Psychiatric Nurses: Accompanying The Patient to a Calmer Personal Space,\" Issues in Mental Health Nursing, vol. 22, pp. 651--668, 2001.",
      "doi": ""
    },
    {
      "text": "B. N. Gaynes, C. L. Brown, L. J. Lux, K. A. Brownley, R. A. Van Dorn, M. J. Edlund, E. Coker-Schwimmer, R. Palmieri Weber, B. Sheitman, T. Zarzar, M. Viswanathan and K. N. Lohr, \"Preventing and Deescalating Aggressive Behavior Among Adult Psychiatric Patients: A Systematic Review of the Evidence,\" vol. 8, no. 68, pp. 819--831, 2017.",
      "doi": ""
    },
    {
      "text": "K.R. Chou, R.B. Lu and W.C. Mao, \"Factors relevant to patient assaultive behavior and assault in acute inpatient psychiatric units in Taiwan,\" Archives of Psychiatric Nursing, vol. 16, pp. 187--195, 2002.",
      "doi": ""
    },
    {
      "text": "K. Canatsey and J. M. Roper, \"Removal from Stimuli for Crisis Intervention: Using Least Restrictive Methods to Improve the Quality of Patient Care,\" Issues in Mental Health Nursing, vol. 18, pp. 35--44, 1997.",
      "doi": ""
    },
    {
      "text": "M. Matsangidou, C. S. Ang and M. Sakel, \"Clinical utility of virtual reality in pain management: a comprehensive research review,\" British Journal of Neuroscience Nursing, vol. 13, no. 3, pp. 133--143, 2017.",
      "doi": ""
    },
    {
      "text": "H. G. Hoffman, D. R. Patterson, G. J. Carrougher and S. R. Sharar, \"Effectiveness of Virtual Reality_Based Pain Control With Multiple Treatments,\" The Clinical Journal of Pain, vol. 17, pp. 229--235, 2001.",
      "doi": ""
    },
    {
      "text": "K. Wolitzky, R. Fivush, E. Zimand, L. Hodges and B. O. Rothbaum, \"Effectiveness of virtual reality distraction during a painful medical procedure in pediatric oncology patients,\" Psychology & Health, vol. 20, pp. 817--824, 2005.",
      "doi": ""
    },
    {
      "text": "M. Matsangidou, C. S. Ang, A. R. Mauger, B. Otkhmezuri and L. Tabbaa, \"How Real Is Unreal?,\" Human-Computer Interaction _ INTERACT 2017, pp. 273--288, 2017.  ",
      "doi": "10.1007/978-3-319-68059-0_18"
    },
    {
      "text": "M. Matsangidou, C. Ang, A. R. Mauger, J. Intarasirisawat, B. Otkhmezuri and M. N. Avraamides, \"Is your virtual self as sensational as your real? Virtual Reality: The effect of body consciousness on the experience of exercise sensations,\" Psychology of Sport and Exercise, 2018.",
      "doi": ""
    },
    {
      "text": "D. McEwen, A. Taillon-Hobson, M. Bilodeau, H. Sveistrup and H. Finestone, \"Two-week virtual reality training for dementia: Single case feasibility study,\" Journal of Rehabilitation Research and Development, vol. 51, pp. 1069--1076, 2014.",
      "doi": ""
    },
    {
      "text": "M. Mendez, A. Joshi and E. Jimenez, \"Virtual reality for the assessment of frontotemporal dementia, a feasibility study\", Disability and Rehabilitation: Assistive Technology,\" vol. 10, no. 2, pp. 160--164, 2014.",
      "doi": ""
    },
    {
      "text": "L. Nolan, M. McCarron, P. McCallion and J. Murphy-Lawless, Perceptions of stigma in dementia: An exploratory study, 2018.",
      "doi": ""
    },
    {
      "text": "K. Morrissey, J. McCarthy and N. Pantidi, The Value of ExperienceCentred Design Approaches in Dementia Research Contexts, 2018.",
      "doi": ""
    },
    {
      "text": "D. Brechin, G. Murphy, I. James and J. Codner, \"Briefing paper: Alternatives to antipsychotic medication: Psychological approaches in managing psychological and,\" Leicester: British Psychological Society., 2013.",
      "doi": ""
    },
    {
      "text": "J. Hoey, C. Boutilier, P. Poupart, P. Olivier, A. Monk and A. Mihailidis, \"People, sensors, decisions: Customizable and adaptive technologies for assistance in healthcare,\" ACM Transactions on Interactive Intelligent Systems (TiiS), vol. 2, no. 4, 2012.  ",
      "doi": "10.1145/2395123.2395125"
    },
    {
      "text": "S. Czarnuch and A. Mihailidis, \"Home Assistive System for Dementia,\" Gerontechnology, vol. 10, no. 3, pp. 169--182, 2011.",
      "doi": ""
    },
    {
      "text": "S. Poria, E. Cambria, R. Bajpai and A. Hussain, \"A review of affective computing: From unimodal analysis to multimodal fusion,\" Information Fusion, vol. 37, pp. 98--125, 2017.  ",
      "doi": "10.1016/j.inffus.2017.02.003"
    }
  ]
}