{
  "doi": "10.1145/3290605.3300791",
  "title": "Who Gets to Future?: Race, Representation, and Design Methods in Africatown",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "This paper draws on a collaborative project called the Africatown Activation to examine the role design practices play in contributing to (or conspiring against) the flourishing of the Black community in Seattle, Washington. Specifically, we describe the efforts of a community group called Africatown to design and build an installation that counters decades of disinvestment and ongoing displacement in the historically Black Central Area neighborhood. Our analysis suggests that despite efforts to include community, conventional design practices may perpetuate forms of institutional racism: enabling activities of community engagement that may further legitimate racialized forms of displacement. We discuss how focusing on amplifying the legacies of imagination already at work may help us move beyond a simple reading of design as the solution to systemic forms of oppression.",
  "tags": [
    "design methods",
    "gentrification",
    "public art",
    "race"
  ],
  "authors": [
    {
      "name": "Jasper Tran O'Leary",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659035156/rel-imgonly/so_emotion.jpg",
      "acmid": "99659035156",
      "orcid": "0000-0003-3882-3144"
    },
    {
      "name": "Sara Zewde",
      "institution": "Studio Zewde, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366043",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Mankoff",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100650762/rel-imgonly/jenmankoff2.jpg",
      "acmid": "81100650762",
      "orcid": "0000-0001-9235-5324"
    },
    {
      "name": "Daniela K. Rosner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    }
  ],
  "references": [
    {
      "text": "1975. Redlining and Disinvestment in Central Seattle: How the Banks are Destroying our Neighborhoods. Technical Report. Seattle: Central Seattle Community Council Federation, 1975.",
      "doi": ""
    },
    {
      "text": "2010. The Seattle Open Housing Campaign, 1959--1968 CityArchives | seattle.gov. (2010). http://www.seattle.gov/ cityarchives/exhibits-and-education/digital-document-libraries/ the-seattle-open-housing-campaign",
      "doi": ""
    },
    {
      "text": "2018. AfroTech. (2018). https://afrotech.com",
      "doi": ""
    },
    {
      "text": "2018. Black in Design Conference. (2018). http://www.blackindesign. org/",
      "doi": ""
    },
    {
      "text": "2018. Iyapo Repository. (Sept. 2018). https://iyaporepository.tumblr. com/?og=1",
      "doi": ""
    },
    {
      "text": "2018. Redlining in Seattle - CityArchives | seattle.gov. (2018). https://www.seattle.gov/cityarchives/exhibits-and-education/ online-exhibits/redlining-in-seattle",
      "doi": ""
    },
    {
      "text": "Danah Abdulla. 2014. A Manifesto of Change or Design Imperialism? A Look at the Purpose of the Social Design Practice. A Matter of Design: Making Society trough Science and Technology. Proceedings of the 5th STS Italia Conference. (June 2014). http: //www.academia.edu/14145120/A Manifesto of Change or Design Imperialism A Look at the Purpose of the Social Design Practice",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2006. The Nonperformativity of Antiracism. Meridians 7, 1 (2006), 104--126. https://www.jstor.org/stable/40338719",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2012. On being included: racism and diversity in institutional life. Duke University Press, Durham; London. http: //public.eblib.com/choice/publicfullrecord.aspx?p=1173269 OCLC: Who Gets to Future? Race, Representation, and Design Methods in Africatown CHI'19, May 2019, Glasgow, Scotland 782909885.",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not?. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Sareeta Bipin Amrute. 2016. Encoding race, encoding class: Indian IT workers in Berlin. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Evan P. Apfelbaum, Michael I. Norton, and Samuel R. Sommers. 2012. Racial Color Blindness: Emergence, Practice, and Implications. Current Directions in Psychological Science 21, 3 (June 2012), 205--209.",
      "doi": ""
    },
    {
      "text": "Ian Appel and Jordan Nickerson. 2016. Pockets of Poverty: The LongTerm Effects of Redlining. SSRN Scholarly Paper ID 2852856. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/ abstract=2852856",
      "doi": ""
    },
    {
      "text": "Seyram Avle, Silvia Lindtner, and Kaiton Williams. 2017. How Methods Make Designers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 472--483.  ",
      "doi": "10.1145/3025453.3025864"
    },
    {
      "text": "Emily Badger. 2018. How Redlining's Racist Effects Lasted for Decades. The New York Times (Jan. 2018). https://www.nytimes.com/2017/08/ 24/upshot/how-redlinings-racist-effects-lasted-for-decades.html",
      "doi": ""
    },
    {
      "text": "Mara Balestrini, Yvonne Rogers, Carolyn Hassan, Javi Creus, Martha King, and Paul Marshall. 2017. A City in Common: A Framework to Orchestrate Large-scale Citizen Engagement Around Urban Issues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2282--2294.  ",
      "doi": "10.1145/3025453.3025915"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell. 2018. Utopias of Participation: Feminism, Design, and the Futures. ACM Trans. Comput.-Hum. Interact. 25, 1 (Feb. 2018), 6:1--6:24.  ",
      "doi": "10.1145/3127359"
    },
    {
      "text": "Erling Bj¨ orgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: working with marginalised social movements. CoDesign 8, 2--3 (June 2012), 127--144.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 1993. The AT-project: practical research in cooperative design. DAIMI Report Series 454 (Sept. 1993).",
      "doi": ""
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory Design That Matters-Facing the Big Issues. ACM Trans. Comput.-Hum. Interact. 25, 1 (Feb. 2018), 4:1--4:31.  ",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Andr´ e Brock. 2012. From the Blackhand Side: Twitter as a Cultural Conversation. Journal of Broadcasting & Electronic Media 56, 4 (Oct. 2012), 529--549.",
      "doi": ""
    },
    {
      "text": "Simone Browne. 2015. Dark matters: on the surveillance of blackness. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Michael Burawoy. 1998. The Extended Case Method. Sociological Theory 16, 1 (1998), 4--33.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2010. Census.gov. (2010). https://www.census. gov/en.html",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2015. Grounded Theory. In The Blackwell Encyclopedia of Sociology. American Cancer Society.",
      "doi": ""
    },
    {
      "text": "Elizabeth Chin. 2016. My life with things: the consumer diaries. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Adele E. Clarke. 2003. Situational Analyses: Grounded Theory Mapping After the Postmodern Turn. Symbolic Interaction 26, 4 (Nov. 2003), 553--576.",
      "doi": ""
    },
    {
      "text": "Rodney D. Coates (Ed.). 2011. Covert racism: theories, institutions, and experiences. Number v. 32 in Studies in critical social sciences. Brill, Leiden ; Boston. OCLC: ocn707887030.",
      "doi": ""
    },
    {
      "text": "Marilyn Cochran-Smith. 1995. Color Blindness and Basket Making Are Not the Answers: Confronting the Dilemmas of Race, Culture, and Language Diversity in Teacher Education. American Educational Research Journal 32, 3 (Sept. 1995), 493--522.",
      "doi": ""
    },
    {
      "text": "Tyrone Beason Columnist. 2018. Damage to mother's 'black teen' artwork teaches hard lessons in progressive Seattle. (Aug. 2018).",
      "doi": ""
    },
    {
      "text": "Roderic N. Crooks. 2019. Times Thirty: Access, Maintenance, and Justice. Science, Technology, & Human Values 44, 1 (Jan. 2019), 118--142.",
      "doi": ""
    },
    {
      "text": "Robin J. DiAngelo. 2018. White fragility: why it's so hard for white people to talk about racism. Beacon Press, Boston.",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt. 2014. Fostering Social Capital in Economically Distressed Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 531--540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social JusticeOriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Pelle Ehn. 2008. Participation in Design Things. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008 (PDC '08). Indiana University, Indianapolis, IN, USA, 92--101. http://dl.acm.org/ citation.cfm?id=1795234.1795248 ",
      "doi": "10.5555/1795234.1795248"
    },
    {
      "text": "Sheena Erete and Jennifer O. Burrell. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2307--2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Olivia Littles Erickson. 2015. Co-Constructing Racial Identities at Seattle's Northwest African American Museum. Thesis. https://digital.lib. washington.edu:443/researchworks/handle/1773/33555",
      "doi": ""
    },
    {
      "text": "Eve L. Ewing. 2017. Thursday Morning, Newbury Street. Indiana Review 39, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Darell Wayne Fields. 2015. Architecture in black: theory, space and appearance (2. ed ed.). Bloomsbury Academic, an imprint of Bloomsbury Publishing Plc, London. OCLC: 913814001.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and Oppression in Collaborative Systems. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). ACM, New York, NY, USA, 117--122.  ",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 56--68.  ",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Sarah E. Fox, Rafael M.L. Silva, and Daniela K. Rosner. 2018. Beyond the Prototype: Maintenance, Collective Responsibility, and Public IoT. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 21--32. CHI'19, May 2019, Glasgow, Scotland Tran O'Leary et al.  ",
      "doi": "10.1145/3196709.3196710"
    },
    {
      "text": "Christopher Frauenberger, Amy S. Bruckman, Cosmin Munteanu, Melissa Densmore, and Jenny Waycott. 2017. Research Ethics in HCI: A Town Hall Meeting. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1295--1299.  ",
      "doi": "10.1145/3027063.3051135"
    },
    {
      "text": "David Hankerson, Andrea R. Marshall, Jennifer Booker, Houda El Mimouni, Imani Walker, and Jennifer A. Rode. 2016. Does Technology Have Race?. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 473--486.  ",
      "doi": "10.1145/2851581.2892578"
    },
    {
      "text": "Donna Jeanne Haraway. 2016. Staying with the trouble: making kin in the Chthulucene. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Saidiya V. Hartman. 2007. Lose your mother: a journey along the Atlantic slave route (1. ed ed.). Farrar, Straus and Giroux, New York. OCLC: 836422604.",
      "doi": ""
    },
    {
      "text": "Justin Carder. 2018. Midtown design looks too much like SoLU, not enough like the CD-Can new Central Area Design Review Board help? (July 2018).",
      "doi": ""
    },
    {
      "text": "Kofi Boone. 2017. Black Landscapes Matter. (2017). http:// groundupjournal.org/blacklandscapesmatter/",
      "doi": ""
    },
    {
      "text": "Morten Kyng. 2010. Bridging the Gap Between Politics and Techniques: On the next practices of participatory design. © Scandinavian Journal of Information Systems 22 (Jan. 2010), 49--68.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec. 2016. Designing publics. The MIT Press, Cambridge, Massachusetts. ",
      "doi": "10.5555/3100000"
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2 (April 2013), 241--264.",
      "doi": ""
    },
    {
      "text": "Ann Light and Yoko Akama. 2014. Structuring Future Social Relations: The Politics of Care in Participatory Practice. In Proceedings of the 13th Participatory Design Conference: Research Papers - Volume 1 (PDC '14). ACM, New York, NY, USA, 151--160.  ",
      "doi": "10.1145/2661435.2661438"
    },
    {
      "text": "Kristina Lindstr¨ om and Asa Stahl. 2014. Patchworking publics-in-themaking: design, media and public engagement. Ph.D. Dissertation. Malm¨ o University, Malm¨ o. OCLC: 940844243.",
      "doi": ""
    },
    {
      "text": "George Lipsitz. 2007. The Racialization of Space and the Spatialization of Race Theorizing the Hidden Architecture of Landscape. Landscape Journal 26, 1 (Jan. 2007), 10--23.",
      "doi": ""
    },
    {
      "text": "Victor Luckerson. 2018. Black Wall Street: The African American Haven That Burned and Then Rose From the Ashes. (June 2018). https://www.theringer.com/2018/6/28/17511818/ black-wall-street-oklahoma-greenwood-destruction-tulsa",
      "doi": ""
    },
    {
      "text": "Achille Mbembe and Laurent Dubois. 2017. Critique of Black reason. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Katherine McKittrick. 2006. Demonic grounds: Black women and the cartographies of struggle. University of Minnesota Press, Minneapolis. OCLC: ocm62533814.",
      "doi": ""
    },
    {
      "text": "Katherine McKittrick (Ed.). 2015. Sylvia Wynter: on being human as praxis. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Fred Moten. 2017. Black and Blur. Number v. {1} in Consent not to be a single being. Duke University Press, Durham ; London.",
      "doi": ""
    },
    {
      "text": "Lisa Nakamura. 2014. Indigenous Circuits: Navajo Women and the Racialization of Early Electronic Manufacture. American Quarterly 66, 4 (Dec. 2014), 919--941.",
      "doi": ""
    },
    {
      "text": "Nathan Matias. 2015. Anti-Oppressive Design: From Theory to Praxis: Jill Dimond at CivicMIT -- MIT Center for Civic Media. (March 2015). https://civic.mit.edu/2015/03/19/ anti-oppressive-design-from-theory-to-praxis-jill-dimond-at-civicmit/",
      "doi": ""
    },
    {
      "text": "Lilly U. Nguyen. 2017. Ethnic Platforms and the Failure of TechnoFuturity. Journal of Asian American Studies 20, 1 (Feb. 2017), 51--68.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression: how search engines reinforce racism. New York University Press, New York.",
      "doi": ""
    },
    {
      "text": "Tal´ria Petrone, Samia Bomfim, Jo Cavalcanti, and Fernanda Melchionna. 2018. The Feminist Resistance to the Radical Right in Brazil: A Forum of Four Brazilian Feminist Political Leaders. (2018). https://www.crg.berkeley.edu/events/ the-feminist-resistance-to-the-radical-right-in-brazil/",
      "doi": ""
    },
    {
      "text": "Minh-H",
      "doi": ""
    },
    {
      "text": "a T. Pha .m. 2015. Asians wear clothes on the internet: race, gender, and the work of personal style blogging. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Cedric J. Robinson. 2000. Black marxism: the making of the Black radical tradition. University of North Carolina Press, Chapel Hill, N.C.",
      "doi": ""
    },
    {
      "text": "Jennifer A. Rode. 2011. Reflexivity in Digital Anthropology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 123--132.  ",
      "doi": "10.1145/1978942.1978961"
    },
    {
      "text": "Daniela Rosner. 2018. Critical fabulations: reworking the methods and margins of design. The MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Saba Kawas, Wenqi Li, Nicole Tilly, and Yi-Chen Sung. 2016. Out of Time, Out of Place: Reflections on Design Workshops As a Research Method. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1131--1141.  ",
      "doi": "10.1145/2818048.2820021"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity Through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5412--5427.  ",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Ari Schlesinger, Kenton P. O'Hara, and Alex S. Taylor. 2018. Let's Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 315:1--315:14.  ",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Jared Sexton. 2012. Ante-Anti-Blackness: Afterthoughts. Lateral (2012).",
      "doi": ""
    },
    {
      "text": "Christina Elizabeth Sharpe. 2016. In the wake: on Blackness and being. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Thomas Smyth and Jill Dimond. 2014. Anti-oppressive Design. interactions 21, 6 (Oct. 2014), 68--71.  ",
      "doi": "10.1145/2668969"
    },
    {
      "text": "Daniel G. Sol´ orzano and Tara J. Yosso. 2002. Critical Race Methodology: Counter-Storytelling as an Analytical Framework for Education Research. Qualitative Inquiry 8, 1 (Feb. 2002), 23--44.",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures: Staying with the Trouble of Digital Personal Assistants Through Design Fiction. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 869--880.  ",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Hortense J. Spillers. 1987. Mama's Baby, Papa's Maybe: An American Grammar Book. Diacritics 17, 2 (1987), 65--81.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Agencies in technology design: feminist reconfigurations. Who Gets to Future? Race, Representation, and Design Methods in Africatown CHI'19, May 2019, Glasgow, Scotland",
      "doi": ""
    },
    {
      "text": "Nick Taylor, Loraine Clarke, Martin Skelly, and Sara Nevay. 2018. Strategies for Engaging Communities in Creating Physical Civic Technologies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 507:1--507:12.  ",
      "doi": "10.1145/3173574.3174081"
    },
    {
      "text": "Walter Hood. 2013. Developing a Cultural Practice. (Nov. 2013). https: //frameworks.ced.berkeley.edu/2013/developing-a-cultural-practice/",
      "doi": ""
    },
    {
      "text": "Woodrow W. Winchester, III. 2018. Afrofuturism, Inclusion, and the Design Imagination. Interactions 25, 2 (Feb. 2018), 41--45.  ",
      "doi": "10.1145/3182655"
    },
    {
      "text": "Heike Winschiers-Theophilus and Nicola J. Bidwell. 2013. Toward an Afro-Centric Indigenous HCI Paradigm. International Journal of Human--Computer Interaction 29, 4 (March 2013), 243--255.",
      "doi": ""
    },
    {
      "text": "Zach Mortice. 2017. Decoding Oppression in Architecture: Design as a Tool for Social Justice. (Oct. 2017). https://www.autodesk.com/ redshift/design-for-social-justice/",
      "doi": ""
    },
    {
      "text": "Teun Zuiderent-Jerak. 2015. Situated intervention: sociological experiment in health care. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    }
  ]
}