{
  "doi": "10.1145/3290605.3300788",
  "title": "Haptipedia: Accelerating Haptic Device Discovery to Support Interaction & Engineering Design",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Creating haptic experiences often entails inventing, modifying, or selecting specialized hardware. However, interaction designers are rarely engineers, and 30 years of haptic inventions are buried in a fragmented literature that describes devices mechanically rather than by potential purpose. We conceived of Haptipedia to unlock this trove of examples: Haptipedia presents a device corpus for exploration through metadata that matter to both device and interaction designers. It is a taxonomy of device attributes that go beyond physical description to capture potential utility, applied to a growing database of 105 grounded force-feedback devices, and accessed through a public visualization that links utility to morphology. Haptipedia's design was driven by both systematic review of the haptic device literature and rich input from diverse haptic designers. We describe Haptipedia's reception (including hopes it will redefine device reporting standards) and our plans for its sustainability through community participation.",
  "tags": [
    "force-feedback technology",
    "haptic design",
    "database",
    "taxonomy",
    "haptics",
    "visualization"
  ],
  "authors": [
    {
      "name": "Hasti Seifi",
      "institution": "Max Planck Institute for Intelligent Systems, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502650318",
      "orcid": "0000-0001-6437-0463"
    },
    {
      "name": "Farimah Fazlollahi",
      "institution": "Max Planck Institute for Intelligent Systems, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366759",
      "orcid": "missing"
    },
    {
      "name": "Michael Oppermann",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365941",
      "orcid": "missing"
    },
    {
      "name": "John Andrew Sastrillo",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365656",
      "orcid": "missing"
    },
    {
      "name": "Jessica Ip",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366723",
      "orcid": "missing"
    },
    {
      "name": "Ashutosh Agrawal",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366301",
      "orcid": "missing"
    },
    {
      "name": "Gunhyuk Park",
      "institution": "Max Planck Institute for Intelligent Systems, Stuttgart, --- Select One ---, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488655407",
      "orcid": "0000-0003-2677-5907"
    },
    {
      "name": "Katherine J. Kuchenbecker",
      "institution": "Max Planck Institute for Intelligent Systems, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100483080",
      "orcid": "missing"
    },
    {
      "name": "Karon E. MacLean",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    }
  ],
  "references": [
    {
      "text": "1992--2016. IEEE Haptics Symposium. about.hapticssymposium.org",
      "doi": ""
    },
    {
      "text": "1992--2017. IEEE Haptics Symposium and IEEE World Haptics Conf. about.hapticssymposium.org",
      "doi": ""
    },
    {
      "text": "2001--2016. Eurohaptics. eurohaptics.org",
      "doi": ""
    },
    {
      "text": "2003 - 2018. Tableau Desktop. https://www.tableau.com/. {Online; accessed 16-August-2018}.",
      "doi": ""
    },
    {
      "text": "2003--2018. IEEE GlobalSpec. https://www.globalspec.com/. {Online; accessed 16-August-2018}.",
      "doi": ""
    },
    {
      "text": "2003--2018. McMaster-Carr. https://www.mcmaster.com/. {Online; accessed 16-August-2018}.",
      "doi": ""
    },
    {
      "text": "2005--2017. IEEE World Haptics Conf. about.hapticssymposium.org",
      "doi": ""
    },
    {
      "text": "2008 - 2018. GROBID. https://github.com/kermitt2/grobid. {Online; accessed 16-August-2018}.",
      "doi": ""
    },
    {
      "text": "2008--2017. IEEE Transactions on Haptics. http://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4543165",
      "doi": ""
    },
    {
      "text": "Wolfgang Aigner, Silvia Miksch, Heidrun Schumann, and Christian Tominski. 2011. Visualization of time-oriented data. Springer Science & Business Media. ",
      "doi": "10.5555/2016703"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2004. Designing interaction, not interfaces. In Proceedings of the working conference on Advanced visual interfaces. ACM, 15--22.  ",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Benjamin B. Bederson and Ben Shneiderman. 2003. Theories for understanding information visualization. The craft of information visualization: Readings and reflections (2003), 349--351.",
      "doi": "10.5555/2843507"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: DataDriven Documents. IEEE Transactions on Visualization and Computer Graphics (Proc. InfoVis) (2011). http://vis.stanford.edu/papers/d3  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer, Bongshin Lee, Benjamin Bach, Nathalie Henry Riche, and Tamara Munzner. 2017. Timelines revisited: A design space and considerations for expressive storytelling. IEEE transactions on visualization and computer graphics 23, 9 (2017), 2151--2164.",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A multi-level typology of abstract visualization tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2376--2385.  ",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Christopher Clark and Santosh Divvala. 2015. Looking beyond text: Extracting figures, tables, and captions from computer science paper. (2015).",
      "doi": ""
    },
    {
      "text": "Anamaria Crisan, Jennifer L Gardy, and Tamara Munzner. 2018. An method for systematically surveying data visualizations in infectious disease genomic epidemiology. bioRxiv (2018), 325290.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Juan José López Delgado, and Katherine J. Kuchenbecker. 2014. One hundred data-driven haptic texture models and opensource methods for rendering on 3D objects. In Proceedings of IEEE Haptics Symposium (HAPTICS). 319--325.",
      "doi": ""
    },
    {
      "text": "Raimund Dachselt and Anett Hübner. 2007. Three-dimensional menus: A survey and taxonomy. Computers & Graphics 31, 1 (2007), 53 -- 65.  ",
      "doi": "10.1016/j.cag.2006.09.006"
    },
    {
      "text": "Kenneth P. Fishkin. 2004. A taxonomy for and analysis of tangible interfaces. Personal and Ubiquitous Computing 8, 5 (2004), 347--358. ",
      "doi": "10.5555/1023813.1023819"
    },
    {
      "text": "Jonas Forsslund, Michael Yip, and Eva-Lotta Sallnäs. 2015. WoodenHaptics. In Proceedings of the ninth international conference on tangible, embedded, and embodied interaction (TEI). ACM Press, New York, New York, USA, 133--140.  ",
      "doi": "10.1145/2677199.2680595"
    },
    {
      "text": "Colin Gallacher, Arash Mohtat, Steve Ding, and József Kövecses. 2016. Toward open-source portable haptic displays with visual-force-tactile feedback colocation. In Proceedings of IEEE Haptics Symposium (HAPTICS). IEEE, 65--71.",
      "doi": ""
    },
    {
      "text": "Colin P Groves. 2001. Primate taxonomy. (2001).",
      "doi": ""
    },
    {
      "text": "Blake Hannaford and Allison M. Okamura. 2016. Haptics. In Springer Handbook of Robotics. Springer, 1063--1084.",
      "doi": ""
    },
    {
      "text": "Vincent Hayward and Oliver R. Astley. 1996. Performance measures for haptic interfaces. In Proceedings of the International Symposium on Robotics Research, Vol. 7. MIT Press, 195--206.",
      "doi": ""
    },
    {
      "text": "Vincent Hayward, Jehangir Choksi, Gonzalo Lanvin, and Christophe Ramstein. 1994. Design and multi-objective optimization of a linkage for a haptic interface. Springer Netherlands, Dordrecht, 359--368.",
      "doi": ""
    },
    {
      "text": "Vincent Hayward and Karon Maclean. 2007. Do it yourself haptics: part I. IEEE Robotics & Automation Magazine 14, 4 (2007), 88--104. http://ieeexplore.ieee.org/xpl/articleDetails.jsp?arnumber=4437756",
      "doi": ""
    },
    {
      "text": "Johannes Kehrer and Helwig Hauser. 2013. Visualization and Visual Analysis of Multifaceted Scientific Data: A Survey. IEEE Transactions on Visualization & Computer Graphics 19, 3 (2013), 495--513.  ",
      "doi": "10.1109/TVCG.2012.110"
    },
    {
      "text": "Kostiantyn Kucher and Kerren Andreas. 2015. Text visualization techniques: Taxonomy, visual survey, and community insights. In IEEE Pacific Visualization Symposium (PacificVis). 117--121.",
      "doi": ""
    },
    {
      "text": "Karon E. MacLean, Oliver Schneider, and Hasti Seifi. 2017. Multisensory haptic interactions: Understanding the sense and designing for it. In The Handbook of Multimodal-Multisensor Interfaces. ACM Books.  ",
      "doi": "10.1145/3015783.3015788"
    },
    {
      "text": "Thomas H. Massie and J. Kenneth Salisbury. 1994. The PHANToM haptic interface: A device for probing virtual objects. In ASME/IMECE Haptic Interfaces for Virtual Environment & Teleoperator Systems. 295--301.",
      "doi": ""
    },
    {
      "text": "Camille Moussette and Richard Banks. 2011. Designing through making. In Proceedings of the sixth international conference on tangible, embedded and embodied interaction (TEI). ACM Press, New York, USA, 279--282.  ",
      "doi": "10.1145/1935701.1935763"
    },
    {
      "text": "Camille Moussette, Stoffel Kuenen, and Ali Israr. 2012. Designing haptics. In Proceedings of the sixth international conference on tangible, embedded and embodied interaction (TEI). ACM Press, New York, New York, USA, 351.  ",
      "doi": "10.1145/2148131.2148215"
    },
    {
      "text": "Paul E Nelson, M Cecilia Dignani, and Elias J Anaissie. 1994. Taxonomy, biology, and clinical aspects of Fusarium species. Clinical microbiology reviews 7, 4 (1994), 479--504.",
      "doi": ""
    },
    {
      "text": "Evren Samur. 2012. Performance metrics for haptic interfaces. Springer Science & Business Media. ",
      "doi": "10.5555/2349015"
    },
    {
      "text": "Oliver Schneider, Karon MacLean, Colin Swindells, and Kellogg Booth. 2017. Haptic experience design: What hapticians do and where they need help. International Journal of Human-Computer Studies (2017).  ",
      "doi": "10.1016/j.ijhcs.2017.04.004"
    },
    {
      "text": "Hasti Seifi, Kailun Zhang, and Karon MacLean. 2015. VibViz: Organizing, visualizing and navigating vibration libraries. In Proceedings of the IEEE World Haptics Conference (WHC). 52--58.",
      "doi": ""
    },
    {
      "text": "Christian Tominski and Wolfgang Aigner. 2015. The TimeViz Browser: A visual survey of visualization techniques for time-oriented data. timeviz.net",
      "doi": ""
    }
  ]
}