{
  "doi": "10.1145/3290605.3300881",
  "title": "\"Notjustgirls\": Exploring Male-related Eating Disordered Content across Social Media Platforms",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Eating disorders (EDs) are a worldwide public health concern that impact approximately 10% of the U.S. population. Our previous research characterized these behaviors across online spaces. These characterizations have used clinical terminology, and their lexical variants, to identify ED content online. However, previous HCI research on EDs (including our own) suffers from a lack of gender and cultural diversity. In this paper, we designed a follow-up study of online ED characterizations, extending our previous methodologies to focus specifically on male/masculine-related content. We highlight the similarities and differences found in the terminology utilized and media archetypes associated with the social media content. Finally, we discuss other considerations highlighted through our analysis of the male-related content that is missing from the previous research.",
  "tags": [
    "twitter",
    "manorexia",
    "gender",
    "social media",
    "bulimia",
    "anorexia",
    "instagram",
    "tumblr",
    "bigorexia",
    "male",
    "eating disorder"
  ],
  "authors": [
    {
      "name": "Jessica A. Pater",
      "institution": "Parkview Research Center & Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81503686242/rel-imgonly/headshot-small.jpg",
      "acmid": "81503686242",
      "orcid": "missing"
    },
    {
      "name": "Lauren E. Reining",
      "institution": "Parkview Research Center, Fort Wayne, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366611",
      "orcid": "missing"
    },
    {
      "name": "Andrew D. Miller",
      "institution": "Indiana University Purdue University Indianapolis (IUPUI), Indianapolis, IN, USA",
      "img": "/do/10.1145/contrib-81460650224/rel-imgonly/miller2017.jpg",
      "acmid": "81460650224",
      "orcid": "missing"
    },
    {
      "name": "Tammy Toscos",
      "institution": "Parkview Research Center, Fort Wayne, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350569409",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2008. Males and Eating Disorders. NIH Medline Plus (2008). https://medlineplus.gov/magazine/issues/spring08/articles/spring08pg18.html",
      "doi": ""
    },
    {
      "text": "2018. Eating Disorders in Men & Boys. National Eating Disorder Association. https://www.nationaleatingdisorders.org/learn/general-information/research-on-males",
      "doi": ""
    },
    {
      "text": "2018. Sexual Orientation and Gender Identity Definitions. Human Rights Campaign. https://www.hrc.org/resources/sexual-orientation-and-gender-identity-terminology-and-definitions",
      "doi": ""
    },
    {
      "text": "Athar Ahmad, Nicholas Rotherham, and Talwar Divya. 2015. Muscle dysmorphia: One in 10 men in gyms believed to have 'bigorexia'. BBC Newsbeat. http://www.bbc.co.uk/newsbeat/article/34307044/ muscle-dysmorphia-one-in-10-men-in-gyms-believed-to-have-bigorexia",
      "doi": ""
    },
    {
      "text": "American Psychological Association. 2013. Diagnostic and Statistical Manual of Mental Disorders (DSM-V) (5th ed.). Washington.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L. Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding Social Media Disclosures of Sexual Abuse Through the Lenses of Support Seeking and Anonymity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3906--3918.  ",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Ellen. Annandale. 2008. Women's Health and Social Change. Routledge.",
      "doi": ""
    },
    {
      "text": "S. Bryn Austin, Najat J. Ziyadeh, Heather L. Corliss, Margaret Rosario, Jess Wypij, David adn Haines, Carlos A. Camargo Jr., and Alison E. Field. 2009. Sexual Orientation Disparities in Purging and Binge Eating from Early to Late Adolescence. Journal of Adolescent Health 45, 3 (2009), 238--245.",
      "doi": ""
    },
    {
      "text": "Natalie Boero and Cheri Jo Pascoe. 2012. Pro-anorexia Communities and Online Interaction: Bringing the Pro-ana Body Online. Body & Society 18, 2 (2012), 27--57.",
      "doi": ""
    },
    {
      "text": "Dina L G Borzekowski, Summer Schenk, Jenny L Wilson, and Rebecka Peebles. 2010. e-Ana and e-Mia: A content analysis of pro-eating disorder Web sites. American Journal of Public Health 100, 8 (August 2010), 1526--1534.",
      "doi": ""
    },
    {
      "text": "Anna Brytek-Matera. 2012. Orthorexia nervosa an eating disorder, obsessive-compulsive disorder or disturbed eating habit? Archives of Psychiatry and Psychotherapy 1, 1 (2012), 55--60.",
      "doi": ""
    },
    {
      "text": "Jerel P Calzo, Nicholas J Horton, Kendrin R Sonneville, Sonja A Swanson, Ross D Crosby, Nadia Micali, Kamryn T Eddy, and Alison E Field. 2016. Male eating disorder symptom patterns and health correlates from 13 to 26 years of age. Journal of the American Academy of Child & Adolescent Psychiatry 55, 8 (2016), 693--700.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Yannis Kalantidis, Jessica A. Pater, Munmun De Choudhury, and David A. Shamma. 2017. Multimodal Classification of Moderated Online Pro-Eating Disorder Content. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3213--3226.  ",
      "doi": "10.1145/3025453.3025985"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1171--1184.  ",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Stevie Chancellor, Jessica A. Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #thygapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 1201--1213.  ",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Xuetong Chen, Martin D. Sykora, Thomas W. Jackson, and Suzanne Elayan. 2018. What About Mood Swings: Identifying Depression on Twitter with Temporal Measures of Emotions. In Companion Proceedings of the The Web Conference 2018 (WWW '18). International World Wide Web Conferences Steering Committee, 1653--1660.  ",
      "doi": "10.1145/3184558.3191624"
    },
    {
      "text": "Cooper, Britney. 2016. Intersectionality.",
      "doi": ""
    },
    {
      "text": "Will H. Courtenay. 2000. Constructions of masculinity and their influence on men's well-being; a theory of gender and health. Social Science & Medicine 50, 5 (2000), 185--190.",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 2014. Demarginalizing the intersection of race and sex: A black feminist critique of antidiscrimination doctrine, feminist theory and antiracist politics. U. Chi. Legal F. 68 (2014), 139--167.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury. 2015. Anorexia on Tumblr : A Characterization Study Studies on Anorexia., 43--50 pages.  ",
      "doi": "10.1145/2750511.2750515"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Social media as a measurement tool of depression in populations. In Proceedings of the 5th Annual ACM Web Sciene Conference. ACM, 47--56.  ",
      "doi": "10.1145/2464464.2464480"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J. Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared Facebook data., 626--638 pages.  ",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting Depression via Social Media. In ICWSM. 1--10.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coopersmith, and Mrinal Kumar. 2016. Discovering Shifts to Suicidal Ideation from Mental Health Content in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering Shifts to Suicidal Ideation from Mental Health Content in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Munmun De Choudhury, S Sharma, Sanketha, Tomaz Logar, Wounter Eekhout, and Rene Clausen Nielsen. 2017. Gender and Cross-Cultural Differences in Social Media Disclosures of Mental Illness. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 353--369.  ",
      "doi": "10.1145/2998181.2998220"
    },
    {
      "text": "Michaelanne Dye, Neha Kumar, Ari Schlesinger, Marisol Wong- Villacres, Morgan G. Ames, Rajesh Veeraraghavan, Jacki O'Neill, Joyojeet Pal, and Mary L. Gray. 2018. Solidarity Across Borders: Navigating Intersections Towards Equity and Inclusion. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '18). ACM, New York, NY, USA, 487--494.  ",
      "doi": "10.1145/3272973.3273007"
    },
    {
      "text": "Christopher Fairburn and Paul Harrison. 2003. Eating Disorders. The Lancet 361, 9355 (2003), 407--416.",
      "doi": ""
    },
    {
      "text": "Matthew B. Feldman and Illan H. Meyer. 2007. Eating Disorders in Diverse Lesbian, Gay, and Bisexual Populations. International Journal of Eating Disorders 40, 3 (2007), 218--226.",
      "doi": ""
    },
    {
      "text": "Rachel A Fleming-May and Laura E Miller. 2010. \"I'm Scared to Look But I'm Dying to Know\": Information Seeking and Sharing on Pro-Ana Weblogs. Proceedings of the American Society for Information Science and Technology 47, 1 (2010), 1--9. ",
      "doi": "10.5555/1920331.1920419"
    },
    {
      "text": "Samantha Gluck. 2017. What is Muscle Dysmorphia, Bigorexia, Reverse Anorexia? Healthy Place. https://www. healthyplace.com/ocd-related-disorders/body-dysmorphic-disorder/what-is-muscle-dysmorphia-bigorexia-reverse-anorexia",
      "doi": ""
    },
    {
      "text": "Ann E. Goebel-Fabbri. 2008. Diabetes adn Eating Disorders. Journal of Diabetes Science and Technology 3, 2 (2008), 530--532.",
      "doi": ""
    },
    {
      "text": "Kathryn H Gordon, Marisol Perez, and Thomas E. Joiner Jr. 2002. The impact of racial stereotypes on eating disorder recognition. International Journal of Eating Disorders 32, 2 (2002), 219--224.",
      "doi": ""
    },
    {
      "text": "ST Greenberg and EG Schoen. 2008. Males and eating disorders: Gender-based therapy for eating disorder recovery. Professional Psychology: Research and Practice 39 (2008), 464--471.",
      "doi": ""
    },
    {
      "text": "Scott Griffiths, Stuart B. Murray, Isable Krug, and Sian A. McLean. 2018. The contribution of social media to body dissatisfaction, eating disorder symptoms, and anabolic steroid use among sexual minority men. Cyberpsychology, Behavior, and Social Networking 21, 3 (2018), 149--156.",
      "doi": ""
    },
    {
      "text": "Sharath Chandra Guntuku, David B. Yaden, Margaret L. Kern, Lyle H. Ungar, and Johannes C. Eichstaedt. 2017. Detecting depression and mental illness on social media: an integrative review. Current Opinion in Behavioral Sciences 18 (2017), 43--49.",
      "doi": ""
    },
    {
      "text": "Oliver Haimson, Nazanin Andalibi, and Jessica A. Pater. 2016. Ethical Use of Visual Social Media Content in Research Publications. https://ahrecs.com/uncategorized/ ethical-use-visual-social-media-content-research-publications",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the ACM Conference on Computer Supported Cooperative Work. ACM, 1176--1190.  ",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Christina N. Harrington and Anne Marie Piper. 2018. Informing Design Through Sociocultural Values: Co-Creation with Low-Income African-American Older Adults. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '18). ACM, New York, NY, USA, 294--298.  ",
      "doi": "10.1145/3240925.3240966"
    },
    {
      "text": "Nguyen Thi Hoan, Arul Chib, and Ram Mahalingham. 2016. Mobile Phones and Gender Empowerment: Enactment of 'Restricted Agency'. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD '16). ACM, New York, NY, USA, 5:1--5:10.  ",
      "doi": "10.1145/2909609.2909671"
    },
    {
      "text": "James J.I. James I Hudson, Eva Hiripi, Harrison Pope Jr., Ronald R.C. Kessler, H.G. Pope, and Ronald R.C. Kessler. 2007. The Prevalence and Correlates of Eating Disorders in the National Comorbidity Survey Replication. Biological Psychiatry 61, 3 (2007), 348--358.",
      "doi": ""
    },
    {
      "text": "Deepali J. Joshi, Nikhil Supekar, Rashi Chauhan, and Manasi S. Patwardhan. 2017. Modeling and Detecting Change in User Behavior Through His Social Media Posting Using Cluster Analysis. In Proceedings of the Fourth ACM IKDD Conferences on Data Sciences (CODS '17). ACM, New York, NY, USA, 5:1--5:9.  ",
      "doi": "10.1145/3041823.3041830"
    },
    {
      "text": "Anna Keski-Rahkonen and Linda Mustelin. 2016. Epidemiology of eating disorders in Europe: prevalence, incidence, comorbidity, course, consequences, and risk factors. Current Opinion in Psychiatry 29, 6 (2016), 340--345.",
      "doi": ""
    },
    {
      "text": "M. Kimmel. 1986. Introduction: toward men's studies. American Behavioural Scientist 29, 5 (1986), 517--529.",
      "doi": ""
    },
    {
      "text": "Mrinal Kumar, Mark Dredze, Glen Coppersmith, and Munmun De Choudhury. 2015. Detecting Changes in Suicide Content Manifested in Social Media Following Celebrity Suicides.. In Proceedings of the 26th ACM Conference on Hypertext & Social Media. ACM, 85--94.  ",
      "doi": "10.1145/2700171.2791026"
    },
    {
      "text": "Daneil Le Grange, Sonja A Swanson, S.J. Scott J Crow, and Kathleen R K.R. Merikangas. 2012. Eating disorder not otherwise specified presentation in the US population. International Journal of Eating Disorders 45, 5 (2012), 711--718.",
      "doi": ""
    },
    {
      "text": "Man. 2018. The Oxford Dictionary. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Masculinity. 2018. The Oxford Dictionary. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "C. Meyer, N Leung, G Waller, S Perkins, N Paice, and J Mitchell. 2005. Anger and bulimic psychopathology: Gender differences in a nonclinical group. International Journal of Eating Disorders 37 (2005), 69--71.",
      "doi": ""
    },
    {
      "text": "Lachlan Mitchell, Stuart Murray, Stephen Cobley, Daniel Hackett, Louise Giffod, Janelle, Capling, and Helen O'Connor. 2017. Muscle dysmorphia symptomatology and associated psychological features in bodybuilders and non-bodybuilder resistance trainers: A systematic review and meta-analysis. Sports Medicine 47, 2 (2017), 233--259.",
      "doi": ""
    },
    {
      "text": "D. Mitchison and JM Mond. 2015. Epidemiology of eating disorders, eating disordered behaviour, and body image disturbance in males: a narrative review. Journal of Eating Disorders 3, 1 (2015), 1--9.",
      "doi": ""
    },
    {
      "text": "John F Morgan. 2008. The invisible man: A self-help guide for men with eating disorders, compulsive exercise and bigorexia. Routledge.",
      "doi": ""
    },
    {
      "text": "Richard Morton. 1694. Phthisologica, or, a Treatise of Consumption. London.",
      "doi": ""
    },
    {
      "text": "Philip E Mosley. 2017. Bigorexia : Bodybuilding and Muscle Dysmorphia. European Eating Disorders Review May 2009 (2017).",
      "doi": ""
    },
    {
      "text": "Stuart B. Murray. 2017. Gender identity and eating disorders: The need to delineate novel pathways for eating disorder symptomatology. Journal of Adolescent Health 60, 1 (2017), 1--2.",
      "doi": ""
    },
    {
      "text": "Stuart B. Murray, Scott Griffiths, Leila Hazery, Tori Shen, Tom Wooldridge, and Jonathan M. Mond. 2016. Go big or go home: A thematic content analysis of pro-muscularity websites. Body Image 16 (2016), 17--20.",
      "doi": ""
    },
    {
      "text": "Stuart B. Murray, Scott Griffiths, and Jonathan M. Mond. 2016. Evolving eating disorder psychopathology: conceptualising muscularityoriented disordered eating. Teh British Journal of Psychiatry 208, 414--415 (2016).",
      "doi": ""
    },
    {
      "text": "Stuart B. Murray, Jason M. Nagata, Scott Griffiths, Jerel P. Calzo, tiffany A. Brown, Deborah Mitchison, Aaron J. Blashill, and Jonathan M. Mond. 2017. The enigma of eating disorders: A critical review and synthesis. Clinical Psychology Review 57 (2017), 1--11.",
      "doi": ""
    },
    {
      "text": "Stuart B Murray, B Rieger, S.W. Touyz, and Y De la Garza Garcia. 2010. Muscle Dysmorphia and the DSM-V conundrum: Where does it Belong? A review paper. International Journal of Eating Disorders 43, 483--491 (2010).",
      "doi": ""
    },
    {
      "text": "Stuart B Murray, Elizabeth Rieger, Tom Hildebrandt, Lisa Karlov, Janice Russell, Evelyn Boon, Robert T Dawson, and Stephen W Touyz. 2012. A comparison of eating, exercise, shape, and weight related symptomatology in males with muscle dysmorphia and anorexia nervosa. Body Image 9, 2 (2012), 193--200.",
      "doi": ""
    },
    {
      "text": "Dasha E Nicholls, Richard Lynn, and Russell M Viner. 2018. Childhood eating disorders: British national surveillance study. The British Journal of Psychiatry 198, 4 (2018), 295--301.",
      "doi": ""
    },
    {
      "text": "Jung Sun Oh, Daqing He, Wei Jeng, Eleanor Mattern, and Leanne Bowler. 2013. Linguistic Characteristics of Eating Disorder Questions on Yahoo! Answers - Content, Style, and Emotion. In Proceedings of the 76th ASIS&T Annual Meeting: Beyond the Cloud: Rethinking Information Boundaries (ASIST '13). American Society for Information Science, Silver Springs, MD, USA, 87:1--87:10. ",
      "doi": "10.5555/2655780.2655867"
    },
    {
      "text": "Sungkyu Park, Inyeop Kim, Sang Won Lee, Jaehyun Yoo, Bumseok Jeong, and Meeyoung Cha. 2015. Manifestation of Depression and Loneliness on Social Networks. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15 2 (2015), 557--570.  ",
      "doi": "10.1145/2675133.2675139"
    },
    {
      "text": "Jessica A. Pater, Oliver Haimson, Nazanin Andalibi, and Elizabeth D. Mynatt. 2016. \"Hunger Hurts but Starving Works:\" Characterizing the Presentation of Eating Disorders Online. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco, CA USA, 1185--1200.  ",
      "doi": "10.1145/2818048.2820030"
    },
    {
      "text": "Jessica A. Pater, Elizabeth D. Mynatt, and Elizabeth D Myantt. 2017. Defining Digital Self-Harm. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM Press, 1501--1513.  ",
      "doi": "10.1145/2998181.2998224"
    },
    {
      "text": "Michael J Paul and Mark Drezde. 2011. You are what you Tweet. In Proceedings of ICWSM. 265--272.",
      "doi": ""
    },
    {
      "text": "Marisol Perez, Zachary Voelz, Jeremy W Pettit, and Thomas E. Joiner Jr. 2002. The role of acculturative stress and body dissatisfaction in predicting bulimic symptomatology across ethnic groups. International Journal of Eating Disorders 31, 4 (2002), 442--454.",
      "doi": ""
    },
    {
      "text": "Katherine Phillips. 2009. Understanding Body Dysmorphic Disorder. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Kathleen M Pike and Patricia E Dunne. 2015. The rise of eating disorders in Asia: a review. Journal of Eating Disorders 3, 1 (2015), 1--14.",
      "doi": ""
    },
    {
      "text": "H.G Pope, R Olivardia, A Gruber, and J Borowiecki. 2000. The Adonis Complex: The secret crisis of male body obsession. The Free Press, New York.",
      "doi": ""
    },
    {
      "text": "Pope Jr., Harrison, David Katz, and James I. Hudson. 1993. Anorexia nervosa and \"reverse anorexia\" among 108 male bodybuilders. Comprehensive Psychiatry 34, 6 (1993), 406--409.",
      "doi": ""
    },
    {
      "text": "Rachel Rabkin Peachman. 2015. Bigorexia, the Reverse Anorexia: One Female Bodybuilder Explains That Her Muscle Mass Is Like a \"Body of Armor\". Glamour. https://www.glamour.com/story/bigorexia-muscle-dysmorphia-bodybuilder",
      "doi": ""
    },
    {
      "text": "Kate J Robinson, Victoria A Mountford, David J Sperlinger, Victoria A Mountfor, and David J Sperlinger. 2012. Being men with eaitng disorders: Perspectives of male eating disorder service-users. Journal of Health Psychology 18, 2 (2012), 176--186.",
      "doi": ""
    },
    {
      "text": "Elvis Saravia, Chun-Hao Chang, Renaud Jollet De Lorenzo, and Yi-Shin Chen. 2016. MIDAS: Mental Illness Detection and Analysis via Social Media. In Proceedings of the 2016 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM '16). IEEE Press, Piscataway, NJ, USA, 1418--1421. ",
      "doi": "10.5555/3192424.3192695"
    },
    {
      "text": "Ruth H Striegel-Moore, Francine Rosselli, Nancy Perrin, Lynn DeBar, Terence Wilson, Alexis May, and Helena C Kraemer. 2009. Gender difference in the prevalence of eating disorder symptoms. International Journal of Eating Disorders 42, 5 (2009), 471--474.",
      "doi": ""
    },
    {
      "text": "Andrea H. Tapia and Lynette Kvasny. 2004. Recruitment is Never Enough: Retention of Women and Minorities in the IT Workplace. In Proceedings of the 2004 SIGMIS Conference on Computer Personnel Research: Careers, Culture, and Ethics in a Networked Environment (SIGMIS CPR '04). ACM, New York, NY, USA, 84--91.  ",
      "doi": "10.1145/982372.982392"
    },
    {
      "text": "Eileen M. Trauth, Curtis C. Cain, K.D. Joshi, Lynette Kvasny, and Kayla Booth. 2012. Embracing Intersectionality in Gender and IT Career Choice Research. In Proceedings of the 50th Annual Conference on Computers and People Research (SIGMIS-CPR '12). ACM, New York, NY, USA, 199--212.  ",
      "doi": "10.1145/2214091.2214141"
    },
    {
      "text": "Gerry Veenstra. 2011. Race, gender, class, and sexual orientation: intersecting axes of inequality and self-rated health in Canada. International Journal for Equity in Health 10, 1 (2011), 3.",
      "doi": ""
    },
    {
      "text": "Tao Wang, Markus Brede, Antonella Ianni, and Emmanouil Mentzakis. 2017. Detecting and Characterizing Eating-Disorder Communities on Social Media. In Proceedings of ACM WSDM Conference. ACM, 91--100.  ",
      "doi": "10.1145/3018661.3018706"
    },
    {
      "text": "TE Weltzin, N Weisensel, D Franczyk, K Burnett, C Kiltz, and P Bean. 2005. Eating disorders in men: Update. Journal of Men's Health and Gender 2, 2 (2005), 186--193.",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Arkadeep Kumar, Aditya Vishwanath, Naveena Karusala, Betsy DiSalvo, and Neha Kumar. 2018. Designing for Intersections. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 45--58.  ",
      "doi": "10.1145/3196709.3196794"
    },
    {
      "text": "Chengyuan Zhang. 2014. What can we learn from the history of male anorexia nervosa? Journal of Eating Disorders 2, 1 (2014), 138--142.",
      "doi": ""
    }
  ]
}