{
  "doi": "10.1145/3290605.3300717",
  "title": "Let Me Explain: Impact of Personal and Impersonal Explanations on Trust in Recommender Systems",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Trust in a Recommender System (RS) is crucial for its overall success. However, it remains underexplored whether users trust personal recommendation sources (i.e. other humans) more than impersonal sources (i.e. conventional RS), and, if they do, whether the perceived quality of explanation provided account for the difference. We conducted an empirical study in which we compared these two sources of recommendations and explanations. Human advisors were asked to explain movies they recommended in short texts while the RS created explanations based on item similarity. Our experiment comprised two rounds of recommending. Over both rounds the quality of explanations provided by users was assessed higher than the quality of the system's explanations. Moreover, explanation quality significantly influenced perceived recommendation quality as well as trust in the recommendation source. Consequently, we suggest that RS should provide richer explanations in order to increase their perceived recommendation quality and trustworthiness.",
  "tags": [
    "user study",
    "counterfactual analysis",
    "structural equation modelling",
    "trust",
    "explanations",
    "recommender systems"
  ],
  "authors": [
    {
      "name": "Johannes Kunkel",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/do/10.1145/contrib-99659135899/rel-imgonly/99659135899.jpg",
      "acmid": "99659135899",
      "orcid": "missing"
    },
    {
      "name": "Tim Donkers",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659047551",
      "orcid": "missing"
    },
    {
      "name": "Lisa Michael",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366246",
      "orcid": "missing"
    },
    {
      "name": "Catalin-Mihai Barbu",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490667452",
      "orcid": "missing"
    },
    {
      "name": "Jürgen Ziegler",
      "institution": "University of Duisburg-Essen, Duisburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100445374",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "James Bennett and Stan Lanning. 2007. The netflix prize. In Proceedings of KDD Cup and Workshop (KDDCup '07), Vol. 2007. San Jose, CA, 3--6.",
      "doi": ""
    },
    {
      "text": "Shlomo Berkovsky, Ronnie Taib, and Dan Conway. 2017. How to Recommend?: User Trust Factors in Movie Recommender Systems. In Proceedings of the 22nd International Conference on Intelligent User Interfaces (IUI '17). ACM, New York, NY, 287--300.  ",
      "doi": "10.1145/3025171.3025209"
    },
    {
      "text": "M. Bilgic and Raymond J. Mooney. 2005. Explaining recommendations: satisfaction vs. promotion. In Proceedings of Beyond Personalization Workshop, IUI.",
      "doi": ""
    },
    {
      "text": "André Calero Valdez, Martina Ziefle, and Katrien Verbert. 2016. HCI for Recommender Systems: The Past, the Present and the Future. In Proceedings of the 10th ACM Conference on Recommender Systems (RecSys '16). ACM, New York, NY, 123--126.  ",
      "doi": "10.1145/2959100.2959158"
    },
    {
      "text": "Shuo Chang, F. Maxwell Harper, and Loren Gilbert Terveen. 2016. Crowd-Based Personalized Natural Language Explanations for Recommendations. In Proceedings of the 10th ACM Conference on Recommender Systems (RecSys '16). ACM, New York, NY, 175--182.  ",
      "doi": "10.1145/2959100.2959153"
    },
    {
      "text": "Jaewon Choi, Hong Joo Lee, and Yong Cheol Kim. 2009. The influence of social presence on evaluating personalized recommender systems. In Pacific Asia Conference on Information Systems (PACIS).",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the behavioral sciences (2nd ed.). Erlbaum, Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Vanessa Evers, Satyan Ramlal, Maarten van Someren, Lloyd Rutledge, Natalia Stash, Lora Aroyo, and Bob Wielinga. 2008. The effects of transparency on trust in and acceptance of a content-based art recommender. User Modeling and UserAdapted Interaction 18, 5 (2008), 455--496.  ",
      "doi": "10.1007/s11257-008-9051-3"
    },
    {
      "text": "Tim Donkers, Benedikt Loepp, and Jürgen Ziegler. 2018. Explaining Recommendations by Means of User Reviews. In Proceedings of the 1st Workshop on Explainable Smart Systems (ExSS '18). http://ceur-ws. org/Vol-2068/exss8.pdf",
      "doi": ""
    },
    {
      "text": "A. Felfernig and B. Gula. 2006. An Empirical Study on Consumer Behavior in the Interaction with Knowledge-based Recommender Applications. In The 8th IEEE International Conference on E-Commerce Technology and The 3rd IEEE International Conference on Enterprise Computing, E-Commerce, and E-Services (CEC/EEE '06). 159--169.  ",
      "doi": "10.1109/CEC-EEE.2006.14"
    },
    {
      "text": "David A Freedman. 2006. On The So-Called \"Huber Sandwich Estimator\" and \"Robust Standard Errors\". The American Statistician 60, 4 (2006), 299--302.",
      "doi": ""
    },
    {
      "text": "Fatih Gedikli, Dietmar Jannach, and Mouzhi Ge. 2014. How should I explain? A comparison of different explanation types for recommender systems. International Journal of Human-Computer Studies 72, 4 (2014), 367--382.  ",
      "doi": "10.1016/j.ijhcs.2013.12.007"
    },
    {
      "text": "David Gefen. 1997. Building Users' Trust in Freeware Providers and the Effects of This Trust on Users' Perceptions of Usefulness, Ease of Use and Intended Use of Freeware. Ph.D. Dissertation. Atlanta, GA. ",
      "doi": "10.5555/926017"
    },
    {
      "text": "Carlos A. Gomez-Uribe and Neil Hunt. 2015. The Netflix Recommender System: Algorithms, Business Value, and Innovation. ACM Transactions on Management Information Systems 6, 4 (2015), 13:1--13:19.  ",
      "doi": "10.1145/2843948"
    },
    {
      "text": "Asela Gunawardana and Guy Shani. 2015. Evaluating Recommender Systems. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 265--308.",
      "doi": ""
    },
    {
      "text": "Ido Guy. 2015. Social Recommender Systems. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 511--543.",
      "doi": ""
    },
    {
      "text": "Jonathan L. Herlocker, Joseph A. Konstan, and John Riedl. 2000. Explaining Collaborative Filtering Recommendations. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (CSCW '00). ACM, New York, NY, 241--250.  ",
      "doi": "10.1145/358916.358995"
    },
    {
      "text": "Miguel Angel Hernán. 2004. A definition of causal effect for epidemiological research. Journal of Epidemiology & Community Health 58, 4 (2004), 265--271.",
      "doi": ""
    },
    {
      "text": "Anthony Jameson, Martijn C. Willemsen, Alexander Felfernig, Marco de Gemmis, Pasquale Lops, Giovanni Semeraro, and Li Chen. 2015. Human Decision Making and Recommender Systems. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 611--648.",
      "doi": ""
    },
    {
      "text": "Michael Jugovac and Dietmar Jannach. 2017. Interacting with Recommenders--Overview and Research Directions. ACM Transactions on Interactive Intelligent Systems (TiiS) 7, 3 (2017), 10:1--10:46.  ",
      "doi": "10.1145/3001837"
    },
    {
      "text": "Bart P. Knijnenburg, Martijn C. Willemsen, Zeno Gantner, Hakan Soncu, and Chris Newell. 2012. Explaining the User Experience of Recommender Systems. User Modeling and User-Adapted Interaction 22, 4--5 (Oct. 2012), 441--504.  ",
      "doi": "10.1007/s11257-011-9118-4"
    },
    {
      "text": "Sherrie Y. X. Komiak and Izak Benbasat. 2006. The Effects of Personalizaion and Familiarity on Trust and Adoption of Recommendation Agents. MIS Quarterly 30, 4 (2006), 941--960. ",
      "doi": "10.5555/2017317.2017325"
    },
    {
      "text": "Joseph A. Konstan and John Riedl. 2012. Recommender systems: from algorithms to user experience. User Modeling and UserAdapted Interaction 22, 1--2 (2012), 101--123.  ",
      "doi": "10.1007/s11257-011-9112-x"
    },
    {
      "text": "Yehuda Koren, Robert Bell, and Chris Volinsky. 2009. Matrix Factorization Techniques for Recommender Systems. Computer 42, 8 (2009), 30--37.  ",
      "doi": "10.1109/MC.2009.263"
    },
    {
      "text": "Vinod Krishnan, Pradeep Kumar Narayanashetty, Mukesh Nathan, Richard T. Davies, and Joseph A. Konstan. 2008. Who Predicts Better?: Results from an Online Study Comparing Humans and an Online Recommender System. In Proceedings of the 2008 ACM Conference on Recommender Systems (RecSys '08). ACM, New York, NY, 211--218.  ",
      "doi": "10.1145/1454008.1454042"
    },
    {
      "text": "Johannes Kunkel, Tim Donkers, Catalin-Mihai Barbu, and Jürgen Ziegler. 2018. Trust-Related Effects of Expertise and Similarity Cues in Human-Generated Recommendations. In Companion Proceedings of the 23rd International on Intelligent User Interfaces: 2nd Workshop on Theory-Informed User Modeling for Tailoring and Personalizing Interfaces (HUMANIZE). http://ceur-ws.org/Vol-2068/humanize5.pdf",
      "doi": ""
    },
    {
      "text": "Johannes Kunkel, Benedikt Loepp, and Jürgen Ziegler. 2017. A 3D Item Space Visualization for Presenting and Manipulating User Preferences in Collaborative Filtering. In Proceedings of the 22nd International Conference on Intelligent User Interfaces Companion (IUI '17). ACM, New York, NY, 3--15.  ",
      "doi": "10.1145/3025171.3025189"
    },
    {
      "text": "John D. Lee and Katrina A. See. 2004. Trust in Automation: Designing for Appropriate Reliance. Human Factors 46, 1 (2004), 50--80.",
      "doi": "10.1518/hfes.46.1.50_30392"
    },
    {
      "text": "Benedikt Loepp, Tim Donkers, Timm Kleemann, and Jürgen Ziegler. 2018. Impact of Item Consumption on Assessment of Recommendations in User Studies. In Proceedings of the 12th ACM Conference on Recommender Systems. ACM, New York, NY, 49-53.  ",
      "doi": "10.1145/3240323.3240375"
    },
    {
      "text": "D. Harrison McKnight, Vivek Choudhury, and Charles Kacmar. 2002. Developing and Validating Trust Measures for e-Commerce: An Integrative Typology. Information Systems Research 13, 3 (2002), 334--359.  ",
      "doi": "10.1287/isre.13.3.334.81"
    },
    {
      "text": "D. Harrison McKnight, Larry L. Cummings, and Norman L. Chervany. 1998. Initial Trust Formation in New Organizational Relationships. Academy of Management Review 23, 3 (1998), 473--490.",
      "doi": ""
    },
    {
      "text": "Sean M. McNee, John Riedl, and Joseph A. Konstan. 2006. Being Accurate is Not Enough: How Accuracy Metrics Have Hurt Recommender Systems. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, 1097--1101.  ",
      "doi": "10.1145/1125451.1125659"
    },
    {
      "text": "Bengt Muthén. 1984. A general structural equation model with dichotomous, ordered categorical, and continuous latent variable indicators. Psychometrika 49, 1 (1984), 115--132.",
      "doi": ""
    },
    {
      "text": "Umberto Panniello, Michele Gorgoglione, and Alexander Tuzhilin. 2015. Research Note-In CARSs We Trust: How Context-Aware Recommendations Affect Customers' Trust and Other Business Performance Measures of Recommender Systems. Information Systems Research 27, 1 (2015), 182--196.",
      "doi": ""
    },
    {
      "text": "Judea Pearl. 2012. The Mediation Formula: A Guide to the Assessment of Causal Pathways in Nonlinear Models. Causality: Statistical Perspectives and Applications (2012), 151--179.",
      "doi": ""
    },
    {
      "text": "Pearl Pu and Li Chen. 2007. Trust-inspiring explanation interfaces for recommender systems. Knowledge-Based Systems 20, 6 (2007), 542--556.  ",
      "doi": "10.1016/j.knosys.2007.04.004"
    },
    {
      "text": "Pearl Pu, Li Chen, and Rong Hu. 2012. Evaluating recommender systems from the user's perspective: survey of the state of the art. User Modeling and User-Adapted Interaction 22, 4--5 (2012), 317--355.  ",
      "doi": "10.1007/s11257-011-9115-7"
    },
    {
      "text": "Francesco Ricci, Lior Rokach, and Bracha Shapira. 2015. Recommender Systems: Introduction and Challenges. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 1--34.",
      "doi": ""
    },
    {
      "text": "Yves Rosseel. 2012. lavaan: An R Package for Structural Equation Modeling. Journal of Statistical Software 48, 2 (2012), 1--36. http: //www.jstatsoft.org/v48/i02/",
      "doi": ""
    },
    {
      "text": "Donald B Rubin. 1990. Formal mode of statistical inference for causal effects. Journal of statistical planning and inference 25, 3 (1990), 279--292.",
      "doi": ""
    },
    {
      "text": "Sylvain Senecal and Jacques Nantel. 2004. The influence of online product recommendations on consumers' online choices. Journal of Retailing 80, 2 (2004), 159--169.",
      "doi": ""
    },
    {
      "text": "Rashmi Sinha and Kirsten Swearingen. 2002. The Role of Transparency in Recommender Systems. In Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, 830--831.  ",
      "doi": "10.1145/506443.506619"
    },
    {
      "text": "B. Smith and G. Linden. 2017. Two Decades of Recommender Systems at Amazon.com. Internet Computing, IEEE 21, 3 (2017), 12--18.  ",
      "doi": "10.1109/MIC.2017.72"
    },
    {
      "text": "Donnavieve Smith, Satya Menon, and K. Sivakumar. 2005. Online peer and editorial recommendations, trust, and choice in virtual markets. Journal of Interactive Marketing 19, 3 (2005), 15--37.",
      "doi": ""
    },
    {
      "text": "Nava Tintarev and Judith Masthoff. 2012. Evaluating the effectiveness of explanations for recommender systems. User Modeling and UserAdapted Interaction 22, 4 (2012), 399--439.  ",
      "doi": "10.1007/s11257-011-9117-5"
    },
    {
      "text": "Nava Tintarev and Judith Masthoff. 2015. Explaining Recommendations: Design and Evaluation. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, and Bracha Shapira (Eds.). Springer US, Boston, MA, 353--382.",
      "doi": ""
    },
    {
      "text": "Patricia Victor, Martine de Cock, and Chris Cornelis. 2011. Trust and Recommendations. In Recommender Systems Handbook, Francesco Ricci, Lior Rokach, Bracha Shapira, and Paul B. Kantor (Eds.). Springer US, Boston, MA, 645--675.",
      "doi": ""
    },
    {
      "text": "J Christopher Westland. 2010. Lower bounds on sample size in structural equation modeling. Electronic Commerce Research and Applications 9, 6 (2010), 476--487.  ",
      "doi": "10.1016/j.elerap.2010.07.003"
    },
    {
      "text": "Sherrie Xiao and Izak Benbasat. 2003. The Formation of Trust and Distrust in Recommendation Agents in Repeated Interactions: A Processtracing Analysis. In Proceedings of the 5th International Conference on Electronic Commerce (ICEC '03). ACM, New York, NY, 287--293.  ",
      "doi": "10.1145/948005.948043"
    },
    {
      "text": "Jingjing Zhang and Shawn P. Curley. 2018. Exploring Explanation Effects on Consumers' Trust in Online Recommender Agents. International Journal of Human--Computer Interaction 34, 5 (2018), 421--432.",
      "doi": ""
    }
  ]
}