{
  "doi": "10.1145/3290605.3300529",
  "title": "Just Give Me What I Want: How People Use and Evaluate Music Search",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Music-streaming platforms offer users a large amount of content for consumption. Finding the right music can be challenging and users often need to search through extensive catalogs provided by these platforms. Prior research has focused on general-domain web search, which is designed to meet a broad range of user goals. Here, we study search in the domain of music, seeking to understand how and why people use search and how they evaluate their search experiences on a music-streaming platform. Over two studies, we conducted semi-structured interviews with 27 participants, asking about their search habits and preferences, and observing their behavior while searching for music. Analysis revealed participants evaluated their search experiences along two dimensions: success and effort. Importantly, how participants perceived success and effort differed by their mindset, or the way they assessed the results of their query. We conclude with recommendations to improve the user experience of music search.",
  "authors": [
    {
      "name": "Christine Hosey",
      "institution": "Spotify, Somerville, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659280673",
      "orcid": "missing"
    },
    {
      "name": "Lara Vujović",
      "institution": "TripAdvisor, Needham, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658699502",
      "orcid": "missing"
    },
    {
      "name": "Brian St. Thomas",
      "institution": "Spotify, Somerville, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659281439",
      "orcid": "missing"
    },
    {
      "name": "Jean Garcia-Gathright",
      "institution": "Spotify, Somerville, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658713032",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Thom",
      "institution": "Spotify, Somerville, MA, USA",
      "img": "/do/10.1145/contrib-81100334243/rel-imgonly/jenn_badge__2_.jpeg",
      "acmid": "81100334243",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azzah Al-Maskari and Mark Sanderson. 2010. A review of factors influencing user satisfaction in information retrieval. Journal of the American Society for Information Science and Technology 61, 5 (2010), 859--868. ",
      "doi": "10.5555/1814508.1814521"
    },
    {
      "text": "David Bainbridge, Sally J. Cunningham, and Stephen J. Downie. 2003. How People Describe Their Music Information Needs: A Grounded Theory Analysis of Music Queries. In Proceedings of the 4th International Conference on Music Information Retrieval (ISMIR '03). Baltimore, Maryland, USA.",
      "doi": ""
    },
    {
      "text": "Timothy Beamish, Karon Maclean, and Sidney Fels. 2004. Manipulating Music: Multimodal Interaction for DJs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 327--334.  ",
      "doi": "10.1145/985692.985734"
    },
    {
      "text": "Frank Bentley, Crysta J. Metcalf, and Gunnar Harboe. 2006. Personal vs. commercial content: the similarities between consumer use of photos and music. In Proceedings of the 2006 Conference on Human Factors in Computing Systems (CHI '06). ACM, NY, New York, USA, 667--676.  ",
      "doi": "10.1145/1124772.1124871"
    },
    {
      "text": "Jiang Bian and Yi Chang. 2011. A taxonomy of local search: semisupervised query classification driven by information needs. In Proceedings of the 20th ACM Conference on Information and Knowledge Management (CIKM '11). ACM, New York, NY, USA, 2425--2428.  ",
      "doi": "10.1145/2063576.2063983"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Andrei Broder. 2002. A Taxonomy of Web Search. SIGIR Forum 36, 2 (Sept. 2002), 3--10.  ",
      "doi": "10.1145/792550.792552"
    },
    {
      "text": "Barry Brown, Abigail J. Sellen, and Erik Geelhoed. 2001. Music Sharing As a Computer Supported Collaborative Application. In Proceedings of the Seventh Conference on European Conference on Computer Supported Cooperative Work (ECSCW'01). Kluwer Academic Publishers, Norwell, MA, USA, 179--198. http://dl.acm.org/citation.cfm?id= 1241867.1241877 ",
      "doi": "10.5555/1241867.1241877"
    },
    {
      "text": "Òscar Celma. 2010. Music Recommendation and Discovery - The Long Tail, Long Fail, and Long Play in the Digital Music Space. SpringerVerlag, Berlin, Heidelberg. ",
      "doi": "10.5555/1869931"
    },
    {
      "text": "Alan Chamberlain and Andy Crabtree. 2016. Searching for music: understanding the discovery, acquisition, processing and organization of music in a domestic setting for design. Personal and Ubiquitous Computing 20, 4 (Aug. 2016), 559--571.  ",
      "doi": "10.1007/s00779-016-0911-2"
    },
    {
      "text": "Mara Cole, Junyang Liu, Nicholas J. Belkin, Ralf Bierig, Jacek Gwizdka, Chun-Bo Liu, Jin Zhang, and Xiao-Ming Zhang. 2009. Usefulness as the Criterion for Evaluation of Interactive Information Retrieval. In Proceedings of the Third Workshop on Human Computer Interaction and Information Retrieval (HCIR '09). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Jean Garcia-Gathright, Brian St. Thomas, Christine Hosey, Zahra Nazari, and Fernando Diaz. 2018. Understanding and Evaluating User Satisfaction with Music Discovery. In The 41st International ACM SIGIR Conference on Research & Development in Information Retrieval (SIGIR '18). ACM, New York, NY, USA, 55--64.  ",
      "doi": "10.1145/3209978.3210049"
    },
    {
      "text": "Barney G. Glaser and Anselm L. Strauss. 1967. The Discovery of Grounded Theory : Strategies for Qualitative Research. Aldine, Chicago, IL, USA.",
      "doi": ""
    },
    {
      "text": "David J. Hargreaves and Adrian C. North. 1999. The Functions of Music in Everyday Life: Redefining the Social in Music Psychology. Psychology of Music 27, 1 (April 1999), 71--83.",
      "doi": ""
    },
    {
      "text": "Ahmed Hassan, Rosie Jones, and Kristina Lisa Klinkner. 2010. Beyond DCG: User Behavior As a Predictor of a Successful Search. In Proceedings of the Third ACM International Conference on Web Search and Data Mining (WSDM '10). ACM, New York, NY, USA, 221--230.  ",
      "doi": "10.1145/1718487.1718515"
    },
    {
      "text": "Xiao Hu and Jingjing Liu. 2010. Evaluation of Music Information Retrieval: Towards a User-Centered Approach. In Proceedings of the Fourth Workshop on Human Computer Interaction and Information Retrieval (HCIR '10). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Peter Ingwersen. 2012. Interactive Information Seeking, Behaviour and Retrieval. Edited by Ian Ruthven and Diane Kelly. Journal of the American Society for Information Science and Technology 63, 10 (Oct. 2012), 2122--2125.  ",
      "doi": "10.1002/asi.22718"
    },
    {
      "text": "Steve Jones, Sally J. Cunningham, and Matt Jones. 2004. Organizing digital music for use: an examination of personal music collections. In Proceedings of the 5th International Conference on Music Information Retrieval (ISMIR '04). Barcelona, Spain.",
      "doi": ""
    },
    {
      "text": "Simon Katan, Mick Grierson, and Rebecca Fiebrink. 2015. Using Interactive Machine Learning to Support Interface Development Through Workshops with Disabled People. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 251--254.  ",
      "doi": "10.1145/2702123.2702474"
    },
    {
      "text": "Lianne Kerlin, Jasmine Cox, Stephen Jolly, Michael Evans, George Green, and David Regan. 2016. Pressing Not Tapping: Comparing a Physical Button with a Smartphone App for Tagging Music in Radio Programmes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5874--5884.  ",
      "doi": "10.1145/2858036.2858325"
    },
    {
      "text": "David S. Kirk and Abigail Sellen. 2010. On Human Remains: Values and Practice in the Home Archiving of Cherished Objects. ACM Transactions on Computer-Human Interaction 17, 3 (2010), 10:1--10:43.  ",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Amanda E. Krause, Adrian C. North, and Lauren Y. Hewitt. 2015. Musiclistening in everyday life: Devices and choice. Psychology of Music 43, 2 (March 2015), 155--170.",
      "doi": ""
    },
    {
      "text": "Amanda E. Krause, Adrian C. North, and Lauren Y. Hewitt. 2016. The role of location in everyday experiences of music. Psychology of Popular Media Culture 5, 3 (2016), 232--257.",
      "doi": ""
    },
    {
      "text": "Bill Kules, Robert Capra, Matthew Banta, and Tito Sierra. 2009. What do exploratory searchers look at in a faceted search interface?. In Proceedings of the 2009 Joint International Conference on Digital Libraries (JCDL '09). ACM Press, Austin, TX, USA, 313--322.  ",
      "doi": "10.1145/1555400.1555452"
    },
    {
      "text": "Jin Ha Lee. 2010. Analysis of user needs and information features in natural language queries seeking music information. Journal of the American Society for Information Science and Technology 61, 5 (May 2010), 1025--1045. ",
      "doi": "10.5555/1814508.1814523"
    },
    {
      "text": "Tuck W. Leong and Peter C. Wright. 2013. Revisiting Social Practices Surrounding Music. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 951--960.  ",
      "doi": "10.1145/2470654.2466122"
    },
    {
      "text": "Donald McMillan, Barry Brown, Abigail Sellen, Siân Lindley, and Roy Martens. 2015. Pick Up and Play: Understanding Tangibility for Cloud Media. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM '15). ACM, New York, NY, USA, 1--13.  ",
      "doi": "10.1145/2836041.2836042"
    },
    {
      "text": "Adrian C. North, David J. Hargreaves, and Jon J. Hargreaves. 2004. Uses of music in everyday life. Music Perception 22, 1 (2004), 41--77.",
      "doi": ""
    },
    {
      "text": "Adrian. C. North, David J. Hargreaves, and Susan A. O'Neill. 2000. The importance of music to adolescents. The British Journal of Educational Psychology 70 ( Pt 2) (June 2000), 255--272.",
      "doi": ""
    },
    {
      "text": "Daan Odijk, Ryen W. White, Ahmed Hassan Awadallah, and Susan T. Dumais. 2015. Struggling and Success in Web Search. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management (CIKM '15). ACM, New York, NY, USA, 1551--1560.  ",
      "doi": "10.1145/2806416.2806488"
    },
    {
      "text": "Kenton O'Hara and Barry Brown. 2005. Consuming Music Together. Springer-Verlag, Berlin, Heidelberg. ",
      "doi": "10.5555/1077095"
    },
    {
      "text": "Steffen Pauws and Berry Eggen. 2003. Realization and User Evaluation of an Automatic Playlist Generator. Journal of New Music Research 32, 2 (2003), 179--192.",
      "doi": ""
    },
    {
      "text": "Steffen Pauws and Sander van de Wijdeven. 2005. User Evaluation of a New Interactive Playlist Generation Concept. In Proceedings of the 6th International Conference on Music Information Retrieval (ISMIR '15). London, UK, 638--643.",
      "doi": ""
    },
    {
      "text": "Daniel E. Rose and Danny Levinson. 2004. Understanding User Goals in Web Search. In Proceedings of the 13th International Conference on World Wide Web (WWW '04). ACM, New York, NY, USA, 13--19.  ",
      "doi": "10.1145/988672.988675"
    },
    {
      "text": "Robin Sease and David W. McDonald. 2011. The Organization of Home Media. ACM Transactions on Computer-Human Interaction 18, 2 (July 2011), 9:1--9:20.  ",
      "doi": "10.1145/1970378.1970383"
    },
    {
      "text": "Georg Singer, Ulrich Norbisrath, and Dirk Lewandowski. 2012. Ordinary search engine users assessing difficulty, effort, and outcome for simple and complex search tasks. In Proceedings of the 4th Information Interaction in Context Symposium on - IIIX '12. ACM Press, Nijmegen, The Netherlands, 110--119.  ",
      "doi": "10.1145/2362724.2362746"
    },
    {
      "text": "John Sloboda. 2004. Everyday Uses of Music Listening: A Preliminary Study. In Exploring the Musical Mind. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "John A. Sloboda, Susan A. O'Neill, and Antonia Ivaldi. 2001. Functions of Music in Everyday Life: An Exploratory Study Using the Experience Sampling Method. Musicae Scientiae 5, 1 (March 2001), 9--32.",
      "doi": ""
    },
    {
      "text": "Amanda Spink. 2002. A user-centered approach to evaluating human interaction with Web search engines: an exploratory study. Information Processing & Management 38, 3 (May 2002), 401--426.  ",
      "doi": "10.1016/S0306-4573%2801%2900036-X"
    },
    {
      "text": "Ning Su, Jiyin He, Yiqun Liu, Min Zhang, and Shaoping Ma. 2018. User Intent, Behaviour, and Perceived Satisfaction in Product Search. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM '18). ACM, New York, NY, USA, 547--555.  ",
      "doi": "10.1145/3159652.3159714"
    },
    {
      "text": "Atau Tanaka and Adam Parkinson. 2016. Haptic Wave: A Cross-Modal Interface for Visually Impaired Audio Producers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2150--2161.  ",
      "doi": "10.1145/2858036.2858304"
    },
    {
      "text": "Mark Tarrant, Adrian C. North, and David J. Hargreaves. 2000. English and American Adolescents' Reasons for Listening to Music. Psychology of Music 28, 2 (Oct. 2000), 166--173.",
      "doi": ""
    },
    {
      "text": "Fabio Vignoli. 2004. Digital Music Interaction Concepts: A User Study. In Proceedings of the 5th International Conference on Music Information Retrieval (ISMIR '04). Barcelona, Spain. http://ismir2004.ismir.net/ proceedings/p075-page-415-paper152.pdf",
      "doi": ""
    },
    {
      "text": "Amy Voida, Rebecca E. Grinter, Nicolas Ducheneaut, W. Keith Edwards, and Mark W. Newman. 2005. Listening in: Practices Surrounding iTunes Music Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 191--200.  ",
      "doi": "10.1145/1054972.1054999"
    },
    {
      "text": "Sergey Volokhin and Eugene Agichtein. 2018. Understanding Music Listening Intents During Daily Activities with Implications for Contextual Music Recommendation. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval (CHIIR '18). ACM, New York, NY, USA, 313--316.  ",
      "doi": "10.1145/3176349.3176885"
    },
    {
      "text": "Xiaohui Xie, Yiqun Liu, Maarten de Rijke, Jiyin He, Min Zhang, and Shaoping Ma. 2018. Why People Search for Images Using Web Search Engines. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM '18). ACM, New York, NY, USA, 655--663.  ",
      "doi": "10.1145/3159652.3159686"
    },
    {
      "text": "Emine Yilmaz, Manisha Verma, Nick Craswell, Filip Radlinksi, and Peter Bailey. 2014. Relevance and Effort: An Analysis of Document Utility. In Proceedings of the 23rd ACM International Conference on Information and Knowledge Management (CIKM '14). ACM, New York, NY, USA, 91--100. https://dl.acm.org/citation.cfm?id=2661953  ",
      "doi": "10.1145/2661829.2661953"
    }
  ]
}