{
  "doi": "10.1145/3290605.3300919",
  "title": "Estimating Touch Force with Barometric Pressure Sensors",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2019,
  "badges": [],
  "abstract": "Finger pressure offers a new dimension for touch interaction, where input is defined by its spatial position and orthogonal force. However, the limited availability and complexity of integrated force-sensing hardware in mobile devices is a barrier to exploring this design space. This paper presents a synthesis of two features in recent mobile devices - a barometric sensor (pressure altimeter) and ingress protection - to sense a user's touch force. When a user applies force to a device's display, it flexes inward and causes an increase in atmospheric pressure within the sealed chassis. This increase in pressure can be sensed by the device's internal barometer. However, this change is uncontrolled and requires a calibration model to map atmospheric pressure to touch force. This paper derives such a model and demonstrates its viability on four commercially-available devices (including two with dedicated force sensors). The results show this method is sensitive to forces of less than 1 N, and is comparable to dedicated force sensors.",
  "authors": [
    {
      "name": "Philip Quinn",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351595064",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Toshiyuki Ando, Yuki Kubo, Buntarou Shizuki, and Shin Takahashi. 2017. CanalSense: Face-Related Movement Recognition System Based on Sensing Air Pressure in Ear Canals. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, 679--689.  ",
      "doi": "10.1145/3126594.3126649"
    },
    {
      "text": "Axel Antoine, Sylvain Malacria, and Géry Casiez. 2017. ForceEdge: Controlling Autoscroll on Both Desktop and Mobile Computers Using the Force. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, 3281--3292.  ",
      "doi": "10.1145/3025453.3025605"
    },
    {
      "text": "Mathias Baglioni, Sylvain Malacria, Eric Lecolinet, and Yves Guiard. 2011. Flick-and-Brake: Finger Control over Inertial/Sustained Scroll Motion. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, 2281--2286.  ",
      "doi": "10.1145/1979742.1979853"
    },
    {
      "text": "Mário N. Berberan-Santos, Evgeny N. Bodunov, and Lionello Pogliani. 1997. On the barometric formula. American Journal of Physics 65, 5 (1997), 404--412.",
      "doi": ""
    },
    {
      "text": "Stephen A. Brewster and Michael Hughes. 2009. Pressure-based Text Entry for Mobile Devices. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, Article 9, 4 pages.  ",
      "doi": "10.1145/1613858.1613870"
    },
    {
      "text": "William Buxton, Ralph Hill, and Peter Rowley. 1985. Issues and Techniques in Touch-sensitive Tablet Input. In Proceedings of the 12th annual conference on Computer graphics and interactive techniques (SIGGRAPH '85). ACM, New York, NY, 215--224.  ",
      "doi": "10.1145/325334.325239"
    },
    {
      "text": "Ron Darby and Raj P. Chhabra. 2017. Chemical Engineering Fluid Mechanics (3rd ed.). CRC Press, Boca Raton, FL.",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Jacob Wobbrock, and Shwetak Patel. 2012. GripSense: Using Built-in Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, 545--554.  ",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Seongkook Heo and Geehyuk Lee. 2011. ForceTap: Extending the Input Vocabulary of Mobile Touch Screens by Adding Tap Gestures. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, 113--122.  ",
      "doi": "10.1145/2037373.2037393"
    },
    {
      "text": "Christopher F. Herot and Guy Weinzapfel. 1978. One-point Touch Input of Vector Information for Computer Displays. In Proceedings of the 5th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '78). ACM, New York, NY, 210--216.  ",
      "doi": "10.1145/800248.807392"
    },
    {
      "text": "Ken Hinckley and Hyunyoung Song. 2011. Sensor Synaesthesia: Touch in Motion, and Motion in Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Min-Chieh Hsiu, Chiuan Wang, Da-Yuan Huang, Jhe-Wei Lin, Yu-Chih Lin, De-Nian Yang, Yi-ping Hung, and Mike Chen. 2016. Nail+: Sensing Fingernail Deformation to Detect Finger Force Touch Interactions on Rigid Surfaces. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, 1--6.  ",
      "doi": "10.1145/2935334.2935362"
    },
    {
      "text": "Sungjae Hwang, Andrea Bianchi, and Kwang-yun Wohn. 2013. VibPress: Estimating Pressure Input Using Vibration Absorption on Mobile Devices. In Proceedings of the 15th International Conference on Humancomputer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, 31--34.  ",
      "doi": "10.1145/2493190.2493193"
    },
    {
      "text": "Kyoungchul Kong and Masayoshi Tomizuka. 2009. A Gait Monitoring System Based on Air Pressure Sensors Embedded in a Shoe. IEEE/ASME Transactions on Mechatronics 14, 3 (2009), 358--370.",
      "doi": ""
    },
    {
      "text": "Takashi Miyaki and Jun Rekimoto. 2009. GraspZoom: Zooming and Scrolling Control Model for Single-handed Mobile Interaction. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '09). ACM, New York, NY, Article 11, 4 pages.  ",
      "doi": "10.1145/1613858.1613872"
    },
    {
      "text": "Esben Warming Pedersen and Kasper Hornbæk. 2014. Expressive Touch: Studying Tapping Force on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, 421--430.  ",
      "doi": "10.1145/2556288.2557019"
    },
    {
      "text": "Gonzalo Ramos, Matthew Boulos, and Ravin Balakrishnan. 2004. Pressure Widgets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, 487--494.  ",
      "doi": "10.1145/985692.985754"
    },
    {
      "text": "Gonzalo A. Ramos and Ravin Balakrishnan. 2007. Pressure Marks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, 1375--1384.  ",
      "doi": "10.1145/1240624.1240834"
    },
    {
      "text": "Jun Rekimoto and Carsten Schwesig. 2006. PreSenseII: Bi-directional Touch and Pressure Sensing Interactions with Tactile Feedback. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, 1253--1258.  ",
      "doi": "10.1145/1125451.1125685"
    },
    {
      "text": "Christian Rendl, Patrick Greindl, Kathrin Probst, Martin Behrens, and Michael Haller. 2014. Presstures: Exploring Pressure-sensitive Multitouch Gestures on Trackpads. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, 431--434.  ",
      "doi": "10.1145/2556288.2557146"
    },
    {
      "text": "Ilya Rosenberg and Ken Perlin. 2009. The UnMousePad: An Interpolating Multi-touch Force-sensing Input Pad. ACM Transactions on Graphics 28, 3, Article 65 (2009), 9 pages.  ",
      "doi": "10.1145/1531326.1531371"
    },
    {
      "text": "David A. Soss. 2007. Advances in Force-Based Touch Panels. Information Display 23, 12 (2007), 20--24.",
      "doi": ""
    },
    {
      "text": "Kenji Suzuki, Ryuuki Sakamoto, Daisuke Sakamoto, and Tetsuo Ono. 2018. Pressure-sensitive Zooming-out Interfaces for One-handed Mobile Interaction. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, New York, NY, Article 30, 8 pages.  ",
      "doi": "10.1145/3229434.3229446"
    },
    {
      "text": "Faisal Taher, Jason Alexander, John Hardy, and Eduardo Velloso. 2014. An Empirical Characterization of Touch-Gesture Input-Force on Mobile Devices. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, 195--204.  ",
      "doi": "10.1145/2669485.2669515"
    },
    {
      "text": "Ryosuke Takada, Wei Lin, Toshiyuki Ando, Buntarou Shizuki, and Shin Takahashi. 2017. A Technique for Touch Force Sensing Using a Waterproof Device's Built-in Barometer. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, 2140--2146.  ",
      "doi": "10.1145/3027063.3053130"
    },
    {
      "text": "James N. Tilton. 1997. Fluid and Particle Dynamics. In Perry's Chemical Engineering Handbook (7th ed.), Robert H. Perry, Don W. Green, and James O. Maloney (Eds.). McGraw-Hill, New York, NY, Chapter 6.",
      "doi": ""
    },
    {
      "text": "Geoff Walker. 2012. A review of technologies for sensing contact location on the surface of a display. Journal of the Society for Information Display 20, 8 (2012), 413--440.",
      "doi": ""
    },
    {
      "text": "Geoff Walker and Mark Fihn. 2010. LCD In-Cell Touch. Information Display 26, 3 (2010), 8--14.",
      "doi": ""
    },
    {
      "text": "Yoichi Watanabe, Yasutoshi Makino, Katsunari Sato, and Takashi Maeno. 2012. Contact Force and Finger Angles Estimation for Touch Panel by Detecting Transmitted Light on Fingernail. In Haptics: Perception, Devices, Mobility, and Communication, Poika Isokoski and Jukka Springare (Eds.). Springer, Berlin/Heidelberg, 601--612.  ",
      "doi": "10.1007/978-3-642-31401-8_53"
    },
    {
      "text": "Graham Wilson, Craig Stewart, and Stephen A. Brewster. 2010. Pressure-based Menu Selection for Mobile Devices. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, 181--190.  ",
      "doi": "10.1145/1851600.1851631"
    },
    {
      "text": "S. I. Yaniger. 1991. Force Sensing Resistors: A Review Of The Technology. In Electro International. 666--668.",
      "doi": ""
    },
    {
      "text": "Jibin Yin, Xiangshi Ren, and Shumin Zhai. 2010. Pen pressure control in trajectory-based interaction. Behaviour & Information Technology 29, 2 (2010), 137--148.  ",
      "doi": "10.1080/01449290902904733"
    }
  ]
}