{
  "doi": "10.1145/3290605.3300430",
  "title": "Typing on Split Keyboards with Peripheral Vision",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Split keyboards are widely used on hand-held touchscreen devices (e.g., tablets). However, typing on a split keyboard often requires eye movement and attention switching between two halves of the keyboard, which slows users down and increases fatigue. We explore peripheral typing, a superior typing mode in which a user focuses her visual attention on the output text and keeps the split keyboard in peripheral vision. Our investigation showed that peripheral typing reduced attention switching, enhanced user experience and increased overall performance (27 WPM, 28% faster) over the typical eyes-on typing mode. This typing mode can be well supported by accounting the typing behavior in statistical decoding. Based on our study results, we have designed GlanceType, a text entry system that supported both peripheral and eyes-on typing modes for real typing scenario. Our evaluation showed that peripheral typing not only well co-existed with the existing eyes-on typing, but also substantially improved the text entry performance. Overall, peripheral typing is a promising typing mode and supporting it would significantly improve the text entry performance on a split keyboard.",
  "authors": [
    {
      "name": "Yiqin Lu",
      "institution": "Tsinghua University & Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659185650",
      "orcid": "missing"
    },
    {
      "name": "Chun Yu",
      "institution": "Tsinghua University & Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467660483",
      "orcid": "0000-0003-2591-7993"
    },
    {
      "name": "Shuyi Fan",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366402",
      "orcid": "missing"
    },
    {
      "name": "Xiaojun Bi",
      "institution": "Stony Brook University, Stony Brook, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485662",
      "orcid": "0000-0002-9716-7709"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Tsinghua University & Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "2011. The Open American National Corpus (OANC). Website. http: //www.anc.org/",
      "doi": ""
    },
    {
      "text": "Layla El Asri, Hannes Schulz, Shikhar Sharma, Jeremie Zumer, Justin Harris, Emery Fine, Rahul Mehrotra, and Kaheer Suleman. 2017. Frames: A Corpus for Adding Memory to Goal-Oriented Dialogue Systems. CoRR abs/1704.00057 (2017). http://arxiv.org/abs/1704.00057 Typing on Split Keyboards with Peripheral Vision CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Diferent Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 251-- 260.  ",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Joseph Besharse and Dean Bok. 2011. The Retina and its Disorders. Academic Press,.",
      "doi": ""
    },
    {
      "text": "Xiaojun Bi, Ciprian Chelba, Tom Ouyang, Kurt Partridge, and Shumin Zhai. 2012. Bimanual Gesture Keyboard. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 137--146.  ",
      "doi": "10.1145/2380116.2380136"
    },
    {
      "text": "J. Clawson, K. Lyons, T. Starner, and E. Clarkson. 2005. The impacts of limited visual feedback on mobile text entry for the Twiddler and mini-QWERTY keyboards. In Ninth IEEE International Symposium on Wearable Computers (ISWC'05). 170--177.  ",
      "doi": "10.1109/ISWC.2005.49"
    },
    {
      "text": "Gislin Dagnelie. 2011. Visual prosthetics: Physiology, bioengineering, rehabilitation. Springer (2011). https://link.springer.com/book/10. 1007/978--1--4419-0754--7",
      "doi": ""
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How We Type: Movement Strategies and Performance in Everyday Typing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4262--4273.  ",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Leah Findlater, Jacob O. Wobbrock, and Daniel Wigdor. 2011. Typing on Flat Glass: Examining Ten-fnger Expert Typing Patterns on Touch Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2453--2462.  ",
      "doi": "10.1145/1978942.1979301"
    },
    {
      "text": "Jérémie Gilliot, Géry Casiez, and Nicolas Roussel. 2014. Impact of Form Factors and Input Conditions on Absolute Indirect-touch Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 723--732.  ",
      "doi": "10.1145/2556288.2556997"
    },
    {
      "text": "Mayank Goel, Leah Findlater, and Jacob Wobbrock. 2012. WalkType: Using Accelerometer Data to Accomodate Situational Impairments in Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2687--2696.  ",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Mayank Goel, Alex Jansen, Travis Mandel, Shwetak N. Patel, and Jacob O. Wobbrock. 2013. ContextType: Using Hand Posture Information to Improve Mobile Touch Screen Text Entry. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2795--2798.  ",
      "doi": "10.1145/2470654.2481386"
    },
    {
      "text": "Joshua Goodman, Gina Venolia, Keith Steury, and Chauncey Parker. 2002. Language Modeling for Soft Keyboards. In Proceedings of the 7th International Conference on Intelligent User Interfaces (IUI '02). ACM, New York, NY, USA, 194--195.  ",
      "doi": "10.1145/502716.502753"
    },
    {
      "text": "Carl Gutwin, Andy Cockburn, and Ashley Coveney. 2017. Peripheral Popout: The Infuence of Visual Angle and Stimulus Intensity on Popout Efects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 208--219.  ",
      "doi": "10.1145/3025453.3025984"
    },
    {
      "text": "Amy K. Karlson and Benjamin B. Bederson. 2007. ThumbSpace: Generalized One-Handed Input for Touchscreen-Based Mobile Devices. Springer Berlin Heidelberg, Berlin, Heidelberg, 324--338.",
      "doi": ""
    },
    {
      "text": "Kenrick Kin, Björn Hartmann, and Maneesh Agrawala. 2011. Twohanded Marking Menus for Multitouch Devices. ACM Trans. Comput.Hum. Interact. 18, 3, Article 16 (Aug. 2011), 23 pages.  ",
      "doi": "10.1145/1993060.1993066"
    },
    {
      "text": "Frank Chun Yat Li, Richard T. Guy, Koji Yatani, and Khai N. Truong. 2011. The 1Line Keyboard: A QWERTY Layout in a Single Line. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 461--470.  ",
      "doi": "10.1145/2047196.2047257"
    },
    {
      "text": "Yiqin Lu, Chun Yu, Xin Yi, Yuanchun Shi, and Shengdong Zhao. 2017. BlindType: Eyes-Free Text Entry on Handheld Touchpad by Leveraging Thumb's Muscle Memory. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 18 (June 2017), 24 pages.  ",
      "doi": "10.1145/3090083"
    },
    {
      "text": "Kris Luyten, Donald Degraen, Gustavo Rovelo Ruiz, Sven Coppers, and Davy Vanacken. 2016. Hidden in Plain Sight: An Exploration of a Visual Language for Near-Eye Out-of-Focus Displays in the Peripheral View. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 487--497.  ",
      "doi": "10.1145/2858036.2858339"
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoref. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 754--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Hugo Nicolau and Joaquim Jorge. 2012. Touch Typing Using Thumbs: Understanding the Efect of Mobility and Hand Posture. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2683--2686.  ",
      "doi": "10.1145/2207676.2208661"
    },
    {
      "text": "Hugo Nicolau, Kyle Montague, Tiago Guerreiro, André Rodrigues, and Vicki L. Hanson. 2015. Typing Performance of Blind Users: An Analysis of Touch Behaviors, Learning Efect, and In-Situ Usage. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 273--280.  ",
      "doi": "10.1145/2700648.2809861"
    },
    {
      "text": "Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen, and Per Ola Kristensson. 2013. Improving Two-thumb Text Entry on Touchscreen Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2765--2774.  ",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Shyam Reyal, Shumin Zhai, and Per Ola Kristensson. 2015. Performance and User Experience of Touchscreen and Gesture Keyboards in a Lab Setting and in the Wild. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 679--688.  ",
      "doi": "10.1145/2702123.2702597"
    },
    {
      "text": "Oliver Schoenleben and Antti Oulasvirta. 2013. Sandwich Keyboard: Fast Ten-fnger Typing on a Mobile Device with Adaptive Touch Sensing on the Back Side. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 175--178.  ",
      "doi": "10.1145/2493190.2493233"
    },
    {
      "text": "James Scott, Shahram Izadi, Leila Sadat Rezai, Dominika Ruszkowski, Xiaojun Bi, and Ravin Balakrishnan. 2010. RearType: Text Entry Using Keys on the Back of a Device. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 171--180.  ",
      "doi": "10.1145/1851600.1851630"
    },
    {
      "text": "Miika Silfverberg. 2003. Using Mobile Keypads with Limited Visual Feedback: Implications to Handheld and Wearable Devices. Springer Berlin Heidelberg, Berlin, Heidelberg, 76--90.",
      "doi": ""
    },
    {
      "text": "Hans Strasburger, Ingo Rentschler, and Martin Jüttner. 2011. Peripheral vision and pattern recognition: a review. J Vis. 11, 5 (2011), 13. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk Lu et al.",
      "doi": ""
    },
    {
      "text": "William H. Swanson and Gary E. Fish. 1995. Color matches in diseased eyes with good acuity: detection of defcits in cone optical density and in chromatic discrimination. J. Opt. Soc. Am. A 12, 10 (Oct 1995), 2230--2236.",
      "doi": ""
    },
    {
      "text": "Twitter. 2016. 200,000 USA geolocated tweets. Website. http://followthehashtag.com/datasets/ free-twitter-dataset-usa-200000-free-usa-tweets/",
      "doi": ""
    },
    {
      "text": "Paul D. Tynan and Robert Sekuler. 1982. Motion processing in peripheral vision: Reaction time and perceived velocity. Vision Research 22, 1 (1982), 61 -- 68.",
      "doi": ""
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. A Versatile Dataset for Text Entry Evaluations Based on Genuine Mobile Emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 295--298.  ",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, and Per Ola Kristensson. 2013. The Feasibility of Eyes-free Touchscreen Keyboard Typing. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 69, 2 pages.  ",
      "doi": "10.1145/2513383.2513399"
    },
    {
      "text": "Simon Voelker, Kjell Ivar Øvergård, Chat Wacharamanotham, and Jan Borchers. 2015. Knobology Revisited: A Comparison of User Performance Between Tangible and Virtual Rotary Knobs. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 35--38.  ",
      "doi": "10.1145/2817721.2817725"
    },
    {
      "text": "James Walker, Bochao Li, Keith Vertanen, and Scott Kuhl. 2017. Effcient Typing on a Visually Occluded Physical Keyboard. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5457--5461.  ",
      "doi": "10.1145/3025453.3025783"
    },
    {
      "text": "Wikipedia. 2017. Peripheral vision - Wikipedia, The Free Encyclopedia. https://en.wikipedia.org/wiki/Peripheral_vision",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock and Brad A. Myers. 2006. Analyzing the Input Stream for Character- Level Errors in Unconstrained Text Entry Evaluations. ACM Trans. Comput.-Hum. Interact. 13, 4 (Dec. 2006), 458--489.  ",
      "doi": "10.1145/1188816.1188819"
    },
    {
      "text": "Xin Yi, Chun Yu, Weinan Shi, and Yuanchun Shi. 2017. Is it too small?: Investigating the performances and preferences of users when typing on tiny QWERTY keyboards. International Journal of Human-Computer Studies 106 (2017), 44--62.",
      "doi": ""
    },
    {
      "text": "Suwen Zhu, Tianyao Luo, Xiaojun Bi, and Shumin Zhai. 2018. Typing on an Invisible Keyboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 439, 13 pages.  ",
      "doi": "10.1145/3173574.3174013"
    }
  ]
}