{
  "doi": "10.1145/3290605.3300658",
  "title": "A Field Study of Teachers Using a Curriculum-integrated Digital Game",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We present a new framework describing how teachers use ST Math, a curriculum-integrated, year-long educational game, in 3rd-4th grade classrooms. We combined authentic classroom observations with teacher interviews to identify teacher needs and practices. Our findings extended and contrasted with prior work on teachers' behaviors around classroom games, identifying differences likely arising from a digital platform and year-long curricular integration. We suggest practical ways that curriculum-integrated games can be designed to help teachers support effective classroom culture and practice.",
  "tags": [
    "k12",
    "classroom integration",
    "teachers",
    "educational games"
  ],
  "authors": [
    {
      "name": "Zhongxiu Peddycord-Liu",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210254",
      "orcid": "missing"
    },
    {
      "name": "Veronica Cateté",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/do/10.1145/contrib-81502799640/rel-imgonly/1890.jpg",
      "acmid": "81502799640",
      "orcid": "missing"
    },
    {
      "name": "Jessica Vandenberg",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659351137",
      "orcid": "missing"
    },
    {
      "name": "Tiffany Barnes",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/do/10.1145/contrib-81100476451/rel-imgonly/tiffany-headshot.jpg",
      "acmid": "81100476451",
      "orcid": "missing"
    },
    {
      "name": "Collin F. Lynch",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658984242",
      "orcid": "missing"
    },
    {
      "name": "Teomara Rutherford",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496642074",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adkins, S. (2017). The 2017--2022 Global Game-based Learning Market. In Serious Play Conference.",
      "doi": ""
    },
    {
      "text": "Aleven, V., McLaren, B., Roll, I., & Koedinger, K. (2004). Toward tutoring help seeking: Applying cognitive modeling to meta-cognitive skills. In J. C. Lester, R. M. Vicari, & F. Paraguacu, Proceedings of Seventh International Conference on Intelligent Tutoring Systems, ITS 2004 (pp. 227--239). Berlin: Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Arbreton, A. Student Goal Orientation and HelpSeeking Strategy Use. In S.A. Karabenick (Ed.), Strategic Help Seeking: Implications For Learning And Teaching, Lawrence Erlbaum Associates, Mahwah, NJ (1998), 95--116.",
      "doi": ""
    },
    {
      "text": "Backlund, P., & Hendrix, M. (2013, September). Educational gamesare they worth the effort? A literature survey of the effectiveness of serious games. In Games and virtual worlds for serious applications (VS-GAMES), 2013 5th international conference on (pp. 1--8). IEEE.",
      "doi": ""
    },
    {
      "text": "Baker, R., Walonoski, J., Heffernan, N., Roll, I., Corbett, A., & Koedinger, K. (2008). Why students engage in \"gaming the system\" behavior in interactive learning environments. Journal of Interactive Learning Research, 19(2), 185--224.",
      "doi": ""
    },
    {
      "text": "Bakker, M., van den Heuvel-Panhuizen, M., & Robitzsch, A. (2015). Effects of playing mathematics computer games on primary school students' multiplicative reasoning ability. Contemporary Educational Psychology, 40, 55--71.",
      "doi": ""
    },
    {
      "text": "Barendregt, W., & Bekker, T. M. (2011). The influence of the level of free-choice learning activities on the use of an educational computer game. Computers & Education, 56(1), 80--90.  ",
      "doi": "10.1016/j.compedu.2010.08.018"
    },
    {
      "text": "Bauman, K. (2018). More than Two-Thirds Access Internet on Mobile Devices. In America Counts: Stories: Population. U.S. Census Bureau. August 8, 2018. Online Jan. 4, 2019: https://www.census.gov/library/stories/2018/08/internet-access.html",
      "doi": ""
    },
    {
      "text": "Boyle, E. A., Hainey, T., Connolly, T. M., Gray, G., Earp, J., Ott, M., ... & Pereira, J. (2016). An update to the systematic literature review of empirical evidence of the impacts and outcomes of computer games and serious games. Computers & Education, 94, 178--192.  ",
      "doi": "10.1016/j.compedu.2015.11.003"
    },
    {
      "text": "Buabeng-Andoh, C. (2012). Factors Influencing Teachers' Adoption and Integration of Information and Communication Technology into Teaching: A Review of the Literature. International Journal of Education and Development using Information and Communication Technology, 8(1), 136--155.",
      "doi": ""
    },
    {
      "text": "Callaghan, M. N., Long, J. J., van Es, E. A., Reich, S. M., & Rutherford, T. (2018). How teachers integrate a math computer game: Professional development use, teaching practices, and student achievement. Journal of Computer Assisted Learning, 34(1), 10--19.",
      "doi": ""
    },
    {
      "text": "Chee, Y. S., Mehrotra, S., & Ong, J. C. (2014). Facilitating dialog in the game-based learning classroom: Teacher challenges reconstructing professional identity.",
      "doi": ""
    },
    {
      "text": "Clark, D. B., Tanner-Smith, E. E., & Killingsworth, S. S. (2016). Digital games, design, and learning: A systematic review and meta-analysis. Review of educational research, 86(1), 79--122.",
      "doi": ""
    },
    {
      "text": "Demirbilek, M., & Tamer, S. L. (2010). Math teachers' perspectives on using educational computer games in math education. Procedia-Social and Behavioral Sciences, 9, 709--716.",
      "doi": ""
    },
    {
      "text": "Diana, N., Eagle, M., Stamper, J., Grover, S., Bienkowski, M., & Basu, S. (2017, March). An instructor dashboard for real-time analytics in interactive programming assignments. In Proceedings of the Seventh International Learning Analytics & Knowledge Conference (pp. 272279). ACM.  ",
      "doi": "10.1145/3027385.3027441"
    },
    {
      "text": "Diana, N., Eagle, M., Stamper, J., Grover, S., Bienkowski, M., & Basu, S. (2017, March). An instructor dashboard for real-time analytics in interactive programming assignments. In Proceedings of the Seventh International Learning Analytics & Knowledge Conference (pp. 272279). ACM.  ",
      "doi": "10.1145/3027385.3027441"
    },
    {
      "text": "Dillenbourg, P., & Jermann, P. (2010). Technology for classroom orchestration. In New science of learning (pp. 525--552). Springer, New York, NY.",
      "doi": ""
    },
    {
      "text": "Eastwood, J. L., & Sadler, T. D. (2013). Teachers' implementation of a game-based biotechnology curriculum. Comp. & Ed., 66, 11--24.  ",
      "doi": "10.1016/j.compedu.2013.02.003"
    },
    {
      "text": "Girotto, V., Lozano, C., Muldner, K., Burleson, W., & Walker, E. (2016, May). Lessons learned from in-school use of rtag: A robo-tangible learning environment. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (pp. 919--930). ACM.  ",
      "doi": "10.1145/2858036.2858454"
    },
    {
      "text": "Hebert, C., & Jenson, J. (2017). Digital Game-Based Pedagogy: Exploring Teaching Strategies for Classroom Teachers in the use of Video Games in K-12 Classrooms. In ECGBL 2017 11th European Conference on Game-Based Learning (p. 227).",
      "doi": ""
    },
    {
      "text": "Hieftje, K., Pendergrass, T., Kyriakides, T. C., Gilliam, W., & Fiellin, L. (2017). An Evaluation of an Educational Video Game on Mathematics Achievement in First Grade Students. Technologies, 5(2), 30.",
      "doi": ""
    },
    {
      "text": "Holstein, K., Hong, G., Tegene, M., McLaren, B. M., & Aleven, V. (2018, March). The classroom as a dashboard: co-designing wearable cognitive augmentation for K-12 teachers. In Proceedings of the 8th International Conference on Learning Analytics and Knowledge (pp. 79--88). ACM.  ",
      "doi": "10.1145/3170358.3170377"
    },
    {
      "text": "Kang, H. 8 Teaching Habits that Block Productive Struggle in Math Students. Retrieved September 10, 2018, from https://blog.mindresearch.org/blog/productive-struggle-in-math",
      "doi": ""
    },
    {
      "text": "Kangas, M., Koskinen, A., & Krokfors, L. (2017). A qualitative literature review of educational games in the classroom: the teacher's pedagogical activities. Teachers and Teaching, 23(4), 451--470.",
      "doi": ""
    },
    {
      "text": "Ke, F. (2006). Classroom goal structures for educational math game application. In Proceedings of the 7th international conference on Learning sciences (pp. 314--320). International Society of the Learning Sciences. ",
      "doi": "10.5555/1150034.1150080"
    },
    {
      "text": "Ke, F. (2011). A qualitative meta-analysis of computer games as learning tools. In Gaming and Simulations: Concepts, Methodologies, Tools and Applications (pp. 1619--1665). IGI Global.",
      "doi": ""
    },
    {
      "text": "Kiili, K., & Ketamo, H. (2018). Evaluating cognitive and affective outcomes of a digital game-based math test. IEEE Transactions on Learning Technologies, 11(2), 255--263.",
      "doi": ""
    },
    {
      "text": "King, A. (2011). Using interactive games to improve math achievement among middle school students in need of remediation (Doctoral dissertation, The George Washington University).",
      "doi": ""
    },
    {
      "text": "Kharrufa, A., Rix, S., Osadchiy, T., Preston, A., & Olivier, P. (2017, May). Group Spinner: recognizing and visualizing learning in the classroom for reflection, communication, and planning. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (pp. 5556--5567). ACM Computing, 16, 1--14.  ",
      "doi": "10.1145/3025453.3025679"
    },
    {
      "text": "Lim, C. P., Tay, L. Y., & Hedberg, J. (2011). Employing an activitytheoretical perspective to localize an educational innovation in an elementary school. Journal of Educational Computing Research, 44(3), 319--344.",
      "doi": ""
    },
    {
      "text": "Liu, Z., Cody, C., Barnes, T., Lynch, C., and Rutherford, T. (2017). The Antecedents of and Associations with Elective Replay in An Educational Game: Is Replay Worth It. In proceedings of the 10th International Conference on Educational Data Mining (EDM).",
      "doi": ""
    },
    {
      "text": "Mifsud, C. L., Vella, R., & Camilleri, L. (2013). Attitudes towards and effects of the use of video games in classroom learning with specific reference to literacy attainment. Research in Education, 90(1), 32--52.",
      "doi": ""
    },
    {
      "text": "Molin, G. (2017). The role of the teacher in game-based learning: A review and outlook. In Serious Games and Edutainment Applications (pp. 649--674). Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Nanavati, A., Dias, M. B., & Steinfeld, A. (2018, April). Speak Up: A Multi-Year Deployment of Games to Motivate Speech Therapy in India. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (p. 318). ACM.  ",
      "doi": "10.1145/3173574.3173892"
    },
    {
      "text": "Niederhauser, D. S., & Stoddart, T. (2001). Teachers' instructional perspectives and use of educational software. Teaching and teacher education, 17(1), 15--31.",
      "doi": ""
    },
    {
      "text": "Peddycord-Liu, Z., Cody, C., Kessler, S., Barnes, T., Lynch, C. F., and Rutherford, T. (2017, October). Using Serious Game Analytics to Inform Digital Curricular Sequencing: What Math Objective Should Students Play Next?. In proceedings of the Annual Symposium on ComputerHuman Interaction in Play (pp. 195--204). ACM.  ",
      "doi": "10.1145/3116595.3116620"
    },
    {
      "text": "Peddycord-Liu, Z., Harred, R., Karamarkovich, S., Barnes, T., Lynch, C., & Rutherford, T. (2018, June). Learning Curve Analysis in a Large-Scale, Drill-and-Practice Serious Math Game: Where Is Learning Support Needed?. In International Conference on Artificial Intelligence in Education (pp. 436--449). Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Peddycord-Liu, Z. A. (2018). Game Learning Analytics and Qualitative Methods for Actionable Change in a Curriculum-Integrated Educational Math Game. (Doctoral dissertation, North Carolina State University).",
      "doi": ""
    },
    {
      "text": "Ravyse, W. S., Blignaut, A. S., Leendertz, V., & Woolner, A. (2017). Success factors for serious games to enhance learning: a systematic review. Virtual Reality, 21(1), 31--58.  ",
      "doi": "10.1007/s10055-016-0298-4"
    },
    {
      "text": "Rau, M. A., Aleven, V., Rummel, N. (2009, July). Intelligent Tutoring Systems with Multiple Representations and Self-Explanation Prompts Support Learning of Fractions. In AIED (pp. 441--448). ",
      "doi": "10.5555/1659450.1659517"
    },
    {
      "text": "Richards, J., Stebbins, L., & Moellering, K. (2013). Games for a digital age: K-12 market map and investment analysis. In Joan Ganz Cooney Center at Sesame Workshop, New York.",
      "doi": ""
    },
    {
      "text": "Riconscente, M. M. (2013). Results from a controlled study of the iPad fractions game Motion Math. Games and Culture, 8(4), 186--214.",
      "doi": ""
    },
    {
      "text": "Roll, I., Baker, R. S. D., Aleven, V., & Koedinger, K. R. (2014). On the benefits of seeking (and avoiding) help in online problem-solving environments. Journal of the Learning Sciences, 23(4), 537--560.",
      "doi": ""
    },
    {
      "text": "Rowe, E., Asbell-Clarke, J., Baker, R. S., Eagle, M., Hicks, A. G., Barnes, T. M., ... & Edwards, T. (2017). Assessing implicit science learning in digital games. Computers in Human Behavior, 76, 617--630.  ",
      "doi": "10.1016/j.chb.2017.03.043"
    },
    {
      "text": "Rutherford, T., Kibrick, M., Burchinal, M., Richland, L., Conley, A., Osborne, K., ... & Daniels, A. (2010). Spatial Temporal Mathematics at Scale: An Innovative and Fully Developed Paradigm to Boost Math Achievement among All Learners. Available from ERIC database (ED510612).",
      "doi": ""
    },
    {
      "text": "Rutherford, T., Farkas, G., Duncan, G., Burchinal, M., Kibrick, M., Graham, J., ... & Martinez, M. E. (2014). A randomized trial of an elementary school mathematics software intervention: Spatial-temporal math. Journal of Research on Educational Effectiveness, 7(4), 358--383.",
      "doi": ""
    },
    {
      "text": "Sabourin, J., Rowe, J. P., Mott, B. W., & Lester, J. C. (2011, June). When off-task is on-task: The affective role of off-task behavior in narrativecentered learning environments. In International Conference on Artificial Intelligence in Education (pp. 534--536). Springer, Berlin, Heidelberg. ",
      "doi": "10.5555/2026506.2026602"
    },
    {
      "text": "Sadler, T. D., Romine, W. L., Stuart, P. E., & Merle-Johnson, D. (2013). Game-based curricula in biology classes: Differential effects among varying academic levels. Journal of Research in Science Teaching, 50(4), 479--499.",
      "doi": ""
    },
    {
      "text": "Saldana, J. (2015). The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Sandford, R., Ulicsak, M., Facer, K., & Rudd, T. (2006). Teaching with games: Using commerical off-the-shelf computer games in formal education. Nesta Future Lab. Last retrieved online at:https://www.nfer.ac.uk/publications/FUTL49/FUTL49.pdf",
      "doi": ""
    },
    {
      "text": "Schenke, K., Rutherford, T., & Farkas, G. (2014). Alignment of game design features and state mathematics standards: Do results reflect intentions?. Computers & Education, 76, 215--224.",
      "doi": ""
    },
    {
      "text": "Speak, U. P. From Print to Pixel: The role of videos, games, animations and simula-tions within K-12 education.http://www.tomorrow.org/speakup/SU15AnnualReport.html. 2015.",
      "doi": ""
    },
    {
      "text": "Takeuchi, L. M., & Vaala, S. (2014). Level up Learning: A National Survey on Teaching with Digital Games. Joan Ganz Cooney Center.",
      "doi": ""
    },
    {
      "text": "Urdan, T., & Schoenfelder, E. (2006). Classroom effects on student motivation: Goal structures, social relationships, and competence beliefs. Journal of school psychology, 44(5), 331--349.",
      "doi": ""
    },
    {
      "text": "van der Maas, H. L., Nyamsuren, E. (2017). Cognitive analysis of educational games: The number game. Topics in cognitive science, 9(2), 395--412.",
      "doi": ""
    },
    {
      "text": "Warshauer, H. K. (2015). Productive struggle in middle school mathematics classrooms. Journal of Mathematics Teacher Education, 18(4), 375--400.",
      "doi": ""
    },
    {
      "text": "Watson, W. R., Mong, C. J., & Harris, C. A. (2011). A case study of the inclass use of a video game for teaching high school history. Computers & Education, 56(2), 466--474.  ",
      "doi": "10.1016/j.compedu.2010.09.007"
    },
    {
      "text": "Watson, W., & Yang, S. (2016). Games in schools: Teachers' perceptions of barriers to game-based learning. Journal of Interactive Learning Research, 27(2), 153--170.",
      "doi": ""
    }
  ]
}