{
  "doi": "10.1145/3290605.3300420",
  "title": "Detecting Perception of Smartphone Notifications Using Skin Conductance Responses",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Today's smartphone notification systems are incapable of determining whether a notification has been successfully perceived without explicit interaction from the user. If the system incorrectly assumes that a notification has not been perceived, it may repeat it redundantly, disrupting the user and others (e.g., phone ringing). Or, if it incorrectly assumes that a notification was perceived, and therefore fails to repeat it, the notification will be missed altogether (e.g., text message). Results from a laboratory study confirm, for the first time, that both vibrotactile and auditory smartphone notifications induce skin conductance responses (SCR), that the induced responses differ from that of arbitrary stimuli, and that they could be employed to predict perception of smartphone notifications after their presentation using wearable sensors.",
  "authors": [
    {
      "name": "Pascal E. Fortin",
      "institution": "McGill University, Montreal, QC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214343",
      "orcid": "missing"
    },
    {
      "name": "Elisabeth Sulmont",
      "institution": "McGill University, Montreal, QC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659214191",
      "orcid": "missing"
    },
    {
      "name": "Jeremy Cooperstock",
      "institution": "McGill University, Montreal, QC, Canada",
      "img": "/do/10.1145/contrib-81100490116/rel-imgonly/jer13.jpg",
      "acmid": "81100490116",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hans Jørgen Andersen, Ann Morrison, and Lars Knudsen. 2012. Modeling Vibrotactile Detection by Logistic Regression. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 500--503.  ",
      "doi": "10.1145/2399016.2399092"
    },
    {
      "text": "Mathias Benedek and Christian Kaernbach. 2010. A continuous measure of phasic electrodermal activity. Journal of Neuroscience Methods 190, 1 (2010), 80--91.",
      "doi": ""
    },
    {
      "text": "Jeffrey R Blum, Ilja Frissen, and Jeremy R Cooperstock. 2015. Improving Haptic Feedback on Wearable Devices through Accelerometer Measurements. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 31--36.  ",
      "doi": "10.1145/2807442.2807474"
    },
    {
      "text": "Wolfram. Boucsein. 2012. Electrodermal activity. http://site.ebrary. com/id/10517958",
      "doi": ""
    },
    {
      "text": "John T Cacioppo, Louis G Tassinary, and Gary Berntson. 2007. Handbook of Psychophysiology. Cambridge University Press. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Yung-Ju Chang and John C Tang. 2015. Investigating Mobile Users' Ringer Mode Usage and Attentiveness and Responsiveness to Communication. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 6--15.  ",
      "doi": "10.1145/2785830.2785852"
    },
    {
      "text": "Carl Eisdorfer, Hans O Doerr, and William Follette. 1980. Electrodermal Reactivity: An Analysis by Age and Sex. Journal of Human Stress 6, 4 (dec 1980), 39--42.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A Hancock and Najmedin B T Advances in Psychology Meshkati (Eds.). Vol. 52. North-Holland, 139--183.",
      "doi": ""
    },
    {
      "text": "Veronika Konok, Ákos Pogány, and Ádám Miklósi. 2017. Mobile attachment: Separation from the mobile phone induces physiological and behavioural stress and attentional bias to separation-related stimuli. Computers in Human Behavior 71 (2017), 228--239.  ",
      "doi": "10.1016/j.chb.2017.02.002"
    },
    {
      "text": "Sören Krach, Frieder M Paulus, Maren Bodden, and Tilo Kircher. 2010. The Rewarding Nature of Social Interactions. Frontiers in Behavioral Neuroscience 4 (may 2010), 22.",
      "doi": ""
    },
    {
      "text": "Russell A Lockhart. 1972. Interrelations Between Amplitude, Latency, Rise Time, and the Edelberg Recovery Measure of the Galvanic Skin Response. Psychophysiology 9, 4 (1972), 437--442.",
      "doi": ""
    },
    {
      "text": "Henry M. Mix. 2009. Wild Russia - The secret forest.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014. Didn'T You See My Message?: Predicting Attentiveness to Mobile Instant Messages. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3319--3328.  ",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Andrew K Przybylski, Kou Murayama, Cody R DeHaan, and Valerie Gladwell. 2013. Motivational, emotional, and behavioral correlates of fear of missing out. Computers in Human Behavior 29, 4 (2013), 1841--1848.",
      "doi": ""
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3055--3064.  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Samuel P L Veissière and Moriah Stendel. 2018. Hypernatural Monitoring: A Social Rehearsal Account of Smartphone Addiction. Frontiers in Psychology 9 (2018), 141.",
      "doi": ""
    },
    {
      "text": "Sunghyuk Yoon and Kun-pyo Lee. 2015. A Study on Notification System Design of Smartphone Messenger Considering the User ' s Stress. Archives of design research 28, 2 (2015), 77--91.",
      "doi": ""
    }
  ]
}