{
  "doi": "10.1145/3290605.3300794",
  "title": "Shaping Pro-Social Interaction in VR: An Emerging Design Framework",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Commercial social VR applications represent a diverse and evolving ecology with competing models of what it means to be social in VR. Drawing from expert interviews, this paper examines how the creators of different social VR applications think about how their platforms frame, support, shape, or constrain social interaction. The study covers a range of applications including: Rec Room, High Fidelity, VRChat, Mozilla Hubs, Altspace VR, AnyLand, and Facebook Spaces. We contextualize design choices underlying these applications, with particular attention paid to the ways that industry experts perceive, and seek to shape, the relationship between user experiences and design choices. We underscore considerations related to: (1) aesthetics of place (2) embodied affordances, (3) social mechanics, (4) and tactics for shaping social norms and mitigating harassment. Drawing on this analysis, we discuss the stakes of these choices, suggest future research directions, and propose an emerging design framework for shaping pro-social behavior in VR.",
  "authors": [
    {
      "name": "Joshua McVeigh-Schultz",
      "institution": "University of California, Santa Cuz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502796825",
      "orcid": "missing"
    },
    {
      "name": "Anya Kolesnichenko",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659077761",
      "orcid": "missing"
    },
    {
      "name": "Katherine Isbister",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-99659489823/rel-imgonly/ella-square.jpg",
      "acmid": "99659489823",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benford, S. et al. 2001. Collaborative virtual environments. Communications of the ACM. 44, 7 (2001), 79--85.  ",
      "doi": "10.1145/379300.379322"
    },
    {
      "text": "Benford, S. et al. 1995. User Embodiment in Collaborative Virtual Environments. Proceedings of the International Conference on Human Factors in Computing Systems (CHI'95). (1995), 242--249.  ",
      "doi": "10.1145/223904.223935"
    },
    {
      "text": "Blascovich, J. 2002. A theoretical model of social influence for increasing the utility of collaborative virtual environments. Proceedings of the 4th International Conference on Collaborative Virtual Environments. (2002).  ",
      "doi": "10.1145/571878.571883"
    },
    {
      "text": "Boellstorff, T. 2008. Coming of Age in Second Life. An Anthropologist Explores the Virtually Human. ",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Boellstorff, T. et al. 2012. Ethnography and virtual worlds: A handbook of method. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Bowers, J. et al. 1996. Talk and embodiment in collaborative virtual environments. Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '96. (1996).  ",
      "doi": "10.1145/238386.238404"
    },
    {
      "text": "Castronova, E. 2008. Exodus to the virtual world?: how online fun is changing reality. Palgrave Macmillan. ",
      "doi": "10.5555/1522461"
    },
    {
      "text": "Castronova, E. 2005. Synthetic worlds?: the business and culture of online games. University of Chicago Press. ",
      "doi": "10.5555/1076839"
    },
    {
      "text": "Churchill, E.F. and Snowdon, D. 1998. Collaborative virtual environments: An introductory review of issues and systems. Virtual Reality. (1998).  ",
      "doi": "10.1007/BF01409793"
    },
    {
      "text": "Designing Facebook Spaces (Part 4) - Creating a VR interface: 2017. https://medium.com/@christauziet/designing-facebook-spaces-part-4-creating-a-vr-interface-821861159495.",
      "doi": ""
    },
    {
      "text": "Desurvire, H. and Kreminski, M. 2018. Are Game Design and User Research Guidelines Specific to Virtual Reality Effective in Creating a More Optimal Player Experience? Yes, VR PLAY. Design, User Experience, and Usability: Theory and Practice (Cham, 2018), 40--59.",
      "doi": ""
    },
    {
      "text": "Dibbell, J. 1998. My tiny life?: crime and passion in a virtual world. Holt. ",
      "doi": "10.5555/520892"
    },
    {
      "text": "Dourish, P. 2006. Re-Space-ing Place?: Place \" and Space \" Ten Years On. Computing. (2006).",
      "doi": ""
    },
    {
      "text": "Doyle, D. 2010. Phenomenologies of practice: Making sense of virtual worlds and user-driven innovation. Making Sense of Virtual Worlds and User Driven Innovation (2010).",
      "doi": ""
    },
    {
      "text": "Harrison, S. and Dourish, P. 1996. Re-Place-ing Space?: The Roles of Place and Space in Collaborative Systems. 1996.",
      "doi": ""
    },
    {
      "text": "He, Z. et al. 2017. PhyShare. Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology - UIST '17 (New York, New York, USA, 2017), 17--19.  ",
      "doi": "10.1145/3131785.3131795"
    },
    {
      "text": "Immersive Design: The Next 10 Years of Interfaces: 2018. https://uxdesign.cc/immersive-design-the-next-10-years-of-interfaces-16122cb6eae6. Accessed: 2018-08-06.",
      "doi": ""
    },
    {
      "text": "Isbister, K. et al. 2010. Designing games for learning. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10 (New York, New York, USA, 2010), 2041.",
      "doi": ""
    },
    {
      "text": "Isbister, K. 2010. Enabling Co-Located Physical Social Play: A Framework for Design and Evaluation. Game User Experience Evaluation.",
      "doi": ""
    },
    {
      "text": "Isbister, K. and Mueller, F. ?Floyd\" 2015. Guidelines for the Design of Movement-Based Games and Their Relevance to HCI. Human--Computer Interaction. 30, 3--4 (May 2015), 366--399.  ",
      "doi": "10.1080/07370024.2014.996647"
    },
    {
      "text": "Kendon, A. 1990. Conducting Interaction: Patterns of Behavior in Focused Encounters. Cambridge University Press, 1990.",
      "doi": ""
    },
    {
      "text": "Ludlow, P. and Wallace, M. 2009. The Second Life Herald: The Virtual Tabloid that Witnessed the Dawn of the Metaverse. The MIT Press. ",
      "doi": "10.5555/1324835"
    },
    {
      "text": "Malaby, T. 2009. Making Virtual Worlds: Linden Lab and Second Life. Comstock Pub Assoc.",
      "doi": ""
    },
    {
      "text": "Marquardt, N. and Greenberg, S. 2015. Proxemic Interactions: From Theory to Practice.",
      "doi": ""
    },
    {
      "text": "Marshall, P. et al. 2011. Using F-formations to analyse spatial patterns of interaction in physical environments. Proceedings of the ACM 2011 conference on Computer supported cooperative work - CSCW '11 (New York, New York, USA, 2011), 445.  ",
      "doi": "10.1145/1958824.1958893"
    },
    {
      "text": "McVeigh-Schultz, J. et al. 2018. What's It Mean to \"Be Social\" in VR? Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - DIS '18 (New York, New York, USA, 2018), 289--294.  ",
      "doi": "10.1145/3197391.3205451"
    },
    {
      "text": "My first virtual reality groping: 2016. https://mic.com/articles/157415/my-first-virtual-reality-groping-sexual-assault-in-vr-harassment-in-tech-jordan-belamire#.7ECfifxnW.",
      "doi": ""
    },
    {
      "text": "Ondrejka, C.R. 2004. A Piece of Place: Modeling the Digital on the Real in Second Life. SSRN Electronic Journal. (2004).",
      "doi": ""
    },
    {
      "text": "Pallay, C. et al. 2009. Getting acquainted in Second Life. Proceedings of the International Conference on Advances in Computer Enterntainment Technology - ACE '09 (New York, New York, USA, 2009), 36.  ",
      "doi": "10.1145/1690388.1690395"
    },
    {
      "text": "Pearce, C. 2009. Communities of Play: Emergent Cultures in Multiplayer Games and Virtual Worlds. The MIT Press. ",
      "doi": "10.5555/1655830"
    },
    {
      "text": "Perry, T.S. 2016. Virtual reality goes social. IEEE Spectrum. (2016).",
      "doi": "10.1109/MSPEC.2016.7367470"
    },
    {
      "text": "Saldana, J. 2016. The Coding Manual for Qualitative Researchers. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Schild, J. et al. 2018. Applying Multi-User Virtual Reality to Collaborative Medical Training. IEEE Virtual Reality. March (2018).",
      "doi": ""
    },
    {
      "text": "Schubert, T. et al. 1999. Embodied Presence in Virtual Environments. Visual Representations and Interpretations.",
      "doi": ""
    },
    {
      "text": "Shriram, K. et al. 2017. All Are Welcome: Using VR Ethnography to Explore Harassment Behavior In Immersive Social Virtual Reality. Virtual Reality (Los Angeles, CA, 2017).",
      "doi": ""
    },
    {
      "text": "Snowdon, D. et al. 2001. Collaborative Virtual Environments: Digital Places and Spaces for Interaction. ",
      "doi": "10.5555/558246"
    },
    {
      "text": "Snowdon, D. et al. 2000. Collaborative Virtual Environments: Digital Spaces and Places for CSCW. Collaborative Virtual Environments. (2000). ",
      "doi": "10.5555/558246"
    },
    {
      "text": "Sra, M. et al. 2018. Novel Interaction Techniques for Collaboration in VR. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (New York, New York, USA, 2018), 1--8.  ",
      "doi": "10.1145/3170427.3170628"
    },
    {
      "text": "Sra, M. et al. 2018. Your Place and Mine. Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18 (New York, New York, USA, 2018), 85--97.  ",
      "doi": "10.1145/3196709.3196788"
    },
    {
      "text": "Taylor, T.L. 2006. Play Between Worlds: Exploring Online Game Culture. ",
      "doi": "10.5555/1137764"
    },
    {
      "text": "Thompson, M. et al. Rules, Roles, and Resources?: Strategies to Promote Collaboration in Virtual Reality Contexts. Workshop Position Paper for CHI 2018.",
      "doi": ""
    },
    {
      "text": "Wilcox, L.M. et al. 2006. Personal Space in Virtual Reality. ACM Transactions in Applied Perception. (2006).  ",
      "doi": "10.1145/1190036.1190041"
    }
  ]
}