{
  "doi": "10.1145/3290605.3300446",
  "title": "Developing Accessible Services: Understanding Current Knowledge and Areas for Future Support",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "When creating digital artefacts, it is important to ensure that the product being made is accessible to as much of the population as is possible. Many guidelines and supporting tools exist to assist reaching this goal. However, little is known about developers' understanding of accessible practice and the methods that are used to implement this. We present findings from an accessibility design workshop that was carried out with a mixture of 197 developers and digital technology students. We discuss perceptions of accessibility, techniques that are used when designing accessible products, and what areas of accessibility development participants believed were important. We show that there are gaps in the knowledge needed to develop accessible products despite the effort to promote accessible design. Our participants are themselves aware of where these gaps are and have suggested a number of areas where tools, techniques and guidance would improve their practice.",
  "authors": [
    {
      "name": "Michael Crabb",
      "institution": "University of Dundee, Dundee, Dundee, United Kingdom",
      "img": "/do/10.1145/contrib-81556562156/rel-imgonly/200x200.png",
      "acmid": "81556562156",
      "orcid": "missing"
    },
    {
      "name": "Michael Heron",
      "institution": "Robert Gordon University, Aberdeen, United Kingdom",
      "img": "/do/10.1145/contrib-81558520056/rel-imgonly/81558520056.png",
      "acmid": "81558520056",
      "orcid": "missing"
    },
    {
      "name": "Rhianne Jones",
      "institution": "BBC Research and Development, Salford, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958942757",
      "orcid": "missing"
    },
    {
      "name": "Mike Armstrong",
      "institution": "BBC Research and Development, Salford, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658720799",
      "orcid": "missing"
    },
    {
      "name": "Hayley Reid",
      "institution": "FinancialForce, Harrogate, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366465",
      "orcid": "missing"
    },
    {
      "name": "Amy Wilson",
      "institution": "Robert Gordon University, Aberdeen, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365515",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Halimat I. Alabi and Bruce Gooch. 2011. The accessibility toolkit. In Proceedings of the 10th SIGPLAN symposium on New ideas, new paradigms, and reflections on programming and software - ONWARD '11. ACM Press, New York, New York, USA, 145.  ",
      "doi": "10.1145/2089131.2089136"
    },
    {
      "text": "Ng Zhi An. 2016. ChromeLens. https://github.com/chromelens/ chromelens",
      "doi": ""
    },
    {
      "text": "National Disability Authority. 2014. Web Accessibility Techniques. http://universaldesign.ie/Technology-ICT/ Web-accessibility-techniques/",
      "doi": ""
    },
    {
      "text": "Chris Bailey and Voula Gkatzidou. 2017. Considerations for Implementing a Holistic Organisational Approach to Accessibility. In Proceedings of the 14th Web for All Conference on The Future of Accessible Work (W4A '17). ACM, New York, NY, USA, Article 7, 4 pages.  ",
      "doi": "10.1145/3058555.3058571"
    },
    {
      "text": "BBC. 2014. Accessibility Standards and Guidelines. http://www.bbc. co.uk/guidelines/futuremedia/accessibility/",
      "doi": ""
    },
    {
      "text": "Giorgio Brajnik, Yeliz Yesilada, and Simon Harper. 2012. Is Accessibility Conformance an Elusive Property? A Study of Validity and Reliability of WCAG 2.0. ACM Trans. Access. Comput. 4, 2, Article 8 (March 2012), 28 pages.  ",
      "doi": "10.1145/2141943.2141946"
    },
    {
      "text": "John Clarkson, Roger Coleman, Ian Hosking, and Sam Waller. 2007. Inclusive design toolkit. Engineering Design Centre, University of Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. 2018. Web Content Accessibility Guidelines (WCAG) 2.1. https://www.w3.org/TR/WCAG21/",
      "doi": ""
    },
    {
      "text": "Tim Coughlan, Thomas Daniel Ullmann, and Kate Lister. 2017. Understanding Accessibility as a Process through the Analysis of Feedback from Disabled Students. In Proceedings of the 14th Web for All Conference on The Future of Accessible Work - W4A '17. ACM Press, New York, New York, USA, 1--10.  ",
      "doi": "10.1145/3058555.3058561"
    },
    {
      "text": "Michael Crabb and Michael Heron. 2016. Designing for Accessibility. http://accessible-reality.org/workshops/designing-for-accessibility",
      "doi": ""
    },
    {
      "text": "Marianne Dee and Vicki L. Hanson. 2014. A Large User Pool for Accessibility Research with Representative Users. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 35--42.  ",
      "doi": "10.1145/2661334.2661361"
    },
    {
      "text": "Ideas for Ears. 2018. Hearing Access Protocol. https://www. ideasforears.org.uk/hearing-access-protocol/",
      "doi": ""
    },
    {
      "text": "Paula Forbes, Lorna Gibson, Vicki L. Hanson, Peter Gregor, and Alan F. Newell. 2009. Dundee User Centre: A Space Where Older People and Technology Meet. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '09). ACM, New York, NY, USA, 231--232.  ",
      "doi": "10.1145/1639642.1639690"
    },
    {
      "text": "André Pimenta Freire, Renata Pontin de Mattos Fortes, Debora Maria Barroso Paiva, Marcelo Augusto Santos Turine, André Pimenta Freire, Renata Pontin de Mattos Fortes, Debora Maria Barroso Paiva, and Marcelo Augusto Santos Turine. 2007. Using screen readers to reinforce web accessibility education. In Proceedings of the 12th annual SIGCSE conference on Innovation and technology in computer science education - ITiCSE '07. ACM Press, New York, New York, USA, 82.  ",
      "doi": "10.1145/1268784.1268810"
    },
    {
      "text": "G3ICT. 2009. ICT Accessibility Self-Assessment Framework. http: //www.g3ict.org/download/p/fileId_838/productId_169",
      "doi": ""
    },
    {
      "text": "Krzysztof Z. Gajos. 2014. Making the Web More Inclusive with Adaptive User Interfaces. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 1--1.  ",
      "doi": "10.1145/2607023.2611454"
    },
    {
      "text": "Krzysztof Z. Gajos, Amy Hurst, and Leah Findlater. 2012. Personalized Dynamic Accessibility. interactions 19, 2 (March 2012), 69--73.  ",
      "doi": "10.1145/2090150.2090167"
    },
    {
      "text": "Able Gamers. 2012. A Practical Guide to Games Accessibility. http: //includification.com/AbleGamers_Includification.pdf",
      "doi": ""
    },
    {
      "text": "Greg Gay, Naza Djafarova, and Leonora Zefi. 2017. Teaching Accessibility to the Masses. In Proceedings of the 14th Web for All Conference on The Future of Accessible Work - W4A '17. ACM Press, New York, New York, USA, 1--8.  ",
      "doi": "10.1145/3058555.3058563"
    },
    {
      "text": "Google. 2018. Google Accessibility. https://www.google.co.uk/ accessibility/",
      "doi": ""
    },
    {
      "text": "Joshua Hailpern, Marina Danilevsky, and Karrie Karahalios. 2010. Walking in another's shoes. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '10. ACM Press, New York, New York, USA, 299.  ",
      "doi": "10.1145/1878803.1878880"
    },
    {
      "text": "Ian Hamilton. 2016. Games Accessibility Guidelines. http:// gameaccessibilityguidelines.com/",
      "doi": ""
    },
    {
      "text": "Vicki L. Hanson and John T. Richards. 2013. Progress on Website Accessibility? ACM Trans. Web 7, 1, Article 2 (March 2013), 30 pages.  ",
      "doi": "10.1145/2435215.2435217"
    },
    {
      "text": "Michael James Heron, Pauline Helen Belford, Hayley Reid, and Michael Crabb. 2018. Meeple Centred Design: A Heuristic Toolkit for Evaluating the Accessibility of Tabletop Games. The Computer Games Journal 7, 2 (jun 2018), 97--114.",
      "doi": ""
    },
    {
      "text": "Melody Y Ivory, Jennifer Mankoff, and Audrey Le. 2003. Using automated tools to improve web site usage by users with diverse abilities. Citeseer. 117 pages.",
      "doi": ""
    },
    {
      "text": "S. IWARSSON and A. STÅHL. 2003. Accessibility, usability and universal design: Positioning and definition of concepts describing personenvironment relationships. Disability and Rehabilitation 25, 2 (jan 2003), 57--66.",
      "doi": ""
    },
    {
      "text": "Leonard R. Kasday and Leonard R. 2000. A tool to evaluate universal Web accessibility. In Proceedings on the 2000 conference on Universal Usability - CUU '00. ACM Press, New York, New York, USA, 161--162.  ",
      "doi": "10.1145/355460.355559"
    },
    {
      "text": "Axess Lab. 2017. Funkify: Disability simulator. https://www.funkify. org/",
      "doi": ""
    },
    {
      "text": "Megan Lawrence and Mary Bellard. 2017. Teach Access. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education - SIGCSE '17. ACM Press, New York, New York, USA, 700--700.  ",
      "doi": "10.1145/3017680.3022392"
    },
    {
      "text": "Marie-Luise Leitner, Christine Strauss, and Christian Stummer. 2016. Web accessibility implementation in private sector organizations: motivations and business impact. Universal Access in the Information Society 15, 2 (01 Jun 2016), 249--260.  ",
      "doi": "10.1007/s10209-014-0380-1"
    },
    {
      "text": "Aaron Leventhal. 2013. NoCoffee: Visual Simulator. https:// accessgarage.wordpress.com/",
      "doi": ""
    },
    {
      "text": "Stephanie Ludi, Matt Huenerfauth, Vicki Hanson, Nidhi Rajendra Palan, and Paula Garcia. 2018. Teaching Inclusive Thinking to Undergraduate Students in Computing Programs. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education SIGCSE '18. ACM Press, New York, New York, USA, 717--722.  ",
      "doi": "10.1145/3159450.3159512"
    },
    {
      "text": "Microsoft. 2016. Inclusive design. https://www.microsoft.com/design/ inclusive/",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Microsoft Accessibility. https://www.microsoft.com/ en-us/accessibility",
      "doi": ""
    },
    {
      "text": "Nikki Murdick, Paul Shore, Barbara Gartin, and Mary M Chittooran. 2004. Cross-cultural comparison of the concept of\" otherness\" and its impact on persons with disabilities. Education and Training in Developmental Disabilities (2004), 310--316.",
      "doi": ""
    },
    {
      "text": "Michael; Sapey Oliver Bob; Thomas, Pam. 2012. Social work with disabled people. Palgrave.",
      "doi": ""
    },
    {
      "text": "Mark Otto, Jacob Thornton, et al. 2015. Bootstrap - The world's most popular mobile-first and responsive front-end framework. http: //www.getbootstrap.com",
      "doi": ""
    },
    {
      "text": "Afra Pascual, Mireia Ribera, and Toni Granollers. 2015. Empathic Communication of Accessibility Barriers in Web 2.0 Editing. In Proceedings of the 12th Web for All Conference (W4A '15). ACM, New York, NY, USA, Article 23, 8 pages.  ",
      "doi": "10.1145/2745555.2746642"
    },
    {
      "text": "Elaine Pearson, Chrstopher Bailey, and Steve Green. 2011. A tool to support the web accessibility evaluation process for novices. In Proceedings of the 16th annual joint conference on Innovation and technology in computer science education - ITiCSE '11. ACM Press, New York, New York, USA, 28.  ",
      "doi": "10.1145/1999747.1999758"
    },
    {
      "text": "Elizabeth R Peterson and Kevin A Barron. 2007. How to get focus groups talking: New ideas that will stick. International Journal of Qualitative Methods 6, 3 (2007), 140--144.",
      "doi": ""
    },
    {
      "text": "Heydon Pickering. 2016. Inclusive Design Patterns.",
      "doi": ""
    },
    {
      "text": "Heydon Pickering. 2018. Inclusive Components.",
      "doi": ""
    },
    {
      "text": "John R. Porter and Julie A. Kientz. 2013. An Empirical Study of Issues and Barriers to Mainstream Video Game Accessibility. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 3, 8 pages.  ",
      "doi": "10.1145/2513383.2513444"
    },
    {
      "text": "Cynthia Putnam, Maria Dahman, Emma Rose, Jinghui Cheng, and Glenn Bradford. 2015. Teaching Accessibility, Learning Empathy. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '15). ACM, New York, NY, USA, 333--334.  ",
      "doi": "10.1145/2700648.2811365"
    },
    {
      "text": "Cynthia Putnam, Maria Dahman, Emma Rose, Jinghui Cheng, and Glenn Bradford. 2016. Best Practices for Teaching Accessibility in University Classrooms. ACM Transactions on Accessible Computing 8, 4 (mar 2016), 1--26.  ",
      "doi": "10.1145/2831424"
    },
    {
      "text": "Cynthia Putnam, Kathryn Wozniak, Mary Jo Zefeldt, Jinghui Cheng, Morgan Caputo, and Carl Duffield. 2012. How Do Professionals Who Create Computing Technologies Consider Accessibility?. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12). ACM, New York, NY, USA, 87--94.  ",
      "doi": "10.1145/2384916.2384932"
    },
    {
      "text": "John T. Richards, Kyle Montague, and Vicki L. Hanson. 2012. Web Accessibility As a Side Effect. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12). ACM, New York, NY, USA, 79--86.  ",
      "doi": "10.1145/2384916.2384931"
    },
    {
      "text": "Andrew Sears and Vicki L. Hanson. 2012. Representing Users in Accessibility Research. ACM Trans. Access. Comput. 4, 2, Article 7 (March 2012), 6 pages.  ",
      "doi": "10.1145/2141943.2141945"
    },
    {
      "text": "UK Government Digital Service. 2018. Accessibility in Government. https://accessibility.blog.gov.uk/",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Saba Kawas, Andrew J. Ko, and Richard E. Ladner. 2018. Who Teaches Accessibility?. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education - SIGCSE '18. ACM Press, New York, New York, USA, 197--202.  ",
      "doi": "10.1145/3159450.3159484"
    },
    {
      "text": "Garreth W. Tigwell, David R. Flatla, and Neil D. Archibald. 2017. ACE: A Colour Palette Design Tool for Balancing Aesthetics and Accessibility. ACM Trans. Access. Comput. 9, 2, Article 5 (Jan. 2017), 32 pages.  ",
      "doi": "10.1145/3014588"
    },
    {
      "text": "Garreth W. Tigwell, Rachel Menzies, and David R. Flatla. 2018. Designing for Situational Visual Impairments. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18. ACM Press, New York, New York, USA, 387--399.  ",
      "doi": "10.1145/3196709.3196760"
    },
    {
      "text": "Department for Work UK Government and Pensions. 2017. Family Resources Survey 2016/17. https://www.gov.uk/government/statistics/ family-resources-survey-financial-year-201617",
      "doi": ""
    },
    {
      "text": "T. B. Üstün, S. Chatterji, J. Bickenbach, N. Kostanjsek, and M. Schneider. 2003. The International Classification of Functioning, Disability and Health: A new tool for understanding disability and health. Disability and Rehabilitation 25, 11--12 (2003), 565--571.",
      "doi": ""
    },
    {
      "text": "W3C. 2015. Cognitive Accessibility User Research. https://www.w3. org/TR/coga-user-research/",
      "doi": ""
    },
    {
      "text": "W3C. 2016. Accessibility Requirements for People with Low Vision. https://www.w3.org/TR/low-vision-needs/",
      "doi": ""
    },
    {
      "text": "W3C. 2016. Techniques for WCAG 2.0. https://www.w3.org/TR/ WCAG20-TECHS/",
      "doi": ""
    },
    {
      "text": "Annalu Waller, Vicki L. Hanson, and David Sloan. 2009. Including accessibility within and beyond undergraduate computing courses. In Proceeding of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS '09. ACM Press, New York, New York, USA, 155.  ",
      "doi": "10.1145/1639642.1639670"
    },
    {
      "text": "Ye Diana Wang and Ye Diana. 2012. A holistic and pragmatic approach to teaching web accessibility in an undergraduate web design course. In Proceedings of the 13th annual conference on Information technology education - SIGITE '12. ACM Press, New York, New York, USA, 55.  ",
      "doi": "10.1145/2380552.2380568"
    },
    {
      "text": "Holly Yu. 2002. Web accessibility and the law: recommendations for implementation. Library Hi Tech 20, 4 (2002), 406--419. arXiv:https://doi.org/10.1108/07378830210452613",
      "doi": ""
    }
  ]
}