{
  "doi": "10.1145/3290605.3300798",
  "title": "Tool Extension in Human-Computer Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Tool use extends people's representations of the immediately actionable space around them. Physical tools thereby become integrated in people's body schemas. We introduce a measure for tool extension in HCI by using a visual-tactile interference paradigm. In this paradigm, an index of tool extension is given by response time differences between crossmodally congruent and incongruent stimuli; tactile on the hand and visual on the tool. We use this measure to examine if and how findings on tool extension apply to interaction with computer-based tools. Our first experiment shows that touchpad and mouse both provide tool extension over a baseline condition without a tool. A second experiment shows a higher degree of tool extension for a realistic avatar hand compared to an abstract pointer for interaction in virtual reality. In sum, our measure can detect tool extension with computer-based tools and differentiate interfaces by their degree of extension.",
  "authors": [
    {
      "name": "Joanna Bergström",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367232",
      "orcid": "0000-0001-6764-5661"
    },
    {
      "name": "Aske Mottelson",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99659021580/rel-imgonly/xx.jpg",
      "acmid": "99659021580",
      "orcid": "missing"
    },
    {
      "name": "Andreea Muresan",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367098",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Ayman Alzayat, Mark Hancock, and Miguel A. Nacenta. 2017. Measuring Readiness-to-Hand Through Differences in Attention to the Task vs. Attention to the Tool. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY,USA,42--51.  ",
      "doi": "10.1145/3132272.3134114"
    },
    {
      "text": "Jakob E Bardram and Olav W Bertelsen. 1995. Supporting the development of transparent interaction. In International Conference on Human-Computer Interaction. Springer, 79--90. ",
      "doi": "10.5555/646183.682900"
    },
    {
      "text": "Michela Bassolino, Andrea Serino, Silvia Ubaldi, and Elisabetta Làdavas. 2010. Everyday use of the computer mouse extends peripersonal space representation. Neuropsychologia 48, 3 (2010), 803--811.",
      "doi": ""
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta,David Coyle,Jarrod Knibbe,and Kasper Hornbæk. 2018. I Really Did That: Sense of Agency with Touchpad, Keyboard, and On-skin Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 378, 8 pages.  ",
      "doi": "10.1145/3173574.3173952"
    },
    {
      "text": "Monica Biggio,Ambr aBisio,Laura Avanzino,Piero Ruggeri,and Marco Bove. 2017. This racket is not mine: The influence of the tool-use on peripersonal space. Neuropsychologia 103 (2017), 54--58.",
      "doi": ""
    },
    {
      "text": "Olaf Blanke. 2012. Multisensory brain mechanisms of bodily self-consciousness. Nature Reviews Neuroscience 13, 8 (2012), 556.",
      "doi": ""
    },
    {
      "text": "Emily K Bloesch, Christopher C Davoli, Noam Roth, James R Brockmole, and Richard A Abrams. 2012. Watch this! Observed tool use affects perceived distance. Psychonomic Bulletin & Review 19, 2 (2012), 177--183.",
      "doi": ""
    },
    {
      "text": "Daniel Blustein, Adam Wilson, and Jon Sensinger. 2018. Assessing the quality of supplementary sensory feedback using the crossmodal congruency task. Scientific reports 8, 1 (2018), 6203.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 1991. Through the interface-A human activity approach to user interface design. DAIMI Report Series 16, 224 (1991). ",
      "doi": "10.5555/532624"
    },
    {
      "text": "John Brooke et al. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Lucilla Cardinali, Francesca Frassinetti, Claudio Brozzoli, Christian Urquizar, Alice C Roy, and Alessandro Farnè. 2009. Tool-use induces morphological updating of the body schema. Current Biology 19, 12 (2009), R478--R479.",
      "doi": ""
    },
    {
      "text": "Patricia I. Cornelio Martinez, Emanuela Maggioni, Kasper Hornbæk, Marianna Obrist, and Sriram Subramanian. 2018. Beyond the Libet Clock: Modality Variants for Agency Measurements. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 541, 14 pages.  ",
      "doi": "10.1145/3173574.3174115"
    },
    {
      "text": "David Coyle, James Moore, Per Ola Kristensson, Paul Fletcher, and Alan Blackwell. 2012. I Did That! Measuring Users' Experience of Agency in Their Own Actions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2025--2034.  ",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Tiare Feuchtner and Jörg Müeller. 2017. Extending the body for interaction with reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5145--5157.  ",
      "doi": "10.1145/3025453.3025689"
    },
    {
      "text": "Giulia Galli, Jean Paul Noel, Elisa Canzoneri, Olaf Blanke, and Andrea Serino. 2015. The wheelchair as a full-body tool extending the peripersonal space. Frontiers in psychology 6 (2015), 639.",
      "doi": ""
    },
    {
      "text": "Georg Goldenberg and Atsushi Iriki. 2007. From Sticks To Coffee-Maker: Mastery of Tools and Technology by Human and Non-Human Primates. Cortex 43, 3 (2007), 285--288.",
      "doi": ""
    },
    {
      "text": "Arvid Guterstam, Joanna Szczotka, Hugo Zeberg, and H Henrik Ehrsson. 2018. Tool use changes the spatial extension of the magnetic touch illusion. Journal of Experimental Psychology: General 147, 2 (2018), 298.",
      "doi": ""
    },
    {
      "text": "Antal Haans and Wijnand A. IJsselsteijn. 2012. Embodi- ment and telepresence: Toward a comprehensive theoretical framework. Interacting with Computers 24, 4 (2012), 211--218.  ",
      "doi": "10.1016/j.intcom.2012.04.010"
    },
    {
      "text": "A. Haans, W. A. Ijsselsteijn, and Y. A. de Kort. 2008. The effect of similarities in skin texture and hand shape on perceived ownership of a fake limb. Body Image 5, 4 (Dec 2008), 389--394.",
      "doi": ""
    },
    {
      "text": "Nicholas P Holmes. 2012. Does tool use extend peripersonal space? A review and re-analysis. Experimental brain research 218, 2 (2012), 273--282.",
      "doi": ""
    },
    {
      "text": "Nicholas P Holmes, Gemma A Calvert, and Charles Spence. 2004. Extending or projecting peripersonal space with tools? Multisensory interactions highlight only the distal and proximal ends of tools. Neuroscience letters 372, 1--2 (2004), 62--67.",
      "doi": ""
    },
    {
      "text": "Nicholas P Holmes and Charles Spence.2006.Beyond the body schema: Visual, prosthetic, and technological contributions to bodily perception and awareness. Human body perception from the inside out (2006), 15--64.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5040--5052.  ",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Atsushi Iriki, Michio Tanaka, and Yoshiaki Iwamura. 1996. Coding of modified body schema during tool use by macaque postcentral neurones. Neuroreport 7, 14 (1996), 2325--2330.",
      "doi": ""
    },
    {
      "text": "David Kirsh. 2013. Embodied Cognition and the Magical Future of Interaction Design. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 3(April2013),30pages.  ",
      "doi": "10.1145/2442106.2442109"
    },
    {
      "text": "Angelo Maravita.2006.From \"body in the brain\" to \"body in space\". Sensory and intentional components of body representation. In G. Knoblich & al., Human body perception from the inside out (pp. 65--88) (2006).",
      "doi": ""
    },
    {
      "text": "Angelo Maravita and Atsushi Iriki. 2004. Tools for the body (schema). Trends in cognitive sciences 8, 2 (2004), 79--86.",
      "doi": ""
    },
    {
      "text": "Angelo Maravita, Charles Spence, Steffan Kennett, and Jon Driver. 2002. Tool-use changes multimodal spatial interactions between vision and touch in normal humans. Cognition 83, 2 (2002), B25--B34.",
      "doi": ""
    },
    {
      "text": "Antonella Maselli and Mel Slater. 2013. The building blocks of the full body ownership illusion. Frontiers in Human Neuroscience 7 (2013), 83.",
      "doi": ""
    },
    {
      "text": "Bonnie A Nardi. 1996. Context and consciousness: activity theory and human-computer interaction. mit Press. ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Francesco Pavani and Umberto Castiello. 2004. Binding personal and extrapersonal space through body shadows. Nature neuroscience 7, 1 (2004), 14.",
      "doi": ""
    },
    {
      "text": "Francesco Pavani, Charles Spence, and Jon Driver. 2000. Visual capture of touch: Out-of-the-body experiences with rubber gloves. Psychological science 11, 5 (2000), 353--359.",
      "doi": ""
    },
    {
      "text": "Daniel Perez-Marcos, Maria V Sanchez-Vives, and Mel Slater. 2012. Is my hand connected to my body? The impact of body continuity and arm alignment on the virtual hand illusion. Cognitive neurodynamics 6, 4 (2012), 295--305.",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Cagri Tasci, Patrick Franczak, Nico Haas, and Niels Henze. 2017. These are not my hands!: Effect of Gender on the Perception of Avatar Hands in Virtual Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1577--1582.  ",
      "doi": "10.1145/3025453.3025602"
    },
    {
      "text": "Ali Sengül, Michiel Van Elk, Giulio Rognini, Jane Elizabeth Aspell, Hannes Bleuler, and Olaf Blanke. 2012. Extending the body to virtual tools using a robotic surgical interface: evidence from the crossmodal congruency task. PloS one 7, 12 (2012), e49473.",
      "doi": ""
    },
    {
      "text": "Andrea Serino, Michela Bassolino, Alessandro Farne, and Elisabetta Ladavas. 2007. Extended multisensory space in blind cane users. Psychological science 18, 7 (2007), 642--648.",
      "doi": ""
    },
    {
      "text": "Charles Spence. 2011. Crossmodal correspondences: A tutorial review. Attention, Perception, & Psychophysics 73, 4 (01 May 2011), 971--995.",
      "doi": ""
    },
    {
      "text": "Daniel Wigdor and Dennis Wixon. 2011. Brave NUI world: designing natural user interfaces for touch and gesture. Elsevier. ",
      "doi": "10.5555/1995309"
    },
    {
      "text": "Jessica K Witt, Dennis R Proffitt, and William Epstein. 2005. Tool use affects perceived distance, but only when you intend to use it. Journal of experimental psychology: Human perception and performance 31, 5 (2005), 880.",
      "doi": ""
    },
    {
      "text": "Regine Zopf, Greg Savage, and Mark A Williams. 2010. Crossmodal congruency measures of lateral distance effects on the rubber hand illusion. Neuropsychologia 48, 3 (2010), 713--725.",
      "doi": ""
    }
  ]
}