{
  "doi": "10.1145/3290605.3300601",
  "title": "Exploring Factors that Influence Connected Drivers to (Not) Use or Follow Recommended Optimal Routes",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Navigation applications are becoming ubiquitous in our daily navigation experiences. With the intention to circumnavigate congested roads, their route guidance always follows the basic assumption that drivers always want the fastest route. However, it is unclear how their recommendations are followed and what factors affect their adoption. We present the results of a semi-structured qualitative study with 17 drivers, mostly from the Philippines and Japan. We recorded their daily commutes and occasional trips, and inquired into their navigation practices, route choices and on-the-fly decision-making. We found that while drivers choose a recommended route in urgent situations, many still preferred to follow familiar routes. Drivers deviated because of a recommendation's use of unfamiliar roads, lack of local context, perceived driving unsuitability, and inconsistencies with realized navigation experiences. Our findings and implications emphasize their personalization needs, and how the right amount of algorithmic sophistication can encourage behavioral adaptation.",
  "tags": [
    "advanced driver-assistance system",
    "recommender systems",
    "navigation behavior",
    "navigation applications",
    "driving"
  ],
  "authors": [
    {
      "name": "Briane Paul V. Samson",
      "institution": "De La Salle University & Future University Hakodate, Hakodate, Hokkaido, Japan",
      "img": "/do/10.1145/contrib-99659319011/rel-imgonly/profile-smaller.jpg",
      "acmid": "99659319011",
      "orcid": "0000-0002-0253-452X"
    },
    {
      "name": "Yasuyuki Sumi",
      "institution": "Future University Hakodate, Hakodate, Japan",
      "img": "/do/10.1145/contrib-81100087571/rel-imgonly/sumi-pervasive.jpg",
      "acmid": "81100087571",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2018. Google Maps - GPS Navigation App Ranking and Store Data | App Annie. https://www.appannie.com/en/apps/ios/app/google-maps/",
      "doi": ""
    },
    {
      "text": "2018. Routing server. https://wazeopedia.waze.com/wiki/Global/ Routing_server",
      "doi": ""
    },
    {
      "text": "Heti Afimeimounga, Wiremu Solomon, and Ilze Ziedins. 2005. The Downs-Thomson Paradox: Existence, Uniqueness and Stability of User Equilibria. Queueing Systems 49, 3--4 (4 2005), 321--334.  ",
      "doi": "10.1007/s11134-005-6970-0"
    },
    {
      "text": "Wael Alghamdi and Tarek R.Sheltami. 2012. Context-Aware Driver Assistance System. Procedia Computer Science 10 (1 2012), 785--794.",
      "doi": ""
    },
    {
      "text": "Yasir Ali, Mohammad Saifuzzaman, Zuduo Zheng, and Mohammad Mazharul Haque. 2018. Human Factors in Modelling Mixed Traffic of Traditional, Connected, and Automated Vehicles. In Advances in Human Factors in Simulation and Modeling. Vol. 591. 262--273.",
      "doi": ""
    },
    {
      "text": "Vicki Antrobus, Gary Burnett, and Claudia Krehl. 2017. DriverPassenger Collaboration as a basis for Human-Machine Interface Design for Vehicle Navigation Systems. Ergonomics 60, 3 (3 2017), 321--332.",
      "doi": ""
    },
    {
      "text": "Maria Attard, Muki Haklay, and Cristina Capineri. 2016. The Potential of Volunteered Geographic Information (VGI) in Future Transport Systems. Urban Planning 1, 4 (2016), 6.",
      "doi": ""
    },
    {
      "text": "Eran Ben-Elia and Erel Avineri. 2015. Response to Travel Information: A Behavioural Review. Transport Reviews 35, 3 (2015), 352--377.",
      "doi": ""
    },
    {
      "text": "Dietrich Braess, Anna Nagurney, and Tina Wakolbinger. 2005. On a Paradox of Traffic Planning. TRANSPORTATION SCIENCE Unternehmensforschung 39, 12 (2005), 446--450.  ",
      "doi": "10.1287/trsc.1050.0127"
    },
    {
      "text": "Barry Brown and Eric Laurier. 2012. The normal natural troubles of driving with GPS. In Proceedings of the 2012 CHI Conference on Human Factors in Computing Systems - CHI '12. ACM, New York, New York, USA, 1621--1630.  ",
      "doi": "10.1145/2207676.2208285"
    },
    {
      "text": "Caspar G Chorus, Eric J E Molin, and Bert van Wee. 2006. Travel information as an instrument to change car drivers travel choices : a literature review. European Journal of Transport and Infrastructure Research 6, 4 (2006), 335--364.",
      "doi": ""
    },
    {
      "text": "Michael Correll, Dominik Moritz, and Jeffrey Heer. 2018. ValueSuppressing Uncertainty Palettes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--11.  ",
      "doi": "10.1145/3173574.3174216"
    },
    {
      "text": "Thomas A. Dingus, Melissa C. Hulse, Michael A. Mollenhauer, Rebecca N. Fleischman, Daniel V. Mcgehee, and Natarajan Manakkal. 1997. Effects of Age, System Experience, and Navigation Technique on Driving with an Advanced Traveler Information System. Human Factors: The Journal of the Human Factors and Ergonomics Society 39, 2 (1997), 177--199.",
      "doi": ""
    },
    {
      "text": "Michael D. Ekstrand, F. Maxwell Harper, Martijn C. Willemsen, and Joseph A. Konstan. 2014. User Perception of Differences in Recommender Algorithms. In Proceedings of the 8th ACM Conference on Recommender systems - RecSys '14. ACM Press, New York, New York, USA, 161--168.  ",
      "doi": "10.1145/2645710.2645737"
    },
    {
      "text": "Michael Fernandes, Logan Walls, Sean Munson, Jessica Hullman, and Matthew Kay. 2018. Uncertainty Displays Using Quantile Dotplots or CDFs Improve Transit Decision-Making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3173574.3173718"
    },
    {
      "text": "Jodi Forlizzi, William C. Barley, and Thomas Seder. 2010. Where should i turn. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, New York, New York, USA, 1261.  ",
      "doi": "10.1145/1753326.1753516"
    },
    {
      "text": "Takumi Fujino, Atsushi Hashimoto, Hidekazu Kasahara, Mikihiko Mori, Masaaki Iiyama, and Michihiko Minoh. 2018. Detecting Deviations from Intended Routes Using Vehicular GPS Tracks. ACM Transactions on Spatial Algorithms and Systems 4, 1 (6 2018), 1--21.  ",
      "doi": "10.1145/3204455"
    },
    {
      "text": "Rong Hu and Pearl Pu. 2010. A Study on User Perception of PersonalityBased Recommender Systems. In User Modeling, Adaptation, and Personalization. UMAP 2010. Lecture Notes in Computer Science, vol 6075. 291--302.  ",
      "doi": "10.1007/978-3-642-13470-8_27"
    },
    {
      "text": "J.D. Power. 2012. Vehicle Owners Ask for Smartphone Integration and Better Voice Controls, as Satisfaction with Factory-Installed Navigation Systems Declines. Technical Report. J.D. Power. www.jdpower.com/ corporate",
      "doi": ""
    },
    {
      "text": "J.D. Power. 2017. Improvements Needed on Navigation Systems, J.D. Power Finds. Technical Report. J.D. Power. www.jdpower.com/ about-us/press-release-info",
      "doi": ""
    },
    {
      "text": "Nihan Karatas, Soshi Yoshikawa, P. Ravindra De Silva, and Michio Okada. 2016. NAMIDA: How to Reduce the Cognitive Workload of Driver. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction. IEEE Press, 651. https://dl.acm.org/citation.cfm?id= ",
      "doi": "10.5555/2906831.2906921"
    },
    {
      "text": "Bart P Knijnenburg, Martijn C Willemsen, Zeno Gantner, Hakan Soncu, and Chris Newell. 2012. Explaining the user experience of recommender systems. User Modeling and User-Adapted Interaction 22 (2012), 441--504.  ",
      "doi": "10.1007/s11257-011-9118-4"
    },
    {
      "text": "Uri Levine, Amir Shinar, and Ehud Shabtai. 2014. System and Method for Realtime Community Information Exchange., 12 pages. https://patentimages.storage.googleapis.com/8d/00/0a/ 75de486f22fbc1/US8762035.pdf",
      "doi": ""
    },
    {
      "text": "Shih-Chieh Lin, Chang-Hong Hsu, Walter Talamonti, Yunqi Zhang, Steve Oney, Jason Mars, and Lingjia Tang. 2018. Adasa. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press, New York, New York, USA, 531--542.  ",
      "doi": "10.1145/3242587.3242593"
    },
    {
      "text": "Abdullah Al Mahmud, Omar Mubin, and Suleman Shahid. 2009. User experience with in-car GPS navigation systems: comparing the young and elderly drivers. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 1--90.  ",
      "doi": "10.1145/1613858.1613962"
    },
    {
      "text": "Shomik Mehndiratta and Tatiana Peralta Quiros. 2017. Traffic jams, pollution, road crashes: Can technology end the woes of urban transport? http://blogs.worldbank.org/transport/ traffic-jams-pollution-road-crashes-can-technology-end-woes-urban-transport",
      "doi": ""
    },
    {
      "text": "Toru Mikami. 1978. CACS-Urban traffic control system featuring computer control. In National Computer Conference. www. computerhistory.org",
      "doi": ""
    },
    {
      "text": "Cristina Olaverri Monreal and Rosaldo J. F. Rossettit. 2014. Human Factors in Intelligent Transportation Systems. IEEE TRANSACTIONS ON INTELLIGENT TRANSPORTATION SYSTEMS 15, 4 (2014), 480.",
      "doi": ""
    },
    {
      "text": "Michael Muller. 2014. Curiosity, Creativity, and Surprise as Analytic Tools: Grounded Theory Method. In Ways of Knowing in HCI. Springer New York, New York, NY, 25--48.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Shion Guha, Eric P.S. Baumer, David Mimno, and N. Sadat Shami. 2016. Machine Learning and Grounded Theory Method. In Proceedings of the 19th International Conference on Supporting Group Work - GROUP '16. ACM Press, New York, New York, USA, 3--8.  ",
      "doi": "10.1145/2957276.2957280"
    },
    {
      "text": "Kayur Patel, Mike Y. Chen, Ian Smith, and James A. Landay. 2006. Personalizing routes. In Proceedings of the 19th annual ACM symposium on User interface software and technology - UIST '06. ACM, New York, New York, USA, 187--190.  ",
      "doi": "10.1145/1166253.1166282"
    },
    {
      "text": "David Peterson. 2018. Can you overcome the Einstellung Effect? - David L. Peterson -. https://davidpeterson.com/ can-overcome-einstellung-effect/",
      "doi": ""
    },
    {
      "text": "Bastian Pfleging, Alexander Meschtscherjakov, Stefan Schneegass, and Manfred Tscheligi. 2014. Experience Maps: Experience-Enhanced Routes for Car Navigation. In Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications - AutomotiveUI '14. ACM, New York, New York, USA, 1--6.  ",
      "doi": "10.1145/2667239.2667275"
    },
    {
      "text": "Qing Yang and Honggang Wang. 2015. Toward trustworthy vehicular social networks. IEEE Communications Magazine 53, 8 (8 2015), 42--47.",
      "doi": ""
    },
    {
      "text": "Daniele Quercia, Rossano Schifanella, and Luca Maria Aiello. 2014. The shortest path to happiness. In Proceedings of the 25th ACM conference on Hypertext and social media - HT '14. ACM Press, New York, New York, USA, 116--125.  ",
      "doi": "10.1145/2631775.2631799"
    },
    {
      "text": "Daisuke Sakamoto, Takanori Komatsu, and Takeo Igarashi. 2013. Voice augmented manipulation. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services - MobileHCI '13. ACM Press, New York, New York, USA, 69.  ",
      "doi": "10.1145/2493190.2493244"
    },
    {
      "text": "Wenjie Sha, Daehan Kwak, Badri Nath, and Liviu Iftode. 2013. Social vehicle navigation: integrating shared driving experience into vehicle navigation. In Proceedings of the 14th Workshop on Mobile Computing Systems and Applications - HotMobile '13. ACM Press, New York, New York, USA, 1.  ",
      "doi": "10.1145/2444776.2444798"
    },
    {
      "text": "T.H. Silva, C.S.F.S. Celes, J.B.B. Neto, V.F.S. Mota, F.D. da Cunha, A.P.G. Ferreira, A.I.J.T. Ribeiro, P.O.S. Vaz de Melo, J.M. Almeida, and A.A.F. Loureiro. 2016. Users in the urban sensing process: Challenges and research opportunities. Elsevier Inc. 45--95 pages.",
      "doi": ""
    },
    {
      "text": "Thiago H. Silva, Pedro O.S. Vaz De Melo, Aline Carneiro Viana, Jussara M. Almeida, Juliana Salles, and Antonio A.F. Loureiro. 2013. Traffic condition is more than colored lines on a map: Characterization of Waze alerts. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 8238 LNCS (2013), 309--318.  ",
      "doi": "10.1007/978-3-319-03260-3_27"
    },
    {
      "text": "Mads Soegaard and Rikke Friis Dam (Eds.). 2013. The Encyclopedia of Human-Computer Interaction (2 ed.). Interaction Design Foundation. https://www.interaction-design.org/literature/book/ the-encyclopedia-of-human-computer-interaction-2nd-ed",
      "doi": ""
    },
    {
      "text": "W. Tang and L. Cheng. 2016. Analyzing multiday route choice behavior of commuters using GPS data. Advances in Mechanical Engineering 8, 2 (2016), 1--11.",
      "doi": ""
    },
    {
      "text": "United Nations. 2017. Progress towards the Sustainable Development Goals. Report of the Secretary-General E/2017/66, May (2017), 19.",
      "doi": ""
    },
    {
      "text": "Peter Valdes-Dapena. 2016. Most drivers who own cars with built-in GPS systems use phones for directions. http://money.cnn.com/2016/ 10/10/autos/car-navigation-frustration/index.html",
      "doi": ""
    },
    {
      "text": "Vedran Vyroubal, Adam Stancic, and Ivan Grgurevic. 2016. Mobile devices as authentic and trustworthy sources in multi-agent systems. In 2016 39th International Convention on Information and Communication Technology, Electronics and Microelectronics (MIPRO). IEEE, 661--666.",
      "doi": ""
    },
    {
      "text": "Fangzhou Wang, Yang Li, Daisuke Sakamoto, and Takeo Igarashi. 2014. Hierarchical route maps for efficient navigation. In Proceedings of the 19th international conference on Intelligent User Interfaces - IUI '14. ACM Press, New York, New York, USA, 169--178.  ",
      "doi": "10.1145/2557500.2557514"
    },
    {
      "text": "Waze. 2016. Driver Satisfaction Index. Technical Report. Waze. https: //inbox-static.waze.com/driverindex.pdf",
      "doi": ""
    },
    {
      "text": "Kenton Williams, JosÃe Acevedo Flores, and Joshua Peters. 2014. Affective Robot Influence on Driver Adherence to Safety, Cognitive Load Reduction and Sociability. In Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications - AutomotiveUI '14. ACM Press, New York, New York, USA, 1--8.  ",
      "doi": "10.1145/2667317.2667342"
    },
    {
      "text": "Mengqi Wu. 2015. Hybrid user perception model: comparing users' perceptions toward collaborative, content-based, and hybrid recommender systems. Ph.D. Dissertation. Iowa State University. https: //lib.dr.iastate.edu/etd/14739",
      "doi": ""
    },
    {
      "text": "Xiao-feng Xie and Zun-jing Wang. 2015. An Empirical Study of Combining Participatory and Physical Sensing to Better Understand and Improve Urban Mobility Networks. Transportation Research Board 94th Annual Meeting (2015).",
      "doi": ""
    },
    {
      "text": "Shanjiang Zhu and David Levinson. 2015. Do People Use the Shortest Path? An Empirical Test of Wardrop's First Principle. PLoS ONE (2015).",
      "doi": ""
    }
  ]
}