{
  "doi": "10.1145/3290605.3300792",
  "title": "Cross-Device Taxonomy: Survey, Opportunities and Challenges of Interactions Spanning Across Multiple Devices",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-28",
  "year": 2019,
  "badges": [],
  "abstract": "Designing interfaces or applications that move beyond the bounds of a single device screen enables new ways to engage with digital content. Research addressing the opportunities and challenges of interactions with multiple devices in concert is of continued focus in HCI research. To inform the future research agenda of this field, we contribute an analysis and taxonomy of a corpus of 510 papers in the cross-device computing domain. For both new and experienced researchers in the field we provide: an overview, historic trends and unified terminology of cross-device research; discussion of major and under-explored application areas; mapping of enabling technologies; synthesis of key interaction techniques spanning across multiple devices; and review of common evaluation strategies. We close with a discussion of open issues. Our taxonomy aims to create a unified terminology and common understanding for researchers in order to facilitate and stimulate future cross-device research.",
  "authors": [
    {
      "name": "Frederik Brudy",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81502796016/rel-imgonly/photo-square-medium.jpg",
      "acmid": "81502796016",
      "orcid": "missing"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Roman Rädle",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81416608648/rel-imgonly/roman.jpeg",
      "acmid": "81416608648",
      "orcid": "missing"
    },
    {
      "name": "Chi-Jui Wu",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367002",
      "orcid": "missing"
    },
    {
      "name": "Steven Houben",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81502746220/rel-imgonly/steven.jpg",
      "acmid": "81502746220",
      "orcid": "0000-0002-9009-5706"
    },
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    },
    {
      "name": "Nicolai Marquardt",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    }
  ],
  "references": [
    {
      "text": "Hussein Ajam and Mu Mu. 2017. A Middleware to Enable Immersive Multi-Device Online TV Experience. In Adjunct Publication of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '17 Adjunct). ACM, New York, NY, USA, 27--32.  ",
      "doi": "10.1145/3084289.3089919"
    },
    {
      "text": "Dzmitry Aliakseyeu, Andrés Lucero, and Jean-Bernard Martens. 2008. Users' Quest for an Optimized Representation of a Multi-device Space. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, New York, NY, USA, 359--362.  ",
      "doi": "10.1145/1385569.1385633"
    },
    {
      "text": "Ole Andre Alsos and Dag Svanæs. 2006. Interaction Techniques for Using Handhelds and PCs Together in a Clinical Setting. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06). ACM, New York, NY, USA, 125--134.  ",
      "doi": "10.1145/1182475.1182489"
    },
    {
      "text": "Craig Anslow, Chris Rooney, Neesha Kodagoda, and William Wong. 2015. Police Analyst Workstation: Towards a Multi-Surface User Interface. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 307--311.  ",
      "doi": "10.1145/2817721.2823498"
    },
    {
      "text": "Nathalie Aquino, Jean Vanderdonckt, Nelly Condori-Fernández, Óscar Dieste, and Óscar Pastor. 2010. Usability Evaluation of Multidevice/Platform User Interfaces Generated by Model-driven Engineering. In Proceedings of the 2010 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '10). ACM, New York, NY, USA, Article 30, 10 pages.  ",
      "doi": "10.1145/1852786.1852826"
    },
    {
      "text": "Md Tanvir Islam Aumi, Sidhant Gupta, Mayank Goel, Eric Larson, and Shwetak Patel. 2013. DopLink: Using the Doppler Effect for Multi-device Interaction. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 583--586.  ",
      "doi": "10.1145/2493432.2493515"
    },
    {
      "text": "Sriram Karthik Badam and Niklas Elmqvist. 2014. PolyChrome: A Cross-Device Framework for Collaborative Web Visualization. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/2669485.2669518"
    },
    {
      "text": "Thomas Bader, Astrid Heck, and Jürgen Beyerer. 2010. Lift-anddrop: Crossing Boundaries in a Multi-display Environment by Airlift. In Proceedings of the International Conference on Advanced Visual Interfaces (AVI '10). ACM, New York, NY, USA, 139--146.  ",
      "doi": "10.1145/1842993.1843019"
    },
    {
      "text": "Caroline Baillard, Matthieu Fradet, Vincent Alleaume, Pierrick Jouet, and Anthony Laurent. 2017. Multi-device Mixed Reality TV: A Collaborative Experience with Joint Use of a Tablet and a Headset. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (VRST '17). ACM, New York, NY, USA, Article 67, 2 pages.  ",
      "doi": "10.1145/3139131.3141196"
    },
    {
      "text": "Rafael Ballagas, Meredith Ringel, Maureen Stone, and Jan Borchers. 2003. iStuff: A Physical User Interface Toolkit for Ubiquitous Computing Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 537--544.  ",
      "doi": "10.1145/642611.642705"
    },
    {
      "text": "Rafael Ballagas, Michael Rohs, Jennifer G Sheridan, and Jan Borchers. 2004. Byod: Bring your own device. In Proceedings of the Workshop on Ubiquitous Display Environments, Ubicomp, Vol. 2004.",
      "doi": ""
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In ACM International Conference on Interactive Tabletops & Surfaces (ITS '10). ACM, New York, NY, USA, 121--130.  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Jakob Bardram, Sofiane Gueddana, Steven Houben, and Søren Nielsen. 2012. ReticularSpaces: Activity-based Computing Support for Physically Distributed and Collaborative Smart Spaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2845--2854.  ",
      "doi": "10.1145/2207676.2208689"
    },
    {
      "text": "Marco Barsotti, Fabio Paternò, and Francesca Pulina. 2017. A Web Framework for Cross-device Gestures Between Personal Devices and Public Displays. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia (MUM '17). ACM, New York, NY, USA, 69--78.  ",
      "doi": "10.1145/3152832.3152858"
    },
    {
      "text": "Patrick Baudisch, Edward Cutrell, Dan Robbins, Mary Czerwinski, Peter Tandler, Benjamin Bederson, Alex Zierlinger, et al. 2003. Dragand-pop and drag-and-pick: Techniques for accessing remote screen content on touch-and pen-operated systems. In Proceedings of INTERACT, Vol. 3. 57--64.",
      "doi": ""
    },
    {
      "text": "Dominikus Baur, Sebastian Boring, and Steven Feiner. 2012. Virtual Projection: Exploring Optical Projection As a Metaphor for Multidevice Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1693--1702.  ",
      "doi": "10.1145/2207676.2208297"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2000. Instrumental Interaction: An Interaction Model for Designing post-WIMP User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 446--453.  ",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Michel Beaudouin-Lafon, Stephane Huot, Mathieu Nancel, Wendy Mackay, Emmanuel Pietriga, Romain Primet, Julie Wagner, Olivier Chapuis, Clement Pillias, James Eagan, Tony Gjerlufsen, and Clemens Klokmose. 2012. Multisurface Interaction in the WILD Room. Computer 45, 4 (apr 2012), 48--56.  ",
      "doi": "10.1109/MC.2012.110"
    },
    {
      "text": "Federico Bellucci, Giuseppe Ghiani, Fabio Paternò, and Carmen Santoro. 2011. Engineering JavaScript State Persistence of Web Applications Migrating Across Multiple Devices. In Proceedings of the 3rd ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '11). ACM, New York, NY, USA, 105--110.  ",
      "doi": "10.1145/1996461.1996502"
    },
    {
      "text": "Silvia Berti and Fabio Paternò. 2005. Migratory MultiModal Interfaces in MultiDevice Environments. In Proceedings of the 7th International Conference on Multimodal Interfaces (ICMI '05). ACM, New York, NY, USA, 92--99.  ",
      "doi": "10.1145/1088463.1088481"
    },
    {
      "text": "Enrico Bertini and Giuseppe Santucci. 2004. Modelling Internet Based Applications for Designing Multi-device Adaptive Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, New York, NY, USA, 252--256.  ",
      "doi": "10.1145/989863.989906"
    },
    {
      "text": "Guillaume Besacier, Julie Tournet, Nippun Goyal, Frank Cento, and Stacey D. Scott. 2014. Object and ARM Shadows: Visual Feedback for Cross Device Transfer. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 463--466.  ",
      "doi": "10.1145/2559206.2574832"
    },
    {
      "text": "Xiaojun Bi, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2011. Magic Desk: Bringing Multi-touch Surfaces into Desktop Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2511--2520.  ",
      "doi": "10.1145/1978942.1979309"
    },
    {
      "text": "Jacob T. Biehl and Brian P. Bailey. 2006. Improving Interfaces for Managing Applications in Multiple-device Environments. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, New York, NY, USA, 35--42.  ",
      "doi": "10.1145/1133265.1133273"
    },
    {
      "text": "Gaddi Blumrosen, Bracha Hod, Tal Anker, Danny Dolev, and Boris Rubinsky. 2010. Continuous Close-Proximity RSSI-Based Tracking in Wireless Sensor Networks. In Proceedings of the 2010 International Conference on Body Sensor Networks (BSN '10). IEEE Computer Society, Washington, DC, USA, 234--239.  ",
      "doi": "10.1109/BSN.2010.36"
    },
    {
      "text": "Susanne Bødker and Clemens Nylandsted Klokmose. 2012. Dynamics in Artifact Ecologies. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 448--457.  ",
      "doi": "10.1145/2399016.2399085"
    },
    {
      "text": "Sebastian Boring, Manuela Altendorfer, Gregor Broll, Otmar Hilliges, and Andreas Butz. 2007. Shoot & Copy: Phonecam-based Information Transfer from Public Displays Onto Mobile Phones. In Proceedings of the 4th International Conference on Mobile Technology, Applications, and Systems and the 1st International Symposium on Computer Human Interaction in Mobile Technology (Mobility '07). ACM, New York, NY, USA, 24--31.  ",
      "doi": "10.1145/1378063.1378068"
    },
    {
      "text": "Sebastian Boring, Dominikus Baur, Andreas Butz, Sean Gustafson, and Patrick Baudisch. 2010. Touch Projector: Mobile Interaction Through Video. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2287--2296.  ",
      "doi": "10.1145/1753326.1753671"
    },
    {
      "text": "Amira Bouabid, Sophie Lepreux, Christophe Kolski, and Clémentine Havrez. 2014. Context-sensitive and Collaborative Application for Distributed User Interfaces on Tabletops. In Proceedings of the 2014 Workshop on Distributed User Interfaces and Multimodal Interaction (DUI '14). ACM, New York, NY, USA, 23--26.  ",
      "doi": "10.1145/2677356.2677661"
    },
    {
      "text": "Andrew Bragdon, Rob DeLine, Ken Hinckley, and Meredith Ringel Morris. 2011. Code Space: Touch + Air Gesture Hybrid Interactions for Supporting Developer Meetings. In Proceedings of the ACM International Conference on Interactive Tabletops & Surfaces (ITS '11). ACM, New York, NY, USA, 212--221.  ",
      "doi": "10.1145/2076354.2076393"
    },
    {
      "text": "Frederik Brudy, Joshua Kevin Budiman, Steven Houben, and Nicolai Marquardt. 2018. Investigating the Role of an Overview Device in Multi-Device Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 300, 13 pages.  ",
      "doi": "10.1145/3173574.3173874"
    },
    {
      "text": "Frederik Brudy, Steven Houben, Nicolai Marquardt, and Yvonne Rogers. 2016. CurationSpace: Cross-Device Content Curation Using Instrumental Interaction. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/2992154.2992175"
    },
    {
      "text": "Frederik Brudy, David Ledo, Saul Greenberg, and Andreas Butz. 2014. Is Anyone Looking? Mitigating Shoulder Surfing on Public Displays Through Awareness and Protection. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, New York, NY, USA, Article 1, 6 pages.  ",
      "doi": "10.1145/2611009.2611028"
    },
    {
      "text": "Frederik Brudy, Suppachai Suwanwatcharachat, Wenyu Zhang, Steven Houben, and Nicolai Marquardt. 2018. EagleView: A Video Analysis Tool for Visualising and Querying Spatial Interactions of People and Devices. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (ISS '18). ACM, New York, NY, USA, 61--72.  ",
      "doi": "10.1145/3279778.3279795"
    },
    {
      "text": "Vannevar Bush. 1945. As we may think. Atlantic Monthly 176 (1945), 101--108.",
      "doi": ""
    },
    {
      "text": "Roberto Calderon, Michael Blackstock, Rodger Lea, Sidney Fels, Andre de Oliveira Bueno, and Junia Anacleto. 2014. RED: A Framework for Prototyping Multi-display Applications Using Web Technologies. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, New York, NY, USA, Article 148, 6 pages.  ",
      "doi": "10.1145/2611009.2611037"
    },
    {
      "text": "Bingyi Cao, Margarita Esponda, and Raúl Rojas. 2016. The Use of a Multi-Display System in University Classroom Lectures. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 427--432.  ",
      "doi": "10.1145/2992154.2996793"
    },
    {
      "text": "Jessica R. Cauchard. 2011. Mobile Multi-display Environments. In Proceedings of the 24th Annual ACM Symposium Adjunct on User Interface Software and Technology (UIST '11 Adjunct). ACM, New York, NY, USA, 39--42.  ",
      "doi": "10.1145/2046396.2046414"
    },
    {
      "text": "Jessica R. Cauchard, Markus Löchtefeld, Pourang Irani, Johannes Schoening, Antonio Krüger, Mike Fraser, and Sriram Subramanian. 2011. Visual Separation in Mobile Multi-display Environments. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 451-- 460.  ",
      "doi": "10.1145/2047196.2047256"
    },
    {
      "text": "Marta E. Cecchinato, Anna L. Cox, and Jon Bird. 2015. Working 9--5: Professional Differences in Email and Boundary Management Practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3989--3998.  ",
      "doi": "10.1145/2702123.2702537"
    },
    {
      "text": "Marta E. Cecchinato, Anna L. Cox, and Jon Bird. 2017. Always On(Line)?: User Experience of Smartwatches and Their Role Within Multi-Device Ecologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3557--3568.  ",
      "doi": "10.1145/3025453.3025538"
    },
    {
      "text": "Marta E. Cecchinato, Abigail Sellen, Milad Shokouhi, and Gavin Smyth. 2016. Finding Email in a Multi-Account, Multi-Device World. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1200--1210.  ",
      "doi": "10.1145/2858036.2858473"
    },
    {
      "text": "Augusto Celentano and Emmanuel Dubois. 2015. A Design Space for Exploring Rich and Complex Information Environments. In Proceedings of the 11th Biannual Conference on Italian SIGCHI Chapter (CHItaly 2015). ACM, New York, NY, USA, 34--41.  ",
      "doi": "10.1145/2808435.2808444"
    },
    {
      "text": "Augusto Celentano and Emmanuel Dubois. 2017. Interaction-in-thelarge vs Interaction-in-the-small in Multi-device Systems. In Proceedings of the 12th Biannual Conference on Italian SIGCHI Chapter (CHItaly '17). ACM, New York, NY, USA, Article 19, 10 pages.  ",
      "doi": "10.1145/3125571.3125577"
    },
    {
      "text": "Matthew Chalmers and Areti Galani. 2004. Seamful Interweaving: Heterogeneity in the Theory and Design of Interactive Systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04). ACM, New York, NY, USA, 243--252.  ",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Li-Wei Chan, Hsiang-Tao Wu, Hui-Shan Kao, Ju-Chun Ko, HomeRu Lin, Mike Y. Chen, Jane Hsu, and Yi-Ping Hung. 2010. Enabling Beyond-surface Interactions for Interactive Surface with an Invisible Projection. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 263--272.  ",
      "doi": "10.1145/1866029.1866072"
    },
    {
      "text": "Tsung-Hsiang Chang and Yang Li. 2011. Deep Shot: A Framework for Migrating Tasks Across Devices Using Mobile Phone Cameras. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2163--2172.  ",
      "doi": "10.1145/1978942.1979257"
    },
    {
      "text": "Sven Charleer, Joris Klerkx, Erik Duval, Tinne De Laet, and Katrien Verbert. 2016. Faceted Search on Coordinated Tablets and Tabletop: A Comparison. In Proceedings of the 8th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '16). ACM, New York, NY, USA, 165--170.  ",
      "doi": "10.1145/2933242.2935867"
    },
    {
      "text": "Debaleena Chattopadhyay, Kenton O'Hara, Sean Rintel, and Roman Rädle. 2016. Office Social: Presentation Interactivity for Nearby Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2487--2491.  ",
      "doi": "10.1145/2858036.2858337"
    },
    {
      "text": "Ke-Yu Chen, Daniel Ashbrook, Mayank Goel, Sung-Hyuck Lee, and Shwetak Patel. 2014. AirLink: Sharing Files Between Multiple Devices Using In-air Gestures. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 565--569.  ",
      "doi": "10.1145/2632048.2632090"
    },
    {
      "text": "Min-Yu Chen, Chi-Wei Liu, and Min-Shiang Hwang. 2013. SecureDropbox: A File Encryption System Suitable for Cloud Storage Services. In Proceedings of the 2013 ACM Cloud and Autonomic Computing Conference (CAC '13). ACM, New York, NY, USA, Article 21, 2 pages.  ",
      "doi": "10.1145/2494621.2494642"
    },
    {
      "text": "Nicholas Chen, Francois Guimbretiere, and Abigail Sellen. 2012. Designing a Multi-slate Reading Environment to Support Active Reading Activities. ACM Trans. Comput.-Hum. Interact. 19, 3, Article 18 (oct 2012), 35 pages.  ",
      "doi": "10.1145/2362364.2362366"
    },
    {
      "text": "Nicholas Chen, François Guimbretière, and Abigail Sellen. 2013. Graduate Student Use of a Multi-slate Reading System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1799--1808.  ",
      "doi": "10.1145/2470654.2466237"
    },
    {
      "text": "Xiang 'Anthony' Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Xiang 'Anthony' Chen and Yang Li. 2017. Improv: An Input Framework for Improvising Cross-Device Interaction by Demonstration. ACM Trans. Comput.-Hum. Interact. 24, 2, Article 15 (apr 2017), 21 pages.  ",
      "doi": "10.1145/3057862"
    },
    {
      "text": "Bin Cheng. 2012. Virtual Browser for Enabling Multi-device Web Applications. In Proceedings of the Workshop on Multi-device App Middleware (Multi-Device '12). ACM, New York, NY, USA, Article 3, 6 pages.  ",
      "doi": "10.1145/2405172.2405175"
    },
    {
      "text": "Jorge H. dos S. Chernicharo, Kazuki Takashima, and Yoshifumi Kitamura. 2013. Seamless Interaction Using a Portable Projector in Perspective Corrected Multi Display Environments. In Proceedings of the 1st Symposium on Spatial User Interaction (SUI '13). ACM, New York, NY, USA, 25--32.  ",
      "doi": "10.1145/2491367.2491375"
    },
    {
      "text": "Pei-Yu (Peggy) Chi and Yang Li. 2015. Weave: Scripting Cross-Device Wearable Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3923--3932.  ",
      "doi": "10.1145/2702123.2702451"
    },
    {
      "text": "Apoorve Chokshi, Teddy Seyed, Francisco Marinho Rodrigues, and Frank Maurer. 2014. ePlan Multi-Surface: A Multi-Surface Environment for Emergency Response Planning Exercises. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 219--228.  ",
      "doi": "10.1145/2669485.2669520"
    },
    {
      "text": "Ming Ki Chong and Hans Gellersen. 2011. How Users Associate Wireless Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1909--1918.  ",
      "doi": "10.1145/1978942.1979219"
    },
    {
      "text": "Ming Ki Chong and Hans W. Gellersen. 2013. How Groups of Users Associate Wireless Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1559--1568.  ",
      "doi": "10.1145/2470654.2466207"
    },
    {
      "text": "Ming Ki Chong, Rene Mayrhofer, and Hans Gellersen. 2014. A Survey of User Interaction for Spontaneous Device Association. ACM Comput. Surv. 47, 1, Article 8 (July 2014), 40 pages.  ",
      "doi": "10.1145/2597768"
    },
    {
      "text": "Haeyong Chung and Chris North. 2018. SAViL: Cross-display Visual Links for Sensemaking in Display Ecologies. Personal Ubiquitous Comput. 22, 2 (apr 2018), 409--431.  ",
      "doi": "10.1007/s00779-017-1091-4"
    },
    {
      "text": "Haeyong Chung, Chris North, Jessica Zeitz Self, Sharon Chu, and Francis Quek. 2014. VisPorter: Facilitating Information Sharing for Collaborative Sensemaking on Multiple Displays. Personal Ubiquitous Comput. 18, 5 (jun 2014), 1169--1186.  ",
      "doi": "10.1007/s00779-013-0727-2"
    },
    {
      "text": "Christopher Clarke, Alessio Bellino, Augusto Esteves, Eduardo Velloso, and Hans Gellersen. 2016. TraceMatch: A Computer Vision Technique for User Input by Tracing of Animated Controls. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 298--303.  ",
      "doi": "10.1145/2971648.2971714"
    },
    {
      "text": "Dane Coffey, Nicholas Malbraaten, Trung Le, Iman Borazjani, Fotis Sotiropoulos, and Daniel F. Keefe. 2011. Slice WIM: A Multi-surface, Multi-touch Interface for Overview+Detail Exploration of Volume Datasets in Virtual Reality. In Symposium on Interactive 3D Graphics and Games (I3D '11). ACM, New York, NY, USA, 191--198.  ",
      "doi": "10.1145/1944745.1944777"
    },
    {
      "text": "Valentina Conotter, Guido Grassel, and Francesco De Natale. 2014. Multi-device Interaction for Content Sharing. In Proceedings of the 1st International Workshop on Emerging Multimedia Applications and Services for Smart Cities (EMASC '14). ACM, New York, NY, USA, 29--34.  ",
      "doi": "10.1145/2661704.2661705"
    },
    {
      "text": "Christian Corsten, Ignacio Avellino, Max Möllers, and Jan Borchers. 2013. Instant User Interfaces: Repurposing Everyday Objects As Input Devices. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops & Surfaces (ITS '13). ACM, New York, NY, USA, 71--80.  ",
      "doi": "10.1145/2512349.2512799"
    },
    {
      "text": "Raimund Dachselt and Robert Buchholz. 2009. Natural Throw and Tilt Interaction Between Mobile Phones and Distant Displays. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 3253--3258.  ",
      "doi": "10.1145/1520340.1520467"
    },
    {
      "text": "Chi Tai Dang and Elisabeth André. 2014. A Framework for the Development of Multi-display Environment Applications Supporting Interactive Real-time Portals. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/2607023.2607038"
    },
    {
      "text": "Elena de la Guía, María Lozano, and Victor R. Penichet. 2013. TrainAb: A Solution Based on Tangible and Distributed User Interfaces to Improve Cognitive Disabilities. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3039--3042.  ",
      "doi": "10.1145/2468356.2479605"
    },
    {
      "text": "Elena de la Guía, María Dolores Lozano, and Víctor M. R. Penichet. 2014. Increasing Engagement in Elderly People Through Tangible and Distributed User Interfaces. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '14). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 390--393.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.255361"
    },
    {
      "text": "Elena de la Guía, María D. Lozano, and Victor M. R. Penichet. 2014. Interacting with Tangible Objects in Distributed Settings. In Proceedings of the 2014 Workshop on Distributed User Interfaces and Multimodal Interaction (DUI '14). ACM, New York, NY, USA, 15--18.  ",
      "doi": "10.1145/2677356.2677659"
    },
    {
      "text": "David Dearman, Richard Guy, and Khai Truong. 2012. Determining the Orientation of Proximate Mobile Devices Using Their Back Facing Camera. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2231--2234.  ",
      "doi": "10.1145/2207676.2208377"
    },
    {
      "text": "David Dearman and Jeffery S. Pierce. 2008. It's on My Other Computer!: Computing with Multiple Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 767--776.  ",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Alexandre Demeure, Gaëlle Calvary, Jean-Sebastien Sottet, and Jean Vanderdonkt. 2005. A Reference Model for Distributed User Interfaces. In Proceedings of the 4th International Workshop on Task Models and Diagrams (TAMODIA '05). ACM, New York, NY, USA, 79--86.  ",
      "doi": "10.1145/1122935.1122952"
    },
    {
      "text": "Anind K. Dey, Peter Ljungstrand, and Albrecht Schmidt. 2001. Distributed and Disappearing User Interfaces in Ubiquitous Computing. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, New York, NY, USA, 487--488.  ",
      "doi": "10.1145/634067.634346"
    },
    {
      "text": "Linda Di Geronimo, Marica Bertarini, Julia Badertscher, Maria Husmann, and Moira C. Norrie. 2017. MyoShare: Sharing Data Among Devices via Mid-air Gestures. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 48, 3 pages.  ",
      "doi": "10.1145/3098279.3125436"
    },
    {
      "text": "Linda Di Geronimo, Maria Husmann, and Moira C. Norrie. 2016. Surveying Personal Device Ecosystems with Cross-device Applications in Mind. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, New York, NY, USA, 220--227.  ",
      "doi": "10.1145/2914920.2915028"
    },
    {
      "text": "Linda Di Geronimo and Moira C. Norrie. 2016. Rapid Development of Web Applications That Use Tilting Interactions in Single and MultiDevice Scenarios. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '16). ACM, New York, NY, USA, 354--355.  ",
      "doi": "10.1145/2909132.2926088"
    },
    {
      "text": "Jakub Dostal. 2013. Designing Context-aware Display Ecosystems. In Proceedings of the Companion Publication of the 2013 International Conference on Intelligent User Interfaces Companion (IUI '13 Companion). ACM, New York, NY, USA, 1--4.  ",
      "doi": "10.1145/2451176.2451178"
    },
    {
      "text": "Jakub Dostal, Per Ola Kristensson, and Aaron Quigley. 2013. Subtle Gaze-dependent Techniques for Visualising Display Changes in Multi-display Environments. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, New York, NY, USA, 137--148.  ",
      "doi": "10.1145/2449396.2449416"
    },
    {
      "text": "Paul Dourish. 2004. Where the Action Is (new ed edition ed.). MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "John Dowell and Edward Anstead. 2017. Interaction with a TV Companion App As Synopsis and Supplement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2264--2268.  ",
      "doi": "10.1145/3025453.3025459"
    },
    {
      "text": "John Dowell, Sylvain Malacria, Hana Kim, and Edward Anstead. 2015. Companion Apps for Information-rich Television Programmes: Representation and Interaction. Personal Ubiquitous Comput. 19, 7 (oct 2015), 1215--1228.  ",
      "doi": "10.1007/s00779-015-0867-7"
    },
    {
      "text": "Niklas Elmqvist. 2011. Distributed User Interfaces: State of the Art. Springer London, London, 1--12.",
      "doi": ""
    },
    {
      "text": "Habib M. Fardoun, Abdullah AL-Malaise AL-Ghamdi, and Antonio Paules Cipres. 2014. Improving Surgery Operations by Means of Cloud Systems and Distributed User Interfaces. In Proceedings of the 2014 Workshop on Distributed User Interfaces and Multimodal Interaction (DUI '14). ACM, New York, NY, USA, 31--36.  ",
      "doi": "10.1145/2677356.2677663"
    },
    {
      "text": "Camille Fayollas, Célia Martinie, David Navarre, Philippe Palanque, and Racim Fahssi. 2014. Fault-Tolerant User Interfaces for Critical Systems: Duplication, Redundancy and Diversity As New Dimensions of Distributed User Interfaces. In Proceedings of the 2014 Workshop on Distributed User Interfaces and Multimodal Interaction (DUI '14). ACM, New York, NY, USA, 27--30.  ",
      "doi": "10.1145/2677356.2677662"
    },
    {
      "text": "Shenfeng Fei, Andrew M. Webb, Andruid Kerne, Yin Qu, and Ajit Jain. 2013. Peripheral Array of Tangible NFC Tags: Positioning Portals for Embodied Trans-surface Interaction. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops & Surfaces (ITS '13). ACM, New York, NY, USA, 33--36.  ",
      "doi": "10.1145/2512349.2512820"
    },
    {
      "text": "George W. Fitzmaurice. 1993. Situated Information Spaces and Spatially Aware Palmtop Computers. Commun. ACM 36, 7 (jul 1993), 39--49.  ",
      "doi": "10.1145/159544.159566"
    },
    {
      "text": "Clifton Forlines, Alan Esenther, Chia Shen, Daniel Wigdor, and Kathy Ryall. 2006. Multi-user, Multi-display Interaction with a Single-user, Single-display Geospatial Application. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 273--276.  ",
      "doi": "10.1145/1166253.1166296"
    },
    {
      "text": "Clifton Forlines and Ryan Lilien. 2008. Adapting a Single-user, Singledisplay Molecular Visualization Application for Use in a Multi-user, Multi-display Environment. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, New York, NY, USA, 367--371.  ",
      "doi": "10.1145/1385569.1385635"
    },
    {
      "text": "Luca Frosini and Fabio Paternò. 2014. User Interface Distribution in Multi-device and Multi-user Environments with Dynamically Migrating Engines. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 55--64.  ",
      "doi": "10.1145/2607023.2607032"
    },
    {
      "text": "Johannes Fuchs, Roman Rädle, Dominik Sacha, Fabian Fischer, and Andreas Stoffel. 2013. Collaborative data analysis with smart tangible devices. In Proc. SPIE, Vol. 9017. 15.",
      "doi": ""
    },
    {
      "text": "Andrea Gallidabino and Cesare Pautasso. 2016. The Liquid.Js Framework for Migrating and Cloning Stateful Web Components Across Multiple Devices. In Proceedings of the 25th International Conference Companion on World Wide Web (WWW '16 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 183--186.  ",
      "doi": "10.1145/2872518.2890538"
    },
    {
      "text": "Andrea Gallidabino and Cesare Pautasso. 2018. The Liquid User Experience API. In Companion Proceedings of the The Web Conference 2018 (WWW '18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 767--774.  ",
      "doi": "10.1145/3184558.3188738"
    },
    {
      "text": "Hans Gellersen, Carl Fischer, Dominique Guinard, Roswitha Gostner, Gerd Kortuem, Christian Kray, Enrico Rukzio, and Sara Streng. 2009. Supporting Device Discovery and Spontaneous Interaction with Spatial References. Personal Ubiquitous Comput. 13, 4 (may 2009), 255--264.  ",
      "doi": "10.1007/s00779-008-0206-3"
    },
    {
      "text": "Florian Geyer, Hans-Christian Jetter, Ulrike Pfeil, and Harald Reiterer. 2010. Collaborative Sketching with Distributed Displays and Multimodal Interfaces. In ACM International Conference on Interactive Tabletops & Surfaces (ITS '10). ACM, New York, NY, USA, 259--260.  ",
      "doi": "10.1145/1936652.1936705"
    },
    {
      "text": "Giuseppe Ghiani, Marco Manca, and Fabio Paternò. 2015. Authoring Context-dependent Cross-device User Interfaces Based on Trigger/Action Rules. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM '15). ACM, New York, NY, USA, 313--322.  ",
      "doi": "10.1145/2836041.2836073"
    },
    {
      "text": "Giuseppe Ghiani, Fabio Paternò, and Lorenzo Isoni. 2012. Security in Migratory Interactive Web Applications. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, New York, NY, USA, Article 15, 10 pages.  ",
      "doi": "10.1145/2406367.2406386"
    },
    {
      "text": "Giuseppe Ghiani, Fabio Paternò, and Carmen Santoro. 2010. Ondemand Cross-device Interface Components Migration. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 299--308.  ",
      "doi": "10.1145/1851600.1851653"
    },
    {
      "text": "Tony Gjerlufsen, Clemens Nylandsted Klokmose, James Eagan, Clément Pillias, and Michel Beaudouin-Lafon. 2011. Shared Substance: Developing Flexible Multi-surface Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3383--3392.  ",
      "doi": "10.1145/1978942.1979446"
    },
    {
      "text": "Mayank Goel, Brendan Lee, Md. Tanvir Islam Aumi, Shwetak Patel, Gaetano Borriello, Stacie Hibino, and Bo Begole. 2014. SurfaceLink: Using Inertial and Acoustic Sensing to Enable Multi-device Interaction on a Surface. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1387--1396.  ",
      "doi": "10.1145/2556288.2557120"
    },
    {
      "text": "Saul Greenberg, Sebastian Boring, Jo Vermeulen, and Jakub Dostal. 2014. Dark Patterns in Proxemic Interactions: A Critical Perspective. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 523--532.  ",
      "doi": "10.1145/2598510.2598541"
    },
    {
      "text": "Saul Greenberg, Michael Boyle, and Jason LaBerge. 1999. PDAs and shared public displays: Making personal information public, and public information personal. Personal Technologies 3, 1--2 (1999), 54-- 64.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability Evaluation Considered Harmful (Some of the Time). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 111--120.  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicomp? interactions 18, 1 (Jan. 2011), 42--50.  ",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Casey Grote, Evan Segreto, Johanna Okerlund, Robert Kincaid, and Orit Shaer. 2015. Eugenie: Multi-Touch and Tangible Interaction for Bio-Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 217--224.  ",
      "doi": "10.1145/2677199.2680605"
    },
    {
      "text": "Jens Grubert, Matthias Heinisch, Aaron Quigley, and Dieter Schmalstieg. 2015. MultiFi: Multi Fidelity Interaction with Displays On and Around the Body. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3933--3942.  ",
      "doi": "10.1145/2702123.2702331"
    },
    {
      "text": "Jens Grubert and Matthias Kranz. 2017. HeadPhones: Ad Hoc Mobile Multi-Display Environments Through Head Tracking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3966--3971.  ",
      "doi": "10.1145/3025453.3025533"
    },
    {
      "text": "Jens Grubert, Matthias Kranz, and Aaron Quigley. 2016. Challenges in mobile multi-device ecosystems. mUX: The Journal of Mobile User Experience 5, 1 (26 Aug 2016), 5.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 2001. Partitioning Digital Worlds: Focal and Peripheral Awareness in Multiple Monitor Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 458--465.  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "John Grundy and Weiguo Jin. 2002. Experiences Developing a Thinclient, Multi-device Travel Planning Application. In Proceedings of the SIGCHI-NZ Symposium on Computer-Human Interaction (CHINZ '02). ACM, New York, NY, USA, 85--90.  ",
      "doi": "10.1145/2181216.2181231"
    },
    {
      "text": "Jonathan Haber, Miguel A. Nacenta, and Sheelagh Carpendale. 2014. Paper vs. Tablets: The Effect of Document Media in Co-located Collaborative Work. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, New York, NY, USA, 89--96.  ",
      "doi": "10.1145/2598153.2598170"
    },
    {
      "text": "Edward Twitchell Hall. 1966. The Hidden Dimension (1st ed. ed.). Doubleday, Garden City, N.Y.",
      "doi": ""
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2773--2782.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Richard Han, Veronique Perret, and Mahmoud Naghshineh. 2000. WebSplitter: A Unified XML Framework for Multi-device Collaborative Web Browsing. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (CSCW '00). ACM, New York, NY, USA, 221--230.  ",
      "doi": "10.1145/358916.358993"
    },
    {
      "text": "David Hannah, Martin Halvey, Graham Wilson, and Stephen A. Brewster. 2011. Using Multimodal Interactions for 3D Television and Multimedia Browsing. In Proceedings of the 9th European Conference on Interactive TV and Video (EuroITV '11). ACM, New York, NY, USA, 181--184.  ",
      "doi": "10.1145/2000119.2000156"
    },
    {
      "text": "Robert Hardy and Enrico Rukzio. 2008. Touch & Interact: Touchbased Interaction of Mobile Phones with Displays. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08). ACM, New York, NY, USA, 245--254.  ",
      "doi": "10.1145/1409240.1409267"
    },
    {
      "text": "Björn Hartmann, Michel Beaudouin-Lafon, and Wendy E. Mackay. 2013. HydraScope: Creating Multi-surface Meta-applications Through View Synchronization and Input Multiplexing. In Proceedings of the 2nd ACM International Symposium on Pervasive Displays (PerDis '13). ACM, New York, NY, USA, 43--48.  ",
      "doi": "10.1145/2491568.2491578"
    },
    {
      "text": "Khalad Hasan, David Ahlström, and Pourang Irani. 2015. SAMMI: A Spatially-Aware Multi-Mobile Interface for Analytic Map Navigation Tasks. In Proceedings of the 17th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 36--45.  ",
      "doi": "10.1145/2785830.2785850"
    },
    {
      "text": "Nabeel Hassan, Md Mahfuzur Rahman, Pourang Irani, and Peter Graham. 2009. Chucking: A one-handed document sharing technique. In IFIP Conference on Human-Computer Interaction. Springer, 264--278.  ",
      "doi": "10.1007/978-3-642-03658-3_33"
    },
    {
      "text": "Mike Hazas, Christian Kray, Hans Gellersen, Henoc Agbota, Gerd Kortuem, and Albert Krohn. 2005. A Relative Positioning System for Co-located Mobile Devices. In Proceedings of the 3rd International Conference on Mobile Systems, Applications, and Services (MobiSys '05). ACM, New York, NY, USA, 177--190.  ",
      "doi": "10.1145/1067170.1067190"
    },
    {
      "text": "Tommi Heikkinen, Jorge Goncalves, Vassilis Kostakos, Ivan Elhart, and Timo Ojala. 2014. Tandem Browsing Toolkit: Distributed MultiDisplay Interfaces with Web Technologies. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, New York, NY, USA, Article 142, 6 pages.  ",
      "doi": "10.1145/2611009.2611026"
    },
    {
      "text": "Rorik Henrikson, Bruno Araujo, Fanny Chevalier, Karan Singh, and Ravin Balakrishnan. 2016. Multi-Device Storyboards for Cinematic Narratives in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 787--796.  ",
      "doi": "10.1145/2984511.2984539"
    },
    {
      "text": "J. Hightower and G. Borriello. 2001. Location systems for ubiquitous computing. Computer 34, 8 (Aug. 2001), 57--66.  ",
      "doi": "10.1109/2.940014"
    },
    {
      "text": "Ken Hinckley. 2003. Synchronous Gestures for Multiple Persons and Computers. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, New York, NY, USA, 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Ken Hinckley, Morgan Dixon, Raman Sarin, Francois Guimbretiere, and Ravin Balakrishnan. 2009. Codex: A Dual Screen Tablet Computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1933--1942.  ",
      "doi": "10.1145/1518701.1518996"
    },
    {
      "text": "Ken Hinckley, Gonzalo Ramos, Francois Guimbretiere, Patrick Baudisch, and Marc Smith. 2004. Stitching: Pen Gestures That Span Multiple Displays. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, New York, NY, USA, 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Daniel Hintze, Rainhard D. Findling, Muhammad Muaaz, Eckhard Koch, and René Mayrhofer. 2015. Cormorant: Towards Continuous Risk-aware Multi-modal Cross-device Authentication. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 169--172.  ",
      "doi": "10.1145/2800835.2800906"
    },
    {
      "text": "Lars Erik Holmquist, Friedemann Mattern, Bernt Schiele, Petteri Alahuhta, Michael Beigl, and Hans-Werner Gellersen. 2001. Smart-Its Friends: A Technique for Users to Easily Establish Connections Between Smart Artefacts. In Proceedings of the 3rd International Conference on Ubiquitous Computing (UbiComp '01). Springer-Verlag, London, UK, UK, 116--122. http://dl.acm.org/citation.cfm?id=647987. ",
      "doi": "10.5555/647987.741340"
    },
    {
      "text": "Christian Holz, Frank Bentley, Karen Church, and Mitesh Patel. 2015. \"I'm Just on My Phone and They're Watching TV\": Quantifying Mobile Device Use While Watching Television. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/2745197.2745210"
    },
    {
      "text": "Christian Holz and Frank R. Bentley. 2016. On-Demand Biometrics: Fast Cross-Device Authentication. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3761--3766.  ",
      "doi": "10.1145/2858036.2858139"
    },
    {
      "text": "Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 303--312.  ",
      "doi": "10.1145/2807442.2807458"
    },
    {
      "text": "Leila Homaeian, Nippun Goyal, James R. Wallace, and Stacey D. Scott. 2017. Investigating Communication Grounding in Cross-Surface Interaction. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 348--353.  ",
      "doi": "10.1145/3132272.3132282"
    },
    {
      "text": "Leila Homaeian, Nippun Goyal, James R. Wallace, and Stacey D. Scott. 2018. Group vs Individual: Impact of TOUCH and TILT Cross-Device Interactions on Mixed-Focus Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 73, 13 pages.  ",
      "doi": "10.1145/3173574.3173647"
    },
    {
      "text": "Tsz-Kin Hon, Lin Wang, Joshua D. Reiss, and Andrea Cavallaro. 2015. Audio Fingerprinting for Multi-device Self-localization. IEEE/ACM Trans. Audio, Speech and Lang. Proc. 23, 10 (oct 2015), 1623--1636.  ",
      "doi": "10.1109/TASLP.2015.2442417"
    },
    {
      "text": "Tom Horak, Sriram Karthik Badam, Niklas Elmqvist, and Raimund Dachselt. 2018. When David Meets Goliath: Combining Smartwatches with a Large Vertical Display for Visual Data Exploration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 19, 13 pages.  ",
      "doi": "10.1145/3173574.3173593"
    },
    {
      "text": "Tom Horak, Ulrike Kister, and Raimund Dachselt. 2016. Presenting Business Data: Challenges During Board Meetings in Multi-Display Environments. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 319--324.  ",
      "doi": "10.1145/2992154.2996774"
    },
    {
      "text": "Steven Houben and Jakob E. Bardram. 2013. ActivityDesk: Multidevice Configuration Work Using an Interactive Desk. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 721--726.  ",
      "doi": "10.1145/2468356.2468484"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WatchConnect: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1247--1256.  ",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Steven Houben, Nicolai Marquardt, Jo Vermeulen, Clemens Klokmose, Johannes Schöning, Harald Reiterer, and Christian Holz. 2017. Opportunities and Challenges for Cross-device Interactions in the Wild. interactions 24, 5 (Aug 2017), 58--63.  ",
      "doi": "10.1145/3121348"
    },
    {
      "text": "Steven Houben, Paolo Tell, and Jakob E. Bardram. 2014. ActivitySpace: Managing Device Ecologies in an Activity-Centric Configuration Space. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 119--128.  ",
      "doi": "10.1145/2669485.2669493"
    },
    {
      "text": "Steven Houben, Jo Vermeulen, Clemens Klokmose, Nicolai Marquardt, Johannes Schöning, and Harald Reiterer. 2015. Cross-Surface: Workshop on Interacting with Multi-Device Ecologies in the Wild. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 485--489.  ",
      "doi": "10.1145/2817721.2835067"
    },
    {
      "text": "Gang Hu, Derek Reilly, Mohammed Alnusayri, Ben Swinden, and Qigang Gao. 2014. DT-DT: Top-down Human Activity Analysis for Interactive Surface Applications. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 167--176.  ",
      "doi": "10.1145/2669485.2669501"
    },
    {
      "text": "Zhigang Hua, Yutaka Kidawara, Hanqing Lu, and Katsumi Tanaka. 2005. A Collaborative Environment for Enhanced Information Access on Small-form-factor Devices. In Proceedings of the 7th International Conference on Human Computer Interaction with Mobile Devices &Amp; Services (MobileHCI '05). ACM, New York, NY, USA, 325--326.  ",
      "doi": "10.1145/1085777.1085848"
    },
    {
      "text": "Da-Yuan Huang, Chien-Pang Lin, Yi-Ping Hung, Tzu-Wen Chang, Neng-Hao Yu, Min-Lun Tsai, and Mike Y. Chen. 2012. MagMobile: Enhancing Social Interactions with Rapid View-stitching Games of Mobile Devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, New York, NY, USA, Article 61, 4 pages.  ",
      "doi": "10.1145/2406367.2406440"
    },
    {
      "text": "Elaine M. Huang, Elizabeth D. Mynatt, and Jay P. Trimble. 2007. When Design Just Isn't Enough: The Unanticipated Challenges of the Real World for Large Collaborative Displays. Personal Ubiquitous Comput. 11, 7 (Oct 2007), 537--547.  ",
      "doi": "10.1007/s00779-006-0114-3"
    },
    {
      "text": "Maria Husmann. 2017. Investigating Tool Support for Cross-Device Development. Ph.D. Dissertation. ETH Zurich.",
      "doi": ""
    },
    {
      "text": "Maria Husmann, Nina Heyder, and Moira C. Norrie. 2016. Is a Framework Enough?: Cross-device Testing and Debugging. In Proceedings of the 8th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '16). ACM, New York, NY, USA, 251--262.  ",
      "doi": "10.1145/2933242.2933249"
    },
    {
      "text": "Maria Husmann, Nicola Marcacci Rossi, and Moira C. Norrie. 2016. Usage Analysis of Cross-device Web Applications. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, New York, NY, USA, 212--219.  ",
      "doi": "10.1145/2914920.2915017"
    },
    {
      "text": "Maria Husmann, Michael Spiegel, Alfonso Murolo, and Moira C. Norrie. 2016. UI Testing Cross-Device Applications. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 179--188.  ",
      "doi": "10.1145/2992154.2992177"
    },
    {
      "text": "Dugald Ralph Hutchings, Greg Smith, Brian Meyers, Mary Czerwinski, and George Robertson. 2004. Display Space Usage and Window Management Operation Comparisons Between Single Monitor and Multiple Monitor Users. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, New York, NY, USA, 32--39.  ",
      "doi": "10.1145/989863.989867"
    },
    {
      "text": "Heather M. Hutchings and Jeffrey S. Pierce. 2006. Understanding the Whethers, Hows, and Whys of Divisible Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, New York, NY, USA, 274--277.  ",
      "doi": "10.1145/1133265.1133320"
    },
    {
      "text": "Peter Hutterer, Benjamin S. Close, and Bruce H. Thomas. 2006. TIDL: Mixed Presence Groupware Support for Legacy and Custom Applications. In Proceedings of the 7th Australasian User Interface Conference - Volume 50 (AUIC '06). Australian Computer Society, Inc., Darlinghurst, Australia, Australia, 117--124. http://dl.acm.org/citation. cfm?id=1151758.1151775 ",
      "doi": "10.5555/1151758.1151775"
    },
    {
      "text": "Heidi Pi Jensen, Marius Pallisgaard Olsen, and Mikael B. Skov. 2016. PinchPan: Investigating Children's Collaboration in Cross-Device Interaction. In Proceedings of the 13th International Conference on Advances in Computer Entertainment Technology (ACE2016). ACM, New York, NY, USA, Article 9, 6 pages.  ",
      "doi": "10.1145/3001773.3001789"
    },
    {
      "text": "Mads Møller Jensen, Roman Rädle, Clemens N. Klokmose, and Susanne Bodker. 2018. Remediating a Design Tool: Implications of Digitizing Sticky Notes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 224, 12 pages.  ",
      "doi": "10.1145/3173574.3173798"
    },
    {
      "text": "Hans-Christian Jetter, Michael Zöllner, Jens Gerken, and Harald Reiterer. 2012. Design and implementation of post-WIMP distributed user interfaces with ZOIL. International Journal of Human-Computer Interaction 28, 11 (2012), 737--747.",
      "doi": ""
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbæk. 2015. Tracko: Adhoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 147--156.  ",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "Haojian Jin, Cheng Xu, and Kent Lyons. 2015. Corona: Positioning Adjacent Device with Asymmetric Bluetooth Low Energy RSSI Distributions. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 175--179.  ",
      "doi": "10.1145/2807442.2807485"
    },
    {
      "text": "Yucheng Jin, Chi Tai Dang, Christian Prehofer, and Elisabeth André. 2014. A Multi-Display System for Deploying and Controlling Home Automation. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 399--402.  ",
      "doi": "10.1145/2669485.2669553"
    },
    {
      "text": "Robert Johansen. 1988. GroupWare: Computer Support for Business Teams. The Free Press, New York, NY, USA. ",
      "doi": "10.5555/542298"
    },
    {
      "text": "Brad Johanson, Greg Hutchins, Terry Winograd, and Maureen Stone. 2002. PointRight: Experience with Flexible Input Redirection in Interactive Workspaces. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, New York, NY, USA, 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Brad Johanson, Shankar Ponnekanti, Caesar Sengupta, and Armando Fox. 2001. Multibrowsing: Moving Web Content Across Multiple Displays. In Proceedings of the 3rd International Conference on Ubiquitous Computing (UbiComp '01). Springer-Verlag, London, UK, UK, 346--353. http://dl.acm.org/citation.cfm?id=647987.741346 ",
      "doi": "10.5555/647987.741346"
    },
    {
      "text": "Tero Jokela, Jarno Ojala, Guido Grassel, Petri Piippo, and Thomas Olsson. 2015. A Comparison of Methods to Move Visual Objects Between Personal Mobile Devices in Different Contexts of Use. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 172--181.  ",
      "doi": "10.1145/2785830.2785841"
    },
    {
      "text": "Tero Jokela, Parisa Pour Rezaei, and Kaisa Väänänen. 2016. Natural Group Binding and Cross-display Object Movement Methods for Wearable Devices. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 206--216.  ",
      "doi": "10.1145/2935334.2935346"
    },
    {
      "text": "Rachel Jones, Sarah Clinch, Jason Alexander, Nigel Davies, and Mateusz Mikusz. 2015. ENGAGE: Early Insights in Measuring MultiDevice Engagements. In Proceedings of the 4th International Symposium on Pervasive Displays (PerDis '15). ACM, New York, NY, USA, 31--37.  ",
      "doi": "10.1145/2757710.2757720"
    },
    {
      "text": "Heekyoung Jung, Erik Stolterman, Will Ryan, Tonya Thompson, and Marty Siegel. 2008. Toward a Framework for Ecologies of Artifacts: How Are Digital Artifacts Interconnected Within a Personal Life?. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI '08). ACM, New York, NY, USA, 201--210.  ",
      "doi": "10.1145/1463160.1463182"
    },
    {
      "text": "Seungki Kim, Donghyeon Ko, and Woohun Lee. 2017. Utilizing Smartphones As a Multi-Device Single Display Groupware to Design Collaborative Games. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 1341--1352.  ",
      "doi": "10.1145/3064663.3064716"
    },
    {
      "text": "Seongwoon Kim, Inseong Lee, Kiho Lee, Seungki Jung, Joonah Park, Yeun Bae Kim, Sang Ryong Kim, and Jinwoo Kim. 2010. Mobile Web 2.0 with Multi-display Buttons. Commun. ACM 53, 1 (jan 2010), 136--141.  ",
      "doi": "10.1145/1629175.1629208"
    },
    {
      "text": "U. Kister, K. Klamka, C. Tominski, and R. Dachselt. 2017. GraSp: Combining Spatially-aware Mobile Devices and a Display Wall for Graph Visualization and Interaction. Computer Graphics Forum 36, 3 (June 2017), 503--514.  ",
      "doi": "10.1111/cgf.13206"
    },
    {
      "text": "Randy Klaassen, Rieks op den Akker, and Harm op den Akker. 2013. Feedback Presentation for Mobile Personalised Digital Physical Activity Coaching Platforms. In Proceedings of the 6th International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '13). ACM, New York, NY, USA, Article 64, 8 pages.  ",
      "doi": "10.1145/2504335.2504404"
    },
    {
      "text": "Clemens Nylandsted Klokmose and Michel Beaudouin-Lafon. 2009. VIGO: Instrumental Interaction in Multi-surface Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 869--878.  ",
      "doi": "10.1145/1518701.1518833"
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 280--290.  ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Clemens Nylandsted Klokmose, Matthias Korn, and Henrik Blunck. 2014. WiFi Proximity Detection in Mobile Web Applications. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 123--128.  ",
      "doi": "10.1145/2607023.2610281"
    },
    {
      "text": "Stefanie Klum, Petra Isenberg, Ricardo Langner, Jean-Daniel Fekete, and Raimund Dachselt. 2012. Stackables: Combining Tangibles for Faceted Browsing. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 241--248.  ",
      "doi": "10.1145/2254556.2254600"
    },
    {
      "text": "Oskari Koskimies, Johan Wikman, Tapani Mikola, and Antero Taivalsaari. 2015. EDB: A Multi-master Database for Liquid Multi-device Software. In Proceedings of the Second ACM International Conference on Mobile Software Engineering and Systems (MOBILESoft '15). IEEE Press, Piscataway, NJ, USA, 125--128. http://dl.acm.org/citation.cfm? id=2825041.2825064 ",
      "doi": "10.5555/2825041.2825064"
    },
    {
      "text": "Anna Kötteritzsch, Julian Fietkau, Katrin Paldan, and Michael Koch. 2016. Connecting Interaction with Smart Urban Objects for Individual Support in Neighborhood Participation. In Proceedings of the 6th International Conference on the Internet of Things (IoT'16). ACM, New York, NY, USA, 165--166.  ",
      "doi": "10.1145/2991561.2998475"
    },
    {
      "text": "Stefan Kreitmayer, Yvonne Rogers, Robin Laney, and Stephen Peake. 2013. UniPad: Orchestrating Collaborative Activities Through Shared Tablets and an Integrated Wall Display. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 801--810.  ",
      "doi": "10.1145/2493432.2493506"
    },
    {
      "text": "Thomas Kubitza. 2016. Apps for Environments: Demonstrating Pluggable Apps for Multi-Device IoT-Setups. In Proceedings of the 6th International Conference on the Internet of Things (IoT'16). ACM, New York, NY, USA, 185--186.  ",
      "doi": "10.1145/2991561.2998473"
    },
    {
      "text": "Yuki Kubo, Ryosuke Takada, Buntarou Shizuki, and Shin Takahashi. 2017. Exploring Context-Aware User Interfaces for SmartphoneSmartwatch Cross-Device Interaction. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 69 (Sep 2017), 21 pages.  ",
      "doi": "10.1145/3130934"
    },
    {
      "text": "Romina Kühn, Mandy Korzetz, Lukas Büschel, Christina Korger, Philip Manja, and Thomas Schlegel. 2016. Natural Voting Interactions for Collaborative Work with Mobile Devices. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2570--2575.  ",
      "doi": "10.1145/2851581.2892300"
    },
    {
      "text": "Christian Lander, Sven Gehring, Antonio Krüger, Sebastian Boring, and Andreas Bulling. 2015. GazeProjector: Accurate Gaze Estimation and Seamless Gaze Interaction Across Multiple Displays. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 395--404.  ",
      "doi": "10.1145/2807442.2807479"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 36:1--36:17.  ",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Hyunglae Lee, Heeseok Jeong, JoongHo Lee, Ki-Won Yeom, Hyun-Jin Shin, and Ji-Hyung Park. 2008. Select-and-point: A Novel Interface for Multi-device Connection and Control Based on Simple Hand Gestures. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 3357--3362.  ",
      "doi": "10.1145/1358628.1358857"
    },
    {
      "text": "Sang-won Leigh, Philipp Schoessler, Felix Heibeck, Pattie Maes, and Hiroshi Ishii. 2015. THAW: Tangible Interaction with See-Through Augmentation for Smartphones on Computer Screens. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 89--96.  ",
      "doi": "10.1145/2677199.2680584"
    },
    {
      "text": "Ming Li and Leif Kobbelt. 2012. Dynamic Tiling Display: Building an Interactive Display Surface Using Multiple Mobile Devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, New York, NY, USA, Article 24, 4 pages.  ",
      "doi": "10.1145/2406367.2406397"
    },
    {
      "text": "Hai-Ning Liang, Cary Williams, Myron Semegen, Wolfgang Stuerzlinger, and Pourang Irani. 2012. User-defined Surface+Motion Gestures for 3D Manipulation of Objects at a Distance Through a Mobile Device. In Proceedings of the 10th Asia Pacific Conference on Computer Human Interaction (APCHI '12). ACM, New York, NY, USA, 299--308.  ",
      "doi": "10.1145/2350046.2350098"
    },
    {
      "text": "Hyunchul Lim, YoonKyong Cho, Wonjong Rhee, and Bongwon Suh. 2015. Vi-Bros: Tactile Feedback for Indoor Navigation with a Smartphone and a Smartwatch. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2115--2120.  ",
      "doi": "10.1145/2702613.2732811"
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-themaround: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1787--1796.  ",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2012. MobiComics: Collaborative Use of Mobile Phones and Large Displays for Public Expression. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 383--392.  ",
      "doi": "10.1145/2371574.2371634"
    },
    {
      "text": "Andrés Lucero, Jaakko Keränen, and Hannu Korhonen. 2010. Collaborative Use of Mobile Phones for Brainstorming. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 337--340.  ",
      "doi": "10.1145/1851600.1851659"
    },
    {
      "text": "Kris Luyten, Kristof Verpoorten, and Karin Coninx. 2007. Ad-hoc Co-located Collaborative Work with Mobile Devices. In Proceedings of the 9th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '07). ACM, New York, NY, USA, 507--514.  ",
      "doi": "10.1145/1377999.1378061"
    },
    {
      "text": "Leilah Lyons. 2007. Scaffolding Cooperative Multi-device Activities in an Informal Learning Environment. In Proceedings of the 6th International Conference on Interaction Design and Children (IDC '07). ACM, New York, NY, USA, 189--192.  ",
      "doi": "10.1145/1297277.1297326"
    },
    {
      "text": "Leilah Lyons, Joseph Lee, Christopher Quintana, and Elliot Soloway. 2006. MUSHI: A Multi-device Framework for Collaborative Inquiry Learning. In Proceedings of the 7th International Conference on Learning Sciences (ICLS '06). International Society of the Learning Sciences, 453--459. http://dl.acm.org/citation.cfm?id=1150034.1150100 ",
      "doi": "10.5555/1150034.1150100"
    },
    {
      "text": "Carsten Magerkurth and Thorsten Prante. 2001. Towards a Unifying Approach to Mobile Computing. SIGGROUP Bull. 22, 1 (April 2001), 16--21.  ",
      "doi": "10.1145/500721.500725"
    },
    {
      "text": "Narges Mahyar, Kelly J. Burke, Jialiang (Ernest) Xiang, Siyi (Cathy) Meng, Kellogg S. Booth, Cynthia L. Girling, and Ronald W. Kellett. 2016. UD Co-Spaces: A Table-Centred Multi-Display Environment for Public Engagement in Urban Design Charrettes. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/2992154.2992163"
    },
    {
      "text": "Ville Mäkelä, Mohamed Khamis, Lukas Mecke, Jobin James, Markku Turunen, and Florian Alt. 2018. Pocket Transfers: Interaction Techniques for Transferring Content from Situated Displays to Mobile Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 135, 13 pages.  ",
      "doi": "10.1145/3173574.3173709"
    },
    {
      "text": "Niko Mäkitalo. 2014. Building and Programming Ubiquitous Social Devices. In Proceedings of the 12th ACM International Symposium on Mobility Management and Wireless Access (MobiWac '14). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/2642668.2642678"
    },
    {
      "text": "Marco Manca and Fabio Paternò. 2016. Customizable Dynamic User Interface Distribution. In Proceedings of the 8th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '16). ACM, New York, NY, USA, 27--37.  ",
      "doi": "10.1145/2933242.2933259"
    },
    {
      "text": "Yoshihisa Mano, Kazuhito Omaki, and Koji Torii. 1981. An Intelligent Multi-display Terminal System Towards: A Better Programming Environment. SIGSOFT Softw. Eng. Notes 6, 2 (apr 1981), 8--14.  ",
      "doi": "10.1145/1010865.1010866"
    },
    {
      "text": "Yoshihisa Mano, Kazuhito Omaki, and Koji Torii. 1982. Early Experiences with a Multi-display Programming Environment. In Proceedings of the 6th International Conference on Software Engineering (ICSE '82). IEEE Computer Society Press, Los Alamitos, CA, USA, 422--423. http://dl.acm.org/citation.cfm?id=800254.807788 ",
      "doi": "10.5555/800254.807788"
    },
    {
      "text": "Nicolai Marquardt, Till Ballendat, Sebastian Boring, Saul Greenberg, and Ken Hinckley. 2012. Gradual Engagement: Facilitating Information Exchange Between Digital Devices As a Function of Proximity. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops & Surfaces (ITS '12). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/2396636.2396642"
    },
    {
      "text": "Nicolai Marquardt, Frederik Brudy, Can Liu, Ben Bengler, and Christian Holz. 2018. SurfaceConstellations: A Modular Hardware Platform for Ad-Hoc Reconfigurable Cross-Device Workspaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 354, 14 pages.  ",
      "doi": "10.1145/3173574.3173928"
    },
    {
      "text": "Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The Proximity Toolkit: Prototyping Proxemic Interactions in Ubiquitous Computing Ecologies. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 315--326.  ",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Crossdevice Interaction via Micro-mobility and F-formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Nicolai Marquardt, Frederico Schardong, and Anthony Tang. 2015. EXCITE: Exploring collaborative interaction in tracked environments. In Human-Computer Interaction. Springer, 89--97.",
      "doi": ""
    },
    {
      "text": "Reed Martin and Henry Holtzman. 2010. Newstream: A Multi-device, Cross-medium, and Socially Aware Approach to News Content. In Proceedings of the 8th European Conference on Interactive TV and Video (EuroITV '10). ACM, New York, NY, USA, 83--90.  ",
      "doi": "10.1145/1809777.1809797"
    },
    {
      "text": "Roberto Martinez-Maldonado, Peter Goodyear, Judy Kay, Kate Thompson, and Lucila Carvalho. 2016. An Actionable Approach to Understand Group Experience in Complex, Multi-surface Spaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2062--2074.  ",
      "doi": "10.1145/2858036.2858213"
    },
    {
      "text": "Masood Masoodian, Saturnino Luz, and David Kavenga. 2016. Nuview: A Visualization System for Collaborative Co-located Analysis of Geospatial Disease Data. In Proceedings of the Australasian Computer Science Week Multiconference (ACSW '16). ACM, New York, NY, USA, Article 48, 10 pages.  ",
      "doi": "10.1145/2843043.2843374"
    },
    {
      "text": "Rene Mayrhofer. 2007. Towards an open source toolkit for ubiquitous device authentication. In Pervasive Computing and Communications Workshops, 2007. PerCom Workshops '07. Fifth Annual IEEE International Conference on. IEEE, 247--254.  ",
      "doi": "10.1109/PERCOMW.2007.118"
    },
    {
      "text": "Christopher McAdam and Stephen Brewster. 2011. Using Mobile Phones to Interact with Tabletop Computers. In Proceedings of the ACM International Conference on Interactive Tabletops & Surfaces (ITS '11). ACM, New York, NY, USA, 232--241.  ",
      "doi": "10.1145/2076354.2076395"
    },
    {
      "text": "Mark McGill, John Williamson, and Stephen A. Brewster. 2014. Mirror, Mirror, on the Wall: Collaborative Screen-mirroring for Small Groups. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, New York, NY, USA, 87--94.  ",
      "doi": "10.1145/2602299.2602319"
    },
    {
      "text": "Mark McGill, John Williamson, and Stephen A. Brewster. 2015. Who's the Fairest of Them All: Device Mirroring for the Connected Home. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '15). ACM, New York, NY, USA, 83--92.  ",
      "doi": "10.1145/2745197.2745200"
    },
    {
      "text": "Jérémie Melchior, Donatien Grolaux, Jean Vanderdonckt, and Peter Van Roy. 2009. A Toolkit for Peer-to-peer Distributed User Interfaces: Concepts, Implementation, and Applications. In Proceedings of the 1st ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '09). ACM, New York, NY, USA, 69--78.  ",
      "doi": "10.1145/1570433.1570449"
    },
    {
      "text": "Jérémie Melchior, Jean Vanderdonckt, and Peter Van Roy. 2011. A Model-based Approach for Distributed User Interfaces. In Proceedings of the 3rd ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '11). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/1996461.1996488"
    },
    {
      "text": "Helena M. Mentis. 2017. Collocated Use of Imaging Systems in Coordinated Surgical Practice. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 78 (dec 2017), 17 pages.  ",
      "doi": "10.1145/3134713"
    },
    {
      "text": "David Merrill, Jeevan Kalanithi, and Pattie Maes. 2007. Siftables: Towards Sensor Network User Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07). ACM, New York, NY, USA, 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "Jan Meskens, Kris Luyten, and Karin Coninx. 2009. Plug-and-design: Embracing Mobile Devices As Part of the Design Environment. In Proceedings of the 1st ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '09). ACM, New York, NY, USA, 149--154.  ",
      "doi": "10.1145/1570433.1570461"
    },
    {
      "text": "Jan Meskens, Kris Luyten, and Karin Coninx. 2010. D-Macs: Building Multi-device User Interfaces by Demonstrating, Sharing and Replaying Design Actions. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 129--138.  ",
      "doi": "10.1145/1866029.1866051"
    },
    {
      "text": "Jan Meskens, Kris Luyten, and Karin Coninx. 2010. Jelly: A Multidevice Design Environment for Managing Consistency Across Devices. In Proceedings of the International Conference on Advanced Visual Interfaces (AVI '10). ACM, New York, NY, USA, 289--296.  ",
      "doi": "10.1145/1842993.1843044"
    },
    {
      "text": "Roshanak Zilouchian Moghaddam and Brian Bailey. 2011. VICPAM: A Visualization Tool for Examining Interaction Data in Multiple Display Environments. In Human Interface and the Management of Information. Interacting with Information, Michael J. Smith and Gavriel Salvendy (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 278-- 287. ",
      "doi": "10.5555/2027916.2027951"
    },
    {
      "text": "Miguel A. Nacenta, Dzmitry Aliakseyeu, Sriram Subramanian, and Carl Gutwin. 2005. A Comparison of Techniques for Multi-display Reaching. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Miguel A. Nacenta, Mikkel R. Jakobsen, Remy Dautriche, Uta Hinrichs, Marian Dörk, Jonathan Haber, and Sheelagh Carpendale. 2012. The LunchTable: A Multi-user, Multi-display System for Information Sharing in Casual Group Interactions. In Proceedings of the 2012 International Symposium on Pervasive Displays (PerDis '12). ACM, New York, NY, USA, Article 18, 6 pages.  ",
      "doi": "10.1145/2307798.2307816"
    },
    {
      "text": "Miguel A. Nacenta, Regan L. Mandryk, and Carl Gutwin. 2008. Targeting Across Displayless Space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 777--786.  ",
      "doi": "10.1145/1357054.1357178"
    },
    {
      "text": "Miguel A. Nacenta, Satoshi Sakurai, Tokuo Yamaguchi, Yohei Miki, Yuichi Itoh, Yoshifumi Kitamura, Sriram Subramanian, and Carl Gutwin. 2007. E-conic: A Perspective-aware Interface for Multidisplay Environments. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 279--288.  ",
      "doi": "10.1145/1294211.1294260"
    },
    {
      "text": "Miguel A. Nacenta, Samer Sallam, Bernard Champoux, Sriram Subramanian, and Carl Gutwin. 2006. Perspective Cursor: Perspectivebased Interaction for Multi-display Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 289--298.  ",
      "doi": "10.1145/1124772.1124817"
    },
    {
      "text": "Timothy Neate, Matt Jones, and Michael Evans. 2015. Designing Attention for Multi-screen TV Experiences. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, New York, NY, USA, 285--286.  ",
      "doi": "10.1145/2783446.2783613"
    },
    {
      "text": "Timothy Neate, Matt Jones, and Michael Evans. 2017. Cross-device Media: A Review of Second Screening and Multi-device Television. Personal Ubiquitous Comput. 21, 2 (Apr 2017), 391--405.  ",
      "doi": "10.1007/s00779-017-1016-2"
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4574--4584.  ",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling and Anind K. Dey. 2016. XDBrowser: User-Defined Cross-Device Web Page Designs. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5494--5505.  ",
      "doi": "10.1145/2858036.2858048"
    },
    {
      "text": "Michael Nebeling, Maria Husmann, Christoph Zimmerli, Giulio Valente, and Moira C. Norrie. 2015. XDSession: Integrated Development and Testing of Cross-device Applications. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '15). ACM, New York, NY, USA, 22--27.  ",
      "doi": "10.1145/2774225.2775075"
    },
    {
      "text": "Michael Nebeling, Theano Mintsi, Maria Husmann, and Moira Norrie. 2014. Interactive Development of Cross-device User Interfaces. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2793--2802.  ",
      "doi": "10.1145/2556288.2556980"
    },
    {
      "text": "Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 353, 12 pages.  ",
      "doi": "10.1145/3173574.3173927"
    },
    {
      "text": "Michael Nebeling and Moira Norrie. 2012. jQMultiTouch: Lightweight Toolkit and Development Framework for Multi-touch/Multi-device Web Interfaces. In Proceedings of the 4th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '12). ACM, New York, NY, USA, 61--70.  ",
      "doi": "10.1145/2305484.2305497"
    },
    {
      "text": "Michael Nebeling, Elena Teunissen, Maria Husmann, and Moira C. Norrie. 2014. XDKinect: Development Framework for Cross-device Interaction Using Kinect. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 65--74.  ",
      "doi": "10.1145/2607023.2607024"
    },
    {
      "text": "Heidi Selmer Nielsen, Marius Pallisgaard Olsen, Mikael B. Skov, and Jesper Kjeldskov. 2014. JuxtaPinch: An Application for Collocated Multi-device Photo Sharing. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '14). ACM, New York, NY, USA, 417--420.  ",
      "doi": "10.1145/2628363.2633569"
    },
    {
      "text": "Heidi Selmer Nielsen, Marius Pallisgaard Olsen, Mikael B. Skov, and Jesper Kjeldskov. 2014. JuxtaPinch: Exploring Multi-device Interaction in Collocated Photo Sharing. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 183-- 192.  ",
      "doi": "10.1145/2628363.2628369"
    },
    {
      "text": "Jakob Nielsen. 1994. Usability engineering. Elsevier.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Sangeun Oh, Hyuck Yoo, Dae R. Jeong, Duc Hoang Bui, and Insik Shin. 2017. Mobile Plus: Multi-device Mobile Platform for Cross-device Functionality Sharing. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '17). ACM, New York, NY, USA, 332--344.  ",
      "doi": "10.1145/3081333.3081348"
    },
    {
      "text": "Takashi Ohta. 2008. Dynamically Reconfigurable Multi-display Environment for CG Contents. In Proceedings of the 2008 International Conference on Advances in Computer Entertainment Technology (ACE '08). ACM, New York, NY, USA, 416--416.  ",
      "doi": "10.1145/1501750.1501866"
    },
    {
      "text": "Takashi Ohta and Jun Tanaka. 2010. Automatic Configuration of Display Ordering for Multi-display Environments. In Proceedings of the 7th International Conference on Advances in Computer Entertainment Technology (ACE '10). ACM, New York, NY, USA, 24--27.  ",
      "doi": "10.1145/1971630.1971638"
    },
    {
      "text": "Takashi Ohta and Jun Tanaka. 2012. Pinch: An Interface That Relates Applications on Multiple Touch-Screen by 'Pinching' Gesture. Springer Berlin Heidelberg, Berlin, Heidelberg, 320--335.",
      "doi": ""
    },
    {
      "text": "Takashi Ohta and Jun Tanaka. 2015. MovieTile: Interactively Adjustable Free Shape Multi-display of Mobile Devices. In SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications (SA '15). ACM, New York, NY, USA, Article 18, 7 pages.  ",
      "doi": "10.1145/2818427.2818436"
    },
    {
      "text": "Katie O'Leary, Tao Dong, Julia Katherine Haines, Michael Gilbert, Elizabeth F. Churchill, and Jeffrey Nichols. 2017. The Moving Context Kit: Designing for Context Shifts in Multi-Device Experiences. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 309--320.  ",
      "doi": "10.1145/3064663.3064768"
    },
    {
      "text": "Gerard Oleksik, Hans-Christian Jetter, Jens Gerken, Natasa MilicFrayling, and Rachel Jones. 2013. Towards an Information Architecture for Flexible Reuse of Digital Media. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, New York, NY, USA, Article 12, 10 pages.  ",
      "doi": "10.1145/2541831.2541866"
    },
    {
      "text": "Dan R. Olsen, Jr. 2007. Evaluating User Interface Systems Research. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 251-- 258.  ",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Dan R. Olsen, Jr., Sean Jefferies, Travis Nielsen, William Moyes, and Paul Fredrickson. 2000. Cross-modal Interaction Using XWeb. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, New York, NY, USA, 191-- 200.  ",
      "doi": "10.1145/354401.354764"
    },
    {
      "text": "Matthew Oskamp, Christophe Bortolaso, Robin Harrap, and T.C. Nicholas Graham. 2015. TerraGuide: Design and Evaluation of a Multi-Surface Environment for Terrain Visibility Analysis. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3553--3562.  ",
      "doi": "10.1145/2702123.2702480"
    },
    {
      "text": "Antti Oulasvirta. 2008. FEATURE: When Users \"Do\" the Ubicomp. interactions 15, 2 (March 2008), 6--9.  ",
      "doi": "10.1145/1340961.1340963"
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2016. HCI Research As Problem-Solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4956--4967.  ",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "Antti Oulasvirta and Lauri Sumari. 2007. Mobile Kits and Laptop Trays: Managing Multiple Devices in Mobile Information Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1127--1136.  ",
      "doi": "10.1145/1240624.1240795"
    },
    {
      "text": "Jeni Paay, Dimitrios Raptis, Jesper Kjeldskov, Mikael B. Skov, Eric V. Ruder, and Bjarke M. Lauridsen. 2017. Investigating Cross-Device Interaction Between a Handheld Device and a Large Display. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6608--6619.  ",
      "doi": "10.1145/3025453.3025724"
    },
    {
      "text": "Tim Paek, Maneesh Agrawala, Sumit Basu, Steve Drucker, Trausti Kristjansson, Ron Logan, Kentaro Toyama, and Andy Wilson. 2004. Toward Universal Mobile Interaction for Shared Displays. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, New York, NY, USA, 266--269.  ",
      "doi": "10.1145/1031607.1031649"
    },
    {
      "text": "Seonwook Park, Christoph Gebhardt, Roman Rädle, Anna Maria Feit, Hana Vrzakova, Niraj Ramesh Dayama, Hui-Shyong Yeo, Clemens N. Klokmose, Aaron Quigley, Antti Oulasvirta, and Otmar Hilliges. 2018. AdaM: Adapting Multi-User Interfaces for Collaborative Environments in Real-Time. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 184, 14 pages.  ",
      "doi": "10.1145/3173574.3173758"
    },
    {
      "text": "Fabio Paternò and Carmen Santoro. 2012. A Logical Framework for Multi-device User Interfaces. In Proceedings of the 4th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '12). ACM, New York, NY, USA, 45--50.  ",
      "doi": "10.1145/2305484.2305494"
    },
    {
      "text": "Fabio Paternò, Carmen Santoro, and Antonio Scorcia. 2008. Automatically Adapting Web Sites for Mobile Access Through Logical Descriptions and Dynamic Analysis of Interaction Resources. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, New York, NY, USA, 260--267.  ",
      "doi": "10.1145/1385569.1385611"
    },
    {
      "text": "Chunyi Peng, Guobin Shen, Yongguang Zhang, Yanlin Li, and Kun Tan. 2007. BeepBeep: A High Accuracy Acoustic Ranging System Using COTS Mobile Devices. In Proceedings of the 5th International Conference on Embedded Networked Sensor Systems (SenSys '07). ACM, New York, NY, USA, 1--14.  ",
      "doi": "10.1145/1322263.1322265"
    },
    {
      "text": "Julian Petford, Miguel A. Nacenta, and Carl Gutwin. 2018. Pointing All Around You: Selection Performance of Mouse and Ray-Cast Pointing in Full-Coverage Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 533, 14 pages.  ",
      "doi": "10.1145/3173574.3174107"
    },
    {
      "text": "Tommaso Piazza, Shengdong Zhao, Gonzalo Ramos, Asim Evren Yantaç, and Morten Fjeld. 2013. Dynamic Duo: Phone-tablet Interaction on Tabletops. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2803--2804.  ",
      "doi": "10.1145/2468356.2479520"
    },
    {
      "text": "Jeffrey S. Pierce and Jeffrey Nichols. 2008. An Infrastructure for Extending Applications' User Experiences Across Multiple Personal Devices. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 101--110.  ",
      "doi": "10.1145/1449715.1449733"
    },
    {
      "text": "Krzysztof Pietroszek and Edward Lank. 2012. Clicking Blindly: Using Spatial Correspondence to Select Targets in Multi-device Environments. In Proceedings of the 14th International Conference on Humancomputer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 331--334.  ",
      "doi": "10.1145/2371574.2371625"
    },
    {
      "text": "Thomas Plank, Hans-Christian Jetter, Roman Rädle, Clemens N. Klokmose, Thomas Luger, and Harald Reiterer. 2017. Is Two Enough?: ! Studying Benefits, Barriers, and Biases of Multi-Tablet Use for Collaborative Visualization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4548--4560.  ",
      "doi": "10.1145/3025453.3025537"
    },
    {
      "text": "Christopher Plaue and John Stasko. 2009. Presence & Placement: Exploring the Benefits of Multiple Shared Displays on an Intellective Sensemaking Task. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (GROUP '09). ACM, New York, NY, USA, 179--188.  ",
      "doi": "10.1145/1531674.1531701"
    },
    {
      "text": "Thorsten Prante, Richard Stenzel, Carsten Röcker, Norbert Streitz, and Carsten Magerkurth. 2004. Ambient Agoras: InfoRiver, SIAM, Hello.Wall. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 763--764.  ",
      "doi": "10.1145/985921.985924"
    },
    {
      "text": "Sydney Pratte, Teddy Seyed, and Frank Maurer. 2014. Exploring Multi-Surface Interactions in Retail Environments. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 393--398.  ",
      "doi": "10.1145/2669485.2669552"
    },
    {
      "text": "Jian Qiu, David Chu, Xiangying Meng, and Thomas Moscibroda. 2011. On the Feasibility of Real-time Phone-to-phone 3D Localization. In Proceedings of the 9th ACM Conference on Embedded Networked Sensor Systems (SenSys '11). ACM, New York, NY, USA, 190--203.  ",
      "doi": "10.1145/2070942.2070962"
    },
    {
      "text": "Roman Rädle. 2013. Design and Evaluation of Proxemics-aware Environments to Support Navigation in Large Information Spaces. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1957--1960.  ",
      "doi": "10.1145/2468356.2468710"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Jonathan Fischer, Inti Gabriel, Clemens N. Klokmose, Harald Reiterer, and Christian Holz. 2018. PolarTrack: Optical Outside-In Device Tracking That Exploits Display Polarization. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 497, 9 pages.  ",
      "doi": "10.1145/3173574.3174071"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Mario Schreiner, Zhihao Lu, Harald Reiterer, and Yvonne Rogers. 2015. Spatially-aware or Spatiallyagnostic?: Elicitation and Evaluation of User-Defined Cross-Device Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3913--3922.  ",
      "doi": "10.1145/2702123.2702287"
    },
    {
      "text": "Gonzalo Ramos, Kenneth Hinckley, Andy Wilson, and Raman Sarin. 2009. Synchronous Gestures in Multi-Display Environments. HumanComputer Interaction 24, 1--2 (2009), 117--169.",
      "doi": ""
    },
    {
      "text": "Dimitrios Raptis, Jesper Kjeldskov, and Mikael B. Skov. 2016. Continuity in Multi-Device Interaction: An Online Study. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 29, 10 pages.  ",
      "doi": "10.1145/2971485.2971533"
    },
    {
      "text": "Umar Rashid, Jarmo Kauko, Jonna Häkkilä, and Aaron Quigley. 2011. Proximal and Distal Selection of Widgets: Designing Distributed UI for Mobile Interaction with Large Display. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 495--498.  ",
      "doi": "10.1145/2037373.2037446"
    },
    {
      "text": "Umar Rashid, Miguel A. Nacenta, and Aaron Quigley. 2012. The Cost of Display Switching: A Comparison of Mobile, Large Display and Hybrid UI Configurations. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 99--106.  ",
      "doi": "10.1145/2254556.2254577"
    },
    {
      "text": "Umar Rashid, Miguel A. Nacenta, and Aaron Quigley. 2012. Factors Influencing Visual Attention Switch in Multi-display User Interfaces: A Survey. In Proceedings of the 2012 International Symposium on Pervasive Displays (PerDis '12). ACM, New York, NY, USA, Article 1, 6 pages.  ",
      "doi": "10.1145/2307798.2307799"
    },
    {
      "text": "Adrian Reetz, Carl Gutwin, Tadeusz Stach, Miguel Nacenta, and Sriram Subramanian. 2006. Superflick: A Natural and Efficient Technique for Long-distance Object Placement on Digital Tables. In Proceedings of Graphics Interface 2006 (GI '06). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 163--170. http://dl.acm.org/citation.cfm?id=1143079.1143106 ",
      "doi": "10.5555/1143079.1143106"
    },
    {
      "text": "Jun Rekimoto. 1997. Pick-and-drop: A Direct Manipulation Technique for Multiple Computer Environments. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (UIST '97). ACM, New York, NY, USA, 31--39.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Jun Rekimoto. 1998. A Multiple Device Approach for Supporting Whiteboard-based Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 344--351.  ",
      "doi": "10.1145/274644.274692"
    },
    {
      "text": "Jun Rekimoto. 2004. SyncTap: Synchronous User Operation for Spontaneous Network Connection. Personal Ubiquitous Comput. 8, 2 (may 2004), 126--134.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto and Masanori Saitoh. 1999. Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "João Ribeiro, João Barreto, and Paulo Ferreira. 2011. MultiRep: Asynchronous Multi-device Consistency. In Proceedings of the Third International Workshop on Middleware for Pervasive Mobile and Embedded Computing (M-MPAC '11). ACM, New York, NY, USA, Article 7, 6 pages.  ",
      "doi": "10.1145/2090316.2090323"
    },
    {
      "text": "Scott Robertson, Cathleen Wharton, Catherine Ashworth, and Marita Franzke. 1996. Dual Device User Interface Design: PDAs and Interactive Television. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96). ACM, New York, NY, USA, 79--86.  ",
      "doi": "10.1145/238386.238408"
    },
    {
      "text": "Yvonne Rogers. 2006. Moving on from Weiser's Vision of Calm Computing: Engaging UbiComp Experiences. In UbiComp 2006: Ubiquitous Computing, Paul Dourish and Adrian Friday (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 404--421.  ",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Yvonne Rogers, Kay Connelly, Lenore Tedesco, William Hazlewood, Andrew Kurtz, Robert E. Hall, Josh Hursey, and Tammy Toscos. 2007. Why It's Worth the Hassle: The Value of In-Situ Studies When Designing Ubicomp. In UbiComp 2007: Ubiquitous Computing (Lecture Notes in Computer Science), John Krumm, Gregory D. Abowd, Aruna Seneviratne, and Thomas Strang (Eds.). Springer Berlin Heidelberg, 336--353. http://dl.acm.org/citation.cfm?id=647987.741340 ",
      "doi": "10.5555/1771592.1771612"
    },
    {
      "text": "Manuel Román, Christopher Hess, Renato Cerqueira, Anand Ranganathan, Roy H. Campbell, and Klara Nahrstedt. 2002. Gaia: A Middleware Platform for Active Spaces. SIGMOBILE Mob. Comput. Commun. Rev. 6, 4 (Oct. 2002), 65--67.  ",
      "doi": "10.1145/643550.643558"
    },
    {
      "text": "Houssem Saidi, Marcos Serrano, and Emmanuel Dubois. 2016. Investigating the Effects of Splitting Detailed Views in Overview+Detail Interfaces. In Proceedings of the 18th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 180--184.  ",
      "doi": "10.1145/2935334.2935341"
    },
    {
      "text": "Houssem Saidi, Marcos Serrano, Pourang Irani, and Emmanuel Dubois. 2017. TDome: A Touch-Enabled 6DOF Interactive Device for Multi-Display Environments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5892--5904.  ",
      "doi": "10.1145/3025453.3025661"
    },
    {
      "text": "Satoshi Sakurai, Tokuo Yamaguchi, Yoshifumi Kitamura, Yuichi Itoh, Ryo Fukazawa, Fumio Kishino, Miguel A. Nacenta, and Sriram Subramanian. 2008. M3: Multi-modal Interface in Multi-display Environment for Multi-users. In ACM SIGGRAPH ASIA 2008 Artgallery: Emerging Technologies (SIGGRAPH Asia '08). ACM, New York, NY, USA, 45--45.  ",
      "doi": "10.1145/1504229.1504259"
    },
    {
      "text": "Stephanie Santosa and Daniel Wigdor. 2013. A Field Study of Multidevice Workflows in Distributed Workspaces. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 63--72.  ",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Anthony Savidis and Constantine Stephanidis. 2005. Distributed Interface Bits: Dynamic Dialogue Composition from Ambient Computing Resources. Personal Ubiquitous Comput. 9, 3 (may 2005), 142--168.  ",
      "doi": "10.1007/s00779-004-0327-2"
    },
    {
      "text": "Florian Scharf, Christian Wolters, Michael Herczeg, and Jörg Cassens. 2013. Cross-Device Interaction Definition, Taxonomy and Applications. In AMBIENT 2013: The Third International Conference on Ambient Computing, Applications, Services and Technologies. IARIA, 35--40.",
      "doi": ""
    },
    {
      "text": "Dominik Schmidt, Fadi Chehimi, Enrico Rukzio, and Hans Gellersen. 2010. PhoneTouch: A Technique for Direct Phone Interaction on Surfaces. In Proceedings of the 23rd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 13--16.  ",
      "doi": "10.1145/1866029.1866034"
    },
    {
      "text": "Dominik Schmidt, Julian Seifert, Enrico Rukzio, and Hans Gellersen. 2012. A Cross-device Interaction Style for Mobiles and Surfaces. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 318--327.  ",
      "doi": "10.1145/2317956.2318005"
    },
    {
      "text": "Stefan Schneegass and Florian Alt. 2014. SenScreen: A Toolkit for Supporting Sensor-enabled Multi-Display Networks. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14). ACM, New York, NY, USA, Article 92, 6 pages.  ",
      "doi": "10.1145/2611009.2611017"
    },
    {
      "text": "Bertrand Schneider, Matthew Tobiasz, Charles Willis, and Chia Shen. 2012. WALDEN: Multi-surface Multi-touch Simulation of Climate Change and Species Loss in Thoreau's Woods. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops & Surfaces (ITS '12). ACM, New York, NY, USA, 387--390.  ",
      "doi": "10.1145/2396636.2396707"
    },
    {
      "text": "Dennis Schneider, Julian Seifert, and Enrico Rukzio. 2012. MobIES: Extending Mobile Interfaces Using External Screens. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, New York, NY, USA, Article 59, 2 pages.  ",
      "doi": "10.1145/2406367.2406438"
    },
    {
      "text": "Mario Schreiner, Roman Rädle, Hans-Christian Jetter, and Harald Reiterer. 2015. Connichiwa: A Framework for Cross-Device Web Applications. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 2163--2168.  ",
      "doi": "10.1145/2702613.2732909"
    },
    {
      "text": "Julia Schwarz, David Klionsky, Chris Harrison, Paul Dietz, and Andrew Wilson. 2012. Phone As a Pixel: Enabling Ad-hoc, Large-scale Displays Using Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2235--2238.  ",
      "doi": "10.1145/2207676.2208378"
    },
    {
      "text": "Stacey Scott, Phillip McClelland, and Guillaume Besacier. 2012. Bridging Private and Shared Interaction Surfaces in Co-located Group Settings. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops & Surfaces (ITS '12). ACM, New York, NY, USA, 403--406.  ",
      "doi": "10.1145/2396636.2396711"
    },
    {
      "text": "Stacey D. Scott, Guillaume Besacier, Julie Tournet, Nippun Goyal, and Michael Haller. 2014. Surface Ghosts: Promoting Awareness of Transferred Objects During Pick-and-Drop Transfer in Multi-Surface Environments. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/2669485.2669508"
    },
    {
      "text": "Julian Seifert, Adalberto Simeone, Dominik Schmidt, Paul Holleis, Christian Reinartz, Matthias Wagner, Hans Gellersen, and Enrico Rukzio. 2012. MobiSurf: Improving Co-located Collaboration Through Integrating Mobile Devices and Interactive Surfaces. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops & Surfaces (ITS '12). ACM, New York, NY, USA, 51--60.  ",
      "doi": "10.1145/2396636.2396644"
    },
    {
      "text": "Marcos Serrano, Barrett Ens, Xing-Dong Yang, and Pourang Irani. 2015. Gluey: Developing a Head-Worn Display Interface to Unify the Interaction Experience in Distributed Display Environments. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 161--171.  ",
      "doi": "10.1145/2785830.2785838"
    },
    {
      "text": "Teddy Seyed, Alaa Azazi, Edwin Chan, Yuxi Wang, and Frank Maurer. 2015. SoD-Toolkit: A Toolkit for Interactively Prototyping and Developing Multi-Sensor, Multi-Device Environments. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 171--180.  ",
      "doi": "10.1145/2817721.2817750"
    },
    {
      "text": "Teddy Seyed, Chris Burns, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2012. Eliciting Usable Gestures for Multi-display Environments. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops & Surfaces (ITS '12). ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2396636.2396643"
    },
    {
      "text": "Teddy Seyed, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2013. SkyHunter: A Multi-surface Environment for Supporting Oil and Gas Exploration. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops & Surfaces (ITS '13). ACM, New York, NY, USA, 15--22.  ",
      "doi": "10.1145/2512349.2512798"
    },
    {
      "text": "Teddy Seyed, Xing-Dong Yang, and Daniel Vogel. 2016. Doppio: A Reconfigurable Dual-Face Smartwatch for Tangible Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4675--4686.  ",
      "doi": "10.1145/2858036.2858256"
    },
    {
      "text": "Teddy Seyed, Xing-Dong Yang, and Daniel Vogel. 2017. A Modular Smartphone for Lending. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 205--215.  ",
      "doi": "10.1145/3126594.3126633"
    },
    {
      "text": "Zahra Shakeri Hossein Abad, Craig Anslow, and Frank Maurer. 2014. Multi Surface Interactions with Geospatial Data: A Systematic Review. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 69--78.  ",
      "doi": "10.1145/2669485.2669505"
    },
    {
      "text": "Hirohito Shibata, Junko Ichino, Tomonori Hashiyama, and Shun'ichi Tano. 2016. A Rhythmical Tap Approach for Sending Data Across Devices. In Proceedings of the 18th International Conference on HumanComputer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, New York, NY, USA, 815--822.  ",
      "doi": "10.1145/2957265.2961851"
    },
    {
      "text": "Léo Sicard, Aurélien Tabard, Juan David Hincapié-Ramos, and Jakob E Bardram. 2013. Tide: Lightweight device composition for enhancing tabletop environments with smartphone applications. In IFIP Conference on Human-Computer Interaction. Springer, 177--194.",
      "doi": ""
    },
    {
      "text": "Adalberto L. Simeone, Julian Seifert, Dominik Schmidt, Paul Holleis, Enrico Rukzio, and Hans Gellersen. 2013. A Cross-device Drag-anddrop Technique. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (MUM '13). ACM, New York, NY, USA, Article 10, 4 pages.  ",
      "doi": "10.1145/2541831.2541848"
    },
    {
      "text": "Anoop K. Sinha and James A. Landay. 2001. Visually Prototyping Perceptual User Interfaces Through Multimodal Storyboarding. In Proceedings of the 2001 Workshop on Perceptive User Interfaces (PUI '01). ACM, New York, NY, USA, 1--4.  ",
      "doi": "10.1145/971478.971501"
    },
    {
      "text": "Mikael B. Skov, Jesper Kjeldskov, Jeni Paay, Heidi P. Jensen, and Marius P. Olsen. 2015. Investigating Cross-Device Interaction Techniques: A Case of Card Playing on Handhelds and Tablets. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, New York, NY, USA, 446--454.  ",
      "doi": "10.1145/2838739.2838763"
    },
    {
      "text": "Hendrik Sollich, Ulrich von Zadow, Tobias Pietzsch, Pavel Tomancak, and Raimund Dachselt. 2016. Exploring Time-dependent Scientific Data Using Spatially Aware Mobiles and Large Displays. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 349--354.  ",
      "doi": "10.1145/2992154.2996779"
    },
    {
      "text": "Henrik Sørensen and Jesper Kjeldskov. 2012. Distributed Interaction: A Multi-device, Multi-user Music Experience. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 336--339.  ",
      "doi": "10.1145/2254556.2254621"
    },
    {
      "text": "Henrik Sørensen and Jesper Kjeldskov. 2012. The Interaction Space of a Multi-device, Multi-user Music Experience. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 504--513.  ",
      "doi": "10.1145/2399016.2399094"
    },
    {
      "text": "Henrik Sørensen, Dimitrios Raptis, Jesper Kjeldskov, and Mikael B. Skov. 2014. The 4C Framework: Principles of Interaction in Digital Ecosystems. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 87--97.  ",
      "doi": "10.1145/2632048.2636089"
    },
    {
      "text": "Martin Spindler, Wolfgang Büschel, and Raimund Dachselt. 2012. Use Your Head: Tangible Windows for 3D Information Spaces in a Tabletop Environment. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops & Surfaces (ITS '12). ACM, New York, NY, USA, 245--254.  ",
      "doi": "10.1145/2396636.2396674"
    },
    {
      "text": "Martin Spindler, Wolfgang Büschel, Charlotte Winkler, and Raimund Dachselt. 2014. Tangible Displays for the Masses: Spatial Interaction with Handheld Displays by Using Consumer Depth Cameras. Personal Ubiquitous Comput. 18, 5 (Jun 2014), 1213--1225.  ",
      "doi": "10.1007/s00779-013-0730-7"
    },
    {
      "text": "Martin Spindler, Sophie Stellmach, and Raimund Dachselt. 2009. PaperLens: Advanced Magic Lens Interaction Above the Tabletop. In Proceedings of the ACM International Conference on Interactive Tabletops & Surfaces (ITS '09). ACM, New York, NY, USA, 69--76.  ",
      "doi": "10.1145/1731903.1731920"
    },
    {
      "text": "Martin Spindler, Christian Tominski, Heidrun Schumann, and Raimund Dachselt. 2010. Tangible Views for Information Visualization. In ACM International Conference on Interactive Tabletops & Surfaces (ITS '10). ACM, New York, NY, USA, 157--166.  ",
      "doi": "10.1145/1936652.1936684"
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 265--272.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Norbert A. Streitz, Jörg Geißler, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz, and Ralf Steinmetz. 1999. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Paul Strohmeier. 2015. DisplayPointers: Seamless Cross-device Interactions. In Proceedings of the 12th International Conference on Advances in Computer Entertainment Technology (ACE '15). ACM, New York, NY, USA, Article 4, 8 pages.  ",
      "doi": "10.1145/2832932.2832958"
    },
    {
      "text": "Alexandros Stylianidis, Jo Vermeulen, Steven Houben, Lindsay MacDonald, and Russell Beale. 2017. SenseBelt: A Belt-Worn Sensor to Support Cross-Device Interaction. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 2123--2131.  ",
      "doi": "10.1145/3027063.3053135"
    },
    {
      "text": "Zheng Sun, Aveek Purohit, Kaifei Chen, Shijia Pan, Trevor Pering, and Pei Zhang. 2011. PANDAA: Physical Arrangement Detection of Networked Devices Through Ambient-sound Awareness. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, New York, NY, USA, 425--434.  ",
      "doi": "10.1145/2030112.2030169"
    },
    {
      "text": "Desney S. Tan, Brian Meyers, and Mary Czerwinski. 2004. WinCuts: Manipulating Arbitrary Window Regions for More Effective Use of Screen Space. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 1525-- 1528.  ",
      "doi": "10.1145/985921.986106"
    },
    {
      "text": "Peter Tandler, Thorsten Prante, Christian Müller-Tomfelde, Norbert Streitz, and Ralf Steinmetz. 2001. Connectables: Dynamic Coupling of Displays for the Flexible Creation of Shared Workspaces. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/502348.502351"
    },
    {
      "text": "Lucia Terrenghi, Aaron Quigley, and Alan Dix. 2009. A Taxonomy for and Analysis of Multi-person-display Ecosystems. Personal Ubiquitous Comput. 13, 8 (Nov. 2009), 583--598.  ",
      "doi": "10.1007/s00779-009-0244-5"
    },
    {
      "text": "Ricardo Tesoriero, María Lozano, Jean Vanderdonckt, José A. Gallud, and Victor M.R. Penichet. 2012. Distributed User Interfaces: Collaboration and Usability. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 2719--2722.  ",
      "doi": "10.1145/2212776.2212704"
    },
    {
      "text": "Paul Tolstoi and Andreas Dippon. 2015. Towering Defense: An Augmented Reality Multi-Device Game. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 89--92.  ",
      "doi": "10.1145/2702613.2728659"
    },
    {
      "text": "Jayson Turner, Andreas Bulling, Jason Alexander, and Hans Gellersen. 2014. Cross-device Gaze-supported Point-to-point Content Transfer. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '14). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/2578153.2578155"
    },
    {
      "text": "Markku Turunen, Juho Hella, Toni Miettinen, Pellervo Valkama, Jaakko Hakulinen, and Roope Raisamo. 2011. Multimodal Multidevice Program Guide for Smart Conferences. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 679--682.  ",
      "doi": "10.1145/2037373.2037483"
    },
    {
      "text": "Markku Turunen, Roope Raisamo, Thomas Olsson, Juho Hella, Toni Miettinen, Tomi Heimonen, Jaakko Hakulinen, and Ismo Rakkolainen. 2013. Enhancing the Conference Experience with a MultiDevice, Multimodal, Multi-User Program Guide. In Proceedings of International Conference on Making Sense of Converging Media (AcademicMindTrek '13). ACM, New York, NY, USA, Article 5, 4 pages.  ",
      "doi": "10.1145/2523429.2523446"
    },
    {
      "text": "Eric Umuhoza, Hamza Ed-douibi, Marco Brambilla, Jordi Cabot, and Aldo Bongio. 2015. Automatic Code Generation for Cross-platform, Multi-device Mobile Apps: Some Reflections from an Industrial Experience. In Proceedings of the 3rd International Workshop on Mobile Development Lifecycle (MobileDeLi 2015). ACM, New York, NY, USA, 37--44.  ",
      "doi": "10.1145/2846661.2846666"
    },
    {
      "text": "Ersin Uzun, Nitesh Saxena, and Arun Kumar. 2011. Pairing Devices for Social Interactions: A Comparative Usability Evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2315--2324.  ",
      "doi": "10.1145/1978942.1979282"
    },
    {
      "text": "Consuelo Valdes, Diana Eastman, Casey Grote, Shantanu Thatte, Orit Shaer, Ali Mazalek, Brygg Ullmer, and Miriam K. Konkel. 2014. Exploring the Design Space of Gestural Interaction with Active Tokens Through User-defined Gestures. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 4107--4116.  ",
      "doi": "10.1145/2556288.2557373"
    },
    {
      "text": "Florian van de Camp and Rainer Stiefelhagen. 2013. GlueTK: A Framework for Multi-modal, Multi-display Human-machine-interaction. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, New York, NY, USA, 329--338.  ",
      "doi": "10.1145/2449396.2449440"
    },
    {
      "text": "Michael van der Laan, Ron Kellet, Cynthia Girling, Maged Senbel, and Tao Su. 2013. A Collaborative Multi-touch, Multi-display, Urban Futures Tool. In Proceedings of the Symposium on Simulation for Architecture & Urban Design (SimAUD '13). Society for Computer Simulation International, San Diego, CA, USA, Article 10, 4 pages. http://dl.acm.org/citation.cfm?id=2500004.2500014 ",
      "doi": "10.5555/2500004.2500014"
    },
    {
      "text": "Alexander Van't Hof, Hani Jamjoom, Jason Nieh, and Dan Williams. 2015. Flux: Multi-surface Computing in Android. In Proceedings of the Tenth European Conference on Computer Systems (EuroSys '15). ACM, New York, NY, USA, Article 24, 17 pages.  ",
      "doi": "10.1145/2741948.2741955"
    },
    {
      "text": "Radu-Daniel Vatavu and Matei Mancas. 2014. Visual Attention Measures for Multi-screen TV. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (TVX '14). ACM, New York, NY, USA, 111--118.  ",
      "doi": "10.1145/2602299.2602305"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Caio Cesar Viel, Erick Lazaro Melo, Maria da Graça Pimentel, and Cesar A.C. Teixeira. 2013. Multimedia Multi-device Educational Presentations Preserved As Interactive Multi-video Objects. In Proceedings of the 19th Brazilian Symposium on Multimedia and the Web (WebMedia '13). ACM, New York, NY, USA, 51--58.  ",
      "doi": "10.1145/2526188.2526211"
    },
    {
      "text": "Pedro G. Villanueva, Ricardo Tesoriero, and Jose A. Gallud. 2014. Performance Evaluation of Proxywork. In Proceedings of the 2014 Workshop on Distributed User Interfaces and Multimodal Interaction (DUI '14). ACM, New York, NY, USA, 42--45.  ",
      "doi": "10.1145/2677356.2677665"
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 515, 13 pages.  ",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Ulrich von Zadow, Wolfgang Büschel, Ricardo Langner, and Raimund Dachselt. 2014. SleeD: Using a Sleeve Display to Interact with Touchsensitive Display Walls. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops & Surfaces (ITS '14). ACM, New York, NY, USA, 129--138.  ",
      "doi": "10.1145/2669485.2669507"
    },
    {
      "text": "Aniruddha Waje, Khalid Tearo, Raghav V. Sampangi, and Derek Reilly. 2016. Grab This, Swipe That: Combining Tangible and Gestural Interaction in Multiple Display Collaborative Gameplay. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 433--438.  ",
      "doi": "10.1145/2992154.2996794"
    },
    {
      "text": "Manuela Waldner, Christian Pirchheim, Ernst Kruijff, and Dieter Schmalstieg. 2010. Automatic Configuration of Spatially Consistent Mouse Pointer Navigation in Multi-display Environments. In Proceedings of the 15th International Conference on Intelligent User Interfaces (IUI '10). ACM, New York, NY, USA, 397--400.  ",
      "doi": "10.1145/1719970.1720040"
    },
    {
      "text": "Manuela Waldner and Dieter Schmalstieg. 2010. Experiences with Mouse Control in Multi-display Environments. In Proceedings of the International Conference on Advanced Visual Interfaces (AVI '10). ACM, New York, NY, USA, 411--411.  ",
      "doi": "10.1145/1842993.1843089"
    },
    {
      "text": "Jim Wallace, Vicki Ha, Ryder Ziola, and Kori Inkpen. 2006. Swordfish: User Tailored Workspaces in Multi-display Environments. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 1487--1492.  ",
      "doi": "10.1145/1125451.1125724"
    },
    {
      "text": "James R. Wallace, Regan L. Mandryk, and Kori M. Inkpen. 2008. Comparing Content and Input Redirection in MDEs. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 157--166.  ",
      "doi": "10.1145/1460563.1460588"
    },
    {
      "text": "James R. Wallace, Stacey D. Scott, Taryn Stutz, Tricia Enns, and Kori Inkpen. 2009. Investigating Teamwork and Taskwork in Single- and Multi-display Groupware Systems. Personal Ubiquitous Comput. 13, 8 (nov 2009), 569--581.  ",
      "doi": "10.1007/s00779-009-0241-8"
    },
    {
      "text": "Yan Wang, Sunghyun Cho, Jue Wang, and Shih-Fu Chang. 2016. PanoSwarm: Collaborative and Synchronized Multi-Device Panoramic Photography. In Proceedings of the 21st International Conference on Intelligent User Interfaces (IUI '16). ACM, New York, NY, USA, 261--270.  ",
      "doi": "10.1145/2856767.2856778"
    },
    {
      "text": "Mark Weiser. 1991. The Computer for the 21st Century. Scientific American 265, 3 (Sept. 1991), 94--104. https://www.scientificamerican. com/article/the-computer-for-the-21st-century/",
      "doi": ""
    },
    {
      "text": "Pierre Wellner. 1993. Interacting with Paper on the DigitalDesk. Commun. ACM 36, 7 (Jul 1993), 87--96.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Daniel Wigdor, Hao Jiang, Clifton Forlines, Michelle Borkin, and Chia Shen. 2009. WeSpace: The Design Development and Deployment of a Walk-up and Share Multi-surface Visual Collaboration System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1237--1246.  ",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Daniel Wigdor, Chia Shen, Clifton Forlines, and Ravin Balakrishnan. 2006. Table-centric Interactive Spaces for Real-time Collaboration. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, New York, NY, USA, 103--107.  ",
      "doi": "10.1145/1133265.1133286"
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2014. CrossMotion: Fusing Device and Image Motion for User Identification, Tracking and Device Association. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 216--223.  ",
      "doi": "10.1145/2663204.2663270"
    },
    {
      "text": "Andrew D Wilson and Raman Sarin. 2007. BlueTable: connecting wireless mobile devices on interactive surfaces using vision-based handshaking. In Proceedings of Graphics interface 2007. ACM, 119-- 125.  ",
      "doi": "10.1145/1268517.1268539"
    },
    {
      "text": "Jeff Wilson, Judith M. Brown, and Robert Biddle. 2014. ACH Walkthrough: A Distributed Multi-Device Tool for Collaborative Security Analysis. In Proceedings of the 2014 ACM Workshop on Security Information Workers (SIW '14). ACM, New York, NY, USA, 9--16.  ",
      "doi": "10.1145/2663887.2663902"
    },
    {
      "text": "Christian Winkler, Markus Löchtefeld, David Dobbelstein, Antonio Krüger, and Enrico Rukzio. 2014. SurfacePhone: A Mobile Projection Device for Single- and Multiuser Everywhere Tabletop Interaction. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3513--3522.  ",
      "doi": "10.1145/2556288.2557075"
    },
    {
      "text": "Christian Winkler, Julian Seifert, Christian Reinartz, Pascal Krahmer, and Enrico Rukzio. 2013. Penbook: Bringing Pen+Paper Interaction to a Tablet Device to Facilitate Paper-based Workflows in the Hospital Domain. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops & Surfaces (ITS '13). ACM, New York, NY, USA, 283--286.  ",
      "doi": "10.1145/2512349.2512797"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Marisol Wong-Villacres, Margarita Ortiz, Vanessa Echeverría, and Katherine Chiluiza. 2015. A Tabletop System to Promote Argumentation in Computer Science Students. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 325--330.  ",
      "doi": "10.1145/2817721.2823501"
    },
    {
      "text": "Paweł W. Wozniak, Nitesh Goyal, Przemys?aw Kucharski, Lars Lischke, Sven Mayer, and Morten Fjeld. 2016. RAMPARTS: Supporting Sensemaking with Spatially-Aware Mobile Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2447--2460.  ",
      "doi": "10.1145/2858036.2858491"
    },
    {
      "text": "Paweł W. Wozniak, Lars Lischke, Benjamin Schmidt, Shengdong Zhao, and Morten Fjeld. 2014. Thaddeus: A Dual Device Interaction Space for Exploring Information Visualisation. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2639189.2639237"
    },
    {
      "text": "Andy Wu, Sam Mendenhall, Jayraj Jog, Loring Scotty Hoag, and Ali Mazalek. 2012. A Nested APi Structure to Simplify Cross-device Communication. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12). ACM, New York, NY, USA, 225--232.  ",
      "doi": "10.1145/2148131.2148180"
    },
    {
      "text": "Chi-Jui Wu, Steven Houben, and Nicolai Marquardt. 2017. EagleSense: Tracking People and Devices in Interactive Spaces Using Real-Time Top-View Depth-Sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3929--3942.  ",
      "doi": "10.1145/3025453.3025562"
    },
    {
      "text": "Robert Xiao, Chris Harrison, and Scott E. Hudson. 2013. WorldKit: Rapid and Easy Creation of Ad-hoc Interactive Applications on Everyday Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 879--888.  ",
      "doi": "10.1145/2470654.2466113"
    },
    {
      "text": "Robert Xiao, Scott Hudson, and Chris Harrison. 2016. CapCam: Enabling Rapid, Ad-Hoc, Position-Tracked Interactions Between Devices. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 169--178.  ",
      "doi": "10.1145/2992154.2992182"
    },
    {
      "text": "Robert Xiao, Gierad Laput, Yang Zhang, and Chris Harrison. 2017. Deus EM Machina: On-Touch Contextual Functionality for Smart IoT Appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4000--4008.  ",
      "doi": "10.1145/3025453.3025828"
    },
    {
      "text": "Jishuo Yang and Daniel Wigdor. 2014. Panelrama: Enabling Easy Specification of Cross-device Web Applications. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2783--2792.  ",
      "doi": "10.1145/2556288.2557199"
    },
    {
      "text": "Masasuke Yasumoto and Takehiro Teraoka. 2015. VISTouch: Dynamic Three-dimensional Connection Between Multiple Mobile Devices. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, New York, NY, USA, 89--92.  ",
      "doi": "10.1145/2735711.2735823"
    },
    {
      "text": "Dongwook Yoon, Ken Hinckley, Hrvoje Benko, François Guimbretière, Pourang Irani, Michel Pahud, and Marcel Gavriliu. 2015. Sensing Tablet Grasp + Micro-mobility for Active Reading. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 477--487.  ",
      "doi": "10.1145/2807442.2807510"
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Carmela Acevedo, and Harald Reiterer. 2017. Studying the Benefits and Challenges of Spatial Distribution and Physical Affordances in a Multi-device Workspace. In Proceedings of the 16th International Conference on Mobile and Ubiquitous Multimedia (MUM '17). ACM, New York, NY, USA, 249--259.  ",
      "doi": "10.1145/3152832.3152855"
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, Roman Rädle, Hans-Christian Jetter, Clemens Klokmose, and Harald Reiterer. 2016. When Tablets Meet Tabletops: The Effect of Tabletop Size on Around-the-Table Collaboration with Personal Tablets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5470--5481.  ",
      "doi": "10.1145/2858036.2858224"
    },
    {
      "text": "Zengbin Zhang, David Chu, Xiaomeng Chen, and Thomas Moscibroda. 2012. SwordFight: Enabling a New Class of Phone-to-phone Action Games on Commodity Phones. In Proceedings of the 10th International Conference on Mobile Systems, Applications, and Services (MobiSys '12). ACM, New York, NY, USA, 1--14.  ",
      "doi": "10.1145/2307636.2307638"
    },
    {
      "text": "Frank Zhao and Qiong Liu. 2004. A Web Based Multi-display Presentation System. In Proceedings of the 12th Annual ACM International Conference on Multimedia (MULTIMEDIA '04). ACM, New York, NY, USA, 176--177.  ",
      "doi": "10.1145/1027527.1027565"
    }
  ]
}