{
  "doi": "10.1145/3290605.3300507",
  "title": "Cultivating Care through Ambiguity: Lessons from a Service Learning Course",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Given the focus of professional graduate ICT programs on technical and managerial skills, pedagogical engagement with external organizations tends to be transactional and artifact-centered. This inhibits the students' ability to understand social, technical and ethical issues in context, or to develop affective relationships with users and other stakeholders. To address this, we designed a service learning course that partnered students with non-profit organizations to help with their technology challenges. The service project was deliberately left open-ended to force students (and partners) to tackle important questions around project scoping and impact. By drawing parallels to soil care practices, we explore how \"care time\" emerged in this context, and how the incorporation of ambiguity galvanized students, community, and faculty to make time to navigate it. This led to non-tangible yet vital outcomes such as overcoming social limitations, building symbiotic relationships, and enacting acts of care necessary for more ethical orchestration of technology.",
  "authors": [
    {
      "name": "Samar Sabie",
      "institution": "Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659034129",
      "orcid": "0000-0001-9904-6081"
    },
    {
      "name": "Tapan Parikh",
      "institution": "Cornell University, New York, NY, USA",
      "img": "/do/10.1145/contrib-81100298867/rel-imgonly/tapan_parikh_lg_1.jpg",
      "acmid": "81100298867",
      "orcid": "0000-0003-2634-6395"
    }
  ],
  "references": [
    {
      "text": "Joseph Brian Adams and Erica Runkles. 2004. \"May We Have Class Outside?\": Implementing Service Learning in a CS1 Curriculum. Journal of Computing Sciences in Colleges 19, 5: 25--34. ",
      "doi": "10.5555/1060081.1060087"
    },
    {
      "text": "Vincanne Adams, Michelle Murphy, and Adele E Clarke. 2009. Anticipation: Technoscience, Life, Affect, Temporality. Subjectivity 28, 1: 246--265.",
      "doi": ""
    },
    {
      "text": "Shana Agid. 2016. ...it's your project, but it's not necessarily your work...\": Infrastructuring, Situatedness, and Designing Relational Practice. In Proceedings of the 14th Participatory Design Conference (PDC'16), 81--90.  ",
      "doi": "10.1145/2940299.2940317"
    },
    {
      "text": "Yoko Akama, Sarah Pink, and Annie Fergusson. 2015. Design + Ethnography + Futures: Surrendering in Uncertainty. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15), 531--542.  ",
      "doi": "10.1145/2702613.2732499"
    },
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without Knowing: Limitations of the Transparency Ideal and its Application to Algorithmic Accountability. New Media & Society 20, 3: 973--989.",
      "doi": ""
    },
    {
      "text": "Alexander W Astin, Lori J Vogelgesang, Elaine K Ikeda, and Jennifer A Yee. 2000. How Service Learning Affects Students. Higher Education Research Institute, University of California, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Melissa Atkinson-Graham, Martha Kenney, Kelly Ladd, Cameron Michael Murray, and Emily Astra-Jean Simmonds. 2015. Care in Context: Becoming an STS Researcher. Social Studies of Science 45, 5: 738--748.",
      "doi": ""
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory Design and \"Democratizing Innovation.\" In Proceedings of the 11th Biennial Participatory Design Conference (PDC '10), 41--50.  ",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory Design That Matters-Facing the Big Issues. ACM Trans. Comput.-Hum. Interact. 25, 1: 4:1--4:31.  ",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Marilynne Boyle-Baise. 2002. Multicultural Service Learning: Educating Teachers in Diverse Communities. Teachers College Press, New York.",
      "doi": ""
    },
    {
      "text": "David J Burns. 2011. Motivations to Volunteer and Benefits from Service Learning: An Exploration of Marketing Students. Journal for Advancement of Marketing Education 18, Summer 2011: 10--23.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2016. How the Machine 'Thinks': Understanding Opacity in Machine Learning Algorithms. Big Data & Society 3, 1: 1--12.",
      "doi": ""
    },
    {
      "text": "Tim Chatterton and Georgia Newmarch. 2017. The Future is Already Here: It's Just Not Very Evenly Distributed. Interactions 24, 2: 42--45.  ",
      "doi": "10.1145/3041215"
    },
    {
      "text": "Susan Benigni Cipolle. 2010. Service-Learning and Social Justice: Engaging Students in Social Change. Rowman & Littlefield Publishers, Lanham, MD.",
      "doi": ""
    },
    {
      "text": "Randy W Connolly. 2012. Is There Service in Computing Service Learning? In Proceedings of the 43rd ACM Technical Symposium on Computer Science Education (SIGCSE '12), 337--342.  ",
      "doi": "10.1145/2157136.2157238"
    },
    {
      "text": "Cynthia Gordon da Cruz. 2017. Are We Really Helping Communities? A Teaching Case to Challenge Dominant Narratives about Sources of Inequity. Journal of Community Engagement and Scholarship 10, 1: 100--108.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the Formation of Publics in Participatory Design. Social Studies of Science 43, 2: 241--264.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Andrew Clement, and Volkmar Pipek. 2012. Communities: Participatory Design for, with and by Communities. In Routledge International Handbook of Participatory Design, Jesper Simonsen and Toni Robertson (eds.). Taylor & Francis Group, London, 182--209.",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 2017. Learning in Participatory Design as I Found It (1970--2015). In Participatory Design for Learning: Perspectives from Practice and Research (1st edition), Betsy DiSalvo, Jason Yip, Elizabeth Bonsignore and Carl DiSalvo (eds.). Routledge, New York, 7--21.",
      "doi": ""
    },
    {
      "text": "Madeleine Elish. 2016. Moral Crumple Zones: Cautionary Tales in Human-Robot Interaction. In Proceedings of We Robot 2016.",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating Inequality: How High-Tech Tools Profile, Police, and Punish the Poor. St. Martin's Press, New York, NY. ",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Janet Eyler and Dwight Giles. 2002. Beyond Surveys: Using the Problem Solving Interview to Assess the Impact of Service-Learning on Understanding and Critical Thinking. In Service-Learning: The Essence of the Pedagogy, Andrew Furco and Shelley H. Billig (eds.). Information Age Publishing, Greenwich, 147--159.",
      "doi": ""
    },
    {
      "text": "Constance Flanagan and Peter Levine. 2010. Civic Engagement and the Transition to Adulthood. The Future of Children 20, 1: 159--179.",
      "doi": ""
    },
    {
      "text": "Masanobu Fukuoka. 1978. The One-Straw Revolution: An Introduction to Natural Farming. Rodale Press, Emmaus.",
      "doi": ""
    },
    {
      "text": "Andrew Furco. 1996. Is Service-Learning Really Better Than Community Service? In Service Learning: The Essence of the Pedagogy, Andrew Furco and Shelley H. Billigs (eds.). Information Age Pub, Greenwich, CT, 23--50.",
      "doi": ""
    },
    {
      "text": "Karl-Heinz Gerholz, Verena Liszt, and Katrin B Klingsieck. 2018. Effects of Learning Design Patterns in Service Learning Courses. Active Learning in Higher Education 19, 1: 47--59.",
      "doi": ""
    },
    {
      "text": "Michele A Govekar and Meenakshi Rishi. 2007. Service Learning: Bringing Real-World Education Into the B-School Classroom. Journal of Education for Business 83, 1: 3--10.",
      "doi": ""
    },
    {
      "text": "Charles Hannon. 2006. Service Learning in Information Technology Leadership: A Natural Connection. Peer Review 8, 4: 16--19.",
      "doi": ""
    },
    {
      "text": "Andrew Hatala, Lisa Erickson, Osemis Isbister-Bear, Stryker Calvez, Kelley Naytowhow, Tamara Pearl, Omeasoo Wahpasiw, Rachel Engler-Stringer, and Pamela Downe. 2017. The Interpersonal Skills of Community-Engaged Scholarship: Insights from Collaborators Working at the University of Saskatchewan's Community Engagement Office. Journal of Community Engagement and Scholarship 10: 44--58.",
      "doi": ""
    },
    {
      "text": "Elisabeth Hayes and Sondra Cuban. 1997. Border Pedagogy: A Critical Framework for Service-Learning. Michigan Journal of Community Service Learning 4, 1: 72--80.",
      "doi": ""
    },
    {
      "text": "Elaine R Ingham and Matthew D Slaughter. 2014. The Soil Foodweb -- Soil and Composts as Living Ecosystems. In Proceedings of the International Conference Soil and Compost Eco-Biology, 127--139.",
      "doi": ""
    },
    {
      "text": "M M Irfan and P Sammaiah. 2017. Service Learning Course in the Engineering Curriculum: EPICS. Journal of Engineering Education Transformations, Special Issue.",
      "doi": ""
    },
    {
      "text": "Steven J Jackson. 2014. Rethinking Repair. In Media Technologies, Tarleton Gillespie, Pablo J Boczkowski and Kirsten A Foot (eds.). The MIT Press, 221--240.",
      "doi": ""
    },
    {
      "text": "Helena Karasti. 2014. Infrastructuring in Participatory Design. In Proceedings of the 13th Participatory Design Conference: Research Papers - Volume 1 (PDC '14), 141--150.  ",
      "doi": "10.1145/2661435.2661450"
    },
    {
      "text": "Helena Karasti and Karen S Baker. Community Design: Growing One's Own Information Infrastructure. In Proceedings of the 2008 Tenth Anniversary Conference on Participatory Design (PDC '08): 217--220. ",
      "doi": "10.5555/1795234.1795280"
    },
    {
      "text": "Naveena Karusala, Aditya Vishwanath, Arkadeep Kumar, Aman Mangal, and Neha Kumar. 2017. Care as a Resource in Underserved Learning Environments. Proc. ACM Hum.-Comput. Interact. 1, CSCW: 104:1--104:22.  ",
      "doi": "10.1145/3134739"
    },
    {
      "text": "Christopher A Le Dantec and Sarah Fox. 2015. Strangers at the Gate: Gaining Access, Building Rapport, and Co-Constructing Community-Based Research. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1348--1358.  ",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Karen E C Levy. 2015. The Contexts of Control: Information, Power, and Truck-Driving Work. The Information Society 31, 2: 160--174.",
      "doi": "10.5555/2789961.2789966"
    },
    {
      "text": "Ann Light and Yoko Akama. 2014. Structuring Future Social Relations: The Politics of Care in Participatory Practice. In Proceedings of the 13th Participatory Design Conference: Research Papers - Volume 1 (PDC '14), 151--160.  ",
      "doi": "10.1145/2661435.2661438"
    },
    {
      "text": "Panagiotis K Linos. 2012. Ten Years of EPICS at Butler University: Experiences from Crafting a Service-Learning Program for Computer Science and Software Engineering. In Service-Learning in the Computer and Information Sciences, Brian A. Nejmeh (ed.). Wiley-IEEE Press, 39--75.",
      "doi": ""
    },
    {
      "text": "Aryn Martin, Natasha Myers, and Ana Viseu. 2015. The Politics of Care in Technoscience. Social Studies of Science 45, 5: 625--641.",
      "doi": ""
    },
    {
      "text": "Jed Metzger. 2012. Teaching Civic Engagement: Evaluating an Integrative Service-Learning Program. Gateways: International Journal of Community Research and Engagement 5: 98--114.",
      "doi": ""
    },
    {
      "text": "Tania D Mitchell. 2008. Traditional vs. Critical Service-Learning: Engaging the Literature to Differentiate Two Models. Michigan Journal of Community Service Learning 14, 2: 50--65.",
      "doi": ""
    },
    {
      "text": "Tania D Mitchell. 2015. Using a Critical Service-Learning Approach to Facilitate Civic Identity Development. Theory into Practice 54, 1: 20--28.",
      "doi": ""
    },
    {
      "text": "Barbara E. Moely and Vincent Ilustre. 2014. The Impact of ServiceLearning Course Characteristics on University Students' Learning Outcomes. Michigan Journal of Community Service Learning 21, 1: 5--16.",
      "doi": ""
    },
    {
      "text": "Annemarie Mol, Ingunn Moser, and Jeannette Pols (eds.). 2010. Care in Practice: On Tinkering in Clinics, Homes and Farms. TranscriptVerlag, Bielefeld, Germany.",
      "doi": ""
    },
    {
      "text": "Bill Mollison. 1992. Permaculture: A Designers' Manual. Tagari Publications, Tyalgum, N.S.W., Australia.",
      "doi": ""
    },
    {
      "text": "Michelle Murphy. 2015. Unsettling Care: Troubling Transnational Itineraries of Care in Feminist Health Practices. Social Studies of Science 45, 5: 717--737.",
      "doi": ""
    },
    {
      "text": "Rodica Neamtu. 2013. The Classroom as an Extension of Our Society: Empowering Students through Technology in Service Learning to Bridge the Global Digital Divide. Procedia - Social and Behavioral Sciences 106: 2636--2644.",
      "doi": ""
    },
    {
      "text": "Brian A Nejmeh. 2012. Preface. In Service-Learning in Computer and Information Sciences: Practical Applications in Engineering Education, Brian A. Nejmeh (ed.). Wiley-Blackwell, Hoboken, NJ.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression: How Search Engines Reinforce Racism. NYU Press, New York.",
      "doi": ""
    },
    {
      "text": "William Oakes and J Spencer. 2005. EPICS: Engineering Projects in Community Service. 34th Annual Frontiers in Education, 2004. FIE 2004. 21, 1: 139--150.",
      "doi": ""
    },
    {
      "text": "Anna Pichelstorfer. 2012. Thematic Review of Annemarie Mol's The Logic of Care and Care in Practice. Culture Unbound 4, 2012: 533-- 535.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2011. Matters of Care in Technoscience: Assembling Neglected Things. Social Studies of Science 41, 1: 85--106.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2012. 'Nothing Comes Without Its World': Thinking with Care. The Sociological Review 60, 2: 197--216.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2015. Making Time for Soil: Technoscientific Futurity and the Pace of Care. Social Studies of Science 45, 5: 691--716.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2017. Matters of Care: Speculative Ethics in More than Human Worlds. University of Minnesota Press, Minneapolis.",
      "doi": ""
    },
    {
      "text": "Dan Richard, Cheryl Keen, Julie A Hatcher, and Heather A Pease. 2016. Pathways to Adult Civic Engagement: Benefits of Reflection and Dialogue across Difference in Higher Education ServiceLearning Programs. Michigan Journal of Community Service Learning 23, 1: 60--74.",
      "doi": ""
    },
    {
      "text": "Janet C Richards. 2017. Transformations in Graduate Education Majors' Relational Care in a Service-Learning Writing Course. Reading Improvement 54.3: 112.",
      "doi": ""
    },
    {
      "text": "Toni Robertson and Ina Wagner. 2012. Ethics: Engagement, Representation and Politics-in-Action. In Routledge Handbook of Participatory Design, Jesper Simonsen and Toni Robertson (eds.). Taylor and Francis, Hoboken, 64--87.",
      "doi": ""
    },
    {
      "text": "Tony Robinson. 2000. Service Learning as Justice Advocacy: Can Political Scientists Do Politics? PS: Political Science and Politics 33, 3: 605--612.",
      "doi": ""
    },
    {
      "text": "Jennifer A Rode. 2011. Reflexivity in Digital Anthropology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 123--132.  ",
      "doi": "10.1145/1978942.1978961"
    },
    {
      "text": "Christian Sandvig, Kevin Hamilton, Karrie Karahalios, and Cedric Langbort. 2014. Auditing Algorithms: Research Methods for Detecting Discrimination on Internet Platforms. The 64th Annual Meeting of the International Communication Association. Data and Discrimination: Converting Critical Concerns into Productive Inquiry: 1--23.",
      "doi": ""
    },
    {
      "text": "Andrew D Selbst and Solon Barocas. 2018. The Intuitive Appeal of Explainable Machines. Fordham Law Review 87, 3: 1085--1139.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1996. Steps Toward an Ecology of Infrastructure: Design and Access for Large Information Spaces. Information Systems Research 7, 1: 111--134.  ",
      "doi": "10.1287/isre.7.1.111"
    },
    {
      "text": "Isabelle Stengers. 2012. Reclaiming Animism. e-flux 36, July 2012.",
      "doi": ""
    },
    {
      "text": "Austin L Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 629--638.  ",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "David Vader. 2012. The Collaborator. In Service-Learning in the Computer and Information Sciences: Practical Applications in Engineering Education, Brian A. Nejmeh (ed.). Wiley-IEEE Press, 77-- 116.",
      "doi": ""
    },
    {
      "text": "Marie Watkins and Linda Braun. 2005. Service-Learning from Classroom to Community to Career. JIST Publishing, Inc, Indianapolis, USA.",
      "doi": ""
    },
    {
      "text": "Guy Watson and Jane Baxter. 2008. Riverford Farm Recipe Book. Fourth Estate, London.",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Cristina M Velasquez, and Neha Kumar. 2017. Social Media for Earthquake Response: Unpacking Its Limitations with Care. Proc. ACM Hum.-Comput. Interact. 1, CSCW: 112:1--112:22.  ",
      "doi": "10.1145/3134747"
    },
    {
      "text": "Ellen Zegura, Carl DiSalvo, and Amanda Meng. 2018. Care and the Practice of Data Science for Social Good. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS '18), Article 34 (June 2018), 9 pages.  ",
      "doi": "10.1145/3209811.3209877"
    }
  ]
}