{
  "doi": "10.1145/3290605.3300578",
  "title": "Lost in Style: Gaze-driven Adaptive Aid for VR Navigation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "A key challenge for virtual reality level designers is striking a balance between maintaining the immersiveness of VR and providing users with on-screen aids after designing a virtual experience. These aids are often necessary for wayfinding in virtual environments with complex paths. We introduce a novel adaptive aid that maintains the effectiveness of traditional aids, while equipping designers and users with the controls of how often help is displayed. Our adaptive aid uses gaze patterns in predicting user's need for navigation aid in VR and displays mini-maps or arrows accordingly. Using a dataset of gaze angle sequences of users navigating a VR environment and markers of when users requested aid, we trained an LSTM to classify user's gaze sequences as needing navigation help and display an aid. We validated the efficacy of the adaptive aid for wayfinding compared to other commonly-used wayfinding aids.",
  "authors": [
    {
      "name": "Rawan Alghofaili",
      "institution": "George Mason University, Fairfax, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365325",
      "orcid": "missing"
    },
    {
      "name": "Yasuhito Sawahata",
      "institution": "Japan Broadcasting Corporation, Setagaya, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343504313",
      "orcid": "missing"
    },
    {
      "name": "Haikun Huang",
      "institution": "University of Massachusetts Boston, Boston, MA, USA",
      "img": "/do/10.1145/contrib-99659254899/rel-imgonly/99659254899.png",
      "acmid": "99659254899",
      "orcid": "0000-0002-5962-0533"
    },
    {
      "name": "Hsueh-Cheng Wang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658660493",
      "orcid": "missing"
    },
    {
      "name": "Takaaki Shiratori",
      "institution": "Facebook Reality Labs, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384604905",
      "orcid": "missing"
    },
    {
      "name": "Lap-Fai Yu",
      "institution": "George Mason University, Fairfax, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487650310",
      "orcid": "0000-0002-2656-5654"
    }
  ],
  "references": [
    {
      "text": "Michael Burch. 2017. Which Symbols, Features, and Regions are Visually Attended in Metro Maps? In Intelligent Decision Technologies 2017. Springer International Publishing, 237--246.",
      "doi": ""
    },
    {
      "text": "Chin-Kai Chang, C Siagian, and L Itti. 2010. Mobile Robot Vision Navigation & Localization using Gist and Saliency. In 2010 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE.",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Mutual Human Actuation. In UIST. ACM, New York, NY, USA, 797-- 805. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk  ",
      "doi": "10.1145/3126594.3126667"
    },
    {
      "text": "Rudolph Darken and Barry Peterson. 2001. Spatial Orientation, Wayfnding, and Representation. (2001).",
      "doi": ""
    },
    {
      "text": "Anna Maria Feit, Shane Williams, Arturo Toledo, Ann Paradiso, Harish Kulkarni, Shaun Kane, and Meredith Ringel Morris. 2017. Toward everyday gaze input: Accuracy and precision of eye tracking and implications for design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1118--1130.  ",
      "doi": "10.1145/3025453.3025599"
    },
    {
      "text": "Jonathan Gandrud and Victoria Interrante. 2016. Predicting Destination Using Head Orientation and Gaze Direction During Locomotion in VR. In Proceedings of the ACM Symposium on Applied Perception (SAP '16). ACM, New York, NY, USA, 31--38.  ",
      "doi": "10.1145/2931002.2931010"
    },
    {
      "text": "Amit Garg, Joshua A. Fisher, Wesley Wang, and Karan Pratap Singh. 2017. ARES: An Application of Impossible Spaces for Natural Locomotion in VR. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 218--221.  ",
      "doi": "10.1145/3027063.3048416"
    },
    {
      "text": "Jack Goldfeather. 2012. Adaptive Redirected Walking in a Virtual World. In 2012 IEEE VR Workshop on Perceptual Illusions in Virtual Environments. IEEE.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139--183.",
      "doi": ""
    },
    {
      "text": "Rorik Henrikson, Bruno Araujo, Fanny Chevalier, Karan Singh, and Ravin Balakrishnan. 2016. Multi-Device Storyboards for Cinematic Narratives in VR. In UIST. ACM, New York, NY, USA, 787--796.  ",
      "doi": "10.1145/2984511.2984539"
    },
    {
      "text": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural Computation 9, 8 (1997), 1735--1780.  ",
      "doi": "10.1162/neco.1997.9.8.1735"
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A Method for Stochastic Optimization. arXiv preprint arXiv:1412.6980 (2014).",
      "doi": ""
    },
    {
      "text": "Christian Lander, Frederik Wiehr, Nico Herbig, Antonio Krüger, and Markus Löchtefeld. 2017. Inferring Landmarks for Pedestrian Navigation from Mobile Eye-Tracking Data and Google Street View. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 2721--2729.  ",
      "doi": "10.1145/3027063.3053201"
    },
    {
      "text": "Jooyeon Lee, Manri Cheon, Seong-Eun Moon, and Jong-Seok Lee. 2016. Peripersonal Space in Virtual Reality: Navigating 3D Space with Diferent Perspectives. In UIST (UIST '16 Adjunct). ACM, New York, NY, USA, 207--208.  ",
      "doi": "10.1145/2984751.2984772"
    },
    {
      "text": "Tianxing Li, Qiang Liu, and Xia Zhou. 2017. Ultra-Low Power Gaze Tracking for Virtual Reality. In Proceedings of the 15th ACM Conference on Embedded Network Sensor Systems. ACM, 25.  ",
      "doi": "10.1145/3131672.3131682"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In UIST. ACM, New York, NY, USA, 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Joakim Lustig. 2016. Identifying Dyslectic Gaze Pattern: Comparison of Methods for Identifying Dyslectic Readers based on Eye Movement Patterns.",
      "doi": ""
    },
    {
      "text": "Andreas Möller, Matthias Kranz, Stefan Diewald, Luis Roalter, Robert Huitl, Tobias Stockinger, Marion Koelle, and Patrick A. Lindemann. 2014. Experimental Evaluation of User Interfaces for Visual Indoor Navigation. In ACM SIGCHI. ACM, New York, NY, USA, 3607--3616.  ",
      "doi": "10.1145/2556288.2557003"
    },
    {
      "text": "Roberto A. Montano Murillo, Elia Gatti, Miguel Oliver Segovia, Marianna Obrist, Jose P. Molina Masso, and Diego Martinez Plasencia. 2017. NaviFields: Relevance Fields for Adaptive VR Navigation. In UIST. ACM, New York, NY, USA, 747--758.  ",
      "doi": "10.1145/3126594.3126645"
    },
    {
      "text": "Cuong Nguyen, Stephen DiVerdi, Aaron Hertzmann, and Feng Liu. 2017. CollaVR: Collaborative In-Headset Review for VR Video. In UIST. ACM, New York, NY, USA, 267--277.  ",
      "doi": "10.1145/3126594.3126659"
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, R. Alghofaili et al. Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-time. In UIST. ACM, New York, NY, USA, 741--754.  ",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Yun Suen Pai, Benjamin Outram, Noriyasu Vontin, and Kai Kunze. 2016. Transparent Reality: Using Eye Gaze Focus Depth As Interaction Modality. In UIST (UIST '16 Adjunct). ACM, New York, NY, USA, 171-- 172.  ",
      "doi": "10.1145/2984751.2984754"
    },
    {
      "text": "Ken Pfeufer and Hans Gellersen. 2016. Gaze and touch interaction on tablets. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 301--311.  ",
      "doi": "10.1145/2984511.2984514"
    },
    {
      "text": "L. Piccardi, M. De Luca, R. Nori, L. Palermo, F. Iachini, and C. Guariglia. 2016. Navigational Style Infuences Eye Movement Pattern during Exploration and Learning of an Environmental Map. Front Behav Neurosci 10 (2016), 140.",
      "doi": ""
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C. Whitton. 2001. Redirected Walking. In Eurographics 2001 - Short Presentations. Eurographics Association.",
      "doi": ""
    },
    {
      "text": "Deba Pratim Saha, R. Benjamin Knapp, and Thomas L. Martin. 2017. Afective Feedback in a Virtual Reality Based Intelligent Supermarket. In UbiComp. ACM, New York, NY, USA, 646--653.  ",
      "doi": "10.1145/3123024.3124426"
    },
    {
      "text": "Charles Lima Sanches, Koichi Kise, and Olivier Augereau. 2017. Japanese Reading Objective Understanding Estimation by Eye Gaze Analysis. In UbiComp. ACM, New York, NY, USA, 121--124.  ",
      "doi": "10.1145/3123024.3123092"
    },
    {
      "text": "Junichi Shimizu and George Chernyshov. 2016. Eye Movement Interactions in Google Cardboard Using a Low Cost EOG Setup. In UbiComp. ACM, New York, NY, USA, 1773--1776.  ",
      "doi": "10.1145/2968219.2968274"
    },
    {
      "text": "S. J. Tetewsky and C. J. Dufy. 1999. Visual Loss and Getting Lost in Alzheimer's Disease. Neurology 52, 5 (mar 1999), 958--958.",
      "doi": ""
    },
    {
      "text": "Jayson Turner. 2013. Cross-device Eye-based Interaction. In UIST (UIST '13 Adjunct). ACM, New York, NY, USA, 37--40.  ",
      "doi": "10.1145/2508468.2508471"
    },
    {
      "text": "Eduardo Velloso and Marcus Carter. 2016. The Emergence of EyePlay: A Survey of Eye Interaction in Games. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 171--185.  ",
      "doi": "10.1145/2967934.2968084"
    },
    {
      "text": "K. Vlcek and J. Laczo. 2014. Neural correlates of Spatial Navigation changes in Mild Cognitive Impairment and Alzheimer's Disease. Front Behav Neurosci 8 (2014), 89.",
      "doi": ""
    }
  ]
}