{
  "doi": "10.1145/3290605.3300675",
  "title": "Trigger-Action Programming for Personalising Humanoid Robot Behaviour",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "In the coming years humanoid robots will be increasingly used in a variety of contexts, thereby presenting many opportunities to exploit their capabilities in terms of what they can sense and do. One main challenge is to design technologies that enable those who are not programming experts to personalize robot behaviour. We propose an end user development solution based on trigger-action personalization rules. We describe how it supports editing such rules and its underlying software architecture, and report on a user test that involved end user developers. The test results show that users were able to perform the robot personalization tasks with limited effort, and found the trigger-action environment usable and suitable for the proposed tasks. Overall, we show the potential for using trigger-action programming to make robot behaviour personalization possible even to people who are not professional software developers.",
  "authors": [
    {
      "name": "Nicola Leonardi",
      "institution": "CNR-ISTI, Pisa, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366857",
      "orcid": "missing"
    },
    {
      "name": "Marco Manca",
      "institution": "CNR-ISTI, Pisa, Italy",
      "img": "/do/10.1145/contrib-81479660716/rel-imgonly/img_progilo.jpg",
      "acmid": "81479660716",
      "orcid": "missing"
    },
    {
      "name": "Fabio Paternò",
      "institution": "CNR-ISTI, Pisa, Italy",
      "img": "/do/10.1145/contrib-81100621721/rel-imgonly/foto-lisbona1.jpg",
      "acmid": "81100621721",
      "orcid": "missing"
    },
    {
      "name": "Carmen Santoro",
      "institution": "CNR-ISTI, Pisa, Italy",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100500187",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aldebaran 2018. NAOqi - Developer Guide - Aldebaran 2.4.3.28R2 Documentation. Retrieved August 5, 2018 from http://doc.aldebaran.com/2--4/index_dev_guide.html.",
      "doi": ""
    },
    {
      "text": "Sonya Alexandrova, Maya Cakmak, Kaijen Hsiao, and Leila Takayama. 2014. Robot Programming by Demonstration with Interactive Action Visualizations. In Proceedings of the 2014 Robotics: Science and Systems Conference.",
      "doi": ""
    },
    {
      "text": "Emilia Ivanova Barakova, Jan Gillesen, Bibi Huskens, Tino Lourens, 2013. End-user programming architecture facilitates the uptake of robots in social therapies, Robotics and Autonomous Systems, Elsevier, 61(7), 704--713.",
      "doi": ""
    },
    {
      "text": "Vincent Berenz and Kenji Suzuki, 2014. Targets-Drives-Means: A declarative approach to dynamic behavior specification with higher usability, Robotics and Autonomous Systems, Elsevier, 62(4), 545555.  ",
      "doi": "10.1016/j.robot.2013.12.010"
    },
    {
      "text": "Geoffrey Biggs and Bruce Macdonald. (2003). A survey of robot programming systems. In Proceedings of the Australasian Conference on Robotics and Automation, CSIRO, 1--10.",
      "doi": ""
    },
    {
      "text": "Nina Buchina, Sherin Kamel and Emilia Ivanova Barakova. 2016. Design and evaluation of an end-user friendly tool for robot programming. In Proceedings of IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN '16). IEEE, 185--191.",
      "doi": "10.1109/ROMAN.2016.7745109"
    },
    {
      "text": "Nico Castelli, Corinna Ogonowski, Timo Jakobi, Martin Stein, Gunnar Stevens, and Volker Wulf. 2017. What Happened in my Home? An End-User Development Approach for Smart Home Data Visualization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 853--865.  ",
      "doi": "10.1145/3025453.3025485"
    },
    {
      "text": "Fulvio Corno, Luigi de Russis, and Alberto Monge Roffarello. 2017. A High-Level Approach Towards End User Development in the IoT. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 15461552.  ",
      "doi": "10.1145/3027063.3053157"
    },
    {
      "text": "Enrique Coronado, Fulvio Mastrogiovanni, and Gentiane Venture, 2017. Node Primitives: An Open End-User Programming Platform for Social Robots, CoRR abs/1709.08363.",
      "doi": ""
    },
    {
      "text": "Angelo Costa, Ester Martinez-Martin, Miguel Cazorla, and Vicente Julian, 2018. PHAROS - PHysical Assistant RObot System, Sensors, MDPI, 18, 2633.",
      "doi": ""
    },
    {
      "text": "Joelle Coutaz and James Crowley, 2016. A first person experience with end-user development for smart home, IEEE Pervasive Computing, 15 (2), IEEE, 26:39.  ",
      "doi": "10.1109/MPRV.2016.24"
    },
    {
      "text": "José Danado and Fabio Paternò, 2014. Puzzle: A mobile application development environment using a jigsaw metaphor. Journal of Visual Languages & Computing, Elsevier, 25(4), 297--315.  ",
      "doi": "10.1016/j.jvlc.2014.03.005"
    },
    {
      "text": "Giuseppe Desolda, Carmelo Ardito and Maristella Matera, 2017. Empowering End Users to Customize their Smart Environments: Model, Composition Paradigms, and Domain-Specific Tools, ACM Transactions on Computer-Human Interaction, 24(2), ACM, Article 12, 52 pages.  ",
      "doi": "10.1145/3057859"
    },
    {
      "text": "James Diprose, Bruce MacDonald, John Hosking, and Beryl Plimmer. 2017. Designing an API at an appropriate abstraction level for programming social robot applications. Journal of Visual Languages & Computing, Elsevier, 39, C, 22--40.  ",
      "doi": "10.1016/j.jvlc.2016.07.005"
    },
    {
      "text": "Giuseppe Ghiani, Marco Manca, Fabio Paternò, and Carmen Santoro, 2017. Personalization of Context-dependent Applications through Trigger-Action Rules. ACM Transactions on Computer-Human Interaction, 24(2), ACM, Article 14, 33 pages.  ",
      "doi": "10.1145/3057861"
    },
    {
      "text": "Dylan Glas, Satoru Satake, Takayuki Kanda, Norihiro Hagita. 2012. An interaction design framework for social robots, In Proceedings of the 2012 Robotics: Science and Systems Conference.",
      "doi": ""
    },
    {
      "text": "Justin Huang and Maya Cakmak. 2017. Code3: A system for end toend programming of mobile manipulator robots for novices and experts. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 453--462.  ",
      "doi": "10.1145/2909824.3020215"
    },
    {
      "text": "Chien-Ming Huang and Bilge Mutlu. 2012. Robot behavior toolkit: generating effective social behaviors for robots. In Proceedings of the seventh annual ACM/IEEE International Conference on HumanRobot Interaction (HRI '12). ACM, New York, NY, USA, 25--32.  ",
      "doi": "10.1145/2157689.2157694"
    },
    {
      "text": "Andrew Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, Mary Beth Rosson, Gregg Rothermel, Mary Shaw, and Susan Wiedenbeck. 2011. The state of the art in enduser software engineering. ACM Comput. Surv. 43, 3, Article 21 (April 2011), 44 pages.  ",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Jannik Laval, 2018. End User Live Programming Environment for Robotics. Robotics & Automation Engineering Journal, 3(2), June 2018.",
      "doi": ""
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, Volker Wulf, 2006. End-User Development: An Emerging Paradigm. In: Lieberman, Henry, Paternò, Fabio and Wulf, Volker (eds.), Springer, End-user development (Human-Computer Interaction Series), 1--8. ",
      "doi": ""
    },
    {
      "text": "João Paulo Cardoso de Lima, Lucas Mellos Carlos, José Pedro Schardosim Simão, Josiel Pereira, Paulo Manoel Mafra, Juarez Bento da Silva, 2016. Design and implementation of a remote lab for teaching programming and robotics, IFAC-PapersOnLine, 49(30), 8691.",
      "doi": ""
    },
    {
      "text": "Tino Lourens and Emilia Ivanova Barakova. 2011. User-friendly robot environment for creation of social scenarios. In Proceedings of the 4th International Work-Conference on the Interplay Between Natural and Artificial Computation, IWINAC'11, Springer, Lecture Notes in Computer Science, 6686, 212--221. ",
      "doi": "10.5555/2009405.2009428"
    },
    {
      "text": "Panos Markopoulos, Jeffrey Nichols, Fabio Paternò and Volkmar Pipek, 2017. Editorial: End-User Development for the Internet of Things. ACM Transactions on Computer-Human Interaction 24, 2, Article 9 (April 2017), 3 pages.  ",
      "doi": "10.1145/3054765"
    },
    {
      "text": "Georgios Metaxas and Panos Markopoulos. 2017. Natural Contextual Reasoning for End Users. ACM Transactions on Computer-Human Interaction 24, 2, Article 13 (April 2017), 36 pages.  ",
      "doi": "10.1145/3057860"
    },
    {
      "text": "Yoha Oishi, Takayuki Kanda, Masayuki Kanbara, Satoru Satake, and Norihiro Hagita. 2017. Toward End-User Programming for Robots in Stores. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 233--234.  ",
      "doi": "10.1145/3029798.3038340"
    },
    {
      "text": "Emmanuel Pot, Jérôme Monceaux, Rodolphe Gelin, Bruno Maisonnier. 2009. Choregraphe: a graphical tool for humanoid robot programming. In Proceedings of the 18th IEEE International Symposium on Robot and Human Interactive Communication (ROMAN'09). IEEE, 46--51.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: programming for all. Commun. ACM 52, 11 (November 2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Allison Sauppé and Bilge Mutlu. 2014. Design patterns for exploring and prototyping human-robot interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1439--1448.  ",
      "doi": "10.1145/2556288.2557057"
    },
    {
      "text": "Frederic Siepmann and Sven Wachsmuth, 2011. A Modeling Framework for Reusable Social Behavior. In R. De Silva & D. Reidsma (Eds.), International Conference on Social Robotics, Workin-Progress Workshop Proceedings, Springer, 93--96.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, and Michael L. Littman. 2014. Practical trigger-action programming in the smart home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 803812.  ",
      "doi": "10.1145/2556288.2557420"
    },
    {
      "text": "Jan Van den Bergh, Fredy Cuenca Lucero, Kris Luyten, and Karin Coninx. 2016. Toward specifying Human-Robot Collaboration with composite events. In Proceedings of the IEEE International Symposium on Robot and Human Interactive Communication (ROMAN'16), New York, NY, USA, IEEE Press, 896--901.",
      "doi": "10.1109/ROMAN.2016.7745225"
    },
    {
      "text": "David Weintrop, Afsoon Afzal, Jean Salac, Patrick Francis, Boyang Li, David C. Shepherd, and Diana Franklin. 2018. Evaluating CoBlox: A Comparative Study of Robotics Programming Environments for Adult Novices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 366, 12 pages.  ",
      "doi": "10.1145/3173574.3173940"
    }
  ]
}