{
  "doi": "10.1145/3290605.3300803",
  "title": "Visualizing Uncertainty and Alternatives in Event Sequence Predictions",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Data analysts apply machine learning and statistical methods to timestamped event sequences to tackle various problems but face unique challenges when interpreting the results. Especially in event sequence prediction, it is difficult to convey uncertainty and possible alternative paths or outcomes. In this work, informed by interviews with five machine learning practitioners, we iteratively designed a novel visualization for exploring event sequence predictions of multiple records where users are able to review the most probable predictions and possible alternatives alongside uncertainty information. Through a controlled study with 18 participants, we found that users are more confident in making decisions when alternative predictions are displayed and they consider the alternatives more when deciding between two options with similar top predictions.",
  "tags": [
    "event sequence analysis",
    "uncertainty visualization",
    "predictive visual analytics",
    "decision making"
  ],
  "authors": [
    {
      "name": "Shunan Guo",
      "institution": "East China Normal University, ShangHai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261837",
      "orcid": "0000-0001-5355-8399"
    },
    {
      "name": "Fan Du",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-87658692957/rel-imgonly/img_2623.jpg",
      "acmid": "87658692957",
      "orcid": "0000-0002-4383-8888"
    },
    {
      "name": "Sana Malik",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158661357",
      "orcid": "missing"
    },
    {
      "name": "Eunyee Koh",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310489834",
      "orcid": "0000-0003-2091-5972"
    },
    {
      "name": "Sungchul Kim",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260038",
      "orcid": "missing"
    },
    {
      "name": "Zhicheng Liu",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385599440",
      "orcid": "missing"
    },
    {
      "name": "Donghyun Kim",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658748702",
      "orcid": "missing"
    },
    {
      "name": "Hongyuan Zha",
      "institution": "East China Normal University, ShangHai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100528811",
      "orcid": "missing"
    },
    {
      "name": "Nan Cao",
      "institution": "Tongji University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320488328",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jeroen CJH Aerts, Keith C Clarke, and Alex D Keuper. 2003. Testing popular visualization techniques for representing model uncertainty. Cartography and Geographic Information Science 30, 3 (2003), 249--261.",
      "doi": ""
    },
    {
      "text": "Anthony D Andre and Henry A Cutler. 1998. Displaying uncertainty in advanced navigation systems. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 42. 31--35.",
      "doi": ""
    },
    {
      "text": "Syed Z Arshad, Jianlong Zhou, Constant Bridon, Fang Chen, and Yang Wang. 2015. Investigating user confidence for uncertainty presentation in predictive decision making. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. 352--360.  ",
      "doi": "10.1145/2838739.2838753"
    },
    {
      "text": "Ragnar Bade, Stefan Schlechtweg, and Silvia Miksch. 2004. Connecting time-oriented data and information to a coherent interactive visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 105--112.  ",
      "doi": "10.1145/985692.985706"
    },
    {
      "text": "Georges-Pierre Bonneau, Hans-Christian Hege, Chris R Johnson, Manuel M Oliveira, Kristin Potter, Penny Rheingans, and Thomas Schultz. 2014. Overview and state-of-the-art of uncertainty visualization. In Scientific Visualization. Springer, 3--27.",
      "doi": ""
    },
    {
      "text": "Nadia Boukhelifa, Anastasia Bezerianos, Tobias Isenberg, and JeanDaniel Fekete. 2012. Evaluating sketchiness as a visual variable for the depiction of qualitative uncertainty. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2769--2778.  ",
      "doi": "10.1109/TVCG.2012.220"
    },
    {
      "text": "Ken Brodlie, Rodolfo Allendes Osorio, and Adriano Lopes. 2012. A review of uncertainty in data visualization. In Expanding the Frontiers of Visual Analytics and Visualization. 81--109.",
      "doi": ""
    },
    {
      "text": "Andrej Cedilnik and Penny Rheingans. 2000. Procedural annotation of uncertain information. In Proceedings of the Conference on Visualization. 77--83. ",
      "doi": "10.5555/375213.375221"
    },
    {
      "text": "Charles Chen, Sungchul Kim, Hung Bui, Ryan Rossi, Eunyee Koh, Branislav Kveton, and Razvan Bunescu. 2018. Predictive analysis by leveraging temporal user behavior and user embeddings. In ACM International Conference on Information and Knowledge Management.  ",
      "doi": "10.1145/3269206.3272032"
    },
    {
      "text": "Christopher Collins, M Sheelagh T Carpendale, and Gerald Penn. 2007. Visualization of uncertainty in lattices to support decision-making.. In EuroVis. 51--58. ",
      "doi": "10.5555/2384179.2384187"
    },
    {
      "text": "Michael Correll, Dominik Moritz, and Jeffrey Heer. 2018. Valuesuppressing uncertainty palettes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 642.  ",
      "doi": "10.1145/3173574.3174216"
    },
    {
      "text": "Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. 2016. EventAction: Visual analytics for temporal event sequence recommendation. In Proceedings of the IEEE Visual Analytics Science and Technology. 61--70.",
      "doi": ""
    },
    {
      "text": "Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. 2017. Finding similar people to guide life choices: Challenge, design, and evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 5498--5544.  ",
      "doi": "10.1145/3025453.3025777"
    },
    {
      "text": "Fan Du, Ben Shneiderman, Catherine Plaisant, Sana Malik, and Adam Perer. 2017. Coping with volume and variety in temporal event sequences: strategies for sharpening analytic focus. IEEE Transactions on Visualization and Computer Graphics 23, 6 (2017), 1636--1649.  ",
      "doi": "10.1109/TVCG.2016.2539960"
    },
    {
      "text": "Richard Finger and Ann M Bisantz. 2002. Utilizing graphical formats to convey uncertainty in a decision-making task. Theoretical Issues in Ergonomics Science 3, 1 (2002), 1--25.",
      "doi": ""
    },
    {
      "text": "Felix A Gers, Jürgen Schmidhuber, and Fred Cummins. 1999. Learning to forget: Continual prediction with LSTM. (1999).",
      "doi": ""
    },
    {
      "text": "Jochen Görtler, Christoph Schulz, Daniel Weiskopf, and Oliver Deussen. 2018. Bubble treemaps for uncertainty visualization. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 719--728.",
      "doi": ""
    },
    {
      "text": "David Gotz and Harry Stavropoulos. 2014. DecisionFlow: Visual analytics for high-dimensional temporal event sequence data. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1783--1792.",
      "doi": ""
    },
    {
      "text": "Nitesh Goyal and Susan R Fussell. 2016. Effects of sensemaking translucence on distributed collaborative analysis. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing. 288--302.  ",
      "doi": "10.1145/2818048.2820071"
    },
    {
      "text": "Nitesh Goyal and Susan R Fussell. 2017. Intelligent interruption management using electro dermal activity based physiological sensor for collaborative sensemaking. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 52:1--52:21.  ",
      "doi": "10.1145/3130917"
    },
    {
      "text": "Miriam Greis, Aditi Joshi, Ken Singer, Albrecht Schmidt, and Tonja Machulla. 2018. Uncertainty visualization influences how humans aggregate discrepant information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 505:1--505:12.  ",
      "doi": "10.1145/3173574.3174079"
    },
    {
      "text": "Miriam Greis, Hendrik Schuff, Marius Kleiner, Niels Henze, and Albrecht Schmidt. 2017. Input controls for entering uncertain data: Probability distribution sliders. Proceedings of the ACM on Human-Computer Interaction 1, EICS (2017), 3:1--3:17.  ",
      "doi": "10.1145/3095805"
    },
    {
      "text": "Paul KJ Han, William MP Klein, and Neeraj K Arora. 2011. Varieties of uncertainty in health care: A conceptual taxonomy. Medical Decision Making 31, 6 (2011), 828--838.",
      "doi": ""
    },
    {
      "text": "William Harbaugh, Kate Krause, and Lise Vesterlund. 2002. Prospect theory in choice and pricing tasks. (2002).",
      "doi": ""
    },
    {
      "text": "Beverly L Harrison, Russell Owen, and Ronald M Baecker. 1994. Timelines: An interactive system for the collection and visualization of temporal data. In Graphics Interface. 141--141.",
      "doi": ""
    },
    {
      "text": "Shiping Huang. 2005. Exploratory visualization of data with variable quality. Ph.D. Dissertation. Worcester Polytechnic Institute.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Xiaoli Qiao, Michael Correll, Alex Kale, and Matthew Kay. 2019. In pursuit of error: A survey of uncertainty visualization evaluation. IEEE Transactions on Visualization and Computer Graphics 25, 1 (2019), 903--913.",
      "doi": "10.1109/TVCG.2018.2864889"
    },
    {
      "text": "Susan Joslyn and Jared LeClerc. 2013. Decisions with uncertainty: The glass half full. Current Directions in Psychological Science 22, 4 (2013), 308--315.",
      "doi": ""
    },
    {
      "text": "Susan Joslyn, Karla Pak, David Jones, John Pyles, and Earl Hunt. 2007. The effect of probabilistic information on threshold forecasts. Weather and Forecasting 22, 4 (2007), 804--812.",
      "doi": ""
    },
    {
      "text": "Susan L Joslyn and Jared E LeClerc. 2012. Uncertainty forecasts improve weather-related decisions and attenuate the effects of forecast error. Journal of Experimental Psychology: Applied 18, 1 (2012), 126.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Prospect theory: An analysis of decision under risk. In Handbook of the Fundamentals of Financial Decision Making. 99--127.",
      "doi": ""
    },
    {
      "text": "Gerald M Karam. 1994. Visualization using timelines. In Proceedings of the ACM International Symposium on Software Testing and Analysis. 125--137.  ",
      "doi": "10.1145/186258.187157"
    },
    {
      "text": "Mykel J Kochenderfer. 2015. Decision Making Under Uncertainty: Theory and Application. MIT Press. ",
      "doi": "10.5555/2815660"
    },
    {
      "text": "Josua Krause, Adam Perer, and Kenney Ng. 2016. Interacting with predictions: Visual inspection of black-box machine learning models. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 5686--5697.  ",
      "doi": "10.1145/2858036.2858529"
    },
    {
      "text": "Max Kuhn and Kjell Johnson. 2013. Applied Predictive Modeling. Vol. 26. Springer.",
      "doi": ""
    },
    {
      "text": "Alexander Kumpf, Bianca Tost, Marlene Baumgart, Michael Riemer, Rüdiger Westermann, and Marc Rautenhaus. 2018. Visualizing confidence in cluster-based ensemble weather forecast analyses. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 109-- 119.",
      "doi": ""
    },
    {
      "text": "Jared LeClerc and Susan Joslyn. 2015. The cry wolf effect and weatherrelated decision making. Risk Analysis 35, 3 (2015), 385--395.",
      "doi": ""
    },
    {
      "text": "Mengchen Liu, Shixia Liu, Xizhou Zhu, Qinying Liao, Furu Wei, and Shimei Pan. 2016. An uncertainty-aware approach for exploratory microblog retrieval. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 250--259.",
      "doi": "10.1109/TVCG.2015.2467554"
    },
    {
      "text": "Alan M MacEachren. 1992. Visualizing uncertain information. Cartographic Perspectives 13 (1992), 10--19.",
      "doi": ""
    },
    {
      "text": "Sana Malik, Fan Du, Megan Monroe, Eberechukwu Onukwugha, Catherine Plaisant, and Ben Shneiderman. 2015. Cohort comparison of event sequences with balanced integration of visual analytics and statistics. In Proceedings of the International Conference on Intelligent User Interfaces. 38--49.  ",
      "doi": "10.1145/2678025.2701407"
    },
    {
      "text": "Megan Monroe, Rongjian Lan, Hanseung Lee, Catherine Plaisant, and Ben Shneiderman. 2013. Temporal event sequence simplification. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2227--2236.  ",
      "doi": "10.1109/TVCG.2013.200"
    },
    {
      "text": "Tamara Munzner. 2009. A nested process model for visualization design and validation. IEEE Transactions on Visualization and Computer Graphics 6 (2009), 921--928.  ",
      "doi": "10.1109/TVCG.2009.111"
    },
    {
      "text": "Alex T Pang, Craig M Wittenbrink, and Suresh K Lodha. 1997. Approaches to uncertainty visualization. The Visual Computer 13, 8 (1997), 370--390.",
      "doi": ""
    },
    {
      "text": "Adam Perer and David Gotz. 2013. Data-driven exploration of care plans for patients. In CHI Extended Abstracts on Human Factors in Computing Systems. 439--444.  ",
      "doi": "10.1145/2468356.2468434"
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widoff, and Ben Shneiderman. 1996. LifeLines: Visualizing personal histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 221--227.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Catherine Plaisant, Rich Mushlin, Aaron Snyder, Jia Li, Daniel Heller, and Ben Shneiderman. 1998. LifeLines: Using visualization to enhance navigation and analysis of patient records. In Proceedings of the AMIA Symposium. 76--80.",
      "doi": ""
    },
    {
      "text": "Maria H Ramos, Schalk J Van Andel, and Florian Pappenberger. 2013. Do probabilistic forecasts lead to better decisions? Hydrology and Earth System Sciences 17, 6 (2013), 2219--2232.",
      "doi": ""
    },
    {
      "text": "Philip J Rhodes, Robert S Laramee, R Daniel Bergeron, Ted M Sparr, et al. 2003. Uncertainty visualization methods in isosurface rendering. In Eurographics, Vol. 2003. 83--88.",
      "doi": ""
    },
    {
      "text": "Patrick Riehmann, Manfred Hanfler, and Bernd Froehlich. 2005. Interactive Sankey diagrams. In IEEE Symposium on Information Visualization. 233--240.  ",
      "doi": "10.1109/INFOVIS.2005.21"
    },
    {
      "text": "Maria Riveiro. 2007. Evaluation of uncertainty visualization techniques for information fusion. In International Conference on Information Fusion. 1--8.",
      "doi": ""
    },
    {
      "text": "Dominik Sacha, Hansi Senaratne, Bum Chul Kwon, Geoffrey Ellis, and Daniel A Keim. 2016. The role of uncertainty, awareness, and trust in visual analytics. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 240--249.",
      "doi": "10.1109/TVCG.2015.2467591"
    },
    {
      "text": "Sam L Savage and Harry M Markowitz. 2009. The Flaw of Averages: Why We Underestimate Risk in the Face of Uncertainty. John Wiley and Sons.",
      "doi": ""
    },
    {
      "text": "Eric Siegel. 2013. Predictive Analytics: The Power to Predict Who Will Click, Buy, Lie, or Die. Wiley Hoboken. ",
      "doi": "10.5555/2544012"
    },
    {
      "text": "Vlad V Simianu, Margaret A Grounds, Susan L Joslyn, Jared E LeClerc, Anne P Ehlers, Nidhi Agrawal, Rafael Alfonso-Cristancho, Abraham D Flaxman, and David R Flum. 2016. Understanding clinical and nonclinical decisions under uncertainty: A scenario-based survey. BMC Medical Informatics and Decision Making 16, 1 (2016), 153.",
      "doi": ""
    },
    {
      "text": "Susanne Tak, Alexander Toet, and Jan van Erp. 2014. The perception of visual uncertainty representation by non-experts. IEEE Transactions on Visualization and Computer Graphics 20, 6 (2014), 935--943.  ",
      "doi": "10.1109/TVCG.2013.247"
    },
    {
      "text": "Zana Vosough, Dietrich Kammer, Mandy Keck, and Rainer Groh. 2017. Visualizing uncertainty in flow diagrams: A case study in product costing. In Proceedings of the International Symposium on Visual Information Communication and Interaction. 1--8.  ",
      "doi": "10.1145/3105971.3105972"
    },
    {
      "text": "Elke U Weber, Ann-Renee Blais, and Nancy E Betz. 2002. A domainspecific risk-attitude scale: Measuring risk perceptions and risk behaviors. Journal of Behavioral Decision Making 15, 4 (2002), 263--290.",
      "doi": ""
    },
    {
      "text": "Robert L Winkler. 2015. The importance of communicating uncertainties in forecasts: Overestimating the risks from winter storm Juno. Risk Analysis 35, 3 (2015), 349--353.",
      "doi": ""
    },
    {
      "text": "Craig M Wittenbrink, Alex T Pang, and Suresh K Lodha. 1996. Glyphs for visualizing uncertainty in vector fields. IEEE Transactions on Visualization and Computer Graphics 3 (1996), 266--279.  ",
      "doi": "10.1109/2945.537309"
    },
    {
      "text": "Krist Wongsuphasawat and David Gotz. 2012. Exploring flow, factors, and outcomes of temporal event sequences with the Outflow visualization. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2659--2668.  ",
      "doi": "10.1109/TVCG.2012.225"
    },
    {
      "text": "Krist Wongsuphasawat, John Alexis Guerra Gómez, Catherine Plaisant, Taowei David Wang, Meirav Taieb-Maimon, and Ben Shneiderman. 2011. LifeFlow: Visualizing an overview of event sequences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1747--1756.  ",
      "doi": "10.1145/1978942.1979196"
    },
    {
      "text": "Krist Wongsuphasawat and Jimmy Lin. 2014. Using visualizations to monitor changes and harvest insights from a global-scale logging infrastructure at Twitter. In IEEE Conference on Visual Analytics Science and Technology. 113--122.",
      "doi": ""
    },
    {
      "text": "Jian Zhao, Zhicheng Liu, Mira Dontcheva, Aaron Hertzmann, and Alan Wilson. 2015. MatrixWave: Visual comparison of event sequence data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 259--268.  ",
      "doi": "10.1145/2702123.2702419"
    }
  ]
}