{
  "doi": "10.1145/3290605.3300381",
  "title": "\"Pretty Close to a Must-Have\": Balancing Usability Desire and Security Concern in Biometric Adoption",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We report on a qualitative inquiry among security-expert and non-expert mobile device users about the adoption of biometric authentication using semi-structured interviews(n=38, 19/19 expert/non-expert). Security experts more readily adopted biometrics than non-experts but also harbored greater distrust towards its use for sensitive transactions,feared biometric signature compromise, and in some cases distrusted newer facial recognition methods. Both groups harbored misconceptions, such as misunderstanding of the functional role of biometrics in authentication, and were about equally likely to have stopped using biometrics due to usability. Implications include the need for tailored training for security-informed advocates, better design for device sharing and co-registration, and consideration for usability needs in work environments. Refinement of these features would remove perceived obstacles to ubiquitous computing among the growing population of mobile technology users sensitized to security risk.",
  "tags": [
    "biometric adoption",
    "security expertise",
    "authentication",
    "mobile device"
  ],
  "authors": [
    {
      "name": "Flynn Wolf",
      "institution": "University of Maryland, Baltimore County, Baltimore, MD, USA",
      "img": "/do/10.1145/contrib-83358959757/rel-imgonly/fw_bw_stp_01.gif",
      "acmid": "83358959757",
      "orcid": "missing"
    },
    {
      "name": "Ravi Kuber",
      "institution": "University of Maryland, Baltimore County, Baltimore, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100464526",
      "orcid": "missing"
    },
    {
      "name": "Adam J. Aviv",
      "institution": "United States Naval Academy, Annapolis, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392608516",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Farzaneh Asgharpour, Debin Liu, and L. Jean Camp. 2007. Mental Models of Security Risks. In Financial Cryptography and Data Security, Sven Dietrich and Rachna Dhamija (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 367--377. ",
      "doi": "10.5555/1785594.1785641"
    },
    {
      "text": "Chandrasekhar Bhagavatula, Blase Ur, Kevin Iacovino, Su Mon Kywe, Lorrie Faith Cranor, and Marios Savvides. 2015. Biometric authentication on iphone and android: Usability, perceptions, and influences on adoption. In Procedings of the Workshop on Usable Security (USEC).",
      "doi": ""
    },
    {
      "text": "Antonio Bianchi, Yanick Fratantonio, Aravind Machiry, Christopher Kruegel, Giovanni Vigna, Simon Pak Ho Chung, and Wenke Lee. 2018. Broken Fingers: On the Usage of the Fingerprint API in Android. In Proceedings of the Network and Distributed System Security Symposium, NDSS.",
      "doi": ""
    },
    {
      "text": "Cristian Bravo-Lillo, Lorrie Faith Cranor, Julie Downs, and Saranga Komanduri. 2011. Bridging the gap in computer security warnings: A mental model approach. IEEE Security & Privacy 9, 2 (2011), 18--26.  ",
      "doi": "10.1109/MSP.2010.198"
    },
    {
      "text": "Jean Camp, Farzaneh Asgharpour, and Debin Liu. 2007. Experimental evaluations of expert and non-expert computer users' mental models of security risks. Proceedings of WEIS 2007 (2007).",
      "doi": ""
    },
    {
      "text": "Ivan Cherapau, Ildar Muslukhov, Nalin Asanka, and Konstantin Beznosov. 2015. On the Impact of Touch ID on iPhone Passcodes.. In SOUPS. 257--276. ",
      "doi": "10.5555/3235866.3235888"
    },
    {
      "text": "Heather Crawford and Karen Renaud. 2014. Understanding user perceptions of transparent authentication on a mobile device. Journal of Trust Management 1, 1 (2014), 7.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Joanne Lo, Laura Dabbish, and Jason I. Hong. 2018. Breaking! A Typology of Security and Privacy News and How It's Shared. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 1, 12 pages.  ",
      "doi": "10.1145/3173574.3173575"
    },
    {
      "text": "Alexander De Luca, Alina Hang, Emanuel von Zezschwitz, and Heinrich Hussmann. 2015. I Feel Like I'm Taking Selfies All Day!: Towards Understanding Biometric Authentication on Smartphones. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1411--1414.  ",
      "doi": "10.1145/2702123.2702141"
    },
    {
      "text": "Julie S. Downs, Mandy B. Holbrook, and Lorrie Faith Cranor. 2006. Decision Strategies and Susceptibility to Phishing. In Proceedings of the Second Symposium on Usable Privacy and Security (SOUPS '06). ACM, New York, NY, USA, 79--90.  ",
      "doi": "10.1145/1143120.1143131"
    },
    {
      "text": "The Center for Cyber Safety, Risk Management Education, Executive Women's Forum on Information Security, Frost Privacy, and Sullivan. 2017. The 2017 Global Information Security Workforce Study: Women in Cybersecurity. Retrieved July 05, 2018 from https://iamcybersafe. org/wp-content/uploads/2017/03/WomensReport.pdf",
      "doi": ""
    },
    {
      "text": "Batya Friedman, David Hurley, Daniel C. Howe, Edward Felten, and Helen Nissenbaum. 2002. Users' Conceptions of Web Security: A Comparative Study. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 746--747.  ",
      "doi": "10.1145/506443.506577"
    },
    {
      "text": "Julie M. Haney and Wayne G. Lutters. 2018. \"It's Scary...It's Confusing...It's Dull\": How Cybersecurity Advocates Overcome Negative Perceptions of Security. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, 411-- 425. https://www.usenix.org/conference/soups2018/presentation/ haney-perceptions ",
      "doi": "10.5555/3291228.3291261"
    },
    {
      "text": "Jun Ho Huh, Saurabh Verma, Swathi Sri V Rayala, Rakesh B Bobba, Konstantin Beznosov, and Hyoungshick Kim. 2017. I Don't Use Apple Pay Because It's Less Secure...: Perception of Security and Usability in Mobile Tap-and-Pay. In Workshop on Usable Security (USEC). 15--41.",
      "doi": ""
    },
    {
      "text": "Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. \"... No one Can Hack My Mind\": Comparing Expert and Non-Expert Security Practices.. In SOUPS, Vol. 15. 1--20. ",
      "doi": "10.5555/3235866.3235893"
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. My data just goes everywhere: user mental models of the internet and implications for privacy and security. In Symposium on Usable Privacy and Security (SOUPS). USENIX Association Berkeley, CA, 39--52. ",
      "doi": "10.5555/3235866.3235870"
    },
    {
      "text": "Sevasti Karatzouni, Steven M Furnell, Nathan L Clarke, and Reinhardt A Botha. 2007. Perceptions of user authentication on mobile devices. In Proceedings of the ISOneWorld Conference. 11--13.",
      "doi": ""
    },
    {
      "text": "Samsung Knox. 2018. https://www.samsungknox.com/en/ knox-platform/knox-security Accessed: 2018-09--18.",
      "doi": ""
    },
    {
      "text": "L. M. Mayron. 2015. Biometric Authentication on Mobile Devices. IEEE Security Privacy 13, 3 (May-June 2015), 70--73.",
      "doi": "10.1109/MSP.2015.67"
    },
    {
      "text": "W. Meng, D. S. Wong, S. Furnell, and J. Zhou. 2015. Surveying the Development of Biometric User Authentication on Mobile Phones. IEEE Communications Surveys Tutorials 17, 3 (thirdquarter 2015), 1268-- 1293.",
      "doi": "10.1109/COMST.2014.2386915"
    },
    {
      "text": "Rawlson O'Neil King. 2015. Mobile Biometrics Market Analysis. Technical Report. Biometrics Research Group, Inc. https://www.biometricupdate.com/wp-content/uploads/2015/ 10/287127021-Mobile-Biometrics-Market-Analysis-5.pdf",
      "doi": ""
    },
    {
      "text": "Cheul Young Park, Cori Faklaris, Siyan Zhao, Alex Sciuto, Laura Dabbish, and Jason Hong. 2018. Share and Share Alike? An Exploration of Secure Behaviors in Romantic Relationships. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, 83--102. https://www.usenix.org/conference/soups2018/ presentation/park ",
      "doi": "10.5555/3291228.3291236"
    },
    {
      "text": "Emilee Rader and Rick Wash. 2015. Identifying patterns in informal sources of security information. Journal of Cybersecurity 1, 1 (2015), 121--144.",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Rick Wash, and Brandon Brooks. 2012. Stories As Informal Lessons About Security. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, New York, NY, USA, Article 6, 17 pages.  ",
      "doi": "10.1145/2335356.2335364"
    },
    {
      "text": "Abdullah Rashed and Nancy Alajarmeh. 2015. Towards understanding user perceptions of biometrics authentication technologies. International Journal of Computer Science and Information Security 13, 6 (2015), 25.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Ruben Deyhle, and Michael Weber. 2012. Password Entry Usability and Shoulder Surfing Susceptibility on Different Smartphone Platforms. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, New York, NY, USA, Article 13, 10 pages.  ",
      "doi": "10.1145/2406367.2406384"
    },
    {
      "text": "Elizabeth Stobert and Robert Biddle. 2015. Expert password management. In International Conference on Passwords. Springer, 3--20.",
      "doi": ""
    },
    {
      "text": "Harry Thornburg. January, 2018. iOS Security Guide: iOS 11. Retrieved May 22, 2018 from https://www.apple.com/business/docs/iOS_ Security_Guide.pdf",
      "doi": ""
    },
    {
      "text": "Shari Trewin, Cal Swart, Larry Koved, Jacquelyn Martino, Kapil Singh, and Shay Ben-David. 2012. Biometric Authentication on a Mobile Device: A Study of User Effort, Error and Task Disruption. In Proceedings of the 28th Annual Computer Security Applications Conference (ACSAC '12). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/2420950.2420976"
    },
    {
      "text": "Emanuel von Zezschwitz, Paul Dunphy, and Alexander De Luca. 2013. Patterns in the Wild: A Field Study of the Usability of Pattern and Pin-based Authentication on Mobile Devices. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 261-- 270.  ",
      "doi": "10.1145/2493190.2493231"
    },
    {
      "text": "Rick Wash. 2010. Folk Models of Home Computer Security. In Proceedings of the Sixth Symposium on Usable Privacy and Security (SOUPS '10). ACM, New York, NY, USA, Article 11, 16 pages.  ",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Rick Wash and Emilee Rader. 2011. Influencing mental models of security: a research agenda. In Proceedings of the 2011 New Security Paradigms Workshop (NSPW '11). ACM, New York, NY, USA, 57--66.  ",
      "doi": "10.1145/2073276.2073283"
    },
    {
      "text": "Alma Whitten and J Doug Tygar. 1999. Why Johnny Can't Encrypt: A Usability Evaluation of PGP 5.0.. In USENIX Security Symposium, Vol. 348. ",
      "doi": "10.5555/1251421.1251435"
    },
    {
      "text": "Flynn Wolf, Ravi Kuber, and Adam J Aviv. 2018. An empirical study examining the perceptions and behaviours of security-conscious users of mobile authentication. Behaviour & Information Technology 37, 4 (2018), 320--334.",
      "doi": ""
    }
  ]
}