{
  "doi": "10.1145/3290605.3300237",
  "title": "Connect-to-Connected Worlds: Piloting a Mobile, Data-Driven Reflection Tool for an Open-Ended Simulation at a Museum",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Immersive open-ended museum exhibits promote ludic engagement and can be a powerful draw for visitors, but these qualities may also make learning more challenging. We describe our efforts to help visitors engage more deeply with an interactive exhibit's content by giving them access to visualizations of data skimmed from their use of the exhibit. We report on the motivations and challenges in designing this reflective tool, which positions visitors as a \"human in the loop\" to understand and manage their engagement with the exhibit. We used an iterative design process and qualitative methods to explore how and if visitors could (1) access and (2) comprehend the data visualizations, (3) reflect on their prior engagement with the exhibit, (4)plan their future engagement with the exhibit, and (5) act on their plans. We further discuss the essential design challenges and the opportunities made possible for visitors through data-driven reflection tools.",
  "tags": [
    "reflective informatics",
    "cscl",
    "museum exhibit design",
    "systems thinking",
    "informal data literacy"
  ],
  "authors": [
    {
      "name": "Aditi Mallavarapu",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366256",
      "orcid": "missing"
    },
    {
      "name": "Leilah Lyons",
      "institution": "University of Illinois at Chicago & New York Hall of Science, Corona, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338490124",
      "orcid": "missing"
    },
    {
      "name": "Stephen Uzzo",
      "institution": "New York Hall of Science, Corona, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658730220",
      "orcid": "missing"
    },
    {
      "name": "Wren Thompson",
      "institution": "New York Hall of Science, Corona, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367194",
      "orcid": "missing"
    },
    {
      "name": "Rinat Levy-Cohen",
      "institution": "Fordham University, New York, NY, USA",
      "img": "/do/10.1145/contrib-99659123372/rel-imgonly/screenshot2016-12-23at4.06.01pm.png",
      "acmid": "99659123372",
      "orcid": "missing"
    },
    {
      "name": "Brian Slattery",
      "institution": "University of Illinois at Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498654163",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sue Allen and Joshua P. Gutwill. 2004. Designing With Multiple Interactives: Five Common Pitfalls. Curator 47, 2 (2004), 199--212.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Zezhong Wang, Farinella Matteo, Dave Murray-Rust, and Nathalie Henry Riche. 2018. Design Patterns for Data Comics. In ACM Conference on Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/3173574.3173612"
    },
    {
      "text": "Pierre Balloffet, Francois H. Courvoisier, and Joelle Lagier. 2014. From Museum to Amusement Park: The Opportunities and Risks of Edutainment. International Journal of Arts Management 16, 2 (2014), 4--16. http://icom.museum/la-vision/defi-",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus and Chiara Rossitto. 2016. Acting with Technology. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 864--875.  ",
      "doi": "10.1145/2858036.2858344"
    },
    {
      "text": "Eric P.S. Baumer. 2015. Reflective Informatics. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. 585--594.  ",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Robert Bodily and Katrien Verbert. 2017. Trends and issues in studentfacing learning analytics reporting systems research. In Proceedings of the Seventh International Learning Analytics and Knowledge Conference on-LAK'17. ACM Press, New York, 309--318.  ",
      "doi": "10.1145/3027385.3027403"
    },
    {
      "text": "Katy Börner, Adam Maltese, Russell Nelson Balliet, and Joe Heimlich. 2016. Investigating aspects of data visualization literacy using 20 information visualizations and 273 science museum visitors. Information Visualization 15, 3 (2016), 198--213.  ",
      "doi": "10.1177/1473871615594652"
    },
    {
      "text": "Ann L. Brown, John D. Bransford, R. A. Ferrara, and J. C. Campione. 1983. Learning, remembering, and understanding. In Handbook of child psychology: Cognitive development (iii ed.), P. H. Mussen (Ed.). Wiley, New York, 77--166.",
      "doi": ""
    },
    {
      "text": "R W Carlisle. 1985. What Do School Children Do at a Science Center? Curator 28, 1 (1985).",
      "doi": ""
    },
    {
      "text": "Tamara Clegg, Jason Yip, Elizabeth Bonsignore, Jon Froehlich, Leyla Norooz, Seokbin Kang, Virginia Byrne, Monica Katzen, Rafael Valez, Angelisa Plane, Vanessa Oguamanam, and Thomas Outing. 2017. Live Physiological Sensing and Visualization Ecosystems. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems CHI '17. 2029--2041.  ",
      "doi": "10.1145/3025453.3025987"
    },
    {
      "text": "Vanessa Colella. 2000. Participatory Simulations: Building Collaborative Understanding Through Immersive Dynamic Modeling. Journal of the Learning Sciences 9, 4 (oct 2000), 471--500.",
      "doi": ""
    },
    {
      "text": "Kevin J. Crowley, Maureen A. Callanan, Jennifer L. Jipson, Jodi Galco, Karen Topping, and Jeff Shrager. 2001. Shared scientific thinking in everyday parent-child activity. Science Education 85, 6 (2001), 712--732.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Kim Hermanson. 1995. Intrinsic Motivation in Museums: Why Does One Wants to Learn? Public institutions for personal learning, Establishing a research agenda (1995), 67--77.",
      "doi": ""
    },
    {
      "text": "E A Davis. 2003. Prompting Middle School Science Students for Productive Reflection: Generic and Directed Prompts. Journal of the Learning Sciences 12, 1 (2003), 91--142.",
      "doi": ""
    },
    {
      "text": "John H Falk. 2006. An Identity-Centered Approach to Understanding Museum Learning. Curator 49, 2 (2006), 151--166.",
      "doi": ""
    },
    {
      "text": "John Howard Falk and Lynn Diane Dierking. 2000. Learning from museums: Visitor experiences and the making of meaning. AltaMira Press, Walnut Creek. 272 pages.",
      "doi": ""
    },
    {
      "text": "Andrew Garbett, David Chatting, Gerard Wilkinson, Clement Lee, and Ahmed Kharrufa. 2018. ThinkActive. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. 1--13.  ",
      "doi": "10.1145/3173574.3173581"
    },
    {
      "text": "William W Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The drift table. In Extended abstracts of the 2004 conference on Human factors and computing systems - CHI '04. 885.",
      "doi": ""
    },
    {
      "text": "S. Govaerts, K. Verbert, E. Duval, and A. Pardo. 2012. The student activity meter for awareness and self-reflection. In Extended abstracts on human factors in computing systems (CHI EA '12). 869--884.  ",
      "doi": "10.1145/2212776.2212860"
    },
    {
      "text": "James G D B WorldCat D P OCLC Greeno. 2006. Learning in activity. In The Cambridge handbook of the learning sciences, R Keith Sawyer (Ed.). Cambridge University Press, New York.",
      "doi": ""
    },
    {
      "text": "Joshua P. Gutwill. 2008. Challenging a Common Assumption of Hands-On Exhibits: How Counterintuitive Phenomena Can Undermine Inquiry. The Journal of Museum Education 33, 2 (2008), 187--198.",
      "doi": ""
    },
    {
      "text": "Joshua P. Gutwill and Sue Allen. 2010. Facilitating Family Group Inquiry at Science Museum Exhibits. Science Education 94, 4 (dec 2010), 710--742.",
      "doi": ""
    },
    {
      "text": "Berit S. Haug. 2014. Inquiry-Based Science: Turning Teachable Moments into Learnable Moments. Journal of Science Teacher Education 25, 1 (feb 2014), 79--96.",
      "doi": ""
    },
    {
      "text": "Michaela Honauer, Thomas Keßler, Djamel Merad, Preetha Moorthy, Thien Chinh Nguyen, Jie Qiu, Marie Vogelmann, Patrick Tobias Fischer, Eva Hornecker, Julia Hahn, Bahar Akgün, Claire Dorweiler, Liese Endler, Yvonne Götzl, and Muhammad Raisul Islam. 2017. Dusk. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM Press, New York, New York, USA, 1037--1045.  ",
      "doi": "10.1145/3027063.3053334"
    },
    {
      "text": "Thomas Humphrey, Joshua P. Gutwill, and Exploratorium APE Team. 2005. Fostering Active Prolonged Engagement: The Art of Creating APE Exhibits. Exploratorium, San Francisco.",
      "doi": ""
    },
    {
      "text": "Priscilla Jimenez Pazmino, Brenda Lopez Silva, Brian Slattery, and Leilah Lyons. 2013. Teachable mo{bil}ment. In CHI '13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA '13. ACM Press, New York, New York, USA, 643.  ",
      "doi": "10.1145/2468356.2468470"
    },
    {
      "text": "Eric Klopfer, Susan A. Yoon, and T Um. 2005. Young AdventurersModeling of Complex Dynamic Systems with Elementary & Middle School Students. Journal of Computers in Math and Science Teaching 24, 2 (2005), 157--178.",
      "doi": ""
    },
    {
      "text": "Randi Korn. 1995. An Analysis of Differences Between Visitors at Natural History Museums and Science Centers. Curator: The Museum Journal 38, 3 (1995), 150--160.",
      "doi": ""
    },
    {
      "text": "Vishesh Kumar, Michael Tissenbaum, and Matthew Berland. 2017. What are visitors up to?. In Proceedings of the Seventh International Learning Analytics and Knowledge Conference on - LAK '17. ACM Press, New York, 558--559.  ",
      "doi": "10.1145/3027385.3029456"
    },
    {
      "text": "Victor R. Lee and Joel Drake. 2013. Quantified recess: design of an activity for elementary students involving analyses of their own movement data. In Proceedings of the 12th International Conference on Interaction Design and Children - IDC '13. ACM Press, New York, 273--276.  ",
      "doi": "10.1145/2485760.2485822"
    },
    {
      "text": "V R Lee, J R Drake, and J L Thayne. 2016. Appropriating Quantified Self Technologies to Support Elementary Statistical Teaching and Learning. IEEE Transactions on Learning Technologies 9, 4 (2016), 354--365.  ",
      "doi": "10.1109/TLT.2016.2597142"
    },
    {
      "text": "R Lehrer and L Schauble. 2002. Symbolic Communication in Mathematics and Science: Co-Constituting Inscription and Thought. In In E. Amsel and J. Byrnes (Eds.), Language, literacy, and cognitive development: The development and consequences of symbolic communication. Psychology Press, 185--210.",
      "doi": ""
    },
    {
      "text": "Leilah Lyons, E. Anderson, K. Elinich, Michael Tscholl, Christopher Quintana, Jessica Roberts, J. Wang, Susan A. Yoon, and Iris Tabak. 2014. Synergistic scaffolding of technologically-enhanced STEM learning in informal institutions. Proceedings of International Conference of the Learning Sciences, ICLS 3, January (2014).",
      "doi": ""
    },
    {
      "text": "Roberto Martinez-Maldonado, Yannis Dimitriadis, Alejandra MartinezMonés, Judy Kay, and Kalina Yacef. 2013. Capturing and analyzing verbal and physical collaborative learning interactions at an enriched interactive tabletop. International Journal of Computer-Supported Collaborative Learning 8, 4 (2013).",
      "doi": ""
    },
    {
      "text": "Camillia Matuk, Michael Tissenbaum, Matthew Berland, Leilah Lyons, Felipe Cocco, Marcia Linn, Jan L. Plass, Nik Hajny, Al Olsen, Beat Schwendimann, Mina Shirvani Boroujeni, James D. Slotta, Jonathan M. Vitale, Libby Gerard, and Pierre Dillenbourg. 2016. Real-Time Visualization of Student Activities to Support Classroom Orchestration. In ICLS 2016. ACM Press, New York, 1120--1127.",
      "doi": ""
    },
    {
      "text": "J. Miles, M. B., Huberman, A. M., & Saldaña. 2014. Qualitative data analysis : a methods sourcebook. SAGE PublicationsSage CA: Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Ann J. Morrison, Peta Mitchell, and Margot Brereton. 2007. The Lens of Ludic Engagement: Evaluating Participation in Interactive Art Installations. In Proceedings of the 15th international conference on Multimedia - MULTIMEDIA '07. ACM Press, New York, New York, USA, 509.  ",
      "doi": "10.1145/1291233.1291358"
    },
    {
      "text": "Lisa C. Roberts. 1997. From Knowledge to Narrative: Educators and the Changing Museum. Smithsonian Institution Press, Washington and London. 205 pages.",
      "doi": ""
    },
    {
      "text": "Leona Schauble, Mary Gleason, Rich Lehrer, Karol Bartlett, Anthony Petrosino, Annie Allen, Katie Clinton, Evelyn Ho, Melanie Jones, Young-Sun Lee, Jo-Anne Phillips, John Siegler, and John Street. 2002. Supporting Science Learning in Museums. In Learning Conversations in Museums, Gaea Leinhardt, Kevin Crowley, and Karen Knutson (Eds.). Lawrence Erlbaum, Mahwah, New Jersey, 333--356.",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1987. Educating the reflective practitioner. Jossey-Bass San Francisco.",
      "doi": ""
    },
    {
      "text": "Beat A. Schwendimann, Maria Jesus Rodriguez-Triana, Andrii Vozniuk, Luis P. Prieto, Mina Shirvani Boroujeni, Adrian Holzer, Denis Gillet, and Pierre Dillenbourg. 2017. Perceiving Learning at a Glance: A Systematic Literature Review of Learning Dashboard Research. IEEE Transactions on Learning Technologies 10, 1 (jan 2017), 30--41.  ",
      "doi": "10.1109/TLT.2016.2599522"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Michael Mateas, and Geri Gay. 2008. The disenchantment of affect. Personal and Ubiquitous Computing 12, 5 (jun 2008), 347--358.  ",
      "doi": "10.1007/s00779-007-0161-4"
    },
    {
      "text": "Michael Warren Skirpan, Jacqueline Cameron, and Tom Yeh. 2018. More Than a Show. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--13.",
      "doi": "10.1145/3173574.3174038"
    },
    {
      "text": "Morten A. Skydsgaard, Hanne Møller Andersen, and Heather King. 2016. Designing museum exhibits that facilitate visitor reflection and discussion. Museum Management and Curatorship 31, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Brian Slattery, Leilah Lyons, Priscilla Jimenez Pazmino, Brenda Lopez Silva, and Thomas Moher. 2014. How interpreters make use of technological supports in an interactive zoo exhibit.. In Proceedings of the 11th International Conference of the Learning Sciences (ICLS 2014), Vol. 1. Boulder, CO, 198--205.",
      "doi": ""
    },
    {
      "text": "Elliot Soloway, Cathleen Norris, Phyllis C. Blumenfeld, Barry J. Fishman, Joseph S. Krajcik, and R Marx. 2001. Handheld Devices are Ready-at-Hand. Commun. ACM 44, 6 (2001), 15--20.  ",
      "doi": "10.1145/376134.376140"
    },
    {
      "text": "R.E. Stake. 2013. Multiple Case Study Analysis. Guilford Publications.",
      "doi": ""
    },
    {
      "text": "Michael Tscholl and Robb Lindgren. 2016. Designing for Learning Conversations: How Parents Support Children's Science Learning Within an Immersive Simulation. Science Education 100, 5 (2016), 877--902.",
      "doi": ""
    },
    {
      "text": "Katrien Verbert, Sten Govaerts, Erik Duval, Jose Luis Santos, Frans Van Assche, Gonzalo Parra, and Joris Klerkx. 2013. Learning dashboards: an overview and future research opportunities. Personal and Ubiquitous Computing 18, 6 (nov 2013), 1499--1514.  ",
      "doi": "10.1007/s00779-013-0751-2"
    },
    {
      "text": "Robert K Yin. 2017. Case study research and applications: Design and methods. Sage publications.",
      "doi": ""
    }
  ]
}