{
  "doi": "10.1145/3290605.3300806",
  "title": "HeatCraft: Designing Playful Experiences with Ingestible Sensors via Localized Thermal Stimuli",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Ingestible sensors are pill-like sensors that people swallow mainly for medical purposes. We propose that ingestible sensors also offer unique opportunities to facilitate intriguing bodily experiences in a playful manner. To explore this, we present \"HeatCraft\", a two-player system that translates the user's body temperature measured by an ingestible sensor to localized thermal stimuli delivered through a waist belt equipped with heating pads. We conducted a study with 16 participants. The study revealed three design themes (Integration of body and technology, Integration of internal body and outside world, and Integration of play and life) along with some open challenges. In summary, this work contributes knowledge to the future design of playful experiences with ingestible sensors.",
  "authors": [
    {
      "name": "Zhuying Li",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659209998",
      "orcid": "missing"
    },
    {
      "name": "Yan Wang",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319615",
      "orcid": "missing"
    },
    {
      "name": "Wei Wang",
      "institution": "University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319546",
      "orcid": "missing"
    },
    {
      "name": "Weikang Chen",
      "institution": "University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659318960",
      "orcid": "missing"
    },
    {
      "name": "Ti Hoang",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659318609",
      "orcid": "missing"
    },
    {
      "name": "Stefan Greuter",
      "institution": "Deakin University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100071966",
      "orcid": "missing"
    },
    {
      "name": "Florian Floyd Mueller",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    }
  ],
  "references": [
    {
      "text": "Josh Andres, Julian de Hoog, and Florian Mueller. 2018. \"I Had Superpowers when eBike Riding\" Towards Understanding the Design of HeatCraft CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Integrated Exertion. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, New York, NY, USA, 19--31.  ",
      "doi": "10.1145/3242671.3242688"
    },
    {
      "text": "Edward Arens, Hui Zhang, and Charlie Huizenga. 2006. Partial- and Whole-Body Thermal Sensation and Comfort, Part II: Non-Uniform Environmental Conditions. Journal of Thermal Biology 31, 1 (2006), 60 -- 66. Second International Meeting on Physiology and Pharmacology of Temperature Regulation.",
      "doi": ""
    },
    {
      "text": "Nizamettin Aydin and Tughrul Arslan. 2009. Review of Communication Systems for Ingestible Miniaturized Integrated Sensor Microsystems. In Advanced Technologies for Enhanced Quality of Life, Vol. 00. 91--95.  ",
      "doi": "10.1109/AT-EQUAL.2009.28"
    },
    {
      "text": "David Bell and Barbara M Kennedy. 2000. The Cybercultures Reader. Psychology Press. ",
      "doi": "10.5555/556353"
    },
    {
      "text": "Felix Brandmueller and Zhuying Li. 2017. Guts Game: A Game Using Ingestible Sensors. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17 Extended Abstracts). ACM, New York, NY, USA, 625--631.  ",
      "doi": "10.1145/3130859.3130866"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Stuart L Brown. 2009. Play: How it Shapes the Brain, Opens the Imagination, and Invigorates the Soul. Penguin.",
      "doi": ""
    },
    {
      "text": "Alan Bryman. 2016. Social Research Methods. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Christopher Byrne and Chin Leong Lim. 2006. The Ingestible Telemetric Body Core Temperature Sensor: a Review of Validity and Exercise Applications. British Journal of Sports Medicine (2006).",
      "doi": ""
    },
    {
      "text": "Richard Byrne, Joe Marshall, and Florian Mueller. 2016. Balance Ninja: Towards the Design of Digital Vertigo Games via Galvanic Vestibular Stimulation. In Proceedings of the 2016 Annual Symposium on ComputerHuman Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 159--170.  ",
      "doi": "10.1145/2967934.2968080"
    },
    {
      "text": "Colm Mc Caffrey, Olivier Chevalerias, Cian O'Mathuna, and Karen Twomey. 2008. Swallowable-Capsule Technology. IEEE Pervasive Computing 7, 1 (Jan 2008), 23--29.  ",
      "doi": "10.1109/MPRV.2008.17"
    },
    {
      "text": "Jean Costa, Alexander T. Adams, Malte F. Jung, François Guimbretière, and Tanzeem Choudhury. 2016. EmotionCheck: Leveraging Bodily Signals and False Feedback to Regulate Our Emotions. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 758--769.  ",
      "doi": "10.1145/2971648.2971752"
    },
    {
      "text": "Rodrigo de Oliveira, Mauro Cherubini, and Nuria Oliver. 2010. MoviPill: Improving Medication Compliance for Elders Using a Mobile Persuasive Social Game. In Proceedings of the 12th ACM International Conference on Ubiquitous Computing (UbiComp '10). ACM, New York, NY, USA, 251--260.  ",
      "doi": "10.1145/1864349.1864371"
    },
    {
      "text": "Paul Dourish. 2004. Where the Action is: the Foundations of Embodied Interaction. MIT Press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Chris Easton, Barry W. Fudge, and Yannis P. Pitsiladis. 2007. Rectal, Telemetry Pill and Tympanic Membrane Thermometry during Exercise Heat Stress. Journal of Thermal Biology 32, 2 (2007), 78 -- 86.",
      "doi": ""
    },
    {
      "text": "Mark Eyles and Roger Eglin. 2008. Ambient Games, Revealing a Route to a World Where Work is Play? Int. J. Comput. Games Technol. 2008, Article 7 (Jan. 2008), 7 pages.  ",
      "doi": "10.1155/2008/176056"
    },
    {
      "text": "Umer Farooq and Jonathan Grudin. 2016. Human-computer Integration. interactions 23, 6 (Oct. 2016), 26--32.  ",
      "doi": "10.1145/3001896"
    },
    {
      "text": "Umer Farooq and Jonathan T. Grudin. 2017. Paradigm Shift from Human Computer Interaction to Integration. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1360--1363.  ",
      "doi": "10.1145/3027063.3049285"
    },
    {
      "text": "Jonathan Follett. 2007. Engaging User Creativity: The Playful Experience. UXmatters 17 (2007), 2007.",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Jim Gavin and Margaret Moore. 2010. Body Intelligence: a Guide to Self-attunement. IDEA Fitness Journal 7, 11 (2010).",
      "doi": ""
    },
    {
      "text": "Francine Gemperle, Chris Kasabach, John Stivoric, Malcolm Bauer, and Richard Martin. 1998. Design for Wearability. In Digest of Papers. Second International Symposium on Wearable Computers. 116--122. ",
      "doi": "10.5555/857199.857998"
    },
    {
      "text": "Sven Ove Hansson. 2005. Implant Ethics. Journal of Medical Ethics 31, 9 (2005), 519--525.",
      "doi": ""
    },
    {
      "text": "Christian Holz, Tovi Grossman, George Fitzmaurice, and Anne Agur. 2012. Implanted User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 503--512.  ",
      "doi": "10.1145/2207676.2207745"
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline C. M. Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian 'Floyd' Müller, Marianne Graves Petersen, Thecla Schiphorst, Elena Márquez Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3131--3142.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Martin Jonsson, Anna Ståhl, Johanna Mercurio, Anna Karlsson, Naveen Ramani, and Kristina Höök. 2016. The Aesthetics of Heat: Guiding Awareness with Thermal Stimuli. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 109--117.  ",
      "doi": "10.1145/2839462.2839487"
    },
    {
      "text": "Wendy Ju and Larry Leifer. 2008. The Design of Implicit Interactions: Making Interactive Systems Less Obnoxious. Design Issues 24, 3 (2008), 72--84.",
      "doi": ""
    },
    {
      "text": "Kourosh Kalantar-zadeh, Nam Ha, Jian Zhen Ou, and Kyle J. Berean. 2017. Ingestible Sensors. ACS Sensors 2, 4 (2017), 468--483.",
      "doi": ""
    },
    {
      "text": "Ioannis Kalpouzos, Kostas Giokas, and Dimitrios Koutsouris. 2015. A Survey on an Ingestible Sensor for Evaluating Medication Adherence in Elderly People. In Proceedings of the 8th ACM International Conference on Pervasive Technologies Related to Assistive Environments (PETRA '15). ACM, New York, NY, USA, Article 10, 4 pages.  ",
      "doi": "10.1145/2769493.2769570"
    },
    {
      "text": "Craig M. Klugman, Laura B. Dunn, Jack Schwartz, and I. Glenn Cohen. 2018. The Ethics of Smart Pills and Self-Acting Devices: Autonomy, Truth-Telling, and Trust at the Dawn of Digital Medicine. The American Journal of Bioethics 18, 9 (2018), 38--47. PMID: 30235091.",
      "doi": ""
    },
    {
      "text": "Sang-won Leigh, Harpreet Sareen, Hsin-Liu (Cindy) Kao, Xin Liu, and Pattie Maes. 2017. Body-Borne Computers as Extensions of Self. Computers 6, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Zhuying Li, Felix Brandmueller, Florian Mueller, and Stefan Greuter. 2017. Ingestible Games: Swallowing a Digital Sensor to Play a Game. In CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Z. Li et al. Extended Abstracts Publication of the Annual Symposium on ComputerHuman Interaction in Play (CHI PLAY '17 Extended Abstracts). ACM, New York, NY, USA, 511--518.  ",
      "doi": "10.1145/3130859.3131312"
    },
    {
      "text": "Zhuying Li, Rakesh Patibanda, Felix Brandmueller, Wei Wang, Kyle Berean, Stefan Greuter, and Florian Mueller. 2018. The Guts Game: Towards Designing Ingestible Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3242671.3242681"
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 40, 13 pages.  ",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Andrés Lucero, Evangelos Karapanos, Juha Arrasvuori, and Hannu Korhonen. 2014. Playful or Gameful?: Creating Delightful User Experiences. interactions 21, 3 (May 2014), 34--39.  ",
      "doi": "10.1145/2590973"
    },
    {
      "text": "Deborah Lupton. 2013. The Digitally Engaged Patient: Self-monitoring and Self-care in the Digital Health Era. Social Theory & Health 11, 3 (01 Aug 2013), 256--270.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2017. How does Digital Health Feel? Towards Research on the Affective Atmospheres of Digital Health. DIGITAL HEALTH 3 (2017), 2055207617701276.",
      "doi": ""
    },
    {
      "text": "Pattie Maes. 2017. Human Machine Symbiosis. https://www.youtube. com/watch?v=kCOV51S7Xqg.",
      "doi": ""
    },
    {
      "text": "Sund-Levander Märtha, Forsberg Christina, and Wahren Lis Karin. 2002. Normal Oral, Rectal, Tympanic and Axillary Body Temperature in Adult Men and Women: a Systematic Literature Review. Scandinavian Journal of Caring Sciences 16, 2 (2002), 122--128.",
      "doi": ""
    },
    {
      "text": "Maurice Merleau-Ponty. 2013. Phenomenology of Perception. Routledge.",
      "doi": ""
    },
    {
      "text": "Hyeryung Christine Min and Tek-Jin Nam. 2014. Biosignal Sharing for Affective Connectedness. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2191--2196.  ",
      "doi": "10.1145/2559206.2581345"
    },
    {
      "text": "Markus Montola, Jaakko Stenros, and Annika Waern. 2009. Pervasive Games: Theory and Design. CRC Press. ",
      "doi": ""
    },
    {
      "text": "George D Mower. 1976. Perceived Intensity of Peripheral Thermal Stimuli is Independent of Internal Body Temperature. Journal of comparative and physiological psychology 90, 12 (1976), 1152.",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Josh Andres, Joe Marshall, Dag Svanæs, m. c. schraefel, Kathrin Gerling, Jakob Tholander, Anna Lisa Martin-Niedecken, Elena Márquez Segura, Elise van den Hoven, Nicholas Graham, Kristina Höök, and Corina Sas. 2018. Body-centric Computing: Results from a Weeklong Dagstuhl Seminar in a German Castle. Interactions 25, 4 (June 2018), 34--39.  ",
      "doi": "10.1145/3215854"
    },
    {
      "text": "Florian Mueller, Richard Byrne, Josh Andres, and Rakesh Patibanda. 2018. Experiencing the Body As Play. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 210, 13 pages.  ",
      "doi": "10.1145/3173574.3173784"
    },
    {
      "text": "Florian Mueller, Darren Edge, Frank Vetere, Martin R. Gibbs, Stefan Agamanolis, Bert Bongers, and Jennifer G. Sheridan. 2011. Designing Sports: A Framework for Exertion Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2651--2660.  ",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Claudia Nunez-Pacheco and Lian Loke. 2014. Crafting the Body-tool: A Body-centred Perspective on Wearable Technology. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 553--566.  ",
      "doi": "10.1145/2598510.2598546"
    },
    {
      "text": "Claudia Nunez-Pacheco and Lian Loke. 2017. Tacit Narratives: Surfacing Aesthetic Meaning by Using Wearable Props and Focusing. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 233--242.  ",
      "doi": "10.1145/3024969.3024979"
    },
    {
      "text": "Eric Paulos, Barry Brown, Bill Gaver, Marc Smith, and Nina Wakeford. 2003. Mobile play: Blogging, tagging, and messaging. available as a white paper at http://whitepapers. techrepublic. com (2003).",
      "doi": ""
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2013. 4 Design Themes for Skateboarding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1271--1274.  ",
      "doi": "10.1145/2470654.2466165"
    },
    {
      "text": "Henning Pohl, Peter Brandes, Hung Ngo Quang, and Michael Rohs. 2017. Squeezeback: Pneumatic Compression for Notifications. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5318--5330.  ",
      "doi": "10.1145/3025453.3025526"
    },
    {
      "text": "Jan Poope. 2015. Audiopill. http://www.audiopill.net/en/. Accessed Sep 21, 2018.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2011. Interaction Design Gone Wild: Striving for Wild Theory. interactions 18, 4 (July 2011), 58--62.  ",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "Thecla Schiphorst. 2009. Soft(N): Toward a Somaesthetics of Touch. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 2427--2438.  ",
      "doi": "10.1145/1520340.1520345"
    },
    {
      "text": "Jenny Slatman. 2016. Our Strange Body: Philosophical Reflections on Identity and Medical Interventions. Amsterdam University Press.",
      "doi": ""
    },
    {
      "text": "Mads Soegaard and Rikke Friis Dam. 2012. The Encyclopedia of Human-computer Interaction. The Encyclopedia of Human-Computer Interaction (2012).",
      "doi": ""
    },
    {
      "text": "Paul Strohmeier, Cedric Honnet, and Samppa Von Cyborg. 2016. Developing an Ecosystem for Interactive Electronic Implants. In Conference on Biomimetic and Biohybrid Systems. Springer, 518--525.",
      "doi": ""
    },
    {
      "text": "Dag Svanæs. 2013. Interaction Design for and with the Lived Body: Some Implications of Merleau-ponty's Phenomenology. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 8 (April 2013), 30 pages.  ",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Penelope Sweetser and Peta Wyeth. 2005. GameFlow: A Model for Evaluating Player Enjoyment in Games. Comput. Entertain. 3, 3 (July 2005), 3--3.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2913--2922.  ",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Max Van Manen. 1998. Modalities of Body Experience in Illness and Health. Qualitative Health Research 8, 1 (1998), 7--24.",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Dobromir Dobrev, and Stephen A. Brewster. 2016. Hot Under the Collar: Mapping Thermal Feedback to Dimensional Models of Emotion. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4838--4849.  ",
      "doi": "10.1145/2858036.2858205"
    }
  ]
}