{
  "doi": "10.1145/3290605.3300596",
  "title": "Beyond the Patient Portal: Supporting Needs of Hospitalized Patients",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Although patient portals-technologies that give patients access to their health information-are recognized as key to increasing patient engagement, we have a limited understanding of how these technologies should be designed to meet the needs of hospitalized patients and caregivers. Through semi-structured interviews with 30 patients and caregivers, we examine how future patient portals can best align with their needs and support engagement in their care. Our findings reveal six needs that existing patient portals do not support: (1) transitioning from home to hospital, (2) adjusting schedules and receiving status updates, (3) understanding and remembering care, (4) asking questions and flagging problems, (5) collaborating with providers and care- givers, and (6) preparing for discharge and at-home care. Based on these findings, we discuss three design implications: highlight patient-centric goals and preferences, provide dynamic information about care events, and design for situationally-impaired users. Our contributions guide future patient portals in engaging hospitalized patients and care- givers as primary stakeholders in their health care.",
  "authors": [
    {
      "name": "Shefali Haldar",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987258",
      "orcid": "missing"
    },
    {
      "name": "Sonali R. Mishra",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987181",
      "orcid": "missing"
    },
    {
      "name": "Maher Khelifi",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021931",
      "orcid": "missing"
    },
    {
      "name": "Ari H. Pollack",
      "institution": "Seattle Children's Hospital",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658986946",
      "orcid": "missing"
    },
    {
      "name": "Wanda Pratt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100298117/rel-imgonly/img_2793-4.jpg",
      "acmid": "81100298117",
      "orcid": "0000-0003-4035-0198"
    }
  ],
  "references": [
    {
      "text": "{n. d.}. What is a patient portal? | HealthIT.gov. https://www.healthit. gov/faq/what-patient-portal",
      "doi": ""
    },
    {
      "text": "Madlen Arnhold, Mandy Quade, and Wilhelm Kirch. 2014. Mobile applications for diabetics: a systematic review and expert-based usability evaluation considering the special requirements of diabetes patients age 50 years or older. Journal of Medical Internet Research 16, 4 (apr 2014), e104.",
      "doi": ""
    },
    {
      "text": "Jessica L. Baldwin, Hardeep Singh, Dean F. Sittig, and Traber Davis Giardina. 2017. Patient portals and health apps: Pitfalls, promises, and what one might learn from the other. Healthcare 5, 3 (2017), 81--85.",
      "doi": ""
    },
    {
      "text": "Paul J Barr, Kyra Bonasia, Kanak Verma, Michelle D Dannenberg, Cameron Yi, Ethan Andrews, Marisha Palm, Kerri L Cavanaugh, Meredith Masel, and Marie-Anne Durand. 2018. Audio-/Videorecording Clinic Visits for Patient's Personal Use in the United States: CrossSectional Survey. Journal of Medical Internet Research 20, 9 (sep 2018), e11308.",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore, Laura M. Pfeifer, and Brian W. Jack. 2009. Taking the time to care: empowering low health literacy hospital patients with virtual nurse agents. Proceedings of the 27th international conference on Human factors in computing systems - CHI 09 (2009), 1265--1274.  ",
      "doi": "10.1145/1518701.1518891"
    },
    {
      "text": "David Blumenthal and Marilyn Tavenner. 2010. The \"Meaningful Use\" Regulation for Electronic Health Records. New England Journal of Medicine 363, 6 (aug 2010), 501--504.",
      "doi": ""
    },
    {
      "text": "Kristin Carman, Pam Dardess, Maureen Maurer, Shoshanna Sofaer, Karen Adams, Christine Bechtel, and Jennifer Sweeney. 2013. Patient and Family Engagement: A Framework for Understanding The Elements and Developing Interventions and Policies. Health Affairs 32, February (2013), 223--231.",
      "doi": ""
    },
    {
      "text": "Sarah Collins, Ronen Rozenblum, Wai Yin Leung, Constance RC Morrison, Diana L Stade, Kelly McNally, Patricia Q Bourie, Anthony Massaro, Seth Bokser, Cindy Dwyer, Ryan S Greysen, Priyanka Agarwal, Kevin Thornton, and Anuj K Dalal. 2016. Acute care patient portals: a qualitative study of stakeholder perspectives on current practices. Journal of the American Medical Informatics Association 0 (2016), 1--9.",
      "doi": ""
    },
    {
      "text": "Angela Coulter. 2011. Engaging patients in their healthcare. McGraw HIll Education, New York, New York, USA.",
      "doi": ""
    },
    {
      "text": "Brittany Couture, Elizabeth Lilley, Frank Chang, Ann DeBord Smith, Jessica Cleveland, Awatef Ergai, Zachary Katsulis, James Benneyan, Esteban Gershanik, David W Bates, and Sarah Collins. 2018. Applying User-Centered Design Methods to the Development of an mHealth Application for use in the Hospital Setting by Patients and Care Partners. Appl Clin Inform (2018), 302--312.",
      "doi": ""
    },
    {
      "text": "Ruth M Masterson Creber, Lisa V Grossman, Beatriz Ryan, Min Qian, Fernanda Polubriaginof, Susan Restaino, Suzanne Bakken, George Hripcsak, and David K Vawdrey. 2018. Engaging hospitalized patients with personalized health information: a randomized trial of an inpatient portal. Journal of the American Medical Informatics Association 00, 0 (2018), 1--9.",
      "doi": ""
    },
    {
      "text": "Anuj K. Dalal, Patricia C. Dykes, Sarah Collins, Lisa Soleymani Lehmann, Kumiko Ohashi, Ronen Rozenblum, Diana Stade, Kelly McNally, Constance R.C. Morrison, Sucheta Ravindran, Eli Mlaver, John Hanna, Frank Chang, Ravali Kandala, George Getty, and David W. Bates. 2016. A web-based, patient-centered toolkit to engage patients and caregivers in the acute care setting: A preliminary evaluation. Journal of the American Medical Informatics Association 23, 1 (2016), 80--87.",
      "doi": ""
    },
    {
      "text": "Sharon E Davis, Chandra Y Osborn, Sunil Kripalani, Kathryn M Goggins, and Gretchen Purcell Jackson. 2015. Health Literacy, Education Levels, and Patient Portal Usage During Hospitalizations.. In Proceedings of the American Medical Informatics Association Annual Symposium. American Medical Informatics Association, 1871--1880. http://www.ncbi.nlm.nih.gov/pubmed/26958286",
      "doi": ""
    },
    {
      "text": "Megan Duckworth, Emily Leung, Theresa Fuller, Jenzel Espares, Brittany Couture, Frank Chang, Alexandra C. Businger, Sarah Collins, Anuj Dalal, Anne Fladger, Jeffrey L. Schnipper, Kumiko O. Schnock, David W. Bates, and Patricia C Dykes. 2017. Nurse, Patient, and Care Partner Perceptions of a Personalized Safety Plan Screensaver. Journal of Gerontological Nursing 43, 4 (2017), 15--22.",
      "doi": ""
    },
    {
      "text": "Traber D Giardina, Jessica Baldwin, Daniel T Nystrom, Dean F Sittig, and Hardeep Singh. 2017. Patient perceptions of receiving test results via online portals : a mixed-methods study. 0 (2017), 1--7.",
      "doi": ""
    },
    {
      "text": "Caroline Lubick Goldzweig. 2012. Pushing the Envelope of Electronic Patient Portals to Engage Patients in Their Care. Annals of Internal Medicine 157, 7 (oct 2012), 525.",
      "doi": ""
    },
    {
      "text": "S. Ryan Greysen, Raman R. Khanna, Ronald Jacolbia, Herman M. Lee, and Andrew D. Auerbach. 2014. Tablet computers for hospitalized patients: A pilot study to improve inpatient engagement. Journal of Hospital Medicine 9, 6 (2014), 396--399.",
      "doi": ""
    },
    {
      "text": "Lisa Grossman, Ruth Masterson Creber, Susan Restaino, and David K Vawdrey. 2017. Sharing Clinical Notes with Hospitalized Patients via an Acute Care Portal. AMIA Annual Symposium proceedings (2017), 800--809.",
      "doi": ""
    },
    {
      "text": "Lisa V Grossman, Sung W Choi, Sarah Collins, Patricia C Dykes, Kevin J O 'Leary, Milisa Rizer, Philip Strong, Po-Yin Yen, and David K Vawdrey. 2017. Implementation of acute care patient portals: recommendations on utility and use from six early adopters. Journal of the American Medical Informatics Association (2017), 1--10.",
      "doi": ""
    },
    {
      "text": "Shefali Haldar, Sonali R Mishra, Maher Khelifi, Ari H Pollack, and Wanda Pratt. 2018. Exploring the Design of an Inpatient Peer Support Tool: Views of Adult Patients. In Proceedings of the American Medical Informatics Association Annual Symposium. 1282--1291.",
      "doi": ""
    },
    {
      "text": "Judith H Hibbard and Jessica Greene. 2013. What the evidence shows about patient activation: better health outcomes and care experiences; fewer data on costs. Health Affairs 32, 2 (feb 2013), 207--14.",
      "doi": ""
    },
    {
      "text": "Matthew K. Hong, Clayton Feustel, Meeshu Agnihotri, Max Silverman, Stephen F. Simoneaux, and Lauren Wilcox. 2017. Supporting Families in Reviewing and Communicating about Radiology Imaging Studies. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 5245--5256.  ",
      "doi": "10.1145/3025453.3025754"
    },
    {
      "text": "Matthew K. Hong, Udaya Lakshmi, Thomas A. Olson, and Lauren Wilcox. 2018. Visual ODLs: Co-Designing Patient-Generated Observations of Daily Living to Support Data-Driven Conversations in Pediatric Care. In Proceeding of the 2018 CHI Conference on Human Factors in Computing Systems - CHI'18. 1--13.  ",
      "doi": "10.1145/3173574.3174050"
    },
    {
      "text": "Bas Hoogenbosch, Jeroen Postma, Janneke, M De Man-Van Ginkel, Nicole Am Tiemessen, Johannes Jm Van Delden, ; Harmieke Van OsMedendorp, and Harmieke Van Os-Medendorp. 2018. Use and the Users of a Patient Portal: Cross-Sectional Study. Journal of Medical Internet Research 20, 9 (2018).",
      "doi": ""
    },
    {
      "text": "Taya Irizarry, Annette DeVito Dabbs, and Christine R Curran. 2015. Patient Portals and Patient Engagement: A State of the Science Review. Journal of medical Internet research 17, 6 (jun 2015), e148.",
      "doi": ""
    },
    {
      "text": "Gretchen P Jackson, Jamie R Robinson, Ebone Ingram, Mary Masterman, Catherine Ivory, Diane Holloway, Shilo Anders, and Robert M Cronin. 2017. A technology-based patient and family engagement consult service for the pediatric hospital setting. Journal of the American Medical Informatics Association 0, 0 (2017), 1--8.",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, James Clawson, and Elizabeth D Mynatt. 2014. My Journey Compass: A Preliminary Investigation of a Mobile Tool for Cancer Patients. Computer Human Interaction (2014), 663--672.  ",
      "doi": "10.1145/2556288.2557194"
    },
    {
      "text": "Zachary Katsulis, Awatef Ergai, Wai Yin Leung, Laura Schenkel, Amisha Rai, Jason Adelman, James Benneyan, David W. Bates, and Patricia C Dykes. 2016. Iterative user centered design for development of a patient-centered fall prevention toolkit. Applied Ergonomics 56 (2016), 117--126.",
      "doi": ""
    },
    {
      "text": "Elizabeth Kaziunas, Ayse G Buyuktur, Jasmine Jones, Sung W Choi, David A Hanauer, and Mark S Ackerman. 2015. Transition and Reflection in the Use of Health Information : The Case of Pediatric Bone Marrow Transplant Caregivers. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing CSCW '15 (2015), 1763--1774.  ",
      "doi": "10.1145/2675133.2675276"
    },
    {
      "text": "Michelle M Kelly, Peter L.T. Hoonakker, and Shannon M Dean. 2016. Using an inpatient portal to engage families in pediatric hospital care. Journal of the American Medical Informatics Association (jun 2016), ocw070.",
      "doi": ""
    },
    {
      "text": "Logan Kendall, Sonali R Mishra, Ari Pollack, Barry Aaronson, and Wanda Pratt. 2015. Making background work visible: opportunities to address patient information needs in the hospital. Proceedings of the American Medical Informatics Association Annual Symposium 2015 (2015), 1957--66. http://www.ncbi.nlm.nih.gov/pubmed/26958295http: //www.pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC4765671",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Andrea Hartzler, Christopher Powell, Giovandy Phan, and Wanda Pratt. 2010. Health Weaver Mobile: Designing a Mobile Tool for Managing Personal Health Information during Cancer Care.. In Proceedings of the America. American Medical Informatics Association, 392--396. http://www.ncbi.nlm.nih.gov/pubmed/21347007http://www. pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC3041373",
      "doi": ""
    },
    {
      "text": "Ross Koppel and Christoph U Lehmann. 2015. Implications of an emerging EHR monoculture for hospitals and healthcare systems. Journal of the American Medical Informatics Association 2 (2015), 465--471.",
      "doi": ""
    },
    {
      "text": "Celine Latulipe, Amy Gatto, Ha T Nguyen, David P Miller, Sara A Quandt, Alain G Bertoni, Alden Smith, and Thomas A Arcury. 2015. Design Considerations for Patient Portal Adoption by Low-Income, Older Adults. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. 3859--3868.  ",
      "doi": "10.1145/2702123.2702392"
    },
    {
      "text": "Daniel J. Lee, Robert Cronin, Jamie Robinson, Shilo Anders, Kim Unertl, Katherine Kelly, Heather Hankins, Ryan Skeens, and Gretchen P. Jackson. 2018. Common Consumer Health-Related Needs in the Pediatric Hospital Setting: Lessons from an Engagement Consultation Service. Applied Clinical Informatics 9, 3 (2018), 595--603.",
      "doi": ""
    },
    {
      "text": "Leslie S. Liu, Sen H. Hirano, Monica Tentori, Karen G. Cheng, Sheba George, Sun Young Park, and Gillian R. Hayes. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. Proceedings of the ACM 2011 conference on Computer supported cooperative work - CSCW '11 (2011), 475.  ",
      "doi": "10.1145/1958824.1958897"
    },
    {
      "text": "Leslie S Liu, Patrick C Shih, and Gillian R Hayes. 2011. Barriers to the Adoption and Use of Personal Health Record Systems. In iConference. 363--370.  ",
      "doi": "10.1145/1940761.1940811"
    },
    {
      "text": "Haley MacLeod, Grace Bastin, Leslie S. Liu, Katie Siek, and Kay Connelly. 2017. \"Be Grateful You Don't Have a Real Disease\". In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems CHI '17. 1660--1673.  ",
      "doi": "10.1145/3025453.3025796"
    },
    {
      "text": "Helena M. Mentis, Anita Komlodi, Katrina Schrader, Michael Phipps, Ann Gruber-Baldini, Karen Yarbrough, and Lisa Shulman. 2017. Crafting a View of Self-Tracking Data in the Clinical Visit. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 5800--5812.  ",
      "doi": "10.1145/3025453.3025589"
    },
    {
      "text": "Andrew D Miller, Sonali R Mishra, Logan Kendall, Shefali Haldar, Ari H Pollack, and Wanda Pratt. 2016. Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay. Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion - CSCW '16 (2016).  ",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "Andrew D Miller, Ari H Pollack, and Wanda Pratt. 2016. Bursting the Information Bubble: Identifying Opportunities for Pediatric PatientCentered Technology. Proceedings of the American Medical Informatics Association Annual Symposium (2016), 894--903.",
      "doi": ""
    },
    {
      "text": "Sonali R Mishra, Shefali Haldar, Ari H Pollack, Logan Kendall, Andrew D Miller, Maher Khelifi, and Wanda Pratt. 2016. \"Not Just a Receiver\": Understanding Patient Behavior in the Hospital Environment. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 3103--3114.  ",
      "doi": "10.1145/2858036.2858167"
    },
    {
      "text": "Sonali R Mishra, Andrew D Miller, Shefali Haldar, Maher Khelifi, Jordan Eschler, Rashmi G Elera, Ari H Pollack, and Wanda Pratt. 2018. Supporting Collaborative Health Tracking in the Hospital: Patients' Perspectives. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (2018), 650:1--14.  ",
      "doi": "10.1145/3173574.3174224"
    },
    {
      "text": "Dan Morris and Amy Karlson. 2011. Dynamic Accessibility Requirements for Hospital Patients. Human Factors (2011), 1--5.",
      "doi": ""
    },
    {
      "text": "Zsolt J. Nagykaldi, Huibert Tange, and Jan De Maeseneer. 2018. Moving from problem-oriented to goal-directed health records. Annals of Family Medicine 16, 2 (2018), 155--159.",
      "doi": ""
    },
    {
      "text": "Kim Marie Nazi, Carolyn Turvey, Dawn Klein, and Timothy Hogan. 2018. A Decade of Veteran Voices: Examining Patient Portal Enhancements through the Lens of User-Centered Design. Journal of Medical Internet Research 20 (2018), 1--18.",
      "doi": ""
    },
    {
      "text": "LeighAnne Olsen, Robert S Saunders, and J Michael McGinnis. 2011. Patients Charting the Course: Citizen Engagement and the Learning Health System. Technical Report. The National Academies Press, Washington D.C.",
      "doi": ""
    },
    {
      "text": "Sun Young Park and Yunan Chen. 2017. Patient Strategies As Active Adaptation: Understanding Patient Behaviors During an Emergency Visit. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 880--892.  ",
      "doi": "10.1145/3025453.3025978"
    },
    {
      "text": "Tina Park, Peter Chira, Kimberly Miller, and Lisa Nugent. 2015. Living Profiles: an example of user-centered design in developing a teenoriented personal health record. Personal and Ubiquitous Computing 19, 1 (jan 2015), 69--77.  ",
      "doi": "10.1007/s00779-014-0812-1"
    },
    {
      "text": "Jonathan Pell, Mary Mancuso, Shelly Limon, Kathy Oman, and ChenTan Lin. 2015. Patient Access to Electronic Health Records During Hospitalization. JAMA Internal Medicine 175, 5 (2015), 856--858.",
      "doi": ""
    },
    {
      "text": "Laura Pfeifer Vardoulakis, Amy Karlson, Dan Morris, Greg Smith, Justin Gatewood, and Desney Tan. 2012. Using mobile phones to present medical information to hospital patients. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI '12 (2012), 1411.  ",
      "doi": "10.1145/2207676.2208601"
    },
    {
      "text": "Ari H Pollack, Uba Backonja, Andrew D Miller, Sonali R Mishra, Maher Khelifi, Logan Kendall, and Wanda Pratt. 2016. Closing the Gap: Supporting Patients' Transition to Self-Management after Hospitalization. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. 5324--5336.  ",
      "doi": "10.1145/2858036.2858240"
    },
    {
      "text": "Jennifer E Prey, Fernanda Polubriaginof, Lisa V Grossman, Ruth Masterson Creber, Demetra Tsapepa, Rimma Perotte, Min Qian, Susan Restaino, Suzanne Bakken, George Hripcsak, Leigh Efird, Joseph Underwood, and David K. Vawdrey. 2018. Engaging Hospital Patients in the Medication Reconciliation Process Using Tablet Computers. Journal of the American Medical Informatics Association 0, 0 (2018), 1--10.",
      "doi": ""
    },
    {
      "text": "Jennifer E Prey, Janet Woollen, Lauren Wilcox, Alexander D Sackeim, George Hripcsak, Suzanne Bakken, Susan Restaino, Steven Feiner, and David K Vawdrey. 2014. Patient engagement in the inpatient setting: a systematic review. Journal of the American Medical Informatics Association 21, 4 (2014), 742--50.",
      "doi": ""
    },
    {
      "text": "David B Reuben and Mary E Tinetti. 2012. Goal-Oriented Patient Care - An Alternative Health Outcomes Paradigm. The New England Journal of Medicine 366, 9 (2012), 777--779. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Tera L Reynolds, Nida Ali, Emma Mcgregor, Trish O Brien, Christopher Longhurst, Andrew L Rosenberg, Scott E Rudkin, Kai Zheng, Ann Arbor, and California Irvine. 2017. Understanding Patient Questions about their Medical Records in an Online Health Forum : Opportunity for Patient Portal Design. Proceedings of the American Medical Informatics Association Annual Symposium (2017), 1451--1460.",
      "doi": ""
    },
    {
      "text": "Giuseppe Riva, Rosa M. Baños, Cristina Botella, Brenda K. Wiederhold, and Andrea Gaggioli. 2012. Positive Technology: Using Interactive Technologies to Promote Positive Functioning. Cyberpsychology, Behavior, and Social Networking 15, 2 (2012), 69--77. arXiv:QH 12.0203",
      "doi": ""
    },
    {
      "text": "Jamie R Robinson, Sharon E Davis, Robert M Cronin, and Gretchen P Jackson. 2016. Use of a Patient Portal During Hospital Admissions to Surgical Services.. In Proceedings of the American Medical Informatics Association Annual Symposium. American Medical Informatics Association, 1967--1976. http://www.ncbi.nlm.nih.gov/pubmed/28269956",
      "doi": ""
    },
    {
      "text": "Suhila Sawesi, Mohamed Rashrash, Kanitha Phalakornkule, Janet S Carpenter, and Josette F Jones. 2016. The Impact of Information Technology on Patient Engagement and Health Behavior Change: A Systematic Review of the Literature. JMIR medical informatics 4, 1 (jan 2016), e1.",
      "doi": ""
    },
    {
      "text": "Andrew Sears, Min Lin, Julie Jacko, and Yan Xiao. 2003. When computers fade: Pervasive computing and situationally-induced impairments and disabilities. In HCI International, Vol. 2. 1298--1302.",
      "doi": ""
    },
    {
      "text": "Marianne Sharko, Lauren Wilcox, Matthew K Hong, and Jessica S Ancker. 2018. Variability in adolescent portal privacy features: how the unique privacy needs of the adolescent patient create a complex decision-making process. Journal of the American Medical Informatics Association (2018).",
      "doi": ""
    },
    {
      "text": "Meredith Skeels and Desney S. Tan. 2010. Identifying opportunities for inpatient-centric technology. Proceedings of the ACM international conference on Health informatics - IHI '10 (2010), 580.  ",
      "doi": "10.1145/1882992.1883087"
    },
    {
      "text": "Juliet M. Strauss, Anselm L.; Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. 431 pages. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Martin H.N. Tattersall and Phyllis N. Butow. 2002. Consultation audio tapes: An underused cancer patient information aid and clinical research tool. Lancet Oncology 3, 7 (2002), 431--437.",
      "doi": ""
    },
    {
      "text": "David K Vawdrey, Lauren G Wilcox, Sarah Collins, Suzanne Bakken, Steve Feiner, Aurelia Boyer, and Susan W Restaino. 2011. A tablet computer application for patients to participate in their hospital care. In Proceedings of the American Medical Informatics Association Annual Symposium. 1428--35.",
      "doi": ""
    },
    {
      "text": "Tiffany C Veinot, Hannah Mitchell, and Jessica S Ancker. 2018. Good intentions are not enough: how informatics interventions can worsen inequality. 0, May (2018), 1--9.",
      "doi": ""
    },
    {
      "text": "Daniel M Walker, Terri Menser, and Po-Yin Yen. 2018. Optimizing the User Experience: Identifying Opportunities to Improve Use of an Inpatient Portal. Applied Clinical Informatics (2018).",
      "doi": ""
    },
    {
      "text": "Lauren Wilcox, Steven Feiner, Andy Liu, Susan Restaino, Sarah Collins, and David Vawdrey. 2012. Designing inpatient technology to meet the medication information needs of cardiology patients. In Proceedings of the 2nd ACM SIGHIT symposium on International health informatics IHI '12. ACM Press, New York, New York, USA, 831.  ",
      "doi": "10.1145/2110363.2110466"
    },
    {
      "text": "Lauren Wilcox, Dan Morris, Desney Tan, and Justin Gatewood. 2010. Designing patient-centric information displays for hospitals. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10 (2010), 2123.  ",
      "doi": "10.1145/1753326.1753650"
    },
    {
      "text": "Lauren Wilcox, Dan Morris, Desney Tan, Justin Gatewood, and Eric Horvitz. 2011. Characterizing Patient-Friendly MicroExplanations of Medical Events. (2011), 29--32.  ",
      "doi": "10.1145/1978942.1978948"
    },
    {
      "text": "Janet Woollen, Jennifer Prey, Lauren Wilcox, Alexander Sackeim, Susan Restaino, Syed T Raza, and Suzanne Bakken. 2016. Patient Experiences Using an Inpatient Personal Health Record. Applied Clinical Informatics 7 (2016), 446--460.",
      "doi": ""
    },
    {
      "text": "Po-Yin Yen, Daniel M. Walker, Jessica M.Garvey Smith, Michelle P. Zhou, Terri L. Menser, and Ann Scheck McAlearney. 2018. Usability evaluation of a commercial inpatient portal. International Journal of Medical Informatics 110, November 2017 (2018), 10--18.",
      "doi": ""
    },
    {
      "text": "Brian J. Zikmund-Fisher, Aaron M. Scherer, Holly O. Witteman, Jacob B. Solomon, Nicole L. Exe, Beth A. Tarini, and Angela Fagerlin. 2017. Graphics help patients distinguish between urgent and non-urgent deviations in laboratory test results. Journal of the American Medical Informatics Association 24, 3 (2017), 520--528.",
      "doi": ""
    }
  ]
}