{
  "doi": "10.1145/3290605.3300341",
  "title": "SeeingVR: A Set of Tools to Make Virtual Reality More Accessible to People with Low Vision",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Current virtual reality applications do not support people who have low vision, i.e., vision loss that falls short of complete blindness but is not correctable by glasses. We present SeeingVR, a set of 14 tools that enhance a VR application for people with low vision by providing visual and audio augmentations. A user can select, adjust, and combine different tools based on their preferences. Nine of our tools modify an existing VR application post hoc via a plugin without developer effort. The rest require simple inputs from developers using a Unity toolkit we created that allows integrating all 14 of our low vision support tools during development. Our evaluation with 11 participants with low vision showed that SeeingVR enabled users to better enjoy VR and complete tasks more quickly and accurately. Developers also found our Unity toolkit easy and convenient to use.",
  "authors": [
    {
      "name": "Yuhang Zhao",
      "institution": "Cornell Tech & Cornell University, New York, NY, USA",
      "img": "/do/10.1145/contrib-81472651606/rel-imgonly/img_2060.jpg",
      "acmid": "81472651606",
      "orcid": "0000-0003-3686-695X"
    },
    {
      "name": "Edward Cutrell",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Andrew D. Wilson",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    }
  ],
  "references": [
    {
      "text": "PF Adams and PM Barnes. 2006. Summary health statistics for the US population: National Health Interview Survey, 2004. National Center for Health Statistics 10, 229 (2006), 1--104.",
      "doi": ""
    },
    {
      "text": "Android. 2018. Make apps more accessible | Android Developers. https://developer.android.com/guide/topics/ui/accessibility/apps Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "American Optometric Association (AOA). 2018. Common Types of Low Vision. https://www.aoa.org/patients-and-public/ caring-for-your-vision/low-vision/common-types-of-low-vision last accessed 7 July 2015.",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Vision Accessibility - iPhone. https://www.apple.com/ accessibility/iphone/vision/ Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Joseph Bates. 1992. Virtual reality, art, and entertainment. Presence: Teleoperators & Virtual Environments 1, 1 (1992), 133--138.",
      "doi": "10.5555/2870721.2870734"
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, et al. 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Jeffrey P Bigham, Ryan S Kaminsky, Richard E Ladner, Oscar M Danielsson, and Gordon L Hempton. 2006. WebInSight:: making web images accessible. In Proceedings of the 8th international ACM SIGACCESS conference on Computers and accessibility. ACM, 181--188.  ",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Jeffrey P Bigham, Craig M Prince, and Richard E Ladner. 2008. WebAnywhere: a screen reader on-the-go. In Proceedings of the 2008 international cross-disciplinary conference on Web accessibility (W4A). ACM, 73--82.  ",
      "doi": "10.1145/1368044.1368060"
    },
    {
      "text": "Chetz Colwell, Helen Petrie, Diana Kornbrot, Andrew Hardwick, and Stephen Furner. 1998. Haptic virtual reality for blind computer users. In Proceedings of the third international ACM conference on Assistive technologies. ACM, 92--99.  ",
      "doi": "10.1145/274497.274515"
    },
    {
      "text": "eSight. 2018. eSight Electronic Glasses. https://www.esighteyewear. com/homex last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Eusth.2016. IllusionPluginArchitecture. https://github.com/Eusth/IPA Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "MR Everingham, BT Thomas, T Troscianko, et al. 1999. Head-mounted mobility aid for low vision using scene classification techniques. The International Journal of Virtual Reality 3, 4 (1999), 3.",
      "doi": ""
    },
    {
      "text": "American Foundation for the Blind (AFB). 2018. Screen Readers and Screen Magnifiers: An Introduction to Computer Accessibility Software. http://suo.im/5rv11h",
      "doi": ""
    },
    {
      "text": "GearVR. 2018. GearVR Framework. http://www.gearvrf.org/ Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "José Luis González-Mora, A Rodriguez-Hernandez, Enrique Burunat, F Martin, and Miguel A Castellano. 2006. Seeing the world by hearing: Virtual Acoustic Space (VAS) a new space perception system for blind people.. In Information and Communication Technologies, 2006. ICTTA'06. 2nd, Vol. 1. IEEE, 837--842.",
      "doi": ""
    },
    {
      "text": "Google. 2018. Android accessibility overview - Android Accessibility Help. https://support.google.com/accessibility/android/answer/ 6006564?hl=en last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang'Anthony' Chen, Tom Yeh, Scott E Hudson, Jennifer Mankoff, and Jeffrey P Bigham. 2017. Facade: Auto-generating tactile interfaces to appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5826--5838.  ",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Stephen L Hicks, Iain Wilson, Louwai Muhammed, John Worsfold, Susan M Downes, and Christopher Kennard. 2013. A depth-based head-mounted visual display to aid navigation in partially sighted individuals. PloS one 8, 7 (2013), e67695.",
      "doi": ""
    },
    {
      "text": "Bill Holton. 2014. A Review of iOS Access for All: Your Comprehensive Guide to Accessibility for iPad, iPhone, and iPod Touch, by Shelly Brisbin. AccessWorld Magazine 15, 7 (2014), aw150706.",
      "doi": ""
    },
    {
      "text": "Amy Hurst, Scott E Hudson, and Jennifer Mankoff. 2010. Automatically identifying targets users interact with during real world tasks. In Proceedings of the 15th international conference on Intelligent user interfaces. ACM, 11--20.  ",
      "doi": "10.1145/1719970.1719973"
    },
    {
      "text": "Chuck Huss and Anne Corn. 2004. Low Vision Driving with Bioptics: An Overview. Journal of Visual Impairment and Blindness 98, 10 (2004), 641--653.",
      "doi": ""
    },
    {
      "text": "Alex D Hwang and Eli Peli. 2014. An augmented-reality edge enhancement application for Google Glass. Optometry and vision science: official publication of the American Academy of Optometry 91, 8 (2014), 1021.",
      "doi": ""
    },
    {
      "text": "Gunnar Jansson, H Petrie, C Colwell, D Kornbrot, J Fänger, H König, K Billberger, Andrew Hardwick, and Stephen Furner. 1999. Haptic virtual environments for blind people: Exploratory experiments with two devices. International journal of virtual reality 4, 1 (1999), 10--20.",
      "doi": ""
    },
    {
      "text": "Katerina Kalyvioti and Tassos A Mikropoulos. 2014. Virtual Environments and Dyslexia: A literature review. Procedia Computer Science 27 (2014), 138--147.",
      "doi": ""
    },
    {
      "text": "Shaun K Kane, Meredith Ringel Morris, and Jacob O Wobbrock. 2013. Touchplates: low-cost tactile overlays for visually impaired touch screen users. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 22.  ",
      "doi": "10.1145/2513383.2513442"
    },
    {
      "text": "Richard L Kline and Ephraim P Glinert. 1995. Improving GUI accessibility for people with low vision. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 114--121.  ",
      "doi": "10.1145/223904.223919"
    },
    {
      "text": "Andreas Kunz, Klaus Miesenberger, Limin Zeng, and Gerhard Weber. 2018. Virtual Navigation Environment for Blind and Low Vision People. In International Conference on Computers Helping People with Special Needs. Springer, 114--122.",
      "doi": ""
    },
    {
      "text": "Orly Lahav, Hadas Gedalevitz, Steven Battersby, David Brown, Lindsay Evett, and Patrick Merritt. 2018. Virtual environment navigation with look-around mode to explore new real spaces by people who are blind. Disability and rehabilitation 40, 9 (2018), 1072--1084.",
      "doi": ""
    },
    {
      "text": "Orly Lahav and David Mioduser. 2001. Multisensory virtual environment for supporting blind persons' acquisition of spatial cognitive mapping--a case study. In EdMedia: World Conference on Educational Media and Technology. Association for the Advancement of Computing in Education (AACE), 1046--1051.",
      "doi": ""
    },
    {
      "text": "Ben Lang. 2018. Vive Pro Gets AR Capabilities Thanks to HTC's New Tools for Front-facing Cameras. http://suo.im/4PYzCi/. Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Mary Leach. 2013. Researchers Show Peripheral Prism Glasses to be a Simple, Inexpensive Rehabilitation Tool. https://www.masseyeandear. org/news/press-releases/2013/11/2013-prism-glasses last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Anatole Lécuyer, Pascal Mobuchon, Christine Mégard, Jérôme Perret, Claude Andriot, and J-P Colinot. 2003. HOMERE: a multimodal system for visually impaired people to explore virtual environments. In Virtual Reality, 2003. Proceedings. IEEE. IEEE, 251--258. ",
      "doi": "10.5555/832289.835979"
    },
    {
      "text": "lucassa3. 2018. EscapeVR-HarryPotter. https://github.com/lucassa3/ EscapeVR-HarryPotter Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Gang Luo and Eli Peli. 2006. Use of an augmented-vision device for visual search by patients with tunnel vision. Investigative ophthalmology & visual science 47, 9 (2006), 4152--4159.",
      "doi": ""
    },
    {
      "text": "MAGic. 2018. The best screen magnifier - MAGic. https: //www.freedomscientific.com/Products/LowVision/MAGic last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Shachar Maidenbaum, Shelly Levy-Tzedek, Daniel-Robert Chebat, and Amir Amedi. 2013. Increasing accessibility to the blind of virtual environments, using a virtual mobility aid based on the\" EyeCane\": Feasibility study. PloS one 8, 8 (2013), e72555.",
      "doi": ""
    },
    {
      "text": "J Stephen Mansfield, Gordon E Legge, and Mark C Bane. 1996. Psychophysics of reading. XV: Font effects in normal and low vision. Investigative Ophthalmology & Visual Science 37, 8 (1996), 1492--1501.",
      "doi": ""
    },
    {
      "text": "Tom H Margrain. 2000. Helping blind and partially sighted people to read: the effectiveness of low vision aids. British Journal of Ophthalmology 84, 8 (2000), 919--921.",
      "doi": ""
    },
    {
      "text": "Robert W Massof and Douglas L Rickman. 1992. Obstacles encountered in the development of the low vision enhancement system. Optometry and vision science: official publication of the American Academy of Optometry 69, 1 (1992), 32--41.",
      "doi": ""
    },
    {
      "text": "DavidMaulsby,SaulGreenberg,andRichardMander.1993. Prototyping an intelligent agent through Wizard of Oz. In Proceedings of the INTERACT'93 and CHI'93 conference on Human factors in computing systems. ACM, 277--284.  ",
      "doi": "10.1145/169059.169215"
    },
    {
      "text": "Zahira Merchant, Ernest T Goetz, Lauren Cifuentes, Wendy Keeney-Kennicutt, and Trina J Davis. 2014. Effectiveness of virtual reality-based instruction on students' learning outcomes in K-12 and higher education: A meta-analysis. Computers & Education 70 (2014), 29--40.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Cognitive Services | Microsoft Azure. https: //azure.microsoft.com/en-us/services/cognitive-services/?v=18.44b Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Hear text read aloud with Narrator. https://support. microsoft.com/en-us/help/17173/windows-10-hear-text-read-aloud Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Seeing AI | Talking camera app for those with a visual impairment. https://www.microsoft.com/en-us/seeing-ai last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Phil Parette and Marcia Scherer. 2004. Assistive technology use and stigma. Education and Training in Developmental Disabilities (2004), 217--226.",
      "doi": ""
    },
    {
      "text": "Eli Peli. 2001. Vision multiplexing: an engineering approach to vision rehabilitation device development. Optometry and Vision Science 78, 5 (2001), 304--315.",
      "doi": ""
    },
    {
      "text": "Lorenzo Picinali, Amandine Afonso, Michel Denis, and Brian FG Katz. 2014. Exploration of architectural spaces by blind people using auditory virtual reality for the construction of spatial knowledge. International Journal of Human-Computer Studies 72, 4 (2014), 393--407.  ",
      "doi": "10.1016/j.ijhcs.2013.12.008"
    },
    {
      "text": "Sara Reardon. 2011. Playing by ear.",
      "doi": ""
    },
    {
      "text": "Marti L Riemer-Reiss and Robbyn R Wacker. 2000. Factors associated with assistive technology discontinuance among individuals with disabilities. Journal of Rehabilitation 66, 3 (2000).",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez and Mauricio Lumbreras. 1999. Virtual environment interaction through 3D audio by blind children. CyberPsychology & Behavior 2, 2 (1999), 101--111.",
      "doi": ""
    },
    {
      "text": "JH Sánchez and MA Sáenz. 2006. Assisting the mobilization through subway networks by users with visual disabilities. In Proc. 6th Intl Conf. Disability, Virtual Reality & Assoc. Tech., Esbjerg, Denmark. 183--190.",
      "doi": ""
    },
    {
      "text": "David W Schloerb, Orly Lahav, Joseph G Desloge, and Mandayam A Srinivasan. 2010. BlindAid: Virtual environment system for self-reliant trip planning and orientation and mobility training. In Haptics Symposium, 2010 IEEE. IEEE, 363--370.  ",
      "doi": "10.1109/HAPTIC.2010.5444631"
    },
    {
      "text": "Liz Segre. 2018. Low Vision Aids For Reading. https: //www.allaboutvision.com/lowvision/reading.htm Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Yoshikazu Seki and Tetsuji Sato. 2011. A training system of orientation and mobility for blind people using acoustic virtual reality. IEEE Transactions on neural systems and rehabilitation engineering 19, 1 (2011), 95--104.",
      "doi": ""
    },
    {
      "text": "SK Semwal. 2001. MoVE: Mobiltiy training in haptic virtual environment. piglet. uccs. edu/? semwal/NSF2001PS. pdf (2001).",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "steamspy. 2018. SteamSpy - All the data and stats about Steam games. https://steamspy.com/tag/VR+Only Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: a study of daily challenges of low vision people. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 61--72.  ",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How people with low vision access computing devices: Understanding challenges and opportunities. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Hironobu Takagi and Chieko Asakawa. 2000. Transcoding proxy for nonvisual web access. In Proceedings of the fourth international ACM conference on Assistive technologies. ACM, 164--171.  ",
      "doi": "10.1145/354324.354371"
    },
    {
      "text": "Mauro Teófilo, Vicente F Lucena, Josiane Nascimento, Taynah Miyagawa, and Francimar Maciel. 2018. Evaluating accessibility features designed for virtual reality context. In Consumer Electronics (ICCE), 2018 IEEE International Conference on. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Virgil Tiponut, Zoltan Haraszy, Daniel Ianchis, and Ioan Lie. 2008. Acoustic virtual reality performing man-machine interfacing of the blind. In WSEAS International Conference. Proceedings. Mathematics and Computers in Science and Engineering. WSEAS. ",
      "doi": "10.5555/1580134.1580225"
    },
    {
      "text": "MA Torres-Gil, O Casanova-Gonzalez, and José Luis González-Mora. 2010. Applications of virtual reality for visually impaired people. WSEAS transactions on computers 9, 2 (2010), 184--193. ",
      "doi": "10.5555/1852403.1852412"
    },
    {
      "text": "Shari Trewin, Vicki L Hanson, Mark R Laff, and Anna Cavender. 2008. PowerUp: an accessible virtual world. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility. ACM, 177--184.  ",
      "doi": "10.1145/1414471.1414504"
    },
    {
      "text": "Shari Trewin, Mark Laff, Vicki Hanson, and Anna Cavender. 2009. Exploring visual and motor accessibility in navigating a virtual world. ACM Transactions on Accessible Computing (TACCESS) 2, 2 (2009), 11.  ",
      "doi": "10.1145/1530064.1530069"
    },
    {
      "text": "Dimitrios Tzovaras, Konstantinos Moustakas, Georgios Nikolakis, and Michael G Strintzis. 2009. Interactive mixed reality white cane simulation for the training of the blind and the visually impaired. Personal and Ubiquitous Computing 13, 1 (2009), 51--58.  ",
      "doi": "10.1007/s00779-007-0171-2"
    },
    {
      "text": "Dimitrios Tzovaras, Georgios Nikolakis, George Fergadis, Stratos Malasiotis, and Modestos Stavrakis. 2002. Design and implementation of virtual environments training of the visually impaire. In Proceedings of the fifth international ACM conference on Assistive technologies. ACM, 41--48.  ",
      "doi": "10.1145/638249.638259"
    },
    {
      "text": "Unity. 2016. Edge Detection - Unity. https://docs.unity3d.com/540/ Documentation/Manual/script-EdgeDetectEffect.html Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Unity. 2018. Game Objects and Components - Unity. https://unity3d.com/learn/tutorials/topics/interface-essentials/ game-objects-and-components Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Fernando Vargas-Martín and Eli Peli. 2001. P-16: Augmented View for Tunnel Vision: Device Testing by Patients in Real Environments. In SID Symposium Digest of Technical Papers, Vol. 32. Wiley Online Library, 602--605.",
      "doi": ""
    },
    {
      "text": "VENTUREBEAT. 2017. 59% of VR Developers Use Unity, But Devs Make More Money With Unreal. https://uploadvr.com/ vr-developers-unity-unreal/ Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Maria Virvou and George Katsionis. 2008. On the usability and likeability of virtual reality games for education: The case of VR-ENGAGE. Computers & Education 50, 1 (2008), 154--178.  ",
      "doi": "10.1016/j.compedu.2006.04.004"
    },
    {
      "text": "W3C. 2018. Contrast (Minimum): Understanding Success Criterion 1.4.3. https://www.w3.org/TR/UNDERSTANDING-WCAG20/ visual-audio-contrast-contrast.html Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "W3C. 2018. Web Content Accessibility Guidelines (WCAG) Overview. https://www.w3.org/WAI/standards-guidelines/wcag/ Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "WebAIM. 2017. Designing for Screen Reader Compatibility. https:// webaim.org/techniques/screenreader/ Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Jason Weimann. 2016. Using the Valves - Lab Renderer for VR. https://unity3d.college/2016/08/02/using-valves-lab-renderer-vr/ Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "World Health Organization (WHO). 2018. Blindness and Vision Impairment. https://www.who.int/news-room/fact-sheets/detail/ blindness-and-visual-impairment Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Paul N Wilson, Nigel Foreman, and Danaë Stanton. 1997. Virtual reality, disability and rehabilitation. Disability and rehabilitation 19, 6 (1997), 213--220.",
      "doi": ""
    },
    {
      "text": "James S Wolffsohn and Rachael C Peterson. 2003. A review of current knowledge on Electronic Vision Enhancement Systems for the visually impaired. Ophthalmic and Physiological Optics 23, 1 (2003), 35--42.",
      "doi": ""
    },
    {
      "text": "Alice Wong, Hannah Gillis, and Ben Peck. 2018. VR Accessibility Survey: Survey for People with Disabilities. https://drive.google.com/ file/d/0B0VwTVwReMqLMFIzdzVVaVdaTFk/view Last accessed 21 December 2018.",
      "doi": ""
    },
    {
      "text": "Xiaoyi Zhang, Anne Spencer Ross, Anat Caspi, James Fogarty, and Jacob O Wobbrock. 2017. Interaction Proxies for Runtime Repair and Enhancement of Mobile Application Accessibility. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6024--6037.  ",
      "doi": "10.1145/3025453.3025846"
    },
    {
      "text": "Xiaoyi Zhang, Tracy Tran, Yuqian Sun, Ian Culhane, Shobhit Jain, James Fogarty, and Jennifer Mankoff. 2018. Interactiles: 3D Printed Tactile Interfaces to Enhance Mobile Touchscreen Accessibility. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 131--142.  ",
      "doi": "10.1145/3234695.3236349"
    },
    {
      "text": "Yuhang Zhao, Cynthia L Bennett, Hrvoje Benko, Edward Cutrell, Christian Holz, Meredith Ringel Morris, and Mike Sinclair. 2018. Enabling People with Visual Impairments to Navigate Virtual Reality with a Haptic and Auditory Cane Simulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 116.  ",
      "doi": "10.1145/3173574.3173690"
    },
    {
      "text": "Yuhang Zhao, Michele Hu, Shafeka Hashash, and Shiri Azenkot. 2017. Understanding Low Vision People's Visual Perception on Commercial Augmented Reality Glasses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4170--4181.  ",
      "doi": "10.1145/3025453.3025949"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, and Shiri Azenkot. 2015. Foresee: A customizable head-mounted vision enhancement system for people withlowvision.InProceedingsofthe17thInternationalACMSIGACCESS Conference on Computers & Accessibility. ACM, 239--249.  ",
      "doi": "10.1145/2700648.2809865"
    },
    {
      "text": "Yuhang Zhao, Sarit Szpiro, Jonathan Knighten, and Shiri Azenkot. 2016. CueSee: exploring visual cues for people with low vision to facilitate a visual search task. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 73--84.  ",
      "doi": "10.1145/2971648.2971730"
    },
    {
      "text": "Feng Zhou, Henry Been-Lirn Duh, and Mark Billinghurst. 2008. Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR. In Proceedings of the 7th IEEE/ACM International Symposium on Mixed and Augmented Reality. IEEE Computer Society, 193--202.  ",
      "doi": "10.1109/ISMAR.2008.4637362"
    },
    {
      "text": "Michael Zyda. 2005. From visual simulation to virtual reality to games. Computer 38, 9 (2005), 25--32.  ",
      "doi": "10.1109/MC.2005.297"
    }
  ]
}