{
  "doi": "10.1145/3290605.3300461",
  "title": "Multi-Modal Approaches for Post-Editing Machine Translation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Current advances in machine translation increase the need for translators to switch from traditional translation to post-editing (PE) of machine-translated text, a process that saves time and improves quality. This affects the design of translation interfaces, as the task changes from mainly generating text to correcting errors within otherwise helpful translation proposals. Our results of an elicitation study with professional translators indicate that a combination of pen, touch, and speech could well support common PE tasks, and received high subjective ratings by our participants. Therefore, we argue that future translation environment research should focus more strongly on these modalities in addition to mouse- and keyboard-based approaches. On the other hand, eye tracking and gesture modalities seem less important. An additional interview regarding interface design revealed that most translators would also see value in automatically receiving additional resources when a high cognitive load is detected during PE.",
  "tags": [
    "computer-aided translation",
    "multi-modality",
    "post-editing"
  ],
  "authors": [
    {
      "name": "Nico Herbig",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447603102",
      "orcid": "missing"
    },
    {
      "name": "Santanu Pal",
      "institution": "Saarland University, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470640950",
      "orcid": "missing"
    },
    {
      "name": "Josef van Genabith",
      "institution": "Saarland University, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309482712",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Vicent Alabau, Ragnar Bonk, Christian Buck, Michael Carl, Francisco Casacuberta, Mercedes García-Martínez, Jesús González, Philipp Koehn, Luis Leiva, Bartolomé Mesa-Lao, et al. 2013. CASMACAT: An Open Source Workbench for Advanced Computer Aided Translation. The Prague Bulletin of Mathematical Linguistics 100 (2013), 101--112.",
      "doi": ""
    },
    {
      "text": "Nora Aranberri, Gorka Labaka, A Diaz de Ilarraza, and Kepa Sarasola. 2014. Comparison of Post-Editing Productivity between Professional Translators and Lay Users. In Third Workshop on Post-editing Technology and Practice. 20--33.",
      "doi": ""
    },
    {
      "text": "Julie Brousseau, Caroline Drouin, George Foster, Pierre Isabelle, Roland Kuhn, Yves Normandin, and Pierre Plamondon. 1995. French Speech Recognition in an Automatic Dictation System for Translators: The TransTalk Project. In Fourth European Conference on Speech Communication and Technology. 193--196.",
      "doi": ""
    },
    {
      "text": "Michael Carl, Martin Jensen, and Kay Kristian. 2010. Long Distance Revisions in Drafting and Post-editing. Special Issue: Natural Language Processing and its Applications (2010), 193-- 204.",
      "doi": ""
    },
    {
      "text": "Sven Coppers, Jan Van den Bergh, Kris Luyten, Karin Coninx, Iulianna van der Lek-Ciudin, Tom Vanallemeersch, and Vincent Vandeghinste. 2018. Intellingo: An Intelligible Translation Environment. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 1--13.  ",
      "doi": "10.1145/3173574.3174098"
    },
    {
      "text": "Vera Demberg and Asad Sayeed. 2016. The Frequency of Rapid Pupil Dilations as a Measure of Linguistic Processing Difficulty. PloS one 11, 1 (2016), 1--29.",
      "doi": ""
    },
    {
      "text": "Marc Dymetman, Julie Brousseau, George Foster, Pierre Isabelle, Yves Normandin, and Pierre Plamondon. 1994. Towards an Automatic Dictation System for Translators: The TransTalk Project. ArXiv (1994).",
      "doi": ""
    },
    {
      "text": "Marcello Federico, Nicola Bertoldi, Mauro Cettolo, Matteo Negri, Marco Turchi, Marco Trombetti, Alessandro Cattelan, Antonio Farina, Domenico Lupinetti, Andrea Martines, et al. 2014. The Matecat Tool. In Proceedings of COLING 2014, the 25th International Conference on Computational Linguistics: System Demonstrations. 129--132.",
      "doi": ""
    },
    {
      "text": "Leah Findlater, Ben Lee, and Jacob Wobbrock. 2012. Beyond QWERTY: Augmenting Touch Screen Keyboards with Multitouch Gestures for Non-alphanumeric Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2679--2682.  ",
      "doi": "10.1145/2207676.2208660"
    },
    {
      "text": "Michael D Good, John A Whiteside, Dennis R Wixon, and Sandra J Jones. 1984. Building a User-derived Interface. Commun. ACM 27, 10 (1984), 1032--1043.  ",
      "doi": "10.1145/358274.358284"
    },
    {
      "text": "Spence Green, Jason Chuang, Jeffrey Heer, and Christopher D Manning. 2014. Predictive Translation Memory: A Mixedinitiative System for Human Language Translation. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology. ACM, 177--187.  ",
      "doi": "10.1145/2642918.2647408"
    },
    {
      "text": "Spence Green, Jeffrey Heer, and Christopher D Manning. 2013. The Efficacy of Human Post-editing for Language Translation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 439--448.  ",
      "doi": "10.1145/2470654.2470718"
    },
    {
      "text": "Spence Green, Sida I Wang, Jason Chuang, Jeffrey Heer, Sebastian Schuster, and Christopher D Manning. 2014. Human Effort and Machine Learnability in Computer Aided Translation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing. 1225--1236.",
      "doi": ""
    },
    {
      "text": "Dagmar Kern, Paul Marshall, and Albrecht Schmidt. 2010. Gazemarks: Gaze-based Visual Placeholders to Ease Attention Switching. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2093--2102.  ",
      "doi": "10.1145/1753326.1753646"
    },
    {
      "text": "Maarit Koponen. 2012. Comparing Human Perceptions of Post-editing Effort with Post-editing Operations. In Proceedings of the Seventh Workshop on Statistical Machine Translation. Association for Computational Linguistics, 181--190. ",
      "doi": "10.5555/2393015.2393041"
    },
    {
      "text": "Hans P Krings. 2001. Repairing Texts: Empirical Investigations of Machine Translation Post-Editing Processes. Vol. 5. Kent State University Press.",
      "doi": ""
    },
    {
      "text": "Elina Lagoudaki. 2009. Translation Editing Environments. In MT Summit XII: Workshop on Beyond Translation Memories.",
      "doi": ""
    },
    {
      "text": "Samuel Läubli, Mark Fishel, Gary Massey, Maureen Ehrensberger-Dow, and Martin Volk. 2013. Assessing Postediting Efficiency in a Realistic Translation Environment. In Proceedings of MT Summit XIV Workshop on Post-editing Technology and Practice. 83--91.",
      "doi": ""
    },
    {
      "text": "Mercedes Garcia Martinez, Karan Singla, Aniruddha Tammewar, Bartolomé Mesa-Lao, Ankita Thakur, MA Anusuya, Banglore Srinivas, and Michael Carl. 2014. SEECAT: ASR & Eye-tracking Enabled Computer Assisted Translation. In The 17th Annual Conference of the European Association for Machine Translation. European Association for Machine Translation, 81--88.",
      "doi": ""
    },
    {
      "text": "Bartolomé Mesa-Lao. 2014. Speech-Enabled Computer-Aided Translation: A Satisfaction Survey with Post-Editor Trainees. In Proceedings of the EACL 2014 Workshop on Humans and Computer-assisted Translation. 99--103.",
      "doi": ""
    },
    {
      "text": "Joss Moorkens and Sharon O'Brien. 2017. Assessing User Interface Needs of Post-editors of Machine Translation. In Human Issues in Translation Technology. Routledge, 127-- 148.",
      "doi": ""
    },
    {
      "text": "Joss Moorkens, Sharon O'Brien, and Joris Vreeke. 2014. Kanjingo--A Mobile App for Post-editing. Tradumàtica: Traducció i Tecnologies de la Informació i la Comunicació 14, 58--66.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces. ACM, 95--104.  ",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, Jacob O Wobbrock, et al. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. Interactions 21, 3 (2014), 40--45.  ",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Tapas Nayek, Sudip Kumar Naskar, Santanu Pal, Marcos Zampieri, Mihaela Vela, and Josef van Genabith. 2015. CATaLog: New Approaches to TM and Post Editing Interfaces. In Proceedings of the Workshop Natural Language Processing for Translation Memories. 36--42.",
      "doi": ""
    },
    {
      "text": "Michael Nielsen, Moritz Störring, Thomas B Moeslund, and Erik Granum. 2003. A Procedure for Developing Intuitive and Ergonomic Gesture Interfaces for HCI. In International Gesture Workshop. Springer, 409--420.",
      "doi": ""
    },
    {
      "text": "Maja Popovic, Arle Lommel, Aljoscha Burchardt, Eleftherios Avramidis, and Hans Uszkoreit. 2014. Relations between Different Types of Post-editing Operations, Cognitive Effort and Temporal Effort. In Proceedings of the 17th Annual Conference of the European Association for Machine Translation. 191--198.",
      "doi": ""
    },
    {
      "text": "Dennis W Rowe, John Sibert, and Don Irwin. 1998. Heart Rate Variability: Indicator of User State as an Aid to HumanComputer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 480--487.  ",
      "doi": "10.1145/274644.274709"
    },
    {
      "text": "Douglas Schuler and Aki Namioka. 1993. Participatory Design: Principles and Practices. CRC Press. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Lane Schwartz, Isabel Lacruz, and Tatyana Bystrova. 2015. Effects of Word Alignment Visualization on Post-editing Quality & Speed. Proceedings of MT Summit XV 1 (2015), 186--199.",
      "doi": ""
    },
    {
      "text": "Benjamin Alun Screen. 2016. What Does Translation Memory Do to Translation? The Effect of Translation Memory Output on Specific Aspects of the Translation Process. Translation & Interpreting 8, 1 (2016), 1--18.",
      "doi": ""
    },
    {
      "text": "Els Stuyven, Koen Van der Goten, André Vandierendonck, Kristl Claeys, and Luc Crevits. 2000. The Effect of Cognitive Load on Saccadic Eye Movements. Acta Psychologica 104, 1 (2000), 69--85.",
      "doi": ""
    },
    {
      "text": "Irina Temnikova. 2010. Cognitive Evaluation Approach for a Controlled Language Post--Editing Experiment. In Proceedings of the Seventh International Conference on Language Resources and Evaluation. 3485--3490.",
      "doi": ""
    },
    {
      "text": "Antonio Toral, Martijn Wieling, and Andy Way. 2018. Postediting Effort of a Novel with Statistical and Neural Machine Translation. Frontiers in Digital Humanities 5 (2018), 9.",
      "doi": ""
    },
    {
      "text": "Olga Torres-Hostench, Joss Moorkens, Sharon O'Brien, Joris Vreeke, et al. 2017. Testing Interaction with a Mobile MT Post-editing App. Translation & Interpreting 9, 2 (2017), 138.",
      "doi": ""
    },
    {
      "text": "Jan Van den Bergh, Eva Geurts, Donald Degraen, Mieke Haesen, Iulianna Van der Lek-Ciudin, Karin Coninx, et al. 2015. Recommendations for Translation Environments to Improve Translators' Workflows. In Proceedings of the 37th Conference Translating and the Computer. Tradulex, 106-- 119.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "María Viqueira Villarejo, Begoña García Zapirain, and Amaia Méndez Zorrilla. 2012. A Stress Sensor Based on Galvanic Skin Response (GSR) Controlled by ZigBee. Sensors 12, 5 (2012), 6075--6101.",
      "doi": ""
    },
    {
      "text": "Julian Wallis. 2006. Interactive Translation vs Pre-translation in the Context of Translation Memory Systems: Investigating the Effects of Translation Method on Productivity, Quality and Translator Satisfaction. Ph.D. Dissertation. University of Ottawa.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A Myers. 2005. Maximizing the Guessability of Symbolic Input. In CHI'05 Extended Abstracts on Human Factors in Computing Systems. ACM, 1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Jacob O Wobbrock, Meredith Ringel Morris, and Andrew D Wilson. 2009. User-defined Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Marcos Zampieri and Mihaela Vela. 2014. Quantifying the Influence of MT Output in the Translators' Performance: A Case Study in Technical Translation. In Proceedings of the EACL 2014 Workshop on Humans and Computer-assisted Translation. 93--98.",
      "doi": ""
    },
    {
      "text": "Julián Zapata. 2016. Translating On the Go? Investigating the Potential of Multimodal Mobile Devices for Interactive Translation Dictation. Tradumàtica: Traducció i Tecnologies de la Informació i la Comunicació 14 (2016), 66--74.",
      "doi": ""
    },
    {
      "text": "Anna Zaretskaya, Gloria Corpas Pastor, and Miriam Seghiri. 2015. Translators' Requirements for Translation Technologies: Results of a User Survey. In Proceedings of the Conference New Horizons is Translation and Interpreting Studies.",
      "doi": ""
    },
    {
      "text": "Anna Zaretskaya and Míriam Seghiri. 2018. User Perspective on Translation Tools: Findings of a User Survey. Ph.D. Dissertation. University of Malaga.",
      "doi": ""
    },
    {
      "text": "Anna Zaretskaya, Mihaela Vela, Gloria Corpas Pastor, and Miriam Seghiri. 2016. Comparing Post-Editing Difficulty of Different Machine Translation Errors in Spanish and German Translations from English. International Journal of Language and Linguistics 3, 3 (2016), 91--100.",
      "doi": ""
    },
    {
      "text": "Jost Zetzsche. 2016. Lilt: Translation Environment Tool of a Different Kind. Multilingual magazine (2016), 15--17.",
      "doi": ""
    }
  ]
}