{
  "doi": "10.1145/3290605.3300328",
  "title": "Design and Evaluation of Service Robot's Proactivity in Decision-Making Support Process",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "As service robots are envisioned to provide decision-making support (DMS) in public places, it is becoming essential to design the robot's manner of offering assistance. For example, robot shop assistants that proactively or reactively give product recommendations may impact customers' shopping experience. In this paper, we propose an anticipation-autonomy policy framework that models three levels of proactivity (high, medium and low) of service robots in DMS contexts. We conduct a within-subject experiment with 36 participants to evaluate the effects of DMS robot's proactivity on user perceptions and interaction behaviors. Results show that a highly proactive robot is deemed inappropriate though people can get rich information from it. A robot with medium proactivity helps reduce the decision space while maintaining users' sense of engagement. The least proactive robot grants users more control but may not realize its full capability. We conclude the paper with design considerations for service robot's manner.",
  "tags": [
    "robot manner",
    "decision-making support",
    "proactivity",
    "human-robot interaction"
  ],
  "authors": [
    {
      "name": "Zhenhui Peng",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659275091",
      "orcid": "0000-0002-5700-3136"
    },
    {
      "name": "Yunhwan Kwon",
      "institution": "Dongguk University, Seoul, Rebublic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366705",
      "orcid": "missing"
    },
    {
      "name": "Jiaan Lu",
      "institution": "University of Michigan-Shanghai Jiao Tong University Joint Institute, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365635",
      "orcid": "missing"
    },
    {
      "name": "Ziming Wu",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161463",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "Bon Adriel Aseniero, Tiffany Wun, David Ledo, Guenther Ruhe, Anthony Tang, and Sheelagh Carpendale. 2015. STRATOS: Using Visualization to Support Decisions in Strategic Software Release Planning. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1479--1488.  ",
      "doi": "10.1145/2702123.2702426"
    },
    {
      "text": "Jimmy Baraglia, Maya Cakmak, Yukie Nagai, Rajesh Rao, and Minoru Asada. 2016. Initiative in Robot Assistance During Collaborative Task Execution. In The Eleventh ACM/IEEE International Conference on Human Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 67--74. http://dl.acm.org/citation.cfm?id=2906831.2906844 ",
      "doi": "10.5555/2906831.2906844"
    },
    {
      "text": "Jenay M. Beer, Arthur D. Fisk, and Wendy A. Rogers. 2014. Toward a Framework for Levels of Robot Autonomy in Human-robot Interaction. J. Hum.-Robot Interact. 3, 2 (July 2014), 74--99.  ",
      "doi": "10.5898/JHRI.3.2.Beer"
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 2001. Relational Agents: A Model and Implementation of Building User Trust. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 396--403.  ",
      "doi": "10.1145/365024.365304"
    },
    {
      "text": "Dan Bohus and Eric Horvitz. 2014. Managing Human-Robot Engagement with Forecasts and... Um... Hesitations. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 2--9.  ",
      "doi": "10.1145/2663204.2663241"
    },
    {
      "text": "Dan Bohus, Chit W. Saw, and Eric Horvitz. 2014. Directions Robot: In-the-wild Experiences and Lessons Learned. In Proceedings of the 2014 International Conference on Autonomous Agents and Multi-agent Systems (AAMAS '14). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 637--644. http://dl.acm.org/ citation.cfm?id=2615731.2615835 ",
      "doi": "10.5555/2615731.2615835"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "P. Brown, S.C. Levinson, S.C. Levinson, and J.J. Gumperz. 1987. Politeness: Some Universals in Language Usage. Cambridge University Press. https://books.google.com.hk/books?id=OG7W8yA2XjcC",
      "doi": ""
    },
    {
      "text": "T. Chakraborti, S. Kambhampati, M. Scheutz, and Y. Zhang. 2017. AI Challenges in Human-Robot Cognitive Teaming. ArXiv e-prints (July 2017). arXiv:cs.AI/1707.04775",
      "doi": ""
    },
    {
      "text": "Li Chen and Pearl Pu. 2012. Critiquing-based Recommenders: Survey and Emerging Trends. User Modeling and User-Adapted Interaction 22, 1--2 (April 2012), 125--150.  ",
      "doi": "10.1007/s11257-011-9108-6"
    },
    {
      "text": "J. Michael Crant. 2000. Proactive Behavior in Organizations. Journal of Management 26, 3 (2000), 435--462.",
      "doi": ""
    },
    {
      "text": "Kerstin Dautenhahn. 2007. Socially intelligent robots: dimensions of human--robot interaction. Philosophical Transactions of the Royal Society B: Biological Sciences 362, 1480 (2007), 679--704.",
      "doi": ""
    },
    {
      "text": "Julia Fink, Séverin Lemaignan, Pierre Dillenbourg, Philippe Rétornaz, Florian Vaussard, Alain Berthoud, Francesco Mondada, Florian Wille, and Karmen Franinovi?. 2014. Which Robot Behavior Can Motivate Children to Tidy Up Their Toys?: Design and Evaluation of \"Ranger\". In Proceedings of the 2014 ACM/IEEE International Conference on Human-robot Interaction (HRI '14). ACM, New York, NY, USA, 439--446.  ",
      "doi": "10.1145/2559636.2559659"
    },
    {
      "text": "Kerstin Fischer. 2011. Interpersonal Variation in Understanding Robots As Social Actors. In Proceedings of the 6th International Conference on Human-robot Interaction (HRI '11). ACM, New York, NY, USA, 53--60.  ",
      "doi": "10.1145/1957656.1957672"
    },
    {
      "text": "The International Organization for Standardization. 2012. Robot Autonomy. https://www.iso.org/obp/ui/#iso:std:iso:8373:ed-2:v1:en.",
      "doi": ""
    },
    {
      "text": "A. Garrell, M. Villamizar, F. Moreno-Noguer, and A. Sanfeliu. 2013. Proactive behavior of an autonomous mobile robot for human-assisted learning. In 2013 IEEE RO-MAN. 107--113.",
      "doi": ""
    },
    {
      "text": "E.R. Girden. 1992. ANOVA: Repeated measures. Sage Publications, Inc., Thousand Oaks, CA, US.",
      "doi": ""
    },
    {
      "text": "Jennifer Goetz and Sara Kiesler. 2002. Cooperation with a Robotic Assistant. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 578--579.  ",
      "doi": "10.1145/506443.506492"
    },
    {
      "text": "Michael A. Goodrich and Alan C. Schultz. 2007. Human-robot Interaction: A Survey. Found. Trends Hum.-Comput. Interact. 1, 3 (Jan. 2007), 203--275.  ",
      "doi": "10.1561/1100000005"
    },
    {
      "text": "Adam M. Grant and Susan J. Ashford. 2008. The dynamics of proactivity at work. Research in Organizational Behavior 28 (2008), 3 -- 34.",
      "doi": ""
    },
    {
      "text": "Tianran Hu, Anbang Xu, Zhe Liu, Quanzeng You, Yufan Guo, Vibha Sinha, Jiebo Luo, and Rama Akkiraju. 2018. Touch Your Heart: A Toneaware Chatbot for Customer Care on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 415, 12 pages.  ",
      "doi": "10.1145/3173574.3173989"
    },
    {
      "text": "Chien-Ming Huang, Maya Cakmak, and Bilge Mutlu. 2015. Adaptive Coordination Strategies for Human-Robot Handovers. In Robotics: Science and Systems.",
      "doi": ""
    },
    {
      "text": "Chien-Ming Huang and Bilge Mutlu. 2016. Anticipatory Robot Control for Efficient Human-Robot Collaboration. In The Eleventh ACM/IEEE International Conference on Human-Robot Interaction (HRI '16). IEEE Press, Piscataway, NJ, USA, 83--90. http://dl.acm.org/citation.cfm?id= 2906831.2906846 ",
      "doi": "10.5555/2906831.2906846"
    },
    {
      "text": "Merkert Johannes, Mueller Marcus, and Hubl Marvin. 2015. A Survey of the Application of Machine Learning in Decision Support Systems. In ECIS 2015 Completed Research Papers.",
      "doi": ""
    },
    {
      "text": "Takayuki Kanda, Masahiro Shiomi, Zenta Miyashita, Hiroshi Ishiguro, and Norihiro Hagita. 2009. An affective guide robot in a shopping mall. In Proceedings of the 4th ACM/IEEE international conference on Human-robot interaction - HRI '09. 173.  ",
      "doi": "10.1145/1514095.1514127"
    },
    {
      "text": "Yusuke Kato, Takayuki Kanda, and Hiroshi Ishiguro. 2015. May I Help You?: Design of Human-like Polite Approaching Behavior. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). ACM, New York, NY, USA, 35--42.  ",
      "doi": "10.1145/2696454.2696463"
    },
    {
      "text": "Peter G.W. Keen and Michael S. Scott Morton. 1978. Decision support systems: an organizational perspective. Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "T. Kim and P. Hinds. 2006. Who Should I Blame? Effects of Autonomy and Transparency on Attributions in Human-Robot Interaction. In ROMAN 2006 - The 15th IEEE International Symposium on Robot and Human Interactive Communication. 80--85.",
      "doi": ""
    },
    {
      "text": "Yoshinori Kobayashi, Takashi Shibata, Yosuke Hoshi, Yoshinori Kuno, Mai Okada, and Keiichi Yamazaki. 2010. Selective Function of Speaker Gaze Before and During Questions-Towards Developing Museum Guide Robots. In CHI EA '10 Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems. 4201--4206.  ",
      "doi": "10.1145/1753846.1754126"
    },
    {
      "text": "H. S. Koppula and A. Saxena. 2016. Anticipating Human Activities Using Object Affordances for Reactive Robotic Response. IEEE Transactions on Pattern Analysis and Machine Intelligence 38, 1 (Jan 2016), 14--29.  ",
      "doi": "10.1109/TPAMI.2015.2430335"
    },
    {
      "text": "Min Kyung Lee, Sara Kielser, Jodi Forlizzi, Siddhartha Srinivasa, and Paul Rybski. 2010. Gracefully Mitigating Breakdowns in Robotic Services. In Proceedings of the 5th ACM/IEEE International Conference on Human-robot Interaction (HRI '10). IEEE Press, Piscataway, NJ, USA, 203--210. http://dl.acm.org/citation.cfm?id=1734454.1734544 ",
      "doi": "10.5555/1734454.1734544"
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2010. Receptionist or Information Kiosk: How Do People Talk with a Robot?. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/1718918.1718927"
    },
    {
      "text": "Manja Lohse, Reinier Rothuis, Jorge Gallego-Pérez, Daphne E. Karreman, and Vanessa Evers. 2014. Robot Gestures Make Difficult Tasks Easier: The Impact of Gestures on Perceived Workload and Task Performance. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1459--1466.  ",
      "doi": "10.1145/2556288.2557274"
    },
    {
      "text": "International Federation of Robotics. 2012. Service Robots. https: //ifr.org/service-robots/.",
      "doi": ""
    },
    {
      "text": "Amit Kumar Pandey, Muhammad Ali, and Rachid Alami. 2013. Towards a Task-Aware Proactive Sociable Robot Based on Multi-state Perspective-Taking. International Journal of Social Robotics 5, 2 (01 Apr 2013), 215--236.",
      "doi": ""
    },
    {
      "text": "Sharon K Parker and Catherine G Collins. 2010. Taking stock: Integrating and differentiating multiple proactive behaviors. Journal of Management 36, 3 (2010), 633--662. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Hannah R.M. Pelikan and Mathias Broth. 2016. Why That Nao?: How Humans Adapt to a Conventional Humanoid Robot in Taking Turns-at-Talk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4921--4932.  ",
      "doi": "10.1145/2858036.2858478"
    },
    {
      "text": "V. Perera and M. Veloso. 2017. Learning to understand questions on the task history of a service robot. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). 304--309.",
      "doi": ""
    },
    {
      "text": "Pearl Pu, Li Chen, and Rong Hu. 2011. A User-centric Evaluation Framework for Recommender Systems. In Proceedings of the Fifth ACM Conference on Recommender Systems (RecSys '11). ACM, New York, NY, USA, 157--164.  ",
      "doi": "10.1145/2043932.2043962"
    },
    {
      "text": "Pei Luen Patrick Rau, Ye Li, and Jun Liu. 2013. Effects of a social robot's autonomy and group orientation on human decision-making. Advances in Human-Computer Interaction 2013 (2013), 6--8.  ",
      "doi": "10.1155/2013/263721"
    },
    {
      "text": "Laurel D. Riek. 2012. Wizard of Oz Studies in HRI: A Systematic Review and New Reporting Guidelines. J. Hum.-Robot Interact. 1, 1 (July 2012), 119--136.  ",
      "doi": "10.5898/JHRI.1.1.Riek"
    },
    {
      "text": "Satoru Satake, Takayuki Kanda, Dylan F. Glas, Michita Imai, Hiroshi Ishiguro, and Norihiro Hagita. 2009. How to Approach Humans?: Strategies for Social Robots to Initiate Interaction. In Proceedings of the 4th ACM/IEEE International Conference on Human-Robot Interaction (HRI '09). ACM, New York, NY, USA, 109--116.  ",
      "doi": "10.1145/1514095.1514117"
    },
    {
      "text": "Ameneh Shamekhi, Q. Vera Liao, Dakuo Wang, Rachel K. E. Bellamy, and Thomas Erickson. 2018. Face Value? Exploring the Effects of Embodiment for a Group Facilitation Agent. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 391, 13 pages.  ",
      "doi": "10.1145/3173574.3173965"
    },
    {
      "text": "Thomas Sheridan, W L. Verplank, and T L. Brooks. 1978. Human and Computer Control of Undersea Teleoperators. Advances in HumanComputer Interaction (1978), MIT Man--Machine Systems Laboratory.",
      "doi": ""
    },
    {
      "text": "Chao Shi, Michihiro Shimada, Takayuki Kanda, Hiroshi Ishiguro, and Norihiro Hagita. 2011. Spatial Formation Model for Initiating Conversation. In Proceedings of Robotics: Science and Systems. Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Masahiro Shiomi, Kazuhiko Shinozawa, Yoshifumi Nakagawa, Takahiro Miyashita, Toshio Sakamoto, Toshimitsu Terakubo, Hiroshi Ishiguro, and Norihiro Hagita. 2013. Recommendation Effects of a Social Robot for Advertisement-Use Context in a Shopping Mall. International Journal of Social Robotics 5, 2 (01 Apr 2013), 251--262.",
      "doi": ""
    },
    {
      "text": "Jacob Solomon. 2014. Customization Bias in Decision Support Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3065--3074.  ",
      "doi": "10.1145/2556288.2557211"
    },
    {
      "text": "Vasant Srinivasan and Leila Takayama. 2016. Help Me Please: Robot Politeness Strategies for Soliciting Help From Humans. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4945--4955.  ",
      "doi": "10.1145/2858036.2858217"
    },
    {
      "text": "Mingfei Sun, Zhenjie Zhao, and Xiaojuan Ma. 2017. Sensing and Handling Engagement Dynamics in Human-Robot Interaction Involving Peripheral Computing Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 556--567.  ",
      "doi": "10.1145/3025453.3025469"
    },
    {
      "text": "Leila Takayama, Victoria Groom, and Clifford Nass. 2009. I'm Sorry, Dave: I'm Afraid I Won'T Do That: Social Aspects of Human-agent Conflict. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2099--2108.  ",
      "doi": "10.1145/1518701.1519021"
    },
    {
      "text": "Cristen Torrey, Susan Fussell, and Sara Kiesler. 2013. How a Robot Should Give Advice. In Proceedings of the 8th ACM/IEEE International Conference on Human-robot Interaction (HRI '13). IEEE Press, Piscataway, NJ, USA, 275--282. http://dl.acm.org/citation.cfm?id=2447556. ",
      "doi": "10.5555/2447556.2447666"
    },
    {
      "text": "L. Woiceshyn, Y. Wang, G. Nejat, and B. Benhabib. 2017. Personalized clothing recommendation by a social robot. In 2017 IEEE International Symposium on Robotics and Intelligent Sensors (IRIS). 179--185.",
      "doi": ""
    },
    {
      "text": "Yanzhen Yue, Xiaojuan Ma, and Zhenhui Jiang. 2014. Share Your View: Impact of Co-navigation Support and Status Composition in Collaborative Online Shopping. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3299--3308.  ",
      "doi": "10.1145/2556288.2557143"
    },
    {
      "text": "Yanzhen Yue, Xiaojuan Ma, and Zhenhui Jiang. 2016. Influence of Content Layout and Motivation on Users' Herd Behavior in Social Discovery. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5715--5719.  ",
      "doi": "10.1145/2858036.2858497"
    },
    {
      "text": "Yu Zhang, V. Narayanan, T. Chakraborti, and S. Kambhampati. 2015. A human factors analysis of proactive support in human-robot teaming. In 2015 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 3586--3593.",
      "doi": ""
    }
  ]
}