{
  "doi": "10.1145/3290605.3300615",
  "title": "Empowering Expression for Users with Aphasia through Constrained Creativity",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Creative activities allow people to express themselves in rich, nuanced ways. However, being creative does not always come easily. For example, people with speech and language impairments, such as aphasia, face challenges in creative activities that involve language. In this paper, we explore the concept of constrained creativity as a way of addressing this challenge and enabling creative writing. We report an app, MakeWrite, that supports the constrained creation of digital texts through automated redaction. The app was co-designed with and for people with aphasia and was subsequently explored in a workshop with a group of people with aphasia. Participants were not only successful in crafting novel language, but, importantly, self-reported that the app was crucial in enabling them to do so. We refect on the potential of technology-supported constrained creativity as a means of empowering expression amongst users with diverse needs.",
  "authors": [
    {
      "name": "Timothy Neate",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-99658696166/rel-imgonly/moi.jpg",
      "acmid": "99658696166",
      "orcid": "0000-0002-1387-8168"
    },
    {
      "name": "Abi Roper",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490651214",
      "orcid": "missing"
    },
    {
      "name": "Stephanie Wilson",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81336493845",
      "orcid": "missing"
    },
    {
      "name": "Jane Marshall",
      "institution": "City, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490679579",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aphasia.org. 2018. National Aphasia Organization. https://www.aphasia.org/",
      "doi": ""
    },
    {
      "text": "Luca Benedetti, Holger Winnemöller, Massimiliano Corsini, and Roberto Scopigno. 2014. Painting with Bob: assisted creativity for novices. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 419--428.  ",
      "doi": "10.1145/2642918.2647415"
    },
    {
      "text": "Ben Bengler and Nick Bryan-Kinns. 2013. Designing collaborative musical experiences for broad audiences. In Proceedings of the 9th ACM Conference on Creativity & Cognition. ACM, 234--242.  ",
      "doi": "10.1145/2466627.2466633"
    },
    {
      "text": "Michael Mose Biskjaer and Balder Onarheim. 2011. The ambiguous role of constraints in creativity: A cross-domain exploration.",
      "doi": ""
    },
    {
      "text": "Gillie Bolton. 1999. The therapeutic potential of creative writing: writing myself. Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Aikaterini Bourazeri and Simone Stumpf. 2018. Co-Designing Smart Home Technology with People with Dementia or Parkinson's Disease. In Proceedings of the 10th NordiCHI Conference.  ",
      "doi": "10.1145/3240167.3240197"
    },
    {
      "text": "Jordan Boyd-graber, Sonya Nikolova, Karyn Mofatt, Kenrick Kin, Joshua Lee, Lester Mackey, Marilyn Tremaine, Maria Klawe, and B C Vt. 2006. Participatory Design with Proxies : Developing a DesktopPDA System to Support People with Aphasia. CHI 2006 Proceedings (2006), 151--160.  ",
      "doi": "10.1145/1124772.1124797"
    },
    {
      "text": "Caitlin Brandenburg, Linda Worrall, Amy D. Rodriguez, and David Copland. 2013. Mobile computing technology and aphasia: An integrated review of accessibility and potential uses. Aphasiology 27, 4 (2013), 444--461.",
      "doi": ""
    },
    {
      "text": "Chris Code, Ilias Papathanasiou, Silvia Rubio-Bruno, María de la Paz Cabana, Maria Marta Villanueva, Line Haaland-Johansen, Tatjana Prizl-Jakovac, Ana Leko, Nada Zemva, Ruth Patterson, et al. 2016. International patterns of the public awareness of aphasia. International journal of language & communication disorders 51, 3 (2016), 276--284.",
      "doi": ""
    },
    {
      "text": "Tamlin S Conner, Colin G DeYoung, and Paul J Silvia. 2018. Everyday creative activity as a path to fourishing. The Journal of Positive Psychology 13, 2 (2018), 181--189.",
      "doi": ""
    },
    {
      "text": "Tim Coughlan and Peter Johnson. 2007. Constrain yourselves: Exploring end user development in support for musical creativity. In Proceedings of the 6th ACM SIGCHI Conference on Creativity & Cognition. ACM, 247--248.  ",
      "doi": "10.1145/1254960.1254996"
    },
    {
      "text": "Darren W Dahl and C Page Moreau. 2007. Thinking inside the box: Why consumers enjoy constrained creative experiences. Journal of Marketing Research 44, 3 (2007), 357--369.",
      "doi": ""
    },
    {
      "text": "Junot Daz. 2008. The brief wondrous life of Oscar Wao. Penguin.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defning gamifcation. In Proceedings of the 15th international academic MindTrek conference: Envisioning future media environments. ACM, 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Kathleen C Fraser, Frank Rudzicz, and Elizabeth Rochon. 2013. Using text and acoustic features to diagnose progressive aphasia and its subtypes. In INTERSPEECH. 2177--2181.",
      "doi": ""
    },
    {
      "text": "Julia Galliers, Stephanie Wilson, Jane Marshall, Richard Talbot, Niamh Devane, Tracey Booth, Celia Woolf, and Helen Greenwood. 2017. Experiencing EVA Park, a Multi-User Virtual World for People with Aphasia. ACM Trans. Access. Comput. 10, 4, Article 15 (Oct. 2017), 24 pages.  ",
      "doi": "10.1145/3134227"
    },
    {
      "text": "Julia Galliers, Stephanie Wilson, Abi Roper, Naomi Cocks, Jane Marshall, Sam Muscroft, and Tim Pring. 2012. Words are not enough: empowering people with aphasia in the design process. In Proceedings of the 12th participatory design conference: Research papers-volume 1. ACM, 51--60.  ",
      "doi": "10.1145/2347635.2347643"
    },
    {
      "text": "Marjan Ghazvininejad, Xing Shi, Yejin Choi, and Kevin Knight. 2016. Generating topical poetry. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. 1183--1191.",
      "doi": ""
    },
    {
      "text": "Ronald E Goldsmith and Timothy A Matherly. 1988. Creativity and self-esteem: A multiple operationalization validity study. The Journal of psychology 122, 1 (1988), 47--56.",
      "doi": ""
    },
    {
      "text": "Carole-Ann Greig, Renée Harper, Tanya Hirst, Tami Howe, and Bronwyn Davidson. 2008. Barriers and Facilitators to Mobile Phone Use for People with Aphasia. Topics in Stroke Rehabilitation 15, 4 (2008), 307--324.",
      "doi": ""
    },
    {
      "text": "Brian Grellmann, Timothy Neate, Abi Roper, Stephanie Wilson, and Jane Marshall. 2018. Investigating Mobile Accessibility Guidance for People with Aphasia. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18). ACM, New York, NY, USA, 410--413.  ",
      "doi": "10.1145/3234695.3241011"
    },
    {
      "text": "J. Hamari, J. Koivisto, and H. Sarsa. 2014. Does Gamifcation Work? -- A Literature Review of Empirical Studies on Gamifcation. In 2014 47th Hawaii International Conference on System Sciences (HICSS), Vol. 00. 3025--3034.  ",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Chris Ireland and Maria Black. 1992. Living with aphasia: the insight story. (1992).",
      "doi": ""
    },
    {
      "text": "Chris Ireland and Carole Pound. 2003. Cebrelating aphasia poetry power. Aphasia inside out: Refections on communication disability (2003), 145.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Jessica L Feuston, Caroline Edasis, and Anne Marie Piper. 2018. Making as expression: Informing design with people with complex communication needs through art therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 351.  ",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Jaime Lee, Robert Fowler, Daniel Rodney, Leora Cherney, and Steven L. Small. 2010. IMITATE: An intensive computer-based treatment for aphasia based on action observation and imitation. Aphasiology 24, 4 (2010), 449--465.",
      "doi": ""
    },
    {
      "text": "James Lindon. 1969. The Vocabularyclept Poem, No. 1. Word Ways 2, 2 (1969), 8. https://digitalcommons.butler.edu/wordways/vol2/iss2/8/",
      "doi": ""
    },
    {
      "text": "Abdullah Al Mahmud, Yvonne Limpens, and Jean Bernard Martens. 2013. Expressing through digital photographs: An assistive tool for persons with aphasia. Universal Access in the Information Society 12, 3 (2013), 309--326.  ",
      "doi": "10.1007/s10209-012-0286-8"
    },
    {
      "text": "Abdullah Al Mahmud and Jean-Bernard Martens. 2015. 3 Iterative Design and Field Trial of an Aphasia-Friendly Email Tool. ACM Transactions on Accessible Computing 7, 13 (2015), 13.1--13.36.  ",
      "doi": "10.1145/2790305"
    },
    {
      "text": "Joe Marshall. 2009. I Seek the Nerves Under Your Skin. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (C&C '09). ACM, New York, NY, USA, 477--478.  ",
      "doi": "10.1145/1640233.1640364"
    },
    {
      "text": "Eitan Mendelowitz. 2006. Drafting Poems: Inverted Potentialities. In Proceedings of the 14th ACM International Conference on Multimedia (MM '06). ACM, New York, NY, USA, 1047--1048.  ",
      "doi": "10.1145/1180639.1180874"
    },
    {
      "text": "Fiona Menger, Julie Morris, and Christos Salis. 2016. Aphasia in an Internet age: wider perspectives on digital inclusion. Aphasiology 30, 2--3 (2016), 112--132. arXiv:https://doi.org/10.1080/02687038.2015.1109050",
      "doi": ""
    },
    {
      "text": "Catherine Hyland Moon. 2011. Theorizing Materiality in Art Therapy: Negotiated Meanings. In Materials & Media in Art Therapy. Routledge, 81--120.",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Aikaterini Bourazeri, Abi Roper, Simone Stumpf, and Stephanie Wilson. 2019. Co-Created Personas: Engaging and EmpoweringUsers with Diverse Needs Within the Design Process. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/3290605.3300880"
    },
    {
      "text": "Hugo Gonçalo Oliveira. 2012. PoeTryMe: a versatile platform for poetry generation. Computational Creativity, Concept Invention, and General Intelligence 1 (2012), 21.",
      "doi": ""
    },
    {
      "text": "Rebecca Palmer, Pam Enderby, Cindy Cooper, Nick Latimer, Steven Julious, Gail Paterson, Munyaradzi Dimairo, Simon Dixon, Jane Mortley, Rose Hilton, et al. 2012. Computer therapy compared with usual care for people with long-standing aphasia poststroke: a pilot randomized controlled trial. Stroke 43, 7 (2012), 1904--1911.",
      "doi": ""
    },
    {
      "text": "Vinícius Carvalho Pereira and Cristiano Maciel. 2013. The user's and the designer's role and the aesthetic experience of generative literature. In Proceedings of the 12th Brazilian Symposium on Human Factors in Computing Systems. Brazilian Computer Society, 188--197. ",
      "doi": "10.5555/2577101.2577140"
    },
    {
      "text": "Niina Pollari. 2017. Form N-400 Erasures. http://magazine.nytyrant.com/form-n-400-erasures/",
      "doi": ""
    },
    {
      "text": "Abi Roper, Ian Davey, Stephanie Wilson, Timothy Neate, Jane Marshall, and Brian Grellmann. 2018. Usability Testing - An Aphasia Perspective. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '18). ACM, New York, NY, USA, 102--106.  ",
      "doi": "10.1145/3234695.3241481"
    },
    {
      "text": "Abi Roper, Jane Marshall, and Stephanie Wilson. 2014. Assessing Technology Use in Aphasia. Assets'14 (2014), 239--240.  ",
      "doi": "10.1145/2661334.2661397"
    },
    {
      "text": "Abi Roper, Jane Marshall, and Stephanie Wilson. 2016. Benefts and limitations of computer gesture therapy for the rehabilitation of severe aphasia. Frontiers in human neuroscience 10 (2016), 595.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity Support Tools: Accelerating Discovery and Innovation. Commun. ACM 50, 12 (Dec. 2007), 20--32.  ",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Patricia D Stokes. 2014. Crossing disciplines: A constraint-based model of the creative/innovative process. Journal of Product Innovation Management 31, 2 (2014), 247--258.",
      "doi": ""
    },
    {
      "text": "Igor Stravinsky. 1970. Poetics of Music (16th ed.). Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Kimberly Tee, Karyn Mofatt, Leah Findlater, Eve MacGregor, Joanna McGrenere, Barbara Purves, and Sidney S. Fels. 2005. A Visual Recipe Book for Persons with Language Impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 501--510.  ",
      "doi": "10.1145/1054972.1055042"
    },
    {
      "text": "Olivier Toubia. 2006. Idea generation, creativity, and incentives. Marketing Science 25, 5 (2006), 411--425.",
      "doi": "10.5555/2882690.2882693"
    },
    {
      "text": "Annalu Waller, Fiona Dennis, Janet Brodie, and Alistair Cairns. 1998. Evaluating the use of TalksBac, a predictive communication device for nonfuent adults with aphasia. International Journal of Language & Communication Disorders 33, 1 (1998), 45--70.",
      "doi": ""
    },
    {
      "text": "Stephanie Wilson, Abi Roper, Jane Marshall, Julia Galliers, Niamh Devane, Tracey Booth, and Celia Woolf. 2015. Codesign for people with aphasia through tangible design languages. CoDesign 11, 1 (2015), 21--34.",
      "doi": ""
    },
    {
      "text": "Xingxing Zhang and Mirella Lapata. 2014. Chinese poetry generation with recurrent neural networks. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). 670-- 680.",
      "doi": ""
    }
  ]
}