{
  "doi": "10.1145/3290605.3300900",
  "title": "Beyond Behavior: The Coach's Perspective on Technology in Health Coaching",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Rapid innovations in electronic healthcare and behavior tracking systems are challenging health coaches (dietitians, personal trainers, etc.) to rethink their traditional roles and healthcare practices. At the same time, many current e-coaching systems have been developed without explicitly incorporating the healthcare professionals' perspective into the design process. In the current paper, we present three consecutive qualitative studies, starting from the health coach's perspective on successful coaching, progressively zooming in on the potential role and impact of technology as part of the coaching process. Our main finding is that coaches are concerned that introducing technology in the coaching process puts too much emphasis on behavioral information, lowering the attention for the client's lived experience, while understanding those experiences is key for successful coaching. We summarize our insights in a multi-channel communication model and draw implications for the design of supporting technology in health coaching.",
  "authors": [
    {
      "name": "Heleen Rutjes",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659236701",
      "orcid": "missing"
    },
    {
      "name": "Martijn C. Willemsen",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81444608032/rel-imgonly/martijn2011.jpg",
      "acmid": "81444608032",
      "orcid": "missing"
    },
    {
      "name": "Wijnand A. IJsselsteijn",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100032008",
      "orcid": "0000-0001-6856-9269"
    }
  ],
  "references": [
    {
      "text": "Alexander T. Adams, Jean Costa, Malte F. Jung, and Tanzeem Choudhury. 2015. Mindless Computing: Designing Technologies to Subtly Influence Behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'15), 719--730.  ",
      "doi": "10.1145/2750858.2805843"
    },
    {
      "text": "Elena Agapie, Bonnie Chinh, Laura R. Pina, Diana Oviedo, Molly C. Welsh, Gary Hsieh, and Sean A. Munson. 2018. Crowdsourcing Exercise Plans Aligned with Expert Guidelines and Everyday Constraints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'18), 1--13.  ",
      "doi": "10.1145/3173574.3173898"
    },
    {
      "text": "Jessica S. Ancker, Holly O. Witteman, Baria Hafeez, Thierry Provencher, Mary Van De Graaf, and Esther Wei. 2015. \"You get reminded you're a sick person\": Personal data tracking and patients with multiple chronic conditions. Journal of Medical Internet Research 17, 8.",
      "doi": ""
    },
    {
      "text": "Joan S. Ash, Marc Berg, and Enrico Coiera. 2004. Some Unintended Consequences of Information Technology in Health Care?: The Nature of Patient Care Information System-related Errors. Journal of the American Medical Informatics Association 11, 2: 104--112.",
      "doi": ""
    },
    {
      "text": "Jozien Bensing. 1991. Doctor-Patient Communication and the Quality of Care. Social Science & Medicine 32, 11: 1301--1310.",
      "doi": ""
    },
    {
      "text": "Andrew B.L. Berry, Catherine Lim, Andrea L. Hartzler, Tad Hirsch, Evette Ludman, Edward H. Wagner, and James D. Ralston. 2017. Creating Conditions for Patients' Values to Emerge in Clinical Conversations. Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17): 1165--1174.  ",
      "doi": "10.1145/3064663.3064669"
    },
    {
      "text": "Imornefe Bowes and Robyn L. Jones. 2006. Working at the Edge of Chaos: Understanding Coaching as a Complex, Interpersonal System. The Sport Psychologist 20: 235--245.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Marco Cardinale and Matthew C. Varley. 2017. Wearable Training-Monitoring Technology?: Applications, Challenges, and Opportunities. International Journal of Sports Physiology and Performance 12: 55--62.",
      "doi": ""
    },
    {
      "text": "Chia-fang Chung, Jonathan Cook, Elizabeth Bales, Jasmine Zia, and Sean A. Munson. 2015. More than telemonitoring: Health provider use and nonuse of life-log data in irritable bowel syndrome and weight management. Journal of Medical Internet Research 17, 8.",
      "doi": ""
    },
    {
      "text": "Sarah A. Collins, Matthew Fred, Lauren Wilcox, and David K. Vawdrey. 2012. Workarounds Used by Nurses to Overcome Design Constraints of Electronic Health Records. In Proceedings of the 11th International Congress on Nursing Informatics.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, and James A. Landay. 2009. Theory-Driven Design Strategies for Technologies that Support Behavior Change in Everyday Life. In Proceedings of the 2009 CHI Conference on Human Factors in Computing Systems (CHI '09), 405--414.  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Felicia Cordeiro, Daniel A. Epstein, Edison Thomaz, Elizabeth Bales, Arvind K. Jagannathan, Gregory D. Abowd, and James Fogarty. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15), 1159--1162.  ",
      "doi": "10.1145/2702123.2702155"
    },
    {
      "text": "Edward L. Deci, Richard M. Ryan, and Richard Koestner. 1999. A Meta-Analytic Review of Eperiments Examining the Effects of Extrinsic Rewards on Intrinsic Motivation. Psychological Bulletin 125, 6: 627--668.",
      "doi": ""
    },
    {
      "text": "Anind K. Dey and Gregory D. Abowd. 1999. Towards a Better Understanding of Context and Context-Awareness. Computing Systems 40, 3: 304--307.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David S. Kirk, and Abigail C. Durrant. 2016. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human-Computer Interaction 31, 6: 518--557.  ",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "Daniel A. Epstein, Bradley H. Jacobson, Elizabeth Bales, David W. McDonald, and Sean A. Munson. 2015. From \"nobody cares\" to \"way to go!\": A Design Framework for Social Sharing in Personal Informatics. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1622--1636.  ",
      "doi": "10.1145/2675133.2675135"
    },
    {
      "text": "Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data Daniel. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14), 667--676.  ",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Jordan Etkin. 2016. The Hidden Cost of Personal Quantification. Journal of Consumer Research 42, 6: 967--984.",
      "doi": ""
    },
    {
      "text": "B.J. Fogg. 2003. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann Publishers, San Francisco, USA. ",
      "doi": "10.5555/640634"
    },
    {
      "text": "Carl Benedikt Frey and Michael A. Osborne. 2017. The future of employment: How susceptible are jobs to computerisation? Technological Forecasting and Social Change 114: 254--280.",
      "doi": ""
    },
    {
      "text": "Katleen Gabriels and Tania Moerenhout. 2018. Exploring entertainment medicine and professionalization of self-care: Interview study among doctors on the potential effects of digital self-tracking. Journal of Medical Internet Research 20, 1: 1--12.",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William Green and Boris De Ruyter. 2010. The design and evaluation of interactive systems with perceived social intelligence: five challenges. AI & Society 25, 2: 203--210.  ",
      "doi": "10.1007/s00146-009-0252-z"
    },
    {
      "text": "Shona L. Halson. 2014. Monitoring Training Load to Understand Fatigue in Athletes. Sports Medicine 44, 2: 139--147.",
      "doi": ""
    },
    {
      "text": "Sander Hermsen, Jeana Frost, Reint Jan Renes, and Peter Kerkhof. 2016. Using feedback through digital technology to disrupt and change habitual behavior: A critical review of current literature. Computers in Human Behavior 57: 61--74.  ",
      "doi": "10.1016/j.chb.2015.12.023"
    },
    {
      "text": "Matthew K. Hong, Udaya Lakshmi, Thomas A. Olson, and Lauren Wilcox. 2018. Visual ODLs?: Co-Designing Patient-Generated Observations of Daily Living to Support Data-Driven Conversations in Pediatric Care Aflac Cancer and Blood Disorders Center. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '18), 1--13.  ",
      "doi": "10.1145/3173574.3174050"
    },
    {
      "text": "Wijnand IJsselsteijn, Yvonne de Kort, Cees Midden, Berry Eggen, and Elise Van Den Hoven. 2006. Persuasive technology for human well-being: setting the scene. In International conference on persuasive technology. Springer, Berlin, Heidelberg, 1--5. ",
      "doi": "10.5555/1986822.1986823"
    },
    {
      "text": "Institute of Medicine. 2001. Health and Behavior: The Interplay of Biological, Behavioral and Societal Influences. National Academies Press, Washington, D.C.",
      "doi": ""
    },
    {
      "text": "Robyn L. Jones and Mike Wallace. 2005. Another bad day at the training ground: Coping with ambiguity in the coaching context. Sport, Education and Society 10, 1: 119--134.",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos, Rúben Gouveia, Marc Hassenzahl, and Jodi Forlizzi. 2016. Wellbeing in the Making: Peoples' Experiences with Wearable Activity Trackers. Psychology of well-being 6, 4: 1--17.",
      "doi": ""
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17), 629--641.  ",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Elisabeth T. Kersten - Van Dijk and Wijnand A. IJsselsteijn. 2016. Design beyond the numbers: sharing, comparing, storytelling and the need for a Quantified Us. Interaction Design and Architecture(s) Journal (IxD&A) 29: 121--135.",
      "doi": ""
    },
    {
      "text": "Elisabeth T. Kersten - Van Dijk, Wijnand A. IJsselsteijn, and Joyce H.D.M. Westerink. 2016. Deceptive visualizations and user bias: a case for personalization and ambiguity in PI visualizations. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (Ubicomp '16), 588--593.  ",
      "doi": "10.1145/2968219.2968326"
    },
    {
      "text": "Elisabeth T. Kersten - van Dijk, Joyce H.D.M. Westerink, Femke Beute, and Wijnand A. IJsselsteijn. 2017. Personal Informatics, Self-Insight and Behavior Change: a Critical Review of Current Literature. Human--Computer Interaction 32, 5--6: 268--296.  ",
      "doi": "10.1080/07370024.2016.1276456"
    },
    {
      "text": "Kwangyoung Lee and Hwajung Hong. 2018. MindNavigator. Proceedings of the 2018 CHI Conf. on Human Factors in Computing Systems (CHI '18): 1--14.  ",
      "doi": "10.1145/3173574.3174146"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: Supporting self-reflection with ubicomp. Proceedings of the 13th international conference on ubiquitous computing (UbiComp'11).  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Deborah Lupton. 2016. You are Your Data: Self-tracking Practices and Concepts of Data Deborah. In Lifelogging: Theoretical Approaches and Case Studies about Self- tracking, Stefan Selke (ed.). Springer, 61--79.",
      "doi": ""
    },
    {
      "text": "Julie Maitland and Matthew Chalmers. 2011. Designing for peer involvement in weight management. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems (CHI'11), 315--324.  ",
      "doi": "10.1145/1978942.1978988"
    },
    {
      "text": "Gabriela Marcu, Anind Dey, and Sara Kiesler. 2014. Designing for Collaborative Reflection. In Proceedings of the 8th International Conf. on Pervasive Computing Technologies for Healthcare (PervasiveHealth'14), 9--16.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.254987"
    },
    {
      "text": "Sandra Mathison. 1988. Why Triangulate? Educational Researcher 17, 2: 13--17.",
      "doi": ""
    },
    {
      "text": "Helena M. Mentis, Anita Komlodi, Katrina Schrader, Michael Phipps, Ann Gruber-Baldini, Karen Yarbrough, and Lisa Shulman. 2017. Crafting a View of Self-Tracking Data in the Clinical Visit. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'17): 5800--5812.  ",
      "doi": "10.1145/3025453.3025589"
    },
    {
      "text": "Helena Marie Mentis. 2010. Emotion Awareness and Invisibility in an Emergency Room: a Socio-Technical Dilemma.",
      "doi": ""
    },
    {
      "text": "Susan Michie, Stefanie Ashford, Falko F. Sniehotta, Stephan U. Dombrowski, Alex Bishop, and David P. French. 2011. A refined taxonomy of behaviour change techniques to help people change their physical activity and healthy eating behaviours: the CALO-RE taxonomy. Psychology & health 26, 11: 1479--1498.",
      "doi": ""
    },
    {
      "text": "Inbal Nahum-Shani, Eric B. Hekler, and Donna Spruijt-Metz. 2015. Building health behavior models to guide the development of just-in-time adaptive interventions: A pragmatic framework. Health Psychology 34: 1209--1219.",
      "doi": ""
    },
    {
      "text": "John C. Norcross. 2002. Psychotherapy relationships that work: Therapist contributions and responsiveness to patients. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Alanna O'Broin and Stephen Palmer. 2006. The coach-client relationship and contributions made by the coach in improving coaching outcomes. The Coaching Psychologist 2, 2: 16--20.",
      "doi": ""
    },
    {
      "text": "Lucille M.L. Ong, Johanna C.J.M. de Haes, Alaysia M. Hoos, and Frits B. Lammes. 1995. Doctor-patient communication: a review of the literature. Social Science & Medicine 40, 7: 903--918.",
      "doi": ""
    },
    {
      "text": "Rita Orji, Richard Lomotey, Kiemute Oyibo, Fidelia Orji, Jamie Blustein, and Suleman Shahid. 2018. Tracking feels oppressive and ?punishy': Exploring the costs and benefits of self-monitoring for health and wellness. Digital Health 4: 1--10.",
      "doi": ""
    },
    {
      "text": "Raja Parasuraman, Thomas B. Sheridan, and Christopher D. Wickens. 2000. A Model for Types and Levels of Human Interaction with Automation. IEEE Transactions on Systems, Man, and Cybernetics 30, 3: 286--297.  ",
      "doi": "10.1109/3468.844354"
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler, and Phoebe Sengers. 2011. Fit4Life: The Design of a Persuasive Technology Promoting Healthy Behavior and Ideal Weight. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems (CHI'11), 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Aare Puussaar, Adrian K. Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17): 6936--6942.  ",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "Raad voor Volksgezondheid en Samenleving. 2017. Zonder context geen bewijs. 1--90. Retrieved from https://www.raadrvs.nl/uploads/docs/Zonder_context_geen_bewijs.pdf",
      "doi": ""
    },
    {
      "text": "Shriti Raj, Mark W. Newman, Joyce M. Lee, and Mark S. Ackerman. 2017. Understanding Individual and Collaborative Problem-Solving with Patient-Generated Data: Challenges and Opportunities. Proceedings ACM on Human-Computer Interaction 1, 2: 88:1--88:18.  ",
      "doi": "10.1145/3134723"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14): 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Debra L. Roter and Judith A. Hall. 2006. Doctors talking with patients / patients talking with doctors: improving communication in medical visits. Praeger Publishers, Westport.",
      "doi": ""
    },
    {
      "text": "Heleen Rutjes, Martijn C. Willemsen, Janne Van Kollenburg, Sander Bogers, and Wijnand A. IJsselsteijn. 2017. Benefits and Costs of Patient Generated Data, From the Clinician'ss and Patient's Perspective. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth'17), 436--439.  ",
      "doi": "10.1145/3154862.3154920"
    },
    {
      "text": "Thomas L. Webb and Paschal Sheeran. 2006. Does changing behavioral intentions engender behavior change? A meta-analysis of the experimental evidence. Psychological Bulletin 132, 2: 249--268.",
      "doi": ""
    },
    {
      "text": "Peter West, Richard Giordano, Max Van Kleek, and Nigel Shadbolt. 2016. The Quantified Patient in the Doctor's Office. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'16): 3066--3078.  ",
      "doi": "10.1145/2858036.2858445"
    },
    {
      "text": "Peter West, Max Van Kleek, Richard Giordano, Mark J. Weal, and Nigel Shadbolt. 2018. Common Barriers to the Use of Patient-Generated Data Across Clinical Settings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'18).  ",
      "doi": "10.1145/3173574.3174058"
    },
    {
      "text": "Ruth Q. Wolever, Leigh Ann Simmons, Gary A. Sforzo, Diana Dill, Miranda Kaye, Elizabeth M. Bechard, Mary Elaine Southard, Mary Kennedy, Justine Vosloo, and Nancy Yang. 2013. A Systematic Review of the Literature on Health and Wellness Coaching?: Defining a Key Behavioral Intervention in Healthcare. Global Adv Health Med. 2, 4: 38--57.",
      "doi": ""
    },
    {
      "text": "Haining Zhu, Joanna Colgan, Madhu Reddy, and Eun Kyoung Choe. 2016. Sharing Patient-Generated Data in Clinical Practices: An Interview Study. AMIA Annual Symp. Proceedings Americal Medical Informatics Assoc.: 1303--1312.",
      "doi": ""
    },
    {
      "text": "Hubert Zimmermann. 1980. OSI Reference Model-The ISO Model of Architecture for Open Systems Interconnection. IEEE Transactions on Communications 28, 4: 425--432.",
      "doi": ""
    }
  ]
}