{
  "doi": "10.1145/3290605.3300445",
  "title": "Stroke-Gesture Input for People with Motor Impairments: Empirical Results & Research Roadmap",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "We examine the articulation characteristics of stroke-gestures produced by people with upper body motor impairments on touchscreens as well as the accuracy rates of popular classification techniques, such as the $-family, to recognize those gestures. Our results on a dataset of 9,681 gestures collected from 70 participants reveal that stroke-gestures produced by people with motor impairments are recognized less accurately than the same gesture types produced by people without impairments, yet still accurately enough (93.0%) for practical purposes; are similar in terms of geometrical criteria to the gestures produced by people without impairments; but take considerably more time to produce (3.4s vs. 1.7s) and exhibit lower consistency (-49.7%). We outline a research roadmap for accessible gesture input on touchscreens for users with upper body motor impairments, and we make our large gesture dataset publicly available in the community.",
  "authors": [
    {
      "name": "Radu-Daniel Vatavu",
      "institution": "University Ştefan cel Mare of Suceava, Suceava, Romania",
      "img": "/do/10.1145/contrib-81343507895/rel-imgonly/radu.jpg",
      "acmid": "81343507895",
      "orcid": "0000-0002-7631-6445"
    },
    {
      "name": "Ovidiu-Ciprian Ungurean",
      "institution": "University Ştefan cel Mare of Suceava, Suceava, Romania",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260405",
      "orcid": "0000-0003-4741-3294"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Amy Hurst. 2016. An Empirical Investigation of the Situationally-induced Impairments Experienced by Blind Mobile Device Users. In Proceedings of the 13th Web for All Conference (W4A '16). ACM, New York, NY, USA, Article 21, 8 pages.  ",
      "doi": "10.1145/2899475.2899482"
    },
    {
      "text": "Lisa Anthony, YooJin Kim, and Leah Findlater. 2013. Analyzing Usergenerated Youtube Videos to Understand Touchscreen Use by People with Motor Impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Lisa Anthony, Radu-Daniel Vatavu, and Jacob O. Wobbrock. 2013. Understanding the Consistency of Users' Pen and Finger Stroke Gesture Articulation. In Proceedings of Graphics Interface 2013 (GI '13). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 87--94. htp://dl.acm.org/citation.cfm?id=2532129.2532145 ",
      "doi": "10.5555/2532129.2532145"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2010. A Lightweight Multistroke Recognizer for User Interface Prototypes. In Proceedings of Graphics Interface 2010 (GI '10). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 245--252. htp://dl.acm.org/citation.cfm?id= 1839214.1839258 ",
      "doi": "10.5555/1839214.1839258"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2012. $N-protractor: A Fast and Accurate Multistroke Recognizer. In Proceedings of Graphics Interface 2012 (GI '12). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 117--120. htp://dl.acm.org/citation.cfm?id=2305276. ",
      "doi": "10.5555/2305276.2305296"
    },
    {
      "text": "Caroline Appert and Shumin Zhai. 2009. Using Strokes As Command Shortcuts: Cognitive Benefts and Toolkit Support. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2289--2298.  ",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Olivier Bau and Wendy E. Mackay. 2008. OctoPocus: A Dynamic Guide for Learning Gesture-based Command Sets. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Rachel Blagojevic, Samuel Hsiao-Heng Chang, and Beryl Plimmer. 2010. The Power of Automatic Feature Selection: Rubine on Steroids. In Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium (SBIM '10). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 79--86. htp://dl.acm.org/citation.cfm?id=1923363. ",
      "doi": "10.5555/1923363.1923377"
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, and Amaury Trujillo. 2017. Analyzing Visually Impaired People's Touch Gestures on Smartphones. Multimedia Tools Appl. 76, 4 (Feb. 2017), 5141--5169.  ",
      "doi": "10.1007/s11042-016-3594-9"
    },
    {
      "text": "Xiang Cao and Shumin Zhai. 2007. Modeling Human Performance of Pen Stroke Gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1495--1504.  ",
      "doi": "10.1145/1240624.1240850"
    },
    {
      "text": "Patrick Carrington, Jian-Ming Chang, Kevin Chang, Catherine Hornback, Amy Hurst, and Shaun K. Kane. 2016. The Gest-Rest Family: Exploring Input Possibilities for Wheelchair Armrests. ACM Transactions on Accessible Computing 8, 3, Article 12 (April 2016), 24 pages.  ",
      "doi": "10.1145/2873062"
    },
    {
      "text": "Patrick Carrington, Amy Hurst, and Shaun K. Kane. 2014. The Gestrest: A Pressure-sensitive Chairable Input Pad for Power Wheelchair Armrests. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 201--208.  ",
      "doi": "10.1145/2661334.2661374"
    },
    {
      "text": "Patrick Carrington, Amy Hurst, and Shaun K. Kane. 2014. Wearables and Chairables: Inclusive Design of Mobile Input and Output Techniques for Power Wheelchair Users. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3103--3112.  ",
      "doi": "10.1145/2556288.2557237"
    },
    {
      "text": "Dan Claudiu Ciresan, Ueli Meier, Luca Maria Gambardella, and Jurgen Schmidhuber. 2010. Deep, Big, Simple Neural Nets for Handwritten Digit Recognition. Neural Computation 22, 12 (2010), 3207--3220.  ",
      "doi": "10.1162/NECO_a_00052"
    },
    {
      "text": "Tiziano D'albis, Rossella Blatt, Roberto Tedesco, Licia Sbattella, and Matteo Matteucci. 2012. A Predictive Speller Controlled by a Braincomputer Interface Based on Motor Imagery. ACM Transactions on Computer-Human Interaction 19, 3, Article 20 (Oct. 2012), 25 pages.  ",
      "doi": "10.1145/2362364.2362368"
    },
    {
      "text": "Rogério de Lemos, Holger Giese, Hausi A. Müller, Mary Shaw, Jesper Andersson, Marin Litoiu, Bradley Schmerl, Gabriel Tamura, Norha M. Villegas, Thomas Vogel, Danny Weyns, Luciano Baresi, Basil Becker, Nelly Bencomo, Yuriy Brun, Bojan Cukic, Ron Desmarais, Schahram Dustdar, Gregor Engels, Kurt Geihs, Karl M. Göschka, Alessandra Gorla, Vincenzo Grassi, Paola Inverardi, Gabor Karsai, Jef Kramer, Antónia Lopes, Jef Magee, Sam Malek, Serge Mankovskii, Rafaela Mirandola, John Mylopoulos, Oscar Nierstrasz, Mauro Pezzè, Christian Prehofer, Wilhelm Schäfer, Rick Schlichting, Dennis B. Smith, João Pedro Sousa, Ladan Tahvildari, Kenny Wong, and Jochen Wuttke. 2013. Software Engineering for Self-Adaptive Systems: A Second Research Roadmap. Springer Berlin Heidelberg, Berlin, Heidelberg, 1--32.",
      "doi": ""
    },
    {
      "text": "M.P. Dubuisson and A.K. Jain. 1994. A modifed Hausdorf distance for object matching. In Proceedings of 12th International Conference on Pattern Recognition. 566--568.",
      "doi": ""
    },
    {
      "text": "Andy Field. 2009. Discovering Statistics using SPSS, 3rd Ed. SAGE Publications Ltd., London, UK.",
      "doi": ""
    },
    {
      "text": "Leah Findlater, Karyn Mofatt, Jon E. Froehlich, Meethu Malu, and Joan Zhang. 2017. Comparing Touchscreen and Mouse Input Performance by People With and Without Upper Body Motor Impairments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6056--6061.  ",
      "doi": "10.1145/3025453.3025603"
    },
    {
      "text": "Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2010. Towards Accessible Touch Interfaces. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '10). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "Susumu Harada, Jacob O. Wobbrock, and James A. Landay. 2007. Voicedraw: A Hands-free Voice-driven Drawing Application for People with Motor Impairments. In Proceedings of the 9th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '07). ACM, New York, NY, USA, 27--34.  ",
      "doi": "10.1145/1296843.1296850"
    },
    {
      "text": "Poika Isokoski. 2001. Model for Unistroke Writing Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 357--364.  ",
      "doi": "10.1145/365024.365299"
    },
    {
      "text": "Soren Johansen. 1980. The Welch-James Approximation to the Distribution of the Residual Sum of Squares in a Weighted Linear Regression. Biometrika 67, 1 (April 1980), 85--92.",
      "doi": ""
    },
    {
      "text": "Ankit Kamal, Yang Li, and Edward Lank. 2014. Teaching Motion Gestures via Recognizer Feedback. In Proceedings of the 19th International Conference on Intelligent User Interfaces (IUI '14). ACM, New York, NY, USA, 73--82.  ",
      "doi": "10.1145/2557500.2557521"
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to Roam: A Study of Mobile Device Adoption and Accessibility for People with Visual and Motor Disabilities. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '09). ACM, New York, NY, USA, 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Levent Burak Kara and Thomas F. Stahovich. 2004. Hierarchical Parsing and Recognition of Hand-sketched Diagrams. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/1029632.1029636"
    },
    {
      "text": "Yoojin Kim, Nita Sutreja, Jon Froehlich, and Leah Findlater. 2013. Surveying the Accessibility of Touchscreen Games for Persons with Motor Impairments: A Preliminary Analysis. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 68, 2 pages.  ",
      "doi": "10.1145/2513383.2513416"
    },
    {
      "text": "Per-Ola Kristensson and Shumin Zhai. 2004. SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, New York, NY, USA, 43--52.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Andrew Kurauchi, Wenxin Feng, Ajjen Joshi, Carlos Morimoto, and Margrit Betke. 2016. EyeSwipe: Dwell-free Text Entry Using Gaze Paths. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1952--1956.  ",
      "doi": "10.1145/2858036.2858335"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Réjean Plamondon. 2017. The Kinematic Theory Produces Human-Like Stroke Gestures. Interacting with Computers 29, 4 (2017), 552--565.",
      "doi": ""
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, Réjean Plamondon, and RaduDaniel Vatavu. 2018. KeyTime: Super-Accurate Prediction of Stroke Gesture Production Times. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 239, 12 pages.  ",
      "doi": "10.1145/3173574.3173813"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Radu-Daniel Vatavu. 2018. GATO: Predicting Human Performance with Multistroke and Multitouch Gesture Input. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, New York, NY, USA, Article 32, 11 pages.  ",
      "doi": "10.1145/3229434.3229478"
    },
    {
      "text": "Yang Li. 2010. Gesture Search: A Tool for Fast Mobile Data Access. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 87--96.  ",
      "doi": "10.1145/1866029.1866044"
    },
    {
      "text": "Yang Li. 2010. Protractor: A Fast and Accurate Gesture Recognizer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2169--2172.  ",
      "doi": "10.1145/1753326.1753654"
    },
    {
      "text": "A. Chris Long, Jr., James A. Landay, Lawrence A. Rowe, and Joseph Michiels. 2000. Visual Similarity of Pen Gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 360--367.  ",
      "doi": "10.1145/332040.332458"
    },
    {
      "text": "Meethu Malu, Pramod Chundury, and Leah Findlater. 2018. Exploring Accessible Smartwatch Interactions for People with Upper Body Motor Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 488, 12 pages.  ",
      "doi": "10.1145/3173574.3174062"
    },
    {
      "text": "Meethu Malu and Leah Findlater. 2014. \"OK Glass?\" A Preliminary Exploration of Google Glass for Persons with Upper Body Motor Impairments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 267--268.  ",
      "doi": "10.1145/2661334.2661400"
    },
    {
      "text": "Meethu Malu and Leah Findlater. 2015. Personalized, Wearable Control of a Head-mounted Display for Users with Upper Body Motor Impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 221--230.  ",
      "doi": "10.1145/2702123.2702188"
    },
    {
      "text": "Meethu Malu and Leah Findlater. 2017. Sharing Automatically Tracked Activity Data: Implications for Therapists and People with Mobility Impairments. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '17). ACM, New York, NY, USA, 136--145.  ",
      "doi": "10.1145/3154862.3154864"
    },
    {
      "text": "Kyle Montague, Hugo Nicolau, and Vicki L. Hanson. 2014. Motorimpaired Touchscreen Interactions in the Wild. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 123--130.  ",
      "doi": "10.1145/2661334.2661362"
    },
    {
      "text": "Martez E. Mott, Jane E., Cynthia L. Bennett, Edward Cutrell, and Meredith Ringel Morris. 2018. Understanding the Accessibility of Smartphone Photography for People with Motor Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 520, 12 pages.  ",
      "doi": "10.1145/3173574.3174094"
    },
    {
      "text": "Martez E. Mott, Radu-Daniel Vatavu, Shaun K. Kane, and Jacob O. Wobbrock. 2016. Smart Touch: Improving Touch Accuracy for People with Motor Impairments with Template Matching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1934--1946.  ",
      "doi": "10.1145/2858036.2858390"
    },
    {
      "text": "G.R. Müller-Putz, C. Brunner, G. Bauernfeind, M.L. Blefari, J. del R. Millan, R.G.L. Real, A. Kübler, D. Mattia, F. Pichiorri, F. Schettini, N. Ramsey, J. Höhne, B. Blankertz, F. Miralles, B. Otal, C. Guger, R. Ortner, Mannes Poel, Antinus Nijholt, B. Reuderink, N. Birbaumer, A. de Pobes, P. Salomon, M. van Steensel, S. Soekader, and E. Opisso. 2015. The future in brain/neural computer interaction: Horizon 2020. Number FP7-ICT-2013--10 609593. EU & Graz University of Techology. BNCI Horizon 2020 (FP7-ICT2013--10 609593).",
      "doi": ""
    },
    {
      "text": "Maia Naftali and Leah Findlater. 2014. Accessibility in Context: Understanding the Truly Mobile Experience of Smartphone Users with Motor Impairments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 209--216.  ",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "Hugo Nicolau, Tiago Guerreiro, Joaquim Jorge, and Daniel Gonçalves. 2014. Mobile Touchscreen User Interfaces: Bridging the Gap Between Motor-impaired and Able-bodied Users. Univers. Access Inf. Soc. 13, 3 (Aug. 2014), 303--313.  ",
      "doi": "10.1007/s10209-013-0320-5"
    },
    {
      "text": "Uran Oh, Stacy Branham, Leah Findlater, and Shaun K. Kane. 2015. Audio-Based Feedback Techniques for Teaching Touchscreen Gestures. ACM Transactions on Accessible Computing 7, 3, Article 9 (Nov. 2015), 29 pages.  ",
      "doi": "10.1145/2764917"
    },
    {
      "text": "Uran Oh, Shaun K. Kane, and Leah Findlater. 2013. Follow That Sound: Using Sonifcation and Corrective Verbal Feedback to Teach Touchscreen Gestures. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 13, 8 pages.  ",
      "doi": "10.1145/2513383.2513455"
    },
    {
      "text": "Réjean Plamondon. 1995. A kinematic theory of rapid human movements. Part II. Movement time and control. Biological Cybernetics 72, 4 (1995), 309--320.  ",
      "doi": "10.1007/BF00202786"
    },
    {
      "text": "Katrin Plaumann, Milos Babic, Tobias Drey, Witali Hepting, Daniel Stooss, and Enrico Rukzio. 2018. Improving Input Accuracy on Smartphones for Persons Who Are Afected by Tremor Using Motion Sensors. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 156 (Jan. 2018), 30 pages.  ",
      "doi": "10.1145/3161169"
    },
    {
      "text": "Thanawin Rakthanmanon, Bilson Campana, Abdullah Mueen, Gustavo Batista, Brandon Westover, Qiang Zhu, Jesin Zakaria, and Eamonn Keogh. 2012. Searching and Mining Trillions of Time Series Subsequences Under Dynamic Time Warping. In Proceedings of the 18th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '12). ACM, New York, NY, USA, 262--270.  ",
      "doi": "10.1145/2339530.2339576"
    },
    {
      "text": "Yosra Rekik, Radu-Daniel Vatavu, and Laurent Grisoni. 2014. MatchUp & Conquer: A Two-step Technique for Recognizing Unconstrained Bimanual and Multi-fnger Touch Input. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, New York, NY, USA, 201--208.  ",
      "doi": "10.1145/2598153.2598167"
    },
    {
      "text": "Yosra Rekik, Radu-Daniel Vatavu, and Laurent Grisoni. 2014. Understanding Users' Perceived Difculty of Multi-Touch Gesture Articulation. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 232--239.  ",
      "doi": "10.1145/2663204.2663273"
    },
    {
      "text": "Lucas Rosenblatt, Patrick Carrington, Kotaro Hara, and Jefrey P. Bigham. 2018. Vocal Programming for People with Upper-Body Motor Impairments. In Proceedings of the Internet of Accessible Things (W4A '18). ACM, New York, NY, USA, Article 30, 10 pages.  ",
      "doi": "10.1145/3192714.3192821"
    },
    {
      "text": "Quentin Roy, Sylvain Malacria, Yves Guiard, Eric Lecolinet, and James Eagan. 2013. Augmented Letters: Mnemonic Gesture-based Shortcuts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2325--2328.  ",
      "doi": "10.1145/2470654.2481321"
    },
    {
      "text": "Dean Rubine. 1991. Specifying Gestures by Example. In Proceedings of the 18th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '91). ACM, New York, NY, USA, 329--337.  ",
      "doi": "10.1145/122718.122753"
    },
    {
      "text": "William Rucklidge. 1996. Efcient Visual Recognition Using the Hausdorf Distance. Springer-Verlag, Berlin, Heidelberg. htps://www. springer.com/gp/book/9783540619932 ",
      "doi": "10.5555/525527"
    },
    {
      "text": "Tevfk Metin Sezgin and Randall Davis. 2005. HMM-based Efcient Sketch Recognition. In Proceedings of the 10th International Conference on Intelligent User Interfaces (IUI '05). ACM, New York, NY, USA, 281-- 283.  ",
      "doi": "10.1145/1040830.1040899"
    },
    {
      "text": "Alex Shaw and Lisa Anthony. 2016. Analyzing the Articulation Features of Children's Touchscreen Gestures. In Proceedings of the 18th ACM International Conference on Multimodal Interaction (ICMI 2016). ACM, New York, NY, USA, 333--340.  ",
      "doi": "10.1145/2993148.2993179"
    },
    {
      "text": "Eugene M. Taranta, II and Joseph J. LaViola, Jr. 2015. Penny Pincher: A Blazing Fast, Highly Accurate $-family Recognizer. In Proceedings of the 41st Graphics Interface Conference (GI '15). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 195--202. htp: //dl.acm.org/citation.cfm?id=2788890.2788925 ",
      "doi": "10.5555/2788890.2788925"
    },
    {
      "text": "Eugene M. Taranta, II, Mehran Maghoumi, Corey R. Pittman, and Joseph J. LaViola, Jr. 2016. A Rapid Prototyping Approach to Synthetic Data Generation for Improved 2D Gesture Recognition. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 873--885.  ",
      "doi": "10.1145/2984511.2984525"
    },
    {
      "text": "Eugene M. Taranta II, Amirreza Samiei, Mehran Maghoumi, Pooya Khaloo, Corey R. Pittman, and Joseph J. LaViola Jr. 2017. Jackknife: A Reliable Recognizer with Few Samples and Many Modalities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5850--5861.  ",
      "doi": "10.1145/3025453.3026002"
    },
    {
      "text": "Ovidiu-Ciprian Ungurean, Radu-Daniel Vatavu, Luis A. Leiva, and Daniel Martín-Albo. 2018. Predicting Stroke Gesture Input Performance for Users with Motor Impairments. In Adjunct Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18 Adjunct). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3236112.3236116"
    },
    {
      "text": "Ovidiu-Ciprian Ungurean, Radu-Daniel Vatavu, Luis A. Leiva, and Réjean Plamondon. 2018. Gesture Input for Users with Motor Impairments on Touchscreens: Empirical Results Based on the Kinematic Theory. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article LBW537, 6 pages.  ",
      "doi": "10.1145/3170427.3188619"
    },
    {
      "text": "Radu-Daniel Vatavu. 2011. The Efect of Sampling Rate on the Performance of Template-based Gesture Recognizers. In Proceedings of the 13th International Conference on Multimodal Interfaces (ICMI '11). ACM, New York, NY, USA, 271--278.  ",
      "doi": "10.1145/2070481.2070531"
    },
    {
      "text": "Radu-Daniel Vatavu. 2017. Improving Gesture Recognition Accuracy on Touch Screens for Users with Low Vision. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4667--4679.  ",
      "doi": "10.1145/3025453.3025941"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2012. Gestures As Point Clouds: A $P Recognizer for User Interface Prototypes. In Proceedings of the 14th ACM International Conference on Multimodal Interaction (ICMI '12). ACM, New York, NY, USA, 273--280.  ",
      "doi": "10.1145/2388676.2388732"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2013. Relative Accuracy Measures for Stroke Gestures. In Proceedings of the 15th ACM on International Conference on Multimodal Interaction (ICMI '13). ACM, New York, NY, USA, 279--286.  ",
      "doi": "10.1145/2522848.2522875"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2014. Gesture Heatmaps: Understanding Gesture Performance with Colorful Visualizations. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 172--179.  ",
      "doi": "10.1145/2663204.2663256"
    },
    {
      "text": "Radu-Daniel Vatavu, Lisa Anthony, and Jacob O. Wobbrock. 2018. $Q: A super-quick, articulation-invariant stroke-gesture recognizer for low-resource devices. In Proceedings of the ACM Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, New York, NY, USA, Article No. 23.  ",
      "doi": "10.1145/3229434.3229465"
    },
    {
      "text": "Radu-Daniel Vatavu, Bogdan-Florin Gheran, and Maria Doina Schipor. 2018. The Impact of Low Vision on Touch-Gesture Articulation on Mobile Devices. IEEE Pervasive Computing 17, 1 (Jan. 2018), 27--37.  ",
      "doi": "10.1109/MPRV.2018.011591059"
    },
    {
      "text": "Radu-Daniel Vatavu, Daniel Vogel, Géry Casiez, and Laurent Grisoni. 2011. Estimating the Perceived Difculty of Pen Gestures. In Proceedings of the 13th IFIP TC 13 International Conference on Humancomputer Interaction - Volume Part II (INTERACT'11). Springer-Verlag, Berlin, Heidelberg, 89--106. htp://dl.acm.org/citation.cfm?id=2042118. ",
      "doi": "10.5555/2042118.2042130"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Signifcance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Rand Wilcox. 2012. Modern Statistics for the Social and Behavioral Sciences. A Practical Introduction. CRC Press, Boca Raton, FL, USA.",
      "doi": ""
    },
    {
      "text": "Jacob Wobbrock. 2003. The Benefts of Physical Edges in Gesturemaking: Empirical Support for an Edge-based Unistroke Alphabet. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 942--943.  ",
      "doi": "10.1145/765891.766083"
    },
    {
      "text": "Jacob O. Wobbrock. 2006. The EdgeWrite Alphabet, version 3.0.5. Retrieved July 24, 2018 from htp://depts.washington.edu/ewrite/ downloads/EwChart.pdf",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock. 2018. Impact of $-family. Retrieved July 25, 2018 from htp://depts.washington.edu/madlab/proj/dollar/impact.html",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-based Design. Commun. ACM 61, 6 (May 2018), 62--71.  ",
      "doi": "10.1145/3148051"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defned Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, Htet Htet Aung, and Edmund F. LoPresti. 2003. Text Entry from Power Wheelchairs: Edgewrite for Joysticks and Touchpads. SIGACCESS Access. Comput. 77--78 (Sept. 2003), 110--117.  ",
      "doi": "10.1145/1029014.1028650"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, and John A. Kembel. 2003. EdgeWrite: A Stylus-based Text Entry Method Designed for High Accuracy and Stability of Motion. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, New York, NY, USA, 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures Without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Julia Woodward, Alex Shaw, Aishat Aloba, Ayushi Jain, Jaime Ruiz, and Lisa Anthony. 2017. Tablets, Tabletops, and Smartphones: Crossplatform Comparisons of Children's Touchscreen Interactions. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (ICMI 2017). ACM, New York, NY, USA, 5--14.  ",
      "doi": "10.1145/3136755.3136762"
    },
    {
      "text": "Shumin Zhai, Per Kristensson, Caroline Appert, Tue Andersen, and Xiang Cao. 2012. Foundational Issues in Touch-Surface Stroke Gesture Design: An Integrative Review. Found. Trends Hum.-Comput. Interact. 5, 2 (Feb. 2012), 97--205.  ",
      "doi": "10.1561/1100000012"
    },
    {
      "text": "Xiaoyi Zhang, Harish Kulkarni, and Meredith Ringel Morris. 2017. Smartphone-Based Gaze Gesture Communication for People with Motor Disabilities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2878--2889.  ",
      "doi": "10.1145/3025453.3025790"
    },
    {
      "text": "Yu Zhong, Astrid Weber, Casey Burkhardt, Phil Weaver, and Jefrey P. Bigham. 2015. Enhancing Android Accessibility for Users with Hand Tremor by Reducing Fine Pointing and Steady Tapping. In Proceedings of the 12th Web for All Conference (W4A '15). ACM, New York, NY, USA, Article 29, 10 pages.  ",
      "doi": "10.1145/2745555.2747277"
    },
    {
      "text": "Juergen Ziegler, Jose Creissac Campos, and Laurence Nigay. 2014. HCI Engineering: Charting the Way Towards Methods and Tools for Advanced Interactive Systems. In Proc. of the 2014 ACM Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 299--300.  ",
      "doi": "10.1145/2607023.2610289"
    }
  ]
}