{
  "doi": "10.1145/3290605.3300416",
  "title": "Engagement with Mental Health Screening on Mobile Devices: Results from an Antenatal Feasibility Study",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Perinatal depression (PND) affects up to 15% of women within the United Kingdom and has a lasting impact on a woman's quality of life, birth outcomes and her child's development. Suicide is the leading cause of maternal mortality. However, it is estimated that at least 50% of PND cases go undiagnosed. This paper presents the results of the first feasibility study to examine the potential of mobile devices to engage women in antenatal mental health screening. Using a mobile application, 254 women attending 14 National Health Service midwifery clinics provided 2,280 momentary and retrospective reports of their wellbeing over a 9-month period. Women spoke positively of the experience, installing and engaging with this technology regardless of age, education, wellbeing, number of children, marital or employment status, or past diagnosis of depression. 39 women reported a risk of depression, self-harm or suicide; two-thirds of whom were not identified by screening in-clinic.",
  "authors": [
    {
      "name": "Kevin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-99659283723/rel-imgonly/profile_gray_round_resized.png",
      "acmid": "99659283723",
      "orcid": "missing"
    },
    {
      "name": "José Marcano-Belisario",
      "institution": "Imperial College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161956",
      "orcid": "missing"
    },
    {
      "name": "Martin Cohn",
      "institution": "Imperial College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365282",
      "orcid": "missing"
    },
    {
      "name": "Nikolaos Mastellos",
      "institution": "Imperial College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365198",
      "orcid": "missing"
    },
    {
      "name": "Cecily Morrison",
      "institution": "Microsoft Research Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959289057",
      "orcid": "missing"
    },
    {
      "name": "Josip Car",
      "institution": "Imperial College London, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498658623",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Alexander T Adams, Elizabeth L Murnane, Phil Adams, Michael Elfenbein, Pamara F Chang, Shruti Sannon, Geri Gay, and Tanzeem Choudhury. 2018. Keppi: A Tangible User Interface for Self-Reporting Pain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 502.  ",
      "doi": "10.1145/3173574.3174076"
    },
    {
      "text": "Lucy J Allbaugh, Sheila M Marcus, Eleanor C Ford, and Heather A Flynn. 2015. Development of a screening and recruitment registry to facilitate perinatal depression research in obstetrics settings in the USA. International Journal of Gynecology & Obstetrics 128, 3 (2015), 260--263.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 158.  ",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Michael F Armey, Janis H Crowther, and Ivan W Miller. 2011. Changes in ecological momentary assessment reported affect associated with episodes of nonsuicidal self-injury. Behavior therapy 42, 4 (2011), 579--588.",
      "doi": ""
    },
    {
      "text": "Patients Association et al. 2011. Postnatal Depression Services: An Investigation into NHS Service Provision. (2011).",
      "doi": ""
    },
    {
      "text": "Marc S Atkins and Stacy L Frazier. 2011. Expanding the Toolkit or Changing the Paradigm: Are We Ready for a Public Health Approach to Mental Health? Perspectives on Psychological Science 6, 5 (2011), 483--487.",
      "doi": ""
    },
    {
      "text": "Marguerite Barry, Kevin Doherty, José Marcano-Belisario, Josip Car, Cecily Morrison, and Gavin Doherty. 2017. mHealth for Maternal Mental Health: Everyday Wisdom in Ethical Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2708--2756.  ",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Amna Batool, Samia Razaq, Maham Javaid, Beenish Fatima, and Kentaro Toyama. 2017. Maternal Complications: Nuances in Mobile Interventions for Maternal Health in Urban Pakistan. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development (ICTD '17). ACM, 3:1--3:12.  ",
      "doi": "10.1145/3136560.3136573"
    },
    {
      "text": "Annette Bauer, Michael Parsonage, Martin Knapp, Valentina Iemmi, and Bayo Adelaja. 2014. The costs of perinatal mental health problems. (2014).",
      "doi": ""
    },
    {
      "text": "Daniel J Beal and Howard M Weiss. 2003. Methods of ecological momentary assessment in organizational research. Organizational Research Methods 6, 4 (2003), 440--464.",
      "doi": ""
    },
    {
      "text": "Niels Van Berkel, Denzil Ferreira, and Vassilis Kostakos. 2017. The Experience Sampling Method on Mobile Devices. ACM Computing Surveys (CSUR) 50, 6 (2017), 93.  ",
      "doi": "10.1145/3123988"
    },
    {
      "text": "Boots Family Trust. 2013. Perinatal Mental Health: Experiences of Women and Health Professionals. Boots Family Trust, London (2013).",
      "doi": ""
    },
    {
      "text": "Elizabeth C Braithwaite, Susannah E Murphy, and Paul G Ramchandani. 2016. Effects of prenatal depressive symptoms on maternal and infant cortisol reactivity. Archives of women's mental health 19, 4 (2016), 581--590.",
      "doi": ""
    },
    {
      "text": "Joan E Broderick, Joseph E Schwartz, Gregory Vikingstad, Michelle Pribbernow, Steven Grossman, and Arthur A Stone. 2008. The accuracy of pain and fatigue items across different reporting periods. Pain 139, 1 (2008), 146--157.",
      "doi": ""
    },
    {
      "text": "Chris M Buonocore, Rosemary A Rocchio, Alfonso Roman, Christine E King, and Majid Sarrafzadeh. 2017. Wireless sensor-dependent ecological momentary assessment for pediatric asthma mhealth applications. In Proceedings of the Second IEEE/ACM International Conference on Connected Health: Applications, Systems and Engineering Technologies. IEEE Press, 137--146.  ",
      "doi": "10.1109/CHASE.2017.72"
    },
    {
      "text": "Nancy Byatt, Kathleen Biebel, Liz Friedman, Gifty Debordes-Jackson, Douglas Ziedonis, and Lori Pbert. 2013. Patient's views on depression care in obstetric settings: how do they compare to the views of perinatal health care professionals? General hospital psychiatry 35, 6 (2013), 598-- 604.",
      "doi": ""
    },
    {
      "text": "Mauro Cherubini and Nuria Oliver. 2009. A refined experience sampling method to capture mobile user experience. International Workshop of Mobile User Experience Research, CHI'2009 (2009).",
      "doi": ""
    },
    {
      "text": "Tamlin Conner Christensen, Lisa Feldman Barrett, Eliza Bliss-Moreau, Kirsten Lebo, and Cynthia Kaschub. 2003. A practical guide to experience-sampling procedures. Journal of Happiness Studies 4, 1 (2003), 53--78.",
      "doi": ""
    },
    {
      "text": "Tamlin S Conner and Lisa Feldman Barrett. 2012. Trends in ambulatory self-report: the role of momentary experience in psychosomatic medicine. Psychosomatic medicine 74, 4 (2012), 327.",
      "doi": ""
    },
    {
      "text": "John L Cox, Jeni M Holden, and Ruth Sagovsky. 1987. Detection of postnatal depression. Development of the 10-item Edinburgh Postnatal Depression Scale. The British journal of psychiatry 150, 6 (1987), 782-- 786.",
      "doi": ""
    },
    {
      "text": "Kevin Doherty, Marguerite Barry, José Marcano-Belisario, Bérenger Arnaud, Cecily Morrison, Josip Car, and Gavin Doherty. 2018. A Mobile App for the Self-Report of Psychological Well-Being During Pregnancy (BrightSelf): Qualitative Design Study. JMIR mental health 5, 4 (2018).",
      "doi": ""
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. The construal of experience in HCI: Understanding self-reports. International Journal of HumanComputer Studies 110 (2018), 63--74.  ",
      "doi": "10.1016/j.ijhcs.2017.10.006"
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. Engagement in HCI: Conception, Theory and Measurement. ACM Computing Surveys (CSUR) 51, 5 (2018), 99:1--99:39.  ",
      "doi": "10.1145/3234149"
    },
    {
      "text": "Stephane Dufau, Jon Andoni Duñabeitia, Carmen Moret-Tatay, Aileen McGonigal, David Peeters, F-Xavier Alario, David A Balota, Marc Brysbaert, Manuel Carreiras, Ludovic Ferrand, et al. 2011. Smart phone, smart science: how the use of smartphones can revolutionize research in cognitive science. PloS one 6, 9 (2011).",
      "doi": ""
    },
    {
      "text": "Ulrich W Ebner-Priemer and Timothy J Trull. 2009. Ecological momentary assessment of mood disorders and mood dysregulation. Psychological Assessment 21, 4 (2009), 463.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Nicole B Lee, Jennifer H Kang, Elena Agapie, Jessica Schroeder, Laura R Pina, James Fogarty, Julie A Kientz, and Sean Munson. 2017. Examining Menstrual Tracking to Inform the Design of Personal Informatics Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6876--6888.  ",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Yuan Gao, Xinying Li, Yu-Hsuan Lin, Xin Liu, and Lin Pang. 2014. Nuwa: Enhancing the Pregnancy Experience for Expectant Parents. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 257--262.  ",
      "doi": "10.1145/2559206.2580928"
    },
    {
      "text": "Janice H Goodman. 2009. Women's attitudes, preferences, and perceived barriers to treatment for perinatal depression. Birth 36, 1 (2009), 60--69.",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating Support Seeking from Peers for Pregnancy in Online Health Communities. Proc. ACM Hum.-Comput. Interact. 1, CSCW (2017), 50:1--50:19.  ",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Gillian R Hayes, Karen G Cheng, Sen H Hirano, Karen P Tang, Marni S Nagel, and Dianne E Baker. 2014. Estrellita: A mobile capture and access tool for the support of preterm infants and their caregivers. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 3 (2014), 19.  ",
      "doi": "10.1145/2617574"
    },
    {
      "text": "Joel M Hektner, Jennifer A Schmidt, and Mihaly Csikszentmihalyi. 2007. Experience sampling method: Measuring the quality of everyday life. Sage.",
      "doi": ""
    },
    {
      "text": "Jonathan Heron, Thomas G O'Connor, Jonathan Evans, Jean Golding, Vivette Glover, ALSPAC Study Team, et al. 2004. The course of anxiety and depression through pregnancy and the postpartum in a community sample. Journal of affective disorders 80, 1 (2004), 65--73.",
      "doi": ""
    },
    {
      "text": "Alexandra Hillman. 2014. 'Why must I wait?' The performance of legitimacy in a hospital emergency department. Sociology of health & illness 36, 4 (2014), 485--499.",
      "doi": ""
    },
    {
      "text": "Stefan E Hormuth. 1986. The sampling of experiences in situ. Journal of personality 54, 1 (1986), 262--293.",
      "doi": ""
    },
    {
      "text": "Louise M Howard, Emma Molyneaux, Cindy-Lee Dennis, Tamsen Rochat, Alan Stein, and Jeannette Milgrom. 2014. Non-psychotic mental disorders in the perinatal period. The Lancet 384, 9956 (2014), 1775--1788.",
      "doi": ""
    },
    {
      "text": "Mary Hui, Christine Ly, and Carman Neustaedter. 2012. MammiBelli: Sharing Baby Activity Levels Between Expectant Mothers and Their Intimate Social Groups. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1649-- 1654.  ",
      "doi": "10.1145/2212776.2223687"
    },
    {
      "text": "Matthew A Killingsworth and Daniel T Gilbert. 2010. A wandering mind is an unhappy mind. Science 330, 6006 (2010), 932--932.",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Eunyoung Heo, Hyunjeong Lee, Sookyoung Ji, Jueun Choi, Jeong-Whun Kim, Joongseek Lee, and Sooyoung Yoo. 2017. Prescribing 10,000 steps like aspirin: designing a novel interface for datadriven medical consultations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5787--5799.  ",
      "doi": "10.1145/3025453.3025570"
    },
    {
      "text": "Dawn Kingston, Marie-Paule Austin, Maureen Heaman, Sheila McDonald, Gerri Lasiuk, Wendy Sword, Rebecca Giallo, Kathy Hegadoren, Lydia Vermeyden, Sander Veldhuyzen van Zanten, et al. 2015. Barriers and facilitators of mental health screening in pregnancy. Journal of affective disorders 186 (2015), 350--357.",
      "doi": ""
    },
    {
      "text": "Michael T Kinsella and Catherine Monk. 2009. Impact of maternal stress, depression & anxiety on fetal neurobehavioral development. Clinical obstetrics and gynecology 52, 3 (2009), 425.",
      "doi": ""
    },
    {
      "text": "Marian Knight, Derek Tuffnell, Sara Kenyon, Judy Shakespeare, Ron Gray, and Jennifer J Kurinczuk. 2016. Saving lives, improving mothers care: Surveillance of maternal deaths in the UK 2012--14 and lessons learned to inform maternity care from the UK and Ireland. Confidential enquiries into maternal deaths and morbidity 2009--14. Oxford: National Perinatal Epidemiology Unit, University of Oxford (2016).",
      "doi": ""
    },
    {
      "text": "Andreas Koop. 2002. Lessons learned from 16 years usage of mobile computers in clinical trials. Mobile Computing in Medicine 15 (2002), 9--24. ",
      "doi": "10.5555/648053.746339"
    },
    {
      "text": "Jennifer L Kraschnewski, Cynthia H Chuang, Erika S Poole, Tamara Peyton, Ian Blubaugh, Jaimey Pauli, Alyssa Feher, and Madhu Reddy. 2014. Paging \"Dr. Google\": does technology fill the gap created by the prenatal care visit structure? Qualitative focus group study with pregnant women. Journal of Medical Internet Research 16, 6 (2014).",
      "doi": ""
    },
    {
      "text": "Giordano Lanzola, MG Ginardi, A Mazzanti, and Silvana Quaglini. 2014. Gquest: Modeling patient questionnaires and administering them through a mobile platform application. Computer methods and programs in biomedicine 117, 2 (2014), 277--291.  ",
      "doi": "10.1016/j.cmpb.2014.07.010"
    },
    {
      "text": "Jakob Eg Larsen, Thomas Blomseth Christiansen, and Kasper Eskelund. 2017. Fostering bilateral patient-clinician engagement in active selftracking of subjective experience. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, 427--430.  ",
      "doi": "10.1145/3154862.3154918"
    },
    {
      "text": "David Lazer, Alex Sandy Pentland, Lada Adamic, Sinan Aral, Albert Laszlo Barabasi, Devon Brewer, Nicholas Christakis, Noshir Contractor, James Fowler, Myron Gutmann, et al. 2009. Life in the network: the coming age of computational social science. Science (New York, NY) 323, 5915 (2009), 721.",
      "doi": ""
    },
    {
      "text": "Tzu-I Lee, Yih-Harn Chiang, Jiayi Guo, Mu-Tsz Chen, and Yue Chen. 2016. Dot-it: Managing Nausea and Vomiting for A Peaceful Pregnancy with Personal Pattern Exploration. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 20--25.  ",
      "doi": "10.1145/2851581.2890631"
    },
    {
      "text": "Bronwyn Leigh and Jeannette Milgrom. 2008. Risk factors for antenatal depression, postnatal depression and parenting stress. BMC psychiatry 8, 1 (2008), 24.",
      "doi": ""
    },
    {
      "text": "Juan F Maestre, Haley MacLeod, Ciabhan L Connelly, Julia C Dunbar, Jordan Beck, Katie A Siek, and Patrick C Shih. 2018. Defining through expansion: conducting asynchronous remote communities (arc) research with stigmatized groups. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 557.  ",
      "doi": "10.1145/3173574.3174131"
    },
    {
      "text": "José Salvador Marcano-Belisario, Kevin Doherty, John O'Donoghue, Paul Ramchandani, Azeem Majeed, Gavin Doherty, Cecily Morrison, and Josip Car. 2017. A bespoke mobile application for the longitudinal assessment of depression and mood during pregnancy: protocol of a feasibility study. BMJ Open 7, 5 (2017).",
      "doi": ""
    },
    {
      "text": "Jurgen Margraf, C Barr Taylor, Anke Ehlers, Walton T Roth, and W Stewart Agras. 1987. Panic Attacks in the Natural Environment. The Journal of Nervous and Mental Disease 175, 9 (1987), 558--565.",
      "doi": ""
    },
    {
      "text": "Mark Matthews and Gavin Doherty. 2011. In the mood: engaging teenagers in psychotherapy using mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2947--2956.  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Mark Matthews, Stephen Voida, Saeed Abdullah, Gavin Doherty, Tanzeem Choudhury, Sangha Im, and Geri Gay. 2015. In Situ Design for Mental Illness: Considering the Pathology of Bipolar Disorder in mHealth Design. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 86--97.  ",
      "doi": "10.1145/2785830.2785866"
    },
    {
      "text": "Helena M Mentis, Anita Komlodi, Katrina Schrader, Michael Phipps, Ann Gruber-Baldini, Karen Yarbrough, and Lisa Shulman. 2017. Crafting a view of self-tracking data in the clinical visit. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5800--5812.  ",
      "doi": "10.1145/3025453.3025589"
    },
    {
      "text": "Robin Mermelstein, Donald Hedeker, Brian Flay, and Saul Shiffman. 2007. Real-time data capture and adolescent cigarette smoking: moods and smoking. The Science of Real-Time Data Capture: Self-Report in Health Research (2007), 117--135.",
      "doi": ""
    },
    {
      "text": "Jochen Meyer, Daniel Epstein, Parisa Eslambolchilar, Judy Kay, and Lie Ming Tang. 2018. A Short Workshop on Next Steps Towards Long Term Self Tracking. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, W05:1--W05:8.  ",
      "doi": "10.1145/3170427.3170605"
    },
    {
      "text": "Geoffrey Miller. 2012. The smartphone psychology manifesto. Perspectives on Psychological Science 7, 3 (2012), 221--237.",
      "doi": ""
    },
    {
      "text": "Donna Moore, Susan Ayers, and Nicholas Drey. 2016. A Thematic Analysis of Stigma and Disclosure for Perinatal Depression on an Online Forum. JMIR Mental Health 3, 2 (19 May 2016).",
      "doi": ""
    },
    {
      "text": "Sriraam Natarajan, Annu Prabhakar, Nandini Ramanan, Anna Baglione, Kay Connelly, and Katie Siek. 2017. Boosting for postpartum depression prediction. In Proceedings of the Second IEEE/ACM International Conference on Connected Health: Applications, Systems and Engineering Technologies. IEEE Press, 232--240.  ",
      "doi": "10.1109/CHASE.2017.82"
    },
    {
      "text": "Mikael Palmblad and Brian Tiplady. 2004. Electronic diaries and questionnaires: designing user interfaces that are easy for all patients to use. Quality of Life research 13, 7 (2004), 1199--1207.",
      "doi": ""
    },
    {
      "text": "Gaurav Paruthi, Shriti Raj, Ankita Gupta, Chuan-Che Huang, Yung-Ju Chang, and Mark W Newman. 2017. HEED: situated and distributed interactive devices for self-reporting. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. ACM, 181--184.  ",
      "doi": "10.1145/3123024.3123162"
    },
    {
      "text": "Rebecca M Pearson, Jonathan Evans, Daphne Kounali, Glyn Lewis, Jon Heron, Paul G Ramchandani, Tom G O'Connor, and Alan Stein. 2013. Maternal depression during pregnancy and the postnatal period: risks and possible mechanisms for offspring depression at age 18 years. JAMA psychiatry 70, 12 (2013), 1312--1319.",
      "doi": ""
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1429--1438.  ",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Tamara Peyton, Erika Poole, Madhu Reddy, Jennifer Kraschnewski, and Cynthia Chuang. 2014. \"Every Pregnancy is Different\": Designing mHealth for the Pregnancy Ecology. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 577--586.  ",
      "doi": "10.1145/2598510.2598572"
    },
    {
      "text": "Tamara Peyton, Erika Poole, Madhu Reddy, Jennifer Kraschnewski, and Cynthia Chuang. 2014. Information, Sharing and Support in Pregnancy: Addressing Needs for mHealth Design. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW Companion '14). ACM, New York, NY, USA, 213--216.  ",
      "doi": "10.1145/2556420.2556489"
    },
    {
      "text": "Annu Sible Prabhakar, Lucia Guerra-Reyes, Anne Effron, Vanessa M. Kleinschmidt, Maggie Driscoll, Charles Peters, Vanessa Pereira, Majdah Alshehri, Tom Ongwere, and Katie A. Siek. 2017. \"Let Me Know if You Need Anything\": Support Realities of New Mothers. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '17). ACM, New York, NY, USA, 31--40.  ",
      "doi": "10.1145/3154862.3154863"
    },
    {
      "text": "NHS Improving Quality. 2015. Improving Access to Perinatal Mental Health Services in England - A Review. (2015).",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Meredith Philyaw-Kotov, Jinseok Lee, Anthony Mansour, Laura Dent, Xiaolei Wang, Rebecca Cunningham, Erin Bonar, Inbal Nahum-Shani, Predrag Klasnja, et al. 2017. SARA: a mobile app to engage users in health data collection. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. ACM, 781--789.  ",
      "doi": "10.1145/3123024.3125611"
    },
    {
      "text": "Horst WJ Rittel and Melvin M Webber. 1973. Dilemmas in a general theory of planning. Policy sciences 4, 2 (1973), 155--169.",
      "doi": ""
    },
    {
      "text": "Umaira Uzma Sajjad and Suleman Shahid. 2016. Baby+: A Mobile Application to Support Pregnant Women in Pakistan. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, New York, NY, USA, 667--674.  ",
      "doi": "10.1145/2957265.2961856"
    },
    {
      "text": "Kavous Salehzadeh Niksirat, Sayan Sarcar, Huatong Sun, Effie LC Law, Torkil Clemmensen, Jeffrey Bardzell, Antti Oulasvirta, Chaklam Silpasuwanchai, Ann Light, and Xiangshi Ren. 2018. Approaching Engagement towards Human-Engaged Computing. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, SIG14.  ",
      "doi": "10.1145/3170427.3185364"
    },
    {
      "text": "Philip S Santangelo, Ulrich W Ebner-Priemer, and Timothy J Trull. 2013. Experience Sampling Methods in Clinical Psychology. The Oxford Handbook of Research Strategies for Clinical Psychology (2013), 188.",
      "doi": ""
    },
    {
      "text": "Christie Napa Scollon, Chu-Kim Prieto, and Ed Diener. 2009. Experience sampling: promises and pitfalls, strength and weaknesses. In Assessing well-being. Springer, 157--180.",
      "doi": ""
    },
    {
      "text": "Sandra Servia-Rodríguez, Kiran K Rachuri, Cecilia Mascolo, Peter J Rentfrow, Neal Lathia, and Gillian M Sandstrom. 2017. Mobile sensing at the service of mental well-being: a large-scale longitudinal study. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 103-- 112.  ",
      "doi": "10.1145/3038912.3052618"
    },
    {
      "text": "Arshi Shaikh and Carol Kauppi. 2015. Postpartum depression: Deconstructing the label through a social constructionist lens. Social Work in Mental Health 13, 5 (2015), 459--480.",
      "doi": ""
    },
    {
      "text": "Saul Shiffman, Arthur A Stone, and Michael R Hufford. 2008. Ecological momentary assessment. Annu. Rev. Clin. Psychol. 4 (2008), 1--32.",
      "doi": ""
    },
    {
      "text": "Wally Smith, Bernd Ploderer, Greg Wadley, Sarah Webber, and Ron Borland. 2017. Trajectories of engagement and disengagement with a story-based smoking cessation app. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3045--3056.  ",
      "doi": "10.1145/3025453.3026054"
    },
    {
      "text": "Wally Smith, Greg Wadley, Oliver Daly, Marianne Webb, Jo Hughson, John Hajek, Anna Parker, Robyn Woodward-Kron, and David Story. 2017. Designing an app for pregnancy care for a culturally and linguistically diverse community. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. ACM, 337--346.  ",
      "doi": "10.1145/3152771.3152807"
    },
    {
      "text": "Marika B Solhan, Timothy J Trull, Seungmin Jahng, and Phillip K Wood. 2009. Clinical assessment of affective instability: comparing EMA indices, questionnaire reports, and retrospective recall. Psychological Assessment 21, 3 (2009), 425.",
      "doi": ""
    },
    {
      "text": "Donna E Stewart. 2011. Depression during pregnancy. New England Journal of Medicine 365, 17 (2011), 1605--1611.",
      "doi": ""
    },
    {
      "text": "Arthur A Stone, Joseph E Schwartz, John M Neale, Saul Shiffman, Christine A Marco, Mary Hickcox, Jean Paty, Laura S Porter, and Laura J Cruise. 1998. A comparison of coping assessed by ecological momentary assessment and retrospective recall. Journal of personality and social psychology 74, 6 (1998), 1670.",
      "doi": ""
    },
    {
      "text": "Hyewon Suh, John R Porter, Alexis Hiniker, and Julie A Kientz. 2014. @BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2279--2288.  ",
      "doi": "10.1145/2556288.2557386"
    },
    {
      "text": "Sara Thurgood, Daniel M Avery, and Lloyda Williamson. 2009. Postpartum depression (PPD). American Journal of Clinical Medicine 6, 2 (2009), 17--22.",
      "doi": ""
    },
    {
      "text": "Phil Topham, Praminda Caleb-Solly, Paul Matthews, Andy Farmer, and Chris Mash. 2015. Mental Health App Design: A Journey From Concept to Completion. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, 582--591.  ",
      "doi": "10.1145/2786567.2787136"
    },
    {
      "text": "John Torous, Steven Richard Chan, Shih Yee-Marie Tan, Jacob Behrens, Ian Mathew, Erich J Conrad, Ladson Hinton, Peter Yellowlees, and Matcheri Keshavan. 2014. Patient smartphone ownership and interest in mobile apps to monitor symptoms of mental health conditions: a survey in four geographically distinct psychiatric clinics. JMIR Mental Health 1, 1 (2014).",
      "doi": ""
    },
    {
      "text": "Nadia Tripp, Kirsten Hainey, Anthony Liu, Alison Poulton, Michael Peek, Jinman Kim, and Ralph Nanan. 2014. An emerging model of maternity care: smartphone, midwife, doctor? Women and Birth 27, 1 (2014), 64--67.",
      "doi": ""
    },
    {
      "text": "Niels Van Berkel, Jorge Goncalves, Simo Hosio, and Vassilis Kostakos. 2017. Gamification of mobile experience sampling improves data quality and quantity. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 107.  ",
      "doi": "10.1145/3130972"
    },
    {
      "text": "Julio Vega, Samuel Couth, Ellen Poliakoff, Sonja Kotz, Matthew Sullivan, Caroline Jay, Markel Vigo, and Simon Harper. 2018. Back to Analogue: Self-Reporting for Parkinson's Disease. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 74.  ",
      "doi": "10.1145/3173574.3173648"
    },
    {
      "text": "Chelsea-Joy Wardle, Mitchell Green, Christine Wanjiru Mburu, and Melissa Densmore. 2018. Exploring Co-design with Breastfeeding Mothers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 482.  ",
      "doi": "10.1145/3173574.3174056"
    },
    {
      "text": "Max S. Wenger, Jarad Bell, Peter McEvoy, Cherie Yamaguchi, and Auriana Shokrpour. 2014. Bloom: Fostering Healthy and Peaceful Pregnancies with Personal Analytics. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 245--250.  ",
      "doi": "10.1145/2559206.2580935"
    },
    {
      "text": "M Wichers, CJP Simons, IMA Kramer, JA Hartmann, C Lothmann, I Myin-Germeys, AL van Bemmel, F Peeters, Ph Delespaul, and J van Os. 2011. Momentary assessment technology as a tool to help patients with depression help themselves. Acta Psychiatrica Scandinavica 124, 4 (2011), 262--272.",
      "doi": ""
    },
    {
      "text": "Anouk Wierckx, Suleman Shahid, and Abdullah Al Mahmud. 2014. Babywijzer: An Application to Support Women During Their Pregnancy. In Proceedings of the Extended Abstracts of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1333--1338.  ",
      "doi": "10.1145/2559206.2581179"
    },
    {
      "text": "Tracy K Witte, Kathleen K Fitzpatrick, Thomas E Joiner, and Norman Bradley Schmidt. 2005. Variability in suicidal ideation: A better predictor of suicide attempts than intensity or duration of ideation? Journal of Affective Disorders 88, 2 (2005), 131--136.",
      "doi": ""
    }
  ]
}