{
  "doi": "10.1145/3290605.3300516",
  "title": "Infrastructuring the Imaginary: How Sea-Level Rise Comes to Matter in the San Francisco Bay Area",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Information infrastructures have become integral components of policy debates related to climate change and sustainability. To better understand this relationship, we studied the tools used to forecast and respond to sea-level rise in the San Francisco Bay Area, where active debates on how to best prepare for this issues are underway and will have important consequences for the future of the region. Drawing on 18 months of qualitative research we argue that competing visions of the problem are intimately intertwined with different elements of information infrastructure and beliefs about the role of data in policymaking. Current infrastructure in the region, far from being a neutral actor in these debates, exhibits an infrastructural bias, privileging some approaches over others. We identify some of the tactics that community organizations deploy to subvert the claims of sea-level rise experts and advance their own perspective, which prioritizes considerations of justice over technical expertise.",
  "tags": [
    "infrastructure",
    "crisis informatics",
    "climate change",
    "science and technology studies",
    "environment",
    "civic technology"
  ],
  "authors": [
    {
      "name": "Robert Soden",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658704911",
      "orcid": "0000-0003-2657-0485"
    },
    {
      "name": "Nate Kauffman",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366300",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abdelnour-Nocera, J., Clemmensen, T. and Kurosu, M., 2013. Reframing HCI through local and indigenous perspectives. International Journal of HumanComputer Interaction, 29(4), pp.201--204.",
      "doi": ""
    },
    {
      "text": "Ames, M.G., 2015. Charismatic technology. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (pp. 109--120). Aarhus University Press.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Aoki, P., Woodruff, A., Yellapragada, B. and Willett, W., 2017, May. Environmental Protection and Agency: Motivations, Capacity, and Goals in Participatory Sensing. In CHI (pp. 3138--3150).  ",
      "doi": "10.1145/3025453.3025667"
    },
    {
      "text": "Bagwell, B., 1982. Oakland: The story of a city. Presidio Press.",
      "doi": ""
    },
    {
      "text": "Baker, K.S., Bowker, G.C. and Karasti, H., 2002, May. Designing an infrastructure for heterogeneity in ecosystem data, collaborators and organizations. In Proceedings of the 2002 annual national conference on Digital government research (pp. 1--4). Digital Government Society of North America. ",
      "doi": "10.5555/1123098.1123120"
    },
    {
      "text": "Bay Conservation and Development Corporation (BCDC). 2011. Living with a rising bay: Vulnerability and adaptation in San Francisco Bay and on its shoreline. BCDC.",
      "doi": ""
    },
    {
      "text": "Bopp, C., Harmon, E. and Voida, A., 2017, May. Disempowered by data: Nonprofits, social enterprises, and the consequences of data-driven work. In CHI Conference (pp. 3608--3619).  ",
      "doi": "10.1145/3025453.3025694"
    },
    {
      "text": "Bowker, G. 2014. The Infrastructural Imagination. In: Mongili, A. and Pellegrino, G. eds., 2014. Information infrastructure (s): Boundaries, ecologies, multiplicity. Cambridge Scholars Publishing.",
      "doi": ""
    },
    {
      "text": "Burrito Justice. 2012. Islands of Justice. Viewed September 7, 2018. https://burritojustice.com/2012/03/20/san-francisco-archipelago",
      "doi": ""
    },
    {
      "text": "Chen, J., 2015. Computing within limits and ICTD. First Monday, 20(8).",
      "doi": ""
    },
    {
      "text": "Crawford, K., Gray, M.L. and Miltner, K., 2014. Big Data| critiquing Big Data: Politics, ethics, epistemology| special section introduction. International Journal of Communication, 8, p.10.",
      "doi": ""
    },
    {
      "text": "Daily, G.C., Polasky, S., Goldstein, J., Kareiva, P.M., Mooney, H.A., Pejchar, L., Ricketts, T.H., Salzman, J. and Shallenberger, R., 2009. Ecosystem services in decision making: time to deliver. Frontiers in Ecology and the Environment, 7(1), pp.21--28.",
      "doi": ""
    },
    {
      "text": "Dawson, A., 2010. Climate justice: the emerging movement against green capitalism. South Atlantic Quarterly, 109(2), pp.313--338.",
      "doi": ""
    },
    {
      "text": "Dillon, L., 2018. The Breathers of Bayview Hill: Redevelopment and Environmental Justice in Southeast San Francisco. Hastings Environmental Law Journal, 24(2), p.227.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Lukens, J., Lodato, T., Jenkins, T. and Kim, T., 2014, April. Making public things: how HCI design can express matters of concern. In SIGCHI (pp. 2397--2406).  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Doehring, C., Beagle, J., Lowe, J., Grossinger, R., Salomon, M., Kauhanen, P., Nakata, S., Askevold, R. and Bezalel, S., 2016. San francisco bay shore inventory: mapping for sea level rise planning.",
      "doi": ""
    },
    {
      "text": "Dombrowski, L., Harmon, E. and Fox, S., 2016, June. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (pp. 656--671).  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Donaldson, A., Lane, S., Ward, N. and Whatmore, S., 2013. Overflowing with issues: following the political trajectories of flooding. Environment and Planning C: Government and Policy, 31(4), pp.603--618.",
      "doi": ""
    },
    {
      "text": "Dutta, P., Aoki, P.M., Kumar, N., Mainwaring, A., Myers, C., Willett, W. and Woodruff, A., 2009, November. Common sense: participatory urban sensing using a network of handheld air quality monitors. In Proceedings of the 7th ACM conference on embedded networked sensor systems (pp. 349--350).  ",
      "doi": "10.1145/1644038.1644095"
    },
    {
      "text": "Edwards, P.N., 2010. A vast machine: Computer models, climate data, and the politics of global warming. Mit Press. ",
      "doi": "10.5555/1805940"
    },
    {
      "text": "Gandy, M., 2014. The fabric of space: Water, modernity, and the urban imagination. MIT Press.",
      "doi": ""
    },
    {
      "text": "Fortun, K., 2004. From Bhopal to the informating of environmentalism: risk communication in historical perspective. Osiris, 19, pp.283--296.",
      "doi": ""
    },
    {
      "text": "Gitelman, L. ed., 2013. Raw data is an oxymoron. MIT Press.",
      "doi": ""
    },
    {
      "text": "Griggs, G., 2017. Coasts in Crisis: A Global Challenge. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Haraway, D.J., 1985. A manifesto for cyborgs: Science, technology, and socialist feminism in the 1980s (pp. 173--204). San Francisco, CA: Center for Social Research and Education.",
      "doi": ""
    },
    {
      "text": "Hill, K., 2015. Coastal infrastructure: a typology for the next century of adaptation to sea-level rise. Frontiers in Ecology and the Environment, 13(9), pp.468--476.",
      "doi": ""
    },
    {
      "text": "Jack, M., Chen, J. and Jackson, S.J., 2017, May. Infrastructure as Creative Action: Online Buying, Selling, and Delivery in Phnom Penh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (pp. 65116522). ACM.  ",
      "doi": "10.1145/3025453.3025889"
    },
    {
      "text": "Jasanoff, S. and Kim, S.H. eds., 2015. Dreamscapes of modernity: Sociotechnical imaginaries and the fabrication of power. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Johnson, M.S., 1994. The Second Gold Rush: Oakland and the East Bay in World War II. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Latour, B., 2012. We have never been modern. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C.A.. and DiSalvo, C., 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science, 43(2), pp.241--264.",
      "doi": ""
    },
    {
      "text": "Le Dantec, C.A. and Fox, S., 2015. Strangers at the gate: Gaining access, building rapport, and co-constructing community-based research. In CSCW (pp. 1348--1358).  ",
      "doi": "10.1145/2675133.2675147"
    },
    {
      "text": "Le Dantec, C.A., Asad, M., Misra, A. and Watkins, K.E., 2015. Planning with crowdsourced data: rhetoric and representation in transportation planning. In CSCW (pp. 1717--1727).  ",
      "doi": "10.1145/2675133.2675212"
    },
    {
      "text": "Lee, C.P., Dourish, P. and Mark, G., 2006. The human infrastructure of cyberinfrastructure. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work (pp. 483--492).  ",
      "doi": "10.1145/1180875.1180950"
    },
    {
      "text": "Li, T.M., 2007. The will to improve: Governmentality, development, and the practice of politics. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Light, A., Shklovski, I. and Powell, A., 2017, May. Design for existential crisis. In CHI Conference Extended Abstracts on Human Factors in Computing Systems (pp. 722--734).  ",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Lubell, M., 2017. The Governance Gap: Climate Adaptation and Sea-Level Rise in the San Francisco Bay Area. University of California, Davis.",
      "doi": ""
    },
    {
      "text": "Marres, N., 2007. The issues deserve more credit: Pragmatist contributions to the study of public involvement in controversy. Social studies of science, 37(5), pp.759--780.",
      "doi": ""
    },
    {
      "text": "McPhee, J., 2011. The control of nature. Farrar, Straus and Giroux.",
      "doi": ""
    },
    {
      "text": "Murphy, M., 2006. Sick building syndrome and the problem of uncertainty: Environmental politics, technoscience, and women workers. Duke.",
      "doi": ""
    },
    {
      "text": "Pearce, D., 1998. Cost benefit analysis and environmental policy. Oxford review of economic policy, 14(4), pp.84--100.",
      "doi": ""
    },
    {
      "text": "Peet, R. and Watts, M., 2004. Liberation ecologies: Environment, development and social movements. Routledge.",
      "doi": ""
    },
    {
      "text": "Pine, K.H. and Liboiron, M., 2015.. The politics of measurement and action. In CHI (pp. 3147--3156)..  ",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Pipek, V. and Wulf, V., 2009. Infrastructuring: Toward an integrated perspective on the design and use of information technology. Journal of the Association for Information Systems, 10(5), p.1.",
      "doi": ""
    },
    {
      "text": "Shirzaei, M. and Bürgmann, R., 2018. Global climate change and local land subsidence exacerbate inundation risk to the San Francisco Bay Area. Science advances, 4(3), p.eaap9234.",
      "doi": ""
    },
    {
      "text": "Soden, R. and Palen, L., 2016. Infrastructure in the wild: What mapping in post-earthquake Nepal reveals about infrastructural emergence. In CHI (pp. 2796--2807).  ",
      "doi": "10.1145/2858036.2858545"
    },
    {
      "text": "Soden, R. and Palen, L., 2018. Informating Crisis: Expanding Critical Perspectives in Crisis Informatics. In CSCW. 162...  ",
      "doi": "10.1145/3274431"
    },
    {
      "text": "Soden, R., Sprain, L. and Palen, L., 2017, May. Thin Grey Lines: Confrontations With Risk on Colorado's Front Range. In CHI (pp. 2042--2053).  ",
      "doi": "10.1145/3025453.3025983"
    },
    {
      "text": "Taylor, A.S., Lindley, S., Regan, T., Sweeney, D., Vlachokyriakos, V., Grainger, L. and Lingel, J., 2015, April. Data-in-place: Thinking through the relations between data and community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (pp. 2863--2872). ACM.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Whatmore, S.J. and Landström, C., 2011. Flood apprentices: An exercise in making things public. Economy and society, 40(4), pp.582--610.",
      "doi": ""
    },
    {
      "text": "Wilson, M.W., 2011. Data matter (s): legitimacy, coding, and qualificationsof-life. Environment and Planning D: Society and Space, 29(5), pp.857--872.",
      "doi": ""
    }
  ]
}