{
  "doi": "10.1145/3290605.3300702",
  "title": "People Who Can Take It: How Women Wikipedians Negotiate and Navigate Safety",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Wikipedia is one of the most successful online communities in history, yet it struggles to attract and retain women editors-a phenomenon known as the gender gap. We investigate this gap by focusing on the voices of experienced women Wikipedians. In this interview-based study (N=25), we identify a core theme among these voices: safety. We reveal how our participants perceive safety within their community, how they manage their safety both conceptually and physically, and how they act on this understanding to create safe spaces on and off Wikipedia. Our analysis shows Wikipedia functions as both a multidimensional and porous space encompassing a spectrum of safety. Navigating this space requires these women to employ sophisticated tactics related to identity management, boundary management, and emotion work. We conclude with a set of provocations to spur the design of future online environments that encourage equity, inclusivity, and safety for historically marginalized users.",
  "authors": [
    {
      "name": "Amanda Menking",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658690398",
      "orcid": "missing"
    },
    {
      "name": "Ingrid Erickson",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444599030",
      "orcid": "missing"
    },
    {
      "name": "Wanda Pratt",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100298117/rel-imgonly/img_2793-4.jpg",
      "acmid": "81100298117",
      "orcid": "0000-0003-4035-0198"
    }
  ],
  "references": [
    {
      "text": "Sigal Alon and Marta Tienda. 2007. Diversity, opportunity, and the shifting meritocracy in higher education. American Sociological Review 72(4), 487--511.",
      "doi": ""
    },
    {
      "text": "Inoka Amarasekara and Will J. Grant. 2018. Exploring the YouTube science communication gender gap: A sentiment analysis. Public Understanding of Science. CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK A. Menking et al.",
      "doi": ""
    },
    {
      "text": "Monica Anderson. 2015, August 28. Men catch up with women on overall social media use. Pew Research Center. Retrieved from http://www.pewresearch.org/fact-tank/2015/08/28/men-catch-upwith-women-on-overall-social-media-use/",
      "doi": ""
    },
    {
      "text": "Judd Antin, Raymond Yee, Coye Cheshire, and Oded Nov. 2011. Gender differences in Wikipedia editing. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, New York, NY, USA, 11--14.  ",
      "doi": "10.1145/2038558.2038561"
    },
    {
      "text": "Shirley Ardener. 1993. Ground rules and social maps for women. In Women and Space: Ground Rules and Social Maps, ed. S. Ardener, 130. Oxford: Berg.",
      "doi": ""
    },
    {
      "text": "Peter L. Berger and Thomas Luckmann. 1991. The Social Construction of Reality: A Treatise in the Sociology of Knowledge. 10th edition. Penguin UK.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. Proc. ACM Hum.Comput. Interact. 1, CSCW, Article 24 (December 2017), 19 pages.  ",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Susan L. Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: Transformation of participation in a collaborative online encyclopedia. In Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work (GROUP '05). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Joyce Cheney. 1985. Ed. Lesbian Lands. Word Weaver.",
      "doi": ""
    },
    {
      "text": "Justin Cheng, Michael Bernstein, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2017. Anyone Can Become a Troll: Causes of Trolling Behavior in Online Discussions. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 12171230.  ",
      "doi": "10.1145/2998181.2998213"
    },
    {
      "text": "Susan Chira and Catrin Einhorn. 2017, December 19. How tough is it to change a culture of harassment? Ask women at Ford. The New York Times. Retrieved from https://www.nytimes.com/interactive/2017/12/19/us/ford-chicagosexual-harassment.html",
      "doi": ""
    },
    {
      "text": "Boreum Choi, Kira Alexander, Robert E. Kraut, and John M. Levine. 2010. Socialization tactics in Wikipedia and their effects. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 107--116.  ",
      "doi": "10.1145/1718918.1718940"
    },
    {
      "text": "Noam Cohen. 2011, January 30. Define gender gap? Look up Wikipedia's contributor list. The New York Times. Retrieved from http://www.nytimes.com/2011/01/31/business/media/31link.html",
      "doi": ""
    },
    {
      "text": "Benjamin Collier and Julia Bear. 2012. Conflict, criticism, or confidence: An empirical examination of the gender gap in Wikipedia contributions. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 383--392.  ",
      "doi": "10.1145/2145204.2145265"
    },
    {
      "text": "Taylor H. Cox and Stacy Blake. 1991. Managing cultural diversity: Implications for organizational competitiveness. The Executive: 4556.",
      "doi": ""
    },
    {
      "text": "Kimberl© Crenshaw. 2005. Mapping the Margins: Intersectionality, Identity Politics, and Violence against Women of Color (1994). In R. K. Bergen, J. L. Edleson, & C. M. Renzetti, Violence Against Women: Classic Papers (pp. 282--313). Auckland, New Zealand: Pearson Education New Zealand.",
      "doi": ""
    },
    {
      "text": "Julie M. Croff, Randolph D. Hubach, Joseph M. Currin, and Amanda F. Frederick. 2017. Hidden rainbows: Gay bars as safe havens in a socially conservative area since the pulse nightclub massacre. Sexuality Research and Social Policy 14(2): 233--240.",
      "doi": ""
    },
    {
      "text": "Thomas A. DiPrete and Claudia Buchmann. 2013. The Rise of Women: The Growing Gender Gap in Education and What It Means for American Schools. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2017, July 11. Online harassment 2017. Pew Research Center. Retrieved from http://www.pewinternet.org/2017/07/11/online-harassment-2017/",
      "doi": ""
    },
    {
      "text": "Amy Edmondson. 1999. Psychological safety and learning behavior in work teams. Administrative Science Quarterly 44(2): 350--383.",
      "doi": ""
    },
    {
      "text": "Amy Edmondson and Zhike Lei. 2014. Psychological safety: The history, renaissance, and future of an interpersonal construct. Annual Review of Organizational Psychology and Organizational Behavior 1(1): 23--43.",
      "doi": ""
    },
    {
      "text": "Nathan Ensmenger. 2015. Beards, sandals, and other signs of rugged individualism: Masculine culture within the computing professions. Osiris 30(1): 38--65.",
      "doi": ""
    },
    {
      "text": "Melanie Feinberg. 2017. Material Vision. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 604--617.  ",
      "doi": "10.1145/2998181.2998204"
    },
    {
      "text": "Heather Ford and Judy Wajcman. 2017. 'Anyone can edit', not everyone does: Wikipedia's infrastructure and the gender gap. Social Studies of Science 47(4): 511--527.",
      "doi": ""
    },
    {
      "text": "Andrea Forte, Nazanin Andalibi, and Rachel Greenstadt. 2017. Privacy, Anonymity, and Perceived Risk in Open Collaboration: A Study of Tor Users and Wikipedians. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 18001811.  ",
      "doi": "10.1145/2998181.2998273"
    },
    {
      "text": "Mindi D. Foster and E. Micha Tsarfati. 2005. The effects of meritocracy beliefs on women's well-being after first-time gender discrimination. Personality & Social Psychology Bulletin 31(12), 1730--8.",
      "doi": ""
    },
    {
      "text": "Susan Fowler. 2018, April 12. I wrote the Uber memo. This is how to end sexual harassment. Op-Ed. The New York Times. Retrieved from https://www.nytimes.com/2018/04/12/opinion/metoo-susan-fowlerforced-arbitration.html",
      "doi": ""
    },
    {
      "text": "Batya Friedman. 1996. Value-sensitive design. interactions 3, 6 (December 1996), 16--23.  ",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Sue Gardner. 2011, February 19. Nine reasons women don't edit Wikipedia (in their own words). Retrieved from https://suegardner.org/2011/02/19/nine-reasons-why-women-dontedit-wikipedia-in-their-own-words/",
      "doi": ""
    },
    {
      "text": "Gender distribution of bachelor's degrees in the humanities. 2015, April. Humanities Indicators. Retrieved from http://www.humanitiesindicators.org/content/indicatordoc.aspx?i=2 05",
      "doi": ""
    },
    {
      "text": "Anthony Giddens. 1984. The Constitution of Society: Outline of the Theory of Structuration. Berkeley, CA: University of California Press.",
      "doi": ""
    },
    {
      "text": "Peter Glick and Susan T. Fiske. 1996. The ambivalent sexism inventory: Differentiating hostile and benevolent sexism. Journal of Personality and Social Psychology 70(3), 491--512.",
      "doi": ""
    },
    {
      "text": "Ruediger Glott, Philipp Schmidt, and Rishab Ghosh. 2010. Wikipedia survey-overview of results. United Nations University: Collaborative Creativity Group. Retrieved from http://www.ris.org/uploadi/editor/1305050082Wikipedia_Overview_ 15March2010-FINAL.pdf",
      "doi": ""
    },
    {
      "text": "Eduardo Graells-Garrido, Mounia Lalmas, and Filippo Menczer. 2015. First Women, Second Sex: Gender Bias in Wikipedia. In Proceedings of the 26th ACM Conference on Hypertext & Social Media (HT '15). ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/2700171.2791036"
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't bite the newbies: how reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, New York, NY, USA, 163--172. People Who Can Take It CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK  ",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "Harassment Survey. 2015. Wikimedia Foundation. Retrieved from https://upload.wikimedia.org/wikipedia/commons/5/52/Harassment _Survey_2015_-_Results_Report.pdf",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Aaron Shaw. 2015. Mind the skills gap: The role of Internet know-how and gender in differentiated contributions to Wikipedia. Information, Communication & Society 18(4): 424--442.",
      "doi": ""
    },
    {
      "text": "Benjamin Mako Hill and Aaron Shaw. 2013. The Wikipedia gender gap revisited: Characterizing survey response bias with propensity score estimation. PloS one 8(6), e65782.",
      "doi": ""
    },
    {
      "text": "Arlie Russell Hochschild. 1979. Emotion work, feeling rules, and social structure. American Journal of Sociology 85(3): 551--575.",
      "doi": ""
    },
    {
      "text": "William A. Kahn. 1990. Psychological conditions of personal engagement and disengagement at work. Academy of Management Journal. Academy of Management 33(4), 692--724.",
      "doi": ""
    },
    {
      "text": "Adriene Lafrance. 2016, October 13. Is Silicon Valley a meritocracy? The Atlantic. Retrieved from https://www.theatlantic.com/technology/archive/2016/10/is-siliconvalley-a-meritocracy/503948/",
      "doi": ""
    },
    {
      "text": "Shyong (Tony) K. Lam, Anuradha Uduwage, Zhenhua Dong, Shilad Sen, David R. Musicant, Loren Terveen, and John Riedl. 2011. WP:clubhouse?: An exploration of Wikipedia's gender imbalance. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/2038558.2038560"
    },
    {
      "text": "Cliff Lampe, Rick Wash, Alcides Velasquez, and Elif Ozkaya. 2010. Motivations to participate in online communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1927--1936.  ",
      "doi": "10.1145/1753326.1753616"
    },
    {
      "text": "David Laniado, Andreas Kaltenbrunner, Carlos Castillo, and Mayo Fuster Morell. 2012. Emotions and dialogue in a peer-production community: The case of Wikipedia. In Proceedings of the Eighth Annual International Symposium on Wikis and Open Collaboration (WikiSym '12). ACM, New York, NY, USA, Article 9, 10 pages.  ",
      "doi": "10.1145/2462932.2462944"
    },
    {
      "text": "Yu-Wei Lee, Fei-Ching Chen, and Huo-Ming Jiang. 2006. Lurking as participation: a community perspective on lurkers' identity and negotiability. In Proceedings of the 7th International Conference on Learning Sciences (ICLS '06). International Society of the Learning Sciences: 404--410. ",
      "doi": "10.5555/1150034.1150093"
    },
    {
      "text": "Library directors: Gender and salary. n.d. American Library Association. Retrieved from http://www.ala.org/research/librarystaffstats/diversity/libdirectors",
      "doi": ""
    },
    {
      "text": "Yu-Wei Lin and Matthijs ben Besten. 2018. Gendered work culture in Free/Libre Open Source Software Development. Gender, Work and Organization, 1--15.",
      "doi": ""
    },
    {
      "text": "Mark S. Luckie. 2018, November 27. Facebook is failing its black employees and its black users. Facebook. Retrieved from https://www.facebook.com/notes/mark-s-luckie/facebook-is-failingits-black-employees-and-its-black-users/1931075116975013/",
      "doi": ""
    },
    {
      "text": "Connor McMahon, Isaac Johnson, and Brent Hecht. 2017. The substantial interdependence of Wikipedia and Google: A case study on the relationship between peer production communities and information technologies. In 11th International Conference on Web and Social Media, ICWSM 2017. AAAI Press. Retrieved from https://aaai.org/ocs/index.php/ICWSM/ICWSM17/paper/view/15623",
      "doi": ""
    },
    {
      "text": "Alex Madrigal. 2018, August 7. Wikipedia, the last bastion of shared reality. The Atlantic. Retrieved from https://www.theatlantic.com/technology/archive/2018/08/jeongpedi a/566897/",
      "doi": ""
    },
    {
      "text": "A. Mani and Rebeka Mukherjee. 2017. A study of FOSS 2013 survey data using clustering techniques. arXiv:1701.08302. Retrieved from https://arxiv.org/abs/1701.08302v2",
      "doi": ""
    },
    {
      "text": "Jimmie Manning. 2017. In Vivo Coding. The International Encyclopedia of Communication Research Methods.",
      "doi": ""
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 207--210.  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Amy Mitchell, Katie Simmons, Katerina Eva Matsa, and Laura Silver. 2018, January 11. People in poorer countries just as likely to use social media for news as those in wealthier countries. Pew Research Center. Retrieved from http://www.pewglobal.org/2018/01/11/people-in-poorer-countriesjust-as-likely-to-use-social-media-for-news-as-those-in-wealthiercountries/",
      "doi": ""
    },
    {
      "text": "Jonathan T. Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and sympathy: crafting positive new user experiences on wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work (CSCW '13). ACM, New York, NY, USA, 839--848.  ",
      "doi": "10.1145/2441776.2441871"
    },
    {
      "text": "Dawn Nafus. 2012. 'Patches don't have gender': What is not open in open source software. New Media & Society 14(4), 669--683.",
      "doi": ""
    },
    {
      "text": "David Nield. 2018, January 25. We pitted digital assistants against each other to find the most useful AI. Popular Science. Retrieved from https://www.popsci.com/digital-assistant-showdown",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Carla F. Griggio, and Wendy E. Mackay. 2017. \"WhatsApp is for family; Messenger is for friends\": Communication Places in App Ecosystems. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 727--735.  ",
      "doi": "10.1145/3025453.3025484"
    },
    {
      "text": "Banu Ozkazanc-Pan. 2014, April 24. Women in tech suffer because of American myth of meritocracy. The Conversation. Retrieved from https://theconversation.com/women-in-tech-suffer-because-ofamerican-myth-of-meritocracy-94269",
      "doi": ""
    },
    {
      "text": "Katherine Panciera, Reid Priedhorsky, Thomas Erickson, and Loren Terveen. 2010. Lurking? cyclopaths?: A quantitative lifecycle analysis of user behavior in a geowiki. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1917--1926.  ",
      "doi": "10.1145/1753326.1753615"
    },
    {
      "text": "Jessica A. Pater, Yacin Nadji, Elizabeth D. Mynatt, and Amy S. Bruckman. 2014. Just awful enough: The functional dysfunction of the something awful forums. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2407--2410.  ",
      "doi": "10.1145/2556288.2557193"
    },
    {
      "text": "Jessica A. Pater, Moon K. Kim, Elizabeth D. Mynatt, and Casey Fiesler. 2016. Characterizations of Online Harassment: Comparing Policies Across Social Media Platforms. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP '16). ACM, New York, NY, USA, 369--374.  ",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Bryce Peake. 2015. WP: THREATENING2MEN: Misogynist Infopolitics and the Hegemony of the Asshole Consensus on English Wikipedia. Ada: A Journal of Gender, New Media, and Technology 7.",
      "doi": ""
    },
    {
      "text": "Christian Pentzold. 2011. Imagining the Wikipedia community: What do Wikipedia authors mean when they write about their 'community'?. New Media & Society 13(5): 704--721.",
      "doi": ""
    },
    {
      "text": "Andrew Perrin and Jingjing Jiang. 2018, March 14. About a quarter of U.S. adults say they are 'almost constantly' online. Pew Research Center. Retrieved from http://www.pewresearch.org/facttank/2018/03/14/about-a-quarter-of-americans-report-going-onlinealmost-constantly/",
      "doi": ""
    },
    {
      "text": "Joseph Reagle. 2013. 'Free as in sexist?' Free culture and the gender gap. First Monday 18(1). Retrieved from https://firstmonday.org/article/view/4291/3381 CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK A. Menking et al.",
      "doi": ""
    },
    {
      "text": "Dan Robitzski. 2017, September 26. To keep AI from 'eating a table,' scientists make it read Wikipedia. Live Science. Retrieved from https://www.livescience.com/60520-artificial-intelligence-readswikipedia-to-learn-english.html",
      "doi": ""
    },
    {
      "text": "Heather Rosenfeld and Elsa Noterman. 2014. Safe space: Towards a reconceptualization. Antipode 46(5): 1346--1365.",
      "doi": ""
    },
    {
      "text": "Lawrence M. Sanger. 2009. The fate of expertise after Wikipedia. Episteme 6(1): 52--73.",
      "doi": ""
    },
    {
      "text": "Saradujour. 2014, May 27. If you don't understand why safe spaces are important, the world is probably one big safe space to you. #YesAllWomen {Tweet}. Retrieved from https://twitter.com/Saradujour/status/471332841897611266",
      "doi": ""
    },
    {
      "text": "Edgar Schein and Warren G. Bennis. 1965. Personal and Organization Change Through Group Methods: The Laboratory Approach. Wiley.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places: Unpacking Technology-Mediated Experiences of Safety and Harm with Transgender People. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 155 (November 2018), 27 pages.  ",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Lauren Scissors and Darren Gergle. 2016. On the bias: Self-esteem biases across communication channels during romantic couple conflict. In Proceedings of the 19th ACM Conference on ComputerSupported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 383--393.  ",
      "doi": "10.1145/2818048.2820080"
    },
    {
      "text": "Aaron Shaw and Eszter Hargittai. 2018. The Pipeline of Online Participation Inequalities: The Case of Wikipedia Editing. Journal of Communication 68(1): 143--168.",
      "doi": ""
    },
    {
      "text": "Solving online harassment: Katherine Maher speaks at MozFest. 2017, March 16. Medium. Retrieved from https://medium.com/mozilla-festival/solving-online-harassmente3ff66c2540f",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Stanko. 1988. Fear of crime and the myth of the safe home. A Feminist Critique of Criminology: 75--88.",
      "doi": ""
    },
    {
      "text": "Monica Stephens. 2013. Gender and the GeoWeb: Divisions in the production of user-generated cartographic information. GeoJournal 78(6), 981--996.",
      "doi": ""
    },
    {
      "text": "Anslem Strauss and Juliet Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Thousand Oaks, CA: Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "The Tarot Cards of Tech. n.d. Artefect Group. Retrieved from https://www.artefactgroup.com/case-studies/the-tarot-cards-of-tech/",
      "doi": ""
    },
    {
      "text": "Andrew Tsou, Mike Thelwall, Philippe Mongeon, and Cassidy R. Sugimoto. 2014. A Community of Curious Souls: An Analysis of Commenting Behavior on TED Talks Videos. PLoS ONE 9(4): e93609.",
      "doi": ""
    },
    {
      "text": "Bogdan Vasilescu, Daryl Posnett, Baishakhi Ray, Mark G.J. van den Brand, Alexander Serebrenik, Premkumar Devanbu, and Vladimir Filkov. 2015. Gender and tenure diversity in GitHub teams. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 37893798.  ",
      "doi": "10.1145/2702123.2702549"
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women's Experiences with and Strategies for Mitigating Negative Effects of Online Harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1231--1245.  ",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Adrianne Wadewitz. 2013, April 30. Who speaks for the women of Wikipedia? Not the women of Wikipedia. HASTAC. Retrieved from https://www.hastac.org/blogs/wadewitz/2013/04/30/who-speakswomen-wikipedia-not-women-wikipedia",
      "doi": ""
    },
    {
      "text": "Claudia Wagner, David Garcia, Mohsen Jadidi, and Markus Strohmaier. 2015. It's a Man's Wikipedia? Assessing Gender Inequality in an Online Encyclopedia. arXiv:1501.06307. Retrieved from https://arxiv.org/abs/1501.06307?context=cs",
      "doi": ""
    },
    {
      "text": "Wikimania. 2015, April 5. CBS News 60 Minutes. Retrieved from https://www.cbsnews.com/news/wikipedia-jimmy-wales-morleysafer-60-minutes/",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation. n.d. Retrieved from https://wikimediafoundation.org",
      "doi": ""
    },
    {
      "text": "Wikimedia movement. n.d. Retrieved from https://meta.wikimedia.org/wiki/Wikimedia_movement",
      "doi": ""
    },
    {
      "text": "Wikipedia:Drama. n.d. Retrieved from https://en.wikipedia.org/wiki/Wikipedia:Drama",
      "doi": ""
    },
    {
      "text": "Rachel Withers. 2018, October 11. Amazon owes Wikipedia big-time. Slate. Retrieved from https://slate.com/technology/2018/10/amazonecho-wikipedia-wikimedia-donation.html",
      "doi": ""
    },
    {
      "text": "Kersti Yllo and Michele Bograd. Feminist perspectives on wife abuse. In National Conference for Family Violence Researchers, 2nd, 1984, U of New Hampshire, NH, US. Sage Publications, Inc, 1988.",
      "doi": ""
    },
    {
      "text": "Daisy Yoo, Alina Huldtgren, Jill Palzkill Woelfer, David G. Hendry, and Batya Friedman. 2013. A value sensitive action-reflection model: evolving a co-design space with stakeholder and designer prompts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 419--428.  ",
      "doi": "10.1145/2470654.2470715"
    },
    {
      "text": "Lynn Zimmer. 1988. Tokenism and women in the workplace: The limits of gender-neutral theory. Social Problems 35(1), 64--77.",
      "doi": ""
    }
  ]
}