{
  "doi": "10.1145/3290605.3300251",
  "title": "Co-Design Beyond Words: 'Moments of Interaction' with Minimally-Verbal Children on the Autism Spectrum",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Existing co-design methods support verbal children on the autism spectrum in the design process, while their minimally-verbal peers are overlooked. We describe Co-Design Beyond Words (CDBW), an approach which merges existing co-design methods with practice-based methods from Speech and Language Therapy which are child-led and interests-based. These emphasise the rich detail that can be conveyed in the moment, through recognising occurrences of, for example, Joint Attention, Turn Taking and Imitation. We worked in an autism-specific primary school over 20 weeks with ten children, aged 5 to 8. We co-designed a playful prototype, the TangiBall, using the three iterative phases of CDBW; the Foundation Phase (preparation for interaction), the Interaction Phase (designing-and-reflecting in the moment) and the Reflection Phase (reflection-on-action). We contribute a novel co-design approach and present moments of interaction, the micro instances in design in which minimally-verbal children on the spectrum can convey meaning beyond words, through their actions, interactions, and attentional foci. These moments of interaction provide design insight, shape design direction, and reveal unique strengths, interests, and abilities.",
  "tags": [
    "child-led",
    "co-design",
    "minimally-verbal",
    "non-verbal",
    "autism",
    "participatory design",
    "speech and language therapy"
  ],
  "authors": [
    {
      "name": "Cara Wilson",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/do/10.1145/contrib-99659117545/rel-imgonly/img_3913.png",
      "acmid": "99659117545",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    },
    {
      "name": "Bernd Ploderer",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/do/10.1145/contrib-81311485528/rel-imgonly/bp2017-167a8820portrait.jpg",
      "acmid": "81311485528",
      "orcid": "missing"
    },
    {
      "name": "Laurianne Sitbon",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81363592880",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Meryl Alper. 2017. Giving voice: Mobile communication, disability, and inequality .MIT Press.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. 2013. Diagnostic and statistical manual of mental disorders: DSM-5 5th ed. ed.). American Psychiatric Association Arlington, VA.",
      "doi": ""
    },
    {
      "text": "Eevi Beck. 2002. P for Political - Participation is Not Enough. Scandinavian J. Inf. Systems, Vol. 14 (01 2002), 77--92. https://aisel.aisnet.org/sjis/vol14/iss1/1",
      "doi": ""
    },
    {
      "text": "Laura Benton and Hilary Johnson. 2014. Structured approaches to participatory design for children: can targeting the needs of children with autism provide benefits for a broader child population? Instructional Science, Vol. 42, 1 (01 Jan 2014), 47--65.",
      "doi": ""
    },
    {
      "text": "Laura Benton and Hilary Johnson. 2015. Widening participation in technology design: A review of the involvement of children with special educational needs and disabilities. International Journal of Child-Computer Interaction, Vol. 3--4 (2015), 23 -- 40. ",
      "doi": "10.5555/2991320.2991412"
    },
    {
      "text": "Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 2014. Diversity for Design: A Framework for Involving Neurodiverse Children in the Technology Design Process. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3747--3756.  ",
      "doi": "10.1145/2556288.2557244"
    },
    {
      "text": "Margot Brereton, Laurianne Sitbon, Muhammad Haziq Lim Abdullah, Mark Vanderberg, and Stewart Koplick. 2015. Design after design to bridge between people living with cognitive or sensory impairments, their friends and proxies. CoDesign, Vol. 11, 1 (2015), 4--20.",
      "doi": ""
    },
    {
      "text": "Scott Andrew Brown, David Silvera-Tawil, Petra Gemeinboeck, and John McGhee. 2016. The Case for Conversation: A Design Research Framework for Participatory Feedback from Autistic Children. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI '16). ACM, New York, NY, USA, 605--613.  ",
      "doi": "10.1145/3010915.3010934"
    },
    {
      "text": "John M Carroll and Mary Beth Rosson. 2007. Participatory design in community informatics. Design Studies, Vol. 28, 3 (2007), 243--261.",
      "doi": ""
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2007. Fictional Inquiry: design collaboration in a shared narrative space. CoDesign, Vol. 3, 4 (2007), 213--234. https://doi.org/10.1145/1952383.1952384",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Elizabeth Foss, Elizabeth Bonsignore, Mona Leigh Guha, Leyla Norooz, Emily Rhodes, Brenna McNally, Panagis Papadatos, Evan Golub, and Allison Druin. 2013. Children Initiating and Leading Cooperative Inquiry Sessions. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, NY, USA, 293--296.  ",
      "doi": "10.1145/2485760.2485796"
    }
  ]
}