{
  "doi": "10.1145/3290605.3300275",
  "title": "Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Through a design-led inquiry focused on smart home security cameras, this research develops three key concepts for research and design pertaining to new and emerging digital consumer technologies. Digital leakage names the propensity for digital information to be shared, stolen, and misused in ways unbeknownst or even harmful to those to whom the data pertains or belongs. Hole-and-corner applications are those functions connected to users' data, devices, and interactions yet concealed from or downplayed to them, often because they are non-beneficial or harmful to them. Foot-in-the-door devices are product and services with functional offerings and affordances that work to normalize and integrate a technology, thus laying groundwork for future adoption of features that might have earlier been rejected as unacceptable or unnecessary. Developed and illustrated through a set of design studies and explorations, this paper shows how these concepts may be used analytically to investigate issues such as privacy and security, anticipatorily to speculate about the future of technology development and use, and generatively to synthesize design concepts and solutions.",
  "authors": [
    {
      "name": "James Pierce",
      "institution": "California College of the Arts & University of California, Berkeley, San Francisco/Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    }
  ],
  "references": [
    {
      "text": "Akrich, Madeleine. \"The De-Scription of Technical Objects,\" 1992.",
      "doi": ""
    },
    {
      "text": "Ahmed, Nova, Sadd Azmeen Ur Rahman, Rahat Jahangir Rony, Tanvir Mushfique, and Vikram Mehta. \"Protibadinext: Sensor Support to Handle Sexual Harassment.\" In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct, 918--921. UbiComp '16. New York, NY, USA: ACM, 2016.  ",
      "doi": "10.1145/2968219.2979133"
    },
    {
      "text": "Aipperspach, Ryan, Ben Hooker, and Allison Woodruff. \"The Heterogeneous Home.\" In Proceedings of the 10th International Conference on Ubiquitous Computing, 222--231. UbiComp '08. New York, NY, USA: ACM, 2008.  ",
      "doi": "10.1145/1409635.1409666"
    },
    {
      "text": "Apthorpe, N., Reisman, D., Sundaresan, S., Narayanan, A., and Feamster, N. Spying on the smart home: Privacy attacks and defenses on encrypted iot traffic. Arxiv, 2017. https://arxiv.org/abs/1708.05044",
      "doi": ""
    },
    {
      "text": "Astor, Maggie. \"Your Roomba May Be Mapping Your Home, Collecting Data That Could Be Shared.\" The New York Times, January 20, 2018, sec. Technology. https://www.nytimes.com/2017/07/25/technology/roomba-irobot-data-privacy.html.",
      "doi": ""
    },
    {
      "text": "Baumer, Eric PS. \"Usees.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3295--3298. ACM, 2015.  ",
      "doi": "10.1145/2702123.2702147"
    },
    {
      "text": "Beattie, Scott, Carolyn Woodley, and Kay Souter. \"Creepy Analytics and Learner Data Rights.\" Rhetoric and Reality: Critical Perspectives on Educational Technology. Proceedings Ascilite, 2014, 421--425.",
      "doi": ""
    },
    {
      "text": "Biddle, Sam. \"Troubling Study Says Artificial Intelligence Can Predict Who Will Be Criminals Based on Facial Features.\" The Intercept (blog), November 18, 2016. https://theintercept.com/2016/11/18/troubling-study-says-artificial-intelligence-can-predict-who-will-be-criminals-based-on-facial-features/.",
      "doi": ""
    },
    {
      "text": "Blackwell, Lindsay, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. \"LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure During Shifting Social Movements.\" In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 610--622. CHI '16. New York, NY, USA: ACM, 2016.  ",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Boing Boing.\"Chinese Jaywalkers Are Identified and Shamed by Facial Recognition, and Now They'll Get Warnings over Text Message.\" Boing Boing. Accessed September 17, 2018. https://boingboing.net/2018/03/28/chinese-jaywalkers-are-identif.html.",
      "doi": ""
    },
    {
      "text": "Boucher, Andy, David Cameron, and Nadine Jarvis. \"Power to the People: Dynamic Energy Management through Communal Cooperation.\" In Proceedings of the Designing Interactive Systems Conference, 612--620. ACM, 2012.  ",
      "doi": "10.1145/2317956.2318048"
    },
    {
      "text": "Blythe, Mark, Jamie Steane, Jenny Roe, and Caroline Oliver. \"Solutionism, the Game: Design Fictions for Positive Aging.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 3849--3858. ACM, 2015.  ",
      "doi": "10.1145/2702123.2702491"
    },
    {
      "text": "Brunton, Finn, and Helen Nissenbaum. Obfuscation: A User's Guide for Privacy and Protest. Mit Press, 2015. ",
      "doi": "10.5555/2838885"
    },
    {
      "text": "Brunton, Finn, and Helen Nissenbaum. \"Vernacular Resistance to Data Collection and Analysis: A Political Theory of Obfuscation.\" First Monday 16, no. 5 (2011).",
      "doi": ""
    },
    {
      "text": "Chesney, Robert and Danielle Citron. \"Deep Fakes: A Looming Crisis for National Security, Democracy and Privacy? - Lawfare.\" Accessed September 19, 2018. https://www.lawfareblog.com/deep-fakes-looming-crisis-national-security-democracy-and-privacy.",
      "doi": ""
    },
    {
      "text": "Cialdini, R.B.; Vincent, J.E.; Lewis, S.K.; Catalan, J.; Wheeler, D.; Darby, B. L. (1975). \"Reciprocal concessions procedure for inducing compliance: the door-in-the-face technique\". Journal of Personality and Social Psychology. 31: 206--215.",
      "doi": ""
    },
    {
      "text": "Cila, Nazli, Iskander Smit, Elisa Giaccardi, and Ben Kröse. \"Products As Agents: Metaphors for Designing the Products of the IoT Age.\" In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 448--459. CHI '17. New York, NY, USA: ACM, 2017.  ",
      "doi": "10.1145/3025453.3025797"
    },
    {
      "text": "Citron, Danielle Keats. Hate Crimes in Cyberspace. Harvard University Press, 2014. ",
      "doi": "10.5555/3051927"
    },
    {
      "text": "Cole, Robert. Google Eric Schmidt - The Creepy Line (Edited). Accessed September 17, 2018. https://www.youtube.com/watch?v=mpmOL-MT5lQ.",
      "doi": ""
    },
    {
      "text": "Clifford, Stephanie and Quenin Hardy. \"Attention, Shoppers: Store Is Tracking Your Cell - The New York Times.\" Accessed September 17, 2018. https://www.nytimes.com/2013/07/15/business/attention-shopper-stores-are-tracking-your-cell.html",
      "doi": ""
    },
    {
      "text": "Cumbley, Richard, and Peter Church. \"Is 'Big Data' Creepy?\" Computer Law & Security Review 29, no. 5 (2013): 601--609.",
      "doi": ""
    },
    {
      "text": "Diamond, Jared. Collapse: How Societies Choose to Fail or Succeed. Penguin, 2005.",
      "doi": ""
    },
    {
      "text": "Das, Sauvik, Adam D.I. Kramer, Laura A. Dabbish, and Jason I. Hong. 2015. The Role of Social Influence in Security Feature Adoption. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1416--1426.  ",
      "doi": "10.1145/2675133.2675225"
    },
    {
      "text": "Egelman. Serge, Lorrie Faith Cranor, and Jason Hong. 2008. You've been warned: an empirical study of the effectiveness of web browser phishing warnings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1065--1074.:  ",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "Dourish, Paul and Ken Anderson. 2006. Collective Information Practice: Exploring Privacy and Security as Social and Cultural Phenomena. Human-Computer Interaction 21, 3: 319--342.  ",
      "doi": "10.1207/s15327051hci2103_2"
    },
    {
      "text": "Ferguson, Andrew Guthrie. The Rise of Big Data Policing: Surveillance, Race, and the Future of Law Enforcement. NYU Press, 2017.",
      "doi": ""
    },
    {
      "text": "Sarah E. Fox, Rafael M.L. Silva, and Daniela K. Rosner. 2018. Beyond the Prototype: Maintenance, Collective Responsibility, and Public IoT. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 21--32.  ",
      "doi": "10.1145/3196709.3196710"
    },
    {
      "text": "Freedman, J. L.; Fraser, S. C. (1966). \"Compliance without pressure: The foot-in-the-door technique\". Journal of Personality and Social Psychology. 4 (2): 195--202.",
      "doi": ""
    },
    {
      "text": "Gaver, William. \"What Should We Expect from Research through Design?\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 937--946. ACM, 2012  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Gaver, William. \"Making Spaces: How Design Workbooks Work.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1551--1560. CHI '11. New York, NY, USA: ACM, 2011.  ",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "Giaccardi, Elisa, Nazli Cila, Chris Speed, and Melissa Caldwell. \"Thing Ethnography: Doing Design Research with Non-Humans.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 377--387. DIS '16. New York, NY, USA: ACM, 2016.  ",
      "doi": "10.1145/2901790.2901905"
    },
    {
      "text": "Goldschmidt, Gabriela, Hagay Hochman, and Itay Dafni. \"The Design Studio 'Crit': Teacher--Student Communication.\" AI EDAM 24, no. 3 (August 2010): 285--302.  ",
      "doi": "10.1017/S089006041000020X"
    },
    {
      "text": "Haiyan Jia, Pamela J. Wisniewski, Heng Xu, Mary Beth Rosson, and John M Carroll. 2015. Risk-taking as a Learning Process for Shaping Teen's Online Information Privacy Behaviors. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15, 583--599.  ",
      "doi": "10.1145/2675133.2675287"
    },
    {
      "text": "Hauser, Sabrina, Doenja Oogjes, Ron Wakkary, and Peter-Paul Verbeek. \"An Annotated Portfolio on Doing Postphenomenology Through Research Products.\" In Proceedings of the 2018 on Designing Interactive Systems Conference 2018, 459--471. ACM, 2018.  ",
      "doi": "10.1145/3196709.3196745"
    },
    {
      "text": "Harvey, Adam. \"CV Dazzle: Camouflage from Face Detection.\" Accessed September 17, 2018. https://cvdazzle.com/.",
      "doi": ""
    },
    {
      "text": "Healy, John. \"The Components of the\" Crit\" in Art and Design Education.\" Irish Journal of Academic Practice 5, no. 1 (2016): 7.",
      "doi": ""
    },
    {
      "text": "Hu, Tung-Hui. A Prehistory of the Cloud, 2015. Cambridge MA, MIT Press, 2015. ",
      "doi": "10.5555/3098742"
    },
    {
      "text": "Jenkins, Tom. \"Cohousing IoT: Design Prototyping for Community Life.\" In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction, 667--673. ACM, 2018.  ",
      "doi": "10.1145/3173225.3173244"
    },
    {
      "text": "Jones, Rhett. \"Roomba's Next Big Step Is Selling Maps of Your Home to the Highest Bidder.\" Accessed September 17, 2018. https://gizmodo.com/roombas-next-big-step-is-selling-maps-of-your-home-to-t-1797187829.",
      "doi": ""
    },
    {
      "text": "Kopytoff, Verne. \"The Real Reason Google Paid $3.2 Billion For Nest.\" Time. Accessed September 18, 2018. http://business.time.com/2014/01/14/the-real-reason-google-paid-3--2-billion-for-nest/",
      "doi": ""
    },
    {
      "text": "Krishnamurthy, Balachander, and Craig E. Wills. \"Generating a Privacy Footprint on the Internet.\" In Proceedings of the 6th ACM SIGCOMM Conference on Internet Measurement, 65--70. ACM, 2006.  ",
      "doi": "10.1145/1177080.1177088"
    },
    {
      "text": "Lentricchia, Frank, and Andrew DuBois. Close Reading: The Reader. Duke University Press Durham, NC, 2003.",
      "doi": ""
    },
    {
      "text": "Liu, Jen, Daragh Byrne, and Laura Devendorf. \"Design for Collaborative Survival: An Inquiry into Human-Fungi Relationships.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 40. ACM, 2018.  ",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Lin, Jialiu, Shahriyar Amini, Jason I. Hong, Norman Sadeh, Janne Lindqvist, and Joy Zhang. \"Expectation and Purpose: Understanding Users' Mental Models of Mobile App Privacy through Crowdsourcing.\" In Proceedings of the 2012 ACM Conference on Ubiquitous Computing, 501--510. ACM, 2012.  ",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Lindley, Joseph, Paul Coulton and Rachel Cooper. Why the Internet of Things needs Object Orientated Ontology, The Design Journal, 2017.",
      "doi": ""
    },
    {
      "text": "Ma, Alexandra. \"These Are the Things That Can Get You Punished under China's Creepy \"social Credit' System - from Fake News to Jaywalking.\" Business Insider. Accessed September 17, 2018. https://www.businessinsider.com/china-social-credit-system-things-you-can-do-wrong-and-punishments-2018--4.",
      "doi": ""
    },
    {
      "text": "Neurospeculative afro-feminism. \"Nsaf.\" Accessed September 17, 2018. http://www.hyphen-labs.com/nsaf.html.",
      "doi": ""
    },
    {
      "text": "Nest.com.\"Privacy Statement for Nest Products and Services.\" Nest. Accessed January 6, 2018. https://www.nest.com/legal/privacy-statement-for-nest-products-and-services/",
      "doi": ""
    },
    {
      "text": "Nest.com.\"The Nestie Awards, Year Two | Nest.\" Accessed December 22, 2017. https://nest.com/blog/2017/03/08/the-nestie-awards-year-two/.",
      "doi": ""
    },
    {
      "text": "Nest.com. \"Video | Nest.\" Accessed December 22, 2017. https://nest.com/video/category/security/",
      "doi": ""
    },
    {
      "text": "Nest. \"Support.\" Nest. Accessed September 19, 2018. https://www.nest.com/support/article/.",
      "doi": ""
    },
    {
      "text": "Nissenbaum, Helen. Privacy in Context: Technology, Policy, and the Integrity of Social Life. Stanford University Press, 2009. ",
      "doi": "10.5555/1822585"
    },
    {
      "text": "NMSBA. \"NMSBA - What Is Neuromarketing.\" Accessed September 17, 2018. http://www.nmsba.com/what-is-neuromarketing.",
      "doi": ""
    },
    {
      "text": "Oxford dictionary, \"Creepy | Definition of Creepy in US English by Oxford Dictionaries.\" Oxford Dictionaries | English. Accessed September 17, 2018. https://en.oxforddictionaries.com/definition/us/creepy.",
      "doi": ""
    },
    {
      "text": "Pater, Jessica A., Moon K. Kim, Elizabeth D. Mynatt, and Casey Fiesler. \"Characterizations of Online Harassment: Comparing Policies across Social Media Platforms.\" In Proceedings of the 19th International Conference on Supporting Group Work, 369--374. ACM, 2016.  ",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Pierce, James. \"On the Presentation and Production of Design Research Artifacts in HCI.\" In Proceedings of the 2014 Conference on Designing Interactive Systems, 735--744. ACM, 2014.  ",
      "doi": "10.1145/2598510.2598525"
    },
    {
      "text": "Pierce, James, and Carl DiSalvo. \"Addressing Network Anxieties with Alternative Design Metaphors.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 549. ACM, 2018.  ",
      "doi": "10.1145/3173574.3174123"
    },
    {
      "text": "Pierce, James, and Carl DiSalvo. \"Dark Clouds, Io&#!+, and {Crystal Ball Emoji}: Projecting Network Anxieties with Alternative Design Metaphors.\" In Proceedings of the 2017 Conference on Designing Interactive Systems, 1383--1393. ACM, 2017.  ",
      "doi": "10.1145/3064663.3064795"
    },
    {
      "text": "Rosner, Daniela K., Miwa Ikemiya, Diana Kim, and Kristin Koch. \"Designing with Traces.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1649--1658. ACM, 2013.  ",
      "doi": "10.1145/2470654.2466218"
    },
    {
      "text": "Schön, Donald A. \"The Architectural Studio as an Exemplar of Education for Reflection-in-Action.\" Journal of Architectural Education 38, no. 1 (1984): 2--9.",
      "doi": ""
    },
    {
      "text": "Schüll, Natasha Dow. Addiction by Design: Machine Gambling in Las Vegas. Princeton University Press, 2012. ",
      "doi": "10.5555/2621987"
    },
    {
      "text": "Sheperd, Mark. \"Sentient City Survival Kit.\" Accessed September 17, 2018. http://survival.sentientcity.net/umbrella.html.",
      "doi": ""
    },
    {
      "text": "Shklovski, Irina, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. \"Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use.\" In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, 2347--2356. ACM, 2014. http://dl.acm.org/citation.cfm?id=2557421.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Shove, Elizabeth. \"Comfort, Cleanliness and Convenience: The Social Organization of Normality (New Technologies/New Cultures),\" 2004.",
      "doi": ""
    },
    {
      "text": "Skirpan, Michael Warren, Jacqueline Cameron, and Tom Yeh. \"More Than a Show: Using Personalized Immersive Theater to Educate and Engage the Public in Technology Ethics.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 464. ACM, 2018.  ",
      "doi": "10.1145/3173574.3174038"
    },
    {
      "text": "Tene, Omer, and Jules Polonetsky. \"A Theory of Creepy: Technology, Privacy and Shifting Social Norms.\" Yale JL & Tech. 16 (2013): 59.",
      "doi": ""
    },
    {
      "text": "Vaghefi, Isaac, and Liette Lapointe. \"When Too Much Usage Is Too Much: Exploring the Process of It Addiction.\" In System Sciences (HICSS), 2014 47th Hawaii International Conference On, 4494--4503. IEEE, 2014.  ",
      "doi": "10.1109/HICSS.2014.553"
    },
    {
      "text": "Verbeek, P. P., and Slob, A., 2006, User Behavior and Technology Development: Shaping Sustainable Relations between Consumers and Technologies, vol. 20 of Eco-Efficiency in Industry and Science, Springer, Dordrecht.",
      "doi": ""
    },
    {
      "text": "Verbeek, Peter-Paul. \"Obstetric Ultrasound and the Technological Mediation of Morality: A Postphenomenological Analysis.\" Human Studies 31, no. 1 (2008): 11--26.",
      "doi": ""
    },
    {
      "text": "Wakkary, Ron, Doenja Oogjes, Henry WJ Lin, and Sabrina Hauser. \"Philosophers Living with the Tilting Bowl.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 94. ACM, 2018.  ",
      "doi": "10.1145/3173574.3173668"
    },
    {
      "text": "Wallace, Jayne, Jon Rogers, Michael Shorter, Pete Thomas, Martin Skelly, and Richard Cook. \"The SelfReflector: Design, IoT and the High Street.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 423. ACM, 2018.  ",
      "doi": "10.1145/3173574.3173997"
    },
    {
      "text": "Weizman, Eyal. \"Introduction: Forensis.\" Forensis: The Architecture of Public Truth, 2014, 9--32.",
      "doi": ""
    },
    {
      "text": "Wikipedia. \"Targeted Advertising.\" Wikipedia, September 5, 2018. https://en.wikipedia.org/w/index.php?title=Targeted_advertising&oldid=858248415.",
      "doi": ""
    },
    {
      "text": "Wisniewski, Pamela, Haiyan Jia, Na Wang, Saijing Zheng, Heng Xu, Mary Beth Rosson, and John M. Carroll. \"Resilience Mitigates the Negative Effects of Adolescent Internet Addiction and Online Risk Exposure.\" In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 4029--4038. ACM, 2015.  ",
      "doi": "10.1145/2702123.2702240"
    },
    {
      "text": "Wong, Richmond Y., and Deirdre K. Mulligan. \"When a Product Is Still Fictional: Anticipating and Speculating Futures through Concept Videos.\" In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 121--133. ACM, 2016.  ",
      "doi": "10.1145/2901790.2901801"
    },
    {
      "text": "Wu, Xiaolin, and Xi Zhang. \"Automated Inference on Criminality Using Face Images.\" ArXiv Preprint arXiv:1611.04135, 2016.",
      "doi": ""
    },
    {
      "text": "Zimmerman, John, Jodi Forlizzi, and Shelley Evenson. \"Research through Design as a Method for Interaction Design Research in HCI.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 493--502. ACM, 2007.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Zuboff, Shoshana. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power. (In Press: January 2019). Public Affairs.",
      "doi": ""
    },
    {
      "text": "Zuboff, Shoshana. \"Big Other: Surveillance Capitalism and the Prospects of an Information Civilization.\" Journal of Information Technology 30, no. 1 (2015): 75--89.",
      "doi": ""
    }
  ]
}