{
  "doi": "10.1145/3290605.3300755",
  "title": "Does Being Verified Make You More Credible?: Account Verification's Effect on Tweet Credibility",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Many popular social networking and microblogging sites support verified accounts---user accounts that are deemed of public interest and whose owners have been authenticated by the site. Importantly, the content of messages contributed by verified account owners is not verified. Such messages may be factually correct, or not. This paper investigates whether users confuse authenticity with credibility by posing the question: Are users more likely to believe content from verified accounts than from non-verified accounts? We conduct two online studies, a year apart, with 748 and 2041 participants respectively, to assess how the presence or absence of verified account indicators influences users' perceptions of tweets. Surprisingly, across both studies, we find that---in the context of unfamiliar accounts---most users can effectively distinguish between authenticity and credibility. The presence or absence of an authenticity indicator has no significant effect on willingness to share a tweet or take action based on its contents.",
  "tags": [
    "trust",
    "authentication",
    "credibility",
    "twitter",
    "social media"
  ],
  "authors": [
    {
      "name": "Tavish Vaidya",
      "institution": "Georgetown University, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658726087",
      "orcid": "missing"
    },
    {
      "name": "Daniel Votipka",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488669410",
      "orcid": "missing"
    },
    {
      "name": "Michelle L. Mazurek",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460641915",
      "orcid": "missing"
    },
    {
      "name": "Micah Sherr",
      "institution": "Georgetown University, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582068",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ruba Abu-Salma, M Angela Sasse, Joseph Bonneau, Anastasia Danilova, Alena Naiakshina, and Matthew Smith. 2017. Obstacles to the Adoption of Secure Communication Tools. In IEEE Symposium on Security and Privacy (SP).",
      "doi": ""
    },
    {
      "text": "Hunt Allcott and Matthew Gentzkow. 2017. Social Media and Fake news in the 2016 Election. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "David K Berlo, James B Lemert, and Robert J Mertz. 1969. Dimensions for Evaluating the Acceptability of Message Sources. Public opinion quarterly 33, 4 (1969), 563--576.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon's Mechanical Turk: A New Source of Inexpensive, Yet HighQuality, Data? Perspectives on Psychological Science 6, 1 (2011), 3--5. arXiv:http://pps.sagepub.com/content/6/1/3.full.pdf+html",
      "doi": ""
    },
    {
      "text": "Carlos Castillo, Marcelo Mendoza, and Barbara Poblete. 2011. Information Credibility on Twitter. In Proceedings of the 20th International Conference on World Wide Web (WWW '11). ACM, New York, NY, USA, 675--684.  ",
      "doi": "10.1145/1963405.1963500"
    },
    {
      "text": "Shelly Chaiken. 1987. The Heuristic Model of Persuasion. In Social Infuence: the Ontario Symposium, Vol. 5. 3--39.",
      "doi": ""
    },
    {
      "text": "J. Cohen. 1988. Statistical Power Analysis for the Behavioral Sciences. Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Rachna Dhamija, J. D. Tygar, and Marti Hearst. 2006. Why Phishing Works. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 581--590.  ",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Julie S. Downs, Mandy B. Holbrook, Steve Sheng, and Lorrie Faith Cranor. 2010. Are Your Participants Gaming the System? Screening Mechanical Turk Workers. In Conference on Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/1753326.1753688"
    },
    {
      "text": "Elizabeth Dwoskin. 2017. Twitter is Looking for Ways to Let Users Flag Fake News, Ofensive content. The Washington Post June (2017).",
      "doi": ""
    },
    {
      "text": "Emily Heil. 2017. Trump posts fake Abraham Lincoln quote. Available at www.washingtonpost. com/news/reliable-source/wp/2017/02/13/ trump-posts-fake-abraham-lincoln-quote/.",
      "doi": ""
    },
    {
      "text": "B. Zafer Erdogan. 1999. Celebrity Endorsement: A Literature Review. Journal of Marketing Management 15, 4 (1999), 291--314.",
      "doi": ""
    },
    {
      "text": "Adrienne Porter Felt, Robert W Reeder, Alex Ainslie, Helen Harris, Max Walker, Christopher Thompson, Mustafa Embre Acer, Elisabeth Morant, and Sunny Consolvo. 2016. Rethinking Connection Security Indicators. In Proceedings of the 12th Symposium on Usable Privacy and Security (SOUPS '16). ",
      "doi": "10.5555/3235895.3235897"
    },
    {
      "text": "Andrew J Flanagin and Miriam J Metzger. 2007. The Role of Site Features, User Attributes, and Information Verifcation Behaviors on the Perceived Credibility of Web-Based Information. New Media & Society 9, 2 (2007), 319--342.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg, Cathy Soohoo, David R Danielson, Leslie Marable, Julianne Stanford, and Ellen R Tauber. 2003. How Do Users Evaluate the Credibility of Web Sites? A Study with over 2,500 Participants. In Proceedings of the 1st Conference on Designing for User Experiences (DUX '03).  ",
      "doi": "10.1145/997078.997097"
    },
    {
      "text": "Karl Pearson F.R.S. 1900. X. On the criterion that a given system of deviations from the probable in the case of a correlated system of variables is such that it can be reasonably supposed to have arisen from random sampling. Philos. Mag. 50, 302 (1900), 157--175.",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer, Peter M Todd, the ABC Research Group, et al. 1999. Simple Heuristics that Make us Smart. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Yuli Patrick Hsieh. 2012. Succinct survey measures of web-use skills. Social Science Computer Review 30, 1 (2012), 95--107.  ",
      "doi": "10.1177/0894439310397146"
    },
    {
      "text": "Andrew F Hayes and Klaus Krippendorf. 2007. Answering the call for a standard reliability measure for coding data. Communication methods and measures 1, 1 (2007), 77--89.",
      "doi": ""
    },
    {
      "text": "Amir Herzberg and Ahmad Jbara. 2008. Security and Identifcation Indicators for Browsers Against Spoofng and Phishing Attacks. ACM Transactions on Internet Technology (TOIT) 8, 4 (Oct. 2008), 16:1--16:36.  ",
      "doi": "10.1145/1391949.1391950"
    },
    {
      "text": "Brian Hilligoss and Soo Young Rieh. 2008. Developing a Unifying Framework of Credibility Assessment: Construct, Heuristics, and Interaction in Context. Information Processing & Management 44, 4 (2008), 1467--1484.  ",
      "doi": "10.1016/j.ipm.2007.10.001"
    },
    {
      "text": "Allyson L Holbrook, Melanie C Green, and Jon A Krosnick. 2003. Telephone versus face-to-face interviewing of national probability samples with long questionnaires: Comparisons of respondent satisfcing and social desirability response bias. Public opinion quarterly 67, 1 (2003), 79--125.",
      "doi": ""
    },
    {
      "text": "Sture Holm. 1979. A Simple Sequentially Rejective Multiple Test Procedure. Scandinavian Journal of Statistics 6, 2 (1979), 65--70.",
      "doi": ""
    },
    {
      "text": "Carl I Hovland, Irving L Janis, and Harold H Kelley. 1953. Communication and Persuasion; Psychological Studies of Opinion Change. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Haje Jan Kamps. 2015. Who Are Twitter's Verifed Users? Medium post. Available at https://medium.com/@Haje/ who-are-twitter-s-verified-users-af976fc1b032.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In USENIX Security Symposium. ",
      "doi": "10.5555/3235838.3235842"
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies with Mechanical Turk. In Conference on Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "K. P. Krishna Kumar and G. Geethakumari. 2014. Detecting misinformation in online social networks using cognitive psychology. Human-centric Computing and Information Sciences 4, 1 (24 Sep 2014), 14.",
      "doi": ""
    },
    {
      "text": "Ziva Kunda. 1990. The Case for Motivated Reasoning. Psychological bulletin 108, 3 (1990), 480.",
      "doi": ""
    },
    {
      "text": "Leib Litman, Jonathan Robinson, and Tzvi Abberbock. 2017. TurkPrime.com: A Versatile Crowdsourcing Data Acquisition Platform for The Behavioral Sciences. Behavior research methods 49, 2 (2017), 433--442.",
      "doi": ""
    },
    {
      "text": "Robert H. Lyles, Hung-Mo Lin, and John M. Williamson. {n. d.}. A practical approach to computing power for generalized linear models with nominal, count, or ordinal responses. Statistics in Medicine 26, 7 ({n. d.}), 1632--1648. arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/sim.2617",
      "doi": ""
    },
    {
      "text": "Jim Maddock, Kate Starbird, Haneen J. Al-Hassani, Daniel E. Sandoval, Mania Orand, and Robert M. Mason. 2015. Characterizing Online Rumoring Behavior Using Multi-Dimensional Signatures. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15).  ",
      "doi": "10.1145/2675133.2675280"
    },
    {
      "text": "Quinn McNemar. 1947. Note on the sampling error of the diference between correlated proportions or percentages. Psychometrika 12, 2 (01 Jun 1947), 153--157.",
      "doi": ""
    },
    {
      "text": "Miriam J Metzger, Andrew J Flanagin, and Ryan B Medders. 2010. Social and Heuristic Approaches to Credibility Evaluation Online. Journal of communication 60, 3 (2010), 413--439.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Scott Counts, Asta Roseway, Aaron Hof, and Julia Schwarz. 2012. Tweeting is Believing?: Understanding Microblog Credibility Perceptions. In Proceedings of the 15th ACM Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 441--450.  ",
      "doi": "10.1145/2145204.2145274"
    },
    {
      "text": "Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a Sufcient Condition for Data Quality on Amazon Mechanical Turk. Behavior Research Methods 46, 4 (01 Dec 2014), 1023--1031.",
      "doi": ""
    },
    {
      "text": "Vahed Qazvinian, Emily Rosengren, Dragomir R. Radev, and Qiaozhu Mei. 2011. Rumor Has It: Identifying Misinformation in Microblogs. In Proceedings of the 15th Conference on Empirical Methods in Natural Language Processing (EMNLP '11). Association for Computational Linguistics, Stroudsburg, PA, USA, 1589--1599. ",
      "doi": "10.5555/2145432.2145602"
    },
    {
      "text": "Adrian E Raftery. 1995. Bayesian model selection in social research. Sociological methodology (1995), 111--163.",
      "doi": ""
    },
    {
      "text": "Harry T Reis and Charles M Judd. 2000. Handbook of research methods in social and personality psychology. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "S. E. Schechter, R. Dhamija, A. Ozment, and I. Fischer. 2007. The Emperor's New Security Indicators. In Proceedings of the 28th IEEE Symposium on Security and Privacy (S&P '07). 51--65.  ",
      "doi": "10.1109/SP.2007.35"
    },
    {
      "text": "Howard J Seltman. 2012. Experimental design and analysis. Online at: http://www. stat. cmu. edu/, hseltman/309/Book/Book. pdf (2012).",
      "doi": ""
    },
    {
      "text": "Aaron Smith and Monica Anderson. 2018. Social Media Use in 2018. Internet & Technology Report. Pew Research Center.",
      "doi": ""
    },
    {
      "text": "Peter Steiner. 1993. On the Internet, Nobody Knows You're a Dog (Cartoon). The New Yorker (July 5 1993).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1990. Basics of qualitative research. Vol. 15. Newbury Park, CA: Sage.",
      "doi": ""
    },
    {
      "text": "S Shyam Sundar. 2008. The MAIN Model: A Heuristic Approach to Understanding Technology Efects on Credibility. Digital media, youth, and credibility 73100 (2008).",
      "doi": ""
    },
    {
      "text": "Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri, and Lorrie Faith Cranor. 2009. Crying Wolf: An Empirical Study of SSL Warning Efectiveness. In Proceedings of the 18th USENIX Security Symposium (USENIX Security '09). ",
      "doi": "10.5555/1855768.1855793"
    },
    {
      "text": "Michael Toomim, Travis Kriplean, Claus Pörtner, and James Landay. 2011. Utility of Human-computer Interactions: Toward a Science of Preference Measurement. In Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA.  ",
      "doi": "10.1145/1978942.1979277"
    },
    {
      "text": "Twitter. 2017. About Verifed Accounts. https://support. twitter.com/articles/119135.",
      "doi": ""
    },
    {
      "text": "Twitter. 2017. Request to Verify an Account. https://support. twitter.com/articles/20174631.",
      "doi": ""
    },
    {
      "text": "Twitter Support. 2017. Statement Regarding Account Verifcation (Tweet). https://twitter.com/TwitterSupport/status/ 930926124892168192.",
      "doi": ""
    },
    {
      "text": "Ward van Zoonen and Toni van der Meer. 2015. The Importance of Source and Credibility Perception in Times of Crisis: Crisis Communication in a Socially Mediated Era. Journal of Public Relations Research 27, 5 (2015), 371--388.",
      "doi": ""
    },
    {
      "text": "Jonathan Vanian. 2017. Twitter Removes Verifed Status From Users For Racist and Hateful Posts. Available at http://fortune.com/ 2017/11/15/twitter-verification-racist-hateful/.",
      "doi": ""
    },
    {
      "text": "Sam Wineburg, Sarah McGrew, Joel Breakstone, and Teresa Ortega. 2016. Evaluating Information: The Cornerstone of Civic Online Reasoning. Stanford Digital Repository (2016).",
      "doi": ""
    },
    {
      "text": "Nick Wingfeld, Mike Isaac, and Katie Benner. 2016. Google and Facebook Take Aim at Fake News Sites. The New York Times 11 (2016).",
      "doi": ""
    }
  ]
}