{
  "doi": "10.1145/3290605.3300556",
  "title": "ChewIt. An Intraoral Interface for Discreet Interactions",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Sensing interfaces relying on head or facial gestures provide effective solutions for hands-free scenarios. Most of these interfaces utilize sensors attached to the face, as well as into the mouth, being either obtrusive or limited in input bandwidth. In this paper, we propose ChewIt -- a novel intraoral input interface. ChewIt resembles an edible object that allows users to perform various hands-free input operations, both simply and discreetly. Our design is informed by a series of studies investigating the implications of shape, size, locations for comfort, discreetness, maneuverability, and obstructiveness. Additionally, we evaluated potential gestures that users could use to interact with such an intraoral interface.",
  "authors": [
    {
      "name": "Pablo Gallego Cascón",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366433",
      "orcid": "missing"
    },
    {
      "name": "Denys J.C. Matthies",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81548327356/rel-imgonly/citations.jpg",
      "acmid": "81548327356",
      "orcid": "missing"
    },
    {
      "name": "Sachith Muthukumarana",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-99659133087/rel-imgonly/sachithpp3_-_copy.jpg",
      "acmid": "99659133087",
      "orcid": "missing"
    },
    {
      "name": "Suranga Nanayakkara",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81416609140/rel-imgonly/_mg_5811-uoa.jpg",
      "acmid": "81416609140",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "David Ahlström, Khalad Hasan, and Pourang Irani. 2014. Are you comfortable doing that?: Acceptance studies of around-device gestures in and for public settings. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. ACM, 193--202.  ",
      "doi": "10.1145/2628363.2628381"
    },
    {
      "text": "Amazon Alexa. 2014. Retrieved August 15, 2018 from https://developer. amazon.com/alexa.",
      "doi": ""
    },
    {
      "text": "Toshiyuki Ando, Yuki Kubo, Buntarou Shizuki, and Shin Takahashi. 2017. CanalSense: Face-Related Movement Recognition System based on Sensing Air Pressure in Ear Canals. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 679-- 689.  ",
      "doi": "10.1145/3126594.3126649"
    },
    {
      "text": "Daniel Ashbrook, Carlos Tejada, Dhwanit Mehta, Anthony Jiminez, Goudam Muralitharam, Sangeeta Gajendra, and Ross Tallents. 2016. Bitey: An exploration of tooth click gestures for hands-free user interface control. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 158--169.  ",
      "doi": "10.1145/2935334.2935389"
    },
    {
      "text": "Sharmila Ashok. 2017. High-level hands-free control of wheelchair--a review. Journal of medical engineering & technology 41, 1 (2017), 46--64.",
      "doi": ""
    },
    {
      "text": "9 axis MotionTracking Inertial Measurement Unit MPU-9250. https://www.invensense.com/products/motion-tracking/9-axis/mpu9250/.",
      "doi": ""
    },
    {
      "text": "Abdelkareem Bedri, David Byrd, Peter Presti, Himanshu Sahni, Zehua Gue, and Thad Starner. 2015. Stick it in your ear: Building an inear jaw movement sensor. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers. ACM, 1333--1338.  ",
      "doi": "10.1145/2800835.2807933"
    },
    {
      "text": "Stephen Brewster, Roderick Murray-Smith, Andrew Crossan, Yolanda Vasquez-Alvarez, and Julie Rico. 2009. The gaime project: Gestural and auditory interactions for mobile environments. British computer Society (2009).",
      "doi": ""
    },
    {
      "text": "Wei-Hung Chen. 2015. Blowatch: Blowable and hands-free interaction for smartwatches. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on human factors in computing systems. ACM, 103-- 108.  ",
      "doi": "10.1145/2702613.2726961"
    },
    {
      "text": "Malcolm J Cook, Charles Cranmer, Robert Finan, Andy Sapeluk, and Carol-Ann Milton. 2017. 15 Memory load and task interference: hidden usability issues in speech interfaces. Engineering Psychology and Cognitive Ergonomics: Volume 1: Transportation Systems (2017).",
      "doi": ""
    },
    {
      "text": "Microsoft Cortana. 2015. Retrieved August 15, 2018 from https: //www.microsoft.com/en-us/cortana.",
      "doi": ""
    },
    {
      "text": "Benjamin R Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. What can i help you with?: infrequent users' experiences of intelligent personal assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 43.  ",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "The da Vinci Surgical System. Retrieved August 28, 2018 from http://www.davincisurgery.com/da-vinci-surgery/ da-vinci-surgical-system/.",
      "doi": ""
    },
    {
      "text": "Darren W Dahl, Rajesh V Manchanda, and Jennifer J Argo. 2001. Embarrassment in consumer purchase: The roles of social presence and purchase familiarity. Journal of consumer research 28, 3 (2001), 473-- 481.",
      "doi": ""
    },
    {
      "text": "Piotr Dalka and Andrzej Czyzewski. 2010. Human-Computer Interface Based on Visual Lip Movement and Gesture Recognition. IJCSA 7, 3 (2010), 124--139.",
      "doi": ""
    },
    {
      "text": "Bruce Denby, Yacine Oussar, Gérard Dreyfus, and Maureen Stone. 2006. Prospects for a silent speech interface using ultrasound imaging. In Acoustics, Speech and Signal Processing, 2006. ICASSP 2006 Proceedings. 2006 IEEE International Conference on, Vol. 1. IEEE, I--I.",
      "doi": ""
    },
    {
      "text": "Bruce Denby, Thomas Schultz, Kiyoshi Honda, Thomas Hueber, Jim M Gilbert, and Jonathan S Brumberg. 2010. Silent speech interfaces. Speech Communication 52, 4 (2010), 270--287.  ",
      "doi": "10.1016/j.specom.2009.08.002"
    },
    {
      "text": "Bruce Denby and Maureen Stone. 2004. Speech synthesis from real time ultrasound images of the tongue. In Acoustics, Speech, and Signal Processing, 2004. Proceedings.(ICASSP'04). IEEE International Conference on, Vol. 1. IEEE, I--685.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Andrés Lucero, Jussi Holopainen, Chulhong Min, Adrian Cheok, Annika Waern, and Stefen Walz. 2015. Embarrassing interactions. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2365--2368.  ",
      "doi": "10.1145/2702613.2702647"
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L Vu. 2015. Privacy concerns for use of voice activated personal assistant in the public space. International Journal of Human-Computer Interaction 31, 4 (2015), 307-- 335.",
      "doi": ""
    },
    {
      "text": "Maria R Ebling. 2016. Can cognitive assistants disappear? IEEE Pervasive Computing 15, 3 (2016), 4--6.",
      "doi": "10.1109/MPRV.2016.41"
    },
    {
      "text": "Michael J Fagan, Stephen R Ell, James M Gilbert, E Sarrazin, and Peter M Chapman. 2008. Development of a (silent) speech recognition system for patients following laryngectomy. Medical engineering & physics 30, 4 (2008), 419--425.",
      "doi": ""
    },
    {
      "text": "Ultimaker Polylactic Acid Filament(PLA). Retrieved August 30, 2018 from https://ultimaker.com/en/products/materials/pla.",
      "doi": ""
    },
    {
      "text": "FormLabs. Dental LT Clear Resin. Retrieved August 30, 2018 from https://formlabs.com/materials/dentistry/.",
      "doi": ""
    },
    {
      "text": "Masaaki Fukumoto. 2018. SilentVoice: Unnoticeable Voice Input by Ingressive Speech. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 237--246.  ",
      "doi": "10.1145/3242587.3242603"
    },
    {
      "text": "Margaret Gilbert. 1983. Notes on the concept of a social convention. New Literary History 14, 2 (1983), 225--251.",
      "doi": ""
    },
    {
      "text": "Erving Gofman. 1956. Embarrassment and social organization. American Journal of sociology 62, 3 (1956), 264--271.",
      "doi": ""
    },
    {
      "text": "Jose A Gonzalez, Lam A Cheah, Jie Bai, Stephen R Ell, James M Gilbert, Roger K Moore, and Phil D Green. 2014. Analysis of phonetic similarity in a silent speech interface based on permanent magnetic articulography. In Fifteenth Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "JA Gonzalez Lopez, Lam A Cheah, Phil D Green, James M Gilbert, Stephen R Ell, Roger K Moore, and Ed Holdsworth. 2017. Evaluation of a silent speech interface based on magnetic sensing and deep learning for a phonetically rich vocabulary. In Proceedings of the Annual Conference of the International Speech Communication Association, Interspeech. ISCA, 3986--3990.",
      "doi": ""
    },
    {
      "text": "Tauseef Gulrez, Alessandro Tognetti, Woon Jong Yoon, Manolya Kavakli, and John-John Cabibihan. 2016. A hands-free interface for controlling virtual electric-powered wheelchairs. International Journal of Advanced Robotic Systems 13, 2 (2016), 49.",
      "doi": ""
    },
    {
      "text": "Gaurav Gupta. 2018. Improved Hands-Free Text Entry System. (2018).",
      "doi": ""
    },
    {
      "text": "Ryo Hayashi, Kazuhiro Tsuga, Ryuji Hosokawa, Mitsuyoshi Yoshida, Yuuji Sato, and Yasumasa Akagawa. 2002. A novel handy probe for tongue pressure measurement. International Journal of Prosthodontics 15, 4 (2002).",
      "doi": ""
    },
    {
      "text": "Kayla J Hefernan, Frank Vetere, Lauren M Britton, Bryan Semaan, and Thecla Schiphorst. 2016. Insertable digital devices: voluntarily under the skin. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems. ACM, 85--88.  ",
      "doi": "10.1145/2908805.2913026"
    },
    {
      "text": "Marco Hirsch, Jingyuan Cheng, Attila Reiss, Mathias Sundholm, Paul Lukowicz, and Oliver Amft. 2014. Hands-free gesture control with a capacitive textile neckband. In Proceedings of the 2014 ACM International CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK P. Gallego Cascón et al. Symposium on Wearable Computers. ACM, 55--58.  ",
      "doi": "10.1145/2634317.2634328"
    },
    {
      "text": "Thomas Hueber, Elie-Laurent Benaroya, Gérard Chollet, Bruce Denby, Gérard Dreyfus, and Maureen Stone. 2010. Development of a silent speech interface driven by ultrasound and optical images of the tongue and lips. Speech Communication 52, 4 (2010), 288--300.  ",
      "doi": "10.1016/j.specom.2009.11.004"
    },
    {
      "text": "Thomas Hueber, Gérard Chollet, Bruce Denby, Gérard Dreyfus, and Maureen Stone. 2007. Continuous-speech phone recognition from ultrasound and optical images of the tongue and lips. In Eighth Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "Thomas Hueber, Gérard Chollet, Bruce Denby, Gérard Dreyfus, and Maureen Stone. 2008. Phone recognition from ultrasound and optical video sequences for a silent speech interface. In Ninth Annual Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "Thomas Hueber, Gérard Chollet, Bruce Denby, and Maureen Stone. 2008. Acquisition of ultrasound, video and acoustic speech data for a silent-speech interface application. Proc. of ISSP (2008), 365--369.",
      "doi": ""
    },
    {
      "text": "Xueliang Huo, Jia Wang, and Maysam Ghovanloo. 2008. A magnetoinductive sensor based wireless tongue-computer interface. IEEE transactions on neural systems and rehabilitation engineering 16, 5 (2008), 497--504.",
      "doi": ""
    },
    {
      "text": "IntegraMouse+. 2011. Retrieved August 22, 2018 from https://www. integramouse.com/en/home/.",
      "doi": ""
    },
    {
      "text": "Apple iOS Siri. 2010. Retrieved August 15, 2018 from https://www. apple.com/ios/siri/.",
      "doi": ""
    },
    {
      "text": "Jouse3. Retrieved August 28, 2018 from http://www.compusult.net/ web/guest/assistive-technology/our-at-products/jouse3.",
      "doi": ""
    },
    {
      "text": "Arnav Kapur, Shreyas Kapur, and Pattie Maes. 2018. AlterEgo: A Personalized Wearable Silent Speech Interface. In 23rd International Conference on Intelligent User Interfaces. ACM, 43--53.  ",
      "doi": "10.1145/3172944.3172977"
    },
    {
      "text": "Dacher Keltner and Brenda N Buswell. 1997. Embarrassment: its distinct form and appeasement functions. Psychological bulletin 122, 3 (1997), 250.",
      "doi": ""
    },
    {
      "text": "Hyeonseok Kim, Heon Jeong, and Jaehyo Kim. 2016. Feasibility of Hands-Free Smart-Device Interface for Quadriplegic Patients. International Information Institute (Tokyo). Information 19, 9A (2016), 3835.",
      "doi": ""
    },
    {
      "text": "Jeonghee Kim, Hangue Park, Joy Bruce, Erica Sutton, Diane Rowles, Deborah Pucci, Jaimee Holbrook, Julia Minocha, Beatrice Nardone, Dennis West, et al. 2013. The tongue enables computer and wheelchair control for people with spinal cord injury. Science translational medicine 5, 213 (2013), 213ra166--213ra166.",
      "doi": ""
    },
    {
      "text": "Koichi Kuzume. 2010. Input device for disabled persons using expiration and tooth-touch sound signals. In Proceedings of the 2010 ACM Symposium on Applied Computing. ACM, 1159--1164.  ",
      "doi": "10.1145/1774088.1774335"
    },
    {
      "text": "Wenshi Li. 2016. Silent speech interface design methodology and case study. Chinese Journal of Electronics 25, 1 (2016), 88--92.",
      "doi": ""
    },
    {
      "text": "Zheng Li, Ryan Robucci, Nilanjan Banerjee, and Chintan Patel. 2015. Tongue-n-cheek: non-contact tongue gesture recognition. In Proceedings of the 14th International Conference on Information Processing in Sensor Networks. ACM, 95--105.  ",
      "doi": "10.1145/2737095.2737109"
    },
    {
      "text": "Roman Lissermann, Jochen Huber, Aristotelis Hadjakos, Suranga Nanayakkara, and Max Mühlhäuser. 2014. EarPut: Augmenting Earworn Devices for Ear-based Interaction. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, New York, NY, USA, 300--307.  ",
      "doi": "10.1145/2686612.2686655"
    },
    {
      "text": "Bluetooth low-energy transceiver nRF51822. https://www.nordicsemi.com/eng/Products/Bluetooth-lowenergy/nRF51822.",
      "doi": ""
    },
    {
      "text": "Michael J Lyons, Michael Haehnel, and Nobuji Tetsutani. 2003. Designing, playing, and performing with a vision-based mouth interface. In Proceedings of the 2003 conference on New interfaces for musical expression. National University of Singapore, 116--121. ",
      "doi": "10.5555/1085714.1085742"
    },
    {
      "text": "Denys JC Matthies. 2013. InEar BioFeedController: a headset for handsfree and eyes-free interaction with mobile devices. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1293--1298.  ",
      "doi": "10.1145/2468356.2468587"
    },
    {
      "text": "Denys JC Matthies, Simon T Perrault, Bodo Urban, and Shengdong Zhao. 2015. Botential: Localizing on-body gestures by measuring electrical signatures on the human skin. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 207--216.  ",
      "doi": "10.1145/2785830.2785859"
    },
    {
      "text": "Denys JC Matthies, Bernhard A Strecker, and Bodo Urban. 2017. Earfeldsensing: a novel in-ear electric feld sensing to enrich wearable gesture input through facial expressions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1911--1922.  ",
      "doi": "10.1145/3025453.3025692"
    },
    {
      "text": "Denys J. C. Matthies. 2017. Refexive Interaction - Extending Peripheral Interaction by Augmenting Humans. PhD Thesis. University of Rostock.",
      "doi": ""
    },
    {
      "text": "Jess McIntosh, Asier Marzo, and Mike Fraser. 2017. SensIR: Detecting Hand Gestures with a Wearable Bracelet using Infrared Transmission and Refection. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 593--597.  ",
      "doi": "10.1145/3126594.3126604"
    },
    {
      "text": "Rowland S Miller. 1995. On the nature of embarrassabllity: Shyness, social evaluation, and social skill. Journal of personality 63, 2 (1995), 315--339.",
      "doi": ""
    },
    {
      "text": "Tamer Mohamed and Lin Zhong. 2006. Teethclick: Input with teeth clacks. Technical Report. Technical Report. Rice University.",
      "doi": ""
    },
    {
      "text": "Calkin S Montero, Jason Alexander, Mark T Marshall, and Sriram Subramanian. 2010. Would you do that?: understanding social acceptance of gestural interfaces. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services. ACM, 275--278.  ",
      "doi": "10.1145/1851600.1851647"
    },
    {
      "text": "Aarthi Easwara Moorthy. 2013. Voice activated personal assistant: Privacy concerns in the public space. California State University, Long Beach.",
      "doi": ""
    },
    {
      "text": "Imad Mougharbel, Racha El-Hajj, Houda Ghamlouch, and Eric Monacelli. 2013. Comparative study on diferent adaptation approaches concerning a sip and puf controller for a powered wheelchair. In Science and Information Conference (SAI), 2013. IEEE, 597--603.",
      "doi": ""
    },
    {
      "text": "Sip n-Puf from Origin Instruments. Retrieved August 24, 2018 from http://www.orin.com.",
      "doi": ""
    },
    {
      "text": "Lotte NS Andreasen Struijk, Eugen R Lontis, Michael Gaihede, Hector A Caltenco, Morten Enemark Lund, Henrik Schioeler, and Bo Bentsen. 2017. Development and functional demonstration of a wireless intraoral inductive tongue computer interface for severely disabled persons. Disability and Rehabilitation: Assistive Technology 12, 6 (2017), 631--640.",
      "doi": ""
    },
    {
      "text": "Georg Ogris, Paul Lukowicz, Thomas Stiefmeier, and Gerhard Tröster. 2012. Continuous activity recognition in a maintenance scenario: combining motion sensors and ultrasonic hands tracking. Pattern analysis and applications 15, 1 (2012), 87--111.  ",
      "doi": "10.1007/s10044-011-0216-z"
    },
    {
      "text": "Naoshi Ooba, Kazuma Aoyama, Hiromi Nakamura, and Homei and Miyashita. 2018. Unlimited Electric Gum: A Piezo-based Electric Taste Apparatus Activated by Chewing. In Adjunct Prublication of the 31st ACM User Interface Software and Technology Symposium (UIST '18. ACM.  ",
      "doi": "10.1145/3266037.3271635"
    },
    {
      "text": "Hangue Park and Maysam Ghovanloo. 2014. An arch-shaped intraoral tongue drive system with built-in tongue-computer interfacing SoC. Sensors 14, 11 (2014), 21565--21587.",
      "doi": ""
    },
    {
      "text": "Thomas Ricker. 2016. First Click: When new tech is just too embarrassing to use. Retrieved August 28, 2018 from https://www.theverge. com/2016/11/2/13496330/embarrassing-technology.",
      "doi": ""
    },
    {
      "text": "Marie-Christine Rousseau, Karine Baumstarck, Marine Alessandrini, Véronique Blandin, Thierry Billette de Villemeur, and Pascal Auquier. 2015. Quality of life in patients with locked-in syndrome: Evolution over a 6-year period. Orphanet journal of rare diseases 10, 1 (2015), 88. ChewIt. An Intraoral Interface for Discreet Interactions",
      "doi": ""
    },
    {
      "text": "Himanshu Sahni, Abdelkareem Bedri, Gabriel Reyes, Pavleen Thukral, Zehua Guo, Thad Starner, and Maysam Ghovanloo. 2014. The tongue and ear interface: a wearable system for silent speech recognition. In Proceedings of the 2014 ACM International Symposium on Wearable Computers. ACM, 47--54.  ",
      "doi": "10.1145/2634317.2634322"
    },
    {
      "text": "Chris Salem and Shumin Zhai. 1997. An isometric tongue pointing device. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 538--539.  ",
      "doi": "10.1145/258549.259021"
    },
    {
      "text": "T Scott Saponas, Daniel Kelly, Babak A Parviz, and Desney S Tan. 2009. Optically sensing tongue gestures for computer input. In Proceedings of the 22nd annual ACM symposium on User interface software and technology. ACM, 177--180.  ",
      "doi": "10.1145/1622176.1622209"
    },
    {
      "text": "Ronit Slyper, Jill Lehman, Jodi Forlizzi, and Jessica Hodgins. 2011. A tongue input device for creating conversations. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 117--126.  ",
      "doi": "10.1145/2047196.2047210"
    },
    {
      "text": "Lotte NS Andreasen Struijk. 2006. An inductive tongue computer interface for control of computers and assistive devices. IEEE Transactions on biomedical Engineering 53, 12 (2006), 2594--2597.",
      "doi": ""
    },
    {
      "text": "Lotte NS Andreasen Struijk, Line Lindhardt Egsgaard, Romulus Lontis, Michael Gaihede, and Bo Bentsen. 2017. Wireless intraoral tongue control of an assistive robotic arm for individuals with tetraplegia. Journal of neuroengineering and rehabilitation 14, 1 (2017), 110.",
      "doi": ""
    },
    {
      "text": "Ke Sun, Chun Yu, and Lanand Shi Yuanchun Shi, Weinanand Liu. 2018. Lip-Interact: Improving Mobile Device Interaction with Silent Speech Commands. In Proceedings of the 31st ACM User Interface Software and Technology Symposium (UIST '18). ACM.  ",
      "doi": "10.1145/3242587.3242599"
    },
    {
      "text": "Li Sun, Souvik Sen, Dimitrios Koutsonikolas, and Kyu-Han Kim. 2015. Widraw: Enabling hands-free drawing in the air on commodity wif devices. In Proceedings of the 21st Annual International Conference on Mobile Computing and Networking. ACM, 77--89.  ",
      "doi": "10.1145/2789168.2790129"
    },
    {
      "text": "Lin Sun, Daqing Zhang, Bin Li, Bin Guo, and Shijian Li. 2010. Activity recognition on an accelerometer embedded mobile phone with varying positions and orientations. In International conference on ubiquitous intelligence and computing. Springer, 548--562. ",
      "doi": "10.5555/1929661.1929712"
    },
    {
      "text": "Paul Swain. 2008. The future of wireless capsule endoscopy. World journal of gastroenterology: WJG 14, 26 (2008), 4142. CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK",
      "doi": ""
    },
    {
      "text": "Medtronic Pillcam Colon 2 System. Retrieved August 20, 2018 from http://www.medtronic.com/covidien/en-us/products/ capsule-endoscopy/pillcam-colon-2-system.html.",
      "doi": ""
    },
    {
      "text": "Hui Tang and David J Beebe. 2006. An oral tactile interface for blind navigation. IEEE Transactions on Neural Systems and Rehabilitation Engineering 14, 1 (2006), 116--123.",
      "doi": ""
    },
    {
      "text": "Kathryn G Tippey, Elayaraj Sivaraj, and Thomas K Ferris. 2017. Driving while interacting with Google Glass: Investigating the combined efect of head-up display and hands-free input on driving safety and multitask performance. Human factors 59, 4 (2017), 671--688.",
      "doi": ""
    },
    {
      "text": "KW Tyson. 1998. Monitoring the state of the occlusion--gnathosonics can be reliable. Journal of oral rehabilitation 25, 5 (1998), 395--402.",
      "doi": ""
    },
    {
      "text": "Michael Wand, Christopher Schulte, Matthias Janke, and Tanja Schultz. 2013. Array-based Electromyographic Silent Speech Interface. In BIOSIGNALS. 89--96.",
      "doi": ""
    },
    {
      "text": "Jun Wang, Ashok Samal, and Jordan R Green. 2014. Preliminary test of a real-time, interactive silent speech interface based on electromagnetic articulograph. (2014).",
      "doi": ""
    },
    {
      "text": "David M Watt. 1966. Clinical applications of gnathosonics. Journal of Prosthetic Dentistry 16, 1 (1966), 83--95.",
      "doi": ""
    },
    {
      "text": "David M Watt. 1966. Gnathosonics - a study of sounds produced by the masticatory mechanism. Journal of Prosthetic Dentistry 16, 1 (1966), 73--82.",
      "doi": ""
    },
    {
      "text": "Jing Yang, Eun-Seok Choi, Wook Chang, Won-Chul Bang, Sung-Jung Cho, Jong-Koo Oh, Joon-Kee Cho, and Dong-Yoon Kim. 2004. A novel hand gesture input device based on inertial sensing technique. In Industrial Electronics Society, 2004. IECON 2004. 30th Annual Conference of IEEE, Vol. 3. IEEE, 2786--2791.",
      "doi": ""
    },
    {
      "text": "Shuozhi Yang and Qingguo Li. 2012. IMU-based ambulatory walking speed estimation in constrained treadmill and overground walking. Computer methods in biomechanics and biomedical engineering 15, 3 (2012), 313--322.",
      "doi": ""
    },
    {
      "text": "Qiao Zhang, Shyamnath Gollakota, Ben Taskar, and Raj PN Rao. 2014. Non-intrusive tongue machine interface. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2555--2558.  ",
      "doi": "10.1145/2556288.2556981"
    }
  ]
}