{
  "doi": "10.1145/3290605.3300524",
  "title": "Frequency-Based Design of Smart Textiles",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Despite the increasing amount of smart textile design practitioners, the methods and tools commonly available have not progressed to the same scale. Most smart textile interaction designs today rely on detecting changes in resistance. The tools and sensors for this are generally limited to DC-voltage-divider based sensors and multimeters. Furthermore, the textiles and the materials used in smart textile design can exhibit behaviour making it difficult to identify even simple interactions using those means. For instance, steel-based textiles exhibit intrinsic semiconductive properties that are difficult to identify with current methods. In this paper, we show an alternative way to measure interaction with smart textiles. By relying on visualisation known as Lissajous-figures and frequency-based signals, we can detect even subtle and varied forms of interaction with smart textiles. We also show an approach to measuring frequency-based signals and present an Arduino-based system called Teksig to support this type of textile practice.",
  "authors": [
    {
      "name": "Jussi Mikkonen",
      "institution": "Syddansk Universitet, Kolding, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314494677",
      "orcid": "missing"
    },
    {
      "name": "Riikka Townsend",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365969",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "{n. d.}. Wiring the Circuit | Capacitive Touch with Conductive Fabric & Flora | Adafruit Learning System. https://learn.adafruit.com/capacitivetouch-with-conductive-fabric-and-flora/wiring-the-circuit.",
      "doi": ""
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 423--432.  ",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "J. Decaens and O. Vermeersch. 2018. 12 - Specific Testing for Smart Textiles. In Advanced Characterization and Testing of Textiles, Patricia Dolez, Olivier Vermeersch, and Valério Izquierdo (Eds.). Woodhead Publishing, 351--374.",
      "doi": ""
    },
    {
      "text": "Tilak Dias and Anura Fernando. 2010. Yarn with Embedded Sensor or Processing Device. CIB: D02G3/40; D02G3/44.",
      "doi": ""
    },
    {
      "text": "Guido Gioberto. 2013. Measuring Joint Movement Through GarmentIntegrated Wearable Sensing. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (UbiComp '13 Adjunct). ACM, New York, NY, USA, 331--336.  ",
      "doi": "10.1145/2494091.2501085"
    },
    {
      "text": "Martha Glazzard and Sarah Kettley. 2010. Knitted Stretch Sensors for Sound Output. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10). ACM, New York, NY, USA, 391--392.  ",
      "doi": "10.1145/1709886.1709994"
    },
    {
      "text": "Stephan Gorgutsa, Jian Feng Gu, and Maksim Skorobogatiy. 2012. A Woven 2D Touchpad Sensor and a 1D Slide Sensor Using Soft Capacitor Fibers. Smart Materials and Structures 21, 1 (2012), 015010.",
      "doi": ""
    },
    {
      "text": "Ramyah Gowrishankar, Katharina Bredies, and Salu Ylirisku. 2017. A Strategy for Material-Specific e-Textile Interaction Design. In Smart Textiles: Fundamentals, Design, and Interaction, Stefan Schneegass and Oliver Amft (Eds.). Springer International Publishing, Cham, 233--257.",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S. Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3293--3315.  ",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Juan Haladjian, Katharina Bredies, and Bernd Brügge. 2016. Interactex: An Integrated Development Environment for Smart Textiles. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (ISWC '16). ACM, New York, NY, USA, 8--15.  ",
      "doi": "10.1145/2971763.2971776"
    },
    {
      "text": "Nur Al-huda Hamdan, Florian Heller, Chat Wacharamanotham, Jan Thar, and Jan Borchers. 2016. Grabrics: A Foldable Two-Dimensional Textile Input Controller. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2497--2503.  ",
      "doi": "10.1145/2851581.2892529"
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. 2018. Sketch&Stitch: Interactive Embroidery for E-Textiles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 82:1--82:13.  ",
      "doi": "10.1145/3173574.3173656"
    },
    {
      "text": "Florian Heller, Stefan Ivanov, Chat Wacharamanotham, and Jan Borchers. 2014. FabriTouch: Exploring Flexible Touch Input on Textiles. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, New York, NY, USA, 59--62.  ",
      "doi": "10.1145/2634317.2634345"
    },
    {
      "text": "Yingdan Huang and Michael Eisenberg. 2011. Steps Toward ChildDesigned Interactive Stuffed Toys. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC '11). ACM, New York, NY, USA, 165--168.  ",
      "doi": "10.1145/1999030.1999052"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: Eyes-Free Continuous Input on Interactive Clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1313--1322.  ",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Sarah Kettley. 2016. Designing with Smart Textiles. Vol. 56. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Aline Martinez, Michaela Honauer, Hauke Sandhaus, and Eva Hornecker. 2018. Smart Textiles in the Performing Arts. In Textiles, Identity and Innovation: Design the Future: Proceedings of the 1st International Textile Design Conference (D_TEX 2017), November 2--4, 2017, Lisbon, Portugal. CRC Press, 311. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK J. Mikkonen and R. Townsend",
      "doi": ""
    },
    {
      "text": "Jussi Mikkonen and Emmi Pouta. 2015. Weaving Electronic Circuit into Two-Layer Fabric. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, Osaka, Japan, 245--248.  ",
      "doi": "10.1145/2800835.2800936"
    },
    {
      "text": "Jussi Mikkonen and Emmi Pouta. 2016. Flexible Wire-Component for Weaving Electronic Textiles. In 2016 IEEE 66th Electronic Components and Technology Conference (ECTC). 1656--1663.",
      "doi": ""
    },
    {
      "text": "Amon Millner and Edward Baafi. 2011. Modkit: Blending and Extending Approachable Platforms for Creating Computer Programs and Interactive Objects. In Proceedings of the 10th International Conference on Interaction Design and Children (IDC '11). ACM, New York, NY, USA, 250--253.  ",
      "doi": "10.1145/1999030.1999074"
    },
    {
      "text": "Olivia Ojuroye, Russel Torah, Steve Beeby, and Adriana Wilde. 2016. Autonomy Is the Key: From Smart Towards Intelligent Textiles. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 678--681.  ",
      "doi": "10.1145/2968219.2968558"
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, and Michael Haller. 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA, 745--756.  ",
      "doi": "10.1145/3242587.3242664"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: Real-Time Sensing of Surface and Deformation Gestures on Flexible, Interactive Textiles, Using a Hybrid Gesture Detection Pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 565--577.  ",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Hannah Perner-Wilson. 2011. Tools for E-Textile Techniques. http://www.plusea.at/?p=2220.",
      "doi": ""
    },
    {
      "text": "Anna Persson. 2013. Exploring Textiles as Materials for Interaction Design. Doctoral Thesis, Monograph. University of Borås. 4.",
      "doi": ""
    },
    {
      "text": "Irene Posch and Geraldine Fitzpatrick. 2018. Integrating Textile Materials with Electronic Making: Creating New Tools and Practices. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, New York, NY, USA, 158--165.  ",
      "doi": "10.1145/3173225.3173255"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Kanjun Qiu, Leah Buechley, Edward Baafi, and Wendy Dubow. 2013. A Curriculum for Teaching Computer Science Through Computational Textiles. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, New York, USA, 20--27.  ",
      "doi": "10.1145/2485760.2485787"
    },
    {
      "text": "Paul Strohmeier, Jarrod Knibbe, Sebastian Boring, and Kasper Hornb\\a ek. 2018. zPatch: Hybrid Resistive/Capacitive eTextile Input. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, New York, NY, USA, 188--198.  ",
      "doi": "10.1145/3173225.3173242"
    },
    {
      "text": "Riikka Townsend, Antti J. Karttunen, Maarit Karppinen, and Jussi Mikkonen. 2017. The Cross-Section of a Multi-Disciplinary Project in View of Smart Textile Design Practice. Journal of Textile Design Research and Practice 5, 2 (2017), 175--207.",
      "doi": ""
    },
    {
      "text": "Riikka Townsend and Jussi Mikkonen. 2017. Signals as Materials: From Knitting Sensors to Sensory Knits. In Proceedings of DRS Special Interest Group on Experiential Knowledge (EKSIG'17). TU Delft Open, Rotterdam, Netherlands, 338--358.",
      "doi": ""
    },
    {
      "text": "Anita Vogl, Patrick Parzer, Teo Babic, Joanne Leong, Alex Olwal, and Michael Haller. 2017. StretchEBand: Enabling Fabric-Based Interactions Through Rapid Fabrication of Textile Stretch Sensors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2617--2627.  ",
      "doi": "10.1145/3025453.3025938"
    },
    {
      "text": "Wei Weng, Peining Chen, Sisi He, Xuemei Sun, and Huisheng Peng. 2016. Smart Electronic Textiles. Angewandte Chemie International Edition 55, 21 (2016), 6140--6169.",
      "doi": ""
    }
  ]
}