{
  "doi": "10.1145/3290605.3300586",
  "title": "Witchcraft and HCI: Morality, Modernity, and Postcolonial Computing in Rural Bangladesh",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "While Human-Computer Interaction (HCI) research on health and well-being is increasingly becoming more aware and inclusive of its social and political dimensions, spiritual practices are still largely overlooked there. For a large number of people around the world, especially in the global south, witchcraft, sorcery, and other occult practices are the primary means of achieving health, wealth, satisfaction, and happiness. Building on an eight-month long ethnography in six villages in Jessore, Bangladesh, this paper explores the knowledge, materials, and politics involved in the local witchcraft practices there. By drawing from a rich body of anthropological work on witchcraft, this paper discusses how those findings contribute to the broader issues in HCI around morality, modernity, and postcolonial computing. This paper concludes by recommending ways for smooth integration of traditional occult practices with HCI through design and policy. We argue for occult practices as an under-appreciated site for HCI to learn how to combat ideological hegemony.",
  "tags": [
    "rural",
    "faith",
    "ictd",
    "witchcraft",
    "wellbeing",
    "postcolonial"
  ],
  "authors": [
    {
      "name": "Sharifa Sultana",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261900",
      "orcid": "0000-0003-2906-7391"
    },
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    }
  ],
  "references": [
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital Privacy Challenges with Shared Mobile Phone Use in Bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 17.  ",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md Rashidujjaman Rifat, ASM Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A platform for fighting sexual harassment in urban Bangladesh. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2695-- 2704.  ",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, and Md Rashidujjaman Rifat. 2015. Learning to fix: knowledge, collaboration and mobile phone repair in Dhaka, Bangladesh. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, 4.  ",
      "doi": "10.1145/2737856.2738018"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Nusrat Jahan Mim, and Steven J Jackson. 2015. Residual mobilities: infrastructural displacement and post-colonial computing in Bangladesh. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 437--446.  ",
      "doi": "10.1145/2702123.2702573"
    },
    {
      "text": "Adu Akosua. 2014. Ebola: Human Rights Group Warns Disease Is Not Caused By Witchcra,. https://web:archive:org/web/20140903134240/ http://www:theghana-italynews:com/index:php/component/k2/ item/955-ebola-human-rights-group-warns-disease-is-not-causedby- witchcra?. (2014).",
      "doi": ""
    },
    {
      "text": "Jorge Mendoza Aldana, Helga Piechulek, and Ahmed Al-Sabir. 2001. Client satisfaction and quality of health care in rural Bangladesh. Bulletin of the World Health Organization 79 (2001), 512--517.",
      "doi": ""
    },
    {
      "text": "Morgan G Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A Mellis, and Daniela K Rosner. 2014. Making cultures: empowerment, participation, and democracy-or not?. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Morgan G Ames, Daniela K Rosner, and Ingrid Erickson. 2015.Worship, faith, and evangelism: Religion as an ideological lens for engineering worlds. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 69--81.  ",
      "doi": "10.1145/2675133.2675282"
    },
    {
      "text": "Silvia Lindtner Shaowen Bardzell Jeffrey Bardzell Lily Nguyen Syed Ishtiaque Ahmed Nusrat Jahan Steven J. Jackson Ames, Morgan G. and Paul Dourish. 2018. Making or Making Do? Challenging the Mythologies of Making and Hacking. Journal of Peer Production 12 (2018), 21pp.",
      "doi": ""
    },
    {
      "text": "Greg G Armfield and R Lance Holbert. 2003. The relationship between religiosity and Internet use. Journal of Media and Religion 2, 3 (2003), 129--144.",
      "doi": ""
    },
    {
      "text": "David Arnold. 1993. Colonizing the body: State medicine and epidemic disease in nineteenth-century India. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is critical about critical design?. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 3297--3306.  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Genevieve Bell. 2006. No more SMS from Jesus: ubicomp, religion and techno-spiritual practices. In International Conference on Ubiquitous Computing. Springer, 141--158.  ",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Seyla Benhabib. 1992. Situating the self: Gender, community, and postmodernism in contemporary ethics. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Marshall Berman. 1983. All that is solid melts into air: The experience of modernity. Verso.",
      "doi": ""
    },
    {
      "text": "Nicola J Bidwell, Heike Winschiers-Theophilus, Gereon Koch Kapuire, and Mathias Rehm. 2011. Pushing personhood into place: Situating media in rural knowledge in Africa. International Journal of Human- Computer Studies 69, 10 (2011), 618--631.  ",
      "doi": "10.1016/j.ijhcs.2011.02.002"
    },
    {
      "text": "Nicola J Bidwell, Heike Winschiers-eophilus, Gereon Koch-Kapuire, and Shilumbe Chivuno-Kuria. 2011. Situated interactions between audiovisual media and African herbal lore. Personal and Ubiquitous Computing 15, 6 (2011), 609--627.  ",
      "doi": "10.1007/s00779-010-0337-1"
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Brenda E Brasher. 2001. Give me that online religion. John Wiley & Sons, Inc. ",
      "doi": "10.5555/515789"
    },
    {
      "text": "Elizabeth Buie and Mark Blythe. 2013. Meditations on YouTube. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces. ACM, 41--50.  ",
      "doi": "10.1145/2513506.2513511"
    },
    {
      "text": "Elizabeth Buie and Mark Blythe. 2013. Spirituality: there's an app for that!(but not a lot of research). In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 2315--2324.  ",
      "doi": "10.1145/2468356.2468754"
    },
    {
      "text": "Andrew Campbell and Tanzeem Choudhury. 2012. From smart to cognitive phones. IEEE Pervasive Computing 11, 3 (2012), 7--11.  ",
      "doi": "10.1109/MPRV.2012.41"
    },
    {
      "text": "Larry Chan, Vedant Das Swain, Christina Kelley, Kaya de Barbaro, Gregory D Abowd, and Lauren Wilcox. 2018. Students' Experiences with Ecological Momentary Assessment Tools to Report on Emotional Well-being. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (2018), 3.  ",
      "doi": "10.1145/3191735"
    },
    {
      "text": "PH Cheong. 2014. Religion and the Internet: Understanding digital religion, social media and culture. Religion and American Cultures: An Encyclopedia of Traditions, Diversity and Popular Expressions (2014), 1215--1236.",
      "doi": ""
    },
    {
      "text": "Padma Chirumamilla and Joyojeet Pal. 2013. Play and power: a ludic design proposal for ICTD. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. ACM, 25--33.  ",
      "doi": "10.1145/2516604.2516628"
    },
    {
      "text": "David Coyle, Conor Linehan, Karen Tang, and Sian Lindley. 2012. Interaction design and emotionalwellbeing. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 2775--2778.  ",
      "doi": "10.1145/2212776.2212718"
    },
    {
      "text": "Andy Dearden. 2012. See no evil?: ethics in an interventionist ICTD. In Proceedings of the fifth international conference on information and communication technologies and development. ACM, 46--55.  ",
      "doi": "10.1145/2160673.2160680"
    },
    {
      "text": "Andy Dearden and William D Tucker. 2015. The ethical limits of bungee research in ICTD. In Technology and Society (ISTAS), 2015 IEEE International Symposium on. IEEE, 1--6.",
      "doi": "10.1109/ISTAS.2015.7439430"
    },
    {
      "text": "Brian DeRenzi, Nicola Dell, Jeremy Wacksman, Sco Lee, and Neal Lesh. 2017. Supporting community health workers in India through voice-and web-based feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2770--2781.  ",
      "doi": "10.1145/3025453.3025514"
    },
    {
      "text": "Brian DeRenzi, Leah Findlater, Jonathan Payne, Benjamin Birnbaum, Joachim Mangilima, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving community health worker performance through automated SMS. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. ACM, 25--34.  ",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. The MIT Press. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hr¨onn Brynjarsd´oir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Jessore District. 2018. District at a Glance. http://www:jessore:gov:bd/ site/page/bf48b263--1c4a-11e7--8f57--286ed488c766/District%20at% 20a%20Glance. (2018).",
      "doi": ""
    },
    {
      "text": "Leslie Dodson and S Revi Sterling. 2012. Ethics of Participation: Research or Reporting? The Electronic Journal of Information Systems in Developing Countries 50, 1 (2012), 1--14.",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Scott D Mainwaring. 2012. Ubicomp's colonial impulse. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 133--142.  ",
      "doi": "10.1145/2370216.2370238"
    },
    {
      "text": "Shmuel Noah Eisenstadt. 2000. Multiple modernities. Daedalus 129, 1 (2000), 1--29.",
      "doi": ""
    },
    {
      "text": "Edward E Evans-Pritchard. 1937. Witchcraft, oracles and magic among the Azande. Vol. 12. Oxford London.",
      "doi": ""
    },
    {
      "text": "Andrew Feenberg. 1995. Alternative modernity: The technical turn in philosophy and social theory. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Cyprian F Fisiy and Peter Geschiere. 1991. Sorcery, witchcraft and accumulation: regional variations in south and west Cameroon. Critique of Anthropology 11, 3 (1991), 251--278.",
      "doi": ""
    },
    {
      "text": "Cyprian F Fisiy and Peter Geschiere. 2001. Witchcraft, development and paranoia in Cameroon. Magical Interpretations, Material Realities. London and New York: Routledge (2001), 226--246.",
      "doi": ""
    },
    {
      "text": "Peter Geschiere. 2013. Witchcraft, intimacy, and trust: Africa in comparison. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Anthony Giddens. 2013. The consequences of modernity. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Carma R Gorman. 2009. Religion on demand: Faith-based design. Design and Culture 1, 1 (2009), 9--22.",
      "doi": ""
    },
    {
      "text": "Melissa Gregg. 2013. Work's intimacy. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Koen Peeters Grietens, Joan Muela Ribera, Annee Erhart, Sarah Hoibak, Raffaella M Ravinetto, Charlotte Gryseels, Susan Dierickx, Sarah O'Neill, Susanna Hausmann Muela, and Umberto D'Alessandro. 2014. Doctors and vampires in sub-Saharan Africa: ethical challenges in clinical trial research. The American journal of tropical medicine and hygiene 91, 2 (2014), 213--215.",
      "doi": ""
    },
    {
      "text": "Jurgen Habermas and J¨urgen Habermas. 1991. the structural transformation of the public sphere: An inquiry into a category of bourgeois society. MIT press.",
      "doi": ""
    },
    {
      "text": "Michelle Hlubinka, Jennifer Beaudin, Emmanuel Munguia Tapia, and John S An. 2002. AltarNation: interface design for meditative communities. In CHI'02 Extended Abstracts on Human Factors in Computing Systems. ACM, 612--613.  ",
      "doi": "10.1145/506443.506509"
    },
    {
      "text": "Justin Huggler. 2004. The dark side of India, where a witch-doctor's word means death. https://www:independent:co:uk/news/world/ asia/the-dark-side-of-india-where-a-witch-doctors-word-meansdeath- 552084:html. (2004).",
      "doi": ""
    },
    {
      "text": "Raja Rina Raja Ikram, Mohd Khanapi Abd Ghani, and Noraswaliza Abdullah. 2015. An analysis of application of health informatics in Traditional Medicine: A review of four Traditional Medicine Systems. International journal of medical informatics 84, 11 (2015), 988--996.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "William T. Jarvis. 1996. Misuse of the Term \"Allopathy\". https:// www:ncahf :org/articles/a-b/allopathy:html. (1996).",
      "doi": ""
    },
    {
      "text": "Habibul Haque Khondker. 2011. Role of the new media in the Arab Spring. Globalizations 8, 5 (2011), 675--679.",
      "doi": ""
    },
    {
      "text": "Craig Kielburger and Marc. 2008. HIV in Africa: Distinguishing disease from witchcraft. https://www:thestar:com/opinion/columnists/2008/ 02/18/hiv in africa distinguishing disease from witchcra?:html. (2008).",
      "doi": ""
    },
    {
      "text": "Thomas S Kuhn. 2012. The structure of scientific revolutions. University of Chicago press.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 427--436.  ",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Nicholas D Lane, Mashqui Mohammod, Mu Lin, Xiaochao Yang, Hong Lu, Shahid Ali, Afsaneh Doryab, Ethan Berke, Tanzeem Choudhury, and Andrew Campbell. 2011. Bewell: A smartphone application to monitor, model and promote wellbeing. In 5th international ICST conference on pervasive computing technologies for healthcare. 23--26.",
      "doi": ""
    },
    {
      "text": "Kittiya Lee. 2015. Amazons, Wives, Nuns & Witches. Women and the Catholic Church in Colonial Brazil 1500--1822: Native Brazil. Beyond the Convert and the Cannibal, 1500--1900: Amazonian Routes. Indigenous Mobility and Colonial Communities in Northern Brazil. (2015).",
      "doi": ""
    },
    {
      "text": "Brian P Levack. 2015. The witch-hunt in early modern Europe. Routledge.",
      "doi": ""
    },
    {
      "text": "Dan Lockton, David Harrison, and Neville Stanton. 2008. Design with intent: Persuasive technology in a wider context. In International Conference on Persuasive Technology. Springer, 274--278.  ",
      "doi": "10.1007/978-3-540-68504-3_30"
    },
    {
      "text": "Jane J Mansbridge. 1983. Beyond adversary democracy. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Giuseppe Mantovani. 1996. Social context in HCl: A new framework for mental models, cooperation, and communication. Cognitive Science 20, 2 (1996), 237--269.",
      "doi": ""
    },
    {
      "text": "Munyaradzi Mawere. 2011. Possibilities for cultivating African indigenous knowledge systems (IKSs): Lessons from selected cases of witchcraft in Zimbabwe. Journal of Gender and Peace Development 1, 3 (2011), 091--100.",
      "doi": ""
    },
    {
      "text": "Melissa Mazmanian, Marisa Leaving Cohn, and Paul Dourish. 2014. Dynamic Reconfiguration in Planetary Exploration: A Sociomaterial Ethnography. Misarterly 38, 3 (2014), 831--848.  ",
      "doi": "10.25300/MISQ/2014/38.3.09"
    },
    {
      "text": "Diane McIntyre, Michael Thiede, G¨oran Dahlgren, and Margaret Whitehead. 2006. What are the economic consequences for households of illness and of paying for health care in low-and middle-income country contexts? Social science & medicine 62, 4 (2006), 858--865.",
      "doi": ""
    },
    {
      "text": "Samantha Merritt and Shaowen Bardzell. 2011. Postcolonial language and culture theory for HCI4D. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 1675--1680.  ",
      "doi": "10.1145/1979742.1979827"
    },
    {
      "text": "E William Monter. 1982. Enemies of God. The Witch-Hunt in Scotland. (1982).",
      "doi": ""
    },
    {
      "text": "Chantal Mouffe. 1999. DELIBERATIVE DE'MOCRACY OR AGONISTIC PLURALISM? (1999).",
      "doi": ""
    },
    {
      "text": "Michael J Muller, Ellen Christiansen, Bonnie Nardi, and Susan Dray. 2001. Spiritual life and information technology. Commun. ACM 44, 3 (2001), 82--82.  ",
      "doi": "10.1145/365181.365211"
    },
    {
      "text": "Michael J Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24--28.  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Lameck Mwewa and N Bidwell. 2015. African Narratives in Technology Research&Design. At the Intersection of Indigenous and Traditional Knowledge and Technology Design (2015), 353.",
      "doi": ""
    },
    {
      "text": "BBC News. 2014. Ebola outbreak: 'Witchcraft' hampering treatment, says doctor. https://www:bbc:co:uk/news/av/health-28625305/ebolaoutbreak- witchcraft-hampering-treatment-says-doctor. (2014).",
      "doi": ""
    },
    {
      "text": "Francis B Nyamnjoh. 2001. Delusions of development and the enrichment of witchcraft discourses in Cameroon. Magical interpretations, material realities: modernity, witchcraft and the occult in postcolonial Africa (2001), 28--49.",
      "doi": ""
    },
    {
      "text": "Aisling Ann O'Kane, Amy Hurst, Gerrit Niezen, Nicolai Marquardt, Jon Bird, and Gregory Abowd. 2016. Advances in DIY Health and Wellbeing. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3453--3460.  ",
      "doi": "10.1145/2851581.2856467"
    },
    {
      "text": "Jonathan Pearlman. 2013. Papua New Guinea urged to halt witchcraft violence after latest 'sorcery' case. https: //www:telegraph:co:uk/news/worldnews/australiaandthepaci?c/ papuanewguinea/9987294/Papua-New-Guinea-urged-to-haltwitchcra ?-violence-after-latest-sorcery-case:html. (2013).",
      "doi": ""
    },
    {
      "text": "Cathy A Petti, Christopher R Polage, Thomas C Quinn, Allan R Ronald, and Merle A Sande. 2006. Laboratory medicine in Africa: a barrier to effective health care. Clinical Infectious Diseases 42, 3 (2006), 377--382.",
      "doi": ""
    },
    {
      "text": "Cathy A Petti, Christopher R Polage, Thomas C Quinn, Allan R Ronald, and Merle A Sande. 2006. Laboratory medicine in Africa: a barrier to effective health care. Clinical Infectious Diseases 42, 3 (2006), 377--382.",
      "doi": ""
    },
    {
      "text": "Kavita Philip, Lilly Irani, and Paul Dourish. 2012. Postcolonial computing: A tactical survey. Science, Technology, & Human Values 37, 1 (2012), 3--29.",
      "doi": ""
    },
    {
      "text": "The Pluralism Project. 2018. Ancient Roots, Historical Challenges. h?p://pluralism:org/religions/paganism/the-pagan-tradition/ ancient-roots-historical-challenges/. (2018).",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Shahid Ali, Tanzeem Choudhury, and Ethan Berke. 2011. Passive and in-situ assessment of mental and physical wellbeing using mobile sensors. In Proceedings of the 13th international conference on Ubiquitous computing. ACM, 385--394.  ",
      "doi": "10.1145/2030112.2030164"
    },
    {
      "text": "Md. Nojibur Rahman and Golam Mostafa Kamal. 2012. Bangladesh - Population and Housing Census 2011: Socio-Economic and Demographic Report. h?p://203:112:218:66/WebTestApplication/user?les/ Image/BBS/Socio Economic:pdf. (2012).",
      "doi": ""
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing healthworkers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1889--1898.  ",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Divya Ramachandran, Vivek Goswami, and John Canny. 2010. Research and reality: using mobile messages to promote maternal health in rural India. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. ACM, 35.  ",
      "doi": "10.1145/2369220.2369253"
    },
    {
      "text": "Manju Lata Rao, Rustum Roy, Iris R Bell, and Richard Hoover. 2007. The defining role of structure (including epitaxy) in the plausibility of homeopathy. Homeopathy 96, 3 (2007), 175--182.",
      "doi": ""
    },
    {
      "text": "Sanjeev Rastogi. 2010. Building bridges betweenAyurveda and modern science. International journal of Ayurveda research 1, 1 (2010), 41.",
      "doi": ""
    },
    {
      "text": "Rural Reconstruction Foundation. 2017. http://www:rrf-bd:org/. (2017).",
      "doi": ""
    },
    {
      "text": "Edward Said. 1995. W. 1978. orientalism. New York: Pantheon (1995).",
      "doi": ""
    },
    {
      "text": "Amanda Proena Santos. 2017. The witch doctors of northern Peru. h?p://www:bbc:com/travel/story/20170214-the-witch-doctorsof- northern-peru. (2017).",
      "doi": ""
    },
    {
      "text": "Carl Schmitt. 2005. Political theology: Four chapters on the concept of sovereignty. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "PC Sharma, MB Yelne, TJ Dennis, Aruna Joshi, and KV Billore. 2000. Database on medicinal plants used in Ayurveda. (2000).",
      "doi": ""
    },
    {
      "text": "Rosalind Shaw. 1997. The production of witchcraft/witchcraft as production: memory, modernity, and the slave trade in Sierra Leone. American Ethnologist 24, 4 (1997), 856--876.",
      "doi": ""
    },
    {
      "text": "Michael Shirungu. 2015. Preserving 'Mpoyetu' (Our Culture), Contestation and Negotiation of LikukiShipumuna Ritual in Kavango Northeast of Namibia. In At the Intersection of Indigenous and Traditional Knowledge and Technology Design, NJ Bidwell and H Winschiers-eophilus (Eds.). Informing Science Press, 273--282.",
      "doi": ""
    },
    {
      "text": "M Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria H°akansson, Tawanna Dillahunt, and Jennifer Manko. 2014. Next steps for sustainable HCI. interactions 21, 5 (2014), 66--69.  ",
      "doi": "10.1145/2651820"
    },
    {
      "text": "Ram Harsh Singh. 2010. Exploring larger evidence-base for contemporary Ayurveda. International journal of Ayurveda research 1, 2 (2010), 65.",
      "doi": ""
    },
    {
      "text": "Gayatri Spivak and R Guha. 2003. Subaltern studies. Deconstruction: Critical concepts in literary and cultural studies 4 (2003), 220.",
      "doi": ""
    },
    {
      "text": "Gayatri Chakravorty Spivak and others. 1988. Can the subaltern speak? Can the subaltern speak? Reflections on the history of an idea (1988), 21--78.",
      "doi": ""
    },
    {
      "text": "Daily Star. 2018. US-Bangla Plane Crash: 27 Bangladeshis among 49 killed. https://www:thedailystar:net/frontpage/us-bangla-planecrash- 27-bangladeshis-among-49-killed-in-nepal-kathmandu- 1547419. (2018).",
      "doi": ""
    },
    {
      "text": "Rhiannon Sterling and John Zimmerman. 2007. Shared moments: opportunities for mobile phones in religious participation. In Proceedings of the 2007 conference on Designing for User eXperiences. ACM, 15.  ",
      "doi": "10.1145/1389908.1389928"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1990. Open coding. Basics of qualitative research: Grounded theory procedures and techniques 2, 1990 (1990), 101--121.",
      "doi": ""
    },
    {
      "text": "Ilse Truter. 2007. African traditional healers: Cultural and religious beliefs intertwined in a holistic way. South African Pharmaceutical Journal 74, 8 (2007), 56--60.",
      "doi": ""
    },
    {
      "text": "Ben-Erik Van Wyk, B van Oudtshoorn, Nigel Gericke, and others. 1997. Medicinal Plants of South Africa. Briza.",
      "doi": ""
    },
    {
      "text": "Max Weber. 2013. The Protestant ethic and the spirit of capitalism. Routledge.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2018. Zamzam Well. https://en:wikipedia:org/wiki/ Zamzam Well. (2018).",
      "doi": ""
    },
    {
      "text": "AllisonWoodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: it's like mixing technology and religion. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 527--536.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Susan P Wyche, Paul M Aoki, and Rebecca E Grinter. 2008. Replacing faith: reconsidering the secular-religious use divide in the United States and Kenya. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 11--20.  ",
      "doi": "10.1145/1357054.1357057"
    },
    {
      "text": "Susan P Wyche, Kelly E Caine, Benjamin Davison, Micheal Arteaga, and Rebecca E Grinter. 2008. Sun dial: exploring techno-spiritual design through a mobile islamic call to prayer application. In CHI'08 extended abstracts on Human factors in computing systems. ACM, 3411-- 3416.  ",
      "doi": "10.1145/1358628.1358866"
    },
    {
      "text": "Susan P Wyche, Kelly E Caine, Benjamin K Davison, Shwetak N Patel, Michael Arteaga, and Rebecca E Grinter. 2009. Sacred imagery in techno-spiritual design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 55--58.  ",
      "doi": "10.1145/1518701.1518710"
    },
    {
      "text": "Susan P Wyche, Gillian R Hayes, Lonnie D Harvel, and Rebecca E Grinter. 2006. Technology in spiritual formation: an exploratory study of computer mediated religious communications. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 199--208.  ",
      "doi": "10.1145/1180875.1180908"
    }
  ]
}