{
  "doi": "10.1145/3290605.3300323",
  "title": "I Don't Even Have to Bother Them!: Using Social Media to Automate the Authentication Ceremony in Secure Messaging",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "The privacy guaranteed by secure messaging applications relies on users completing an authentication ceremony to verify they are using the proper encryption keys. We examine the feasibility of social authentication, which partially automates the ceremony using social media accounts. We implemented social authentication in Signal and conducted a within-subject user study with 42 participants to compare this with existing methods. To generalize our results, we conducted a Mechanical Turk survey involving 421 respondents. Our results show that users found social authentication to be convenient and fast. They particularly liked verifying keys asynchronously, and viewing social media profiles naturally coincided with how participants thought of verification. However, some participants reacted negatively to integrating social media with Signal, primarily because they distrust social media services. Overall, automating the authentication ceremony and distributing trust with additional service providers is promising, but this infrastructure needs to be more trusted than social media companies.",
  "authors": [
    {
      "name": "Elham Vaziripour",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021015",
      "orcid": "missing"
    },
    {
      "name": "Devon Howard",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367103",
      "orcid": "missing"
    },
    {
      "name": "Jake Tyler",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365885",
      "orcid": "missing"
    },
    {
      "name": "Mark O'Neill",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657905",
      "orcid": "missing"
    },
    {
      "name": "Justin Wu",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022104",
      "orcid": "missing"
    },
    {
      "name": "Kent Seamons",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/do/10.1145/contrib-81100506951/rel-imgonly/fallheadshot.png",
      "acmid": "81100506951",
      "orcid": "missing"
    },
    {
      "name": "Daniel Zappala",
      "institution": "Brigham Young University, Provo, UT, USA",
      "img": "/do/10.1145/contrib-81100095448/rel-imgonly/zappala.jpg",
      "acmid": "81100095448",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "H. Assal, S. Hurtado, A. Imran, and S. Chiasson. What's the deal with privacy apps?: A comprehensive exploration of user perception and usability. In International Conference on Mobile and Ubiquitous Multimedia (MUM). ACM, 2015.  ",
      "doi": "10.1145/2836041.2836044"
    },
    {
      "text": "E. Atwater, C. Bocovich, U. Hengartner, E. Lank, and I. Goldberg. Leading Johnny to water: Designing for usability and trust. In Symposium On Usable Privacy and Security (SOUPS), pages 69--88, Montreal, Canada, 2015. USENIX Association. ",
      "doi": "10.5555/3235866.3235873"
    },
    {
      "text": "S. Dechand, D. Schürmann, T. IBR, K. Busse, Y. Acar, S. Fahl, and M. Smith. An empirical study of textual key-fingerprint representations. In USENIX Security Symposium. USENIX Association, 2016. ",
      "doi": "10.5555/3241094.3241110"
    },
    {
      "text": "A. Herzberg and H. Leibowitz. Can Johnny finally encrypt? Evaluating E2E-encryption in popular IM applications. In Workshop on SocioTechnical Aspects in Security and Trust (STAST), Los Angeles, California, USA, 2016.  ",
      "doi": "10.1145/3046055.3046059"
    },
    {
      "text": "A. Lerner, E. Zeng, and F. Roesner. Confidante: Usable encrypted email: A case study with lawyers and journalists. In Security and Privacy (EuroS&P), 2017 IEEE European Symposium on, pages 385--400. IEEE, 2017.",
      "doi": ""
    },
    {
      "text": "M. S. Melara, A. Blankstein, J. Bonneau, E. W. Felten, and M. J. Freedman. CONIKS: Bringing key transparency to end users. In USENIX Security Symposium, pages 383--398. USENIX Association, 2015. ",
      "doi": "10.5555/2831143.2831168"
    },
    {
      "text": "S. Schröder, M. Huber, D. Wind, and C. Rottermanner. When SIGNAL hits the fan: On the usability and security of state-of-the-art secure mobile messaging. In European Workshop on Usable Security (EuroUSEC), 2016.",
      "doi": ""
    },
    {
      "text": "M. Shirvanian and N. Saxena. On the security and usability of crypto phones. In Proceedings of the 31st Annual Computer Security Applications Conference, pages 21--30. ACM, 2015.  ",
      "doi": "10.1145/2818000.2818007"
    },
    {
      "text": "M. Shirvanian, N. Saxena, and J. J. George. On the pitfalls of end-toend encrypted communications: A study of remote key-fingerprint verification. In Annual Computer Security Applications Conference (ACSAC), pages 499--511. ACM, 2017.  ",
      "doi": "10.1145/3134600.3134610"
    },
    {
      "text": "M. Shirvanian, N. Saxena, and D. Mukhopadhyay. Short voice imitation man-in-the-middle attacks on crypto phones: Defeating humans and machines. Journal of Computer Security, (Preprint):1--23, 2018.",
      "doi": ""
    },
    {
      "text": "J. Tan, L. Bauer, J. Bonneau, L. F. Cranor, J. Thomas, and B. Ur. Can unicorns help users compare crypto key fingerprints? In Conference on Human Factors and Computing Systems (CHI), pages 3787--3798. ACM, 2017.  ",
      "doi": "10.1145/3025453.3025733"
    },
    {
      "text": "E. Vaziripour, J. Wu, R. Farahbakhsh, K. Seamons, M. O'Neill, and D. Zappala. A survey of the privacy preferences and practices of iranian users of telegram. In Workshop on Usable Security (USEC), 2018.",
      "doi": ""
    },
    {
      "text": "E. Vaziripour, J. Wu, M. O'Neill, R. Clinton, J. Whitehead, S. Heidbrink, K. Seamons, and D. Zappala. Is that you, Alice? a usability study of the authentication ceremony of secure messaging applications. In Symposium on Usable Privacy and Security (SOUPS), 2017. ",
      "doi": "10.5555/3235924.3235928"
    },
    {
      "text": "E. Vaziripour, J. Wu, M. O'Neill, D. Metro, J. Cockrell, T. Moffett, J. Whitehead, N. Bonner, K. Seamons, and D. Zappala. Action needed! helping users find and complete the authentication ceremony in signal. In Symposium on Usable Privacy and Security (SOUPS), 2018. ",
      "doi": "10.5555/3291228.3291233"
    },
    {
      "text": "J. Wu and D. Zappala. When is a tree really a truck? exploring mental models of encryption. In Symposium on Usable Privacy and Security (SOUPS). USENIX Association, 2018. ",
      "doi": "10.5555/3291228.3291260"
    }
  ]
}