{
  "doi": "10.1145/3290605.3300394",
  "title": "Coding for Outdoor Play: a Coding Platform for Children to Invent and Enhance Outdoor Play Experiences",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Outdoor play is in decline, including its benefits to children's development. Coding, a typically indoor, screen-based activity, can potentially enrich outdoor play, serving as a rule-making medium. We present a coding platform that controls a programmable hardware device, enabling children to technologically-enhance their outdoor play experiences by inventing game ideas, coding them, and playing their games together with their friends. In the evaluation study, 24 children used the system to invent and play outdoor games. Results show children are able to bridge between the different domains of coding and outdoor play. They used the system to modify traditional games and invent new ones, enriching their outdoor experience. Children merged computational concepts with physical game elements, integrated physical outdoor properties as variables in their code, and were excited to see their code come to life. We conclude children can use coding to express their ideas by creating technologically-enhanced outdoor play experiences.",
  "tags": [
    "children",
    "programming",
    "games/play",
    "outdoor play"
  ],
  "authors": [
    {
      "name": "Netta Ofer",
      "institution": "The Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261765",
      "orcid": "0000-0003-2971-2223"
    },
    {
      "name": "Idan David",
      "institution": "The Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659183382",
      "orcid": "missing"
    },
    {
      "name": "Hadas Erel",
      "institution": "The Interdisciplinary Center (IDC) Herzliya, Herzliya, Herzliya, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260836",
      "orcid": "0000-0001-7099-6104"
    },
    {
      "name": "Oren Zuckerman",
      "institution": "The Interdisciplinary Center (IDC) Herzliya, Herzliya, Israel",
      "img": "/do/10.1145/contrib-81100224720/rel-imgonly/oren_h.jpg",
      "acmid": "81100224720",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Habibe Acar. 2014. Learning environments for children in outdoor spaces. Procedia-Social and Behavioral Sciences 141 (2014), 846--853.",
      "doi": ""
    },
    {
      "text": "Tetske Avontuur, Rian De Jong, Eveline Brink, Yves Florack, Iris Soute, and Panos Markopoulos. 2014. Play it our way: customization of game rules in children's interactive outdoor games. In Proceedings of the 2014 conference on Interaction design and children. ACM, 95--104.  ",
      "doi": "10.1145/2593968.2593973"
    },
    {
      "text": "Jon Back, Caspar Heeffer, Susan Paget, Andreas Rau, Eva Lotta Sallnäs Pysander, and Annika Waern. 2016. Designing for Children's Outdoor Play. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 28--38.  ",
      "doi": "10.1145/2901790.2901875"
    },
    {
      "text": "Jon Back, Elena Márquez Segura, and Annika Waern. 2017. Designing for transformative play. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 3 (2017), 18.  ",
      "doi": "10.1145/3057921"
    },
    {
      "text": "Fiona Bailey and Magnus Moar. 2003. The VERTEX project: Designing and populating shared 3D virtual worlds in the primary (elementary) classroom. Computers & Graphics 27, 3 (2003), 353--359.",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Panos Markopoulos, and Yvonne de Kort. 2008. OPOS: an observation scheme for evaluating head-up play. In Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges. ACM, 33--42.  ",
      "doi": "10.1145/1463160.1463165"
    },
    {
      "text": "Valerie Barr and Chris Stephenson. 2011. Bringing computational thinking to K-12: what is Involved and what is the role of the computer science education community? Acm Inroads 2, 1 (2011), 48--54.  ",
      "doi": "10.1145/1929887.1929905"
    },
    {
      "text": "Tilde Bekker and Janienke Sturm. 2009. Stimulating physical and social activity through open-ended play. In Proceedings of the 8th international conference on interaction design and children. ACM, 309--312.  ",
      "doi": "10.1145/1551788.1551869"
    },
    {
      "text": "Tilde Bekker, Janienke Sturm, and Berry Eggen. 2010. Designing playful interactions for social interaction and physical play. Personal and Ubiquitous Computing 14, 5 (2010), 385--396.  ",
      "doi": "10.1007/s00779-009-0264-1"
    },
    {
      "text": "Tilde Bekker, Janienke Sturm, Rik Wesselink, Bas Groenendaal, and Berry Eggen. 2008. Interactive play objects and the effects of openended play on social interaction and fun. In Proceedings of the 2008 International Conference on Advances in Computer Entertainment Technology. ACM, 389--392.  ",
      "doi": "10.1145/1501750.1501841"
    },
    {
      "text": "Gabriela Bento and Gisela Dias. 2017. The importance of outdoor play for young children's healthy development. Porto Biomedical Journal 2, 5 (2017), 157--160.",
      "doi": ""
    },
    {
      "text": "Staffan Björk, Jennica Falk, Rebecca Hansson, and Peter Ljungstrand. 2001. Pirates! Using the Physical World as a Game Board.. In Interact, Vol. 1. 423--430.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Roger Caillois. 2001. Man, play, and games. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Thomas Chatzidimitris, Damianos Gavalas, and Vlasios Kasapakis. 2015. PacMap: transferring PacMan to the physical realm. In Internet of Things. User-Centric IoT. Springer, 139--144.",
      "doi": ""
    },
    {
      "text": "Rhonda Clements. 2004. An investigation of the status of outdoor play. Contemporary issues in early childhood 5, 1 (2004), 68--80.",
      "doi": ""
    },
    {
      "text": "W Clocksin and C Mellish. 2003. Programming in Prolog Using the ISO Standardd, 5<sup>th</sup> ed.",
      "doi": ""
    },
    {
      "text": "Jill Denner, Linda Werner, and Eloy Ortiz. 2012. Computer games created by middle school girls: Can they be used to measure understanding of computer science concepts? Computers & Education 58, 1 (2012), 240--249.  ",
      "doi": "10.1016/j.compedu.2011.08.006"
    },
    {
      "text": "Betsy James DiSalvo, Mark Guzdail, Tom Mcklin, Charles Meadows, Kenneth Perry, Corey Steward, and Amy Bruckman. 2009. Glitch Game Testers: African American Men Breaking Open the Console.. In DiGRA Conference.",
      "doi": ""
    },
    {
      "text": "Andrea A DiSessa. 2001. Changing minds: Computers, learning, and literacy. Mit Press. ",
      "doi": "10.5555/335023"
    },
    {
      "text": "Kenneth S Goldstein. 1971. Strategy in counting out: An ethnographic folklore field study. The study of games (1971), 167--178.",
      "doi": ""
    },
    {
      "text": "Henry Gorman and Lyle E Bourne. 1983. Learning to think by learning LOGO: Rule learning in third-grade computer programmers. Bulletin of the Psychonomic Society 21, 3 (1983), 165--167.",
      "doi": ""
    },
    {
      "text": "Peter Gray. 2011. The decline of play and the rise of psychopathology in children and adolescents. American Journal of Play 3, 4 (2011), 443--463.",
      "doi": ""
    },
    {
      "text": "Hackaball 2018. Hackaball. Retrieved September 27, 2018 from http://www.hackaball.com/",
      "doi": ""
    },
    {
      "text": "Koen Hendrix, Guo Yang, Dirk Van De Mortel, Tim Tijs, and Panos Markopoulos. 2008. Designing a head-up game for children. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction-Volume 1. British Computer Society, 45--53. ",
      "doi": "10.5555/1531514.1531521"
    },
    {
      "text": "Tom Hitron, Idan David, Netta Ofer, Andrey Grishko, Iddo Yehoshua Wald, Hadas Erel, and Oren Zuckerman. 2018. Digital Outdoor Play: Benefits and Risks from an Interaction Design Perspective. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 284.  ",
      "doi": "10.1145/3173574.3173858"
    },
    {
      "text": "Linda Hughes. 1983. Beyond the rules of the game, why are rooie rules nice. The game design reader: A rules of play anthology (1983), 504--516.",
      "doi": ""
    },
    {
      "text": "James H Humphrey. 2012. Child development through sports. Routledge.",
      "doi": ""
    },
    {
      "text": "TF Juster, F Stafford, and H Ono. 2004. Major changes have taken place in how children and teens spend their time: Child development supplement. Ann Arbor, MI: Institute for Social Research, University of Michigan (2004).",
      "doi": ""
    },
    {
      "text": "Abigail R Kimbell, Andrea Schuhmann, and Hutch Brown. 2009. More kids in the woods: Reconnecting Americans with nature. Journal of Forestry 107, 7 (2009), 373--377.",
      "doi": ""
    },
    {
      "text": "Carsten Magerkurth, Adrian David Cheok, Regan L Mandryk, and Trond Nilsen. 2005. Pervasive games: bringing computer entertainment back to the real world. Computers in Entertainment (CIE) 3, 3 (2005), 4--4.  ",
      "doi": "10.1145/1077246.1077257"
    },
    {
      "text": "Remco Magielse and Panos Markopoulos. 2009. HeartBeat: an outdoor pervasive game for children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2181--2184.  ",
      "doi": "10.1145/1518701.1519033"
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The design space of body games: technological, physical, and social design. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 3365--3374.  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Pinar Metin. 2003. The effects of traditional playground equipment design in children's developmental needs. Yayinlanmamis yüksek lisans tezi. Orta Dogu Teknik Üniversitesi, Ankara (2003).",
      "doi": ""
    },
    {
      "text": "Markus Montola, Jaakko Stenros, and Annika Waern. 2009. Pervasive games: theory and design. CRC Press. ",
      "doi": "10.5555/1717294"
    },
    {
      "text": "Netta Ofer, Hadas Erel, Idan David, Tom Hitron, and Oren Zuckerman. 2018. A little bit of coding goes a long way: effects of coding on outdoor play. In Proceedings of the 17th ACM Conference on Interaction Design and Children. ACM, 599--604.  ",
      "doi": "10.1145/3202185.3210782"
    },
    {
      "text": "Seymour Papert. 1980. Mindstorms: Children, computers, and powerful ideas. Basic Books, Inc. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Janet C Read. 2015. Working with Child Participants in Interaction Design. In Human-Computer Interaction. Springer, 655--656.",
      "doi": ""
    },
    {
      "text": "CM Renders, JC Seidell, W Van Mechelen, and RA Hira Sing. 2003. Overgewicht bij kinderen en adolescenten. (2003).",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, et al. 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Randy Sargent, and Brian Silverman. 1996. Programmable bricks: Toys to think with. IBM Systems journal 35, 3.4 (1996), 443--452.  ",
      "doi": "10.1147/sj.353.0443"
    },
    {
      "text": "Katie Salen, Katie Salen Tekinbas, and Eric Zimmerman. 2004. Rules of play: Game design fundamentals. MIT press. ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "Iris Soute and Panos Markopoulos. 2007. Head up games: the games of the future will look more like the games of the past. In IFIP Conference on Human-Computer Interaction. Springer, 404--407. ",
      "doi": "10.5555/1778331.1778375"
    },
    {
      "text": "Iris Soute, Panos Markopoulos, and Remco Magielse. 2010. Head Up Games: combining the best of both worlds by merging traditional and digital play. Personal and Ubiquitous Computing 14, 5 (2010), 435--444.  ",
      "doi": "10.1007/s00779-009-0265-0"
    },
    {
      "text": "Storyball 2018. Storyball - Keeping Children Active & Playful. Retrieved September 27, 2018 from http://www.mystoryball.com/home",
      "doi": ""
    },
    {
      "text": "Katie Salen TekinbasÌg. 2006. The game design reader: A rules of play anthology. MIT press. ",
      "doi": "10.5555/1076617"
    },
    {
      "text": "Jeannette M Wing. 2006. Computational thinking. Commun. ACM 49, 3 (2006), 33--35.  ",
      "doi": "10.1145/1118178.1118215"
    },
    {
      "text": "Jeannette M Wing. 2008. Computational thinking and thinking about computing. Philosophical transactions of the royal society of London A: mathematical, physical and engineering sciences 366, 1881 (2008), 3717--3725.",
      "doi": ""
    }
  ]
}