{
  "doi": "10.1145/3290605.3300542",
  "title": "Modeling the Engagement-Disengagement Cycle of Compulsive Phone Use",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Many smartphone users engage in compulsive and habitual phone checking they find frustrating, yet our understanding of how this phenomenon is experienced is limited. We conducted a semi-structured interview, a think-aloud phone-use demonstration, and a sketching exercise with 39 smartphone users (ages 14-64) to probe their experiences with compulsive phone checking. Their insights revealed a small taxonomy of common triggers that lead up to instances of compulsive phone use and a second set that end compulsive phone use sessions. Though participants expressed frustration with their lack of self-control, they also reported that the activities they engage in during these sessions can be meaningful, which they defined as transcending the current instance of use. Participants said they periodically reflect on their compulsive use and delete apps that drive compulsive checking without providing sufficient meaning. We use these findings to create a descriptive model of the cycle of compulsive checking, and we call on designers to craft experiences that meet users' definition of meaningfulness rather than creating lock-out mechanisms to help them police their own use.",
  "tags": [
    "smartphone",
    "interview",
    "compulsive phone use",
    "self-regulation",
    "habits"
  ],
  "authors": [
    {
      "name": "Jonathan A. Tran",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367010",
      "orcid": "missing"
    },
    {
      "name": "Katie S. Yang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365290",
      "orcid": "missing"
    },
    {
      "name": "Katie Davis",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82858723457",
      "orcid": "missing"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    }
  ],
  "references": [
    {
      "text": "{n. d.}. New Tools to Manage Your Time on Facebook and Instagram | Facebook Newsroom. https://newsroom.fb.com/news/2018/ 08/manage-your-time/",
      "doi": ""
    },
    {
      "text": "{n. d.}. Ofcial YouTube Blog: Tools to Take Charge of Your Digital Wellbeing. https://youtube.googleblog.com/2018/08/ tools-to-take-charge-of-your-digital.html",
      "doi": ""
    },
    {
      "text": "Jamal Al-Menayes. 2015. Dimensions of Social Media Addiction among University Students in Kuwait. Psychology and Behavioral Sciences 4, 1 (2015), 23.",
      "doi": ""
    },
    {
      "text": "Morgan Ames. 2013. Managing mobile multitasking: the culture of iPhones on Stanford campus. CHI '13 (2013), 1487--1498.  ",
      "doi": "10.1145/2441776.2441945"
    },
    {
      "text": "Cecilie Schou Andreassen, Torbjørn Torsheim, Geir Scott Brunborg, and Ståle Pallesen. 2012. Development of a Facebook Addiction Scale. Psychological Reports 110, 2 (apr 2012), 501--517. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, leaving, and (re)lapsing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 3257.  ",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Joël Billieux, Pierre Philippot, Cécile Schmid, Pierre Maurage, Jan De Mol, and Martial Van der Linden. {n. d.}. Is Dysfunctional Use of the Mobile Phone a Behavioural Addiction? Confronting Symptom-Based Versus Process-Based Approaches. Clinical psychology & psychotherapy 22, 5 (jan {n. d.}), 460--8.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Emma Gardiner, and Sarita Schoenebeck. 2016. Managing Expectations: Technology Tensions among Parents and Teens. In Proceedings of the 19th ACM Conference on ComputerSupported Cooperative Work & Social Computing - CSCW '16. ACM Press, New York, New York, USA, 1388--1399.  ",
      "doi": "10.1145/2818048.2819928"
    },
    {
      "text": "Danah Boyd. 2014. It's complicated: the social lives of networked teens. (2014). ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Harry Brignull. {n. d.}. Dark Patterns. https://darkpatterns.org",
      "doi": ""
    },
    {
      "text": "Jef K. Caird, Kate A. Johnston, Chelsea R. Willness, Mark Asbridge, and Piers Steel. 2014. A meta-analysis of the efects of texting on driving. Accident Analysis and Prevention 71 (oct 2014), 311--318. arXiv:10.1016/j.pathophys.2006.09.001",
      "doi": ""
    },
    {
      "text": "Sarah Rose Cavanagh. 2017. No, Smartphones are not destroying a generation. Psychology Today 6 (2017).",
      "doi": ""
    },
    {
      "text": "Emily I. M. Collins, Jon Bird, Anna L. Cox, and Daniel Harrison. 2014. Social networking use and RescueTime. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing Adjunct Publication - UbiComp '14 Adjunct. ACM Press, New York, New York, USA, 687--690.  ",
      "doi": "10.1145/2638728.2641322"
    },
    {
      "text": "Gregory Conti and Edward Sobiesk. 2010. Malicious interface design. In Proceedings of the 19th international conference on World wide web - WWW '10. ACM Press, New York, New York, USA, 271.  ",
      "doi": "10.1145/1772690.1772719"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of qualitative research: Techniques and procedures for developing grounded theory. (2008).",
      "doi": ""
    },
    {
      "text": "Katie Davis. 2010. Coming of age online: The developmental underpinnings of girls' blogs. Journal of Adolescent Research 25, 1 (jan 2010), 145--171.",
      "doi": ""
    },
    {
      "text": "Katie Davis. 2012. Friendship 2.0: Adolescents' experiences of belonging and self-disclosure online. Journal of Adolescence 35, 6 (dec 2012), 1527--1536.",
      "doi": ""
    },
    {
      "text": "Alecia C. Douglas, Juline E. Mills, Mamadou Niang, Svetlana Stepchenkova, Sookeun Byun, Celestino Rufni, Seul Ki Lee, Jihad Loutf, Jung Kook Lee, Mikhail Atallah, and Marina Blanton. 2008. Internet addiction: Meta-synthesis of qualitative research for the decade 1996--2006. Computers in Human Behavior 24, 6 (sep 2008), 3027--3044.  ",
      "doi": "10.1016/j.chb.2008.05.009"
    },
    {
      "text": "Glen R Elliott and Shirley S Feldman. 1990. Capturing the adolescent experience. At the threshold: The developing adolescent (1990), 1--14.",
      "doi": ""
    },
    {
      "text": "Erik H Erikson. 1994. Identity: Youth and crisis. Number 7. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Abigail Evans. 2018. Adaptive Support for Face-to-Face Collaborative Learning at Tabletop Computers. (2018). https://digital.lib.washington. edu/researchworks/handle/1773/41810",
      "doi": ""
    },
    {
      "text": "Nir Eyal. 2014. Hooked: How to build habit-forming products. Penguin Canada.",
      "doi": ""
    },
    {
      "text": "Daniel Darghan Felisoni and Alexandra Strommer Godoi. 2018. Cell phone usage and academic performance: An experiment. Computers and Education 117 (feb 2018), 175--187.  ",
      "doi": "10.1016/j.compedu.2017.10.006"
    },
    {
      "text": "Kirsten A Foot. 2014. The Online Emergence of Pushback on Social Media in the United States: A Historical Discourse Analysis., 30 pages. http://ijoc.org/index.php/ijoc/article/view/2376",
      "doi": ""
    },
    {
      "text": "Howard Gardner. 2013. The app generation: how today's youth navigate identity, intimacy, and imagination in a digital world. Yale University Press, New Haven. ",
      "doi": "10.5555/2588192"
    },
    {
      "text": "Emily Gliklich, Rong Guo, and Regan W. Bergmark. 2016. Texting while driving: A study of 1211 U.S. adults with the Distracted Driving Survey. Preventive Medicine Reports 4 (dec 2016), 486--489.",
      "doi": ""
    },
    {
      "text": "Sahin Gökçearslan, Filiz Kuskaya Mumcu, Tülin Haslaman, and Yasemin Demiraslan Çevik. 2016. Modelling smartphone addiction: The role of smartphone usage, self-regulation, general self-efcacy and cyberloafng in university students. Computers in Human Behavior 63 (oct 2016), 639--649.  ",
      "doi": "10.1016/j.chb.2016.05.091"
    },
    {
      "text": "Ellie Harmon and Melissa Mazmanian. 2013. Stories of the Smartphone in everyday discourse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. 1051.  ",
      "doi": "10.1145/2470654.2466134"
    },
    {
      "text": "Susan Harter and Robert L Leahy. 2001. The construction of the self: A developmental perspective.",
      "doi": ""
    },
    {
      "text": "Joshua Harwood, Julian J. Dooley, Adrian J. Scott, and Richard Joiner. 2014. Constantly connected - The efects of smart-devices on mental health. Computers in Human Behavior 34 (may 2014), 267--272.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sungsoo (Ray) Hong, Tadayoshi Kohno, and Julie A. Kientz. 2016. MyTime: Designing and Evaluating an Intervention for Smartphone Non-Use. In CHI '16. ACM Press, New York, New York, USA, 4746--4757.  ",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "John Hughes, L Bannon, J Bowers, P Carstensen, K Kuutti, J Pycock, T Rodden, K Schmidt, D Shapiro, W Sharrock, and Others. 1993. Informing CSCW system requirements. COMIC, Esprit Basic Research Project 6225 (1993).",
      "doi": ""
    },
    {
      "text": "Shamsi T Iqbal, Jaime Teevan, Dan Liebling, and Anne Loomis Thompson. 2018. Multitasking with Play Write, a Mobile Microproductivity Writing Tool. Proceedings of UIST 2018 (2018), 223--245.  ",
      "doi": "10.1145/3242587.3242611"
    },
    {
      "text": "Md. Azharul Islam and Muhammad Zakir Hossin. 2016. Prevalence and risk factors of problematic internet use and the associated psychological distress among graduate students of Bangladesh. Asian Journal of Gambling Issues and Public Health 6, 1 (dec 2016), 11.",
      "doi": ""
    },
    {
      "text": "Riitta Jääskeläinen. 2010. Think-aloud protocol. Handbook of translation studies 1 (2010), 371--374.",
      "doi": ""
    },
    {
      "text": "Carrie James, Katie Davis, Andrea Flores, John M Francis, Lindsay Pettingill, Margaret Rundle, and Howard Gardner. 2009. Young People, Ethics, and the New Digital Media., 215--284 pages. http://mitpress.mit.edu/books/full{_}pdfs/ Young{_}People{_}Ethics{_}and{_}New{_}Digital{_}Media.pdf",
      "doi": ""
    },
    {
      "text": "Se-Hoon Jeong, HyoungJee Kim, Jung-Yoon Yum, and Yoori Hwang. 2016. What type of content are smartphone users addicted to?: SNS vs. games. Computers in Human Behavior 54 (jan 2016), 10--17.  ",
      "doi": "10.1016/j.chb.2015.07.035"
    },
    {
      "text": "Daniel Kardefelt-Winther, Alexandre Heeren, Adriano Schimmenti, Antonius van Rooij, Pierre Maurage, Michelle Carras, Johan Edman, Alexander Blaszczynski, Yasser Khazaal, and Joël Billieux. 2017. How can we conceptualize behavioural addiction without pathologizing common behaviours? Addiction 112, 10 (oct 2017), 1709--1715.",
      "doi": ""
    },
    {
      "text": "Inyeop Kim, Gyuwon Jung, Hayoung Jung, Minsam Ko, and Uichin Lee. 2017. Let's FOCUS. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (sep 2017), 1--29.  ",
      "doi": "10.1145/3130928"
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Koji Yatani, and Uichin Lee. 2016. Lock n' LoL: group-based limiting assistance app to mitigate smartphone distractions in group activities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 998--1010.  ",
      "doi": "10.1145/2858036.2858568"
    },
    {
      "text": "Minsam Ko, Kyong-Mee Chung, Subin Yang, Joonwon Lee, Christian Heizmann, Jinyoung Jeong, Uichin Lee, Daehee Shin, Koji Yatani, and Junehwa Song. 2015. NUGU: A group-based intervention app for improving self-regulation of limiting smartphone use. In CSCW '15. ACM Press, New York, New York, USA, 1235--1245.  ",
      "doi": "10.1145/2675133.2675244"
    },
    {
      "text": "Laura Krefting. 1991. Rigor in qualitative research: The assessment of trustworthiness. American journal of occupational therapy 45, 3 (1991), 214--222.",
      "doi": ""
    },
    {
      "text": "Jane Kroger. 2006. Identity development: Adolescence through adulthood. Sage publications.",
      "doi": ""
    },
    {
      "text": "Nuning Kurniasih. 2017. Internet Addiction, Lifestyle or Mental Disorder? A Phenomenological Study on Social Media Addiction in Indonesia. KnE Social Sciences 2, 4 (jun 2017), 135.",
      "doi": ""
    },
    {
      "text": "Kostadin Kushlev and Elizabeth W. Dunn. 2018. Smartphones distract parents from cultivating feelings of connection when spending time with their children. Journal of Social and Personal Relationships (apr 2018), 026540751876938.",
      "doi": ""
    },
    {
      "text": "Min Kwon, Joon-Yeop Lee, Wang-Youn Won, Jae-Woo Park, Jung-Ah Min, Changtae Hahn, Xinyu Gu, Ji-Hye Choi, and Dai-Jin Kim. 2013. Development and Validation of a Smartphone Addiction Scale (SAS). PLoS ONE 8, 2 (feb 2013), e56936.",
      "doi": ""
    },
    {
      "text": "Simone Lanette, Phoebe K. CHua, Gillian Hayes, and Melissa Mazmanian. 2018. How Much is \"Too Much\"? The Role of a Smartphone Addiction Narrative in Individuals' Experience of Use. In CSCW '18.  ",
      "doi": "10.1145/3274370"
    },
    {
      "text": "Simone Lanette and Melissa Mazmanian. 2018. The Smartphone \"Addiction\" Narrative is Compelling, but Largely Unfounded. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--6.  ",
      "doi": "10.1145/3170427.3188584"
    },
    {
      "text": "Matthew A. Lapierre and Meleah N. Lewis. 2016. Should It Stay or Should It Go Now? Smartphones and Relational Health. Psychology of Popular Media Culture (2016).",
      "doi": ""
    },
    {
      "text": "A R Lauricella, D P Cingel, L Beaudoin-Ryan, M B Robb, M Saphir, and E A Wartella. 2016. The Common Sense Census: Plugged-in parents of tweens and teens. San Francisco, CA: Common Sense Media (2016).",
      "doi": ""
    },
    {
      "text": "Alexis R. Lauricella, Drew P. Cingel, Courtney Blackwell, Ellen Wartella, and Annie Conway. 2014. The Mobile Generation: Youth and Adolescent Ownership and Use of New Media. Communication Research Reports 31, 4 (oct 2014), 357--364.",
      "doi": ""
    },
    {
      "text": "U Lee, J Lee, Minsam Ko, Changhun Lee, and Yuhwan Kim. 2014. Hooked on smartphones: an exploratory study on smartphone overuse among college students. CHI 2014 (2014), 2327-- 2336. http://www.yatani.jp/paper/CHI2014{_}MobileOveruse.pdf$\\ delimiter\"026E30F$nhttp://dl.acm.org/citation.cfm?id=2557366  ",
      "doi": "10.1145/2556288.2557366"
    },
    {
      "text": "Janette Lehmann, Mounia Lalmas, Elad Yom-Tov, and Georges Dupret. 2012. Models of User Engagement. Springer, Berlin, Heidelberg, 164-- 175.",
      "doi": ""
    },
    {
      "text": "Chris Lewis. 2014. Irresistible Apps: Motivational design patterns for apps, games, and web-based communities. Apress. ",
      "doi": "10.5555/2602450"
    },
    {
      "text": "Jian Li, Andrew Lepp, and Jacob E. Barkley. 2015. Locus of control and cell phone use: Implications for sleep quality, academic performance, and subjective well-being. Computers in Human Behavior 52 (nov 2015), 450--457.  ",
      "doi": "10.1016/j.chb.2015.06.021"
    },
    {
      "text": "Yu-Hsuan Lin, Li-Ren Chang, Yang-Han Lee, Hsien-Wei Tseng, Terry B. J. Kuo, and Sue-Huei Chen. 2014. Development and Validation of the Smartphone Addiction Inventory (SPAI). PLoS ONE 9, 6 (jun 2014), e98312.",
      "doi": ""
    },
    {
      "text": "Carolynne Lord, Mike Hazas, Adrian K Clear, Oliver Bates, Rosalind Whittam, Janine Morley, and Adrian Friday. 2015. Demand in my pocket: mobile devices and the data connectivity marshalled in support of everyday practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2729--2738.  ",
      "doi": "10.1145/2702123.2702162"
    },
    {
      "text": "Kai Lukof, Cissy Yu, Julie Kientz, and Alexis Hiniker. 2018. What Makes Smartphone Use Meaningful or Meaningless? Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (mar 2018), 1--26.  ",
      "doi": "10.1145/3191754"
    },
    {
      "text": "Ulrik Lyngs and Ulrik. 2018. A Cognitive Design Space for Supporting Self-Regulation of ICT Use. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--6.  ",
      "doi": "10.1145/3170427.3180296"
    },
    {
      "text": "Melissa Mazmanian and Simone Lanette. 2017. \"Okay, One More Episode\". In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17. 2273-- 2286.  ",
      "doi": "10.1145/2998181.2998218"
    },
    {
      "text": "Brandon T McDaniel and Sarah M Coyne. 2014. 'Technoference': The Interference of Technology in Couple Relationships and Implications for Women's Personal and Relational Well-Being. Psychology of Popular Media Culture (2014).",
      "doi": ""
    },
    {
      "text": "Earl K. Miller and Jonathan D. Cohen. 2001. An Integrative Theory of Prefrontal Cortex Function. Annual Review of Neuroscience 24, 1 (mar 2001), 167--202.",
      "doi": ""
    },
    {
      "text": "Stacey Morrison and Ricardo Gomez. 2014. Pushback: Expressions of resistance to the \"evertime\"of constant online connectivity. First Monday 19, 8 (2014).",
      "doi": ""
    },
    {
      "text": "Fabian Okeke, Michael Sobolev, Nicola Dell, and Deborah Estrin. 2018. Good vibrations. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services MobileHCI '18. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3229434.3229463"
    },
    {
      "text": "Antti Oulasvirta, Tye Rattenbury, Lingyi Ma, and Eeva Raita. 2012. Habits make smartphone use more pervasive. Personal and Ubiquitous Computing 16, 1 (jan 2012), 105--114.  ",
      "doi": "10.1007/s00779-011-0412-2"
    },
    {
      "text": "L. Portwood-Stacer. 2013. Media refusal and conspicuous nonconsumption: The performative and political dimensions of Facebook abstention. New Media & Society 15, 7 (2013), 1041--1057. http://nms.sagepub.com/content/15/7/1041.short",
      "doi": ""
    },
    {
      "text": "Lee Rainie, Aaron Smith, and Maeve Duggan. 2013. Coming and going on Facebook. Pew Research Center's Internet and American Life Project (2013).",
      "doi": ""
    },
    {
      "text": "Sevil Sahin, Kevser Ozdemir, Alaattin Unsal, and Nazen Temiz. 2013. Evaluation of mobile phone addiction level and sleep quality in university students. Pakistan journal of medical sciences 29, 4 (jul 2013), 913--8. http://www.ncbi.nlm.nih.gov/pubmed/24353658http: //www.pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC3817775",
      "doi": ""
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2014. Giving up Twitter for Lent : How and Why We Take Breaks from Social Media. CHI 2014 (2014), 773--782.  ",
      "doi": "10.1145/2556288.2556983"
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi and R Stevens. 2011. The new coviewing: Designing for learning through joint media engagement.",
      "doi": ""
    },
    {
      "text": "Jaime Teevan, Shamsi T. Iqbal, Carrie J. Cai, Jefrey P. Bigham, Michael S. Bernstein, and Elizabeth M. Gerber. 2016. Productivity Decomposed. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 3500--3507.  ",
      "doi": "10.1145/2851581.2856480"
    },
    {
      "text": "Ofr Turel, Alexander Serenko, and Nick Bontis. 2011. Family and work-related consequences of addiction to organizational pervasive technologies. Information & Management 48, 2--3 (mar 2011), 88--95.  ",
      "doi": "10.1016/j.im.2011.01.004"
    },
    {
      "text": "Jean M Twenge. 2017. Have smartphones destroyed a generation. The Atlantic 3 (2017).",
      "doi": ""
    },
    {
      "text": "Henry H. Wilmer and Jason M. Chein. 2016. Mobile technology habits: patterns of association among device usage, intertemporal preference, impulse control, and reward sensitivity. Psychonomic Bulletin & Review 23, 5 (oct 2016), 1607--1614.",
      "doi": ""
    },
    {
      "text": "Kimberly Young. 2016. Internet addiction test (IAT). Stoelting.",
      "doi": ""
    },
    {
      "text": "José P Zagal, Stafan Björk, and Chris Lewis. 2013. Dark Patterns in the Design of Games. (2013). http://www.diva-portal.org/smash/record. jsf?pid=diva2:1043332{&}dswid=-9639",
      "doi": ""
    },
    {
      "text": "Bieke Zaman and Marije Nouwen. 2016. Parental controls: advice for parents, researchers and industry. EU Kids Online (2016). http: //eprints.lse.ac.uk/65388/",
      "doi": ""
    }
  ]
}