{
  "doi": "10.1145/3290605.3300636",
  "title": "Expression of Curiosity in Social Robots: Design, Perception, and Effects on Behaviour",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Curiosity-the intrinsic desire for new information-can enhance learning, memory, and exploration. Therefore, understanding how to elicit curiosity can inform the design of educational technologies. In this work, we investigate how a social peer robot's verbal expression of curiosity is perceived, whether it can affect the emotional feeling and behavioural expression of curiosity in students, and how it impacts learning. In a between-subjects experiment, 30 participants played the game LinkIt!, a game we designed for teaching rock classification, with a robot verbally expressing: curiosity, curiosity plus rationale, or no curiosity. Results indicate that participants could recognize the robot's curiosity and that curious robots produced both emotional and behavioural curiosity contagion effects in participants.",
  "tags": [
    "social robot behaviour",
    "education",
    "curiosity"
  ],
  "authors": [
    {
      "name": "Jessy Ceha",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366811",
      "orcid": "missing"
    },
    {
      "name": "Nalin Chhibber",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-99659079750/rel-imgonly/4050813.jpg",
      "acmid": "99659079750",
      "orcid": "missing"
    },
    {
      "name": "Joslin Goh",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019887",
      "orcid": "0000-0002-6487-874X"
    },
    {
      "name": "Corina McDonald",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366883",
      "orcid": "missing"
    },
    {
      "name": "Pierre-Yves Oudeyer",
      "institution": "Inria Bordeaux Sud-Ouest, Talence, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100662126",
      "orcid": "missing"
    },
    {
      "name": "Dana Kulić",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100314105",
      "orcid": "missing"
    },
    {
      "name": "Edith Law",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130921",
      "orcid": "0000-0002-7540-075X"
    }
  ],
  "references": [
    {
      "text": "Alan Agresti. 1990. Categorical data analysis. Wiley, New York {u.a.}. XV, 558 S. pages.",
      "doi": ""
    },
    {
      "text": "Marilyn P. Arnone, Ruth V. Small, Sarah A. Chauncey, and H. Patricia McKenna. 2011. Curiosity, interest and engagement in technologypervasive learning environments: a new research agenda. Educational Technology Research and Development 59, 2 (2011), 181--198.",
      "doi": ""
    },
    {
      "text": "Wilma A. Bainbridge, Justin W. Hart, Elizabeth S. Kim, and Brian Scassellati. 2011. The benefits of interactions with physically present robots over video-displayed agents. International Journal of Social Robotics 3, 1 (2011), 41--52.",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck, Dana Kulić, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement instruments for the anthropomorphism, animacy, likeability, perceived intelligence, and perceived safety of robots. International Journal of Social Robotics 1, 1 (2009), 71--81.",
      "doi": ""
    },
    {
      "text": "Tony Belpaeme, James Kennedy, Aditi Ramachandran, Brian Scassellati, and Fumihide Tanaka. 2018. Social robots for education: A review. Science Robotics 3, 21 (2018), eaat5954.",
      "doi": ""
    },
    {
      "text": "Daniel E. Berlyne. 1954. A theory of human curiosity. British Journal of Psychology 45, 3 (1954), 180--191.",
      "doi": ""
    },
    {
      "text": "Timothy Bickmore, Daniel Schulman, and Langxuan Yin. 2010. Maintaining engagement in long-term interventions with relational agents. Applied Artificial Intelligence 24, 6 (2010), 648--666.  ",
      "doi": "10.1080/08839514.2010.492259"
    },
    {
      "text": "Gautam Biswas, Krittaya Leelawong, Daniel Schwartz, Nancy Vye, and The Teachable Agents Group at Vanderbilt. 2005. Learning by teaching: A new agent paradigm for educational software. Applied Artificial Intelligence 19, 3--4 (2005), 363--392.",
      "doi": ""
    },
    {
      "text": "Gautam Biswas, James R. Segedy, and Kritya Bunchongchit. 2016. From design to implementation to practice a learning by teaching system: Betty's brain. International Journal of Artificial Intelligence in Education 26, 1 (2016), 350--364.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal and Rodney Brooks. 2005. Robot emotions: A functional perspective. In Who Needs Emotions?: The Brain Meets the Robot, Jean-Marc Fellous and Michael A. Arbib (Eds.). Oxford University Press, 271--310.",
      "doi": ""
    },
    {
      "text": "Tanya L. Chartrand and John A. Bargh. 1999. The chameleon effect: the perception--behavior link and social interaction. Journal of Personality and Social Psychology 76, 6 (1999), 893.",
      "doi": ""
    },
    {
      "text": "Kai-Yi Chin, Zeng-Wei Hong, and Yen-Lin Chen. 2014. Impact of using an educational robot-based learning system on students motivation in elementary education. IEEE Transactions on Learning Technologies 7, 4 (2014), 333--345.",
      "doi": ""
    },
    {
      "text": "Diana I. Cordova and Mark R. Lepper. 1996. Intrinsic motivation and the process of learning: Beneficial effects of contextualization, personalization, and choice. Journal of Educational Psychology 88, 4 (1996), 715.",
      "doi": ""
    },
    {
      "text": "Pieter M. A. Desmet, Martijn H. Vastenburg, and Natalia Romero. 2016. Mood measurement with Pick-A-Mood: review of current methods and design of a pictorial self-report scale. Journal of Design Research 14, 3 (2016), 241--279.",
      "doi": ""
    },
    {
      "text": "David Duran. 2017. Learning-by-teaching. Evidence and implications as a pedagogical mechanism. Innovations in Education and Teaching International 54, 5 (2017), 476--484.",
      "doi": ""
    },
    {
      "text": "Rachel Gockley, Jodi Forlizzi, and Reid Simmons. 2006. Interactions with a moody robot. In Proceedings of the 1st ACM SIGCHI/SIGART conference on Human-Robot Interaction. ACM, 186--193.  ",
      "doi": "10.1145/1121241.1121274"
    },
    {
      "text": "Goren Gordon, Cynthia Breazeal, and Susan Engel. 2015. Can children catch curiosity from a social robot?. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. ACM, 91--98.  ",
      "doi": "10.1145/2696454.2696469"
    },
    {
      "text": "Matthias J. Gruber, Bernard D. Gelman, and Charan Ranganath. 2014. States of curiosity modulate hippocampus-dependent learning via the dopaminergic circuit. Neuron 84, 2 (2014), 486--496.",
      "doi": ""
    },
    {
      "text": "Jamie Jirout and David Klahr. 2012. Children's scientific curiosity: In search of an operational definition of an elusive concept. Developmental Review 32, 2 (2012), 125--160.",
      "doi": ""
    },
    {
      "text": "Min Jeong Kang, Ming Hsu, Ian M. Krajbich, George Loewenstein, Samuel M. McClure, Joseph Tao-yi Wang, and Colin F. Camerer. 2009. The wick in the candle of learning: Epistemic curiosity activates reward circuitry and enhances memory. Psychological Science 20, 8 (2009), 963--973.",
      "doi": ""
    },
    {
      "text": "Todd B. Kashdan, Matthew W. Gallagher, Paul J. Silvia, Beate P. Winterstein, William E. Breen, Daniel Terhar, and Michael F. Steger. 2009. The curiosity and exploration inventory-II: Development, factor structure, and psychometrics. Journal of Research in Personality 43, 6 (2009), 987--998.",
      "doi": ""
    },
    {
      "text": "Edith Law, Vicky Cai, Qi Feng Liu, Sajin Sasy, Joslin Goh, Alex Blidaru, and Dana Kulić. 2017. A Wizard-of-Oz study of curiosity in humanrobot interaction. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 607--614.",
      "doi": ""
    },
    {
      "text": "Kwan Min Lee, Wei Peng, Seung-A Jin, and Chang Yan. 2006. Can robots manifest personality?: An empirical test of personality recognition, social responses, and social presence in human-robot interaction. Journal of Communication 56, 4 (2006), 754--772.",
      "doi": ""
    },
    {
      "text": "Daniel Leyzberg, Samuel Spaulding, Mariya Toneva, and Brian Scassellati. 2012. The physical presence of a robot tutor increases cognitive learning gains. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 34.",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim, Anind K. Dey, and Daniel Avrahami. 2009. Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2119--2128.  ",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Jordan A. Litman. 2008. Interest and deprivation factors of epistemic curiosity. Personality and individual differences 44, 7 (2008), 1585--1595.",
      "doi": ""
    },
    {
      "text": "George Loewenstein. 1994. The psychology of curiosity: A review and reinterpretation. Psychological Bulletin 116, 1 (1994), 75.",
      "doi": ""
    },
    {
      "text": "Bonnie M. Muir. 1994. Trust in automation: Part I. Theoretical issues in the study of trust and human intervention in automated systems. Ergonomics 37, 11 (1994), 1905--1922.",
      "doi": ""
    },
    {
      "text": "Marret K. Noordewier and Eric van Dijk. 2017. Curiosity and time: from not knowing to almost knowing. Cognition and Emotion 31, 3 (2017), 411--421.",
      "doi": ""
    },
    {
      "text": "Pierre-Yves Oudeyer, Jacqueline Gottlieb, and Manuel Lopes. 2016. Intrinsic motivation, curiosity, and learning: Theory and applications in educational technologies. In Progress in Brain Research. Vol. 229. Elsevier, 257--284.",
      "doi": ""
    },
    {
      "text": "André Pereira, Iolanda Leite, Samuel Mascarenhas, Carlos Martinho, and Ana Paiva. 2010. Using empathy to improve human-robot relationships. In International Conference on Human-Robot Personal Relationship. Springer, 130--138.",
      "doi": ""
    },
    {
      "text": "Project for Education Research That Scales (PERTS). 2015. Growth Mindset Assessment. https://survey.perts.net/share/toi",
      "doi": ""
    },
    {
      "text": "Thomas G. Reio Jr. and Albert Wiswell. 2000. Field investigation of the relationship among adult curiosity, workplace learning, and job performance. Human Resource Development Quarterly 11, 1 (2000), 5--30.",
      "doi": ""
    },
    {
      "text": "Dale H. Schunk, Paul R. Pintrich, and Judith L. Meece. 2008. Motivation in education: Theory, research, and applications. (2008).",
      "doi": ""
    },
    {
      "text": "Prachi E. Shah, Heidi M. Weeks, Blair Richards, and Niko Kaciroti. 2018. Early childhood curiosity and kindergarten reading and math academic achievement. Pediatric Research (April 2018).",
      "doi": ""
    },
    {
      "text": "Masahiro Shiomi, Takayuki Kanda, Iris Howley, Kotaro Hayashi, and Norihiro Hagita. 2015. Can a social robot stimulate science curiosity in classrooms? International Journal of Social Robotics 7, 5 (2015), 641--652.",
      "doi": ""
    },
    {
      "text": "Elaine Short, Justin Hart, Michelle Vu, and Brian Scassellati. 2010. No fair!! an interaction with a cheating robot. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 219-- 226. ",
      "doi": "10.5555/1734454.1734546"
    },
    {
      "text": "Tanmay Sinha, Zhen Bai, and Justine Cassell. 2017. A new theoretical framework for curiosity for learning in social contexts. In European Conference on Technology Enhanced Learning. Springer, 254--269.",
      "doi": ""
    },
    {
      "text": "Aimee E. Stahl and Lisa Feigenson. 2015. Observing the unexpected enhances infants' learning and exploration. Science 348, 6230 (2015), 91--94.",
      "doi": ""
    },
    {
      "text": "Fumihide Tanaka, Kyosuke Isshiki, Fumiki Takahashi, Manabu Uekusa, Rumiko Sei, and Kaname Hayashi. 2015. Pepper Learns Together with Children: Development of an Educational Application. In Humanoid Robots (Humanoids). IEEE, 270--275.",
      "doi": ""
    },
    {
      "text": "Fumihide Tanaka and Shizuko Matsuzoe. 2012. Children teach a carereceiving robot to promote their learning: Field experiments in a classroom for vocabulary learning. Journal of Human-Robot Interaction 1, 1 (2012), 78--95.  ",
      "doi": "10.5898/JHRI.1.1.Tanaka"
    },
    {
      "text": "Jason Tsai, Emma Bowring, Stacy Marsella, Wendy Wood, and Milind Tambe. 2012. A study of emotional contagion with virtual characters. In Intelligent Virtual Agents. IVA 2012. Lecture Notes in Computer Science, Yukiko Nakano, Michael Neff, Ana Paiva, and Marilyn Walker (Eds.). Vol. 7502. Springer, Berlin, Heidelberg, 81--88.  ",
      "doi": "10.1007/978-3-642-33197-8_8"
    },
    {
      "text": "Robert J. Vallerand, Marc R. Blais, Nathalie M. Brière, and Luc G. Pelletier. 1989. Construction et validation de l'échelle de motivation en éducation (EME). Canadian Journal of Behavioural Science/Revue canadienne des sciences du comportement 21, 3 (1989), 323.",
      "doi": ""
    },
    {
      "text": "Robert J. Vallerand, Luc G. Pelletier, Marc R. Blais, Nathalie M. Briere, Caroline Senecal, and Evelyne F. Vallieres. 1992. The Academic Motivation Scale: A measure of intrinsic, extrinsic, and amotivation in education. Educational and Psychological Measurement 52, 4 (1992), 1003--1017.",
      "doi": ""
    },
    {
      "text": "Junchao Xu, Joost Broekens, Koen Hindriks, and Mark A. Neerincx. 2014. Robot mood is contagious: effects of robot body language in the imitation game. In Proceedings of the 13th International Conference on Autonomous Agents and Multiagent Systems, Alessio Lomuscio, Paul Scerri, Ana Bazzan, and Michael Huhns (Eds.). 973--980. ",
      "doi": "10.5555/2615731.2617401"
    }
  ]
}