{
  "doi": "10.1145/3290605.3300263",
  "title": "Designing 'True Colors': A Social Wearable that Affords Vulnerability",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Vulnerability is a common experience in everyday life and is frequently perceived as a flaw to be excised in technology design. Yet, research indicates it is an essential aspect of wholehearted living among others. In this paper, we present the design and deployment of 'True Colors', a novel wearable device intended to support social interaction in a live action roleplay game (LARP) setting. We describe the Research-through-Design process that helped us to discover and articulate the possibility space of vulnerability in the design of social wearables, as support for producing a sense of social empowerment and connection among wearers within the LARP. We draw conclusions that may be of value to others designing wearables and related technologies aimed at supporting co-located social interaction in games/play.",
  "authors": [
    {
      "name": "Ella Dagan",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248918",
      "orcid": "missing"
    },
    {
      "name": "Elena Márquez Segura",
      "institution": "Uppsala University, Uppsala, Sweden",
      "img": "/do/10.1145/contrib-99659077589/rel-imgonly/99659077589.jpg",
      "acmid": "99659077589",
      "orcid": "missing"
    },
    {
      "name": "Ferran Altarriba Bertran",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277137",
      "orcid": "missing"
    },
    {
      "name": "Miguel Flores",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260779",
      "orcid": "missing"
    },
    {
      "name": "Katherine Isbister",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/do/10.1145/contrib-99659489823/rel-imgonly/ella-square.jpg",
      "acmid": "99659489823",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Samsung Electronics America. 2018. Samsung Galaxy Watch. Retrieved December 31, 2018 from https://www.samsung.com/global/ galaxy/galaxy-watch/",
      "doi": ""
    },
    {
      "text": "Leonardo Angelini, Maurizio Caon, Denis Lalanne, Omar Abou Khaled, and Elena Mugellini. 2014. Hugginess: Encouraging Interpersonal Touch Through Smart Clothes. In Proceedings of the 2014 ACM International Symposium on Wearable Computers: Adjunct Program (ISWC '14 Adjunct). ACM, New York, NY, USA, 155--162.  ",
      "doi": "10.1145/2641248.2641356"
    },
    {
      "text": "Apple. 2018. Apple Watch Series 3. Retrieved September 4, 2018 from https://www.apple.com/apple-watch-series-3/",
      "doi": ""
    },
    {
      "text": "Athos. 2018. Athos Training System. Retrieved September 4, 2018 from https://www.liveathos.com",
      "doi": ""
    },
    {
      "text": "Sarah Lynne Bowman. 2010. The Functions of Role-Playing Games: How Participants Create Community, Solve Problems and Explore Identity. Designing 'True Colors': A Social Wearable that Affords Vulnerability CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk McFarland, Jefferson, N.C.",
      "doi": ""
    },
    {
      "text": "Philip Brey. 2012. Well-being in philosophy, psychology, and economics. In The good life in a technological age. Routledge, 33--52.",
      "doi": ""
    },
    {
      "text": "Brené Brown. 2015. Daring greatly: How the courage to be vulnerable transforms the way we live, love, parent, and lead. Penguin.",
      "doi": ""
    },
    {
      "text": "Oguz Turan Buruk, Ismet Melih Özbeyli, and Oguzhan Özcan. 2017. Augmented Table-Top Role-Playing Game with Movement-Based Gameplay and Arm-Worn Devices. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, New York, NY, USA, 289--292.  ",
      "doi": "10.1145/3064857.3079176"
    },
    {
      "text": "Oguz Turan Buruk and Oguzhan Özcan. 2018. Extracting Design Guidelines for Wearables and Movement in Tabletop Role-Playing Games via a Research Through Design Process. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 513, 13 pages.  ",
      "doi": "10.1145/3173574.3174087"
    },
    {
      "text": "Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Eran Tiza, Bugra Can Sefercik, Idil Bostan, Oguz Turan Buruk, Tilbe Göksun, and Oguzhan Özcan. 2016. Sensation: Measuring the Effects of a Human-to-Human Social Touch Based Controller on the Player Experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3944--3955.  ",
      "doi": "10.1145/2858036.2858418"
    },
    {
      "text": "Fiona Carswell. 2009. Co-Dependent Gloves. https: //joprints.wordpress.com/2009/09/13/co-dependent-gloves/",
      "doi": ""
    },
    {
      "text": "Chung-Jen Chen and Jing-Wen Huang. 2007. How organizational climate and structure affect knowledge management--The social interaction perspective. International journal of information management 27, 2 (2007), 104--118.  ",
      "doi": "10.1016/j.ijinfomgt.2006.11.001"
    },
    {
      "text": "Rick Chillot. 2013. The Power of Touch. Retrieved September 4, 2018 from http://www.psychologytoday.com/articles/201303/ the-power-touch",
      "doi": ""
    },
    {
      "text": "Emily Christofides, Amy Muise, and Serge Desmarais. 2009. Information disclosure and control on Facebook: Are they two sides of the same coin or two different processes? Cyberpsychology & Behavior 12, 3 (2009), 341--345.",
      "doi": ""
    },
    {
      "text": "Francisco de Arriba-Pérez, Manuel Caeiro-Rodríguez, and Juan M Santos-Gago. 2016. Collection and processing of data from wrist wearable devices in heterogeneous and multiple-user scenarios. Sensors 16, 9 (2016), 1538.",
      "doi": ""
    },
    {
      "text": "DyAnsys. 2018. Drug Relief. Retrieved July 18, 2018 from https: //www.dyansys.com/products-applications/products/drug-relief",
      "doi": ""
    },
    {
      "text": "fitbit. 2018. Fitbit Official Site for Activity Trackers & More. Retrieved December 31, 2018 from https://www.fitbit.com/home",
      "doi": ""
    },
    {
      "text": "Fraunhofer-Gesellschaft. 2018. Modular measurement wristband for personalized dementia therapy. (2018). Retrieved December 31, 2018 from https://www.fraunhofer.de/en/press/ research-news/2018/june/modular-measurement-wristband-for-personalized-dementia-therapy. html",
      "doi": ""
    },
    {
      "text": "Alberto Gallace and Charles Spence. 2010. The science of interpersonal touch: an overview. Neuroscience & Biobehavioral Reviews 34, 2 (2010), 246--259.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research Through Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William W. Gaver. 1991. Technology Affordances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '91). ACM, New York, NY, USA, 79--84.  ",
      "doi": "10.1145/108844.108856"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow Technology &Ndash; Designing for Reflection. Personal Ubiquitous Comput. 5, 3 (Jan. 2001), 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Kate Hartman, Jackson McConnell, Boris Kourtoukov, Hillary Predko, and Izzie Colpitts-Campbell. 2015. Monarch: Self-expression through wearable kinetic textiles. (2015).",
      "doi": "10.1145/2677199.2690875"
    },
    {
      "text": "Matthew J Hertenstein, Rachel Holmes, Margaret McCullough, and Dacher Keltner. 2009. The communication of emotion via touch. Emotion 9, 4 (2009), 566.",
      "doi": ""
    },
    {
      "text": "Mads Hobye. 2012. Touchbox: Intriguing Touch Between Strangers. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1023--1026.  ",
      "doi": "10.1145/2212776.2212376"
    },
    {
      "text": "Event Horizon. 2018. Larp Details. Retrieved September 4, 2018 from http://www.eventhorizonlarp.com/larp-details.html",
      "doi": ""
    },
    {
      "text": "Event Horizon. 2018. New Gyr. Retrieved September 4, 2018 from http://www.eventhorizonlarp.com/2-new-gyr.html",
      "doi": ""
    },
    {
      "text": "Event Horizon. 2018. What We Do. Retrieved September 13, 2018 from http://www.eventhorizonlarp.com/",
      "doi": ""
    },
    {
      "text": "Event Horizon. 2018. World Database. Retrieved December 31, 2018 from http://www.eventhorizonlarp.com/world-database.html",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 1955. omo Ludens: A Study of the Play-Element in Culture. Beacon Press, Boston, MA, USA.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. 2016. Wearables to Support Interdependent Play. Interactions 24, 1 (Dec. 2016), 50--53.  ",
      "doi": "10.1145/3019604"
    },
    {
      "text": "Katherine Isbister, Kaho Abe, and Michael Karlesky. 2017. Interdependent Wearables (for Play): A Strong concept for design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 465--471.  ",
      "doi": "10.1145/3025453.3025939"
    },
    {
      "text": "Katherine Isbister and Kristina Höök. 2009. On Being Supple: In Search of Rigor Without Rigidity in Meeting New Design and Evaluation Challenges for HCI Practitioners. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2233--2242.  ",
      "doi": "10.1145/1518701.1519042"
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, Suzanne Kirkpatrick, Xiaofeng Chen, Syed Salahuddin, Gang Cao, and Raybit Tang. 2016. Yamove! A movement synchrony game that choreographs social interaction. Human technology 12 (2016).",
      "doi": ""
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, and Edward F Melcer. 2018. Social Affordances at Play: Game Design Toward Socio-Technical Innovation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 372.  ",
      "doi": "10.1145/3173574.3173946"
    },
    {
      "text": "Lars-Erik Janlert and Erik Stolterman. 2017. The Meaning of Interactivity: Some Proposals for Definitions and Measures. Hum.-Comput. Interact. 32, 3 (May 2017), 103--138.  ",
      "doi": "10.1080/07370024.2016.1226139"
    },
    {
      "text": "Sean F Johnston. 2018. The Technological Fix as Social Cure-All: Origins and Implications. IEEE Technology and Society Magazine 37, 1 (2018), 47--54.",
      "doi": ""
    },
    {
      "text": "Ken Kaplan. 2015. Robotic Spider Dress Powered By Intel Smart Wearable Technology. Retrieved December 31, 2018 from https://iq. intel.com/smart-spider-dress-by-dutch-designer-anouk-wipprecht/",
      "doi": ""
    },
    {
      "text": "Sang Li. 2014. Expressive Wearable. Retrieved December 31, 2018 from https://www.sanglidesign.com/expressive-wearables",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren. 2013. Annotated Portfolios and Other Forms of Intermediate-level Knowledge. Interactions 20, 1 (Jan. 2013), 30--34. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk E.Dagan et al.  ",
      "doi": "10.1145/2405716.2405725"
    },
    {
      "text": "Elena Márquez Segura, James Fey, Ella Dagan, Samvid Niravbhai Jhaveri, Jared Pettitt, Miguel Flores, and Katherine Isbister. 2018. Designing Future Social Wearables with Live Action Role Play (Larp) Designers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 462.  ",
      "doi": "10.1145/3173574.3174036"
    },
    {
      "text": "Elena Márquez Segura, Katherine Isbister, Jon Back, and Annika Waern. 2017. Design, appropriation, and use of technology in larps. In Proceedings of the 12th International Conference on the Foundations of Digital Games. ACM, 53.  ",
      "doi": "10.1145/3102071.3106360"
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami, and Annika Waern. 2016. Embodied Sketching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 6014--6027.  ",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, and Asreen Rostami. 2016. Bodystorming for movement-based interaction design. Human Technology:AnInterdisciplinaryJournalonHumansinICTEnvironments (2016).",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3365--3374.  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2017. Touchomatic: Interpersonal Touch Gaming In The Wild. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 417--428.  ",
      "doi": "10.1145/3064663.3064727"
    },
    {
      "text": "Lauren McCarthy. 2010. Tools for Improved Social Interacting. In ACM SIGGRAPH 2010 Art Gallery. ACM, 400--401.  ",
      "doi": "10.1145/1836786.1836801"
    },
    {
      "text": "Katelyn YA McKenna, Amie S Green, and Marci EJ Gleason. 2002. Relationship formation on the Internet: What's the big attraction? Journal of social issues 58, 1 (2002), 9--31.",
      "doi": ""
    },
    {
      "text": "Jane C. Nannberg and Christine H. Hansen. 1994. PostCompliance Touch: An Incentive for Task Performance. The Journal of Social Psychology 134, 3 (Jun 1994), 301-307.",
      "doi": ""
    },
    {
      "text": "NatureBridge. 2018. Retrieved September 14, 2018 from https://naturebridge.org/",
      "doi": ""
    },
    {
      "text": "My Nguyen. 2017. Wearables for Diabetics. https: //www.wearable-technologies.com/2017/01/wearables-for-diabetic/",
      "doi": ""
    },
    {
      "text": "Nike. 2018. NikePlus. Retrieved December 31, 2018 from https://www.nike.com/us/en_us/c/nike-plus/running-app-gps",
      "doi": ""
    },
    {
      "text": "Nordiclarp.org. {n. d.}. What is Nordic Larp Retrieved September 4, 2018 from https://nordiclarp.org/what-is-nordic-larp/",
      "doi": ""
    },
    {
      "text": "Don Norman. 2013. Don Norman on Wearable Devices. Retrieved September 4, 2018 from https://www.technologyreview.com/s/517346/ the-paradox-of-wearable-technologies/",
      "doi": ""
    },
    {
      "text": "William Odom. 2015. Understanding Long-Term Interactions with a Slow Technology: An Investigation of Experiences with FutureMe. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 575--584.  ",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "WilliamT.Odom,AbigailJ.Sellen,RichardBanks,DavidS.Kirk,TimRegan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for Slowness, Anticipation and Re-visitation: A Long Term Field Study of the Photobox. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Gwenn Schurgin O'Keeffe, Kathleen Clarke-Pearson, et al. 2011. Clinical report--the impact of social media on children, adolescents, and families. Pediatrics (2011), peds--2011.",
      "doi": ""
    },
    {
      "text": "Hirotaka Osawa. 2014. Emotional cyborg: Complementing emotional laborwithhuman-agentinteractiontechnology.InProceedingsofthesecond international conference on Human-agent interaction. ACM, 51--57.  ",
      "doi": "10.1145/2658861.2658880"
    },
    {
      "text": "Despina Papadopoulos. 2005. Hug Jackets -- pixelpep. Retrieved December 31, 2018 from https://pixelpeppy.com/hugjackets/",
      "doi": ""
    },
    {
      "text": "Alex Pentland. 2012. The new science of building great teams. Harvard Business Review 90, 4 (2012), 60--69.",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1 (Mar 2008), 5--18.",
      "doi": ""
    },
    {
      "text": "Gwendolyn Seidman. 2013. Self-presentation and belonging on Facebook: How personality influences social media use and motivations. Personality and Individual Differences 54, 3 (2013), 402--407.",
      "doi": ""
    },
    {
      "text": "David Simkins. 2015. The Arts of LARP: Design, Literacy, Learning and Community in Live-Action Role Play. McFarland.",
      "doi": ""
    },
    {
      "text": "Somatix. 2018. SmokeBeat TM smoking cessation monitoring. Retrieved September 7, 2018 from https://somatix.com/solutions/",
      "doi": ""
    },
    {
      "text": "Barry M Staw, Robert I Sutton, and Lisa H Pelled. 1994. Employee positive emotion and favorable outcomes at the workplace. Organization Science 5, 1 (1994), 51--71. ",
      "doi": "10.5555/2842023.2842027"
    },
    {
      "text": "Joshua Tanenbaum, Karen Tanenbaum, Katherine Isbister, Kaho Abe, Anne Sullivan, and Luigi Anzivino. 2015. Costumes and wearables as game controllers. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 477--480.  ",
      "doi": "10.1145/2677199.2683584"
    },
    {
      "text": "Sonja Utz, Martin Tanis, and Ivar Vermeulen. 2012. It is all about being popular: The effects of need for popularity on social network site use. Cyberpsychology, Behavior, and Social Networking 15, 1 (2012), 37--42.",
      "doi": ""
    },
    {
      "text": "David CF Vaidis and Séverine GM Halimi-Falkowicz. 2008. Increasing compliance with a request: two touches are more effective than one. Psychological Reports 103, 1 (2008), 88--92.",
      "doi": ""
    },
    {
      "text": "Tom Van Laer. 2014. The means to justify the end: Combating cyber harassment in social media. Journal of Business Ethics 123, 1 (2014), 85--98.",
      "doi": ""
    },
    {
      "text": "Susanne Vejdemo. 2018. Play to Lift, not Just to Lose. Retrieved September 4, 2018 from https://nordiclarp.org/2018/02/21/ play-lift-not-just-lose/",
      "doi": ""
    },
    {
      "text": "Annika Waern, Markus Montola, and Jaakko Stenros. 2009. The Three-sixty Illusion: Designing for Immersion in Pervasive Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1549--1558.  ",
      "doi": "10.1145/1518701.1518939"
    },
    {
      "text": "Nordic Larp Wiki. 2014. The Foundation Stone of Nordic Larp. Retrieved September 4, 2018 from https://nordiclarp.org/wiki/The_ Foundation_Stone_of_Nordic_Larp",
      "doi": ""
    },
    {
      "text": "Nordic Larp Wiki. 2018. Playing to Lose. Retrieved September 4, 2018 from https://nordiclarp.org/wiki/Playing_to_Lose",
      "doi": ""
    },
    {
      "text": "Frank N. Willis and Helen K. Hamm. 1980. The use of interpersonal touch in securing compliance. Journal of Nonverbal Behavior 5, 1 (Sep 1980), 49--55.",
      "doi": ""
    },
    {
      "text": "Y. Yamaguchi, H. Yanagi, and Y. Takegawa. 2013. Touch-shake: Design andimplementationofaphysicalcontactsupportdeviceforface-to-face communication. In 2013 IEEE 2nd Global Conference on Consumer Electronics (GCCE). 170--174.",
      "doi": ""
    },
    {
      "text": "Michele L Ybarra and Kimberly J Mitchell. 2008. How risky are social networking sites? A comparison of places online where youth sexual solicitation and harassment occurs. Pediatrics 121, 2 (2008), e350--e357.",
      "doi": ""
    },
    {
      "text": "Clint Zeagler. 2017. Where to Wear It: Functional, Technical, and Social Considerations in On-body Location for Wearable Technology 20 Years of Designing for Wearability. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (ISWC '17). ACM, New York, NY, USA, 150--157.  ",
      "doi": "10.1145/3123021.3123042"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in Designing \"True Colors': A Social Wearable that Affords Vulnerability CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research Through Design: Towards a Formalization of a Research Approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 310--319.  ",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}