{
  "doi": "10.1145/3290605.3300546",
  "title": "\"Collective Wisdom\": Inquiring into Collective Homes as a Site for HCI Design",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "The home has been a major focus of the HCI community for over two decades. Despite this body of research, nascent works have argued that HCI's characterization of 'the home' remains narrow and requires more diverse accounts of domestic configurations. Our work contributes to this area through a four-month ethnography of three collective homes in Vancouver, Canada. Collective homes represent an alternative housing model that offers agency to individual members and the collective group by sharing values, resources, labour, space and memory. Our paper offers two contributions. First, we offer an in-depth design ethnography of three collective homes, attending to the values, ownership models, practices, and everyday interactions observed in the ongoing making of these domestic settings. Second, we interpret and synthesize our findings to provide new opportunities for expanding the way we conceptualize and design for 'the home' in HCI.",
  "tags": [
    "domestic computing",
    "ownership",
    "collective homes"
  ],
  "authors": [
    {
      "name": "Jo Shin",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366670",
      "orcid": "missing"
    },
    {
      "name": "Gabriela Aceves Sepúlveda",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367136",
      "orcid": "missing"
    },
    {
      "name": "William Odom",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    }
  ],
  "references": [
    {
      "text": "Ryan Aipperspach, Ben Hooker, and Allison Woodruff. 2009. The heterogeneous home. interactions 16, 1: 35--38.  ",
      "doi": "10.1145/1456202.1456211"
    },
    {
      "text": "Eric P. S. Baumer and Jed R. Brubaker. 2017. Post-userism. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, ACM Press, 6291--6303.  ",
      "doi": "10.1145/3025453.3025740"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by making strange: Defamiliarization and the design of domestic technologies. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2: 149--173.  ",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Back to the shed: gendered visions of technology and domesticity. Personal and Ubiquitous Computing 11, 5: 373--381. ",
      "doi": "10.1007/s00779-006-0073-8"
    },
    {
      "text": "Mark Blythe and Andrew Monk. 2002. Notes towards an ethnography of domestic technology. Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques, ACM, 277--281.  ",
      "doi": "10.1145/778712.778750"
    },
    {
      "text": "Trudi Bunting, Alan R. Walks, and Pierre Filion. 2004. The uneven geography of housing affordability stress in Canadian metropolitan areas. Housing Studies 19, 3: 361--393.",
      "doi": ""
    },
    {
      "text": "Tom Carter. 1997. Current practices for procuring affordable housing: The Canadian context. Housing Policy Debate 8, 3: 593--631.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree and Tom Rodden. 2004. Domestic routines and design for the home. Computer Supported Cooperative Work (CSCW) 13, 2: 191--220.  ",
      "doi": "10.1023/B%3ACOSU.0000045712.26840.a4"
    },
    {
      "text": "Andy Crabtree, Tom Rodden, Terry Hemmings, and Steve Benford. 2003. Finding a Place for UbiComp in the Home. UbiComp 2003: Ubiquitous Computing, Springer Berlin Heidelberg, 208--226.",
      "doi": ""
    },
    {
      "text": "Dries De Roeck, Karin Slegers, Johan Criel, et al. 2012. I would DiYSE for it!: a manifesto for do-it-yourself internet-of-things creation. ACM Press, 170.  ",
      "doi": "10.1145/2399016.2399044"
    },
    {
      "text": "Audrey Desjardins and Ron Wakkary. 2016. Living In A Prototype: A Reconfigured Space. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, ACM Press, 5274--5285.  ",
      "doi": "10.1145/2858036.2858261"
    },
    {
      "text": "Audrey Desjardins, Ron Wakkary, and William Odom. 2015. Investigating Genres and Perspectives in HCI Research on the Home. ACM Press, 3073--3082.  ",
      "doi": "10.1145/2702123.2702540"
    },
    {
      "text": "Carl DiSalvo and Tom Jenkins. 2017. Fruit Are Heavy: A Prototype Public IoT System to Support Urban Foraging. Proceedings of the 2017 Conference on Designing Interactive Systems - DIS '17, ACM Press, 541--553.  ",
      "doi": "10.1145/3064663.3064748"
    },
    {
      "text": "Tao Dong, Mark S. Ackerman, and Mark W. Newman. 2014. \"If these walls could talk\": designing with memories of places. Proceedings of the 2014 conference on Designing interactive systems - DIS '14, ACM Press, 63--72.  ",
      "doi": "10.1145/2598510.2598605"
    },
    {
      "text": "Anton Fedosov, William Odom, Marc Langheinrich, and Ron Wakkary. 2018. Roaming Objects: Encoding Digital Histories of Use into Shared Objects and Tools. Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18, ACM Press, 1141--1153.  ",
      "doi": "10.1145/3196709.3196722"
    },
    {
      "text": "Tom Feltwell, Shaun Lawson, Enrique Encinas, et al. 2018. \"Grand Visions\" for Post-Capitalist Human-Computer Interaction. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, ACM Press, 1--8.  ",
      "doi": "10.1145/3170427.3170609"
    },
    {
      "text": "Alix Freiler and Meg Holden. 2012. Homelessness in the Livable City: Public Space Regulation in Olympic City, Vancouver's Poorest Neighborhood. Critical Planning 19, Summer.",
      "doi": ""
    },
    {
      "text": "Jane Gruning and Siân Lindley. 2016. Things We Own Together: Sharing Possessions at Home. ACM Press, 1176--1186.  ",
      "doi": "10.1145/2858036.2858154"
    },
    {
      "text": "Tom Jenkins. 2017. Living Apart, Together: Cohousing as a Site for ICT Design. ACM Press, 1039--1051.  ",
      "doi": "10.1145/3064663.3064751"
    },
    {
      "text": "Tom Jenkins. 2018. Cohousing IoT: Design Prototyping for Community Life. ACM Press, 667--673.  ",
      "doi": "10.1145/3173225.3173244"
    },
    {
      "text": "David Kirk, Shahram Izadi, Otmar Hilliges, Richard Banks, Stuart Taylor, and Abigail Sellen. 2012. At home with surface computing? Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12, ACM Press, 159.  ",
      "doi": "10.1145/2207676.2207699"
    },
    {
      "text": "Nathanael Thomas Lauster. 2016. The death and life of the single-family house?: lessons from Vancouver on building a livable city / Nathanael Lauster. Philadelphia?: Temple University Press.",
      "doi": ""
    },
    {
      "text": "Gilly Leshed, Maria Håkansson, and Joseph \"Jofish\" Kaye. 2014. \"Our life is the farm and farming is our life\": home-work coordination in organic farm families. ACM Press, 487--498.  ",
      "doi": "10.1145/2531602.2531708"
    },
    {
      "text": "Carman Neustaedter and A. J. Bernheim Brush. 2006. \"LINC-ing\" the family: the participatory design of an inkable family calendar. Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI '06, ACM Press, 141.  ",
      "doi": "10.1145/1124772.1124796"
    },
    {
      "text": "Pierre Nora and Lawrence D. Kritzman. 1996. Realms of Memory: The Construction of the French Past. Columbia University Press, New York.",
      "doi": ""
    },
    {
      "text": "Jon O'Brien and Tom Rodden. 1997. Interactive systems in domestic environments. Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques, ACM, 247--259.  ",
      "doi": "10.1145/263552.263617"
    },
    {
      "text": "Jon O'Brien, Tom Rodden, Mark Rouncefield, and John Hughes. 1999. At home with the technology: an ethnographic study of a set-top-box trial. ACM Transactions on Computer-Human Interaction (TOCHI) 6, 3: 282--308.  ",
      "doi": "10.1145/329693.329698"
    },
    {
      "text": "William Odom, Yeoreum Lee, Da-jung Kim, et al. 2013. Fragmentation and transition: understanding perceptions of virtual possessions among young adults in Spain, South Korea and the United States. ACM Press, 1833.  ",
      "doi": "10.1145/2470654.2466242"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, et al. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "William Odom and Ron Wakkary. 2015. Intersecting with Unaware Objects. ACM Press, 33--42.  ",
      "doi": "10.1145/2757226.2757240"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, spacelessness, and formlessness: experiential qualities of virtual possessions. ACM Press, 985--994.  ",
      "doi": "10.1145/2598510.2598577"
    },
    {
      "text": "Doenja Oogjes, William Odom, and Pete Fung. 2018. Designing for an other home: expanding and speculating on different forms of domestic life. .",
      "doi": ""
    },
    {
      "text": "Noah Quastel, Markus Moos, and Nicholas Lynch. 2012. Sustainability-As-Density and the Return of the Social: The Case of Vancouver, British Columbia. Urban Geography 33, 7: 1055--1084.",
      "doi": ""
    },
    {
      "text": "Tony Salvador, Genevieve Bell, and Ken Anderson. 2010. Design Ethnography. Design Management Journal (Former Series) 10, 4: 35--41.",
      "doi": ""
    },
    {
      "text": "Statistics Canada. 2017. Focus on Geography Series, 2016 Census. Statistics Canada. Retrieved August 20, 2018 from https://www12.statcan.gc.ca/census-recensement/2016/as-sa/fogs-spg/Facts-cma-eng.cfm?GC=933&GK=CMA&LANG=Eng&TOPIC=1.",
      "doi": ""
    },
    {
      "text": "Gregory L.F. Suttor. 2016. Still renovating: a history of Canadian social housing policy. McGill-Queen's University Press, Montreal.",
      "doi": ""
    },
    {
      "text": "Laurel Swan, Alex S. Taylor, and Richard Harper. 2008. Making place for clutter and other ideas of home. ACM Transactions on Computer-Human Interaction 15, 2: 1--24.  ",
      "doi": "10.1145/1375761.1375764"
    },
    {
      "text": "Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, ACM Press, 2603.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Alex S. Taylor and Laurel Swan. 2005. Artful systems in the home. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Alex S. Taylor, Susan P. Wyche, and Joseph \"Jofish\" Kaye. 2008. Pottering by design. ACM Press, 363.  ",
      "doi": "10.1145/1463160.1463200"
    },
    {
      "text": "Peter Tolmie, James Pycock, Tim Diggins, Allan MacLean, and Alain Karsenty. 2002. Unremarkable computing. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 399--406.  ",
      "doi": "10.1145/503376.503448"
    },
    {
      "text": "Dick Urban Vestbro. 2000. From collective housing to cohousing-a summary of research. Journal of Architectural and Planning Research: 164--178.",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User experience in do-it-yourself-style smart homes. ACM Press, 779--790.  ",
      "doi": "10.1145/2750858.2806063"
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: \"it's like mixing technology and religion.\" Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07, ACM Press, 527.  ",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Allison Woodruff, Jay Hasbrouck, and Sally Augustin. 2008. A bright green perspective on sustainable choices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 313--322.  ",
      "doi": "10.1145/1357054.1357109"
    },
    {
      "text": "Alexandra Zafiroglu and Michele Chang. 2007. Digital homes on wheels: designing for the unimagined home. Personal and Ubiquitous Computing 11, 5: 395--402.  ",
      "doi": "10.1007/s00779-006-0074-7"
    },
    {
      "text": "2013. Vancouver is Canada's most expensive city, but not in the world's top 10. The Canadian Press. Retrieved from https://search.proquest.com/docview/1412509569?accountid=13800.",
      "doi": ""
    },
    {
      "text": "2013. Vancouver ranked world's third most-livable city, with Toronto and Calgary next. The Canadian Press. Retrieved from https://search.proquest.com/docview/1428918630?accountid=13800.",
      "doi": ""
    },
    {
      "text": "Collective Housing Society of Greater Vancouver. Collective Housing Society of Greater Vancouver. Retrieved November 22, 2017 from http://collectivehousing.weebly.com/.",
      "doi": ""
    }
  ]
}