{
  "doi": "10.1145/3290605.3300604",
  "title": "Opportunities for Automating Email Processing: A Need-Finding Study",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Email management consumes significant effort from senders and recipients. Some of this work might be automatable. We performed a mixed-methods need-finding study to learn: (i) what sort of automatic email handling users want, and (ii) what kinds of information and computation are needed to support that automation. Our investigation included a design workshop to identify categories of needs, a survey to better understand those categories, and a classification of existing email automation software to determine which needs have been addressed. Our results highlight the need for: a richer data model for rules, more ways to manage attention, leveraging internal and external email context, complex processing such as response aggregation, and affordances for senders. To further investigate our findings, we developed a platform for authoring small scripts over a user's inbox. Of the automations found in our studies, half are impossible in popular email clients, motivating new design directions.",
  "tags": [
    "personal information management",
    "task management",
    "email"
  ],
  "authors": [
    {
      "name": "Soya Park",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314722",
      "orcid": "missing"
    },
    {
      "name": "Amy X. Zhang",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640424",
      "orcid": "0000-0001-9462-9835"
    },
    {
      "name": "Luke S. Murray",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365176",
      "orcid": "missing"
    },
    {
      "name": "David R. Karger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100337812/rel-imgonly/square-photo-2.0569-17-centered.jpg",
      "acmid": "81100337812",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Foundry 376. 2017. Mailspring. https://getmailspring.com.",
      "doi": ""
    },
    {
      "text": "Gediminas Adomavicius and Alexander Tuzhilin. 2011. Context-Aware Recommender Systems. Springer US, Boston, MA, 217--253.",
      "doi": ""
    },
    {
      "text": "Tarfah Alrashed, Ahmed Hassan Awadallah, and Susan Dumais. 2018. The Lifetime of Email Messages: A Large-Scale Analysis of Email Revisitation. In Proceedings of the 2018 Conference on Human Information Interaction&Retrieval (CHIIR '18). ACM, New York, NY, USA, 120--129.  ",
      "doi": "10.1145/3176349.3176398"
    },
    {
      "text": "Victoria Bellotti, Nicolas Ducheneaut, Mark Howard, and Ian Smith. 2003. Taking email to task: the design and evaluation of a task management centered email tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Frank Bentley, Nediyana Daskalova, and Nazanin Andalibi. 2017. If a person is emailing you, it just doesn't make sense: Exploring Changing Consumer Behaviors in Email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 85--95.  ",
      "doi": "10.1145/3025453.3025613"
    },
    {
      "text": "Christian Bird, Alex Gourley, Prem Devanbu, Michael Gertz, and Anand Swaminathan. 2006. Mining email social networks. In Proceedings of the 2006 international workshop on Mining software repositories (MSR '06). ACM, New York, NY, USA, 137--143.  ",
      "doi": "10.1145/1137983.1138016"
    },
    {
      "text": "Michael Bolin, Matthew Webber, Philip Rha, Tom Wilson, and Robert C. Miller. 2005. Automation and customization of rendered web pages. In Proceedings of the 13th international conference on Intelligent user interfaces (IUI '05). ACM, New York, NY, USA, 163--172.  ",
      "doi": "10.1145/1095034.1095062"
    },
    {
      "text": "boomerang. 2016. boomerang. http://www.boomeranggmail.com.",
      "doi": ""
    },
    {
      "text": "Nathanial S. Borenstein. 1992. Computational mail as network infrastructure for computer-supported cooperative work. In Proceedings of the 1992 ACM conference on Computer-supported cooperative work. (CSCW '92). ACM, New York, NY, USA, 67--74.  ",
      "doi": "10.1145/143457.143463"
    },
    {
      "text": "Horatiu Bota, Paul N. Bennett, Ahmed Hassan Awadallah, and Susan T. Dumais. 2017. Self-Es: the role of emails-to-self in personal information management. In Proceedings of the 2017 Conference on Human Information Interaction&Retrieval (CHIIR '17). ACM, New York, NY, USA, 205--214.  ",
      "doi": "10.1145/3020165.3020189"
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '04). ACM, New York, NY, USA, 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Laura A. Dabbish, Robert E. Kraut, Susan Fussell, and Sara Kiesler. 2005. Understanding email use: predicting action on a message. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 691--700.  ",
      "doi": "10.1145/1054972.1055068"
    },
    {
      "text": "Senad Dizdar. 2011. CloudHQ. https://linux.die.net/man/1/procmail.",
      "doi": ""
    },
    {
      "text": "Marian Dork, Daniel Gruen, Carey Williamson, and Sheelagh Carpendale. 2010. A visual backchannel for large-scale events. In IEEE transactions on visualization and computer graphics (Vis '10), Vol. 16. IEEE, 1129--1138.  ",
      "doi": "10.1109/TVCG.2010.129"
    },
    {
      "text": "Mark Dredze, Tessa Lau, and Nicholas Kushmerick. 2006. Automatically classifying emails into activities. In Proceedings of the 11th international conference on Intelligent user interfaces (IUI '06). ACM, New York, NY, USA, 70--77.  ",
      "doi": "10.1145/1111449.1111471"
    },
    {
      "text": "Mark Dredze, Bill N. Schilit, and Peter Norvig. 2009. Suggesting Email View Filters for Triage and Search. In Proceedings of the Twenty-First International Joint Conference on Artificial Intelligence (IJCAI '09). AAAI, Palo Alto, CA, USA, 1414--1419. https://www.aaai.org/ocs/index.php/ IJCAI/IJCAI-09/paper/viewFile/488/909 ",
      "doi": "10.5555/1661445.1661672"
    },
    {
      "text": "Mark Dredze, Hanna M. Wallach, Danny Puller, and Fernando Pereira. 2008. Automatically classifying emails into activities. In Proceedings of the 13th international conference on Intelligent user interfaces (IUI '08). ACM, New York, NY, USA, 199--206.",
      "doi": ""
    },
    {
      "text": "Mozilla Foundation. 2004. Mozilla Thunderbird. https://www. thunderbird.net/.",
      "doi": ""
    },
    {
      "text": "Google. 2014. Google Inbox. https://inbox.google.com/.",
      "doi": ""
    },
    {
      "text": "Sukeshini A. Grandhi and Lyndsey K. Lanagan-Leitzel. 2016. To Reply or To Reply All: Understanding Replying Behavior in Group Email Communication. In Proceedings of the 2016 ACM conference on Computer-supported cooperative work. (CSCW '16). ACM, New York, NY, USA, 560--569.  ",
      "doi": "10.1145/2818048.2819981"
    },
    {
      "text": "Catherine Grevet, David Choi, Debra Kumar, and Eric Gilbert. 2014. Overload is overloaded: email in the age of Gmail. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 793--802.  ",
      "doi": "10.1145/2556288.2557013"
    },
    {
      "text": "Daniel Gruen, Steven L. Rohall, Suzanne Minassian, Bernard Kerr, Paul Moody, Bob Stachel, Martin Wattenberg, and Eric Wilcox. 2004. Lessons from the reMail prototypes. In Proceedings of the 2004 ACM conference on Computer supported cooperative work (CSCW '04). ACM, New York, NY, USA, 152--161.  ",
      "doi": "10.1145/1031607.1031634"
    },
    {
      "text": "Philip A. Guenther. 1990. procmail. https://linux.die.net/man/1/ procmail.",
      "doi": ""
    },
    {
      "text": "William C. Hill, James D. Hollan, Dave Wroblewski, and Tim McCandless. 1992. Edit wear and read wear. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, New York, NY, USA, 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Edward Hung. 2001. Deduction of Procmail Recipes from Classified Emails. CMSC724 Database Management Systems, individual research project report (2001).",
      "doi": ""
    },
    {
      "text": "IFTTT. 2010. IFTTT Gmail. https://ifttt.com/gmail.",
      "doi": ""
    },
    {
      "text": "GrexIt Inc. 2011. hiver. https://hiverhq.com.",
      "doi": ""
    },
    {
      "text": "Anjuli Kannan, Karol Kurach, Sujith Ravi, Tobias Kaufmann, Andrew Tomkins, Balint Miklos, Greg Corrado, Laszlo Lukacs, Marina Ganea, Peter Young, et al. 2016. Smart reply: Automated response suggestion for email. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '16). ACM, New York, NY, USA, 955--964.  ",
      "doi": "10.1145/2939672.2939801"
    },
    {
      "text": "Shih-Wen Ke, Chris Bowerman, and Michael Oakes. 2006. Perc: A personal email classifier. European Conference on Information Retrieval (2006), 460--463.  ",
      "doi": "10.1007/11735106_41"
    },
    {
      "text": "Nicolas Kokkalis, Johannes Roith Chengdiao Fan, Michael S. Bernstein, and Scott Klemmer. 2017. MyriadHub: Efficiently Scaling Personalized Email Conversations with Valet Crowdsourcing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 73--84.  ",
      "doi": "10.1145/3025453.3025954"
    },
    {
      "text": "Gilly Leshed, Eben M. Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: automating & sharing how-to knowledge in the enterprise. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1719--1728.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Wendy E Mackay. 1998. More than just a communication system: diversity in the use of electronic mail. In Proceedings of the 1998 ACM conference on Computer supported cooperative work (CSCW '98). ACM, CHI 2019, May 4--9, 2019, Glasgow, Scotland UK S. Park et al. New York, NY, USA, 344--353.  ",
      "doi": "10.1145/62266.62293"
    },
    {
      "text": "Kaitlin Mahar, Amy X Zhang, and David Karger. 2018. Squadbox: A Tool to Combat Email Harassment Using Friendsourced Moderation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 586--599.  ",
      "doi": "10.1145/3173574.3174160"
    },
    {
      "text": "Mailbird. 2013. Mailbird. https://www.getmailbird.com.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email duration, batching and selfinterruption: Patterns of email use on productivity and stress. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1717--1728.  ",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Luke McDowell, Oren Etzioni, Alon Halevy, and Henry Levy. 2004. Semantic email. In Proceedings of the 13th international conference on World Wide Web (WWW '04). ACM, New York, NY, USA, 244--254.  ",
      "doi": "10.1145/988672.988706"
    },
    {
      "text": "Microsoft. 2018. Microsoft Flow. https://flow.microsoft.com/en-us/.",
      "doi": ""
    },
    {
      "text": "Michael Muller and Daniel Gruen. 2002. Collaborating within not through email: Users reinvent a familiar technology.",
      "doi": ""
    },
    {
      "text": "Michael J. Muller and Daniel M. Gruen. 2005. Working together inside an emailbox. In Proceedings ECSCW 2005 (ECSCW '05). Springer, Dordrecht, 103--122. ",
      "doi": "10.5555/1242029.1242035"
    },
    {
      "text": "Kanika Narang, Susan T. Dumais, Nick Craswell, Dan Liebling, and Qingyao Ai. 2017. Large-scale analysis of email search and organizational strategies. In Proceedings of the 2017 Conference on Human Information Interaction&Retrieval (CHIIR '17). ACM, New York, NY, USA, 215--223.  ",
      "doi": "10.1145/3020165.3020175"
    },
    {
      "text": "Bonnie A. Nardi, Steve Whittaker, and Erin Bradner. 2000. Interaction and Outeraction: Instant Messaging in Action. In Proceedings of the 2000 ACM conference on Computer supported cooperative work (CSCW '00). ACM, New York, NY, USA, 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Carman Neustaedter, A J. Bernheim Brush, Marc Smith, and Danyel Fisher. 2005. The Social Network and Relationship Finder: Social Sorting for Email Triage. Proceedings of the 2005 Conference on Email and Anti-Spam (CEAS).",
      "doi": ""
    },
    {
      "text": "Stephen Oney, Brad Myers, and Joel Brandt. 2014. InterState: a language and environment for expressing interface behavior. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 263--272.  ",
      "doi": "10.1145/2642918.2647358"
    },
    {
      "text": "Carnegie Mellon University Cyrus Project. 2008. sieve. http://sieve.info.",
      "doi": ""
    },
    {
      "text": "Steven L. Rohall, Daniel Gruen, Paul Moody, and Seymour Kellerman. 2001. Email visualizations to aid communications. In Proceedings of InfoVis 2001 The IEEE Symposium on Information Visualization (InfoVis '01). IEEE, 15.",
      "doi": ""
    },
    {
      "text": "Abigail J Sellen, Rachel Murphy, and Kate L Shaw. 2002. How knowledge workers use the web. In Proceedings of the SIGCHI Conference on Human Factors in Computing System (CHI '02). ACM, New York, NY, USA, 227--234.  ",
      "doi": "10.1145/503376.503418"
    },
    {
      "text": "Nikash Singh, Martin Tomitsch, and Mary Lou Maher. 2006. Understanding the management and need for awareness of temporal information in email. In Proceedings of the 2006 international workshop on Mining software repositories (MSR '06). ACM, New York, NY, USA, 137--143.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Saiganesh Swaminathan, Raymond Fok, Fanglin Chen, Ting-Hao Kenneth Huang, Irene Lin, Rohan Jadvani, Walter S. Lasecki, and Jeffrey P. Bigham. 2017. WearMail: On-the-Go Access to Information in Your Email with a Privacy-Preserving Human Computation Workflow. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 807--815.  ",
      "doi": "10.1145/3126594.3126603"
    },
    {
      "text": "Agnieszka Matysiak Szóstek. 2011. 'Dealing with My Emails': Latent user needs in email management. Computers in Human Behavior 27, 2 (2011), 723--729.  ",
      "doi": "10.1016/j.chb.2010.09.019"
    },
    {
      "text": "Jaime Teevan, Christine Alvarado, Mark S. Ackerman, and David R. Karger. 2004. The perfect search engine is not enough: a study of orienteering behavior in directed search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 415--422.  ",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "Joshua R Tyler and John C Tang. 2003. When can I expect an email response? A study of rhythms in email usage. In ECSCW 2003. Springer, 239--258. ",
      "doi": "10.5555/1241889.1241902"
    },
    {
      "text": "Stephen Voida, Elizabeth D. Mynatt, Blair MacIntyre, and Gregory M. Corso. 2002. Integrating virtual and physical context to support knowledge workers. IEEE Pervasive Computing 1 (2002), 73--79.  ",
      "doi": "10.1109/MPRV.2002.1037725"
    },
    {
      "text": "Martin Wattenberg, Steven L. Rohall, Daniel Gruen, and Bernard Kerr. 2005. E-mail research: Targeting the enterprise. HumanComputer Interaction 20, 2 (2005), 139--162.  ",
      "doi": "10.1207/s15327051hci2001%25262_5"
    },
    {
      "text": "Steve Whittaker, Victoria Bellotti, and Jacek Gwizdka. 2006. Email in personal information management. Commun. ACM 49, 1 (2006), 68--73.  ",
      "doi": "10.1145/1107458.1107494"
    },
    {
      "text": "Steve Whittaker and Candace Sidner. 1996. Email overload: exploring personal information management of email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 793--802.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Shinjae Yoo, Yiming Yang, and Jaime Carbonell. 2011. Modeling personalized email prioritization: classification-based and regression-based approaches. In Proceedings of the 20th ACM international conference on Information and knowledge management (CIKM '11). ACM, New York, NY, USA, 729--738.  ",
      "doi": "10.1145/2063576.2063683"
    },
    {
      "text": "Amy X. Zhang, Mark S. Ackerman, and David R. Karger. 2015. Mailing Lists: Why Are They Still Here, What's Wrong With Them, and How Can We Fix Them?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 4009--4018.  ",
      "doi": "10.1145/2702123.2702194"
    },
    {
      "text": "Amy X. Zhang and Justin Cranshaw. 2018. Making Sense of Group Chat Through Collaborative Tagging and Summarization. In Proceedings of the 2018 ACM conference on Computer supported cooperative work (CSCW '18). ACM, New York, NY, USA, 196--223.  ",
      "doi": "10.1145/3274465"
    },
    {
      "text": "Qian Zhao, Paul Bennett, Adam Fourney, Anne Loomis Thompson, Shane Williams, Adam D. Troy, and Susan Dumais. 2018. CalendarAware Proactive Email Recommendation. In Proceedings of the 41st Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '18). ACM, New York, NY, USA, 655--664.  ",
      "doi": "10.1145/3209978.3210001"
    }
  ]
}