{
  "doi": "10.1145/3290605.3300563",
  "title": "Rumors and Collective Sensemaking: Managing Ambiguity in an Informal Marketplace",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Rumors are an enduring form of communication across socio-cultural landscapes globally. Counter to their typical negative association, rumors play a nuanced role, helping people collectively deal with problems through constructing a representation of an uncertain situation. Drawing on unstructured interviews and participant observation from a technology goods marketplace in Bangalore, India, we study the circulation of rumors related to the government's recent policy of demonetization and entry of online marketplaces and digital wallets, all of which disrupted existing market practices. These rumors emerge as attempts at sensemaking when a community is faced with ambiguity. Through highlighting the relationship of institutional trust with rumors, the paper argues that the study of rumors can help us identify the concerns of a community in the face of differential power relations. Further, rumors are a form of social bonding which help communities make sense of their place in society and shape existing practices.",
  "tags": [
    "informal communication",
    "informality",
    "rumors",
    "informal markets",
    "uncertainty",
    "institutions",
    "marketplaces"
  ],
  "authors": [
    {
      "name": "Priyank Chandra",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714851",
      "orcid": "0000-0003-4024-8871"
    },
    {
      "name": "Joyojeet Pal",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100249207",
      "orcid": "0000-0002-9076-2046"
    }
  ],
  "references": [
    {
      "text": "Gordon W Allport and Leo Postman. 1947. The psychology of rumor. (1947).",
      "doi": ""
    },
    {
      "text": "Uwe Altrock. 2012. Conceptualising informality: Some thoughts on the way towards generalisation. Urban informalities: Reflections on the formal and informal (2012), 171--194.",
      "doi": ""
    },
    {
      "text": "Cynthia A Andrews, Elodie S Fichet, Yuwei Ding, Emma S Spiro, and Kate Starbird. 2016. Keeping Up with the Tweet-dashians: The Impact of Official- Accounts on Online Rumoring. ACM Press, 451--464.",
      "doi": ""
    },
    {
      "text": "S. Bird. 2007. Sensemaking and Identity: The Interconnection of Storytelling and Networking in a Women's Group of a Large Corporation. Journal of Business Communication, Vol. 44, 4 (Oct. 2007), 311--339. https://doi.org/10/d55c2r",
      "doi": ""
    },
    {
      "text": "Alexander Boden, Frank Rosswog, Gunnar Stevens, and Volker Wulf. 2014. Articulation spaces: bridging the gap between formal and informal coordination. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 1120--1130.  ",
      "doi": "10.1145/2531602.2531621"
    },
    {
      "text": "Prashant Bordia, Elizabeth Jones, Cindy Gallois, Victor J. Callan, and Nicholas DiFonzo. 2006. Management Are Aliens!: Rumors and Stress during Organizational Change. Group & Organization Management, Vol. 31, 5 (Oct. 2006), 601--621. https://doi.org/10/d4t4gg",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2011. User agency in the middle range: Rumors and the reinvention of the Internet in Accra, Ghana. Science, Technology, & Human Values, Vol. 36, 2 (2011), 139--159.",
      "doi": ""
    },
    {
      "text": "Priyank Chandra. 2017. Informality and Invisibility: Traditional Technologies As Tools for Collaboration in an Informal Market. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4765--4775.  ",
      "doi": "10.1145/3025453.3025643"
    },
    {
      "text": "Priyank Chandra, Syed Ishtiaque Ahmed, and Joyojeet Pal. 2017. Market Practices and the Bazaar: Technology Consumption in ICT Markets in the Global South. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4741--4752.  ",
      "doi": "10.1145/3025453.3025970"
    },
    {
      "text": "Priyank Chandra and Jay Chen. 2019. Taming the Amazon: The Domestication of Online Shopping in Bangalore, India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development (ICTD '19). ACM, New York, NY, USA, Article 9, bibinfonumpages11 pages.  ",
      "doi": "10.1145/3287098.3287105"
    },
    {
      "text": "Yunan Chen, Charlotte Tang, Xiaomu Zhou, Aleksandra Sarcevic, and Soyoung Lee. 2013. Beyond formality: informal communication in health practices. In Proceedings of the 2013 conference on Computer supported cooperative work companion. ACM, 307--312.  ",
      "doi": "10.1145/2441955.2442030"
    },
    {
      "text": "David Coast and Jo Fox. 2015. Rumour and Politics: Rumour and Politics. History Compass, Vol. 13, 5 (May 2015), 222--234. https://doi.org/10/gc96v3",
      "doi": ""
    },
    {
      "text": "Daniel Cook. 2008. Lived experiences of public consumption: encounters with value in marketplaces on five continents .Springer.",
      "doi": ""
    },
    {
      "text": "Nicholas DiFonzo and Prashant Bordia. 2007. Rumor, Gossip and Urban Legends. Diogenes, Vol. 54, 1 (Feb. 2007), 19--35.",
      "doi": ""
    },
    {
      "text": "Nicholas DiFonzo, Prashant Bordia, and Ralph L Rosnow. 1994. Reining in rumors. Organizational Dynamics, Vol. 23, 1 (1994), 47--62.",
      "doi": ""
    },
    {
      "text": "Gary Alan Fine. 2007. Rumor, trust and civil society: Collective memory and cultures of judgment. Diogenes, Vol. 54, 1 (2007), 5--18.",
      "doi": ""
    },
    {
      "text": "Gary Alan Fine and Patricia A Turner. 2001. Whispers on the color line: Rumor and race in America. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Clifford Geertz. 1978. The bazaar economy: Information and search in peasant marketing. The American Economic Review, Vol. 68, 2 (1978), 28--32. http://www.jstor.org/stable/1816656",
      "doi": ""
    },
    {
      "text": "Anahita Gheytanchi, Lisa Joseph, Elaine Gierlach, Satoko Kimpara, Jennifer Housley, Zeno E. Franco, and Larry E. Beutler. 2007. The dirty dozen: Twelve failures of the Hurricane Katrina response and how psychology can help. American Psychologist, Vol. 62, 2 (2007), 118--130. https://doi.org/10/c7j4f9",
      "doi": ""
    },
    {
      "text": "Max Gluckman. 1963. Gossip and scandal. Current anthropology, Vol. 4, 3 (1963), 307--316.",
      "doi": ""
    },
    {
      "text": "Mark Granovetter. 1985. Economic action and social structure: the problem of embeddedness. American journal of sociology (1985), 481--510.",
      "doi": ""
    },
    {
      "text": "Term L Griffith. 1999. Technology features as triggers for sensemaking. Academy of Management review, Vol. 24, 3 (1999), 472--488.",
      "doi": ""
    },
    {
      "text": "Gary Gumpert and Susan J Drucker. 1992. From the agora to the electronic shopping mall. Critical Studies in Media Communication, Vol. 9, 2 (1992), 186--200.",
      "doi": ""
    },
    {
      "text": "Nicholas Harney. 2006. Rumour, migrants, and the informal economies of Naples, Italy. International Journal of Sociology and Social Policy, Vol. 26, 9/10 (Sept. 2006), 374--384. https://doi.org/10/dv37q8",
      "doi": ""
    },
    {
      "text": "B. Kelsey Jack, Paulina Oliva, Christopher Severen, and Samuel Bell. 2015. Technology adoption under uncertainty .",
      "doi": ""
    },
    {
      "text": "Freek Janssens and Ceren Sezer. 2013. Marketplaces as an urban development strategy. Built Environment, Vol. 39, 2 (2013), 169--171.",
      "doi": ""
    },
    {
      "text": "Ian G Johnson, Alistair MacDonald, Jo Briggs, Jennifer Manuel, Karen Salt, Emma Flynn, and John Vines. 2017. Community Conversational: Supporting and Capturing Deliberative Talk in Local Consultation Processes. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2320--2333.  ",
      "doi": "10.1145/3025453.3025559"
    },
    {
      "text": "Jean-Noël Kapferer. 1992. How rumors are born. Society, Vol. 29, 5 (1992), 53--60.",
      "doi": ""
    },
    {
      "text": "Allan J. Kimmel. 2004. Rumors and the Financial Marketplace. Journal of Behavioral Finance, Vol. 5, 3 (Sept. 2004), 134--141. https://doi.org/10/bw96d7",
      "doi": ""
    },
    {
      "text": "Peter Krafft, Kaitlyn Zhou, Isabelle Edwards, Kate Starbird, and Emma S Spiro. 2017. Centralized, parallel, and distributed information processing during collective sensemaking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2976--2987.  ",
      "doi": "10.1145/3025453.3026012"
    },
    {
      "text": "Helen B Lamb. 1955. The Indian business communities and the evolution of an industrialist class. Pacific Affairs, Vol. 28, 2 (1955), 101--116.",
      "doi": ""
    },
    {
      "text": "Qinying Liao and Lei Shi. 2013. She gets a sports car from our donation: rumor transmission in a chinese microblogging community. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 587--598.  ",
      "doi": "10.1145/2441776.2441842"
    },
    {
      "text": "Leah Lievrouw. 2006. New media design and development: Diffusion of innovations vs. social shaping of technology. The handbook of new media (2006), 246--265.",
      "doi": ""
    },
    {
      "text": "Laurence Marfaing and Alena Thiel. 2014. Demystifying Chinese business strength in urban Senegal and Ghana: structural change and the performativity of rumours. Canadian Journal of African Studies / Revue canadienne des études africaines, Vol. 48, 3 (Sept. 2014), 405--423. https://doi.org/10/gc6ztf",
      "doi": ""
    },
    {
      "text": "Dan E. Miller. 1992. \"Snakes in the Greens\" and Rumor in the Innercity. The Social Science Journal, Vol. 29, 4 (1992), 381--393.",
      "doi": ""
    },
    {
      "text": "Hamid Mowlana. 1979. Technology versus Tradition: Communication in the Iranian Revolution. Journal of Communication, Vol. 29, 3 (Sept. 1979), 107--112. https://doi.org/10/dwv2nn",
      "doi": ""
    },
    {
      "text": "Wanda J Orlikowski and Debra C Gash. 1994. Technological frames: making sense of information technology in organizations. ACM Transactions on Information Systems (TOIS), Vol. 12, 2 (1994), 174--207.  ",
      "doi": "10.1145/196734.196745"
    },
    {
      "text": "Robert Paine. 1967. What is gossip about? An alternative hypothesis. Man, Vol. 2, 2 (1967), 278--285.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Priyank Chandra, Vaishnav Kameswaran, Aakanksha Parameshwar, Sneha Joshi, and Aditya Johri. 2018. Digital Payment and Its Discontents: Street Shops and the Indian Government's Push for Cashless Transactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 229, bibinfonumpages13 pages.  ",
      "doi": "10.1145/3173574.3173803"
    },
    {
      "text": "Everett M Rogers. 2010. Diffusion of innovations .Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "David R Romero and Antonieta Mercado. 2017. Cleaning San Diego: Migration, geography, exclusion, and resistance. Ethnicities (2017), 1468796817740174.",
      "doi": ""
    },
    {
      "text": "Ralph L Rosnow. 1991. Inside rumor: A personal journey. American Psychologist, Vol. 46, 5 (1991), 484.",
      "doi": ""
    },
    {
      "text": "Ralph L Rosnow and Gary A Fine. 1976. Rumor and gossip: The social psychology of hearsay. Elsevier.",
      "doi": ""
    },
    {
      "text": "Saskia Sassen. 1994. The informal economy: Between new developments and old regulations. Yale Law Journal (1994), 2289--2304.",
      "doi": ""
    },
    {
      "text": "Larry Seligman. 2006. Sensemaking throughout adoption and the innovation-decision process. European Journal of Innovation Management, Vol. 9, 1 (2006), 108--120.",
      "doi": ""
    },
    {
      "text": "Tamotsu Shibutani. 1966. Improvised news .Ardent Media.",
      "doi": ""
    },
    {
      "text": "Kate Starbird, Dharma Dailey, Owla Mohamed, Gina Lee, and Emma S Spiro. 2018. Engage Early, Correct More: How Journalists Participate in False Rumors Online during Crisis Events. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 105.  ",
      "doi": "10.1145/3173574.3173679"
    },
    {
      "text": "Kate Starbird, Emma Spiro, Isabelle Edwards, Kaitlyn Zhou, Jim Maddock, and Sindhuja Narasimhan. 2016. Could this be true?: I think so! Expressed uncertainty in online rumoring. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 360--371.  ",
      "doi": "10.1145/2858036.2858551"
    },
    {
      "text": "Ileana Stigliani and Davide Ravasi. 2012. Organizing thoughts and connecting brains: Material practices and the transition from individual to group-level prospective sensemaking. Academy of Management Journal, Vol. 55, 5 (2012), 1232--1259.",
      "doi": ""
    },
    {
      "text": "Evan T Straub. 2009. Understanding technology adoption: Theory and future directions for informal learning. Review of educational research, Vol. 79, 2 (2009), 625--649.",
      "doi": ""
    },
    {
      "text": "Patricia A Turner. 1994. I heard it through the grapevine: Rumor in African-American culture .Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Karl E Weick. 1995. Sensemaking in organizations (Foundations for organizational science). Thousands Oaks: Sage Publications Inc (1995).",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, David Frohlich, and Owen Daly-Jones. 1994. Informal workplace communication: What is it like and how might we support it?. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 131--137.  ",
      "doi": "10.1145/191666.191726"
    },
    {
      "text": "Chien Wen Yuan, Leslie D Setlock, Dan Cosley, and Susan R Fussell. 2013. Understanding informal communication in multilingual contexts. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 909--922.  ",
      "doi": "10.1145/2441776.2441880"
    }
  ]
}