{
  "doi": "10.1145/3290605.3300733",
  "title": "23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Ten years ago, Thaler and Sunstein introduced the notion of nudging to talk about how subtle changes in the 'choice architecture' can alter people's behaviors in predictable ways. This idea was eagerly adopted in HCI and applied in multiple contexts, including health, sustainability and privacy. Despite this, we still lack an understanding of how to design effective technology-mediated nudges. In this paper we present a systematic review of the use of nudging in HCI research with the goal of laying out the design space of technology-mediated nudging - the why (i.e., which cognitive biases do nudges combat) and the how (i.e., what exact mechanisms do nudges employ to incur behavior change). All in all, we found 23 distinct mechanisms of nudging, grouped in 6 categories, and leveraging 15 different cognitive biases. We present these as a framework for technology-mediated nudging, and discuss the factors shaping nudges' effectiveness and their ethical implications.",
  "tags": [
    "nudging",
    "persuasive technology",
    "behavioral economics"
  ],
  "authors": [
    {
      "name": "Ana Caraban",
      "institution": "Instituto Superior Técnico, Persuasive Tech Lab, Madeira-ITI, Funchal, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959108457",
      "orcid": "missing"
    },
    {
      "name": "Evangelos Karapanos",
      "institution": "Persuasive Tech Lab, Cyprus University of Technology, Limassol, Cyprus",
      "img": "/do/10.1145/contrib-81350586193/rel-imgonly/81350586193.jpg",
      "acmid": "81350586193",
      "orcid": "missing"
    },
    {
      "name": "Daniel Gonçalves",
      "institution": "Instituto Superior Técnico, University of Lisbon, Funchal, Portugal",
      "img": "/do/10.1145/contrib-81100240223/rel-imgonly/317_face.jpg",
      "acmid": "81100240223",
      "orcid": "missing"
    },
    {
      "name": "Pedro Campos",
      "institution": "Madeira-ITI, University of Madeira, Funchal, Portugal",
      "img": "/do/10.1145/contrib-81100563237/rel-imgonly/eu_med_hr.jpeg",
      "acmid": "81100563237",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander T Adams, Jean Costa, Malte F Jung, and Tanzeem Choudhury. 2015. Mindless computing: designing technologies to subtly influence behavior. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 719--730.  ",
      "doi": "10.1145/2750858.2805843"
    },
    {
      "text": "Eytan Adar, Desney S Tan, and Jaime Teevan. 2013. Benevolent deception in human computer interaction. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1863--1872.  ",
      "doi": "10.1145/2470654.2466246"
    },
    {
      "text": "Elena Agapie, Gene Golovchinsky, and Pernilla Qvarfordt. 2013. Leading people to longer queries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3019--3022.  ",
      "doi": "10.1145/2470654.2481418"
    },
    {
      "text": "Mahdi Nasrullah Al-Ameen, Matthew Wright, and Shannon Scielzo. 2015. Towards Making Random Passwords Memorable: Leveraging Users' Cognitive Ability Through Multiple Cues. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2315--2324.  ",
      "doi": "10.1145/2702123.2702241"
    },
    {
      "text": "Ernesto Arroyo, Leonardo Bonanni, and Nina Valkanova. 2012. Embedded interaction in a water fountain for motivating behavior change in public space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 685--688.  ",
      "doi": "10.1145/2207676.2207773"
    },
    {
      "text": "John A Bargh, Peter M Gollwitzer, Annette Lee-Chai, Kimberly Barndollar, and Roman Trötschel. 2001. The automated will: nonconscious activation and pursuit of behavioral goals. Journal of personality and social psychology 81, 6 (2001), 1014.",
      "doi": ""
    },
    {
      "text": "Oswald Barral, Gabor Aranyi, Sid Kouider, Alan Lindsay, Hielke Prins, Imtiaj Ahmed, Giulio Jacucci, Paolo Negri, Luciano Gamberini, David Pizzi, et al. 2014. Covert persuasive technologies: bringing subliminal cues to human-computer interaction. In International Conference on Persuasive Technology. Springer, 1--12.  ",
      "doi": "10.1007/978-3-319-07127-5_1"
    },
    {
      "text": "Ian J Bateman, Alistair Munro, and Gregory L Poe. 2008. Decoy effects in choice experiments and contingent valuation: asymmetric dominance. Land Economics 84, 1 (2008), 115--127.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister, Todd F Heatherton, and Dianne M Tice. 1994. Losing control: How and why people fail at self-regulation. Academic press.",
      "doi": ""
    },
    {
      "text": "Henry K Beecher. 1955. The powerful placebo. Journal of the American Medical Association 159, 17 (1955), 1602--1606.",
      "doi": ""
    },
    {
      "text": "Robin N Brewer and Jasmine Jones. 2015. Pinteresce: exploring reminiscence as an incentive to digital reciprocity for older adults. In Proceedings of the 18th ACM conference companion on computer supported cooperative work & social computing. ACM, 243--246.  ",
      "doi": "10.1145/2685553.2699017"
    },
    {
      "text": "Shun Cai and Yunjie Xu. 2008. Designing product lists for e-commerce: The effects of sorting on consumer decision making. Intl. Journal of Human--Computer Interaction 24, 7 (2008), 700--721.",
      "doi": ""
    },
    {
      "text": "Ana Caraban, Maria José Ferreira, Rúben Gouveia, and Evangelos Karapanos. 2015. Social toothbrush: fostering family nudging around tooth brushing habits. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers. ACM, 649--653.  ",
      "doi": "10.1145/2800835.2809438"
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Vítor Teixeira, Sean A Munson, and Pedro Campos. 2017. On the design of subly: Instilling behavior change during web surfing through subliminal priming. In International Conference on Persuasive Technology. Springer, 163--174.",
      "doi": ""
    },
    {
      "text": "Justin Cheng, Chinmay Kulkarni, and Scott Klemmer. 2013. Tools for predicting drop-off in large online classes. In Proceedings of the 2013 conference on Computer supported cooperative work companion. ACM, 121--124.  ",
      "doi": "10.1145/2441955.2441987"
    },
    {
      "text": "Luca Chittaro. 2016. Tailoring Web Pages for Persuasion on Prevention Topics: Message Framing, Color Priming, and Gender. In International Conference on Persuasive Technology. Springer, 3--14.  ",
      "doi": "10.1007/978-3-319-31510-2_1"
    },
    {
      "text": "Robert B Cialdini. 1987. Influence. Vol. 3. A. Michel Port Harcourt.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Philip Quinn, and Carl Gutwin. 2015. Examining the peak-end effects of subjective experience. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 357--366.  ",
      "doi": "10.1145/2702123.2702139"
    },
    {
      "text": "Lucas Colusso, Gary Hsieh, and Sean A Munson. 2016. Designing Closeness to Increase Gamers' Performance. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3020--3024.  ",
      "doi": "10.1145/2858036.2858206"
    },
    {
      "text": "Matthew Crowley, Aurélia Heitz, Annika Matta, Kevin Mori, and Banny Banerjee. 2011. Behavioral science-informed technology interventions for change in residential energy consumption. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 2209--2214.  ",
      "doi": "10.1145/1979742.1979926"
    },
    {
      "text": "Tawanna Dillahunt, Olga Lyra, Mary L Barreto, and Evangelos Karapanos. 2017. Reducing childrenâ?'s psychological distance from climate change via eco-feedback technologies. International Journal of Child-Computer Interaction 13 (2017), 19--28.",
      "doi": ""
    },
    {
      "text": "Paul Dolan, Michael Hallsworth, David Halpern, Dominic King, Robert Metcalfe, and Ivo Vlaev. 2012. Influencing behaviour: The mindspace way. Journal of Economic Psychology 33, 1 (2012), 264--277.",
      "doi": ""
    },
    {
      "text": "Luís Duarte and Luis Carriço. 2013. The cake can be a lie: placebos as persuasive videogame elements. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1113--1118.  ",
      "doi": "10.1145/2468356.2468555"
    },
    {
      "text": "Dean Eckles, Doug Wightman, Claire Carlson, Attapol Thamrongrattanarit, Marcello Bastea-Forte, and BJ Fogg. 2009. Social responses in mobile messaging: influence strategies, self-disclosure, and source orientation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1651--1654.  ",
      "doi": "10.1145/1518701.1518954"
    },
    {
      "text": "Johan Egebark and Mathias Ekström. 2016. Can indifference make the world greener? Journal of Environmental Economics and Management 76 (2016), 1--13.",
      "doi": ""
    },
    {
      "text": "DA Epstein, JH Kang, LR Pina, J. Fogarty, and S. A. Munson. 2016. Reconsidering the device in the drawer: lapses as a design opportunity in personal informatics. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 829--840. https://dl.acm.org/citation.cfm?id=2971656  ",
      "doi": "10.1145/2971648.2971656"
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1 (2000), 59-- 83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Barbara Fasolo, Raffaella Misuraca, Gary H McClelland, and Maurizio Cardaci. 2006. Animation attracts: The attraction effect in an online shopping environment. Psychology & Marketing 23, 10 (2006), 799--811.",
      "doi": ""
    },
    {
      "text": "Maria José Ferreira, Ana Karina Caraban, and Evangelos Karapanos. 2014. Breakout: predicting and breaking sedentary behaviour at work. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2407--2412.  ",
      "doi": "10.1145/2559206.2581330"
    },
    {
      "text": "Leon Festinger. 1954. A theory of social comparison processes. Human relations 7, 2 (1954), 117--140.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg. 2009. A behavior model for persuasive design. In Proceedings of the 4th international Conference on Persuasive Technology. ACM, 40.  ",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Alain Forget, Sonia Chiasson, Paul C van Oorschot, and Robert Biddle. 2008. Improving text passwords through persuasion. In Proceedings of the 4th symposium on Usable privacy and security. ACM, 1--12.  ",
      "doi": "10.1145/1408664.1408666"
    },
    {
      "text": "Suzanna E Forwood, Amy L Ahern, Theresa M Marteau, and Susan A Jebb. 2015. Offering within-category food swaps to reduce energy density of food purchases: a study using an experimental online supermarket. International Journal of Behavioral Nutrition and Physical Activity 12, 1 (2015), 85.",
      "doi": ""
    },
    {
      "text": "Jillian P Fry and Roni A Neff. 2009. Periodic prompts and reminders in health promotion and health behavior interventions: systematic review. Journal of medical Internet research 11, 2 (2009).",
      "doi": ""
    },
    {
      "text": "Luciano Gamberini, Giovanni Petrucci, Andrea Spoto, and Anna Spagnolli. 2007. Embedded persuasive strategies to obtain visitors data: Comparing reward and reciprocity in an amateur, knowledgebased website. In International Conference on Persuasive Technology. Springer, 187--198. ",
      "doi": "10.5555/1780402.1780434"
    },
    {
      "text": "Thomas Gilovich, Victoria Husted Medvec, and Kenneth Savitsky. 2000. The spotlight effect in social judgment: An egocentric bias in estimates of the salience of one's own actions and appearance. Journal of personality and social psychology 78, 2 (2000), 211.",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How do we engage with activity trackers?: a longitudinal study of Habito. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 1305--1316.  ",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Rúben Gouveia, Fábio Pereira, Evangelos Karapanos, Sean A Munson, and Marc Hassenzahl. 2016. Exploring the design space of glanceable feedback for physical activity trackers. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 144--155.  ",
      "doi": "10.1145/2971648.2971754"
    },
    {
      "text": "Rebecca Gulotta, Jodi Forlizzi, Rayoung Yang, and Mark Wah Newman. 2016. Fostering engagement with personal informatics systems. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 286--300.  ",
      "doi": "10.1145/2901790.2901803"
    },
    {
      "text": "Junius Gunaratne and Oded Nov. 2015. Informing and improving retirement saving performance using behavioral economics theorydriven user interfaces. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 917--920.  ",
      "doi": "10.1145/2702123.2702408"
    },
    {
      "text": "Carl Gutwin, Christianne Rooke, Andy Cockburn, Regan L Mandryk, and Benjamin Lafreniere. 2016. Peak-end effects on player experience in casual games. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 5608--5619.  ",
      "doi": "10.1145/2858036.2858419"
    },
    {
      "text": "Pelle Guldborg Hansen and Andreas Maaløe Jespersen. 2013. Nudge and the manipulation of choice: A framework for the responsible use of the nudge approach to behaviour change in public policy. European Journal of Risk Regulation 4, 1 (2013), 3--28.",
      "doi": ""
    },
    {
      "text": "Marian Harbach, Markus Hettig, SusanneWeber, and Matthew Smith. 2014. Using personal examples to improve risk communication for security & privacy decisions. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2647--2656.  ",
      "doi": "10.1145/2556288.2556978"
    },
    {
      "text": "Marc Hassenzahl and Matthias Laschke. 2015. Pleasurable troublemakers. The gameful world: Approaches, issues, applications (2015), 167--195.",
      "doi": ""
    },
    {
      "text": "Sen H Hirano, Robert G Farrell, Catalina M Danis, and Wendy A Kellogg. 2013. WalkMinder: encouraging an active lifestyle using mobile phone interruptions. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1431--1436.  ",
      "doi": "10.1145/2468356.2468611"
    },
    {
      "text": "Nic Hollinworth, Faustina Hwang, and David T Field. 2013. Using Delboeuf's illusion to improve point and click performance for older adults. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1329--1334.  ",
      "doi": "10.1145/2468356.2468593"
    },
    {
      "text": "Eleonora Ibragimova, Nick Mueller, Arnold Vermeeren, and Peter Vink. 2015. The smart steering wheel cover: Motivating safe and efficient driving. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 169--169.  ",
      "doi": "10.1145/2702613.2732487"
    },
    {
      "text": "Nassim Jafarinaimi, Jodi Forlizzi, Amy Hurst, and John Zimmerman. 2005. Breakaway: an ambient display designed to change human behavior. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 1945--1948.  ",
      "doi": "10.1145/1056808.1057063"
    },
    {
      "text": "Eric J Johnson, Suzanne B Shu, Benedict GC Dellaert, Craig Fox, Daniel G Goldstein, Gerald Häubl, Richard P Larrick, John W Payne, Ellen Peters, David Schkade, et al. 2012. Beyond nudges: Tools of a choice architecture. Marketing Letters 23, 2 (2012), 487--504.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Patrick Egan. 2011. Thinking, fast and slow. Vol. 1. Farrar, Straus and Giroux New York.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Jack L Knetsch, and Richard H Thaler. 1991. Anomalies: The endowment effect, loss aversion, and status quo bias. Journal of Economic perspectives 5, 1 (1991), 193--206.",
      "doi": ""
    },
    {
      "text": "Yvonne Kammerer and Peter Gerjets. 2014. The role of search result position and source trustworthiness in the selection of web search results when using a list or a grid interface. International Journal of Human-Computer Interaction 30, 3 (2014), 177--191.",
      "doi": ""
    },
    {
      "text": "Shipi Kankane, Carlina DiRusso, and Christen Buckley. 2018. Can We Nudge Users Toward Better Password Management?: An Initial Study. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW593.  ",
      "doi": "10.1145/3170427.3188689"
    },
    {
      "text": "Ted J Kaptchuk, JohnMKelley, Lisa A Conboy, Roger B Davis, Catherine E Kerr, Eric E Jacobson, Irving Kirsch, Rosa N Schyner, Bong Hyun Nam, Long T Nguyen, et al. 2008. Components of placebo effect: randomised controlled trial in patients with irritable bowel syndrome. Bmj 336, 7651 (2008), 999--1003.",
      "doi": ""
    },
    {
      "text": "Maurits Kaptein, Panos Markopoulos, Boris De Ruyter, and Emile Aarts. 2015. Personalizing persuasive technologies: Explicit and implicit personalization using persuasion profiles. International Journal of Human-Computer Studies 77 (2015), 38--51.  ",
      "doi": "10.1016/j.ijhcs.2015.01.004"
    },
    {
      "text": "Evangelos Karapanos. 2015. Sustaining user engagement with behavior-change tools. interactions 22, 4 (2015), 48--52.  ",
      "doi": "10.1145/2775388"
    },
    {
      "text": "Evangelos Karapanos, Jean-Bernard Martens, and Marc Hassenzahl. 2010. On the retrospective assessment of users' experiences over time: memory or actuality?. In CHI'10 Extended Abstracts on Human Factors in Computing Systems. ACM, 4075--4080.  ",
      "doi": "10.1145/1753846.1754105"
    },
    {
      "text": "Jaejeung Kim, Joonyoung Park, and Uichin Lee. 2016. EcoMeal: a smart tray for promoting healthy dietary habits. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2165--2170.  ",
      "doi": "10.1145/2851581.2892310"
    },
    {
      "text": "Matthias Laschke, Sarah Diefenbach, Thies Schneider, and Marc Hassenzahl. 2014. Keymoment: initiating behavior change through friendly friction. In Proceedings of the 8th Nordic Conference on Human- Computer Interaction: Fun, Fast, Foundational. ACM, 853--858.  ",
      "doi": "10.1145/2639189.2670179"
    },
    {
      "text": "Matthias Laschke, Marc Hassenzahl, and Sarah Diefenbach. 2011. Things with attitude: Transformational products. In Create11 conference. 1--2.",
      "doi": ""
    },
    {
      "text": "A Lazar, C Koehler, J. Tanenbaum, and D.H. Nguyen. 2015. Why we use and abandon smart devices. International Joint Conference on Pervasive and Ubiquitous Computing (2015), 635--646. https://dl.acm. org/citation.cfm?id=2804288  ",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Dan Ledger and Daniel McCaffrey. 2014. Inside wearables: How the science of human behavior change offers the secret to long-term engagement. Endeavour Partners 200, 93 (2014), 1.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining behavioral economics to design persuasive technology for healthy choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 325--334.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Sang-Su Lee, Youn-kyung Lim, and Kun-pyo Lee. 2011. A long-term study of user experience towards interaction designs that support behavior change. In CHI'11 Extended Abstracts on Human Factors in Computing Systems. ACM, 2065--2070.  ",
      "doi": "10.1145/1979742.1979909"
    },
    {
      "text": "Birthe A Lehmann, Gretchen B Chapman, Frits ME Franssen, Gerjo Kok, and Robert AC Ruiter. 2016. Changing the default to promote influenza vaccination among health care workers. Vaccine 34, 11 (2016), 1389--1392.",
      "doi": ""
    },
    {
      "text": "Q Vera Liao, Wai-Tat Fu, and Sri Shilpa Mamidi. 2015. It is all about perspective: An exploration of mitigating selective exposure with aspect indicators. In Proceedings of the 33rd annual ACM conference on Human factors in computing systems. ACM, 1439--1448.  ",
      "doi": "10.1145/2702123.2702570"
    },
    {
      "text": "Lars Lidén. 2003. Artificial stupidity: The art of intentional mistakes. AI game programming wisdom 2 (2003), 41--48.",
      "doi": ""
    },
    {
      "text": "Marilyn McGee-Lennon, Maria Wolters, Ross McLachlan, Stephen Brewster, and Cordelia Hall. 2011. Name that tune: musicons as reminders in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2803--2806.  ",
      "doi": "10.1145/1978942.1979357"
    },
    {
      "text": "Tehila Minkus, Kelvin Liu, and KeithWRoss. 2015. Children seen but not heard: When parents compromise children's online privacy. In Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 776--786.  ",
      "doi": "10.1145/2736277.2741124"
    },
    {
      "text": "Andrew Vande Moere. 2007. Towards designing persuasive ambient visualization. In Issues in the Design & Evaluation of Ambient Information Systems Workshop. 48--52.",
      "doi": ""
    },
    {
      "text": "David Moher, Alessandro Liberati, Jennifer Tetzlaff, and Douglas G Altman. 2009. Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement. Annals of internal medicine 151, 4 (2009), 264--269.",
      "doi": ""
    },
    {
      "text": "Sean A Munson, Erin Krupka, Caroline Richardson, and Paul Resnick. 2015. Effects of public commitments and accountability in a technology-supported physical activity intervention. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1135--1144.  ",
      "doi": "10.1145/2702123.2702524"
    },
    {
      "text": "Raymond S Nickerson. 1998. Confirmation bias: A ubiquitous phenomenon in many guises. Review of general psychology 2, 2 (1998), 175.",
      "doi": ""
    },
    {
      "text": "Donald A Norman. 2009. THE WAY I SEE IT Memory is more important than actuality. Interactions 16, 2 (2009), 24--26.  ",
      "doi": "10.1145/1487632.1487638"
    },
    {
      "text": "Souneil Park, Seungwoo Kang, Sangyoung Chung, and Junehwa Song. 2009. NewsCube: delivering multiple aspects of news to mitigate media bias. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 443--452.  ",
      "doi": "10.1145/1518701.1518772"
    },
    {
      "text": "Charlie Pinder, Jo Vermeulen, Russell Beale, and Robert Hendley. 2015. Subliminal priming of nonconscious goals on smartphones. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, 825--830.  ",
      "doi": "10.1145/2786567.2793707"
    },
    {
      "text": "Teppo Räisänen, Harri Oinas-Kukkonen, and Seppo Pahnila. 2008. Finding kairos in quitting smoking: Smokers perceptions of warning pictures. In International Conference on Persuasive Technology. Springer, 254--257.  ",
      "doi": "10.1007/978-3-540-68504-3_25"
    },
    {
      "text": "Ilana Ritov and Jonathan Baron. 1992. Status-quo and omission biases. Journal of risk and uncertainty 5, 1 (1992), 49--61.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, William R Hazlewood, Paul Marshall, Nick Dalton, and Susanna Hertrich. 2010. Ambient influence: Can twinkly lights lure and abstract representations trigger behavioral change?. In Proceedings of the 12th ACM international conference on Ubiquitous computing. ACM, 261--270.  ",
      "doi": "10.1145/1864349.1864372"
    },
    {
      "text": "William Samuelson and Richard Zeckhauser. 1988. Status quo bias in decision making. Journal of risk and uncertainty 1, 1 (1988), 7--59.",
      "doi": ""
    },
    {
      "text": "Anuj K Shah and Daniel M Oppenheimer. 2008. Heuristics made easy: An effort-reduction framework. Psychological bulletin 134, 2 (2008), 207.",
      "doi": ""
    },
    {
      "text": "Patrick C Shih, Kyungsik Han, Erika Shehan Poole, Mary Beth Rosson, and John M Carroll. 2015. Use and adoption challenges of wearable activity trackers. IConference 2015 Proceedings (2015).",
      "doi": ""
    },
    {
      "text": "Paul Slovic, Melissa L Finucane, Ellen Peters, and Donald G Mac- Gregor. 2007. The affect heuristic. European journal of operational research 177, 3 (2007), 1333--1352.",
      "doi": ""
    },
    {
      "text": "Barry M Staw. 1981. The escalation of commitment to a course of action. Academy of management Review 6, 4 (1981), 577--587.",
      "doi": ""
    },
    {
      "text": "Fritz Strack and Roland Deutsch. 2004. Reflective and impulsive determinants of social behavior. Personality and social psychology review 8, 3 (2004), 220--247.",
      "doi": ""
    },
    {
      "text": "Erin J Strahan, Steven J Spencer, and Mark P Zanna. 2002. Subliminal priming and persuasion: Striking while the iron is hot. Journal of Experimental Social Psychology 38, 6 (2002), 556--568.",
      "doi": ""
    },
    {
      "text": "Cass Sunstein. 2013. Impersonal default rules vs. active choices vs. personalized default rules: A triptych. (2013).",
      "doi": ""
    },
    {
      "text": "Cass Sunstein and Richard Thaler. 2008. Nudge: Improving decisions about health, wealth, and happiness.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 2017. Nudges that fail. Behavioural Public Policy 1, 1 (2017), 4--25.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, Rob Comber, Julia Miebach, Jack Weeden, Nicole Kraemer, Shaun Lawson, and Patrick Olivier. 2012. We've bin watching you: designing for reflection and social persuasion to promote sustainable lifestyles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2337--2346.  ",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Yaacov Trope and Nira Liberman. 2010. Construal-level theory of psychological distance. Psychological review 117, 2 (2010), 440.",
      "doi": ""
    },
    {
      "text": "James Turland, Lynne Coventry, Debora Jeske, Pam Briggs, and Aad van Moorsel. 2015. Nudging towards security: Developing an application for wireless network selection for android phones. In Proceedings of the 2015 British HCI conference. ACM, 193--201.  ",
      "doi": "10.1145/2783446.2783588"
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1974. Judgment under uncertainty: Heuristics and biases. science 185, 4157 (1974), 1124--1131.",
      "doi": ""
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A field trial of privacy nudges for facebook. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 2367--2376.  ",
      "doi": "10.1145/2556288.2557413"
    },
    {
      "text": "Markus Weinmann, Christoph Schneider, and Jan vom Brocke. 2016. Digital nudging. Business & Information Systems Engineering 58, 6 (2016), 433--436.",
      "doi": ""
    },
    {
      "text": "Neil D Weinstein. 1980. Unrealistic optimism about future life events. Journal of personality and social psychology 39, 5 (1980), 806.",
      "doi": ""
    },
    {
      "text": "Claes Wohlin. 2014. Guidelines for snowballing in systematic literature studies and a replication in software engineering. In Proceedings of the 18th international conference on evaluation and assessment in software engineering. ACM, 38.  ",
      "doi": "10.1145/2601248.2601268"
    },
    {
      "text": "Leslie Wu, Jesse Cirimele, Jonathan Bassen, Kristen Leach, Stuart Card, Larry Chu, Kyle Harrison, and Scott Klemmer. 2013. Headmounted and multi-surface displays support emergency medical teams. In Proceedings of the 2013 conference on Computer supported cooperative work companion. ACM, 279--282.  ",
      "doi": "10.1145/2441955.2442020"
    },
    {
      "text": "Ruud Zaalberg and Cees Midden. 2010. Enhancing human responses to climate change risks through simulated flooding experiences. In International Conference on Persuasive Technology. Springer, 205--210.  ",
      "doi": "10.1007/978-3-642-13226-1_21"
    },
    {
      "text": "Fengyuan Zhu, Ke Fang, and Xiaojuan Ma. 2017. Exploring the Effects of Strategy and Arousal of Cueing in Computer-Human Persuasion. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2276--2283.  ",
      "doi": "10.1145/3027063.3053122"
    }
  ]
}