{
  "doi": "10.1145/3290605.3300620",
  "title": "Follow the Money: Managing Personal Finance Digitally",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "The move towards digital payments and mobile money, and away from physical cash and banking services offers users opportunities to change the ways that they can spend, save and manage their money through a variety of personal financial management services. However, set against ordinary, everyday patterns of spending, saving and other forms of financial transaction, it is not clear how users might interact with, understand, or value financial management services that utilise rich data and connected digital content for their personal use. In order to explore how people might engage with such systems, we conducted a study of financial activity, following people's transactional activity over time, and interviewing them about their practices, understandings, needs, concerns and expectations of current and future financial technologies. Drawing from the everyday activities and practices observed, we identify implications for the design of digitally enabled, personal financial systems.",
  "tags": [
    "interaction design",
    "diary study",
    "interviews",
    "user experience design",
    "digital money",
    "mobile money"
  ],
  "authors": [
    {
      "name": "Makayla Lewis",
      "institution": "Brunel University London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958791457",
      "orcid": "missing"
    },
    {
      "name": "Mark Perry",
      "institution": "Brunel University London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100036324",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amelia Acker and Dhiraj Murthy. 2018. Venmo: Understanding Mobile Payments as Social Media. In Proceedings of the International Conference on Social Media & Society, Copenhagen, Denmark (SMSociety), 5--12.  ",
      "doi": "10.1145/3217804.3217892"
    },
    {
      "text": "Marianna Adler. 1991. From symbolic exchange to commodity consumption: anthropological notes on drinking as a symbolic practice. Drinking: behavior and belief in modern history. University of California Press, CA, USA.",
      "doi": ""
    },
    {
      "text": "John Bagnall, David Bounie, Kim P Huynh, Anneke Kosse, Tobias Schmidt, Scott D. Schuh and Helmut Stix. 2016. Consumer Cash Usage: A Cross-Country Comparison with Payment Diary Survey Data. International Journal of Central Banking, 12, 4, 1--61.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1999. Contextual design. Interactions 6, 1, 32--42.  ",
      "doi": "10.1145/291224.291229"
    },
    {
      "text": "Monica Caraway, Daniel A. Epstein, and Sean A. Munson. 2017. Friends Don't Need Receipts: The Curious Case of Social Awareness Streams in the Mobile Payment App Venmo. PACM Hum.-Comput, Interact. 1 (CSCW).  ",
      "doi": "10.1145/3134663"
    },
    {
      "text": "John M. Carroll and Victoria Bellotti. 2015. Creating Value Together: The Emerging Design Space of Peer-to-Peer Currency and Exchange. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), ACM, New York, USA, 1500--1510.  ",
      "doi": "10.1145/2675133.2675270"
    },
    {
      "text": "Sandra Colavecchia. 2008. Moneywork: Caregiving and the management of family finances. In Family Patterns, Gender Relations (3rd ed.), Bonnie J. Fox. Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Matthew Chalmers. 1994. Running out of space: Models of information navigation. In Proceedings of the BCS HCI'94 Conference, London, UK.",
      "doi": ""
    },
    {
      "text": "Jennifer Ferreira, Mark Perry, and Sriram Subramanian. 2015. Spending time with money: From shared values to social connectivity. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW'15). ACM, New York, USA, 1222--1234.  ",
      "doi": "10.1145/2675133.2675230"
    },
    {
      "text": "Mark Granovetter. 1985. Economic action and social structure: The problem of embeddedness. American Journal of Sociology 91, 3, 481--510.",
      "doi": ""
    },
    {
      "text": "Dan Gruen, Thyra Rauch, Sarah Redpath, and Stefan Ruettinger. 2002. The use of stories in user experience design. International Journal of Human-Computer Interaction. 14, 3--4, 503--534.",
      "doi": ""
    },
    {
      "text": "Keith Hart. 2000. The Memory Bank: Money in an Unequal World. Profile Books, London, UK.",
      "doi": ""
    },
    {
      "text": "Björn Halleröd, Janet Stocks and Capitolina Diaz-Martinez. 2017. Modern couples sharing money, sharing life. Palgrave Macmillan, Basingstoke and Eastbourne, UK, 156--165",
      "doi": ""
    },
    {
      "text": "Serena Hillman, Carman Neustaedter, Erick Oduor, and Carolyn Pang. 2014. User challenges and successes with mobile payment services in North America. In Proceedings of the 16th International Conference on Human-Computer Interaction with Mobile Devices & Services (MobileHCI'14). New York, USA, 253--262.  ",
      "doi": "10.1145/2628363.2628389"
    },
    {
      "text": "Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014. Money talks: tracking personal finances. In Proceedings of the Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 521--530.  ",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Deepti Kumar, David Martin, and Jacki O'Neill. 2011. The times they are a-changin': Mobile payments in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11). ACM, New York, NY, 1413--1422.  ",
      "doi": "10.1145/1978942.1979150"
    },
    {
      "text": "Garm Lucassen, Fabiano Dalpiaz, Jan Martijn EM van der Werf, and Sjaak Brinkkemper. 2016. The use and effectiveness of user stories in practice. In International Working Conference on Requirements Engineering: Foundation for Software Quality. Springer, Cham, 205--222.  ",
      "doi": "10.1007/978-3-319-30282-9_14"
    },
    {
      "text": "Scott Mainwaring, Wendy March, and Bill Maurer. 2008. From meiwaku to tokushita!: Lessons for digital money design from Japan. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'08). ACM, New York, USA, 21--24.  ",
      "doi": "10.1145/1357054.1357058"
    },
    {
      "text": "Ignacio Mas and Olga Morawczynski. 2009. Designing mobile money services: Lessons from M-PESA. Innovations 4, 2, 77--91.",
      "doi": ""
    },
    {
      "text": "Marcel Mauss. 1990, 1922. The Gift: forms and functions of exchange in archaic societies. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Bill Maurer. 2015. How Would You Like to Pay? How Technology Is Changing the Future of Money. Duke University Press, Durham, USA.",
      "doi": ""
    },
    {
      "text": "Apurv Mehra, Srihari Muralidhar, Sambhav Satija, Anupama Dhareshwar, and Jacki O'Neill. 2018. Prayana: Intermediated Financial Management in Resource-Constrained Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). New York, USA..  ",
      "doi": "10.1145/3173574.3173963"
    },
    {
      "text": "Mark Perry and Jennifer Ferreira. 2018. Moneywork: Practices of Use and Social Interaction around Digital and Analog Money. ACM Trans. Comput.-Hum. Interact. 24, 6.  ",
      "doi": "10.1145/3162082"
    },
    {
      "text": "Gary Pritchard, John Vines, and Patrick Olivier. 2015. Your money's no good here: The elimination of cash payment on London buses. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15). ACM, New York, USA, 907--916.  ",
      "doi": "10.1145/2702123.2702137"
    },
    {
      "text": "Whitney Quesenbery and Kevin Brooks. 2010. Storytelling for user experience: Crafting stories for better design. Rosenfeld Media, USA. ",
      "doi": "10.5555/1989618"
    },
    {
      "text": "Marika Salo and Helena Haapio. 2017. Robo-Advisors and Investors: Enhancing Human-Robot Interaction Through Information Design. In Proceedings of the 20th International Legal Informatics Symposium IRIS'17, Wien, pp. 441--448.",
      "doi": ""
    },
    {
      "text": "Stephen Snow and Dhaval Vyas. 2015a. Fixing the Alignment: An Exploration of Budgeting Practices in the Home. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). New York, USA, 2271--2276.  ",
      "doi": "10.1145/2702613.2732808"
    },
    {
      "text": "Stephen Snow and Dhaval Vyas. 2015b. Fostering Collaboration in the Management of Family Finances. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), Bernd Ploderer, Marcus Carter, Martin Gibbs, Wally Smith, and Frank Vetere. ACM, New York, USA, 380--387.  ",
      "doi": "10.1145/2838739.2838746"
    },
    {
      "text": "Georg Simmel. 1900, 2004. A Chapter in the Philosophy of Value (3rd ed.). Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "John Vines, Paul Dunphy, Mark Blythe, Stephen Lindsay, Andrew Monk, and Patrick Olivier. 2012. The joy of cheques: Trust, paper and eighty somethings. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW'12). ACM, New York, USA, 147--156.  ",
      "doi": "10.1145/2145204.2145229"
    },
    {
      "text": "John Vines, Paul Dunphy, and Andrew Monk. 2014. Pay or delay: the role of technology when managing a low income. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). New York, USA, 501--510.  ",
      "doi": "10.1145/2556288.2556961"
    },
    {
      "text": "Dhaval Vyas, Stephen Snow, Paul Roe, and Margot Brereton. 2016. Social Organization of Household Finance: Understanding Artful Financial Systems in the Home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). New York, USA, 1777--1789.  ",
      "doi": "10.1145/2818048.2819937"
    },
    {
      "text": "Katie Wright. 2017. Should we talk about pay in the office? Retrieved August 24, 2018 from https://www.bbc.co.uk/news/uk-40659801",
      "doi": ""
    },
    {
      "text": "Viviana Zelizer. 1994. The Social Meaning of Money: Pin Money, Paychecks, Poor Relief, and Other Currencies. Princeton: Princeton University Press.",
      "doi": ""
    }
  ]
}