{
  "doi": "10.1145/3290605.3300867",
  "title": "Is Now A Good Time?: An Empirical Study of Vehicle-Driver Communication Timing",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Advances in automotive sensing systems and speech interfaces provide new opportunities for smarter driving assistants or infotainment systems. For both safety and consumer satisfaction reasons, any new system which interacts with drivers must do so at appropriate times. We asked 63 drivers, ''Is now a good time?'' to receive non-driving information during a 50-minute drive. We analyzed 2,734 responses and synchronized automotive and video data, and show that while the chances of choosing a good time can be determined with better success using easily accessible automotive data, certain nuances in the problem require a richer understanding of the driver and environment states in order to achieve higher performance. We illustrate several of these nuances with quantitative and qualitative analyses to contribute to the understanding of how to design a system that might simultaneously minimize the risk of interacting at a bad time while maximizing the window of allowable interruption.",
  "authors": [
    {
      "name": "Rob Semmens",
      "institution": "Naval Postgraduate School, Monterey, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459639657",
      "orcid": "missing"
    },
    {
      "name": "Nikolas Martelaro",
      "institution": "Accenture Technology Labs, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-89758706757/rel-imgonly/img_2109.jpg",
      "acmid": "89758706757",
      "orcid": "0000-0002-1824-0243"
    },
    {
      "name": "Pushyami Kaveti",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658978958",
      "orcid": "missing"
    },
    {
      "name": "Simon Stent",
      "institution": "Toyota Research Institute, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658998215",
      "orcid": "missing"
    },
    {
      "name": "Wendy Ju",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/do/10.1145/contrib-81100098733/rel-imgonly/wendy_headshot.jpg",
      "acmid": "81100098733",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2018. Automakers locked in battle with phone manufacturers for consumers' attention, j.d. power finds. (Aug 2018). https://www.jdpower.com/business/press-releases/ jd-power-2018-us-tech-experience-index-txi-study",
      "doi": ""
    },
    {
      "text": "Angelos Amditis, Luisa Andreone, Katia Pagle, Gustav Markkula, Enrica Deregibus, Maria Romera Rue, Francesco Bellotti, Andreas Engelsberg, Rino Brouwer, Björn Peters, et al. 2010. Towards the automotive HMI of the future: overview of the AIDE-integrated project results. IEEE Transactions on Intelligent Transportation Systems 11, 3 (2010), 567--578.  ",
      "doi": "10.1109/TITS.2010.2048751"
    },
    {
      "text": "Davide Anguita, Alessandro Ghio, Luca Oneto, Xavier Parra, and Jorge L Reyes-Ortiz. 2012. Human activity recognition on smartphones using a multiclass hardware-friendly support vector machine. In International workshop on ambient assisted living. Springer, 216--223.  ",
      "doi": "10.1007/978-3-642-35395-6_30"
    },
    {
      "text": "Daniel Avrahami, James Fogarty, and Scott E Hudson. 2007. Biases in human estimation of interruptibility: effects and implications for practice. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 50--60.  ",
      "doi": "10.1145/1240624.1240632"
    },
    {
      "text": "Adriana Barón and Paul Green. 2006. Safety and usability of speech interfaces for in-vehicle tasks while driving: A brief literature review. Technical Report. University of Michigan, Transportation Research Institute.",
      "doi": ""
    },
    {
      "text": "T Bellet, MP Bruyas, H Tattegrain-Veste, JF Forzy, A Simoes, J Carvalhais, P Lockwood, J Boudy, B Baligand, S Damiani, et al. 2002. \"Real time\" analysis of the driving situation in order to manage on-board information. In Proceedings of the E-safety Congress and Exhibition--IT Solutions for Safety and Security in Intelligent Transport.",
      "doi": ""
    },
    {
      "text": "Asher Bender, Gabriel Agamennoni, James R Ward, Stewart Worrall, and Eduardo M Nebot. 2015. An unsupervised approach for inferring driver behavior from naturalistic driving data. IEEE Transactions on Intelligent Transportation Systems 16, 6 (2015), 3325--3336.",
      "doi": "10.1109/TITS.2015.2449837"
    },
    {
      "text": "Keli A. Braitman and Anne T. McCartt. 2010. National Reported Patterns of Driver Cell Phone Use in the United States. Traffic Injury Prevention 11, 6 (2010), 543--548. arXiv:https://doi.org/10.1080/15389588.2010.504247 PMID: 21128181.",
      "doi": ""
    },
    {
      "text": "Robert Broström, Johan Engström, Anders Agnvall, and Gustav Markkula. 2006. Towards the next generation intelligent driver information system (IDIS): The Volvo car interaction manager concept. In Proceedings of the 2006 ITS World Congress. 32.",
      "doi": ""
    },
    {
      "text": "Lawrence Cavedon, Fuliang Weng, Rohit Mishra, Harry Bratt, Badri Raghunathan, Hua Cheng, Hauke Schmidt, Danilo Mirkovic, Ben Bei, Heather Pon-Barry, et al. 2005. Developing a conversational in-car dialog system. In Intelligent Transportation Systems.",
      "doi": ""
    },
    {
      "text": "Daniel Chen, Jamie Hart, and Roel Vertegaal. 2007. Towards a physiological model of user interruptability. In IFIP Conference on HumanComputer Interaction. Springer, 439--451. ",
      "doi": "10.5555/1778331.1778380"
    },
    {
      "text": "David Crundall, Manpreet Bains, Peter Chapman, and Geoffrey Underwood. 2005. Regulating conversation during driving: a problem for mobile telephones? Transportation Research Part F: Traffic Psychology and Behaviour 8, 3 (2005), 197--211.",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Edward Cutrell, and Eric Horvitz. 2000. Instant messaging: Effects of relevance and timing. In People and computers XIV: Proceedings of HCI, Vol. 2. 71--76.",
      "doi": ""
    },
    {
      "text": "Guido de Melo, Frank Honold, Michael Weber, Mark Poguntke, and André Berton. 2009. Towards a flexible UI model for automotive humanmachine interaction. In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 47--50.  ",
      "doi": "10.1145/1620509.1620518"
    },
    {
      "text": "Thomas A Dingus, Sheila G Klauer, Vicki L Neale, Andy Petersen, Suzanne E Lee, JD Sudweeks, Miguel A Perez, Jonathan Hankey, DJ Ramsey, Santosh Gupta, et al. 2006. The 100-car naturalistic driving study, Phase II-results of the 100-car field experiment. Technical Report.",
      "doi": ""
    },
    {
      "text": "Anup Doshi and Mohan Manubhai Trivedi. 2009. On the roles of eye gaze and head dynamics in predicting driver's intent to change lanes. IEEE Transactions on Intelligent Transportation Systems 10, 3 (2009), 453--462.  ",
      "doi": "10.1109/TITS.2009.2026675"
    },
    {
      "text": "Frank A Drews, Monisha Pasupathi, and David L Strayer. 2008. Passenger and cell phone conversations in simulated driving. Journal of Experimental Psychology: Applied 14, 4 (2008), 392.",
      "doi": ""
    },
    {
      "text": "Robert Fisher and Reid Simmons. 2011. Smartphone interruptibility using density-weighted uncertainty sampling with reinforcement learning. In Machine Learning and Applications and Workshops (ICMLA), 2011 10th International Conference on, Vol. 1. IEEE, 436--441.  ",
      "doi": "10.1109/ICMLA.2011.128"
    },
    {
      "text": "James Fogarty, Scott E Hudson, Christopher G Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1 (2005), 119--146.  ",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "James Fogarty, Andrew J Ko, Htet Htet Aung, Elspeth Golden, Karen P Tang, and Scott E Hudson. 2005. Examining task engagement in sensorbased statistical models of human interruptibility. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 331--340.  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "Lex Fridman, Daniel E Brown, Michael Glazer, William Angell, Spencer Dodd, Benedikt Jenik, Jack Terwilliger, Julia Kindelsberger, Li Ding, Sean Seaman, et al. 2017. MIT Autonomous Vehicle Technology Study: Large-Scale Deep Learning Based Analysis of Driver Behavior and Interaction with Automation. arXiv preprint arXiv:1711.06976 (2017).",
      "doi": ""
    },
    {
      "text": "Marti A. Hearst, Susan T Dumais, Edgar Osuna, John Platt, and Bernhard Scholkopf. 1998. Support vector machines. IEEE Intelligent Systems and their applications 13, 4 (1998), 18--28.  ",
      "doi": "10.1109/5254.708428"
    },
    {
      "text": "Tim Higgins. 2017. Auto Makers Showcase Cars Equipped With Virtual Assistants. wsj.com (Jan 2017). https://www.wsj.com/articles/ auto-makers-showcase-cars-equipped-with-virtual-assistants-1483661702",
      "doi": ""
    },
    {
      "text": "William J Horrey and Christopher D Wickens. 2006. Examining the impact of cell phone conversations on driving using meta-analytic techniques. Human factors 48, 1 (2006), 196--205.",
      "doi": ""
    },
    {
      "text": "Shuyan Hu and Gangtie Zheng. 2009. Driver drowsiness detection with eyelid related parameters by Support Vector Machine. Expert Systems with Applications 36, 4 (2009), 7651--7658.  ",
      "doi": "10.1016/j.eswa.2008.09.030"
    },
    {
      "text": "Zhang Hua and Wei Lieh Ng. 2010. Speech recognition interface design for in-vehicle system. In Proceedings of the 2nd International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 29--33.  ",
      "doi": "10.1145/1969773.1969780"
    },
    {
      "text": "Scott Hudson, James Fogarty, Christopher Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny Lee, and Jie Yang. 2003. Predicting human interruptibility with sensors: a Wizard of Oz feasibility study. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 257--264.  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Ashesh Jain, Hema S Koppula, Shane Soh, Bharad Raghavan, Avi Singh, and Ashutosh Saxena. 2016. Brain4cars: Car that knows before you do via sensory-fusion deep learning architecture. arXiv preprint arXiv:1601.00740 (2016).",
      "doi": ""
    },
    {
      "text": "SeungJun Kim, Jaemin Chun, and Anind K. Dey. 2015. Sensors Know When to Interrupt You in the Car: Detecting Driver Interruptibility Through Monitoring of Peripheral Interactions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 487--496.  ",
      "doi": "10.1145/2702123.2702409"
    },
    {
      "text": "Andrew Kun, Tim Paek, and Zeljko Medenica. 2007. The effect of speech interface accuracy on driving performance. In Eighth Annual CHI'19, May 2019, Glasglow, UK R. Semmens et al. Conference of the International Speech Communication Association.",
      "doi": ""
    },
    {
      "text": "Firas Lethaus, Martin RK Baumann, Frank Köster, and Karsten Lemmer. 2013. A comparison of selected simple supervised learning algorithms to predict driver intent based on gaze data. Neurocomputing 121 (2013), 108--130.  ",
      "doi": "10.1016/j.neucom.2013.04.035"
    },
    {
      "text": "Victor Ei-Wen Lo and Paul A Green. 2013. Development and evaluation of automotive speech interfaces: useful information from the human factors and the related literature. International Journal of Vehicular Technology 2013 (2013).",
      "doi": ""
    },
    {
      "text": "Daniel C McFarlane. 2002. Comparison of four primary methods for coordinating the interruption of people in human-computer interaction. Human-Computer Interaction 17, 1 (2002), 63--139.  ",
      "doi": "10.1207/S15327051HCI1701_2"
    },
    {
      "text": "Sean McLain. 2017. Toyota's Talking Car Wants to Be Your Clingy BFF. wsj.com (Oct 2017). https://www.wsj.com/articles/ toyotas-talking-car-wants-to-be-your-clingy-bff-1509359421",
      "doi": ""
    },
    {
      "text": "Yoshiro Miyata and Donald A Norman. 1986. Psychological issues in support of multiple activities. User centered system design: New perspectives on human-computer interaction (1986), 265--284.",
      "doi": ""
    },
    {
      "text": "R Montanari, G Wenzel, S Mattes, F Kuhn, F BELLOTTI, and D Morreale. 2002. COMUNICAR: Integrated on-vehicle human machine interface designed to avoid driver information overload. In 9th World Congress on Intelligent Transport SystemsITS America, ITS Japan, ERTICO (Intelligent Transport Systems and Services-Europe).",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Ing-Marie Jonsson, Helen Harris, Ben Reaves, Jack Endo, Scott Brave, and Leila Takayama. 2005. Improving automotive safety by pairing driver emotion and car voice emotion. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 1973--1976.  ",
      "doi": "10.1145/1056808.1057070"
    },
    {
      "text": "Victor-Emil Neagoe and Serban-Vasile Carata. 2017. Drunkenness diagnosis using a Neural Network-based approach for analysis of facial images in the thermal infrared spectrum. In E-Health and Bioengineering Conference (EHB), 2017. IEEE, 165--168.",
      "doi": ""
    },
    {
      "text": "Nuria Oliver and Alex P Pentland. 2000. Graphical models for driver behavior recognition in a smartcar. In Intelligent Vehicles Symposium, 2000. IV 2000. Proceedings of the IEEE. IEEE, 7--12.",
      "doi": ""
    },
    {
      "text": "Oskar Palinko, Andrew L Kun, Alexander Shyrokov, and Peter Heeman. 2010. Estimating cognitive load using remote eye tracking in a driving simulator. In Proceedings of the 2010 symposium on eye-tracking research & applications. ACM, 141--144.  ",
      "doi": "10.1145/1743666.1743701"
    },
    {
      "text": "Pablo E Paredes, Francisco Ordonez, Wendy Ju, and James A Landay. 2018. Fast & Furious: Detecting Stress with a Car Steering Wheel. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 665.  ",
      "doi": "10.1145/3173574.3174239"
    },
    {
      "text": "Walter Piechulla, Christoph Mayser, Helmar Gehrke, and Winfried König. 2003. Reducing drivers' mental workload by means of an adaptive man--machine interface. Transportation Research Part F: Traffic Psychology and Behaviour 6, 4 (2003), 233--248.",
      "doi": ""
    },
    {
      "text": "Jaka Sodnik, Christina Dicke, Saso Tomazic, and Mark Billinghurst. 2008. A user study of auditory versus visual interfaces for use while driving. International journal of human-computer studies 66, 5 (2008), 318--332.  ",
      "doi": "10.1016/j.ijhcs.2007.11.001"
    },
    {
      "text": "Fabio Tango and Marco Botta. 2013. Real-time detection system of driver distraction using machine learning. IEEE Transactions on Intelligent Transportation Systems 14, 2 (2013), 894--905.  ",
      "doi": "10.1109/TITS.2013.2247760"
    },
    {
      "text": "Yuji Uchiyama, Shin-ichi Kojima, Takero Hongo, Ryuta Terashima, and Toshihiro Wakita. 2002. Voice information system adapted to driver's mental workload. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 46. SAGE Publications Sage CA: Los Angeles, CA, 1871--1875.",
      "doi": ""
    }
  ]
}