{
  "doi": "10.1145/3290605.3300625",
  "title": "PicMe: Interactive Visual Guidance for Taking Requested Photo Composition",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Best Paper"
  ],
  "abstract": "PicMe is a mobile application that provides interactive on-screen guidance that helps the user take pictures of a composition that another person requires. Once the requester captures a picture of the desired composition and delivers it to the user (photographer), a 2.5D guidance system, called the virtual frame, guides the user in real-time by showing a three-dimensional composition of the target image (i.e., size and shape). In addition, according to the matching accuracy rate, we provide a small-sized target image in an inset window as feedback and edge visualization for further alignment of the detail elements. We implemented PicMe to work fully in mobile environments. We then conducted a preliminary user study to evaluate the effectiveness of PicMe compared to traditional 2D guidance methods. The results show that PicMe helps users reach their target images more accurately and quickly by giving participants more confidence in their tasks.",
  "authors": [
    {
      "name": "Minju Kim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366834",
      "orcid": "missing"
    },
    {
      "name": "Jungjin Lee",
      "institution": "KAI Inc., Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548882356",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2014. Camera51. Retrieved September 9, 2017 from https://www. camera51.com/",
      "doi": ""
    },
    {
      "text": "Pablo F Alcantarilla and T Solutions. 2011. Fast explicit diffusion for accelerated features in nonlinear scale spaces. IEEE Trans. Patt. Anal. Mach. Intell 34, 7 (2011), 1281--1298.",
      "doi": ""
    },
    {
      "text": "Apple. {n. d.}. How to shoot on iPhone. Retrieved September 11, 2018 from http://www.apple.com/iphone/photography-how-to/",
      "doi": ""
    },
    {
      "text": "Soonmin Bae, Aseem Agarwala, and Frédo Durand. 2010. Computational rephotography. ACM Transactions on Graphics (ToG) 29, 3 (2010), 24.  ",
      "doi": "10.1145/1805964.1805968"
    },
    {
      "text": "Serene Banerjee and Brian L Evans. 2007. In-camera automation of photographic composition rules. IEEE Transactions on Image Processing 16, 7 (2007), 1807--1820.  ",
      "doi": "10.1109/TIP.2007.898992"
    },
    {
      "text": "William Bares. 2006. A photographic composition assistant for intelligent virtual 3d camera systems. In International Symposium on Smart Graphics. Springer, 172--183.",
      "doi": ""
    },
    {
      "text": "Olivier Bau and Wendy E Mackay. 2008. OctoPocus: a dynamic guide for learning gesture-based command sets. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 37--46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Subhabrata Bhattacharya, Rahul Sukthankar, and Mubarak Shah. 2010. A framework for photo-quality assessment and enhancement based on visual aesthetics. In Proceedings of the 18th ACM international conference on Multimedia. ACM, 271--280.  ",
      "doi": "10.1145/1873951.1873990"
    },
    {
      "text": "Mike Blackwell, Constantinos Nikou, Anthony M DiGioia, and Takeo Kanade. 2000. An image overlay system for medical data visualization. Medical Image Analysis 4, 1 (2000), 67--72.",
      "doi": ""
    },
    {
      "text": "John Canny. 1986. A computational approach to edge detection. IEEE Transactions on pattern analysis and machine intelligence 6 (1986), 679-- 698.  ",
      "doi": "10.1109/TPAMI.1986.4767851"
    },
    {
      "text": "Michael Dixon, Cindy M Grimm, and William D Smart. 2003. Picture composition for a robot photographer. (2003).",
      "doi": ""
    },
    {
      "text": "Gabor Fichtinger, Anton Deguet, Ken Massamune, Emese Balogh, Gregory Fischer, Herve Mathieu, Russell Taylor, James Zinreich, and Laura Fayad. 2005. Image overlay guidance for needle insertion in CT scanner. IEEE transactions on biomedical engineering 52, 8 (2005), 1415--1424.",
      "doi": ""
    },
    {
      "text": "Paul M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (1954), 381.",
      "doi": ""
    },
    {
      "text": "Matthew Flagg and James M Rehg. 2006. Projector-guided painting. In Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM, 235--244.  ",
      "doi": "10.1145/1166253.1166290"
    },
    {
      "text": "Michihiko Goto, Yuko Uematsu, Hideo Saito, Shuji Senda, and Akihiko Iketani. 2010. Task support system by displaying instructional video onto AR workspace. In Mixed and Augmented Reality (ISMAR), 2010 9th IEEE International Symposium on. IEEE, 83--90.",
      "doi": ""
    },
    {
      "text": "Richard Hartley and Andrew Zisserman. 2003. Multiple view geometry in computer vision. Cambridge university press. ",
      "doi": "10.5555/861369"
    },
    {
      "text": "Emmanuel Iarussi, Adrien Bousseau, and Theophanis Tsandilas. 2013. The drawing assistant: Automated drawing guidance and feedback from photographs. In ACM Symposium on User Interface Software and Technology (UIST). ACM.  ",
      "doi": "10.1145/2501988.2501997"
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P Bigham. 2011. Supporting blind photography. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. ACM, 203--210.  ",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Jérémy Laviole and Martin Hachet. 2012. PapARt: interactive 3D graphics and multi-touch augmented paper for artistic creation. In 3D User Interfaces (3DUI), 2012 IEEE Symposium on. IEEE, 3--6.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Marion Boberg, and Severi Uusitalo. 2009. Image space: capturing, sharing and contextualizing personal pictures in a simple and playful way. In Proceedings of the International Conference on Advances in Computer Enterntainment Technology. ACM, 215--222.  ",
      "doi": "10.1145/1690388.1690424"
    },
    {
      "text": "Chen Lujun, Yao Hongxun, Sun Xiaoshuai, and Zhang Hongming. 2012. Real-time viewfinder composition assessment and recommendation to mobile photographing. In Pacific-Rim Conference on Multimedia. Springer, 707--714.  ",
      "doi": "10.1007/978-3-642-34778-8_66"
    },
    {
      "text": "Arnold M Lund. 2001. Measuring usability with the use questionnaire12. Usability interface 8, 2 (2001), 3--6.",
      "doi": ""
    },
    {
      "text": "Yiwen Luo and Xiaoou Tang. 2008. Photo and video quality evaluation: Focusing on the subject. In European Conference on Computer Vision. Springer, 386--399.  ",
      "doi": "10.1007/978-3-540-88690-7_29"
    },
    {
      "text": "Google Maps. {n. d.}. PhotoSphere. Retrieved September 5, 2018 from g.co/photosphere",
      "doi": ""
    },
    {
      "text": "Microsoft. 2012. PhotoSynth. Retrieved September 5, 2018 from http://photosynth.net/",
      "doi": ""
    },
    {
      "text": "Hiroko Mitarai, Yoshihiro Itamiya, and Atsuo Yoshitaka. 2013. Interactive photographic shooting assistance based on composition and saliency. In International Conference on Computational Science and Its Applications. Springer, 348--363.",
      "doi": ""
    },
    {
      "text": "Susan Palmiter and Jay Elkerton. 1991. An evaluation of animated demonstrations of learning computer-based tasks. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 257--263.  ",
      "doi": "10.1145/108844.108906"
    },
    {
      "text": "Yogesh Singh Rawat and Mohan S Kankanhalli. 2015. Context-aware photography learning for smart mobile devices. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 12, 1s (2015), 19.  ",
      "doi": "10.1145/2808199"
    },
    {
      "text": "Yogesh Singh Rawat and Mohan S Kankanhalli. 2017. ClickSmart: A Context-Aware Viewpoint Recommendation System for Mobile Photography. IEEE Trans. Circuits Syst. Video Techn. 27, 1 (2017), 149--158.  ",
      "doi": "10.1109/TCSVT.2016.2555658"
    },
    {
      "text": "Lloyd P Rieber. 1990. Animation in computer-based instruction. Educational technology research and development 38, 1 (1990), 77--86.",
      "doi": ""
    },
    {
      "text": "Michael Rohs and Antti Oulasvirta. 2008. Target acquisition with camera phones when used as magic lenses. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1409--1418. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk M. Kim and J. Lee  ",
      "doi": "10.1145/1357054.1357275"
    },
    {
      "text": "Michael Rohs, Antti Oulasvirta, and Tiia Suomalainen. 2011. Interaction with magic lenses: real-world validation of a Fitts' Law model. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2725--2728.  ",
      "doi": "10.1145/1978942.1979343"
    },
    {
      "text": "Quentin Roy, Simon T Perrault, Shengdong Zhao, Richard C Davis, Anuroop Pattena Vaniyar, Velko Vechev, Youngki Lee, and Archan Misra. 2017. Follow-My-Lead: Intuitive Indoor Path Creation and Navigation Using Interactive Videos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5703--5715.  ",
      "doi": "10.1145/3025453.3025976"
    },
    {
      "text": "Rajinder Sodhi, Hrvoje Benko, and Andrew Wilson. 2012. LightGuide: projected visualizations for hand movement guidance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 179--188.  ",
      "doi": "10.1145/2207676.2207702"
    },
    {
      "text": "Marynel Vázquez and Aaron Steinfeld. 2012. Helping visually impaired users properly aim a camera. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. ACM, 95-- 102.  ",
      "doi": "10.1145/2384916.2384934"
    },
    {
      "text": "Sean White, Levi Lister, and Steven Feiner. 2007. Visual hints for tangible gestures in augmented reality. In Proceedings of the 2007 6th IEEE and ACM International Symposium on Mixed and Augmented Reality. IEEE Computer Society, 1--4.  ",
      "doi": "10.1109/ISMAR.2007.4538824"
    },
    {
      "text": "Yan Xu, Joshua Ratcliff, James Scovell, Gheric Speiginer, and Ronald Azuma. 2015. Real-time Guidance Camera Interface to Enhance Photo Aesthetic Quality. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1183--1186.  ",
      "doi": "10.1145/2702123.2702418"
    },
    {
      "text": "Lei Yao, Poonam Suryanarayan, Mu Qiao, James Z Wang, and Jia Li. 2012. Oscar: On-site composition and aesthetics feedback through exemplars for photographers. International Journal of Computer Vision 96, 3 (2012), 353--383.  ",
      "doi": "10.1007/s11263-011-0478-3"
    }
  ]
}