{
  "doi": "10.1145/3290605.3300647",
  "title": "Explicating \"Implicit Interaction\": An Examination of the Concept and Challenges for Research",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2019,
  "badges": [],
  "abstract": "The term implicit interaction is often used to denote interactions that differ from traditional purposeful and attention demanding ways of interacting with computers. However, there is a lack of agreement about the term's precise meaning. This paper develops implicit interaction further as an analytic concept and identifies the methodological challenges related to HCI's particular design orientation. We first review meanings of implicit as unintentional, attentional background, unawareness, unconsciousness and implicature, and compare them in regards to the entity they qualify, the design motivation they emphasize and their constructive validity for what makes good interaction. We then demonstrate how the methodological challenges can be addressed with greater precision by using an updated, intentionality-based definition that specifies an input-effect relationship as the entity of implicit. We conclude by identifying a number of new considerations for design and evaluation, and by reflecting on the concepts of user and system agency in HCI.",
  "authors": [
    {
      "name": "Barış Serim",
      "institution": "University of Helsinki & Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259259657",
      "orcid": "missing"
    },
    {
      "name": "Giulio Jacucci",
      "institution": "University of Helsinki, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100644548/rel-imgonly/81100644548.png",
      "acmid": "81100644548",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "G. D. Abowd, E. D. Mynatt, and T. Rodden. 2002. The human experience {of ubiquitous computing}. IEEE Pervasive Computing 1, 1 (2002), 48--57.  ",
      "doi": "10.1109/MPRV.2002.993144"
    },
    {
      "text": "Eugene Agichtein, Eric Brill, and Susan Dumais. 2006. Improving Web Search Ranking by Incorporating User Behavior Information. In Proceedings of the 29th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '06). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/1148170.1148177"
    },
    {
      "text": "James F Allen, Curry I Guinn, and Eric Horvitz. 1999. Mixed-initiative interaction. IEEE Intelligent Systems and their Applications 14, 5 (1999), 14--23.",
      "doi": "10.1109/5254.796083"
    },
    {
      "text": "James F Allen and C Raymond Perrault. 1980. Analyzing intention in utterances. Artificial intelligence 15, 3 (1980), 143--178.",
      "doi": ""
    },
    {
      "text": "Robert B Arundale. 2008. Against (Gricean) intentions at the heart of human interaction. Intercultural Pragmatics 5, 2 (2008), 229--258.",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Elise van den Hoven, and Berry Eggen. 2015. Peripheral interaction: characteristics and considerations. Personal and Ubiquitous Computing 19, 1 (01 Jan 2015), 239--254.  ",
      "doi": "10.1007/s00779-014-0775-2"
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic Interaction: Designing for a Proximity and Orientation-aware Environment. In ACM International Conference on Interactive Tabletops and Surfaces (ITS '10). ACM, New York, NY, USA, 121--130.  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Victoria Bellotti, Maribeth Back, W. Keith Edwards, Rebecca E. Grinter, Austin Henderson, and Cristina Lopes. 2002. Making Sense of Sensing Systems: Five Questions for Designers and Researchers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 415--422.  ",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Victoria Bellotti and Keith Edwards. 2001. Intelligibility and Accountability: Human Considerations in Context-Aware Systems. Human-Computer Interaction 16, 2--4 (2001), 193--212.  ",
      "doi": "10.1207/S15327051HCI16234_05"
    },
    {
      "text": "Susanne Bødker and Clemens Nylandsted Klokmose. 2011. The Human--Artifact Model: An Activity Theoretical Approach to Artifact Ecologies. Human-- Computer Interaction 26, 4 (2011), 315--371. arXiv:http://dx.doi.org/10.1080/07370024.2011.626709 ",
      "doi": "10.5555/2499325.2499327"
    },
    {
      "text": "Susanne Bødker and Clemens Nylandsted Klokmose. 2016. Dynamics, Multiplicity and Conceptual Blends in HCI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2538--2548.  ",
      "doi": "10.1145/2858036.2858530"
    },
    {
      "text": "John Bowers and John Churcher. 1988. Local and Global Structuring of Computer Mediated Communication: Developing Linguistic Perspectives on CSCW in Cosmos. In Proceedings of the 1988 ACM Conference on Computer-supported Cooperative Work (CSCW '88). ACM, New York, NY, USA, 125--139.  ",
      "doi": "10.1145/62266.62277"
    },
    {
      "text": "Daniel Buschek, Alexander De Luca, and Florian Alt. 2015. Improving Accuracy, Applicability and Usability of Keystroke Biometrics on Mobile Touchscreen Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1393--1402.  ",
      "doi": "10.1145/2702123.2702252"
    },
    {
      "text": "Georg Buscher, Andreas Dengel, and Ludger van Elst. 2008. Query Expansion Using Gaze-based Feedback on the Subdocument Level. In Proceedings of the 31st Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '08). ACM, New York, NY, USA, 387--394.  ",
      "doi": "10.1145/1390334.1390401"
    },
    {
      "text": "William Buxton. 1995. Integrating the periphery and context: A new taxonomy of telematics. In Proceedings of graphics interface, Vol. 95. 239--246.",
      "doi": ""
    },
    {
      "text": "Robyn Carston. 2009. The Explicit/Implicit Distinction in Pragmatics and the Limits of Explicit Communication. International Review of Pragmatics 1, 1 (2009), 35--62.",
      "doi": ""
    },
    {
      "text": "David Coyle, James Moore, Per Ola Kristensson, Paul Fletcher, and Alan Blackwell. 2012. I Did That! Measuring Users' Experience of Agency in Their Own Actions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2025--2034.  ",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Mary Czerwinski, Susan Dumais, George Robertson, Susan Dziadosz, Scott Tiernan, and Maarten van Dantzich. 1999. Visualizing Implicit Queries for Information Management and Retrieval. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 560--567.  ",
      "doi": "10.1145/302979.303158"
    },
    {
      "text": "Tamara Denning, Kevin Bowers, Marten van Dijk, and Ari Juels. 2011. Exploring Implicit Memory for Painless Password Recovery. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2615--2618.  ",
      "doi": "10.1145/1978942.1979323"
    },
    {
      "text": "Zoltan Dienes and Josef Perner. 1999. A theory of implicit and explicit knowledge. Behavioral and brain sciences 22, 5 (1999), 735--808.",
      "doi": ""
    },
    {
      "text": "Alan Dix. 2002. Beyond intention-pushing boundaries with incidental interaction. In Proceedings of Building Bridges: Interdisciplinary Context-Sensitive Computing, Glasgow University, Vol. 9.",
      "doi": ""
    },
    {
      "text": "Alan John Dix. 1991. Formal methods for interactive systems. Vol. 16. Academic Press London.",
      "doi": ""
    },
    {
      "text": "Alan J Dix and Colin Runciman. 1985. Abstract models of interactive systems. In People and Computers: Designing the interface. Cambridge University Press, 13--22.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and Coordination in Shared Workspaces. In Proceedings of the 1992 ACM Conference on Computer-supported Cooperative Work (CSCW '92). ACM, New York, NY, USA, 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "HUBERT L. DREYFUS. 1993. Heidegger's Critique of the Husserl/Searle Account of Intentionality. Social Research 60, 1 (1993), 17--38. http://www.jstor.org/ stable/40970727",
      "doi": ""
    },
    {
      "text": "Hubert L Dreyfus. 1996. The current relevance of Merleau-Ponty's phenomenology of embodiment. The Electronic Journal of Analytic Philosophy 4 (1996).",
      "doi": ""
    },
    {
      "text": "Stephen H. Fairclough. 2009. Fundamentals of physiological computing. Interacting with Computers 21, 1--2 (2009), 133 -- 145.  ",
      "doi": "10.1016/j.intcom.2008.10.011"
    },
    {
      "text": "Russell H. Fazio and Michael A. Olson. 2003. Implicit Measures in Social Cognition Research: Their Meaning and Use. Annual Review of Psychology 54, 1 (2003), 297--327.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer. 2001. User Modeling in Human--Computer Interaction. User Modeling and User-Adapted Interaction 11, 1 (01 Mar 2001), 65--86.  ",
      "doi": "10.1023/A%3A1011145532042"
    },
    {
      "text": "Lyndsey Fisk, Marcus Carter, Behnaz Rostami Yeganeh, Frank Vetere, and Bernd Ploderer. 2014. Implicit and Explicit Interactions in Video Mediated Collaboration. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: The Future of Design (OzCHI '14). ACM, New York, NY, USA, 250--259.  ",
      "doi": "10.1145/2686612.2686650"
    },
    {
      "text": "Steve Fox, Kuldeep Karnawat, Mark Mydland, Susan Dumais, and Thomas White. 2005. Evaluating Implicit Measures to Improve Web Search. ACM Trans. Inf. Syst. 23, 2 (April 2005), 147--168.  ",
      "doi": "10.1145/1059981.1059982"
    },
    {
      "text": "Anthony G Greenwald and Mahzarin R Banaji. 1995. Implicit social cognition: attitudes, self-esteem, and stereotypes. Psychological review 102, 1 (1995), 4.",
      "doi": ""
    },
    {
      "text": "Anthony G Greenwald, Debbie E McGhee, and Jordan LK Schwartz. 1998. Measuring individual differences in implicit cognition: the implicit association test. Journal of personality and social psychology 74, 6 (1998), 1464.",
      "doi": ""
    },
    {
      "text": "H Paul Grice. 1957. Meaning. The philosophical review (1957), 377--388.",
      "doi": ""
    },
    {
      "text": "H Paul Grice. 1989. Logic and conversation. In Studies in the Way of Words. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Beverly L. Harrison, Kenneth P. Fishkin, Anuj Gujar, Carlos Mochon, and Roy Want. 1998. Squeeze Me, Hold Me, Tilt Me! An Exploration of Manipulative User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Mariam Hassib, Stefan Schneegass, Philipp Eiglsperger, Niels Henze, Albrecht Schmidt, and Florian Alt. 2017. EngageMeter: A System for Implicit Audience Engagement Sensing Using Electroencephalography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5114--5119.  ",
      "doi": "10.1145/3025453.3025669"
    },
    {
      "text": "Michael Haugh. 2008. Intention in pragmatics. Intercultural Pragmatics 5, 2 (2008), 99--110.",
      "doi": ""
    },
    {
      "text": "John Heritage. 1990. Intention, meaning and strategy: Observations on constraints on interaction analysis. Research on Language & Social Interaction 24, 1--4 (1990), 311--332.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Jeff Pierce, Eric Horvitz, and Mike Sinclair. 2005. Foreground and Background Interaction with Sensor-enhanced Mobile Devices. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 31--52.  ",
      "doi": "10.1145/1057237.1057240"
    },
    {
      "text": "Ken Hinckley, Jeff Pierce, Mike Sinclair, and Eric Horvitz. 2000. Sensing Techniques for Mobile Interaction. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, New York, NY, USA, 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Ken Hinckley and Mike Sinclair. 1999. Touch-sensing Input Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 223--230.  ",
      "doi": "10.1145/302979.303045"
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5040--5052.  ",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Eric Horvitz, Jack Breese, David Heckerman, David Hovel, and Koos Rommelse. 1998. The Lumiere project: Bayesian user modeling for inferring the goals and needs of software users. In Proceedings of the Fourteenth conference on Uncertainty in artificial intelligence. Morgan Kaufmann Publishers Inc., 256--265. ",
      "doi": "10.5555/2074094.2074124"
    },
    {
      "text": "Eric Horvitz, Carl Kadie, Tim Paek, and David Hovel. 2003. Models of Attention in Computing and Communication: From Principles to Applications. Commun. ACM 46, 3 (March 2003), 52--59.  ",
      "doi": "10.1145/636772.636798"
    },
    {
      "text": "Roberto Hoyle, Srijita Das, Apu Kapadia, Adam J. Lee, and Kami Vaniea. 2017. Was My Message Read?: Privacy and Signaling on Facebook Messenger. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3838--3842.  ",
      "doi": "10.1145/3025453.3025925"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Lars-Erik Janlert and Erik Stolterman. 2017. The Meaning of Interactivity: Some Proposals for Definitions and Measures. Human-Computer Interaction 32, 3 (2017), 103--138.  ",
      "doi": "10.1080/07370024.2016.1226139"
    },
    {
      "text": "Thorsten Joachims, Laura Granka, Bing Pan, Helene Hembrooke, Filip Radlinski, and Geri Gay. 2007. Evaluating the Accuracy of Implicit Feedback from Clicks and Query Reformulations in Web Search. ACM Trans. Inf. Syst. 25, 2, Article 7 (April 2007).  ",
      "doi": "10.1145/1229179.1229181"
    },
    {
      "text": "Wendy Ju, Brian A. Lee, and Scott R. Klemmer. 2008. Range: Exploring Implicit Interaction Through Electronic Whiteboard Design. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 17--26.  ",
      "doi": "10.1145/1460563.1460569"
    },
    {
      "text": "Wendy Ju and Larry Leifer. 2008. The Design of Implicit Interactions: Making Interactive Systems Less Obnoxious. Design Issues 24, 3 (2008), 72--84. arXiv:http://dx.doi.org/10.1162/desi.2008.24.3.72",
      "doi": ""
    },
    {
      "text": "Jakob Karolus, Pawel W. Wozniak, Lewis L. Chuang, and Albrecht Schmidt. 2017. Robust Gaze Features for Enabling Language Proficiency Awareness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2998--3010.  ",
      "doi": "10.1145/3025453.3025601"
    },
    {
      "text": "Diane Kelly and Jaime Teevan. 2003. Implicit Feedback for Inferring User Preference: A Bibliography. SIGIR Forum 37, 2 (Sept. 2003), 18--28.  ",
      "doi": "10.1145/959258.959260"
    },
    {
      "text": "David Kirsh. 1995. The Intelligent Use of Space. Artificial Intelligence 73, 1--2 (Feb. 1995), 31--68.  ",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "Kai Kuikkaniemi, Toni Laitinen, Marko Turpeinen, Timo Saari, Ilkka Kosunen, and Niklas Ravaja. 2010. The Influence of Implicit and Explicit Biofeedback in First-person Shooter Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 859--868.  ",
      "doi": "10.1145/1753326.1753453"
    },
    {
      "text": "Stephen C Levinson. 1983. Pragmatics. (1983).",
      "doi": ""
    },
    {
      "text": "Dan Lockton, David Harrison, and Neville A. Stanton. 2010. The Design with Intent Method: A design tool for influencing user behaviour. Applied Ergonomics 41, 3 (2010), 382--392. Special Section: Recycling centres and waste handling a workplace for employees and users.",
      "doi": ""
    },
    {
      "text": "Pattie Maes. 1994. Agents That Reduce Work and Information Overload. Commun. ACM 37, 7 (July 1994), 30--40.  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "Päivi Majaranta and Andreas Bulling. 2014. Eye Tracking and Eye-Based Human-- Computer Interaction. Springer London, London, 39--65.",
      "doi": ""
    },
    {
      "text": "David C McClelland, Richard Koestner, and Joel Weinberger. 1989. How do self-attributed and implicit motives differ? Psychological review 96, 4 (1989), 690--702.",
      "doi": ""
    },
    {
      "text": "Yoshiro Miyata and Donald A Norman. 1986. Psychological issues in support of multiple activities. In User centered system design: New perspectives on humancomputer interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, 265--284.",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Takeo Igarashi, W. Keith Edwards, and Anthony LaMarca. 1999. Flatland: New Dimensions in Office Whiteboards. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 346--353.  ",
      "doi": "10.1145/302979.303108"
    },
    {
      "text": "Jakob Nielsen. 1993. Noncommand User Interfaces. Commun. ACM 36, 4 (April 1993), 83--99.  ",
      "doi": "10.1145/255950.153582"
    },
    {
      "text": "Donald A. Norman. 1986. Cognitive engineering. In User centered system design: New perspectives on human-computer interaction, Donald A. Norman and Stephen W. Draper (Eds.). L. Erlbaum Associates Inc., Hillsdale, NJ, USA, 31--61.",
      "doi": ""
    },
    {
      "text": "Donald A Norman and Tim Shallice. 1980. Attention to action: Willed and automatic control of behavior. Technical Report. California University San Diego La Jolla Center for Human Information Processing.",
      "doi": ""
    },
    {
      "text": "Brian A Nosek, Mahzarin R Banaji, and Anthony G Greenwald. 2002. Harvesting implicit group attitudes and beliefs from a demonstration web site. Group Dynamics: Theory, Research, and Practice 6, 1 (2002), 101.",
      "doi": ""
    },
    {
      "text": "Kenton O'Hara, Richard Harper, Helena Mentis, Abigail Sellen, and Alex Taylor. 2013. On the Naturalness of Touchless: Putting the \"Interaction\" Back into NUI. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 5 (April 2013), 25 pages.  ",
      "doi": "10.1145/2442106.2442111"
    },
    {
      "text": "Antti Oulasvirta, Sakari Tamminen, Virpi Roto, and Jaana Kuorelahti. 2005. Interaction in 4-second Bursts: The Fragmented Nature of Attentional Resources in Mobile HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Tomi Peltola, Mustafa Mert Celikok, Pedram Daee, and Samuel Kaski. 2018. Modelling User's Theory of AI's Mind in Interactive Intelligent Systems. arXiv:arXiv:1809.02869",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Melodie Vidal, Jayson Turner, Andreas Bulling, and Hans Gellersen. 2013. Pursuit Calibration: Making Gaze Calibration Less Tedious and More Flexible. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 261--270.  ",
      "doi": "10.1145/2501988.2501998"
    },
    {
      "text": "Susanne Poeller, Max V. Birk, Nicola Baumann, and Regan L. Mandryk. 2018. Let Me Be Implicit: Using Motive Disposition Theory to Predict and Explain Behaviour in Digital Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 190, 15 pages.  ",
      "doi": "10.1145/3173574.3173764"
    },
    {
      "text": "Henning Pohl and Roderick Murray-Smith. 2013. Focused and Casual Interactions: Allowing Users to Vary Their Level of Engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2223--2232.  ",
      "doi": "10.1145/2470654.2481307"
    },
    {
      "text": "Zachary Pousman and John Stasko. 2006. A Taxonomy of Ambient Information Systems: Four Patterns of Design. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '06). ACM, New York, NY, USA, 67--74.  ",
      "doi": "10.1145/1133265.1133277"
    },
    {
      "text": "Kathrin Probst, David Lindlbauer, Michael Haller, Bernhard Schwartz, and Andreas Schrempf. 2014. A Chair As Ubiquitous Input Device: Exploring Semaphoric Chair Gestures for Focused and Peripheral Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 4097--4106.  ",
      "doi": "10.1145/2556288.2557051"
    },
    {
      "text": "Filip Radlinski and Thorsten Joachims. 2005. Query Chains: Learning to Rank from Implicit Feedback. In Proceedings of the Eleventh ACM SIGKDD International Conference on Knowledge Discovery in Data Mining (KDD '05). ACM, New York, NY, USA, 239--248.  ",
      "doi": "10.1145/1081870.1081899"
    },
    {
      "text": "Arthur S Reber. 1989. Implicit learning and tacit knowledge. Journal of experimental psychology: General 118, 3 (1989), 219.",
      "doi": ""
    },
    {
      "text": "Mark E. Revesman and Joel S. Greenstein. 1983. Application of a Model of Human Decision Making for Human/Computer Communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '83). ACM, New York, NY, USA, 107--111.  ",
      "doi": "10.1145/800045.801591"
    },
    {
      "text": "Laurie A. Rudman, Anthony G. Greenwald, Deborah S. Mellott, and Jordan L. K. Schwartz. 1999. Measuring the Automatic Components of Prejudice: Flexibility and Generality of the Implicit Association Test. Social Cognition 17, 4 (01 Dec 1999), 437--465.",
      "doi": ""
    },
    {
      "text": "Antti Salovaara and Antti Oulasvirta. 2004. Six Modes of Proactive Resource Management: A User-centric Typology for Proactive Behaviors. In Proceedings of the Third Nordic Conference on Human-computer Interaction (NordiCHI '04). ACM, New York, NY, USA, 57--60.  ",
      "doi": "10.1145/1028014.1028022"
    },
    {
      "text": "Munehiko Sato, Rohan S. Puri, Alex Olwal, Yosuke Ushigome, Lukas Franciszkiewicz, Deepak Chandra, Ivan Poupyrev, and Ramesh Raskar. 2017. Zensei: Embedded, Multi-electrode Bioimpedance Sensing for Implicit, Ubiquitous User Recognition. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3972--3985.  ",
      "doi": "10.1145/3025453.3025536"
    },
    {
      "text": "Daniel L Schacter. 1987. Implicit memory: History and current status. Journal of experimental psychology: learning, memory, and cognition 13, 3 (1987), 501--518.",
      "doi": ""
    },
    {
      "text": "Albrecht Schmidt. 2000. Implicit human computer interaction through context. Personal Technologies 4, 2 (2000), 191--199.",
      "doi": ""
    },
    {
      "text": "Albrecht Schmidt, Michael Beigl, and Hans Gellersen. 1999. There is more to context than location. Computers & Graphics 23, 6 (1999), 893 -- 901.",
      "doi": "10.1016/S0097-"
    },
    {
      "text": "Richard W Schmidt. 1990. The role of consciousness in second language learning. Applied linguistics 11, 2 (1990), 129--158.",
      "doi": ""
    },
    {
      "text": "John R Searle. 1975. Indirect speech acts. In Syntax and Semantics Volume 3: Speech Acts. Academic Press, 59--82.",
      "doi": ""
    },
    {
      "text": "Tomoki Shibata, Evan M. Peck, Daniel Afergan, Samuel W. Hincks, Beste F. Yuksel, and Robert J.K. Jacob. 2014. Building Implicit Interfaces for Wearable Computers with Physiological Inputs: Zero Shutter Camera and Phylter. In Proceedings of the Adjunct Publication of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST'14 Adjunct). ACM, New York, NY, USA, 89--90.  ",
      "doi": "10.1145/2658779.2658790"
    },
    {
      "text": "Suvi Silfverberg, Lassi A. Liikkanen, and Airi Lampinen. 2011. \"I'll Press Play, but I won't Listen\": Profile Work in a Music-focused Social Network Service. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 207--216.  ",
      "doi": "10.1145/1958824.1958855"
    },
    {
      "text": "Xiaojun Su, Oscar Kin-Chung Au, and Rynson W.H. Lau. 2014. The Implicit Fan Cursor: A Velocity Dependent Area Cursor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 753--762.  ",
      "doi": "10.1145/2556288.2557095"
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of humanmachine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Mingfei Sun, Zhenjie Zhao, and Xiaojuan Ma. 2017. Sensing and Handling Engagement Dynamics in Human-Robot Interaction Involving Peripheral Computing Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 556--567.  ",
      "doi": "10.1145/3025453.3025469"
    },
    {
      "text": "Dag Svanaes. 2001. Context-aware Technology: A Phenomenological Perspective. Hum.-Comput. Interact. 16, 2 (Dec. 2001), 379--400.  ",
      "doi": "10.1207/S15327051HCI16234_17"
    },
    {
      "text": "Erin Treacy Solovey, Daniel Afergan, Evan M. Peck, Samuel W. Hincks, and Robert J. K. Jacob. 2015. Designing Implicit Interfaces for Physiological Computing: Guidelines and Lessons Learned Using fNIRS. ACM Trans. Comput.-Hum. Interact. 21, 6, Article 35 (Jan. 2015), 27 pages.  ",
      "doi": "10.1145/2687926"
    },
    {
      "text": "Peter-Paul Verbeek. 2009. Ambient Intelligence and Persuasive Technology: The Blurring Boundaries Between Human and Technology. NanoEthics 3, 3 (03 Dec 2009), 231--242.",
      "doi": ""
    },
    {
      "text": "Roel Vertegaal. 2002. Designing Attentive Interfaces. In Proceedings of the 2002 Symposium on Eye Tracking Research & Applications (ETRA '02). ACM, New York, NY, USA, 23--30.  ",
      "doi": "10.1145/507072.507077"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive Public Ambient Displays: Transitioning from Implicit to Explicit, Public to Personal, Interaction with Multiple Users. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST '04). ACM, New York, NY, USA, 137-- 146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Annika Waern. 2016. The Ethics of Unaware Participation in Public Interventions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 803--814.  ",
      "doi": "10.1145/2858036.2858188"
    },
    {
      "text": "Alex Wennberg, Henrik Åhman, and Anders Hedman. 2018. The Intuitive in HCI: A Critical Discourse Analysis. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI '18). ACM, New York, NY, USA, 505--514.  ",
      "doi": "10.1145/3240167.3240202"
    },
    {
      "text": "Ryen W. White, Ian Ruthven, and Joemon M. Jose. 2005. A Study of Factors Affecting the Utility of Implicit Relevance Feedback. In Proceedings of the 28th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '05). ACM, New York, NY, USA, 35--42.  ",
      "doi": "10.1145/1076034.1076044"
    },
    {
      "text": "John Williamson. 2006. Continuous uncertain interaction. Ph.D. Dissertation. University of Glasgow.",
      "doi": ""
    },
    {
      "text": "Deirdre Wilson and Dan Sperber. 2002. Relevance Theory. In Handbook of Pragmatics. Blackwell.",
      "doi": ""
    },
    {
      "text": "Timothy D Wilson, Samuel Lindsey, and Tonya Y Schooler. 2000. A model of dual attitudes. Psychological review 107, 1 (2000), 101.",
      "doi": ""
    },
    {
      "text": "Terry Winograd and Fernando Flores. 1986. Understanding computers and cognition. (1986). ",
      "doi": "10.5555/5245"
    },
    {
      "text": "Michael Wooldridge and Nicholas R Jennings. 1995. Intelligent agents: Theory and practice. The knowledge engineering review 10, 2 (1995), 115--152.",
      "doi": ""
    },
    {
      "text": "Rayoung Yang and Mark W. Newman. 2013. Learning from a Learning Thermostat: Lessons for Intelligent Systems for the Home. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Shumin Zhai. 2003. What's in the Eyes for Attentive Input. Commun. ACM 46, 3 (March 2003), 34--39.  ",
      "doi": "10.1145/636772.636795"
    },
    {
      "text": "Shumin Zhai, Carlos Morimoto, and Steven Ihde. 1999. Manual and Gaze Input Cascaded (MAGIC) Pointing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 246--253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}