{
  "doi": "10.1145/3290605.3300746",
  "title": "Design and Evaluation of a Social Media Writing Support Tool for People with Dyslexia",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "People with dyslexia face challenges expressing themselves in writing on social networking sites (SNSs). Such challenges come from not only the technicality of writing, but also the self-representation aspect of sharing and communicating publicly on social networking sites such as Facebook. To empower people with dyslexia-style writing to express them-selves more confidently on SNSs, we designed and implemented Additional Writing Help(AWH) - a writing assistance tool to proofread text produced by users with dyslexia before they post on Facebook. AWH was powered by a neural machine translation (NMT) model that translates dyslexia style to non-dyslexia style writing. We evaluated the performance and the design of AWH through a week-long field study with 19 people with dyslexia and received highly positive feedback. Our field study demonstrated the value of providing better and more extensive writing support on SNSs, and the potential of AI for building a more inclusive Internet.",
  "tags": [
    "social media",
    "artificial intelligence",
    "accessibility",
    "dyslexia"
  ],
  "authors": [
    {
      "name": "Shaomei Wu",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553756956",
      "orcid": "missing"
    },
    {
      "name": "Lindsay Reynolds",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365856",
      "orcid": "missing"
    },
    {
      "name": "Xian Li",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367247",
      "orcid": "missing"
    },
    {
      "name": "Francisco Guzmán",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461649315",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ricardo Baeza-Yates and Luz Rello. 2011. Estimating Dyslexia in the Web. In Proceedings of the International Cross-Disciplinary Conference on Web Accessibility (W4A '11). ACM, New York, NY, USA, Article 8, 4 pages.  ",
      "doi": "10.1145/1969289.1969300"
    },
    {
      "text": "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. Neural Machine Translation by Jointly Learning to Align and Translate. CoRR abs/1409.0473 (2014). arXiv:1409.0473 http://arxiv.org/abs/1409.0473",
      "doi": ""
    },
    {
      "text": "Eileen Bailey. 2018. How Dyslexia Impacts Writing Skills. Retrieved September 17, 2018 from https://www.thoughtco.com/how-dyslexiaimpacts-writing-skills-3111195.",
      "doi": ""
    },
    {
      "text": "Timothy Baldwin, P Cook, M Lui, Andrew MacKinlay, and Li Wang. 2013. How noisy social media text, how diffrnt social media sources? Proceedings of the 6th International Joint Conference on Natural Language Processing (IJCNLP 2013) (01 2013), 356--364.",
      "doi": ""
    },
    {
      "text": "Natalya Bazarova, Jessie G. Taft, Yoon Hyung Choi, and Dan Cosley. 2013. Managing Impressions and Relationships on Facebook: SelfPresentational and Relational Concerns Revealed Through the Analysis of Language Style. 32 (06 2013), 121--141.",
      "doi": ""
    },
    {
      "text": "Andrew Bredenkamp, Berthold Crysmann, and Mirela Petrea. 2000. Looking for Errors: A Declarative Formalism for Resource-adaptive Language Checking. In LREC.",
      "doi": ""
    },
    {
      "text": "Nicola Brunswick. 2010. Unimpaired reading development and dyslexia across different languages. Reading and dyslexia in different orthographies (2010), 131--154.",
      "doi": ""
    },
    {
      "text": "Christopher Bryant and Hwee Tou Ng. 2015. How Far are We from Fully Automatic High Quality Grammatical Error Correction?. In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), Vol. 1. 697--707.",
      "doi": ""
    },
    {
      "text": "Philip Burnard. 1991. A method of analysing interview transcripts in qualitative research. Nurse education today 11, 6 (1991), 461--466.",
      "doi": ""
    },
    {
      "text": "D. Carnine. 2003. IDEA: focusing on improving results for children with disabilities. (2003).",
      "doi": ""
    },
    {
      "text": "Martin Chodorow, Markus Dickinson, Ross Israel, and Joel Tetreault. 2012. Problems in evaluating grammatical error detection systems. Proceedings of COLING 2012 (2012), 611--628.",
      "doi": ""
    },
    {
      "text": "Shamil Chollampatt, Kaveh Taghipour, and Hwee Tou Ng. 2016. Neural network translation models for grammatical error correction. arXiv preprint arXiv:1606.00189 (2016). ",
      "doi": "10.5555/3060832.3061008"
    },
    {
      "text": "Chris Coleman, Noël Gregg, Lisa McLain, and Leslie W. Bellair. 2009. A Comparison of Spelling Performance Across Young Adults With and Without Dyslexia. Assessment for Effective Intervention 34, 2 (2009), 94--105.",
      "doi": ""
    },
    {
      "text": "Vagner Figueredo de Santana, Rosimeire de Oliveira, Leonelo Dell Anhol Almeida, and Marcia Ito. 2013. Firefixia: An accessibility web browser customization toolbar for people with dyslexia. In Proc. of W4A.  ",
      "doi": "10.1145/2461121.2461137"
    },
    {
      "text": "Joan Morris Dimicco and David R. Millen. 2007. Identity Management: Multiple Presentations of Self in Facebook. (2007).",
      "doi": ""
    },
    {
      "text": "Jacob Eisenstein. 2013. What to do about bad language on the internet. In Proceedings of the 2013 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Atlanta, Georgia, 359--369. http://www.aclweb.org/anthology/N13--1037",
      "doi": ""
    },
    {
      "text": "Marzieh Fadaee, Arianna Bisazza, and Christof Monz. 2017. Data Augmentation for Low-Resource Neural Machine Translation. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (ACL '17).",
      "doi": ""
    },
    {
      "text": "Michael Gamon, Jianfeng Gao, Chris Brockett, Alexander Klementiev, Bill Dolan, Dmitriy Belenko, and Lucy Vanderwende. 2008. Using Contextual Speller Techniques and Language Modeling for ESL Error Correction. https://www.microsoft.com/enus/research/publication/using-contextual-speller-techniques-andlanguage-modeling-for-esl-error-correction/",
      "doi": ""
    },
    {
      "text": "T. Ge, F. Wei, and M. Zhou. 2018. Reaching Human-level Performance in Automatic Grammatical Error Correction: An Empirical Study. ArXiv e-prints (July 2018). arXiv:cs.CL/1807.01270",
      "doi": ""
    },
    {
      "text": "Vincent Goetry and Dyslexia International. 2018. Common mistakes in reading and spelling. Retrieved September 17, 2018 from https: //www.dyslexia-international.org/ONL/EN/Course/S2--3--2.htm.",
      "doi": ""
    },
    {
      "text": "Ervin Goffman. 1959. The presentation of self in everyday life. Anchor Books, New York.",
      "doi": ""
    },
    {
      "text": "Shannon Greenwood, Andrew Perrin, and Maeve Duggan. 2016. Social Media Update 2016. (11 November 2016).",
      "doi": ""
    },
    {
      "text": "George E. Heidorn, Karen Jensen, Lance A. Miller, Roy J. Byrd, and Martin S Chodorow. 1982. The EPISTLE text-critiquing system. IBM Systems Journal 21, 3 (1982), 305--326.  ",
      "doi": "10.1147/sj.213.0305"
    },
    {
      "text": "Beve Hornsby and M Farrar. 1990. Some effects of a dyslexia centred teaching programme. Children's Difficulties in Reading, Spelling and Writing (1990), 173--96.",
      "doi": ""
    },
    {
      "text": "S. Gunnel Ingesson. 2007. Growing Up with Dyslexia. School Psychology International 28, 5 (2007), 574--591.",
      "doi": ""
    },
    {
      "text": "Aminul Islam and Diana Inkpen. 2009. Real-word Spelling Correction Using Google Web IT 3-grams. In Proceedings of the 2009 Conference on Empirical Methods in Natural Language Processing: Volume 3 - Volume 3 (EMNLP '09). Association for Computational Linguistics, Stroudsburg, PA, USA, 1241--1249. http://dl.acm.org/citation.cfm?id=1699648. ",
      "doi": "10.5555/1699648.1699670"
    },
    {
      "text": "Juan E Jiménez, Remedios Guzmán, Cristina Rodríguez, and Ceferino Artiles. 2009. Prevalencia de las dificultades específicas de aprendizaje: la dislexia en español. Anales de psicología 25, 1 (2009).",
      "doi": ""
    },
    {
      "text": "Marcin Junczys-Dowmunt, Roman Grundkiewicz, Shubha Guha, and Kenneth Heafield. 2018. Approaching Neural Grammatical Error Correction as a Low-Resource Machine Translation Task. CoRR abs/1804.05940 (2018). arXiv:1804.05940 http://arxiv.org/abs/1804. 05940",
      "doi": ""
    },
    {
      "text": "Dan Jurafsky. 2018. CS124 Lecture Notes: Minimum Edit Distance. Retrived September 21, 2018 from https://web.stanford.edu/class/cs124/ lec/med.pdf.",
      "doi": ""
    },
    {
      "text": "Alfred Kobsa. 2007. Privacy-enhanced Personalization. Commun. ACM 50, 8 (Aug. 2007), 24--33.  ",
      "doi": "10.1145/1278201.1278202"
    },
    {
      "text": "Peter Korn. 2016. New Accessibility Features for Kindle E-Readers.",
      "doi": ""
    },
    {
      "text": "Alberto Quattrini Li, Licia Sbattella, and Roberto Tedesco. 2013. Polispell: an adaptive spellchecker and predictor for people with dyslexia. In International Conference on User Modeling, Adaptation, and Personalization. Springer, 302--309.",
      "doi": ""
    },
    {
      "text": "Minh-Thang Luong, Ilya Sutskever, Quoc V. Le, Oriol Vinyals, and Wojciech Zaremba. 2015. Addressing the Rare Word Problem in Neural Machine Translation. In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). Association for Computational Linguistics, Beijing, China, 11--19. http: //www.aclweb.org/anthology/P15--1002",
      "doi": ""
    },
    {
      "text": "James H Martin and Daniel Jurafsky. 2009. Speech and language processing: An introduction to natural language processing, computational linguistics, and speech recognition. Pearson/Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Roger Mitton. 1994. Spellchecking by computer. Retrieved September 17, 2018 from http://www.dcs.bbk.ac.uk/~roger/spellchecking.html.",
      "doi": ""
    },
    {
      "text": "Daniel Naber. 2003. A rule-based style and grammar checker. (2003).",
      "doi": ""
    },
    {
      "text": "Hwee Tou Ng, Siew Mei Wu, Ted Briscoe, Christian Hadiwinoto, Raymond Hendy Susanto, and Christopher Bryant. 2014. The CoNLL-2014 shared task on grammatical error correction. In Proceedings of the Eighteenth Conference on Computational Natural Language Learning: Shared Task. 1--14.",
      "doi": ""
    },
    {
      "text": "Peter Norvig. 2007. How to Write a Spelling Corrector. Retrieved September 17, 2018 from https://norvig.com/spell-correct.html.",
      "doi": ""
    },
    {
      "text": "Jong C Park, Martha Stone Palmer, and Clay Washburn. 1997. An English Grammar Checker as a Writing Aid for Students of English as a Second Language. In ANLP. 24.  ",
      "doi": "10.3115/974281.974296"
    },
    {
      "text": "Jennifer Pedler. 2001. Computer spellcheckers and dyslexics-A performance survey. British Journal of Educational Technology 32, 1 (2001), 23--37.",
      "doi": ""
    },
    {
      "text": "Jennifer Pedler. 2007. Computer Correction of Real-word Spelling Errors in Dyslexic Text. Ph.D. Dissertation. London University, Birkbeck College.",
      "doi": ""
    },
    {
      "text": "Luz Rello. 2014. DysWebxia. A Text Accessibility Model for People with Dyslexia. Ph.D. Dissertation. Universitat Pompeu Fabra, Barcelona, Spain.",
      "doi": ""
    },
    {
      "text": "Luz Rello, Ricardo Baeza-Yates, Laura Dempere-Marco, and Horacio Saggion. 2013. Frequent words improve readability and short words improve understandability for people with dyslexia. In IFIP Conference on Human-Computer Interaction. Springer, 203--219.",
      "doi": ""
    },
    {
      "text": "Luz Rello, Miguel Ballesteros, and Jeffrey P. Bigham. 2015. A Spellchecker for Dyslexia. In Proc. of ASSETS.  ",
      "doi": "10.1145/2700648.2809850"
    },
    {
      "text": "Luz Rello, Horacio Saggion, and Ricardo Baeza-Yates. 2014. Keyword highlighting improves comprehension for people with dyslexia. In Proceedings of PITR.",
      "doi": ""
    },
    {
      "text": "Lindsay Reynolds and Shaomei Wu. 2018. \"I'm Never Happy with What I Write\": Challenges and Strategies of People with Dyslexia on Social Media. In Proceedings of the Twelfth International Conference on Web and Social Media, ICWSM 2018, Stanford, California, USA, June 2528, 2018. 280--289. https://aaai.org/ocs/index.php/ICWSM/ICWSM18/ paper/view/17812",
      "doi": ""
    },
    {
      "text": "B. Riddick. 2009. Living With Dyslexia: The social and emotional consequences of specific learning difficulties/disabilities. Taylor & Francis. https://books.google.com/books?id=NveMAgAAQBAJ",
      "doi": ""
    },
    {
      "text": "Rico Sennrich, Barry Haddow, and Alexandra Birch. 2016. Neural Machine Translation of Rare Words with Subword Units. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (ACL '16). 1715--1725.",
      "doi": ""
    },
    {
      "text": "Sally E. Shaywitz, Michael Escobar, Bennett Shaywitz, Jack Fletcher, and Robert Makuch. 1992. Evidence That Dyslexia May Represent the Lower Tail of a Normal Distribution of Reading Ability. 326 (02 1992), 145--50.",
      "doi": ""
    },
    {
      "text": "Ilya Sutskever, Oriol Vinyals, and Quoc V Le. 2014. Sequence to sequence learning with neural networks. In Advances in neural information processing systems. 3104--3112. ",
      "doi": "10.5555/2969033.2969173"
    },
    {
      "text": "After the Deadline. 2010. Measuring the Real Word Error Corrector. Retrieved September 21, 2018 from https://blog.afterthedeadline.com/ 2010/04/09/measuring-the-real-word-error-corrector/.",
      "doi": ""
    },
    {
      "text": "W Tops, C Callens, E Van Cauwenberghe, J Adriaens, and M Brysbaert. 2013. Beyond spelling: the writing skills of students with dyslexia in higher education. Reading and Writing (2013).",
      "doi": ""
    },
    {
      "text": "US Interagency Committee on Learning Disabilities. 1987. Learning Disabilities: A Report to the U.S. Congress. https://books.google.com/ books?id=OG-7PQAACAAJ",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 2007. Selective self-presentation in computermediated communication: Hyperpersonal dimensions of technology, language, and cognition. Computers in Human Behavior 23, 5 (2007), 2538--2557.  ",
      "doi": "10.1016/j.chb.2006.05.002"
    },
    {
      "text": "Yuhuai Wu, Saizheng Zhang, Ying Zhang, Yoshua Bengio, and Ruslan R Salakhutdinov. 2016. On Multiplicative Integration with Recurrent Neural Networks. (2016), 2856--2864. http://papers.nips.cc/paper/6215on-multiplicative-integration-with-recurrent-neural-networks.pdf",
      "doi": ""
    },
    {
      "text": "Zheng Yuan and Ted Briscoe. 2016. Grammatical error correction using neural machine translation. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. 380--386.",
      "doi": ""
    },
    {
      "text": "Shanyang Zhao, Sherri Grasmuck, and Jason Martin. 2008. Identity Construction on Facebook: Digital Empowerment in Anchored Relationships. Computers in Human Behavior (09 2008).  ",
      "doi": "10.1016/j.chb.2008.02.012"
    }
  ]
}