{
  "doi": "10.1145/3290605.3300877",
  "title": "Understanding Metamaterial Mechanisms",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "In this paper, we establish the underlying foundations of mechanisms that are composed of cell structures---known as metamaterial mechanisms. Such metamaterial mechanisms were previously shown to implement complete mechanisms in the cell structure of a 3D printed material, without the need for assembly. However, their design is highly challenging. A mechanism consists of many cells that are interconnected and impose constraints on each other. This leads to unobvious and non-linear behavior of the mechanism, which impedes user design. In this work, we investigate the underlying topological constraints of such cell structures and their influence on the resulting mechanism. Based on these findings, we contribute a computational design tool that automatically creates a metamaterial mechanism from user-defined motion paths. This tool is only feasible because our novel abstract representation of the global constraints highly reduces the search space of possible cell arrangements.",
  "tags": [
    "microstructure",
    "metamaterials",
    "computational design",
    "fabrication",
    "mechanism"
  ],
  "authors": [
    {
      "name": "Alexandra Ion",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658655048/rel-imgonly/portrait_square_20103.jpg",
      "acmid": "99658655048",
      "orcid": "missing"
    },
    {
      "name": "David Lindlbauer",
      "institution": "Technische Universität Berlin & ETH Zurich, Berlin, Germany",
      "img": "/do/10.1145/contrib-81558156356/rel-imgonly/userpic-3by4.jpg",
      "acmid": "81558156356",
      "orcid": "0000-0002-0809-9696"
    },
    {
      "name": "Philipp Herholz",
      "institution": "Technische Universität Berlin, Berlin, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658628942",
      "orcid": "missing"
    },
    {
      "name": "Marc Alexa",
      "institution": "Technische Universität Berlin, Berlin, Germany",
      "img": "/do/10.1145/contrib-81100235480/rel-imgonly/1106_platzfamily_1sth.png",
      "acmid": "81100235480",
      "orcid": "missing"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Jeffrey K. Anderson, Larry L. Howell, Jonathan W. Wittwer, and Timothy W. McLain. 2006. Piezoresistive sensing of bistable micro mechanism state. Journal of micromechanics and microengineering 16, 5 (2006), 943--950.",
      "doi": ""
    },
    {
      "text": "Moritz Bächer, Stelian Coros, and Bernhard Thomaszewski. 2015. LinkEdit: interactive linkage editing using symbolic kinematics. ACM Transactions on Graphics 34, 4 (2015), 99:1--99:8.  ",
      "doi": "10.1145/2766985"
    },
    {
      "text": "Moritz Bächer, Emily Whiting, Bernd Bickel, and Olga SorkineHornung. 2014. Spin-it: Optimizing Moment of Inertia for Spinnable Objects. ACM Trans. Graph. 33, 4 (2014), 96:1--96:10.  ",
      "doi": "10.1145/2601097.2601157"
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal Fabrication. Foundations and Trends in Human-Computer Interaction 10, 3--4 (2017), 165--293.",
      "doi": ""
    },
    {
      "text": "Katia Bertoldi, Vincenzo Vitelli, Johan Christensen, and Martin van Hecke. 2017. Flexible mechanical metamaterials. Nature Reviews Materials 2, 11 (oct 2017), 17066.",
      "doi": ""
    },
    {
      "text": "Bernd Bickel, Moritz Bächer, Miguel A. Otaduy, Hyunho Richard Lee, Hanspeter Pfister, Markus Gross, and Wojciech Matusik. 2010. Design and fabrication of materials with desired deformation behavior. ACM Transactions on Graphics 29, 4 (2010), 1. arXiv:1211.6396  ",
      "doi": "10.1145/1778765.1778800"
    },
    {
      "text": "Xiang 'Anthony' Chen, Stelian Coros, and Scott E. Hudson. 2018. Medley: A Library of Embeddables to Explore Rich Material Properties for 3D Printed Objects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA.  ",
      "doi": "10.1145/3173574.3173736"
    },
    {
      "text": "Xiang 'Anthony' Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM Press, New York, New York, USA.  ",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Xiang Anthony Chen, Y. Tao, G. Wang, R. Kang, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2018. Forte: User-driven generative design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Vol. 2018-April.  ",
      "doi": "10.1145/3173574.3174070"
    },
    {
      "text": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Transactions on Graphics 32, 4 (2013), 83:1--83:12.  ",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "Juan Sebastian Cuellar, Gerwin Smit, Dick Plettenburg, and Amir A. Zadpoor. 2018. Additive manufacturing of non-assembly mechanisms. Additive Manufacturing 21 (2018), 150--158.",
      "doi": ""
    },
    {
      "text": "Tobias Frenzel, Claudio Findeisen, Muamer Kadic, Peter Gumbsch, and Martin Wegener. 2016. Tailored Buckling Microlattices as Reusable Light-Weight Shock Absorbers. Advanced Materials 28, 28 (jul 2016), 5865--5870.",
      "doi": ""
    },
    {
      "text": "Joshua B. Gafford, Samuel B. Kesner, Alperen Degirmenci, Robert J. Wood, Robert D. Howe, and Conor J. Walsh. 2014. A monolithic approach to fabricating low-cost, millimeter-scale multi-axis force sensors for minimally-invasive surgery. In Proceedings of the IEEE International Conference on Robotics and Automation. 1419--1425.",
      "doi": ""
    },
    {
      "text": "Aylin Gazi Gezgin and Koray Korkmaz. 2017. A New Approach to the Generation of Retractable Plate Structures Based on One-Uniform Tessellations. Journal of Mechanisms and Robotics 9, 4 (may 2017), 041015.",
      "doi": ""
    },
    {
      "text": "S. D. Guest and J. W. Hutchinson. 2003. On the determinacy of repetitive structures. Journal of the Mechanics and Physics of Solids 51 (2003), 383--391.",
      "doi": ""
    },
    {
      "text": "Ruslan Guseinov, Eder Miguel, and Bernd Bickel. 2017. CurveUps. ACM Transactions on Graphics 36, 4 (jul 2017).  ",
      "doi": "10.1145/3072959.3073709"
    },
    {
      "text": "Larry L. Howell, Spencer P. Magleby, and Brian M. Olsen. 2013. Handbook of Compliant Mechanisms. John Wiley and Sons.",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM Press, New York, New York, USA, 529--539.  ",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Scott Kirkpatrick, C. D. Gelatt, and Mario P. Vecchi. 1983. Optimization by Simulated Annealing. Science 220, 4598 (1983), 671--680.",
      "doi": ""
    },
    {
      "text": "Roderic Lakes. 1987. Foam Structures with a Negative Poisson's Ratio. Science 235, 4792 (feb 1987), 1038--1040.",
      "doi": ""
    },
    {
      "text": "Lin Lu, Andrei Sharf, Haisen Zhao, Yuan Wei, Qingnan Fan, Xuelin Chen, Yann Savoye, Changhe Tu, Daniel Cohen-Or, and Baoquan Chen. 2014. Build-to-Last : Strength to Weight 3D Printed Objects. ACM Transactions on Graphics 33, 4 (2014).  ",
      "doi": "10.1145/2601097.2601168"
    },
    {
      "text": "Jonàs Martínez, Jérémie Dumas Haichuan Song, and Sylvain Lefebvre. 2017. Orthotropic k-nearest foams for additive manufacturing. ACM Transactions on Graphics 36, 4 (2017).  ",
      "doi": "10.1145/3072959.3073638"
    },
    {
      "text": "Vittorio Megaro, Jonas Zehnder, Moritz Bächer, Stelian Coros, Markus Gross, and Bernhard Thomaszewski. 2017. A computational design tool for compliant mechanisms. ACM Transactions on Graphics 36, 4 (2017), 1--12.  ",
      "doi": "10.1145/3072959.3073636"
    },
    {
      "text": "M. J. Mirzaali, Shahram Janbaz, M. Strano, L. Vergani, and Amir A. Zadpoor. 2018. Shape-matching soft mechanical metamaterials. Scientific Reports 8, 965 (2018), 1--7.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM Press, New York, New York, USA, 599.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Jifei Ou, Zhao Ma, Jannik Peters, Sen Dai, Nikolaos Vlavianos, and Hiroshi Ishii. 2018. KinetiX - designing auxetic-inspired deformable material structures. Computers & Graphics 75 (oct 2018), 72--81.",
      "doi": "10.1016/j.cag.2018.06.003"
    },
    {
      "text": "Johannes T.B. Overvelde, James C. Weaver, Chuck Hoberman, and Katia Bertoldi. 2017. Rational design of reconfigurable prismatic architected materials. Nature 541, 7637 (2017), 347--352.",
      "doi": ""
    },
    {
      "text": "Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph Kider, Stefanie Mueller, Patrick Baudisch, and François Guimbretière. 2018. RoMA: Interactive Fabrication with Augmented Reality and a Robotic 3D Printer. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3173574.3174153"
    },
    {
      "text": "Jesús Pérez, Miguel A. Otaduy, and Bernhard Thomaszewski. 2017. Computational design and automated fabrication of kirchhoff-plateau surfaces. ACM Transactions on Graphics 36, 4 (2017), 1--12.  ",
      "doi": "10.1145/3072959.3073695"
    },
    {
      "text": "Romain Prévost, Wojciech Jarosz, Moritz Bächer, Wojciech Jarosz, and Olga Sorkine-Hornung. 2016. Balancing 3D Models with Movable Masses. In Vision, Modeling & Visualization. The Eurographics Association, 8. ",
      "doi": "10.5555/3056901.3056904"
    },
    {
      "text": "D.Janaki Ram, T.H. Sreenivas, and K.Ganapathy Subramaniam. 1996. Parallel Simulated Annealing Algorithms. J. Parallel and Distrib. Comput. 37, 2 (1996), 207--212.  ",
      "doi": "10.1006/jpdc.1996.0121"
    },
    {
      "text": "Pedro M. Reis, Heinrich M. Jaeger, and Martin van Hecke. 2015. Designer Matter: A perspective. Extreme Mechanics Letters 5 (2015), 25--29.",
      "doi": ""
    },
    {
      "text": "Michael L. Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, and Scott E. Hudson. 2017. Stretching the Bounds of 3D Printing with Embedded Textiles. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1--12.  ",
      "doi": "10.1145/3025453.3025460"
    },
    {
      "text": "Thijs Roumen, Bastian Kruck, Tobias Dürschmid, Tobias Nack, and Patrick Baudisch. 2016. Mobile Fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM Press, New York, New York, USA, 3--14.  ",
      "doi": "10.1145/2984511.2984586"
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: embedded single-camera sensing of printed physical user interfaces. In Proceedings of the annual ACM symposium on User interface software and technology. 447--456.  ",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Krishna Kumar Saxena, Raj Das, and Emilio P. Calius. 2016. Three Decades of Auxetics Research -- Materials with Negative Poisson's Ratio: A Review. Advanced Engineering Materials 18, 11 (nov 2016), 1847--1870.",
      "doi": ""
    },
    {
      "text": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to control elasticity in 3D printing. ACM Transactions on Graphics 34, 4 (2015).  ",
      "doi": "10.1145/2766926"
    },
    {
      "text": "Christian Schumacher, Steve Marschner, Markus Gross, and Bernhard Thomaszewski. 2018. Mechanical Characterization of structured sheet materials. ACM Transactions on Graphics 37, 4 (2018).  ",
      "doi": "10.1145/3197517.3201278"
    },
    {
      "text": "Hamed Seifi, Anooshe Rezaee Javan, Arash Ghaedizadeh, Jianhu Shen, Shanqing Xu, and Yi Min Xie. 2017. Design of hierarchical structures for synchronized deformations. Scientific Reports 7, January (2017), 1--7.",
      "doi": ""
    },
    {
      "text": "Sicong Shan, Sung H. Kang, Jordan R. Raney, Pai Wang, Lichen Fang, Francisco Candido, Jennifer A. Lewis, and Katia Bertoldi. 2015. Multistable Architected Materials for Trapping Elastic Strain Energy. Advanced Materials 27, 29 (2015), 4296--4301. arXiv:1207.1956",
      "doi": ""
    },
    {
      "text": "Bernhard Thomaszewski, Stelian Coros, Damien Gauge, Vittorio Megaro, Eitan Grinspun, and Markus Gross. 2014. Computational Design of Linkage-Based Characters. ACM Transactions on Graphics 33, 4 (2014), 64:1--64:9.  ",
      "doi": "10.1145/2601097.2601143"
    },
    {
      "text": "Nurcan Gecer Ulu, Stelian Coros, and Levent Burak Kara. 2018. Designing coupling behaviors using compliant shape optimization. ComputerAided Design 101 (2018), 57--71.",
      "doi": ""
    },
    {
      "text": "Andreas Wächter and Lorenz T. Biegler. 2006. On the implementation of an interior-point filter line-search algorithm for large-scale nonlinear programming. Mathematical Programming 106, 1 (01 Mar 2006), 25--57. ",
      "doi": "10.5555/3114195.3114663"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Christian Weichel, John Hardy, Jason Alexander, and Hans Gellersen. 2015. ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM Press, New York, New York, USA, 93--102.  ",
      "doi": "10.1145/2807442.2807451"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: A Mixed-reality Environment for Personal Fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3855--3864.  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Karl D. D. Willis, C. Xu, K.-J. Wu, G. Levin, and Mark D. Gross. 2011. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction. 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Jonas Zehnder, Espen Knoop, Moritz Bächer, and Bernhard Thomaszewski. 2017. MetaSilicone: Design and Fabrication of Composite Silicone with Desired Mechanical Properties. ACM Transactions on Graphics 36, 6 (nov 2017), 1--13.  ",
      "doi": "10.1145/3130800.3130881"
    },
    {
      "text": "Ran Zhang, Thomas Auzinger, Duygu Ceylan, Wilmot Li, and Bernd Bickel. 2017. Functionality-aware retargeting of mechanisms to 3D shapes. ACM Transactions on Graphics 36, 4 (jul 2017), 1--13.  ",
      "doi": "10.1145/3072959.3073710"
    }
  ]
}