{
  "doi": "10.1145/3290605.3300538",
  "title": "Relations are more than Bytes: Re-thinking the Benefits of Smart Services through People and Things",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Critical approaches to smart technologies have emerged in HCI that question the conditions necessary for smart technologies to benefit people. Smart services rely on a relation of trust and sense of security between people and technology requiring a more expansive definition of security. Using established design methods, we worked with two residents' groups to critically explore and rethink smart services in the home and city. From our data analysis, we derive insights about perceptions and understandings of trust, privacy and security of smart devices, and identify how technological security needs to work in concert with social and relational forms of security for smart services to be effective. We conclude with an orientation for HCI that focuses on designing services for and with smart people and things.",
  "tags": [
    "smart cities",
    "participatory design",
    "iot",
    "digital civics",
    "shared space",
    "lego",
    "security theory"
  ],
  "authors": [
    {
      "name": "Claude P. R. Heath",
      "institution": "Royal Holloway, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81552229656",
      "orcid": "missing"
    },
    {
      "name": "Clara Crivellaro",
      "institution": "Newcastle University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    },
    {
      "name": "Lizzie Coles-Kemp",
      "institution": "Royal Holloway, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81448597617",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Khorshed Alam and Sophia Imran. 2015. The digital divide and social inclusion among refugee migrants: A case in regional Australia. Information Technology & People 28, 2 (2015), 344--365.",
      "doi": ""
    },
    {
      "text": "Asam Almohamed and Dhaval Vyas. 2016. Designing for the Marginalized: A step towards understanding the lives of refugees and asylum seekers. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems. ACM, 165--168.  ",
      "doi": "10.1145/2908805.2909415"
    },
    {
      "text": "Sunderland City Council/Edge Analytics. 2016. Sunderland: Updating the Demographic Evidence. Retrieved August 31, 2018 from https://www.sunderland.gov.uk/media/19033/ Sunderland-Updating-the-Demographic-Evidence-2016-/pdf/6_Sunderland_Updating_the_Demographic_Evidence_(2016).pdf",
      "doi": ""
    },
    {
      "text": "Mariam Asad, Christopher A Le Dantec, Becky Nielsen, and Kate Diedrick. 2017. Creating a Sociotechnical API: Designing City-Scale Community Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2295--2306.  ",
      "doi": "10.1145/3025453.3025963"
    },
    {
      "text": "Christian Badertscher, Christian Matt, Ueli Maurer, Phillip Rogaway, and Björn Tackmann. 2015. Augmented secure channels and the goal of the TLS 1.3 record layer. In International Conference on Provable Security. Springer, 85--104.  ",
      "doi": "10.1007/978-3-319-26059-4_5"
    },
    {
      "text": "Kirsten Boehner and Carl DiSalvo. 2016. Data, design and civics: An exploratory study of civic tech. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2970--2981.  ",
      "doi": "10.1145/2858036.2858326"
    },
    {
      "text": "Sergey Bratus, Trey Darley, Michael Locasto, Meredith L Patterson, Rebecca bx Shapiro, and Anna Shubina. 2014. Beyond planted bugs in\" trusting trust\": The input-processing frontier. IEEE Security & Privacy 12, 1 (2014), 83--87.",
      "doi": ""
    },
    {
      "text": "Andre de Oliveira Bueno. 2016. From Smart Cities to Social Cities: Technology to Support Community Life. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 198--202.  ",
      "doi": "10.1145/2851581.2859020"
    },
    {
      "text": "Peter Bürgi and Johan Roos. 2003. Images of strategy. European Management Journal 21, 1 (2003), 69--78.",
      "doi": ""
    },
    {
      "text": "Peter T Bürgi, Claus D Jacobs, and Johan Roos. 2005. From metaphor to practice in the crafting of strategy. Journal of Management Inquiry 14, 1 (2005), 78--94. Relations are more than Bytes CHI'19, May 2019, Glasgow, UK",
      "doi": ""
    },
    {
      "text": "Paolo Cardullo and Rob Kitchin. 2017. Being a 'citizen' in the smart city: Up and down the scaffold of smart citizen participation: The Programmable City Working Paper 30 (2017).",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Christopher A Le Dantec. 2018. Going the Distance: Trust Work for Citizen Participation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 312.  ",
      "doi": "10.1145/3173574.3173886"
    },
    {
      "text": "Lorrie Faith Cranor and Simson Garfinkel. 2005. Security and usability: designing secure systems that people can use. O'Reilly Media, Inc.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J Bowen, Peter C Wright, and Patrick Olivier. 2015. Contesting the city: Enacting the political through digitally supported urban walks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2853--2862.  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: how HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2397--2406.  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justiceoriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Paul Dourish and Ken Anderson. 2006. Collective information practice: Exploring privacy and security as social and cultural phenomena. Human-computer interaction 21, 3 (2006), 319--342.  ",
      "doi": "10.1207/s15327051hci2103_2"
    },
    {
      "text": "Paul Dourish, E Grinter, Jessica Delgado De La Flor, and Melissa Joseph. 2004. Security in the wild: user strategies for managing security as an everyday, practical problem. Personal and Ubiquitous Computing 8, 6 (2004), 391--401.  ",
      "doi": ""
    },
    {
      "text": "Paul Dunphy, John Vines, Lizzie Coles-Kemp, Rachel Clarke, Vasilis Vlachokyriakos, Peter Wright, John McCarthy, and Patrick Olivier. 2014. Understanding the experience-centeredness of privacy and security technologies. In Proceedings of the 2014 New Security Paradigms Workshop. ACM, 83--94.  ",
      "doi": "10.1145/2683467.2683475"
    },
    {
      "text": "Thomas Erickson, Mark Podlaseck, Sambit Sahu, Jing D Dai, Tian Chao, and Milind Naphade. 2012. The dubuque water portal: evaluation of the uptake, use and impact of residential water consumption feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 675--684.  ",
      "doi": "10.1145/2207676.2207772"
    },
    {
      "text": "Laura Forlano. 2016. Decentering the human in the design of collaborative cities. Design Issues 32, 3 (2016), 42--54.",
      "doi": ""
    },
    {
      "text": "Anthony Giddens. 1991. Modernity and self-identity: Self and society in the late modern age. Stanford university press.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist studies 14, 3 (1988), 575--599.",
      "doi": ""
    },
    {
      "text": "Lambeth Public Health. 2015. Joint Strategic Needs Assessment (JSNA), Lambeth Public Health. Retrieved August 31, 2018 from https://www.lambeth.gov.uk/sites/default/files/ssh-lambeth-demography-2015.pdf",
      "doi": ""
    },
    {
      "text": "Lambeth Public Health. 2017. Lambeth diverse: Joint Strategic Needs Assessment (JSNA), Lambeth Public Health. Retrieved August 31, 2018 from https://www.lambeth.gov.uk/adult-social-care-and-health/health-and-wellbeing/lambeths-health-profile-and-the-jsna",
      "doi": ""
    },
    {
      "text": "Claude Heath, Lizzie Coles-Kemp, Peter A Hall, et al. 2018. Holding onto Dissensus: the participatory co-design of security. Strategic Design Research Journal (2018).",
      "doi": ""
    },
    {
      "text": "C. P. Heath, L. Coles-Kemp, and P. A Hall. 2014. Logical Lego?: Coconstructed perspectives on service design. NordDesign 2014, Proceedings (2014).",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Rob Comber. 2018. Connected seeds and sensors: co-designing internet of things for sustainable smart cities with urban food-growing communities. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial-Volume 2. ACM, 18.  ",
      "doi": "10.1145/3210604.3210620"
    },
    {
      "text": "Thomas Hobbes. 2016. Thomas Hobbes: Leviathan (Longman Library of Primary Sources in Philosophy). Routledge.",
      "doi": ""
    },
    {
      "text": "Andrew Hood and Tom Waters. 2017. Living standards, poverty and inequality in the UK: 2016--17 to 2021--22. Institute for Fiscal Studies London, England.",
      "doi": ""
    },
    {
      "text": "Philip G Inglesant and M Angela Sasse. 2010. The true cost of unusable password policies: password use in the wild. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 383--392.  ",
      "doi": "10.1145/1753326.1753384"
    },
    {
      "text": "Dorothea Kleine. 2009. The ideology behind the technology--Chilean microentrepreneurs and public ICT policies. Geoforum 40, 2 (2009), 171--183.",
      "doi": ""
    },
    {
      "text": "Susan Landau. 2011. Surveillance or security?: The risks posed by new wiretapping technologies. MIT Press. ",
      "doi": "10.5555/1964891"
    },
    {
      "text": "Christopher A Le Dantec. 2016. Designing publics. MIT Press. ",
      "doi": "10.5555/3100000"
    },
    {
      "text": "Thomas Maskell, Clara Crivellaro, Robert Anderson, Tom Nappey, Vera Araújo-Soares, and Kyle Montague. 2018. Spokespeople: Exploring Routes to Action through Citizen-Generated Data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 405.  ",
      "doi": "10.1145/3173574.3173979"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as experience. interactions 11, 5 (2004), 42--43.  ",
      "doi": "10.1145/1015530.1015549"
    },
    {
      "text": "Donald McMillan, Arvid Engström, Airi Lampinen, and Barry Brown. 2016. Data and the City. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2933--2944.  ",
      "doi": "10.1145/2858036.2858434"
    },
    {
      "text": "Peter JJ McNerney and Ning Zhang. 2011. Towards an integration of security and quality of service in ip-based mobile ad hoc networks. In Global Telecommunications Conference (GLOBECOM 2011), 2011 IEEE. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Andrew Monk and Steve Howard. 1998. Methods & tools: the rich picture: a tool for reasoning about work context. interactions 5, 2 (1998), 21--30.  ",
      "doi": "10.1145/274430.274434"
    },
    {
      "text": "Andrew Moravcsik. 2001. Liberal international relations theory: a social scientific assessment. Number 1--2. Weatherhead Center for International Affairs, Harvard University Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "University of Durham/Office for National Statistics. 2018. Nomis. Retrieved August 31, 2018 from https://www.nomisweb.co.uk/",
      "doi": ""
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics: Taking a local turn. interactions 22, 4 (2015), 61--63.  ",
      "doi": "10.1145/2776885"
    },
    {
      "text": "Lego Serious Play. 2010. Open Source Introduction to Lego Serious Play. Billund: Lego. Lokaliseret den 7 (2010), 2013.",
      "doi": ""
    },
    {
      "text": "The Brixton Pound. 2018. The Brixton Pound. Retrieved August 31, 2018 from http://brixtonpound.org",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Ian G Johnson, Kyle Montague, Philip James, and Peter Wright. 2019. Making Open Data Work for Civic Advocacy. CSCW Paper, In Press (2019).  ",
      "doi": "10.1145/3274412"
    },
    {
      "text": "Johan Roos, Bart Victor, and Matt Statler. 2004. Playing seriously with strategy. Long Range Planning 37, 6 (2004), 549--568.",
      "doi": ""
    },
    {
      "text": "M Angela Sasse and Ivan Flechais. 2005. Usable security: Why do we need it? How do we get it? O'Reilly.",
      "doi": ""
    },
    {
      "text": "Klaus-Peter Schulz and Silke Geithner. 2013. Creative Tools for Collective Creativity The Serious Play Method Using Lego Bricks. Learning and Collective Creativity: Activity-Theoretical and Sociocultural Studies (2013), 179--197.",
      "doi": ""
    },
    {
      "text": "Amartya Sen. 1993. Capability and well-being. The quality of life. 30 (1993).",
      "doi": ""
    },
    {
      "text": "Amartya Sen. 2005. Human rights and capabilities. Journal of human development 6, 2 (2005), 151--166.",
      "doi": ""
    },
    {
      "text": "Graham M Smith. 2005. Into Cerberus' Lair: Bringing the Idea of Security to Light 1. The British Journal of Politics & International CHI'19, May 2019, Glasgow, UK Heath, Crivellaro, and Coles-Kemp Relations 7, 4 (2005), 485--507.",
      "doi": ""
    },
    {
      "text": "Alex S Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-place: Thinking through the relations between data and community. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2863--2872.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Joan C Tronto. 2013. Caring democracy: Markets, equality, and justice. NYU Press.",
      "doi": ""
    },
    {
      "text": "Jeroen Van den Hoven, P Vermaas, and Ibo Van de Poel. 2015. Handbook of ethics, values and technological design. Springer.",
      "doi": ""
    },
    {
      "text": "Alexander JAM van Deursen and Karen Mossberger. 2018. Any Thing for Anyone? A New Digital Divide in Internet-of-Things Skills. Policy & internet (2018).",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Paul Dunphy, Vasillis Vlachokyriakos, Isaac Teece, Andrew Monk, and Patrick Olivier. 2012. Cheque mates: participatory design of digital payments with eighty somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1189--1198.  ",
      "doi": "10.1145/2207676.2208569"
    },
    {
      "text": "John Vines, Paul Dunphy, Mark Blythe, Stephen Lindsay, Andrew Monk, and Patrick Olivier. 2012. The joy of cheques: trust, paper and eighty somethings. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 147--156.  ",
      "doi": "10.1145/2145204.2145229"
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Pete Wright, Evika Karamagioli, Eleni-Revekka Staiou, Dimitris Gouscos, Rowan Thorpe, Antonio Krüger, Johannes Schöning, Matt Jones, et al. 2017. HCI, Solidarity Movements and the Solidarity Economy. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3126--3137.  ",
      "doi": "10.1145/3025453.3025490"
    },
    {
      "text": "Langdon Winner. 1980. Do artifacts have politics? Daedalus (1980), 121--136.",
      "doi": ""
    },
    {
      "text": "Donald Woods Winnicott. 2012. Playing and reality. Routledge.",
      "doi": ""
    }
  ]
}