{
  "doi": "10.1145/3290605.3300725",
  "title": "Examining the \"Global\" Language of Emojis: Designing for Cultural Representation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Emojis are becoming an increasingly popular mode of communication between individuals worldwide, with researchers claiming them to be a type of \"ubiquitous language'' that can span different languages due to its pictorial nature. Our study uses a combination of methods to examine how emojis are adopted and perceived by individuals from diverse cultural backgrounds and 45 countries. Our survey and interview findings point to the existence of a cultural gap between user perceptions and the current emoji standard. Using participatory design, we sought to address this gap by designing 40 emojis and conducted another survey to evaluate their acceptability compared to existing Japanese emojis. We also draw on participant observation from a Unicode Consortium meeting on emoji addition. Our analysis leads us to discuss how emojis might be made more inclusive, diverse, and representative of the populations that use them.",
  "authors": [
    {
      "name": "Philippe Kimura-Thollander",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659255951",
      "orcid": "missing"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Saeideh Bakhshi, David A. Shamma, Lyndon Kennedy, Yale Song, Paloma de Juan, and Joseph 'Jofish' Kaye. 2016. Fast, Cheap, and Good: Why Animated GIFs Engage Us. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 575--586.  ",
      "doi": "10.1145/2858036.2858532"
    },
    {
      "text": "Francesco Barbieri, German Kruszewski, Francesco Ronzano, and Horacio Saggion. 2016. How Cosmopolitan Are Emojis?: Exploring Emojis Usage and Meaning over Different Languages with Distributional Semantics. In Proceedings of the 2016 ACM on Multimedia Conference (MM '16). ACM, New York, NY, USA, 531--535.  ",
      "doi": "10.1145/2964284.2967278"
    },
    {
      "text": "Elli Bourlai and Susan C. Herring. 2014. Multimodal Communication on Tumblr: \"I Have So Many Feels!\". In Proceedings of the 2014 ACM Conference on Web Science (WebSci '14). ACM, New York, NY, USA, 171--175.  ",
      "doi": "10.1145/2615569.2615697"
    },
    {
      "text": "Jeremy Burge. 2018. 2018: The Year of Emoji Convergence? (13 February 2018). https://blog.emojipedia.org/2018-the-year-of-emojiconvergence/",
      "doi": ""
    },
    {
      "text": "Jeremy Burge. 2018. Apple Proposes New Accessibility Emojis. (23 March 2018). https://blog.emojipedia.org/apple-proposes-newaccessibility-emojis/",
      "doi": ""
    },
    {
      "text": "Christina Chaey. 2013. Are Emoji Racist? (22 August 2013). https: //www.fastcompany.com/3016256/are-emojis-racist",
      "doi": ""
    },
    {
      "text": "Edwin Chan, Teddy Seyed, Wolfgang Stuerzlinger, Xing-Dong Yang, and Frank Maurer. 2016. User Elicitation on Single-hand Microgestures. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3403--3414.  ",
      "doi": "10.1145/2858036.2858589"
    },
    {
      "text": "Emily Contois. 2017. From the Editor: Defining Food Studies and the Next Four Years. Graduate Journal of Food Studies 4, 1 (1 March 2017). https://gradfoodstudies.org/2017/03/01/from-the-editordefining-food-studies-and-the-next-four-years/",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-intended Functions of Emojis in US Messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 504--509.  ",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Mark Davis and Peter Edberg. 2018. Unicode Technical Standard 51. (21 May 2018). http://unicode.org/reports/tr51/",
      "doi": ""
    },
    {
      "text": "Culture Decanted. 2014. Eating Yourself: We Consume Identity Through Food? (19 October 2014). https://culturedecanted.com/2014/10/19/eating-yourself-we-consume-identity-through-food/",
      "doi": ""
    },
    {
      "text": "Daantje Derks, Arjan E. R. Bos, and Jasper von Grumbkow. 2008. Emoticons in Computer-Mediated Communication: Social Motives and Social Context. CyberPsychology & Behavior 11, 1 (2008), 99--101.",
      "doi": ""
    },
    {
      "text": "Oxford Dictionaries. 2015. Announcing the Oxford Dictionaries \"Word\" of the Year 2015. (17 November 2015). https://www. oxforddictionaries.com/press/news/2016/9/2/WOTY",
      "doi": ""
    },
    {
      "text": "Eli Dresner and Susan Herring. 2010. Functions of the Nonverbal in CMC: Emoticons and Illocutionary Force. 20 (07 2010), 249 -- 268.",
      "doi": ""
    },
    {
      "text": "EmojiOne. 2017. Emoticons, Emojis and Stickers...Oh, My! (12 August 2017). https://www.emojione.com/blog/emoticons-emojis-andstickersoh-my",
      "doi": ""
    },
    {
      "text": "Emojipedia. 2018. Person With Folded Hands Emoji. (2018). https://emojipedia.org/person-with-folded-hands/",
      "doi": ""
    },
    {
      "text": "Instagram Engineering. 2015. Emojineering Part 1: Machine Learning for Emoji Trends. (1 May 2015). https: //instagram-engineering.com/emojineering-part-1-machine-learningfor-emoji-trendsmachine-learning-for-emoji-trends-7f5f9cb979ad",
      "doi": ""
    },
    {
      "text": "Jose A. Gallud, Habib M. Fardoun, Fernando Andres, and Nehme Safa. 2018. A Study on How Older People Use Emojis. In Proceedings of the XIX International Conference on Human Computer Interaction (Interacción 2018). ACM, New York, NY, USA, Article 20, 4 pages.  ",
      "doi": "10.1145/3233824.3233861"
    },
    {
      "text": "Lauren Gambino. 2014. Emoji to get some long-awaited diversity with new range of skin tones. (4 November 2014). https://www.theguardian.com/technology/2014/nov/04/emojis-diversity-skin-tones",
      "doi": ""
    },
    {
      "text": "Leo A. Goodman. 1961. Snowball Sampling. The Annals of Mathematical Statistics 32 1 (1961), 148--170.",
      "doi": ""
    },
    {
      "text": "Google. 2018. Material Design. (2018). https://material.io/design/introduction/",
      "doi": ""
    },
    {
      "text": "Andy Holdeman. 2013. Why Are There No Black Emojis? (11 March 2013). https://mic.com/articles/29181/why-are-there-no-black-emojis",
      "doi": ""
    },
    {
      "text": "Jialun \"Aaron\" Jiang, Jed R. Brubaker, and Casey Fiesler. 2017. Understanding Diverse Interpretations of Animated GIFs. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1726--1732.  ",
      "doi": "10.1145/3027063.3053139"
    },
    {
      "text": "Victor Jupp. 2006. The SAGE Dictionary of Social Research Methods. SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Heather Kelley. 2016. Apple replaces the pistol emoji with a water gun. (2 August 2016). https://money.cnn.com/2016/08/01/technology/applepistol-emoji/index.html",
      "doi": ""
    },
    {
      "text": "Ryan Kelly and Leon Watts. 2015. Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships. Experiences of Technology Appropriation: Unanticipated Users, Usage, Circumstances, and Design ; Conference date: 20-09--2015 Through 20-09--2015.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, Jane Siegel, and W. McGuire, Timothy. 1988. Computersupported Cooperative Work: A Book of Readings. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, Chapter Social Psychological Aspects of Computer-mediated Communication (Reprint), 657--682. http://dl.acm.org/citation.cfm?id=49504.49528 ",
      "doi": "10.5555/49504.49528"
    },
    {
      "text": "Ken Lo. 2016. A Brief History of Emoji: The New Language Of The Internet. (3 January 2016). https://community.giffgaff.com/t5/Blog/ABrief-History-of-Emoji-The-New-Language-Of-The-Internet/ba-p/",
      "doi": ""
    },
    {
      "text": "Shao-Kang Lo. 2008. The Nonverbal Communication Functions of Emoticons in Computer-Mediated Communication. CyberPsychology & Behavior 11, 5 (2008), 595--597.",
      "doi": ""
    },
    {
      "text": "Xuan Lu, Wei Ai, Xuanzhe Liu, Qian Li, Ning Wang, Gang Huang, and Qiaozhu Mei. 2016. Learning from the Ubiquitous Language: An Empirical Analysis of Emoji Usage of Smartphone Users. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 770--780.  ",
      "doi": "10.1145/2971648.2971724"
    },
    {
      "text": "Kris Markman and Sae Oshima. 2007. Pragmatic Play? Some Possible Functions of English Emoticons and Japanese Kaomoji in ComputerMediated Discourse. (18 October 2007).",
      "doi": ""
    },
    {
      "text": "Tim Futing Liao Michael S. Lewis-Beck, Alan Bryman. 2004. The SAGE Encyclopedia of Social Science Research Methods. SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Hannah Miller, Jacob Thebault-Spieker, Shuo Chang, Isaac Johnson, Loren Terveen, and Brent Hecht. 2016. \"\"blissfully happy\" or \"ready to fight\": Varying interpretations of emoji\". In Proceedings of the 10th International Conference on Web and Social Media, ICWSM 2016. https://experts.umn.edu/en/publications/blissfullyhappy-or-ready-to-fight-varying-interpretations-of-emo",
      "doi": ""
    },
    {
      "text": "Michael J. Muller. 2003. The Human-computer Interaction Handbook. L. Erlbaum Associates Inc., Hillsdale, NJ, USA, Chapter Participatory Design: The Third Space in HCI, 1051--1068. http://dl.acm.org/citation.cfm?id=772072.772138",
      "doi": "10.5555/772072.772138"
    },
    {
      "text": "Blanca Myers. 2017. Women and Minorities in Tech, By the Numbers. (27 March 2017). https://www.wired.com/story/computer-sciencegraduates-diversity/",
      "doi": ""
    },
    {
      "text": "Mamiko Nakano. 2015. Why and how I created emoji: Interview with Shigetaka Kurita. (2015). https://web.archive.org/web/20160610220635/http://ignition.co/105",
      "doi": ""
    },
    {
      "text": "Yukiko Nishimura. 2016. A sociolinguistic analysis of emoticon usage in Japanese blogs: Variation by age, gender, and topic. AoIR Selected Papers of Internet Research 5 (2016).",
      "doi": ""
    },
    {
      "text": "Jaram Park, Vladimir Barash, Clay Fink, and Meeyoung Cha. 2013. Emoticon Style: Interpreting Differences in Emoticons Across Cultures. https://www.aaai.org/ocs/index.php/ICWSM/ICWSM13/paper/view/6132",
      "doi": ""
    },
    {
      "text": "Ella Peltonen, Eemil Lagerspetz, Jonatan Hamberg, Abhinav Mehrotra, Mirco Musolesi, Petteri Nurmi, and Sasu Tarkoma. 2018. The Hidden Image of Mobile Apps: Geographic, Demographic, and Cultural Factors in Mobile Usage. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, New York, NY, USA, Article 10, 12 pages.  ",
      "doi": "10.1145/3229434.3229474"
    },
    {
      "text": "Henning Pohl, Christian Domin, and Michael Rohs. 2017. Beyond Just Text: Semantic Emoji Similarity Modeling to Support Expressive Communication. ACM Transactions on Computer-Human Interaction. 24, 1, Article 6 (March 2017), 42 pages.  ",
      "doi": "10.1145/3039685"
    },
    {
      "text": "Marc Schenker. 2016. The Surprising History of Emojis. (11 October 2016). https://www.webdesignerdepot.com/2016/10/the-surprisinghistory-of-emojis/",
      "doi": ""
    },
    {
      "text": "Colette Shade. 2015. The Emoji Diversity Problem Goes Way Beyond Race. (11 November 2015). https://www.wired.com/2015/11/emojidiversity-politics-culture/",
      "doi": ""
    },
    {
      "text": "Irina Shklovski, Janet Vertesi, and Silvia Lindtner. 2014. Introduction to This Special Issue on Transnational HCI. Human-Computer Interaction 29, 1 (2014), 1--21.  ",
      "doi": "10.1080/07370024.2013.823823"
    },
    {
      "text": "Lee Sproull and Sara Kiesler. 1986. Reducing Social Context Cues: Electronic Mail in Organizational Communications. Management Science 32, 11 (1986), 1492--1512. ",
      "doi": "10.5555/2845794.2845803"
    },
    {
      "text": "Nevana Stajcic. 2013. Understanding Culture: Food as a Means of Communication. Hemispheres. Studies on Cultures and Societies 28 (2013), 77--87.",
      "doi": ""
    },
    {
      "text": "Satomi Sugiyama. 2015. Kawaii meiru and Maroyaka neko: Mobile emoji for relationship maintenance and aesthetic expressions among Japanese teens. First Monday 20, 10 (2015).",
      "doi": ""
    },
    {
      "text": "Selina Sutton and Shaun Lawson. 2017. A Provocation for Rethinking and Democratising Emoji Design. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, New York, NY, USA, 7--12.  ",
      "doi": "10.1145/3064857.3079109"
    },
    {
      "text": "Swiftkey. 2015. SwiftKey Emoji Report. (April 2015). https://www. scribd.com/doc/262594751/SwiftKey-Emoji-Report",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor. 2011. Out There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 685--694.  ",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "Lisa Collins Tidwell and Joseph B. Walther. 2002. Computer-Mediated Communication Effects on Disclosure, Impressions, and Interpersonal Evaluations: Getting To Know One Another a Bit at a Time. Human Communication Research 28, 3 (2002), 317. https://www.learntechlib.org/p/94063",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell and David R. Flatla. 2016. Oh That's What You Meant!: Reducing Emoji Misunderstanding. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, New York, NY, USA, 859--866.  ",
      "doi": "10.1145/2957265.2961844"
    },
    {
      "text": "Unicode. 2016. Proposed Draft UTS #52, Unicode Emoji Mechanisms. (20 May 2016). http://www.unicode.org/review/pri321/",
      "doi": ""
    },
    {
      "text": "Unicode. 2017. Proposed Update UTR #51, Unicode Emoji (Version 5.0). (30 January 2017). http://www.unicode.org/review/pri343/",
      "doi": ""
    },
    {
      "text": "Unicode. 2018. Emoji Ordering, v11.0. (9 August 2018). http://unicode.org/emoji/charts/emoji-ordering.html",
      "doi": ""
    },
    {
      "text": "Unicode. 2018. Public Review Issues. (6 August 2018).",
      "doi": ""
    },
    {
      "text": "Unicode. 2018. Selection Factors for Exclusion: Faulty Comparison. (2018). https://unicode.org/emoji/proposals.html#Faulty_Comparison",
      "doi": ""
    },
    {
      "text": "Unicode. 2018. Selection Factors for Exclusion: Overly Specific. (2018). https://unicode.org/emoji/proposals.html#Specific",
      "doi": ""
    },
    {
      "text": "Unicode. 2018. Selection Factors for Inclusion. (16 July 2018). https: //unicode.org/emoji/proposals.html",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1993. Impression development in computer Rmediated interaction. Western Journal of Communication 57, 4 (1993), 381--398.",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther and Kyle P. D'Addario. 2001. The Impacts of Emoticons on Message Interpretation in Computer-Mediated Communication. Social Science Computer Review 19, 3 (2001), 324--347.",
      "doi": ""
    },
    {
      "text": "Anna Wiener. 2016. Why Can't Silicon Valley Solve Its Diversity Problem? (26 November 2016). https://www.newyorker.com/business/currency/why-cant-silicon-valley-solve-its-diversity-problem",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why Means 'I Love You'. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 152, 10 pages.  ",
      "doi": "10.1145/3173574.3173726"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 748--759.  ",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}