{
  "doi": "10.1145/3290605.3300607",
  "title": "Gabber: Supporting Voice in Participatory Qualitative Practices",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We describe the iterative design, development and learning process we undertook to produce Gabber, a digital platform that aims to support distributed capture of spoken interviews and discussions, and their qualitative analysis. Our aim is to reduce both expertise and cost barriers associated with existing technologies, making the process more inclusive. Gabber structures distributed audio data capture, facilitates participatory sensemaking, and supports collaborative reuse of audio. We describe our design and development journey across three distinct field trials over a two-year period. Reflecting on the iterative design process, we offer insights into the challenges faced by non-experts throughout their qualitative practices, and provide guidance for researchers designing systems to support engagement in these practices.",
  "authors": [
    {
      "name": "Jay Rainey",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367245",
      "orcid": "missing"
    },
    {
      "name": "Kyle Montague",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81472655898/rel-imgonly/xsmall_profile.jpg",
      "acmid": "81472655898",
      "orcid": "missing"
    },
    {
      "name": "Pamela Briggs",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100277550",
      "orcid": "missing"
    },
    {
      "name": "Robert Anderson",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261760",
      "orcid": "missing"
    },
    {
      "name": "Thomas Nappey",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959298457",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Brett Adams and Svetha Venkatesh. 2005. Situated event bootstrapping and capture guidance for automated home movie authoring. Proceedings of the 13th ACM International Conference on Multimedia, MM 2005 (2005), 754--763.  ",
      "doi": "10.1145/1101149.1101312"
    },
    {
      "text": "Amazon. {n. d.}. Amazon Transcribe - Automatic Speech Recognition AWS. Retrieved Jan 2, 2019 from https://aws.amazon.com/transcribe/",
      "doi": ""
    },
    {
      "text": "Julia Bailey. 2008. First steps in qualitative data analysis: Transcribing. Family Practice 25, 2 (2008), 127--131.",
      "doi": ""
    },
    {
      "text": "Martina Balestra, Orit Shaer, Johanna Okerlund, Madeleine Ball, and Oded Nov. 2016. The Effect of Exposure to Social Annotation on Online Informed Consent Beliefs and Behavior. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (2016), 900--912.  ",
      "doi": "10.1145/2818048.2820012"
    },
    {
      "text": "Louise Barkhuus and Barry Brown. 2012. The Sociality of Fieldwork: Designing for Social Science Research Practice and Collaboration. Proceedings of the 17th ACM International Conference on Supporting Group Work (2012), 35--44.  ",
      "doi": "10.1145/2389176.2389183"
    },
    {
      "text": "Fran Baum. 2006. Participatory action research. Journal of Epidemiology & Community Health 60, 10 (2006), 854--857.",
      "doi": ""
    },
    {
      "text": "Nis Bornoe, Louise Barkhuus, Barry Brown, and Malcolm Hall. 2011. TagPad for iPad - Designing a Support Tool for Inter view Studies. The Eleventh Danish Human Computer Interaction Research Symposium, Copenhagen, Denmark: Copenhagen Business School (2011). http://openarchive.cbs.dk/bitstream/handle/10398/8359/ proceeding_DHRS2011'sequence=3#page=56",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, May 2015 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Amy S. Bruckman, Casey Fiesler, Jeff Hancock, and Cosmin Munteanu. 2017. CSCW Research Ethics Town Hall : Working Towards Community Norms. Proceedings of Computer-Supported Cooperative Work and Social Computing (CSCW) (2017), 113--115.  ",
      "doi": "10.1145/3022198.3022199"
    },
    {
      "text": "Scott Carter, John Adcock, John Doherty, and Stacy Branham. 2010. NudgeCam: Toward Targeted, Higher Quality Media Capture. Proceedings of the 18th ACM International Conference on Multimedia (2010), 615--618.  ",
      "doi": "10.1145/1873951.1874034"
    },
    {
      "text": "Flora Cornish, Alex Gillespie, and Tania Zittoun. 2013. Collaborative Analysis of Qualitative Data. Handbook of qualitative data analysis (2013), 79--93.",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J. Bowen, Peter Wright, and Patrick Olivier. 2015. Contesting the city: enacting the pollitical through digitally supported urban walks. CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 2853--2862.  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Marc Davis. 2003. Active capture: automatic direction for automatic movies. Proceedings of the eleventh ACM international conference on Multimedia - MULTIMEDIA '03 (2003), 602.  ",
      "doi": "10.1145/957013.957028"
    },
    {
      "text": "Brian Dorn, Larissa B Schroeder, and Adam Stankiewicz. 2015. Piloting TrACE: Exploring Spatiotemporal Anchored Collaboration in Asynchronous Learning. CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (2015), 393--403.  ",
      "doi": "10.1145/2675133.2675178"
    },
    {
      "text": "Andy Dow, John Vines, Rob Comber, and Rob Wilson. 2016. ThoughtCloud: Exploring the Role of Feedback Technologies in Care Organisations. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 3625--3636.  ",
      "doi": "10.1145/2858036.2858105"
    },
    {
      "text": "Andy Dow, John Vines, Toby Lowe, Rob Comber, and Rob Wilson. 2017. What Happens to Digital Feedback?: Studying the Use of a Feedback Capture Platform by Care Organisations. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017), 5813--5825.  ",
      "doi": "10.1145/3025453.3025943"
    },
    {
      "text": "Maureen Duffy. 1995. Sensemaking : A Collaborative Inquiry Approach to \" Doing \" Learning. The Qualitative Report 2, 2 (1995), 1--6.",
      "doi": ""
    },
    {
      "text": "ELEN. {n. d.}. ELEN description - the language archive. Retrieved Jan 2, 2019 from https://tla.mpi.nl/tools/tla-tools/elan/elan-description/",
      "doi": ""
    },
    {
      "text": "European Parliament. 2016. Regulation 2016/679 of the European Parliament and of the council. Official Journal of the European Union 59, 119 (2016), 149. https://eur-lex.europa.eu/legal-content/EN/TXT/ PDF/?uri=OJ:L:2016:119:FULL{&}from=EN",
      "doi": ""
    },
    {
      "text": "George W. Furnas and Daniel M. Russell. 2005. Making Sense of Sensemaking. CHI '05 Extended Abstracts on Human Factors in Computing Systems (2005), 2115--2116.  ",
      "doi": "10.1145/1056808.1057113"
    },
    {
      "text": "Andrew Garbett, Rob Comber, Edward Jenkins, and Patrick Olivier. 2016. App Movement: A Platform for Community Commissioning of Mobile Applications. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 26--37.  ",
      "doi": "10.1145/2858036.2858094"
    },
    {
      "text": "Genius. {n. d.}. Genius Song Lyrics & Knowledge. Retrieved Jan 2, 2019 from https://genius.com",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E. Grinter. 2008. EatWell: Sharing Nutrition-related Memories in a Lowincome Community. Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (2008), 87--96.  ",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Amir Haj-bolouri, Lennarth Bernhardsson, and Matti Rossi. 2015. Introducing PADRE : Participatory Action Design. Pre-ICIS Workshop (2015), 1--16.",
      "doi": ""
    },
    {
      "text": "Amir Haj-Bolouri, Lennarth Bernhardsson, and Matti Rossi. 2016. PADRE: A Method for Participatory Action Design Research. Proceedings of the 11th International Conference on Tackling Society's Grand Challenges with Design Science - Volume 9661 (2016), 19--36.  ",
      "doi": "10.1007/978-3-319-39294-3_2"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the Past: How Technology Mediated Reflection Improves Well-being. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2013), 1071--1080.  ",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Jasmine Jones, David Merritt, and Mark S. Ackerman. 2017. KidKeeper: Design for Capturing Audio Mementos of Everyday Life for Parents of Young Children. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (2017), 1864--1875.  ",
      "doi": "10.1145/2998181.2998348"
    },
    {
      "text": "Yi-Chieh Lee, Wen-Chieh Lin, Fu-Yin Cherng, Hao-Chuan Wang, Ching-Ying Sung, and Jung-Tai King. 2015. Using Time-Anchored Peer Comments to Enhance Social Interaction in Online Educational Videos. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK J. Rainey et al. Proceedings of the ACM CHI'15 Conference on Human Factors in Computing Systems 1 (2015), 689--698.  ",
      "doi": "10.1145/2702123.2702349"
    },
    {
      "text": "Jennifer Manuel, Geoff Vigar, Tom Bartindale, and Rob Comber. 2017. Participatory Media: Creating Spaces for Storytelling in Neighbourhood Planning. Proceedings of the 2017 SIGCHI Conference on Human Factors in Computing Systems (2017), 1688--1701.  ",
      "doi": "10.1145/3025453.3025745"
    },
    {
      "text": "Sharoda A Paul and Madhu C Reddy. 2010. Understanding Together: Sensemaking in Collaborative Information Seeking. Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (2010), 321--330.  ",
      "doi": "10.1145/1718918.1718976"
    },
    {
      "text": "Trena Paulus and Jessica Nina Lester. 2016. ATLAS.ti for conversation and discourse analysis studies. International Journal of Social Research Methodology 19, 4 (2016), 405--428.",
      "doi": ""
    },
    {
      "text": "Trena Paulus, Megan Woods, David P. Atkins, and Rob Macklin. 2017. The discourse of QDAS: reporting practices of ATLAS.ti and NVivo users with implications for best practices. International Journal of Social Research Methodology 20, 1 (2017), 35--47.",
      "doi": ""
    },
    {
      "text": "Vincent Peters and Fred Wester. 2007. How qualitative data analysis software may support the qualitative analysis process. Quality and Quantity 41, 5 (2007), 635--659.",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli, Nicolas Villar, Vaiva Kalnikaite, Lina Dib, and Steve Whittaker. 2010. FM radio: Family Interplay with Sonic Mementos. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, New York, New York, USA, 2371.  ",
      "doi": "10.1145/1753326.1753683"
    },
    {
      "text": "Kingsley Purdam. 2014. Citizen social science and citizen data? Methodological and ethical challenges for social research. Current Sociology 62, 3 (2014), 374--392.",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Ian G. Johnson, Kyle Montague, Philip James, and Peter Wright. 2018. Making Open Data Work for Civic Advocacy. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 143 (Nov. 2018), 20 pages.  ",
      "doi": "10.1145/3274412"
    },
    {
      "text": "QSR International. {n. d.}. Home | QSR International. Retrieved Jan 2, 2019 from http://www.qsrinternational.com/",
      "doi": ""
    },
    {
      "text": "Dan Richardson, Clara Crivellaro, Ahmed Kharrufa, Kyle Montague, and Patrick Olivier. 2017. Exploring Public Places As Infrastructures for Civic M-Learning. Proceedings of the 8th International Conference on Communities and Technologies (2017), 222--231.  ",
      "doi": "10.1145/3083671.3083678"
    },
    {
      "text": "Steve Rubin, Floraine Berthouzoz, Gautham J. Mysore, Wilmot Li, and Maneesh Agrawala. 2013. Content-based Tools for Editing Audio Stories. Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (2013), 113--122.  ",
      "doi": "10.1145/2501988.2501993"
    },
    {
      "text": "Robert Sanderson, Paolo Ciccarese, and Herbert Van de Sompel. 2013. Designing the W3C open annotation data model. Proceedings of the 5th Annual ACM Web Science Conference on - WebSci '13 (2013), 366--375.  ",
      "doi": "10.1145/2464464.2464474"
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning Fans into Film Crew Guy. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (2015), 767--776.  ",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "Venkatesh Sivaraman, Dongwook Yoon, and Piotr Mitros. 2016. Simplified Audio Production in Asynchronous Voice-Based Discussions. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 1045--1054.  ",
      "doi": "10.1145/2858036.2858416"
    },
    {
      "text": "SoundCloud. {n. d.}. SoundCloud - Listen to free music and podcasts on SoundCloud. Retrieved Jan 2, 2019 from https://soundcloud.com",
      "doi": ""
    },
    {
      "text": "Alex S Taylor, Siân Lindley, Tim Regan, and David Sweeney. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15) (2015), 2863--2872.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Steve Whittaker and Brian Amento. 2004. Semantic speech editing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04) 6, 1 (2004), 527--534.  ",
      "doi": "10.1145/985692.985759"
    },
    {
      "text": "Megan Woods, Trena Paulus, David P. Atkins, and Rob Macklin. 2016. Advancing Qualitative Research Using Qualitative Data Analysis Software (QDAS)Reviewing Potential Versus Practice in Published Studies using ATLAS.ti and NVivo, 1994--2013. Social Science Computer Review 34, 5 (2016), 597--617.  ",
      "doi": "10.1177/0894439315596311"
    }
  ]
}