{
  "doi": "10.1145/3290605.3300475",
  "title": "HCI and Affective Health: Taking stock of a decade of studies and charting future research directions",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "In the last decade, the number of articles on HCI and health has increased dramatically. We extracted 139 papers on depression, anxiety and bipolar health issues from 10 years of SIGCHI conference proceedings. 72 of these were published in the last two years. A systematic analysis of this growing body of literature revealed that most innovation happens in automated diagnosis, and self-tracking, although there are innovative ideas in tangible interfaces. We noted an overemphasis on data production without consideration of how it leads to fruitful interventions. Moreover, we see a need to promote ethical practices for involvement of people living with affective disorders. Finally, although only 16 studies evaluate technologies in a clinical context, several forms of support and intervention illustrate how rich insights are gained from evaluations with real patients. Our findings highlight potential for growth in the design space of affective health technologies.",
  "tags": [
    "clinical trials",
    "literature review",
    "innovation",
    "affective disorders",
    "ethical issues"
  ],
  "authors": [
    {
      "name": "Pedro Sanches",
      "institution": "KTH Royal Institute of Technology in Stockholm, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81384620808/rel-imgonly/pedro_cropped.png",
      "acmid": "81384620808",
      "orcid": "0000-0001-5620-6305"
    },
    {
      "name": "Axel Janson",
      "institution": "KTH Royal Institute of Technology in Stockholm, Stockholm, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367277",
      "orcid": "missing"
    },
    {
      "name": "Pavel Karpashevich",
      "institution": "KTH Royal Institute of Technology in Stockholm, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-99659120383/rel-imgonly/ld0soyoo_yy.jpg",
      "acmid": "99659120383",
      "orcid": "0000-0003-0874-3338"
    },
    {
      "name": "Camille Nadal",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365871",
      "orcid": "0000-0002-0166-113X"
    },
    {
      "name": "Chengcheng Qu",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659333749",
      "orcid": "missing"
    },
    {
      "name": "Claudia Daudén Roquet",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659034731",
      "orcid": "missing"
    },
    {
      "name": "Muhammad Umair",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81438597808/rel-imgonly/sexy_smile.jpg",
      "acmid": "81438597808",
      "orcid": "missing"
    },
    {
      "name": "Charles Windlin",
      "institution": "KTH Royal Institute of Technology in Stockholm, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-99659085919/rel-imgonly/charles_windlin_square.jpg",
      "acmid": "99659085919",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    },
    {
      "name": "Kristina Höök",
      "institution": "Royal Institute of Technology KTH, Stockholm, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    },
    {
      "name": "Corina Sas",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81100639942/rel-imgonly/dsc_0976_close_up.jpg",
      "acmid": "81100639942",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ryan Aipperspach, Ben Hooker, and Allison Woodruff. 2011. Data Souvenirs: Environmental psychology and reflective design. International Journal of Human-Computer Studies 69, 5 (5 2011), 338--349.  ",
      "doi": "10.1016/j.ijhcs.2010.12.003"
    },
    {
      "text": "Renato D. Alarcon, William G.Walter-Ryan, and Patricia A. Rippetoe. 1987. Affective spectrum disorders. Comprehensive Psychiatry 28, 4 (7 1987), 292--308.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. 2013. Diagnostic and Statistical Manual of Mental Disorders. American Psychiatric Association.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked Empowerment on Facebook Groups for Parents of Children with Special Needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 2805--2814.  ",
      "doi": "10.1145/2702123.2702324"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2015. Depressionrelated Imagery on Instagram. In Proceedings of the 18th ACM Conference Companion on Computer Supported CooperativeWork & Social Computing (CSCW'15 Companion). ACM, New York, NY, USA, 231--234.  ",
      "doi": "10.1145/2685553.2699014"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1485--1500.  ",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing Cyberbullying Mitigation and Prevention Solutions through Participatory Design With Teenagers. In the 2016 CHI Conference. ACM Press, 3895--3905.  ",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L Cox, and Yunan Chen. 2017. Quantifying the Body and Caring for the Mind: Self-Tracking in Multiple Sclerosis. In the 2017 CHI Conference. ACM Press, 6889--6901.  ",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Shrey Bagroy, Ponnurangam Kumaraguru, and Munmun De Choudhury. 2017. A Social Media Based Index of Mental Well-Being in College Campuses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1634--1646.  ",
      "doi": "10.1145/3025453.3025909"
    },
    {
      "text": "Sairam Balani and Munmun De Choudhury. 2015. Detecting and Characterizing Mental Health Related Self-Disclosure in Social Media. In the 33rd Annual ACM Conference Extended Abstracts. ACM Press, 1373--1378.  ",
      "doi": "10.1145/2702613.2732733"
    },
    {
      "text": "Jakob E Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing Mobile Health Technology for Bipolar Disorder: A Field Trial of the Monarca System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2627--2636.  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Jakob E Bardram, Mads Frost, Nanna Tuxen, Maria Faurholt-Jepsen, and Lars V Kessing. 2016. Designing Context-aware Cognitive Behavioral Therapy for Unipolar and Bipolar Disorders. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 1162--1170.  ",
      "doi": "10.1145/2968219.2968303"
    },
    {
      "text": "Jakob E Bardram, Darius A Rohani, Nanna Tuxen, Maria Faurholt- Jepsen, and Lars V Kessing. 2017. Supporting Smartphone-based Behavioral Activation: A Simulation Study. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 830--843.  ",
      "doi": "10.1145/3123024.3125617"
    },
    {
      "text": "Matthew Barker and Janet Van der Linden. 2017. Sprite Catcher. In Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '17 (TEI '17). ACMPress, NewYork, New York, USA, 419--425.  ",
      "doi": "10.1145/3024969.3025068"
    },
    {
      "text": "Marguerite Barry, Kevin Doherty, Jose Marcano Belisario, Josip Car, Cecily Morrison, and Gavin Doherty. 2017. mHealth for Maternal Mental Health: Everyday Wisdom in Ethical Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2708--2756.  ",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Reid Bates. 2004. A critical analysis of evaluation practice: the Kirkpatrick model and the principle of beneficence. Evaluation and Program Planning 27, 3 (8 2004), 341--347.",
      "doi": ""
    },
    {
      "text": "AmyMBauer, Sarah Hodsdon, Suzanne Hunter, Youlim Choi, Jared Bechtel, and John C Fortney. 2017. Lessons from the Deployment of the SPIRIT App to Support Collaborative Care for Rural Patients with Complex Psychiatric Conditions. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 772--780.  ",
      "doi": "10.1145/3123024.3125610"
    },
    {
      "text": "Tom L Beauchamp and James F Childress. {n. d.}. Principles of biomedical ethics (5th ed ed.). Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Andrew B. L. Berry, Catherine Lim, Andrea L. Hartzler, Tad Hirsch, Edward H. Wagner, Evette Ludman, and James D. Ralston. 2017. How Values Shape Collaboration Between Patients with Multiple Chronic Conditions and Spousal Caregivers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 5257--5270.  ",
      "doi": "10.1145/3025453.3025923"
    },
    {
      "text": "Shalini Bhatia. 2016. Multimodal sensing of affect intensity. In Proceedings of the 18th ACM International Conference on Multimodal Interaction - ICMI 2016. ACM Press, New York, New York, USA, 567--571.  ",
      "doi": "10.1145/2993148.2997622"
    },
    {
      "text": "Shalini Bhatia, Munawar Hayat, and Roland Goecke. 2017. A Multimodal System to Characterise Melancholia: Cascaded Bag of Words Approach. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (ICMI 2017). ACM, New York, NY, USA, 274--280.  ",
      "doi": "10.1145/3136755.3136766"
    },
    {
      "text": "Nataly Birbeck, Shaun Lawson, Kellie Morrissey, Tim Rapley, and Patrick Olivier. 2017. Self Harmony: rethinking hackathons to design and critique digital technologies for those affected by self-harm. CHI '17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (2017).  ",
      "doi": "10.1145/3025453.3025931"
    },
    {
      "text": "AnnBlandford, Jo Gibbs, NikkiNewhouse, Olga Perski, Aneesha Singh, and Elizabeth Murray. 2018. Seven lessons for interdisciplinary research on interactive digital health interventions. DIGITAL HEALTH 4 (1 2018), 205520761877032.",
      "doi": ""
    },
    {
      "text": "Magnus Boman and Pedro Sanches. 2015. Sensemaking in Intelligent Health Data Analytics. KI - Künstliche Intelligenz 29, 2 (6 2015), 143--152.",
      "doi": ""
    },
    {
      "text": "Magnus Boman and Pedro Sanches. 2015. Sensemaking in Intelligent Health Data Analytics. KI - Künstliche Intelligenz 29, 2 (6 2015), 143--152.",
      "doi": ""
    },
    {
      "text": "Mehdi Boukhechba, Yu Huang, Philip Chow, Karl Fua, Bethany A Teachman, and Laura E Barnes. 2017. Monitoring Social Anxiety from Mobility and Communication Patterns. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 749--753.  ",
      "doi": "10.1145/3123024.3125607"
    },
    {
      "text": "Simon Bowen and Daniela Petrelli. 2011. Remembering today tomorrow: Exploring the human-centred design of digital mementos. International Journal of Human-Computer Studies 69, 5 (5 2011), 324--337.  ",
      "doi": "10.1016/j.ijhcs.2010.12.005"
    },
    {
      "text": "LouAnne E Boyd, Xinlong Jiang, and Gillian R Hayes. 2017. ProCom: Designing and Evaluating a Mobile andWearable System to Support Proximity Awareness for People with Autism. In the 2017 CHI Conference. ACMPress, 2865--2877.  ",
      "doi": "10.1145/3025453.3026014"
    },
    {
      "text": "Willem-Paul Brinkman, Dwi Hartanto, Ni Kang, Daniel de Vliegher, Isabel L Kampmann, Nexhmedin Morina, Paul G M Emmelkamp, and Mark Neerincx. 2012. A virtual reality dialogue system for the treatment of social phobia. In the 2012 ACMannual conference extended abstracts. ACM Press, 1099.  ",
      "doi": "10.1145/2212776.2212395"
    },
    {
      "text": "Deana Brown, Victoria Ayo, and Rebecca E Grinter. 2014. Reflection through design: immigrant women's self-reflection on managing health and wellness. In the 32nd annual ACM conference. ACM Press, 1605--1614.  ",
      "doi": "10.1145/2556288.2557119"
    },
    {
      "text": "Mark Bubel, Ruiwen Jiang, Christine H Lee, Wen Shi, and Audrey Tse. 2016. AwareMe: Addressing Fear of Public Speech Through Awareness. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 68--73.  ",
      "doi": "10.1145/2851581.2890633"
    },
    {
      "text": "Rafael Alejandro Calvo, Karthik Dinakar, Rosalind Picard, Helen Christensen, and John Torous. 2018. Toward Impactful Collaborations on Computing and Mental Health. Journal of Medical Internet Research 20, 2 (2 2018), e49.",
      "doi": ""
    },
    {
      "text": "M Campbell, R Fitzpatrick, A Haines, A L Kinmonth, P Sandercock, D Spiegelhalter, and P Tyrer. 2000. Framework for design and evaluation of complex interventions to improve health. BMJ (Clinical research ed.) 321, 7262 (9 2000), 694--6. http://www.ncbi.nlm.nih.gov/pubmed/10987780http://www. pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC1118564",
      "doi": ""
    },
    {
      "text": "Luca Canzian and Mirco Musolesi. 2015. Trajectories of Depression: Unobtrusive Monitoring of Depressive States by Means of Smartphone Mobility Traces Analysis. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 1293--1304.  ",
      "doi": "10.1145/2750858.2805845"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In the 19th ACM Conference. ACM Press, 1169--1182.  ",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan (Jerry) Lin, and Munmun De Choudhury. 2016. \"This Post Will Just Get Taken Down\": Characterizing Removed Pro-Eating Disorder Social Media Content. In the 2016 CHI Conference. ACM Press, 1157--1162.  ",
      "doi": "10.1145/2858036.2858248"
    },
    {
      "text": "Philip Chow, Wesley Bonelli, Yu Huang, Karl Fua, Bethany A Teachman, and Laura E Barnes. 2016. DEMONS: An Integrated Framework for Examining Associations Between Physiology and Self-reported Affect Tied to Depressive Symptoms. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 1139--1143.  ",
      "doi": "10.1145/2968219.2968300"
    },
    {
      "text": "Sidney Cobb. 1976. Social Support as a Moderator of Life Stress. Psychosomatic Medicine 38, 5 (9 1976), 300--314.",
      "doi": ""
    },
    {
      "text": "European Commission. 2005. Green Paper: Improving the Mental Health of the Population: Towards a Strategy on Mental Health in the European Union. (2005).",
      "doi": ""
    },
    {
      "text": "David Coyle, Gavin Doherty, Mark Matthews, and John Sharry. 2007. Computers in talk-based mental health interventions. Interacting with Computers 19, 4 (7 2007), 545--562.  ",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "David Coyle, Nicola McGlade, Gavin Doherty, and Gary O'Reilly. 2011. Exploratory Evaluations of a Computer Game Supporting Cognitive Behavioural Therapy forAdolescents. In Proceedings of the SIGCHIConference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2937--2946.  ",
      "doi": "10.1145/1978942.1979378"
    },
    {
      "text": "Lindsay-Ann Coyle and Sarah Atkinson. 2018. Vulnerability as practice in diagnosing multiple conditions. Medical Humanities (6 2018), 2017--011433.",
      "doi": ""
    },
    {
      "text": "Luis Cruz, Jonathan Rubin, Rui Abreu, Shane Ahern, Hoda Eldardiry, and Daniel G Bobrow. 2015. A Wearable and Mobile Intervention Delivery System for Individuals with Panic Disorder. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM '15). ACM, NewYork, NY, USA, 175--182.  ",
      "doi": "10.1145/2836041.2836058"
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2018. Evaluating Mindfulness Meditation Apps. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--6.  ",
      "doi": "10.1145/3170427.3188616"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Major Life Changes and Behavioral Markers in Social Media: Case of Childbirth. In Proceedings of the 2013 Conference on Computer Supported CooperativeWork (CSCW '13). ACM, New York, NY, USA, 1431--1442.  ",
      "doi": "10.1145/2441776.2441937"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Predicting Postpartum Changes in Emotion and Behavior via Social Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3267--3276.  ",
      "doi": "10.1145/2470654.2466447"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared facebook data. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14. ACM Press, New York, New York, USA, 626--638.  ",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering Shifts to Suicidal Ideation fromMental Health Content in SocialMedia. In the 2016CHIConference. ACM Press, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Munmun De Choudhury, Sanket S Sharma, Tomaz Logar, Wouter Eekhout, and René Clausen Nielsen. 2017. Gender and Cross-Cultural Differences in Social Media Disclosures of Mental Illness. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17. ACM Press, New York, New York, USA, 353--369.  ",
      "doi": "10.1145/2998181.2998220"
    },
    {
      "text": "Robert Deloatch, Brian P Bailey, Alex Kirlik, and Craig Zilles. 2017. I Need Your Encouragement!: Requesting Supportive Comments on Social Media Reduces Test Anxiety. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 736--747.  ",
      "doi": "10.1145/3025453.3025709"
    },
    {
      "text": "Orianna DeMasi and Benjamin Recht. 2017. A Step Towards Quantifying when an Algorithm Can and Cannot Predict an Individual'sWellbeing. In Proceedings of the 2017ACMInternational Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017ACMInternational Symposium onWearable Computers (UbiComp '17).ACM, New York, NY, USA, 763--771.  ",
      "doi": "10.1145/3123024.3125609"
    },
    {
      "text": "HamdiDibekliolu, ZakiaHammal,YingYang,andJeffreyFCohn.2015. Multimodal Detection of Depression in Clinical Interviews. In the 2015 ACM. ACM Press, 307--310.  ",
      "doi": "10.1145/2818346.2820776"
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with online mental health interventions: an exploratory clinical study of a treatment for depression. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2012), 1421--1430.  ",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Elizabeth V. Eikey and Madhu C. Reddy. 2017. \"It's Definitely Been a Journey\". In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, 642--654.  ",
      "doi": "10.1145/3025453.3025591"
    },
    {
      "text": "Anthony Faiola and Preethi Srinivas. 2014. Extreme Mediation: Observing Mental and Physical Health in Everyday Life. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, New York, NY, USA, 47--50.  ",
      "doi": "10.1145/2638728.2638741"
    },
    {
      "text": "Sergio Felipe, Aneesha Singh, Caroline Bradley, Amanda Williams, and Nadia Bianchi-Berthouze. 2015. Roles for Personal Informatics in Chronic Pain. In 9th International Conference on Pervasive Computing Technologies for Healthcare. ICST. ",
      "doi": "10.5555/2826165.2826189"
    },
    {
      "text": "Pin Sym Foong, Shengdong Zhao, Kelsey Carlson, and Zhe Liu. 2017. VITA: Towards Supporting Volunteer Interactions with Long-Term Care Residents with Dementia. In the 2017 CHI Conference. ACMPress, 6195--6207.  ",
      "doi": "10.1145/3025453.3025776"
    },
    {
      "text": "Christopher Frauenberger, Julia Makhaeva, and Katharina Spiel. 2016. Designing Smart Objects with Autistic Children: Four Design Exposès. In the 2016 CHI Conference. ACM Press, 130--139.  ",
      "doi": "10.1145/2858036.2858050"
    },
    {
      "text": "Mads Frost, Afsaneh Doryab, and Jakob Bardram. 2013. Disease Insights Through Analysis: Using machine learning to provide feedback in the MONARCA system. In ICTs for improving Patients Rehabilitation Research Techniques. IEEE.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252071"
    },
    {
      "text": "Mads Frost, Afsaneh Doryab, Maria Faurholt-Jepsen, Lars Vedel Kessing, and Jakob E Bardram. 2013. Supporting Disease Insight Through Data Analysis: Refinements of the Monarca Self-assessment System. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 133--142.  ",
      "doi": "10.1145/2493432.2493507"
    },
    {
      "text": "Mads Frost and Silvia Gabrielli. 2013. Supporting Situational Awareness Through a Patient Overview Screen for Bipolar Disorder Treatment. In Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '13). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 298--301.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252070"
    },
    {
      "text": "Pedro Garcia Lopez, Alberto Montresor, Dick Epema, Anwitaman Datta, Teruo Higashino, Adriana Iamnitchi, Marinho Barcellos, Pascal Felber, and Etienne Riviere. 2015. Edge-centric Computing. ACM SIGCOMM Computer Communication Review 45, 5 (9 2015), 37--42.  ",
      "doi": "10.1145/2831347.2831354"
    },
    {
      "text": "Asma Ghandeharioun and Rosalind Picard. 2017. BrightBeat: Effortlessly Influencing Breathing for Cultivating Calmness and Focus. In the 2017 CHI Conference Extended Abstracts. ACM Press, 1624--1631.  ",
      "doi": "10.1145/3027063.3053164"
    },
    {
      "text": "Sayan Ghosh, Moitreya Chatterjee, and Louis-Philippe Morency. 2014. A Multimodal Context-based Approach for Distress Assessment. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 240--246.  ",
      "doi": "10.1145/2663204.2663274"
    },
    {
      "text": "Paul Gilbert. 2012. Compassion-Focused Therapy. In Cognitive Behaviour Therapies. SAGE Publications Ltd, 1 Oliver's Yard, 55 City Road, London EC1Y 1SP United Kingdom, 140--165.",
      "doi": ""
    },
    {
      "text": "Marvin R. Goldfried. 2018. Obtaining consensus in psychotherapy: What holds us back? American Psychologist (9 2018).",
      "doi": ""
    },
    {
      "text": "James J. Gross. 2013. Handbook of emotion regulation. (2013).",
      "doi": ""
    },
    {
      "text": "James J. Gross and Ross A. Thompson. 2007. Emotion regulation: Conceptual foundations. https://philpapers.org/rec/GROERC",
      "doi": ""
    },
    {
      "text": "Agnes Gruenerbl, Gernot Bahle, Stefan Oehler, Raphaela Banzer, Chrisitan Haring, and Paul Lukowicz. 2014. Sensors vs. Human: Comparing Sensor Based State Monitoring with Questionnaire Based Self-assessment in Bipolar Disorder Patients. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC '14). ACM, New York, NY, USA, 133--134.  ",
      "doi": "10.1145/2634317.2634332"
    },
    {
      "text": "Anett Gyurak, James J. Gross, and Amit Etkin. 2011. Explicit and implicit emotion regulation: A dual-process framework. Cognition & Emotion 25, 3 (4 2011), 400--412.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Anne E Bowser, Edward F Melcer, and Elizabeth F Churchill. 2015. Online Inspiration and Exploration for Identity Reinvention. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 3809--3818.  ",
      "doi": "10.1145/2702123.2702270"
    },
    {
      "text": "Yu Hao, James Budd, Melody Moore Jackson, Mukul Sati, and Sandeep Soni. 2014. A Visual Feedback Design Based on a Braincomputer Interface to Assist Users Regulate Their Emotional State. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2491--2496.  ",
      "doi": "10.1145/2559206.2581132"
    },
    {
      "text": "Ari Hautasaari, Naomi Yamashita, and Takashi Kudo. 2017. Role of CMC in Emotional Support for Depressed Foreign Students in Japan. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM Press, New York, New York, USA, 2614--2621.  ",
      "doi": "10.1145/3027063.3053197"
    },
    {
      "text": "ChristopherMHoman, Naiji Lu, Xin Tu, Megan C Lytle, and Vincent MB Silenzio. 2014. Social Structure and Depression in TrevorSpace. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 615--625.  ",
      "doi": "10.1145/2531602.2531704"
    },
    {
      "text": "Sky Tien-Yun Huang, Akane Sano, and Chloe Mun Yee Kwan. 2014. The Moment: A Mobile Tool for People with Depression or Bipolar Disorder. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14Adjunct).ACM, NewYork,NY, USA, 235--238.  ",
      "doi": "10.1145/2638728.2638784"
    },
    {
      "text": "Yu Huang, Haoyi Xiong, Kevin Leach, Yuyan Zhang, Philip Chow, Karl Fua, Bethany A Teachman, and Laura E Barnes. 2016. Assessing social anxiety using gps trajectories and point-of-interest data. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '16 (UbiComp '16). ACM Press, New York, New York, USA, 898--903.  ",
      "doi": "10.1145/2971648.2971761"
    },
    {
      "text": "Stephan Huber, Jan Preßler, Nam Ly Tung, and Jörn Hurtienne. 2017. Evaluating Interaction-Triggered Emotions in People with Dementia. In the 2017 CHI Conference Extended Abstracts. ACM Press, 2659--2667.  ",
      "doi": "10.1145/3027063.3053251"
    },
    {
      "text": "James I. Hudson, Barbara Mangweth, Harrison G. Pope, Christine De Col, Armand Hausmann, Sarah Gutweniger, Nan M. Laird, Wilfried Biebl, and Ming T. Tsuang. 2003. Family Study of Affective Spectrum Disorder. Archives of General Psychiatry 60, 2 (2 2003), 170.",
      "doi": ""
    },
    {
      "text": "Mohammed Sazzad Hussain, Rafael A Calvo, Louise Ellis, Juchen Li, Laura Ospina-Pinillos, Tracey Davenport, and Ian Hickie. 2015. NLG-Based Moderator Response Generator to Support Mental Health. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 1385--1390.  ",
      "doi": "10.1145/2702613.2732758"
    },
    {
      "text": "Mahmoud Mohamed Hussien Ahmed, Chaklam Silpasuwanchai, Kavous Salehzadeh Niksirat, and Xiangshi Ren. 2017. Understanding the Role of Human Senses in Interactive Meditation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4960--4965.  ",
      "doi": "10.1145/3025453.3026000"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: how technology mediated reflection improves well-being. In the SIGCHI Conference.ACMPress, 1071.  ",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Vidhi Jain and Prakhar Agarwal. 2017. Symptomatic Diagnosis and Prognosis of Psychiatric Disorders through Personal Gadgets. In the 2017 CHI Conference Extended Abstracts. ACM Press, 118--123.  ",
      "doi": "10.1145/3027063.3048417"
    },
    {
      "text": "Sooyeon Jeong and Cynthia Breazeal. 2017. Toward Robotic Companions that Enhance PsychologicalWellbeing with Smartphone Technology. In Proceedings of theCompanionof the 2017ACM/IEEEInternational Conference onHuman-Robot Interaction - HRI '17.ACMPress,NewYork, New York, USA, 345--346.  ",
      "doi": "10.1145/3029798.3034803"
    },
    {
      "text": "Jyoti Joshi. 2012. Depression Analysis: A Multimodal Approach. In Proceedings of the 14th ACM International Conference on Multimodal Interaction (ICMI '12). ACM, New York, NY, USA, 321--324.  ",
      "doi": "10.1145/2388676.2388747"
    },
    {
      "text": "Hyunggu Jung, Woosuk Seo, and Michelle Cha. 2017. Personas and Scenarios to Design Technologies for North Korean Defectors with Depression. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). ACM, New York, NY, USA, 215--218.  ",
      "doi": "10.1145/3022198.3026308"
    },
    {
      "text": "Vaiva Kalnikaite and Steve Whittaker. 2011. A saunter down memory lane: Digital reflection on personal mementos. International Journal of Human-Computer Studies 69, 5 (5 2011), 298--310.  ",
      "doi": "10.1016/j.ijhcs.2010.12.004"
    },
    {
      "text": "Ni Kang, Willem-Paul Brinkman, M Birna van Riemsdijk, and Mark A Neerincx. 2011. Internet-delivered Multi-patient Virtual Reality Exposure Therapy System for the Treatment of Anxiety Disorders. In Proceedings of the 29th Annual European Conference on Cognitive Ergonomics (ECCE '11). ACM, New York, NY, USA, 233--236.  ",
      "doi": "10.1145/2074712.2074760"
    },
    {
      "text": "Jashanjit Kaur, Nehal Molasaria, Niyati Gupta, Shengjie Zhang, and WeiWang. 2015. Sleepstellar: A Safety Kit and Digital Storyteller for Sleepwalkers. In the 33rd Annual ACM Conference Extended Abstracts. ACM Press, 31--36.  ",
      "doi": "10.1145/2702613.2726955"
    },
    {
      "text": "Nao Kawanishi, Morihiko Tamai, Akio Hasegawa, Yoshio Takeuchi, Aran Tajika, Yusuke Ogawa, and Toshiaki Furukawa. 2015. Lifelogbased Estimation of Activity Diary for Cognitive Behavioral Therapy. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 1251--1256.  ",
      "doi": "10.1145/2800835.2807939"
    },
    {
      "text": "ChristinaKelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for MentalWellness: Understanding Expert Perspectives and Student Experiences. In the 2017 CHI Conference. ACM Press, 629--641.  ",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "George (Poonkhin) Khut. 2016. Designing Biofeedback Artworks for Relaxation. In the 2016 CHI Conference Extended Abstracts. ACM Press, 3859--3862.  ",
      "doi": "10.1145/2851581.2891089"
    },
    {
      "text": "James N. Kirby. 2017. Compassion interventions: The programmes, the evidence, and implications for research and practice. Psychology and Psychotherapy: Theory, Research and Practice 90, 3 (9 2017), 432--455.",
      "doi": ""
    },
    {
      "text": "Artie Konrad, Victoria Bellotti, Nicole Crenshaw, Simon Tucker, Les Nelson, Honglu Du, Peter Pirolli, and Steve Whittaker. 2015. Finding the Adaptive Sweet Spot: Balancing Compliance and Achievement in Automated Stress Reduction. In the 33rd Annual ACM Conference. ACM Press, 3829--3838.  ",
      "doi": "10.1145/2702123.2702512"
    },
    {
      "text": "Sitwat Langrial, Harri Oinas-Kukkonen, Päivi Lappalainen, and Raimo Lappalainen. 2013. Rehearsing to Control Depressive Symptoms Through a Behavior Change Support System. In CHI '13 Extended Abstracts onHumanFactors in Computing Systems (CHIEA'13).ACM,New York, NY, USA, 385--390.  ",
      "doi": "10.1145/2468356.2468425"
    },
    {
      "text": "Dana J. Lawrence. 2007. The Four Principles of Biomedical Ethics: A Foundation for Current Bioethical Debate. Journal of Chiropractic Humanities 14 (1 2007), 34--40.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. ACritical Lens on Dementia and Design in HCI. In the 2017 CHI Conference. ACM Press, 2175--2188.  ",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Chia-Hsun Jackie Lee, Kyunghee Kim, Cynthia Breazeal, and Rosalind Picard. 2008. Shybot: Friend-stranger Interaction for Children Living with Autism. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 3375--3380.  ",
      "doi": "10.1145/1358628.1358860"
    },
    {
      "text": "Hee Rin Lee, Selma abanovic, Wan-Ling Chang, Shinichi Nagata, Jennifer Piatt, Casey Bennett, and David Hakken. 2017. Steps Toward Participatory Design of Social Robots: Mutual Learning with Older Adults with Depression. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 244--253.  ",
      "doi": "10.1145/2909824.3020237"
    },
    {
      "text": "Jongin Lee, Daeki Cho, Junhong Kim, Eunji Im, JinYeong Bak, Kyung ho Lee, Kwan Hong Lee, and John Kim. 2017. Itchtector: A Wearable-based Mobile System for Managing Itching Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 893--905.  ",
      "doi": "10.1145/3025453.3025569"
    },
    {
      "text": "Guo Li, Xiaomu Zhou, Tun Lu, Jiang Yang, and Ning Gu. 2016. Sun- Forum: Understanding Depression in a Chinese Online Community. In Proceedings of the 19th ACM Conference on Computer-Supported CooperativeWork & Social Computing (CSCW '16). ACM, New York, NY, USA, 515--526.  ",
      "doi": "10.1145/2818048.2819994"
    },
    {
      "text": "Jinhui Li. 2014. Examining the Impact of Game Interventions on Depression Among Older Adults. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 291--294.  ",
      "doi": "10.1145/2658537.2659009"
    },
    {
      "text": "Siân E Lindley, Maxine Glancy, Richard Harper, Dave Randall, and Nicola Smyth. 2011. \"Oh and how things just don't change, the more things stay the same\": Reflections on SenseCam images 18 months after capture. International Journal of Human-Computer Studies 69, 5 (5 2011), 311--323.  ",
      "doi": "10.1016/j.ijhcs.2010.12.010"
    },
    {
      "text": "Adam Lobel, Marientina Gotsis, Erin Reynolds, Michael Annetta, RutgerCME Engels, and Isabela Granic. 2016. Designing and Utilizing Biofeedback Games for Emotion Regulation: The Case of Nevermind. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1945--1951.  ",
      "doi": "10.1145/2851581.2892521"
    },
    {
      "text": "Lydia Manikonda and Munmun De Choudhury. 2017. Modeling and Understanding Visual Attributes of Mental Health Disclosures in Social Media. In the 2017 CHI Conference. ACM Press, 170--181.  ",
      "doi": "10.1145/3025453.3025932"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, and Akane Sano. 2016. Neurotics Can't Focus: An ",
      "doi": "10.1145/2858036.2858202"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email Duration, Batching and Self-interruption: Patterns of Email Use on Productivity and Stress. In the 2016 CHI Conference. ACM Press, 1717--1728.  ",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Mark Matthews and Gavin Doherty. 2011. In the mood: Engaging teenagers in psychotherapy using mobile phones. Chi 2011 (2011), 2947--2956.  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Mark Matthews, Geri Gay, and Gavin Doherty. 2014. Taking part: roleplay in the design of therapeutic systems. In the 32nd annual ACM conference. ACMPress, 643--652.  ",
      "doi": "10.1145/2556288.2557103"
    },
    {
      "text": "Mark Matthews, Jaime Snyder, Lindsay Reynolds, Jacqueline T Chien, Adam Shih, Jonathan W Lee, and Geri Gay. 2015. Real- Time Representation Versus Response Elicitation in Biosensor Data. In the 33rd Annual ACM Conference. ACM Press, 605--608.  ",
      "doi": "10.1145/2702123.2702485"
    },
    {
      "text": "Mark Matthews, Stephen Voida, Saeed Abdullah, Gavin Doherty, Tanzeem Choudhury, Sangha Im, and Geri Gay. 2015. In Situ Design for Mental Illness: Considering the Pathology of Bipolar Disorder in mHealth Design. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 86--97.  ",
      "doi": "10.1145/2785830.2785866"
    },
    {
      "text": "Oscar Mayora, Bert Arnrich, Jakob Bardram, Carsten Dräger, Andrea Finke, Mads Frost, Silvia Giordano, Franz Gravenhorst, Agnes Grunerbl, Christian Haring, Reinhold Haux, Paul Lukowicz, Amir Muaremi, Steven Mudda, Stefan Ohler, Alessandro Puiatti, Nina Reichwaldt, Corinna Scharnweber, Gerhard Troester, Lars Vedel Kessing, and Gabriel Wurzer. 2013. Personal Health Systems for Bipolar Disorder: Anecdotes, Challenges and Lessons Learnt from MONARCA Project. In Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '13). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 424--429.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252123"
    },
    {
      "text": "Andrew R McNeill, Lynne Coventry, Jake Pywell, and Pam Briggs. 2017. Privacy Considerations when Designing Social Network Systems to Support Successful Ageing. In the 2017 CHI Conference. ACM Press, 6425--6437.  ",
      "doi": "10.1145/3025453.3025861"
    },
    {
      "text": "Pardis Miri, Robert Flory, Andero Uusberg, Helen Uusberg, James J Gross, and Katherine Isbister. 2017. HapLand: A Scalable Robust Emotion Regulation Haptic System Testbed. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1916--1923.  ",
      "doi": "10.1145/3027063.3053147"
    },
    {
      "text": "Marziya Mohammedali, Dinh Phung, Brett Adams, and Svetha Venkatesh. 2011. A Context-sensitive Device to Help People with Autism Cope with Anxiety. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 1201--1206.  ",
      "doi": "10.1145/1979742.1979748"
    },
    {
      "text": "David C Mohr, Enid Montague, Colleen Stiles-Shields, Susan M Kaiser, Christopher Brenner, Eric Carty-Fickes, Hannah Palac, and Jenna Duffecy. 2015. MedLink: A Mobile Intervention to Address Failure Points in the Treatment of Depression in General Medicine. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '15). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 100--107. http://dl.acm.org/citation.cfm?id=2826165.2826180 ",
      "doi": "10.5555/2826165.2826180"
    },
    {
      "text": "Wendy Moncur. 2013. The emotional wellbeing of researchers: considerations for practice. In the SIGCHI Conference. ACM Press, 1883.  ",
      "doi": "10.1145/2470654.2466248"
    },
    {
      "text": "Elizabeth L Murnane, Mark Matthews, and Geri Gay. 2016. Opportunities for Technology in the Self-management of Mental Health. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, New York, NY, USA, 1093--1096.  ",
      "doi": "10.1145/2957265.2965008"
    },
    {
      "text": "E. H. Nasser and J. C. Overholser. 2005. Recovery from major depression: the role of support from family, friends, and spiritual beliefs. Acta Psychiatrica Scandinavica 111, 2 (2 2005), 125--132.",
      "doi": ""
    },
    {
      "text": "JosephWNewbold, Nadia Bianchi-Berthouze, Nicolas E Gold, Ana Tajadura-Jiménez, and Amanda CdC Williams. 2016. Musically Informed Sonification for Chronic Pain Rehabilitation: Facilitating Progress & Avoiding Over-Doing. In the 2016 CHI Conference. ACM Press, 5698--5703.  ",
      "doi": "10.1145/2858036.2858302"
    },
    {
      "text": "Lasse Benn Nørregaard, Philip Kaare Løventoft, Erik Frøkjær, Lise Lauritsen, Emilia Clara Olsson, Louise Andersen, Stine Rauff, and Klaus Martiny. 2014. Patient Expectations and Experiences from a Clinical Study in Psychiatric Care Using a Self-monitoring System. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 991--994.  ",
      "doi": "10.1145/2639189.2670258"
    },
    {
      "text": "Thomas E. Oxman, Allen J. Dietrich, John W. Williams, and Kurt Kroenke. 2002. AThree-ComponentModel for Reengineering Systems for the Treatment of Depression in Primary Care. Psychosomatics 43, 6 (11 2002), 441--450.",
      "doi": ""
    },
    {
      "text": "Sungkyu Park, Inyeop Kim, Sang Won Lee, Jaehyun Yoo, Bumseok Jeong, and Meeyoung Cha. 2015. Manifestation of Depression and Loneliness on Social Networks: A Case Study of Young Adults on Facebook. In Proceedings of the 18thACMConference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 557--570.  ",
      "doi": "10.1145/2675133.2675139"
    },
    {
      "text": "Jessica Pater and Elizabeth Mynatt. 2017. Defining Digital Self-Harm. In the 2017 ACM Conference. ACM Press, 1501--1513.  ",
      "doi": "10.1145/2998181.2998224"
    },
    {
      "text": "Jessica A Pater, Oliver L Haimson, Nazanin Andalibi, and Elizabeth D Mynatt. 2016. \"Hunger Hurts but StarvingWorks:\" Characterizing the Presentation of Eating Disorders Online. In the 19th ACM Conference. ACM Press, 1183--1198.  ",
      "doi": "10.1145/2818048.2820030"
    },
    {
      "text": "Hong Peng, Dennis Majoe, and Thomas Kaegi-Trachsel. 2011. Design and Application of a NovelWearable EEG System for e-Healthcare. In Proceedings of 2011 InternationalWorkshop on Ubiquitous Affective Awareness and Intelligent Interaction (UAAII '11). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/2030092.2030094"
    },
    {
      "text": "Giulia Perugia, Marta D\\'\\iaz Boladeras, Emilia Barakova, Andreu Català Mallofré, and Matthias Rauterberg. 2017. Social HRI for People with Dementia: One Size Fits All?. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 257--258.  ",
      "doi": "10.1145/3029798.3038353"
    },
    {
      "text": "Abhishek Pratap, Joaquin A Anguera, Brenna N Renn, Elias Chaibub Neto, Joshua Volponi, Sean D Mooney, and Pat A Areán. 2017. The Feasibility of Using Smartphones to Assess and Remediate Depression in Hispanic/Latino Individuals Nationally. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 854--860.  ",
      "doi": "10.1145/3123024.3127877"
    },
    {
      "text": "James O. Prochaska andWayne F. Velicer. 1997. The Transtheoretical Model of Health Behavior Change. American Journal of Health Promotion 12, 1 (9 1997), 38--48.",
      "doi": ""
    },
    {
      "text": "Chengcheng Qu, Gavin Doherty, and Corina Sas. 2019. Exploring and Designing for Memory Impairments in Depression. In ACM CHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/3290605.3300740"
    },
    {
      "text": "Kara Rennert and Evangelos Karapanos. 2013. Faceit: Supporting Reflection Upon Social Anxiety Events with Lifelogging. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 457--462.  ",
      "doi": "10.1145/2468356.2468437"
    },
    {
      "text": "Stefan Rennick-Egglestone, Sarah Knowles, Gill Toms, Penny Bee, Karina Lovell, and Peter Bower. 2016. Health Technologies 'In the Wild': Experiences of Engagement with Computerised CBT. In the 2016 CHI Conference. ACM Press, 2124--2135.  ",
      "doi": "10.1145/2858036.2858128"
    },
    {
      "text": "Kathryn E Ringland, Christine T Wolf, Heather Faucett, Lynn Dombrowski, and Gillian R Hayes. 2016. \"Will I always be not social?\": Re-Conceptualizing Sociality in the Context of a Minecraft Community for Autism. In the 2016 CHI Conference. ACM Press, 1256--1269.  ",
      "doi": "10.1145/2858036.2858038"
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness. In the 2017 CHI Conference. ACM Press, 1459--1470.  ",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "Jonathan Rubin, Hoda Eldardiry, Rui Abreu, Shane Ahern, Honglu Du, Ashish Pattekar, and Daniel G Bobrow. 2015. Towards a mobile and wearable system for predicting panic attacks. In the 2015 ACM International Joint Conference. ACM Press, 529--533.  ",
      "doi": "10.1145/2750858.2805834"
    },
    {
      "text": "Marzena Rusanowska. 2014. Attentional Retraining in Depressive Disorders. In Proceedings of the Symposium on Eye Tracking Research and Applications (ETRA '14). ACM, New York, NY, USA, 381--382.  ",
      "doi": "10.1145/2578153.2583040"
    },
    {
      "text": "Sohrab Saeb, Mi Zhang, Mary Kwasny, Christopher J Karr, Konrad Kording, and David C Mohr. 2015. The Relationship Between Clinical, Momentary, and Sensor-based Assessment of Depression. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '15). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 229--232. http://dl.acm.org/citation.cfm?id=2826165.2826201 ",
      "doi": "10.5555/2826165.2826201"
    },
    {
      "text": "Kavous Salehzadeh Niksirat, Chaklam Silpasuwanchai, Mahmoud Mohamed Hussien Ahmed, Peng Cheng, and Xiangshi Ren. 2017. A Framework for Interactive Mindfulness Meditation Using Attention- Regulation Process. In the 2017 CHI Conference. ACMPress, 2672--2684.  ",
      "doi": "10.1145/3025453.3025914"
    },
    {
      "text": "Corina Sas and Rohit Chopra. 2015. MeditAid: a wearable adaptive neurofeedback-based system for training mindfulness state. Personal and Ubiquitous Computing 19, 7 (10 2015), 1169--1182.  ",
      "doi": "10.1007/s00779-015-0870-z"
    },
    {
      "text": "Corina Sas and Alan Dix. 2011. Designing for reflection on personal experience. International Journal of Human-Computer Studies 69, 5 (5 2011), 281--282.  ",
      "doi": "10.1016/j.ijhcs.2011.02.006"
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 1971--1980.  ",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Stefan Scherer, Zakia Hammal, Ying Yang, Louis-Philippe Morency, and Jeffrey F Cohn. 2014. Dyadic Behavior Analysis in Depression Severity Assessment Interviews. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 112--119.  ",
      "doi": "10.1145/2663204.2663238"
    },
    {
      "text": "Stefan Scherer, Giota Stratou, and Louis-Philippe Morency. 2013. Audiovisual Behavior Descriptors for Depression Assessment. In Proceedings of the 15th ACM on International Conference on Multimodal Interaction (ICMI '13). ACM, New York, NY, USA, 135--140.  ",
      "doi": "10.1145/2522848.2522886"
    },
    {
      "text": "Poppy L. A. Schoenberg and Anthony S. David. 2014. Biofeedback for Psychiatric Disorders: A Systematic Review. Applied Psychophysiology and Biofeedback 39, 2 (6 2014), 109--135.",
      "doi": ""
    },
    {
      "text": "Stephen M Schueller and David C Mohr. 2015. Initial Field Trial of a Coach-supported Web-based Depression Treatment. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '15). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 25--28. http://dl.acm.org/citation.cfm?id=2826165.2826169 ",
      "doi": "10.5555/2826165.2826169"
    },
    {
      "text": "A Fleming Seay and Robert E Kraut. 2007. Project Massive: Self-regulation and Problematic Use of Online Gaming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 829--838.  ",
      "doi": "10.1145/1240624.1240749"
    },
    {
      "text": "Jinsil Hwaryoung Seo, Annie Sungkajun, and Jinkyo Suh. 2015. Touchology: Towards Interactive Plant Design for Children with Autism and Older Adults in Senior Housing. In the 33rd Annual ACM Conference Extended Abstracts. ACM Press, 893--898.  ",
      "doi": "10.1145/2702613.2732883"
    },
    {
      "text": "Eunbi Seol, Chul-Hyun Cho, Seungmoon Choi, Dooyoung Jung, Seulki Min, Sungho Seo, Seoyeon Jung, Youngil Lee, Jaedong Lee, Gerard Kim, Chungyean Cho, and Seungmoo Lee. 2017. \"Drop the beat\": virtual reality based mindfulness and cognitive behavioral therapy for panic disorder-a pilot study. In the 23rd ACMSymposium. ACM Press, 1--3.  ",
      "doi": "10.1145/3139131.3141199"
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Gradinar, Marcia Tavares Smith, Stephen Forshaw, Ian Smith, and Jon Whittle. 2016. Anxiety and Autism: Towards Personalized Digital Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1270--1281.  ",
      "doi": "10.1145/2858036.2858259"
    },
    {
      "text": "Elizabeth Stowell, Mercedes C. Lyson, Herman Saksono, Reneé C. Wurth, Holly Jimison, Misha Pavel, and Andrea G. Parker. 2018. Designing and Evaluating mHealth Interventions for Vulnerable Populations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--17.  ",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "David Sun, Pablo Paredes, and John Canny. 2014. MouStress: detecting stress from mouse motion. In the 32nd annual ACM conference. ACM Press, 61--70.  ",
      "doi": "10.1145/2556288.2557243"
    },
    {
      "text": "Fredrik Svenaeus. 2014. Empathy as a necessary condition of phronesis: a line of thought for medical ethics. Medicine, Health Care and Philosophy 17, 2 (5 2014), 293--299.",
      "doi": ""
    },
    {
      "text": "Fredrik Svenaeus. 2014. Empathy as a necessary condition of phronesis: a line of thought for medical ethics. Medicine, Health Care and Philosophy 17, 2 (5 2014), 293--299.",
      "doi": ""
    },
    {
      "text": "Anja Thieme, John McCarthy, Paula Johnson, Stephanie Phillips, Jayne Wallace, Siân Lindley, Karim Ladha, Daniel Jackson, Diana Nowacka, Ashur Rafiev, Cassim Ladha, Thomas Nappey, Mathew Kipling, Peter Wright, Thomas D Meyer, and Patrick Olivier. 2016. Challenges for Designing New Technology for Health andWellbeing in a Complex Mental Healthcare Context. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2136--2149.  ",
      "doi": "10.1145/2858036.2858182"
    },
    {
      "text": "Anja Thieme, Jayne Wallace, Paula Johnson, John McCarthy, Siân Lindley, PeterWright, Patrick Olivier, and Thomas D Meyer. 2013. Design to Promote Mindfulness Practice and Sense of Self for Vulnerable Women in Secure Hospital Services. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2647--2656.  ",
      "doi": "10.1145/2470654.2481366"
    },
    {
      "text": "Anja Thieme, Jayne Wallace, James Thomas, Ko Le Chen, Nicole Krämer, and Patrick Olivier. 2011. Lovers' box: Designing for reflection within romantic relationships. International Journal of Human-Computer Studies 69, 5 (5 2011), 283--297.  ",
      "doi": "10.1016/j.ijhcs.2010.12.006"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. \"Counting on the Group\": Reconciling Online and Offline Social Support among Older Informal Caregivers. In the 2016 CHI Conference. ACM Press, 3545--3558.  ",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Phil Topham, Praminda Caleb-Solly, Paul Matthews, Andy Farmer, and Chris Mash. 2015. Mental Health App Design: A Journey From Concept to Completion. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '15). ACM, New York, NY, USA, 582--591.  ",
      "doi": "10.1145/2786567.2787136"
    },
    {
      "text": "John Torous and Justin T. Baker. 2016. Why Psychiatry Needs Data Science and Data Science Needs Psychiatry. JAMA Psychiatry 73, 1 (1 2016), 3.",
      "doi": ""
    },
    {
      "text": "Emanuele Torri, Oscar Mayora, Jesus Cobo, and Diego Palao. 2015. Requirements Identification Towards a Design of Adaptive ICTs for Supporting Bipolar Disorder Treatment in Different Healthcare Contexts. In 9th International Conference on Pervasive Computing Technologies for Healthcare. ICST. ",
      "doi": "10.5555/2826165.2826217"
    },
    {
      "text": "Vincent W S Tseng, Michael Merrill, Franziska Wittleder, Saeed Abdullah, Min Hane Aung, and Tanzeem Choudhury. 2016. Assessing Mental Health Issues on College Campuses: Preliminary Findings from a Pilot Study. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 1200--1208.  ",
      "doi": "10.1145/2968219.2968308"
    },
    {
      "text": "Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing Depression from Twitter Activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3187--3196.  ",
      "doi": "10.1145/2702123.2702280"
    },
    {
      "text": "Anouk Tuijnman, Isabela Granic, Josh Whitkin, and Rutger C M E Engels. 2017. Developing and Testing ScrollQuest: A Video Game Targeting Rejection Sensitivity in Adolescents. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17 Extended Abstracts). ACM, New York, NY, USA, 213--221.  ",
      "doi": "10.1145/3130859.3131302"
    },
    {
      "text": "Anupriya Tuli, Pushpendra Singh, Mamta Sood, Koushik Sinha Deb, Siddharth Jain, Abhishek Jain, MananWason, Rakesh Chadda, and Rohit Verma. 2016. Harmony: Close Knitted Mhealth Assistance for Patients, Caregivers and Doctors for Managing SMIs. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 1144--1152.  ",
      "doi": "10.1145/2968219.2968301"
    },
    {
      "text": "Daniel Ullrich, Sarah Diefenbach, and Andreas Butz. 2016. Murphy Miserable Robot: A Companion to Support Children's Well-being in Emotionally Difficult Situations. In the 2016 CHI Conference Extended Abstracts. ACM Press, 3234--3240.  ",
      "doi": "10.1145/2851581.2892409"
    },
    {
      "text": "Muhammad Umair, Muhammad Hamza Latif, and Corina Sas. 2018. Dynamic Displays atWrist for Real Time Visualization of Affective Data. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - DIS '18. ACM Press, New York, New York, USA, 201--205.  ",
      "doi": "10.1145/3197391.3205436"
    },
    {
      "text": "Marieke van Rooij, Adam Lobel, Owen Harris, Niki Smit, and Isabela Granic. 2016. DEEP: A Biofeedback Virtual Reality Game for Children At-risk for Anxiety. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1989--1997.  ",
      "doi": "10.1145/2851581.2892452"
    },
    {
      "text": "Cati Vaucelle, Leonardo Bonanni, and Hiroshi Ishii. 2009. Design of Haptic Interfaces for Therapy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 467--470.  ",
      "doi": "10.1145/1518701.1518776"
    },
    {
      "text": "Marjan Verstappen, Paula Gardner, Dora Poon, and Tim Bettridge. 2014. Off the Couch and out of the Hospital, Mobile Applications for Acceptance and Commitment Therapy. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 431--434.  ",
      "doi": "10.1145/2628363.2633573"
    },
    {
      "text": "Jay Vidyarthi and Bernhard E Riecke. 2013. Mediated meditation: cultivating mindfulness with sonic cradle. In CHI '13 Extended Abstracts on Human Factors in Computing Systems. ACM Press, 2305.  ",
      "doi": "10.1145/2468356.2468753"
    },
    {
      "text": "TorbenWallbaum, Janko Timmermann, Wilko Heuten, and Susanne Boll. 2015. Forget Me Not: Connecting Palliative Patients and Their Loved Ones. In the 33rd Annual ACM Conference Extended Abstracts. ACM Press, 1403--1408.  ",
      "doi": "10.1145/2702613.2732772"
    },
    {
      "text": "XiWang, Xi Zhao, Omprakash Gnawali, Katherine A Loveland, Varun Prakash, and Weidong Shi. 2013. A Real-time Selective Speaker Cancellation System for Relieving Social Anxiety in Autistics. In Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '13). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 420--423.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252156"
    },
    {
      "text": "Rina RWehbe, Diane KWatson, Gustavo F Tondello, Marim Ganaba, Melissa Stocco, Alvin Lee, and Lennart E Nacke. 2016. ABOVE WATER: An Educational Game for Anxiety. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (CHI PLAY Companion '16). ACM, New York, NY, USA, 79--84.  ",
      "doi": "10.1145/2968120.2971804"
    },
    {
      "text": "Rina RWehbe, Diane KWatson, Gustavo F Tondello, and Lennart E Nacke. 2016. ABOVEWATER: Extending the Play Space for Health. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 497--499.  ",
      "doi": "10.1145/2992154.2996882"
    },
    {
      "text": "Anna Weisling. 2016. The Rest is Construction: An Interactive Installation Evoking Somatic and Cognitive Effects of Anxiety. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3893--3896.  ",
      "doi": "10.1145/2851581.2891084"
    },
    {
      "text": "Maria K Wolters, Zawadhafsa Mkulo, and Petra M Boynton. 2017. The Emotional Work of Doing eHealth Research. In the 2017 CHI Conference Extended Abstracts. ACM Press, 816--826.  ",
      "doi": "10.1145/3027063.3052764"
    },
    {
      "text": "Maria K Wolters, Aurora Szentágotai Tâtar, Silviu Matu, Ramona Moldovan, Daniel David, Brian H McKinstry, and Christopher D Burton. 2014. eHealth Support for People with Depression in the Community: A Case Study Series. In Proceedings of HCI Korea (HCIK '15). Hanbit Media, Inc., South Korea, 138--144. http://dl.acm.org/citation.cfm?id=2729485.2729507 ",
      "doi": "10.5555/2729485.2729507"
    },
    {
      "text": "Chieh-Lin Wu, Bing-Hsun Wu, Yun-Ting Lin, Pengfei Wang, and Yining Zhou. 2016. Moments A Wearable Device for Early Stage AD Patients to Maintain Their Autonomy. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 74--79.  ",
      "doi": "10.1145/2851581.2890632"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. In Proceedings of the SIGCHI Conference onHumanFactors in Computing Systems - CHI '13.ACMPress,New York, New York, USA, 2637.  ",
      "doi": "10.1145/2470654.2481365"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 158--169.  ",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "Chuang-Wen You, Ya-Fang Lin, Cheng-Yuan Li, Yu-Lun Tsai, Ming-Chyi Huang, Chao-Hui Lee, Hao-ChuanWang, and Hao-Hua Chu. 2016. KeDiary: Using Mobile Phones to Assist Patients in Recovering from Drug Addiction. In the 2016 CHI Conference. ACM Press, 5704--5709.  ",
      "doi": "10.1145/2858036.2858185"
    },
    {
      "text": "Bin Zhu, Anders Hedman, and Haibo Li. 2017. Designing Digital Mindfulness: Presence-In and Presence-With versus Presence- Through. In the 2017 CHI Conference. ACM Press, 2685--2695.  ",
      "doi": "10.1145/3025453.3025590"
    },
    {
      "text": "Haining Zhu, Yuhan Luo, and Eun Kyoung Choe. 2017. Making Space for the Quality Care: Opportunities for Technology in Cognitive Behavioral Therapy for Insomnia. In the 2017 CHI Conference. ACM Press, 5773--5786.  ",
      "doi": "10.1145/3025453.3025549"
    }
  ]
}