{
  "doi": "10.1145/3290605.3300348",
  "title": "More than the Sum of Makers: The Complex Dynamics of Diverse Practices at Maker Faire",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Human Computer Interaction has developed great interest in the Maker Movement. Previous work has explored it from various perspectives, focusing either on its potentials or issues. As these are however only fragmented portrayals, this paper aims to take a broader perspective and interconnect some of the fragments. We conducted a qualitative study in the context of two Maker Faires to gain a better understanding of the complex dynamics that makers operate in. We captured the voices of different stakeholders and explored how their respective agendas relate to each other. The findings illustrate how the event is co-created at the nexus of different technological, social and economic interests while leaving space for diverse practices. The paper contributes a first focused analysis of Maker Faire, probes it as a site for research and discusses how holistic perspectives on the Maker Movement could create new research opportunities.",
  "authors": [
    {
      "name": "Janis Lena Meissner",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163422",
      "orcid": "missing"
    },
    {
      "name": "Pradthana Jarusriboonchai",
      "institution": "University of Lapland, Rovaniemi, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87059351157",
      "orcid": "missing"
    },
    {
      "name": "Janice McLaughlin",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021772",
      "orcid": "missing"
    },
    {
      "name": "Peter Wright",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Binaebi Akah and Shaowen Bardzell. 2010. Empowering products. In Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA '10. ACM Press, New York, New York, USA, 4021.  ",
      "doi": "10.1145/1753846.1754096"
    },
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making cultures. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14. ACM Press, New York, New York, USA, 1087--1092.  ",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Morgan G Ames, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Lilly Nguyen, Syed Ishtiaque, Nusrat Jahan, Steven J Jackson, Paul Dourish, By Morgan G Ames, Silvia Lindtner, Jeffrey Bardzell, Lilly Nguyen, Syed Ishtiaque Ahmed, Steven J Jackson, and Paul Dourish. 2018. Making or Making Do Challenging the Mythologies of Making and Hacking. Journal of Peer Production 12 (2018), 1--21.",
      "doi": ""
    },
    {
      "text": "Chris Anderson. 2012. Makers: The New Industrial Revolution. The Random House Group Limited, London. 257 pages.",
      "doi": ""
    },
    {
      "text": "Jonathan Bean and Daniela Rosner. 2014. Making: Movement or Brand? interactions 21, 1 (jan 2014), 26--27.  ",
      "doi": "10.1145/2541669"
    },
    {
      "text": "Paulo Blikstein and Dennis Krannich. 2013. The makers' movement and FabLabs in education. In Proceedings of the 12th International Conference on Interaction Design and Children - IDC '13. ACM Press, New York, New York, USA, 613.  ",
      "doi": "10.1145/2485760.2485884"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (jan 2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Debbie Cachra. 2015. Why I Am Not a Maker - The Atlantic. https://www.theatlantic.com/technology/archive/2015/01/ why-i-am-not-a-maker/384767/",
      "doi": ""
    },
    {
      "text": "Andrew Coy. {n. d.}. Making the Maker Movement | whitehouse. gov. https://obamawhitehouse.archives.gov/blog/2016/07/14/ making-maker-movement",
      "doi": ""
    },
    {
      "text": "David Cuartielles, Jonathan Bean, and Daniela Rosner. 2015. Conversations on making. interactions 22, 1 (jan 2015), 22--24.  ",
      "doi": "10.1145/2685366"
    },
    {
      "text": "Carla Diana. 2008. How I learned to stop worrying and love the hackers. interactions 15, 2 (mar 2008), 46.  ",
      "doi": "10.1145/1340961.1340973"
    },
    {
      "text": "James Fallows. 2016. Why the Maker Movement Matters: Part 1, the Tools Revolution - The Atlantic. https://www.theatlantic.com/business/archive/2016/06/ why-the-maker-movement-matters-part-1-the-tools-revolution/ 485720/",
      "doi": ""
    },
    {
      "text": "Deborah A. Fields, Alecia Marie Magnifico, Jayne C. Lammers, and Jen Scott Curwood. 2014. DIY Media Creation. Journal of Adolescent & Adult Literacy 58, 1 (2014), 19--24.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15. ACM Press, New York, New York, USA, 56--68.  ",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Manfred Tscheligi, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Andreas Reiter, and Pernille Bjorn. 2016. Fabrication & HCI: Hobbyist Making, Industrial Production, and Beyond. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 3550--3557.  ",
      "doi": "10.1145/2851581.2856491"
    },
    {
      "text": "David Gauntlett. 2005. Using Creative Visual Research Methods to Understand Media Audiences. Medienpädagogik 4, 1, special issue on visual methods in research (2005), 1--32. http://westminsterresearch. wmin.ac.uk/3387/",
      "doi": ""
    },
    {
      "text": "David Gauntlett. 2013. Making is connecting (1. auflage ed.). Polity Press, Cambridge. 232 pages.",
      "doi": ""
    },
    {
      "text": "David Gauntlett and Peter Holzwarth. 2006. Creative and visual methods for exploring identities. Visual Studies 21, 1 (2006), 82--91.",
      "doi": ""
    },
    {
      "text": "Neil Gershenfeld. 2012. How to Make Almost Anything: The Digital Fabrication Revolution. Foreign Affairs 91, 6 (2012), 43--57. http: //www.jstor.org/stable/41720933",
      "doi": ""
    },
    {
      "text": "David Green and David Kirk. 2018. Open Design, Inclusivity and the Intersections of Making. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18. ACM Press, New York, New York, USA, 173--186.  ",
      "doi": "10.1145/3196709.3196718"
    },
    {
      "text": "Nathan Holbert. 2016. Bots for Tots: Building Inclusive Makerspaces by Leveraging \"Ways of Knowing\". In Proceedings of the The 15th International Conference on Interaction Design and Children - IDC '16. ACM Press, New York, New York, USA, 79--88.  ",
      "doi": "10.1145/2930674.2930718"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with doit- yourself assistive technology. In Proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility ASSETS 11. 11--18.  ",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the expert amateur. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction Extending Boundaries - NordiCHI '10. ACM Press, New York, New York, USA, 295.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "David Langley. 2017. How disruptive is the Maker Movement? http: //make-it.io/2017/10/27/how-disruptive-is-the-maker-movement/",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge, London. 138 pages.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the Utopian Vision of Making. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 1390--1402.  ",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Silvia Lindtner, Garnet D Hertz, and Paul Dourish. 2014. Emerging sites of HCI innovation. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 439--448.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Make Media. {n. d.}. Guideline - Maker Faire. https://makerfaire.com/ global/guidelines/",
      "doi": ""
    },
    {
      "text": "Make Media. {n. d.}. Make Magazine. https://makezine.com/",
      "doi": ""
    },
    {
      "text": "Make Media. {n. d.}. Make Media. https://makermedia.com/",
      "doi": ""
    },
    {
      "text": "Make Media. {n. d.}. Maker Market Study - Maker Faire. http: //makerfaire.com/hardware-innovation-workshop/research/",
      "doi": ""
    },
    {
      "text": "Janis Lena Meissner, Angelika Strohmayer, PeterWright, and Geraldine Fitzpatrick. 2018. A Schnittmuster for Crafting Context-Sensitive Toolkits. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (CHI '18). ACM Press, New York, New York, USA, 1--13.  ",
      "doi": "10.1145/3173574.3173725"
    },
    {
      "text": "David A. Mellis, Leah Buechley, Mitchel Resnick, and Björn Hartmann. 2016. Engaging Amateurs in the Design, Fabrication, and Assembly of Electronic Devices. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16. ACM Press, New York, New York, USA, 1270--1281.  ",
      "doi": "10.1145/2901790.2901833"
    },
    {
      "text": "Argyro Moraiti, Vero Vanden Abeele, Erwin Vanroye, and Luc Geurts. 2015. Empowering Occupational Therapists with a DIY-toolkit for Smart Soft Objects. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14 (TEI '15). ACM Press, New York, New York, USA, 387--394.  ",
      "doi": "10.1145/2677199.2680598"
    },
    {
      "text": "Evgeny Morozov. 2014. Making It. https://www.newyorker.com/ magazine/2014/01/13/making-it-2",
      "doi": ""
    },
    {
      "text": "Catarina Mota. 2011. The rise of personal fabrication. In Proceedings of the 8th ACM conference on Creativity and cognition - C&C '11. ACM Press, New York, New York, USA, 279.  ",
      "doi": "10.1145/2069618.2069665"
    },
    {
      "text": "Michael Nitsche, Andrew Quitmeyer, Kate Farina, Samuel Zwaan, and Hye Yeon Nam. 2014. Teaching digital craft. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14. ACM Press, New York, New York, USA, 719--730.  ",
      "doi": "10.1145/2559206.2578872"
    },
    {
      "text": "Sean O'Brien, Alexandria K. Hansen, and Danielle B. Harlow. 2016. Educating Teachers for the Maker Movement. In Proceedings of the 6th Annual Conference on Creativity and Fabrication in Education - FabLearn '16. ACM Press, New York, New York, USA, 99--102.  ",
      "doi": "10.1145/3003397.3003414"
    },
    {
      "text": "Roshan Lalintha Peiris and Suranga Nanayakkara. 2014. PaperPixels. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures the Future of Design - OzCHI '14. ACM Press, New York, New York, USA, 498--504.  ",
      "doi": "10.1145/2686612.2686691"
    },
    {
      "text": "Kylie A Peppler and Christian McKay. 2013. Broadening participation and issues of inclusion and accessibility in making. In Interaction Design for Children Conference (IDC).",
      "doi": ""
    },
    {
      "text": "Ravihansa Rajapakse, Margot Brereton, Paul Roe, and Laurianne Sitbon. 2014. Designing with People with Disabilities : Adapting Best Practices of DIY and Organizational Approaches. (2014), 519--522.  ",
      "doi": "10.1145/2686612.2686694"
    },
    {
      "text": "Ravihansa Rajapakse, Margot Brereton, and Laurianne Sitbon. 2018. Design Artefacts to Support People with a Disability to Build Personal Infrastructures. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18. ACM Press, New York, New York, USA, 277--288.  ",
      "doi": "10.1145/3196709.3196749"
    },
    {
      "text": "Ravihansa Rajapakse, Margot Brereton, Laurianne Sitbon, and Paul Roe. 2015. A Collaborative Approach to Design Individualized Technologies with People with a Disability. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction on - OzCHI '15. ACM Press, New York, New York, USA, 29--33.  ",
      "doi": "10.1145/2838739.2838824"
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. ACM Transactions on Computer-Human Interaction 22, 3 (jun 2015), 1--27.  ",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Paulo Rosa, Federico Ferretti, Ângela Guimarães Pereira, Francesco Panella, and Maximilian Wanner. 2017. Overview of the Maker Movement in the European Union. Number December. 62 pages.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner. 2011. Tracing provenance. interactions 18, 5 (sep 2011), 32.  ",
      "doi": "10.1145/2008176.2008186"
    },
    {
      "text": "Daniela K. Rosner and Morgan Ames. 2014. Designing for repair?. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14. ACM Press, New York, New York, USA, 319--331.  ",
      "doi": "10.1145/2531602.2531692"
    },
    {
      "text": "Jay Silver. 2009. Awakening to maker methodology. In Proceedings of the 8th International Conference on Interaction Design and Children - IDC '09. ACM Press, New York, New York, USA, 242.  ",
      "doi": "10.1145/1551788.1551841"
    },
    {
      "text": "Emily Smith. 2014. An inside look at Vancouver's vibrant maker community. In ACM SIGGRAPH 2014 Studio on - SIGGRAPH '14. ACM Press, NewYork, NewYork, USA, 1--1.  ",
      "doi": "10.1145/2619195.2656296"
    },
    {
      "text": "Angelika Strohmayer and Janis Meissner. 2017. \"We had tough times, but we've sort of sewn our way through it\": The Partnership Quilt. XRDS: Crossroads, The ACM Magazine for Students 24, 2 (dec 2017), 48--51.  ",
      "doi": "10.1145/3155128"
    },
    {
      "text": "Yuling Sun, Silvia Lindtner, Xianghua Ding, Tun Lu, and Ning Gu. 2015. Reliving the Past & Making a Harmonious Society Today. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15. ACM Press, New York, New York, USA, 44--55.  ",
      "doi": "10.1145/2675133.2675195"
    },
    {
      "text": "Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 2603.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Jennyfer Lawrence Taylor, Dhaval Vyas, and Tony Sharp. 2017. Diversity and coherence in a hackerspace for people from a low socioeconomic community. In Proceedings of the 29th Australian Conference on Computer-Human Interaction - OZCHI '17. ACM Press, New York, New York, USA, 238--247.  ",
      "doi": "10.1145/3152771.3152797"
    },
    {
      "text": "Nick Taylor, Ursula Hurley, and Philip Connolly. 2016. Making Community: The Wider Role of Makerspaces in Public Life. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 1415--1425.  ",
      "doi": "10.1145/2858036.2858073"
    },
    {
      "text": "Austin L. Toombs. 2017. Hackerspace Tropes, Identities, and Community Values. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS '17, Vol. 1. ACM Press, New York, New York, USA, 1079--1091.  ",
      "doi": "10.1145/3064663.3064760"
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 629--638.  ",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Cristen Torrey, Elizabeth F. Churchill, and David W. McDonald. 2009. Learning how. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, New York, New York, USA, 1371.  ",
      "doi": "10.1145/1518701.1518908"
    },
    {
      "text": "TriciaWang and Joseph 'Jofish' Kaye. 2011. Inventive leisure practices. In Proceedings of the 2011 annual conference extended abstracts on Human factors in computing systems - CHI EA '11. ACM Press, New York, New York, USA, 263.",
      "doi": ""
    },
    {
      "text": "Etienne Wenger-Trayner, Mark Fenton-O'Creevy, Steven Hutchinson, Chris Kubiak, and Beverly Wenger-Trayner (Eds.). 2014. Learning in Landscapes of Practice: Boundaries, identity, and knowledgeability in practice-based learning. Routledge.",
      "doi": ""
    },
    {
      "text": "Amit Zoran. 2015. Hybrid craft. In ACM SIGGRAPH Art Gallery on - SIGGRAPH '15, Vol. 46. ACM Press, New York, New York, USA, 384--398.  ",
      "doi": "10.1145/2810185.2810187"
    }
  ]
}