{
  "doi": "10.1145/3290605.3300914",
  "title": "The Parenting Actor-Network of Latino Immigrants in the United States",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "The field of Human-Computer Interaction (HCI) has shown a growing interest in how technology might support parenting. An area that remains underexplored is the design of technology to support parents from nondominant groups in positively impacting their children's education. Drawing on Actor-Network Theory (ANT), our paper takes a sociotechnical view of low-income Latino Spanish-speaking immigrants in the U.S.---a large nondominant group---attempting to form alliances with other actors such as teachers, the broader community, and technology to exchange information that might enrich their children's education. The use of ANT allowed us to advance work on parenting in HCI by providing a deeper understanding of the reasons---including attributes embedded in technology---impacting the quality of information channels in the parental engagement network of a nondominant group. Further, our ANT analysis illuminates a discussion of challenges and opportunities for technology to intervene in the network in ways that align with all actors' needs and harness their potentialities.",
  "tags": [
    "education",
    "latino",
    "parenting",
    "actor-network theory"
  ],
  "authors": [
    {
      "name": "Marisol Wong-Villacres",
      "institution": "Escuela Superior Politecnica del Litoral & Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81484657798/rel-imgonly/12208399_10155561261383647_405401115224813451_n.jpg",
      "acmid": "81484657798",
      "orcid": "0000-0002-8071-6716"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    },
    {
      "name": "Betsy DiSalvo",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421592306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing children's online identities: How parents decide what to disclose about their children online. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1895--1904.  ",
      "doi": "10.1145/2702123.2702325"
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked empowerment on Facebook groups for parents of children with special needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2805--2814.  ",
      "doi": "10.1145/2702123.2702324"
    },
    {
      "text": "Tawfiq Ammari, Sarita Schoenebeck, and Daniel M Romero. 2018. Pseudonymous Parents: Comparing Parenting Roles and Identities on the Mommit and Daddit Subreddits. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 489.  ",
      "doi": "10.1145/3173574.3174063"
    },
    {
      "text": "Tawfiq Ammari, Sarita Yardi Schoenebeck, and Meredith Ringel Morris. 2014. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs.. In ICWSM .",
      "doi": ""
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as learning partners in the development of technological fluency. (2009).",
      "doi": ""
    },
    {
      "text": "Aprile D. Benner, Alaina E. Boyle, and Sydney Sadler. 2016. Parental Involvement and Adolescents' Educational Success: The Roles of Prior Achievement and Socioeconomic Status. Journal of Youth and Adolescence, Vol. 45, 6 (2016), 1053--1064.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT parents and social media: Advocacy, privacy, and disclosure during shifting social movements. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 610--622.  ",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Brian P Bloomfield, Rod Coombs, David J Cooper, and David Rea. 1992. Machines and manoeuvres: responsibility accounting and the construction of hospital information systems. Accounting, Management and Information Technologies, Vol. 2, 4 (1992), 197--219.",
      "doi": ""
    },
    {
      "text": "Marc H Bornstein and Yvonne Bohr. 2011. Immigration, acculturation and parenting. Immigration and Acculturation in Childhood 6 (2011), 15.",
      "doi": ""
    },
    {
      "text": "United States Census Bureau. 2015. Educational Attainment in the United States: 2015. https://www.census.gov/content/dam/Census/library/publications/2016/demo/p20--578.pdf",
      "doi": ""
    },
    {
      "text": "United States Census Bureau. 2017. Facts for Features: Hispanic Heritage Month 2017. https://tinyurl.com/yc5cxwpb",
      "doi": ""
    },
    {
      "text": "Michel Callon. 1984. Some elements of a sociology of translation: domestication of the scallops and the fishermen of St Brieuc Bay. The Sociological Review, Vol. 32, 1_suppl (1984), 196--233.",
      "doi": ""
    },
    {
      "text": "Gustavo Pérez Carreón, Corey Drake, and Angela Calabrese Barton. 2005. The importance of presence: Immigrant parents' school engagement experiences. American Educational Research Journal, Vol. 42, 3 (2005), 465--498.",
      "doi": ""
    },
    {
      "text": "Rosario Ceballo, Laura K Maurizi, Gloria a Suarez, and Maria T Aretakis. 2014. Gift and sacrifice: parental involvement in Latino adolescents' education. Cultural diversity & ethnic minority psychology, Vol. 20, 1 (2014), 116--27.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2014. Internet/Broadband Fact Sheets. http://www.pewinternet.org/fact-sheet/internet-broadband/",
      "doi": ""
    },
    {
      "text": "Gabriela Chavira, Catherine R Cooper, and Yolanda Vasquez-Salgado. 2016. Pathways to achievement: Career and educational aspirations and expectations of Latina/o immigrant parents and early adolescents. Journal of Latinos and Education, Vol. 15, 3 (2016), 214--228.",
      "doi": ""
    },
    {
      "text": "Padma Chirumamilla and Joyojeet Pal. 2013. Play and power: a ludic design proposal for ICTD. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. ACM, 25--33.  ",
      "doi": "10.1145/2516604.2516628"
    },
    {
      "text": "Lynn Schofield Clark. 2013. The parent app: Understanding families in the digital age .Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Elisia L Cohen. 2014. Communicating for one's family: An interdisciplinary review of language and cultural brokering in immigrant families. In Communication Yearbook 38. Routledge, 27--62.",
      "doi": ""
    },
    {
      "text": "Madalyn Cohron. 2015. The continuing digital divide in the United States. The Serials Librarian, Vol. 69, 1 (2015), 77--86.",
      "doi": ""
    },
    {
      "text": "Sabrina L Connell, Alexis R Lauricella, and Ellen Wartella. 2015. Parental co-use of media technology with their young children in the USA. Journal of Children and Media, Vol. 9, 1 (2015), 5--21.",
      "doi": ""
    },
    {
      "text": "Terrence E Deal and Kent D Peterson. 2016. Shaping school culture .John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo, Parisa Khanipour Roshan, and Briana Morrison. 2016. Information seeking practices of parents: Exploring skills, face threats and social networks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 623--634.  ",
      "doi": "10.1145/2858036.2858586"
    },
    {
      "text": "Ron Eglash, Juan E Gilbert, Valerie Taylor, and Susan R Geier. 2013. Culturally responsive computing in urban, after-school contexts: Two approaches. Urban Education, Vol. 48, 5 (2013), 629--656.",
      "doi": ""
    },
    {
      "text": "National Center for Children in Poverty. 2015. United States Demographics of Low-Income Children. http://www.nccp.org/profiles/US_profile_6.html",
      "doi": ""
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, and Manfred Tscheligi. 2013. Materials, materiality, and media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2853--2862.  ",
      "doi": "10.1145/2470654.2481395"
    },
    {
      "text": "Bruce Fuller, José Ramón Lizárraga, and James H Gray. 2015. Digital media and Latino families.",
      "doi": ""
    },
    {
      "text": "Elisabeth Gee, Lori Takeuchi, and Ellen Wartella. 2017. Children and families in the digital age: Learning together in a media saturated culture .Routledge.",
      "doi": ""
    },
    {
      "text": "Arup Kumar Ghosh, Karla A Badillo-Urquiola, Heng Xu, Mary Beth Rosson, John M Carroll, and Pamela Wisniewski. 2017. Examining Parents' Technical Mediation of Teens' Mobile Devices. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 179--182.  ",
      "doi": "10.1145/3022198.3026306"
    },
    {
      "text": "Amy Gonzales. 2016. The contemporary US digital divide: from initial access to technology maintenance. Information, Communication & Society, Vol. 19, 2 (2016), 234--248.",
      "doi": ""
    },
    {
      "text": "Carmen Gonzalez and Vikki S Katz. 2016. Transnational family communication as a driver of technology adoption. International Journal of Communication, Vol. 10 (2016), 21.",
      "doi": ""
    },
    {
      "text": "Panom Gunawong and Ping Gao. 2010. Challenges of egovernment in developing countries: actor-network analysis of Thailand's smart ID card project. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. ACM, 17.  ",
      "doi": "10.1145/2369220.2369235"
    },
    {
      "text": "Kris D Gutiérrez, P Zitlali Morales, and Danny C Martinez. 2009. Re-mediating literacy: Culture, difference, and learning for students from nondominant communities. Review of research in education, Vol. 33, 1 (2009), 212--245.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai. 2010. Digital na (t) ives? Variation in internet skills and uses among members of the \"net generation\". Sociological inquiry, Vol. 80, 1 (2010), 92--113.",
      "doi": ""
    },
    {
      "text": "Diley Hernandez, Shaheen Rana, Meltem Alemdar, Anal'ia Rao, and Marion Usselman. 2016. Latino parents' educational values and STEM beliefs. Journal for Multicultural Education, Vol. 10, 3 (2016), 354--367.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sarita Y Schoenebeck, and Julie A Kientz. 2016. Not at the dinner table: Parents' and children's perspectives on family technology rules. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. ACM, 1376--1389.  ",
      "doi": "10.1145/2818048.2819940"
    },
    {
      "text": "Juyoung Jang, Heather Hessel, and Jodi Dworkin. 2017. Parent ICT use, social capital, and parenting efficacy. Computers in Human Behavior, Vol. 71 (2017), 395--401.  ",
      "doi": "10.1016/j.chb.2017.02.025"
    },
    {
      "text": "Vikki S Katz. 2010. How children of immigrants use media to connect their families to the community: The case of Latinos in South Los Angeles. Journal of Children and Media, Vol. 4, 3 (2010), 298--315.",
      "doi": ""
    },
    {
      "text": "Vikki S Katz. 2014. Kids in the middle: How children of immigrants negotiate community interactions for their families .Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Vikki S Katz and Carmen Gonzalez. 2016. Community variations in low-income Latino families' technology adoption and integration. American Behavioral Scientist, Vol. 60, 1 (2016), 59--80.",
      "doi": ""
    },
    {
      "text": "Parisa Khanipour Roshan, Maia Jacobs, Michaelanne Dye, and Betsy DiSalvo. 2014. Exploring how parents in economically depressed communities access learning resources. In Proceedings of the 18th International Conference on Supporting Group Work. ACM, 131--141.  ",
      "doi": "10.1145/2660398.2660415"
    },
    {
      "text": "Neha Kumar and Nimmi Rangaswamy. 2013. The mobile media actor-network in urban India. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1989--1998.  ",
      "doi": "10.1145/2470654.2466263"
    },
    {
      "text": "Kostadin Kushlev and Elizabeth W Dunn. 2015. Checking email less frequently reduces stress. Computers in Human Behavior, Vol. 43 (2015), 220--228.  ",
      "doi": "10.1016/j.chb.2014.11.005"
    },
    {
      "text": "Bruno Latour. 1987. Science in action: How to follow scientists and engineers through society .Harvard university press.",
      "doi": ""
    },
    {
      "text": "Bruno Latour et almbox. 2005. Reassembling the social: An introduction to actor-network-theory .Oxford university press.",
      "doi": ""
    },
    {
      "text": "Susan A LaValley, Elizabeth A Gage-Bouchard, Michelle Mollica, and Lynda Beaupin. 2015. Examining social media use among parents of children with cancer. In Proceedings of the 78th ASIS&T Annual Meeting: Information Science with Impact: Research in and for the Community. American Society for Information Science, 89. ",
      "doi": "10.5555/2857070.2857159"
    },
    {
      "text": "June Lee and Brigid Barron. 2015. Aprendiendo en Casa: Media as a Resource for Learning among Hispanic-Latino Families. A Report of the Families and Media Project. Joan Ganz Cooney Center (2015).",
      "doi": ""
    },
    {
      "text": "Amber Levinson and Brigid Barrod. 2018. Latino immigrant families learning with digital media across settings and generations. Digital Education Review 33 (2018), 150--169.",
      "doi": ""
    },
    {
      "text": "Amber Maria Levinson. 2017. Latino Immigrant Families Bridging Home and School Learning with Technology. Children and Families in the Digital Age: Learning Together in a Media Saturated Culture (2017).",
      "doi": ""
    },
    {
      "text": "Alex R Lin, Sandra D Simpkins, Erin R Gaskin, and Cecilia Menj'ivar. 2018. Cultural values and other perceived benefits of organized activities: A qualitative analysis of Mexican-origin parents' perspectives in Arizona. Applied Developmental Science, Vol. 22, 2 (2018), 89--109.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Ellen Helsper. 2007. Gradations in digital inclusion: Children, young people and the digital divide. New media & society, Vol. 9, 4 (2007), 671--696.",
      "doi": ""
    },
    {
      "text": "Cecilia Menjivar. 1997. Immigrant kinship networks: Vietnamese, Salvadoreans and Mexicans in comparative perspective. Journal of Comparative Family Studies (1997), 1--24.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam. 2002. Qualitative research in practice: Examples for discussion and analysis .Jossey-Bass Inc Pub.",
      "doi": ""
    },
    {
      "text": "United Nations. 2017. International Migration Report 2017. https://tinyurl.com/y75wafgz",
      "doi": ""
    },
    {
      "text": "Silvia Noguerón-Liu. 2017. Expanding Notions of Digital Access: Parents' Negotiation of School-Based Technology Initiatives in New Immigrant Communities. Equity & Excellence in Education, Vol. 50, 4 (2017), 387--399.",
      "doi": ""
    },
    {
      "text": "Alexandra E Pavlakis. 2018. Reaching all families: Family, school, and community partnerships amid homelessness and high mobility in an urban district. Urban Education, Vol. 53, 8 (2018), 1043--1073.",
      "doi": ""
    },
    {
      "text": "Claudia Peralta, Melissa Caspary, and Diane Boothe. 2013. Success factors impacting Latina/o persistence in higher education leading to STEM opportunities. Cultural Studies of Science Education, Vol. 8, 4 (2013), 905--918.",
      "doi": ""
    },
    {
      "text": "Jo Pierson. 2015. Privacy and Empowerment in Connective Media. In International Conference on Internet Science. Springer, 3--14.",
      "doi": ""
    },
    {
      "text": "Gonzalez C. Nieto C. Roldan W. Onofre E. & Yip J. Pina, L. 2018. How U.S. Latino children engage in collaborative online information problem solving with their families. Proceedings of ACM Computer Supported Collaborative Work (2018).",
      "doi": "10.1145/3274409"
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A. Munson, James Fogarty, and Julie A. Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices Around Health Monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2300--2315.  ",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "David P Randall, E Ilana Diamant, and Charlotte P Lee. 2015. Creating sustainable cyberinfrastructures. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1759--1768.  ",
      "doi": "10.1145/2702123.2702216"
    },
    {
      "text": "Victoria Rideout and Vikki S Katz. 2016. Opportunity for All? Technology and Learning in Lower-Income Families.. In Joan Ganz Cooney Center at Sesame Workshop. ERIC.",
      "doi": ""
    },
    {
      "text": "Edwin Sayes. 2014. Actor--Network Theory and methodology: Just what does it mean to say that nonhumans have agency? Social Studies of Science, Vol. 44, 1 (2014), 134--149.",
      "doi": ""
    },
    {
      "text": "Diane J Schiano, Christine Burg, Anthony Nalan Smith, and Florencia Moore. 2016. Parenting Digital Youth: How Now?. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3181--3189.  ",
      "doi": "10.1145/2851581.2892481"
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2013. The Secret Life of Online Moms: Anonymity and Disinhibition on YouBeMom. com.. In ICWSM .",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi. 2011. Families matter: Designing media for a digital age. In New York: The Joan Ganz Cooney Center at Sesame Workshop .",
      "doi": ""
    },
    {
      "text": "Arthur Tatnall and Anthony Gilding. 2005. Actor-Network Theory in Information Systems Research.",
      "doi": ""
    },
    {
      "text": "Pew Research Interent & Technology. 2011. Search and email still top the list of most popular online activities. https://tinyurl.com/yaje9rl7",
      "doi": ""
    },
    {
      "text": "Bogusia Temple and Alys Young. 2004. Qualitative research and translation dilemmas. Qualitative research, Vol. 4, 2 (2004), 161--178.",
      "doi": ""
    },
    {
      "text": "Pew Research Center Hispanic Trends. 2014. Among Hispanics, immigrants more likely to be stay-at-home moms and to believe that's best for kids. https://tinyurl.com/yanrffqn",
      "doi": ""
    },
    {
      "text": "Pew Research Center Hispanic Trends. 2016. 5 facts about Latinos and education. http://www.pewresearch.org/fact-tank/2016/07/28/5-facts-about-latinos-and-education/",
      "doi": ""
    },
    {
      "text": "Lisa M Tripp. 2011. \"The computer is not for you to be looking around, it is for schoolwork': Challenges for digital inclusion as Latino immigrant families negotiate children's access to the internet. New Media & Society, Vol. 13, 4 (2011), 552--567.",
      "doi": ""
    },
    {
      "text": "Alexander JAM Van Deursen and Jan AGM Van Dijk. 2014. The digital divide shifts to differences in usage. New media & society, Vol. 16, 3 (2014), 507--526.",
      "doi": ""
    },
    {
      "text": "Carol Vincent. 2017. \"The children have only got one education and you have to make sure it's a good one': parenting and parent--school relations in a neoliberal age. Gender and Education, Vol. 29, 5 (2017), 541--557.",
      "doi": ""
    },
    {
      "text": "Geoff Walsham. 1997. Actor-network theory and IS research: current status and future prospects. In Information systems and qualitative research. Springer, 466--480. ",
      "doi": "10.5555/278888.278919"
    },
    {
      "text": "Pamela Wisniewski, Arup Kumar Ghosh, Heng Xu, Mary Beth Rosson, and John M Carroll. 2017. Parental Control vs. Teen Self-Regulation: Is there a middle ground for mobile online safety?. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 51--69.  ",
      "doi": "10.1145/2998181.2998352"
    },
    {
      "text": "Marisol Wong-Villacres, Upol Ehsan, Amber Solomon, Mercedes Pozo Buil, and Betsy DiSalvo. 2017. Design Guidelines for Parent-School Technologies to Support the Ecology of Parental Engagement. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 73--83.  ",
      "doi": "10.1145/3078072.3079748"
    },
    {
      "text": "Marisol Wong-Villacres, Arkadeep Kumar, Aditya Vishwanath, Naveena Karusala, Betsy DiSalvo, and Neha Kumar. 2018. Designing for Interactions. In Proceedings of the 2018 Conference on Designing Interactive Systems (DIS '18). ACM, New York, NY, USA. Forthcoming.  ",
      "doi": "10.1145/3196709.3196794"
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2012. Income, race, and class: exploring socioeconomic differences in family technology use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3041--3050.  ",
      "doi": "10.1145/2207676.2208716"
    },
    {
      "text": "Svetlana Yarosh, Sarita Schoenebeck, Shreya Kothaneth, and Elizabeth Bales. 2016. Best of Both Worlds: Opportunities for Technology in Cross-Cultural Parenting. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 635--647.  ",
      "doi": "10.1145/2858036.2858210"
    },
    {
      "text": "Jason C Yip, Carmen Gonzalez, and Vikki Katz. 2017. Children of Immigrant's Experiences in Online Information Brokering. Children and Families in the Digital Age: Learning Together in a Media Saturated Culture (2017).",
      "doi": ""
    }
  ]
}