{
  "doi": "10.1145/3290605.3300349",
  "title": "\"My blood sugar is higher on the weekends\": Finding a Role for Context and Context-Awareness in the Design of Health Self-Management Technology",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Tools for self-care of chronic conditions often do not fit the contexts in which self-care happens because the influence of context on self-care practices is unclear. We conducted a diary study with 15 adolescents with Type 1 Diabetes and their caregivers to understand how context affects self-care. We observed different contextual settings, which we call contextual frames, in which diabetes self-management varied depending on certain factors - physical activity, food, emotional state, insulin, people, and attitudes. The relative prevalence of these factors across contextual frames impacts self-care necessitating different types of support. We show that contextual frames, as phenomenological abstractions of context, can help designers of context-aware systems systematically explore and model the relation of context with behavior and with technology supporting behavior. Lastly, considering contextual frames as sensitizing concepts, we provide design direction for using context in technology design.",
  "authors": [
    {
      "name": "Shriti Raj",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130807",
      "orcid": "0000-0001-5484-9980"
    },
    {
      "name": "Kelsey Toporski",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366195",
      "orcid": "missing"
    },
    {
      "name": "Ashley Garrity",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659358256",
      "orcid": "missing"
    },
    {
      "name": "Joyce M. Lee",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131956",
      "orcid": "0000-0002-8147-5168"
    },
    {
      "name": "Mark W. Newman",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594629",
      "orcid": "0000-0001-7186-1383"
    }
  ],
  "references": [
    {
      "text": "Mark S. Ackerman, Ayse G. Buyuktur, Pei-Yao Hung, Michelle A. Meade, and Mark W. Newman. 2018. Socio-technical Design for the Care of People With Spinal Cord Injuries. In Designing Healthcare That Works. Elsevier, 1--18.",
      "doi": ""
    },
    {
      "text": "Unai Alegre, Juan Carlos Augusto, and Tony Clark. 2016. Engineering context-aware systems and applications: A survey. Journal of Systems and Software 117 (July 2016), 55--83.  ",
      "doi": "10.1016/j.jss.2016.02.010"
    },
    {
      "text": "Unai Alegre-Ibarra, Juan Carlos Augusto, and Carl Evans. 2018. Perspectives on engineering more usable context-aware systems. Journal of Ambient Intelligence and Humanized Computing 9, 5 (Oct. 2018), 1593--1609.",
      "doi": ""
    },
    {
      "text": "American Diabetes Association. 2018. 5. Prevention or Delay of Type 2 Diabetes: Standards of Medical Care in Diabetes-2018. Diabetes Care 41, Supplement 1 (Jan. 2018), S51--S54.",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing Mobile Health Technology for Bipolar Disorder: A Field Trial of the Monarca System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2627--2636.  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Nanna Tuxen, Maria Faurholt-Jepsen, and Lars V. Kessing. 2016. Designing context-aware cognitive behavioral therapy for unipolar and bipolar disorders. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing Adjunct - UbiComp '16. ACM Press, Heidelberg, Germany, 1162--1170.  ",
      "doi": "10.1145/2968219.2968303"
    },
    {
      "text": "Joseph A Cafazzo, Mark Casselman, Nathaniel Hamming, Debra K Katzman, and Mark R Palmert. 2012. Design of an mHealth App for the Self-management of Adolescent Type 1 Diabetes: A Pilot Study. Journal of Medical Internet Research 14, 3 (May 2012), e70.",
      "doi": ""
    },
    {
      "text": "Y. Chen. 2010. Take it personally: accounting for individual difference in designing diabetes management systems. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. 252--261. http: //dl.acm.org/citation.cfm?id=1858218  ",
      "doi": "10.1145/1858171.1858218"
    },
    {
      "text": "Wikipedia contributors. 2018. Pipeline (Unix). https://en.wikipedia. org/w/index.php?title=Pipeline_(Unix)&oldid=847908384",
      "doi": ""
    },
    {
      "text": "Anind K. Dey. 2001. Understanding and Using Context. Personal Ubiquitous Comput. 5, 1 (Jan. 2001), 4--7.  ",
      "doi": "10.1007/s007790170019"
    },
    {
      "text": "Anind K. Dey, Gregory D. Abowd, and Daniel Salber. 2001. A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk S. Raj et al. Context-aware Applications. Hum.-Comput. Interact. 16, 2 (Dec. 2001), 97--166.",
      "doi": "10.1207/S15327051HCI16234_02"
    },
    {
      "text": "Anind K. Dey and Alan Newberger. 2009. Support for context-aware intelligibility and control. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, Boston, MA, USA, 859.  ",
      "doi": "10.1145/1518701.1518832"
    },
    {
      "text": "Diabetes.co.uk. 2018. Basal Bolus - What is Basal Insulin & Bolus Insulin. https://www.diabetes.co.uk/insulin/basal-bolus.html",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. What we talk about when we talk about context. Personal and ubiquitous computing 8, 1 (2004), 19--30. http://link. springer.com/article/10.1007/s00779-003-0253--8",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Centers for Disease Control and Prevention. 2017. National Diabetes Statistics Report, 2017., 20 pages. https://www.cdc.gov/diabetes/pdfs/ data/statistics/national-diabetes-statistics-report.pdf",
      "doi": ""
    },
    {
      "text": "Institute for Quality and Efficiency in Health Care (IQWiG). 2017. Type 1 diabetes: Overview. https://www.ncbi.nlm.nih.gov/pubmedhealth/ PMH0072523/",
      "doi": ""
    },
    {
      "text": "Dag Helge Frøisland, Eirik Årsand, and Finn Skårderud. 2012. Improving diabetes care for young people with type 1 diabetes through visual learning on mobile phones: mixed-methods study. Journal of medical Internet research 14, 4 (2012).",
      "doi": ""
    },
    {
      "text": "Marie Glasemann, Anne Marie Kanstrup, and Thomas Ryberg. 2010. Making Chocolate-covered Broccoli: Designing a Mobile Learning Game about Food for Young People with Diabetes. DIS (2010).  ",
      "doi": "10.1145/1858171.1858219"
    },
    {
      "text": "Anne Marie Kanstrup, Pernille Bertelsen, Marie Glasemann, and Niels Boye. 2008. Design for More: an Ambient Perspective on Diabetes. Participatory Design (2008). ",
      "doi": "10.5555/1795234.1795252"
    },
    {
      "text": "Predrag Klasnja, Logan Kendall, Wanda Pratt, and Katherine Blondon. 2015. Long-Term Engagement with Health-Management Technology: a Dynamic Process in Diabetes. AMIA Annual Symposium Proceedings 2015 (Nov. 2015), 756--765. https://www.ncbi.nlm.nih.gov/pmc/ articles/PMC4765561/",
      "doi": ""
    },
    {
      "text": "The Lancet. 2009. Tackling the burden of chronic diseases in the USA. The Lancet 373, 9659 (Jan. 2009), 185.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2012. Using context to reveal factors that affect physical activity. ACM Transactions on ComputerHuman Interaction 19, 1 (March 2012), 1--21.  ",
      "doi": "10.1145/2147783.2147790"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of Social Scaffolding for Reflective Thinking in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Lena Mamykina, Elizabeth D. Mynatt, and David R. Kaufman. 2006. Investigating health management practices of individuals with diabetes. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems. ACM, 927--936. http://dl.acm.org/citation.cfm?id=1124910  ",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Inbal Nahum-Shani, Shawna N. Smith, Bonnie J. Spring, Linda M. Collins, Katie Witkiewitz, Ambuj Tewari, and Susan A. Murphy. 2018. Just-in-Time Adaptive Interventions (JITAIs) in Mobile Health: Key Components and Design Principles for Ongoing Health Behavior Support. Annals of Behavioral Medicine 52, 6 (May 2018), 446--462.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2015. Self-Care Technologies and Collaboration. International Journal of Human-Computer Interaction 31, 12 (Dec. 2015), 869--881.",
      "doi": ""
    },
    {
      "text": "National Institute of Diabetes, Digestive, and Kidney Diseases. 2019. Diabetes Overview | NIDDK. https://www.niddk.nih.gov/ health-information/diabetes/overview",
      "doi": ""
    },
    {
      "text": "American Association of Diabetes Educators. 2019. AADE7 Self-Care Behaviors for Managing Diabetes Effectively. https://www.diabeteseducator.org/living-with-diabetes/ aade7-self-care-behaviors",
      "doi": ""
    },
    {
      "text": "Tom Owen, Jennifer Pearson, Harold Thimbleby, and George Buchanan. 2015. ConCap: Designing to Empower Individual Reflection on Chronic Conditions using Mobile Apps. In roceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM Press, 105--114.  ",
      "doi": "10.1145/2785830.2785881"
    },
    {
      "text": "Gaurav Paruthi, Shriti Raj, Natalie Colabianchi, Predrag Klasnja, and Mark W. Newman. 2018. Finding the Sweet Spot(s): Understanding Context to Support Physical Activity Plans. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (March 2018), 1--17.  ",
      "doi": "10.1145/3191761"
    },
    {
      "text": "Veljko Pejovic and Mirco Musolesi. 2015. Anticipatory Mobile Computing: A Survey of the State of the Art and Research Challenges. Comput. Surveys 47, 3 (April 2015), 1--29. arXiv: 1306.2356.  ",
      "doi": "10.1145/2693843"
    },
    {
      "text": "William H Polonsky and Robert R Henry. 2016. Poor medication adherence in type 2 diabetes: recognizing the scope of the problem and its key contributors. Patient preference and adherence 10 (July 2016), 1299--1307.",
      "doi": ""
    },
    {
      "text": "Davy Preuveneers and Yolande Berbers. 2008. Mobile phones assisting with health self-care: a diabetes case study. In Proceedings of the 10th international conference on Human computer interaction with mobile devices and services. ACM, 177--186. http://dl.acm.org/citation.cfm? id=1409260  ",
      "doi": "10.1145/1409240.1409260"
    },
    {
      "text": "Mashfiqui Rabbi, Min Hane Aung, Mi Zhang, and Tanzeem Choudhury. 2015. MyBehavior: automatic personalized health feedback from user behaviors and preferences using smartphones. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 707--718.  ",
      "doi": "10.1145/2750858.2805840"
    },
    {
      "text": "J Saldaña. 2013. The coding manual for qualitative researchers. Sage, Los Angeles, 260--273.",
      "doi": ""
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, Toronto, Ontario, Canada, 1971--1980.  ",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Lynne S. Schilling, Margaret Grey, and Kathleen A. Knafl. 2002. The concept of self-management of type 1 diabetes in children and adolescents: an evolutionary concept analysis. Journal of Advanced Nursing 37, 1 (2002), 87--99.",
      "doi": ""
    },
    {
      "text": "Moushumi Sharmin, Andrew Raij, David Epstien, Inbal Nahum-Shani, J. Gayle Beck, Sudip Vhaduri, Kenzie Preston, and Santosh Kumar. 2015. Visualization of time-series sensor data to inform the design of just-in-time adaptive stress interventions. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '15. ACM Press, Osaka, Japan, 505--516.  ",
      "doi": "10.1145/2750858.2807537"
    },
    {
      "text": "Brian K. Smith, Jeana Frost, Meltem Albayrak, and Rajneesh Sudhakar. 2007. Integrating glucometers and digital photography as experience capture tools to enhance patient understanding and communication of diabetes self-management practices. Personal and Ubiquitous Computing 11, 4 (March 2007), 273--286.  ",
      "doi": "10.1007/s00779-006-0087-2"
    },
    {
      "text": "Smyth and Heron. 2016. Is providing mobile interventions \"just-intime\" helpful? an experimental proof of concept study of just-in-time intervention for stress management. In 2016 IEEE Wireless Health (WH). 1--7. \"My blood sugar is higher on the weekends\": Finding a Role for Context and Context-Awareness in the Design of Health Self-Management Technology CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2010. Multiple forms of appropriation in selfmonitoring technology: Reflections on the role of evaluation in future self-care. Intl. Journal of Human--Computer Interaction 26, 5 (2010), 537--561.",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2014. Design challenges for ubiquitous and personal computing in chronic disease care and patient empowerment: a case study rethinking diabetes self-monitoring. Personal and Ubiquitous Computing 18, 5 (June 2014), 1277--1290.  ",
      "doi": "10.1007/s00779-013-0707-6"
    },
    {
      "text": "Tammy Toscos, Kay Connelly, and Yvonne Rogers. 2012. Best intentions: health monitoring technology and children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1431--1440. http://dl.acm.org/citation.cfm?id=2208603  ",
      "doi": "10.1145/2207676.2208603"
    },
    {
      "text": "Esther J.G. van der Drift, Robbert-Jan Beun, Rosemarijn Looije, Olivier A. Blanson Henkemans, and Mark A. Neerincx. 2014. A remote social robot to motivate and support diabetic children in keeping a diary. ACM Press, 463--470.  ",
      "doi": "10.1145/2559636.2559664"
    },
    {
      "text": "Sandra H van Oostrom, Ronald Gijsen, Irina Stirbu, Joke C Korevaar, Francois G Schellevis, H. Susan J Picavet, and Nancy Hoeymans. 2016. Time Trends in Prevalence of Chronic Diseases and Multimorbidity Not Only due to Aging: Data from General Practices and Health Surveys. PLoS ONE 11, 8 (Aug. 2016).",
      "doi": ""
    },
    {
      "text": "J. R. Wood, K. M. Miller, D. M. Maahs, R. W. Beck, L. A. DiMeglio, I. M. Libman, M. Quinn, W. V. Tamborlane, S. E. Woerner, and for the T1D Exchange Clinic Network. 2013. Most Youth With Type 1 Diabetes in the T1D Exchange Clinic Registry Do Not Meet American Diabetes Association or International Society for Pediatric and Adolescent Diabetes Clinical Guidelines. Diabetes Care 36, 7 (July 2013), 2035--2037.",
      "doi": ""
    },
    {
      "text": "Yuan Wu, Xun Yao, Giacomo Vespasiani, Antonio Nicolucci, Yajie Dong, Joey Kwong, Ling Li, Xin Sun, Haoming Tian, and Sheyu Li. 2017. Mobile App-Based Interventions to Support Diabetes SelfManagement: A Systematic Review of Randomized Controlled Trials to Identify Functions Associated with Glycemic Efficacy. JMIR mHealth and uHealth 5, 3 (March 2017).",
      "doi": ""
    }
  ]
}