{
  "doi": "10.1145/3290605.3300495",
  "title": "Everyday Experiences: Small Stories and Mental Illness on Instagram",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Despite historical precedence and modern prevalence, mental illness and associated disorders are frequently aligned with notions of deviance and, by association, abnormality. The view that mental illness deviates from an implicit social norm permeates the CHI community, impacting how scholars approach research in this space. In this paper, we challenge community and societal norms aligning mental illness with deviance. We combine semi-structured interviews with digital ethnography of public Instagram accounts to examine how Instagram users express mental illness. Drawing on small stories research, we find that individuals situate mental illness within their everyday lives and negotiate their tellings of experience due to the influence of various social control structures. We discuss implications for incorporating 'the everyday' into the design of technological solutions for marginalized communities and the ways in which researchers and designers may inadvertently perpetuate and instantiate stigma related to mental illness.",
  "authors": [
    {
      "name": "Jessica L. Feuston",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657892",
      "orcid": "missing"
    },
    {
      "name": "Anne Marie Piper",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316490036",
      "orcid": "0000-0003-3085-3277"
    }
  ],
  "references": [
    {
      "text": "2014. Selfies, Hashtags, and the Mechanisms of Ideology | Strike Your Note. https://strikeyournote.wordpress.com/2014/05/21/selfieshashtags-and-the-mechanisms-of-ideology/",
      "doi": ""
    },
    {
      "text": "2015. Kermit the Frog | Know Your Meme. https:// knowyourmeme.com/memes/kermit-the-frog",
      "doi": ""
    },
    {
      "text": "Edith Ackermann, Francoise Decortis, Juan Pablo Hourcade, and Heidi Schelhowe. 2009. Cultural Coding and De-coding As Ways of Participation: Digital Media for Marginalized Young People. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09). ACM, 294--297.  ",
      "doi": "10.1145/1551788.1551864"
    },
    {
      "text": "Morgan Ames and Mor Naaman. 2007. Why We Tag: Motivations for Annotation in Mobile and Online Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, 971--980.  ",
      "doi": "10.1145/1240624.1240772"
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Networked Empowerment on Facebook Groups for Parents of Children with Special Needs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 2805--2814.  ",
      "doi": "10.1145/2702123.2702324"
    },
    {
      "text": "Nazanin Andalibi. 2016. Social Media for Sensitive Disclosures and Social Support: The Case of Miscarriage. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP '16). ACM, 461--465.  ",
      "doi": "10.1145/2957276.2997019"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of #Depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, 1485--1500.  ",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Zahra Ashktorab. 2016. A Study of Cyberbullying Detection and Mitigation on Instagram. In Proceedings of the 19th ACM Conference on Computer Supported Cooperative Work and Social Computing Companion (CSCW '16 Companion). ACM, 126--130.  ",
      "doi": "10.1145/2818052.2874346"
    },
    {
      "text": "Paul Atkinson. 1997. Narrative Turn or Blind Alley? 7, 3 (aug 1997), 325--344.",
      "doi": ""
    },
    {
      "text": "Michael Bamberg. 2006. Stories: Big or small: Why do we care? 16 (jan 2006), 139--147.",
      "doi": ""
    },
    {
      "text": "Michael Bamberg. 2012. Narrative Analysis. In APA handbook of research methods in psychology, H. Cooper (Ed.). Vol. 2. 77--94.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Steven E. Barkan. 2011. Sociology: Understanding and Changing the Social World. (2011). http://open.lib.umn.edu/sociology/",
      "doi": ""
    },
    {
      "text": "Karin Barron. 1999. Ethics in qualitative social research on marginalized groups. 1, 1 (jan 1999), 38--49.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. 1 (dec 2017), 24:1--24:19. Issue CSCW.  ",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure During Shifting Social Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 610--622.  ",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Johnna Blair and Saeed Abdullah. 2018. Supporting Constructive Mental Health Discourse in Social Media. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '18). ACM, 299--303.  ",
      "doi": "10.1145/3240925.3240930"
    },
    {
      "text": "Dina L. G. Borzekowski, Summer Schenk, Jenny L. Wilson, and Rebecka Peebles. 2010. e-Ana and e-Mia: A Content Analysis of Pro-Eating Disorder Web Sites. 100, 8 (aug 2010), 1526--1534.",
      "doi": ""
    },
    {
      "text": "Uwe Bretschneider, Thomas WÃhner, and Ralf Peters. 2014. Detecting Online Harassment in Social Networks. (dec 2014). https: //aisel.aisnet.org/icis2014/proceedings/ConferenceTheme/2",
      "doi": ""
    },
    {
      "text": "R. C. Brown, T. Fischer, A. D. Goldwich, F. Keller, R. Young, and P. L. Plener. 2018. #cutting: Non-suicidal self-injury (NSSI) on Instagram. 48, 2 (jan 2018), 337--346.",
      "doi": ""
    },
    {
      "text": "Amy Bruckman. 2006. Teaching Students to Study Online Communities Ethically. (2006), 82--95.",
      "doi": ""
    },
    {
      "text": "Kellie E. Carlyle, Jeanine P. D. Guidry, Kofoworola Williams, Ariella Tabaac, and Paul B. Perrin. 2018. Suicide conversations on Instagram: contagion or caring? 0, 0 (mar 2018), 1--7.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Andrea Hu, and Munmun De Choudhury. 2018. Norms Matter: Contrasting Social Support Around Behavior Change in Online Weight Loss Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 666:1--666:14.  ",
      "doi": "10.1145/3173574.3174240"
    },
    {
      "text": "Stevie Chancellor, Yannis Kalantidis, Jessica A. Pater, Munmun De Choudhury, and David A. Shamma. 2017. Multimodal Classification of Moderated Online Pro-Eating Disorder Content. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 3213--3226.  ",
      "doi": "10.1145/3025453.3025985"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L. Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 1171--1184.  ",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan (Jerry) Lin, and Munmun De Choudhury. 2016. \"This Post Will Just Get Taken Down\": Characterizing Removed Pro-Eating Disorder Social Media Content. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 1157--1162.  ",
      "doi": "10.1145/2858036.2858248"
    },
    {
      "text": "Stevie Chancellor, Tanushree Mitra, and Munmun De Choudhury. 2016. Recovery Amid Pro-Anorexia: Analysis of Recovery in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2111--2123.  ",
      "doi": "10.1145/2858036.2858246"
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. #Thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 1201--1213.  ",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. SAGE.",
      "doi": ""
    },
    {
      "text": "Y. Chen, Y. Zhou, S. Zhu, and H. Xu. 2012. Detecting Offensive Language in Social Media to Protect Adolescent Online Safety. In 2012 International Conference on Privacy, Security, Risk and Trust and 2012 International Confernece on Social Computing. 71--80.  ",
      "doi": "10.1109/SocialCom-PASSAT.2012.55"
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Odysseas Constantinou. 2005. Multimodal Discourse Analysis: Media, modes and technologies. 9, 4 (2005), 602--618.",
      "doi": ""
    },
    {
      "text": "Larry Davidson, Maria J. O'Connell, Janis Tondora, Martha Lawless, and Arthur C. Evans. 2005. Recovery in Serious Mental Illness: A New Wine or Just a New Bottle? 36, 5 (oct 2005), 480--487. http: //psycnet.apa.org/buy/2005--13212-004",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Social Media As a Measurement Tool of Depression in Populations. In Proceedings of the 5th Annual ACM Web Science Conference (WebSci '13). ACM, 47--56.  ",
      "doi": "10.1145/2464464.2464480"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J. Horvitz, and Aaron Hoff. 2014. Characterizing and Predicting Postpartum Depression from Shared Facebook Data. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, 626--638.  ",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering Shifts to Suicidal Ideation from Mental Health Content in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Mark Diaz, Isaac Johnson, Amanda Lazar, Anne Marie Piper, and Darren Gergle. 2018. Addressing Age-Related Bias in Sentiment Analysis. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 412:1--412:14.  ",
      "doi": "10.1145/3173574.3173986"
    },
    {
      "text": "Sindhu Kiranmai Ernala, Tristan Labetoulle, Fred Bane, Michael L. Birnbaum, Asra F. Rizvi, John M. Kane, and Munmun De Choudhury. 2018. Characterizing Audience Engagement and Assessing Its Impact on Social Media Disclosures of Mental Illnesses. In Twelfth International AAAI Conference on Web and Social Media. https://www.aaai.org/ ocs/index.php/ICWSM/ICWSM18/paper/view/17884",
      "doi": ""
    },
    {
      "text": "Jordan Eschler, Arpita Bhattacharya, and Wanda Pratt. 2018. Designing a Reclamation of Body and Health: Cancer Survivor Tattoos As Coping Ritual. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 510:1--510:12.  ",
      "doi": "10.1145/3173574.3174084"
    },
    {
      "text": "Jessica L. Feuston and Anne Marie Piper. 2018. Beyond the Coded Gaze: Analyzing Expression of Mental Health and Illness on Instagram. 2 (nov 2018), 51:1--51:21. Issue CSCW.  ",
      "doi": "10.1145/3274320"
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and Oppression in Collaborative Systems. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). ACM, 117--122.  ",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Arthur W Frank. 2013. The wounded storyteller: Body, illness, and ethics. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Alexandra Georgakopoulou. 2015. Small Stories Research. In The Handbook of Narrative Analysis, Ana de Fina and Alexandra Georgakopoulou (Eds.). John Wiley & Sons, 255--271.",
      "doi": ""
    },
    {
      "text": "Ysabel Gerrard. 2018. Beyond the hashtag: Circumventing content moderation on social media. (may 2018), 1461444818776611.",
      "doi": ""
    },
    {
      "text": "Trisha Greenhalgh. 2016. ANNEX 3. A BRIEF HISTORY OF NARRATIVE RESEARCH IN HEALTH CARE. WHO Regional Office for Europe. https://www.ncbi.nlm.nih.gov/books/NBK391070/",
      "doi": ""
    },
    {
      "text": "Jan Zita Grover and Douglas Crimp. 1987. AIDS: Cultural Analysis/Cultural Activism. (1987).",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, 1176--1190.  ",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L Haimson, Kathryn E Ringland, and Gillian R Hayes. 2015. Marginalized Populations and Research Ethics Online. In CSCW Workshop on Ethics for Studying Sociotechnical Systems in a Big Data World (CSCW Workshop on Ethics for Studying Sociotechnical Systems in a Big Data World). 5.",
      "doi": ""
    },
    {
      "text": "Foad Hamidi, Morgan Klaus Scheuerman, and Stacy M Branham. 2018. Gender Recognition or Gender Reductionism?: The Social Implications of Embedded Gender Recognition Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 8.  ",
      "doi": "10.1145/3173574.3173582"
    },
    {
      "text": "Douglas Harper. 2012. Visual Sociology. Routledge. Google-Books-ID: cERcdCCZ4IcC.",
      "doi": ""
    },
    {
      "text": "Su Holmes. 2017. \"My anorexia story\": girls constructing narratives of identity on YouTube. 31, 1 (jan 2017), 1--23.",
      "doi": ""
    },
    {
      "text": "Allan V. Horwitz. 1982. The social control of mental illness. Academic Press. Google-Books-ID: d_MgAQAAIAAJ.",
      "doi": ""
    },
    {
      "text": "Adrienne S. Juarascio, Amber Shoaib, and C. Alix Timko. 2010. ProEating Disorder Communities on Social Networking Sites: A Content Analysis. 18, 5 (sept 2010), 393--407.",
      "doi": ""
    },
    {
      "text": "Arthur Kleinman. 1988. The illness narratives: suffering, healing, and the human condition. Basic books.",
      "doi": ""
    },
    {
      "text": "Gunther Kress and Theo Van Leeuwen. 2001. Multimodal Discourse: The Modes and Media of Contemporary Communication. {Arnold Publishers}. http://www.amazon.ca/exec/obidos/redirect?tag=citeulike0920&path=ASIN/0340608773",
      "doi": ""
    },
    {
      "text": "Guo Li, Xiaomu Zhou, Tun Lu, Jiang Yang, and Ning Gu. 2016. SunForum: Understanding Depression in a Chinese Online Community. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 515--526.  ",
      "doi": "10.1145/2818048.2819994"
    },
    {
      "text": "Knut Lundby. 2008. Digital Storytelling, Mediatized Stories: Selfrepresentations in New Media. Peter Lang. Google-Books-ID: Sl_WM0tVV84C.",
      "doi": ""
    },
    {
      "text": "Lydia Manikonda and Munmun De Choudhury. 2017. Modeling and Understanding Visual Attributes of Mental Health Disclosures in Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 170--181.  ",
      "doi": "10.1145/3025453.3025932"
    },
    {
      "text": "Dan P. McAdams. 2008. Personal narratives and the life story. In Handbook of Personality, Third Edition: Theory and Research, Oliver P. John, Richard W. Robins, and Lawrence A. Pervin (Eds.). Guilford Press, 242--262.",
      "doi": ""
    },
    {
      "text": "Bharat Mehra, Cecelia Merkel, and Ann Peterson Bishop. 2004. The internet for empowerment of minority and marginalized users. 6, 6 (dec 2004), 781--802.",
      "doi": ""
    },
    {
      "text": "Lydia Michie, Madeline Balaam, John McCarthy, Timur Osadchiy, and Kellie Morrissey. 2018. From Her Story, to Our Story: Digital Storytelling As Public Engagement Around Abortion Rights Advocacy in Ireland. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 357:1--357:15.  ",
      "doi": "10.1145/3173574.3173931"
    },
    {
      "text": "B. Sri Nandhini and J. I. Sheeba. 2015. Cyberbullying Detection and Classification Using Information Retrieval Algorithm. In Proceedings of the 2015 International Conference on Advanced Research in Computer Science Engineering & Technology (ICARCSET 2015) (ICARCSET '15). ACM, 20:1--20:5.  ",
      "doi": "10.1145/2743065.2743085"
    },
    {
      "text": "Khushnood Naqshbandi, David N. Milne, Ben Davies, Sophie Potter, Rafael A. Calvo, and Simon Hoermann. 2016. Helping Young People Going Through Tough Times: Perspectives for a Peer-to-peer Chat Support System. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI '16). ACM, 640--642.  ",
      "doi": "10.1145/3010915.3011848"
    },
    {
      "text": "Kathleen O'Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, 1470--1484.  ",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Petar Opali-. 2007. INFORMAL AND FORMAL SOCIAL CONTROL OF MENTALLY ILL PERSONS. 55, 3 (2007), 78--92. https: //www.ceeol.com/search/article-detail?id=602416",
      "doi": ""
    },
    {
      "text": "Lawrence A. Palinkas, Sarah M. Horwitz, Carla A. Green, Jennifer P. Wisdom, Naihua Duan, and Kimberly Hoagwood. 2015. Purposeful Sampling for Qualitative Data Collection and Analysis in Mixed Method Implementation Research. 42, 5 (sept 2015), 533--544.",
      "doi": ""
    },
    {
      "text": "Minsu Park, David W McDonald, and Meeyoung Cha. {n. d.}. Perception Differences between the Depressed and Non-Depressed Users in Twitter. ({n. d.}), 10.",
      "doi": ""
    },
    {
      "text": "Jessica Pater and Elizabeth Mynatt. 2017. Defining Digital Self-Harm. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, 1501--1513.  ",
      "doi": "10.1145/2998181.2998224"
    },
    {
      "text": "Jessica A. Pater, Oliver L. Haimson, Nazanin Andalibi, and Elizabeth D. Mynatt. 2016. \"Hunger Hurts but Starving Works\": Characterizing the Presentation of Eating Disorders Online. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, 1185--1200.  ",
      "doi": "10.1145/2818048.2820030"
    },
    {
      "text": "Jessica A. Pater, Moon K. Kim, Elizabeth D. Mynatt, and Casey Fiesler. 2016. Characterizations of Online Harassment: Comparing Policies Across Social Media Platforms. In Proceedings of the 19th International Conference on Supporting Group Work (GROUP '16). ACM, 369--374.  ",
      "doi": "10.1145/2957276.2957297"
    },
    {
      "text": "Cassandra Phoenix and Andrew C. Sparkes. 2009. Being Fred: big stories, small stories and the accomplishment of a positive ageing identity. 9, 2 (apr 2009), 219--236.",
      "doi": ""
    },
    {
      "text": "Lee Rainie. 2017. Digital Divides Feeding America | Pew Research Center. http://www.pewinternet.org/2017/02/09/digital-dividesfeeding-america/",
      "doi": ""
    },
    {
      "text": "Julian Rappaport. 1993. Narrative Studies, Personal Stories, and Identity Transformation in the Mutual Help Context. 29, 2 (june 1993), 239--256.",
      "doi": ""
    },
    {
      "text": "Bryce J Renninger. 2015. \"Where I can be myself where I can speak my mind\" : Networked counterpublics in a polymedia environment. 17, 9 (oct 2015), 1513--1529.",
      "doi": ""
    },
    {
      "text": "Catherine Kohler Riessman. 1990. Strategic uses of narrative in the presentation of self and illness: A research note. Social science & medicine 30, 11 (1990), 1195--1200.",
      "doi": ""
    },
    {
      "text": "Catherine Kohler Riessman. 2003. Analysis of Personal Narratives. In Inside Interviewing: New Lenses, New Concerns, James Holstein and Jaber F. Gubrium (Eds.). SAGE, 331--346.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Kenton P O'Hara, and Alex S Taylor. 2018. Let's Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 315.  ",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Andrew Scull. 1991. Psychiatry and social control in the nineteenth and twentieth centuries. 2, 6 (june 1991), 149--169.",
      "doi": ""
    },
    {
      "text": "Yukari Seko and Stephen P Lewis. 2018. The self-harmed, visualized, and reblogged: Remaking of self-injury narratives on Tumblr. 20, 1 (jan 2018), 180--198.",
      "doi": ""
    },
    {
      "text": "Thomas Smyth and Jill Dimond. 2014. Anti-oppressive Design. 21, 6 (oct 2014), 68--71.  ",
      "doi": "10.1145/2668969"
    },
    {
      "text": "Stephanie Tierney. 2006. The Dangers and Draw of Online Communication: Pro-Anorexia Websites and their Implications for Users, Practitioners, and Researchers. 14, 3 (may 2006), 181--190.",
      "doi": ""
    },
    {
      "text": "Natalie M. Underberg and Elayne Zorn. 2013. Digital Ethnography: Anthropology, Narrative, and New Media. University of Texas Press. Google-Books-ID: NqmOeY04twYC. ",
      "doi": "10.5555/2675673"
    },
    {
      "text": "Karl Vick. 2017. The Digital Divide: A Quarter of the Nation Is Without Broadband. http://time.com/4718032/the-digital-divide/",
      "doi": ""
    },
    {
      "text": "Nils B. Weidmann, Suso Benitez-Baleato, Philipp Hunziker, Eduard Glatz, and Xenofontas Dimitropoulos. 2016. Digital discrimination: Political bias in Internet service provision across ethnic groups. 353, 6304 (sept 2016), 1151--1155.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Casey Fiesler, Libby Hemphill, Munmun De Choudhury, and J. Nathan Matias. 2017. How to Handle Online Risks?: Discussing Content Curation and Moderation in Social Media. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, 1271--1276.  ",
      "doi": "10.1145/3027063.3051141"
    },
    {
      "text": "Peter Wright and John McCarthy. 2010. Experience-Centered Design: Designers, Users, and Communities in Dialogue. Morgan and Claypool Publishers. ",
      "doi": "10.5555/1855065"
    },
    {
      "text": "Jillian C. York and Karen Gullo. 2018. Offline/Online Project Highlights How the Oppression Marginalized Communities Face in the Real World Follows Them Online. https://www.eff.org/deeplinks/2018/03/offlineonline-projecthighlights-how-oppression-marginalized-communities-face-real",
      "doi": ""
    },
    {
      "text": "Kimball Young. 1949. Sociology: A Study of Society and Culture. American Book Company.",
      "doi": ""
    },
    {
      "text": "Renwen Zhang, Jordan Eschler, and Madhu Reddy. 2018. Online Support Groups for Depression in China: Culturally Shaped Interactions and Motivations. 27, 3 (dec 2018), 327--354.  ",
      "doi": "10.1007/s10606-018-9322-4"
    }
  ]
}