{
  "doi": "10.1145/3290605.3300797",
  "title": "FiberWire: Embedding Electronic Function into 3D Printed Mechanically Strong, Lightweight Carbon Fiber Composite Objects",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "3D printing offers significant potential in creating highly customized interactive and functional objects. However, at present ability to manufacture functional objects is limited by available materials (e.g., various polymers) and their process properties. For instance, many functional objects need stronger materials which may be satisfied with metal printers. However, to create wholly interactive devices, we need both conductors and insulators to create wiring, and electronic components to complete circuits. Unfortunately, the single material nature of metal printing, and its inherent high temperatures, preclude this. Thus, in 3D printed devices, we have had a choice of strong materials, or embedded interactivity, but not both. In this paper, we introduce a set of techniques we call FiberWire, which leverages a new commercially available capability to 3D print carbon fiber composite objects. These objects are light weight and mechanically strong, and our techniques demonstrate a means to embed circuitry for interactive devices within them. With FiberWire, we describe a fabrication pipeline takes advantage of laser etching and fiber printing between layers of carbon-fiber composite to form low resistance conductors, thereby enabling the fabrication of electronics directly embedded into mechanically strong objects. Utilizing the fabrication pipeline, we show a range of sensor designs, their performance characterization on these new materials and finally three fully printed example object that are both interactive and mechanically strong -- a bicycle handle bar with interactive controls, a swing and impact sensing golf club and an interactive game controller (Figure 1).",
  "tags": [
    "embedded electronics",
    "carbon-fiber composites",
    "fabrication",
    "material processing",
    "3d printing"
  ],
  "authors": [
    {
      "name": "Saiganesh Swaminathan",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-87958701357/rel-imgonly/87958701357.jpg",
      "acmid": "87958701357",
      "orcid": "missing"
    },
    {
      "name": "Kadri Bugra Ozutemiz",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366368",
      "orcid": "missing"
    },
    {
      "name": "Carmel Majidi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459792257",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "2019. ANISOPRINT. http://anisoprint.ru/. {Online; accessed 6-January2019}.",
      "doi": ""
    },
    {
      "text": "2019. Carbon-fiber Strength Data. https://static.markforged.com/ markforged_composites_datasheet.pdf. {Online; accessed 6-January2019}.",
      "doi": ""
    },
    {
      "text": "2019. Markforged Product Details. https://markforged.com/materials/ composites/. {Online; accessed 6-January-2019}.",
      "doi": ""
    },
    {
      "text": "2019. PLA Strength Data. http://tinyurl.com/PLAVoxel8. {Online; accessed 6-January-2019}.",
      "doi": ""
    },
    {
      "text": "2019. SLCOM1. https://envisiontec.com/3d-printers/slcom-1/slcom-1/. {Online; accessed 6-January-2019}.",
      "doi": ""
    },
    {
      "text": "2019. Voxel8. https://www.voxel8.com/. {Online; accessed 6-January2019}.",
      "doi": ""
    },
    {
      "text": "Rodrigo R de Assis and Ildefonso Bianchi. 2012. Analysis of microstrip antennas on carbon fiber composite material. Journal of Microwaves, Optoelectronics and Electromagnetic Applications 11, 1 (2012), 154--161.",
      "doi": ""
    },
    {
      "text": "Davis S De Lorenzo and ML Hull. 1999. Quantification of structural loading during off-road cycling. Journal of Biomechanical Engineering 121, 4 (1999), 399--405.",
      "doi": ""
    },
    {
      "text": "Yuliang Deng, Michael G Pecht, Joseph A Swift, and Stanley J Wallace. 2007. Carbon fiber-based grid array interconnects. IEEE Transactions on Components and Packaging Technologies 30, 4 (2007), 716--723.",
      "doi": ""
    },
    {
      "text": "RW Evans. 1997. Design guidelines for shielding effectiveness, current carrying capability, and the enhancement of conductivity of composite materials. (1997).",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S Reynolds, and Joshua R Smith. 2017. Finding common ground: A survey of capacitive sensing in human-computer interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3293--3315.  ",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit stickers: peeland-stick construction of interactive electronic prototypes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1743--1746.  ",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 529--539.  ",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Alexandra Ion, Ludwig Wall, Robert Kovacs, and Patrick Baudisch. 2017. Digital mechanical metamaterials. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 977--988.  ",
      "doi": "10.1145/3025453.3025624"
    },
    {
      "text": "Eun-Beom Jeon, Takahiro Fujimura, Kosuke Takahashi, and Hak-Sung Kim. 2014. An investigation of contact resistance between carbon fiber/epoxy composite laminate and printed silver electrode for damage monitoring. Composites Part A: Applied Science and Manufacturing 66 (2014), 193--200.",
      "doi": ""
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S Cook, Cheng Zhang, and Gregory D Abowd. 2013. Instant inkjet circuits: lab-based inkjet printing to support rapid prototyping of UbiComp devices. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, et al. 2017. Trussfab: Fabricating sturdy large-scale structures on desktop 3d printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2606--2616.  ",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Stephen M Lipka. 1997. Electrochemical capacitors utilizing low surface area carbon fiber. IEEE Aerospace and Electronic Systems Magazine 12, 7 (1997), 27--30.",
      "doi": ""
    },
    {
      "text": "Shengli Liu. 2001. Carbon fiber contactor in polymer resistive position sensors. In Electrical Contacts, 2001. Proceedings of the Forty-Seventh IEEE Holm Conference on. IEEE, 282--287.",
      "doi": ""
    },
    {
      "text": "Pankar K Mallick. 2007. Fiber-reinforced composites: materials, manufacturing, and design. CRC press.",
      "doi": ""
    },
    {
      "text": "CP Neo and VK Varadan. 2001. Design and development of electromagnetic absorbers with carbon fiber composites and matching dielectric layers. Smart materials and structures 10, 5 (2001), 1107.",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis, and Hiroshi Ishii. 2016. Cilllia: 3D printed micro-pillar structures for surface texture, actuation and sensing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5753--5764.  ",
      "doi": "10.1145/2858036.2858257"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: an integrated approach for embedding electronics in paper designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2457--2466.  ",
      "doi": "10.1145/2702123.2702487"
    },
    {
      "text": "Elliot J Riley, Erik H Lenzing, and Ram M Narayanan. 2014. Characterization of carbon fiber composite materials for RF applications. In Radar Sensor Technology XVIII, Vol. 9077. International Society for Optics and Photonics, 907704.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A fabrication pipeline to design and 3D print capacitive touch sensors for interactive objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 253--258.  ",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Robert F Stinson and Joseph A Sarro. 2002. The use of carbon fiber composites in sliding contacts. In Electrical Contacts, 2002. Proceedings of the Forty-Eighth IEEE Holm Conference on. IEEE, 175--183.",
      "doi": ""
    },
    {
      "text": "Tatyana Vasilevitsky and Amit Zoran. 2016. Steel-sense: Integrating machine elements with sensors by additive manufacturing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5731--5742.  ",
      "doi": "10.1145/2858036.2858309"
    },
    {
      "text": "Shoukai Wang and DDL Chung. 2006. Self-sensing of flexural strain and damage in carbon fiber polymer-matrix composite by electrical resistance measurement. Carbon 44, 13 (2006), 2739--2751.",
      "doi": ""
    },
    {
      "text": "Daniel Wigdor et al. 2015. Printem: Instant Printed Circuit Boards with Standard Office Printers & Inks. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 243--251.  ",
      "doi": "10.1145/2807442.2807511"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, and Ivan Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 589--598.  ",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. BioLogic: natto cells as nanoactuators for shape changing interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1--10.  ",
      "doi": "10.1145/2702123.2702611"
    }
  ]
}