{
  "doi": "10.1145/3290605.3300852",
  "title": "Interactive Body-Driven Graphics for Augmented Video Performance",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We present a system that augments live presentation videos with interactive graphics to create a powerful and expressive storytelling environment. Using our system, the presenter interacts with the graphical elements in real-time with gestures and postures, thus leveraging our innate, everyday skills to enhance our communication capabilities with the audience. However, crafting such an interactive and expressive performance typically requires programming, or highly-specialized tools tailored for experts. Our core contribution is a flexible, direct manipulation UI which enables amateurs and experts to craft such presentations beforehand by mapping a variety of body movements to a wide range of graphical manipulations. By simplifying the mapping between gestures, postures, and their corresponding output effects, our UI enables users to craft customized, rich interactions with the graphical elements. Our user study demonstrates the potential usage and unique affordance of this mixed-reality medium for storytelling and presentation across a range of application domains.",
  "authors": [
    {
      "name": "Nazmus Saquib",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500662130",
      "orcid": "missing"
    },
    {
      "name": "Rubaiat Habib Kazi",
      "institution": "Adobe Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484645237",
      "orcid": "missing"
    },
    {
      "name": "Li-Yi Wei",
      "institution": "Adobe Research, San Jose, CA, USA",
      "img": "/do/10.1145/contrib-81452594229/rel-imgonly/yilan_card_head_square.png",
      "acmid": "81452594229",
      "orcid": "missing"
    },
    {
      "name": "Wilmot Li",
      "institution": "Adobe, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100480929",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2012. The Inexplicable Universe: Unsolved Mysteries. https://www. netflix.com/title/70305069. Accessed: 2019-01-07.",
      "doi": ""
    },
    {
      "text": "2012. Microsoft: Your Potential, Our Passion. https://www.youtube. com/watch?v=it-Vt2M_-ZU. Accessed: 2019-01-07.",
      "doi": ""
    },
    {
      "text": "2013. Hans Rosling: The River of Myths. https://www.youtube.com/ watch?v=lYpX4l2UeZg. Accessed: 2019-01-07.",
      "doi": ""
    },
    {
      "text": "2018. Adobe After Effects. https://www.adobe.com/products/ aftereffects.html. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. Adobe Animate. https://www.adobe.com/products/animate.html. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. D3.js, Data-Driven Documents. https://d3js.org/. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. Flash with ActionScript 3.0. https://www.adobe.com/devnet/ actionscript/documentation.html. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. openFrameworks, C++ toolkit for creative coding. https:// openframeworks.cc/. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. Processing. https://processing.org/. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. Unity. https://unity3d.com/. Accessed: 2018-09--20.",
      "doi": ""
    },
    {
      "text": "2018. The Weather Channel's new storm graphics are totally insane. https://www.fastcompany.com/90176637/ the-weather-channels-new-storm-graphics-are-totally-insane. Accessed: 2019-01-07.",
      "doi": ""
    },
    {
      "text": "Adobe. 2018. Adobe Character Animator. https://www.adobe.com/ products/character-animator.html.",
      "doi": ""
    },
    {
      "text": "Roland Aigner, Daniel Wigdor, Hrvoje Benko, Michael Haller, David Lindbauer, Alexandra Ion, Shengdong Zhao, and JTKV Koh. 2012. Understanding mid-air hand gestures: A study of human preferences in usage of gesture types for hci. Microsoft Research TechReport MSRTR-2012--111 2 (2012).",
      "doi": ""
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: enhancing movement training with an augmented reality mirror. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 311--320.  ",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Thomas Baudel and Michel Beaudouin-Lafon. 1993. Charade: remote control of objects using free-hand gestures. Commun. ACM 36, 7 (1993), 28--35.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Hrvoje Benko, Ricardo Jota, and Andrew Wilson. 2012. MirageTable: freehand interaction on a projected augmented reality tabletop. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 199--208.  ",
      "doi": "10.1145/2207676.2207704"
    },
    {
      "text": "Tobias Blum, Valerie Kleeberger, Christoph Bichlmeier, and Nassir Navab. 2012. mirracle: An augmented reality magic mirror system for anatomy education. In Virtual Reality Short Papers and Posters (VRW), 2012 IEEE. IEEE, 115--116.  ",
      "doi": "10.1109/VR.2012.6180909"
    },
    {
      "text": "William Buxton, Mark Billinghurst, Yves Guiard, Abigail Sellen, and Shumin Zhai. 2002. Human input to computer systems: theories, techniques and technology. Manuscrito de livro em andamento, sem editora (2002).",
      "doi": ""
    },
    {
      "text": "Zhe Cao, Tomas Simon, Shih-En Wei, and Yaser Sheikh. 2017. Realtime Multi-Person 2D Pose Estimation using Part Affinity Fields. In CVPR.",
      "doi": ""
    },
    {
      "text": "Jiawen Chen, Shahram Izadi, and Andrew Fitzgibbon. 2012. KinÊTre: Animating the World with the Human Body. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 435--444.  ",
      "doi": "10.1145/2380116.2380171"
    },
    {
      "text": "CNet. 2016. How Cartoon Donald Trump comes to life on 'The Late Show'. https://www.cnet.com/news/ cartoon-donald-trump-late-show-stephen-colbert/.",
      "doi": ""
    },
    {
      "text": "CNN Money. 2018. This is what a trade war looks like. https: //youtu.be/VA-LdvH35Uk.",
      "doi": ""
    },
    {
      "text": "Richard C Davis, Brien Colwell, and James A Landay. 2008. K-sketch: a'kinetic'sketch pad for novice animators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 413--422.  ",
      "doi": "10.1145/1357054.1357122"
    },
    {
      "text": "Mira Dontcheva, Gary Yngve, and Zoran Popovic. 2003. Layered Acting for Character Animation. In ACM SIGGRAPH 2003 Papers (SIGGRAPH '03). ACM, New York, NY, USA, 409--416.  ",
      "doi": "10.1145/1201775.882285"
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Nicholas Gillian, R Benjamin Knapp, and Sile O'Modhrain. 2011. An adaptive classification algorithm for semiotic musical gestures. Citeseer.",
      "doi": ""
    },
    {
      "text": "Robert Held, Ankit Gupta, Brian Curless, and Maneesh Agrawala. 2012. 3D puppetry: a kinect-based interface for 3D animation.. In UIST. Citeseer, 423--434.  ",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Takeo Igarashi, Tomer Moscovich, and John F. Hughes. 2005. As-rigidas-possible Shape Manipulation. ACM Trans. Graph. 24, 3 (July 2005), 1134--1141.  ",
      "doi": "10.1145/1073204.1073323"
    },
    {
      "text": "Seokbin Kang, Leyla Norooz, Vanessa Oguamanam, Angelisa C Plane, Tamara L Clegg, and Jon E Froehlich. 2016. SharedPhys: Live Physiological Sensing, Whole-Body Interaction, and Large-Screen Visualizations to Support Shared Inquiry Experiences. In Proceedings of the The 15th International Conference on Interaction Design and Children. ACM, 275--287.  ",
      "doi": "10.1145/2930674.2930710"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2014. Kitty: Sketching Dynamic and Interactive Illustrations. In UIST '14. 395--405.  ",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, Shengdong Zhao, and George Fitzmaurice. 2014. Draco: Bringing Life to Illustrations with Kinetic Textures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 351--360.  ",
      "doi": "10.1145/2556288.2556987"
    },
    {
      "text": "Rubaiat Habib Kazi, Kien Chuan Chua, Shengdong Zhao, Richard Davis, and Kok-Lim Low. 2011. SandCanvas: a multi-touch art medium inspired by sand animation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1283--1292.  ",
      "doi": "10.1145/1978942.1979133"
    },
    {
      "text": "Han-Jong Kim, Chang Min Kim, and Tek-Jin Nam. 2018. SketchStudio: Experience Prototyping with 2.5-Dimensional Animated Design Scenarios. In DIS '18. 831--843.  ",
      "doi": "10.1145/3196709.3196736"
    },
    {
      "text": "Yoshikage Kira. 2018. Transportation history. https://youtu.be/ IB3pdb3yXuY.",
      "doi": ""
    },
    {
      "text": "Myron W Krueger, Thomas Gionfriddo, and Katrin Hinrichsen. 1985. VIDEOPLACE-an artificial reality. In ACM SIGCHI Bulletin, Vol. 16. ACM, 35--40.  ",
      "doi": "10.1145/1165385.317463"
    },
    {
      "text": "James A Landay and Brad A Myers. 1995. Interactive sketching for the early stages of user interface design. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/AddisonWesley Publishing Co., 43--50.  ",
      "doi": "10.1145/223904.223910"
    },
    {
      "text": "Bongshin Lee, Rubaiat Habib Kazi, and Greg Smith. 2013. SketchStory: Telling more engaging stories with data through freeform sketching. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2416--2425.  ",
      "doi": "10.1109/TVCG.2013.191"
    },
    {
      "text": "Sang Won Lee, Yujin Zhang, Isabelle Wong, Yiwei Yang, Stephanie D. O'Keefe, and Walter S. Lasecki. 2017. SketchExpress: Remixing Animations for More Effective Crowd-Powered Prototyping of Interactive Interfaces. In UIST '17. 817--828.  ",
      "doi": "10.1145/3126594.3126595"
    },
    {
      "text": "Fabrice Matulic, Lars Engeln, Christoph Träger, and Raimund Dachselt. 2016. Embodied interactions for novel immersive presentational experiences. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1713--1720.  ",
      "doi": "10.1145/2851581.2892501"
    },
    {
      "text": "NewscastStudio. 2017. Weather Solutions: 4 of today's leading weather software systems. https://www.newscaststudio.com/2017/06/21/ tv-weather-solutions/.",
      "doi": ""
    },
    {
      "text": "Ken Perlin. 2016. The Coming Age of Computer Graphics. In Sanders Series Lecture. TUX.",
      "doi": ""
    },
    {
      "text": "Ken Perlin, Zhenyi He, and Karl Rosenberg. 2018. Chalktalk : A Visualization and Communication Language -- As a Tool in the Domain of Computer Science Education. ArXiv e-prints (Sept. 2018). arXiv:cs.HC/1809.07166",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, et al. 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60--67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Thad Starner, Joshua Weaver, and Alex Pentland. 1998. Real-time american sign language recognition using desk and wearable computer based video. IEEE Transactions on pattern analysis and machine intelligence 20, 12 (1998), 1371--1375.  ",
      "doi": "10.1109/34.735811"
    },
    {
      "text": "Christian Steins, Sean Gustafson, Christian Holz, and Patrick Baudisch. 2013. Imaginary devices: gesture-based interaction mimicking traditional input devices. In Proceedings of the 15th international conference on Human-computer interaction with mobile devices and services. ACM, 123--126.  ",
      "doi": "10.1145/2493190.2493208"
    },
    {
      "text": "Daniel Wigdor, Hrvoje Benko, John Pella, Jarrod Lombardo, and Sarah Williams. 2011. Rock & rails: extending multi-touch interactions with shape gestures to enable precise spatial manipulations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1581--1590.  ",
      "doi": "10.1145/1978942.1979173"
    },
    {
      "text": "Nora S. Willett, Wilmot Li, Jovan Popovic, and Adam Finkelstein. 2017. Triggering Artwork Swaps for Live Animation. In UIST '17. 85--95.  ",
      "doi": "10.1145/3126594.3126596"
    },
    {
      "text": "Andrew D Wilson and Hrvoje Benko. 2010. Combining multiple depth cameras and projectors for interactions on, above and between surfaces. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 273--282.  ",
      "doi": "10.1145/1866029.1866073"
    },
    {
      "text": "Andrew D Wilson, Shahram Izadi, Otmar Hilliges, Armando GarciaMendoza, and David Kirk. 2008. Bringing physics to the surface. In Proceedings of the 21st annual ACM symposium on User interface software and technology. ACM, 67--76.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Yukang Yan, Chun Yu, Xiaojuan Ma, Xin Yi, Ke Sun, and Yuanchun Shi. 2018. VirtualGrasp: Leveraging Experience of Interacting with Physical Objects to Facilitate Digital Object Retrieval. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 78.  ",
      "doi": "10.1145/3173574.3173652"
    },
    {
      "text": "Qi Yang and Georg Essl. 2015. Representation-Plurality in Multi-Touch Mobile Visual Programming for Music. In NIME 2015. The School of Music and the Center for Computation and Technology (CCT), Louisiana State University, Baton Rouge, Louisiana, USA, 369--373. http://dl.acm.org/citation.cfm?id=2993778.2993872 ",
      "doi": "10.5555/2993778.2993872"
    },
    {
      "text": "Bo Zhu, Michiaki Iwata, Ryo Haraguchi, Takashi Ashihara, Nobuyuki Umetani, Takeo Igarashi, and Kazuo Nakazawa. 2011. Sketch-based dynamic illustration of fluid systems. In ACM Transactions on Graphics (TOG), Vol. 30. ACM, 134.  ",
      "doi": "10.1145/2070781.2024168"
    }
  ]
}