{
  "doi": "10.1145/3290605.3300754",
  "title": "The Impact of Web Browser Reader Views on Reading Speed and User Experience",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "As reading increasingly shifts from paper to online media, many web browsers now provide a \"Reader View,'' which modifies web page layout and design for better readability. However, research has yet to establish whether Reader Views are effective in improving readability and how they might change the user experience. We characterize how Mozilla Firefox's Reader View significantly reduces the visual complexity of websites by excluding menus, images, and content. We then conducted an online study with 391 participants (including 42 who self-reported having been diagnosed with dyslexia), showing that compared to standard websites the Reader View increased reading speed by 5% for readers on average, and significantly improved perceived readability and visual appeal. We suggest guidelines for the design of websites and browsers that better support people with varying reading skills.",
  "authors": [
    {
      "name": "Qisheng Li",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659134609",
      "orcid": "missing"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Adam Fourney",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81330490871/rel-imgonly/adamfo.png",
      "acmid": "81330490871",
      "orcid": "missing"
    },
    {
      "name": "Kevin Larson",
      "institution": "Microsoft, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100470644",
      "orcid": "missing"
    },
    {
      "name": "Katharina Reinecke",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583575",
      "orcid": "0000-0001-7897-9325"
    }
  ],
  "references": [
    {
      "text": "Apple. 2018. Working with Safari Reader. https: //developer.apple.com/library/archive/documentation/Tools/ Conceptual/SafariExtensionGuide/WorkingWiththeReader/WorkingWiththeReader.html Accessed 15-September-2018.",
      "doi": ""
    },
    {
      "text": "International Dyslexia Association. 2017. Dyslexia Basics. https: //dyslexiaida.org/dyslexia-basics Accessed 31-August-2018.",
      "doi": ""
    },
    {
      "text": "Fakhrul Anuar Aziz and Husniza Husni. 2012. Interaction design for dyslexic children reading application: a guideline. (2012).",
      "doi": ""
    },
    {
      "text": "Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate: a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society. Series B (Methodological) (1995), 289--300.",
      "doi": ""
    },
    {
      "text": "Patricia Greig Bowers and Maryanne Wolf. 1993. Theoretical links among naming speed, precise timing mechanisms and orthographic skill in dyslexia. Reading and Writing 5, 1 (1993), 69--85.",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. 2008. Web Content Accessibility Guidelines (WCAG) 2.0. https://www.w3.org/TR/WCAG20/ Accessed 10-September-2018.",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. 2018. CSS Values and Units Module Level 4. https://www.w3.org/TR/css-values/#px Accessed 10September-2018.",
      "doi": ""
    },
    {
      "text": "Anthony Creed, Ian Dennis, and Stephen Newstead. 1987. Proofreading on VDUs. Behaviour & Information Technology 6, 1 (1987), 3--13.",
      "doi": ""
    },
    {
      "text": "Lee J Cronbach. 1951. Coefficient alpha and the internal structure of tests. Psychometrika 16, 3 (1951), 297--334.",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Edward Cutrell. 2001. Subjective duration assessment: An implicit probe for software usability. In Proceedings of IHM-HCI 2001 conference, Vol. 2. 167--170.",
      "doi": ""
    },
    {
      "text": "Meredyth Daneman and Patricia A Carpenter. 1980. Individual differences in working memory and reading. Journal of Verbal Learning and Verbal Behavior 19, 4 (1980), 450--466.",
      "doi": ""
    },
    {
      "text": "Andrew Dillon. 1992. Reading from paper versus screens: A critical review of the empirical literature. Ergonomics 35, 10 (1992), 1297--1326.",
      "doi": ""
    },
    {
      "text": "Mary Dyson and Mark Haselgrove. 2000. The effects of reading speed and reading patterns on the understanding of text read from screen. Journal of Research in Reading 23, 2 (2000), 210--223.",
      "doi": ""
    },
    {
      "text": "Mary C Dyson. 2004. How physical text layout affects reading from screen. Behaviour & Information Technology 23, 6 (2004), 377--393.",
      "doi": ""
    },
    {
      "text": "Mary C Dyson and Gary J Kipping. 1997. The legibility of screen formats: are three columns better than one? Computers & Graphics 21, 6 (1997), 703--712.",
      "doi": ""
    },
    {
      "text": "Adam Fourney, Meredith Ringel Morris, Abdullah Ali, and Laura Vonessen. 2018. Assessing the Readability of Web Search Results for Searchers with Dyslexia. In The 41st International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '18). ACM, New York, NY, USA, 1069--1072.  ",
      "doi": "10.1145/3209978.3210072"
    },
    {
      "text": "Peter Gregor, Anna Dickinson, Alison Macaffer, and Peter Andreasen. 2003. SeeWord -- a personal word processing environment for dyslexic computer users. British Journal of Educational Technology 34, 3 (2003), 341--355.",
      "doi": ""
    },
    {
      "text": "Stefan Hawelka and Heinz Wimmer. 2005. Impaired visual processing of multi-element arrays is associated with increased number of eye movements in dyslexic reading. Vision Research 45, 7 (2005), 855--863.",
      "doi": ""
    },
    {
      "text": "Alexa Internet Inc. 2017. The Alexa Top Sites Services. http://www. alexa.com/topsites Accessed 15-August-2018.",
      "doi": ""
    },
    {
      "text": "James E Jackson. 2014. Towards Universally Accessible Typography: A Review of Research on Dyslexia. (2014).",
      "doi": ""
    },
    {
      "text": "Joseph R Jenkins, Lynn S Fuchs, Paul Van Den Broek, Christine Espin, and Stanley L Deno. 2003. Sources of individual differences in reading comprehension and reading fluency. Journal of Educational Psychology 95, 4 (2003), 719.",
      "doi": ""
    },
    {
      "text": "Sung Jun Joo, Alex L White, Douglas J Strodtman, and Jason D Yeatman. 2018. Optimizing text for an individual's visual system: The contribution of visual crowding to reading difficulties. Cortex 103 (2018), 291--301.",
      "doi": ""
    },
    {
      "text": "J Peter Kincaid, Robert P Fishburne Jr, Richard L Rogers, and Brad S Chissom. 1975. Derivation of new readability formulas (automated readability index, fog count and flesch reading ease formula) for navy enlisted personnel. (1975).",
      "doi": ""
    },
    {
      "text": "Yiren Kong, Young Sik Seo, and Ling Zhai. 2018. Comparison of reading performance on screen and on paper: A meta-analysis. Computers & Education 123 (2018), 138--149.",
      "doi": "10.1016/j.compedu.2018.05.005"
    },
    {
      "text": "Sri Hastuti Kurniawan and Panayiotis Zaphiris. 2001. Reading online or on paper: Which is faster? (2001).",
      "doi": ""
    },
    {
      "text": "Kevin Larson and Rosalind Picard. 2005. The aesthetics of reading. In Appears in Human-Computer Interaction Consortium Conference, Snow Mountain Ranch, Fraser, Colorado.",
      "doi": ""
    },
    {
      "text": "Talia Lavie and Noam Tractinsky. 2004. Assessing Dimensions of Perceived Visual Aesthetics of Web Sites. Int. J. Hum.-Comput. Stud. 60, 3 (March 2004), 269--298.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "Seija Leinonen, Kurt Müller, Paavo HT Leppänen, Mikko Aro, Timo Ahonen, and Heikki Lyytinen. 2001. Heterogeneity in adult dyslexic readers: Relating processing skills to the speed and accuracy of oral text reading. Reading and Writing 14, 3--4 (2001), 265--296.",
      "doi": ""
    },
    {
      "text": "Lori A Lott, Marilyn E Schneck, Gunilla Haegerström-portnoy, John A Brabyn, Ginny L Gildengorin, Catherine G West, et al. 2001. Reading performance in older adults with good acuity. Optometry and Vision Science 78, 5 (2001), 316--324.",
      "doi": ""
    },
    {
      "text": "Sascha Mahlke. 2008. Visual aesthetics and the user experience. In The Study of Visual Aesthetics in Human-Computer Interaction (Dagstuhl Seminar Proceedings), Marc Hassenzahl, Gitte Lindgaard, Axel Platz, and Noam Tractinsky (Eds.). Schloss Dagstuhl - Leibniz-Zentrum fuer Informatik, Germany, Dagstuhl, Germany. http://drops.dagstuhl.de/ opus/volltexte/2008/1624",
      "doi": ""
    },
    {
      "text": "Rahmatri Mardiko. 2018. Project VizWeb. https://bitbucket.org/ rmardiko/vizweb Accessed 11-September-2018.",
      "doi": ""
    },
    {
      "text": "Ignatius G Mattingly, J Kavanagh, and I Mattingly. 1972. Reading, the linguistic process, and linguistic awareness. (1972).",
      "doi": ""
    },
    {
      "text": "Microsoft. 2017. Reading View. https://docs.microsoft.com/en-us/ microsoft-edge/dev-guide/browser-features/reading-view Accessed 15-September-2018.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Learning Tools. https://www.microsoft.com/en-us/ education/products/learning-tools Accessed 10-September-2018.",
      "doi": ""
    },
    {
      "text": "Aliaksei Miniukovich, Antonella De Angeli, Simone Sulpizio, and Paola Venuti. 2017. Design Guidelines for Web Readability. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 285--296.  ",
      "doi": "10.1145/3064663.3064711"
    },
    {
      "text": "Meredith Ringel Morris, Adam Fourney, Abdullah Ali, and Laura Vonessen. 2018. Understanding the Needs of Searchers with Dyslexia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 35, 12 pages.  ",
      "doi": "10.1145/3173574.3173609"
    },
    {
      "text": "Mozilla. 2018. Firefox Reader View for Clutter-free Web Pages. https://support.mozilla.org/en-US/kb/ firefox-reader-view-clutter-free-web-pages Accessed 23-June2018.",
      "doi": ""
    },
    {
      "text": "Kate Nation and Margaret J Snowling. 1998. Semantic processing and the development of word-recognition skills: Evidence from children with reading comprehension difficulties. Journal of Memory and Language 39, 1 (1998), 85--101.",
      "doi": ""
    },
    {
      "text": "Jan M Noyes and Kate J Garland. 2008. Computer- vs. paper-based tasks: Are they equivalent? Ergonomics 51, 9 (2008), 1352--1375.",
      "doi": ""
    },
    {
      "text": "Lorraine A Ramig. 1983. Effects of physiological aging on speaking and reading rates. Journal of communication disorders 16, 3 (1983), 217--226.",
      "doi": ""
    },
    {
      "text": "Keith Rayner, Elizabeth R Schotter, Michael EJ Masson, Mary C Potter, and Rebecca Treiman. 2016. So much to read, so little time: How do we read, and can speed reading help? Psychological Science in the Public Interest 17, 1 (2016), 4--34.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z. Gajos. 2014. Quantifying Visual Preferences Around the World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Katharina Reinecke, Tom Yeh, Luke Miratrix, Rahmatri Mardiko, Yuechen Zhao, Jenny Liu, and Krzysztof Z. Gajos. 2013. Predicting Users' First Impressions of Website Aesthetics with a Quantification of Perceived Visual Complexity and Colorfulness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2049--2058.  ",
      "doi": "10.1145/2470654.2481281"
    },
    {
      "text": "Luz Rello. 2015. Dyslexia and Web Accessibility: Synergies and Challenges. In Proceedings of the 12th Web for All Conference (W4A '15). ACM, New York, NY, USA, Article 9, 4 pages.  ",
      "doi": "10.1145/2745555.2746655"
    },
    {
      "text": "Luz Rello and Ricardo Baeza-Yates. 2013. Good Fonts for Dyslexia. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, Article 14, 8 pages.  ",
      "doi": "10.1145/2513383.2513447"
    },
    {
      "text": "Luz Rello and Ricardo Baeza-Yates. 2016. The Effect of Font Type on Screen Readability by People with Dyslexia. ACM Trans. Access. Comput. 8, 4, Article 15 (May 2016), 33 pages.  ",
      "doi": "10.1145/2897736"
    },
    {
      "text": "Luz Rello and Ricardo Baeza-Yates. 2017. How to Present More Readable Text for People with Dyslexia. Univers. Access Inf. Soc. 16, 1 (March 2017), 29--49.  ",
      "doi": "10.1007/s10209-015-0438-8"
    },
    {
      "text": "Luz Rello and Jeffrey P. Bigham. 2017. Good Background Colors for Readers: A Study of People with and Without Dyslexia. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, New York, NY, USA, 72--80.  ",
      "doi": "10.1145/3132525.3132546"
    },
    {
      "text": "Luz Rello, Gaurang Kanvinde, and Ricardo Baeza-Yates. 2012. Layout Guidelines for Web Text and a Web Service to Improve Accessibility for Dyslexics. In Proceedings of the International Cross-Disciplinary Conference on Web Accessibility (W4A '12). ACM, New York, NY, USA, Article 36, 9 pages.  ",
      "doi": "10.1145/2207016.2207048"
    },
    {
      "text": "Claudia Rodríguez-Aranda. 2003. Reduced writing and reading speed and age-related changes in verbal fluency tasks. The Clinical Neuropsychologist 17, 2 (2003), 203--215.",
      "doi": ""
    },
    {
      "text": "Enrico Schulz, Urs Maurer, Sanne van der Mark, Kerstin Bucher, Silvia Brem, Ernst Martin, and Daniel Brandeis. 2008. Impaired semantic processing during sentence reading in children with dyslexia: combined fMRI and ERP evidence. Neuroimage 41, 1 (2008), 153--168.",
      "doi": ""
    },
    {
      "text": "Sally E Shaywitz. 1998. Dyslexia. New England Journal of Medicine 338, 5 (1998), 307--312.",
      "doi": ""
    },
    {
      "text": "Jaana Simola, Jarmo Kuisma, Anssi Öörni, Liisa Uusitalo, and Jukka Hyönä. 2011. The impact of salient advertisements on reading and attention on web pages. Journal of Experimental Psychology: Applied 17, 2 (2011), 174.",
      "doi": ""
    },
    {
      "text": "Teng Ye, Katharina Reinecke, and Lionel P Robert Jr. 2017. Personalized Feedback Versus Money: The Effect on Reliability of Subjective Data in Online Experimental Platforms. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 343--346.  ",
      "doi": "10.1145/3022198.3026339"
    }
  ]
}