{
  "doi": "10.1145/3290605.3300405",
  "title": "Usability of Gamified Knowledge Learning in VR and Desktop-3D",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Affine Transformations (ATs) often escape an intuitive approach due to their high complexity. Therefore, we developed GEtiT that directly encodes ATs in its game mechanics and scales the knowledge's level of abstraction. This results in an intuitive application as well as audiovisual presentation of ATs and hence in a knowledge learning. We also developed a specific Virtual Reality (VR) version to explore the effects of immersive VR on the learning outcomes. This paper presents our approach of directly encoding abstract knowledge in game mechanics, the conceptual design of GEtiT and its technical implementation. Both versions are compared in regard to their usability in a user study. The results show that both GEtiT versions induce a high degree of flow and elicit a good intuitive use. They validate the effectiveness of the design and the resulting knowledge application requirements. Participants favored GEtiT VR thus showing a potentially higher learning quality when using VR.",
  "tags": [
    "knowledge learning",
    "gamification",
    "serious games design"
  ],
  "authors": [
    {
      "name": "Sebastian Oberdörfer",
      "institution": "University of Würzburg, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659085094",
      "orcid": "missing"
    },
    {
      "name": "David Heidrich",
      "institution": "University of Würzburg, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365377",
      "orcid": "missing"
    },
    {
      "name": "Marc Erich Latoschik",
      "institution": "University of Würzburg, Würzburg, Germany",
      "img": "/do/10.1145/contrib-81100286130/rel-imgonly/marc.jpg",
      "acmid": "81100286130",
      "orcid": "0000-0002-9340-9600"
    }
  ],
  "references": [
    {
      "text": "Ernest Adams and Joris Dormans. 2012. Game Mechanics. New Riders, Berkeley.",
      "doi": ""
    },
    {
      "text": "Eike Falk Anderson, Leigh McLoughlin, Fotis Liarokapis, Christopher Peters, Panagiotis Petridis, and Sara de Freitas. 2009. Serious Games in Cultural Heritage. In The 10th International Symposium on Virtual Reality, Archaeology and Cultural Heritage VAST. Malta, 29--48.",
      "doi": ""
    },
    {
      "text": "John R Anderson. 2015. Cognitive Psychology and Its Implications (8th ed.). Worth Publishers.",
      "doi": ""
    },
    {
      "text": "Doug A Bowman, Ernst Kruijf, Joseph J LaViola Jr, and Ivan Poupyrev. 2001. An introduction to 3-D user interface design. Presence: Teleoperators and virtual environments 10, 1 (2001), 96--108.  ",
      "doi": "10.1162/105474601750182342"
    },
    {
      "text": "Evren Bozgeyikli, Andrew Raij, Srinivas Katkoori, and Rajiv Dubey. 2016. Point & Teleport Locomotion Technique for Virtual Reality. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, Austin, TX, USA, 205--216.  ",
      "doi": "10.1145/2967934.2968105"
    },
    {
      "text": "Evren Bozgeyikli, Andrew Raij, Srinivas Katkoori, and Rajiv Dubey. 2019. Locomotion in virtual reality for room scale tracked areas. International Journal of Human-Computer Studies 122 (2019), 38--49.",
      "doi": ""
    },
    {
      "text": "Jere Brophy. 2000. Teaching. Educational Practices Series, Vol. 1. International Academy of Education & International Bureau of Education, Brussels.",
      "doi": ""
    },
    {
      "text": "Dennis Charsky. 2010. From Edutainment to Serious Games: A Change in the Use of Game Characteristics. Games and Culture 5, 2 (March 2010), 177--198.",
      "doi": ""
    },
    {
      "text": "Isabelle D Cherney. 2008. Mom, Let Me Play More Computer Games: They Improve My Mental Rotation Skills. Sex Roles 59, 11--12 (July 2008), 776--786.",
      "doi": ""
    },
    {
      "text": "David Crookall. 2011. Serious Games, Debriefng, and Simulation/Gaming as a Discipline. Simulation & Gaming 41, 6 (Jan. 2011), 898--920.  ",
      "doi": "10.1177/1046878110390784"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. Harper-Perennial, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Barney Dalgarno and Mark J. W. Lee. 2010. What are the learning afordances of 3-D virtual environments? British Journal of Educational Technology 41, 1 (2010), 10--32.",
      "doi": ""
    },
    {
      "text": "Suzanne de Castell, Jennifer Jenson, and Nicholas Taylor. 2010. Educational Games: Moving from Theory to Practice. In Educational gameplay and simulation environments : case studies and lessons learned, David Kaufman and Louise Sauvé (Eds.). Information Science Reference, Hershey, PA, 133--145.",
      "doi": ""
    },
    {
      "text": "Sara de Freitas and Fotis Liarokapis. 2011. Serious Games: A New Paradigm for Education? In Serious Games and Edutainment Applications, Minhua Ma, Andreas Oikonomou, and Lakhmi C Jain (Eds.). SpringerVerlag, London, 9--23.",
      "doi": ""
    },
    {
      "text": "Christopher J Dede. 2009. Immersive Interfaces for Engagement and Learning. Science 323 (2009).",
      "doi": ""
    },
    {
      "text": "Christopher J Dede, Jefrey Jacobson, and John Richards. 2017. Introduction: Virtual, Augmented, and Mixed Realities in Education. In Virtual, Augmented, and Mixed Realities in Education, Dejian Liu, Christopher J Dede, Ronghuai Huang, and John Richards (Eds.). Springer, Singapoore.",
      "doi": ""
    },
    {
      "text": "K Anders Ericsson, Ralf Th Krampe, and Clemens Tesch-Römer. 1993. The Role of Deliberate Practice in the Acquisition of Expert Performance. Psychological Review 100, 3 (1993), 363--406.",
      "doi": ""
    },
    {
      "text": "Paul Morris Fitts and Michael I Posner. 1967. Human performance. Brooks Cole.",
      "doi": ""
    },
    {
      "text": "J Foley, A van Dam, S Feiner, and J Hughes. 1990. Computer Graphics: Principles and Practice. Addison-Wesley, Reading, MA, USA. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "Laura Freina and Michela Ott. 2015. A Literature Review on Immersive Virtual Reality in Education: State Of The Art and Perspectives. In Proceedings of the 11th eLearning and Software for Education (eLSE). Bucharest, Romania.",
      "doi": ""
    },
    {
      "text": "K S Fu, R Gonzalez, and C S G Lee. 1987. Robotics: Control, Sensing, Vision and Intelligence. McGraw-Hill Education, New York. ",
      "doi": "10.5555/27013"
    },
    {
      "text": "James Paul Gee. 2007. What video games have to teach us about learning and literacy (1 ed.). Palgrave Macmillan, New York.",
      "doi": ""
    },
    {
      "text": "Sanjay Ghosh, Chivukula Sai Shruthi, Himanshu Bansal, and Arvind Sethia. 2017. What is User's Perception of Naturalness? An Exploration of Natural User Experience. In Human-Computer Interaction INTERACT 2017, Regina Bernhaupt, Girish Dalvi, Anirudha Joshi, Devanuj K. Balkrishan, Jacki O'Neill, and Marco Winckler (Eds.). Springer International Publishing, Cham, 224--242.",
      "doi": ""
    },
    {
      "text": "Georg Gittler and Judith Glück. 1998. Diferential transfer of learning: Efects of instruction in descriptive geometry on spatial test performance. Journal of Geometry and Graphics 2, 1 (1998), 71--84.",
      "doi": ""
    },
    {
      "text": "C Shawn Green and Daphne Bavelier. 2003. Action video game modifes visual selective attention. Nature 423, 6939 (2003), 534--537.",
      "doi": ""
    },
    {
      "text": "C Shawn Green and Daphne Bavelier. 2007. Action-video-game experience alters the spatial resolution of vision. Psychological Science 18, 1 (2007), 88--94.",
      "doi": ""
    },
    {
      "text": "Anthony Gurr. 2010. Video Games and the Challenge of Engaging the 'Net' Generation. In Educational gameplay and simulation environments : case studies and lessons learned, David Kaufman and Louise Sauvé (Eds.). Information Science Reference, Hershey, PA, USA, 119--131.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart. 2006. NASA-Task Load Index (NASA-TLX); 20 Years Later. In Proceedings of the Human Factors and Ergonomics Society 50th Annual Meeting. Santa Monica, 904--908.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. In Human Mental Workload, P. A. Hancock and N Meshkati (Eds.). Elsevier Science Publishers B.V., Amsterdam, 139--183.",
      "doi": ""
    },
    {
      "text": "John Hattie and Helen Timperley. 2007. The Power of Feedback. Review of Educational Research 77, 1 (2007), 81--112.",
      "doi": ""
    },
    {
      "text": "Blake Hodgkinson, Christof Lutteroth, and Burkhard Wünsche. 2016. glGetFeedback-Towards automatic feedback and assessment for OpenGL 3D modelling assignments. In 2016 International Conference on Image and Vision Computing New Zealand (IVCNZ). IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Philip N. Johnson-Laird. 1983. Mental Models. Towards a Cognitive Science of Language, Inference, and Consciousness. Harvard University Press. ",
      "doi": "10.5555/7909"
    },
    {
      "text": "Mona Erfani Joorabchi and Magy Seif El-Nasr. 2011. Measuring the Impact of Knowledge Gained from Playing FPS and RPG Games on Gameplay Performance. In Entertainment Computing -- ICEC 2011. Springer, Vancouver, BC, Canada, 300--306.  ",
      "doi": "10.1007/978-3-642-24500-8_33"
    },
    {
      "text": "Victor Kaptelinin and Bonnie A Nardi. 2012. Afordances in HCI: Toward a Mediated Action Perspective. In CHI 2012 Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems. ACM, Austin, TX, USA, 967--976.  ",
      "doi": "10.1145/2207676.2208541"
    },
    {
      "text": "Hannes Kaufmann. 2006. The potential of augmented reality in dynamic geometry education. 12th International Converence on Geometry and Graphics (2006).",
      "doi": ""
    },
    {
      "text": "Hannes Kaufmann, Dieter Schmalstieg, and Michael Wagner. 2000. Construct3D: A Virtual Reality Application for Mathematics and Geometry Education. Education and Information Technologies 5, 4 (2000), 263--276.  ",
      "doi": "10.1023/A%3A1012049406877"
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk Sebastian Oberdörfer, David Heidrich, and Marc Erich Latoschik Method for Quantifying Simulator Sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203--220.",
      "doi": ""
    },
    {
      "text": "Mina Khan, Fernando Trujano, Ashris Choudhury, and Pattie Maes. 2018. Mathland: Playful Mathematical Learning in Mixed Reality. In CHI'18 Extended Abstracts. Montréal, Canada.  ",
      "doi": "10.1145/3170427.3186499"
    },
    {
      "text": "Joseph J LaViola Jr, Ernst Kruijf, Ryan P McMahan, Doug Bowman, and Ivan P Poupyrev. 2017. 3D user interfaces: Theory and practice. Addison-Wesley Professional.",
      "doi": "10.5555/993837"
    },
    {
      "text": "Timothy Lynam, Raphael Mathevet, Michel Etienne, Samantha StoneJovicich, Anne Leitch, Nathalie Jones, Helen Ross, Derick Du Toit, Sharon Pollard, Harry Biggs, and Pascal Perez. 2012. Waypoints on a Journey of Discovery: Mental Models in Human-Environment Interactions. Ecology and Society 17, 3 (2012).",
      "doi": ""
    },
    {
      "text": "Guido Makransky and Lau Lilleholt. 2018. A structural equation modeling investigation of the emotional value of immersive virtual reality in education. Educational Technology Research and Development (2018).",
      "doi": ""
    },
    {
      "text": "Jorge Martín-Gutiérrez, Carlos Efrén Mora, Beatriz Añorbe-Díaz, and Antonio González-Marrero. 2017. Virtual Technologies Trends in Education. EURASIA Journal of Mathematics Science and Technology Education 13, 2 (2017), 469--486.",
      "doi": ""
    },
    {
      "text": "Jane McGonigal. 2011. Reality is broken : why games make us better and how they can change the world (1 ed.). Penguin Press, New York. ",
      "doi": "10.5555/1972527"
    },
    {
      "text": "Daniel Medeiros, Eduardo Cordeiro, Daniel Mendes, Maurício Sousa, Alberto Raposo, Alfredo Ferreira, and Joaquim Jorge. 2016. Efects of Speed and Transitions on Target-based Travel Techniques. In Proceedings of the 22Nd ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM, New York, NY, USA, 327--328.  ",
      "doi": "10.1145/2993369.2996348"
    },
    {
      "text": "Jose Mestre. 2002. Transfer of Learning: Issues and Research Agenda. National Science Foundation, Washington, D.C.",
      "doi": ""
    },
    {
      "text": "Anja Naumann and Jörn Hurtienne. 2010. Benchmarks for Intuitive Interaction with Mobile Devices. In Proceedings of MobileHCI'10. Lisboa, Portugal.  ",
      "doi": "10.1145/1851600.1851685"
    },
    {
      "text": "Sebastian Oberdörfer, Martin Fischbach, and Marc Erich Latoschik. 2018. Efects of VE Transition Techniques on Presence, IVBO, Efciency, and Naturalness. In Proceedings of the 6th Symposium on Spatial User Interaction. ACM, Berlin, Germany.  ",
      "doi": "10.1145/3267782.3267787"
    },
    {
      "text": "Sebastian Oberdörfer, David Heidrich, and Marc Erich Latoschik. 2017. Interactive Gamifed Virtual Reality Training of Afne Transformations. In Proceedings of DeLFI and GMW Workshops 2017, Carsten Ullrich and Martin Wessner (Eds.). Chemnitz, Germany.",
      "doi": ""
    },
    {
      "text": "Sebastian Oberdörfer and Marc Erich Latoschik. 2013. Develop your strengths by gaming. In Informatik 2013 - Proceedings of 43rd annual German conference on informatics, Matthias Horbach (Ed.), Vol. P-220. Gesellschaft für Informatik, Koblenz, Germany, 2346--2357.",
      "doi": ""
    },
    {
      "text": "Sebastian Oberdörfer and Marc Erich Latoschik. 2016. Interactive gamifed 3D-training of afne transformations. In Proceedings of the 22nd ACM Conference on Virtual Reality Software and Technology (VRST '16). ACM Press, Garching, Germany, 343--344.  ",
      "doi": "10.1145/2993369.2996314"
    },
    {
      "text": "Sebastian Oberdörfer and Marc Erich Latoschik. 2018. Efective Orbital Mechanics Knowledge Training Using Game Mechanics. In Proceedings of the 10th International Conference on Virtual Worlds and Games for Serious Applications (VS Games 2018). Würzburg, Germany.",
      "doi": ""
    },
    {
      "text": "Sebastian Oberdörfer and Marc Erich Latoschik. 2018. Efectivity of Afne Transformation Knowledge Training Using Game Mechanics. In Proceedings of the 10th International Conference on Virtual Worlds and Games for Serious Applications (VS Games 2018). Würzburg, Germany.",
      "doi": ""
    },
    {
      "text": "Sebastian Oberdörfer and Marc Erich Latoschik. 2018. Gamifed Knowledge Encoding: Knowledge Training Using Game Mechanics. In Proceedings of the 10th International Conference on Virtual Worlds and Games for Serious Applications (VS Games 2018). Würzburg, Germany.",
      "doi": ""
    },
    {
      "text": "Adam C Oei and Michael D Patterson. 2013. Enhancing Cognition with Video Games: A Multiple Game Training Study. PLoS ONE 8, 3 (Feb. 2013), e58546.",
      "doi": ""
    },
    {
      "text": "Lauri-Matti Palmunen, Elina Pelto, Anni Paalumäki, and Timo Lainema. 2013. Formation of Novice Business Students' Mental Models Through Simulation Gaming. Simulation & Gaming 44, 6 (2013), 846--868.  ",
      "doi": "10.1177/1046878113513532"
    },
    {
      "text": "David Perry and Rusel DeMaria. 2009. David Perry on Game Design: A Brainstorming Toolbox. Course Technology, Boston, MA, USA.",
      "doi": ""
    },
    {
      "text": "Marios Pittalis and Constantinos Christou. 2010. Types of reasoning in 3D geometry thinking and their relation with spatial ability. Educational Studies in Mathematics 75, 2 (2010), 191--212.",
      "doi": ""
    },
    {
      "text": "Patrick Prax. 2010. Leadership Style in World of Warcraft Raid Guilds. In Proceedings of DiGRA Nordic 2010. DiGRA, Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Lin Qiu, Wendy Weini Tay, and Junwei Wu. 2009. The impact of virtual teamwork on real-world collaboration. ACE'09 Proceedings of the International Conference on Advances in Computer Enterntainment Technology (2009), 44--51.  ",
      "doi": "10.1145/1690388.1690396"
    },
    {
      "text": "Jens Rasmussen. 1983. Skills, Rules, and Knowledge; Signals, Signs, and Symbols, and Other Distinctions in Human Performance Models. IEEE Transactions on Systems, Man, and Cybernetics 13, 3 (1983), 257--266.",
      "doi": ""
    },
    {
      "text": "Byron Reeves, Thomas W Malone, and Tony O'Discoll. 2008. Leadership's Online Labs. Harvard Business Review 86, 5 (2008), 58--66.",
      "doi": ""
    },
    {
      "text": "Falko Rheinberg, Regina Vollmeyer, and Stefan Engeser. 2003. Die Erfassung des Flow-Erlebens. In Diagnostik von Motivation und Selbstkonzept, J Stiensmeier-Pelster and Falko Rheinberg (Eds.). Hogrefe, Göttingen, 261--279.",
      "doi": ""
    },
    {
      "text": "Sebastian Richter and Ulrike Lechner. 2011. Communication content relations to coordination and trust over time: a computer game perspective. In C&T'11 Proceedings of the 5th International Conference on Communities and Technologies. ACM, Brisbane, Australia, 60--68.  ",
      "doi": "10.1145/2103354.2103363"
    },
    {
      "text": "Christian B Rogers, Hazim El-Mounaryi, Tamer Wasfy, and Jesse Satterwhite. 2017. Assessment of STEM e-Learning in an Immersive Virtual Reality (VR) Environment. Computers in Education 8, 4 (2017).",
      "doi": ""
    },
    {
      "text": "James C Rosser, Jr, Paul J Lynch, Laurie Cuddihy, Douglas A Gentile, Jonathan Klonsky, and Ronald Merrell. 2007. The impact of video games on training surgeons in the 21st century. Archives of Surgery 142, 2 (2007), 181.",
      "doi": ""
    },
    {
      "text": "P Salomoni, C Prandi, M Roccetti, L Casanova, and L Marchetti. 2016. Assessing the efcacy of a diegetic game interface with Oculus Rift. In 2016 13th IEEE Annual Consumer Communications & Networking Conference (CCNC). 387--392.",
      "doi": ""
    },
    {
      "text": "Kevin Saunders and Jeannie Novak. 2013. Game Development Essentials: Game Interface Design (2nd ed.). Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Ralph Schroeder. 2011. Being There Together : Social Interaction in Virtual Environments (1 ed.). Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Norbert M. Seel. 2003. Psychologie des Lernens (2 ed.). Reinhardt Verlag.",
      "doi": ""
    },
    {
      "text": "Miguel Sicart. 2008. Defning game mechanics. Game Studies 8, 2 (2008).",
      "doi": ""
    },
    {
      "text": "Anna Siewiorek and Andres Gegenfurtner. 2010. Leading to win: the infuence of leadership styles on team performance during a computer game training. In ICLS '10 Proceedings of the 9th International Conference of the Learning Sciences, Vol. 1. ACM, Chicago, IL, USA, 524--531. ",
      "doi": "10.5555/1854360.1854427"
    },
    {
      "text": "Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions Usability of Gamified Knowledge Learning of the Royal Society of London B: Biological Sciences 364, 1535 (2009), 3549--3557.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Vasilis Linakis, Martin Usoh, and Rob Kooper. 1996. Immersion, Presence, and Performance in Virtual Environments: An Experiment with Tri-Dimensional Chess. In ACM Virtual Reality Software and Technology (VRST). 163--172.  ",
      "doi": "10.1145/3304181.3304216"
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A Framework for Immersive Virtual Environments (FIVE): Speculations on the Role of Presence in Virtual Environments. Presence 6, 6 (1997), 603--616.  ",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Marco Speicher, Anna Maria Feit, Pascal Ziegler, and Antonio Krüger. 2018. Selection-based Text Entry in Virtual Reality. In Proceedings of CHI 2018. Montréal, Canada.  ",
      "doi": "10.1145/3173574.3174221"
    },
    {
      "text": "Larry R Squire. 1992. Declarative and Nondeclarative Memory: Multiple Brain Systems Supporting Learning and Memory. Journal of Cognitive Neuroscience 4, 3 (1992), 232--243.  ",
      "doi": "10.1162/jocn.1992.4.3.232"
    },
    {
      "text": "Jonathan A. Stevens and J. Peter Kincaid. 2015. The Relationship between Presence and Performance in Virtual Simulation Training. Open Journal of Modelling and Simulation 3 (2015), 41--48.",
      "doi": ""
    },
    {
      "text": "Take-Two Interactive. 2011--2018. Kerbal Space Program. available at https://kerbalspaceprogram.com.",
      "doi": ""
    },
    {
      "text": "Gerhard Tulodziecki, Bardo Herzig, and Silke Grafe. 2010. Medienbildung in Schule und Unterricht. Julius Klinkhardt.",
      "doi": ""
    },
    {
      "text": "Unity. 2017. unity 5.5.2p1. available at https://unity3d.com/unity/qa/patch-releases/5.5.2p1.",
      "doi": ""
    },
    {
      "text": "Unity. 2017. unity asset store. available at https://www.assetstore.unity3d.com.",
      "doi": ""
    },
    {
      "text": "Valve Coorperation. 2015--2018. SteamVR Plugin. available at https://www.assetstore.unity3d.com/en/#!/content/32647.",
      "doi": ""
    },
    {
      "text": "David Weibel and Bartholomäus Wissmath. 2011. Immersion in Computer Games: The Role of Spatial Presence and Flow. International Journal of Computer Games Technology 2011 (2011).  ",
      "doi": "10.1155/2011/282345"
    },
    {
      "text": "Bernd Weidenmann. 2009. Multimedia, Multicodierung und Multimodalität beim Online-Lernen. In Online Lernen. Handbuch für Wissenschaft und Praxis, L. J. Issing and P. Klimsa (Eds.). Oldenbourg, Chapter 5, 73--86. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    }
  ]
}