{
  "doi": "10.1145/3290605.3300441",
  "title": "Drag:on: A Virtual Reality Controller Providing Haptic Feedback Based on Drag and Weight Shift",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Standard controllers for virtual reality (VR) lack sophisticated means to convey a realistic, kinesthetic impression of size, resistance or inertia. We present the concept and implementation of Drag:on, an ungrounded shape-changing VR controller that provides dynamic passive haptic feedback based on drag, i.e. air resistance, and weight shift. Drag:on leverages the airflow occurring at the controller during interaction. By dynamically adjusting its surface area, the controller changes the drag and rotational inertia felt by the user. In a user study, we found that Drag:on can provide distinguishable levels of haptic feedback. Our prototype increases the haptic realism in VR compared to standard controllers and when rotated or swung improves the perception of virtual resistance. By this, Drag:on provides haptic feedback suitable for rendering different virtual mechanical resistances, virtual gas streams, and virtual objects differing in scale, material and fill state.",
  "authors": [
    {
      "name": "André Zenner",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-87958809157/rel-imgonly/bild-andre-zenner-klein.jpg",
      "acmid": "87958809157",
      "orcid": "0000-0003-3386-1635"
    },
    {
      "name": "Antonio Krüger",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 299, 14 pages.  ",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proc. TEI (TEI '16). ACM, New York, NY, USA, 218--226.  ",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proc. CHI (CHI '16). ACM, New York, NY, USA, 1968--1979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: High-fdelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proc. UIST (UIST '16). ACM, New York, NY, USA, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Mourad Bouzit, George Popescu, Grigore Burdea, and Rares Boian. 2002. The Rutgers Master II-ND Force Feedback Glove. In Proc. HAPTICS. IEEE Computer Society, 145--152. ",
      "doi": "10.5555/795682.797508"
    },
    {
      "text": "Lung-Pan Cheng, Li Chang, Sebastian Marwecki, and Patrick Baudisch. 2018. iTurk: Turning Passive Haptics into Active Haptics by Making Users Reconfgure Props in Virtual Reality. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 89, 10 pages.  ",
      "doi": "10.1145/3173574.3173663"
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic Turk: A Motion Platform Based on People. In Proc. CHI (CHI '14). ACM, New York, NY, USA, 3463--3472.  ",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D. Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proc. CHI (CHI '17). ACM, New York, NY, USA, 3718--3728.  ",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Lung-Pan Cheng, Thijs Roumen, Hannes Rantzsch, Sven Köhler, Patrick Schmidt, Robert Kovacs, Johannes Jasper, Jonas Kemper, and Patrick Baudisch. 2015. TurkDeck: Physical Virtual Reality Based on People. In Proc. UIST (UIST '15). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2807442.2807463"
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R. Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proc. UIST (UIST '17). ACM, New York, NY, USA, 119--130.  ",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Adjunct Proc. UIST (UIST '16 Adjunct). ACM, New York, NY, USA, 117--119.  ",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 654, 13 pages.  ",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "HTC Corporation. 2018. HTC Vive Virtual Reality System. https: //www.vive.com/ Retrieved Aug 29, 2018.",
      "doi": ""
    },
    {
      "text": "Lionel Dominjon, Anatole Lécuyer, Jean-Marie Burkhardt, Paul Richard, and Simon Richir. 2005. Infuence of Control/Display Ratio on the Perception of Mass of Manipulated Objects in Virtual Environments. In Proc. VR. IEEE Computer Society, 19--25.  ",
      "doi": "10.1109/VR.2005.49"
    },
    {
      "text": "Alexandra Fuchs, Miriam Sturdee, and Johannes Schöning. 2018. FoldWatch: Using Origami-inspired Paper Prototypes to Explore the Extension of Output Space in Smartwatches. In Proc. NordiCHI (NordiCHI '18). ACM, New York, NY, USA, 47--59.  ",
      "doi": "10.1145/3240167.3240173"
    },
    {
      "text": "Eisuke Fujinawa, Shigeo Yoshida, Yuki Koyama, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2017. Computational Design of Hand-held VR Controllers Using Haptic Shape Illusion. In Proc. VRST (VRST '17). ACM, New York, NY, USA, Article 28, 10 pages.  ",
      "doi": "10.1145/3139131.3139160"
    },
    {
      "text": "James J. Gibson. 1933. Adaptation, After-efect and Contrast in the Perception of Curved Lines. Journal of Experimental Psychology 16, 1 (1933), 1--31.",
      "doi": ""
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR. In Proc. CHI (CHI '16). ACM, New York, NY, USA, 1991--1995.  ",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor's Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 525, 11 pages.  ",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Brent Edward Insko. 2001. Passive Haptics Signifcantly Enhances Virtual Environments. Ph.D. Dissertation. University of North Carolina at Chapel Hill, USA. http://www.cs.unc.edu/techreports/01-017.pdf",
      "doi": ""
    },
    {
      "text": "Seungwoo Je, Hyelip Lee, Myung Jin Kim, and Andrea Bianchi. 2018. Wind-Blaster: A Wearable Propeller-based Prototype That Provides Ungrounded Force-Feedback. In ACM SIGGRAPH 2018 Emerging Technologies (SIGGRAPH '18). ACM, New York, NY, USA, Article 23, 2 pages.  ",
      "doi": "10.1145/3214907.3214915"
    },
    {
      "text": "Luv Kohli. 2013. Redirected Touching. Ph.D. Dissertation. University of North Carolina at Chapel Hill, USA. http://www.cs.unc.edu/techreports/13-002.pdf ",
      "doi": "10.5555/2519692"
    },
    {
      "text": "Andrey Krekhov, Katharina Emmerich, Philipp Bergmann, Sebastian Cmentowski, and Jens Krüger. 2017. Self-Transforming Controllers for Virtual Reality First Person Shooters. In Proc. CHI PLAY (CHI PLAY '17). ACM, New York, NY, USA, 517--529.  ",
      "doi": "10.1145/3116595.3116615"
    },
    {
      "text": "Johnny C. Lee, Scott E. Hudson, and Edward Tse. 2008. Foldable Interactive Displays. In Proc. UIST (UIST '08). ACM, New York, NY, USA, 287--290.  ",
      "doi": "10.1145/1449715.1449763"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proc. UIST (UIST '15). ACM, New York, NY, USA, 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proc. CHI (CHI '17). ACM, New York, NY, USA, 1471--1482.  ",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Thomas H. Massie and J. Kenneth Salisbury. 1994. The PHANToM Haptic Interface: A Device for Probing Virtual Objects. In Proc. ASME Dynamic Systems and Control Division. 295--301.",
      "doi": ""
    },
    {
      "text": "William A. McNeely. 1993. Robotic Graphics: A New Approach to Force Feedback for Virtual Reality. In Proc. VRAIS. IEEE Computer Society, 336--341.  ",
      "doi": "10.1109/VRAIS.1993.380761"
    },
    {
      "text": "William R. Provancher. 2014. Creating Greater VR Immersion by Emulating Force Feedback with Ungrounded Tactile Feedback. IQT Quarterly 6, 2 (2014), 18--21. http://tacticalhaptics.com/wp-content/ uploads/2013/10/IQT_Quarterly_Fall_2014_Provancher-Final.pdf",
      "doi": ""
    },
    {
      "text": "Michael Rietzler, Florian Geiselhart, Jan Gugenheimer, and Enrico Rukzio. 2018. Breaking the Tracking: Enabling Weight Perception Using Perceivable Tracking Ofsets. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 128, 12 pages.  ",
      "doi": "10.1145/3173574.3173702"
    },
    {
      "text": "Michael Rietzler, Katrin Plaumann, Taras Kränzle, Marcel Erath, Alexander Stahl, and Enrico Rukzio. 2017. VaiR: Simulating 3D Airfows in Virtual Reality. In Proc. CHI (CHI '17). ACM, New York, NY, USA, 5669--5677.  ",
      "doi": "10.1145/3025453.3026009"
    },
    {
      "text": "Joseph M. Romano and Katherine J. Kuchenbecker. 2009. The AirWand: Design and Characterization of a Large-Workspace Haptic Device. In 2009 IEEE International Conference on Robotics and Automation. 1461-- 1466. ",
      "doi": "10.5555/1703435.1703599"
    },
    {
      "text": "Tomoya Sasaki, Richard Sahala Hartanto, Kao-Hua Liu, Keitarou Tsuchiya, Atsushi Hiyama, and Masahiko Inami. 2018. LevioPole: Mid-air Haptic Interactions Using Multirotor. In ACM SIGGRAPH 2018 Emerging Technologies (SIGGRAPH '18). ACM, New York, NY, USA, Article 12, 2 pages.  ",
      "doi": "10.1145/3214907.3214913"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Taiju Aoki, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2018. Transcalibur: Dynamic 2D Haptic Shape Illusion of Virtual Object by Weight Moving VR Controller. In ACM SIGGRAPH 2018 Posters (SIGGRAPH '18). ACM, New York, NY, USA, Article 29, 2 pages.  ",
      "doi": "10.1145/3230744.3230804"
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality: Using the Physical Environment to Design Virtual Reality Experiences. In Proc. CHI (CHI '15). ACM, New York, NY, USA, 3307--3316.  ",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Alexa F. Siu, Eric J. Gonzalez, Shenli Yuan, Jason B. Ginsberg, and Sean Follmer. 2018. shapeShift: 2D Spatial Manipulation and Self-Actuation of Tabletop Shape Displays for Tangible and Haptic Interaction. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 291, 13 pages.  ",
      "doi": "10.1145/3173574.3173865"
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of Presence in Virtual Environments. Presence: Teleoperators and Virtual Environments 3, 2 (1994), 130--144.  ",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Rajinder Sodhi, Ivan Poupyrev, Matthew Glisson, and Ali Israr. 2013. AIREAL: Interactive Tactile Experiences in Free Air. ACM Trans. Graph. 32, 4, Article 134 (July 2013), 10 pages.  ",
      "doi": "10.1145/2461912.2462007"
    },
    {
      "text": "Mandayam A. Srinivasan and Cagatay Basdogan. 1997. Haptics in Virtual Environments: Taxonomy, Research Status, and Challenges. Computers & Graphics 21, 4 (1997), 393--404.",
      "doi": ""
    },
    {
      "text": "Evan Strasnick, Christian Holz, Eyal Ofek, Mike Sinclair, and Hrvoje Benko. 2018. Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stifness Actuation. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 644, 12 pages.  ",
      "doi": "10.1145/3173574.3174218"
    },
    {
      "text": "Yuriko Suzuki and Minoru Kobayashi. 2005. Air Jet Driven Force Feedback in Virtual Reality. IEEE Computer Graphics and Applications 25, 1 (Jan 2005), 44--47.  ",
      "doi": "10.1109/MCG.2005.1"
    },
    {
      "text": "Yuriko Suzuki, Minoru Kobayashi, and Satoshi Ishibashi. 2002. Design of Force Feedback Utilizing Air Pressure Toward Untethered Human Interface. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 808--809.  ",
      "doi": "10.1145/506443.506608"
    },
    {
      "text": "Susumu Tachi, Taro Maeda, Ryokichi Hirata, and Hiroshi Hoshino. 1994. A Construction Method of Virtual Haptic Space. In Proc. ICAT. 131--138. http://icat.vrsj.org/papers/94131.pdf",
      "doi": ""
    },
    {
      "text": "Richard Q. Van der Linde, Piet Lammertse, Erwin Frederiksen, and B. Ruiter. 2002. The HapticMaster, a New High-Performance Haptic Interface. In Proc. Eurohaptics. 1--5.",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfgurable Virtual Reality Controller. In Proc. CHI (CHI '18). ACM, New York, NY, USA, Article 86, 12 pages.  ",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "E. J. Williams. 1949. Experimental Designs Balanced for the Estimation of Residual Efects of Treatments. Australian Journal of Chemistry 2, 2 (1949), 149--168.",
      "doi": ""
    },
    {
      "text": "André Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (2017), 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}