{
  "doi": "10.1145/3290605.3300272",
  "title": "ActiveInk: (Th)Inking with Data",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "During sensemaking, people annotate insights: underlining sentences in a document or circling regions on a map. They jot down their hypotheses: drawing correlation lines on scatterplots or creating personal legends to track patterns. We present ActiveInk, a system enabling people to seamlessly transition between exploring data and externalizing their thoughts using pen and touch. ActiveInk enables the natural use of pen for active reading behaviors, while supporting analytic actions by activating any of these ink strokes. Through a qualitative study with eight participants, we contribute observations of active reading behaviors during data exploration and design principles to support sensemaking.",
  "tags": [
    "ink",
    "active reading",
    "visualization",
    "digital pen"
  ],
  "authors": [
    {
      "name": "Hugo Romat",
      "institution": "Microsoft Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658993819",
      "orcid": "0000-0002-9194-8889"
    },
    {
      "name": "Nathalie Henry Riche",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502798938",
      "orcid": "missing"
    },
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Caroline Appert",
      "institution": "Université Paris-Sud, CNRS, Université Paris-Saclay, Orsay, France",
      "img": "/do/10.1145/contrib-81311484266/rel-imgonly/id-appert.jpg",
      "acmid": "81311484266",
      "orcid": "0000-0002-3050-9284"
    },
    {
      "name": "Emmanuel Pietriga",
      "institution": "INRIA, Université Paris-Saclay, Orsay, France",
      "img": "/do/10.1145/contrib-81100222004/rel-imgonly/id2013.jpg",
      "acmid": "81100222004",
      "orcid": "missing"
    },
    {
      "name": "Christopher Collins",
      "institution": "Microsoft Research, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81436596812/rel-imgonly/collins-headshot.jpg",
      "acmid": "81436596812",
      "orcid": "0000-0002-4520-7000"
    }
  ],
  "references": [
    {
      "text": "Christopher Andrews, Alex Endert, and Chris North. 2010. Space to Think: Large High-resolution Displays for Sensemaking. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 55--64.  ",
      "doi": "10.1145/1753326.1753336"
    },
    {
      "text": "Lisa Anthony and Jacob O. Wobbrock. 2012. $N-protractor: A Fast and Accurate Multistroke Recognizer. In Proc. Graphics Interface. Canadian Information Processing Society, 117--120. ",
      "doi": "10.5555/2305276.2305296"
    },
    {
      "text": "Caroline Appert, Michel Beaudouin-Lafon, and Wendy E. Mackay. 2005. Context matters: Evaluating Interaction Techniques with the CIS Model. In People and Computers XVIII -Design for Life, Sally Fincher, Panos Markopoulos, David Moore, and Roy Ruddle (Eds.). Springer, London, 279--295.",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 DataDriven Documents. IEEE Trans. on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Mauro Cherubini, Gina Venolia, Rob DeLine, and Andrew J. Ko. 2007. Let's Go to the Whiteboard: How and Why Software Developers Use Drawings. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 557--566.  ",
      "doi": "10.1145/1240624.1240714"
    },
    {
      "text": "Christopher Collins, Gerald Penn, and Sheelagh Carpendale. 2009. Bubble Sets: Revealing Set Relations with Isocontours over Existing Visualizations. IEEE Trans. on Visualization and Computer Graphics 15, 6 (2009), 1009--1016.  ",
      "doi": "10.1109/TVCG.2009.122"
    },
    {
      "text": "Andrew Crotty, Alex Galakatos, Emanuel Zgraggen, Carsten Binnig, and Tim Kraska. 2015. Vizdom: Interactive analytics through pen and touch. Proc. of the VLDB Endowment 8, 12 (2015), 2024--2027.  ",
      "doi": "10.14778/2824032.2824127"
    },
    {
      "text": "Steven M. Drucker, Danyel Fisher, Ramik Sadana, Jessica Herron, and m.c. schraefel. 2013. TouchViz: A Case Study Comparing Two Interfaces for Data Analytics on Tablets. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 2301--2310.  ",
      "doi": "10.1145/2470654.2481318"
    },
    {
      "text": "Ken Hinckley, Xiaojun Bi, Michel Pahud, and Bill Buxton. 2012. Informal information gathering techniques for active reading. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 1893--1896.  ",
      "doi": "10.1145/2207676.2208327"
    },
    {
      "text": "Ken Hinckley, Ken Hinckley, Shengdong Zhao, Raman Sarin, Patrick Baudisch, Edward Cutrell, Michael Shilman, and Desney Tan. 2007. InkSeine: In Situ Search for Active Note Taking. In Proc. of the SIGCHI ActiveInk: (Th)Inking with Data CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Conf. on Human Factors in Computing Systems. ACM, 251--260.  ",
      "doi": "10.1145/1240624.1240666"
    },
    {
      "text": "Jaemin Jo, Sehi L'Yi, Bongshin Lee, and Jinwook Seo. 2017. TouchPivot: Blending WIMP & Post-WIMP Interfaces for Data Exploration on Tablet Devices. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 2660--2671.  ",
      "doi": "10.1145/3025453.3025752"
    },
    {
      "text": "Alison Kidd. 1994. The Marks Are on the Knowledge Worker. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 186--191.  ",
      "doi": "10.1145/191666.191740"
    },
    {
      "text": "David Kirsh. 2010. Thinking with external representations. AI & Society 25, 4 (2010), 441--454.",
      "doi": "10.5555/1894703.1894709"
    },
    {
      "text": "Bongshin Lee, Petra Isenberg, Nathalie Henry Riche, and Sheelagh Carpendale. 2012. Beyond mouse and keyboard: Expanding design considerations for information visualization interactions. IEEE Trans. on Visualization and Computer Graphics 18, 12 (2012), 2689--2698.  ",
      "doi": "10.1109/TVCG.2012.204"
    },
    {
      "text": "Bongshin Lee, Greg Smith, Nathalie Henry Riche, Amy Karlson, and Sheelagh Carpendale. 2015. SketchInsight: Natural data exploration on interactive whiteboards leveraging pen and touch interaction. In Proc. of the IEEE Pacific Visualization Symposium. IEEE, 199--206.",
      "doi": ""
    },
    {
      "text": "Jürg Lehni and Jonathan Puckey. 2018. Paper.js. http://paperjs.org",
      "doi": ""
    },
    {
      "text": "Guang Li, Xiang Cao, Sergio Paolantonio, and Feng Tian. 2012. SketchComm: a tool to support rich and flexible asynchronous communication of early design ideas. In Proc. of the ACM Conf. on Computer Supported Cooperative Work. ACM, 359--368.  ",
      "doi": "10.1145/2145204.2145261"
    },
    {
      "text": "Catherine C. Marshall. 1997. Annotation: From Paper Books to the Digital Library. In Proc. of the ACM Int. Conf. on Digital libraries. ACM Press, 131--140.  ",
      "doi": "10.1145/263690.263806"
    },
    {
      "text": "Fabrice Matulic and Moira C Norrie. 2012. Supporting active reading on pen and touch-operated tabletops. In Proc. of the Int. Working Conf. on Advanced Visual Interfaces. ACM, 612--619.  ",
      "doi": "10.1145/2254556.2254669"
    },
    {
      "text": "Hrim Mehta, Adam James Bradley, Mark Hancock, and Christopher Collins. 2017. Metatation: Annotation as Implicit Interaction to Bridge Close and Distant Reading. ACM Trans. on Computer-Human Interaction (TOCHI), Article 35 (2017), 41 pages.  ",
      "doi": "10.1145/3131609"
    },
    {
      "text": "Pam A Mueller and Daniel M Oppenheimer. 2014. The pen is mightier than the keyboard: Advantages of longhand over laptop note taking. Psychological Science 25, 6 (2014), 1159--1168.",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Ken Hinckley, Michel Pahud, and Bill Buxton. 2017. Thumb + Pen Interaction on Tablets. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 3254--3266.  ",
      "doi": "10.1145/3025453.3025567"
    },
    {
      "text": "Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. (2005), 2--4. https://analysis.mitre.org/proceedings/ Final_Papers_Files/206_Camera_Ready_Paper.pdf",
      "doi": ""
    },
    {
      "text": "Yann Riche, Nathalie Henry Riche, Ken Hinckley, Sheri Panabaker, Sarah Fuelling, and Sarah Williams. 2017. As We May Ink?: Learning from Everyday Analog Pen Use to Improve Digital Ink Experiences. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. 3241--3253.  ",
      "doi": "10.1145/3025453.3025716"
    },
    {
      "text": "Jeffrey M. Rzeszotarski and Aniket Kittur. 2014. Kinetica: Naturalistic Multi-touch Data Visualization. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 897--906.  ",
      "doi": "10.1145/2556288.2557231"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2014. Designing and implementing an interactive scatterplot visualization for a tablet computer. In Proc. of the Int. Working Conf. on Advanced Visual Interfaces. ACM, 265--272.  ",
      "doi": "10.1145/2598153.2598163"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2016. Designing Multiple Coordinated Visualizations for Tablets. Computer Graphics Forum 35, 3 (June 2016), 261--270. ",
      "doi": "10.5555/3071534.3071563"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-lite: A grammar of interactive graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 341-- 350.  ",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Michael Scaife and Yvonne Rogers. 1996. External Cognition: How do Graphical Representations Work? Int. J. Hum.-Comput. Stud. 45 (Aug. 1996), 185--213.  ",
      "doi": "10.1006/ijhc.1996.0048"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Andrea Bunt. 2012. Improving Command Selection with CommandMaps. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 257--266.  ",
      "doi": "10.1145/2207676.2207713"
    },
    {
      "text": "Bill N Schilit, Gene Golovchinsky, and Morgan N Price. 1998. Beyond paper: Supporting active reading with free form digital ink annotations. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 249--256.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Abigail J. Sellen and Richard H.R. Harper. 2003. The Myth of the Paperless Office. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/778158"
    },
    {
      "text": "Microsoft Cognitive Services. 2018. Ink Analysis API. https://labs. cognitive.microsoft.com/en-us/project-ink-analysis",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1994. Dynamic Queries for Visual Information Seeking. IEEE Softw. 11, 6 (Nov. 1994), 70--77.  ",
      "doi": "10.1109/52.329404"
    },
    {
      "text": "Craig S. Tashman and W. Keith Edwards. 2011. LiquidText: A Flexible, Multitouch Environment to Support Active Reading. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 3285-- 3294.  ",
      "doi": "10.1145/1978942.1979430"
    },
    {
      "text": "Christian Tominski, Stefan Gladisch, Ulrike Kister, Raimund Dachselt, and Heidrun Schumann. 2014. A Survey on Interactive Lenses in Visualization. In EuroVis - STARs, R. Borgo, R. Maciejewski, and I. Viola (Eds.). The Eurographics Association.",
      "doi": ""
    },
    {
      "text": "Jagoda Walny, Samuel Huron, Charles Perin, Tiffany Wun, Richard Pusch, and Sheelagh Carpendale. 2018. Active Reading of Visualizations. IEEE Trans. on Visualization and Computer Graphics 24, 1 (2018), 770--780.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Nathalie Henry Riche, Fanny Chevalier, Bruno De Araujo, and Daniel Wigdor. 2018. DataInk: Direct and Creative Data-Oriented Drawing. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems.  ",
      "doi": "10.1145/3173574.3173797"
    },
    {
      "text": "Haijun Xia, Ken Hinckley, Michel Pahud, Xiao Tu, and Bill Buxton. 2017. WritLarge: Ink Unleashed by Unified Scope, Action, & Zoom. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 3227--3240.  ",
      "doi": "10.1145/3025453.3025664"
    },
    {
      "text": "Emanuel Zgraggen, Robert Zeleznik, and Steven M Drucker. 2014. PanoramicData: Data analysis through pen & touch. IEEE Trans. on Visualization and Computer Graphics 20, 12 (2014), 2112--2121.",
      "doi": ""
    },
    {
      "text": "Zhenpeng Zhao, Sriram Karthik Badam, Senthil Chandrasegaran, Deok Gun Park, Niklas L.E. Elmqvist, Lorraine Kisselburgh, and Karthik Ramani. 2014. skWiki: A Multimedia Sketching System for Collaborative Creativity. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. ACM, 1235--1244.  ",
      "doi": "10.1145/2556288.2557394"
    }
  ]
}