{
  "doi": "10.1145/3290605.3300825",
  "title": "Automating the Administration and Analysis of Psychiatric Tests: The Case of Attachment in School Age Children",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "This article presents the School Attachment Monitor, a novel interactive system that can reliably administer the Manchester Child Attachment Story Task (a standard psychiatric test for the assessment of attachment in children) without the supervision of trained professionals. Attachment problems in children cause significant mental health issues and costs to society which technology has the potential to reduce. SAM collects, through instrumented doll-play games, enough information to allow a human assessor to manually identify the attachment status of children. Experiments show that the system successfully does this in 87.5% of cases. In addition, the experiments show that an automatic approach based on deep neural networks can map the information collected into the attachment condition of the children. The outcome SAM matches the judgment of expert human assessors in 82.8% of cases. This is the first time an automated tool has been successful in measuring attachment. This work has significant implications for psychiatry as it allows professionals to assess many more children cost effectively and to direct healthcare resources more accurately and efficiently to improve mental health.",
  "authors": [
    {
      "name": "Giorgio Roffo",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548558856",
      "orcid": "missing"
    },
    {
      "name": "Dong-Bach Vo",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444596443",
      "orcid": "0000-0002-2391-5583"
    },
    {
      "name": "Mohammad Tayarani",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659183696",
      "orcid": "missing"
    },
    {
      "name": "Maki Rooksby",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659181897",
      "orcid": "missing"
    },
    {
      "name": "Alessandra Sorrentino",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659813627",
      "orcid": "missing"
    },
    {
      "name": "Simona Di Folco",
      "institution": "University of Edinburgh, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366075",
      "orcid": "missing"
    },
    {
      "name": "Helen Minnis",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659181973",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Alessandro Vinciarelli",
      "institution": "University of Glasgow, Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81100619672/rel-imgonly/alessandro.jpeg",
      "acmid": "81100619672",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "E.K. Ackermann. 2005. Playthings That Do Things: A Young Kid's \"Incredibles\"!. In Proceedings of the ACM International Conference on Interaction Design and Children. 1--8.  ",
      "doi": "10.1145/1109540.1109541"
    },
    {
      "text": "E. Ackermann. 2008. Toys to Fall for or Live with?. In Proceedings of the ACM International Conference on Interaction Design and Children. 2:1--2:1.  ",
      "doi": "10.1145/1463689.1463693"
    },
    {
      "text": "M. Arjovsky, A. Shah, and Y. Bengio. 2016. Unitary evolution recurrent neural networks. In Proceedings of the International Conference on Machine Learning. 1120--1128. ",
      "doi": "10.5555/3045390.3045509"
    },
    {
      "text": "J. Bowlby. 2012. A secure base. Routledge.",
      "doi": ""
    },
    {
      "text": "C.L. Breazeal. 2004. Designing Sociable Robots. MIT press. ",
      "doi": "10.5555/515422"
    },
    {
      "text": "Z. Cao, T. Simon, S.-E.Wei, and Y. Sheikh. 2017. Realtime Multi-Person 2D Pose Estimation Using Part Affinity Fields. In Poceedings of the The IEEE Conference on Computer Vision and Pattern Recognition.",
      "doi": ""
    },
    {
      "text": "N. Carr. 2015. The glass cage: Where automation is taking us. Random House.",
      "doi": ""
    },
    {
      "text": "G. Doherty, D. Coyle, and M. Matthews. 2010. Design and evaluation guidelines for mental health technologies. Interacting with Computers 22, 4 (2010), 243--252.  ",
      "doi": "10.1016/j.intcom.2010.02.006"
    },
    {
      "text": "M. Dong,W.H. Giles, V.J. Felitti, S.R. Dube, J.E. Williams, D.P. Chapman, and R.F. Anda. 2004. Insights into causal pathways for ischemic heart disease: adverse childhood experiences study. Circulation 110, 13 (2004), 1761--1766.",
      "doi": ""
    },
    {
      "text": "N. Freed, J. Qi, A. Setapen, C. Breazeal, L. Buechley, and H. Raffle. 2011. Sticking Together: Handcrafting Personalized Communication Interfaces. In Proceedings of the ACM International Conference on Interaction Design and Children. 238--241.  ",
      "doi": "10.1145/1999030.1999071"
    },
    {
      "text": "F.A. Gers, N.N. Schraudolph, and J. Schmidhuber. 2002. Learning precise timing with LSTM recurrent networks. Journal of Machine Learning Research 3, Aug (2002), 115--143.  ",
      "doi": "10.1162/153244303768966139"
    },
    {
      "text": "I. Goodfellow, Y. Bengio, A. Courville, and Y. Bengio. 2016. Deep Learning. MIT Press. ",
      "doi": "10.5555/3086952"
    },
    {
      "text": "A. Graves, A.-R. Mohamed, and G. Hinton. 2013. Speech recognition with deep recurrent neural networks. In Proceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. 6645--6649.",
      "doi": ""
    },
    {
      "text": "J. Green, C. Stanley, V. Smith, and R. Goldwyn. 2000. A new method of evaluating attachment representations in young school-age children: The Manchester Child Attachment Story Task. Attachment & Human Development 2, 1 (2000), 48--70.",
      "doi": ""
    },
    {
      "text": "C. Harbig, M. Burton, M. Melkumyan, L. Zhang, and J. Choi. 2011. SignBright: A Storytelling Application to Connect Deaf Children and Hearing Parents. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 977--982.  ",
      "doi": "10.1145/1979742.1979508"
    },
    {
      "text": "D.C. Herath, C. Kroos, C. Stevens, and D. Burnham. 2013. Adopt-arobot: A Story of Attachment. In Proceedings of the ACM/IEEE International Conference on Human-Robot Interaction. 135--136. ",
      "doi": "10.5555/2447556.2447604"
    },
    {
      "text": "A. Hiolle, K.A. Bard, and L. Canamero. 2009. Assessing human reactions to different robot attachment profiles. In Proceedings of the IEEE International Symposium on Robot and Human Interactive Communication. 251--256.",
      "doi": ""
    },
    {
      "text": "S. Hochreiter, Y. Bengio, P. Frasconi, and J. Schmidhuber. 2001. Gradient flow in recurrent nets: the difficulty of learning long-term dependencies.",
      "doi": ""
    },
    {
      "text": "H. Ishihara, Y. Yoshikawa, and M. Asada. 2011. Realistic child robot \"Affetto\" for understanding the caregiver-child attachment relationship that guides the child development. In Proceedings of the IEEE International Conference on Development and Learning, Vol. 2. 1--5.",
      "doi": ""
    },
    {
      "text": "J. Kaye, M. Nelimarkka, R. Kauppinen, S. Vartiainen, and P. Isosomppi. 2011. Mobile Family Interaction: How to Use Mobile Technology to Bring Trust, Safety and Wellbeing into Families. In Proceedings of the International Conference on Human Computer Interaction with Mobile Devices and Services. 721--724.  ",
      "doi": "10.1145/2037373.2037497"
    },
    {
      "text": "D.P. Kingma and J. Ba. 2014. Adam: A method for stochastic optimization. Technical Report. arXiv preprint arXiv:1412.6980.",
      "doi": ""
    },
    {
      "text": "J. Konecny",
      "doi": ""
    },
    {
      "text": "J. Liu, P. Richtárik, and M. Taká. 2016. Mini-batch semistochastic gradient descent in the proximal setting. IEEE Journal of Selected Topics in Signal Processing 10, 2 (2016), 242--255.",
      "doi": ""
    },
    {
      "text": "P. Lovenheim. 2018. The Attachment Effect. Tarcher Perigee.",
      "doi": ""
    },
    {
      "text": "A. Meschtscherjakov. 2009. Mobile Attachment: Emotional Attachment Towards Mobile Devices and Services. In Proceedings of the ACM International Conference on Human-Computer Interaction with Mobile Devices and Services. 102:1--102:1.  ",
      "doi": "10.1145/1613858.1613975"
    },
    {
      "text": "A. Meschtscherjakov, D. Wilfinger, and M. Tscheligi. 2014. Mobile attachment causes and consequences for emotional bonding with mobile phones. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 2317--2326.  ",
      "doi": "10.1145/2556288.2557295"
    },
    {
      "text": "H. Minnis, W. Read, B. Connolly, A. Burston, T.-S. Schumm, S. Putter- Lareman, and J. Green. 2010. The computerised Manchester Child Attachment Story Task: A novel medium for assessing attachment patterns. International Journal of Methods in Psychiatric Research 19, 4 (2010), 233--242.",
      "doi": ""
    },
    {
      "text": "W. Odom, J. Pierce, E. Stolterman, and E. Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "M. Oyama-Higa, J. Tsujino, and M. Tanabiki. 2006. Does a Mother's Attachment to Her Child Affect Biological Information provided by the Child? -Chaos analysis of fingertip pulse waves of children. In Proceedings of the IEEE International Conference on Systems, Man and Cybernetics, Vol. 3. 2030--2034.",
      "doi": ""
    },
    {
      "text": "C.J. Packard, V. Bezlyak, J.S. McLean, G.D. Batty, I. Ford, H. Burns, J. Cavanagh, K.A. Deans, M. Henderson, and A. McGinty. 2011. Early life socioeconomic adversity is associated in adult life with chronic inflammation, carotid atherosclerosis, poorer lung function and decreased cognitive performance: a cross-sectional, population-based study. BMC Public Health 11, 1 (2011), 42.",
      "doi": ""
    },
    {
      "text": "R. Pascanu, C. Gulcehre, K. Cho, and Y. Bengio. 2013. How to construct deep recurrent neural networks. arXiv preprint arXiv:1312.6026 (2013).",
      "doi": ""
    },
    {
      "text": "R. Picard. 1997. Affective Computing. MIT Press. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "F. Ramseyer and W. Tschacher. 2011. Nonverbal synchrony in psychotherapy: coordinated body movement reflects relationship quality and outcome. Journal of Consulting and Clinical Psychology 79, 3 (2011), 284.",
      "doi": ""
    },
    {
      "text": "C. Remy, S. Gegenbauer, and E.M. Huang. 2015. Bridging the Theory- Practice Gap: Lessons and Challenges of Applying the Attachment Framework for Sustainable HCI Design. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 1305--1314.  ",
      "doi": "10.1145/2702123.2702567"
    },
    {
      "text": "S. Scott, M. Knapp, J. Henderson, and B. Maughan. 2001. Financial cost of social exclusion: follow up study of antisocial children into adulthood. British Medical Journal 323, 7306 (2001), 191--200.",
      "doi": ""
    },
    {
      "text": "S.L. Toth, A. Maughan, J.T. Manly, M. Spagnola, and D. Cicchetti. 2002. The relative efficacy of two interventions in altering maltreated preschool children's representational models: Implications for attachment theory. Development and Psychopathology 14, 4 (2002), 877--908.",
      "doi": ""
    },
    {
      "text": "J. Tsujino, M. Oyama-Higa, and M. Tanabiki. 2008. Measurement of ear pulse waves in children: Effect of facing another child and relationship to an action index. In 2008 IEEE International Conference on Systems, Man and Cybernetics. 2972--2976.",
      "doi": ""
    },
    {
      "text": "B.A. van der Kolk. 2005. Developmental Trauma Disorder. Psychiatric Annals 35, 5 (2005), 401--408.",
      "doi": ""
    },
    {
      "text": "A. Vinciarelli, M. Pantic, and H. Bourlard. 2009. Social Signal Processing: Survey of an emerging domain. Image and Vision Computing 27,12 (2009), 1743--1759.  ",
      "doi": "10.1016/j.imavis.2008.11.007"
    },
    {
      "text": "D.-B. Vo, M. Rooksby, M. Tayarani, R. Huan, A. Vinciarelli, H. Minnis, and S.A. Brewster. 2017. SAM: The School Attachment Monitor. In Proceedings of the ACM Conference on Interaction Design and Children. 671--674.  ",
      "doi": "10.1145/3078072.3091977"
    },
    {
      "text": "D.-B. Vo, M. Tayarani, M. Rooksby, R. Huan, A. Vinciarelli, H. Minnis, and S.A. Brewster. 2017. SAM: The School Attachment Monitor. In Proceedings of the ACM International Conference on Multimodal Interaction. 497--498.  ",
      "doi": "10.1145/3136755.3143023"
    },
    {
      "text": "D. Wilkins, D. Shemmings, and Y. Shemmings. 2015. Attachment. Palgrave.",
      "doi": ""
    },
    {
      "text": "P. Wilson, P. Bradshaw, S. Tipping, G. Der, and H. Minnis. 2013. What predicts persistent early conduct problems? Evidence from the Growing Up in Scotland cohort. Journal of Epidemiology and Community Health 67 (2013), 76--80.",
      "doi": ""
    }
  ]
}