{
  "doi": "10.1145/3290605.3300255",
  "title": "Diagnosing and Coping with Mode Errors in Korean-English Dual-language Keyboard",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "In countries where languages with non-Latin characters are prevalent, people use a keyboard with two language modes namely, the native language and English, and often experience mode errors. To diagnose the mode error problem, we conducted a field study and observed that 78% of the mode errors occurred immediately after application switching. We implemented four methods (Auto-switch, Preview, Smart-toggle, and Preview & Smart-toggle) based on three strategies to deal with the mode error problem and conducted field studies to verify their effectiveness. In the studies considering Korean-English dual input, Auto-switch was ineffective. On the contrary, Preview significantly reduced the mode errors from 75.1% to 41.3%, and Smart-toggle saved typing cost for recovering from mode errors. In Preview & Smart-toggle, Preview reduced mode errors and Smart-toggle handled 86.2% of the mode errors that slipped past Preview. These results suggest that Preview & Smart-toggle is a promising method for preventing mode errors for the Korean-English dual-input environment.",
  "tags": [
    "input language mode",
    "mode error",
    "dual language keyboard"
  ],
  "authors": [
    {
      "name": "Sangyoon Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659303571",
      "orcid": "missing"
    },
    {
      "name": "Jaeyeon Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-60000000516/rel-imgonly/jaeyeon.jpg",
      "acmid": "60000000516",
      "orcid": "0000-0002-6474-8080"
    },
    {
      "name": "Geehyuk Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100384871/rel-imgonly/imgp3335.jpg",
      "acmid": "81100384871",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. ATOK. http://www.justsystems.com/jp/products/atok/feature2. html?index=correction",
      "doi": ""
    },
    {
      "text": "2017. Automatically switch keyboard to match language of surround­ ing text. https://support.office.com/en-us/article/Automatically­ switch-keyboard-to-match-language-of-surrounding-text­ c7316c3a-b6b3--433f-87f4-f777cf13decc",
      "doi": ""
    },
    {
      "text": "2017. KeySwitcher. http://www.keyswitcher.com/Default.aspx",
      "doi": ""
    },
    {
      "text": "2017. Mac OS Input menu. https://support.apple.com/kb/PH22033? viewlocale=en_US&locale=en_US",
      "doi": ""
    },
    {
      "text": "2017. Windows OS Keyboard Layout Language. https: //support.office.com/en-gb/article/Enable-or-change-a-keyboard­ layout-language-1c2242c0-fe15--4bc3--99bc-535de6f4f258",
      "doi": ""
    },
    {
      "text": "Young-Hoon Ahn and Seung-Shik Kang. 2001. Statistical approach to the automatic Korean-English string conversion. In Proceedings of the 13th Annual Conference on Human and Cognitive Language Technology. sigHCLT, Gyeongju, Korea, 205--208.",
      "doi": ""
    },
    {
      "text": "Stephen A Brewster, Peter C Wright, and Alistair DN Edwards. 1994. The design and evaluation of an auditory-enhanced scrollbar. In Pro­ ceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 173--179.  ",
      "doi": "10.1145/191666.191733"
    },
    {
      "text": "C. Chawannakul and S. Prasitjutrakul. 2011. Keyboard layout mis­ match error detection and correction system utility. In 2011 8th In­ ternational Conference on Electrical Engineering/Electronics, Computer, Telecommunications and Information Technology (ECTI-CON). 488--491.",
      "doi": ""
    },
    {
      "text": "Zheng Chen and Kai-Fu Lee. 2000. A new statistical approach to Chinese Pinyin input. In Proceedings of the 38th annual meeting on association for computational linguistics. Association for Computational Linguistics, 241--247.  ",
      "doi": "10.3115/1075218.1075249"
    },
    {
      "text": "Yo Ehara and Kumiko Tanaka-Ishii. 2008. Multilingual Text Entry using Automatic Language Detection. IJCNLP (2008).",
      "doi": ""
    },
    {
      "text": "Y. Ikegami, Y. Sakurai, and S. Tsuruta. 2012. Modeless Japanese Input Method Using Multiple Character Sequence Features. In 2012 Eighth International Conference on Signal Image Technology and Internet Based Systems (SITIS). 613--618.  ",
      "doi": "10.1109/SITIS.2012.93"
    },
    {
      "text": "Seiji Kasahara, Mamoru Komachi, Masaaki Nagata, and Yuji Mat­ sumoto. 2011. Error Correcting Romaji-kana Conversion for Japanese Language Education. Proceedings of the Workshop on Advances in Text Input Methods (2011), 38--42.",
      "doi": ""
    },
    {
      "text": "Injeong Kim and Heeyeung Hwang. 1989. A study on the Hangul automata. The Transactions of the Korean Institute of electrical engineers (1989), 491--494.",
      "doi": ""
    },
    {
      "text": "Keung-Hae Lee. 1995. Perfonnance Evaluation of AIMS, an Automatic Korean / English Input Mode Switching System. In Proceedings of the Korean Information Science Society Conference.",
      "doi": ""
    },
    {
      "text": "Keung-Hae Lee. 1997. The Application Programming Interface of AIMS, A Predictive Input Mode Switching Technique. In Proceedings of the Korean Information Science Society Conference. kiise, Busan, Korea, 185--188.",
      "doi": ""
    },
    {
      "text": "Ken Lunde. 2008. Input Methods. In CJKV Information Processing: Chinese, Japanese, Korean, and Vietnamese Computing. \"O'Reilly Media, Inc.\", Chapter 5, 299--362.",
      "doi": ""
    },
    {
      "text": "Seung mok Yoo, Jeong hoon Lee, and Sam myo Kim. 1995. Automatic Korean / English Key Mode Converter. In Proceedings of the Korean Information Science Society Conference. 589--592.",
      "doi": ""
    },
    {
      "text": "Andrew Monk. 1986. Mode errors: a user-centred analysis and some preventative measures using keying-contingent sound. International Journal of Man-Machine Studies 24, 4 (April 1986), 313--327.  ",
      "doi": "10.1016/S0020-7373%2886%2980049-9"
    },
    {
      "text": "Donald A. Norman. 1983. Design Rules Based on Analyses of Human Error. Commun. ACM 26, 4 (April 1983), 254--258.  ",
      "doi": "10.1145/2163.358092"
    },
    {
      "text": "Merle F Poller and Susan K Garter. 1984. The effects of modes on text editing by experienced editor users. Human Factors 26, 4 (1984), 449--462.",
      "doi": ""
    },
    {
      "text": "Tanapong Potipiti, Virach Sornlertlamvanich, and Kanokwut Thanad­ kran. 2001. Towards an Intelligent Multilingual Keyboard System. In Proceedings of the First International Conference on Human Language Technology Research (HLT '01). Association for Computational Lin­ guistics, Stroudsburg, PA, USA, 1--4.  ",
      "doi": "10.3115/1072133.1072222"
    },
    {
      "text": "Abigail J. Sellen, Gordon P. Kurtenbach, and William A. S. Buxton. 1992. The Prevention of Mode Errors Through Sensory Feedback. Hum.-Comput. Interact. 7, 2 (June 1992), 141--164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Ben Shneiderman, Catherine Plaisant, Maxine S Cohen, Steven Jacobs, Niklas Elmqvist, and Nicholas Diakopoulos. 2016. Designing the user interface: strategies for effective human-computer interaction. Pearson. ",
      "doi": "10.5555/3033040"
    }
  ]
}