{
  "doi": "10.1145/3290605.3300896",
  "title": "Long-Term Value of Social Robots through the Eyes of Expert Users",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Socially-enabled digital technologies have attracted academic interest for decades, with recent commercial examples of Siri and Alexa, capturing public attention. However, despite ubiquitous visions of a robotic future, very few fully-fledged social robots are currently available to consumers. To improve their designs, studies of their long-term use are particularly valuable, but are currently unavailable. To address this gap, we report on interviews with four long-term users of Pepper - a social robot introduced in 2014. Our thematic analysis elicited insights across three kinds of value Pepper brought to its users: utilitarian functionality; the community that formed around Pepper; and a personal value of affection. We focus on two contributions those values bring to social robot design: social robots as social proxies, alleviating disabilities or acting akin to social media profiles; and robot nurturing as a design construct, going beyond purely utilitarian or hedonistic perspectives on robots.",
  "tags": [
    "interview",
    "pepper",
    "human-robot interaction (hri)",
    "social",
    "long-term",
    "value",
    "acceptance",
    "robot"
  ],
  "authors": [
    {
      "name": "Dmitry Dereshev",
      "institution": "Northumbria University at Newcastle, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-99659177588/rel-imgonly/2020_ava_500x500.png",
      "acmid": "99659177588",
      "orcid": "missing"
    },
    {
      "name": "David Kirk",
      "institution": "Northumbria University at Newcastle, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Kohei Matsumura",
      "institution": "Ritsumeikan University, Kyoto, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500640544",
      "orcid": "missing"
    },
    {
      "name": "Toshiyuki Maeda",
      "institution": "Hannan University, Osaka, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81458650132",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Iina Aaltonen, Marketta Niemelä, and Antti Tammela. 2017. Please Call Me? Calling Practices with Telepresence Robots for the Elderly. Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction - HRI '17 March 6--9 (2017), 55--56.  ",
      "doi": "10.1145/3029798.3038396"
    },
    {
      "text": "Evan Ackerman. 2017. CES 2017: Why Every Social Robot at CES Looks Alike. IEEE spectrum (1 2017). http://spectrum.ieee.org/tech-talk/robotics/home-robots/ ces-2017-why-every-social-robot-at-ces-looks-alike",
      "doi": ""
    },
    {
      "text": "Henny Admoni and Brian Scassellati. 2017. Social Eye Gaze in Human-Robot Interaction: A Review. Journal of Human-Robot Interaction 6, 1 (3 2017), 25.  ",
      "doi": "10.5898/JHRI.6.1.Admoni"
    },
    {
      "text": "Hooman Aghaebrahimi Samani, Adrian David Cheok, Mili John Tharakan, Jeffrey Koh, and Newton Fernando. 2011. A Design Process for Lovotics. In Human-Robot Personal Relationships. HRPR 2010, Lamers M.H. and Verbeek F.J. (Eds.), Vol. 59 LNICST. Springer Berlin Heidelberg, Berlin, Germany, 118--125.",
      "doi": ""
    },
    {
      "text": "Morana Ala, Javier Movellan, and Fumihide Tanaka. 2011. When a robot is social: Spatial arrangements and multimodal semiotic engagement in the practice of social robotics. Social Studies of Science 41, 6 (12 2011), 893--926.",
      "doi": ""
    },
    {
      "text": "Aryel Beck, Brett Stevens, Kim A. Bard, and Lola Cañamero. 2012. Emotional body language displayed by artificial agents. ACM Transactions on Interactive Intelligent Systems 2, 1 (3 2012), 1--29.  ",
      "doi": "10.1145/2133366.2133368"
    },
    {
      "text": "Susanne Boll. 2017. Multimedia at CHI: Telepresence at Work for Remote Conference Participation. IEEE Multimedia 24, 3 (2017), 5--9.",
      "doi": "10.1109/MMUL.2017.3051516"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. In APA Handbook of Research Methods in Psychology, Vol 2: Research Designs: Quantitative, Qualitative, Neuropsychological, and Biological, H. Cooper (Ed.). Vol. 2. American Psychological Association, Washington, D.C., USA, Chapter 1.2, 57--71.",
      "doi": ""
    },
    {
      "text": "Buddy. 2015. BUDDY: Your Family's Companion Robot - Multilanguage (EN / FR/ DE/ JP/ CN). https://www.youtube.com/watch?v=51yGC3iytbY",
      "doi": ""
    },
    {
      "text": "CNET. 2018. Meet the Robots of CES 2018. https://www.cnet.com/ pictures/ces-2018-robots-pictures/",
      "doi": ""
    },
    {
      "text": "Benjamin R Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. \"What Can I Help You With?\": Infrequent Users' Experiences of Intelligent Personal Assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '17. ACM Press, New York, New York, USA, 1--12.  ",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Carlos Crivelli and Alan J. Fridlund. 2018. Facial Displays Are Tools for Social Influence. Trends in Cognitive Sciences 22, 5 (5 2018), 388--399.",
      "doi": ""
    },
    {
      "text": "Maartje de Graaf, Somaya Ben Allouch, and Jan van Dijk. 2017. Why Do They Refuse to Use My Robot?: Reasons for Non-Use Derived from a Long-Term Home Study. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction - HRI '17. ACM Press, Vienna, Austria, 224--233.  ",
      "doi": "10.1145/2909824.3020236"
    },
    {
      "text": "Maartje M.A. de Graaf, Somaya Ben Allouch, and Tineke Klamer. 2015. Sharing a Life with Harvey: Exploring the Acceptance of and Relationship-Building with a Social Robot. Computers in Human Behavior 43 (2 2015), 1--14.  ",
      "doi": "10.1016/j.chb.2014.10.030"
    },
    {
      "text": "Maartje MA de Graaf, Somaya Ben Allouch, and Jan A.G.M. van Dijk. 2018. A Phased Framework for Long-Term User Acceptance of Interactive Technology in Domestic Environments. New Media & Society 20, 7 (7 2018), 2582--2603.",
      "doi": ""
    },
    {
      "text": "Maartje Margaretha Allegonda de Graaf and Somaya Ben Allouch. 2016. The Influence of Prior Expectations of a Robot's Lifelikeness on Users' Intentions to Treat a Zoomorphic Robot as a Companion. International Journal of Social Robotics 9, 1 (2016), 17--32.",
      "doi": ""
    },
    {
      "text": "Maartje Margaretha Allegonda de Graaf, Somaya Ben Allouch, and Jan A.G.M. van Dijk. 2016. Long-Term Acceptance of Social Robots in Domestic Environments: Insights from a User 's Perspective. In AAAI 2016 Spring Symposium on Enabling Computing Research in Socially Intelligent Human-Robot Interaction: A Community-Driven Modular Research Platform. AAAI Press, Palo Alto, CA, USA, 96--103. https://www.researchgate.net/ publication/293477140_Long-Term_Acceptance_of_Social_Robots_ in_Domestic_Environments_Insights_from_a_User%27s_Perspective",
      "doi": ""
    },
    {
      "text": "Maartje Margaretha Allegonda de Graaf, Somaya Ben Allouch, and Jan A.G.M. van Dijk. 2016. Long-Term Evaluation of a Social Robot in Real Homes. Interaction Studies 17, 3 (2016), 461--490.",
      "doi": ""
    },
    {
      "text": "Astrid Rosenthal-von der Pütten, Nicole C. Krämer, and Sabrina C. Eimler. 2011. Living with a robot companion - Empirical Study on the Interaction with an Artificial Health Advisor. In Proceedings of the 13th international conference on multimodal interfaces - ICMI '11. ACM, Alicante, Spain, 327--334.  ",
      "doi": "10.1145/2070481.2070544"
    },
    {
      "text": "Dmitry Dereshev and David Kirk. 2017. Form, Function and Etiquette - Potential Users' Perspectives on Social Domestic Robots. Multimodal Technologies and Interaction 1, 2 (6 2017), 12.",
      "doi": ""
    },
    {
      "text": "Patrick Ehrenbrink, Seif Osman, and Sebastian Möller. 2017. Google now is for the extraverted, cortana for the introverted. In Proceedings of the 29th Australian Conference on Computer-Human Interaction OZCHI '17. ACM Press, New York, New York, USA, 257--265.  ",
      "doi": "10.1145/3152771.3152799"
    },
    {
      "text": "Ronit Feingold Polak, Avital Elishay, Yonat Shachar, Maayan Stein, Yael Edan, and Shelly Levy Tzedek. 2018. Differences between Young and Old Users when Interacting with a Humanoid Robot: A Qualitative Usability Study. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction - HRI '18. ACM Press, New York, New York, USA, 107--108.  ",
      "doi": "10.1145/3173386.3177046"
    },
    {
      "text": "Ylva Fernaeus, Maria Håkansson, Mattias Jacobsson, and Sara Ljungblad. 2010. How do you play with a robotic toy animal? A long-term study of Pleo. In Proceedings of the 9th International Conference on Interaction Design and Children - IDC '10. ACM Press, Barcelona, Spain, 39.  ",
      "doi": "10.1145/1810543.1810549"
    },
    {
      "text": "Julia Fink, Valerie Bauwens, Frederic Kaplan, and Pierre Dillenbourg. 2013. Living with a Vacuum Cleaning Robot. International Journal of Social Robotics 5, 3 (8 2013), 389--408.",
      "doi": ""
    },
    {
      "text": "Dan Formosa. 2009. Six Real People. In Proceedings of the International Association of Societies of Design Research (IASDR) 2009. Korean Society of Design Science, Coex, Seoul, Korea, 4381--4386. http://www.iasdr2009.or.kr/Papers/SpecialSession/ CorporateDesignResearch/SixRealPeople.pdf",
      "doi": ""
    },
    {
      "text": "Evan Golub, Brenna McNally, Becky Lewittes, Alazandra Shorter, and The Kids of Kidsteam. 2017. Life as a Robot (at CHI). In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17, Vol. 24. ACM Press, New York, New York, USA, 758--769.  ",
      "doi": "10.1145/3027063.3052761"
    },
    {
      "text": "Dirk Heylen, Betsy van Dijk, and Anton Nijholt. 2012. Robotic Rabbit Companions: Amusing or a nuisance? Journal on Multimodal User Interfaces 5, 1--2 (2012), 53--59.",
      "doi": ""
    },
    {
      "text": "International Federation of Robotics. 2017. Executive Summary World Robotics (Industrial & Service Robots) 2017. Technical Report. International Federation of Robotics, Frankfurt am Main, Germany. https://ifr.org/downloads/press/Executive_Summary_WR_ Service_Robots_2017_1.pdf",
      "doi": ""
    },
    {
      "text": "Mattias Jacobsson. 2009. Play, belief and stories about robots: A case study of a pleo blogging community. In Proceedings - IEEE International Symposium on Robot and Human Interactive Communication. IEEE, Toyama, Japan, 232--237.",
      "doi": ""
    },
    {
      "text": "Kwangmin Jeong, Jihyun Sung, Hae-Sung Lee, Aram Kim, Hyemi Kim, Chanmi Park, Yuin Jeong, Jeehang Lee, and Jinwoo Kim. 2018. Fribo: A Social Networking Robot for Increasing Social Connectedness through Sharing Daily Home Activities from Living Noise Data. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction - HRI '18. ACM Press, Chicago, IL, USA, 114--122.  ",
      "doi": "10.1145/3171221.3171254"
    },
    {
      "text": "Arttu Kääriä. 2017. Technology Acceptance of Voice Assistants: Anthropomorphism As a Factor. Ph.D. Dissertation. University of Jyväskylä. https://jyx.jyu.fi/dspace/bitstream/handle/123456789/ 54612/URN%3ANBN%3Afi%3Ajyu-201706202988.pdf'sequence=1",
      "doi": ""
    },
    {
      "text": "A. A. Karpov and R. M. Yusupov. 2018. Multimodal Interfaces of Human-Computer Interaction. Herald of the Russian Academy of Sciences 88, 1 (1 2018), 67--74.",
      "doi": ""
    },
    {
      "text": "Ichiro Kato, Sadamu Ohteru, Katsuhiko Shirai, Toshiaki Matsushima, Seinosuke Narita, Shigeki Sugano, Tetsunori Kobayashi, and Eizo Fujisawa. 1987. The robot musician \"wabot-2\" (waseda robot-2). Robotics 3, 2 (6 1987), 143--155.",
      "doi": ""
    },
    {
      "text": "Ikkaku Kawaguchi, Yuki Kodama, Hideaki Kuzuoka, Mai Otsuki, and Yusuke Suzuki. 2016. Effect of Embodiment Presentation by Humanoid Robot on Social Telepresence. Proceedings of the Fourth International Conference on Human Agent Interaction (2016), 253--256.  ",
      "doi": "10.1145/2974804.2980498"
    },
    {
      "text": "Csaba Kertész and Markku Turunen. 2017. What Can We Learn from the Long-Term Users of a Social Robot?. In International Conference on Social Robotics, Vol. 7621. 657--665.",
      "doi": ""
    },
    {
      "text": "Csaba Kertész and Markku Turunen. 2018. Exploratory analysis of Sony AIBO users. AI & SOCIETY (2 2018).",
      "doi": ""
    },
    {
      "text": "Julia Kiseleva, Kyle Williams, Jiepu Jiang, Ahmed Hassan Awadallah, Aidan C. Crook, Imed Zitouni, Tasos Anastasakos, Ahmed Hassan Awadallah, Aidan C. Crook, Imed Zitouni, and Tasos Anastasakos. 2016. Understanding User Satisfaction with Intelligent Assistants. In Proceedings of the 39th International ACM SIGIR conference on Research and Development in Information Retrieval - SIGIR '16, Vol. 1. ACM, Carrboro, 45--54.  ",
      "doi": "10.1145/2911451.2911521"
    },
    {
      "text": "Sonya S. Kwak, Jun San Kim, and Jung Ju Choi. 2017. The Effects of Organism- Versus Object-Based Robot Design Approaches on the Consumer Acceptance of Domestic Robots. International Journal of Social Robotics 9, 3 (2017), 359--377.",
      "doi": ""
    },
    {
      "text": "Mathis Lauckner, Dejan Pangercic, and Serkan Tuerker. 2015. Evaluation of a Mobile Robotic Telepresence System in a One-on-One Meeting Scenario. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts - HRI'15 Extended Abstracts. ACM Press, New York, New York, USA, 57--58.  ",
      "doi": "10.1145/2701973.2702047"
    },
    {
      "text": "Namseok Lee, Hochul Shin, and S. Shyam Sundar. 2011. Utilitarian vs. hedonic robots. In Proceedings of the 6th international conference on Human-robot interaction - HRI '11. ACM Press, New York, New York, USA, 183.",
      "doi": ""
    },
    {
      "text": "Irene Lopatovska and Harriet Williams. 2018. Personification of the Amazon Alexa: BFF or a Mindless Companion. In Proceedings of the 2018 Conference on Human Information Interaction&Retrieval - CHIIR '18. ACM Press, New Brunswick, NJ, USA, 265--268.  ",
      "doi": "10.1145/3176349.3176868"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Mayfield Robotics. 2018. An Important (And Difficult) Announcement. https://www.heykuri.com/blog/important_difficult_announcement/",
      "doi": ""
    },
    {
      "text": "M. Nakano, Y. Hasegawa, K. Nakadai, T. Nakamura, J. Takeuchi, T. Torii, H. Tsujino, N. Kanda, and H.G. Okuno. 2005. A two-layer model for behavior and dialogue planning in conversational service robots. In 2005 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, Edmonton, Alta., Canada, 3329--3335.",
      "doi": ""
    },
    {
      "text": "Steffi Paepcke and Leila Takayama. 2010. Judging a Bot by Its Cover: An Experiment on Expectation Setting for Personal Robots. In Proceeding of the 5th ACM/IEEE international conference on Human-robot interaction - HRI '10. ACM Press, New York, New York, USA, 45. ",
      "doi": "10.5555/1734454.1734472"
    },
    {
      "text": "Amanda Purington, Jessie G. Taft, Shruti Sannon, Natalya N. Bazarova, and Samuel Hardman Taylor. 2017. \"Alexa is my new BFF\": Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17. ACM, Denver, CO, USA, 2853--2859.  ",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "PYMNTS. 2017. Pepper The Sales Robot A Hit For SoftBank. https://www.pymnts.com/news/merchant-innovation/2017/ pepper-the-sales-robot-a-hit-for-softbank/",
      "doi": ""
    },
    {
      "text": "Irene Rae and Carman Neustaedter. 2017. Robotic Telepresence at Scale. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 313--324.  ",
      "doi": "10.1145/3025453.3025855"
    },
    {
      "text": "Claire Rivoire and Angelica Lim. 2016. Habit Detection within a Long-Term Interaction with a Social Robot: An Exploratory Study. In Proceedings of the International Workshop on Social Learning and Multimodal Interaction for Designing Artificial Agents - DAA '16. ACM Press, Tokyo, Japan, 1--6.  ",
      "doi": "10.1145/3005338.3005342"
    },
    {
      "text": "Emma J. Rose and Elin A. Björling. 2017. Designing for Engagement: Using Participatory Design to Develop a Social Robot to Measure Teen Stress. In Proceedings of the 35th ACM International Conference on the Design of Communication - SIGDOC '17. ACM Press, Halifax, Nova Scotia, Canada, 1--10.  ",
      "doi": "10.1145/3121113.3121212"
    },
    {
      "text": "Y. Sakagami, R. Watanabe, C. Aoyama, S. Matsunaga, N. Higaki, and K. Fujimura. 2018. The Intelligent ASIMO: System Overview and Integration. In IEEE/RSJ International Conference on Intelligent Robots and System, Vol. 3. IEEE, 2478--2483.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I Hong. 2018. \"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS '18. ACM Press, Hong Kong, China, 857--868.  ",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Cory-Ann Cook Smarr. 2014. Applying a Qualitative Framework of Acceptance of Personal Robots. Ph.D. Dissertation. Georgia Institute of Technology. https://smartech.gatech.edu/bitstream/handle/1853/ 53096/SMARR-DISSERTATION-2014.pdf'sequence=1&isAllowed=y",
      "doi": ""
    },
    {
      "text": "SoftBank Robotics. 2018. Pepper, a humanoid robot from SoftBank Robotics, a genuine companion | SoftBank Robotics. https://www.ald.softbankrobotics.com/en/robots/pepper",
      "doi": ""
    },
    {
      "text": "Statista. 2018. Quarterly Personal Computer (PC) Vendor Shipments Worldwide, from 2009 to 2018, by Vendor (in Million Units). https://www.statista.com/statistics/263393/global-pc-shipments-since-1st-quarter-2009-by-vendor/",
      "doi": ""
    },
    {
      "text": "Brett Stoll, Samantha Reig, Lucy He, Ian Kaplan, Malte F. Jung, and Susan R. Fussell. 2018. Wait, Can You Move the Robot?. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction - HRI '18. ACM Press, New York, New York, USA, 14--22.  ",
      "doi": "10.1145/3171221.3171243"
    },
    {
      "text": "Sarah Strohkorb Sebo, Margaret Traeger, Malte Jung, and Brian Scassellati. 2018. The Ripple Effects of Vulnerability: The Effects of a Robot's Vulnerable Behavior on Trust in Human-Robot Teams. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction - HRI '18. ACM Press, Chicago, IL, USA, 178--186.  ",
      "doi": "10.1145/3171221.3171275"
    },
    {
      "text": "Jayoung Sung, Rebecca E. Grinter, and Henrik I. Christensen. 2009. \"Pimp My Roomba\": Designing for Personalization. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, New York, New York, USA, 193.  ",
      "doi": "10.1145/1518701.1518732"
    },
    {
      "text": "JaYoung Sung, Rebecca E. Grinter, and Henrik I. Christensen. 2010. Domestic Robot Ecology. International Journal of Social Robotics 2, 4 (12 2010), 417--429.",
      "doi": ""
    },
    {
      "text": "K.a Tanaka, H.a Nakanishi, and H.b Ishiguro. 2014. Robot conferencing: Physically embodied motions enhance social telepresence. Conference on Human Factors in Computing Systems - Proceedings (2014), 1591-- 1596.  ",
      "doi": "10.1145/2559206.2581162"
    },
    {
      "text": "Adriana Tapus, Elisabeth André, Jean-claude Martin, and Francois Ferland. 2015. Social Robotics. Lecture Notes in Computer Science, Vol. 9388. Springer International Publishing, Cham, Switzerland. 1-- 734 pages.",
      "doi": ""
    },
    {
      "text": "The Robotics Society of Japan. 2018. Robotics Laboratories in Japan. https://www.rsj.or.jp/en/rij/",
      "doi": ""
    },
    {
      "text": "Christiana Tsiourti, Astrid Weiss, Katarzyna Wac, and Markus Vincze. 2017. Designing Emotionally Expressive Robots: A Comparative Study on the Perception of Communication Modalities. In Proceedings of the 5th International Conference on Human Agent Interaction - HAI '17. ACM Press, Bielefeld, Germany, 213--222.  ",
      "doi": "10.1145/3125739.3125744"
    },
    {
      "text": "Katherine M. Tsui, Munjal Desai, Holly A. Yanco, and Chris Uhlik. 2011. Exploring use cases for telepresence robots. Proceedings of the 6th international conference on Human-robot interaction - HRI '11 August (2011), 11.  ",
      "doi": "10.1145/1957656.1957664"
    },
    {
      "text": "Sherry Turkle. 2017. Alone Together (3rd ed.). Basic Books, New York, NY, USA. 400 pages. https://www.amazon.co.uk/Alone-Together-Expect-Technology-Other/dp/0465093655/ref=sr_ 1_1?ie=UTF8&qid=1527585915&sr=8--1&keywords=alone+together+ turkle",
      "doi": ""
    },
    {
      "text": "Antoine A. J. van de Ven, Anne-mie A.G. Sponselee, and Ben A.M. Schouten. 2010. Robo M.D.: A Home Care Robot for Monitoring and Detection of Critical Situations. Proceedings of the 28th Annual European Conference on Cognitive Ergonomics - ECCE '10 August (2010), 375.  ",
      "doi": "10.1145/1962300.1962391"
    },
    {
      "text": "Kazuyoshi Wada and Takanori Shibata. 2007. Living With Seal Robots - Its Sociopsychological and Physiological Influences on the Elderly at a Care House. IEEE Transactions on Robotics 23, 5 (10 2007), 972--980.  ",
      "doi": "10.1109/TRO.2007.906261"
    },
    {
      "text": "Kazuyoshi Wada, Takanori Shibata, Takashi Asada, and Toshimitsu Musha. 2007. Robot Therapy for Prevention of Dementia at Home - Results of Preliminary Experiment. Journal of Robotics and Mechatronics 19, 6 (2007), 691. https://www.fujipress.jp/jrm/rb/robot001900060691/",
      "doi": ""
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA - A Computer Program For the Study of Natural Language Communication between Man and Machine. Commun. ACM 9, 1 (1 1966), 36--45.  ",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Lillian Yang, Carman Neustaedter, and Thecla Schiphorst. 2017. Communicating Through A Telepresence Robot: A Study of Long Distance Relationships. Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (2017), 3027--3033.  ",
      "doi": "10.1145/3027063.3053240"
    }
  ]
}