{
  "doi": "10.1145/3290605.3300236",
  "title": "Design and Plural Heritages: Composing Critical Futures",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "We make theoretical and methodological contributions to the CHI community by introducing comparisons between contemporary Critical Heritage research and some forms of experimental design practice. Beginning by identifying three key approaches in contemporary heritage research: Critical Heritage, Plural Heritages and Future Heritage we introduce these in turn, while exploring their significance for thinking about design, knowledge and diversity. We discuss our efforts to apply ideas integrating Critical Heritage and design through the adoption of known Research through Design techniques in a research project in Istanbul, Turkey describing the design of our study and how this was productive of sensory and speculative reflection on the past. Finally, we reflect on the usefulness of such methods in developing new interactive technologies in heritage contexts and go on to propose a series of recommendations for a future Critical Heritage Design practice.",
  "authors": [
    {
      "name": "Tom Schofield",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81474700787/rel-imgonly/profile_small.jpg",
      "acmid": "81474700787",
      "orcid": "missing"
    },
    {
      "name": "Daniel Foster Smith",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365460",
      "orcid": "missing"
    },
    {
      "name": "Gönül Bozoglu",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365694",
      "orcid": "missing"
    },
    {
      "name": "Christopher Whitehead",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659786893",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Yoko Akama, Seth Keen, and Peter West. 2016. Speculative Design and Heterogeneity in Indigenous Nation Building. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16, 895--899.  ",
      "doi": "10.1145/2901790.2901852"
    },
    {
      "text": "Kristina Andersen. 2014. The deliberate cargo cult. In Proceedings of the 2014 conference on Designing interactive systems - DIS '14, 627--636.  ",
      "doi": "10.1145/2598510.2598596"
    },
    {
      "text": "Gabriella Arrigoni. 2017. Heritage and digital cultures: sustaining criticality through prototypical thinking. Retrieved from http://documents.manchester.ac.uk/display.aspx?DocID=33838",
      "doi": ""
    },
    {
      "text": "Gabriella Arrigoni, Tom Schofield, Tim Shaw, and John Bowers. 2015. Prototyping Heritage: Collections, Materials and Emerging Approaches to Engagement. In Proceedings of the 2nd Connected Communities Heritage Network Symposium, 1--13. Retrieved January 2, 2019 from http://www.heritagenetwork.dmu.ac.uk/wpcontent/uploads/2015/01/Prototyping-Heritage-Collections-Materials-andEmerging-Approaches-to-Engagement-.pdf",
      "doi": ""
    },
    {
      "text": "G.J. Ashworth. 2002. Holocaust Tourism: The Experience of KrakówKazimierz. Int. Res. Geogr. Environ. Educ. 11, 4 (December 2002), 363--367.",
      "doi": ""
    },
    {
      "text": "Liam Bannon, Steve Benford, John Bowers, and Christian Heath. 2005. Hybrid design creates innovative museum experiences. Commun. ACM 48, 3 (March 2005), 62.  ",
      "doi": "10.1145/1047671.1047706"
    },
    {
      "text": "Shaowen Bardzell. 2014. Utopias of participation: design, criticality, and emancipation. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC '14 - volume 2, 189--190.  ",
      "doi": "10.1145/2662155.2662213"
    },
    {
      "text": "Shaowen Bardzell and Shaowen. 2010. Feminist HCI. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10, 1301.",
      "doi": ""
    },
    {
      "text": "Arndís Bergsdóttir. 2016. Museums and Feminist Matters: Considerations of a Feminist Museology. NORA - Nord. J. Fem. Gend. Res. 24, 2 (April 2016), 126-- 139.",
      "doi": ""
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A short essay on design, science, fact and fiction. Near Future Laboratory. Retrieved January 2, 2019 from http://blog.nearfuturelaboratory.com/2009/03/17/design-fiction-a-short-essayon-design-science-fact-and-fiction/",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. AntiSolutionist Strategies. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 4968--4978.  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Mark Blythe and Mark. 2014. Research through design fiction. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, 703--712.  ",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI interprets the probes. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07, 1077.  ",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Manu J. Brueggemann, Vanessa Thomas, and Ding Wang. 2018. Lickable Cities. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--10.",
      "doi": ""
    },
    {
      "text": "Fiona Cameron. 2003. Digital Futures I: Museum Collections, Digital Technologies, and the Cultural Construction of Knowledge. Curator Museum J. 46, 3 (July 2003), 325--340.",
      "doi": ""
    },
    {
      "text": "Stuart Candy and Jake Dunagan. 2017. Designing an experiential scenario: The People Who Vanished. Futures 86, (February 2017), 136--153.",
      "doi": ""
    },
    {
      "text": "Chiara De Cesari. 2010. World Heritage and mosaic universalism. J. Soc. Archaeol. 10, 3 (October 2010), 299--324.",
      "doi": ""
    },
    {
      "text": "David M. Chavis, James H. Hogge, David W. McMillan, and Abraham Wandersman. 1986. Sense of community through Brunswik's lens: A first look. J. Community Psychol. 14, 1 (January 1986), 24--40.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi. 2012. Place-centred interaction design: situated participation and co-creation in places of heritage. In Museum and design principles, Proceedings of the conference, Matteo Ballarin and Maddalena Dalla Mura (eds.). Fondazione di Venezia, Venezia, 57--68. Retrieved from http://shura.shu.ac.uk/6579/",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi, Liam J. Bannon, and Mikael Fernström. 2008. Including Visitor Contributions in Cultural Heritage Installations: Designing for Participation. Museum Manag. Curatorsh. 23, 4 (December 2008), 353--365.",
      "doi": ""
    },
    {
      "text": "Caroline Claisse, Luigina Ciolfi, and Daniela Petrelli. 2017. Containers of Stories: using co-design and digital augmentation to empower the museum community and create novel experiences of heritage at a house museum. Des. J. 20, sup1 (July 2017), S2906--S2918.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the Action is: The Foundations of Embodied Interaction. MIT Press, USA.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Paul Dourish and Genevieve Bell. 2011. Divining a digital future: mess and mythology in ubiquitous computing. MIT Press. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2001. Design noir: The secret life of electronic objects. Springer, London.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Critical Design FAQ. Dunne & Raby. Retrieved from http://www.dunneandraby.co.uk/content/bydandr/13/0",
      "doi": ""
    },
    {
      "text": "Hacer Foggo. 2007. The Sulukule Affair: Roma against Expropriation. Roma Rights Q. 4, (2007). Retrieved October 26, 2017 from http://www.errc.org/cms/upload/media/02/F6/m000002F6.pdf",
      "doi": ""
    },
    {
      "text": "Christopher Frayling. 1994. Research in Art and Design. R. Coll. Art Res. Pap. 1, (1994), 1--5.",
      "doi": ""
    },
    {
      "text": "Future Heritage. Heritage Futures | Assembling Alternative Futures for Heritage. Retrieved January 2, 2018 from https://heritage-futures.org/",
      "doi": ""
    },
    {
      "text": "Areti Galani, Aron Mazel, Deborah Maxwell, and Kate Sharpe. 2013. Situating Cultural Technologies Outdoors: Empathy in the Design of Mobile Interpretation of Rock Art in Rural Britain.. Springer, London, 183--204.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What Should We Expect From Research Through Design? In Proc. CHI 2012, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William Gaver, Andrew Boucher, Sarah Pennington, and Brendan Walker. 2004. Cultural Probes and the Value of Uncertainty. Interactions 11, 5 (2004), 53--56.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "William Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. Interactions 6, 1 (January 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Elisa. Giaccardi. 2012. Heritage and social media?: understanding heritage in a participatory culture. Routledge. Retrieved January 2, 2019 from https://books.google.co.uk/books?hl=en&lr=&id=62FebXpeRtMC&oi=fnd&pg =PP2&dq=Understanding+Heritage+in+a+Participatory+Culture&ots=Xaewx RSFix&sig=fZTtMx31UscfjKoMrZSZPMWkl20#v=onepage&q=Understanding Heritage in a Participatory Culture&f=false",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi. 2008. Reconnecting to Natural Heritage in Boulder, Colorado. In New heritage?: new media and cultural heritage, Yehuda E Kalay, Thomas Kvan and Janice Affleck (eds.). Routledge, London and New York, 112--131. Retrieved January 2, 2019 from https://www.routledge.com/New-HeritageNew-Media-and-Cultural-Heritage/Kalay-KvanAffleck/p/book/9780415773560",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi, Chris Speed, Nazli Cila, and Melissa L Caldwell. 2016. Things as Co-Ethnographers: Implications of a Thing Perspective for Design and Anthropology. In Design Anthropological Futures (1st ed.), Rachel Charlotte Smith, Kasper Tang Vangkilde, Mette Gislev Kjærsgaard, Ton Otto, Joachim Halse and Thomas Binder (eds.). Bloomsbury Academic, London, 235--248. Retrieved from http://www.bloomsburycollections.com/book/designanthropological-futures/ch15-things-as-co-ethnographers-implications-of-athing-perspective-for-design-and-anthropology/",
      "doi": ""
    },
    {
      "text": "Sarah Grant. 2016. Introducing \"You Are Here\" |. Retrieved September 18, 2018 from https://towcenter.org/introducing-you-are-here/",
      "doi": ""
    },
    {
      "text": "Kyungsik Han, Patrick C. Shih, Mary Beth Rosson, and John M. Carroll. 2014. Enhancing community awareness of and participation in local heritage with a mobile application. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14, 1144--1155.  ",
      "doi": "10.1145/2531602.2531640"
    },
    {
      "text": "Kyungsik Han, Patrick C. Shih, Mary Beth Rosson, and John M. Carroll. 2014. Enhancing community awareness of and participation in local heritage with a mobile application. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14, 1144--1155.  ",
      "doi": "10.1145/2531602.2531640"
    },
    {
      "text": "Donna Haraway. 1991. A Cyborg Manifesto Science, Technology, And Socialist-Feminism In The Late Twentieth Century. In Simians, Cyborgs And Women: The Reinvention Of Nature. Routledge, New York, 149--181.",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. Simians, cyborgs, and women?: the reinvention of nature. Retrieved January 2, 2018 from https://books.google.co.uk/books?hl=en&lr=&id=23ff1vCaLPIC&oi=fnd&pg=P T9&dq=haraway+cyborg&ots=DH-apGPUJf&sig=GzIwS8q5YrKM8iD1k3IdFcnZ6s#v=onepage&q=haraway cyborg&f=false",
      "doi": ""
    },
    {
      "text": "Sandra Harding (Ed.). 2004. The feminist standpoint theory reader?: intellectual and political controversies. Routledge. Retrieved December 31, 2018 from https://books.google.co.uk/books?hl=en&lr=&id=qmSySHvIy5IC&oi=fnd&pg= PR9&dq=The+feminist+standpoint.&ots=q_O0md8Fmg&sig=sGlQb8H5k0rHt GHK-ez1OApUYZg#v=onepage&q=The feminist standpoint.&f=false",
      "doi": ""
    },
    {
      "text": "Rodney Harrison. 2015. Beyond \"Natural\" and \"Cultural\" Heritage: Toward an Ontological Politics of Heritage in the Age of Anthropocene. Herit. Soc. 8, 1 (May 2015), 24--42.",
      "doi": ""
    },
    {
      "text": "Rodney Harrison. 2017. Freezing Seeds and Making Futures: Endangerment, Hope, Security, and Time in Agrobiodiversity Conservation Practices. Cult. Agric. Food Environ. 39, 2 (December 2017), 80--89.",
      "doi": ""
    },
    {
      "text": "Rodney Harrison, Nadia Bartolini, Caitlin DeSilvey, Cornelius Holtorf, Antony Lyons, Sharon Macdonald, Sarah May, Jennie Morgan, and Sefryn Penrose. 2016. Heritage Futures. Archaeol. Int. 19, 0 (December 2016), 68--72.",
      "doi": ""
    },
    {
      "text": "Martin Heidegger and Joan Stambaugh. Being and Time. In Basic Writings: Martin Heidegger, Dennis J Schmidt (ed.). State University of New York Press, New York, Albany, USA.",
      "doi": ""
    },
    {
      "text": "Cornelius Holtorf and Anders Högberg. 2015. Contemporary Heritage and the Future. In The Palgrave Handbook of Contemporary Heritage Research. Palgrave Macmillan UK, London, 509--523.",
      "doi": ""
    },
    {
      "text": "Eva Hornecker, Michaela Honauer, and Luigina Ciolfi. 2014. Exploring historical cemeteries as a site for technological augmentation. In Proceedings of the 8th Irish Human Computer Interaction Conference. Retrieved September 18, 2018 from http://shura.shu.ac.uk/9496/",
      "doi": ""
    },
    {
      "text": "Awais Hameed Khan, Alyssa DiSalvo, Ki Wang Ng, Shiva Balachandran, Trevor Hunter, and Peter Worthy. 2017. The Sixth Sense. In Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '17, 745--750.",
      "doi": "10.1145/3024969.3035533"
    },
    {
      "text": "David Lowenthal. 2006. Stewarding the future. Nor. Geogr. Tidsskr. 60, 1 (March 2006), 15--23.",
      "doi": ""
    },
    {
      "text": "Sharon Macdonald. 2013. Memorylands: Heritage and identity in Europe today. Routledge, London and New York.",
      "doi": ""
    },
    {
      "text": "Maurice Merleau Ponty and Colin Smith. 2002. The Phenomenology of Perception. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Jennie Morgan and Sharon Macdonald. 2018. De-growing museum collections for new heritage futures. Int. J. Herit. Stud. 0, 0 (October 2018), 1--15.",
      "doi": ""
    },
    {
      "text": "Pedro J. S. Vieira de Oliveira and Luiza Prado de O. Martins. 2016. Decolonizing Ecologies of Time: Towards Speculative and Critical Design Practice in Latin America. J. New Media Caucus 12, 1 (2016). Retrieved January 2, 2019 from http://median.newmediacaucus.org/mestizo-technology-artdesign-and-technoscience-in-latin-america/decolonizing-ecologies-of-timetowards-speculative-and-critical-design-practice-in-latin-america/",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Esko Kurvinen, and Tomi Kankainen. 2003. Understanding contexts by being there: case studies in bodystorming. Pers. Ubiquitous Comput. 7, 2 (July 2003), 125--134.  ",
      "doi": "10.1007/s00779-003-0238-7"
    },
    {
      "text": "James Pierce and Eric Paulos. 2014. Counterfunctional things. In Proceedings of the 2014 conference on Designing interactive systems - DIS '14, 375--384.  ",
      "doi": "10.1145/2598510.2598522"
    },
    {
      "text": "HUGH RAFFLES. 2012. TWENTY-FIVE YEARS IS A LONG TIME. Cult. Anthropol. 27, 3 (August 2012), 526--534.",
      "doi": ""
    },
    {
      "text": "Stuart Reeves, Steve Benford, and Claire O Malley. 2005. Designing the Spectator Experience. In Proc. CHI 2005, 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Daniela K. Rosner, Samantha Shorey, Brock R. Craft, and Helen Remick. 2018. Making Core Memory. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--13.  ",
      "doi": "10.1145/3173574.3174105"
    },
    {
      "text": "Stan Ruecker. 2015. A Brief Taxonomy of Prototypes for the Digital Humanities. Sch. Res. Commun. 6, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Joy Sather-Wagstaff. 2017. Making polysense of the world. In Heritage, affect and emotion: politics, practices and infrastructures. Routledge, New York, 12-- 31.",
      "doi": ""
    },
    {
      "text": "Tom Schofield, Daniel Foster-Smith, Gönül Bozolu, and Christopher Whitehead. 2018. Co-Producing Collections: Re-imagining a Polyvocal Past with Cultural Probes. Open Libr. Humanit. 4, 1 (June 2018).",
      "doi": ""
    },
    {
      "text": "Daniel David Shoup and Luca Zan. 2013. Byzantine Planning: Site Management in Istanbul. Conserv. Manag. Archaeol. Sites 15, 2 (May 2013), 169--194.",
      "doi": ""
    },
    {
      "text": "Laurajane Smith. 2006. Uses of Heritage. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Jennyfer Lawrence Taylor, Anita Lee Hong, and Paul Roe. 2016. Cross-Cultural Dialogical Probes. In Proceedings of the First African Conference on Human Computer Interaction - AfriCHI'16, 114-- 125.  ",
      "doi": "10.1145/2998581.2998591"
    },
    {
      "text": "Nick Taylor. 2014. Supporting Community Participation in Interactive Exhibits. In Proceedings of The International Symposium on Pervasive Displays PerDis '14, 74--79.  ",
      "doi": "10.1145/2611009.2611031"
    },
    {
      "text": "Alda Terracciano, Mariza Dima, Marina Carulli, and Monica Bordegoni. 2017. Mapping Memory Routes. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17, 353--356.  ",
      "doi": "10.1145/3027063.3052958"
    },
    {
      "text": "Karen Umemoto. 2004. Walking in another's shoes: epistemological challenges in participatory planning. In Dialogues in Urban and Regional Planning, Bruce Stiftel and Vanessa Watson (eds.). Routledge, London, 196--224.",
      "doi": ""
    },
    {
      "text": "UN Educational Scientific and Cultural Organisation (UNESCO). 1972. UNESCO World Heritage Centre - Convention Concerning the Protection of the World Cultural and Natural Heritage. Retrieved September 19, 2017 from http://whc.unesco.org/en/conventiontext/",
      "doi": ""
    },
    {
      "text": "Ülke Evrim Uysal. 2012. An urban social movement challenging urban regeneration: The case of Sulukule, Istanbul. Cities 29, 1 (February 2012), 12-- 22.",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John Mccarthy, and Patrick Olivier. 2013. Configuring Participation: On How We Involve People In Design. (2013), 429--438.  ",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Chris Whitehead, Tom Schofield, Gonul Bozoglu, and Dan Foster-Smith. 2018. Plural Heritages. Retrieved January 3, 2019 from https://pluralheritages.ncl.ac.uk/#/about",
      "doi": ""
    },
    {
      "text": "Mel Woods and Deborah Maxwell. 2015. The Blue Plaque: Co-Creating Design Fictions in the Wild. In Research Through Design, 2--16.",
      "doi": ""
    },
    {
      "text": "History -- Association of Critical Heritage Studies. Retrieved November 22, 2017 from http://www.criticalheritagestudies.org/history/",
      "doi": ""
    }
  ]
}