{
  "doi": "10.1145/3290605.3300327",
  "title": "Ways of Knowing When Research Subjects Care",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2019,
  "badges": [],
  "abstract": "This paper investigates a hidden dimension of research with real world stakes: research subjects who care -- sometimes deeply -- about the topic of the research in which they participate. They manifest this care, we show, by managing how they are represented in the research process, by exercising politics in shaping knowledge production, and sometimes in experiencing trauma in the process. We draw first-hand reflections on participation in diversity research on Wikipedia, transforming participants from objects of study to active negotiators of research process. We depict how care, vulnerability, harm, and emotions shape ethnographic and qualitative data. We argue that, especially in reflexive cultures, research subjects are active agents with agendas, accountabilities, and political projects of their own. We propose ethics of care and collaboration to open up new possibilities for knowledge production and socio-technical intervention in HCI.",
  "authors": [
    {
      "name": "Dorothy Howard",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367099",
      "orcid": "missing"
    },
    {
      "name": "Lilly Irani",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459507",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lila Abu-Lughod. 2008. Writing against culture. In The Cultural Geography Reader. Routledge, 62--71.",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation Community Advocacy. 2015. Harassment survey. Retrieved December 14, 2018 from https://meta.wikimedia.org/wiki/Research: Harassment_survey_2015",
      "doi": ""
    },
    {
      "text": "Sara Ahmed. 2012. On Being Included: Racism and Diversity in Institutional Life. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Linda Alcoff. 1991. The problem of speaking for others. Cultural Critique 20 (1991), 5--32.",
      "doi": ""
    },
    {
      "text": "Judd Antin. 2011. My kind of people?: Perceptions about Wikipedia contributors and their motivations. In Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems (CHI'11). ACM Press, Vancouver, BC, Canada, 3411.  ",
      "doi": "10.1145/1978942.1979451"
    },
    {
      "text": "Gordana Apic, Matthew J Betts, and Robert B Russell. 2011. Content disputes in Wikipedia reflect geopolitical instability. PloS ONE 6, 6 (2011).",
      "doi": ""
    },
    {
      "text": "Mariam Asad and Christopher A Le Dantec. 2015. Illegitimate civic participation: Supporting community activists on the ground. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW'18). ACM, 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). ACM, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: Social science, feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11). ACM, 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Yochai Benkler. 2004. Sharing nicely: On shareable goods and the emergence of sharing as a modality of economic production. The Yale Law Journal 114, 2 (2004), 273.",
      "doi": ""
    },
    {
      "text": "Ivan Beschastnikh, Travis Kriplean, and David W McDonald. 2008. Wikipedian self-governance in action: Motivating the policy lens. In Proceedings of the International AAAI Conference on Web and Social Media (ICWSM'08).",
      "doi": ""
    },
    {
      "text": "Patrick Biernacki and Dan Waldorf. 1981. Snowball sampling: Problems and techniques of chain referral sampling. Sociological Methods & Research 10, 2 (1981), 141--163.",
      "doi": ""
    },
    {
      "text": "Maxine Birch and Tina Miller. 2000. Inviting intimacy: The interview as therapeutic opportunity. International Journal of Social Research Methodology 3, 3 (2000), 189--202.",
      "doi": ""
    },
    {
      "text": "Gro Bjerknes and Tone Bratteteig. 1995. User participation and democracy: A discussion of Scandinavian research on system development. Scandinavian Journal of Information Systems 7, 1 (1995), 73--98. ",
      "doi": "10.5555/211288.211293"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: Working with marginalised social movements. CoDesign 8, 2--3 (2012), 127--144.",
      "doi": ""
    },
    {
      "text": "Erling Bjarki Björgvinsson. 2008. Open-ended participatory design as prototypical practice. Co-Design 4, 2 (2008), 85--99.",
      "doi": ""
    },
    {
      "text": "Herbert Blumer. 1986. Symbolic Interactionism: Perspective and Method. University of California Press.",
      "doi": ""
    },
    {
      "text": "Tom Boellstorff, Bonnie Nardi, Celia Pearce, and Tina L Taylor. 2012. Ethnography and Virtual Worlds: A Handbook of Method. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the 2012 ACM Annual Conference on Human Factors in Computing Systems (CHI'12). ACM Press, 1125.  ",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "danah boyd and Nicole Ellison. 2007. Social network sites: Definition, history, and scholarship. Journal of Computer-Mediated Communication 13, 1 (2007), 210--230.  ",
      "doi": "10.1111/j.1083-6101.2007.00393.x"
    },
    {
      "text": "Jan Brace-Govan et al. 2004. Issues in snowball sampling: The lawyer, the model and ethics. Qualitative Research Journal 4, 1 (2004), 52.",
      "doi": ""
    },
    {
      "text": "Samantha Breslin and Bimlesh Wadhwa. 2014. Exploring nuanced gender perspectives within the HCI community. In Proceedings of the India 2014 HCI Conference on Human Computer Interaction. ACM, 45.  ",
      "doi": "10.1145/2676702.2676709"
    },
    {
      "text": "Kath Browne. 2005. Snowball sampling: Using social networks to research non-heterosexual women. International Journal of Social Research Methodology 8, 1 (2005), 47--60.",
      "doi": ""
    },
    {
      "text": "Amy Bruckman. 2014. Research ethics and HCI. In Ways of Knowing in HCI. Springer, 449--468.",
      "doi": ""
    },
    {
      "text": "Elizabeth A Buchanan and Charles M Ess. 2009. Internet research ethics and the institutional review board: Current practices and issues. Computers and Society 39, 3 (2009), 43--49.  ",
      "doi": "10.1145/1713066.1713069"
    },
    {
      "text": "Anupam Chander and Madhavi Sunder. 2004. The romance of the public domain. California Law Review 92, 5 (2004).",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 1996. Grounded theory. In Rethinking Methods in Psychology, J.A. Smith, R. Harre, and L. Van Langenhove (Eds.). SAGE Publications, 27--49.",
      "doi": ""
    },
    {
      "text": "An-Shou Cheng and Kenneth R Fleischmann. 2010. Developing a meta-inventory of human values. In Proceedings of the 73rd ASIS&T Annual Meeting on Navigating Streams in an Information Ecosystem. American Society for Information Science, 3. ",
      "doi": "10.5555/1920331.1920337"
    },
    {
      "text": "Hichang Cho, MeiHui Chen, and Siyoung Chung. 2010. Testing an integrative theoretical model of knowledge-sharing behavior in the context of Wikipedia. Journal of the American Society for Information Science and Technology 61, 6 (2010), 1198--1212. ",
      "doi": "10.5555/1814490.1814499"
    },
    {
      "text": "Adele E Clarke. 2003. Situational analyses: Grounded theory mapping after the postmodern turn. Symbolic Interaction 26, 4 (2003), 553--576.",
      "doi": ""
    },
    {
      "text": "E. Gabriella Coleman. 2012. Coding Freedom: The Ethics and Aesthetics of Hacking. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Benjamin Collier and Julia Bear. 2012. Conflict, confidence, or criticism: An empirical examination of the gender gap in Wikipedia. Proceedings of the SIGCHI Conference on Computer Supported Cooperative Work (CSCW'12) (2012), 383--392.  ",
      "doi": "10.1145/2145204.2145265"
    },
    {
      "text": "Pamela Cotterill. 1992. Interviewing women: Issues of friendship, vulnerability, and power. In Women's Studies International Forum, Vol. 15. 593--606.",
      "doi": ""
    },
    {
      "text": "Susan M Cox and Michael McDonald. 2013. Ethics is for human subjects too: Participant perspectives on responsibility in health research. Social Science & Medicine 98 (2013), 224--231.",
      "doi": ""
    },
    {
      "text": "Mary L. Cummings. 2006. Integrating ethics in design through the valuesensitive design approach. Science and Engineering Ethics 12, 4 (2006), 701--715.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2 (2013), 241--264.",
      "doi": ""
    },
    {
      "text": "Maria Puig de la Bellacasa. 2011. Matters of care in technoscience: Assembling neglected things. Social Studies of Science 41, 1 (2011), 85--106.",
      "doi": ""
    },
    {
      "text": "María Puig de La Bellacasa. 2017. Matters of Care: Speculative Ethics in More than Human Worlds. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Norman K Denzin and Yvonna S Lincoln. 2008. Strategies of Qualitative Inquiry. Vol. 2. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Vinciane Despret. 2004. The body we care for: Figures of anthropo-zoo-genesis. Body & Society 10, 2--3 (2004), 111--134.",
      "doi": ""
    },
    {
      "text": "Virginia Dickson-Swift, Erica L James, Sandra Kippen, and Pranee Liamputtong. 2006. Blurring boundaries in qualitative health research on sensitive topics. Qualitative Health Research 16, 6 (2006), 853--871.",
      "doi": ""
    },
    {
      "text": "Virginia Dickson-Swift, Erica L James, Sandra Kippen, and Pranee Liamputtong. 2009. Researching sensitive topics: Qualitative research as emotion work. Qualitative Research 9, 1 (2009), 61--79.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial Design. The MIT Press. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things: How HCI design can express matters of concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'14). ACM, 2397--2406.  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS'16). ACM, 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Fernando Dominguez Rubio. 2016. On the discrepancy between objects and things: An ecological approach. Journal of Material Culture 21, 1 (2016), 59--86.",
      "doi": ""
    },
    {
      "text": "Stine Eckert and Linda Steiner. 2013. (Re)triggering backlash: Responses to news about Wikipedia's gender gap. Journal of Communication Inquiry 37, 4 (2013), 284--303.",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 2017. Scandinavian design: On participation and skill. In Participatory Design. CRC Press, 41--77.",
      "doi": ""
    },
    {
      "text": "Carolyn Ellis. 2007. Telling secrets, revealing lives: Relational ethics in research with intimate others. Qualitative Inquiry 13, 1 (2007), 3--29.",
      "doi": ""
    },
    {
      "text": "Steven Epstein. 1996. Impure Science: AIDS, Activism, and the Politics of Knowledge. University of California Press.",
      "doi": ""
    },
    {
      "text": "Kim Etherington. 2007. Ethical research in reflexive relationships. Qualitative inquiry 13, 5 (2007), 599--616.",
      "doi": ""
    },
    {
      "text": "Frantz Fanon. 1970. Black Skin, White Masks. Grove Press.",
      "doi": ""
    },
    {
      "text": "Heather Ford and Judy Wajcman. 2017. 'Anyone can edit', not everyone does: Wikipedia's infrastructure and the gender gap. Social Studies of Science 47, 4 (2017), 511--527.",
      "doi": ""
    },
    {
      "text": "Michel Foucault and Paul Rabinow. 1984. What is Enlightenment? In The Foucault Reader. Vol. 43. Random House.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Mariam Asad, Katherine Lo, Jill P Dimond, Lynn S Dombrowski, and Shaowen Bardzell. 2016. Exploring social justice, design, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'16). ACM, 3293--3300.  ",
      "doi": "10.1145/2851581.2856465"
    },
    {
      "text": "Mark Frankel and Sanyin Siang. 1999. Ethical and legal aspects of human subjects research on the Internet. American Association for the Advancement of Science.",
      "doi": ""
    },
    {
      "text": "Paulo Freire. 2018. Pedagogy of the Oppressed. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Alan Borning, Janet L Davis, Brian T Gill, Peter H Kahn Jr, Travis Kriplean, and Peyina Lin. 2008. Laying the foundations for public participation and value advocacy: Interaction design for a large scale urban simulation. In Proceedings of the International Conference on Digital Government Research. 305-- 314. ",
      "doi": "10.5555/1367832.1367883"
    },
    {
      "text": "Batya Friedman, Peter H Kahn, Alan Borning, and Alina Huldtgren. 2013. Value sensitive design and information systems. In Early Engagement and New Technologies: Opening up the Laboratory. Springer, 55--95.",
      "doi": ""
    },
    {
      "text": "Radhika Gajjala. 2002. An interrupted postcolonial/feminist cyberethnography: Complicity and resistance in the \"cyberfield\". Feminist Media Studies 2, 2 (2002).",
      "doi": ""
    },
    {
      "text": "R Stuart Geiger and David Ribes. 2010. The work of sustaining order in Wikipedia: The banning of a vandal. In Proceedings of the SIGCHI Conference on CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Dorothy Howard and Lilly Irani Computer Supported Cooperative Work (CSCW'10). ACM, 117--126.  ",
      "doi": "10.1145/1718918.1718941"
    },
    {
      "text": "Cathy Gere. 2017. Pain, Pleasure and the Greater Good: From the Panopticon to the Skinner Box and Beyond. The University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Ruediger Glott, Philipp Schmidt, and Rishab Ghosh. 2010. Wikipedia survey: Overview of results. United Nations University, Collaborative Creativity Group (2010), 1158--1178.",
      "doi": ""
    },
    {
      "text": "Scott A Golder and Michael W Macy. 2014. Digital footprints: Opportunities and challenges for online social research. Annual Review of Sociology 40 (2014), 129--152.",
      "doi": ""
    },
    {
      "text": "Marilys Guillemin and Lynn Gillam. 2004. Ethics, reflexivity, and \"ethically important moments\" in research. Qualitative Inquiry 10, 2 (2004), 261--280.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R. Stuart Geiger, Jonathan T. Morgan, and John Riedl. 2013. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist 57, 5 (May 2013), 664--688.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, and John Riedl. 2011. Don't bite the newbies: How reverts affect the quantity and quality of Wikipedia work. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym'11). ACM, 163--172.  ",
      "doi": "10.1145/2038558.2038585"
    },
    {
      "text": "Maurice Hamington et al. 2004. Embodied Care: Jane Addams, Maurice MerleauPonty, and Feminist Ethics. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Martyn Hammersley and Paul Atkinson. 2007. Ethnography: Principles in Practice. Routledge.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist Studies 14, 3 (1988), 575--599.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2007. When Species Meet. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Sandra Harding. 1992. Rethinking standpoint epistemology: What is \"strong objectivity?\". The Centennial Review 36, 3 (1992), 437--470.",
      "doi": ""
    },
    {
      "text": "Sandra G Harding. 1986. The Science Question in Feminism. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Aaron Shaw. 2015. Mind the skills gap: The role of Internet know-how and gender in differentiated contributions to Wikipedia. Information, Communication & Society 18, 4 (2015), 424--442.",
      "doi": ""
    },
    {
      "text": "Kieran Healy and Alan Schussman. 2003. The ecology of open-source software development. Technical Report. Department of Sociology. University of Arizona.",
      "doi": ""
    },
    {
      "text": "Charlotte Hess and Elinor Ostrim. 2008. Understanding knowledge as a commons: From theory to practice. Journal of the American Society for Information Science and Technology 59, 2 (2008), 333--334. ",
      "doi": "10.5555/1331268.1331280"
    },
    {
      "text": "Benjamin Mako Hill and Aaron Shaw. 2013. The Wikipedia gender gap revisited: Characterizing survey response bias with propensity score estimation. PLoS ONE 8, 6 (June 2013).",
      "doi": ""
    },
    {
      "text": "Christine Hine. 2000. Virtual Ethnography. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Douglas R Holmes and George E Marcus. 2008. Collaboration today and the re-imagination of the classic scene of fieldwork encounter. Collaborative Anthropologies 1, 1 (2008), 81--101.",
      "doi": ""
    },
    {
      "text": "Bell Hooks. 2014. Teaching To Transgress. Routledge.",
      "doi": ""
    },
    {
      "text": "James M Hudson and Amy Bruckman. 2004. \"Go away\": Participant objections to being studied and the ethics of chatroom research. The Information Society 20, 2 (2004), 127--139.",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: A lens on design and development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). ACM, 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Lilly C Irani and M Silberman. 2016. Stories we tell about labor: Turkopticon and the trouble with design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 4573--4586.  ",
      "doi": "10.1145/2858036.2858592"
    },
    {
      "text": "Steven J Jackson. 2014. Rethinking repair. In Media Technologies: Essays on Communication, Materiality, and Society. MIT Press, 221--239.",
      "doi": ""
    },
    {
      "text": "Nassim JafariNaimi, Lisa Nathan, and Ian Hargraves. 2015. Values as hypotheses: Design, inquiry, and the service of values. Design Issues 31, 4 (2015), 91--104.",
      "doi": ""
    },
    {
      "text": "Dariusz Jemielniak. 2014. Common Knowledge?: An Ethnography of Wikipedia. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Andreas M Kaplan and Michael Haenlein. 2010. Users of the world, unite! The challenges and opportunities of social media. Business Horizons 53, 1 (2010), 59--68.",
      "doi": ""
    },
    {
      "text": "Orit Karnieli-Miller, Roni Strier, and Liat Pessach. 2009. Power relations in qualitative research. Qualitative Health Research 19, 2 (2009), 279--289.",
      "doi": ""
    },
    {
      "text": "Christopher M. Kelty. 2008. Two Bits: The Cultural Significance of Free Software. Duke University Press. ",
      "doi": "10.5555/1481673"
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory design: Issues and concerns. Computer Supported Cooperative Work (CSCW'98) 7, 3--4 (1998), 167-- 185.  ",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Eva Feder Kittay and Ellen K Feder. 2003. The Subject of Care: Feminist Perspectives on Dependency. Rowman & Littlefield.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'08). ACM, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Aniket Kittur, Bongwon Suh, Bryan A. Pendleton, and Ed H. Chi. 2007. He says, she says: Conflict and coordination in Wikipedia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'07). ACM Press, San Jose, California, USA, 453.  ",
      "doi": "10.1145/1240624.1240698"
    },
    {
      "text": "Shyong (Tony) K. Lam, Anuradha Uduwage, Zhenhua Dong, Shilad Sen, David R. Musicant, Loren Terveen, and John Riedl. 2011. WP:clubhouse?: An exploration of Wikipedia's gender imbalance. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym'11). ACM Press, 1.  ",
      "doi": "10.1145/2038558.2038560"
    },
    {
      "text": "Joanna Latimer and Maria Puig de la Bellacasa. 2013. Re-thinking the ethical: Everyday shifts of care in biogerontology. Ethics, Law and Society 5 (2013), 153--174.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2008. A cautious prometheus?: A few steps toward a philosophy of design (with special attention to Peter Sloterdijk). In Proceedings of the 2008 annual international conference of the Design History Society. 2--10.",
      "doi": ""
    },
    {
      "text": "Bruno Latour and Steve Woolgar. 2013. Laboratory life: The Construction of Scientific facts. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec, Erika Shehan Poole, and Susan P Wyche. 2009. Values as lived experience: Evolving value sensitive design in support of value discovery. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09). ACM, 1141--1150.  ",
      "doi": "10.1145/1518701.1518875"
    },
    {
      "text": "Norman K Denzin Yvonna S Lincoln, Yvonna S Lincoln, et al. 2005. The Sage Handbook of Qualitative Research. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Yvonna S. Lincoln and Egon G. Guba. 1985. Naturalistic Inquiry. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Aryn Martin, Natasha Myers, and Ana Viseu. 2015. The politics of care in technoscience. Social Studies of Science 45, 5 (2015), 625--641.",
      "doi": ""
    },
    {
      "text": "Adrienne Massanari. 2017. #Gamergate and The Fappening: How Reddit's algorithm, governance, and culture support toxic technocultures. New Media & Society 19, 3 (2017), 329--346.",
      "doi": ""
    },
    {
      "text": "Annemarie Mol. 2008. The Logic of Care: Health and the Problem of Patient Choice. Routledge.",
      "doi": ""
    },
    {
      "text": "Wendy Moncur. 2013. The emotional wellbeing of researchers: Considerations for practice. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'13) (2013), 8.  ",
      "doi": "10.1145/2470654.2466248"
    },
    {
      "text": "Jonathan T Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and sympathy: Crafting positive new user experiences on Wikipedia. In Proceedings of the SIGCHI Conference on Computer Supported Cooperative Work (CSCW'13). ACM, 839--848.  ",
      "doi": "10.1145/2441776.2441871"
    },
    {
      "text": "Norma Morris and Brian Bàlmer. 2006. Volunteer human subjects' understandings of their participation in a biomedical research experiment. Social Science & Medicine 62, 4 (2006), 998--1008.",
      "doi": ""
    },
    {
      "text": "Torill Elvira Mortensen. 2018. Anger, fear, and games: The long event of #GamerGate. Games and Culture 13, 8 (2018), 787--806.",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Allison Druin. 2003. Participatory design: The third space in HCI. In Human-Computer Interaction: Development Process.",
      "doi": ""
    },
    {
      "text": "Ruth Müller and Martha Kenney. 2014. Agential conversations: Interviewing postdoctoral life scientists and the politics of mundane research practices. Science as Culture 23, 4 (2014), 537--559.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, and John Vines. 2015. Situational ethics: Re-thinking approaches to formal ethics requirements for human-computer interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'15). ACM Press, Seoul, Republic of Korea, 105--114.  ",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Keith M. Murphy. 2019. Swedish Design: An Ethnography. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Michelle Murphy. 2015. Unsettling care: Troubling transnational itineraries of care in feminist health practices. Social Studies of Science 45, 5 (2015), 717--737.",
      "doi": ""
    },
    {
      "text": "Lisa P. Nathan, Anja Thieme, Deborah Tatar, and Stacy Branham. 2016. Disruptions, dilemmas and paradoxes: Ethical matter(s) in design research. Interacting with Computers (2016), 1--9.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression: How Search Engines Reinforce Racism. NYU Press.",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation Board of Trustees. 2016. Statement on healthy community culture, inclusivity, and safe spaces. Retrieved December 14, 2018 from https://web.archive.org/web/20190107195418/https://meta.wikimedia. org/wiki/Wikimedia_Foundation_Board_noticeboard/November_2016_-_ Statement_on_Healthy_Community_Culture,_Inclusivity,_and_Safe_Spaces",
      "doi": ""
    },
    {
      "text": "Julian E Orr. 1990. Sharing knowledge, celebrating identity: Community memory in a service culture. In Collective Remembering. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Sherry B Ortner. 1984. Theory in anthropology since the sixties. Comparative Studies in Society and History 26, 1 (1984), 126--166.",
      "doi": ""
    },
    {
      "text": "Judith Phillips. 2007. Care. Polity.",
      "doi": ""
    },
    {
      "text": "Joseph Reagle and Lauren Rhue. 2011. Gender bias in Wikipedia and Britannica. International Journal of Communication 5 (2011), 21.",
      "doi": ""
    },
    {
      "text": "Joseph Michael Reagle. 2010. Good Faith Collaboration: The Culture of Wikipedia. MIT Press. ",
      "doi": "10.5555/1869901"
    },
    {
      "text": "Annelise Riles. 2015. From comparison to collaboration: Experiments with a new scholarly and political reform. Law & Contemporary Problems 78 (2015).",
      "doi": ""
    },
    {
      "text": "Jennifer A Rode. 2011. Reflexivity in digital anthropology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, 123--132.  ",
      "doi": "10.1145/1978942.1978961"
    },
    {
      "text": "Jennifer A Rode. 2011. A theoretical agenda for feminist HCI. Interacting with Computers 23, 5 (2011), 393--400.  ",
      "doi": "10.1016/j.intcom.2011.04.005"
    },
    {
      "text": "Anita Sarkeesian. 2012. Harassment via wikipedia vandalism. Retrieved November 19, 2018 from https://feministfrequency.com/2012/06/10/ harassment-and-misogyny-via-wikipedia/",
      "doi": ""
    },
    {
      "text": "Ralph Schroeder and Linnet Taylor. 2015. Big data and Wikipedia research: Social science knowledge across disciplinary divides. Information, Communication & Society 18, 9 (2015), 1039--1056.",
      "doi": ""
    },
    {
      "text": "Douglas Schuler and Aki Namioka. 1993. Participatory Design: Principles and Practices. CRC Press. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Carolyn B Seaman. 1999. Qualitative methods in empirical studies of software engineering. IEEE Transactions on Software Engineering 4 (1999), 557--572.  ",
      "doi": "10.1109/32.799955"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective design. In Proceedings of the 4th Decennial Conference on Critical Computing between Sense and Sensibility (CC'05). ACM Press, Aarhus, Denmark, 49.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Irina Shklovski and Janet Vertesi. 2012. \"Un-Googling\": Research technologies, communities at risk and the ethics of user studies in HCI. In Proceedings of the BCS HCI Workshop on HCI Research in Sensitive Contexts: Ethical Considerations.",
      "doi": ""
    },
    {
      "text": "Dorothy E Smith. 1990. The Conceptual Practices of Power: A Feminist Sociology of Knowledge. University of Toronto Press.",
      "doi": ""
    },
    {
      "text": "Marilyn Strathern. 1985. Dislodging a world view: Challenge and counterchallenge in the relationship between feminism and anthropology. Australian Feminist Studies 1, 1 (1985), 1--25.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss. 1982. Social worlds and legitimation processes. Studies in Symbolic Interaction 4, 17 (1982).",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2002. Located accountabilities in technology production. Scandinavian Journal of Information Systems 14, 2 (2002), 7. ",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and Situated Actions: The Problem of HumanMachine Communication. Cambridge University Press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Alex Taylor. 2011. Out there. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11) (2011), 10.",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "John Torous and Camille Nebeker. 2017. Navigating ethics in the digital age: Introducing Connected and Open Research Ethics (CORE), a tool for researchers and institutional review boards. Journal of Medical Internet Research 19, 2 (2017).",
      "doi": ""
    },
    {
      "text": "Joan C Tronto. 1993. Moral Boundaries: A Political Argument for an Ethic of Care. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Jose van Dijck. 2013. The Culture of Connectivity: A Critical History of Social Media. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viégas, Martin Wattenberg, and Kushal Dave. 2004. Studying cooperation and conflict between authors with history flow visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'04). ACM, 575--582.  ",
      "doi": "10.1145/985692.985765"
    },
    {
      "text": "Kamala Visweswaran. 1994. Fictions of Feminist Ethnography. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Kamala Visweswaran. 1997. Histories of feminist ethnography. Annual Review of Anthropology 26, 1 (1997), 591--621.",
      "doi": ""
    },
    {
      "text": "Martin Wattenberg, Fernanda B Viégas, and Katherine Hollenbach. 2007. Visualizing activity on Wikipedia with chromograms. In IFIP Conference on HumanComputer Interaction. Springer, 272--287. ",
      "doi": "10.5555/1778331.1778361"
    },
    {
      "text": "Etienne Wenger. 1999. Communities of Practice: Learning, Meaning, and Identity. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Sarah Whatmore. 1997. Dissecting the autonomous self: Hybrid cartographies for a relational ethics. Environment and Planning: Society and Space 15, 1 (Feb. 1997), 37--53.",
      "doi": ""
    },
    {
      "text": "Elena Ariel Windsong. 2018. Incorporating intersectionality into research design: An example using qualitative interviews. International Journal of Social Research Methodology 21, 2 (March 2018), 135--147.",
      "doi": ""
    },
    {
      "text": "L Mun Wong. 1998. The ethics of rapport: Institutional safeguards, resistance, and betrayal. Qualitative Inquiry 4, 2 (1998), 178--199.",
      "doi": ""
    },
    {
      "text": "Fei Wu and Daniel S Weld. 2007. Autonomously semantifying wikipedia. In Proceedings of the ACM Conference on Conference on Information and Knowledge Management. ACM, 41--50.  ",
      "doi": "10.1145/1321440.1321449"
    },
    {
      "text": "Taha Yasseri, Robert Sumi, András Rung, András Kornai, and János Kertész. 2012. Dynamics of conflicts in Wikipedia. PloS ONE 7, 6 (2012).",
      "doi": ""
    }
  ]
}