{
  "doi": "10.1145/3290605.3300583",
  "title": "\"I was really, really nervous posting it\": Communicating about Invisible Chronic Illnesses across Social Media Platforms",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "People with invisible chronic illnesses (ICIs) can use social media to seek both informational and emotional support, but these individuals also face social and health-related challenges in posting about their often-stigmatized conditions online. To understand how they evaluate different platforms for disclosure, we interviewed 19 people with ICIs who post on general social media about their illnesses, such as Facebook, Instagram, and Twitter. We present a cross-platform analysis of how platforms varied in their suitability to achieve participants' goals, as well as the challenges posed by each platform. We also found that as participants' ICIs progressed, their goals, challenges, and social media use similarly evolved over time. Our findings highlight how people with ICIs select platforms from a broader ecology of social media and suggest a general need to understand shifts in social media use for populations with chronic but changing health concerns.",
  "tags": [
    "invisible chronic illness",
    "health",
    "media ecology",
    "social media"
  ],
  "authors": [
    {
      "name": "Shruti Sannon",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-99659161275/rel-imgonly/ssannon.png",
      "acmid": "99659161275",
      "orcid": "0000-0002-2018-1190"
    },
    {
      "name": "Elizabeth L. Murnane",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81381605773/rel-imgonly/murnane2020-for-circle.png",
      "acmid": "81381605773",
      "orcid": "missing"
    },
    {
      "name": "Natalya N. Bazarova",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100246383",
      "orcid": "0000-0001-5375-6598"
    },
    {
      "name": "Geri Gay",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367597457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 158.  ",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi, Margaret Morris, and Andrea Forte. 2018. Testing Waters, Sending Clues: Indirect Disclosures of Socially Stigmatized Experiences on Social Media. Proc. ACM Hum.-Comput. Interact 2 (2018).  ",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Natalya N Bazarova, Jessie G Taft, Yoon Hyung Choi, and Dan Cosley. 2013. Managing impressions and relationships on Facebook: Selfpresentational and relational concerns revealed through the analysis of language style. Journal of Language and Social Psychology 32, 2 (2013), 121--141.",
      "doi": ""
    },
    {
      "text": "Jacqueline L Bender, Maria-Carolina Jimenez-Marroquin, and Alejandro R Jadad. 2011. Seeking support on facebook: a content analysis of breast cancer groups. Journal of Medical Internet Research 13, 1 (2011).",
      "doi": ""
    },
    {
      "text": "Magdalena Berger, Todd HWagner, and Laurence C Baker. 2005. Internet use and stigmatized illness. Social Science & Medicine 61, 8 (2005), 1821--1827.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. Sage.",
      "doi": ""
    },
    {
      "text": "Pamara F Chang, Yoon Hyung Choi, Natalya N Bazarova, and Corinna E Löckenhoff. 2015. Age differences in online social networking: Extending socioemotional selectivity theory to social network sites. Journal of Broadcasting & Electronic Media 59, 2 (2015), 221--239.",
      "doi": ""
    },
    {
      "text": "Yu Chen, Yunan Chen, Mirana Michelle Randriambelonoro, Antoine Geissbuhler, and Pearl Pu. 2017. Design Considerations for Social Fitness Applications: Comparing Chronically Ill Patients and Healthy Adults. In Proceedings of the 2017 ACM Conference on Computer- Supported Cooperative Work and Social Computing. ACM, 1753--1762.  ",
      "doi": "10.1145/2998181.2998350"
    },
    {
      "text": "Peter Conrad and Kristin K Barker. 2010. The social construction of illness: Key insights and policy implications. Journal of Health and Social Behavior 51 (2010), S67--S79.",
      "doi": ""
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1988. Unending work and care: Managing chronic illness at home. Jossey-Bass.",
      "doi": ""
    },
    {
      "text": "Dan Cosley, Kathy Akey, Brian Alson, Jonathan Baxter, Mark Broomfield, Soyoung Lee, and Chethan Sarabu. 2009. Using technologies to support reminiscence. In Proceedings of the 23rd British HCI Group Annual Conference on People and Computers: Celebrating People and Technology. British Computer Society, 480--484. ",
      "doi": "10.5555/1671011.1671073"
    },
    {
      "text": "Neil S Coulson. 2005. Receiving social support online: an analysis of a computer-mediated support group for individuals living with irritable bowel syndrome. CyberPsychology & Behavior 8, 6 (2005), 580--584.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Meredith Ringel Morris, and Ryen W White. 2014. Seeking and sharing health information online: comparing search engines and social media. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 1365--1376.  ",
      "doi": "10.1145/2556288.2557214"
    },
    {
      "text": "Paul J Donoghue and Mary E Siegel. 2000. Sick and Tired of Feeling Sick and Tired: Living with Invisible Chronic Illness (New Edition). WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Brooke E Duffy. 2017. The trend of fake Instagram accounts exposes the troubling way that work is taking over our lives. Quartz (2017).",
      "doi": ""
    },
    {
      "text": "Brooke Erin Duffy and Ngai Keung Chan. 2018. \"You never really know who's looking\": Imagined surveillance across social media platforms. New Media & Society (2018).",
      "doi": ""
    },
    {
      "text": "Brooke Erin Duffy, Urszula Pruchniewska, and Leah Scolere. 2017. Platform-Specific Self-Branding: Imagined Affordances of the Social Media Ecology. In Proceedings of the 8th International Conference on Social Media & Society. ACM, 5.  ",
      "doi": "10.1145/3097286.3097291"
    },
    {
      "text": "Shelly D Farnham and Elizabeth F Churchill. 2011. Faceted identity, faceted lives: social and technical issues with being yourself online. In Proceedings of the 2011 ACM conference on Computer-Supported Cooperative Work. ACM, 359--368.  ",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "David Field. 1976. The social definition of illness. An Introduction to Medical Sociology (1976).",
      "doi": ""
    },
    {
      "text": "Roger B Fillingim, Christopher D King, Margarete C Ribeiro-Dasilva, Bridgett Rahim-Williams, and Joseph L Riley. 2009. Sex, gender, and pain: a review of recent clinical and experimental findings. The Journal of Pain 10, 5 (2009), 447--485.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The Presentation of Self in Everyday Life. Garden City, NY: Doubleday Anchor Books.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1963. Stigma: Notes on a spoiled identity. Jenkins, JH & Carpenter (1963).",
      "doi": ""
    },
    {
      "text": "Elena Gonzalez-Polledo. 2016. Chronic media worlds: social media and the problem of pain communication on Tumblr. Social Media+ Society 2, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Elena Gonzalez-Polledo and Jen Tarr. 2016. The thing about pain: The remaking of illness narratives in chronic pain expressions on social media. New Media & Society 18, 8 (2016), 1455--1472.",
      "doi": ""
    },
    {
      "text": "Jeremy A Greene, Niteesh K Choudhry, Elaine Kilabuk, and William H Shrank. 2011. Online social networking by patients with diabetes: a qualitative evaluation of communication with Facebook. Journal of General Internal Medicine 26, 3 (2011), 287--292.",
      "doi": ""
    },
    {
      "text": "Kathryn Greene. 2000. Disclosure of chronic illness varies by topic and target: The role of stigma and boundaries in willingness to disclose. In Balancing the secrets of private disclosures, Sandra Petronio (Ed.). Psychology Press, 123--135.",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Anne E Bowser, Edward F Melcer, and Elizabeth F Churchill. 2015. Online inspiration and exploration for identity reinvention. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3809--3818.  ",
      "doi": "10.1145/2702123.2702270"
    },
    {
      "text": "Oliver L Haimson, Jed R Brubaker, Lynn Dombrowski, and Gillian R Hayes. 2016. Digital footprints and changing networks during online identity transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2895--2907.  ",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Hsiu-Fang Hsieh and Jing-Jy Wang. 2003. Effect of reminiscence therapy on depression in older adults: a systematic review. International Journal of Nursing Studies 40, 4 (2003), 335--345.",
      "doi": ""
    },
    {
      "text": "Jina Huh, Leslie S Liu, Tina Neogi, Kori Inkpen, andWanda Pratt. 2014. Health vlogs as social support for chronic illness management. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 4 (2014), 23.  ",
      "doi": "10.1145/2630067"
    },
    {
      "text": "Maia L Jacobs, James Clawson, and Elizabeth D Mynatt. 2014. My journey compass: a preliminary investigation of a mobile tool for cancer patients. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 663--672.  ",
      "doi": "10.1145/2556288.2557194"
    },
    {
      "text": "Jessica Keim-Malpass and Richard H Steeves. 2012. Talking with death at a diner: young women's online narratives of cancer. In Oncology Nursing Forum, Vol. 39.",
      "doi": ""
    },
    {
      "text": "Robert S Laufer and Maxine Wolfe. 1977. Privacy as a concept and a social issue: A multidimensional developmental theory. Journal of Social Issues 33, 3 (1977), 22--42.",
      "doi": ""
    },
    {
      "text": "Yvonna S Lincoln and Egon G Guba. 1985. Establishing trustworthiness. Naturalistic Inquiry 289 (1985), 331. {35} Bruce G Link and Jo C Phelan. 2006. Stigma and its public health implications. The Lancet 367, 9509 (2006), 528--529.",
      "doi": ""
    },
    {
      "text": "Leslie S Liu, Kori M Inkpen, and Wanda Pratt. 2015. I'm not like my friends: understanding how children with a chronic illness use technology to maintain normalcy. In Proceedings of the 18th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1527--1539.  ",
      "doi": "10.1145/2675133.2675201"
    },
    {
      "text": "Cristina Lonardi. 2007. The passing dilemma in socially invisible diseases: Narratives on chronic headache. Social Science & Medicine 65, 8 (2007), 1619--1629.",
      "doi": ""
    },
    {
      "text": "Brenda Major and Laurie T O'Brien. 2005. The social psychology of stigma. Annual Review of Psycholology 56 (2005), 393--421.",
      "doi": ""
    },
    {
      "text": "Alice E Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (2011), 114--133.",
      "doi": ""
    },
    {
      "text": "Fadhila Mazanderani, Louise Locock, and John Powell. 2012. Being differently the same: The mediation of identity tensions in the sharing of illness experiences. Social Science & Medicine 74, 4 (2012), 546--553.",
      "doi": ""
    },
    {
      "text": "Mark Merolli, Kathleen Gray, and Fernando Martin-Sanchez. 2013. Health outcomes and related effects of using social media in chronic disease management: a literature review and analysis of affordances. Journal of Biomedical Informatics 46, 6 (2013), 957--969.  ",
      "doi": "10.1016/j.jbi.2013.04.010"
    },
    {
      "text": "S Anne Moorhead, Diane E Hazlett, Laura Harrison, Jennifer K Carroll, Anthea Irwin, and Ciska Hoving. 2013. A new dimension of health care: systematic review of the uses, benefits, and limitations of social media for health communication. Journal of Medical Internet Research 15, 4 (2013).",
      "doi": ""
    },
    {
      "text": "Tsubasa Morioka, Nicole B Ellison, and Michael Brown. 2016. Identity work on social media sites: Disadvantaged students' college transition processes. In Proceedings of the 19th ACM Conference on Computer- Supported Cooperative Work & Social Computing. ACM, 848--859.  ",
      "doi": "10.1145/2818048.2819959"
    },
    {
      "text": "Jessica Gall Myrick, Avery E Holton, Itai Himelboim, and Brad Love. 2016. # Stupidcancer: exploring a typology of social support and the role of emotional expression in a social media community. Health Communication 31, 5 (2016), 596--605.",
      "doi": ""
    },
    {
      "text": "Aisling A O'Kane, Helena M Mentis, and Eno Thereska. 2013. Nonstatic nature of patient consent: shifting privacy perspectives in health information sharing. In Proceedings of the 2013 Conference on Computer- Supported Cooperative Work. ACM, 553--562.  ",
      "doi": "10.1145/2441776.2441838"
    },
    {
      "text": "Kathleen O'Leary, Arpita Bhattacharya, Sean A Munson, Jacob O Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies.. In Proceedings of the 2017 ACM Conference on Computer-supported Cooperative Work. 1470--1484.  ",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Julia Omarzu. 2000. A disclosure decision model: Determining how and when individuals will self-disclose. Personality and Social Psychology Review 4, 2 (2000), 174--185.",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke and Sabine Trepte. 2014. Authenticity and wellbeing on social network sites: A two-wave longitudinal study on the effects of online authenticity and the positivity bias in SNS communication. Computers in Human Behavior 30 (2014), 95--102.  ",
      "doi": "10.1016/j.chb.2013.07.030"
    },
    {
      "text": "Pamela Katz Ressler, Ylisabyth S Bradshaw, Lisa Gualtieri, and Kenneth Kwan Ho Chui. 2012. Communicating the experience of chronic pain and illness through blogging. Journal of Medical Internet Research 14, 5 (2012).",
      "doi": ""
    },
    {
      "text": "Shruti Sannon, Yoon Hyung Choi, Jessie G Taft, and Natalya N Bazarova. 2017. What Comments Did I Get? How Post and Comment Characteristics Predict Interaction Satisfaction on Facebook. In Proceedings of the International Conference on Web and Social Media (ICWSM). 664--667.",
      "doi": ""
    },
    {
      "text": "Neil Seeman. 2008. Web 2.0 and chronic illness: New horizons, new opportunities. Healthcare Quarterly 11, 1 (2008), 104--8.",
      "doi": ""
    },
    {
      "text": "Bryan Semaan, Lauren M Britton, and Bryan Dosono. 2017. Military masculinity and the travails of transitioning: Disclosure in social media. In Proceedings of the 2017 ACM Conference on Computer-Supported Cooperative Work and Social Computing. ACM, 387--403.  ",
      "doi": "10.1145/2998181.2998221"
    },
    {
      "text": "Bryan C Semaan, Scott P Robertson, Sara Douglas, and Misa Maruyama. 2014. Social media supporting political deliberation across multiple public spheres: towards depolarization. In Proceedings of the 17th ACM conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1409--1421.  ",
      "doi": "10.1145/2531602.2531605"
    },
    {
      "text": "Cheryl L Shigaki, Karen L Smarr, Yang Gong, Kathleen Donovan- Hanson, Chokkalingam Siva, Rebecca A Johnson, Bin Ge, and Dale R Musser. 2008. Social interactions in an online self-management program for rheumatoid arthritis. Chronic Illness 4, 4 (2008), 239--246.",
      "doi": ""
    },
    {
      "text": "Rachel A Smith. 2011. Stigma, communication, and health. In The Routledge handbook of Health Communication. Routledge, 480--493.",
      "doi": ""
    },
    {
      "text": "Erika Steinmetz. 2006. Americans with disabilities, 2002. US Department of Commerce, Economics and Statistics Administration, US Census Bureau Washington, DC, USA.",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The online disinhibition effect. Cyberpsychology & Behavior 7, 3 (2004), 321--326.",
      "doi": ""
    },
    {
      "text": "Maja Van Der Velden and Khaled El Emam. 2013. \"Not all my friends need to know\": a qualitative study of teenage patients, privacy, and social media. Journal of the American Medical Informatics Association 20, 1 (2013), 16--24.",
      "doi": ""
    },
    {
      "text": "Cornelia F van Uden-Kraan, Constance HC Drossaert, Erik Taal, Bret R Shaw, Erwin R Seydel, and Mart AFJ van de Laar. 2008. Empowering processes and outcomes of participation in online support groups for patients with breast cancer, arthritis, or fibromyalgia. Qualitative Health Research 18, 3 (2008), 405--417.",
      "doi": ""
    },
    {
      "text": "Margaret H Vickers. 1997. Life at work with invisible? chronic illness (ICI): The unseen, unspoken, unrecognized dilemma of disclosure. Journal of Workplace Learning 9, 7 (1997), 240--252.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Jinyoung Kim. 2014. You can't block people offline: examining how Facebook's affordances shape the disclosure process. In Proceedings of the 17th ACM conference on Computer-Supported Cooperative Work & Social Computing. ACM, 461--474.  ",
      "doi": "10.1145/2531602.2531672"
    },
    {
      "text": "Yang Wang, Pedro Giovanni Leon, Alessandro Acquisti, Lorrie Faith Cranor, Alain Forget, and Norman Sadeh. 2014. A field trial of privacy nudges for facebook. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 2367--2376.  ",
      "doi": "10.1145/2556288.2557413"
    },
    {
      "text": "Sophie F Waterloo, Susanne E Baumgartner, Jochen Peter, and Patti M Valkenburg. 2017. Norms of online expressions of emotion: Comparing Facebook, Twitter, Instagram, and WhatsApp. New Media & Society (2017).",
      "doi": ""
    },
    {
      "text": "Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing health data for better outcomes on PatientsLikeMe. Journal of Medical Internet Research 12, 2 (2010).",
      "doi": ""
    },
    {
      "text": "Alyson L Young and Anabel Quan-Haase. 2009. Information revelation and internet privacy concerns on social network sites: a case study of facebook. In Proceedings of the Fourth International Conference on Communities and Technologies. ACM, 265--274.  ",
      "doi": "10.1145/1556460.1556499"
    },
    {
      "text": "Xuan Zhao, Cliff Lampe, and Nicole B Ellison. 2016. The social media ecology: User perceptions, strategies and challenges. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 89--100.  ",
      "doi": "10.1145/2858036.2858333"
    }
  ]
}