{
  "doi": "10.1145/3290605.3300235",
  "title": "Seeing with New Eyes: Designing for In-the-Wild Museum Gifting",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "This paper presents the GIFT smartphone app, an artist-led Research through Design project benefitting from a three-day in-the-wild deployment. The app takes as its premise the generative potential of combining the contexts of gifting and museum visits. Visitors explore the museum, searching for objects that would most appeal to the gift-receiver they have in mind, then photographing those objects and adding audio messages for their receivers describing the motivation for their choices. This paper charts the designers' key aim of creating a new frame of mind using voice, and the most striking findings discovered during in-the-wild deployment in a museum -- 'seeing with new eyes' and fostering personal connections. We discuss empathy, motivation, and bottom-up personalisation in the productive space revealed by this combination of contexts. We suggest that this work reveals opportunities for designers of gifting services as well as those working in cultural heritage.",
  "authors": [
    {
      "name": "Jocelyn Spence",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81556356156/rel-imgonly/img_5689.jpg",
      "acmid": "81556356156",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Bedwell",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608206",
      "orcid": "missing"
    },
    {
      "name": "Michelle Coleman",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366240",
      "orcid": "missing"
    },
    {
      "name": "Steve Benford",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100619971",
      "orcid": "missing"
    },
    {
      "name": "Boriana N. Koleva",
      "institution": "University of Nottingham, Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100296314",
      "orcid": "missing"
    },
    {
      "name": "Matt Adams",
      "institution": "Blast Theory, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100312947",
      "orcid": "missing"
    },
    {
      "name": "Ju Row Farr",
      "institution": "Blast Theory, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100463317",
      "orcid": "missing"
    },
    {
      "name": "Nick Tandavanitj",
      "institution": "Blast Theory, Brighton, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100616051",
      "orcid": "missing"
    },
    {
      "name": "Anders Sundnes Løvlie",
      "institution": "IT University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659202585",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Shane Ahern, Marc Davis, Dean Eckles, Simon King, Mor Naaman, Rahul Nair, Miriana Spasojevic, and Jeannie Yang. 2006. Zonetag: Designing context-aware mobile media capture to increase participation. In Proceedings of the Pervasive Image Capture and Sharing, 8th Int. Conf. on Ubiquitous Computing.",
      "doi": ""
    },
    {
      "text": "Susan Ali, Boriana Koleva, Ben Bedwell, and Steve Benford. 2018. Deepening visitor engagement with museum exhibits through hand-crafted visual markers. In Proceedings of the Designing Interactive Systems Conference 2018. ACM, 523--534.  ",
      "doi": "10.1145/3196709.3196786"
    },
    {
      "text": "Paul M Aoki, Rebecca E Grinter, Amy Hurst, Margaret H Szymanski, James D Thornton, and Allison Woodruff. 2002. Sotto voce: exploring the interplay of conversation and mobile audio spaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 431--438.  ",
      "doi": "10.1145/503376.503454"
    },
    {
      "text": "Liliana Ardissono, Tsvi Kuflik, and Daniela Petrelli. 2012. Personalization in cultural heritage: the road travelled and the one ahead. User modeling and user-adapted interaction 22, 1--2 (2012), 73--99.  ",
      "doi": "10.1007/s11257-011-9104-x"
    },
    {
      "text": "Kikuo Asai, Yuji Sugimoto, and Mark Billinghurst. 2010. Exhibition of lunar surface navigation system facilitating collaboration between children and parents in science museum. In Proceedings of the 9th ACM SIGGRAPH Conference on Virtual-Reality Continuum and its Applications in Industry. ACM, 119--124.  ",
      "doi": "10.1145/1900179.1900203"
    },
    {
      "text": "Rebecca Atkinson. 2013. How Are Museums Using Mobile? Retrieved September 2018 from https://www.museumsassociation.org/museum-practice/mobile-in-museums-2013/15102013-mobile-survey-2013-results",
      "doi": ""
    },
    {
      "text": "Claire Stephanie Bailey-Ross, Steven Gray, Andrew Hudson-Smith, Claire Warwick, and Melissa Terras. 2012. Enhancing museum narratives with the QRator Project: a Tasmanian devil, a platypus and a dead man in a box. In Museums and the Web 2012.",
      "doi": ""
    },
    {
      "text": "Russell W. Belk. 1976. It's the Thought That Counts: A Signed Digraph Analysis of Gift-Giving. Journal of Consumer Research 3, 3 (1976), 155--162.",
      "doi": ""
    },
    {
      "text": "Magnus Bergquist and Jan Ljungberg. 2001. The Power of Gifts: Organizing Social Relationships in Open Source Communities. Information Systems Journal 11, 4 (2001), 305--320.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. In Proceedings of the 4th Nordic conference on humancomputer interaction: Changing roles. ACM Press, New York, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Orian Brook. 2016. Spatial Equity and Cultural Participation: How Access Influences Attendance at Museums and Galleries in London. Cultural Trends 25, 1 (2016), 21--34.",
      "doi": ""
    },
    {
      "text": "David Cheal. 1988. The Gift Economy. Routledge, London; New York.",
      "doi": ""
    },
    {
      "text": "Luigina Ciolfi and Marc McLoughlin. 2012. Designing for meaningful visitor engagement at a living history museum. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. ACM, 69--78.  ",
      "doi": "10.1145/2399016.2399028"
    },
    {
      "text": "Dan Cosley, Jonathan Baxter, Soyoung Lee, Brian Alson, Saeko Nomura, Phil Adams, Chethan Sarabu, and Geri Gay. 2009. A tag in the hand: supporting semantic, social, and spatial navigation in museums. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1953--1962.  ",
      "doi": "10.1145/1518701.1518999"
    },
    {
      "text": "Dan Cosley, Joel Lewenstein, Andrew Herman, Jenna Holloway, Jonathan Baxter, Saeko Nomura, Kirsten Boehner, and Geri Gay. 2008. ArtLinks: Fostering social awareness and reflection in museums. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 403--412.  ",
      "doi": "10.1145/1357054.1357121"
    },
    {
      "text": "Paul Coulton, Jonny Huck, Andrew Hudson-Smith, Ralph Barthel, Panagiotis Mavros, Jennifer Roberts, and Philip Powell. 2014. Designing Interactive Systems to Encourage Empathy between Users. In Proceedings of the 2014 companion publication on Designing interactive systems - DIS Companion '14. ACM Press, New York, 13--16.  ",
      "doi": "10.1145/2598784.2602770"
    },
    {
      "text": "Andy Crabtree, Alan Chamberlain, Rebecca E Grinter, Matt Jones, Tom Rodden, and Yvonne Rogers. 2013. Introduction to the special issue of \"The Turn to The Wild\". ACM Transactions on Computer-Human Interaction (TOCHI) 20, 3 (2013), 13.  ",
      "doi": "10.1145/2491500.2491501"
    },
    {
      "text": "Gary Davies, Susan Whelan, Anthony Foley, and Margaret Walsh. 2010. Gifts and Gifting. International Journal of Management Reviews 12, 4 (2010), 413--434.",
      "doi": ""
    },
    {
      "text": "Marco De Gemmis, Pasquale Lops, Giovanni Semeraro, and Pierpaolo Basile. 2008. Integrating tags in a semantic content-based recommender. In Proceedings of the 2008 ACM conference on Recommender systems. ACM, 163--170.  ",
      "doi": "10.1145/1454008.1454036"
    },
    {
      "text": "John H. Falk. 2009. Identity and the Museum Visitor Experience (1st ed.). Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Silvia Filippini Fantoni. 2003. Personalization through IT in Museums. Does it really work? The case of the Marble Museum website. In Proceedings of ICHIM 2003, Archives & Museum Informatics. ICHIM, 2--16.",
      "doi": ""
    },
    {
      "text": "Kieran Ferris, Liam Bannon, Luigina Ciolfi, Paul Gallagher, Tony Hall, and Marilyn Lennon. 2004. Shaping experiences in the hunt museum: A design case study. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques. ACM, 205--214.  ",
      "doi": "10.1145/1013115.1013144"
    },
    {
      "text": "Lesley Fosh, Steve Benford, and Boriana Koleva. 2016. Supporting Group Coherence in a Museum Visit. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). 1--12.  ",
      "doi": "10.1145/2818048.2819970"
    },
    {
      "text": "Lesley Fosh, Steve Benford, Stuart Reeves, and Boriana Koleva. 2014. Gifting Personal Interpretations in Galleries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 625--634.  ",
      "doi": "10.1145/2556288.2557259"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions 6, 1 (1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, ACM Press, New York, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Markus Giesler. 2003. The Anthropology of File Sharing: Consuming Napster As a Gift. Advances in Consumer Research 30 (2003), 273--279.",
      "doi": ""
    },
    {
      "text": "Daniel Gooch and Ryan Kelly. 2016. Season's Greetings. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. 2105--2111.  ",
      "doi": "10.1145/2851581.2892341"
    },
    {
      "text": "Chris A Gregory. 2015. Gifts and Commodities: Circulation. In Gifts and Commodities (2nd ed.). Hau, Chicago, Chapter 3, 39--72.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Stephanie Heidecker, Kai Eckoldt, Sarah Diefenbach, and Uwe Hillmann. 2012. All You Need Is Love: Current Strategies of Mediating Intimate Relationships Through Technology. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 4 (2012), Article 30.  ",
      "doi": "10.1145/2395131.2395137"
    },
    {
      "text": "Jenny Kidd. 2016. Museums in the new mediascape: Transmedia, participation, ethics. Routledge.",
      "doi": ""
    },
    {
      "text": "Hyosun Kwon, Boriana Koleva, Holger Schnädelbach, and Steve Benford. 2017. Its Not Yet A Gift: Understanding Digital Gifting. In Proceedings of the ACM 2017 conference on Computer supported cooperative work (CSCW'17). ACM Press, New York, 2372--2384.  ",
      "doi": "10.1145/2998181.2998225"
    },
    {
      "text": "Tuck W. Leong and Peter Wright. 2013. Revisiting Social Practices Surrounding Music. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 951--960.  ",
      "doi": "10.1145/2470654.2466122"
    },
    {
      "text": "Jonas Löwgren. 2013. Annotated portfolios and other forms of intermediate-level knowledge. interactions 20, 1 (2013), 30--34.  ",
      "doi": "10.1145/2405716.2405725"
    },
    {
      "text": "Bronislaw Malinowski. 1922. Argonauts of the Western Pacific: An Account of Native Enterprise and Adventure in the Archipelagoes of Melanesian New Guinea. Routledge, London.",
      "doi": ""
    },
    {
      "text": "Claudio Martella, Armando Miraglia, Jeana Frost, Marco Cattani, and Maarten van Steen. 2017. Visualizing, Clustering, and Predicting the Behavior of Museum Visitors. In Pervasive and Mobile Computing, Vol. 38. Elsevier B.V., 430--443.",
      "doi": ""
    },
    {
      "text": "Marcel Mauss. 2000 {1925}. The gift: The Form and Reason for Exchange in Archaic Societies. WW Norton & Company, New York; London.",
      "doi": ""
    },
    {
      "text": "Reese Muntean, Alissa N Antle, Brendan Matkin, Kate Hennessy, Susan Rowley, and Jordan Wilson. 2017. Designing Cultural Values into Interaction. In CHI '17 Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM Press, New York, 6062--6074.  ",
      "doi": "10.1145/3025453.3025908"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2011. Teenagers and Their Virtual Possessions: Design Opportunities and Issues. In CHI '11 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, New York, 1491--1500.  ",
      "doi": "10.1145/1978942.1979161"
    },
    {
      "text": "Daniela Petrelli, Mark T Marshall, Sinéad O'Brien, Patrick McEntaggart, and Ian Gwilt. 2017. Tangible data souvenirs as a bridge between a physical museum visit and online digital experience. Personal and Ubiquitous Computing 21, 2 (2017), 281--295.  ",
      "doi": "10.1007/s00779-016-0993-x"
    },
    {
      "text": "Philip A. Powell and Jennifer Roberts. 2017. Situational Determinants of Cognitive, Affective, and Compassionate Empathy in Naturalistic Digital Interactions. Computers in Human Behavior 68 (2017), 137--148.  ",
      "doi": "10.1016/j.chb.2016.11.024"
    },
    {
      "text": "Stefan Rennick-Egglestone, Patrick Brundell, Boriana Koleva, Steve Benford, Maria Roussou, and Christophe Chaffardon. 2016. Families and mobile devices in museums: Designing for integrated experiences. Journal on Computing and Cultural Heritage (JOCCH) 9, 2 (2016), 11.  ",
      "doi": "10.1145/2891416"
    },
    {
      "text": "Marsha L. Richins. 1994. Valuing Things: The Public and Private Meanings of Possessions. Journal of Consumer Research 21, 3 (1994), 504--521.",
      "doi": ""
    },
    {
      "text": "Matei Ripeanu, Miranda Mowbray, Nazareno Andrade, and Aliandro Lima. 2006. Gifting Technologies: A BitTorrent Case Study. First Monday 11, 6 (2006), 1--10. http://firstmonday.org/issues/issue11{_}11/ripeanu/index.html",
      "doi": ""
    },
    {
      "text": "Henry S.J. Robben and Theo M.M. Verhallen. 1994. Behavioral costs as determinants of cost perception and preference formation for gifts to receive and gifts to give. Journal of Economic Psychology 15, 2 (1994), 333--350.",
      "doi": ""
    },
    {
      "text": "Daniela K Rosner and Kimiko Ryokai. 2010. Spyn: Augmenting the Creative and Communicative Potential of Craft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, New York, 2407--2416.  ",
      "doi": "10.1145/1753326.1753691"
    },
    {
      "text": "Catherine A Roster and Clare M. Amann. 2003. Consumer Strategies For Averting Negative Consequences of Failed Gift Exchanges: Is Honesty Ever the Best Policy? Advances in Consumer Research 30 (2003), 373--374.",
      "doi": ""
    },
    {
      "text": "Julie A Ruth, Cele C Otnes, and Frederic F Brunel. 1999. Gift Receipt and the Reformulation of Interpersonal Relationships. Journal of Consumer Research 25 (1999), 385--402.",
      "doi": ""
    },
    {
      "text": "Antti Salovaara. 2008. Struggling with Gift-Giving Obligations: When Mobile Messages Are Too Laborious to Reciprocate. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction-Volume 2. British Computer Society, 83--86. ",
      "doi": "10.5555/1531826.1531847"
    },
    {
      "text": "Holger Schnädelbach, Boriana Koleva, Mike Twidale, and Steve Benford. 2004. The iterative design process of a location-aware device for group use. In International Conference on Ubiquitous Computing. Springer, 329--346.",
      "doi": ""
    },
    {
      "text": "John F. Sherry, Jr. 1983. Gift Giving in Anthropological Perspective. Journal of Consumer Research 10, 2 (1983), 157--168. http://www.jstor.org/stable/2488921",
      "doi": ""
    },
    {
      "text": "Nina Simon. 2010. Where's the mobile museums project for intact social groups? Retrieved September 2018 from http://museumtwo. blogspot.com/search?q=mobile+media+intact",
      "doi": ""
    },
    {
      "text": "J. Spence, A. Hazzard, S. McGrath, C. Greenhalgh, and S. Benford. 2017. The Rough Mile: Testing a Framework of Immersive Practice. In DIS 2017 - Proceedings of the 2017 ACM Conference on Designing Interactive Systems. ACM Press, New York, 877--888.  ",
      "doi": "10.1145/3064663.3064756"
    },
    {
      "text": "Oliviero Stock, Massimo Zancanaro, Paolo Busetta, Charles Callaway, Antonio Krüger, Michael Kruppa, Tsvi Kuflik, Elena Not, and Cesare Rocchi. 2007. Adaptive, intelligent presentation of information for the museum visitor in PEACH. User Modeling and User-Adapted Interaction 17, 3 (2007), 257--304.  ",
      "doi": "10.1007/s11257-007-9029-6"
    },
    {
      "text": "Alex S. Taylor and Richard Harper. 2002. Age-old Practices in the 'New World': A Study of Gift-giving Between Teenage Mobile Phone Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 439--446.  ",
      "doi": "10.1145/503376.503455"
    },
    {
      "text": "Nick Taylor. 2014. Supporting community participation in interactive exhibits. In Proceedings of The International Symposium on Pervasive Displays. ACM, 74.  ",
      "doi": "10.1145/2611009.2611031"
    },
    {
      "text": "Kevin Von Appen, Brian Kennedy, and Jim Spadaccini. 2006. Community sites & emerging sociable technologies. In Museums and the Web. 197--206.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C Wright, and Patrick Olivier. 2013. Making Design Probes Work. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, ACM Press, New York, 3441--3450.  ",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press, New York, 2629.  ",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Yiwen Wang, Natalia Stash, Lora Aroyo, Laura Hollink, and Guus Schreiber. 2009. Semantic Relations for Content-based Recommendations. In Proceedings of the Fifth International Conference on Knowledge Capture (K-CAP '09). ACM, New York, NY, USA, 209--210.  ",
      "doi": "10.1145/1597735.1597786"
    },
    {
      "text": "Alexandra Weilenmann, Thomas Hillman, and Beata Jungselius. 2013. Instagram at the museum: communicating the museum experience through social photo sharing. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1843--1852.  ",
      "doi": "10.1145/2470654.2466243"
    },
    {
      "text": "Christopher Whitehead. 2011. Interpreting art in museums and galleries. Routledge.",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2004. Technology as experience. MIT Press Cambridge, MA. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Peter Wright and John McCarthy. 2008. Empathy and Experience in HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, ACM Press, New York, 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}