{
  "doi": "10.1145/3290605.3300469",
  "title": "AI-Mediated Communication: How the Perception that Profile Text was Written by AI Affects Trustworthiness",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "We are entering an era of AI-Mediated Communication (AI-MC) where interpersonal communication is not only mediated by technology, but is optimized, augmented, or generated by artificial intelligence. Our study takes a first look at the potential impact of AI-MC on online self-presentation. In three experiments we test whether people find Airbnb hosts less trustworthy if they believe their profiles have been written by AI. We observe a new phenomenon that we term the Replicant Effect: Only when participants thought they saw a mixed set of AI- and human-written profiles, they mistrusted hosts whose profiles were labeled as or suspected to be written by AI. Our findings have implications for the design of systems that involve AI technologies in online self-presentation and chart a direction for future work that may upend or augment key aspects of Computer-Mediated Communication theory.",
  "authors": [
    {
      "name": "Maurice Jakesch",
      "institution": "Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366351",
      "orcid": "0000-0002-2642-3322"
    },
    {
      "name": "Megan French",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697820",
      "orcid": "missing"
    },
    {
      "name": "Xiao Ma",
      "institution": "Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987040",
      "orcid": "0000-0001-6134-3531"
    },
    {
      "name": "Jeffrey T. Hancock",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100212035",
      "orcid": "missing"
    },
    {
      "name": "Mor Naaman",
      "institution": "Cornell University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100585927",
      "orcid": "0000-0002-6436-3877"
    }
  ],
  "references": [
    {
      "text": "Microsoft Blogs. 2017. Bringing AI to job seekers with Resume Assistant in Word, powered by LinkedIn. https://bit.ly/2Di34QB. Perception that Profile Text was Written by AI Affects Trustworthiness CHI 2019, May 4--9, 2019, Glasgow, Scotland",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2011. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality, data? Perspectives on psychological science 6, 1 (2011), 3--5.",
      "doi": ""
    },
    {
      "text": "Kevin Corti and Alex Gillespie. 2016. Co-constructing intersubjectivity with artificial conversational agents: people are more likely to initiate repairs of misunderstandings with agents represented as human. Computers in Human Behavior 58 (2016), 431--442.  ",
      "doi": "10.1016/j.chb.2015.12.039"
    },
    {
      "text": "Niels Dahlbäck, Arne Jönsson, and Lars Ahrenberg. 1993. Wizard of Oz Studies - Why and How. Knowledge-Based Systems 6, 4 (Dec. 1993), 258--266.  ",
      "doi": "10.1016/0950-7051%2893%2990017-N"
    },
    {
      "text": "Antonella De Angeli, Graham I Johnson, and Lynne Coventry. 2001. The unfriendly user: exploring social reactions to chatterbots. In Proceedings of The International Conference on Affective Human Factors Design, London. 467--474.",
      "doi": ""
    },
    {
      "text": "David C DeAndrea. 2014. Advancing warranting theory. Communication Theory 24, 2 (2014), 186--204.",
      "doi": ""
    },
    {
      "text": "Michael A. DeVito, Jeremy Birnholtz, and Jeffery T. Hancock. 2017. Platforms, People, and Perception: Using Affordances to Understand Self-Presentation on Social Media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 740--754.  ",
      "doi": "10.1145/2998181.2998192"
    },
    {
      "text": "Michael A DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. Algorithms ruin everything:# RIPTwitter, folk theories, and resistance to algorithmic change in social media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3163--3174.  ",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Judith Donath. 2007. Signals in social supernets. Journal of ComputerMediated Communication 13, 1 (2007), 231--251.  ",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Jens Edlund, Joakim Gustafson, Mattias Heldner, and Anna Hjalmarsson. 2008. Towards human-like spoken dialogue systems. Speech communication 50, 8--9 (2008), 630--645.  ",
      "doi": "10.1016/j.specom.2008.04.002"
    },
    {
      "text": "Chad Edwards, Autumn Edwards, Patric R Spence, and Ashleigh K Shelton. 2014. Is that a bot running the social media feed? Testing the differences in perceptions of communication quality for a human agent and a bot agent on Twitter. Computers in Human Behavior 33 (2014), 372--376.  ",
      "doi": "10.1016/j.chb.2013.08.013"
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2006. Managing Impressions Online: Self-Presentation Processes in the Online Dating Environment. Journal of Computer-Mediated Communication 11, 2 (2006), 415--441.",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison and Danah M Boyd. 2013. Sociality through social network sites. In The Oxford handbook of internet studies.",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison and Jeffrey T Hancock. 2013. Profile as promise: Honest and deceptive signals in online dating. IEEE Security and Privacy 11, 5 (Sept. 2013), 84--88.  ",
      "doi": "10.1109/MSP.2013.120"
    },
    {
      "text": "Nicole B Ellison, Jeffrey T Hancock, and Catalina L Toma. 2012. Profile as promise: A framework for conceptualizing veracity in online dating self-presentations. New Media & Society 14, 1 (2012), 45--62.",
      "doi": ""
    },
    {
      "text": "Eyal Ert, Aliza Fleischer, and Nathan Magen. 2016. Trust and reputation in the sharing economy: The role of personal photos in Airbnb. Tourism Management 55 (2016), 62--73.",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I like it, then I hide it: Folk theories of social feeds. In Proceedings of the 2016 cHI conference on human factors in computing systems. ACM, 2371--2382.  ",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Emilio Ferrara, Onur Varol, Clayton A. Davis, Filippo Menczer, and Alessandro Flammini. 2016. The rise of social bots. Communications of The ACM 59, 7 (2016), 96--104.  ",
      "doi": "10.1145/2818717"
    },
    {
      "text": "Jennifer L Gibbs, Nicole B Ellison, and Chih-Hui Lai. 2010. First comes love, then comes Google: An investigation of uncertainty reduction strategies and self-disclosure in online dating. Communication Research (2010), 0093650210377091.",
      "doi": ""
    },
    {
      "text": "Jennifer L Gibbs, Nicole B Ellison, and Chih-Hui Lai. 2011. First comes love, then comes Google: An investigation of uncertainty reduction strategies and self-disclosure in online dating. Communication Research 38, 1 (2011), 70--100.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie, Pablo J Boczkowski, and Kirsten A Foot. 2014. Media technologies: Essays on communication, materiality, and society. MIT Press. ",
      "doi": "10.5555/2500954"
    },
    {
      "text": "Andreas Graefe, Mario Haim, Bastian Haarmann, and Hans-Bernd Brosius. 2018. Readers' perception of computer-generated news: Credibility, expertise, and readability. Journalism 19, 5 (2018), 595--610.",
      "doi": ""
    },
    {
      "text": "Grammarly 2017. Free Grammar Checker - Grammarly. https://www. grammarly.com/.",
      "doi": ""
    },
    {
      "text": "Jamie Guillory and Jeffrey T Hancock. 2012. The effect of Linkedin on deception in resumes. Cyberpsychology, Behavior, and Social Networking 15, 3 (2012), 135--140.",
      "doi": ""
    },
    {
      "text": "Daniel Guttentag. 2015. Airbnb: Disruptive innovation and the rise of an informal tourism accommodation sector. Current Issues in Tourism 18, 12 (2015), 1192--1217.",
      "doi": ""
    },
    {
      "text": "Jeffrey T Hancock, Lauren E Curry, Saurabh Goorha, and Michael Woodworth. 2007. On lying and being lied to: A linguistic analysis of deception in computer-mediated communication. Discourse Processes 45, 1 (2007), 1--23.",
      "doi": ""
    },
    {
      "text": "Jeffrey T. Hancock, Jennifer Thom-Santelli, and Thompson Ritchie. 2004. Deception and Design: The Impact of Communication Technology on Lying Behavior. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 129--134.  ",
      "doi": "10.1145/985692.985709"
    },
    {
      "text": "Jeffrey T. Hancock, Catalina Toma, and Nicole Ellison. 2007. The truth about lying in online dating profiles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 449--452.  ",
      "doi": "10.1145/1240624.1240697"
    },
    {
      "text": "Russell Hardin. 2002. Trust and trustworthiness. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Susan C. Herring. 2002. Computer-mediated communication on the internet. Annual Review of Information Science and Technology 36, 1 (2002), 109--168.",
      "doi": ""
    },
    {
      "text": "Jess Hohenstein and Malte Jung. 2018. AI-Supported Messaging: An Investigation of Human-Human Text Conversation with AI Support. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW089.  ",
      "doi": "10.1145/3170427.3188487"
    },
    {
      "text": "John J Horton, David G Rand, and Richard J Zeckhauser. 2011. The online laboratory: Conducting experiments in a real labor market. Experimental economics 14, 3 (2011), 399--425.",
      "doi": ""
    },
    {
      "text": "Toko Kiyonari, Toshio Yamagishi, Karen S Cook, and Coye Cheshire. 2006. Does trust beget trustworthiness? Trust and trustworthiness in two games and two cultures: A research note. Social Psychology Quarterly 69, 3 (2006), 270--283.",
      "doi": ""
    },
    {
      "text": "Cliff A.C. Lampe, Nicole Ellison, and Charles Steinfield. 2007. A familiar Face(book): Profile elements as signals in an online social network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 435--444.  ",
      "doi": "10.1145/1240624.1240695"
    },
    {
      "text": "Airi Lampinen and Coye Cheshire. 2016. Hosting via Airbnb: Motivations and financial assurances in monetized network hospitality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, 1669--1680. CHI 2019, May 4--9, 2019, Glasgow, Scotland Maurice Jakesch, Megan French, Xiao Ma, Jeffrey T. Hancock, Mor Naaman  ",
      "doi": "10.1145/2858036.2858092"
    },
    {
      "text": "Debra Lauterbach, Hung Truong, Tanuj Shah, and Lada Adamic. 2009. Surfing a web of trust: Reputation and reciprocity on couchsurfing. com. In Computational Science and Engineering, 2009. CSE'09. International Conference on, Vol. 4. IEEE, 346--353.  ",
      "doi": "10.1109/CSE.2009.345"
    },
    {
      "text": "Gale M. Lucas, Jonathan Gratch, Aisha King, and Louis-Philippe Morency. 2014. It's only a computer: Virtual humans increase willingness to disclose. Computers in Human Behavior 37, Supplement C (2014), 94 -- 100.  ",
      "doi": "10.1016/j.chb.2014.04.043"
    },
    {
      "text": "Xiao Ma, Jeffery T. Hancock, Kenneth Lim Mingjie, and Mor Naaman. 2017. Self-Disclosure and Perceived Trustworthiness of Airbnb Host Profiles. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2397--2409.  ",
      "doi": "10.1145/2998181.2998269"
    },
    {
      "text": "Xiao Ma, Trishala Neeraj, and Mor Naaman. 2017. A Computational Approach to Perceived Trustworthiness of Airbnb Host Profiles. In Proceedings of the International AAAI Conference on Web and Social Media. AAAI.",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Emily Sun, and Mor Naaman. 2017. What Happens in Happn: The Warranting Powers of Location History in Online Dating. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2998181.2998241"
    },
    {
      "text": "Roger C Mayer and James H Davis. 1999. The effect of the performance appraisal system on trust for management: A field quasi-experiment. Journal of applied psychology 84, 1 (1999), 123.",
      "doi": ""
    },
    {
      "text": "Roger C Mayer, James H Davis, and F David Schoorman. 1995. An integrative model of organizational trust. Academy of management review 20, 3 (1995), 709--734.",
      "doi": ""
    },
    {
      "text": "Robert Munro, Steven Bethard, Victor Kuperman, Vicky Tzuyin Lai, Robin Melnick, Christopher Potts, Tyler Schnoebelen, and Harry Tily. 2010. Crowdsourcing and language studies: the new generation of linguistic data. In Proceedings of the NAACL HLT 2010 workshop on creating speech and language data with Amazon's Mechanical Turk. Association for Computational Linguistics, 122--130. ",
      "doi": "10.5555/1866696.1866715"
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and mindlessness: Social responses to computers. Journal of social issues 56, 1 (2000), 81--103.",
      "doi": "10.1111/0022-4537.00153"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 72--78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Riley Newman and Judd Antin. 2016. Building for trust: Insights from our efforts to distill the fuel for the sharing economy. http: //nerds.airbnb.com/building-for-trust.",
      "doi": ""
    },
    {
      "text": "Gary S Nickell and John N Pinto. 1986. The computer attitude scale. Computers in human behavior 2, 4 (1986), 301--306.",
      "doi": ""
    },
    {
      "text": "Richard E Petty and John T Cacioppo. 1986. The elaboration likelihood model of persuasion. In Communication and persuasion. Springer, 1--24.",
      "doi": ""
    },
    {
      "text": "Eva Schwämmlein and Katrin Wodzicki. 2012. What to tell about me? Self-presentation in online communities. Journal of ComputerMediated Communication 17, 4 (2012), 387--407.  ",
      "doi": "10.1111/j.1083-6101.2012.01582.x"
    },
    {
      "text": "S Shyam Sundar. 2008. The MAIN model: A heuristic approach to understanding technology effects on credibility. Digital media, youth, and credibility 73100 (2008).",
      "doi": ""
    },
    {
      "text": "Crispin Thurlow, Laura Lengel, and Alice Tomic. 2004. Computer Mediated Communication. Sage Publishing.",
      "doi": ""
    },
    {
      "text": "Catalina L. Toma and Jeffrey T. Hancock. 2012. What lies beneath: The linguistic traces of deception in online dating profiles. Journal of Communication 62, 1 (2012), 78--97.",
      "doi": ""
    },
    {
      "text": "Catalina L Toma, Jeffrey T Hancock, and Nicole B Ellison. 2008. Separating fact from fiction: An examination of deceptive self-presentation in online dating profiles. Personality and Social Psychology Bulletin 34, 8 (2008), 1023--1036.",
      "doi": ""
    },
    {
      "text": "Suvi Uski and Airi Lampinen. 2014. Social norms and self-presentation on social network sites: Profile work in action. New Media & Society (2014).",
      "doi": ""
    },
    {
      "text": "T Franklin Waddell. 2018. A Robot Wrote This? How perceived machine authorship affects news credibility. Digital Journalism 6, 2 (2018), 236--255.",
      "doi": ""
    },
    {
      "text": "Joseph Walther. 2011. Theories of computer-mediated communication and interpersonal relations. In The Handbook of Interpersonal Communication. 443--479.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 1996. Computer-mediated communication: Impersonal, interpersonal, and hyperpersonal interaction. Communication research 23, 1 (1996), 3--43.",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther, Tracy Loh, and Laura Granka. 2005. Let Me Count the Ways: The Interchange of Verbal and Nonverbal Cues in ComputerMediated and Face-to-Face Affinity. Journal of Language and Social Psychology 24, 1 (2005), 36--65.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther and Malcolm R Parks. 2002. Cues filtered out, cues filtered in. Handbook of interpersonal communication (2002), 529--563.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther, Brandon Van Der Heide, Lauren M Hamel, and Hillary C Shulman. 2009. Self-generated versus other-generated statements and impressions in computer-mediated communication: A test of warranting theory using Facebook. Communication research 36, 2 (2009), 229--253.",
      "doi": ""
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA -- a computer program for the study of natural language communication between man and machine. Commun. ACM 9, 1 (1966), 36--45.  ",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Anja Wölker and Thomas E Powell. 2018. Algorithms in the newsroom? News readers' perceived credibility and selection of automated journalism. Journalism (2018), 1464884918757072.",
      "doi": ""
    },
    {
      "text": "Toshio Yamagishi. 1986. The provision of a sanctioning system as a public good. Journal of Personality and social Psychology 51, 1 (1986), 110.",
      "doi": ""
    },
    {
      "text": "Yuanshun Yao, Bimal Viswanath, Jenna Cryan, Haitao Zheng, and Ben Y. Zhao. 2017. Automated Crowdturfing Attacks and Defenses in Online Review Systems. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security (CCS '17). ACM, New York, NY, USA, 1143--1158.  ",
      "doi": "10.1145/3133956.3133990"
    },
    {
      "text": "Georgios Zervas, Davide Proserpio, and John Byers. 2015. A first look at online reputation on Airbnb, where every stay is above average. Social Science Research Network (2015).",
      "doi": ""
    }
  ]
}