{
  "doi": "10.1145/3290605.3300605",
  "title": "Examining Augmented Virtuality Impairment Simulation for Mobile App Accessibility Design",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "With mobile apps rapidly permeating all aspects of daily living with use by all segments of the population, it is crucial to support the evaluation of app usability for specific impaired users to improve app accessibility. In this work, we examine the effects of using our augmented virtuality impairment simulation system--Empath-D--to support experienced designer-developers to redesign a mockup of commonly used mobile application for cataract-impaired users, comparing this with existing tools that aid designing for accessibility. We show that the use of augmented virtuality for assessing usability supports enhanced usability challenge identification, finding more defects and doing so more accurately than with existing methods. Through our user interviews, we also show that augmented virtuality impairment simulation supports realistic interaction and evaluation to provide a concrete understanding over the usability challenges that impaired users face, and complements the existing guidelines-based approaches meant for general accessibility.",
  "tags": [
    "virtual reality",
    "mobile app design",
    "empathetic design",
    "augmented virtuality",
    "accessibility"
  ],
  "authors": [
    {
      "name": "Kenny Tsu Wei Choo",
      "institution": "Singapore Management University, Singapore, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659052376",
      "orcid": "missing"
    },
    {
      "name": "Rajesh Krishna Balan",
      "institution": "Singapore Management University, Singapore, Singapore",
      "img": "/do/10.1145/contrib-81100050092/rel-imgonly/rajesh.jpg",
      "acmid": "81100050092",
      "orcid": "0000-0001-6289-9902"
    },
    {
      "name": "Youngki Lee",
      "institution": "Seoul National University, Seoul, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416599138",
      "orcid": "0000-0002-1319-7071"
    }
  ],
  "references": [
    {
      "text": "Tassha Hilda Adnan, Mokhlisoh Mohamed Apandi, Haireen Kamaruddin, Mohamad Aziz Salowi, Kian Boon Law, Jamaiyah Haniff, and Pik Pin Goh. 2018. Catquest-9SF questionnaire: validation of Malay and Chinese-language versions using Rasch analysis. Health and Quality of Life Outcomes 16 (Jan. 2018).",
      "doi": ""
    },
    {
      "text": "Apache Software Foundation. 2018. Apache Cordova. https: //cordova.apache.org/",
      "doi": ""
    },
    {
      "text": "Apple. 2015. Apple Accessibility Inspector. https: //developer.apple.com/library/archive/documentation/Accessibility/ Conceptual/AccessibilityMacOSX/OSXAXTestingApps.html",
      "doi": ""
    },
    {
      "text": "Apple. 2018. iOS - Human Interface Guidelines for Accessibility. https://developer.apple.com/design/human-interface-guidelines/ ios/app-architecture/accessibility/",
      "doi": ""
    },
    {
      "text": "Andrew Arch and Shadi Abou-Zara. 2010. Developing Websites for Older People: How Web Content Accessibility Guidelines (WCAG) 2.0 Applies | Web Accessibility Initiative (WAI) | W3C. https:// www.w3.org/WAI/older-users/developing.html",
      "doi": ""
    },
    {
      "text": "Halim Cagri Ates, Alexander Fiannaca, and Eelke Folmer. 2015. Immersive Simulation of Visual Impairments Using a Wearable See-through Display. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 225--228.  ",
      "doi": "10.1145/2677199.2680551"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114--123. ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "John T. Cacioppo and Richard E. Petty. 1982. The need for cognition. Journal of Personality and Social Psychology; Journal of Personality and Social Psychology 42, 1 (1982), 116. http://psycnet.apa.org/journals/ psp/42/1/116/",
      "doi": ""
    },
    {
      "text": "Ben Caldwell, Michael Cooper, Loretta Guarino Reid, and Gregg Vanderheiden. 2008. Web Content Accessibility Guidelines (WCAG) 2.0. https://www.w3.org/TR/WCAG20/",
      "doi": ""
    },
    {
      "text": "Michael Crystian Nepomuceno Carvalho, Felipe Silva Dias, Aline Grazielle Silva Reis, and André Pimenta Freire. 2018. Accessibility and Usability Problems Encountered on Websites and Applications in Mobile Devices by Blind and Normal-vision Users. In Proceedings of the 33rd Annual ACM Symposium on Applied Computing (SAC '18). ACM, New York, NY, USA, 2022--2029.  ",
      "doi": "10.1145/3167132.3167349"
    },
    {
      "text": "Wendy Chisholm, Gregg Vanderheiden, and Ian Jacobs. 1999. Web Content Accessibility Guidelines 1.0. https://www.w3.org/TR/1999/ WAI-WEBCONTENT-19990505/",
      "doi": ""
    },
    {
      "text": "Raphael Clegg-Vinell, Christopher Bailey, and Voula Gkatzidou. 2014. Investigating the appropriateness and relevance of mobile web accessibility guidelines. In Proceedings of the 11th Web for All Conference. ACM, 38.  ",
      "doi": "10.1145/2596695.2596717"
    },
    {
      "text": "Amanda Davis. 2017. Most Developers Fail to Design Websites Accessible to People With Disabilities. http: //theinstitute.ieee.org/ieee-roundup/blogs/blog/most-developersfail-to-design-websites-accessible-to-people-with-disabilities",
      "doi": ""
    },
    {
      "text": "P. J. Foster, T. Y. Wong, D. Machin, G. J. Johnson, and S. K. L. Seah. 2003. Risk factors for nuclear, cortical and posterior subcapsular cataracts in the Chinese population of Singapore: the Tanjong Pagar Survey. British Journal of Ophthalmology 87, 9 (Sept. 2003), 1112--1120.",
      "doi": ""
    },
    {
      "text": "Greg Gay and Cindy Qi Li. 2010. AChecker: Open, Interactive, Customizable, Web Accessibility Checking. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A) (W4A '10). ACM, New York, NY, USA, 23:1--23:2.  ",
      "doi": "10.1145/1805986.1806019"
    },
    {
      "text": "Google. 2018. Android Accessibility Guidelines. https:// developer.android.com/guide/topics/ui/accessibility/",
      "doi": ""
    },
    {
      "text": "Google. 2018. Google Accessibility Scanner. https://play.google.com/store/apps/details?id= com.google.android.apps.accessibility.auditor",
      "doi": ""
    },
    {
      "text": "Wan He, Daniel Goodkind, and Paul Kowal. 2016. An Aging World: 2015. International Population Reports. Technical Report. United States Census Bureau. 175 pages. https://www.census.gov/content/dam/ Census/library/publications/2016/demo/p95--16--1.pdf",
      "doi": ""
    },
    {
      "text": "K. Higuchi, Y. Sakaguchi, K. Sugiyama, and T. Nakano. 1999. Simulating the human vision of elderly for designing control panels. In 1999 IEEE International Conference on Systems, Man, and Cybernetics, 1999. IEEE SMC '99 Conference Proceedings, Vol. 5. 703--708 vol.5.",
      "doi": ""
    },
    {
      "text": "T. Ho, N. M. Law, L. G. Goh, and T. Yoong. 1997. Eye diseases in the elderly in Singapore. Singapore medical journal 38, 4 (1997), 149--155.",
      "doi": ""
    },
    {
      "text": "Wonjung Kim, Kenny Tsu Wei Choo, Youngki Lee, Archan Misra, and Rajesh Krishna Balan. 2018. Empath-D: VR-based Empathetic App Design for Accessibility. In Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3210240.3210331"
    },
    {
      "text": "Jonathan Lazar, Alfreda Dudley-Sponaugle, and Kisha-Dawn Greenidge. 2004. Improving web accessibility: a study of webmaster perceptions. Computers in human behavior 20, 2 (2004), 269--288.",
      "doi": ""
    },
    {
      "text": "Rui Lopes, Daniel Gomes, and Luís Carriço. 2010. Web Not for All: A Large Scale Study of Web Accessibility. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A) (W4A '10). ACM, New York, NY, USA, 10:1--10:4.  ",
      "doi": "10.1145/1805986.1806001"
    },
    {
      "text": "Mats Lundstrom and Konrad Pesudovs. 2009. Catquest-9SF patient outcomes questionnaire: Nine-item short-form Rasch-scaled revision of the Catquest questionnaire. Journal of Cataract & Refractive Surgery 35, 3 (March 2009), 504--513.",
      "doi": ""
    },
    {
      "text": "J. Mankoff, H. Fait, and R. Juang. 2005. Evaluating accessibility by simulating the experiences of users with vision or motor impairments. IBM Systems Journal 44, 3 (2005), 505--517.  ",
      "doi": "10.1147/sj.443.0505"
    },
    {
      "text": "Jennifer Mankoff, Holly Fait, and Tu Tran. 2005. Is your web page accessible?: a comparative study of methods for assessing web page accessibility for the blind. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 41--50.  ",
      "doi": "10.1145/1054972.1054979"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems 77, 12 (1994), 1321--1329.",
      "doi": ""
    },
    {
      "text": "Lauren R. Milne, Cynthia L. Bennett, and Richard E. Ladner. 2014. The Accessibility of Mobile Health Sensors for Blind Users. (Dec. 2014). http://scholarworks.calstate.edu/handle/10211.3/133384",
      "doi": ""
    },
    {
      "text": "Scott Milne, Anna Dickinson, Alex Carmichael, David Sloan, Roos Eisma, and Peter Gregor. 2005. Are guidelines enough? An introduction to designing Web sites accessible to older people. IBM systems journal 44, 3 (2005), 557--571.  ",
      "doi": "10.1147/sj.443.0557"
    },
    {
      "text": "A. F. Newell, P. Gregor, M. Morgan, G. Pullin, and C. Macaulay. 2011. User-Sensitive Inclusive Design. Universal Access in the Information Society 10, 3 (2011), 235--243.  ",
      "doi": "10.1007/s10209-010-0203-y"
    },
    {
      "text": "Kim Patch, Jeanne Spellman, and Kathy Wahlbin. 2015. Mobile Accessibility: How WCAG 2.0 and Other W3C/WAI Guidelines Apply to Mobile. https://www.w3.org/TR/mobile-accessibility-mapping/",
      "doi": ""
    },
    {
      "text": "Christopher Power, Andre Freire, Helen Petrie, and David Swallow. 2012. Guidelines Are Only Half of the Story: Accessibility Problems Encountered by Blind Users on the Web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 433--442.  ",
      "doi": "10.1145/2207676.2207736"
    },
    {
      "text": "Anne Spencer Ross, Xiaoyi Zhang, James Fogarty, and Jacob O. Wobbrock. 2017. Epidemiology as a Framework for Large-Scale Mobile Application Accessibility Assessment. ACM Press, 2--11.  ",
      "doi": "10.1145/3132525.3132547"
    },
    {
      "text": "Andrew Sears and Vicki Hanson. 2011. Representing Users in Accessibility Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2235--2238.  ",
      "doi": "10.1145/1978942.1979268"
    },
    {
      "text": "Arielle M. Silverman, Jason D. Gwinn, and Leaf Van Boven. 2015. Stumbling in Their Shoes: Disability Simulations Reduce Judged Capabilities of Disabled People. Social Psychological and Personality Science 6, 4 (May 2015), 464--471.",
      "doi": ""
    },
    {
      "text": "Singapore National Eye Centre, General Cataract & Comprehensive Ophthalmology Department. 2018. Cataract. https:// www.snec.com.sg/patient-care/conditions-treatments/cataract",
      "doi": ""
    },
    {
      "text": "Eirini Skiadaresi, Giuseppe Ravalico, Silvio Polizzi, Mats Lundstrom, Miguel Gonzalez-Andrades, and Colm McAlinden. 2016. The Italian Catquest-9SF cataract questionnaire: translation, validation and application. Eye and Vision 3, 1 (April 2016), 12.",
      "doi": ""
    },
    {
      "text": "Sublime Text. {n. d.}. Sublime Text 3. https://www.sublimetext.com/",
      "doi": ""
    },
    {
      "text": "Jani Vayrynen, Ashley Colley, and Jonna Hakkila. 2016. Head Mounted Display Design Tool for Simulating Visual Disabilities. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia (MUM '16). ACM, New York, NY, USA, 69--73.  ",
      "doi": "10.1145/3012709.3012714"
    }
  ]
}