{
  "doi": "10.1145/3290605.3300913",
  "title": "PersonalTouch: Improving Touchscreen Usability by Personalizing Accessibility Settings based on Individual User's Touchscreen Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Modern touchscreen devices have recently introduced customizable touchscreen settings to improve accessibility for users with motor impairments. For example, iOS 10 introduced the following four Touch Accommodation settings: 1) Hold Duration, 2) Ignore Repeat, 3) Tap Assistance, and 4) Tap Assistance Gesture Delay. These four independent settings lead to a total of more than 1 million possible configurations, making it impractical to manually determine the optimal settings. We present PersonalTouch, which collects and analyzes touchscreen gestures performed by individual users, and recommends personalized, optimal touchscreen accessibility settings. Results from our user study show that PersonalTouch significantly improves touch input success rate for users with motor impairments (20.2%, N=12, p=.00054) and for users without motor impairments (1.28%, N=12, p=.032).",
  "tags": [
    "touch-screen interaction",
    "accessibility",
    "personalization",
    "motor impairment"
  ],
  "authors": [
    {
      "name": "Yi-Hao Peng",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-99659261824/rel-imgonly/me_hci_2.png",
      "acmid": "99659261824",
      "orcid": "0000-0002-6335-5904"
    },
    {
      "name": "Muh-Tarng Lin",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366088",
      "orcid": "missing"
    },
    {
      "name": "Yi Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366099",
      "orcid": "missing"
    },
    {
      "name": "TzuChuan Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261980",
      "orcid": "missing"
    },
    {
      "name": "Pin Sung Ku",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161133",
      "orcid": "missing"
    },
    {
      "name": "Paul Taele",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/do/10.1145/contrib-81443597406/rel-imgonly/paul.jpg",
      "acmid": "81443597406",
      "orcid": "missing"
    },
    {
      "name": "Chin Guan Lim",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366906",
      "orcid": "missing"
    },
    {
      "name": "Mike Y. Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81460645188/rel-imgonly/mikebiophotosmall.jpg",
      "acmid": "81460645188",
      "orcid": "0000-0001-5410-652X"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2018. Amazon EC2 service instance. https://aws.amazon. com/ec2/instance-types/p2",
      "doi": ""
    },
    {
      "text": "Lisa Anthony, YooJin Kim, and Leah Findlater. 2013. Analyzing Usergenerated Youtube Videos to Understand Touchscreen Use by People with Motor Impairments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Apple. 2018. Apple App Store. https://www.apple.com/ios/app-store/",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Apple Gesture Recognizer. https://developer.apple.com/ documentation/uikit/uigesturerecognizer",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Apple Photo. https://www.apple.com/ios/photos/",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Apple Researchkit. https://www.apple.com/researchkit/",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Apple Swipe Recognizer. https://developer.apple.com/ documentation/uikit/uiswipegesturerecognizer",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Apple UI Guideline. https://developer.apple.com/design/ human-interface-guidelines/",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Apple UIkit. https://developer.apple.com/documentation/ uikit",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Touch Accommodations. https://support.apple.com/ en-us/HT205269",
      "doi": ""
    },
    {
      "text": "Cryptic Apps. 2018. Hopper - The macOS and Linux Disassembler. https://www.hopperapp.com/",
      "doi": ""
    },
    {
      "text": "Kevin Wayne Arthur, Nada Matic, and Paul Ausbeck. 2008. Evaluating Touch Gestures for Scrolling on Notebook Computers. In CHI '08 Extended Abstracts on Human Factors in Computing Systems (CHI EA '08). ACM, New York, NY, USA, 2943--2948.  ",
      "doi": "10.1145/1358628.1358788"
    },
    {
      "text": "Jef Avery, Mark Choi, Daniel Vogel, and Edward Lank. 2014. Pinchto-zoom-plus: An Enhanced Pinch-to-zoom That Reduces Clutching and Panning. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 595--604.  ",
      "doi": "10.1145/2642918.2647352"
    },
    {
      "text": "Karen B. Chen, Anne B. Savage, Amrish O. Chourasia, Douglas A. Wiegmann, and Mary E. Sesto. 2013. Touch screen performance by individuals with and without motor control disabilities. Applied Ergonomics 44, 2 (2013), 297--302.",
      "doi": ""
    },
    {
      "text": "Leah Findlater, Jon E. Froehlich, Kays Fattal, Jacob O. Wobbrock, and Tanya Dastyar. 2013. Age-related Diferences in Performance with Touchscreens Compared to Traditional Mouse Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 343--346.  ",
      "doi": "10.1145/2470654.2470703"
    },
    {
      "text": "Leah Findlater, Alex Jansen, Kristen Shinohara, Morgan Dixon, Peter Kamb, Joshua Rakita, and Jacob O. Wobbrock. 2010. Enhanced Area Cursors: Reducing Fine Pointing Demands for People with Motor Impairments. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Leah Findlater, Karyn Mofatt, Jon E. Froehlich, Meethu Malu, and Joan Zhang. 2017. Comparing Touchscreen and Mouse Input Performance by People With and Without Upper Body Motor Impairments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6056--6061.  ",
      "doi": "10.1145/3025453.3025603"
    },
    {
      "text": "Google. 2018. Google Gesture Design. https://material.io/design/ interaction/gestures.html",
      "doi": ""
    },
    {
      "text": "Google. 2018. Google Map. https://www.google.com/maps",
      "doi": ""
    },
    {
      "text": "Google. 2018. Google Play Store. https://play.google.com/store",
      "doi": ""
    },
    {
      "text": "Google. 2018. Touch and Hold Delay. https://support.google.com/ accessibility/android/answer/6006989",
      "doi": ""
    },
    {
      "text": "Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2010. Towards Accessible Touch Interfaces. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '10). ACM, New York, NY, USA, 19--26.  ",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "Eve Hoggan, John Williamson, Antti Oulasvirta, Miguel Nacenta, Per Ola Kristensson, and Anu Lehtio. 2013. Multi-touch Rotation Gestures: Performance and Ergonomics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3047--3050.  ",
      "doi": "10.1145/2470654.2481423"
    },
    {
      "text": "Curt B. Irwin and Mary E. Sesto. 2012. Performance and touch characteristics of disabled and non-disabled participants during a reciprocal tapping task using touch screen technology. Applied Ergonomics 43, 6 (2012), 1038--1043.",
      "doi": ""
    },
    {
      "text": "Masatomo Kobayashi, Atsushi Hiyama, Takahiro Miura, Chieko Asakawa, Michitaka Hirose, and Tohru Ifukube. 2011. Elderly User Evaluation of Mobile Touchscreen Interactions. In Human-Computer Interaction -- INTERACT 2011 (INTERACT '11), Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, Germany, 83--99. ",
      "doi": "10.5555/2042053.2042065"
    },
    {
      "text": "Heidi Koester, Rich Simpson, and Jennifer Mankowski. 2013. Software wizards to adjust keyboard and mouse settings for people with physical impairments. J Spinal Cord Med 36, 4 (jul 2013), 300--312.",
      "doi": ""
    },
    {
      "text": "Heidi Horstmann Koester and Jennifer Mankowski. 2014. Automatic Adjustment of Mouse Settings to Improve Pointing Performance. Assistive Technology 26, 3 (2014), 119--128.",
      "doi": ""
    },
    {
      "text": "Heidi Horstmann Koester and Jennifer Mankowski. 2015. Automatic Adjustment of Keyboard Settings Can Enhance Typing. Assistive Technology 27, 3 (2015), 136--146.",
      "doi": ""
    },
    {
      "text": "Jhe-Wei Lin, Chiuan Wang, Yi Yao Huang, Kuan-Ting Chou, Hsuan-Yu Chen, Wei-Luan Tseng, and Mike Y. Chen. 2015. BackHand: Sensing Hand Gestures via Back of the Hand. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 557--564.  ",
      "doi": "10.1145/2807442.2807462"
    },
    {
      "text": "Alexander Mertens, Nicole Jochems, Christopher M. Schlick, Daniel Dünnebacke, and Jan Henrik Dornberg. 2010. Design Pattern TRABING: Touchscreen-based Input Technique for People Afected by Intention Tremor. In Proceedings of the 2Nd ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '10). ACM, New York, NY, USA, 267--272.  ",
      "doi": "10.1145/1822018.1822060"
    },
    {
      "text": "Kyle Montague, Vicki L. Hanson, and Andy Cobley. 2012. Designing for Individuals: Usable Touch-screen Interaction Through Shared User Models. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '12). ACM, New York, NY, USA, 151--158.  ",
      "doi": "10.1145/2384916.2384943"
    },
    {
      "text": "Kyle Montague, Hugo Nicolau, and Vicki L. Hanson. 2014. Motorimpaired Touchscreen Interactions in the Wild. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 123--130.  ",
      "doi": "10.1145/2661334.2661362"
    },
    {
      "text": "Martez E. Mott, Radu-Daniel Vatavu, Shaun K. Kane, and Jacob O. Wobbrock. 2016. Smart Touch: Improving Touch Accuracy for People with Motor Impairments with Template Matching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1934--1946.  ",
      "doi": "10.1145/2858036.2858390"
    },
    {
      "text": "Maia Naftali and Leah Findlater. 2014. Accessibility in Context: Understanding the Truly Mobile Experience of Smartphone Users with Motor Impairments. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (ASSETS '14). ACM, New York, NY, USA, 209--216.  ",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "Alexander Ng and Stephen Brewster. 2017. An Evaluation of Touch and Pressure-Based Scrolling and Haptic Feedback for In-Car Touchscreens. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, New York, NY, USA, 11--20.  ",
      "doi": "10.1145/3122986.3122997"
    },
    {
      "text": "Francisco Nunes, Paula Alexandra Silva, João Cevada, Ana Correia Barros, and Luís Teixeira. 2016. User interface design guidelines for smartphone applications for people with Parkinson's disease. Universal Access in the Information Society 15, 4 (nov 2016), 659--679.  ",
      "doi": "10.1007/s10209-015-0440-1"
    },
    {
      "text": "NVIDIA. 2018. NVIDIA Cuda. https://docs.nvidia.com/cuda/ cuda-c-programming-guide/index.html",
      "doi": ""
    },
    {
      "text": "Sayan Sarcar, Jussi P.P. Jokinen, Antti Oulasvirta, Zhenxin Wang, Chaklam Silpasuwanchai, and Xiangshi Ren. 2018. Ability-Based Optimization of Touchscreen Interactions. IEEE Pervasive Computing 17, 1 (2018), 15--26.  ",
      "doi": "10.1109/MPRV.2018.011591058"
    },
    {
      "text": "Mary E. Sesto, Curtis B. Irwin, Karen B. Chen, Amrish O. Chourasia, and Douglas A. Wiegmann. 2012. Efect of Touch Screen Button Size and Spacing on Touch Characteristics of Users With and Without Disabilities. Human Factors 54, 3 (2012), 425--436.",
      "doi": ""
    },
    {
      "text": "Shari Trewin. 2004. Automating Accessibility: The Dynamic Keyboard. In Proceedings of the 6th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '04). ACM, New York, NY, USA, 71--78.  ",
      "doi": "10.1145/1028630.1028644"
    },
    {
      "text": "Shari Trewin, Cal Swart, and Donna Pettick. 2013. Physical Accessibility of Touchscreen Smartphones. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA, 19:1--19:8.  ",
      "doi": "10.1145/2513383.2513446"
    },
    {
      "text": "Huawei Tu, Xiangshi Ren, Feng Tian, and Feng Wang. 2014. Evaluation of Flick and Ring Scrolling on Touch-Based Smartphones. International Journal of HumanComputer Interaction 30, 8 (2014), 643--653. arXiv:https://doi.org/10.1080/10447318.2014.907017",
      "doi": ""
    },
    {
      "text": "Chat Wacharamanotham, Jan Hurtmanns, Alexander Mertens, Martin Kronenbuerger, Christopher Schlick, and Jan Borchers. 2011. Evaluating Swabbing: A Touchscreen Input Method for Elderly Users with Tremor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 623--626.  ",
      "doi": "10.1145/1978942.1979031"
    },
    {
      "text": "Karl Wiegand. 2015. Impact of Motor Impairment on Full-Screen Touch Interaction. Journal on Technology and Persons with Disabilities 3, 22 (2015), 58--76.",
      "doi": ""
    },
    {
      "text": "Jian Zhao, R. William Soukoref, and Ravin Balakrishnan. 2011. A model of multi-touch manipulation. In Proceedings of the 2nd Annual Meeting of the Graphics, Animation, and New Media (GRAND '11). GRAND NCE, Ottawa, Ontario, Canada, 58--76.",
      "doi": ""
    },
    {
      "text": "Yu Zhong, Astrid Weber, Casey Burkhardt, Phil Weaver, and Jefrey P. Bigham. 2015. Enhancing Android Accessibility for Users with Hand Tremor by Reducing Fine Pointing and Steady Tapping. In Proceedings of the 12th Web for All Conference (W4A '15). ACM, New York, NY, USA, 29:1--29:10.  ",
      "doi": "10.1145/2745555.2747277"
    }
  ]
}