{
  "doi": "10.1145/3290605.3300686",
  "title": "Color Builder: A Direct Manipulation Interface for Versatile Color Theme Authoring",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Color themes or palettes are popular for sharing color combinations across many visual domains. We present a novel interface for creating color themes through direct manipulation of color swatches. Users can create and rearrange swatches, and combine them into smooth and step-based gradients and three-color blends -- all using a seamless touch or mouse input. Analysis of existing solutions reveals a fragmented color design workflow, where separate software is used for swatches, smooth and discrete gradients and for in-context color visualization. Our design unifies these tasks, while encouraging playful creative exploration. Adjusting a color using standard color pickers can break this interaction flow with mechanical slider manipulation. To keep interaction seamless, we additionally design an in situ color tweaking interface for freeform exploration of an entire color neighborhood. We evaluate our interface with a group of professional designers and students majoring in this field.",
  "tags": [
    "color palettes",
    "color themes",
    "creativity support",
    "direct manipulation interfaces",
    "color pickers",
    "gradients"
  ],
  "authors": [
    {
      "name": "Maria Shugrina",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81440606878",
      "orcid": "missing"
    },
    {
      "name": "Wenjia Zhang",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365228",
      "orcid": "missing"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    },
    {
      "name": "Sanja Fidler",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309509611",
      "orcid": "missing"
    },
    {
      "name": "Karan Singh",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335497253",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sean Adams. 2017. The Designer's Dictionary of Color. Abrams Books.",
      "doi": ""
    },
    {
      "text": "Adobe. 2011. Adobe Color Lava for Photoshop. https://www.youtube. com/watch?v=iF4e5bHPD24.",
      "doi": ""
    },
    {
      "text": "Adobe. 2018. Adobe Color CC. https://color.adobe.com.",
      "doi": ""
    },
    {
      "text": "Adobe. 2018. Behance Curated Graphic Design Gallery. https://www.behance.net/galleries/2/Graphic-Design?content= projects&queues=87. Accessed: 2018-08--21.",
      "doi": ""
    },
    {
      "text": "Ritu Agarwal and Elena Karahanna. 2000. Time fies when you're having fun: Cognitive absorption and beliefs about information technology usage. MIS quarterly (2000), 665--694.  ",
      "doi": "10.2307/3250951"
    },
    {
      "text": "Josef Albers. 2013. Interaction of Color (50th anniversary edition ed.). Yale University Press.",
      "doi": ""
    },
    {
      "text": "Moe Amaya. 2018. CSS Gradient. https://cssgradient.io/.",
      "doi": ""
    },
    {
      "text": "Moe Amaya. 2018. Gradient Backgrounds. https://cssgradient.io/ gradient-backgrounds/.",
      "doi": ""
    },
    {
      "text": "Penny F Bauersfeld and Jodi L Slater. 1991. User-oriented color interface design: direct manipulation of color in context. In CHI. 417--418.  ",
      "doi": "10.1145/108844.108981"
    },
    {
      "text": "Bill Baxter, Vincent Scheib, Ming C Lin, and Dinesh Manocha. 2001. DAB: Interactive haptic painting with 3D virtual brushes. In SIGGRAPH. 461--468.  ",
      "doi": "10.1145/383259.383313"
    },
    {
      "text": "Fabrizio Bianchi. 2018. Coolors. https://coolors.co.",
      "doi": ""
    },
    {
      "text": "Anthony M Blatner, James A Ferwerda, Benjamin A Darling, and Reynold J Bailey. 2011. TangiPaint: A Tangible Digital Painting System. Color Imaging Conference (2011), 102--107.",
      "doi": ""
    },
    {
      "text": "Bohemian B.V. 2018. Sketch. https://www.sketchapp.com.",
      "doi": ""
    },
    {
      "text": "Canva. 2018. Color Palette Generator. https://www.canva.com/ color-palette/.",
      "doi": ""
    },
    {
      "text": "Huiwen Chang, Ohad Fried, Yiming Liu, Stephen DiVerdi, and Adam Finkelstein. 2015. Palette-based photo recoloring. ACM Trans. on Graphics (TOG) 34, 4 (2015), 139.  ",
      "doi": "10.1145/2766978"
    },
    {
      "text": "Shaun Chapman. 2018. 0to255. http://www.0to255.com.",
      "doi": ""
    },
    {
      "text": "CharlieMarieTV. 2017. Colour palette management tutorial. https: //www.youtube.com/watch?v=zl_7yHh2PSc.",
      "doi": ""
    },
    {
      "text": "Xiaowu Chen, Dongqing Zou, Jianwei Li, Xiaochun Cao, Qinping Zhao, and Hao Zhang. 2014. Sparse dictionary learning for edit propagation of high-resolution images. In Proc. of the IEEE Conference on Computer Vision and Pattern Recognition. 2854--2861.  ",
      "doi": "10.1109/CVPR.2014.365"
    },
    {
      "text": "Erin Cherry and Celine Latulipe. 2014. Quantifying the creativity support of digital tools through the creativity support index. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 4 (2014), 21.  ",
      "doi": "10.1145/2617588"
    },
    {
      "text": "Alex Clem. 2018. Everything You Need to Know About Gradients in Design. https://www.shutterstock.com/blog/ complete-guide-gradients-designs.",
      "doi": ""
    },
    {
      "text": "ColorBlender. 2018. ColorBlender. http://colorblender.com.",
      "doi": ""
    },
    {
      "text": "ColorHexa. 2018. ColorHexa. https://www.colorhexa.com/ color-gradient.",
      "doi": ""
    },
    {
      "text": "Colormind.io. 2018. Colormind. http://colormind.io/.",
      "doi": ""
    },
    {
      "text": "colorspire. 2018. Colorspire. https://www.colorspire.com/.",
      "doi": ""
    },
    {
      "text": "COLOURlovers. 2018. COLOURlovers CC. http://www.colourlovers. com.",
      "doi": ""
    },
    {
      "text": "Colrd. 2018. Colrd. http://colrd.com/create/palette/.",
      "doi": ""
    },
    {
      "text": "Chris Dannen. 2012. The Magical Tech Behind Paper For iPad's Color-Mixing Perfection. https: //www.fastcompany.com/3002676/open-company/ magical-tech-behind-paper-ipads-color-mixing-perfection.",
      "doi": ""
    },
    {
      "text": "Commision Internationale de l'Éclaraige. 2001. Improvement to industrial colour-diference evaluation. Technical Report 142--2001. Central Bureau of the CIE.",
      "doi": ""
    },
    {
      "text": "Andrew M Derrington, John Krauskopf, and Peter Lennie. 1984. Chromatic mechanisms in lateral geniculate nucleus of macaque. The Journal of Physiology 357, 1 (1984), 241--265.",
      "doi": ""
    },
    {
      "text": "Sara Duane-Gladden. 2018. 10 Handy Tips To Keep Your Color Swatches and Palettes Organized. https://www.hongkiat.com/blog/ color-swatches-organized.",
      "doi": ""
    },
    {
      "text": "Marc Edwards. 2017. Taming Advanced Color Palettes In Photoshop, Sketch And Afnity Designer. https://www.smashingmagazine.com/2017/07/ advanced-color-palettes-photoshop-sketch-afnity-designer/. Accessed: 2018-08--19.",
      "doi": ""
    },
    {
      "text": "Eggradients. 2018. Eggradients. https://www.eggradients.com.",
      "doi": ""
    },
    {
      "text": "Leatrice Eiseman. 2017. The Complete Color Harmony, Pantone Edition: Expert Color Information for Professional Results. Rockport Publishers.",
      "doi": ""
    },
    {
      "text": "Andrew J Elliot and Markus A Maier. 2014. Color psychology: Efects of perceiving color on psychological functioning in humans. Annual review of psychology 65 (2014), 95--120.",
      "doi": ""
    },
    {
      "text": "Indrashish Ghosh. 2018. uiGradients. https://uigradients.com.",
      "doi": ""
    },
    {
      "text": "Google. 2018. Material Design Color Tool. https://material.io/tools/ color.",
      "doi": ""
    },
    {
      "text": "hailpixel. 2018. Colordot. https://color.hailpixel.com.",
      "doi": ""
    },
    {
      "text": "Harry G. Hecht. 1983. A Comparison of the Kubelka-Munk, Rozenberg, and Pitts-Giovanelli Methods of Analysis of Difuse Refectance for Several Model Systems. Applied Spectroscopy 37, 4 (1983), 315--403.",
      "doi": ""
    },
    {
      "text": "Jefrey Heer and Maureen Stone. 2012. Color Naming Models for Color Selection, Image Editing and Palette Design. In CHI. 1007--1016. http://vis.stanford.edu/papers/color-naming-models  ",
      "doi": "10.1145/2207676.2208547"
    },
    {
      "text": "Guosheng Hu, Zhigeng Pan, Mingmin Zhang, De Chen, Wenzhen Yang, and Jian Chen. 2014. An interactive method for generating harmonious color schemes. Color Research & Application 39, 1 (2014), 70--78.",
      "doi": ""
    },
    {
      "text": "HueSnap. 2018. HueSnap. https://www.huesnap.com.",
      "doi": ""
    },
    {
      "text": "IDEA. 2018. ColorRotate. http://mobile.colorotate.org.",
      "doi": ""
    },
    {
      "text": "Itmeo. 2018. Web Gradients. https://webgradients.com/.",
      "doi": ""
    },
    {
      "text": "Ghita Jalal, Nolwenn Maudet, and Wendy E. Mackay. 2015. Color Portraits: From Color Picking to Interacting with Color. CHI (2015), 4207--4216.  ",
      "doi": "10.1145/2702123.2702173"
    },
    {
      "text": "Joseph Angelo Todaro. 2017. How I Organize Colors for a UI Design Project. https://www.youtube.com/watch?v=9S8LGdpNh4Q.",
      "doi": ""
    },
    {
      "text": "Jim Krause. 2017. Color Index XL: More than 1,100 New Palettes with CMYK and RGB Formulas for Designers and Artists. Watson-Guptill.",
      "doi": ""
    },
    {
      "text": "Sharon Lin and Pat Hanrahan. 2013. Modeling how people extract color themes from images. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3101--3110.  ",
      "doi": "10.1145/2470654.2466424"
    },
    {
      "text": "Sharon Lin, Daniel Ritchie, Matthew Fisher, and Pat Hanrahan. 2013. Probabilistic color-by-numbers: Suggesting pattern colorizations using factor graphs. ACM Trans. on Graphics (TOG) 32, 4 (2013), 37.  ",
      "doi": "10.1145/2461912.2461988"
    },
    {
      "text": "Jingwan Lu, Stephen DiVerdi, Willa A Chen, Connelly Barnes, and Adam Finkelstein. 2014. RealPigment: Paint compositing by example. In NPAR. 21--30.  ",
      "doi": "10.1145/2630397.2630401"
    },
    {
      "text": "Donald IA MacLeod and Robert M Boynton. 1979. Chromaticity diagram showing cone excitation by stimuli of equal luminance. JOSA 69, 8 (1979), 1183--1186.",
      "doi": ""
    },
    {
      "text": "Barbara J Meier, Anne Morgan Spalter, and David B Karelitz. 2004. Interactive color palette tools. IEEE Comp. Graph. App. 24, 3 (2004), 64--72.  ",
      "doi": "10.1109/MCG.2004.1297012"
    },
    {
      "text": "Nicolas Mellado, David Vanderhaeghe, Charlotte Hoarau, Sidonie Christophe, Mathieu Brédif, and Loic Barthe. 2017. Constrained palettespace exploration. ACM Trans. on Graphics (TOG) 36, 4 (2017), 60.  ",
      "doi": "10.1145/3072959.3073650"
    },
    {
      "text": "Mindsparkle Mag. 2018. 2018 Design Trends. https://www.behance. net/gallery/60273889/2018-Design-Trends. Accessed: 2018-08--19.",
      "doi": ""
    },
    {
      "text": "Jeanne Nakamura and Mihaly Csikszentmihalyi. 2014. The concept of fow. In Flow and the foundations of positive psychology. Springer, 239--263.",
      "doi": ""
    },
    {
      "text": "Chuong H. Nguyen, Tobias Ritschel, and Hans-Peter Seidel. 2015. DataDriven Color Manifolds. ACM Trans. Graph. 34, 2 (March 2015), 20:1-- 20:9.  ",
      "doi": "10.1145/2699645"
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2011. Color compatibility from large datasets. ACM Trans. on Graphics (TOG) 30, 4 (2011), 63.  ",
      "doi": "10.1145/2010324.1964958"
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2014. Collaborative fltering of color aesthetics. Computational Aesthetics (2014), 33--40.  ",
      "doi": "10.1145/2630099.2630100"
    },
    {
      "text": "Our Own Thing. 2018. Grad Pad. http://ourownthing.co.uk/gradpad. html.",
      "doi": ""
    },
    {
      "text": "Paletton. 2018. Paletton. http://paletton.com.",
      "doi": ""
    },
    {
      "text": "Paper Fifty Three Inc. 2017. Paper by FiftyThree - Sketch, Diagram, Take Notes. https://itunes.apple.com/us/app/ paper-by-fftythree-sketch/id506003812?mt=8.",
      "doi": ""
    },
    {
      "text": "PerBang.dk Color. 2018. RGB Chart & Multi Tool. http://www.perbang. dk/rgb/.",
      "doi": ""
    },
    {
      "text": "PerBang.dk Color. 2018. RGB Color Gradient Maker. http://www. perbang.dk/rgbgradient/.",
      "doi": ""
    },
    {
      "text": "Huy Q Phan, Hongbo Fu, and Antoni B Chan. 2018. Color Orchestra: Ordering Color Palettes for Interpolation and Prediction. IEEE transactions on visualization and computer graphics 24, 6 (2018), 1942--1955.",
      "doi": ""
    },
    {
      "text": "Port80.biz. 2018. ColorExplorer. http://colorexplorer.com.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Brad Myers, Kumiyo Nakakoji, Ben Shneiderman, Randy Pausch, Ted Selker, and Mike Eisenberg. 2005. Design principles for tools to support creative thinking. In NSF Workshop Report on Creativity Support Tools. Citeseer, 25--36.",
      "doi": ""
    },
    {
      "text": "Rikku. 2017. Color Space. https://mycolor.space/.",
      "doi": ""
    },
    {
      "text": "Ryan McCready. 2018. 8 New Graphic Design Trends That Will Take Over 2018. https://venngage.com/blog/graphic-design-trends/. Accessed: 2018-08--19.",
      "doi": ""
    },
    {
      "text": "Gal Shir. 2018. Color Hunt. https://colorhunt.co.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity support tools: Accelerating discovery and innovation. Commun. ACM 50, 12 (2007), 20--32.  ",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Maria Shugrina, Jingwan Lu, and Stephen Diverdi. 2017. Playful palette: an interactive parametric color mixer for artists. ACM Trans. on Graphics (TOG) 36, 4 (2017), 61.  ",
      "doi": "10.1145/3072959.3073690"
    },
    {
      "text": "Alvy Ray Smith. 1978. Color gamut transform pairs. In SIGGRAPH. 12--19.  ",
      "doi": "10.1145/965139.807361"
    },
    {
      "text": "Alvy Ray Smith and Eric Ray Lyons. 1996. HWB-A More Intuitive Hue-Based Color Model. Journal of Graphics Tools 1, 1 (Jan. 1996), 3--17.  ",
      "doi": "10.1080/10867651.1996.10487451"
    },
    {
      "text": "KyoungHee Son, Seo Young Oh, Yongkwan Kim, Hayan Choi, SeokHyung Bae, and Ganguk Hwang. 2015. Color Sommelier: Interactive Color Recommendation System Based on Community-Generated Color Palettes. In UIST Adjunct. 95--96.  ",
      "doi": "10.1145/2815585.2815736"
    },
    {
      "text": "Ian Spalter. 2016. Designing a New Look for Instagram, Inspired by the Community. https://medium.com/@ianspalter/designing-a-new-look-for-instagram-inspired-by-the-community-84530eb355e3.",
      "doi": ""
    },
    {
      "text": "Unfold. 2018. Grabient. https://www.grabient.com/.",
      "doi": ""
    },
    {
      "text": "UX Planet. 2018. Why Gradients are back to rule in 2018? https://uxplanet.org/ why-gradients-are-back-to-rule-in-2018--8b36711c335f. Accessed: 2018-08--19.",
      "doi": ""
    },
    {
      "text": "Peter Vandoren, Tom Van Laerhoven, Luc Claesen, Johannes Taelman, Chris Raymaekers, and Frank Van Reeth. 2008. IntuPaint: Bridging the gap between physical and digital painting. TABLETOP (2008), 65--72.",
      "doi": ""
    },
    {
      "text": "Lauren Wager. 2018. Color Collective's Palette Perfect: Color Combinations Inspired by Fashion, Art and Style. Promopress.",
      "doi": ""
    },
    {
      "text": "Baoyuan Wang, Yizhou Yu, Tien-Tsin Wong, Chun Chen, and YingQing Xu. 2010. Data-driven image color theme enhancement. In ACM Trans. on Graphics (TOG), Vol. 29. ACM, 146.  ",
      "doi": "10.1145/1882261.1866172"
    },
    {
      "text": "Webkul Software. 2018. Cool Hue. https://webkul.github.io/coolhue/. {81} Jane Webster, Linda Klebe Trevino, and Lisa Ryan. 1993. The dimensionality and correlates of fow in human-computer interactions. Computers in human behavior 9, 4 (1993), 411--426. {82} Martijn Wijfelaars, Roel Vliegen, Jarke J. Van Wijk, and Erik-Jan Van Der Linden. 2008. Generating Color Palettes using Intuitive Parameters. Computer Graphics Forum 27, 3 (2008), 743--750.",
      "doi": ""
    },
    {
      "text": "Terry Winograd. 1996. Bringing Design to Software. Addison-Wesley, Chapter Refective Conversation with Materials. ",
      "doi": ""
    },
    {
      "text": "X-Rite Incorporated. 2018. Color Munki. http://www.colormunki.com/ pantone. Accessed: 2018-08--19.",
      "doi": ""
    }
  ]
}