{
  "doi": "10.1145/3290605.3300534",
  "title": "Investigating the Impact of a Real-time, Multimodal Student Engagement Analytics Technology in Authentic Classrooms",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We developed a real-time, multimodal Student Engagement Analytics Technology so that teachers can provide just-in-time personalized support to students who risk disengagement. To investigate the impact of the technology, we ran an exploratory semester-long study with a teacher in two classrooms. We used a multi-method approach consisting of a quasi-experimental design to evaluate the impact of the technology and a case study design to understand the environmental and social factors surrounding the classroom setting. The results show that the technology had a significant impact on the teacher's classroom practices (i.e., increased scaffolding to the students) and student engagement (i.e., less boredom). These results suggest that the technology has the potential to support teachers' role of being a coach in technology-mediated learning environments.",
  "tags": [
    "dashboards",
    "affective computing",
    "real-time",
    "learning analytics",
    "student engagement"
  ],
  "authors": [
    {
      "name": "Sinem Aslan",
      "institution": "Intel Corporation, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707247",
      "orcid": "missing"
    },
    {
      "name": "Nese Alyuz",
      "institution": "Intel Corporation, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81413607333",
      "orcid": "missing"
    },
    {
      "name": "Cagri Tanriover",
      "institution": "Intel Corporation, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659217396",
      "orcid": "missing"
    },
    {
      "name": "Sinem E. Mete",
      "institution": "Bahcesehir University, Istanbul, Turkey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659083730",
      "orcid": "missing"
    },
    {
      "name": "Eda Okur",
      "institution": "Intel Corporation, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659084701",
      "orcid": "missing"
    },
    {
      "name": "Sidney K. D'Mello",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567903",
      "orcid": "missing"
    },
    {
      "name": "Asli Arslan Esme",
      "institution": "Intel Corporation, Hillsboro, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367104",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Minovic, M., & Milovanovic, M. (2013, November). Real-time learning analytics in educational games. In Proceedings of the First International Conference on Technological Ecosystem for Enhancing Multiculturality (pp. 245--251). ACM.  ",
      "doi": "10.1145/2536536.2536574"
    },
    {
      "text": "Ginda, M., Suri, N., Bueckle, A., & Börner, K. (2017). Empowering Instructors in Learning Management Systems: Interactive Heat Map Analytics Dashboard.",
      "doi": ""
    },
    {
      "text": "Hattie, J., & Timperley, H. (2007). The power of feedback. Review of educational research, 77(1), 81--112.",
      "doi": ""
    },
    {
      "text": "Federici, R. A., & Skaalvik, E. M. (2014). Students' Perceptions of Emotional and Instrumental Teacher Support: Relations with Motivational and Emotional Responses. International Education Studies, 7(1), 21--36.",
      "doi": ""
    },
    {
      "text": "D'Mello, S., Olney, A., Williams, C., & Hays, P. (2012). Gaze tutor: A gaze-reactive intelligent tutoring system. International Journal of Human-Computer Studies, 70(5), 377--398.  ",
      "doi": "10.1016/j.ijhcs.2012.01.004"
    },
    {
      "text": "Henrie, C. R., Halverson, L. R., & Graham, C. R. (2015). Measuring student engagement in technology-mediated learning: A review. Computers & Education, 90, 36--53.  ",
      "doi": "10.1016/j.compedu.2015.09.005"
    },
    {
      "text": "Lee, M. J., & Ferwerda, B. (2017). Personalizing online educational tools. In Proceedings of the 2017 ACM Workshop on TheoryInformed User Modeling for Tailoring and Personalizing Interfaces (pp. 27--30). ACM.  ",
      "doi": "10.1145/3039677.3039680"
    },
    {
      "text": "Vail, A. K., Wiggins, J. B., Grafsgaard, J. F., Boyer, K. E., Wiebe, E. N., & Lester, J. C. (2016). The Affective Impact of Tutor Questions: Predicting Frustration and Engagement. In EDM (pp. 247--254).",
      "doi": ""
    },
    {
      "text": "D'Mello, S., Dieterle, E., & Duckworth, A. (2017). Advanced, analytic, automated (AAA) measurement of engagement during learning. Educational psychologist, 52(2), 104--123.",
      "doi": ""
    },
    {
      "text": "D'Mello, S. K., & Graesser, A. (2010). Multimodal semi-automated affect detection from conversational cues, gross body language, and facial features. User Modeling and User-adapted Interaction, 20(2), 147187.  ",
      "doi": "10.1007/s11257-010-9074-4"
    },
    {
      "text": "Graesser, A. C., Cai, Z., Morgan, B., & Wang, L. (2017). Assessment with computer agents that engage in conversational dialogues and trialogues with learners. Computers in Human Behavior, 76, 607--616.  ",
      "doi": "10.1016/j.chb.2017.03.041"
    },
    {
      "text": "Okur, E., Alyuz, N., Aslan, S., Genc, U., Tanriover, C., & Arslan Esme, A. (2017, June). Behavioral engagement detection of students in the wild. In International Conference on Artificial Intelligence in Education (pp. 250--261). Springer, Cham",
      "doi": ""
    },
    {
      "text": "Alyuz, N., Okur, E., Genc, U., Aslan, S., Tanriover, C., & Arslan Esme, A. (2017, November). An unobtrusive and multimodal approach for behavioral engagement detection of students. In Proceedings of the 1st ACM SIGCHI International Workshop on Multimodal Interaction for Education (pp. 26--32). ACM.  ",
      "doi": "10.1145/3139513.3139521"
    },
    {
      "text": "Alyuz, N., Okur, E., Oktay, E., Genc, U., Aslan, S., Mete, S. E., Arnrich, B., & Arslan Esme, A. (2016, October). Semi-supervised model personalization for improved detection of learner's emotional engagement. In Proceedings of the 18th ACM International Conference on Multimodal Interaction (pp. 100--107). ACM.  ",
      "doi": "10.1145/2993148.2993166"
    },
    {
      "text": "Aslan, S., Mete, S. E., Okur, E., Oktay, E., Alyuz, N., Genc, U. E., Stanhill, D. & Arslan Esme, A. (2017). Human expert labeling process (HELP): Towards a reliable higher-order user state labeling process and tool to assess student engagement. Educational Technology, 53--59.",
      "doi": ""
    },
    {
      "text": "Mazza, R., Dimitrova, V.: CourseVis: a graphical student monitoring tool for supporting instructors in web-based distance courses. Int. J. Hum. Compu. Stud. 65(2), 125--139 (2007).  ",
      "doi": "10.1016/j.ijhcs.2006.08.008"
    },
    {
      "text": "Maldonado, R. M., Kay, J., Yacef, K., & Schwendimann, B. (2012, June). An interactive teacher's dashboard for monitoring groups in a multitabletop learning environment. In International Conference on Intelligent Tutoring Systems (pp. 482--492). Springer, Berlin, Heidelberg.  ",
      "doi": "10.1007/978-3-642-30950-2_62"
    },
    {
      "text": "Van Leeuwen, A., Janssen, J., Erkens, G., & Brekelmans, M. (2014). Supporting teachers in guiding collaborating students: Effects of learning analytics in CSCL. Computers & Education, 79, 28--39.  ",
      "doi": "10.1016/j.compedu.2014.07.007"
    },
    {
      "text": "Xhakaj F., Aleven V., McLaren B.M. (2017). Effects of a Teacher Dashboard for an Intelligent Tutoring System on Teacher Knowledge, Lesson Planning, Lessons and Student Learning. In: Lavoué É., Drachsler H., Verbert K., Broisin J., Pérez-Sanagustín M. (eds) Data Driven Approaches in Digital Education. EC-TEL 2017. Lecture Notes in Computer Science, vol 10474. Springer, Cham.",
      "doi": ""
    },
    {
      "text": "Plattner, H. (2010). An Introduction to Design Thinking Process Guide. The Institute of Design at Stanford.",
      "doi": ""
    },
    {
      "text": "Woolf, B., Burleson, W., Arroyo, I., Dragon, T., Cooper, D., & Picard, R. (2009). Affect-aware tutors: recognising and responding to student affect. International Journal of Learning Technology, 4(3--4), 129--164.  ",
      "doi": "10.1504/IJLT.2009.028804"
    },
    {
      "text": "Askar, P. (1986). Matematik dersine yonelik tutumu olcen likert-tipi bir olcegin gelistirilmesi. Egitim ve Bilim, 62, 31--36.",
      "doi": ""
    },
    {
      "text": "Avci, E., Coskuntuncel, O., & Inandi, Y. (2011). Ortaögretim on ikinci sinif ögrencilerinin matematik dersine karsi tutumlari. Mersin Üniversitesi Egitim Fakültesi Dergisi, 7(1).",
      "doi": ""
    },
    {
      "text": "Deci, E. L. & Ryan, R. M. (1982), Intrinsic Motivation Inventory, Retrieved September 01, 2017 from, http://www.psych.rochester.edu/SDT/measures/word/IMIfull.doc",
      "doi": ""
    },
    {
      "text": "Karagol, D. (2008). Promoting learner autonomy to increase the intrinsic motivation of the young language learners. Yayinlanmamis yuksek lisans tezi) Çukurova Universitesi Sosyal Bilimler Enstitusu, Adana.",
      "doi": ""
    },
    {
      "text": "Rheinberg, F., Vollmeyer, R. & Engeser, S. (2003). Die Erfassung des Flow-Erlebens {The assessment of flow}. In J. Stiensmeier-Pelster & F. Rheinberg (Eds.), Diagnostik von Motivation und Selbstkonzept (Tests und Trends N.F. Bd. 2) (pp. 261--279). Göttingen: Hogrefe.",
      "doi": ""
    },
    {
      "text": "Rheinberg, F. (2015). Die Flow-Kurzskala (FKS) übersetzt in verschiedene Sprachen The Flow-Short-Scale (FSS) translated into various languages.",
      "doi": ""
    },
    {
      "text": "Creswell, J. W. (2009). Research design: Qualitative, quantitative, and mixed methods approaches. Thousand Oaks, CA: Sage Publications.",
      "doi": ""
    },
    {
      "text": "Weber, R. P. (1990). Basic Content Analysis. Newbury Park, CA: Sage Publications.",
      "doi": ""
    },
    {
      "text": "Krippendorff, K. (2004). Content analysis: An introduction to its methodology (2nd ed.). Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Aslan, S. (2012). Investigating\" the coolest school in America\": A study of a learner-centered school and educational technology in the information age (Doctoral dissertation, Indiana University).",
      "doi": ""
    },
    {
      "text": "Cohen, J. (1988). Statistical power analysis for the behavioral sciences (2nd ed.), Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Saye, J.W. & Brush, T. (2002). Scaffolding critical reasoning about history and social issues in multimedia-supported learning environments. Educational Technology Research and Development 50(3): 77--96.",
      "doi": ""
    },
    {
      "text": "Simons, K.D., Klein, J. & Brush, T. (2004). Instructional strategies utilized during the implementation of a hypermedia, problem-based learning environment: A case study. Journal of Interactive Learning Research 15: 213--233.",
      "doi": ""
    },
    {
      "text": "Bloom, B. S., Engelhart, M. D., Furst, E. J., Hill, W. H., & Krathwohl, D. R. (1956). Taxonomy of educational objectives: The classification of educational goals. Handbook I: Cognitive domain. New York, NY: David McKay Company.",
      "doi": ""
    },
    {
      "text": "Crowe, A., Dirks, C., & Wenderoth, M. P. (2008). Biology in bloom: implementing Bloom's taxonomy to enhance student learning in biology. CBE-Life Sciences Education, 7(4), 368--381.",
      "doi": ""
    },
    {
      "text": "Merriam, S. B. (1991). Case study research in education: A qualitative approach. San Francisco: Jossey-Bass.",
      "doi": ""
    }
  ]
}