{
  "doi": "10.1145/3290605.3300666",
  "title": "\"What is Fair Shipping, Anyway?\": Using Design Fiction to Raise Ethical Awareness in an Industrial Context",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "The HCI community cares for the human and social aspects of technologies. Ethical discussion on the social implications of new technologies often happen among researchers, but it is important to raise this discussion also in the industry that designs and implements new systems. In this paper, we introduce a case in which design fiction was used as an ethical discussion tool among company partners. We report the process of creating and prototyping a fictional world embedded with conflicting values that aimed to shift the focus from industrial merits towards societal values and raise discussion among participants. Moreover, we examine the challenges and propose suggestions in crafting critiques and friction to the industrial context. Our findings suggest why and how one should use design fiction as a means to raise ethical awareness in a technology- and profit-focused context, to support further activities on developing more humane technological futures.",
  "tags": [
    "ethics of automation",
    "b2b industries",
    "value fiction",
    "design fiction",
    "design methodology",
    "design methods"
  ],
  "authors": [
    {
      "name": "Yiying Wu",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659309411",
      "orcid": "missing"
    },
    {
      "name": "Sus Lyckvi",
      "institution": "Chalmers University of Technology, Gothenburg, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068440",
      "orcid": "missing"
    },
    {
      "name": "Virpi Roto",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/do/10.1145/contrib-81100443285/rel-imgonly/virpiroto-face.png",
      "acmid": "81100443285",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Richard Barbrook. 2007. Imaginary futures: From thinking machines to the global village. Pluto Press. ",
      "doi": "10.5555/1526088"
    },
    {
      "text": "Karl Baumann, Benjamin Stokes, François Bar and Ben Caldwell. 2017. Infrastructures of the Imagination: Community Design for Speculative Urban Technologies. In Proceedings of the 8th International Conference on Communities and Technologies. 266-  ",
      "doi": "10.1145/3083671.3083700"
    },
    {
      "text": "Julian Bleecker. 2009. Design fiction: A short essay on design, science, fact and fiction.. Near Future Laboratory.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2014. Research through design fiction: narrative in real and imaginary abstracts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 703--712  ",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Susanne Bødker. 2003. A for Alternatives. Scandinavian Journal of Information Systems, 15, 1. ",
      "doi": "10.5555/958052.958061"
    },
    {
      "text": "Torie Bosch. 2012. Sci-Fi writer Bruce Sterling explains the intriguing new concept of design fiction. The Slate Group,",
      "doi": ""
    },
    {
      "text": "Barry Brown, Julian Bleecker, Marco D'adamo, Pedro Ferreira, Joakim Formo, Mareike Glöss, Maria Holm, Kristina Höök, Eva-Carin Banka Johnson and Emil Kaburuan. 2016. The IKEA Catalogue: Design fiction in academic and industrial collaborations. In GROUP. 335--344  ",
      "doi": "10.1145/2957276.2957298"
    },
    {
      "text": "Alex Burns. 2003. Business intelligence. In Australian Foresight Institute. Victoria, Australia,",
      "doi": ""
    },
    {
      "text": "Stuart Candy. 2010. The futures of everyday life: Politics and the design of experiential scenarios. Université d'Hawaï à Manoa. Doctorat de philosophie en sciences politiques.",
      "doi": ""
    },
    {
      "text": "Eunjeong Cheon and Norman Makoto Su. 2018. Futuristic autobiographies: Weaving participant narratives to elicit values around robots. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 388--397  ",
      "doi": "10.1145/3171221.3171244"
    },
    {
      "text": "Paul Coulton and Joseph Lindley. 2017. Vapourworlds and design fiction: The role of intentionality. The Design Journal, 20, S4632S4642.",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Joseph Galen Lindley, Miriam Sturdee and Michael Stead. 2017. Design fiction as world building. In Proceedings of the 3rd Biennial Research Through Design Conference. Edinburgh,",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2001. Design noir: The secret life of electronic objects. Springer. Berlin.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: Design, fiction, and social dreaming. The MIT Press. Cambridge, MA. ",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C Durrant, Andrew Garbett, Bettina Nissen, John Vines and David S Kirk. 2017. On speculative enactments. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 5386--5399  ",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Gabriele Ferri, Jeffrey Bardzell, Shaowen Bardzell and Stephanie Louraine. 2014. Analyzing critical designs: categories, distinctions, and canons of exemplars. In Proceedings of the 2014 Conference on Designing Interactive Systems. 355--364  ",
      "doi": "10.1145/2598510.2598588"
    },
    {
      "text": "Laura Forlano and Anijo Mathew. 2014. From design fiction to design friction: Speculative and participatory design of values-embedded urban technology. Journal of Urban Technology, 21, 7--24.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist studies, 14, 575--599.",
      "doi": ""
    },
    {
      "text": "Maria Huusko, Yiying Wu and Virpi Roto. 2018. Structuring and engaging: The roles of design fictions in a co-design workshop. In Proceedings of the 6th Australian Conference on Human-Computer Interaction. Melbourne, Australia,  ",
      "doi": "10.1145/3292147.3292165"
    },
    {
      "text": "Sohail Inayatullah. 1990. Deconstructing and reconstructing the future: Predictive, cultural and critical epistemologies. Futures, 22, 115--141.",
      "doi": ""
    },
    {
      "text": "Herman Kahn and Anthony J Wiener. 1967. Year 2000: A framework for speculation on the next thirty-three years. Macmillan. New York.",
      "doi": ""
    },
    {
      "text": "Mette Kjærsgaard and Laurens Boer. 2016. Design anthropological frictions: Mundane practices meet speculative critique, in R. C. Smith, Jeanne Van Heeswijk, Mette Kjærsgaard, Ton Otto, Joachim Halse and Thomas Binder, ed. Design anthropological futures. Bloomsbury Publishing.",
      "doi": ""
    },
    {
      "text": "Eva Knutz, Tau Ulv Lenskjold and Thomas Markussen. 2016. Fiction as a resource in participatory design. In 50th Anniversary Design Research Society Conference. 1830--1844",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev. 2016. Stop nigmas: Experimental speculative design through pragmatic aesthetics and public art. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. 76  ",
      "doi": "10.1145/2971485.2993921"
    },
    {
      "text": "Shaun Lawson, Ben Kirman, Conor Linehan, Tom Feltwell and Lisa Hopkins. 2015. Problematising upstream technology through speculative design: the case of quantified cats and dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2663--2672  ",
      "doi": "10.1145/2702123.2702260"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Back to the future: 10 years of design fiction. In Proceedings of the 2015 British HCI Conference. 210--211  ",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Game of drones. In Proceedings of the 2015 annual symposium on computer-human interaction in play. 613--618  ",
      "doi": "10.1145/2793107.2810300"
    },
    {
      "text": "Sus Lyckvi, Yiying Wu, Maria Huusko and Virpi Roto. 2018. Eagons, exoskeletons and ecologies: On expressing and embodying fictions as workshop tasks. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction. 754--770  ",
      "doi": "10.1145/3240167.3240269"
    },
    {
      "text": "Matt Malpass. 2013. Between Wit and reason: defining associative, speculative, and critical design in practice. Design and Culture, 5, 333--356.",
      "doi": ""
    },
    {
      "text": "S Marinova, R Ul-Haq, Claudio Gomez Portaleoni and Marin Marinov. 2013. Corporate foresight and strategic decisions: lessons from a European bank. Springer.",
      "doi": ""
    },
    {
      "text": "Thomas Markussen and Eva Knutz. 2013. The poetics of design fiction. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces. Newcastle upon Tyne, United Kingdom, 231--240  ",
      "doi": "10.1145/2513506.2513531"
    },
    {
      "text": "Ramia Mazé. 2016. Design and the Future: Temporal Politics of 'Making a Difference.', in R. C. Smith, Jeanne Van Heeswijk, Mette Kjærsgaard, Ton Otto, Joachim Halse and Thomas Binder, ed. Design Anthropological Futures. Bloomsbury Publishing. 37",
      "doi": ""
    },
    {
      "text": "Ian Miles. 1975. The poverty of prediction. Saxon House; Lexington, Mass.: Lexington Books.",
      "doi": ""
    },
    {
      "text": "Enid Mumford. 1996. Systems design: ethical tools for ethical change. Macmillan International Higher Education.",
      "doi": ""
    },
    {
      "text": "Sebastian Prost, Elke Mattheiss and Manfred Tscheligi. 2015. From awareness to empowerment: Using design fiction to explore paths towards a sustainable energy future. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1649--1658  ",
      "doi": "10.1145/2675133.2675281"
    },
    {
      "text": "Richard A Slaughter. 2003. Futures beyond dystopia: Creating social foresight. Routledge.",
      "doi": ""
    },
    {
      "text": "Hyeonju Son. 2015. The history of Western futures studies: An exploration of the intellectual traditions and three-phase periodization. Futures, 66, 120--137.",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2013. Patently untrue: Fleshy defibrillators and synchronised baseball are changing the future. Wired UK,",
      "doi": ""
    },
    {
      "text": "Eric L Trist and Ken W Bamforth. 1951. Some social and psychological consequences of the longwall method of coal-getting: An examination of the psychological situation and defences of a work group in relation to the social structure and technological content of the work system. Human relations, 4, 3--38.",
      "doi": ""
    },
    {
      "text": "Bart Van Steenbergen. 1970. Critical and establishment futurology. In Proceedings of the International Future Research Conference Tokyo, 93--101",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk and Patrick Olivier. 2012. Questionable concepts: critique as resource for designing with eighty somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1169-  ",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "Heiko A Von Der Gracht, Christoph Robert Vennemann and IngaLena Darkow. 2010. Corporate foresight and innovation management: A portfolio-approach in evaluating organizational development. Futures, 42, 380--393.",
      "doi": ""
    }
  ]
}