{
  "doi": "10.1145/3290605.3300884",
  "title": "Cognitive Aids in Acute Care: Investigating How Cognitive Aids Affect and Support In-hospital Emergency Teams",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Cognitive aids - artefacts that support a user in the completion of a task at the time - have raised great interest to support healthcare staff during medical emergencies. However, the mechanisms of how cognitive aids support or affect staff remain understudied. We describe the iterative development of a tablet-based cognitive aid application to support in-hospital resuscitation team leaders. We report a summative evaluation of two different versions of the application. Finally, we outline the limitations of current explanations of how cognitive aids work and suggest an approach based on embodied cognition. We discuss how cognitive aids alter the task of the team leader (distributed cognition), the importance of the present team situation (socially situated), and the result of the interaction between mind and environment (sensorimotor coupling). Understanding and considering the implications of introducing cognitive aids may help to increase acceptance and effectiveness of cognitive aids and eventually improve patient safety.",
  "tags": [
    "non-technical performance",
    "embodied cognition",
    "cardiopulmonary resuscitation",
    "simulation",
    "cardiac arrest",
    "cognitive aid"
  ],
  "authors": [
    {
      "name": "Tobias Grundgeiger",
      "institution": "Julius-Maximilians-University, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658719789",
      "orcid": "0000-0002-3471-2343"
    },
    {
      "name": "Stephan Huber",
      "institution": "Julius-Maximilians-University, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366703",
      "orcid": "0000-0002-5619-3222"
    },
    {
      "name": "Daniel Reinhardt",
      "institution": "Julius-Maximilians-University, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659123209",
      "orcid": "missing"
    },
    {
      "name": "Andreas Steinisch",
      "institution": "University Hospital of Würzburg, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366733",
      "orcid": "missing"
    },
    {
      "name": "Oliver Happel",
      "institution": "University Hospital of Würzburg, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261789",
      "orcid": "0000-0001-7320-8521"
    },
    {
      "name": "Thomas Wurmb",
      "institution": "University Hospital of Würzburg, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366844",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benjamin S. Abella, Jason P. Alvarado, Helge Myklebust, Dana P. Edelson, Anne Barry, Nicholas O'hearn, Terry L. Vanden Hoek, and Lance B. Becker. 2005. Quality of cardiopulmonary resuscitation during in-hospital cardiac arrest. JAMA 293, 3: 305--310.",
      "doi": ""
    },
    {
      "text": "Petra Bacso and Diego Quintanilha Miranda Pereira, 2014. Web design and usability Issues: how people read webpages. HaagaHelia University of Applied Sciences.",
      "doi": ""
    },
    {
      "text": "Linden J. Ball and Thomas C. Ormerod. 2000. Putting ethnography to work: the case for a cognitive ethnography of design. International Journal of Human-Computer Studies 53, 1: 147--168.  ",
      "doi": "10.1006/ijhc.2000.0372"
    },
    {
      "text": "Jürgen Bengel and Markus Heinrichs, 2004. Psychische Belastungen des Rettungspersonals. In Psychologie in Notfallmedizin und Rettungsdienst, J. BENGEL Ed. Springer, Berlin, 25--43.",
      "doi": ""
    },
    {
      "text": "Mikkel Brabrand, Lars Folkestad, and Susanne Hosbond. 2011. Perception of time by professional health care workers during simulated cardiac arrest. Am J Emerg Med 29, 1: 124--126.",
      "doi": ""
    },
    {
      "text": "Barbara K Burian, Anna Clebone, Key Dismukes, and Keith J Ruskin. 2018. More than a tick box: medical checklist development, design, and use. Anesth Analg 126, 1: 223--232.",
      "doi": ""
    },
    {
      "text": "Kelly Caine. 2016. Local standards for sample size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'16), 981--992.  ",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Jim Christenson, Douglas Andrusiek, Siobhan Everson-Stewart, Peter Kudenchuk, David Hostler, Judy Powell, Clifton W. Callaway, Dan Bishop, Christian Vaillancourt, Dan Davis, Tom P. Aufderheide, Ahamed Idris, John A. Stouffer, Ian Stiell, Robert Berg, and The Resuscitation Outcomes Consortium Investigators. 2009. Chest compression fraction determines survival in patients with out-of-hospital ventricular fibrillation. Circulation 120, 13: 1241--1247.",
      "doi": ""
    },
    {
      "text": "Andy Clark, 1998. Being there: putting brain, body, and world together again. MIT press. ",
      "doi": "10.5555/524400"
    },
    {
      "text": "Simon Cooper and Robyn P. Cant. 2014. Measuring nontechnical skills of medical emergency teams: an update on the validity and reliability of the Team Emergency Assessment Measure (TEAM). Resuscitation 85, 1: 31--33.",
      "doi": ""
    },
    {
      "text": "Simon Cooper, Robyn Cant, Joanne Porter, Ken Sellick, George Somers, Leigh Kinsman, and Debra Nestel. 2010. Rating medical emergency teamwork performance: development of the Team Emergency Assessment Measure (TEAM). Resuscitation 81, 4: 446--452.",
      "doi": ""
    },
    {
      "text": "Jelle Van Dijk and Caroline Hummels. 2017. Designing for Embodied Being-in-the-World: Two Cases, Seven Principles and One Framework. In Proceedings of the Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction, 47--56.  ",
      "doi": "10.1145/3024969.3025007"
    },
    {
      "text": "Paul Dourish, 2001. Where the action is. MIT press Cambridge.",
      "doi": ""
    },
    {
      "text": "Tobias C. Everett, P. J. Morgan, R. Brydges, M. Kurrek, D. Tregunno, L. Cunningham, A. Chan, D. Forde, and J. Tarshis. 2017. The impact of critical event checklists on medical management and teamwork during simulated crises in a surgical daycare facility. Anaesthesia 72, 3: 350--358.",
      "doi": ""
    },
    {
      "text": "Larry C. Field, Matthew D. Mcevoy, Jeremy C. Smalley, Carlee A. Clark, Michael B. Mcevoy, Horst Rieke, Paul J. Nietert, and Cory M. Furse. 2014. Use of an electronic decision support tool improves management of simulated in-hospital cardiac arrest. Resuscitation 85, 1: 138--142.",
      "doi": ""
    },
    {
      "text": "Evie Fioratou, Rona Flin, and Ronnie Glavin. 2010. No simple fix for fixation errors: cognitive processes and their clinical applications. Anaesthesia 65, 1: 61--69.",
      "doi": ""
    },
    {
      "text": "Keaton A Fletcher and Wendy L Bedwell. 2014. Cognitive aids: design suggestions for the medical field. In Proceedings of the International Symposium on Human Factors and Ergonomics in Health Care, 148--152.",
      "doi": ""
    },
    {
      "text": "Sara N Goldhaber-Fiebert and Steven K Howard. 2013. Implementing emergency manuals: can cognitive aids help translate best practices for patient care during acute events? Anesth Analg 117, 5: 1149--1161.",
      "doi": ""
    },
    {
      "text": "Michael J. Gonzales, Vanice C. Cheung, and Laurel D. Riek. 2015. Designing collaborative healthcare technology for the acute care workflow. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare, 145--152. ",
      "doi": "10.5555/2826165.2826187"
    },
    {
      "text": "Michael J. Gonzales, Joshua M. Henry, Aaron W. Calhoun, and Laurel D. Riek. 2016. Visual task: a collaborative cognitive aid for acute care resuscitation. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare, 45--52. ",
      "doi": "10.5555/3021319.3021327"
    },
    {
      "text": "Eliot Grigg. 2015. Smarter clinical checklists: how to minimize checklist fatigue and maximize clinician performance. Anesth Analg 121, 2: 570--573.",
      "doi": ""
    },
    {
      "text": "Tobias Grundgeiger, Moritz Albert, Daniel Reinhardt, Oilver Happel, Andreas Steinisch, and Thomas Wurmb. 2016. Realtime tablet-based resuscitation documentation by the team leader: evaluating documentation quality and clinical performance. Scand J Trauma Resusc Emerg Med 24, 1: 1--7.",
      "doi": ""
    },
    {
      "text": "T. Kyle Harrison, Tanja Manser, Steven K. Howard, and David M. Gaba. 2006. Use of cognitive aids in a simulated anesthetic crisis. Anesth Analg 103, 3: 551--556.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): results of empirical and theoretical research. Adv Cogn Psychol 52: 139--183.",
      "doi": ""
    },
    {
      "text": "Erik Hollnagel and David D. Woods, 2005. Joint cognitive systems: foundations of cognitive systems engineering Taylor & Francis, Boca Raton, FL.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction? In Proceedings of the Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 50405052.  ",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Edwin Hutchins, 1995. Cognition in the wild. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins. 1995. How a cockpit remembers its speeds. Cogn Sci 19, 3: 265--288.",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins, 2001. Distributed cognition. In The International Encyclopedia of the Social and Behavioral Sciences, J.S. NEIL and B.B. PAUL Eds. Pergamon, Oxford, 2068--2072.",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins. 2010. Cognitive ecology. Top Cogn Sci 2, 4: 705--715.",
      "doi": ""
    },
    {
      "text": "Nicola Jones, Craig Lammas, and Carl Gwinnutt. 2010. Poor recall of \"4Hs and 4Ts\" by medical staff. Resuscitation 81, 11: 1600.",
      "doi": ""
    },
    {
      "text": "Victor Kaptelinin and Bonnie Nardi. 2012. Activity theory in HCI: Fundamentals and reflections. Synthesis Lectures HumanCentered Informatics 5, 1: 1--105. ",
      "doi": "10.5555/2361921"
    },
    {
      "text": "John Kinnear. 2017. Cognitive aids and 'behavioural anaesthesia'. Anaesthesia 72, 6: 794--795.",
      "doi": ""
    },
    {
      "text": "Alyssa Klein, Leah Kulp, and Aleksandra Sarcevic. 2018. Designing and optimizing digital applications for medical emergencies. In Proceedings of the Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18), 1--6.  ",
      "doi": "10.1145/3170427.3188678"
    },
    {
      "text": "Leah Kulp and Aleksandra Sarcevic. 2017. Design in the wild: lessons from researcher participation in design of emerging technology. In Proceedings of the Extended Abstracts of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17), 1802--1808.  ",
      "doi": "10.1145/3027063.3053170"
    },
    {
      "text": "Leah Kulp and Aleksandra Sarcevic. 2018. Design in the \"medical\" wild: challenges of technology deployment. In Proceedings of the Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18), 1--6.  ",
      "doi": "10.1145/3170427.3188571"
    },
    {
      "text": "R Lelaidier, B Balança, S Boet, A Faure, M Lilot, F Lecomte, JJ Lehot, T Rimmelé, and J-C Cejka. 2017. Use of a hand-held digital cognitive aid in simulated crises: the MAX randomized controlled trial. Br J Anaesth 119, 5: 1015--1021.",
      "doi": ""
    },
    {
      "text": "Daniel Low, N Clark, J Soar, A Padkin, A Stoneham, Gavin D Perkins, and J Nolan. 2011. A randomised control trial to determine if use of the iResus© application on a smart phone improves the performance of an advanced life support provider in a simulated medical emergency*. Anaesthesia 66, 4: 255--262.",
      "doi": ""
    },
    {
      "text": "John M. Lyons, Jorge A. Martinez, and J. Patrick O'leary. 2009. Medical malpractice matters: medical record M & Ms. J Surg Educ 66, 2: 113--117.",
      "doi": ""
    },
    {
      "text": "Tanja Manser, T. Kyle Harrison, David M. Gaba, and Steven K. Howard. 2009. Coordination patterns related to high clinical performance in a simulated anesthetic crisis. Anesth Analg 108, 5: 1606--1615.",
      "doi": ""
    },
    {
      "text": "Stephan C. U. Marsch, Christian Müller, Katja Marquardt, Gerson Conrad, Franziska Tschan, and Patrick R. Hunziker. 2004. Human factors affect the quality of cardiopulmonary resuscitation in simulated cardiac arrests. Resuscitation 60, 1: 51--56.",
      "doi": ""
    },
    {
      "text": "Stuart D. Marshall. 2013. The use of cognitive aids during emergencies in anesthesia: a review of the literature. Anesth Analg 117, 5: 1162--1171.",
      "doi": ""
    },
    {
      "text": "Stuart D. Marshall. 2017. Helping experts and expert teams perform under duress: an agenda for cognitive aid research. Anaesthesia 72, 3: 289--295.",
      "doi": ""
    },
    {
      "text": "Stuart D. Marshall and Rishi Mehra. 2014. The effects of a displayed cognitive aid on non-technical skills in a simulated 'can't intubate, can't oxygenate' crisis. Anaesthesia 69, 7: 669677.",
      "doi": ""
    },
    {
      "text": "Stuart D. Marshall, Penelope Sanderson, Cate A. Mcintosh, and Helen Kolawole. 2016. The effect of two cognitive aid designs on team functioning during intra?operative anaphylaxis emergencies: a multi-centre simulation study. Anaesthesia 71, 4: 389--404.",
      "doi": ""
    },
    {
      "text": "Matthew D Mcevoy, William R Hand, W David Stoll, Cory M Furse, and Paul J Nietert. 2014. Adherence to guidelines for the management of local anesthetic systemic toxicity is improved by an electronic decision support tool and designated 'reader'. Reg Anesth Pain Med 39, 4: 299--305.",
      "doi": ""
    },
    {
      "text": "Frederik Mondrup, Mikkel Brabrand, Lars Folkestad, Jakob Oxlund, Karsten R Wiborg, Niels P Sand, and Torben Knudsen. 2011. In-hospital resuscitation evaluated by in situ simulation: a prospective simulation study. Scand J Trauma Resusc Emerg Med 19, 55: 1--6.",
      "doi": ""
    },
    {
      "text": "Felipe Scipião Moura, Felipe Veiga De Carvalho, Maria Do Carmo De Carvalho E Martins, Gerardo Mesquita Vasconcelos, and Patrícia Machado Veiga De Carvalho Mello. 2016. Knowledge of Guidelines for Cardiopulmonary Resuscitation among Brazilian Medical Students. Revista Brasileira de Educação Médica 40: 77--85.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman, 1993. Things that make us smart: defending human attributes in the age of the machine Addison-Wesley Pub. Co., Reading, Mass. ",
      "doi": "10.5555/200550"
    },
    {
      "text": "Samantha E. Parsons, Elizabeth A. Carter, Lauren J. Waterhouse, Jennifer Fritzeen, Deirdre C. Kelleher, Karen J. O'connell, Aleksandra Sarcevic, Kelley M. Baker, Erik Nelson, Nicole E. Werner, Deborah A. Boehm-Davis, and Randall S. Burd. 2014. Improving ATLS performance in simulated pediatric trauma resuscitation using a checklist. Ann Surg 259, 4: 807--813.",
      "doi": ""
    },
    {
      "text": "Meera Ramachandran, Joel S. Greenstein, Michael Mcevoy, and Matthew D. Mcevoy. 2014. Using a context-sensitive ranking method to organize reversible causes of cardiac arrest in a digital cognitive aid. In Proceedings of the 58th Annual Meeting of the Human Factors and Ergonomics Society, 788--792.",
      "doi": ""
    },
    {
      "text": "Daniel Reinhardt, Ann-Kathrin Kraft, Mortiz Albert, Tobias Grundgeiger, Oliver Happel, Andreas Steinisch, and Thomas Wurmb. 2015. A tablet-based documentation tool for in-hospital resuscitations. In Proceedings of the 59th Annual Meeting of the Human Factors and Ergonomics Society, 531--535.",
      "doi": ""
    },
    {
      "text": "Aleksandra Sarcevic, Brett J. Rosen, Leah J. Kulp, Ivan Marsic, and Randall S. Burd. 2016. Design challenges in converting a paper checklist to digital format for dynamic medical settings. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare, 33--40. ",
      "doi": "10.5555/3021319.3021325"
    },
    {
      "text": "Aleksandra Sarcevic, Zhan Zhang, Ivan Marsic, and Randall S. Burd. 2016. Checklist as a memory externalization tool during a critical care process. AMIA Annu Symp Proc 2016: 1080--1089.",
      "doi": ""
    },
    {
      "text": "Jan Schmutz and Tanja Manser. 2013. Do team processes really have an effect on clinical performance? A systematic literature review. Br J Anaesth 110, 4: 529--544.",
      "doi": ""
    },
    {
      "text": "Christian M. Schulz, Mica R. Endsley, Eberhard F. Kochs, Adrian W. Gelb, and Klaus J. Wagner. 2013. Situation awareness in anesthesia concept and research. Anesthesiology 118, 3: 729--742.",
      "doi": ""
    },
    {
      "text": "Michael K. Scullin, M. A. Mcdaniel, and G. O. Einstein. 2010. Control of cost in prospective memory: evidence for spontaneous retrieval processes. J Exp Psychol Learn Mem Cogn 36, 1: 190--203.",
      "doi": ""
    },
    {
      "text": "Rebekah E. Smith, R. Reed Hunt, Jennifer C. Mcvay, and Melissa D. Mcconnell. 2007. The cost of event-based prospective memory: salient target events. J Exp Psychol Learn Mem Cogn 33, 4: 734--746.",
      "doi": ""
    },
    {
      "text": "Jasmeet Soar, Jerry P. Nolan, Bernd W. Böttiger, Gavin D. Perkins, Carsten Lott, Pierre Carli, Tommaso Pellis, Claudio Sandroni, Markus B. Skrifvars, Gary B. Smith, Kjetil Sunde, Charles D. Deakin, Rudolph W. Koster, Koenraad G. Monsieurs, and Nikolaos I. Nikolaou. 2015. European Resuscitation Council Guidelines for Resuscitation 2015. Resuscitation 95: 100--147.",
      "doi": ""
    },
    {
      "text": "Lillian Su, Mary Waller, Seth Kaplan, Anne Watson, Melissa Jones, and David L. Wessel. 2015. Cardiac resuscitation events: one eyewitness is not enough. Pediatr Crit Care Med 16, 4: 335342.",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman, 1987. Plans and situated actions: the problem of human-machine communication. Cambridge University Press, Cambridge; New York. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Jelle Van Dijk, Remko Van Der Lugt, and Caroline Hummels. 2014. Beyond distributed representation: embodied cognition design supporting socio-sensorimotor couplings. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14), 181--188.  ",
      "doi": "10.1145/2540930.2540934"
    },
    {
      "text": "Leslie Wu, Jesse Cirimele, Stuart Card, Scott Klemmer, Larry Chu, and Kyle Harrison. 2011. Maintaining shared mental models in anesthesia crisis care with nurse tablet input and largescreen displays. In Proceedings of the 24th Annual ACM Symposium Adjunct on User Interface Software and Technology, 71--72.  ",
      "doi": "10.1145/2046396.2046428"
    },
    {
      "text": "Leslie Wu, Jesse Cirimele, Kristen Leach, Stuart Card, Larry Chu, T. Kyle Harrison, and Scott R. Klemmer. 2014. Supporting crisis response with dynamic procedure aids. In Proceedings of the 2014 Conference on Designing Interactive Systems, 315324.  ",
      "doi": "10.1145/2598510.2598565"
    },
    {
      "text": "Zhan Zhang, Aleksandra Sarcevic, Maria Yala, and Randall S. Burd. 2014. Informing digital cognitive aids design for emergency medical work by understanding paper checklist use. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP'14), 204--214.  ",
      "doi": "10.1145/2660398.2660423"
    }
  ]
}